[{"title": "Tyler Cowen: Economic Growth & the Fight Against Conformity & Mediocrity | Lex Fridman Podcast #174", "id": "7Grseeycor4", "quotes": [{"time": 309, "text": "Probably not in your lifetime."}, {"time": 312, "text": "But the chance presumably increases the cheaper weapons of mass destruction are."}, {"time": 318, "text": "So the Poisson process description doesn't take in consideration the game theoretic aspect."}, {"time": 324, "text": "So another way to consider is repeated games, iterative games."}, {"time": 329, "text": "So is there something about our human nature that allows us to fight against probability?"}, {"time": 337, "text": "Reduce, like the closer we get to trouble, the more we're able to figure out how to avoid trouble."}, {"time": 343, "text": "The same thing is for when you take exams or you go and take classes, the closer or paper deadlines, the closer you get to a deadline, the better you start to perform and get your shit together and actually get stuff done."}, {"time": 356, "text": "I'm really not so negative on human nature."}, {"time": 358, "text": "And as an economist, I very much see the gains from cooperation."}, {"time": 362, "text": "But if you just ask, are there outliers in history?"}, {"time": 365, "text": "Like was there a Hitler, for instance?"}, {"time": 368, "text": "And again, you let the clock tick, another Hitler with nuclear weapons, doesn't per se care about his own destruction, it will happen."}, {"time": 376, "text": "So your sense is fundamentally people are good, but outliers happen."}, {"time": 381, "text": "A trembling hand equilibrium is what we would call it."}, {"time": 383, "text": "Trembling hand equilibrium?"}, {"time": 385, "text": "That the basic logic is for cooperation, which is mostly what we've seen, even between enemies."}, {"time": 392, "text": "But every now and then someone does something crazy and you don't know how to react to it."}, {"time": 396, "text": "And you can't always beat Hitler."}, {"time": 399, "text": "Sometimes Hitler drags you down."}, {"time": 401, "text": "To push back, is it possible that the crazier the person, the less likely they are, and in a way where we're safe, meaning like, this is the kind of proposition, I had the discussion with my dad as a physicist about this, where he thinks that like if you have a graph, like evil people can't also be geniuses."}, {"time": 428, "text": "So this is his defense why evil people will not get control of nuclear weapons, because to be truly evil."}, {"time": 435, "text": "But evil meaning sort of, you can argue that, not even the evil of Hitler we're talking about, because Hitler had a kind of view of Germany and all those kinds of, there's like, he probably deluded himself and the people around him to think that he's actually doing good for the world, similar with Stalin and so on."}, {"time": 453, "text": "By evil, I mean more like almost like terrorists to where they wanna destroy themselves and the world."}, {"time": 459, "text": "Like those people will never be able to be actually skilled enough to do, to deliver that kind of mass scale destruction."}, {"time": 467, "text": "So the hope is that it's very unlikely that the kind of evil that would lead to extinctions of humans or mass destruction is so unlikely that we're able to last way longer than some 100, 800 years."}, {"time": 484, "text": "It's very unlikely."}, {"time": 486, "text": "In that sense, I accept the argument, but that's why you need to let the clock tick."}, {"time": 490, "text": "It's also the best argument for bureaucracy."}, {"time": 493, "text": "To negotiate a bureaucracy, it actually selects against pure evil because you need to build alliances."}, {"time": 498, "text": "So bureaucracy in that regard is great, right?"}, {"time": 501, "text": "It keeps out the worst apples."}, {"time": 503, "text": "But look, put it this way, could you imagine 35 years from now, the Osama bin Laden of the future has nukes or very bad bio weapons?"}, {"time": 512, "text": "It seems to me you can."}, {"time": 514, "text": "And Osama was pretty evil."}, {"time": 516, "text": "And actually even he failed, right?"}, {"time": 518, "text": "But nonetheless, that's what the 700 or 800 years is there for."}, {"time": 522, "text": "And there might be destructive technologies that don't have such a high cost of production or such a high learning curve."}, {"time": 530, "text": "Like cyber attacks or artificial intelligence, all those kinds of things."}, {"time": 536, "text": "I mean, let me ask you a question."}, {"time": 537, "text": "Let's say you could as an act of will, by spending a million dollars, obliterate any city on earth and everyone in it dies."}, {"time": 545, "text": "And you'll get caught and you'll be sentenced to death, but you can make it happen just by willing it."}, {"time": 550, "text": "How many months does it take before that happens?"}, {"time": 555, "text": "So the obvious answer is like very soon."}, {"time": 558, "text": "There's probably a good answer for that because you can consider how many millionaires there are, how many you could look at that, right?"}, {"time": 563, "text": "I have a sense that there's just people that have a million dollars."}, {"time": 570, "text": "I mean, there's a certain amount, but have a million dollars, have other interests that will outweigh the interest of destroying an entire city."}, {"time": 582, "text": "Like there's a particular, like, I mean, maybe that's a hope."}, {"time": 586, "text": "It's why we should be nice to the wealthy too, right?"}, {"time": 591, "text": "Yeah, all that trash talking as Bill Gates, we should stop that because that doesn't inspire the other future Bill Gates is to be nice to the world."}, {"time": 601, "text": "But your sense is the cheaper it gets to destroy the world, the more likely it becomes."}, {"time": 607, "text": "Now, when I say destroy the world, there's a trick in there."}, {"time": 609, "text": "I don't think literally every human will die, but it would set back civilization by an extraordinary degree."}, {"time": 616, "text": "It's then just hard to predict what comes next."}, {"time": 619, "text": "But a catastrophe where everyone dies, that probably has to be something more like an asteroid or supernova."}, {"time": 626, "text": "And those are purely exogenous for the time being, at least."}, {"time": 629, "text": "So I immigrated to this country."}, {"time": 632, "text": "I was born in the Soviet Union in Russia and..."}, {"time": 637, "text": "I guess it's an important question."}, {"time": 639, "text": "You were born in the Soviet Union, right?"}, {"time": 641, "text": "Yes, I was born in the Soviet Union."}, {"time": 643, "text": "The rest is details, but I grew up in Moscow, Russia."}, {"time": 647, "text": "But I came to this country, and this country even back there, but it's always symbolized to me a place of opportunity where everybody could build the most incredible things, especially in the engineering side of things."}, {"time": 663, "text": "Just invent and build and scale and have a huge impact on the world."}, {"time": 668, "text": "And that's been, to me, the... That's my version of the American ideal, the American dream."}, {"time": 674, "text": "Do you think the American dream is still there?"}, {"time": 680, "text": "Do you think... What do you think of that notion in itself, like from an economics perspective, from a human perspective, is it still alive?"}, {"time": 688, "text": "And how do you think about it?"}, {"time": 690, "text": "The American dream."}, {"time": 690, "text": "The American dream is mostly still there."}, {"time": 693, "text": "If you look at which groups are the highest earners, it is individuals from India and individuals from Iran, which is a fairly new development."}, {"time": 703, "text": "Great for them, not necessarily easy."}, {"time": 705, "text": "Both you could call persons of color, may have faced discrimination, also on the grounds of religion, yet they've done it."}, {"time": 714, "text": "It says great things about America."}, {"time": 716, "text": "Now, if you look at native born Americans, the story's trickier."}, {"time": 720, "text": "People think intergenerational mobility has declined a lot recently, but it has not for native born Americans."}, {"time": 728, "text": "For about, I think, 40 years, it's been fairly constant, which is sort of good, but compared to much earlier times, it was much higher in the past."}, {"time": 739, "text": "I'm not sure we can replicate that, because look, go to the beginning of the 20th century, very few Americans finish high school, or even have much wealth."}, {"time": 747, "text": "There's not much credentialism."}, {"time": 749, "text": "There aren't that many credentials."}, {"time": 750, "text": "So there's more upward mobility across the generations than today."}, {"time": 755, "text": "And it's a good thing that we had it."}, {"time": 757, "text": "I'm not sure we should blame the modern world for not being able to reproduce that."}, {"time": 763, "text": "But look, the general issue of who gets into Harvard or Cornell?"}, {"time": 767, "text": "Is there an injustice?"}, {"time": 769, "text": "Should we fix that?"}, {"time": 770, "text": "Is there too little opportunity for the bottom, say, half of Americans?"}, {"time": 775, "text": "It's a disgrace how this country has evolved in that way."}, {"time": 778, "text": "And in that sense, the American dream is clearly ailing."}, {"time": 781, "text": "But it has had problems from the beginning, for blacks, for women, for many other groups."}, {"time": 787, "text": "I mean, isn't that the whole challenge of opportunity and freedom is that it's hard, and the difficulty of how hard it is to move up in society is unequal often, and that's the injustice of society."}, {"time": 800, "text": "But the whole point of that freedom is that over time, it becomes better and better."}, {"time": 805, "text": "You start to fix the leaks, the issues, and it keeps progressing in that kind of way."}, {"time": 815, "text": "But ultimately, there's always the opportunity, even if it's harder, there's the opportunity to create something truly special, to move up, to be president, to be a leader in whatever the industry that you're passionate about."}, {"time": 829, "text": "We each have podcasts, right, in English."}, {"time": 831, "text": "The value of joining that American English language network is much higher today than it was 30 years ago, mostly because of the internet."}, {"time": 840, "text": "So that makes immigration returns themselves skewed."}, {"time": 843, "text": "So going to the US, Canada, or the UK, I think has become much more valuable in relative terms than, say, going to France, which is still a pretty well off, very nice country."}, {"time": 856, "text": "If you had gone to France, your chance of having a globally known podcast would be much smaller."}, {"time": 861, "text": "Yeah, this is the interesting thing about how much intellectual influence the United States has."}, {"time": 868, "text": "I don't know if it's connected to what we're discussing here, the freedom and opportunity of the American dream, or does it make any sense to you that we have so much impact on the rest of the world in terms of ideas?"}, {"time": 885, "text": "Is it just simply because English is the primary language of the world, or is there something fundamental to the United States that drives the development of ideas?"}, {"time": 895, "text": "It's almost like what's cool, what's entertaining, what's like meme culture, the internet culture, the philosophers, the intellectuals, the podcasts, the movies, music, all that stuff, driving culture."}, {"time": 913, "text": "There's something above and beyond language in the United States."}, {"time": 916, "text": "It's a sense of entertainment really mattering, how to connect with your audience, being direct and getting to the point, how humor is integrated even with science that is pretty strongly represented here, much more so than on the European continent."}, {"time": 932, "text": "Britain has its own version of this, which it does very well, and not surprisingly, they're hugely influential in music, comedy, most of the other areas you mentioned."}, {"time": 941, "text": "Canada, yes, but their best talent tends to come here, but you could say it's like a broader North American thing and give them their fair share of credit."}, {"time": 950, "text": "What about science?"}, {"time": 952, "text": "There's a sense higher education is really strong, research is really strong in the United States, but it just feels like, culturally speaking, when we zoom out, scientists aren't very cool here."}, {"time": 967, "text": "Most people wouldn't be able to name basically a single scientist."}, {"time": 971, "text": "Maybe they would say like, they would say what, like Einstein and Neil deGrasse Tyson maybe, and Neil deGrasse Tyson isn't exactly a scientist, he's a science communicator."}, {"time": 980, "text": "So there's not the same kind of admiration of science and innovators as there is of like, athletes or actors, actresses, musicians."}, {"time": 994, "text": "Well, you can become a celebrity scientist if you want to."}, {"time": 998, "text": "It may or may not be best for science."}, {"time": 1000, "text": "And we have Spock from Star Trek, who is still a big deal, but look at it this way."}, {"time": 1005, "text": "Which country is most comfortable with inegalitarian rewards for scientists, whether it's fame or money?"}, {"time": 1012, "text": "And I still think it's here."}, {"time": 1013, "text": "Some of that's just the tax rate."}, {"time": 1015, "text": "Some of it is a lot of America is set up for rich people to live really well."}, {"time": 1020, "text": "And again, that's going to attract a lot of top talent."}, {"time": 1022, "text": "And you ask like, the two best vaccines."}, {"time": 1025, "text": "I know the Pfizer vaccine is sort of from Germany, sort of from Turkey, but it's nonetheless being distributed through the United States."}, {"time": 1033, "text": "Moderna, an ethnic Armenian immigrant through Lebanon, first to Canada, then down here to Boston, Cambridge area."}, {"time": 1041, "text": "Those are incredible vaccines."}, {"time": 1042, "text": "And US nailed it."}, {"time": 1045, "text": "Yeah, well, that's more almost like the, I don't know what you would call it, engineering, the sort of scaling."}, {"time": 1052, "text": "That's what US is really good at, not just inventing of ideas, but taking an idea and actually building the thing and scaling it and being able to distribute it at scale."}, {"time": 1062, "text": "I think some people would attribute that to the general word of capitalism."}, {"time": 1069, "text": "I don't know if you would."}, {"time": 1072, "text": "What in your views are the pros and cons of capitalism as it's implemented in America?"}, {"time": 1079, "text": "I don't know if you would say capitalism really exists in America, but to the extent that it does."}, {"time": 1084, "text": "People use the word capitalism in so many different ways."}, {"time": 1088, "text": "What is capitalism?"}, {"time": 1089, "text": "The literal meaning is private ownership of capital goods, which I favor in most areas."}, {"time": 1095, "text": "But no, I don't think the private sector should own our F16s or military assets."}, {"time": 1100, "text": "Government owned water utilities seem to work as well as privately owned water utilities."}, {"time": 1106, "text": "But with all those qualifications put to the side, business, for the most part, innovates better than government."}, {"time": 1115, "text": "It is oriented toward consumer services."}, {"time": 1118, "text": "The biggest businesses tend to pay the highest wages."}, {"time": 1121, "text": "Business is great at getting things done."}, {"time": 1123, "text": "USA is fundamentally a nation of business and that makes us a nation of opportunity."}, {"time": 1129, "text": "So I am indeed mostly a fan."}, {"time": 1131, "text": "Subject to numerous caveats."}, {"time": 1134, "text": "What's the con?"}, {"time": 1136, "text": "What are some negative downsides of capitalism in your view or some things that we should be concerned about maybe for longterm impacts of capitalism?"}, {"time": 1147, "text": "Again, capitalism takes a different form in each country."}, {"time": 1150, "text": "I would say in the United States, our weird blend of whatever you want to call it has had an enduring racial problem from the beginning, has been a force of taking away land from Native Americans and oppressing them pretty much from the beginning."}, {"time": 1170, "text": "It has done very well by immigrants for the most part."}, {"time": 1175, "text": "We revel in championitarian creative destruction more."}, {"time": 1178, "text": "So we don't just prop up national champions forever."}, {"time": 1182, "text": "And there's a precariousness to life for some people here that is less so say in Germany or the Netherlands."}, {"time": 1188, "text": "We have weaker communities in some regards than say Northwestern Europe often would."}, {"time": 1194, "text": "That has pluses and minuses."}, {"time": 1195, "text": "I think it makes us more creative."}, {"time": 1197, "text": "It's a better country in which to be a weirdo than say Germany or Denmark."}, {"time": 1202, "text": "But there is truly, whether from the government or from your private community, there is less social security in some fundamental sense."}, {"time": 1210, "text": "On the point of weirdo, what, that's kind of a beautiful little statement."}, {"time": 1219, "text": "I mean, that seems to be, you know, you could think of a guy like Elon Musk and say that he's a weirdo."}, {"time": 1225, "text": "Is that the sense in which you're using weirdo like outside of the norm, like breaking conventions?"}, {"time": 1231, "text": "And here that is either acceptable or even admired or to be a loner."}, {"time": 1236, "text": "And since so many people are outsiders and that we're all immigrants is selecting for people who left something behind, we're willing to leave behind their families, we're willing to undergo a certain brutality of switch in their lives, makes us a nation of weirdos and weirdos are creative."}, {"time": 1255, "text": "And Denmark is not a nation of weirdos."}, {"time": 1258, "text": "It's a wonderful place, you know, great for them."}, {"time": 1261, "text": "Ideally you want part of the world to be full of weirdos and innovating."}, {"time": 1264, "text": "And the other part of the world to be a little kind of chicken shit, risk averse and enjoy the benefit to the innovation and to give people these smooth lives and six weeks off and free ride."}, {"time": 1276, "text": "And everyone's like, oh, American way versus European way, but basically they're compliments."}, {"time": 1282, "text": "I used to have this conversation with my like parents when I was growing up and just others from the immigrant kind of flow."}, {"time": 1289, "text": "And they use this term, especially in Russian is, you know, to criticize something I was doing, that was suggest, you know, normal people don't do this."}, {"time": 1301, "text": "And I used to be really offended by that, but, you know, as I got older, I realized that that's a kind of compliment because in the same kind of, I would say, way that you're saying that is the American ideal, because if you want to do anything special or interesting, you don't want to be doing in one particular avenue what normal people do, because that won't be interesting."}, {"time": 1332, "text": "Russians, I think fit in very well here because the ones who come are weirdos."}, {"time": 1336, "text": "And there's a very different Russian weirdo tradition like Alyosha, right?"}, {"time": 1340, "text": "And by this card, I miss off."}, {"time": 1341, "text": "Or Perelman, the mathematician, they're weirdos."}, {"time": 1345, "text": "And they have their own different kind of status in Soviet Union, Russia, wherever."}, {"time": 1350, "text": "And when Russians come to America, they stay pretty Russian, but it seems to me a week later, they've somehow adjusted."}, {"time": 1358, "text": "And the ways in which they might want to be like grumpier than Americans, not smile, think that people who smile are idiots, like they can do that."}, {"time": 1365, "text": "No one takes that away from them."}, {"time": 1368, "text": "What are you, on a tiny tangent, I'd love to hear if you have thoughts about Grisha Perelman turning down the Fields Medal."}, {"time": 1377, "text": "Is that something you admire?"}, {"time": 1379, "text": "Does that make sense to you that somebody, you know, with the structure of Nobel Prizes, of these huge awards, of the reputations, the hierarchy of everyone saying, applauding, how special you are, and here's a person who was doing one of the greatest accomplishments in the history of mathematics."}, {"time": 1396, "text": "It doesn't want the stupid prize and doesn't want recognition, doesn't want to do interviews, it doesn't want to be famous."}, {"time": 1404, "text": "Look, prizes are corrupting."}, {"time": 1406, "text": "After scientists win Nobel Prizes, they tend to become less productive."}, {"time": 1411, "text": "Now, statistically, it's hard to sort out the different effects."}, {"time": 1413, "text": "There's aggression toward the mean."}, {"time": 1415, "text": "Does the prize make you too busy?"}, {"time": 1416, "text": "It's a little tricky, but."}, {"time": 1418, "text": "There's not enough Nobel Prizes either to gather enough data."}, {"time": 1421, "text": "Right, but I've known a lot of Nobel Prize winners, and it is my sense they become less productive."}, {"time": 1427, "text": "They repeat more of their older messages, which may be highly socially valuable, but if someone wants to turn their back on that and keep on working, which I assume is what he's doing, that's awesome."}, {"time": 1439, "text": "I mean, we should respect that."}, {"time": 1441, "text": "It's like he wins a bigger prize, right?"}, {"time": 1442, "text": "Our extreme respect."}, {"time": 1447, "text": "Grisha, if you're listening, I need to talk to you soon."}, {"time": 1451, "text": "I've been trying to get ahold of him."}, {"time": 1457, "text": "Back to capitalism."}, {"time": 1458, "text": "I gotta ask you, just competition in general, in this world of weirdos, is competition good for the world?"}, {"time": 1464, "text": "This kind of seems to be one of the fundamental engines of capitalism, right?"}, {"time": 1471, "text": "Do you see it as ultimately constructive or destructive for the world?"}, {"time": 1474, "text": "What really matters is how good your legal framework is."}, {"time": 1477, "text": "So competition within nature for food leads to bloody conflict all the time."}, {"time": 1482, "text": "The animal world is quite unpleasant, to say the least."}, {"time": 1486, "text": "If you have something like the rule of law and clearly defined property rights, which are within reason justly allocated, competition probably is gonna work very well."}, {"time": 1498, "text": "But it's not an unalloyed good thing at all."}, {"time": 1501, "text": "It can be highly destructive."}, {"time": 1502, "text": "Military competition, right?"}, {"time": 1505, "text": "Which actually is itself sometimes good, but it's not good per se."}, {"time": 1509, "text": "What aspects of life do you think we should protect from competition?"}, {"time": 1513, "text": "Is there some, you said like the rule of law, is there some things we should keep away from competition?"}, {"time": 1519, "text": "Well, the fight for territory, most of all, right?"}, {"time": 1522, "text": "So violence, anything that involves like actual physical violence."}, {"time": 1525, "text": "Right, and it's not that I think the current borders are just."}, {"time": 1528, "text": "I mean, go talk to Hungarians, Romanians, Serbians, Bosnians, they'll talk your ear off."}, {"time": 1534, "text": "And some of them are probably right."}, {"time": 1536, "text": "But at the end of the day, we have some kind of international order."}, {"time": 1540, "text": "And I would rather we more or less stick with it."}, {"time": 1544, "text": "If Catalonians wanna leave, they keep up with it, let them go, but."}, {"time": 1548, "text": "What about a space of like healthcare?"}, {"time": 1550, "text": "This is where you get into a tension of like between capitalism and kind of more, I don't wanna use socialism, but those kinds of policies that are less free market."}, {"time": 1562, "text": "I think in this country, healthcare should be much more competitive."}, {"time": 1566, "text": "So you go to hospitals, doctors, they don't treat you like a customer."}, {"time": 1570, "text": "They treat you like an idiot or like a child or someone with third party payment."}, {"time": 1574, "text": "And it's a pretty humiliating experience often."}, {"time": 1579, "text": "Do you think a free market in general is possible?"}, {"time": 1582, "text": "Like a pure free market?"}, {"time": 1585, "text": "And is that a good goal to strive for?"}, {"time": 1588, "text": "I don't think the term pure free market's well defined because you need a legal order."}, {"time": 1593, "text": "Legal order has to make decisions on like what is intellectual property more important than ever."}, {"time": 1598, "text": "There's no benchmark that like represents the pure free market way of doing things."}, {"time": 1603, "text": "What will penalties be?"}, {"time": 1605, "text": "How much do we put into law enforcement?"}, {"time": 1607, "text": "No simple answers, but just saying free market doesn't pin down what you're gonna do on those all important questions."}, {"time": 1613, "text": "So free market is an economics, I guess, idea."}, {"time": 1616, "text": "So it's not possible for free market to generate the rules that are like emergent, like self governing?"}, {"time": 1623, "text": "It generates a lot of them, right?"}, {"time": 1625, "text": "Through private norms, through trade associations."}, {"time": 1628, "text": "International trade is mostly done privately and by norms."}, {"time": 1633, "text": "So it's certainly possible, but at the end of the day, I think you need governments to draw very clear lines to prevent it from turning into mafia run systems."}, {"time": 1644, "text": "You know, I've been hanging out with other group of weirdos, lately Michael Malice, who espouses to be an anarchist, anarchism, which is like, I think intellectually just a fascinating set of ideas, where taking free market to the full extreme of basically saying there should be no government, what is it?"}, {"time": 1674, "text": "Oversight, I guess, and then everything should be fully, like all the agreements, all the collectives you form should be voluntary, not based on the geographic land you were born on and so on."}, {"time": 1687, "text": "Do you think that's just a giant mess?"}, {"time": 1690, "text": "Like, do you think it's possible for an anarchist society to work where it's, you know, in a fully distributed way, people agree with each other, not just on financial transactions, but you know, on their personal security, on sort of military type of stuff, on healthcare, on education, all those kinds of things."}, {"time": 1714, "text": "And where does it break down?"}, {"time": 1715, "text": "Well, I wouldn't press a button to say get rid of our current constitution, which I view is pretty good and quite wise, but I think the deeper point is that all societies are in some regards anarchistic and we should take the anarchists seriously."}, {"time": 1729, "text": "So globally, there's a kind of anarchy across borders, even within federalistic systems, they're typically complex."}, {"time": 1737, "text": "There's not a clear transitivity necessarily of who has the final say over what, just the state vis a vis its people."}, {"time": 1745, "text": "There's not per se a final arbitrator in that regard."}, {"time": 1749, "text": "So you want a good anarchy rather than a bad anarchy."}, {"time": 1753, "text": "You wanna squish your anarchy into the right corners."}, {"time": 1755, "text": "And I don't think there's a theoretical answer how to do it, but you start with a country, like is it working well enough now?"}, {"time": 1763, "text": "This country, you'd say mostly, you'd certainly wanna make a lot of improvements."}, {"time": 1768, "text": "And that's why I don't wanna press that get rid of the constitution button, but to just dump on the anarchists is to miss the point."}, {"time": 1774, "text": "Always try to learn from any opinion."}, {"time": 1777, "text": "What in it is true?"}, {"time": 1779, "text": "I'm just like marveling at the poetry of saying that we should squish our anarchy into the right corners of it."}, {"time": 1788, "text": "Okay, I gotta ask, I've been talking with, since we're doing a whirlwind introduction to all of economics, I've been talking to a few objectivists recently and just, Ayn Rand comes up as a person, as a philosopher throughout many conversations."}, {"time": 1807, "text": "A lot of people really despise her."}, {"time": 1809, "text": "A lot of people really love her."}, {"time": 1811, "text": "It's always weird to me when somebody arouses a philosophy or a human being arouses that much emotion in either direction, does she make, do you understand, first of all, that level of emotion and what are your thoughts about Ayn Rand and her philosophy of objectivism?"}, {"time": 1826, "text": "Is it useful at all to think about this kind of formulation of a rational self interest, if I could put it in those words, or I guess more negatively the selfishness or she would put, I guess, the virtue of selfishness."}, {"time": 1846, "text": "Ayn Rand was a big influence on me growing up."}, {"time": 1849, "text": "The book that really mattered for me was Capitalism, The Unknown Ideal."}, {"time": 1853, "text": "The notion that wealth creates opportunity and good lives and wealth is something we ought to valorize and give very high status."}, {"time": 1861, "text": "It's one of her key ideas."}, {"time": 1862, "text": "I think it's completely correct."}, {"time": 1864, "text": "I think she has the most profound and articulate statement of that idea."}, {"time": 1868, "text": "That said, as a philosopher, I disagree with her on most things."}, {"time": 1872, "text": "And I did, even like as a boy, when I was reading her, I read Plato before Ayn Rand."}, {"time": 1877, "text": "And in a Socratic dialogue, there's all these different points of view being thrown around."}, {"time": 1882, "text": "And whomever it is you agree with, you understand the wisdom is in the coming together of the different points of view."}, {"time": 1888, "text": "And she doesn't have that."}, {"time": 1889, "text": "So altruism can be wonderful in my view."}, {"time": 1892, "text": "Humans are not actually that rational."}, {"time": 1895, "text": "Self interest is often poorly defined."}, {"time": 1898, "text": "To pound the table and say existence exists."}, {"time": 1901, "text": "I wouldn't say I disagree, but I'm not sure that it's a very meaningful statement."}, {"time": 1906, "text": "I think the secret to Ayn Rand is that she was Russian."}, {"time": 1909, "text": "I'd love to have her on my podcast if she was still alive."}, {"time": 1912, "text": "I'd only ask her about Russia, which she mostly never talked about after writing We the Living."}, {"time": 1917, "text": "And she is much more Russian than she seems at first, even like purging people from the objectivist circles."}, {"time": 1924, "text": "It's like how Russians, especially female Russians, so often purge their friends."}, {"time": 1929, "text": "It's weird, all the parallels."}, {"time": 1931, "text": "So you're saying, so yes, so assuming she's still not around, but if she is and she comes onto your podcast, can you dig into that a little bit?"}, {"time": 1941, "text": "Do you mean like her personal demons around the social and economic Russia of the time, when she escaped?"}, {"time": 1952, "text": "The traumas she suffered there, what she really likes in the music and literature and why."}, {"time": 1957, "text": "Music and literature, huh?"}, {"time": 1958, "text": "And getting deeply into that, her view of relations between the sexes and Russia, how it differs from America, why she still carries through the old Russian vision in her fiction, this extreme sexual dimorphism, but with also very strong women, to me is a uniquely, at least Eastern European vision, mostly Russian, I would say."}, {"time": 1980, "text": "And that's in her, that's her actual real philosophy, not this table bounding existence exists."}, {"time": 1986, "text": "And that's not talked about enough."}, {"time": 1987, "text": "She's a Russian philosopher."}, {"time": 1989, "text": "Or Soviet, whatever you wanna call it."}, {"time": 1992, "text": "And if she wasn't so certain, she could have been a Dostoevsky where it's not, that certainty is almost the thing that brings out the adoration of millions, but also the hatred of millions."}, {"time": 2005, "text": "She became a cult figure in a somewhat Russian like manner."}, {"time": 2012, "text": "But I love the idea that, again, you're just dropping bombs that are poetic, that the wisdom is in the coming together of ideas."}, {"time": 2020, "text": "It's kind of interesting to think that no one human possesses wisdom."}, {"time": 2026, "text": "No one idea is the wisdom."}, {"time": 2029, "text": "That the coming together is the wisdom."}, {"time": 2032, "text": "Like in my view, Boswell's Life of Johnson, 18th century British biography."}, {"time": 2036, "text": "It's in essence a coauthored work, Boswell and Johnson."}, {"time": 2039, "text": "It's one of the greatest philosophy books ever, though it is commonly regarded as a biography."}, {"time": 2045, "text": "John Stuart Mill, who in a sense was coauthoring with Harriet Taylor, better philosopher than is realized, though he's rated very, very highly."}, {"time": 2054, "text": "Plato slash Socrates, a lot of the greatest works are in a kind of dialogue form."}, {"time": 2059, "text": "Curtis Faust would be another example."}, {"time": 2063, "text": "It's very much a dialogue."}, {"time": 2064, "text": "And yes, it's drama, but it's also a philosophy."}, {"time": 2067, "text": "Shakespeare, maybe the wisest thinker of them all."}, {"time": 2071, "text": "In your book, Big Business, speaking of Ayn Rand, Big Business, A Love Letter to an American Antihero, you make the case for the benefit that large businesses bring to society."}, {"time": 2085, "text": "If you look at, say, the pandemic, which has been a catastrophic event, right, for many reasons, but who is it that saved us?"}, {"time": 2092, "text": "So Amazon has done remarkably well."}, {"time": 2096, "text": "They upped their delivery game more or less overnight with very few hitches."}, {"time": 2100, "text": "I've ordered hundreds of Amazon packages, direct delivery food, whether it's DoorDash or Uber Eats, or using Whole Foods through Amazon shipping."}, {"time": 2110, "text": "Again, it's gone remarkably well."}, {"time": 2112, "text": "Switching over our entire higher educational system, basically within two weeks, to Zoom."}, {"time": 2118, "text": "Zoom did it."}, {"time": 2119, "text": "I mean, I've had a Zoom outage, but their performance rate has been remarkably high."}, {"time": 2124, "text": "So if you just look at resources, competence, incentives, who's been the star performers, the NBA even, just canceling the season as early as they did, sending a message like, hey, people, this is real, and then pulling off the bubble with not a single found case of COVID and having all the testing set up in advance."}, {"time": 2145, "text": "Big business has done very well lately, and throughout the broader course of American history, in my view, has mostly been a hero."}, {"time": 2153, "text": "Can we engage in a kind of therapy session?"}, {"time": 2158, "text": "I'm often troubled by the negativity towards big business, and I wonder if you could help figure out how we remove that or maybe first psychoanalyze it and then how we remove it."}, {"time": 2172, "text": "It feels like once we've gotten wifi on flights, on airplane flights, people started complaining about how shady the connection is, right?"}, {"time": 2187, "text": "They take it for granted immediately and then start complaining about little details."}, {"time": 2191, "text": "Another example that's closer to, especially as an aspiring entrepreneur, is closer to the things I'm thinking about is Jack Dorsey with Twitter."}, {"time": 2205, "text": "To me, Twitter has enabled an incredible platform of communication, and yet the biggest thing that people talk about is not how incredible this platform is."}, {"time": 2218, "text": "They essentially use the platform to complain about the censorship of a few individuals as opposed to how amazing it is."}, {"time": 2226, "text": "Now, you should talk about how shady the wifi is and how censorship or the removal of Donald Trump from the platform is a bad thing, but it feels like we don't talk about the positive impacts at scale of these technologies."}, {"time": 2240, "text": "Can you explain why and is there a way to fix it?"}, {"time": 2243, "text": "I don't know if we can fix it."}, {"time": 2245, "text": "I think we are beings of high neuroticism for the most part as a personality trait."}, {"time": 2250, "text": "Not everyone, but most people."}, {"time": 2253, "text": "And as a compliment to that, if someone says 10 nice things about you and one insult, you're more bothered by the insult than you're pleased by the nice things, especially if the insult is somewhat true."}, {"time": 2263, "text": "So you have these media, these vehicles, Twitter is one you mentioned, where there's all kinds of messages going back and forth, and you're really bugged by the messages you don't like."}, {"time": 2273, "text": "Most people are neurotic to begin with."}, {"time": 2276, "text": "It's not only taken out on big business, to be clear."}, {"time": 2278, "text": "So Congress catches a lot of grief and some of it they deserve, yes."}, {"time": 2285, "text": "Religion is not attacked the same way, but religiosity is declining."}, {"time": 2289, "text": "If you poll people, the military still polls quite well, but people are very disillusioned with many things."}, {"time": 2297, "text": "And the Martin Gury thesis that because of the internet, you just see more of things."}, {"time": 2301, "text": "And the more you see of something, whether it's good, bad, or in between, the more you will find to complain about, I suspect is the fundamental mechanism here."}, {"time": 2310, "text": "I mean, look at Clubhouse, right?"}, {"time": 2312, "text": "To me, it's a great service, may or may not be like my thing, but gives people this opportunity."}, {"time": 2317, "text": "No one makes you go on it."}, {"time": 2319, "text": "And all these media articles like, oh, is Clubhouse gonna wreck things?"}, {"time": 2322, "text": "Are they gonna break things?"}, {"time": 2324, "text": "New York Times is complaining."}, {"time": 2325, "text": "Of course, it's their competitor as well."}, {"time": 2328, "text": "I'm like, give these people a chance, talk it up."}, {"time": 2330, "text": "You may or may not like it."}, {"time": 2332, "text": "Let's praise the people who are getting something done."}, {"time": 2335, "text": "Very Ayn Randian point."}, {"time": 2337, "text": "As an economic thinker, as a writer, as a podcaster, what do you think about Clubhouse?"}, {"time": 2343, "text": "What do you think about..."}, {"time": 2346, "text": "Okay, let me just throw my feeling about it."}, {"time": 2349, "text": "I used to use Discord, which is another service where people use voice."}, {"time": 2353, "text": "So the only thing you do is just hear each other."}, {"time": 2356, "text": "There's no face, you just see a little icon."}, {"time": 2359, "text": "That's the essential element of Clubhouse."}, {"time": 2363, "text": "And there's an intimacy to voice only communication."}, {"time": 2367, "text": "That didn't make sense to me, but it was just what it is, which feels like something that won't last for some reason, maybe it's the cynical view."}, {"time": 2376, "text": "But what's your sense about the intimacy of what's happening right now with Clubhouse?"}, {"time": 2383, "text": "I've greatly enjoyed what I've done, but I'm not sure it's for me in the long run for two reasons."}, {"time": 2388, "text": "First, if you compare it to doing a podcast, podcasting has greater reach than Clubhouse."}, {"time": 2395, "text": "So I would rather put time into my podcast."}, {"time": 2398, "text": "But then also my core asset, so to speak, is I'm a very fast reader."}, {"time": 2404, "text": "So audio per se is not necessarily to my advantage."}, {"time": 2408, "text": "I don't speak or listen faster than other people."}, {"time": 2410, "text": "In fact, I'm a slower listener because I like 1.0, not 1.5X."}, {"time": 2415, "text": "So I should spend less time on audio and more time reading and writing."}, {"time": 2418, "text": "Yeah, it's interesting because you mentioned podcasts and audio books, the podcasts are recorded and so I can skip things, like I can skip commercials, or I can skip parts where it's like, ugh, this part is boring."}, {"time": 2436, "text": "With live conversations, especially when, there's a magic to the fact when you have a lot of people participating in that conversation, but some people are like, ugh, this topic, they're going into this thing and you can't skip it or you can't fast forward, you can go 1.5X or 2X, you can't speed it up."}, {"time": 2456, "text": "Nevertheless, there's a tension between that, so that's the productivity aspect, with the actual magic of live communication, where anything can happen, where Elon Musk can ask the CEO of Robinhood, Vlad, about like, hey, somebody holding a gun to your head, there's something shady going on, the magic of that."}, {"time": 2476, "text": "That's also my criticism of like, there's been a recent conversation with Bill Gates that he won a platform and had a regular interview on the platform without allowing the possibility of the magic of the chaos."}, {"time": 2492, "text": "So I'm not exactly sure, it's probably not the right platform for you and for many other people who are exceptionally productive in other places, but there's still nevertheless a magic to the chaos that can be created with live conversation that gives me pause."}, {"time": 2507, "text": "Maybe what it's perfect for is the tribute."}, {"time": 2510, "text": "So they had an episode recently that I didn't hear, but I heard it was wonderful."}, {"time": 2514, "text": "It was anecdotes about Steve Jobs."}, {"time": 2516, "text": "That you can't do one to one, right?"}, {"time": 2518, "text": "And you don't want control."}, {"time": 2519, "text": "You want different people appearing and stepping up and saying their bit."}, {"time": 2523, "text": "And Clubhouse is 110% perfect for that."}, {"time": 2527, "text": "The tribute."}, {"time": 2528, "text": "I love that, the tribute."}, {"time": 2530, "text": "But there's also the possibility, I think there was a time when somebody arranged a conversation with Steve Jobs and Bill Gates on stage."}, {"time": 2538, "text": "I remember that happened a long time ago."}, {"time": 2542, "text": "And it was very formal."}, {"time": 2546, "text": "It could have probably gone better, but it was still magical to have these people that obviously had a bunch of tension throughout their history."}, {"time": 2555, "text": "It's so frictionless to have two major figures in world history just jump on a Clubhouse stage."}, {"time": 2562, "text": "Putin and Elon Musk."}, {"time": 2565, "text": "And that's exactly it."}, {"time": 2567, "text": "So there's a language barrier there."}, {"time": 2568, "text": "There's also the problem that in particular, it's like Biden would have a similar problem."}, {"time": 2575, "text": "It's like they're just not into a new technology."}, {"time": 2578, "text": "So it's very hard to catch the Kremlin up to, first of all, Twitter, but to catch them up to Clubhouse, you have to have the, Elon Musk has a sense of the internet, the humor, the memes, and all that kind of stuff that you have to have in order to use a new app and figure out the timing, the beat, what is this thing about?"}, {"time": 2599, "text": "So that's the challenge there."}, {"time": 2600, "text": "But that's exactly it."}, {"time": 2601, "text": "That magic of have two big personalities just show up."}, {"time": 2607, "text": "And I wonder if it's just the temporary thing that we're going through with the pandemic where people are just lonely and they're seeking for that human connection that we usually get elsewhere through our work."}, {"time": 2620, "text": "But they'll stay lonely, in my opinion."}, {"time": 2624, "text": "So it is a pandemic thing, but I think it will persist."}, {"time": 2628, "text": "And the idea of wanting to be connected to more of the world, Clubhouse will still offer that."}, {"time": 2633, "text": "And all the mental health issues out there, a lot of people have broken ties and they will still be lonely post vaccines."}, {"time": 2642, "text": "Yeah, I, from an artificial intelligence perspective, have a sense that there is like a deep loneliness in the world, that all of us are really lonely."}, {"time": 2653, "text": "Like we don't even acknowledge it."}, {"time": 2654, "text": "Even people in happy relationships, it feels like there's like an iceberg of loneliness in all of us, like seeking to be understood, like deeply understood, understanding us, like having somebody with whom you can have a deep interaction enough to where you can, they can help you to understand yourself and they also understand you."}, {"time": 2676, "text": "Like I have a sense that artificial intelligence systems can provide that as well, but humans, I think crave that from other humans in ways that we perhaps don't acknowledge."}, {"time": 2686, "text": "And I have a hope that technology will enable that more and more, like Clubhouse is an example that allows that."}, {"time": 2692, "text": "Are touring bots gonna out compete Clubhouse?"}, {"time": 2694, "text": "Like why not sort of program your own session?"}, {"time": 2697, "text": "You'll just talk into your device and say here's the kind of conversation I want and it will create the characters for you."}, {"time": 2704, "text": "And it may not be as good as Elon and Vladimir Putin, but it will be better than ordinary Clubhouse."}, {"time": 2709, "text": "Yeah, and one of the things that's missing, it's not just conversation, it's memory."}, {"time": 2714, "text": "So longterm memories, what current AI systems don't have is sharing experience together."}, {"time": 2721, "text": "Forget the words, it's like sharing the highs and the lows of life together and the systems around us remembering that."}, {"time": 2729, "text": "Remembering we've been through that."}, {"time": 2731, "text": "Like that's the thing that creates really close relationships, is going through some shit."}, {"time": 2735, "text": "Like struggle."}, {"time": 2737, "text": "If you survive together, there's something really difficult that bonds you with other humans."}, {"time": 2742, "text": "And this is related to immigration and the American dream."}, {"time": 2746, "text": "In what way?"}, {"time": 2747, "text": "The people who have come to this country, however weird and different they may be, they or their ancestors at some point probably have shared this thing."}, {"time": 2758, "text": "Right, US is not gonna split up."}, {"time": 2760, "text": "It may get more screwed up as a country, but Texas and California are not gonna break off."}, {"time": 2765, "text": "I mean, they're big enough where they could do it, but it's just never gonna happen."}, {"time": 2768, "text": "We've been through too much together."}, {"time": 2771, "text": "Yeah, that's a hopeful message."}, {"time": 2774, "text": "Do you think, some people have talked to Eric Weinstein, you've talked to Eric Weinstein."}, {"time": 2780, "text": "He has a sense that growth, like the entirety of the American system is based on the assumption that we're gonna grow forever, that the economy's gonna grow forever."}, {"time": 2790, "text": "Do you think economic growth will continue indefinitely?"}, {"time": 2795, "text": "Or will we stagnate?"}, {"time": 2797, "text": "I've long been in agreement with Eric, Peter Thiel, Robert Gordon and others, that growth has slowed down."}, {"time": 2805, "text": "I argued that in my book, The Great Stagnation, appropriately titled."}, {"time": 2809, "text": "But the last two years, I've become much more optimistic."}, {"time": 2812, "text": "I've seen a lot of breakthroughs in green energy and battery technology."}, {"time": 2816, "text": "mRNA vaccines and medicine is a big deal already."}, {"time": 2820, "text": "It will repair our GDP and save millions of lives around the world."}, {"time": 2825, "text": "There's an anti malaria vaccine that's now in stage three trial, it probably works."}, {"time": 2830, "text": "CRISPR to defeat sickle cell anemia."}, {"time": 2833, "text": "Just space, area after area after area, there's suddenly the surge of breakthroughs."}, {"time": 2838, "text": "I would say many of them rooted in superior computation and ultimately Moore's law and access to those computational abilities."}, {"time": 2846, "text": "So I'm much more optimistic than say, the last time I spoke to Eric."}, {"time": 2850, "text": "I don't know, he moves all the time in his views."}, {"time": 2852, "text": "I don't know where he's going."}, {"time": 2854, "text": "His views, I don't know where he's at now."}, {"time": 2855, "text": "He's not at, he hasn't gained, that's really interesting."}, {"time": 2858, "text": "So your little drop of optimism comes from like, there might be a fundamental shift in the kind of things that computation has unlocked for us in terms of like, it could be a wellspring of innovation that enables growth for a long time to come."}, {"time": 2875, "text": "Like Eric has not quite connected to the computation aspect yet to where it could be a wellspring of innovation."}, {"time": 2884, "text": "But you're very close to it in your own work."}, {"time": 2886, "text": "I don't have to tell you that."}, {"time": 2887, "text": "The work you're doing would not have been possible not very long ago."}, {"time": 2891, "text": "But the question is, how much does that work enable continued growth for decades to come?"}, {"time": 2896, "text": "For all their problems, some version of driverless vehicles will be a thing."}, {"time": 2900, "text": "I'm not sure when, you know much better than I do."}, {"time": 2903, "text": "Maybe only partially, but that too will be a big deal."}, {"time": 2906, "text": "Well, one of the open questions that sort of the Peter Thiel School area of ideas is how much can be converted to technology?"}, {"time": 2916, "text": "How much, how many parts of our lives can technology integrate and then innovate?"}, {"time": 2920, "text": "Like can it replace healthcare?"}, {"time": 2923, "text": "Can it replace the legal system?"}, {"time": 2926, "text": "Can it replace government?"}, {"time": 2927, "text": "Not replace, but like, you know, make it digital and thereby enable computation to improve it, right?"}, {"time": 2937, "text": "That's the open question, because many aspects of our lives are still not really that digitized."}, {"time": 2946, "text": "There was a New York Times symposium in April, which is not long ago."}, {"time": 2949, "text": "And they asked the so called experts, when are we gonna get vaccines?"}, {"time": 2953, "text": "And the most optimistic answer was in four years."}, {"time": 2957, "text": "And obviously we beat that by a long mile."}, {"time": 2961, "text": "So I think people still haven't woken up."}, {"time": 2963, "text": "You mentioned my tiny drop of optimism, but it's a big drop of optimism."}, {"time": 2967, "text": "Is it a waterfall yet?"}, {"time": 2968, "text": "I mean, is it just?"}, {"time": 2970, "text": "Well, here's my pessimism."}, {"time": 2972, "text": "Whenever there are major new technologies, they also tend to be used for violence directly or indirectly, radio, Hitler."}, {"time": 2979, "text": "Not that he hit people over the head with radios, but it enabled the rise of various dictators."}, {"time": 2984, "text": "So the new technologies now, whatever exactly they may be, they're gonna cause a lot of trouble."}, {"time": 2990, "text": "And that's my pessimism."}, {"time": 2991, "text": "Not that I think they're all gonna slow to a trickle."}, {"time": 2994, "text": "When was the stagnation book?"}, {"time": 2999, "text": "It was the first of the stagnation books, in fact."}, {"time": 3005, "text": "But even then I said, this is temporary."}, {"time": 3007, "text": "And I was predicting it would be gone in about 20 years time."}, {"time": 3012, "text": "I'm not sure that's exactly the right prediction, like 2030, but I think we're actually gonna beat that."}, {"time": 3019, "text": "So you think United States might still be on top of the world for the rest of the century in terms of its economic growth, impact on the world, scientific innovation, all those kinds of things?"}, {"time": 3029, "text": "That's too long to predict, but I'm bullish on America in general."}, {"time": 3036, "text": "Speaking of being bullish on America, the opposite of that is, we talked about capitalism, we talked about Iran and her Russian roots."}, {"time": 3047, "text": "What do you think about communism?"}, {"time": 3051, "text": "Why doesn't it work?"}, {"time": 3053, "text": "Is it the implementation?"}, {"time": 3058, "text": "Is there anything about its ideas that you find compelling?"}, {"time": 3061, "text": "Or is it just a fundamentally flawed system?"}, {"time": 3066, "text": "Well, communism is like capitalism."}, {"time": 3068, "text": "The words mean many things to different people."}, {"time": 3070, "text": "You could argue my life as a tenured professor comes closer to communism than anything the human race has seen."}, {"time": 3076, "text": "And I would argue it works pretty well."}, {"time": 3079, "text": "But look, if you mean the Soviet Union, it devolved pretty quickly to a kind of decentralized set of incentives that were destructive rather than value maximizing."}, {"time": 3090, "text": "It wasn't even central planning, much less communism."}, {"time": 3094, "text": "So Paul Craig Roberts and Polanyi were correct in their descriptions of the Soviet system."}, {"time": 3099, "text": "Think of it as weird mixes of barter and malfunctioning incentives and being very good at a whole bunch of things, but in terms of progress, innovation, and consumer goods, it really being quite a failure."}, {"time": 3114, "text": "And now I wouldn't call that communism, but that's what I think of the system the Soviets had."}, {"time": 3147, "text": "And that, of course, did not prove sustainable."}, {"time": 3151, "text": "And so it's, what is it, a momentum of bureaucracy or something like that, it just builds up where you lose control of the original vision, and that naturally happens, it's just people."}, {"time": 3160, "text": "And you can't use normal profit and loss and price incentives, so you get all prices or most prices set too low, right?"}, {"time": 3166, "text": "Shortages everywhere, people trade favors, you have this culture of bartered bribes, sexual favors or family friends, and you get more and more of that, and you over time lose more and more of the information and the prices and quantities and practices and norms you had, and that sort of slowly decays, and then by the end no one is believing in it."}, {"time": 3189, "text": "That would be my take, but again, you're the expert here."}, {"time": 3192, "text": "The Russian scholar, well, I'm perhaps no more an expert than Ayn Rand, it's more personal than it is scholarly or historic."}, {"time": 3205, "text": "So Stalin held power for 30 years, Vladimir Putin has held power for 21 years, where you could argue he took a little break."}, {"time": 3216, "text": "But not much, he was still holding power, I think."}, {"time": 3219, "text": "And it's still possible now with the new constitution that he could hold power from longer than Stalin, longer than 30 years."}, {"time": 3228, "text": "What do you think about the man, the state of affairs in Russia, in general, the system they have there?"}, {"time": 3237, "text": "Is there something interesting to you as an economist, as a human being, about Russia?"}, {"time": 3242, "text": "Everything is interesting."}, {"time": 3243, "text": "I mean, here would be part of my take."}, {"time": 3245, "text": "As you know, the Russian economy starting, what, 1999, 2000, has really quite a few years of super excellent growth."}, {"time": 3255, "text": "And Putin is still riding on that."}, {"time": 3257, "text": "It more or less coincides with his rise as the truly focal figure on the scene."}, {"time": 3264, "text": "Since then, pretty recently, they've had a bunch of years of negative four to 5% growth in a row, which is terrible."}, {"time": 3271, "text": "The economy is way too dependent on fossil fuels, but the structural problem is this."}, {"time": 3277, "text": "You need a concordance across economic power, social power, political power."}, {"time": 3283, "text": "They don't have to be allocated identically, but they have to be allocated consistently."}, {"time": 3289, "text": "And the Russian system under Putin, from almost the beginning, has never been able to have that, that ultimately his incentives are to steer the system where the economic power is in a small number of hands in a non diversified way."}, {"time": 3303, "text": "The system won't deliver sustainable gains in living standards anymore ever the way it's set up now."}, {"time": 3311, "text": "Though if fossil fuel prices go up, they'll have some good years for sure."}, {"time": 3315, "text": "And that is really quite structural, what has gone wrong."}, {"time": 3320, "text": "And then on top of that, you can have an opinion of Putin, but you've got to start with those structural problems."}, {"time": 3325, "text": "And that's why it's just not going to work."}, {"time": 3328, "text": "But he had all those good years in the beginning."}, {"time": 3330, "text": "So the number of Russians, say, who live here or in Russia, who love Putin and it's sincere, they're not just afraid of being dragged away, like that's a real phenomenon."}, {"time": 3341, "text": "Yeah, I'm really torn on Putin's approval rating, real approval rating seems to be very high."}, {"time": 3349, "text": "And I'm torn in whether that has to do with the fact that there is control of the press, or if it's, which is the people I talked to who are in Russia, family and so on, a genuine love of Putin, appreciation of what Putin has done and is going to do with Russia."}, {"time": 3370, "text": "And a lot of that would go away if the press were freer, I think."}, {"time": 3373, "text": "Yes, well, Singapore realizes this, anyone discussed by the press, no matter who they are, people in Singapore have done a great job."}, {"time": 3382, "text": "But if you're discussed by the press, you don't look good."}, {"time": 3384, "text": "Tech company executives are learning this, right?"}, {"time": 3387, "text": "It's just like a rule."}, {"time": 3388, "text": "So in that sense, I think the rating is artificially high, but I don't by any means think it's all insincere, but that high popularity I view as bearish for Russia."}, {"time": 3399, "text": "I would feel better about the country if people were more pissed off at him."}, {"time": 3404, "text": "It's nice to see free speech, even if it's full of hate."}, {"time": 3409, "text": "I am also troubled on the scientific side and entrepreneurial side, it seems difficult to be an entrepreneur in Russia."}, {"time": 3418, "text": "Like it's not even in terms of rules, it's just culturally, the people I speak to, it's not easy to build a business, no."}, {"time": 3431, "text": "It's not easy to even dream of building a business in Russia."}, {"time": 3435, "text": "That's just not part of the culture, part of the conversation."}, {"time": 3439, "text": "It's almost like the conversation is, if you wanna be the next Bill Gates or Elon Musk, or Steve Jobs or whatever, you come to America."}, {"time": 3448, "text": "That's the sense they have."}, {"time": 3449, "text": "Yeah, history matters."}, {"time": 3454, "text": "Is it history, is it structural problems of today?"}, {"time": 3458, "text": "So a history of hostility to commerce, which of course the old USSR is gone, but a lot of the attitudes remain, a lot of the corruption remains."}, {"time": 3534, "text": "Yeah, what do you make of the other big player, China?"}, {"time": 3541, "text": "They seem to have a very different messed up, but also functioning system."}, {"time": 3549, "text": "They seem to be much better at encouraging entrepreneurs."}, {"time": 3553, "text": "They're choosing winners, but what do you make of the entire Chinese system?"}, {"time": 3558, "text": "Why does it work as well as it does currently?"}, {"time": 3562, "text": "What are your concerns about it, and what are its threats to the United States, or possible, what is it you said, wisdom isn't when two ideas come together, is there some possible benefits of these kinds of ideas coming together?"}, {"time": 3580, "text": "It's amazing what China has done, but I would say to put it in perspective, if you compare them to Japan, South Korea, Taiwan, Hong Kong, and Singapore, they've still done much worse, not even close."}, {"time": 3593, "text": "And that's both living standards, or I hesitate to cite democracy as an unalloyed good in and of itself, but there's more freedom in all those other places by a lot."}, {"time": 3633, "text": "You have to admit that."}, {"time": 3635, "text": "I don't know how long that streak will continue with one person so much now holding authority in a more extreme manner."}, {"time": 3645, "text": "The selection pressures for the next generation of high level CCP members probably become much worse."}, {"time": 3652, "text": "You have this general problem of the state owned enterprise is losing relative productivity compared to the private sector."}, {"time": 3658, "text": "Well, we're gonna kind of hold Jack Ma on this island and he can only issue like weird hello statements."}, {"time": 3666, "text": "It kind of smells bad to me."}, {"time": 3668, "text": "I don't feel that it's about to crash, but I don't see them supplanting America as like the world's number one country."}, {"time": 3677, "text": "I think they will muddle through and have very serious problems, but there's enough talent there they will muddle through."}, {"time": 3684, "text": "Is there ideas from China or from anywhere in general of large scale role of government that you find might be useful?"}, {"time": 3690, "text": "Like Andrew Yang recently ran on a platform, UBI, right, Universal Basic Income."}, {"time": 3697, "text": "Is there some interesting ideas of large scale government sort of welfare programs at scale that you find interesting?"}, {"time": 3711, "text": "Well, keep in mind the current version of the Chinese Communist Party post now dismantled what was called the iron rice ball."}, {"time": 3720, "text": "So it took apart the healthcare protections, a lot of the welfare system, a lot of the guaranteed jobs."}, {"time": 3725, "text": "So the economic rise of China coincided with the weakening of welfare."}, {"time": 3730, "text": "I'm not saying that's causal per se, but people think of China as having a government that takes care of everyone, it's very far from the truth."}, {"time": 3739, "text": "And by a lot of metrics, I don't mean control over people's lives, I don't mean speech, but by a lot of metrics, economically we have a lot more government than they do."}, {"time": 3748, "text": "So what one means here by like government, private control, I don't think you can just add up the numbers and get a simple answer."}, {"time": 3756, "text": "They've been fantastic at building infrastructure in cities in ways that will attract people from the countryside."}, {"time": 3764, "text": "And furthermore, they more or less enforce a meritocracy in this sense."}, {"time": 3768, "text": "Like if you're a kid of a rich guy, you'll get unfair privilege."}, {"time": 3773, "text": "That's unfair, but systems can afford that."}, {"time": 3776, "text": "If you are smart and from the countryside and your parents have nothing, you will be elevated and sent to a very good school, graduate school because of the exam system."}, {"time": 3785, "text": "And they do that and they mean that very consistently."}, {"time": 3788, "text": "It's like the Soviets had a version of that like for chess and romantic piano."}, {"time": 3792, "text": "Not for everything, but where they had it, like again, they were tremendous, right?"}, {"time": 3798, "text": "And Chinese have it in so many areas, a genuine meritocracy in this one way."}, {"time": 3803, "text": "That moves people from the rural to the big city and that's a big boost of productivity for some amount of time."}, {"time": 3810, "text": "And when they get there, they're taken seriously."}, {"time": 3812, "text": "Jack Ma was riding a bicycle, teaching English in his late 20s."}, {"time": 3815, "text": "He was a poor guy."}, {"time": 3819, "text": "Not a society of credentialism."}, {"time": 3821, "text": "Or in America, it's way too much a credentialist society."}, {"time": 3825, "text": "As we're talking about even with the Nobel Prize."}, {"time": 3827, "text": "But what do you think about these large government programs like UBI?"}, {"time": 3833, "text": "The one version of UBI that makes the most sense to me is the Mitt Romney version, UBI for kids."}, {"time": 3839, "text": "Like kids are vulnerable."}, {"time": 3840, "text": "If their parents screw up, you shouldn't blame the kid or make the kids suffer."}, {"time": 3844, "text": "I believe in something like UBI for kids."}, {"time": 3847, "text": "Maybe just cash."}, {"time": 3849, "text": "But if you don't have kids, even with AI, my sense is at least in the world we know, you should be able to find a way to adjust."}, {"time": 3859, "text": "You might have to move to North Dakota to work, next to fracking, say."}, {"time": 3866, "text": "But look, before the pandemic, the two most robot intensive societies, Japan and the US, US at least for manufacturing, were at full employment."}, {"time": 3875, "text": "So maybe there's some far off day where there's literally no work, John Lennon, and imagine it's piped everywhere."}, {"time": 3884, "text": "And then we might revisit the question."}, {"time": 3887, "text": "But for now, we had rising wages in the Trump years and full employment."}, {"time": 3892, "text": "So I don't see the point."}, {"time": 3894, "text": "You don't see automation as a threat that fundamentally shakes our society."}, {"time": 3900, "text": "It's a threat in the following sense."}, {"time": 3901, "text": "The new technologies are harder to work with for many people, and that's a social problem."}, {"time": 3907, "text": "But I'm not sure a universal basic income is the right answer to that very real problem."}, {"time": 3913, "text": "Well, that's also, I like the UBI for kids."}, {"time": 3916, "text": "It's also your definition or the line, the threshold for what is vulnerable and what is basic human nature."}, {"time": 3924, "text": "Going back to Russia, life is suffering."}, {"time": 3927, "text": "That struggle is a part of life."}, {"time": 3931, "text": "And perhaps sort of changing, maybe what defines the 21st century is having multiple careers and adjusting and learning and evolving."}, {"time": 3941, "text": "And some of the technology in terms of, some of the technology we see like the internet allows us to make those pivots easier, allows later life education possible."}, {"time": 3959, "text": "It makes it possible."}, {"time": 3961, "text": "And your earlier point about loneliness being this fundamental human problem, which I would agree with strongly, UBI, if it's at a high level, will make that worse."}, {"time": 3970, "text": "I mean, say UBI were higher enough, you could just sit at home."}, {"time": 3974, "text": "People are not gonna be happy."}, {"time": 3976, "text": "They don't actually want that."}, {"time": 3978, "text": "And we've relearned that in the pandemic."}, {"time": 3981, "text": "Yeah, the flip side, the hope with UBI is you have a little bit more freedom to find the thing that alleviates your loneliness."}, {"time": 3990, "text": "So it's kind of an open question."}, {"time": 3993, "text": "If I give you a million dollars or a billion dollars, will you pursue the thing you love?"}, {"time": 4001, "text": "Will you be more motivated to find the thing you love, to do the thing you love, or will you be lazy and lose yourself in the sort of daily activities that don't actually bring you joy, but pacify you in some kind of way where you just let the days slip by?"}, {"time": 4022, "text": "A lot of the great creators did not have huge cushions, whether it was Mozart or James Brown or the great painters in history, they had to work pretty hard."}, {"time": 4032, "text": "And if you look at heirs to great fortunes, maybe I'm forgetting someone, but it's hard to think of any who have creatively been important as novelists, or they might have continued to run the family business."}, {"time": 4045, "text": "But Van Gogh was not heir to a great family fortune."}, {"time": 4050, "text": "It's sad that cushions get in the way of progress."}, {"time": 4057, "text": "It's the same point about prizes, right?"}, {"time": 4059, "text": "Inheriting too much money is like winning a prize."}, {"time": 4062, "text": "We mentioned Eric, Eric Weinstein."}, {"time": 4065, "text": "I know you agree on a bunch of things."}, {"time": 4067, "text": "Is there some beautiful, fascinating, insightful disagreement that you have that has yet to be resolved with him?"}, {"time": 4074, "text": "Is there some ideas that you guys battle it out on?"}, {"time": 4078, "text": "Is it the stagnation question that you mentioned?"}, {"time": 4080, "text": "That's one of them, but here's at least two others."}, {"time": 4085, "text": "But I would stress Eric is always evolving."}, {"time": 4088, "text": "So I'm just talking about a time slice Eric, right?"}, {"time": 4090, "text": "I don't know where he's at right now."}, {"time": 4092, "text": "Like I heard him on Clubhouse three nights ago, but that was three nights ago."}, {"time": 4097, "text": "But I think he's far too pessimistic about the impact of immigration on U.S. science."}, {"time": 4103, "text": "He thinks it has displaced U.S. scientists, which I think that is partly true."}, {"time": 4108, "text": "I just think we've gotten better talent."}, {"time": 4110, "text": "I'm like, bring it on, double down."}, {"time": 4113, "text": "And look at Kiriko, who basically came up with mRNA vaccines, she was from Hungary."}, {"time": 4117, "text": "And was ridiculed and mocked, she couldn't get her papers published."}, {"time": 4122, "text": "She stuck at it."}, {"time": 4124, "text": "An American might not have been so stubborn because we have these cushions."}, {"time": 4129, "text": "So Eric is all worried, like mathematicians coming in, they're discouraging native U.S. citizens from doing math."}, {"time": 4136, "text": "I'm like, bring in the best people."}, {"time": 4139, "text": "If we all end up in other avocations, absolutely fine by me."}, {"time": 4144, "text": "Does it trouble you that we kick them out after they get a degree often?"}, {"time": 4148, "text": "I would give anyone with a plausible graduate degree a green card, universally."}, {"time": 4153, "text": "Yeah, I agree with that, it makes no sense."}, {"time": 4157, "text": "It makes so strange that the best people that come here suffer here, create awesome stuff here, then when we kick them out, it doesn't make any sense."}, {"time": 4164, "text": "Here's another view I have."}, {"time": 4165, "text": "I call it open borders for Belarus."}, {"time": 4169, "text": "Now Russia's a big country."}, {"time": 4170, "text": "I would gladly increase the Russian quota by three X, four X, five X, not 20%, but a big boost."}, {"time": 4179, "text": "But Belarus, a small country, and they're poor, and they have decent education, and a lot of talent there."}, {"time": 4187, "text": "Why can't we just open the door and convert a Belarus passport to a green card?"}, {"time": 4193, "text": "Open borders for Belarus, it's my new campaign slogan."}, {"time": 4196, "text": "Are you running for president in 2024?"}, {"time": 4198, "text": "Well, write ins are welcome, but."}, {"time": 4200, "text": "Okay, what's the second thing you disagree with, Eric?"}, {"time": 4205, "text": "Trade, again, I'm not sure where he's at now, but he is suspicious of trade in a way that I am not."}, {"time": 4214, "text": "I do understand what's called the China shock has been a big problem for the US middle class."}, {"time": 4219, "text": "I fully accept that."}, {"time": 4221, "text": "I think most of that is behind us."}, {"time": 4224, "text": "National security issues aside, I think free trade is very much a good thing."}, {"time": 4229, "text": "Eric, I'm not sure he'll say it's not a good thing, but he won't say it is a good thing."}, {"time": 4234, "text": "And I know he's kind of, it's like, Eric, free trade."}, {"time": 4239, "text": "But look, on things like vaccines, I don't believe in free trade."}, {"time": 4242, "text": "You want vaccine production in your own country, look at the EU."}, {"time": 4247, "text": "They have enough money, no one will send them vaccines."}, {"time": 4250, "text": "What's different about vaccines?"}, {"time": 4251, "text": "Is it, there's some things you want to prioritize the citizenry on."}, {"time": 4256, "text": "You could argue it would be cheaper to produce all US manufactured vaccines in India."}, {"time": 4262, "text": "They have the technologies, obviously lower wages, but look, there's talk in India right now of cutting off the export of vaccines."}, {"time": 4269, "text": "If you outsource your vaccine production, you're not sure the other country will respect the norm of free trade."}, {"time": 4275, "text": "So you need to keep some vaccine production in your country."}, {"time": 4280, "text": "It's an exception to free trade, not to the logic, a bunch of things the Navy uses."}, {"time": 4286, "text": "You can't buy those components from China."}, {"time": 4291, "text": "But look, it would be cheaper to do so, right?"}, {"time": 4295, "text": "Let me completely shift topics on something that's fascinating."}, {"time": 4298, "text": "It's all the same topic, but great."}, {"time": 4305, "text": "What do you think about what the hell is money?"}, {"time": 4308, "text": "And the recent excitement around cryptocurrency that brings to the forefront the philosophical discussion of the nature of money."}, {"time": 4324, "text": "Are you bullish on cryptocurrency?"}, {"time": 4326, "text": "Are you excited about it?"}, {"time": 4327, "text": "What does it make you think about how the nature of money is changing?"}, {"time": 4331, "text": "No one knows what money is."}, {"time": 4333, "text": "Probably no one ever knew."}, {"time": 4335, "text": "Go back to medieval times, bills of exchange."}, {"time": 4337, "text": "Were they money?"}, {"time": 4339, "text": "Maybe it's just a semantic debate."}, {"time": 4341, "text": "Gold, silver, what about copper coins?"}, {"time": 4343, "text": "What about metals that were considered legal tender but not always circulating?"}, {"time": 4348, "text": "What about credit?"}, {"time": 4349, "text": "So being confused about moneyness is the natural state of affairs for human beings."}, {"time": 4355, "text": "And if there's more of that, I'd say that's probably a good thing."}, {"time": 4358, "text": "Now, crypto per se, I think Bitcoin has taken over a lot of the space held by gold."}, {"time": 4365, "text": "That to me seems sustainable."}, {"time": 4368, "text": "I'm not short Bitcoin."}, {"time": 4370, "text": "I don't have some view that the price has to be different than the current price, but I know it changes every moment."}, {"time": 4378, "text": "I am deeply uncertain about the less of crypto, which seems connected to ultimate visions of using it for transactions in ways where I'm not sure whether it be prediction markets or DeFi."}, {"time": 4392, "text": "I'm not sure the retail demand really is there once it is regulated like everything else is."}, {"time": 4399, "text": "I would say I'm 40, 60 optimistic on those forms of crypto."}, {"time": 4404, "text": "That is, I think it's somewhat more likely they fail than succeed, but I take them very seriously."}, {"time": 4409, "text": "So we're talking about it becoming one of the main currencies in the world."}, {"time": 4412, "text": "That's what we're discussing."}, {"time": 4413, "text": "That I don't think will happen."}, {"time": 4415, "text": "So, but the reality is that Bitcoin used to be in the single digits of a dollar and now has crossed $50,000 for a single Bitcoin."}, {"time": 4426, "text": "Do you think it's possible it reaches something like a million dollars?"}, {"time": 4431, "text": "I don't think we have a good theory of the value of Bitcoin."}, {"time": 4434, "text": "If people decide it's worth a million dollars, it's worth a million dollars."}, {"time": 4437, "text": "But isn't that money?"}, {"time": 4438, "text": "Like you said, isn't the ultimate state of money confusion, however beautifully you put it?"}, {"time": 4443, "text": "It's like valuing an Andy Warhol painting."}, {"time": 4445, "text": "So when Warhol started off, probably those things had no value."}, {"time": 4448, "text": "They were sketches, early sketches of shoes."}, {"time": 4451, "text": "Now a good Warhol could be worth over 50 million."}, {"time": 4454, "text": "That's an incredible rate of price appreciation."}, {"time": 4457, "text": "Bitcoin is seeing a similar trajectory."}, {"time": 4460, "text": "I don't pretend to know where it will stop, but it's about trying to figure out what do people think of Andy Warhol?"}, {"time": 4466, "text": "He could be out of fashion in a century."}, {"time": 4469, "text": "Maybe yes, maybe no."}, {"time": 4472, "text": "But you don't think about Warhols as money."}, {"time": 4476, "text": "They perform some money like functions."}, {"time": 4478, "text": "You can even use them as collateral for like deals between gangs."}, {"time": 4483, "text": "But they're not basically money, nor is Bitcoin."}, {"time": 4486, "text": "And the transactions velocity of Bitcoin, I would think is likely to fall, if anything."}, {"time": 4491, "text": "So you don't think there'll be some kind of phase shift where it become adopted and become mainstream for one of the main mechanisms of transactions?"}, {"time": 4500, "text": "Bitcoin, no."}, {"time": 4501, "text": "Now, you know, ether has some chance at that."}, {"time": 4503, "text": "I would bet against it, but I wouldn't give you a definitive no."}, {"time": 4506, "text": "And you wouldn't put us here."}, {"time": 4507, "text": "Bitcoin is too costly."}, {"time": 4510, "text": "It may be fine to hold it like gold, but gold is also costly."}, {"time": 4515, "text": "You have smart people trying to make, say, ether, much more effective as a currency than Bitcoin."}, {"time": 4522, "text": "And there's certainly a decent chance they will succeed."}, {"time": 4525, "text": "Yeah, there's a lot of innovation."}, {"time": 4526, "text": "I mean, with smart contracts, with NFTs as well, there's a lot of interesting innovations that are plugging into the human psyche somehow, just like money does."}, {"time": 4537, "text": "You know, money seems to be this viral thing, our ideas of money, right?"}, {"time": 4543, "text": "And if the idea is strong enough, it seems to be able to take hold."}, {"time": 4547, "text": "Like there's network effects that just take over."}, {"time": 4550, "text": "And like, I particularly see that with, I'd love to get your comment on Dogecoin, which is basically by a single human being, Elon Musk has been created."}, {"time": 4561, "text": "You know, it's like these celebrities can have a huge ripple effect on the impact of money."}, {"time": 4567, "text": "Is it possible that in the 21st century, people like Elon Musk and celebrities, I don't know, Donald Trump, The Rock, whoever else, can actually define, you know, the currencies that we use?"}, {"time": 4582, "text": "Maybe can Dogecoin become the primary currency of the world?"}, {"time": 4587, "text": "I think of it as like baseball cards."}, {"time": 4589, "text": "So right now, every baseball player has a baseball card."}, {"time": 4592, "text": "And the players who are stars, their cards can end up worth a fair amount of money."}, {"time": 4597, "text": "And that's stable, we've had it for many decades."}, {"time": 4600, "text": "Sort of the player defines the card, they sign a contract with Topps or whatever company."}, {"time": 4606, "text": "Now, could you imagine celebrities, baseball players, LeBron James, having their own currencies instead of cards?"}, {"time": 4613, "text": "Absolutely, and you're somewhat seeing that right now, as you mentioned, artists with these unique works on the blockchain."}, {"time": 4619, "text": "But I'm not sure those are macroeconomically important."}, {"time": 4622, "text": "If it's just a new class of collectibles that people have fun with, again, I say, bring it on."}, {"time": 4628, "text": "But whether there are use cases beyond that, that challenge fiat monies, which actually work very well."}, {"time": 4635, "text": "Yesterday, I sent money to a family in Ethiopia that I helped support."}, {"time": 4641, "text": "In less than 24 hours, they got that money."}, {"time": 4644, "text": "Digitally, yes."}, {"time": 4646, "text": "No, not digitally, through my bank."}, {"time": 4648, "text": "My primitive dinosaur bank, BB&T, Mid Atlantic Bank, headquartered in North Carolina, charted by the Fed, regulated by the FDAC and the OCC."}, {"time": 4658, "text": "Now, you could say, well, the exchange rate was not so great."}, {"time": 4664, "text": "I don't see crypto as close to beating that once you take into account all of the last mile problems."}, {"time": 4670, "text": "Fiat currency works really well."}, {"time": 4672, "text": "People are not sitting around bitching about it."}, {"time": 4674, "text": "And when you talk to crypto people, they're crypto people, the number who have to postulate some out of the blue hyperinflation, where there's no evidence for that whatsoever, that to me is a sign they're not thinking clearly about how hard they have to work to outcompete fiat currency."}, {"time": 4690, "text": "There's a bunch of different technologies that are really exciting that don't want to address how difficult it is to outcompete the current accepted alternative."}, {"time": 4699, "text": "So for example, autonomous vehicles."}, {"time": 4701, "text": "A lot of people are really excited."}, {"time": 4704, "text": "But it's not trivial to outcompete Uber on the cost and the effectiveness and the user experience and all those kinds of, sorry, Uber driven by humans."}, {"time": 4714, "text": "And it's not, you know, that's taken for granted, I think, that look, wouldn't it be amazing, how amazing would the world look when the cars are driving themselves fully, you know, it's gonna drive the cost down, you can remove the cost of drivers, all those kinds of things."}, {"time": 4730, "text": "But it's when you actually get down to it and have to build a business around it, it's actually very difficult to do."}, {"time": 4735, "text": "And I guess you're saying your sense is similar competition is facing cryptocurrency."}, {"time": 4740, "text": "Like you have to actually present a killer app reason to switch from fiat currency to Ethereum or to whatever."}, {"time": 4752, "text": "And the Biden people are gonna regulate crypto and they're gonna do it soon."}, {"time": 4756, "text": "So something like DeFi, I fully get why that is cheaper or for some can be cheaper than other ways of conducting financial intermediation."}, {"time": 4765, "text": "But some of that is regulatory arbitrage."}, {"time": 4768, "text": "It will not be allowed to go on forever for better or worse."}, {"time": 4772, "text": "I would rather see it given greater tolerance."}, {"time": 4775, "text": "But the point is banking lobby is strong."}, {"time": 4777, "text": "The government will only let it run so far."}, {"time": 4779, "text": "There'll be capital requirements, reporting requirements imposed, and it will lose a lot of those advantages."}, {"time": 4786, "text": "What do you make of Wall Street bets?"}, {"time": 4788, "text": "Another thing that recently happened that shook the world and at least me from the outside of perspective, make me question what I do and don't understand about our economics."}, {"time": 4801, "text": "Which is a bunch of different, a large number of individuals getting together on the internet and having a large scale impact on the markets."}, {"time": 4810, "text": "If you tell a group of people and coordinate them through the internet, we're gonna play a fun game, it might cost you money, but you're gonna make the headlines and there's a chance you'll screw over some billionaires and hedge funds."}, {"time": 4820, "text": "Enough people will play that game."}, {"time": 4823, "text": "So that game might continue, but I don't think it's of macroeconomic importance."}, {"time": 4826, "text": "And the price of those stocks in the medium term will end up wherever it ought to be."}, {"time": 4832, "text": "So these are little outliers from a macroeconomics perspective."}, {"time": 4836, "text": "They're not going to, these are not signals of shifting power, like from centralized power to distributed power."}, {"time": 4846, "text": "These aren't some fundamental changes in the way our economy works."}, {"time": 4850, "text": "I think of it as a new brand of eSports, maybe more fun than the old brand."}, {"time": 4854, "text": "Which is fine, right?"}, {"time": 4856, "text": "It's like push the anarchy into the corners where you want it."}, {"time": 4859, "text": "It doesn't bother me, but I think people are seeing it as more fun than it is."}, {"time": 4865, "text": "It's a new eSport, more fun for many, but more expensive than the old eSports."}, {"time": 4870, "text": "Like chess is a new eSport, super cheap, not as fun as like sending hedge funds to their doom, but like, what would you expect?"}, {"time": 4879, "text": "The poetry, I love it, okay."}, {"time": 4882, "text": "But macroeconomically, it's not fundamental."}, {"time": 4884, "text": "Okay, I was going to say, I hope you're right, because I'm uncomfortable with the chaos of the masses that's creates."}, {"time": 4892, "text": "But I also think that chaos is somewhat real to be clear, but it will matter through other channels, not through manipulating GameStop or AMC."}, {"time": 4906, "text": "So you're seeing the real macro phenomenon."}, {"time": 4908, "text": "When people see a real macro phenomenon, they tend to make every micro story fit the narrative."}, {"time": 4914, "text": "And this micro story, like it fits the narrative, but it doesn't mean its importance fits the narrative."}, {"time": 4918, "text": "That's how I would kind of dissect the mistake I think people are making."}, {"time": 4925, "text": "The macro phenomenon that are there, do you mean?"}, {"time": 4927, "text": "Everyone's weird now, the internet."}, {"time": 4930, "text": "Either allows us to be weirder or makes us weirder."}, {"time": 4932, "text": "I'm not sure what's the right way to put it."}, {"time": 4934, "text": "Maybe a mix of both."}, {"time": 4936, "text": "You're probably right that it allows us to be weirder because, well, this is the other, okay."}, {"time": 4941, "text": "So this connects our previous conversation."}, {"time": 4943, "text": "Does America allow us to be weirder or does it make us weirder?"}, {"time": 4949, "text": "Like say we're weird and somewhat neurotic to begin with, but the only messages we get are Dwight D. Eisenhower and I Love Lucy and network TV."}, {"time": 4957, "text": "Like that's going to keep us within certain bounds."}, {"time": 4960, "text": "In good and bad ways."}, {"time": 4961, "text": "That's obviously totally gone."}, {"time": 4963, "text": "And the internet, you can connect to not just QAnon, but all sorts of things."}, {"time": 4967, "text": "Many of them just fantastic, right?"}, {"time": 4971, "text": "But in good and bad ways, it makes us weirder."}, {"time": 4974, "text": "So that maybe is troubling, right?"}, {"time": 4976, "text": "Like if someone's worried about that, I would at least say they should give it deep serious thought."}, {"time": 4981, "text": "And then it has a whole lot of ebbs and flows, micro realizations of the weirdness that don't actually matter."}, {"time": 4989, "text": "So like chess players today, they play a lot more weird openings than they did 20 years ago."}, {"time": 4994, "text": "Like it reflects the same thing because you can research any weird opening on the internet, but like, does that matter?"}, {"time": 5002, "text": "So a lot of the things we see are just like the weird chess openings."}, {"time": 5006, "text": "And to figure out which are like the weird chess openings and which are fundamental to the new and growing weirdness, like that's what a hedge fund investor type should be trying to do."}, {"time": 5015, "text": "I just think no one knows yet."}, {"time": 5016, "text": "It's like this itself, this fun weird guessing game, which we're partly engaging in right now."}, {"time": 5023, "text": "And I mean, as Eric talks about on the science side of things, I mean, I said like at MIT, especially in the machine learning field, there's a natural institutional resistance to the weird."}, {"time": 5036, "text": "It's very, as they talk about, it's difficult to hire weird faculty, for example."}, {"time": 5043, "text": "You want to hire and give tenure to people that are safe and not weird."}, {"time": 5047, "text": "And that's one of the concerns is like, it seems like the weird people are the ones that push the science forward usually."}, {"time": 5054, "text": "And so like, how do you balance the two?"}, {"time": 5057, "text": "Because it's another area where Eric and I disagree."}, {"time": 5060, "text": "As I interpret him, he thinks academia is totally bankrupt."}, {"time": 5064, "text": "And I think it's only partially bankrupt."}, {"time": 5067, "text": "How do we fix it?"}, {"time": 5068, "text": "Because I'm with you, I'm bullish on academia."}, {"time": 5071, "text": "You need up and coming schools that end up better than where they started off."}, {"time": 5076, "text": "And MIT was once one of them."}, {"time": 5079, "text": "Now they're not in every area."}, {"time": 5080, "text": "In some areas, they have become the problem."}, {"time": 5083, "text": "UChicago, you wouldn't call it up and coming, but it's still different."}, {"time": 5087, "text": "Let's hope they manage to keep it that way."}, {"time": 5091, "text": "The biggest problem to me is the rank absurd conformism."}, {"time": 5095, "text": "I kind of second tier schools, maybe in the top 40, but not in the top dozen, that are just trying to be like a junior MIT, but it's mediocre and copycat."}, {"time": 5104, "text": "And they're the most dogmatic enforcers of weirdness that like Harvard is more open than those second tier schools."}, {"time": 5111, "text": "And those second tier schools are pretty good typically, right?"}, {"time": 5114, "text": "But the mediocrity is enforced there."}, {"time": 5118, "text": "Very strictly."}, {"time": 5119, "text": "And the homogenization pressures."}, {"time": 5121, "text": "Climb the rankings by another three places and be a little closer to MIT, though you'll never touch them."}, {"time": 5127, "text": "That to me is very harmful."}, {"time": 5128, "text": "And you'd rather they be more like Chicago, more like Caltech, or the older Caltech all the more, like pick some model, be weird in it."}, {"time": 5137, "text": "You might fail."}, {"time": 5138, "text": "That's socially better."}, {"time": 5140, "text": "Yeah, but so the problem with MIT, for example, is the mediocrity is really enforced on the junior faculty."}, {"time": 5150, "text": "So like the people that are allowed to be weird, or actually they just don't even ask for permissions anymore are more senior faculty."}, {"time": 5156, "text": "And that's good, of course, but you want the weird young people."}, {"time": 5160, "text": "I find too, this podcast, I like talking to tech people, and I find the young faculty to be really boring."}, {"time": 5169, "text": "They're the most boring of faculty."}, {"time": 5171, "text": "Their work is interesting technically, technically, but just the passion."}, {"time": 5178, "text": "They are drudges."}, {"time": 5179, "text": "And some of them sneak by."}, {"time": 5183, "text": "Like you have like the Max Tegmark, young version of Max Tegmark, who knows how to play the role of boring and fitting in."}, {"time": 5191, "text": "And then on the side, he does the weird shit."}, {"time": 5195, "text": "But they're far and few in between, which I'd love to figure out a way to shake up that system because as you look at MIT's Broad Institute, right, in biomedical, it's been a huge hit."}, {"time": 5207, "text": "I'm not privy to their internal doings, but I suspect they support weird more than the formal departments do at the junior level."}, {"time": 5215, "text": "Yes, that's probably true."}, {"time": 5216, "text": "Yeah, I don't know what, whatever they're doing, it's working, but we needed to figure it out because I think the best ideas still do come from the, so forget, my apologies, but for the humanities side of things, I don't know anything about, but the engineering and the science side, I think there's so many amazing ideas that are still coming from universities."}, {"time": 5239, "text": "It's not true that you don't know anything about the humanities."}, {"time": 5242, "text": "You're doing the humanities right now."}, {"time": 5244, "text": "Talking about people, there are no numbers put on a blackboard, right?"}, {"time": 5248, "text": "There's no hypothesis testing per se."}, {"time": 5251, "text": "You have however many subscribers to your podcast, all listening to you on the humanities."}, {"time": 5257, "text": "Every, whatever your frequency is."}, {"time": 5258, "text": "But I'm not in the department of the humanities."}, {"time": 5260, "text": "That's why it's innovative."}, {"time": 5262, "text": "They have very different conversations."}, {"time": 5264, "text": "There's the number of emails I get about, listen, I really deeply respect diversity and the full scope of what diversity means and also the more narrow scope of different races and genders and so on."}, {"time": 5279, "text": "It's a really important topic, but there's a disproportionate number of emails I'm getting about meetings and discussions and that just kind of is overwhelming."}, {"time": 5288, "text": "I don't get enough emails from people, like a meeting about why are all your ideas bad?"}, {"time": 5295, "text": "Let's, for example, let me call out MIT."}, {"time": 5298, "text": "Why don't we do more?"}, {"time": 5300, "text": "Why don't we kick Stanford's ass or Google's ass, more importantly, in deep learning and machine learning and AI research?"}, {"time": 5308, "text": "What CSAIL, for example, used to be a laboratory is a laboratory for artificial intelligence research."}, {"time": 5315, "text": "And why is that not the beacon of greatness in artificial intelligence?"}, {"time": 5323, "text": "Let's have those meetings as well."}, {"time": 5325, "text": "Diversity talk has oddly become this new mechanism for enforcing conformity."}, {"time": 5331, "text": "And right, so it's almost like this conformity mechanism finds the hot new topic to use to enforce further conformity."}, {"time": 5339, "text": "Oh boy, I still, I remain optimistic."}, {"time": 5343, "text": "The humanities have innovated through podcasts, including yours and mine, and they're alive and well."}, {"time": 5348, "text": "All the bad talk you hear about the humanities in universities, there's been this huge end run of innovation on the internet and it's amazing."}, {"time": 5358, "text": "I never thought of, I mean, this is humanities."}, {"time": 5360, "text": "This podcast is right."}, {"time": 5363, "text": "It's like you've been speaking prose all one's life and didn't know it, right?"}, {"time": 5368, "text": "Yeah, I am actually part of the humanities department at MIT now."}, {"time": 5371, "text": "I did not realize this and I will fully embrace it from this moment on."}, {"time": 5376, "text": "Look, you have this thing, the Media Lab."}, {"time": 5377, "text": "I'm sure you know about it."}, {"time": 5379, "text": "Done some excellent things, done a lot of very bogus things, but you're out competing them."}, {"time": 5383, "text": "You're blowing them out of the water."}, {"time": 5385, "text": "Like you are them."}, {"time": 5386, "text": "Yeah, I mean, and I'm talking to those folks and they're just trying to, well, they're just trying to figure it out."}, {"time": 5391, "text": "I mean, they had their issues with Jeff Epstein and so on, but outside of that, there's a, I've actually gone through a shift with this particular podcast, for example, where at first it was seen as a, one, at the very first it was seen as a distraction."}, {"time": 5409, "text": "Second, it was a source of like, almost like a kind of jealousy, like the same kind of jealousy you feel when junior faculty outshines the senior faculty."}, {"time": 5418, "text": "And now it's more like, oh, okay, this is a thing."}, {"time": 5422, "text": "Like we should do more of that."}, {"time": 5423, "text": "We should embrace this guy."}, {"time": 5425, "text": "We should embrace this thing."}, {"time": 5426, "text": "So there's a sense that podcasting and whatever this is, it doesn't have to be podcasting, will drive some innovation within MIT, within different universities."}, {"time": 5437, "text": "There's a sense that things are changing."}, {"time": 5439, "text": "It's just that universities lag behind."}, {"time": 5441, "text": "And my hope is that they catch up quickly."}, {"time": 5445, "text": "They innovate in some way that goes along with the innovations of the internet."}, {"time": 5451, "text": "Online."}, {"time": 5452, "text": "I think the internet will outrace them for a long time, maybe forever."}, {"time": 5455, "text": "Well, I mean, but it's okay if they're, as long as they're keeping."}, {"time": 5458, "text": "Yeah, and we're both in universities."}, {"time": 5460, "text": "So we have multiple hats on here as we're speaking."}, {"time": 5462, "text": "So we can complain about the universities, but that's like complaining about the podcast, right?"}, {"time": 5468, "text": "We be them."}, {"time": 5469, "text": "But speaking on the weird, you've in the best sense of the word weird, you've written about and made the case that we should take UFO sightings more seriously."}, {"time": 5482, "text": "So that's one of the things that I've been inundated with, sort of the excitement and the passion that people have for the possibility of extraterrestrial life, of life out there in the universe."}, {"time": 5500, "text": "I've always felt this excitement."}, {"time": 5502, "text": "I was just looking up at the stars and wondering what the hell's out there."}, {"time": 5506, "text": "But there's people that have more like, more grounded excitement and passion of actually interacting with aliens on this here, our planet."}, {"time": 5517, "text": "What's the case from your perspective for taking these sightings more seriously?"}, {"time": 5525, "text": "The data from the Navy, to me, seem quite serious."}, {"time": 5529, "text": "I don't pretend that I have the technical abilities to judge it as data, but there are numerous senators at the very highest of levels, former heads of CIA, Brennan."}, {"time": 5540, "text": "I talked to him, did an interview with him."}, {"time": 5542, "text": "I asked him, what's up with these?"}, {"time": 5544, "text": "What do you think it is?"}, {"time": 5545, "text": "He basically said that was the single most likely explanation was of alien origin."}, {"time": 5550, "text": "Now you don't have to agree with him."}, {"time": 5552, "text": "But look, if you know how government works, these senators, or Hillary Clinton, for that matter, or Brennan, they sat down, they were briefed by their smartest people, and they said, hey, what's going on here?"}, {"time": 5563, "text": "And everyone around the table, I believe, is telling them, we don't know."}, {"time": 5568, "text": "And that is sociological data I take very seriously."}, {"time": 5572, "text": "I have not seen a debunking of the technical data, which is eyewitness reports and images and radar."}, {"time": 5579, "text": "Again, I don't pretend that I have the technical abilities or again, at a technical level, I feel quite uncertain on that turf."}, {"time": 5586, "text": "But evaluating through the testimony of witnesses, it seems to me it's now at a threshold where one ought to take it seriously."}, {"time": 5595, "text": "Yeah, one of the problems with UFO sightings is that because of people with good equipment don't take it seriously, it's such a taboo topic, that you have just like really shitty equipment collecting data."}, {"time": 5608, "text": "And so you have the blurry Bigfoot kind of situation where you have just bad video and all those kinds of things."}, {"time": 5615, "text": "As opposed to, I mean, there's a bunch of people, Avi Lo from Harvard talking about Oumuamua."}, {"time": 5624, "text": "It's just like people with the equipment to do the data collection don't want to help out."}, {"time": 5634, "text": "And that creates a kind of divide where the scientists ignore that this is happening and there's the masses of people who are curious about it."}, {"time": 5644, "text": "And then there's the government that's full of secrets that's leaking some confusion and it creates distrust in the government, it creates distrust in science and it prevents the scientists from being able to explore some cool topics, some exciting possibilities that they should be, be curious kids like Avi talks about."}, {"time": 5665, "text": "Even if it has nothing to do with aliens, whatever the answer is, it has to be something fascinating."}, {"time": 5671, "text": "We already know everything's interesting, but this is fascinating."}, {"time": 5676, "text": "But look, that all said, I suspect they're not of alien origin."}, {"time": 5679, "text": "And let me tell you my reason."}, {"time": 5680, "text": "The people who are all gung ho, they do a kind of reasoning in reverse or argument from elimination."}, {"time": 5687, "text": "They figure out a bunch of things that can't be, like is it a Russian advanced vehicle?"}, {"time": 5692, "text": "No, probably pretty good arguments there."}, {"time": 5694, "text": "Is it a Chinese advanced vehicle?"}, {"time": 5697, "text": "Is it people like from the earth's future coming back in time?"}, {"time": 5702, "text": "And they go through a few others."}, {"time": 5703, "text": "They have some really good no arguments."}, {"time": 5705, "text": "Then they're like, well, what we've got left is aliens."}, {"time": 5707, "text": "This argument from elimination, I don't actually find that persuasive."}, {"time": 5712, "text": "You can talk yourself into a lot of mistaken ideas that way."}, {"time": 5716, "text": "The positive evidence that it's aliens is still quite weak."}, {"time": 5720, "text": "The positive evidence that it's a puzzle is quite huge."}, {"time": 5724, "text": "And whatever the solution to the puzzle is, it might be fascinating."}, {"time": 5728, "text": "And it's gonna be so weird or fascinating or maybe even trivial, but that's weird in its own way, that we can't set up by elimination all the things that might be able to be."}, {"time": 5738, "text": "Yeah, and just like you said, the debunking that I've seen of these kinds of things are less explorations and solutions to the puzzle and more a kind of halfhearted dismissal."}, {"time": 5752, "text": "And Avi, as you mentioned to him on your podcast with him, he's been attacked an awful lot."}, {"time": 5758, "text": "And when I hear the idea carrier attacked, I get very suspicious of the critics."}, {"time": 5764, "text": "If he's wrong, like just tell me why."}, {"time": 5767, "text": "Like my ears are open."}, {"time": 5768, "text": "I don't have a set view on Oumuamua, you know."}, {"time": 5772, "text": "I know I can't judge Avi's arguments."}, {"time": 5774, "text": "He can't convince me in that sense."}, {"time": 5775, "text": "I'm too stupid to understand how good his argument may or may not be."}, {"time": 5780, "text": "And like you said, ultimately, in the argument, in the meeting of that debate is where we find the wisdom."}, {"time": 5790, "text": "Like dismissing it, there's one other thing that troubles me."}, {"time": 5793, "text": "There's a bunch of people, like Nietzsche sometimes dismiss this way."}, {"time": 5795, "text": "Ayn Rand is sometimes dismissed this way."}, {"time": 5798, "text": "Oh, here we go."}, {"time": 5798, "text": "Like there's a, as opposed to arguing against her ideas, dismissing it outright."}, {"time": 5804, "text": "And that's not productive at all."}, {"time": 5808, "text": "She may be wrong on a lot of things, but like laying out some arguments, even if they're basic human arguments, that's where we arrive at the wisdom."}, {"time": 5819, "text": "Is there something deeper to be said about our trust in institutions and governments and so on that has to do with UFOs?"}, {"time": 5828, "text": "That there's a kind of suspicion that the US government and governments in general are hiding stuff from us when you talk about UFOs."}, {"time": 5837, "text": "This is my view on that."}, {"time": 5838, "text": "If we declassified everything, I think we would find a lot more evidence all pointing toward the same puzzle."}, {"time": 5845, "text": "There aren't some alien men being held underground."}, {"time": 5848, "text": "There's not some secret file that lays out whatever is happening."}, {"time": 5852, "text": "I think the real lesson about government is government cannot bring itself to any new belief on this matter of any kind."}, {"time": 5860, "text": "And it's a kind of funny inertia."}, {"time": 5862, "text": "Like government is deeply puzzled."}, {"time": 5864, "text": "They're more puzzled than they want to admit to us, which I'm okay with that, actually."}, {"time": 5869, "text": "They shouldn't just be out panicking people in the streets."}, {"time": 5873, "text": "But at the end of the day, it's a bit like approving the AstraZeneca vaccine, which does work and they haven't approved it."}, {"time": 5879, "text": "When are they gonna do it?"}, {"time": 5880, "text": "When is our government actually, if only internally, gonna take this more than just seriously, but take it truly seriously?"}, {"time": 5890, "text": "And I just don't know if we have that capability, kind of mentally, to sound like Eric Weinstein for another moment."}, {"time": 5897, "text": "And to stay on the same topic, although on the surface shifting completely, because it is all the same topic."}, {"time": 5906, "text": "You have written and studied art."}, {"time": 5909, "text": "Why do you think we humans long to create art, human society in general and just the human mind?"}, {"time": 5918, "text": "Well, most of us don't really long to create art, right?"}, {"time": 5921, "text": "I would start with that point."}, {"time": 5925, "text": "You think that's a unique weirdness of some particular humans?"}, {"time": 5929, "text": "I think, I don't know, 10% of humans roughly, which is a lot, but it is somewhat weird."}, {"time": 5936, "text": "I don't aspire to create art."}, {"time": 5938, "text": "You could say, like writing nonfiction, there's something art like about it, but it's a different urge, I would say."}, {"time": 5947, "text": "So why do some people have it?"}, {"time": 5950, "text": "I think human brains are very different."}, {"time": 5953, "text": "It's a different notion of working through a problem."}, {"time": 5956, "text": "Like you and I enjoy working through analytic problems."}, {"time": 5960, "text": "For me, economics, for you, AI and other areas, or your humanities podcast, but that's fun."}, {"time": 5966, "text": "For that problem to be visual and linked to physical materials and putting those like on a canvas, to me, it's not a huge leap, but I really don't wanna do it."}, {"time": 5978, "text": "Like it would be pain."}, {"time": 5980, "text": "If you paid me like 500 bucks to spend an hour painting, I don't know, is that worth it?"}, {"time": 5988, "text": "Maybe, but like, I'm happy when that hour's over."}, {"time": 5993, "text": "And would not be proud or happy with the result."}, {"time": 5995, "text": "It would suck."}, {"time": 5997, "text": "I don't think I would do it actually."}, {"time": 5999, "text": "Do you think you're suppressing some deep, I mean?"}, {"time": 6003, "text": "Now, when I was young, I played the guitar as you played the guitar and that I greatly enjoyed, although I was never good, but it helped me appreciate music much, much more."}, {"time": 6014, "text": "Well, this is the question."}, {"time": 6015, "text": "Okay, so from the perspective of the observer and appreciator of art, you said good."}, {"time": 6020, "text": "Is there such a concept as good in art?"}, {"time": 6023, "text": "There's clearly a concept of bad."}, {"time": 6025, "text": "My guitar playing fit that concept."}, {"time": 6029, "text": "But I wasn't trying to be good."}, {"time": 6030, "text": "I wanted to learn like how do chords work?"}, {"time": 6033, "text": "Okay, analytical."}, {"time": 6033, "text": "How does a jazz improvisation work?"}, {"time": 6035, "text": "How is blues different?"}, {"time": 6037, "text": "Classical guitar, sort of physically, how do you make those sounds?"}, {"time": 6041, "text": "And I did learn those things."}, {"time": 6042, "text": "And you can't learn everything about them, but you can learn a lot about them without ever being good or even trying to be that good."}, {"time": 6048, "text": "But I could play all the notes."}, {"time": 6051, "text": "So from the observer perspective, what do you, I apologize for the absurd question, but what do you use the most beautiful and maybe moving piece of art you've encountered in your life?"}, {"time": 6062, "text": "It's not an absurd question at all."}, {"time": 6065, "text": "And I think about this quite a bit."}, {"time": 6069, "text": "I would say the two winners by a clear margin are both by Michelangelo."}, {"time": 6075, "text": "It's the Pieta in the Vatican and the David statue in Florence."}, {"time": 6081, "text": "Historical context or just purity, the creation itself?"}, {"time": 6085, "text": "I don't think you can view it apart from historical context and being in Florence or in the Vatican, you're already primed for a lot, right?"}, {"time": 6092, "text": "You can't pull that out."}, {"time": 6095, "text": "But just technically how they express the emotion of human form, I do honestly intellectually think they're the two greatest artworks for doing that."}, {"time": 6105, "text": "That's not all that art does."}, {"time": 6106, "text": "Not all art is about the human form, but they are phenomenal."}, {"time": 6111, "text": "And I think critical opinion, not that everyone agrees, but my view is not considered a crazy one within the broader court of critical opinion."}, {"time": 6118, "text": "Now in painting, I think the most I was ever blown away was to see Vermeer's artwork."}, {"time": 6125, "text": "It's called The Art of Painting and it's in Vienna in the Kunsthistorisches Museum."}, {"time": 6131, "text": "And I saw that, I think I was 23."}, {"time": 6135, "text": "It just stunned me because I'd seen reproductions, but live in front of you in huge, a completely different artwork."}, {"time": 6141, "text": "And again, Vienna, primed."}, {"time": 6143, "text": "Yes, and I was living abroad for the first time and Vienna itself, the city and so on."}, {"time": 6148, "text": "Now, unlike the Michelangelo's, that is not my current favorite painting, but that would be like historically the one I would pick."}, {"time": 6155, "text": "What do you make in the context of those choices?"}, {"time": 6158, "text": "What do you make of modern art?"}, {"time": 6159, "text": "And I apologize if I'm not using the correct terminology, but art that maybe goes another level of weird outside of the art that you've kind of mentioned and breaks all the conventions and rules and so on and becomes something else entirely that doesn't make sense in the same way that David might."}, {"time": 6183, "text": "I think a lot of it is phenomenal."}, {"time": 6185, "text": "And I would say the single biggest mistake that really smart people make is to think contemporary art or music for that matter is just a load of junk or rubbish."}, {"time": 6195, "text": "It's just like a kind of mathematics they haven't learned yet."}, {"time": 6198, "text": "It's really hard to learn."}, {"time": 6200, "text": "Maybe some people can never learn it, but there's a very large community of super smart, well educated people who spend their lives with it, who love it."}, {"time": 6209, "text": "Those are genuine pleasures."}, {"time": 6210, "text": "They understand it."}, {"time": 6211, "text": "They talk about it with the common language."}, {"time": 6214, "text": "And to think that somehow they're all frauds, it just isn't true."}, {"time": 6217, "text": "Like one doesn't have to like it oneself, just like Love House may or may not be your thing, but it is amazing and for me personally, highly rewarding."}, {"time": 6225, "text": "And if someone doesn't get it, I do kind of have the conceited response of thinking like in that area, I'm just smarter than you are."}, {"time": 6234, "text": "Yeah, so the interesting thing is as with most... We get back to Eric Weinstein again."}, {"time": 6239, "text": "He's in general smarter than I am, this I get."}, {"time": 6242, "text": "But when it comes to contemporary artistic creations, I'm smarter than he is."}, {"time": 6246, "text": "So he's not a fan of contemporary art?"}, {"time": 6248, "text": "I don't want to speak for him."}, {"time": 6250, "text": "I've heard him say derogatory..."}, {"time": 6251, "text": "He's evolving always."}, {"time": 6253, "text": "I've heard him say derogatory things about some of it."}, {"time": 6256, "text": "Doesn't mean he doesn't love some other parts of it."}, {"time": 6258, "text": "So I wonder if there's just a higher learning curve, a steeper learning curve for contemporary art, meaning like it takes more work to appreciate the stories, the context from which they're like thinking about this work."}, {"time": 6272, "text": "It feels like in order to appreciate the art contemporary, certain pieces of contemporary art, you have to know the story better behind the art."}, {"time": 6281, "text": "I think that's true for many people, but I think it's a funny shape distribution because there's a whole other set of people."}, {"time": 6287, "text": "Sometimes they're small children and they get abstract art more easily."}, {"time": 6291, "text": "You show them Vermeer or Rembrandt, they don't get it."}, {"time": 6296, "text": "But just like a wall of color, they're in love with it."}, {"time": 6300, "text": "So I don't think I know the full story."}, {"time": 6303, "text": "Again, some strange kind of distribution."}, {"time": 6304, "text": "The entry barriers are super high or super low, but not that often in between."}, {"time": 6311, "text": "But you would challenge saying that there's a lot to be explored in contemporary art."}, {"time": 6315, "text": "It's just you need to learn."}, {"time": 6320, "text": "Yeah, it's one of the most profound bodies of human thought out there."}, {"time": 6324, "text": "And it's part of the humanities."}, {"time": 6326, "text": "And yes, there are people who also don't like podcasts, right?"}, {"time": 6330, "text": "And that's fine."}, {"time": 6332, "text": "You've also been a scholar of food."}, {"time": 6335, "text": "We're just going through the entirety of the human experience today on this humanities podcast."}, {"time": 6342, "text": "Another absurd question, say this conversation is the last thing you ever do in your life."}, {"time": 6347, "text": "I, wearing the suit, would murder you at the end of the conversation."}, {"time": 6350, "text": "So this is your last day on earth, but I would offer you a last meal."}, {"time": 6354, "text": "What would that meal contain?"}, {"time": 6357, "text": "We can also travel to other parts of the world."}, {"time": 6359, "text": "Well, we have to travel because my preferred last meal here, I probably had like two nights ago."}, {"time": 6365, "text": "Which is what?"}, {"time": 6366, "text": "Can you describe or no?"}, {"time": 6368, "text": "The best restaurant around here is called Mama Chang's and it's in Fairfax and it's food from Wuhan actually."}, {"time": 6376, "text": "And they take pandemic safety seriously in addition to the food being very good."}, {"time": 6380, "text": "But this is what I would do."}, {"time": 6383, "text": "I would fly to Hermosillo in Northern Mexico, which has some of the best food in Mexico, but I sadly only had two days there."}, {"time": 6391, "text": "So somewhere like Oaxaca, Puebla, I think they have food just as good or some people would say better, but I've spent a lot of time in those places."}, {"time": 6401, "text": "So the scarce, wait, is it possible the scarcity of time contributed to the richness of the experience?"}, {"time": 6406, "text": "Of course, but the point is that scarcity still holds."}, {"time": 6410, "text": "So I want one more dose of the food from Hermosillo."}, {"time": 6413, "text": "Can you describe what the food is?"}, {"time": 6415, "text": "It's the one kind of Mexican food that at least nominally is just like the Mexican food you get in the US."}, {"time": 6420, "text": "So there are burritos, there's fajitas."}, {"time": 6422, "text": "It doesn't taste at all like our stuff."}, {"time": 6425, "text": "But again, nominally, it's the part of Mexican food that made it into the US was then transformed."}, {"time": 6431, "text": "But it's in a way the most familiar."}, {"time": 6434, "text": "But for that reason, it's the most radical because you have to rethink all these things you know and they're way better in Hermosillo."}, {"time": 6441, "text": "Hardly any tourists go there."}, {"time": 6442, "text": "Like there's nothing to see in Hermosillo."}, {"time": 6444, "text": "Nothing you do other than eat."}, {"time": 6446, "text": "It's not ruined by any outsiders."}, {"time": 6449, "text": "It's this longstanding tradition, dirt cheap."}, {"time": 6453, "text": "And the thing to do there is just sweet talk a taxi driver into first taking you seriously and then trusting you enough to know that you trust him to bring you to the very best like food stands."}, {"time": 6464, "text": "So where's the magic of that nominally similar entity of the burrito?"}, {"time": 6473, "text": "Where's the magic come from?"}, {"time": 6475, "text": "Is it the taxi ride?"}, {"time": 6476, "text": "Is it the whole experience or is there something actually in the food?"}, {"time": 6479, "text": "So well, you can break the food down part by part."}, {"time": 6482, "text": "So if you think of the beef, the beef there will be dry aged just out in the air in a way the FDA here would never permit."}, {"time": 6490, "text": "Like they dry age it till it turns green, but it is phenomenal."}, {"time": 6494, "text": "The quality of the chilies."}, {"time": 6496, "text": "So here there's only a small number of kinds of chilies you can get."}, {"time": 6499, "text": "In most parts of Mexico, there's quite a large number of chilies you can get."}, {"time": 6504, "text": "They're different, they're fresher, but it's just like a different thing."}, {"time": 6507, "text": "The chilies, the wheat used."}, {"time": 6512, "text": "So this is wheat territory, not corn territory, which is a self interesting."}, {"time": 6517, "text": "The wheat is more diverse and more complex."}, {"time": 6519, "text": "Here it's more homogenized, obviously cheaper, more efficient, but there it is better."}, {"time": 6525, "text": "Non pasteurized cheeses are legal in all parts of Mexico and they can be white and gooey and amazing in a way that here again, it's just against the law."}, {"time": 6535, "text": "You could legalize them."}, {"time": 6536, "text": "The demand wouldn't be that great."}, {"time": 6537, "text": "There's a black market in these cheeses that Latino groceries around here, but you just can't get that much of it."}, {"time": 6543, "text": "So the cheese, the meat, the wheat, all different in significant ways."}, {"time": 6549, "text": "The chilies, I don't think the onions really matter much."}, {"time": 6553, "text": "Garlic, I don't know."}, {"time": 6554, "text": "I wouldn't put much stock in that, but that's a lot of the core food and then it's cooked much better and everything's super fresh."}, {"time": 6562, "text": "The food chain is not relying on refrigeration."}, {"time": 6565, "text": "And this is one thing Russia and US have in common."}, {"time": 6568, "text": "We were early pioneers in food refrigeration and that made a lot of our foods worse quite early."}, {"time": 6574, "text": "And it took us a long time to dig out of that because big countries, right?"}, {"time": 6579, "text": "You've had an extensive rail system in Russia, USSR a long time, which makes it easier to freeze and then ship."}, {"time": 6587, "text": "What about the actual cooking, the chef?"}, {"time": 6590, "text": "Is there an artistry to the simple?"}, {"time": 6593, "text": "I hesitate to call the burrito simple, but."}, {"time": 6597, "text": "And there's no brain drain out of cooking."}, {"time": 6598, "text": "So if you're in the United States and you're very talented, I'm not saying there aren't talented chefs."}, {"time": 6605, "text": "Of course there are, but there's so many other things to pull people away."}, {"time": 6609, "text": "But in Mexico, there's so much talent going into food as there is in China, which would be another candidate for last meal questions."}, {"time": 6617, "text": "Or India."}, {"time": 6618, "text": "Or, oh, India, let's not even get started on India."}, {"time": 6623, "text": "You've also, I mean, there's a million things we could talk about here, but you've written about your own dreams of sushi."}, {"time": 6628, "text": "It's just a really clean, good example that people are aware of of mastery in the art of the simple in food."}, {"time": 6639, "text": "What do you make of that kind of obsessive pursuit of perfection in creating simple food?"}, {"time": 6645, "text": "Sushi is about perfection, but it's a bit like the Beatles White album, which people think is simple and not overproduced."}, {"time": 6651, "text": "It's in a funny way their most overproduced album, but it's produced just perfectly."}, {"time": 6655, "text": "It sounds simple."}, {"time": 6657, "text": "It's really hard to produce music to the point where it's gonna sound so simple and not sound like sludge."}, {"time": 6663, "text": "Like Let It Be album, it has some great songs, but a lot of it sounds like sludge."}, {"time": 6667, "text": "One After 909, that's sludge."}, {"time": 6669, "text": "I Dig A Pony, it's sludge."}, {"time": 6671, "text": "Like it's a bit interesting."}, {"time": 6673, "text": "It's not that good."}, {"time": 6673, "text": "It doesn't sound that good."}, {"time": 6675, "text": "White album, like the best half, like Dear Prudence, sounds perfect, sounds simple."}, {"time": 6680, "text": "Cry Baby Cry, it's not simple."}, {"time": 6681, "text": "Back in the USSR, super complex."}, {"time": 6685, "text": "So sushi is like that."}, {"time": 6686, "text": "It's because it's so incredibly not simple starting with the rice."}, {"time": 6691, "text": "You try to refine it to make it appear super simple, and that's the most complex thing of all."}, {"time": 6697, "text": "So do you admire, I mean, we're not talking about days, weeks, months."}, {"time": 6703, "text": "We're talking about years, generations of doing the same thing over and over and over again."}, {"time": 6709, "text": "Do you admire that kind of sticking to the, we talked about our admiration of the weird."}, {"time": 6716, "text": "That doesn't feel weird."}, {"time": 6717, "text": "That seems like discipline and dedication to like a stoic minimalism or something like that."}, {"time": 6725, "text": "I'm happy they do it, but I actually feel bad about it."}, {"time": 6727, "text": "I feel they're sacrificial victims to me, which I benefit from."}, {"time": 6732, "text": "But don't you ever think like, gee, you're a great master sushi chef."}, {"time": 6736, "text": "Wouldn't you be happier if you did something else?"}, {"time": 6741, "text": "Doesn't seem to happen."}, {"time": 6743, "text": "That might be something that a weird mind would think."}, {"time": 6745, "text": "Maybe it is weird people, and maybe they're really enjoying it, but like to learn how to pack rice for 10 years before they let you do anything else."}, {"time": 6755, "text": "It's like these Indian, you know, sarod players."}, {"time": 6757, "text": "They just spent five years tapping out rhythms before they're allowed to touch their instruments."}, {"time": 6763, "text": "Well, actually to defend that."}, {"time": 6766, "text": "It's kind of like graduate school, right?"}, {"time": 6768, "text": "Well, I think graduate school, perhaps."}, {"time": 6773, "text": "Graduate school is full of, like every single day is full of surprises, I would say."}, {"time": 6780, "text": "I did martial arts for a long time."}, {"time": 6781, "text": "I do martial arts, and I've always loved, it's kind of the Russian way of drilling, is doing the same technique."}, {"time": 6789, "text": "I don't know if this applies into intellectual or academic disciplines, where you can do the same thing over and over and over again, thousands and thousands and thousands of times."}, {"time": 6799, "text": "What I've discovered through that process is you get to start to appreciate the tiniest of details and find the beauty in them."}, {"time": 6809, "text": "People who go to like monasteries to meditate talk about this, is when you just sit in silence and don't do anything, you start to appreciate how much complexity and beauty there is in just the movement of a finger."}, {"time": 6823, "text": "Like you can spend the whole day joyously thinking about how fun it is to move a finger."}, {"time": 6829, "text": "And then you can almost become your full weird self about the tiniest details of life."}, {"time": 6836, "text": "As a thing, you've got to wonder, like, is there a free lunch in there?"}, {"time": 6839, "text": "Are the rest of us moving around too much?"}, {"time": 6844, "text": "They sure feel like they found a free lunch."}, {"time": 6846, "text": "The people meditate, they're onto something."}, {"time": 6849, "text": "I tend to think it's like artists, that some percent of people are like that, but most are not."}, {"time": 6854, "text": "And for most of us, there's no free lunch."}, {"time": 6856, "text": "Like my free lunch is to move around a lot."}, {"time": 6859, "text": "In search of lunch, in fact."}, {"time": 6860, "text": "Well, with all the food talk, you made me hungry."}, {"time": 6864, "text": "What books, three or so books, if any come to mind, technical fiction, philosophical, would you recommend, had a big impact on you, or you just drew some insights from throughout your life?"}, {"time": 6880, "text": "Well, two of them we've already discussed."}, {"time": 6882, "text": "One is Plato's Dialogues, which I started reading when I was like 13."}, {"time": 6887, "text": "Another is Ayn Rand, Capitalism, the Unknown Ideal."}, {"time": 6891, "text": "But I would say the Friedrich Hayek essay, The Use of Knowledge in Society, which is about how decentralized mechanisms can work, also why they might go wrong."}, {"time": 6901, "text": "And that's where you start to understand the price system, capitalism."}, {"time": 6905, "text": "And that was in a book called Individualism and Economic Order, but it was just a few essays in that book."}, {"time": 6910, "text": "Those are maybe the three I would cite."}, {"time": 6912, "text": "Can you elaborate a little bit on the... Say the price of copper goes up, right?"}, {"time": 6916, "text": "Because there's a problem with the copper mine in Chile or Bolivia."}, {"time": 6920, "text": "So the price of copper goes up."}, {"time": 6921, "text": "All around the world, people are led to economize copper, to look for substitutes for copper, to change their production processes, to change the goods and services they buy, to build homes a different way."}, {"time": 6933, "text": "And this one event creates this one tiny change in information."}, {"time": 6938, "text": "This gets into your AI work very directly."}, {"time": 6941, "text": "And how much complexity that one change engenders in a meaningful, coherent way, how the different pieces of the price system fit together."}, {"time": 6950, "text": "Hayek really laid out very clearly."}, {"time": 6953, "text": "And it's like an AI problem."}, {"time": 6956, "text": "And how well, not for everything, but for many things, we solve that AI problem."}, {"time": 6960, "text": "I learned, I was, I think 13, maybe 14 when I read Hayek."}, {"time": 6964, "text": "Yeah, the distributed nature of things there."}, {"time": 6967, "text": "And it's like your work on human attention, like how much can we take in?"}, {"time": 6971, "text": "Very often not that much."}, {"time": 6973, "text": "And how many of the advances of modern civilization you need to understand as a response to that constraint."}, {"time": 6979, "text": "I got that also from Hayek."}, {"time": 6981, "text": "And what's the title of the book again?"}, {"time": 6983, "text": "It's reprinted in a lot of books at this point."}, {"time": 6986, "text": "But back then the book was called Individualism and Economic Order."}, {"time": 6990, "text": "But the essay is online."}, {"time": 6991, "text": "Hayek, Use of Knowledge in Society."}, {"time": 6994, "text": "There are open access versions of it through Google."}, {"time": 6997, "text": "And you don't need the whole book."}, {"time": 6999, "text": "So it's a very good book."}, {"time": 7000, "text": "Again, one of those profound looking over the ocean, maybe sitting on a porch, maybe with a drink of some kind."}, {"time": 7010, "text": "And a young kid comes by and asks you for advice."}, {"time": 7015, "text": "What advice would you give to?"}, {"time": 7016, "text": "A drink."}, {"time": 7017, "text": "That's my advice."}, {"time": 7020, "text": "So, okay, after that, what advice would you give to a young person today as they take on life?"}, {"time": 7030, "text": "Whether a career in academia in general or just a life, which is probably more important than career."}, {"time": 7039, "text": "Most good advice is context specific."}, {"time": 7042, "text": "But here are my two generic pieces of advice."}, {"time": 7045, "text": "First, get a mentor."}, {"time": 7047, "text": "Both career, but anything you wanna learn."}, {"time": 7049, "text": "Like say you wanna learn about contemporary art."}, {"time": 7051, "text": "People write me this."}, {"time": 7053, "text": "Oh, what book should I read?"}, {"time": 7054, "text": "It's probably not gonna work that way."}, {"time": 7056, "text": "You need a mentor."}, {"time": 7057, "text": "Yes, you should read some books on it."}, {"time": 7059, "text": "But you want a mentor to help you frame them, take you around to some art, talk about it with you."}, {"time": 7063, "text": "So get as many mentors as you can in the things you wanna learn."}, {"time": 7067, "text": "And then... Can I ask you a quick tangent on that?"}, {"time": 7072, "text": "Presumably a good mentor."}, {"time": 7075, "text": "Is there..."}, {"time": 7076, "text": "I'm begging the question in there."}, {"time": 7076, "text": "It's complicated, right?"}, {"time": 7079, "text": "Well, it is complicated."}, {"time": 7080, "text": "Is there a lot of damage to be done from a bad mentor?"}, {"time": 7083, "text": "I don't think that much because it's very easy to drop mentors."}, {"time": 7086, "text": "And in fact, it's quite hard to maintain them."}, {"time": 7087, "text": "Good mentors tend to be busy."}, {"time": 7089, "text": "Bad mentors tend to be busy."}, {"time": 7092, "text": "And you can try on mentors and maybe they're not good for you, but there's a good chance you'll learn something."}, {"time": 7099, "text": "Like I had a mentor, I was an undergrad."}, {"time": 7101, "text": "He was a Stalinist."}, {"time": 7102, "text": "He edited the book called The Essential Stalin."}, {"time": 7104, "text": "Brilliant guy."}, {"time": 7105, "text": "I learned a tremendous amount from him."}, {"time": 7108, "text": "Was he like as a Stalinist a good mentor for me?"}, {"time": 7110, "text": "Fan of Hayek?"}, {"time": 7112, "text": "But for a year it was tremendous."}, {"time": 7118, "text": "He introduced me like to Soviet and Eastern European science fiction because he was a Marxist."}, {"time": 7123, "text": "Like that's what I took from him among other things."}, {"time": 7125, "text": "Any advice on finding a good mentor?"}, {"time": 7127, "text": "Daniel Kahneman has... Somebody just popped this to mind as somebody who was able to find exceptionally good collaborators throughout his life."}, {"time": 7137, "text": "There's not many bright minds that find collaborators."}, {"time": 7140, "text": "They often, which I ultimately see what a mentor is."}, {"time": 7147, "text": "Be interesting, be direct and try."}, {"time": 7150, "text": "It's not like a perfect formula, but it's amazing how many people don't even do those things."}, {"time": 7157, "text": "Like what you want from a better known person, I would just say be very direct with them."}, {"time": 7164, "text": "What's the second piece of advice?"}, {"time": 7166, "text": "Build small groups of peers."}, {"time": 7169, "text": "They don't have to be your age, but very often they'll be your age, especially if you're younger with broadly similar interests, but there can be different points of view."}, {"time": 7177, "text": "People you hang out with, which can include in a WhatsApp group online and like every day or almost every day, they're talking about the thing you care about, trying to solve problems in that thing."}, {"time": 7188, "text": "And that's your small group and you really like them and they like you and you care what you think about each other and you have this common interest."}, {"time": 7195, "text": "That's for human connection or that's for development of ideas?"}, {"time": 7198, "text": "It's both, they're not that different."}, {"time": 7201, "text": "Like Beatles, classic small group, right?"}, {"time": 7205, "text": "But there's so much drama."}, {"time": 7206, "text": "The Florentine artists, of course there's drama and small groups tend to split up, which is fine, just like entering relationships off an end."}, {"time": 7214, "text": "But it's remarkable how little has been done that was not done in small groups in some way."}, {"time": 7219, "text": "So speaking of loss of beautiful relationships, where do you make this whole love thing?"}, {"time": 7229, "text": "Why do humans fall in love?"}, {"time": 7231, "text": "What's the role of love, friendship, family in life?"}, {"time": 7237, "text": "In a successful life or just life in general?"}, {"time": 7240, "text": "Why the hell are we so into this thing?"}, {"time": 7242, "text": "There are multiple layers of understanding that question."}, {"time": 7244, "text": "So kind of the lowest layer is the Darwinian answer, right?"}, {"time": 7248, "text": "If we weren't this way, we wouldn't have been successful in reproducing and building alliances."}, {"time": 7254, "text": "It's important to realize that's far from complete."}, {"time": 7257, "text": "Sort of the highest understanding would be poetic, like read John Keats or many other love poets."}, {"time": 7263, "text": "So who do I go to to find out, to learn about love in terms of poets or?"}, {"time": 7267, "text": "I would say start with John Keats."}, {"time": 7270, "text": "But given that you're fluent in Russian."}, {"time": 7273, "text": "Yeah, let's go Russian literature for a second."}, {"time": 7276, "text": "Like you keep mentioning Russia."}, {"time": 7278, "text": "What's your connection?"}, {"time": 7281, "text": "What's your love in Russia?"}, {"time": 7285, "text": "Well, first it's all interesting, but more concretely, my wife was born in Moscow."}, {"time": 7289, "text": "So Kolniki was her neighborhood."}, {"time": 7293, "text": "And she grew up there."}, {"time": 7294, "text": "I married her here."}, {"time": 7296, "text": "My daughter, I adopted her."}, {"time": 7298, "text": "I'm not her biological father, but I genuinely raised her."}, {"time": 7301, "text": "She was born in Russia, though she came here when she was one."}, {"time": 7305, "text": "My father in law."}, {"time": 7306, "text": "So you're basically Russian."}, {"time": 7308, "text": "I'm a New Jersey boy."}, {"time": 7309, "text": "That's the same thing."}, {"time": 7311, "text": "I'm very sorry to report."}, {"time": 7312, "text": "My father in law passed away a week ago."}, {"time": 7314, "text": "He lived with us for six years."}, {"time": 7317, "text": "He lived in Russia till he was, oh, 70."}, {"time": 7321, "text": "Saw Stalinist error."}, {"time": 7324, "text": "His father was brought to a camp, lived through World War II."}, {"time": 7327, "text": "Much, much more."}, {"time": 7329, "text": "Had an incredible life."}, {"time": 7331, "text": "Never really learned how to speak English."}, {"time": 7334, "text": "So I absorbed something Russian from him as well."}, {"time": 7337, "text": "He was part Armenian."}, {"time": 7340, "text": "So that's my connection to Russia."}, {"time": 7341, "text": "A bit of the Russian soul, too."}, {"time": 7344, "text": "I don't think I have it."}, {"time": 7345, "text": "I think I appreciate it."}, {"time": 7347, "text": "But there's division of labor, right?"}, {"time": 7349, "text": "Others in the family."}, {"time": 7351, "text": "Take care of that."}, {"time": 7352, "text": "I'm more superficial."}, {"time": 7354, "text": "You mentioned Keats and that higher version, that non Darwinian love."}, {"time": 7359, "text": "That it's the highest form of human connection and it's intoxicating and it's part of building a life."}, {"time": 7366, "text": "And most of us are very, very strongly drawn to it."}, {"time": 7370, "text": "And it's part of the highest realization of you being what you can be."}, {"time": 7376, "text": "He mentioned you lost."}, {"time": 7377, "text": "But ask a Russian."}, {"time": 7378, "text": "I mean, this is a superficial New Jersey boy who grew up listening to Bruce Springsteen and that was his romanticism."}, {"time": 7385, "text": "What's your favorite Bruce Springsteen song?"}, {"time": 7389, "text": "I think the album Born to Run has actually held up the best."}, {"time": 7394, "text": "Though it's very fashionable to think the earlier or later works are actually better."}, {"time": 7398, "text": "And that's the overproduced super pop album."}, {"time": 7401, "text": "But the quality of the songs, to me Born to Run is just far and away the best."}, {"time": 7405, "text": "Then Darkness on the Edge of Town."}, {"time": 7407, "text": "And those are still my favorites."}, {"time": 7409, "text": "Born to Run is an incredible song."}, {"time": 7413, "text": "And perfectly produced in a Phil Spector kind of way."}, {"time": 7416, "text": "Every detail is right."}, {"time": 7418, "text": "Every lyric."}, {"time": 7419, "text": "What else is on the album?"}, {"time": 7420, "text": "Thunder Road, Jungle Land, Tenth Avenue, Freeze Out."}, {"time": 7423, "text": "She's the one, unbelievable."}, {"time": 7426, "text": "Yeah, Bruce is amazing."}, {"time": 7427, "text": "Leading across the river."}, {"time": 7428, "text": "I really like when he goes into love personally."}, {"time": 7435, "text": "Like I'm on fire."}, {"time": 7437, "text": "That's a very good song, Dancing in the Dark."}, {"time": 7440, "text": "A lot of the later work, I find the percussion becomes too simple and kind of too white somehow."}, {"time": 7446, "text": "And a little clunky."}, {"time": 7448, "text": "And it's still good work."}, {"time": 7449, "text": "He's super talented, but it doesn't speak to me."}, {"time": 7452, "text": "But when it all bursts open into the open road, like it does on Born to Run, that's magic."}, {"time": 7460, "text": "Or Rosalita."}, {"time": 7461, "text": "Have you ever seen him live?"}, {"time": 7463, "text": "Yes, twice."}, {"time": 7466, "text": "I wonder what he's like live when he was young, right?"}, {"time": 7468, "text": "Those years."}, {"time": 7469, "text": "I saw him live when he was young."}, {"time": 7471, "text": "I was young."}, {"time": 7472, "text": "New Jersey."}, {"time": 7474, "text": "I was a little disappointed actually."}, {"time": 7477, "text": "I think what I like best from him is quite studio."}, {"time": 7481, "text": "He certainly played well."}, {"time": 7482, "text": "I don't fault his performance."}, {"time": 7484, "text": "But it's like when I saw Plant and Page of Led Zeppelin."}, {"time": 7487, "text": "Tremendous creators."}, {"time": 7488, "text": "And they showed up."}, {"time": 7489, "text": "They were not drunk."}, {"time": 7490, "text": "Like they were paying attention."}, {"time": 7492, "text": "But I was underwhelmed."}, {"time": 7494, "text": "Because Led Zeppelin, like the Beatles White album, is much more of a studio band than you think at first."}, {"time": 7499, "text": "And in the case of Bruce Springsteen, I don't know about you, but for me, he's somebody that I connect with the most when I'm alone and there's like a melancholy feeling."}, {"time": 7510, "text": "And actually, my folks live in Philly."}, {"time": 7512, "text": "I went to school in Philly."}, {"time": 7514, "text": "And so, you know, I've, I think I've."}, {"time": 7518, "text": "You're almost worthy of New Jersey then."}, {"time": 7520, "text": "Yeah, well you're, you're almost worthy of Russia."}, {"time": 7524, "text": "So we're, we can connect."}, {"time": 7527, "text": "And then ask, but I mean, I love Jersey."}, {"time": 7528, "text": "This is something I feel like, I feel like, I don't know."}, {"time": 7534, "text": "It's always, there's this beautiful, like there's a diner, Olga's Diner that closed down."}, {"time": 7539, "text": "I used to go there."}, {"time": 7541, "text": "There's, there's a melancholy feeling to me."}, {"time": 7544, "text": "A thickness to culture in that part of the world."}, {"time": 7547, "text": "Which is oddly similar to some elements of the thickness of Russian culture."}, {"time": 7551, "text": "And when you see like Russian characters on the Sopranos, it totally makes sense, even though there are these complete outliers."}, {"time": 7559, "text": "Exactly, it totally makes sense."}, {"time": 7561, "text": "You've, you mentioned you lost your father in law last week."}, {"time": 7566, "text": "Do you think about mortality?"}, {"time": 7574, "text": "I don't think about my own mortality that much, which is probably a good thing."}, {"time": 7579, "text": "I think death will be bad."}, {"time": 7582, "text": "I wouldn't say I'm afraid of it."}, {"time": 7583, "text": "For me, the worst thing about death is not knowing how the human story turns out."}, {"time": 7588, "text": "The full human story."}]}]