[{"title": "Dan Carlin: Hardcore History | Lex Fridman Podcast #136", "id": "-k-ztNsBM54", "quotes": [{"time": 413, "text": "In other words, to glorify himself."}, {"time": 415, "text": "And if that's the case, does that make Alexander a worse person than Hitler because Hitler thought he was doing good, whereas Alexander, if you believe the interpretation, was simply trying to exalt Alexander."}, {"time": 428, "text": "So the motivations of the people doing these things, it seems to me, matter."}, {"time": 434, "text": "I don't think you can just sit there and go, the only thing that matters is the end result, because that might've been an unintentional byproduct, in which case, that person, had you been able to show them the future, might have changed what they were doing."}, {"time": 447, "text": "So were they evil or misguided or wrong or made the wrong?"}, {"time": 450, "text": "So, and I hate to do that because there's certain people like Hitler that I don't feel deserve the benefit of the doubt."}, {"time": 456, "text": "At the same time, if you're fascinated by the concept of evil and you delve into it deeply enough, you're going to want to understand why these evil people did what they did."}, {"time": 466, "text": "And sometimes it can confuse the hell out of you."}, {"time": 469, "text": "You know, who wants to sit there and try to see things from Hitler's point of view to get a better understanding and sort of commiserate with."}, {"time": 474, "text": "So, but I'm, obviously, first history show, I'm fascinated with the concept."}, {"time": 479, "text": "So do you think it's possible, if we put ourselves in the mindset of some of the people that have led, created so much suffering in the world, that all of them had their motivations were, had good intentions underlying them?"}, {"time": 495, "text": "No, I don't, it's simply because there's so many, I mean, the law of averages would suggest that that's not true."}, {"time": 501, "text": "I guess it is pure evil possible, meaning you, again, it's slippery, but you, the suffering is the goal."}, {"time": 511, "text": "Suffering, intentional suffering."}, {"time": 514, "text": "Yes, I think that, and I think that there's historical figures that one could point, but that gets to the deeper question of, are these people sane?"}, {"time": 522, "text": "Do they have something wrong with them?"}, {"time": 523, "text": "Are they twisted from something in their youth?"}, {"time": 528, "text": "You know, these are the kinds of things where you start to delve into the psychological makeup of these people."}, {"time": 533, "text": "In other words, is anybody born evil?"}, {"time": 536, "text": "And I actually believe that some people are."}, {"time": 538, "text": "I think the DNA can get scrambled up in ways."}, {"time": 541, "text": "I think the question of evil is important too, because I think it's an eye of the beholder thing."}, {"time": 545, "text": "I mean, if Hitler, for example, had been successful and we were today on the sixth or seventh leader of the Third Reich, since I think his entire history would be viewed through a different lens, because that's the way we do things, right?"}, {"time": 560, "text": "Genghis Khan looks different to the Mongolians than he does to the residents of Baghdad, right?"}, {"time": 565, "text": "And I think, so an eye of the beholder question, I think comes into all these sorts of things."}, {"time": 570, "text": "As you said, it's a very slippery question."}, {"time": 572, "text": "Where do you put, as somebody who's fascinated by military history, where do you put violence in terms of the human condition?"}, {"time": 583, "text": "Is it core to being human or is it just a little tool that we use every once in a while?"}, {"time": 589, "text": "So I'm gonna respond to your question with a question."}, {"time": 592, "text": "What do you see the difference being between violence and force?"}, {"time": 597, "text": "Let me go farther."}, {"time": 598, "text": "I'm not sure that violence is something that we have to put up with as human beings forever, that we must resign ourselves to violence forever."}, {"time": 609, "text": "But I have a much harder time seeing us able to abolish force."}, {"time": 615, "text": "And there's going to be some ground where if those two things are not the same, and I don't know that maybe they are, where there's certainly some crossover."}, {"time": 625, "text": "And I think force, you're an engineer, you'll understand this better than I did, but think about it as a physical law."}, {"time": 632, "text": "If you can't stop something from moving in a certain direction without pushing back in that same direction, I'm not sure that you can have a society or a civilization without the ability to use a counter force when things are going wrong, whether it's on an individual level, right?"}, {"time": 653, "text": "A person attacks another person, so you step in to save that person, or even at the highest levels of politics or anything else, a counter force to stop the inertia or the impetus of another movement."}, {"time": 667, "text": "So I think that force is a simple, almost law of physics in human interaction, especially at the civilizational level."}, {"time": 675, "text": "I think civilization requires a certain amount of, if not violence, then force."}, {"time": 682, "text": "And again, they've talked, I mean, it goes back into St. Augustine, all kinds of Christian beliefs about the proper use of force and people have philosophically tried to decide between can you have sort of an ahimsa, Buddhists sort of, we will be nonviolent toward everything and exert no force, or there's a reason to have force in order to create the space for good."}, {"time": 704, "text": "I think force is inevitable."}, {"time": 707, "text": "Now, we can talk, and I've not come up to the conclusion myself, if there is a distinction to be made between force and violence."}, {"time": 714, "text": "I mean, is a nonviolent force enough, or is violence when done for the cause of good a different thing than violence done either for the cause of evil, as you would say, or simply for random reasons?"}, {"time": 728, "text": "I mean, we humans lack control sometimes."}, {"time": 730, "text": "We can be violent for no apparent reason or goal."}, {"time": 735, "text": "I mean, you look at the criminal justice system alone and the way we interact with people who are acting out in ways that we as a society have decided is intolerable."}, {"time": 745, "text": "Can you deal with that without force and at some level violence?"}, {"time": 750, "text": "Can you maintain peacefulness without force?"}, {"time": 754, "text": "Just to be a little bit more specific about the idea of force, do you put force as general enough to include force in the space of ideas?"}, {"time": 765, "text": "So you mentioned Buddhism or religion or just Twitter."}, {"time": 773, "text": "I can think of no things farther apart than that."}, {"time": 778, "text": "Is the battles we do in the space of ideas of the great debates throughout history, do you put force into that?"}, {"time": 789, "text": "Or do you, in this conversation, are we trying to right now keep it to just physical force in saying that you have an intuition that force might be with us much longer than violence?"}, {"time": 805, "text": "I think the two bleed together."}, {"time": 807, "text": "So take, because it's always my go to example."}, {"time": 813, "text": "I'm afraid and I'm sure that the listeners all hate it, but take Germany during the 1920s, early 1930s, before the Nazis came to power."}, {"time": 822, "text": "And they were always involved in some level of force, beating up in the streets or whatever it might be."}, {"time": 826, "text": "But think about it more like an intellectual discussion until a certain point."}, {"time": 833, "text": "It would be difficult, I imagine, to keep the intellectual counter force of ideas from at some point degenerating into something that's more coercion, counter force, if we want to use the phrases we were just talking about."}, {"time": 849, "text": "So I think the two are intimately connected."}, {"time": 851, "text": "I mean, actions follow thought, right?"}, {"time": 854, "text": "And at a certain point, I think, especially when one is not achieving the goals that they want to achieve through a peaceful discussion or argumentation or trying to convince the other side, that sometimes the next level of operations is something a little bit more physically imposing, if that makes sense."}, {"time": 874, "text": "We go from the intellectual to the physical."}, {"time": 876, "text": "Yeah, so it too easily spills over into violence."}, {"time": 879, "text": "Yes, and one leads to the other often."}, {"time": 881, "text": "So you kind of implied perhaps a hopeful message."}, {"time": 885, "text": "Let me ask it in the form of a question."}, {"time": 891, "text": "I think it goes to the first question too."}, {"time": 892, "text": "So for example, what do you do?"}, {"time": 896, "text": "I mean, let's play with nation states now, although I don't know that nation states are something we should think of as a permanent construct forever."}, {"time": 906, "text": "But how is one nation state supposed to prevent another nation state from acting in ways that it would see as either detrimental to the global community or detrimental to the interest of their own nation state?"}, {"time": 920, "text": "I think we've had this question of going back to ancient times, but certainly in the 20th century, this has come up quite a bit."}, {"time": 927, "text": "I mean, the whole Second World War argument sometimes revolves around the idea of what the proper counterforce should be."}, {"time": 934, "text": "Can you create an entity, a league of nations, the United Nations, a one world entity maybe even that alleviates the need for counterforce involving mass violence and armies and navies and those things?"}, {"time": 947, "text": "I think that's an open discussion we're still having."}, {"time": 951, "text": "It's good to think through that because having something like a United Nations, there's usually a centralized control."}, {"time": 959, "text": "So there's humans at the top, there's committees and usually like leaders emerge as singular figures that then can become corrupted by power."}, {"time": 970, "text": "And it's just a really important, it feels like a really important thought experiment and something to really rigorously think through."}, {"time": 978, "text": "How can you construct systems of government that are stable enough to push us towards less and less war and less and less unstable and another tough word, another tough word which is unfair of application of force?"}, {"time": 999, "text": "You know, that's really at the core of the question that we're trying to figure out as humans, as our weapons get better and better and better destroying ourselves, it feels like it's important to think about how we minimize the over application or unfair application of force."}, {"time": 1017, "text": "There's other elements that come into play too."}, {"time": 1019, "text": "You and I are discussing this at the very high intellectual level of things, but there's also a tail wagging the dog element to this."}, {"time": 1025, "text": "So think of a society of warriors, a tribal society from a long time ago."}, {"time": 1031, "text": "How much do the fact that you have warriors in your society and that their reason for existing, what they take pride in, what they train for, what their status in their own civilization, how much does that itself drive the responses of that society, right?"}, {"time": 1048, "text": "How much do you need war to legitimize warriors?"}, {"time": 1053, "text": "That's the old argument that you get to and we've had this in the 20th century too, that the creation of arms and armies creates an incentive to use them, right?"}, {"time": 1062, "text": "And that they themselves can drive that incentive as a justification for their reasons for existence."}, {"time": 1070, "text": "That's where we start to talk about the interactivity of all these different elements of society upon one another."}, {"time": 1075, "text": "So when we talk about governments and war, well, you need to take into account the various things those governments have put into place in terms of systems and armies and things like that to protect themselves, right?"}, {"time": 1086, "text": "For reasons we can all understand, but they exert a force on your range of choices, don't they?"}, {"time": 1094, "text": "You're making me realize that in my upbringing and I think upbringing of many, warriors are heroes."}, {"time": 1101, "text": "To me, I don't know where that feeling comes from, but to sort of die fighting is an honorable way to die, it feels like that."}, {"time": 1114, "text": "I've always had a problem with this because as a person interested in military history, the distinction is important and I try to make it at different levels."}, {"time": 1122, "text": "So at base level, the people who are out there on the front lines doing the fighting, to me, those people can be compared with police officers and firemen and people, fire persons, but I mean, people that are involved in an ethical attempt to perform a task which ultimately one can see in many situations as being a saving sort of task, right?"}, {"time": 1152, "text": "Or if nothing else, a self sacrifice for what they see as the greater good."}, {"time": 1157, "text": "Now, I draw a distinction between the individuals and the entity that they're a part of, a military, and I certainly draw a distinction between the military and then the entire, for lack of a better word, military industrial complex that that service is a part of."}, {"time": 1172, "text": "I feel a lot less moral attachment to those upper echelons than I do the people on the ground."}, {"time": 1180, "text": "The people on the ground could be any of us and have been in a lot of, we have a very professional sort of military now where it's a very, a subset of the population, but in other periods of time, we've had conscription and drafts and it hasn't been a subset of the population, it's been the population, right?"}, {"time": 1198, "text": "And so it is the society oftentimes going to war and I make a distinction between those warriors and the entities either in the system that they're a part of the military or the people that control the military at the highest political levels."}, {"time": 1212, "text": "I feel a lot less moral attachment to them and I'm much harsher about how I feel about them."}, {"time": 1219, "text": "I do not consider the military itself to be heroic and I do not consider the military industrial complex to be heroic."}, {"time": 1228, "text": "I do think that is a tail wagging the dog situation."}, {"time": 1231, "text": "I do think that draws us into looking at military endeavors as a solution to the problem much more quickly than we otherwise might."}, {"time": 1241, "text": "And to be honest, to tie it all together, I actually look at the victims of this as the soldiers we were talking about."}, {"time": 1247, "text": "If you set a fire to send firemen into to fight, then I feel bad for the firemen."}, {"time": 1255, "text": "I feel like you've abused the trust that you give those people, right?"}, {"time": 1258, "text": "So when people talk about war, I always think that the people that we have to make sure that a war is really necessary in order to protect are the people that you're gonna send over there to fight that."}, {"time": 1270, "text": "The greatest victims in our society of war are often the warriors."}, {"time": 1274, "text": "So in my mind, when we see these people coming home from places like Iraq, a place where I would have made the argument and did at the time that we didn't belong."}, {"time": 1284, "text": "To me, those people are victims and I know they don't like to think about themselves that way because it runs totally counter to the ethos."}, {"time": 1291, "text": "But if you're sending people to protect this country's shores, those are heroes."}, {"time": 1297, "text": "If you're sending people to go do something that they otherwise probably don't need to do but they're there for political reasons or anything else you wanna put in that's not defense related, well then you've made victims of our heroes."}, {"time": 1308, "text": "And so I feel like we do a lot of talk about our troops and our soldiers and stuff but we don't treat them as valuable as the rhetoric makes them sound."}, {"time": 1319, "text": "Otherwise, we would be much more careful about where we put them."}, {"time": 1325, "text": "If you're gonna send my son, and I don't have a son, I have daughters, but if you're gonna send my son into harm's way, I'm going to demand that you really need to be sending him into harm's way and I'm going to be angry at you if you put him into harm's way if it doesn't warrant it."}, {"time": 1371, "text": "Yeah, and as my own family history, it would be nice if we could talk about there's a gray area in the places that you're talking about."}, {"time": 1381, "text": "There's a gray area in everything."}, {"time": 1385, "text": "But when that gray area is part of your own blood, as it is for me, it's worth shining a light on somehow."}, {"time": 1396, "text": "Sure, give me an example of what you mean."}, {"time": 1397, "text": "So you did a program of four episodes of Ghosts of the Ostfront."}, {"time": 1403, "text": "So I was born in the Soviet Union."}, {"time": 1406, "text": "I was raised in Moscow."}, {"time": 1407, "text": "My dad was born and raised in Kiev."}, {"time": 1410, "text": "My grandmother, who just recently passed away, was raised in Ukraine."}, {"time": 1418, "text": "A city."}, {"time": 1419, "text": "It's a small city on the border between Russia and Ukraine."}, {"time": 1424, "text": "I have a grandfather born in Kiev."}, {"time": 1425, "text": "In Kiev."}, {"time": 1426, "text": "The interesting thing about the timing of everything, as you might be able to connect, is she survived."}, {"time": 1432, "text": "She's the most badass woman I've ever encountered in my life and most of the warrior spirit I carry is probably from her."}, {"time": 1441, "text": "She survived Polar Mor, the Ukrainian starvation of the 30s."}, {"time": 1445, "text": "She was a beautiful teenage girl during the Nazi occupation of, so she survived all of that."}, {"time": 1454, "text": "And of course, family that everybody, and so many people died through that whole process."}, {"time": 1461, "text": "And one of the things you talk about in your program is that the gray area is, even with the warriors, it happened to them, just like as you're saying now, they didn't have a choice."}, {"time": 1475, "text": "So my grandfather on the other side, he was a machine gunner that was in Ukraine that."}, {"time": 1485, "text": "In the Red Army?"}, {"time": 1486, "text": "In the Red Army, yeah."}, {"time": 1488, "text": "And they threw, like the statement was that there's, I don't know if it's obvious or not, but the rule was there's no surrender."}, {"time": 1497, "text": "So you better die."}, {"time": 1499, "text": "So you, I mean, you're basically, the goal was when he was fighting and he was lucky enough, one of the only to survive by being wounded early on is there was a march of Nazis towards, I guess, Moscow."}, {"time": 1516, "text": "And the whole goal in Ukraine was to slow every, to slow them into the winter."}, {"time": 1523, "text": "I mean, I view him as such a hero and he believed that he's indestructible, which is survivor bias."}, {"time": 1533, "text": "And that, you know, bullets can't hurt him."}, {"time": 1537, "text": "And that's what everybody believed."}, {"time": 1539, "text": "And of course, basically everyone that, he quickly rose to the ranks, let's just put it this way, because everybody died."}, {"time": 1548, "text": "It was just bodies dragging these heavy machine guns, like always, you know, always slowly retreating, shooting and retreating, shooting and retreating."}, {"time": 1559, "text": "And I don't know, he was a hero to me, like I always, I grew up thinking that he was the one that sort of defeated the Nazis, right?"}, {"time": 1571, "text": "And, but the reality that there could be another perspective, which is all of this happened to him by the incompetence of Stalin, the incompetence and men of the Soviet Union being used like pawns in a shittily played game of chess, right?"}, {"time": 1590, "text": "So like the one narrative is of him as a victim, as you're kind of describing."}, {"time": 1597, "text": "And then somehow that's more paralyzing and that's more, I don't know, it feels better to think of him as a hero and as Russia, Soviet Union saving the world."}, {"time": 1612, "text": "I mean, that narrative also, is in the United States that the United States was key in saving the world from the Nazis."}, {"time": 1620, "text": "It feels like that narrative is powerful for people."}, {"time": 1623, "text": "I'm not sure, and I carry it still with me, but when I think about the right way to think about that war, I'm not sure if that's the correct narrative."}, {"time": 1634, "text": "Let me suggest something."}, {"time": 1635, "text": "There's a line that a Marine named Eugene Sledge had to say once and I keep it on my phone because it's, it makes a real distinction."}, {"time": 1645, "text": "And he said, the front line is really where the war is."}, {"time": 1650, "text": "And anybody, even a hundred yards behind the front line doesn't know what it's really like."}, {"time": 1656, "text": "Now, the difference is, is there are lots of people miles behind the front line that are in danger, right?"}, {"time": 1662, "text": "You can be in a medical unit in the rear and artillery could strike you, planes could strike me."}, {"time": 1666, "text": "You could be in danger, but at the front line, there are two different things."}, {"time": 1670, "text": "One is that, and at least, and I'm doing a lot of reading on this right now and reading a lot of veterans accounts."}, {"time": 1677, "text": "James Jones, who wrote books like From Here to Eternity, fictional accounts of the Second World War, but he based them on his own service."}, {"time": 1685, "text": "He was at Guadalcanal, for example, in 1942."}, {"time": 1688, "text": "And Jones had said that the evolution of a soldier in front line action requires a lot of front line action requires an almost surrendering to the idea that you're going to live, that you become accustomed to the idea that you're going to die."}, {"time": 1706, "text": "And he said, you're a different person simply for considering that thought seriously, because most of us don't."}, {"time": 1712, "text": "But what that allows you to do is to do that job at the front line, right?"}, {"time": 1716, "text": "If you're too concerned about your own life, you become less of a good guy at your job, right?"}, {"time": 1724, "text": "The other thing that the people in the 100 yards at the front line do that the people in the rear medical unit really don't, is you kill and you kill a lot, right?"}, {"time": 1734, "text": "You don't just, oh, there's a sniper back here so I shot him."}, {"time": 1736, "text": "It's we go from one position to another and we kill lots of people."}, {"time": 1741, "text": "Those things will change you."}, {"time": 1742, "text": "And what that tends to do, not universally, because I've read accounts from Red Army soldiers and they're very patriotic, right?"}, {"time": 1750, "text": "But a lot of that patriotism comes through years later as part of the nostalgia and the remembering."}, {"time": 1756, "text": "When you're down at that front 100 yards, it is often boiled down to a very small world."}, {"time": 1762, "text": "So your grandfather, was it your grandfather?"}, {"time": 1764, "text": "Grandfather."}, {"time": 1765, "text": "At the machine gun, he's concerned about his position and his comrades and the people who he owes a responsibility to."}, {"time": 1772, "text": "And those, it's a very small world at that point."}, {"time": 1775, "text": "And to me, that's where the heroism is, right?"}, {"time": 1777, "text": "He's not fighting for some giant world, civilizational thing."}, {"time": 1780, "text": "He's fighting to save the people next to him."}, {"time": 1783, "text": "And his own life at the same time because they're saving him too."}, {"time": 1786, "text": "And that there is a huge amount of heroism to that."}, {"time": 1789, "text": "And that gets to our question about force earlier."}, {"time": 1792, "text": "Why would you use force?"}, {"time": 1793, "text": "Well, how about to protect these people on either side of me, right?"}, {"time": 1796, "text": "Their lives."}, {"time": 1799, "text": "Now, is there hatred?"}, {"time": 1801, "text": "Yeah, I hated the Germans for what they were doing."}, {"time": 1803, "text": "As a matter of fact, I got a note from a poll not that long ago."}, {"time": 1807, "text": "And I have this tendency to refer to the Nazis, right?"}, {"time": 1810, "text": "The regime that was, and he said, why do you keep calling them Nazis?"}, {"time": 1814, "text": "He says, say what they were."}, {"time": 1815, "text": "They were Germans."}, {"time": 1817, "text": "And this guy wanted me to not absolve Germany by saying, oh, it was this awful group of people that took over your country."}, {"time": 1824, "text": "He said, the Germans did this."}, {"time": 1826, "text": "And there's that bitterness where he says, let's not forget what they did to us and what we had to do back, right?"}, {"time": 1833, "text": "So for me, when we talk about these combat situations, the reason I call these people heroic is because of, they're fighting to defend things we could all understand."}, {"time": 1842, "text": "I mean, if you come after my brother and I take a machine gun and shoot you and you're gonna overrun me, I mean, that becomes a situation where we talked about counterforce earlier."}, {"time": 1855, "text": "Much easier to call yourself a hero when you're saving people or you're saving this town right behind you."}, {"time": 1859, "text": "And you know, if they get through your machine gun, they're gonna burn these villages."}, {"time": 1863, "text": "They're gonna throw these people out in the middle of winter, these families."}, {"time": 1866, "text": "That to me is a very different sort of heroism than this amorphous idea of patriotism."}, {"time": 1873, "text": "And you know, patriotism is a thing that we often get used with, right?"}, {"time": 1877, "text": "People manipulate us through love of country and all this because they understand that this is something we feel very strongly, but they use it against us sometimes in order to whip up a war fever or to get people."}, {"time": 1889, "text": "I mean, there's a great line and I wish I could remember it in its entirety that Herman Goering had said about how easy it was to get the people into a war."}, {"time": 1897, "text": "He says, you know, you just appeal to their patriotism, you, I mean, there's buttons that you can push and they take advantage of things like love of country and the way we have a loyalty and an admiration to the warriors who put their lives on the line."}, {"time": 1910, "text": "These are manipulatable things in the human species that reliably can be counted on to move us in directions that in a more sober, reflective state of mind we would consider differently."}, {"time": 1925, "text": "It gets the, I mean, you get this war fever up and people wave flags and they start denouncing the enemy and they start signing, you know, we've seen it over and over and over again in ancient times this happened."}, {"time": 1934, "text": "But the love of country is also beautiful."}, {"time": 1937, "text": "So I haven't seen it in America as much."}, {"time": 1939, "text": "So people in America love their country, like this patriotism is strong in America, but it's not as strong as I remember, even with my sort of being younger, the love of the Soviet Union."}, {"time": 1953, "text": "Now, was it the Soviet Union this requires a distinction or was it mother Russia?"}, {"time": 1959, "text": "What it really was, was the communist party."}, {"time": 1961, "text": "Okay, so it was the system in place, okay."}, {"time": 1963, "text": "The system in place, like loving, I haven't quite deeply synchronized exactly what you love."}, {"time": 1969, "text": "I think you love that like populist message of the worker, of the common man, the common person."}, {"time": 1979, "text": "Let me draw the comparison then."}, {"time": 1981, "text": "And I often say this, that the United States like the Soviet Union is an ideological based society, right?"}, {"time": 1989, "text": "So you take a country like France, it doesn't matter which French government you're in now."}, {"time": 1996, "text": "The French have been the French for a long time, right?"}, {"time": 1999, "text": "It's not based on an ideology, right?"}, {"time": 2002, "text": "Whereas what unites the United States is an ideology, freedom, liberty, the constitution."}, {"time": 2008, "text": "This is what draws, you know, it's the e pluribus unum kind of the idea, right?"}, {"time": 2012, "text": "That out of many one, well, what binds all these unique different people?"}, {"time": 2017, "text": "The shared beliefs, this ideology."}, {"time": 2019, "text": "The Soviet Union was the same way."}, {"time": 2020, "text": "Cause as you know, the Soviet Union, Russia was merely one part of the Soviet Union."}, {"time": 2025, "text": "And if you believe the rhetoric until Stalin's time, everybody was going to be united under this ideological banner someday, right?"}, {"time": 2034, "text": "It was a global revolution."}, {"time": 2036, "text": "So ideological societies are different."}, {"time": 2039, "text": "And to be a fan of the ideological framework and goal, I mean, I'm a Liberty person, right?"}, {"time": 2045, "text": "I would like to see everybody in the world have my system of government, which is part of a bias, right?"}, {"time": 2052, "text": "Because they might not want that."}, {"time": 2054, "text": "But I think it's better for everyone cause I think it's better for me."}, {"time": 2057, "text": "At the same time, when the ideology, if you consider, and you know, this stems from ideas of the enlightenment and there's a bias there."}, {"time": 2066, "text": "So my bias are toward the, but you feel, and this is why you say, we're going to bring freedom to Iraq."}, {"time": 2070, "text": "We're going to bring freedom to here."}, {"time": 2071, "text": "We're going to bring freedom because we think we're spreading to you something that is just undeniably positive."}, {"time": 2077, "text": "We're going to free you and give you this."}, {"time": 2082, "text": "It's hard for me to wipe my own bias away from there, right?"}, {"time": 2087, "text": "Cause if I were in Iraq, for example, I would want freedom, right?"}, {"time": 2091, "text": "But if you then leave and let the Iraqis vote for whomever they want, are they going to vote for somebody that will, I mean, you know, you look at Russia now and I hear from Russians quite a bit because so much of my views on Russia and the Soviet Union were formed in my formative years."}, {"time": 2109, "text": "And, you know, we were not hearing from many people in the Soviet Union back then, but now you do."}, {"time": 2114, "text": "You hear from Russians today who will say, your views on Stalin are archaic and cold."}, {"time": 2118, "text": "You know, so you try to reorient your beliefs a little bit, but it goes to this idea of, if you gave the people in Russia a free and fair vote, will they vote for somebody who promises them a free and open society based on enlightenment democratic principles?"}, {"time": 2133, "text": "Or will they vote for somebody, we in the US would go, what are they doing?"}, {"time": 2136, "text": "They're voting for some strong man who's just good."}, {"time": 2138, "text": "You know, so I think it's very hard to throw away our own biases and preconceptions."}, {"time": 2145, "text": "And, you know, it's an all eye of the beholder kind of thing."}, {"time": 2148, "text": "But when you're talking about ideological societies, it is very difficult to throw off all the years of indoctrination into the superiority of your system."}, {"time": 2159, "text": "I mean, listen, in the Soviet Union, Marxism one way or another was part of every classrooms."}, {"time": 2164, "text": "You know, you could be studying geometry and they'll throw Marxism in there somehow, because that's what united the society."}, {"time": 2171, "text": "And that's what gave it a higher purpose."}, {"time": 2173, "text": "And that's what made it in the minds of the people who were its defenders, a superior, morally superior system."}, {"time": 2180, "text": "And we do the same thing here."}, {"time": 2181, "text": "In fact, most people do, but see, you're still French, no matter what the ideology or the government might be."}, {"time": 2188, "text": "So in that sense, it's funny that there would be a cold war with these two systems, because they're both ideologically based systems involving peoples of many different backgrounds who are united under the umbrella of the ideology."}, {"time": 2202, "text": "First of all, that's brilliantly put."}, {"time": 2205, "text": "I'm in a funny position that in my formative years, I came here when I was 13, is when I, you know, teenage is your first love or whatever, is I fell in love with the American set of ideas of freedom and individuals."}, {"time": 2220, "text": "They're compelling, aren't they?"}, {"time": 2221, "text": "They're compelling, yes."}, {"time": 2222, "text": "But I also remember, it's like you remember like maybe an ex girlfriend or something like that."}, {"time": 2227, "text": "I also remember loving as a very different human, the Soviet idea, like we had the national anthem, which is still, I think the most badass national anthem, which is the Soviet Union, like saying we're the indestructible nation."}, {"time": 2244, "text": "I mean, just the words are so, like Americans words are like, oh, we're nice."}, {"time": 2249, "text": "Like we're freedom, but like a Russian Soviet Union national anthem was like, we're bad motherfuckers."}, {"time": 2255, "text": "Nobody will destroy us."}, {"time": 2258, "text": "I just remember feeling pride in a nation as a kid, like dumb not knowing anything because we all had to recite the stuff."}, {"time": 2265, "text": "It was, there's a uniformity to everything."}, {"time": 2268, "text": "There's pride underlying everything."}, {"time": 2270, "text": "I didn't think about all the destructive nature of the bureaucracy, the incompetence, the, you know, all the things that come with the implementation of communism, especially around the eighties and nineties."}, {"time": 2286, "text": "But I remember what it's like to love that set of ideas."}, {"time": 2289, "text": "So I'm in a funny place of like, remember like switching the love because I'm, you know, I kind of joke around about being Russian, but you know, my longterm monogamous relationship is now with the idea, the American ideal."}, {"time": 2303, "text": "Like I'm stuck with it in my mind, but I remember what it was like to love it."}, {"time": 2308, "text": "And I think about that too, when people criticize China or they criticize the current state of affairs with how Stalin is remembered and how Putin is to know that the, you can't always wear the American ideal of individualism, radical individualism and freedom in analyzing the ways of the world elsewhere."}, {"time": 2334, "text": "Like in China, in Russia, that it does, if you don't take yourself too seriously, as Americans all do, as I do, it's kind of a beautiful love to have for your government, to believe in the nation, to let go of yourself and your rights and your freedoms, to believe in something bigger than yourself."}, {"time": 2358, "text": "That's actually, that's a kind of freedom."}, {"time": 2362, "text": "That's, you're actually liberating yourself."}, {"time": 2402, "text": "Not just that, let me add to what you're saying."}, {"time": 2404, "text": "And I'm very, I spend a lot of time trying to get out of my own biases."}, {"time": 2411, "text": "It is a fruitless endeavor longterm, but you try to be better than you normally are."}, {"time": 2416, "text": "One of the critiques that China, and I always, as an American, I tend to think about this as their government, right?"}, {"time": 2422, "text": "This is a rationale that their government puts forward."}, {"time": 2425, "text": "But what you just said is actually, if you can make that viewpoint beautiful is kind of a beautiful way of approaching it."}, {"time": 2432, "text": "The Chinese would say that what we call human rights in the United States and what we consider to be everybody's birthright around the world is instead Western rights."}, {"time": 2442, "text": "That's the words they use, Western rights."}, {"time": 2444, "text": "It's a fundamentally Western oriented, and I'll go back to the enlightenment based ideas, on what constitutes the rights of man."}, {"time": 2455, "text": "And they would suggest that that's not internationally and always applicable, right?"}, {"time": 2460, "text": "That you can make a case, and again, I don't believe this."}, {"time": 2463, "text": "This runs against my own personal views, but that you could make a case that the collective wellbeing of a very large group of people outweighs the individual needs of any single person, especially if those things are in conflict with each other, right?"}, {"time": 2478, "text": "If you cannot provide for the greater good because everyone's so individualistic, well then really what is the better thing to do, right?"}, {"time": 2487, "text": "Is suppress individualism so everybody's better off?"}, {"time": 2490, "text": "I think trying to recognize how someone else might see that is important if we want to, you know, you had talked about eliminating war."}, {"time": 2497, "text": "We talk about eliminating conflict."}, {"time": 2499, "text": "The first need to do that is to try to understand how someone else might view something differently than yourself."}, {"time": 2507, "text": "I'm famously one of those people who buys in to the ideas of traditional Americanism, right?"}, {"time": 2537, "text": "How could you have freedom and liberty and individualistic expression if you had an overriding military that was always fighting wars and the founders of this country looked to other examples like Europe, for example, and saw that standing militaries, for example, standing armies were the enemy of liberty."}, {"time": 2556, "text": "Well, we have a standing army now and one that is totally interwoven in our entire society."}, {"time": 2563, "text": "If you could go back in time and talk to John Quincy Adams, right, early president of the United States and show him what we have now, he would think it was awful and horrible and that somewhere along the line, the Americans had lost their way and forgotten what they were all about."}, {"time": 2581, "text": "But we have so successfully interwoven this modern military industrial complex with the traditional benefits of the American system and ideology so that they've become intertwined in our thinking, whereas 150 years ago, they were actually considered to be at opposite polarities and a threat to one another."}, {"time": 2602, "text": "So when you talk about the love of the nation, I tend to be suspicious of those things."}, {"time": 2609, "text": "I tend to be suspicious of government."}, {"time": 2611, "text": "I tend to try very hard to not be manipulated and I feel like a large part of what they do is manipulation and propaganda."}, {"time": 2620, "text": "And so I think a healthy skepticism of the nation state is actually 100% Americanism in the traditional sense of the word."}, {"time": 2630, "text": "But I also have to recognize, as you so eloquently stated, Americanism is not necessarily universal at all."}, {"time": 2638, "text": "And so I think we have to try to be more understanding."}, {"time": 2642, "text": "See, the traditional American viewpoint is that if a place like China does not allow their people individual human rights, then they're being denied something."}, {"time": 2652, "text": "They're being denied and 100 years ago, they would have said they're God given rights."}, {"time": 2657, "text": "Man is born free and if he's not free, it's because of something done to him, right?"}, {"time": 2662, "text": "The government has taken away his God given rights."}, {"time": 2665, "text": "I'm getting excited just listening to that."}, {"time": 2667, "text": "Well, but I mean, I think the idea that this is universal is in and of itself a bias."}, {"time": 2673, "text": "Now, do I want freedom for everybody else?"}, {"time": 2676, "text": "I sure do."}, {"time": 2676, "text": "But the people in the Soviet Union who really bought into that wanted the workers of the world to unite and not be exploited by the greedy blood sucking people who worked them to death and pocketed all of the fruits of their labor."}, {"time": 2691, "text": "If you frame it that way, that sounds like justice as well, you know?"}, {"time": 2695, "text": "So it is an eye of the beholder sort of thing."}, {"time": 2698, "text": "I'd love to talk to you about Vladimir Putin, sort of while we're in this feeling and wave of empathy and trying to understand others that are not like us."}, {"time": 2712, "text": "One of the reasons I started this podcast is because I believe that there's a few people I could talk to."}, {"time": 2718, "text": "Some of it is ego."}, {"time": 2721, "text": "Some of it is stupidity."}, {"time": 2724, "text": "Is there some people I could talk to that not many others can talk to?"}, {"time": 2729, "text": "The one person I was always thinking about was Vladimir Putin."}, {"time": 2733, "text": "Do you still speak the language?"}, {"time": 2735, "text": "I speak the language very well."}, {"time": 2736, "text": "That makes it even easier."}, {"time": 2737, "text": "I mean, you might be appointed for that job."}, {"time": 2741, "text": "That's the context in which I'm asking you this question."}, {"time": 2743, "text": "What are your thoughts about Vladimir Putin from a historical context?"}, {"time": 2751, "text": "Have you studied him?"}, {"time": 2752, "text": "Have you thought about him?"}, {"time": 2754, "text": "Yes, studied is a loaded word."}, {"time": 2759, "text": "And again, I find it hard sometimes to not filter things through an American lens."}, {"time": 2765, "text": "So as an American, I would say that the Russians should be allowed to have any leader that they want to have."}, {"time": 2772, "text": "But what an American would say is, but there should be elections, right?"}, {"time": 2777, "text": "So if the Russians choose Vladimir Putin and they keep choosing him, that's their business."}, {"time": 2783, "text": "Where as an American, I would have a problem is when that leader stops letting the Russians make that decision."}, {"time": 2790, "text": "And we would say, well, now you're no longer ruling by the consent of the governed."}, {"time": 2796, "text": "You've become the equivalent of a person who may be oppressing your people."}, {"time": 2800, "text": "You might as well be a dictator, right?"}, {"time": 2802, "text": "Now there's a difference between a freely elected and reelected and reelected and reelected dictator, right?"}, {"time": 2809, "text": "If that's what they want."}, {"time": 2810, "text": "And look, it would be silly to broad brush the Russians like it would be silly to broad brush anyone, right?"}, {"time": 2816, "text": "Millions and millions of people with different opinions amongst them all."}, {"time": 2819, "text": "But they seem to like a strong person at the helm."}, {"time": 2823, "text": "And listen, there's a giant chunk of Americans who do too in their own country."}, {"time": 2828, "text": "But an American would say, as long as the freedom of choice is given to the Russians to decide this and not taken away from them, right?"}, {"time": 2836, "text": "It's one thing to say he was freely elected, but a long time ago and we've done away with elections since then is a different story too."}, {"time": 2843, "text": "So my attitude on Vladimir Putin is if that's who the Russian people want and you give them the choice, right?"}, {"time": 2849, "text": "If he's only there because they keep electing him, that's a very different story."}, {"time": 2852, "text": "When he stops offering them the option of choosing him or not choosing him, that's when it begins to look nefarious to someone born and raised with the mindset and the ideology that is an integral part of yours truly."}, {"time": 2866, "text": "And that I can't, you can see gray areas and nuance all you like, but it's hard to escape."}, {"time": 2871, "text": "And you alluded to this too."}, {"time": 2872, "text": "It's hard to escape what was indoctrinated into your bones in your formative years."}, {"time": 2879, "text": "It's like, your bones are growing, right?"}, {"time": 2882, "text": "And you can't go back."}, {"time": 2883, "text": "So to me, this is so much a part of who I am that I have a hard time jettisoning that and saying, oh no, Vladimir Putin not being elected anymore, it's just fine."}, {"time": 2892, "text": "I'm too much of a product of my upbringing to go there."}, {"time": 2898, "text": "But of course there's, like we were saying, there's gray areas, which is, I believe, I have to think through this, but I think there is a point at which Adolf Hitler became the popular choice in Nazi Germany in the 30s."}, {"time": 2912, "text": "There's a, in the same way, from an American perspective, you can start to criticize some in a shallow way, some in a deep way."}, {"time": 2923, "text": "The way that Putin has maintained power is by controlling the press."}, {"time": 2928, "text": "So limiting one other freedom that we Americans value, which is the freedom of the press or freedom of speech that he, it is very possible."}, {"time": 2937, "text": "Now things are changing now, but for most of his presidency, he was the popular choice and sometimes by far."}, {"time": 2946, "text": "And I have, I actually don't have real family in Russia who don't love Putin."}, {"time": 2955, "text": "The only people who write to me about Putin and not liking him are like sort of activists who are young, right?"}, {"time": 2964, "text": "But like to me, they're strangers."}, {"time": 2966, "text": "I don't know anything about them."}, {"time": 2968, "text": "The people I do know who have a big family in Russia, they love Putin."}, {"time": 2974, "text": "They... Do they miss elections?"}, {"time": 2981, "text": "Would they want the choice to prove it at the ballot box?"}, {"time": 2985, "text": "And, or are they so in love with him that they wouldn't wanna take a chance that someone might vote him out?"}, {"time": 2994, "text": "No, they don't think of it this way."}, {"time": 2996, "text": "And they are aware of the incredible bureaucracy and corruption that is lurking in the shadows, which is true in Russia."}, {"time": 3007, "text": "But like, there's something about the Russian, it's a remnants, corruption is so deeply part of the Russian, so the Soviet system that even the overthrow of the Soviet, the breaking apart of the Soviet Union and Putin coming and reforming a lot of the system, it's still deeply in there."}, {"time": 3028, "text": "And they're aware of that."}, {"time": 3031, "text": "That's part of the, like the love for Putin is partially grounded in the fear of what happens when the corrupt take over, the greedy take over."}, {"time": 3042, "text": "And they see Putin as the stabilizer, as like a hard like force that says... A counter force."}, {"time": 3050, "text": "Counter force that get your shit together."}, {"time": 3053, "text": "Like basically, from the Western perspective, Putin is terrible, but from the Russian perspective, Putin is the only thing holding this thing together before it goes, if it collapses."}, {"time": 3067, "text": "Now, from the, like Gary Kasparov has been loud on this, a lot of people from the Western perspective say, well, if it has to collapse, let it collapse."}, {"time": 3077, "text": "You know, that's... That's easier said than done when you don't have to live through that."}, {"time": 3081, "text": "And so anyone worrying about their family about... And they also remember the inflation and the economic instability and the suffering and the starvation that happened in the 90s with the collapse of the Soviet Union."}, {"time": 3095, "text": "And they saw the kind of reform and the economic vibrancy that happened when Putin took power, that they think like, this guy's holding it together."}, {"time": 3103, "text": "And they see elections as potentially being mechanisms by which the corrupt people can manipulate the system unfairly, as opposed to letting the people speak with their voice."}, {"time": 3118, "text": "They somehow figure out a way to manipulate the elections, to elect somebody like one of them Western revolutionaries."}, {"time": 3128, "text": "And so I think one of the beliefs that's important to the American system is the belief in the electoral system that the voice of the people can be heard in the various systems of government, whether it's judicial, whether it's..."}, {"time": 3145, "text": "I mean, basically the assumption is that the system works well enough for you to be able to elect the popular choice."}, {"time": 3156, "text": "Okay, so there's a couple of things that come to mind on that."}, {"time": 3160, "text": "The first one has to do with the idea of oligarchs."}, {"time": 3165, "text": "There's a belief in political science, you know, it's not the overall belief, but that every society is sort of an oligarchy really, if you break it down, right?"}, {"time": 3175, "text": "So what you're talking about are some of the people who would form an oligarchic class in Russia, and that Putin is the guy who can harness the power of the state to keep those people in check."}, {"time": 3190, "text": "The problem, of course, in a system like that, a strong man system, right?"}, {"time": 3193, "text": "Where you have somebody who can hold the reins and steer the ship when the ship is violently in a storm, is the succession."}, {"time": 3201, "text": "So if you're not creating a system that can operate without you, then that terrible instability and that terrible future that you justify the strong man for is just awaiting your future, right?"}, {"time": 3217, "text": "I mean, unless he's actively building the system that will outlive him and allow successors to do what he's doing, then what you've done here is create a temporary, I would think, a temporary stability here, because it's the same problem you have in a monarchy, right?"}, {"time": 3291, "text": "Now, let me ask, because I'm curious, and ignorant, so is he doing that, do you think?"}, {"time": 3298, "text": "Is he setting it up so that when there is no Putin, the state is safe?"}, {"time": 3304, "text": "From the beginning, that was the idea, whether one of the fascinating things, now, I read every biography, English written biography on Putin, so I need to think more deeply, but one of the fascinating things is how did power change Vladimir Putin?"}, {"time": 3320, "text": "He was a different man when he took power than he is today."}, {"time": 3324, "text": "I actually, in many ways, admire the man that took power."}, {"time": 3329, "text": "I think he's very different than Stalin and then Hitler at the moment they took power."}, {"time": 3334, "text": "I think Hitler and Stalin were both, in our previous discussion, already on the trajectory of evil."}, {"time": 3344, "text": "I think Putin was a humble, loyal, honest man when he took power."}, {"time": 3350, "text": "The man he is today is worth thinking about and studying."}, {"time": 3354, "text": "I'm not sure that that."}, {"time": 3356, "text": "That's an old line, though, about absolute power corrupting, absolutely."}, {"time": 3359, "text": "But it's kind of a line."}, {"time": 3362, "text": "It's a beautiful quote, but you have to really think about it."}, {"time": 3367, "text": "Like, what does that actually mean?"}, {"time": 3370, "text": "Like, one of the things I still have to do, I've been focusing on securing the conversation, right?"}, {"time": 3375, "text": "So I haven't gone through a dark place yet because I feel like I can't do the dark thing for too long."}, {"time": 3381, "text": "So I really have to put myself in the mind of Putin leading up to the conversation."}, {"time": 3387, "text": "But for now, my sense is he took power when Yeltsin gave him, one of the big sort of acts of the new Russia was for the first time in its history, a leader could have continued being in power and chose to give away power."}, {"time": 3408, "text": "That was the George Washington."}, {"time": 3409, "text": "Right, we in the United States would look at that as absolute positive, yeah."}, {"time": 3412, "text": "A sign of good things, yes."}, {"time": 3414, "text": "And so that was a huge act."}, {"time": 3416, "text": "And Putin said that that was the defining thing that will define Russia for the 21st century, that act, and he will carry that flag forward."}, {"time": 3427, "text": "That's why in rhetoric, he, after two terms, he gave away power."}, {"time": 3433, "text": "To Medvedev, but it was a puppet, right?"}, {"time": 3435, "text": "Yeah, yes, but it was, but like still the story was being told."}, {"time": 3440, "text": "I think he believed it early on."}, {"time": 3443, "text": "I think he, I believe he still believes it, but I think he's deeply suspicious of the corruption that lurks in the shadows."}, {"time": 3453, "text": "And I do believe that, like as somebody who thinks clickbait journalism is broken, journalists annoy the hell out of me."}, {"time": 3460, "text": "Clickbait journalism's working perfectly."}, {"time": 3462, "text": "Journalism's broken."}, {"time": 3463, "text": "Journalism."}, {"time": 3464, "text": "Clickbait thing's working great."}, {"time": 3466, "text": "So I understand from Putin's perspective that journalism, journalists can be seen as the enemy of the state, because people think journalists write these deep, beautiful philosophical pieces about criticizing the structure of government and the proper policy where, you know, the steps that we need to take to make a greater nation."}, {"time": 3487, "text": "No, they, they're unfairly take stuff out of context."}, {"time": 3491, "text": "They, they're critical in ways that's like shallow and not interesting."}, {"time": 3496, "text": "They, they call you a racist or sexist, or they make up stuff all the time."}, {"time": 3502, "text": "So I can put myself in the mindset of a person that thinks that it is okay to remove that kind of shallow fake news voice from the system."}, {"time": 3514, "text": "The problem is, of course, that is a slippery slope to then you remove all the annoying people from the system, and then you change what annoying means, which annoying starts becoming a thing that like anyone who opposes the system."}, {"time": 3528, "text": "I mean, I get, I get the slippery, it's obvious that it becomes a slippery slope, but I can also put myself in the mindset of the people that see it's okay to remove the liars from the system, as long as it's good for Russia."}, {"time": 3544, "text": "And, okay, so herein lies, and this again, the traditional American perspective, because we've had yellow, so called yellow journalism since the founding of the Republic."}, {"time": 3552, "text": "That's nothing new."}, {"time": 3579, "text": "It's the fake news from the government, instead of the clickbait news, and oh yeah, maybe truth mixed into all that too, in some of the outlets."}, {"time": 3588, "text": "The problem I always have with our system here in the United States right now is trying to tease the truth out from all the falsehoods."}, {"time": 3595, "text": "And look, I've got 30 years in journalism."}, {"time": 3598, "text": "My job used to be to go through, before the internet, all the newspapers, and find the, I used to know all the journalists by name, and I could pick out, you know, who they were, and I have a hard time picking out the truth from the falsehoods, so I think constantly, how are people who don't have all this background, who have lives, or who are trained in other specialties, how do they do it?"}, {"time": 3620, "text": "But if the government is the only approved outlet for truth, a traditional American, and a lot of other traditional societies based on these ideas of the Enlightenment that I talked about earlier, would see that as a disaster waiting to happen, or a tyranny in progress."}, {"time": 3669, "text": "My belief was that freedom of speech results in a stable trajectory towards truth always."}, {"time": 3678, "text": "So like truth will emerge."}, {"time": 3679, "text": "That was my sort of faith and belief that yeah, there's going to be lies all over the place, but there'll be like a stable thing that is true, that's carried forward to the public."}, {"time": 3691, "text": "Now it feels like it's possible to go towards a world where nothing is true, where truth is something that groups of people convince themselves of, and there's multiple groups of people, and the idea of some universal truth, as I suppose is the better thing, is something that we can no longer exist under."}, {"time": 3717, "text": "Like some people believe that the Green Bay Packers is the best football team, and some people can think the Patriots, and they deeply believe it to where they call the other groups liars."}, {"time": 3730, "text": "Now that's fun for sports, that's fun for favorite flavors of ice cream, but they might believe that about science, about the various aspects of politics, various aspects of sort of different policies within the function of our government."}, {"time": 3750, "text": "And like, that's not just like some weird thing we'll complain about, but that'll be the nature of things, like truth is something we can no longer have."}, {"time": 3758, "text": "Well, and let me de romanticize the American history of this too, because the American press was often just as biased, just as, I mean, I always looked to the 1970s as the high watermark of the American journalistic, in the post Watergate era, where it was actively going after the abuses of the government and all these things."}, {"time": 3784, "text": "But there was a famous speech, very quiet though, very quiet, given by Katherine Graham, who was a Washington Post editor, I believe."}, {"time": 3791, "text": "And I actually, somebody sent it to me, we had to get it off of a journalism, like a J store kind of thing."}, {"time": 3796, "text": "And she, at a luncheon, assured to the government people at the luncheon, don't worry, this is not gonna be something that we make a trend."}, {"time": 3807, "text": "Because the position of the government is still something that was carried, that the newspapers were the water, and the newspapers were the big thing up until certainly the late 60s, early 70s."}, {"time": 3820, "text": "The newspapers were still the water carrier of the government, right?"}, {"time": 3823, "text": "And they were the water carriers of the owners of the newspaper."}, {"time": 3827, "text": "So let's not pretend there was some angelic, wonderful time."}, {"time": 3831, "text": "And I'm saying to me, cause I was the one who brought it up, let's not pretend there was any super age of truthful journalism and all that."}, {"time": 3838, "text": "And I mean, you go to the revolutionary period in American history, and it looks every bit as bad as today, right?"}, {"time": 3845, "text": "That's a hopeful message, actually."}, {"time": 3846, "text": "So things may not be as bad as they look."}, {"time": 3849, "text": "Well, let's look at it more like a stock market, and that you have fluctuations in the truthfulness or believability of the press."}, {"time": 3856, "text": "And there are periods where it was higher than other periods."}, {"time": 3859, "text": "The funny thing about the so called clickbait era, and I do think it's terrible, but I mean, it resembles earlier eras to me."}, {"time": 3867, "text": "So I always compare it to when I was a kid growing up, when I thought journalism was as good as it's ever gotten."}, {"time": 3873, "text": "It was never perfect."}, {"time": 3876, "text": "But it's also something that you see very rarely in other governments around the world."}, {"time": 3881, "text": "And there's a reason that journalists are often killed regularly in a lot of countries."}, {"time": 3886, "text": "And it's because they report on things that the authorities do not want reported on."}, {"time": 3890, "text": "And I've always thought that that was what journalism should do."}, {"time": 3892, "text": "But it's gotta be truthful, otherwise it's just a different kind of propaganda, right?"}, {"time": 3899, "text": "Can we talk about Genghis Khan?"}, {"time": 3901, "text": "Genghis Khan?"}, {"time": 3903, "text": "By the way, is it Genghis Khan or Genghis Khan?"}, {"time": 3905, "text": "It's not Genghis Khan."}, {"time": 3906, "text": "It's either Genghis Khan or Chinggis Khan."}, {"time": 3909, "text": "So let's go with Genghis Khan."}, {"time": 3911, "text": "That's the only thing I'll be able to say with any certain, last certain thing I'll say about it."}, {"time": 3916, "text": "It's like, I don't know, GIF versus GIF."}, {"time": 3920, "text": "I don't know if you know about those things."}, {"time": 3921, "text": "I don't know how it ever got started the wrong way."}, {"time": 3924, "text": "So first of all, your episodes on Genghis Khan for many people are the favorite."}, {"time": 3931, "text": "It's fascinating to think about events that had so much like in their ripples, had so much impact on so much of human civilization."}, {"time": 3940, "text": "In your view, was he an evil man?"}, {"time": 3945, "text": "Let's go start a discussion of evil."}, {"time": 3948, "text": "Another way to put it is I've read he's much loved in many parts of the world like Mongolia."}, {"time": 3956, "text": "And I've also read arguments that say that he was quite a progressive for the time."}, {"time": 3963, "text": "So where do you put him?"}, {"time": 3964, "text": "Is he a progressive or is he an evil destroyer of humans?"}, {"time": 3968, "text": "As I often say, I'm not a historian, which is why what I try to bring to the Hardcore History podcasts are these sub themes."}, {"time": 3977, "text": "So each show has, and they're not, I try to kind of soft pedal them."}, {"time": 3981, "text": "So they're not always like really right in front of your face."}, {"time": 3983, "text": "In that episode, the soft peddling sub theme had to do with what we referred to as a historical arsonist."}, {"time": 3992, "text": "And it's because some historians have taken the position that sometimes, and most of this is earlier stuff, historians don't do this very much anymore, but these were the wonderful questions I grew up with that blend, it's almost the intersection between history and philosophy."}, {"time": 4008, "text": "And the idea was that sometimes the world has become so overwhelmed with bureaucracy or corruption or just stagnation that somebody has to come in or some group of people or some force has to come in and do the equivalent of a forest fire to clear out all the dead wood so that the forest itself can be rejuvenated and society can then move forward."}, {"time": 4033, "text": "And there's a lot of these periods where the historians of the past will portray these figures who come in and do horrific things as creating an almost service for mankind, right?"}, {"time": 4045, "text": "Creating the foundations for a new world that will be better than the old one."}, {"time": 4049, "text": "And it's a recurring theme."}, {"time": 4051, "text": "And so this was the sub theme of the Khan's podcast, because otherwise you don't need me to tell you the story of the Mongols, but I'm gonna bring up the historical arsonist element."}, {"time": 4060, "text": "And, but this gets to how the Khan has been portrayed, right?"}, {"time": 4064, "text": "If you wanna say, oh yes, he cleared out the dead wood and made for, well, then it's a positive thing."}, {"time": 4069, "text": "If you say, my family was in the forest fire that he set, you're not gonna see it that way."}, {"time": 4075, "text": "Much of what Genghis Khan is credited with on the upside, right?"}, {"time": 4079, "text": "So things like religious toleration, and you'll say, well, he was religiously, the Mongols were religiously tolerant."}, {"time": 4088, "text": "And so this makes them almost like a liberal reformer kind of thing."}, {"time": 4091, "text": "But this needs to be seen within the context of their empire, which was very much like the Roman viewpoint, which is the Romans didn't care at a lot of time what your local people worshiped."}, {"time": 4102, "text": "They wanted stability."}, {"time": 4104, "text": "And if that kept stability and kept you paying taxes and didn't require the legionaries to come in, then they didn't care, right?"}, {"time": 4111, "text": "And the Khans were the same way."}, {"time": 4112, "text": "Like they don't care what you're practicing as long as it doesn't disrupt their empire and cause them trouble."}, {"time": 4117, "text": "But what I always like to point out is yes, but the Khan could still come in with his representatives to your town, decide your daughter was a beautiful woman that they wanted in the Khan's concubine, and they would take them."}, {"time": 4128, "text": "So how liberal an empire is this, right?"}, {"time": 4132, "text": "So many of the things that they get credit for as though there's some kind of nice guys may in another way of looking at it just be a simple mechanism of control, right?"}, {"time": 4141, "text": "A way to keep the empire stable."}, {"time": 4144, "text": "They're not doing it out of the goodness of their heart."}, {"time": 4147, "text": "They have decided that this is the best."}, {"time": 4149, "text": "And I love because the Mongols were what we would call a pagan people now."}, {"time": 4155, "text": "I love the fact that they, and I think we call it, I forgot the term we used, had to do with, like they were hedging their bets religiously, right?"}, {"time": 4162, "text": "They didn't know which God was the right one."}, {"time": 4164, "text": "So as long as you're all praying for the health of the Khan, we're maximizing the chances that whoever the gods are, they get the message, right?"}, {"time": 4172, "text": "So I think it's been portrayed as something like a liberal empire."}, {"time": 4176, "text": "And the idea of Mongol universality is more about conquering the world."}, {"time": 4183, "text": "And it's like saying, you know, we're gonna bring stability to the world by conquering it."}, {"time": 4186, "text": "Well, what if that's Hitler, right?"}, {"time": 4188, "text": "He could make the same case, or Hitler wasn't really the world conqueror like that because he wouldn't have been trying to make it equal for all peoples."}, {"time": 4195, "text": "But my point being that it kind of takes the positive moral slant out of it if their motivation wasn't a positive moral slant to the motivate, and the Mongols didn't see it that way."}, {"time": 4209, "text": "And I think the way that it's portrayed is like, and I always like to use this analogy, but it's like shooting an arrow and painting a bull's eye around it afterwards, right?"}, {"time": 4220, "text": "How do we justify and make them look good in a way that they themselves probably, and listen, we don't have the Mongol point of view per se."}, {"time": 4229, "text": "I mean, there's something called the secret history of the Mongols, and there's things written down by Mongolian overlords through people like Persian and Chinese scribes later."}, {"time": 4238, "text": "We don't have their point of view, but it sure doesn't look like this was an attempt to create some wonderful place where everybody was living a better life than they were before."}, {"time": 4248, "text": "I think that's later people putting a nice rosy spin on it."}, {"time": 4253, "text": "But there's an aspect to it, maybe you can correct me, because I'm projecting sort of my idea of what it would take to conquer so much land is the ideology is emergent."}, {"time": 4268, "text": "So if I were to guess, the Mongols started out as exceptionally, as warriors who valued excellence in skill of killing, not even killing, but like the actual practice of war."}, {"time": 4287, "text": "And you can start out small, and you can grow and grow and grow."}, {"time": 4290, "text": "And then in order to maintain the stability of the things over which of the conquered lands, you developed a set of ideas with which you can, like you said, establish control, but it was emergent."}, {"time": 4303, "text": "And it seems like the core first principle idea of the Mongols is just to be excellent warriors."}, {"time": 4312, "text": "That felt to me like the starting point."}, {"time": 4315, "text": "It wasn't some ideology."}, {"time": 4317, "text": "Like with Hitler and Stalin, with Hitler, there was an ideology that didn't have anything to do with war underneath it."}, {"time": 4326, "text": "It was more about conquering."}, {"time": 4328, "text": "It feels like the Mongols started out more organically, I would say, like this phenomenon started emergently, and they were just like similar to the Native Americans with the Comanches, like the different warrior tribes that Joe Rogan's currently obsessed with, that led me to look into it more."}, {"time": 4348, "text": "They seem to just start out just valuing the skill of fighting whatever the tools of war they had, which were pretty primitive, but just to be the best warriors they could possibly be, make a science out of it."}, {"time": 4360, "text": "Is that crazy to think that there was no ideology behind it in the beginning?"}, {"time": 4366, "text": "I'm gonna back up a second."}, {"time": 4367, "text": "I'm reminded of the line said about the Romans, that they create a wasteland and call it peace."}, {"time": 4372, "text": "That is, but there's a lot of conquerors like that, right?"}, {"time": 4377, "text": "Where you will sit there, and listen, historians forever have, it's the famous trade offs of empire, and they'll say, well, look at the trade that they facilitated, and look at the religion, all those kinds of things, but they come at the cost of all those peoples that they conquered forcibly and by force, integrated into their empire."}, {"time": 4398, "text": "The one thing we need to remember about the Mongols that makes them different than, say, the Romans, and this is complex stuff and way above my pay grade, but I'm fascinated with it, and it's more like the Comanches that you just brought up, is that the Mongols are not a settled society, okay?"}, {"time": 4413, "text": "They come from a nomadic tradition."}, {"time": 4416, "text": "Now, several generations later, when you have Kublai Khan as the emperor of China, it's beginning to be a different thing, right?"}, {"time": 4455, "text": "They're not some really super special people."}, {"time": 4459, "text": "They're just the latest confederacy in an area that saw nomadic confederacies going back to the beginning of recorded history."}, {"time": 4497, "text": "Every warrior society I've ever seen values that."}, {"time": 4502, "text": "What the nomads had of the Eurasian steppe was this relationship between human beings and animals that changed the equation."}, {"time": 4512, "text": "It was how they rode horses."}, {"time": 4515, "text": "And societies like the Byzantines, which would form one flank of the steppe and then all the way on the other side you had China, and below that you had Persia, these societies would all attempt to create mounted horsemen who used archery."}, {"time": 4530, "text": "And they did a good job, but they were never the equals of the nomads because those people were literally raised in the saddle."}, {"time": 4538, "text": "They compared them to centaurs."}, {"time": 4541, "text": "The Comanches, great example, considered to be the best horse riding warriors in North America."}, {"time": 4548, "text": "The Comanches, I always love watching, there's paintings."}, {"time": 4551, "text": "George Catlin, the famous painter who painted the Comanches, illustrated it."}, {"time": 4557, "text": "But the Mongols and the Scythians and the Avars and all these people did it too, where they would shoot from underneath the horse's neck, hiding behind the horse the whole way."}, {"time": 4569, "text": "You look at a picture of somebody doing that, and it's insane."}, {"time": 4573, "text": "This is what the Byzantines couldn't do and the Chinese couldn't do."}, {"time": 4577, "text": "It was a different level of harnessing a human animal relationship that gave them a military advantage that could not be copied, right?"}, {"time": 4588, "text": "It could be emulated, but they were never as good, right?"}, {"time": 4591, "text": "That's why they always hired these people."}, {"time": 4593, "text": "They hired mercenaries from these areas because they were incomparable, right?"}, {"time": 4598, "text": "It's the combination of people who were shooting bows and arrows from the time they were toddlers, who were riding from the time they were, who rode all the time."}, {"time": 4606, "text": "I mean, the Huns were bow legged, the Romans said, because they were never, they ate, slept, everything in the saddle."}, {"time": 4614, "text": "That creates something that is difficult to copy."}, {"time": 4617, "text": "And it gave them a military advantage."}, {"time": 4620, "text": "I enjoy reading actually about when that military advantage ended."}, {"time": 4624, "text": "So 17th and 18th century, when the Chinese on one flank and the Russians on the other are beginning to use firearms and stuff to break this military power of these various Khans."}, {"time": 4638, "text": "The Mongols were simply the most dominating and most successful of the Confederacies."}, {"time": 4643, "text": "But if you break it down, they really formed the nucleus at the top of the pyramid, of the apex of the food chain."}, {"time": 4650, "text": "And a lot of the people that were known as Mongols were really lots of other tribes, non Mongolian tribes, that when the Mongols conquer you, after they killed a lot of you, they incorporated you into their Confederacy and often made you go first."}, {"time": 4665, "text": "You're gonna fight somebody, we're gonna make these people go out in front and suck up all the arrows before we go in and finish the job."}, {"time": 4671, "text": "So to me, and I guess a fan of the Mongols would say that the difference and what made the Mongols different wasn't the weapon system or the fighting or the warriors or the armor or anything, it was Genghis Khan."}, {"time": 4685, "text": "And if you go look at the other really dangerous, from the outside world's perspective, dangerous step, nomadic Confederacies from past history was always when some great leader emerged that could unite the tribes."}, {"time": 4697, "text": "And you see the same thing in Native American history to a degree too."}, {"time": 4701, "text": "You had people like Attila, right?"}, {"time": 4704, "text": "Or there's one called Tumen."}, {"time": 4706, "text": "You go back in history and these people make the history books because they caused an enormous amount of trouble for their settled neighbors that normally, I mean, Chinese Byzantine and Persian approaches to the steppe people were always the same."}, {"time": 4719, "text": "They would pick out tribes to be friendly with, they would give them money, gifts, hire them, and they would use them against the other tribes."}, {"time": 4726, "text": "And generally Byzantine, especially in Chinese diplomatic history was all about keeping these tribes separated."}, {"time": 4734, "text": "Don't let them form confederations of large numbers of them because then they're unstoppable."}, {"time": 4739, "text": "Attila was a perfect example."}, {"time": 4741, "text": "The Huns were another large, the Turks, another large confederacy of these people."}, {"time": 4745, "text": "And they were devastating when they could unite."}, {"time": 4748, "text": "So the diplomatic policy was don't let them."}, {"time": 4750, "text": "That's what made the Mongols different is Genghis Khan united them."}, {"time": 4754, "text": "And then unlike most of the tribal confederacies, they were able to hold it together for a few generations."}, {"time": 4759, "text": "To linger on the little thread that you started pulling on this man, Genghis Khan, that was a leader."}, {"time": 4768, "text": "Temujin, yeah."}, {"time": 4769, "text": "What do you think makes a great leader?"}, {"time": 4772, "text": "Maybe if you have other examples throughout history and great, again, let's use that term loosely."}, {"time": 4781, "text": "Meaning."}, {"time": 4782, "text": "Now I was gonna ask for a definition."}, {"time": 4782, "text": "Great uniter of whether it's evil or good, it doesn't matter."}, {"time": 4789, "text": "Is there somebody who stands out to you, Alexander the Great talking about military or ideologies, some people bring up FDR or, I mean, you could be the founding fathers of this country, or we can go to, was he man of the century up there?"}, {"time": 4809, "text": "Hitler of the 20th century and Stalin and these people had really amassed the amount of power that probably has never been seen in the history of the world."}, {"time": 4822, "text": "Is there somebody who stands out to you by way of trying to define what makes a great uniter, great leader in one man or woman, maybe in the future?"}, {"time": 4835, "text": "And one I've thought a lot about, because let's take Alexander the Great as an example, because Alexander fascinated the world of his time, fascinated, ever since people have been fascinated with the guy."}, {"time": 4845, "text": "But Alexander was a hereditary monarch, right?"}, {"time": 4850, "text": "He was handed the kingdom."}, {"time": 4852, "text": "Which is fascinating."}, {"time": 4853, "text": "Right, but he did not need to rise from nothing to get that job."}, {"time": 4857, "text": "In fact, he reminds me of a lot of other leaders of Frederick the Great, for example, in Prussia."}, {"time": 4863, "text": "These are people who inherited the greatest army of their day."}, {"time": 4869, "text": "Alexander, unless he was an imbecile, was going to be great no matter what, because I mean, if you inherit the Wehrmacht, you're gonna be able to do something with it, right?"}, {"time": 4879, "text": "Alexander's father may have been greater, Philip."}, {"time": 4883, "text": "Philip II was the guy who literally did create a strong kingdom from a disjointed group of people that were continually beset by their neighbors."}, {"time": 4894, "text": "He's the one that reformed that army, took things that he had learned from other Greek leaders like the Theban leader at Paminondas, and then laboriously over his lifetime stabilized the frontiers, built this system."}, {"time": 4911, "text": "He lost an eye doing it."}, {"time": 4913, "text": "His leg was made lame."}, {"time": 4915, "text": "I mean, this was a man who looked like he built the empire and led from the front ranks."}, {"time": 4920, "text": "I mean, and then who may have been killed by his son, we don't know who assassinated Philip, but then handed the greatest army the world had ever seen to his son, who then did great things with it."}, {"time": 4932, "text": "You see this pattern many times."}, {"time": 4933, "text": "So in my mind, I'm not sure Alexander really can be that great when you compare him to people who arose from nothing."}, {"time": 4942, "text": "So the difference between what we would call in the United States the self made man or the one who inherits a fortune."}, {"time": 4949, "text": "There's an old line that, it's a slur, but it's about rich people."}, {"time": 4953, "text": "And it's like he was born on third base and thought he hit a triple, right?"}, {"time": 4959, "text": "Philip was born at home plate and he had to hit."}, {"time": 4962, "text": "Alexander started on third base."}, {"time": 4965, "text": "And so I try to draw a distinction between them."}, {"time": 4968, "text": "Genghis Khan is tough because there's two traditions."}, {"time": 4971, "text": "The tradition that we grew up with here in the United States and that I grew up learning was that he was a self made man."}, {"time": 4977, "text": "But there is a tradition, and it may be one of those things that's put after the fact because a long time ago, whether or not you had blue blood in your veins was an important distinction."}, {"time": 4988, "text": "And so the distinction that you'll often hear from Mongolian history is that this was a nobleman who had been deprived of his inheritance."}, {"time": 4996, "text": "So he was a blue blood anyway."}, {"time": 4998, "text": "I don't know which is true."}, {"time": 5000, "text": "There's certainly, I mean, when you look at a Genghis Khan, you have to go, that is a wicked amount of things to have achieved."}, {"time": 5008, "text": "He's very impressive as a figure."}, {"time": 5010, "text": "Attila is very impressive as a figure."}, {"time": 5013, "text": "Hitler's an interesting figure."}, {"time": 5015, "text": "He's one of those people, you know, the more you study about Hitler, the more you wonder where the defining moment was."}, {"time": 5023, "text": "Because if you look at his life, I mean, Hitler was a relatively common soldier in the First World War."}, {"time": 5031, "text": "I mean, he was brave."}, {"time": 5032, "text": "He got some decorations."}, {"time": 5034, "text": "In fact, the highest decoration he got in the First World War was given to him by a Jewish officer."}, {"time": 5039, "text": "And he often didn't talk about that decoration, even though it was the more prestigious one because it would open up a whole can of worms you didn't wanna get into."}, {"time": 5047, "text": "But Hitler's, I mean, if you said who was Hitler today, one of the top things you're gonna say is he was an anti Semite."}, {"time": 5054, "text": "Well, then you have to draw a distinction between general regular anti Semitism that was pretty common in the era and something that was a rabid level of anti Semitism."}, {"time": 5064, "text": "But Hitler didn't seem to show a rabid level of anti Semitism until after or at the very end of the First World War."}, {"time": 5071, "text": "So if this is a defining part of this person's character and much of what we consider to be his evil stems from that, what happened to this guy when he's an adult, right?"}, {"time": 5083, "text": "He's already fought in the war to change him so."}, {"time": 5085, "text": "I mean, it's almost like the old, there was always a movie theme."}, {"time": 5088, "text": "Somebody gets hit by something on the head and their whole personality changes, right?"}, {"time": 5092, "text": "I mean, it almost seems something like that."}, {"time": 5095, "text": "So I don't think I call that necessarily a great leader."}, {"time": 5098, "text": "To me, the interesting thing about Hitler is what the hell happened to a nondescript person who didn't really impress anybody with his skills."}, {"time": 5107, "text": "And then in the 1920s, it's all of a sudden, as you said, sort of the man of the hour, right?"}, {"time": 5112, "text": "So that to me is kind of, I have this feeling that Genghis Khan, and we don't really know, was an impressive human being from the get go."}, {"time": 5120, "text": "And then he was raised in this environment with pressure on all sides."}, {"time": 5123, "text": "So you start with this diamond and then you polish it and you harden it his whole life."}, {"time": 5127, "text": "Hitler seemed to be a very unimpressive gemstone most of his life, and then all of a sudden."}, {"time": 5133, "text": "So, I mean, I don't think I can label great leaders."}, {"time": 5136, "text": "And I'm always fascinated by that idea that, and I'm trying to remember who the quote was by that, that great men, oh, Lord Acton."}, {"time": 5143, "text": "So great men are often not good men."}, {"time": 5147, "text": "And that in order to be great, you would have to jettison many of the moral qualities that we normally would consider a Jesus or a Gandhi, or, you know, these qualities that one looks at as the good upstanding moral qualities that we should all aspire to as examples, right?"}, {"time": 5163, "text": "The Buddha, whatever it might be, those people wouldn't make good leaders because what you need to be a good leader often requires the kind of choices that a true philosophical diogenes moral man wouldn't make."}, {"time": 5175, "text": "So I don't have an answer to your question."}, {"time": 5177, "text": "How about that?"}, {"time": 5178, "text": "That's a long way of saying, I don't know."}, {"time": 5180, "text": "Just linger a little bit."}, {"time": 5182, "text": "It does feel like from my study of Hitler that the time molded the man versus Genghis Khan, where it feels like he, the man molded his time."}, {"time": 5193, "text": "Yes, and I feel that way about a lot of those nomadic Confederacy builders, that they really seem to be these figures that stand out as extraordinary in one way or another."}, {"time": 5205, "text": "Remembering, by the way, that almost all the history of them were written by the enemies that they so mistreated that they were probably never gonna get any good press."}, {"time": 5212, "text": "They didn't write themselves."}, {"time": 5213, "text": "That's a caveat."}, {"time": 5214, "text": "We should always add to basically all of human history."}, {"time": 5216, "text": "Nomadic or Native American peoples or tribal peoples anywhere generally do not get the advantage of being able to write the history of their heroes."}, {"time": 5224, "text": "Okay, I've recently almost done with the rise and the fall of the Third Reich."}, {"time": 5231, "text": "It's one of the historical descriptions of Hitler's rise to power, Nazi's rise to power."}, {"time": 5241, "text": "There's a few philosophical things I'd like to ask you to see if you can help."}, {"time": 5247, "text": "Like one of the things I think about is how does one be a hero in 1930s Nazi Germany?"}, {"time": 5257, "text": "What does it mean to be a hero?"}, {"time": 5261, "text": "What do heroic actions look like?"}, {"time": 5264, "text": "I think about that because I think about how I move about in this world today."}, {"time": 5276, "text": "That we live in really chaotic, intense times where I don't think you wanna draw any parallels between Nazi Germany and modern day in any of the nations we can think about."}, {"time": 5289, "text": "But it's not out of the realm of possibility that authoritarian governments take hold, authoritarian companies take hold."}, {"time": 5301, "text": "And I'd like to think that I could be in my little small way and inspire others to take the heroic action before things get bad."}, {"time": 5313, "text": "And I kind of try to place myself in what would 1930s Germany look like?"}, {"time": 5320, "text": "Is it possible to stop a Hitler?"}, {"time": 5324, "text": "Is it even the right way to think about it?"}, {"time": 5327, "text": "And how does one be a hero in it?"}, {"time": 5331, "text": "I mean, you often talk about that living through a moment in history is very different than looking at that history, looking when you look back."}, {"time": 5340, "text": "I also think about it, would it be possible to understand what's happening that the bells of war are ringing?"}, {"time": 5352, "text": "It seems that most people didn't seem to understand, you know, late into the 30s that war is coming."}, {"time": 5362, "text": "On the United States side, inside Germany, like the opposing figures, the German military didn't seem to understand this."}, {"time": 5370, "text": "Maybe the other countries, certainly France and England didn't seem to understand this."}, {"time": 5377, "text": "That kind of tried to put myself into 90s, 30s Germany as I'm Jewish, which is another little twist on the whole."}, {"time": 5386, "text": "Like what would I do?"}, {"time": 5388, "text": "What should one do?"}, {"time": 5391, "text": "Do you have interesting answers?"}, {"time": 5394, "text": "So earlier we had talked about Putin and we had talked about patriotism and love of country and those sorts of things."}, {"time": 5400, "text": "In order to be a hero in Nazi Germany by our views here, you would have had to have been anti patriotic to the average German's viewpoint in the 1930s, right?"}, {"time": 5416, "text": "You would have to have opposed your own government and your own country."}, {"time": 5421, "text": "And that's a very, it would be a very weird thing to go to people in Germany and say, listen, the only way you're gonna be seen as a good German and a hero to the country that will be your enemies is we think you should oppose your own government."}, {"time": 5436, "text": "It's a strange position to put the people in a government saying you need to be against your leader, you need to oppose your government's policies, you need to oppose your government, you need to hope and work for its downfall."}, {"time": 5449, "text": "That doesn't sound patriotic."}, {"time": 5451, "text": "It wouldn't sound patriotic here in this country if you made a similar argument."}, {"time": 5455, "text": "I will go away from the 1930s and go to the 1940s to answer your question."}, {"time": 5461, "text": "So there is movements like the White Rose Movement in Germany, which involved young people really, and from various backgrounds, religious backgrounds often, who worked openly against the Nazi government at a time when power was already consolidated, the Gestapo was in full force and they execute people who are against the government."}, {"time": 5484, "text": "And these young people would go out and distribute pamphlets and many of them got their heads cut off with guillotines for their trouble."}, {"time": 5492, "text": "And they knew that that was gonna be the penalty."}, {"time": 5495, "text": "That is a remarkable amount of bravery and sacrifice and willingness to die, and almost not even willingness because they were so open about it, it's almost a certainty, right?"}, {"time": 5509, "text": "That's incredibly moving to me."}, {"time": 5511, "text": "So when we talk, and we had talked earlier about sort of the human spirit and all that kind of thing, there are people in the German military who opposed and worked against Hitler, for example."}, {"time": 5524, "text": "But to me, that's almost cowardly compared to what these young people did in the White Rose Movement because those people in the Wehrmacht, for example, who were secretly trying to undermine Hitler, they're not really putting their lives on the line to the same degree."}, {"time": 5540, "text": "And so I think when I look at heroes, and listen, I remember once saying there were no conscientious objectors in Germany as a way to point out to people that you didn't have a choice, you know, you were gonna serve in there."}, {"time": 5552, "text": "And I got letters from Jehovah's Witnesses who said, yes, there were."}, {"time": 5556, "text": "And we got sent to the concentration camps."}, {"time": 5559, "text": "Those are remarkably brave things."}, {"time": 5562, "text": "It's one thing to have your own set of standards and values."}, {"time": 5567, "text": "It's another thing to say, oh no, I'm going to display them in a way that with this regime, that's a death sentence."}, {"time": 5574, "text": "And not just for me, for my family, right?"}, {"time": 5577, "text": "In these regimes, there was not a lot of distinction made between father and son and wives."}, {"time": 5583, "text": "That's a remarkable sacrifice to make."}, {"time": 5585, "text": "And far beyond what I think I would even be capable of."}, {"time": 5588, "text": "And so the admiration comes from seeing people who appear to be more morally profound than you are yourself."}, {"time": 5598, "text": "So when I look at this, I look at that kind of thing and I just say, wow."}, {"time": 5602, "text": "And the funny thing is if you'd have gone to most average Germans on the street in 1942 and said, what do you think of these people?"}, {"time": 5611, "text": "They're gonna think of them as traitors who probably got what they deserved."}, {"time": 5615, "text": "So that's the eye of the beholder thing."}, {"time": 5617, "text": "It's the power of the state to sow propagandize values and morality in a way that favors the state that you can turn people who today we look at as unbelievably brave and moral and crusading for righteousness and turn them into enemies of the people."}, {"time": 5638, "text": "So, I mean, in my mind, it would be people like that."}, {"time": 5640, "text": "See, I think, so hero is a funny word and we romanticize the notion, but if I could drag you back to 1930s Germany from 1940s."}, {"time": 5653, "text": "I feel like the heroic actions that doesn't accomplish much is not what I'm referring to."}, {"time": 5661, "text": "So there's many heroes I look up to that, like David Goggins, for example, the guy who runs crazy distances."}, {"time": 5671, "text": "He runs for no purpose except for the suffering in itself."}, {"time": 5675, "text": "And I think his willingness to challenge the limits of his mind is heroic."}, {"time": 5682, "text": "I guess I'm looking for a different term, which is how could Hitler have been stopped?"}, {"time": 5689, "text": "My sense is that he could have been stopped in the battle of ideas where people, millions of people were suffering economically or suffering because of the betrayal of World War I in terms of the love of country and how they felt they were being treated."}, {"time": 5707, "text": "And a charismatic leader that inspired love and unity that's not destructive could have emerged."}, {"time": 5715, "text": "And that's where the battle should have been fought."}, {"time": 5718, "text": "I would suggest that we need to take into account the context of the times that led to Hitler's rise of power and created the conditions where his message resonated."}, {"time": 5731, "text": "That is not a message that resonates at all times, right?"}, {"time": 5734, "text": "It is impossible to understand the rise of Hitler without dealing with the First World War and the aftermath of the First World War and the inflationary terrible depression in Germany and all these things and the dissatisfaction with the Weimar Republic's government, which was often seen as something put into, which it was put into place by the victorious powers."}, {"time": 5759, "text": "Hitler referred to the people that signed those agreements that signed the armistice as the November criminals."}, {"time": 5766, "text": "And he used that as a phrase which resonated with the population."}, {"time": 5770, "text": "This was a population that was embittered."}, {"time": 5772, "text": "And even if they weren't embittered, the times were so terrible."}, {"time": 5775, "text": "And the options for operating within the system in a non radical way seemed totally discredited, right?"}, {"time": 5784, "text": "You could work through the Weimar Republic, but they tried and it wasn't working anyway."}, {"time": 5787, "text": "And then the alternative to the Nazis who were bully boys in the street were communist agitators that to the average conservative Germans seem no better."}, {"time": 5796, "text": "So you have three options if you're an average German person."}, {"time": 5799, "text": "You can go with the discredited government put in power by your enemies that wasn't working anyway."}, {"time": 5806, "text": "You could go with the Nazis who seemed like a bunch of super patriots calling for the restoration of German authority, or you could go with the communists."}, {"time": 5815, "text": "And the entire thing seemed like a litany of poor options."}, {"time": 5820, "text": "And in this realm, Hitler was able to triangulate, if you will."}, {"time": 5827, "text": "He came off as a person who was going to restore German greatness at a time when this was a powerful message."}, {"time": 5833, "text": "But if you don't need German greatness restored, it doesn't resonate, right?"}, {"time": 5838, "text": "So the reason that your love idea and all this stuff, I don't think would have worked in the time period is because that was not a commodity that the average German was in search of then."}, {"time": 5850, "text": "Well, it's interesting to think about whether greatness can be restored through mechanisms, through ideas that are not so, from our perspective today, so evil."}, {"time": 5866, "text": "I don't know what the right term is."}, {"time": 5868, "text": "But the war continued in a way."}, {"time": 5870, "text": "So remember that when Germany, when Hitler is rising to power, the French are in control of parts of Germany, right?"}, {"time": 5878, "text": "The Ruhr, one of the main industrial heartlands of Germany, was occupied by the French."}, {"time": 5882, "text": "So there's never this point where you're allowed to let the hate dissipate, right?"}, {"time": 5887, "text": "Every time maybe things were calming down, something else would happen to stick the knife in and twist it a little bit more, from the average German's perspective, right?"}, {"time": 5896, "text": "The reparations, right?"}, {"time": 5898, "text": "So if you say, okay, well, we're gonna get back on our feet, the reparations were crushing."}, {"time": 5902, "text": "These things prevented the idea of love or brotherhood and all these things from taking hold."}, {"time": 5909, "text": "And even if there were Germans who felt that way, and there most certainly were, it is hard to overcome the power of everyone else."}, {"time": 5918, "text": "You know, what I always say when people talk to me about humanity is I believe on individual levels, we're capable of everything and anything, good, bad, or indifferent."}, {"time": 5928, "text": "But collectively, it's different, right?"}, {"time": 5931, "text": "And in the time period that we're talking about here, messages of peace on earth and love your enemies and all these sorts of things were absolutely deluged and overwhelmed and drowned out by the bitterness, the hatred, and let's be honest, the sense that you were continually being abused by your former enemies."}, {"time": 5951, "text": "There were a lot of people in the Allied side that realized this and said, we're setting up the next war."}, {"time": 5957, "text": "This is, I mean, they understood that you can only do certain things to collective human populations for a certain period of time before it is natural for them to want to."}, {"time": 5966, "text": "And there are, you can see German posters from the region, Nazi propaganda posters that show them breaking off the chains of their enemies."}, {"time": 5973, "text": "And I mean, Germany awake, right?"}, {"time": 5975, "text": "That was the great slogan."}, {"time": 5977, "text": "So I think love is always a difficult option."}, {"time": 5982, "text": "And in the context of those times, it was even more disempowered than normal."}, {"time": 5988, "text": "Well, this goes to the, just to linger on it for a little longer, the question of the inevitability of history."}, {"time": 5999, "text": "Do you think Hitler could have been stopped?"}, {"time": 6002, "text": "Do you think this kind of force that you're saying that there was a pain and it was building, there was a hatred that was building, do you think there was a way to avert?"}, {"time": 6015, "text": "I mean, there's two questions."}, {"time": 6017, "text": "Could have been a lot worse and could have been better in the trajectory of history in the 30s and 40s."}, {"time": 6025, "text": "The most logical, see, we had started this conversation, it brings a wonderful bow tie into the discussion and buttons it up nicely."}, {"time": 6032, "text": "We had talked about force and counter force earlier."}, {"time": 6035, "text": "The most obvious and much discussed way that Hitler could have been stopped has nothing to do with Germans."}, {"time": 6042, "text": "When he remilitarized the Rhineland, everyone talks about what a couple of French divisions would have done had they simply gone in and contested."}, {"time": 6052, "text": "And this was something Hitler was extremely, I mean, it might've been the most nervous time in his entire career because he was afraid that they would have responded with force and he was in no position to do anything about it if they did."}, {"time": 6064, "text": "So this is where you get the people who say, and Churchill's one of these people too, where they talk about that he should have been stopped militarily right at the very beginning when he was weak."}, {"time": 6076, "text": "I don't think..."}, {"time": 6080, "text": "Listen, there were candidates in the Catholic Center Party and others in the Weimar Republic that maybe could have done things and it's beyond my understanding of specific German history to talk about it intelligently."}, {"time": 6092, "text": "But I do think that had the French responded militarily to Hitler's initial moves into that area, that he would have been thwarted."}, {"time": 6100, "text": "And I think he himself believed, if I'm remembering my reading, that this would have led to his downfall."}, {"time": 6106, "text": "So the potential... See, what I don't like about this is that it almost legitimizes military intervention at a very early stage to prevent worse things from happening, but it might be a pretty clear cut case."}, {"time": 6118, "text": "But it shows we pointed out that there was a lot of sympathy on the part of the allies for the fact that the Germans probably should have Germany back and this is traditional German land."}, {"time": 6128, "text": "I mean, they were trying, in a funny way, it's almost like the love and the sense of justice on the allies part may have actually stayed their hand in a way that would have prevented much, much, much worse things later."}, {"time": 6142, "text": "But if the times were such that the message of a Hitler resonated, then simply removing Hitler from the equation would not have removed the context of the times."}, {"time": 6154, "text": "And that means one of two things, either you could have had another one or you could have ended up in a situation equally bad in a different direction."}, {"time": 6164, "text": "I don't know what that means because it's hard to imagine anything could be worse than what actually occurred, but history's funny that way."}, {"time": 6172, "text": "And Hitler's always everyone's favorite example of the difference between the great man theory of history and the trends and forces theories of history, right?"}, {"time": 6181, "text": "The times made a Hitler possible and maybe even desirable to some."}, {"time": 6186, "text": "If you took him out of the equation, those trends and forces are still in place, right?"}, {"time": 6193, "text": "If you take him out and the door is still open, does somebody else walk through it?"}, {"time": 6199, "text": "Yeah, it's mathematically speaking, the probability of charismatic leaders emerge."}, {"time": 6208, "text": "I'm so torn on that at this point."}, {"time": 6212, "text": "Here's another way to look at it."}, {"time": 6213, "text": "The institutional stability of Germany in that time period was not enough to push back."}, {"time": 6221, "text": "And there are other periods in German history."}, {"time": 6223, "text": "I mean, that Hitler arose in, arisen in 1913, he doesn't get anywhere because Germany's institutional power is enough to simply quash that."}, {"time": 6234, "text": "It's the fact that Germany was unstable anyway that prevented a united front that would have kept radicalism from getting out of hand."}, {"time": 6244, "text": "A tricky question on this, just to stay on this a little longer because I'm not sure how to think about it, is the World War II versus the Holocaust."}, {"time": 6258, "text": "We were talking just now about the way that history unrolls itself and could Hitler have been stopped?"}, {"time": 6266, "text": "And I don't quite know what to think about Hitler without the Holocaust."}, {"time": 6273, "text": "And perhaps in his thinking, how essential the antisemitism and the hatred of Jews was."}, {"time": 6284, "text": "It feels to me that, I mean, we were just talking about where did he pick up his hatred of the Jewish people?"}, {"time": 6294, "text": "There's stories in Vienna and so on that it almost is picking up the idea of antisemitism as a really useful tool, as opposed to actually believing it in its core."}, {"time": 6310, "text": "Do you think World War II as it turned out and Hitler as he turned out would be possible without antisemitism?"}, {"time": 6318, "text": "Could we have avoided the Holocaust?"}, {"time": 6321, "text": "Or was it an integral part of the ideology of fascism and the Nazis?"}, {"time": 6329, "text": "Not an integral part of fascism because Mussolini really, I mean, Mussolini did it to please Hitler, but it wasn't an integral part."}, {"time": 6336, "text": "What's interesting to me is that that's the big anomaly in the whole question because antisemitism didn't need to be a part of this at all, right?"}, {"time": 6345, "text": "Hitler had a conspiratorial view of the world."}, {"time": 6350, "text": "He was a believer that the Jews controlled things, right?"}, {"time": 6353, "text": "The Jews were responsible for both Bolshevism on one side and capitalism on the other, they ruled the banks."}, {"time": 6360, "text": "I mean, United States was a Jewified country, right?"}, {"time": 6363, "text": "Bolshevism was a Jewified sort of a political."}, {"time": 6369, "text": "In other words, he saw Jews everywhere and he had that line about it."}, {"time": 6372, "text": "The Jews of Europe force another war to Germany, they'll pay the price or whatever, but then you have to believe that they're capable of that."}, {"time": 6380, "text": "The Holocaust is a weird, weird sidebar to the whole thing."}, {"time": 6384, "text": "And here's what I've always found interesting."}, {"time": 6385, "text": "It's a sidebar that weakened Germany because look at the First World War."}, {"time": 6389, "text": "The Jews fought for Germany, right?"}, {"time": 6391, "text": "Who was the most important?"}, {"time": 6394, "text": "And this is a very arguable point, but it's just the first one that pops into my head."}, {"time": 6398, "text": "Who was the most important Jewish figure that would have maybe been on the German side had the Germans had a non antisemitic?"}, {"time": 6408, "text": "Well, listen, that whole part."}, {"time": 6409, "text": "Yes, it was Einstein, but the whole, I should point out that to say Germany or Europe or Russia or any of those things were not antisemitic is to do injustice to history, right?"}, {"time": 6420, "text": "Pogroms, I mean, it's standard operating procedure."}, {"time": 6424, "text": "What you see in the Hitlerian era is an absolute huge spike, right?"}, {"time": 6429, "text": "Cause the government has a conspiracy theory that the Jews have."}, {"time": 6432, "text": "It's funny because Hitler both thought of them as weak and super powerful at the same time, right?"}, {"time": 6437, "text": "And as an outsider people that weakened Germany, the whole idea of the blood and how that connects to Darwinism and all that sort of stuff is just weird, right?"}, {"time": 6446, "text": "A real outlier, but Einstein, let's just play with Einstein."}, {"time": 6451, "text": "If there's no antisemitism in Germany or none above the normal level, right?"}, {"time": 6458, "text": "The baseline level, does Einstein leave along with all the other Jewish scientists?"}, {"time": 6464, "text": "And what does Germany have as increased technological and intellectual capacity if they stay, right?"}, {"time": 6472, "text": "It's something that actually weakened that state."}, {"time": 6475, "text": "It's a tragic flaw in the Hitlerian worldview, but it was so, and let me, you had mentioned earlier, like maybe it was not integral to his character."}, {"time": 6486, "text": "Maybe it was a wonderful tool for power."}, {"time": 6490, "text": "Somewhere along the line, and really not at the beginning, this guy became absolutely obsessed with this."}, {"time": 6497, "text": "With the conspiracy theory."}, {"time": 6499, "text": "And Jews, and he surrounded himself with people and theorists."}, {"time": 6503, "text": "I'm gonna use that word really, really sort of loosely, who believed this too."}, {"time": 6508, "text": "And so you have a cabal of people who are reinforcing this idea that the Jews control the world."}, {"time": 6515, "text": "He called it international jewelry was a huge part of the problem."}, {"time": 6519, "text": "And because of that, they deserved to be punished."}, {"time": 6520, "text": "They were an enemy within all these kinds of things."}, {"time": 6523, "text": "It's a nutty conspiracy theory that the government of one of the most, I mean, the big thing with Germany was culture, right?"}, {"time": 6531, "text": "They were a leading figure in culture and philosophy and all these kinds of things."}, {"time": 6536, "text": "And that they could be overtaken with this wildly wickedly weird conspiracy theory and that it would actually determine things."}, {"time": 6545, "text": "I mean, Hitler was taking vast amounts of German resources and using it to wipe out this race when he needed them for all kinds of other things to fight a war of annihilation."}, {"time": 6554, "text": "So that is the weirdest part of the whole Nazi phenomenon."}, {"time": 6559, "text": "It's the darkest possible silver lining to think about is that the Holocaust may have been and the hatred of the Jewish people may have been the thing that avoided Germany getting the nuclear weapons first."}, {"time": 6578, "text": "Isn't that a wonderful historical ironic twist that if it weren't so overlaid with tragedy, a thousand years from now will be seen as something really kind of funny."}, {"time": 6586, "text": "Well, that's true."}, {"time": 6587, "text": "It's fascinating to think as you've talked."}, {"time": 6590, "text": "So the seeds of his own destruction, right?"}, {"time": 6592, "text": "The tragic flaw."}, {"time": 6595, "text": "And my hope is, this is a discussion I have with my dad as a physicist, is that evil inherently contains with it that kind of incompetence."}, {"time": 6612, "text": "So my dad's discussion, so he's a physicist and an engineer, his belief is that at this time in our history, the reason we haven't had nuclear like terrorist blow up a nuclear weapon somewhere in the world is that the kind of people that would be terrorists are simply not competent enough at their job of being a destructive."}, {"time": 6641, "text": "So like, there's a kind of, if you plot it, the more evil you are, the less able you are."}, {"time": 6647, "text": "And by evil, I mean, purely just like we said, if we were to consider the hatred of Jewish people as evil, because it's sort of detached from reality, it's like just this pure hatred of something that's grounded on things, conspiracy theories."}, {"time": 6667, "text": "If that's evil, then the more you sell yourself, the more you give into these conspiracy theories, the less capable you are at actually engineering, which is very difficult, engineering nuclear weapons and effectively deploying them."}, {"time": 6680, "text": "So that's a hopeful message that the destructive people in this world are by their worldview incompetent in creating the ultimate destruction."}, {"time": 6695, "text": "I straight up don't agree with that."}, {"time": 6697, "text": "So why are we still here?"}, {"time": 6699, "text": "Why haven't we destroyed ourselves?"}, {"time": 6701, "text": "Why haven't the terrorists blown, it's been many decades."}, {"time": 6705, "text": "Why haven't we destroyed ourself to this point?"}, {"time": 6709, "text": "Well, when you say it's been many decades, many decades, that's like saying in the life of 150 year old person, we've been doing well for a year."}, {"time": 6718, "text": "The problem with all these kinds of equations, and it was Bertrand Russell, right?"}, {"time": 6722, "text": "The philosopher who said so."}, {"time": 6724, "text": "He said, it's unreasonable to expect a man to walk on a tight rope for 50 years."}, {"time": 6732, "text": "I mean, the problem is that this is a long game."}, {"time": 6735, "text": "And let's remember that up until relatively recently, what would you say, 30 years ago, the nuclear weapons in the world were really tightly controlled."}, {"time": 6744, "text": "That was one of the real dangers in the fall of the Soviet Union."}, {"time": 6746, "text": "Remember the worry that all of a sudden you were gonna have bankrupt former Soviet Republic selling nuclear weapons to terrorists and whatnot."}, {"time": 6755, "text": "I would suggest, and here's another problem is that when we call these terrorists evil, it's easy for an American, for example, to say that Osama bin Laden is evil."}, {"time": 6764, "text": "Easy for me to say that."}, {"time": 6766, "text": "But one man's terrorist is another man's freedom fighter as the saying goes, and to other people, he's not."}, {"time": 6772, "text": "What Osama bin Laden did, and the people that worked with him, we would call evil genius."}, {"time": 6778, "text": "The idea of hijacking planes and flying them into the buildings like that, and that he could pull that off, and that still boggles my mind."}, {"time": 6787, "text": "I'm still, it's funny, I'm still stunned by that."}, {"time": 6790, "text": "And yet, the idea, here's the funny part, and I hesitate to talk about this because I don't wanna give anyone ideas, but you don't need nuclear weapons to do incredibly grave amounts of danger."}, {"time": 6806, "text": "I mean, what one can of gasoline and a BIC lighter can do in the right place and the right time, and over and over and over again can bring down societies."}, {"time": 6818, "text": "This is the argument behind the importance of the stability that a nation state provides."}, {"time": 6824, "text": "So when we went in and took out Saddam Hussein, one of the great counter arguments from some of the people who said, this is a really stupid thing to do, is that Saddam Hussein was the greatest anti terror weapon in that region that you could have because they were a threat to him."}, {"time": 6841, "text": "So he took that, and he did it in a way that was much more repressive than we would ever be, right?"}, {"time": 6847, "text": "And this is the old line about why we supported right wing death squad countries, because they were taking out people that would inevitably be a problem for us if they didn't, and they were able to do it in a way we would never be able to do, supposedly."}, {"time": 6861, "text": "We're pretty good at that stuff, just like the Soviet Union was behind the scenes and underneath the radar."}, {"time": 6867, "text": "But the idea that the stability created by powerful and strong centralized leadership allowed them, it's almost like outsourcing anti terror activities, allowed them to, for their own reasons."}, {"time": 6879, "text": "I mean, you see the same thing in the Syria situation with the Assads."}, {"time": 6882, "text": "I mean, you can't have an ISIS in that area because that's a threat to the Assad government who will take care of that for you, and then that helps us by not having an ISIS."}, {"time": 6891, "text": "So I would suggest one, that the game is still on on whether or not these people get nuclear weapons in their hands."}, {"time": 6900, "text": "I would suggest they don't need them to achieve their goals, really."}, {"time": 6905, "text": "The crazy thing is if you start thinking like the Joker in Batman, the terrorist ideas, it's funny, I guess I would be a great terrorist because I'm just full of those ideas."}, {"time": 6913, "text": "Oh, you could do this, you could, it's scary to think of how vulnerable we are."}, {"time": 6917, "text": "But the whole point is that you as the Joker wouldn't do the terrorist actions."}, {"time": 6924, "text": "That's the theory that's so hopeful to me with my dad, is that all the ideas, your ability to generate good ideas, forget nuclear weapons, how you can disrupt the power grid, how you can disrupt the, attack our psychology, attack like with a can of gasoline, like you said, somehow disrupt the American system of ideas."}, {"time": 6949, "text": "That coming up with good ideas there."}, {"time": 6953, "text": "Are we saying evil people can't come up with evil genius ideas?"}, {"time": 6958, "text": "We have this Hollywood story."}, {"time": 6960, "text": "I don't think history backs that up."}, {"time": 6962, "text": "I mean, I think you can say with the nuclear weapons, it does, but only because they're so recent."}, {"time": 6966, "text": "But I mean, evil genius, I mean, that's almost proverbial."}, {"time": 6970, "text": "But that's, okay, so to push back for the fun of it, or."}, {"time": 6973, "text": "And I don't mean to, I don't want you to leave this in a terrible mood because I push back on every hopeful idea you had, but I tend to be a little cynical about that stuff."}, {"time": 6982, "text": "But that goes to the definition of evil, I think, because I'm not so sure human history has a lot of evil people being competent."}, {"time": 6993, "text": "I do believe that they mostly, like in order to be good at doing what may be perceived as evil, you have to be able to construct an ideology around which you truly believe when you look in the mirror by yourself, that you're doing good for the world."}, {"time": 7011, "text": "And it's difficult to construct an ideology where destroying the lives of millions or disrupting the American system, I'm already contradicting myself as I'm saying."}, {"time": 7023, "text": "I was just gonna say, people have done this already, yes."}, {"time": 7025, "text": "So, but then it's the question of like, about aliens with the idea that if the aliens are all out there, why haven't they visited us?"}, {"time": 7040, "text": "The same question, if it's so easy to be evil, not easy, if it's possible to be evil, why haven't we destroyed ourselves?"}, {"time": 7049, "text": "And your statement is from the context of history, the game is still on."}, {"time": 7054, "text": "And it's just been a few years since we've found the tools to destroy ourselves."}, {"time": 7060, "text": "And one of the challenges of our modern time that we don't often think about this pandemic kind of revealed is how soft we've gotten in terms of our deep dependence on the system."}, {"time": 7073, "text": "So somebody mentioned to me, what happens if power goes out for a day?"}, {"time": 7079, "text": "What happens if power goes out for a month?"}, {"time": 7084, "text": "Oh, for example, the person that mentioned this was a Berkeley faculty that I was talking with."}, {"time": 7090, "text": "He's an astronomer who's observing solar flares."}, {"time": 7093, "text": "And it's very possible that a solar flare, they happen all the time to different degrees."}, {"time": 7099, "text": "To knock out your cell phones."}, {"time": 7100, "text": "Yeah, to knock out the power grid for months."}, {"time": 7105, "text": "So like, just as a thought experiment, what happens if just power goes out for a week in this country?"}, {"time": 7113, "text": "Like the electromagnetic pulses and the nuclear weapons and all those kinds of things, yeah."}, {"time": 7118, "text": "But maybe that's an act of nature."}, {"time": 7121, "text": "And even just the act of nature will reveal like a little."}, {"time": 7126, "text": "The fragility of it all."}, {"time": 7128, "text": "And then the evil can emerge."}, {"time": 7130, "text": "I mean, the kind of things that might happen when power goes out, especially during a divisive time."}, {"time": 7136, "text": "Well, you won't have food."}, {"time": 7137, "text": "At baseline level, that would mean that the entire supplies chain begins to break down."}, {"time": 7144, "text": "And then you have desperation."}, {"time": 7146, "text": "And desperation opens the door to everything."}, {"time": 7149, "text": "Can I ask a dark question?"}, {"time": 7150, "text": "As opposed to the other things we've been talking about?"}, {"time": 7153, "text": "There's always a thread, a hopeful message."}, {"time": 7156, "text": "I think there'll be a hopeful message on this one too."}, {"time": 7158, "text": "You may have the wrong guess."}, {"time": 7163, "text": "If you were to bet money on the way that human civilization destroys itself, or it collapses in some way that is, where the result would be unrecognizable to us as anything akin to progress, what would you say?"}, {"time": 7182, "text": "Is it nuclear weapons?"}, {"time": 7186, "text": "Is it some societal breakdown through just more traditional kinds of war?"}, {"time": 7191, "text": "Is it engineered pandemics, nanotechnology?"}, {"time": 7194, "text": "Is it artificial intelligence?"}, {"time": 7196, "text": "Is it something we can't even expect yet?"}, {"time": 7199, "text": "Do you have a sense of how we humans will destroy ourselves?"}, {"time": 7202, "text": "Or might we live forever?"}, {"time": 7204, "text": "I think what governs my view of this thing is the ability for us to focus ourselves collectively."}, {"time": 7213, "text": "And that gives me the choice of looking at this and saying, what are the odds we will do X versus Y, right?"}, {"time": 7220, "text": "So go look at the 62 Cuban Missile Crisis, where we looked at the potential of nuclear war and we stared right in the face of that."}, {"time": 7230, "text": "To me, I consider that to be, you wanna talk about a hopeful moment?"}, {"time": 7234, "text": "That's one of the rare times in our history where I think the odds were overwhelmingly that there would be a nuclear war."}, {"time": 7243, "text": "And I'm not the super Kennedy worshiper that, I grew up in an era where he was, especially amongst people in the Democratic Party, he was almost worshiped."}, {"time": 7252, "text": "And I was never that guy, but I will say something."}, {"time": 7254, "text": "John F. Kennedy by himself probably made decisions that saved a hundred million or more lives because everyone around him thought he should be taking the road that would have led to those deaths."}, {"time": 7268, "text": "And to push back against that is, when you look at it now, I mean, again, if you were a betting person, you would have bet against that."}, {"time": 7275, "text": "And that's rare, right?"}, {"time": 7277, "text": "So when we talk about how the world will end, the fact that one person actually had that in their hands meant that it wasn't a collective decision."}, {"time": 7289, "text": "It gave, remember I said, I trust people on an individual level, but when we get together, we're more like a herd and we devolved down to the lowest common denominator."}, {"time": 7296, "text": "That was something where the higher ethical ideas of a single human being could come into play and make the decisions that influence the events."}, {"time": 7306, "text": "But when we have to act collectively, I get a lot more pessimistic."}, {"time": 7310, "text": "So take what we're doing to the planet."}, {"time": 7313, "text": "And we talk about it always now in terms of climate change, which I think is far too narrow."}, {"time": 7319, "text": "Look at, and I always get very frustrated when we talk about these arguments about, is it happening?"}, {"time": 7324, "text": "Is it human?"}, {"time": 7325, "text": "Just look at the trash, forget climate for a second."}, {"time": 7329, "text": "We are destroying the planet because we're not taking care of it and because what it would do to take care of it would require collective sacrifices that would require enough of us to say, okay."}, {"time": 7341, "text": "And we can't get enough of us to say, okay, because too many people have to be on board."}, {"time": 7347, "text": "It's not John F. Kennedy making one decision from one man."}, {"time": 7350, "text": "We have to have 85% of us or something around the world."}, {"time": 7354, "text": "Not just, you can't say we're gonna stop doing damage to the world here in the United States if China does it."}, {"time": 7361, "text": "So the amount of people that have to get on board that train is hard."}, {"time": 7366, "text": "You get pessimistic hoping for those kinds of shifts unless it's right, you know, Krypton's about to explode."}, {"time": 7374, "text": "We have, and so I think if you're talking about a gambling man's view of this, that that's gotta be the odds on favorite because it requires such a UNAM."}, {"time": 7385, "text": "I mean, and the systems maybe aren't even in place, right?"}, {"time": 7389, "text": "The fact that we would need intergovernmental bodies that are completely discredited now on board and you would have to subvert the national interests of nation states, I mean, the amount of things that have to go right in a short period of time where we don't have 600 years to figure this out, right?"}, {"time": 7407, "text": "So to me, that looks like the most likely just because the things we would have to do to avoid it seem the most unlikely."}, {"time": 7415, "text": "I believe, call me naive, in just like you said with the individual, I believe that charismatic leaders, individual leaders will save us."}, {"time": 7426, "text": "What if you don't get them all at the same time?"}, {"time": 7428, "text": "What if you get a charismatic leader in one country but under, or what if you get a charismatic leader in a country that doesn't really matter that much?"}, {"time": 7434, "text": "Well, it's a ripple effect."}, {"time": 7435, "text": "So it starts with one leader and their charisma inspires other leaders."}, {"time": 7440, "text": "So it's like one ant queen steps up and then the rest of the ant starts behaving."}, {"time": 7447, "text": "And then there's like little other spikes of leaders that emerge."}, {"time": 7451, "text": "And then that's where collaboration emerges."}, {"time": 7453, "text": "I tend to believe that like when you heat up the system and shit starts getting really chaotic, then the leader, whatever this collective intelligence that we've developed, the leader will emerge."}, {"time": 7467, "text": "Like there."}, {"time": 7468, "text": "Don't you think there's just as much of a chance though that the leader would emerge and say, the Jews are the people who did all this."}, {"time": 7474, "text": "Is that the idea that they would come up, you have a charismatic leader and he's going to come up with the rights or she is going to come up with the right solution as opposed to totally coming up with the wrong solution."}, {"time": 7485, "text": "I mean, I guess what I'm saying is you could be right, but a lot of things have to go the right way."}, {"time": 7490, "text": "But my intuition about the evolutionary process that led to the creation of human intelligence and consciousness on earth results in the power of like, if we think of it, just the love in the system versus the hate in the system, that the love is greater."}, {"time": 7507, "text": "The human kindness potential in the system is greater than the human hatred potential."}, {"time": 7518, "text": "And so the leader that is in the time when it's needed, the leader that inspires love and kindness is more likely to emerge and will have more power."}, {"time": 7530, "text": "So you have the Hitlers of the world that emerge, but they're actually in a grand scheme of history are not that impactful."}, {"time": 7540, "text": "So it's weird to say, but not that many people died in World War II."}, {"time": 7545, "text": "If you look at the full range of human history, it's up to a hundred million, whatever that is, with natural pandemics too, you can have those kinds of numbers, but it's still a percentage."}, {"time": 7560, "text": "I forget what the percentage is, maybe three, 5% of the human population on earth."}, {"time": 7564, "text": "Maybe it's a little bit focused on a different region, but it's not destructive to the entirety of human civilization."}, {"time": 7571, "text": "So I believe that the charismatic leaders, when time is needed, that do good for the world in the broader sense of good are more likely to emerge than the ones that say, kill all the Jews."}, {"time": 7589, "text": "It's possible though, and this is just, I've thought about this all of 30 seconds, but I mean, it seems."}, {"time": 7596, "text": "We're betting money here on the 21st century, who's gonna win?"}, {"time": 7599, "text": "I think maybe you've divided this into too much of a black and white dichotomy, this love and good on one side and this evil on another."}, {"time": 7608, "text": "Let me throw something that might be more in the center of that linear balancing act, self interest, which may or may not be good."}, {"time": 7619, "text": "The good version of it we call enlightened self interest."}, {"time": 7622, "text": "The bad version of it we call selfishness."}, {"time": 7625, "text": "But self interest to me seems like something more likely to impact the outcome than either love on one side or evil on the other."}, {"time": 7634, "text": "Simply a question of what's good for me or what's good for my country or what's good from my point of view or what's good for my business."}, {"time": 7642, "text": "I mean, if you tell me, and maybe I'm a coal miner or maybe I own a coal mine."}, {"time": 7649, "text": "If you say to me, we have to stop using coal because it's hurting the earth, I have a hard time disentangling that greater good question from my right now good feeding my family question, right?"}, {"time": 7663, "text": "So I think maybe it's gonna be a much more banal thing than good and evil, much more a question of we're not all going to decide at the same time that the interests that we have are aligned."}, {"time": 7678, "text": "Totally, but I mean, I've looked at Ayn Rand and objectivism and kind of really thought like, how bad or good can things go when everybody's acting selfishly?"}, {"time": 7686, "text": "But I think we're just talking two aunts here with microphones talking about."}, {"time": 7693, "text": "But like the question is when this spreads, so what do I mean by love and kindness?"}, {"time": 7703, "text": "I think it's human flourishing on earth and throughout the cosmos."}, {"time": 7708, "text": "It feels like whatever the engine that drives human beings is more likely to result in human flourishing."}, {"time": 7717, "text": "And people like Hitler are not good for human flourishing."}, {"time": 7721, "text": "So that's what I mean by good is there's a, I mean, maybe it's an intuition that kindness is an evolutionary advantage."}, {"time": 7731, "text": "I hate those terms."}, {"time": 7732, "text": "I hate to reduce stuff to evolutionary biology always, but it just seems like for us to multiply throughout the universe, it's good to be kind to each other."}, {"time": 7743, "text": "And those leaders will always emerge to save us from the Hitlers of the world that wanna kind of burn the thing down with a flamethrower."}, {"time": 7751, "text": "That's the intuition."}, {"time": 7752, "text": "But let's talk about, you brought up evolution several times."}, {"time": 7754, "text": "Let me play with that for a minute."}, {"time": 7758, "text": "I think going back to animal times, we are conditioned to deal with overwhelming threats right in front of us."}, {"time": 7765, "text": "So I have quite a bit of faith in humanity when it comes to impending doom right outside our door."}, {"time": 7773, "text": "If Krypton's about to explode, I think humanity can rouse themselves to great, and would give power to the people who needed it and be willing to make the sacrifices."}, {"time": 7784, "text": "But that's what makes, I think, the pollution slash climate change slash screwing up your environment threat so particularly insidious is it happens slowly, right?"}, {"time": 7795, "text": "It defies fight and flight mechanisms."}, {"time": 7798, "text": "It defies the natural ability we have to deal with the threat that's right on top of us."}, {"time": 7803, "text": "And it requires an amount of foresight that while some people would be fine with that, most people are too worried and understandably, I think too worried about today's threat rather than next generation's threat or whatever it might be."}, {"time": 7818, "text": "So I mean, when we talk about when you had said, what do you think the greatest threat is?"}, {"time": 7823, "text": "I think with nuclear weapons, I think could we have a nuclear war?"}, {"time": 7826, "text": "We darn right could, but I think that there's enough of an inertia where against that because people understand instinctively, if I decide to launch this attack against China and I'm India, we're gonna have 50 million dead people tomorrow."}, {"time": 7841, "text": "Whereas if you say, we're gonna have a whole planet of dead people in three generations if we don't start now, I think the evolutionary way that we have evolved mitigates maybe against that."}, {"time": 7855, "text": "In other words, I think I would be pleasantly surprised if we could pull that off."}, {"time": 7862, "text": "I don't mean to be like, I'm the sight predicting doom."}, {"time": 7865, "text": "It's fun that way."}, {"time": 7866, "text": "I think we're both, maybe I'm over the top on the love thing."}, {"time": 7869, "text": "Maybe I'm over the top on the doom."}, {"time": 7871, "text": "So it makes for a fun chat, I think."}, {"time": 7874, "text": "So one guy that I've talked to several times is slowly becoming a friend is a guy named Elon Musk."}, {"time": 7882, "text": "He's a big fan of hardcore history, especially Genghis Khan series of episodes, but really all of it, him and his girlfriend Grimes listen to it, which is."}, {"time": 7894, "text": "I know Elon."}, {"time": 7895, "text": "Yeah, you know Elon?"}, {"time": 7897, "text": "So that's like relationship goals, like listen to hardcore history on the weekend with your loved one."}, {"time": 7904, "text": "So let me, if I were to look at the guy from a perspective of human history, it feels like he will be a little speck that's remembered."}, {"time": 7916, "text": "You think about like the people, what will we remember from our time?"}, {"time": 7921, "text": "Who are the people we'll remember, whether it's the Hitlers or the Einsteins, who's going to be?"}, {"time": 7929, "text": "It's hard to predict when you're in it, but it seems like Elon will be one of those people remembered."}, {"time": 7934, "text": "And if I were to guess what he's remembered for, it's the work he's doing with SpaceX and potentially being the person."}, {"time": 7943, "text": "Now we don't know, but the being the person who launched a new era of space exploration."}, {"time": 7951, "text": "If we look centuries from now, if we are successful as human beings surviving long enough to venture out into the, you know, toward the stars."}, {"time": 7963, "text": "It's weird to ask you this."}, {"time": 7964, "text": "I don't know what your opinions are, but do you think humans will be a multi planetary species in the long arc of history?"}, {"time": 7973, "text": "Do you think Elon will be successful in his dream?"}, {"time": 7976, "text": "And he doesn't shy away from saying it this way, right?"}, {"time": 7979, "text": "He really wants us to colonize Mars first and then colonize other Earth like planets in other solar systems throughout the galaxy."}, {"time": 7991, "text": "Do you have a hope that we humans will venture out towards the stars?"}, {"time": 7996, "text": "And this actually, again, dovetails to what we were talking about earlier."}, {"time": 7999, "text": "I actually, first of all, I toured SpaceX and it's hard to get your mind around because he's doing what it took governments to do before."}, {"time": 8010, "text": "So it's incredible that we're watching individual companies and stuff doing this."}, {"time": 8014, "text": "Doing it faster and cheaper."}, {"time": 8015, "text": "Well, and pushing the envelope, right?"}, {"time": 8018, "text": "Faster than the governments at the time we're moving."}, {"time": 8022, "text": "I mean, there's a lot of people who I think, who think Elon is overrated and you have no idea, right?"}, {"time": 8029, "text": "When you go see it, you have no idea."}, {"time": 8031, "text": "But that's actually not what I'm most impressed with."}, {"time": 8035, "text": "It's Tesla I'm most impressed with."}, {"time": 8037, "text": "And the reason why is because in my mind, we just talked about what I think is the greatest threat, the environmental stuff."}, {"time": 8044, "text": "And I talked about our inability maybe all at the same time to be willing to sacrifice our self interests in order for the goal."}, {"time": 8054, "text": "And I don't wanna put words in Elon's mouth, so you can talk to him if you want to."}, {"time": 8058, "text": "But in my mind, what he's done is recognize that problem."}, {"time": 8062, "text": "And instead of building a car that's a piece of crap, but it's good for the environment so you should drive it, he's trying to create a car that if you're only motivated by your self interest, you'll buy it anyway."}, {"time": 8075, "text": "And it will help the environment and help us transition away from one of the main causes of damage."}, {"time": 8080, "text": "I mean, one of the things this pandemic and the shutdown around the world has done is show us how amazingly quickly the earth can actually rejuvenate."}, {"time": 8089, "text": "We're seeing clear skies in places species come and you would have thought it would have taken decades for some of this stuff."}, {"time": 8095, "text": "So what if to name just one major pollution source, we didn't have the pollution caused by automobiles, right?"}, {"time": 8103, "text": "And if you had said to me, Dan, what do you think the odds of us transitioning away from that were 10 years ago, I would have said, well, people aren't gonna do it because it's inefficient, it's this, it's that, nobody wants to, but what if you created a vehicle that was superior in every way so that if you were just a self oriented consumer, you'd buy it because you wanted that car."}, {"time": 8121, "text": "That's the best way to get around that problem of people not wanting to, I think he's identified that."}, {"time": 8128, "text": "And as he's told me before, when the last time a car company was created that actually, blah, blah, blah, he's right."}, {"time": 8136, "text": "And so I happen to feel that even though he's pushing the envelope on the space thing, I think somebody else would have done that someday."}, {"time": 8143, "text": "I'm not sure because of the various things he's mentioned, how difficult it is to start there, I'm not sure that the industries that create vehicles for us would have gone where he's going to lead them if he didn't force them there through consumer demand by making a better car that people wanted anyway."}, {"time": 8160, "text": "They'll follow, they'll copy, they'll do all those things."}, {"time": 8163, "text": "And yet who was gonna do that?"}, {"time": 8166, "text": "So I hope he doesn't hate me for saying this, but I happen to think the Tesla idea may alleviate some of the need to get off this planet because the planet's being destroyed, right?"}, {"time": 8177, "text": "And we're gonna colonize Mars probably anyway if we live long enough."}, {"time": 8180, "text": "And I think the Tesla idea, not just Elon's version, but ones that follow from other people is the best chance of making sure we're around long enough to see Mars colonized."}, {"time": 8224, "text": "So it gives me hope as an individual that I can build something that can actually have impact that counteracts the Stalins and the Hitlers and all the threats that face that human civilization faces, that an individual has that power."}, {"time": 8246, "text": "I didn't believe that the individual has that power in the halls of government."}, {"time": 8252, "text": "Like, I don't feel like any one presidential candidate can rise up and help the world, unite the world."}, {"time": 8258, "text": "It feels like from everything I've seen and you're right with Tesla, it can bring the world together to do good."}, {"time": 8269, "text": "That's a really powerful mechanism of whatever you say about capitalism, that you can build companies that start, it starts with a single individual."}, {"time": 8279, "text": "Of course, there's a collective that grows around that, but the leadership of a single individual, their ideas, their dreams, their vision can catalyze something that takes over the world and does good for the entire world."}, {"time": 8294, "text": "But if I think, but again, I think the genius of the idea is that it doesn't require us to go head to head with human nature, right?"}, {"time": 8303, "text": "He's actually built human nature into the idea by basically saying, I'm not asking you to be an environmental activist."}, {"time": 8311, "text": "I'm not asking you to sacrifice to make it."}, {"time": 8313, "text": "I'm gonna sell you a car you're going to like better."}, {"time": 8316, "text": "And by buying it, you'll help the environment."}, {"time": 8318, "text": "That takes into account our foibles as a species and actually leverages that to work for the greater good."}, {"time": 8326, "text": "And that's the sort of thing that does turn off my little doom caster cynicism thing a little bit because you're actually hitting us where we live, right?"}, {"time": 8335, "text": "You're not, you can take somebody who doesn't even believe the environment's a problem, but they want a Tesla."}, {"time": 8340, "text": "So they're inadvertently helping anyway."}, {"time": 8343, "text": "I think that's the genius of the idea."}, {"time": 8345, "text": "Yeah, and I'm telling you, that's one way to make love a much more efficient mechanism of change than hate."}, {"time": 8353, "text": "Making it in your self interest to love somebody."}, {"time": 8355, "text": "Making it in your self interest, creating a product that leads to more love than hate."}, {"time": 8361, "text": "You're gonna wanna love your neighbor because you're gonna make a fortune."}, {"time": 8364, "text": "Right, okay, I get it."}, {"time": 8366, "text": "That's why he said."}, {"time": 8366, "text": "All right, I'm on board."}, {"time": 8367, "text": "That's why Elon said love is the answer."}, {"time": 8369, "text": "That's, I think, exactly what he meant."}, {"time": 8373, "text": "Okay, let's try something difficult."}, {"time": 8375, "text": "You've recorded an episode of Steering Into the Iceberg on your Common Sense program."}, {"time": 8384, "text": "That has started a lot of conversations."}, {"time": 8388, "text": "It's quite moving, it was quite haunting."}, {"time": 8391, "text": "Got me a lot of angry emails."}, {"time": 8395, "text": "I did something I haven't done in 30 years."}, {"time": 8397, "text": "I endorsed a political candidate from one of the two main parties and there were a lot of disillusioned people because of that."}, {"time": 8402, "text": "I guess I didn't hear it as an endorsement."}, {"time": 8405, "text": "I just heard it as the similar flavor of conversation as you have in hardcore history."}, {"time": 8414, "text": "It's almost the speaking about modern times in the same voice as you speak about when you talk about history."}, {"time": 8423, "text": "So it was just a little bit of a haunting view of the world today."}, {"time": 8430, "text": "I know we were just wearing our doom caster."}, {"time": 8433, "text": "Let me put that right back on, are you?"}, {"time": 8438, "text": "I like the term doom caster."}, {"time": 8444, "text": "How do we get love to win?"}, {"time": 8447, "text": "What's the way out of this?"}, {"time": 8449, "text": "Is there some hopeful line that we can walk to avoid something, and I hate to use the terminology, but something that looks like a civil war, not necessarily a war of force, but a division to a level where it doesn't any longer feel like a United States of America with an emphasis on United."}, {"time": 8480, "text": "Is there a way out?"}, {"time": 8483, "text": "I read a book a while back."}, {"time": 8484, "text": "I want to say George Friedman, the Stratfor guy wrote it."}, {"time": 8488, "text": "It was something called The Next Hundred Years, I think it was called."}, {"time": 8491, "text": "And I remember thinking, I didn't agree with any of it."}, {"time": 8495, "text": "And one of the things I think he said in the book was that the United States was going to break up."}, {"time": 8499, "text": "I'm going from memory here."}, {"time": 8500, "text": "He might not have said that at all, but something was stuck in my memory about that."}, {"time": 8502, "text": "And I remember thinking, but I think some of the arguments were connected to the differences that we had and the fact that those differences are being exploited."}, {"time": 8515, "text": "So we talked about media earlier and the lack of truth and everything."}, {"time": 8518, "text": "We have a media climate that is incentivized to take the wedges in our society and make them wider."}, {"time": 8528, "text": "And there's no countervailing force to do the opposite or to help."}, {"time": 8533, "text": "So there was a famous memo from a group called Project for a New American Century."}, {"time": 8541, "text": "And they took it down, but the Wayback Machine online still has it."}, {"time": 8544, "text": "And it happened before 9 11, spawned all kinds of conspiracy theories because it was saying something to the effect of, and I'm really paraphrasing here, but you know that the United States needs another Pearl Harbor type event because those galvanize a country that without those kinds of events periodically is naturally geared towards pulling itself apart."}, {"time": 8565, "text": "And it's those periodic events that act as the countervailing force that otherwise is not there."}, {"time": 8572, "text": "If that's true, then we are naturally inclined towards pulling ourselves apart."}, {"time": 8577, "text": "So to have a media environment that makes money off widening those divisions, which we do."}, {"time": 8587, "text": "I mean, I was in talk radio and it has those people, the people that used to scream at me cause I wouldn't do it."}, {"time": 8593, "text": "But I mean, we would have these terrible conversations after every broadcast where I'd be in there with the program director and they're yelling at me about heat."}, {"time": 8601, "text": "Heat was the word they create more heat."}, {"time": 8602, "text": "Well, what is heat, right?"}, {"time": 8604, "text": "Heat is division, right?"}, {"time": 8605, "text": "And they want the heat, not because they're political, they're not Republicans or Democrats either."}, {"time": 8612, "text": "We want listeners and we want engagement and involvement."}, {"time": 8616, "text": "And because of the constructs of the format, you don't have a lot of time to get it."}, {"time": 8620, "text": "So you can't have me giving you like on a podcast an hour and a half or two hours where we build a logical argument and you're with me the whole way, your audience is changing every 15 minutes."}, {"time": 8631, "text": "So whatever points you make to create interest and intrigue and engagement have to be knee jerk right now."}, {"time": 8638, "text": "Things, they told me once that the audience has to know where you stand on every single issue within five minutes of turning on your show."}, {"time": 8647, "text": "In other words, you have to be part of a linear set of political beliefs so that if you feel A about subject A, then you must feel D about subject D. And I don't even need to hear your opinion on it cause if you feel that way about A, you're gonna feel that way about D. This is a system that is designed to pull us apart for profit, but not because they wanna pull us apart, right?"}, {"time": 8669, "text": "It's a byproduct of the profit."}, {"time": 8672, "text": "That's one little example of 50 examples in our society that work in that same fashion."}, {"time": 8704, "text": "So in answer to your question about civil wars, we can't have the same kind of civil war because we don't have a geographical division that's as clear cut as the one we had before, right?"}, {"time": 8713, "text": "You had a basically north south line and some border states."}, {"time": 8716, "text": "It was set up for that kind of a split."}, {"time": 8718, "text": "Now we're divided within communities, within families, within gerrymandered voting districts and precincts, right?"}, {"time": 8725, "text": "So you can't disengage."}, {"time": 8728, "text": "We're stuck with each other."}, {"time": 8730, "text": "So if there's a civil war now, for lack of a better word, what it might seem like is the late 1960s, early 1970s, where you had the bombings and let's call it domestic terrorism and things like that, because that would seem to be something that once again, you don't even need a large chunk of the country pulling apart."}, {"time": 8752, "text": "10% of people who think it's the end times can do the damage."}, {"time": 8757, "text": "Just like we talked about terrorism before and a can of gas and a big lighter, I've lived in a bunch of places and I won't give anybody ideas where a can of gas and a big lighter would take a thousand houses down before you could blink."}, {"time": 8772, "text": "That terrorist doesn't have to be from the Middle East, doesn't have to have some sort of a fundamentalist or religious agenda."}, {"time": 8778, "text": "It could just be somebody really pissed off about the election results."}, {"time": 8782, "text": "So once again, if we're playing an odds game here, everybody has to behave for this to work right."}, {"time": 8788, "text": "Only a few people have to misbehave for this thing to go sideways."}, {"time": 8791, "text": "And remember, for every action, there is an equal and opposite reaction."}, {"time": 8796, "text": "So you don't even have to have those people doing all these things."}, {"time": 8799, "text": "All they have to do is start a tit for tat retribution cycle."}, {"time": 8803, "text": "And there's an escalation."}, {"time": 8805, "text": "And it creates a momentum of its own, which leads fundamentally, if you follow the chain of events down there to some form of dictatorial government as the only way to create stability, right?"}, {"time": 8817, "text": "You want to destroy the Republic and have a dictator, that's how you do."}, {"time": 8820, "text": "And there are parallels to Nazi Germany, the burning of the Reichstag, blah, blah, blah."}, {"time": 8825, "text": "I'm the doom caster again, aren't I?"}, {"time": 8827, "text": "And some of it could be manufactured by those seeking authoritarian power."}, {"time": 8832, "text": "Absolutely, like the Reichstag fire was or the Polish soldiers that fired over the border before the invasion in 1939."}, {"time": 8840, "text": "To fight the devil's advocate with an angel's advocate, I would say just as our conversation about Elon, it feels like individuals have power to unite us, to be that force of unity."}, {"time": 8853, "text": "So you mentioned the media."}, {"time": 8855, "text": "I think you're one of the great podcasters in history."}, {"time": 8860, "text": "Joe Rogan is like a long form, whatever."}, {"time": 8864, "text": "It's not podcasting, it's actually whatever the, yeah."}, {"time": 8867, "text": "Very infrequent is what it is, no matter what it is."}, {"time": 8870, "text": "But the basic process of it is you go deep and you stay deep and the listener stays with you for a long time."}, {"time": 8877, "text": "So I'm just looking at the numbers, like we're almost three hours in."}, {"time": 8885, "text": "And from previous episodes, I can tell you that about 300,000 people are still listening to the sound of our voice three hours in."}, {"time": 8895, "text": "So usually it's 300 to 500,000 people listen and they tune out."}, {"time": 8899, "text": "Congratulations, by the way, that's wonderful."}, {"time": 8900, "text": "Joe Rogan is like 10 times that."}, {"time": 8903, "text": "And so he has power to unite."}, {"time": 8910, "text": "You have power to unite."}, {"time": 8911, "text": "There's a few people with voices that it feels like they have power to unite."}, {"time": 8917, "text": "Even if you quote unquote endorse a candidate and so on, there's still, it feels to me that speaking of, I don't wanna keep saying love, but it's love and maybe unity more practically speaking that like sanity, that like respect for those you don't agree with or don't understand."}, {"time": 8944, "text": "So empathy, just a few voices of those can help us avoid the really importantly, not avoid the singular events, like you said, of somebody starting a fire and so on, but avoid the escalation of it."}, {"time": 8961, "text": "The preparedness of the populace to escalate those events, to turn a singular event and a single riot or a shooting or like even something much more dramatic than that, to turn that into something that creates like ripples that grow as opposed to ripples that fade away."}, {"time": 8983, "text": "And so like, I would like to put responsibility on somebody like you and on me in some small way."}, {"time": 8991, "text": "And Joe, being cognizant of the fact that a lot of very destructive things might happen in November."}, {"time": 9001, "text": "And a few voices can save us is the feeling I have."}, {"time": 9005, "text": "Not by saying who you should vote for or any of that kind of stuff, but really by being the voice of calm that like calms the seas from or whatever the analogy is from boiling up."}, {"time": 9022, "text": "Because I truly am worried about, this is the first time this year when I, I sometimes, I somehow have felt that the American project will go on forever."}, {"time": 9035, "text": "When I came to this country, I just believed, and I still think I'm young, but like, I have a dream of creating a company that will do a lot of good for the world."}, {"time": 9047, "text": "And I thought that America is the beacon of hope for the world and the ideas of freedom, but also the idea of empowering companies that can do some good for the world."}, {"time": 9058, "text": "And I'm just worried about this America that filled me, a kid that came from, our family came from nothing and from Russia as it was, Soviet Union as it was, to be able to do anything in this new country."}, {"time": 9075, "text": "I'm just worried about it."}, {"time": 9076, "text": "And it feels like a few people can still keep this project going."}, {"time": 9081, "text": "Like people like Elon, people like Joe."}, {"time": 9085, "text": "Is there, do you have a bit of that hope?"}, {"time": 9094, "text": "I'm watching this experiment with social media right now."}, {"time": 9098, "text": "And I don't even mean social media, really expand that out to, I mean, I feel like we're all guinea pigs right now, watching, you know, I have two kids and just watching, and there's a three year space between the two of them, one's 18, the other's 15."}, {"time": 9110, "text": "And just, you know, when I was a kid, a person who was 18 and 15 would not be that different, just three years difference, more maturity."}, {"time": 9118, "text": "But their life experiences, you would easily classify those two people as being in the same generation."}, {"time": 9147, "text": "Now, as that relates to your question, the most upsetting part about all that is reading how people treat each other online."}, {"time": 9156, "text": "And you know, there's lots of theories about this, the fact that some of it is just for trolling laughs, that some of it is just people are not interacting face to face, so they feel free to treat each other that way."}, {"time": 9166, "text": "And I, of course, I'm trying to figure out how, if this is how we have always been as people, right?"}, {"time": 9175, "text": "We've always been this way, but we've never had the means to post our feelings publicly about it, or if the environment and the social media and everything else has provided a change and changed us into something else."}, {"time": 9189, "text": "Either way, when one reads how we treat one another and the horrible things we say about one another online, which seems like it shouldn't be that big of deal, they're just words, but they have a cumulative effect."}, {"time": 9203, "text": "I mean, when you, I was reading Meghan Markle, who I don't know a lot about, because it's too much of the pop side of culture for me to pay lip, but I read a story the other day where she was talking about the abuse she took online and how incredibly overwhelming it was and how many people were doing it."}, {"time": 9220, "text": "And you think to yourself, okay, this is something that people who are in positions of what you were discussing earlier never had to deal with."}, {"time": 9228, "text": "Let me ask you something, and boy, this is the ultimate doomcaster thing of all time to say."}, {"time": 9233, "text": "When you think of historical figures that push things like love and peace and creating bridges between enemies, when you think of what happened to those people, first of all, they're very dangerous."}, {"time": 9250, "text": "Every society in the world has a better time, easier time dealing with violence and things like that than they do nonviolence."}, {"time": 9256, "text": "Nonviolence is really difficult for governments to deal with, for example."}, {"time": 9260, "text": "What happens to Gandhi and Jesus and Martin Luther King?"}, {"time": 9265, "text": "And you think about all those people, right?"}, {"time": 9267, "text": "When they're that, it's ironic, isn't it, that these people who push for peaceful solutions are so often killed, but it's because they're effective."}, {"time": 9276, "text": "And when they're killed, the effectiveness is diminished."}, {"time": 9280, "text": "Why are they killed?"}, {"time": 9281, "text": "Because they're effective, and the only way to stop them is to eliminate them, because they're charismatic leaders who don't come around every day, and if you eliminate them from the scene, the odds are you're not gonna get another one for a while."}, {"time": 9294, "text": "I guess what I'm saying is the very things you're talking about, which would have the effect you think it would, right?"}, {"time": 9298, "text": "They would destabilize systems in a way that most of us would consider positive, but those systems have a way of protecting themselves, right?"}, {"time": 9307, "text": "And so I feel like history shows, see, history's pretty pessimistic, I think, by and large."}, {"time": 9314, "text": "If only because we can find so many examples that just sound pessimistic."}, {"time": 9317, "text": "But I feel like people who are dangerous to the way things are tend to be removed."}, {"time": 9324, "text": "Yes, but there's two things to say."}, {"time": 9326, "text": "I feel like you're right, that history, I feel like the ripples that love leaves in history are less obvious to detect, but are actually more transformational."}, {"time": 9339, "text": "Like in this."}, {"time": 9339, "text": "Well, one could make a case about, I mean, if you wanna talk about the long term value of a Jesus, a Gandhi, but yeah, yes, those people's ripples are still affecting people today."}, {"time": 9349, "text": "And that's, you feel those ripples through the general improvement of the quality of life that we see throughout the generations."}, {"time": 9356, "text": "Like you feel the ripples through the growth."}, {"time": 9358, "text": "Yeah, okay, I'll go along with you on that, okay."}, {"time": 9359, "text": "But I would, even if that's not true, I tend to believe that, and by the way, the company that I'm working on as a competitor is exactly attacking this, which is a competitor to Twitter."}, {"time": 9375, "text": "I think I can build a better Twitter as a first step."}, {"time": 9377, "text": "There's a long story in there."}, {"time": 9378, "text": "I think a three year old child could build a better, and this is not to denigrate you, I'm sure yours would be better than a three year old, but Twitter is so, and listen, Facebook too, they're really awful platforms for intellectual discussion and meaningful discussion, and I'm on it."}, {"time": 9393, "text": "So let me just say, I'm part of the problem."}, {"time": 9394, "text": "We're new to this, so it wasn't obvious at the time how to do it, it's now, and now a three year old can do it."}, {"time": 9401, "text": "I tend to believe that we live in a time where the tools that people that are interested in providing love, like the weapons of love are much more powerful."}, {"time": 9414, "text": "So like the one nice thing about technology is it allows anyone to build a company that's more powerful than any government."}, {"time": 9424, "text": "So that could be very destructive, but it could be also very positive."}, {"time": 9429, "text": "And that's, I tend to believe that somebody like Elon that wants to do good for the world, somebody like me and many like me could have more power than any one government."}, {"time": 9440, "text": "And by power, I mean the power to effect change, which is different from Gandhi."}, {"time": 9445, "text": "What do you do with government, and I don't mean to interrupt you, but I'll forget my train of thought, I'm getting old."}, {"time": 9448, "text": "But I mean, how do you deal with the fact that already governments who are afraid of this are walling off their own internet systems as a way to create firewalls simply to prevent you from doing what you're talking about?"}, {"time": 9462, "text": "In other words, there's an old line that if voting really changed anything, they'd never allow it."}, {"time": 9466, "text": "If love through a modern day successor to Twitter would really do what you want it to do, and this would destabilize governments, do you think that governments would take countermeasures to squash that love before it got too dangerous?"}, {"time": 9483, "text": "There's several answers."}, {"time": 9484, "text": "One, first of all, I don't actually, to push back on something you said earlier, I don't think love is as much of an enemy of the state as one would think."}, {"time": 9494, "text": "Different states have different views."}, {"time": 9500, "text": "I think the states want power, and I don't always think that love is in tension with power."}, {"time": 9513, "text": "I think it's not just about love, it's about rationality, it's reason, it's empathy, all of those things."}, {"time": 9519, "text": "I don't necessarily think there always have to be by definition in conflict with each other."}, {"time": 9525, "text": "So that's one sense is I feel like basically you can Trojan horse love into behind, but you have to be good at it."}, {"time": 9536, "text": "This is the thing, is you have to be conscious of the way these states think."}, {"time": 9541, "text": "So the fact that China bans certain services and so on, that means the companies weren't eloquent, whoever the companies are, weren't actually good at infiltrating."}, {"time": 9556, "text": "I think, isn't that a song, like love is a battlefield?"}, {"time": 9559, "text": "I think it's all a cap editor."}, {"time": 9562, "text": "It's all a game, and you have to be good at the game."}, {"time": 9565, "text": "And just like Elon, we said with Tesla and saving the environment."}, {"time": 9572, "text": "I mean, that's not just by getting on a stage and saying it's important to save the environment, is by building a product that people can't help but love and then convincing Hollywood stars to love it."}, {"time": 9586, "text": "Like there's a game to be played."}, {"time": 9588, "text": "Okay, so let me build on that because I think there's a way to see this."}, {"time": 9593, "text": "And so it has to do with a story about the 1960s."}, {"time": 9597, "text": "In the vast scheme of things, the 1960s looks like a revival of neo romantic ideas, right?"}, {"time": 9603, "text": "I had a buddy of mine several years, well, two decades older than I was who was in the 60s, went to the protest, did all those kinds of things."}, {"time": 9611, "text": "And we were talking about it and I was romanticizing it."}, {"time": 9614, "text": "He said, don't romanticize it."}, {"time": 9615, "text": "He goes, let me tell you, most of the people that went to those protests and did all those things, all they were there was to meet girls and have a good time."}, {"time": 9621, "text": "And it wasn't so, but it became in vogue to have all, in other words, let's talk about your empathy and love."}, {"time": 9632, "text": "You're never gonna, in my opinion, grab that great mass of people that are only in it for their interest in whatever."}, {"time": 9638, "text": "But if meeting girls for a young teenage guy requires you to feign empathy, requires you to read deeper subjects because that's what people are into, you can almost, as a silly way to be trendy, you could make maybe empathy trendy, love trendy, solutions that are the opposite of that, the kind of things that people inherently will not put up with."}, {"time": 9667, "text": "In other words, the possibility exists to change the zeitgeist and reorient it in a way that even if most of the people aren't serious about it, the results are the same."}, {"time": 9681, "text": "Okay, so we've found a meeting of the moments."}, {"time": 9684, "text": "Creating incentives that encourage the best and the most beautiful aspects of human nature."}, {"time": 9692, "text": "Even against our will."}, {"time": 9693, "text": "It all boils down to meeting girls and boys."}, {"time": 9697, "text": "Once again, you're getting to the bottom of the evolutionary motivations and you're always on safe ground when you do that."}, {"time": 9703, "text": "That's a little difficult for me."}, {"time": 9706, "text": "And I'm sure it's actually difficult for you to listen to me say complimenting you, but it's difficult for both of us, okay?"}, {"time": 9717, "text": "So, but you and I, as I mentioned to you, I think off mic, been friends for a long time."}, {"time": 9723, "text": "It's just been one way."}, {"time": 9725, "text": "It's two way now."}, {"time": 9728, "text": "So that's the beauty of podcasting."}, {"time": 9730, "text": "Now, just been fortunate enough with this particular podcast that I see it in people's eyes when they meet me, that they've been friends with me for a few years now."}, {"time": 9740, "text": "And we become fast friends actually after we start talking."}, {"time": 9745, "text": "But it's one way in the vet in that first moment."}, {"time": 9750, "text": "You know, like there's something about the especially hardcore history that, you know, I do some crazy challenges and running and stuff."}, {"time": 9757, "text": "I remember in particular, probably don't have time."}, {"time": 9760, "text": "One of my favorite episodes, the painful tainment one."}, {"time": 9764, "text": "Some people hate that episode."}, {"time": 9766, "text": "Because it's too real."}, {"time": 9767, "text": "Yeah, they can't listen to it."}, {"time": 9769, "text": "It's my darkest one."}, {"time": 9770, "text": "We wanted to set a baseline."}, {"time": 9771, "text": "That's the baseline."}, {"time": 9773, "text": "But I remember listening to that when I ran 22 miles for me, that was a long distance."}, {"time": 9778, "text": "Holy cow, that's painful tainment right there."}, {"time": 9780, "text": "Yeah, and it just pulls you in."}, {"time": 9783, "text": "There's something so powerful about this particular creation that's bigger than you actually, that you've created."}, {"time": 9793, "text": "I think anything that is successful like that, like Elon's stuff too, it becomes bigger than you."}, {"time": 9797, "text": "And that's what you're hoping for, right?"}, {"time": 9799, "text": "Didn't mean to interrupt you, I apologize."}, {"time": 9800, "text": "I guess a question I have, if you look in the mirror, but you also look at me, what advice would you give to yourself and to me and to other podcasters, maybe to Joe Rogan, about this journey that we're on?"}, {"time": 9820, "text": "I feel like it's something special."}, {"time": 9821, "text": "I'm not sure exactly what's happening."}, {"time": 9824, "text": "But it feels like podcasting is special."}, {"time": 9828, "text": "What advice, and I'm relatively new to it, what advice do you have for people that are carrying this flame and traveling this journey?"}, {"time": 9839, "text": "Well, I'm often asked for advice by new podcasters, people just starting out."}, {"time": 9844, "text": "And so I have sort of a tried and true list of do's and don'ts."}, {"time": 9851, "text": "But I don't have advice or suggestions for you or for Joe."}, {"time": 9858, "text": "Joe doesn't need anything from me."}, {"time": 9859, "text": "Joe's figured it out, right?"}, {"time": 9861, "text": "I mean, he hasn't yet."}, {"time": 9862, "text": "He's still a confused kid, curious about the world."}, {"time": 9865, "text": "But that's the genius of it."}, {"time": 9866, "text": "That's what makes it work, right?"}, {"time": 9868, "text": "That's what Joe's brand is, right?"}, {"time": 9871, "text": "I guess what I'm saying is, by the time you reach the stage that you're at, or Joe's at, they don't need it."}, {"time": 9878, "text": "They have figured this out."}, {"time": 9879, "text": "The people that sometimes need help are brand new people trying to figure out what do I do with my first show and how do I talk into them?"}, {"time": 9884, "text": "And I have standard answers for that."}, {"time": 9887, "text": "But you found your niche."}, {"time": 9888, "text": "I mean, you don't need me to tell you what to do."}, {"time": 9891, "text": "As a matter of fact, I might ask you questions about how you do what you do, right?"}, {"time": 9895, "text": "Well, I guess there's specific things like we were talking offline about monetization."}, {"time": 9901, "text": "That's a fascinating one."}, {"time": 9903, "text": "Very difficult as an independent, yeah."}, {"time": 9905, "text": "And one of the things that Joe is facing with, I don't know if you're paying attention, but he joined Spotify with a $100 million deal for going exclusive on their platform."}, {"time": 9918, "text": "The idea of exclusivity that, one, I don't give a damn about money personally, but I'm single, and I like living in a shitty place."}, {"time": 9926, "text": "So I enjoy, so I guess it makes it easy."}, {"time": 9930, "text": "You get the freedom, right, to not care, yeah."}, {"time": 9932, "text": "Freedom."}, {"time": 9934, "text": "Not saving for anybody's college."}, {"time": 9937, "text": "Okay, so on that point, but I also, okay, maybe it's romanticization, but I feel like podcasting is pirate radio."}, {"time": 9946, "text": "And when I first heard about Spotify partnering up with Joe, I was like, you know, fuck the man."}, {"time": 9953, "text": "I said, I even, I drafted a few tweets and so on, just like attacking Spotify, then I calmed myself down that you can't lock up this special thing we have."}, {"time": 9964, "text": "But then I realized that maybe that these are vehicles for just reaching more people and actually respecting podcasters more and so on."}, {"time": 9975, "text": "So that's what I mean by it's unclear what the journey is because you also serve as beacon for, now there's like millions, one million plus podcasters."}, {"time": 9989, "text": "I wonder what the journey is."}, {"time": 9991, "text": "Do you have a sense, are you romantic in the same kind of way in feeling that, because you have a roots in radio too."}, {"time": 10001, "text": "Do you feel that podcasting is pirate radio or is the Spotify thing one possible avenue?"}, {"time": 10008, "text": "Are you nervous about Joe as a fan, as a friend of Joe or is this a good thing for us?"}, {"time": 10015, "text": "So my history of how I got involved in podcasting is interesting."}, {"time": 10021, "text": "I was in radio and then I started a company back in the era where the dot com boom was happening and everybody was being bought up and it just seemed like a great idea, right?"}, {"time": 10032, "text": "I did it with six other people and the whole goal of the company was, we had to invent the term."}, {"time": 10039, "text": "I'm sure everybody, there's other places that invented it at the same time."}, {"time": 10042, "text": "But what we were pitching to investors was something called amateur content."}, {"time": 10046, "text": "So this is before YouTube, before podcasting, before all this stuff."}, {"time": 10050, "text": "And my job was to be the evangelist."}, {"time": 10054, "text": "And I would go to these people and talk and sing the praises of all the ways that amateur content was gonna be great."}, {"time": 10062, "text": "And I never got a bite."}, {"time": 10065, "text": "And they all told me the same thing."}, {"time": 10066, "text": "This isn't gonna take off cause anybody who's good is already gonna be making money at this."}, {"time": 10071, "text": "And I kept saying, forget that."}, {"time": 10073, "text": "We're talking about scale here."}, {"time": 10075, "text": "If you have millions of pieces of content being made every week, a small percentage is gonna be good no matter what, right?"}, {"time": 10081, "text": "16 year olds will know what other 16 year olds like."}, {"time": 10083, "text": "I kept pushing this nobody bit."}, {"time": 10086, "text": "But the podcast grew out of that because if you're talking about amateur content in 1999, well then you're already, you're ahead of the game in terms of not seeing where it's gonna go financially but seeing where it's going to go technologically."}, {"time": 10103, "text": "And so when we started the podcast in 2005 and it was the political one, not hardcore history, which was an outgrowth of the old radio show, we didn't have any financial ideas."}, {"time": 10114, "text": "We were simply trying to get our handle on the technology and how you distribute it to people and all that."}, {"time": 10118, "text": "And it was years later that we tried to figure out, okay, how can we get enough money to just support us while we're doing this?"}, {"time": 10125, "text": "And the cheap and the easy way was just to ask listeners to donate like a PBS kind of model."}, {"time": 10129, "text": "And that was the original model."}, {"time": 10132, "text": "So then once we started down that, we figured out other models and there's the advertising thing and that we sell the old shows."}, {"time": 10138, "text": "And so all these became ways for us to support ourselves."}, {"time": 10143, "text": "But as podcasting matured and as more operating systems developed and phones were developed and all these kinds of things, every one of those developments, which actually made it easier for people to get the podcast actually made it more complex to make money off of them."}, {"time": 10162, "text": "So while our audience was building, the amount of time and effort we had to put into the monetization side began to skyrocket."}, {"time": 10169, "text": "So to get back to your Spotify question, to use just one example, there's a lot of people who are doing similar things."}, {"time": 10176, "text": "In this day and age, we used to just sell MP3 files."}, {"time": 10179, "text": "And all you had to have was an MP3 player, it's cheap and dirty."}, {"time": 10182, "text": "Now, every time there's an OS upgrade, something breaks for us."}, {"time": 10186, "text": "So we're having, I mean, my choices are at this point to start hiring staff, more staff, and then be a human resources manager."}, {"time": 10194, "text": "I mean, the pirate radio side of this was the pirate radio side of this because you didn't need anybody, but you know, you or you and another, I mean, you could just do this lean and mean, and it's becoming hard to do it lean and mean now."}, {"time": 10205, "text": "So if somebody like a Spotify comes in and says, hey, we'll handle that stuff for you."}, {"time": 10210, "text": "In the past, I would just say, F off, we don't need you, I don't mind."}, {"time": 10215, "text": "And I definitely am not making what we could make on this, but what we would have to do to make that is onerous to me."}, {"time": 10222, "text": "But it's becoming onerous to me day to day anyway."}, {"time": 10225, "text": "And so if somebody were to come in and say, hey, we'll pick that up for you, we will not interfere with your content at all, we won't, and in my case, you can't say, we need to show a month because that ain't happening, right?"}, {"time": 10236, "text": "So I mean, everybody's design is different, right?"}, {"time": 10240, "text": "So it doesn't, you know, there's not one size fits all, but I guess as a long time pirate podcaster, we've been looking to partner with people, but nobody's right for us to partner with."}, {"time": 10251, "text": "I mean, so I'm always looking for ways to take that side of it off my plate because I'm not interested in that side."}, {"time": 10259, "text": "All I wanna do is the shows, and it's really at this point, you shouldn't call yourself an artist because that's something to be decided by others."}, {"time": 10268, "text": "But I mean, we're trying to do art and there's something very satisfying in that."}, {"time": 10275, "text": "But the part that I can't stand is the increasing amount of time the monetization question takes upon us."}, {"time": 10282, "text": "So there's a case to be made, I guess is what I'm saying, that if a partnership with some outside firm enhances your ability to do the art without disenhancing your ability to do the art, it's, the word I'm looking for here is it's enticing."}, {"time": 10302, "text": "I don't like big companies."}, {"time": 10304, "text": "So I'm afraid of whatever strings might come with that."}, {"time": 10309, "text": "And if I'm Joe Rogan and I'm talking about subjects that can make public companies a little nervous, I would certainly be careful."}, {"time": 10317, "text": "But at the same time, people who are not in this game don't understand the problems that literally, I mean, just all the operating systems, all the podcatchers, every time some new podcatcher comes up, makes it easier to get the podcast, that's something we have to account for on the back end."}, {"time": 10334, "text": "And I'm not exactly the technological wizard of all time."}, {"time": 10337, "text": "So I think it is maybe, maybe the short answer is, is that as the medium develops, it's becoming something that you have to consider, not because you wanna sell out, but because you wanna keep going."}, {"time": 10350, "text": "And it's becoming harder and harder to be pirate like in this environment."}, {"time": 10355, "text": "The thing that convinced me, especially inside Spotify, is that they understand, so if you walk into this whole thing with some skepticism, as you're saying, of big companies, then it works because Spotify understands the magic that makes podcasting, or they appear to in part, at least they understand enough to respect Joe Rogan."}, {"time": 10380, "text": "And despite what, I don't know if you, so there's the internet and there's people with opinions on the internet."}, {"time": 10386, "text": "I've not heard about that."}, {"time": 10387, "text": "And they have opinions about Joe and Spotify."}, {"time": 10391, "text": "But the reality is, there's two things in private conversation with Joe, and in general, there's two important things."}, {"time": 10399, "text": "One, Spotify literally doesn't tell Joe anything."}, {"time": 10402, "text": "Like all the people that think that Spotify is somehow pushing Joe in this direction."}, {"time": 10408, "text": "It's a contractual, didn't he insist upon that?"}, {"time": 10410, "text": "It's in the contract."}, {"time": 10411, "text": "But also, companies have a way of, even with the contract."}, {"time": 10414, "text": "They sure do."}, {"time": 10416, "text": "To be marketing people, hey, I know we're not forcing you."}, {"time": 10419, "text": "I hate that."}, {"time": 10421, "text": "Yeah, I'm with you."}, {"time": 10422, "text": "You and Joe are the same, and Spotify is smart enough not to send a single email of that kind."}, {"time": 10428, "text": "That's really smart."}, {"time": 10429, "text": "And they leave them be."}, {"time": 10431, "text": "There is meetings inside Spotify that people complain, but those meetings never reach Joe."}, {"time": 10438, "text": "That's like company stuff."}, {"time": 10440, "text": "And the idea that Spotify is different than pirate radio, the difficult thing about podcasting is nobody gives a damn about your podcast."}, {"time": 10450, "text": "You're alone in this."}, {"time": 10451, "text": "I mean, there's fans and stuff, but nobody."}, {"time": 10454, "text": "Nobody's looking out for you."}, {"time": 10455, "text": "And the nice thing about Spotify is they want Joe's podcast to succeed even more."}, {"time": 10461, "text": "That's what Joe talked about is that's the difference between YouTube and Spotify."}, {"time": 10467, "text": "Spotify wants to be the Netflix of podcasting."}, {"time": 10470, "text": "And they, like what Netflix does is they don't want to control you in any way, but they want to create a platform where you can flourish."}, {"time": 10481, "text": "Because your interests are aligned."}, {"time": 10482, "text": "Interests are aligned."}, {"time": 10483, "text": "So let me bring up something that, let's make a distinction because not all companies who do this are the same."}, {"time": 10490, "text": "And you brought up YouTube and Spotify, but to me, YouTube is at least more like Spotify than some of these smaller."}, {"time": 10496, "text": "The term is walled garden, right?"}, {"time": 10498, "text": "You've heard the term walled garden?"}, {"time": 10500, "text": "So I've been around podcasting so long now that I've seen rounds of consolidation over the years and they come in waves and all of a sudden, so you'll get, and I'm not going to mention any names, but up until recently, the consolidation was happening with relatively small firms compared to people like Spotify."}, {"time": 10518, "text": "And the problem was, is that by deciding to consolidate your materials in a walled garden, you are walling yourself off from audience, right?"}, {"time": 10528, "text": "So your choice is I'm going to accept this amount of money from this company, but the loss is going to be a large chunk of my audience."}, {"time": 10533, "text": "And that's a catch 22 because you're negotiating power with that company is based on your audience size."}, {"time": 10539, "text": "So signing up with them diminishes your audience size, you lose negotiating power."}, {"time": 10543, "text": "But when you get to the level of the Spotify to just pick them out, there's other players, but you brought up Spotify specifically, these are people who can potentially, potentially enhance your audience over time."}, {"time": 10587, "text": "So it takes away some of the downside risk, which alleviates, and if you can write an agreement like Joe Rogan, I mean, where you've protected your freedom to put the content out the way you want."}, {"time": 10599, "text": "So, and if some of the downside risk is mitigated, and if you eliminate the problem of trying to monetize and stay up with the latest tech, then it might be worth it."}, {"time": 10609, "text": "You know, I'm scared of things like that, but at the same time, I'm trying to not be an idiot about it, and I can be an idiot about it."}, {"time": 10616, "text": "And when you've been doing it as independently for as long as I have, the inertia of that has a force all its own, but I'm inhibited enough in what I'm trying to do on this other end, that it's opened me at least to listening to people."}, {"time": 10634, "text": "But listen, at the same time, I love my audience, and it sounds like a cliche, but they're literally the reason I'm here."}, {"time": 10643, "text": "So I wanna make sure that whatever I do, if I can, is in keeping with a relationship that I've developed with these people over 15 years."}, {"time": 10654, "text": "But like you said, no matter what you do, you are, because see, here's the thing."}, {"time": 10658, "text": "If you don't sign up with one of those companies to make it easier for them to get your stuff on this hand, they might yell at you for how difficult it is, because the new operating system just updated, and you said, I can't get your stuff."}, {"time": 10669, "text": "So either way, you're opening yourself up to ridicule at this point."}, {"time": 10672, "text": "All of that makes it easier to go, well, if the right deal came along, and they weren't screwing me, and they weren't screwing my audience, and blah, blah, blah."}, {"time": 10680, "text": "I mean, again, in this business, when you're talking about cutting edge technology that is ever changing, and as you said, a million podcasts and growing, I think you have to try to maintain flexibility, and especially if they can mitigate the downside risk, I think you'd be an idiot to not at least try to stay up on the current trends."}, {"time": 10700, "text": "And look, I'm watching Joe."}, {"time": 10702, "text": "I'm going, okay, let's see how it goes for Joe."}, {"time": 10704, "text": "I mean, if he's like, ah, this is terrible, I'm getting out of this, you go, okay, those people are off the list."}, {"time": 10709, "text": "So Joe's put himself out as a guinea pig, and the rest of us guinea pigs appreciate it."}, {"time": 10714, "text": "As a huge, as a fan of your show, and as a fan of Netflix, the people there, I think I can speak for like millions of people in hope that hardcore history comes to Netflix, or if Spotify becomes the Netflix of podcasting, then to Spotify."}, {"time": 10730, "text": "There's something at its best that they bring out the, you said artists, so I can say it, is they bring out the best out of the artists."}, {"time": 10739, "text": "They remove some of the headache, and somehow like they put at their best, Netflix, for example, is able to enforce and find the beauty and the power in the creations that you make even better than you."}, {"time": 10757, "text": "Like they don't interfere with the creations, but they somehow, it's a branding thing probably too."}, {"time": 10764, "text": "Yeah, but interfering would be, that would be a no go for me."}, {"time": 10766, "text": "That's right, absolutely."}, {"time": 10768, "text": "That can't happen."}, {"time": 10768, "text": "But that's why Netflix is masterful."}, {"time": 10771, "text": "They seem to not interfere with the talent, as opposed to, I could throw other people under the bus, like Amazon."}, {"time": 10777, "text": "There's a lot of places under the bus that could be thrown, absolutely."}, {"time": 10779, "text": "So I would love, I know there's probably people screaming yes right now."}, {"time": 10783, "text": "In terms of hardcore history on Netflix, it would be awesome."}, {"time": 10786, "text": "And I don't love asking this question, but it's asked probably the most popular question that's unanswerable."}, {"time": 10797, "text": "So let me try to ask it in a way that you would actually answer it, which is, of course, you said you don't release shows very often."}, {"time": 10805, "text": "And the question is, or the requests and the questions is, well, can you tell Dan to do one on the Civil War?"}, {"time": 10811, "text": "Can you tell Dan to do one on the Napoleon Bonaparte?"}, {"time": 10814, "text": "Can you tell him to do one?"}, {"time": 10816, "text": "Every topic, and you've spoken to this."}, {"time": 10818, "text": "Actually, your answer about the Civil War is quite interesting."}, {"time": 10821, "text": "I didn't know you knew what my answer about the Civil War was."}, {"time": 10824, "text": "As a military historian, you enjoy, in particular, when there is differences in the armies, as opposed to contrasts."}, {"time": 10832, "text": "With the Civil War, which blew my mind when I heard you say there's not an interesting, a deep, intricate contrast between the two opposing sides."}, {"time": 10842, "text": "It's like the Roman Civil Wars, where it's legionary against legionary."}, {"time": 10845, "text": "And you've also said that the shows you work on are ones where you have some roots of fundamental understanding about that period."}, {"time": 10854, "text": "And so, when you work on a show, it's basically pulling at those strings further and refreshing your mind and learning."}, {"time": 10862, "text": "You have definitely done the research."}, {"time": 10864, "text": "Wow, these are words out of my mouth."}, {"time": 10867, "text": "But is there something like shower thoughts on Reddit?"}, {"time": 10872, "text": "Is there some ideas that are lingering in your head about possible future episodes?"}, {"time": 10879, "text": "Is there things that, whether you're not committing to anything, but whether you're gonna do it or not, is there something that makes you think, hmm, that'll be interesting to pull at that thread a little bit?"}, {"time": 10895, "text": "Oh yeah, we have things we keep in our back pocket for later."}, {"time": 10899, "text": "So, Blueprint for Armageddon, the first World War series we did, that was in my back pocket the whole time."}, {"time": 10904, "text": "And when the centennial of the war happened, it just seemed to be the likely time to bring out what was."}, {"time": 10910, "text": "That was a hell of a series."}, {"time": 10911, "text": "That's probably one of my favorite series."}, {"time": 10913, "text": "Take my rear end, man."}, {"time": 10914, "text": "I have to tell you."}, {"time": 10915, "text": "Psychologically, you mean?"}, {"time": 10916, "text": "Well, just, you know, when you get to these, I think, I'm guessing here, I think it's 26 hours, all pieces together."}, {"time": 10922, "text": "Think about, and we don't do scripts."}, {"time": 10925, "text": "It's improvised."}, {"time": 10926, "text": "So, think about what, I had somebody write on Twitter just yesterday saying, he said something like, I'm not seeing the dedication here."}, {"time": 10934, "text": "You're only getting 2.5 shows out a year."}, {"time": 10936, "text": "And I wanted to say, man, you have no idea what, the only people who understand really are other history podcasters."}, {"time": 10944, "text": "And even they don't generally do 26 hours."}, {"time": 10947, "text": "You know, that was a two year endeavor."}, {"time": 10949, "text": "As I said, the first show we ever did was like 15 minutes."}, {"time": 10952, "text": "I could crank out one of those a month."}, {"time": 10953, "text": "But when you're doing, I mean, the last show we did on the fall of the Roman Republic was five and a half hours."}, {"time": 10959, "text": "That's a book, right?"}, {"time": 10961, "text": "And it was part six or something."}, {"time": 10963, "text": "So, I mean, you just do the math."}, {"time": 10965, "text": "And it felt like you were, sorry to interrupt, on World War I, it felt like you were emotionally pulled in to it."}, {"time": 10973, "text": "Like, it felt taxing."}, {"time": 10975, "text": "I was gonna say, that's a good thing though, because that, you know, and I think we said during the show, that was the feeling that the people at the time have."}, {"time": 10981, "text": "And I think at one point we said, if this is starting to seem gruesomely repetitive, now you know how the people at the time felt."}, {"time": 10990, "text": "So in other words, that had sort of inadvertently, because when you improvise a show, some of these things are inadvertent, but it had inadvertently created the right climate for having a sense of empathy with the storyline."}, {"time": 11004, "text": "And to me, those are the serendipitous moments that make this art and not some sort of paint by the numbers kind of endeavor, you know?"}, {"time": 11012, "text": "And that's, to me, that wouldn't have happened had we scripted it out."}, {"time": 11016, "text": "So it's mostly, you just bring the tools of knowledge to the table and then in large part improvise, like the actual wording?"}, {"time": 11025, "text": "I always say we make it like they made things like spinal tap and some of those other things where the material, so I do have notes about things like on page 427 of this book, you have this quote, so that I know, aha, I'm at the point where I can drop that in."}, {"time": 11038, "text": "And sometimes I'll write notes saying, here's where you left off yesterday, so I remember."}, {"time": 11043, "text": "But in the improvisation, you end up throwing a lot out."}, {"time": 11047, "text": "And so like, but it allows us to go off on tangents, like we'll try things."}, {"time": 11051, "text": "Like I'll sit there and go, I wonder what this would sound like."}, {"time": 11054, "text": "And I'll spend two days going down that road and then I'll listen to it and go, it doesn't work."}, {"time": 11058, "text": "But that's, you know, like writers do this all the time."}, {"time": 11060, "text": "It's called killing your babies, right?"}, {"time": 11062, "text": "You got, can't, you know, but people go, so this guy goes, I'm not seeing the dedication."}, {"time": 11066, "text": "He has no idea how many things we're throwing out."}, {"time": 11068, "text": "I did an hour and a half, I had an hour and a half into The Current Show about two months ago."}, {"time": 11074, "text": "And I listened to it and I just went, you know what?"}, {"time": 11077, "text": "Boom, out the window."}, {"time": 11077, "text": "There goes six weeks of work, right?"}, {"time": 11081, "text": "But here's the problem."}, {"time": 11082, "text": "Do you trust your, sorry to interrupt, do you trust your judgment on that?"}, {"time": 11088, "text": "But here's the thing."}, {"time": 11091, "text": "Our show is a little different than other people's."}, {"time": 11094, "text": "Joe Rogan called it evergreen content."}, {"time": 11096, "text": "In other words, my political show is like a car you buy."}, {"time": 11099, "text": "And the minute you drive it off the lot, it loses half its value, right?"}, {"time": 11103, "text": "Cause it's not current anymore."}, {"time": 11104, "text": "These shows are just as good or just as bad five years from now as they are when we, although the standards on the internet changed."}, {"time": 11111, "text": "So when I listen to my old shows, I cringe sometimes cause the standards are so much higher now."}, {"time": 11115, "text": "But when you're creating evergreen content, you have two audiences to worry about."}, {"time": 11120, "text": "You have the audience that's waiting for the next show and they've already heard the other ones and they're impatient and they're telling you on Twitter, where is it?"}, {"time": 11126, "text": "But you have show, the show is also for people five years from now who haven't discovered it yet and who don't care a wit for how long it took cause they're gonna be able to download the whole, and all they care about is quality."}, {"time": 11136, "text": "And so what I always tell new podcasters is, they always say, I read all these things, it's very important you have a release schedule."}, {"time": 11144, "text": "Well, it's not more important than putting out a good piece of work."}, {"time": 11147, "text": "And the audience will forgive me if it takes too long, but it's really good when you get it."}, {"time": 11153, "text": "They will not forgive me if I rush it to get it out on time and it's a piece of crap."}, {"time": 11158, "text": "So for us, and this is why when you brought up a Spotify deal or anything else, they can't interfere with this at all because my job here, as far as I'm concerned is quality and everything else goes by the wayside because the only thing people care about longterm, the only thing that gives you longevity is how good is it?"}, {"time": 11175, "text": "How good is that book?"}, {"time": 11176, "text": "If you read J.R.R."}, {"time": 11176, "text": "Tolkien's work tomorrow, you don't care how long it took him to write it, all you care is how good is it today?"}, {"time": 11182, "text": "And that's what we try to think too."}, {"time": 11184, "text": "And I feel like if it's good, if it's really good, everything else falls into place and takes care of itself."}, {"time": 11190, "text": "And so sometimes to push back, sorry to interrupt."}, {"time": 11193, "text": "I've done it to you a thousand times, so you can get me back, please."}, {"time": 11196, "text": "Sometimes the deadline, some of the greatest movies and books have been, you think about like Dostoevsky, I forget which one, notes from underground or something."}, {"time": 11206, "text": "He needed the money, so he had to write it real quick."}, {"time": 11209, "text": "Sometimes the deadline creates is powerful at taking a creative mind of an artist and just like slapping it around to force some of the good stuff out."}, {"time": 11221, "text": "Now, the problem with history, of course, is there's different definitions of good that like it's not just about which you talk about, which is the storytelling, the richness of the storytelling."}, {"time": 11232, "text": "And I'm sure you're, again, not to compliment you too much, but you're one of the great storytellers of our time that I'm sure if you put in a jail cell and forced like somebody pointed a gun at you, you could tell one hell of a good story, but you still need the facts of history or not necessarily the facts, but like making sure you're painting the right full picture, not perfectly right."}, {"time": 11257, "text": "That's what I meant about the audience doesn't understand what a history podcast, you can't just riff and be wrong."}, {"time": 11261, "text": "So let me both oppose what you just said and back up what you just said."}, {"time": 11267, "text": "So I have a book that I wrote, right?"}, {"time": 11269, "text": "And in a book you have a hard deadline, right?"}, {"time": 11272, "text": "So Harper Collins had a hard deadline on that book."}, {"time": 11274, "text": "So when I released it, I was mad because I would have worked on it a lot longer, which is my style, right?"}, {"time": 11280, "text": "Get it right."}, {"time": 11282, "text": "But we had a chapter in that book entitled pandemic prologue question mark."}, {"time": 11287, "text": "And it was the book about the part about the black death and the 1918 flu and all that kind of stuff."}, {"time": 11293, "text": "And I was just doing an interview with a Spanish journalist this morning who said, did you ever think how lucky you got on that?"}, {"time": 11300, "text": "And first of all, lucky on a pandemic, it strikes you."}, {"time": 11304, "text": "But had I had my druthers, I would have kept that book working in my study for months more and the pandemic would have happened."}, {"time": 11314, "text": "And that would have looked like a chapter I wrote after the fact."}, {"time": 11317, "text": "I would have had to rewrite the whole thing."}, {"time": 11319, "text": "So that argues for what you said."}, {"time": 11322, "text": "At the same time, I would have spent months more working on it because to me, it didn't look the way I wanted it to look yet."}, {"time": 11329, "text": "Can you drop a hint of the things that you're keeping on the shelves?"}, {"time": 11333, "text": "Oh, the Alexander the Great podcast."}, {"time": 11335, "text": "I've talked around, I talked to somebody the other day, he said, do you know that the very first word in your very first podcast, in the title, the very first thing that anybody ever saw with hardcore history is the word Alexander."}, {"time": 11347, "text": "Because the show's entitled Alexander versus Hitler."}, {"time": 11350, "text": "I have talked around the career."}, {"time": 11352, "text": "I've done show after, I talked about his mother in one episode."}, {"time": 11354, "text": "I talked about the funeral games after his death."}, {"time": 11358, "text": "I've talked around this, I've specifically left this giant Alexandrian size hole in the middle, because we're gonna do that show one day and I'm going to lovingly enjoy talking about this crazily interesting figure of Alexander the Great."}, {"time": 11370, "text": "So that's one of the ones that's on the back pocket list."}, {"time": 11373, "text": "And what we try to do is whenever this, we're doing Second World War in Asia and the Pacific now, I'm on part five, whenever the heck we finish this, the tendency is to then pick a very different period because we've had it and the audience has had it."}, {"time": 11389, "text": "So it's time."}, {"time": 11389, "text": "So I will eventually get to the Alexander saga."}, {"time": 11393, "text": "What about just one last kind of little part of this is, what about the other half of that first 10 minute, 15 minute episode?"}, {"time": 11402, "text": "Which is, so you've done quite a bit about the World War."}, {"time": 11405, "text": "You've done quite a bit about Germany."}, {"time": 11407, "text": "Will you ever think about doing Hitler and the Man?"}, {"time": 11412, "text": "It's funny because I talked earlier about how I don't like to go back to the old shows cause our standards have changed so much."}, {"time": 11418, "text": "Well, a long time ago, one of my standards for not getting five hour podcasts done or not getting too deeply into them was to flip around the interesting points."}, {"time": 11429, "text": "We didn't realize we were gonna get an audience that wanted the actual history."}, {"time": 11434, "text": "We thought we could just go with, assume the audience knew the details and just talk about the weird stuff that only makes up one part of the show now."}, {"time": 11441, "text": "So we did a show called Nazi tidbits."}, {"time": 11444, "text": "And it was just little things about, you know, it's totally out of date now."}, {"time": 11447, "text": "Like, you know, you can still buy them, but they're out of date."}, {"time": 11451, "text": "Where we dealt a little with it."}, {"time": 11453, "text": "You know, it would be interesting, but I'll give you another example."}, {"time": 11456, "text": "I mean, history is not stagnant, as you know."}, {"time": 11459, "text": "And we had talked about Stalin earlier and Ghost of the Ostfront was done years ago."}, {"time": 11464, "text": "And people will write me from Russia now and say, well, your portrayal of Stalin is totally out of, out of, it's outdated because there's all this new stuff from the former Soviet Union."}, {"time": 11475, "text": "And you do, you turn around and you go, okay, they're right."}, {"time": 11478, "text": "And so when you talk about Hitler, it's very interesting to think about how I would do a Hitler show today versus how I did one 10 years ago."}, {"time": 11487, "text": "And you would think, well, what's new?"}, {"time": 11488, "text": "I mean, it happens a lot, but there's lots of new stuff and there's lots of new scholarship."}, {"time": 11491, "text": "And so, yeah, I would think that would be an interesting one to do someday."}, {"time": 11496, "text": "I haven't thought about that."}, {"time": 11497, "text": "That's not in the back pocket, but yeah, that'd be interesting."}, {"time": 11500, "text": "I have a disproportionate amount of power because I trapped you somehow in a room and, and thereby."}, {"time": 11507, "text": "During a pandemic."}, {"time": 11509, "text": "So like my hope will be stuck in your head, but after Alexander the Great, which would be an amazing podcast, I hope you do give a return to Hitler, The Rise and Fall of the Third Reich, which to me, It's a contemporary book, basically."}, {"time": 11527, "text": "And I, exactly."}, {"time": 11528, "text": "It's by a person who was there."}, {"time": 11530, "text": "Shira, yeah."}, {"time": 11531, "text": "I really loved that study of the man of Hitler."}, {"time": 11536, "text": "And I would love to hear your study of certain aspects of it."}, {"time": 11541, "text": "Perhaps even an episode that's like more focused on a very particular period."}, {"time": 11547, "text": "I just feel like you can tell a story that it's funny."}, {"time": 11550, "text": "Hitler is one of the most studied people."}, {"time": 11552, "text": "And I still feel like all the stories or most of the stories haven't been told."}, {"time": 11558, "text": "Oh, and there's, listen, I've got three books at home."}, {"time": 11560, "text": "I'm on all the publishers lists now."}, {"time": 11562, "text": "And they just, there's young Hitler, there's this Hitler, there's that."}, {"time": 11565, "text": "I mean, I've been reading these books and I've read about Hitler."}, {"time": 11567, "text": "I read The Rise and Fall of the Third Reich."}, {"time": 11568, "text": "My mother thought I needed to go to a psychologist because I read it when I was six."}, {"time": 11573, "text": "And she said, there's something wrong with the boy."}, {"time": 11575, "text": "And, but, but she was right."}, {"time": 11578, "text": "She was absolutely right."}, {"time": 11579, "text": "But, but you would think that, that something like that is pretty established fact."}, {"time": 11584, "text": "And yet there's new stuff coming out all the time."}, {"time": 11586, "text": "And needless to say, Germany's been investigating this guy forever."}, {"time": 11590, "text": "And sometimes it takes years to get the translations."}, {"time": 11593, "text": "I took five years of German in school."}, {"time": 11595, "text": "I can't read any of it."}, {"time": 11596, "text": "So, I mean, and he is, when you talk about fascinating figures, he's so, the whole thing is so twistedly weird."}, {"time": 11606, "text": "There was a, it came out a couple of years ago."}, {"time": 11608, "text": "Somebody found a tape of him talking to, I want to say it was General, the Finnish General Mannerheim, right?"}, {"time": 11616, "text": "And he's just in a very normal conversation of the sort we're having now."}, {"time": 11621, "text": "And, you know, the Hitler tapes, when you hear him normally he's ranting and raving."}, {"time": 11624, "text": "But this was a very sedate."}, {"time": 11626, "text": "And I wish I'd understood the German well enough to really get a feel, because I was reading what Germans said."}, {"time": 11631, "text": "And they say, wow, you can really hear the Southern accent."}, {"time": 11635, "text": "You know, little things that only a native speaker would hear."}, {"time": 11638, "text": "And I remember thinking, this is such a different side of this twisted character."}, {"time": 11642, "text": "And you would think you would always, you would think that this was information that was out in the rise and fall of the Third Reich, but it wasn't."}, {"time": 11649, "text": "And so this goes along with that stuff about new stuff coming out all the time."}, {"time": 11654, "text": "Alexander, new stuff coming out all the time."}, {"time": 11657, "text": "Well, at least interpretations rather than factual data."}, {"time": 11660, "text": "And those color your, those give depth to your understanding."}, {"time": 11663, "text": "Yes, and you want that because of the historiography."}, {"time": 11666, "text": "People love that."}, {"time": 11667, "text": "And that was a byproduct of my lack of credentials, where we thought we're gonna bring in the historians, and we call them audio footnotes, right away for me to say, listen, I'm not a historian, but I'll quote this guy who is so you can trust him."}, {"time": 11681, "text": "But then we would quote other people who had different views."}, {"time": 11684, "text": "And people didn't realize that, you know, if they're not history majors, that historians don't always agree on this stuff and that they have disagreements and they love that."}, {"time": 11692, "text": "So I love the fact that there's more stuff out there because it allows us to then bring in other points of view and sort of maybe three dimensionalize or flesh out the story a little bit more."}, {"time": 11704, "text": "Two last questions."}, {"time": 11705, "text": "One really simple, one absurdly ridiculous, and perhaps also simple."}, {"time": 11710, "text": "First, who has been and is he real?"}, {"time": 11714, "text": "I don't even know what you're talking about."}, {"time": 11717, "text": "Very well."}, {"time": 11718, "text": "How's that for an answer?"}, {"time": 11720, "text": "It's like asking me, is Harvey the White Rabbit real?"}, {"time": 11723, "text": "There's carrots all around the production room, but I don't know what that means."}, {"time": 11727, "text": "Well, a lot of people demanded that I prove, I somehow figure out a way to prove the existence."}, {"time": 11732, "text": "If I said he was real, people would say, no, he's not."}, {"time": 11735, "text": "And if I said he was, if he wasn't real, they would say, yes, he is."}, {"time": 11738, "text": "So it's a Santa Claus Easter bunny kind of vibe there."}, {"time": 11743, "text": "I mean, what is real anyway?"}, {"time": 11744, "text": "That's exactly what I told him if he exists."}, {"time": 11749, "text": "The most absurd question, I'm very sorry."}, {"time": 11751, "text": "Very sorry, but then again, I'm not."}, {"time": 11753, "text": "What's the meaning of it all?"}, {"time": 11755, "text": "You study history, human history."}, {"time": 11763, "text": "Have you been able to make sense of why the hell we're here on this spinning rock?"}, {"time": 11768, "text": "Does any of it even make sense?"}, {"time": 11773, "text": "What I look at sometimes that I find interesting is certain consistencies that we have over time."}, {"time": 11780, "text": "History doesn't repeat, but it has a constant, and the constant is us."}, {"time": 11786, "text": "Now we change."}, {"time": 11787, "text": "I mentioned earlier the wickedly weird time we live in with what social media is doing to us as guinea pigs, and that's a new element, but we're still people who are motivated by love, hate, greed, envy, sex."}, {"time": 11801, "text": "I mean, all these things that would have connected us with the ancients, right?"}, {"time": 11805, "text": "That's the part that always makes history sound like it rhymes, you know?"}, {"time": 11810, "text": "And when you put the constant, the human element, and you mix it with systems that are similar, so one of the reasons that the ancient Roman Republic is something that people point to all the time as something that seems like we're repeating history is because you have humans, just like you had then, and you have a system that resembles the one we have here."}, {"time": 11832, "text": "So you throw the constant in with a system that is somewhat similar, and you begin to see things that look like they rhyme a little."}, {"time": 11839, "text": "So for me, I'm always trying to figure out more about us, and when you show us in 500 years ago in Asia, and 800 years ago in Africa, and you look at all these different places that you put the guinea pig in, and you watch how the guinea pig responds to the different stimuli and challenges, I feel like it helps me flesh out a little bit more who we are in the long timeline."}, {"time": 11867, "text": "Not who we are today, specifically, but who we've always been."}]}]