[{"title": "Steve Viscelli: Trucking and the Decline of the American Dream | Lex Fridman Podcast #237", "id": "a3Wpy6gE4So", "quotes": [{"time": 319, "text": "I think you're a great listener."}, {"time": 323, "text": "I've been listening to the podcast."}, {"time": 328, "text": "You've done a large number of interviews, like you said, of truckers for this book."}, {"time": 333, "text": "I'm just curious, what are some lessons you've learned about what it takes to listen to a person enough, maybe guide the conversation enough to get to the core of the person, the idea, again, the ethnographer goal to get to the core?"}, {"time": 354, "text": "Yeah, I think it doesn't happen in the moment, right?"}, {"time": 358, "text": "So I'm a ruminator."}, {"time": 361, "text": "I just sit with the data for years."}, {"time": 365, "text": "I sat with the trucking data for almost 10 full years and just thought about the problems and the questions using everything that I possibly could."}, {"time": 376, "text": "And so in the moment, my ideal interview is I open up and I say, tell me about your life as a trucker."}, {"time": 384, "text": "And they never shut up."}, {"time": 386, "text": "And they keep telling me the things that I'm interested in."}, {"time": 389, "text": "Now, it never works out that way because they don't know what you're interested in, right?"}, {"time": 394, "text": "And so a lot of it is the, as you know, I think you're a great interviewer, prep, right?"}, {"time": 401, "text": "So you try to get to know a little bit about the person and sort of understand kind of the central questions you're interested in that they can help you explore."}, {"time": 412, "text": "And so I've done hundreds of interviews with truck drivers at this point and I should really go back and read the original ones."}, {"time": 421, "text": "They were probably terrible."}, {"time": 422, "text": "What's the process like?"}, {"time": 423, "text": "You're sitting down, do you have an audio recorder and also taking notes or do you do no audio, just notes or?"}, {"time": 428, "text": "Yeah, audio recorder and social scientists always have to struggle with sampling, right?"}, {"time": 433, "text": "Like who do you interview?"}, {"time": 435, "text": "Where do you find them?"}, {"time": 435, "text": "How do you recruit them?"}, {"time": 437, "text": "I just happened to have a sort of natural place to go that gave me essentially the population that I was interested in."}, {"time": 444, "text": "So all these long haul truck drivers that I was interested in they have to stop and get fuel and get services at truck stops."}, {"time": 451, "text": "So I picked a truck stop at the juncture of a couple of major interstates, went into the lounge that drivers have to walk through with my clipboard and everybody who came through, I said, hey, are you on break?"}, {"time": 466, "text": "And that was sort of the first criteria was, do you have time, right?"}, {"time": 471, "text": "And if they said, yes, I said, I'd say, I'm a graduate student at Indiana University."}, {"time": 477, "text": "I'm doing a study, trying to understand more about truck drivers."}, {"time": 481, "text": "Will you sit down with me?"}, {"time": 482, "text": "And I think the first, I think I probably asked like 104 or 103 people to get the first 100 interviews."}, {"time": 490, "text": "That's pretty good odds."}, {"time": 493, "text": "For any response rate like that for interviewing, these are people who sat down and gave me an hour or sometimes more of their time, just randomly at a truck stop."}, {"time": 503, "text": "And it just tells you something about like, truckers have something to say."}, {"time": 508, "text": "They're alone a lot."}, {"time": 510, "text": "And so I had to figure out how to kind of turn the spigot on, you know?"}, {"time": 515, "text": "And I got pretty good at it, I think, yeah."}, {"time": 518, "text": "So they have good stories to tell and they have an active life in the mind because they spend so much time on the road just basically thinking."}, {"time": 525, "text": "Yeah, there's a lot of reflection, a lot of struggles, you know?"}, {"time": 530, "text": "And they take different forms."}, {"time": 533, "text": "One of the things that they talk about is the impact on their families."}, {"time": 536, "text": "They say truckers have the same rate of divorce as everybody else."}, {"time": 540, "text": "And that's because trucking saves so many marriages because you're not around and ruins so many."}, {"time": 545, "text": "And so it ends up being a wash."}, {"time": 548, "text": "So I had this experience."}, {"time": 552, "text": "I met another person and he recognized me from a podcast."}, {"time": 556, "text": "And he said, you know, I'm a fan of yours and a fan of Joe Rogan, but you guys never talk."}, {"time": 562, "text": "You always talk to people with Nobel Prizes."}, {"time": 564, "text": "You always talk to these kinds of people."}, {"time": 567, "text": "You never talk to us regular folk."}, {"time": 571, "text": "And that guy really stuck with me."}, {"time": 573, "text": "First of all, the idea of regular folk is a silly notion."}, {"time": 576, "text": "I think people that win Nobel Prizes are often more boring than the people, these regular folks in terms of stories, in terms of richness of experience, in terms of the ups and downs of life."}, {"time": 588, "text": "And, you know, that really stuck with me because I set that as a goal for myself to make sure I talked to regular folk."}, {"time": 597, "text": "And you did just this talking, again, regular folk."}, {"time": 603, "text": "It's human beings."}, {"time": 605, "text": "All of them have experiences."}, {"time": 608, "text": "If you were to recommend to talk some of these folks with stories, how would you find them?"}, {"time": 616, "text": "Yeah, so I do do this sometimes for journalists who will come and they want to write about sort of what's happening right now in trucking, you know."}, {"time": 625, "text": "And I send them to truck stops."}, {"time": 626, "text": "I say, you know, yeah, there's a town called Effingham, Illinois."}, {"time": 631, "text": "And it's just this place where, you know, bunch of huge truck stops, tons of trucks and really nothing else out there."}, {"time": 638, "text": "You know, it's in the middle of corn country."}, {"time": 641, "text": "And, you know, again, truckers in this, you know, sadly, I think, you know, the politics of the day, it's changing a little bit."}, {"time": 650, "text": "I think there's a little, the polarization is getting to the trucking industry in ways that, you know, maybe we're seeing in other parts of our social world."}, {"time": 662, "text": "But truckers are generally, you know, real open sort of friendly folks."}, {"time": 667, "text": "Some of them ultimately like to work alone and be alone."}, {"time": 671, "text": "That's a relatively small subset, I think."}, {"time": 675, "text": "But all of them are generally, you know, kind of open, you know, trusting, willing to have a conversation."}, {"time": 681, "text": "And so, you know, you go to the truck stop and you go in the lounge and they're usually, there's usually a booth down there and somebody is sitting at their laptop or on their phone and willing to strike up a conversation."}, {"time": 692, "text": "You should try that."}, {"time": 692, "text": "You should, you know."}, {"time": 693, "text": "That 100% will try this."}, {"time": 696, "text": "Just again, we're just going from tangent to tangent."}, {"time": 698, "text": "We'll return to the main question, but what do they listen to?"}, {"time": 703, "text": "Do they listen to talk radio?"}, {"time": 705, "text": "Do they listen to podcasts, audio books?"}, {"time": 707, "text": "Do they listen to music?"}, {"time": 708, "text": "Do they listen to silence?"}, {"time": 713, "text": "Some, I mean, and some still listen to the CB, which, you know, it's a ever dwindling group."}, {"time": 719, "text": "They'll call it the Original Internet Citizens Band."}, {"time": 722, "text": "You know, back in the 70s, they thought it was going to be the medium of democracy."}, {"time": 727, "text": "And they love to just get on there and, you know, cruise along one truck after the other and chat away."}, {"time": 733, "text": "Usually, you know, it's guys who know each other from the same company or happen to run into each other."}, {"time": 738, "text": "But other than that, it's everything under the sun."}, {"time": 741, "text": "You know, and that's, it's probably one of the stereotypes and it's, I think it was more true in the past, you know, about the sort of heterogeneity of truck drivers."}, {"time": 752, "text": "They're a really diverse group now."}, {"time": 753, "text": "You know, there's definitely a large, still a large component of rural white guys who work in the industry, but there's a huge growing chunk of the industry that's immigrants, people of color, and even some women."}, {"time": 770, "text": "Still huge barriers to women entering it, but it's a much more diverse place than most people think."}, {"time": 777, "text": "So let's return to your journey as a truck driver."}, {"time": 780, "text": "What did it take to become a truck driver?"}, {"time": 783, "text": "What were the early days like?"}, {"time": 785, "text": "Yeah, so this is, I mean, this is a central part of the story, right, that I uncovered."}, {"time": 789, "text": "And the good part was that I went in without knowing what was gonna happen."}, {"time": 794, "text": "So I was able to experience it as a new truck driver would."}, {"time": 799, "text": "It's one of the important stories in the book is how that experience is constructed by employers to sort of, you know, help you think the way that they would like you to think about the job and about the industry and about the social relations of it."}, {"time": 812, "text": "So it's super intimidating."}, {"time": 817, "text": "I say in the book, you know, pretty handy guy, you know, familiar with tools, machines, like, you know, comfortable operating stuff, like from time I was a kid."}, {"time": 826, "text": "The truck was just like a whole nother experience."}, {"time": 830, "text": "I mean, as I think most people think about it, it's this big, huge vehicle, right?"}, {"time": 835, "text": "It's really long, it's 70 feet long, it can weigh 80,000 pounds."}, {"time": 840, "text": "You know, it does not stop like a car."}, {"time": 842, "text": "It does not turn like a car."}, {"time": 845, "text": "But at least when I started, and this has changed and it's part of the technology story of trucking, the first thing you had to do was learn how to shift it."}, {"time": 855, "text": "And it doesn't shift like a manual car."}, {"time": 859, "text": "The clutch isn't synchronized."}, {"time": 861, "text": "So you have to do what's called double clutch."}, {"time": 864, "text": "And it's basically the foundational skill that a truck driver used to have to learn."}, {"time": 869, "text": "So you would, you know, accelerate, say you're in first gear, you push in the clutch, you pull the shifter out of first gear, you let the clutch out, and then you let the RPMs of the engine drop an exact amount."}, {"time": 884, "text": "Then you push the clutch back in and you put it in second gear."}, {"time": 888, "text": "If your timing is off, those gears aren't gonna go together."}, {"time": 892, "text": "So if you're in an intersection, you're just gonna get this horrible grinding sound as you coast, you know, to a dead stop in the, you know, underneath the stoplight or whatever it is."}, {"time": 903, "text": "So the first thing you have to do is learn to shift it."}, {"time": 906, "text": "And so at least for me and a lot of drivers who are going to private company CDL schools, what happens is it's kind of like a bootcamp."}, {"time": 914, "text": "They ship me three states away from home, send you a bus ticket and say, ''Hey, we'll put you up for two weeks.''"}, {"time": 921, "text": "You sit in a classroom, you sort of learn the theory of shifting, the theory of kind of how you fill out your log book, rules of the road, you know, you do that maybe half the day."}, {"time": 932, "text": "And then the other half you're in this giant parking lot with one of these old trucks and just like, you know, destroying what's left of the thing, you know, and it's lurching and belching smoke and just making horrible noises and like rattling."}, {"time": 945, "text": "I mean, in these things, like there's a lot of torque."}, {"time": 948, "text": "And so if you do manage to get it into gear, but the engine's lugging, I mean, it can throw you right out of the seat, right?"}, {"time": 954, "text": "So it's this, it's like, you know, it's bull, you're trying to ride and it's super intimidating."}, {"time": 960, "text": "And the thing about it is that for everybody there, it's almost everybody there, it's super high stakes."}, {"time": 967, "text": "So trucking has become a job of last resort for a lot of people."}, {"time": 972, "text": "And so they, you know, they lose a job in manufacturing, they get too old to do construction any longer, right?"}, {"time": 980, "text": "The knees can no longer handle it."}, {"time": 982, "text": "And they get replaced by a machine, their job gets, you know, offshored and they end up going to trucking because it's a place where they can maintain their income."}, {"time": 991, "text": "And so it's super high stress."}, {"time": 994, "text": "Like they've left their family behind, maybe they quit another job."}, {"time": 998, "text": "They're typically being charged a lot of money."}, {"time": 1000, "text": "So that first couple of weeks, like you might get charged $8,000 by the company that you have to pay back if you don't get hired."}, {"time": 1007, "text": "And so the stakes are high and this machine is huge and it's intimidating."}, {"time": 1012, "text": "And so it's super stressful."}, {"time": 1013, "text": "I mean, I watched, you know, grown men break down crying about like how they couldn't go home and tell their son that they had been telling they were gonna, you know, go become a long haul truck driver that they'd failed."}, {"time": 1025, "text": "And it's kind of this super high stress system."}, {"time": 1028, "text": "And it's designed that way partly because as one of my trainers later told me, it's basically a two week job interview."}, {"time": 1034, "text": "Like they're testing you, they're seeing like, you know, how's this person gonna respond when it's tough, you know, when they have to do the right thing and it's slow and, you know, they need to learn something, are they gonna rush, you know, or are they gonna kind of stay calm, figure it out, you know, nose to the grindstone."}, {"time": 1051, "text": "Cause when you're a new truck driver, you're unsupervised, you know, and that's what they're really looking for is that kind of quality of conscientious work that's gonna carry through to the job."}, {"time": 1061, "text": "Well, so the truck is such an imposing part of a traffic scenario."}, {"time": 1065, "text": "So you said like turning, it stresses me out every time I look at a truck cause they, I mean, the geometry of the problem is so tricky."}, {"time": 1073, "text": "And so if you combine the fact that they have to, like everybody, basically all the cars in the scene are staring at the truck and they're waiting, often in frustration."}, {"time": 1082, "text": "And in that mode, you have to then shift gears perfectly and move perfectly."}, {"time": 1088, "text": "And if, when you're new, especially, like you'll probably, for somebody like me, it feels like it would take years to become calm and comfortable in that situation as opposed to be exceptionally stressed under the eyes of the road, everybody looking at you, waiting for you."}, {"time": 1104, "text": "Is that the psychological pressure of that?"}, {"time": 1107, "text": "Is that something that was really difficult?"}, {"time": 1110, "text": "Again, just, I saw people freeze up, you know, in that intersection as, you know, horns are blaring and the truck's grinding, you know, gears and you just can't, you know, and they just shut down."}, {"time": 1120, "text": "They're like, this isn't for me, I can't do it."}, {"time": 1122, "text": "You're right, it takes years."}, {"time": 1153, "text": "And between that and the really skilled drivers who've been doing it for 20 years, you know, it's still another step beyond that."}, {"time": 1161, "text": "So it is highly skilled."}, {"time": 1162, "text": "Would it be fair to break trucking into the task of driving a truck into two categories?"}, {"time": 1168, "text": "One is like the local stuff, getting out of the parking lot, getting into, you know, driving down local streets and then highway driving, those two tasks."}, {"time": 1178, "text": "What are the challenges associated with each task?"}, {"time": 1181, "text": "You kind of emphasized the first one."}, {"time": 1183, "text": "What about the actual like long haul highway driving?"}, {"time": 1188, "text": "Yeah, so, I mean, and they are very different, right?"}, {"time": 1191, "text": "And the key with the long haul driving is really a set of, the way I came to understand it was a set of habits, right?"}, {"time": 1203, "text": "We have a sense of driving, particularly men, I think, have a sense of driving as like being really skilled, is like the goal and you can kind of maneuver yourself out of in and out of tight spaces with great speed and breaking and acceleration, you know."}, {"time": 1220, "text": "For a really good truck driver, it's about understanding traffic and traffic patterns and making good decisions so you never have to use those skills."}, {"time": 1230, "text": "And the really good drivers, you know, the mantra is always leave yourself an out, right?"}, {"time": 1237, "text": "So always have that safe place that you can put that truck in case that four wheeler in front of you who's texting loses control."}, {"time": 1246, "text": "You know, what are you gonna do in that situation?"}, {"time": 1250, "text": "And what really good truck drivers do on the highway is they just keep themselves out of those situations entirely."}, {"time": 1259, "text": "They see it, they slow down, you know, they avoid it."}, {"time": 1264, "text": "And then the local driving is really something that takes just practice and routine to learn."}, {"time": 1270, "text": "You know, this quarter turn, it feels like the back of the truck sometimes is on delay when you're backing it up."}, {"time": 1276, "text": "So it's like, all right, I'm gonna do a quarter turn of the wheel now to get the effect that I want like five seconds from now in where that tail of that trailer is gonna be."}, {"time": 1286, "text": "And there's just no, I mean, some people have a natural talent for that, you know, spatial visualization and kind of calculating those angles and everything, but there's really no escaping the fact that you've gotta just do it over and over again before you're gonna learn how to do it well."}, {"time": 1302, "text": "Do you mind sharing how much you were getting paid, how much you were making as a truck driver in your time as a truck driver?"}, {"time": 1310, "text": "Yeah, I started out at 25 cents a mile and then I got bumped up to 26 cents a mile."}, {"time": 1316, "text": "So we had a minimum pay, which was sort of a new pay scheme that the industry had started to introduce to, you know, because there's lots of unpaid work and time."}, {"time": 1330, "text": "And so we had a minimum pay of $500 a week that you would get if you didn't drive enough miles to exceed that."}, {"time": 1337, "text": "You get paid in sort of, so you get paid when you turn the bills in, which is the paperwork that goes with the load."}, {"time": 1344, "text": "So, you know, you have to get that back to your company and then that's how they bill the customer."}, {"time": 1350, "text": "And so you might get a bunch of those bills that kind of bunch up in one week."}, {"time": 1354, "text": "So, you know, I might get a paycheck for, you know, $1,200."}, {"time": 1358, "text": "And I mean, I was a poor graduate student."}, {"time": 1360, "text": "So this was real, real money to me."}, {"time": 1364, "text": "And so I had this sort of natural incentive to, you know, earn a lot or to maximize my pay."}, {"time": 1371, "text": "Some weeks were that minimum, 500, very few."}, {"time": 1374, "text": "And then some I'd get 1200, 1300 bucks."}, {"time": 1378, "text": "Pay has gone up, you know, typical drivers now starting in the 30s, you know, in the kind of job that I was in."}, {"time": 1385, "text": "30 cents per mile, 30 to 35."}, {"time": 1389, "text": "So can we try to reverse engineer that math, how that maps to the actual hours?"}, {"time": 1394, "text": "So the hours connected to driving are so widely dispersed, as you said, some of them don't count as actual work, some of it does."}, {"time": 1402, "text": "That's a very interesting discussion that we'll then continue when we start talking about autonomous trucking."}, {"time": 1408, "text": "But, you know, you're saying all these cents per mile kind of thing."}, {"time": 1411, "text": "What, how does that map to like average hourly wage?"}, {"time": 1418, "text": "Yeah, so, I mean, and this is kind of the, this is also an interesting technology story in the end."}, {"time": 1424, "text": "And it's the technology story that didn't happen."}, {"time": 1426, "text": "So pay per mile was, you know, invented by companies when you couldn't surveil drivers, you didn't know what they were doing, right?"}, {"time": 1433, "text": "And you wanted them to have some skin in the game."}, {"time": 1436, "text": "And so you'd say, you know, here's the load, it's going from, you know, for me, I might start in, you know, the Northeast, maybe in upstate New York with a load of beer, and say, here's this load of beer, bring it to this address in Michigan, we're gonna pay you by the mile, right?"}, {"time": 1451, "text": "If I was being paid by the hour, I might just pull over at the diner and have breakfast."}, {"time": 1456, "text": "So you're paid by the mile, but increasingly over time, the typical driver is spending more and more time doing non driving tasks."}, {"time": 1468, "text": "There's lots of reasons for that."}, {"time": 1470, "text": "One of which is railroads captured a lot of freight that goes long distances now."}, {"time": 1474, "text": "Another one is traffic congestion."}, {"time": 1477, "text": "And the other one is that drivers are pretty cheap."}, {"time": 1479, "text": "And they're almost always the low people on the totem pole in some segments."}, {"time": 1484, "text": "And so their time is used really inefficiently."}, {"time": 1488, "text": "So I might go to that brewery to pick up that load of Bud Light."}, {"time": 1494, "text": "And, you know, their dock staff may be busy loading up five other trucks."}, {"time": 1500, "text": "And they'll say, you know, go over there and sit and wait, and we'll call you on the CB when the dock's ready."}, {"time": 1505, "text": "So you wait there a couple hours, they bring you in, you know, you never know what's happening in the truck."}, {"time": 1510, "text": "Sometimes they're loading it with a forklift, maybe they're throwing 14 pallets on there full of kegs."}, {"time": 1516, "text": "But sometimes it'll take them hours, you know, and you're sitting in that truck."}, {"time": 1519, "text": "And you're essentially unpaid."}, {"time": 1522, "text": "You know, then you pull out, you've got control over what you're gonna get paid based on how you drive that load."}, {"time": 1529, "text": "And then on the other end, you got a similar situation of kind of waiting, so."}, {"time": 1534, "text": "So if that's the way truck drivers are paid, then there's a low incentive for the optimization of the supply chain to make them more efficient, right?"}, {"time": 1543, "text": "To utilize truck labor more efficiently."}, {"time": 1548, "text": "So that's a technology problem that, one of several technology problems that could be addressed."}, {"time": 1557, "text": "I mean, so what did, if we just linger on it, what are we talking about in terms of dollars per hour?"}, {"time": 1566, "text": "Is it close to minimum wage?"}, {"time": 1568, "text": "Is it, you know, there's something you talk about, there was a conception or a misconception that truckers get paid a lot for their work."}, {"time": 1579, "text": "Do they get paid a lot for their work?"}, {"time": 1581, "text": "Some do."}, {"time": 1583, "text": "And I think that's part of the complexity."}, {"time": 1586, "text": "So, you know, what interested me as an ethnographer about this was, you know, I'm interested in the kind of economic conceptions that people have in their heads and how they lead to certain decisions in labor markets."}, {"time": 1598, "text": "You know, why some people become an entrepreneur and other people become a wage laborer, or, you know, why some people wanna be doctors and other people wanna be truck drivers."}, {"time": 1607, "text": "That conception, right, is getting shaped in these labor markets is the argument of the book."}, {"time": 1613, "text": "And the fact that drivers can hear, or potential drivers can hear about these, you know, workers who make $100,000 plus, which happens regularly in the trucking industry."}, {"time": 1624, "text": "There are many truck drivers who make more than $100,000 a year, you know, is an attraction."}, {"time": 1630, "text": "But the industry is highly segmented."}, {"time": 1633, "text": "And so the entry level segment, and we can probably get into this, but, you know, the industry is dominated by a few dozen really large companies that are self insured and can train new drivers."}, {"time": 1648, "text": "So if you want those good jobs, you've gotta have several years, up until recently, now the labor market's becoming tighter, but you had to have several years of accident free, you know, perfectly clean record driving to get into them."}, {"time": 1662, "text": "The other part of the segment, you know, those drivers often don't make minimum wage."}, {"time": 1667, "text": "But this leads to one of the sort of central issues that has been in the courts, and in the legislature, in some states, is, you know, what should truck drivers get paid for?"}, {"time": 1679, "text": "Right, the industry, you know, for the last 30 years or so has said, essentially, it's the hours that they log for safety reasons for the Department of Transportation, right?"}, {"time": 1691, "text": "Now, since the drivers are paid by the mile, they try to minimize those, because those hours are limited by the federal government."}, {"time": 1699, "text": "So the federal government says, you can't drive more than 60 hours in a week as a long haul truck driver."}, {"time": 1704, "text": "And so you wanna drive as many miles as you can in those 60 hours, and so you under report them, right?"}, {"time": 1711, "text": "And so what happens is the companies say, well, that guy, you know, he only said he logged 45 hours of work that week, or 50 hours of work."}, {"time": 1720, "text": "That's all we have to pay him minimum wage for."}, {"time": 1723, "text": "When in fact, typical truck driver in these jobs will work, according to most people, would sort of define it as like, okay, I'm at the customer location, I'm waiting to load, I'm doing some paperwork, you know, inspecting the truck, I'm fueling it, just waiting to, you know, get put in the dock, 80 to 90 hours would be sort of a typical work week for one of these drivers."}, {"time": 1744, "text": "And just when you look at that, they don't make minimum wage oftentimes."}, {"time": 1747, "text": "Right, just to be clear, what we're dancing around here is that a little bit over, a little bit under minimum wage is nevertheless most truck drivers seem to be making close to minimum wage."}, {"time": 1759, "text": "Like this is the, so like we maybe haven't made that clear."}, {"time": 1763, "text": "There's a few that make quite a bit of money, but like you're as an entry and for years, you're operating essentially minimum wage and potentially far less than minimum wage if you actually count the number of hours that are taken out of your life due to your dedication to trucking."}, {"time": 1785, "text": "Well, if you count like the hours taken out of your life, then you gotta go, you know, maybe a full 24."}, {"time": 1792, "text": "That's right, yeah, from family, from the high quality of life parts of your life."}, {"time": 1799, "text": "Yeah, and there's a whole nother set of rules that the Department of Labor has, which basically say that a truck driver who's dispatched away from home for more than a day should get minimum wage 24 hours a day."}, {"time": 1813, "text": "And that could be a state minimum wage, but typically what it would work out to for most drivers is that, you know, the minimum wage for a truck driver should be 50s of thousands, you know, 55, $60,000 should be the minimum wage of a truck driver."}, {"time": 1828, "text": "And you've probably heard about the truck driver shortage."}, {"time": 1831, "text": "If, you know, which I hope we can talk about, if the minimum wage for truck drivers is as it should be on the books at, you know, around $60,000, we wouldn't have a shortage of truck drivers."}, {"time": 1846, "text": "And to me, 60,000 is not a lot of money for this kind of job."}, {"time": 1851, "text": "Cause you're, this isn't, this is essentially two jobs and two jobs where you don't get to sleep with your wife or see your kids at night."}, {"time": 1863, "text": "That's 60,000 is a very little money for that."}, {"time": 1866, "text": "But you're saying if it was 60,000, you wouldn't even have the shortage."}, {"time": 1871, "text": "If that was the minimum."}, {"time": 1873, "text": "And I think that's what, now we have drivers who start in the 30s."}, {"time": 1878, "text": "Wow, but yeah."}, {"time": 1879, "text": "And I mean, so we're talking two, three jobs really, when you look at the total hours that people are working at, you know, they can work over a hundred."}, {"time": 1886, "text": "If they're a trainer, you know, training other truck drivers, well over a hundred hours a week."}, {"time": 1891, "text": "So a job of last resort."}, {"time": 1894, "text": "Maybe you can jump around from tangent to tangent."}, {"time": 1897, "text": "This is such a fascinating and difficult topic."}, {"time": 1901, "text": "I heard that there's a shortage of truck drivers."}, {"time": 1906, "text": "So there's more jobs than truck drivers willing to take on the job."}, {"time": 1909, "text": "Is that the state of affairs currently?"}, {"time": 1913, "text": "I mean, I think the way that you just put that is right."}, {"time": 1917, "text": "We don't have a shortage of people who are currently licensed to do the jobs."}, {"time": 1922, "text": "So I'm working on a project for the state of California to look at the shortage of agricultural drivers."}, {"time": 1927, "text": "And the first thing that the DMV commissioner of the state wanted to look at was, you know, is there actually a shortage of licensed drivers?"}, {"time": 1935, "text": "He's like, I've got a database here of all the people who have a commercial driver's license who could potentially have the credential to do this."}, {"time": 1944, "text": "There are about 145,000 jobs in California that require a class A CDL, which would be that commercial driver's license that you need for the big trucks."}, {"time": 1956, "text": "About 145,000 jobs."}, {"time": 1957, "text": "The industry in their, you know, regular promotion of the idea that there's a shortage is always projecting forward and says, you know, we're gonna need 165,000 or so in the next 10 years."}, {"time": 1970, "text": "They're currently like 435,000 people licensed in the state of California to drive one of these big trucks."}, {"time": 1977, "text": "So it is not at all an absence of people who, I mean, and again, going back to what we were talking about before, getting that license is not something that you just walk down to the DMV and take the test."}, {"time": 1990, "text": "Like this is somebody who probably quit another job, was unemployed, and took months to go to a training school, paid for that training school oftentimes, left their family for months, invested in what they thought was gonna be a long term career, and then said, you know what, forget it, I can't, I can't do it."}, {"time": 2013, "text": "So yeah, so it's not just skill, it's like they were psychologically invested potentially for months, if not years, into this kinds of position as perhaps a position that if they lose their current job, they could fall too."}, {"time": 2026, "text": "Okay, so that's an indication that there's something deeply wrong with the job, if so many licensed people are not willing to take it."}, {"time": 2033, "text": "What are the biggest problems of the job of truck driver currently?"}, {"time": 2039, "text": "Yeah, the job, the problems with the job and the labor market, right?"}, {"time": 2042, "text": "But let's start with the job, which is, you know, again, just so much time that's not compensated directly for the amount of time."}, {"time": 2052, "text": "And that's just psychologically, and this was a big part of what I studied for the first book was, you know, that conception of like, what's my time worth, right?"}, {"time": 2064, "text": "And like, what truck drivers love is oftentimes, is that tangible outcome based compensation."}, {"time": 2072, "text": "So they say, you know what, you know, honest days work, I work hard, I get paid for what I do, I drive 500 miles today, that's what I'm gonna get paid for."}, {"time": 2082, "text": "And then you get to that dock, and they tell you, sorry, the load's not ready, go sit over there, and you stew."}, {"time": 2089, "text": "And that weight can break you psychologically because your time every second becomes more worthless."}, {"time": 2098, "text": "Or worth less."}, {"time": 2100, "text": "Yeah, and again, the industry is gonna say, for instance, okay, well, you know, they've got skin in the game, right?"}, {"time": 2106, "text": "That argument about sort of compensation based on sort of output, right?"}, {"time": 2110, "text": "But that's a holdover from when you couldn't observe truckers."}, {"time": 2113, "text": "Now they all have, you know, satellite linked computers in the trucks that tell these large companies, this driver was, you know, at this GPS location for four and a half hours, right?"}, {"time": 2122, "text": "So if you wanted to compensate them for that time directly, and the trucker can't control what's happening on that customer location, you know, they're waiting for that, you know, firm, that customer to tell them, hey, pull in there."}, {"time": 2135, "text": "And so what it becomes is just a way to shift the inefficiencies and the cost of that onto that driver."}, {"time": 2143, "text": "Now it's competitive for customers."}, {"time": 2145, "text": "So if you're Walmart, you might have your choice of a dozen different trucking companies that could move your stuff."}, {"time": 2152, "text": "And if one of them tells you, hey, you're not moving our trucks in and out of your docks fast enough, we're gonna charge you for how long our truck is sitting on your lot."}, {"time": 2161, "text": "If you're Walmart, you're gonna say, I'll go see what the other guy says, right?"}, {"time": 2164, "text": "And so companies are gonna allow that customer to essentially waste that driver's time, you know, in order to keep that business."}, {"time": 2174, "text": "Can you try to describe the economics, the labor market of the situation?"}, {"time": 2178, "text": "You mentioned freight and railroad."}, {"time": 2180, "text": "What is the sort of the dynamic financials, the economics of this that allow for such low salaries to be paid to truckers?"}, {"time": 2195, "text": "Like what's the competition?"}, {"time": 2197, "text": "What's the alternative to transporting goods via trucks?"}, {"time": 2201, "text": "Like what seems to be broken here from an economics perspective?"}, {"time": 2204, "text": "Yeah, so it's, well, nothing."}, {"time": 2207, "text": "It's a perfect market, right?"}, {"time": 2210, "text": "I mean, so for economists, this is how it should work, right?"}, {"time": 2213, "text": "But the inefficiencies, like you said, sorry to interrupt, are pushed to the truck driver."}, {"time": 2219, "text": "Doesn't that like spiral, doesn't that lead to a poor performance on the part of the truck driver and just like make the whole thing more and more inefficient and it results in lower payment to the truck driver and so on."}, {"time": 2232, "text": "It just feels like in capitalism, you should have a competing solution in terms of truck drivers."}, {"time": 2241, "text": "Like another company that provides transportation via trucks that creates a much better experience for truck drivers, making them more efficient, all those kinds of things."}, {"time": 2252, "text": "How is the competition being suppressed here?"}, {"time": 2254, "text": "Yeah, so it is, the competition is based on who's cheaper."}, {"time": 2259, "text": "And this is the cheapest way to move the freight."}, {"time": 2262, "text": "Now, there are externalities, right?"}, {"time": 2264, "text": "I mean, so this is the explanation that I think is obvious for this, right?"}, {"time": 2269, "text": "There are lots of costs that, whether it's that driver's time, whether it's the time without their family, whether it's the fact that they drive through congestion and spew lots of diesel particulates into cities where kids have asthma and make our commutes longer rather than more efficiently use their time by sort of routing them around congestion and rush hour and things like that."}, {"time": 2297, "text": "This is the cheapest way to move freight."}, {"time": 2301, "text": "And so it's the most competitive."}, {"time": 2303, "text": "A big part of this is public subsidy of training."}, {"time": 2306, "text": "So when those workers are not paying for the training, you and I often are."}, {"time": 2312, "text": "So if you lose your job because of foreign trade or you're a veteran using your GI benefits, you may very well be offered training, publicly subsidized training to become a truck driver."}, {"time": 2330, "text": "And so all of these are externalities that the companies don't have to pay for."}, {"time": 2335, "text": "And so this makes it the most profitable way to move freight."}, {"time": 2338, "text": "So trucks is way cheaper than trains?"}, {"time": 2342, "text": "Well, over the long, so one of the big stories for these companies is that the average length of haul, which becomes very important for self driving trucks, the average length of haul has been steadily declining."}, {"time": 2357, "text": "Over the last 15 years or so, and this is industry collected data from sort of the big firms that report it, but roughly been cut in half from typically about a thousand miles to under 500."}, {"time": 2370, "text": "And under 500 is what a driver can move in a day, right?"}, {"time": 2376, "text": "So you can get loaded, drive and unload, around 400 miles or something like that."}, {"time": 2384, "text": "I wanna steal a good question from the Penn Gazette interview you did, which people should read."}, {"time": 2389, "text": "It's a great interview."}, {"time": 2391, "text": "Was there a golden age for long haul truckers in America?"}, {"time": 2395, "text": "And if so, this is just a journalistic question."}, {"time": 2398, "text": "And if so, what enabled it and what brought it to an end?"}, {"time": 2402, "text": "Wow, I might have to have you read my answer to that."}, {"time": 2405, "text": "That was a few years ago, be interesting to compare what I'll say, but."}, {"time": 2410, "text": "I mean, one bigger question to ask, I guess, is like Johnny Cash wrote a lot of songs about truckers."}, {"time": 2417, "text": "There used to be a time when perhaps falsely, perhaps it's part of the kind of perception that you study with the labor markets and so on."}, {"time": 2426, "text": "There was a perception of truckers being, first of all, a lucrative job and second of all, a job to be desired."}, {"time": 2434, "text": "Yeah, so I mean, this is, the trucking industry to me is fascinating, but I think it should be fascinating to a lot of people."}, {"time": 2443, "text": "So the golden age was really two different kinds of markets as well, right?"}, {"time": 2451, "text": "Today we have really good jobs and some really bad jobs."}, {"time": 2454, "text": "We had the Teamsters Union that controlled the vast majority of employee jobs."}, {"time": 2461, "text": "And even where they had something called the National Master Freight Agreement."}, {"time": 2465, "text": "And this was Jimmy Hoffa who led the union through its sort of critical period by the mid 60s had unified essentially the entire nation's trucking labor force under one contract."}, {"time": 2482, "text": "Now you were either covered by that contract or your employer paid a lot of attention to it."}, {"time": 2489, "text": "And so by the end of the 1970s, the typical truck driver was making well more than $100,000, typical truck driver was making more than $100,000 in today's dollars and was home every night."}, {"time": 2501, "text": "That was without a doubt and even more than unionized auto workers, steel workers, 10, 20% more than those workers made."}, {"time": 2513, "text": "That was the golden age for sort of job quality, wages, teamster power."}, {"time": 2517, "text": "They were without a doubt the most powerful union in the United States at that time."}, {"time": 2523, "text": "At the same time in the 1970s, you had the mythic long haul trucker."}, {"time": 2529, "text": "And these were the guys who were kind of on the margins of the regulated market, which is what the teamsters controlled."}, {"time": 2536, "text": "A lot of them were in agriculture, which was never regulated."}, {"time": 2539, "text": "So in the new deal, when they decided to regulate trucking, they didn't regulate agriculture because they didn't wanna drive up food prices, which would hurt workers in urban areas."}, {"time": 2548, "text": "So they essentially left agricultural truckers out of it."}, {"time": 2552, "text": "And that's where a lot of the kind of outlaw, you know, asphalt cowboy imagery that we get."}, {"time": 2560, "text": "And I grew up, I know you didn't grow up in the US at this sort of, you know, as a young child."}, {"time": 2567, "text": "And I'm a bit older than you, but in the late 70s, there were movies and TV shows and CBs were a craze."}, {"time": 2574, "text": "And it was all these kind of outlaw truckers who were out there hauling some unregulated freight."}, {"time": 2580, "text": "They weren't supposed to be trying to avoid the bears, you know, who are the cops."}, {"time": 2583, "text": "And, you know, with all this salty language and these like, you know, terms that only they understood and, you know, the partying at diners and popping pills, you know, the California turnarounds."}, {"time": 2595, "text": "So asphalt cowboys, truly."}, {"time": 2597, "text": "So it's like another form of cowboy movies."}, {"time": 2600, "text": "Oh, absolutely, absolutely."}, {"time": 2602, "text": "And I think that sort of masculine ethos of like, you got 40,000 pounds of something you care about, I'm your guy, you know, you needed to go from New York to California, don't worry about it, I got it."}, {"time": 2614, "text": "That's appealing and it's tangible, right?"}, {"time": 2617, "text": "And you think about people who don't wanna be paper pusher and sit in the, I deal with office politics, like just give me what you care about and I'll take care of it, you know, just pay me fair, you know, and that appeals."}, {"time": 2626, "text": "You mentioned unions, Teamsters, Jimmy Hoffa."}, {"time": 2631, "text": "Big question, maybe difficult question."}, {"time": 2633, "text": "What are some pros and cons of unions historically and today in the trucking space?"}, {"time": 2638, "text": "Yeah, well, if you're a worker, there are a lot of pros."}, {"time": 2643, "text": "And I don't, you know, and this was one of the things I talked to truckers about a lot."}, {"time": 2647, "text": "Yeah, what's their perception of Jimmy Hoffa, for example, of unions?"}, {"time": 2651, "text": "Yeah, so, and this was probably one of the central hypotheses that I had going in there."}, {"time": 2656, "text": "And it may sound, you know, someone who does hard science, right?"}, {"time": 2661, "text": "You may hear a social scientist, you know, sort of use that terminology, even other social scientists."}, {"time": 2666, "text": "Hypothesis?"}, {"time": 2666, "text": "Yeah, you know, they don't like it, but I do like to think that way."}, {"time": 2671, "text": "And my initial hypothesis was that, you know, and it's very simple, that, you know, the tenure of the driver in the industry would have a strong effect on how they viewed unions."}, {"time": 2683, "text": "That, you know, somebody who had experienced unions would be more favorable and someone who had not would not be, right?"}, {"time": 2691, "text": "And that turned out to be the case without a doubt."}, {"time": 2695, "text": "But in an interesting way, which was that even the drivers who were not part of the union, who in the kind of public debate of deregulation were portrayed as these kind of small business truckers who were getting shut out by the big regulated monopolies and the Teamsters Union, you know, the corrupt Teamsters Union."}, {"time": 2719, "text": "Even those drivers longed for the days of the Teamsters because they recognized the overall market impact that they had."}, {"time": 2727, "text": "That trucking just naturally tended toward excessive competition that meant that there was no profit to be made and oftentimes you'd be operating at a loss."}, {"time": 2739, "text": "And so even these, you know, the asphalt cowboy owner operators from back in the day would tell me when the Teamsters were in power, I made a lot more money."}, {"time": 2748, "text": "And, you know, this is, you know, unions, at least those kinds of unions, like the Teamsters, you know, there's, I think a lot of misconceptions today sort of popularly about what unions did back then."}, {"time": 2761, "text": "They tied wages to productivity."}, {"time": 2764, "text": "Like that was the central thing that the Teamsters Union did."}, {"time": 2768, "text": "And, you know, there were great accounts of sort of Jimmy Hoffa's perspective for all his portrayal as sort of corrupt and criminal, and there's, you know, I'm not disputing that."}, {"time": 2779, "text": "He broke a lot of laws."}, {"time": 2782, "text": "He was remarkably open about who he was and what he did."}, {"time": 2787, "text": "He actually invited a pair, a husband and wife team of Harvard economists to follow him around and like opened up the Teamsters books to them so that they could see how he was, you know, thinking about negotiating with the employers."}, {"time": 2803, "text": "And the Teamsters, and this goes back to the beginning, and this goes back well before Hoffa, back to the, you know, 1800s, they understood that workers did better if their employers did better."}, {"time": 2817, "text": "And the only way the employers would do better was if they controlled the market."}, {"time": 2821, "text": "And so oftentimes the corruption in trucking was initiated by employers who wanted to limit competition and they knew they couldn't limit competition without the support of labor."}, {"time": 2830, "text": "And so you'd get these collusive arrangements between employers and labor to say no new trucking companies."}, {"time": 2837, "text": "There are 10 of us, that's enough."}, {"time": 2839, "text": "We control Seattle, we're gonna set the price and we're not gonna be undercut."}, {"time": 2844, "text": "When there's a shortage of trucks around, it's great, rates go up, but you get too many trucks."}, {"time": 2850, "text": "It's very often that you end up operating at a loss just to keep the doors open."}, {"time": 2855, "text": "You know, you don't have any choice."}, {"time": 2856, "text": "You can't, it's what economists called derived demand."}, {"time": 2859, "text": "You can't like make up a bunch of trucking services and store it in a warehouse, right?"}, {"time": 2863, "text": "You gotta keep those trucks moving to pay the bills."}, {"time": 2867, "text": "Can we also lay out the kind of jobs that are in trucking?"}, {"time": 2870, "text": "What are the best jobs in trucking?"}, {"time": 2872, "text": "What are the worst jobs in trucking?"}, {"time": 2873, "text": "What are we, how many jobs are we talking about today?"}, {"time": 2877, "text": "And what kind of jobs are there?"}, {"time": 2880, "text": "So there are a number of different segments and the first part would be, you know, are you offering, the first question would be, are you offering services to the public or are you moving your own freight, right?"}, {"time": 2893, "text": "So are you a retailer, say Walmart or, you know, a paper company or something like that that's operating your own fleet of trucks?"}, {"time": 2902, "text": "That's private trucking."}, {"time": 2905, "text": "For hire are the folks who, you know, offer their services out to other customers."}, {"time": 2911, "text": "So you have private and for hire."}, {"time": 2913, "text": "In general, for hire pays less."}, {"time": 2917, "text": "Is that because of the, something you talk about with employee versus contractor situation or are they all tricked or led to become contractors?"}, {"time": 2928, "text": "That can become a part of it as a strategy, but the fundamental reason is competition."}, {"time": 2934, "text": "So those private carriers aren't in competition with other trucking fleets, right?"}, {"time": 2940, "text": "For their own in house services."}, {"time": 2942, "text": "So, you know, they tend to, and this, you know, the question of why private versus for hire because for hire is cheaper, right?"}, {"time": 2949, "text": "And so if you need that, if that trucking service is central to what you do and you cannot afford disruptions or volatility in the price of it, you keep it in house."}, {"time": 2959, "text": "You should be willing to pay more for that because it's more valuable too and you keep it in house and that."}, {"time": 2963, "text": "So that's an interesting distinction."}, {"time": 2965, "text": "What about, and this is kind of moving towards our conversation of what can and can't be automated."}, {"time": 2971, "text": "How else does it divide the different trucking jobs?"}, {"time": 2976, "text": "So the next big chunk is kind of how much stuff are you moving, right?"}, {"time": 2980, "text": "And so we have what's called truckload and truckload means, you know, you can fill up a trailer either by volume or by weight and then less than truckload."}, {"time": 2990, "text": "Less than truckload, the official definition is like less than 10,000 pounds."}, {"time": 2995, "text": "You know, this is gonna be a couple of pallets of this, a couple of pallets of that."}, {"time": 2998, "text": "The process looks really different, right?"}, {"time": 3000, "text": "So that truckload is, you know, point A to point B, I'm buying, you know, a truckload of bounty paper towels, I'm bringing it into, you know, my distribution center, go pick it up at the bounty plant, bring it to my distribution center, right?"}, {"time": 3015, "text": "Nowhere in between do you stop."}, {"time": 3018, "text": "At least process that freight."}, {"time": 3019, "text": "Less than truckload, what you've got is terminal systems."}, {"time": 3022, "text": "And this is what you had under regulation too."}, {"time": 3047, "text": "That's gonna look a lot like if you send a package by UPS, right, they pick all these parcels, right, figure out where they're all going, put them on planes or in trailers going to the same destination, then break them out to put them in what they call package cars."}, {"time": 3061, "text": "So, before I ask you about autonomous trucks, let's just pause for your experience as a trucker."}, {"time": 3071, "text": "Did it get lonely?"}, {"time": 3072, "text": "Like, can you talk about some of your experiences of what it was actually like?"}, {"time": 3077, "text": "Yeah, no, I mean, it was, I didn't have kids at the time."}, {"time": 3081, "text": "Now I have kids, I can't even imagine it."}, {"time": 3085, "text": "You know, I've been married for five years at the time."}, {"time": 3089, "text": "My wife hated it, I hated it."}, {"time": 3091, "text": "You know, I describe in the book the experience of being stuck, if I remember correctly, it was like Ohio at this truck stop in the middle of nowhere and like, you know, sitting on this concrete barrier and just watching fireworks in the distance and like eating Chinese food on the 4th of July."}, {"time": 3111, "text": "And you know, my wife calls me from like the family barbecue and our anniversary is July 8th."}, {"time": 3117, "text": "And she's like, are you gonna be home?"}, {"time": 3119, "text": "And I'm like, I don't know, you know."}, {"time": 3123, "text": "I have a cousin whose husband drove truck as a truck driver would say, drove truck for a while."}, {"time": 3133, "text": "And he told me before I went into it, he was like, the advantage you have is that you know that you're not gonna be doing this long term."}, {"time": 3174, "text": "And this question, some of these, you know, grizzled old drivers, you know, tough, tough guys, would that question would like, some of them would break down and they would say, I would say to them, you better have everything that you ever wanted in life already."}, {"time": 3191, "text": "Because I've had a car that I've had for 10 years, it's got 7,000 miles on it."}, {"time": 3197, "text": "I own a boat that hasn't seen the water in five years."}, {"time": 3201, "text": "My kids, I didn't raise them."}, {"time": 3204, "text": "Like I'd be out for two weeks at a time, I'd come home, my wife would give me two kids to punish, a list of things to do, you know, on Saturday night and I might leave out Sunday night or Monday morning."}, {"time": 3217, "text": "You know, I come home dead tired, my kids don't know who I am."}, {"time": 3221, "text": "And you know, it was just like, it was heartbreaking to hear those stories."}, {"time": 3226, "text": "And then before you know it, you know, life is short and just the years run away."}, {"time": 3234, "text": "Hard question to ask in that context, but what's the best, what was the best part of being a truck driver?"}, {"time": 3244, "text": "Was there moments that you truly enjoyed on the road?"}, {"time": 3249, "text": "There was, there's definitely a pride and mastery of, you know, even basic competence of sort of piloting this thing safely."}, {"time": 3257, "text": "There's a lot of responsibility to it."}, {"time": 3258, "text": "That thing's dangerous and you know it."}, {"time": 3261, "text": "So there's some pride there."}, {"time": 3263, "text": "For me personally, and I know for a lot of other drivers, it's just like seeing these behind the scenes places that you know exist in our economy."}, {"time": 3272, "text": "And I think we're all much more aware of them now after COVID and supply chain mess that we have."}, {"time": 3278, "text": "I don't know if we'll talk about that, but you know, you get to see those places."}, {"time": 3282, "text": "You know, you get to see those ports."}, {"time": 3284, "text": "You get to see the place where they make the cardboard boxes that the Huggies diapers go in."}, {"time": 3289, "text": "Or the warehouse full of Bud Light."}, {"time": 3292, "text": "I moved Bud Light from like upstate New York and the first load like went to Atlanta, you know?"}, {"time": 3298, "text": "And then a couple months later, I circled back through that same brewery and I brought a load of Bud Light out to Michigan."}, {"time": 3307, "text": "And I was like, holy shit, all the Bud Light, like, you know, for this whole giant swath of the United States comes from this one plant, this cavernous plant with like kegs of beer."}, {"time": 3316, "text": "And you see that part of the economy and it's like, you're almost like you're an economic tourist."}, {"time": 3322, "text": "And I think all, everybody kind of appreciates that."}, {"time": 3325, "text": "Like kind of, it's almost like a behind the scenes tour."}, {"time": 3329, "text": "That wears off after a few months, you know?"}, {"time": 3331, "text": "You start to see new things less and less frequently."}, {"time": 3334, "text": "At first, everything's novel and sort of life on the road."}, {"time": 3337, "text": "And then it becomes just endless miles of white lines and yellow lines and truck stops."}, {"time": 3343, "text": "And the days just blur together."}, {"time": 3346, "text": "You know, it's one loading dock."}, {"time": 3347, "text": "It's one loading dock after another."}, {"time": 3349, "text": "So you lose the magic of being on the road."}, {"time": 3352, "text": "Yeah, it's very rare the driver that doesn't."}, {"time": 3358, "text": "You mentioned COVID and supply chain."}, {"time": 3361, "text": "While being this, for a brief time, this member of the supply chain, what have you come to understand about our supply chain, United States and global and its resilience against strategies, catastrophic in the world?"}, {"time": 3378, "text": "Like COVID, for example."}, {"time": 3380, "text": "Yeah, I mean, we have built really long, really lean supply chains."}, {"time": 3386, "text": "And just by definition, they're fragile."}, {"time": 3391, "text": "You know, the current mess that we have, it's not gonna clear by Christmas."}, {"time": 3397, "text": "It will be lucky if it clears by next Christmas."}, {"time": 3399, "text": "Can you describe the current mess in supply chain that you're referring to?"}, {"time": 3403, "text": "Yeah, so we've got pile ups of ships off the coast of California, Long Beach, and LA in particular, in bad shape."}, {"time": 3414, "text": "You know, last I checked, it was around 60 ships, all of which are holding thousands of containers full of stuff that retailers were hoping was gonna be on shelves for the holiday season."}, {"time": 3427, "text": "Meanwhile, the port itself has stacks and stacks of containers that they can't get rid of."}, {"time": 3432, "text": "The truckers aren't showing up to pick up the containers that are there, so they can't offload the ships that are waiting."}, {"time": 3442, "text": "And why aren't the truckers picking it up?"}, {"time": 3446, "text": "Partly because there's a long history of inefficiency in making them wait, but it's because the warehouses are full."}, {"time": 3451, "text": "So we've had all these perverse outcomes that no one really expected."}, {"time": 3458, "text": "Like in the middle of all these shortages, people are stockpiling stuff."}, {"time": 3463, "text": "So there are suppliers who used to keep two months of supply of bottled water on hand."}, {"time": 3470, "text": "And after going through COVID and not having supply to send to their customers, they're like, we need three months."}, {"time": 3478, "text": "Well, our system is not designed for major storage of goods to go up 50% in a category."}, {"time": 3484, "text": "It's lean."}, {"time": 3485, "text": "If you're a warehouse operator, you know, you wanna be 90% plus."}, {"time": 3488, "text": "You don't want a lot of open bays sitting around."}, {"time": 3490, "text": "So we don't have 10% extra capacity in warehouses."}, {"time": 3496, "text": "We don't have 10% of them."}, {"time": 3498, "text": "Trucking capacity can fluctuate a bit, but you don't have that kind of slack."}, {"time": 3503, "text": "And now, I mean, and we saw this right when people shifted consumption."}, {"time": 3508, "text": "And I get a little mad when people talk about panic buying as kind of the reason that we had all these shortages."}, {"time": 3516, "text": "It really, like it's preventing us from understanding, you know, the real problem there, which is that lean supply chain."}, {"time": 3524, "text": "Sure, there was some panic buying, you know, no doubt about it, but we had an enormous shift in people's behavior."}, {"time": 3531, "text": "So with my sister and brother in law, I own a couple of small businesses and we serve food, right?"}, {"time": 3538, "text": "So we get, you know, food from Cisco."}, {"time": 3542, "text": "Cisco couldn't get rid of food, right?"}, {"time": 3544, "text": "Because nobody's eating out."}, {"time": 3545, "text": "So they've got, you know, 50 pounds sacks of flour, you know, sitting in their warehouse that they can't get rid of."}, {"time": 3551, "text": "They've got cases of lettuce and meat and everything else that's just gonna go bad."}, {"time": 3557, "text": "So that panic buying certainly exacerbated some things like toilet paper and whatever, but we saw just a massive change in demand."}, {"time": 3565, "text": "And our supply chains are based on historical data, right?"}, {"time": 3568, "text": "So, you know, that stuff leaves Asia, you know, months before you wanna have it on the shelves and you're predicting based on last year, you know, what you want on that shelf."}, {"time": 3579, "text": "And so it's a, you know, I guess at its best, it's a beautiful symphony of lots of moving parts, but now everyone can't get on the same page of music."}, {"time": 3592, "text": "But it's not resilient to changes in on mass human behavior."}, {"time": 3599, "text": "So even like I read somewhere, maybe you can tell me if it's true in relation to food, it's just the change of human behavior between going out to restaurants versus eating at home."}, {"time": 3611, "text": "As a species, we consume a lot less food that way."}, {"time": 3615, "text": "Apparently what I read in restaurants, like there's a lot of food just thrown out."}, {"time": 3620, "text": "It's part of the business model."}, {"time": 3623, "text": "And so like you then have to move a lot more food through the whole supply chain."}, {"time": 3628, "text": "And now because you're consuming, you know, there's leftovers at home, you're consuming much more of the food you're getting when you're eating at home, that's creating these bottleneck situations, problems as you're referring to, too much in a certain place, not enough in another place."}, {"time": 3645, "text": "And it's just the supply chain is not robust those kinds of dynamic shifts in who gets what where."}, {"time": 3654, "text": "Yeah, I mean, so, and I have worked in agriculture a bit on sort of the supply side, you know, and there are product categories, right?"}, {"time": 3663, "text": "Where 30% of the crop raised does not get used, right?"}, {"time": 3667, "text": "Just gets plowed under or wasted."}, {"time": 3669, "text": "But here's the importance of this in sort of getting this right, you know, like that, not that like panic buying, you know, blame the irrational consumer, you know, look at the hard sort of truth of the way we've set up our economy."}, {"time": 3684, "text": "And I'll ask you this, Lex, I know you're a hopeful, optimistic person."}, {"time": 3691, "text": "Yeah, I am too."}, {"time": 3692, "text": "I mean, I write about problems all the time."}, {"time": 3694, "text": "And so people think I'm sort of like a, just a Debbie Downer, you know, pessimist, but I'm a glass half full kind of guy."}, {"time": 3703, "text": "Like I want to identify problems so we can solve them."}, {"time": 3707, "text": "So let me ask you this, we've got these long lean supply chains."}, {"time": 3712, "text": "In the future, do you see more environmental problems that could disrupt them, more geopolitical problems that could disrupt trade from Asia, you know, other institutional failures?"}, {"time": 3730, "text": "Do those things seem, you know, potentially more likely in the future than they have been in say the last 20 years?"}, {"time": 3738, "text": "Yeah, it almost absolutely seems to be the case."}, {"time": 3741, "text": "So you then have to ask the question of how do we change our supply chains?"}, {"time": 3748, "text": "Whether it's making more resilient or make them less densely connected, you know, building a, it's like a, what is it?"}, {"time": 3758, "text": "You know, the Tesla model for in the automotive sector of like trying to build everything, like trying to get the factory to do as much as possible with as little reliance on widely distributed sources of the supply chain as possible."}, {"time": 3775, "text": "So maybe like rethinking how much we rely on the infrastructure of the supply chain."}, {"time": 3781, "text": "Yeah, I mean, you know, there's some basic, and I assume, right, that there are a lot of folks in corporate boardrooms looking at risk and saying that didn't go well, and maybe it could have even gone worse."}, {"time": 3796, "text": "Maybe we need to think about reshoring, right?"}, {"time": 3800, "text": "At the very least, one of the things that I'm hearing about anecdotally is that they're starting stuff up, you know, when they can, right?"}, {"time": 3808, "text": "Which is, that's probably not sustainable, right?"}, {"time": 3811, "text": "I mean, at some point, somebody in that corporate boardroom is gonna say, you know, guys, inventory is getting kind of heavy and the cost of that is like, do we, can we really justify that much longer to the shareholders, right?"}, {"time": 3821, "text": "We can back off and start, you know, back, things are back to normal, let's lean out."}, {"time": 3825, "text": "Well, my hope is that there's a technology solution to a lot of aspects of this."}, {"time": 3829, "text": "So one of them on the supply chain side is collecting a lot more data, like having much more integrated and accurate representation of the inventory all over the place, and the available transportation mechanisms, the trucks, the all kinds of freight, and how in the different models of the possible catastrophes that can happen, like how will the system respond?"}, {"time": 3855, "text": "So having a really solid model that you're operating under as opposed to just kind of being in emergency response mode under poor, incomplete information, which is what seems like is more commonly the case, except for things like you said, Walmart and Amazon, they're trying to internally get their stuff together on that front, but that doesn't help the rest of the economy."}, {"time": 3880, "text": "So another exciting technological development as you write about, as you think about is autonomous trucks."}, {"time": 3888, "text": "So these are often brought up in different contexts as the examples of AI and robots taking our jobs."}, {"time": 3897, "text": "How true is this?"}, {"time": 3898, "text": "Should we be concerned?"}, {"time": 3901, "text": "I think they've really come to epitomize this anxiety over automation, right?"}, {"time": 3906, "text": "It's such a simple idea, right?"}, {"time": 3909, "text": "Truck that drives itself, classic blue collar job that pays well, guy maybe with not a lot of other good options, right?"}, {"time": 3920, "text": "To sort of make that same income easily, and you build a robot to take his job away, right?"}, {"time": 3928, "text": "So I think 2016 or so, that was the sort of big question out there, and that's actually how I started studying it, right?"}, {"time": 3938, "text": "I just wrapped up the book, just so happened that somebody was working at Uber, Uber had just bought auto, saw the book and was like, hey, can you come out and talk to our engineering teams about what life is like for truck drivers and maybe how our technology could make it better."}, {"time": 3954, "text": "And at that time, there were a lot of different ideas about how they were gonna play out, right?"}, {"time": 3960, "text": "So while the press was saying, all truckers are gonna lose their jobs, there were a lot of people in these engineering teams who thought, okay, if we've got an individual owner operator and they can only drive eight or 10 hours a day, they hop in the back, they get their rest, and the asset that they own works for them, right?"}, {"time": 3983, "text": "Sort of perfect, right?"}, {"time": 3985, "text": "And at that time, there were a bunch of reports that came out and sort of basically what people did was they took the category of truck driver."}, {"time": 3993, "text": "Some people took a larger category from BLS of sales and delivery workers that was about three and a half million workers and others took the heavy duty truck driver category, which was at the time about 1.8 million or so."}, {"time": 4006, "text": "And they picked a start date and a slope and said, let's assume that all these jobs are just gonna disappear."}, {"time": 4013, "text": "And really smart researcher, Annette Bernhardt at the Labor Center at UC Berkeley was sort of looking around for people who were sort of deeply into industries to complicate those analyses, right?"}, {"time": 4030, "text": "And reached out to me and was like, what do you think of this?"}, {"time": 4032, "text": "And I said, the industry is super diverse."}, {"time": 4035, "text": "I haven't given a ton of thought, but it can't be that."}, {"time": 4037, "text": "It's not that simple, it never is."}, {"time": 4041, "text": "And so she was like, will you do this?"}, {"time": 4043, "text": "And I was like ready to move on to another topic."}, {"time": 4046, "text": "I had like been in trucking for 10 years and that's how I started looking at it."}, {"time": 4051, "text": "And it is, it's a lot more complicated."}, {"time": 4053, "text": "And the initial impacts, and here's the challenge I think, and it's not just a research challenge, it's the fundamental public policy challenge is we look at the existing industry and the impacts, the potential impacts, they're not, you know, nothing."}, {"time": 4073, "text": "For some communities and some kinds of drivers, they're gonna be hard."}, {"time": 4077, "text": "And there are a significant number of them."}, {"time": 4079, "text": "Nowhere near what people thought."}, {"time": 4080, "text": "You know, I estimate it's like around 300,000, but that's a static picture of the existing industry."}, {"time": 4088, "text": "And here's the key with this is, at least in my conclusion is this is a transformative technology."}, {"time": 4097, "text": "We are not going to swap in self driving trucks for human driven trucks and all else stays the same."}, {"time": 4104, "text": "This is gonna reshape our supply chains."}, {"time": 4107, "text": "It's gonna reshape landscapes."}, {"time": 4109, "text": "It's gonna affect our ability to fight climate change."}, {"time": 4113, "text": "This is a really important technology in this space."}, {"time": 4117, "text": "Do you think it's possible to predict the future of the kind of opportunities it will create, how it will change the world?"}, {"time": 4126, "text": "So like when you have the internet, you can start saying like all the kinds of ways that office work, all jobs will be lost because it's easy to network."}, {"time": 4137, "text": "And then software engineering allows you to automate a lot of the tasks like Microsoft Excel does, you know."}, {"time": 4144, "text": "But it opened up so many opportunities, even with things that are difficult to imagine, like with the internet, I don't know, Wikipedia, which is widely making accessible information."}, {"time": 4155, "text": "And that increased the general education globally by a lot, all those kinds of things."}, {"time": 4162, "text": "And then the ripple effects of that in terms of your ability to find other jobs is probably immeasurable."}, {"time": 4171, "text": "So is it just a hopeless pursuit to try to predict if you talk about these six different trajectories that we might take in automating trucks, but like as a result of taking those trajectories, is it a hopeless pursuit to predict what the future will result in?"}, {"time": 4192, "text": "It absolutely is."}, {"time": 4194, "text": "Because it's the wrong question."}, {"time": 4196, "text": "The question is, what do we want the future to be and let's shape it, right?"}, {"time": 4201, "text": "And I think this is, and this is the only point that I really wanna make in my work for the foreseeable future, is that we have got to get out of this mindset that we're just gonna let technology kind of go and it's a natural process and whatever pops out will fix the problems on the backside."}, {"time": 4224, "text": "And we've got to recognize that one, that's not what we do, right?"}, {"time": 4230, "text": "You know, and self driving vehicles is just such a perfect example, right?"}, {"time": 4235, "text": "We would not be sitting here today if the Defense Department, right?"}, {"time": 4238, "text": "If Congress in 2000 had not written into legislation funding for the DARPA challenges, which followed, actually I think the funding came a couple of years later, but the priority that they wrote in 2000 was let's get a third of all ground vehicles in our military forces unmanned, right?"}, {"time": 4258, "text": "And this was before aerial unmanned vehicles had really sort of proven their worth."}, {"time": 4262, "text": "They would come to be incredibly, like, you know, just blow people's minds in terms of their additional capabilities, the lower costs, you know, keeping soldiers out of harm's way."}, {"time": 4273, "text": "Now, of course they raised other problems and considerations that I think we're still wrestling with, but that was even before that they had this priority."}, {"time": 4281, "text": "We would not be sitting here today if Congress in 2000 had not said, let's bring this about."}, {"time": 4287, "text": "So they already had that vision, actually."}, {"time": 4289, "text": "I didn't know about that."}, {"time": 4317, "text": "Some failed, some succeeded, some are still fighting the good fight."}, {"time": 4321, "text": "And that somehow just that little bit of challenge was the essential spark of progress that now resulted in this beautiful up and down wave of hype and profit and all this kind of weird dance where the B word, billions of dollars have been thrown around and we still don't know."}, {"time": 4341, "text": "And the T word, trillions of dollars in terms of transformative effects of autonomous vehicles."}, {"time": 4345, "text": "And all that started from DARPA and that initial vision of, I guess, as you're saying, of automating part of the military supply chain."}, {"time": 4355, "text": "I did not know that."}, {"time": 4357, "text": "So they had the same kind of vision for the military as we're not talking about a vision for the civilian, whether it's trucking or whether it's autonomous vehicle, sort of a ride sharing kind of application."}, {"time": 4368, "text": "Yeah, I mean, what an incredible spark, right?"}, {"time": 4373, "text": "And just the story of what it produced, right?"}, {"time": 4377, "text": "I mean, your own work on self driving, right?"}, {"time": 4381, "text": "I mean, you've studied it as an academic, right?"}, {"time": 4384, "text": "How many great researchers and minds have been harnessed by this outcome of that spark, right?"}, {"time": 4391, "text": "And I think this is sort of theoretically about technology, right, this is what makes it sort of so great is that this is what makes us human, in my opinion, right?"}, {"time": 4398, "text": "Is that you conceive of something in your mind and then you bring it into reality, right?"}, {"time": 4403, "text": "I mean, that's what is so great about it."}, {"time": 4407, "text": "Sometimes you're too dumb to realize how difficult it is so you take it."}, {"time": 4411, "text": "And then eventually you're in too deep."}, {"time": 4416, "text": "You might as well solve the problem."}, {"time": 4418, "text": "Well, and maybe we're in that situation right now with self driving."}, {"time": 4422, "text": "But, you know, and so let me throw this out there."}, {"time": 4424, "text": "I'd be curious to hear your thoughts on it."}, {"time": 4426, "text": "But truck drivers always ask me, like, is this for real?"}, {"time": 4430, "text": "Like, is this really, like, it's harder than they think, like, right, and they can't really do this."}, {"time": 4435, "text": "And, you know, at first I was like, look, you know, this is like the defense department and like basically the top computer science and robotics departments in the world."}, {"time": 4447, "text": "And now Silicon Valley with billions of dollars in funding and just, you know, some of the smartest, hardest working, most visionary people focused on what is clearly, you know, a gigantic market, right?"}, {"time": 4464, "text": "And what I tell them is like, if self driving vehicles don't happen, I think this will be the biggest technology failure story in human history."}, {"time": 4475, "text": "I don't know of anything else that is just galvanized."}, {"time": 4479, "text": "I mean, you've had people in garages or weird inventors work on things their whole lives and come really close and it never happens and it's a great failure story, right?"}, {"time": 4488, "text": "But never have we had like whole, I mean, we're talking about GM, right?"}, {"time": 4493, "text": "And these are not, you know, these are not tech companies, right, these are industrial giants, right?"}, {"time": 4498, "text": "What were in the 20th century, the pinnacle of industrial production in the world in human history, right?"}, {"time": 4505, "text": "And they're focused on it now."}, {"time": 4507, "text": "So if we don't pull this off, it's like, wow."}, {"time": 4511, "text": "It's fascinating to think about."}, {"time": 4512, "text": "I've never thought of it that way."}, {"time": 4514, "text": "There was a mass hysteria on a level in terms of excitement and hype on a level that's probably unparalleled in technology space."}, {"time": 4523, "text": "Like I've seen that kind of hysteria just studying history when you talk about military conflict."}, {"time": 4528, "text": "So we often wage war with a dream of making a better world and then realize it costs trillions of dollars and then we step back and like, and go, wait a minute, what do we actually get for this?"}, {"time": 4540, "text": "But in the space of technology, it seems like all these kinds of large efforts have paid off."}, {"time": 4545, "text": "This, you're right."}, {"time": 4547, "text": "It seems like, it seems like even GM and Ford and all these companies now are a little bit like, hey, or Toyota and even Tesla, like, are we sure about this?"}, {"time": 4562, "text": "And it's fascinating to think about when you tell the story of this, this could be one of the big first, perhaps, but by far the biggest failures of the dream in the space of technology."}, {"time": 4577, "text": "I was a skeptic for a long time because of the human factor."}, {"time": 4582, "text": "Because for business to work in the space, you have to work with humans and you have to work with humans at every level."}, {"time": 4589, "text": "So in the truck driving space, you have to work with the truck driver, but you also have to work with the society that has a certain conception of what driving means."}, {"time": 4597, "text": "And also you have to have work with businesses that are not used to this extreme level of technology, you know, in the basic operation of their business."}, {"time": 4608, "text": "So I thought it would be really difficult to move to autonomous vehicles in that way."}, {"time": 4613, "text": "But then I realized that there's certain companies that are just willing to take big risks and really innovate."}, {"time": 4620, "text": "I think the first impressive company to me was Waymo or what was used to be the Google self driving car."}, {"time": 4627, "text": "And I saw, okay, here's a company that's willing to really think longterm and really try to solve this problem, hire great engineers."}, {"time": 4638, "text": "Then I saw Tesla with Mobileye when they first had."}, {"time": 4642, "text": "I thought, actually Mobileye is the thing that impressed me."}, {"time": 4645, "text": "When I sat down, I thought, because I'm a computer vision person, I thought there's no way a system could keep me in lane long enough for it to be a pleasant experience for me."}, {"time": 4656, "text": "So from a computer vision perspective, I thought there'd be too many failures."}, {"time": 4659, "text": "It'd be really annoying."}, {"time": 4660, "text": "It'd be a gimmick, a toy."}, {"time": 4662, "text": "It wouldn't actually create a pleasant experience."}, {"time": 4664, "text": "And when I first was gotten Tesla with Mobileye, the initial Mobileye system, it actually held to lane for quite a long time to where I could relax a little bit."}, {"time": 4674, "text": "And it was a really pleasant experience."}, {"time": 4676, "text": "I couldn't exactly explain why it's pleasant because it's not like I still have to really pay attention, but I can relax my shoulders a little bit."}, {"time": 4685, "text": "I can look around a little bit more."}, {"time": 4687, "text": "And for some reason that was really reducing the stress."}, {"time": 4690, "text": "And then over time, Tesla with a lot of the revolutionary stuff they're doing on the machine learning space made me believe that there's opportunities here to innovate, to come up with totally new ideas."}, {"time": 4703, "text": "Another very sad story that I was really excited about is Cadillac SuperCruise system."}, {"time": 4709, "text": "It is a sad story because I think I vaguely read in the news they just said they're discontinuing SuperCruise, but it's a nice innovative way of doing driver attention monitoring and also doing lane keeping."}, {"time": 4723, "text": "And it just innovation could solve this in ways we don't predict."}, {"time": 4727, "text": "And same with in the trucking space, it might not be as simple as like journalists envision a few years ago, where everything's just automated."}, {"time": 4735, "text": "It might be gradually helping out the truck driver in some ways that make their life more efficient, more effective, more pleasant, remove some of the inefficiencies that we've been talking about in totally innovative ways."}, {"time": 4752, "text": "And that I still have that dream that I believe to solve the fully autonomous driving problem we're still many years away, but on the way to solving that problem, it feels like there could be, if there's bold risk takers and innovators in this space, there's an opportunity to come up with like subtle technologies that make all the difference."}, {"time": 4776, "text": "That's actually just what I realized is sometimes little design decisions make all the difference."}, {"time": 4782, "text": "It's the Blackberry versus the iPhone."}, {"time": 4785, "text": "Why is it that you have a glass and you're using your finger for all of the work versus the buttons makes all the difference."}, {"time": 4794, "text": "This idea that now that you have a giant screen so that every part of the experience is now a digital experience."}, {"time": 4801, "text": "So you can have things like apps that change everything."}, {"time": 4805, "text": "You can't, when you first thinking about do I want a keyboard or not on a smartphone, you think it's just the keyboard decision."}, {"time": 4813, "text": "But then you later realize by removing the keyboard, you're enabling a whole ecosystem of technologies that are inside the phone."}, {"time": 4823, "text": "And now you're making the smartphone into a computer."}, {"time": 4825, "text": "And that same way, who knows how you can transform trucks, right?"}, {"time": 4830, "text": "By like automating some parts of it, maybe adding some displays, maybe allows you to, maybe giving the truck driver some control in the supply chain to make decisions all those kinds of things."}, {"time": 4845, "text": "So, I don't know."}, {"time": 4846, "text": "So where are you on the spectrum of hope for the role of automation in trucking?"}, {"time": 4856, "text": "I think automation is inevitable."}, {"time": 4859, "text": "And again, I think this is really going to be transformative and it's gonna be, I've studied the history of trucking technology as much as I can."}, {"time": 4871, "text": "There's not a lot of great stuff written and you kind of have to, there isn't a lot of data and places to know sort of volumes of stuff and how they're changing, et cetera."}, {"time": 4879, "text": "But the big revolutionary changes in trucking are because of constellations of factors."}, {"time": 4887, "text": "It's not just one thing, right?"}, {"time": 4889, "text": "So Daimler builds a motorized truck and I think it's 1896, right?"}, {"time": 4895, "text": "Intercity trucking."}, {"time": 4897, "text": "So basically what they use that truck for is just to swap out horses, right?"}, {"time": 4901, "text": "They basically do the same thing."}, {"time": 4902, "text": "The service doesn't really change, you know?"}, {"time": 4905, "text": "And then World War I really spurs the development of sort of bigger, larger trucks, like spreads air filled tires."}, {"time": 4914, "text": "And then we start paving roads, right?"}, {"time": 4917, "text": "And paved roads, right?"}, {"time": 4920, "text": "Air filled tires and the internal combustion engine."}, {"time": 4924, "text": "Now you got a winning mix."}, {"time": 4925, "text": "Now it met with demand for people who wanted to get out from under the thumb of the railroads, right?"}, {"time": 4932, "text": "So there was all of this pent up demand to get cheaper freight from the countryside into cities and between cities that typically had to go by rail."}, {"time": 4942, "text": "And so now, you know, 40 years after that internal combustion engine, it becomes this absolutely essential, right?"}, {"time": 4950, "text": "This necessary but not sufficient piece of technology to create the modern trucking industry in the 1930s."}, {"time": 4958, "text": "And I think self driving is gonna be, self driving trucks are gonna be part of that."}, {"time": 4963, "text": "And the idea, I guess we credit Jeff Bezos."}, {"time": 4967, "text": "The idea is, you know, okay, so Sam Walton, if we can do it like a slight tangent on sort of the importance of trucking to business strategy and sort of how it has transformed our world."}, {"time": 4980, "text": "The central insight that Sam Walton had that made him the giant that he was in influencing the way that so many people get stuff was a trucking insight."}, {"time": 4992, "text": "And so if you look at the way that he developed his system, you build a distribution center and then you ring it with stores."}, {"time": 5002, "text": "Those stores are never further out from that distribution center than a human driven truck can drive back and forth in one day."}, {"time": 5011, "text": "And so rather than the way all of his competitors were doing it with sending trucks all over the place and having people sleep overnight and sort of making the trucking service fit where they had stores, he designed the layout of the stores to fit what trucks could do."}, {"time": 5031, "text": "And so transportation and logistics become Walmart's edge and allows them to dominate the space."}, {"time": 5039, "text": "That's the challenge that Amazon has now."}, {"time": 5042, "text": "They've mastered the digital part of it."}, {"time": 5045, "text": "And now they got to figure out how do we dominate the actual physical movement that complements that."}, {"time": 5054, "text": "Others are obviously gonna follow."}, {"time": 5056, "text": "But the capabilities of these trucks is completely different than the capability of a human driven truck."}, {"time": 5062, "text": "So if you're Smith packing and you've got a bunch of meat in a warehouse and it's going to grocery distribution centers, you have that trucker probably come in the night before and you make him wait so that he has a full 10 hour break, which is what the law requires so that he can get to the furthest reaches that he can of one of those stores."}, {"time": 5088, "text": "So he can drive his full 11 hours and bring that meat so it doesn't have to sit overnight in that refrigerated trailer."}, {"time": 5095, "text": "And so their system is based on that."}, {"time": 5097, "text": "Now, what happens when that truck can now travel two times as far, right?"}, {"time": 5104, "text": "Three times as far."}, {"time": 5105, "text": "Now you don't need the warehouses where they were."}, {"time": 5108, "text": "Now you can go super lean with your inventory."}, {"time": 5111, "text": "Instead of having meat here, meat there, meat there, you can put it all right here."}, {"time": 5116, "text": "And if it's cheap enough, substitute those transportation costs for all that warehousing costs, right?"}, {"time": 5122, "text": "So this is gonna remake landscapes in the same way that big box supply chains did, right?"}, {"time": 5129, "text": "And then of course, the further compliment of that is, how do you then get it to two people at their door, right?"}, {"time": 5137, "text": "And the big box supply chain, it moves very few items in really large quantities to very few locations pretty slowly, right?"}, {"time": 5149, "text": "Ecommerce aspires to do something completely different, move huge varieties of things in small quantities, virtually everywhere as fast as possible, right?"}, {"time": 5161, "text": "And so that is like that intercity trucking under the, in the era of railroad monopolies, right?"}, {"time": 5170, "text": "The demand for that is potentially enormous, right?"}, {"time": 5174, "text": "And so there's such a, so right now I think a lot of the business plans for sort of automated trucks, right?"}, {"time": 5182, "text": "And sort of the way that the journalistic accounts portray it is like, okay, if we swap out a human for a computer, what are the labor costs per mile?"}, {"time": 5190, "text": "And like, oh, here's the profitability of self driving trucks, uh uh."}, {"time": 5194, "text": "Like this is transformative technology."}, {"time": 5196, "text": "We're gonna change the way we get stuff."}, {"time": 5199, "text": "So we could actually get a lot more trucks period with like with autonomous trucks because they would enable a very different kind of transportation networks you think."}, {"time": 5207, "text": "Yeah, here's, and this is where it's like, uh oh."}, {"time": 5210, "text": "Like, yeah, so we really thought we were gonna be electrifying trucks."}, {"time": 5217, "text": "If they're going twice as far, if they're moving three times as much, if they're going three times as far, right?"}, {"time": 5223, "text": "What does that mean for how far we are behind on batteries, right?"}, {"time": 5226, "text": "We've got sort of these, you know, ideas about like, man, we, you know, here's how far, how close we could get to meet this demand."}, {"time": 5232, "text": "That demand is gonna radically change, right?"}, {"time": 5235, "text": "These trucks are, you know, so then we've got to think about, all right, if it's not batteries, you know, how are we powering these things?"}, {"time": 5242, "text": "And how many of them are they're gonna be?"}, {"time": 5245, "text": "Like right now we've got 5 million containers that move from LA and Long Beach to Chicago on rail."}, {"time": 5254, "text": "Rail is three or four times at least more efficient than trucks in terms of greenhouse gas emissions."}, {"time": 5262, "text": "And on that lane, it varies a lot depending on demand, but maybe rail has a 20% advantage in cost, maybe 25%, but it's a couple of days slower."}, {"time": 5272, "text": "So now you cut the cost of that truck, transportation per mile by 30%."}, {"time": 5277, "text": "Now it's cheaper than rail and it gets the stuff there five days faster than rail."}, {"time": 5282, "text": "How many millions of containers are gonna leave LA and Long Beach on self driving trucks and go to Chicago?"}, {"time": 5288, "text": "And it might look very much like a train if we go with the platooning solution, where you have these rows of like, imagine like rows of like 10, like dozens of trucks or like hundreds of trucks, like some absurd situation."}, {"time": 5305, "text": "Just going from LA to Chicago, just this train, but taking up a highway."}, {"time": 5311, "text": "I mean, this is probably a good place to talk about various scenarios."}, {"time": 5317, "text": "Well, before we get there, can I just make one interesting observation that I made as a driver?"}, {"time": 5324, "text": "When you're in a truck, you're up higher."}, {"time": 5326, "text": "So you can see further and you can see the traffic patterns and cars move in packs."}, {"time": 5334, "text": "I'm sure there's academic research on this, right?"}, {"time": 5336, "text": "But they move in packs."}, {"time": 5337, "text": "They kind of bunch up behind a slower car and then a bunch of them break free."}, {"time": 5341, "text": "And this is sort of on almost free flowing highways."}, {"time": 5343, "text": "They kind of move in packs and you can kind of see them in the truck."}, {"time": 5347, "text": "So, rather than platoons, we might have like hives of trucks, right?"}, {"time": 5351, "text": "So you have like 20 trucks moving in some coordinated fashion, right?"}, {"time": 5355, "text": "And then maybe the self driving cars are, cause people don't like to be around them or whatever it is, right?"}, {"time": 5361, "text": "You might have a pod of 20 self driving cars sort of moving in a packet behind them."}, {"time": 5366, "text": "This is what, if the aliens came down or we're just observing cars, which is one of the sort of prevalent characteristics of human civilization is there seems to be these cars like moving around that would do this kind of analysis of like, huh, what's the interesting clustering of situations here, especially with autonomous vehicles, I like this."}, {"time": 5388, "text": "Okay, so what technologically speaking do you see are the different scenarios of increasing automation in trucks?"}, {"time": 5398, "text": "What are some ideas that you think about?"}, {"time": 5400, "text": "For the most part, I have no influence on sort of what these ideas were."}, {"time": 5406, "text": "So what the project was that I did was I said, technology is created by people, they solve for X and they have some conception of what they wanna do."}, {"time": 5417, "text": "And that's where we should start in sort of thinking about what the impacts might be."}, {"time": 5422, "text": "So I went and I talked to everybody I could find who was thinking about developing a self driving truck."}, {"time": 5428, "text": "And the question was essentially, what are you trying to build?"}, {"time": 5432, "text": "Like, what do you envision this thing doing?"}, {"time": 5435, "text": "It turned out that that for a lot of them was an afterthought."}, {"time": 5440, "text": "They knew the sort of technological capabilities that a self driving vehicle would have."}, {"time": 5445, "text": "And those were the problems that they were tackling."}, {"time": 5448, "text": "They were engineers and computer scientists and... Oh, robotics people, I love you so much."}, {"time": 5453, "text": "This is, I could talk forever about this, but yes, there's a technology problem, let's focus on that and we'll figure out the actual impact on society, how it's actually going to be applied, how it's actually going to be integrated from a policy and from a human perspective, from a business perspective later."}, {"time": 5469, "text": "First, let's solve the technology problem."}, {"time": 5471, "text": "That's not how life works, friends, but okay, I'm sorry."}, {"time": 5474, "text": "Yeah, yeah, so I mean, I'm sure you know the division of labor in these companies, right?"}, {"time": 5478, "text": "There's sort of a business development side, you know, and then there's the engineering side, right?"}, {"time": 5482, "text": "And the engineers are like, oh my God, what are these business development people, you know, why are they involved in this process?"}, {"time": 5490, "text": "So I ended up sort of coming up with a few different ideas that people seem to be batting around and then really tried to zero in on a layman's understanding of the limitations, right?"}, {"time": 5502, "text": "And it turns out that's really obvious and quite simple."}, {"time": 5507, "text": "Highway driving's a lot simpler, right?"}, {"time": 5509, "text": "So, you know, the plan is simplify the problem, right?"}, {"time": 5513, "text": "And focus on highways because city driving is so much more complicated."}, {"time": 5519, "text": "So from that, I came up with basically six scenarios, actually I came up with five that the developers were talking about."}, {"time": 5528, "text": "And then one that I thought was a good idea that I had read about, I think in like 2013 or 2014, which was actually something that the US military was looking at."}, {"time": 5540, "text": "I actually first heard about the idea of this kind of automation, at least in sketched out form in like 2011, I guess it was with Peloton, which was this sort of early technology entrant into the trucking industry, which was working on platooning trucks."}, {"time": 5559, "text": "And all they were doing was, you know, a cooperative adaptive cruise control as they came to call it."}, {"time": 5565, "text": "And we ended up on a panel together."}, {"time": 5568, "text": "And it's kind of interesting because I was on that panel because I was thinking about how we got the best return on investment for fuel efficient technologies."}, {"time": 5578, "text": "And if it's cool, I'll sort of set this up because it does, it comes into sort of the story of some of these scenarios."}, {"time": 5585, "text": "So when I studied the drivers, you had this like complete difference in the driving tasks, like we were talking about before with long haul and city, right?"}, {"time": 5598, "text": "And you're not paid in the city, you've got congestion, the turns are tight."}, {"time": 5605, "text": "There's lots of, you know, pedestrians, you know, all the things that self driving trucks don't like, truckers don't like, right?"}, {"time": 5611, "text": "And they're not paid, there's lots of waiting time."}, {"time": 5615, "text": "And then in the highway, they get to cruise, they're getting paid, they have control, they go at their own pace, they're making money, they're happy."}, {"time": 5623, "text": "Well, it turned out, I guess it was around 2010, this is still when we were thinking about regenerative braking, you know, and hybrid trucks being sort of like the solution."}, {"time": 5633, "text": "The problems with them sort of, and the advantages, you know, also split on what I was thinking of as kind of the rural urban divide at that time, right?"}, {"time": 5641, "text": "So, like you got the regenerative braking, right?"}, {"time": 5645, "text": "You can make the truck lighter, you can keep it local, right?"}, {"time": 5648, "text": "You don't get any benefit from that, you know, hybrid electric on the rural highway, you want aerodynamics, right?"}, {"time": 5657, "text": "There, you want low rolling resistance tires and these super aerodynamic sleek trucks, right?"}, {"time": 5663, "text": "Where we know with off the shelf technology today, we could double the fuel economy, more than double the fuel economy of the typical truck in that highway segment, if we segmented the duty cycle, right?"}, {"time": 5674, "text": "And so in the urban environment, you want a clean burning truck, so you're not giving kids asthma, you want it lighter, so it's not destroying those less strong pavements, right?"}, {"time": 5685, "text": "You're not, you can make tighter turns, you don't need a sleeper cab, because the driver, you know, hopefully is getting home at night, right?"}, {"time": 5691, "text": "In the long haul, you want that super aerodynamic stuff."}, {"time": 5694, "text": "Now that doesn't get you anything in the city, and in fact, it causes all kinds of problems, because you turn too tight, you crunch up all the aerodynamics that connect the tractor and the trailer."}, {"time": 5702, "text": "So the idea that I had was like, okay, what if we deliberately segmented it?"}, {"time": 5708, "text": "Like, what if we created these droplets outside cities, where, you know, a local city driver who's paid by the hour kind of runs these trailers out once they're loaded, you know, doesn't sit there and wait while it's being loaded, they drop off a trailer, they go pick up one that's loaded, they run it out, when it's loaded, they call them, and they just run them out there and stage them."}, {"time": 5727, "text": "It's like an Uber driver, but for truckloads."}, {"time": 5730, "text": "Yeah, and we have like intermodal."}, {"time": 5732, "text": "We have like, basically this would be the equivalent of like rail to truck intermodal, right?"}, {"time": 5737, "text": "So you put it on the rail, and then, you know, a trucker picks it up and delivers it, right?"}, {"time": 5740, "text": "So instead of having the rail, you'd have these super aerodynamic, hopefully platoons, or what at the time was called long combination vehicles, which is basically two trailers connected together, right?"}, {"time": 5751, "text": "Because this is like a huge productivity gain, right?"}, {"time": 5754, "text": "And then instead of that driver like me, I would pick up something in upstate New York, drive to Michigan, drive to Alabama, you know, drive to Wisconsin, drive to Florida, you know, I'd get home every two weeks."}, {"time": 5763, "text": "If I'm just running that, you know, that double trailer, I might be able to go back and forth from Chicago to Detroit, right?"}, {"time": 5771, "text": "Take two trailers there, pick up two trailers going back, right, and be home every night."}, {"time": 5776, "text": "Now, the problem with that at the time, or one of them was, you know, bridge weights."}, {"time": 5780, "text": "So you can't, not all bridges can handle that much weight on them."}, {"time": 5785, "text": "They can't handle these doubles, right?"}, {"time": 5786, "text": "And some places can, some places can't."}, {"time": 5788, "text": "And so this platooning idea was happening at the same time, and we ended up on the same panel, and the founders were like, hey, so what's it like to follow really close behind another truck?"}, {"time": 5799, "text": "Which was kind of the stage that they were at was like, you know, what's that experience gonna be like?"}, {"time": 5803, "text": "And I was like, truckers aren't gonna like it, you know?"}, {"time": 5806, "text": "I mean, that's just like the cardinal rule is following distance."}, {"time": 5809, "text": "Like that's the one you really shouldn't violate, right?"}, {"time": 5812, "text": "And when you're out on the road, like you have that trucker like right on your ass, you know, people remember that."}, {"time": 5818, "text": "They don't remember the 99.9% of truckers that are not on their ass, you know?"}, {"time": 5823, "text": "Like they're very careful about that."}, {"time": 5825, "text": "But when the trucks are really close together, there's benefits in terms of aerodynamics."}, {"time": 5830, "text": "So that's the idea."}, {"time": 5831, "text": "So like if you want to get some benefits of a platoon, you want them to be close together, but you're saying that's very uncomfortable for truckers."}, {"time": 5840, "text": "Yeah, so I mean, I think that ended up at the, I mean, Peloton I think is sort of winding down their work on this."}, {"time": 5847, "text": "And I think that ended up being still an open question."}, {"time": 5851, "text": "Like, and I had a chance to interview a couple drivers who at least one, maybe two of which had actually driven in their platoons."}, {"time": 5858, "text": "And I got completely different experiences."}, {"time": 5861, "text": "Some of them were like, it's really cool."}, {"time": 5863, "text": "You know, I'm like in communication with that other driver."}, {"time": 5866, "text": "You know, I can see on a screen what's out, you know, the front of his truck."}, {"time": 5871, "text": "And then some were like, it's too close."}, {"time": 5873, "text": "And it might be one of those things that's just, you know, it takes an adjustment to sort of get there."}, {"time": 5877, "text": "So you get the aerodynamic advantage, which, you know, saves fuel."}, {"time": 5881, "text": "There's some problems though, right?"}, {"time": 5883, "text": "So, you know, you're getting that aerodynamic advantage because there's a low pressure system in front of that following truck."}, {"time": 5890, "text": "But the engine is designed with higher pressure feeding that engine, right?"}, {"time": 5895, "text": "So there are sort of adjustments that you need to make and, you know, still the benefits are there."}, {"time": 5901, "text": "That's one scenario."}, {"time": 5902, "text": "And that's just the automation of that acceleration and braking."}, {"time": 5906, "text": "Starsky, which, you know, probably a lot of your listeners heard about, was working on another scenario, which was, you know, to solve that local problem was gonna do teleoperation, right?"}, {"time": 5920, "text": "Sort of remote piloting."}, {"time": 5922, "text": "I had the chance to, you know, sort of watch them do that."}, {"time": 5926, "text": "You know, they drove a truck in Florida from San Francisco in one of their offices."}, {"time": 5933, "text": "That was really interesting."}, {"time": 5935, "text": "In case it's not clear, teleoperation means you're controlling the truck remotely, like it's a video game."}, {"time": 5941, "text": "So you've gotten the chance to witness it."}, {"time": 5945, "text": "Does it actually work?"}, {"time": 5946, "text": "Yeah, I mean, so it's a... What are the pros and cons?"}, {"time": 5950, "text": "You know, one of the problems with doing research like this with all these Silicon Valley folks is the NDAs."}, {"time": 5957, "text": "So, you know, I don't know what I'm able to say about sort of watching it, but obviously they're public statements about sort of what the challenges are, right?"}, {"time": 5965, "text": "And it's about the latency and the ability to sort of in real time."}, {"time": 5971, "text": "There's challenges there."}, {"time": 5972, "text": "Let me say one thing."}, {"time": 5973, "text": "So I'm talking to the... You know, I've talked to the Waymo CTO."}, {"time": 5978, "text": "I'm in conversations with them."}, {"time": 5979, "text": "I'm talking to the head of trucking, Boris Softman, in next month, actually."}, {"time": 5985, "text": "I'm a huge fan of his because he was, I think the founder of Anki, which is a toy robotics company."}, {"time": 5992, "text": "So I love human robot interaction."}, {"time": 5995, "text": "And he created one of the most effective and beautiful toy robots."}, {"time": 6003, "text": "Anyway, I keep complaining to them on email privately that there's way too much marketing in these conversations and not enough showing off both the challenge and the beauty of the engineering efforts."}, {"time": 6016, "text": "And that seems to be the case for a lot of these Silicon Valley tech companies."}, {"time": 6021, "text": "They put up this, you're talking about NDAs."}, {"time": 6026, "text": "For some reason, rightfully or wrongfully, because there's been so much hype and so much money being made, they don't see the upside in being transparent and educating the public about how difficult the problem is."}, {"time": 6043, "text": "It's much more effective for them to say, we have everything solved."}, {"time": 6046, "text": "This will change everything."}, {"time": 6047, "text": "This will change society as we know it."}, {"time": 6049, "text": "And just kind of wave their hands as opposed to exploring together like these different scenarios."}, {"time": 6054, "text": "What are the pros and cons?"}, {"time": 6055, "text": "Why is it really difficult?"}, {"time": 6057, "text": "You know, what are the gray areas of where it works and doesn't?"}, {"time": 6061, "text": "What's the role of the human in this picture of the both sort of the operators and the other humans on the road?"}, {"time": 6068, "text": "All of that, which are fascinating human problems, fascinating engineering problems that I wish we could have a conversation about as opposed to always feeling like it's just marketing talk."}, {"time": 6079, "text": "Because a lot of what we're talking about now, even you with having private conversations under NDA, you still don't have the full picture of everything, of how difficult this problem is."}, {"time": 6091, "text": "One of the big questions I've had, still have is how difficult is driving?"}, {"time": 6097, "text": "I disagree with Elon Musk and Jim Keller on this point."}, {"time": 6101, "text": "I have a sense that driving is really difficult."}, {"time": 6105, "text": "You know, the task of driving, just broadly."}, {"time": 6107, "text": "This is like philosophy talk."}, {"time": 6109, "text": "How much intelligence is required to drive a car?"}, {"time": 6115, "text": "So from like a Jim Keller, who used to be the head of autopilot, the idea is that it's just a collision avoidance problem."}, {"time": 6123, "text": "It's like billiard balls."}, {"time": 6125, "text": "It's like you have to convert the drive."}, {"time": 6126, "text": "You have to do some basic perception, a computer vision to convert driving into a game of pool."}, {"time": 6133, "text": "And then you just have to get everything into a pocket."}, {"time": 6135, "text": "To me, there just seems to be some game theoretic dance combined with the fact that people's life is at stake."}, {"time": 6141, "text": "And then when people die at the hands of a robot, the reaction is going to be much more complicated."}, {"time": 6146, "text": "So all of that, but that's still an open question."}, {"time": 6148, "text": "And the cool thing is all of these companies are struggling with this question of how difficult is it to solve this problem sufficiently such that we can build a business on top of it and have a product that's going to make a huge amount of money and compete with the manually driven vehicles."}, {"time": 6166, "text": "And so their teleoperation from Starsky's is really interesting idea."}, {"time": 6170, "text": "How much can, I mean, there's a few autonomous vehicle companies that tried to integrate teleoperation in the picture."}, {"time": 6179, "text": "Can we reduce some of the costs while still having reliability, like catch when the vehicle fails by having teleoperation?"}, {"time": 6193, "text": "So that's for you scenario number two is to use teleoperation as part of the picture."}, {"time": 6200, "text": "Yeah, let me follow up on that question of how hard driving is, because this becomes a big question for researchers who are thinking about labor market impacts, because we start from a perspective of what's hard or easy for humans."}, {"time": 6214, "text": "And so if you were to look at truck driving prior to a lot, I mean, there's been a lot of thinking and debate in academic research circles around sort of how you estimate labor impacts, what these models look like."}, {"time": 6229, "text": "And a lot of it is about how automatable is a job, object recognition, really easy for people, right?"}, {"time": 6234, "text": "Really hard for computers."}, {"time": 6236, "text": "And so there's a whole bunch of things that truck drivers do that we see as super easy and as it would have been characterized 10 years ago, routine, and it's not for a computer, right?"}, {"time": 6250, "text": "It turns out to be something that we do naturally that is sort of cutting edge, right?"}, {"time": 6256, "text": "Computer science."}, {"time": 6257, "text": "So on the teleoperation question, I think this is a more interesting one than people would like to sort of let on, I think, publicly."}, {"time": 6269, "text": "There are gonna be problems, right?"}, {"time": 6272, "text": "And this is one of the complexities of sort of putting these things out in the world."}, {"time": 6275, "text": "And if you see the real world of trucking, you realize, wow, it's rough."}, {"time": 6280, "text": "There are dirt lots, there's gravel, there's salt and ice and cold weather, and there's equipment that just gets left out in the middle of nowhere, and the brakes don't get maintained, and somebody was supposed to service something and they didn't, you know?"}, {"time": 6293, "text": "And so you imagine, okay, we've got this vehicle that can drive itself, which is gonna require a whole lot of sensors to tell it that the doors are still closed and the trailer's still hooked up and each of the tires has adequate pressure, and any number of, probably hundreds of sensors that are gonna be sort of relaying information."}, {"time": 6311, "text": "And one of them, after 500,000 miles or whatever, it goes out."}, {"time": 6317, "text": "Now, do we have some fleet of technicians sort of continually cruising the highways and sort of servicing these things as they do what?"}, {"time": 6325, "text": "Pull themselves off to the side of the road and say, I've got a sensor fault, I'm pulling over, or maybe there's some level of safety critical faults or whatever it might be."}, {"time": 6336, "text": "So that suggests that there might be a role for teleoperation even with self driving."}, {"time": 6343, "text": "And when I push people on it in the conversations, they all are like, yeah, we kind of have that on the bottom of the list, figure out how to rescue truck, you know?"}, {"time": 6354, "text": "I guess on the to do list, right?"}, {"time": 6356, "text": "After solving the self driving question is like, yeah, what do we do with the problems, right?"}, {"time": 6362, "text": "I mean, no, we could imagine like, all right, we have some protocol that the truck is not, realizes the system says not safe for operation, pull to the side."}, {"time": 6373, "text": "Good, you have a crash, but now you got a truck stranded on the side of the road."}, {"time": 6377, "text": "You're gonna send out somebody to like calibrate things and check out what's going on, or that sounds like expensive labor, it sounds like downtime, it sounds like the kind of things that shippers don't like to happen to their freight, you know, in a just in time world."}, {"time": 6390, "text": "And so wouldn't it be great if you could just sort of, you know, loop your way into the controls of that truck and say, all right, we've got a sensor out, says that the tire is bad, but I can see visually from the camera, looks fine, I'm gonna drive it to our next depot, you know, maybe the next rider or Penske location, right?"}, {"time": 6408, "text": "Sort of all these service locations around and have a technician take a look at it."}, {"time": 6412, "text": "So teleoperation often gets this, you know, so dismissive, you know, commentary from other folks working on other scenarios."}, {"time": 6424, "text": "But I think it's potentially more relevant than we hear publicly."}, {"time": 6429, "text": "But it's a hard problem."}, {"time": 6431, "text": "And, you know, for me, I've gotten a chance to interact with people that take on hard problems and solve them and they're rare."}, {"time": 6441, "text": "What Tesla has done with their data engine."}, {"time": 6445, "text": "So I thought autonomous driving cannot be solved without collecting a huge amount of data and organizing it well, not just collecting, but organizing it."}, {"time": 6454, "text": "And exactly what Tesla is doing now is what I thought it would be, like I couldn't see car companies doing that, including Tesla."}, {"time": 6462, "text": "And now that they're doing that, it's like, oh, okay."}, {"time": 6464, "text": "So it's possible to take on this huge effort seriously."}, {"time": 6468, "text": "To me, teleoperation is another huge effort like that."}, {"time": 6471, "text": "It's like taking seriously what happens when it fails."}, {"time": 6476, "text": "What's the, in the case of Waymo for the consumer, like ride sharing, what's the customer experience like?"}, {"time": 6484, "text": "There's a bunch of videos online now where people are like the car fails and it pulls off to the side and you call like customer service and you're basically sitting there for a long time and there's confusion."}, {"time": 6495, "text": "And then there's a rescue that comes and they start to drive."}, {"time": 6497, "text": "I mean, just the whole experience is a mess that has a ripple effect to how you trust in the entirety of the experience."}, {"time": 6505, "text": "But like actually taking on the problem of that failure case and revolutionizing that experience, both for trucking and for ride sharing, that's an amazing opportunity there because that feels like it would change everything."}, {"time": 6520, "text": "If you can reliably know when the failures happen, which they will, you have a clear plan that doesn't significantly affect the efficiency of the whole process, that could be the game changer."}, {"time": 6531, "text": "And if teleoperation is part of that, it could be just like you're saying, it could be teleoperation or it could be like a fleet of rescuers that can come in, which is a similar idea."}, {"time": 6541, "text": "But teleoperation, obviously that allows you to just have a network of monitors of people monitoring this giant fleet of trucks and taking over when needed."}, {"time": 6552, "text": "And it's a beautiful vision of the future where there's millions of robots and only thousands of humans monitoring those millions of robots."}, {"time": 6562, "text": "That seems like a perfect dance of allowing humans to do what they do best and allowing robots to do what they do best."}, {"time": 6571, "text": "Yeah, yeah, so I mean, I think there are, and we just applied for an NSF we didn't get, anybody's watching, but with some folks from Wisconsin who do teleoperation, right?"}, {"time": 6583, "text": "And some of this is used for like rovers and I mean, really high stakes, difficult problems."}, {"time": 6590, "text": "But one of the things we wanted to study were these mines, these Rio Tinto mines in Australia where they remotely pilot the trucks."}, {"time": 6599, "text": "And there's some autonomy, I guess, but it's overseen by a remote operator and it's near Perth and it's quite remote and they retrained the truck drivers to be the remote operators, right?"}, {"time": 6615, "text": "There's autonomy in the port of Rotterdam and places like that where there are jobs there."}, {"time": 6621, "text": "And so I think, and maybe we'll get to this later, but there's a real policy question about sort of who's gonna lose and what we do about it and whether or not there are opportunities there that maybe we need to put our thumb on the scale a little bit to make sure that there's some give back to the community that's taking the hit."}, {"time": 6641, "text": "So for instance, if there were teleoperation centers, maybe they go in these communities that we disproportionately source truck drivers from today."}, {"time": 6650, "text": "Now, I mean, what does that mean?"}, {"time": 6652, "text": "It may not be the cheapest place to do it if they don't have great connectivity and it may not be where the upper level managers wanna be and places like that, issues like that, right?"}, {"time": 6661, "text": "So I do think it's an interesting question, both from sort of a practical scenario situation of how it's gonna work, but also from a policy perspective."}, {"time": 6673, "text": "So there's platoons, there's teleoperation, and this is taking care of some of the highway driving that we're talking about."}, {"time": 6681, "text": "Is there other ideas like, is there other ideas, scenarios that you have for autonomous trucks?"}, {"time": 6688, "text": "Yeah, so I mean, the most obvious one actually is just facility to facility, right?"}, {"time": 6694, "text": "The sort of, it can't go everywhere, but a lot of logistics facilities are very close to interstates and they're on big commercial roads without bikes and parked cars and all that stuff."}, {"time": 6708, "text": "And some of the jobs that I think are really first on the chopping block are these LTL, that less than truckload, what's called line haul, right?"}, {"time": 6717, "text": "So these are the drivers who go from terminal to terminal with those full trailers."}, {"time": 6722, "text": "And those facilities are often located strategically to avoid congestion, right?"}, {"time": 6727, "text": "And to be in big industrial facilities."}, {"time": 6730, "text": "So you could imagine that being the first place you see a Waymo self driving truck rollout might be sort of direct facility to facility for UPS or FedEx or less than truckload care."}, {"time": 6745, "text": "And the idea there is fully driverless, so potentially not even a driver in the truck, it's just going from facility to facility empty, zero occupancy."}, {"time": 6754, "text": "Yeah, and those, because that labor is expensive, they don't keep those drivers out overnight, those drivers do a run back and forth typically, or in a team go back and forth in one day."}, {"time": 6767, "text": "So from the people you've spoken with so far, what's your sense?"}, {"time": 6770, "text": "How far are we away from, which scenario is closest and how far away are we from that scenario of autonomy being a big part of our trucking fleet?"}, {"time": 6782, "text": "Most folks are focused on another scenario, which is the exit to exit, right?"}, {"time": 6787, "text": "Which looks like that urban truck ports thing that I laid out earlier."}, {"time": 6792, "text": "So you have a human driven truck that comes out to a drop lot, it meets up with an autonomous truck, that truck then drives it on the interstate to another lot, and then a human driver picks it up."}, {"time": 6807, "text": "There are a couple variations maybe on that."}, {"time": 6812, "text": "So, or let me just run through the last two scenarios."}, {"time": 6847, "text": "And so you have a self driving truck that's not driverless, right?"}, {"time": 6851, "text": "And just to clarify, because Tesla uses the term autopilot instead of airplanes, and so everybody uses the word autopilot, we're referring to essentially full autonomy, but because it's exit to exit, the truck driver is onboard the truck, but they're sleeping in the back or whatever."}, {"time": 6866, "text": "Yeah, and this gets to the really weedy policy questions, right?"}, {"time": 6871, "text": "So basically for the Department of Transportation, for you to be off duty for safety reasons, you have to be completely relieved of all responsibility."}, {"time": 6879, "text": "So that truck has to not encounter a construction site or inclement weather or whatever it might be, and call to you and say, hey, you know, or I mean, obviously, right, we're imagining connected vehicles as well, right?"}, {"time": 6893, "text": "So you're in a self driving truck, you're in the back and trucks 20 miles ahead experience some problem, right?"}, {"time": 6901, "text": "That may require teleoperation or whatever it is, right?"}, {"time": 6904, "text": "And it signals to your truck, hey, you know, tell the driver 20 miles ahead, he's got to hop in the seat."}, {"time": 6910, "text": "That would mean that they're on duty according to the way that the current rules are written, they have some responsibility."}, {"time": 6915, "text": "And part of that is, you know, we need them to get rest, right?"}, {"time": 6919, "text": "They need to have uninterrupted sleep."}, {"time": 6922, "text": "So that's what I call autopilot."}, {"time": 6925, "text": "The final scenario is one that I thought was actually the one scenario that was good for labor, you know, which I proposed is I was like, well, here's an idea, you know, that would be like, actually good for workers."}, {"time": 6941, "text": "And just another brief aside here."}, {"time": 6946, "text": "The history of trucking over the last, you know, 40 years, there's been a lot of technological change."}, {"time": 6972, "text": "You've probably seen that on YouTube, if not, you know, check it out, you know, truck can opener."}, {"time": 6978, "text": "You know, there's some bridges that are famous for it, right, and there's one I think called the can opener and you can find on YouTube."}, {"time": 6986, "text": "And, you know, you had to log those hours like manually and sort of do the math and plan your work routine."}, {"time": 6994, "text": "And I would do this every day."}, {"time": 6995, "text": "I'd say like, okay, I'm gonna get up at five."}, {"time": 6997, "text": "I've got to think about Buffalo and there's traffic there."}, {"time": 7000, "text": "So I wanna be through Buffalo by 6.30, you know, and then that'll put me, you know, in Cleveland at, you know, 9.30, which means I'll miss that rush hour, right, which is gonna put me in Chicago, you know, and so you do this and now today, you know, 15 years later, truck drivers don't have to do any of that."}, {"time": 7021, "text": "You know, you don't have to shift the truck, you don't have to map, you know, you can figure out the least congested route to go on and your hours of service are recorded or a good portion of them are reported automatically."}, {"time": 7037, "text": "All of that has been a substantial de skilling that has, you know, put downward pressure on wages and allowed companies to kind of speed up, monitor and direct, I mean, the key technology, you know, that I did work under is satellite linked computers."}, {"time": 7052, "text": "So before you could kind of go out and plan your own work and the boss really couldn't see what you were doing and push you and say, you know, you've been on break for 10 hours, why aren't you moving?"}, {"time": 7061, "text": "You know, and you might tell them, you know, cause I'm tired, you know, like I didn't sleep well, I've got to get a couple more hours, you know, they're only gonna accept that so many times or at least some of those dispatchers are."}, {"time": 7071, "text": "So all this technology has made the job sort of, you know, de skilled the job, you know, hurt drivers in the labor market, made the work worse."}, {"time": 7081, "text": "So I think the burden it's really on the technologists who are like, oh, this will make truck driver jobs better and sort of envision ways that it would."}, {"time": 7091, "text": "It's like, the burden's really, a proof is really on you to sort of really clearly lay out what that is gonna look like because it's 30 or 40 years of history suggests that that technology into labor markets where workers are really weak and cheap is what wins that new technology doesn't help workers or raise their wages."}, {"time": 7113, "text": "So it lowers the bar of entry in terms of skill."}, {"time": 7118, "text": "So that's really, that's tough."}, {"time": 7123, "text": "That's tough to know what to do with because yeah, from a technology perspective, you wanna make the life of the people doing the job today easier."}, {"time": 7132, "text": "Is that what you want?"}, {"time": 7134, "text": "No, but that like, when you think about like what exactly, because the reality is you will make their life potentially a little bit easier, but that will allow the companies to then hire people that are less skilled, get those people that were previously working there fired or lower wages."}, {"time": 7153, "text": "And so the result of this easier is a lower quality of life."}, {"time": 7160, "text": "That's dark actually."}, {"time": 7163, "text": "But you were saying that was for you initially the hopeful."}, {"time": 7167, "text": "Oh no, so I'll get to that."}, {"time": 7168, "text": "But one more thing, cause this is not stopping."}, {"time": 7171, "text": "And this is another interesting question about the sort of automation."}, {"time": 7174, "text": "And I think Uber is an interesting example here where it's like, okay, if we had self driving trucks or self driving cars, we could automate what used to be taxi service."}, {"time": 7186, "text": "There's a whole bunch of stuff that's already been automated, like the dispatching."}, {"time": 7189, "text": "So the dispatchers are already out of work in rideshare and the payment is already automated."}, {"time": 7195, "text": "So you have to automate steps like this."}, {"time": 7197, "text": "So you have to have that initial link to dispatch the truck."}, {"time": 7200, "text": "You have to have the automated mapping."}, {"time": 7204, "text": "So we're sort of done all this incremental automation that could make the truck completely driverless."}, {"time": 7211, "text": "There's some important things happening right now with the remaining good jobs."}, {"time": 7215, "text": "So what you're really paying for when you get a good truck driver is, like I said, you get those kind of local skills of like backing and congested traffic."}, {"time": 7226, "text": "Those, it's really impressive to watch and there's some value on it certainly, but it's relatively low value in the actual driving technique, right?"}, {"time": 7235, "text": "So you bump something backing into the dock, it might be a couple of thousand dollars because you ruin a canopy or something over a dock or tear up a trailer."}, {"time": 7245, "text": "What you really want, those highly skilled conscientious drivers, and that's really what it is."}, {"time": 7252, "text": "And that's what computers are really good at is about being conscientious, right?"}, {"time": 7255, "text": "In the sense of like, they pay attention continually, right?"}, {"time": 7259, "text": "And how I was describing those long haul segments where the driver just keeps out of the situations that could become problematic and just, they don't look at their phone."}, {"time": 7270, "text": "I mean, they take the job seriously and they're safe and you can give somebody a skills test, right?"}, {"time": 7276, "text": "As a CDL examiner, you could take them out and say, all right, I need you to go around these cones and drive safely through this school zone."}, {"time": 7284, "text": "But what really proves that you're a safe driver is two years without an accident, right?"}, {"time": 7289, "text": "Because that means that day after day, hour after hour, mile after mile, you did the right thing, right?"}, {"time": 7296, "text": "And not when it was like, oh, some situations emerging, but just consistently over time kept yourself out of accident situations."}, {"time": 7303, "text": "And you can see this with drivers who are a million or 2 million safe miles."}, {"time": 7307, "text": "The value of those drivers for Walmart is they don't run over minivans."}, {"time": 7312, "text": "The company I worked for, they ran over minivans on a regular basis."}, {"time": 7317, "text": "So when I was trained, they said, we kill 20 people a year."}, {"time": 7323, "text": "We send someone to the funeral, there's a big check involved, don't be that."}, {"time": 7328, "text": "We don't wanna go to your funeral and you don't wanna be the person who caused that funeral."}, {"time": 7335, "text": "Okay, so they just write that off."}, {"time": 7338, "text": "Okay, that's just part of the business model."}, {"time": 7340, "text": "Now, forward collision avoidance can basically eliminate the vast majority of those accidents."}, {"time": 7350, "text": "That's what the value of a really expensive conscientious driver is based on."}, {"time": 7355, "text": "They don't run over minivans."}, {"time": 7357, "text": "So as soon as you have that forward collision avoidance, what's gonna happen to the wages of those drivers?"}, {"time": 7363, "text": "By way of a therapy session, help me understand, is a collision avoidance, automated collision avoidance systems, are they good or bad for society?"}, {"time": 7377, "text": "Yeah, I mean, this is, they're good."}, {"time": 7383, "text": "But what do we do about the pain of a workforce in the short term because their wages are gonna go down because the job starts requiring less and less skill?"}, {"time": 7398, "text": "Is there a hopeful message here where other jobs are created?"}, {"time": 7402, "text": "So I'm a sociologist, right?"}, {"time": 7404, "text": "So I'm gonna think about what's the structure behind that that creates that pain, right?"}, {"time": 7410, "text": "And it's ownership, right?"}, {"time": 7412, "text": "We don't call it capitalism for nothing."}, {"time": 7415, "text": "What capitalists do is they figure out cheaper, more efficient ways to do stuff."}, {"time": 7420, "text": "And they use technology to do that oftentimes, right?"}, {"time": 7423, "text": "This is the remarkable history of the last couple centuries and all the productivity gains is, people who were in a competitive market saying, if I have to do it, right?"}, {"time": 7436, "text": "I don't have a choice."}, {"time": 7437, "text": "Cause like my competitor over there is gonna eat my lunch if I'm not on my game."}, {"time": 7444, "text": "I've got to invest in this technology to make it more efficient, to make it cheaper."}, {"time": 7450, "text": "And what do you look for?"}, {"time": 7452, "text": "You look for oftentimes, you look for labor costs, right?"}, {"time": 7456, "text": "You look for high value labor."}, {"time": 7457, "text": "If I can take a hundred and, a lot of these truck drivers make good money, a hundred thousand dollars, good benefits, vacation, retirement."}, {"time": 7465, "text": "If I can replace them with a $35,000 worker when I'm competing with maybe a low wage retail employer rather than some other more expensive employers for skilled blue collar workers, I'm gonna do that."}, {"time": 7479, "text": "And that's just, that's what we do."}, {"time": 7481, "text": "And so I think those are the bigger questions around this technology, right?"}, {"time": 7486, "text": "Is like, are workers gonna get screwed by this?"}, {"time": 7490, "text": "Like, yeah, most likely."}, {"time": 7491, "text": "Like that's what we do."}, {"time": 7494, "text": "So one of the things you say is, I mean, first of all, the numbers of workers that will feel this pain is not perhaps as large as the journalists kind of articulate, but nevertheless, the pain is real."}, {"time": 7505, "text": "And I guess my question here is, do you have an optimistic vision about the transformative effects of autonomous trucks on society?"}, {"time": 7517, "text": "Like if you look 20 years from now and perhaps see maybe 30 years from now, perhaps see these autonomous trucks doing the various parts of the scenarios you listed."}, {"time": 7530, "text": "And there's just hundreds of thousands of them, just like veins, like blood flowing through veins on the interstate system."}, {"time": 7543, "text": "What kind of world do you see that's a better world than today that involves such trucks?"}, {"time": 7548, "text": "Yeah, can I defend myself first?"}, {"time": 7551, "text": "Because I'm reading the comments right now of people, of the economists who are telling me."}, {"time": 7556, "text": "Another commenter, dear PhD in economics."}, {"time": 7559, "text": "Yes, yes, dear PhD in economics, I know that higher skilled jobs are created by technological advancement, right?"}, {"time": 7569, "text": "I mean, there are big questions about how many of them, right, so the idea that we would create more expensive labor positions, right, with a new technology, right?"}, {"time": 7580, "text": "You better check your business plan if your idea is to take a bunch of low wage labor and replace it with the same amount of high wage labor, right, so there's a question about how many of those jobs."}, {"time": 7591, "text": "And there's the really important social and political question of are they the same people, right?"}, {"time": 7598, "text": "And do they live in the same places?"}, {"time": 7599, "text": "And I think that kind of geography is a huge issue here with the impacts, right?"}, {"time": 7605, "text": "Lots of rural workers."}, {"time": 7607, "text": "Interesting politically, lots of red state workers, right?"}, {"time": 7610, "text": "Lots of blue state, maybe union folks who are gonna try to slow autonomy and lots of red state representatives in the house maybe who wanna stand up for their trucker constituents."}, {"time": 7621, "text": "So just to defend myself."}, {"time": 7623, "text": "Yeah, and to elaborate, I think economics as a field is not good at measuring the landscape of human pain and suffering."}, {"time": 7630, "text": "So sometimes you can forget in the numbers that it's real lives that are at stake."}, {"time": 7635, "text": "That's what I suppose sociology is better at doing."}, {"time": 7638, "text": "So we try sometimes, sometimes."}, {"time": 7640, "text": "Well, the problem with, I mean, I'm somebody who loves psychology and psychiatry and a little bit, I guess, of sociology."}, {"time": 7648, "text": "I realize how little, how tragically flawed the field is, not because of lack of trying, but just how difficult the problems are."}, {"time": 7657, "text": "To do really thorough studies that understand the fundamentals of human behavior and this, yes, landscape of human suffering, it's almost an impossible task without the data."}, {"time": 7668, "text": "And we currently don't, not everybody's richly integrated to where they're fully connected and all their information is being recorded for sociologists to study."}, {"time": 7680, "text": "So you have to make a lot of inferences."}, {"time": 7682, "text": "You have to talk to people."}, {"time": 7683, "text": "You have to do the interviews as you're doing."}, {"time": 7685, "text": "And through that really difficult work, try to understand, hear the music that nobody else is hearing, the music of what people are feeling, their hopes, their dreams, and the crushing of their dreams due to some kind of economic forces."}, {"time": 7702, "text": "Yeah, I mean, we've just lived that for four and a half years of probably elites, let me just go out on a limb and say, not understanding the sort of emotional and psychological currents of a large portion of the population, right?"}, {"time": 7717, "text": "And just being stunned by it and confused, right?"}, {"time": 7721, "text": "It wasn't confusing for me after having talked to truckers."}, {"time": 7726, "text": "Again, trucking is a job of last resort."}, {"time": 7728, "text": "These are people who've already lost that manufacturing job oftentimes, already lost that construction job to just aging, right?"}, {"time": 7737, "text": "So what can we do, right?"}, {"time": 7739, "text": "What's sort of the positive vision?"}, {"time": 7741, "text": "Because like, we've got tons of highway deaths."}, {"time": 7744, "text": "We've got, and just the big picture is, and this is the opportunity, I guess, for investors, it's a hugely inefficient system."}, {"time": 7755, "text": "So we buy this truck, there's this low wage worker in it oftentimes."}, {"time": 7759, "text": "And again, I'm setting aside those really good line haul jobs in LTL, those are a different case."}, {"time": 7766, "text": "That low wage worker is driving a truck that they might, the wheels might roll seven to eight hours a day."}, {"time": 7772, "text": "That's what the truck is designed to do and that's what makes the money for the company."}, {"time": 7776, "text": "In other seven, eight hours a day, the driver's doing other kinds of work that is not driving."}, {"time": 7781, "text": "And then the rest of the day, they're basically living out of the truck."}, {"time": 7785, "text": "You really can't find a more inefficient use of an asset than that, right?"}, {"time": 7791, "text": "Now, a big part of that is we pay for the roads and we pay for the rest areas and all this other stuff."}, {"time": 7795, "text": "So the way that I work and the way that I think about these problems is I try to find analogies, right?"}, {"time": 7801, "text": "Sort of labor processes and things that make economic sense that seem in the same area of the economy, but have some different characteristics for workers, right?"}, {"time": 7815, "text": "And sort of try to figure out why does the economics work there, right?"}, {"time": 7819, "text": "And so if you look at those really good jobs, the most likely way that you as a passenger car driver would know that it's one of those drivers is that there are multiple trailers, right?"}, {"time": 7833, "text": "So you see these, like maybe it's three small trailers, maybe it's two sort of medium sized trailers."}, {"time": 7837, "text": "Some places you might even see two really big trailers together."}, {"time": 7842, "text": "You do that because labor is expensive, right?"}, {"time": 7844, "text": "And it's highly skilled."}, {"time": 7845, "text": "And so you use it efficiently and you say, all right, rather than having you haul that little trailer out of the ports, that sort of half size container, we're gonna wait till we get three or we're gonna coordinate the movement so that they're three ready."}, {"time": 7857, "text": "You go do what truckers call make a set, put them together, right, and you go."}, {"time": 7864, "text": "That's a massive productivity gain, right?"}, {"time": 7866, "text": "Because you're hauling two, three times as much freight."}, {"time": 7869, "text": "So the positive scenario that I threw out in 2018 was why not have a human driven truck with a self driving truck that follows it, right?"}, {"time": 7880, "text": "Just a drone unit."}, {"time": 7883, "text": "And to me, this seemed as a non computer scientist, a non computer scientist, a sociologist, right?"}, {"time": 7891, "text": "This made a lot of sense because when I got done talking to the computer scientists and the engineers, they were like, well, it's like object recognition, decision making algorithm, all this stuff."}, {"time": 7900, "text": "It's like, all right, so why don't you leave the human brain in the lead vehicle, right?"}, {"time": 7906, "text": "You got all that processing and then all that following."}, {"time": 7910, "text": "Now, again, this is sort of me being a lay person."}, {"time": 7914, "text": "I said, why don't, then that following truck, right, makes direction from the front."}, {"time": 7918, "text": "It uses the rear of the trailer as a reference point."}, {"time": 7921, "text": "It maintains the lane."}, {"time": 7922, "text": "You've got cooperative adaptive cruise control and that you double the productivity of that driver."}, {"time": 7928, "text": "You solve that problem that I hated in my urban truck ports thing about the bridge weight."}, {"time": 7935, "text": "Cause when you get to the bridges, the two trucks can just spread out just enough to make the bridge weight, right?"}, {"time": 7941, "text": "And you can just program that in and they're 50 feet further apart, 100 feet further apart."}, {"time": 7948, "text": "So interesting sort of, I think, story about this that leads to kind of, I think, the policy questions."}, {"time": 7956, "text": "In, I guess, 2017, Jack Reed and Susan Collins and requested from the Senate, the Senate requested research on what the impacts of self driving trucks would be."}, {"time": 7968, "text": "And the first stage of that was for the GAO to do a report, sort of looking at the lay of the land, talking to some experts."}, {"time": 7979, "text": "And I was working on my 2018 report, help contribute to that GAO report."}, {"time": 7986, "text": "And I had the six scenarios, right?"}, {"time": 7988, "text": "I'm like, okay, here's what Starsky's doing."}, {"time": 7992, "text": "Here's what Embark and Uber are doing."}, {"time": 7996, "text": "Here's what Waymo might be doing."}, {"time": 7998, "text": "Nobody really knows, right?"}, {"time": 8000, "text": "Here's what Peloton's doing."}, {"time": 8003, "text": "Here's the autopilot scenario."}, {"time": 8005, "text": "And then here's this one that I think actually could be good for drivers."}, {"time": 8009, "text": "So now you've got that driver who's got two times the freight."}, {"time": 8014, "text": "Their decisions are more important."}, {"time": 8015, "text": "They're managing a more complex system, right?"}, {"time": 8017, "text": "They're probably gonna have to have some global understanding of how to, the environments in which it can operate safely, right?"}, {"time": 8022, "text": "Now we're talking upskilling, right?"}, {"time": 8024, "text": "And so the GAO sort of writes up these different scenarios and the idea is that it's gonna prepare for this Department of Transportation, Department of Labor set of processes to engage stakeholders and sort of get industry perspectives and then do a study on the labor impacts."}, {"time": 8047, "text": "So that DOT, DOL process starts to happen and I get to the workshop and a friend was sitting at the table next to me and he holds up the scenarios that they're gonna have us discuss at this workshop."}, {"time": 8064, "text": "And he's like, hey, these look really familiar, right?"}, {"time": 8067, "text": "They were the scenarios from the report, but there were only five instead of six."}, {"time": 8074, "text": "The sixth scenario, which was the upskilling labor, good for workers scenario, wasn't discussed."}, {"time": 8082, "text": "So to clarify that the integral piece of technology there is platooning."}, {"time": 8087, "text": "Yeah, I mean, in a sense it's platooning, but, and in fairness, right, as I pitched that idea or sort of ran that idea by the computer scientists and engineers and product managers that I would talk to, they would say, we thought about that, but that following truck, it's not that simple."}, {"time": 8109, "text": "That thing, basically we had to engineer that to be capable of independent self driving, because what if there was a cut in or any number of scenarios in which it lost that connection to the lead truck for whatever reason."}, {"time": 8125, "text": "Now, I mean, I don't know."}, {"time": 8126, "text": "Boo hoo, platooning is hard."}, {"time": 8129, "text": "There's edge cases."}, {"time": 8130, "text": "I guarantee the number of edge cases in platooning is orders of magnitude lower than the number of edge cases in the general solo full self drive."}, {"time": 8140, "text": "You do not need to solve the full self driving problem."}, {"time": 8143, "text": "I mean, if you're talking about probability of dangerous events, it just seems with platooning, then like you can deal with cut ins."}, {"time": 8154, "text": "Yeah, so this is beyond, this is one of the challenge obviously of being a researcher who doesn't really have any background in the technology, right?"}, {"time": 8164, "text": "So I can dream this up."}, {"time": 8165, "text": "I don't, you know, I have no idea if it's feasible."}, {"time": 8168, "text": "Well, let me speak, you spoke to the PhDs in economics."}, {"time": 8170, "text": "Let me speak to the PhDs in computer science."}, {"time": 8172, "text": "If you think platooning is as hard as the full self driving problem, we need to talk, because I think that's ridiculous."}, {"time": 8180, "text": "I think platooning, and in fact, I think platooning is an interesting idea for ride sharing as well, for the general autonomous driving problem, not just trucking, but obviously trucking is the big, big benefit, because the number of A to B points in trucking is much, much lower than the general ride sharing problem."}, {"time": 8198, "text": "But anyway, I think that's a great idea, but you're saying it was removed."}, {"time": 8202, "text": "Yeah, and so you can go, you know, and listeners could go to these reports."}, {"time": 8207, "text": "They're publicly available."}, {"time": 8208, "text": "And they explain why in the footnote."}, {"time": 8211, "text": "And they note that there was this other scenario suggested by at least me, and I can't remember if they said someone else did too."}, {"time": 8218, "text": "But they said, you know, we didn't include it because no developers were working on it."}, {"time": 8225, "text": "Full disclosure, that was the approach that I took in my research, right?"}, {"time": 8231, "text": "Which was to go to the developers and say, what's your vision, right?"}, {"time": 8234, "text": "What are you trying to develop?"}, {"time": 8237, "text": "That's what I was trying to do."}, {"time": 8239, "text": "And maybe, you know, and then I tried to think outside the box at the end by adding that one, right?"}, {"time": 8243, "text": "Like, here's one that I have, you know, people aren't talking about that could be cool."}, {"time": 8245, "text": "Now, again, it had been proposed in like 2014 for like fuel convoys."}, {"time": 8251, "text": "So you could just have like one super armored lead fuel truck, right?"}, {"time": 8255, "text": "In a, you know, bringing fuel to forward operating bases in Afghanistan."}, {"time": 8259, "text": "And then you wouldn't need, you know, the super heavy, you know, you wouldn't have to protect the human life in the following truck."}, {"time": 8264, "text": "You're saying like, when you talk to Waymo, when you talk to these kinds of companies, they weren't at least openly saying they're working on this."}, {"time": 8272, "text": "So then it doesn't make sense to include in the list."}, {"time": 8276, "text": "And so, but here's the thing, right?"}, {"time": 8278, "text": "This is the Department of Transportation, right?"}, {"time": 8281, "text": "And the Department of Labor."}, {"time": 8283, "text": "Maybe they could consider some scenarios."}, {"time": 8284, "text": "Like maybe we could say, you know, this, we, this technology has got a lot of potential."}, {"time": 8288, "text": "Here's what we'd like it to do."}, {"time": 8290, "text": "You know, we'd like it to reduce highway deaths, help us fight climate change, reduce congestion, you know, all these other, other things."}, {"time": 8296, "text": "But that's not how our policy conversation around technology is happening."}, {"time": 8300, "text": "We're not, and people don't think that we should."}, {"time": 8304, "text": "And I think that's the fundamental shift that we need to have, right?"}, {"time": 8307, "text": "I've been involved with this a little bit like NHTSA and DOT."}, {"time": 8311, "text": "The approach they took is saying, we don't know what the heck we're doing."}, {"time": 8314, "text": "So we're going to just let the innovators do their thing and not regulate it for a while, just to see."}, {"time": 8321, "text": "You don't, you think that's, you think DOT should provide ideas themselves."}, {"time": 8326, "text": "Well, so this is the, this is the great trick in policy of private actors, is you get narrow mandates for government agencies, right?"}, {"time": 8338, "text": "So, you know, the safety case will be handled by organizations whose mandate is safety."}, {"time": 8344, "text": "So the Federal Motor Carrier Safety Administration, who is, you know, going to be a key player, I argue in an article that I wrote, you know, they're going to be a key player in actually determining which scenario is most profitable by setting the rules for truck drivers."}, {"time": 8360, "text": "Their mandate is safety, right?"}, {"time": 8362, "text": "Now they have lots of good people there who want, you know, who care about truck drivers and who wish truck drivers jobs were better, but they don't have the authority to say, hey, we're going to write this rule because it's good for truck drivers, right?"}, {"time": 8375, "text": "And so when you, you know, we need to say, you know, as a society, we need to not restrict technology, not stand in the way of things."}, {"time": 8385, "text": "We need to harness it towards the goals that matter, right?"}, {"time": 8388, "text": "Not whatever comes out the end of the pipeline because it's the easiest thing to develop or whatever is most profitable for the first actor or whatever, but, you know, and we do, the thing is we do that, right?"}, {"time": 8400, "text": "I mean, like when we sent people to the moon, you know, we did that, and there were tremendous benefits that followed from it, right?"}, {"time": 8409, "text": "And we do this all the time in, you know, trying to cure cancer or whatever it is, right?"}, {"time": 8413, "text": "I mean, we can do this, right?"}, {"time": 8417, "text": "Now the interesting sort of epilogue to that story is, you know, six months or so, I don't know how long it was, after those meetings in which that sixth scenario was not considered, a company called Locomation, you know, ends up using that, essentially that basic scenario with a slight variation."}, {"time": 8439, "text": "So they leave the human driver in both trucks and then that following driver goes off duty."}, {"time": 8470, "text": "Well, some of it is also just the company stepping up and just doing it, screw the authority, and showing that it's possible, and then the authority follows."}, {"time": 8479, "text": "So that's why I really love innovators in the space."}, {"time": 8484, "text": "The criticism I have, the very sort of real, I don't know, harsh criticism I have towards autonomous vehicle companies in the space is they've gotten culturally, they've, it's become acceptable somehow to do demos and videos, as opposed to the old school American way of solving problems."}, {"time": 8510, "text": "There's a culture in Silicon Valley where you're talking to VCs that have lost that kind of love of solving problems."}, {"time": 8521, "text": "They kind of like envision, if the story you told me in your PowerPoint presentation is true, how many trillions of dollars might I be able to make?"}, {"time": 8530, "text": "There's something lost in that conversation where you're not really taking on like the problem in a real way, so these autonomous vehicle companies realize we don't need to, we just need to make nice PowerPoint presentations and not actually deliver products that like everybody looks outside and says, holy shit, this is life changing."}, {"time": 8551, "text": "This is where I have to give props to Waymo is they put driverless cars on the road and like forget PowerPoint slide presentations, actual cars on the road."}, {"time": 8562, "text": "Then you can criticize like, is that actually going to work?"}, {"time": 8565, "text": "Who knows, but the thing is they have cars on the road and that's why I have to give props to Tesla."}, {"time": 8569, "text": "They have whatever you want to say about risk and all those kinds of things, they have cars on the road that have some level of automation and soon they have trucks on the road as well."}, {"time": 8580, "text": "And that kind of, that component, I think is important part of the policy conversation because you start getting data from these companies that are willing to take the big risks as opposed to making slide decks, they're actually putting cars on the road and like real lives are at stake."}, {"time": 8599, "text": "They could be lost and they could bankrupt the company if they make the wrong decisions."}, {"time": 8603, "text": "And that's deeply admirable to me."}, {"time": 8605, "text": "Speaking of which I have to ask Waymo trucks, I think it's called Waymo Via."}, {"time": 8611, "text": "So I'm talking to the head of trucking at Waymo."}, {"time": 8614, "text": "I don't know if you've gotten a chance to interact with them."}, {"time": 8617, "text": "What's a good question to ask the guy?"}, {"time": 8619, "text": "What's a good question of Waymo?"}, {"time": 8621, "text": "Because they seem to be one of the leaders in the space."}, {"time": 8625, "text": "They have the zen like calm of like being willing to stick with it for the longterm in order to solve the problem."}, {"time": 8633, "text": "Yeah, and I guess they have that luxury, right?"}, {"time": 8636, "text": "Which I don't think I, if I had another life as a researcher, I would love to just study the business strategies of startups and Silicon Valley sort of structure."}, {"time": 8650, "text": "Would you consider Waymo a startup?"}, {"time": 8654, "text": "I mean, it's at least not in the things that seem to matter in this self driving space."}, {"time": 8658, "text": "So you mentioned the demos, and I don't have enough data as a sociologist to really say like, oh, this is why they do what they do."}, {"time": 8667, "text": "But my hypothesis is, there's a real scarcity of talent and money for this."}, {"time": 8673, "text": "And there certainly was a scarcity of like partnerships with OEMs and the big trucking companies."}, {"time": 8679, "text": "And there was a race for it, right?"}, {"time": 8682, "text": "And the way that if you don't have the backing of Alphabet, you do a demo, right?"}, {"time": 8689, "text": "And you get a few more good engineers who say, hey, look, they did that cool thing."}, {"time": 8694, "text": "Like Anthony Levandowski did with Otto and that resulted in the Uber purchase of that program."}, {"time": 8701, "text": "So what would I ask?"}, {"time": 8703, "text": "I mean, I think I would ask a lot of questions, but I think the markets."}, {"time": 8707, "text": "Well, there's also on record and off record conversations which unfortunately, I'm asking for an on record conversation."}, {"time": 8714, "text": "And that I don't know if these companies are willing to have interesting on record conversations."}, {"time": 8721, "text": "Yeah, I mean, I assume that like there are questions that I don't think you'd have to ask."}, {"time": 8726, "text": "Like I assume they're gonna be actually driverless, right?"}, {"time": 8728, "text": "They're not gonna like keep the driver in there."}, {"time": 8731, "text": "So I mean, for the industry, I think it would be interesting to know where they see that first adopter, right?"}, {"time": 8739, "text": "Oh, you mean from like the scenarios that laid out which one are they going to take on?"}, {"time": 8744, "text": "Yeah, I mean, cause that's gonna, again, it's those really expensive good jobs, right?"}, {"time": 8748, "text": "So those LTL jobs, the like UPS jobs."}, {"time": 8751, "text": "Now that's gonna be, that's where labor is too, right?"}, {"time": 8754, "text": "That's where the teamsters are."}, {"time": 8754, "text": "That's the only place they are left, right?"}, {"time": 8757, "text": "So that's gonna be the big fight on the hill and if labor can muster it, right?"}, {"time": 8791, "text": "In the 1960s, he put out a photo journal report called Men and Machines and basically what it was, was it was an internal education campaign to convince the membership that they had to go along with automation."}, {"time": 8806, "text": "Machines were coming for their jobs and what the photo journal, it's almost like a hundred pages or something like that is like, here's how we used to do it."}, {"time": 8814, "text": "Some of you old timers remember it."}, {"time": 8816, "text": "Like we used to take the barrels of olive oil and we'd stack them in the hold and we'd roll them by hand and we'd put the timber in and we'd, you know, stack the crates tight, you know, and that was the pride of the Longshoremen, was a tight stow."}, {"time": 8857, "text": "And so our wages are gonna go up."}, {"time": 8859, "text": "We're gonna continue to control the hiring and training of workers."}, {"time": 8862, "text": "Our numbers are gonna go down, but you know, basically that last son of a bitch who's working at the ports, he's gonna be one really well paid son of a bitch, you know, he may just be one standing, but he's gonna love his job."}, {"time": 8876, "text": "You should check out that report."}, {"time": 8877, "text": "That's an interesting vision of a future that probably still holds."}, {"time": 8881, "text": "That is, I mean, there is some level to which you have to embrace the automation."}, {"time": 8887, "text": "Yeah, I mean, and who gets, you know, it's the benefits, right?"}, {"time": 8889, "text": "It's like, I mean, think of the public dollars that went into developing self driving vehicles in the early days, right?"}, {"time": 8894, "text": "Not just the vision of it, right?"}, {"time": 8896, "text": "Which was a public vision to, you know, take soldiers out of harm's way, but you know, a lot of money."}, {"time": 8904, "text": "And there's some way if you are a business that's leveraging the technology from a broad historical ethical perspective, you do owe it to the bigger community to pay back, like for all the investment that was paid to make that technology a reality."}, {"time": 8927, "text": "In some sense, I don't know how to make that right, right?"}, {"time": 8930, "text": "On one, there's this pure capitalism and then there's communism and I'm not sure, I'm not sure how to get that balance right."}, {"time": 8944, "text": "You know, I don't have all the answers in here, you know, and I wouldn't expect, you know, individual private companies to kind of kick back, right?"}, {"time": 8951, "text": "That's, capitalism doesn't allow that, right?"}, {"time": 8954, "text": "Unless you have a huge monopoly, right?"}, {"time": 8955, "text": "And then you can on the backside, create music halls and libraries and things like that."}, {"time": 8961, "text": "But you know, here's what I think, you know, the basic obligation is, is, you know, come to the table, like, and have an honest conversation with the policymakers, with the truck drivers, you know, with the communities that are at risk."}, {"time": 8977, "text": "Like, at least let's talk about these things, you know, in a way that doesn't look like the way lobbying works right now."}, {"time": 8985, "text": "Where you send a well paid lobbyist to the Hill to, you know, convince some representative or Senator to stick a sentence or two in that favors you into the, like, let's have a real conversation."}, {"time": 8997, "text": "Real human conversation."}, {"time": 8998, "text": "Can we just do that?"}, {"time": 8999, "text": "Yeah, don't play games."}, {"time": 9001, "text": "Real, real human conversation."}, {"time": 9003, "text": "Let me ask you, mention Autopilot."}, {"time": 9006, "text": "Gotta ask you about Tesla, this renegade little company that seems to be, from my perspective, revolutionizing autonomous driving or semi autonomous driving, or at least the problem of perception and control."}, {"time": 9019, "text": "They've got a semi on the way."}, {"time": 9022, "text": "They got a truck on the way."}, {"time": 9024, "text": "What are your thoughts about Tesla Semi?"}, {"time": 9026, "text": "You know, I, and I did have some very preliminary conversations with, you know, policy folks there."}, {"time": 9035, "text": "You know, nothing really in the tech or business side of it too much."}, {"time": 9040, "text": "I think because electrification and autonomy run in opposite directions."}, {"time": 9046, "text": "And I just, you know, I don't see the application, the value in self driving for the truck that Tesla's gonna produce in the near term."}, {"time": 9055, "text": "You know, they're just, you're not gonna have the battery."}, {"time": 9058, "text": "And now you could have wonderful safety systems and, you know, reinforcing, you know, the auto, you know, self driving features supporting a skilled driver, but you're not gonna be able to pull that driver out for long stretches the way that you are with driverless trucks."}, {"time": 9074, "text": "So do you think, I mean, the reason, so yeah, the electrification is not obviously coupled with the automation."}, {"time": 9087, "text": "They have a very interesting approach to semi autonomous pushing towards autonomous driving."}, {"time": 9095, "text": "All right, it's very unique."}, {"time": 9097, "text": "No LIDAR, now no radar."}, {"time": 9101, "text": "It's computer vision alone from a large, they're collecting huge amounts of data from a large fleet."}, {"time": 9107, "text": "It's an interesting, unique approach, bold and fearless in this direction."}, {"time": 9111, "text": "If I were to guess whether this approach would work, I would say, no, it started."}, {"time": 9119, "text": "One, you would need a lot of data and two, because you have actual cars deployed on the road using a beta version of this product, you're going to have a system that's far less safe and you're going to run into trouble."}, {"time": 9133, "text": "It's horrible PR, like it just seems like a nightmare, but it seems to not be the case, at least up to this point."}, {"time": 9140, "text": "It seems to be not, you know, on par, if not safer and it seems to work really well and the human factor somehow manages, like drivers still pay attention."}, {"time": 9153, "text": "Now there's a selection of who is inside the Tesla autopilot user base, right?"}, {"time": 9159, "text": "There could be a self selection mechanism there, but however it works, these things are not running off the road all the time."}, {"time": 9167, "text": "So it's very interesting whether that can sort of creep into the trucking space."}, {"time": 9172, "text": "Yes, at first the long haul problem is not solved."}, {"time": 9177, "text": "They need to charge, but maybe you can solve, you know, a lot of your scenarios involved small distances and you know, that last mile aspect, which is exactly what Tesla is trying to solve for the regular passenger vehicle space is the city driving."}, {"time": 9200, "text": "It's possible that you have these trucks."}, {"time": 9202, "text": "It's almost like, yeah, you solved the last mile delivery part of some of the scenarios that you mentioned in autonomous driving space."}, {"time": 9212, "text": "Is that, do you think that's from the people you've spoken with too difficult of a problem?"}, {"time": 9217, "text": "The thing that, you know, keeps me so interested in this space and thinking that it's so important, you know, is again, that efficiency question, that safety question and the way that these economics can push us potentially, you know, toward a more efficient system."}, {"time": 9234, "text": "So I wanna see those Tesla electric trucks running out to those truck ports where you've got those two, you know, two trucks with a human driver in front, right?"}, {"time": 9245, "text": "You know, I think that's now what's powering those is that hydrogen, you know, I mean, I don't, you know, again, it's very interesting as a researcher who does not have a background in technology and doesn't have a horse, you know, in this race."}, {"time": 9258, "text": "I mean, you know, for all I know, self driving trucks will ultimately be achieved by some biomechanical sensor that uses echolocation because we took stem cells of bats."}, {"time": 9268, "text": "And you know, I mean, I don't, I don't, I am completely unable to assess who's, you know, who's the head or who's behind or who makes sense."}, {"time": 9277, "text": "But I think one key component there, and this is what I see with Tesla often, and it's quite sad to me that other companies don't do this enough, is that first principles thinking, like, wait, wait, wait, okay."}, {"time": 9291, "text": "It's looking at the inefficiencies as opposed to, I've worked with quite a few car companies and they basically have a lot of meetings."}, {"time": 9300, "text": "There's a lot of meetings."}, {"time": 9301, "text": "And the discussion is like, how can we make this cheaper, this cheaper, this cheaper, this component cheaper, this cheaper, the cheapification of everything, just like you said, as opposed to saying, wait a minute, let's step back."}, {"time": 9313, "text": "Let's look at the entirety of the inefficiencies in the system."}, {"time": 9317, "text": "Like, why have we been doing this like this for the last few decades?"}, {"time": 9320, "text": "Like, start from scratch."}, {"time": 9322, "text": "Can this be 10X, 100X cheaper?"}, {"time": 9325, "text": "Like, if we not just decrease the cost of one component here or this component here or this component here, but like, let's like redesign everything."}, {"time": 9337, "text": "Let's infrastructure, let's have special lanes or in terms of truck ports, as opposed to having regular human control truck ports, have some kind of weird like sensors, like where everything about the truck connecting at that final destination is automated fully from the ground up."}, {"time": 9359, "text": "You build the facility from the ground up for the autonomous truck."}, {"time": 9363, "text": "All those kinds of sort of questions are platooning."}, {"time": 9366, "text": "Let's say, wait a minute."}, {"time": 9368, "text": "Okay, I know we think platooning is hard, but can we think through exactly why it's hard and can we actually solve it?"}, {"time": 9375, "text": "Like if we collect a huge amount of data, can we solve it?"}, {"time": 9380, "text": "And then teleoperation, like, okay, yeah, yeah."}, {"time": 9383, "text": "It's difficult to have good signal, but can we actually, can we have, can we consider the probability of those edge cases and what to do in the edge cases when the teleoperation fails?"}, {"time": 9394, "text": "Like how difficult is this?"}, {"time": 9395, "text": "What are the costs?"}, {"time": 9396, "text": "How do we actually construct a teleoperation center full of humans that are able to pay attention to a large fleet where the average number of vehicles per human is like 10 or a hundred?"}, {"time": 9407, "text": "Like having that conversation as opposed to kind of having, you show up to work and say, all right, it seems like because of COVID, we are not making as much money."}, {"time": 9420, "text": "Can we have a cheaper, can we give less salary to the trucker?"}, {"time": 9424, "text": "And can we build like decrease the cost or decrease the frequency at which we buy new trucks?"}, {"time": 9434, "text": "And when we do buy new trucks, make them cheaper by making them crappier, like this kind of discussion."}, {"time": 9440, "text": "This is why, to me, it's like Tesla is like rare on this."}, {"time": 9443, "text": "And there's some sectors in which innovation is part of the culture."}, {"time": 9447, "text": "In the automotive sector, for some reason, it's not as much."}, {"time": 9451, "text": "This is obviously the problem that Ford and GM are struggling with."}, {"time": 9454, "text": "It's like, they're really good at making cars at scale cheap."}, {"time": 9459, "text": "And they're like legit good."}, {"time": 9461, "text": "Like Toyota at this, they're some of the greatest manufacturing people in the world, right?"}, {"time": 9466, "text": "But then when it comes to hiring software people, they're horrible."}, {"time": 9469, "text": "So it's culture."}, {"time": 9472, "text": "And then it's such a difficult thing for them to sort of embrace, but greatness requires that they embrace this, embrace whatever is required to remove the inefficiencies in the system."}, {"time": 9484, "text": "And that may require you to do things very differently than you've done in the past."}, {"time": 9489, "text": "Yeah, I mean, there are certain things that the market can do well."}, {"time": 9493, "text": "And this is how I see the world, right?"}, {"time": 9497, "text": "That's the best way to organize certain kinds of activities is the market and private interest."}, {"time": 9504, "text": "But I think we go too far in some areas."}, {"time": 9508, "text": "Transportation is, if we can't have a public debate about the roads that we all pay for, forget about it."}, {"time": 9519, "text": "Private factories and all these other, healthcare and other places, it's gonna be way harder there."}, {"time": 9525, "text": "Healthcare I guess has some direct contact with the consumer where we're probably gonna have lots of sort of hands on public policy about concerns around patient rights and things like that."}, {"time": 9537, "text": "But if we can't figure out how to have a public policy conversation around how technology is gonna reform our public roadways and our transportation system, we're really leaving way too much to private companies."}, {"time": 9553, "text": "And it's just, it's not in there."}, {"time": 9557, "text": "I get asked this question, like, what should companies do?"}, {"time": 9559, "text": "And I'm like, just go about doing what you're doing."}, {"time": 9562, "text": "I mean, please come to the table and talk about it, but it's not their role."}, {"time": 9566, "text": "I mean, I appreciate Ilan's attempts to have species level goals, like, we're gonna go to Mars."}, {"time": 9576, "text": "I mean, that's amazing."}, {"time": 9577, "text": "And that's incredible that someone can realize that, have a chance at realizing that vision."}, {"time": 9586, "text": "But when it comes to so many areas of our economy, we can't wait for a hero."}, {"time": 9592, "text": "We have to have, and there are way too many interests involved."}, {"time": 9596, "text": "It's who builds the roads."}, {"time": 9598, "text": "I mean, the money that sloshes around on Capitol Hill to decide what happens in these infrastructure bills and the transportation bill is just obscene, right?"}, {"time": 9609, "text": "See, I think it's an interesting view of markets."}, {"time": 9612, "text": "Correct me if I'm wrong, let me propose a theory to you."}, {"time": 9616, "text": "That progress in the world is made by heroes and the markets remove the inefficiencies from the work the heroes did."}, {"time": 9626, "text": "So going to Mars from the perspective of markets probably has no value."}, {"time": 9632, "text": "Maybe you can argue it's good for hiring to have a vision or something like that, but like those big projects don't seem to have an obvious value, but our world progresses by those big leaps."}, {"time": 9645, "text": "And then after the leaps are taken, then the markets are very good at removing sort of inefficiencies."}, {"time": 9652, "text": "But it just feels like the autonomous vehicle space and the autonomous trucking space requires leaps."}, {"time": 9659, "text": "It doesn't feel like we can sneak up into a good solution that is ultimately good for labor, like for human beings in the system."}, {"time": 9667, "text": "It feels like some, like probably a bad example, but like a Henry Ford type of character steps in and say like, we need to do stuff completely differently."}, {"time": 9680, "text": "Yeah, and you said we can't hope for a hero, but it's like, no, but we can say we need a hero."}, {"time": 9687, "text": "We need more heroes."}, {"time": 9689, "text": "So if you're a young kid right now listening to this, we need you to be a hero."}, {"time": 9693, "text": "It's not like we need you to start a company that makes a lot of money, no."}, {"time": 9696, "text": "You need to start a company that makes a lot of money so that you can feed your family as you become a hero and take huge risks and potentially go bankrupt."}, {"time": 9705, "text": "Those risks is how we move society forward, I think."}, {"time": 9709, "text": "Maybe that's a romantic view, I don't know."}, {"time": 9711, "text": "I totally disagree."}, {"time": 9712, "text": "You disagree, goddammit."}, {"time": 9713, "text": "I mean, I... And out of the two of us, you're the knowledgeable one."}, {"time": 9718, "text": "No, no, I think it's a matter of like, do we need those heroes?"}, {"time": 9724, "text": "I mean, I saw the boosters come down from space, boosters come down from SpaceX's rockets and land nearly simultaneously with my kids after school one day."}, {"time": 9739, "text": "And I thought, oh my god, like science fiction has been made real."}, {"time": 9746, "text": "And it's a pinnacle of human achievement, right?"}, {"time": 9749, "text": "It's like, this is what we're capable of."}, {"time": 9752, "text": "But we need to have those heroes oriented."}, {"time": 9757, "text": "We need to allow them to orient toward the goals, right?"}, {"time": 9762, "text": "We gotta..."}, {"time": 9763, "text": "Climate change, you know?"}, {"time": 9765, "text": "I mean, all the heroes out there, right?"}, {"time": 9768, "text": "I mean, it's time."}, {"time": 9770, "text": "The clock is ticking."}, {"time": 9772, "text": "It's past time."}, {"time": 9773, "text": "I've been working on climate change issues since the mid 90s."}, {"time": 9779, "text": "I still remember the first time in 2010 when I got a grant that was completely focused on adaptation rather than prevention."}, {"time": 9792, "text": "And just when it hit me, that like, wow."}, {"time": 9798, "text": "So adaptation versus prevention is like acceptance that there's going to be catastrophic impact."}, {"time": 9805, "text": "We need to figure out how do we at least live with that."}, {"time": 9809, "text": "And you know, the grant was like, okay, our agriculture system is gonna move, our breadbasket is no longer gonna be California, it's gonna be Illinois."}, {"time": 9816, "text": "What does that mean for truck transportation?"}, {"time": 9818, "text": "So it's like, so in terms of a big philosophical societal level, that's kind of like giving up."}, {"time": 9825, "text": "In terms of the big heroic actions."}, {"time": 9827, "text": "You know, failures in human history, yeah."}, {"time": 9831, "text": "That's gonna be, let's hope not the biggest, but could be."}, {"time": 9837, "text": "So let me say why I disagree, right?"}, {"time": 9839, "text": "Henry Ford, amazing, right?"}, {"time": 9842, "text": "To sort of mass produce cars, right?"}, {"time": 9844, "text": "Daimler to put that first truck on the road without the roads, right?"}, {"time": 9849, "text": "So there's like, we need that innovation."}, {"time": 9852, "text": "And there are rules for that, but there's big public stuff that sets the stage."}, {"time": 9859, "text": "It's critical."}, {"time": 9860, "text": "And you know, and what it really is, it's a sociological problem, right?"}, {"time": 9865, "text": "It's a political problem."}, {"time": 9866, "text": "It's a social problem."}, {"time": 9866, "text": "We have to say, and we have these screwed up ideas, right?"}, {"time": 9869, "text": "So we have this politics right now where like everybody feels like they're getting screwed and someone undeserving is benefiting."}, {"time": 9877, "text": "When in fact, like, you know, at least in the middle, right?"}, {"time": 9880, "text": "They're huge."}, {"time": 9881, "text": "I used to teach this course in rich and poor, you know, in economic inequality."}, {"time": 9885, "text": "And I would go through public housing subsidies in Philadelphia, you know, section eight subsidies, you know, and then I would go through my housing subsidies for my mortgage interest deduction."}, {"time": 9900, "text": "And it worked out to basically the average payment for a section eight housing voucher in my neighborhood."}, {"time": 9906, "text": "I'm not a welfare recipient according to the dominant discourse."}, {"time": 9910, "text": "And so we have this completely screwed up sense of like where our dollars go and you know, who benefits from the investment."}, {"time": 9917, "text": "And you know, we need to, you know, I don't know that we can do it, but you know, if we're gonna survive, we need to figure out how to have honest conversations where private interest is where we need it to be in fostering innovation and, you know, and rewarding the people who do incredible things."}, {"time": 9937, "text": "Please, you know, we don't wanna squash that, but we need to harness that power to solve what I think are some pretty big, you know, existential problems."}, {"time": 9947, "text": "So you think there's a like government level, national level collaboration required for infrastructure project."}, {"time": 9954, "text": "Like there's, we should really have large moonshot projects that are funded by our governments."}, {"time": 9964, "text": "At least guided by, I mean, I think there are ways to finance them and you know, other things, but we gotta be careful, right?"}, {"time": 9970, "text": "Cause that's where you get all these sort of perverse, you know, unintended consequences and whatnot."}, {"time": 9975, "text": "But if you look at transportation in the United States and it is the foundation of the, you know, manifest destiny, economic growth, right?"}, {"time": 9984, "text": "That built the United States into the world superpower that it became and the industrial power that it became."}, {"time": 9990, "text": "It rested on transportation, right?"}, {"time": 9993, "text": "It was like, you know, the Erie Canal, I grew up a few miles from where they dug the first shovel full of the Erie Canal and everyone thought it was, you know, crazy, right?"}, {"time": 10004, "text": "But those public infrastructure projects, the canals, right, the railroads, yeah, they were privately built, but they wouldn't have been privately built without, you know, Lincoln funding them essentially and giving, you know, the railroads, you know, land in exchange for building them."}, {"time": 10021, "text": "The highway system, the Eisenhower, the payback that the US economy got from the Dwight D. Eisenhower interstate system is phenomenal, right?"}, {"time": 10032, "text": "No private entity was gonna do that."}, {"time": 10034, "text": "Electrification, dams, water, you know, we need to do these infrastructure, infrastructure."}, {"time": 10041, "text": "And now more than ever, it's been really upsetting to me on the COVID front."}, {"time": 10047, "text": "There's one of the solutions to COVID, which seems obvious to me from the very beginning that nobody's opposed to."}, {"time": 10054, "text": "It's one of the only bipartisan things is at home testing, rapid at home testing."}, {"time": 10061, "text": "There's no reason why at the government level, we couldn't manufacture hundreds of millions of tests a month."}, {"time": 10068, "text": "There's no reason starting in May, 2020."}, {"time": 10071, "text": "And that gives power to a country that values freedom, that gives power information to each individual to know whether they have COVID or not."}, {"time": 10079, "text": "So it's possible to manufacture them for under a dollar."}, {"time": 10084, "text": "It's like an obvious thing."}, {"time": 10085, "text": "It's kind of like the roads."}, {"time": 10087, "text": "It's like, everybody's invested."}, {"time": 10088, "text": "Let's put countless tests in the hands of every single American citizen, maybe every citizen of the world."}, {"time": 10096, "text": "The fact that we haven't done that today and there's some regulation stuff with the FDA, all the kind of dragging of feet, but there's not actually a good explanation except our leaders and culturally, we've lost the sort of, not lost, but it's a little bit dormant."}, {"time": 10118, "text": "The will to do these big projects that better the world."}, {"time": 10123, "text": "I still have the hope that when faced with catastrophic events, the more dramatic, the more damaging, the more painful they are, the higher we will rise to meet those."}, {"time": 10136, "text": "And that's where the infrastructure style projects are really important."}, {"time": 10139, "text": "But it's certainly a little bit challenging to remain an optimist in the times of COVID because the response of our leaders has not been as great and as historic as I would have hoped."}, {"time": 10154, "text": "I would hope that the actions of leaders in the past few years in response to COVID would be ones that are written in the history books."}, {"time": 10163, "text": "And we talk about it as we talk about FDR, but sadly, I don't know."}, {"time": 10167, "text": "I think the history books will forget the actions of our leaders."}, {"time": 10172, "text": "So let me just, to wrap up autonomy, when you look into the future, are you excited about automation in the space of trucking?"}, {"time": 10192, "text": "Is it, when you go to bed at night, do you see a beautiful world in your vision that involves autonomous trucks?"}, {"time": 10203, "text": "Like all of the truckers you've become close with, you've talked to, do you see a better world for them because of autonomous trucks?"}, {"time": 10213, "text": "Damn you, Alex."}, {"time": 10215, "text": "Because I mean, I want to be an optimist, and I want to think of myself, I guess, as a half glass bowl kind of person."}, {"time": 10223, "text": "But when you ask it like that, and I think about like, when I look at the challenges to harnessing that for, just let's take just labor and climate, right?"}, {"time": 10240, "text": "There are other issues, congestion, et cetera, infrastructure, that are gonna be affected by this, again, those big transformational issues."}, {"time": 10250, "text": "I think it's gonna take the best of us."}, {"time": 10253, "text": "Like it's gonna take the best of our policy approaches."}, {"time": 10259, "text": "We need to start investing in building those, rebuilding those institutions."}, {"time": 10265, "text": "I mean, that's what we've seen in the last four years, right?"}, {"time": 10267, "text": "And the erosion of that was so clear among these truck drivers."}, {"time": 10272, "text": "Like when Trump came in and said like, free trades, good for workers, like, yeah, right."}, {"time": 10280, "text": "I grew up in the Rust Belt."}, {"time": 10283, "text": "I watched factory after factory close."}, {"time": 10285, "text": "All of my ancestors worked at the same factory."}, {"time": 10288, "text": "It's still holding on by a thread."}, {"time": 10290, "text": "Like, the Democratic Party told blue collar workers for years, I don't worry about free trade."}, {"time": 10298, "text": "It's not bad for you."}, {"time": 10299, "text": "And I know the economists will probably get in the comment box now."}, {"time": 10304, "text": "We'll look forward to your comments."}, {"time": 10305, "text": "Look forward to your comments about how free trade benefits everybody."}, {"time": 10308, "text": "But, you know, immigration, you know, you go, and I think immigration is great."}, {"time": 10316, "text": "The United States benefits from it tremendously, right?"}, {"time": 10319, "text": "But there are costs, right?"}, {"time": 10321, "text": "Go down to South Philadelphia and find a drywaller and tell him that immigration hasn't hurt him, right?"}, {"time": 10328, "text": "You know, go to these places where there's competition, right?"}, {"time": 10333, "text": "And yes, we benefit overall, but we have a system that allows some people to pay really high costs."}, {"time": 10341, "text": "And Trump tapped into that, you know?"}, {"time": 10344, "text": "And there was no, you know, there's more than that too, obviously."}, {"time": 10348, "text": "And there's lots of really dark stuff that goes along with it, you know, the sort of racialization of others and things like that."}, {"time": 10355, "text": "But he hit on those core, you know, issues that, you know, if you were to go back over my trucking interviews for 15 years, you would have heard those stories over and over and over again, that sense of voicelessness, that sense of powerlessness, that sense that there's no difference between the Democrats and the Republicans because they're all gonna screw us over."}, {"time": 10374, "text": "And that was there, you know?"}, {"time": 10376, "text": "And you just ignore it as long as you want and tell people, don't worry, trade's good for you."}, {"time": 10380, "text": "Don't worry, immigration's good for you."}, {"time": 10381, "text": "As their communities lose factories."}, {"time": 10384, "text": "And I mean, a lot of them were lost to the South before they were lost to overseas, whatever, but tapped into that, you know?"}, {"time": 10390, "text": "And there's a fundamental distrust of, you know, you look at these like pupils on like, you know, whether people trust the media, right?"}, {"time": 10397, "text": "But whether or not they trust higher education, you know, these institutions that I find magical, right?"}, {"time": 10404, "text": "I mean, you look at the vaccine research and stuff, that, you know, just, you know, brilliant, you know, people doing incredible things for humanity."}, {"time": 10413, "text": "Like, you know, the idea that like, you know, we can take these viruses that, you know, used to ravage through the human population that we had to be terrified of."}, {"time": 10424, "text": "And, you know, we've suffered, but, you know, we have such power now to defend ourselves, right?"}, {"time": 10432, "text": "Behind these programs, right?"}, {"time": 10434, "text": "And to see those, people would be like, eh, I'm not sure if higher education's good for the country or not, you know, it's like, where are we, you know?"}, {"time": 10442, "text": "So we need to rebuild the faith and trust in those institutions and have these, but we need to have honest conversations before people are gonna buy it, you know?"}, {"time": 10449, "text": "Do you have ideas for rebuilding the trust and giving a voice to the voices?"}, {"time": 10453, "text": "So is the, many of the things we've been talking about is so sort of deeply integrated."}, {"time": 10461, "text": "You think like, this is the trouble I have with people that work on AI and autonomous vehicles and so on, it's not just a technology problem."}, {"time": 10470, "text": "It's this human pain problem."}, {"time": 10476, "text": "It's the robot essentially silencing the voice of a human being because it's lowering their wage, making them suffer more and giving them no tools of how to escape that suffering."}, {"time": 10488, "text": "Is there something, I mean, it even gets into the question of meaning, you know?"}, {"time": 10495, "text": "So if money is one thing, but it's also what makes us happy in life."}, {"time": 10501, "text": "You know, a lot of those truckers, the set of jobs they've had in their life were defining to them as human beings."}, {"time": 10512, "text": "And so, and the question with automation is not just how do we have a job that gives you money to feed your family, but also a job that gives you meaning, that gives you pride."}, {"time": 10527, "text": "And for me, the hope is that AI and automation will provide other jobs that will be a source of meaning."}, {"time": 10543, "text": "But coupled with that hope is that there will not be too much suffering in the transition."}, {"time": 10549, "text": "And that's not obvious from the people you've spoken with."}, {"time": 10553, "text": "I mean, I think we need to differentiate between the effects of technology and the effects of capitalism, right?"}, {"time": 10558, "text": "And they are, you know, the fact that workers don't have a lot of power, right, in the system matters."}, {"time": 10566, "text": "Now, we had a system, right?"}, {"time": 10568, "text": "And that's why I would say, you know, go to that, you know, Harry Bridges report."}, {"time": 10572, "text": "And, you know, those were workers who had a sense of power."}, {"time": 10576, "text": "They said, you know what, we can demand some of the benefits, like, yeah, automate our jobs away, but, you know, kick a little down to us, right?"}, {"time": 10584, "text": "And we had, in the golden era of American industrialism in post World War II, that was the contract."}, {"time": 10592, "text": "The contract was employers can do what they want in automation and all these things."}, {"time": 10597, "text": "Yeah, sure, there's some union rules that make things less efficient in places, but the key compromise is tie wages to productivity."}, {"time": 10606, "text": "We tied, that's what unions did."}, {"time": 10607, "text": "They tied wages to productivity, kept demand up, right?"}, {"time": 10610, "text": "It was good for the economy, some economists think, right?"}, {"time": 10614, "text": "And that's what, you know, we need to, I think we need to acknowledge that."}, {"time": 10619, "text": "We need to acknowledge the fact that it's not just technology, it's technology in a social context in which some people have a lot of power to determine what happens."}, {"time": 10632, "text": "For me, I don't have all the answers, but I know what my answer is."}, {"time": 10635, "text": "And my answer is, and I think I started with this, you know, I can learn from every single person, you know?"}, {"time": 10644, "text": "Did I have to talk to the 200th truck driver?"}, {"time": 10647, "text": "In my opinion, yes, because I was gonna learn something from that 200th truck driver."}, {"time": 10653, "text": "Now, people with more power might talk to none, or they might talk to five and say, okay, I got it."}, {"time": 10661, "text": "You know, people are amazing and every one of them has a life experience and concerns and, you know, can teach us something."}, {"time": 10673, "text": "And they're not in the conversation, you know?"}, {"time": 10677, "text": "And I know this because I'm the expert, you know?"}, {"time": 10680, "text": "So I get pulled in to these conversations and people wanna know, you know, what's gonna happen to labor, you know?"}, {"time": 10686, "text": "It's like, well, so I try to be a sounding board and I feel a tremendous weight of responsibility, you know, for that."}, {"time": 10696, "text": "So, but I'm not those workers, you know?"}, {"time": 10701, "text": "And they may listen to this or, you know, walk in the door sometime, it's about to be like, that guy's full of shit, that's not what I think at all."}, {"time": 10711, "text": "And they don't get heard over and over and over."}, {"time": 10745, "text": "I have to ask you on, by way of advice, young people, high school students, college students, entering this world full of automation, full of these complex labor markets and markets period, what would you, what kind of advice would you give to that person about how to have a career?"}, {"time": 10768, "text": "How to have a life they can be proud of?"}, {"time": 10772, "text": "Yeah, I think, you know, this is such a great question."}, {"time": 10775, "text": "I don't, it's okay to quote Steve Jobs, right?"}, {"time": 10785, "text": "Yeah, I mean, so, and I just heard this recently."}, {"time": 10789, "text": "It was a commencement speech that he gave and I can't remember where it was."}, {"time": 10793, "text": "And he was talking about, you know, he had famously dropped out of school, but continued to take classes, right?"}, {"time": 10799, "text": "And he took a calligraphy class that influenced the design of the Mac and sort of fonts."}, {"time": 10806, "text": "And, you know, just was something that he had no, you know, sense of what it was gonna be useful for."}, {"time": 10811, "text": "And his lesson was, you know, you can't connect the dots looking forward."}, {"time": 10816, "text": "You know, looking back, you can see all the pieces that sort of led you to where you ended up."}, {"time": 10822, "text": "And for me, studying truck driving, like, I mean, I literally went to graduate school because I was worried about climate change."}, {"time": 10828, "text": "And like, you know, I had a whole other dissertation plan and then was like driving home."}, {"time": 10832, "text": "And like, I had read about all this management literature and sort of like how you get workers to work hard for my qualifying exams."}, {"time": 10839, "text": "And then read a popular article on satellite linked computers."}, {"time": 10844, "text": "And the story in the literature was, you know, a sense of autonomy."}, {"time": 10847, "text": "And I was like, well, that monitoring must affect the sense of autonomy."}, {"time": 10851, "text": "And it's just this question that I found interesting."}, {"time": 10854, "text": "And it never in a million years that I ever thought I was gonna like study, you know, spend 15 years of my life studying truck driving."}, {"time": 10862, "text": "And it was like, if you were to map out a career path in academia or research, like, you know, you would do none of the things that I did that many people advise me against."}, {"time": 10875, "text": "Where like, you can't like go spend a year working as a truck driver, you know, like that's crazy."}, {"time": 10880, "text": "Or, you know, you can't, you know, spend all this time trying to write like one huge book and, you know."}, {"time": 10886, "text": "But by the way, if I could just interrupt, what was the fire that got you to take the leap and go and work as a truck driver and go interview truck drivers?"}, {"time": 10896, "text": "This is what a lot of people would be incapable of doing, just took that leap."}, {"time": 10901, "text": "What the heck is up with your mind that allowed you to take that big leap?"}, {"time": 10906, "text": "So I think it's probably like Tolkien."}, {"time": 10910, "text": "And Lord of the Rings, you know."}, {"time": 10936, "text": "And basically my kayak experience up till that, you know, point had been, you know, on a fairly calm lake and like class one rapids on a river."}, {"time": 10942, "text": "Solo trip on a kayak in the Pacific."}, {"time": 10945, "text": "So I was working on forestry issues and we were starting a campaign up in really remote British Columbia."}, {"time": 10953, "text": "And I was like, okay, if I'm gonna work on this, I've got to actually go there myself and see what this is all about and see whether it's worth like devoting my sort of, you know, life right now too."}, {"time": 10962, "text": "And just drove up there with this kayak and, you know, put into the Pacific and it was insane."}, {"time": 10996, "text": "And now actually very recently, I've gone out on whitewater with some people who know what the hell they're doing and I realized like just how absolutely stupid and, you know, ill fit I was, but that's just, I think I've always had that."}, {"time": 11011, "text": "Were you afraid when you had that wave before you?"}, {"time": 11013, "text": "That wave scared the shit out of me, yeah."}, {"time": 11015, "text": "Okay, what about taking a leap and becoming a trucker?"}, {"time": 11019, "text": "Yeah, there was some nervousness for sure."}, {"time": 11021, "text": "I mean, and, you know, I guess my advantage as an ethnographer is I grew up in a blue collar environment."}, {"time": 11028, "text": "You know, again, all my ancestors were factory workers."}, {"time": 11032, "text": "So I can move through spaces."}, {"time": 11036, "text": "I'm really, I feel, I can become comfortable in lots and lots of places, you know, not everywhere, but, you know, along class lines for sort of white, you know, even white ethnic workers, like that's, you know, I can move in those spaces fairly easily."}, {"time": 11053, "text": "I mean, not entirely, there was one time where I was like, okay, you know, and I grew up around people who worked on cars."}, {"time": 11059, "text": "I'd been to drag races in NASCAR and I'd been to, you know, Colgate University."}, {"time": 11092, "text": "But also culturally perhaps didn't feel like you fit in."}, {"time": 11095, "text": "Feeling like just a fish out of water."}, {"time": 11097, "text": "I just, you know, but, and at the same time that sort of drove me in the sense that it drove an opening of my mind because I couldn't understand it."}, {"time": 11106, "text": "You know, I was like, I didn't know that this world existed."}, {"time": 11111, "text": "And I think maybe that's where my real first step in trying to understand other people because they were my friends, you know?"}, {"time": 11118, "text": "I mean, they were my teammates."}, {"time": 11119, "text": "I played lacrosse in college."}, {"time": 11121, "text": "So like, you know, I was close to people who came from such different backgrounds than I did."}, {"time": 11125, "text": "And I just, I was so confused, you know?"}, {"time": 11129, "text": "And so I think I learned to learn and then, you know, sort of went from there."}, {"time": 11134, "text": "And then develop your fascination with people."}, {"time": 11136, "text": "And the funny thing is you went from trucking now to autonomous trucks."}, {"time": 11140, "text": "I mean, this is speaking of not being able to connect the dots and, you know, your life in the next 10 years could take very interesting directions that are very difficult to, first of all, us meeting is a funny little thing given the things I'm working on with robots currently."}, {"time": 11157, "text": "But, you know, it may not relate to trucks at all."}, {"time": 11160, "text": "There's a, at a certain point, autonomous trucks are just robots."}, {"time": 11166, "text": "And then it starts getting into a conversation about the roles of robots in society."}, {"time": 11171, "text": "Yeah, and the roles of humans and robots."}, {"time": 11175, "text": "And that interplay is right up your alley."}, {"time": 11180, "text": "As somebody who deeply cares about humans and have somehow found themselves studying robots."}, {"time": 11185, "text": "Yeah, no, it's crazy."}, {"time": 11186, "text": "I mean, even four or five years ago, I would, if you had asked me if I was gonna be studying trucking still, I would have said no."}, {"time": 11193, "text": "And so my advice is, I think if I was gonna give advice, you know, is, you know, you can't connect the dots looking forward."}, {"time": 11200, "text": "You just gotta follow what interests you, you know?"}, {"time": 11203, "text": "And I think we downplay, right, that when we talk to, you know, kids, especially, you know, if you have some bright gifted kid that gets identified as like, oh, you could go somewhere."}, {"time": 11214, "text": "Then we're like, we feed them stuff."}, {"time": 11215, "text": "You're like, we'll learn the piano and learn another language, right?"}, {"time": 11218, "text": "Or learn robotics."}, {"time": 11220, "text": "And then we tell other kids like, oh, learn a trade, you know, like figure out what's gonna pay well."}, {"time": 11225, "text": "And not that there's anything against trades."}, {"time": 11226, "text": "I think everyone should learn like manual skills to make things."}, {"time": 11230, "text": "I think it's incredibly satisfying and wonderful, and we need more of that."}, {"time": 11235, "text": "But also, you know, tell, you know, all kids, it's okay to like take a class in something random that you don't think you're gonna get any economic return on."}, {"time": 11243, "text": "Well, because maybe you will end up going into a trade, but that class that you took in studio art is gonna mean that, you know, you look at buildings differently, right?"}]}]