[{"title": "George Hotz: Hacking the Simulation & Learning to Drive with Neural Nets | Lex Fridman Podcast #132", "id": "_L3gNaAVjQ4", "quotes": [{"time": 254, "text": "We have to do everything right in order to avoid it."}, {"time": 258, "text": "And one thing wrong, I mean, actually this is what I really like about cryptography."}, {"time": 262, "text": "Cryptography, it seems like we live in a world where the defense wins versus like nuclear weapons."}, {"time": 269, "text": "The opposite is true."}, {"time": 270, "text": "It is much easier to build a warhead that splits into a hundred little warheads than to build something that can, you know, take out a hundred little warheads."}, {"time": 278, "text": "The offense has the advantage there."}, {"time": 281, "text": "So maybe our future is in crypto, but."}, {"time": 284, "text": "So cryptography, right."}, {"time": 285, "text": "The Goliath is the defense."}, {"time": 289, "text": "And then all the different hackers are the Davids."}, {"time": 294, "text": "And that equation is flipped for nuclear war."}, {"time": 297, "text": "Cause there's so many, like one nuclear weapon destroys everything essentially."}, {"time": 301, "text": "Yeah, and it is much easier to attack with a nuclear weapon than it is to like the technology required to intercept and destroy a rocket is much more complicated than the technology required to just, you know, orbital trajectory, send a rocket to somebody."}, {"time": 318, "text": "Your intuition that there were intelligent civilizations out there, but it's very possible that they're no longer there."}, {"time": 326, "text": "That's kind of a sad picture."}, {"time": 327, "text": "They enter some steady state."}, {"time": 329, "text": "They all wirehead themselves."}, {"time": 331, "text": "What's wirehead?"}, {"time": 333, "text": "Stimulate, stimulate their pleasure centers and just, you know, live forever in this kind of stasis."}, {"time": 339, "text": "They become, well, I mean, I think the reason I believe this is because where are they?"}, {"time": 346, "text": "If there's some reason they stopped expanding, cause otherwise they would have taken over the universe."}, {"time": 352, "text": "The universe isn't that big."}, {"time": 353, "text": "Or at least, you know, let's just talk about the galaxy, right?"}, {"time": 356, "text": "That's 70,000 light years across."}, {"time": 358, "text": "I took that number from Star Trek Voyager."}, {"time": 359, "text": "I don't know how true it is, but yeah, that's not big."}, {"time": 364, "text": "70,000 light years is nothing."}, {"time": 367, "text": "For some possible technology that you can imagine that can leverage like wormholes or something like that."}, {"time": 372, "text": "Or you don't even need wormholes."}, {"time": 373, "text": "Just a von Neumann probe is enough."}, {"time": 375, "text": "A von Neumann probe and a million years of sublight travel and you'd have taken over the whole universe."}, {"time": 380, "text": "That clearly didn't happen."}, {"time": 382, "text": "So something stopped it."}, {"time": 384, "text": "So you mean if you, right, for like a few million years, if you sent out probes that travel close, what's sublight?"}, {"time": 390, "text": "You mean close to the speed of light?"}, {"time": 392, "text": "Let's say 0.1 C. And it just spreads."}, {"time": 395, "text": "Actually, that's an interesting calculation, huh?"}, {"time": 398, "text": "So what makes you think that we'd be able to communicate with them?"}, {"time": 402, "text": "Like, yeah, what's, why do you think we would be able to be able to comprehend intelligent lives that are out there?"}, {"time": 411, "text": "Like even if they were among us kind of thing, like, or even just flying around?"}, {"time": 417, "text": "Well, I mean, that's possible."}, {"time": 421, "text": "It's possible that there is some sort of prime directive."}, {"time": 424, "text": "That'd be a really cool universe to live in."}, {"time": 427, "text": "And there's some reason they're not making themselves visible to us."}, {"time": 430, "text": "But it makes sense that they would use the same, well, at least the same entropy."}, {"time": 436, "text": "Well, you're implying the same laws of physics."}, {"time": 438, "text": "I don't know what you mean by entropy in this case."}, {"time": 441, "text": "I mean, if entropy is the scarce resource in the universe."}, {"time": 445, "text": "So what do you think about like Stephen Wolfram and everything is a computation?"}, {"time": 448, "text": "And then what if they are traveling through this world of computation?"}, {"time": 452, "text": "So if you think of the universe as just information processing, then what you're referring to with entropy and then these pockets of interesting complex computation swimming around, how do we know they're not already here?"}, {"time": 467, "text": "How do we know that this, like all the different amazing things that are full of mystery on earth are just like little footprints of intelligence from light years away?"}, {"time": 482, "text": "I mean, I tend to think that as civilizations expand, they use more and more energy and you can never overcome the problem of waste heat."}, {"time": 490, "text": "So where is there waste heat?"}, {"time": 491, "text": "So we'd be able to, with our crude methods, be able to see like, there's a whole lot of energy here."}, {"time": 498, "text": "But it could be something we're not, I mean, we don't understand dark energy, right?"}, {"time": 502, "text": "Dark matter."}, {"time": 503, "text": "It could be just stuff we don't understand at all."}, {"time": 506, "text": "Or they can have a fundamentally different physics, you know, like that we just don't even comprehend."}, {"time": 512, "text": "Well, I think, okay, I mean, it depends how far out you wanna go."}, {"time": 515, "text": "I don't think physics is very different on the other side of the galaxy."}, {"time": 519, "text": "I would suspect that they have, I mean, if they're in our universe, they have the same physics."}, {"time": 525, "text": "Well, yeah, that's the assumption we have, but there could be like super trippy things like our cognition only gets to a slice, and all the possible instruments that we can design only get to a particular slice of the universe."}, {"time": 541, "text": "And there's something much like weirder."}, {"time": 544, "text": "Maybe we can try a thought experiment."}, {"time": 546, "text": "Would people from the past be able to detect the remnants of our, or would we be able to detect our modern civilization?"}, {"time": 556, "text": "I think the answer is obviously yes."}, {"time": 558, "text": "You mean past from a hundred years ago?"}, {"time": 560, "text": "Well, let's even go back further."}, {"time": 562, "text": "Let's go to a million years ago, right?"}, {"time": 564, "text": "The humans who were lying around in the desert probably didn't even have, maybe they just barely had fire."}, {"time": 571, "text": "They would understand if a 747 flew overhead."}, {"time": 575, "text": "Oh, in this vicinity, but not if a 747 flew on Mars."}, {"time": 583, "text": "Like, cause they wouldn't be able to see far, cause we're not actually communicating that well with the rest of the universe."}, {"time": 588, "text": "We're doing okay."}, {"time": 590, "text": "Just sending out random like fifties tracks of music."}, {"time": 595, "text": "And yeah, I mean, they'd have to, you know, we've only been broadcasting radio waves for 150 years."}, {"time": 602, "text": "And well, there's your light cone."}, {"time": 606, "text": "What do you make about all the, I recently came across this having talked to David Fravor."}, {"time": 614, "text": "I don't know if you caught what the videos of the Pentagon released and the New York Times reporting of the UFO sightings."}, {"time": 623, "text": "So I kind of looked into it, quote unquote."}, {"time": 626, "text": "And there's actually been like hundreds of thousands of UFO sightings, right?"}, {"time": 633, "text": "And a lot of it you can explain away in different kinds of ways."}, {"time": 637, "text": "So one is it could be interesting physical phenomena."}, {"time": 640, "text": "Two, it could be people wanting to believe and therefore they conjure up a lot of different things that just, you know, when you see different kinds of lights, some basic physics phenomena, and then you just conjure up ideas of possible out there mysterious worlds."}, {"time": 656, "text": "But, you know, it's also possible, like you have a case of David Fravor, who is a Navy pilot, who's, you know, as legit as it gets in terms of humans who are able to perceive things in the environment and make conclusions, whether those things are a threat or not."}, {"time": 677, "text": "And he and several other pilots saw a thing, I don't know if you followed this, but they saw a thing that they've since then called TikTok that moved in all kinds of weird ways."}, {"time": 690, "text": "It could be technology developed by the United States and they're just not aware of it and the surface level from the Navy, right?"}, {"time": 700, "text": "It could be different kind of lighting technology or drone technology, all that kind of stuff."}, {"time": 705, "text": "It could be the Russians and the Chinese, all that kind of stuff."}, {"time": 708, "text": "And of course their mind, our mind, can also venture into the possibility that it's from another world."}, {"time": 716, "text": "Have you looked into this at all?"}, {"time": 718, "text": "What do you think about it?"}, {"time": 719, "text": "I think all the news is a psyop."}, {"time": 721, "text": "I think that the most plausible."}, {"time": 725, "text": "Nothing is real."}, {"time": 726, "text": "Yeah, I listened to the, I think it was Bob Lazar on Joe Rogan."}, {"time": 732, "text": "And like, I believe everything this guy is saying."}, {"time": 735, "text": "And then I think that it's probably just some like MKUltra kind of thing, you know?"}, {"time": 741, "text": "Like they, you know, they made some weird thing and they called it an alien spaceship."}, {"time": 746, "text": "You know, maybe it was just to like stimulate young physicists minds."}, {"time": 749, "text": "We'll tell them it's alien technology and we'll see what they come up with, right?"}, {"time": 753, "text": "Do you find any conspiracy theories compelling?"}, {"time": 756, "text": "Like have you pulled at the string of the rich complex world of conspiracy theories that's out there?"}, {"time": 763, "text": "I think that I've heard a conspiracy theory that conspiracy theories were invented by the CIA in the 60s to discredit true things."}, {"time": 773, "text": "So, you know, you can go to ridiculous conspiracy theories like Flat Earth and Pizza Gate."}, {"time": 781, "text": "And, you know, these things are almost to hide like conspiracy theories that like, you know, remember when the Chinese like locked up the doctors who discovered coronavirus?"}, {"time": 791, "text": "Like I tell people this and I'm like, no, no, no, that's not a conspiracy theory."}, {"time": 794, "text": "That actually happened."}, {"time": 795, "text": "Do you remember the time that the money used to be backed by gold and now it's backed by nothing?"}, {"time": 800, "text": "This is not a conspiracy theory."}, {"time": 801, "text": "This actually happened."}, {"time": 803, "text": "Well, that's one of my worries today with the idea of fake news is that when nothing is real, then like you dilute the possibility of anything being true by conjuring up all kinds of conspiracy theories."}, {"time": 821, "text": "And then you don't know what to believe."}, {"time": 822, "text": "And then like the idea of truth of objectivity is lost completely."}, {"time": 827, "text": "Everybody has their own truth."}, {"time": 830, "text": "So you used to control information by censoring it."}, {"time": 833, "text": "And then the internet happened and governments were like, oh shit, we can't censor things anymore."}, {"time": 838, "text": "I know what we'll do."}, {"time": 840, "text": "You know, it's the old story of the story of like tying a flag with a leprechaun tells you his gold is buried and you tie one flag and you make the leprechaun swear to not remove the flag."}, {"time": 850, "text": "And you come back to the field later with a shovel and there's flags everywhere."}, {"time": 854, "text": "That's one way to maintain privacy, right?"}, {"time": 856, "text": "It's like in order to protect the contents of this conversation, for example, we could just generate like millions of deep, fake conversations where you and I talk and say random things."}, {"time": 869, "text": "So this is just one of them and nobody knows which one was the real one."}, {"time": 872, "text": "This could be fake right now."}, {"time": 874, "text": "Classic steganography technique."}, {"time": 877, "text": "Okay, another absurd question about intelligent life."}, {"time": 879, "text": "Cause you know, you're an incredible programmer outside of everything else we'll talk about just as a programmer."}, {"time": 889, "text": "Do you think intelligent beings out there, the civilizations that were out there, had computers and programming?"}, {"time": 898, "text": "Did they, do we naturally have to develop something where we engineer machines and are able to encode both knowledge into those machines and instructions that process that knowledge, process that information to make decisions and actions and so on?"}, {"time": 915, "text": "And would those programming languages, if you think they exist, be at all similar to anything we've developed?"}, {"time": 924, "text": "So I don't see that much of a difference between quote unquote natural languages and programming languages."}, {"time": 935, "text": "I think there's so many similarities."}, {"time": 936, "text": "So when asked the question, what do alien languages look like?"}, {"time": 942, "text": "I imagine they're not all that dissimilar from ours."}, {"time": 946, "text": "And I think translating in and out of them wouldn't be that crazy."}, {"time": 952, "text": "Well, it's difficult to compile like DNA to Python and then to C. There's a little bit of a gap in the kind of languages we use for touring machines and the kind of languages nature seems to use a little bit."}, {"time": 970, "text": "Maybe that's just, we just haven't understood the kind of language that nature uses well yet."}, {"time": 976, "text": "DNA is a CAD model."}, {"time": 979, "text": "It's not quite a programming language."}, {"time": 981, "text": "It has no sort of a serial execution."}, {"time": 985, "text": "It's not quite a, yeah, it's a CAD model."}, {"time": 989, "text": "So I think in that sense, we actually completely understand it."}, {"time": 992, "text": "The problem is, well, simulating on these CAD models, I played with it a bit this year, is super computationally intensive."}, {"time": 1001, "text": "If you wanna go down to like the molecular level where you need to go to see a lot of these phenomenon like protein folding."}, {"time": 1008, "text": "So yeah, it's not that we don't understand it."}, {"time": 1012, "text": "It just requires a whole lot of compute to kind of compile it."}, {"time": 1015, "text": "For our human minds, it's inefficient, both for the data representation and for the programming."}, {"time": 1020, "text": "Yeah, it runs well on raw nature."}, {"time": 1022, "text": "It runs well on raw nature."}, {"time": 1023, "text": "And when we try to build emulators or simulators for that, well, they're mad slow, but I've tried it."}, {"time": 1030, "text": "It runs in that, yeah, you've commented elsewhere, I don't remember where, that one of the problems is simulating nature is tough."}, {"time": 1080, "text": "I think you can do tons of crazy biology and test tubes."}, {"time": 1085, "text": "I think my bigger complaint is more, oh, the tools are so bad."}, {"time": 1091, "text": "Like literally, you mean like libraries and?"}, {"time": 1094, "text": "I don't know, I'm not pipetting shit."}, {"time": 1096, "text": "Like you're handing me a, I got a, no, no, no, there has to be some."}, {"time": 1102, "text": "Like automating stuff."}, {"time": 1104, "text": "And like the, yeah, but human biology is messy."}, {"time": 1108, "text": "Like it seems."}, {"time": 1109, "text": "But like, look at those Toronto's videos."}, {"time": 1111, "text": "They were a joke."}, {"time": 1112, "text": "It's like a little gantry."}, {"time": 1113, "text": "It's like little X, Y gantry, high school science project with the pipette."}, {"time": 1116, "text": "I'm like, really?"}, {"time": 1118, "text": "Gotta be something better."}, {"time": 1119, "text": "You can't build like nice microfluidics and I can program the computation to bio interface."}, {"time": 1125, "text": "I mean, this is gonna happen."}, {"time": 1127, "text": "But like right now, if you are asking me to pipette 50 milliliters of solution, I'm out."}, {"time": 1134, "text": "This is so crude."}, {"time": 1136, "text": "Okay, let's get all the crazy out of the way."}, {"time": 1139, "text": "So a bunch of people asked me, since we talked about the simulation last time, we talked about hacking the simulation."}, {"time": 1146, "text": "Do you have any updates, any insights about how we might be able to go about hacking simulation if we indeed do live in a simulation?"}, {"time": 1157, "text": "I think a lot of people misinterpreted the point of that South by talk."}, {"time": 1162, "text": "The point of the South by talk was not literally to hack the simulation."}, {"time": 1166, "text": "I think that this is an idea is literally just, I think theoretical physics."}, {"time": 1174, "text": "I think that's the whole goal, right?"}, {"time": 1179, "text": "You want your grand unified theory, but then, okay, build a grand unified theory search for exploits, right?"}, {"time": 1185, "text": "I think we're nowhere near actually there yet."}, {"time": 1187, "text": "My hope with that was just more to like, are you people kidding me with the things you spend time thinking about?"}, {"time": 1194, "text": "Do you understand like kind of how small you are?"}, {"time": 1198, "text": "You are bytes and God's computer, really?"}, {"time": 1202, "text": "And the things that people get worked up about, you know?"}, {"time": 1206, "text": "So basically, it was more a message of we should humble ourselves."}, {"time": 1212, "text": "That we get to, like what are we humans in this byte code?"}, {"time": 1219, "text": "Yeah, and not just humble ourselves, but like I'm not trying to like make people guilty or anything like that."}, {"time": 1225, "text": "I'm trying to say like, literally, look at what you are spending time on, right?"}, {"time": 1230, "text": "What are you referring to?"}, {"time": 1231, "text": "You're referring to the Kardashians?"}, {"time": 1234, "text": "Twitter?"}, {"time": 1234, "text": "No, the Kardashians, everyone knows that's kind of fun."}, {"time": 1238, "text": "I'm referring more to like the economy, you know?"}, {"time": 1242, "text": "This idea that we gotta up our stock price."}, {"time": 1250, "text": "Or what is the goal function of humanity?"}, {"time": 1255, "text": "You don't like the game of capitalism?"}, {"time": 1257, "text": "Like you don't like the games we've constructed for ourselves as humans?"}, {"time": 1260, "text": "I'm a big fan of capitalism."}, {"time": 1262, "text": "I don't think that's really the game we're playing right now."}, {"time": 1265, "text": "I think we're playing a different game where the rules are rigged."}, {"time": 1270, "text": "Okay, which games are interesting to you that we humans have constructed and which aren't?"}, {"time": 1274, "text": "Which are productive and which are not?"}, {"time": 1278, "text": "Actually, maybe that's the real point of the talk."}, {"time": 1281, "text": "It's like, stop playing these fake human games."}, {"time": 1285, "text": "There's a real game here."}, {"time": 1286, "text": "We can play the real game."}, {"time": 1288, "text": "The real game is, you know, nature wrote the rules."}, {"time": 1291, "text": "This is a real game."}, {"time": 1292, "text": "There still is a game to play."}, {"time": 1295, "text": "But if you look at, sorry to interrupt, I don't know if you've seen the Instagram account, nature is metal."}, {"time": 1300, "text": "The game that nature seems to be playing is a lot more cruel than we humans want to put up with."}, {"time": 1307, "text": "Or at least we see it as cruel."}, {"time": 1309, "text": "It's like the bigger thing eats the smaller thing and does it to impress another big thing so it can mate with that thing."}, {"time": 1320, "text": "And that's it."}, {"time": 1321, "text": "That seems to be the entirety of it."}, {"time": 1324, "text": "Well, there's no art, there's no music, there's no comma AI, there's no comma one, no comma two, no George Hots with his brilliant talks at South by Southwest."}, {"time": 1337, "text": "I disagree, though."}, {"time": 1337, "text": "I disagree that this is what nature is."}, {"time": 1339, "text": "I think nature just provided basically a open world MMORPG."}, {"time": 1346, "text": "And, you know, here it's open world."}, {"time": 1349, "text": "I mean, if that's the game you want to play, you can play that game."}, {"time": 1352, "text": "But isn't that beautiful?"}, {"time": 1353, "text": "I don't know if you played Diablo."}, {"time": 1355, "text": "They used to have, I think, cow level where it's..."}, {"time": 1359, "text": "So everybody will go just, they figured out this, like the best way to gain like experience points is to just slaughter cows over and over and over."}, {"time": 1372, "text": "And so they figured out this little sub game within the bigger game that this is the most efficient way to get experience points."}, {"time": 1379, "text": "And everybody somehow agreed that getting experience points in RPG context where you always want to be getting more stuff, more skills, more levels, keep advancing."}, {"time": 1389, "text": "That seems to be good."}, {"time": 1390, "text": "So might as well sacrifice actual enjoyment of playing a game, exploring a world, and spending like hundreds of hours of your time at cow level."}, {"time": 1402, "text": "I mean, the number of hours I spent in cow level, I'm not like the most impressive person because people have spent probably thousands of hours there, but it's ridiculous."}, {"time": 1411, "text": "So that's a little absurd game that brought me joy in some weird dopamine drug kind of way."}, {"time": 1417, "text": "So you don't like those games."}, {"time": 1420, "text": "You don't think that's us humans feeling the nature."}, {"time": 1427, "text": "And that was the point of the talk."}, {"time": 1430, "text": "So how do we hack it then?"}, {"time": 1431, "text": "Well, I want to live forever."}, {"time": 1432, "text": "And I want to live forever."}, {"time": 1435, "text": "And this is the goal."}, {"time": 1436, "text": "Well, that's a game against nature."}, {"time": 1439, "text": "Yeah, immortality is the good objective function to you?"}, {"time": 1443, "text": "I mean, start there and then you can do whatever else you want because you got a long time."}, {"time": 1447, "text": "What if immortality makes the game just totally not fun?"}, {"time": 1450, "text": "I mean, like, why do you assume immortality is somehow a good objective function?"}, {"time": 1458, "text": "It's not immortality that I want."}, {"time": 1459, "text": "A true immortality where I could not die, I would prefer what we have right now."}, {"time": 1465, "text": "But I want to choose my own death, of course."}, {"time": 1467, "text": "I don't want nature to decide when I die, I'm going to win."}, {"time": 1470, "text": "I'm going to be you."}, {"time": 1473, "text": "And then at some point, if you choose commit suicide, like how long do you think you'd live?"}, {"time": 1481, "text": "Until I get bored."}, {"time": 1483, "text": "See, I don't think people like brilliant people like you that really ponder living a long time are really considering how meaningless life becomes."}, {"time": 1498, "text": "Well, I want to know everything and then I'm ready to die."}, {"time": 1503, "text": "As long as there's... Yeah, but why do you want, isn't it possible that you want to know everything because it's finite?"}, {"time": 1509, "text": "Like the reason you want to know quote unquote everything is because you don't have enough time to know everything."}, {"time": 1516, "text": "And once you have unlimited time, then you realize like, why do anything?"}, {"time": 1522, "text": "Like why learn anything?"}, {"time": 1525, "text": "I want to know everything and then I'm ready to die."}, {"time": 1527, "text": "So you have, yeah."}, {"time": 1528, "text": "It's not a, like, it's a terminal value."}, {"time": 1530, "text": "It's not in service of anything else."}, {"time": 1534, "text": "I'm conscious of the possibility, this is not a certainty, but the possibility of that engine of curiosity that you're speaking to is actually a symptom of the finiteness of life."}, {"time": 1549, "text": "Like without that finiteness, your curiosity would vanish."}, {"time": 1555, "text": "Like a morning fog."}, {"time": 1557, "text": "Bukowski talked about love like that."}, {"time": 1559, "text": "Then let me solve immortality and let me change the thing in my brain that reminds me of the fact that I'm immortal, tells me that life is finite shit."}, {"time": 1566, "text": "Maybe I'll have it tell me that life ends next week."}, {"time": 1570, "text": "I'm okay with some self manipulation like that."}, {"time": 1572, "text": "I'm okay with deceiving myself."}, {"time": 1574, "text": "Oh, Rika, changing the code."}, {"time": 1577, "text": "Yeah, well, if that's the problem, right?"}, {"time": 1578, "text": "If the problem is that I will no longer have that, that curiosity, I'd like to have backup copies of myself, which I check in with occasionally to make sure they're okay with the trajectory and they can kind of override it."}, {"time": 1591, "text": "Maybe a nice, like, I think of like those wave nets, those like logarithmic go back to the copies."}, {"time": 1595, "text": "Yeah, but sometimes it's not reversible."}, {"time": 1596, "text": "Like I've done this with video games."}, {"time": 1599, "text": "Once you figure out the cheat code or like you look up how to cheat old school, like single player, it ruins the game for you."}, {"time": 1607, "text": "It ruins that feeling."}, {"time": 1608, "text": "But again, that just means our brain manipulation technology is not good enough yet."}, {"time": 1613, "text": "Remove that cheat code from your brain."}, {"time": 1614, "text": "Here you go."}, {"time": 1615, "text": "So it's also possible that if we figure out immortality, that all of us will kill ourselves before we advance far enough to be able to revert the change."}, {"time": 1628, "text": "I'm not killing myself till I know everything, so."}, {"time": 1631, "text": "That's what you say now, because your life is finite."}, {"time": 1635, "text": "You know, I think yes, self modifying systems gets, comes up with all these hairy complexities and can I promise that I'll do it perfectly?"}, {"time": 1643, "text": "No, but I think I can put good safety structures in place."}, {"time": 1647, "text": "So that talk and your thinking here is not literally referring to a simulation and that our universe is a kind of computer program running on a computer."}, {"time": 1662, "text": "That's more of a thought experiment."}, {"time": 1665, "text": "Do you also think of the potential of the sort of Bostrom, Elon Musk and others that talk about an actual program that simulates our universe?"}, {"time": 1679, "text": "Oh, I don't doubt that we're in a simulation."}, {"time": 1681, "text": "I just think that it's not quite that important."}, {"time": 1685, "text": "I mean, I'm interested only in simulation theory as far as like it gives me power over nature."}, {"time": 1689, "text": "If it's totally unfalsifiable, then who cares?"}, {"time": 1693, "text": "I mean, what do you think that experiment would look like?"}, {"time": 1695, "text": "Like somebody on Twitter asks, asks George what signs we would look for to know whether or not we're in the simulation, which is exactly what you're asking is like, the step that precedes the step of knowing how to get more power from this knowledge is to get an indication that there's some power to be gained."}, {"time": 1715, "text": "So get an indication that there, you can discover and exploit cracks in the simulation or it doesn't have to be in the physics of the universe."}, {"time": 1726, "text": "Show me, I mean, like a memory leak could be cool."}, {"time": 1731, "text": "Like some scrying technology, you know?"}, {"time": 1734, "text": "What kind of technology?"}, {"time": 1735, "text": "Scrying?"}, {"time": 1737, "text": "Oh, that's a weird, scrying is the paranormal ability to like remote viewing, like being able to see somewhere where you're not."}, {"time": 1748, "text": "So, you know, I don't think you can do it by chanting in a room, but if we could find, it's a memory leak, basically."}, {"time": 1756, "text": "It's a memory leak."}, {"time": 1757, "text": "Yeah, you're able to access parts you're not supposed to."}, {"time": 1760, "text": "And thereby discover a shortcut."}, {"time": 1762, "text": "Yeah, maybe memory leak means the other thing as well, but I mean like, yeah, like an ability to read arbitrary memory, right?"}, {"time": 1768, "text": "And that one's not that horrifying, right?"}, {"time": 1769, "text": "The right ones start to be horrifying."}, {"time": 1771, "text": "Read, right."}, {"time": 1772, "text": "It's the reading is not the problem."}, {"time": 1774, "text": "Yeah, it's like Heartfleet for the universe."}, {"time": 1777, "text": "Oh boy, the writing is a big, big problem."}, {"time": 1780, "text": "It's a big problem."}, {"time": 1783, "text": "It's the moment you can write anything, even if it's just random noise."}, {"time": 1789, "text": "I mean, even without that, like even some of the, you know, the nanotech stuff that's coming, I think is."}, {"time": 1797, "text": "I don't know if you're paying attention, but actually Eric Weistand came out with the theory of everything."}, {"time": 1802, "text": "I mean, that came out."}, {"time": 1803, "text": "He's been working on a theory of everything in the physics world called geometric unity."}, {"time": 1808, "text": "And then for me, from computer science person like you, Steven Wolfram's theory of everything, of like hypergraphs is super interesting and beautiful, but not from a physics perspective, but from a computational perspective."}, {"time": 1820, "text": "I don't know, have you paid attention to any of that?"}, {"time": 1823, "text": "So again, like what would make me pay attention and like why like I hate string theory is, okay, make a testable prediction, right?"}, {"time": 1831, "text": "I'm only interested in, I'm not interested in theories for their intrinsic beauty."}, {"time": 1836, "text": "I'm interested in theories that give me power over the universe."}, {"time": 1839, "text": "So if these theories do, I'm very interested."}, {"time": 1843, "text": "Can I just say how beautiful that is?"}, {"time": 1845, "text": "Because a lot of physicists say, I'm interested in experimental validation and they skip out the part where they say to give me more power in the universe."}, {"time": 1855, "text": "I just love the."}, {"time": 1857, "text": "No, I want."}, {"time": 1857, "text": "The clarity of that."}, {"time": 1859, "text": "I want 100 gigahertz processors."}, {"time": 1862, "text": "I want transistors that are smaller than atoms."}, {"time": 1864, "text": "I want like power."}, {"time": 1870, "text": "And that's where people from aliens to this kind of technology where people are worried that governments, like who owns that power?"}, {"time": 1879, "text": "Is it George Harts?"}, {"time": 1880, "text": "Is it thousands of distributed hackers across the world?"}, {"time": 1885, "text": "Is it governments?"}, {"time": 1886, "text": "Is it Mark Zuckerberg?"}, {"time": 1888, "text": "There's a lot of people that, I don't know if anyone trusts any one individual with power."}, {"time": 1895, "text": "So they're always worried."}, {"time": 1897, "text": "It's the beauty of blockchains."}, {"time": 1899, "text": "That's the beauty of blockchains, which we'll talk about."}, {"time": 1903, "text": "On Twitter, somebody pointed me to a story, a bunch of people pointed me to a story a few months ago where you went into a restaurant in New York."}, {"time": 1911, "text": "And you can correct me if any of this is wrong."}, {"time": 1913, "text": "And ran into a bunch of folks from a company in a crypto company who are trying to scale up Ethereum."}, {"time": 1921, "text": "And they had a technical deadline related to solidity to OVM compiler."}, {"time": 1927, "text": "So these are all Ethereum technologies."}, {"time": 1929, "text": "So you stepped in, they recognized you, pulled you aside, explained their problem."}, {"time": 1936, "text": "And you stepped in and helped them solve the problem, thereby creating legend status story."}, {"time": 1943, "text": "So can you tell me the story in a little more detail?"}, {"time": 1948, "text": "It seems kind of incredible."}, {"time": 1951, "text": "Did this happen?"}, {"time": 1952, "text": "Yeah, yeah, it's a true story, it's a true story."}, {"time": 1954, "text": "I mean, they wrote a very flattering account of it."}, {"time": 1959, "text": "So Optimism is the company called Optimism, spin off of Plasma."}, {"time": 1965, "text": "They're trying to build L2 solutions on Ethereum."}, {"time": 1967, "text": "So right now, every Ethereum node has to run every transaction on the Ethereum network."}, {"time": 1976, "text": "And this kind of doesn't scale, right?"}, {"time": 1978, "text": "Because if you have N computers, well, if that becomes two N computers, you actually still get the same amount of compute, right?"}, {"time": 1985, "text": "This is like all of one scaling because they all have to run it."}, {"time": 1990, "text": "Okay, fine, you get more blockchain security, but like, blockchain is already so secure."}, {"time": 1995, "text": "Can we trade some of that off for speed?"}, {"time": 1997, "text": "So that's kind of what these L2 solutions are."}, {"time": 2000, "text": "They built this thing, which kind of, kind of sandbox for Ethereum contracts."}, {"time": 2006, "text": "So they can run it in this L2 world and it can't do certain things in L world, in L1."}, {"time": 2010, "text": "Can I ask you for some definitions?"}, {"time": 2012, "text": "What's L2?"}, {"time": 2013, "text": "Oh, L2 is layer two."}, {"time": 2014, "text": "So L1 is like the base Ethereum chain."}, {"time": 2017, "text": "And then layer two is like a computational layer that runs elsewhere, but still is kind of secured by layer one."}, {"time": 2027, "text": "And I'm sure a lot of people know, but Ethereum is a cryptocurrency, probably one of the most popular cryptocurrency second to Bitcoin."}, {"time": 2035, "text": "And a lot of interesting technological innovation there."}, {"time": 2038, "text": "Maybe you could also slip in whenever you talk about this and things that are exciting to you in the Ethereum space."}, {"time": 2046, "text": "And why Ethereum?"}, {"time": 2047, "text": "Well, I mean, Bitcoin is not Turing complete."}, {"time": 2052, "text": "Ethereum is not technically Turing complete with the gas limit, but close enough."}, {"time": 2056, "text": "With the gas limit?"}, {"time": 2056, "text": "What's the gas limit, resources?"}, {"time": 2059, "text": "Yeah, I mean, no computer is actually Turing complete."}, {"time": 2063, "text": "You're gonna find out RAM, you know?"}, {"time": 2064, "text": "I can actually solve the whole thing."}, {"time": 2065, "text": "What's the word gas limit?"}, {"time": 2066, "text": "You just have so many brilliant words."}, {"time": 2068, "text": "I'm not even gonna ask."}, {"time": 2069, "text": "That's not my word, that's Ethereum's word."}, {"time": 2072, "text": "Gas limit."}, {"time": 2073, "text": "Ethereum, you have to spend gas per instruction."}, {"time": 2075, "text": "So like different op codes use different amounts of gas and you buy gas with ether to prevent people from basically DDoSing the network."}, {"time": 2082, "text": "So Bitcoin is proof of work."}, {"time": 2085, "text": "And then what's Ethereum?"}, {"time": 2087, "text": "It's also proof of work."}, {"time": 2088, "text": "They're working on some proof of stake, Ethereum 2.0 stuff."}, {"time": 2091, "text": "But right now it's proof of work."}, {"time": 2092, "text": "It uses a different hash function from Bitcoin."}, {"time": 2094, "text": "That's more ASIC resistance, because you need RAM."}, {"time": 2097, "text": "So we're all talking about Ethereum 1.0."}, {"time": 2099, "text": "So what were they trying to do to scale this whole process?"}, {"time": 2103, "text": "So they were like, well, if we could run contracts elsewhere and then only save the results of that computation, well, we don't actually have to do the compute on the chain."}, {"time": 2114, "text": "We can do the compute off chain and just post what the results are."}, {"time": 2117, "text": "Now, the problem with that is, well, somebody could lie about what the results are."}, {"time": 2121, "text": "So you need a resolution mechanism."}, {"time": 2123, "text": "And the resolution mechanism can be really expensive because you just have to make sure that the person who is saying, look, I swear that this is the real computation."}, {"time": 2133, "text": "I'm staking $10,000 on that fact."}, {"time": 2136, "text": "And if you prove it wrong, yeah, it might cost you $3,000 in gas fees to prove wrong, but you'll get the $10,000 bounty."}, {"time": 2144, "text": "So you can secure using those kinds of systems."}, {"time": 2147, "text": "So it's effectively a sandbox, which runs contracts."}, {"time": 2152, "text": "And like, it's like any kind of normal sandbox, you have to like replace syscalls with calls into the hypervisor."}, {"time": 2162, "text": "Sandbox, syscalls, hypervisor."}, {"time": 2166, "text": "As long as it's interesting to talk about."}, {"time": 2169, "text": "Yeah, I mean, you can take like the Chrome sandbox is maybe the one to think about, right?"}, {"time": 2172, "text": "So the Chrome process that's doing a rendering, can't, for example, read a file from the file system."}, {"time": 2178, "text": "It has, if it tries to make an open syscall in Linux, the open syscall, you can't make it open syscall, no, no, no."}, {"time": 2184, "text": "You have to request from the kind of hypervisor process or like, I don't know what it's called in Chrome, but the, hey, could you open this file for me?"}, {"time": 2196, "text": "And then it does all these checks and then it passes the file handle back in if it's approved."}, {"time": 2202, "text": "So what's the, in the context of Ethereum, what are the boundaries of the sandbox that we're talking about?"}, {"time": 2208, "text": "Well, like one of the calls that you, actually reading and writing any state to the Ethereum contract, or to the Ethereum blockchain."}, {"time": 2218, "text": "Writing state is one of those calls that you're going to have to sandbox in layer two, because if you let layer two just arbitrarily write to the Ethereum blockchain."}, {"time": 2229, "text": "So layer two is really sitting on top of layer one."}, {"time": 2235, "text": "So you're going to have a lot of different kinds of ideas that you can play with."}, {"time": 2238, "text": "And they're all, they're not fundamentally changing the source code level of Ethereum."}, {"time": 2245, "text": "Well, you have to replace a bunch of calls with calls into the hypervisor."}, {"time": 2251, "text": "So instead of doing the syscall directly, you replace it with a call to the hypervisor."}, {"time": 2257, "text": "So originally they were doing this by first running the, so Solidity is the language that most Ethereum contracts are written in."}, {"time": 2265, "text": "It compiles to a bytecode."}, {"time": 2267, "text": "And then they wrote this thing they called the transpiler."}, {"time": 2270, "text": "And the transpiler took the bytecode and it transpiled it into OVM safe bytecode."}, {"time": 2276, "text": "Basically bytecode that didn't make any of those restricted syscalls and added the calls to the hypervisor."}, {"time": 2281, "text": "This transpiler was a 3000 line mess."}, {"time": 2285, "text": "And it's hard to do."}, {"time": 2287, "text": "It's hard to do if you're trying to do it like that, because you have to kind of like deconstruct the bytecode, change things about it, and then reconstruct it."}, {"time": 2295, "text": "And I mean, as soon as I hear this, I'm like, well, why don't you just change the compiler, right?"}, {"time": 2300, "text": "Why not the first place you build the bytecode, just do it in the compiler."}, {"time": 2305, "text": "So yeah, I asked them how much they wanted it."}, {"time": 2309, "text": "Of course, measured in dollars and I'm like, well, okay."}, {"time": 2314, "text": "And you wrote the compiler."}, {"time": 2315, "text": "Yeah, I modified, I wrote a 300 line diff to the compiler."}, {"time": 2319, "text": "It's open source, you can look at it."}, {"time": 2320, "text": "Yeah, it's, yeah, I looked at the code last night."}, {"time": 2323, "text": "It's, yeah, exactly."}, {"time": 2326, "text": "Cute is a good word for it."}, {"time": 2329, "text": "And it's C++."}, {"time": 2332, "text": "C++, yeah."}, {"time": 2334, "text": "So when asked how you were able to do it, you said, you just gotta think and then do it right."}, {"time": 2343, "text": "So can you break that apart a little bit?"}, {"time": 2344, "text": "What's your process of one, thinking and two, doing it right?"}, {"time": 2349, "text": "You know, the people that I was working for were amused that I said that."}, {"time": 2353, "text": "It doesn't really mean anything."}, {"time": 2356, "text": "I mean, is there some deep, profound insights to draw from like how you problem solve from that?"}, {"time": 2363, "text": "This is always what I say."}, {"time": 2364, "text": "I'm like, do you wanna be a good programmer?"}, {"time": 2366, "text": "Do it for 20 years."}, {"time": 2367, "text": "Yeah, there's no shortcuts."}, {"time": 2371, "text": "What are your thoughts on crypto in general?"}, {"time": 2373, "text": "So what parts technically or philosophically do you find especially beautiful maybe?"}, {"time": 2380, "text": "Oh, I'm extremely bullish on crypto longterm."}, {"time": 2382, "text": "Not any specific crypto project, but this idea of, well, two ideas."}, {"time": 2390, "text": "One, the Nakamoto Consensus Algorithm is I think one of the greatest innovations of the 21st century."}, {"time": 2398, "text": "This idea that people can reach consensus."}, {"time": 2401, "text": "You can reach a group consensus."}, {"time": 2403, "text": "Using a relatively straightforward algorithm is wild."}, {"time": 2408, "text": "And like, you know, Satoshi Nakamoto, people always ask me who I look up to."}, {"time": 2415, "text": "It's like, whoever that is."}, {"time": 2417, "text": "Who do you think it is?"}, {"time": 2419, "text": "I mean, Elon Musk?"}, {"time": 2421, "text": "Is it you?"}, {"time": 2422, "text": "It is definitely not me."}, {"time": 2424, "text": "And I do not think it's Elon Musk."}, {"time": 2426, "text": "But yeah, this idea of groups reaching consensus in a decentralized yet formulaic way is one extremely powerful idea from crypto."}, {"time": 2440, "text": "Maybe the second idea is this idea of smart contracts."}, {"time": 2445, "text": "When you write a contract between two parties, any contract, this contract, if there are disputes, it's interpreted by lawyers."}, {"time": 2456, "text": "Lawyers are just really shitty overpaid interpreters."}, {"time": 2460, "text": "Imagine you had, let's talk about them in terms of a, in terms of like, let's compare a lawyer to Python, right?"}, {"time": 2465, "text": "So lawyer, well, okay."}, {"time": 2467, "text": "That's really, I never thought of it that way."}, {"time": 2471, "text": "So Python, I'm paying even 10 cents an hour."}, {"time": 2475, "text": "I'll use the nice Azure machine."}, {"time": 2477, "text": "I can run Python for 10 cents an hour."}, {"time": 2479, "text": "Lawyers cost $1,000 an hour."}, {"time": 2481, "text": "So Python is 10,000 X better on that axis."}, {"time": 2485, "text": "Lawyers don't always return the same answer."}, {"time": 2491, "text": "Python almost always does."}, {"time": 2496, "text": "Cost."}, {"time": 2497, "text": "Yeah, I mean, just cost, reliability, everything about Python is so much better than lawyers."}, {"time": 2503, "text": "So if you can make smart contracts, this whole concept of code is law."}, {"time": 2510, "text": "I love, and I would love to live in a world where everybody accepted that fact."}, {"time": 2515, "text": "So maybe you can talk about what smart contracts are."}, {"time": 2521, "text": "So let's say, let's say, you know, we have a, even something as simple as a safety deposit box, right?"}, {"time": 2531, "text": "Safety deposit box that holds a million dollars."}, {"time": 2534, "text": "I have a contract with the bank that says two out of these three parties must be present to open the safety deposit box and get the money out."}, {"time": 2545, "text": "So that's a contract for the bank, and it's only as good as the bank and the lawyers, right?"}, {"time": 2549, "text": "Let's say, you know, somebody dies and now, oh, we're gonna go through a big legal dispute about whether, oh, well, was it in the will, was it not in the will?"}, {"time": 2557, "text": "What, like, it's just so messy, and the cost to determine truth is so expensive."}, {"time": 2564, "text": "Versus a smart contract, which just uses cryptography to check if two out of three keys are present."}, {"time": 2570, "text": "Well, I can look at that, and I can have certainty in the answer that it's going to return."}, {"time": 2575, "text": "And that's what, all businesses want is certainty."}, {"time": 2578, "text": "You know, they say businesses don't care."}, {"time": 2579, "text": "Viacom, YouTube, YouTube's like, look, we don't care which way this lawsuit goes."}, {"time": 2584, "text": "Just please tell us so we can have certainty."}, {"time": 2587, "text": "Yeah, I wonder how many agreements in this, because we're talking about financial transactions only in this case, correct, the smart contracts?"}, {"time": 2595, "text": "Oh, you can go to anything."}, {"time": 2597, "text": "You can put a prenup in the Ethereum blockchain."}, {"time": 2601, "text": "A married smart contract?"}, {"time": 2603, "text": "Sorry, divorce lawyer, sorry."}, {"time": 2604, "text": "You're going to be replaced by Python."}, {"time": 2609, "text": "Okay, so that's another beautiful idea."}, {"time": 2614, "text": "Do you think there's something that's appealing to you about any one specific implementation?"}, {"time": 2620, "text": "So if you look 10, 20, 50 years down the line, do you see any, like, Bitcoin, Ethereum, any of the other hundreds of cryptocurrencies winning out?"}, {"time": 2631, "text": "Is there, like, what's your intuition about the space?"}, {"time": 2633, "text": "Or are you just sitting back and watching the chaos and look who cares what emerges?"}, {"time": 2637, "text": "Oh, I don't."}, {"time": 2638, "text": "I don't speculate."}, {"time": 2639, "text": "I don't really care which one of these projects wins."}, {"time": 2642, "text": "I'm kind of in the Bitcoin as a meme coin camp."}, {"time": 2645, "text": "I mean, why does Bitcoin have value?"}, {"time": 2647, "text": "It's technically kind of, you know, not great, like the block size debate."}, {"time": 2654, "text": "When I found out what the block size debate was, I'm like, are you guys kidding?"}, {"time": 2658, "text": "What's the block size debate?"}, {"time": 2662, "text": "It's really, it's too stupid to even talk."}, {"time": 2663, "text": "People can look it up, but I'm like, wow."}, {"time": 2667, "text": "You know, Ethereum seems, the governance of Ethereum seems much better."}, {"time": 2671, "text": "I've come around a bit on proof of stake ideas."}, {"time": 2675, "text": "You know, very smart people thinking about some things."}, {"time": 2677, "text": "Yeah, you know, governance is interesting."}, {"time": 2680, "text": "It does feel like Vitalik, like it does feel like an open, even in these distributed systems, leaders are helpful because they kind of help you drive the mission and the vision and they put a face to a project."}, {"time": 2698, "text": "It's a weird thing about us humans."}, {"time": 2700, "text": "Geniuses are helpful, like Vitalik."}, {"time": 2706, "text": "Leaders are not necessarily, yeah."}, {"time": 2710, "text": "So you think the reason he's the face of Ethereum is because he's a genius."}, {"time": 2718, "text": "I mean, that was, it's interesting to think about that we need to create systems in which the quote unquote leaders that emerge are the geniuses in the system."}, {"time": 2733, "text": "I mean, that's arguably why the current state of democracy is broken is the people who are emerging as the leaders are not the most competent, are not the superstars of the system."}, {"time": 2743, "text": "And it seems like at least for now in the crypto world oftentimes the leaders are the superstars."}, {"time": 2749, "text": "Imagine at the debate they asked, what's the sixth amendment?"}, {"time": 2753, "text": "What are the four fundamental forces in the universe?"}, {"time": 2756, "text": "What's the integral of two to the X?"}, {"time": 2759, "text": "I'd love to see those questions asked and that's what I want as our leader."}, {"time": 2763, "text": "It's a little bit."}, {"time": 2764, "text": "What's Bayes rule?"}, {"time": 2767, "text": "Yeah, I mean, even, oh wow, you're hurting my brain."}, {"time": 2770, "text": "It's that my standard was even lower but I would have loved to see just this basic brilliance."}, {"time": 2780, "text": "Like I've talked to historians."}, {"time": 2782, "text": "There's just these, they're not even like they don't have a PhD or even education history."}, {"time": 2786, "text": "They just like a Dan Carlin type character who just like, holy shit."}, {"time": 2792, "text": "How did all this information get into your head?"}, {"time": 2795, "text": "They're able to just connect Genghis Khan to the entirety of the history of the 20th century."}, {"time": 2801, "text": "They know everything about every single battle that happened and they know the game of Thrones of the different power plays and all that happened there."}, {"time": 2815, "text": "And they know like the individuals and all the documents involved and they integrate that into their regular life."}, {"time": 2822, "text": "It's not like they're ultra history nerds."}, {"time": 2823, "text": "They're just, they know this information."}, {"time": 2826, "text": "That's what competence looks like."}, {"time": 2829, "text": "Cause I've seen that with programmers too, right?"}, {"time": 2830, "text": "That's what great programmers do."}, {"time": 2832, "text": "But yeah, it would be, it's really unfortunate that those kinds of people aren't emerging as our leaders."}, {"time": 2839, "text": "But for now, at least in the crypto world that seems to be the case."}, {"time": 2843, "text": "I don't know if that always, you could imagine that in a hundred years, it's not the case, right?"}, {"time": 2848, "text": "Crypto world has one very powerful idea going for it and that's the idea of forks, right?"}, {"time": 2855, "text": "I mean, imagine, we'll use a less controversial example."}, {"time": 2862, "text": "This was actually in my joke app in 2012."}, {"time": 2867, "text": "I was like, Barack Obama, Mitt Romney, let's let them both be president, right?"}, {"time": 2871, "text": "Like imagine we could fork America and just let them both be president."}, {"time": 2874, "text": "And then the Americas could compete and people could invest in one, pull their liquidity out of one, put it in the other."}, {"time": 2880, "text": "You have this in the crypto world."}, {"time": 2882, "text": "Ethereum forks into Ethereum and Ethereum classic."}, {"time": 2885, "text": "And you can pull your liquidity out of one and put it in another."}, {"time": 2888, "text": "And people vote with their dollars, which forks, companies should be able to fork."}, {"time": 2896, "text": "I'd love to fork Nvidia, you know?"}, {"time": 2900, "text": "Yeah, like different business strategies and then try them out and see what works."}, {"time": 2906, "text": "Like even take, yeah, take comma AI that closes its source and then take one that's open source and see what works."}, {"time": 2918, "text": "Take one that's purchased by GM and one that remains Android Renegade and all these different versions and see."}, {"time": 2925, "text": "The beauty of comma AI is someone can actually do that."}, {"time": 2927, "text": "Please take comma AI and fork it."}, {"time": 2930, "text": "That's right, that's the beauty of open source."}, {"time": 2933, "text": "So you're, I mean, we'll talk about autonomous vehicle space, but it does seem that you're really knowledgeable about a lot of different topics."}, {"time": 2943, "text": "So the natural question a bunch of people ask this, which is how do you keep learning new things?"}, {"time": 2949, "text": "Do you have like practical advice if you were to introspect, like taking notes, allocate time, or do you just mess around and just allow your curiosity to drive?"}, {"time": 2961, "text": "I'll write these people a self help book and I'll charge $67 for it."}, {"time": 2965, "text": "And I will write, I will write, I will write on the cover of the self help book."}, {"time": 2970, "text": "All of this advice is completely meaningless."}, {"time": 2972, "text": "You're gonna be a sucker and buy this book anyway."}, {"time": 2974, "text": "And the one lesson that I hope they take away from the book is that I can't give you a meaningful answer to that."}, {"time": 2984, "text": "Let me translate that."}, {"time": 2985, "text": "Is you haven't really thought about what it is you do systematically because you could reduce it."}, {"time": 2993, "text": "And there's some people, I mean, I've met brilliant people that this is really clear with athletes."}, {"time": 3000, "text": "Some are just, you know, the best in the world at something and they have zero interest in writing like a self help book, or how to master this game."}, {"time": 3011, "text": "And then there's some athletes who become great coaches and they love the analysis, perhaps the over analysis."}, {"time": 3018, "text": "And you right now, at least at your age, which is an interesting, you're in the middle of the battle."}, {"time": 3023, "text": "You're like the warriors that have zero interest in writing books."}, {"time": 3027, "text": "So you're in the middle of the battle."}, {"time": 3030, "text": "This is a fair point."}, {"time": 3031, "text": "I do think I have a certain aversion to this kind of deliberate intentional way of living life."}, {"time": 3039, "text": "You're eventually, the hilarity of this, especially since this is recorded, it will reveal beautifully the absurdity when you finally do publish this book."}, {"time": 3049, "text": "I guarantee you, you will."}, {"time": 3051, "text": "The story of comma AI, maybe it'll be a biography written about you."}, {"time": 3057, "text": "That'll be better, I guess."}, {"time": 3058, "text": "And you might be able to learn some cute lessons if you're starting a company like comma AI from that book."}, {"time": 3063, "text": "But if you're asking generic questions, like how do I be good at things?"}, {"time": 3067, "text": "How do I be good at things?"}, {"time": 3070, "text": "Dude, I don't know."}, {"time": 3071, "text": "Do them a lot."}, {"time": 3075, "text": "But the interesting thing here is learning things outside of your current trajectory, which is what it feels like from an outsider's perspective."}, {"time": 3088, "text": "I don't know if there's advice on that, but it is an interesting curiosity."}, {"time": 3093, "text": "When you become really busy, you're running a company."}, {"time": 3098, "text": "Hard time."}, {"time": 3101, "text": "But there's a natural inclination and trend."}, {"time": 3106, "text": "Just the momentum of life carries you into a particular direction of wanting to focus."}, {"time": 3111, "text": "And this kind of dispersion that curiosity can lead to gets harder and harder with time."}, {"time": 3118, "text": "Because you get really good at certain things and it sucks trying things that you're not good at, like trying to figure them out."}, {"time": 3125, "text": "When you do this with your live streams, you're on the fly figuring stuff out."}, {"time": 3130, "text": "You don't mind looking dumb."}, {"time": 3134, "text": "You just figure it out pretty quickly."}, {"time": 3136, "text": "Sometimes I try things and I don't figure them out quickly."}, {"time": 3139, "text": "My chest rating is like a 1400, despite putting like a couple of hundred hours in."}, {"time": 3144, "text": "I mean, to be fair, I know that I could do it better if I did it better."}, {"time": 3147, "text": "Like don't play five minute games, play 15 minute games at least."}, {"time": 3151, "text": "Like I know these things, but it just doesn't, it doesn't stick nicely in my knowledge stream."}, {"time": 3157, "text": "All right, let's talk about Comma AI."}, {"time": 3159, "text": "What's the mission of the company?"}, {"time": 3162, "text": "Let's like look at the biggest picture."}, {"time": 3164, "text": "Oh, I have an exact statement."}, {"time": 3166, "text": "Solve self driving cars while delivering shippable intermediaries."}, {"time": 3171, "text": "So longterm vision is have fully autonomous vehicles and make sure you're making money along the way."}, {"time": 3179, "text": "I think it doesn't really speak to money, but I can talk about what solve self driving cars means."}, {"time": 3183, "text": "Solve self driving cars of course means you're not building a new car, you're building a person replacement."}, {"time": 3190, "text": "That person can sit in the driver's seat and drive you anywhere a person can drive with a human or better level of safety, speed, quality, comfort."}, {"time": 3201, "text": "And what's the second part of that?"}, {"time": 3203, "text": "Delivering shippable intermediaries is well, it's a way to fund the company, that's true."}, {"time": 3208, "text": "But it's also a way to keep us honest."}, {"time": 3211, "text": "If you don't have that, it is very easy with this technology to think you're making progress when you're not."}, {"time": 3220, "text": "I've heard it best described on Hacker News as you can set any arbitrary milestone, meet that milestone and still be infinitely far away from solving self driving cars."}, {"time": 3231, "text": "So it's hard to have like real deadlines when you're like Cruz or Waymo when you don't have revenue."}, {"time": 3242, "text": "Is that, I mean, is revenue essentially the thing we're talking about here?"}, {"time": 3247, "text": "Revenue is, capitalism is based around consent."}, {"time": 3251, "text": "Capitalism, the way that you get revenue is real capitalism comes in the real capitalism camp."}, {"time": 3256, "text": "There's definitely scams out there, but real capitalism is based around consent."}, {"time": 3259, "text": "It's based around this idea that like, if we're getting revenue, it's because we're providing at least that much value to another person."}, {"time": 3264, "text": "When someone buys $1,000 comma two from us, we're providing them at least $1,000 of value or they wouldn't buy it."}, {"time": 3270, "text": "Brilliant, so can you give a whirlwind overview of the products that Comma AI provides, like throughout its history and today?"}, {"time": 3278, "text": "I mean, yeah, the past ones aren't really that interesting."}, {"time": 3280, "text": "It's kind of just been refinement of the same idea."}, {"time": 3285, "text": "The real only product we sell today is the Comma 2."}, {"time": 3288, "text": "Which is a piece of hardware with cameras."}, {"time": 3290, "text": "Mm, so the Comma 2, I mean, you can think about it kind of like a person."}, {"time": 3297, "text": "Future hardware will probably be even more and more personlike."}, {"time": 3300, "text": "So it has eyes, ears, a mouth, a brain, and a way to interface with the car."}, {"time": 3309, "text": "Does it have consciousness?"}, {"time": 3310, "text": "Just kidding, that was a trick question."}, {"time": 3313, "text": "I don't have consciousness either."}, {"time": 3315, "text": "Me and the Comma 2 are the same."}, {"time": 3316, "text": "You're the same?"}, {"time": 3317, "text": "I have a little more compute than it."}, {"time": 3318, "text": "It only has like the same compute as a B, you know."}, {"time": 3323, "text": "You're more efficient energy wise for the compute you're doing."}, {"time": 3326, "text": "Far more efficient energy wise."}, {"time": 3329, "text": "20 petaflops, 20 watts, crazy."}, {"time": 3330, "text": "Do you lack consciousness?"}, {"time": 3333, "text": "Do you fear death?"}, {"time": 3333, "text": "You do, you want immortality."}, {"time": 3335, "text": "Of course I fear death."}, {"time": 3336, "text": "Does Comma AI fear death?"}, {"time": 3339, "text": "Of course it does."}, {"time": 3340, "text": "It very much fears, well, it fears negative loss."}, {"time": 3343, "text": "Okay, so Comma 2, when did that come out?"}, {"time": 3349, "text": "That was a year ago?"}, {"time": 3350, "text": "No, two."}, {"time": 3352, "text": "Early this year."}, {"time": 3353, "text": "Wow, time, it feels like, yeah."}, {"time": 3356, "text": "2020 feels like it's taken 10 years to get to the end."}, {"time": 3360, "text": "It's a long year."}, {"time": 3363, "text": "So what's the sexiest thing about Comma 2 feature wise?"}, {"time": 3368, "text": "So, I mean, maybe you can also link on like, what is it?"}, {"time": 3374, "text": "Like what's its purpose?"}, {"time": 3375, "text": "Cause there's a hardware, there's a software component."}, {"time": 3378, "text": "You've mentioned the sensors, but also like what is it, its features and capabilities?"}, {"time": 3383, "text": "I think our slogan summarizes it well."}, {"time": 3385, "text": "Comma slogan is make driving chill."}, {"time": 3388, "text": "I love it, okay."}, {"time": 3390, "text": "Yeah, I mean, it is, you know, if you like cruise control, imagine cruise control, but much, much more."}, {"time": 3396, "text": "So it can do adaptive cruise control things, which is like slow down for cars in front of it, maintain a certain speed."}, {"time": 3404, "text": "And it can also do lane keeping."}, {"time": 3406, "text": "So staying in the lane and doing it better and better and better over time."}, {"time": 3410, "text": "It's very much machine learning based."}, {"time": 3413, "text": "So this camera is, there's a driver facing camera too."}, {"time": 3422, "text": "What am I thinking?"}, {"time": 3422, "text": "So the hardware versus software."}, {"time": 3424, "text": "So open pilot versus the actual hardware of the device."}, {"time": 3429, "text": "What's, can you draw that distinction?"}, {"time": 3430, "text": "What's one, what's the other?"}, {"time": 3431, "text": "I mean, the hardware is pretty much a cell phone with a few additions."}, {"time": 3434, "text": "A cell phone with a cooling system and with a car interface connected to it."}, {"time": 3440, "text": "And by cell phone, you mean like Qualcomm Snapdragon."}, {"time": 3445, "text": "Yeah, the current hardware is a Snapdragon 821."}, {"time": 3449, "text": "It has wifi radio, it has an LTE radio, it has a screen."}, {"time": 3452, "text": "We use every part of the cell phone."}, {"time": 3455, "text": "And then the interface with the car is specific to the car."}, {"time": 3458, "text": "So you keep supporting more and more cars."}, {"time": 3461, "text": "Yeah, so the interface to the car, I mean, the device itself just has four CAN buses."}, {"time": 3465, "text": "It has four CAN interfaces on it that are connected through the USB port to the phone."}, {"time": 3469, "text": "And then, yeah, on those four CAN buses, you connect it to the car."}, {"time": 3474, "text": "And there's a little harness to do this."}, {"time": 3476, "text": "Cars are actually surprisingly similar."}, {"time": 3478, "text": "So CAN is the protocol by which cars communicate."}, {"time": 3481, "text": "And then you're able to read stuff and write stuff to be able to control the car depending on the car."}, {"time": 3486, "text": "So what's the software side?"}, {"time": 3488, "text": "What's OpenPilot?"}, {"time": 3490, "text": "So I mean, OpenPilot is, the hardware is pretty simple compared to OpenPilot."}, {"time": 3493, "text": "OpenPilot is, well, so you have a machine learning model, which it's in OpenPilot, it's a blob."}, {"time": 3504, "text": "It's just a blob of weights."}, {"time": 3505, "text": "It's not like people are like, oh, it's closed source."}, {"time": 3507, "text": "I'm like, it's a blob of weights."}, {"time": 3508, "text": "What do you expect?"}, {"time": 3509, "text": "So it's primarily neural network based."}, {"time": 3513, "text": "You, well, OpenPilot is all the software kind of around that neural network."}, {"time": 3517, "text": "That if you have a neural network that says, here's where you wanna send the car, OpenPilot actually goes and executes all of that."}, {"time": 3524, "text": "It cleans up the input to the neural network."}, {"time": 3526, "text": "It cleans up the output and executes on it."}, {"time": 3529, "text": "So it connects, it's the glue that connects everything together."}, {"time": 3531, "text": "Runs the sensors, does a bunch of calibration for the neural network, deals with like, if the car is on a banked road, you have to counter steer against that."}, {"time": 3542, "text": "And the neural network can't necessarily know that by looking at the picture."}, {"time": 3546, "text": "So you do that with other sensors and Fusion and Localizer."}, {"time": 3549, "text": "OpenPilot also is responsible for sending the data up to our servers."}, {"time": 3554, "text": "So we can learn from it, logging it, recording it, running the cameras, thermally managing the device, managing the disk space on the device, managing all the resources on the device."}, {"time": 3564, "text": "So what, since we last spoke, I don't remember when, maybe a year ago, maybe a little bit longer, how has OpenPilot improved?"}, {"time": 3573, "text": "We did exactly what I promised you."}, {"time": 3574, "text": "I promised you that by the end of the year, where you'd be able to remove the lanes."}, {"time": 3580, "text": "The lateral policy is now almost completely end to end."}, {"time": 3586, "text": "You can turn the lanes off and it will drive, drive slightly worse on the highway if you turn the lanes off, but you can turn the lanes off and it will drive well, trained completely end to end on user data."}, {"time": 3597, "text": "And this year we hope to do the same for the longitudinal policy."}, {"time": 3600, "text": "So that's the interesting thing is you're not doing, you don't appear to be, maybe you can correct me, you don't appear to be doing lane detection or lane marking detection or kind of the segmentation task or any kind of object detection task."}, {"time": 3615, "text": "You're doing what's traditionally more called like end to end learning."}, {"time": 3619, "text": "So, and trained on actual behavior of drivers when they're driving the car manually."}, {"time": 3627, "text": "And this is hard to do."}, {"time": 3629, "text": "It's not supervised learning."}, {"time": 3632, "text": "Yeah, but so the nice thing is there's a lot of data."}, {"time": 3634, "text": "So it's hard and easy, right?"}, {"time": 3637, "text": "It's a... We have a lot of high quality data, yeah."}, {"time": 3640, "text": "Like more than you need in the second."}, {"time": 3641, "text": "Well... We have way more than we do."}, {"time": 3643, "text": "We have way more data than we need."}, {"time": 3644, "text": "I mean, it's an interesting question actually, because in terms of amount, you have more than you need, but the driving is full of edge cases."}, {"time": 3654, "text": "So how do you select the data you train on?"}, {"time": 3658, "text": "I think this is an interesting open question."}, {"time": 3660, "text": "Like what's the cleverest way to select data?"}, {"time": 3664, "text": "That's the question Tesla is probably working on."}, {"time": 3667, "text": "That's, I mean, the entirety of machine learning can be, they don't seem to really care."}, {"time": 3671, "text": "They just kind of select data."}, {"time": 3672, "text": "But I feel like that if you want to solve, if you want to create intelligent systems, you have to pick data well, right?"}, {"time": 3678, "text": "And so do you have any hints, ideas of how to do it well?"}, {"time": 3682, "text": "So in some ways that is..."}, {"time": 3685, "text": "The definition I like of reinforcement learning versus supervised learning."}, {"time": 3689, "text": "In supervised learning, the weights depend on the data."}, {"time": 3694, "text": "And this is obviously true, but in reinforcement learning, the data depends on the weights."}, {"time": 3701, "text": "And actually both ways."}, {"time": 3702, "text": "That's poetry."}, {"time": 3703, "text": "So how does it know what data to train on?"}, {"time": 3706, "text": "Well, let it pick."}, {"time": 3707, "text": "We're not there yet, but that's the eventual."}, {"time": 3709, "text": "So you're thinking this almost like a reinforcement learning framework."}, {"time": 3713, "text": "We're going to do RL on the world."}, {"time": 3715, "text": "Every time a car makes a mistake, user disengages, we train on that and do RL on the world."}, {"time": 3720, "text": "Ship out a new model, that's an epoch, right?"}, {"time": 3723, "text": "And for now you're not doing the Elon style promising that it's going to be fully autonomous."}, {"time": 3729, "text": "You really are sticking to level two and like it's supposed to be supervised."}, {"time": 3735, "text": "It is definitely supposed to be supervised and we enforce the fact that it's supervised."}, {"time": 3739, "text": "We look at our rate of improvement in disengagements."}, {"time": 3743, "text": "OpenPilot now has an unplanned disengagement about every a hundred miles."}, {"time": 3747, "text": "This is up from 10 miles, like maybe, maybe maybe a year ago."}, {"time": 3757, "text": "So maybe we've seen 10 X improvement in a year, but a hundred miles is still a far cry from the a hundred thousand you're going to need."}, {"time": 3763, "text": "So you're going to somehow need to get three more 10 Xs in there."}, {"time": 3769, "text": "And you're, what's your intuition?"}, {"time": 3772, "text": "You're basically hoping that there's exponential improvement built into the baked into the cake somewhere."}, {"time": 3776, "text": "Well, that's even, I mean, 10 X improvement, that's already assuming exponential, right?"}, {"time": 3780, "text": "There's definitely exponential improvement."}, {"time": 3782, "text": "And I think when Elon talks about exponential, like these things, these systems are going to exponentially improve, just exponential doesn't mean you're getting a hundred gigahertz processors tomorrow."}, {"time": 3792, "text": "Like it's going to still take a while because the gap between even our best system and humans is still large."}, {"time": 3800, "text": "So that's an interesting distinction to draw."}, {"time": 3802, "text": "So if you look at the way Tesla is approaching the problem and the way you're approaching the problem, which is very different than the rest of the self driving car world."}, {"time": 3812, "text": "So let's put them aside is you're treating most the driving task as a machine learning problem."}, {"time": 3817, "text": "And the way Tesla is approaching it is with the multitask learning where you break the task of driving into hundreds of different tasks and you have this multiheaded neural network that's very good at performing each task."}, {"time": 3831, "text": "And there there's presumably something on top that's stitching stuff together in order to make control decisions, policy decisions about how you move the car."}, {"time": 3842, "text": "But what that allows you, there's a brilliance to this because it allows you to master each task, like lane detection, stop sign detection, the traffic light detection, drivable area segmentation, you know, vehicle, bicycle, pedestrian detection."}, {"time": 3863, "text": "There's some localization tasks in there."}, {"time": 3865, "text": "Also predicting of like, yeah, predicting how the entities in the scene are going to move."}, {"time": 3874, "text": "Like everything is basically a machine learning task."}, {"time": 3876, "text": "So there's a classification, segmentation, prediction."}, {"time": 3880, "text": "And it's nice because you can have this entire engine, data engine that's mining for edge cases for each one of these tasks."}, {"time": 3889, "text": "And you can have people like engineers that are basically masters of that task, like become the best person in the world at, as you talk about the cone guy for Waymo, the becoming the best person in the world at cone detection."}, {"time": 3906, "text": "So that's a compelling notion from a supervised learning perspective, automating much of the process of edge case discovery and retraining neural network for each of the individual perception tasks."}, {"time": 3919, "text": "And then you're looking at the machine learning in a more holistic way, basically doing end to end learning on the driving tasks, supervised, trained on the data of the actual driving of people."}, {"time": 3934, "text": "They use comma AI, like actual human drivers, their manual control, plus the moments of disengagement that maybe with some labeling could indicate the failure of the system."}, {"time": 3947, "text": "So you have the, you have a huge amount of data for positive control of the vehicle, like successful control of the vehicle, both maintaining the lane as, as I think you're also working on longitudinal control of the vehicle and then failure cases where the vehicle does something wrong that needs disengagement."}, {"time": 3968, "text": "So like what, why do you think you're right and Tesla is wrong on this?"}, {"time": 3974, "text": "And do you think, do you think you'll come around the Tesla way?"}, {"time": 3977, "text": "Do you think Tesla will come around to your way?"}, {"time": 3981, "text": "If you were to start a chess engine company, would you hire a Bishop guy?"}, {"time": 3986, "text": "See, we have a, this is Monday morning."}, {"time": 3989, "text": "Quarterbacking is a yes, probably."}, {"time": 3996, "text": "Oh, our Rook guy."}, {"time": 3997, "text": "Oh, we stole the Rook guy from that company."}, {"time": 3999, "text": "Oh, we're going to have real good Rooks."}, {"time": 4000, "text": "Well, there's not many pieces, right?"}, {"time": 4003, "text": "You can, there's not many guys and gals to hire."}, {"time": 4008, "text": "You just have a few that work in the Bishop, a few that work in the Rook."}, {"time": 4012, "text": "Is that not ludicrous today to think about in a world of AlphaZero?"}, {"time": 4017, "text": "But AlphaZero is a chess game."}, {"time": 4018, "text": "So the fundamental question is, how hard is driving compared to chess?"}, {"time": 4024, "text": "Because, so long term, end to end, will be the right solution."}, {"time": 4030, "text": "The question is how many years away is that?"}, {"time": 4033, "text": "End to end is going to be the only solution for level five."}, {"time": 4035, "text": "For the only way we'll get there."}, {"time": 4037, "text": "Of course, and of course, Tesla is going to come around to my way."}, {"time": 4039, "text": "And if you're a Rook guy out there, I'm sorry."}, {"time": 4042, "text": "The cone guy."}, {"time": 4045, "text": "We're going to specialize each task."}, {"time": 4046, "text": "We're going to really understand Rook placement."}, {"time": 4050, "text": "I understand the intuition you have."}, {"time": 4052, "text": "I mean, that, that is a very compelling notion that we can learn the task end to end, like the same compelling notion you might have for natural language conversation."}, {"time": 4062, "text": "But I'm not sure, because one thing you sneaked in there is the assertion that it's impossible to get to level five without this kind of approach."}, {"time": 4075, "text": "I don't know if that's obvious."}, {"time": 4077, "text": "I don't know if that's obvious either."}, {"time": 4078, "text": "I don't actually mean that."}, {"time": 4081, "text": "I think that it is much easier to get to level five with an end to end approach."}, {"time": 4085, "text": "I think that the other approach is doable, but the magnitude of the engineering challenge may exceed what humanity is capable of."}, {"time": 4093, "text": "But what do you think of the Tesla data engine approach, which to me is an active learning task, is kind of fascinating, is breaking it down into these multiple tasks and mining their data constantly for like edge cases for these different tasks."}, {"time": 4110, "text": "Yeah, but the tasks themselves are not being learned."}, {"time": 4112, "text": "This is feature engineering."}, {"time": 4115, "text": "Yeah, I mean, it's a higher abstraction level of feature engineering for the different tasks."}, {"time": 4123, "text": "Task engineering in a sense."}, {"time": 4124, "text": "It's slightly better feature engineering, but it's still fundamentally is feature engineering."}, {"time": 4129, "text": "And if anything about the history of AI has taught us anything, it's that feature engineering approaches will always be replaced and lose to end to end."}, {"time": 4137, "text": "Now, to be fair, I cannot really make promises on timelines, but I can say that when you look at the code for Stockfish and the code for AlphaZero, one is a lot shorter than the other, a lot more elegant, required a lot less programmer hours to write."}, {"time": 4152, "text": "Yeah, but there was a lot more murder of bad agents on the AlphaZero side."}, {"time": 4164, "text": "By murder, I mean agents that played a game and failed miserably."}, {"time": 4171, "text": "Oh, oh."}, {"time": 4172, "text": "In simulation, that failure is less costly."}, {"time": 4175, "text": "In real world, it's... Do you mean in practice, like AlphaZero has lost games miserably?"}, {"time": 4182, "text": "I haven't seen that."}, {"time": 4183, "text": "No, but I know, but the requirement for AlphaZero is... A simulator."}, {"time": 4188, "text": "To be able to like evolution, human evolution, not human evolution, biological evolution of life on earth from the origin of life has murdered trillions upon trillions of organisms on the path thus humans."}, {"time": 4203, "text": "So the question is, can we stitch together a human like object without having to go through the entirety process of evolution?"}, {"time": 4209, "text": "Well, no, but do the evolution in simulation."}, {"time": 4211, "text": "Yeah, that's the question."}, {"time": 4212, "text": "Can we simulate?"}, {"time": 4213, "text": "So do you have a sense that it's possible to simulate some aspect?"}, {"time": 4216, "text": "MuZero is exactly this."}, {"time": 4218, "text": "MuZero is the solution to this."}, {"time": 4221, "text": "MuZero I think is going to be looked back as the canonical paper."}, {"time": 4225, "text": "And I don't think deep learning is everything."}, {"time": 4226, "text": "I think that there's still a bunch of things missing to get there, but MuZero I think is going to be looked back as the kind of cornerstone paper of this whole deep learning era."}, {"time": 4237, "text": "And MuZero is the solution to self driving cars."}, {"time": 4239, "text": "You have to make a few tweaks to it, but MuZero does effectively that."}, {"time": 4242, "text": "It does those rollouts and those murdering in a learned simulator and a learned dynamics model."}, {"time": 4251, "text": "It doesn't get enough love."}, {"time": 4251, "text": "I was blown away when I read that paper."}, {"time": 4254, "text": "I'm like, okay, I've always said a comma."}, {"time": 4257, "text": "I'm going to sit and I'm going to wait for the solution to self driving cars to come along."}, {"time": 4260, "text": "This year I saw it."}, {"time": 4261, "text": "It's MuZero."}, {"time": 4266, "text": "Sit back and let the winning roll in."}, {"time": 4269, "text": "So your sense, just to elaborate a little bit, it's a link on the topic."}, {"time": 4273, "text": "Your sense is neural networks will solve driving."}, {"time": 4277, "text": "Like we don't need anything else."}, {"time": 4278, "text": "I think the same way chess was maybe the chess and maybe Google are the pinnacle of like search algorithms and things that look kind of like a star."}, {"time": 4288, "text": "The pinnacle of this era is going to be self driving cars."}, {"time": 4294, "text": "But on the path of that, you have to deliver products and it's possible that the path to full self driving cars will take decades."}, {"time": 4305, "text": "How long would you put on it?"}, {"time": 4307, "text": "Like what are we, you're chasing it, Tesla's chasing it."}, {"time": 4314, "text": "Five years, 10 years, 50 years."}, {"time": 4316, "text": "Let's say in the 2020s."}, {"time": 4318, "text": "In the 2020s."}, {"time": 4319, "text": "The later part of the 2020s."}, {"time": 4323, "text": "With the neural network."}, {"time": 4325, "text": "Well, that would be nice to see."}, {"time": 4326, "text": "And then the path to that, you're delivering products, which is a nice L2 system."}, {"time": 4330, "text": "That's what Tesla's doing, a nice L2 system."}, {"time": 4333, "text": "Just gets better every time."}, {"time": 4334, "text": "L2, the only difference between L2 and the other levels is who takes liability."}, {"time": 4337, "text": "And I'm not a liability guy, I don't wanna take liability."}, {"time": 4340, "text": "I'm gonna level two forever."}, {"time": 4342, "text": "Now on that little transition, I mean, how do you make the transition work?"}, {"time": 4349, "text": "Is this where driver sensing comes in?"}, {"time": 4352, "text": "Like how do you make the, cause you said a hundred miles, like, is there some sort of human factor psychology thing where people start to overtrust the system, all those kinds of effects, once it gets better and better and better and better, they get lazier and lazier and lazier."}, {"time": 4369, "text": "Is that, like, how do you get that transition right?"}, {"time": 4372, "text": "First off, our monitoring is already adaptive."}, {"time": 4374, "text": "Our monitoring is already seen adaptive."}, {"time": 4376, "text": "Driver monitoring is just the camera that's looking at the driver."}, {"time": 4380, "text": "You have an infrared camera in the... Our policy for how we enforce the driver monitoring is seen adaptive."}, {"time": 4388, "text": "Well, for example, in one of the extreme cases, if the car is not moving, we do not actively enforce driver monitoring, right?"}, {"time": 4399, "text": "If you are going through a, like a 45 mile an hour road with lights and stop signs and potentially pedestrians, we enforce a very tight driver monitoring policy."}, {"time": 4410, "text": "If you are alone on a perfectly straight highway, and this is, it's all machine learning."}, {"time": 4415, "text": "None of that is hand coded."}, {"time": 4416, "text": "Actually, the stop is hand coded, but..."}, {"time": 4419, "text": "So there's some kind of machine learning estimation of risk."}, {"time": 4424, "text": "I mean, I've always been a huge fan of that."}, {"time": 4425, "text": "That's a... Because..."}, {"time": 4428, "text": "It's difficult to do every step into that direction is a worthwhile step to take."}, {"time": 4435, "text": "It might be difficult to do really well."}, {"time": 4436, "text": "Like us humans are able to estimate risk pretty damn well, whatever the hell that is."}, {"time": 4441, "text": "That feels like one of the nice features of us humans."}, {"time": 4446, "text": "Cause like we humans are really good drivers when we're really like tuned in and we're good at estimating risk."}, {"time": 4452, "text": "Like when are we supposed to be tuned in?"}, {"time": 4455, "text": "And, you know, people are like, oh, well, you know, why would you ever make the driver monitoring policy less aggressive?"}, {"time": 4461, "text": "Why would you always not keep it at its most aggressive?"}, {"time": 4463, "text": "Because then people are just going to get fatigued from it."}, {"time": 4466, "text": "When they get annoyed."}, {"time": 4467, "text": "You want them... Yeah."}, {"time": 4469, "text": "You want the experience to be pleasant."}, {"time": 4470, "text": "Obviously I want the experience to be pleasant, but even just from a straight up safety perspective, if you alert people when they look around and they're like, why is this thing alerting me?"}, {"time": 4481, "text": "There's nothing I could possibly hit right now."}, {"time": 4482, "text": "People will just learn to tune it out."}, {"time": 4485, "text": "People will just learn to tune it out, to put weights on the steering wheel, to do whatever to overcome it."}, {"time": 4489, "text": "And remember that you're always part of this adaptive system."}, {"time": 4493, "text": "So all I can really say about, you know, how this scales going forward is yeah, it's something we have to monitor for."}, {"time": 4499, "text": "Ooh, we don't know."}, {"time": 4500, "text": "This is a great psychology experiment at scale."}, {"time": 4502, "text": "Like we'll see."}, {"time": 4503, "text": "Yeah, it's fascinating."}, {"time": 4504, "text": "Track it."}, {"time": 4504, "text": "And making sure you have a good understanding of attention is a very key part of that psychology problem."}, {"time": 4512, "text": "I think you and I probably have a different, come to it differently, but to me, it's a fascinating psychology problem to explore something much deeper than just driving."}, {"time": 4522, "text": "It's such a nice way to explore human attention and human behavior, which is why, again, we've probably both criticized Mr. Elon Musk on this one topic from different avenues."}, {"time": 4538, "text": "So both offline and online, I had little chats with Elon and like, I love human beings as a computer vision problem, as an AI problem, it's fascinating."}, {"time": 4551, "text": "He wasn't so much interested in that problem."}, {"time": 4553, "text": "It's like in order to solve driving, the whole point is you want to remove the human from the picture."}, {"time": 4561, "text": "And it seems like you can't do that quite yet."}, {"time": 4564, "text": "Eventually, yes, but you can't quite do that yet."}, {"time": 4567, "text": "So this is the moment where you can't yet say, I told you so to Tesla, but it's getting there because I don't know if you've seen this, there's some reporting that they're in fact starting to do driver monitoring."}, {"time": 4583, "text": "Yeah, they shift the model in shadow mode."}, {"time": 4586, "text": "With, I believe, only a visible light camera, it might even be fisheye."}, {"time": 4591, "text": "It's like a low resolution."}, {"time": 4593, "text": "Low resolution, visible light."}, {"time": 4594, "text": "I mean, to be fair, that's what we have in the Eon as well, our last generation product."}, {"time": 4598, "text": "This is the one area where I can say our hardware is ahead of Tesla."}, {"time": 4602, "text": "The rest of our hardware, way, way behind, but our driver monitoring camera."}, {"time": 4606, "text": "So you think, I think on the third row Tesla podcast, or somewhere else, I've heard you say that obviously, eventually they're gonna have driver monitoring."}, {"time": 4617, "text": "I think what I've said is Elon will definitely ship driver monitoring before he ships level five."}, {"time": 4621, "text": "Before level five."}, {"time": 4622, "text": "And I'm willing to bet 10 grand on that."}, {"time": 4624, "text": "And you bet 10 grand on that."}, {"time": 4627, "text": "I mean, now I don't wanna take the bet, but before, maybe someone would have, oh, I should have got my money in."}, {"time": 4631, "text": "It's an interesting bet."}, {"time": 4636, "text": "I'm actually on a human level because he's been, he's made the decision."}, {"time": 4644, "text": "Like he said that driver monitoring is the wrong way to go."}, {"time": 4647, "text": "But like, you have to think of as a human, as a CEO, I think that's the right thing to say when, like sometimes you have to say things publicly that are different than when you actually believe, because when you're producing a large number of vehicles and the decision was made not to include the camera, like what are you supposed to say?"}, {"time": 4669, "text": "Like our cars don't have the thing that I think is right to have."}, {"time": 4674, "text": "It's an interesting thing."}, {"time": 4675, "text": "But like on the other side, as a CEO, I mean, something you could probably speak to as a leader, I think about me as a human to publicly change your mind on something."}, {"time": 4687, "text": "How hard is that?"}, {"time": 4688, "text": "Especially when assholes like George Haas say, I told you so."}, {"time": 4692, "text": "All I will say is I am not a leader and I am happy to change my mind."}, {"time": 4697, "text": "And I will."}, {"time": 4697, "text": "You think Elon will?"}, {"time": 4702, "text": "I think he'll come up with a good way to make it psychologically okay for him."}, {"time": 4707, "text": "Well, it's such an important thing, man."}, {"time": 4709, "text": "Especially for a first principles thinker, because he made a decision that driver monitoring is not the right way to go."}, {"time": 4715, "text": "And I could see that decision."}, {"time": 4717, "text": "And I could even make that decision."}, {"time": 4719, "text": "Like I was on the fence too."}, {"time": 4721, "text": "Like I'm not a, driver monitoring is such an obvious, simple solution to the problem of attention."}, {"time": 4729, "text": "It's not obvious to me that just by putting a camera there, you solve things."}, {"time": 4734, "text": "You have to create an incredible, compelling experience."}, {"time": 4739, "text": "Just like you're talking about."}, {"time": 4741, "text": "I don't know if it's easy to do that."}, {"time": 4743, "text": "It's not at all easy to do that, in fact, I think."}, {"time": 4745, "text": "So as a creator of a car that's trying to create a product that people love, which is what Tesla tries to do, right?"}, {"time": 4754, "text": "It's not obvious to me that as a design decision, whether adding a camera is a good idea."}, {"time": 4760, "text": "From a safety perspective either, like in the human factors community, everybody says that you should obviously have driver sensing, driver monitoring."}, {"time": 4770, "text": "But that's like saying it's obvious as parents, you shouldn't let your kids go out at night."}, {"time": 4779, "text": "But okay, but like, they're still gonna find ways to do drugs."}, {"time": 4785, "text": "Like, you have to also be good parents."}, {"time": 4789, "text": "So like, it's much more complicated than just the, you need to have driver monitoring."}, {"time": 4794, "text": "I totally disagree on, okay, if you have a camera there and the camera's watching the person, but never throws an alert, they'll never think about it."}, {"time": 4804, "text": "The driver monitoring policy that you choose to, how you choose to communicate with the user is entirely separate from the data collection perspective."}, {"time": 4815, "text": "So, you know, like, there's one thing to say, like, you know, tell your teenager they can't do something."}, {"time": 4824, "text": "There's another thing to like, you know, gather the data."}, {"time": 4827, "text": "So you can make informed decisions."}, {"time": 4829, "text": "But you have to make that, that's the interesting thing about cars."}, {"time": 4833, "text": "But even true with common AI, like you don't have to manufacture the thing into the car, is you have to make a decision that anticipates the right strategy longterm."}, {"time": 4844, "text": "So like, you have to start collecting the data and start making decisions."}, {"time": 4847, "text": "Started it three years ago."}, {"time": 4849, "text": "I believe that we have the best driver monitoring solution in the world."}, {"time": 4854, "text": "I think that when you compare it to Super Cruise is the only other one that I really know that shipped."}, {"time": 4859, "text": "And ours is better."}, {"time": 4861, "text": "What do you like and not like about Super Cruise?"}, {"time": 4866, "text": "I mean, I had a few Super Cruise, the sun would be shining through the window, would blind the camera, and it would say I wasn't paying attention."}, {"time": 4874, "text": "When I was looking completely straight, I couldn't reset the attention with a steering wheel touch and Super Cruise would disengage."}, {"time": 4881, "text": "Like I was communicating to the car, I'm like, look, I am here, I am paying attention."}, {"time": 4884, "text": "Why are you really gonna force me to disengage?"}, {"time": 4886, "text": "And it did."}, {"time": 4888, "text": "So it's a constant conversation with the user."}, {"time": 4892, "text": "And yeah, there's no way to ship a system like this if you can OTA."}, {"time": 4895, "text": "We're shipping a new one every month."}, {"time": 4897, "text": "Sometimes we balance it with our users on Discord."}, {"time": 4900, "text": "Like sometimes we make the driver monitoring a little more aggressive and people complain."}, {"time": 4903, "text": "Sometimes they don't."}, {"time": 4905, "text": "We want it to be as aggressive as possible where people don't complain and it doesn't feel intrusive."}, {"time": 4909, "text": "So being able to update the system over the air is an essential component."}, {"time": 4912, "text": "I mean, that's probably to me, you mentioned, I mean, to me that is the biggest innovation of Tesla, that it made people realize that over the air updates is essential."}, {"time": 4927, "text": "I mean, was that not obvious from the iPhone?"}, {"time": 4930, "text": "The iPhone was the first real product that OTA'd, I think."}, {"time": 4933, "text": "Was it actually, that's brilliant, you're right."}, {"time": 4935, "text": "I mean, the game consoles used to not, right?"}, {"time": 4937, "text": "The game consoles were maybe the second thing that did."}, {"time": 4938, "text": "Wow, I didn't really think about one of the amazing features of a smartphone isn't just like the touchscreen isn't the thing, it's the ability to constantly update."}, {"time": 4950, "text": "Yeah, it gets better."}, {"time": 4951, "text": "It gets better."}, {"time": 4955, "text": "Love my iOS 14."}, {"time": 4958, "text": "Well, one thing that I probably disagree with you on driver monitoring is you said that it's easy."}, {"time": 4966, "text": "I mean, you tend to say stuff is easy."}, {"time": 4968, "text": "I'm sure the, I guess you said it's easy relative to the external perception problem."}, {"time": 4978, "text": "Can you elaborate why you think it's easy?"}, {"time": 4980, "text": "Feature engineering works for driver monitoring."}, {"time": 4983, "text": "Feature engineering does not work for the external."}, {"time": 4985, "text": "So human faces are not, human faces and the movement of human faces and head and body is not as variable as the external environment, is your intuition?"}, {"time": 4997, "text": "Yes, and there's another big difference as well."}, {"time": 5000, "text": "Your reliability of a driver monitoring system doesn't actually need to be that high."}, {"time": 5004, "text": "The uncertainty, if you have something that's detecting whether the human's paying attention and it only works 92% of the time, you're still getting almost all the benefit of that because the human, like you're training the human, right?"}, {"time": 5015, "text": "You're dealing with a system that's really helping you out."}, {"time": 5019, "text": "It's a conversation."}, {"time": 5020, "text": "It's not like the external thing where guess what?"}, {"time": 5023, "text": "If you swerve into a tree, you swerve into a tree, right?"}, {"time": 5026, "text": "Like you get no margin for error there."}, {"time": 5028, "text": "Yeah, I think that's really well put."}, {"time": 5029, "text": "I think that's the right, exactly the place where comparing to the external perception, the control problem, the driver monitoring is easier because you don't, the bar for success is much lower."}, {"time": 5045, "text": "Yeah, but I still think like the human face is more complicated actually than the external environment, but for driving, you don't give a damn."}, {"time": 5054, "text": "I don't need, yeah, I don't need something, I don't need something that complicated to have to communicate the idea to the human that I want to communicate, which is, yo, system might mess up here."}, {"time": 5065, "text": "You gotta pay attention."}, {"time": 5066, "text": "Yeah, see, that's my love and fascination is the human face."}, {"time": 5072, "text": "And it feels like this is a nice place to create products that create an experience in the car."}, {"time": 5080, "text": "So like, it feels like there should be more richer experiences in the car, you know?"}, {"time": 5087, "text": "Like that's an opportunity for like something like On My Eye or just any kind of system like a Tesla or any of the autonomous vehicle companies is because software is, there's much more sensors and so much is on our software and you're doing machine learning anyway, there's an opportunity to create totally new experiences that we're not even anticipating."}, {"time": 5110, "text": "You think it's a box that gets you from A to B and you want to do it chill?"}, {"time": 5114, "text": "Yeah, I mean, I think as soon as we get to level three on highways, okay, enjoy your candy crush, enjoy your Hulu, enjoy your, you know, whatever, whatever."}, {"time": 5123, "text": "Sure, you get this, you can look at screens basically versus right now where you have music and audio books."}, {"time": 5128, "text": "So level three is where you can kind of disengage in stretches of time."}, {"time": 5134, "text": "Well, you think level three is possible?"}, {"time": 5137, "text": "Like on the highway going for 100 miles and you can just go to sleep?"}, {"time": 5140, "text": "Oh yeah, sleep."}, {"time": 5143, "text": "So again, I think it's really all on a spectrum."}, {"time": 5147, "text": "I think that being able to use your phone while you're on the highway and like this all being okay and being aware that the car might alert you and you have five seconds to basically."}, {"time": 5157, "text": "So the five second thing is you think is possible?"}, {"time": 5159, "text": "Yeah, I think it is, oh yeah."}, {"time": 5160, "text": "Not in all scenarios, right?"}, {"time": 5162, "text": "Some scenarios it's not."}, {"time": 5163, "text": "It's the whole risk thing that you mentioned is nice is to be able to estimate like how risky is this situation?"}, {"time": 5170, "text": "That's really important to understand."}, {"time": 5172, "text": "One other thing you mentioned comparing KAMA and Autopilot is that something about the haptic feel of the way KAMA controls the car when things are uncertain."}, {"time": 5185, "text": "Like it behaves a little bit more uncertain when things are uncertain."}, {"time": 5189, "text": "That's kind of an interesting point."}, {"time": 5191, "text": "And then Autopilot is much more confident always even when it's uncertain until it runs into trouble."}, {"time": 5199, "text": "That's a funny thing."}, {"time": 5200, "text": "I actually mentioned that to Elon, I think."}, {"time": 5202, "text": "And then the first time we talked, he wasn't biting."}, {"time": 5206, "text": "It's like communicating uncertainty."}, {"time": 5208, "text": "I guess KAMA doesn't really communicate uncertainty explicitly, it communicates it through haptic feel."}, {"time": 5215, "text": "Like what's the role of communicating uncertainty do you think?"}, {"time": 5218, "text": "Oh, we do some stuff explicitly."}, {"time": 5219, "text": "Like we do detect the lanes when you're on the highway and we'll show you how many lanes we're using to drive with."}, {"time": 5224, "text": "You can look at where it thinks the lanes are."}, {"time": 5226, "text": "You can look at the path."}, {"time": 5228, "text": "And we want to be better about this."}, {"time": 5230, "text": "We're actually hiring, want to hire some new UI people."}, {"time": 5232, "text": "UI people, you mentioned this."}, {"time": 5234, "text": "Cause it's such an, it's a UI problem too, right?"}, {"time": 5237, "text": "We have a great designer now, but you know, we need people who are just going to like build this and debug these UIs, QT people."}, {"time": 5243, "text": "QT."}, {"time": 5244, "text": "Is that what the UI is done with, is QT?"}, {"time": 5246, "text": "The new UI is in QT."}, {"time": 5249, "text": "C++ QT?"}, {"time": 5252, "text": "Tesla uses it too."}, {"time": 5254, "text": "We had some React stuff in there."}, {"time": 5257, "text": "React JS or just React?"}, {"time": 5259, "text": "React is his own language, right?"}, {"time": 5261, "text": "React Native, React is a JavaScript framework."}, {"time": 5265, "text": "So it's all based on JavaScript, but it's, you know, I like C++."}, {"time": 5271, "text": "What do you think about Dojo with Tesla and their foray into what appears to be specialized hardware for training your own nets?"}, {"time": 5285, "text": "I guess it's something, maybe you can correct me, from my shallow looking at it, it seems like something like Google did with TPUs, but specialized for driving data."}, {"time": 5295, "text": "I don't think it's specialized for driving data."}, {"time": 5298, "text": "It's just legit, just TPU."}, {"time": 5300, "text": "They want to go the Apple way, basically everything required in the chain is done in house."}, {"time": 5305, "text": "Well, so you have a problem right now, and this is one of my concerns."}, {"time": 5311, "text": "I really would like to see somebody deal with this."}, {"time": 5313, "text": "If anyone out there is doing it, I'd like to help them if I can."}, {"time": 5318, "text": "You basically have two options right now to train."}, {"time": 5320, "text": "One, your options are NVIDIA or Google."}, {"time": 5325, "text": "So Google is not even an option."}, {"time": 5330, "text": "Their TPUs are only available in Google Cloud."}, {"time": 5333, "text": "Google has absolutely onerous terms of service restrictions."}, {"time": 5338, "text": "They may have changed it, but back in Google's terms of service, it said explicitly you are not allowed to use Google Cloud ML for training autonomous vehicles or for doing anything that competes with Google without Google's prior written permission."}, {"time": 5350, "text": "I mean, Google is not a platform company."}, {"time": 5354, "text": "I wouldn't touch TPUs with a 10 foot pole."}, {"time": 5356, "text": "So that leaves you with the monopoly."}, {"time": 5359, "text": "NVIDIA?"}, {"time": 5359, "text": "NVIDIA."}, {"time": 5362, "text": "That you're not a fan of."}, {"time": 5363, "text": "Well, look, I was a huge fan of in 2016 NVIDIA."}, {"time": 5368, "text": "Jensen came sat in the car."}, {"time": 5371, "text": "Cool guy."}, {"time": 5372, "text": "When the stock was $30 a share."}, {"time": 5375, "text": "NVIDIA stock has skyrocketed."}, {"time": 5378, "text": "I witnessed a real change in who was in management over there in like 2018."}, {"time": 5383, "text": "And now they are, let's exploit."}, {"time": 5386, "text": "Let's take every dollar we possibly can out of this ecosystem."}, {"time": 5389, "text": "Let's charge $10,000 for A100s because we know we got the best shit in the game."}, {"time": 5394, "text": "And let's charge $10,000 for an A100 when it's really not that different from a 3080, which is 699."}, {"time": 5403, "text": "The margins that they are making off of those high end chips are so high that, I mean, I think they're shooting themselves in the foot just from a business perspective."}, {"time": 5412, "text": "Because there's a lot of people talking like me now who are like, somebody's gotta take NVIDIA down."}, {"time": 5419, "text": "Where they could dominate it."}, {"time": 5421, "text": "NVIDIA could be the new Intel."}, {"time": 5422, "text": "Yeah, to be inside everything essentially."}, {"time": 5426, "text": "And yet the winners in certain spaces like autonomous driving, the winners, only the people who are like desperately falling back and trying to catch up and have a ton of money, like the big automakers are the ones interested in partnering with NVIDIA."}, {"time": 5443, "text": "Oh, and I think a lot of those things are gonna fall through."}, {"time": 5445, "text": "If I were NVIDIA, sell chips."}, {"time": 5449, "text": "Sell chips at a reasonable markup."}, {"time": 5453, "text": "Without any restrictions."}, {"time": 5456, "text": "Intel did this."}, {"time": 5457, "text": "Look at Intel."}, {"time": 5458, "text": "They had a great long run."}, {"time": 5459, "text": "NVIDIA is trying to turn their, they're like trying to productize their chips way too much."}, {"time": 5465, "text": "They're trying to extract way more value than they can sustainably."}, {"time": 5469, "text": "Sure, you can do it tomorrow."}, {"time": 5470, "text": "Is it gonna up your share price?"}, {"time": 5472, "text": "Sure, if you're one of those CEOs who's like, how much can I strip mine this company?"}, {"time": 5475, "text": "And I think, you know, and that's what's weird about it too."}, {"time": 5477, "text": "Like the CEO is the founder."}, {"time": 5479, "text": "It's the same guy."}, {"time": 5481, "text": "I mean, I still think Jensen's a great guy."}, {"time": 5482, "text": "He is great."}, {"time": 5483, "text": "Why do this?"}, {"time": 5486, "text": "You have a choice right now."}, {"time": 5487, "text": "Are you trying to cash out?"}, {"time": 5488, "text": "Are you trying to buy a yacht?"}, {"time": 5490, "text": "If you are, fine."}, {"time": 5492, "text": "But if you're trying to be the next huge semiconductor company, sell chips."}, {"time": 5497, "text": "Well, the interesting thing about Jensen is he is a big vision guy."}, {"time": 5502, "text": "So he has a plan like for 50 years down the road."}, {"time": 5508, "text": "So it makes me wonder like."}, {"time": 5510, "text": "How does price gouging fit into it?"}, {"time": 5511, "text": "Yeah, how does that, like it's, it doesn't seem to make sense as a plan."}, {"time": 5517, "text": "I worry that he's listening to the wrong people."}, {"time": 5519, "text": "Yeah, that's the sense I have too sometimes."}, {"time": 5522, "text": "Because I, despite everything, I think NVIDIA is an incredible company."}, {"time": 5529, "text": "Well, one, so I'm deeply grateful to NVIDIA for the products they've created in the past."}, {"time": 5536, "text": "The 1080 Ti was a great GPU."}, {"time": 5538, "text": "Still have a lot of them."}, {"time": 5538, "text": "Still is, yeah."}, {"time": 5541, "text": "But at the same time, it just feels like, feels like you don't want to put all your stock in NVIDIA."}, {"time": 5549, "text": "And so like Elon is doing, what Tesla is doing with Autopilot and Dojo is the Apple way is, because they're not going to share Dojo with George Hott's."}, {"time": 5562, "text": "They should sell that chip."}, {"time": 5563, "text": "Oh, they should sell that."}, {"time": 5564, "text": "Even their accelerator."}, {"time": 5566, "text": "The accelerator that's in all the cars, the 30 watt one."}, {"time": 5569, "text": "Sell it, why not?"}, {"time": 5571, "text": "So open it up."}, {"time": 5572, "text": "Like make, why does Tesla have to be a car company?"}, {"time": 5575, "text": "Well, if you sell the chip, here's what you get."}, {"time": 5579, "text": "Make some money off the chips."}, {"time": 5580, "text": "It doesn't take away from your chip."}, {"time": 5582, "text": "You're going to make some money, free money."}, {"time": 5583, "text": "And also the world is going to build an ecosystem of tooling for you."}, {"time": 5589, "text": "You're not going to have to fix the bug in your 10H layer."}, {"time": 5592, "text": "Someone else already did."}, {"time": 5595, "text": "Well, the question, that's an interesting question."}, {"time": 5596, "text": "I mean, that's the question Steve Jobs asked."}, {"time": 5598, "text": "That's the question Elon Musk is perhaps asking is, do you want Tesla stuff inside other vehicles?"}, {"time": 5608, "text": "Inside, potentially inside like a iRobot vacuum cleaner."}, {"time": 5614, "text": "I think you should decide where your advantages are."}, {"time": 5617, "text": "I'm not saying Tesla should start selling battery packs to automakers."}, {"time": 5620, "text": "Because battery packs to automakers, they are straight up in competition with you."}, {"time": 5623, "text": "If I were Tesla, I'd keep the battery technology totally."}, {"time": 5626, "text": "As far as we make batteries."}, {"time": 5627, "text": "But the thing about the Tesla TPU is anybody can build that."}, {"time": 5633, "text": "It's just a question of, you know, are you willing to spend the money?"}, {"time": 5637, "text": "It could be a huge source of revenue potentially."}, {"time": 5640, "text": "Are you willing to spend a hundred million dollars?"}, {"time": 5642, "text": "Anyone can build it."}, {"time": 5643, "text": "And someone will."}, {"time": 5644, "text": "And a bunch of companies now are starting trying to build AI accelerators."}, {"time": 5648, "text": "Somebody is going to get the idea right."}, {"time": 5650, "text": "And yeah, hopefully they don't get greedy because they'll just lose to the next guy who finally, and then eventually the Chinese are going to make knockoff and video chips and that's."}, {"time": 5659, "text": "From your perspective, I don't know if you're also paying attention to stay on Tesla for a moment."}, {"time": 5664, "text": "Dave, Elon Musk has talked about a complete rewrite of the neural net that they're using."}, {"time": 5671, "text": "That seems to, again, I'm half paying attention, but it seems to involve basically a kind of integration of all the sensors to where it's a four dimensional view."}, {"time": 5684, "text": "You know, you have a 3D model of the world over time."}, {"time": 5687, "text": "And then you can, I think it's done both for the, for the actually, you know, so the neural network is able to, in a more holistic way, deal with the world and make predictions and so on, but also to make the annotation task more, you know, easier."}, {"time": 5704, "text": "Like you can annotate the world in one place and then kind of distribute itself across the sensors and across a different, like the hundreds of tasks that are involved in the Hydro Net."}, {"time": 5716, "text": "What are your thoughts about this rewrite?"}, {"time": 5719, "text": "Is it just like some details that are kind of obvious that are steps that should be taken, or is there something fundamental that could challenge your idea that end to end is the right solution?"}, {"time": 5731, "text": "We're in the middle of a big rewrite now as well."}, {"time": 5733, "text": "We haven't shipped a new model in a bit."}, {"time": 5734, "text": "Of what kind?"}, {"time": 5736, "text": "We're going from 2D to 3D."}, {"time": 5738, "text": "Right now, all our stuff, like for example, when the car pitches back, the lane lines also pitch back because we're assuming the flat world hypothesis."}, {"time": 5747, "text": "The new models do not do this."}, {"time": 5748, "text": "The new models output everything in 3D."}, {"time": 5750, "text": "But there's still no annotation."}, {"time": 5753, "text": "So the 3D is, it's more about the output."}, {"time": 5757, "text": "We have Zs in everything."}, {"time": 5760, "text": "We've... Zs."}, {"time": 5762, "text": "We had a Zs."}, {"time": 5764, "text": "We unified a lot of stuff as well."}, {"time": 5766, "text": "We switched from TensorFlow to PyTorch."}, {"time": 5770, "text": "My understanding of what Tesla's thing is, is that their annotator now annotates across the time dimension."}, {"time": 5779, "text": "I mean, cute."}, {"time": 5782, "text": "Why are you building an annotator?"}, {"time": 5784, "text": "I find their entire pipeline."}, {"time": 5788, "text": "I find your vision, I mean, the vision of end to end very compelling, but I also like the engineering of the data engine that they've created."}, {"time": 5797, "text": "In terms of supervised learning pipelines, that thing is damn impressive."}, {"time": 5803, "text": "You're basically, the idea is that you have hundreds of thousands of people that are doing data collection for you by doing their experience."}, {"time": 5812, "text": "So that's kind of similar to the Comma AI model."}, {"time": 5815, "text": "And you're able to mine that data based on the kind of edge cases you need."}, {"time": 5822, "text": "I think it's harder to do in the end to end learning."}, {"time": 5827, "text": "The mining of the right edge cases."}, {"time": 5829, "text": "Like that's where feature engineering is actually really powerful because like us humans are able to do this kind of mining a little better."}, {"time": 5839, "text": "But yeah, there's obvious, as we know, there's obvious constraints and limitations to that idea."}, {"time": 5845, "text": "Carpathia just tweeted, he's like, you get really interesting insights if you sort your validation set by loss and look at the highest loss examples."}, {"time": 5857, "text": "So yeah, I mean, you can do, we have a little data engine like thing."}, {"time": 5862, "text": "We're training a segment."}, {"time": 5863, "text": "I know it's not fancy."}, {"time": 5864, "text": "It's just like, okay, train the new segment, run it on 100,000 images and now take the thousand with highest loss."}, {"time": 5872, "text": "Select a hundred of those by human, put those, get those ones labeled, retrain, do it again."}, {"time": 5877, "text": "And so it's a much less well written data engine."}, {"time": 5881, "text": "And yeah, you can take these things really far and it is impressive engineering."}, {"time": 5886, "text": "And if you truly need supervised data for a problem, yeah, things like data engine are at the high end of what is attention?"}, {"time": 5894, "text": "Is a human paying attention?"}, {"time": 5895, "text": "I mean, we're going to probably build something that looks like data engine to push our driver monitoring further."}, {"time": 5901, "text": "But for driving itself, you have it all annotated beautifully by what the human does."}, {"time": 5907, "text": "I mean, that applies to driver attention as well."}, {"time": 5910, "text": "Do you want to detect the eyes?"}, {"time": 5911, "text": "Do you want to detect blinking and pupil movement?"}, {"time": 5913, "text": "Do you want to detect all the like face alignments or landmark detection and so on, and then doing kind of reasoning based on that?"}, {"time": 5921, "text": "Or do you want to take the entirety of the face over time and do end to end?"}, {"time": 5925, "text": "I mean, it's obvious that eventually you have to do end to end with some calibration, some fixes and so on, but it's like, I don't know when that's the right move."}, {"time": 5935, "text": "Even if it's end to end, there actually is, there is no kind of, you have to supervise that with humans."}, {"time": 5943, "text": "Whether a human is paying attention or not is a completely subjective judgment."}, {"time": 5948, "text": "Like you can try to like automatically do it with some stuff, but you don't have, if I record a video of a human, I don't have true annotations anywhere in that video."}, {"time": 5958, "text": "The only way to get them is with, you know, other humans labeling it really."}, {"time": 5966, "text": "If you think deeply about it, you could, you might be able to just, depending on the task, maybe a discover self annotating things like, you know, you can look at like steering wheel reverse or something like that."}, {"time": 5977, "text": "You can discover little moments of lapse of attention."}, {"time": 5981, "text": "I mean, that's where psychology comes in."}, {"time": 5984, "text": "Is there indicate, cause you have so much data to look at."}, {"time": 5988, "text": "So you might be able to find moments when there's like, just inattention that even with smartphone, if you want to detect smartphone use, you can start to zoom in."}, {"time": 5997, "text": "I mean, that's the gold mine, sort of the comma AI."}, {"time": 6001, "text": "I mean, Tesla is doing this too, right?"}, {"time": 6002, "text": "Is they're doing annotation based on, it's like a self supervised learning too."}, {"time": 6010, "text": "It's just a small part of the entire picture."}, {"time": 6013, "text": "That's kind of the challenge of solving a problem in machine learning."}, {"time": 6018, "text": "If you can discover self annotating parts of the problem, right?"}, {"time": 6025, "text": "Our driver monitoring team is half a person right now."}, {"time": 6027, "text": "I would, you know, once we have, once we have two, three people on that team, I definitely want to look at self annotating stuff for attention."}, {"time": 6038, "text": "Let's go back for a sec to a comma and what, you know, for people who are curious to try it out, how do you install a comma in say a 2020 Toyota Corolla or like, what are the cars that are supported?"}, {"time": 6053, "text": "What are the cars that you recommend?"}, {"time": 6055, "text": "And what does it take?"}, {"time": 6057, "text": "You have a few videos out, but maybe through words, can you explain what's it take to actually install a thing?"}, {"time": 6062, "text": "So we support, I think it's 91 cars, 91 makes the models."}, {"time": 6068, "text": "We've got to 100 this year."}, {"time": 6071, "text": "The, yeah, the 2020 Corolla, great choice."}, {"time": 6076, "text": "The 2020 Sonata, it's using the stock longitudinal."}, {"time": 6081, "text": "It's using just our lateral control, but it's a very refined car."}, {"time": 6085, "text": "Their longitudinal control is not bad at all."}, {"time": 6088, "text": "So yeah, Corolla, Sonata, or if you're willing to get your hands a little dirty and look in the right places on the internet, the Honda Civic is great, but you're going to have to install a modified EPS firmware in order to get a little bit more torque."}, {"time": 6102, "text": "And I can't help you with that."}, {"time": 6103, "text": "Comma does not officially endorse that, but we have been doing it."}, {"time": 6107, "text": "We didn't ever release it."}, {"time": 6109, "text": "We waited for someone else to discover it."}, {"time": 6111, "text": "And then, you know."}, {"time": 6112, "text": "And you have a Discord server where people, there's a very active developer community, I suppose."}, {"time": 6120, "text": "So depending on the level of experimentation you're willing to do, that's the community."}, {"time": 6127, "text": "If you just want to buy it and you have a supported car, it's 10 minutes to install."}, {"time": 6133, "text": "There's YouTube videos."}, {"time": 6135, "text": "It's Ikea furniture level."}, {"time": 6137, "text": "If you can set up a table from Ikea, you can install a Comma 2 in your supported car and it will just work."}, {"time": 6142, "text": "Now you're like, oh, but I want this high end feature or I want to fix this bug."}, {"time": 6146, "text": "Okay, well, welcome to the developer community."}, {"time": 6149, "text": "So what, if I wanted to, this is something I asked you offline like a few months ago."}, {"time": 6154, "text": "If I wanted to run my own code to, so use Comma as a platform and try to run something like OpenPilot, what does it take to do that?"}, {"time": 6168, "text": "So there's a toggle in the settings called enable SSH."}, {"time": 6171, "text": "And if you toggle that, you can SSH into your device."}, {"time": 6174, "text": "You can modify the code."}, {"time": 6175, "text": "You can upload whatever code you want to it."}, {"time": 6178, "text": "There's a whole lot of people."}, {"time": 6179, "text": "So about 60% of people are running stock comma."}, {"time": 6183, "text": "About 40% of people are running forks."}, {"time": 6185, "text": "And there's a community of, there's a bunch of people who maintain these forks and these forks support different cars or they have different toggles."}, {"time": 6195, "text": "We try to keep away from the toggles that are like disabled driver monitoring, but there's some people might want that kind of thing and like, yeah, you can, it's your car."}, {"time": 6204, "text": "I'm not here to tell you."}, {"time": 6209, "text": "We have some, we ban, if you're trying to subvert safety features, you're banned from our Discord."}, {"time": 6213, "text": "I don't want anything to do with you, but there's some forks doing that."}, {"time": 6219, "text": "So you encourage responsible forking."}, {"time": 6223, "text": "We encourage, some people, yeah, some people, like there's forks that will do, some people just like having a lot of readouts on the UI, like a lot of like flashing numbers."}, {"time": 6233, "text": "So there's forks that do that."}, {"time": 6235, "text": "Some people don't like the fact that it disengages when you press the gas pedal."}, {"time": 6238, "text": "There's forks that disable that."}, {"time": 6241, "text": "Now the stock experience is what like, so it does both lane keeping and longitudinal control all together."}, {"time": 6248, "text": "So it's not separate like it is in autopilot."}, {"time": 6251, "text": "No, so, okay."}, {"time": 6252, "text": "Some cars we use the stock longitudinal control."}, {"time": 6255, "text": "We don't do the longitudinal control in all the cars."}, {"time": 6257, "text": "Some cars, the ACCs are pretty good in the cars."}, {"time": 6259, "text": "It's the lane keep that's atrocious in anything except for autopilot and super cruise."}, {"time": 6263, "text": "But, you know, you just turn it on and it works."}, {"time": 6267, "text": "What does this engagement look like?"}, {"time": 6269, "text": "Yeah, so we have, I mean, I'm very concerned about mode confusion."}, {"time": 6272, "text": "I've experienced it on super cruise and autopilot where like autopilot, like autopilot disengages."}, {"time": 6279, "text": "I don't realize that the ACC is still on."}, {"time": 6282, "text": "The lead car moves slightly over and then the Tesla accelerates to like whatever my set speed is super fast."}, {"time": 6288, "text": "I'm like, what's going on here?"}, {"time": 6291, "text": "We have engaged and disengaged."}, {"time": 6293, "text": "And this is similar to my understanding, I'm not a pilot, but my understanding is either the pilot is in control or the copilot is in control."}, {"time": 6302, "text": "And we have the same kind of transition system."}, {"time": 6305, "text": "Either open pilot is engaged or open pilot is disengaged."}, {"time": 6308, "text": "Engage with cruise control, disengage with either gas brake or cancel."}, {"time": 6313, "text": "Let's talk about money."}, {"time": 6314, "text": "What's the business strategy for Kama?"}, {"time": 6317, "text": "Profitable."}, {"time": 6318, "text": "Well, so you're."}, {"time": 6319, "text": "We did it."}, {"time": 6320, "text": "So congratulations."}, {"time": 6323, "text": "What, so basically selling, so we should say Kama cost a thousand bucks, Kama two?"}, {"time": 6329, "text": "200 for the interface to the car as well."}, {"time": 6331, "text": "It's 1200, I'll send that."}, {"time": 6334, "text": "Nobody's usually upfront like this."}, {"time": 6336, "text": "Yeah, you gotta add the tack on, right?"}, {"time": 6339, "text": "I'm not gonna lie to you."}, {"time": 6341, "text": "Trust me, it will add $1,200 of value to your life."}, {"time": 6343, "text": "Yes, it's still super cheap."}, {"time": 6345, "text": "30 days, no questions asked, money back guarantee, and prices are only going up."}, {"time": 6350, "text": "If there ever is future hardware, it could cost a lot more than $1,200."}, {"time": 6353, "text": "So Kama three is in the works."}, {"time": 6357, "text": "All I will say is future hardware is going to cost a lot more than the current hardware."}, {"time": 6362, "text": "Yeah, the people that use, the people I've spoken with that use Kama, that use open pilot, first of all, they use it a lot."}, {"time": 6372, "text": "So people that use it, they fall in love with it."}, {"time": 6374, "text": "Oh, our retention rate is insane."}, {"time": 6376, "text": "It's a good sign."}, {"time": 6378, "text": "It's a really good sign."}, {"time": 6379, "text": "70% of Kama two buyers are daily active users."}, {"time": 6383, "text": "Yeah, it's amazing."}, {"time": 6387, "text": "Oh, also, we don't plan on stopping selling the Kama two."}, {"time": 6390, "text": "Like it's, you know."}, {"time": 6391, "text": "So whatever you create that's beyond Kama two, it would be potentially a phase shift."}, {"time": 6400, "text": "Like it's so much better that, like you could use Kama two and you can use Kama whatever."}, {"time": 6405, "text": "Depends what you want."}, {"time": 6406, "text": "It's 3.41, 42."}, {"time": 6409, "text": "You know, autopilot hardware one versus hardware two."}, {"time": 6412, "text": "The Kama two is kind of like hardware one."}, {"time": 6413, "text": "Got it, got it."}, {"time": 6414, "text": "You can still use both."}, {"time": 6416, "text": "I think I heard you talk about retention rate with the VR headsets that the average is just once."}, {"time": 6422, "text": "Just fast."}, {"time": 6422, "text": "I mean, it's such a fascinating way to think about technology."}, {"time": 6425, "text": "And this is a really, really good sign."}, {"time": 6427, "text": "And the other thing that people say about Kama is like they can't believe they're getting this 4,000 bucks."}, {"time": 6432, "text": "It seems like some kind of steal."}, {"time": 6437, "text": "So, but in terms of like longterm business strategies that basically to put, so it's currently in like a thousand plus cars."}, {"time": 6447, "text": "1,200."}, {"time": 6448, "text": "More, more."}, {"time": 6450, "text": "So yeah, dailies is about, dailies is about 2,000."}, {"time": 6455, "text": "Weeklys is about 2,500, monthlys is over 3,000."}, {"time": 6459, "text": "We've grown a lot since we last talked."}, {"time": 6462, "text": "Is the goal, like can we talk crazy for a second?"}, {"time": 6464, "text": "I mean, what's the goal to overtake Tesla?"}, {"time": 6468, "text": "Let's talk, okay, so."}, {"time": 6469, "text": "I mean, Android did overtake iOS."}, {"time": 6471, "text": "That's exactly it, right?"}, {"time": 6472, "text": "So they did it."}, {"time": 6475, "text": "I actually don't know the timeline of that one."}, {"time": 6477, "text": "But let's talk, because everything is in alpha now."}, {"time": 6482, "text": "The autopilot you could argue is in alpha in terms of towards the big mission of autonomous driving, right?"}, {"time": 6487, "text": "And so what, yeah, is your goal to overtake millions of cars essentially?"}, {"time": 6495, "text": "Where would it stop?"}, {"time": 6496, "text": "Like it's open source software."}, {"time": 6498, "text": "It might not be millions of cars with a piece of comma hardware, but yeah."}, {"time": 6501, "text": "I think open pilot at some point will cross over autopilot in users, just like Android crossed over iOS."}, {"time": 6509, "text": "How does Google make money from Android?"}, {"time": 6514, "text": "Their own devices make money."}, {"time": 6517, "text": "Google, Google makes money by just kind of having you on the internet."}, {"time": 6523, "text": "Google search is built in, Gmail is built in."}, {"time": 6525, "text": "Android is just a shill for the rest of Google's ecosystem."}, {"time": 6528, "text": "Yeah, but the problem is Android is not, is a brilliant thing."}, {"time": 6532, "text": "I mean, Android arguably changed the world."}, {"time": 6536, "text": "That's, you can feel good ethically speaking."}, {"time": 6540, "text": "But as a business strategy, it's questionable."}, {"time": 6544, "text": "Or sell hardware."}, {"time": 6545, "text": "Sell hardware."}, {"time": 6546, "text": "I mean, it took Google a long time to come around to it, but they are now making money on the Pixel."}, {"time": 6550, "text": "You're not about money, you're more about winning."}, {"time": 6554, "text": "No, but if only 10% of open pilot devices come from comma AI."}, {"time": 6559, "text": "They still make a lot."}, {"time": 6560, "text": "That is still, yes."}, {"time": 6561, "text": "That is a ton of money for our company."}, {"time": 6562, "text": "But can't somebody create a better comma using open pilot?"}, {"time": 6567, "text": "Or are you basically saying, well, I'll compete them?"}, {"time": 6568, "text": "Well, I'll compete you."}, {"time": 6569, "text": "Can you create a better Android phone than the Google Pixel?"}, {"time": 6572, "text": "I mean, you can, but like, you know."}, {"time": 6575, "text": "So you're confident, like, you know what the hell you're doing."}, {"time": 6580, "text": "It's confidence and merit."}, {"time": 6583, "text": "I mean, our money comes from, we're a consumer electronics company."}, {"time": 6586, "text": "And put it this way."}, {"time": 6588, "text": "So we sold like 3,000 comma twos."}, {"time": 6591, "text": "2,500 right now."}, {"time": 6594, "text": "And like, OK, we're probably going to sell 10,000 units next year."}, {"time": 6601, "text": "10,000 units, even just $1,000 a unit, OK, we're at 10 million in revenue."}, {"time": 6609, "text": "Get that up to 100,000, maybe double the price of the unit."}, {"time": 6612, "text": "Now we're talking like 200 million revenue."}, {"time": 6613, "text": "We're talking like series."}, {"time": 6614, "text": "Yeah, actually making money."}, {"time": 6615, "text": "One of the rare semi autonomous or autonomous vehicle companies that are actually making money."}, {"time": 6622, "text": "You know, if you look at a model, and we were just talking about this yesterday."}, {"time": 6626, "text": "If you look at a model, and like you're AB testing your model, and if you're one branch of the AB test, the losses go down very fast in the first five epochs."}, {"time": 6635, "text": "That model is probably going to converge to something considerably better than the one where the losses are going down slower."}, {"time": 6641, "text": "Why do people think this is going to stop?"}, {"time": 6643, "text": "Why do people think one day there's going to be a great like, well, Waymo's eventually going to surpass you guys?"}, {"time": 6649, "text": "Well, they're not."}, {"time": 6652, "text": "Do you see like a world where like a Tesla or a car like a Tesla would be able to basically press a button and you like switch to open pilot?"}, {"time": 6661, "text": "You know, you load in."}, {"time": 6664, "text": "No, so I think so first off, I think that we may surpass Tesla in terms of users."}, {"time": 6670, "text": "I do not think we're going to surpass Tesla ever in terms of revenue."}, {"time": 6673, "text": "I think Tesla can capture a lot more revenue per user than we can."}, {"time": 6677, "text": "But this mimics the Android iOS model exactly."}, {"time": 6680, "text": "There may be more Android devices, but there's a lot more iPhones than Google Pixels."}, {"time": 6684, "text": "So I think there'll be a lot more Tesla cars sold than pieces of common hardware."}, {"time": 6690, "text": "And then as far as a Tesla owner being able to switch to open pilot, does iPhones run Android?"}, {"time": 6700, "text": "No, but it doesn't make sense."}, {"time": 6702, "text": "You can if you really want to do it, but it doesn't really make sense."}, {"time": 6704, "text": "Like it's not."}, {"time": 6705, "text": "It doesn't make sense."}, {"time": 6706, "text": "What about if a large company like automakers, Ford, GM, Toyota came to George Hots?"}, {"time": 6713, "text": "Or on the tech space, Amazon, Facebook, Google came with a large pile of cash?"}, {"time": 6721, "text": "Would you consider being purchased?"}, {"time": 6727, "text": "Do you see that as a one possible?"}, {"time": 6730, "text": "Not seriously, no."}, {"time": 6732, "text": "I would probably see how much shit they'll entertain for me."}, {"time": 6739, "text": "And if they're willing to jump through a bunch of my hoops, then maybe."}, {"time": 6742, "text": "But no, not the way that M&A works today."}, {"time": 6745, "text": "I mean, we've been approached."}, {"time": 6746, "text": "And I laugh in these people's faces."}, {"time": 6748, "text": "I'm like, are you kidding?"}, {"time": 6751, "text": "Because it's so demeaning."}, {"time": 6753, "text": "The M&A people are so demeaning to companies."}, {"time": 6756, "text": "They treat the startup world as their innovation ecosystem."}, {"time": 6761, "text": "And they think that I'm cool with going along with that, so I can have some of their scam fake Fed dollars."}, {"time": 6767, "text": "What am I going to do with more Fed coin?"}, {"time": 6770, "text": "Fed coin, man."}, {"time": 6772, "text": "So that's the cool thing about podcasting, actually, is people criticize."}, {"time": 6776, "text": "I don't know if you're familiar with Spotify giving Joe Rogan $100 million."}, {"time": 6783, "text": "And they respect, despite all the shit that people are talking about Spotify, people understand that podcasters like Joe Rogan know what the hell they're doing."}, {"time": 6797, "text": "So they give them money and say, just do what you do."}, {"time": 6801, "text": "And the equivalent for you would be like, George, do what the hell you do, because you're good at it."}, {"time": 6808, "text": "Try not to murder too many people."}, {"time": 6811, "text": "There's some kind of common sense things, like just don't go on a weird rampage of it."}, {"time": 6818, "text": "It comes down to what companies I could respect, right?"}, {"time": 6823, "text": "Could I respect GM?"}, {"time": 6826, "text": "No, I couldn't."}, {"time": 6827, "text": "I mean, could I respect a Hyundai?"}, {"time": 6830, "text": "More so."}, {"time": 6832, "text": "That's a lot closer."}, {"time": 6833, "text": "Toyota?"}, {"time": 6834, "text": "What's your?"}, {"time": 6837, "text": "Korean is the way."}, {"time": 6839, "text": "I think that the Japanese, the Germans, the US, they're all too, they're all too, they all think they're too great."}, {"time": 6845, "text": "What about the tech companies?"}, {"time": 6847, "text": "Apple?"}, {"time": 6848, "text": "Apple is, of the tech companies that I could respect, Apple's the closest."}, {"time": 6852, "text": "I mean, I could never."}, {"time": 6853, "text": "It would be ironic."}, {"time": 6854, "text": "It would be ironic if Comma AI is acquired by Apple."}, {"time": 6859, "text": "I mean, Facebook, look, I quit Facebook 10 years ago because I didn't respect the business model."}, {"time": 6864, "text": "Google has declined so fast in the last five years."}, {"time": 6868, "text": "What are your thoughts about Waymo and its present and its future?"}, {"time": 6873, "text": "Let me start by saying something nice, which is I've visited them a few times and have ridden in their cars."}, {"time": 6885, "text": "And the engineering that they're doing, both the research and the actual development and the engineering they're doing and the scale they're actually achieving by doing it all themselves is really impressive."}, {"time": 6898, "text": "And the balance of safety and innovation."}, {"time": 6901, "text": "And the cars work really well for the routes they drive."}, {"time": 6907, "text": "It drives fast, which was very surprising to me."}, {"time": 6910, "text": "It drives the speed limit or faster than the speed limit."}, {"time": 6914, "text": "It goes."}, {"time": 6916, "text": "And it works really damn well."}, {"time": 6917, "text": "And the interface is nice."}, {"time": 6919, "text": "In Chandler, Arizona, yeah."}, {"time": 6920, "text": "Yeah, in Chandler, Arizona, very specific environment."}, {"time": 6922, "text": "So it gives me enough material in my mind to push back against the madmen of the world, like George Hotz, to be like, because you kind of imply there's zero probability they're going to win."}, {"time": 6938, "text": "And after I've used, after I've ridden in it, to me, it's not zero."}, {"time": 6944, "text": "Oh, it's not for technology reasons."}, {"time": 6946, "text": "Bureaucracy?"}, {"time": 6948, "text": "No, it's worse than that."}, {"time": 6949, "text": "It's actually for product reasons, I think."}, {"time": 6951, "text": "Oh, you think they're just not capable of creating an amazing product?"}, {"time": 6955, "text": "No, I think that the product that they're building doesn't make sense."}, {"time": 6961, "text": "So a few things."}, {"time": 6963, "text": "You say the Waymo's are fast."}, {"time": 6965, "text": "Benchmark a Waymo against a competent Uber driver."}, {"time": 6970, "text": "The Uber driver's faster."}, {"time": 6971, "text": "It's not even about speed."}, {"time": 6972, "text": "It's the thing you said."}, {"time": 6973, "text": "It's about the experience of being stuck at a stop sign because pedestrians are crossing nonstop."}, {"time": 6980, "text": "I like when my Uber driver doesn't come to a full stop at the stop sign."}, {"time": 6984, "text": "And so let's say the Waymo's are 20% slower than an Uber."}, {"time": 6993, "text": "You can argue that they're going to be cheaper."}, {"time": 6995, "text": "And I argue that users already have the choice to trade off money for speed."}, {"time": 6999, "text": "It's called UberPool."}, {"time": 7002, "text": "I think it's like 15% of rides are UberPools."}, {"time": 7006, "text": "Users are not willing to trade off money for speed."}, {"time": 7009, "text": "So the whole product that they're building is not going to be competitive with traditional ride sharing networks."}, {"time": 7019, "text": "And also, whether there's profit to be made depends entirely on one company having a monopoly."}, {"time": 7027, "text": "I think that the level four autonomous ride sharing vehicles market is going to look a lot like the scooter market if even the technology does come to exist, which I question."}, {"time": 7038, "text": "Who's doing well in that market?"}, {"time": 7042, "text": "Well, it could be closer like an Uber and a Lyft, where it's just one or two players."}, {"time": 7048, "text": "Well, the scooter people have given up trying to market scooters as a practical means of transportation."}, {"time": 7055, "text": "And they're just like, they're super fun to ride."}, {"time": 7057, "text": "Look at wheels."}, {"time": 7058, "text": "I love those things."}, {"time": 7059, "text": "And they're great on that front."}, {"time": 7061, "text": "But from an actual transportation product perspective, I do not think scooters are viable."}, {"time": 7066, "text": "And I do not think level four autonomous cars are viable."}, {"time": 7069, "text": "If you, let's play a fun experiment."}, {"time": 7071, "text": "If you ran, let's do a Tesla and let's do Waymo."}, {"time": 7076, "text": "If Elon Musk took a vacation for a year, he just said, screw it, I'm going to go live on an island, no electronics."}, {"time": 7085, "text": "And the board decides that we need to find somebody to run the company."}, {"time": 7089, "text": "And they did decide that you should run the company for a year."}, {"time": 7092, "text": "How do you run Tesla differently?"}, {"time": 7094, "text": "I wouldn't change much."}, {"time": 7096, "text": "Do you think they're on the right track?"}, {"time": 7097, "text": "I wouldn't change."}, {"time": 7098, "text": "I mean, I'd have some minor changes."}, {"time": 7101, "text": "But even my debate with Tesla about end to end versus SegNets, that's just software."}, {"time": 7110, "text": "It's not like you're doing something terrible with SegNets."}, {"time": 7113, "text": "You're probably building something that's at least going to help you debug the end to end system a lot."}, {"time": 7119, "text": "It's very easy to transition from what they have to an end to end kind of thing."}, {"time": 7125, "text": "And then I presume you would, in the Model Y or maybe in the Model 3, start adding driver sensing with infrared."}, {"time": 7133, "text": "Yes, I would add infrared camera, infrared lights right away to those cars."}, {"time": 7142, "text": "And start collecting that data and do all that kind of stuff, yeah."}, {"time": 7146, "text": "I think they're already kind of doing it."}, {"time": 7147, "text": "It's an incredibly minor change."}, {"time": 7149, "text": "If I actually were CEO of Tesla, first off, I'd be horrified that I wouldn't be able to do a better job as Elon."}, {"time": 7154, "text": "And then I would try to understand the way he's done things before."}, {"time": 7157, "text": "You would also have to take over his Twitter."}, {"time": 7160, "text": "I don't tweet."}, {"time": 7162, "text": "Yeah, what's your Twitter situation?"}, {"time": 7164, "text": "Why are you so quiet on Twitter?"}, {"time": 7165, "text": "Since Dukama is like what's your social network presence like?"}, {"time": 7170, "text": "Because on Instagram, you do live streams."}, {"time": 7174, "text": "You understand the music of the internet, but you don't always fully engage into it."}, {"time": 7181, "text": "You're part time."}, {"time": 7182, "text": "Well, I used to have a Twitter."}, {"time": 7184, "text": "Yeah, I mean, Instagram is a pretty place."}, {"time": 7187, "text": "Instagram is a beautiful place."}, {"time": 7189, "text": "It glorifies beauty."}, {"time": 7189, "text": "I like Instagram's values as a network."}, {"time": 7193, "text": "Twitter glorifies conflict, glorifies shots, taking shots of people."}, {"time": 7201, "text": "And it's like, you know, Twitter and Donald Trump are perfectly, they're perfect for each other."}, {"time": 7208, "text": "So Tesla's on the right track in your view."}, {"time": 7212, "text": "OK, so let's try, let's really try this experiment."}, {"time": 7216, "text": "If you ran Waymo, let's say they're, I don't know if you agree, but they seem to be at the head of the pack of the kind of, what would you call that approach?"}, {"time": 7227, "text": "Like it's not necessarily lighter based because it's not about lighter."}, {"time": 7230, "text": "Level four robotaxi."}, {"time": 7231, "text": "Level four robotaxi, all in before making any revenue."}, {"time": 7237, "text": "So they're probably at the head of the pack."}, {"time": 7238, "text": "If you were said, hey, George, can you please run this company for a year, how would you change it?"}, {"time": 7247, "text": "I would go."}, {"time": 7247, "text": "I would get Anthony Levandowski out of jail, and I would put him in charge of the company."}, {"time": 7256, "text": "Well, let's try to break that apart."}, {"time": 7258, "text": "Why do you want to destroy the company by doing that?"}, {"time": 7261, "text": "Or do you mean you like renegade style thinking that pushes, that throws away bureaucracy and goes to first principle thinking?"}, {"time": 7274, "text": "I think Anthony Levandowski is a genius, and I think he would come up with a much better idea of what to do with Waymo than me."}, {"time": 7282, "text": "So you mean that unironically."}, {"time": 7283, "text": "He is a genius."}, {"time": 7286, "text": "Without a doubt."}, {"time": 7287, "text": "I mean, I'm not saying there's no shortcomings, but in the interactions I've had with him, yeah."}, {"time": 7295, "text": "He's also willing to take, like, who knows what he would do with Waymo?"}, {"time": 7299, "text": "I mean, he's also out there, like far more out there than I am."}, {"time": 7301, "text": "Yeah, there's big risks."}, {"time": 7303, "text": "What do you make of him?"}, {"time": 7304, "text": "I was going to talk to him on this podcast, and I was going back and forth."}, {"time": 7308, "text": "I'm such a gullible, naive human."}, {"time": 7311, "text": "Like, I see the best in people."}, {"time": 7313, "text": "And I slowly started to realize that there might be some people out there that, like, have multiple faces to the world."}, {"time": 7325, "text": "They're, like, deceiving and dishonest."}, {"time": 7328, "text": "I still refuse to, like, I just, I trust people, and I don't care if I get hurt by it."}, {"time": 7334, "text": "But, like, you know, sometimes you have to be a little bit careful, especially platform wise and podcast wise."}, {"time": 7341, "text": "What do you, what am I supposed to think?"}, {"time": 7343, "text": "So you think, you think he's a good person?"}, {"time": 7347, "text": "I don't really make moral judgments."}, {"time": 7350, "text": "It's difficult to."}, {"time": 7350, "text": "Oh, I mean this about the Waymo."}, {"time": 7352, "text": "I actually, I mean that whole idea very nonironically about what I would do."}, {"time": 7356, "text": "The problem with putting me in charge of Waymo is Waymo is already $10 billion in the hole, right?"}, {"time": 7361, "text": "Whatever idea Waymo does, look, commas profitable, commas raised $8.1 million."}, {"time": 7366, "text": "That's small, you know, that's small money."}, {"time": 7368, "text": "Like, I can build a reasonable consumer electronics company and succeed wildly at that and still never be able to pay back Waymo's $10 billion."}, {"time": 7375, "text": "So I think the basic idea with Waymo, well, forget the $10 billion because they have some backing, but your basic thing is, like, what can we do to start making some money?"}, {"time": 7385, "text": "Well, no, I mean, my bigger idea is, like, whatever the idea is that's gonna save Waymo, I don't have it."}, {"time": 7391, "text": "It's gonna have to be a big risk idea and I cannot think of a better person than Anthony Levandowski to do it."}, {"time": 7397, "text": "So that is completely what I would do as CEO of Waymo."}, {"time": 7400, "text": "I would call myself a transitionary CEO, do everything I can to fix that situation up."}, {"time": 7404, "text": "I'm gonna see."}, {"time": 7408, "text": "Because I can't do it, right?"}, {"time": 7409, "text": "Like, I can't, I mean, I can talk about how what I really wanna do is just apologize for all those corny, you know, ad campaigns and be like, here's the real state of the technology."}, {"time": 7420, "text": "Yeah, that's, like, I have several criticism."}, {"time": 7422, "text": "I'm a little bit more bullish on Waymo than you seem to be, but one criticism I have is it went into corny mode too early."}, {"time": 7430, "text": "Like, it's still a startup."}, {"time": 7432, "text": "It hasn't delivered on anything."}, {"time": 7433, "text": "So it should be, like, more renegade and show off the engineering that they're doing, which just can be impressive, as opposed to doing these weird commercials of, like, your friendly car company."}, {"time": 7447, "text": "I mean, that's my biggest snipe at Waymo is always, that guy's a paid actor."}, {"time": 7451, "text": "That guy's not a Waymo user."}, {"time": 7452, "text": "He's a paid actor."}, {"time": 7453, "text": "Look here, I found his call sheet."}, {"time": 7455, "text": "Do kind of like what SpaceX is doing with the rocket launches."}, {"time": 7458, "text": "Just put the nerds up front, put the engineers up front, and just, like, show failures too, just."}, {"time": 7465, "text": "I love SpaceX's, yeah."}, {"time": 7467, "text": "Yeah, the thing that they're doing is right, and it just feels like the right."}, {"time": 7472, "text": "We're all so excited to see them succeed."}, {"time": 7475, "text": "I can't wait to see when it won't fail, you know?"}, {"time": 7477, "text": "Like, you lie to me, I want you to fail."}, {"time": 7479, "text": "You tell me the truth, you be honest with me, I want you to succeed."}, {"time": 7484, "text": "Ah, yeah, and that requires the renegade CEO, right?"}, {"time": 7490, "text": "I'm with you, I'm with you."}, {"time": 7491, "text": "I still have a little bit of faith in Waymo for the renegade CEO to step forward, but."}, {"time": 7497, "text": "It's not, it's not John Kraftik."}, {"time": 7500, "text": "Yeah, it's, you can't."}, {"time": 7502, "text": "It's not Chris Hormiston."}, {"time": 7504, "text": "And those people may be very good at certain things."}, {"time": 7508, "text": "But they're not renegades."}, {"time": 7510, "text": "Yeah, because these companies are fundamentally, even though we're talking about billion dollars, all these crazy numbers, they're still, like, early stage startups."}, {"time": 7519, "text": "I mean, and I just, if you are pre revenue and you've raised 10 billion dollars, I have no idea, like, this just doesn't work."}, {"time": 7526, "text": "You know, it's against everything Silicon Valley."}, {"time": 7528, "text": "Where's your minimum viable product?"}, {"time": 7529, "text": "You know, where's your users?"}, {"time": 7531, "text": "Where's your growth numbers?"}, {"time": 7533, "text": "This is traditional Silicon Valley."}, {"time": 7536, "text": "Why do you not apply it to what you think you're too big to fail already, like?"}, {"time": 7541, "text": "How do you think autonomous driving will change society?"}, {"time": 7545, "text": "So the mission is, for comma, to solve self driving."}, {"time": 7552, "text": "Do you have, like, a vision of the world of how it'll be different?"}, {"time": 7557, "text": "Is it as simple as A to B transportation?"}, {"time": 7560, "text": "Or is there, like, cause these are robots."}, {"time": 7563, "text": "It's not about autonomous driving in and of itself."}, {"time": 7565, "text": "It's what the technology enables."}, {"time": 7569, "text": "It's, I think it's the coolest applied AI problem."}, {"time": 7572, "text": "I like it because it has a clear path to monetary value."}, {"time": 7577, "text": "But as far as that being the thing that changes the world, I mean, no, like, there's cute things we're doing in common."}, {"time": 7585, "text": "Like, who'd have thought you could stick a phone on the windshield and it'll drive."}, {"time": 7589, "text": "But like, really, the product that you're building is not something that people were not capable of imagining 50 years ago."}, {"time": 7595, "text": "So no, it doesn't change the world on that front."}, {"time": 7597, "text": "Could people have imagined the internet 50 years ago?"}, {"time": 7599, "text": "Only true genius visionaries."}, {"time": 7602, "text": "Everyone could have imagined autonomous cars 50 years ago."}, {"time": 7605, "text": "It's like a car, but I don't drive it."}, {"time": 7607, "text": "See, I have this sense, and I told you, like, my longterm dream is robots with which you have deep, with whom you have deep connections, right?"}, {"time": 7619, "text": "And there's different trajectories towards that."}, {"time": 7623, "text": "And I've been thinking, so I've been thinking of launching a startup."}, {"time": 7627, "text": "I see autonomous vehicles as a potential trajectory to that."}, {"time": 7631, "text": "That's not where the direction I would like to go, but I also see Tesla or even Comma AI, like, pivoting into robotics broadly defined at some stage in the way, like you're mentioning, the internet didn't expect."}, {"time": 7649, "text": "Let's solve, you know, when I say a comma about this, we could talk about this, but let's solve self driving cars first."}, {"time": 7655, "text": "You gotta stay focused on the mission."}, {"time": 7657, "text": "Don't, don't, don't, you're not too big to fail."}, {"time": 7659, "text": "For however much I think Comma's winning, like, no, no, no, no, no, you're winning when you solve level five self driving cars."}, {"time": 7665, "text": "And until then, you haven't won."}, {"time": 7666, "text": "And you know, again, you wanna be arrogant in the face of other people, great."}, {"time": 7670, "text": "You wanna be arrogant in the face of nature, you're an idiot."}, {"time": 7673, "text": "Stay mission focused, brilliantly put."}, {"time": 7676, "text": "Like I mentioned, thinking of launching a startup, I've been considering, actually, before COVID, I've been thinking of moving to San Francisco."}, {"time": 7683, "text": "Ooh, ooh, I wouldn't go there."}, {"time": 7686, "text": "So why is, well, and now I'm thinking about potentially Austin and we're in San Diego now."}, {"time": 7693, "text": "San Diego, come here."}, {"time": 7694, "text": "So why, what, I mean, you're such an interesting human."}, {"time": 7700, "text": "You've launched so many successful things."}, {"time": 7703, "text": "What, why San Diego?"}, {"time": 7706, "text": "What do you recommend?"}, {"time": 7707, "text": "Why not San Francisco?"}, {"time": 7709, "text": "Have you thought, so in your case, San Diego with Qualcomm and Snapdragon, I mean, that's an amazing combination."}, {"time": 7717, "text": "That wasn't really why."}, {"time": 7718, "text": "That wasn't the why?"}, {"time": 7719, "text": "No, I mean, Qualcomm was an afterthought."}, {"time": 7721, "text": "Qualcomm was, it was a nice thing to think about."}, {"time": 7722, "text": "It's like, you can have a tech company here."}, {"time": 7725, "text": "And a good one, I mean, you know, I like Qualcomm, but."}, {"time": 7729, "text": "Well, so why San Diego better than San Francisco?"}, {"time": 7730, "text": "Why does San Francisco suck?"}, {"time": 7731, "text": "Well, so, okay, so first off, we all kind of said like, we wanna stay in California."}, {"time": 7735, "text": "People like the ocean."}, {"time": 7737, "text": "You know, California, for its flaws, it's like a lot of the flaws of California are not necessarily California as a whole, and they're much more San Francisco specific."}, {"time": 7746, "text": "San Francisco, so I think first tier cities in general have stopped wanting growth."}, {"time": 7753, "text": "Well, you have like in San Francisco, you know, the voting class always votes to not build more houses because they own all the houses."}, {"time": 7759, "text": "And they're like, well, you know, once people have figured out how to vote themselves more money, they're gonna do it."}, {"time": 7765, "text": "It is so insanely corrupt."}, {"time": 7767, "text": "It is not balanced at all, like political party wise, you know, it's a one party city and."}, {"time": 7774, "text": "For all the discussion of diversity, it stops lacking real diversity of thought, of background, of approaches, of strategies, of ideas."}, {"time": 7788, "text": "It's kind of a strange place that it's the loudest people about diversity and the biggest lack of diversity."}, {"time": 7796, "text": "I mean, that's what they say, right?"}, {"time": 7798, "text": "It's the projection."}, {"time": 7800, "text": "Projection, yeah."}, {"time": 7802, "text": "And even people in Silicon Valley tell me that's like high up people, everybody is like, this is a terrible place."}, {"time": 7810, "text": "I mean, and coronavirus is really what killed it."}, {"time": 7813, "text": "San Francisco was the number one exodus during coronavirus."}, {"time": 7818, "text": "We still think San Diego is a good place to be."}, {"time": 7823, "text": "Yeah, I mean, we'll see."}, {"time": 7824, "text": "We'll see what happens with California a bit longer term."}, {"time": 7829, "text": "Like Austin's an interesting choice."}, {"time": 7832, "text": "I wouldn't, I don't have really anything bad to say about Austin either, except for the extreme heat in the summer, which, but that's like very on the surface, right?"}, {"time": 7840, "text": "I think as far as like an ecosystem goes, it's cool."}, {"time": 7843, "text": "I personally love Colorado."}, {"time": 7845, "text": "Colorado's great."}, {"time": 7847, "text": "Yeah, I mean, you have these states that are, like just way better run."}, {"time": 7851, "text": "California is, you know, it's especially San Francisco."}, {"time": 7855, "text": "It's not a tie horse and like, yeah."}, {"time": 7858, "text": "Can I ask you for advice to me and to others about what's it take to build a successful startup?"}, {"time": 7868, "text": "I haven't done that."}, {"time": 7869, "text": "Talk to someone who did that."}, {"time": 7870, "text": "Well, you've, you know, this is like another book of years that I'll buy for $67, I suppose."}, {"time": 7878, "text": "So there's, um."}, {"time": 7880, "text": "One of these days I'll sell out."}, {"time": 7884, "text": "Jailbreaks are going to be a dollar and books are going to be 67."}, {"time": 7887, "text": "How I jailbroke the iPhone by George Hots."}, {"time": 7892, "text": "How I jail broke the iPhone and you can too."}, {"time": 7895, "text": "You can too."}, {"time": 7896, "text": "67 dollars."}, {"time": 7897, "text": "In 21 days."}, {"time": 7901, "text": "Okay, I can't wait."}, {"time": 7902, "text": "But quite, so you have an introspective, you have built a very unique company."}, {"time": 7909, "text": "I mean, not you, but you and others."}, {"time": 7915, "text": "There's no, there's nothing."}, {"time": 7916, "text": "You have an introspective, you haven't really sat down and thought about like, well, like if you and I were having a bunch of, we're having some beers and you're seeing that I'm depressed and whatever, I'm struggling."}, {"time": 7929, "text": "There's no advice you can give?"}, {"time": 7931, "text": "Oh, I mean."}, {"time": 7935, "text": "Um, yeah, I think it's all very like situation dependent."}, {"time": 7943, "text": "Here's, okay, if I can give a generic piece of advice, it's the technology always wins."}, {"time": 7948, "text": "The better technology always wins."}, {"time": 7950, "text": "And lying always loses."}, {"time": 7955, "text": "Build technology and don't lie."}, {"time": 7959, "text": "I agree very much."}, {"time": 7960, "text": "The long run, long run."}, {"time": 7962, "text": "That's the long run, yeah."}, {"time": 7963, "text": "The market can remain irrational longer than you can remain solvent."}, {"time": 7967, "text": "Well, this is an interesting point because I ethically and just as a human believe that like hype and smoke and mirrors is not at any stage of the company is a good strategy."}, {"time": 7982, "text": "I mean, there's some like, you know, PR magic kind of like, you know."}, {"time": 7987, "text": "Oh, hype around a new product, right?"}, {"time": 7988, "text": "If there's a call to action, if there's like a call to action, like buy my new GPU, look at it."}, {"time": 7993, "text": "It takes up three slots and it's this big."}, {"time": 7995, "text": "Buy my GPU."}, {"time": 7997, "text": "If you look at, you know, especially in the AI space broadly, but autonomous vehicles, like you can raise a huge amount of money on nothing."}, {"time": 8006, "text": "And the question to me is like, I'm against that."}, {"time": 8010, "text": "I'll never be part of that."}, {"time": 8011, "text": "I don't think, I hope not, willingly not."}, {"time": 8016, "text": "But like, is there something to be said to essentially lying to raise money, like fake it till you make it kind of thing?"}, {"time": 8027, "text": "I mean, this is Billy McFarland in the Fyre Festival."}, {"time": 8030, "text": "Like we all experienced, you know, what happens with that."}, {"time": 8034, "text": "No, no, don't fake it till you make it."}, {"time": 8037, "text": "Be honest and hope you make it the whole way."}, {"time": 8040, "text": "The technology wins."}, {"time": 8041, "text": "Right, the technology wins."}, {"time": 8042, "text": "And like, there is, I'm not used to like the anti hype, you know, that's a Slava KPSS reference, but hype isn't necessarily bad."}, {"time": 8053, "text": "I loved camping out for the iPhones, you know, and as long as the hype is backed by like substance, as long as it's backed by something I can actually buy, and like it's real, then hype is great and it's a great feeling."}, {"time": 8068, "text": "It's when the hype is backed by lies that it's a bad feeling."}, {"time": 8072, "text": "I mean, a lot of people call Elon Musk a fraud."}, {"time": 8074, "text": "How could he be a fraud?"}, {"time": 8075, "text": "I've noticed this, this kind of interesting effect, which is he does tend to over promise and deliver, what's the better way to phrase it?"}, {"time": 8085, "text": "Promise a timeline that he doesn't deliver on, he delivers much later on."}, {"time": 8092, "text": "Cause I do that, I think that's a programmer thing too."}, {"time": 8096, "text": "I do that as well."}, {"time": 8097, "text": "You think that's a really bad thing to do or is that okay?"}, {"time": 8101, "text": "I think that's, again, as long as like, you're working toward it and you're gonna deliver on it, it's not too far off, right?"}, {"time": 8111, "text": "Like, you know, the whole autonomous vehicle thing, it's like, I mean, I still think Tesla's on track to beat us."}, {"time": 8119, "text": "I still think even with their missteps, they have advantages we don't have."}, {"time": 8125, "text": "You know, Elon is better than me at like marshaling massive amounts of resources."}, {"time": 8133, "text": "So, you know, I still think given the fact they're maybe making some wrong decisions, they'll end up winning."}, {"time": 8139, "text": "And like, it's fine to hype it if you're actually gonna win, right?"}, {"time": 8144, "text": "Like if Elon says, look, we're gonna be landing rockets back on earth in a year and it takes four, like, you know, he landed a rocket back on earth and he was working toward it the whole time."}, {"time": 8155, "text": "I think there's some amount of like, I think when it becomes wrong is if you know you're not gonna meet that deadline."}, {"time": 8160, "text": "If you're lying."}, {"time": 8163, "text": "Like this is what people don't understand, I think."}, {"time": 8166, "text": "Like Elon believes everything he says."}, {"time": 8169, "text": "He does, as far as I can tell, he does."}, {"time": 8172, "text": "And I detected that in myself too."}, {"time": 8174, "text": "Like if I, it's only bullshit if you're like conscious of yourself lying."}, {"time": 8183, "text": "Now you can't take that to such an extreme, right?"}, {"time": 8185, "text": "Like in a way, I think maybe Billy McFarland believed everything he said too."}, {"time": 8190, "text": "Right, that's how you start a cult and everybody kills themselves."}, {"time": 8194, "text": "Yeah, like it's, you need, you need, if there's like some factor on it, it's fine."}, {"time": 8199, "text": "And you need some people to like, you know, keep you in check, but like, if you deliver on most of the things you say and just the timelines are off, yeah."}, {"time": 8208, "text": "It does piss people off though."}, {"time": 8210, "text": "I wonder, but who cares?"}, {"time": 8213, "text": "In a long arc of history, the people, everybody gets pissed off at the people who succeed, which is one of the things that frustrates me about this world, is they don't celebrate the success of others."}, {"time": 8227, "text": "Like there's so many people that want Elon to fail."}, {"time": 8232, "text": "It's so fascinating to me."}, {"time": 8234, "text": "Like what is wrong with you?"}, {"time": 8238, "text": "Like, so Elon Musk talks about like people shorting, like they talk about financial, but I think it's much bigger than the financials."}, {"time": 8245, "text": "I've seen like the human factors community, they want, they want other people to fail."}, {"time": 8251, "text": "Why, why, why?"}, {"time": 8252, "text": "Like even people, the harshest thing is like, you know, even people that like seem to really hate Donald Trump, they want him to fail or like the other president or they want Barack Obama to fail."}, {"time": 8267, "text": "Yeah, we're all on the same boat, man."}, {"time": 8269, "text": "It's weird, but I want that, I would love to inspire that part of the world to change because damn it, if the human species is gonna survive, we should celebrate success."}, {"time": 8280, "text": "Like it seems like the efficient thing to do in this objective function that we're all striving for is to celebrate the ones that like figure out how to like do better at that objective function as opposed to like dragging them down back into the mud."}, {"time": 8296, "text": "I think there is, this is the speech I always give about the commenters on Hacker News."}, {"time": 8301, "text": "So first off, something to remember about the internet in general is commenters are not representative of the population."}, {"time": 8309, "text": "I don't comment on anything."}, {"time": 8311, "text": "You know, commenters are representative of a certain sliver of the population."}, {"time": 8316, "text": "And on Hacker News, a common thing I'll see is when you'll see something that's like, you know, promises to be wild out there and innovative."}, {"time": 8327, "text": "There is some amount of, you know, checking them back to earth, but there's also some amount of if this thing succeeds, well, I'm 36 and I've worked at large tech companies my whole life."}, {"time": 8342, "text": "They can't succeed because if they succeed, that would mean that I could have done something different with my life, but we know that I couldn't have, we know that I couldn't have, and that's why they're gonna fail."}, {"time": 8351, "text": "And they have to root for them to fail to kind of maintain their world image."}, {"time": 8355, "text": "So tune it out."}, {"time": 8357, "text": "And they comment, well, it's hard, I, so one of the things, one of the things I'm considering startup wise is to change that."}, {"time": 8367, "text": "Cause I think the, I think it's also a technology problem."}, {"time": 8371, "text": "It's a platform problem."}, {"time": 8373, "text": "It's like, because the thing you said, most people don't comment."}, {"time": 8379, "text": "I think most people want to comment."}, {"time": 8382, "text": "They just don't because it's all the assholes who are commenting."}, {"time": 8386, "text": "Exactly, I don't want to be grouped in with them."}, {"time": 8387, "text": "You don't want to be at a party where everyone is an asshole."}, {"time": 8390, "text": "And so they, but that's a platform problem."}, {"time": 8394, "text": "I can't believe what Reddit's become."}, {"time": 8396, "text": "I can't believe the group thinking, Reddit comments."}, {"time": 8400, "text": "There's a, Reddit is an interesting one because they're subreddits."}, {"time": 8405, "text": "And so you can still see, especially small subreddits that like, that are a little like havens of like joy and positivity and like deep, even disagreement, but like nuanced discussion."}, {"time": 8418, "text": "But it's only like small little pockets, but that's emergent."}, {"time": 8423, "text": "The platform is not helping that or hurting that."}, {"time": 8426, "text": "So I guess naturally something about the internet, if you don't put in a lot of effort to encourage nuance and positive, good vibes, it's naturally going to decline into chaos."}, {"time": 8441, "text": "I would love to see someone do this well."}, {"time": 8443, "text": "I think it's, yeah, very doable."}, {"time": 8445, "text": "I think actually, so I feel like Twitter could be overthrown."}, {"time": 8452, "text": "Yashua Bach talked about how like, if you have like and retweet, like that's only positive wiring, right?"}, {"time": 8462, "text": "The only way to do anything like negative there is with a comment."}, {"time": 8468, "text": "And that's like that asymmetry is what gives, you know, Twitter its particular toxicness."}, {"time": 8475, "text": "Whereas I find YouTube comments to be much better because YouTube comments have an up and a down and they don't show the downvotes."}, {"time": 8483, "text": "Without getting into depth of this particular discussion, the point is to explore possibilities and get a lot of data on it."}, {"time": 8490, "text": "Because I mean, I could disagree with what you just said."}, {"time": 8494, "text": "The point is it's unclear."}, {"time": 8496, "text": "It hasn't been explored in a really rich way."}, {"time": 8499, "text": "Like these questions of how to create platforms that encourage positivity."}, {"time": 8507, "text": "Yeah, I think it's a technology problem."}, {"time": 8509, "text": "And I think we'll look back at Twitter as it is now."}, {"time": 8511, "text": "Maybe it'll happen within Twitter, but most likely somebody overthrows them is we'll look back at Twitter and say, can't believe we put up with this level of toxicity."}, {"time": 8523, "text": "You need a different business model too."}, {"time": 8525, "text": "Any social network that fundamentally has advertising as a business model, this was in The Social Dilemma, which I didn't watch, but I liked it."}, {"time": 8531, "text": "It's like, you know, there's always the, you know, you're the product, you're not the, but they had a nuanced take on it that I really liked."}, {"time": 8537, "text": "And it said, the product being sold is influence over you."}, {"time": 8544, "text": "The product being sold is literally your, you know, influence on you."}, {"time": 8549, "text": "Like that can't be, if that's your idea, okay."}, {"time": 8553, "text": "Well, you know, guess what?"}, {"time": 8555, "text": "It can't not be toxic."}, {"time": 8557, "text": "Yeah, maybe there's ways to spin it, like with giving a lot more control to the user and transparency to see what is happening to them as opposed to in the shadows, it's possible, but that can't be the primary source of."}, {"time": 8569, "text": "But the users aren't, no one's gonna use that."}, {"time": 8571, "text": "It depends, it depends, it depends."}, {"time": 8574, "text": "I think that the, you're not going to, you can't depend on self awareness of the users."}, {"time": 8580, "text": "It's a longer discussion because you can't depend on it, but you can reward self awareness."}, {"time": 8589, "text": "Like if for the ones who are willing to put in the work of self awareness, you can reward them and incentivize and perhaps be pleasantly surprised how many people are willing to be self aware on the internet."}, {"time": 8603, "text": "Like we are in real life."}, {"time": 8604, "text": "Like I'm putting in a lot of effort with you right now, being self aware about if I say something stupid or mean, I'll like look at your like body language."}, {"time": 8612, "text": "Like I'm putting in that effort."}, {"time": 8613, "text": "It's costly for an introvert, very costly."}, {"time": 8616, "text": "But on the internet, fuck it."}, {"time": 8619, "text": "Like most people are like, I don't care if this hurts somebody, I don't care if this is not interesting or if this is, yeah, it's a mean or whatever."}, {"time": 8628, "text": "I think so much of the engagement today on the internet is so disingenuine too."}, {"time": 8633, "text": "You're not doing this out of a genuine, this is what you think."}, {"time": 8635, "text": "You're doing this just straight up to manipulate others."}, {"time": 8637, "text": "Whether you're in, you just became an ad."}, {"time": 8639, "text": "Yeah, okay, let's talk about a fun topic, which is programming."}, {"time": 8644, "text": "Here's another book idea for you."}, {"time": 8645, "text": "Let me pitch."}, {"time": 8647, "text": "What's your perfect programming setup?"}, {"time": 8649, "text": "So like this by George Hots."}, {"time": 8652, "text": "So like what, listen, you're."}, {"time": 8657, "text": "Give me a MacBook Air, sit me in a corner of a hotel room and you know I'll still ask you."}, {"time": 8661, "text": "So you really don't care."}, {"time": 8662, "text": "You don't fetishize like multiple monitors, keyboard."}, {"time": 8667, "text": "Those things are nice and I'm not gonna say no to them, but did they automatically unlock tons of productivity?"}, {"time": 8674, "text": "I have definitely been more productive on a MacBook Air in a corner of a hotel room."}, {"time": 8678, "text": "What about IDE?"}, {"time": 8681, "text": "So which operating system do you love?"}, {"time": 8685, "text": "What text editor do you use IDE?"}, {"time": 8689, "text": "What, is there something that is like the perfect, if you could just say the perfect productivity setup for George Hots."}, {"time": 8698, "text": "It literally doesn't matter."}, {"time": 8700, "text": "You know, I guess I code most of the time in Vim."}, {"time": 8703, "text": "Like literally I'm using an editor from the 70s."}, {"time": 8705, "text": "You know, you didn't make anything better."}, {"time": 8707, "text": "Okay, VS code is nice for reading code."}, {"time": 8709, "text": "There's a few things that are nice about it."}, {"time": 8710, "text": "I think that you can build much better tools."}, {"time": 8713, "text": "How like IDA's xrefs work way better than VS codes, why?"}, {"time": 8718, "text": "Yeah, actually that's a good question, like why?"}, {"time": 8720, "text": "I still use, sorry, Emacs for most."}, {"time": 8725, "text": "I've actually never, I have to confess something dark."}, {"time": 8728, "text": "So I've never used Vim."}, {"time": 8732, "text": "I think maybe I'm just afraid that my life has been like a waste."}, {"time": 8739, "text": "I'm so, I'm not evangelical about Emacs."}, {"time": 8743, "text": "I think this."}, {"time": 8744, "text": "This is how I feel about TensorFlow versus PyTorch."}, {"time": 8747, "text": "Having just like, we've switched everything to PyTorch now."}, {"time": 8750, "text": "Put months into the switch."}, {"time": 8751, "text": "I have felt like I've wasted years on TensorFlow."}, {"time": 8756, "text": "I can't believe how much better PyTorch is."}, {"time": 8759, "text": "I've used Emacs and Vim, doesn't matter."}, {"time": 8761, "text": "Yeah, it's still just my heart."}, {"time": 8763, "text": "Somehow I fell in love with Lisp."}, {"time": 8765, "text": "You can't, the heart wants what the heart wants."}, {"time": 8768, "text": "I don't understand it, but it just connected with me."}, {"time": 8770, "text": "Maybe it's the functional language that first I connected with."}, {"time": 8773, "text": "Maybe it's because so many of the AI courses before the deep learning revolution were taught with Lisp in mind."}, {"time": 8780, "text": "I don't know what it is, but I'm stuck with it."}, {"time": 8782, "text": "But at the same time, like, why am I not using a modern ID for some of these programming?"}, {"time": 8787, "text": "They're not that much better."}, {"time": 8788, "text": "I've used modern IDs too."}, {"time": 8790, "text": "But at the same time, so to just, well, not to disagree with you, but like, I like multiple monitors."}, {"time": 8795, "text": "Like I have to do work on a laptop and it's a pain in the ass."}, {"time": 8801, "text": "And also I'm addicted to the Kinesis weird keyboard."}, {"time": 8805, "text": "You could see there."}, {"time": 8808, "text": "Yeah, so you don't have any of that."}, {"time": 8810, "text": "You can just be on a MacBook."}, {"time": 8811, "text": "I mean, look at work."}, {"time": 8813, "text": "I have three 24 inch monitors."}, {"time": 8815, "text": "I have a happy hacking keyboard."}, {"time": 8816, "text": "I have a Razer Death Hatter mouse, like."}, {"time": 8819, "text": "But it's not essential for you."}, {"time": 8822, "text": "Let's go to a day in the life of George Hots."}, {"time": 8824, "text": "What is the perfect day productivity wise?"}, {"time": 8828, "text": "So we're not talking about like Hunter S. Thompson drugs."}, {"time": 8833, "text": "And let's look at productivity."}, {"time": 8836, "text": "Like what's the day look like, like hour by hour?"}, {"time": 8839, "text": "Is there any regularities that create a magical George Hots experience?"}, {"time": 8845, "text": "I can remember three days in my life."}, {"time": 8848, "text": "And I remember these days vividly when I've gone through kind of radical transformations to the way I think."}, {"time": 8857, "text": "And what I would give, I would pay $100,000 if I could have one of these days tomorrow."}, {"time": 8862, "text": "The days have been so impactful."}, {"time": 8864, "text": "And one was first discovering Eliezer Yudkowsky on the singularity and reading that stuff."}, {"time": 8870, "text": "And like, you know, my mind was blown."}, {"time": 8874, "text": "The next was discovering the Hutter Prize and that AI is just compression."}, {"time": 8879, "text": "Like finally understanding AIXI and what all of that was."}, {"time": 8883, "text": "You know, I like read about it when I was 18, 19, I didn't understand it."}, {"time": 8886, "text": "And then the fact that like lossless compression implies intelligence, the day that I was shown that."}, {"time": 8892, "text": "And then the third one is controversial."}, {"time": 8894, "text": "The day I found a blog called Unqualified Reservations."}, {"time": 8897, "text": "And read that and I was like."}, {"time": 8900, "text": "Wait, which one is that?"}, {"time": 8901, "text": "That's, what's the guy's name?"}, {"time": 8902, "text": "Curtis Yarvin."}, {"time": 8905, "text": "So many people tell me I'm supposed to talk to him."}, {"time": 8907, "text": "Yeah, the day."}, {"time": 8908, "text": "He looks, he sounds insane."}, {"time": 8910, "text": "Or brilliant, but insane or both, I don't know."}, {"time": 8913, "text": "The day I found that blog was another like, this was during like Gamergate and kind of the run up to the 2016 election."}, {"time": 8919, "text": "And I'm like, wow, okay, the world makes sense now."}, {"time": 8922, "text": "This is like, I had a framework now to interpret this."}, {"time": 8925, "text": "Just like I got the framework for AI and a framework to interpret technological progress."}, {"time": 8929, "text": "Like those days when I discovered these new frameworks were."}, {"time": 8933, "text": "So it's not about, but what was special about those days?"}, {"time": 8937, "text": "How did those days come to be?"}, {"time": 8938, "text": "Is it just, you got lucky?"}, {"time": 8939, "text": "Like, you just encountered a hotter prize on Hacker News or something like that?"}, {"time": 8949, "text": "But you see, I don't think it's just, see, I don't think it's just that like, I could have gotten lucky at any point."}, {"time": 8954, "text": "I think that in a way."}, {"time": 8956, "text": "You were ready at that moment."}, {"time": 8958, "text": "To receive the information."}, {"time": 8961, "text": "But is there some magic to the day today of like eating breakfast?"}, {"time": 8967, "text": "And it's the mundane things."}, {"time": 8970, "text": "Nah, I drift through life."}, {"time": 8972, "text": "Without structure."}, {"time": 8974, "text": "I drift through life hoping and praying that I will get another day like those days."}, {"time": 8978, "text": "And there's nothing in particular you do to be a receptacle for another, for day number four."}, {"time": 8986, "text": "No, I didn't do anything to get the other ones."}, {"time": 8988, "text": "So I don't think I have to really do anything now."}, {"time": 8991, "text": "I took a month long trip to New York and the Ethereum thing was the highlight of it, but the rest of it was pretty terrible."}, {"time": 8997, "text": "I did a two week road trip and I got, I had to turn around."}, {"time": 9001, "text": "I had to turn around driving in Gunnison, Colorado."}, {"time": 9006, "text": "I passed through Gunnison and the snow starts coming down."}, {"time": 9010, "text": "There's a pass up there called Monarch Pass in order to get through to Denver, you gotta get over the Rockies."}, {"time": 9014, "text": "And I had to turn my car around."}, {"time": 9016, "text": "I couldn't, I watched a F150 go off the road."}, {"time": 9020, "text": "I'm like, I gotta go back."}, {"time": 9021, "text": "And like that day was meaningful."}, {"time": 9024, "text": "Cause like, it was real."}, {"time": 9026, "text": "Like I actually had to turn my car around."}, {"time": 9028, "text": "It's rare that anything even real happens in my life."}, {"time": 9031, "text": "Even as, you know, mundane as the fact that, yeah, there was snow, I had to turn around, stay in Gunnison and leave the next day."}, {"time": 9037, "text": "Something about that moment felt real."}, {"time": 9040, "text": "Okay, so actually it's interesting to break apart the three moments you mentioned, if it's okay."}, {"time": 9045, "text": "So I always have trouble pronouncing his name, but Alousa Yurkowski."}, {"time": 9053, "text": "So what, how did your worldview change in starting to consider the exponential growth of AI and AGI that he thinks about and the threats of artificial intelligence and all that kind of ideas?"}, {"time": 9069, "text": "Can you, is it just like, can you maybe break apart like what exactly was so magical to you?"}, {"time": 9075, "text": "Is it transformational experience?"}, {"time": 9077, "text": "Today, everyone knows him for threats and AI safety."}, {"time": 9080, "text": "This was pre that stuff."}, {"time": 9082, "text": "There was, I don't think a mention of AI safety on the page."}, {"time": 9085, "text": "This is, this is old Yurkowski stuff."}, {"time": 9087, "text": "He'd probably denounce it all now."}, {"time": 9089, "text": "He'd probably be like, that's exactly what I didn't want to happen."}, {"time": 9092, "text": "Sorry, man."}, {"time": 9093, "text": "Is there something specific you can take from his work that you can remember?"}, {"time": 9098, "text": "Yeah, it was this realization that computers double in power every 18 months and humans do not, and they haven't crossed yet."}, {"time": 9110, "text": "But if you have one thing that's doubling every 18 months and one thing that's staying like this, you know, here's your log graph, here's your line, you know, calculate that."}, {"time": 9119, "text": "And then the data opened the door to the exponential thinking, like thinking that like, you know what, with technology, we can actually transform the world."}, {"time": 9131, "text": "It opened the door to human obsolescence."}, {"time": 9133, "text": "It opened the door to realize that in my lifetime, humans are going to be replaced."}, {"time": 9140, "text": "And then the matching idea to that of artificial intelligence with the Hutter prize, you know, I'm torn."}, {"time": 9147, "text": "I go back and forth on what I think about it."}, {"time": 9151, "text": "But the basic thesis is it's a nice compelling notion that we can reduce the task of creating an intelligent system, a generally intelligent system into the task of compression."}, {"time": 9163, "text": "So you can think of all of intelligence in the universe, in fact, as a kind of compression."}, {"time": 9170, "text": "Do you find that, was that just at the time you found that as a compelling idea or do you still find that a compelling idea?"}, {"time": 9176, "text": "I still find that a compelling idea."}, {"time": 9179, "text": "I think that it's not that useful day to day, but actually one of maybe my quests before that was a search for the definition of the word intelligence."}, {"time": 9189, "text": "And I never had one."}, {"time": 9190, "text": "And I definitely have a definition of the word compression."}, {"time": 9194, "text": "It's a very simple, straightforward one."}, {"time": 9198, "text": "And you know what compression is, you know what lossless, it's lossless compression, not lossy, lossless compression."}, {"time": 9202, "text": "And that that is equivalent to intelligence, which I believe, I'm not sure how useful that definition is day to day, but like I now have a framework to understand what it is."}, {"time": 9212, "text": "And he just 10X the prize for that competition like recently a few months ago."}, {"time": 9217, "text": "You ever thought of taking a crack at that?"}, {"time": 9219, "text": "Oh, I did."}, {"time": 9221, "text": "I spent the next, after I found the prize, I spent the next six months of my life trying it."}, {"time": 9227, "text": "And well, that's when I started learning everything about AI."}, {"time": 9231, "text": "And then I worked at Vicarious for a bit and then I read all the deep learning stuff."}, {"time": 9235, "text": "And I'm like, okay, now I like I'm caught up to modern AI."}, {"time": 9239, "text": "And I had a really good framework to put it all in from the compression stuff, right?"}, {"time": 9244, "text": "Like some of the first deep learning models I played with were GPT basically, but before transformers, before it was still RNNs to do character prediction."}, {"time": 9257, "text": "But by the way, on the compression side, I mean, especially with neural networks, what do you make of the lossless requirement with the Hutter prize?"}, {"time": 9266, "text": "So, you know, human intelligence and neural networks can probably compress stuff pretty well, but it would be lossy."}, {"time": 9276, "text": "You can turn a lossy compression to a lossless compressor pretty easily using an arithmetic encoder, right?"}, {"time": 9281, "text": "You can take an arithmetic encoder and you can just encode the noise with maximum efficiency."}, {"time": 9286, "text": "So even if you can't predict exactly what the next character is, the better a probability distribution, you can put over the next character."}, {"time": 9294, "text": "You can then use an arithmetic encoder to, right?"}, {"time": 9297, "text": "You don't have to know whether it's an E or an I, you just have to put good probabilities on them and then, you know, code those."}, {"time": 9303, "text": "And if you have, it's a bits of entropy thing, right?"}, {"time": 9306, "text": "So let me, on that topic, it'd be interesting as a little side tour."}, {"time": 9310, "text": "What are your thoughts in this year about GPT3 and these language models and these transformers?"}, {"time": 9316, "text": "Is there something interesting to you as an AI researcher, or is there something interesting to you as an autonomous vehicle developer?"}, {"time": 9324, "text": "Nah, I think it's overhyped."}, {"time": 9327, "text": "I mean, it's not, like, it's cool."}, {"time": 9329, "text": "It's cool for what it is, but no, we're not just gonna be able to scale up to GPT12 and get general purpose intelligence."}, {"time": 9335, "text": "Like, your loss function is literally just, you know, cross entropy loss on the character, right?"}, {"time": 9341, "text": "Like, that's not the loss function of general intelligence."}, {"time": 9347, "text": "Can you imagine that, like, to play devil's advocate on yourself, is it possible that you can, the GPT12 will achieve general intelligence with something as dumb as this kind of loss function?"}, {"time": 9361, "text": "I guess it depends what you mean by general intelligence."}, {"time": 9365, "text": "So there's another problem with the GPTs, and that's that they don't have a, they don't have longterm memory."}, {"time": 9373, "text": "So, like, just GPT12, a scaled up version of GPT2 or GPT3, I find it hard to believe."}, {"time": 9386, "text": "Well, you can scale it in, so it's a hard coded length, but you can make it wider and wider and wider."}, {"time": 9396, "text": "You're gonna get cool things from those systems, but I don't think you're ever gonna get something that can, like, you know, build me a rocket ship."}, {"time": 9407, "text": "What about solved driving?"}, {"time": 9409, "text": "So, you know, you can use Transformer with video, for example."}, {"time": 9414, "text": "You think, is there something in there?"}, {"time": 9417, "text": "No, because, I mean, look, we use a GRU."}, {"time": 9421, "text": "We use a GRU."}, {"time": 9422, "text": "We could change that GRU out to a Transformer."}, {"time": 9425, "text": "I think driving is much more Markovian than language."}, {"time": 9429, "text": "So, Markovian, you mean, like, the memory, which aspect of Markovian?"}, {"time": 9433, "text": "I mean that, like, most of the information in the state at T minus one is also in state T. I see, yeah."}, {"time": 9440, "text": "Right, and it kind of, like, drops off nicely like this, whereas sometime with language, you have to refer back to the third paragraph on the second page."}, {"time": 9447, "text": "I feel like."}, {"time": 9448, "text": "There's not many, like, you can say, like, speed limit signs, but there's really not many things in autonomous driving that look like that."}, {"time": 9453, "text": "But if you look at, to play devil's advocate, is the risk estimation thing that you've talked about is kind of interesting."}, {"time": 9461, "text": "Is, it feels like there might be some longer term aggregation of context necessary to be able to figure out, like, the context."}, {"time": 9471, "text": "Yeah, I'm not even sure I'm believing my devil's advocate."}, {"time": 9475, "text": "We have a nice, like, vision model, which outputs, like, a one or two, four dimensional perception space."}, {"time": 9483, "text": "Can I try Transformers on it?"}, {"time": 9484, "text": "Sure, I probably will."}, {"time": 9486, "text": "At some point, we'll try Transformers, and then we'll just see."}, {"time": 9489, "text": "Do they do better?"}, {"time": 9489, "text": "Sure, I'm."}, {"time": 9490, "text": "But it might not be a game changer, you're saying?"}, {"time": 9492, "text": "No, well, I'm not."}, {"time": 9493, "text": "Like, might Transformers work better than GRUs for autonomous driving?"}, {"time": 9496, "text": "Might we switch?"}, {"time": 9498, "text": "Is this some radical change?"}, {"time": 9500, "text": "Okay, we use a slightly different, you know, we switch from RNNs to GRUs."}, {"time": 9503, "text": "Like, okay, maybe it's GRUs to Transformers, but no, it's not."}, {"time": 9507, "text": "Well, on the topic of general intelligence, I don't know how much I've talked to you about it."}, {"time": 9512, "text": "Like, what, do you think we'll actually build an AGI?"}, {"time": 9518, "text": "Like, if you look at Ray Kurzweil with Singularity, do you have like an intuition about, you're kind of saying driving is easy."}, {"time": 9526, "text": "And I tend to personally believe that solving driving will have really deep, important impacts on our ability to solve general intelligence."}, {"time": 9539, "text": "Like, I think driving doesn't require general intelligence, but I think they're going to be neighbors in a way that it's like deeply tied."}, {"time": 9548, "text": "Cause it's so, like driving is so deeply connected to the human experience that I think solving one will help solve the other."}, {"time": 9557, "text": "But, so I don't see, I don't see driving as like easy and almost like separate than general intelligence, but like, what's your vision of a future with a Singularity?"}, {"time": 9566, "text": "Do you see there'll be a single moment, like a Singularity where it'll be a phase shift?"}, {"time": 9570, "text": "Are we in the Singularity now?"}, {"time": 9572, "text": "Like what, do you have crazy ideas about the future in terms of AGI?"}, {"time": 9575, "text": "We're definitely in the Singularity now."}, {"time": 9578, "text": "We are?"}, {"time": 9580, "text": "Look at the bandwidth between people."}, {"time": 9581, "text": "The bandwidth between people goes up, right?"}, {"time": 9584, "text": "The Singularity is just, you know, when the bandwidth, but."}, {"time": 9587, "text": "What do you mean by the bandwidth of people?"}, {"time": 9588, "text": "Communications, tools, the whole world is networked."}, {"time": 9591, "text": "The whole world is networked and we raise the speed of that network, right?"}, {"time": 9594, "text": "Oh, so you think the communication of information in a distributed way is an empowering thing for collective intelligence?"}, {"time": 9602, "text": "Oh, I didn't say it's necessarily a good thing, but I think that's like, when I think of the definition of the Singularity, yeah, it seems kind of right."}, {"time": 9608, "text": "I see, like it's a change in the world beyond which like the world be transformed in ways that we can't possibly imagine."}, {"time": 9616, "text": "No, I mean, I think we're in the Singularity now in the sense that there's like, you know, one world and a monoculture and it's also linked."}, {"time": 9622, "text": "Yeah, I mean, I kind of share the intuition that the Singularity will originate from the collective intelligence of us ands versus the like some single system AGI type thing."}, {"time": 9635, "text": "Oh, I totally agree with that."}, {"time": 9637, "text": "Yeah, I don't really believe in like a hard take off AGI kind of thing."}, {"time": 9645, "text": "Yeah, I don't even think AI is all that different in kind from what we've already been building."}, {"time": 9652, "text": "With respect to driving, I think driving is a subset of general intelligence and I think it's a pretty complete subset."}, {"time": 9658, "text": "I think the tools we develop at Kama will also be extremely helpful to solving general intelligence and that's I think the real reason why I'm doing it."}, {"time": 9666, "text": "I don't care about self driving cars."}, {"time": 9668, "text": "It's a cool problem to beat people at."}, {"time": 9670, "text": "But yeah, I mean, yeah, you're kind of, you're of two minds."}, {"time": 9674, "text": "So one, you do have to have a mission and you wanna focus and make sure you get there."}, {"time": 9679, "text": "You can't forget that but at the same time, there is a thread that's much bigger than that connects the entirety of your effort."}, {"time": 9688, "text": "That's much bigger than just driving."}, {"time": 9691, "text": "With AI and with general intelligence, it is so easy to delude yourself into thinking you've figured something out when you haven't."}, {"time": 9697, "text": "If we build a level five self driving car, we have indisputably built something."}, {"time": 9703, "text": "Is it general intelligence?"}, {"time": 9704, "text": "I'm not gonna debate that."}, {"time": 9705, "text": "I will say we've built something that provides huge financial value."}, {"time": 9709, "text": "Yeah, beautifully put."}, {"time": 9710, "text": "That's the engineering credo."}, {"time": 9711, "text": "Like just build the thing."}, {"time": 9713, "text": "It's like, that's why I'm with Elon on go to Mars."}, {"time": 9718, "text": "Yeah, that's a great one."}, {"time": 9719, "text": "You can argue like who the hell cares about going to Mars."}, {"time": 9723, "text": "But the reality is set that as a mission, get it done."}, {"time": 9728, "text": "And then you're going to crack some problem that you've never even expected in the process of doing that, yeah."}, {"time": 9733, "text": "Yeah, I mean, no, I think if I had a choice between humanity going to Mars and solving self driving cars, I think going to Mars is better, but I don't know."}, {"time": 9741, "text": "I'm more suited for self driving cars."}, {"time": 9743, "text": "I'm an information guy."}, {"time": 9744, "text": "I'm not a modernist, I'm a postmodernist."}, {"time": 9746, "text": "Postmodernist, all right, beautifully put."}, {"time": 9749, "text": "Let me drag you back to programming for a sec."}, {"time": 9752, "text": "What three, maybe three to five programming languages should people learn, do you think?"}, {"time": 9756, "text": "Like if you look at yourself, what did you get the most out of from learning?"}, {"time": 9762, "text": "Well, so everybody should learn C and assembly."}, {"time": 9765, "text": "We'll start with those two, right?"}, {"time": 9767, "text": "Assembly?"}, {"time": 9768, "text": "Yeah, if you can't code an assembly, you don't know what the computer's doing."}, {"time": 9771, "text": "You don't understand like, you don't have to be great in assembly, but you have to code in it."}, {"time": 9776, "text": "And then like, you have to appreciate assembly in order to appreciate all the great things C gets you."}, {"time": 9782, "text": "And then you have to code in C in order to appreciate all the great things Python gets you."}, {"time": 9786, "text": "So I'll just say assembly C and Python, we'll start with those three."}, {"time": 9789, "text": "The memory allocation of C and the fact that, so assembly gives you a sense of just how many levels of abstraction you get to work on in modern day programming."}, {"time": 9800, "text": "Yeah, yeah, yeah, yeah, graph coloring for assignment, register assignment and compilers."}, {"time": 9804, "text": "Like, you know, you gotta do, you know, the compiler, the computer only has a certain number of registers, yet you can have all the variables you want in a C function."}, {"time": 9811, "text": "So you get to start to build intuition about compilation, like what a compiler gets you."}, {"time": 9818, "text": "Well, then there's kind of a, so those are all very imperative programming languages."}, {"time": 9825, "text": "Then there's two other paradigms for programming that everybody should be familiar with."}, {"time": 9829, "text": "And one of them is functional."}, {"time": 9831, "text": "You should learn Haskell and take that all the way through, learn a language with dependent types like Coq, learn that whole space, like the very PL theory, heavy languages."}, {"time": 9842, "text": "And Haskell is your favorite functional?"}, {"time": 9844, "text": "Is that the go to, you'd say?"}, {"time": 9846, "text": "Yeah, I'm not a great Haskell programmer."}, {"time": 9848, "text": "I wrote a compiler in Haskell once."}, {"time": 9850, "text": "There's another paradigm, and actually there's one more paradigm that I'll even talk about after that, that I never used to talk about when I would think about this, but the next paradigm is learn Verilog of HDL."}, {"time": 9860, "text": "Understand this idea of all of the instructions execute at once."}, {"time": 9862, "text": "If I have a block in Verilog and I write stuff in it, it's not sequential."}, {"time": 9869, "text": "They all execute at once."}, {"time": 9873, "text": "And then think like that, that's how hardware works."}, {"time": 9876, "text": "To be, so I guess assembly doesn't quite get you that."}, {"time": 9880, "text": "Assembly is more about compilation, and Verilog is more about the hardware, like giving a sense of what actually is the hardware is doing."}, {"time": 9888, "text": "Assembly, C, Python are straight, like they sit right on top of each other."}, {"time": 9892, "text": "In fact, C is, well, C is kind of coded in C, but you could imagine the first C was coded in assembly, and Python is actually coded in C. So you can straight up go on that."}, {"time": 9903, "text": "Got it, and then Verilog gives you, that's brilliant."}, {"time": 9907, "text": "And then I think there's another one now."}, {"time": 9909, "text": "Everyone, Carpathia calls it programming 2.0, which is learn a, I'm not even gonna, don't learn TensorFlow, learn PyTorch."}, {"time": 9918, "text": "So machine learning."}, {"time": 9920, "text": "We've got to come up with a better term than programming 2.0, or, but yeah."}, {"time": 9926, "text": "It's a programming language, learn it."}, {"time": 9929, "text": "I wonder if it can be formalized a little bit better."}, {"time": 9932, "text": "It feels like we're in the early days of what that actually entails."}, {"time": 9937, "text": "Data driven programming?"}, {"time": 9939, "text": "Data driven programming, yeah."}, {"time": 9941, "text": "But it's so fundamentally different as a paradigm than the others."}, {"time": 9944, "text": "Like it almost requires a different skillset."}, {"time": 9950, "text": "But you think it's still, yeah."}, {"time": 9953, "text": "And PyTorch versus TensorFlow, PyTorch wins."}, {"time": 9956, "text": "It's the fourth paradigm."}, {"time": 9957, "text": "It's the fourth paradigm that I've kind of seen."}, {"time": 9959, "text": "There's like this, you know, imperative functional hardware."}, {"time": 9964, "text": "I don't know a better word for it."}, {"time": 9966, "text": "And then ML."}, {"time": 9968, "text": "Do you have advice for people that wanna, you know, get into programming, wanna learn programming?"}, {"time": 9976, "text": "You have a video, what is programming noob lessons, exclamation point."}, {"time": 9982, "text": "And I think the top comment is like, warning, this is not for noobs."}, {"time": 9987, "text": "Do you have a noob, like a TLDW for that video, but also a noob friendly advice on how to get into programming?"}, {"time": 9999, "text": "We're never going to learn programming by watching a video called Learn Programming."}, {"time": 10004, "text": "The only way to learn programming, I think, and the only one is that the only way everyone I've ever met who can program well, learned it all in the same way."}, {"time": 10011, "text": "They had something they wanted to do and then they tried to do it."}, {"time": 10016, "text": "And then they were like, oh, well, okay."}, {"time": 10020, "text": "This is kind of, you know, it'd be nice if the computer could kind of do this."}, {"time": 10022, "text": "And then, you know, that's how you learn."}, {"time": 10024, "text": "You just keep pushing on a project."}, {"time": 10029, "text": "So the only advice I have for learning programming is go program."}, {"time": 10032, "text": "Somebody wrote to me a question like, we don't really, they're looking to learn about recurring neural networks."}, {"time": 10039, "text": "And he's saying, like, my company's thinking of using recurring neural networks for time series data, but we don't really have an idea of where to use it yet."}, {"time": 10047, "text": "We just want to, like, do you have any advice on how to learn about, these are these kind of general machine learning questions."}, {"time": 10053, "text": "And I think the answer is, like, actually have a problem that you're trying to solve."}, {"time": 10060, "text": "I see that stuff."}, {"time": 10061, "text": "Oh my God, when people talk like that, they're like, I heard machine learning is important."}, {"time": 10065, "text": "Could you help us integrate machine learning with macaroni and cheese production?"}, {"time": 10071, "text": "You just, I don't even, you can't help these people."}, {"time": 10074, "text": "Like, who lets you run anything?"}, {"time": 10075, "text": "Who lets that kind of person run anything?"}, {"time": 10078, "text": "I think we're all, we're all beginners at some point."}, {"time": 10083, "text": "It's not like they're a beginner."}, {"time": 10084, "text": "It's like, my problem is not that they don't know about machine learning."}, {"time": 10088, "text": "My problem is that they think that machine learning has something to say about macaroni and cheese production."}, {"time": 10094, "text": "Or like, I heard about this new technology."}, {"time": 10097, "text": "How can I use it for why?"}, {"time": 10099, "text": "Like, I don't know what it is, but how can I use it for why?"}, {"time": 10104, "text": "You have to build up an intuition of how, cause you might be able to figure out a way, but like the prerequisites, you should have a macaroni and cheese problem to solve first."}, {"time": 10113, "text": "And then two, you should have more traditional, like the learning process should involve more traditionally applicable problems in the space of whatever that is, machine learning, and then see if it can be applied to mac and cheese."}, {"time": 10127, "text": "At least start with, tell me about a problem."}, {"time": 10129, "text": "Like if you have a problem, you're like, you know, some of my boxes aren't getting enough macaroni in them."}, {"time": 10134, "text": "Can we use machine learning to solve this problem?"}, {"time": 10136, "text": "That's much, much better than how do I apply machine learning to macaroni and cheese?"}, {"time": 10141, "text": "One big thing, maybe this is me talking to the audience a little bit, cause I get these days so many messages, advice on how to like learn stuff, okay?"}, {"time": 10155, "text": "My, this is not me being mean."}, {"time": 10158, "text": "I think this is quite profound actually, is you should Google it."}, {"time": 10163, "text": "Like one of the like skills that you should really acquire as an engineer, as a researcher, as a thinker, like one, there's two complementary skills."}, {"time": 10176, "text": "Like one is with a blank sheet of paper with no internet to think deeply."}, {"time": 10181, "text": "And then the other is to Google the crap out of the questions you have."}, {"time": 10185, "text": "Like that's actually a skill people often talk about, but like doing research, like pulling at the thread, like looking up different words, going into like GitHub repositories with two stars and like looking how they did stuff, like looking at the code or going on Twitter, seeing like there's little pockets of brilliant people that are like having discussions."}, {"time": 10207, "text": "Like if you're a neuroscientist, go into signal processing community."}, {"time": 10211, "text": "If you're an AI person going into the psychology community, like switch communities."}, {"time": 10218, "text": "I keep searching, searching, searching, because it's so much better to invest in like finding somebody else who already solved your problem than it is to try to solve the problem."}, {"time": 10230, "text": "And because they've often invested years of their life, like entire communities are probably already out there who have tried to solve your problem."}, {"time": 10239, "text": "I think they're the same thing."}, {"time": 10240, "text": "I think you go try to solve the problem."}, {"time": 10244, "text": "And then in trying to solve the problem, if you're good at solving problems, you'll stumble upon the person who solved it already."}, {"time": 10250, "text": "But the stumbling is really important."}, {"time": 10252, "text": "I think that's a skill that people should really put, especially in undergrad, like search."}, {"time": 10257, "text": "If you ask me a question, how should I get started in deep learning, like especially?"}, {"time": 10264, "text": "Like that is just so Googleable."}, {"time": 10267, "text": "Like the whole point is you Google that and you get a million pages and just start looking at them."}, {"time": 10273, "text": "Start pulling at the threads, start exploring, start taking notes, start getting advice from a million people that already like spent their life answering that question, actually."}, {"time": 10285, "text": "Oh, well, yeah, I mean, that's definitely also, yeah, when people like ask me things like that, I'm like, trust me, the top answer on Google is much, much better than anything I'm going to tell you, right?"}, {"time": 10294, "text": "People ask, it's an interesting question."}, {"time": 10298, "text": "Let me know if you have any recommendations."}, {"time": 10299, "text": "What three books, technical or fiction or philosophical, had an impact on your life or you would recommend perhaps?"}, {"time": 10309, "text": "Maybe we'll start with the least controversial, Infinite Jest, Infinite Jest is a... David Foster Wallace."}, {"time": 10318, "text": "Yeah, it's a book about wireheading, really."}, {"time": 10323, "text": "Very enjoyable to read, very well written."}, {"time": 10327, "text": "You know, you will grow as a person reading this book, its effort, and I'll set that up for the second book, which is pornography, it's called Atlas Shrugged, which... Atlas Shrugged is pornography."}, {"time": 10342, "text": "I mean, it is, I will not defend the, I will not say Atlas Shrugged is a well written book."}, {"time": 10348, "text": "It is entertaining to read, certainly, just like pornography."}, {"time": 10351, "text": "The production value isn't great."}, {"time": 10353, "text": "You know, there's a 60 page monologue in there that Ann Rand's editor really wanted to take out."}, {"time": 10358, "text": "And she paid, she paid out of her pocket to keep that 60 page monologue in the book."}, {"time": 10365, "text": "But it is a great book for a kind of framework of human relations."}, {"time": 10374, "text": "And I know a lot of people are like, yeah, but it's a terrible framework."}, {"time": 10378, "text": "Yeah, but it's a framework."}, {"time": 10380, "text": "Just for context, in a couple of days, I'm speaking for probably four plus hours with Yaron Brook, who's the main living, remaining objectivist, objectivist."}, {"time": 10394, "text": "So I've always found this philosophy quite interesting on many levels."}, {"time": 10400, "text": "One of how repulsive some percent of, large percent of the population find it, which is always, always funny to me when people are like unable to even read a philosophy because of some, I think that says more about their psychological perspective on it."}, {"time": 10420, "text": "But there is something about objectivism and Ann Rand's philosophy that's deeply connected to this idea of capitalism, of the ethical life is the productive life that was always compelling to me."}, {"time": 10440, "text": "It didn't seem as, like I didn't seem to interpret it in the negative sense that some people do."}, {"time": 10445, "text": "To be fair, I read that book when I was 19."}, {"time": 10447, "text": "So you had an impact at that point, yeah."}, {"time": 10449, "text": "Yeah, and the bad guys in the book have this slogan from each according to their ability to each according to their need."}, {"time": 10457, "text": "And I'm looking at this and I'm like, these are the most cart, this is team rocket level cartoonishness, right?"}, {"time": 10462, "text": "No bad guy."}, {"time": 10463, "text": "And then when I realized that was actually the slogan of the communist party, I'm like, wait a second."}, {"time": 10469, "text": "Wait, no, no, no, no, no."}, {"time": 10471, "text": "You're telling me this really happened?"}, {"time": 10474, "text": "I mean, one of the criticisms of her work is she has a cartoonish view of good and evil."}, {"time": 10479, "text": "Like the reality, as Jordan Peterson says, is that each of us have the capacity for good and evil in us as opposed to like, there's some characters who are purely evil and some characters that are purely good."}, {"time": 10492, "text": "And that's in a way why it's pornographic."}, {"time": 10495, "text": "The production value, I love it."}, {"time": 10497, "text": "Like evil is punished and there's very clearly, there's no, just like porn doesn't have character growth."}, {"time": 10506, "text": "Well, you know, neither does Alice Shrugged, like."}, {"time": 10509, "text": "Really, well put."}, {"time": 10510, "text": "But at 19 year old George Hots, it was good enough."}, {"time": 10515, "text": "What's the third?"}, {"time": 10516, "text": "You have something?"}, {"time": 10518, "text": "I could give, these two I'll just throw out."}, {"time": 10521, "text": "They're sci fi."}, {"time": 10522, "text": "Perputation City."}, {"time": 10524, "text": "Great thing to start thinking about copies of yourself."}, {"time": 10526, "text": "And then the... Who's that by?"}, {"time": 10528, "text": "Sorry, I didn't catch that."}, {"time": 10529, "text": "That is Greg Egan."}, {"time": 10531, "text": "He's a, that might not be his real name."}, {"time": 10533, "text": "Some Australian guy, might not be Australian."}, {"time": 10536, "text": "And then this one's online."}, {"time": 10538, "text": "It's called The Metamorphosis of Prime Intellect."}, {"time": 10543, "text": "It's a story set in a post singularity world."}, {"time": 10546, "text": "Is there, can you, either of the worlds, do you find something philosophical interesting in them that you can comment on?"}, {"time": 10553, "text": "I mean, it is clear to me that Metamorphosis of Prime Intellect is like written by an engineer, which is, it's very almost a pragmatic take on a utopia, in a way."}, {"time": 10572, "text": "Positive or negative?"}, {"time": 10575, "text": "That's up to you to decide reading the book."}, {"time": 10577, "text": "And the ending of it is very interesting as well."}, {"time": 10581, "text": "And I didn't realize what it was."}, {"time": 10583, "text": "I first read that when I was 15."}, {"time": 10585, "text": "I've reread that book several times in my life."}, {"time": 10587, "text": "And it's short, it's 50 pages."}, {"time": 10589, "text": "Everyone should go read it."}, {"time": 10590, "text": "What's, sorry, it's a little tangent."}, {"time": 10593, "text": "I've been working through the foundation."}, {"time": 10594, "text": "I've been, I haven't read much sci fi my whole life and I'm trying to fix that the last few months."}, {"time": 10600, "text": "That's been a little side project."}, {"time": 10602, "text": "What's to you as the greatest sci fi novel that people should read?"}, {"time": 10607, "text": "Or is that?"}, {"time": 10609, "text": "I mean, I would, yeah, I would say like, yeah, Permutation City, Metamorphosis of Prime Intellect."}, {"time": 10614, "text": "I didn't like Foundation."}, {"time": 10616, "text": "I thought it was way too modernist."}, {"time": 10618, "text": "You like Dune and all of those."}, {"time": 10620, "text": "I've never read Dune."}, {"time": 10622, "text": "I have to read it."}, {"time": 10624, "text": "Fire Upon the Deep is interesting."}, {"time": 10629, "text": "Okay, I mean, look, everyone should read, everyone should read Neuromancer."}, {"time": 10631, "text": "Everyone should read Snow Crash."}, {"time": 10632, "text": "If you haven't read those, like start there."}, {"time": 10635, "text": "Yeah, I haven't read Snow Crash."}, {"time": 10636, "text": "You haven't read Snow Crash?"}, {"time": 10637, "text": "Oh, it's, I mean, it's very entertaining."}, {"time": 10639, "text": "Go to Lesher Bach."}, {"time": 10640, "text": "And if you want the controversial one, Bronze Age Mindset."}, {"time": 10645, "text": "All right, I'll look into that one."}, {"time": 10647, "text": "Those aren't sci fi, but just to round out books."}, {"time": 10650, "text": "So a bunch of people asked me on Twitter and Reddit and so on for advice."}, {"time": 10656, "text": "So what advice would you give a young person today about life?"}, {"time": 10660, "text": "In other words, what, yeah, I mean, looking back, especially when you were younger, you did, and you continued it."}, {"time": 10671, "text": "You've accomplished a lot of interesting things."}, {"time": 10674, "text": "Is there some advice from those, from that life of yours that you can pass on?"}, {"time": 10681, "text": "If college ever opens again, I would love to give a graduation speech."}, {"time": 10687, "text": "At that point, I will put a lot of somewhat satirical effort into this question."}, {"time": 10692, "text": "Yeah, at this, you haven't written anything at this point."}, {"time": 10695, "text": "Oh, you know what?"}, {"time": 10696, "text": "Always wear sunscreen."}, {"time": 10698, "text": "This is water."}, {"time": 10699, "text": "Pick your plagiarizing."}, {"time": 10701, "text": "I mean, you know, but that's the, that's the like clean your room."}, {"time": 10706, "text": "You know, yeah, you can plagiarize from all of this stuff."}, {"time": 10708, "text": "And it's, there is no, self help books aren't designed to help you."}, {"time": 10717, "text": "They're designed to make you feel good."}, {"time": 10720, "text": "Like whatever advice I could give, you already know."}, {"time": 10724, "text": "Everyone already knows."}, {"time": 10725, "text": "Sorry, it doesn't feel good."}, {"time": 10731, "text": "Like, you know, you know, if I tell you that you should, you know, eat well and read more and it's not gonna do anything."}, {"time": 10741, "text": "I think the whole like genre of those kinds of questions is meaningless."}, {"time": 10748, "text": "If anything, it's don't worry so much about that stuff."}, {"time": 10750, "text": "Don't be so caught up in your head."}, {"time": 10753, "text": "I mean, you're, yeah."}, {"time": 10754, "text": "In a sense that your whole life, your whole existence is like moving version of that advice."}, {"time": 10763, "text": "There's something, I mean, there's something in you that resists that kind of thinking and that in itself is, it's just illustrative of who you are."}, {"time": 10774, "text": "And there's something to learn from that."}, {"time": 10776, "text": "I think you're clearly not overthinking stuff."}, {"time": 10782, "text": "There's a gut thing."}, {"time": 10783, "text": "Even when I talk about my advice, I'm like, my advice is only relevant to me."}, {"time": 10787, "text": "It's not relevant to anybody else."}, {"time": 10788, "text": "I'm not saying you should go out."}, {"time": 10789, "text": "If you're the kind of person who overthinks things to stop overthinking things, it's not bad."}, {"time": 10794, "text": "It doesn't work for me."}, {"time": 10794, "text": "Maybe it works for you."}, {"time": 10797, "text": "Let me ask you about love."}, {"time": 10802, "text": "I think last time we talked about the meaning of life and it was kind of about winning."}, {"time": 10810, "text": "I don't think I've talked to you about love much, whether romantic or just love for the common humanity amongst us all."}, {"time": 10818, "text": "What role has love played in your life?"}, {"time": 10821, "text": "In this quest for winning, where does love fit in?"}, {"time": 10826, "text": "Well, the word love, I think means several different things."}, {"time": 10829, "text": "There's love in the sense of, maybe I could just say, there's like love in the sense of opiates and love in the sense of oxytocin and then love in the sense of, maybe like a love for math."}, {"time": 10844, "text": "I don't think it fits into either of those first two paradigms."}, {"time": 10849, "text": "So each of those, have they given something to you in your life?"}, {"time": 10856, "text": "I'm not that big of a fan of the first two."}, {"time": 10863, "text": "The same reason I'm not a fan of, the same reason I don't do opiates and don't take ecstasy."}, {"time": 10869, "text": "And there were times, look, I've tried both."}, {"time": 10874, "text": "I liked opiates way more than I liked ecstasy, but they're not, the ethical life is the productive life."}, {"time": 10884, "text": "So maybe that's my problem with those."}, {"time": 10887, "text": "And then like, yeah, a sense of, I don't know, like abstract love for humanity."}, {"time": 10892, "text": "I mean, the abstract love for humanity, I'm like, yeah, I've always felt that."}, {"time": 10896, "text": "And I guess it's hard for me to imagine not feeling it and maybe there's people who don't."}, {"time": 10903, "text": "Yeah, that's just like a background thing that's there."}, {"time": 10906, "text": "I mean, since we brought up drugs, let me ask you, this is becoming more and more a part of my life because I'm talking to a few researchers that are working on psychedelics."}, {"time": 10917, "text": "I've eaten shrooms a couple of times and it was fascinating to me that like the mind can go, like just fascinating the mind can go to places I didn't imagine it could go."}, {"time": 10929, "text": "And it was very friendly and positive and exciting and everything was kind of hilarious in the place."}, {"time": 10936, "text": "Wherever my mind went, that's where I went."}, {"time": 10938, "text": "Is, what do you think about psychedelics?"}, {"time": 10940, "text": "Do you think they have, where do you think the mind goes?"}, {"time": 10944, "text": "Have you done psychedelics?"}, {"time": 10945, "text": "Where do you think the mind goes?"}, {"time": 10948, "text": "Is there something useful to learn about the places it goes once you come back?"}, {"time": 10953, "text": "I find it interesting that this idea that psychedelics have something to teach is almost unique to psychedelics, right?"}, {"time": 10963, "text": "People don't argue this about amphetamines."}, {"time": 10966, "text": "And I'm not really sure why."}, {"time": 10970, "text": "I think all of the drugs have lessons to teach."}, {"time": 10973, "text": "I think there's things to learn from opiates."}, {"time": 10975, "text": "I think there's things to learn from amphetamines."}, {"time": 10976, "text": "I think there's things to learn from psychedelics, things to learn from marijuana."}, {"time": 10982, "text": "But also at the same time recognize that I don't think you're learning things about the world."}, {"time": 10987, "text": "I think you're learning things about yourself."}, {"time": 10990, "text": "And, you know, what's the, even, it might've even been, might've even been a Timothy Leary quote."}, {"time": 10997, "text": "I don't wanna misquote him, but the idea is basically like, you know, everybody should look behind the door, but then once you've seen behind the door, you don't need to keep going back."}, {"time": 11006, "text": "So, I mean, and that's my thoughts on all real drug use too."}, {"time": 11009, "text": "Except maybe for caffeine."}, {"time": 11012, "text": "It's a little experience that is good to have, but."}, {"time": 11017, "text": "Oh yeah, no, I mean, yeah, I guess, yes, psychedelics are definitely."}, {"time": 11021, "text": "So you're a fan of new experiences, I suppose."}, {"time": 11024, "text": "Because they all contain a little, especially the first few times, it contains some lessons that can be picked up."}, {"time": 11029, "text": "Yeah, and I'll revisit psychedelics maybe once a year."}, {"time": 11035, "text": "Usually smaller doses."}, {"time": 11038, "text": "Maybe they turn up the learning rate of your brain."}, {"time": 11041, "text": "I've heard that, I like that."}, {"time": 11043, "text": "Yeah, that's cool."}]}]