[{"title": "Charles Isbell and Michael Littman: Machine Learning and Education | Lex Fridman Podcast #148", "id": "yzMVEbs8Zz0", "quotes": [{"time": 213, "text": "Does this take us into the realm of computing?"}, {"time": 215, "text": "It does, but I think perhaps the way I can get him to admit that he's wrong is that it's about rules."}, {"time": 223, "text": "It's about rules."}, {"time": 224, "text": "It's about symbols."}, {"time": 225, "text": "It's about all these other things."}, {"time": 225, "text": "But statistics is not about rules?"}, {"time": 227, "text": "I'm gonna say statistics is about rules."}, {"time": 228, "text": "But it's not just the statistics, right?"}, {"time": 230, "text": "It's not just a random variable that you choose and you have a probability."}, {"time": 232, "text": "I think you have a narrow view of statistics."}, {"time": 234, "text": "Okay, well then what would be the broad view of statistics that would still allow it to be statistics and not say history that would make computational statistics okay?"}, {"time": 243, "text": "Well, okay, so I had my first sort of research mentor, a guy named Tom Landauer, taught me to do some statistics, right?"}, {"time": 252, "text": "And I was annoyed all the time because the statistics would say that what I was doing was not statistically significant."}, {"time": 259, "text": "And I was like, but, but, and basically what he said to me is statistics is how you're gonna keep from lying to yourself, which I thought was really deep."}, {"time": 269, "text": "It is a way to keep yourself honest in a particular way."}, {"time": 274, "text": "Yeah, and so you're trying to find rules."}, {"time": 276, "text": "I'm just gonna bring it back to rules."}, {"time": 278, "text": "Wait, wait, wait, could you possibly try to define rules?"}, {"time": 284, "text": "Even regular statisticians, noncomputational statisticians, do spend some of their time evaluating rules, right?"}, {"time": 291, "text": "Applying statistics to try to understand does this rule capture this?"}, {"time": 294, "text": "Does this not capture that?"}, {"time": 295, "text": "You mean like hypothesis testing kind of thing?"}, {"time": 297, "text": "Or like confidence intervals?"}, {"time": 299, "text": "I think more like hypothesis."}, {"time": 301, "text": "Like I feel like the word statistic literally means like a summary, like a number that summarizes other numbers."}, {"time": 306, "text": "But I think the field of statistics actually applies that idea to things like rules, to understand whether or not a rule is valid."}, {"time": 315, "text": "Does software engineering statistics?"}, {"time": 319, "text": "Programming languages statistics?"}, {"time": 321, "text": "Because I think there's a very, it's useful to think about a lot of what AI and machine learning is or certainly should be as software engineering, as programming languages."}, {"time": 329, "text": "Just to put it in language that you might understand, the hyperparameters beyond the problem itself."}, {"time": 335, "text": "The hyperparameters is too many syllables for me to understand."}, {"time": 337, "text": "The hyperparameters."}, {"time": 340, "text": "That goes around it, right?"}, {"time": 341, "text": "It's the decisions you choose to make."}, {"time": 342, "text": "It's the metrics you choose to use."}, {"time": 344, "text": "It's the loss function."}, {"time": 345, "text": "You wanna say the practice of machine learning is different than the practice of statistics."}, {"time": 350, "text": "Like the things you have to worry about and how you worry about them are different, therefore they're different."}, {"time": 355, "text": "At a very little, I mean, at the very least."}, {"time": 357, "text": "It's that much is true."}, {"time": 359, "text": "It doesn't mean that statistics, computational or otherwise aren't important."}, {"time": 362, "text": "I think they are."}, {"time": 363, "text": "I mean, I do a lot of that, for example."}, {"time": 365, "text": "But I think it goes beyond that."}, {"time": 366, "text": "I think that we could think about game theory in terms of statistics, but I don't think it's very as useful to do."}, {"time": 372, "text": "I mean, the way I would think about it or a way I would think about it is this way."}, {"time": 377, "text": "Chemistry is just physics."}, {"time": 379, "text": "But I don't think it's as useful to think about chemistry as being just physics."}, {"time": 383, "text": "It's useful to think about it as chemistry."}, {"time": 385, "text": "The level of abstraction really matters here."}, {"time": 387, "text": "So I think it is, there are contexts in which it is useful."}, {"time": 391, "text": "I think of it that way, right?"}, {"time": 392, "text": "So finding that connection is actually helpful."}, {"time": 393, "text": "And I think that's when I emphasize the computational statistics thing."}, {"time": 396, "text": "I think I want to befriend statistics and not absorb them."}, {"time": 401, "text": "Here's the A way to think about it beyond what I just said, right?"}, {"time": 404, "text": "So what would you say, and I want you to think back to a conversation we had a very long time ago."}, {"time": 409, "text": "What would you say is the difference between, say, the early 2000s, ICML and what we used to call NIPS, NeurIPS?"}, {"time": 417, "text": "Is there a difference?"}, {"time": 418, "text": "A lot of, particularly on the machine learning that was done there?"}, {"time": 420, "text": "ICML was around that long."}, {"time": 423, "text": "So iClear is the new conference, newish."}, {"time": 426, "text": "Yeah, I guess so."}, {"time": 427, "text": "And ICML was around the 2000."}, {"time": 430, "text": "So ICML predates that."}, {"time": 432, "text": "I think my most cited ICML paper is from 94."}, {"time": 435, "text": "Michael knows this better than me because, of course, he's significantly older than I am."}, {"time": 438, "text": "But the point is, what is the difference between ICML and NeurIPS in the late 90s, early 2000s?"}, {"time": 444, "text": "I don't know what everyone else's perspective would be, but I had a particular perspective at that time, which is I felt like ICML was more of a computer science place and that NIPS, NeurIPS was more of an engineering place, like the kind of math that happened at the two places."}, {"time": 460, "text": "As a computer scientist, I felt more comfortable with the ICML math."}, {"time": 464, "text": "And the NeurIPS people would say that that's because I'm dumb."}, {"time": 468, "text": "And that's such an engineering thing to say, so."}, {"time": 471, "text": "I agree with that part of it, but I do it a little differently."}, {"time": 473, "text": "We actually had a nice conversation with Tom Dietrich about this in public."}, {"time": 477, "text": "On Twitter just a couple of days ago."}, {"time": 478, "text": "I put it a little differently, which is that ICML was machine learning done by a computer scientist."}, {"time": 484, "text": "And NeurIPS was machine learning done by a computer scientist trying to impress statisticians."}, {"time": 492, "text": "Which was weird because it was the same people, at least by the time I started paying attention."}, {"time": 497, "text": "But it just felt very, very different."}, {"time": 498, "text": "And I think that that perspective of whether you're trying to impress the statisticians or you're trying to impress the programmers is actually very different and has real impact on what you choose to worry about and what kind of outcomes you come to."}, {"time": 511, "text": "So I think it really matters."}, {"time": 512, "text": "I think computational statistics is a means to an end."}, {"time": 514, "text": "It is not an end in some sense."}, {"time": 516, "text": "And I think that really matters here in the same way that I don't think computer science is just engineering or just science or just math or whatever."}, {"time": 523, "text": "Okay, so I'd have to now agree that now we agree on everything."}, {"time": 527, "text": "The important thing here is that my opinions may have changed, but not the fact that I'm right, I think is what we just came to."}, {"time": 534, "text": "Right, and my opinions may have changed and not the fact that I'm wrong."}, {"time": 539, "text": "You lost me."}, {"time": 539, "text": "I'm not even."}, {"time": 540, "text": "I think I lost myself there too."}, {"time": 541, "text": "But anyway, we're back."}, {"time": 544, "text": "This happens to us sometimes."}, {"time": 545, "text": "We're sorry."}, {"time": 546, "text": "How does neural networks change this, just to even linger on this topic, change this idea of statistics, how big of a pie statistics is within the machine learning thing?"}, {"time": 559, "text": "Like, because it sounds like hyperparameters and also just the role of data."}, {"time": 564, "text": "You know, people are starting to use this terminology of software 2.0, which is like the act of programming as a, like you're a designer in the hyperparameter space of neural networks, and you're also the collector and the organizer and the cleaner of the data, and that's part of the programming."}, {"time": 587, "text": "So how did, on the NeurIPS versus ICML topic, what's the role of neural networks in redefining the size and the role of machine learning?"}, {"time": 597, "text": "I can't wait to hear what Michael thinks about this, but I would add one."}, {"time": 601, "text": "But you will."}, {"time": 602, "text": "That's true, I will, I'll force myself to."}, {"time": 604, "text": "I think there's one other thing I would add to your description, which is the kind of software engineering part of what does it mean to debug, for example."}, {"time": 610, "text": "But this is a difference between the kind of computational statistics view of machine learning and the computational view of machine learning, which is, I think, one is worried about the equation, as it were."}, {"time": 620, "text": "And by the way, this is not a value judgment."}, {"time": 623, "text": "I just think it's about perspective."}, {"time": 624, "text": "But the kind of questions you would ask when you start asking yourself, well, what does it mean to program and develop and build the system, is a very computer sciencey view of the problem."}, {"time": 633, "text": "I mean, if you get on data science Twitter and econ Twitter, you actually hear this a lot with the economist and the data scientist complaining about the machine learning people."}, {"time": 644, "text": "Well, it's just statistics, and I don't know why they don't see this."}, {"time": 647, "text": "But they're not even asking the same questions."}, {"time": 649, "text": "They're not thinking about it as a kind of programming problem."}, {"time": 653, "text": "And I think that that really matters, just asking this question."}, {"time": 655, "text": "I actually think it's a little different from programming in hyperparameter space and sort of collecting the data."}, {"time": 663, "text": "But I do think that that immersion really matters."}, {"time": 666, "text": "So I'll give you a quick example of the way I think about this."}, {"time": 668, "text": "So I teach machine learning."}, {"time": 669, "text": "Michael and I have co taught a machine learning class, which has now reached, I don't know, 10,000 people at least over the last several years, or somewhere there's abouts."}, {"time": 677, "text": "And my machine learning assignments are of this form."}, {"time": 681, "text": "So the first one is something like, implement these five algorithms, KNN and SVMs and boosting and decision trees and neural networks, and maybe that's it, I can't remember."}, {"time": 692, "text": "And when I say implement, I mean steal the code."}, {"time": 694, "text": "I am completely uninterested."}, {"time": 696, "text": "You get zero points for getting the thing to work."}, {"time": 698, "text": "I don't want you spending your time worrying about getting the corner case right of what happens when you are trying to normalize distances and the points on the thing."}, {"time": 707, "text": "And so you divide by zero."}, {"time": 708, "text": "I'm not interested in that, right?"}, {"time": 710, "text": "Steal the code."}, {"time": 711, "text": "However, you're going to run those algorithms on two data sets."}, {"time": 715, "text": "The data sets have to be interesting."}, {"time": 717, "text": "What does it mean to be interesting?"}, {"time": 718, "text": "Well, data sets interesting if it reveals differences between algorithms, which presumably are all the same because they can represent whatever they can represent."}, {"time": 726, "text": "And two data sets are interesting together if they show different differences, as it were."}, {"time": 730, "text": "And you have to analyze them."}, {"time": 731, "text": "You have to justify their interestingness and you have to analyze them in a whole bunch of ways."}, {"time": 735, "text": "But all I care about is the data in your analysis, not the programming."}, {"time": 738, "text": "And I occasionally end up in these long discussions with students, well, I don't really, I copy and paste the things that I've said the other 15,000 times it's come up, which is they go, but the only way to learn, really understand is to code them up, which is a very programmer, software engineering view of the world."}, {"time": 755, "text": "If you don't program it, you don't understand it, which is, by the way, I think is wrong in a very specific way."}, {"time": 760, "text": "But it is a way that you come to understand because then you have to wrestle with the algorithm."}, {"time": 764, "text": "But the thing about machine learning is it's not just sorting numbers where in some sense the data doesn't matter."}, {"time": 769, "text": "What matters is, well, does the algorithm work on these abstract things, one less than the other?"}, {"time": 773, "text": "In machine learning, the data matters."}, {"time": 774, "text": "It matters more than almost anything."}, {"time": 777, "text": "And not everything, but almost anything."}, {"time": 779, "text": "And so as a result, you have to live with the data and don't get distracted by the algorithm per se."}, {"time": 784, "text": "And I think that that focus on the data and what it can tell you and what question it's actually answering for you as opposed to the question you thought you were asking is a key and important thing about machine learning and is a way that computationalists as opposed to statisticians bring a particular view about how to think about the process."}, {"time": 803, "text": "The statisticians, by contrast, bring, I think I'd be willing to say, a better view about the kind of formal math that's behind it and what an actual number ultimately is saying about the data."}, {"time": 815, "text": "And those are both important, but they're also different."}, {"time": 818, "text": "I didn't really think of it this way is to build intuition about the role of data, the different characteristics of data by having two data sets that are different and they reveal the differences in the differences."}, {"time": 830, "text": "That's a really fascinating, that's a really interesting educational approach."}, {"time": 835, "text": "The students love it, but not right away."}, {"time": 837, "text": "No, they love it at the end."}, {"time": 838, "text": "They love it later."}, {"time": 839, "text": "They love it at the end."}, {"time": 840, "text": "Not at the beginning."}, {"time": 842, "text": "Not even immediately after."}, {"time": 844, "text": "I feel like there's a deep profound lesson about education there."}, {"time": 848, "text": "That you can't listen to students about whether what you're doing is the right or the wrong thing."}, {"time": 855, "text": "Yeah, well, as a wise, Michael Lippmann once said to me about children, which I think applies to teaching, is you have to give them what they need without bending to their will."}, {"time": 867, "text": "And students are like that."}, {"time": 868, "text": "You have to figure out what they need."}, {"time": 869, "text": "You're a curator."}, {"time": 869, "text": "Your whole job is to curate and to present because on their own, they're not gonna necessarily know where to search."}, {"time": 875, "text": "So you're providing pushes in some direction and learn space and you have to give them what they need in a way that keeps them engaged enough so that they eventually discover what they want and they get the tools they need to go and learn other things off of."}, {"time": 892, "text": "Let me put on my Russian hat, which believes that life is suffering."}, {"time": 895, "text": "I like Russian hats, by the way."}, {"time": 896, "text": "If you have one, I would like this."}, {"time": 898, "text": "Those are ridiculous, yes."}, {"time": 899, "text": "But in a delightful way."}, {"time": 901, "text": "But sure."}, {"time": 904, "text": "What do you think is the role of, we talked about balance a little bit."}, {"time": 908, "text": "What do you think is the role of hardship in education?"}, {"time": 911, "text": "Like I think the biggest things I've learned, like what made me fall in love with math, for example, is by being bad at it until I got good at it."}, {"time": 924, "text": "So like struggling with a problem, which increased the level of joy I felt when I finally figured it out."}, {"time": 933, "text": "And it always felt with me, with teachers, especially modern discussions of education, how can we make education more fun, more engaging, more all those things?"}, {"time": 944, "text": "Or from my perspective, it's like, you're maybe missing the point that education, that life is suffering."}, {"time": 952, "text": "Education is supposed to be hard and that actually what increases the joy you feel when you actually learn something."}, {"time": 959, "text": "Is that ridiculous?"}, {"time": 962, "text": "Do you like to see your students suffer?"}, {"time": 964, "text": "Okay, so this may be a point where we differ."}, {"time": 967, "text": "I suspect not."}, {"time": 968, "text": "I'm gonna do go on."}, {"time": 970, "text": "Well, what would your answer be?"}, {"time": 971, "text": "I wanna hear you first."}, {"time": 972, "text": "Okay, well, I was gonna not answer the question."}, {"time": 974, "text": "You don't want the students to know you enjoy them suffering?"}, {"time": 979, "text": "I was gonna say that there's, I think there's a distinction that you can make in the kind of suffering, right?"}, {"time": 985, "text": "So I think you can be in a mode where you're suffering in a hopeless way versus you're suffering in a hopeful way, right?"}, {"time": 993, "text": "Where you're like, you can see that if you, that you still have, you can still imagine getting to the end, right?"}, {"time": 1001, "text": "And as long as people are in that mindset where they're struggling, but it's not a hopeless kind of struggling, that's productive."}, {"time": 1009, "text": "I think that's really helpful."}, {"time": 1010, "text": "But it's struggling, like if you break their will, if you leave them hopeless."}, {"time": 1016, "text": "No, that don't, sure, some people are gonna, whatever, lift themselves up by their bootstraps, but like mostly you give up and certainly it takes the joy out of it."}, {"time": 1023, "text": "And you're not gonna spend a lot of time on something that brings you no joy."}, {"time": 1027, "text": "So it is a bit of a delicate balance, right?"}, {"time": 1030, "text": "You have to thwart people in a way that they still believe that there's a way through."}, {"time": 1037, "text": "Right, so that's a, we strongly agree actually."}, {"time": 1040, "text": "So I think, well, first off, struggling and suffering aren't the same thing, right?"}, {"time": 1044, "text": "Yeah, just being poetic."}, {"time": 1045, "text": "Oh, no, no, I actually appreciate the poetry."}, {"time": 1047, "text": "And one of the reasons I appreciate it is that they are often the same thing and often quite different, right?"}, {"time": 1052, "text": "So you can struggle without suffering, you can certainly suffer pretty easily."}, {"time": 1057, "text": "You don't necessarily have to struggle to suffer."}, {"time": 1058, "text": "So I think that you want people to struggle, but that hope matters."}, {"time": 1062, "text": "You have to, they have to understand that they're gonna get through it on the other side."}, {"time": 1066, "text": "And it's very easy to confuse the two."}, {"time": 1070, "text": "I actually think Brown University has a very, just philosophically has a very different take on the relationship with their students, particularly undergrads from say a place like Georgia Tech, which is."}, {"time": 1080, "text": "Which university is better?"}, {"time": 1081, "text": "Well, I have my opinions on that."}, {"time": 1083, "text": "I mean, remember, Charles said, it doesn't matter what the facts are, I'm always right."}, {"time": 1087, "text": "The correct answer is that it doesn't matter, they're different."}, {"time": 1090, "text": "But clearly, clearly the answer is different."}, {"time": 1094, "text": "He went to a school like the school where he is as an undergrad."}, {"time": 1098, "text": "I went to a school, specifically the same school, though it was changed a bit in the intervening years."}, {"time": 1103, "text": "Brown or Georgia Tech?"}, {"time": 1104, "text": "No, I was talking about Georgia Tech."}, {"time": 1105, "text": "And I went to an undergrad place that's a lot like the place where I work now."}, {"time": 1109, "text": "And so it does seem like we're more familiar with these models."}, {"time": 1113, "text": "So there's a similarity between Brown and Yale?"}, {"time": 1115, "text": "Yeah, I think they're quite similar, yeah."}, {"time": 1118, "text": "And Duke."}, {"time": 1119, "text": "Duke has some similarities too, but it's got a little Southern draw."}, {"time": 1122, "text": "You've kind of worked your, you've sort of worked at universities that are like the places where you learned."}, {"time": 1130, "text": "And the same would be true for me."}, {"time": 1132, "text": "Are you uncomfortable venturing outside the box?"}, {"time": 1136, "text": "Is that what you're saying?"}, {"time": 1137, "text": "Journeying out?"}, {"time": 1138, "text": "That's not what I'm saying."}, {"time": 1138, "text": "Yeah, Charles is definitely."}, {"time": 1140, "text": "He only goes to places that have institute in the name, right?"}, {"time": 1142, "text": "It has worked out that way."}, {"time": 1144, "text": "Well, academic places anyway."}, {"time": 1146, "text": "Well, no, I was a visiting scientist at UPenn or visiting something at UPenn."}, {"time": 1151, "text": "Oh, wow, I just understood your joke."}, {"time": 1154, "text": "Five minutes later."}, {"time": 1158, "text": "I like to set the sort of time bomb."}, {"time": 1160, "text": "The institute is in the, that Charles only goes to places that have institute in the name."}, {"time": 1165, "text": "So I guess Georgia, I forget that Georgia Tech is Georgia Institute of Technology."}, {"time": 1170, "text": "The number of people who refer to it as Georgia Tech University is large and incredibly irritating."}, {"time": 1175, "text": "It's one of the few things that genuinely gets under my skin."}, {"time": 1179, "text": "But like schools like Georgia Tech and MIT have as part of the ethos, like there is, I wanna say there's an abbreviation that someone taught me, like IHTFP, something like that."}, {"time": 1189, "text": "Like there's an expression which is basically I hate being here, which they say so proudly."}, {"time": 1195, "text": "And that is definitely not the ethos at Brown."}, {"time": 1197, "text": "Like Brown is, there's a little more pampering and empowerment and stuff."}, {"time": 1202, "text": "And it's not like we're gonna crush you and you're gonna love it."}, {"time": 1204, "text": "So yeah, I think there's a, I think the ethoses are different."}, {"time": 1209, "text": "That's interesting, yeah."}, {"time": 1210, "text": "We had Drown Proofing."}, {"time": 1212, "text": "In order to graduate from Georgia Tech, this is a true thing."}, {"time": 1215, "text": "Feel free to look it up."}, {"time": 1216, "text": "If you."}, {"time": 1217, "text": "A lot of schools have this by the way."}, {"time": 1219, "text": "No, actually Georgia Tech was barely the first."}, {"time": 1220, "text": "Brandeis has it."}, {"time": 1221, "text": "Had it."}, {"time": 1223, "text": "I feel like Georgia Tech was the first in a lot of things."}, {"time": 1227, "text": "It was the first in a lot of things."}, {"time": 1228, "text": "Had the first master's degree."}, {"time": 1229, "text": "First Bumblebee mascot."}, {"time": 1232, "text": "First master's in computer science actually."}, {"time": 1234, "text": "Right, online master's."}, {"time": 1235, "text": "Well that too, but way back in the 60s."}, {"time": 1237, "text": "NSF grant."}, {"time": 1239, "text": "You're the first information and computer science master's degree in the country."}, {"time": 1242, "text": "But the Georgia Tech, it used to be the case that in order to graduate from Georgia Tech, you had to take a Drown Proofing class."}, {"time": 1249, "text": "Where effectively, they threw you in the water and tied you up."}, {"time": 1253, "text": "If you didn't drown, you got to graduate."}, {"time": 1254, "text": "Tied you up?"}, {"time": 1257, "text": "There were certainly versions of it, but I mean luckily they ended it just before I had to graduate because otherwise I would have never graduated."}, {"time": 1263, "text": "It wasn't going to happen."}, {"time": 1264, "text": "I want to say 84, 83, somewhere around then they ended it."}, {"time": 1268, "text": "But yeah, you used to have to prove you could tread water for some ridiculous amount of time or you couldn't graduate."}, {"time": 1274, "text": "Two minutes."}, {"time": 1274, "text": "No, it was more than two minutes."}, {"time": 1275, "text": "I bet it was two minutes."}, {"time": 1276, "text": "Okay, well we'll look at it."}, {"time": 1277, "text": "And it was in a bathtub."}, {"time": 1279, "text": "You could just stare."}, {"time": 1280, "text": "It was in a pool."}, {"time": 1280, "text": "But it was a real thing."}, {"time": 1281, "text": "But that idea that, you know, push you."}, {"time": 1283, "text": "Fully clothed."}, {"time": 1284, "text": "Yeah, fully clothed."}, {"time": 1285, "text": "I bet it was that and not tied up."}, {"time": 1287, "text": "Because who needs to learn how to swim when you're tied?"}, {"time": 1291, "text": "But who needs to learn to swim when you're actually falling into the water dressed?"}, {"time": 1294, "text": "That's a real thing."}, {"time": 1295, "text": "I think your facts are getting in the way with a good story."}, {"time": 1297, "text": "Oh, that's fair."}, {"time": 1299, "text": "I didn't mean to."}, {"time": 1300, "text": "All right, so they tie you up."}, {"time": 1300, "text": "Sometimes the narrative matters."}, {"time": 1301, "text": "But whatever it was, you had to, it was called drown proofing for a reason."}, {"time": 1304, "text": "The point of the story, Michael, is that it's, well, no, but that's good."}, {"time": 1310, "text": "It doesn't bring it back to struggle."}, {"time": 1312, "text": "That's a part of what Georgia Tech has always been."}, {"time": 1314, "text": "And we struggle with that, by the way, about what we want to be, particularly as things go."}, {"time": 1319, "text": "But you sort of, how much can you be pushed without breaking?"}, {"time": 1326, "text": "And you come out of the other end stronger, right?"}, {"time": 1328, "text": "There's a saying we used to have when I was an undergrad there."}, {"time": 1330, "text": "It was just Georgia Tech, building tomorrow the night before."}, {"time": 1334, "text": "And it was just kind of idea that, give me something impossible to do and I'll do it in a couple of days because that's what I just spent the last four or five or six years with."}, {"time": 1344, "text": "That ethos definitely stuck to you."}, {"time": 1346, "text": "Having now done a number of projects with you, you definitely will do it the night before."}, {"time": 1350, "text": "That's not entirely true."}, {"time": 1351, "text": "There's nothing wrong with waiting until the last minute."}, {"time": 1353, "text": "The secret is knowing when the last minute is."}, {"time": 1355, "text": "Right, that's brilliantly put."}, {"time": 1358, "text": "Yeah, that is a definite Charles statement that I am trying not to embrace."}, {"time": 1364, "text": "And I appreciate that because you helped move my last minute up."}, {"time": 1367, "text": "That's the social construct the way you converge together what the definition of last minute is."}, {"time": 1373, "text": "We figure that all out together."}, {"time": 1374, "text": "In fact, MIT, I'm sure a lot of universities have this, but MIT has like MIT time that everyone has always agreed together that there is such a concept and everyone just keeps showing up like 10 to 15 to 20, depending on the department, late to everything."}, {"time": 1391, "text": "So there's like a weird drift that happens."}, {"time": 1393, "text": "It's kind of fascinating."}, {"time": 1394, "text": "Yeah, we're five minutes."}, {"time": 1395, "text": "We're five minutes."}, {"time": 1396, "text": "In fact, the classes will say, well, this is no longer true actually, but it used to be a class that started at eight, but actually it started at eight oh five, it ends at nine, actually it ends at eight fifty five."}, {"time": 1406, "text": "Everything's five minutes off and nobody expects anything to start until five minutes after the half hour, whatever it is."}, {"time": 1411, "text": "It still exists."}, {"time": 1412, "text": "It hurts my head."}, {"time": 1413, "text": "Well, let's rewind the clock back to the fifties and sixties when you guys met, how did you, I'm just kidding, I don't know."}, {"time": 1420, "text": "But what, can you tell the story of how you met?"}, {"time": 1423, "text": "So you've, like the internet and the world kind of knows you as connected in some ways in terms of education of teaching the world."}, {"time": 1433, "text": "That's like the public facing thing, but how did you as human beings and as collaborators meet?"}, {"time": 1440, "text": "I think there's two stories."}, {"time": 1441, "text": "One is how we met and the other is how we got to know each other."}, {"time": 1446, "text": "I'm not gonna say fell in love."}, {"time": 1448, "text": "I'm gonna say that we came to understand that we Had some common something."}, {"time": 1454, "text": "Cause on the surface, I think we're different in a lot of ways, but there's something Yeah, I mean, now we complete each other's There you go."}, {"time": 1462, "text": "Afternoon."}, {"time": 1463, "text": "So I will tell the story of how we met and I'll let Michael tell the story of how we met."}, {"time": 1468, "text": "Okay, so here's how we met."}, {"time": 1470, "text": "I was already at that point, it was AT&T labs."}, {"time": 1472, "text": "There's a long, interesting story there."}, {"time": 1474, "text": "But anyway, I was there and Michael was coming to interview."}, {"time": 1478, "text": "He was a professor at Duke at the time, but decided for reasons that he wanted to be in New Jersey."}, {"time": 1485, "text": "And so that would mean Bell Labs slash AT&T labs."}, {"time": 1488, "text": "And we were doing the interview."}, {"time": 1489, "text": "Interviews are very much like academic interviews."}, {"time": 1491, "text": "And so I had to be there."}, {"time": 1493, "text": "We all had to meet with him afterwards and so on, one on one."}, {"time": 1496, "text": "But it was obvious to me that he was going to be hired."}, {"time": 1499, "text": "Like no matter what, because everyone loved him."}, {"time": 1501, "text": "They were just talking about all the great stuff he did."}, {"time": 1503, "text": "Oh, he did this great thing."}, {"time": 1504, "text": "And you had just won something at AAAI, I think."}, {"time": 1506, "text": "Or maybe you got 18 papers in AAAI that year."}, {"time": 1508, "text": "I got the best paper award at AAAI for the crossword stuff."}, {"time": 1512, "text": "So that had all happened and everyone was going on and on and on about it."}, {"time": 1514, "text": "Actually, so Tinder was saying incredibly nice things about you."}, {"time": 1519, "text": "He can be very grumpy."}, {"time": 1520, "text": "That's nice to hear."}, {"time": 1521, "text": "He was grumpily saying very nice things."}, {"time": 1522, "text": "Oh, that makes sense."}, {"time": 1523, "text": "And that does make sense."}, {"time": 1524, "text": "So, you know, it was going to come."}, {"time": 1525, "text": "So why was I meeting him?"}, {"time": 1528, "text": "I had something else I had to do."}, {"time": 1529, "text": "I can't remember what it was."}, {"time": 1529, "text": "It probably involved comedy."}, {"time": 1531, "text": "So he remembers meeting me as inconveniencing his afternoon."}, {"time": 1534, "text": "So he came."}, {"time": 1535, "text": "So I eventually came to my office."}, {"time": 1536, "text": "I was in the middle of trying to do something."}, {"time": 1537, "text": "I can't remember what."}, {"time": 1537, "text": "And he came and he sat down."}, {"time": 1538, "text": "And for reasons that are purely accidental, despite what Michael thinks, my desk at the time was set up in such a way that it had sort of an L shape."}, {"time": 1546, "text": "And the chair on the outside was always lower than the chair that I was in."}, {"time": 1550, "text": "And, you know, the kind of point was to..."}, {"time": 1552, "text": "The only reason I think that it was on purpose is because you told me it was on purpose."}, {"time": 1556, "text": "I don't remember that."}, {"time": 1557, "text": "Anyway, the thing is, is that, you know, it kind of gives... His guest chair was really low so that he could look down at everybody."}, {"time": 1562, "text": "The idea was just to simply create a nice environment that you were asking for a mortgage and I was going to say no."}, {"time": 1567, "text": "That was the point."}, {"time": 1567, "text": "It was a very simple idea here."}, {"time": 1569, "text": "Anyway, so we sat there and we just talked for a little while."}, {"time": 1572, "text": "And I think he got the impression that I didn't like him."}, {"time": 1574, "text": "Which wasn't true."}, {"time": 1575, "text": "I strongly got that impression."}, {"time": 1576, "text": "The talk was really good."}, {"time": 1576, "text": "The talk, by the way, was terrible."}, {"time": 1578, "text": "And right after the talk, I said to my host, Michael Kearns, who ultimately was my boss."}, {"time": 1583, "text": "I'm a huge fan."}, {"time": 1584, "text": "I'm a friend and a huge fan of Michael, yeah."}, {"time": 1585, "text": "Yeah, he is a remarkable person."}, {"time": 1589, "text": "After my talk, I went into the..."}, {"time": 1590, "text": "He went into basketball."}, {"time": 1592, "text": "I went... Racquetball, he's good at everything."}, {"time": 1594, "text": "No, basketball."}, {"time": 1594, "text": "No, but basketball and racquetball too."}, {"time": 1596, "text": "Squash."}, {"time": 1596, "text": "Squash, squash, squash, not racquetball."}, {"time": 1598, "text": "Yes, squash, which is not... Racquetball, yes."}, {"time": 1601, "text": "Squash, no."}, {"time": 1602, "text": "And I hope you hear that, Michael."}, {"time": 1603, "text": "Oh, Michael Kearns."}, {"time": 1605, "text": "As a game, not his skill level, because I'm pretty sure he's... All right, there's some competitiveness there, but the point is that it was like the middle of the day, I had full day of interviews."}, {"time": 1615, "text": "I got met with people, but then in the middle of the day, I gave a job talk."}, {"time": 1618, "text": "And then there was gonna be more interviews, but I pulled Michael aside and I said, I think it's in both of our best interest if I just leave now, because that was so bad that it'd just be embarrassing if I have to talk to any more people."}, {"time": 1634, "text": "You look bad for having invited me."}, {"time": 1636, "text": "It's just, let's just forget this ever happened."}, {"time": 1639, "text": "So I don't think the talk went well."}, {"time": 1641, "text": "That's one of the most Michael Lipman set of sentences I think I've ever heard."}, {"time": 1644, "text": "He did great, or at least everyone knew he was great, so maybe it didn't matter."}, {"time": 1648, "text": "I was there, I remember the talk, and I remember him being very much the way I remember him now, on any given week."}, {"time": 1653, "text": "So it was good."}, {"time": 1654, "text": "And we met and we talked about stuff."}, {"time": 1656, "text": "He thinks I didn't like him, but... Because he was so grumpy."}, {"time": 1659, "text": "Must've been the chair thing."}, {"time": 1660, "text": "The chair thing and the low voice, I think."}, {"time": 1662, "text": "But like, he obviously... And that slight skeptical look."}, {"time": 1668, "text": "I have no idea what you're talking about."}, {"time": 1670, "text": "Well, I probably didn't have any idea what you were talking about."}, {"time": 1673, "text": "Anyway, I liked him."}, {"time": 1674, "text": "He asked me questions, I answered questions."}, {"time": 1676, "text": "I felt bad about myself."}, {"time": 1677, "text": "It was a normal day."}, {"time": 1680, "text": "And then he left."}, {"time": 1681, "text": "And then he left, and that's how you met."}, {"time": 1683, "text": "Can we take a... And then I got hired and I was in the group."}, {"time": 1685, "text": "Can we take a slight tangent on this topic of, it sounds like, maybe you could speak to the bigger picture."}, {"time": 1692, "text": "It sounds like you're quite self critical."}, {"time": 1695, "text": "Who, Charles?"}, {"time": 1695, "text": "No, you."}, {"time": 1697, "text": "I can do better."}, {"time": 1699, "text": "Try me again."}, {"time": 1700, "text": "I'll do better."}, {"time": 1701, "text": "I'll be so self critical."}, {"time": 1704, "text": "Yeah, that was like a three out of 10 response."}, {"time": 1706, "text": "So let's try to work it up to five and six."}, {"time": 1710, "text": "Yeah, I remember Marvin Minsky said on a video interview, something that the key to success in academic research is to hate everything you do."}, {"time": 1723, "text": "For some reason..."}, {"time": 1724, "text": "I think I followed that because I hate everything he's done."}, {"time": 1729, "text": "That's a six out of 10."}, {"time": 1732, "text": "Maybe that's a keeper."}, {"time": 1733, "text": "But do you find that resonates with you at all in how you think about talks and so on?"}, {"time": 1739, "text": "I would say it differently."}, {"time": 1740, "text": "It's not that."}, {"time": 1742, "text": "That's such an MIT view of the world though."}, {"time": 1744, "text": "So I remember talking about this when, as a student, you were basically told I will clean it up for the purpose of the podcast."}, {"time": 1753, "text": "My work is crap."}, {"time": 1756, "text": "Then you go to a conference or something."}, {"time": 1757, "text": "You're like, everybody else's work is crap."}, {"time": 1758, "text": "Everybody else's work is crap."}, {"time": 1759, "text": "And you feel better and better about it, relatively speaking."}, {"time": 1763, "text": "And then you sort of keep working on it."}, {"time": 1765, "text": "I don't hate my work."}, {"time": 1766, "text": "That resonates with me."}, {"time": 1767, "text": "Yes, I've never hated my work, but I have been dissatisfied with it."}, {"time": 1773, "text": "And I think being dissatisfied, being okay with the fact that you've taken a positive step, the derivative's positive, maybe even the second derivative's positive, that's important because that's a part of the hope, right?"}, {"time": 1785, "text": "But you have to, but I haven't gotten there yet."}, {"time": 1787, "text": "If that's not there, that I haven't gotten there yet, then it's hard to move forward, I think."}, {"time": 1793, "text": "So I buy that, which is a little different from hating everything that you do."}, {"time": 1796, "text": "Yeah, I mean, there's things that I've done that I like better than I like myself."}, {"time": 1801, "text": "So it's separating me from the work, essentially."}, {"time": 1804, "text": "So I think I am very critical of myself, but sometimes the work I'm really excited about."}, {"time": 1808, "text": "And sometimes I think it's kind of good."}, {"time": 1810, "text": "Does that happen right away?"}, {"time": 1811, "text": "So I found the work that I've liked, that I've done, most of it, I liked it in retrospect more when I was far away from it in time."}, {"time": 1821, "text": "I have to be fairly excited about it to get done."}, {"time": 1824, "text": "No, excited at the time, but then happy with the result."}, {"time": 1826, "text": "But years later, or even I might go back, you know what, that actually turned out to matter."}, {"time": 1831, "text": "That turned out to matter."}, {"time": 1832, "text": "Or, oh gosh, it turns out I've been thinking about that."}, {"time": 1834, "text": "It's actually influenced all the work that I've done since without realizing it."}, {"time": 1837, "text": "Boy, that guy was smart."}, {"time": 1839, "text": "Yeah, that guy had a future."}, {"time": 1841, "text": "Yeah, I think there's something to it."}, {"time": 1847, "text": "I think there's something to the idea you've got to hate what you do, but it's not quite hate."}, {"time": 1850, "text": "It's just being unsatisfied."}, {"time": 1852, "text": "And different people motivate themselves differently."}, {"time": 1854, "text": "I don't happen to motivate myself with self loathing."}, {"time": 1856, "text": "I happen to motivate myself with something else."}, {"time": 1858, "text": "So you're able to sit back and be proud of, in retrospect, of the work you've done."}, {"time": 1864, "text": "Well, and it's easier when you can connect it with other people, because then you can be proud of them."}, {"time": 1868, "text": "Proud of the people, yeah."}, {"time": 1870, "text": "And then the question is."}, {"time": 1871, "text": "You can still safely hate yourself."}, {"time": 1873, "text": "It's win, win, Michael."}, {"time": 1875, "text": "Or at least win, lose, which is what you're looking for."}, {"time": 1878, "text": "Oh, wow, there's so many brilliant minds in this."}, {"time": 1882, "text": "There's levels."}, {"time": 1883, "text": "So how did you actually meet me?"}, {"time": 1886, "text": "Yeah, Michael."}, {"time": 1886, "text": "So the way I think about it is, because we didn't do much research together at AT&T, but then we all got laid off."}, {"time": 1894, "text": "So that sucked."}, {"time": 1896, "text": "By the way, sorry to interrupt, but that was one of the most magical places historically speaking."}, {"time": 1902, "text": "They did not appreciate what they had."}, {"time": 1905, "text": "And how do we, I feel like there's a profound lesson in there too."}, {"time": 1910, "text": "How do we get it, like what was, why was it so magical?"}, {"time": 1913, "text": "Is it just a coincidence of history?"}, {"time": 1914, "text": "Or is there something special about?"}, {"time": 1916, "text": "There were some really good managers and people who really believed in machine learning as this is gonna be important."}, {"time": 1923, "text": "Let's get the people who are thinking about this in creative and insightful ways and put them in one place and stir."}, {"time": 1930, "text": "Yeah, but even beyond that, right?"}, {"time": 1931, "text": "It was Bell Labs at its heyday."}, {"time": 1935, "text": "And even when we were there, which I think was past its heyday."}, {"time": 1937, "text": "And to be clear, he's gotten to be at Bell Labs."}, {"time": 1939, "text": "I never got to be at Bell Labs."}, {"time": 1941, "text": "I joined after that."}, {"time": 1942, "text": "Yeah, I showed up in 91 as a grad student."}, {"time": 1944, "text": "So I was there for a long time, every summer, except for two."}, {"time": 1948, "text": "So twice I worked for companies that had just stopped being Bell Labs."}, {"time": 1951, "text": "Bellcore and then AT&T Labs."}, {"time": 1953, "text": "So Bell Labs was several locations or for the research or is it one?"}, {"time": 1958, "text": "I don't know if Jersey's involved somehow."}, {"time": 1961, "text": "They're all in Jersey."}, {"time": 1962, "text": "But they were in a couple of places in Jersey."}, {"time": 1964, "text": "Murray Hill was the Bell Labs place."}, {"time": 1967, "text": "So you had an office in Murray Hill at one point in your career."}, {"time": 1971, "text": "Yeah, and I played Ultimate Frisbee on the cricket pitch at Bell Labs at Murray Hill."}, {"time": 1976, "text": "And then it became AT&T Labs when it split off with loose during what we called Trivestiture."}, {"time": 1980, "text": "Are you better than Michael Korn's at Ultimate Frisbee?"}, {"time": 1985, "text": "But I think that one's not boasting."}, {"time": 1986, "text": "I think Charles plays a lot of Ultimate and I don't think Michael does."}, {"time": 1990, "text": "Yes, but that wasn't the point."}, {"time": 1992, "text": "The point is yes."}, {"time": 1992, "text": "I'm finally better."}, {"time": 1994, "text": "Okay, I have played on a championship winning Ultimate Frisbee team or whatever, Ultimate team with Charles."}, {"time": 2000, "text": "So I know how good he is."}, {"time": 2002, "text": "He's really good."}, {"time": 2003, "text": "How good I was anyway, when I was younger."}, {"time": 2004, "text": "But the thing is."}, {"time": 2005, "text": "I know how young he was when he was younger."}, {"time": 2007, "text": "So much younger than now."}, {"time": 2008, "text": "He's older now."}, {"time": 2009, "text": "Yeah, I'm older."}, {"time": 2010, "text": "Michael was a much better basketball player than I was."}, {"time": 2013, "text": "Michael Kearns."}, {"time": 2014, "text": "Yes, no, not Michael."}, {"time": 2016, "text": "Let's be very clear about that."}, {"time": 2017, "text": "To be clear, I've not played basketball with you."}, {"time": 2018, "text": "So you don't know how terrible I am, but you have a probably pretty good guess."}, {"time": 2022, "text": "And that you're not as good as Michael Kearns."}, {"time": 2024, "text": "He's tall and athletic."}, {"time": 2025, "text": "And he cared about it."}, {"time": 2026, "text": "He's very athletic."}, {"time": 2027, "text": "He's very good."}, {"time": 2028, "text": "And probably competitive."}, {"time": 2029, "text": "I love hanging out with Michael."}, {"time": 2030, "text": "Anyway, but we were talking about something else, although I no longer remember what it was."}, {"time": 2032, "text": "What were we talking about?"}, {"time": 2033, "text": "Oh, Bell Labs."}, {"time": 2035, "text": "But also Labs."}, {"time": 2036, "text": "So this was kind of cool about what was magical about it."}, {"time": 2040, "text": "The first thing you have to know is that Bell Labs was an arm of the government, right?"}, {"time": 2043, "text": "Because AT&T was an arm of the government."}, {"time": 2045, "text": "It was a monopoly."}, {"time": 2047, "text": "And every month you paid a little thing on your phone bill, which turned out was a tax for all the research that Bell Labs was doing."}, {"time": 2054, "text": "And they invented transistors and the laser and whatever else is that they did."}, {"time": 2057, "text": "The Big Bang or whatever, the cosmic background radiation."}, {"time": 2060, "text": "Yeah, they did all that stuff."}, {"time": 2061, "text": "They had some amazing stuff with directional microphones, by the way."}, {"time": 2064, "text": "I got to go in this room where they had all these panels and everything."}, {"time": 2067, "text": "And we would talk and one another, and he'd move some panels around."}, {"time": 2070, "text": "And then he would have me step two steps to the left."}, {"time": 2073, "text": "And I couldn't hear a thing he was saying because nothing was bouncing off the walls."}, {"time": 2077, "text": "And then he would shut it all down and you could hear your heartbeat, which is deeply disturbing to hear your heartbeat."}, {"time": 2083, "text": "You can feel it."}, {"time": 2084, "text": "I mean, you can feel it now."}, {"time": 2084, "text": "There's just so much all this sort of noise around."}, {"time": 2086, "text": "Anyway, Bell Labs was about pure research."}, {"time": 2088, "text": "It was a university, in some sense, the purest sense of a university, but without students."}, {"time": 2093, "text": "So it was all the faculty working with one another and students would come in to learn."}, {"time": 2097, "text": "They would come in for three or four months during the summer and they would go away."}, {"time": 2100, "text": "But it was just this kind of wonderful experience."}, {"time": 2102, "text": "I could walk out my door."}, {"time": 2104, "text": "In fact, I would often have to walk out my door and deal with Rich Sutton and Michael Kearns yelling at each other about whatever it is they were yelling about the proper way to prove something or another."}, {"time": 2114, "text": "And I could just do that."}, {"time": 2115, "text": "And Dave McAllister and Peter Stone and all of these other people, including, it's a tender and then eventually Michael."}, {"time": 2122, "text": "And it was just a place where you could think thoughts."}, {"time": 2125, "text": "And it was okay because so long as once every 25 years or so somebody invented a transistor, it paid for everything else."}, {"time": 2131, "text": "You could afford to take the risk."}, {"time": 2134, "text": "And then when that all went away, it became harder and harder and harder to justify it as far as the folks who were very far away were concerned."}, {"time": 2141, "text": "And there was such a fast turnaround among mental management on the AT&T side that you never had a chance to really build a relationship."}, {"time": 2148, "text": "At least people like us didn't have a chance to build a relationship."}, {"time": 2151, "text": "So when the diaspora happened, it was amazing, right?"}, {"time": 2155, "text": "Everybody left and I think everybody ended up at a great place and made a huge, continued to do really good work with machine learning."}, {"time": 2162, "text": "But it was a wonderful place."}, {"time": 2163, "text": "And people will ask me, what's the best job you've ever had?"}, {"time": 2167, "text": "And as a professor, anyway, the answer that I would give is well, probably Bell Labs in some very real sense."}, {"time": 2176, "text": "And I will never have a job like that again because Bell Labs doesn't exist anymore."}, {"time": 2179, "text": "And Microsoft research is great and Google does good stuff."}, {"time": 2182, "text": "And you can pick IBM, you can tell if you want to, but Bell Labs was magical."}, {"time": 2185, "text": "It was around for, it was an important time and it represents a high watermark in basic research in the US."}, {"time": 2192, "text": "Is there something you could say about the physical proximity and the chance collisions?"}, {"time": 2196, "text": "Like we live in this time of the pandemic where everyone is maybe trying to see the silver lining and accepting the remote nature of things."}, {"time": 2206, "text": "Is there one of the things that people like faculty that I talk to miss is the procrastination."}, {"time": 2217, "text": "Like the chance to make everything is about meetings that are supposed to be, there's not a chance to just talk about comic book or whatever, like go into discussion that's totally pointless."}, {"time": 2227, "text": "So it's funny you say this because that's how we met, met, it was exactly that."}, {"time": 2231, "text": "So I'll let Michael say that, but I'll just add one thing which is just that research is a social process and it helps to have random social interactions even if they don't feel social at the time, that's how you get things done."}, {"time": 2242, "text": "One of the great things about the AI Lab when I was there, I don't quite know what it looks like now once they moved buildings, but we had entire walls that were whiteboards and people would just get up there and they were just right and people would walk up and you'd have arguments and you'd explain things to one another and you got so much out of the freedom to do that."}, {"time": 2259, "text": "You had to be okay with people challenging every fricking word you said, which I would sometimes find deeply irritating, but most of the time it was quite useful."}, {"time": 2269, "text": "But the sort of pointlessness and the interaction was in some sense the point, at least for me."}, {"time": 2274, "text": "Yeah, I think offline yesterday I mentioned Josh Tenenbaum and he's very much, he's a man, he's such an inspiration in the childlike way that he pulls you in on any topic."}, {"time": 2287, "text": "It doesn't even have to be about machine learning or the brain, he'll just pull you in to a closest writable surface, which is still, you can find whiteboards at MIT everywhere, and just like basically cancel all meetings and talk for a couple hours about some aimless thing and it feels like the whole world, the time space continuum kind of warps and that becomes the most important thing."}, {"time": 2312, "text": "And then it's just, it's definitely something worth missing in this world where everything's remote."}, {"time": 2320, "text": "There's some magic to the physical presence."}, {"time": 2322, "text": "Whenever I wonder myself whether MIT really is as great as I remember it, I just go talk to Josh."}, {"time": 2328, "text": "Yeah, you know, that's funny."}, {"time": 2329, "text": "There's a few people in this world that carry the best of what particular institutions stand for, right?"}, {"time": 2337, "text": "It's Josh."}, {"time": 2338, "text": "I mean, I don't, my guess is he's unaware of this."}, {"time": 2342, "text": "That the masters are not aware of their mastery."}, {"time": 2347, "text": "How did we meet?"}, {"time": 2349, "text": "Yes, but first a tangent, no."}, {"time": 2353, "text": "How did you meet me?"}, {"time": 2354, "text": "So I'm not sure what you were thinking, but when it started to dawn on me that maybe we had a longer term bond was after we all got laid off."}, {"time": 2363, "text": "And you had decided at that point that we were still paid."}, {"time": 2368, "text": "We were given an opportunity to like do a job search and kind of make a transition, but it was clear that we were done."}, {"time": 2375, "text": "And I would go to my office to work and you would go to my office to keep me from working."}, {"time": 2381, "text": "That was my recollection of it."}, {"time": 2383, "text": "You had decided that there was no, really no point in working for the company because our relationship with the company was done."}, {"time": 2389, "text": "Yeah, but remember I felt that way beforehand."}, {"time": 2391, "text": "It wasn't about the company."}, {"time": 2392, "text": "It was about the set of people there doing really cool things."}, {"time": 2394, "text": "And it always, always been that way."}, {"time": 2395, "text": "But we were working on something together."}, {"time": 2399, "text": "So at the very end, we all got laid off, but then our boss came to, our boss's boss came to us because our boss was Michael Kearns and he had jumped ship brilliantly, like perfect timing."}, {"time": 2408, "text": "Like things like right before the ship was about to sink, he was like, gotta go and landed perfectly because Michael Kearns."}, {"time": 2418, "text": "Because Michael Kearns."}, {"time": 2419, "text": "And leaving the rest of us to go like, this is fine."}, {"time": 2423, "text": "And then it was clear that it wasn't fine and we were all toast."}, {"time": 2427, "text": "So we had this sort of long period of time."}, {"time": 2429, "text": "But then our boss figured out, okay, wait, maybe we can save a couple of these people if we can have them do something really useful."}, {"time": 2437, "text": "And the useful thing was we were gonna make basically an automated assistant that could help you with your calendar."}, {"time": 2443, "text": "You could like tell it things and it would respond appropriately."}, {"time": 2447, "text": "It would just kind of integrate across all sorts of your personal information."}, {"time": 2453, "text": "And so me and Charles and Peter Stone were set up as the crack team to actually solve this problem."}, {"time": 2460, "text": "Other people maybe were too theoretical that they thought, but we could actually get something done."}, {"time": 2465, "text": "So we sat down to get something done and there wasn't time and it wouldn't have saved us anyway."}, {"time": 2470, "text": "And so it all kind of went downhill."}, {"time": 2472, "text": "But the interesting, I think, coda to that is that our boss's boss is a guy named Ron Brockman."}, {"time": 2478, "text": "And when he left AT&T, cause we were all laid off, he went to DARPA, started up a program there that became KALO, which is the program from which Siri sprung, which is a digital assistant that helps you with your calendar and a bunch of other things."}, {"time": 2497, "text": "It really, in some ways got its start with me and Charles and Peter trying to implement this vision that Ron Brockman had, that he ultimately got implemented through his role at DARPA."}, {"time": 2509, "text": "So when I'm trying to feel less bad about having been laid off from what is possibly the greatest job of all time, I think about, well, we kind of helped birth Siri."}, {"time": 2521, "text": "And then he did other things too."}, {"time": 2523, "text": "But we got to spend a lot of time in his office and talk about lots of things."}, {"time": 2527, "text": "We got to spend a lot of time in my office, yeah."}, {"time": 2531, "text": "And so then we went on our merry way."}, {"time": 2533, "text": "Everyone went to different places."}, {"time": 2535, "text": "Charles landed at Georgia Tech, which was what he always dreamed he would do."}, {"time": 2540, "text": "And so that worked out well."}, {"time": 2543, "text": "I came up with a saying at the time, which is luck favors the Charles."}, {"time": 2547, "text": "It's kind of like luck favors the prepared, but Charles, like he wished something and then it would basically happen just the way he wanted."}, {"time": 2555, "text": "It was inspirational to see things go that way."}, {"time": 2558, "text": "Things worked out."}, {"time": 2559, "text": "And we stayed in touch."}, {"time": 2560, "text": "And then I think it really helped when you were working on, I mean, you'd kept me in the loop for things like threads and the work that you were doing at Georgia Tech."}, {"time": 2569, "text": "But then when they were starting their online master's program, he knew that I was really excited about MOOCs and online teaching."}, {"time": 2576, "text": "And he's like, I have a plan."}, {"time": 2577, "text": "And I'm like, tell me your plan."}, {"time": 2578, "text": "He's like, I can't tell you the plan yet."}, {"time": 2580, "text": "Cause they were deep in negotiations between Georgia Tech and Udacity to make this happen."}, {"time": 2585, "text": "And they didn't want it to leak."}, {"time": 2587, "text": "So Charles would kept teasing me about it, but wouldn't tell me what was actually going on."}, {"time": 2590, "text": "And eventually it was announced and he said, I would like you to teach the machine learning course with me."}, {"time": 2595, "text": "I'm like, that can't possibly work."}, {"time": 2598, "text": "But it was a great idea."}, {"time": 2599, "text": "And it was super fun."}, {"time": 2600, "text": "It was a lot of work to put together, but it was really great."}, {"time": 2603, "text": "Was that the first time you thought about, first of all, was it the first time you got seriously into teaching?"}, {"time": 2610, "text": "I mean, I was a professor."}, {"time": 2612, "text": "This was already after you jumped to, so like there's a little bit of jumping around in time."}, {"time": 2618, "text": "Yeah, sorry about that."}, {"time": 2619, "text": "There's a pretty big jump in time."}, {"time": 2620, "text": "So like the MOOCs thing."}, {"time": 2622, "text": "So Charles got to Georgia Tech and he, I mean, maybe Charles, maybe this is a Charles story."}, {"time": 2626, "text": "I got to Georgia Tech in 2002."}, {"time": 2627, "text": "He got to Georgia Tech in 2002."}, {"time": 2629, "text": "And worked on things like revamping the curriculum, the undergraduate curriculum, so that it had some kind of semblance of modular structure because computer science was at the time moving from a fairly narrow specific set of topics to touching a lot of other parts of intellectual life."}, {"time": 2648, "text": "And the curriculum was supposed to reflect that."}, {"time": 2650, "text": "And so Charles played a big role in kind of redesigning that."}, {"time": 2655, "text": "And then the."}, {"time": 2656, "text": "And for my labors, I ended up as associate dean."}, {"time": 2660, "text": "Right, he got to become associate dean of charge of educational stuff."}, {"time": 2664, "text": "Yeah, I was under."}, {"time": 2665, "text": "This should be a valuable lesson."}, {"time": 2666, "text": "If you're good at something, they will give you responsibility to do more of that thing."}, {"time": 2674, "text": "Until you."}, {"time": 2675, "text": "Don't show competence."}, {"time": 2676, "text": "Don't show competence if you."}, {"time": 2677, "text": "Don't want responsibility."}, {"time": 2678, "text": "Here's what they say."}, {"time": 2680, "text": "The reward for good work is more work."}, {"time": 2683, "text": "The reward for bad work is less work."}, {"time": 2687, "text": "Which, I don't know."}, {"time": 2688, "text": "Depending on what you're trying to do that week, one of those is better than the other."}, {"time": 2691, "text": "Well, one of the problems with the word work, sorry to interrupt, is that it seems to be an antonym in this particular language."}, {"time": 2699, "text": "We have the opposite of happiness."}, {"time": 2701, "text": "But it seems like they're."}, {"time": 2702, "text": "That's one of, you know, we talked about balance."}, {"time": 2707, "text": "It's always like work life balance."}, {"time": 2709, "text": "It always rubbed me the wrong way as a terminology."}, {"time": 2712, "text": "I know it's just words."}, {"time": 2713, "text": "Right, the opposite of work is play."}, {"time": 2715, "text": "But ideally, work is play."}, {"time": 2717, "text": "Oh, I can't tell you how much time I'd spend."}, {"time": 2720, "text": "Certainly, when I was at Bell Labs, except for a few very key moments, as a professor, I would do this too."}, {"time": 2725, "text": "I would just say, I cannot believe they're paying me to do this."}, {"time": 2728, "text": "Because it's fun."}, {"time": 2729, "text": "It's something that I would do for a hobby if I could anyway."}, {"time": 2734, "text": "So that sort of worked out."}, {"time": 2735, "text": "Are you sure you want to be saying that when this is being recorded?"}, {"time": 2738, "text": "As a dean, that is not true at all."}, {"time": 2740, "text": "I need a raise."}, {"time": 2742, "text": "But I think here with this, even though a lot of time passed, Mike and I talked almost every, well, we texted, almost every day during the period."}, {"time": 2749, "text": "Charles, at one point, took me, the ICML conference, the machine learning conference was in Atlanta."}, {"time": 2757, "text": "I was the chair, the general chair of the conference."}, {"time": 2760, "text": "Charles was my publicity chair or something like that, or fundraising chair."}, {"time": 2765, "text": "Yeah, but he decided it'd be really funny if he didn't actually show up for the conference in his own home city."}, {"time": 2771, "text": "So he didn't, but he did at one point pick me up at the conference in his Tesla and drove me to the Atlanta mall and forced me to buy an iPhone because he didn't like how it was to text with me and thought it would be better for him if I had an iPhone, the text would be somehow smoother."}, {"time": 2790, "text": "And it was."}, {"time": 2792, "text": "And it is, and his life is better."}, {"time": 2792, "text": "And my life is better."}, {"time": 2793, "text": "And so, yeah, but it was, yeah, Charles forced me to get an iPhone so that he could text me more efficiently."}, {"time": 2800, "text": "I thought that was an interesting moment."}, {"time": 2802, "text": "It works for me."}, {"time": 2802, "text": "Anyway, so we kept talking the whole time and then eventually we did the teaching thing and it was great."}, {"time": 2807, "text": "And there's a couple of reasons for that, by the way."}, {"time": 2808, "text": "One is I really wanted to do something different."}, {"time": 2811, "text": "Like you've got this medium here, people claim it can change things."}, {"time": 2814, "text": "What's a thing that you could do in this medium that you could not do otherwise besides edit, right?"}, {"time": 2820, "text": "I mean, what could you do?"}, {"time": 2821, "text": "And being able to do something with another person was that kind of thing."}, {"time": 2825, "text": "I mean, you can take turns, but teaching together, having conversations is very hard."}, {"time": 2829, "text": "So that was a cool thing."}, {"time": 2830, "text": "The second thing, give me an excuse to do more stuff with him."}, {"time": 2832, "text": "Yeah, I always thought, he makes it sound brilliant."}, {"time": 2835, "text": "And it is, I guess."}, {"time": 2837, "text": "But at the time it really felt like I've got a lot to do, Charles is saying, and it would be great if Michael could teach the course and I could just hang out."}, {"time": 2847, "text": "Yeah, just kind of coast on that."}, {"time": 2849, "text": "Well, that's what the second class was more like that."}, {"time": 2851, "text": "Because the second class was explicitly like that."}, {"time": 2853, "text": "But the first class, it was at least half."}, {"time": 2856, "text": "Yeah, but I do all the stuff."}, {"time": 2857, "text": "So the structure that we came up with."}, {"time": 2857, "text": "I think you're once again letting the facts get in the way of a good story."}, {"time": 2862, "text": "I should just let Charles talk to us."}, {"time": 2864, "text": "But that's the facts that he saw."}, {"time": 2866, "text": "So that was kind of true for 7642."}, {"time": 2868, "text": "Yeah, that was sort of true for 7642, which is the reinforcement learning class, because that was really his class."}, {"time": 2872, "text": "You started with reinforcement learning or machine learning?"}, {"time": 2875, "text": "Intro machine learning, 7641, which is supervised learning, unsupervised learning, and reinforcement learning and decision making, cram all that in there, the kind of assignments that we talked about earlier."}, {"time": 2884, "text": "And then eventually, about a year later, we did a follow on 7642, which is reinforcement learning and decision making."}, {"time": 2890, "text": "The first class was based on something I'd been teaching at that point for well over a decade."}, {"time": 2894, "text": "And the second class was based on something Michael had been teaching."}, {"time": 2897, "text": "Actually, I learned quite a bit teaching that class with him, but he drove most of that."}, {"time": 2901, "text": "But the first one I drove most, it was all my material."}, {"time": 2903, "text": "Although I had stolen that material originally from slides I found online from Michael, who had originally stolen that material from, I guess, slides he found online, probably from Andrew Moore, because the jokes were the same anyway."}, {"time": 2914, "text": "At least some of the, at least when I found the slides, some of the stuff with it."}, {"time": 2918, "text": "Yes, every machine learning class taught in the early 2000s stole from Andrew Moore."}, {"time": 2921, "text": "A particular joke or two?"}, {"time": 2923, "text": "At least the structure."}, {"time": 2924, "text": "Now, I did, and he did, actually, a lot more with reinforcement learning and such, and game theory and those kinds of things."}, {"time": 2930, "text": "But, you know, we all sort of built in."}, {"time": 2931, "text": "You mean in the research world?"}, {"time": 2932, "text": "No, no, no, in that class."}, {"time": 2934, "text": "No, I mean in teaching that class."}, {"time": 2934, "text": "The coverage was different than what we started."}, {"time": 2937, "text": "Most people were just doing supervised learning and maybe a little bit of clustering and whatnot, but we took it all the way to machine learning."}, {"time": 2943, "text": "A lot of it just comes from Tom Mitchell's book."}, {"time": 2944, "text": "Oh, no, yeah, except, well, half of it comes from Tom Mitchell's book, right?"}, {"time": 2947, "text": "I mean, the other half doesn't."}, {"time": 2950, "text": "This is why it's all readings, right?"}, {"time": 2952, "text": "Because certain things weren't invented when Tom wrote that stuff."}, {"time": 2954, "text": "Yeah, okay, that's true."}, {"time": 2955, "text": "All right, but it was quite good."}, {"time": 2957, "text": "But there's a reason for that besides, you know, just, I wanted to do it."}, {"time": 2961, "text": "I wanted to do something new, and I wanted to do something with him, which is a realization, which is despite what you might believe, he's an introvert and I'm an introvert, or I'm on the edge of being an introvert anyway."}, {"time": 2972, "text": "But both of us, I think, enjoy the energy of the crowd, right?"}, {"time": 2977, "text": "There's something about talking to people and bringing them into whatever we find interesting that is empowering, energizing, or whatever."}, {"time": 2985, "text": "And I found the idea of staring alone at a computer screen and then talking off of materials less inspiring than I wanted it to be."}, {"time": 2995, "text": "And I had in fact done a MOOC for Udacity on algorithms."}, {"time": 2999, "text": "And it was a week in a dark room talking at the screen, writing on the little pad."}, {"time": 3007, "text": "And I didn't know this was happening, but they had watched, the crew had watched some of the videos while, you know, like in the middle of this, and they're like, something's wrong."}, {"time": 3015, "text": "You're sort of shutting down."}, {"time": 3019, "text": "And I think a lot of it was I'll make jokes and no one would laugh."}, {"time": 3024, "text": "And I felt like the crowd hated me."}, {"time": 3026, "text": "Now, of course, there was no crowd."}, {"time": 3027, "text": "So like, it wasn't rational."}, {"time": 3029, "text": "But each time I tried it and I got no reaction, it just was taking the energy out of my performance, out of my presentation."}, {"time": 3038, "text": "Such a fantastic metaphor for grad school."}, {"time": 3040, "text": "Anyway, by working together, we could play off each other and have a good time."}, {"time": 3044, "text": "And keep the energy up, because you can't let your guard down for a moment with Charles, he'll just overpower you."}, {"time": 3052, "text": "But we would work really well together, I thought, and we knew each other, so I knew that we could sort of make it work."}, {"time": 3056, "text": "Plus, I was the associate dean, so they had to do what I told them to do."}, {"time": 3060, "text": "We had to make it work."}, {"time": 3061, "text": "And so it worked out very well, I thought, well enough that we."}, {"time": 3064, "text": "With great power comes great power."}, {"time": 3067, "text": "And we became smooth and curly."}, {"time": 3069, "text": "And that's when we did the overfitting thriller video."}, {"time": 3075, "text": "Yeah, that's a thing."}, {"time": 3077, "text": "So can we just, like, smooth and curly, where did that come from?"}, {"time": 3081, "text": "Okay, so it happened."}, {"time": 3083, "text": "It was completely spontaneous."}, {"time": 3084, "text": "These are nicknames you go by."}, {"time": 3085, "text": "Yeah, so it's what the students call us."}, {"time": 3088, "text": "He was lecturing."}, {"time": 3090, "text": "So the way that we structured the lectures is one of us is the lecturer and one of us is basically the student."}, {"time": 3095, "text": "And so he was lecturing on."}, {"time": 3097, "text": "The lecturer prepares all the materials, comes up with the quizzes, and then the student comes in not knowing anything."}, {"time": 3103, "text": "So it was just like being on campus."}, {"time": 3105, "text": "And I was doing game theory in particular, the Prisoner's Dilemma."}, {"time": 3108, "text": "Prisoner's Dilemma."}, {"time": 3109, "text": "And so he needed to set up a little Prisoner's Dilemma grid."}, {"time": 3112, "text": "So he drew it and I could see what he was drawing."}, {"time": 3114, "text": "And the Prisoner's Dilemma consists of two players, two parties."}, {"time": 3118, "text": "So he decided he would make little cartoons of the two of us."}, {"time": 3121, "text": "And so there was two criminals, right, that were deciding whether or not to rat each other out."}, {"time": 3127, "text": "One of them he drew as a circle with a smiley face and a kind of goatee thing, smooth head."}, {"time": 3134, "text": "And the other one with all sorts of curly hair."}, {"time": 3136, "text": "And he said, this is smooth and curly."}, {"time": 3138, "text": "I said, smooth and curly?"}, {"time": 3139, "text": "He said, no, no, smooth with a V. It's very important that it have a V. And then the students really took to that."}, {"time": 3147, "text": "Like they found that relatable."}, {"time": 3149, "text": "He started singing Smooth Criminal by Michael Jackson."}, {"time": 3152, "text": "And those names stuck."}, {"time": 3153, "text": "So we now have a video series, an episode, our kind of first actual episode should be coming out today, Smooth and Curly on video, where the two of us discuss episodes of Westworld."}, {"time": 3167, "text": "We watch Westworld and we're like, huh, what does this say about computer science and AI?"}, {"time": 3171, "text": "And we've never, we did not watch it."}, {"time": 3173, "text": "I mean, no, it's on season three or whatever we have."}, {"time": 3175, "text": "As of this recording, it's on season three."}, {"time": 3177, "text": "We've watched now two episodes total."}, {"time": 3179, "text": "Yeah, I think I watched three."}, {"time": 3181, "text": "What do you think about Westworld?"}, {"time": 3182, "text": "Two episodes in."}, {"time": 3183, "text": "So I can tell you so far, I'm just guessing what's gonna happen next."}, {"time": 3188, "text": "It seems like bad things are gonna happen with the robots uprising."}, {"time": 3191, "text": "It's a lot of."}, {"time": 3192, "text": "So I have not, I have not, I mean, you know, I vaguely remember a movie existing."}, {"time": 3196, "text": "So I assume it's related to that, but."}, {"time": 3198, "text": "That was more my time than your time, Charles."}, {"time": 3200, "text": "That's right, cause you're much older than I am."}, {"time": 3201, "text": "I think the important thing here is that it's narrative, right?"}, {"time": 3205, "text": "It's all about telling a story."}, {"time": 3206, "text": "That's the whole driving thing."}, {"time": 3207, "text": "But the idea that they would give these reveries, that they would make people, they would make them."}, {"time": 3212, "text": "Let them remember."}, {"time": 3213, "text": "Remember the awful things that happened."}, {"time": 3213, "text": "The terrible things that happened."}, {"time": 3215, "text": "Who could possibly think that was gonna, I gotta, I mean, I don't know."}, {"time": 3218, "text": "I've only seen the first two episodes or maybe the third one."}, {"time": 3220, "text": "I think I've only seen the first one."}, {"time": 3221, "text": "You know what it was?"}, {"time": 3222, "text": "You know what the problem is?"}, {"time": 3223, "text": "That the robots were actually designed by Hannibal Lecter."}, {"time": 3226, "text": "They weren't."}, {"time": 3227, "text": "So like, what do you think is gonna happen?"}, {"time": 3229, "text": "Bad things."}, {"time": 3230, "text": "It's clear that things are happening and characters are being introduced and we don't yet know anything, but still I was just struck by how it's all driven by narrative and story."}, {"time": 3238, "text": "And there's all these implied things like programming, the programming interface is talking to them about what's going on in their heads, which is both, I mean, artistically, it's probably useful to film it that way."}, {"time": 3250, "text": "But think about how it would work in real life."}, {"time": 3251, "text": "That just seems very great."}, {"time": 3252, "text": "But there was, we saw in the second episode, there's a screen."}, {"time": 3255, "text": "You could see things."}, {"time": 3255, "text": "They were wearing like Kubrick's glasses."}, {"time": 3256, "text": "In the world."}, {"time": 3257, "text": "It was quite interesting to just kind of ask this question so far."}, {"time": 3261, "text": "I mean, I assume it veers off into Never Never Land at some point."}, {"time": 3264, "text": "We can't answer that question."}, {"time": 3265, "text": "I'm also a fan of a guy named Alex Garland."}, {"time": 3268, "text": "He's a director of Ex Machina."}, {"time": 3271, "text": "And he is the first, I wonder if Kubrick was like this actually, is he like studies, what would it take to program an AI systems?"}, {"time": 3281, "text": "Like he's curious enough to go into that direction."}, {"time": 3284, "text": "On the Westworld side, I felt there was more emphasis on the narratives than like actually asking like computer science questions."}, {"time": 3293, "text": "Like, how would you build this?"}, {"time": 3294, "text": "How would you, and."}, {"time": 3296, "text": "How would you debug it?"}, {"time": 3297, "text": "I still think, to me, that's the key issue."}, {"time": 3300, "text": "They were terrible debuggers."}, {"time": 3303, "text": "Well, they said specifically, so we make a change and we put it out in the world and that's bad because something terrible could happen."}, {"time": 3307, "text": "Like if you're putting things out in the world and you're not sure whether something terrible is going to happen, your process is probably."}, {"time": 3313, "text": "I just feel like there should have been someone whose sole job it was to walk around and poke his head in and say, what could possibly go wrong?"}, {"time": 3319, "text": "Just over and over again."}, {"time": 3320, "text": "I would have loved if there was an, and I did watch a lot more and I'm not giving anything away."}, {"time": 3324, "text": "I would have loved it if there was like an episode where like the new intern is like debugging a new model or something and like it just keeps failing and they're like, all right."}, {"time": 3334, "text": "And then it's more turns into like a episode of Silicon Valley or something like that."}, {"time": 3339, "text": "Versus like this ominous AI systems that are constantly like threatening the fabric of this world that's been created."}, {"time": 3348, "text": "Yeah, and you know the other, this reminds me of something that, so I agree that that should be very cool, at least for the small percentage of people who care about debugging systems."}, {"time": 3356, "text": "But the other thing is."}, {"time": 3357, "text": "Right, debugging, the series."}, {"time": 3359, "text": "Yeah, it falls into, think of the sequels, fear of the debugger."}, {"time": 3362, "text": "Oh my gosh."}, {"time": 3364, "text": "It's a nightmare show, it's a horror movie."}, {"time": 3367, "text": "I think that's where we lose people, by the way, early on is the people who either decide, either figure out debugging or think debugging is terrible."}, {"time": 3372, "text": "This is where we lose people in computer science."}, {"time": 3374, "text": "This is a part of the struggle versus suffering, right?"}, {"time": 3377, "text": "You get through it and you kind of get the skills of it, or you're just like, this is dumb, and this is a dumb way to do anything."}, {"time": 3382, "text": "And I think that's when we lose people."}, {"time": 3383, "text": "But, well, I'll leave it at that."}, {"time": 3386, "text": "But I think that there's something really, really neat about framing it that way."}, {"time": 3394, "text": "But what I don't like about all of these things, and I love Tex Machina, by the way, although the ending was very depressing."}, {"time": 3402, "text": "One of the things I have to talk to Alex about, he says that the thing that nobody noticed he put in is at the end, spoiler alert, the robot turns and looks at the camera and smiles, briefly."}, {"time": 3420, "text": "And to him, he thought that his definition of passing the general version of the Turing test, or the consciousness test, is smiling for no one."}, {"time": 3437, "text": "It's like the Chinese room kind of experiment."}, {"time": 3440, "text": "It's not always trying to act for others, but just on your own, being able to have a relationship with the actual experience and just take it in."}, {"time": 3449, "text": "I don't know, he said nobody noticed the magic of it."}, {"time": 3452, "text": "I have this vague feeling that I remember the smile, but now you've just put the memory in my head, so probably not."}, {"time": 3458, "text": "But I do think that that's interesting."}, {"time": 3460, "text": "Although, by looking at the camera, you are smiling for the audience, right?"}, {"time": 3463, "text": "You're breaking the fourth wall."}, {"time": 3464, "text": "It seems, I mean, well, that's a limitation of the medium."}, {"time": 3468, "text": "But I like that idea."}, {"time": 3469, "text": "But here's the problem I have with all of those movies, all of them, is that, but I know why it's this way, and I enjoy those movies, and Westworld, is it sets up the problem of AI as succeeding and then having something we cannot control."}, {"time": 3485, "text": "But it's not the bad part of AI."}, {"time": 3488, "text": "The bad part of AI is the stuff we're living through now, right?"}, {"time": 3491, "text": "It's using the data to make decisions that are terrible."}, {"time": 3493, "text": "It's not the intelligence that's gonna go out there and surpass us and take over the world or lock us into a room to starve to death slowly over multiple days."}, {"time": 3502, "text": "It's instead the tools that we're building that are allowing us to make the terrible decisions we would have less efficiently made before, right?"}, {"time": 3512, "text": "Computers are very good at making us more efficient, including being more efficient at doing terrible things."}, {"time": 3518, "text": "And that's the part of the AI we have to worry about."}, {"time": 3520, "text": "It's not the true intelligence that we're gonna build sometime in the future, probably long after we're around."}, {"time": 3528, "text": "But I think that whole framing of it sort of misses the point, even though it is inspiring."}, {"time": 3535, "text": "And I was inspired by those ideas, right?"}, {"time": 3537, "text": "I got into this in part because I wanted to build something like that."}, {"time": 3540, "text": "Philosophical questions are interesting to me, but that's not where the terror comes from."}, {"time": 3544, "text": "The terror comes from the everyday."}, {"time": 3546, "text": "And you can construct situations in the subtlety of the interaction between AI and the human, like with social networks, all the stuff you're doing with interactive artificial intelligence."}, {"time": 3557, "text": "But I feel like Cal 9000 came a little bit closer to that in 2001 Space Odyssey, because it felt like a personal assistant."}, {"time": 3569, "text": "It felt like closer to the AI systems we have today."}, {"time": 3571, "text": "And the real things we might actually encounter, which is over relying in some fundamental way on our dumb assistants or on social networks, like over offloading too much of us onto things that require internet and power and so on and thereby becoming powerless as a standalone entity."}, {"time": 3599, "text": "And then when that thing starts to misbehave in some subtle way, it creates a lot of problems."}, {"time": 3605, "text": "And those problems are dramatized when you're in space, because you don't have a way to walk away."}, {"time": 3611, "text": "Well, as the man said, once we started making the decisions for you, it stopped being your world, right?"}, {"time": 3617, "text": "That's the matrix, Michael, in case you don't remember."}, {"time": 3620, "text": "But on the other hand, I could say no, because isn't that what we do with people anyway?"}, {"time": 3625, "text": "You know, just kind of the shared intelligence that is humanity is relying on other people constantly."}, {"time": 3630, "text": "I mean, we hyper specialize, right?"}, {"time": 3632, "text": "As individuals, we're still generally intelligent."}, {"time": 3634, "text": "We make our own decisions in a lot of ways, but we leave most of this up to other people."}, {"time": 3637, "text": "And that's perfectly fine."}, {"time": 3639, "text": "And by the way, everyone doesn't necessarily share our goals."}, {"time": 3643, "text": "Sometimes they seem to be quite against us."}, {"time": 3645, "text": "Sometimes we make decisions that others would see as against our own interests."}, {"time": 3649, "text": "And yet we somehow manage it, manage to survive."}, {"time": 3651, "text": "I'm not entirely sure why an AI would actually make that worse or even different, really."}, {"time": 3660, "text": "You mentioned the matrix."}, {"time": 3664, "text": "It does feel like a thought game more than a real scientific question."}, {"time": 3670, "text": "Well, I'll tell you why I think it's an interesting thought experiment."}, {"time": 3673, "text": "Let's see what you think."}, {"time": 3674, "text": "From a computer science perspective, it's a good experiment of how difficult would it be to create a sufficiently realistic world that us humans would enjoy being in."}, {"time": 3686, "text": "That's almost like a competition."}, {"time": 3687, "text": "If we're living in a simulation, then I don't believe that we were put in the simulation."}, {"time": 3691, "text": "I believe that it's just physics playing out and we came out of that."}, {"time": 3696, "text": "Like, I don't think."}, {"time": 3699, "text": "So you think you have to build the universe and have all the fun in the world?"}, {"time": 3701, "text": "I think that the universe itself, we can think of that as a simulation."}, {"time": 3703, "text": "And in fact, sometimes I try to think about, to understand what it's like for a computer to start to think about the world."}, {"time": 3712, "text": "I try to think about the world."}, {"time": 3715, "text": "Things like quantum mechanics, where it doesn't feel very natural to me at all."}, {"time": 3719, "text": "And it really strikes me as, I don't understand this thing that we're living in."}, {"time": 3725, "text": "It has, there's weird things happening in it that don't feel natural to me at all."}, {"time": 3729, "text": "Now, if you want to call that as the result of a simulator, okay, I'm fine with that."}, {"time": 3734, "text": "But like, I don't."}, {"time": 3735, "text": "There's the bugs in the simulation."}, {"time": 3736, "text": "There's the bugs."}, {"time": 3737, "text": "I mean, the interesting thing about the simulation is that it might have bugs."}, {"time": 3741, "text": "I mean, that's the thing that I, But there would be bugs for the people in the simulation."}, {"time": 3745, "text": "That's just reality."}, {"time": 3747, "text": "Unless you were aware enough to know that there was a bug."}, {"time": 3749, "text": "But I think."}, {"time": 3750, "text": "Back to the matrix."}, {"time": 3751, "text": "Yeah, the way you put the question though."}, {"time": 3752, "text": "I don't think that we live in a simulation created for us."}, {"time": 3755, "text": "Okay, I would say that."}, {"time": 3756, "text": "I think that's interesting."}, {"time": 3757, "text": "I've actually never thought about it that way."}, {"time": 3758, "text": "I mean, the way you asked the question though, could you create a world that is enough for us humans?"}, {"time": 3763, "text": "It's an interestingly sort of self referential question because the beings that created the simulation probably have not created the simulation that's realistic for them."}, {"time": 3773, "text": "But we're in the simulation and so it's realistic for us."}, {"time": 3776, "text": "So we could create a simulation that is fine for the people in the simulation, as it were."}, {"time": 3782, "text": "That would not necessarily be fine for us as the creators of the simulation."}, {"time": 3785, "text": "But, well, you can forget."}, {"time": 3787, "text": "I mean, if you play video games in virtual reality, you can, if some suspension of disbelief or whatever."}, {"time": 3796, "text": "It becomes a world."}, {"time": 3798, "text": "Even like in brief moments, you forget that another world exists."}, {"time": 3802, "text": "I mean, that's what like good stories do."}, {"time": 3804, "text": "They pull you in."}, {"time": 3805, "text": "And the question is, is it possible to pull, our brains are limited."}, {"time": 3809, "text": "Is it possible to pull the brain in to where we actually stay in that world longer and longer and longer and longer?"}, {"time": 3814, "text": "And like, not only that, but we don't wanna leave."}, {"time": 3819, "text": "And so, especially this is the key thing about the developing brain, is if we journey into that world early on in life, often."}, {"time": 3828, "text": "How would you even know, yeah."}, {"time": 3829, "text": "Yeah, so I, but like from a video game design perspective, from a Westworld perspective, it's, I think it's an important thing for even computer scientists to think about because it's clear that video games are getting much better."}, {"time": 3844, "text": "And virtual reality, although it's been ups and downs just like artificial intelligence, it feels like virtual reality will be here in a very impressive form if we were to fast forward 100 years into the future in a way that might change society fundamentally."}, {"time": 3862, "text": "Like if I were to, I'm very limited in predicting the future as all of us are, but if I were to try to predict, like in which way I'd be surprised to see the world 100 years from now, it'd be that, or impressed, it'd be that we're all no longer living in this physical world, that we're all living in a virtual world."}, {"time": 3885, "text": "You really need to read Calculating God by Sawyer."}, {"time": 3891, "text": "It's a, he'll read it in the night."}, {"time": 3893, "text": "It's a very easy read, but it's, assuming you're that kind of reader, but it's a good story."}, {"time": 3898, "text": "And it's kind of about this, but not in a way that it appears."}, {"time": 3901, "text": "And I really enjoyed the thought experiment."}, {"time": 3907, "text": "And I think it's pretty sure it's Robert Sawyer."}, {"time": 3908, "text": "But anyway, he's apparently Canadian's top science fiction writer, which is why the story mostly takes place in Toronto."}, {"time": 3914, "text": "But it's a very good sort of story that sort of imagines this."}, {"time": 3921, "text": "Very different kind of simulation hypothesis sort of thing from say, The Egg, for example."}, {"time": 3928, "text": "You know, I'm talking about the short story."}, {"time": 3932, "text": "By the guy who did The Martian."}, {"time": 3934, "text": "Who wrote The Martian?"}, {"time": 3936, "text": "You know what I'm talking about."}, {"time": 3937, "text": "The Martian."}, {"time": 3937, "text": "Matt Damon."}, {"time": 3939, "text": "So we had this whole discussion that Michael doesn't partake in this exercise of reading."}, {"time": 3945, "text": "He doesn't seem to like it, which seems very strange to me, considering how much he has to read."}, {"time": 3950, "text": "I read all the time."}, {"time": 3950, "text": "I used to read 10 books every week when I was in sixth grade or whatever."}, {"time": 3955, "text": "I was, a lot of it's science fiction, a lot of it's history, but I love to read."}, {"time": 3959, "text": "But anyway, you should read Calculating God."}, {"time": 3961, "text": "I think you'll, it's very easy to read, like I said, and I think you'll enjoy sort of the ideas that it presents."}, {"time": 3968, "text": "Yeah, I think the thought experiment is quite interesting."}, {"time": 3972, "text": "One thing I've noticed about people growing up now, I mean, we talk about social media, but video games is a much bigger, bigger and bigger and bigger part of their lives."}, {"time": 3981, "text": "And the video games have become much more realistic."}, {"time": 3984, "text": "I think it's possible that the three of us are not, maybe the two of you are not familiar exactly with the numbers we're talking about here."}, {"time": 3996, "text": "The number of people."}, {"time": 3997, "text": "It's bigger than movies, right?"}, {"time": 3999, "text": "I used to do a lot of the computational narrative stuff."}, {"time": 4002, "text": "I understand that economists can actually see the impact of video games on the labor market."}, {"time": 4008, "text": "That there's fewer young men of a certain age participating in like paying jobs than you'd expect."}, {"time": 4019, "text": "And that they trace it back to video games."}, {"time": 4021, "text": "I mean, the problem with Star Trek was not warp drive or teleportation."}, {"time": 4026, "text": "It was the holodeck."}, {"time": 4027, "text": "Like if you have the holodeck, that's it."}, {"time": 4032, "text": "That's it, you go in the holodeck, you never come out."}, {"time": 4033, "text": "I mean, it just never made, once I saw that, I thought, okay, well, so this is the end of humanity as we know it, right?"}, {"time": 4040, "text": "They've invented the holodeck."}, {"time": 4041, "text": "Because that feels like the singularity, not some AGI or whatever."}, {"time": 4045, "text": "It's some possibility to go into another world that can be artificially made better than this one."}, {"time": 4052, "text": "And slowing it down so you live forever."}, {"time": 4054, "text": "Or speeding it up so you appear to live forever."}, {"time": 4055, "text": "Or making the decision of when to die."}, {"time": 4059, "text": "And then most of us will just be old people on the porch yelling at the kids these days in their virtual reality."}, {"time": 4067, "text": "But they won't hear us because they've got headphones on."}, {"time": 4069, "text": "So, I mean, rewinding back to Mook's, is there lessons that you've, speaking to kids these days?"}, {"time": 4078, "text": "That was a transition."}, {"time": 4079, "text": "That was fantastic."}, {"time": 4081, "text": "I'll fix it in post."}, {"time": 4084, "text": "That's Charles's favorite phrase."}, {"time": 4086, "text": "Fix it in post?"}, {"time": 4088, "text": "When we were recording all the time, whenever the editor didn't like something or whatever, I would say, we'll fix it in post."}, {"time": 4094, "text": "He hated that."}, {"time": 4095, "text": "He hated that more than anything."}, {"time": 4096, "text": "Because it's Charles's way of saying, I'm not gonna do it again."}, {"time": 4100, "text": "You're on your own for this one."}, {"time": 4102, "text": "But it always got fixed in post."}, {"time": 4104, "text": "So is there something you've learned about, I mean, it's interesting to talk about Mook's."}, {"time": 4109, "text": "Is there something you've learned about the process of education, about thinking about the present?"}, {"time": 4115, "text": "I think there's two lines of conversation to be had here."}, {"time": 4118, "text": "There's the future of education in general that you've learned about."}, {"time": 4122, "text": "And more passionately is the education in the times of COVID."}, {"time": 4131, "text": "The second thing in some ways matters more than the first, for at least in my head, not just because it's happening now, but because I think it's reminded us of a lot of things."}, {"time": 4140, "text": "Coincidentally, today, there's an article out by a good friend of mine, who's also a professor at Georgia Tech, but more importantly, a writer and editor at the Atlantic, a guy named Ian Bogost."}, {"time": 4150, "text": "And the title is something like, Americans Will Sacrifice Anything for the College Experience."}, {"time": 4157, "text": "And it's about why we went back to college and why people wanted us to go back to college."}, {"time": 4162, "text": "And it's not greedy presidents trying to get the last dollar from someone."}, {"time": 4166, "text": "It's because they want to go to college."}, {"time": 4168, "text": "And what they're paying for is not the classes."}, {"time": 4169, "text": "What they're paying for is the college experience."}, {"time": 4172, "text": "It's not the education that's being there."}, {"time": 4173, "text": "I've believed this for a long time, that we continually make this mistake of, people want to go back to college as being people want to go back to class."}, {"time": 4183, "text": "They want to go back to campus."}, {"time": 4184, "text": "They want to move away from home."}, {"time": 4184, "text": "They want to do all those things that people experience."}, {"time": 4187, "text": "It's a rite of passage."}, {"time": 4188, "text": "It's an identity, if I can steal some of Ian's words here."}, {"time": 4193, "text": "And I think that's right."}, {"time": 4194, "text": "And I think what we've learned through COVID is it has made it, the disaggregation was not the disaggregation of the education from the place, the university place, and that you can get the best anywhere you want to."}, {"time": 4207, "text": "Turns out there's lots of reasons why that is not necessarily true."}, {"time": 4210, "text": "The disaggregation is having it shoved in our faces that the reason to go, again, that the reason to go to college is not necessarily to learn."}, {"time": 4218, "text": "It's to have the college experience."}, {"time": 4220, "text": "And that's very difficult for us to accept, even though we behave that way, most of us, when we were undergrads."}, {"time": 4226, "text": "A lot of us didn't go to every single class."}, {"time": 4228, "text": "We learned and we got it and we look back on it and we're happy we had the learning experience as well, obviously, particularly us, because this is the kind of thing that we do."}, {"time": 4235, "text": "And my guess is that's true of the vast majority of your audience."}, {"time": 4239, "text": "But that doesn't mean the, I'm standing in front of you telling you this, is the thing that people are excited about."}, {"time": 4247, "text": "And that's why they want to be there, primarily why they want to be there."}, {"time": 4250, "text": "So to me, that's what COVID has forced us to deal with, even though I think we're still all in deep denial about it and hoping that it'll go back to that."}, {"time": 4259, "text": "And I think about 85% of it will."}, {"time": 4261, "text": "We'll be able to pretend that that's really the way it is, again, and we'll forget the lessons of this."}, {"time": 4265, "text": "But technically what'll come out of it, or technologically what'll come out of it is a way of providing a more dispersed experience through online education and these kinds of remote things that we've learned."}, {"time": 4276, "text": "And we'll have to come up with new ways to engage them in the experience of college, which includes not just the parties or the whatever kids do, but the learning part of it so that they actually come out four or five or six years later with having actually learned something."}, {"time": 4290, "text": "So I think the world will be radically different afterwards."}, {"time": 4294, "text": "And I think technology will matter for that, just not in the way that the people who were building the technology originally imagined it would be."}, {"time": 4302, "text": "And I think this would have been true even without COVID, but COVID has accelerated that reality."}, {"time": 4307, "text": "So it's happening in two or three years or five years, as opposed to 10 or 15."}, {"time": 4312, "text": "That was an amazing answer that I did not understand."}, {"time": 4316, "text": "It was passionate and meaningful."}, {"time": 4319, "text": "But I don't, no, I just didn't, no, I'm not trying to criticize it."}, {"time": 4321, "text": "I just think, I don't think I'm getting it."}, {"time": 4323, "text": "So you mentioned disaggregation."}, {"time": 4325, "text": "So what's that?"}, {"time": 4326, "text": "Well, so the power of technology that if you go on the West Coast and hang out long enough is all about we're gonna disaggregate these things together."}, {"time": 4333, "text": "The books from the bookstore, that kind of a thing."}, {"time": 4335, "text": "And then suddenly Amazon controls the universe, right?"}, {"time": 4337, "text": "And technology is a disruptor, right?"}, {"time": 4339, "text": "And people have been predicting that for higher education for a long time, but certainly in the age of moves."}, {"time": 4343, "text": "So is this the sort of idea like students can aggregate on a campus someplace and then take classes over the network anywhere?"}, {"time": 4353, "text": "Yeah, this is what people thought was gonna happen, or at least people claimed it was gonna happen, right?"}, {"time": 4357, "text": "Because my daughter is essentially doing that now."}, {"time": 4358, "text": "She's on one campus, but learning in a different campus."}, {"time": 4361, "text": "Sure, and COVID makes that possible, right?"}, {"time": 4363, "text": "COVID makes that legal, all but avoidable, right?"}, {"time": 4367, "text": "But the idea originally was that, you and I were gonna create this machine learning class and it was gonna be great, and then no one else would, there'd be the machine learning class everyone takes, right?"}, {"time": 4374, "text": "That was never gonna happen, but something like that, you can see happening."}, {"time": 4377, "text": "But I feel like you didn't address that."}, {"time": 4378, "text": "Why, why, why is it that, why, why?"}, {"time": 4382, "text": "I don't think that will be the thing that happens."}, {"time": 4384, "text": "So the college experience, maybe I missed what the college experience was."}, {"time": 4387, "text": "I thought it was peers, like people hanging around."}, {"time": 4390, "text": "A large part of it is peers."}, {"time": 4391, "text": "Well, it's peers and independence."}, {"time": 4393, "text": "Yeah, but none of that, you can do classes online for all of that."}, {"time": 4397, "text": "No, no, no, no, because we're social people, right?"}, {"time": 4400, "text": "So you wanna be in the same room."}, {"time": 4401, "text": "So when we take the classes, that also has to be part of an experience."}, {"time": 4405, "text": "It's in a context, and the context is the university."}, {"time": 4407, "text": "And by the way, it actually matters that Georgia Tech really is different from Brown."}, {"time": 4413, "text": "I see, because then students can choose the kind of experience they think is gonna be best for them."}, {"time": 4418, "text": "Okay, I think we're giving too much agency to the students in making an informed decision."}, {"time": 4422, "text": "But the truth, but yes, they will make choices and they will have different experiences."}, {"time": 4426, "text": "And some of those choices will be made for them."}, {"time": 4428, "text": "Some of them will be choices they're making because they think it's this, that, or the other."}, {"time": 4431, "text": "I just don't want to say, I don't want to give the idea."}, {"time": 4433, "text": "It's not homogenous."}, {"time": 4435, "text": "Yes, it's certainly not homogenous, right?"}, {"time": 4436, "text": "I mean, Georgia Tech is different from Brown."}, {"time": 4439, "text": "Brown is different from pick your favorite state school in Iowa, Iowa State, okay?"}, {"time": 4445, "text": "Which I guess is my favorite state school in Iowa."}, {"time": 4447, "text": "But these are all different."}, {"time": 4449, "text": "They have different contexts."}, {"time": 4450, "text": "And a lot of those contexts are, they're about history, yes, but they're also about the location of where you are."}, {"time": 4475, "text": "It actually matters whether you're a small campus or a large campus."}, {"time": 4478, "text": "I mean, these things matter."}, {"time": 4478, "text": "Why is it that if you go to Georgia Tech, you're forever proud of that, and you say that to people at dinners, like bars and whatever, and if you get a degree at an online university somewhere, that's not a thing that comes up at a bar."}, {"time": 4498, "text": "Well, it's funny you say that."}, {"time": 4499, "text": "So the students who take our online masters by several measures are more loyal than the students who come on campus, certainly for the master's degree."}, {"time": 4509, "text": "The reason for that, I think, and you'd have to ask them, but based on my conversations with them, I feel comfortable saying this, is because this didn't exist before."}, {"time": 4518, "text": "I mean, we talk about this online masters and that it's reaching 11,000 students, and that's an amazing thing, and we're admitting everyone we believe who can succeed."}, {"time": 4525, "text": "We got a 60% acceptance rate."}, {"time": 4526, "text": "It's amazing, right?"}, {"time": 4527, "text": "It's also a $6,600 degree."}, {"time": 4529, "text": "The entire degree costs $6,600 or $7,000, depending on how long you take."}, {"time": 4533, "text": "A dollar degree, as opposed to $46,000 it would cost you to come on campus."}, {"time": 4537, "text": "So that feels, and I can do it while I'm working full time, and I've got a family and a mortgage and all these other things."}, {"time": 4543, "text": "So it's an opportunity to do something you wanted to do, but you didn't think was possible without giving up two years of your life, as well as all the money and everything else in the life that you had built."}, {"time": 4553, "text": "So I think we created something that's had an impact, but importantly, we gave a set of people opportunities they otherwise didn't feel they had."}, {"time": 4560, "text": "So I think people feel very loyal about that."}, {"time": 4562, "text": "And my biggest piece of evidence for that, besides the surveys, is that we have somewhere north of 80 students, might be 100 at this point, who graduated, but come back in TA for this class, for basically minimum wage, even though they're working full time, because they believe in sort of having that opportunity and they wanna be a part of something."}, {"time": 4583, "text": "Now, will generation three feel this way?"}, {"time": 4585, "text": "15 years from now, will people have that same sense?"}, {"time": 4588, "text": "I don't know, but right now they kind of do."}, {"time": 4591, "text": "And so it's not the online, it's a matter of feeling as if you're a part of something."}, {"time": 4596, "text": "Right, we're all very tribal, right?"}, {"time": 4599, "text": "And I think there's something very tribal about being a part of something like that."}, {"time": 4604, "text": "Being on campus makes that easier, going through a shared experience makes that easier."}, {"time": 4608, "text": "It's harder to have that shared experience if you're alone looking at a computer screen."}, {"time": 4612, "text": "We can create ways to make that true."}, {"time": 4613, "text": "But is it possible?"}, {"time": 4614, "text": "It is possible."}, {"time": 4615, "text": "The question is, it still is the intuition to me, and it was at the beginning when I saw something like the online master's program, is that this is gonna replace universities."}, {"time": 4627, "text": "No, it won't replace universities."}, {"time": 4629, "text": "But like why?"}, {"time": 4631, "text": "Because it's living in a different part of the ecosystem, right?"}, {"time": 4633, "text": "The people who are taking it are already adults, they've gone through their undergrad experience."}, {"time": 4638, "text": "I think their goals have shifted from when they were 17."}, {"time": 4641, "text": "They have other things that are going on."}, {"time": 4643, "text": "But it does do something really important, something very social and very important, right?"}, {"time": 4648, "text": "You know this whole thing about, don't build the sidewalks, just leave the grass and the students or the people will walk and you put the sidewalks where they create paths, this kind of thing."}, {"time": 4657, "text": "Their architects apparently believe that's the right way to do things."}, {"time": 4660, "text": "The metaphor here is that we created this environment, we didn't quite know how to think about the social aspect, but we didn't have time to solve all, do all the social engineering, right?"}, {"time": 4673, "text": "The students did it themselves, they created these groups, like on Google Plus, there were like 30 something groups created in the first year because somebody had used Google Plus."}, {"time": 4684, "text": "And they created these groups and they divided up in ways that made sense."}, {"time": 4687, "text": "We live in the same state or we're working on the same things or we have the same background or whatever and they created these social things."}, {"time": 4692, "text": "We sent them T shirts and they wear, we have all these great pictures of students putting on their T shirts as they travel around the world."}, {"time": 4698, "text": "I climbed this mountain top, I'm putting this T shirt on, I'm a part of this, they were a part of them."}, {"time": 4702, "text": "They created the social environment on top of the social network and the social media that existed to create this sense of belonging and being a part of something."}, {"time": 4710, "text": "They found a way to do it, right?"}, {"time": 4712, "text": "And I think they had other, it scratched an itch that they had, but they had scratched some of that itch that might've required they'd be physically in the same place long before, right?"}, {"time": 4724, "text": "So I think, yes, it's possible and it's more than possible, it's necessary."}, {"time": 4729, "text": "But I don't think it's going to replace the university as we know it."}, {"time": 4735, "text": "The university as we know it will change."}, {"time": 4737, "text": "But there's just a lot of power in the kind of rite of passage kind of going off to yourself."}, {"time": 4741, "text": "Now, maybe there'll be some other rite of passage that'll happen."}, {"time": 4743, "text": "That'll drive us somewhere else, it's possible."}, {"time": 4746, "text": "So the university is such a fascinating mess of things."}, {"time": 4751, "text": "So just even the faculty position is a fascinating mess."}, {"time": 4754, "text": "Like it doesn't make any sense."}, {"time": 4755, "text": "It's stabilized itself, but like why are the world class researchers spending a huge amount of time or their time teaching and service?"}, {"time": 4767, "text": "Like you're doing like three jobs."}, {"time": 4769, "text": "And I mean, it turns out it's maybe an accident of history or human evolution, I don't know."}, {"time": 4776, "text": "It seems like the people who are really good at teaching are often really good at research."}, {"time": 4780, "text": "There seems to be a parallel there, but like it doesn't make any sense that you should be doing that."}, {"time": 4785, "text": "At the same time, it also doesn't seem to make sense that your place where you party is the same place where you go to learn calculus or whatever."}, {"time": 4797, "text": "But it's a safe space."}, {"time": 4799, "text": "Safe space for everything."}, {"time": 4800, "text": "Yeah, relatively speaking, it's a safe space."}, {"time": 4802, "text": "Now, by the way, I feel the need very strongly to point out that we are living in a very particular weird bubble, right?"}, {"time": 4809, "text": "Most people don't go to college."}, {"time": 4810, "text": "And by the way, the ones who do go to college, they're not 18 years old, right?"}, {"time": 4814, "text": "They're like 25 or something."}, {"time": 4815, "text": "I forget the numbers."}, {"time": 4817, "text": "The places where we've been, where we are, they look like whatever we think the traditional movie version of universities are."}, {"time": 4825, "text": "But for most people, it's not that way at all."}, {"time": 4827, "text": "By the way, most people who drop out of college, it's entirely for financial reasons, right?"}, {"time": 4832, "text": "So we were talking about a particular experience."}, {"time": 4836, "text": "And so for that set of people, which is very small, but larger than it was a decade or two or three or four, certainly, ago, I don't think that will change."}, {"time": 4847, "text": "My concern, which I think is kind of implicit in some of these questions, is that somehow we will divide the world up further into the people who get to have this experience and get to have the network and they sort of benefit from it, and everyone else, while increasingly requiring that they have more and more credentials in order to get a job as a barista, right?"}, {"time": 4865, "text": "You gotta have a master's degree in order to work at Starbucks."}, {"time": 4868, "text": "I mean, we're gonna force people to do these things, but they're not gonna get to have that experience, and there'll be a small group of people who do who will continue to, you know, positive feedback, look, et cetera, et cetera, et cetera."}, {"time": 4876, "text": "I worry a lot about that, which is why, for me, and by the way, here's an answer to your question about faculty, which is why, to me, that you have to focus on access and the mission."}, {"time": 4886, "text": "I think the reason, whether it's good, bad, or strange, I mean, I agree, it's strange, but I think it's useful to have the faculty member, particularly at large R1 universities where we've all had experiences, that you tie what they get to do and with the fundamental mission of the university and let the mission drive."}, {"time": 4905, "text": "What I hear when I talk to faculty is, they love their PhD students because they're reproducing, basically, right?"}, {"time": 4911, "text": "And it lets them do their research and multiply."}, {"time": 4913, "text": "But they understand that the mission is the undergrads, and so they will do it without complaint, mostly, because it's a part of the mission and why they're here, and they have experiences with it themselves, and it was important to get them where they were going."}, {"time": 4927, "text": "The people who tend to get squeezed in that, by the way, are the master's students, right, who are neither the PhDs who are like us nor the undergrads we have already bought into the idea that we have to teach, though."}, {"time": 4936, "text": "That's increasingly changing."}, {"time": 4938, "text": "Anyway, I think tying that mission in really matters, and it gives you a way to unify people around making it an actual higher calling."}, {"time": 4946, "text": "Education feels like more of a higher calling to me than even research, because education, you cannot treat it as a hobby if you're going to do it well."}, {"time": 4954, "text": "But that's the pushback on this whole system is that education should be a full time job, right?"}, {"time": 4964, "text": "And it's almost like research is a distraction from that."}, {"time": 4969, "text": "Yes, although I think most of our colleagues, many of our colleagues would say that research is the job and education is the distraction."}, {"time": 4975, "text": "Right, but that's the beautiful dance."}, {"time": 4976, "text": "It seems to be that tension in itself seems to work, seems to bring out the best in the faculty."}, {"time": 4987, "text": "But I will point out two things."}, {"time": 4988, "text": "One thing I'm going to point out, and the other thing I want Michael to point out, because I think Michael is much closer to sort of the ideal professor in some sense than I am."}, {"time": 4997, "text": "Well, he is a dean."}, {"time": 4998, "text": "You're the platonic sense of a professor."}, {"time": 4999, "text": "I don't know what he meant by that, but he is a dean, so he has a different experience."}, {"time": 5003, "text": "I'm giving him time to think of the profound thing he's going to say."}, {"time": 5007, "text": "That was good."}, {"time": 5007, "text": "But let me point this out, which is that we have lecturers in the College of Computing where I am."}, {"time": 5013, "text": "There's 10 or 12 of them, depending on how you count, as opposed to the 90 or so tenure track faculty."}, {"time": 5019, "text": "Those 10 lecturers who only teach, well, they don't only teach, they also do service."}, {"time": 5022, "text": "Some of them do research as well, but primarily they teach."}, {"time": 5026, "text": "They teach 50%, over 50% of our credit hours, and we teach everybody, right?"}, {"time": 5031, "text": "So they're doing not just, they're doing more than eight times the work of the tenure track faculty, just more closer to nine or 10."}, {"time": 5041, "text": "And that's including our grad courses, right?"}, {"time": 5043, "text": "So they're doing this, they're teaching more, they're touching more than anyone, and they're beloved for it."}, {"time": 5048, "text": "I mean, so we recently had a survey."}, {"time": 5051, "text": "Everyone does these alumni surveys."}, {"time": 5052, "text": "You hire someone from the outside to do whatever, and I was really struck by something."}, {"time": 5055, "text": "You saw all these really cool numbers."}, {"time": 5057, "text": "I'm not going to talk about it because it's all internal, confidential stuff."}, {"time": 5059, "text": "But one thing I will talk about is there was a single question we asked our alum, and these are people who graduated, born in the 30s and 40s, all the way up to people who graduated last week, right?"}, {"time": 5069, "text": "Well, last semester."}, {"time": 5072, "text": "Time flies."}, {"time": 5073, "text": "Yeah, time flies."}, {"time": 5074, "text": "And it was the question, name a single person who had a strong positive impact on you, something like that."}, {"time": 5082, "text": "I think it was special impact?"}, {"time": 5084, "text": "Yeah, special impact on you."}, {"time": 5085, "text": "And then, so they got all the answers from people, and they created a word cloud."}, {"time": 5089, "text": "It was clearly a word cloud created by people who don't do word clouds for a living because they had one person whose name appeared like nine different times, like Philip, Phil, Dr. Phil, you know, but whatever."}, {"time": 5099, "text": "But they got all this."}, {"time": 5100, "text": "And I looked at it, and I noticed something really cool."}, {"time": 5102, "text": "The five people from the College of Computing, I recognized, were in that cloud."}, {"time": 5109, "text": "And four of them were lecturers, the people who teach."}, {"time": 5115, "text": "Two of them, relatively modern, both were chairs of our division of computing instruction."}, {"time": 5119, "text": "One just, one retired, one is going to retire soon."}, {"time": 5122, "text": "And the other two were lecturers, I remembered, from the 1980s."}, {"time": 5126, "text": "Two of those four actually have."}, {"time": 5128, "text": "By the way, the fifth person was Charles."}, {"time": 5129, "text": "That's not important."}, {"time": 5130, "text": "The thing is, I don't tell people that."}, {"time": 5132, "text": "But the two of those people our teaching awards are named after."}, {"time": 5136, "text": "Thank you, Michael."}, {"time": 5136, "text": "Two of those our teaching awards are named after, right?"}, {"time": 5139, "text": "So when you ask students, alumni, people who are now 60, 70 years old even, you know, who touched them?"}, {"time": 5145, "text": "They say the Dean of Students."}, {"time": 5146, "text": "They say the big teachers who taught the big introductory classes that got me into it."}, {"time": 5150, "text": "There's a guy named Richard Park who's on there, who's, you know, who's known as a great teacher."}, {"time": 5155, "text": "The Phil Adler guy who, I probably just said his last name wrong, but I know the first name's Phil because he kept showing up over and over again."}, {"time": 5163, "text": "Famous."}, {"time": 5163, "text": "Adler is what it said."}, {"time": 5165, "text": "But different people spelled it differently."}, {"time": 5166, "text": "So he appeared multiple times."}, {"time": 5168, "text": "So he was a, clearly, he was a professor in the business school."}, {"time": 5174, "text": "But when you read about him, I went to read about him because I was curious who he was."}, {"time": 5177, "text": "You know, it's all about his teaching and the students that he touched, right?"}, {"time": 5180, "text": "So whatever it is that we're doing and we think we're doing that's important or why we think the universities function, the people who go through it, they remember the people who were kind to them, the people who taught them something, and they do remember it."}, {"time": 5192, "text": "They remember it later."}, {"time": 5193, "text": "I think that's important."}, {"time": 5195, "text": "That's why the mission matters."}, {"time": 5198, "text": "Not to completely lose track of the fundamental problem of how do we replace the party aspect of universities before we go to the what makes the platonic professor."}, {"time": 5211, "text": "Do you think, like, what in your sense is the role of MOOCs in this whole picture during COVID?"}, {"time": 5220, "text": "Like, should we desperately be clamoring to get back on campus?"}, {"time": 5225, "text": "Or is this a stable place to be for a little while?"}, {"time": 5229, "text": "I know that the online teaching experience and learning experience has been really rough."}, {"time": 5235, "text": "I think that people find it to be a struggle in a way that's not a happy, positive struggle, that when you got through it, you just feel like glad that it's over as opposed to I've achieved something."}, {"time": 5247, "text": "So, you know, I worry about that."}, {"time": 5249, "text": "But, you know, I worry about just even before this happened, I worry about lecture teaching, how well is that actually really working as far as a way to do education, as a way to inspire people."}, {"time": 5263, "text": "I mean, all the data that I'm aware of seems to indicate, and this kind of fits, I think, with Charles's story, is that people respond to connection, right?"}, {"time": 5274, "text": "They actually feel, if they feel connected to the person teaching the class, they're more likely to go along with it."}, {"time": 5280, "text": "They're more able to retain information."}, {"time": 5282, "text": "They're more motivated to be involved in the class in some way."}, {"time": 5286, "text": "And that really matters."}, {"time": 5289, "text": "People... You mean to the human themselves."}, {"time": 5293, "text": "Okay, can't you do that actually perhaps more effectively online?"}, {"time": 5298, "text": "Like you mentioned, science communication."}, {"time": 5300, "text": "So I literally, I think, learned linear algebra from Gilbert Strang by watching MIT OpenCourseWare when I was in track."}, {"time": 5309, "text": "Like, and he was a personality, he was a bit like a tiny..."}, {"time": 5313, "text": "In this tiny little world of math, he's a bit of a rockstar, right?"}, {"time": 5316, "text": "So you kind of look up to that person."}, {"time": 5320, "text": "Can't that replace the in person education?"}, {"time": 5324, "text": "It can help."}, {"time": 5325, "text": "I will point out something, I can't share the numbers, but we have surveyed our students, and even though they have feelings about what I would interpret as connection, I like that word, in the different modes of classrooms, there's no difference between how well they think they're learning."}, {"time": 5342, "text": "For them, the thing that makes them unhappy is the situation they're in."}, {"time": 5346, "text": "And I think the lack of connection, it's not whether they're learning anything."}, {"time": 5350, "text": "They seem to think they're learning something anyway, right?"}, {"time": 5353, "text": "In fact, they seem to think they're learning it equally well, presumably because the faculty are putting in, or the instructors, more generally speaking, are putting in the energy and effort to try to make certain that what they've curated can be expressed to them in a useful way."}, {"time": 5370, "text": "But the connection is missing."}, {"time": 5371, "text": "And so there's huge differences in what they prefer."}, {"time": 5374, "text": "And as far as I can tell, what they prefer is more connection, not less."}, {"time": 5377, "text": "That connection just doesn't have to be physically in a classroom."}, {"time": 5380, "text": "I mean, look, I used to teach 348 students in my machine learning class on campus."}, {"time": 5385, "text": "That was the biggest classroom on campus."}, {"time": 5388, "text": "They're sitting in theater seats."}, {"time": 5390, "text": "I'm literally on a stage looking down on them and talking to them, right?"}, {"time": 5396, "text": "There's no, I mean, we're not sitting down, having a one on one conversation, reading each other's body language, trying to communicate and going, we're not doing any of that."}, {"time": 5405, "text": "So if you're past the third row, it might as well be online anyway is the kind of thing that people have said."}, {"time": 5410, "text": "Daphne has actually said some version of this that online starts on the third row or something like that."}, {"time": 5415, "text": "And I think that's not, yeah, I like it."}, {"time": 5418, "text": "I think it captures something important."}, {"time": 5420, "text": "But people still came, by the way."}, {"time": 5422, "text": "Even the people who had access to our material would still come to class."}, {"time": 5425, "text": "I mean, there's a certain element about looking to the person next to you."}, {"time": 5428, "text": "It's just like their presence there, their boredom."}, {"time": 5432, "text": "And like when the parts are boring and their excitement when the parts are exciting, like in sharing in that, like unspoken kind of, yeah, communication."}, {"time": 5443, "text": "In part, the connection is with the other people in the room."}, {"time": 5446, "text": "Yeah, watching the circus on TV alone is not really."}, {"time": 5452, "text": "Ever been to a movie theater and been the only one there at a comedy?"}, {"time": 5455, "text": "It's not as funny as when you're in a room full of people all laughing."}, {"time": 5460, "text": "Well, you need, maybe you need just another person."}, {"time": 5462, "text": "It's like, as opposed to many."}, {"time": 5464, "text": "Maybe there's some kind of."}, {"time": 5466, "text": "Well, there's different kinds of connection, right?"}, {"time": 5467, "text": "And there's different kinds of comedy."}, {"time": 5471, "text": "Well, in the sense that."}, {"time": 5472, "text": "As we're learning today."}, {"time": 5475, "text": "I wasn't sure if that was gonna land."}, {"time": 5476, "text": "But just the idea that different jokes, I've now done a little bit of standup."}, {"time": 5483, "text": "And so different jokes work in different size crowds too."}, {"time": 5486, "text": "No, it's true."}, {"time": 5487, "text": "Where sometimes if it's a big enough crowd, then even a really subtle joke can take root someplace and then that cues other people."}, {"time": 5494, "text": "And it kind of, there's a whole statistics of."}, {"time": 5498, "text": "I did this terrible thing to my brother."}, {"time": 5500, "text": "So when I was really young, I decided that my brother was only laughing as it comes when I laughed."}, {"time": 5506, "text": "Like he was taking cues from me."}, {"time": 5508, "text": "So I like purposely didn't laugh just to see if I was right."}, {"time": 5510, "text": "And did you laugh at non funny things?"}, {"time": 5513, "text": "You really wanna do both sides."}, {"time": 5514, "text": "I did both sides."}, {"time": 5514, "text": "And at the end of it, I told him what I did."}, {"time": 5518, "text": "He was very upset about this."}, {"time": 5520, "text": "And from that day on."}, {"time": 5521, "text": "He lost his sense of humor."}, {"time": 5524, "text": "But from that day on, he laughed on his own."}, {"time": 5527, "text": "He stopped taking cues from me."}, {"time": 5529, "text": "So I wanna say that it was a good thing that I did."}, {"time": 5532, "text": "You saved that man's life."}, {"time": 5534, "text": "Yes, but it was mostly mean."}, {"time": 5535, "text": "But it's true though."}, {"time": 5535, "text": "It's true, right?"}, {"time": 5536, "text": "That people, I think you're right."}, {"time": 5539, "text": "But okay, so where does that get us?"}, {"time": 5540, "text": "That gets us the idea that, I mean, certainly movie theaters are a thing, right?"}, {"time": 5546, "text": "Where people like to be watching together, even though the people on the screen aren't really co present with the people in the audience."}, {"time": 5553, "text": "The audience is co present with themselves."}, {"time": 5555, "text": "By the way, and that point, it's an open question that's being raised by this, whether movies will no longer be a thing because Netflix's audience is growing."}, {"time": 5563, "text": "So that's, it's a very parallel question for education."}, {"time": 5567, "text": "Will movie theaters still be a thing in 2021?"}, {"time": 5570, "text": "No, but I think the argument is that there is a feeling of being in the crowd that isn't replicated by being at home watching it and that there's value in that."}, {"time": 5579, "text": "And then I think just."}, {"time": 5580, "text": "But, but."}, {"time": 5582, "text": "It scales better online."}, {"time": 5583, "text": "But I feel like we're having a conversation about whether concerts will still exist after the invention of the record or the CD or wherever it is, right?"}, {"time": 5593, "text": "They won't."}, {"time": 5594, "text": "You're right, concerts are dead."}, {"time": 5596, "text": "Well, okay, I think the joke is only funny if you say it before now."}, {"time": 5601, "text": "Right, yeah, that's true."}, {"time": 5603, "text": "Like three years ago."}, {"time": 5604, "text": "It's like, well, no, obviously concerts are still a big thing."}, {"time": 5605, "text": "I'll wait to publish this until we have a vaccine."}, {"time": 5607, "text": "No, you know, we'll fix it in post."}, {"time": 5610, "text": "But I think the important thing is."}, {"time": 5613, "text": "Fix the virus post."}, {"time": 5614, "text": "Concerts changed, right?"}, {"time": 5616, "text": "Concerts changed."}, {"time": 5617, "text": "First of all, movie theaters weren't this way, right?"}, {"time": 5619, "text": "In like the 60s and 70s, they weren't like this."}, {"time": 5621, "text": "Like blockbusters were basically what?"}, {"time": 5624, "text": "Well, Jaws and Star Wars created blockbusters, right?"}, {"time": 5627, "text": "Before then, there weren't."}, {"time": 5627, "text": "Like the whole shared summer experience didn't exist in our lifetimes, right?"}, {"time": 5632, "text": "Certainly you were well into adulthood by the time this was true, right?"}, {"time": 5634, "text": "So it's just a very different."}, {"time": 5636, "text": "It's very different."}, {"time": 5637, "text": "So what we've been experiencing in the last 10 years is not like the majority of human history, but more importantly, concerts, right?"}, {"time": 5643, "text": "Concerts mean something different."}, {"time": 5644, "text": "Most people don't go to concerts anymore."}, {"time": 5647, "text": "Like there's an age where you care about it."}, {"time": 5649, "text": "You sort of stop doing it, but you keep listening to music or whatever and da, da, da, da, da, da, da."}, {"time": 5653, "text": "So I think that's a painful way of saying that it will change."}, {"time": 5662, "text": "It was not the same thing as it going away."}, {"time": 5663, "text": "Replace is too strong of a word, but it will change."}, {"time": 5667, "text": "It has to."}, {"time": 5667, "text": "Actually, like to push back, I wonder, because I think you're probably just throwing that your intuition now."}, {"time": 5673, "text": "Oh, I wasn't."}, {"time": 5674, "text": "And it's possible that concerts, more people go to concerts now, but obviously much more people listen to, well, that's dumb, than before there was records."}, {"time": 5686, "text": "It's possible to argue that if you look at the data, that it just expanded the pie of what music listening means."}, {"time": 5695, "text": "So it's possible that universities grow in the parallel or the theaters grow, but also more people get to watch movies, more people get to be educated."}, {"time": 5705, "text": "Yeah, I hope that is true."}, {"time": 5707, "text": "Yeah, and to the extent that we can grow the pie and have education be not just something you do for four years when you're done with your other education, but it be a more lifelong thing, that would have tremendous benefits, especially as the economy and the world change rapidly."}, {"time": 5724, "text": "People need opportunities to stay abreast of these changes."}, {"time": 5728, "text": "And so, I don't know, that's all part of the ecosystem."}, {"time": 5733, "text": "It's all to the good."}, {"time": 5734, "text": "I mean, I'm not gonna have an argument about whether we lost fidelity when we went from Laserdisc to DVDs or record players to CDs."}, {"time": 5743, "text": "I mean, I'm willing to grant that that is true, but convenience matters and the ability to do something that you couldn't do otherwise because that convenience matters."}, {"time": 5753, "text": "And you can tell me I'm only getting 90% of the experience, but I'm getting the experience."}, {"time": 5757, "text": "I wasn't getting it before or it wasn't lasting as long or it wasn't as easy."}, {"time": 5760, "text": "I mean, this just seems straightforward to me."}, {"time": 5763, "text": "It's gonna, it's going to change."}, {"time": 5765, "text": "It is for the good that more people get access and it is our job to do two separate things."}, {"time": 5770, "text": "One, to educate them and make access available."}, {"time": 5773, "text": "That's our mission."}, {"time": 5774, "text": "But also for very simple selfish reasons, we need to figure out how to do it better so that we individually stay in business."}, {"time": 5780, "text": "We can do both of those things at the same time."}, {"time": 5781, "text": "They are not in, they may be intention, but they are not mutually exclusive."}, {"time": 5788, "text": "So you've educated some scary number of people."}, {"time": 5794, "text": "So you've seen a lot of people succeed, find their path through life."}, {"time": 5799, "text": "Is there a device that you can give to a young person today about computer science education, about education in general, about life, about whatever the journey that one takes in there, maybe in their teens, in their early 20s, sort of in those underground years as you try to go through the essential process of partying and not going to classes and yet somehow trying to get a degree?"}, {"time": 5832, "text": "If you get to the point where you're far enough up in the hierarchy of needs that you can actually make decisions like this, then find the thing that you're passionate about and pursue it."}, {"time": 5845, "text": "And sometimes it's the thing that drives your life and sometimes it's secondary."}, {"time": 5849, "text": "And you'll do other things because you've got to eat, right?"}, {"time": 5851, "text": "You've got a family, you've got to feed, you've got people you have to help or whatever."}, {"time": 5854, "text": "And I understand that and it's not easy for everyone, but always take a moment or two to pursue the things that you love, the things that bring passion and happiness to your life."}, {"time": 5865, "text": "And if you don't, I know that sounds corny, but I genuinely believe it."}, {"time": 5867, "text": "And if you don't have such a thing, then you're lying to yourself."}, {"time": 5871, "text": "You have such a thing."}, {"time": 5872, "text": "You just have to find it."}, {"time": 5873, "text": "And it's okay if it takes you a long time to get there."}, {"time": 5876, "text": "Rodney Dangerfield became a comedian in his 50s, I think."}, {"time": 5880, "text": "Certainly wasn't his 20s."}, {"time": 5881, "text": "And lots of people failed for a very long time before getting to where they were going."}, {"time": 5886, "text": "I try to have hope and it wasn't obvious."}, {"time": 5889, "text": "I mean, you and I talked about the experience that I had a long time ago with a particular police officer."}, {"time": 5897, "text": "Was it my first one and was it my last one?"}, {"time": 5900, "text": "But in my view, I wasn't supposed to be here after that and I'm here."}, {"time": 5905, "text": "So it's all gravy."}, {"time": 5905, "text": "So you might as well go ahead and grab life as you can because of that."}, {"time": 5909, "text": "That's sort of how I see it."}, {"time": 5911, "text": "While recognizing, again, the delusion matters, right?"}, {"time": 5914, "text": "Allow yourself to be deluded."}, {"time": 5915, "text": "Allow yourself to believe that it's all gonna work out."}, {"time": 5918, "text": "Just don't be so deluded that you miss the obvious."}, {"time": 5921, "text": "And you're gonna be fine."}, {"time": 5923, "text": "It's gonna be there."}, {"time": 5925, "text": "It's gonna work out."}, {"time": 5927, "text": "I like to say choose your parents wisely because that has a big impact on your life."}, {"time": 5934, "text": "Yeah, I mean, there's a whole lot of things that you don't get to pick."}, {"time": 5938, "text": "And whether you get to have one kind of life or a different kind of life can depend a lot on things out of your control."}, {"time": 5946, "text": "But I really do believe in the passion, excitement thing."}, {"time": 5949, "text": "My, I was talking to my mom on the phone the other day and essentially what came out is that computer science is really popular right now."}, {"time": 5962, "text": "And I get to be a professor teaching something that's very attractive to people."}, {"time": 5968, "text": "And she was like trying to give me some appreciation for how foresightful I was for choosing this line of work as if somehow I knew that this is what was gonna happen in 2020, but that's not how it went for me at all."}, {"time": 5984, "text": "Like I studied computer science because I was just interested."}, {"time": 5987, "text": "It was just so interesting to me."}, {"time": 5989, "text": "I didn't think it would be particularly lucrative."}, {"time": 5994, "text": "And I've done everything I've can to keep it as unlucrative as possible."}, {"time": 5999, "text": "Some of my friends and colleagues have not done that."}, {"time": 6003, "text": "And I pride myself on my ability to remain unrich."}, {"time": 6007, "text": "But I do believe that, like I'm glad."}, {"time": 6013, "text": "I mean, I'm glad that it worked out for me."}, {"time": 6015, "text": "It could have been like, oh, what I was really fascinated by is this particular kind of engraving that nobody cares about."}, {"time": 6020, "text": "But so I got lucky and the thing that I cared about happened to be a thing that other people eventually cared about."}, {"time": 6026, "text": "But I don't think I would have had a fun time choosing anything else."}, {"time": 6029, "text": "Like this was the thing that kept me interested and engaged."}, {"time": 6032, "text": "Well, one thing that people tell me, especially around the early undergraduate, and the internet is part of the problem here, is they say they're passionate about so many things."}, {"time": 6044, "text": "How do I choose a thing?"}, {"time": 6046, "text": "Which is a harder thing for me to know what to do with."}, {"time": 6050, "text": "Is there any?"}, {"time": 6051, "text": "I mean, don't you know which, I mean, you know, look."}, {"time": 6055, "text": "A long time ago, I walked down a hallway and I took a left turn."}, {"time": 6059, "text": "I could have taken a right turn."}, {"time": 6061, "text": "And my world could be better or it could be worse."}, {"time": 6064, "text": "I have no way of knowing."}, {"time": 6065, "text": "Is there anything about this particular hallway that's relevant or you're just in general choices?"}, {"time": 6069, "text": "Yeah, you were on the left."}, {"time": 6069, "text": "It sounds like you regret not taking the right turn."}, {"time": 6072, "text": "You brought it up."}, {"time": 6073, "text": "Well, because there was a turn there."}, {"time": 6076, "text": "On the left was Michael Newman's office, right?"}, {"time": 6078, "text": "I mean, these sorts of things happen, right?"}, {"time": 6080, "text": "On the right, by the way, there was just a blank wall."}, {"time": 6082, "text": "It wasn't a huge choice."}, {"time": 6084, "text": "It would have really hurt."}, {"time": 6085, "text": "He tried first."}, {"time": 6086, "text": "No, but it's true, right?"}, {"time": 6087, "text": "You know, I think about Ron Brockman, right?"}, {"time": 6089, "text": "I went, I took a trip I wasn't supposed to take and I ended up talking to Ron about this and I ended up going down this entire path that allowed me to, I think, get tenure."}, {"time": 6102, "text": "But by the way, I decided to say yes to something that didn't make any sense and I went down this educational path."}, {"time": 6108, "text": "But it would have been, you know, who knows, right?"}, {"time": 6110, "text": "Maybe if I hadn't done that, I would be a billionaire right now."}, {"time": 6114, "text": "I'd be Elon Musk."}, {"time": 6115, "text": "My life could be so much better."}, {"time": 6117, "text": "My life could also be so much worse."}, {"time": 6119, "text": "You know, you just gotta feel that sometimes you have decisions you're gonna make."}, {"time": 6123, "text": "You cannot know what's gonna do."}, {"time": 6124, "text": "You should think about it, right?"}, {"time": 6125, "text": "Some things are clearly smarter than other things."}, {"time": 6127, "text": "You gotta play the odds a little bit."}, {"time": 6129, "text": "But in the end, if you've got multiple choices, there are lots of things you think you might love."}, {"time": 6132, "text": "Go with the thing that you actually love, the thing that jumps out at you and sort of pursue it for a little while."}, {"time": 6137, "text": "The worst thing that'll happen is you took a left turn instead of a right turn and you ended up merely happy."}, {"time": 6143, "text": "So, so accepting, so taking the step and just accepting, accepting that, that don't like question, question the choice."}, {"time": 6151, "text": "Life is long and there's time to actually pursue."}, {"time": 6156, "text": "Every once in a while, you have to put on a leather suit and make a thriller video."}, {"time": 6163, "text": "Every once in a while."}, {"time": 6164, "text": "If I ever get the chance again, I'm doing it."}, {"time": 6169, "text": "I was told that you actually dance, but that part was edited out."}, {"time": 6173, "text": "I don't dance."}, {"time": 6175, "text": "There was a thing where we did do the zombie thing."}, {"time": 6179, "text": "We did do the zombie thing."}, {"time": 6180, "text": "That wasn't edited out."}, {"time": 6181, "text": "It just wasn't put into the final thing."}, {"time": 6185, "text": "I'm quite happy."}, {"time": 6186, "text": "There was a reason for that too, right?"}, {"time": 6187, "text": "Like I wasn't wearing something right."}, {"time": 6189, "text": "There was a reason for that."}, {"time": 6191, "text": "No leather suit."}, {"time": 6192, "text": "Is that what it was?"}, {"time": 6193, "text": "I can't remember."}, {"time": 6194, "text": "Anyway, the right thing happened."}, {"time": 6196, "text": "You took the left turn and ended up being the right thing."}, {"time": 6199, "text": "So a lot of people ask me that are a little bit tangential to the programming and the computing world and they're interested to learn programming, like all kinds of disciplines that are outside of the particular discipline of computer science."}, {"time": 6213, "text": "What advice do you have for people that want to learn how to program or want to either taste this little skill set or discipline or try to see if it can be used somehow in their own life?"}, {"time": 6228, "text": "What stage of life are they in?"}, {"time": 6233, "text": "One of the magic things about the internet of the people that write me is I don't know."}, {"time": 6238, "text": "Because my answer's different for, my daughter is taking AP computer science right now."}, {"time": 6242, "text": "Hi, Joni."}, {"time": 6243, "text": "She's amazing and doing amazing things and my son's beginning to get interested and I'll be really curious where he takes it."}, {"time": 6250, "text": "I think his mind actually works very well for this sort of thing and she's doing great."}, {"time": 6254, "text": "But one of the things I have to tell her all the time, she points, well, I want to make a rhythm game."}, {"time": 6259, "text": "So I want to go for two weeks and then build a rhythm game."}, {"time": 6263, "text": "Show me how to build a rhythm game."}, {"time": 6265, "text": "Start small, learn the building blocks and how to take the time."}, {"time": 6268, "text": "Have patience, eventually you'll build a rhythm game."}, {"time": 6271, "text": "I was in grad school when I suddenly woke up one day over the Royal East and I thought, wait a minute, I'm a computer scientist."}, {"time": 6278, "text": "I should be able to write Pac Man in an afternoon."}, {"time": 6279, "text": "And I did, not with great graphics."}, {"time": 6282, "text": "It was actually a very cool game."}, {"time": 6283, "text": "I had to figure out how the ghost moved and everything and I did it in an afternoon in Pascal on an old Apple 2GS."}, {"time": 6289, "text": "But if I had started out trying to build Pac Man, I think it probably would have ended very poorly for me."}, {"time": 6295, "text": "Luckily back then, there weren't these magical devices we call phones and software everywhere to give me this illusion that I could create something by myself from the basics inside of a weekend like that."}, {"time": 6305, "text": "I mean, that was a culmination of years and years and years right before I decided, oh, I should be able to write this and I could."}, {"time": 6312, "text": "So my advice if you're early on is you've got the internet."}, {"time": 6316, "text": "There are lots of people there to give you the information."}, {"time": 6318, "text": "Find someone who cares about this."}, {"time": 6320, "text": "Remember, they've been doing it for a very long time."}, {"time": 6322, "text": "Take it slow, learn the little pieces, get excited about it and then keep the big project you want to build in mind."}, {"time": 6328, "text": "You'll get there soon enough."}, {"time": 6329, "text": "Because as a wise man once said, life is long."}, {"time": 6332, "text": "Sometimes it doesn't seem that long, but it is long and you'll have enough time to build it all out."}, {"time": 6339, "text": "All the information is out there, but start small."}, {"time": 6343, "text": "Generate Fibonacci numbers."}, {"time": 6344, "text": "That's not exciting, but it'll get you the language."}, {"time": 6348, "text": "Well, there's only one programming language, it's Lisp."}, {"time": 6350, "text": "But if you have to pick a programming language, I guess in today's day, what would I do?"}, {"time": 6355, "text": "I guess I'd do."}, {"time": 6356, "text": "Python is basically Lisp, but with better syntax."}, {"time": 6360, "text": "Blasphemy."}, {"time": 6361, "text": "Yeah, with C syntax, how about that?"}, {"time": 6363, "text": "So you're gonna argue that C syntax is better than anything?"}, {"time": 6367, "text": "Anyway, also I'm gonna answer Python despite what he said."}, {"time": 6370, "text": "Tell your story about somebody's dissertation that had a Lisp program in it."}, {"time": 6374, "text": "It was so funny."}, {"time": 6375, "text": "This is Dave's, Dave's dissertation was like, Dave McAllister, who was a professor at MIT for a while and then he came to Bell Labs and now he's at Technology Technical Institute of Chicago."}, {"time": 6386, "text": "A brilliant guy."}, {"time": 6387, "text": "Such an interesting guy."}, {"time": 6388, "text": "Anyway, his thesis, it was a theorem prover and he decided to have as an appendix his actual code, which of course was all written in Lisp because of course it was."}, {"time": 6400, "text": "And like the last 20 pages are just right parenthesis."}, {"time": 6403, "text": "It's just wonderful."}, {"time": 6407, "text": "That's programming right there."}, {"time": 6408, "text": "Pages upon pages of right parenthesis."}, {"time": 6411, "text": "Anyway, Lisp is the only real language, but I understand that that's not necessarily the place where you start."}, {"time": 6416, "text": "Python is just fine."}, {"time": 6417, "text": "Python is good."}, {"time": 6419, "text": "If you're, you know, of a certain age, if you're really young and trying to figure it out, graphical languages that let you kind of see how the thing works and that's fine too."}, {"time": 6425, "text": "They're all fine."}, {"time": 6426, "text": "It almost doesn't matter."}, {"time": 6427, "text": "But there are people who spend a lot of time thinking about how to build languages that get people in."}, {"time": 6433, "text": "The question is, are you trying to get in and figure out what it is?"}, {"time": 6435, "text": "Or do you already know what you want?"}, {"time": 6438, "text": "And that's why I asked you what stage of life people are in because if you're different stages of life, you would attack it differently."}, {"time": 6443, "text": "The answer to that question of which language keeps changing, I mean, there's some value to exploring, a lot of people write to me about Julia."}, {"time": 6453, "text": "There's these like more modern languages that keep being invented, Rust and Kotlin."}, {"time": 6459, "text": "There's stuff that, for people who love functional languages like Lisp, that apparently there's echoes of that, but much better in the modern languages."}, {"time": 6469, "text": "And it's worthwhile to, especially when you're learning languages, it feels like it's okay to try one that's not like the popular one."}, {"time": 6477, "text": "Oh yeah, but you want something simple."}, {"time": 6479, "text": "And I think you get that way of thinking almost no matter what language."}, {"time": 6484, "text": "And if you push far enough, like it can be assembly language, but you need to push pretty far before you start to hit the really deep concepts that you would get sooner in other languages."}, {"time": 6493, "text": "But like, I don't know, computation is kind of computation, is kind of Turing equivalent, is kind of computation."}, {"time": 6499, "text": "And so it matters how you express things, but you have to build out that mental structure in your mind."}, {"time": 6505, "text": "And I don't think it's super matters which language."}, {"time": 6508, "text": "I mean, it matters a little, because some things are just at the wrong level of abstraction."}, {"time": 6512, "text": "I think assembly is at the wrong level of abstraction for someone coming in new."}, {"time": 6515, "text": "I think that if you start."}, {"time": 6517, "text": "For someone coming in new."}, {"time": 6518, "text": "Yes, for frameworks, big frameworks are quite a bit."}, {"time": 6522, "text": "You know, you've got to get to the point where I want to learn a new language, means I just pick up a reference book and I think of a project and I go through it in a weekend."}, {"time": 6529, "text": "Right, you got to get there."}, {"time": 6530, "text": "You're right though, the languages that are designed for that are, it almost doesn't matter."}, {"time": 6534, "text": "Pick the ones that people have built tutorials and infrastructure around to help you get kind of, kind of ease into it."}, {"time": 6540, "text": "Because it's hard."}, {"time": 6541, "text": "I mean, I did this little experiment once."}, {"time": 6545, "text": "I was teaching intro to CS in the summer as a favor."}, {"time": 6551, "text": "Which is, anyway."}, {"time": 6551, "text": "I was teaching."}, {"time": 6552, "text": "I was teaching intro to CS as a favor."}, {"time": 6555, "text": "And it was very funny because I'd go in every single time and I would think to myself, how am I possibly going to fill up an hour and a half talking about for loops, right?"}, {"time": 6563, "text": "And there wasn't enough time."}, {"time": 6565, "text": "Took me a while to realize this, right?"}, {"time": 6566, "text": "There are only three things, right?"}, {"time": 6567, "text": "There's reading from a variable, writing to a variable and conditional branching."}, {"time": 6571, "text": "Everything else is syntactic sugar, right?"}, {"time": 6574, "text": "The syntactic sugar matters, but that's it."}, {"time": 6576, "text": "And when I say that's it, I don't mean it's simple."}, {"time": 6580, "text": "Like conditional branching, loops, variable."}, {"time": 6583, "text": "Those are really hard concepts."}, {"time": 6585, "text": "So you shouldn't be discouraged by this."}, {"time": 6587, "text": "Here's a simple experiment."}, {"time": 6588, "text": "I'm gonna ask you a question now."}, {"time": 6590, "text": "X equals three."}, {"time": 6593, "text": "Y equals four."}, {"time": 6595, "text": "What is X?"}, {"time": 6597, "text": "Three."}, {"time": 6597, "text": "What is Y?"}, {"time": 6599, "text": "Y equals X. I'm gonna mess this up."}, {"time": 6601, "text": "No, it's easy."}, {"time": 6602, "text": "Y equals X. Y equals X."}, {"time": 6609, "text": "X equals seven."}, {"time": 6612, "text": "That's one of the trickiest things to get for programmers, that there's a memory and the variables are pointing to a particular thing in memory, and sometimes the languages hide that from you and they bring it closer to the way you think mathematics works."}, {"time": 6626, "text": "Right, so in fact, Mark Guzdal, who worries about these sorts of things, or used to worry about these sorts of things anyway, had this kind of belief that actually, people when they see these statements, X equals something, Y equals something, Y equals X, that you have now made a mathematical statement that Y and X are the same."}, {"time": 6645, "text": "Which you can if you just put like an anchor in front of it."}, {"time": 6648, "text": "Yes, but people, that's not what you're doing, right?"}, {"time": 6651, "text": "I thought, and I kind of asked the question, and I think I had some evidence for this, it's hardly a study, is that most of the people who didn't know the answer, weren't sure about the answer, they had used spreadsheets."}, {"time": 6662, "text": "Ah, interesting."}, {"time": 6663, "text": "And so it's, you know, it's by reference, or by name really, right?"}, {"time": 6670, "text": "And so depending upon what you think they are, you get completely different answers."}, {"time": 6674, "text": "The fact that I could go, or one could go, two thirds of the way through a semester, and people still hadn't figured out in their heads, when you say Y equals X, what that meant, tells you it's actually hard."}, {"time": 6687, "text": "Because all those answers are possible, and in fact, when you said, oh, if you just put an ampersand in front of it, I mean, that doesn't make any sense for an intro class, and of course a lot of languages don't even give you the ability to think about it in terms of ampersand."}, {"time": 6697, "text": "Do we want to have a 45 minute discussion about the difference between equal EQ and equal in Lisp?"}, {"time": 6703, "text": "I know you do."}, {"time": 6704, "text": "But you know, you could do that."}, {"time": 6707, "text": "This is actually really hard stuff."}, {"time": 6709, "text": "So you shouldn't be, it's not too hard, we all do it, but you shouldn't be discouraged."}, {"time": 6713, "text": "It's why you should start small, so that you can figure out these things, so you have the right model in your head, so that when you write the language, you can execute it, and build the machine that you want to build, right?"}, {"time": 6723, "text": "Yeah, the funny thing about programming, and those very basic things, is the very basics are not often made explicit, which is actually what drives everybody away from basically any discipline, but programming is just another one."}, {"time": 6737, "text": "Like even a simpler version of the equal sign that I kind of forget, is in mathematics, equals is not assignment."}, {"time": 6746, "text": "Like, I think basically every single programming language with just a few handful of exceptions, equals is assignment."}, {"time": 6755, "text": "And you have some other operator for equality."}, {"time": 6758, "text": "And even that, like everyone kind of knows it, once you started doing it, but like you need to say that explicitly, or you just realize it, like yourself."}, {"time": 6771, "text": "Otherwise you might be stuck for, you said like half a semester, you could be stuck for quite a long time."}, {"time": 6777, "text": "And I think also part of the programming is being okay in that state of confusion for a while."}, {"time": 6784, "text": "It's to the debugging point."}, {"time": 6786, "text": "It's like, I just wrote two lines of code, why doesn't this work?"}, {"time": 6790, "text": "And staring at that for like hours, and trying to figure out."}, {"time": 6795, "text": "And then every once in a while, you just have to restart your computer and everything works again."}, {"time": 6799, "text": "And then you just kind of stare into the void with the tear slowly rolling down your eye."}, {"time": 6806, "text": "By the way, the fact that they didn't get this actually had no impact on, I mean, they were still able to do their assignments."}, {"time": 6812, "text": "Because it turns out their misunderstanding wasn't being revealed to them by the problem sets we were giving them."}, {"time": 6819, "text": "It's pretty profound actually, yeah."}, {"time": 6821, "text": "I wrote a program a long time ago, actually for my master's thesis, and in C++ I think, or C, I guess it was C. And it was all memory management and terrible."}, {"time": 6832, "text": "And it wouldn't work for a while."}, {"time": 6836, "text": "And it was some kind of, it was clear to me that it was overriding memory."}, {"time": 6839, "text": "And I just couldn't, I was like, look, I got to pay for this time for this."}, {"time": 6843, "text": "So I basically declared a variable at the front in the main that was like 400K, just an array, and it worked."}, {"time": 6852, "text": "Because wherever I was scribbling over memory, it would scribble into that space and it didn't matter."}, {"time": 6857, "text": "And so I never figured out what the bug was."}, {"time": 6859, "text": "But I did create something to sort of deal with it."}, {"time": 6861, "text": "To work around it."}]}]