[{"title": "George Hotz: Comma.ai, OpenPilot, and Autonomous Vehicles | Lex Fridman Podcast #31", "id": "iwcYp-XT7UI", "quotes": [{"time": 226, "text": "I just read that you talked about escaping the simulation or something like that."}, {"time": 231, "text": "So maybe you can tell me a little bit about the theme and the message there too."}, {"time": 235, "text": "It wasn't a very practical talk about how to actually escape a simulation."}, {"time": 240, "text": "It was more about a way of restructuring an us versus them narrative."}, {"time": 245, "text": "If we continue on the path we're going with technology, I think we're in big trouble, like as a species and not just as a species, but even as me as an individual member of the species."}, {"time": 259, "text": "So if we could change rhetoric to be more like to think upwards, like to think about that we're in a simulation and how we could get out, already we'd be on the right path."}, {"time": 272, "text": "What you actually do once you do that, well, I assume I would have acquired way more intelligence in the process of doing that."}, {"time": 278, "text": "So I'll just ask that."}, {"time": 279, "text": "So the thinking upwards, what kind of ideas, what kind of breakthrough ideas do you think thinking in that way could inspire?"}, {"time": 287, "text": "And why did you say upwards?"}, {"time": 289, "text": "Upwards."}, {"time": 290, "text": "Into space?"}, {"time": 291, "text": "Are you thinking sort of exploration in all forms?"}, {"time": 294, "text": "The space narrative that held for the modernist generation doesn't hold as well for the postmodern generation."}, {"time": 304, "text": "What's the space narrative?"}, {"time": 305, "text": "Are we talking about the same space, the three dimensional space?"}, {"time": 307, "text": "No, no, no, space, like going on space, like building like Elon Musk, like we're going to build rockets, we're going to go to Mars, we're going to colonize the universe."}, {"time": 313, "text": "And the narrative you're referring, I was born in the Soviet Union, you're referring to the race to space."}, {"time": 317, "text": "The race to space, yeah."}, {"time": 318, "text": "Explore, okay."}, {"time": 319, "text": "That was a great modernist narrative."}, {"time": 323, "text": "It doesn't seem to hold the same weight in today's culture."}, {"time": 327, "text": "I'm hoping for good postmodern narratives that replace it."}, {"time": 332, "text": "So let's think, so you work a lot with AI."}, {"time": 335, "text": "So AI is one formulation of that narrative."}, {"time": 339, "text": "There could be also, I don't know how much you do in VR and AR."}, {"time": 343, "text": "That's another, I know less about it, but every time I play with it in our research, it's fascinating, that virtual world."}, {"time": 349, "text": "Are you interested in the virtual world?"}, {"time": 351, "text": "I would like to move to virtual reality."}, {"time": 355, "text": "In terms of your work?"}, {"time": 356, "text": "No, I would like to physically move there."}, {"time": 358, "text": "The apartment I can rent in the cloud is way better than the apartment I can rent in the real world."}, {"time": 363, "text": "Well, it's all relative, isn't it?"}, {"time": 364, "text": "Because others will have very nice apartments too, so you'll be inferior in the virtual world as well."}, {"time": 369, "text": "No, but that's not how I view the world, right?"}, {"time": 371, "text": "I don't view the world, I mean, it's a very almost zero sum ish way to view the world."}, {"time": 376, "text": "Say like, my great apartment isn't great because my neighbor has one too."}, {"time": 380, "text": "No, my great apartment is great because look at this dishwasher, man."}, {"time": 384, "text": "You just touch the dish and it's washed, right?"}, {"time": 386, "text": "And that is great in and of itself if I have the only apartment or if everybody had the apartment."}, {"time": 392, "text": "So you have fundamental gratitude."}, {"time": 394, "text": "The world first learned of George Hots in August 2007, maybe before then, but certainly in August 2007 when you were the first person to unlock, carry unlock an iPhone."}, {"time": 408, "text": "How did you get into hacking?"}, {"time": 410, "text": "What was the first system you discovered vulnerabilities for and broke into?"}, {"time": 416, "text": "So that was really kind of the first thing."}, {"time": 421, "text": "I had a book in 2006 called Grey Hat Hacking."}, {"time": 426, "text": "And I guess I realized that if you acquired these sort of powers, you could control the world."}, {"time": 436, "text": "But I didn't really know that much about computers back then."}, {"time": 440, "text": "I started with electronics."}, {"time": 442, "text": "The first iPhone hack was physical."}, {"time": 444, "text": "Cardware."}, {"time": 445, "text": "You had to open it up and pull an address line high."}, {"time": 448, "text": "And it was because I didn't really know about software exploitation."}, {"time": 451, "text": "I learned that all in the next few years and I got very good at it."}, {"time": 453, "text": "But back then I knew about like how memory chips are connected to processors and stuff."}, {"time": 458, "text": "You knew about software and programming."}, {"time": 460, "text": "You just didn't know."}, {"time": 464, "text": "So your view of the world and computers was physical, was hardware."}, {"time": 469, "text": "Actually, if you read the code that I released with that in August 2007, it's atrocious."}, {"time": 475, "text": "What language was it?"}, {"time": 476, "text": "C. C, nice."}, {"time": 478, "text": "And in a broken sort of state machine ask C. I didn't know how to program."}, {"time": 484, "text": "So how did you learn to program?"}, {"time": 487, "text": "What was your journey?"}, {"time": 488, "text": "Cause I mean, we'll talk about it."}, {"time": 490, "text": "You've live streamed some of your programming."}, {"time": 492, "text": "This chaotic, beautiful mess."}, {"time": 494, "text": "How did you arrive at that?"}, {"time": 496, "text": "Years and years of practice."}, {"time": 498, "text": "I interned at Google after the summer after the iPhone unlock."}, {"time": 504, "text": "And I did a contract for them where I built hardware for Street View and I wrote a software library to interact with it."}, {"time": 511, "text": "And it was terrible code."}, {"time": 514, "text": "And for the first time I got feedback from people who I respected saying, no, like don't write code like this."}, {"time": 522, "text": "Now, of course, just getting that feedback is not enough."}, {"time": 525, "text": "The way that I really got good was I wanted to write this thing like that could emulate and then visualize like arm binaries."}, {"time": 537, "text": "Cause I wanted to hack the iPhone better."}, {"time": 539, "text": "And I didn't like that I couldn't like see what the, I couldn't single step through the processor because I had no debugger on there, especially for the low level things like the boot rum and the bootloader."}, {"time": 547, "text": "So I tried to build this tool to do it."}, {"time": 550, "text": "And I built the tool once and it was terrible."}, {"time": 553, "text": "I built the tool a second time, it was terrible."}, {"time": 555, "text": "I built the tool a third time."}, {"time": 556, "text": "This was by the time I was at Facebook, it was kind of okay."}, {"time": 558, "text": "And then I built the tool a fourth time when I was a Google intern again in 2014."}, {"time": 562, "text": "And that was the first time I was like, this is finally usable."}, {"time": 565, "text": "How do you pronounce this Kira?"}, {"time": 567, "text": "Kira, yeah."}, {"time": 568, "text": "So it's essentially the most efficient way to visualize the change of state of the computer as the program is running."}, {"time": 577, "text": "That's what you mean by debugger."}, {"time": 578, "text": "Yeah, it's a timeless debugger."}, {"time": 581, "text": "So you can rewind just as easily as going forward."}, {"time": 585, "text": "Think about if you're using GDB, you have to put a watch on a variable."}, {"time": 587, "text": "If you wanna see if that variable changes."}, {"time": 589, "text": "In Kira, you can just click on that variable and then it shows every single time when that variable was changed or accessed."}, {"time": 596, "text": "Think about it like Git for your computers, the run log."}, {"time": 599, "text": "So there's like a deep log of the state of the computer as the program runs and you can rewind."}, {"time": 607, "text": "Why isn't that, maybe it is, maybe you can educate me."}, {"time": 611, "text": "Why isn't that kind of debugging used more often?"}, {"time": 614, "text": "Cause the tooling's bad."}, {"time": 616, "text": "Well, two things."}, {"time": 617, "text": "One, if you're trying to debug Chrome, Chrome is a 200 megabyte binary that runs slowly on desktops."}, {"time": 625, "text": "So that's gonna be really hard to use for that."}, {"time": 627, "text": "But it's really good to use for like CTFs and for boot roms and for small parts of code."}, {"time": 633, "text": "So it's hard if you're trying to debug like massive systems."}, {"time": 636, "text": "What's a CTF and what's a boot rom?"}, {"time": 638, "text": "A boot rom is the first code that executes the minute you give power to your iPhone."}, {"time": 643, "text": "And CTF where these competitions that I played capture the flag."}, {"time": 646, "text": "Capture the flag, I was gonna ask you about that."}, {"time": 648, "text": "What are those, look at, I watched a couple of videos on YouTube, those look fascinating."}, {"time": 652, "text": "What have you learned about maybe at the high level of vulnerability of systems from these competitions?"}, {"time": 660, "text": "I feel like in the heyday of CTFs, you had all of the best security people in the world challenging each other and coming up with new toy exploitable things over here."}, {"time": 673, "text": "And then everybody, okay, who can break it?"}, {"time": 675, "text": "And when you break it, you get like, there's like a file on the server called flag."}, {"time": 679, "text": "And then there's a program running, listening on a socket that's vulnerable."}, {"time": 682, "text": "So you write an exploit, you get a shell, and then you cat flag, and then you type the flag into like a web based scoreboard and you get points."}, {"time": 689, "text": "So the goal is essentially, to find an exploit in the system that allows you to run shell, to run arbitrary code on that system."}, {"time": 697, "text": "That's one of the categories."}, {"time": 700, "text": "That's like the pwnable category."}, {"time": 703, "text": "Pwnable?"}, {"time": 704, "text": "Yeah, pwnable."}, {"time": 705, "text": "It's like, you know, you pwn the program."}, {"time": 707, "text": "It's a program that's, yeah."}, {"time": 708, "text": "Yeah, you know, first of all, I apologize."}, {"time": 714, "text": "I'm gonna say it's because I'm Russian, but maybe you can help educate me."}, {"time": 720, "text": "Some video game like misspelled own way back in the day."}, {"time": 722, "text": "Yeah, and it's just, I wonder if there's a definition."}, {"time": 726, "text": "I'll have to go to Urban Dictionary for it."}, {"time": 728, "text": "It'll be interesting to see what it says."}, {"time": 729, "text": "Okay, so what was the heyday of CTF, by the way?"}, {"time": 732, "text": "But was it, what decade are we talking about?"}, {"time": 735, "text": "I think like, I mean, maybe unbiased because it's the era that I played, but like 2011 to 2015, because the modern CTF scene is similar to the modern competitive programming scene."}, {"time": 752, "text": "You have people who like do drills."}, {"time": 754, "text": "You have people who practice."}, {"time": 755, "text": "And then once you've done that, you've turned it less into a game of generic computer skill and more into a game of, okay, you drill on these five categories."}, {"time": 764, "text": "And then before that, it wasn't, it didn't have like as much attention as it had."}, {"time": 772, "text": "I don't know, they were like, I won $30,000 once in Korea for one of these competitions."}, {"time": 776, "text": "Holy crap."}, {"time": 776, "text": "Yeah, they were, they were, that was."}, {"time": 777, "text": "So that means, I mean, money is money, but that means there was probably good people there."}, {"time": 783, "text": "Are the challenges human constructed or are they grounded in some real flaws and real systems?"}, {"time": 790, "text": "Usually they're human constructed, but they're usually inspired by real flaws."}, {"time": 795, "text": "What kind of systems are imagined is really focused on mobile."}, {"time": 799, "text": "Like what has vulnerabilities these days?"}, {"time": 800, "text": "Is it primarily mobile systems like Android?"}, {"time": 805, "text": "Oh, everything does."}, {"time": 806, "text": "Yeah, of course."}, {"time": 808, "text": "The price has kind of gone up because less and less people can find them."}, {"time": 811, "text": "And what's happened in security is now if you want to like jailbreak an iPhone, you don't need one exploit anymore, you need nine."}, {"time": 817, "text": "Nine chained together, what would it mean?"}, {"time": 820, "text": "Okay, so it's really, what's the benefit speaking higher level philosophically about hacking?"}, {"time": 828, "text": "I mean, it sounds from everything I've seen about you, you just love the challenge and you don't want to do anything."}, {"time": 834, "text": "You don't want to bring that exploit out into the world and do any actual, let it run wild."}, {"time": 841, "text": "You just want to solve it and then you go on to the next thing."}, {"time": 845, "text": "Oh yeah, I mean, doing criminal stuff's not really worth it."}, {"time": 848, "text": "And I'll actually use the same argument for why I don't do defense for why I don't do crime."}, {"time": 855, "text": "If you want to defend a system, say the system has 10 holes, right?"}, {"time": 859, "text": "If you find nine of those holes as a defender, you still lose because the attacker gets in through the last one."}, {"time": 865, "text": "If you're an attacker, you only have to find one out of the 10."}, {"time": 868, "text": "But if you're a criminal, if you log on with a VPN nine out of the 10 times, but one time you forget, you're done."}, {"time": 877, "text": "Because you're caught, okay."}, {"time": 879, "text": "Because you only have to mess up once to be caught as a criminal."}, {"time": 882, "text": "That's why I'm not a criminal."}, {"time": 885, "text": "But okay, let me, because I was having a discussion with somebody just at a high level about nuclear weapons actually, why we're having blown ourselves up yet."}, {"time": 896, "text": "And my feeling is all the smart people in the world, if you look at the distribution of smart people, smart people are generally good."}, {"time": 906, "text": "And then this other person I was talking to, Sean Carroll, the physicist, and he was saying, no, good and bad people are evenly distributed amongst everybody."}, {"time": 913, "text": "My sense was good hackers are in general good people and they don't want to mess with the world."}, {"time": 920, "text": "What's your sense?"}, {"time": 921, "text": "I'm not even sure about that."}, {"time": 925, "text": "Like, I have a nice life."}, {"time": 930, "text": "Crime wouldn't get me anything."}, {"time": 934, "text": "But if you're good and you have these skills, you probably have a nice life too, right?"}, {"time": 938, "text": "Right, you can use it for other things."}, {"time": 940, "text": "But is there an ethical, is there a little voice in your head that says, well, yeah, if you could hack something to where you could hurt people and you could earn a lot of money doing it though, not hurt physically perhaps, but disrupt their life in some kind of way, isn't there a little voice that says?"}, {"time": 964, "text": "One, I don't really care about money."}, {"time": 966, "text": "So like the money wouldn't be an incentive."}, {"time": 968, "text": "The thrill might be an incentive."}, {"time": 970, "text": "But when I was 19, I read Crime and Punishment."}, {"time": 974, "text": "And that was another great one that talked me out of ever really doing crime."}, {"time": 979, "text": "Cause it's like, that's gonna be me."}, {"time": 981, "text": "I'd get away with it, but it would just run through my head."}, {"time": 985, "text": "Even if I got away with it, you know?"}, {"time": 986, "text": "And then you do crime for long enough, you'll never get away with it."}, {"time": 989, "text": "In the end, that's a good reason to be good."}, {"time": 992, "text": "I wouldn't say I'm good."}, {"time": 993, "text": "I would just say I'm not bad."}, {"time": 994, "text": "You're a talented programmer and a hacker in a good positive sense of the word."}, {"time": 1000, "text": "You've played around, found vulnerabilities in various systems."}, {"time": 1004, "text": "What have you learned broadly about the design of systems and so on from that whole process?"}, {"time": 1013, "text": "You learn to not take things for what people say they are, but you look at things for what they actually are."}, {"time": 1027, "text": "I understand that's what you tell me it is, but what does it do?"}, {"time": 1032, "text": "And you have nice visualization tools to really know what it's really doing."}, {"time": 1036, "text": "Oh, I wish."}, {"time": 1037, "text": "I'm a better programmer now than I was in 2014."}, {"time": 1040, "text": "I said, Kira, that was the first tool that I wrote that was usable."}, {"time": 1043, "text": "I wouldn't say the code was great."}, {"time": 1045, "text": "I still wouldn't say my code is great."}, {"time": 1048, "text": "So how was your evolution as a programmer except practice?"}, {"time": 1051, "text": "So you started with C. At which point did you pick up Python?"}, {"time": 1055, "text": "Because you're pretty big in Python now."}, {"time": 1057, "text": "Now, yeah, in college."}, {"time": 1059, "text": "I went to Carnegie Mellon when I was 22."}, {"time": 1062, "text": "I went back."}, {"time": 1063, "text": "I'm like, all right, I'm gonna take all your hardest CS courses."}, {"time": 1066, "text": "We'll see how I do, right?"}, {"time": 1067, "text": "Like, did I miss anything by not having a real undergraduate education?"}, {"time": 1071, "text": "Took operating systems, compilers, AI, and they're like a freshman wheat or math course."}, {"time": 1078, "text": "And... Operating systems, some of those classes you mentioned are pretty tough, actually."}, {"time": 1085, "text": "At least the 2012, circa 2012, operating systems and compilers were two of the, they were the best classes I've ever taken in my life."}, {"time": 1094, "text": "Because you write an operating system and you write a compiler."}, {"time": 1098, "text": "I wrote my operating system in C and I wrote my compiler in Haskell, but somehow I picked up Python that semester as well."}, {"time": 1106, "text": "I started using it for the CTFs, actually."}, {"time": 1108, "text": "That's when I really started to get into CTFs and CTFs, you're all, it's a race against the clock."}, {"time": 1113, "text": "So I can't write things in C. Oh, there's a clock component."}, {"time": 1116, "text": "So you really want to use the programming languages so you can be fastest."}, {"time": 1118, "text": "48 hours, pwn as many of these challenges as you can."}, {"time": 1121, "text": "Pwn."}, {"time": 1122, "text": "Yeah, you got like a hundred points of challenge."}, {"time": 1123, "text": "Whatever team gets the most."}, {"time": 1126, "text": "You were both at Facebook and Google for a brief stint."}, {"time": 1131, "text": "With Project Zero actually at Google for five months where you developed Kira."}, {"time": 1136, "text": "What was Project Zero about in general?"}, {"time": 1139, "text": "What, I'm just curious about the security efforts in these companies."}, {"time": 1145, "text": "Well, Project Zero started the same time I went there."}, {"time": 1148, "text": "What years are there?"}, {"time": 1153, "text": "So that was right at the beginning of Project Zero."}, {"time": 1155, "text": "It's small."}, {"time": 1156, "text": "It's Google's offensive security team."}, {"time": 1161, "text": "I'll try to give the best public facing explanation that I can."}, {"time": 1166, "text": "So the idea is basically these vulnerabilities exist in the world."}, {"time": 1173, "text": "Nation states have them."}, {"time": 1175, "text": "Some high powered bad actors have them."}, {"time": 1179, "text": "Sometime people will find these vulnerabilities and submit them in bug bounties to the companies."}, {"time": 1187, "text": "But a lot of the companies don't really care."}, {"time": 1189, "text": "They don't even fix the bug."}, {"time": 1191, "text": "It doesn't hurt for there to be a vulnerability."}, {"time": 1193, "text": "So Project Zero is like, we're going to do it different."}, {"time": 1195, "text": "We're going to announce a vulnerability and we're going to give them 90 days to fix it."}, {"time": 1199, "text": "And then whether they fix it or not, we're going to drop the zero day."}, {"time": 1204, "text": "We're going to drop the weapon."}, {"time": 1204, "text": "That's so cool."}, {"time": 1205, "text": "That is so cool."}, {"time": 1207, "text": "I love the deadlines."}, {"time": 1209, "text": "Oh, that's so cool."}, {"time": 1210, "text": "Give them real deadlines."}, {"time": 1212, "text": "And I think it's done a lot for moving the industry forward."}, {"time": 1215, "text": "I watched your coding sessions on the streamed online."}, {"time": 1220, "text": "You code things up, the basic projects, usually from scratch."}, {"time": 1224, "text": "I would say sort of as a programmer myself, just watching you that you type really fast and your brain works in both brilliant and chaotic ways."}, {"time": 1234, "text": "I don't know if that's always true, but certainly for the live streams."}, {"time": 1237, "text": "So it's interesting to me because I'm more, I'm much slower and systematic and careful."}, {"time": 1243, "text": "And you just move, I mean, probably in order of magnitude faster."}, {"time": 1248, "text": "So I'm curious, is there a method to your madness?"}, {"time": 1251, "text": "Is it just who you are?"}, {"time": 1253, "text": "There's pros and cons."}, {"time": 1254, "text": "There's pros and cons to my programming style."}, {"time": 1258, "text": "And I'm aware of them."}, {"time": 1259, "text": "Like if you ask me to like get something up and working quickly with like an API that's kind of undocumented, I will do this super fast because I will throw things at it until it works."}, {"time": 1270, "text": "If you ask me to take a vector and rotate it 90 degrees and then flip it over the XY plane, I'll spam program for two hours and won't get it."}, {"time": 1282, "text": "Oh, because it's something that you could do with a sheet of paper, think through design, and then just, do you really just throw stuff at the wall and you get so good at it that it usually works?"}, {"time": 1294, "text": "I should become better at the other kind as well."}, {"time": 1296, "text": "Sometimes I'll do things methodically."}, {"time": 1299, "text": "It's nowhere near as entertaining on the Twitch streams."}, {"time": 1301, "text": "I do exaggerate it a bit on the Twitch streams as well."}, {"time": 1303, "text": "The Twitch streams, I mean, what do you want to see a game or you want to see actions per minute, right?"}, {"time": 1306, "text": "I'll show you APM for programming too."}, {"time": 1308, "text": "Yeah, I recommend people go to it."}, {"time": 1310, "text": "I think I watched, I watched probably several hours of you, like I've actually left you programming in the background while I was programming because you made me, it was like watching a really good gamer."}, {"time": 1323, "text": "It's like energizes you because you're like moving so fast."}, {"time": 1326, "text": "It's so, it's awesome."}, {"time": 1327, "text": "It's inspiring and it made me jealous that like, because my own programming is inadequate in terms of speed."}, {"time": 1335, "text": "Oh, I was like."}, {"time": 1337, "text": "So I'm twice as frantic on the live streams as I am when I code without them."}, {"time": 1342, "text": "It's super entertaining."}, {"time": 1343, "text": "So I wasn't even paying attention to what you were coding, which is great."}, {"time": 1347, "text": "It's just watching you switch windows and Vim I guess is the most."}, {"time": 1351, "text": "Yeah, there's Vim on screen."}, {"time": 1353, "text": "I've developed the workload at Facebook and stuck with it."}, {"time": 1355, "text": "How do you learn new programming tools, ideas, techniques these days?"}, {"time": 1359, "text": "What's your like a methodology for learning new things?"}, {"time": 1362, "text": "So I wrote for comma, the distributed file systems out in the world are extremely complex."}, {"time": 1370, "text": "Like if you want to install something like like like Ceph, Ceph is I think the like open infrastructure distributed file system, or there's like newer ones like seaweed FS, but these are all like 10,000 plus line projects."}, {"time": 1386, "text": "I think some of them are even a hundred thousand line and just configuring them as a nightmare."}, {"time": 1391, "text": "So I wrote, I wrote one, it's 200 lines and it's, it uses like NGINX and volume servers and has this little master server that I wrote in Go."}, {"time": 1401, "text": "And the way I go, this, if I would say that I'm proud per line of any code I wrote, maybe there's some exploits that I think are beautiful."}, {"time": 1409, "text": "And then this, this is 200 lines."}, {"time": 1411, "text": "And just the way that I thought about it, I think was very good."}, {"time": 1414, "text": "And the reason it's very good is because that was the fourth version of it that I wrote."}, {"time": 1417, "text": "And I had three versions that I threw away."}, {"time": 1419, "text": "You mentioned, did you say Go?"}, {"time": 1420, "text": "I wrote in Go, yeah."}, {"time": 1421, "text": "In Go."}, {"time": 1422, "text": "Is that a functional language?"}, {"time": 1423, "text": "I forget what Go is."}, {"time": 1425, "text": "Go is Google's language."}, {"time": 1428, "text": "It's not functional."}, {"time": 1429, "text": "It's some, it's like in a way it's C++, but easier."}, {"time": 1436, "text": "It's, it's strongly typed."}, {"time": 1438, "text": "It has a nice ecosystem around it."}, {"time": 1439, "text": "When I first looked at it, I was like, this is like Python, but it takes twice as long to do anything."}, {"time": 1445, "text": "Now that I've, OpenPilot is migrating to C, but it still has large Python components."}, {"time": 1450, "text": "I now understand why Python doesn't work for large code bases and why you want something like Go."}, {"time": 1456, "text": "So why, why doesn't Python work for, so even most, speaking for myself at least, like we do a lot of stuff, basically demo level work with autonomous vehicles and most of the work is Python."}, {"time": 1469, "text": "Why doesn't Python work for large code bases?"}, {"time": 1472, "text": "Because, well, lack of type checking is a big part."}, {"time": 1477, "text": "So errors creep in."}, {"time": 1480, "text": "And like, you don't know, the compiler can tell you like nothing, right?"}, {"time": 1485, "text": "So everything is either, you know, like, like syntax errors, fine."}, {"time": 1489, "text": "But if you misspell a variable in Python, the compiler won't catch that."}, {"time": 1493, "text": "There's like linters that can catch it some of the time."}, {"time": 1496, "text": "There's no types."}, {"time": 1497, "text": "This is really the biggest downside."}, {"time": 1500, "text": "And then, well, Python's slow, but that's not related to it."}, {"time": 1502, "text": "Well, maybe it's kind of related to it, so it's lack of."}, {"time": 1504, "text": "So what's, what's in your toolbox these days?"}, {"time": 1506, "text": "Is it Python?"}, {"time": 1508, "text": "I need to move to something else."}, {"time": 1510, "text": "My adventure into dependently typed languages, I love these languages."}, {"time": 1514, "text": "They just have like syntax from the 80s."}, {"time": 1518, "text": "What do you think about JavaScript?"}, {"time": 1521, "text": "ES6, like the modern, or TypeScript?"}, {"time": 1523, "text": "JavaScript is, the whole ecosystem is unbelievably confusing."}, {"time": 1529, "text": "NPM updates a package from 0.2.2 to 0.2.5, and that breaks your Babel linter, which translates your ES5 into ES6, which doesn't run on, so."}, {"time": 1539, "text": "Why do I have to compile my JavaScript again, huh?"}, {"time": 1542, "text": "It may be the future, though."}, {"time": 1544, "text": "You think about, I mean, I've embraced JavaScript recently, just because, just like I've continually embraced PHP, it seems that these worst possible languages live on for the longest, like cockroaches never die."}, {"time": 1558, "text": "Well, it's in the browser, and it's fast."}, {"time": 1560, "text": "It's fast."}, {"time": 1562, "text": "It's in the browser, and compute might stay, become, you know, the browser."}, {"time": 1566, "text": "It's unclear what the role of the browser is in terms of distributed computation in the future, so."}, {"time": 1573, "text": "JavaScript is definitely here to stay."}, {"time": 1576, "text": "It's interesting if autonomous vehicles will run on JavaScript one day."}, {"time": 1579, "text": "I mean, you have to consider these possibilities."}, {"time": 1581, "text": "Well, all our debug tools are JavaScript."}, {"time": 1584, "text": "We actually just open sourced them."}, {"time": 1586, "text": "We have a tool, Explorer, which you can annotate your disengagements, and we have a tool, Cabana, which lets you analyze the can traffic from the car."}, {"time": 1592, "text": "So basically, anytime you're visualizing something about the log, you're using JavaScript."}, {"time": 1597, "text": "Well, the web is the best UI toolkit by far, so."}, {"time": 1601, "text": "And then, you know what?"}, {"time": 1602, "text": "You're coding in JavaScript."}, {"time": 1602, "text": "We have a React guy."}, {"time": 1603, "text": "He's good."}, {"time": 1604, "text": "React, nice."}, {"time": 1606, "text": "Let's get into it."}, {"time": 1606, "text": "So let's talk autonomous vehicles."}, {"time": 1609, "text": "You founded Comma AI."}, {"time": 1611, "text": "Let's, at a high level, how did you get into the world of vehicle automation?"}, {"time": 1617, "text": "Can you also just, for people who don't know, tell the story of Comma AI?"}, {"time": 1622, "text": "So I was working at this AI startup, and a friend approached me, and he's like, dude, I don't know where this is going, but the coolest applied AI problem today is self driving cars."}, {"time": 1636, "text": "I'm like, well, absolutely."}, {"time": 1638, "text": "You want to meet with Elon Musk, and he's looking for somebody to build a vision system for autopilot."}, {"time": 1647, "text": "This is when they were still on AP1."}, {"time": 1649, "text": "They were still using Mobileye."}, {"time": 1650, "text": "Elon, back then, was looking for a replacement, and he brought me in, and we talked about a contract where I would deliver something that meets Mobileye level performance."}, {"time": 1661, "text": "I would get paid $12 million if I could deliver it tomorrow, and I would lose $1 million for every month I didn't deliver."}, {"time": 1667, "text": "So I was like, okay, this is a great deal."}, {"time": 1669, "text": "This is a super exciting challenge."}, {"time": 1672, "text": "You know what?"}, {"time": 1673, "text": "Even if it takes me 10 months, I get $2 million."}, {"time": 1676, "text": "Maybe I can finish up in five."}, {"time": 1677, "text": "Maybe I don't finish it at all, and I get paid nothing, and I can still work for 12 months for free."}, {"time": 1680, "text": "So maybe just take a pause on that."}, {"time": 1682, "text": "I'm also curious about this because I've been working in robotics for a long time, and I'm curious to see a person like you just step in and sort of somewhat naive, but brilliant, right?"}, {"time": 1691, "text": "So that's the best place to be because you basically full steam take on a problem."}, {"time": 1697, "text": "How confident, how, from that time, because you know a lot more now, at that time, how hard do you think it is to solve all of autonomous driving?"}, {"time": 1705, "text": "I remember I suggested to Elon in the meeting putting a GPU behind each camera to keep the compute local."}, {"time": 1715, "text": "This is an incredibly stupid idea."}, {"time": 1718, "text": "I leave the meeting 10 minutes later, and I'm like, I could have spent a little bit of time thinking about this problem before I went in."}, {"time": 1722, "text": "Why is it a stupid idea?"}, {"time": 1724, "text": "Oh, just send all your cameras to one big GPU."}, {"time": 1726, "text": "You're much better off doing that."}, {"time": 1729, "text": "You said behind every camera have a GPU."}, {"time": 1730, "text": "Every camera have a small GPU."}, {"time": 1731, "text": "I was like, oh, I'll put the first few layers of my comms there."}, {"time": 1734, "text": "Ugh, why'd I say that?"}, {"time": 1736, "text": "That's possible."}, {"time": 1736, "text": "It's possible, but it's a bad idea."}, {"time": 1738, "text": "It's not obviously a bad idea."}, {"time": 1740, "text": "Pretty obviously bad, but whether it's actually a bad idea or not, I left that meeting with Elon, beating myself up."}, {"time": 1745, "text": "I'm like, why'd I say something stupid?"}, {"time": 1747, "text": "Yeah, you haven't at least thought through every aspect of it, yeah."}, {"time": 1752, "text": "He's very sharp too."}, {"time": 1753, "text": "Usually in life, I get away with saying stupid things and then kind of course, oh, right away he called me out about it."}, {"time": 1758, "text": "And usually in life, I get away with saying stupid things and then a lot of times people don't even notice and I'll correct it and bring the conversation back."}, {"time": 1768, "text": "But with Elon, it was like, nope, okay, well."}, {"time": 1771, "text": "That's not at all why the contract fell through."}, {"time": 1773, "text": "I was much more prepared the second time I met him."}, {"time": 1775, "text": "Yeah, but in general, how hard did you think it is?"}, {"time": 1779, "text": "Like 12 months is a tough timeline."}, {"time": 1783, "text": "Oh, I just thought I'd clone Mobileye IQ3."}, {"time": 1785, "text": "I didn't think I'd solve level five self driving or anything."}, {"time": 1788, "text": "So the goal there was to do lane keeping, good lane keeping."}, {"time": 1792, "text": "I saw, my friend showed me the outputs from a Mobileye and the outputs from a Mobileye was just basically two lanes at a position of a lead car."}, {"time": 1799, "text": "I'm like, I can gather a data set and train this net in weeks and I did."}, {"time": 1804, "text": "Well, first time I tried the implementation of Mobileye in a Tesla, I was really surprised how good it is."}, {"time": 1811, "text": "It's going incredibly good."}, {"time": 1812, "text": "Cause I thought it's just cause I've done a lot of computer vision, I thought it'd be a lot harder to create a system that that's stable."}, {"time": 1820, "text": "So I was personally surprised, you know, have to admit it."}, {"time": 1825, "text": "Cause I was kind of skeptical before trying it."}, {"time": 1827, "text": "Cause I thought it would go in and out a lot more."}, {"time": 1831, "text": "It would get disengaged a lot more and it's pretty robust."}, {"time": 1836, "text": "So what, how hard is the problem when you tackled it?"}, {"time": 1842, "text": "So I think AP1 was great."}, {"time": 1844, "text": "Like Elon talked about disengagements on the 405 down in LA with like the lane marks are kind of faded and the Mobileye system would drop out."}, {"time": 1853, "text": "Like I had something up and working that I would say was like the same quality in three months."}, {"time": 1862, "text": "Same quality, but how do you know?"}, {"time": 1864, "text": "You say stuff like that confidently, but you can't, and I love it, but the question is you can't, you're kind of going by feel cause you test it out."}, {"time": 1875, "text": "Like I would take, I borrowed my friend's Tesla."}, {"time": 1878, "text": "I would take AP1 out for a drive and then I would take my system out for a drive."}, {"time": 1882, "text": "And it seems reasonably like the same."}, {"time": 1885, "text": "So the 405, how hard is it to create something that could actually be a product that's deployed?"}, {"time": 1894, "text": "I mean, I've read an article where Elon, this respondent said something about you saying that to build autopilot is more complicated than a single George Hodge level job."}, {"time": 1911, "text": "How hard is that job to create something that would work across globally?"}, {"time": 1918, "text": "Why don't think globally is the challenge?"}, {"time": 1920, "text": "But Elon followed that up by saying it's gonna take two years in a company of 10 people."}, {"time": 1924, "text": "And here I am four years later with a company of 12 people."}, {"time": 1927, "text": "And I think we still have another two to go."}, {"time": 1929, "text": "Two years, so yeah."}, {"time": 1931, "text": "So what do you think about how Tesla is progressing with autopilot of V2, V3?"}, {"time": 1939, "text": "I think we've kept pace with them pretty well."}, {"time": 1943, "text": "I think navigate and autopilot is terrible."}, {"time": 1946, "text": "We had some demo features internally of the same stuff and we would test it."}, {"time": 1952, "text": "And I'm like, I'm not shipping this even as like open source software to people."}, {"time": 1955, "text": "Why do you think it's terrible?"}, {"time": 1957, "text": "Consumer Reports does a great job of describing it."}, {"time": 1959, "text": "Like when it makes a lane change, it does it worse than a human."}, {"time": 1963, "text": "You shouldn't ship things like autopilot, open pilot."}, {"time": 1966, "text": "They lane keep better than a human."}, {"time": 1969, "text": "If you turn it on for a stretch of a highway, like an hour long, it's never gonna touch a lane line."}, {"time": 1976, "text": "Human will touch probably a lane line twice."}, {"time": 1978, "text": "You just inspired me."}, {"time": 1980, "text": "I don't know if you're grounded in data on that."}, {"time": 1982, "text": "I read your paper."}, {"time": 1983, "text": "Okay, but that's interesting."}, {"time": 1985, "text": "I wonder actually how often we touch lane lines in general, like a little bit, because it is."}, {"time": 1993, "text": "I could answer that question pretty easily with the common data set."}, {"time": 1995, "text": "Yeah, I'm curious."}, {"time": 1996, "text": "I've never answered it."}, {"time": 1998, "text": "I just, two is like my personal."}, {"time": 1999, "text": "It feels right."}, {"time": 2002, "text": "Because every time you touch a lane, that's a source of a little bit of stress and kind of lane keeping is removing that stress."}, {"time": 2009, "text": "That's ultimately the biggest value add honestly is just removing the stress of having to stay in lane."}, {"time": 2015, "text": "And I think honestly, I don't think people fully realize, first of all, that that's a big value add, but also that that's all it is."}, {"time": 2024, "text": "And that not only, I find it a huge value add."}, {"time": 2028, "text": "I drove down when we moved to San Diego, I drove down in a enterprise rental car and I missed it."}, {"time": 2033, "text": "So I missed having the system so much."}, {"time": 2035, "text": "It's so much more tiring to drive without it."}, {"time": 2040, "text": "It is that lane centering."}, {"time": 2042, "text": "That's the key feature."}, {"time": 2046, "text": "And in a way, it's the only feature that actually adds value to people's lives in autonomous vehicles today."}, {"time": 2052, "text": "Waymo does not add value to people's lives."}, {"time": 2053, "text": "It's a more expensive, slower Uber."}, {"time": 2055, "text": "Maybe someday it'll be this big cliff where it adds value, but I don't usually believe it."}, {"time": 2059, "text": "It is fascinating."}, {"time": 2060, "text": "I haven't talked to, this is good."}, {"time": 2062, "text": "Cause I haven't, I have intuitively, but I think we're making it explicit now."}, {"time": 2068, "text": "I actually believe that really good lane keeping is a reason to buy a car."}, {"time": 2077, "text": "Will be a reason to buy a car and it's a huge value add."}, {"time": 2079, "text": "I've never, until we just started talking about it, I haven't really quite realized it."}, {"time": 2083, "text": "That I've felt with Elon's chase of level four is not the correct chase."}, {"time": 2092, "text": "It was on, cause you should just say Tesla has the best as if from a Tesla perspective, say, Tesla has the best lane keeping."}, {"time": 2100, "text": "Comma AI should say, Comma AI is the best lane keeping."}, {"time": 2104, "text": "And that is it."}, {"time": 2106, "text": "So do you think?"}, {"time": 2107, "text": "You have to do the longitudinal as well."}, {"time": 2109, "text": "You can't just lane keep."}, {"time": 2110, "text": "You have to do ACC, but ACC is much more forgiving than lane keep, especially on the highway."}, {"time": 2117, "text": "By the way, are you Comma AI's camera only, correct?"}, {"time": 2121, "text": "No, we use the radar."}, {"time": 2123, "text": "From the car, you're able to get the, okay."}, {"time": 2125, "text": "Hmm?"}, {"time": 2126, "text": "We can do a camera only now."}, {"time": 2128, "text": "It's gotten to the point, but we leave the radar there as like a, it's fusion now."}, {"time": 2133, "text": "Okay, so let's maybe talk through some of the system specs on the hardware."}, {"time": 2137, "text": "What's the hardware side of what you're providing?"}, {"time": 2142, "text": "What's the capabilities on the software side with OpenPilot and so on?"}, {"time": 2146, "text": "So OpenPilot, as the box that we sell, that it runs on, it's a phone in a plastic case."}, {"time": 2154, "text": "It's nothing special."}, {"time": 2155, "text": "We sell it without the software."}, {"time": 2156, "text": "So you buy the phone, it's just easy."}, {"time": 2159, "text": "It'll be easy set up, but it's sold with no software."}, {"time": 2163, "text": "OpenPilot right now is about to be 0.6."}, {"time": 2167, "text": "When it gets to 1.0, I think we'll be ready for a consumer product."}, {"time": 2170, "text": "We're not gonna add any new features."}, {"time": 2171, "text": "We're just gonna make the lane keeping really, really good."}, {"time": 2174, "text": "Okay, I got it."}, {"time": 2175, "text": "So what do we have right now?"}, {"time": 2176, "text": "It's a Snapdragon 820."}, {"time": 2180, "text": "It's a Sony IMX 298 forward facing camera."}, {"time": 2184, "text": "Driver monitoring camera, it's just a selfie camera on the phone."}, {"time": 2187, "text": "And a CAN transceiver, maybe there's a little thing called PANDAS."}, {"time": 2193, "text": "And they talk over USB to the phone and then they have three CAN buses that they talk to the car."}, {"time": 2199, "text": "One of those CAN buses is the radar CAN bus."}, {"time": 2202, "text": "One of them is the main car CAN bus and the other one is the proxy camera CAN bus."}, {"time": 2206, "text": "We leave the existing camera in place so we don't turn AEB off."}, {"time": 2210, "text": "Right now, we still turn AEB off if you're using our longitudinal, but we're gonna fix that before 1.0."}, {"time": 2216, "text": "Wow, that's cool."}, {"time": 2217, "text": "And it's CAN both ways."}, {"time": 2219, "text": "So how are you able to control vehicles?"}, {"time": 2223, "text": "So we proxy, the vehicles that we work with already have a lane keeping assist system."}, {"time": 2230, "text": "So lane keeping assist can mean a huge variety of things."}, {"time": 2233, "text": "It can mean it will apply a small torque to the wheel after you've already crossed a lane line by a foot, which is the system in the older Toyotas versus like, I think Tesla still calls it lane keeping assist, where it'll keep you perfectly in the center of the lane on the highway."}, {"time": 2252, "text": "You can control, like with the joystick, the car."}, {"time": 2255, "text": "So these cars already have the capability of drive by wire."}, {"time": 2257, "text": "So is it trivial to convert a car that it operates with?"}, {"time": 2265, "text": "OpenPILOT is able to control the steering?"}, {"time": 2268, "text": "Oh, a new car or a car that we, so we have support now for 45 different makes of cars."}, {"time": 2272, "text": "What are the cars in general?"}, {"time": 2274, "text": "Mostly Hondas and Toyotas."}, {"time": 2276, "text": "We support almost every Honda and Toyota made this year."}, {"time": 2281, "text": "And then a bunch of GMs, a bunch of Subarus, a bunch of Chevys."}, {"time": 2285, "text": "It doesn't have to be like a Prius, it could be a Corolla as well."}, {"time": 2287, "text": "Oh, the 2020 Corolla is the best car with OpenPILOT."}, {"time": 2290, "text": "It just came out."}, {"time": 2291, "text": "The actuator has less lag than the older Corolla."}, {"time": 2295, "text": "I think I started watching a video with your, I mean, the way you make videos is awesome."}, {"time": 2301, "text": "You're just literally at the dealership streaming."}, {"time": 2304, "text": "Yeah, I had my friend on the phone, I'm like, bro, you wanna stream for an hour?"}, {"time": 2307, "text": "Yeah, and basically, like if stuff goes a little wrong, you're just like, you just go with it."}, {"time": 2313, "text": "Yeah, I love it."}, {"time": 2313, "text": "Well, it's real."}, {"time": 2314, "text": "Yeah, it's real."}, {"time": 2315, "text": "That's so beautiful and it's so in contrast to the way other companies would put together a video like that."}, {"time": 2324, "text": "Kind of why I like to do it like that."}, {"time": 2326, "text": "I mean, if you become super rich one day and successful, I hope you keep it that way because I think that's actually what people love, that kind of genuine."}, {"time": 2334, "text": "Oh, it's all that has value to me."}, {"time": 2336, "text": "Money has no, if I sell out to like make money, I sold out, it doesn't matter."}, {"time": 2341, "text": "What do I get?"}, {"time": 2342, "text": "Yacht?"}, {"time": 2343, "text": "I don't want a yacht."}, {"time": 2344, "text": "And I think Tesla's actually has a small inkling of that as well with Autonomy Day."}, {"time": 2351, "text": "They did reveal more than, I mean, of course, there's marketing communications, you could tell, but it's more than most companies would reveal, which is, I hope they go towards that direction more, other companies, GM, Ford."}, {"time": 2363, "text": "Oh, Tesla's gonna win level five."}, {"time": 2365, "text": "They really are."}, {"time": 2366, "text": "So let's talk about it."}, {"time": 2367, "text": "You think, you're focused on level two currently?"}, {"time": 2372, "text": "Currently."}, {"time": 2373, "text": "We're gonna be one to two years behind Tesla getting to level five."}, {"time": 2378, "text": "We're Android, right?"}, {"time": 2379, "text": "We're Android."}, {"time": 2380, "text": "You're Android."}, {"time": 2381, "text": "I'm just saying, once Tesla gets it, we're one to two years behind."}, {"time": 2383, "text": "I'm not making any timeline on when Tesla's gonna get it."}, {"time": 2386, "text": "You did, that was brilliant."}, {"time": 2387, "text": "I'm sorry, Tesla investors, if you think you're gonna have an autonomous Robo Taxi fleet by the end of the year."}, {"time": 2392, "text": "Yeah, so that's."}, {"time": 2393, "text": "I'll bet against that."}, {"time": 2394, "text": "So what do you think about this?"}, {"time": 2397, "text": "The most level four companies are kind of just doing their usual safety driver, doing full autonomy kind of testing."}, {"time": 2408, "text": "And then Tesla does basically trying to go from lane keeping to full autonomy."}, {"time": 2415, "text": "What do you think about that approach?"}, {"time": 2416, "text": "How successful would it be?"}, {"time": 2418, "text": "It's a ton better approach."}, {"time": 2420, "text": "Because Tesla is gathering data on a scale that none of them are."}, {"time": 2425, "text": "They're putting real users behind the wheel of the cars."}, {"time": 2429, "text": "It's, I think, the only strategy that works."}, {"time": 2433, "text": "The incremental."}, {"time": 2434, "text": "Well, so there's a few components to Tesla approach that's more than just the incrementalists."}, {"time": 2438, "text": "What you spoke with is the ones, the software, so over the air software updates."}, {"time": 2443, "text": "Necessity."}, {"time": 2444, "text": "I mean Waymo crews have those too."}, {"time": 2446, "text": "Those aren't."}, {"time": 2448, "text": "Those differentiate from the automakers."}, {"time": 2449, "text": "Right, no lane keeping systems have, no cars with lane keeping system have that except Tesla."}, {"time": 2455, "text": "And the other one is the data, the other direction, which is the ability to query the data."}, {"time": 2461, "text": "I don't think they're actually collecting as much data as people think, but the ability to turn on collection and turn it off."}, {"time": 2469, "text": "So I'm both in the robotics world and the psychology human factors world."}, {"time": 2475, "text": "Many people believe that level two autonomy is problematic because of the human factor."}, {"time": 2480, "text": "Like the more the task is automated, the more there's a vigilance decrement."}, {"time": 2486, "text": "You start to fall asleep."}, {"time": 2487, "text": "You start to become complacent, start texting more and so on."}, {"time": 2492, "text": "Cause if we're talking about transition from lane keeping to full autonomy, if you're spending 80% of the time, not supervising the machine, do you worry about what that means to the safety of the drivers?"}, {"time": 2507, "text": "One, we don't consider open pilot to be 1.0 until we have 100% driver monitoring."}, {"time": 2512, "text": "You can cheat right now, our driver monitoring system."}, {"time": 2515, "text": "There's a few ways to cheat it."}, {"time": 2516, "text": "They're pretty obvious."}, {"time": 2518, "text": "We're working on making that better."}, {"time": 2519, "text": "Before we ship a consumer product that can drive cars, I want to make sure that I have driver monitoring that you can't cheat."}, {"time": 2525, "text": "What's like a successful driver monitoring system look like?"}, {"time": 2527, "text": "Is it all about just keeping your eyes on the road?"}, {"time": 2531, "text": "Well, a few things."}, {"time": 2532, "text": "So that's what we went with at first for driver monitoring."}, {"time": 2536, "text": "I'm checking, I'm actually looking at where your head is looking."}, {"time": 2539, "text": "The camera's not that high resolution."}, {"time": 2540, "text": "Eyes are a little bit hard to get."}, {"time": 2541, "text": "Well, head is this big."}, {"time": 2542, "text": "I mean, that's."}, {"time": 2543, "text": "Head is good."}, {"time": 2544, "text": "And actually a lot of it, just psychology wise, to have that monitor constantly there, it reminds you that you have to be paying attention."}, {"time": 2553, "text": "But we want to go further."}, {"time": 2555, "text": "We just hired someone full time to come on to do the driver monitoring."}, {"time": 2557, "text": "I want to detect phone in frame and I want to make sure you're not sleeping."}, {"time": 2562, "text": "How much does the camera see of the body?"}, {"time": 2564, "text": "This one, not enough."}, {"time": 2568, "text": "The next one, everything."}, {"time": 2570, "text": "Well, it's interesting, Fisheye, because we're doing just data collection, not real time."}, {"time": 2575, "text": "But Fisheye is a beautiful, being able to capture the body."}, {"time": 2579, "text": "And the smartphone is really like the biggest problem."}, {"time": 2583, "text": "I'll show you."}, {"time": 2584, "text": "I can show you one of the pictures from our new system."}, {"time": 2586, "text": "Awesome, so you're basically saying the driver monitoring will be the answer to that."}, {"time": 2593, "text": "I think the other point that you raised in your paper is good as well."}, {"time": 2596, "text": "You're not asking a human to supervise a machine without giving them the, they can take over at any time."}, {"time": 2604, "text": "Our safety model, you can take over."}, {"time": 2605, "text": "We disengage on both the gas or the brake."}, {"time": 2607, "text": "We don't disengage on steering."}, {"time": 2608, "text": "I don't feel you have to."}, {"time": 2610, "text": "But we disengage on gas or brake."}, {"time": 2611, "text": "So it's very easy for you to take over and it's very easy for you to reengage."}, {"time": 2616, "text": "That switching should be super cheap."}, {"time": 2619, "text": "The cars that require, even autopilot requires a double press."}, {"time": 2622, "text": "That's almost, I see, I don't like that."}, {"time": 2624, "text": "And then the cancel, to cancel in autopilot, you either have to press cancel, which no one knows what that is, so they press the brake."}, {"time": 2631, "text": "But a lot of times you don't actually want to press the brake."}, {"time": 2633, "text": "You want to press the gas."}, {"time": 2634, "text": "So you should cancel on gas."}, {"time": 2635, "text": "Or wiggle the steering wheel, which is bad as well."}, {"time": 2637, "text": "Wow, that's brilliant."}, {"time": 2638, "text": "I haven't heard anyone articulate that point."}, {"time": 2641, "text": "Oh, this is all I think about."}, {"time": 2643, "text": "It's the, because I think, I think actually Tesla has done a better job than most automakers at making that frictionless."}, {"time": 2652, "text": "But you just described that it could be even better."}, {"time": 2656, "text": "I love Super Cruise as an experience once it's engaged."}, {"time": 2661, "text": "I don't know if you've used it, but getting the thing to try to engage."}, {"time": 2665, "text": "Yeah, I've used the, I've driven Super Cruise a lot."}, {"time": 2667, "text": "So what's your thoughts on the Super Cruise system?"}, {"time": 2669, "text": "You disengage Super Cruise and it falls back to ACC."}, {"time": 2672, "text": "So my car's like still accelerating."}, {"time": 2674, "text": "It feels weird."}, {"time": 2676, "text": "Otherwise, when you actually have Super Cruise engaged on the highway, it is phenomenal."}, {"time": 2681, "text": "We bought that Cadillac."}, {"time": 2682, "text": "We just sold it."}, {"time": 2683, "text": "But we bought it just to like experience this."}, {"time": 2685, "text": "And I wanted everyone in the office to be like, this is what we're striving to build."}, {"time": 2689, "text": "GM pioneering with the driver monitoring."}, {"time": 2692, "text": "You like their driver monitoring system?"}, {"time": 2695, "text": "It has some bugs."}, {"time": 2696, "text": "If there's a sun shining back here, it'll be blind to you."}, {"time": 2701, "text": "But overall, mostly, yeah."}, {"time": 2703, "text": "That's so cool that you know all this stuff."}, {"time": 2705, "text": "I don't often talk to people that, because it's such a rare car, unfortunately, currently."}, {"time": 2710, "text": "We bought one explicitly for this."}, {"time": 2712, "text": "We lost like 25K in the deprecation, but I feel it's worth it."}, {"time": 2716, "text": "I was very pleasantly surprised that GM system was so innovative and really wasn't advertised much, wasn't talked about much."}, {"time": 2728, "text": "And I was nervous that it would die, that it would disappear."}, {"time": 2731, "text": "Well, they put it on the wrong car."}, {"time": 2733, "text": "They should have put it on the Bolt and not some weird Cadillac that nobody bought."}, {"time": 2736, "text": "I think that's gonna be into, they're saying at least it's gonna be into their entire fleet."}, {"time": 2741, "text": "So what do you think about, as long as we're on the driver monitoring, what do you think about Elon Musk's claim that driver monitoring is not needed?"}, {"time": 2751, "text": "Normally, I love his claims."}, {"time": 2753, "text": "That one is stupid."}, {"time": 2756, "text": "And, you know, he's not gonna have his level five fleet by the end of the year."}, {"time": 2761, "text": "Hopefully he's like, okay, I was wrong."}, {"time": 2764, "text": "I'm gonna add driver monitoring."}, {"time": 2766, "text": "Because when these systems get to the point that they're only messing up once every thousand miles, you absolutely need driver monitoring."}, {"time": 2774, "text": "So let me play, cause I agree with you, but let me play devil's advocate."}, {"time": 2777, "text": "One possibility is that without driver monitoring, people are able to monitor, self regulate, monitor themselves."}, {"time": 2788, "text": "You know, that, so your idea is."}, {"time": 2790, "text": "You've seen all the people sleeping in Teslas?"}, {"time": 2793, "text": "Yeah, well, I'm a little skeptical of all the people sleeping in Teslas because I've stopped paying attention to that kind of stuff because I want to see real data."}, {"time": 2805, "text": "It's too much glorified."}, {"time": 2807, "text": "It doesn't feel scientific to me."}, {"time": 2808, "text": "So I want to know how many people are really sleeping in Teslas versus sleeping."}, {"time": 2814, "text": "I was driving here sleep deprived in a car with no automation."}, {"time": 2819, "text": "I was falling asleep."}, {"time": 2820, "text": "I agree that it's hypey."}, {"time": 2822, "text": "It's just like, you know what?"}, {"time": 2824, "text": "If you want to put driver monitoring, I rented a, my last autopilot experience was I rented a model three in March and drove it around."}, {"time": 2832, "text": "The wheel thing is annoying."}, {"time": 2833, "text": "And the reason the wheel thing is annoying, we use the wheel thing as well, but we don't disengage on wheel."}, {"time": 2838, "text": "For Tesla, you have to touch the wheel just enough to trigger the torque sensor, to tell it that you're there, but not enough as to disengage it, which don't use it for two things."}, {"time": 2850, "text": "Don't disengage on wheel."}, {"time": 2851, "text": "You don't have to."}, {"time": 2852, "text": "That whole experience, wow, beautifully put."}, {"time": 2855, "text": "All of those elements, even if you don't have driver monitoring, that whole experience needs to be better."}, {"time": 2861, "text": "Driver monitoring, I think would make, I mean, I think Super Cruise is a better experience once it's engaged over autopilot."}, {"time": 2868, "text": "I think Super Cruise is a transition to engagement and disengagement are significantly worse."}, {"time": 2874, "text": "Well, there's a tricky thing, because if I were to criticize Super Cruise is, it's a little too crude."}, {"time": 2880, "text": "And I think like six seconds or something, if you look off road, it'll start warning you."}, {"time": 2885, "text": "It's some ridiculously long period of time."}, {"time": 2889, "text": "And just the way, I think it's basically, it's a binary."}, {"time": 2895, "text": "It should be adaptive."}, {"time": 2897, "text": "Yeah, it needs to learn more about you."}, {"time": 2899, "text": "It needs to communicate what it sees about you more."}, {"time": 2904, "text": "Tesla shows what it sees about the external world."}, {"time": 2907, "text": "It would be nice if Super Cruise would tell us what it sees about the internal world."}, {"time": 2910, "text": "It's even worse than that."}, {"time": 2911, "text": "You press the button to engage and it just says Super Cruise unavailable."}, {"time": 2917, "text": "Yeah, that transparency is good."}, {"time": 2921, "text": "We've renamed the driver monitoring packet to driver state."}, {"time": 2925, "text": "Driver state."}, {"time": 2926, "text": "We have car state packet, which has the state of the car."}, {"time": 2928, "text": "And you have driver state packet, which has the state of the driver."}, {"time": 2930, "text": "So what is the... Estimate their BAC."}, {"time": 2933, "text": "What's BAC?"}, {"time": 2934, "text": "Blood alcohol content."}, {"time": 2937, "text": "You think that's possible with computer vision?"}, {"time": 2943, "text": "To me, it's an open question."}, {"time": 2944, "text": "I haven't looked into it too much."}, {"time": 2946, "text": "Actually, I quite seriously looked at the literature."}, {"time": 2948, "text": "It's not obvious to me that from the eyes and so on, you can tell."}, {"time": 2951, "text": "You might need stuff from the car as well."}, {"time": 2953, "text": "You might need how they're controlling the car, right?"}, {"time": 2955, "text": "And that's fundamentally at the end of the day, what you care about."}, {"time": 2958, "text": "But I think, especially when people are really drunk, they're not controlling the car nearly as smoothly as they would look at them walking, right?"}, {"time": 2965, "text": "The car is like an extension of the body."}, {"time": 2967, "text": "So I think you could totally detect."}, {"time": 2969, "text": "And if you could fix people who are drunk, distracted, asleep, if you fix those three."}, {"time": 2972, "text": "Yeah, that's huge."}, {"time": 2975, "text": "So what are the current limitations of open pilot?"}, {"time": 2978, "text": "What are the main problems that still need to be solved?"}, {"time": 2981, "text": "We're hopefully fixing a few of them in 06."}, {"time": 2985, "text": "We're not as good as autopilot at stop cars."}, {"time": 2989, "text": "So if you're coming up to a red light at 55, so it's the radar stopped car problem, which is responsible for two autopilot accidents, it's hard to differentiate a stopped car from a signpost."}, {"time": 3003, "text": "Yeah, a static object."}, {"time": 3005, "text": "So you have to fuse."}, {"time": 3006, "text": "You have to do this visually."}, {"time": 3007, "text": "There's no way from the radar data to tell the difference."}, {"time": 3009, "text": "Maybe you can make a map, but I don't really believe in mapping at all anymore."}, {"time": 3013, "text": "Wait, wait, wait, what, you don't believe in mapping?"}, {"time": 3016, "text": "So you basically, the open pilot solution is saying react to the environment as you see it, just like human beings do."}, {"time": 3024, "text": "And then eventually, when you want to do navigate on open pilot, I'll train the net to look at ways."}, {"time": 3029, "text": "I'll run ways in the background, I'll train a confident way."}, {"time": 3032, "text": "Are you using GPS at all?"}, {"time": 3034, "text": "We use it to ground truth."}, {"time": 3035, "text": "We use it to very carefully ground truth the paths."}, {"time": 3038, "text": "We have a stack which can recover relative to 10 centimeters over one minute."}, {"time": 3042, "text": "And then we use that to ground truth exactly where the car went in that local part of the environment, but it's all local."}, {"time": 3048, "text": "How are you testing in general, just for yourself, like experiments and stuff?"}, {"time": 3053, "text": "Where are you located?"}, {"time": 3058, "text": "So you basically drive around there, collect some data, and watch the performance?"}, {"time": 3063, "text": "We have a simulator now."}, {"time": 3064, "text": "And we have, our simulator is really cool."}, {"time": 3066, "text": "Our simulator is not, it's not like a Unity based simulator."}, {"time": 3069, "text": "Our simulator lets us load in real state."}, {"time": 3072, "text": "What do you mean?"}, {"time": 3073, "text": "We can load in a drive and simulate what the system would have done on the historical data."}, {"time": 3080, "text": "Ooh, nice."}, {"time": 3083, "text": "So what, yeah."}, {"time": 3084, "text": "Right now we're only using it for testing, but as soon as we start using it for training, that's it."}, {"time": 3089, "text": "That's all that matters."}, {"time": 3090, "text": "What's your feeling about the real world versus simulation?"}, {"time": 3093, "text": "Do you like simulation for training, if this moves to training?"}, {"time": 3095, "text": "So we have to distinguish two types of simulators, right?"}, {"time": 3100, "text": "There's a simulator that is completely fake."}, {"time": 3104, "text": "I could get my car to drive around in GTA."}, {"time": 3107, "text": "I feel that this kind of simulator is useless."}, {"time": 3111, "text": "You're never, there's so many."}, {"time": 3114, "text": "My analogy here is like, OK, fine."}, {"time": 3116, "text": "You're not solving the computer vision problem, but you're solving the computer graphics problem."}, {"time": 3122, "text": "And you don't think you can get very far by creating ultra realistic graphics?"}, {"time": 3127, "text": "No, because you can create ultra realistic graphics of the road, now create ultra realistic behavioral models of the other cars."}, {"time": 3134, "text": "Oh, well, I'll just use myself driving."}, {"time": 3136, "text": "No, you won't."}, {"time": 3138, "text": "You need actual human behavior, because that's what you're trying to learn."}, {"time": 3143, "text": "Driving does not have a spec."}, {"time": 3145, "text": "The definition of driving is what humans do when they drive."}, {"time": 3149, "text": "Whatever Waymo does, I don't think it's driving."}, {"time": 3153, "text": "Well, I think actually Waymo and others, if there's any use for reinforcement learning, I've seen it used quite well."}, {"time": 3160, "text": "I study pedestrians a lot, too, is try to train models from real data of how pedestrians move, and try to use reinforcement learning models to make pedestrians move in human like ways."}, {"time": 3169, "text": "By that point, you've already gone so many layers, you detected a pedestrian?"}, {"time": 3175, "text": "Did you hand code the feature vector of their state?"}, {"time": 3180, "text": "Did you guys learn anything from computer vision before deep learning?"}, {"time": 3184, "text": "Well, OK, I feel like this is."}, {"time": 3187, "text": "So perception to you is the sticking point."}, {"time": 3190, "text": "I mean, what's the hardest part of the stack here?"}, {"time": 3193, "text": "There is no human understandable feature vector separating perception and planning."}, {"time": 3203, "text": "That's the best way I can put that."}, {"time": 3205, "text": "There is no, so it's all together, and it's a joint problem."}, {"time": 3209, "text": "So you can take localization."}, {"time": 3211, "text": "Localization and planning, there is a human understandable feature vector between these two things."}, {"time": 3215, "text": "I mean, OK, so I have like three degrees position, three degrees orientation, and those derivatives, maybe those second derivatives."}, {"time": 3221, "text": "That's human understandable."}, {"time": 3223, "text": "That's physical."}, {"time": 3225, "text": "Between perception and planning, so like Waymo has a perception stack and then a planner."}, {"time": 3233, "text": "And one of the things Waymo does right is they have a simulator that can separate those two."}, {"time": 3240, "text": "They can like replay their perception data and test their system, which is what I'm talking about about like the two different kinds of simulators."}, {"time": 3246, "text": "There's the kind that can work on real data, and there's the kind that can't work on real data."}, {"time": 3250, "text": "Now, the problem is that I don't think you can hand code a feature vector, right?"}, {"time": 3256, "text": "Like you have some list of like, oh, here's my list of cars in the scenes."}, {"time": 3259, "text": "Here's my list of pedestrians in the scene."}, {"time": 3261, "text": "This isn't what humans are doing."}, {"time": 3263, "text": "What are humans doing?"}, {"time": 3264, "text": "Global."}, {"time": 3267, "text": "And you're saying that's too difficult to hand engineer."}, {"time": 3271, "text": "I'm saying that there is no state vector given a perfect."}, {"time": 3275, "text": "I could give you the best team of engineers in the world to build a perception system and the best team to build a planner."}, {"time": 3280, "text": "All you have to do is define the state vector that separates those two."}, {"time": 3283, "text": "I'm missing the state vector that separates those two."}, {"time": 3289, "text": "So what is the output of your perception system?"}, {"time": 3293, "text": "Output of the perception system, it's, OK, well, there's several ways to do it."}, {"time": 3301, "text": "One is the SLAM components localization."}, {"time": 3303, "text": "The other is drivable area, drivable space."}, {"time": 3305, "text": "Drivable space, yeah."}, {"time": 3306, "text": "And then there's the different objects in the scene."}, {"time": 3310, "text": "And different objects in the scene over time, maybe, to give you input to then try to start modeling the trajectories of those objects."}, {"time": 3322, "text": "I can give you a concrete example of something you missed."}, {"time": 3325, "text": "So say there's a bush in the scene."}, {"time": 3328, "text": "Humans understand that when they see this bush that there may or may not be a car behind that bush."}, {"time": 3334, "text": "Drivable area and a list of objects does not include that."}, {"time": 3337, "text": "Humans are doing this constantly at the simplest intersections."}, {"time": 3340, "text": "So now you have to talk about occluded area."}, {"time": 3344, "text": "But even that, what do you mean by occluded?"}, {"time": 3347, "text": "OK, so I can't see it."}, {"time": 3349, "text": "Well, if it's the other side of a house, I don't care."}, {"time": 3351, "text": "What's the likelihood that there's a car in that occluded area?"}, {"time": 3355, "text": "And if you say, OK, we'll add that, I can come up with 10 more examples that you can't add."}, {"time": 3361, "text": "Certainly, occluded area would be something that Simulator would have because it's simulating the entire occlusion is part of it."}, {"time": 3371, "text": "Occlusion is part of a vision stack."}, {"time": 3372, "text": "But what I'm saying is if you have a hand engineered, if your perception system output can be written in a spec document, it is incomplete."}, {"time": 3382, "text": "Yeah, I mean, certainly, it's hard to argue with that because in the end, that's going to be true."}, {"time": 3390, "text": "Yeah, and I'll tell you what the output of our perception system is."}, {"time": 3393, "text": "It's a 1,024 dimensional vector, trained by neural net."}, {"time": 3397, "text": "Oh, you know that."}, {"time": 3398, "text": "No, it's 1,024 dimensions of who knows what."}, {"time": 3403, "text": "Because it's operating on real data."}, {"time": 3406, "text": "And that's the perception."}, {"time": 3408, "text": "That's the perception state."}, {"time": 3410, "text": "Think about an autoencoder for faces."}, {"time": 3413, "text": "If you have an autoencoder for faces and you say it has 256 dimensions in the middle, and I'm taking a face over here and projecting it to a face over here."}, {"time": 3422, "text": "Can you hand label all 256 of those dimensions?"}, {"time": 3426, "text": "Well, no, but those have to generate automatically."}, {"time": 3429, "text": "But even if you tried to do it by hand, could you come up with a spec between your encoder and your decoder?"}, {"time": 3437, "text": "No, because it wasn't designed, but there."}, {"time": 3440, "text": "No, no, no, but if you could design it."}, {"time": 3443, "text": "If you could design a face reconstructor system, could you come up with a spec?"}, {"time": 3449, "text": "No, but I think we're missing here a little bit."}, {"time": 3452, "text": "I think you're just being very poetic about expressing a fundamental problem of simulators, that they're going to be missing so much that the feature vector will just look fundamentally different in the simulated world than the real world."}, {"time": 3471, "text": "I'm not making a claim about simulators."}, {"time": 3473, "text": "I'm making a claim about the spec division between perception and planning, even in your system."}, {"time": 3480, "text": "Just in general."}, {"time": 3483, "text": "If you're trying to build a car that drives, if you're trying to hand code the output of your perception system, like saying, here's a list of all the cars in the scene, here's a list of all the people, here's a list of the occluded areas, here's a vector of drivable areas, it's insufficient."}, {"time": 3496, "text": "And if you start to believe that, you realize that what Waymo and Cruz are doing is impossible."}, {"time": 3500, "text": "Currently, what we're doing is the perception problem is converting the scene into a chessboard."}, {"time": 3509, "text": "And then you reason some basic reasoning around that chessboard."}, {"time": 3513, "text": "And you're saying that really, there's a lot missing there."}, {"time": 3518, "text": "First of all, why are we talking about this?"}, {"time": 3520, "text": "Because isn't this a full autonomy?"}, {"time": 3522, "text": "Is this something you think about?"}, {"time": 3524, "text": "Oh, I want to win self driving cars."}, {"time": 3527, "text": "So your definition of win includes?"}, {"time": 3531, "text": "Level four or five."}, {"time": 3533, "text": "Level five."}, {"time": 3533, "text": "I don't think level four is a real thing."}, {"time": 3535, "text": "I want to build the AlphaGo of driving."}, {"time": 3541, "text": "So AlphaGo is really end to end."}, {"time": 3546, "text": "Is, yeah, it's end to end."}, {"time": 3549, "text": "And do you think this whole problem, is that also kind of what you're getting at with the perception and the planning?"}, {"time": 3556, "text": "Is that this whole problem, the right way to do it is really to learn the entire thing."}, {"time": 3561, "text": "I'll argue that not only is it the right way, it's the only way that's going to exceed human performance."}, {"time": 3568, "text": "It's certainly true for Go."}, {"time": 3569, "text": "Everyone who tried to hand code Go things built human inferior things."}, {"time": 3573, "text": "And then someone came along and wrote some 10,000 line thing that doesn't know anything about Go that beat everybody."}, {"time": 3579, "text": "It's 10,000 lines."}, {"time": 3581, "text": "True, in that sense, the open question then that maybe I can ask you is driving is much harder than Go."}, {"time": 3593, "text": "The open question is how much harder?"}, {"time": 3596, "text": "So how, because I think the Elon Musk approach here with planning and perception is similar to what you're describing, which is really turning into not some kind of modular thing, but really do formulate it as a learning problem and solve the learning problem with scale."}, {"time": 3613, "text": "So how many years, put one is how many years would it take to solve this problem or just how hard is this freaking problem?"}, {"time": 3621, "text": "Well, the cool thing is I think there's a lot of value that we can deliver along the way."}, {"time": 3630, "text": "I think that you can build lane keeping assist actually plus adaptive cruise control, plus, okay, looking at ways, extends to like all of driving."}, {"time": 3645, "text": "Yeah, most of driving, right?"}, {"time": 3647, "text": "Oh, your adaptive cruise control treats red lights like cars, okay."}, {"time": 3651, "text": "So let's jump around."}, {"time": 3652, "text": "You mentioned that you didn't like navigate an autopilot."}, {"time": 3655, "text": "What advice, how would you make it better?"}, {"time": 3657, "text": "Do you think as a feature that if it's done really well, it's a good feature?"}, {"time": 3662, "text": "I think that it's too reliant on like hand coded hacks for like, how does navigate an autopilot do a lane change?"}, {"time": 3670, "text": "It actually does the same lane change every time and it feels mechanical."}, {"time": 3674, "text": "Humans do different lane changes."}, {"time": 3675, "text": "Humans sometime will do a slow one, sometimes do a fast one."}, {"time": 3678, "text": "Navigate an autopilot, at least every time I use it, it is the identical lane change."}, {"time": 3682, "text": "How do you learn?"}, {"time": 3684, "text": "I mean, this is a fundamental thing actually is the braking and then accelerating something that's still, Tesla probably does it better than most cars, but it still doesn't do a great job of creating a comfortable natural experience."}, {"time": 3699, "text": "And navigate an autopilot is just lane changes and extension of that."}, {"time": 3704, "text": "So how do you learn to do a natural lane change?"}, {"time": 3709, "text": "So we have it and I can talk about how it works."}, {"time": 3712, "text": "So I feel that we have the solution for lateral."}, {"time": 3718, "text": "We don't yet have the solution for longitudinal."}, {"time": 3720, "text": "There's a few reasons longitudinal is harder than lateral."}, {"time": 3723, "text": "The lane change component, the way that we train on it very simply is like our model has an input for whether it's doing a lane change or not."}, {"time": 3734, "text": "And then when we train the end to end model, we hand label all the lane changes, cause you have to."}, {"time": 3739, "text": "I've struggled a long time about not wanting to do that, but I think you have to."}, {"time": 3744, "text": "Or the training data."}, {"time": 3745, "text": "For the training data, right?"}, {"time": 3746, "text": "Oh, we actually, we have an automatic ground truther which automatically labels all the lane changes."}, {"time": 3750, "text": "Was that possible?"}, {"time": 3751, "text": "To automatically label the lane changes?"}, {"time": 3753, "text": "Yeah, detect the lane, I see when it crosses it, right?"}, {"time": 3754, "text": "And I don't have to get that high percent accuracy, but it's like 95, good enough."}, {"time": 3758, "text": "Now I set the bit when it's doing the lane change in the end to end learning."}, {"time": 3764, "text": "And then I set it to zero when it's not doing a lane change."}, {"time": 3767, "text": "So now if I wanted to do a lane change at test time, I just put the bit to a one and it'll do a lane change."}, {"time": 3772, "text": "Yeah, but so if you look at the space of lane change, you know, some percentage, not a hundred percent that we make as humans is not a pleasant experience cause we messed some part of it up."}, {"time": 3782, "text": "It's nerve wracking to change the look, you have to see, it has to accelerate."}, {"time": 3786, "text": "How do we label the ones that are natural and feel good?"}, {"time": 3789, "text": "You know, that's the, cause that's your ultimate criticism."}, {"time": 3793, "text": "The current navigate and autopilot just doesn't feel good."}, {"time": 3796, "text": "Well, the current navigate and autopilot is a hand coded policy written by an engineer in a room who probably went out and tested it a few times on the 280."}, {"time": 3805, "text": "Probably a more, a better version of that, but yes."}, {"time": 3809, "text": "That's how we would have written it at Comma AI."}, {"time": 3811, "text": "Maybe Tesla did, Tesla, they tested it in the end."}, {"time": 3813, "text": "That might've been two engineers."}, {"time": 3815, "text": "Two engineers, yeah."}, {"time": 3817, "text": "No, but so if you learn the lane change, if you learn how to do a lane change from data, just like you have a label that says lane change and then you put it in when you want it to do the lane change, it'll automatically do the lane change that's appropriate for the situation."}, {"time": 3831, "text": "Now, to get at the problem of some humans do bad lane changes, we haven't worked too much on this problem yet."}, {"time": 3839, "text": "It's not that much of a problem in practice."}, {"time": 3843, "text": "My theory is that all good drivers are good in the same way and all bad drivers are bad in different ways."}, {"time": 3849, "text": "And we've seen some data to back this up."}, {"time": 3851, "text": "Well, beautifully put."}, {"time": 3852, "text": "So you just basically, if that's true hypothesis, then your task is to discover the good drivers."}, {"time": 3859, "text": "The good drivers stand out because they're in one cluster and the bad drivers are scattered all over the place and your net learns the cluster."}, {"time": 3867, "text": "Yeah, that's, so you just learn from the good drivers and they're easy to cluster."}, {"time": 3873, "text": "In fact, we learned from all of them and the net automatically learns the policy that's like the majority, but we'll eventually probably have to filter them out."}, {"time": 3878, "text": "If that theory is true, I hope it's true because the counter theory is there is many clusters, maybe arbitrarily many clusters of good drivers."}, {"time": 3893, "text": "Because if there's one cluster of good drivers, you can at least discover a set of policies."}, {"time": 3897, "text": "You can learn a set of policies, which would be good universally."}, {"time": 3901, "text": "That would be a nice, that would be nice if it's true."}, {"time": 3904, "text": "And you're saying that there is some evidence that."}, {"time": 3906, "text": "Let's say lane changes can be clustered into four clusters."}, {"time": 3910, "text": "There's this finite level of."}, {"time": 3912, "text": "I would argue that all four of those are good clusters."}, {"time": 3915, "text": "All the things that are random are noise and probably bad."}, {"time": 3918, "text": "And which one of the four you pick, or maybe it's 10 or maybe it's 20."}, {"time": 3921, "text": "You can learn that."}, {"time": 3922, "text": "It's context dependent."}, {"time": 3923, "text": "It depends on the scene."}, {"time": 3924, "text": "And the hope is it's not too dependent on the driver."}, {"time": 3931, "text": "The hope is that it all washes out."}, {"time": 3934, "text": "The hope is that there's, that the distribution's not bimodal."}, {"time": 3936, "text": "The hope is that it's a nice Gaussian."}, {"time": 3939, "text": "So what advice would you give to Tesla, how to fix, how to improve navigating autopilot?"}, {"time": 3944, "text": "That's the lessons that you've learned from Comm AI?"}, {"time": 3948, "text": "The only real advice I would give to Tesla is please put driver monitoring in your cars."}, {"time": 3952, "text": "With respect to improving it?"}, {"time": 3955, "text": "You can't do that anymore."}, {"time": 3955, "text": "I decided to interrupt, but you know, there's a practical nature of many of hundreds of thousands of cars being produced that don't have a good driver facing camera."}, {"time": 3965, "text": "The Model 3 has a selfie cam."}, {"time": 3967, "text": "Is it not good enough?"}, {"time": 3968, "text": "Did they not put IR LEDs for night?"}, {"time": 3971, "text": "But I do know that it's fisheye and it's relatively low resolution."}, {"time": 3975, "text": "So it's really not designed."}, {"time": 3977, "text": "It wasn't designed for driver monitoring."}, {"time": 3978, "text": "You can hope that you can kind of scrape up and have something from it."}, {"time": 3985, "text": "But why didn't they put it in today?"}, {"time": 3987, "text": "Put it in today."}, {"time": 3989, "text": "Every time I've heard Karpathy talk about the problem and talking about like software 2.0 and how the machine learning is gobbling up everything, I think this is absolutely the right strategy."}, {"time": 3997, "text": "I think that he didn't write navigate on autopilot."}, {"time": 4000, "text": "I think somebody else did and kind of hacked it on top of that stuff."}, {"time": 4003, "text": "I think when Karpathy says, wait a second, why did we hand code this lane change policy with all these magic numbers?"}, {"time": 4008, "text": "We're gonna learn it from data."}, {"time": 4009, "text": "They'll fix it."}, {"time": 4010, "text": "They already know what to do there."}, {"time": 4011, "text": "Well, that's Andrei's job is to turn everything into a learning problem and collect a huge amount of data."}, {"time": 4017, "text": "The reality is though, not every problem can be turned into a learning problem in the short term."}, {"time": 4024, "text": "In the end, everything will be a learning problem."}, {"time": 4027, "text": "The reality is like if you wanna build L5 vehicles today, it will likely involve no learning."}, {"time": 4035, "text": "And that's the reality is, so at which point does learning start?"}, {"time": 4040, "text": "It's the crutch statement that LiDAR is a crutch."}, {"time": 4043, "text": "At which point will learning get up to part of human performance?"}, {"time": 4047, "text": "It's over human performance on ImageNet, classification, on driving, it's a question still."}, {"time": 4054, "text": "It is a question."}, {"time": 4055, "text": "I'll say this, I'm here to play for 10 years."}, {"time": 4059, "text": "I'm not here to try to, I'm here to play for 10 years and make money along the way."}, {"time": 4063, "text": "I'm not here to try to promise people that I'm gonna have my L5 taxi network up and working in two years."}, {"time": 4068, "text": "Do you think that was a mistake?"}, {"time": 4070, "text": "What do you think was the motivation behind saying that?"}, {"time": 4073, "text": "Other companies are also promising L5 vehicles with very different approaches in 2020, 2021, 2022."}, {"time": 4081, "text": "If anybody would like to bet me that those things do not pan out, I will bet you."}, {"time": 4086, "text": "Even money, even money, I'll bet you as much as you want."}, {"time": 4090, "text": "So are you worried about what's going to happen?"}, {"time": 4093, "text": "Cause you're not in full agreement on that."}, {"time": 4096, "text": "What's going to happen when 2022, 21 come around and nobody has fleets of autonomous vehicles?"}, {"time": 4102, "text": "Well, you can look at the history."}, {"time": 4105, "text": "If you go back five years ago, they were all promised by 2018 and 2017."}, {"time": 4109, "text": "But they weren't that strong of promises."}, {"time": 4112, "text": "I mean, Ford really declared pretty, I think not many have declared as like definitively as they have now these dates."}, {"time": 4122, "text": "Well, okay, so let's separate L4 and L5."}, {"time": 4125, "text": "Do I think that it's possible for Waymo to continue to kind of like hack on their system until it gets to level four in Chandler, Arizona?"}, {"time": 4135, "text": "When there's no safety driver?"}, {"time": 4136, "text": "Chandler, Arizona?"}, {"time": 4139, "text": "By, sorry, which year are we talking about?"}, {"time": 4142, "text": "Oh, I even think that's possible by like 2020, 2021."}, {"time": 4146, "text": "But level four, Chandler, Arizona, not level five, New York City."}, {"time": 4150, "text": "Level four, meaning some very defined streets, it works out really well."}, {"time": 4157, "text": "Very defined streets."}, {"time": 4158, "text": "And then practically these streets are pretty empty."}, {"time": 4160, "text": "If most of the streets are covered in Waymo's, Waymo can kind of change the definition of what driving is."}, {"time": 4169, "text": "If your self driving network is the majority of cars in an area, they only need to be safe with respect to each other and all the humans will need to learn to adapt to them."}, {"time": 4178, "text": "Now go drive in downtown New York."}, {"time": 4181, "text": "Well, yeah, that's."}, {"time": 4182, "text": "I mean, already you can talk about autonomy and like on farms, it already works great because you can really just follow the GPS line."}, {"time": 4191, "text": "So what does success look like for common AI?"}, {"time": 4195, "text": "What are the milestones?"}, {"time": 4197, "text": "Like where you can sit back with some champagne and say, we did it, boys and girls?"}, {"time": 4204, "text": "Well, it's never over."}, {"time": 4207, "text": "You must drink champagne and celebrate."}, {"time": 4210, "text": "So what is a good, what are some wins?"}, {"time": 4213, "text": "A big milestone that we're hoping for by mid next year is profitability of the company."}, {"time": 4223, "text": "And we're gonna have to revisit the idea of selling a consumer product, but it's not gonna be like the comma one."}, {"time": 4232, "text": "When we do it, it's gonna be perfect."}, {"time": 4235, "text": "Open pilot has gotten so much better in the last two years."}, {"time": 4239, "text": "We're gonna have a few features."}, {"time": 4241, "text": "We're gonna have a hundred percent driver monitoring."}, {"time": 4243, "text": "We're gonna disable no safety features in the car."}, {"time": 4247, "text": "Actually, I think it'd be really cool what we're doing right now."}, {"time": 4249, "text": "Our project this week is we're analyzing the data set and looking for all the AEB triggers from the manufacturer systems."}, {"time": 4255, "text": "We have better data set on that than the manufacturers."}, {"time": 4259, "text": "How much, just how many, does Toyota have 10 million miles of real world driving to know how many times their AEB triggered?"}, {"time": 4265, "text": "So let me give you, cause you asked, right?"}, {"time": 4268, "text": "Financial advice."}, {"time": 4270, "text": "Cause I work with a lot of automakers and one possible source of money for you, which I'll be excited to see you take on is basically selling the data."}, {"time": 4284, "text": "So, which is something that most people, and not selling in a way where here, here at Automaker, but creating, we've done this actually at MIT, not for money purposes, but you could do it for significant money purposes and make the world a better place by creating a consortia where automakers would pay in and then they get to have free access to the data."}, {"time": 4306, "text": "And I think a lot of people are really hungry for that and would pay significant amount of money for it."}, {"time": 4314, "text": "Here's the problem with that."}, {"time": 4315, "text": "I like this idea all in theory."}, {"time": 4316, "text": "It'd be very easy for me to give them access to my servers and we already have all open source tools to access this data."}, {"time": 4322, "text": "It's in a great format."}, {"time": 4323, "text": "We have a great pipeline, but they're gonna put me in the room with some business development guy."}, {"time": 4330, "text": "And I'm gonna have to talk to this guy and he's not gonna know most of the words I'm saying."}, {"time": 4335, "text": "I'm not willing to tolerate that."}, {"time": 4337, "text": "Okay, Mick Jagger."}, {"time": 4338, "text": "No, no, no, no, no."}, {"time": 4339, "text": "I think I agree with you."}, {"time": 4341, "text": "I'm the same way, but you just tell them the terms and there's no discussion needed."}, {"time": 4344, "text": "If I could just tell them the terms, Yeah."}, {"time": 4348, "text": "and like, all right, who wants access to my data?"}, {"time": 4351, "text": "I will sell it to you for, let's say, you want a subscription?"}, {"time": 4357, "text": "I'll sell to you for 100K a month."}, {"time": 4360, "text": "Anyone."}, {"time": 4361, "text": "100K a month."}, {"time": 4363, "text": "I'll give you access to this data subscription."}, {"time": 4366, "text": "Yeah, I think that's kind of fair."}, {"time": 4366, "text": "Came up with that number off the top of my head."}, {"time": 4368, "text": "If somebody sends me like a three line email where it's like, we would like to pay 100K a month to get access to your data."}, {"time": 4374, "text": "We would agree to like reasonable privacy terms of the people who are in the data set."}, {"time": 4378, "text": "I would be happy to do it, but that's not going to be the email."}, {"time": 4381, "text": "The email is going to be, hey, do you have some time in the next month where we can sit down and we can, I don't have time for that."}, {"time": 4386, "text": "We're moving too fast."}, {"time": 4388, "text": "You could politely respond to that email, but not saying, I don't have any time for your bullshit."}, {"time": 4393, "text": "You say, oh, well, unfortunately these are the terms."}, {"time": 4395, "text": "And so this is, we try to, we brought the cost down for you in order to minimize the friction and communication."}, {"time": 4403, "text": "Here's the, whatever it is, one, two million dollars a year and you have access."}, {"time": 4408, "text": "And it's not like I get that email from like, but okay, am I going to reach out?"}, {"time": 4412, "text": "Am I going to hire a business development person who's going to reach out to the automakers?"}, {"time": 4417, "text": "I got you."}, {"time": 4418, "text": "If they reached into me, I'm not going to ignore the email."}, {"time": 4420, "text": "I'll come back with something like, yeah, if you're willing to pay 100K a month for access to the data, I'm happy to set that up."}, {"time": 4426, "text": "That's worth my engineering time."}, {"time": 4428, "text": "That's actually quite insightful of you."}, {"time": 4430, "text": "Probably because many of the automakers are quite a bit old school, there will be a need to reach out and they want it, but there'll need to be some communication."}, {"time": 4440, "text": "Mobileye circa 2015 had the lowest R&D spend of any chip maker, like per, per, and you look at all the people who work for them and it's all business development people because the car companies are impossible to work with."}, {"time": 4456, "text": "So you're, you have no patience for that and you're, you're legit Android, huh?"}, {"time": 4460, "text": "I have something to do, right?"}, {"time": 4461, "text": "Like, like it's not like, it's not like, I don't, like, I don't mean to like be a dick and say like, I don't have patience for that, but it's like that stuff doesn't help us with our goal of winning self driving cars."}, {"time": 4470, "text": "If I want money in the short term, if I showed off like the actual, like the learning tech that we have, it's, it's somewhat sad."}, {"time": 4479, "text": "Like it's years and years ahead of everybody else's."}, {"time": 4482, "text": "Not to, maybe not Tesla's."}, {"time": 4483, "text": "I think Tesla has some more stuff to us actually."}, {"time": 4486, "text": "I think Tesla has similar stuff, but when you compare it to like what the Toyota Research Institute has, you're not even close to what we have."}, {"time": 4493, "text": "No comments."}, {"time": 4494, "text": "But I also can't, I have to take your comments."}, {"time": 4498, "text": "I intuitively believe you, but I have to take it with a grain of salt because I mean, you are an inspiration because you basically don't care about a lot of things that other companies care about."}, {"time": 4510, "text": "You don't try to bullshit in a sense, like make up stuff."}, {"time": 4516, "text": "So to drive up valuation, you're really very real and you're trying to solve the problem and admire that a lot."}, {"time": 4522, "text": "What I don't necessarily fully can't trust you on, with all due respect, is how good it is, right?"}, {"time": 4528, "text": "I can only, but I also know how bad others are."}, {"time": 4533, "text": "I'll say two things about, trust but verify, right?"}, {"time": 4536, "text": "I'll say two things about that."}, {"time": 4538, "text": "One is try, get in a 2020 Corolla and try open pilot 0.6 when it comes out next month."}, {"time": 4546, "text": "I think already you'll look at this and you'll be like, this is already really good."}, {"time": 4551, "text": "And then I could be doing that all with hand labelers and all with like the same approach that Mobileye uses."}, {"time": 4557, "text": "When we release a model that no longer has the lanes in it, that only outputs a path, then think about how we did that machine learning and then right away when you see, and that's gonna be an open pilot, that's gonna be an open pilot before 1.0."}, {"time": 4573, "text": "When you see that model, you'll know that everything I'm saying is true because how else did I get that model?"}, {"time": 4577, "text": "You know what I'm saying is true about the simulator."}, {"time": 4579, "text": "Yeah, yeah, this is super exciting, that's super exciting."}, {"time": 4582, "text": "But like, you know, I listened to your talk with Kyle and Kyle was originally building the aftermarket system and he gave up on it because of technical challenges, because of the fact that he's gonna have to support 20 to 50 cars, we support 45, because what is he gonna do when the manufacturer ABS system triggers?"}, {"time": 4603, "text": "We have alerts and warnings to deal with all of that and all the cars."}, {"time": 4606, "text": "And how is he going to formally verify it?"}, {"time": 4608, "text": "Well, I got 10 million miles of data, it's probably better, it's probably better verified than the spec."}, {"time": 4613, "text": "Yeah, I'm glad you're here talking to me."}, {"time": 4617, "text": "This is, I'll remember this day, because it's interesting."}, {"time": 4621, "text": "If you look at Kyle's from cruise, I'm sure they have a large number of business development folks and you work with, he's working with GM, you could work with Argo AI, working with Ford."}, {"time": 4633, "text": "It's interesting because chances that you fail, business wise, like bankrupt, are pretty high."}, {"time": 4641, "text": "And yet, it's the Android model, is you're actually taking on the problem."}, {"time": 4646, "text": "So that's really inspiring, I mean."}, {"time": 4648, "text": "Well, I have a long term way for Comma to make money too."}, {"time": 4650, "text": "And one of the nice things when you really take on the problem, which is my hope for Autopilot, for example, is things you don't expect, ways to make money or create value that you don't expect will pop up."}, {"time": 4663, "text": "Oh, I've known how to do it since kind of, 2017 is the first time I said it."}, {"time": 4668, "text": "Which part, to know how to do which part?"}, {"time": 4670, "text": "Our long term plan is to be a car insurance company."}, {"time": 4672, "text": "Insurance, yeah, I love it, yep, yep."}, {"time": 4675, "text": "I make driving twice as safe."}, {"time": 4676, "text": "Not only that, I have the best data such to know who statistically is the safest drivers."}, {"time": 4679, "text": "And oh, oh, we see you, we see you driving unsafely, we're not gonna insure you."}, {"time": 4685, "text": "And that causes a bifurcation in the market because the only people who can't get Comma insurance are the bad drivers, Geico can insure them, their premiums are crazy high, our premiums are crazy low."}, {"time": 4695, "text": "We'll win car insurance, take over that whole market."}, {"time": 4699, "text": "If we win, if we win."}, {"time": 4701, "text": "But that's what I'm saying, how do you turn Comma into a $10 billion company?"}, {"time": 4705, "text": "So you, Elon Musk, who else?"}, {"time": 4709, "text": "Who else is thinking like this and working like this in your view?"}, {"time": 4713, "text": "Who are the competitors?"}, {"time": 4714, "text": "Are there people seriously, I don't think anyone that I'm aware of is seriously taking on lane keeping, like where it's a huge business that turns eventually into full autonomy that then creates, yeah, like that creates other businesses on top of it and so on."}, {"time": 4733, "text": "Thinks insurance, thinks all kinds of ideas like that."}, {"time": 4736, "text": "Do you know anyone else thinking like this?"}, {"time": 4742, "text": "I mean, my sense is everybody turns to that in like four or five years."}, {"time": 4747, "text": "Like Ford, once the autonomy doesn't fall through."}, {"time": 4751, "text": "But at this time."}, {"time": 4752, "text": "Elon's the iOS."}, {"time": 4754, "text": "By the way, he paved the way for all of us."}, {"time": 4756, "text": "It's the iOS, true."}, {"time": 4757, "text": "I would not be doing Comma AI today if it was not for those conversations with Elon."}, {"time": 4763, "text": "And if it were not for him saying like, I think he said like, well, obviously we're not gonna use LiDAR, we use cameras, humans use cameras."}, {"time": 4771, "text": "So what do you think about that?"}, {"time": 4772, "text": "How important is LiDAR?"}, {"time": 4773, "text": "Everybody else on L5 is using LiDAR."}, {"time": 4776, "text": "What are your thoughts on his provocative statement that LiDAR is a crutch?"}, {"time": 4781, "text": "See, sometimes he'll say dumb things, like the driver monitoring thing, but sometimes he'll say absolutely, completely, 100% obviously true things."}, {"time": 4788, "text": "Of course LiDAR is a crutch."}, {"time": 4790, "text": "It's not even a good crutch."}, {"time": 4793, "text": "You're not even using it."}, {"time": 4793, "text": "Oh, they're using it for localization."}, {"time": 4797, "text": "Which isn't good in the first place."}, {"time": 4798, "text": "If you have to localize your car to centimeters in order to drive, like that's not driving."}, {"time": 4804, "text": "Currently not doing much machine learning I thought for LiDAR data."}, {"time": 4807, "text": "Meaning like to help you in the task of, general task of perception."}, {"time": 4812, "text": "The main goal of those LiDARs on those cars I think is actually localization more than perception."}, {"time": 4818, "text": "Or at least that's what they use them for."}, {"time": 4820, "text": "Yeah, that's true."}, {"time": 4820, "text": "If you want to localize to centimeters, you can't use GPS."}, {"time": 4823, "text": "The fanciest GPS in the world can't do it."}, {"time": 4825, "text": "Especially if you're under tree cover and stuff."}, {"time": 4826, "text": "With LiDAR you can do this pretty easily."}, {"time": 4828, "text": "So you really, they're not taking on, I mean in some research they're using it for perception, but, and they're certainly not, which is sad, they're not fusing it well with vision."}, {"time": 4838, "text": "They do use it for perception."}, {"time": 4840, "text": "I'm not saying they don't use it for perception, but the thing that, they have vision based and radar based perception systems as well."}, {"time": 4847, "text": "You could remove the LiDAR and keep around a lot of the dynamic object perception."}, {"time": 4854, "text": "You want to get centimeter accurate localization?"}, {"time": 4856, "text": "Good luck doing that with anything else."}, {"time": 4859, "text": "So what should Cruz, Waymo do?"}, {"time": 4862, "text": "Like what would be your advice to them now?"}, {"time": 4866, "text": "I mean Waymo is actually, they're, I mean they're doing, they're serious."}, {"time": 4871, "text": "Waymo out of the ball of them are quite so serious about the long game."}, {"time": 4876, "text": "If L5 is a lot, requires 50 years, I think Waymo will be the only one left standing at the end with the, given the financial backing that they have."}, {"time": 4886, "text": "Buku Google bucks."}, {"time": 4888, "text": "I'll say nice things about both Waymo and Cruz."}, {"time": 4893, "text": "Nice is good."}, {"time": 4895, "text": "Waymo is by far the furthest along with technology."}, {"time": 4899, "text": "Waymo has a three to five year lead on all the competitors."}, {"time": 4904, "text": "If that, if the Waymo looking stack works, maybe three year lead."}, {"time": 4909, "text": "If the Waymo looking stack works, they have a three year lead."}, {"time": 4912, "text": "Now I argue that Waymo has spent too much money to recapitalize, to gain back their losses in those three years."}, {"time": 4920, "text": "Also self driving cars have no network effect like that."}, {"time": 4923, "text": "Uber has a network effect."}, {"time": 4924, "text": "You have a market, you have drivers and you have riders."}, {"time": 4927, "text": "Self driving cars, you have capital and you have riders."}, {"time": 4929, "text": "There's no network effect."}, {"time": 4931, "text": "If I want to blanket a new city in self driving cars, I buy the off the shelf Chinese knockoff self driving cars and I buy enough of them in the city."}, {"time": 4937, "text": "I can't do that with drivers."}, {"time": 4938, "text": "And that's why Uber has a first mover advantage that no self driving car company will."}, {"time": 4944, "text": "Can you disentangle that a little bit?"}, {"time": 4946, "text": "Uber, you're not talking about Uber, the autonomous vehicle Uber."}, {"time": 4949, "text": "You're talking about the Uber car, the, yeah."}, {"time": 4951, "text": "I'm Uber."}, {"time": 4952, "text": "I open for business in Austin, Texas, let's say."}, {"time": 4956, "text": "I need to attract both sides of the market."}, {"time": 4958, "text": "I need to both get drivers on my platform and riders on my platform."}, {"time": 4962, "text": "And I need to keep them both sufficiently happy, right?"}, {"time": 4965, "text": "Riders aren't gonna use it if it takes more than five minutes for an Uber to show up."}, {"time": 4969, "text": "Drivers aren't gonna use it if they have to sit around all day and there's no riders."}, {"time": 4972, "text": "So you have to carefully balance a market."}, {"time": 4974, "text": "And whenever you have to carefully balance a market, there's a great first mover advantage because there's a switching cost for everybody, right?"}, {"time": 4981, "text": "The drivers and the riders would have to switch at the same time."}, {"time": 4984, "text": "Let's even say that, you know, let's say a Luber shows up and Luber somehow, you know, agrees to do things at a bigger, you know, we're just gonna, we've done it more efficiently, right?"}, {"time": 4997, "text": "Luber is only takes 5% of a cut instead of the 10% that Uber takes."}, {"time": 5001, "text": "No one is gonna switch because the switching cost is higher than that 5%."}, {"time": 5005, "text": "So you actually can, in markets like that, you have a first mover advantage."}, {"time": 5010, "text": "Autonomous vehicles of the level five variety have no first mover advantage."}, {"time": 5014, "text": "If the technology becomes commoditized, say I wanna go to a new city, look at the scooters."}, {"time": 5019, "text": "It's gonna look a lot more like scooters."}, {"time": 5021, "text": "Every person with a checkbook can blanket a city in scooters."}, {"time": 5025, "text": "And that's why you have 10 different scooter companies."}, {"time": 5027, "text": "Which one's gonna win?"}, {"time": 5028, "text": "It's a race to the bottom."}, {"time": 5029, "text": "It's a terrible market to be in because there's no market for scooters."}, {"time": 5035, "text": "And the scooters don't get a say in whether they wanna be bought and deployed to a city or not."}, {"time": 5039, "text": "So the, yeah."}, {"time": 5040, "text": "We're gonna entice the scooters with subsidies and deals and."}, {"time": 5043, "text": "So whenever you have to invest that capital, it doesn't."}, {"time": 5046, "text": "It doesn't come back."}, {"time": 5048, "text": "That can't be your main criticism of the Waymo approach."}, {"time": 5052, "text": "Oh, I'm saying even if it does technically work."}, {"time": 5054, "text": "Even if it does technically work, that's a problem."}, {"time": 5058, "text": "I don't know if I were to say, I would say you're already there."}, {"time": 5063, "text": "I haven't even thought about that, but I would say the bigger challenge is the technical approach."}, {"time": 5069, "text": "So Waymo's cruises."}, {"time": 5071, "text": "And not just the technical approach, but of creating value."}, {"time": 5074, "text": "I still don't understand how you beat Uber, the human driven cars."}, {"time": 5083, "text": "In terms of financially, it doesn't make sense to me that people wanna get in an autonomous vehicle."}, {"time": 5090, "text": "I don't understand how you make money."}, {"time": 5092, "text": "In the longterm, yes."}, {"time": 5094, "text": "Like real longterm."}, {"time": 5096, "text": "But it just feels like there's too much capital investment needed."}, {"time": 5099, "text": "Oh, and they're gonna be worse than Ubers because they're gonna stop for every little thing, everywhere."}, {"time": 5106, "text": "I'll say a nice thing about cruise."}, {"time": 5107, "text": "That was my nice thing about Waymo."}, {"time": 5108, "text": "They're three years ahead."}, {"time": 5109, "text": "Wait, what was the nice?"}, {"time": 5110, "text": "Oh, because they're three."}, {"time": 5110, "text": "They're three years technically ahead of everybody."}, {"time": 5112, "text": "Their tech stack is great."}, {"time": 5114, "text": "My nice thing about cruise is GM buying them was a great move for GM."}, {"time": 5120, "text": "For $1 billion, GM bought an insurance policy against Waymo."}, {"time": 5125, "text": "They put, cruise is three years behind Waymo."}, {"time": 5130, "text": "That means Google will get a monopoly on the technology for at most three years."}, {"time": 5136, "text": "And if technology works, so you might not even be right about the three years, it might be less."}, {"time": 5141, "text": "Might be less."}, {"time": 5142, "text": "Cruise actually might not be that far behind."}, {"time": 5144, "text": "I don't know how much Waymo has waffled around or how much of it actually is just that long tail."}, {"time": 5150, "text": "If that's the best you could say in terms of nice things, that's more of a nice thing for GM that that's the smart insurance policy."}, {"time": 5158, "text": "It's a smart insurance policy."}, {"time": 5159, "text": "I mean, I think that's how, I can't see cruise working out any other."}, {"time": 5165, "text": "For cruise to leapfrog Waymo would really surprise me."}, {"time": 5170, "text": "Yeah, so let's talk about the underlying assumption of everything is."}, {"time": 5173, "text": "We're not gonna leapfrog Tesla."}, {"time": 5177, "text": "Tesla would have to seriously mess up for us because you're."}, {"time": 5180, "text": "Okay, so the way you leapfrog, right?"}, {"time": 5183, "text": "Is you come up with an idea or you take a direction perhaps secretly that the other people aren't taking."}, {"time": 5191, "text": "And so the cruise, Waymo, even Aurora."}, {"time": 5198, "text": "I don't know Aurora, Zooks is the same stack as well."}, {"time": 5200, "text": "They're all the same code base even."}, {"time": 5201, "text": "And they're all the same DARPA Urban Challenge code base."}, {"time": 5205, "text": "So the question is, do you think there's a room for brilliance and innovation that will change everything?"}, {"time": 5210, "text": "Like say, okay, so I'll give you examples."}, {"time": 5213, "text": "It could be if revolution and mapping, for example, that allow you to map things, do HD maps of the whole world, all weather conditions somehow really well, or revolution and simulation to where the all the way you said before becomes incorrect."}, {"time": 5240, "text": "That kind of thing."}, {"time": 5241, "text": "Any room for breakthrough innovation?"}, {"time": 5244, "text": "What I said before about, oh, they actually get the whole thing."}, {"time": 5247, "text": "Well, I'll say this about, we divide driving into three problems and I actually haven't solved the third yet, but I haven't had you how to do it."}, {"time": 5254, "text": "So there's the static."}, {"time": 5256, "text": "The static driving problem is assuming you are the only car on the road, right?"}, {"time": 5260, "text": "And this problem can be solved 100% with mapping and localization."}, {"time": 5263, "text": "This is why farms work the way they do."}, {"time": 5265, "text": "If all you have to deal with is the static problem and you can statically schedule your machines, right?"}, {"time": 5270, "text": "It's the same as like statically scheduling processes."}, {"time": 5272, "text": "You can statically schedule your tractors to never hit each other on their paths, right?"}, {"time": 5276, "text": "Cause they know the speed they go at."}, {"time": 5277, "text": "So that's the static driving problem."}, {"time": 5280, "text": "Maps only helps you with the static driving problem."}, {"time": 5283, "text": "Yeah, the question about static driving, you've just made it sound like it's really easy."}, {"time": 5288, "text": "Static driving is really easy."}, {"time": 5291, "text": "How easy?"}, {"time": 5293, "text": "How, well, cause the whole drifting out of lane, when Tesla drifts out of lane, it's failing on the fundamental static driving problem."}, {"time": 5302, "text": "Tesla is drifting out of lane?"}, {"time": 5304, "text": "The static driving problem is not easy for the world."}, {"time": 5307, "text": "The static driving problem is easy for one route."}, {"time": 5311, "text": "One route and one weather condition with one state of lane markings and like no deterioration, no cracks in the road."}, {"time": 5320, "text": "No, I'm assuming you have a perfect localizer."}, {"time": 5322, "text": "So that's solved for the weather condition and the lane marking condition."}, {"time": 5325, "text": "But that's the problem is, how do you have a perfect localizer?"}, {"time": 5328, "text": "Perfect localizers are not that hard to build."}, {"time": 5330, "text": "Okay, come on now, with LIDAR?"}, {"time": 5333, "text": "With LIDAR, yeah."}, {"time": 5334, "text": "Oh, with LIDAR, okay."}, {"time": 5335, "text": "With LIDAR, yeah, but you use LIDAR, right?"}, {"time": 5336, "text": "Like use LIDAR, build a perfect localizer."}, {"time": 5338, "text": "Building a perfect localizer without LIDAR, it's gonna be hard."}, {"time": 5344, "text": "You can get 10 centimeters without LIDAR, you can get one centimeter with LIDAR."}, {"time": 5347, "text": "I'm not even concerned about the one or 10 centimeters."}, {"time": 5349, "text": "I'm concerned if every once in a while, you're just way off."}, {"time": 5352, "text": "Yeah, so this is why you have to carefully make sure you're always tracking your position."}, {"time": 5359, "text": "You wanna use LIDAR camera fusion, but you can get the reliability of that system up to 100,000 miles, and then you write some fallback condition where it's not that bad if you're way off, right?"}, {"time": 5372, "text": "I think that you can get it to the point, it's like ASLD that you're never in a case where you're way off and you don't know it."}, {"time": 5378, "text": "Yeah, okay, so this is brilliant."}, {"time": 5380, "text": "So that's the static."}, {"time": 5380, "text": "Static."}, {"time": 5382, "text": "We can, especially with LIDAR and good HG maps, you can solve that problem."}, {"time": 5387, "text": "No, I just disagree with your word easy."}, {"time": 5390, "text": "The static problem's so easy."}, {"time": 5391, "text": "It's very typical for you to say something is easy."}, {"time": 5394, "text": "It's not as challenging as the other ones, okay."}, {"time": 5396, "text": "Well, okay, maybe it's obvious how to solve it."}, {"time": 5398, "text": "The third one's the hardest."}, {"time": 5400, "text": "And a lot of people don't even think about the third one and even see it as different from the second one."}, {"time": 5403, "text": "So the second one is dynamic."}, {"time": 5405, "text": "The second one is like, say there's an obvious example is like a car stopped at a red light, right?"}, {"time": 5410, "text": "You can't have that car in your map because you don't know whether that car is gonna be there or not."}, {"time": 5414, "text": "So you have to detect that car in real time and then you have to do the appropriate action, right?"}, {"time": 5421, "text": "Also, that car is not a fixed object."}, {"time": 5424, "text": "That car may move and you have to predict what that car will do, right?"}, {"time": 5428, "text": "So this is the dynamic problem."}, {"time": 5431, "text": "So you have to deal with this."}, {"time": 5432, "text": "This involves, again, like you're gonna need models of other people's behavior."}, {"time": 5439, "text": "Are you including in that, I don't wanna step on the third one."}, {"time": 5443, "text": "But are you including in that your influence on people?"}, {"time": 5446, "text": "Ah, that's the third one."}, {"time": 5449, "text": "That's the third one."}, {"time": 5449, "text": "We call it the counterfactual."}, {"time": 5453, "text": "I just talked to Judea Pearl who's obsessed with counterfactuals."}, {"time": 5455, "text": "And the counterfactual."}, {"time": 5456, "text": "Oh yeah, yeah, I read his books."}, {"time": 5458, "text": "So the static and the dynamic Yeah."}, {"time": 5461, "text": "Our approach right now for lateral will scale completely to the static and dynamic."}, {"time": 5467, "text": "The counterfactual, the only way I have to do it yet, the thing that I wanna do once we have all of these cars is I wanna do reinforcement learning on the world."}, {"time": 5476, "text": "I'm always gonna turn the exploiter up to max."}, {"time": 5478, "text": "I'm not gonna have them explore."}, {"time": 5480, "text": "But the only real way to get at the counterfactual is to do reinforcement learning because the other agents are humans."}, {"time": 5487, "text": "So that's fascinating that you break it down like that."}, {"time": 5490, "text": "I agree completely."}, {"time": 5491, "text": "I've spent my life thinking about this problem."}, {"time": 5494, "text": "And part of it, because you're slightly insane, it's good."}, {"time": 5501, "text": "Not my life."}, {"time": 5502, "text": "Just the last four years."}, {"time": 5503, "text": "You have some nonzero percent of your brain has a madman in it, which is good."}, {"time": 5511, "text": "That's a really good feature."}, {"time": 5512, "text": "But there's a safety component to it that I think sort of with counterfactuals and so on that would just freak people out."}, {"time": 5520, "text": "How do you even start to think about just in general?"}, {"time": 5523, "text": "I mean, you've had some friction with NHTSA and so on."}, {"time": 5527, "text": "I am frankly exhausted by safety engineers."}, {"time": 5534, "text": "The prioritization on safety over innovation to a degree where it kills, in my view, kills safety in the long term."}, {"time": 5546, "text": "So the counterfactual thing, they just actually exploring this world of how do you interact with dynamic objects and so on."}, {"time": 5553, "text": "How do you think about safety?"}, {"time": 5554, "text": "You can do reinforcement learning without ever exploring."}, {"time": 5558, "text": "And I said that, so you can think about your, in reinforcement learning, it's usually called a temperature parameter."}, {"time": 5564, "text": "And your temperature parameter is how often you deviate from the argmax."}, {"time": 5568, "text": "I could always set that to zero and still learn."}, {"time": 5570, "text": "And I feel that you'd always want that set to zero on your actual system."}, {"time": 5574, "text": "But the problem is you first don't know very much."}, {"time": 5578, "text": "And so you're going to make mistakes."}, {"time": 5579, "text": "So the learning, the exploration happens through mistakes."}, {"time": 5582, "text": "Yeah, but okay."}, {"time": 5583, "text": "So the consequences of a mistake."}, {"time": 5586, "text": "Open pilot and autopilot are making mistakes left and right."}, {"time": 5589, "text": "We have 700 daily active users, a thousand weekly active users."}, {"time": 5594, "text": "Open pilot makes tens of thousands of mistakes a week."}, {"time": 5598, "text": "These mistakes have zero consequences."}, {"time": 5601, "text": "These mistakes are, oh, I wanted to take this exit and it went straight."}, {"time": 5606, "text": "So I'm just going to carefully touch the wheel."}, {"time": 5608, "text": "The humans catch them."}, {"time": 5610, "text": "And the human disengagement is labeling that reinforcement learning in a completely consequence free way."}, {"time": 5617, "text": "So driver monitoring is the way you ensure they keep."}, {"time": 5620, "text": "They keep paying attention."}, {"time": 5622, "text": "How is your messaging?"}, {"time": 5623, "text": "Say I gave you a billion dollars, you would be scaling it now."}, {"time": 5627, "text": "Oh, I couldn't scale it with any amount of money."}, {"time": 5629, "text": "I'd raise money if I could, if I had a way to scale it."}, {"time": 5631, "text": "Yeah, you're now not focused on scale."}, {"time": 5633, "text": "I don't know how to do, oh, like I guess I could sell it to more people, but I want to make the system better."}, {"time": 5637, "text": "Better, better."}, {"time": 5637, "text": "And I don't know how to, I mean."}, {"time": 5638, "text": "But what's the messaging here?"}, {"time": 5641, "text": "I got a chance to talk to Elon and he basically said that the human factor doesn't matter."}, {"time": 5649, "text": "You know, the human doesn't matter because the system will perform, there'll be sort of a, sorry to use the term, but like a singular, like a point where it gets just much better."}, {"time": 5657, "text": "And so the human, it won't really matter."}, {"time": 5660, "text": "But it seems like that human catching the system when it gets into trouble is like the thing which will make something like reinforcement learning work."}, {"time": 5672, "text": "So how do you think messaging for Tesla, for you should change, for the industry in general should change?"}, {"time": 5679, "text": "I think our messaging is pretty clear."}, {"time": 5680, "text": "At least like our messaging wasn't that clear in the beginning and I do kind of fault myself for that."}, {"time": 5685, "text": "We are proud right now to be a level two system."}, {"time": 5688, "text": "We are proud to be level two."}, {"time": 5690, "text": "If we talk about level four, it's not with the current hardware."}, {"time": 5693, "text": "It's not gonna be just a magical OTA upgrade."}, {"time": 5695, "text": "It's gonna be new hardware."}, {"time": 5697, "text": "It's gonna be very carefully thought out."}, {"time": 5699, "text": "Right now, we are proud to be level two and we have a rigorous safety model."}, {"time": 5703, "text": "I mean, not like, okay, rigorous, who knows what that means, but we at least have a safety model and we make it explicit as in safety.md in OpenPilot."}, {"time": 5711, "text": "And it says, seriously though, safety.md."}, {"time": 5717, "text": "This is brilliant, this is so Android."}, {"time": 5718, "text": "Well, this is the safety model and I like to have conversations like, sometimes people will come to you and they're like, your system's not safe."}, {"time": 5729, "text": "Okay, have you read my safety docs?"}, {"time": 5731, "text": "Would you like to have an intelligent conversation about this?"}, {"time": 5733, "text": "And the answer is always no."}, {"time": 5734, "text": "They just like scream about, it runs Python."}, {"time": 5738, "text": "Okay, what?"}, {"time": 5739, "text": "So you're saying that because Python's not real time, Python not being real time never causes disengagements."}, {"time": 5744, "text": "Disengagements are caused by, the model is QM."}, {"time": 5747, "text": "But safety.md says the following, first and foremost, the driver must be paying attention at all times."}, {"time": 5755, "text": "I still consider the software to be alpha software until we can actually enforce that statement, but I feel it's very well communicated to our users."}, {"time": 5763, "text": "Two more things."}, {"time": 5764, "text": "One is the user must be able to easily take control of the vehicle at all times."}, {"time": 5770, "text": "So if you step on the gas or brake with OpenPilot, it gives full manual control back to the user or press the cancel button."}, {"time": 5778, "text": "Step two, the car will never react so quickly, we define so quickly to be about one second, that you can't react in time."}, {"time": 5787, "text": "And we do this by enforcing torque limits, braking limits and acceleration limits."}, {"time": 5791, "text": "So we have like our torque limits way lower than Tesla's."}, {"time": 5796, "text": "This is another potential."}, {"time": 5799, "text": "If I could tweak Autopilot, I would lower their torque limit and I would add driver monitoring."}, {"time": 5802, "text": "Because Autopilot can jerk the wheel hard."}, {"time": 5806, "text": "OpenPilot can't."}, {"time": 5807, "text": "We limit, and all this code is open source, readable."}, {"time": 5812, "text": "And I believe now it's all Misra C compliant."}, {"time": 5814, "text": "What's that mean?"}, {"time": 5817, "text": "Misra is like the automotive coding standard."}, {"time": 5820, "text": "At first, I've come to respect."}, {"time": 5823, "text": "I've been reading like the standards lately and I've come to respect them."}, {"time": 5825, "text": "They're actually written by very smart people."}, {"time": 5827, "text": "Yeah, they're brilliant people actually."}, {"time": 5829, "text": "They have a lot of experience."}, {"time": 5831, "text": "They're sometimes a little too cautious, but in this case, it pays off."}, {"time": 5836, "text": "Misra is written by like computer scientists."}, {"time": 5838, "text": "And you can tell by the language they use."}, {"time": 5839, "text": "You can tell by the language they use, they talk about like whether certain conditions in Misra are decidable or undecidable."}, {"time": 5846, "text": "And you mean like the halting problem?"}, {"time": 5848, "text": "And yes, all right, you've earned my respect."}, {"time": 5851, "text": "I will read carefully what you have to say and we wanna make our code compliant with that."}, {"time": 5855, "text": "All right, so you're proud level two, beautiful."}, {"time": 5858, "text": "So you were the founder and I think CEO of Kama AI, then you were the head of research."}, {"time": 5864, "text": "What the heck are you now?"}, {"time": 5866, "text": "What's your connection to Kama AI?"}, {"time": 5867, "text": "I'm the president, but I'm one of those like unelected presidents of like a small dictatorship country, not one of those like elected presidents."}, {"time": 5875, "text": "Oh, so you're like Putin when he was like the, yeah, I got you."}, {"time": 5879, "text": "So there's a, what's the governance structure?"}, {"time": 5882, "text": "What's the future of Kama AI?"}, {"time": 5884, "text": "I mean, yeah, it's a business."}, {"time": 5887, "text": "Do you want, are you just focused on getting things right now, making some small amount of money in the meantime and then when it works, it works and you scale."}, {"time": 5897, "text": "Our burn rate is about 200K a month and our revenue is about 100K a month."}, {"time": 5903, "text": "So we need to forex our revenue, but we haven't like tried very hard at that yet."}, {"time": 5908, "text": "And the revenue is basically selling stuff online."}, {"time": 5910, "text": "Yeah, we sell stuff shop.kama.ai."}, {"time": 5912, "text": "Is there other, well, okay, so you'll have to figure out the revenue."}, {"time": 5915, "text": "That's our only, see, but to me, that's like respectable revenues."}, {"time": 5920, "text": "We make it by selling products to consumers who are honest and transparent about what they are."}, {"time": 5925, "text": "Most actually level four companies, right?"}, {"time": 5930, "text": "Cause you could easily start blowing up like smoke, like overselling the hype and feeding into, getting some fundraisers."}, {"time": 5939, "text": "Oh, you're the guy, you're a genius because you hacked the iPhone."}, {"time": 5941, "text": "Oh, I hate that, I hate that."}, {"time": 5943, "text": "Yeah, well, I can trade my social capital for more money."}, {"time": 5946, "text": "I did it once, I almost regret it doing it the first time."}, {"time": 5950, "text": "Well, on a small tangent, what's your, you seem to not like fame and yet you're also drawn to fame."}, {"time": 5958, "text": "Where are you on that currently?"}, {"time": 5964, "text": "Have you had some introspection, some soul searching?"}, {"time": 5967, "text": "Yeah, I actually, I've come to a pretty stable position on that."}, {"time": 5972, "text": "Like after the first time, I realized that I don't want attention from the masses."}, {"time": 5976, "text": "I want attention from people who I respect."}, {"time": 5980, "text": "Who do you respect?"}, {"time": 5981, "text": "I can give a list of people."}, {"time": 5983, "text": "So are these like Elon Musk type characters?"}, {"time": 5987, "text": "Yeah, well, actually, you know what?"}, {"time": 5990, "text": "I'll make it more broad than that."}, {"time": 5991, "text": "I won't make it about a person, I respect skill."}, {"time": 5994, "text": "I respect people who have skills, right?"}, {"time": 5996, "text": "And I would like to like be, I'm not gonna say famous, but be like known among more people who have like real skills."}, {"time": 6006, "text": "Who in cars do you think have skill, not do you respect?"}, {"time": 6015, "text": "Oh, Kyle Vogt has skill."}, {"time": 6017, "text": "A lot of people at Waymo have skill and I respect them."}, {"time": 6020, "text": "I respect them as engineers."}, {"time": 6023, "text": "Like I can think, I mean, I think about all the times in my life where I've been like dead set on approaches and they turn out to be wrong."}, {"time": 6029, "text": "So, I mean, this might, I might be wrong."}, {"time": 6031, "text": "I accept that."}, {"time": 6032, "text": "I accept that there's a decent chance that I'm wrong."}, {"time": 6036, "text": "And actually, I mean, having talked to Chris Hermsons, Sterling Anderson, those guys, I mean, I deeply respect Chris."}, {"time": 6043, "text": "I just admire the guy."}, {"time": 6046, "text": "He's legit."}, {"time": 6047, "text": "When you drive a car through the desert when everybody thinks it's impossible, that's legit."}, {"time": 6052, "text": "And then I also really respect the people who are like writing the infrastructure of the world, like the Linus Torvalds and the Chris Lattiners."}, {"time": 6057, "text": "They were doing the real work."}, {"time": 6059, "text": "I know, they're doing the real work."}, {"time": 6060, "text": "This, having talked to Chris, like Chris Lattiners, you realize, especially when they're humble, it's like you realize, oh, you guys, we're just using your, Oh yeah."}, {"time": 6070, "text": "All the hard work that you did."}, {"time": 6071, "text": "Yeah, that's incredible."}, {"time": 6073, "text": "What do you think, Mr. Anthony Lewandowski, what do you, he's another mad genius."}, {"time": 6081, "text": "Sharp guy, oh yeah."}, {"time": 6082, "text": "What, do you think he might long term become a competitor?"}, {"time": 6087, "text": "Oh, to comma?"}, {"time": 6088, "text": "Well, so I think that he has the other right approach."}, {"time": 6092, "text": "I think that right now there's two right approaches."}, {"time": 6095, "text": "One is what we're doing, and one is what he's doing."}, {"time": 6097, "text": "Can you describe, I think it's called Pronto AI."}, {"time": 6099, "text": "He started a new thing."}, {"time": 6100, "text": "Do you know what the approach is?"}, {"time": 6102, "text": "I actually don't know."}, {"time": 6103, "text": "Embark is also doing the same sort of thing."}, {"time": 6105, "text": "The idea is almost that you want to, so if you're, I can't partner with Honda and Toyota."}, {"time": 6111, "text": "Honda and Toyota are like 400,000 person companies."}, {"time": 6116, "text": "It's not even a company at that point."}, {"time": 6118, "text": "I don't think of it like, I don't personify it."}, {"time": 6120, "text": "I think of it like an object, but a trucker drives for a fleet, maybe that has like, some truckers are independent."}, {"time": 6129, "text": "Some truckers drive for fleets with a hundred trucks."}, {"time": 6131, "text": "There are tons of independent trucking companies out there."}, {"time": 6134, "text": "Start a trucking company and drive your costs down or figure out how to drive down the cost of trucking."}, {"time": 6143, "text": "Another company that I really respect is Nato."}, {"time": 6145, "text": "Actually, I respect their business model."}, {"time": 6147, "text": "Nato sells a driver monitoring camera and they sell it to fleet owners."}, {"time": 6153, "text": "If I owned a fleet of cars and I could pay 40 bucks a month to monitor my employees, this is gonna, it like reduces accidents 18%."}, {"time": 6165, "text": "It's so like that, in the space, that is like the business model that I like most respect."}, {"time": 6172, "text": "Cause they're creating value today."}, {"time": 6174, "text": "Yeah, which is a, that's a huge one."}, {"time": 6177, "text": "How do we create value today with some of this?"}, {"time": 6179, "text": "And the lane keeping thing is huge."}, {"time": 6181, "text": "And it sounds like you're creeping in or full steam ahead on the driver monitoring too, which I think actually where the short term value, if you can get it right."}, {"time": 6190, "text": "I still, I'm not a huge fan of the statement that everything has to have driver monitoring."}, {"time": 6195, "text": "I agree with that completely, but that statement usually misses the point that to get the experience of it right is not trivial."}, {"time": 6201, "text": "Oh no, not at all."}, {"time": 6202, "text": "In fact, like, so right now we have, I think the timeout depends on speed of the car, but we want to depend on like the scene state."}, {"time": 6212, "text": "If you're on like an empty highway, it's very different if you don't pay attention than if like you're like coming up to a traffic light."}, {"time": 6222, "text": "And longterm, it should probably learn from the driver because that's to do, I watched a lot of video."}, {"time": 6228, "text": "We've built a smartphone detector just to analyze how people are using smartphones and people are using it very differently."}, {"time": 6233, "text": "It's a texting styles."}, {"time": 6237, "text": "There's."}, {"time": 6238, "text": "We haven't watched nearly enough of the videos."}, {"time": 6240, "text": "We haven't, I got millions of miles of people driving cars."}, {"time": 6242, "text": "In this moment, I spent a large fraction of my time just watching videos because it's never fails to learn."}, {"time": 6250, "text": "Like it never, I've never failed from a video watching session to learn something I didn't know before."}, {"time": 6255, "text": "In fact, I usually like when I eat lunch, I'll sit, especially when the weather is good and just watch pedestrians with an eye to understand like from a computer vision eye, just to see can this model, can you predict, what are the decisions made?"}, {"time": 6270, "text": "And there's so many things that we don't understand."}, {"time": 6273, "text": "This is what I mean about the state vector."}, {"time": 6274, "text": "Yeah, it's, I'm trying to always think like, cause I'm understanding in my human brain, how do we convert that into, how hard is the learning problem here?"}, {"time": 6284, "text": "I guess is the fundamental question."}, {"time": 6286, "text": "So something that's from a hacking perspective, this is always comes up, especially with folks."}, {"time": 6294, "text": "Well, first the most popular question is the trolley problem, right?"}, {"time": 6298, "text": "So that's not a sort of a serious problem."}, {"time": 6301, "text": "There are some ethical questions I think that arise."}, {"time": 6306, "text": "Maybe you wanna, do you think there's any ethical, serious ethical questions?"}, {"time": 6311, "text": "We have a solution to the trolley problem at Comm.ai."}, {"time": 6314, "text": "Well, so there is actually an alert in our code, ethical dilemma detected."}, {"time": 6318, "text": "It's not triggered yet."}, {"time": 6318, "text": "We don't know how yet to detect the ethical dilemmas, but we're a level two system."}, {"time": 6322, "text": "So we're going to disengage and leave that decision to the human."}, {"time": 6325, "text": "You're such a troll."}, {"time": 6326, "text": "No, but the trolley problem deserves to be trolled."}, {"time": 6328, "text": "Yeah, that's a beautiful answer actually."}, {"time": 6332, "text": "I know, I gave it to someone who was like, sometimes people will ask, like you asked about the trolley problem, like you can have a kind of discussion about it."}, {"time": 6338, "text": "Like you get someone who's like really like earnest about it because it's the kind of thing where, if you ask a bunch of people in an office, whether we should use a SQL stack or a no SQL stack, if they're not that technical, they have no opinion."}, {"time": 6350, "text": "But if you ask them what color they want to paint the office, everyone has an opinion on that."}, {"time": 6354, "text": "And that's why the trolley problem is..."}, {"time": 6356, "text": "I mean, that's a beautiful answer."}, {"time": 6357, "text": "Yeah, we're able to detect the problem and we're able to pass it on to the human."}, {"time": 6361, "text": "Wow, I've never heard anyone say it."}, {"time": 6363, "text": "This is your nice escape route."}, {"time": 6366, "text": "Okay, but..."}, {"time": 6367, "text": "Proud level two."}, {"time": 6368, "text": "I'm proud level two."}, {"time": 6370, "text": "So the other thing that people have some concern about with AI in general is hacking."}, {"time": 6377, "text": "So how hard is it, do you think, to hack an autonomous vehicle, either through physical access or through the more sort of popular now, these adversarial examples on the sensors?"}, {"time": 6388, "text": "Okay, the adversarial examples one."}, {"time": 6390, "text": "You want to see some adversarial examples that affect humans, right?"}, {"time": 6394, "text": "Oh, well, there used to be a stop sign here, but I put a black bag over the stop sign and then people ran it, adversarial, right?"}, {"time": 6403, "text": "Like there's tons of human adversarial examples too."}, {"time": 6408, "text": "The question in general about like security, if you saw something just came out today and like there are always such hypey headlines about like how navigate on autopilot was fooled by a GPS spoof to take an exit."}, {"time": 6421, "text": "At least that's all they could do was take an exit."}, {"time": 6423, "text": "If your car is relying on GPS in order to have a safe driving policy, you're doing something wrong."}, {"time": 6430, "text": "If you're relying, and this is why V2V is such a terrible idea."}, {"time": 6434, "text": "V2V now relies on both parties getting communication right."}, {"time": 6439, "text": "This is not even, so I think of safety, security is like a special case of safety, right?"}, {"time": 6448, "text": "Safety is like we put a little, you know, piece of caution tape around the hole so that people won't walk into it by accident."}, {"time": 6455, "text": "Security is like put a 10 foot fence around the hole so you actually physically cannot climb into it with barbed wire on the top and stuff, right?"}, {"time": 6462, "text": "So like if you're designing systems that are like unreliable, they're definitely not secure."}, {"time": 6468, "text": "Your car should always do something safe using its local sensors."}, {"time": 6473, "text": "And then the local sensor should be hardwired."}, {"time": 6475, "text": "And then could somebody hack into your CAN bus and turn your steering wheel on your brakes?"}, {"time": 6478, "text": "Yes, but they could do it before common AI too, so."}, {"time": 6482, "text": "Let's think out of the box on some things."}, {"time": 6484, "text": "So do you think teleoperation has a role in any of this?"}, {"time": 6489, "text": "So remotely stepping in and controlling the cars?"}, {"time": 6493, "text": "No, I think that if the safety operation by design requires a constant link to the cars, I think it doesn't work."}, {"time": 6507, "text": "So that's the same argument you're using for V2I, V2V?"}, {"time": 6511, "text": "Well, there's a lot of non safety critical stuff you can do with V2I."}, {"time": 6515, "text": "I like V2I, I like V2I way more than V2V."}, {"time": 6517, "text": "Because V2I is already like, I already have internet in the car, right?"}, {"time": 6520, "text": "There's a lot of great stuff you can do with V2I."}, {"time": 6524, "text": "Like for example, you can, well, I already have V2I, Waze is V2I, right?"}, {"time": 6528, "text": "Waze can route me around traffic jams."}, {"time": 6530, "text": "That's a great example of V2I."}, {"time": 6532, "text": "And then, okay, the car automatically talks to that same service, like it works."}, {"time": 6535, "text": "So it's improving the experience, but it's not a fundamental fallback for safety."}, {"time": 6539, "text": "No, if any of your things that require wireless communication are more than QM, like have an ASL rating, it shouldn't be."}, {"time": 6550, "text": "You previously said that life is work and that you don't do anything to relax."}, {"time": 6557, "text": "So how do you think about hard work?"}, {"time": 6560, "text": "What do you think it takes to accomplish great things?"}, {"time": 6564, "text": "And there's a lot of people saying that there needs to be some balance."}, {"time": 6568, "text": "You need to, in order to accomplish great things, you need to take some time off, you need to reflect and so on."}, {"time": 6573, "text": "Now, and then some people are just insanely working, burning the candle on both ends."}, {"time": 6581, "text": "I think I was trolling in the Siraj interview when I said that."}, {"time": 6584, "text": "Off camera, right before I smoked a little bit of weed, like, you know, come on, this is a joke, right?"}, {"time": 6589, "text": "Like I do nothing to relax."}, {"time": 6590, "text": "Look where I am, I'm at a party, right?"}, {"time": 6592, "text": "Yeah, yeah, yeah, that's true."}, {"time": 6595, "text": "So no, no, of course I don't."}, {"time": 6598, "text": "When I say that life is work though, I mean that like, I think that what gives my life meaning is work."}, {"time": 6604, "text": "I don't mean that every minute of the day you should be working."}, {"time": 6606, "text": "I actually think this is not the best way to maximize results."}, {"time": 6609, "text": "I think that if you're working 12 hours a day, you should be working smarter and not harder."}, {"time": 6614, "text": "Well, so work gives you meaning."}, {"time": 6617, "text": "For some people, other sorts of meaning is personal relationships, like family and so on."}, {"time": 6624, "text": "You've also, in that interview with Siraj, or the trolling, mentioned that one of the things you look forward to in the future is AI girlfriends."}, {"time": 6634, "text": "So that's a topic that I'm very much fascinated by, not necessarily girlfriends, but just forming a deep connection with AI."}, {"time": 6642, "text": "What kind of system do you imagine when you say AI girlfriend, whether you were trolling or not?"}, {"time": 6647, "text": "No, that one I'm very serious about."}, {"time": 6649, "text": "And I'm serious about that on both a shallow level and a deep level."}, {"time": 6653, "text": "I think that VR brothels are coming soon and are going to be really cool."}, {"time": 6657, "text": "It's not cheating if it's a robot."}, {"time": 6659, "text": "I see the slogan already."}, {"time": 6663, "text": "But there's, I don't know if you've watched, or just watched the Black Mirror episode."}, {"time": 6668, "text": "I watched the latest one, yeah."}, {"time": 6671, "text": "Oh, the Ashley 2 one?"}, {"time": 6675, "text": "No, where there's two friends who are having sex with each other in... Oh, in the VR game."}, {"time": 6681, "text": "In the VR game."}, {"time": 6682, "text": "It's just two guys, but one of them was a female, yeah."}, {"time": 6687, "text": "Which is another mind blowing concept."}, {"time": 6689, "text": "That in VR, you don't have to be the form."}, {"time": 6693, "text": "You can be two animals having sex."}, {"time": 6698, "text": "I mean, I'll see how nice that the software maps the nerve endings, right?"}, {"time": 6700, "text": "Yeah, it's huge."}, {"time": 6701, "text": "I mean, yeah, they sweep a lot of the fascinating, really difficult technical challenges under the rug, like assuming it's possible to do the mapping of the nerve endings, then..."}, {"time": 6711, "text": "I wish, yeah, I saw that, the way they did it with the little like stim unit on the head, that'd be amazing."}, {"time": 6716, "text": "So, well, no, no, on a shallow level, like you could set up like almost a brothel with like real dolls and Oculus Quests, write some good software."}, {"time": 6726, "text": "I think it'd be a cool novelty experience."}, {"time": 6729, "text": "But no, on a deeper, like emotional level, I mean, yeah, I would really like to fall in love with a machine."}, {"time": 6738, "text": "Do you see yourself having a long term relationship of the kind monogamous relationship that we have now with a robot, with a AI system even, not even just a robot?"}, {"time": 6752, "text": "So I think about maybe my ideal future."}, {"time": 6758, "text": "When I was 15, I read Eliezer Yudkowsky's early writings on the singularity and like that AI is going to surpass human intelligence massively."}, {"time": 6773, "text": "He made some Moore's law based predictions that I mostly agree with."}, {"time": 6777, "text": "And then I really struggled for the next couple of years of my life."}, {"time": 6781, "text": "Like, why should I even bother to learn anything?"}, {"time": 6783, "text": "It's all gonna be meaningless when the machines show up."}, {"time": 6787, "text": "Maybe when I was that young, I was still a little bit more pure and really like clung to that."}, {"time": 6793, "text": "And then I'm like, well, the machines ain't here yet, you know, and I seem to be pretty good at this stuff."}, {"time": 6796, "text": "Let's try my best, you know, like what's the worst that happens."}, {"time": 6801, "text": "But the best possible future I see is me sort of merging with the machine."}, {"time": 6806, "text": "And the way that I personify this is in a long term monogamous relationship with a machine."}, {"time": 6812, "text": "Oh, you don't think there's a room for another human in your life, if you really truly merge with another machine?"}, {"time": 6819, "text": "I mean, I see merging."}, {"time": 6820, "text": "I see like the best interface to my brain is like the same relationship interface to merge with an AI, right?"}, {"time": 6829, "text": "What does that merging feel like?"}, {"time": 6832, "text": "I've seen couples who've been together for a long time."}, {"time": 6835, "text": "And like, I almost think of them as one person, like couples who spend all their time together and... That's fascinating."}, {"time": 6842, "text": "You're actually putting, what does that merging actually looks like?"}, {"time": 6846, "text": "It's not just a nice channel."}, {"time": 6848, "text": "Like a lot of people imagine it's just an efficient link, search link to Wikipedia or something."}, {"time": 6854, "text": "I don't believe in that."}, {"time": 6855, "text": "But it's more, you're saying that there's the same kind of relationship you have with another human, that's a deep relationship."}, {"time": 6860, "text": "That's what merging looks like."}, {"time": 6862, "text": "That's pretty..."}, {"time": 6864, "text": "I don't believe that link is possible."}, {"time": 6866, "text": "I think that that link, so you're like, oh, I'm gonna download Wikipedia right to my brain."}, {"time": 6870, "text": "My reading speed is not limited by my eyes."}, {"time": 6873, "text": "My reading speed is limited by my inner processing loop."}, {"time": 6876, "text": "And to like bootstrap that sounds kind of unclear how to do it and horrifying."}, {"time": 6882, "text": "But if I am with somebody and I'll use a somebody who is making a super sophisticated model of me and then running simulations on that model, I'm not gonna get into the question whether the simulations are conscious or not."}, {"time": 6895, "text": "I don't really wanna know what it's doing."}, {"time": 6898, "text": "But using those simulations to play out hypothetical futures for me, deciding what things to say to me, to guide me along a path."}, {"time": 6906, "text": "And that's how I envision it."}, {"time": 6908, "text": "So on that path to AI of superhuman level intelligence, you've mentioned that you believe in the singularity, that singularity is coming."}, {"time": 6918, "text": "Again, could be trolling, could be not, could be part, all trolling has truth in it."}, {"time": 6923, "text": "I don't know what that means anymore."}, {"time": 6924, "text": "What is the singularity?"}, {"time": 6925, "text": "Yeah, so that's really the question."}, {"time": 6928, "text": "How many years do you think before the singularity, what form do you think it will take?"}, {"time": 6932, "text": "Does that mean fundamental shifts in capabilities of AI?"}, {"time": 6935, "text": "Or does it mean some other kind of ideas?"}, {"time": 6939, "text": "Maybe that's just my roots, but."}, {"time": 6941, "text": "So I can buy a human beings worth of compute for like a million bucks today."}, {"time": 6946, "text": "It's about one TPU pod V3."}, {"time": 6947, "text": "I want like, I think they claim a hundred pay to flops."}, {"time": 6950, "text": "That's being generous."}, {"time": 6950, "text": "I think humans are actually more like 20."}]}]