[{"title": "Yeonmi Park: North Korea | Lex Fridman Podcast #196", "id": "usDqSEKDVsA", "quotes": [{"time": 297, "text": "For me at least, it was love."}, {"time": 297, "text": "Yeah, it was all the moderation and gratitude."}, {"time": 303, "text": "It changed lately, but for me was pure, pure like love."}, {"time": 308, "text": "Was there any, like looking back with the perspective you have now, would you describe some of those moments growing up as full of happiness?"}, {"time": 312, "text": "Or was that delusion at the time?"}, {"time": 320, "text": "So not knowing the alternative, will you still be able to be happy?"}, {"time": 326, "text": "The fact that I did not know, like in North Korea, this is the only country in this 21st century has no internet."}, {"time": 332, "text": "And they don't even know the existence of internet."}, {"time": 332, "text": "Not only that, we don't even have this 24 hour electricity."}, {"time": 339, "text": "So not knowing definitely helped, I think, to be sane."}, {"time": 347, "text": "So as a human being, you're still able to find moments of happiness?"}, {"time": 353, "text": "I think my happiness was from family, nothing else."}, {"time": 353, "text": "Even though those days keep telling me that they were our source of meaning and happiness, I don't think I ever got happy by that."}, {"time": 366, "text": "Maybe they're here and they're in schools."}, {"time": 366, "text": "And like when I was learning propaganda, like, you know, the proud feeling, right?"}, {"time": 370, "text": "I mean, the greatest nation here and there, but like actually true happiness came from laughing with my family, my friends."}, {"time": 380, "text": "Are there any childhood memories, pleasant or painful ones that stand out to you now?"}, {"time": 388, "text": "I mean, like, you know, whenever I think about my North Korea, the interesting is there's no color."}, {"time": 394, "text": "I mean, one is because North Korean country has no color, right?"}, {"time": 394, "text": "Most of things are unpaved and trees all cut down."}, {"time": 400, "text": "We have no fear."}, {"time": 400, "text": "So people cut down trees to make food."}, {"time": 406, "text": "So but only that, like, even what we are wearing was like no color."}, {"time": 406, "text": "So it's an interesting memory to look back."}, {"time": 417, "text": "What about fashion?"}, {"time": 417, "text": "I've noticed from sort of you now, you have quite an incredible sense of fashion."}, {"time": 424, "text": "So contrast that with your time in North Korea."}, {"time": 424, "text": "How do you remember fashion?"}, {"time": 424, "text": "Just ways that people could express themselves visually."}, {"time": 430, "text": "Was it all bland?"}, {"time": 435, "text": "There was no word for fashion in North Korea."}, {"time": 435, "text": "We didn't even know."}, {"time": 435, "text": "It was not even in our dictionary."}, {"time": 440, "text": "So of course, I did not know what Victoria's Secret models were."}, {"time": 440, "text": "I didn't even know what models were."}, {"time": 445, "text": "So when I came out, I learned the model was a job."}, {"time": 445, "text": "And like, what is that?"}, {"time": 452, "text": "And I'm still confused."}, {"time": 452, "text": "So there's so many jobs that we have here doesn't exist in North Korea."}, {"time": 459, "text": "What was life like in North Korea as compared to the rest of the world?"}, {"time": 459, "text": "So maybe you said there's no internet."}, {"time": 464, "text": "24 hour electricity is a luxury you do not have."}, {"time": 464, "text": "What about food?"}, {"time": 472, "text": "What about water?"}, {"time": 472, "text": "What about basic human rights?"}, {"time": 476, "text": "I think that's a thing like when people were asking me, can you tell me about like life in North Korea?"}, {"time": 481, "text": "And in the past, I was like, I cannot describe it to you."}, {"time": 481, "text": "And initially I thought, oh, because of my English that I cannot find the words."}, {"time": 486, "text": "It's not that it's a different planet."}, {"time": 490, "text": "The common sense that we have doesn't exist there."}, {"time": 490, "text": "Like people literally do not know the concept of romantic love, or human rights or liberty."}, {"time": 496, "text": "So when I'm thinking back to my country, it's, you know, like, as you cannot imagine your life on Mars right now."}, {"time": 511, "text": "It's like that kind of difference."}, {"time": 511, "text": "I grew up never seen the map of the world."}, {"time": 511, "text": "I never knew that I was Asian."}, {"time": 517, "text": "Like the regime told me that I was Kim Il Sung, the first Kim race."}, {"time": 522, "text": "And then our calendar doesn't begin when Jesus Christ was born."}, {"time": 522, "text": "Our calendar begins where Kim was born."}, {"time": 529, "text": "So we, and history was forgotten to us."}, {"time": 529, "text": "They didn't teach us about of course, Christianity or like the Big Bang."}, {"time": 535, "text": "Like our history began when Kim was born."}, {"time": 542, "text": "So everything was forgotten to us."}, {"time": 542, "text": "And it was a different meaning."}, {"time": 542, "text": "I mean, feeling of existence, you know, it's not even like same life."}, {"time": 548, "text": "I literally think that was almost like my past life."}, {"time": 554, "text": "And this is like a new life that I began."}, {"time": 558, "text": "You're almost like a different human being now."}, {"time": 562, "text": "So you've, I have to say, I often say that my favorite book is Animal Farm by George Orwell."}, {"time": 570, "text": "I've read it, I don't know how many times."}, {"time": 570, "text": "And so I was really happy to hear that that was of the many books, excellent books that we'll hopefully talk about."}, {"time": 576, "text": "You've mentioned that Animal Farm had a big impact on you."}, {"time": 582, "text": "It was the book that kind of led to a kind of awakening for you."}, {"time": 590, "text": "Maybe can you describe what impact it had?"}, {"time": 594, "text": "So after going through what I went through, and I arrived in South Korea after many years of journey, they were saying, so Kims were dictators, and South Korea is not colonized by American bastards."}, {"time": 606, "text": "And Americans, first of all, not bastards, they're good people."}, {"time": 611, "text": "And then they say everything that you believe in North Korea was a lie."}, {"time": 611, "text": "It was a propaganda."}, {"time": 616, "text": "Then at 15, I was thinking, so if everything that I believe was a lie, how do I know what I believe is not a lie?"}, {"time": 622, "text": "That was so hard."}, {"time": 622, "text": "How do I trust ever again?"}, {"time": 622, "text": "And I just, it was chaos in belief."}, {"time": 629, "text": "I did not know what was true anymore."}, {"time": 629, "text": "And that's the moment, a few years later, I read this book, like Animal Farm, just by mistake."}, {"time": 635, "text": "It was a very short book in the library."}, {"time": 640, "text": "I was like, okay, I can finish that quickly."}, {"time": 640, "text": "And when they're ending that, like last chapter, they could not see between the pigs and humans anymore."}, {"time": 646, "text": "That sentence, I just understood everything that happened."}, {"time": 652, "text": "It made every sense to me, what happened to me, my people, and to my country."}, {"time": 663, "text": "Yeah, there's so many things I could say about that book."}, {"time": 663, "text": "Yeah, there's a haunting nature to the end."}, {"time": 669, "text": "And I guess spoiler alert, but you should have read this already."}, {"time": 669, "text": "If you're listening to this."}, {"time": 676, "text": "At the end, the animals were looking to the humans and to the pigs and they couldn't see the difference."}, {"time": 682, "text": "And then there's this kind of gradual transition from the initial revolutionary steps of animals fighting for their freedom to slowly the pigs gaining control, went from four legs good, two legs bad, to four legs good, two legs better, I believe."}, {"time": 706, "text": "Two legs even better, I think, something like that."}, {"time": 706, "text": "So like gradually transitioning the ideology under which the farm operates."}, {"time": 711, "text": "And I think the gradual nature of that, where basically you have generations born not knowing how things were in the past."}, {"time": 726, "text": "And that's what makes the most kind of, for me, haunting transition from freedom to slavery to suffering to injustice, all those things."}, {"time": 736, "text": "And the animals don't know they're part of that."}, {"time": 742, "text": "And also for me personally, I always kind of found a kinship with Boxer the horse because I just, I'm kind of an idiot, I just work really hard."}, {"time": 751, "text": "And I just love the idea of working hard for an ideal."}, {"time": 757, "text": "And the tragic nature of, to the end, that horse, Boxer, working his ass off for the pride for others."}, {"time": 767, "text": "But yeah, for the pride of the farm, you know."}, {"time": 776, "text": "And then the pigs giving him, sort of using that, but then just sending him to the slaughterhouse anyway, when he was no longer useful."}, {"time": 783, "text": "I mean, there's so many tragic elements that echo everything I've seen in the Soviet Union."}, {"time": 789, "text": "And many of the elements that you see in even harsher, more drastic way in North Korea."}, {"time": 794, "text": "If there's something hopeful you pull from that book, like within the suffering, within the gradual decline, the taking away the freedom, there were still moments of beauty, it seemed like."}, {"time": 809, "text": "But I think for me was when I was ending the last page of the book."}, {"time": 809, "text": "Until that point, I was angry towards the dictator."}, {"time": 816, "text": "Why do you do this as a human being?"}, {"time": 816, "text": "I was so angry, dreaming of killing him, right?"}, {"time": 822, "text": "Revenge on my father, the people that he killed."}, {"time": 827, "text": "But when I was ending the last chapter, actually everybody was responsible to create this dystopia in my country."}, {"time": 834, "text": "The initial animals, when they're scared, when they see the first execution, and then they were not doing their job, speaking out and keep questioning."}, {"time": 842, "text": "They had a question and then as soon as they see a fear, they silence."}, {"time": 847, "text": "Because of that, that's when I was like, my grandma knew life could be different."}, {"time": 853, "text": "I think the one thing about North Koreans are unique is that they don't know they're oppressed."}, {"time": 859, "text": "They don't know that they are slaves to the dictator."}, {"time": 864, "text": "And the fact that other people know they're oppressed, like in America, a lot of people think they are oppressed, like you are not oppressed."}, {"time": 869, "text": "You don't even know the definition of oppression."}, {"time": 873, "text": "And that's like when the new animals came, the new animals didn't even know what the life could be like."}, {"time": 879, "text": "There's no alternative for them to compare even."}, {"time": 884, "text": "And I was like, my grandmother knew."}, {"time": 884, "text": "Why didn't they not do anything about it?"}, {"time": 889, "text": "And they were just scared."}, {"time": 889, "text": "They kept silent."}, {"time": 889, "text": "And everybody was responsible."}, {"time": 894, "text": "So the people who knew were too afraid to say."}, {"time": 894, "text": "And then there's people that just didn't even know."}, {"time": 901, "text": "And I don't know what's more terrifying about human nature, looking at this group of people who are afraid to say that things could be otherwise, and then the group of people that don't even know it could be better."}, {"time": 918, "text": "It's, I don't know, that's the reason I return to that book often, because it's such, maybe because it's interesting using animals to represent ideas that were very human."}, {"time": 923, "text": "It almost allows you to explore the darkness of human nature without sort of being broken by it."}, {"time": 937, "text": "So you mentioned anger."}, {"time": 937, "text": "When I watch your interviews, you're really calm and collected."}, {"time": 944, "text": "Not just your interviews, you know, Instagram, the way you present yourself."}, {"time": 944, "text": "You, I don't know, it seems like you're almost at peace with the world."}, {"time": 952, "text": "Is there in private times when you're just angry?"}, {"time": 958, "text": "Do you feel fear?"}, {"time": 958, "text": "Do you go to dark places, depression, all those kinds of things?"}, {"time": 964, "text": "Are you, are you able to put that world that you were in behind you?"}, {"time": 970, "text": "It's a joke because I talk about North Korea every single day and I still rescue people like from China and Russia and other countries, right?"}, {"time": 977, "text": "And sometimes I'll rescue mission figures and they get captured and sent back."}, {"time": 983, "text": "I still have people in North Korea report to me."}, {"time": 988, "text": "So like when I talked to my sister who chose to not be in this life, activist life, she forgot most of things."}, {"time": 995, "text": "And like for the other hand, I like to remember everything."}, {"time": 1001, "text": "So sometimes it's a blessing to keep reminded of how, because it's, you know, they say happiness is a relative thing."}, {"time": 1010, "text": "It is sometimes."}, {"time": 1010, "text": "I mean, I think it's also people say because nobody was foreign when you're growing up, everybody was suffering."}, {"time": 1016, "text": "You should have been okay, right?"}, {"time": 1021, "text": "But no, like if you are suffering in that degree, no matter, even if there's no comparison, like if you're in Nazi Germany, in the Holocaust, right?"}, {"time": 1027, "text": "In the concentration camp, I'm sure nobody was better than them."}, {"time": 1031, "text": "I'm sure they were suffering."}, {"time": 1036, "text": "I suffered."}, {"time": 1036, "text": "But now because I'm in this place, I can compare easily, right?"}, {"time": 1036, "text": "Getting that perspective."}, {"time": 1042, "text": "But it is true, like I still have days that I cannot get out of bed."}, {"time": 1042, "text": "And I really hoping like that when it was Elon Musk talking about downloading your brain, blah, blah, blah."}, {"time": 1053, "text": "Maybe technology develops that I can download some part of my memory and then I can erase it or delete it."}, {"time": 1059, "text": "And that'd be so much better."}, {"time": 1064, "text": "What I, this is a, sorry for the tough question, but if I came to you, if Elon came to you and said, we can erase that part of your memory, would you do it?"}, {"time": 1076, "text": "Some days I would do it for sure."}, {"time": 1076, "text": "And my mom would do 100%."}, {"time": 1076, "text": "My sister would do it."}, {"time": 1076, "text": "All other defectors know they do 100%."}, {"time": 1082, "text": "For me, I hesitated because I'm a witness."}, {"time": 1082, "text": "So if I delete that part, I don't know how real that can be."}, {"time": 1090, "text": "But it is painful."}, {"time": 1090, "text": "After I talk, give a speech, right?"}, {"time": 1097, "text": "I mean, I'm fine."}, {"time": 1097, "text": "But somehow I'm depressed."}, {"time": 1097, "text": "Sometimes if the talk was very intense, I'm like depressed for three weeks."}, {"time": 1103, "text": "It takes a while for me to be recharged."}, {"time": 1103, "text": "But I don't know why it is."}, {"time": 1108, "text": "I just don't know."}, {"time": 1112, "text": "Well, there's also the, and there's a guy named Victor Franco who wrote the book, Man Search for Meaning."}, {"time": 1118, "text": "And there's some aspect where, so he talks about the Holocaust and that you can, in those moments of suffering, still discover meaning, still discover happiness in the simplest of joys."}, {"time": 1129, "text": "Like while starving, a little piece of bread could be a source of incredible joy."}, {"time": 1135, "text": "And there's some aspect in which that experience gives you a clarity about the world."}, {"time": 1144, "text": "Like somehow experiencing suffering allows you to deeply experience joy and love, and also empathize with the suffering of others."}, {"time": 1151, "text": "And it's almost like brings you closer to other humans."}, {"time": 1159, "text": "This double edged sword that the highest of joys sometimes are catalyzed by suffering."}, {"time": 1171, "text": "And it's hard to know what to do with that."}, {"time": 1171, "text": "You see that with World War II, the stories of soldiers that have suffered, but some of the closest bonds of brotherhood, of just pure love was experienced by them."}, {"time": 1181, "text": "And it sucks that our brains are like this."}, {"time": 1189, "text": "Love requires hardship."}, {"time": 1195, "text": "Yeah, that's like that thing."}, {"time": 1195, "text": "Of course, in my journey, I learned how to survive, right?"}, {"time": 1201, "text": "When to not trust and when to run."}, {"time": 1201, "text": "But I think most of us keep learning what it means to be a human being."}, {"time": 1208, "text": "I think that was like the ultimate thing I was keep learning."}, {"time": 1208, "text": "And I still don't know fully what it means."}, {"time": 1213, "text": "But I do think it seems like suffering is necessary for people to be grateful and even be joyful too sometimes."}, {"time": 1225, "text": "So I talk about love quite a bit."}, {"time": 1225, "text": "And you mentioned that romantic love."}, {"time": 1225, "text": "I'm fascinated about love in many aspects."}, {"time": 1231, "text": "But you mentioned romantic love was forbidden in North Korea."}, {"time": 1241, "text": "What do you think about love now that you've kind of discovered it?"}, {"time": 1241, "text": "What's the role of love in life?"}, {"time": 1247, "text": "So why do you think it was forbidden in North Korea?"}, {"time": 1253, "text": "So the tragic thing about North Korea is not only just banning Shakespeare, like we don't even know what Romeo and Juliet is, right?"}, {"time": 1258, "text": "Our movies is never about love stories."}, {"time": 1258, "text": "But then also they banned the love between mother and daughter, wife and husband, and between your friends."}, {"time": 1271, "text": "They deny you being a human."}, {"time": 1271, "text": "So only love that I knew was when I described my feeling towards the leader and in a written form."}, {"time": 1277, "text": "That was the only love that people know in North Korea."}, {"time": 1283, "text": "And now I'm like, there are many loves you can experience."}, {"time": 1283, "text": "I think you definitely love science, right?"}, {"time": 1289, "text": "But imagine that if you're being denied that."}, {"time": 1289, "text": "So there are so many loves in life."}, {"time": 1295, "text": "But in North Korea, all of those things are denied."}, {"time": 1295, "text": "And I think for me, love is what makes you tick."}, {"time": 1301, "text": "Like, you know, love for your child, love for your parents, love for your friends, love for even yourself."}, {"time": 1308, "text": "That is denied."}, {"time": 1308, "text": "So I mean, many people say like, love is an option."}, {"time": 1315, "text": "But like, then why do you live?"}, {"time": 1315, "text": "I think we live to love."}, {"time": 1320, "text": "And it doesn't have to be romantic love."}, {"time": 1320, "text": "It can be anything."}, {"time": 1320, "text": "But finding love in any person or in any subject, I think that's a goal."}, {"time": 1326, "text": "I think that's when people find meaning in something."}, {"time": 1332, "text": "Yeah, I think romantic love is just one sort of, one echo of some core thing."}, {"time": 1332, "text": "Yeah, science, I love science, I love robots, all of those things."}, {"time": 1339, "text": "And it sounds like deliberately or not, the North Korean regime wants to channel that very deep aspect of the human spirit all towards the leader."}, {"time": 1355, "text": "That's the only thing they allow us to fear and know about."}, {"time": 1355, "text": "So I remember, I mean, you read 1984 by George Orwell, it talks about double think and double speak, who controls the language, who controls thoughts."}, {"time": 1368, "text": "And why he does talk about as they go, they eliminate a lot of words, right?"}, {"time": 1374, "text": "Now, later one word can represent 10 different things."}, {"time": 1380, "text": "And what fascinates me is how many vocabulary meaning people can have."}, {"time": 1380, "text": "And when I literally came out, I remember I went to San Francisco, and someone came to me and hugged me."}, {"time": 1388, "text": "And then he was a guy like, oh, baby, don't worry, I'm gay."}, {"time": 1394, "text": "I was like, what the heck is gay?"}, {"time": 1399, "text": "And then I literally had to go to a hotel room and Google the gay."}, {"time": 1399, "text": "And it's like, oh, that's what you meant."}, {"time": 1404, "text": "And like that, like, they deny what that is."}, {"time": 1404, "text": "I'm sure there are gays in North Korea."}, {"time": 1410, "text": "I'm sure there is."}, {"time": 1410, "text": "But you don't know what it is."}, {"time": 1410, "text": "And like that, they eliminate words."}, {"time": 1416, "text": "So the fact that you know the concept, that stays much better than and that's the thing a lot of people like when you're born, you somehow know what justice is, what liberty is."}, {"time": 1426, "text": "And it's all somebody taught you that."}, {"time": 1426, "text": "And like, that's the thing why people say, oh, humans are inherently know what is right, what is wrong, what is oppression."}, {"time": 1437, "text": "And like, no, that's like BS."}, {"time": 1437, "text": "You got to learn."}, {"time": 1442, "text": "That's fascinating that words give rise to ideas."}, {"time": 1442, "text": "So like, as a child, one of the ways to learn about justice and freedom is to first learn the word, and then to ask, well, what is it?"}, {"time": 1455, "text": "Yeah, the concept."}, {"time": 1455, "text": "And if you don't have the word for it, then you never have the kind of first spark that leads to you trying to be curious about it."}, {"time": 1460, "text": "That's interesting and controlling the words."}, {"time": 1465, "text": "And then, yeah, I mean, your thoughts, you control the thoughts."}, {"time": 1470, "text": "There's so many echoes."}, {"time": 1470, "text": "I mean, I have, it's a very different, but perhaps a very similar experience, which is the journey of my family through the Soviet Union."}, {"time": 1477, "text": "Because there is a love of country."}, {"time": 1484, "text": "There is a pride of the people."}, {"time": 1484, "text": "Like you are proud of your family in general."}, {"time": 1489, "text": "But I wonder how much of that is polluted by the propaganda."}, {"time": 1497, "text": "It is to this day, I'm like, my father who died in China and he was tortured and then he died."}, {"time": 1506, "text": "He wanted to go back before his death, right?"}, {"time": 1506, "text": "And then it's like, dad, if you go back, you're going to be executed."}, {"time": 1513, "text": "And it's like, I want to be executed."}, {"time": 1518, "text": "He wanted to go back to North Korea."}, {"time": 1518, "text": "To be executed."}, {"time": 1518, "text": "So he can be buried in his own land."}, {"time": 1524, "text": "And then his last wish was, if I die, criminate me and then bring my ashes back to my country."}, {"time": 1532, "text": "When I'm dead, I still want to be in my country."}, {"time": 1532, "text": "And this is nationalism."}, {"time": 1538, "text": "This is a propaganda, right?"}, {"time": 1538, "text": "But now it's the same thing."}, {"time": 1538, "text": "If I die, I somehow buried in my land and I still feel like I'm the outsider."}, {"time": 1545, "text": "I'm always longing for my home."}, {"time": 1552, "text": "It's a horrible home."}, {"time": 1552, "text": "People say, what's your dream?"}, {"time": 1552, "text": "Do you want to be a president?"}, {"time": 1557, "text": "Do you want to run for office?"}, {"time": 1557, "text": "I just want to go home."}, {"time": 1557, "text": "That's my dream."}, {"time": 1562, "text": "And people here don't get it ever."}, {"time": 1562, "text": "I love my country."}, {"time": 1570, "text": "And I think for me, my country is the United States."}, {"time": 1570, "text": "And perhaps it will be for you too one day."}, {"time": 1576, "text": "I think it's becoming."}, {"time": 1576, "text": "US has been a very special place in my heart."}, {"time": 1581, "text": "I think this is the first place I felt like I feel like home."}, {"time": 1581, "text": "And I mean, I was in South Korea longer and I didn't feel that way."}, {"time": 1588, "text": "So I think we have very different life stories, but I think it's almost two different people."}, {"time": 1593, "text": "For me, it's the person that was in the Soviet Union and the person that's here."}, {"time": 1598, "text": "Those are two different people."}, {"time": 1598, "text": "That previous person's home in the Soviet Union and he's part of me."}, {"time": 1604, "text": "And I suppose in that same way, your first maybe two decades of life are somehow longing for the home that is North Korea."}, {"time": 1613, "text": "And your next two decades of life might be finding a home in the United States."}, {"time": 1620, "text": "Your dad, can you tell the story of his struggle, of his death?"}, {"time": 1628, "text": "I mean, first, do you miss him?"}, {"time": 1639, "text": "Oh man, all the time."}, {"time": 1639, "text": "I had a son when I was 22 and I had IVF three times."}, {"time": 1647, "text": "And as you see, I'm like 80 pounds, but back then I was like 75 pounds."}, {"time": 1647, "text": "And because of my severe malnutrition, somehow my body's very different."}, {"time": 1653, "text": "And so after three times of IVF after 23, I was still wanting family."}, {"time": 1662, "text": "And the reason I wanted him is because I felt so guilty for my father that he never seen this world."}, {"time": 1669, "text": "I somehow, when you're so desperate, you become illogical."}, {"time": 1676, "text": "Like I want to believe in the, like Buddhist idea, right?"}, {"time": 1676, "text": "You come back to life."}, {"time": 1682, "text": "And I prayed, please come to me, like as my son, so I will take care of you."}, {"time": 1688, "text": "Like come back."}, {"time": 1688, "text": "And when I was pregnant with my son, even though I planned to get pregnant with a girl, doctor made a mistake."}, {"time": 1694, "text": "It became a boy."}, {"time": 1694, "text": "So I made his middle name, like my father's name Jin Sik."}, {"time": 1701, "text": "I think he's the only American got North Korean name."}, {"time": 1709, "text": "So he's a part of your father's and your son."}, {"time": 1709, "text": "That's how I, that's how I make a sense of it."}, {"time": 1717, "text": "And that's how I move forward."}, {"time": 1717, "text": "Like if I, like as a logical human being, you, you know, when you're dead, you're done."}, {"time": 1724, "text": "Maybe that's what I at least used to think, but then life's become too unbearable."}, {"time": 1728, "text": "And somehow that's the thing, like we tell ourselves stories in order to live."}, {"time": 1734, "text": "And that's how I came with my title of the book in order to live."}, {"time": 1738, "text": "I had to tell myself a lot of stories to overcome a lot of things."}, {"time": 1738, "text": "I think I was a part of it."}, {"time": 1744, "text": "Can you tell the story of you escaping North Korea to China?"}, {"time": 1744, "text": "Yeah, I think it's, it's a thing."}, {"time": 1755, "text": "Even though I was like 13, my like life outside of North Korea is almost like went by like one second and my life till that point was like eternity."}, {"time": 1772, "text": "I remember being in China."}, {"time": 1772, "text": "I arrived there at the end of March at 13."}, {"time": 1772, "text": "And by October, it was six months past."}, {"time": 1780, "text": "And I literally felt like I lived eternity."}, {"time": 1780, "text": "And one day living in China felt like living one year."}, {"time": 1789, "text": "One day was a war like surviving through one day was so hard."}, {"time": 1796, "text": "Every night I was like, I cannot believe I got done one day today."}, {"time": 1796, "text": "That was a thing I was grateful for before I went to bed."}, {"time": 1802, "text": "Okay, I survived."}, {"time": 1802, "text": "I didn't get captured."}, {"time": 1808, "text": "And I made it another day on earth."}, {"time": 1808, "text": "So the experience of the minutes is what fear, fear of being captured, fear, loss, everything."}, {"time": 1816, "text": "Because I mean, I saw my own mom in China to survive to."}, {"time": 1826, "text": "So it was more than that."}, {"time": 1826, "text": "And it's not feeling I think that's a thing in China."}, {"time": 1835, "text": "I learned not to fear."}, {"time": 1835, "text": "And after my escape was a challenging, I didn't feel anything."}, {"time": 1844, "text": "And it was hard."}, {"time": 1844, "text": "Not feeling anything is a torture."}, {"time": 1844, "text": "It's the biggest torture you can ever feel like even you fear sadness."}, {"time": 1850, "text": "That's better than not feeling anything."}, {"time": 1850, "text": "And I felt something when I had my son."}, {"time": 1857, "text": "That's when I started healing."}, {"time": 1857, "text": "So he was a miracle to save me."}, {"time": 1863, "text": "But yeah, in China, it wasn't even fear like it was numb."}, {"time": 1868, "text": "You were numb."}, {"time": 1868, "text": "It was like paralysis."}, {"time": 1868, "text": "Just overwhelming on the uncertainty of your future."}, {"time": 1875, "text": "Did you have a sense what your future held at the time?"}, {"time": 1879, "text": "Like what do you even even feature?"}, {"time": 1879, "text": "I don't even know that word."}, {"time": 1879, "text": "Like, a lot of times I was looking at myself like I left my body and like just looking at me."}, {"time": 1884, "text": "And just not feeling it."}, {"time": 1889, "text": "It's not like I'm scared for her."}, {"time": 1889, "text": "I'm like sad for her just looking at me like, huh, that's interesting."}, {"time": 1894, "text": "Not feeling anything."}, {"time": 1894, "text": "And me like being raped, going through every emotion of life to survive, right?"}, {"time": 1902, "text": "But like, somehow, I don't know if you say so or something like looking at it just like, you feel nothing."}, {"time": 1909, "text": "You don't feel anything for that person."}, {"time": 1915, "text": "So even with your mom, like what was, was there some, I don't know, some warmth that you were able to extract from the connection with your mom?"}, {"time": 1930, "text": "I think that made me survive."}, {"time": 1930, "text": "I had a very strong connection with my family."}, {"time": 1930, "text": "And I think that's what kept me going to do all of that."}, {"time": 1937, "text": "I think, as you said, I escaped at 13."}, {"time": 1943, "text": "My sister at the age of 16 escaped with her friend first."}, {"time": 1943, "text": "And I was going to escape with her."}, {"time": 1951, "text": "But one day I got like really bad stomach ache."}, {"time": 1951, "text": "And my parents took me to hospital."}, {"time": 1957, "text": "And in North Korean hospital, they don't have like X ray machines."}, {"time": 1957, "text": "They don't even have electricity."}, {"time": 1961, "text": "They literally using one needle to inject everybody."}, {"time": 1961, "text": "And people don't die from cancer in North Korea."}, {"time": 1967, "text": "You die from infection and fever and hunger, right?"}, {"time": 1967, "text": "So most likely you're going to die more by being treated by doctor than not being treated."}, {"time": 1973, "text": "I think I was lucky."}, {"time": 1977, "text": "Even though they thought I had appendix, they operated on me without any painkiller."}, {"time": 1982, "text": "And I didn't get infection."}, {"time": 1982, "text": "So that's how I got delayed to escape with my sister."}, {"time": 1989, "text": "And she left me a note in my bedside saying like, follow this lady."}, {"time": 1996, "text": "And this is like another trick about human trafficking, right?"}, {"time": 1996, "text": "She sold me to China as a sexual slave."}, {"time": 2001, "text": "And she executed for it later."}, {"time": 2001, "text": "She was executed for that later."}, {"time": 2001, "text": "She had five daughters and she sold all her children to China."}, {"time": 2009, "text": "And we can now sitting here judging on like how heartless you are selling your own children to China."}, {"time": 2015, "text": "And as a sexual slave, they were like her children were seven, 10 years old."}, {"time": 2021, "text": "But that was the only way for her to save her children."}, {"time": 2026, "text": "And if she didn't sell me that day, I would be dead right now."}, {"time": 2026, "text": "So I'm grateful that she sold me."}, {"time": 2033, "text": "And I think that's the thing is like, life is so crazy."}, {"time": 2039, "text": "You cannot judge."}, {"time": 2039, "text": "It is so complex."}, {"time": 2039, "text": "And yeah, that's how she changed my life by selling me."}, {"time": 2046, "text": "She sold my mom and myself in 2007 to China."}, {"time": 2050, "text": "So you're grateful for that."}, {"time": 2050, "text": "You're grateful for that suffering."}, {"time": 2054, "text": "Of course I am grateful."}, {"time": 2056, "text": "Because the alternative is worse."}, {"time": 2058, "text": "I would not be here with you."}, {"time": 2058, "text": "You would never knew I existed."}, {"time": 2064, "text": "What do you make of the others suffering in the world today?"}, {"time": 2064, "text": "The people there in North Korea."}, {"time": 2069, "text": "So that is part of your life's work is helping those people."}, {"time": 2069, "text": "What do you think about them?"}, {"time": 2079, "text": "What should people know about them?"}, {"time": 2082, "text": "I think that's when I get angry."}, {"time": 2082, "text": "Whenever I think about them."}, {"time": 2086, "text": "Who's your anger directed at?"}, {"time": 2088, "text": "At the heartlessness of people, the ignorance of people."}, {"time": 2088, "text": "So when I got out of North Korea, I went through all of that."}, {"time": 2100, "text": "And I went to South Korea one day."}, {"time": 2100, "text": "I was watching television and there's like famous Korean Kpop stars crying and doing some fundraising concert."}, {"time": 2115, "text": "And I literally thought, oh my God, something is horribly going wrong in this country."}, {"time": 2115, "text": "Why are these people crying?"}, {"time": 2119, "text": "It was a cheery campaign."}, {"time": 2119, "text": "And then later it was showing that it was an animal rights campaign to helping out cats and puppies in the shelters."}, {"time": 2133, "text": "Do you know anybody sheds their tears like that to another human being right now?"}, {"time": 2139, "text": "People rather give millions of dollars to save some dolphins than saving these children right now being raped in China."}, {"time": 2144, "text": "And I think I love Elon Musk."}, {"time": 2144, "text": "I love his voice."}, {"time": 2144, "text": "I love these people want to go to the moon, Mars."}, {"time": 2152, "text": "And then people told him like, yeah, we went to the moon like I did not know in North Korea."}, {"time": 2161, "text": "But I think that's what upsets me."}, {"time": 2161, "text": "Why there is not even one single human with that kind of brilliance in their brain."}, {"time": 2166, "text": "They can save so much suffering, but nobody does anything."}, {"time": 2173, "text": "I think that's when I feel like hard to find hope in humanity."}, {"time": 2173, "text": "And that's when I get so upset."}, {"time": 2180, "text": "Because think about like even Biden or Trump or Obama."}, {"time": 2180, "text": "They know what's happening in North Korea exactly, right?"}, {"time": 2186, "text": "I mean, we see satellite photos."}, {"time": 2186, "text": "There's public executions."}, {"time": 2191, "text": "I mean, the UN says this is a Holocaust happening again."}, {"time": 2191, "text": "And it's happening."}, {"time": 2191, "text": "If the Holocaust is happening again, how, why, how are you okay doing nothing about it?"}, {"time": 2197, "text": "But somehow humans are able to okay nothing, anything."}, {"time": 2203, "text": "And this is like, this is hard."}, {"time": 2203, "text": "Like when people say I'm going to change the world."}, {"time": 2211, "text": "I want to make a difference."}, {"time": 2211, "text": "Like it's hard to believe it, you know?"}, {"time": 2217, "text": "Yeah, that we can turn our back to human suffering at scale when it's right in front of us."}, {"time": 2217, "text": "I mean, that makes you think about the Holocaust."}, {"time": 2222, "text": "This is just, everybody was looking the other way because it was almost too hard to look at it."}, {"time": 2232, "text": "It's an easier thing."}, {"time": 2232, "text": "Like that's the thing."}, {"time": 2232, "text": "I was like here to speak at the South by Southwest a few years ago."}, {"time": 2237, "text": "And like they're, everybody's talking about like Elon Musk project going to the moon, right?"}, {"time": 2241, "text": "We're going to be multi, like species."}, {"time": 2241, "text": "I was like back then I didn't even know who he was."}, {"time": 2246, "text": "So if you guys are trying to go out to this earth, you haven't even explored our earth yet."}, {"time": 2252, "text": "You cannot go to North Korea right now."}, {"time": 2252, "text": "You haven't explored that part of our, our like planet."}, {"time": 2257, "text": "Can we do that first and then move on?"}, {"time": 2263, "text": "Explore the landscape of human suffering, like alleviate suffering in the world."}, {"time": 2263, "text": "There's a lot of suffering happening in Africa that has to do with disease."}, {"time": 2269, "text": "And for some reason it's, even though we turn our back to that kind of suffering too, we still can try to do something about it."}, {"time": 2281, "text": "And there's still efforts in terms of healthcare, in terms of medicine, in terms of bioengineering, in terms of like all these efforts to help people from disease."}, {"time": 2293, "text": "But like, that's almost like converting it into an engineering problem and trying to solve it."}, {"time": 2297, "text": "That somehow is easier for us humans."}, {"time": 2297, "text": "But when there's obvious sort of non disease related torture of humans, we look the other way."}, {"time": 2304, "text": "Whether it's China or it's North Korea."}, {"time": 2314, "text": "I mean, that has to be changed somehow."}, {"time": 2314, "text": "We have to change that somehow."}, {"time": 2320, "text": "It's the thing right now, like the China, like they bring the Xinjiang riggers, right?"}, {"time": 2325, "text": "They say, oh, this is a vitamin, take it."}, {"time": 2325, "text": "And then it kills their sperm and make them not reproduce."}, {"time": 2331, "text": "Their birth rate gone down something 47 to something 50% in the one year time."}, {"time": 2336, "text": "It's a genocide in 21st century."}, {"time": 2336, "text": "And they get those people and get their like organs out."}, {"time": 2342, "text": "Imagine if there's some people who do that with the cutie puppies and cats."}, {"time": 2342, "text": "There's going to be insane amount of product."}, {"time": 2348, "text": "They're going to destroy everything."}, {"time": 2348, "text": "And this is like a human nature that I don't get."}, {"time": 2354, "text": "Why there's so much anti human sentiment in this modern world?"}, {"time": 2360, "text": "We don't have to."}, {"time": 2360, "text": "The fact that I was saying like, the fact that you care about animals rights is beautiful because you care about something who cannot speak for themselves."}, {"time": 2371, "text": "The fact that we care about animals is because they cannot speak for themselves, right?"}, {"time": 2371, "text": "They don't have that ability."}, {"time": 2375, "text": "And there are many people who cannot speak for themselves right now."}, {"time": 2380, "text": "And why do you refuse to be the voice for them?"}, {"time": 2380, "text": "Because they are simply being a human."}, {"time": 2385, "text": "And maybe it connects to us not being proud of who we are."}, {"time": 2385, "text": "Like, I don't know what it is."}, {"time": 2393, "text": "Why do they deny humans this way?"}, {"time": 2393, "text": "Maybe they don't like themselves."}, {"time": 2399, "text": "Yeah, it's almost, we would have to acknowledge some dark things about ourselves in order to start helping."}, {"time": 2405, "text": "What's the solution?"}, {"time": 2405, "text": "So, you know, I see two solutions."}, {"time": 2405, "text": "One is in the military side."}, {"time": 2416, "text": "It's assassination or the full on invasion."}, {"time": 2416, "text": "And then on the activism side, which is figuring out ways to, like you said, sort of let people in North Korea understand their situation, sort of from within try to reform."}, {"time": 2438, "text": "Or maybe there's others, obviously, there could be activism from the outside to build up momentum for the entirety of the world, especially the world that is not just the United States or Europe, but also is Russia and China and so on."}, {"time": 2456, "text": "What are your ideas here?"}, {"time": 2456, "text": "What we can do as individuals and as countries?"}, {"time": 2465, "text": "I think the first thing that we can do is speak about Chinese role in this sponsoring dictatorship in North Korea."}, {"time": 2470, "text": "Like, I happen to have so much struggle talking about North Korea, right?"}, {"time": 2476, "text": "They say, how North Korea is possible?"}, {"time": 2476, "text": "Why is it like the way like this is 99% accountability going to CCP?"}, {"time": 2481, "text": "Kim Jong Un cannot last without Chinese help even one week."}, {"time": 2490, "text": "This is completely funded."}, {"time": 2490, "text": "This Holocaust is funded by CCP."}, {"time": 2490, "text": "But if you talk about in the mainstream, of course, they don't buy it."}, {"time": 2496, "text": "And I think it's in a way North Korea is a lot easier to solve than even in the Middle East."}, {"time": 2502, "text": "There's nothing conflict like between people."}, {"time": 2507, "text": "There's no ideology, no religion, nothing."}, {"time": 2507, "text": "People are peaceful, right?"}, {"time": 2507, "text": "There's not even one civil, like any discontent among the people."}, {"time": 2512, "text": "Our problem is there's a dictator funded by the second economic power in the world."}, {"time": 2519, "text": "And even any military, they know if they kill Kim Jong Un, they're going to get killed by Chinese."}, {"time": 2525, "text": "Nobody can dare to stand up against Kim Jong Un because China is backing it."}, {"time": 2529, "text": "So somehow here in the West, we collectively acknowledging that China is the responsible person for these crimes against humanity in North Korea."}, {"time": 2541, "text": "Then we can somehow, I don't know, talk to them."}, {"time": 2546, "text": "Stand up to China."}, {"time": 2548, "text": "We're failing to do that in a way, in all kinds of avenues of life, of public life, because for many reasons, they're probably primarily financial."}, {"time": 2555, "text": "But it also, I'm against, I don't know, maybe you can correct me."}, {"time": 2566, "text": "I'm against sort of making China this evil enemy because I've seen this with Russia as well."}, {"time": 2574, "text": "And I don't think that leads to progress."}, {"time": 2582, "text": "I think you want to highlight, you basically want to help the Chinese people become the best version of themselves."}, {"time": 2590, "text": "So speak to the Chinese people and not making the leaders of China into these caricatures of devils."}, {"time": 2597, "text": "I feel like the Cold War, the way it was done in Russia, both sides, they were caricaturing each other through propaganda and the result was not productive at all."}, {"time": 2610, "text": "It did not help Russia become the best country it could be."}, {"time": 2614, "text": "It did not help America become the best country it could be."}, {"time": 2614, "text": "And the same thing with China."}, {"time": 2618, "text": "I feel like making them into this enemy, like being afraid of China, making them into the thing that's going to spy on us, that's going to destroy the rest of the world, that's not going to help China reform themselves."}, {"time": 2629, "text": "They're going to plant their feet."}, {"time": 2629, "text": "The dictators, the evil people will become more evil."}, {"time": 2635, "text": "The power hungry will become more, like they will centralize the power more."}, {"time": 2641, "text": "It feels like, maybe naive, but it feels like it should be like, again, love, not violence that solves this thing."}, {"time": 2648, "text": "Now, of course, in North Korea, it's like long gone."}, {"time": 2655, "text": "80 years, almost 80 years."}, {"time": 2655, "text": "Love is not going to solve that problem."}, {"time": 2663, "text": "I mean, I don't, it's very difficult."}, {"time": 2666, "text": "They have tried that because of the sunshine policy, which is there's two people walking down the street and the sun and the wind made a battle."}, {"time": 2672, "text": "So who can take off that man, take off jacket?"}, {"time": 2677, "text": "So wind tried to blow as much air as he could."}, {"time": 2677, "text": "And then that man was like putting more like his jacket on, right?"}, {"time": 2683, "text": "Not taking off, but sunshine came."}, {"time": 2683, "text": "Okay, I'm going to give him a lot of warmth."}, {"time": 2687, "text": "And then he took his jacket out and came out."}, {"time": 2687, "text": "So that was the theory."}, {"time": 2691, "text": "Let's give North Korea as much love as they want."}, {"time": 2691, "text": "Let's give them a lot of money, whatever they want, let's give to them so they know that we are not here to attack them."}, {"time": 2700, "text": "And North Korea, what they did was the guy who did the sunshine policy in South Korea named Kim Dae Sung won the Nobel Peace Prize for that."}, {"time": 2705, "text": "And Kim Jong Il used the money to build nuclear weapons."}, {"time": 2711, "text": "So that's how they came with the nukes."}, {"time": 2711, "text": "So I think that's the thing."}, {"time": 2717, "text": "I hope that love solves problems."}, {"time": 2720, "text": "But there's got to be a way and the hope is with the 21st century is you can directly speak to the people somehow."}, {"time": 2725, "text": "When there's no internet, when there's nothing like that, it's hopeless."}, {"time": 2729, "text": "I think China, there's a hope that China is still connected to the internet."}, {"time": 2734, "text": "I love your optimism."}, {"time": 2734, "text": "I have seen the actual dark side of China on the underground."}, {"time": 2734, "text": "I hope, I think that's the thing."}, {"time": 2743, "text": "People in the West, right?"}, {"time": 2743, "text": "They say, oh, how can it be that bad?"}, {"time": 2748, "text": "They ask me like, I walking passing this young teenager man and later the war with my sister."}, {"time": 2756, "text": "He's like intestine coming out through his back, right?"}, {"time": 2756, "text": "And even in that moment, what he wanted was, please give me food."}, {"time": 2763, "text": "He was hungry."}, {"time": 2766, "text": "His intestine is hanging out of his body and he's asking for food."}, {"time": 2771, "text": "Do you know what humans demand when they die in North Korea?"}, {"time": 2771, "text": "All they want is eating, right?"}, {"time": 2778, "text": "And people say, oh, nothing can be that bad."}, {"time": 2778, "text": "But people just here haven't seen an actual true evil."}, {"time": 2786, "text": "Would you say that the evil comes from a tiny minority of people or is it permeate much larger parts of the population?"}, {"time": 2791, "text": "Like if we look at sex trafficking, how many people, like is it 99.9% of the people are longing to do good in the world?"}, {"time": 2800, "text": "Or is there, is it, or do we all have the capacity for evil in certain kinds of environments, certain kinds of governmental structures inspire a large percent of the population to do bad things?"}, {"time": 2825, "text": "I think humans are capable of anything."}, {"time": 2825, "text": "There's no exception."}, {"time": 2825, "text": "I don't think there's any saint who born with that morality."}, {"time": 2831, "text": "I think in North Korea, you can say initially that there's few guys in the top wanted the power and then doing this, but eventually made a society where people don't even know what compassion is."}, {"time": 2844, "text": "We don't know the concept of, we don't know that you need to feel bad for another human being when they're suffering."}, {"time": 2849, "text": "The fact that you know compassion is in your knowledge."}, {"time": 2853, "text": "That's why you do that."}, {"time": 2853, "text": "Humans need to learn."}, {"time": 2859, "text": "It's not anything bad about human nature."}, {"time": 2859, "text": "It's just saying humans are capable of everything."}, {"time": 2864, "text": "We are the most adaptable species on the planet."}, {"time": 2864, "text": "That's why we created the internet, like talking this way, right?"}, {"time": 2870, "text": "No other animals have done it because we are so adaptable."}, {"time": 2875, "text": "That is a good thing and that's a bad thing."}, {"time": 2875, "text": "So in the adaptive situation, they all can be, I mean during the Holocaust, right?"}, {"time": 2881, "text": "Those people, they could have been capable of good too if they were exposed to different system."}, {"time": 2886, "text": "That's why when people underestimate evil, that's what scares me."}, {"time": 2892, "text": "Evil is evil."}, {"time": 2892, "text": "It's a different thing."}, {"time": 2892, "text": "It's a completely different thing."}, {"time": 2899, "text": "Of course, I get your idea."}, {"time": 2899, "text": "We don't want to isolate 1.3 billion human beings on Earth by Chinese, but the thing is we are talking about this regime, not the people."}, {"time": 2912, "text": "I love Chinese people."}, {"time": 2912, "text": "I speak Chinese."}, {"time": 2912, "text": "I love all about the country, but this system does promote evil."}, {"time": 2917, "text": "Well, that's an optimistic view actually because we can fix systems."}, {"time": 2923, "text": "It's harder to fix people."}, {"time": 2923, "text": "So if we fix systems, then the people are adaptable, as you said."}, {"time": 2928, "text": "I mean that, and then the question is, first of all, you have to talk about it just as you're doing."}, {"time": 2933, "text": "You're right now like this little flame that burns bright, and it's really important for North Korea, but just keep talking about it until hopefully it leads to at the highest levels of power, revolutionizing the systems in the world."}, {"time": 2953, "text": "And then in China and in North Korea, do you see North Korea being a potential instigator in nuclear war?"}, {"time": 2961, "text": "They will not start a nuclear war as long as they can do whatever they want right now, right?"}, {"time": 2968, "text": "North Korea's army is not designed to fight the enemy."}, {"time": 2968, "text": "They're designed to prevent their own people, the coup d'tetre and the revolution with their own citizens."}, {"time": 2980, "text": "That is 1.6 million North Korea with a tiny country, the fourth largest armies in the world."}, {"time": 2986, "text": "So this country is designed to fight with their own citizens."}, {"time": 2986, "text": "And the army, the fourth largest in the world, is designed to basically fight its own people."}, {"time": 2994, "text": "Oppress their own people."}, {"time": 3000, "text": "That's what North Korean military is about."}, {"time": 3000, "text": "Let me ask you some aspects about North Korean life."}, {"time": 3010, "text": "Can you describe the songbun system of ascribed status used in North Korea?"}, {"time": 3016, "text": "So that's a very interesting thing, right?"}, {"time": 3016, "text": "Right now there are a lot of people playing with this ideology of like democratic socialism, socialism, communism, whatever you call it, Marxism, Leninism, right?"}, {"time": 3026, "text": "They have all like these similar features where we give collective power to a certain entity and they will make the decision for bigger good, right?"}, {"time": 3038, "text": "And North Korea came up with the idea, the Kim Il Sung."}, {"time": 3038, "text": "He was the Leninist."}, {"time": 3044, "text": "He was a Marxist saying, I'm going to create the most equal society on human face."}, {"time": 3049, "text": "So it was communist North Korea."}, {"time": 3049, "text": "And then they came up with this songbun system."}, {"time": 3056, "text": "It's like family caste system."}, {"time": 3056, "text": "Three big categories, warrior, wavering, and hostile."}, {"time": 3056, "text": "And that in between three classes, they divide into 50 different classes."}, {"time": 3064, "text": "So a lot of people don't even know which exact class you belong to."}, {"time": 3069, "text": "That's a secret government document."}, {"time": 3069, "text": "And that's how they decide your future."}, {"time": 3074, "text": "So in a way, North Korea, before you're born, your life is determined for you."}, {"time": 3080, "text": "And this is a joke, right?"}, {"time": 3080, "text": "They dreamed of creating the most equal society."}, {"time": 3085, "text": "They ended up with became most unequal society in the face of humanity."}, {"time": 3085, "text": "So there are 50 different classes and where the one guy on the top became a god."}, {"time": 3091, "text": "So when this animal farm, as we keep saying, like there's so many, all the animals are equal and some of the animals are more equal than others."}, {"time": 3102, "text": "But it's not only, it's just more equal."}, {"time": 3106, "text": "One guy in North Korea became a god."}, {"time": 3106, "text": "So North Korea was born out of a Marxist ideals."}, {"time": 3114, "text": "From Stalin."}, {"time": 3114, "text": "Can you comment on Juche ideology, which seems to be its own kind of socialism, but with unique aspects here, it really does ideologically says the importance of having a great leader."}, {"time": 3135, "text": "Is there some interesting similarities or differences that you can comment on between other implementations of communism throughout history, the Soviet Union, China, elsewhere?"}, {"time": 3147, "text": "So Juche is very unique."}, {"time": 3147, "text": "It came on around the 90s after Soviet Union collapsed."}, {"time": 3153, "text": "So before that, North Korea was very still loyal to the Marxism and Leninism, which is state takes care of you."}, {"time": 3159, "text": "We are going to give you the right education, healthcare, your livelihood, everybody is going to be equal."}, {"time": 3165, "text": "You're going to have in the working collective farm, collective worker place."}, {"time": 3169, "text": "Everybody collectively do things together and let's work for the paradise."}, {"time": 3175, "text": "But 1991, the Soviet Union collapsed."}, {"time": 3175, "text": "And until then, North Korea was heavily subsidized by Soviet Union's aid."}, {"time": 3182, "text": "And then Soviet Union didn't give them anything."}, {"time": 3182, "text": "So not 3 million people dying on the streets."}, {"time": 3187, "text": "The regime then came up with the idea, okay, our goal is what is successful ruling for us is keeping the 10% of population alive, which is in the capital Pyongyang."}, {"time": 3199, "text": "So they designed the hunger games."}, {"time": 3199, "text": "There is a capital, 13 other districts, everybody on the countryside on purpose being starved."}, {"time": 3206, "text": "So those people who are starving cannot thinking about meaning of life, cannot thinking about shooting to the moon, right?"}, {"time": 3212, "text": "They're not going to think about anything or they're going to think it's like finding next meal."}, {"time": 3216, "text": "All on purpose."}, {"time": 3220, "text": "All on purpose is manmade famine."}, {"time": 3220, "text": "International community was begging to give North Korea food."}, {"time": 3225, "text": "Still at the UN, they beg to give North Korea formula, medicine and food."}, {"time": 3232, "text": "They are begging, can you please feed your people?"}, {"time": 3232, "text": "And Kim Jong Un said, no, thank you."}, {"time": 3236, "text": "Last year, like when North Korea had a horrible, horrible flooding, South Korean president begging, can you get, can I give you please some medicines?"}, {"time": 3241, "text": "Like, no, because he wants to be the one provider."}, {"time": 3246, "text": "He doesn't want people to think other people giving him the thing."}, {"time": 3250, "text": "So on purpose, other people are starving."}, {"time": 3250, "text": "And that Juche idea is that's when it's coming from."}, {"time": 3255, "text": "So until that communism was about like state is being a father figure, takes care of all your needs, right?"}, {"time": 3260, "text": "Give the power to us and you're all good."}, {"time": 3260, "text": "But North Korea regime says, okay, now we cannot give people's ration."}, {"time": 3265, "text": "So which means Juche means self reliance."}, {"time": 3270, "text": "You need to take care of yourself while you're giving every right to us."}, {"time": 3270, "text": "So now in the 90s, the regime told us, okay, we are not going to give you ration."}, {"time": 3277, "text": "You cannot trade."}, {"time": 3283, "text": "That's illegal, but you find your own way to survive."}, {"time": 3283, "text": "So be self reliant."}, {"time": 3283, "text": "That's what Juche is."}, {"time": 3289, "text": "But when you're a guy, you can do whatever you want."}, {"time": 3289, "text": "You don't need to make a sense."}, {"time": 3294, "text": "That's the difference being a God and being a leader."}, {"time": 3294, "text": "When it is religion, it's not for survival."}, {"time": 3300, "text": "You cannot challenge it."}, {"time": 3300, "text": "God's way is suspicious."}, {"time": 3300, "text": "God works in a mysterious way."}, {"time": 3306, "text": "So when you're a God, people are not going to say, oh, this doesn't make sense, right?"}, {"time": 3311, "text": "You're going to, okay, whatever God says, as a human being, we can never change his thought."}, {"time": 3316, "text": "It's unbelievable what regimes can do."}, {"time": 3320, "text": "There's something about famine that is another level of evil to me."}, {"time": 3320, "text": "What Stalin did in Ukraine in the thirties, fuck them."}, {"time": 3339, "text": "This is what torture is."}, {"time": 3339, "text": "Cannibalism."}, {"time": 3351, "text": "North Korea too, they eat humans right now in 21st century."}, {"time": 3351, "text": "7 billion people on this earth right now."}, {"time": 3358, "text": "You make enough food for 10 billion people."}, {"time": 3358, "text": "Nobody should be starving right now."}, {"time": 3364, "text": "It's worrisome to me."}, {"time": 3364, "text": "The humanity is moving forward with the technological advance, blah, blah, blah."}, {"time": 3370, "text": "We are going so fast in advancement."}, {"time": 3370, "text": "And we are leaving this like 25 million human beings in the cage, completely leaving them behind."}, {"time": 3375, "text": "And North Korea is living like 16 centuries."}, {"time": 3381, "text": "This morning I was taking shower, beautiful shower."}, {"time": 3381, "text": "One never knew what shower was."}, {"time": 3388, "text": "I was bathing a few times a year, going to the river."}, {"time": 3388, "text": "How do they even know what shampoo is?"}, {"time": 3394, "text": "And this is how human beings in 21st century are living."}, {"time": 3394, "text": "And it doesn't bother us."}, {"time": 3400, "text": "And rather, most people are obsessed being a vegan."}, {"time": 3400, "text": "How do you reconcile this?"}, {"time": 3408, "text": "I think we get used to stuff very quickly."}, {"time": 3408, "text": "We get used to comforts."}, {"time": 3408, "text": "That's just the way of human life."}, {"time": 3412, "text": "You take the beautiful things for granted."}, {"time": 3412, "text": "So I try to appreciate everything I have."}, {"time": 3418, "text": "So whether it's like the food I have now or like the luxury to have a diet and be struggling with that."}, {"time": 3425, "text": "Or just the basic simple moments of being alive with the people I love."}, {"time": 3429, "text": "Or actually I get like, I think I'm on drugs all the time because I feel like just even like this mug, everything on this table just brings me joy."}, {"time": 3434, "text": "But it's like filling your life with joy in the full capitalistic American way, you can still at the same time not feel too bad about yourself and still focus on the suffering in the world."}, {"time": 3449, "text": "And I think there's some way that in trying to build a better world in America, it has ripple effects elsewhere."}, {"time": 3466, "text": "Sort of like, so I'm a fan of rockets in space."}, {"time": 3466, "text": "It sounds perhaps counterintuitive but sending rockets to space will help solve the North Korea problem because it lets people dream and build cool stuff."}, {"time": 3484, "text": "So it's not the rocket, it's the other people that are inspired by the rocket and then look to other problems in the world."}, {"time": 3492, "text": "I mean, that's what Elon did is like he saw problems in the world and thought like, what can I do to help it?"}, {"time": 3497, "text": "And I think the North Korea one is a tough one though, because that ultimately has to do with revolutionizing government."}, {"time": 3510, "text": "We got to change China."}, {"time": 3510, "text": "That's what it takes."}, {"time": 3510, "text": "Changing China's Communist Party is impossible."}, {"time": 3517, "text": "That's why we couldn't solve North Korea for that many decades."}, {"time": 3517, "text": "For now it's China, but it's China, it's Russia, it's certain aspects of the United States and struggling with that."}, {"time": 3532, "text": "There's a bunch of technologies that are striving at this."}, {"time": 3539, "text": "For example, I don't know what your thoughts about cryptocurrencies."}, {"time": 3539, "text": "So like there's a idea that money could be a way to destroy or to challenge the power centers of the world."}, {"time": 3552, "text": "So if you take away the power from fiat currency and give it to this thing that can't be controlled by government, this cryptocurrency, whether it's Bitcoin, Ethereum, all those kinds of things, that's a way to get money into the hands of people to where the government can't take that money away."}, {"time": 3566, "text": "But North Koreans don't have electricity, no internet."}, {"time": 3572, "text": "So we can do that with China."}, {"time": 3572, "text": "We can do it with a lot of African dictatorship countries, right?"}, {"time": 3578, "text": "I do think big cryptocurrency is such a fascinating technology, right?"}, {"time": 3578, "text": "I think this is an amazing experiment when that power is in our hands."}, {"time": 3584, "text": "I'm a huge out of game believer, but I think North Korea is too behind."}, {"time": 3590, "text": "I think that's what is unique about North Korea is that most of the things that we talk about, it's a different planet literally."}, {"time": 3601, "text": "The common law that we have is not applicable."}, {"time": 3601, "text": "What about Kim Jong Un?"}, {"time": 3610, "text": "Kim Jong Un, yeah."}, {"time": 3610, "text": "Is he intentionally evil or is he mindlessly propagating an evil system created by his ancestors?"}, {"time": 3618, "text": "What's your sense of the man?"}, {"time": 3622, "text": "So with Kim Il Sung, I can give him more benefit of that."}, {"time": 3622, "text": "He was a initial true believer of communism."}, {"time": 3629, "text": "But then as later he gained the power, he realizing, I guess back then he thought most of people are dumb, right?"}, {"time": 3636, "text": "Individuals dumb."}, {"time": 3636, "text": "So therefore I need to make a decision for all of you."}, {"time": 3641, "text": "That pure arrogance came from out of him."}, {"time": 3641, "text": "Even that I can tolerate."}, {"time": 3647, "text": "And Kim Jong Il, who never like, yeah, fine."}, {"time": 3647, "text": "He grew up in that system too."}, {"time": 3647, "text": "But Kim Jong Un is very unique."}, {"time": 3653, "text": "This guy was educated in Switzerland in the heart of democracy."}, {"time": 3662, "text": "He knew how human beings should be treated."}, {"time": 3662, "text": "As a child, he went, when you're a child, your brain is very susceptible, right?"}, {"time": 3669, "text": "It will change anybody."}, {"time": 3669, "text": "Like why the mall was off, that's like changing young people's minds."}, {"time": 3674, "text": "Like that's every revolutionary they do, right?"}, {"time": 3679, "text": "They go change young people's minds first."}, {"time": 3679, "text": "This guy was so obsessed with power, him being a God."}, {"time": 3685, "text": "Even starting in Switzerland didn't change him."}, {"time": 3685, "text": "And that's why I think that's a pure evil."}, {"time": 3691, "text": "I can give him more benefit of that to his grandfather and father."}, {"time": 3691, "text": "But when it comes to Kim Jong Un, this is like what pure evil looks like."}, {"time": 3697, "text": "Pure selfish being."}, {"time": 3706, "text": "Is there some sense where he's justifying everything he's doing to himself?"}, {"time": 3706, "text": "Or do you think there's a psychopathic aspect to where he enjoys the suffering?"}, {"time": 3716, "text": "I think in his life, right, I read a lot about like North Korea, a lot of CIA documents, a lot of intelligence people worked there."}, {"time": 3722, "text": "And even like worked in North Korean type elites and escaped."}, {"time": 3727, "text": "I could hear about them."}, {"time": 3727, "text": "So Kim Jong Un, when they are born, they treat like gods."}, {"time": 3733, "text": "So they never have a sense of them being a human."}, {"time": 3733, "text": "They're like equal with the others."}, {"time": 3740, "text": "For them, like we are just any kind of tool."}, {"time": 3740, "text": "Like that what Napoleon like thing does, right?"}, {"time": 3746, "text": "Anybody is a tool."}, {"time": 3746, "text": "Like once boxer dies, get him slaughtered for my cause."}, {"time": 3752, "text": "And they do not even feel guilty about it because they don't view us that you deserve your worthy of it."}, {"time": 3756, "text": "So it's not like he even feels, he doesn't even recognize that's a suffering."}, {"time": 3761, "text": "Like of course this is what you do serving me."}, {"time": 3761, "text": "Because I am, I am this."}, {"time": 3768, "text": "So I think that's like beyond that."}, {"time": 3768, "text": "It's not like suffering enters his mind."}, {"time": 3774, "text": "He doesn't even think what we go through."}, {"time": 3774, "text": "So he thinks of himself as a god."}, {"time": 3774, "text": "And then everybody else is just tools that they're disposable."}, {"time": 3780, "text": "There was rumors several times of him dying."}, {"time": 3786, "text": "Do you think he is, obviously his health is not good."}, {"time": 3786, "text": "Do you think he will die soon?"}, {"time": 3794, "text": "What happens if Kim Jong Un dies?"}, {"time": 3794, "text": "Well, when it comes to North Korea, anybody knows what they're going, what Kim Jong Un does is lie, right?"}, {"time": 3806, "text": "I'm sure CIA knows, but they may never reveal that."}, {"time": 3806, "text": "CIA has enough intelligence to can tell where Kim Jong Un is, what he's doing."}, {"time": 3812, "text": "They just don't assassinate him because they don't see the means of it right now."}, {"time": 3817, "text": "Do you think they can assassinate him?"}, {"time": 3817, "text": "They can."}, {"time": 3817, "text": "They do have ability to get assassinated."}, {"time": 3822, "text": "Why the hell did they not assassinate him?"}, {"time": 3822, "text": "Because they don't care."}, {"time": 3825, "text": "They don't care about the suffering of 25 million people."}, {"time": 3825, "text": "They got to pay the price."}, {"time": 3830, "text": "If they assassinate Kim Jong Un, they got to pay the price afterwards."}, {"time": 3834, "text": "There'll be financial, there'll be political price to pay."}, {"time": 3834, "text": "It'll anger China."}, {"time": 3840, "text": "That is a huge piece for them."}, {"time": 3840, "text": "And then they'll have to deal, obviously there'll be financial and military consequences of having to deal with the turmoil, the uncertainty, the revolutions that will spring up."}, {"time": 3850, "text": "That's why they don't want to take that risk."}, {"time": 3855, "text": "They don't want to do anything."}, {"time": 3855, "text": "The US now became very passive when they pursue these moral values to the rest of the world."}, {"time": 3860, "text": "They did the same thing with the Holocaust in the early days, actually."}, {"time": 3864, "text": "And that's what their policy has been."}, {"time": 3870, "text": "So if Kim Jong Un dies, it's going to be very hard for North Korea to replace anybody in his position because Kim's is a brand."}, {"time": 3877, "text": "It's not just a leader for us, right?"}, {"time": 3883, "text": "Whenever we think of Kim, who came with my mind, who's almost a God figure."}, {"time": 3883, "text": "North Korea is the number 10 religion in the world."}, {"time": 3889, "text": "They copied the Bible."}, {"time": 3889, "text": "So if you believe that, if there are people who believe in God and Jesus Christ, how do you not believe that North Koreans believe in the same thing?"}, {"time": 3901, "text": "So Kim Il Sung's grandfather and his parents were devout Christians."}, {"time": 3906, "text": "So Kim Il Sung grew up this Christian like verses."}, {"time": 3906, "text": "So when he finding his country, he said, I love my people so much that I'm giving you my son Kim Jong Il."}, {"time": 3920, "text": "His body dies, but his spirit is with us forever."}, {"time": 3920, "text": "Who can know how many here I have, what I think."}, {"time": 3926, "text": "And when we suffer, we go to paradise with him."}, {"time": 3926, "text": "And when you block every single information going to country, of course, people are going to believe it."}, {"time": 3931, "text": "So who would be the successor if he dies?"}, {"time": 3936, "text": "He has a son, first son born 2009 and not not old enough if he dies now."}, {"time": 3945, "text": "So either his sister might rule for a short amount of time as not like a leader, but like we like temporary placement."}, {"time": 3951, "text": "And then when the son is older enough, he might take it off because it's a kingdom."}, {"time": 3958, "text": "That's most likely and China will do everything they can to maintain that status quo for the North Korean regime."}, {"time": 3962, "text": "So North Korean people have no option here."}, {"time": 3970, "text": "We just need some leader to courageously come up and do the right thing."}, {"time": 3977, "text": "So we can't just wait this out."}, {"time": 3977, "text": "It's not something that takes its course and then change."}, {"time": 3982, "text": "Like we not even know that economic freedom does not bring political freedom."}, {"time": 3987, "text": "We know in China, it doesn't."}, {"time": 3987, "text": "That's the unique thing about freedom."}, {"time": 3987, "text": "You got to fight for it."}, {"time": 3993, "text": "Otherwise, you don't ever get it."}, {"time": 3993, "text": "Freedom is something that has to be fought."}, {"time": 3998, "text": "And if nobody fighting for freedom, it's not going to be there."}, {"time": 4003, "text": "Can we talk a little bit about freedom?"}, {"time": 4003, "text": "Having had, we talked about love in that same way about freedom, having sort of discovered it later in life."}, {"time": 4019, "text": "I think every day I get a new definition of freedom."}, {"time": 4019, "text": "It is a never ending journey, having this relationship with being free and what it means to be free, right?"}, {"time": 4027, "text": "I think you definitely can live life without being free and also happy life too."}, {"time": 4037, "text": "I saw a lot of North Korean elites who are fat and have power, but didn't have freedom, were very happy."}, {"time": 4042, "text": "In a way, happier than the people that I found in New York were like investment bankers and consultants in Manhattan and 70% of them go like talk therapist."}, {"time": 4053, "text": "I was very confused."}, {"time": 4053, "text": "I remember writing my book in New York."}, {"time": 4061, "text": "My editor was saying, Yami, you know you're traumatized."}, {"time": 4061, "text": "You need to go talk to a therapist."}, {"time": 4067, "text": "I was like, what is therapy?"}, {"time": 4067, "text": "What is trauma?"}, {"time": 4067, "text": "Because in North Korea, they don't have word for stress or trauma because how can you be stressed in a socialist paradise?"}, {"time": 4079, "text": "They don't let you be knowing what that is."}, {"time": 4079, "text": "Then they were like, yeah, hearing people having problems, go talk to therapist."}, {"time": 4085, "text": "I was like, how much is it?"}, {"time": 4085, "text": "$200 per hour and it's a discounted rate too."}, {"time": 4092, "text": "I was like, no, thank you."}, {"time": 4092, "text": "We know that freedom comes with responsibility and in a way, it's not that easy to be free, thinking for yourself constantly."}, {"time": 4103, "text": "In a way, I understand."}, {"time": 4112, "text": "Let's give government every power we have."}, {"time": 4112, "text": "Let them decide what education that I get."}, {"time": 4117, "text": "Let them decide where I live."}, {"time": 4117, "text": "Let someone figure that out for me."}, {"time": 4117, "text": "That's how North Korea began, hoping the government is going to represent my own interests, believing that they were good."}, {"time": 4128, "text": "With that benefit of doubt and good faith, it began the nightmare."}, {"time": 4136, "text": "Freedom is not like a gateway to be happy at all."}, {"time": 4136, "text": "In a way, it can make life a lot more complex, but then it's fun, isn't it?"}, {"time": 4141, "text": "You start thinking for yourself."}, {"time": 4141, "text": "You start making mistakes."}, {"time": 4147, "text": "It's so fun to be free, even though you can be suffering way more than the people who are not free."}, {"time": 4154, "text": "The thing about freedom is when you have freedom, you also have the responsibility for your actions."}, {"time": 4159, "text": "That could be a huge burden because if you succeed, it's you, but if you fail, it's you."}, {"time": 4168, "text": "If you do horrible things, it's you."}, {"time": 4168, "text": "If you don't do something, for example, if you don't help people in North Korea, it's you."}, {"time": 4174, "text": "That's a huge burden."}, {"time": 4174, "text": "Living with that burden is a kind of suffering."}, {"time": 4181, "text": "There's some aspect in which freedom is suffering."}, {"time": 4186, "text": "It is suffering."}, {"time": 4187, "text": "Because life is suffering, and then freedom is you as an individual fully living through that."}, {"time": 4194, "text": "See, you talked, you're friends with Michael Malice."}, {"time": 4194, "text": "He believes, and so I want to kind of ask you about government."}, {"time": 4201, "text": "He believes, he's an anarchist, and he believes kind of in freedom fully implemented in human societies, meaning that humans should all be free to choose how they, you know, transact with each other, how they live together."}, {"time": 4219, "text": "There shouldn't be a centralized force that tells you what to do."}, {"time": 4225, "text": "Do you think there's some role for government in a healthy society?"}, {"time": 4236, "text": "If we look at North Korea, there's the most horrible implementation of government, but then if we look at what the United States strives to be, at least in principle, there's an ideal of a government that represents the people and helps the people."}, {"time": 4249, "text": "Is there a place for that kind of ideal, or is government always going to get us into trouble?"}, {"time": 4259, "text": "I am not, I mean, I spoke to Michael Malice."}, {"time": 4259, "text": "I kept asking why he's an anarchist, right?"}, {"time": 4265, "text": "And he doesn't even believe in military, none of that thing."}, {"time": 4265, "text": "And I was like, I don't think I want to be in that world you're describing."}, {"time": 4271, "text": "That's pretty scary."}, {"time": 4271, "text": "I want the law enforcement."}, {"time": 4277, "text": "I want like, I don't, in a way that, so why equality makes no sense is that the fact that when you and I were born, we were born in a very different capability of thinking, different intelligence, different capability in our physics, right?"}, {"time": 4291, "text": "So equality is nonsense."}, {"time": 4291, "text": "You can never achieve that, right?"}, {"time": 4296, "text": "So to me, that's been, it's very scary in America."}, {"time": 4303, "text": "When the government tries to enforce."}, {"time": 4305, "text": "To make equality on everybody, that is impossible."}, {"time": 4308, "text": "Specifically equality of outcome."}, {"time": 4308, "text": "So like, so given that we all started different places, enforce, like measure in some kind of way where people stand, and if they're an equal, enforce equality."}, {"time": 4318, "text": "And that's what leads to the kind of things that you mentioned with the class system in North Korea."}, {"time": 4326, "text": "So I think that's why government can be bad."}, {"time": 4326, "text": "They can be very dumb."}, {"time": 4326, "text": "And another thing is that they cannot know what you want."}, {"time": 4332, "text": "A lot of times people don't even know what they want as an individual."}, {"time": 4337, "text": "Like how the heck do you assume government is going to know what is best for you?"}, {"time": 4342, "text": "We just all do our best."}, {"time": 4342, "text": "I do think though some governments like in Switzerland, you know, have more power, give power to the different state can be good."}, {"time": 4354, "text": "I think I'm more, you know, like giving power to the state and let individual decide where they want to go in within states."}, {"time": 4359, "text": "Like, I mean, why did you choose Texas, right?"}, {"time": 4359, "text": "There's no income tax, right?"}, {"time": 4365, "text": "Like there's a lot of things people find Texas, like, you know, charming and they come here."}, {"time": 4370, "text": "So in a way that I don't want to be in a one strong government that makes every single thing the same way."}, {"time": 4376, "text": "In a way, I want to kind of experiment to everything."}, {"time": 4381, "text": "We can have anarchy state."}, {"time": 4381, "text": "There's no police, nothing going on."}, {"time": 4381, "text": "You can be whatever you want."}, {"time": 4388, "text": "And you can go to a state where it's like abortion is bad, blah, blah, this is bad."}, {"time": 4393, "text": "All this like conservative values."}, {"time": 4393, "text": "And let the ideas compete and let them how they're being practiced in real life."}, {"time": 4399, "text": "But I think it's very scary when the US government is getting bigger and bigger and then they try to make every state under one big government."}, {"time": 4412, "text": "And that's like when I get really alarmed."}, {"time": 4415, "text": "Are there things that you see in the United States in the current culture that's kind of has echoes of the same things you saw in North Korea that worry you?"}, {"time": 4427, "text": "It's in America now the meritocracy doesn't matter, right?"}, {"time": 4427, "text": "It's evil."}, {"time": 4427, "text": "The white man's idea of talking about if you're competent enough, they say, oh, if you're coming from rich white family, you are going to be competent."}, {"time": 4442, "text": "So other people don't have a chance."}, {"time": 4442, "text": "But look at Asians who came from nothing as competent and go to Harvard Law School and medical school."}, {"time": 4453, "text": "So it doesn't almost is like there's no incentive for you to work hard anymore in the system right now."}, {"time": 4459, "text": "That is North Korea."}, {"time": 4459, "text": "There's no incentive because you are born with your class already."}, {"time": 4464, "text": "So no matter what you do, you can never."}, {"time": 4464, "text": "So the horrible thing about North Korean system is that there's nothing holding Mary up."}, {"time": 4469, "text": "So if you're coming from other cultures that like Meghan Markle joined the royal family and she became a lawyer, you go up by North Korea."}, {"time": 4480, "text": "If someone from high class going to marry somebody down, you only go down with them."}, {"time": 4485, "text": "That's how they prevent class mix."}, {"time": 4488, "text": "That kind of enforces the separation because there's a huge disincentives to go to marry to integrate between classes."}, {"time": 4494, "text": "What do you do about this kind of, you know, especially universities, but in companies, I'm thinking about starting a company."}, {"time": 4503, "text": "So I'm looking at this very carefully."}, {"time": 4508, "text": "There's these ideas of diversity and meritocracy."}, {"time": 4508, "text": "That's a tension."}, {"time": 4515, "text": "So I think there's a big way in which diversity broadly defined is not at all in a tension with meritocracy."}, {"time": 4525, "text": "So having a variety of people, backgrounds, way of thinking, all those kinds of things is a huge benefit to any group."}, {"time": 4533, "text": "But the way diversity is often defined is by sort of very crude classes of people, whether it's by skin color or gender or some very kind of large group way."}, {"time": 4548, "text": "And that actually does two things in my mind."}, {"time": 4548, "text": "One, it drowns out real diversity or not real, but the full spectrum of diversity, which is like within class diversity of like, are you somebody who is exceptionally good at mathematics?"}, {"time": 4573, "text": "Are you somebody who's exceptionally good at psychology?"}, {"time": 4573, "text": "Are you good with people?"}, {"time": 4573, "text": "Are you good with numbers?"}, {"time": 4577, "text": "All that kind of stuff that I think spans or intersects in fascinating ways with these kinds of groups."}, {"time": 4583, "text": "So that's diversity."}, {"time": 4583, "text": "And then meritocracy is this thing that probably the reason I wanted to move to Silicon Valley and the reason I didn't is like having a fire to change the world within you."}, {"time": 4594, "text": "Like meritocracy is like, I want to be the best in the world at this and I will strive and work hard, not stepping on others, but like purely within yourself, be the best version of yourself."}, {"time": 4605, "text": "That idea is in some ways being not celebrated or demonized."}, {"time": 4614, "text": "It's literally meritocracy is being demonized right now in America."}, {"time": 4623, "text": "Working hard is a symbol of you coming from some established family."}, {"time": 4630, "text": "The fact that you celebrate accomplishment, hard work is a sign of your patriarchal, whatever thing they call it."}, {"time": 4637, "text": "And they want to abolish that."}, {"time": 4637, "text": "They want to like stop giving kids grades."}, {"time": 4643, "text": "That's what they're already doing, right?"}, {"time": 4643, "text": "They want to stop."}, {"time": 4643, "text": "They want to like we should abolish like SAT in America they take to go to college, right?"}, {"time": 4648, "text": "They won't even abolish that."}, {"time": 4653, "text": "Yeah, some kids have no ability to do math."}, {"time": 4653, "text": "So why do we have to force them to learn math?"}, {"time": 4659, "text": "And that's what comes with humans overcome challenges."}, {"time": 4659, "text": "That's what makes us special."}, {"time": 4664, "text": "But then like, because it's kids coming from this family, let's find a reason why they cannot, and then they don't have to do that thing."}, {"time": 4669, "text": "But they still deserve the same job."}, {"time": 4673, "text": "They need to be a lawyer and doctors."}, {"time": 4673, "text": "And that's like what in North Korea was like not, there was not even meritocracy beginning with, right?"}, {"time": 4679, "text": "Did you born in the same family, the family, the blood, right?"}, {"time": 4685, "text": "Like if one person does something wrong, it's like collective guilt."}, {"time": 4691, "text": "Because I spoke out, three generations of my family got punished, who I left behind."}, {"time": 4697, "text": "And then in America, I see the same thing."}, {"time": 4697, "text": "Like if you're somehow great, great grandfather on the slave, now you are privileged and you're guilty because you are white and guilt."}, {"time": 4703, "text": "But how do you change your ancestor?"}, {"time": 4710, "text": "How did you have a saying on it?"}, {"time": 4710, "text": "And that is where there's no way out."}, {"time": 4716, "text": "There's no forgiving, there's no moving forwards."}, {"time": 4716, "text": "And this current culture in America now, like I remember at Columbia, like before class, everybody had to go around saying, tell us what your pronoun is."}, {"time": 4727, "text": "And my English, my third language, I learned as an adult."}, {"time": 4733, "text": "Even saying he and she, I'm confused."}, {"time": 4733, "text": "It's a pure mistake."}, {"time": 4733, "text": "And they say, call me they, because I'm gender fluid."}, {"time": 4740, "text": "Basically, I can be a girl, but next hour you talk to me, I'm a boy, right?"}, {"time": 4744, "text": "And if you don't do it right, they like look at you, why are you doing it?"}, {"time": 4750, "text": "It makes me so nervous."}, {"time": 4750, "text": "And this is where I come to, this is a regression of civilization."}, {"time": 4756, "text": "We are regressing as a humanity here."}, {"time": 4756, "text": "Like the enlightenment, all of those things made us so much brighter and looking forward."}, {"time": 4763, "text": "And now we are going backwards."}, {"time": 4768, "text": "Well, I think there's a pendulum aspect to it because it's my hope in terms of backwards."}, {"time": 4773, "text": "So pendulum goes backwards too, but it just goes back and forth, I think."}, {"time": 4773, "text": "And then in the long arc of history, we're making progress."}, {"time": 4778, "text": "I think all of the discussions of diversity and inclusion and all those kinds of things, I always thought that they're healthy in moderation."}, {"time": 4791, "text": "They should be a small part of the conversation amongst other things."}, {"time": 4791, "text": "The natural aspect, it seems that they kind of have this way of just consuming all conversations."}, {"time": 4797, "text": "It's like the meetings, like diversity and inclusion meetings multiply somehow, where it's like the only thing that you're talking about."}, {"time": 4808, "text": "And it's very kind of absurd."}, {"time": 4808, "text": "And when I look at, even at MIT, it's a strangely disproportionate amount of discussions about that."}, {"time": 4812, "text": "And also to me as an engineer, those discussions are very frustrating because they don't seem to actually do anything."}, {"time": 4825, "text": "So they want to bully people instead of creating systems that fix definitive problems."}, {"time": 4836, "text": "And that in itself, that kind of bullying, that's the same kind of thing you saw in terms of McCarthyism in America against the communists."}, {"time": 4842, "text": "You certainly saw that in Soviet Union against everybody who's not communist."}, {"time": 4847, "text": "It creates hate, not progress."}, {"time": 4855, "text": "When you talked to Jordan Peterson recently, and people should listen to that conversation, it was a fascinating one."}, {"time": 4859, "text": "I think he almost got emotional on the discussion about universities and your experience with Columbia because he, like myself, for perhaps different reasons, have a hope for our academic institutions."}, {"time": 4876, "text": "Some of the most incredible people, some of the most incredible engineering and idea development, innovation happens in universities."}, {"time": 4881, "text": "And so we both deeply care about them."}, {"time": 4887, "text": "Is there something, so the reason he got emotional, the reason he was kind of hurt is the fact that you did not, you were not deeply inspired by your experience at Columbia."}, {"time": 4906, "text": "It made me dumber."}, {"time": 4906, "text": "It made me scared."}, {"time": 4906, "text": "It made me terrified that I had to censor myself in America."}, {"time": 4914, "text": "Are you seriously telling me that you don't ever censor yourself?"}, {"time": 4914, "text": "Can you truly say whatever you want about race, about anything, gender?"}, {"time": 4921, "text": "We all censor ourselves."}, {"time": 4921, "text": "Let's be honest, right?"}, {"time": 4929, "text": "We are all doing that."}, {"time": 4929, "text": "And that's what I learned."}, {"time": 4929, "text": "I thought I was coming to a country where never needed, like first thing my mom taught me growing up in North Korea was, don't even whisper because the birds and mice could hear you."}, {"time": 4940, "text": "And I thought, okay, now America is truly the land of the free, home of the brave."}, {"time": 4947, "text": "You can say anything you want, and then you have freedom to change your mind and evolve."}, {"time": 4952, "text": "But the people now demand you to be the perfect version they demand you to be."}, {"time": 4958, "text": "You cannot change your mind."}, {"time": 4958, "text": "And then what is the meaning of life if you cannot grow?"}, {"time": 4963, "text": "You should feel safe to talk about anything, and then later, okay, I was wrong."}, {"time": 4969, "text": "But now if you do that, you got to get penalized for it."}, {"time": 4974, "text": "I mean, censorship is a funny thing because you probably should not say dumb things."}, {"time": 4974, "text": "You should try to say things you want to say in the most eloquent, the most effective way you can."}, {"time": 4984, "text": "So, I mean, that's what editing is, right?"}, {"time": 4984, "text": "So there's some level of like being careful with what you say, not because you're afraid of some overarching kind of group of bullies, but you want to be the best version of yourself when you express stuff."}, {"time": 4997, "text": "But there's some sense where in the university setting, you can put that self censorship like level down more and say stupid stuff and explain and play because you should be forgiven for that kind of play, especially when you're discussing difficult aspects of human history, whether that include racism, that include atrocities."}, {"time": 5019, "text": "I'm still nevertheless sort of hopeful, but at the same time, I'm surrounded by engineers."}, {"time": 5026, "text": "So I don't get to interact with people in humanities much."}, {"time": 5033, "text": "And it seems like there's getting worse."}, {"time": 5037, "text": "It's a good thing."}, {"time": 5039, "text": "Well, I do sort of interact with psychologists, but they haven't touched on those kinds of topics yet."}, {"time": 5047, "text": "I still, sort of in defense of psychology, I still, I wish I had more numbers."}, {"time": 5056, "text": "But I still feel like most psychology people don't partake in this kind of stuff either."}, {"time": 5062, "text": "They're just doing excellent research."}, {"time": 5062, "text": "We're just highlighting, this is what America does well."}, {"time": 5066, "text": "You're kind of highlighting anecdotal experiences and making a big deal out of them."}, {"time": 5075, "text": "But that's good because like it's a slippery slope."}, {"time": 5075, "text": "If those things start to overtake all of academia, it starts becoming a big problem, even in the engineering field."}, {"time": 5080, "text": "So we should be concerned."}, {"time": 5084, "text": "But it is truly tragic that somebody who's exceptionally well read like you, whose fire was stoked first with Orwell, that fire should burn bright."}, {"time": 5089, "text": "Like this should not be, you should be writing many books."}, {"time": 5096, "text": "Like, and you'll be, you talk to Jordan, you know, it's very possible depending what you want to do with your life that you'll be a future Jordan Peterson, right?"}, {"time": 5108, "text": "So like that, and Columbia should be a place that enriches your mind."}, {"time": 5114, "text": "And the fact that it didn't is tragic."}, {"time": 5121, "text": "I mean, I did the same."}, {"time": 5121, "text": "It's like I was there four years."}, {"time": 5121, "text": "It wasn't like I had a one class that was bad in a one semester."}, {"time": 5126, "text": "That was the thing."}, {"time": 5126, "text": "When Dr. Piro was asking, is there any one class that had no sentiment of this virtue, signoring, politically right?"}, {"time": 5131, "text": "There was none."}, {"time": 5138, "text": "Entire course, I think I took 126 credits total."}, {"time": 5138, "text": "Not even one class."}, {"time": 5138, "text": "Doesn't matter we were talking about classic art."}, {"time": 5148, "text": "And that's the thing."}, {"time": 5148, "text": "I literally thought, okay, I pushed the last semester to call like the art and music, right?"}, {"time": 5152, "text": "So I thought this is going to be the least politically correct class I can take."}, {"time": 5157, "text": "And then it begins with who has problem with calling this course the Western civilization of art and music."}, {"time": 5162, "text": "And everyone's like raising their hands."}, {"time": 5168, "text": "Because like, why do we have to learning about this Beethoven, Mozart, the bigots, and all the people, like, you know, everything ruined by white men."}, {"time": 5178, "text": "And it's even music, even these paintings."}, {"time": 5178, "text": "And as I didn't raise my hand, everyone was looking at me."}, {"time": 5186, "text": "How do you not have the problem with this?"}, {"time": 5186, "text": "Like you should hate this, you're Asian."}, {"time": 5190, "text": "So I think that's the thing is I think the problems are way deeper than what people think."}, {"time": 5196, "text": "And that's what when I learned is like, it's not that safe in America, we can go complete to the south."}, {"time": 5203, "text": "And looking at even Europe, that is like, I used to be way more optimistic."}, {"time": 5210, "text": "But now I actually see, wow, this country can go to south."}, {"time": 5217, "text": "And we might, if US forced them, right, this is the only country left to battle with the Communist Party in China."}, {"time": 5223, "text": "We may lose the opportunity to be free ever again as a humanity."}, {"time": 5230, "text": "So I mean, that puts a lot of value on having these kinds of conversations."}, {"time": 5230, "text": "It is, I mean, I'm troubled."}, {"time": 5235, "text": "I'm troubled by a lot of things."}, {"time": 5235, "text": "But like censorship on YouTube, for example."}, {"time": 5240, "text": "Yeah, it was very annoying to have to listen to Donald Trump all the time."}, {"time": 5246, "text": "Just like create drama, like news cycle was completely drowned out by Donald Trump."}, {"time": 5246, "text": "But like banning him from Twitter, it was like, that was scary for me, because it's like, that's a step towards a direction where you're going to, like, where does that take us?"}, {"time": 5262, "text": "You're going to silence people, then it's like Jordan Peterson is next."}, {"time": 5273, "text": "That's why we need to promote freedom of thinking and speech, right?"}, {"time": 5273, "text": "And the one thing that I love about Dr. Peterson is, he's a psychologist, right?"}, {"time": 5278, "text": "He talks about we think by talking."}, {"time": 5288, "text": "That's why when you go to therapy, you talk and then you hear yourself and then you think and you come up to the answer."}, {"time": 5292, "text": "It's so important for humans to talk so we can think."}, {"time": 5292, "text": "So when they say you cannot talk means you cannot think."}, {"time": 5299, "text": "And they don't know the consequences of that."}, {"time": 5304, "text": "And this is why I promote, I want the freedom of speech, even though it hurts, ridiculous, you know, sometimes it can be dangerous."}, {"time": 5311, "text": "But the price, the alternative is so bad that we should take the, you know, make this trade off."}, {"time": 5317, "text": "Everything has a trade off in this world."}, {"time": 5322, "text": "And it comes with a sacrifice, right?"}, {"time": 5322, "text": "So I think that's what I want to say."}, {"time": 5328, "text": "That's what I want to see in America."}, {"time": 5328, "text": "But it's unfortunately like the people like you say, who decides what is hate speech?"}, {"time": 5333, "text": "What is dangerous?"}, {"time": 5333, "text": "That's what I've been getting scared."}, {"time": 5339, "text": "Because everybody's imperfect."}, {"time": 5339, "text": "How do we want to give that power to them?"}, {"time": 5339, "text": "And they're going to decide, today they might agree with me, say, okay, your speech is good, promotes good, and then they might come back next year and say your speech is bad."}, {"time": 5349, "text": "What are you going to do when that happens to you?"}, {"time": 5354, "text": "We have to almost like get ideas out and then play with them."}, {"time": 5359, "text": "I think what's a really important component of that is forgiving each other for like realizing that we're a different person day by day and certainly years later."}, {"time": 5371, "text": "And I think some of that is both cultural mechanisms of saying like we forgive each other for wrong ideas or not wrong ideas, but for who we are, the full evolution of the human being, for the steps we've taken on that evolution, and also creating mechanisms that allow you to allow us to forgive each other."}, {"time": 5388, "text": "Like, for example, on Twitter is like horrible with this because one of the main viral ways that people create drama on Twitter is like pulling up an old tweet that somebody said, right?"}, {"time": 5402, "text": "And then saying, oh, this is the guy that thinks that."}, {"time": 5408, "text": "But that's like the opposite of the mechanisms we need to forgive ourselves, forgive each other for the things we've said in the past."}, {"time": 5414, "text": "And so part of that is the cultural, part of this is the technological mechanisms."}, {"time": 5420, "text": "You mentioned Jordan Peterson."}, {"time": 5428, "text": "You had a great conversation with him."}, {"time": 5428, "text": "What was chatting with him like?"}, {"time": 5434, "text": "I'm just curious because he's deeply passionate, especially on the Soviet Union side about the atrocities of these kinds of systems."}, {"time": 5440, "text": "What was it like?"}, {"time": 5440, "text": "What did you agree with him on?"}, {"time": 5446, "text": "What did you disagree?"}, {"time": 5446, "text": "What were some things you both kind of learned from each other through that conversation, do you think?"}, {"time": 5452, "text": "So here, so my story, the Jordan Peterson, a very long one."}, {"time": 5457, "text": "So one day I was walking down in Chicago, and they were like huge theater was sold out."}, {"time": 5464, "text": "It says a big letter, Jordan Peterson sold out."}, {"time": 5464, "text": "And then it was a huge theater in the middle of Chicago, right?"}, {"time": 5471, "text": "Like, this is my comedian, like who can be selling this entire thing out at like 7pm?"}, {"time": 5475, "text": "And then with my ex husband, we were walking the street."}, {"time": 5482, "text": "And then we saw people were like selling this like tickets, like for a very higher price, right?"}, {"time": 5488, "text": "And then do you want to take it?"}, {"time": 5488, "text": "And then he was like, yeah, sure."}, {"time": 5493, "text": "We went in, it's packed."}, {"time": 5493, "text": "And then I was just happy birth or like, but I wasn't able to understand his English that much."}, {"time": 5502, "text": "My English was still bad."}, {"time": 5502, "text": "And you didn't know who he was really?"}, {"time": 5506, "text": "You were just curious?"}, {"time": 5506, "text": "Yeah, it was like 2018. Who's the guy that sells out a thing?"}, {"time": 5510, "text": "A theater?"}, {"time": 5510, "text": "Yes, I saw Dave Rubin came out before him and make jokes."}, {"time": 5516, "text": "I still don't know who Dave Rubin is."}, {"time": 5516, "text": "Afterwards, I met them all."}, {"time": 5516, "text": "But back then I had no clue what that is."}, {"time": 5520, "text": "And then he was giving lessons."}, {"time": 5520, "text": "But what I got from that night was not what Jordan said, but what people did on the audience."}, {"time": 5525, "text": "These people like I don't know, thousands of people in this big theater, crying like babies."}, {"time": 5532, "text": "And that was like, whatever that guy is doing is very special, right?"}, {"time": 5540, "text": "He wasn't like making any jokes."}, {"time": 5540, "text": "He had no slides, just a one simple person standing in the huge, giant theater talk."}, {"time": 5545, "text": "And long time too."}, {"time": 5551, "text": "And people cry as like, wow, okay, whatever that is, I gotta check it out."}, {"time": 5551, "text": "And then I got home."}, {"time": 5558, "text": "And then later, many years later, I got a book."}, {"time": 5558, "text": "And I will start reading his book."}, {"time": 5563, "text": "And it talks about, it explains so much, right?"}, {"time": 5563, "text": "Like now at Columbia, I learned like everything gender is like made up concept, construct, like the hierarchy is my man's idea of making the hierarchy."}, {"time": 5575, "text": "And then he begins with the number one, the laughsers had the hierarchies, evolution of history that is within us, that we want a hierarchy, right?"}, {"time": 5586, "text": "And then chapter five about socialization of child, you know, how do you raise them?"}, {"time": 5592, "text": "And all of it, and then what's why telling the truth is matters, right?"}, {"time": 5592, "text": "And there's a white, like in his entire 12 lessons, I read it and it's like, I was so grateful that I'm alive with this."}, {"time": 5605, "text": "There's people always say, if Socrates is alive, how much would you pay to have lunch with him?"}, {"time": 5610, "text": "That kind of thing, right?"}, {"time": 5610, "text": "So for me it was like, okay, I'm like alive in the same contemporary world as one of the greatest thinkers of my entire generation."}, {"time": 5622, "text": "And then like, how much money would I pay?"}, {"time": 5622, "text": "No limit amount."}, {"time": 5622, "text": "And I like reached out to Michaela on her podcast on Twitter and connected."}, {"time": 5633, "text": "And then one day she said, do you want to be on Michaela's podcast?"}, {"time": 5637, "text": "I was like, what?"}, {"time": 5637, "text": "I was like, of course."}, {"time": 5637, "text": "And I was very nervous, but I didn't expect him to be like that connected."}, {"time": 5645, "text": "Cause I thought he was a psychologist, like he saw so much suffering in the world."}, {"time": 5653, "text": "He studied Soviet Union, his hobbies collecting those things to remind him of the suffering of a human being."}, {"time": 5658, "text": "So sometimes some people hear so much atrocity, they become like very, you know, not engaged."}, {"time": 5669, "text": "Yeah, desensitized."}, {"time": 5670, "text": "Desensitized."}, {"time": 5671, "text": "He felt, he was feeling, he was, it's almost like he was living through the experiences with you as you were talking about it."}, {"time": 5675, "text": "It was an amazing conversation."}, {"time": 5675, "text": "So Jordan is one of the great thinkers of our time, but I would say the greatest thinkers of our time is Michael Malus."}, {"time": 5683, "text": "So you've also got a chance to talk to him."}, {"time": 5683, "text": "So he wrote a book on North Korea."}, {"time": 5689, "text": "It's an interesting style book."}, {"time": 5689, "text": "I learned a lot from it."}, {"time": 5689, "text": "I learned a lot from Michael about it."}, {"time": 5695, "text": "And it's interesting that he chose North Korea as a thing to study."}, {"time": 5695, "text": "That he, of all people, this fascinating human being that is Michael, chose this darkest of aspects of humanity to study."}, {"time": 5710, "text": "What do you think of Michael?"}, {"time": 5710, "text": "What do you think of his book on North Korea called Dear Reader that people should definitely check out?"}, {"time": 5720, "text": "So back then, when I reached out to Michael through mutual friends in South Korea, my English wasn't good."}, {"time": 5725, "text": "So I got a copy in my hand."}, {"time": 5725, "text": "I tried to read and a lot of them I didn't understand."}, {"time": 5733, "text": "So, but I thought it was very fascinating how he explained North Korea through the Dear Leader's perspective, right?"}, {"time": 5740, "text": "Nobody has ever done that."}, {"time": 5740, "text": "And you can reveal so much about the state and absurdity of the entire situation."}, {"time": 5745, "text": "And also through humor."}, {"time": 5752, "text": "And that's what's amazing about Michael."}, {"time": 5752, "text": "He knows the full gravity of tragedy."}, {"time": 5752, "text": "He knows the full suffering."}, {"time": 5759, "text": "He's not just like people here in America on the BuzzFeed making fun of Kim Jong Un's haircut."}, {"time": 5764, "text": "They don't care what people go through."}, {"time": 5764, "text": "Michael cares."}, {"time": 5769, "text": "Deeply cares."}, {"time": 5769, "text": "And then he still does ridiculous jokes."}, {"time": 5769, "text": "So that kind of reveals in a dark way the absurdity of evil."}, {"time": 5776, "text": "And he does that masterfully."}, {"time": 5782, "text": "He's a genius."}, {"time": 5782, "text": "He is definitely a genius."}, {"time": 5785, "text": "If he watches this, let's not make his head too big here."}, {"time": 5785, "text": "But is there some aspect to, I mean, there is an absurdity to the whole thing."}, {"time": 5794, "text": "Kim Jong Un is this, I mean, he's almost like a caricature of evil."}, {"time": 5805, "text": "It's a joke."}, {"time": 5807, "text": "A lot of people think it's a joke."}, {"time": 5807, "text": "They just think like, this is too, too absurd."}, {"time": 5807, "text": "They just, they laugh."}, {"time": 5812, "text": "Like, can you imagine you laugh at Holocaust?"}, {"time": 5812, "text": "This is that ridiculous."}, {"time": 5818, "text": "Can you maybe psychoanalyze that a little bit?"}, {"time": 5818, "text": "Because that's where my mind goes to."}, {"time": 5824, "text": "Like, he's so ridiculous that you can't, it's almost like hard to believe this is real."}, {"time": 5834, "text": "Is that just, is that just my kind of and people's desire to escape the cruelty of reality by just kind of making a joke out of it?"}, {"time": 5845, "text": "I think it is a few things, right?"}, {"time": 5845, "text": "Like, so North Korea as a nation, number one or number two smartest IQ people in the world, despite their malnutrition."}, {"time": 5861, "text": "So there is, I mean, that's an interesting point."}, {"time": 5861, "text": "So in your sense, the people... Are not dumb."}, {"time": 5869, "text": "Still carry the sort of the brilliance."}, {"time": 5869, "text": "There's a culture there that's like hungry to become realized."}, {"time": 5877, "text": "Like the people that are silenced by the electricity, by the actually having no food, all those kinds of things."}, {"time": 5884, "text": "Like, if you add the electricity, if you add the food, you're going to have a cultural center of the world."}, {"time": 5891, "text": "Like South Korea."}, {"time": 5891, "text": "That's what they exactly did, right?"}, {"time": 5891, "text": "The exact same Korea."}, {"time": 5891, "text": "One became like 11th largest economy."}, {"time": 5896, "text": "One became the world's most like poorest nation, right?"}, {"time": 5896, "text": "And this is a perfect example."}, {"time": 5903, "text": "Like if, I don't know if you read that book, Why Nation Fails."}, {"time": 5908, "text": "It's not about a culture."}, {"time": 5908, "text": "It is not about people."}, {"time": 5908, "text": "It is not about IQ."}, {"time": 5908, "text": "What makes us too different is a system."}, {"time": 5914, "text": "South Korea, North Korea is a perfect example of that."}, {"time": 5920, "text": "One is exact same capability."}, {"time": 5920, "text": "We are a homogeneous country, same language, tradition, all of that."}, {"time": 5926, "text": "We gave them different system."}, {"time": 5926, "text": "One is free democracy, one is dictatorship and came up with the biggest different result."}, {"time": 5932, "text": "And I think North Korea reveals that to us."}, {"time": 5939, "text": "It's not because we are great that we are living in this prosperity."}, {"time": 5939, "text": "Free market."}, {"time": 5939, "text": "The ideas gave us to this."}, {"time": 5945, "text": "The system we built, our ancestors built, gave us this privilege."}, {"time": 5952, "text": "It's not us."}, {"time": 5952, "text": "Nothing is about us being special here, right?"}, {"time": 5952, "text": "The system that we have is quite special."}, {"time": 5958, "text": "And North Korea proves that to us."}, {"time": 5958, "text": "It doesn't matter even if you're smart."}, {"time": 5958, "text": "That's all irrelevant."}, {"time": 5965, "text": "And I think that's why people just keep denying that they want to feel special."}, {"time": 5972, "text": "Because I'm awesome, I got all of this."}, {"time": 5972, "text": "No, it's not you, you got this."}, {"time": 5972, "text": "And when people say, I hate capitalism."}, {"time": 5978, "text": "I was like, without capitalism, how do you came up with this thing?"}, {"time": 5984, "text": "Literally, how did you come up with this?"}, {"time": 5987, "text": "The systems matter."}, {"time": 5987, "text": "And they matter way more than this individualistic society would like to imagine."}, {"time": 5997, "text": "It is the most important thing you can have in life."}, {"time": 5997, "text": "Choosing the right system."}, {"time": 6008, "text": "Do you have advice for young people today?"}, {"time": 6008, "text": "You've lived an incredible life and you have, I hope, an incredible life ahead of you."}, {"time": 6014, "text": "What advice would you give to young people today, high schoolers, college students, how to be successful in their career or maybe successful in life?"}, {"time": 6030, "text": "Last thing I want them to feel is guilty."}, {"time": 6030, "text": "It doesn't do anything, right?"}, {"time": 6030, "text": "So I hate when people talk about, oh, why guilt?"}, {"time": 6039, "text": "It's like, that doesn't make even any sense, right?"}, {"time": 6039, "text": "I think the fact that they are born with freedom is a blessing for all of us."}, {"time": 6044, "text": "It's not like I want them to want to do something because they are guilty."}, {"time": 6051, "text": "I want them to do something because they are grateful."}, {"time": 6056, "text": "Like we are sitting here, the fact why I have children is suffering, having kids you don't sleep, costly, like so much work."}, {"time": 6062, "text": "Like any like logical rational mind, you should never want children, right?"}, {"time": 6069, "text": "Why would you do that to yourself?"}, {"time": 6075, "text": "Especially as a woman, right?"}, {"time": 6075, "text": "You don't want to do that to yourself."}, {"time": 6075, "text": "But think about like we are sitting here today, two of us in this amazing technology, this country, because somebody in Savannah hundreds of thousands of years ago, they're hunting berries and surviving cold."}, {"time": 6091, "text": "Every suffering they can imagine, they fall for us."}, {"time": 6091, "text": "That's why we ended up here."}, {"time": 6098, "text": "So life is ultimately bigger than us."}, {"time": 6098, "text": "And I think that's what I want them."}, {"time": 6098, "text": "It's not like I want them to do the right thing and be the best version of themselves."}, {"time": 6105, "text": "It's like, I want them to feel grateful."}, {"time": 6110, "text": "And we should be grateful for the freedom and then take full advantage of that."}, {"time": 6115, "text": "I mean, it starts with the freedom to experience everything in life."}, {"time": 6120, "text": "And for your life, literally, like how my father, like, you know, working, dying is a lot easier than living."}, {"time": 6128, "text": "Dying takes like few minutes, right?"}, {"time": 6128, "text": "Maximum."}, {"time": 6128, "text": "And living takes forever."}, {"time": 6136, "text": "So when I was facing this unbelievable challenge, I thought, okay, this most rational thing I can do is killing myself right now."}, {"time": 6142, "text": "But the hardest thing I can choose is choose to live."}, {"time": 6147, "text": "And my father did that."}, {"time": 6147, "text": "Even in the concentration camp, even no matter why he said, life is a gift."}, {"time": 6153, "text": "You need to fight for it."}, {"time": 6153, "text": "And I think that's what's missing here, that we don't think life as a gift."}, {"time": 6160, "text": "It's a gift."}, {"time": 6160, "text": "Like, how many people had to fight for me to be here today?"}, {"time": 6166, "text": "Think about the sacrifice they made for many, many, many generations."}, {"time": 6172, "text": "I don't even know what they went through."}, {"time": 6172, "text": "I can't even fathom what they went through."}, {"time": 6176, "text": "They fought for life."}, {"time": 6176, "text": "And that is my responsibility enough."}, {"time": 6176, "text": "So it doesn't make them, their fight was not meaningless, right?"}, {"time": 6182, "text": "It meant something because now I'm carrying on that fight."}, {"time": 6188, "text": "You mentioned considering suicide."}, {"time": 6188, "text": "Do you think about your mortality now?"}, {"time": 6188, "text": "Now that you're perhaps in a slightly more comfortable place, do you still think about death?"}, {"time": 6198, "text": "I do because I was informed actually when I was 21 that I was on the killing list of Kim Jong Un by South Korean intelligence."}, {"time": 6215, "text": "And then I had to live with that, right?"}, {"time": 6215, "text": "But now I actually feel more because, I don't know, you follow Jamal Khashoggi's story, the Saudi journalist who got chopped off in Turkey embassy, right?"}, {"time": 6228, "text": "His reason why he got killed was he became very prominent on Twitter."}, {"time": 6234, "text": "He had a huge voice and Saudis followed him."}, {"time": 6234, "text": "Now I became very first North Korean to have this many social media followings."}, {"time": 6241, "text": "And recently North Korea started an investigation team to analyze whatever I do, even though it's first time for them."}, {"time": 6253, "text": "So they don't even know what to do at this point."}, {"time": 6253, "text": "They're like, this is so new."}, {"time": 6258, "text": "What do we do?"}, {"time": 6258, "text": "We do Kim Jong Nam."}, {"time": 6258, "text": "Kim Jong Nam, the half brother of Kim Jong Un got killed in Malaysia."}, {"time": 6264, "text": "That is another tragedy that I feel so sorry for the US government is that Kim Jong Nam was giving information to the CIA for the past like 10 years."}, {"time": 6270, "text": "That trip, when he got killed in Malaysian airport, he was meeting up with the CIA agent for two days on the Northern Ireland."}, {"time": 6281, "text": "CIA could have protected him."}, {"time": 6281, "text": "They let him die."}, {"time": 6289, "text": "Who killed him?"}, {"time": 6290, "text": "North Korean Kim Jong Un killed him."}, {"time": 6290, "text": "Do you know the Malaysian, the ladies, the VX, the nerve agent."}, {"time": 6295, "text": "North Koreans killed him in Malaysian airport, in the international land."}, {"time": 6295, "text": "So I mean North Korea, who was a US resident and the Washington Post journalist, when he got killed in Saudi like a lamb, they chopped him into pieces."}, {"time": 6307, "text": "In that most inhumane death, what was the consequences for the Saudis?"}, {"time": 6313, "text": "The word is we think we live in a country where there's no justice."}, {"time": 6320, "text": "There is no accountability for killing any dissent, no matter how big their names are."}, {"time": 6327, "text": "So you don't think your vast and quickly growing social media presence protects you?"}, {"time": 6334, "text": "No, it does the opposite."}, {"time": 6334, "text": "Because Kim Jong Un, initially when I spoke out, I don't know if you went through it, they did everything they could to character assassinate me, saying I'm a liar, I'm a CIA spy, I get paid."}, {"time": 6344, "text": "And then they reached out to Penguin saying, we're going to blow up."}, {"time": 6350, "text": "You cannot write this book."}, {"time": 6350, "text": "And they did it with Sony."}, {"time": 6350, "text": "They had a Sony studio for making that stupid movie interview."}, {"time": 6354, "text": "And then Penguin did their investigation."}, {"time": 6360, "text": "They met every survivor that I went through in the desert."}, {"time": 6360, "text": "They got the voice recordings of them because they don't want them to change their mind later."}, {"time": 6365, "text": "People remember differently."}, {"time": 6369, "text": "So they got the voice recordings, the Penguin Regal team got all the audios, and now we are ready for the lawsuit."}, {"time": 6374, "text": "We are going to publish this book because we checked, verified every single thing that was going in the book."}, {"time": 6378, "text": "And North Korea couldn't do anything anymore."}, {"time": 6384, "text": "But that's character assassination."}, {"time": 6384, "text": "Which by the way, that's a whole other conversation that you were able to survive that."}, {"time": 6389, "text": "I appreciate the kind of strength it requires to survive that because you don't know."}, {"time": 6393, "text": "And your character being assassinated is in some ways can be as painful as actual assassination."}, {"time": 6402, "text": "Everybody think you're a liar."}, {"time": 6402, "text": "And now everybody, like you said, this nature of internet is that as long as something is written in the internet, they think that's a fact."}, {"time": 6413, "text": "Any stupid person can start a blog and write about you."}, {"time": 6417, "text": "But they think, oh, because it's written on the internet, it's legit."}, {"time": 6422, "text": "Especially negative stuff."}, {"time": 6422, "text": "That's the thing I was kind of trying to elaborate on."}, {"time": 6422, "text": "There's a viral aspect to calling somebody a fraud or a liar that nobody questions whether it's true or not."}, {"time": 6433, "text": "It just spreads."}, {"time": 6433, "text": "And it's a dark side of our human nature that we want to destroy the people who are rising."}, {"time": 6443, "text": "We cannot stand it."}, {"time": 6443, "text": "Any change maker in this world who wasn't controversial, right?"}, {"time": 6443, "text": "Martin Luther King Jr., Nelson Mandela, he was called as a terrorist."}, {"time": 6449, "text": "So I just did not know."}, {"time": 6457, "text": "The character assassination is the thing."}, {"time": 6457, "text": "It'll probably continue with you."}, {"time": 6461, "text": "It will continue with me forever."}, {"time": 6463, "text": "So you have to get stronger and stronger, I think, in the face of that."}, {"time": 6463, "text": "But actual assassination, perhaps it's me being hopeful because I have a situation with Russia that I hope I'm not under."}, {"time": 6474, "text": "Well, I don't care actually."}, {"time": 6474, "text": "But there's some aspect in which social media presence, I thought, protects you a little bit."}, {"time": 6480, "text": "Because just imagine the outrage from an attempted assassination of you."}, {"time": 6490, "text": "But what was the outrage when Jamal Khashoggi got killed like that?"}, {"time": 6494, "text": "Was the social media presence large?"}, {"time": 6497, "text": "Over one million people."}, {"time": 6497, "text": "I don't have that following."}, {"time": 6497, "text": "He was 1.6 million Twitter followers."}, {"time": 6503, "text": "And the outrage wasn't there?"}, {"time": 6505, "text": "Because Saudis spoke to Amazon, to Prime Studio, Netflix."}, {"time": 6505, "text": "There were people who made a documentary about him but told everybody cannot get that deal."}, {"time": 6511, "text": "So there was a huge censorship on that."}, {"time": 6517, "text": "And people, of course, I mean, they can talk about it one day."}, {"time": 6517, "text": "Some dissent from Saudi got killed."}, {"time": 6522, "text": "Horrible."}, {"time": 6525, "text": "But it just dissipates."}, {"time": 6527, "text": "They move on to the next cute puppy, right?"}, {"time": 6527, "text": "The next cute cat."}, {"time": 6527, "text": "That's what the nature of this new generation does."}, {"time": 6531, "text": "They desensitize."}, {"time": 6531, "text": "It doesn't affect them."}, {"time": 6531, "text": "They keep following the instant pleasure, instant high."}, {"time": 6537, "text": "That's what Instagram does to you."}, {"time": 6537, "text": "It changes your brain."}, {"time": 6542, "text": "That's what I was reading."}, {"time": 6542, "text": "We spoke about shallows."}, {"time": 6542, "text": "We became shallow and shallow and our brain changed permanently."}, {"time": 6547, "text": "So this new generation, we can get them angry for like 10 minutes, create hashtags for one day."}, {"time": 6552, "text": "But then as quick as that was, it goes down like instantly."}, {"time": 6558, "text": "And I think that's the... Well, that means that..."}, {"time": 6562, "text": "So that means that there is..."}, {"time": 6562, "text": "It's an effective way to get rid of opposition is by murdering them."}, {"time": 6567, "text": "And that means United States, if it stands for freedom, if it stands for the freedom of exchange of ideas, should be protecting people like you."}, {"time": 6579, "text": "But they don't because they don't want to be involved."}, {"time": 6579, "text": "They didn't even protect Kim Jong Nam who was giving information 10 years risking his life."}, {"time": 6585, "text": "That's what is so..."}, {"time": 6585, "text": "I mean, working for CIA is not bad."}, {"time": 6590, "text": "The thing is that he was giving information to bring down the regime."}, {"time": 6598, "text": "That is valuable."}, {"time": 6598, "text": "That is something noble about him."}, {"time": 6598, "text": "But then you just don't go extra miles to that."}, {"time": 6604, "text": "That's when I lost my faith in the US system as well."}, {"time": 6609, "text": "Like this country just cares about saving face."}, {"time": 6609, "text": "What is most the minimum cost they pay for anything?"}, {"time": 6615, "text": "And when I was in South Korea, constantly, every single day intelligence calling me."}, {"time": 6621, "text": "The North Korean agent going this place, where are you going?"}, {"time": 6621, "text": "The US system came to US, nobody."}, {"time": 6626, "text": "That's when people said, are you a CIA agent?"}, {"time": 6626, "text": "I wish they called me."}, {"time": 6632, "text": "I really truly do."}, {"time": 6632, "text": "But nobody, nobody does here."}, {"time": 6632, "text": "I'm sure they know what's going on."}, {"time": 6638, "text": "But the South Korean agent is more like, oh my gosh, we don't want you to get killed as a South Korean citizen, right?"}, {"time": 6643, "text": "And now I'm trying to become your citizen."}, {"time": 6647, "text": "So it's in a way, it's, I don't know what's worse."}, {"time": 6647, "text": "Are you afraid for your life?"}, {"time": 6654, "text": "I was afraid."}, {"time": 6654, "text": "For the several, three, four years, I was afraid."}, {"time": 6654, "text": "But I had to come to terms with it."}, {"time": 6663, "text": "Like my enemy is not some crazy psychopath."}, {"time": 6663, "text": "It's a state with nuclear power to attack the most powerful country."}, {"time": 6669, "text": "If Kim Jong Un decides if I die, I'm going to die."}, {"time": 6675, "text": "It's not up to me, right?"}, {"time": 6675, "text": "So in a way, also it's liberating that you, it's like if you are like afraid of some mobs or some like gangsters on the street, it's almost like you have power over a little bit."}, {"time": 6687, "text": "You got to be like thinking that's my fault."}, {"time": 6687, "text": "I went that way, right?"}, {"time": 6692, "text": "But when it comes to Kim Jong Un, I know like my enemy is so much bigger than me."}, {"time": 6697, "text": "It's in a ways of liberation."}, {"time": 6697, "text": "And also, you know, I just, I live a lot."}, {"time": 6704, "text": "So I have seen a lot."}, {"time": 6704, "text": "I seen everything."}, {"time": 6704, "text": "I don't have that much regret left here."}, {"time": 6704, "text": "Like, okay, I'm going too soon."}, {"time": 6709, "text": "You know, it's like, okay, maybe it's time."}, {"time": 6709, "text": "Like death is a part of life."}, {"time": 6714, "text": "In some sense, you're willing to accept death to keep fighting for freedom in your, in at least in part a place you call home."}, {"time": 6722, "text": "Do you hope that one day you can return to North Korea?"}, {"time": 6729, "text": "I hope I bring my son and tell him this is like where your ancestors from too."}, {"time": 6735, "text": "It would look very different than the place you came from in your, as you hope."}, {"time": 6741, "text": "Do you hope that there's a democracy one day that North Korea looks like South Korea?"}, {"time": 6752, "text": "Well, that would be in paradise, right?"}, {"time": 6752, "text": "But I'm a rational optimist."}, {"time": 6762, "text": "I'm not like just optimistic because I have to be."}, {"time": 6762, "text": "I think as long as there are people who have changed the world, right?"}, {"time": 6768, "text": "Like who believed in something and worked for it."}, {"time": 6768, "text": "And like, I don't know, like there's like Alice Shroves, a few people holding entire this world, right?"}, {"time": 6779, "text": "I really believe in that."}, {"time": 6779, "text": "I think as long as that continues, that can happen in my country."}, {"time": 6786, "text": "As long as people like you someday want to decide to do something with North Korea and working for it, using your brainpower to solve this puzzle, how fascinating would that be?"}, {"time": 6795, "text": "That's why I continue to speak, continue to recruit."}, {"time": 6795, "text": "To inspire millions to do something."}, {"time": 6801, "text": "The books you like are all the books I love."}, {"time": 6801, "text": "I have to mention this."}, {"time": 6809, "text": "You mentioned briefly on the, with Jordan, Siddhartha by Hermann Hesse is an incredible book."}, {"time": 6817, "text": "I mean, I don't know exactly what I want to ask here, but there's some, I think the book kind of, through telling a story, reveals that life is suffering and yet there's beauty in it."}, {"time": 6832, "text": "The beauty in every moment that uses kind of a river to paint a metaphor."}, {"time": 6839, "text": "Is there something that you could say, speak to like how that book impacted your life and the way you live life, maybe the way you see life, whether it's on the life of suffering side or that life is beautiful side."}, {"time": 6854, "text": "I mean, he goes the entire journey, right?"}, {"time": 6854, "text": "He goes in this state of, I'm so enlightened that I cannot deal with the people who are there in love and quiet about it."}, {"time": 6860, "text": "They're like, that's so like primitive."}, {"time": 6865, "text": "Once he has his own son, he actually being attached."}, {"time": 6865, "text": "He actually cares."}, {"time": 6873, "text": "He actually really does whole thing, right?"}, {"time": 6873, "text": "That's a thing that he used to think not."}, {"time": 6877, "text": "Once his son comes find him, he looks at life differently."}, {"time": 6884, "text": "I did have that kind of journey where, oh, nothing matters, right?"}, {"time": 6884, "text": "So bitter."}, {"time": 6889, "text": "So so like, so cynical."}, {"time": 6889, "text": "And after I met so many incredible people, I was talking about that person who told me he was gay."}, {"time": 6898, "text": "He told me, I love you."}, {"time": 6898, "text": "And I was like, why do you love me?"}, {"time": 6905, "text": "In the past, people when they wanted me was because they want to rape me."}, {"time": 6905, "text": "Everybody wanted something from me."}, {"time": 6910, "text": "That's why they wanted me."}, {"time": 6910, "text": "And I never understood."}, {"time": 6910, "text": "You can love somebody unconditionally."}, {"time": 6915, "text": "And this gay guy, the last one was want to sleep with me, right?"}, {"time": 6920, "text": "And he loves me."}, {"time": 6920, "text": "And I think I had a blessing after my journey, meeting people who loved me unconditionally because I was just being a human."}, {"time": 6926, "text": "And I think that's what it is now for me that like him."}, {"time": 6932, "text": "I live for love now."}, {"time": 6932, "text": "I live for love."}, {"time": 6932, "text": "Any kinds of love."}, {"time": 6939, "text": "Love for knowledge."}, {"time": 6939, "text": "I like, I read so many books because I love books, right?"}, {"time": 6939, "text": "I love what I do."}, {"time": 6945, "text": "I love my people."}, {"time": 6945, "text": "I love humanity."}, {"time": 6945, "text": "You know, even it sometimes annoys me."}, {"time": 6945, "text": "I love myself."}, {"time": 6953, "text": "And that's beautiful too."}, {"time": 6953, "text": "The annoying parts are beautiful too."}, {"time": 6953, "text": "What do you, let me ask the ridiculous question."}, {"time": 6956, "text": "Of what's the meaning of life?"}, {"time": 6962, "text": "Well, I think at this point I stop questioning why I'm here, right?"}, {"time": 6962, "text": "Like it doesn't matter someone put the atom there or a big bang."}, {"time": 6970, "text": "That's truth, right?"}, {"time": 6970, "text": "I'm going to accept that fully."}, {"time": 6975, "text": "So what, instead of me keep asking the impossible question, why I'm here."}, {"time": 6979, "text": "I'm going to let you do that."}, {"time": 6979, "text": "Let the science do that, right?"}, {"time": 6979, "text": "You guys go out in the space and look for the evidence."}, {"time": 6984, "text": "I'm conducting."}, {"time": 6988, "text": "You accept that you're here and you're just going to enjoy it."}, {"time": 6988, "text": "Like you're here for love, as you said."}, {"time": 6994, "text": "I think I'm here for the process of pursuing something bigger than me."}, {"time": 7000, "text": "Process of doing something."}, {"time": 7000, "text": "It's not like a model."}, {"time": 7000, "text": "It's not a virtue signal or anything."}, {"time": 7007, "text": "It just makes me happy that I fight for something bigger."}, {"time": 7007, "text": "Like than me, right?"}, {"time": 7007, "text": "How boring is that?"}, {"time": 7012, "text": "Every day you get up like, Oh my God, I'm going to buy myself this."}, {"time": 7012, "text": "I'm going to get this for myself."}, {"time": 7016, "text": "It's so boring, isn't it?"}, {"time": 7016, "text": "So in a way, I think that's what it is."}, {"time": 7023, "text": "I'm grateful that I'm in a state."}, {"time": 7023, "text": "I don't have to fight for myself anymore."}, {"time": 7023, "text": "But morning people have to do that."}, {"time": 7029, "text": "And that's sometimes more than enough they have to do."}, {"time": 7029, "text": "And I salute them."}, {"time": 7033, "text": "They are doing fighting, saving themselves every day."}, {"time": 7033, "text": "But now I'm not there."}, {"time": 7033, "text": "I'm very blessed."}, {"time": 7039, "text": "That's why I'm very grateful."}, {"time": 7042, "text": "Still fighting for something much bigger than you."}, {"time": 7042, "text": "But do you still believe that you can change the world?"}, {"time": 7047, "text": "That you can be a thing that, at least in part, helps North Korea or even broader helps alleviate some suffering in the world?"}, {"time": 7061, "text": "So that's the thing."}, {"time": 7061, "text": "I was reading this book before by randomness, right?"}, {"time": 7066, "text": "I was like, oh my God, you're so courageous."}, {"time": 7066, "text": "You're amazing."}, {"time": 7066, "text": "I was like, no, I'm not."}]}]