[{"title": "Tom Brands: Iowa Wrestling | Lex Fridman Podcast #245", "id": "Ww6pfsWmkdY", "quotes": [{"time": 297, "text": "I mean, my loss to John Smith in 1991, US Open was something that I learned a lot about."}, {"time": 308, "text": "I learned a lot about positioning."}, {"time": 309, "text": "I learned a lot about the importance of par terre."}, {"time": 313, "text": "You know, in a certain kind of crazy way, I learned that I could go with the best guy in the world, even though it was 14 to four."}, {"time": 320, "text": "And this is when Tech Falls were 15 or 12 points."}, {"time": 322, "text": "I didn't get Tech Fall and that wasn't a badge of honor for me."}, {"time": 325, "text": "But I knew I could go with him because it was one point takedowns."}, {"time": 328, "text": "I scored four takedowns on him."}, {"time": 330, "text": "And I learned that I had to move my feet and I learned what it meant to move your feet constantly."}, {"time": 337, "text": "And there's no break."}, {"time": 339, "text": "John Smith is a very, very intense competitor that people know that now, six time world Olympic champion."}, {"time": 347, "text": "And I felt that firsthand."}, {"time": 349, "text": "But I did not go in there taking a back seat, even though the score was very lopsided."}, {"time": 357, "text": "But you knew you could stand with the best of the world."}, {"time": 359, "text": "I knew that this is what this is about."}, {"time": 363, "text": "And you know what, you move your feet and you don't give up a lace that's so damn tight that you can't feel your calf muscle."}, {"time": 371, "text": "And I had to get ready for the consolation side of the bracket, because I believe that was in the semis."}, {"time": 377, "text": "And you just learn from that."}, {"time": 378, "text": "And it was better than learning from a win over a second ranked senior level guy when you're a junior in college."}, {"time": 388, "text": "You're wrestling the best on a stage."}, {"time": 391, "text": "So if you look back, you probably spent tens of thousands of hours on the mat, spilled sweat, blood, even tears, maybe, maybe a few times."}, {"time": 401, "text": "So technically or philosophically, how would you do any of those hours differently?"}, {"time": 405, "text": "Just looking back at the tens of thousands of hours."}, {"time": 409, "text": "I would be more, probably in my older age, I probably would have been more relaxed in my training and probably would have went another cycle."}, {"time": 419, "text": "If I could do it over again, in 96, I really thought that when Gable retired, that I would be the next guy in line."}, {"time": 427, "text": "And I was wrong and that was immature of me."}, {"time": 429, "text": "In terms of the coach."}, {"time": 430, "text": "In terms of the coach, yes."}, {"time": 432, "text": "And I knew that Gable was close."}, {"time": 434, "text": "I mean, I didn't know when, but it just so happens, you know, 97 was his record breaking year and then he retired, but I didn't know how close he was."}, {"time": 441, "text": "But I knew that he had, you know, he went down with a bad hip injury."}, {"time": 445, "text": "And so, you know, you're just, you're not gonna."}, {"time": 449, "text": "So what does a relaxed Tom Brands look like?"}, {"time": 453, "text": "You're saying you would have been a little more relaxed."}, {"time": 455, "text": "More like where, you know what, I was pretty dang good and I was getting better every day, but maybe doing a little bit different, a little bit smarter."}, {"time": 463, "text": "And Terry actually did that going through 2000."}, {"time": 468, "text": "He had to do it."}, {"time": 469, "text": "And he would have been in the, you know, the funny farm, let alone the, you know, the physical farm, whatever you want to say, mentally and physically beat up."}, {"time": 482, "text": "But he had to learn to less is more type approach."}, {"time": 487, "text": "And how it came around was, is, you know, you work hard at feeling good."}, {"time": 494, "text": "You work hard in your recovery."}, {"time": 496, "text": "So even when you're not wrestling hard in that wrestling room, and looking for the toughest partner to go, you're still working hard in your recovery."}, {"time": 508, "text": "And massage could be that."}, {"time": 511, "text": "Stretching could be that."}, {"time": 513, "text": "Things like that, that are more fluffy."}, {"time": 517, "text": "And that's something you weren't as good at?"}, {"time": 519, "text": "The recovery aspect of this?"}, {"time": 521, "text": "Never, never."}, {"time": 522, "text": "There's not a place for it with young people."}, {"time": 525, "text": "Because in my opinion, there's so much development to have, there's so much development to have happened."}, {"time": 532, "text": "I mean, when you need to learn wrestling, you need to be wrestling."}, {"time": 537, "text": "And as you get older, your body won't do it anymore."}, {"time": 543, "text": "And so to learn wrestling, it's more of a, probably a relaxed approach."}, {"time": 548, "text": "So if you had to choose between two athletes who would dominate competition, one who drills 100,000 reps of a specific take down, specific technique, or one that spends that time live wrestling?"}, {"time": 562, "text": "Both, it's the same."}, {"time": 564, "text": "And I like to live wrestling, I was always wanting to live wrestle, bring the warm up into the live wrestle, let's go."}, {"time": 570, "text": "But where I got really, really good was a repetition."}, {"time": 574, "text": "And I was disciplined enough to know that the things that you hate to do in this sport are the things that make you the very best."}, {"time": 582, "text": "And that is a rare ingredient as I've gotten older."}, {"time": 585, "text": "And you spend a lot of time communicating that to younger athletes."}, {"time": 590, "text": "So the thing, if you feel yourself hating something, that's probably the thing you should be doing."}, {"time": 595, "text": "Yes, as a matter of fact, I had a strength coach when I was really young."}, {"time": 598, "text": "He was just a fricking guy that would, he wore white, like he was almost like a nurse, nurses clothes."}, {"time": 605, "text": "He wore all white from head to toe."}, {"time": 607, "text": "And he was in Cheyenne, Wyoming."}, {"time": 610, "text": "And his first name was Walt."}, {"time": 611, "text": "And he taught Terry and I to hate the bar away from you on that last rep when you're dead."}, {"time": 617, "text": "And whether it's a curl, you hate it up."}, {"time": 619, "text": "And then you do the negative and you hate it down and you hate that bench up and you hate it."}, {"time": 623, "text": "You look at the bar and you hate it away from you."}, {"time": 626, "text": "So I learned and I was young, I was young."}, {"time": 631, "text": "And I remember being born, my mom's sister lived out there and we were dropped off to stay out there with our cousins."}, {"time": 636, "text": "And I was born a little bit."}, {"time": 638, "text": "And they always treated us really good."}, {"time": 639, "text": "But this was like the single most bright spot in a weightlifting, like enlightenment, even though I lifted weights."}, {"time": 650, "text": "But I never knew the psychology behind lifting weights."}, {"time": 652, "text": "It's just to look good and so you can flex and look in the mirror or is it for performance?"}, {"time": 657, "text": "And this guy was about performance."}, {"time": 660, "text": "And you said repetition."}, {"time": 661, "text": "Do you mean technique?"}, {"time": 663, "text": "I'm talking repetition, technique, technique, technique, drill, drill, drill, hit, hit, hit, drive, finish, hit, hit, hit, drive, finish."}, {"time": 668, "text": "So you believe in that."}, {"time": 670, "text": "I believe in that wholeheartedly."}, {"time": 674, "text": "And I believe that you have to do it on your own."}, {"time": 677, "text": "I don't believe in the coach taking you to the promised land."}, {"time": 681, "text": "So in the guys today or in yourself, how often do you see people that grow the belief of doing 10,000, 20,000 reps?"}, {"time": 692, "text": "I think it's rare."}, {"time": 693, "text": "I think it's very rare."}, {"time": 694, "text": "And I think it's especially rare."}, {"time": 696, "text": "I mean, you can talk about that as a coach, but it's especially rare to bring a guy to that understanding, but you never stop trying."}, {"time": 703, "text": "You're always trying to reach him."}, {"time": 706, "text": "I mean, we didn't have a good performance out there tonight, but you know what?"}, {"time": 710, "text": "You don't stop communicating."}, {"time": 713, "text": "And there's a lot of programs out there that put their head down when things aren't going their way."}, {"time": 719, "text": "And then as things start going their way, then they rise with the tide."}, {"time": 722, "text": "There was no difference in the demeanor of our corner."}, {"time": 725, "text": "And we talk about that, that's a philosophy."}, {"time": 728, "text": "And so you're reaching your guys that way."}, {"time": 731, "text": "So go back to your point or your question."}, {"time": 733, "text": "Do you believe in the 10,000 reps?"}, {"time": 736, "text": "And yes, I do."}, {"time": 739, "text": "How do you inspire people to do that?"}, {"time": 740, "text": "So by example, but communication."}, {"time": 743, "text": "But I mean, in my experience, what I've seen communicating the value of repetition and drilling is a hard thing to communicate."}, {"time": 752, "text": "And it's very rare to have somebody that goes in there and will do it on their own."}, {"time": 756, "text": "Do you have young guys that step up and do that?"}, {"time": 759, "text": "We do, and it's rare."}, {"time": 761, "text": "And the guys that do it on their own and have done it on their own are the guys that are in that lineup and doing well."}, {"time": 768, "text": "The other thing is that when you talk about getting to that next level, a lot of times what held you back was I did everything the coach asked of me and nothing more."}, {"time": 783, "text": "I mean, you can be a great guy for a coach as an athlete, and you did everything that coach asked, but you did nothing more."}, {"time": 792, "text": "So you're really looking for the guys that go way beyond what the coach says."}, {"time": 797, "text": "We don't want guys that are looking at their watch running out of the room when practice is over."}, {"time": 802, "text": "We want guys that know what they have to get done, and they might leave early, but they're not looking at their watch."}, {"time": 808, "text": "They might be done early."}, {"time": 809, "text": "They might be, we might be on a whole different path, and this guy just excuses himself."}, {"time": 814, "text": "I'm all about that."}, {"time": 816, "text": "We are not autocrats."}, {"time": 818, "text": "There's an internal engine in there."}, {"time": 820, "text": "Is that something you're born with, or is that something you can develop?"}, {"time": 823, "text": "I think you are born with it."}, {"time": 825, "text": "You develop it also, and I think that there has to be comfort, and I go back to communication, that young people are comfortable enough to communicate that I need to take the day off."}, {"time": 839, "text": "So what do you mean by communication?"}, {"time": 840, "text": "Or I need to do something different."}, {"time": 840, "text": "Communication, exactly."}, {"time": 842, "text": "So letting athletes be part of their own development."}, {"time": 847, "text": "Communication to me is letting them know what they need to do to get themselves in contention to be the starting quarterback, and then to give them boosts and compliments when they earn them, and I don't have time to waste with lies and cheating."}, {"time": 872, "text": "And when I say cheating, I'm talking about when they cheat themselves, and so those become very direct conversations, and the conversation starts like this."}, {"time": 879, "text": "I don't have time to waste, and neither do you, and so why are we wasting our time?"}, {"time": 884, "text": "And here's what I mean by that."}, {"time": 886, "text": "We're having a conversation about your accountability."}, {"time": 889, "text": "If you look in the mirror and you're accountable, then we aren't taking the time to go through this."}, {"time": 895, "text": "We're already on our way to solving the problem."}, {"time": 897, "text": "Problem can't be solved without that understanding."}, {"time": 900, "text": "And that has to do with symptoms that you see in the wrestling room."}, {"time": 904, "text": "There's something where the fire's not quite there."}, {"time": 905, "text": "That has to do with mental, emotional, spiritual, physical, everything."}, {"time": 910, "text": "Everything that you know about."}, {"time": 952, "text": "She doesn't waste time."}, {"time": 954, "text": "She's direct, and she's a problem solver, and that's what we need."}, {"time": 957, "text": "You need problem solvers."}, {"time": 961, "text": "So on the flip side of problems and technique and repetition, here's a thing called toughness, mental toughness, something that maybe you or maybe even Iowa in general is a little bit known for."}, {"time": 975, "text": "So how do you train mental toughness as a coach?"}, {"time": 979, "text": "You train mental toughness by putting them in situations that they're willing to go through but don't think they can make it, and then they go through it, and then all of a sudden those berries are down."}, {"time": 991, "text": "Does that have to do with physical usually exhaustion, the four reps on the ropes?"}, {"time": 998, "text": "It has to do with that, and it has to do with understanding why we're doing it."}, {"time": 1005, "text": "And sometimes understanding why we're doing it might not come for months, but there's blind faith, and we have a heavyweight in the room right now, this young guy that he's like that."}, {"time": 1018, "text": "He doesn't necessarily understand it."}, {"time": 1020, "text": "He asks a lot of questions, but he doesn't, and he's been here four months now, four and a half months now, and he's getting better every day."}, {"time": 1027, "text": "So mental toughness too is a matter of repetition."}, {"time": 1031, "text": "Mental toughness is a matter of repetition and having an open mind and being extremely accountable, and not only accountable that when you maybe, when something doesn't go your way, that you look in the mirror and own it, but accountable to the point of view that, you know what, I gotta get tough in this situation right here, right now, and this is what's gonna make or break me."}, {"time": 1053, "text": "And I talked about my own career being defined by, you know, a couple of minutes on the mat, but that's when you're gonna be defined."}, {"time": 1061, "text": "That's how you're gonna be defined."}, {"time": 1064, "text": "So people are gonna talk about you, so you might as well have them talking about how doggone tough you are."}, {"time": 1071, "text": "What about, we live in a world now, I have often in my own work, I hear about this concept of work life balance or overtraining."}, {"time": 1080, "text": "So you've been one of the hardest workers ever on the mat."}, {"time": 1084, "text": "You've coached some of the hardest workers ever."}, {"time": 1087, "text": "Do you think it's possible to over train, train too much?"}, {"time": 1090, "text": "How big of a concern is it?"}, {"time": 1091, "text": "I think peaking and burnout are frames of mind or burnout is a like you let things probably get to the point where you could have arrested them with a good frame of mind."}, {"time": 1104, "text": "But peaking is a frame of mind and you have to know, be able to read, and that's a lot of it."}, {"time": 1110, "text": "And the individual athlete also has to know that it's a frame of mind."}, {"time": 1115, "text": "And so when you have a coach that's reading that the right way and you have an athlete that is knowing that when zero hour comes that you're gonna be ready to go and knowing that there's light at the end of the tunnel if you feel like you're burning that candle at both ends, light's coming at the end of the tunnel."}, {"time": 1133, "text": "I mean, you're good to go."}, {"time": 1135, "text": "So you think about Gable and that whole dream of being carried off the mat because you worked so hard."}, {"time": 1142, "text": "And again, do you think it's possible to overtrain?"}, {"time": 1144, "text": "So you said it's mental."}, {"time": 1147, "text": "I do think it's possible to overtrain if you have a lot of distractions."}, {"time": 1151, "text": "And if you're looking at your watch running out of the room, then yeah, that frame of mind isn't gonna lend itself to excellency."}, {"time": 1159, "text": "And the thing is, is we have to accomplish what we need to get accomplished to get better every day."}, {"time": 1164, "text": "You can't kind of accomplish what you need to accomplish."}, {"time": 1166, "text": "You have to accomplish it."}, {"time": 1168, "text": "And when you're in that mindset, then the clock is irrelevant."}, {"time": 1173, "text": "There's no place for a clock in the wrestling room."}, {"time": 1175, "text": "And maybe a clock that times a match, but it may be a clock."}, {"time": 1180, "text": "We're student athletes here, but that's why we encourage when you schedule your classes that you don't have a class that comes right up to practice time or starts as a night class and it starts at 5.30."}, {"time": 1196, "text": "Go to get the 6.30 class or the seven o clock."}, {"time": 1199, "text": "So you leave it all behind your heart, your passion is completely in it."}, {"time": 1202, "text": "There's no problem."}, {"time": 1203, "text": "When you walk in that wrestling room, there's no distractions and it's never eternal."}, {"time": 1208, "text": "The only thing that's eternal is death."}, {"time": 1211, "text": "You know, there's nothing."}, {"time": 1212, "text": "Sometimes guys come in there and they wig out."}, {"time": 1215, "text": "It's an hour and 25 minutes, or an hour and 45 minutes."}, {"time": 1222, "text": "You have to be willing to go as long as it takes."}, {"time": 1225, "text": "There's no clock."}, {"time": 1228, "text": "Again, wrestlers are some of the hardest, some of the toughest people in all of sports, but weight cutting often breaks people."}, {"time": 1235, "text": "So what's your thought on weight cutting, both nutrition wise, mental wise?"}, {"time": 1240, "text": "How do you approach and think of it as a coach in your own career too?"}, {"time": 1245, "text": "It's a lot of discipline and it's a lot of discipline during a very uncomfortable time period that really doesn't last that long, but it feels like it lasts long and it's painful."}, {"time": 1256, "text": "But once you shrink your body down and if you're hydrated, you'll get through it."}, {"time": 1261, "text": "If you're a little hungry, but you're eating, but you're hydrated, once you break that sweat, your energy depletion goes away."}, {"time": 1269, "text": "That's a fact."}, {"time": 1270, "text": "I've practiced that."}, {"time": 1271, "text": "You come in and you're yawning and you're starting to shrink your body down and it's that time of year where, hey, I gotta get my body shrunk down and you're dehydrated, you are dead in the water."}, {"time": 1283, "text": "But if you're hungry and hydrated, when you break that sweat... Have people gotten better with that over the years, over the past few decades?"}, {"time": 1290, "text": "I think that coaches, science is better."}, {"time": 1294, "text": "I think that coaches communicate it."}, {"time": 1295, "text": "I think they always have."}, {"time": 1297, "text": "I think the bottom line is, is having the energy to implement that and taking a guy by the hand when he doesn't understand and he's new in your program and he's essential and or he's unwilling to and not disciplined enough because when you take him by the hand enough, they won't learn that discipline."}, {"time": 1315, "text": "This is a fact."}, {"time": 1316, "text": "This is an important aspect of wrestling, buddy."}, {"time": 1321, "text": "So, you know, it's not just go and show up for the match."}, {"time": 1326, "text": "I mean, it's not about just making weight either."}, {"time": 1328, "text": "You gotta be able to make weight."}, {"time": 1330, "text": "That's part of the warm up."}, {"time": 1332, "text": "That's part of the process, getting ready to wrestle."}, {"time": 1334, "text": "It's a whole thing."}, {"time": 1334, "text": "It's a lifestyle."}, {"time": 1336, "text": "When did you first start believing you're going to win Olympic gold?"}, {"time": 1342, "text": "I mean, I found out I got really addicted to wrestling really, really fast, started late."}, {"time": 1348, "text": "But looking back at my life, wrestled my whole life with my twin brother."}, {"time": 1354, "text": "And when Terry and I would fight, it was wrestling and it was to maim."}, {"time": 1359, "text": "And so if you're trying to maim me, I better be tough because if I roll over and expect you to scratch my belly when you're trying to maim me, I won't lose my head."}, {"time": 1371, "text": "And Tom and Terry Brands, there was no alpha male."}, {"time": 1375, "text": "And when it was on, it was on for real."}, {"time": 1378, "text": "What do you mean there's no alpha male?"}, {"time": 1379, "text": "There's both?"}, {"time": 1380, "text": "There are a lot of twins."}, {"time": 1382, "text": "There's a dominant twin."}, {"time": 1383, "text": "Oh, a lot of them."}, {"time": 1384, "text": "Very few times is there a situation where I'm going to win every time in everything and then he's thinking the same exact way."}, {"time": 1393, "text": "And Terry used to describe it like when we used to get interviewed a lot about our careers."}, {"time": 1397, "text": "Like it'd be like you grabbing a steering wheel and me grabbing a steering wheel and fighting."}, {"time": 1402, "text": "And that's what it was like when you would wrestle him or fight him."}, {"time": 1405, "text": "And so I had that benefit."}, {"time": 1407, "text": "So when did I know?"}, {"time": 1408, "text": "Well, I got addicted to wrestling really, really fast in fifth grade and started to research it."}, {"time": 1414, "text": "And I don't know why and talked about the Olympics and put it in my head and remember said something about being an Olympic champion in fifth grade."}, {"time": 1425, "text": "And somebody made fun of me and I got in a fight in the playground."}, {"time": 1429, "text": "And I remember getting pulled in, getting in trouble for that."}, {"time": 1434, "text": "And the people that got me in trouble for that were smart enough to not rake me over the coals, but they researched or they actually found out what the fight was about."}, {"time": 1444, "text": "And I was distraught."}, {"time": 1446, "text": "I was really emotional, like crying or whatever you want to say."}, {"time": 1450, "text": "You don't want to admit that too many times."}, {"time": 1452, "text": "But it wasn't because I got beat up or got my nose bloodied or got punched in the face or broke my arm or there was any pain."}, {"time": 1460, "text": "It was because they stomped on my dream and they doubted me."}, {"time": 1464, "text": "And so I fought for that."}, {"time": 1466, "text": "And that was a lesson."}, {"time": 1467, "text": "There's going to be a lot of doubters."}, {"time": 1469, "text": "And one thing we talk about as a staff is our staff has to be lockstep in that hallway, in our offices."}, {"time": 1478, "text": "And when you deviate outside of that, that is heresy."}, {"time": 1483, "text": "So everybody has to be on board, confident that you're going to be number one in the country."}, {"time": 1488, "text": "When we go forward and we go put our public foot forward, there is a decision."}, {"time": 1492, "text": "We are unified and there is no backbiting."}, {"time": 1495, "text": "And we have great people right now."}, {"time": 1496, "text": "And we hadn't had that before."}, {"time": 1498, "text": "We've had detractors in our Hawkeye Wrestling Club."}, {"time": 1501, "text": "We've had guys that would go out and get rolled up in ankle laces and not be able to walk."}, {"time": 1505, "text": "We've had guys that would go out and get rolled up in ankle laces and not care in our club."}, {"time": 1511, "text": "And we got Brandon Sorensen, who got rolled up by James Green last night."}, {"time": 1515, "text": "But I'll tell you what, I don't have a problem with that."}, {"time": 1518, "text": "Because I know it means a lot to him."}, {"time": 1520, "text": "He didn't roll over."}, {"time": 1522, "text": "He didn't quit because he was on the consolation side of a bracket."}, {"time": 1525, "text": "And so when you have that and then you have, if there's a disagreement, it's behind closed doors."}, {"time": 1531, "text": "And then you're moving forward."}, {"time": 1532, "text": "And when you have people that when they're meeting your fans and your supporters, you know, they're talking the right way with the right message."}, {"time": 1540, "text": "And anything that's cattywonk is to that, you got to be careful there."}, {"time": 1544, "text": "You got to be careful there."}, {"time": 1546, "text": "So that in terms of affirmation, in terms of really believing as a team, as an individual, believing that you're the best in the world, did you, I'm sure you had detractors."}, {"time": 1557, "text": "You had people that continued after fifth grade."}, {"time": 1559, "text": "And that's probably where my hatred of losing trumps my love for winning because I wanted to shove it up their rear end bad."}, {"time": 1570, "text": "And the thing is, is we maintain a high level and there's very few programs."}, {"time": 1575, "text": "Oklahoma State, Ohio State now, Penn State."}, {"time": 1579, "text": "I mean, there's four programs that try to win a national title every year."}, {"time": 1584, "text": "And these other teams, they get up and they got a good team and they get up and they get going."}, {"time": 1590, "text": "And then when things don't go well, okay, we're going to do it next year."}, {"time": 1594, "text": "Or this is a down year."}, {"time": 1595, "text": "We're going to get right."}, {"time": 1596, "text": "We're three years out."}, {"time": 1597, "text": "So no matter what you're fighting for first."}, {"time": 1600, "text": "And we haven't won and you say, well, even one in eight years."}, {"time": 1604, "text": "But look at our results are better than anybody out there."}, {"time": 1607, "text": "And it's besides Penn State."}, {"time": 1609, "text": "And it's because of our mentality and because we have great people."}, {"time": 1614, "text": "Ryan Morningstar, Bobby Telfer, Terry Brands, our medical team, even our strength coach, Quinn Holland, we're all on the same page."}, {"time": 1622, "text": "And when I send something, I hit it immediately."}, {"time": 1624, "text": "I don't have time to waste."}, {"time": 1626, "text": "There will not be dissension in that hallway."}, {"time": 1629, "text": "Everybody's in together."}, {"time": 1631, "text": "1996 Olympic Games in Atlanta."}, {"time": 1634, "text": "Can you take me through the day when you're going for the 62 kg gold?"}, {"time": 1639, "text": "What did you eat?"}, {"time": 1641, "text": "Drink?"}, {"time": 1643, "text": "It really doesn't matter."}, {"time": 1644, "text": "Um, I have a routine that, you know, I had a routine as a competitor that I could run through right now."}, {"time": 1651, "text": "Um, it was a lot of self talk, very, very positive self talk."}, {"time": 1655, "text": "Visualization."}, {"time": 1656, "text": "Visualization, um, self talk."}, {"time": 1659, "text": "Um, and, and that's how I was able to relax and getting ready for matches my whole life."}, {"time": 1665, "text": "Learned that very early age at a camp and a developmental camp at a young age, Terry and I did."}, {"time": 1671, "text": "And, um, I can tell you what I ate and I can tell you what I did to relax and it doesn't matter."}, {"time": 1679, "text": "Um, what you have to do is you have to find that piece."}, {"time": 1683, "text": "And I just know that when I was getting ready for the finals match, I had gone back to my room."}, {"time": 1689, "text": "I had my relaxed material, you know, and I was able to relax because I prepared for it."}, {"time": 1697, "text": "Hopefully I'm right on this, but just looking at the insane bracket you had to go through, you had to beat, just to get to the finals, it had to be three world champions, eventually world champ."}, {"time": 1707, "text": "I mean, Dave, and you know what?"}, {"time": 1709, "text": "I don't talk about that and nobody else does either, but everybody talks about it in their own career."}, {"time": 1714, "text": "So now you're making my head big, but yeah, I had a road, I had a road."}, {"time": 1719, "text": "That is the hardest bracket I've seen."}, {"time": 1721, "text": "So I've talked to a lot of Olympic champions."}, {"time": 1723, "text": "That is the hardest bracket I've seen of any champion."}, {"time": 1726, "text": "So maybe I'm confused on this, but it seemed like a really tough day for you."}, {"time": 1730, "text": "Did you have, did you know the bracket ahead of time?"}, {"time": 1733, "text": "Did you know who you faced?"}, {"time": 1735, "text": "You see the draw and it's a two day tournament."}, {"time": 1738, "text": "So psychology comes into it as much as physical shape, you know, because there's those, you got to sleep, you know, the night before after the weigh in, then you got to sleep again that next night after your semi final match is going to be in the morning."}, {"time": 1754, "text": "You know, and then you have to go back and rest because your final matches in Intel, whatever time it was."}, {"time": 1759, "text": "And so all this relaxation and all that stuff that you just talked about, that visualization and self talk, that's what helps you."}, {"time": 1765, "text": "It's your routine."}, {"time": 1767, "text": "And was there any doubt, any fear, any, anything there?"}, {"time": 1771, "text": "The fear is the type of fear."}, {"time": 1774, "text": "And I just talked about this to one of my athletes today."}, {"time": 1778, "text": "Jack Dempsey talked about fear and the fear of losing is what motivates him to try to take his opponent's head off."}, {"time": 1785, "text": "He was a boxer and that's okay."}, {"time": 1789, "text": "So fear of competition, fear of screwing up, fear of, oh, I don't feel good."}, {"time": 1795, "text": "But that little fear that, you know what, there's somebody out there that thinks that, you know what, they're going to, they're going to revel in my, they're going to, they're going to, they're going to eat it up in my misery."}, {"time": 1807, "text": "They're going to love, they're going to be thriving because I fail."}, {"time": 1810, "text": "And I'm not going to let that happen."}, {"time": 1813, "text": "You're identical twin brother, Terry."}, {"time": 1815, "text": "You've been at him, like you said, your whole life, and you're both some of the greatest wrestlers of all time."}, {"time": 1823, "text": "You won the gold medal."}, {"time": 1824, "text": "He won the bronze medal."}, {"time": 1825, "text": "You've mentioned, you know, all that really matters is the six minutes or, you know, just a few minutes, sometimes a few seconds to find your whole career."}, {"time": 1833, "text": "So how do you think about that thin line, the tragic line, and how do you think about that line, the tragic line at the Olympic level between winning and losing?"}, {"time": 1843, "text": "I think you come to peace that in the end, when it's over, that you did the best you could."}, {"time": 1849, "text": "And that's certainly the case with Terry."}, {"time": 1853, "text": "He has a career credentials are better than mine internationally."}, {"time": 1857, "text": "You know, he won two world championships."}, {"time": 1858, "text": "I won one and he won an Olympic bronze medal."}, {"time": 1861, "text": "And, you know, I won an Olympic gold medal, but I only won one."}, {"time": 1866, "text": "The thing is, is that's not what's important anyway."}, {"time": 1869, "text": "What's important is, is that when it's all over, you know, how do you look back on it?"}, {"time": 1878, "text": "And you're kind of like, well, you just said that you made sure that you weren't going to leave anything undone."}, {"time": 1884, "text": "There were tournaments where I did leave things undone."}, {"time": 1887, "text": "And so how do you come back from that?"}, {"time": 1889, "text": "Well, Terry never came back from 2000 because he retired."}, {"time": 1893, "text": "Duplicate and exceed when you're communicating to these young athletes."}, {"time": 1898, "text": "And because of that experience, that makes Terry a better coach."}, {"time": 1901, "text": "Because of, you know, 1995, that makes me a better coach."}, {"time": 1906, "text": "You know, realizing that there are certain things that unraveled in that year that I could have controlled looking back on it."}, {"time": 1914, "text": "And when you have that perspective, you can communicate."}, {"time": 1919, "text": "So what control is there?"}, {"time": 1921, "text": "Can you control everything?"}, {"time": 1922, "text": "How big of a role is luck?"}, {"time": 1924, "text": "Control how you react to an injury, control that."}, {"time": 1929, "text": "So you can't, you don't have any control over it."}, {"time": 1930, "text": "It's over, you know, you have whatever and whatever happened, but relax."}, {"time": 1938, "text": "And you learn to deal with injuries better because of that."}, {"time": 1940, "text": "You have that experience that you let this thing maybe get the best of you."}, {"time": 1945, "text": "And that's just an example."}, {"time": 1947, "text": "And, you know, Terry put a lot of demons to rest with that bronze medal."}, {"time": 1954, "text": "So becoming an Olympic medalist, a few demons could relax."}, {"time": 1958, "text": "Well, a little, he will never admit that."}, {"time": 1960, "text": "And he probably isn't truthful."}, {"time": 1962, "text": "And I should, I'm speaking for him, but he's truthful when he says that."}, {"time": 1965, "text": "But if I look at it and bronze sucks, but if I look at it, he did put some demons to rest and I'm proud of him for it."}, {"time": 1976, "text": "There's something there that is a consolation in the fact that he won the consolation medal."}, {"time": 1984, "text": "The consolation medal sucks, but there is a consolation that he won the consolation medal."}, {"time": 1988, "text": "That's a tough medal to win, by the way."}, {"time": 1991, "text": "But do you see the Shakespearean tragedy of it all that the line between winning and losing?"}, {"time": 1998, "text": "So you often say that, you know, winning is everything, but it feels like, especially at the Olympic level, or you talk about NCAA finals or that tournament, you know, a split second miss move can result in a loss where you dominated all the way up to there."}, {"time": 2017, "text": "That's where your psychology comes in."}, {"time": 2019, "text": "And that's where the repetition and all of the self talk and visualization and the physical shape and everything comes together."}, {"time": 2027, "text": "And so that doesn't happen."}, {"time": 2029, "text": "And tonight, we got beat twice, actually three times, and we out wrestled those."}, {"time": 2035, "text": "We lost three matches and we out wrestled the guy for six minutes and 30 seconds, or one match went to overtime."}, {"time": 2044, "text": "And if our guys can move forward with the right perspective, I'm confident that they'll be better."}, {"time": 2051, "text": "I'll tell you what, I'd take our guy over their guy any day, any day, because our guys get up for every match."}, {"time": 2057, "text": "And now we got a lot to work on."}, {"time": 2060, "text": "A lot to work on."}, {"time": 2062, "text": "I can say all that and I'll take our guy and blah, blah, blah."}, {"time": 2066, "text": "But what are they going to do tonight in their meal?"}, {"time": 2068, "text": "What are they going to do tonight in their rest?"}, {"time": 2070, "text": "What are they going to do tomorrow in their recovery on their own, necessarily?"}, {"time": 2075, "text": "What are they going to do Monday?"}, {"time": 2077, "text": "Great wrestlers can use their imagination with a win that they're not satisfied with and go forward as if it was a loss."}, {"time": 2089, "text": "But it's still easier to go forward with that win."}, {"time": 2092, "text": "But they can, they don't just, oh, I won, I'm fine, goes on."}, {"time": 2096, "text": "But then when they lose the exact same way that they could have lost before, then they go off the deep end."}, {"time": 2102, "text": "And then that's when they lose."}, {"time": 2103, "text": "They could have lost before, then they go off the deep end and then that's when they're going to make the change in their life."}, {"time": 2108, "text": "And we talked about that to our team tonight."}, {"time": 2112, "text": "And the mature, rare ingredient is, is guys that can get better even with success like it was a loss without beating themselves up."}, {"time": 2124, "text": "That's complicated."}, {"time": 2126, "text": "You often talk about Iowa's focus on creating individual champions like Spencer Lee."}, {"time": 2134, "text": "Can you explain the philosophy of focusing on individuals versus the team?"}, {"time": 2139, "text": "I think that we need to put them both together and the individual impacts the team."}, {"time": 2145, "text": "And, you know, we haven't done that since 2010 and we need to do a better job of putting 10 weight classes out there that contribute to the team."}, {"time": 2157, "text": "And if it's not 10, then it's nine."}, {"time": 2159, "text": "And if it's not nine, it can't be four, you know?"}, {"time": 2163, "text": "And that takes a lot of pride and it takes a lot of, you know, where the coach is on top of it."}, {"time": 2172, "text": "And, you know, you're not just working on the easy things, the glaring things."}, {"time": 2179, "text": "You're working on everything."}, {"time": 2181, "text": "What do you mean by everything?"}, {"time": 2182, "text": "So, the... Like there's just some, you know, there's ideas that when you're a coach that aren't there beneath the surface and you got to find them."}, {"time": 2196, "text": "And that's where communication comes in."}, {"time": 2198, "text": "But you're talking about, yeah, we got to move forward."}, {"time": 2203, "text": "Well, I know what that means."}, {"time": 2205, "text": "But how many guys really know what that means in their program?"}, {"time": 2212, "text": "You know, there's so many levels of that."}, {"time": 2215, "text": "You've said before that winning is everything and that means people lose."}, {"time": 2220, "text": "Most people lose, you know, there's really in whatever the context is only one winner."}, {"time": 2226, "text": "In many parts of our world today, outside of wrestling, that concept, the brutal honesty of that is uncomfortable for people."}, {"time": 2232, "text": "So, how do you think about this very philosophical, difficult concept of, you know, there only being one winner, that winning is everything, this kind of really painful idea?"}, {"time": 2247, "text": "I don't think that that's a bad thing to have that mentality."}, {"time": 2251, "text": "I mean, I think Akutukov, I remember a story I read about him."}, {"time": 2256, "text": "He comes to mind."}, {"time": 2257, "text": "You know, Sargush, I remember when he lost in London and I remember the look on his face."}, {"time": 2265, "text": "And those are some of the greatest wrestlers in the history of the sport, freestyle wrestling."}, {"time": 2269, "text": "And, you know what?"}, {"time": 2272, "text": "It's what works for you."}, {"time": 2274, "text": "You can talk about being at peace with your results and that the approach is and the journey is what it's about."}, {"time": 2281, "text": "But, and that's great and that relaxes some champions and that makes some champions really, really tick, but not everybody."}, {"time": 2291, "text": "So, it's okay, it's okay."}, {"time": 2294, "text": "And if that wigs you out and that really makes you uptight, then go the other route."}, {"time": 2300, "text": "You have to find what works for you."}, {"time": 2303, "text": "If you're lazy, forget it, forget it."}, {"time": 2306, "text": "So, you and Terry, but in general, how do you find the line between extremely physical, extreme physical wrestling and rough wrestling or angry wrestling?"}, {"time": 2317, "text": "So, to which degree has anger, whether it's in your wrestling room these days or in your own career, entered wrestling?"}, {"time": 2323, "text": "Do you see it as a tool that can be used in the wrestling match?"}, {"time": 2327, "text": "I think there's a balance or not even a balance."}, {"time": 2330, "text": "There's a lot of balance in the wrestling world."}, {"time": 2332, "text": "I think there's a balance or not even a balance, there's a line that you go up to and you can't cross it."}, {"time": 2339, "text": "Sportsmanship is everything."}, {"time": 2341, "text": "You can get dinged for points."}, {"time": 2342, "text": "You can get thrown out of tournaments."}, {"time": 2345, "text": "There's rules with flagrant misconduct where you're kicked out of the match, other team gets the points and then you have to sit the next meet."}, {"time": 2355, "text": "So, it's very serious."}, {"time": 2357, "text": "The NCAA sends a message, a very serious message about sportsmanship."}, {"time": 2363, "text": "And so, we talk about that."}, {"time": 2364, "text": "The other thing with wrestling is there's rules in wrestling."}, {"time": 2367, "text": "These guys that are tough guys outside of the rules, that's what you want in your opponent."}, {"time": 2374, "text": "That means they're frustrated."}, {"time": 2378, "text": "You got to be a tough guy inside the rules of the sport."}, {"time": 2383, "text": "That's more honorable than cold cocking somebody and knocking them out."}, {"time": 2387, "text": "So, yeah, anger doesn't mean breaking the rules."}, {"time": 2389, "text": "But I mean, you know, a lot of people know you just watching you as a coach."}, {"time": 2394, "text": "There's quite a bit of passion there."}, {"time": 2396, "text": "Well, come and do what you're doing tonight."}, {"time": 2398, "text": "I mean, break bread with me in my kitchen and see how big of a jackass I am."}, {"time": 2401, "text": "Now, you're a pretty nice guy."}, {"time": 2403, "text": "Well, I'm not asking for that necessarily, but thanks."}, {"time": 2405, "text": "I'm saying, you know what, as a coach, I mean, okay, come spend a month in our program and you'll see really what kind of people we are."}, {"time": 2415, "text": "And there's a stigma out there because they are very threatened by our program."}, {"time": 2420, "text": "There's nobody else that threatens the sport of wrestling like we do."}, {"time": 2425, "text": "And that's the truth."}, {"time": 2426, "text": "There's a legend to Iowa wrestling."}, {"time": 2429, "text": "There's one of the most intimidating."}, {"time": 2431, "text": "There's a legend to John Smith."}, {"time": 2435, "text": "They get up for John Smith."}, {"time": 2437, "text": "They get up for Oklahoma State."}, {"time": 2439, "text": "They get up for Penn State."}, {"time": 2442, "text": "My question is, okay, I'll answer it."}, {"time": 2444, "text": "I'll answer it this way."}, {"time": 2445, "text": "I'll give you an example in my coaching career."}, {"time": 2448, "text": "I coached at Virginia Tech for 22 months."}, {"time": 2452, "text": "We recruited the number one recruiting class."}, {"time": 2454, "text": "We got the administration to change 100% 180 how they looked at wrestling."}, {"time": 2461, "text": "And because of how serious we were and because we weren't idiots, we were able to do that with our administration."}, {"time": 2469, "text": "But my point is this, we tried to win."}, {"time": 2472, "text": "We tried to win, even at Virginia Tech."}, {"time": 2474, "text": "It wasn't a stepping stone for me."}, {"time": 2475, "text": "It ended up being one quickly and looking back on it."}, {"time": 2478, "text": "I was a fool to think that I'd be there for 20 years."}, {"time": 2481, "text": "But you believed you would be."}, {"time": 2486, "text": "So do you remember a time that you really pushed yourself to your limits?"}, {"time": 2492, "text": "So Gable talks about having to be carried off the mat."}, {"time": 2495, "text": "Have you really found that level?"}, {"time": 2497, "text": "I said something about that too in a book and I think I was mistaken."}, {"time": 2501, "text": "A book and I think I was misquoted one time."}, {"time": 2504, "text": "And actually it was Gable's quote."}, {"time": 2505, "text": "And I was trying to make the point that Gable's quote was like this."}, {"time": 2510, "text": "And they were making it like it was my own words."}, {"time": 2513, "text": "I think it was a first wrestling tough book, but it's a good book."}, {"time": 2518, "text": "But the story is Gable's."}, {"time": 2520, "text": "And I don't know if there's anybody that has done that besides him."}, {"time": 2526, "text": "And I think that's a very rare quality."}, {"time": 2528, "text": "But I've definitely been in that nirvana level of, you know, you could go all day long."}, {"time": 2537, "text": "And it doesn't, you have to shoot me to stop me."}, {"time": 2541, "text": "But there's a balance because you're not going hard with and holding your breath."}, {"time": 2545, "text": "It's not a, it's a relaxed and like you got a guy cornered and who's most dangerous?"}, {"time": 2554, "text": "Well, the guy that's cornered."}, {"time": 2556, "text": "And so that's where you relax, I'm not bum rushing him."}, {"time": 2560, "text": "I'm relaxed."}, {"time": 2560, "text": "I'm still moving, fake and very fluid."}, {"time": 2563, "text": "Guy falls down his face."}, {"time": 2564, "text": "I run around behind him."}, {"time": 2565, "text": "That's offense."}, {"time": 2567, "text": "You don't have to just grunt to the leg and call that offense."}, {"time": 2572, "text": "Offense is a in and out, smooth."}, {"time": 2576, "text": "Now you sound like a Russian wrestler."}, {"time": 2579, "text": "Well, that's, they're the best in a certain light, looking at the history of wrestling."}, {"time": 2584, "text": "Wrestling is much bigger than folk style, freestyle, Greco."}, {"time": 2587, "text": "It's, it's one of the oldest forms of combat period."}, {"time": 2591, "text": "There's been cave drawings 15,000 years ago."}, {"time": 2594, "text": "Do you ever see, so you're, you're, uh, one of the great coaches of all time."}, {"time": 2599, "text": "You're now focused on a particular rule style right now, but do you ever see wrestling as bigger than all of the, this, you know, as, as, uh, one of the pure combats?"}, {"time": 2609, "text": "I do, and we're raising $20 million for a facility to make it the best facility on the planet."}, {"time": 2614, "text": "We have a vision to build the best facility on planet earth and put the best wrestlers in it."}, {"time": 2621, "text": "And that is bigger than wrestling."}, {"time": 2625, "text": "It's for the university of Iowa and our donors are doing it for the university of Iowa, but it is about the value of wrestling to me."}, {"time": 2635, "text": "Also, there is so much value to wrestling blind, blind people don't play football."}, {"time": 2641, "text": "They wrestle blind people, don't play basketball."}, {"time": 2644, "text": "I mean, maybe they do, but it'd be very difficult."}, {"time": 2648, "text": "They can wrestle."}, {"time": 2649, "text": "Wrestling is a field sport."}, {"time": 2652, "text": "There's no ball."}, {"time": 2654, "text": "It's just two guys or two girls and that's it."}, {"time": 2657, "text": "And, and you, I mean, I'm not going to say you can't because somebody will get a hold of this and I'll get an email or a letter that says, you said blind people can't play baseball and blah, blah."}, {"time": 2667, "text": "I'm just saying that blind people can wrestle very effectively."}, {"time": 2671, "text": "I've wrestled with, with my eyes shut."}, {"time": 2673, "text": "I mean, was honest about it too."}, {"time": 2675, "text": "And it was, I was effective."}, {"time": 2678, "text": "So why, why was I able to be effective?"}, {"time": 2680, "text": "Because wrestling is a, is a, is a sport that you, you can overcome a lot, your demons that you're overcoming, they're not limited with whether I'm blind or not."}, {"time": 2694, "text": "The demons that are overcoming are inside you."}, {"time": 2696, "text": "You have to overcome those demons from within."}, {"time": 2699, "text": "So what's the future of Iowa wrestling look like with this facility and this momentum you have now and this great group of guys you have now?"}, {"time": 2706, "text": "We have a good young group of guys and, um, you know, there is a lot of buzz in the program."}, {"time": 2714, "text": "And probably hasn't been this much buzz for quite some time."}, {"time": 2718, "text": "And our job is to, you know, be relaxed and be focused and not get caught up in the buzz."}, {"time": 2727, "text": "Um, but we have to put it together and we have a catalyst Spencer Lee, but he's going to have to, he's going to have to get better."}, {"time": 2734, "text": "And we have some other catalysts as well that are, um, you know, going to help us in the future."}, {"time": 2739, "text": "Um, but they got to get better."}, {"time": 2744, "text": "And so all this stuff about independence and accountability and, you know, being able to get better every day under duress and not knowing that you're getting better, but you are, you know, you know what that, you know what I mean by that?"}, {"time": 2761, "text": "Like the great thing about Gabo was wrestling for him was, is you were getting better and you didn't know you were getting better."}, {"time": 2767, "text": "Well, yeah, just like you said, uh, grow from success."}, {"time": 2770, "text": "So even you, you never allow yourself to think that you're, that you're, you're getting good."}, {"time": 2776, "text": "All of a sudden you do something in the practice room that you've been working on and all of a sudden you hit it and it's like, it was automatic."}, {"time": 2782, "text": "And then that, you know, yeah, that multiplies success."}, {"time": 2786, "text": "And so if I may say, so you're a bit of a man of the Bible."}, {"time": 2791, "text": "What's, where do you go, what do you go to the Bible for your faith, strength, love, patience?"}, {"time": 2799, "text": "I talked about things that you can't control."}, {"time": 2801, "text": "You turn them over."}, {"time": 2803, "text": "So the biggest thing for me is I got to turn over the things that I can't control, turn them over to that power and I'm going to be a lot better off."}, {"time": 2812, "text": "And that's the reason why I'm not in the funny farm because very competitive to me."}, {"time": 2818, "text": "It's very serious that we, we know that these young wrestlers come to school here to be the best that they can be and to accomplish goals that like me, when I was young, they've set out to accomplish and they chose Iowa to do that."}, {"time": 2834, "text": "So we have to deliver."}, {"time": 2836, "text": "And because of that, um, peace with God, you know, it's peer, it's a peer motivation."}, {"time": 2846, "text": "It's a peer motivation and it's a peer platform."}, {"time": 2851, "text": "It's not, it's not doing this for my ego."}, {"time": 2856, "text": "We're not corrupt people."}, {"time": 2857, "text": "We're not liars and cheaters."}, {"time": 2860, "text": "And so often that gets in the way of a decent person."}, {"time": 2866, "text": "First and foremost, you're a good person and God helps you be that."}, {"time": 2871, "text": "And we're serious about wrestling."}, {"time": 2875, "text": "So a couple more questions."}, {"time": 2878, "text": "What's the role of family in wrestling?"}, {"time": 2881, "text": "You mentioned your wife, who I read, uh, turned you down when you asked her for a phone number, said it's in the phone book."}, {"time": 2890, "text": "That's pretty smooth."}, {"time": 2891, "text": "Her story of that is that she didn't want me to have to remember the number."}, {"time": 2896, "text": "And I say at this point, and I say, there's no way."}, {"time": 2901, "text": "And I remember it very clearly like, Hey, it's in the phone book."}, {"time": 2904, "text": "And I was like, okay, she's blowing me off."}, {"time": 2908, "text": "But luckily here's the thing with family."}, {"time": 2910, "text": "I mean, we, we have great people in our program."}, {"time": 2913, "text": "We have great parents."}, {"time": 2914, "text": "We have a culture of parents that that's part of the buzz."}, {"time": 2919, "text": "And this class that you see wrestling right now, that's been here a year now, um, Lee, Mirren, Costello, Warner, and then Lugo was a transfer and I'm forgetting somebody."}, {"time": 2929, "text": "I don't want to forget anybody, but, um, these parents are phenomenal."}, {"time": 2933, "text": "And that's a different parental culture."}, {"time": 2936, "text": "Um, so the Kemmerer's dad is the same and, and, um, so there's a lot of good there."}, {"time": 2942, "text": "And that, that's a big, that's a big, a big move because how we talk to parents, we don't talk to parents to get along with them."}, {"time": 2950, "text": "We talk to parents to help them understand, you know, where we're at with their sons."}, {"time": 2955, "text": "And when you can have a direct conversation with a parent who helping his son or her son, the mom helping her son to be accountable and to own it, then you can get a lot accomplished."}, {"time": 2968, "text": "And that's what we've been able to do."}, {"time": 2969, "text": "And so you're solving problems."}, {"time": 2971, "text": "Like I talked about earlier, um, that's part of the family."}, {"time": 2974, "text": "The other part of the family is the coaches, um, are like family."}, {"time": 2978, "text": "The other part of the family is the coaches, uh, significant others and wives are part of the family."}, {"time": 2985, "text": "And we fed, you know, we fed 40 guys and an entire coaching staff and wives and their children here at Thanksgiving, and that equals 70 people."}, {"time": 2997, "text": "And it's, it's fun."}, {"time": 3001, "text": "So family means administration."}, {"time": 3004, "text": "Gary Varda, my, my athletic director gives us everything that we need to be successful."}, {"time": 3009, "text": "And he has an open mind for, for the sport of wrestling and wrestling is important in Iowa."}, {"time": 3014, "text": "So that's a no brainer, but not if you're not a wrestling guy, but he sees we do it the right way."}, {"time": 3020, "text": "And so the commitment is there from him."}, {"time": 3023, "text": "If we were doofuses, you know, he, the commitment wouldn't be there."}, {"time": 3028, "text": "So family is, everybody's all in, I mean, it's from the wrestlers to the family."}, {"time": 3032, "text": "It goes back to what I said earlier about our people."}, {"time": 3035, "text": "Our people are great."}, {"time": 3036, "text": "Ryan Morty Star is great."}, {"time": 3037, "text": "Bobby Telford is great."}, {"time": 3039, "text": "Bobby Telford took over for a guy named Ben Burhow, who is great."}, {"time": 3044, "text": "Our medical team is great."}, {"time": 3045, "text": "Dr. Westerman, Dr. Wolf, Jesse Donaworth, our athletic trainer is great."}, {"time": 3053, "text": "Terry Brands is great."}, {"time": 3055, "text": "Mariah Stickley and, and Elise Owens, our managers are great."}, {"time": 3059, "text": "My daughter's a manager as well."}, {"time": 3060, "text": "They're, they're hardworking young women."}, {"time": 3063, "text": "Our rest, our Hawkeye Wrestling Club is, is where it needs to be in terms of how they help in their role."}, {"time": 3071, "text": "And now we have four women in there and that's great."}, {"time": 3076, "text": "And, you know, at least one of their dads is super involved with us."}, {"time": 3080, "text": "But, and so it's, one thing that I've learned is that you have to have that."}, {"time": 3086, "text": "And if you don't have that, then you have to address it quickly."}, {"time": 3091, "text": "And those outliers, you know, let's solve that problem."}, {"time": 3094, "text": "Let's get it out in the open here."}, {"time": 3096, "text": "And if they're, you know, if it doesn't work out, it's not going to work out."}, {"time": 3099, "text": "That's a heck of a Thanksgiving dinner."}, {"time": 3102, "text": "Next year."}, {"time": 3103, "text": "Well, I don't know if it'd be legal, but I'd have to check with our compliance and, you know, they'd have to vet you."}, {"time": 3109, "text": "You could come, you can come and see what it's all about."}, {"time": 3112, "text": "This room is full."}, {"time": 3117, "text": "Well, yeah, I'll be back next year then."}, {"time": 3121, "text": "In 2014, I watched this video four years ago of you competing in, I believe, your first swim meet against your brother, Terry."}, {"time": 3134, "text": "And you came out victorious."}, {"time": 3139, "text": "So let's, did you cheat?"}, {"time": 3141, "text": "Here's what happened."}, {"time": 3142, "text": "I had researched this thing because I'm, that's how I am."}]}]