[{"title": "John Danaher: The Path to Mastery in Jiu Jitsu, Grappling, Judo, and MMA | Lex Fridman Podcast #182", "id": "ktuw6Ow4sd0", "quotes": [{"time": 250, "text": "You wake up in the morning, you're alive again."}, {"time": 253, "text": "But it's not about the sleeping."}, {"time": 255, "text": "It's about the falling asleep."}, {"time": 257, "text": "And every night when you fall asleep, you assume you're going to wake up."}, {"time": 262, "text": "Here you know you're not waking up."}, {"time": 265, "text": "And the knowledge of that."}, {"time": 266, "text": "But there's a whole step from that to the idea of fearing it."}, {"time": 269, "text": "I'm fully aware that there's gonna be a time I don't wake up."}, {"time": 273, "text": "But are you gonna be afraid of it?"}, {"time": 274, "text": "Is there some mortal terror you have of this?"}, {"time": 276, "text": "No, you didn't have it before."}, {"time": 278, "text": "You don't have it when you sleep."}, {"time": 280, "text": "Going from the fact that you know you won't wake up to terror is two different things."}, {"time": 285, "text": "That's an extra step."}, {"time": 286, "text": "And at that point, you're making a choice at that point."}, {"time": 290, "text": "What about what some people in this context we might call like the third death, which is when everybody forgets the entirety of consciousness in the universe forgets that you've ever existed, that John Donahue ever existed."}, {"time": 308, "text": "It's almost like a cosmic death."}, {"time": 309, "text": "It's like everything goes, yeah."}, {"time": 312, "text": "Not just, I would say it's like knowledge."}, {"time": 315, "text": "The history books forget about who you are because the history books."}, {"time": 319, "text": "This is inevitable, by the way."}, {"time": 320, "text": "We're all very, very small players in a very big game."}, {"time": 323, "text": "And inevitably, we're all going to go at some point."}, {"time": 328, "text": "Yeah, but doesn't, so you're."}, {"time": 331, "text": "It's disappointing, of course."}, {"time": 333, "text": "But it's not even, it would be arrogance to say I'm disappointed in the idea that I will disappear."}, {"time": 340, "text": "But there's far greater things than me that will disappear."}, {"time": 343, "text": "I mean, it's crushing to think that there's going to come a time where no one will ever hear Beethoven's symphonies again."}, {"time": 351, "text": "That the mysteries of the pharaohs will be lost and no one will even comprehend that they once existed."}, {"time": 357, "text": "Humanity has come up with so many amazing things over its existence."}, {"time": 362, "text": "And to think that one day this is just all happening on a tiny speck in a distant corner of a very small galaxy and among millions of galaxies, that this is all for nothing."}, {"time": 375, "text": "Okay, I can understand."}, {"time": 376, "text": "There's a kind of dread that comes with this."}, {"time": 380, "text": "But there's also a sense in which the moment you're born and the moment you can think about these things, you know this is your inevitable fate."}, {"time": 386, "text": "Is it so inevitable?"}, {"time": 388, "text": "So if we look at, we're in Austin and there's a guy named Elon Musk."}, {"time": 392, "text": "And he's hoping, in fact, that is the drive behind many of his passions, is the human beings becoming a multi planetary species and expanding out, exploring and colonizing the solar system, the galaxy, and maybe the rest of the universe."}, {"time": 408, "text": "Is that something that fills you with excitement?"}, {"time": 412, "text": "As a project, it's very exciting."}, {"time": 416, "text": "The whole, I mean, we all grew up with science fiction, the idea of exploration."}, {"time": 422, "text": "The same way human beings in earlier centuries were thrilled at the idea of discovering a new world, you know, America or some other part of the world that they sail to and come back."}, {"time": 433, "text": "But now instead of sailing oceans, you're sailing solar systems and ultimately even further."}, {"time": 440, "text": "So of course that's exciting."}, {"time": 441, "text": "But as far as relieving us from non existence, it's just playing a delaying game because ultimately, even the universe itself, if the laws of thermodynamics are correct, will ultimately die."}, {"time": 453, "text": "Of course, we might not understand most of the physics and how the universe functions."}, {"time": 462, "text": "You said laws of thermodynamics, but maybe that's just a tiny little fraction of what the universe actually is."}, {"time": 469, "text": "Maybe there's multiple dimensions, maybe there's multiple universes, maybe the entirety of this experience."}, {"time": 475, "text": "You know, there's guys like Donald Hoffman that think that all of this is just an illusion that we don't, like human cognition and perception constructs a whole, it's like a video game that we construct that's very distant from the actual reality."}, {"time": 488, "text": "And maybe one day we'll understand that reality, maybe it'll be like the matrix kind of thing."}, {"time": 492, "text": "So there's a lot of different possibilities here."}, {"time": 495, "text": "And there's also a philosopher named Ernest Becker."}, {"time": 500, "text": "He wrote Denial of Death."}, {"time": 502, "text": "And his idea, he disagrees with you, but he's dead now, is that he thinks that the terror of death, the terror of the knowledge that we're going to die is within all of us and is in fact the driver behind most of the creativity that we do."}, {"time": 521, "text": "Exploring out into the universe, but also you becoming one of the great scholars of the martial arts, the philosophers of fighting is because you're actually terrified of death and you want to somehow permeate your knowledge, your ideas, your essence to permeate human civilization so that even when your body dies, you live on."}, {"time": 550, "text": "I would agree with him insofar as death is the single greatest motivator for action."}, {"time": 558, "text": "But going beyond that and saying it's somehow terrifying, that's an extra step on his part."}, {"time": 564, "text": "And not everyone's going to follow him on that step."}, {"time": 567, "text": "I do believe that death is the single most important element in life that gives value to our days."}, {"time": 577, "text": "If you think, for example, of a situation where a God came to you and gave you immortality, life would be very, very different for you."}, {"time": 589, "text": "You're a talented research scientist, you work to a schedule."}, {"time": 596, "text": "Because ultimately you know your life is finite and actually very finite."}, {"time": 602, "text": "And could be even more so if fate plays its hand and you die an early death or what have you."}, {"time": 608, "text": "We never know what's going to happen tomorrow."}, {"time": 613, "text": "As such, we get work done as soon as we can."}, {"time": 618, "text": "The moment you gain immortality, you can always put every project off."}, {"time": 623, "text": "You can always say, I don't need to do this today because I can do it four centuries from now."}, {"time": 630, "text": "And as you extend artificially a human life, the motivation to get things done here and now and work industriously and excel fades away because you can always come back to the idea that you can do this in the future."}, {"time": 645, "text": "And so what gives value to our days is ultimately death."}, {"time": 649, "text": "And value, it's not the only reason behind value, but a huge part of what we consider value is scarcity."}, {"time": 659, "text": "And death gives us scarcity of days and is probably the single greatest motivator for almost every action we partake in."}, {"time": 668, "text": "It's kind of tragic and beautiful that what makes things amazing is that they end."}, {"time": 679, "text": "Yeah, I think it would actually be a terrible burden to be immortal."}, {"time": 687, "text": "Life would be in many ways very hollow and meaningless, I think."}, {"time": 690, "text": "People talk about death taking away the meaning of life, but I think immortality would have a very similar effect in a different direction."}, {"time": 702, "text": "So given this short life, we can think about jujitsu, we can think about any kind of pursuit."}, {"time": 711, "text": "What do you think makes a great life?"}, {"time": 714, "text": "Is it the highest peak of achievement?"}, {"time": 720, "text": "You know, you think about like an Olympic gold medal, the highest level of performance, or is it the longevity of performance, of doing many amazing things and doing it for a long time?"}, {"time": 732, "text": "I think the latter is kind of what we talk about in at least American society."}, {"time": 738, "text": "You know, we want people to be healthy, balanced, perform well for a long time."}, {"time": 745, "text": "And then there's maybe like the gladiator ethic, which is the highest peak is what defines."}, {"time": 753, "text": "You asked an initial question, which what makes a great life, but then pointed towards two options, one of longevity versus degree of difficulty."}, {"time": 763, "text": "There's gotta be a lot more than that, surely."}, {"time": 767, "text": "I mean, think about, first of all, we have to understand from the start that there's never gonna be an agreed upon set of criteria for this is a great life from all perspective."}, {"time": 778, "text": "If you look from the perspective of, say, Machiavelli, then Stalin lived a great life."}, {"time": 784, "text": "He was highly successful at what he did."}, {"time": 787, "text": "He started from nothing."}, {"time": 788, "text": "So the degree of difficulty in what he did was extraordinarily high."}, {"time": 792, "text": "He had massive impact upon world history."}, {"time": 795, "text": "He oversaw the defeat of almost all of his major enemies."}, {"time": 800, "text": "He lived to old age and died of natural causes."}, {"time": 803, "text": "So from Machiavelli's point of view, he had a great life."}, {"time": 806, "text": "If you ask the Ukrainian farmer in the 1930s whether he lived a great life, you get a very different answer."}, {"time": 813, "text": "So everything's gonna come from what perspective you begin with this."}, {"time": 817, "text": "You're going to look out at the world with a given point of view, and you're gonna make your judgments."}, {"time": 821, "text": "Was this a great life or was this a terrible life?"}, {"time": 825, "text": "Going back to your point, you were actually, I think, focusing the question on more in terms of great single performances versus longevity of performances."}, {"time": 838, "text": "Presumably, this isn't really a question about what makes a great life, then, because there's so much more than that to a great life."}, {"time": 847, "text": "I'm gonna push back on that."}, {"time": 848, "text": "So I think the parallels are very much closer than you're making them seem."}, {"time": 853, "text": "I think, let's compare Stalin."}, {"time": 854, "text": "Stalin is an example of somebody who held power, considered by many to be one of the most powerful men ever."}, {"time": 862, "text": "He held power for 30 years."}, {"time": 864, "text": "So that's what I'm referring to, longevity."}, {"time": 866, "text": "And then there's a few people, I wish my knowledge of history was better, but people who fought a few great battles, and they did not maintain power, but they were."}, {"time": 877, "text": "Let's contrast, say, for example, Alexander the Great, who died at 33 from probably unnatural causes, had around four to five truly defining battles in his life, which responsible for the lion's share of his achievements, and burned very bright, but didn't burn long."}, {"time": 904, "text": "Stalin, on the other hand, started from nothing, and quietly, methodically worked his way through the revolutionary phase, and gained increasing amounts of power, and as he said, went all the way to the end of his career."}, {"time": 921, "text": "Yeah, there's definitely something to be said for longevity, but as to which one is greater than the other, you can't give a definition, or a set of criteria, which will definitively say this is better than that."}, {"time": 939, "text": "But when you look..."}, {"time": 940, "text": "Ultimately, we look at Alexander as great, but in a different way, and we look at Stalin."}, {"time": 944, "text": "I didn't think many people would say Stalin was a great person, but from the Machiavellian point of view, you would say he was great also."}, {"time": 953, "text": "But when you think about beautiful creations done by human beings in the space of, say, martial arts, in the space of sport, what inspires you, the peak of performance?"}, {"time": 966, "text": "I see where you're coming from."}, {"time": 970, "text": "For me, it always comes down to degree of difficulty, but things are difficult in different ways, okay?"}, {"time": 977, "text": "A single, flawless performance in youth is still that wins a gold medal."}, {"time": 985, "text": "Let's say, for example, Nadia Comaneci won the Olympic gold medal in gymnastics, the first person ever to get a perfect score."}, {"time": 994, "text": "If she had disappeared after that, we would still remember that as an incredible moment."}, {"time": 999, "text": "And the degree of difficulty to get a perfect score in Olympic gymnastics is just off the charts."}, {"time": 1006, "text": "And contrast that with someone who went to four Olympics and got four silver medals."}, {"time": 1012, "text": "I mean, they're both incredible achievements."}, {"time": 1013, "text": "They're just different."}, {"time": 1016, "text": "The attributes that lead to longevity typically tend to conflict with the attributes that bring a powerful, single performance."}, {"time": 1025, "text": "One is all about focus on a particular event."}, {"time": 1028, "text": "The other is on spreading your resources over time."}, {"time": 1033, "text": "Both present tremendous difficulties."}, {"time": 1037, "text": "There's no need to say one is better than the other."}, {"time": 1039, "text": "There's also just, for me personally, the stories of somebody who truly struggled are the most powerful."}, {"time": 1049, "text": "I know a bunch of people don't necessarily agree, because you said perfection."}, {"time": 1053, "text": "Perfection is kind of the antithesis of struggle."}, {"time": 1057, "text": "But I look at somebody, okay, my own life, somebody I'm a fan, oh, I'm a fan of everybody."}, {"time": 1061, "text": "I'm a huge fan of yours."}, {"time": 1062, "text": "I'm trying not to be nervous here."}, {"time": 1064, "text": "But somebody I'm a fan of in the judo world is Travis Stevens."}, {"time": 1069, "text": "He's a remarkable fellow, by the way."}, {"time": 1070, "text": "A remarkable human being."}, {"time": 1072, "text": "Insane in the best kinds of ways."}, {"time": 1074, "text": "I think I started judo, I really started martial arts."}, {"time": 1079, "text": "I wrestled, if you consider those martial arts."}, {"time": 1080, "text": "That's been in my blood."}, {"time": 1083, "text": "I'm Russian, so."}, {"time": 1084, "text": "But beyond that, the whole pajama thing we wear, the gi, I started by watching Travis in 2008 Olympics."}, {"time": 1092, "text": "Was that accidental, or did you know Travis prior to watching him?"}, {"time": 1096, "text": "No, no, no, I just tuned in."}, {"time": 1097, "text": "Now, that's an unusual choice."}, {"time": 1099, "text": "It was just random, you just tuned in and you saw Travis Stevens."}, {"time": 1102, "text": "I tuned in to the Olympics, and I was wondering what judo is."}, {"time": 1106, "text": "And then I started watching."}, {"time": 1110, "text": "We're all proud of our countries and so on, so I started watching."}, {"time": 1113, "text": "He was, I think, the only American in the Olympics for judo."}, {"time": 1119, "text": "Maybe the, so this Kayla Harrison was 2012."}, {"time": 1124, "text": "Rhonda was there too, so I watched Rhonda and Travis."}, {"time": 1127, "text": "But obviously, sort of, I was focused on somebody who also weighed the same as I did, so there was a kinda, I think, 81 kilograms."}, {"time": 1137, "text": "So there's a connection, but also there's an intensity to him, like, he would get angry at his own failures and he would just refuse to quit."}, {"time": 1147, "text": "It's that kinda Dan Gable mentality."}, {"time": 1150, "text": "I just, that was inspiring to me, that he's the underdog."}, {"time": 1154, "text": "And the way people talk about him, the commentators, that it was an unlikely person to do well, right?"}, {"time": 1161, "text": "And I, the FU attitude behind that, saying, no, I'm gonna still win gold."}, {"time": 1167, "text": "Obviously, he didn't do well in 2008, but that was somehow inspiring."}, {"time": 1173, "text": "And I just remember he pulled me in, but then I started to see this sport, I guess you can call it, of effortlessly dominating your opponent in throwing."}, {"time": 1188, "text": "Because to me, wrestling was like a grind."}, {"time": 1192, "text": "You kind of control, you slowly just break your opponent."}, {"time": 1196, "text": "The idea that you could, with like a foot sweep, was fascinating to me, that just because of timing, you can take these like monsters, giant people, like incredible athletes, and just smash them."}, {"time": 1214, "text": "With, it just doesn't, there was no struggle to it."}, {"time": 1218, "text": "It was always like a look of surprise."}, {"time": 1219, "text": "Judo, dominance in Judo has a look, like the other person is like, what just happened?"}, {"time": 1227, "text": "This is very different from wrestling."}, {"time": 1228, "text": "It's built into the rule structure too, the whole idea of an epon, of a match being over in an instant."}, {"time": 1234, "text": "And that creates a thrilling spectator sport, because you can, as you say, with Ashiwaza, the foot sweeps, you can take someone out who's heavily favored, and if you're not, Judo is the most unforgiving of all the grappling sports."}, {"time": 1253, "text": "If you have a lapse of concentration for half a second, it's done, it's over."}, {"time": 1259, "text": "If those guys get a grip on each other, any one of them can throw the other."}, {"time": 1265, "text": "The idea, when you see someone like Nomura, who won three Olympic gold medals, to win across three Olympics, and that's an incredible achievement, given how many ways there are to lose in the standing position in Judo, and how unforgiving it is as a sport, it shows an incredible level of dominance."}, {"time": 1322, "text": "And now, Travis was always going for, he's of course really good at gripping and couldn't do that whole game, but he was going for the big throws."}, {"time": 1332, "text": "And he was almost getting frustrated by a lot of the opponents."}, {"time": 1337, "text": "I remember Ola Bischoff, I think."}, {"time": 1341, "text": "Yes, from Germany."}, {"time": 1343, "text": "From Germany."}, {"time": 1344, "text": "Very talented."}, {"time": 1345, "text": "Very incredible."}, {"time": 1346, "text": "I know he's very good at doing big throws and he's an incredible judoka, but he was also incredible at just frustrating his opponents with gripping and strategy and so on."}, {"time": 1356, "text": "And I just remember feeling the pain of this person, like Travis, who went through just, he broke like every part of his body."}, {"time": 1364, "text": "He went through so many injuries."}, {"time": 1366, "text": "Just this person who dedicated his entire life to this moment in 2008 and then 2012 and 2016, just gave everything."}, {"time": 1377, "text": "You could see it on his face that his weapons are being shut down and he's still pushing forward."}, {"time": 1385, "text": "He's still with that, both the frustration and the power."}, {"time": 1389, "text": "I mean, the kind of throw he does is his main one, I think, is the standing, it was called Seoi Nage."}, {"time": 1396, "text": "Ippon Seoi Nage."}, {"time": 1398, "text": "But that was the other thing is like, the techniques he used was these big throws that there's something to me about the Seoi Nage."}, {"time": 1407, "text": "I fell in love with that throw."}, {"time": 1409, "text": "That's my main throw, standing Seoi Nage."}, {"time": 1414, "text": "That is like... Why do you favor the standing variation?"}, {"time": 1417, "text": "Because of the amplitude?"}, {"time": 1419, "text": "You get a more powerful wind up."}, {"time": 1421, "text": "Yeah, power."}, {"time": 1423, "text": "It's like... Are you a fan of Koga?"}, {"time": 1426, "text": "That's when I, Travis, so Koga and Travis opened up my... Travis uses the same gripping patterns for Seoi Nage as Koga."}, {"time": 1435, "text": "All the same, and the way he uses his hips and turns."}, {"time": 1439, "text": "And I remember going to my judo club and other judo clubs and they were all saying, this is the wrong way to do it."}, {"time": 1447, "text": "The way Travis does it is the wrong way to do it."}, {"time": 1448, "text": "And I remember..."}, {"time": 1449, "text": "I've always been amazed by this, by the way."}, {"time": 1451, "text": "I don't mean to cut you off, but I could literally fill 20 hours of reproductions of people who will tell me that either my students or other great world champions are doing things wrong."}, {"time": 1470, "text": "And I'm looking at them and I'm like, who would I rather trust here in their judgment?"}, {"time": 1479, "text": "Koga, who was one of the greatest throwers of all time, or you, a recreational guy who couldn't throw my grandmother."}, {"time": 1494, "text": "I'm supposed to take your word over his."}, {"time": 1496, "text": "Well, say, don't listen to what people say."}, {"time": 1500, "text": "I'm gonna give you a piece of advice here."}, {"time": 1502, "text": "Watch what the best people do, okay?"}, {"time": 1506, "text": "That's how you get superior athletic performance."}, {"time": 1509, "text": "I'm gonna say that again."}, {"time": 1511, "text": "Don't listen to what people say."}, {"time": 1513, "text": "Watch what they do, particularly under the stress of high level competition, because that's when you see their real game, what they really do under pressure, okay?"}, {"time": 1522, "text": "And if you can emulate that, you're gonna be very successful."}, {"time": 1526, "text": "I guess what I was frustrated with, to your point, is that the argument against Koga is he has a very specific body type and he figured out something that worked for him."}, {"time": 1539, "text": "The statement is that might not be applicable to you or to the general public of judo players that wanna succeed."}, {"time": 1551, "text": "That, by the way, at the shallow level, might be true."}, {"time": 1557, "text": "The point is there might be a body of knowledge that's yet to be discovered and explored that Koga opened up that I wanted to understand why his technique worked."}, {"time": 1569, "text": "It made no sense to me that with a single foot, like the way you turn the hip, the single foot that steps in, why does that work?"}, {"time": 1577, "text": "Because it was actually very difficult to make work for me as a white belt in the very beginning."}, {"time": 1584, "text": "Like people just, they don't get loaded up onto your hip."}, {"time": 1588, "text": "Anyway, for people who don't watch Koga highlights, watch Travis Stevens highlights, but the details of the technique don't make sense, but when mastered, it feels like there's something fundamental there that hasn't been explored yet."}, {"time": 1603, "text": "It's like Koga and Travis made me think that we don't know most of the body mechanics involved in dominance in judo."}, {"time": 1615, "text": "Like we just kind of found a few pockets that work really well."}, {"time": 1618, "text": "There's Yamada, there's these different throws, Osorogari."}, {"time": 1622, "text": "I wonder if there's like totally cool new things that we haven't discovered."}, {"time": 1626, "text": "And that Seinagi gave a little peak because there's very few people that I'm aware of that do it the way Travis and Koga did."}, {"time": 1633, "text": "May I ask you a question?"}, {"time": 1637, "text": "The choice of standing Seinagi, I should say this for your listeners."}, {"time": 1643, "text": "They're probably thinking, what the hell are these two guys talking about?"}, {"time": 1646, "text": "Seinagi is one of the more high percentage throws in the Olympic sport of judo."}, {"time": 1652, "text": "Probably Uchimata is probably number one and variations of Seinagi would be in the top five for sure."}, {"time": 1661, "text": "The basic choice you have in modern competition is the more difficult standing Seinagi where you literally are up on your feet and you perform a shoulder throw that takes your opponent over from a full standing position."}, {"time": 1675, "text": "The most popular form of Seinagi in modern competition by a landslide is not the standing version."}, {"time": 1682, "text": "It's a drop Seinagi where you go down to your knees."}, {"time": 1685, "text": "This means you have a much easier time getting underneath your opponent's center of gravity."}, {"time": 1690, "text": "The defining feature of any Seinagi is getting underneath your opponent's center of gravity and lifting them."}, {"time": 1695, "text": "Seoi literally means to lift and carry."}, {"time": 1701, "text": "Why did you choose the more difficult version?"}, {"time": 1703, "text": "What was your motivation?"}, {"time": 1704, "text": "You know, you're a smart kid."}, {"time": 1706, "text": "You know right from the start that for every standing Seinagi, there's 20 drop Seinagis in modern competition."}, {"time": 1712, "text": "One is obviously more high percentage."}, {"time": 1714, "text": "One obviously works for a wider variety of body types."}, {"time": 1719, "text": "The number of people who are successful with standing Seinagi is dramatically lower."}, {"time": 1724, "text": "And it appears to be a move which is completely absent in the heavyweight divisions and rarely seen in the lightweight divisions."}, {"time": 1736, "text": "Why did you willingly adopt the less high percentage over the more high percentage?"}, {"time": 1741, "text": "And this would be very interesting."}, {"time": 1744, "text": "I would love you to break it apart because I apply the same kind of thinking to basically everything."}, {"time": 1750, "text": "I mentioned to you offline, there's these Boston Dynamics Spot Robots."}, {"time": 1754, "text": "When I first met Spot, I fell in love."}, {"time": 1758, "text": "I don't understand what exactly, but there's magic there."}, {"time": 1762, "text": "And I just got excited by it."}, {"time": 1764, "text": "And that fire burns."}, {"time": 1766, "text": "I wanna work with these robots."}, {"time": 1767, "text": "I wanna work with the robots."}, {"time": 1769, "text": "I want to, I felt like there's something special there that I could build something interesting with, create something interesting with."}, {"time": 1778, "text": "And the same with the standing Seinagi from Koga and Travis."}, {"time": 1783, "text": "I just fell in love with that technique."}, {"time": 1784, "text": "Just even watching, I didn't even know what the hell to do with it."}, {"time": 1787, "text": "Was it aesthetic?"}, {"time": 1789, "text": "The standing Seinagi is more beautiful in execution."}, {"time": 1792, "text": "In my own, we're talking about love here, right?"}, {"time": 1798, "text": "In my own definition of aesthetic, yes."}, {"time": 1801, "text": "It's not just beauty."}, {"time": 1802, "text": "Cause you could argue there's more elegant sort of Uchimata is very beautiful and effortless."}, {"time": 1807, "text": "I love something about the dominance of it."}, {"time": 1811, "text": "I love the idea in sport of two people that are the best in the world."}, {"time": 1819, "text": "And one of them dominating the other."}, {"time": 1823, "text": "And to me, the standing Seinagi, you're lifted off your feet and especially when it's done perfectly and with really strong resistance from the other person, it results in a big slam."}, {"time": 1840, "text": "And that was like beautiful to me."}, {"time": 1841, "text": "That's the Alexander Karelian like big pickups."}, {"time": 1846, "text": "It's interesting, you're correct in so far as you're not just going with aesthetic and the sense of beauty, but also, but you are making as it were value judgments about the throw."}, {"time": 1860, "text": "And that's fascinating to me because there's two elements to any grappling sport."}, {"time": 1869, "text": "I'm always insistent upon the idea that Jiu Jitsu is both an art and a science, okay?"}, {"time": 1876, "text": "It has scientific elements in so far as it works according to the laws of physics and lever and fulcrum, et cetera, et cetera."}, {"time": 1884, "text": "But it also has an aesthetic element in so far as you're making choices with technique."}, {"time": 1891, "text": "You're expressing who you are as a person."}, {"time": 1893, "text": "You have 10,000 different variations of moves you could use, but you're specifically choosing these."}, {"time": 1899, "text": "That's an element of choice and self expression on your part."}, {"time": 1902, "text": "And in so far as that is true, combat sports are not just a science, but they're also an art."}, {"time": 1907, "text": "So most combat sports have this sense which they have the features of both an art and a science."}, {"time": 1913, "text": "And it's not just about high percentage in your case."}, {"time": 1919, "text": "I mean, me personally, I'm obsessed with percentages."}, {"time": 1922, "text": "What are the ways to make you win?"}, {"time": 1923, "text": "That's the science part."}, {"time": 1924, "text": "Yeah, but that's also choices involved, yeah."}, {"time": 1928, "text": "But there is an undeniably aesthetic element to martial arts where you, as it were, express who you are as a person in terms of the techniques you're ultimately going to choose."}, {"time": 1943, "text": "Does that get in the way?"}, {"time": 1944, "text": "Do you allow yourself to enjoy the aesthetic beauty of a technique?"}, {"time": 1950, "text": "When martial arts are done well, it's the most beautiful sport in the world, okay?"}, {"time": 1955, "text": "When it's done poorly, it's the ugliest."}, {"time": 1957, "text": "But a beautifully applied submission hold, a perfect throw, a superbly set up takedown are among the most difficult techniques to execute in all of sports."}, {"time": 1971, "text": "And when they're done well, they're magic to observe."}, {"time": 1974, "text": "But do you prefer certain techniques over others because of their, like for example, I'll tell you, for me, chokes of all sorts with the gi, without the gi, probably with the gi is the most beautiful to me, personally."}, {"time": 1990, "text": "I value them above all others."}, {"time": 1993, "text": "People mostly associate myself and my students with leg locking."}, {"time": 1997, "text": "They're usually rather surprised to learn that I actually value strangle holds far above leg locks."}, {"time": 2005, "text": "But not for aesthetic reasons, for effectiveness."}, {"time": 2008, "text": "We can talk about that later if you wish."}, {"time": 2010, "text": "Well, let's step back."}, {"time": 2013, "text": "Sorry, we drifted awfully far off topic there."}, {"time": 2016, "text": "I think this is beautiful."}, {"time": 2018, "text": "We drifted along the river of life and martial arts."}, {"time": 2023, "text": "Can you explain the fundamentals of jiu jitsu?"}, {"time": 2026, "text": "If I couldn't, I wouldn't be much of a coach."}, {"time": 2031, "text": "Jiu jitsu is an art and science which looks to use a combination of tactical and mechanical advantage to focus a very high percentage of my strength against a very low percentage of my opponent's strength at a critical point on their body, such that if I were to exert my strength upon that critical point, they could no longer continue to fight."}, {"time": 2062, "text": "Well, that's about weapons and defenses."}, {"time": 2067, "text": "But then, is there something more to be said about the set of tools that we're talking about?"}, {"time": 2073, "text": "That's where the art comes in."}, {"time": 2075, "text": "Because ultimately, you have a set of choices, and those choices that you make will be an act of self expression on your part."}, {"time": 2082, "text": "Some will prefer this, some will prefer that."}, {"time": 2086, "text": "That's where you come in as an individual."}, {"time": 2088, "text": "That's an overall definition of jiu jitsu, of being a set of choices that where you're using the things you're powerful in versus the things your opponent is weak in."}, {"time": 2104, "text": "No, I was only talking about percentages of body strength."}, {"time": 2107, "text": "If I have, for example, let's say we have two athletes, athlete A and athlete B. Athlet A has 100 units of strength, however we define that overall."}, {"time": 2118, "text": "Athlet B has 50."}, {"time": 2120, "text": "OK, so ostensibly, athlete A is twice as strong as athlete B."}, {"time": 2126, "text": "But athlete B can maneuver his body into a set of positions focused around a critical point of his opponent's body, where he can apply 40 units of strength out of his total of 50."}, {"time": 2141, "text": "His opponent can only defend with 20 units of strength out of his total of 100."}, {"time": 2147, "text": "You have now completely reversed the strength discrepancy."}, {"time": 2151, "text": "Originally, athlete A was twice as strong as B."}, {"time": 2154, "text": "Now, on that one localized point, the knee, the elbow, the neck, B is now twice as strong as A."}, {"time": 2161, "text": "Under those circumstances, B should win."}, {"time": 2164, "text": "I guess what I'm trying to get at, by the way, that's really beautifully said, is what you just said could be applied to other games, other battles."}, {"time": 2176, "text": "It could be applied to the game of chess."}, {"time": 2179, "text": "It could be applied to war, most obviously in war."}, {"time": 2182, "text": "I think about, for example, the American strategic bombing campaign in World War II."}, {"time": 2190, "text": "The Eighth Army Air Force was tasked with the idea of destroying German industry."}, {"time": 2197, "text": "Did they attack all of German industry?"}, {"time": 2200, "text": "That would be stupid."}, {"time": 2201, "text": "They attacked the ball bearing industry."}, {"time": 2206, "text": "Because almost all of modern machines require ball bearings in order to operate."}, {"time": 2214, "text": "In order for the mechanical interfaces of machines to operate, you have to reduce friction."}, {"time": 2218, "text": "It's done through ball bearings."}, {"time": 2221, "text": "If you knocked out one tiny component of German industry, the ball bearing industry, the rest of it couldn't operate."}, {"time": 2229, "text": "So too with the human body."}, {"time": 2231, "text": "I didn't have to fight your whole body."}, {"time": 2233, "text": "I just have to fight your left knee."}, {"time": 2235, "text": "If I can break your left knee, the rest of your body is irrelevant to me."}, {"time": 2239, "text": "But then isn't the art of jiu jitsu discovering the left knee, discovering the weak points?"}, {"time": 2249, "text": "Yeah, a huge part of jiu jitsu is understanding the strengths and weaknesses of the human body."}, {"time": 2255, "text": "There's parts of the human body that are shockingly robust and there are other parts that are shockingly vulnerable."}, {"time": 2261, "text": "The major joints, and of course the most vulnerable of all, the unprotected neck."}, {"time": 2266, "text": "So if we take something I'm not familiar with but I was incredibly impressed by is the body lock that I saw Nick Rodriguez use last time a few weeks ago."}, {"time": 2280, "text": "But then I also got to hang out with Craig Jones who showed that."}, {"time": 2284, "text": "He also has a very good body lock."}, {"time": 2286, "text": "So that was, I don't know if this body lock applies to all positions, but I was seeing it from when Craig is on top of the opponent and trying to pass in the guard, use the body lock as a controlling position."}, {"time": 2304, "text": "The principle behind it is that it shuts down, as you've spoken about, it shuts down the weapons of a very strong opponent."}, {"time": 2317, "text": "In the case of guard position, what makes guard position dangerous, what makes someone a powerful guard player is the movement of their hips forward and backward and side to side."}, {"time": 2332, "text": "Body locking is designed to shut down that movement and does a very fine job of it."}, {"time": 2337, "text": "You'll see all of my students excel at it."}, {"time": 2339, "text": "Gordon Ryan is probably the single best body lock guard passer I've ever seen."}, {"time": 2344, "text": "Nicky Ryan is outstanding with it."}, {"time": 2345, "text": "Nick Rodriguez is very good."}, {"time": 2347, "text": "Craig Jones is outstanding."}, {"time": 2349, "text": "All of my students use this for a very simple reason."}, {"time": 2352, "text": "Understand what is the central problem of shutting down a dangerous guard player, it's his hips."}, {"time": 2358, "text": "That's what makes him a dangerous leg locker."}, {"time": 2360, "text": "You go up against a dangerous leg locker, body lock guard pass, single best way to shut down most of his entries."}, {"time": 2368, "text": "We're all strong in leg locks."}, {"time": 2370, "text": "So in our gym, you gotta control the hips as soon as possible."}, {"time": 2374, "text": "Otherwise it's gonna be a very difficult thing to avoid leg entanglements as you go to pass."}, {"time": 2379, "text": "And across the board, my students excel in body lock guard passing."}, {"time": 2387, "text": "They understand what's the most dangerous feature their opponent has, the lateral movement of their hips."}, {"time": 2392, "text": "What's the single best way to stop that body lock and then work from there."}, {"time": 2396, "text": "So if this asymmetry of power is fundamental to jiu jitsu, how do you discover that?"}, {"time": 2402, "text": "How did you discover the body lock?"}, {"time": 2405, "text": "That as one of many methodologies of achieving this asymmetry."}, {"time": 2411, "text": "It would be an overstatement to say we discovered the body lock."}, {"time": 2414, "text": "Body lock passing has been around longer than we've been around."}, {"time": 2418, "text": "But what I would say is that in a room full of dangerous leg lockers, you've gotta have a way to shut down the hips."}, {"time": 2425, "text": "And so once we started using body locks, we saw that was one excellent way to get around that problem."}, {"time": 2432, "text": "But as with all development, it comes from trial and error."}, {"time": 2437, "text": "You will often see people teach the technique to a certain level and you see the teaching, you're like, there's a lot of inadequacies there."}, {"time": 2445, "text": "And that doesn't cover a lot of the problems that we're encountering."}, {"time": 2449, "text": "And so trial and error is the single most important part of the development."}, {"time": 2453, "text": "Trial and error in?"}, {"time": 2456, "text": "In the training room amongst ourselves."}, {"time": 2458, "text": "In hard training or?"}, {"time": 2461, "text": "No, it never begins with hard training or everything."}, {"time": 2464, "text": "Techniques are born the same way we're born."}, {"time": 2468, "text": "Weak and in need of nutrition."}, {"time": 2473, "text": "You have to build them up organically like children."}, {"time": 2476, "text": "And you start with minimal resistance and you make progress over time."}, {"time": 2480, "text": "When you first go to the gym, do you put 500 pounds on the bench press and try to bench press it?"}, {"time": 2484, "text": "No, you'll be killed."}, {"time": 2485, "text": "You start off with the bar, you build over time and then one day, five years from now, you really are lifting 500 pounds."}, {"time": 2493, "text": "But only a forward attempt, they're on their first attempt."}, {"time": 2498, "text": "And they're born like children in your mind first?"}, {"time": 2501, "text": "Like there's a spark of an idea."}, {"time": 2503, "text": "Yes, there's always a spark."}, {"time": 2505, "text": "It's like scientific development on a subject matter which is intrinsically simpler."}, {"time": 2511, "text": "Okay, there's a sense in which naive and overly simplistic assessments of scientific method may not work well at advanced levels of science, but they work damn well in the training room with jiu jitsu where the subject matter is inherently simpler than it is in research science."}, {"time": 2530, "text": "And as a result, there'll be a spark."}, {"time": 2535, "text": "You'll see something, there's possibilities there."}, {"time": 2537, "text": "Okay, let's puzzle this out, let's work with this."}, {"time": 2541, "text": "And you run into a lot of failures."}, {"time": 2544, "text": "You've suddenly been, oh man, if I put my hip this way, this works really well."}, {"time": 2548, "text": "And then suddenly you just try and spar and you get caught in a simple, normal platter."}, {"time": 2551, "text": "And you're like, okay, that didn't work as well as I thought."}, {"time": 2553, "text": "And then you look to rectify things."}, {"time": 2555, "text": "If things go in promising research directions, you keep them."}, {"time": 2558, "text": "If not, you discard them."}, {"time": 2561, "text": "Well, it's funny you say science."}, {"time": 2562, "text": "It feels more like art."}, {"time": 2564, "text": "There's somebody I really admire that talks about this kind of ideas."}, {"time": 2568, "text": "Johnny I from Apple, he's the lead designer."}, {"time": 2571, "text": "He recently left, but he was the designer behind most of the products we know and love from Apple."}, {"time": 2577, "text": "When you say designer, be more precise."}, {"time": 2580, "text": "What exactly was he working on in Apple?"}, {"time": 2583, "text": "The iPhone."}, {"time": 2585, "text": "Which parts of the iPhone did he work on?"}, {"time": 2587, "text": "The entirety of it."}, {"time": 2589, "text": "Was he a leader of a research team or was he the person personally responsible for the development?"}, {"time": 2595, "text": "He's kind of, I would say, very similar to your position."}, {"time": 2602, "text": "He wasn't necessarily the last, the person executing the fine, the manufacturer, right?"}, {"time": 2608, "text": "But there's the, he's somebody that's very hands on."}, {"time": 2613, "text": "And it's like, okay, so he worked obviously extremely close to Steve Jobs."}, {"time": 2618, "text": "Steve Jobs has this idea."}, {"time": 2621, "text": "We should have a computer that's as thin as a sheet of paper, and then you start to play with ideas of like, what does that actually look like?"}, {"time": 2628, "text": "The reason I bring it up is because he talked about, he had these ideas that he would not tell Steve because he talked about in the same exact language as you're saying, is there's like a little baby that it's very fragile."}, {"time": 2645, "text": "It needs time to grow."}, {"time": 2648, "text": "And then Steve Jobs would often roll in."}, {"time": 2650, "text": "Was too ruthless?"}, {"time": 2651, "text": "Too ruthless."}, {"time": 2652, "text": "This is, he would destroy ideas."}, {"time": 2655, "text": "Because Johnny Ive and the team didn't have actually good responses to the criticism at first."}, {"time": 2663, "text": "Because when they're babies, you can't defend the baby."}, {"time": 2667, "text": "But you need a time to develop."}, {"time": 2669, "text": "You need to sleep on it."}, {"time": 2670, "text": "You need to rethink it, dream things and all those kinds of things."}, {"time": 2674, "text": "It's fascinating you say this, Lex, because this is actually the entire history of scientific development is literally the story of the juxtaposition between the need to protect and nurture new theories versus the need to rigorously test them with harsh testing that either verifies them or falsifies them."}, {"time": 2698, "text": "And learning to find a satisfactory compromise between those two is a very, very difficult thing."}, {"time": 2704, "text": "When you look at the history of science, you will see that there's some pretty damn chaotic moments anytime there's major theory change where all kinds of apparently undesirable tricks are used to protect certain theories with ad hoc hypotheses, et cetera, et cetera."}, {"time": 2725, "text": "And ultimately, only time and success over time will justify a theory."}, {"time": 2736, "text": "There's usually a period where when one theory goes in to replace another, there's something of a battle between competing groups of scientists, some of whom advocate theory A, some who advocate theory B."}, {"time": 2747, "text": "They often use seemingly unscrupulous methods to protect or attack another person's theory."}, {"time": 2754, "text": "They dig for proofs."}, {"time": 2756, "text": "And usually, some period of time has to go by."}, {"time": 2759, "text": "Sometimes, in some cases, it simply involved older scientists protecting an initial theory dying off and new scientists just replacing them with numbers."}, {"time": 2770, "text": "And this is a common, common theme."}, {"time": 2773, "text": "And the same applies in jiu jitsu."}, {"time": 2776, "text": "So many times, especially when I first started working with leg locks, I would show things I had worked on to even world champion black belts."}, {"time": 2788, "text": "And they would try it once or twice and fail and be like, yeah, it doesn't work."}, {"time": 2793, "text": "And I'd be like, you tried it once on another guy who's also a world champion who has a strong ability to resist it."}, {"time": 2805, "text": "And then five years later, they would see my students finishing world champions with it."}, {"time": 2812, "text": "And in some cases, finishing the very people who said that the technique would never work."}, {"time": 2817, "text": "I mean, if there was ever a refutation of a statement, that's a pretty clear example."}, {"time": 2825, "text": "And there has to be a sense in which you can't be too forgiving."}, {"time": 2829, "text": "You have to test hypotheses."}, {"time": 2831, "text": "But on the other hand, you can't be too ruthless either."}, {"time": 2834, "text": "You have to look for promise."}, {"time": 2837, "text": "And my advice is start slow."}, {"time": 2842, "text": "Again, the analogy of lifting weights."}, {"time": 2843, "text": "You don't lift the heaviest weights on your first day."}, {"time": 2846, "text": "You build up."}, {"time": 2846, "text": "You work progressively over time."}, {"time": 2850, "text": "Now, you also have to have some common sense here."}, {"time": 2852, "text": "You can't be too forgiving to a technique if it's repeatedly failing and good people have tried it and multiple good people have tried it and it's just not working out, then, OK, it's time to dismiss it."}, {"time": 2864, "text": "But don't be too quick."}, {"time": 2866, "text": "Is this where your idea of training with lower belts quite a bit comes from?"}, {"time": 2872, "text": "I've actually just, as a side comment, and maybe you can elaborate, the place, the gym, Balanced Studios with Phil and Rick McGarry's where I got my black belt, where I grew up as a jujitsu person in Philadelphia, they have a huge number of black belts, but they have a huge number of all other ranks."}, {"time": 2893, "text": "And the way they picked sparring partners, people you train with, is very ad hoc."}, {"time": 2898, "text": "It's very loose."}, {"time": 2898, "text": "It's one of those places, one of those gyms where you can train for like three, four hours."}, {"time": 2905, "text": "And you could take a break or you could jump back in."}, {"time": 2909, "text": "Very informal."}, {"time": 2910, "text": "And you can go to war with black belts, but then you can also play around with the purple and the blue belts and so on."}, {"time": 2917, "text": "And that was really beneficial for growth."}, {"time": 2919, "text": "And you can pick which, because everybody has a style, and you can pick which style you really want to work on."}, {"time": 2925, "text": "And then I came to Boston, Broadway Jiu Jitsu, with John Clark, who I love."}, {"time": 2933, "text": "He's a good friend."}, {"time": 2934, "text": "But it's a little bit more formal."}, {"time": 2938, "text": "And I found myself, it was a very interesting journey."}, {"time": 2941, "text": "I would be training with black belts the whole time."}, {"time": 2943, "text": "And it was a very different experience."}, {"time": 2947, "text": "I found myself exploring much less."}, {"time": 2950, "text": "I found myself learning much less."}, {"time": 2954, "text": "I mean, part of that is on me, but part of it was also realizing that, wow, there's a value to training with people that are much worse than you."}, {"time": 2964, "text": "Yes, is there a philosophy you could speak to on that?"}, {"time": 2968, "text": "Yeah, you probably know it already."}, {"time": 2971, "text": "You know from your studies in artificial intelligence that all human beings are naturally risk averse."}, {"time": 2977, "text": "This is a bias which is deeply seated in all of us."}, {"time": 2982, "text": "I'm sure you're well read on people like Tversky and et cetera, who talk about this all the time."}, {"time": 2988, "text": "For your viewers, there are numerous psychological experiments that are showing that most people, to the point of irrationality, fear loss more than they are excited at the prospect of an equivalent gain."}, {"time": 3004, "text": "So for example, if you have $100 in your wallet, you're more worried about the idea of losing the $100 that you have now than you would be excited by the prospect of gaining $100 that I could potentially offer you."}, {"time": 3018, "text": "This comes out whenever you get black belt versus black belt confrontations or any kind of similar skill level."}, {"time": 3027, "text": "Whenever you get similar skill levels, the chances of defeat get very, very high."}, {"time": 3034, "text": "Interestingly, if you're a white belt and you're going against a black belt, you'll take risk."}, {"time": 3039, "text": "Because there's no shame in losing to a black belt when you're a white belt."}, {"time": 3041, "text": "So you'll play more lightheartedly and you'll have a more fun role."}, {"time": 3045, "text": "But when you have very similar skill levels, you're going to come back to what?"}, {"time": 3051, "text": "The techniques that are most likely to get you a win."}, {"time": 3057, "text": "That number of techniques is usually pretty small."}, {"time": 3060, "text": "And if you're always battling with the same tough opponents every day, where if you make even a single error, it will cost you that match inspiring and you don't like losing, you're going to stay with a very small set of moves."}, {"time": 3077, "text": "You might get slightly better at direct execution over time, but you as an individual will not grow."}, {"time": 3082, "text": "Growth, as it does in organic life forms, comes from small beginnings and builds over time."}, {"time": 3093, "text": "You can't take an untested, untried move and get it on a world champion black belt."}, {"time": 3099, "text": "It's going to get crushed, so it's not ready for that."}, {"time": 3105, "text": "It's like a lion cub being thrown out into the Serengeti plains."}, {"time": 3110, "text": "A lion cub is just too small and too ineffective."}, {"time": 3113, "text": "It's a lion, but it's a cub."}, {"time": 3116, "text": "And it's not until it grows into maturity that it can be a lion that can dominate the Serengeti plains."}, {"time": 3124, "text": "That's why I always encourage my students to play with a variety of belt types and spend the majority of their time with lesser belts for development purposes."}, {"time": 3136, "text": "When you're getting closer to a competition, you obviously want to change that."}, {"time": 3139, "text": "You want to be getting more a competitive sense of hard work, but you must learn to divide up your training cycles into non competition cycles where you're presumably working with people who are slightly lower in level than yourself, and in some cases, quite a bit lower than yourself."}, {"time": 3160, "text": "And then competition cycles where you're working with people much closer to your own skill level."}, {"time": 3166, "text": "Is there something to be said about the flip side of that, which is when you're training with people at the same skill level, being OK losing to them?"}, {"time": 3178, "text": "You have to see training for what it is."}, {"time": 3181, "text": "Training is about skill development, not about winning or losing."}, {"time": 3184, "text": "You've got to understand that you don't need to win every battle."}, {"time": 3190, "text": "You only need to win the battles that count."}, {"time": 3193, "text": "And the battles that count are in the world championship finals."}, {"time": 3197, "text": "That's the one that counts."}, {"time": 3198, "text": "Think about that win."}, {"time": 3200, "text": "That's the one you're going to be remembered for."}, {"time": 3202, "text": "You're not going to be remembered for the battle you lost on Tuesday afternoon at 3 PM in some nameless gym with some guy that no one cares about."}, {"time": 3209, "text": "No one's going to remember that."}, {"time": 3211, "text": "You're going to be remembered for your peak performances, not your everyday performances."}, {"time": 3215, "text": "Focus your everyday performances on skill development so that your peak performances you can focus on winning."}, {"time": 3223, "text": "This is not a therapy session, but if I could just speak."}, {"time": 3228, "text": "Every session's a therapy session."}, {"time": 3232, "text": "There is still an ape thing in there."}, {"time": 3237, "text": "You think I don't feel it?"}, {"time": 3239, "text": "You think everyone in the room doesn't feel it?"}, {"time": 3242, "text": "Because, for example, you have never seen me roll."}, {"time": 3246, "text": "When there's people, I've seen the look in people's eyes when they see me train."}, {"time": 3252, "text": "And I could see, maybe it's me projecting, but they think, I thought you were supposed to be good."}, {"time": 3258, "text": "I thought you were supposed to be a black belt."}, {"time": 3262, "text": "That look, they're like studying."}, {"time": 3264, "text": "I'm going to give you some therapy."}, {"time": 3265, "text": "OK. Do you know how many people have come up to me over the years who have visited the training halls that I work in, and they come up to me and they go, man, I rolled with Gary Tonin."}, {"time": 3283, "text": "I did really well with him, like really well."}, {"time": 3288, "text": "I'm like, oh, that's very good, very impressive."}, {"time": 3292, "text": "And then I see them talking to their friends, like, man, I tapped out Gary Tonin."}, {"time": 3299, "text": "And I'm sitting there going, yeah."}, {"time": 3304, "text": "And you can see that they're just like, whoa, dude, I'm way better than I thought I was."}, {"time": 3310, "text": "Gary Tonin, all of my students, I push them in the direction of giving up bad positions so that they practice working, getting out of critical situations."}, {"time": 3322, "text": "It's a huge part of our training program."}, {"time": 3324, "text": "But Gary Tonin takes that to a level that just no one else even gets close."}, {"time": 3330, "text": "He will put himself in impossible situations where it's a fully locked strangle, 100% on with both his arms behind his back."}, {"time": 3342, "text": "And he'll try to work out from there."}, {"time": 3344, "text": "And seven times out of 10, he does."}, {"time": 3348, "text": "But three times out of 10, he gets caught."}, {"time": 3352, "text": "I'm a huge advocate of handicap training, where you handicap yourself to work on skills."}, {"time": 3359, "text": "He's took that to heart to a level that few people, I believe, can match."}, {"time": 3365, "text": "I just wonder what his psychology is like, because there's."}, {"time": 3368, "text": "It goes back to what we talked about before, Lex."}, {"time": 3370, "text": "You have to understand it's skill development."}, {"time": 3373, "text": "Don't take it personally."}, {"time": 3376, "text": "I hear where you're coming from."}, {"time": 3378, "text": "We've all got what you call the ape reflex, where we want to be dominant, OK?"}, {"time": 3382, "text": "We all do."}, {"time": 3383, "text": "Because there's thousands of white belts out there that have tapped Gary Tonan, and they're walking around, and they're posting online."}, {"time": 3390, "text": "I tapped Gary Tonan."}, {"time": 3392, "text": "Gary Tonan's one of the best in the world, so I'm one of the best in the world."}, {"time": 3396, "text": "And does Gary get upset about this?"}, {"time": 3401, "text": "Because Gary knows that when it counts on stage, he's going to be going 100% with a set of skills that very few people can match."}, {"time": 3409, "text": "He can go into an EBI overtime at the 205 pound weight division against an ADCC champion, starting in a full arm lock position, and effortlessly get out with no problems in seconds."}, {"time": 3424, "text": "Because he's been in that situation 25,000 times with varying degrees of skilled opponents."}, {"time": 3432, "text": "And there's just no panic, no fear."}, {"time": 3436, "text": "He's just doing what he's done so many thousands of times."}, {"time": 3440, "text": "And that's a fine, fine example of a guy who didn't give a damn what happened in the training room, but when it counted on the stage, in front of the cameras, it kicked in."}, {"time": 3452, "text": "Yeah, he's an incredible inspiration, actually."}, {"time": 3455, "text": "He's a practitioner of something you've recently talked quite a bit about, which is the power of escaping sort of bad positions."}, {"time": 3463, "text": "I think you've talked about it, which is really interesting framing, is escaping bad positions is one of the best ways, if not the best way, to demonstrate dominance psychologically over your opponent."}, {"time": 3481, "text": "That anything they throw at you, like their weapons are useless against you."}, {"time": 3488, "text": "There's a little bit of Lex Friedman kicking through on this question."}, {"time": 3491, "text": "Your obsession with dominance is skewing your point of view."}, {"time": 3496, "text": "It's a therapy session, it's a therapy session."}, {"time": 3499, "text": "I'm coming from a wrestling perspective."}, {"time": 3502, "text": "I think it's not just Lex Friedman."}, {"time": 3503, "text": "I think it's Dan Gable."}, {"time": 3505, "text": "I think it's dominant."}, {"time": 3506, "text": "The Gary Tonin ethic, it just goes against everything wrestling is about."}, {"time": 3512, "text": "You never put yourself in a bad position."}, {"time": 3515, "text": "And the fact, it's a, philosophically, I don't know what to do with it."}, {"time": 3520, "text": "It's a total reframing of showing dominance by escaping any bad position."}, {"time": 3529, "text": "Let's talk about the idea of what is the value of escapes?"}, {"time": 3533, "text": "Why do I put this in as the first skill that every Jiu Jitsu student must master?"}, {"time": 3541, "text": "Believe it or not, when I talked about how it pertains to dominance, that's its smallest value."}, {"time": 3552, "text": "Its greatest value has nothing to do with dominance."}, {"time": 3554, "text": "It has to do with confidence."}, {"time": 3559, "text": "You can train someone and teach them technique until you're blue in the face."}, {"time": 3565, "text": "But at some point, the athlete in question has to go out there on the stage and pull the trigger when the time is right."}, {"time": 3574, "text": "What's going to give you that ability to go from the physical skills that you've learned to execution under pressure is confidence."}, {"time": 3591, "text": "I always talk about skill development."}, {"time": 3594, "text": "And yes, skill development is the absolute bedrock of my training programs."}, {"time": 3598, "text": "But you can't finish at that level."}, {"time": 3602, "text": "There has to be something more than that."}, {"time": 3604, "text": "And you have to go from the physical element of skill into the psychological element of confidence."}, {"time": 3611, "text": "I can teach you an armbar all day."}, {"time": 3614, "text": "You can get to a point where you can flawlessly execute armbars in drilling and even in a certain level of competition."}, {"time": 3658, "text": "And so even though you had all the requisite physical skills to perform the technique, when push came to shove and the critical moment came, you backed down."}, {"time": 3670, "text": "You didn't pull the trigger."}, {"time": 3673, "text": "Building that confidence is the key to championship performance."}, {"time": 3679, "text": "And the single best way to do it is to take away the innate fear that we all have of bad outcomes that makes us naturally risk averse."}, {"time": 3693, "text": "When you don't believe you can be pinned, when you don't believe your guard can be passed, you'll take risks because there's no downside to your actions."}, {"time": 3702, "text": "An unpinnable person and an unpassable person doesn't have much to fear in a jiu jitsu match."}, {"time": 3708, "text": "You can come out and fire with all guns blazing because then you know at the end of the day, no one's gonna hold you down, no one's gonna pass you guard."}, {"time": 3716, "text": "That's your first two goals in jiu jitsu."}, {"time": 3718, "text": "They're the most boring goals."}, {"time": 3720, "text": "They're not exciting to learn."}, {"time": 3721, "text": "No one wants to come in and their first thing we're told, okay, you're gonna practice escapes for the next year of your life."}, {"time": 3726, "text": "Okay, it's not going, are you kidding me?"}, {"time": 3728, "text": "But that's what you gotta have, that's your first skill."}, {"time": 3731, "text": "And that's what I push upon all of my students."}, {"time": 3734, "text": "You'll see almost all of them are very, very strong in escape skills."}, {"time": 3738, "text": "They know that if things go wrong, they can always get out."}, {"time": 3742, "text": "They can always live to fight another day."}, {"time": 3746, "text": "And that is what gives them the ability to attack without fear."}, {"time": 3751, "text": "I think that is so profound and so rare."}, {"time": 3755, "text": "It's so rare to hear this."}, {"time": 3757, "text": "I think it's because it's the most painful thing to do."}, {"time": 3761, "text": "Always ask yourself, when you enter a jiu jitsu match, you already know ahead of time, if you're going to lose, how you're going to lose."}, {"time": 3776, "text": "Okay, there's only a certain number of realistic submissions that work in the sport of jiu jitsu."}, {"time": 3781, "text": "The number is very small."}, {"time": 3783, "text": "So ahead of time, you already know the most likely methods of submission loss in jiu jitsu are gonna be things like heel hook, armbar, rear naked strangle, guillotine, et cetera, et cetera."}, {"time": 3794, "text": "Just work backwards from that knowledge."}, {"time": 3797, "text": "So start off learning how to defend all of those things."}, {"time": 3800, "text": "You know what the major losing positions are in jiu jitsu."}, {"time": 3803, "text": "Someone gets mounted on you, rear mount, side control, knee on belly."}, {"time": 3806, "text": "Those positions you can only lose from."}, {"time": 3808, "text": "So work backwards from there, getting out of those positions."}, {"time": 3812, "text": "And that's how I always start."}, {"time": 3813, "text": "I always say with my students, I teach beginners from the ground up and I teach experts backwards."}, {"time": 3825, "text": "When a young student comes to me with no skills, they learn from the ground up."}, {"time": 3829, "text": "They start on their backs, defending pins."}, {"time": 3832, "text": "Then they start on their backs working from half guard bottom, then on their backs working from variations of guard."}, {"time": 3838, "text": "They don't even get to see top position until they're strong off their backs."}, {"time": 3842, "text": "Then they go onto their knees and they start passing, start standing and passing."}, {"time": 3849, "text": "And then they work their pins and transitions."}, {"time": 3852, "text": "And then ultimately they stand up to their feet and they work standing position on their feet."}, {"time": 3856, "text": "So they work from ground back on the floor to ground knees on the floor, ground standing and then both athletes standing."}, {"time": 3864, "text": "It's a gradual progression over time where they work from the bottom to the top."}, {"time": 3868, "text": "With regards to experts, I teach them end game first."}, {"time": 3872, "text": "They must become very, very strong in what finishes the match, which is submission holds."}, {"time": 3877, "text": "Okay, in chess, we always talk about end game."}, {"time": 3882, "text": "I do the same thing in Jiu Jitsu."}, {"time": 3884, "text": "I start experts just looking at the mechanics of breaking people and all the submission holds that I teach."}, {"time": 3891, "text": "You should know that I teach only a very small number of submission holds, around six."}, {"time": 3897, "text": "It's interesting that my students have by far and away the highest submission rate in contemporary Jiu Jitsu, but they only learn around six to seven submission holds."}, {"time": 3906, "text": "I start them with mechanics where they learn the end game, how to break someone."}, {"time": 3919, "text": "Once they develop in their mind, the belief that if, the conditional if, they can get to one of those six positions, there's a very high likelihood they'll win."}, {"time": 3937, "text": "If they truly believe then, when it's competition time, they'll fucking find a way to get to those positions."}, {"time": 3946, "text": "That's confidence."}, {"time": 3947, "text": "But if you don't believe, let's say you believe, man, if I get to a finishing position, an armbar or a strangle, there's only like a 20% chance I'll finish with it."}, {"time": 3956, "text": "How hard are you gonna fight to get to that position?"}, {"time": 3960, "text": "Why, why would you?"}, {"time": 3962, "text": "But if you believe there's a 98% chance, if you get to that position, you'll finish."}, {"time": 3968, "text": "You'll find a way to get there."}, {"time": 3970, "text": "That is so powerful."}, {"time": 3972, "text": "There's certain things, it may be going back to Judo a little bit, is there's a clock choke for people who are listening."}, {"time": 3980, "text": "It's with the gi when a person is in a turtle position, in a crouching position."}, {"time": 3987, "text": "And this is something that's done in Judo quite a bit."}, {"time": 3990, "text": "But I have, it doesn't matter what the technique is, I have a belief in my head that there's not a person in the world that I can't choke with that clock choke."}, {"time": 4000, "text": "That's a good belief to have."}, {"time": 4001, "text": "And I've done that."}, {"time": 4003, "text": "And that it was, it built on itself."}, {"time": 4007, "text": "The belief made the technique better and better and better."}, {"time": 4012, "text": "Now you're onto something."}, {"time": 4014, "text": "That's exactly the mindset that I'm trying to coach."}, {"time": 4016, "text": "But that's step one."}, {"time": 4019, "text": "You have to believe that once you get there."}, {"time": 4021, "text": "But you gotta start somewhere."}, {"time": 4022, "text": "And then it's step one."}, {"time": 4023, "text": "But then you have to create a system how to get there."}, {"time": 4025, "text": "But it's a damn important step."}, {"time": 4026, "text": "So you coach the end game first, and then you fill in the details afterwards."}, {"time": 4031, "text": "Yeah, that's a huge confidence builder."}, {"time": 4033, "text": "But I just, I have to say, to admit, and it makes me sad, but I think I'm not alone."}, {"time": 4039, "text": "I think a majority of Jiu Jitsu people are like this, that I didn't do the beginner step that you talk about, which is focusing on escapes."}, {"time": 4050, "text": "I think I learned the wrong lessons from losing."}, {"time": 4055, "text": "I remember in a blue belt competition long ago, I was, I think it was, yeah, it was the finals of Atlanta IBJJF tournament."}, {"time": 4067, "text": "And there's a person that passed my guard and he took mount."}, {"time": 4077, "text": "And he stayed in mount for a long time."}, {"time": 4081, "text": "And I couldn't breathe."}, {"time": 4082, "text": "And it was like one of those things where I was truly dominated."}, {"time": 4086, "text": "I don't think I've been dominated in Jiu Jitsu match quite like that before or after."}, {"time": 4092, "text": "And the lesson I learned from that is I'm not gonna let, like as opposed to working on escapes, I'm not gonna let anyone pass my guard."}, {"time": 4102, "text": "What you learned is don't take risks."}, {"time": 4104, "text": "Don't take risks."}, {"time": 4106, "text": "Which is ultimately what kills you."}, {"time": 4109, "text": "Ultimately, if you become the best you can, you gotta take risks."}, {"time": 4112, "text": "As they say, nothing risk, nothing gain."}, {"time": 4115, "text": "Failure usually makes us even more risk averse than we started."}, {"time": 4119, "text": "We're already mentally biased, being human beings in that direction."}, {"time": 4123, "text": "And failure tends to reinforce that."}, {"time": 4128, "text": "I work hard in my training programs to try and correct that fault."}, {"time": 4132, "text": "Is it still possible for a person who's a black belt to then just go back to that beginning journey, I guess?"}, {"time": 4141, "text": "Let me tell you something."}, {"time": 4143, "text": "I'm probably gonna catch a lot of flack for saying this."}, {"time": 4145, "text": "I have a belief."}, {"time": 4147, "text": "I won't say something, I won't call it knowledge because it's not known, but I have a fervent belief."}, {"time": 4154, "text": "That human beings in most skill activities, not all skill activities, but I will say combat sports, for sure, can reinvent themselves in five year periods."}, {"time": 4167, "text": "Now you might be saying five years?"}, {"time": 4169, "text": "What's magical about five years?"}, {"time": 4173, "text": "Mike Tyson was 13 years old when he was taken in by custom auto."}, {"time": 4178, "text": "By the age of 18, he was beating world class boxers in the gym and had already made a strong name for himself in international boxing."}, {"time": 4192, "text": "He was already a known figure."}, {"time": 4194, "text": "It was five years."}, {"time": 4200, "text": "Yasuhiro Yamashita, the judo player, began judo at 13."}, {"time": 4205, "text": "He placed silver in the All Japans at 17."}, {"time": 4212, "text": "I could go on all day with examples of athletes who within a five year timeframe of starting a sport were competing at world championship level."}, {"time": 4225, "text": "I'm gonna give you a rough and ready definition of sport mastery, okay?"}, {"time": 4231, "text": "I believe that if you can play a competitive match against someone ranked in the top 25 in your sport, and it's a serious international sport, I would call you someone who's mastered that sport."}, {"time": 4247, "text": "Okay, you're damn good."}, {"time": 4250, "text": "If you can go with the number 25 wrestler in the world and give them a hard competitive match in the gym, you may not win it, but they had a good workout, you know, they had a good workout."}, {"time": 4261, "text": "You have shown mastery of wrestling or indeed any other combat sport you care to name."}, {"time": 4273, "text": "There are numerous examples of people doing far better than that in five years, winning medals at world championships and even Olympic games in that five year period."}, {"time": 4286, "text": "This is not an unrealistic goal."}, {"time": 4288, "text": "There is a lot of empirical evidence to show that people have done this in the past, a lot of it."}, {"time": 4294, "text": "So if you fully immerse yourself in a sport with a well worked out, well planned training program, there is a mountain of evidence to show that in a five year period, you can go from a complete beginner to like very, very impressive skill level to the point where you're competitive with some of the best people on the planet."}, {"time": 4316, "text": "You can reinvent yourself in these five year periods."}, {"time": 4320, "text": "What happens with most people is they get to a certain level and they get complacent, they get lazy and they just keep doing the same old thing they've been doing."}, {"time": 4328, "text": "But if you're diligent and you're purposeful, five years, you can accomplish an awful lot and as I said, there's a mountain of evidence to show it."}, {"time": 4338, "text": "By the way, as a small aside, somebody who's mentioned Tversky and Yamashita in the same conversation, you're one of the most impressive people I've ever spoken to."}, {"time": 4347, "text": "But as a small aside, so if there's this complete beginner, this is really interesting."}, {"time": 4356, "text": "There is empirical evidence that you can achieve incredible things in a short amount of time."}, {"time": 4364, "text": "There's a complete beginner standing before you and that beginner has fire in their eyes and they want to achieve mastery."}, {"time": 4374, "text": "Where do you place most of the credit for a journey that does achieve mastery?"}, {"time": 4381, "text": "Is it the set of ideas they have in their mind?"}, {"time": 4384, "text": "Is it the set of drills or the way they practice?"}, {"time": 4389, "text": "Is it genetics and luck?"}, {"time": 4393, "text": "Those are all good insights."}, {"time": 4395, "text": "All of those factors you've mentioned play a definite role."}, {"time": 4398, "text": "Let's start with luck, okay?"}, {"time": 4401, "text": "We are all subject to fortune and fortune can be good and fortune can be bad."}, {"time": 4408, "text": "Life is in many ways beautiful, but life is also tragic."}, {"time": 4412, "text": "And I've had students who showed enormous promise and just tragic events occurred in their lives."}, {"time": 4421, "text": "The vicissitudes of fortune can be a wonderful thing in your life and they can be a terrible tragedy."}, {"time": 4428, "text": "I've had students who died for various reasons who could have gone on to become world champions."}, {"time": 4436, "text": "I've had students who on a much lighter note just fell in love and just wanted to have kids and move away and that's a wonderful thing, but different direction."}, {"time": 4449, "text": "You just never know."}, {"time": 4450, "text": "So luck does play some role."}, {"time": 4453, "text": "Even things like where you're born, the location of, your physical location in the world or even the socioeconomic location can play a role which could be detrimental or favorable."}, {"time": 4466, "text": "So yeah, luck does play some role."}, {"time": 4468, "text": "Thankfully, it's one of the smaller elements."}, {"time": 4471, "text": "And I do believe that a truly resourceful mind can overcome the majority of what fortune throws at us and get to goals provided you're sufficiently mentally robust."}, {"time": 4487, "text": "Other things you mentioned, genetics."}, {"time": 4491, "text": "I do believe in certain sports, genetics really do play a powerful, powerful role."}, {"time": 4498, "text": "For example, in any sport where power output and reaction speed, ability to take physical damage, then there are genetic elements which will help."}, {"time": 4511, "text": "For example, I couldn't imagine a world in which even if I have a crippled leg, so even if I grew up in a world where my leg was normal and I had normal legs and everything was fine with my body, I don't believe that I could win the Olympic gold medal in 100 meter sprinting, for example."}, {"time": 4532, "text": "I just don't have enough fast twitch muscle fibers."}, {"time": 4535, "text": "But the more a sport involves skill and tactics, the less you will see genetics playing a role."}, {"time": 4544, "text": "If you look at the medal podiums in jiu jitsu, for example, you will see that no one body type is definitively superior to another."}, {"time": 4554, "text": "You will see every variation of body type and the medal platforms in jiu jitsu."}, {"time": 4561, "text": "As skill and tactics become more and more important and things like just power output over time become less and less important, then you will see that genetics play less and less of a role."}, {"time": 4572, "text": "I'm happy to say that the sport of jiu jitsu, the evidence seems pretty clear that there's no one dominant body type in the sport of jiu jitsu."}, {"time": 4579, "text": "Rather, there's just advantages for one type and there's advantages for another."}, {"time": 4584, "text": "You just have to learn to tailor your game to your body."}, {"time": 4590, "text": "With regards to training program, yes, I believe with all my heart and all my soul that your training program does make a difference."}, {"time": 4600, "text": "I've dedicated my life to that."}, {"time": 4601, "text": "Obviously, I'm biased in this regard."}, {"time": 4604, "text": "I do believe that all of the students that I taught who became world champions would have been great athletes whether or not they had met me or not."}, {"time": 4613, "text": "But I do also believe it would have taken them a lot longer and they may not have gotten to the level that they did."}, {"time": 4620, "text": "I'm sure they would have been impressive, but I do believe that the nature of a training program plays an enormous difference."}, {"time": 4628, "text": "I don't mean to say this in an arrogant way."}, {"time": 4630, "text": "I believe that there's, again, a mountain of evidence to suggest this is true because you see it in many different sports."}, {"time": 4637, "text": "Let's talk, for example, about your country, Russia, and its wrestling program."}, {"time": 4645, "text": "Russia is an enormous country, but the location where Russia's wrestling program comes from is actually very small and the population is actually very small."}, {"time": 4656, "text": "I can't verify this, but I was told once, I can't verify this, but the number of people who wrestle in Russia is actually significantly smaller than the number of people who wrestle in the United States."}, {"time": 4667, "text": "It's also not part of the school athletics and it is in the United States."}, {"time": 4672, "text": "Yes, that's a different point."}, {"time": 4674, "text": "We'll come back right to that because that's also an important point."}, {"time": 4677, "text": "But if you look at the actual numbers of people there, they're actually pretty small."}, {"time": 4682, "text": "So ostensibly, if it comes down to a numbers game, America should dominate at the Olympics because we have more wrestlers."}, {"time": 4687, "text": "Now, the story gets more complicated because America has a different style of wrestling, the collegiate style than the international freestyle."}, {"time": 4694, "text": "That is a complicating factor."}, {"time": 4698, "text": "But nonetheless, what you see there is that numbers aren't everything."}, {"time": 4704, "text": "Rather, the manner in which people are trained clearly has an impact."}, {"time": 4709, "text": "And we know very little about the, there's very little reliable information about the training program for wrestling in the Russian States."}, {"time": 4719, "text": "But one thing is incontestable is the amount of success that they've had in international world championship and Olympic competition."}, {"time": 4728, "text": "They are disproportionately successful despite their relatively small numbers."}, {"time": 4734, "text": "There's nothing genetically special about them."}, {"time": 4737, "text": "You can talk about performance enhancing drugs, but those are a worldwide phenomenon."}, {"time": 4743, "text": "They don't have any access to technology that the rest of the world doesn't have."}, {"time": 4750, "text": "At some point, you gotta start asking, what are they doing differently in the training room?"}, {"time": 4754, "text": "And there are many other examples of similar situations."}, {"time": 4759, "text": "My country, New Zealand, has an insanely successful rugby program, the sport of rugby, which they have dominated for literally generations despite the fact that our population is very, very small compared with the rest of the country."}, {"time": 4779, "text": "And we don't excel in many other sports."}, {"time": 4781, "text": "New Zealand does fairly well in sports overall, but nothing like they do in rugby."}, {"time": 4787, "text": "And you've got to ask yourself, is there a culture there which built this up?"}, {"time": 4792, "text": "And the world is full of examples of seemingly small and unpromising areas or locations putting out disproportionately high numbers of successful athletes."}, {"time": 4805, "text": "And that points to the idea that different training programs have different success rates."}, {"time": 4812, "text": "And so I truly believe with all my heart and all my soul that how you train does make a significant difference."}, {"time": 4820, "text": "I would even go further and say it makes the most difference."}, {"time": 4823, "text": "Is it the only thing?"}, {"time": 4825, "text": "We've already talked about fortune."}, {"time": 4826, "text": "We've talked about genetics."}, {"time": 4829, "text": "If you wanna get nasty, you can even talk about things like performance enhancing drugs that obviously plays a role in modern sports."}, {"time": 4836, "text": "But I do believe that the majority of what creates success is the interaction between the athlete and the training program."}, {"time": 4845, "text": "Now, the training program is one thing."}, {"time": 4847, "text": "I do believe that's the single most important, but right behind it is the athlete themselves."}, {"time": 4854, "text": "In my own experience, people talk about athletes that I've trained successfully, but they never talk about athletes that I've trained unsuccessfully."}, {"time": 4863, "text": "Always remember that for every champion coach produces, there's always going to be a difference."}, {"time": 4868, "text": "Always remember that for every champion a coach produces, there's a hundred people that they coach that no one ever heard of, and this is completely normal."}, {"time": 4880, "text": "A coach can never take the lion's share of the credit."}, {"time": 4884, "text": "A coach creates possibilities, but it's the athlete who actualizes the possibilities."}, {"time": 4891, "text": "And so building that rapport and finding the right people to excel in your training program is also a big part of it."}, {"time": 4899, "text": "What makes the difference between the successful, your successes and your failures as a coach?"}, {"time": 4905, "text": "A range of reasons."}, {"time": 4907, "text": "The single most important is persistence."}, {"time": 4912, "text": "People will point to all kinds of virtues amongst athletes."}, {"time": 4915, "text": "This guy's the most courageous."}, {"time": 4916, "text": "This guy's the strongest."}, {"time": 4918, "text": "These are all virtues, but the one indispensable virtue is persistence, the ability just to stay in the game long enough to get the results you seek."}, {"time": 4929, "text": "But what does persistence really look like?"}, {"time": 4932, "text": "If we can just break that apart a little bit."}, {"time": 4934, "text": "It's actually, this is a great question you're asking because most people see it as a kind of simplistic doggedness where you just show up every day."}, {"time": 4943, "text": "That's not it."}, {"time": 4945, "text": "The most important form of persistence is persistence of thinking, which looks to push you in increasingly efficient, more and more efficient methods of training."}, {"time": 4958, "text": "Famously, people talk about the idea that the hardest work of all is hard thinking, and they're absolutely right."}, {"time": 4964, "text": "Okay, coming into the gym and just doing the same thing for a decade isn't going to make you better."}, {"time": 4970, "text": "What's going to make you better is progressive training over time where you identify clear goals marked out in time increments, three months, six months, 12 months, five years, and build those short term goals into a program of long term goals, making sure that the training program changes over time so that as your skill level rises, the challenges you face in the gym become higher and higher."}, {"time": 4995, "text": "Don't kill them at the start with challenges that are too hard for them to deal with, they get discouraged and leave."}, {"time": 5000, "text": "Build them slowly over time, but make sure they don't just get left in a swamp where they're just doing the same thing they were doing three years ago and they get bored."}, {"time": 5008, "text": "And there's two ways you can leave in a gym."}, {"time": 5011, "text": "You can leave from adversity, it was too tough, or you can leave from boredom."}, {"time": 5017, "text": "Everyone talks about the first, no one talks about the second."}, {"time": 5022, "text": "Most people, when they get to black belt, they get bored."}, {"time": 5026, "text": "They know what their game is, they know what they're good at, they know what they're not good at."}, {"time": 5030, "text": "When they compete, they stick with what they're good at, and they avoid what they're not good at, and they get bored."}, {"time": 5036, "text": "They reach a plateau, and that's it."}, {"time": 5039, "text": "My whole thing is to make sure it's not so tough at the start that they leave because of adversity, and then for the rest of their career to make sure it's not boring so they leave because of boredom."}, {"time": 5050, "text": "Travis Stevens actually said something that changed the way I see training."}, {"time": 5053, "text": "He said it as a side comment, but he said that at the end of a good training session, your mind should be exhausted, not your body."}, {"time": 5062, "text": "And I've, for most of my life, saw good training sessions where my body was exhausted."}, {"time": 5071, "text": "Yes, I believe that's the case with most people."}, {"time": 5075, "text": "You should come out of the training session with your mind buzzing with ideas, like possibilities for tomorrow."}, {"time": 5081, "text": "And by the way, on that note, I would go further and say that the training session doesn't finish when your body stops moving."}, {"time": 5088, "text": "It finishes when your mind stops moving, and your mind shouldn't stop moving."}, {"time": 5093, "text": "After that session, there should be analysis."}, {"time": 5095, "text": "What did I do well?"}, {"time": 5095, "text": "What did I do badly?"}, {"time": 5097, "text": "How could I do better with the things that I did well?"}, {"time": 5100, "text": "Can I ask you about something that I truly enjoy and I think is really powerful, but most people don't seem to believe in that, but is drilling?"}, {"time": 5111, "text": "Maybe people are different, but I love the idea, maybe even outside of jiu jitsu, of doing the same thing over and over."}, {"time": 5119, "text": "It's like Jiro dreams of sushi."}, {"time": 5121, "text": "I love doing the thing that nobody wants to do and doing it 10 times, 100 times, 1,000 times more than what nobody wants to do."}, {"time": 5134, "text": "So I'm a huge fan of drilling."}, {"time": 5136, "text": "Obviously, I'm not a professional athlete, but I feel like if I actually gave myself, if I wanted to be really good at jiu jitsu, like reach the level of being in the top 25 when I was much younger, like really strive, I think I could achieve it by drilling."}, {"time": 5156, "text": "I had this belief untested."}, {"time": 5159, "text": "Can you challenge this idea or agree with it?"}, {"time": 5163, "text": "First off, fascinating."}, {"time": 5165, "text": "However, we're going to have to disagree."}, {"time": 5169, "text": "We're just gonna have to start to understand what are we talking about when we talk about drilling?"}, {"time": 5175, "text": "It's a very vague term."}, {"time": 5177, "text": "Okay, at this moment, many of your listeners are probably having the same thought process, which is, oh, drilling."}, {"time": 5186, "text": "Yeah, I know what that is."}, {"time": 5187, "text": "We go into the gym and we pick a move and we practice it for a certain number of repetitions."}, {"time": 5194, "text": "And if I do that, I'm gonna get better at the technique."}, {"time": 5198, "text": "Okay, they're wrong."}, {"time": 5206, "text": "We've got to have a much more in depth understanding of what the hell we're talking about when we talk about drilling."}, {"time": 5217, "text": "Ultimately, any movement in the gym that doesn't improve the skills you already have or build new skills is a waste of time, a waste of resources."}, {"time": 5233, "text": "Everything you do should be done with the aim and the understanding that this is gonna make me better at the sport I practice."}, {"time": 5240, "text": "If it's not, shouldn't be there."}, {"time": 5244, "text": "The majority of what passes for drilling in most training halls will not make you better, including some of the most cherished forms of drilling, which is repetition for numbers."}, {"time": 5261, "text": "The moment you say to someone, I want you to do this a hundred times, what are they really thinking about?"}, {"time": 5270, "text": "They're saying, okay, I'm at repetition 78."}, {"time": 5273, "text": "I'm at 80, 20 more to go."}, {"time": 5275, "text": "All they're talking, their primary thought process is on numbers."}, {"time": 5280, "text": "That's not the point of drilling."}, {"time": 5283, "text": "The point is skill acquisition."}, {"time": 5286, "text": "When people drill, don't get them focused on numbers, get them focused on mechanics."}, {"time": 5292, "text": "That's what they have to worry about."}, {"time": 5294, "text": "I never have my students drill for numbers ever."}, {"time": 5297, "text": "Just one, two, three, get the fuck out of here."}, {"time": 5301, "text": "Like how are you gonna get better with that?"}, {"time": 5303, "text": "Okay, get them working on the sense of gaining knowledge."}, {"time": 5308, "text": "That's my job."}, {"time": 5310, "text": "I have to give them knowledge."}, {"time": 5311, "text": "I have to explain to them what they're trying to do."}, {"time": 5314, "text": "That starts them on the right track."}, {"time": 5316, "text": "But knowledge is one thing."}, {"time": 5318, "text": "Skill is another."}, {"time": 5321, "text": "If jiu jitsu was just about knowledge, then all the 60 and 70 year old red belts would be the world champions."}, {"time": 5330, "text": "Jiu jitsu isn't won by knowledge, it's won by skill."}, {"time": 5333, "text": "Knowledge is the first step in building skill."}, {"time": 5338, "text": "So my job as a coach is to transmit knowledge."}, {"time": 5341, "text": "Then I have to create training programs with a path from knowledge to polished skill is carried out."}, {"time": 5351, "text": "That's the interface between me and my students."}, {"time": 5353, "text": "And so I give them drills where the whole emphasis is upon getting a sense where they understand what are the problems they're trying to solve and working towards practical solutions."}, {"time": 5370, "text": "They never work with numbers."}, {"time": 5372, "text": "They work with mechanics and feel."}, {"time": 5376, "text": "Then you have to bring in the idea of progression."}, {"time": 5381, "text": "When you drill, there's zero resistance."}, {"time": 5384, "text": "When you fight in competition, there's 100% resistance."}, {"time": 5388, "text": "You can't go from zero to 100."}, {"time": 5392, "text": "There has to be progress over time where I have them work in drills with slightly increasing increments of resistance."}, {"time": 5404, "text": "And just as we talked about earlier with the weightlifter who doesn't start with 500 pounds, but who begins with the bar and then over time builds the skills that one day out there in the future he will lift 500 pounds."}, {"time": 5416, "text": "So too, that Jujikutami that you're working on today is feeble and pathetic, but five years from now you'll win a world championship with it."}, {"time": 5425, "text": "You can't have this naive idea of drilling."}, {"time": 5428, "text": "It's something you just come out, you randomly pick a move and you work for numbers until you've satisfied a certain set of numbers that your coach threw at you and then think you're gonna get better."}, {"time": 5439, "text": "There's even dangers with drilling."}, {"time": 5445, "text": "There is no performance increase that comes once you get to a certain level and you just keep doing the same damn thing."}, {"time": 5458, "text": "Let's say, for example, you come out and you hit a hundred repetitions of the arm by Jujikutami from guard position."}, {"time": 5466, "text": "And you're all proud of yourself because you hit a hundred repetitions and your body's tired and you're telling yourself, man, I got a good workout."}, {"time": 5472, "text": "And you come in tomorrow, you do exactly the same thing."}, {"time": 5476, "text": "You come in the day after that and a week goes by and you've done the same thing."}, {"time": 5480, "text": "Then a year later, you do the same thing."}, {"time": 5484, "text": "Ask yourself, has your Jujikutami really gotten better?"}, {"time": 5490, "text": "No, you've performed literally thousands and thousands of repetitions."}, {"time": 5494, "text": "You've spent an enormous amount of training time and energy that could have gone in different directions on something which didn't make you any better."}, {"time": 5505, "text": "Drills have diminishing returns."}, {"time": 5509, "text": "Once you get to a certain skill level, if you just keep hammering on the same thing in the same fashion for the same amount of time, you stop getting better."}, {"time": 5521, "text": "Can I, partially for fun, partially for Dallas Advocate, but partially because I actually believe this to push back on some points, is it possible?"}, {"time": 5530, "text": "So everything you said, I think is beautiful and correct."}, {"time": 5533, "text": "But the asking yourself the question, am I getting better?"}, {"time": 5538, "text": "It's a really important one and you could do that in training."}, {"time": 5541, "text": "Is there a set of techniques, maybe a small subset of all the techniques that are in Jiu Jitsu, where you can have significant skill acquisition if you put in the numbers or the time, whatever, on a technique against an opponent who's not resisting?"}, {"time": 5561, "text": "Here's, let me elaborate."}, {"time": 5563, "text": "What I've, in my, maybe I'm different."}, {"time": 5565, "text": "You'll probably have to finish an example."}, {"time": 5569, "text": "Let me first make a general statement and then I can give examples."}, {"time": 5573, "text": "The general statement is I found that through repetitions, and this is high repetitions combined with training, but high repetitions against a non resisting opponent, I've gotten to understand the way my body moves, the way I apply pressure on a human."}, {"time": 5591, "text": "Because it's not actually zero resistance."}, {"time": 5593, "text": "The opponent's still laying there."}, {"time": 5594, "text": "They're still keeping their legs up."}, {"time": 5596, "text": "They're still doing, they might not be resisting, but they're still creating a structure."}, {"time": 5602, "text": "A non dynamic structure."}, {"time": 5603, "text": "They're presenting a target."}, {"time": 5605, "text": "But it's not dynamic."}, {"time": 5607, "text": "So you can't master the timing of things, but you can master the, not master, but I felt like I could gain an understanding of how to apply pressure to the human body over thousands of repetitions."}, {"time": 5623, "text": "Now, for example, I just, just to give you an example to know what we're talking about."}, {"time": 5628, "text": "There's a guy named Saulo Herbaro and Shanji Herbaro that have this, I guess, I already forgot, but the headquarters position or something like that."}, {"time": 5637, "text": "But putting pressure as you pass guard, like medium passing distance kind of pressure."}, {"time": 5644, "text": "I've did thousands of repetitions of that to understand what putting pressure with my hips feels like."}, {"time": 5652, "text": "To truly understand that movement, I felt like I was getting much better."}, {"time": 5657, "text": "It's like, it's hard to put into words, but that skill acquisition is so subtle."}, {"time": 5662, "text": "Just the way you turn your hips."}, {"time": 5665, "text": "But you're already talking about a better form of drilling now."}, {"time": 5668, "text": "You're going beyond the basic numbers and you're getting the sense of feel and mechanics, which is what we want in drilling."}, {"time": 5673, "text": "But the reason I say numbers, and maybe you can speak to this, but this might be an OCD thing, but it allows you to take a journey that doesn't just last a week or two weeks, but a journey where you stay with the technique for two, three years."}, {"time": 5690, "text": "And there's a dedication to it."}, {"time": 5693, "text": "Where it's a long term commitment to where you're forcing yourself, perhaps there's other mechanisms, but you're forcing yourself to stay with a technique longer than most people around you are staying with whatever they're working on."}, {"time": 5707, "text": "And you're taking that long journey."}, {"time": 5709, "text": "And the numbers somehow enforce that persistence and that dedication."}, {"time": 5714, "text": "First thing, that journey's a wonderful thing."}, {"time": 5718, "text": "And if that technique is a crucial part of what you do, then it's time well invested."}, {"time": 5724, "text": "But always understand that it comes at an opportunity cost."}, {"time": 5727, "text": "That by spending that amount of time on that one technique, you've sacrificed other things that you could have learned that could have won you matches."}, {"time": 5735, "text": "So understand that every focus upon one element of the game comes at the opportunity cost of other elements."}, {"time": 5743, "text": "Now, as long as you're playing a part of the game where, okay, this is central to what I do."}, {"time": 5748, "text": "Yes, okay, that's fine."}, {"time": 5750, "text": "But just be aware of the danger of opportunity cost."}, {"time": 5753, "text": "That's something no one talks about in the training room, but it becomes very important."}, {"time": 5757, "text": "Secondly, the other question you have to start asking yourself is, okay, that training clearly had benefits for you early on."}, {"time": 5765, "text": "But when the point of diminishing return starts coming and if you feel you're just doing the same thing, then it's time to switch."}, {"time": 5772, "text": "Now, if you feel you're still getting benefit from it, by all means, continue."}, {"time": 5777, "text": "That will be a call on your part."}, {"time": 5778, "text": "You've been playing this game a long time now, so I would trust your call on that."}, {"time": 5785, "text": "But my job as a coach is to look out and say, okay, this kid's been working cross Ashigarami for six months and I feel he's gotten to a good skill level."}, {"time": 5797, "text": "If he stays any further on it, the opportunity cost becomes greater than the expected benefits of continuing it."}, {"time": 5805, "text": "And that's my job as a coach, is to direct things in that fashion."}, {"time": 5808, "text": "If I can do a good job with that, then I can take them to the next level of drilling and start amping it up."}, {"time": 5814, "text": "And that's how I keep progress over time."}, {"time": 5816, "text": "My biggest fear is to have students run past the point of diminishing returns, staying stagnant where opportunity costs comes in and they're not making the progress they could in the time that they've been working."}, {"time": 5833, "text": "I mean, that was, it was almost a philosophical question for me."}, {"time": 5836, "text": "That's what I was always on a search on because I know my mind is likes drilling."}, {"time": 5842, "text": "I don't like relying on other people for improvement and drilling allows me to do something that is 100% me."}, {"time": 5853, "text": "It's interesting Lex, you say you don't like relying on other people in drilling, but in drilling, you really do rely a lot on your partner."}, {"time": 5859, "text": "One of the first things I do when I coach people is I teach them how to drill."}, {"time": 5863, "text": "That's a skill in itself."}, {"time": 5864, "text": "And drilling is in a sense, the opposite of sparring."}, {"time": 5873, "text": "Drilling is a cooperative venture where you work as dance partners, complimenting each other's movement."}, {"time": 5881, "text": "If I drill with Gordon Ryan and I want him to work on bars, I will move my body in ways which make it an interesting exercise for Gordon."}, {"time": 5891, "text": "I'm not just sitting there and he does a repetition and I'm, okay, he does 10."}, {"time": 5898, "text": "I can't wait for this to be over so I can do my 10 and I can't wait for all this to be over so we can just spar and get over all this bullshit."}, {"time": 5905, "text": "That's the sad truth of most drilling in Jiu Jitsu."}, {"time": 5910, "text": "There's a sense in which when good people drill, it's like watching good people dance."}, {"time": 5916, "text": "They move in unison and compliment each other's movement and make each other look better."}, {"time": 5922, "text": "Sparring, on the other hand, is the exact opposite of that."}, {"time": 5924, "text": "That's resistance where you're trying to make the other person look as bad as possible."}, {"time": 5928, "text": "And once you understand the different directions in which drilling and sparring go, that's when things start getting interesting."}, {"time": 5934, "text": "You start getting fast progress."}, {"time": 5936, "text": "Yeah, you're absolutely right."}, {"time": 5939, "text": "I think I was not very eloquent describing what I mean."}, {"time": 5942, "text": "I found myself not able to find in Jiu Jitsu too many people that are willing to dedicate a huge amount of time to a particular technique."}, {"time": 5952, "text": "I concur with you on Netflix."}, {"time": 5955, "text": "Now, answer the interesting question, why?"}, {"time": 5958, "text": "Why can't you get people to drill with you?"}, {"time": 5961, "text": "By the way, if I could just shout out the people that did drill with me is usually blue belt women because they're smaller, they don't like training because they get their ass kicked because they're much smaller."}, {"time": 5976, "text": "So they're willing to invest a significant amount of effort into training."}, {"time": 5984, "text": "That's good, but their motivation for doing so is not good."}, {"time": 5989, "text": "But your motivation for drilling is because you don't want to get your ass kicked."}, {"time": 5992, "text": "That's not a good motivation."}, {"time": 5992, "text": "No black belt ever."}, {"time": 5995, "text": "I could never find a black belt that I could drill with like this."}, {"time": 5999, "text": "Now let's go back to that question, why?"}, {"time": 6001, "text": "I don't mean this, I am somebody who likes to say nice things about people."}, {"time": 6006, "text": "So let me answer for you."}, {"time": 6009, "text": "Two reasons, because they find it boring."}, {"time": 6013, "text": "And secondly, perhaps more importantly, they don't believe it works."}, {"time": 6016, "text": "Yeah, those are good answers."}, {"time": 6018, "text": "And now let's go further and ask the truly interesting question."}, {"time": 6022, "text": "Why do they believe that?"}, {"time": 6023, "text": "If I were to answer it in the context of Russian wrestling, where drilling is much bigger part, is I think culturally that was knowledge that everybody tells each other in Jiu Jitsu that drilling doesn't work."}, {"time": 6044, "text": "Because they never taught how to drill."}, {"time": 6047, "text": "No one ever sits you down one day and says, okay, this is how you drill."}, {"time": 6050, "text": "And so the exercise feels futile."}, {"time": 6054, "text": "They don't feel their skill level is going up."}, {"time": 6055, "text": "They don't associate drilling with increased skill level."}, {"time": 6059, "text": "They associate sparring with increased skill level, but not drilling, which is a tragedy because it is a fantastic way to introduce and expand the repertoire of a developing student."}, {"time": 6071, "text": "It's an essential part of every workout I teach."}, {"time": 6074, "text": "I always say the game of Jiu Jitsu begins with knowledge and builds up to skill."}, {"time": 6080, "text": "Who wins is the one who has greater skill and nine times out of 10."}, {"time": 6085, "text": "So to me, it's a tragedy that what you're saying breaks my heart to hear that you couldn't get a black belt to drill with you, that's shameful."}, {"time": 6094, "text": "But I understand, I sympathize with those black belts too because the way in which most people are told to drill does feel ineffective and it is damn boring."}, {"time": 6104, "text": "They'd rather just spar."}, {"time": 6106, "text": "They feel like they get more out of the workout."}, {"time": 6108, "text": "And that's, if anything, an indictment upon most of the training programs around the nation."}, {"time": 6114, "text": "Would you say that drilling, if you were to build a black belt world champion, would drilling be, what percent of their training, in the entirety of their career would be drilling?"}, {"time": 6130, "text": "Let's first put a proviso on it that I don't do the same thing for all athletes."}, {"time": 6134, "text": "Everyone's got a different personality."}, {"time": 6136, "text": "And like Nicky Rod, I can only hold his attention for two minutes at a time."}, {"time": 6140, "text": "And Gary Tonin, five minutes."}, {"time": 6146, "text": "Gordon Ryan, five hours."}, {"time": 6148, "text": "Like George St. Pierre, five hours."}, {"time": 6151, "text": "Travis Stevens, five hours."}, {"time": 6153, "text": "They are just laser focused."}, {"time": 6155, "text": "So everyone's different."}, {"time": 6156, "text": "Let's put that down as our first proviso."}, {"time": 6160, "text": "You probably knew those answers already."}, {"time": 6165, "text": "But as a general rule, if I run a two and a half hour class, you can expect an hour and a half of it to be, I'm going to use the word drilling, but I'm also going to say that this is too complex of a story to give now with words."}, {"time": 6183, "text": "I would need to demonstrate it."}, {"time": 6185, "text": "But the way in which we drill is not your standard method of drilling."}, {"time": 6188, "text": "And then it's into sparring."}, {"time": 6191, "text": "But if you give me a choice between a bad drilling partner and sparring, I could make the same choice that most black belts make, which I would go with sparring."}, {"time": 6201, "text": "Because you can create drilling within the sparring environment."}, {"time": 6206, "text": "Like good drilling is a wonderful thing."}, {"time": 6208, "text": "Bad drilling is just a worthless waste of time."}, {"time": 6213, "text": "Okay, before, I have a million questions for you, but I have to ask, can you, we've described the fundamentals of jiu jitsu."}, {"time": 6221, "text": "Can we describe the principles, the fundamentals of one of the interesting systems you've developed, which is the leg lock system?"}, {"time": 6229, "text": "Yeah, anything in particular or just like a general understanding of what are some of the major principles of it?"}, {"time": 6235, "text": "Well, it's like me coming to Miyamoto Musashi and asking, can you describe the principles of sword fighting?"}, {"time": 6243, "text": "You're too generous."}, {"time": 6246, "text": "Let's start off with some context."}, {"time": 6248, "text": "When I began the sport of jiu jitsu, I was taught a fairly classical approach to jiu jitsu, which leg locks were a part of it, but not an emphasized part of it."}, {"time": 6266, "text": "The overall culture of the times is the mid 1990s."}, {"time": 6270, "text": "The overall culture of the time saw leg locks as largely ineffective."}, {"time": 6281, "text": "It was, we were told that against good opposition, they just didn't work very well."}, {"time": 6286, "text": "They were low percentage techniques."}, {"time": 6288, "text": "We were also told that they were tactically unsound because if you ever attempted them and you lost control of the leg lock, your opponent would end up on top of you or in some kind of good position and you'd be in terrible trouble."}, {"time": 6304, "text": "And we were also told that they were unsafe, that if they were applied in the gym, there'd be far too many injuries and people would be badly hurt."}, {"time": 6313, "text": "And that was the received wisdom of that time."}, {"time": 6316, "text": "And so I didn't even work with them at all."}, {"time": 6321, "text": "And they would be shown occasionally in the gym and you'd learn them, you'd drill them."}, {"time": 6326, "text": "But in sparring, I showed no interest."}, {"time": 6333, "text": "You probably know that change when I met the great American grappler, Dean Lister, who early in his career was using Achilles locks with considerable success."}, {"time": 6342, "text": "I met him in the gym, wonderful fellow."}, {"time": 6345, "text": "And... Achilles locks is like a straight full lock."}, {"time": 6348, "text": "Yes, that's correct, yes."}, {"time": 6349, "text": "And he went on to become a heel hooker and win 280 CCs later on in his career."}, {"time": 6356, "text": "But we never met again after that."}, {"time": 6359, "text": "And that opened some doors of inquiry and... Well, he asked this first principles question is why would you only use half the body in a game that involves the human body?"}, {"time": 6374, "text": "Perfect sense."}, {"time": 6375, "text": "So that opened doors to inquiry."}, {"time": 6378, "text": "And if you looked around the Jiu Jitsu world at that time, the number of specialized leg lockers was very small."}, {"time": 6387, "text": "And most of them were from outside of conventional Jiu Jitsu."}, {"time": 6394, "text": "For example, you could look around and see people like Romina Sato had sharp leg locks for that time period in the 1990s."}, {"time": 6403, "text": "So they were out there, they existed."}, {"time": 6405, "text": "And you'd see people like Ken Shamrock would use heel hooks in competition and he had some good success with them."}, {"time": 6415, "text": "When I began experimenting in the gym, fairly soon, certain truths started to become evident."}, {"time": 6423, "text": "And the most important of these can be understood very quickly."}, {"time": 6429, "text": "And they were relatively easy to discover."}, {"time": 6433, "text": "The first was that most people, when they went to understand and study leg locking."}, {"time": 6444, "text": "And when I talk about leg locking, I'm gonna talk about one specific type, which is the most high percentage type."}, {"time": 6449, "text": "This is leg locks, which are performed with entanglements of your opponent's legs with your legs."}, {"time": 6455, "text": "There are other forms of leg lock, but these are relatively low percentage and don't figure heavily in competition."}, {"time": 6459, "text": "So I'll ignore them."}, {"time": 6463, "text": "Most people made no distinction between the mechanism of control versus the mechanism of breaking."}, {"time": 6471, "text": "The heel hook is what ultimately breaks the ankle."}, {"time": 6476, "text": "But the mechanism of control is the entanglement of your legs to your opponent's legs."}, {"time": 6481, "text": "The Japanese term ashigurami literally just means like leg entanglement."}, {"time": 6485, "text": "It's a generic term."}, {"time": 6486, "text": "It could apply to any form of entanglement."}, {"time": 6488, "text": "There are many options."}, {"time": 6490, "text": "My idea was let's focus on the entanglement first and worry about the breaking mechanism second."}, {"time": 6499, "text": "This was analogous to the idea of position before submission."}, {"time": 6503, "text": "Only you couldn't talk about it in terms of conventional positions because ashigurami doesn't really fit into the traditional hierarchies, positional hierarchies of jiu jitsu."}, {"time": 6513, "text": "So the conversation was switched from position to submission to control to submission."}, {"time": 6520, "text": "Now, wrapping two of your legs around one of your opponent's legs gives you many different options."}, {"time": 6526, "text": "You can do it with your feet on the outside, so called 50, 50 variations."}, {"time": 6530, "text": "You can do it with your feet on the inside and form what we call inside foot position."}, {"time": 6539, "text": "There's pros and cons to both."}, {"time": 6540, "text": "There's also methods of harmonizing the two."}, {"time": 6543, "text": "So you have one foot on the inside and one foot on the outside."}, {"time": 6545, "text": "You can do it with a straight leg where you heel hook from the outside or you can bring the leg across your center line and heel hook from the inside."}, {"time": 6555, "text": "You will start to notice as you work through these different variations that some present advantages over others."}, {"time": 6564, "text": "All of them come at a price to some degree, regardless of which ashigurami option you use."}, {"time": 6572, "text": "There will be some degree of foot exposure on my part to my opponent and some degree of back exposure on my part relative to my opponent."}, {"time": 6580, "text": "So that's the downside of it."}, {"time": 6582, "text": "Variations within those different ashigurami enable you to lessen danger in some respects and at the price of gaining dangers in others."}, {"time": 6594, "text": "So you get this wide array of choices."}, {"time": 6598, "text": "There's not this kind of simplistic hierarchy that you see in the basic position."}, {"time": 6603, "text": "The basic positions of jiu jitsu, but there are hierarchies."}, {"time": 6607, "text": "I do, for example, generally favor inside heel hooks over outside heel hooks."}, {"time": 6613, "text": "If I feel my opponent is very good at exposing my back while I'm in ashigurami, I generally prefer 50, 50 situations."}, {"time": 6623, "text": "If I believe my opponent is very good at counter leg locks, I generally prefer my feet on the inside working with variations of insides and kaku, et cetera, et cetera."}, {"time": 6632, "text": "So there are broad heuristic rules that we can give to work in these situations."}, {"time": 6641, "text": "Once you start to understand there's a variety of entanglements you can use, then you start getting into the really interesting ideas that as you perform one given attack, one given heel hook, you can flow through different forms of ashigurami where you can create new dangers and avoid possible pitfalls in a very short timeframe as you switch from one ashigurami to another over time."}, {"time": 6674, "text": "So that as your opponent's lines of resistance to an initial attack change, you can accommodate those by switching to another form of ashigurami so that your mechanism of control is always pointing in opposite directions of his escape."}, {"time": 6688, "text": "And if you focus on this idea of control through the legs, you can completely change the nature of leg locking and take it away from what it was in the 1990s an opportunistic method of attack based upon surprise, speed and power into one based on control."}, {"time": 6707, "text": "If you can do this, you can undermine many of the basic criticisms of leg locking which were prevalent when I began."}, {"time": 6717, "text": "I began the sport of jiu jitsu."}, {"time": 6721, "text": "For example, if I can completely control and immobilize you, I can perform the lock very, very safely."}, {"time": 6730, "text": "If my only way of breaking your leg is to be faster and more powerful than you, nine times out of 10 when I apply it, I'm gonna hurt your leg as much by accident as anything."}, {"time": 6739, "text": "But if I can completely immobilize you and as every attempt you make to escape, I can follow you and immobilize you in new directions, then I can apply the lock with as much force or as little force as possible."}, {"time": 6753, "text": "And so you'll see in our training room despite over considerably more than two decades, sorry, a decade and a half now of heel hooking using these methods, the number of people severely injured by heel hooks is tiny."}, {"time": 6770, "text": "I would say I've seen more people injured by far by kimuras in the time I've been training than I have by heel hooks, despite them having a similar twisting dynamic to them."}, {"time": 6785, "text": "If you build a culture where people focus on control rather than speed of execution, then the injury rate goes down appreciably."}, {"time": 6795, "text": "The whole idea of positional loss, everyone was critical of leg locks."}, {"time": 6798, "text": "Now, if you go for leg locks and they don't work, well, now you're in trouble."}, {"time": 6801, "text": "The guy's gonna be on top of you."}, {"time": 6803, "text": "They never make that criticism with armbars."}, {"time": 6806, "text": "Okay, you can be in the mounted position, go for an armbar, end up on bottom, lose the armbar and lose position, but I've never heard anyone criticize armbars on that account."}, {"time": 6814, "text": "More importantly, I believed from early on that the best place to attack leg locks is not top position, it's bottom position."}, {"time": 6823, "text": "You'll see that over 90% of my athletes attack leg locks from underneath people, not on top of people."}, {"time": 6828, "text": "So there is no positional loss."}, {"time": 6830, "text": "You're already underneath them."}, {"time": 6831, "text": "And so that criticism was null and void."}, {"time": 6836, "text": "And by focusing on this idea of breaking down and distinguishing between the mechanism of control and the mechanism of breaking, that created something new and something interesting."}, {"time": 6849, "text": "There was also another advantage that I had in terms of creating influence with leg locking."}, {"time": 6857, "text": "When you look at the great leg lockers of the past, they were basically iconoclasts."}, {"time": 6861, "text": "They were people who came out of nowhere who just had this remarkable success with leg locks."}, {"time": 6870, "text": "But they were just seen as unique individuals."}, {"time": 6876, "text": "They had their game and they were good at it."}, {"time": 6879, "text": "What was unique about the squad is you had not just one person, but a team of people who came out and did pretty much the same thing."}, {"time": 6887, "text": "These people had very different body types and very different personalities."}, {"time": 6892, "text": "So it wasn't that one kind of body type was good at it."}, {"time": 6895, "text": "You had tall people like Gordon Ryan."}, {"time": 6897, "text": "You had short people like Nikki Ryan."}, {"time": 6900, "text": "You had someone in the middle like Gary Tonin."}, {"time": 6903, "text": "You had fast people like Gary Tonin."}, {"time": 6905, "text": "You had slow people like Gordon."}, {"time": 6908, "text": "There was every kind of body type involved."}, {"time": 6912, "text": "And it was like, people could see this was different because it worked for an entire team as opposed to a unique individual who had unique attributes."}, {"time": 6921, "text": "And then started to foster the belief that if it can work for a team, it can work for anyone, which means it can work for me."}, {"time": 6931, "text": "And I think that had a big effect."}, {"time": 6933, "text": "That's why I owe a lot to those early students, Gordon Ryan, Gary Tonin, Eddie Cummings, and Nikki Ryan."}, {"time": 6944, "text": "And those four kids came from nowhere."}, {"time": 6950, "text": "Gary had some success in grappling, like low level success in grappling before becoming a full time member of the squad."}, {"time": 6960, "text": "But the others were just nobodies who no one had known."}, {"time": 6964, "text": "And yet within a five year timeframe, they were all going up against world championship competition and doing exceedingly well."}, {"time": 6973, "text": "And which gives further credence to the idea of the five year program."}, {"time": 6978, "text": "And I think by operating as a team, those young men did an incredible job of convincing the grappling world that this wasn't just about, well, they're just different or it works for their body type or them as individuals."}, {"time": 6995, "text": "It was like, no, if a team can do it, anyone can do it."}, {"time": 6999, "text": "And I think that's what really convinced people that this was something worth studying."}, {"time": 7004, "text": "This is something that could be a big part of their lives."}, {"time": 7006, "text": "But also convinced you and convinced each other in those early days when you're developing the science."}, {"time": 7012, "text": "Essentially what was missing is an entire science and system of leg locks."}, {"time": 7017, "text": "Because it's not like you knew for sure that there's a lot here to be discovered in terms of control."}, {"time": 7024, "text": "You perhaps hadn't, just like you said, an initial intuition, but you have to have enough, there's perseverance required to take, it's the Johnny Ive thing to take from the initial idea to an entire system."}, {"time": 7037, "text": "Is there a sense you have about how complicated and how big this world of control in leg locks is?"}, {"time": 7050, "text": "How complicated is it?"}, {"time": 7051, "text": "You've achieved a lot of success."}, {"time": 7053, "text": "You have a lot of powerful ideas in terms of inside, outside, what's high percentage, what's not, what's higher reward, what's a low risk, all those kinds of things."}, {"time": 7062, "text": "And then you also mentioned kind of transitions, not transitions, but how you move with your opponent to resist their escape through control."}, {"time": 7073, "text": "How much do you understand about this world?"}, {"time": 7075, "text": "This is a fascinating question."}, {"time": 7079, "text": "As a general rule, the most powerful developments are always at the onset of a project, okay?"}, {"time": 7090, "text": "The jet engine was, I believe, first conceived in the late 1930s, just around the time of World War II."}, {"time": 7100, "text": "It was developed with great pace because of World War II."}, {"time": 7105, "text": "Obviously, military research was a huge thing back then."}, {"time": 7108, "text": "And first fielded, I believe, by the jet engine, first fielded, I believe, by the Germans in around 1943."}, {"time": 7120, "text": "Jet aircraft didn't play a big role in World War II."}, {"time": 7124, "text": "They were there at the end and they did play a significant role, but in terms of numbers, they just weren't there."}, {"time": 7132, "text": "So by around 1945, you had the onset of the jet age and the jet engine began to replace the piston engine in most aircraft."}, {"time": 7141, "text": "It was the new way of doing things."}, {"time": 7146, "text": "If you look at the pace of development of jet engine aircraft technology from 1945 to 1960, it is unbelievable."}, {"time": 7161, "text": "There was a solid decade where they were gaining almost 100 miles an hour per year for a decade."}, {"time": 7169, "text": "That's a form of growth that, I mean, in the world of engineering, that's the only time you see growth like that is in things like Bitcoin and that's about it, okay?"}, {"time": 7183, "text": "Let's put things in perspective, okay?"}, {"time": 7187, "text": "In World War II, the standard US aircraft bomber was the B17, which was a midsize bomber with a fairly limited load capacity and I think top speed well below 300 miles an hour."}, {"time": 7204, "text": "Just 10 years later, you had the B52, which could fly across continents and deliver nuclear weapons and carry bomb loads of up to 70,000 pounds."}, {"time": 7217, "text": "In a decade, that happened."}, {"time": 7221, "text": "If you took a B17 pilot in 1943 and put them inside a B52 a decade later, he would literally think he was on a UFO, a ship from another planet."}, {"time": 7232, "text": "That was the speed of development."}, {"time": 7236, "text": "Now, contrast that with the speed of modern development."}, {"time": 7240, "text": "If I took you in a time machine and I put you in a civil airliner in 1972, let's say a Boeing 737, it's not that different from what you fly in today."}, {"time": 7255, "text": "Flies at the same speed, has the same range, flies at the same altitude."}, {"time": 7261, "text": "It's not that different."}, {"time": 7262, "text": "The amount of progress between 1973 and 2020 isn't very impressive, but the amount of progress from 1945 to 1955, or even better, 1960 was staggering."}, {"time": 7278, "text": "And so the initial progress tends to be meteoric, but after that, it tends to be incremental."}, {"time": 7285, "text": "That said, there's a guy named Elon Musk."}, {"time": 7290, "text": "There's been almost no development in terms of space rocket propulsion and rocket launches and going out into orbit or going out into deep space."}, {"time": 7305, "text": "And one guy comes along, one John Donahue type character, and says, it doesn't make sense why we don't use reusable rockets, why we don't make them much cheaper, why we don't launch every week as opposed to every few years."}, {"time": 7320, "text": "It doesn't make any sense why we don't go to the moon again over and over and over."}, {"time": 7325, "text": "It doesn't make any sense why we don't go to Mars and colonize Mars."}, {"time": 7329, "text": "It feels like it's not just a single jump to a B52."}, {"time": 7335, "text": "It's a series of these kinds of jumps."}, {"time": 7338, "text": "So the question is, is there another leap within the leg locking system?"}, {"time": 7344, "text": "Time will tell."}, {"time": 7346, "text": "I do believe that we're in a phase now where the really big jumps have already been made and we're in the incremental phase at this point."}, {"time": 7357, "text": "What I do believe is that you will start to see new directions start to emerge, where you start to see the interface between leg locking and race link, for example."}, {"time": 7366, "text": "The interface between leg locking and back attacks."}, {"time": 7369, "text": "And that will provide new avenues of direction which will create new spurts of growth."}, {"time": 7377, "text": "But in terms of breaking people's legs, just the simple act of breaking legs, I believe we're in the incremental phase now rather than the meteoric phase."}, {"time": 7386, "text": "Let me ask you a ridiculous question."}, {"time": 7388, "text": "How hard is it to actually break a leg?"}, {"time": 7392, "text": "I remember, because I'm a big fan of the straight foot lock, not, again, we're talking about to the standing Seoi Nage."}, {"time": 7399, "text": "Maybe it's my Russian roots with Samba or something like that."}, {"time": 7402, "text": "Maybe it's the Dean Lister, Achilles lock."}, {"time": 7406, "text": "But I love, maybe it's my body, something like that."}, {"time": 7410, "text": "I just love the squeeze of it, the control and the power of a straight foot lock."}, {"time": 7418, "text": "And I remember trying to, there's a few people in competition that didn't want to tap."}, {"time": 7427, "text": "And I remember in particular, there was one person, again, the finals match, Purple Belt."}, {"time": 7434, "text": "I remember it was a straight foot lock, it was perfect."}, {"time": 7436, "text": "Everything just perfect."}, {"time": 7438, "text": "And I remember going all in and there was a pop, pop, pop."}, {"time": 7443, "text": "And I couldn't do anything more."}, {"time": 7445, "text": "It wasn't breaking."}, {"time": 7446, "text": "It was just bending and bending and bending."}, {"time": 7449, "text": "And there's damage to it of some kind."}, {"time": 7452, "text": "But I wanted to like, you know, I wanted to see, first of all, it's very difficult psychologically because it's like, can I be violent here?"}, {"time": 7460, "text": "That was a whole nother thing."}, {"time": 7462, "text": "With adrenaline, you can't really think that fast."}, {"time": 7465, "text": "But I also thought like, where else is there to go?"}, {"time": 7467, "text": "Like, is it the shin going to break?"}, {"time": 7469, "text": "What is it supposed to break?"}, {"time": 7471, "text": "So I wondered that."}, {"time": 7471, "text": "Yeah, in the case of the Achilles lock, it's going to be the anterior tibialis tendon."}, {"time": 7476, "text": "That's the, it runs down, there's two of them."}, {"time": 7479, "text": "It'll be the minor one that runs on the outside of the front of the ankle."}, {"time": 7482, "text": "It's not going to be the Achilles tendon."}, {"time": 7484, "text": "A lot of people promulgate this absurdity."}, {"time": 7487, "text": "The Achilles tendon can rupture, but not from pressure."}, {"time": 7491, "text": "Does the tendon or the bone, it's going to break?"}, {"time": 7494, "text": "The bone won't break."}, {"time": 7496, "text": "I have seen on one occasion, a shin bone break from an Achilles lock, but there was an enormous size and strength disparity."}, {"time": 7504, "text": "And there may have been other complicating factors too."}, {"time": 7507, "text": "But in the vast majority of cases, the Achilles lock doesn't really do tremendous damage."}, {"time": 7515, "text": "It can do significant damage."}, {"time": 7517, "text": "You'll definitely feel it the next day, but it's, of all the major locks, it's the one where it is most likely a psychologically strong opponent will be able to absorb damage and go on to win a match."}, {"time": 7528, "text": "In answer to your first question, how difficult is it to break a leg?"}, {"time": 7533, "text": "Not very difficult."}, {"time": 7534, "text": "It will come down to what is the skill level of my opponent's resistance?"}, {"time": 7538, "text": "If your opponent is not resisting and you have an inside heel hook, it is absurdly easy to break a man's leg."}, {"time": 7544, "text": "Not a challenge at all."}, {"time": 7546, "text": "You can be a 105 pound woman, could easily snap the relevant knee ligaments in a 240 pound man's leg if he doesn't know how to defend himself."}, {"time": 7558, "text": "That's an easy thing, very easy to accomplish."}, {"time": 7562, "text": "So the basic answer is yes, it's very easy."}, {"time": 7566, "text": "If your opponent does know how to defend and they can position their foot, play tricks of lever and fulcrum, it becomes significantly more difficult."}, {"time": 7574, "text": "It becomes still more difficult under match conditions where they're actively looking to position their body and work their way out of the lock, then it can become very difficult indeed."}, {"time": 7586, "text": "Always bear in mind that there have been some cases in our history as a team where people have literally just let their knees snap and continue fighting."}, {"time": 7603, "text": "Always remember that submission is a choice when it comes to the joint locks."}, {"time": 7607, "text": "And we've had some people who just made the choice that I'm willing to let my knee break so that I can continue in this match."}, {"time": 7616, "text": "That's a tough decision to make and I admire their bravery."}, {"time": 7620, "text": "Is there something about that, just to speak to that, that you admire?"}, {"time": 7624, "text": "Yes, it's mental toughness."}, {"time": 7627, "text": "Would I agree with it, would I advocate it?"}, {"time": 7629, "text": "No, but that doesn't mean I can't admire aspects of it."}, {"time": 7634, "text": "Who is the greatest grappler ever?"}, {"time": 7638, "text": "You were very astute in the way you asked that question."}, {"time": 7643, "text": "You didn't say the greatest jiu jitsu player of all time, you specified grappler."}, {"time": 7648, "text": "What's the bigger category?"}, {"time": 7649, "text": "Jiu jitsu is the bigger category."}, {"time": 7651, "text": "Jiu jitsu has four faces."}, {"time": 7653, "text": "There is gi competition, there is no gi competition, there is mixed martial arts competition, and there is self defense."}, {"time": 7661, "text": "So jiu jitsu has four aspects."}, {"time": 7664, "text": "Grappling typically refers only to the no gi aspect of jiu jitsu, so it's one out of four possibilities."}, {"time": 7673, "text": "So who's the greatest jiu jitsu practitioner ever, and then who is the greatest grappler ever?"}, {"time": 7678, "text": "I believe that the greatest jiu jitsu player, certainly that I ever met, and I believe of all time, I don't want to sound arrogant on that because really you can only go with your own experiences and there are some great athletes that other people mention that I just never met."}, {"time": 7695, "text": "So, but in my estimation, the greatest jiu jitsu player is Haja Gracie, my reasoning for that is out of the four faces of jiu jitsu, he excelled in three."}, {"time": 7711, "text": "And in two of them in particular, he was the best of his generation by a landslide."}, {"time": 7718, "text": "In gi grappling, no gi grappling, Haja dominated his generation to a degree that is truly impressive."}, {"time": 7731, "text": "What do you attribute that dominance to, by the way?"}, {"time": 7733, "text": "Is there something, if you were to analyze him?"}, {"time": 7736, "text": "Fascinating question, I'll come back to it."}, {"time": 7738, "text": "In mixed martial arts, he was at his peak, I believe ranked in the top 10 in the world of mixed martial arts."}, {"time": 7749, "text": "He wasn't the best in mixed martial arts the way he was in grappling, but he was damn good."}, {"time": 7754, "text": "And he beat some significant people."}, {"time": 7757, "text": "So he showed tremendous versatility, gi, no gi, mixed martial arts."}, {"time": 7761, "text": "He's not really known in the world of self defense, but there's no real criteria by which you would become dominant in self defense."}, {"time": 7768, "text": "So that's kind of a, you can't really judge people by that."}, {"time": 7771, "text": "Believe me, if Haja got into a fight in the street, I'm sure he would do just fine."}, {"time": 7776, "text": "So I have no concerns about that."}, {"time": 7780, "text": "So I would say that if you look at jiu jitsu for what I believe it is, a sport with four faces, I believe you have to go with Haja Gracie as the one who went out and empirically proved his ability to go across those elements and do extraordinarily well in all of them."}, {"time": 7801, "text": "He even made the extraordinary step of coming out of retirement and beating the best of the generation that came after him."}, {"time": 7809, "text": "That's Asha?"}, {"time": 7810, "text": "Yes, that's a truly difficult feat."}, {"time": 7811, "text": "That was incredible."}, {"time": 7812, "text": "Yeah, and a sport which progresses very, very rapidly, that's a truly impressive accomplishment."}, {"time": 7818, "text": "If you ask the question who is the greatest grappler that I've ever seen, I would say I've never seen anyone better than Gordon Ryan."}, {"time": 7829, "text": "Now people are gonna jump when I give these two names."}, {"time": 7832, "text": "They're gonna say, well, Dan, you're close friends with Haja and you're close friends with Gordon, so you're biased."}, {"time": 7838, "text": "I can't answer them to that, it's true."}, {"time": 7842, "text": "I'm good friends with both of them."}, {"time": 7845, "text": "I'm also a notoriously cold and unemotional person and I'm saying this based upon things that I've observed."}, {"time": 7854, "text": "If I honestly believed that I'd seen other people who were better, I would have said it."}, {"time": 7862, "text": "Will that convince the people who criticize me are biased, probably not, but those are the two names that I will mention."}, {"time": 7869, "text": "I think it's an uncontroversial statement to say that Gordon Ryan is one of the greatest grappler ever."}, {"time": 7877, "text": "Yeah, Gordon's obviously a very polarizing figure and people tend to react to Gordon on an emotional level rather than a statistical level and that colors a lot of people's minds, but I also have the benefit that I've seen both of these guys extensively in the gym and that adds a whole new perspective."}, {"time": 7896, "text": "If you think those guys are dominant on the stage, wait till you see them in the gym."}, {"time": 7901, "text": "It's even a different level of domination above and beyond what they did in competition."}, {"time": 7907, "text": "Have they trained against each other in the gym?"}, {"time": 7910, "text": "No, they never trained together."}, {"time": 7911, "text": "They've been in the same gym, I think, only on one occasion."}, {"time": 7913, "text": "When Hodger was stopped by New York, he came by to say hello and Gordon was here at the time."}, {"time": 7919, "text": "They shake hands, they know each other and they're both wonderful people in their own way."}, {"time": 7924, "text": "So I'd like to talk to you about Gordon, Hodger and George GSP."}, {"time": 7933, "text": "Let's first talk about what do you think, because it's very different from my perspective, maybe you can correct me, but very different artists, masters of their pursuits."}, {"time": 7944, "text": "So what makes Hodger so good?"}, {"time": 7948, "text": "Hodger was probably the living embodiment of someone who played a classical jiu jitsu game based around the fundamental four steps of jiu jitsu."}, {"time": 7960, "text": "And like if you took someone who had taken introduction lessons in jiu jitsu for three months, they would recognize the outlines of Hodger's game with many of the techniques they learned in those first three months."}, {"time": 7982, "text": "Hodger was the best example of the dichotomy between the fundamentals of jiu jitsu, but also a kind of hidden sophistication underneath those fundamentals."}, {"time": 7997, "text": "People always say, oh, Hodger's game was so basic."}, {"time": 8000, "text": "No, the outlines of Hodger's game were basic, but the degree of sophistication and the application was extraordinary, and his ability to refine existing technology was truly impressive."}, {"time": 8019, "text": "I never saw anyone in his generation that even came close to his ability, both in competition and in the gym."}, {"time": 8029, "text": "So for people who don't know, Hodger Gracie basically used, just like you said, a very simple techniques on the surface from the outsider's perspective that most people learn when they start jiu jitsu, like passing guard in a very simple way, taking mount and choking from mount."}, {"time": 8049, "text": "Also, when he's on his back, it's closed guard and all the basic submissions from closed guard, arm bar and triangle, and just, that's it."}, {"time": 8060, "text": "And being able to dominate, shut down, and submit."}, {"time": 8065, "text": "So control and submit the best people in the world for many, many years, just like you said, including coming out of retirement and beating the best, perhaps by far the best of the next generation."}, {"time": 8080, "text": "So that just kind of lays out the story."}, {"time": 8083, "text": "Is there some lessons about his systems that you learn in developing your own systems?"}, {"time": 8092, "text": "Excellent question."}, {"time": 8094, "text": "The thing which always impressed me the most about Hodger was his relentless pursuit of position to submission."}, {"time": 8105, "text": "Everything was done with the belief that no victory was worthwhile if it didn't involve submitting his opponent."}, {"time": 8116, "text": "That's a mindset that I tried very, very hard to imbue in my students."}, {"time": 8122, "text": "The easiest path to victory in jiu jitsu is the one which takes the least risk."}, {"time": 8127, "text": "So for example, you will see many modern athletes focus on scoring the first point or the first advantage, and then doing the minimum amount of work to eke out a victory once they've done that."}, {"time": 8140, "text": "They get a small tactical advantage, they realize they're ahead, take no more risks, and just do the minimum amount of work to get the victory."}, {"time": 8149, "text": "Hodger's mindset was always to take the riskier gambit of submission, which entails a lot more work, and in many cases, a lot more skill."}, {"time": 8161, "text": "What I always liked about Hodger is he never tried to play tactics."}, {"time": 8165, "text": "It was always just go out there and try to win by submission."}, {"time": 8171, "text": "And that more than anything, that mindset of looking for the most perfect victory rather than the victory that takes the least skill and the least effort is probably the thing I took from his career the most and tried to work on in my students."}, {"time": 8192, "text": "I always wonder what are the little details he's doing under there when he's in mount, the little adjustments."}, {"time": 8199, "text": "But perhaps that's almost indescribable, the details of that control."}, {"time": 8207, "text": "What makes Gordon Ryan, the greatest grappler of all time, so good?"}, {"time": 8213, "text": "With Gordon, he's also very strong on fundamentals, all of my students are, but he's also obviously a member of a new generation of no geek grapplers that also bring in technologies that weren't really emphasized in previous generations specifically."}, {"time": 8232, "text": "The prolific use of lower body attacks, especially from bottom position."}, {"time": 8240, "text": "This means that he can play a game between upper body and lower body, which was not really a part of Hodges game."}, {"time": 8249, "text": "Nonetheless, you will also see significant similarities."}, {"time": 8252, "text": "He's got a very strong and crushing passing game to mount and a very strong and crushing passing game to the back."}, {"time": 8262, "text": "You will see that the major differences between the two are from bottom position."}, {"time": 8269, "text": "Hodges bottom game is essentially based around his close guard."}, {"time": 8272, "text": "Gordon Ryan's game is based around his butterfly guard."}, {"time": 8275, "text": "So one is based on outside control and one is based on inside control."}, {"time": 8280, "text": "One focuses almost entirely on the classical notion of getting past the legs to the upper body and the other one works between the two as alternatives and sees them as competing alternatives where the stronger you become at one, the more your opponent has to overreact and become vulnerable to the second."}, {"time": 8296, "text": "So they have strong similarities in top position but are very different in bottom."}, {"time": 8302, "text": "He has, from an outsider's perspective, a calm to him in the heat of battle that's inspiring and confusing."}, {"time": 8315, "text": "Is there something you could speak to the psychological aspect of Gordon Ryan?"}, {"time": 8322, "text": "People will talk all day about sports psychology and they will often have heated arguments as to what's the right psychological state to be in when you go out to compete."}, {"time": 8336, "text": "I've never seen any one school of thought which gave noticeably better sports performance than another."}, {"time": 8343, "text": "I've never seen any psychological mindset prove to be reliably more efficient or effective than another."}, {"time": 8353, "text": "I've seen fighters that were scared out of their minds when they went out every time to fight and yet they were very successful."}, {"time": 8360, "text": "I've seen fighters go out who were relaxed and calm and they too can be successful."}, {"time": 8365, "text": "I've seen both mindsets win, I've seen both mindsets lose."}, {"time": 8369, "text": "I've seen every extreme between them."}, {"time": 8371, "text": "What I generally recommend with regards your mind and preparation going in, find what works for you."}, {"time": 8377, "text": "Everyone's different."}, {"time": 8379, "text": "Don't try to give a one size fits all in something as vague and confusing as the human mind."}, {"time": 8387, "text": "Having said that, my preference, I don't force it on people because everyone's different, but my preference is to try and advocate for a mindset of unexceptionalism."}, {"time": 8400, "text": "Most people see competition as something exceptional."}, {"time": 8403, "text": "It's not your everyday grappling session."}, {"time": 8405, "text": "You train 300 times for every time you compete and so they see competition as something exceptional, different, scarier, more nerve wracking."}, {"time": 8414, "text": "There's a crowd watching, there's cameras."}, {"time": 8416, "text": "My reputation is on the line."}, {"time": 8417, "text": "I'm gonna be observed and judged and so they see it as this exceptional event."}, {"time": 8422, "text": "My general preference is to see it as an unexceptional event, to see everything else, the noise, the cameras, the crowd as illusions."}, {"time": 8434, "text": "The only reality is a stage, an opponent on the other side of it and a referee adjudicating you and to make it as unexceptional as possible."}, {"time": 8443, "text": "Gordon does an extraordinarily good job of doing that."}, {"time": 8448, "text": "Gordon looks more tense in most of his training sessions than he does in his competitions because he knows his training partners are typically better than the people he's actually going out to compete against."}, {"time": 8461, "text": "And you see it in his demeanor."}, {"time": 8463, "text": "It's one of just complete calm."}, {"time": 8466, "text": "It also goes back to what we talked about earlier about the power of escapes."}, {"time": 8471, "text": "Gordon Ryan is almost impossible to control for extended periods of time in most of the inferior positions in the sport and most of the submissions."}, {"time": 8481, "text": "So he goes out in the full knowledge that the worst case scenario isn't that bad for him and so nothing could really go that badly wrong."}, {"time": 8489, "text": "He can always recover from any given mistake and go on to victory."}, {"time": 8493, "text": "When you believe those things, you're gonna have a calm demeanor."}, {"time": 8497, "text": "Then if you look at somebody who is quite a bit different than that, George St. Pierre, who at least in the way he describes it, he's basically exceptionally anxious and terrified approaching a fight and he loves training."}, {"time": 8516, "text": "And hates fighting."}, {"time": 8518, "text": "So and just like you said, he made it work for him."}, {"time": 8522, "text": "But he's somebody, he speaks very highly of you."}, {"time": 8526, "text": "He's worked with you quite a bit in training."}, {"time": 8530, "text": "And you've studied him."}, {"time": 8531, "text": "You've worked with him."}, {"time": 8533, "text": "You've coached him."}, {"time": 8535, "text": "Interesting, I've actually coached George for twice the length of any of the squad members."}, {"time": 8540, "text": "So my knowledge of him is far greater than it is for the contemporary squad."}, {"time": 8546, "text": "So can you speak to what makes George St. Pierre, who I think even though I'm Russian and a little bit partial towards Fedor and the Russians, but I think he is in the four categories you mentioned, the greatest mixed martial artist of all time."}, {"time": 8563, "text": "What makes him so good?"}, {"time": 8564, "text": "His approach, his techniques, his mind."}, {"time": 8568, "text": "His approach is certainly part of it."}, {"time": 8570, "text": "George started mixed martial arts at a time when the sport was in a pretty wild phase."}, {"time": 8580, "text": "It was illegal to show on most American TV networks."}, {"time": 8584, "text": "And there was talk about it being banned as a sport."}, {"time": 8589, "text": "In his native Canada, it was banned."}, {"time": 8592, "text": "You could only fight on Indian reservations in Canada."}, {"time": 8595, "text": "I believe his first fight may have been on an Indian reservation."}, {"time": 8600, "text": "So the sport at that stage was very much in its infancy."}, {"time": 8606, "text": "And it's probably fair to say that most of the athletes involved in the sport came from a training program that would probably describe as unprofessional in the contemporary scene."}, {"time": 8625, "text": "George is one of a handful of people who started approaching the sport in a truly professional fashion."}, {"time": 8631, "text": "It was like, OK, here's what great athletes in other sports do."}, {"time": 8634, "text": "I'm going to try to emulate that."}, {"time": 8637, "text": "And his ability to invest in himself."}, {"time": 8644, "text": "In my own experience, for example, George, when I first met him, was a garbage man."}, {"time": 8650, "text": "And he would jump on a bus from Montreal to New York."}, {"time": 8655, "text": "Now, that's a long bus ride."}, {"time": 8656, "text": "He would come down on a Friday afternoon when he finished work as a garbage man, stay for the weekend, and then late on Sunday night, he would jump on a bus all the way back to Montreal and work as a garbage man."}, {"time": 8668, "text": "That's an extraordinary commitment for a young man to make."}, {"time": 8674, "text": "And George was a blue belt at the time."}, {"time": 8678, "text": "And so he would come down."}, {"time": 8679, "text": "And we had a very talented room."}, {"time": 8682, "text": "So he didn't do well in the room when he first came in."}, {"time": 8686, "text": "He was inexperienced in jiu jitsu."}, {"time": 8687, "text": "And the people who went against were considerably better than him at jiu jitsu."}, {"time": 8693, "text": "So imagine investing 25% of your weekly income, maybe even more."}, {"time": 8699, "text": "New York's an expensive town, 50%, to come down and just get your ass kicked month by month."}, {"time": 8707, "text": "Yeah, that says a lot about who he is."}, {"time": 8709, "text": "Tells you a lot."}, {"time": 8711, "text": "First of all, let's talk about the whole idea of delayed gratification here."}, {"time": 8714, "text": "I mean, that's a guy who's saying, this is highly unpleasant."}, {"time": 8719, "text": "But I have a vision of myself in the future."}, {"time": 8722, "text": "And I have to go through this extreme case of delayed gratification to get to that distant goal, which may never happen."}, {"time": 8729, "text": "And that's a level of commitment and self belief, which is just extraordinary."}, {"time": 8735, "text": "I always laugh when people say, oh, George was afraid, so he was mentally weak."}, {"time": 8741, "text": "No, that's a very, very shallow understanding of mental strength and weakness."}, {"time": 8750, "text": "George felt anxiety."}, {"time": 8753, "text": "But let's understand from the start, there's different kinds of mental strength."}, {"time": 8757, "text": "And the most important kind isn't whether you feel fear or don't feel fear before you step into fight."}, {"time": 8763, "text": "The most important form of mental strength is discipline and training."}, {"time": 8769, "text": "That's where most people break."}, {"time": 8771, "text": "I know dozens of people who are fearless to fight, but you couldn't get them to come into the gym for three months in a row and work on skills."}, {"time": 8779, "text": "So they're mentally strong one way, they don't feel fear."}, {"time": 8782, "text": "But they're mentally weak in another, which is to instill the discipline which keeps you on a road to progress over time."}, {"time": 8789, "text": "That's much tougher than not feeling fear before you go out to fight."}, {"time": 8793, "text": "Understand also that when George talks about fear, he's not afraid of his opponent."}, {"time": 8799, "text": "He's afraid of failure."}, {"time": 8803, "text": "He's got high standards."}, {"time": 8805, "text": "Someone who's got high standards can change the world."}, {"time": 8810, "text": "His standards were very, very high."}, {"time": 8812, "text": "That's what he was afraid of."}, {"time": 8814, "text": "He wasn't afraid of his opponents."}, {"time": 8816, "text": "And yet, that's always been the misinterpretation."}, {"time": 8818, "text": "He wasn't mentally weak."}, {"time": 8819, "text": "He was mentally strong as an ox."}, {"time": 8822, "text": "To stay in his training regimen year after year after year and do so while he became one of the first stars in mixed martial arts to actually make money."}, {"time": 8833, "text": "And it gets tough to stay in the training gym with people who are young and hungry and want to punch you in the face."}, {"time": 8839, "text": "You're coming out of a luxury room, living in finery towards the end of his career and still training as hard as ever."}, {"time": 8846, "text": "That's an impressive thing."}, {"time": 8848, "text": "And always he valued perfection."}, {"time": 8850, "text": "And you're right, the fear was not achieving the perfection."}, {"time": 8854, "text": "Is there something you've observed about the way he approaches training that stands out to you?"}, {"time": 8866, "text": "Or is it simply the dedication?"}, {"time": 8868, "text": "No, it's never just about dedication."}, {"time": 8869, "text": "There's lots of dedicated people in the world, but most of them are unsuccessful."}, {"time": 8876, "text": "If you want to be the best in the world at anything, you have to do, out of the many skills of whatever industry you're in, you have to take at least one of those skills and be the best in the world at it."}, {"time": 8898, "text": "There's many skills in mixed martial arts."}, {"time": 8901, "text": "But George identified one skill, which is the skill of striking to take downs."}, {"time": 8908, "text": "He calls it shootboxing."}, {"time": 8912, "text": "Shootboxing was barely even a category of skill when George began."}, {"time": 8918, "text": "It was just the idea that wrestlers grabbed people and took them down the same way they did in wrestling."}, {"time": 8924, "text": "And you threw some punches before you did it."}, {"time": 8928, "text": "George largely pioneered the science of creating an interface between striking and take downs."}, {"time": 8942, "text": "He did it at a time where no one else before him had made it into a system or a science."}, {"time": 8951, "text": "He did it largely on his own."}, {"time": 8954, "text": "And I've always said George is the only athlete that I ever coached who taught me more than I taught him."}, {"time": 8965, "text": "And almost singlehandedly, he created this strong sense of shootboxing as a science, which enabled him throughout his career to determine where the fight would take place."}, {"time": 8984, "text": "Would it be standing, or would it be on the ground?"}, {"time": 8987, "text": "And that, more than anything else, was the defining characteristic of his success."}, {"time": 8991, "text": "I will always be immensely impressed by his accomplishment in that regard."}, {"time": 8997, "text": "He was an innovator."}, {"time": 8998, "text": "He did things differently."}, {"time": 9000, "text": "This is such an important point."}, {"time": 9002, "text": "You can't go out there in combat sports and do the same things that everybody else is doing and expect to get different results."}, {"time": 9011, "text": "Life doesn't work that way."}, {"time": 9013, "text": "If you want to be dominant, you've got to find one important part of the sport, and preferably more important than the rest of the sport, and preferably more than one, and be the best in the world at it."}, {"time": 9024, "text": "You can't be weak at anything, but you can't be strong at everything either."}, {"time": 9028, "text": "Life's not long enough for us to develop a truly complete skill set."}, {"time": 9032, "text": "So you've got to be good at everything, and you've got to be the best at at least one thing."}, {"time": 9036, "text": "And George was the best at two."}, {"time": 9038, "text": "In his era, he was the best at striking to takedowns, and he was the best at integrating striking and grappling on the floor."}, {"time": 9049, "text": "Let me ask you a completely ridiculous question, but it's a fascinating one for me from an engineering and a scientific perspective."}, {"time": 9058, "text": "When I look at a sport, really any problem, one way to ask how difficult is this problem is to see how can I build a machine that competes with a human being at that problem."}, {"time": 9073, "text": "You can look at chess."}, {"time": 9074, "text": "You can look at soccer, Robocup, and then you can look at grappling."}, {"time": 9082, "text": "There's something about when you start to think, how would I build an AI system, a robot that defeats somebody like a Gordon Ryan, where it forces you to really think about formalizing this art as an engineering discipline in the same way you do, but you still have some art injected in there."}, {"time": 9106, "text": "There's no space for art when you actually have to build the system."}, {"time": 9109, "text": "That's not a ridiculous question."}, {"time": 9110, "text": "That's a damn interesting question."}, {"time": 9112, "text": "Let's put aside, like I mentioned with the Boston Dynamics spot robots, what people don't realize is the amount of power they can deliver is huge."}, {"time": 9122, "text": "So let's take that weapon aside, just the amount of force you're able to deliver."}, {"time": 9127, "text": "Yeah, I'm glad you're specifying that."}, {"time": 9130, "text": "So essentially, your question is, can a talented group of engineers create a robot which could defeat Gordon Ryan?"}, {"time": 9138, "text": "On the face of it, as you just pointed out, that's the easiest project in the world, just create a robot that carries a nine millimeter automatic and shoot them five times in the chest."}, {"time": 9148, "text": "Okay, that's it, Gordon Ryan's done."}, {"time": 9150, "text": "So that's not the interesting question."}, {"time": 9152, "text": "The interesting question, and if I understand you correctly, is if we had the ability to create a robot whose physical powers were identical to Gordon Ryan, not inferior and not superior, what would it take to create a mind inside that robot that would beat Gordon Ryan in the majority of matches?"}, {"time": 9173, "text": "Yeah, and there's two ways to build AI systems."}, {"time": 9176, "text": "This is true for autonomous driving, for example, which has been quite contested recently."}, {"time": 9183, "text": "So one is you basically, one way to describe it is you have a giant set of rules."}, {"time": 9189, "text": "It's like this tree of rules where you apply in different condition when there's a pattern you see, you apply a rule and they're hard coded in."}, {"time": 9197, "text": "You basically get like a John Donr type of character who tries to encode, hard code into the system, all the moves you should do in every single case."}, {"time": 9209, "text": "Of course, you can't actually do that fully."}, {"time": 9212, "text": "So you're going to be taking shortcuts, what are called heuristics, just a basic kind of generalizations and apply your own expertise as an expert of, in this case, grappling, to see how that can be coded as a rule."}, {"time": 9229, "text": "Now, the other approach, Elon Musk and Tesla are taking this approach, which is called machine learning, which is create a basic framework of the kind of things you should be observing and what are the measures, metrics of success, and then just observe and see which things lead to success, more success and which lead to less success."}, {"time": 9256, "text": "And there's a delta."}, {"time": 9257, "text": "Like when you see a thing, first of all, the way machine learning works is you predict, you see a position or you see a situation and then you predict how good that is and then you watch how it actually turns out and if it's worse or better, you adjust your expectations."}, {"time": 9274, "text": "And through that process, you can learn quite a lot."}, {"time": 9279, "text": "The challenge is, and this might be a very true challenge in grappling, is like in driving, you can't crash."}, {"time": 9292, "text": "So there's a physical world."}, {"time": 9295, "text": "In chess, for example, where this approach has been exceptionally successful, you can work in simulation."}, {"time": 9302, "text": "So you can have AI system that, for example, as in the case with AlphaZero by DeepMind, Google's DeepMind, it can play itself in simulation millions of times, billions of times."}, {"time": 9316, "text": "It's difficult to know if it's possible to do that in simulation for anything that involves human movement, like grappling."}, {"time": 9328, "text": "So that's, my sense is, if we first look at the hard encoding, if you were to try to describe Gordon Ryan to a machine, how many rules are in there, do you think?"}, {"time": 9341, "text": "Yeah, first off, let me tell you, that's one of the most fascinating questions I've ever been asked."}, {"time": 9346, "text": "And I'm tremendously happy to answer this."}, {"time": 9351, "text": "How about what we do is, this is a massive question you've asked."}, {"time": 9355, "text": "There's a huge amount of ways this could get very interesting and very confusing."}, {"time": 9359, "text": "Let's set some ground rules for the discussion."}, {"time": 9364, "text": "Lex alluded to the idea of man versus machine and chess."}, {"time": 9371, "text": "Okay, and I think that's a really good place for us to start the discussion."}, {"time": 9376, "text": "I'm gonna just tell people about a little bit, the history of man versus chess, to give you guys some background on this."}, {"time": 9385, "text": "In 1968, there was a party in which a highly ranked, not a world champion, but a highly ranked chess player, his name was Levy, and he met a computer engineer at a party, and they had a lighthearted bet that in a 10 year timeframe, a human chess player would be defeated by a computer."}, {"time": 9413, "text": "Now, you gotta remember, 1968, computing power was very, very low."}, {"time": 9417, "text": "The computers that got America to the moon were actually pretty damn primitive."}, {"time": 9422, "text": "Your iPhone would kick all of their asses."}, {"time": 9426, "text": "So computational power was very, very low in those days."}, {"time": 9429, "text": "So interestingly, the chess player fully believed that no computer could beat him in the 10 year timeframe, and the computer engineer was very optimistic that he was wrong, and in fact, 10 years, the computer would win."}, {"time": 9444, "text": "10 years later, they had a competition, and the human won, decisively, in fact."}, {"time": 9449, "text": "So computational power simply hadn't risen to that level yet."}, {"time": 9455, "text": "Through the 1980s, computational power increased, but not sufficient to get to championship level."}, {"time": 9463, "text": "There were computer programs in the 1980s which were competitive with good, solid chess players, but not world beaters."}, {"time": 9474, "text": "Understand right from the start that there's a fundamental problem here."}, {"time": 9480, "text": "The number of options that the two players in a chessboard can run through is astronomically high."}, {"time": 9491, "text": "There are 64 squares on a chessboard."}, {"time": 9494, "text": "The number of possible options that could work or could play out on a chessboard, and this is a truly shocking thing for you to think about, the number of possible options is higher than the number of atoms in the known universe."}, {"time": 9514, "text": "Think about that for a second in terms of complexity, okay?"}, {"time": 9518, "text": "The number of atoms on this table is massive, okay?"}, {"time": 9524, "text": "That is an unbelievably large number."}, {"time": 9528, "text": "We're talking about a situation where if a computer had to go through all the options at the onset of a match, they would have to run numbers greater than the number of atoms in the known universe."}, {"time": 9540, "text": "The number of galaxies in our universe is vast, okay?"}, {"time": 9545, "text": "It's measured in the billions."}, {"time": 9546, "text": "Like, the number of atoms, that's just a number so mind blowing it's impossible, okay?"}, {"time": 9552, "text": "So no computer is ever going to be able to work with those kinds of numbers, okay?"}, {"time": 9559, "text": "I didn't even know future generations of quantum computers could work with those kinds of numbers."}, {"time": 9564, "text": "So that's the fundamental problem, okay?"}, {"time": 9566, "text": "The number of options in a chess match is just so astronomically large that no computer could ever figure out all the available options and make decisions in a given timeframe."}, {"time": 9577, "text": "So that's the fundamental problem."}, {"time": 9580, "text": "So as Lex correctly pointed out, the way you get around this is by the use of heuristics."}, {"time": 9586, "text": "These are rules of thumb, which give general guidelines to action."}, {"time": 9591, "text": "So for example, in jiu jitsu, I could give you a general rule of thumb."}, {"time": 9595, "text": "Don't turn your back on your opponent, okay?"}, {"time": 9597, "text": "That's a solid piece of advice."}, {"time": 9599, "text": "There are obviously some exceptions to that rule, but it's a good solid piece of advice to give a beginner."}, {"time": 9604, "text": "The moment you give that heuristic rule, you rule out a lot of options, okay?"}, {"time": 9609, "text": "You've already told someone don't turn your back, don't turn your back on someone."}, {"time": 9612, "text": "So a lot of possibilities have just been turned away right there."}, {"time": 9616, "text": "So you've cut the number of options in half right there just by giving one heuristic rule, okay?"}, {"time": 9622, "text": "If you were decent at chess, not great, but decent, and you knew enough to give say 10 heuristic rules, you could chop that initially vast number of options down by a vast amount."}, {"time": 9636, "text": "And now you're starting to get to a point where if a computer had sufficient computational power, it could start getting through the number of options in that acceptable timeframe."}, {"time": 9646, "text": "So that's the general pattern of the development."}, {"time": 9650, "text": "Now, things started getting very interesting in the mid 1990s with IBM's computer Deep Blue."}, {"time": 9658, "text": "There was a great chess champion of the late 1980s and early through the 1990s called Gary Kasparov, who had been more or less undefeated for a decade."}, {"time": 9668, "text": "In 1996, he took on IBM's computer Deep Blue."}, {"time": 9672, "text": "Just to correct the record, he was undefeated."}, {"time": 9678, "text": "I apologize, Russian, gotta make sure."}, {"time": 9680, "text": "They get very nationalistic about their chess."}, {"time": 9681, "text": "Be careful of these guys."}, {"time": 9683, "text": "Deep Blue lost the first confrontation, I believe, in 1996."}, {"time": 9686, "text": "It was competitive, but lost."}, {"time": 9688, "text": "Then in 1997, Deep Blue won."}, {"time": 9692, "text": "And it wasn't a complete walkover."}, {"time": 9695, "text": "Kasparov, I believe, won one of the matches."}, {"time": 9698, "text": "But they did, Deep Blue unequivocally won the confrontation."}, {"time": 9703, "text": "And it was seen as like this watershed moment where a computer beat the best human chess player on the planet, and that was it."}, {"time": 9712, "text": "There's no coming back from that."}, {"time": 9714, "text": "I think it would be remembered as one of the biggest moments in computing history, is really when the first time a machine beat a human at a thing that humans really care about in the domain of intellectual pursuits."}, {"time": 9726, "text": "Yeah, it was a powerful, powerful moment."}, {"time": 9730, "text": "Now, not only was that a powerful moment, but things started getting truly interesting from that moment forward, because then you started having different areas of development."}, {"time": 9745, "text": "The general way in which the progress is made from those early starts in 1968, all the way through to Deep Blue's victory, was of the use of heuristic rules that brought down the number of potential options to a manageable level."}, {"time": 9764, "text": "As computer power increased, then it could make faster and faster and wiser and wiser decisions, and make them at a rate which no human, even the best human, could keep up with."}, {"time": 9774, "text": "So that was the general way in which the debate went."}, {"time": 9778, "text": "But things got more interesting after this, with the advent of computers that, as you pointed out, make use of so called machine learning."}, {"time": 9790, "text": "There were, a company put out a program, AlphaZero, which can look at the basic rule structures of chess, and then ultimately play itself in trials, and make trial and error assessment of what are good and bad strategies, so that with no human intervention, a computer could start doing remarkable things."}, {"time": 9818, "text": "Not only did this company create AlphaZero, and there were some other ones too, they fought not only in chess, but in the much more complex Asian game of Go, which has far more potential options than chess does, by a very significant margin."}, {"time": 9840, "text": "These machine learning programs, not only easily defeat any human in chess, but in Go as well."}, {"time": 9848, "text": "And what's truly remarkable is they weren't just beating them."}, {"time": 9853, "text": "When AlphaZero took on a rival chess program, which by itself was already superior to any human, it only required four hours, starting from learning the rules of chess, to figuring out how to beat the second most powerful chess program in the world."}, {"time": 9874, "text": "That's literally like taking a human, telling the rules of chess, they play some games with themselves for four hours, and they go out and beat Garry Kasparov."}, {"time": 9884, "text": "This is, I don't know, this is, to me, this is a truly exciting development, far beyond even what Deep Blue did."}, {"time": 9895, "text": "I like how you said exciting, not terrifying, because I agree with you on the exciting."}, {"time": 9899, "text": "Now, things also get exciting in a different direction."}, {"time": 9903, "text": "There is another possibility, which few people foresaw after the Deep Blue episode."}, {"time": 9910, "text": "This is where a new form of chess started to emerge, sometimes called cyborg chess or centaur chess, where humans of moderate chess level playing ability, not world champions, just decent, but not great, I guess you might say like purple belts in jiu jitsu, allied themselves with computers."}, {"time": 9933, "text": "So the humans and computers worked as a cyborg team."}, {"time": 9938, "text": "The humans supplied the heuristic insight."}, {"time": 9943, "text": "The computers supplied the computational power."}, {"time": 9946, "text": "And fascinatingly, they proved to be superior to both the best humans and the best chess programs."}, {"time": 9956, "text": "The united force of human insight with heuristics, with computers ability to go through numbers in far more rapid form than any human could ever hope to do, proved to be one of the strongest combinations and enabled that pairing of human and computer to overwhelm both the best single human and the best single computer."}, {"time": 9981, "text": "That adds a whole new level of fascination to this topic."}, {"time": 9986, "text": "So to wind things up here, we've got this fascinating initial question from Lex, the idea of could there be a computer inside a robot which doesn't have any special physical properties?"}, {"time": 10002, "text": "This is mind versus mind because the bodies negate each other."}, {"time": 10006, "text": "The robot is the same body as Gordon Ryan."}, {"time": 10010, "text": "What would it take to create a mind that would defeat the mind of Gordon Ryan?"}, {"time": 10018, "text": "Based on the chess example, it would appear that this is entirely feasible at some point in the future."}, {"time": 10026, "text": "And in fact, I would go further and say, it's actually quite likely based on what we've seen from the example of chess."}, {"time": 10033, "text": "The rate of progress in AI in the last 20 years has dwarfed anything from the previous 50 years."}, {"time": 10044, "text": "And the rate continues to increase."}, {"time": 10048, "text": "We're talking now at a level where the machine learning of defeating world champions in chess and Go in four hours, like just from starting from the rules of the sport, this is gonna be difficult for humans to keep up with."}, {"time": 10067, "text": "Now in humans favor, could we take Gordon Ryan and put a chip inside his brain that created the same cyborg effect as we saw in centaur chess and cyborg chess, and then take Gordon Ryan to a new level and suddenly his computational powers were massively increased."}, {"time": 10085, "text": "He still has his heuristic insight, but he has vastly augmented computational powers."}, {"time": 10091, "text": "That's the interesting battle."}, {"time": 10095, "text": "You asked a great question, Lex."}, {"time": 10096, "text": "Let me give you my initial push for an answer would be that if it's just Gordon Ryan versus your robot technology, in 10 years, I would say with machine learning, I'd say you guys win every time."}, {"time": 10111, "text": "But if it is cyborg Gordon Ryan, where he's part Gordon Ryan with heuristics and part machine, then, and now that's where I throw the question back at you, young man, what do you think?"}, {"time": 10128, "text": "Well, I'm fascinated to hear your answer."}, {"time": 10129, "text": "That's very interesting because there's a lot of different ways you can build a cyborg Gordon Ryan."}, {"time": 10135, "text": "So one is there's the Neuralink way, which is basically doing what you're suggesting, which is expanding the computational capabilities of Gordon Ryan's brain, like directly being able to communicate between a computer and the brain."}, {"time": 10153, "text": "So you preserve most of what there is in the human body, including the nervous system and the computing system we currently have that's biological and expanding over the computer."}, {"time": 10166, "text": "There's also on the cyborg chess front, like Magnus Carlsen, the current world champion in chess, he studies AlphaZero games."}, {"time": 10178, "text": "Like it's not a regular thing for high level grandmasters."}, {"time": 10182, "text": "From what I understand, almost every chess master now studies computer games for inspiration."}, {"time": 10188, "text": "Like just as great chess players from the past used to go back into old leather bound books of previous grandmasters and study games and books."}, {"time": 10200, "text": "Nowadays, most people, when they wanna study the most perfect games, they actually study programs like AlphaZero."}, {"time": 10206, "text": "Yeah, and it's not just for inspiration, it's education."}, {"time": 10209, "text": "I mean, it's literally part of their training regimen."}, {"time": 10212, "text": "This isn't like a fun side thing."}, {"time": 10214, "text": "This is the main way to get better."}, {"time": 10218, "text": "So there's a certain element there where even our human brains can be trained by observing the partial explorations of an AI systems in the space of grappling."}, {"time": 10232, "text": "That could be actually in simulation."}, {"time": 10234, "text": "It doesn't have to be in the physical world."}, {"time": 10235, "text": "It could be in, if we construct sufficiently good biomechanical models of human beings, machines can learn how they grapple."}, {"time": 10246, "text": "There's quite a bit of that already."}, {"time": 10249, "text": "OpenAI has the system of, they're like sumo wrestlers with some basic goals of pushing each other off of a platform."}, {"time": 10258, "text": "And you know nothing from the, you don't even know."}, {"time": 10261, "text": "So you have a basic model of a bipedal system."}, {"time": 10264, "text": "It doesn't even know in the beginning how to stand up."}, {"time": 10267, "text": "It just falls, right?"}, {"time": 10268, "text": "So it has to learn how to get up and they do that through self play."}, {"time": 10273, "text": "They learn how to get up, they learn how to move enough to achieve the final goal which is to push your opponent off of the thing."}, {"time": 10280, "text": "So they learn that."}, {"time": 10282, "text": "Now OpenAI is not, those folks are currently not that interested in the grappling world."}, {"time": 10288, "text": "So they kind of stop there."}, {"time": 10290, "text": "But it's very possible in simulation to then develop ideas."}, {"time": 10296, "text": "In fact, this is something that I should probably do, but it's pretty natural to do it easy, is ideas of control and submission and all the, you add the ability to, I don't know how to put it nicely, but to choke your opponent and to break their body parts off, which is what jiu jitsu is."}, {"time": 10320, "text": "Add that in and what kind of ideas it'll come up with is very fascinating."}, {"time": 10325, "text": "I actually don't know, until this conversation, I don't know why I never even thought about that."}, {"time": 10328, "text": "I've been very obsessed with just like walking and running and all those kinds of things, like evolving different strategies for when you have a bunch of, so one difficult thing for robots is when you have uneven terrain and there's uncertainty about the terrain is how to keep walking."}, {"time": 10345, "text": "Or when there's a bunch of things being thrown at you, all that kind of stuff, and you learn through self play how to be able to navigate those uncertain environments when there's a lot of weird objects and all those kinds of things."}, {"time": 10358, "text": "There's no reason why you can't just do that with submissions and so on in simulation."}, {"time": 10363, "text": "That'll be actually fascinating."}, {"time": 10364, "text": "But once we might be surprised by the kind of strategies in simulation these AI systems will develop, and that might make a much better Gordon Ryan and much better John Donahar in asking the Dean Lister question of like, why are we only using, why are we not doing X?"}, {"time": 10386, "text": "But on the actual sort of grappling event in the physical space, I've been very surprised and a little bit disappointed by how difficult it's to build a system that's able to have the body of Gordon Ryan or a human being actually, which means it's not just the biomechanics which is very difficult to do, but also all of the senses that are involved."}, {"time": 10417, "text": "Be able to perceive the world as richly, to be able to, there's something called soft robotics, which is incredibly difficult to do through touch, understand the hardness of things."}, {"time": 10430, "text": "We don't understand as human beings just how much we're able through touch to experience the world and to manipulate the world."}, {"time": 10439, "text": "Like the process of picking up a cup is very similar to the process of grappling."}, {"time": 10445, "text": "All the feeling that you do, all the leverage that you're applying, there's so many degrees of freedom in both the, in the interactive sense, in the sensing and the applying, sensing and applying, you're doing that through so much of your body, that it's just going to be very difficult to build a system that's able to experience the world and act onto the world as richly as we humans can."}, {"time": 10470, "text": "Yeah, if picking up a cup is a seemingly insurmountable challenge, then taking someone down, controlling them, getting past their legs, that's going to be one hell of a project."}, {"time": 10482, "text": "Exactly, I mean, there could be shortcuts, but I mean, currently that's the field called robotic manipulation, which is picking up objects."}, {"time": 10492, "text": "Usually they have like a ball and a triangular object and your whole task is to like pick it up and move it around."}, {"time": 10499, "text": "Generalizing that to the human body is harder, but perhaps not as hard as we might think."}, {"time": 10509, "text": "The question is, how do you construct experiments where you can do that safely?"}, {"time": 10513, "text": "In chess, that's very easy, but here it's very, very problematic."}, {"time": 10522, "text": "I guess you could just have robot versus robot teamed up with each other and then they learn and then they go out to take on a human opponent."}, {"time": 10529, "text": "Yes, exactly, so you have two physical robots that interact with each other."}, {"time": 10535, "text": "Everything you've said so far suggests that many of the problems, these tactile elements, they're easy tasks for humans."}, {"time": 10543, "text": "So which becomes more powerful more quickly?"}, {"time": 10547, "text": "Robots that are taught to think like humans or humans that are given the computational power of computers and robots themselves, which wins first, a cyborg Gordon Ryan or an artificial robot Gordon Ryan?"}, {"time": 10563, "text": "Really, really strong question, and I think by far the cyborg Gordon Ryan."}, {"time": 10569, "text": "Yeah, that's what I'm thinking here."}, {"time": 10571, "text": "The problems you're talking about with regards to the robots, those are deep problems."}, {"time": 10576, "text": "Like if picking up a cup is problematic, it's gonna be damn difficult, but to a human, a two year old can do that."}, {"time": 10585, "text": "You're highlighting a very important difference is human beings have something called common sense that we don't know how to build into computers currently."}, {"time": 10595, "text": "That's what picking up the cup is."}, {"time": 10597, "text": "It's some basic rules about the way this world works."}, {"time": 10601, "text": "We're able to, this is when we're children and we'll crawl around and we pick up."}, {"time": 10606, "text": "What humans don't have that machines have is incredible computational power and access to infinite knowledge."}, {"time": 10614, "text": "Computers can do that."}, {"time": 10615, "text": "So if you have a Gordon Ryan with the infinite knowledge and compute power, that's just going to, because we know how to do that, that's going to blow out of the water a robot that's trying to learn to crawl."}, {"time": 10628, "text": "Has there been any update on the phenomenon of cyborg or centaur chess?"}, {"time": 10634, "text": "There was some debate as to whether or not cyborg chess teams could stay competitive with the latest machine learning."}, {"time": 10645, "text": "Has there been any update on that?"}, {"time": 10647, "text": "I believe at this point machines dominate over the machine human pairs."}, {"time": 10654, "text": "With the human pairs, when they first came out, they were good chess players, but not great chess players."}, {"time": 10661, "text": "Does it make any difference if you have, say, Garry Kasparov and a computer working in unison versus Joe Blow from?"}, {"time": 10672, "text": "It does make a huge difference, but yeah, both are destroyed by machines at this point."}, {"time": 10676, "text": "And it's not even competitive now?"}, {"time": 10678, "text": "No, it's not competitive."}, {"time": 10679, "text": "But they also lost interest in this kind of idea."}, {"time": 10683, "text": "So I think there's still competitions between human machine pairs versus human machine pairs, almost like to see how the two work together."}, {"time": 10692, "text": "But in terms of machine versus human machine pair, machines still dominate."}, {"time": 10696, "text": "So, and now we've retrieved back as human beings caring mostly about human versus human competitions, which is probably what the future will look like."}, {"time": 10707, "text": "It's very interesting to think, but like that in chess happened really quickly."}, {"time": 10712, "text": "It won't happen, and it wasn't so painful in chess because we care about chess, but it's not so fundamental to human society."}, {"time": 10721, "text": "And when you started talking about cyborg Gordon Ryans, which really beyond grappling is referring to robots operating physical space or human robot hybrids operating physical space, you're talking about our society is now full of cyborgs."}, {"time": 10740, "text": "And that transition might be very painful or transformative in a way we can't even predict."}, {"time": 10750, "text": "And that very much has applications as both China and US now have legalized is autonomous weapon systems."}, {"time": 10760, "text": "So use of these kinds of systems in military applications."}, {"time": 10764, "text": "So it used to be, there'd been a big call in the AI community to ban autonomous weapons."}, {"time": 10769, "text": "So the use of artificial intelligence in war, just like bioweapons are banned internationally."}, {"time": 10777, "text": "So you're not allowed to use bioweapons in war."}, {"time": 10780, "text": "And actually most people, even terrorists, have kind of agreed on this ban."}, {"time": 10786, "text": "It's not like, there's been a quiet agreement, like we're not going to be doing this because everybody's gonna get really pissed off."}, {"time": 10794, "text": "With autonomous weapon systems, that's not been the case."}, {"time": 10799, "text": "China has said that they're going to be using AI in their military."}, {"time": 10803, "text": "And the US in 2021 just released a report saying that they're going to add increasing amounts of artificial intelligence into our military systems."}, {"time": 10817, "text": "Into drones, into just everything that's doing any kind of both strategic and actual bombing and defense systems."}, {"time": 10827, "text": "I presume a drone army would easily defeat a human army in the near future."}, {"time": 10833, "text": "Like, I mean, just off the top of my head, just think about the implication of kamikaze drones versus a naval fleet."}, {"time": 10842, "text": "I mean, kamikazes was humans in World War II, did terrible damage to our navy."}, {"time": 10847, "text": "Imagine swarms of mechanical kamikazes which have no fear, no remorse, I mean."}, {"time": 10855, "text": "But it's very inefficient."}, {"time": 10858, "text": "Kamikaze is very inefficient."}, {"time": 10859, "text": "You want to be very, like war is, it's the same discussion to jiu jitsu, right?"}, {"time": 10866, "text": "You want to be, you want to create an asymmetry of power and you want to be efficient is in the way you deliver that power."}, {"time": 10873, "text": "It's actually goes back to the picking up a cup."}, {"time": 10877, "text": "Currently, a lot of things we do in war, like most of the drones that you hear about, they're not autonomous, not most, all."}, {"time": 10886, "text": "They're usually piloted by."}, {"time": 10887, "text": "They're piloted remotely by humans."}, {"time": 10890, "text": "And humans are really good at this kind of what's necessary to deliver the most damage, targeted damage, effective as part of the largest strategy you have about bombing the area or all that kind of stuff."}, {"time": 10903, "text": "I don't know how difficult that is to automate."}, {"time": 10905, "text": "I think the biggest concern, I actually have a sense that it's very difficult to automate."}, {"time": 10911, "text": "The biggest concern is almost like an incompetent application of this and consequences that are not anticipated."}, {"time": 10921, "text": "So you have a drone army where you say, we want to target, you give it power to target a particular terrorist."}, {"time": 10929, "text": "And then there's some bug in the system that has a, like for example, has a large uncertainty about the location of that terrorist."}, {"time": 10938, "text": "And so it decides to bomb an entire city."}, {"time": 10942, "text": "You know, almost like there's a bug, a software bug."}, {"time": 10945, "text": "I'm much more concerned about like bad programming and software engineering than I am about like malevolent AI systems that destroy the world."}, {"time": 10956, "text": "So the more we rely on automation, this is the lesson of human history."}, {"time": 10960, "text": "The more we give to AI, to software, to robotic systems, the more we forget how to supervise and oversee some of the edge cases, all the weird ways that things go wrong."}, {"time": 10974, "text": "And then the more stupid software bugs can lead to huge damage."}, {"time": 10979, "text": "Like, you know, even like nuclear explosions, those kinds of things."}, {"time": 10985, "text": "If we add AI into the launch systems for nuclear weapons, for example, I think human history teaches us that software bugs is what will lead to World War III, not malevolent AI or human beings."}, {"time": 11006, "text": "By the way, I deeply appreciate how knowledgeable you are about the history of artificial intelligence."}, {"time": 11012, "text": "Oh no, it's fascinating stuff."}, {"time": 11013, "text": "You know, I remember reading when I was a child about, you know, Turing tests and things like this, and visionaries from the 1950s had ideas."}, {"time": 11022, "text": "To see it come this far is just so fascinating to me."}, {"time": 11027, "text": "Okay, so what can we as jiu jitsu players take away from this?"}, {"time": 11031, "text": "We saw that when it comes to computers versus humans in chess tournaments, humans had something truly valuable to give to the computers."}, {"time": 11043, "text": "That was heuristic rules."}, {"time": 11045, "text": "In every coaching program that I run, I make an endless quest to search out and find effective heuristic rules."}, {"time": 11057, "text": "That's the basis of a good training program."}, {"time": 11061, "text": "Heuristic rules and principles give vast informational content, which can rapidly increase your performance on the mat, just as they rapidly increase the performance of chess computers to overcome their human adversaries."}, {"time": 11079, "text": "The great human weakness is computational power."}, {"time": 11083, "text": "Most people vastly overestimate their ability to reason and problem solve under stress."}, {"time": 11091, "text": "In fact, numerous psychological studies have shown that humans can balance a relatively small number of competing options in stressful decision making."}, {"time": 11103, "text": "But what we do have, what is the great and unique human gift is this idea to come up and arrive at heuristic rules and principles, which turn out to be very effective guides to behavior for both human behavior and artificially intelligent behavior."}, {"time": 11121, "text": "Make that your focus in study."}, {"time": 11127, "text": "Don't try to remember 10,000 different details on a move."}, {"time": 11131, "text": "Okay, that's human weakness, not human strength."}, {"time": 11134, "text": "Our strength is heuristics."}, {"time": 11136, "text": "Make that your focus, not endless computations over 25 details here merged with 27 details here."}, {"time": 11144, "text": "That's not what humans are good at."}, {"time": 11146, "text": "The uniquely human strength is arriving at these heuristic rules and principles which guide our behavior, which provides simplifications, which enable us to take vast amounts of information and parry it down to a few simple rules that effectively guide our behavior."}, {"time": 11164, "text": "Take that core insight from the discussion that Lex and I just had."}, {"time": 11167, "text": "It was a complex discussion."}, {"time": 11168, "text": "We both apologize for going a little bit overboard."}, {"time": 11171, "text": "Then dragging you into some details there, but take that away from it."}, {"time": 11174, "text": "It'll make you better at jujitsu."}, {"time": 11176, "text": "Sorry, Lex."}, {"time": 11178, "text": "That was a really exciting discussion, and the depths of knowledge in the dimensions of knowledge you have and interests you have is just fascinating."}, {"time": 11190, "text": "Is there advice you have for complete beginners, for white belts that are starting jujitsu, that are listening to this, that haven't done jujitsu?"}, {"time": 11198, "text": "I know there's a lot of people who are super curious to start."}, {"time": 11202, "text": "Is there advice you would give them on their journey?"}, {"time": 11205, "text": "Yeah, I'm just gonna talk about just getting better on the mat, okay?"}, {"time": 11210, "text": "Because there's a thousand other things you can talk about in terms of morale and persistence and how often that you're trained is a thousand things you'd give."}, {"time": 11217, "text": "Break up with your girlfriend or boyfriend."}, {"time": 11221, "text": "Let's put that aside."}, {"time": 11222, "text": "That's probably the best advice we could give."}, {"time": 11225, "text": "It goes back to what we said earlier."}, {"time": 11227, "text": "I always advocate start your training from the ground up."}, {"time": 11231, "text": "Okay, your first sessions in jujitsu, you're going to find to your horror that everyone gets on top of you and you can't get out."}, {"time": 11241, "text": "And it's a dispiriting, crushing kind of feeling that you just have no skills and you have no prospects in the sport."}, {"time": 11248, "text": "So your first skill is the skill of being able to free yourself from positional pins."}, {"time": 11255, "text": "Most of the escapes in jujitsu go to guard position."}, {"time": 11258, "text": "And so once you get someone in your guard, they're going to be looking to pass your guard and get back into those positional pins that you just escaped from."}, {"time": 11267, "text": "And that's just as crushing as getting pinned."}, {"time": 11269, "text": "You feel like every time you try to hold someone in guard, they just effortlessly pass you by."}, {"time": 11274, "text": "So your first two skills, you got to be able to get out of any pin and you got to be able to hold someone in your guard."}, {"time": 11280, "text": "So pin escapes and guard retention are your first two skills."}, {"time": 11284, "text": "I generally advocate the idea of learning to fight from your back first and then learning to fight from on top second."}, {"time": 11294, "text": "Because the brute fact is when you first start off, you just don't have enough skills to hold top position or gain top position through a takedown."}, {"time": 11301, "text": "So inevitably you're going to end up underneath people for most of your training time."}, {"time": 11305, "text": "Your training should reflect that in the early days as a white belt."}, {"time": 11310, "text": "Start with the first two skills you need."}, {"time": 11312, "text": "They're not the most exciting."}, {"time": 11313, "text": "They're not sexy skills that are going to make you look like a stud in the training room, but they're going to keep your life long enough to learn those sexy skills in the future that will make you look like a stud."}, {"time": 11323, "text": "Start with pin escapes, go to guard retention and focus heavily on those two."}, {"time": 11329, "text": "When you start to get into offense, start with bottom position."}, {"time": 11333, "text": "So there's a clear continuity between your pin escapes, your guard retention, and then your guard itself."}, {"time": 11341, "text": "You've got different options with guard."}, {"time": 11343, "text": "Some of you are going to like closed guard."}, {"time": 11345, "text": "Some of you are going to like variations of open guard."}, {"time": 11348, "text": "Some of you are going to like to be seated."}, {"time": 11349, "text": "Some of you are going to like to be supine."}, {"time": 11351, "text": "Some of you are going to like half guard."}, {"time": 11353, "text": "As a general rule, this is a heavy generalization, but I'm going to give it to you."}, {"time": 11358, "text": "In my experience, most people benefit the most by starting with half guard first."}, {"time": 11364, "text": "I know that traditionally Jiu Jitsu has been taught closed guard first, and then all the other guards come after that."}, {"time": 11370, "text": "I'm a big believer in the idea of start with pin escapes, then go to guard retention, and then start with half guard bottom."}, {"time": 11378, "text": "That way you get a nice continuity between your first three skills, and you'll make good progress over those first critical six months in Jiu Jitsu."}, {"time": 11386, "text": "What does it take to get a black belt in Jiu Jitsu?"}, {"time": 11391, "text": "Ha ha ha."}, {"time": 11395, "text": "To show up, pay your fees."}, {"time": 11398, "text": "Don't set your goals low, okay?"}, {"time": 11400, "text": "Don't even ask yourself that question."}, {"time": 11401, "text": "No one cares if you've got a black belt, okay?"}, {"time": 11403, "text": "The only thing that counts is the skills you have."}, {"time": 11406, "text": "I know plenty of black belts that suck, okay?"}, {"time": 11409, "text": "There's a lot of them out there."}, {"time": 11411, "text": "Don't lower your standards by saying, I want to get a black belt."}, {"time": 11416, "text": "Ask yourself something much more important."}, {"time": 11418, "text": "How good do I want to be?"}, {"time": 11420, "text": "You want to be damn good, right?"}, {"time": 11421, "text": "You want to do something in this time, and you want to be the best you can."}, {"time": 11424, "text": "Wearing a belt around your waist doesn't guarantee that."}, {"time": 11427, "text": "Build skills, focus on that."}, {"time": 11431, "text": "Let me ask you about the fourth thing in facet face of Jiu Jitsu, which is self defense."}, {"time": 11439, "text": "Let's say the bigger things, I don't know why it's called self defense."}, {"time": 11444, "text": "Let's call it street fighting."}, {"time": 11446, "text": "Let's call it fighting, okay?"}, {"time": 11449, "text": "Maybe you can contest that terminology."}, {"time": 11451, "text": "How about non sport fighting?"}, {"time": 11453, "text": "Non sport fighting."}, {"time": 11454, "text": "It's funny, like street fighting."}, {"time": 11455, "text": "What happens if you go out on a playground, and you're fighting on grass?"}, {"time": 11458, "text": "Is there no longer street fighting?"}, {"time": 11460, "text": "It's like tennis."}, {"time": 11460, "text": "You have like Wimbledon, like grass courts, it's a whole nother thing."}, {"time": 11467, "text": "What do you think is the best martial art for street fighting?"}, {"time": 11471, "text": "What is the best set of, we talked about advice for white belts to advance in grappling in Jiu Jitsu."}, {"time": 11482, "text": "What is the set of techniques, maybe martial art that is best for street fighting?"}, {"time": 11487, "text": "Okay, again, you're asking some truly fascinating questions here."}, {"time": 11497, "text": "The way this gets framed as a question is often condemns you to bad answers from the start."}, {"time": 11504, "text": "This is... As a questioner, I'm trying to achieve asymmetry of power."}, {"time": 11510, "text": "And I'm winning."}, {"time": 11513, "text": "Put you in a bad position."}, {"time": 11515, "text": "Don't worry so much about... People are always gonna say, you know, is this martial art better?"}, {"time": 11520, "text": "Or is this martial arts better?"}, {"time": 11521, "text": "The truth is there's only one way to say this."}, {"time": 11529, "text": "Combat sports are your best option for self defense."}, {"time": 11535, "text": "There are many martial arts, and there is a rough divide between the two."}, {"time": 11540, "text": "Those that fall into combat sports, and those that fall into non sporting martial arts, where there's no competitive live sparring element, where most of the knowledge is limited to theoretical knowledge reinforced by passive drilling."}, {"time": 11566, "text": "If you have a choice between a combat sport versus a non sporting art based around theoretical knowledge and passive drilling, go with a combat sport."}, {"time": 11578, "text": "Nothing will prepare you for the intensity of a genuine altercation better than combat sports."}, {"time": 11590, "text": "Many people, as I say these words, they're probably horrified to hear me say this, and immediately going to rebut and say, no, combat sports is exactly the wrong thing for you to do because they have safety rules, et cetera, et cetera, which would easily be exploited in a real fight."}, {"time": 11610, "text": "And if I fought a world championship boxer, I would just poke him in the eye or kick him in the groin, et cetera, et cetera."}, {"time": 11615, "text": "You've heard these arguments a thousand times."}, {"time": 11618, "text": "Yes, there is some validity to these things, but as a general rule, if you ask me to bet in any form of street fight, call it what you want, between a combat sport adherent versus someone who simply trains with drills and talks in terms of theories of what they would do in a fight, I'm gonna go with the combat sport guy every single time."}, {"time": 11645, "text": "Now, having said that, combat sports need to be modified for the use of self defense street fighting."}, {"time": 11654, "text": "We haven't agreed on a term yet."}, {"time": 11655, "text": "We'll figure it out later."}, {"time": 11658, "text": "What does this modification consist of?"}, {"time": 11661, "text": "Well, some of it is technical, okay?"}, {"time": 11663, "text": "For example, a boxer in a street fight now has to punch without wrapped or gloved hands, and that's problematic, okay?"}, {"time": 11672, "text": "Your hands are not really designed for heavy extended use of clubbing hard objects."}, {"time": 11678, "text": "There's a very high likelihood of breaking your hands."}, {"time": 11681, "text": "Mike Tyson was one of the finest punchers that ever lived, but in one of his more famous street fights against Mitch Green in the late 1980s, he broke his hand with one punch that he threw at his opponent."}, {"time": 11693, "text": "He hit the wrong part of the head and broke his hand, and he was one of the most gifted punchers of all time."}, {"time": 11698, "text": "If he can do it, you'll certainly have trouble protecting your hands when you go to throw blows."}, {"time": 11706, "text": "Nonetheless, this was easily modified, and so a boxer can throw with open hands or with elbows, and so just a small modification and technique can overcome that problem."}, {"time": 11721, "text": "So what you'll find is that the general physical, mental conditioning, and skill development that comes from combat sports allied with technical modifications, and then the most important of all, tactical modifications will provide your best hope in altercations outside of sports in the street or wherever you find yourself."}, {"time": 11752, "text": "The least effective approaches to self defense that I have observed in my life have been those where, as I said, people talked theory, drilled on passive opponents, and generally had no engagement in live competition or sparring in their training programs."}, {"time": 11773, "text": "The most effective by a landslide were those that put a heavy emphasis on live sparring and sporting competition modified both technically and tactically for the circumstances in which they found themselves."}, {"time": 11790, "text": "People talk, for example, about how, you know, and with some validity that weapons will change everything in a street fight."}, {"time": 11799, "text": "There's absolute truth to that, but this extends into weapons as well, okay?"}, {"time": 11804, "text": "The most effective forms of knife fighting that you'll see will be those who come from a background in fencing because it has sparring and a competitive sport aspect to it, but would pure fencing be the appropriate thing?"}, {"time": 11819, "text": "Of course not, you'd have to modify it, but the reflexes, endurance, physical mobility that you gain from the sport of fencing could easily be modified to bladecraft in a fight situation."}, {"time": 11830, "text": "What you want to look for with regards street and self defense is not, okay, which style should I choose?"}, {"time": 11838, "text": "Should I choose taekwondo?"}, {"time": 11839, "text": "Should I choose karate?"}, {"time": 11840, "text": "Should I choose this variation of kung fu?"}, {"time": 11842, "text": "No, focus on the most important thing."}, {"time": 11844, "text": "Does it have a sport aspect to it?"}, {"time": 11847, "text": "Then once you've made sufficient progress in the sport aspect of that martial art, start asking yourself, what are the requisite modifications and technique and tactics that I have to use or to input to make it effective for street situations?"}, {"time": 11863, "text": "That's always the advice that I give."}, {"time": 11865, "text": "Let me zoom in on a very particular aspect of street fighting where, with all due respect, I disagree with Mr. Joe Rogan and George St. Pierre on, which is the suit and tie situation."}, {"time": 11877, "text": "Now, to criticize GSP, yeah, yeah, he's very accomplished and everything, but to criticize him for a bit, he made claims about how dangerous the tie is in a street fighting situation without ever having used it in a fighting situation."}, {"time": 11892, "text": "So he made sort of broad proclamations without understanding the fundamentals."}, {"time": 11898, "text": "So I thought I would go to somebody who thinks in systems."}, {"time": 11903, "text": "What do you think, is it dangerous to wear a tie or not in a grappling situation versus all the other weapons?"}, {"time": 11913, "text": "Yeah, but we would do it in a street fight, yeah."}, {"time": 11915, "text": "It would be rather strange to wear a tie in a grappling competition."}, {"time": 11918, "text": "It would be, it would be."}, {"time": 11920, "text": "Yes, in a street fight situation."}, {"time": 11923, "text": "Joe Rogan thinks it is like the most dangerous, it's like it becomes your weakest point if you wear a tie because it's very easy to choke."}, {"time": 11932, "text": "George St. Pierre seemed to have agreed with that."}, {"time": 11935, "text": "Also, George added that you can grab the tie and pull the person down to a knee."}, {"time": 11943, "text": "Yeah, this is the go to."}, {"time": 11944, "text": "Joe Rogan will go for the choke, George St. Pierre will go for the tie to the knee, which I was saying is ridiculous."}, {"time": 11951, "text": "Okay, first off, I actually can speak with experience on this because I worked as a bouncer for over a decade and most of the clubs I worked at did not require a suit and tie, but occasionally they did."}, {"time": 11965, "text": "Okay, let's first differentiate between the kinds of threats when you wear a tie."}, {"time": 11970, "text": "If you wear a tie, if there is gonna be a threat, by far the more important threat is not strangulation."}, {"time": 11976, "text": "Okay, being strangled by your tie is possible, but it is a poor choice."}, {"time": 11982, "text": "There are many other ways to strangle people that are far more efficient."}, {"time": 11985, "text": "If I strangle by your tie, I'm literally in front of you."}, {"time": 11989, "text": "That means as I go to apply the strangle hold, I can easily be eye gouged, et cetera, et cetera."}, {"time": 11994, "text": "If you're gonna strangle people in the street, do it from behind and there's just much better ways to do it than that."}, {"time": 12000, "text": "Hear that, Joe Rogan?"}, {"time": 12002, "text": "With regards to the snap down question, that is more a problem."}, {"time": 12007, "text": "I always recommend if you are going to work as a bouncer with a tie, wear a clip on tie so it just comes off immediately."}, {"time": 12014, "text": "If you don't like clip ons, then you can use a bow tie."}, {"time": 12017, "text": "I used to work for years in hip hop clubs with members of the Nation of Islam security team."}, {"time": 12026, "text": "They were known, they had various factions, but the one I worked with were the X Men, and they would always wear bow ties, which of course can't be grabbed."}, {"time": 12034, "text": "Now, the bow tie was a recognizable part of their brand as security guards, so everyone knew that that's what they wore."}, {"time": 12043, "text": "If I wore a bow tie in a security situation, people would probably think that I was some kind of Nancy boy and want to fight with me, so I couldn't wear one."}, {"time": 12053, "text": "So I would always wear a tie which you should become familiar with, Mr. Freeman."}, {"time": 12060, "text": "That's the Texas bolo tie, which is a kind of shoestring tie which is very, very thin, almost like shoestring and rather short and just has a simple pendant in the middle."}, {"time": 12071, "text": "This is perfect if you need to wear a tie in a situation where you believe there's a high likelihood of you being grabbed."}, {"time": 12077, "text": "Because it can't be grabbed."}, {"time": 12078, "text": "Yeah, there's nothing to grab."}, {"time": 12079, "text": "It's literally like string."}, {"time": 12080, "text": "Like if you pulled it, it would just slip through your hand."}, {"time": 12084, "text": "That tie that you're wearing now, that would give me tremendous control of your head, and I could easily turn it into a hockey fight situation where your head was being pulled down out of balance, and you would have a hard time recovering."}, {"time": 12098, "text": "So strangulation, not really a problem."}, {"time": 12101, "text": "Getting pulled down, possible problem."}, {"time": 12104, "text": "Solutions, clip on tie, bow tie, or if you don't want to look like a Nancy boy, wear a bolo tie."}, {"time": 12114, "text": "Beautiful, so you disagree with Joe Rogan, agree with George St. Pierre, I love it."}, {"time": 12118, "text": "I feel like this is an instruction we put together here on street fighting and the tie."}, {"time": 12126, "text": "Speaking of Joe Rogan, let me ask the following question."}, {"time": 12131, "text": "He's currently doing a podcast with Gordon Ryan, and probably going to try to convince him and you, as he's already been doing, to move to Austin."}, {"time": 12143, "text": "What are the chances of the Donoher Death Squad coming to Austin and opening a school in Austin and making Austin home so I can attend the classes there?"}, {"time": 12154, "text": "I would definitely have to think about that."}, {"time": 12156, "text": "I do know that I personally love New York, but every single person in the squad despised New York and wanted to leave for a long time."}, {"time": 12174, "text": "What was the nature of your love for New York, by the way?"}, {"time": 12177, "text": "It was truly an international city."}, {"time": 12179, "text": "I'm a big believer in the idea of breadth of experience, and if you want, breadth of experience usually requires extensive travel, but training people means you have to be in a fixed location working according to a schedule, and those two push in different directions."}, {"time": 12201, "text": "New York was the compromise where everyone from around the world came there so you had breadth of experience of world culture, but at the same time, you had a fixed location so you could run a training program that produced world champions, so it was the ideal compromise."}, {"time": 12217, "text": "It was a fascinating thing to teach classes of over 120 people where literally the entire world was represented on the map and go outside and see the same thing."}, {"time": 12228, "text": "It was truly the world's leading international city."}, {"time": 12234, "text": "It was like the world's unofficial capital, a fascinating place to live, so I loved it, but the squad hated it."}, {"time": 12243, "text": "For them, it was like an expensive thing."}, {"time": 12247, "text": "They never actually lived in Manhattan."}, {"time": 12248, "text": "They always lived in New Jersey or Long Island, had to commute in, so all they ever saw was the bridges and the tunnels, the expensive daily parking fees."}, {"time": 12256, "text": "They only saw the worst of New York, and despite my pleas for them to move into Manhattan, they never did, and so they hated it because when all you see of New York is the bridges and the tunnels and the parking garage, that's not a pleasant thing, so I understand where they're coming from, so then when COVID broke out, they wanted to move to Puerto Rico and work there."}, {"time": 12285, "text": "Now, Puerto Rico is a beautiful alternative to New York."}, {"time": 12290, "text": "In many ways, it has many advantages over New York."}, {"time": 12292, "text": "It's physically beautiful."}, {"time": 12293, "text": "The people are wonderful, and it's just a wonderful place to spend time."}, {"time": 12302, "text": "Freedom, low taxes, all those kinds of things that Puerto Rico stands for."}, {"time": 12308, "text": "It's Texas, on the other hand."}, {"time": 12310, "text": "I know everyone in the squad."}, {"time": 12311, "text": "It's a compromise, right?"}, {"time": 12312, "text": "Texas is a compromise between those two."}, {"time": 12314, "text": "Actually, I must say that everyone on the squad, myself included, loves Texas."}, {"time": 12321, "text": "I know Gordon loves it, Gary, Craig, Nicky, everyone who comes here just loves Texas."}, {"time": 12329, "text": "That is incontestable."}, {"time": 12334, "text": "Of course, in Texas, there's many great cities."}, {"time": 12337, "text": "Austin has always been one of my favorites."}, {"time": 12341, "text": "I love Dallas, I love Austin, and it has the advantages of better infrastructure as a place to train."}, {"time": 12352, "text": "It has a much higher population density so that you could get a larger number of prospective students and form a larger squad."}, {"time": 12361, "text": "It would definitely be a fantastic place to open up a gym."}, {"time": 12367, "text": "I couldn't give an answer off the top of my head."}, {"time": 12369, "text": "It would be a big move if we did make that move, but the basic idea would be very agreeable to everyone on the team, I will say that."}, {"time": 12381, "text": "Well, I'll just have to call on my Russian connections to threaten the right kind of people, and I definitely would love, the way you approach training, the way you approach the martial arts is something that I deeply admire as a scholar of these arts, so it would be amazing if you do come here, but either way, it'd be amazing to train together."}, {"time": 12404, "text": "Let me ask a big, ridiculous question."}, {"time": 12406, "text": "What do you think is the meaning of this whole thing?"}, {"time": 12413, "text": "We talked about at the beginning of the conversation about death and the fear of it."}, {"time": 12420, "text": "The other big question we ask about life is its meaning."}, {"time": 12424, "text": "Do you think there's a meaning to our existence here on this little spinning ball?"}, {"time": 12429, "text": "That's, you've thrown some powerful questions."}, {"time": 12433, "text": "That's the most powerful."}, {"time": 12441, "text": "For most of human existence, the meaning of life was very, very simple, survival."}, {"time": 12450, "text": "The only thing that humans cared about was just surviving because it was so damn difficult for the early years of human existence on this Earth."}, {"time": 12463, "text": "If you look at ourselves as biological agents, everything about our body is set up for one mission, and that is survival."}, {"time": 12474, "text": "Every reflex we have, every element of our structure is just built up on the battle to survive."}, {"time": 12483, "text": "And then humans did something remarkable."}, {"time": 12485, "text": "They elevated themselves through the use of technology and social structure to the top of the food chain so that they went from extremely vulnerable."}, {"time": 12500, "text": "If you take a naked human being alone and put them in the Serengeti Plains in Africa, they're in some deep shit."}, {"time": 12509, "text": "If you look at a human being as a survival organ, just by itself, naked, they are among the most feeble at that task in the entire animal kingdom."}, {"time": 12526, "text": "You compare us with predatory animals."}, {"time": 12529, "text": "We are weak and soft and easily killed."}, {"time": 12537, "text": "But if you take that same human and put them in the Serengeti human and put them in a group, and you give them basic technology, steel, a spear, a knife, he goes from the bottom of the food chain to pretty much at the top."}, {"time": 12560, "text": "And so humanity found itself in a crisis that emerged out of its own success."}, {"time": 12568, "text": "For most of its history, their only interest was the battle to survive, and they did it."}, {"time": 12573, "text": "I don't know how they did it, but they did it."}, {"time": 12574, "text": "They got through ice ages, droughts, famines, disease, everything, and they found a way to get to the top of the food chain."}, {"time": 12584, "text": "And that's where it all got interesting."}, {"time": 12587, "text": "Because an organism whose only interest was in survival had for the first time in their history a more or less guaranteed survival."}, {"time": 12599, "text": "And so the big question now is, now what?"}, {"time": 12603, "text": "We survived."}, {"time": 12604, "text": "There's no more danger."}, {"time": 12606, "text": "The average human being finds himself in a world now where there's almost zero danger from predatory animals, where getting a meal is the easiest thing ever, where getting to and from work is not problematic at all, where the majority of infectious diseases, medical complaints can be resolved in a hospital fairly easily."}, {"time": 12635, "text": "And so they start casting their mind around, okay, what do I do now?"}, {"time": 12642, "text": "And so the minute mankind's existence became more or less guaranteed, the problem shift from survival to meaning."}, {"time": 12655, "text": "And we found ourselves grappling with a whole new issue that had never occurred to our ancient forefathers, but which now becomes one of the centerpieces of our modern lives."}, {"time": 12669, "text": "I mean, when you look at your own life, when you look back, you think, I did a hell of a good job."}, {"time": 12676, "text": "You know, Hunter S. Thompson has this line that I often think about, that life should not be a journey to the grave with the intention of arriving safely in a pretty and well preserved body, but rather to skid in roadside in a cloud of smoke, thoroughly used up, totally worn out, and loudly proclaiming, wow, what a ride."}, {"time": 12698, "text": "Which is the complete opposite of survival."}, {"time": 12703, "text": "Well, not complete opposite of survival, but basically embracing danger, embracing risk, going big, just living life to the fullest."}, {"time": 12714, "text": "So within that context, what would make you proud of a life well lived?"}, {"time": 12721, "text": "When you look back, you, John Donahart, looking back at your life."}, {"time": 12725, "text": "First, I will address that question, but let's first look at why Hunter Thompson could say that."}, {"time": 12731, "text": "Why Hunter Thompson could say that?"}, {"time": 12733, "text": "Because his life was more or less guaranteed and safe."}, {"time": 12737, "text": "If you look at animals in the animal kingdom, the pattern of their life is very simple."}, {"time": 12742, "text": "They take the least risk possible to secure their existence."}]}]