[{"title": "Jo Boaler: How to Learn Math | Lex Fridman Podcast #226", "id": "KZnGSVwIpeU", "quotes": [{"time": 353, "text": "Yeah, it's hard."}, {"time": 355, "text": "I mean, I love to value what's hard in maths instead of being afraid of it."}, {"time": 360, "text": "We know that when you struggle, that's actually a really good time for your brain."}, {"time": 364, "text": "You want to be struggling when you're thinking about things."}, {"time": 367, "text": "So if it's hard to think intuitively about something, that's probably a really good time for your brain."}, {"time": 373, "text": "I used to work with somebody called Sebastian Thrun, who is a great sort of mathematician, you might think of him, AI person."}, {"time": 381, "text": "And I remember in one interview I did with him, he talked about how they'd built robots, I think for the Smithsonian, and how they were having this trouble with them picking up white noise."}, {"time": 392, "text": "And he said they had to solve it."}, {"time": 394, "text": "They had to work out what's going on and how he intuitively worked out what the problem was."}, {"time": 401, "text": "But then it took him three weeks to show it mathematically."}, {"time": 405, "text": "I thought that was really interesting that how you can have this intuition and know something works."}, {"time": 411, "text": "It's kind of different from going through that long mathematical process of proving it, but so important."}, {"time": 418, "text": "Yeah, I think probably our brains are evolved as like intuition machines and the math of like showing it like formally is probably an extra thing that we're not designed for."}, {"time": 432, "text": "You see that with Feynman and his, I mean, it just, all of these physicists, definitely you see starting with intuition, sometimes starting with an experiment and then the experiment inspires intuition."}, {"time": 447, "text": "But you can think of an experiment as a kind of visualization."}, {"time": 451, "text": "Just like let's take whatever the heck we're looking at and draw it and draw like the pattern as it evolves, as the thing grows for N equals one, for N equals two, N equals three, you start to play with it."}, {"time": 464, "text": "And then in the modern day, which I loved doing is, you can write a program that then visualizes it for you."}, {"time": 472, "text": "And then you can start exploring it programmatically."}, {"time": 475, "text": "And then you can do so interactively too."}, {"time": 480, "text": "I tend to not like interactive because it takes way too much work because you have to click and move and stuff."}, {"time": 487, "text": "I love to interact through writing programs, but that's my particular brain, software engineer."}, {"time": 492, "text": "So like you can do all these kinds of visualizations and then there's the tools of visualization, like color, all of those kinds of things that you're absolutely right."}, {"time": 504, "text": "They're actually not taught very much."}, {"time": 507, "text": "Like the art of visualization."}, {"time": 508, "text": "Not taught."}, {"time": 510, "text": "And we love as well color coding."}, {"time": 513, "text": "Like when you represent something mathematically, you can show color to show the growth and kind of code that."}, {"time": 521, "text": "So if I have an algebraic expression for a pattern, maybe I show the X with a certain color, but also write in that color so you can see the relationship."}, {"time": 532, "text": "And yeah, particularly in our work with elementary teachers, many of them come to our workshops and they're literally in tears when they see things making sense visually because they've spent their whole lives not realizing you can really understand things with these visuals."}, {"time": 550, "text": "It's quite powerful."}, {"time": 552, "text": "You say that there's something valuable to learning when the thing that you're doing is challenging, is difficult."}, {"time": 561, "text": "So a lot of people say math is hard or math is too hard or too hard for me."}, {"time": 568, "text": "Do you think math should be easy or should it be hard?"}, {"time": 573, "text": "I think it's great when things are challenging, but there's something that's really key to being able to deal with challenging maths and that is knowing that you can do it."}, {"time": 586, "text": "And I think the problem in education is a lot of people have got this idea that you're either born with a maths brain or you're not."}, {"time": 594, "text": "So when they start to struggle, they think, oh, I don't have that maths brain."}, {"time": 598, "text": "And then they will literally sort of switch off in their brain and things will go downhill from that point."}, {"time": 604, "text": "So struggle becomes a lot easier and you're able to struggle if you don't have that idea, but you know that you can do it."}, {"time": 613, "text": "You have to go through this struggle to get there, but you're able to do that."}, {"time": 618, "text": "And so we're hampered in being able to struggle with these ideas we've been given about what we can do."}, {"time": 625, "text": "Can I ask a difficult question here?"}, {"time": 627, "text": "So there's kind of, I don't know what the right term is, but some people struggle with learning in different ways, like their brain is constructed in different ways."}, {"time": 642, "text": "And how much should, as educators, should we make room for that?"}, {"time": 649, "text": "So how do you know the difference between this is hard and I don't like doing hard things versus my brain is wired in a way where I need to learn in very different ways."}, {"time": 659, "text": "I can't learn it this way."}, {"time": 660, "text": "How do you find that line?"}, {"time": 662, "text": "How do you operate in that gray area?"}, {"time": 664, "text": "So this is why being a teacher is so hard and people really don't appreciate how difficult teaching is when you're faced with, I don't know, 30 students who think in different ways."}, {"time": 674, "text": "So, but this is also why I believe it's so important to have this multi dimensional approach to maths."}, {"time": 681, "text": "We've really offered it in one way, which is here's some numbers in a method."}, {"time": 687, "text": "You follow me, do what I just did and then reproduce it."}, {"time": 691, "text": "And so there are some kids who like doing that and they do well."}, {"time": 694, "text": "And a lot of kids who don't like doing it and don't do well."}, {"time": 699, "text": "But when you open up maths and you give, you let kids experience it in different ways, maybe visually with numbers, with words."}, {"time": 707, "text": "What happens is kids, there are many more kids who can access it."}, {"time": 712, "text": "So those different brain wirings you're talking about, where some people are just more able to do something in a particular way."}, {"time": 720, "text": "That's why we want to, that's one of the reasons we want to open it up so that there are different ways of accessing it."}, {"time": 728, "text": "And then that's not really a problem."}, {"time": 731, "text": "So I grew up in the Soviet Union and fell in love with math early."}, {"time": 737, "text": "I was forced into math early and fell in love through force."}, {"time": 743, "text": "Well, good that you fell in love about the force."}, {"time": 745, "text": "Well, but something we talked about a little bit is there is such a value for excellence."}, {"time": 753, "text": "It's competitive and it's also everybody kind of looks up the definition of success is being in a particular class is being really good at it."}, {"time": 767, "text": "And like, it's not improving."}, {"time": 769, "text": "It's like being really good."}, {"time": 770, "text": "I mean, we are much more like that with sports, for example."}, {"time": 773, "text": "We're not, it's like, it's understood, you're going to star on the basketball team if you're gonna start on the basketball team if you're going to be better than the other guys, the other girls on the team."}, {"time": 786, "text": "So that coupled with the belief, this could be partially a communist belief, I don't know, but the belief that everybody is capable of being great."}, {"time": 799, "text": "But if you're not great, that's your fault and you need to work harder."}, {"time": 803, "text": "And I remember I had a sense that probably delusional, but I could win a Nobel prize."}, {"time": 809, "text": "I don't even know what that entails."}, {"time": 811, "text": "But I thought, like my dad early on told me just offhand and it always stuck with me that if you can figure out how to build a time machine, how to travel back in time, it will probably give you a Nobel prize."}, {"time": 828, "text": "And I remember early in my life thinking I'm going to invent the time machine."}, {"time": 832, "text": "And like the tools of mathematics were in service of that dream of winning the Nobel prize."}, {"time": 840, "text": "It's silly."}, {"time": 840, "text": "I didn't really think in those concrete terms, but I just thought I could be great at feeling."}, {"time": 846, "text": "And then when you struggle, the belief that you could be great is like, struggle is good."}, {"time": 852, "text": "Right, pushes you on, yeah."}, {"time": 854, "text": "And so the other thing about the Soviet system that I'd love to hear your comments about is just the sheer like hours of math."}, {"time": 863, "text": "Like the number of courses, you're talking about a lot of geometry, a lot more geometry."}, {"time": 869, "text": "I think in the American system, you take maybe one year of geometry."}, {"time": 873, "text": "In high school, yeah."}, {"time": 873, "text": "In high school."}, {"time": 875, "text": "First of all, geometry is beautiful, it's visual."}, {"time": 877, "text": "And then you get to reason through proofs and stuff like that."}, {"time": 880, "text": "In Russia, I remember just being nailed over and over with geometry."}, {"time": 883, "text": "It was just nonstop."}, {"time": 885, "text": "And then of course there's different perspectives on calculus and just the whole, the sense was that math is like fundamental to the development of the human mind."}, {"time": 898, "text": "So math, but also science and literature, by the way, was also hit very hard."}, {"time": 904, "text": "Like we read a lot of serious adult stuff."}, {"time": 908, "text": "America does that a little bit too."}, {"time": 909, "text": "They challenge young adults with good literature, but they don't challenge adults very much with math."}, {"time": 916, "text": "So those two things, valuing excellence and just a lot of math in the curriculum."}, {"time": 923, "text": "Do you think, do you find that interesting?"}, {"time": 926, "text": "Because it seems to have been successful."}, {"time": 928, "text": "Yeah, I think that's very interesting."}, {"time": 930, "text": "And there is a lot of success, people coming through the Soviet system."}, {"time": 934, "text": "I think something that's very different to the US and other countries in the world is that idea that excellence is important and you can get there if you work hard."}, {"time": 944, "text": "In the US, there's an idea that excellence is important, but then kids are given the idea in many ways that you can either do it or you're one of the people who can't."}, {"time": 956, "text": "So many students in the school system think they're one of the kids who can't."}, {"time": 959, "text": "So there's no point in trying hard because you're never going to get there."}, {"time": 964, "text": "So if you can switch that idea, it would be huge."}, {"time": 969, "text": "And it seems from what you've said that in the Soviet Union, that idea is really different."}, {"time": 976, "text": "Now, the downside of that idea that anybody can get there if you work hard is that thought that if you're not getting there, it's your fault."}, {"time": 986, "text": "And I would add something into that."}, {"time": 988, "text": "I would say that anybody can get there, but they need to work hard and they also need good teaching because there are some people who really can't get there because they're not given access to that good teaching."}, {"time": 1001, "text": "So, but that would be huge, that change."}, {"time": 1004, "text": "As to doing lots of maths, if maths was interesting and open and creative and multi dimensional, I would be all for it."}, {"time": 1013, "text": "We actually run summer camps at Stanford where we invite kids in and we give them this maths that I love."}, {"time": 1020, "text": "And in our camp classrooms, they were three hours long."}, {"time": 1025, "text": "And when we were planning, the teachers were like three hours, are we going to be able to keep the kids excited for three hours?"}, {"time": 1032, "text": "Turned out they didn't want to go to break or lunch."}, {"time": 1035, "text": "They'd be so into these mathematical patterns."}, {"time": 1039, "text": "We couldn't stop them."}, {"time": 1042, "text": "So yeah, if maths was more like that, then I think having more of it would be a really good thing."}, {"time": 1049, "text": "So what age are you talking about?"}, {"time": 1050, "text": "Is there, could you comment on what age is like the most important when people quit math or give up on themselves or on math in general?"}, {"time": 1062, "text": "And perhaps that age or something earlier is really an important moment for them to discover, to be inspired to discover the magic of math."}, {"time": 1071, "text": "I think a lot of kids start to give up on themselves and maths around from about fifth grade."}, {"time": 1079, "text": "And then those middle school years are really important."}, {"time": 1082, "text": "And fifth grade can be pivotal for kids just because they're allowed to explore and think in good ways in the early grades of elementary school."}, {"time": 1092, "text": "But fifth grade teachers are often like, okay, we're going to prepare you now for middle school and we're going to give you grades and lots of tests."}, {"time": 1098, "text": "And that's when kids start to feel really badly about themselves."}, {"time": 1102, "text": "And so middle school years, our camps are middle school students."}, {"time": 1107, "text": "We think of those years as really pivotal."}, {"time": 1109, "text": "Many kids in those years are deciding, yes, I'm going to keep going with STEM subjects or no, I'm not, that this isn't for me."}, {"time": 1118, "text": "So, I mean, all years are important and in all years you can kind of switch kids and get them on a different pathway."}, {"time": 1125, "text": "But I think those middle school years are really important."}, {"time": 1128, "text": "So what's the role of the teacher in this?"}, {"time": 1130, "text": "So one is the explanation of the subject, but do you think teachers should almost do like one on one, you know, little Johnny, I believe in you kind of thing?"}, {"time": 1141, "text": "Like that energy of like."}, {"time": 1143, "text": "Turns out it's really important."}, {"time": 1145, "text": "There's a study that was done, it was actually done in high school English classrooms where all kids wrote an essay for their teacher."}, {"time": 1154, "text": "And this was done as an experiment."}, {"time": 1156, "text": "Half of the kids got feedback from their teacher, diagnostic feedback, which is great."}, {"time": 1161, "text": "But for half of the kids, it said an extra sentence at the bottom that the researchers had put on."}, {"time": 1166, "text": "And the kids who read that extra sentence did significantly better in English a whole year later."}, {"time": 1173, "text": "The only change was this one sentence."}, {"time": 1176, "text": "What did the sentence say?"}, {"time": 1177, "text": "So what did the sentence say?"}, {"time": 1179, "text": "The sentence said, I'm giving you this feedback because I believe in you."}, {"time": 1185, "text": "And the kids who read that did better a year later."}, {"time": 1189, "text": "So when I share this with teachers, I say, you know, I'm not suggesting you put on the bottom of all kids work."}, {"time": 1196, "text": "I'm giving this feedback because I believe in you."}, {"time": 1198, "text": "One of the teachers said to me, we don't put it on a stamp."}, {"time": 1200, "text": "I said, no, don't put it on a stamp."}, {"time": 1203, "text": "It's, but your words are really important."}, {"time": 1207, "text": "And kids are sitting in classrooms all the time thinking, what does my teacher think of me?"}, {"time": 1213, "text": "Does my teacher think I can do this?"}, {"time": 1217, "text": "So it turns out it is really important to be saying to kids, I know you can do this."}, {"time": 1222, "text": "And those messages are not given enough by teachers."}, {"time": 1227, "text": "And really believe it."}, {"time": 1228, "text": "And believe it."}, {"time": 1230, "text": "You can't just say it, you have to believe it."}, {"time": 1232, "text": "I sometimes, cause it's like, it's such a funny dance, cause I'm almost such a perfectionist."}, {"time": 1239, "text": "I'm extremely self critical."}, {"time": 1241, "text": "And I have one of the students come up to me and it's clear to me that they're not even close to good."}, {"time": 1249, "text": "And it's tempting for me to be like, to sort of give up on them mentally."}, {"time": 1254, "text": "But the reality is like, if you look at many great people throughout history, they sucked at some point."}, {"time": 1261, "text": "And some of the greatest took nonlinear paths to where they sucked for long into later life."}, {"time": 1268, "text": "And so always kind of believing that this person can be great."}, {"time": 1274, "text": "You have to communicate that, plus the fact that they have to work hard."}, {"time": 1279, "text": "Yeah, and you're right."}, {"time": 1279, "text": "Silicon Valley where I live is filled with people who are dropouts at school, or who had special needs, who didn't succeed."}, {"time": 1288, "text": "It's very interesting that have gone on to do amazing work in creative ways."}, {"time": 1294, "text": "I mean, I do think our school system is set up to value good memorizers who can reproduce what a teacher is showing them, and push away those creative deep thinkers, often slower thinkers, they think slowly and deeply."}, {"time": 1313, "text": "And they often get the idea early on that they can't be good at maths or other subjects."}, {"time": 1319, "text": "So yeah, I think many of those people are the ones who go on and do amazing things."}, {"time": 1325, "text": "So there's a guy named Eric Weinstein."}, {"time": 1328, "text": "I know many mathematicians like this, but he talks a lot about having a nonstandard way of learning."}, {"time": 1337, "text": "I mean, a lot of great mathematicians, a lot of great physicists are like that."}, {"time": 1342, "text": "And he felt like he became quickly, he got his PhD at Harvard, became quickly an outcast of the system."}, {"time": 1348, "text": "Like the education, especially early education system, didn't help him."}, {"time": 1353, "text": "Is there ways for an education system to support people like that?"}, {"time": 1360, "text": "Is it this kind of multidimensional learning that you mentioned?"}, {"time": 1364, "text": "I mean, I think education system still uses an approach that was in classrooms hundreds of years ago."}, {"time": 1370, "text": "The textbooks have a lot to answer for in producing this very uninspiring mathematics."}, {"time": 1378, "text": "But yeah, if you open up the subject and have people see and solve it in different ways, and value those different ways."}, {"time": 1385, "text": "Somebody I appreciated a lot is a mathematician called Mary Mizikani."}, {"time": 1389, "text": "I don't know if you've heard of her."}, {"time": 1390, "text": "She won the Fields Medal."}, {"time": 1392, "text": "She was from Iran."}, {"time": 1394, "text": "First woman in the world to win the Fields Medal in mathematics."}, {"time": 1397, "text": "She died when she was 40."}, {"time": 1399, "text": "She was at Stanford."}, {"time": 1401, "text": "But her work was entirely visual."}, {"time": 1404, "text": "And she talked about how her daughter thought she was an artist because she was always visualizing."}, {"time": 1410, "text": "And I attended, she asked me to chair the PhD defense for one of her students."}, {"time": 1417, "text": "And I went to the defense in the math department."}, {"time": 1420, "text": "And it was so interesting because this young woman spent like two hours sharing her work."}, {"time": 1426, "text": "All of it was visual."}, {"time": 1427, "text": "In fact, I don't think I saw any numbers at all."}, {"time": 1431, "text": "And I remember that day thinking, wow, I could have brought her like 13 year old into this PhD defense."}, {"time": 1436, "text": "They would not recognize this as maths."}, {"time": 1440, "text": "But when Maryam Izzakhani won the Fields Medal, all these other mathematicians were saying that her work had connected all these previously unconnected areas of maths."}, {"time": 1451, "text": "And so, but when she was, she also shared that when she was in school, when she was about 13, she was told that she couldn't do maths."}, {"time": 1461, "text": "She was told that by her teacher."}, {"time": 1462, "text": "Is this is Iran?"}, {"time": 1463, "text": "She grew up in Iran."}, {"time": 1464, "text": "In Iran, yeah."}, {"time": 1466, "text": "So I love that."}, {"time": 1467, "text": "To be told you can't be good at maths and then go on and win the Fields Medal is cool."}, {"time": 1473, "text": "I've been told by a lot of people in my life that I can't do something."}, {"time": 1478, "text": "I'm very, definitely nonstandard."}, {"time": 1481, "text": "But all it takes, that's why people talk about like the one teacher that changed everything."}, {"time": 1487, "text": "All it takes is one teacher."}, {"time": 1488, "text": "That's the power of that."}, {"time": 1493, "text": "So that's like, that should be inspiring to teachers."}, {"time": 1497, "text": "You as a single person, given the education system, given the incentives, you have the power to truly change lives."}, {"time": 1503, "text": "And like 20 years from now, I feel as a medalist will walk up to you and say thank you."}, {"time": 1507, "text": "Yeah, so you did that for me."}, {"time": 1510, "text": "And I share that with teachers that even in this broken system of what they have to do for districts and textbooks, a single teacher can change kids maths relationship or other subjects forever."}, {"time": 1526, "text": "What's the role of the parents in this picture?"}, {"time": 1529, "text": "Let's go to another difficult subject."}, {"time": 1531, "text": "Yeah, that is a difficult subject."}, {"time": 1534, "text": "One study found that the amount of maths anxiety parents had predicted their child's achievement in school, but only if they helped with homework."}, {"time": 1551, "text": "So... Oh, that's so funny."}, {"time": 1557, "text": "There are some interesting implications for this."}, {"time": 1559, "text": "I mean, you can see how it works."}, {"time": 1561, "text": "If you have maths anxiety and you're helping your kids with homework, you're probably communicating things like, oh, I was terrible at this at school."}, {"time": 1569, "text": "And that's how it gets passed on to kids."}, {"time": 1572, "text": "So one implication is if you have a really bad relationship with maths, you hate maths, you have maths anxiety, just don't do maths homework with your kids."}, {"time": 1582, "text": "But we have on our website, we have a little sheet for parents of ways to interact around maths with your kids and... That's ucubed.org."}, {"time": 1596, "text": "That's ucubed.org, yes."}, {"time": 1599, "text": "So one of the things I say to parents when I give parent presentations is even if you hate maths, you need to just fake it with your kids."}, {"time": 1606, "text": "You should be always endlessly optimistic and happy about doing maths."}, {"time": 1614, "text": "I'm always curious about this."}, {"time": 1615, "text": "So I hope to have kids one day."}, {"time": 1617, "text": "I don't have kids currently."}, {"time": 1620, "text": "Are parents okay with like sucking at maths and then trying to get their kid to be better than them essentially?"}, {"time": 1627, "text": "Like, is that difficult thing for a lot of parents?"}, {"time": 1629, "text": "It is difficult."}, {"time": 1630, "text": "To have like, it's almost like an ego thing."}, {"time": 1632, "text": "Like, I never got good at this and I probably should have."}, {"time": 1636, "text": "And yeah, I mean, to me, you wanna celebrate that, but I know a lot of people struggle with that."}, {"time": 1643, "text": "Like coaches in sports, to make an athlete become better than them, it can be hard on the ego."}, {"time": 1652, "text": "So do you experience the same with parents too?"}, {"time": 1655, "text": "I think, I mean, I haven't experienced parents worrying that their kids will be better than them."}, {"time": 1660, "text": "I have experienced..."}, {"time": 1662, "text": "I have experienced parents just having a really bad relationship with maths and not wanting to help, not knowing how to help, saying things."}, {"time": 1674, "text": "Like another study showed that when mothers say to their daughters, I was bad at maths in school, their daughter's achievement goes down."}, {"time": 1682, "text": "So we know that kids pick up on these messages and which is why I say you should fake it."}, {"time": 1688, "text": "But also I know that lots of people have just had a really bad relationship with maths, even successful people."}, {"time": 1695, "text": "The undergrads I teach at Stanford have pretty much always done well in maths, but they come to Stanford thinking maths is a set of methods to memorize."}, {"time": 1708, "text": "And so, so do many parents believe that."}, {"time": 1711, "text": "There's one method that you memorize and then you reproduce it."}, {"time": 1716, "text": "So until people have really had an experience of what I think of as the other maths, well, until they've really seen that it's a really different subject, it's hard for them to be able to shift their kids to see it differently."}, {"time": 1732, "text": "Is there for a teacher, if we were to like systematize it, is there something teachers can do to do this more effectively?"}, {"time": 1741, "text": "So you mentioned the textbook."}, {"time": 1744, "text": "So what are the additional things you can add on top of this whole old school traditional way of teaching that can improve the process?"}, {"time": 1754, "text": "So I do think there's a way of teaching maths that changes everything for kids and teachers."}, {"time": 1761, "text": "So I'm one of five writers of a new framework for the state of California, a new maths framework."}, {"time": 1767, "text": "It's coming out next year."}, {"time": 1769, "text": "And we are recommending through this maths framework that people teach in this way."}, {"time": 1773, "text": "It's called teaching to big ideas."}, {"time": 1777, "text": "So at the moment, people have standards that have been written, and then textbooks have taken these standards and made not very good questions."}, {"time": 1788, "text": "And if you look at the standards, like I have some written down here, just reading the standards, it makes maths seem really boring and uninspiring."}, {"time": 1797, "text": "What are the kind of, can you give a few examples?"}, {"time": 1800, "text": "So this is an interesting example."}, {"time": 1803, "text": "In third grade, there are three different standards about unit squares."}, {"time": 1811, "text": "So this is one of them."}, {"time": 1812, "text": "A square with side length one unit, called a unit square, is said to have one square unit of area and can be used to measure area."}, {"time": 1820, "text": "And that's something you're expected to learn?"}, {"time": 1823, "text": "That is something, so that's a standard."}, {"time": 1825, "text": "The textbook authors say, oh, I'm gonna make a question about that."}, {"time": 1828, "text": "And they translate the standards into narrow questions."}, {"time": 1832, "text": "And then you measure success by your ability to deliver on these standards."}, {"time": 1836, "text": "So the standards themselves, I think of maths and many people think of maths in this way as a subject of like a few big ideas and really important connections between them."}, {"time": 1848, "text": "So you could think of it as like a network map of ideas and connections."}, {"time": 1852, "text": "And what standards do is they take that beautiful map and they chop it up like this into lots of little pieces and they deliver the pieces to schools."}, {"time": 1861, "text": "And so teachers don't see the connections between ideas, nor do the kids."}, {"time": 1866, "text": "So anyway, this is a bit of a long way of saying that what we've done in this new initiative is we have set out maths as a set of big ideas and connections between them."}, {"time": 1877, "text": "So this is grade three."}, {"time": 1880, "text": "So instead of there being 60 standards, we've said, well, you can pull these different standards to get in with each other and also value the ways these are connected."}, {"time": 1898, "text": "And by the way, for people who are just listening, we're looking at a small number of like big concepts within mathematics, square towels, measuring fraction, shape and time, and then how they're interconnected."}, {"time": 1911, "text": "And so the goal, this is for grade three, for example."}, {"time": 1915, "text": "Yeah, and so we've set out for the state of California, the whole of mathematics K10 as a set of big ideas and connections."}, {"time": 1925, "text": "So we know that teachers, it works really well if they say, okay, so a big idea in my grade is measuring."}, {"time": 1935, "text": "And instead of reading five procedural statements that involve measuring, they think, okay, measuring is a big idea."}, {"time": 1942, "text": "What rich, deep activity can I use that teaches measuring to kids?"}, {"time": 1947, "text": "And as kids work on these deep, rich activities, maybe over a few days, turns out a lot of maths comes into it."}, {"time": 1955, "text": "So we're recommending that let's not teach maths according to all these multiple statements and lots and lots of short questions."}, {"time": 1965, "text": "Instead, let's teach maths by thinking about what are the big ideas and what are really rich, deep activities that teach those big ideas."}, {"time": 1973, "text": "So that's the, like how you teach it and maximize learning."}, {"time": 1977, "text": "What about like from a school district perspective, like measuring how well you're doing, grades and tests and stuff like that."}, {"time": 1987, "text": "Do you throw those out or is it possible?"}, {"time": 1988, "text": "I am not a fan of grades and tests myself."}, {"time": 1993, "text": "I think grades are fine if they're used at the end of a course."}, {"time": 1998, "text": "So at the end of my maths course, I might get a grade because a grade is meant to be a summative measure."}, {"time": 2004, "text": "It kind of describes your summative achievement."}, {"time": 2007, "text": "But the problem we have in maths classrooms across the US is people use grades all the time, every week or every day even."}, {"time": 2016, "text": "My own kids, when they went through high school, technology has not helped with this."}, {"time": 2020, "text": "When they went through high school, they knew they were being graded for everything they did, everything."}, {"time": 2025, "text": "And not only were they being graded for everything, but they could see it in the grade book online and it would alter every class they went into."}, {"time": 2032, "text": "So this is the ultimate, what I think of as a performance culture."}, {"time": 2037, "text": "You're there to perform, somebody's measuring you, you see your score."}, {"time": 2043, "text": "So I think that's not conducive for deep learning."}, {"time": 2048, "text": "And yes, have a grade at the end of the year, but during the year, you can assess kids in much better ways."}, {"time": 2054, "text": "Like teachers can, a great way of assessing kids is to give them a rubric that kind of outlines what they're learning over the course of a unit or a few weeks."}, {"time": 2065, "text": "So kids can actually see the journey they're on, like this is what we're doing mathematically."}, {"time": 2071, "text": "Sometimes they self assess on those units and then teachers will show what the kids can do with a rubric and also write notes."}, {"time": 2082, "text": "Like in the next few weeks, you might like to learn to do this."}, {"time": 2088, "text": "So instead of kids just thinking about, I'm an A kid or a B kid, or I have this letter attached to me, they're actually seeing mathematically what's important and they're involved in the process of knowing where they are mathematically."}, {"time": 2102, "text": "At the end of the year, sure, they can have a grade, but during the year, they get these much more informative measures."}, {"time": 2110, "text": "I do think this might be more for college, but maybe not."}, {"time": 2116, "text": "Some of the best classes I've had is when I got a special like set aside, like the professor clearly saw that I was interested in some aspect of a thing."}, {"time": 2129, "text": "And then I have a few in mind and one in particular, when he said that he kind of challenged me."}, {"time": 2138, "text": "So this is outside of grades and all that kind of stuff that basically it's like reverse psychology."}, {"time": 2144, "text": "I don't think this can be done."}, {"time": 2147, "text": "And so I gave everything to do that particular thing."}, {"time": 2150, "text": "So this happened to be in an artificial intelligence class."}, {"time": 2154, "text": "But I think that like special treatment of taking students who are especially like excellent at a particular little aspect, that you see their eyes light up."}, {"time": 2166, "text": "I often think like maybe it's tempting for a teacher to think you've already succeeded there, but they're actually signaling to you that like you could really launch them on their way."}, {"time": 2178, "text": "And I don't know, that's too much to expect from teachers I think to pay attention to all of that because it's really difficult."}, {"time": 2185, "text": "But I just kind of remember who are the biggest, the most important people in the history of my life of education."}, {"time": 2194, "text": "And it's those people that who really didn't just like inspire me with their awesomeness, which they did, but also just they pushed me a little."}, {"time": 2202, "text": "Like they gave me a little push."}, {"time": 2205, "text": "And that requires focusing on the quote unquote excellent students in the class."}, {"time": 2210, "text": "Yeah, I think what's important though is teachers to have the perspective that they don't know who's gonna be excellent at something before they give out the activity."}, {"time": 2221, "text": "And in our camp classes that we ran, sometimes students would finish ahead of other students."}, {"time": 2230, "text": "And we would say to them, can you write a question that's like this but different?"}, {"time": 2239, "text": "Oh, and over time we encourage them to like extend things further."}, {"time": 2244, "text": "I remember we were doing one activity where kids were working out the borders of a square and how big this border would be in different case sizes."}, {"time": 2253, "text": "And one of the boys came up at the end of the class and said, I've been thinking about how you do this to the Pentagon."}, {"time": 2260, "text": "And I said, that's fantastic."}, {"time": 2262, "text": "How do you, what does it look like with Pentagon?"}, {"time": 2264, "text": "Go find out, see if you can discover."}, {"time": 2267, "text": "So I didn't know he was gonna come up and say that."}, {"time": 2269, "text": "And I didn't have in my head like this is the kid who could have this extension task, but you can still do that as a teacher."}, {"time": 2279, "text": "When kids get excited about something or they're doing well in something, have them extend it, go further."}, {"time": 2287, "text": "And then you also, like this is like teacher and coach, you could say it in different ways to different students."}, {"time": 2293, "text": "Like for me, the right thing to say is almost to say, I don't think you could do this, this is too hard."}, {"time": 2301, "text": "Like that's what I need to hear."}, {"time": 2303, "text": "It's just like, no, there's immediate push."}, {"time": 2306, "text": "But with some people, if they're a little bit more, I mean, it's all has to do with upbringing, how your genetics is."}, {"time": 2313, "text": "They might be much more, that might break them."}, {"time": 2315, "text": "Yeah, that might break them."}, {"time": 2316, "text": "And so you have to be also sensitive to that."}, {"time": 2318, "text": "I mean, teaching is really difficult for this very reason."}, {"time": 2323, "text": "So what is the best way to teach math, to learn math at those early few days when you just wanna capture them?"}, {"time": 2333, "text": "I do something, actually there's a video of me doing this on our website that I love when I first meet students."}, {"time": 2343, "text": "And this is what I do."}, {"time": 2344, "text": "I show them a picture, this is the picture I show them."}, {"time": 2348, "text": "And it's a picture of seven dots like this."}, {"time": 2352, "text": "And I show it for just a few seconds and I say to them, I'd like you to tell me how many dots there are, but I don't want you to count them."}, {"time": 2359, "text": "I want you to group the dots."}, {"time": 2360, "text": "And I show it them and then I take it away before they've even had enough time to count them."}, {"time": 2367, "text": "And then I ask them, so how did you see it?"}, {"time": 2369, "text": "And I go around the room and amazingly enough, there's probably 18 different ways of seeing these seven dots."}, {"time": 2379, "text": "And so I ask people, tell me how you grouped it."}, {"time": 2382, "text": "And some people see it as like an outside hole with a center dot."}, {"time": 2385, "text": "Some people see like stripes of lines."}, {"time": 2389, "text": "Some people see segments."}, {"time": 2391, "text": "And I collect them all and I put them on the board."}, {"time": 2393, "text": "And at the end I say, look at this, we are a class of 30 kids and we saw these seven dots in 18 different ways."}, {"time": 2400, "text": "There's actually a mathematical term for this."}, {"time": 2401, "text": "It's called groupitizing."}, {"time": 2403, "text": "Groupitizing?"}, {"time": 2407, "text": "So turns out though that how well you groupitize predicts how well you do in maths."}, {"time": 2415, "text": "Is it a raw talent or is it just something that you can develop?"}, {"time": 2419, "text": "I don't think it's raw."}, {"time": 2420, "text": "I don't think you're born groupitizing, I think, but some kids have developed that ability if you like."}, {"time": 2427, "text": "And you can learn it."}, {"time": 2428, "text": "So this to me is part of how wrong we have maths."}, {"time": 2434, "text": "That we think to tell whether a kid's good at maths, we're gonna give them a speed test on multiples."}, {"time": 2440, "text": "But actually seeing how kids group dots could be a more important assessment of how well they're gonna do in maths."}, {"time": 2448, "text": "Anyway, I diverge."}, {"time": 2449, "text": "What I like to do though when I start off with kids is show them I'm gonna give you maths problems."}, {"time": 2454, "text": "I'm gonna value the different ways you see them."}, {"time": 2457, "text": "And it turns out you can do this kind of problem asking people how they group dots with young children or with graduate students."}, {"time": 2465, "text": "And it's engaging for all of them."}, {"time": 2470, "text": "You talk about creativity a little bit and flexibility in your book Limitless."}, {"time": 2475, "text": "What's the role of that?"}, {"time": 2476, "text": "So it sounds like there's a bit of that kind of thing involved in groupitizing."}, {"time": 2485, "text": "So what would you say is the role of creativity and flexibility in the learning of maths?"}, {"time": 2491, "text": "I think what we know now is that what we need for this 21st century world we live in is a flexible mind."}, {"time": 2502, "text": "School should not really be about teaching kids particular methods but teaching them to approach problems with flexibility."}, {"time": 2509, "text": "Being creative, thinking creatively is really important."}, {"time": 2512, "text": "So people don't think the words maths and creativity come together, but that's what I love about maths is the creative different ways you can see it."}, {"time": 2522, "text": "And so helping our kids, there's a book I like a lot by physicists, you probably know this book called Elastic."}, {"time": 2533, "text": "You might know it."}, {"time": 2535, "text": "And it's about how we want elastic minds."}, {"time": 2538, "text": "Same kind of thing, flexible, creative minds."}, {"time": 2541, "text": "And schools do very little on developing that kind of mind."}, {"time": 2546, "text": "They do a lot of developing the kind of mind that a computer now does for us."}, {"time": 2555, "text": "Memorization."}, {"time": 2556, "text": "Memorization, doing procedures, a lot of things that we spend a lot of time in school on."}, {"time": 2565, "text": "In the world, when kids leave school, a computer will do that and better than they will."}, {"time": 2572, "text": "But that creative, flexible thinking, we're kind of at ground zero at computers being able to engage in that thinking."}, {"time": 2579, "text": "Maybe we're a little above ground zero, but the human brain is perfectly suited for that creative, flexible thinking."}, {"time": 2587, "text": "That's what humans are so great at."}, {"time": 2589, "text": "So I would like the balance to shift in schools."}, {"time": 2592, "text": "Maybe you still need to do some procedural kind of thinking, but there should be a lot more of that creative, flexible thinking."}, {"time": 2600, "text": "And what's the role of other humans in this picture?"}, {"time": 2604, "text": "So collaborative learning, so brainstorming together."}, {"time": 2609, "text": "So creativity as it emerges from the collective intelligence of multiple humans."}, {"time": 2614, "text": "Yeah, super important."}, {"time": 2616, "text": "And we know that also helps develop your brain, that social side of thinking."}, {"time": 2622, "text": "And I love mathematics collaboration where people build on each other's ideas and they come up with amazing things."}, {"time": 2629, "text": "I actually taught a hundred students calculus at Stanford recently, undergrads, and we taught them to collaborate."}, {"time": 2639, "text": "So these students came in Stanford and most of them were against collaboration in math."}, {"time": 2644, "text": "This is before COVID in person?"}, {"time": 2646, "text": "Yeah, it was just before COVID hit."}, {"time": 2648, "text": "It was 2019."}, {"time": 2650, "text": "And this summer."}, {"time": 2652, "text": "So you said they're against?"}, {"time": 2653, "text": "Yeah, so it's really interesting."}, {"time": 2656, "text": "So they'd only experienced maths individually in a kind of competitive individual way."}, {"time": 2662, "text": "And if they had experienced it as group work, it had been a bad experience."}, {"time": 2666, "text": "Like maybe they were the one who did it all and the others didn't do much."}, {"time": 2671, "text": "So they were kind of against collaboration."}, {"time": 2673, "text": "They didn't see any role for it in maths."}, {"time": 2675, "text": "And we taught them to collaborate and it was hard work because as well as the fact that they were kind of against collaboration, they came in with a lot of like social comparison thinking."}, {"time": 2688, "text": "So I'm in this room with other Stanford undergrads and they're better than me or..."}, {"time": 2693, "text": "So when we set them to work on a maths problem together, the first one was kind of a disaster because they put all like, they're better than me."}, {"time": 2699, "text": "They're faster than me."}, {"time": 2700, "text": "They came up with something I didn't come up with."}, {"time": 2702, "text": "So we taught them to let go of that thinking and to work well together."}, {"time": 2708, "text": "And one of the things we did, we decided we wanted to do a pre and post test at the end of this teaching."}, {"time": 2713, "text": "It was only four weeks long, but we knew we didn't want to give them like a time test of individual work."}, {"time": 2719, "text": "So we gave them an applied problem to do at the beginning and we gave them to do in pairs together."}, {"time": 2726, "text": "And we gave each of them a different colored pen and said, work on this activity together and keep using that pen."}, {"time": 2733, "text": "So then we had all these pieces of student work."}, {"time": 2735, "text": "And what we saw was they just worked on separate parts of the paper."}, {"time": 2739, "text": "So there's a little like red pen section and a green pen section."}, {"time": 2743, "text": "And they didn't do that well on it."}, {"time": 2745, "text": "Even though it was a problem that middle or high school kids could do, but it was like a problem solving kind of problem."}, {"time": 2752, "text": "And then we gave them the same one to do at the end, gave them the same colors."}, {"time": 2756, "text": "And actually they had learned to collaborate."}, {"time": 2759, "text": "And not only were they collaborating the second time round, but that boosted their achievement."}, {"time": 2764, "text": "And the ones who collaborated did better on the problem."}, {"time": 2767, "text": "Collaboration is important, having people, and what was so eye opening for these undergrads and they talked about it in lovely ways was I learned to value other people's thinking on a problem."}, {"time": 2779, "text": "And I learned to value that other people saw it in different ways."}, {"time": 2784, "text": "And it was quite a big experience for them that they came out thinking, I can do maths with other people."}, {"time": 2793, "text": "People can see it differently."}, {"time": 2794, "text": "We can build on each other's ways of thinking."}, {"time": 2798, "text": "I got a chance to, I don't know if you know who Daniel Kahneman is, got a chance to interact with him."}, {"time": 2804, "text": "And like the first, cause he had a few, but one famous collaboration throughout his life with Tversky."}, {"time": 2812, "text": "And just like, you know, he hasn't met me before in person, but just the number of questions he was asking, just the curiosity."}, {"time": 2823, "text": "So I think one of the skills, the collaboration itself is a skill."}, {"time": 2827, "text": "And I remember my experience with him was like, okay, I get why you're so good at collaboration because he was just extremely good at listening and genuine curiosity about how the other person thinks about the world, sees the world."}, {"time": 2843, "text": "And then together he's, he pulled me in in that particular case."}, {"time": 2847, "text": "He doesn't know in particular, like that much about autonomous vehicles, but he kept like asking all of these questions."}, {"time": 2854, "text": "And then like 10 minutes in, we're together trying to solve the problem of autonomous driving."}, {"time": 2859, "text": "And like, and that, I mean, that's really fulfilling."}, {"time": 2863, "text": "That's really enriching."}, {"time": 2863, "text": "But it also in that moment made me realize it's kind of a skill."}, {"time": 2868, "text": "Cause you have to kind of put your ego aside, put your view of the world aside and try to learn how the other person sees it."}, {"time": 2875, "text": "And the other thing you have to put aside is this social comparison thinking."}, {"time": 2880, "text": "Like if you are sitting there thinking, wow, that was an amazing idea."}, {"time": 2884, "text": "He's so much better than I am."}, {"time": 2886, "text": "That's really gonna stop you taking on the value of that idea."}, {"time": 2892, "text": "And so there's a lot of that going on between these Stanford students when they came."}, {"time": 2897, "text": "And trying to help them let go of that."}, {"time": 2901, "text": "One of the things I've discovered just because being a little bit more in the public eye, how rewarding it is to celebrate others."}, {"time": 2911, "text": "And how much is going to actually pay off in the long term."}, {"time": 2915, "text": "So this kind of silo thinking of like, I want to prove to a small set of people around me that I'm really smart and do so by basically not celebrating how smart the other people are."}, {"time": 2928, "text": "That's actually maybe short term, it seems like a good strategy, but long term it's not."}, {"time": 2934, "text": "And I think if you practice at the student level and then at the career level, at every single stage, I think that's ultimately."}, {"time": 2941, "text": "I think that's a really good way of thinking about it."}, {"time": 2944, "text": "You mentioned textbooks and you didn't say it, maybe textbooks isn't the perfect way to teach mathematics, but I love textbooks."}, {"time": 2956, "text": "They're like pretty pictures and they smell nice and they open."}, {"time": 2959, "text": "I mean, I talk about like physical."}, {"time": 2961, "text": "Some of my greatest experiences have been just like, cause they're really well done."}, {"time": 2967, "text": "When we're talking about basic, like high school, calculus, biology, chemistry, those are like, those are incredible."}, {"time": 2976, "text": "It's like Wikipedia, but with color and a nice little."}, {"time": 2980, "text": "You must've seen some good textbooks if they had pretty pictures and color."}, {"time": 2984, "text": "Yeah, I mean, I remember, I guess it was very, very standard, like AP calculus, AP biology, AP chemistry."}, {"time": 2993, "text": "I felt those were like some of the happiest days of my life in terms of learning was high school."}, {"time": 2998, "text": "Cause it was very easy, honestly."}, {"time": 3001, "text": "It felt hard at the time, but you're basically doing a whirlwind tour of all the science."}, {"time": 3009, "text": "Without having to pick, you do literature, you do like Shakespeare, calculus, biology, physics, chemistry, what else?"}, {"time": 3019, "text": "Anatomy, physiology, computer science, without like, nobody's telling you what to do with your life."}, {"time": 3026, "text": "You're just doing all of those things."}, {"time": 3028, "text": "That's a good thing, you're right."}, {"time": 3029, "text": "But I remember the textbooks weren't, I mean, maybe I'm romanticizing the past, but I remember they weren't, they're pretty good."}, {"time": 3038, "text": "But so you think, what role do you think they play still?"}, {"time": 3042, "text": "And like in this more modern digital age, what's the best materials with which to do these kinds of educations?"}, {"time": 3050, "text": "Well, I'm intrigued that you had such a good experience with textbooks."}, {"time": 3053, "text": "I mean, I can remember loving some textbooks I had when I was learning and I love books."}, {"time": 3059, "text": "I love to pick up books and look through them, but a lot of maths textbooks are not good experiences for kids."}, {"time": 3068, "text": "They, we have a video on our website of the kids who came to our camp and one of the students says, in maths, you have to follow the textbook."}, {"time": 3078, "text": "The textbook is kind of like the Bible."}, {"time": 3080, "text": "You have to follow it."}, {"time": 3082, "text": "And every day it's slightly different."}, {"time": 3085, "text": "Like on Monday you do 2.3.2 and on Tuesday you do 2.3.3 and on Wednesday."}, {"time": 3092, "text": "And you never go off that."}, {"time": 3095, "text": "That's like every single day."}, {"time": 3097, "text": "And that's not inspiring for a lot of the kids."}, {"time": 3103, "text": "So one of the things they loved about our camp was just that there were no books."}, {"time": 3106, "text": "Even though we gave them sheets of paper instead, they still felt more free because they weren't just like trotting through exercises, exercises, so."}, {"time": 3119, "text": "Like what a textbook allows you is like you're, the very thing you said they might not like, the 2.3, 2.3, it feels like you're making progress."}, {"time": 3131, "text": "And like it's little celebrations because you do the problem and it seems really hard and you don't know how to do it."}, {"time": 3137, "text": "And then you try and try and then eventually succeed."}, {"time": 3140, "text": "And then you make that little step and further progress."}, {"time": 3143, "text": "And then you get to the end of a chapter and you get to like, it's closure."}, {"time": 3148, "text": "You're like, all right, I got that figured out."}, {"time": 3149, "text": "And then you go on to the next chapter."}, {"time": 3152, "text": "I mean, I think it could be in a textbook."}, {"time": 3154, "text": "You can have a good experience with a textbook, but what's really important is what is in that textbook?"}, {"time": 3163, "text": "What are you doing inside it?"}, {"time": 3165, "text": "And I mean, I grew up in England and in England we learn maths."}, {"time": 3170, "text": "We don't have this separation of algebra and geometry."}, {"time": 3174, "text": "And I don't think any other country apart from the US has that."}, {"time": 3178, "text": "But I look at kids in algebra classes where they're doing algebra for a year."}, {"time": 3182, "text": "And I think I would have been pretty bored doing that."}, {"time": 3185, "text": "By the way, can we analyze your upbringing real quick?"}, {"time": 3193, "text": "Why do British folks call mathematics, maths?"}, {"time": 3199, "text": "Why is it the plural?"}, {"time": 3201, "text": "Is it because of everything you're saying where it's a bunch of subdisciplines?"}, {"time": 3205, "text": "Yeah, I mean, mathematics is supposed to be the different maths that you look at, whether you think of that as topics like geometry and probability, or I think of it as maths is just multi dimensional lots of ways, but that's why it was called mathematics."}, {"time": 3228, "text": "And then it was shortened to maths."}, {"time": 3230, "text": "And then for some reason it was just math in the US."}, {"time": 3233, "text": "But to me, math has that more singular feel to it."}, {"time": 3238, "text": "And there's an expression here, which is do the math, which basically means do a calculation."}, {"time": 3245, "text": "That's what people mean by do the math."}, {"time": 3247, "text": "So I don't like that expression because no math could be anything doesn't have to be calculation."}, {"time": 3252, "text": "And so yeah, I like maths because it has more of that broad feel to it."}, {"time": 3257, "text": "Yeah, I love that."}, {"time": 3258, "text": "Maths kind of emphasize the multi dimensional, like a variety of different subdisciplines, different approaches."}, {"time": 3265, "text": "Okay, but outside of the textbook, what do you see like broadly being used?"}, {"time": 3273, "text": "You mentioned Sebastian Thrun and MOOCs, online education."}, {"time": 3277, "text": "Do you think that's an effective set?"}, {"time": 3279, "text": "Can be."}, {"time": 3280, "text": "I mean, online, having great teachers online, obviously extends those teachers to many more people."}, {"time": 3288, "text": "And that's a wonderful thing."}, {"time": 3291, "text": "I have quite a few online courses myself."}, {"time": 3294, "text": "I got the bug working with Sebastian when he had released his first MOOC."}, {"time": 3299, "text": "And I thought, maybe I could do one in maths education."}, {"time": 3303, "text": "And I didn't know if anybody would take it."}, {"time": 3306, "text": "I remember releasing it that first summer and it was a free online class and 30,000 maths teachers took it that first summer."}, {"time": 3313, "text": "And they were all talking about it with each other and sharing it and it was like took off."}, {"time": 3318, "text": "In fact, it was that MOOC that got me to create YouCubed with Kathy Williams, who's the co founder, because people took the MOOC and then they said, okay, what now?"}, {"time": 3330, "text": "I finished, what can I have next?"}, {"time": 3333, "text": "And so that was where we made our website."}, {"time": 3335, "text": "But so yeah, I think online education can be great."}, {"time": 3339, "text": "I do think a lot of the MOOCs don't have great pedagogy."}, {"time": 3343, "text": "They're just a talking head."}, {"time": 3345, "text": "And you can actually engage people in more active ways, even in online learning."}, {"time": 3353, "text": "So I learned from the Udacity principle when I was working at Udacity, never to talk more than like five minutes."}, {"time": 3360, "text": "And then to ask people to do something."}, {"time": 3363, "text": "So that's the sort of pedagogy of the online classes I have is a little bit of presenting something and then people do something and there's a little bit more."}, {"time": 3373, "text": "Because I think if you have a half hour video, you just switch off and start doing other things."}, {"time": 3379, "text": "So the way Udacity did it is like five, 10 minute, like bit of teaching with some visual stuff perhaps."}, {"time": 3387, "text": "And then there's like a quiz almost."}, {"time": 3389, "text": "Then you answer a question, yeah."}, {"time": 3390, "text": "Yeah, no, that's really effective."}, {"time": 3394, "text": "You mentioned Ucubed, so what's the mission?"}, {"time": 3396, "text": "You mentioned how it started, but what's yeah, where are you at now?"}, {"time": 3402, "text": "And what's your dream with it?"}, {"time": 3404, "text": "What are the kind of things that people should go and check out?"}, {"time": 3407, "text": "Yeah, we started Ucubed, I guess it was about five years ago now and we've had over 52 million visitors to the site."}, {"time": 3415, "text": "So I'm very happy about that."}, {"time": 3417, "text": "And our goal is to share good ideas for teaching with teachers, students, parents in maths and to help."}, {"time": 3427, "text": "We have a sort of sub goal of a raising maths anxiety."}, {"time": 3430, "text": "That's important to us, but also to share maths as this beautiful creative subject."}, {"time": 3435, "text": "And it's been really great."}, {"time": 3439, "text": "We have lessons on the site, but one of the reasons I thought this was needed is there's a lot of knowledge in the academy about how to teach maths well."}, {"time": 3449, "text": "Loads and loads of research and journals and lots of things written up, but teachers don't read it."}, {"time": 3456, "text": "They don't have access to it."}, {"time": 3459, "text": "They're often behind pay walls, they've written in really inaccessible ways."}, {"time": 3466, "text": "So people wouldn't want to read them or understand them."}, {"time": 3469, "text": "So this actually is a big problem."}, {"time": 3471, "text": "You have this whole industry of people finding out how to teach well, not sharing it with the people who are teaching."}, {"time": 3478, "text": "So that's why we made Ucubed."}, {"time": 3481, "text": "And instead of just putting articles up saying, here's some things to read about how to teach well, we translated what was coming from research into things that teacher could use."}, {"time": 3490, "text": "So lessons, there were videos to show kids and there were tips for parents."}, {"time": 3496, "text": "There were all sorts of things on the site."}, {"time": 3497, "text": "And it's been amazing."}, {"time": 3500, "text": "As we took inspiration from the week of code, which got teachers to focus on coding for a week."}, {"time": 3509, "text": "And we have this thing called the week of inspirational maths."}, {"time": 3513, "text": "And we say, just try it for a week."}, {"time": 3515, "text": "Just give us one week and try it and see what happens."}, {"time": 3519, "text": "And so it's been downloaded millions of times."}, {"time": 3522, "text": "Teachers use it every year."}, {"time": 3524, "text": "They start the school year with it."}, {"time": 3526, "text": "And what they tell us is it was amazing."}, {"time": 3529, "text": "The kids lights were on, they were excited, they loved it."}, {"time": 3532, "text": "And then the week finished and I opened my textbooks and the lights went out and they were not interested."}, {"time": 3540, "text": "Yeah, but getting that first inspiration is still powerful."}, {"time": 3544, "text": "It is, I wish, I mean, what I would love is if we could actually extend that for the whole year."}, {"time": 3551, "text": "We're a small team at Stanford and we're trying to keep up with great things to put on the site."}, {"time": 3559, "text": "We haven't the capacity to produce these creative visual maths tasks for every year group for every day, but I would love to do that."}, {"time": 3567, "text": "How difficult is it to do?"}, {"time": 3568, "text": "I mean, it's to come up with visual formulations of these big important topics you need to think about in a way that you could teach."}, {"time": 3583, "text": "I mean, we can do it."}, {"time": 3584, "text": "We actually, we went from the week of inspirational maths and we made K8 maths books with exactly that."}, {"time": 3591, "text": "Big ideas, rich activities, visuals."}, {"time": 3594, "text": "We just finished the last one."}, {"time": 3596, "text": "We've been doing it for five years and it's been exhausting and we just finished."}, {"time": 3601, "text": "So now there's a whole K8 set of books and they're organized in that way."}, {"time": 3607, "text": "These are the big ideas."}, {"time": 3608, "text": "Here are rich, deep activities."}, {"time": 3611, "text": "They're not though what you can do every day for a year."}, {"time": 3616, "text": "So some teachers use them as a kind of supplement to their boring textbook."}, {"time": 3621, "text": "And some people have said, okay, this is the year."}, {"time": 3624, "text": "This book tells us what the year is and then we'll supplement these big activities with."}, {"time": 3629, "text": "So they're being used and teachers really like them and are really happy about them."}, {"time": 3636, "text": "I just always want more."}, {"time": 3637, "text": "And I guess one of the things I would like for YouCubed, one of my personal goals is that every teacher of maths knows about YouCubed."}, {"time": 3645, "text": "At the moment, lots of teachers who come to us are really happy they found it but there's a lot of other teachers who don't know that it exists."}, {"time": 3653, "text": "I hope this helps."}, {"time": 3655, "text": "From a student perspective and not in the classroom but at home studying, is there some advice you can give on how to best study mathematics?"}, {"time": 3669, "text": "So what's the role of the student outside the classroom?"}, {"time": 3673, "text": "Yeah, I think one thing we know is a lot of people when they review material, whether it's maths or anything else, don't do it in the best way."}, {"time": 3683, "text": "I think a problem a lot of people have is they read through maybe a teacher's explanation or a way of doing maths and it makes sense."}, {"time": 3692, "text": "And they think, oh yeah, I've got that."}, {"time": 3693, "text": "And they move on."}, {"time": 3696, "text": "But then it's not until you come to try and work on something and do a problem that you actually realize you didn't really understand it, just seemed to make sense."}, {"time": 3704, "text": "So I would say, this is also something that neuroscientists talk about, to keep giving yourself questions is a really good way to study."}, {"time": 3716, "text": "Rather than looking through lots of material, it's always like giving yourself lots of tests is a good way to actually deeply understand things and know what you do and you don't understand."}, {"time": 3727, "text": "So would the questions be in the form of the material you're reviewing is the answer to that question?"}, {"time": 3734, "text": "Or is it almost like beyond, it's the polygon thing they mentioned for a square."}, {"time": 3738, "text": "Is it almost like, I wonder what is the bigger picture?"}, {"time": 3742, "text": "I was kind of asking like, how is this extended and so on?"}, {"time": 3746, "text": "Yeah, that would be great."}, {"time": 3748, "text": "And it's a similar, I mean, a question I get asked a lot is about homework."}, {"time": 3752, "text": "What is a good thing for kids to do for homework?"}, {"time": 3754, "text": "And one of the recommendations I give is to not have kids just do lots of questions for homework, but to actually ask them to reflect on what they've learned."}, {"time": 3766, "text": "Like, what was the big idea you learned today?"}, {"time": 3769, "text": "Or what did you find difficult?"}, {"time": 3771, "text": "What did you struggle with?"}, {"time": 3773, "text": "What was something that was exciting?"}, {"time": 3778, "text": "Then kids go home and they have to kind of reflect in a deeper way."}, {"time": 3782, "text": "A lot of times, I don't know if you had this experience as a math student, lots of people do."}, {"time": 3786, "text": "Kids are going through math questions, they're successful, they get them right, but they don't even really know what they're about."}, {"time": 3793, "text": "And a lot of kids go through many years of maths like that, doing lots of questions, but that really knowing what even the topic is or what it's about, what it's important for."}, {"time": 3804, "text": "So having students go back and think at the end of a day, what was the big idea from this maths lesson?"}, {"time": 3811, "text": "Why is it important?"}, {"time": 3813, "text": "Where would I find that in real life?"}, {"time": 3816, "text": "Those are really good questions for kids to be thinking about."}, {"time": 3819, "text": "It's probably for everybody to be thinking about."}, {"time": 3822, "text": "I think most of us go through life never asking the bigger question, always those layers of why questions that kids ask when they're very young."}, {"time": 3834, "text": "We need to keep doing that."}, {"time": 3835, "text": "Like whatever the term is, you call first principles thinking, some people call it that, which is like, why are we doing it this way?"}, {"time": 3848, "text": "So one nice thing is to do that because there's usually a good answer."}, {"time": 3853, "text": "The reason we did it this way is because it works for this reason."}, {"time": 3857, "text": "But then if you want to do something totally novel, you'll say, well, we've been doing it this way because of historical reasons, but really this is not the best way to do it."}, {"time": 3870, "text": "There might be other ways."}, {"time": 3872, "text": "And that's how invention happens."}, {"time": 3874, "text": "And then you get, that's really useful in every aspect of life, like choosing your career, choosing your, I don't know, where you live, who your romantic partner is, like everything."}, {"time": 3887, "text": "Everything, yeah."}, {"time": 3888, "text": "And I think it probably starts doing that in math class."}, {"time": 3894, "text": "That would be good if we started doing that."}, {"time": 3896, "text": "I mean, I wonder, I probably didn't do very much of that for most of my education, asking why, except for later, much later in the subjects on grad school when you're doing research on them."}, {"time": 3912, "text": "When you're first tasked with doing something novel using this or solving a problem really outside the classroom, they have to publish on it."}, {"time": 3920, "text": "It's the first time you think, wait, why are these things interesting, useful?"}, {"time": 3927, "text": "Which are the things that are useful?"}, {"time": 3929, "text": "And yeah, I guess that would be nice if we did that much earlier, the quest of invention."}, {"time": 3935, "text": "Yeah, yeah, I mean, one of the sad pieces of research data I think about is the questions kids ask in school goes down like in a linear progression from, in the early years, you can't stop kids asking those questions, but they learn not to ask the questions."}, {"time": 3956, "text": "I think you told somewhere about an early memory you had in your own education where you asked the question, or maybe that was an example you gave, but it was shut down."}, {"time": 3968, "text": "You've listened to something I said, yeah."}, {"time": 3972, "text": "I don't remember where it was, but it caught me."}, {"time": 3975, "text": "Yeah, I remember it really vividly."}, {"time": 3977, "text": "Or can you tell the memory?"}, {"time": 3979, "text": "Yeah, I was, it's funny, I can remember."}, {"time": 3981, "text": "It must've really impacted me in that moment because you know how there's lots of hours of school you don't remember at all, but anyway, I can remember where I was sitting and everything."}, {"time": 3990, "text": "I was in a high school maths class, although they don't call it that in England, and the teacher said, and it was like the first class of this teacher's class, and he said, ask if you have any questions."}, {"time": 4004, "text": "So at one point I put my hand up and I said, I have a question, and he said something like, that's your question?"}, {"time": 4013, "text": "And I was like, oh, okay, I'm not asking any more questions in this class."}, {"time": 4017, "text": "And that hit hard in a way where you didn't wanna, the lesson you learn from that is I'm not gonna ask."}, {"time": 4022, "text": "Yeah, that was absolutely the last question I'm asking."}, {"time": 4026, "text": "And that was, yeah, he was the chair of the maths department."}, {"time": 4032, "text": "I remember that really well."}, {"time": 4033, "text": "So maybe because of that experience, one of the things we encourage when we teach kids is asking questions, and we value it when they ask questions and we put them up on walls and celebrate."}, {"time": 4047, "text": "It's funny because I wish there was a feedback signal because he probably, to put a positive spin on it, he probably didn't realize the negative impact he's had in that moment, right?"}, {"time": 4058, "text": "If he only knew, see, this is probably when you're more mature in grad school."}, {"time": 4064, "text": "I had an amazing professor named Ali Shakafande in computer science, and he would get, he would encourage questions, but then he would tell everybody how dumb their questions are."}, {"time": 4074, "text": "But it was done, I guess if you show, if you say it with love and respect behind it, then it's more like a friendly, humorous encouragement for more questions."}, {"time": 4085, "text": "Yeah, it's an art, right, to do it, to write."}, {"time": 4087, "text": "And then you have to time it right because that kind of humor is probably better for when you're in grad school versus when you're in the early education."}, {"time": 4098, "text": "Well, and I guess kids or young people get whether somebody's doing it to be funny or, you know, I mean, this is why teaching is so hard."}, {"time": 4111, "text": "Even your tone can be impactful."}, {"time": 4115, "text": "It's so sad because for that particular human, the teacher, you just had a bad day, and one statement can have a profound negative impact."}, {"time": 4125, "text": "I know, sadly, that there's a lot of maths teachers who have that kind of approach, and I think they're suffering from the fact that they think people are math people, not math people, and that comes across in their teaching."}, {"time": 4141, "text": "But on the flip side, one positive statement."}, {"time": 4144, "text": "Keep them going."}, {"time": 4145, "text": "That is the flip side of that."}, {"time": 4147, "text": "And I myself had one teacher who was really amazing for me in maths, and she kept me in the subject."}, {"time": 4154, "text": "I probably wouldn't have left it."}, {"time": 4156, "text": "Who was she?"}, {"time": 4157, "text": "She was, her name was Mrs. Marshall."}, {"time": 4160, "text": "And she was my A level maths teacher."}, {"time": 4167, "text": "So I was in England."}, {"time": 4170, "text": "You do lots of subjects till you're 16, and then you choose like three or four subjects."}, {"time": 4175, "text": "So I had chosen maths, and you go to higher levels, probably equivalent more to a master's degree in the US because you're more specialized."}, {"time": 4186, "text": "But anyways, she was my teacher, and for the first time in my whole career in maths, she would give us problems and tell us to talk about them with each other."}, {"time": 4198, "text": "And so here I was sitting there at like 17, talking with friends about how to solve a math problem, and that was it."}, {"time": 4204, "text": "That was the change that she made, but it was profound for me because like those calculus students, I started to hear other people's ways of thinking and seeing it, and we would talk together and come up with solutions."}, {"time": 4219, "text": "And I was like, that was it."}, {"time": 4220, "text": "That changed maths for me."}, {"time": 4223, "text": "It wasn't some kind of personal interaction with her."}, {"time": 4225, "text": "It was more like she was the catalyst for that collaborative experience."}, {"time": 4232, "text": "I mean, yeah, the many ways teachers can inspire kids."}, {"time": 4234, "text": "I mean, sometimes it's a personal message, but it can be your teaching approach that changes maths for kids."}, {"time": 4242, "text": "You know, Cal Newport, he wrote a book called Deep Work, and he's a mathematician, a theoretical computer scientist, and he talks about the kind of the focus required to do that kind of work."}, {"time": 4258, "text": "Is there something you can comment on?"}, {"time": 4261, "text": "You know, we live in a world full of distractions."}, {"time": 4264, "text": "That seems like one of the elements that makes studying, and especially the studying of subjects that require thinking like maths does, difficult."}, {"time": 4274, "text": "Is there something from a student perspective, from a teacher perspective that encourages deep work that you can comment on?"}, {"time": 4281, "text": "Yeah, I think giving kids really inspiring deep problems, and we have some on our website, is a really important experience for them."}, {"time": 4295, "text": "Even if they only do it occasionally, but it's really important."}, {"time": 4300, "text": "They actually realise, I do, I give a problem out often when I'm working with teachers, and I say to them, all right, I'm gonna check in with you after an hour."}, {"time": 4309, "text": "And they're like, an hour?"}, {"time": 4311, "text": "They think it's shocking."}, {"time": 4313, "text": "And then they work on this problem, and after an hour, I say, okay, how are we doing?"}, {"time": 4317, "text": "They're like, an hour's gone by?"}, {"time": 4320, "text": "How is this possible?"}, {"time": 4322, "text": "And so everybody needs those like rich deep problems."}, {"time": 4327, "text": "Most kids go through their whole maths experience of however many years, never once working on a problem in that kind of deep way."}, {"time": 4336, "text": "So the undergrad class I teach at Stanford, we do that."}, {"time": 4341, "text": "We work on these deep problems every session."}, {"time": 4345, "text": "And the students come away going, okay, I never wanna go back to that maths relationship I had where it was just all about quick answers."}, {"time": 4352, "text": "I just don't wanna go back to that."}, {"time": 4354, "text": "And so we can all, all teachers can incorporate those problems in their classrooms."}, {"time": 4361, "text": "Maybe they don't do them every day, but they at least give kids some experience of being able to work slowly and deeply and to go to deeper places and not be told they've got five minutes to finish 20 questions."}, {"time": 4378, "text": "Well, part of it is also just the exercise of sitting there and maintaining focus for prolonged periods of time."}, {"time": 4387, "text": "That's not often, I mean, that's a skill."}, {"time": 4391, "text": "It's a skill that also could be discouraging."}, {"time": 4396, "text": "Like if you don't practice it, just sitting down for 10 minutes straight and maintaining deep focus could be exceptionally challenging."}, {"time": 4403, "text": "Like if you're really thinking about a problem and I think it's really important to realize that that's a skill that you can just like a muscle, you can build, you can start with five minutes and goes to 10 minutes to 30 and to an hour."}, {"time": 4416, "text": "And to be successful, I think in certain subjects like mathematics, you wanna be able to develop that skill."}, {"time": 4422, "text": "Otherwise you're not going to get to the really rewarding experience of solving these problems."}, {"time": 4433, "text": "There was a survey done of kids in school where they were asked, how long will you work on a maths problem before you give up and decide it's not possible to solve it?"}, {"time": 4442, "text": "And the result on average across the kids was two minutes."}, {"time": 4450, "text": "Yeah, that's a bad sign, but that was a powerful sign that they need to learn to not give up so quickly."}, {"time": 4459, "text": "Yeah, we mentioned offline because we've been talking so much about visualization, Grant Sanderson, Three Blue One Brown."}, {"time": 4469, "text": "So he's inspired millions of people with exactly the kind of way of thinking that you've been talking about."}, {"time": 4476, "text": "Yeah, I love his work."}, {"time": 4478, "text": "Converting sort of mathematical concepts into visual, like visually representing them, exploring them in ways that help you illuminate like the concepts."}, {"time": 4493, "text": "What do you think is the role of that?"}, {"time": 4495, "text": "So he uses mostly programmatic visualization."}, {"time": 4498, "text": "So it's the thing I mentioned where there's like animations created by writing computer programs."}, {"time": 4505, "text": "Like what do you think, how scalable is that approach?"}, {"time": 4508, "text": "But in general, what do you think about his approach?"}, {"time": 4510, "text": "I think it's amazing."}, {"time": 4511, "text": "I should work with him."}, {"time": 4514, "text": "I can share some of our visuals and he can make them in that amazing way."}, {"time": 4520, "text": "So part of his storytelling, part of it is creating the visuals and then weaving a story with those visuals that kind of builds, like there's also, I mean, there's also drama in it."}, {"time": 4534, "text": "You start with a small example and then you kind of, all of a sudden there's a surprise."}, {"time": 4541, "text": "And it really, I mean, it makes you fall in love with the concept."}, {"time": 4545, "text": "He does talk about that."}, {"time": 4548, "text": "His sense is like some of the stuff, he doesn't feel like he's teaching like the core curriculum, which is something, he sees himself as an inspirational figure."}, {"time": 4563, "text": "But because I think it's too difficult to kind of convert all of the curriculum into those elements."}, {"time": 4569, "text": "And probably you don't need to."}, {"time": 4571, "text": "I mean, if people get to experience mathematical ideas in the way that he shares them, that will change them."}, {"time": 4580, "text": "And it will change the way they think."}, {"time": 4581, "text": "And maybe they could go on to take some other mathematical idea and make it that beautiful."}, {"time": 4586, "text": "Well, he does that."}, {"time": 4588, "text": "He created a library called Manim and he open sourced it."}, {"time": 4592, "text": "And that library is the, people should check it out."}, {"time": 4596, "text": "It's written in Python and it uses some of those same elements."}, {"time": 4601, "text": "Like it allows you to animate equations and animate little shapes."}, {"time": 4605, "text": "Like people that, you know, he has a very distinct style in his videos and what that resulted in, even though from a software engineer perspective, the code he released is not like super well documented or perfect, but him releasing that, now there's all of these people educating it."}, {"time": 4625, "text": "And the cool, to me personally, the coolest thing is to see like people they're not, you know, don't have like a million subscribers or something is they have just a few views in the video, but it just seems like the process of them creating a video where they teach is like transformative to them from a student perspective."}, {"time": 4647, "text": "It's the old Feynman thing, the best way to learn is to teach."}, {"time": 4650, "text": "And then him releasing that into the wild is, it shows that that impact."}, {"time": 4657, "text": "I think just giving people that idea that you can do that with maths and other subjects, there's bound to be people all around who can create more, which is cool."}, {"time": 4669, "text": "So I recommend that people do like JavaScript or Python."}, {"time": 4672, "text": "You can build like visualizations of most concepts in high school math."}, {"time": 4677, "text": "You can do a lot of kinds of visualizations and doing that yourself."}, {"time": 4681, "text": "Plus, if you do that yourself, people will really love it."}, {"time": 4684, "text": "People actually, people love visualizations of math."}, {"time": 4689, "text": "Cause they, I mean, it's something in us that loves patterns, loves figuring out difficult things and the patterns in there then are unexpected in some way."}, {"time": 4699, "text": "Have you ever noticed that hotels are always filled with patterns?"}, {"time": 4704, "text": "I was just noticing at the hotel I'm in now, all of their carpets are pattern carpets and then they have patterns on the walls."}, {"time": 4713, "text": "We humans love the symmetry and patterns, the breaking of symmetry and patterns."}, {"time": 4719, "text": "And then it's funny that we don't see mathematics as somehow intricately connected to that, but it is, right?"}, {"time": 4725, "text": "I mean, that's one of the perspectives that I love students to take is to be a pattern seeker."}, {"time": 4731, "text": "In, yeah, certainly in all of maths."}, {"time": 4733, "text": "I mean, you can think of all of maths as a kind of subject of patterns and not just visual patterns, but, you know, when you think about multiplying by five and the fact you can, you know, if you're multiplying 18 times five, you can instead think of nine times 10."}, {"time": 4754, "text": "That's a pattern that always works in mathematics."}, {"time": 4757, "text": "You can halve a number and double a number."}, {"time": 4759, "text": "And so, yeah, I just think there are patterns everywhere."}, {"time": 4761, "text": "And if kids are thinking their role is to see patterns and find patterns, it's really exciting."}, {"time": 4768, "text": "What do you think about like MIT OpenCourseWare and the release of lectures by universities?"}, {"time": 4776, "text": "I think it's good."}, {"time": 4778, "text": "I think that is what started the MOOC I did was using that platform."}, {"time": 4786, "text": "So you ultimately think like the Udacity models is a little bit more effective than just a plain two hour lecture."}, {"time": 4792, "text": "I think there's definitely, you can bring in good pedagogy into online learning."}, {"time": 4797, "text": "And I think the idea of putting things online so that people all over the world can access them is great."}, {"time": 4802, "text": "I don't think the initial excitement around MOOCs sort of democratizing education and make it more equal came about because they found that the people taking MOOCs tended to be the more privileged people."}, {"time": 4817, "text": "So that was, I think there's still something to be found in that there's still more to be done to help that online learning reach those principles."}, {"time": 4827, "text": "But definitely, I think it's a good invention."}, {"time": 4831, "text": "And I have an online class that's for kids, that's a little free class that gives them."}, {"time": 4836, "text": "What's the topic?"}, {"time": 4837, "text": "It's called How to Learn Maths."}, {"time": 4839, "text": "How to Learn Maths."}, {"time": 4841, "text": "It shows maths as this visual creative subject and it shares mindset and some brain science and kids who take it do better in maths class."}, {"time": 4851, "text": "We've studied it with like randomized controlled trials and given it to middle school kids and other middle school kids who don't take it but are taught by the same teachers."}, {"time": 4861, "text": "So their teachers are the same."}, {"time": 4862, "text": "And the kids who take the online class end up 68% more engaged in their maths class and do better at the end of the year."}, {"time": 4870, "text": "So that's a little six session, 15 minute class and it changes kids maths relationships."}, {"time": 4878, "text": "So it is true that we can do that with some words that aren't, it's not a huge change to the education system."}, {"time": 4890, "text": "Do you have advice for young people?"}, {"time": 4893, "text": "We've been talking about mathematics quite a bit but in terms of their journey through education, through their career choices, through life, maybe middle school, high school, undergrad students, of how to live a life they can be proud of?"}, {"time": 4910, "text": "I think if I were to give advice to people, especially young people, my advice would be to always, it sounds really corny, but always believe in yourself and know that you can achieve because although that sounds like obvious, of course we want kids to know that they can achieve things."}, {"time": 4930, "text": "I know that millions of kids who are in the school system have been given the message, they cannot do things."}, {"time": 4937, "text": "And adults too, they have the idea, oh, I did okay in this, I went into this job because those other things I could never have done okay in."}, {"time": 4946, "text": "So actually when they hear, hey, maybe you could do those other things."}, {"time": 4951, "text": "Even adults think, maybe I can."}, {"time": 4954, "text": "And they go back and they encounter this knowledge and they relearn things and they change careers and amazing things happen."}, {"time": 4962, "text": "So for me, I think that message is really important."}, {"time": 4965, "text": "You can learn anything."}, {"time": 4967, "text": "Scientists try and find a limit."}, {"time": 4970, "text": "They're always trying to find a limit, like how much can you really learn?"}, {"time": 4972, "text": "What's the limit to how much you can learn?"}, {"time": 4974, "text": "And they always come away not being able to find it."}, {"time": 4976, "text": "People can just go further and further and further."}, {"time": 4979, "text": "And that is true of people born with brain, areas of their brain that aren't functioning well that have what we call special needs."}, {"time": 4988, "text": "Some of those people also go on to develop and do amazing things."}, {"time": 4992, "text": "So I think that really experiencing that, knowing that feeling, not just saying it, but knowing it deeply, you can learn anything is something I wish all people would have."}, {"time": 5008, "text": "Actually also applies when you've achieved some level of success too."}, {"time": 5012, "text": "What I find, like in my life with people that love me, when you achieve success, they keep celebrating your success and they want you to keep doing the thing that you were successful at, as opposed to believing in that you can do something else, something big, whatever your heart says to do."}, {"time": 5031, "text": "And one of the things that I realized the value of this, quite recently, which is sad to say, is how important it is to seek out, when you're younger, to seek out mentors, to seek out the people, surround yourself with people that will believe in you."}, {"time": 5050, "text": "It's like a little bit is on you."}, {"time": 5054, "text": "It's like, you don't get that sometimes if you go to grad school, you think you kind of land on a mentor, maybe you pick a mentor based on the topic they're interested in."}, {"time": 5065, "text": "But the reality is the people you surround yourself with, they're going to define your life trajectory."}, {"time": 5072, "text": "So select people that believe in you."}, {"time": 5075, "text": "And get away from people who don't believe in you."}, {"time": 5078, "text": "Sometimes parents can be that, they can love you deeply, but they set, it's the math thing we mentioned, they might set certain constraints on the beliefs that you have."}, {"time": 5090, "text": "And so in that, if you're interested in mathematics, and your parents are not that interested in it, don't listen to your parents on that one dimension."}, {"time": 5100, "text": "Yeah, and if people tell you you can't do things, you have to hear from other people who believe in you."}, {"time": 5106, "text": "I think you're absolutely right about that."}, {"time": 5109, "text": "So sad the number of people who've had those negative messages from parents."}, {"time": 5114, "text": "In my Limitless Mind book, I interviewed quite a few people who'd been told they couldn't do math, sometimes by parents, sometimes by teachers."}, {"time": 5121, "text": "And fortunately, they had got other ideas at some point in their life, and realized there was this whole world of mathematical thinking that was open to them."}, {"time": 5132, "text": "So it's really important that people do connect with people who believe in them, however hard that might be to find those people."}, {"time": 5141, "text": "What do you hope the education system, education in general, looks like 10, 20, 50, 100 years from now?"}, {"time": 5149, "text": "Are you optimistic about this future?"}, {"time": 5151, "text": "Yeah, I definitely have hope."}, {"time": 5153, "text": "There is, change can happen in the education system."}, {"time": 5156, "text": "In recent years, it's been microscopically slow."}, {"time": 5163, "text": "But I do actually see change happening."}, {"time": 5167, "text": "We were talking earlier that data science is now a course you can take in high school instead of algebra two."}, {"time": 5174, "text": "And that's pretty amazing because that content was set out in 1892 and hasn't changed since then."}, {"time": 5182, "text": "And so now we're actually seeing a change in the content of high school."}]}]