[{"title": "Eric Weinstein: Difficult Conversations, Freedom of Speech, and Physics | Lex Fridman Podcast #163", "id": "ifX_JnBfxTY", "quotes": [{"time": 426, "text": "It's very hard to think about more than one temporal dimension."}, {"time": 430, "text": "So that's a really strong mental exercise of breaking the framework in which we think because most of the frameworks would have a single temporal dimension, right?"}, {"time": 440, "text": "Well, first of all, most of the frameworks in which we think would have no temporal dimension would have pure, like in mathematics, the differential geometry that Riemann came up with in the 1800s."}, {"time": 452, "text": "We don't usually talk about what we would call split signature metrics or Lorentzian signature."}, {"time": 459, "text": "In fact, if it weren't for relativity, this would be the most obscure topic out there."}, {"time": 465, "text": "Almost all the work we do is in Euclidean signature and then there's this one freakish case of relativity theory in physics that uses this one time and the rest spatial dimensions."}, {"time": 477, "text": "So it's usually momentary and just looking at space."}, {"time": 481, "text": "Yes, we have these three kinds of equations that are very important to us."}, {"time": 486, "text": "We have elliptic, hyperbolic and parabolic, right?"}, {"time": 491, "text": "And so the idea is if I'm chewing gum after eating garlic bread, when I open my mouth and I've got chewing gum between my lips, maybe it's gonna form an elliptic object called a minimal surface."}, {"time": 509, "text": "Then when I pop that and blow through it, you're gonna hear a noise that's gonna travel to you by a wave equation, which is gonna be hyperbolic."}, {"time": 516, "text": "But then the garlic breath is gonna diffuse towards you and you're eventually gonna be very upset with me according to a heat equation, which will be parabolic."}, {"time": 524, "text": "So those are the three basic paradigms for most of the work that we do."}, {"time": 528, "text": "And a lot of the work that we do in mathematics is elliptic, whereas the physicists are in the hyperbolic case."}, {"time": 534, "text": "And I don't even know what to do about more than one temporal dimension because I think almost no one studies that."}, {"time": 539, "text": "I can't believe you just captured much of modern physics in the example of chewing gum."}, {"time": 545, "text": "Well, I have an off color one, which I chose not to share, but hopefully the kids at home can imagine."}, {"time": 551, "text": "Okay, so, okay, that is the place where we come from."}, {"time": 556, "text": "Now, if we want to arrive at a possibility of breaking the frameworks with two versus zero temporal dimensions, how do we even begin to think about that?"}, {"time": 567, "text": "Well, let's think about it as you and I getting together in New York City, okay?"}, {"time": 571, "text": "So if you tell me, Eric, I wanna meet you in New York City, go to the corner of, I don't know, 34th Street and Third Avenue, and you'll find a building on the Northwest corner and go up to the 17th floor, right?"}, {"time": 588, "text": "So when we have Third Avenue, that's one coordinate, 34th Street, that's the second coordinate, and go up to the 17th."}, {"time": 595, "text": "And what time is it?"}, {"time": 596, "text": "Oh, 12 noon."}, {"time": 598, "text": "All right, well, now imagine that we traded the ability to get up to a particular height in a building and it's all flat land, but I'm gonna give you two temporal coordinates."}, {"time": 607, "text": "So meet me at 5 p.m. and 12 noon at the corner of 34th and Third."}, {"time": 613, "text": "That gets to be too mind blowing."}, {"time": 615, "text": "I've got two separate watches."}, {"time": 617, "text": "And presumably that's just specifying a single point in those two different dimensions, but then being able to travel along those dimensions."}, {"time": 625, "text": "Let me see your right hand."}, {"time": 628, "text": "You have no watch on that."}, {"time": 631, "text": "Okay, I'm very concerned, Lex, that you're going through life without a wristwatch."}, {"time": 636, "text": "That is my favorite and most valued wristwatch."}, {"time": 639, "text": "I want you to wear it."}, {"time": 640, "text": "This guy is funnier than basically any human on Earth."}, {"time": 645, "text": "Lex, that has been in my family for months."}, {"time": 649, "text": "It's a Fitbit."}, {"time": 651, "text": "Now, what I want you to understand is Lex Fridman is now in a position to live in two spatial and two temporal dimensions unlike the rest of us."}, {"time": 660, "text": "I clearly am only fit for four spatial dimensions."}, {"time": 664, "text": "So I'm frozen, whereas you can double move."}, {"time": 667, "text": "I can double move, which is funny because this is set in Austin time."}, {"time": 672, "text": "So it's 4 p.m. and this is set in Los Angeles time."}, {"time": 676, "text": "Well, but that's just with an affine shift in mod 12."}, {"time": 678, "text": "But my point is, wouldn't that be interesting if there were two separate time scales and you had to coordinate both of those, but you didn't have to worry about what floor of the building because everything was on the ground floor."}, {"time": 690, "text": "That is the confusion that we're having."}, {"time": 693, "text": "And if you do one more show, right, then they're gonna put a watch on your ankle and you're only gonna have one spatial dimension that you can move around."}, {"time": 701, "text": "But my claim is that all of these are actually sectors of my theory in case we're interested in that, which is geometric unity."}, {"time": 710, "text": "There is a two, two sector and a three, one and a one, three and a zero, four and a four, zero."}, {"time": 715, "text": "And all of these sectors have some physical reality."}, {"time": 718, "text": "We happen to live in a one, three sector."}, {"time": 721, "text": "But that's the kind of thinking that we don't do."}, {"time": 724, "text": "When I say we have to get off this planet, people imagine, oh, okay, it's just Einstein plus some ability to break the law."}, {"time": 730, "text": "By the way, even though you did this for humor's sake, I perhaps am tempted to pull a Putin who."}, {"time": 739, "text": "Am I gonna get whacked?"}, {"time": 740, "text": "No, not quite."}, {"time": 743, "text": "But he was given a Super Bowl ring to look at and he, instead of just looking at it, put it on his finger and walked away with it."}, {"time": 752, "text": "Rubbercraft?"}, {"time": 753, "text": "Rubbercraft, that's right."}, {"time": 754, "text": "So in the same way, I will, if you don't mind, walk away with this Fitbit and taking the entirety of your life story with it because there's all these steps on it."}, {"time": 763, "text": "Boy, have you lost a lot of weight."}, {"time": 765, "text": "And where have I been?"}, {"time": 770, "text": "Right, that's what we're talking about."}, {"time": 772, "text": "We're talking about, you wanna get into aliens, let's have an interesting alien conversation."}, {"time": 775, "text": "Let's stop having the typical free will conversation, the typical alien conversation, the typical AGI morality conversation."}, {"time": 782, "text": "It's like, we have to recognize that we're amusing ourselves because we're not making progress."}, {"time": 787, "text": "Time to have better versions of all these conversations."}, {"time": 790, "text": "Is there some version of the alien conversation that could incorporate the breaking of frameworks?"}, {"time": 796, "text": "I mean, the key question would be, we've had the Pentagon release multiple videos of strange UFOs that undermined a lot of us."}, {"time": 805, "text": "I just think it's also really fascinating to talk about the fact that those of us who were trained to call BS on all of this stuff just had the rug pulled out from under us by the Pentagon choosing to do this."}, {"time": 816, "text": "And you know what the effect of that is?"}, {"time": 818, "text": "You've opened the door for every stupid theory known to man."}, {"time": 824, "text": "My aunt saw a ghost."}, {"time": 826, "text": "Okay, now we're gonna have to listen to, well, hey, the Pentagon used to deny it."}, {"time": 831, "text": "Then it turned out there were UFOs, dude."}, {"time": 833, "text": "Whoever is in charge of lying to the public, they need a cost function that incorporates the damage and trust because I held this line that this was all garbage and all BS."}, {"time": 847, "text": "Now I don't know what to think."}, {"time": 885, "text": "And so what am I supposed to think about these videos?"}, {"time": 888, "text": "Is it a complete distraction?"}, {"time": 891, "text": "Is it a kind of cosmic joke?"}, {"time": 893, "text": "I don't know, but you know what?"}, {"time": 894, "text": "I'm tired of these people, just completely tired of these people."}, {"time": 897, "text": "The people on the Pentagon side or the people who are interpreting this stuff on the Pentagon side?"}, {"time": 901, "text": "I'm tired of the authorities playing games with what we can know."}, {"time": 908, "text": "The fact that you and I don't, do you have a security clearance?"}, {"time": 911, "text": "Some level of it for, because I was funded for DARPA for a while."}, {"time": 915, "text": "I don't have a security clearance."}, {"time": 917, "text": "You know, I am going to release whatever theory I have."}, {"time": 921, "text": "And my guess is that there is zero interest from our own government."}, {"time": 926, "text": "And so the Chinese will find out about it at the same time, our government does, because Lord knows what they do in these buildings."}, {"time": 933, "text": "I watch crazy people walk in and out of the intelligence community, walk in and out of DARPA."}, {"time": 939, "text": "And I think, wow, you're talking to that person?"}, {"time": 943, "text": "That's really fascinating to me."}, {"time": 945, "text": "We don't seem to have a clue as to who might have the ball."}, {"time": 948, "text": "Complete lack of transparency."}, {"time": 950, "text": "Do you think it's possible there's, the government is in possession of something deeply fundamental to our understanding of the world that they're not releasing?"}, {"time": 960, "text": "So this is one of the things is, this is one of the famous distractions that people play with, the narrative."}, {"time": 966, "text": "Assume that that were true."}, {"time": 968, "text": "Of alien life forms and spacecraft in possession, that the government is in possession of alien spacecraft."}, {"time": 975, "text": "Assume that were true."}, {"time": 977, "text": "I don't think the government really exists at the moment."}, {"time": 981, "text": "I believe, and this is not an idea that was original to me."}, {"time": 984, "text": "There was a guy named Michael Teitelbaum who used to be at the Sloan Foundation."}, {"time": 988, "text": "And at some point I pointed out that the US government had completely contradictory objectives when it came to the military and science."}, {"time": 996, "text": "And one branch said this, one branch said that."}, {"time": 998, "text": "I said, I don't understand which is true."}, {"time": 1000, "text": "What does the government want?"}, {"time": 1001, "text": "He said, do you think there's a government?"}, {"time": 1003, "text": "And I said, what do you mean?"}, {"time": 1005, "text": "He said, what makes you think that the people in those two offices have ever coordinated?"}, {"time": 1011, "text": "What is it that allows each office to have a coherent plan with respect to every other office?"}, {"time": 1017, "text": "And that's when I first started to understand that there are periods where the government coheres, and then there are periods where the coherence just decays."}, {"time": 1024, "text": "And I think that that's been going on since 1945."}, {"time": 1027, "text": "That there have been a few places where there's been increased coherence, but in general everything is just getting less and less coherent."}, {"time": 1033, "text": "And that what war did was focus us on the need to have a government of people, a mission, capacity, technology, commitment, ideology."}, {"time": 1043, "text": "And then as soon as that was gone, different people, those who'd been through World War II had one set of beliefs, those born in the 1950s or late 40s by the time they got to Woodstock, they didn't buy any of that."}, {"time": 1059, "text": "So coherence is the complete opposite of bureaucracy being paralyzed by bureaucracy."}, {"time": 1068, "text": "So coherence is efficient, functional government."}, {"time": 1072, "text": "Because when you say there's no government, meaning there's no emergent function from a collection of individuals."}, {"time": 1080, "text": "It's just a bunch of individuals stuck in their offices without any kind of efficient communication with each other on a single mission."}, {"time": 1087, "text": "And so a government that is truly at the epitome of what a government is supposed to be is when a bunch of people working together."}, {"time": 1096, "text": "What are we about?"}, {"time": 1097, "text": "Are we about freedom?"}, {"time": 1097, "text": "Are we about growth?"}, {"time": 1099, "text": "Are we about decency and fairness?"}, {"time": 1102, "text": "Are we about the absence of a national culture so that we can all just do our own thing?"}, {"time": 1106, "text": "I've called this thing the USA and the United States have absolutely nothing."}, {"time": 1111, "text": "These are all different visions for our country."}, {"time": 1115, "text": "So it's possible that there's a alien spacecraft somewhere and there's like 20 people that know about it."}, {"time": 1122, "text": "And then they're kind of like, as you communicate further and further into the offices, that information dissipates, it gets distorted in some kind of way."}, {"time": 1130, "text": "And then it's completely lost the power, the possibility of that information is lost."}, {"time": 1135, "text": "We bought a house and I had this idea that I wanted to find out what all the switches did."}, {"time": 1140, "text": "And I quickly found out that your house doesn't keep updating its plans."}, {"time": 1145, "text": "As people do modifications, they just do the modifications and they don't actually record why they were doing what they were doing or what things lead to."}, {"time": 1152, "text": "So there are all sorts of bizarre, like there's a switch in my house that says privacy."}, {"time": 1157, "text": "I don't know what privacy is."}, {"time": 1160, "text": "Does it turn on an electromagnetic field?"}, {"time": 1162, "text": "Does some lead shielding go over the house?"}, {"time": 1167, "text": "That's what we have."}, {"time": 1168, "text": "We have a system in which the people who've inherited these structures have no idea why their grandparents built them."}, {"time": 1174, "text": "I'd be funny if there's a freedom of speech switch that you could also control."}, {"time": 1178, "text": "And there'd be a perfect metaphor."}, {"time": 1179, "text": "Well, that's different because what they figured out is, is that if they can just make sure that we don't have any public options for communication, then hey, everything that we say to each other goes through a private company, private companies can do whatever they want."}, {"time": 1195, "text": "And this is like one of the greatest moves that we didn't really notice."}, {"time": 1200, "text": "Electronic and digital speech makes every other kind of speech irrelevant."}, {"time": 1204, "text": "And because there is no public option, guess what?"}, {"time": 1208, "text": "There's always somebody named Sundar or Jack or Mark who controls whether or not you can speak and what it appears to be that is being said and whose stuff is weighted more highly than others."}, {"time": 1220, "text": "It's an absolute nightmare."}, {"time": 1222, "text": "And by the way, the Silicon Valley intellectual elite, Lord knows what is going on."}, {"time": 1228, "text": "People are so busy making money that they are not actually upholding any of the values."}, {"time": 1234, "text": "So Silicon Valley is sort of maximally against, it has this kind of libertarian, free, progressive sheen to it when it goes to Burning Man."}, {"time": 1244, "text": "And then it quickly just imposes rules on all of the rest of us as to what we could say to each other if we're not part of the inner elite."}, {"time": 1251, "text": "So what do you think the ideal of the freedom of speech means?"}, {"time": 1255, "text": "Well, this is very interesting."}, {"time": 1257, "text": "I keep getting lectured on social media by people who have no idea how much power the Supreme Court has to abstract things."}, {"time": 1264, "text": "Right now, you have the concept of the letter of the law and the spirit of the law."}, {"time": 1269, "text": "And the spirit of the law would have to say that our speech that matters is free, at least at the level of ideas."}, {"time": 1276, "text": "I don't claim that I have the right to endanger your life with speech or to reveal your private information."}, {"time": 1282, "text": "So I really am not opining about directed speech intended to smear you."}, {"time": 1287, "text": "And that's a different kettle of fish."}, {"time": 1290, "text": "And maybe I have some rights to do that, but I don't think that they're infinite."}, {"time": 1294, "text": "What I am saying is that the freedom of speech for ideas is essential that the court abstract it and shove it down the throat of Google, Facebook, Twitter, Amazon, whoever these infrastructure companies are because it really matters which abstraction you use."}, {"time": 1316, "text": "The case that I really like is search and seizure."}, {"time": 1319, "text": "If I have private data that I entered in my house that is stored on a server that you hold outside of my house, but I view is the abstraction that it's only the perimeter of my house that I have the right to protect, or does my password extend the perimeter of my house to the data on the server that is located outside of my house?"}, {"time": 1342, "text": "These are choices for the court, and the court is supposed to pretend that they can divine the true intent of the framers."}, {"time": 1350, "text": "But all of the sort of, and I've taken to calling this the problem of internet hyenas, people with readymade answers and LOLs, and you're such a moron."}, {"time": 1359, "text": "These folks love to remind you, it's a private company, dude, it can do whatever it wants."}, {"time": 1364, "text": "No, the court has to figure out what the abstractions are."}, {"time": 1368, "text": "And just the way, for example, the Griswold decision found that there was a penumbra because there was too little in the Constitution, therefore there were all sorts of things implied that couldn't be in the document."}, {"time": 1380, "text": "Somebody needs to come up with the abstraction right now that says Jack cannot do it if he wants."}, {"time": 1389, "text": "It's really, so you say the courts, but it's also us, people who think about the world, it's you."}, {"time": 1396, "text": "It's the courts."}, {"time": 1397, "text": "But the courts don't do this."}, {"time": 1399, "text": "We're toast."}, {"time": 1400, "text": "But we can still think about it."}, {"time": 1402, "text": "I mean, I'll... Sure, but I don't feel like going down the drain."}, {"time": 1405, "text": "Here's what I'm thinking about, because it's tricky how far it should extend."}, {"time": 1409, "text": "I mean, that's an ongoing conversation."}, {"time": 1411, "text": "Don't you think the interpretation of the law..."}, {"time": 1414, "text": "I think I'm trying to say something very simple, and it's just not gonna be popular for a while."}, {"time": 1421, "text": "Tech dwarfs previous forms of communication."}, {"time": 1426, "text": "Print or shouting in a public park."}, {"time": 1428, "text": "And so I can go to a public park and I can shout if I get a permit."}, {"time": 1433, "text": "Even there, I think it was in the late 1980s in Atlanta, we came up with free speech zones where you can't protest at a convention."}, {"time": 1439, "text": "You bet you can go to a park 23 miles out and they'll fence off a little area where you can have your free speech."}, {"time": 1447, "text": "No, speech is dangerous."}, {"time": 1449, "text": "Ideas are dangerous."}, {"time": 1450, "text": "We are a country about danger and risk."}, {"time": 1453, "text": "And yes, I agree that targeted speech at individuals trying to reveal their private stuff and all that kind of... That is very different."}, {"time": 1461, "text": "So forget a lot of that stuff."}, {"time": 1464, "text": "But free speech for ideas is meant to be dangerous and people will die as a result of free speech."}, {"time": 1471, "text": "The idea that one life is too much is preposterous."}, {"time": 1475, "text": "Like why did we send..."}, {"time": 1476, "text": "If one life is preposterous, why did we send anyone to the beaches of Normandy?"}, {"time": 1479, "text": "I just don't get this."}, {"time": 1481, "text": "So one thing that I was clearly bothered by, and maybe you can be my therapist as well."}, {"time": 1489, "text": "I thought you were mine."}, {"time": 1490, "text": "This is a little bit of a miscommunication on both of our parts then."}, {"time": 1497, "text": "Because who's paying who for this?"}, {"time": 1500, "text": "I was really bothered by Amazon banning Parler from AWS because my assumption was that the infrastructure..."}, {"time": 1511, "text": "I drew a distinction between AWS, the infrastructure on which competing platforms could be created is different than the actual platforms."}, {"time": 1524, "text": "So the standard of the ideal of freedom of speech, I, in my mind, in a shallow way perhaps, applied differently to AWS than I did to Twitter."}, {"time": 1536, "text": "It felt that we've created a more dangerous world, that freedoms were violated by banning Parler from AWS, which I saw as the computing infrastructure which enables the competition of tools, the competition of frameworks of communication."}, {"time": 1554, "text": "What do you think about this?"}, {"time": 1556, "text": "First of all, let me give you the internet hyena answer."}, {"time": 1560, "text": "I don't understand, dude, just build your own Amazon."}, {"time": 1564, "text": "Well, so that's a very shallow statement, but it's also one that has some legitimacy."}, {"time": 1570, "text": "We can't completely dismiss it because there's levels to this game."}, {"time": 1576, "text": "Yes and no, but if you really wanted to chase that down, one of the great things about a person to person conversation as opposed to let's have 30 of our closest friends, whenever we have a conversation with 30 of our closest friends, you know what happens?"}, {"time": 1589, "text": "It's like passing light through a prism."}, {"time": 1591, "text": "Every person says something interesting."}, {"time": 1594, "text": "And as a result, it's always muddled."}, {"time": 1596, "text": "Nothing ever resolves."}, {"time": 1598, "text": "Well, one of my conversational techniques you mentioned, you pushed back is first this childlike naivety and curiosity, but also."}, {"time": 1609, "text": "Real or simulated?"}, {"time": 1610, "text": "Real, I'm afraid."}, {"time": 1611, "text": "I would say 80% real."}, {"time": 1614, "text": "So in this paradigm, how could you not see this coming?"}, {"time": 1618, "text": "I mean, I did a show with Ashley Matthews, who's the woman behind Riley Reid."}, {"time": 1623, "text": "And specifically about this, it was about the idea that if I move away from politics and go towards sex, I know that there's always a move to use the infrastructure to shut down sex workers."}, {"time": 1638, "text": "And in this case, we had Operation Choke Point under the Obama administration."}, {"time": 1644, "text": "We have a positive passion for people who want to solve problems, that they don't like this company, they don't like that company, payday loans would be another one."}, {"time": 1655, "text": "And so you have legal companies that are harassed by our financial system that you can't, as Riley Reid, Ashley couldn't get a Mailchimp account according to her, if I understand her correctly."}, {"time": 1669, "text": "And this idea that you charge these people higher rates because of supposed chargebacks on credit cards, even if their chargebacks are low."}, {"time": 1679, "text": "Yes, we have an unofficial policy of harassment."}, {"time": 1682, "text": "There's something about everybody who shows up at Davos, they get drunk in the Swiss Alps, and then they come back home and they coordinate, and they coordinate things like Build Back Better."}, {"time": 1695, "text": "We don't really understand what Build Back Better is, but my guess is that Build Back Better has to do with extremism in America."}, {"time": 1701, "text": "How do we shut down the Republican Party as the source of extremism?"}, {"time": 1706, "text": "Now, I do think the Republican Party got very extreme under Trump."}, {"time": 1710, "text": "And I do believe that that was responsive to how extreme the Democratic Party got under Clinton first and then Obama and then Hillary."}, {"time": 1722, "text": "And in all of these circumstances, it's amazing how much we want to wield these things as weapons."}, {"time": 1728, "text": "Well, our extremism is fine because we pretend that Antifa doesn't exist and we don't report what goes on in Portland, but your extremism, my God, that's disgusting."}, {"time": 1739, "text": "This is the completely ridiculous place that we're in."}, {"time": 1742, "text": "And by the way, our friends in part are coked up on tech money, and they don't appear to hold the courage of their convictions at a political level because it's not in keeping with shareholder value."}, {"time": 1758, "text": "At some level, shareholder value is the ultimate shield with which everyone can cloak themselves."}, {"time": 1764, "text": "Well, on that point, Donald Trump was banned from Twitter, and I'm not sure it was a good financial decision for Twitter, right?"}, {"time": 1775, "text": "Perhaps you can correct me if I'm wrong."}, {"time": 1777, "text": "Well, are you thinking locally, or are you thinking if Twitter refused to ban Donald Trump, what is the odds that the full force of the antitrust division might find them?"}, {"time": 1788, "text": "Oh, I see, I see."}, {"time": 1789, "text": "So there's a complicated thing."}, {"time": 1791, "text": "Well, look, these guys are all having a discussion in very practical terms."}, {"time": 1796, "text": "You can imagine the sorts of things and imagine the sorts of conversation."}, {"time": 1801, "text": "Jack, Mark, Zunder, we're really glad you're all here."}, {"time": 1803, "text": "We're all trying to sing from the same hymnal and row in the same direction."}, {"time": 1808, "text": "We understand free speech."}, {"time": 1809, "text": "We're completely committed to it, but we have to draw a line with extremism, guys."}, {"time": 1813, "text": "We just need to make sure that we're all on the same page."}, {"time": 1817, "text": "Well, they use the term violence, too, and they, I think, over apply it."}, {"time": 1821, "text": "So basically, anybody..."}, {"time": 1823, "text": "I'm telling you, I say dumb things to incentivize thoughtful conversation."}, {"time": 1834, "text": "Well, whatever these things are, there is no trace."}, {"time": 1838, "text": "Like, how old are you, Lex?"}, {"time": 1839, "text": "You're in your mid 30s?"}, {"time": 1841, "text": "Yeah, to late 40s."}, {"time": 1843, "text": "Mid, late 20s to late 40s, somewhere in there."}, {"time": 1846, "text": "That's the demographic, yes."}, {"time": 1847, "text": "I do think that partially what's happened is that your group has never seen functional institutions."}, {"time": 1852, "text": "These institutions have been so compromised for so long."}, {"time": 1856, "text": "You've probably never seen an adult."}, {"time": 1859, "text": "Sometimes I think Elon looks like an adult."}, {"time": 1862, "text": "I know that he has a wild lifestyle, but I also see it looking like an adult."}, {"time": 1867, "text": "What does an adult look like exactly?"}, {"time": 1869, "text": "Oh, you know, somebody who weighs things, speaks carefully, thinks about the future beyond their own lifespan."}, {"time": 1877, "text": "Somebody who has a pretty good idea of how to get things done, isn't wildly caught up in punitive actions, is more focused on breaking new ground than playing rent seeking games."}, {"time": 1889, "text": "I mean, I really had a positive..."}, {"time": 1891, "text": "I was so completely jazzed when Elon Musk ended up as the world's richest person."}, {"time": 1896, "text": "He was like, well, that's interesting, back to work."}, {"time": 1899, "text": "It's just like, that's what an adult would do."}, {"time": 1903, "text": "And it just made, you know, weirdly, I said something about, isn't it amazing that the world's richest person knows what a Lagrangian is?"}, {"time": 1910, "text": "And he made a terrible Lagrange joke about potentials."}, {"time": 1914, "text": "But yeah, I mean, I do think that ultimately, Elon may be one of the closest things we have to an adult."}, {"time": 1920, "text": "And I can tell you that the internet hyenas will immediately descend as to what a fraudster he is for pumping his stock price, talking his book and all this stuff."}, {"time": 1929, "text": "Just looking at the world seriously and really saying, you're saying that the people who are running tech companies or running the mediums on which we can exercise the ideal of free speech are not adults."}, {"time": 1944, "text": "I think not."}, {"time": 1945, "text": "I think, first of all, a lot of them are Silicon Valley utopian businessmen, where you talk a utopian line and you use it."}, {"time": 1953, "text": "You've heard my take, which is that the idealism of every era is the cover story of its greatest thefts."}, {"time": 1990, "text": "As a result, yes, we have lots of man children wandering around what once was the Bay Area and is now Austin and Miami and other places, maybe Singapore, that all of these people, these are friends of ours and they're brilliant with respect to a certain amount of stuff, but none of them can get off the drip."}, {"time": 2014, "text": "It's amazing that none of them have FU money."}, {"time": 2017, "text": "We've got billionaires who don't have FU money."}, {"time": 2019, "text": "Okay, I think the argument used by Jack Dorsey was that there was an incitement of violence and not just Jack Dorsey, but everybody that was banning people."}, {"time": 2030, "text": "And then this word violence was used as a kind of just like extremism and so on to without much reason behind it."}, {"time": 2039, "text": "You think it's impossible for Jack Dorsey or anybody else to be, as you said, an adult, a grownup and reason."}, {"time": 2046, "text": "Well, Jack is pretty close to being a grownup."}, {"time": 2047, "text": "It seems like he is."}, {"time": 2048, "text": "Yeah, but he's under pressures."}, {"time": 2051, "text": "As you've discussed, it seems that he's been on the verge of almost being quite serious and transparent and real with people."}, {"time": 2059, "text": "I don't know where the Jack Dorsey that I met went."}, {"time": 2063, "text": "And I worry that that must be something behind the scenes that I can't see."}, {"time": 2069, "text": "From my perspective, what I think is the stress, the burden of that when people are screaming at you is overwhelming."}, {"time": 2078, "text": "No, Jack is a Zen monk."}, {"time": 2082, "text": "Jack is an incredibly impressive person intellectually, morally, spiritually, at least for a couple of meetings."}, {"time": 2092, "text": "I don't know him very well, but I'm very impressed by the person I met and I don't know where that person is."}, {"time": 2099, "text": "And that terrifies me."}, {"time": 2102, "text": "But do you think somebody could step up in that way?"}, {"time": 2105, "text": "So does a human being have the capacity to be transparent about the reasoning behind the banning?"}, {"time": 2114, "text": "Or do you think all banning of people from mediums of communication is eventually destructive or it's impossible for human beings to reason with ourselves about it?"}, {"time": 2127, "text": "Well, let's see what the problem is."}, {"time": 2130, "text": "So my phone has been on airplane mode."}, {"time": 2133, "text": "I'm gonna unlock it."}, {"time": 2134, "text": "And I'm gonna take a picture of Lex Fridman."}, {"time": 2138, "text": "Now, if I can, I'm gonna tweet that picture out."}, {"time": 2144, "text": "But here's the weird part about it."}, {"time": 2146, "text": "That picture sitting with Lex today."}, {"time": 2155, "text": "This, ladies and gentlemen, is how the sausage is made."}, {"time": 2159, "text": "In so doing, I have just sent a picture of you and a tiny piece of text all over the planet that has arrived at, if statistics tell the truth, just under half a million different accounts."}, {"time": 2179, "text": "And then more from sharing and so on."}, {"time": 2182, "text": "Well, and then some of those accounts are dead."}, {"time": 2183, "text": "We don't really know how many places it went."}, {"time": 2186, "text": "But the key issue with that tweet is that that is a nonlocal phenomenon."}, {"time": 2194, "text": "So I just broadcasted to an entire planet."}, {"time": 2199, "text": "Somebody in Uganda is reading that at the same time as somebody in Uruguay."}, {"time": 2205, "text": "There is no known solution to have so many people with the ability to communicate nonlocally because locality was part of the implicit nature of speech inside of the constitution."}, {"time": 2219, "text": "Friction, locality, there were all sorts of other aspects to speech."}, {"time": 2224, "text": "So if you think about speech as a bundle."}, {"time": 2228, "text": "I like this."}, {"time": 2230, "text": "Then it got unbundled."}, {"time": 2232, "text": "And some of those aspects that we were naturally counting on to retard the impact of speech aren't present."}, {"time": 2242, "text": "And we don't have the courage to say, I wonder if the first amendment really applies in the modern era in the same way, or we have to work through an abstraction."}, {"time": 2250, "text": "Either we probably have to amend the constitution or we have to abstract it properly."}, {"time": 2255, "text": "And that issue is not something we're facing up to."}, {"time": 2260, "text": "I watch us constantly look backwards."}, {"time": 2266, "text": "We don't seem to try to come up with new ideas and new theories."}, {"time": 2269, "text": "Nobody really imagines that we're going to be able to wisely amend the constitution anymore in the inside of the United States."}, {"time": 2276, "text": "Many people abroad will say, why are these guys talking about the US?"}, {"time": 2279, "text": "It's a US centric program."}, {"time": 2281, "text": "Well, it's because nobody knows where this program lives."}, {"time": 2285, "text": "The fact, by the way, that you and I happen to be in a physical place together is also bizarre."}, {"time": 2290, "text": "It could be anywhere."}, {"time": 2291, "text": "It doesn't really matter that it happens to be here."}, {"time": 2293, "text": "So the difference between logical and between physical, local, nonlocal, frictional, nonfrictional, it's the same thing with firearms."}, {"time": 2301, "text": "Nobody imagined that the Gatling gun was gonna be present when you had to reload a musket."}, {"time": 2309, "text": "And that's fascinating to think about."}, {"time": 2313, "text": "I mean, you're exactly right that the nature of this particular freedom that seems so foundational to this nation, to what made this nation great and perhaps much of the world that is great, made it great, is changing completely."}, {"time": 2329, "text": "Can we try to reason through how the ideal freedom of speech is to be changed?"}, {"time": 2334, "text": "I mean, I guess I'm struggling."}, {"time": 2337, "text": "It feels really wrong, perhaps because I wasn't paying attention to it."}, {"time": 2341, "text": "It feels really wrong to ban Donald Trump from Twitter, to ban not just the president."}, {"time": 2348, "text": "That's really wrong to me."}, {"time": 2350, "text": "But this particular human for being divisive."}, {"time": 2355, "text": "But then when there's an incitement of violence, that is an overused claim."}, {"time": 2363, "text": "But perhaps there was actual brewing of local violence happening."}, {"time": 2371, "text": "So one of the things I know was happening on Parler is people were scheduling meetings together in physical space."}, {"time": 2380, "text": "So you're now going back from this dynamic, social, large scale, people from Uganda, people from all over the world being able to communicate."}, {"time": 2391, "text": "You're now mapping that into now back meeting in the physical space that is similar to what the founding of this nation was."}, {"time": 2398, "text": "The violence would be digital if ransomware suddenly was unleashed."}, {"time": 2405, "text": "The key issue is the abstractions."}, {"time": 2407, "text": "So what was freedom of speech as a bundle?"}, {"time": 2410, "text": "And now it's... And then how do we abstract the bundle into the digital era?"}, {"time": 2416, "text": "Do you think we just need to raise the question and talk about it?"}, {"time": 2419, "text": "Do you have ideas?"}, {"time": 2420, "text": "Well, sure I have ideas."}, {"time": 2421, "text": "But the key point is that I'm not even welcome in mainstream media."}, {"time": 2426, "text": "I've never seen you on mainstream media."}, {"time": 2428, "text": "Do you do mainstream media?"}, {"time": 2429, "text": "So we exist in part of an alternate universe because the mainstream media is trying to have a coherent story, which I've called the gated institutional narrative."}, {"time": 2439, "text": "And the institutions pretend that, they plug their fingers in their ears and pretend that nothing exists outside of MSNBC talking to CNN about what was in the New York Times as covered by the Washington Post."}, {"time": 2452, "text": "And so that's effectively like a professional wrestling promotion where they, you know, the Undertaker faces off against Hulk Hogan and Rowdy Roddy Piper."}, {"time": 2461, "text": "Okay, well, that's very different than MMA."}, {"time": 2465, "text": "You've recently been on Glenn Beck's program."}, {"time": 2469, "text": "And there was this kind of, one of the things you've talked about is being able to have this conversation, I don't know if you would put it as a type of conversation that was happening outside the mainstream media, but a conversation that reaches across different world views."}, {"time": 2488, "text": "Being a nuanced, or just like a respectful conversation that's grounded in mutual."}, {"time": 2495, "text": "But we can't have the reality because the main model is the center, both left and right, is in the process of stealing all the wealth that we built up."}, {"time": 2506, "text": "And they've organized the extremes into two LARPing teams that I've called Magistan and Wokistan."}, {"time": 2513, "text": "And then you have everybody who isn't part of that complex, all seven of us."}, {"time": 2518, "text": "The number of us who are able to earn a living looking at all of these mad people playing this game."}, {"time": 2525, "text": "There's a phrase inside finance when the investment banks are trying to look at price action."}, {"time": 2532, "text": "And somebody says, this doesn't make any sense."}, {"time": 2534, "text": "And somebody will say, it's just the locals stealing from each other."}, {"time": 2537, "text": "And that's really what we have."}, {"time": 2540, "text": "We've got the leaders of Magistan and Wokistan, championing these two teams is sponsored by the center because it's a distraction while they steal all the silver and cut the paintings out of the frames."}, {"time": 2551, "text": "That's what you and I are looking at."}, {"time": 2553, "text": "So when you ask me, do you have any ideas about the abstraction for free speech?"}, {"time": 2559, "text": "I've never met Mark Zuckerberg."}, {"time": 2561, "text": "I've never met Sundar Pichai."}, {"time": 2563, "text": "I never met Larry Page."}, {"time": 2565, "text": "I was once in a room with Sergey Brin."}, {"time": 2567, "text": "I've never spoken to Elon Musk."}, {"time": 2570, "text": "I hang out with Peter Thiel, but we have a very deep relationship, but I don't really speak to that many other people at sort of at this level."}, {"time": 2580, "text": "We're not having any kind of smart conversation at a national level."}, {"time": 2585, "text": "In fact, it's almost as if we've destroyed every sandbox in which we could play together."}, {"time": 2593, "text": "There's no place that we actually talk except long form podcasting."}, {"time": 2598, "text": "And by the way, they've found, you see what's going on with like Alex Stamos and the Hoover Institution."}, {"time": 2606, "text": "There's a loophole left."}, {"time": 2608, "text": "Long form podcasting allows people to speak at levels above daytime CNN."}, {"time": 2614, "text": "It's like, well, why do you think they're not watching daytime CNN?"}, {"time": 2619, "text": "But that's just silly journalism."}, {"time": 2622, "text": "They currently have no power to displace podcasting."}, {"time": 2625, "text": "That's why it's so powerful, RSS feed."}, {"time": 2627, "text": "I mean, that's why the big challenge with Joe Rogan and Spotify is like, there's this dance that's fascinating to see is Joe Rogan is not part of the system and then he's also uncancellable and there's this tension that's happening."}, {"time": 2644, "text": "Well, think about what happened to Howard Stern though."}, {"time": 2645, "text": "Howard Stern became much less relevant."}, {"time": 2648, "text": "So if they can't control Joe by bringing him in house, the key question is, is he going to continue, like Joe says this thing about FU money."}, {"time": 2662, "text": "Joe's one of the only people with FU money who's actually said FU."}, {"time": 2670, "text": "I don't have FU money."}, {"time": 2672, "text": "What exactly is, can we break apart FU money?"}, {"time": 2676, "text": "Because I always thought I've been fortunate enough to always have FU money in the sense that my standards were so low that a basic salary in the United States."}, {"time": 2689, "text": "Well, this is the stoic point, which is if you can live on rice and beans, you're uncancellable because you're always rich relative to your needs."}, {"time": 2696, "text": "Isn't that FU fundamental, FU money?"}, {"time": 2697, "text": "Why do you say that tech billionaires don't have FU money?"}, {"time": 2701, "text": "When you need to hire private security to protect your family, how do you protect your two children?"}, {"time": 2707, "text": "I don't have those yet."}, {"time": 2708, "text": "Bingo."}, {"time": 2710, "text": "My point is that FU money insulates everything that you care about."}, {"time": 2715, "text": "It's not just about you."}, {"time": 2717, "text": "So you're saying as the level of responsibility grows, the amount of money required for FU."}, {"time": 2724, "text": "We have a war going on."}, {"time": 2726, "text": "The war is on academic freedom."}, {"time": 2728, "text": "Academic freedom used to be present in the system as a, in terms of the idea, we trust our elite."}, {"time": 2735, "text": "Now we have an idea like, you wanna be the elite."}, {"time": 2739, "text": "You want a Lord above us."}, {"time": 2740, "text": "First of all, there's like a populist, anti elitist thing."}, {"time": 2743, "text": "Then there's the idea that we're gonna defer tenure for forever."}, {"time": 2748, "text": "Then we're gonna tell people, stay in your lane."}, {"time": 2750, "text": "Your tenure is only good for your own particular tiny micro subject."}, {"time": 2754, "text": "Then we're gonna also control your grants and we'll be able to load up your teaching load."}, {"time": 2759, "text": "If we don't like who you are, we'll make your life absolutely impossible."}, {"time": 2763, "text": "We lost academic freedom and we ushered in peer review, which was a disaster."}, {"time": 2770, "text": "And then we lost funding so that people were confident that they would have the ability to do research no matter what they said."}, {"time": 2780, "text": "And as a result, what you find is, is a world in which there's no ability to get people to say, no, I'm not gonna sign your diversity and inclusion forced loyalty oath."}, {"time": 2790, "text": "I won't sign any loyalty oath."}, {"time": 2792, "text": "Get the hell out of my office."}, {"time": 2794, "text": "FU."}, {"time": 2796, "text": "FU, and you're connecting money to that, but."}, {"time": 2799, "text": "Well, my point is, is that academic freedom is the, the whole idea behind it was that you will have the freedom of a billionaire on a much smaller salary."}, {"time": 2813, "text": "We've lost that."}, {"time": 2814, "text": "Yeah, the only reason in part that I wanted to go into academic, academics as a profession, as opposed to wanting to do physical or mathematical research."}, {"time": 2827, "text": "The great prize was freedom."}, {"time": 2829, "text": "And Ralph Gomery of the Sloan Foundation, previously of IBM research pointed it out."}, {"time": 2834, "text": "He says, if you lose freedom, you lose the only thing we had to offer top minds."}, {"time": 2840, "text": "Top minds value their intellectual freedom and their physical and economic security at a different level than other human beings."}, {"time": 2849, "text": "And so people say, you know, I don't understand, dude, and you have the ability to do X, Y, and Z."}, {"time": 2856, "text": "It's like, well, I value my ability to raise the middle finger as an American, practically above everything else."}, {"time": 2864, "text": "I want to talk to you about freedom here in the context of something you've mentioned, which is one way to take away freedom is to put a human being into a cage to create constraints."}, {"time": 2877, "text": "The other one that worries me is something that I think you've spoken to to Twitter a little bit on Twitter, is we bleed freedom by kind of slowly scaring you into not doing, not expressing the full spectrum of opportunities you can as freedom."}, {"time": 2900, "text": "So like when you ban Donald Trump, when you ban Parler, you give a little doubt in the minds of millions, like me, a person who's a tech person, who's an entrepreneur, there's a little, that's what I'm afraid of when I look in the mirror, is there now a little doubt in there that limits the amount of options I will try?"}, {"time": 2923, "text": "How certain are you that the COVID virus didn't come from the Wuhan lab and is biosafety level four?"}, {"time": 2932, "text": "We both know that we're both supposed to robotically say the idea that the COVID virus came from a lab is a discredited conspiracy theory."}, {"time": 2941, "text": "There is no evidence that suggests that this is true."}, {"time": 2943, "text": "The World Health Organization and the CDC have both opined this to say otherwise would be incredibly irresponsible."}, {"time": 2949, "text": "And the threat of that is the thing that ultimately limits the freedoms we feel."}, {"time": 2956, "text": "I should be tweeting about Jeff Epstein all the time."}, {"time": 2960, "text": "And you're afraid."}, {"time": 2962, "text": "It's also boring."}, {"time": 2963, "text": "I mean, I said it in the public."}, {"time": 2965, "text": "Many times."}, {"time": 2966, "text": "Why is it we don't ask where the records are from Villard House?"}, {"time": 2969, "text": "Where are the financial records?"}, {"time": 2970, "text": "Where are the SEC filings?"}, {"time": 2972, "text": "Where are the questions on the record to the intelligence agencies?"}, {"time": 2979, "text": "Was he known to be part of the intelligence community?"}, {"time": 2982, "text": "So we're not interested in asking questions."}, {"time": 2986, "text": "Like, am I gonna die as a result of asking the question, was Jeff Epstein part of the intelligence community of any nation?"}, {"time": 2994, "text": "Is there a reason we're not asking about the financial records of the supposed hedge fund that he didn't run?"}, {"time": 2999, "text": "It's just like the Wuhan lab."}, {"time": 3002, "text": "Okay, how do we get to the core of the Jeffrey Epstein, the truth behind Jeffrey Epstein in a sense?"}, {"time": 3008, "text": "I mean, there's some things that are just like useless conspiracy theories around it, even if they're true."}, {"time": 3013, "text": "There's some things that get to say it."}, {"time": 3014, "text": "I hate to say it."}, {"time": 3015, "text": "You're not gonna like it."}, {"time": 3017, "text": "Look at the 1971 media Pennsylvania break in of the Citizens Committee to investigate the FBI."}, {"time": 3024, "text": "Those kids, and by the way, they weren't all kids, did what had to be done."}, {"time": 3031, "text": "They broke in, they broke the law."}, {"time": 3033, "text": "It was an incredible act of civil disobedience."}, {"time": 3037, "text": "And God bless Judy Feingold for taking to her, she was going to take to her grave, that she'd been part of this, like the coolest thing of all time."}, {"time": 3045, "text": "They didn't say anything for forever."}, {"time": 3047, "text": "So civil disobedience, I mean, you have to."}, {"time": 3050, "text": "We are founded on civil disobedience."}, {"time": 3052, "text": "Civil disobedience is incredibly, you screw it up and you're just a vandal."}, {"time": 3059, "text": "You screw it up, you're a hooligan."}, {"time": 3062, "text": "Those cats were so disciplined."}, {"time": 3066, "text": "It's an art form."}, {"time": 3067, "text": "It was an art form and they risked everything."}, {"time": 3069, "text": "They were willing to pay with their freedom."}, {"time": 3074, "text": "Those are the sorts of people who earned the right by putting themselves at risk."}, {"time": 3078, "text": "I would not do this."}, {"time": 3080, "text": "I am not volunteering to break into anything."}, {"time": 3084, "text": "I think it was William Davidon who was a student of Murray Gellman and a physics professor at Haverford who corralled these people and led this effort."}, {"time": 3096, "text": "And right now, what we need is somebody to blow the lid off of what is controlling everything."}, {"time": 3103, "text": "We have, I'm happy to hear that it's a system of incentive structures, that it's a system of selective pressures."}, {"time": 3110, "text": "I'm happy to find out that it's emergent."}, {"time": 3112, "text": "I'm happy to find that it's partially directed by our own intelligence community."}, {"time": 3116, "text": "I'm happy to hear that, in fact, we've been penetrated by North Korea, Iran, China, and Russia."}, {"time": 3124, "text": "But I need to know why people aren't, like the firebombing of the courthouse in Portland, Oregon has no explanation."}, {"time": 3132, "text": "And somehow this is normal."}, {"time": 3134, "text": "This is not normal to any human being."}, {"time": 3137, "text": "We have video that people don't believe."}, {"time": 3139, "text": "And I come back to the shaggy defense of it wasn't me."}, {"time": 3144, "text": "You know, so it's like, you remember that song?"}, {"time": 3150, "text": "Shaggy, yeah, it wasn't me caught you banging in the shower on the counter."}, {"time": 3155, "text": "Yeah, exactly, it wasn't me."}, {"time": 3156, "text": "It wasn't me."}, {"time": 3157, "text": "He says, but his friend says, well, your strategy makes no sense at all."}, {"time": 3161, "text": "Well, this is what MSNBC is doing."}, {"time": 3166, "text": "You dropped it from the graphic, it wasn't me."}, {"time": 3169, "text": "You came up with another Yang, it wasn't me."}, {"time": 3172, "text": "I will never see MSNBC the same again."}, {"time": 3175, "text": "So you've spoken about him before."}, {"time": 3177, "text": "I think it'd be nice to maybe honor him to break it apart a little bit."}, {"time": 3182, "text": "Aaron Schwartz."}, {"time": 3184, "text": "Why was he a special human being in this ilk of what we're talking about now, civil disobedience?"}, {"time": 3191, "text": "How do we honor him now moving forward as human beings who are willing to take risks in this world?"}, {"time": 3200, "text": "I mean, are you inspired by Aaron Schwartz?"}, {"time": 3204, "text": "How do you feel about JSTOR?"}, {"time": 3205, "text": "Let's talk about JSTOR first."}, {"time": 3207, "text": "So let's say what JSTOR is all about, right?"}, {"time": 3210, "text": "We the taxpayer pay for research."}, {"time": 3216, "text": "And then the people who do the research do all the work for a bunch of companies who then charge us $30 an article to read what it is that we already paid for."}, {"time": 3228, "text": "And if we don't cite these articles, we're told that we're in violation."}, {"time": 3235, "text": "I almost never call for civil disobedience because I don't really want to, but fuck JSTOR, fuck Elsevier, fuck Springer."}, {"time": 3245, "text": "Who the fuck are these people?"}, {"time": 3248, "text": "Get the smart people need to take the greedy people behind the woodshed and explain to them what science is."}, {"time": 3259, "text": "I have a very old fashioned idea that's so out of favor that I will immediately be seen as a knuckle dragger."}, {"time": 3267, "text": "I believe in the great woman theory of history and the great man theory of history."}, {"time": 3271, "text": "Emmy Nerder is fantastic as an example."}, {"time": 3274, "text": "As an example, and I believe in editors over peer reviewers."}, {"time": 3281, "text": "And I believe that wrong things should be allowed into the literature."}, {"time": 3285, "text": "And I believe that the gatekeeping should go towards zero because the costs associated with distribution are very, very slight."}, {"time": 3293, "text": "I believe that we should be looking at the perverse incentives of sending your paper blindly into your competitor's clutches, particularly if you're a young person being reviewed by an older person."}, {"time": 3307, "text": "Are you familiar with the Duat de Senor?"}, {"time": 3311, "text": "Are you familiar with the legend of the Magnaia?"}, {"time": 3315, "text": "No, the Magnaia is the Miller's daughter and the largest food fight in the entire universe, I believe is held, I think in Italy, it's called the Battle of the Oranges."}, {"time": 3327, "text": "And it celebrates the Miller's daughter who had fallen in love with her beloved."}, {"time": 3334, "text": "And when it came time for them to marry, the virginal Magnaia was in fact told that the Lord of the land had the right to have the first night with the bride."}, {"time": 3348, "text": "Well, the Magnaia had a different idea."}, {"time": 3351, "text": "So she seemed to consent to this perhaps mythical right, also called the Prima Note, the first night."}, {"time": 3359, "text": "And by legend, she concealed a dagger underneath her robes."}, {"time": 3365, "text": "And when it came time for the hated Lord of the Manor to extract this right, she pulled the knife out and killed him."}, {"time": 3374, "text": "And I think it also echoes a little bit of particularly wonderful scene from Game of Thrones."}, {"time": 3380, "text": "But that inspired both men and women."}, {"time": 3383, "text": "And the Magnaia is the legendary hero."}, {"time": 3386, "text": "So right now, what we need to do is we need to resist the Prima Note, the right of first look, right?"}, {"time": 3396, "text": "F you, you don't have the right of first look."}, {"time": 3398, "text": "I don't wanna send something blindly to my competitors."}, {"time": 3400, "text": "I don't wanna subject myself to you naming what work I've done."}, {"time": 3405, "text": "Why are you in my story?"}, {"time": 3408, "text": "That's my question, get out of my story."}, {"time": 3410, "text": "If I do work and then you have an idea, oh, well, it's the Matthew principle."}, {"time": 3414, "text": "To him who has much more will be given."}, {"time": 3417, "text": "I've gone to the National Academy of Sciences and talked about these things."}, {"time": 3420, "text": "And it's funny, I've been laughed at by the older people who think, well, Eric, you know science proceeds funeral by funeral, that's Planck."}, {"time": 3429, "text": "You know the Matthew principle, you know the Matilda principle, the things done by women are attributed to men."}, {"time": 3434, "text": "That these are not new."}, {"time": 3436, "text": "And you guys just live like this?"}, {"time": 3437, "text": "Yeah, so the Revolutionary Act now is to resist all of these things that are not new."}, {"time": 3443, "text": "So you asked me about Aaron Schwartz."}, {"time": 3445, "text": "Aaron Schwartz was the Magnaia."}, {"time": 3447, "text": "One of the things you've done very beautifully is to communicate love."}, {"time": 3451, "text": "And I think about some of our conversations."}, {"time": 3455, "text": "And you got me to talk a little bit about my own experiences in 02138 and 39."}, {"time": 3465, "text": "We are the product of our trauma."}, {"time": 3468, "text": "And what people don't understand is that very often when you see people taking countermeasures against what appear to be imaginary forces, they're really actually replaying things that really happened to them."}, {"time": 3482, "text": "And having been through this system and watching all of the ways in which it completely rewrites the lives of the people who I am counting on to cure our diseases, build our new industries, keep us safe from our foes, the amount of pressure the system is putting on the most hopeful minds is unimaginable."}, {"time": 3503, "text": "And so my goal is to empower somebody like an Aaron Schwartz in memory and to talk about a Jeffrey Epstein situation."}, {"time": 3512, "text": "Do you know that the first person outside of me to get a look at geometric unity was Jeffrey Epstein?"}, {"time": 3522, "text": "How did he know I was working on this?"}, {"time": 3526, "text": "So your ideas that formed geometric unity was something that his eyes have seen?"}, {"time": 3531, "text": "I was pushed to talk to Jeffrey Epstein as one of the only people who could help me."}, {"time": 3539, "text": "No, no, no, listen to this."}, {"time": 3540, "text": "Yeah, how does this connect?"}, {"time": 3541, "text": "Okay, well, first of all, my old synagogue, my old shul was the conservative minion at Harvard Hillel."}, {"time": 3551, "text": "And I believe it's called Rosovsky Hall after Henry Rosovsky in the economics department, who was a Japan scholar, if I'm correct."}, {"time": 3560, "text": "And he became provost or dean of Harvard."}, {"time": 3565, "text": "I believe that that was built with Jeffrey Epstein's money."}, {"time": 3569, "text": "And I wondered in part whether the Jewish students at Harvard all sort of passed through a bottleneck of Harvard Hillel."}, {"time": 3577, "text": "So that was something I found very curious, but I don't know much about it."}, {"time": 3581, "text": "I also found that Jeffrey Epstein hanging around scientists, I don't think that either you or Joe exactly, I mean, got me correct in your last interchange."}, {"time": 3591, "text": "For the record, for people who haven't listened to Joe Rogan program, Joe has claimed that Eric Weinstein was the only person who has gotten laid."}, {"time": 3597, "text": "Paid."}, {"time": 3598, "text": "Oh, paid."}, {"time": 3600, "text": "And you said you also got paid as a young man, right?"}, {"time": 3604, "text": "I believe the word was laid, but allegedly."}, {"time": 3607, "text": "My hearing isn't so good at age 55."}, {"time": 3609, "text": "All right, leaving that aside."}, {"time": 3611, "text": "Leaving that aside, what was Jeffrey Epstein doing hanging around all of these scientists?"}, {"time": 3618, "text": "I don't think that was the same program that was about compromising political leaders and business people and entertainment figures."}, {"time": 3627, "text": "I think these are two different programs that were being run through one individual."}, {"time": 3631, "text": "And Joe seemed to think that I didn't think he was smooth."}, {"time": 3635, "text": "I thought he was glib."}, {"time": 3638, "text": "I think what Joe is really trying to get at is that I found his mysticism meretricious."}, {"time": 3643, "text": "He had an ability to deflect every conversation that might go towards revealing that he didn't know what he was talking about."}, {"time": 3651, "text": "Every time you started to get close to something where the rubber hit the road, the rubber wouldn't hit the road."}, {"time": 3658, "text": "And yet, can you help me untangle the fact that you thought deeply about the physics of the nature of our universe and Jeffrey Epstein was interested?"}, {"time": 3673, "text": "How did he know?"}, {"time": 3674, "text": "I wasn't really talking about this stuff until, even my close friends didn't really know what I was up to."}, {"time": 3682, "text": "And yet you're saying he did not have sufficient brilliance to understand when the rubber hit the road."}, {"time": 3688, "text": "So why did he have sufficient interest and curiosity?"}, {"time": 3693, "text": "I'll tell you what I thought."}, {"time": 3694, "text": "I had been waiting to find out, does my government even know I exist?"}, {"time": 3699, "text": "Do you have an answer to that question?"}, {"time": 3700, "text": "I have, a couple times the government has reached out to me."}, {"time": 3706, "text": "In general, there is zero interest in me, like less than zero interest."}, {"time": 3712, "text": "I find that fascinating."}, {"time": 3714, "text": "As far as you know, right?"}, {"time": 3716, "text": "Well, that's what I'm trying to say."}, {"time": 3717, "text": "The question about not being able to see through a half silvered mirror, you don't know what's going on behind the half silvered mirror."}, {"time": 3724, "text": "To you, it's all you see is your reflection."}, {"time": 3729, "text": "But your intuition still holds, like this is where I've mentioned that I, this is where I'll say naive dumb things, but I still hold on to this intuition that Jeff, I'm not confident in this, but I lean towards that direction that Jeffrey Epstein is the source of evil, not something that's underlying him."}, {"time": 3749, "text": "You have a bias."}, {"time": 3751, "text": "It's different than mine."}, {"time": 3752, "text": "Our Bayesian priors are tutored by different life experiences."}, {"time": 3757, "text": "If I was mostly concerned, like Sam Harris is concerned, that people fill their heads with nonsense, I would have a very strong sense that people need order in the world, that they take mysterious situations, they build entire castles in the air, and then they go move in if they really get crazy."}, {"time": 3776, "text": "The old saying is that neurotics build castles in the air and psychotics move in."}, {"time": 3782, "text": "Coming from a progressive family, we had a different experience."}, {"time": 3786, "text": "It's really weird when the government is actually out to get you, when they actually send a spy, when they actually engage in disinformation campaigns, when they smear you."}, {"time": 3795, "text": "And if you've ever had that brought to bear on your family, you have a Howard Zinn sort of understanding of the country, which is different than having a, wow, do people believe crazy stuff because they watch too much TV."}, {"time": 3809, "text": "And both of these things have some merit to them, but it's a question of regulated expression."}, {"time": 3814, "text": "When do you want to express more Sam Harris and when do you want to express more Howard Zinn?"}, {"time": 3819, "text": "And you can express both, correct?"}, {"time": 3821, "text": "The one human being can express both?"}, {"time": 3822, "text": "Sure, but there's a trade off between them."}, {"time": 3824, "text": "In other words, most people like the Michael Shermers of the world are gonna tilt very strongly to extraordinary claims require extraordinary evidence."}, {"time": 3832, "text": "So you're gonna have that kind of energy."}, {"time": 3834, "text": "And then somebody else is gonna say, how many times do I have to get hit on, how many times do I have to hammer my own thumb before I realize that there's a problem?"}, {"time": 3842, "text": "So my feeling about this is yes, people see patterns in clouds."}, {"time": 3846, "text": "They see faces and scripture and all sorts of things, and it's just random cloud patterns."}, {"time": 3850, "text": "And it's also the case that there's tremendous pressure not to see conspiracies when conspiracies are relatively more common than the people who shout conspiracy theory will claim."}, {"time": 3861, "text": "So both of these things are true."}, {"time": 3862, "text": "And you have to ask, when do you express your inner Zinn and when your inner Harris?"}, {"time": 3866, "text": "And those are different."}, {"time": 3867, "text": "I want to find them out."}, {"time": 3868, "text": "The difference in you and I biases aside is you've actually met Jeffrey Epstein."}, {"time": 3873, "text": "And I'm listening to reverberations years later of stories and narratives throughout the story."}, {"time": 3882, "text": "Luckily, I only met him once."}, {"time": 3884, "text": "And I think I had one or perhaps two phone conversations with him other than the one meeting."}, {"time": 3891, "text": "You can learn a lot in just a few words, right, from a human being."}, {"time": 3895, "text": "Well, that's true, but I think that the bigger issue was I saw something that I don't hear much remarked upon, which is Jeffrey Epstein is all that there is."}, {"time": 3905, "text": "In other words, there's the National Science Foundation, National Institute of Health, Howard Hughes."}, {"time": 3911, "text": "There's all this stuff that kind of has the same feel to it, a little bit of variation and difference, Department of Energy."}, {"time": 3920, "text": "If you fall outside of that, there's just Jeffrey Epstein."}, {"time": 3923, "text": "That's what you're told."}, {"time": 3926, "text": "That's not quite true."}, {"time": 3926, "text": "There's Kavli, maybe Jim Simons is now in the game."}, {"time": 3930, "text": "Peter Thiel has done some stuff."}, {"time": 3932, "text": "You had Yuri Milner and Mark Zuckerberg try."}, {"time": 3935, "text": "So there is other money running around, Templeton."}, {"time": 3939, "text": "But very strongly, there was a belief that if you're doing something really innovative and the system can't fund it because we become pussies, Jeffrey Epstein's your guy."}, {"time": 3949, "text": "So there's like this funnel that you're supposed to go through."}, {"time": 3954, "text": "And the idea is that you get called the great man's house and the sort of lubricious version of Ralph Lauren takes you in and asks you bizarre questions."}, {"time": 3967, "text": "And maybe he has an island, maybe he has a plane."}, {"time": 3970, "text": "And when you're starved, somebody showing you a feast or when you're dehydrated in a death's door and somebody says, oh, I have a well, that's what it is."}, {"time": 3987, "text": "And so the thought is, wow, can somebody get some effing money into the science system so that we don't have super creeps trying to learn all of our secrets ahead of time?"}, {"time": 3999, "text": "WTF, what is your problem with transparency and taxpayer dollars?"}, {"time": 4003, "text": "Just all of you, you wouldn't have a country."}, {"time": 4006, "text": "You'd be speaking German."}, {"time": 4007, "text": "So essentially you believe that human beings would not be able to, when the money is lacking in the system, like in research."}, {"time": 4015, "text": "We produce public goods."}, {"time": 4017, "text": "You and I are meant to produce public goods."}, {"time": 4020, "text": "Now I sell Athletic Greens and I sell Theragun and I sell Unagi scooters and Chili Pad."}, {"time": 4027, "text": "Can I be honest, I love these products, but I didn't get into this game for the purpose of selling."}, {"time": 4034, "text": "I'm trying to figure out how do you have an FU lifestyle?"}, {"time": 4039, "text": "But you know something Lex, I don't know why you built this channel, it's kind of a mystery."}, {"time": 4046, "text": "I'll tell you why I built my channel."}, {"time": 4048, "text": "It's gonna be a lot harder to roll me this time in an alley."}, {"time": 4052, "text": "I got rolled multiple times and my point is I didn't want to become a celebrity, I didn't want to become well known, but it's a lot harder to roll somebody who's getting, I think I'm, I don't know if this is mistaken, but I think I'm the math PhD with the largest number of followers on Twitter."}, {"time": 4074, "text": "And there was nothing you could do before."}, {"time": 4078, "text": "I mean again, to put a little responsibility on you, so you've created something really special for the distribution of your own ideas."}, {"time": 4086, "text": "I mean, but because it's not necessarily currently scalable, you also, perhaps you and I have the responsibility of giving other people also a chance to spread their ideas."}, {"time": 4099, "text": "I mean Joe Rogan did this very effectively for a bunch of people that."}, {"time": 4103, "text": "That's why they're angry at him because he's a gatekeeper and he let all sorts of people through that gate from Roger Penrose to Alex Jones."}, {"time": 4112, "text": "To Jordan Peterson to, I mean, even first of all, to you."}, {"time": 4118, "text": "To Abby Martin."}, {"time": 4120, "text": "To Barry Weiss."}, {"time": 4125, "text": "Well, but you have not successfully built up a thing that allows that to carry that forward."}, {"time": 4130, "text": "Oh no, no, no, no."}, {"time": 4132, "text": "We are all vulnerable to reputational attack because what happens, you see, the problem, Lex, is that you are now an institution at some level."}, {"time": 4142, "text": "You walk around with all this equipment in a duffel bag."}, {"time": 4148, "text": "The last suit you'll ever need."}, {"time": 4150, "text": "And you have the reach of something like CNN to people who matter."}, {"time": 4160, "text": "So now the question is, how do we control something that doesn't have a board, doesn't have shareholders, doesn't have to make SEC filings, FCC."}, {"time": 4168, "text": "So the best answer they have is, well, we just have to destroy reputations."}, {"time": 4176, "text": "All it takes is for us to take something that gets said or done or alleged."}, {"time": 4181, "text": "And I think it's incredibly important."}, {"time": 4183, "text": "One of the things people don't understand is that I'm going to fight general reputational attacks."}, {"time": 4189, "text": "Not because some people don't deserve to have their reputations dragged through the mud, but because it's too powerful of a tool to hand it to CNN, MSNBC, Princeton, Harvard, the State Department."}, {"time": 4205, "text": "But some of it is also."}, {"time": 4207, "text": "J.P. Morgan."}, {"time": 4209, "text": "Muhammad Ali style, being good enough at doing everything you need to do without giving enough meat for the reputational attacks."}, {"time": 4221, "text": "Not being afraid, but not giving enough meat."}, {"time": 4225, "text": "I don't see why the people who have good ideas have to lead lives that are that clean."}, {"time": 4230, "text": "If you can do it."}, {"time": 4231, "text": "You can be messy, yeah."}, {"time": 4232, "text": "You should be able to be messy."}, {"time": 4234, "text": "Otherwise, we're suppressing too many people."}, {"time": 4237, "text": "Too many, too brilliant minds."}, {"time": 4239, "text": "Can you believe Elon Musk smoked a blunt?"}, {"time": 4242, "text": "I still, people tell me this."}, {"time": 4245, "text": "Okay, I have discussions about Elon and people, the Avi Loeb, the Harvard scientist, who's talking about a Muammuah that it might be alien technology."}, {"time": 4258, "text": "He told me his, this outside the box thinker."}, {"time": 4265, "text": "When speaking to me about Elon said, called him the guy who smoked, he smokes weed."}, {"time": 4273, "text": "The blunt."}, {"time": 4275, "text": "In a dismissive way."}, {"time": 4276, "text": "Like this guy's crazy because he smoked some weed."}, {"time": 4280, "text": "I was looking at him."}, {"time": 4281, "text": "I was like, why?"}, {"time": 4285, "text": "I think you should be able to have consensual drug filled orgies."}, {"time": 4290, "text": "Fuck perfect lives."}, {"time": 4292, "text": "Yeah, you should be allowed to be messy."}, {"time": 4295, "text": "I take back my statement."}, {"time": 4297, "text": "Respectability is the unique prison where all of the gates are open and the inmates beg to stay inside."}, {"time": 4306, "text": "It's time to end their prison of respectability because it's too effective of a means of sidelining and silencing people."}, {"time": 4314, "text": "Including it is better that we have bad people in our system than this idea of no platforming people who are beyond the pale because it's such a simple technique."}, {"time": 4328, "text": "So how do we, what's the heroic action here on the?"}, {"time": 4331, "text": "Well, for example, having Ashley Matthews on my program."}, {"time": 4335, "text": "By the way, she was absolutely delightful as a guest."}, {"time": 4340, "text": "She was, she is polite in the extreme, far more polite than I am."}, {"time": 4346, "text": "And I had her right after Roger Penrose as a guest because I wanted to highlight this program can go anywhere."}, {"time": 4352, "text": "We can talk to anyone."}, {"time": 4353, "text": "What about social media?"}, {"time": 4354, "text": "You've started highlighting people being banned on social media."}, {"time": 4358, "text": "How do we fight this?"}, {"time": 4360, "text": "Like if you get banned from social media, so you're saying nobody will stand up to me."}, {"time": 4364, "text": "Well, just figure out what your incentive structure is before."}, {"time": 4367, "text": "Assume that I get banned on social media because somebody wants to make sure that my message doesn't interfere with the dominant narrative."}, {"time": 4378, "text": "What will happen, by the way, I'm very glad to be able to explain this on your show because that video will presumably be archived and they can't easily make you take it down."}, {"time": 4389, "text": "So what's gonna happen is, is that there'll be a whole bunch of very low quality bot like accounts that dog you every time you talk about me."}, {"time": 4399, "text": "Right, dude, it's getting old, getting boring."}, {"time": 4402, "text": "We already heard you."}, {"time": 4403, "text": "Dude, that was like, let it go."}, {"time": 4405, "text": "Not a good look."}, {"time": 4407, "text": "Not a good look is one of my favorites."}, {"time": 4409, "text": "But what about the high profile ones?"}, {"time": 4410, "text": "Well, then you'll get a few high profile ones and some of the high profile ones command armies."}, {"time": 4417, "text": "Like at some point I had 10,000 people using exactly the same templated tweet, tweeting at me."}, {"time": 4423, "text": "It was just actually, it got to the point where it was funny because everybody said, did you hear that in a hipster coffee shop?"}, {"time": 4429, "text": "And I was like, why are you all suddenly talking about hipster coffee?"}, {"time": 4436, "text": "Those things will cause you to think better of it."}, {"time": 4438, "text": "You'll start to see your follower count go down because it's easy to give you a bunch of bot like follows and then just pull them."}, {"time": 4446, "text": "So I think that's pretty well known how, and then maybe your account will be suspended and it can't be revoked and et cetera, et cetera."}, {"time": 4454, "text": "And then three days later, you'll be told it was an error."}, {"time": 4457, "text": "So let me push back."}, {"time": 4458, "text": "I just don't see not defending you."}, {"time": 4460, "text": "Like, okay, so what are the things you would do that given that I can actually talk to you offline, that would make me not defend you?"}, {"time": 4473, "text": "Well, first of all, I can't, I mean, I can imagine some, but all of us have things."}, {"time": 4479, "text": "If somebody says, do you hear what your boy, Lex said about you?"}, {"time": 4483, "text": "What did Lex say about me?"}, {"time": 4485, "text": "Oh, he said you were flawed, dude."}, {"time": 4491, "text": "They so distressed because none of us wanna stand behind flawed people."}, {"time": 4497, "text": "That's why you have everybody rushing to say, I neither condemn nor condone."}, {"time": 4500, "text": "I know I don't condemn nor, what is that?"}, {"time": 4502, "text": "We're all trying to say."}, {"time": 4503, "text": "By the way, for the record, I said that Eric is smarter than me in a brilliant human being, but flawed like all humans are."}, {"time": 4510, "text": "My point is I've now come up with a new policy, which is I don't care what my friends have done."}, {"time": 4517, "text": "I am not disavowing my friends, not because they didn't do the wrong thing."}, {"time": 4522, "text": "Maybe they did do the wrong thing."}, {"time": 4525, "text": "What's the value of friendship if that's not that?"}, {"time": 4528, "text": "Like, for example, we've had the situation with Brian Callan."}, {"time": 4530, "text": "Brian Callan was featured recently in the Los Angeles Times."}, {"time": 4534, "text": "I know nothing about the allegations."}, {"time": 4536, "text": "I can't, I didn't even know Brian at the time, right?"}, {"time": 4539, "text": "I've known him for roughly the time I've been in Los Angeles, maybe a year and a half during that period of time."}, {"time": 4544, "text": "I've never seen anything wrong."}, {"time": 4547, "text": "Now I'm in a situation, well, what do you think he did?"}, {"time": 4550, "text": "Do you think he didn't?"}, {"time": 4550, "text": "It's like, you know what?"}, {"time": 4552, "text": "I don't know, but I do know this."}, {"time": 4554, "text": "Everyone's entitled to have friends because we can't afford isolated people."}, {"time": 4560, "text": "And if your friends do the wrong thing, they're still your friends."}, {"time": 4564, "text": "And if they do terrible, terrible things, you bring that up with them privately."}, {"time": 4568, "text": "And it's not my responsibility to disavow in public."}, {"time": 4572, "text": "We've had the situation that I don't like where particular people that I've been close to, I'm put under tremendous pressure to disavow them."}, {"time": 4581, "text": "What do you think now about your buddy?"}, {"time": 4584, "text": "I like Dave Rubin, all that kind of stuff."}, {"time": 4586, "text": "Here's the thing, my friends are my friends."}, {"time": 4588, "text": "I don't disavow my friends."}, {"time": 4590, "text": "We all need to make a statement that we will not be brought under pressure to disavow our friends, our family members, because mass murderers are dangerous the more isolated they become."}, {"time": 4608, "text": "It is not a good idea to constantly push to isolate people."}, {"time": 4613, "text": "And it's dangerous, and so."}, {"time": 4614, "text": "And it sends a signal to everybody else to fit in, to be more cynical about the human."}, {"time": 4620, "text": "So my feeling, if I find out you've been selling heroin to elementary school students, you're still my friend, and I will not be disavowing you."}, {"time": 4629, "text": "And if I have a problem with you selling heroin to elementary school students during school hours, I will bring it up with you privately, because we don't need to hear my voice added to that condemnation."}, {"time": 4643, "text": "Are there things that you could do that would cause me to say, actually, F this guy?"}, {"time": 4647, "text": "Yeah, above and beyond that."}, {"time": 4649, "text": "But simply doing the wrong thing, I think we've gone down a terrible path."}, {"time": 4654, "text": "I think isolated people are about the most dangerous thing we could have in a heavily armed society."}, {"time": 4660, "text": "So I deeply agree with you on Brian Callan and on all these people that, quote, unquote, got canceled."}, {"time": 4667, "text": "And I'm not saying that they, I don't know the truth value, because we can't."}, {"time": 4672, "text": "And even if I did know the truth value, I'm not setting up an incentive structure for the personal destruction as a means of letting institutions combat the fact that individuals are the last thing that can say, none of you guys make any sense."}, {"time": 4688, "text": "I don't treat these things like, I had a conversation where Kevin Spacey was at the dinner table when I came down from a hotel room."}, {"time": 4695, "text": "And I had a very long conversation with Kevin Spacey."}, {"time": 4698, "text": "I will not detail, because I don't do that, as to what we discussed."}, {"time": 4703, "text": "But we talked very specifically about him being canceled."}, {"time": 4707, "text": "And I don't think that the world has heard that story in part because there's a very strong sense that he has to be outgrouped."}, {"time": 4715, "text": "And as a result, I mean, do we want, do we want to disavow the space program because it touched Werner von Braun?"}, {"time": 4724, "text": "Do we want to disavow quantum mechanics because Pascal Jordan and Werner Heisenberg passed through it?"}, {"time": 4729, "text": "Is Ehrenfest's theorem false because he murdered his child?"}, {"time": 4733, "text": "I mean, at what point do we recognize that we are the problem?"}, {"time": 4737, "text": "Humans are humans."}, {"time": 4738, "text": "And there is no perfect, there is no perfect group of people, even all of the most oppressed people, the supposed victims of the world, who we now have fetishized into thinking that they're all oracles because their lived experience informs us and their pain is more salient than everyone else's pain."}, {"time": 4756, "text": "Those people aren't necessarily great people."}, {"time": 4759, "text": "It's like none of us, we can't do this in this fashion."}, {"time": 4764, "text": "So when we sit down to have a conversation across the table from somebody, you should be willing to, like you should not have NPR in your mind."}, {"time": 4773, "text": "You should be willing to take the full risk and to see the good in the person with limited information and to do your best to understand that person."}, {"time": 4784, "text": "Everybody is entitled to a hypocrisy budget."}, {"time": 4788, "text": "I don't believe this is of institutions, okay?"}, {"time": 4791, "text": "Everybody is entitled to a certain amount of screwing up in life."}, {"time": 4795, "text": "You're entitled to a mendacity budget."}, {"time": 4797, "text": "You're entitled to an aggression budget."}, {"time": 4800, "text": "The idea of getting rid of everybody, you know, people haven't even blown through their budgets and we're already."}, {"time": 4807, "text": "Yeah, I think about, for example, one person, I'd be curious to get your thoughts about Alex Jones."}, {"time": 4814, "text": "Let's not talk about Alex Jones for a second."}, {"time": 4816, "text": "Let's talk about the National Enquirer."}, {"time": 4818, "text": "Is everything the National Enquirer says false?"}, {"time": 4825, "text": "Okay, do you remember the John Edwards story?"}, {"time": 4828, "text": "Did you cheat on his wife?"}, {"time": 4830, "text": "He had a child from an extramarital affair."}, {"time": 4834, "text": "I believe that the National Enquirer broke the story."}, {"time": 4839, "text": "And then what does the New York Times do?"}, {"time": 4841, "text": "The New York Times, I think, is allowed to report that the National Enquirer is making a claim."}, {"time": 4846, "text": "That way they don't have to substantiate the story."}, {"time": 4849, "text": "So why is the New York Times talking to Mike Cernovich or using the National Enquirer as a source?"}, {"time": 4856, "text": "Are they using Alex Jones as a source?"}, {"time": 4859, "text": "Here's the big problem that we're having."}, {"time": 4862, "text": "Why are certain people entitled to talk to everybody and other people are entitled to talk to no one?"}, {"time": 4868, "text": "I don't really understand this."}, {"time": 4869, "text": "This is an indulgence system."}, {"time": 4870, "text": "This is how the Catholic church used to do things."}, {"time": 4873, "text": "It's hard to fight the system because the reason you don't talk to Alex Jones is because the platforms on which we do the communication will deplatform."}, {"time": 4881, "text": "I'm not platform."}, {"time": 4883, "text": "I used to do NPR and I used to do the NewsHour and I used to provide stories to Washington Post, New York Times."}, {"time": 4892, "text": "That has gone away."}, {"time": 4893, "text": "They've circled the wagons closer and closer and more of us are unacceptable."}, {"time": 4898, "text": "And right now I have no question that they're going through anybody who has a platform trying to say, okay, what do we have against that person in case we need to shut that down?"}, {"time": 4908, "text": "We have to make a different decision, Lex, and the different decision is that it doesn't matter how many times Joe said the N word."}, {"time": 4918, "text": "It doesn't matter that somebody else, with mathematical theorems, if the worst person in the world proves a mathematical theorem like the Unabomber, we can't undo the theorem."}, {"time": 4932, "text": "And I point out Charles Manson's song, Look at Your Game Girl is an amazing song."}, {"time": 4938, "text": "It's a really good song."}, {"time": 4939, "text": "I don't think it's one of the greatest songs ever, but it happens that he wasn't a no talent."}, {"time": 4945, "text": "And I don't know how Hitler was as an artist."}, {"time": 4949, "text": "Fiction, not bad."}, {"time": 4950, "text": "Okay, we've got to get past this."}, {"time": 4953, "text": "We've got to get past this idea that we're going to purge ourselves of our badness and we're just going to, this is like, I've likened it to teenage girls in cutting."}, {"time": 4962, "text": "We're just, all we're doing is destroying ourselves in search of perfection."}, {"time": 4967, "text": "And the answer is no, we're not perfect."}, {"time": 4969, "text": "We're flawed, we're screwed up."}, {"time": 4972, "text": "And we've always been this way."}, {"time": 4973, "text": "And we're not going to silence everyone who you can point a laser beam at and say, well, that person, look at how bad that person is."}, {"time": 4980, "text": "If we do that, kiss the whole thing goodbye."}, {"time": 4983, "text": "We might as well just, let's learn Chinese."}, {"time": 4987, "text": "But there is an art to having those messy conversations, whether with Alex or anybody else."}, {"time": 4993, "text": "Okay, let's talk about Alex."}, {"time": 4995, "text": "There's particular stuff that Alex does that's absolutely nauseating."}, {"time": 4999, "text": "And there's other stuff that he's doing that's funny."}, {"time": 5000, "text": "The methodology of the way he carries."}, {"time": 5003, "text": "And sometimes he's talking about the truth."}, {"time": 5005, "text": "And sometimes he's talking about a conspiracy."}, {"time": 5007, "text": "His variance is incredibly high."}, {"time": 5010, "text": "The right way to approach Alex Jones or James O. Keefe or the National Enquirer or anything you don't like is to say, great, go long short."}, {"time": 5020, "text": "Well, if you invest in a mutual fund, all the stocks in the mutual fund are held long."}, {"time": 5026, "text": "But if you invest in a hedge fund, you do something called relative value trade."}, {"time": 5031, "text": "It's like, well, you long tech or short tech?"}, {"time": 5034, "text": "Well, actually I'm long Microsoft and I'm short Google."}, {"time": 5040, "text": "Oh, because I believe Google got way too much attention and that Microsoft has been unfairly maligned."}, {"time": 5046, "text": "And so this is really a play on legacy tech over more modern tech, okay?"}, {"time": 5052, "text": "Which part of Alex Jones are you long and which part are you short?"}, {"time": 5055, "text": "One of the things that should be a requirement for being a reporter is like, what did Donald Trump do that was good?"}, {"time": 5062, "text": "Okay, then you're not a reporter."}, {"time": 5065, "text": "What did Hitler do that was good?"}, {"time": 5069, "text": "The Rosenstrasse of protest."}, {"time": 5074, "text": "Non Jewish women campaign for their Jewish men to be returned home to them from certain death almost in death camps."}, {"time": 5083, "text": "It should have been that there were no death camps."}, {"time": 5085, "text": "It should have been that everybody was returned home."}, {"time": 5090, "text": "The fact that the women of the Rosenstrasse protest, I mean, sorry, I get very emotional about this."}, {"time": 5096, "text": "Some of the baddest ass chicks in the world got their husbands returned to them."}, {"time": 5103, "text": "Kolokavod."}, {"time": 5105, "text": "And not, I'm not celebrating Hitler."}, {"time": 5108, "text": "Hitler's the worst of the worst."}, {"time": 5111, "text": "But God damn it, this idea that we can just say everything that person does is a lie."}, {"time": 5117, "text": "Everything that person does is evil."}, {"time": 5120, "text": "This reflects a simplicity of mind that humanity cannot afford."}, {"time": 5126, "text": "Is Google evil because it will sell you Mein Kampf?"}, {"time": 5130, "text": "Is Amazon evil because it will sell you Mein Kampf?"}, {"time": 5132, "text": "If you find out that Mein Kampf rests on somebody's bookshelves, do you have any idea what it means?"}, {"time": 5138, "text": "If you find out that a scholar use the N word, should that person lose their job?"}, {"time": 5144, "text": "Grow the hell up."}, {"time": 5147, "text": "I guess our responsibility to lead by example in that, because you have to acknowledge that the fact, like the current public discourse."}, {"time": 5155, "text": "Have somebody on your podcast who you're worried about."}, {"time": 5161, "text": "But do it in a principled fashion."}, {"time": 5163, "text": "I mean, in other words, I'm not here to whitewash everything."}, {"time": 5168, "text": "On the other hand, if somebody makes some allegations, I don't know that I'm obligated to treat every set of allegations as if, no, how do you defend yourself against, no."}, {"time": 5181, "text": "Allegations are so cheap to make at this moment."}, {"time": 5184, "text": "Well, my standard, I don't know, maybe you could speak to it is, I don't care, like in the case of Alex Jones, for example, I don't, I'm willing to have a conversation with Alex Jones and people like him."}, {"time": 5197, "text": "If I know he's not going to try to manipulate me."}, {"time": 5200, "text": "Assume that he is gonna try to manipulate you."}, {"time": 5202, "text": "I can't, then we're not going to be two humans."}, {"time": 5205, "text": "Okay, but Lex, I want you to think well of me."}, {"time": 5208, "text": "I put on a jacket, I don't usually wear a jacket, okay?"}, {"time": 5212, "text": "Thank you, Eric."}, {"time": 5213, "text": "All right, I'm trying to manipulate you."}, {"time": 5215, "text": "There's an entire field, no, there's an entire field that says that speech may be best thought of as an attempt to manipulate each other."}, {"time": 5225, "text": "This is too simplistic."}, {"time": 5226, "text": "Everything that we keep talking through."}, {"time": 5230, "text": "You know better than this."}, {"time": 5231, "text": "I disagree, I think there is ways, there's, of course, it's a gray area, but there is a threshold where your intent with which you come to a meeting, to an interaction, is one that is not one that's grounded in like a respect for a common humanity, like a love for each other, is deeply messy."}, {"time": 5254, "text": "If somebody is doing really bad stuff, I expect you to try to keep them from doing really bad stuff."}, {"time": 5260, "text": "But just keep in mind that when I was a younger man, I saw an amazing anti pornography documentary, and it was called Rate It X, and I don't know where it went, but the conceit of it was we're going to get some pornographers in front of a camera because they want to talk, and we're going to ask them about what they do for a living and why it's okay."}, {"time": 5287, "text": "No commentary."}, {"time": 5293, "text": "You could potentially, if you really think Alex Jones is the worst, and again, I'm not intimately familiar with him, you could decide to just let him talk."}, {"time": 5305, "text": "Just let him talk."}, {"time": 5309, "text": "Now, I have decided not to do that with particular people."}, {"time": 5313, "text": "I've spoken to Stefan Molyneux."}, {"time": 5315, "text": "Stefan Molyneux makes many good points, makes many bad points, and he makes many good points in bad ways, and I worry about it, and I don't feel that it's not my obligation to make sure that Stefan Molyneux has a voice on the portal."}, {"time": 5331, "text": "But I did stand up and say I didn't want him banned from social media, and I do think that a lot of the people who are being banned from social media were worried that they're right rather than that they're wrong."}, {"time": 5343, "text": "I certainly don't really think that I'm worried in some sense that some of the really wrong people are wrong, but if you look at, for example, Curtis Yarvin, there's a tremendous amount of interest."}, {"time": 5355, "text": "Is Eric going to speak to Curtis Yarvin?"}, {"time": 5357, "text": "Curtis Yarvin says many interesting things, and he says many horrible, stupid things, very provocative."}, {"time": 5363, "text": "And I haven't invited him onto the portal, but I haven't said I will never invite him onto the portal."}, {"time": 5372, "text": "We are all in a difficult position."}, {"time": 5375, "text": "You're making it kind of, I think it's a much more difficult task and burden to carry as people who have conversations because Curtis Yarvin is a good example."}, {"time": 5386, "text": "How much work do I have to put in reading Curtis's work to really understand?"}, {"time": 5391, "text": "We should talk about the problem of Curtis Yarvin, I think it's probably illustrative."}, {"time": 5395, "text": "There's this big question is why does somebody who says such stupid ass things listen to by so many people?"}, {"time": 5401, "text": "Very smart people, people who are part of our daily lives discuss Curtis Yarvin in hushed tones."}, {"time": 5407, "text": "Now, it's a good question."}, {"time": 5409, "text": "My belief is that Curtis Yarvin has made a number of very interesting, provocative points, and they associate Curtis Yarvin as the person who has made these points, and they treat the completely asinine stuff that he says that's super dangerous as, well, that's Curtis, right?"}, {"time": 5429, "text": "Right, they give him the credit for, he's a kind of like, sorry to use the term, first principles deep thinker about the way the world, in some space about the world."}, {"time": 5440, "text": "But as a result, we don't actually know why Curtis Yarvin is knocking around so many Silicon Valley luminaries lives."}, {"time": 5451, "text": "See, you said that he said a lot of asinine stupid stuff, and that's the sense I got from a few things I've read, not just about, this is not just like Wikipedia stuff, is he's a little, like I've said before, he seems to be careless."}, {"time": 5465, "text": "I don't think he's, no, no, no, it's like Jim Watson."}, {"time": 5469, "text": "Jim Watson wants to say very provocative things in order to prove that he's free."}, {"time": 5474, "text": "It's not a question of careless."}, {"time": 5475, "text": "He enjoys the freedom to say these things."}, {"time": 5480, "text": "And the key point is, is that there's, I expect something more of Curtis."}, {"time": 5485, "text": "I expect that if somebody is insightful about all sorts of things up to that point, that they're going to have enough care."}, {"time": 5493, "text": "Now, I, for example, make this point repeatedly that vaccines are not 100% safe."}, {"time": 5498, "text": "Most people who have an idea that anybody who's an anti vaxxer should be silenced are in a position where they probably don't say vaccines are 100% safe, but you keep finding that statement over and over again, like believe all women, vaccines are 100% safe, climate science is settled science."}, {"time": 5515, "text": "Whatever this Mont and Bailey is, where you make extraordinarily vapid blanket claims, and then you retreat into something, well, defund the, we don't want no more police, actually just means we want the police to not take on mental health duties."}, {"time": 5534, "text": "We've come up with an incredibly disingenuous society."}, {"time": 5537, "text": "And what I'm claiming is, is that I might talk to Curtis Yarvin, but I have really very little interest to talk to a guy who seems to be kind of giddy about who makes good slaves and who makes bad slaves."}, {"time": 5551, "text": "It's like, why do I want to do that on the portal?"}, {"time": 5554, "text": "One, first of all, because just as you said, that's not Curtis's main thing."}, {"time": 5559, "text": "He has a lot of ideas and what I've read of him, which is not a huge amount, is he's very thoughtful about the way this world works."}, {"time": 5570, "text": "And on top of that, he's an important historical figure in the birth and the development of the alt right, or what would be called the alt right."}, {"time": 5579, "text": "Or the new reactionary."}, {"time": 5580, "text": "Yeah, and there's, so he's just an important intellectual."}, {"time": 5585, "text": "And so it makes sense to talk to him."}, {"time": 5587, "text": "The question is, how much work do you put in?"}, {"time": 5590, "text": "Well, this is the issue of fugu."}, {"time": 5592, "text": "I'm not a chef that necessarily can serve that fugu."}, {"time": 5598, "text": "So you have a puffer fish, you can eat the puffer fish."}, {"time": 5601, "text": "You can get kind of a tingly sensation on your tongue if you get a little bit of the poison organ."}, {"time": 5607, "text": "But my point is, I don't know how to serve Curtis Yarvin so that, in fact, I'm not worried about what happens."}, {"time": 5614, "text": "And I believe that if somebody else was a student of the new reactionary movement, that person might be in a better position to host Curtis Yarvin."}, {"time": 5622, "text": "So somebody, that's a really good example, somebody I think you've spoken with that's an intermediary, that's a powerful one, is Michael Malice."}, {"time": 5630, "text": "And he's spoken with Curtis Yarvin."}, {"time": 5632, "text": "And Michael wrote a book about."}, {"time": 5635, "text": "By the way, Michael somewhat changed my mind about Michael Malice."}, {"time": 5638, "text": "I'm glad he did."}, {"time": 5639, "text": "I think, I would call him a friend, and I think he's underneath it all a really kind human being."}, {"time": 5648, "text": "And I think your skepticism about him was initially from a surface level of, what did you call him, hyenas, the trolls, and so on."}, {"time": 5655, "text": "I'm not happy about his."}, {"time": 5659, "text": "It's been so long since I've seen good trolls."}, {"time": 5664, "text": "He needs a higher quality of trolling."}, {"time": 5668, "text": "But he aspires to that."}, {"time": 5670, "text": "I mean, disagree or not, I really enjoy how much care he puts into the work he does, like on North Korea and the study of the world, and how much privately, but also in public, love he has for people, especially those who are powerless."}, {"time": 5690, "text": "Just a genuine admiration for them."}, {"time": 5695, "text": "I think Curtis actually."}, {"time": 5697, "text": "Does too."}, {"time": 5699, "text": "I mean, you have to appreciate, the first time I met Curtis, he introduced me, he says, I'm the most right wing person you've ever met."}, {"time": 5705, "text": "I was just like, well, this is a conversation that's already over."}, {"time": 5709, "text": "It's theatrical in a way that's not conducted to actually having a real human connection."}, {"time": 5714, "text": "It turned me off because it was like, you need to be the most right wing person."}, {"time": 5719, "text": "And so it's like, I'm a troll, I'm a troll."}, {"time": 5722, "text": "Okay, why are we doing this?"}, {"time": 5724, "text": "But what I'm trying to get at is different."}, {"time": 5725, "text": "I'm trying to say that Michael Malice is a friend of yours."}, {"time": 5729, "text": "If you found out something terrible, you should still be a friend."}, {"time": 5732, "text": "You should still continue to be his friend."}, {"time": 5734, "text": "And in Michael Malice's case, it's very likely that we'll find out something terrible."}, {"time": 5738, "text": "Curtis is an acquaintance of mine because he hangs around with some people that I know."}, {"time": 5742, "text": "I did not get it."}, {"time": 5744, "text": "I've started to understand why the people in my life, some of them are Curtis Yarvin fans."}, {"time": 5751, "text": "Many of them disregard the stupid stuff."}, {"time": 5754, "text": "But my feeling is that too much poison organ, not enough fish."}, {"time": 5759, "text": "I don't know how to serve that."}, {"time": 5760, "text": "It's too intermingled."}, {"time": 5761, "text": "I'm not your chef."}, {"time": 5762, "text": "Speaking for defending your friends, staying with your friends, and bringing the old band together again, you coined the term IDW, Intellectual Dark Web."}, {"time": 5776, "text": "It represents a certain group of people that are struggling with, that are almost like challenged the norms of social and political discourse from all different angles."}, {"time": 5791, "text": "What do you think is the state of the IDW?"}, {"time": 5793, "text": "What do you think is its future?"}, {"time": 5795, "text": "Is it still a useful?"}, {"time": 5799, "text": "Well, it never exists."}, {"time": 5800, "text": "Is it a protocol?"}, {"time": 5801, "text": "Is it a collection of people featured in an article?"}, {"time": 5804, "text": "What I learned very clearly is that there's a tremendous desire in the internet age to pin people down."}, {"time": 5810, "text": "Well, what do you say?"}, {"time": 5810, "text": "Who's in it?"}, {"time": 5811, "text": "What are the criteria?"}, {"time": 5813, "text": "It's like, I understand."}, {"time": 5815, "text": "You wanna play the demarcation game and you wanna make everything that is demarcated instantly null and void."}, {"time": 5821, "text": "No, thank you."}, {"time": 5822, "text": "So I resisted saying who was in it."}, {"time": 5826, "text": "I resisted saying what it was."}, {"time": 5827, "text": "I resisted saying that Barry Weiss's article was the definitive thing."}, {"time": 5834, "text": "They chose a ridiculous concept for the photographs that we couldn't get out of."}, {"time": 5838, "text": "I did not want those photographs taken."}, {"time": 5840, "text": "They decided that the Pulitzer Prize winning photographer needed to take them all at twilight."}, {"time": 5845, "text": "I don't know, some such thing."}, {"time": 5847, "text": "I didn't even necessarily wanna do the article."}, {"time": 5849, "text": "Barry convinced me that it was the right thing to do."}, {"time": 5852, "text": "Undoubtedly Barry was right."}, {"time": 5853, "text": "I was wrong."}, {"time": 5855, "text": "But the key point is nothing can grow in this environment."}, {"time": 5860, "text": "There's a reason we're not building."}, {"time": 5863, "text": "It does not appear that we found a way to grow anything organic and good and decent that we need right now."}, {"time": 5870, "text": "And that's kind of the key issue."}, {"time": 5873, "text": "Do you mean us as a society?"}, {"time": 5875, "text": "Those of us who wish to have a future for our great grandchildren."}, {"time": 5879, "text": "Let's take the subset of people who are worried about things long after their demise."}, {"time": 5886, "text": "But do you think it's useful to have a term like the IDW to capture some set of people, some set of ideas or maybe principles that capture what I think the IDW, okay, you can say it's not supposed to mean, it doesn't exist, it doesn't mean anything, but to the public, to me, okay, I'll just speak to me, it represented something."}, {"time": 5911, "text": "It represented, I think I just said this to you, in my first attempt to interview the great Eric Weinstein, I said that, I spoke this about you, but IDW in general is trying to point out the elephant in the room or that the emperor has no clothes."}, {"time": 5926, "text": "The set of people that do that in their own way."}, {"time": 5929, "text": "If there are multiple elephants in the room, the point is that the IDW was more interested in seeing the totality of elephants and trying to figure out how do we move forward as opposed to saying I can spot the other guy's elephant in the room, but I can't see my own."}, {"time": 5943, "text": "And in large measure, we didn't represent an institutional base."}, {"time": 5949, "text": "And therefore it wasn't maximally important that we look at our own hypocrisy because we weren't on the institutional spectrum."}, {"time": 5958, "text": "This is where friendship comes into play with the different figures that are loosely associated with IDW is you were somehow responsible for the exact thing that you said, did you hear what, I don't know, I forget, oh, what Sam Harris said about IDW."}, {"time": 5980, "text": "That kind of thing is."}, {"time": 5981, "text": "I chuckled."}, {"time": 5982, "text": "Lovingly or chuckle like, oh."}, {"time": 5986, "text": "I was angry at some people who had said things that caused Sam to say what Sam said about turning his imaginary club membership into the IDW."}, {"time": 5995, "text": "People said very silly things."}, {"time": 5998, "text": "And I think that there is just this confusion that integrity means calling out your friends in front of the world."}, {"time": 6008, "text": "And I've been pretty clear about this."}, {"time": 6012, "text": "I try to choose my friends carefully."}, {"time": 6013, "text": "And if you would like to recuse me because I'm not a source of reliable information, people that I know and love the most, maybe that's reasonable for you."}, {"time": 6023, "text": "Maybe you prefer somebody who was willing to throw a friend under the bus at the first sign of trouble."}, {"time": 6029, "text": "By all means, exit my feed."}, {"time": 6031, "text": "You don't have to subscribe to me."}, {"time": 6033, "text": "If that's your concept of integrity, you're barking up the wrong tree."}, {"time": 6038, "text": "What I will say is that I knew these people well enough to know that they're all flawed."}, {"time": 6044, "text": "Thank you for the callback."}, {"time": 6046, "text": "But the issue is that I love people who are flawed."}, {"time": 6052, "text": "And I love people who have to earn a living, even if you call them a grifter."}, {"time": 6057, "text": "And I love people who like the fact that Donald Trump didn't get us into new wars, even if you call them alt right."}, {"time": 6065, "text": "I love the fact that some people believe in structural oppression and wanna fight it, even if they're not woke, because they don't believe that structural oppression is hiding everywhere."}, {"time": 6079, "text": "I care and love different people in different ways."}, {"time": 6081, "text": "And I think that the overarching thing, Lex, that we're not getting at is that we were sold a bill of goods that you can go through life like an ELISA program with pre programmed responses."}, {"time": 6095, "text": "Well, it's what about ism, it's both sides ism, it's alt right, it's the loony left, it's campus madness."}, {"time": 6104, "text": "It's like, okay, why don't you just empty the entire goddamn magazine?"}, {"time": 6111, "text": "All of those pre recorded snips."}, {"time": 6117, "text": "Now that you've done all of that, now we can have a conversation."}, {"time": 6122, "text": "Your son put it really well, which is we should, in all things, resist labels."}, {"time": 6129, "text": "But we can't deal without labels, we have to generalize."}, {"time": 6135, "text": "But we also have to keep in mind that just in the way in science, you deal with an effective theory that isn't a fundamental one."}, {"time": 6143, "text": "In science, most of our theories, we consider to be effective theories."}, {"time": 6147, "text": "If I generalize about Europe, about women, about Christians, those things have to be understood to mean something and not to have their definitions extend so broadly that they mean nothing at all, nor that they're so rigid that they're claims that clearly won't bear scrutiny."}, {"time": 6175, "text": "Lex, what do you really wanna talk about?"}, {"time": 6176, "text": "That's always my question to you."}, {"time": 6178, "text": "That always gets me, maybe you are the therapist."}, {"time": 6182, "text": "But you and I could talk about anything."}, {"time": 6184, "text": "People love, up until now at least, people have loved listening to the two of us in conversation."}, {"time": 6190, "text": "And my feeling is is that we're not talking about neural nets, and we're not talking about geometric unity, and we're not talking about where distributed computing might go."}, {"time": 6203, "text": "And I don't think that we're really focused on some of the most exciting things we could do to transform education."}, {"time": 6210, "text": "We're still caught in this world of other people that we don't belong in."}, {"time": 6216, "text": "I don't belong in the world as it's been created."}, {"time": 6218, "text": "I'm trying to build a new world, and I'm astounded that the people with the independent means to help build that world are so demotivated that they don't wanna build new structures."}, {"time": 6232, "text": "And the people who do wanna build new structures seem to be wild eyed."}, {"time": 6236, "text": "Wild eyed, what do you mean by wild eyed?"}, {"time": 6238, "text": "They're not, they're not."}, {"time": 6239, "text": "I guarantee you that I will get some message in my DMs that says, hey, Eric."}, {"time": 6243, "text": "You know, I'm a third year chemistry student at South Dakota State, and I've got a great idea."}, {"time": 6251, "text": "I just need funding."}, {"time": 6252, "text": "I wanna build."}, {"time": 6253, "text": "They don't have the means."}, {"time": 6254, "text": "So the people who have the means have become."}, {"time": 6256, "text": "Or the sophistication, it's like you're looking for somebody who's proven themselves a few times to say, you know, I've got $4 billion behind me that's soft circled."}, {"time": 6267, "text": "I wanna figure out what a new university would be and what it would take to protect academic freedom and who we would hire and what are the different characteristics because I can clearly see that everything following the current model is falling apart."}, {"time": 6280, "text": "Nobody in my understanding is saying that."}, {"time": 6283, "text": "Nobody is saying let's take that which is functioning independently and make it less vulnerable."}, {"time": 6293, "text": "Let's boost those signals."}, {"time": 6295, "text": "And a critical component as money, you think?"}, {"time": 6298, "text": "It's not only that, but it's also a kind of these people are mobbed up hands off."}, {"time": 6304, "text": "Let's imagine for the moment that Sundar Pichai, Jack Dorsey, and Mark Zuckerberg founded a university come social media entity."}, {"time": 6317, "text": "And they said, the purpose of this is to make sure that academic freedom will not perish from this earth because it's necessary to keep us from all going crazy."}, {"time": 6326, "text": "And we are going to lock ourselves out."}, {"time": 6329, "text": "We've come up with this governance system."}, {"time": 6332, "text": "And the idea is that these people will be assigned the difficult task of making sure that society doesn't go crazy in any particular direction."}, {"time": 6340, "text": "That we have a fact based, reality based, feasibility based, understaffed, theory based understanding."}, {"time": 6348, "text": "We can try to figure out where our real opportunities are."}, {"time": 6353, "text": "It feels like everybody with the ability to do something like that, and with the brains and experience and the resources, would rather sit in the current system and hope to figure out where they can flee to if the whole thing comes apart."}, {"time": 6370, "text": "Well, yeah, and maybe to push back in a little bit, I agree with you, but you know, it feels like some people are trying that."}, {"time": 6377, "text": "So for example, Google purchased DeepMind."}, {"time": 6381, "text": "DeepMind is a company that kind of represents a lot of radical ideas."}, {"time": 6385, "text": "They've become acceptable, actually."}, {"time": 6387, "text": "AGI, artificial general intelligence, used to be really radical of a thing to talk about."}, {"time": 6395, "text": "And DeepMind and OpenAI are two places which has made it more acceptable."}, {"time": 6399, "text": "I know you can now start to criticize, well, they're really, now that it's become acceptable, they're not taking the further step of being more and more radical."}, {"time": 6409, "text": "But you know, that wasn't an attempt by Google to say that let's try some wild stuff."}, {"time": 6417, "text": "Sort of like Boston Dynamics."}, {"time": 6421, "text": "Boston Dynamics is a really good example of trying radical ideas for perhaps no purpose whatsoever except to try out their ideas."}, {"time": 6433, "text": "Well, the idea is that innovation is like dessert."}, {"time": 6436, "text": "You can have dessert after you solve the problem of the main course, and the main course is a bunch of insoluble problems."}, {"time": 6444, "text": "So the idea is we can get into innovation once we perfect ourselves."}, {"time": 6449, "text": "And you're saying that we need to make innovation the main meal."}, {"time": 6453, "text": "Well, I'm saying that there really is structural oppression."}, {"time": 6457, "text": "I mean, if you train a deep learning system on exclusively white faces, it's gonna get confused."}, {"time": 6467, "text": "So let's not disagree that there are real issues around this."}, {"time": 6472, "text": "In fact, that's an issue of innovation and data."}, {"time": 6475, "text": "Your data should be responsive."}, {"time": 6477, "text": "On the other hand, there are things we can't do anything about that are actually fundamental."}, {"time": 6484, "text": "And those things may have to do with the fact that some of us taste cilantro as soap, and some of us don't."}, {"time": 6494, "text": "Like there are differences between people, and some of them are in the hardware, some of them are in the firmware, some of them are in the software that is the human mind."}, {"time": 6503, "text": "And this completely simplistic idea that every failure of an organization to promote each person who has particular intersexual characteristics, we cannot hold progress hostage to that."}, {"time": 6522, "text": "And you've talked about, perhaps we'll save this for another time because it's such a fascinating conversation."}, {"time": 6527, "text": "You talked about this with Glenn Beck, is the whole sort of stagnation of growth and all that kind of stuff."}, {"time": 6534, "text": "Your idea is that in as much as the current situation is a kind of Ponzi scheme, the current situation in the United States is a kind of Ponzi scheme built on the promise of constant unending innovation, we need to fund the true innovators and encourage them and empower them and sort of culturally say that this is what this country is about is the brilliant minds."}, {"time": 6567, "text": "We're gonna kill each other if we don't grow."}, {"time": 6571, "text": "Growth is like an immune system and you always have pathogens present, but if you don't have growth present, you can't fight the pathogens in your society."}, {"time": 6580, "text": "And right now the pathogens are spreading everywhere."}, {"time": 6583, "text": "So if we don't get growth into our system fairly quickly, we are in really seriously bad shape."}, {"time": 6590, "text": "So it's very important that if I had a horrible person who was capable of building something that would give us all a certain amount of what I've called financial beta to some new technology where we all benefit, let's say quantum computing comes in and everybody, the dry cleaner has a quantum computing angle, right?"}, {"time": 6611, "text": "That's necessary to keep this system that we built going."}, {"time": 6615, "text": "We can try to redesign the system, but our system expects growth and we've started it for growth and the madness that we're seeing is the failure of our immune system to be able to handle the pathogens that have always been present."}, {"time": 6628, "text": "So people can say, well, this was always there."}, {"time": 6630, "text": "Yes, it was."}, {"time": 6631, "text": "What's changed was your immune system."}, {"time": 6634, "text": "We have got to make sure that one, we understand why diversity is potentially really important."}, {"time": 6642, "text": "We have mined certain communities to death."}, {"time": 6645, "text": "You and I are Ashkenazi Jews."}, {"time": 6647, "text": "Everyone knows that Ashkenazi Jews are good at technical stuff."}, {"time": 6652, "text": "We know that the Chinese are good at technical stuff."}, {"time": 6654, "text": "The Indians have many people who are good at technical stuff as the Japanese."}, {"time": 6658, "text": "So I also believe that we have communities where if you think about the Pareto idea of diminishing returns, if you've never mined a community, many of the people you're gonna get at the beginning are gonna be amazing because that community, it's like, did you drill for more oil in Texas?"}, {"time": 6676, "text": "Texas is pretty thoroughly picked over."}, {"time": 6679, "text": "Do you find someplace that's completely insane?"}, {"time": 6683, "text": "Maybe there's oil there, who knows?"}, {"time": 6684, "text": "And in particular, I would like to displace our reliance on our military competitors in Asia in our scientific laboratories with women, with African Americans, with Latinos, people who are in different categories than we have traditionally sourced."}, {"time": 6702, "text": "And I would like to get them the money that the market would normally give these fields were we not using visas in place of payment, right?"}, {"time": 6712, "text": "Now, I have a crazy idea, which is that I play, you and I both play music, and I find the analytic work that I do when I'm trying to figure out chord progressions and symmetries and tritones, all these sorts of things to be very similar to the work that I do when I do physics or math."}, {"time": 6730, "text": "I believe that one of the things that is true is that the analytic contributions of African Americans to music are probably fungible to science."}, {"time": 6740, "text": "I don't know that that's true."}, {"time": 6743, "text": "It's true I haven't done controlled research, but I believe that it is very important to let the People's Republic of China know that they are not staffing our laboratories anymore, and that we need to look to our own people."}, {"time": 6756, "text": "And in particular, we are going to get a huge benefit for making sure that women, Black Americans, Latinos are in a position to take over some of these things because many of these communities have been underutilized."}, {"time": 6772, "text": "Now, I don't know if that's an insane idea."}, {"time": 6798, "text": "Now, part of the problem with this is that a lot of the energy behind diversity and inclusion is based on guilt and accusation."}, {"time": 6806, "text": "And what I want is I want to kick ass, and my hope is that diminishing returns favors mining the communities that have not been traditionally mined in order to extract output from those communities, unless there's a flaw in that plan."}, {"time": 6823, "text": "If there's a flaw, somebody needs to tell me."}, {"time": 6825, "text": "If there isn't a flaw, we need to get greedy about innovation rather than guilty about innovation."}, {"time": 6831, "text": "That's really brilliantly put."}, {"time": 6833, "text": "My biggest problem with what I see is it exactly speaks to that in the discussion of diversity."}, {"time": 6839, "text": "It's used, when it's grounded in guilt, it's then used as a hammer to shame people that don't care about diversity enough."}, {"time": 6846, "text": "F that shit, okay?"}, {"time": 6850, "text": "So my point is I'm excited about the idea of Jimi Hendrix doing quantum field theory."}, {"time": 6855, "text": "I'm excited about the idea of Art Tatum trying to figure out what the neural nets figured out about protein folding."}, {"time": 6866, "text": "I have some idea of the level of intellect of people who have not found their way into STEM subjects in incredibly technically demanding areas."}, {"time": 6875, "text": "And if there's a flaw in that theory, I want somebody to present the flaw."}, {"time": 6880, "text": "But right now, my belief is that these things are merit based."}, {"time": 6885, "text": "And if you really believe in structural oppression, you do not want an affirmative action program."}, {"time": 6891, "text": "You wanna make sure that people have huge amounts of resources to get themselves into position."}, {"time": 6896, "text": "I wanna push out, I just tried this on this Clubhouse application."}, {"time": 6901, "text": "I wanna push out Klein bottles as a secret sign inside of rap videos in hip hop, right?"}, {"time": 6907, "text": "I want people to have an idea that there's an amazing world."}, {"time": 6910, "text": "And I wanna get the people who, hopefully I'm trying to lure into science and engineering."}, {"time": 6916, "text": "I want to get them paid."}, {"time": 6918, "text": "I don't want them as the cheap substitutes for the fleeing white males who've learned that they can't make any money in science and engineering."}, {"time": 6929, "text": "So the problem is that we need to take over the ship Lex."}, {"time": 6934, "text": "And it doesn't need to be you and me because quite honestly, I have no desire to administer."}, {"time": 6938, "text": "I don't wanna be the chief executive officer of anything."}, {"time": 6941, "text": "What I do want is I want the baby boomers who've made this mess and can't see it to be gone."}, {"time": 6948, "text": "They had almost all of our universities and I want fresh blood, fresh resources."}, {"time": 6956, "text": "I want academic freedom and I want greed for our country and for the future to determine diversity inclusion as opposed to shame and guilt, which is destroying our fabric."}, {"time": 6966, "text": "That's as good of a diversity statement as I've ever heard."}, {"time": 6973, "text": "This is a U turn, but somebody commented on the tweet you sent that as one of the top comments, they definitely have to ask you about cryptocurrency."}, {"time": 6984, "text": "So it's a U turn, but not really."}, {"time": 6987, "text": "Since you're an economist, since you're deep, not an economist."}, {"time": 6991, "text": "I mean, I pretend to be an economist, hoping that the economists will take issue that I'm not an economist so that I can advance gauge theoretic and field theoretic economics, which the economics profession has failed to acknowledge was a major innovation that happened approximately 25 years ago."}, {"time": 7009, "text": "I don't think that economists understand what a price index is that measures inflation, nor do I think economists understand what a growth index or a product, a quantity index is that measures GDP."}, {"time": 7024, "text": "I think that they don't even understand the basics of price and quantity index construction."}, {"time": 7030, "text": "And therefore they can't possibly review field theoretic economics."}, {"time": 7037, "text": "They can't review gauge theoretic economics."}, {"time": 7039, "text": "They're intellectually not in a position to manage their own field."}, {"time": 7043, "text": "You talked about that there's a stagnation in growth currently."}, {"time": 7046, "text": "I looked at, from my microeconomics, macroeconomics in college perspective, GDP doesn't seem to capture the productivity, the full, the spectrum of what I think is as a functioning successful society."}, {"time": 7063, "text": "What do you think is broken about GDP?"}, {"time": 7066, "text": "What does it need to include?"}, {"time": 7069, "text": "These indices, like what?"}, {"time": 7071, "text": "Let me explain what they don't understand to begin with."}, {"time": 7074, "text": "Imagine that all prices and all quantities of output are the same at the end of the year as they are at the beginning."}, {"time": 7086, "text": "And you ask what happened during that year?"}, {"time": 7089, "text": "Was there inflation?"}, {"time": 7091, "text": "They meandered over the course of the year, but miraculously they all came back to exactly their values."}, {"time": 7097, "text": "The amount produced at the end of the year is the same as at the beginning in every single quantity."}, {"time": 7104, "text": "Typically the claim would be that the price index should be 1.0 and that the quantity index should be 1.0."}, {"time": 7110, "text": "That's clearly wrong."}, {"time": 7114, "text": "Well, it's much easier to see with, it speaks to a fundamental confusion that economists have."}, {"time": 7121, "text": "They don't understand that the economy is curved and not flat."}, {"time": 7126, "text": "In a curved economy, everything should be path dependence, but they view path dependence as a problem because they are effectively the flat earth society of market analysis."}, {"time": 7137, "text": "They don't understand that what they've called, and they've actually called it the cycling problem, is exactly what they need to understand to advance their field."}, {"time": 7146, "text": "So I'll give you a very simple example, okay?"}, {"time": 7149, "text": "Let's imagine that we have Bob and Carol in one hedge fund and Ted and Alice in another."}, {"time": 7155, "text": "In both cases, the females, that is, Alice and Carol, are the chief investment officers, and Bob and Ted are the chief marketing officers in charge of trying to get money into the fund and trying to get people not to, in fact, remove their money from the funds, okay?"}, {"time": 7178, "text": "If you, in fact, had a hedge fund with Bob and Carol and Ted and Alice, and both hedge funds were invested in assets whose prices came back to the same levels and whose exposures were in the same quantities, and you wanted to compensate these two hedge funds, would you compensate them the same necessarily?"}, {"time": 7206, "text": "What if, for example, Carol was killing it in terms of investments?"}, {"time": 7212, "text": "Every time she bought some sort of security, the price of that security went up, okay?"}, {"time": 7220, "text": "But Bob was the worst marketing officer, and as chief marketing officer, there were tons of redemptions because Bob was constantly drunk, Bob was making off color comments."}, {"time": 7233, "text": "Now, as a result, at the end of the year, the fund hasn't grown in size because even though Carol was crushing it in terms of the investments, Bob was screwing up everything and the redemptions were legendary, so people were making money and still pulling it out of the fund."}, {"time": 7251, "text": "In the other fund, Alice can't seem to buy a base hit every time she gets into a security, the thing plummets, but Ted's amazing marketing skills allowed the fund to get all sorts of new subscriptions and halted the redemptions as people hoped that the fund would get its act together, okay."}, {"time": 7274, "text": "Price indices should be how Carol and Alice are compensated, and quantity indices should be how Bob and Ted are compensated, so even though both funds had closed loops that come back to the original states, what happened during the period that they were active tells you how people are supposed to be compensated."}, {"time": 7307, "text": "Now, we know that whatever the increase in the price index is, is compensated by a decrease in the quantity index or conversely, because prices and quantities return to their original values."}, {"time": 7320, "text": "You could have another fund where nothing much happened, there were no redemptions, no subscriptions, the fund remained in cash the whole time."}, {"time": 7328, "text": "So in that third fund, you know, let's call that Tristan and Isolde, right?"}, {"time": 7333, "text": "That fund should have no bonuses paid because nobody did anything, but nobody should be fired either."}, {"time": 7340, "text": "Now, the fact that the economists don't even understand that this is what their price and quantity indices were intended to do, that they don't understand that you can actually give what would be called ordinal agents the freedom to change their preferences and still have something defined as a CONUS cost of living adjustment."}, {"time": 7361, "text": "They don't even understand the mathematics of their field."}, {"time": 7363, "text": "So the indices need to be able to capture some kind of dynamics that... We have had indices that capture these dynamics due to the work of Francois de Vizier since 1925."}, {"time": 7375, "text": "But the economists have not even understood what de Vizier's index truly represent."}, {"time": 7379, "text": "What do you miss with such crude indices then?"}, {"time": 7384, "text": "Well, you miss the fact that you're supposed to have a field theoretic subject."}, {"time": 7389, "text": "The representative consumer should actually be a probability distribution on the space of all possible consumers weighted by the probability of getting any particular pull from the distribution."}, {"time": 7399, "text": "We should not have a single gauge of inflation."}, {"time": 7403, "text": "What is that in 1973 dollars?"}, {"time": 7405, "text": "Any more than you should be able to say it was 59 degrees Fahrenheit on earth yesterday."}, {"time": 7411, "text": "So when we get to the cryptocurrency, what I'm going to say is that because we didn't found economic theory on the proper marginal revolution, because we missed the major opportunity, which is that the differential calculus of markets is gauge theory."}, {"time": 7428, "text": "It's not ordinary differential calculus."}, {"time": 7433, "text": "We found that out in finance that it was stochastic differential calculus."}, {"time": 7438, "text": "We have the wrong version of the differential calculus underneath all of modern economic theory."}, {"time": 7443, "text": "And part of what I've been pushing for in cryptocurrencies is the idea that we should be understanding that gold is a gauge theory, just as modern economic theory is supposed to be a gauge theory."}, {"time": 7455, "text": "And that we should be looking to liberate cryptocurrencies and more importantly distributed computing from the problem of this unwanted global aspect, which is the blockchain."}, {"time": 7466, "text": "The thing that is most celebrated in some sense about Bitcoin is in fact the reason that I'm least enthusiastic about it."}, {"time": 7473, "text": "I'm hugely enthusiastic about what Satoshi did."}, {"time": 7478, "text": "But it's an intermediate step towards trying to figure out what should digital gold actually be?"}, {"time": 7483, "text": "If physical gold is a collection of up quarks and down quarks in the form of protons and neutrons held together, the quarks by gluons with electrons orbiting and held together by photons with the occasional weak interaction beta decay, all of those are gauge theories."}, {"time": 7502, "text": "So gold is actually coming from gauge theory and markets are coming from gauge theory."}, {"time": 7508, "text": "And the opportunity to do locally enforced conservation laws, which effectively is what a Bitcoin transaction is, should theoretically be founded on a different principle that is not the blockchain."}, {"time": 7521, "text": "It should be a gauge theoretic concept in which effectively the tokens are excitations on a network of computer nodes."}, {"time": 7530, "text": "And the fact that, let's imagine that this is some token."}, {"time": 7535, "text": "By moving it from my custodianship to your custodianship, effectively I pushed that glass as a gauge theory towards your region of the table."}, {"time": 7545, "text": "We should be recognizing the gauge theory is the correct differential calculus for the 21st century."}, {"time": 7551, "text": "In fact, it should have been there in the 20th century."}, {"time": 7553, "text": "You're saying it captures these individual dynamics, much richer."}, {"time": 7558, "text": "Why should my giving you a token have to be, why should we alert the global community in this token that that occurred?"}, {"time": 7566, "text": "You can talk about side chains, you can talk about any means of doing this, but effectively we have a problem, which is if I think about this differently, I have a glass that is extant, you have a glass that is abstent."}, {"time": 7579, "text": "We're supposed to call the constructor method on your glass at the same moment we call the destructor method on my glass in order to have a conservation principle."}, {"time": 7589, "text": "It would be far more efficient to do this with the one system that is known never to throw an exception, which is nature."}, {"time": 7597, "text": "And nature has chosen gauge theory and geometry for her underlying language."}, {"time": 7601, "text": "We now know due to work of Pia Malani at Harvard in economics in the mid 1990s, which I was her coauthor on, but I wish to promote her as well as this being my idea."}, {"time": 7617, "text": "We know that modern economic theory is a naturally occurring gauge theory."}, {"time": 7621, "text": "And the failure of that community to acknowledge that that work occurred and that it was put down for reasons that make no analytic sense is important in particular due to the relatively new innovation of distributed computing and Satoshi's brainchild."}, {"time": 7637, "text": "So you're thinking we need to have the mathematics that captures, that enforces cryptocurrency as a distributed system as opposed to a centralized one where the blockchain says that crypto should be centralized."}, {"time": 7650, "text": "The abundance economy much discussed in Silicon Valley or what's left of it is actually a huge threat to the planet because what it really is is that it is what Marc Andreessen has called software eating the world."}, {"time": 7665, "text": "And what that means is that you're gonna push things from being private goods and services into public goods and services and public goods and services cannot have price and value tied together."}, {"time": 7675, "text": "Ergo, people will produce things of incredible value to the world that they cannot command a price and they will not be able to capture the value that they have created or a significant enough fraction of it."}, {"time": 7687, "text": "The abundance economy is a disaster."}, {"time": 7689, "text": "It will lead to a reduction in human freedom."}, {"time": 7693, "text": "The great innovation of Satoshi is locally enforced or semi locally enforced conservation laws where the idea is just as gold is hard, why is gold hard to create or destroy?"}, {"time": 7704, "text": "It's because it's created not only in stars but in violent events involving stars like supernova collisions."}, {"time": 7711, "text": "When gold is created and we transact, we're using conservation laws."}, {"time": 7718, "text": "The physics determines the custodianship, whatever it is that I don't have, you now have and conversely, in such a situation, we should be looking for the abstraction that most closely matches the physical world because the physical world is known not to throw an exception."}, {"time": 7735, "text": "The blockchain is a vulnerability."}, {"time": 7737, "text": "The idea that the 51% problem isn't solved, that you could have crazy race conditions, all of these things, we know that they're solved inside of gauge theory somehow."}, {"time": 7750, "text": "So the important thing is to recognize that one of the greatest intellectual feats ever in the history of economic theory took place already and was essentially instantly buried and I will stand by those comments."}, {"time": 7764, "text": "Satoshi, wherever you are, I probably know you."}, {"time": 7768, "text": "Are you Satoshi?"}, {"time": 7771, "text": "No, no, no, I don't have that kind of ability."}, {"time": 7774, "text": "I do other things."}, {"time": 7776, "text": "Speaking of Satoshi and gauge theory, you've mentioned to Brian Keating that you may be releasing a geometric unity paper this year or some other form of additional material on the topic."}, {"time": 7791, "text": "What is your thinking around this?"}, {"time": 7794, "text": "What's the process you're going through now in preparing this?"}, {"time": 7798, "text": "I used April 1st to try to start a tradition which I hope to use to liberate mankind."}, {"time": 7804, "text": "The tradition is that at least one day a year, you should be able to say heretical things and not have Jack Dorsey boot you off or Mark Zuckerberg."}, {"time": 7816, "text": "Your provost shouldn't call you up and say, what did you say?"}, {"time": 7820, "text": "We need at some level to have a jubilee from centralized control."}, {"time": 7826, "text": "And so my hope is that, you know what a tradition is in America?"}, {"time": 7830, "text": "Something a baby boomer did twice."}, {"time": 7835, "text": "Impeachment."}, {"time": 7837, "text": "That's very funny."}, {"time": 7841, "text": "Anyway, so I'm not a baby boomer, but as an exer, I've thought about whether or not April 1st would be a good date on which to release a printed version of what I already said in lecture form."}, {"time": 7855, "text": "Because I think it's hysterically funny that the physics community claims that it can't decode a lecture."}, {"time": 7863, "text": "It must be paper."}, {"time": 7865, "text": "There will be a steady stream of new complaints up until the point that they fit it into a narrative that they like."}, {"time": 7873, "text": "Yeah, I'm thinking about April 1st as a date in which to release a document and it won't be perfectly complete, but it'll be very complete."}, {"time": 7882, "text": "And then they'll try to say, it's wrong."}, {"time": 7886, "text": "Or you already did it."}, {"time": 7887, "text": "Or no, that was dumb, but what we just did on top of it is brilliant."}, {"time": 7891, "text": "Or it doesn't match experiment."}, {"time": 7894, "text": "Or who knows what."}, {"time": 7895, "text": "They'll go through all of their usual nonsense."}, {"time": 7900, "text": "Is there still puzzles in your own mind that need to be figured out for you to try to put it on paper?"}, {"time": 7906, "text": "I mean, those are different mediums, right?"}, {"time": 7908, "text": "It was a great question."}, {"time": 7910, "text": "I did not count on something that turns out to be important."}, {"time": 7914, "text": "When you work on your own outside of the system for a long time, you probably don't think you're gonna be doing this as a 55 year old man."}, {"time": 7923, "text": "And I have been so long outside of math and physics departments, and I've been occupied with so many other things as you can see, that the old idea that I had was if I always did it in little pieces, then I was always safe because it wouldn't be stealable."}, {"time": 7941, "text": "And so now those pieces never got assembled completely."}, {"time": 7946, "text": "In essence, I have all the pieces and I can fit them together."}, {"time": 7952, "text": "But there's probably a small amount of glue code."}, {"time": 7955, "text": "Like there are a few algebraic things I've forgotten how to do."}, {"time": 7958, "text": "I may or may not figure them out between now and April 1st."}, {"time": 7961, "text": "But it's pretty complete."}, {"time": 7963, "text": "But that's the puzzle you're kind of struggling to now figure out, to get it all in the same, the glue together."}, {"time": 7970, "text": "I can't tell you whether the theory is correct or incorrect."}, {"time": 7974, "text": "But for example, there's what's the exact form of the supersymmetry algebra, or what's the rule for passing a minus sign through a particular operator."}, {"time": 7982, "text": "And all of that stuff got a lot more difficult because I didn't do it every, look, it's a little bit like if you're a violinist and you don't touch your violin regularly for 15 years, you come back to it and you pretty much know the pieces, sort of, but there's lots of stuff that's missing, your tone is off and that kind of stuff."}, {"time": 8004, "text": "I would say I'll get the ship to the harbor and it'll require a tugboat probably to get it in."}, {"time": 8010, "text": "And if the tugboat doesn't show up, then I'll pilot the thing right into the dock myself."}, {"time": 8014, "text": "But it's not a big deal."}, {"time": 8015, "text": "I think that it is essentially complete."}, {"time": 8018, "text": "Psychologically, just as a human being, this is, I remember perhaps by accident, but maybe there's no accidents in the universe."}, {"time": 8028, "text": "I was tuned in, I don't remember where, on April 1st to you, oh, I think on your Discord, kind of thinking about, thinking through this release."}, {"time": 8040, "text": "I mean, it wasn't like, it wasn't obvious that you were going to do it, you were thinking through it."}, {"time": 8045, "text": "And I remember there was intellectual, personal, psychological struggle with this, right?"}, {"time": 8051, "text": "Well, because I thought it was dangerous."}, {"time": 8053, "text": "If this turns out to be right, I don't know what it unlocks."}, {"time": 8056, "text": "If it's wrong, I think I understand where we are."}, {"time": 8063, "text": "If it's wrong, it'll be the first fool's gold that really looks like a theory of everything."}, {"time": 8073, "text": "It'll be the iron pyrites of physics."}, {"time": 8075, "text": "And we haven't even had fool's gold in my opinion yet."}, {"time": 8080, "text": "So what is your intuition why this looks right to you?"}, {"time": 8085, "text": "Like why it feels like it would be, if wrong, the first fool's gold."}, {"time": 8089, "text": "I can say it very simply."}, {"time": 8091, "text": "It's way smarter than I am."}, {"time": 8093, "text": "Can you break that apart a little more?"}, {"time": 8095, "text": "Every time you poke at it, it's giving you intuitions that follow with the currently known physics."}, {"time": 8100, "text": "Let's put it in computer science terms."}, {"time": 8103, "text": "Okay, there's a concept of technical debt that computer scientists struggle with."}, {"time": 8107, "text": "As you commit crimes, you have to pay those crimes back at a later date."}, {"time": 8111, "text": "In general, most of the problem with physical theories is that as you try to do something that matches reality, you usually have to go into some structure that gets you farther away."}, {"time": 8125, "text": "And your hope is, is that you're gonna be able to pay back the technical debt."}, {"time": 8128, "text": "And in general, these wind up as check hiding schemes or like you're funding a startup and there are too many pivots, right?"}, {"time": 8137, "text": "So you keep adding epicycles in order to cover, things that have gone wrong."}, {"time": 8144, "text": "My belief is, is that this thing represents something like a summit to me."}, {"time": 8153, "text": "And I'm very proud of having found a route up this summit."}, {"time": 8158, "text": "But the root is what's due to me."}, {"time": 8161, "text": "The summit can't possibly be due to me."}, {"time": 8166, "text": "You know, like Edmund Hillary and Tenzing Norgay did not create Mount Everest."}, {"time": 8173, "text": "They know that they didn't create that."}, {"time": 8174, "text": "They figured out a way up."}, {"time": 8178, "text": "You gotta tell me what Mount Everest is in this metaphor relative and also connected to the technical debt."}, {"time": 8184, "text": "So technical debt is a negative thing that it's kind of, you will eventually have to pay it."}, {"time": 8190, "text": "Are you saying in the, in the ascent that you're seeing now in the theory is you do not have much technical debt."}, {"time": 8198, "text": "That what happens is, is that early on what I would say is, I believe now that the physics community has said many things incorrectly about the current state of the universe."}, {"time": 8214, "text": "They're not wildly off, which is why, like for example, the claim is that there are three generations of matter."}, {"time": 8221, "text": "I do not believe that there are three generations of matter."}, {"time": 8223, "text": "I believe that there are two generations of matter and there's a third collection that looks like a generation of matter as the first two, only at low energy."}, {"time": 8235, "text": "Okay, well, that's not a frequent claim."}, {"time": 8238, "text": "People imagine that there are three or more generations of matter."}, {"time": 8241, "text": "I would claim that that's false."}, {"time": 8243, "text": "People claim that the matter is chiral."}, {"time": 8245, "text": "That is, it knows it's left from its right."}, {"time": 8248, "text": "I would claim that the chirality is not fundamental, but it is emergent."}, {"time": 8252, "text": "But we could keep going at all these sorts of things."}, {"time": 8256, "text": "People think that space time is the fundamental geometrical construct."}, {"time": 8261, "text": "I do not agree."}, {"time": 8262, "text": "I think it's something that I've termed the observers."}, {"time": 8265, "text": "All of these different things represent a series of overinterpretations of the world that preclude progress."}, {"time": 8276, "text": "So you gave, I think you gave some credit to string theory as, string theory, I think loop quantum gravity, if I remember correctly, as like getting close to the fool's gold."}, {"time": 8291, "text": "Well, I said that Garrett Lisi, phenomenologically, gets a lot of things right."}, {"time": 8298, "text": "He gets, he's got a reason for chirality, a reason for uniqueness using E8."}, {"time": 8303, "text": "In fact, E8 uses something called vial fermions, which are chiral."}, {"time": 8307, "text": "He has a way of getting geometry to get Riemann's geometry underneath general relativity to play with Erisman's geometry, which is underneath the standard model, using something called Cartan connections that are out of favor."}, {"time": 8322, "text": "He's figured out something involving super connections to make sure that the fermion, the matter in the system isn't quantized the same way as the bosons were, which is a problem in his old theory."}, {"time": 8333, "text": "He's got something about three generations for triality."}, {"time": 8336, "text": "He's got a lot of phenomenological hits."}, {"time": 8339, "text": "I don't think Garrett's theory works."}, {"time": 8341, "text": "It also has a very simple Lagrangian."}, {"time": 8342, "text": "He's basically using the Yang Mills norm squared, the same thing you would use as a cost function if you were doing neural nets, okay?"}, {"time": 8354, "text": "The string theorists have a different selling point, which is that they may have gotten a renormalizable theory of gravity if quantum gravity was what we were meant to do."}, {"time": 8362, "text": "And they've done some stuff with black holes that they can get some solutions correct."}, {"time": 8368, "text": "And then they have lots of agreements with where they show mathematical truths that mathematicians didn't even know."}, {"time": 8376, "text": "I'm very underwhelmed by string theory based on how many people have worked on it and how little is supporting the claims to it being a theory of everything."}, {"time": 8385, "text": "But those are the two that I take quite seriously."}, {"time": 8390, "text": "I don't yet take Wolfram's quite seriously because if he really finds one of these cellular automata that are really distinct and generative, it'll be amazing."}, {"time": 8401, "text": "But he's looking for such a thing."}, {"time": 8402, "text": "I don't think he's found anything."}, {"time": 8405, "text": "Tegmark, I view as a philosopher who is somehow taking credit for Platonism, which I don't see any reason for fighting with Max because I like Max, but if it ever comes time, I'm putting a post it note that I'm not positive the mathematical universe hypothesis is really anything new."}, {"time": 8424, "text": "And in general, loop quantum gravity really, I think grew out of some hopes that the general relativistic community had that they would be able to do particle theory."}, {"time": 8434, "text": "And I don't think that they've shown any particle theoretic realism."}, {"time": 8437, "text": "So essentially, here's what I really think, Lex."}, {"time": 8444, "text": "I think we didn't understand how big the difference between an effective theory and a theory of everything is conceptually."}, {"time": 8451, "text": "Maybe it's not mathematically that different, but conceptually trying to figure out what a theory of every, how does the universe, and I've compared it to Escher's drawing hands."}, {"time": 8461, "text": "How do two hands draw themselves into existence?"}, {"time": 8464, "text": "That's the puzzle that I think has just been wanting."}, {"time": 8468, "text": "And I'll be honest, I'm really surprised that the theoretical physics community didn't even get up on their high horse and say, this is the most stupid nonsense imaginable, because clearly I always say I'm not a physicist."}, {"time": 8488, "text": "So I'm an amateur with a heart as big as all outdoors."}, {"time": 8493, "text": "So in your journey of releasing this, and I'm sure further maybe it will be another American tradition on April 1st that will continue for years to come."}, {"time": 8509, "text": "There's sort of crumbs along the way that I'm hoping to collect in my naive view of things of the beauty that, in your geometric view of the universe."}, {"time": 8523, "text": "So one question I'd like to ask is if you were to challenge me to visualize something beautiful, something important about geometric unity in my struggle to appreciate some of its beauty from the outsider's perspective, what would that thing be?"}, {"time": 8547, "text": "Perhaps we can both have a journey towards April 1st."}, {"time": 8555, "text": "Take a look at that."}, {"time": 8558, "text": "Some kind of a scrunchie that I picked up on Melrose, not Melrose, Montana in Santa Monica."}, {"time": 8565, "text": "Now you'll notice that all of those disks rotate independently."}, {"time": 8574, "text": "If you rotate groups of those in a way that is continuous, but not uniform everywhere, what you're doing is a so called gauge transformation on the torus seen as a U1 bundle over a U1 space time."}, {"time": 8589, "text": "So the concept of space time here in a very simplified case isn't four dimensional, but it's one dimensional, it's just a circle."}, {"time": 8598, "text": "And there's a circle above every point in the circle represented by those little disks."}, {"time": 8603, "text": "So imagine if you will, that we took a rubber band and placed it around here and decided that that was a function from the circle into the circle that is representing a Y axis that's wrapped around itself."}, {"time": 8624, "text": "Well, you would have an idea of what it means for a function to be constant, if it just went all around the outside."}, {"time": 8630, "text": "But what happens if I turn this a little bit?"}, {"time": 8633, "text": "Then the function would be mostly constant."}, {"time": 8635, "text": "We'd have a little place where it dipped and it went back."}, {"time": 8638, "text": "It turns out that you can transform that function and transform the derivative that says that function is equal to zero when I take its derivative at the same time."}, {"time": 8651, "text": "That's what a gauge transformation is."}, {"time": 8654, "text": "Amazing to me that we don't have a simple video, visualizing things that I've already had built and that I can clearly demonstrate."}, {"time": 8666, "text": "When you do that Taurus, who's the code of the Taurus is itself generating."}, {"time": 8671, "text": "The Taurus."}, {"time": 8672, "text": "The spinning Taurus."}, {"time": 8674, "text": "This is a U1 principle bundle."}, {"time": 8676, "text": "And the world needs to know what a gauge theory is, not by analogy, not with Lawrence Krauss saying, it's like a checkerboard."}, {"time": 8682, "text": "If you change some of the colors this way, not saying that it's a local symmetry involving, it's none of those things."}, {"time": 8691, "text": "It's a theory of differential calculus where the functions and the derivatives are both subject to a particular kind of change so that if a function was constant under one derivative, then the new function is constant under the new derivative transformed in the same fashion."}, {"time": 8709, "text": "And would you put that under the category of just gauge transformations?"}, {"time": 8712, "text": "Yes, that would be gauge transformations applied to sections and connections where connections are the derivatives in the theory."}, {"time": 8721, "text": "This is easily explained."}, {"time": 8723, "text": "It is pathological that the community of people who understand what I'm saying have never bothered to do this in a clear fashion for the general public."}, {"time": 8731, "text": "You and I could visualize this overnight."}, {"time": 8735, "text": "This is not hard."}, {"time": 8738, "text": "The public needs to know in some sense that let's say quantum electrodynamics, the theory of photons and electrons, more or less electrons are functions and photons are derivatives."}, {"time": 8750, "text": "Now there's some, you can object in some ways, but basically a gauge theory is the way in which you can translate a shift in the definition of the functions and the shift of the definition of the derivatives so that the underlying physics is not harmed or changed."}, {"time": 8768, "text": "So you have to do both at the same time."}, {"time": 8770, "text": "Now you and I can visualize that."}, {"time": 8772, "text": "So if what you wanted to do rather than going directly to geometric unity is that I could sit down with you and I could say here are the various components of geometric unity and if the public needs a visualization in order to play along, we've got a little over two months and I'd be happy to work with you."}, {"time": 8789, "text": "I love that as a challenge and I'll take it on and I hope we do make it happen."}, {"time": 8793, "text": "And David Goggins, if Lex doesn't do some super macho thing because he's gotta work to get some of this stuff done, you'll understand he'll be available to you after April."}, {"time": 8805, "text": "Thank you for the escape clause."}, {"time": 8807, "text": "I really needed that escape clause."}, {"time": 8809, "text": "I'm glad that's on record."}, {"time": 8810, "text": "I'm worried 48 miles in 48 hours."}, {"time": 8813, "text": "By the way, I just wanna say how much I admire your willingness to keep this kind of hardcore attitude."}, {"time": 8821, "text": "I know that Russians have it and Russian Jews have it in spades, but it's harder to do in a society that's sloppy and that's weak and that's lazy."}, {"time": 8831, "text": "And the fact that you bring so much heart to saying, I'm gonna bring this to jujitsu, I'm gonna bring this to guitar, I'm gonna bring this to AI, I'm gonna bring this to podcasting."}, {"time": 8841, "text": "It comes through loud and clear."}, {"time": 8842, "text": "I just find it completely and utterly inspiring that you keep this kind of hardcore aspect at the same time that you're the guy who's extolling the virtue of love in a modern society and doing it at scale."}, {"time": 8854, "text": "That means a lot."}, {"time": 8854, "text": "I don't know why I'm doing it, but I'm just following my heart on it and just going with the gut."}, {"time": 8860, "text": "It seems to make sense somehow."}, {"time": 8863, "text": "I personally think we better get tougher or we're gonna get in a world of pain."}, {"time": 8867, "text": "And I do think that when it comes time to lead, it's great to have people who you know don't crack under pressure."}, {"time": 8875, "text": "Do you mind if we talk about love and what it takes to be a father for a bit?"}, {"time": 8882, "text": "Do you mind if Zev joins us?"}, {"time": 8883, "text": "I'd be an honor."}, {"time": 8887, "text": "So Eric, I've talked to your son Zev, who's an incredible human being, but let me ask you, this might be difficult because you're both sitting together."}, {"time": 8904, "text": "What advice do you have for him as he makes his way in this world, especially given that, as we mentioned before on Joe Rogan, you're flawed in that just like all humans, you're mortal."}, {"time": 8919, "text": "Well, at some level, I guess one of my issues is that I've got to stop giving quite so much advice."}, {"time": 8928, "text": "Early on, I was very worried that I could see Zev's abilities and I could see his challenges and I saw them in terms of myself."}, {"time": 8937, "text": "So a certain amount of Zev rhymes with whatever I went through as a kid."}, {"time": 8942, "text": "And I don't wanna doom him to the same outcomes that sufficed for me."}, {"time": 8948, "text": "I think that he's got a much better head on his shoulders at age 15, he's much better adjusted."}, {"time": 8954, "text": "And in part, it's important for me to recognize that because I think I did a reasonably decent job early on, I don't need to get this part right."}, {"time": 8966, "text": "And I'm looking at Zev's trajectory and saying, you're gonna need to be incredibly and even pathologically self confident."}, {"time": 8978, "text": "The antidote for that is gonna be something you're gonna need to carry on board, which is radical humility."}, {"time": 8985, "text": "And you're gonna have to have those in a dialectical tension, which is never resolved, which is a huge burden."}, {"time": 8991, "text": "You are going to have to forgive people who do not appreciate your gifts because your gifts are clearly evident."}, {"time": 8997, "text": "And many people will have to pretend not to see them because if they see your gifts, then they're gonna have to question their entire approach to education or employment or critical thinking."}, {"time": 9008, "text": "And what my hope is, is that you can just forgive those who don't see them and who complicate and frustrate your life and realize that you're gonna have to take care of them too."}, {"time": 9018, "text": "Zev, let me ask you the more challenging question because the guy's sitting right here."}, {"time": 9022, "text": "What advice do you have for your dad?"}, {"time": 9025, "text": "Since after talking to you, I realize you're the more brilliant aside from the better looking member of the family."}, {"time": 9038, "text": "It's a bit of an odd question."}, {"time": 9043, "text": "You can say anything you want."}, {"time": 9044, "text": "This is the last time we're gonna be seeing left."}, {"time": 9046, "text": "It's gonna be an awkward drive home."}]}]