[{"title": "Travis Stevens: Judo, Olympics, and Mental Toughness | Lex Fridman Podcast #223", "id": "uiNpESmPioQ", "quotes": [{"time": 397, "text": "Cause that just shows that that person has really outclassed you."}, {"time": 401, "text": "Right, so there's like a set of, a small set of throws."}, {"time": 404, "text": "Maybe we can go through them that are like, you saw it coming, but you couldn't do anything about it."}, {"time": 409, "text": "And then there's the set of throws that are more like surprises."}, {"time": 413, "text": "So first of all, the counters, or if you fake one thing and go the other way, then that's a surprise and it's like, oh shit."}, {"time": 420, "text": "You off balance the person because they think you're going one way and then you go the other way."}, {"time": 425, "text": "And then there's this, oh shit moment."}, {"time": 426, "text": "All of a sudden your back is just slammed on the ground."}, {"time": 430, "text": "One of the ones, I mean, you're good at many throws, but one of them is a, that I think reveals the beauty of judo is the foot sweep."}, {"time": 439, "text": "There's something about the off balance and the timing that if you catch them right, all of a sudden, it's like I had the same feeling when I went skydiving, like all of a sudden the ground is not under you anymore."}, {"time": 449, "text": "Yeah, and you just, you go weightlessness for like a split second and you realize you've lost like all control of your limbs."}, {"time": 455, "text": "Like it's like zero gravity, right?"}, {"time": 458, "text": "Like you just, you can't turn, you can't rotate, you can't do much of anything."}, {"time": 462, "text": "And then before you know it, you've hit the floor."}, {"time": 465, "text": "It's a cool feeling when you get thrown because you hope to do the same thing to another person."}, {"time": 471, "text": "It's like, you just hit the ground hard because it's not, you didn't see it coming."}, {"time": 476, "text": "It wasn't a big throw that got loaded up."}, {"time": 478, "text": "It's like all of a sudden the surprise."}, {"time": 481, "text": "And then like this, like feeling your back just slams and there's like the air is up."}, {"time": 487, "text": "Yeah, and the worst is when you get hit twice with one throw, right?"}, {"time": 491, "text": "Because sometimes like the guy throwing you didn't expect you to leave either."}, {"time": 495, "text": "So you hit and then that guy comes down like a second and a half later and it's like, boom, boom."}, {"time": 501, "text": "And then the wind is just gone from you."}, {"time": 504, "text": "Those are the worst."}, {"time": 505, "text": "And then there's the disappointment."}, {"time": 506, "text": "Like then the intellectual, the cognitive part comes in where you're like, oh shit, I just lost."}, {"time": 513, "text": "And you don't have like a connection to why, right?"}, {"time": 517, "text": "It's almost like you've just, like you didn't literally get a concussion."}, {"time": 519, "text": "Like you understand and remember everything, but you can't figure out how this just happened, right?"}, {"time": 526, "text": "Those are the tough ones to deal with."}, {"time": 529, "text": "Actually, have you had moments like that where you don't understand how it happened?"}, {"time": 533, "text": "You have to watch footage to understand what happened?"}, {"time": 535, "text": "Even when you watch it, you're just like, I don't get it."}, {"time": 538, "text": "Like, why wasn't I in a position to stop this?"}, {"time": 543, "text": "It makes zero sense."}, {"time": 546, "text": "Conceptually, when you watch it, you're like, I understand how to play defense."}, {"time": 550, "text": "I understand, it looks like I'm in a defensive position, but at the end of the day, I still got thrown."}, {"time": 558, "text": "Yeah, you were talking about, what is it, a 2008 match."}, {"time": 562, "text": "You have a non traditional gripping style."}, {"time": 566, "text": "Is that accurate to say?"}, {"time": 567, "text": "And then you were going against another right handed player and then there was some kind of fake that he did and then he caught you."}, {"time": 576, "text": "Can you describe the throw he caught you with?"}, {"time": 578, "text": "He caught me with a drop sale, but he kind of like, we were engaged."}, {"time": 585, "text": "We were looking at each other and we were kind of at like a stalemate, right?"}, {"time": 590, "text": "He couldn't really advance, I couldn't really advance."}, {"time": 593, "text": "And he kind of just let his gaze like wander off to the right, like he was looking at something."}, {"time": 598, "text": "And then I kind of like, what's over there?"}, {"time": 601, "text": "And then I got thrown and it's like."}, {"time": 604, "text": "So first of all, for people who don't know, Seio's Seinagi drop means when you drop to your knees and Seinagi is one of the fundamental throws of Judo."}, {"time": 614, "text": "There's just a handful, but does that actually ever work?"}, {"time": 618, "text": "I always wondered that about like boxing or Judo."}, {"time": 622, "text": "Does the head movement of the person work?"}, {"time": 625, "text": "Cause we're still like kind of dogs at heart."}, {"time": 627, "text": "If you look somewhere with a dog, the dog is going to look that direction as well."}, {"time": 631, "text": "Does that actually work ever?"}, {"time": 633, "text": "It does, but on a greater sense, what you try to do is not necessarily get like a physical reaction of a look, but a lull of security where like, they've almost like relaxed for that split second because you've lured them into like a sense of comfort."}, {"time": 652, "text": "And then that's when you can strike."}, {"time": 655, "text": "So you have this, speaking of Seinagi, you have this gigantic standing Seinagi."}, {"time": 662, "text": "And you have a specific grip."}, {"time": 665, "text": "One of our challenges is there's a large number of people that listen to the audio version of this."}, {"time": 670, "text": "So we're gonna have to try to describe some of this stuff."}, {"time": 673, "text": "I'll do my best to try to describe with words, but you have, you grip with your left hand on the lapel of the jacket or like that area."}, {"time": 683, "text": "And there's kind of a lean into the person."}, {"time": 687, "text": "And I suppose, is there a feeling of a lull there that you're trying to get to where you're just, it feels like you're both calmly dancing before you turn your hips and go in for the throw?"}, {"time": 696, "text": "I'm actually trying to create a sense of weightlessness for my lead leg, which would be my right leg."}, {"time": 706, "text": "And a sense of resistance from my partner."}, {"time": 712, "text": "So aren't you both kind of leaning into each other?"}, {"time": 715, "text": "And it creates like an A frame."}, {"time": 718, "text": "But when the A frame is held together at the top half, which would be my left hand and their right hand posted on each other's chest, it means our legs are free to move and our hips are free to move."}, {"time": 728, "text": "And they're not gonna feel your leg move."}, {"time": 730, "text": "Because of the weightlessness."}, {"time": 732, "text": "And is there a feeling like, for them, is there a feeling like nothing bad can happen here?"}, {"time": 736, "text": "We're all relaxed, everything's fine?"}, {"time": 739, "text": "And then they're standing off at a funny angle and before they know it, I've spun and my back is on their chest and they can't go anywhere."}, {"time": 747, "text": "How did you first develop that throw?"}, {"time": 749, "text": "So for people, it's called Ippon Seinagi, which means your right hand goes under their armpit area."}, {"time": 756, "text": "And that's like a vice that connects you to them."}, {"time": 761, "text": "And then they go on for the ride."}, {"time": 764, "text": "The interesting thing with the standing one is as opposed to drop Seinagi version, the drop Seinagi, you kind of drop under them."}, {"time": 774, "text": "And because there's a vice, they're like pulled under and like over."}, {"time": 780, "text": "With the standing one, I suppose there's some similar physics, but you're kind of loading them onto your hip."}, {"time": 787, "text": "And so they're in the air while you're standing still."}, {"time": 791, "text": "There's a sense in which they're like, you're lifting them above where they started."}, {"time": 799, "text": "That's how you get the really big air."}, {"time": 803, "text": "If obviously, if everything is right."}, {"time": 807, "text": "So how did you first develop that?"}, {"time": 808, "text": "How did you first?"}, {"time": 809, "text": "I first learned just learning like the very basics of the throw, you know, foot placement, all that kind of stuff."}, {"time": 816, "text": "And then, you know, like anything, the basics are nice, but once you get good at the basics, it's very easy to stop, but it gives you a good like fundamental platform to learn off of and to expand off of."}, {"time": 831, "text": "And then I expanded when I first started watching Koga, the new wind, right?"}, {"time": 836, "text": "Cause he's the one that first like introduced that split hip style Seinagi that I do."}, {"time": 842, "text": "Once I learned that one, I built about eight different variations of Seio off that one start position."}, {"time": 853, "text": "That way I could, regardless of your defense, I had an answer for a throw."}, {"time": 858, "text": "So why that one though?"}, {"time": 859, "text": "Why, can you describe love to me, Travis Stevens?"}, {"time": 862, "text": "Why'd you fall in love with that throw in particular?"}, {"time": 866, "text": "It was really a sense of, you know, one of my shortcomings as a kid, like, I hate leg day in the gym."}, {"time": 875, "text": "I hate it with a passion."}, {"time": 877, "text": "I, if you asked me to do a squat, I'll get it done, but I will bitch and moan every step of the way."}, {"time": 884, "text": "I hate it."}, {"time": 884, "text": "I remember one time I was at the gym with my trainer and he goes, okay, we're going to do front squats."}, {"time": 888, "text": "And I want you to put 225 on the bar."}, {"time": 890, "text": "And I was like, I can't do that."}, {"time": 892, "text": "And he was like, what do you mean you can't do that?"}, {"time": 894, "text": "And I go, I physically, I can't do that."}, {"time": 898, "text": "And he was like, are you serious?"}, {"time": 900, "text": "And I go, yeah."}, {"time": 901, "text": "So he's, he didn't believe me."}, {"time": 902, "text": "We put 225 on the bar and I bottomed out."}, {"time": 905, "text": "And then he was like, okay, let's go down to 185."}, {"time": 908, "text": "I just, that's not happening."}, {"time": 910, "text": "You probably could, strength wise, you just refuse."}, {"time": 912, "text": "I just mentally, I cannot wrap my head around like, this ain't happening."}, {"time": 916, "text": "I'm not doing it."}, {"time": 917, "text": "So I ended up with like 95 pounds on the bar."}, {"time": 921, "text": "I got you at a front squat, no problem."}, {"time": 923, "text": "By the way, body weight squats are rough too, psychologically."}, {"time": 927, "text": "So yeah, I just, when it comes to my legs, like I want no part of like leg pressing, single leg squats, split squat, any of that, I want no part of it."}, {"time": 936, "text": "So you think like the more traditional variants of Sanagi require you to have that leg strength, that mass."}, {"time": 943, "text": "Like when you watch Japanese Judo players, like their thighs and their hips, they're thick."}, {"time": 948, "text": "They got a lot of power there."}, {"time": 950, "text": "So you're almost like always dropping a little bit into a squat position."}, {"time": 954, "text": "For mine, never."}, {"time": 955, "text": "No, no, no, not you, sorry."}, {"time": 956, "text": "For the traditional ones."}, {"time": 958, "text": "And so the split hip, the split hip actually allows me to keep my legs straight."}, {"time": 963, "text": "And the farther I split my legs, the lower my center of gravity goes."}, {"time": 967, "text": "Now I don't need my legs."}, {"time": 972, "text": "So that's the way you were thinking about it."}, {"time": 974, "text": "But it's, you know, the interesting thing about it is because, you know, as I mentioned to you, I've gotten to Judo after first watching you in the Olympics and then watching Koga as well."}, {"time": 986, "text": "And so you start imitating the people you foresee and then you take it to Judo coaches and they're like, no, no, no, no, that's the wrong way to do it."}, {"time": 994, "text": "And happens all the time."}, {"time": 996, "text": "It drives me nuts, drives me nuts."}, {"time": 998, "text": "I was in Poland one time teaching a camp and I had two coaches anti coaching, telling their kids not to do Seio the way I do it because it never works."}, {"time": 1011, "text": "How do you have the fortitude and the guts to just go on with a throw that's not traditional, a variant that's not traditional?"}, {"time": 1021, "text": "If you think about it, you know, from a very basic like root of it, there's a philosophy and a mentality of Judo of how the throws work, right?"}, {"time": 1033, "text": "There's a mechanical structure there of like, this makes sense."}, {"time": 1038, "text": "If I follow that principle, I can do anything I want."}, {"time": 1043, "text": "As long as we follow those core principles."}, {"time": 1045, "text": "So in the early days, even then, you were able to think on your own."}, {"time": 1049, "text": "Yeah, and I was able to develop a pattern for my foot placement based on my opponent's height."}, {"time": 1056, "text": "Because the number one thing any Judo coach would tell you is you need your center of gravity below yours."}, {"time": 1062, "text": "Well, now I know exactly where to put my feet because the shorter you are, the bigger the split because the lower I need to get."}, {"time": 1069, "text": "The taller you are, the less of a split I need."}, {"time": 1072, "text": "Is there something you could say about fundamental principles of Judo?"}, {"time": 1077, "text": "Is there, over all that time, not over 20 years that you've been doing Judo, it's not approaching 30, is it?"}, {"time": 1086, "text": "Yeah, it's getting there."}, {"time": 1089, "text": "Okay, it's getting there."}, {"time": 1090, "text": "We're a couple years away, but it's getting there."}, {"time": 1093, "text": "Is there some like principles that have emerged?"}, {"time": 1097, "text": "Like you said, you have to have your center of gravity below theirs."}, {"time": 1101, "text": "Is there other kind of, both on the gripping side, the footwork side, leverage, anything you can speak to?"}, {"time": 1108, "text": "There's some that have withstood like time, like you have to be able to get below their center of gravity because you have to be able to rotate them around their center of gravity."}, {"time": 1120, "text": "And then the other one is, that was always a principle when I was growing up and I didn't change until later on in my career was, you have to be able to pull."}, {"time": 1130, "text": "You need to be able to pull to get them off balance."}, {"time": 1133, "text": "But when you think about that statement as a whole, it ended with, they have to be off balance."}, {"time": 1139, "text": "I don't need to pull to get you off balance."}, {"time": 1141, "text": "I just need you off balance."}, {"time": 1144, "text": "And when you think about it that way, it allows you to open up the doors to, what do I need to do to get you off balance?"}, {"time": 1151, "text": "I could push, pull, I could flinch, I could fake, and you could put yourself in your own off balance state."}, {"time": 1157, "text": "When you think about people who wrestle, if I fake shoot, it causes you to over lean forward, which means you're off balance."}, {"time": 1167, "text": "There's no pull, there's no push, there's no nothing."}, {"time": 1169, "text": "I just get a reaction that leaves the opportunity in the door open for an attack."}, {"time": 1174, "text": "And that off balance could be very subtle?"}, {"time": 1176, "text": "Could be very subtle."}, {"time": 1178, "text": "And the better you get and the more skills you get, the less subtle it is."}, {"time": 1184, "text": "So we should also mention that there is something called forward throws, where you throw the person, they're gonna fly facing forward, they're gonna fly forward."}, {"time": 1196, "text": "And then a backward throw, they're gonna fly back."}, {"time": 1200, "text": "Yep, and then there's lateral, they actually go sideways over, like a cartwheel almost."}, {"time": 1205, "text": "Okay, so the forward throws, there's the one we've been talking about, which is Seinagi, and there's a bunch of different variants, Ippon, Marote, Seinagi."}, {"time": 1214, "text": "There's drop and there's standing versions of them."}, {"time": 1216, "text": "And that all, I don't know if there's a way to summarize it, but that's like as clean as getting your center of gravity under theirs as it gets."}, {"time": 1227, "text": "And then the rest is just gripping variations."}, {"time": 1230, "text": "I guess it's all gripping variations on all of these throws, but."}, {"time": 1234, "text": "And then there is, in terms of forward throws, there's the other big one in competition is Uchimata, which is, I don't know, we can try to explain that one."}, {"time": 1249, "text": "But it ends up being where one, you're standing on just one of your feet, and the other one is up in the air."}, {"time": 1257, "text": "And I don't know if you would put in that same category, Harai Goshi, like those kinds of throws where you're kind of a little bit single footed."}, {"time": 1265, "text": "Yeah, so there's two footed techniques and then there's single footed, yeah."}, {"time": 1269, "text": "Oh, Goshi, where it's like you're doing a mix between the Uchimata and the Seinagi."}, {"time": 1277, "text": "It's a hug."}, {"time": 1278, "text": "You hug a person and then you turn your hips around such that you're now hugging facing the same direction."}, {"time": 1284, "text": "When it comes to forward throw, there's, regardless of the name of the throw or the gripping variation that you're using, the whole principle is how do I get this person to do a forward roll in midair and land on their back?"}, {"time": 1300, "text": "The more of a forward roll I can get, the bigger the score."}, {"time": 1303, "text": "If I get like a quarter of a turn where like you land on your side and you don't go over your back, it's a half score."}, {"time": 1310, "text": "But they all require me to get you to do that forward rolling action."}, {"time": 1315, "text": "So just if we think of one person, if they do this nice leap forward and they do a roll and their back nicely rolls over the ground, you're trying to do the exact same thing with you connected to them."}, {"time": 1326, "text": "Well, and if it's nice and it's smooth, it's probably not a full score."}, {"time": 1330, "text": "It needs to have like somewhat of a violent impact."}, {"time": 1335, "text": "So if you think of a drop, say Nagi, if I'm moving too slow and you still roll over your shoulders and there's no direct impact, it's only a half score."}, {"time": 1345, "text": "They want the force."}, {"time": 1347, "text": "The force, the violence."}, {"time": 1351, "text": "So then in terms of backward throws, the traditional ones, there's stuff where you trip them from outside their body, like Osoto gari."}, {"time": 1363, "text": "It's a trip where you hook your leg onto their leg and you trip them, but your hook goes outside of their legs."}, {"time": 1371, "text": "And then there's the trips from inside their body."}, {"time": 1374, "text": "There's a one foot is called kuchi gari and then the other is ochi gari, it doesn't matter."}, {"time": 1380, "text": "The most important thing is outside and inside."}, {"time": 1383, "text": "Inside and then there's like, I don't even know how you throw them sideways except foot sweeps."}, {"time": 1389, "text": "And then there's the foot sweeps where you can sweep one of their legs from out of them or both their legs at the same time."}, {"time": 1397, "text": "And like we're talking about this kind of is when timed perfectly, it's effortless for everybody involved and the ending, like you said, is big, dramatic and violent."}, {"time": 1411, "text": "Is there other kind of, oh yeah."}, {"time": 1413, "text": "There's a sacrifice techniques."}, {"time": 1416, "text": "There's a bunch of them."}, {"time": 1418, "text": "And that ultimately the variations have to do with gripping, but you're basically you, the attacker fall onto your back, sticking your legs somewhere onto their body, which is like this fulcrum over which they fly and do that same kind of roll that you mentioned."}, {"time": 1434, "text": "You basically sacrifice your back to the mat in order to throw them into that circular pattern."}, {"time": 1440, "text": "So they hit their back."}, {"time": 1441, "text": "Sometimes we use a foot, sometimes we don't."}, {"time": 1444, "text": "And so we should probably say, it's okay for you to go onto your back as long as you're clearly demonstrating control over the other person's body."}, {"time": 1454, "text": "You can't go to your back in the same direction that your opponent is trying to put you to your back."}, {"time": 1462, "text": "You have to go the other way or you have to initiate you going to your own back."}, {"time": 1469, "text": "Like clearly."}, {"time": 1470, "text": "And then there's all the counters which almost kind of have a whole group of their own, even though they have echoes of the same types of techniques, it seems like they're their own whole thing."}, {"time": 1483, "text": "Yeah, but they follow the same principles."}, {"time": 1485, "text": "It's just most counters."}, {"time": 1487, "text": "Like if you wanted to counter Ennuchi Mata, for example, you're trying to throw me in a somersault over my right shoulder."}, {"time": 1496, "text": "Therefore, I would counter you by throwing you over your left shoulder."}, {"time": 1501, "text": "It goes in the opposite shoulder direction, but in the same somersault idea."}, {"time": 1506, "text": "And there used to be, I already at this point, forget the years, but it might be before the 2012 Olympics where they banned, you used to be allowed to grab legs in the same way you do in wrestling."}, {"time": 1519, "text": "So you have basically all the techniques you would have in wrestling available to you if you would like."}, {"time": 1526, "text": "It's just that some of the techniques in wrestling are not that effective for getting your opponent to their back."}, {"time": 1532, "text": "Wrestlers wanna take the other person down in any way possible and have control."}, {"time": 1536, "text": "Judo wants to take you down, like we said, in a big fashion where your back slams on the ground."}, {"time": 1541, "text": "Yeah, it has to be to the back."}, {"time": 1542, "text": "A lot of wrestling takedowns happen because they get behind them and then they parterre out."}, {"time": 1549, "text": "Yeah, so, but Judo banned all touching of the legs, which is a very dramatic change at the sport."}, {"time": 1557, "text": "But after 2012."}, {"time": 1558, "text": "After, it was after 2012?"}, {"time": 1560, "text": "In 2012, so 2008, I fought the games and everything was free."}, {"time": 1565, "text": "In 2012, we could only touch the legs as a defensive action or in response to an attack."}, {"time": 1573, "text": "So I could try to throw you with a normal throw and then when you try to counter, I could grab your leg."}, {"time": 1581, "text": "So there had to be a secondary technique."}, {"time": 1584, "text": "And didn't, like, didn't they disqualify on a first offense?"}, {"time": 1589, "text": "First offense was a direct disqualification, which happened at the 2012 games to the 57 Brazilian who won in 16."}, {"time": 1597, "text": "She was DQed and I think the quarters."}, {"time": 1600, "text": "And it was like, I wouldn't say it was blatant as much as I don't think the act changed the outcome of the match had they not disqualified her."}, {"time": 1610, "text": "So that's not that dramatic."}, {"time": 1611, "text": "And by the way, you say 57, that refers to weight divisions and that's in kilograms and kilograms is the measure of weight that the rest of the world uses and the United States does not."}, {"time": 1622, "text": "So, and there's, we should say the divisions for guys, I don't know what the 70, I don't know if the lower level, 60."}, {"time": 1631, "text": "60, 66, 73, 81, 90, 100 and heavyweight, which has no ceiling."}, {"time": 1639, "text": "No ceiling, as we'll talk about."}, {"time": 1641, "text": "It's an important distinction."}, {"time": 1642, "text": "Yeah, it is an important distinction."}, {"time": 1646, "text": "And you competed most of your career at 81 kilograms."}, {"time": 1651, "text": "All, you never did 73."}, {"time": 1653, "text": "I never did 73."}, {"time": 1654, "text": "Well, you had to cut big for 81 anyway, especially towards the end of my career, yeah."}, {"time": 1661, "text": "I overly grew into the division."}, {"time": 1663, "text": "What's, I'm trying to remember, is it about 180 pounds?"}, {"time": 1667, "text": "178.6, I think."}, {"time": 1669, "text": "And you have to weigh in with the gear."}, {"time": 1673, "text": "You're not allowed to wear anything except for your underwear, weigh in."}, {"time": 1676, "text": "Confusing digits, that's right, that's right, that's right."}, {"time": 1678, "text": "That's which is very nice."}, {"time": 1682, "text": "Okay, so we, would you say we covered most of the throws or no?"}, {"time": 1687, "text": "So there's the forward and the backward, there's the sacrifice throws and the counters."}, {"time": 1693, "text": "And then there's the leg grabs."}, {"time": 1695, "text": "And we should say for the leg grabs that were effective, it's like the big pickups where you just kind of pick them up and try to figure out once they're in the air what the heck to do with their body to get them to the ground."}, {"time": 1706, "text": "You just kind of figure it out as you go."}, {"time": 1708, "text": "I think the really nice one that was to me heartbreaking as a fantasy go is I guess what's called a fireman's carry, which is, it does lead to judo like beautiful throws."}, {"time": 1722, "text": "And the fact that that was gone is, that one I missed a little bit, but then a bunch of people I guess came up with the variance where you don't need to grab the leg."}, {"time": 1732, "text": "It's definitely not as effective as being able to grab it, but I'm also on the side of the fence having competed in all three."}, {"time": 1742, "text": "It was definitely better for the sport to remove it as a whole."}, {"time": 1747, "text": "It's probably good to cover sort of the whole spectrum of rules of judo is there's groundwork."}, {"time": 1752, "text": "So you do all this stuff on the feet where you're trying to murder each other with a giant throw."}, {"time": 1758, "text": "But then if the throw doesn't succeed, you go to the ground and you stay in the ground for some amount of time, like short amount of time."}, {"time": 1765, "text": "You have to move quickly, you have to be attacking."}, {"time": 1767, "text": "And two of the ways you can win is similar to people who do jiu jitsu is you can submit them, chokes, arm breaks, all that kind of stuff, no footlocks."}, {"time": 1779, "text": "And you can also pin them, which is get around their legs."}, {"time": 1784, "text": "And this is very, no, this is not like wrestling."}, {"time": 1787, "text": "You have to actually get around their legs and pin them in what in jiu jitsu is called side control mount, all kinds of ways that doesn't involve their legs."}, {"time": 1797, "text": "And then you pin them for like whatever, 20 seconds, 25 seconds."}, {"time": 1800, "text": "Yeah, 20 seconds now."}, {"time": 1801, "text": "I think the distinction is their back has to be facing the mat."}, {"time": 1806, "text": "You have to be past their legs and your chest has to be on the same plane as theirs."}, {"time": 1812, "text": "So it doesn't have to necessarily be on top, but it has to be on the same plane."}, {"time": 1816, "text": "And all of this is, I think different sports have different versions of this, but it's like an approximation of what dominance looks like."}, {"time": 1825, "text": "So pin and wrestling is dominating your opponent."}, {"time": 1829, "text": "Presumably if you were in a street fight, that position allows you to then do a lot of damage."}, {"time": 1834, "text": "Obviously submissions is dominance cause you're breaking their arm or choking them to unconscious."}, {"time": 1840, "text": "And then obviously the throw, which is not often talked about, but like if you talk about a street fight situation, a throw is like the best way to murder somebody."}, {"time": 1852, "text": "Like this could end anyone's life."}, {"time": 1855, "text": "It's terrifying actually."}, {"time": 1856, "text": "So, okay, so these are all elements of dominance."}, {"time": 1860, "text": "So going back to set of principles, you were mentioning getting your center of mass under theirs, which I think applies for type of like the forward say Nagi throws, is there other stuff?"}, {"time": 1874, "text": "Oh, so you mentioned off balance."}, {"time": 1875, "text": "Yeah, there's the off balance one where you can either pull to get an off balance or you can give way to the force, which can also lead to an off balance."}, {"time": 1887, "text": "You can amplify somebody's force to, so for example, if you push me, you expect a certain reaction that you're ready for."}, {"time": 1899, "text": "But if you push me and I pull you, now you didn't expect that much force coming out of you."}, {"time": 1904, "text": "Therefore you're off balance."}, {"time": 1907, "text": "The thing that's distinctly recognizable about Judo is like when done at the highest level, like it seems effortless when the big throw happens."}, {"time": 1919, "text": "Like that's just, it doesn't, there is no other sport like it in the combat sports where it's like when the timing is right, everything just is perfect."}, {"time": 1929, "text": "I think you get that out of my mate and boxing sometimes when this is a perfect strike, just like, but it's not just like a hard hit."}, {"time": 1939, "text": "It's like, it's almost like with Conor McGregor and Aldo, for example, when you just catch him just right."}, {"time": 1945, "text": "Just right."}, {"time": 1946, "text": "You didn't look like you hit him that hard, but you hit him just right."}, {"time": 1949, "text": "And then you get to see this all the time in Judo."}, {"time": 1954, "text": "And so the beginning part of that is because there's a jacket, there's also this whole thing that you're a master of, which is like, which is gripping."}, {"time": 1963, "text": "So is there something you could say about, are there some fundamental principles of gripping that you can speak to?"}, {"time": 1970, "text": "Like what the hell is gripping?"}, {"time": 1972, "text": "Gripping is having the ability to hold your opponent in such a way where you have the ability to be offensive and also the ability to be defensive at the same given time."}, {"time": 1985, "text": "And it's a distinction because I can hold you in such a way where I might be able to feel offensive, but if you can take a purely defensive grip and then I can't be offensive, we are no longer gripping."}, {"time": 1999, "text": "We are holding each other."}, {"time": 2003, "text": "And so like that would be the act of being able to grip is to be in a situation where you have me and I have you, and I can play both offense and defense at the same time where you can only play defense."}, {"time": 2016, "text": "So Donaher talks about like Jiu Jitsu that way, and not that way, but maybe you can see if there's a distinction."}, {"time": 2023, "text": "So you have a set of weapons."}, {"time": 2025, "text": "The other person has a set of weapons."}, {"time": 2027, "text": "You wanna sort of maximize the use of your weapons and shut down the set of weapons that they have."}, {"time": 2034, "text": "Do you see gripping the same way on the feet?"}, {"time": 2037, "text": "I do if we wanna include body positioning with our gripping."}, {"time": 2043, "text": "Because I can give you any grip you want and you still can't throw me."}, {"time": 2046, "text": "Because I can put myself in a position that nullifies your ability to use those grips in a successful way."}, {"time": 2053, "text": "And those, would you say the hips are critical to that or is it everything?"}, {"time": 2057, "text": "Hips, shoulders, chin position, head position, the angle of your foot."}, {"time": 2062, "text": "Yeah, where you lean."}, {"time": 2065, "text": "And so, and there's a bunch of places you can grip."}, {"time": 2068, "text": "Obviously, if people like kind of think of a jacket, like there's a bunch of places you can grip that are interesting."}, {"time": 2075, "text": "So you can grip on the collar, you can grip on the sleeves, you can grip like the elbow joint."}, {"time": 2081, "text": "And then you could do those bad ass, like Eastern European, Georgian, over the back."}, {"time": 2088, "text": "Over the back, over the opposite sides of the heads."}, {"time": 2090, "text": "The Koreans that grab on one side around the head with their hands together."}, {"time": 2094, "text": "There's something really nice about just those, I mean, especially George just keeps throwing that hand."}, {"time": 2100, "text": "Just over the person and just, you're not actually gripping a belt or anything."}, {"time": 2105, "text": "You're gripping just the entirety of like, as opposed to being all nice and I'm gonna grab this part of the jacket, this part of the jacket."}, {"time": 2112, "text": "You're just like taking the whole fucking jacket and just launching somebody."}, {"time": 2117, "text": "For those people that can't picture judo, think about it in like, if you understood like what a boxing match looks like, and you thought about that as like traditional gripping, when you throw like a Russian grip over the back, that's more like a hockey fight."}, {"time": 2133, "text": "Like I'm just grabbing you and we're just gonna, we're gonna be throwing punches left and right."}, {"time": 2138, "text": "Cause when we have that grip, somebody has to get thrown."}, {"time": 2141, "text": "There's no, we don't walk around with this grip."}, {"time": 2144, "text": "It's go time once somebody throws it."}, {"time": 2147, "text": "To me, as a fan and sort of amateur practitioner, there's two styles of Olympic level judo."}, {"time": 2155, "text": "One is where you're trying not to get thrown."}, {"time": 2159, "text": "And the other is where you're trying to throw."}, {"time": 2164, "text": "More specifically, when you're trying not to get thrown, there's like the strategy that you're using gripping to nullify their offense and all those kinds of stuff here."}, {"time": 2173, "text": "You're being very clever and strategic and all that, maybe using conditioning."}, {"time": 2177, "text": "And then there's people who just like step in the pocket and they almost don't care if they're getting thrown cause they have the confidence that they're gonna throw first."}, {"time": 2187, "text": "And those, like there's a clear distinction between the people that do one or the other."}, {"time": 2191, "text": "And I think both can be done extremely successfully at the highest level."}, {"time": 2196, "text": "It's just like, obviously you admire the people that step in the pocket."}, {"time": 2200, "text": "And I think when you look at the people who do judo the best, like if we wanna talk about like the top 10% of the people who would compete at the games, they do both."}, {"time": 2213, "text": "And they do both really well, but they favor one."}, {"time": 2218, "text": "Because if you look at a player like Lutepe Tilliani of Georgia, for example, there's a guy that stands in the pocket."}, {"time": 2227, "text": "But we can find numerous occasions where he's hustled some people for like a short period of time to get out of scenarios, to elongate the match, to make somebody tired."}, {"time": 2239, "text": "So you want both sides of the coin, but you better pick the one that 80% of your strategy is gonna be built around."}, {"time": 2247, "text": "Sorry for the romantic question, but I talked to Dan Gable and he always looked to the Russians as the artists in wrestling."}, {"time": 2257, "text": "And he always wanted to be an artist."}, {"time": 2259, "text": "But I think he's known for being that sort of guts, aggression, mental toughness guy, but he always was drawn to the artistry of wrestling."}, {"time": 2269, "text": "It's hard to know when you just watch you, because it looks like you're aggressive and you got the guts and the mental toughness, but there's also obviously a mastery of technique."}, {"time": 2278, "text": "Which would you lean towards in terms of what accounts for your success and just the way you approach judo?"}, {"time": 2285, "text": "Is it the guts, the aggression, the mental toughness, or is it the mastery of technique, the artistry?"}, {"time": 2295, "text": "Mine would be my aggressiveness if I'm gonna pick those two areas."}, {"time": 2303, "text": "But I think there's a third area in there that I would put myself in where I'm more of a strategist."}, {"time": 2309, "text": "I look at all of my opponents and all I ever see is their faults."}, {"time": 2314, "text": "And the way I do judo is built around their faults."}, {"time": 2319, "text": "And it's just, I put myself in scenarios where I don't even know how I'm gonna win."}, {"time": 2325, "text": "But what I've done in those scenarios is I've made it very difficult for you to win."}, {"time": 2333, "text": "And then I figure out the rest as I go."}, {"time": 2336, "text": "Like how do you study an opponent?"}, {"time": 2339, "text": "Are there bins you can put them in?"}, {"time": 2340, "text": "Like there's a lefty and a righty or this kind of stuff."}, {"time": 2344, "text": "How many bins are there in judo in your mind that you put your opponents in?"}, {"time": 2349, "text": "Yeah, there's probably about 20."}, {"time": 2352, "text": "There's like certain players who you could put in a category of like, they're only good for the first two thirds of the match."}, {"time": 2361, "text": "After that, they turn into a different player where they're either falling into a sense of panic or uncertainty."}, {"time": 2368, "text": "And you can, if you were to take a video clip of let's say Church's Philly, right?"}, {"time": 2373, "text": "They got Georgia and I beat in the Olympic semi."}, {"time": 2377, "text": "He's somebody that would beat you in the first three minutes."}, {"time": 2380, "text": "And if you clipped out all of his matches and you only watched the first three minutes of every match, you would see one style."}, {"time": 2389, "text": "If you found all the matches where he got taken into the last minute and he wasn't winning by a major score, you would see a completely different fighter."}, {"time": 2400, "text": "And so going into like my Olympic semi, I put him into that category of like, I wanna get to this guy, cause this guy is beautiful."}, {"time": 2408, "text": "The trick is, how do you get there?"}, {"time": 2410, "text": "How do you get there?"}, {"time": 2411, "text": "And by the way, we're talking about the 2016 Olympics where you won the silver medal."}, {"time": 2415, "text": "You were part of three different Olympics."}, {"time": 2418, "text": "But the cardio aspect of it, have you faced exhaustion often in your matches where you have to go deep and go like past?"}, {"time": 2429, "text": "Yeah, but that's not from the judo side of it."}, {"time": 2432, "text": "That's from like, I did a very bad job of making weight."}, {"time": 2435, "text": "It's always the weight cut."}, {"time": 2436, "text": "Yeah, it's always the weight cut."}, {"time": 2439, "text": "And I think people really struggle with that."}, {"time": 2443, "text": "They blame cardio and training and everything else."}, {"time": 2446, "text": "But when it really comes down to it, like we train for an hour and a half, two hours, twice a day."}, {"time": 2451, "text": "How are you tired after five minutes?"}, {"time": 2454, "text": "Right, it becomes into a mental struggle, your anxiety, your stress, your lack of belief in yourself."}, {"time": 2461, "text": "Or in my case, sometimes it's poor nutrition."}, {"time": 2464, "text": "Sometimes I had one too many McDonald's meals."}, {"time": 2466, "text": "It just, it happens."}, {"time": 2468, "text": "Okay, so let's talk about weight cutting real quick."}, {"time": 2471, "text": "So I've seen weight cutting break some of the toughest fighters, wrestlers, grapplers ever."}, {"time": 2480, "text": "Like burnout break, like where it makes you wanna quit the sport."}, {"time": 2484, "text": "So this is what people don't often talk about, but mentally it's one of the hardest things, especially when you're doing it kind of wrong."}, {"time": 2492, "text": "Because it becomes a mental war."}, {"time": 2495, "text": "So you competed, like you said, your whole career at 81 kilograms."}, {"time": 2500, "text": "You walked around at?"}, {"time": 2502, "text": "88, 89."}, {"time": 2504, "text": "So about 15 pounds, sometimes 20 pounds over that."}, {"time": 2509, "text": "Give or take."}, {"time": 2511, "text": "And so what was your process like mentally and physically?"}, {"time": 2516, "text": "First of all, maybe you can comment on when the weigh ins are relative to the matches."}, {"time": 2520, "text": "And then what was your process like leading like a week ahead, a day ahead, an hour ahead, minutes ahead of the weigh in?"}, {"time": 2529, "text": "Man, everyone varies tremendously because we're not like most sports because you're dropped off in foreign countries with who knows what, right?"}, {"time": 2540, "text": "Some places have saunas, some places have treadmills."}, {"time": 2544, "text": "I went to a place one time in China in the middle of winter where the roads were frozen with ice and we had to use our hotel rooms because you couldn't sweat outside because it was too cold."}, {"time": 2558, "text": "And every one of my Olympics, the weight cut was different just given my mass."}, {"time": 2562, "text": "When I went to 2008, I was probably like 82, 83 kilos walking around."}, {"time": 2568, "text": "So weight cutting wasn't a thing for me."}, {"time": 2571, "text": "In London, we actually weighed in the morning of."}, {"time": 2576, "text": "So weigh ins were at like 6 a.m. And the Olympics were always beneficial to me because they actually don't start until like 10 or 11."}, {"time": 2585, "text": "So you actually were able to recover."}, {"time": 2587, "text": "Where on the circuit you would weigh in at 6 a.m. and the competition started at 8 a.m."}, {"time": 2592, "text": "It's like, well, I was cutting weight at 5 a.m. And most of it for people who are not familiar, but maybe you can also correct me, most of it, you're really just getting the water out of your system."}, {"time": 2602, "text": "It was water cut."}, {"time": 2603, "text": "At that point, yeah."}, {"time": 2605, "text": "Like 24 hours before even, like."}, {"time": 2607, "text": "So are you?"}, {"time": 2608, "text": "Like an hour before."}, {"time": 2609, "text": "But yeah, but like leading up to it."}, {"time": 2613, "text": "And have you eaten the day before?"}, {"time": 2616, "text": "Do you try to minimize the amount of food in your system?"}, {"time": 2618, "text": "My weight cutting process was a little bit different than most people because I like to eat."}, {"time": 2627, "text": "I'm not the type of person that believes your athletic career is determined by your nutrition."}, {"time": 2637, "text": "I think some sports are built that way."}, {"time": 2639, "text": "But when it comes to combat sports, like, you know, your ability to knock somebody out has nothing to do with whether you had a cheeseburger or a salad."}, {"time": 2649, "text": "My ability to throw you is not determined by that."}, {"time": 2652, "text": "I may be able to perform better because I've eaten a certain way, but not enough to justify an entire diet change."}, {"time": 2659, "text": "Your body is built and my body is built to operate with certain things that I've had in my system for years."}, {"time": 2666, "text": "Yeah, I think I'm with you, but I also believe that there's a mental aspect."}, {"time": 2672, "text": "So if you're surrounded by people that tell you diet matters, then if your diet is off, you're gonna believe you're going to be off because the people around you tell you your diet should be good."}, {"time": 2681, "text": "So yeah, I think it's like, it's the same, I've had an argument with Matthew Walker, who's a sleep scientist about sleep."}, {"time": 2691, "text": "And it's like, if you believe sleep is essential, it's essential to get eight hours of sleep every single night perfectly, then you're going to be very stressed when you don't get it."}, {"time": 2700, "text": "And then I think it will negatively affect, the stress will negatively affect your longevity and all kinds of aspects of your life."}, {"time": 2706, "text": "If you actually just learn to truly listen to your body, become a scientist of your own body with sleep and food, it might end up that it will be the eight hours a night or whatever, but it might be something else and probably diet error."}, {"time": 2718, "text": "I remember when I was meeting with the USOC nutritionist after London, it was probably around 2014, I think."}, {"time": 2728, "text": "And when we had our team meeting at the beginning of the year and I was talking to him, he was talking about the nutrition plans that he could put us on."}, {"time": 2737, "text": "And I was like, time out."}, {"time": 2738, "text": "I've done the USOC thing, like I've done the couscous, I've done the lemon in my water."}, {"time": 2743, "text": "I go, I'm full of shit."}, {"time": 2748, "text": "Like there was just, cause there's like a cookie cutter plan, right?"}, {"time": 2751, "text": "And I was like, look, here's what I want you to do."}, {"time": 2754, "text": "I go, I'll listen to you, but you're going to walk into the 711 across the street from the USOC."}, {"time": 2759, "text": "And if you can't buy it in that 711, it's not on my plan."}, {"time": 2764, "text": "I go, because I go to places where the only thing I can eat is Pringles and a Snickers bar."}, {"time": 2770, "text": "I've done that."}, {"time": 2771, "text": "Like I've flown to Azerbaijan, stayed in a hotel where the restaurant is closed."}, {"time": 2776, "text": "USA Judo hasn't paid for the meal plan."}, {"time": 2778, "text": "And the only thing that's available is the thing across the street."}, {"time": 2782, "text": "So you were eating Pringles."}, {"time": 2784, "text": "Before fighting a Grand Slam event, while cutting 20 pounds."}, {"time": 2787, "text": "And a Snickers bar."}, {"time": 2789, "text": "I just, the visual of that, that's some like, that's some Rocky shit."}, {"time": 2793, "text": "Give me a nutrition plan."}, {"time": 2795, "text": "Cause I'm not paying my own way to travel with 14 days of food."}, {"time": 2802, "text": "I mean, that's, that's one of the magic of your whole career and also Judo."}, {"time": 2806, "text": "I mean, I'm sorry to say, of course, you want athletes to be super rich and super well funded from an athlete perspective and the sport to be popular and managed in an ultra competent way."}, {"time": 2817, "text": "But as a fan."}, {"time": 2818, "text": "That's not reality."}, {"time": 2819, "text": "But as a fan, it's fun to watch somebody like you who's exceptionally driven, has to suffer in all these different interesting ways."}, {"time": 2827, "text": "But it's only suffering if you expect the other side."}, {"time": 2833, "text": "I don't expect it."}, {"time": 2834, "text": "I accept it for what it is, which is why I write off nutrition for athletes."}, {"time": 2839, "text": "Cause it can be done without it."}, {"time": 2840, "text": "As long as, you know, to what you said before, like you don't believe you need it."}, {"time": 2845, "text": "Some people believe they need it."}, {"time": 2848, "text": "The mind, getting your mind right is the most important thing."}, {"time": 2851, "text": "You know what I believe I need?"}, {"time": 2853, "text": "A Snickers bar when I'm tired."}, {"time": 2855, "text": "I want a little bit of sugar."}, {"time": 2856, "text": "It makes me feel better."}, {"time": 2858, "text": "What do you want me to do?"}, {"time": 2859, "text": "So you, what are you going to do?"}, {"time": 2865, "text": "I just love the visual of you eating a Snickers bar before a grand slam."}, {"time": 2868, "text": "But that became part of my nutrition plan."}, {"time": 2871, "text": "When the USOC guy wrote my nutrition plan, I was eating a burrito bowl with brown rice, white meat chicken, black beans, guacamole, cheese, two chocolate chip cookies and a Diet Coke."}, {"time": 2885, "text": "This is like Chipotle or?"}, {"time": 2887, "text": "It was Beloco, but same concept."}, {"time": 2888, "text": "Same concept with two chocolate chip cookies."}, {"time": 2892, "text": "Cause I needed the sugar."}, {"time": 2893, "text": "I was, I was 88 kilos when I stepped on the scale at 6.3% body fat."}, {"time": 2902, "text": "Now I got to make 81."}, {"time": 2905, "text": "Six, what?"}, {"time": 2908, "text": "And the USOC was like, Hey, you know, you can't, you can't fight 81 anymore."}, {"time": 2914, "text": "You have to fight nineties."}, {"time": 2915, "text": "And I go, I'm already into the quad."}, {"time": 2918, "text": "I'm not changing."}, {"time": 2919, "text": "I go, build me a plan where I can do this."}, {"time": 2922, "text": "And now we have to have an acceptable weight cut."}, {"time": 2925, "text": "Like it just, what do you want me to do?"}, {"time": 2927, "text": "I'm not the IJF."}, {"time": 2928, "text": "I can't just change the fact that it takes two years to qualify."}, {"time": 2932, "text": "I know where I'm at."}, {"time": 2933, "text": "I know what I have to go through and I accept the consequences."}, {"time": 2939, "text": "All right, so what was the process?"}, {"time": 2940, "text": "I mean, can you, can you speak to, so you, you wake up early in the morning, the day of the weigh ins, a few hours before."}, {"time": 2948, "text": "Technically my weight cut never started until I got off a plane and to a hotel."}, {"time": 2955, "text": "And how many hours?"}, {"time": 2957, "text": "Three days."}, {"time": 2959, "text": "So it's a three day cut."}, {"time": 2960, "text": "It's a three day cut."}, {"time": 2961, "text": "Mentally you're thinking of it that way."}, {"time": 2963, "text": "And then you're still eating."}, {"time": 2964, "text": "I eat every day."}, {"time": 2966, "text": "And then like, what do you load up on water?"}, {"time": 2968, "text": "Maybe as you start and then the water stops."}, {"time": 2975, "text": "So you, I mean, it's a slow, you're not actually like sweating all three days."}, {"time": 2982, "text": "But then it's like torture to sleep."}, {"time": 2986, "text": "Part of the process."}, {"time": 2989, "text": "Are you able to sleep?"}, {"time": 2994, "text": "So you're dehydrated, further and further dehydrated with six, 7% body fat, trying to lose 10 pounds."}, {"time": 3001, "text": "I even developed a way to drink water out of a bottle where I don't drink anything, but I feel like I have swishing it."}, {"time": 3008, "text": "What's the, no."}, {"time": 3008, "text": "So like, I take like a bottle of water and like, if we were to like, to draw a line on it, I would tip it and I would go like this."}, {"time": 3023, "text": "And you would draw that line, but like I've drank now water for 20 seconds or whatever it is."}, {"time": 3029, "text": "And I feel, I get the fix."}, {"time": 3032, "text": "Brain told me I got there."}, {"time": 3035, "text": "That's amazing, man."}, {"time": 3036, "text": "You just, your mind's a very powerful tool."}, {"time": 3039, "text": "And the problem a lot of people have is they don't accept the reality of the situation."}, {"time": 3049, "text": "They bitch about the reality of the situation."}, {"time": 3052, "text": "First of all, you could always quit, right?"}, {"time": 3057, "text": "So like, you're not."}, {"time": 3059, "text": "Never missed weight."}, {"time": 3061, "text": "You can perform poorly."}, {"time": 3064, "text": "You can't miss weight."}, {"time": 3064, "text": "Don't miss weight."}, {"time": 3067, "text": "Because you can always win regardless of how bad the weight cut is."}, {"time": 3072, "text": "You can never win if you miss weight."}, {"time": 3075, "text": "But your brain is also really good."}, {"time": 3079, "text": "Maybe not your brain, but I know my brain, I think most people's brains are good at generating, the more desperate things become, the better at generating excuses."}, {"time": 3090, "text": "So what were you doing with your mind that resulted in you never missing weight?"}, {"time": 3097, "text": "The plan."}, {"time": 3099, "text": "So like I said, like my weight cut would never start until I got to the hotel because I didn't check my weight the morning of, I didn't check my weight when I got there."}, {"time": 3110, "text": "I just, while I'm traveling, I'm doing things at like a minimal level, but I'm never not giving myself something I'm craving."}, {"time": 3121, "text": "If I'm thirsty, I'm drinking a Diet Coke."}, {"time": 3124, "text": "If I'm hungry, I'm buying a Snickers bar."}, {"time": 3127, "text": "I'm buying a sandwich."}, {"time": 3131, "text": "And I accept the consequences when I get there."}, {"time": 3134, "text": "And then when I get there, if I step on the scale and it says 88 kilos, I instantaneously know exactly what it's gonna take to be 81."}, {"time": 3142, "text": "And then you just follow like a robot, follow a very specific process."}, {"time": 3147, "text": "And then, I mean, cause there's a lot of seconds in three days, seconds and minutes and you just."}, {"time": 3153, "text": "I just know exactly what it takes from my body."}, {"time": 3156, "text": "I know exactly what a one hour gym workout wearing a sauna suit is gonna take."}, {"time": 3163, "text": "I know exactly what I'm gonna lose on day one."}, {"time": 3165, "text": "And I know exactly what I'm gonna lose on day three, because they're not the same."}, {"time": 3169, "text": "So I can instantly look at a hotel, decide is there a bathroom, sauna, gym, temperature of the gym, access to the gym and when it is, access to the judo mats, my training partners, the roads versus streetlights, the weather outside."}, {"time": 3186, "text": "I can take a look at that environment and say, this is my weight, this is weigh ins."}, {"time": 3191, "text": "And instantaneously in my head, there's a plan to make weight."}, {"time": 3194, "text": "And you have a sense of how much sweat adds up to 10 pounds."}, {"time": 3198, "text": "How much sweat plus time."}, {"time": 3201, "text": "And I make sure in my plan, all of my meals and how much water I need in between is allocated to still make weight."}, {"time": 3209, "text": "Cause you have to eat or drink during that time."}, {"time": 3211, "text": "Are you incorporating like mental exhaustion into this?"}, {"time": 3216, "text": "That doesn't exist."}, {"time": 3218, "text": "So it doesn't?"}, {"time": 3219, "text": "Do you like meditate or something?"}, {"time": 3221, "text": "What did the thoughts come, especially three days."}, {"time": 3223, "text": "We're not talking about four hours of suffering."}, {"time": 3226, "text": "This has broken some of the toughest people in the world."}, {"time": 3228, "text": "The hardest weight cut I ever had."}, {"time": 3231, "text": "Hardest one."}, {"time": 3233, "text": "I fought Pan Am games in 2015 in Edmonton, Canada on a Wednesday and I won."}, {"time": 3243, "text": "So I've made weight on Tuesday."}, {"time": 3246, "text": "I fought on Wednesday where I had to weigh in 5% of my weight class, so 84 kilos."}, {"time": 3252, "text": "On Wednesday I was 84 kilos."}, {"time": 3254, "text": "I got on a plane on that Wednesday night and landed Friday morning in Sochi."}, {"time": 3264, "text": "Okay, so I've traveled now."}, {"time": 3267, "text": "I got on the scale, all my bags got lost, everything."}, {"time": 3272, "text": "So somehow I flew from there to here, no bags."}, {"time": 3276, "text": "And I threw all of my stuff in my bag."}, {"time": 3280, "text": "I wore sandals, one pair of pants and a T shirt on the plane because I was like, I'm just tired."}, {"time": 3287, "text": "I just fought."}, {"time": 3288, "text": "I don't even want to carry it."}, {"time": 3290, "text": "What are the odds that I get there and my bags are gone?"}, {"time": 3292, "text": "Yeah, very low."}, {"time": 3294, "text": "Very low."}, {"time": 3295, "text": "Sure enough, it's gone."}, {"time": 3297, "text": "I get all the way to Sochi."}, {"time": 3298, "text": "I check into the hotel."}, {"time": 3300, "text": "There's one sauna."}, {"time": 3303, "text": "You have to reserve it and you're only allowed to reserve it for an X period of time."}, {"time": 3308, "text": "Guess in a small tangent, when you phoned out, your bags are gone."}, {"time": 3313, "text": "This is something I'll often think about."}, {"time": 3315, "text": "There's like people that are helping you, right?"}, {"time": 3317, "text": "Like there's a person at the airport who goes."}, {"time": 3320, "text": "Yep, oops."}, {"time": 3321, "text": "And then the person at the hotel who tells you that you have to reserve the sauna and looks at you like you're, they don't care that you've been suffering."}, {"time": 3330, "text": "They don't even understand why you need it."}, {"time": 3333, "text": "Yeah, like why?"}, {"time": 3334, "text": "Oh, you know, oh, this, like this little kid reserved it for five hours or something to block it off."}, {"time": 3343, "text": "Is there a frustration that gets in there?"}, {"time": 3345, "text": "You just accept reality."}, {"time": 3346, "text": "Don't even hinder on like the things you can't change."}, {"time": 3350, "text": "Because the second you get frustrated, the second you think you can change it, you'll harp on it."}, {"time": 3356, "text": "And that breaks most men."}, {"time": 3359, "text": "That like little thing in the back of their mind thinking, oh, like what if?"}, {"time": 3363, "text": "There's no what if."}, {"time": 3364, "text": "There's only right here right now."}, {"time": 3366, "text": "If it doesn't work, it doesn't work."}, {"time": 3367, "text": "Let's just quickly come up with a solution to fix the problem."}, {"time": 3371, "text": "By the way, as another small tangent, all the greatest people I've interacted with at the highest level think like that."}, {"time": 3379, "text": "They don't linger on the, it's like the next thing."}, {"time": 3383, "text": "Because like, if you want to do something great, hard stuff is going to keep happening to you."}, {"time": 3388, "text": "And if you're going to let that affect you, you're not ever going to do the great thing."}, {"time": 3392, "text": "It's fascinating actually."}, {"time": 3393, "text": "Like that's the one skill you have to learn."}, {"time": 3396, "text": "Elon Musk is great at this."}, {"time": 3398, "text": "Constantly dealing with emergencies."}, {"time": 3400, "text": "Okay, this happened."}, {"time": 3403, "text": "Accept."}, {"time": 3404, "text": "It's not that big of a deal."}, {"time": 3404, "text": "Every problem has a solution."}, {"time": 3407, "text": "And if I can't solve it, it's not my problem."}, {"time": 3412, "text": "So what, so how'd you figure it out?"}, {"time": 3414, "text": "In sandals?"}, {"time": 3415, "text": "Get this, I get to the hotel."}, {"time": 3418, "text": "I check in."}, {"time": 3418, "text": "I don't even know about the sauna yet."}, {"time": 3420, "text": "I go, I need to find a clothing store."}, {"time": 3423, "text": "I'm in the middle of Russia."}, {"time": 3425, "text": "I open up Google Maps and I'm like, sports store."}, {"time": 3429, "text": "I find an Adidas sports store in the middle of Sochi, Russia, right?"}, {"time": 3434, "text": "I spend like $500 on like average sweats."}, {"time": 3438, "text": "No plastics, no nothing, and no running shoes cause they don't have any."}, {"time": 3442, "text": "What's the temperature outside?"}, {"time": 3444, "text": "Is it cold?"}, {"time": 3445, "text": "It was kind of like springish."}, {"time": 3447, "text": "So it wasn't cold, but it wasn't hot."}, {"time": 3450, "text": "So you still need a lot of layers preferably."}, {"time": 3452, "text": "You would need a lot of layers just to cut the amount of weight I'm about to tell you I have to cut because after I bought that stuff that next morning, and mind you, it's a Friday, it's a Friday morning."}, {"time": 3462, "text": "I go to the venue where we have the mats open to train and I step on the scale."}, {"time": 3469, "text": "And then Sagan Batar of Mongolia goes, oh, pretty good, you're almost there."}, {"time": 3474, "text": "And I go, no, I'm not."}, {"time": 3479, "text": "I stepped on the scale at almost 94 kilos."}, {"time": 3481, "text": "And I looked at him and I was like, I'm 81."}, {"time": 3485, "text": "And he went, good luck."}, {"time": 3489, "text": "You're almost there."}, {"time": 3493, "text": "For the next weight class above."}, {"time": 3496, "text": "Is this on a Saturday or Sunday?"}, {"time": 3498, "text": "Friday morning."}, {"time": 3499, "text": "No, no, no, sorry."}, {"time": 3500, "text": "Friday morning, the competition is when?"}, {"time": 3504, "text": "I weigh in Sunday."}, {"time": 3507, "text": "I'm like, holy crap."}, {"time": 3508, "text": "I throw on all my layers and there's one other person with me there, Kalita, who was my girlfriend at the time, now my wife, we start doing judo."}, {"time": 3518, "text": "Cause I'm like, this will be the easiest way to knock off like three or four kilos."}, {"time": 3522, "text": "Well, it's cold."}, {"time": 3524, "text": "I have no gi and I'm working out with a female."}, {"time": 3528, "text": "I can't get overly physical to really get my muscles going to really break that sweat because she has to compete in a day or two."}, {"time": 3536, "text": "She's not a training partner."}, {"time": 3538, "text": "You can't just use this person."}, {"time": 3540, "text": "I stepped on the scale."}, {"time": 3542, "text": "I was 91 kilos."}, {"time": 3544, "text": "So I went, well, I was a nice den, but like, yeah, I go, that's not going to fly."}, {"time": 3549, "text": "So sure enough, the clothes are now ruined."}, {"time": 3553, "text": "They didn't help me lose any extra weight."}, {"time": 3555, "text": "So I go back to the hotel and I start reserving the sauna."}, {"time": 3559, "text": "Do you know how hard it is to lose that much weight in a sauna by yourself?"}, {"time": 3564, "text": "So it's harder on many levels, but one of them is just mental."}, {"time": 3568, "text": "You're sitting in heat."}, {"time": 3569, "text": "Heat, and you're not doing anything."}, {"time": 3572, "text": "Like if there had been a bike or like the sauna was big enough to use a jump rope or you could do some sort of activity, but you just sit and you stew and you're there mentally."}, {"time": 3584, "text": "At one point during the weight cut, I actually had my mouth on the bottom part of the door where there was a little gap and my legs up on the benches and Kalita holding the door so that it didn't open so I couldn't open it so that I could lean against that thing and have fresh air."}, {"time": 3601, "text": "Cause I was like, I was struggling."}, {"time": 3604, "text": "And we're talking about, I mean, how many hours is that?"}, {"time": 3607, "text": "Hours."}, {"time": 3608, "text": "And then the thing is, is because you have to reserve the sauna."}, {"time": 3611, "text": "I can't even take like a 30 minute break because the sauna is not going to be mine in an hour, which means you have to use the sauna and the heat for that allotted time period."}, {"time": 3621, "text": "And I hate saunas."}, {"time": 3623, "text": "That is always my last resort."}, {"time": 3625, "text": "I would use a bath."}, {"time": 3626, "text": "I will train."}, {"time": 3627, "text": "I will run."}, {"time": 3628, "text": "I will jump rope."}, {"time": 3629, "text": "Sauna is like, oh, let me do that for 10 minutes after all of my gym workouts, just to keep the sweat going while I stretch and cool down."}, {"time": 3637, "text": "That's never like the, hey, I'm going to do five, 10 minute sessions because I need to lose two kilos."}, {"time": 3643, "text": "That is never the plan."}, {"time": 3646, "text": "But I mean, so I've done plenty of sauna for weight cuts to know I can't even imagine what you went through."}, {"time": 3654, "text": "And the seconds slow down."}, {"time": 3656, "text": "That's one way to achieve immortality is like the time slows down to like a stop and you're left alone with your thoughts."}, {"time": 3664, "text": "You can't do anything."}, {"time": 3665, "text": "Just like you said, you can't."}, {"time": 3666, "text": "There's nothing worse than sitting in that kind of heat for 10, 15 minutes."}, {"time": 3671, "text": "And then you walk out and you're not even sweating."}, {"time": 3676, "text": "There's nothing worse than that."}, {"time": 3677, "text": "And if you like, and maybe if you weigh yourself, which you probably shouldn't be doing because it'll break you."}, {"time": 3682, "text": "You haven't lost anything."}, {"time": 3685, "text": "And I was weighing myself every time because I only get breaks when I was hitting weight allotments."}, {"time": 3691, "text": "And so if I could lose 0.3 in 10 minutes, I'd give myself a break, but I had to hit certain numbers because I only have the sauna for a certain amount of time."}, {"time": 3700, "text": "And I remember one time I went downstairs to get my key to the sauna and the Japanese team had reserved it and took it from me because the guy didn't put my name on the list when I called down to get the sauna."}, {"time": 3711, "text": "So I lost an entire session that I had to get made up towards the later part of the day because I still have no running shoes."}, {"time": 3717, "text": "And then sure enough, my bags show up 30 minutes after weigh ins."}, {"time": 3724, "text": "That's like the universe just kind of giving you a little wink there."}, {"time": 3730, "text": "I think like, because so few people do this weight cut at this high of a level, people don't often realize because people get a sense of how hard it is to run 200 miles in the desert."}, {"time": 3742, "text": "Like they, cause they go outside here in Texas, you can run five miles."}, {"time": 3746, "text": "Oh, it's hard."}, {"time": 3747, "text": "But like the weight cut is really, I, can you, so you just, like, how did you do it?"}, {"time": 3754, "text": "Just fucking not refusing to."}, {"time": 3757, "text": "You have to make weight."}, {"time": 3758, "text": "You have to make weight and you just, that's."}, {"time": 3761, "text": "I am astounded when I hear like UFC fighters like miss weight."}, {"time": 3771, "text": "Like when Jaden Cox missed weight at the Olympic trials, I was like, at least his was understandable because he missed the actual weigh ins."}, {"time": 3783, "text": "He didn't, he wasn't like not on weight."}, {"time": 3785, "text": "But when UFC fighters like miss weight, I'm like, how did that happen?"}, {"time": 3792, "text": "You clearly like gave up a long time ago."}, {"time": 3796, "text": "There were times where I was like, well, I can't do this."}, {"time": 3799, "text": "There've been times where I've been in a sauna suit wrestling with a training partner who's probably 60 kilos who fought earlier that day to lose point three."}, {"time": 3811, "text": "Did lose point three."}, {"time": 3812, "text": "Like, are you considering your mortality in this moment?"}, {"time": 3815, "text": "Like, aren't you thinking you're going to die?"}, {"time": 3819, "text": "Because like, it's severe dehydration."}, {"time": 3821, "text": "You could damage your body."}, {"time": 3824, "text": "Are you thinking about any of this or is it just, man."}, {"time": 3831, "text": "OK, yes."}, {"time": 3832, "text": "But see, I'm on the other level too where like, I've been in Belgium, right?"}, {"time": 3837, "text": "Belgium, there used to be a B level tournament."}, {"time": 3839, "text": "And the tournament used to go on."}, {"time": 3841, "text": "And because I was always on the heavier side, like 81s fights on the second day, which is the heavyweight day, weigh ins were always at like, let's say, 2 p.m. the day before for that tournament."}, {"time": 3852, "text": "Well, there was a sauna at the tournament."}, {"time": 3855, "text": "I remember like being in the sauna and like, oh, I'm 80.9 kilos."}, {"time": 3862, "text": "Weigh ins aren't for three hours."}, {"time": 3864, "text": "Fuck it, I'm going to have lunch."}, {"time": 3869, "text": "Because I mentally understand that what I eat right now is going to fuel me for tomorrow."}, {"time": 3875, "text": "So I don't want to skip it."}, {"time": 3877, "text": "I have the time to put it into my system and still lose it."}, {"time": 3881, "text": "It's almost like a computer program."}, {"time": 3883, "text": "You're running through the process."}, {"time": 3886, "text": "I get it, but like that all relies on your ability to be."}, {"time": 3890, "text": "To get it back off."}, {"time": 3891, "text": "Yeah, I mean, but also just like go through this process, which is painful."}, {"time": 3894, "text": "It's like those monks who meditate while sitting in a fire kind of thing or something, right?"}, {"time": 3902, "text": "Is there other people that are critical to this or is this all internal to you?"}, {"time": 3907, "text": "Are there people that?"}, {"time": 3909, "text": "Everybody has their own way of doing it."}, {"time": 3914, "text": "Some people don't cut that much."}, {"time": 3915, "text": "Some people can't weight cut at all, right?"}, {"time": 3918, "text": "They would rather have been like 83 kilos fighting 90 than, you know, be 83 kilos fighting 81."}, {"time": 3928, "text": "So why did you never move up to 90?"}, {"time": 3933, "text": "Is it from your deep understanding of your own judo and like the judo opponents you would face at 90 and 81?"}, {"time": 3940, "text": "Cause 81 is probably the hardest, if not the second hardest division in the history of judo compared to 73 and 81."}, {"time": 3949, "text": "You know, when I was a kid, like I always wanted to be like the middleweight Olympic champion, like the 81 kilo Olympic champion."}, {"time": 3957, "text": "When I was in high school, I made a decision when I was trying to make weight for 73, I was like, I was cutting weight for 73 like I was cutting weight at the end of my career, right?"}, {"time": 3969, "text": "And I was like, I'm just gonna bag it."}, {"time": 3971, "text": "I'm gonna accept the fact that I may not make a junior world team, I may not make this team, but I'll grow into the division so when I'm a senior player, like I'm ready to go and I'll naturally be stronger."}, {"time": 3982, "text": "There's an understanding of like a growth process when you move up a weight class."}, {"time": 3987, "text": "Most people can't just, oh, I'm gonna fight 90s and I'm gonna win because I wanted 81."}, {"time": 3993, "text": "The style of judo is different, how you move is different, how they do things is different."}, {"time": 3998, "text": "There's like a learning curve that goes into it."}, {"time": 4001, "text": "And because the weight cut didn't really happen until I was getting ready for Rio, I wasn't about to have my last Olympic games be at a different weight class that I may or may not be able to grow into."}, {"time": 4013, "text": "I mean, this is an awesome story of you kind of decided that this will be your life's work in terms of judo competitor is like the 81 division."}, {"time": 4023, "text": "I'm going to, I mean, I don't know if you saw it that way, but you're talking about three Olympics and it's like this story of, I would say tragedy and triumph of just wars and 81 kilograms with the usual cast of characters of the top five in the world kind of thing."}, {"time": 4041, "text": "So you just became a scholar of that, let your body grow into it and then let your body outgrow it and still suffer through it to keep it in the 81 kilograms."}, {"time": 4051, "text": "You never competed at like at the highest levels at 90."}, {"time": 4054, "text": "I entered one tournament at 90 kilos."}, {"time": 4057, "text": "And that was because before Rio from the end of 2014, all the way up until Rio's, every time I fought, I got hurt every time there was no time where I made weight and got injured because my body weight was so high."}, {"time": 4077, "text": "My body fat was so low that by the time I dehydrated enough to get down there and you take the physicality of judo and throw that into the mix, something broke every time."}, {"time": 4088, "text": "It was like nature of the beast."}, {"time": 4091, "text": "So the plan was before Rio, we made an agreement with USA judo that Travis, you're gonna fight 90 kilos, but you're not gonna weigh in at 90 kilos."}, {"time": 4103, "text": "Like, hey, there's no like, you get to be 94 kilos and cut to 90s, there's like a, you're gonna step on the scale at 84 kilos, like a little bit of a weight cut, but not a full one, just so that you feel like you get into like the tournament."}, {"time": 4118, "text": "Because when I, around 2012, when I was talking with the USOC nutritionist, I actually got my weight down so much that I didn't really need to cut weight."}, {"time": 4128, "text": "The problem is, is I wasn't cutting weight, I didn't feel like I was competing."}, {"time": 4132, "text": "Right, you have to go through like that mental process."}, {"time": 4135, "text": "And I never really reworked that, it was easier to just cut the weight and be ready to go."}, {"time": 4140, "text": "But when I entered into the 90 kilo division, I was rushed to the hospital the night after because my body broke out in hives, like full body."}, {"time": 4149, "text": "They said it was stress induced."}, {"time": 4154, "text": "So a month before the games, I was hospitalized and hungry and filled with steroids to get the hives to drop."}, {"time": 4161, "text": "And every couple days, my body, when I got back home, I would end up in the hospital because my whole body would break out again."}, {"time": 4169, "text": "I wonder if it's like deviating from the process that you so like perfectly crafted already."}, {"time": 4174, "text": "Or it was stress from my mind thinking, like even though it's not top of mind, there's probably a portion of me that like the Olympics is coming around and it could be my last, that like my body just reacted to something chemically."}, {"time": 4188, "text": "So I was breaking out in hives."}, {"time": 4190, "text": "I actually bought like a 600 euro Hugo boss suit because when I was in the Netherlands training at the time, I thought I had bed bugs because I was getting bit everywhere."}, {"time": 4202, "text": "Then I thought there was something in the detergent at the local thing, so I threw away all my clothes."}, {"time": 4207, "text": "Like I was paying for showers because I was trying to get the detergent off my body and buying new clothes at the airport."}, {"time": 4214, "text": "Trying to figure it out."}, {"time": 4216, "text": "Trying to figure it out and just go, yeah, accepting the situation."}, {"time": 4219, "text": "I mean, but the level of stress is exceptionally high here."}, {"time": 4222, "text": "Can we talk about the other side?"}, {"time": 4224, "text": "People are gonna love this."}, {"time": 4226, "text": "But you have a long history of persevering through injuries, through insane amounts of injuries."}, {"time": 4237, "text": "My ability to tolerate pain is probably more than most people."}, {"time": 4241, "text": "But see, injuries aren't just pain, right?"}, {"time": 4244, "text": "It's like, it's also mental, like psychological."}, {"time": 4249, "text": "Like again, like the weight cut, it can make a lot of people quit."}, {"time": 4254, "text": "Can you tell your history of injuries?"}, {"time": 4257, "text": "What are the biggest injuries, the toughest injuries in your career?"}, {"time": 4262, "text": "Starting from what, your early teens?"}, {"time": 4265, "text": "My early teens, I actually got out of sports from 11 to, I wanna say like 15 years old, 16 years old, because a kid shot a double leg through my kneecap and I partially tore all the ligaments in my knee, cartilage, meniscus, the whole nine yards."}, {"time": 4283, "text": "And I had to learn how to walk again."}, {"time": 4285, "text": "I spent two years in a leg brace, crutches, hobbling around the school yard."}, {"time": 4292, "text": "That one was a challenge to come back from."}, {"time": 4296, "text": "I've broken most of my ribs."}, {"time": 4299, "text": "I won nationals with nine broken ribs."}, {"time": 4302, "text": "I was actually getting Novocaine shots into my chest to avoid feeling the pain and then wrapping them to try to make sure I didn't pop alone."}, {"time": 4313, "text": "I've broken my collarbone."}, {"time": 4315, "text": "I have five herniated disc in my neck."}, {"time": 4318, "text": "I fractured my back twice."}, {"time": 4320, "text": "I've broken my tailbone."}, {"time": 4322, "text": "I tore my SI joints."}, {"time": 4324, "text": "I've torn my right hamstring twice, my left one once."}, {"time": 4332, "text": "Broken my ankles a few times."}, {"time": 4333, "text": "I spun it once in a 360 that had dev surgery."}, {"time": 4338, "text": "Fingers, toes, elbows, shoulders."}, {"time": 4340, "text": "So all of these are, first of all, you're a tough dude, man."}, {"time": 4348, "text": "So each of those have a story behind them."}, {"time": 4353, "text": "So if you're talking about the collarbone or the ankles or the back, the neck, is there interesting stories here that are behind these injuries?"}, {"time": 4364, "text": "Hard training, hard competing, jiu jitsu, judo."}, {"time": 4369, "text": "So ground stuff like sparring in the dojo or like drilling or all that kind of stuff."}, {"time": 4376, "text": "If you were to sort of break it down, your understanding of the landscape of injuries you went through."}, {"time": 4383, "text": "I've never had one in jiu jitsu, ever."}, {"time": 4387, "text": "I mean, I might've like torn a fingernail or like gotten key burned, but I've never been like seriously injured."}, {"time": 4396, "text": "I know when Ponza straight ankle locked me at Copa Podio, that hurt, but I wasn't injured."}, {"time": 4404, "text": "Like it felt sore, but if I had to run, I could run."}, {"time": 4408, "text": "I can now understand probably exactly what the injuries came from then."}, {"time": 4413, "text": "You very quickly excelled at jiu jitsu."}, {"time": 4416, "text": "You achieved another level in judo."}, {"time": 4419, "text": "And I think that means the intensity with which you approached judo."}, {"time": 4424, "text": "To achieve that world class level probably is the source of the injuries."}, {"time": 4429, "text": "Yeah, because the mentality of how I approached judo versus jiu jitsu."}, {"time": 4437, "text": "Jiu jitsu to me is like a game that like we would play."}, {"time": 4442, "text": "Like if you wanted to like grab a basketball and like go play a game of one on one, that's like jiu jitsu to me."}, {"time": 4449, "text": "Like I can't take the sport in its entirety seriously."}, {"time": 4453, "text": "Cause I feel like the community of jiu jitsu doesn't take it seriously."}, {"time": 4457, "text": "So just for people who don't know, just to set some context, you're a black belt in jiu jitsu, but more importantly, you've beaten a lot of world class jiu jitsu people."}, {"time": 4469, "text": "You've done very well at the highest levels of competition."}, {"time": 4473, "text": "Yeah, I wouldn't necessarily say I've beaten them as much as I've trained with them."}, {"time": 4479, "text": "And they understand whoever it is that through training with me, that like, I'm not just a judo guy."}, {"time": 4488, "text": "Like I know how to do jiu jitsu, right?"}, {"time": 4492, "text": "And if any one of them were to come to me and like say, hey, I wanna feel what it feels like to do judo with me."}, {"time": 4505, "text": "They would quickly understand that like the way I approach one is very different than the way I approach the other."}, {"time": 4512, "text": "Like we probably wouldn't be friends if they did judo with me versus if they did jiu jitsu with me."}, {"time": 4517, "text": "I'm curious asking for a friend because mostly because I'll do a little judo with you today."}, {"time": 4522, "text": "So you clearly, cause you're a great instructor and teacher, you have a mode where you can demonstrate a technique."}, {"time": 4528, "text": "Do you know how to like spar where you're going like 50%?"}, {"time": 4534, "text": "It's hard to put like a percentage to it because I've never in all of my jiu jitsu ever gone 100%."}, {"time": 4542, "text": "In jiu jitsu?"}, {"time": 4544, "text": "Like I had a conversation with Salo one time where we were talking about like jiu jitsu and training."}, {"time": 4551, "text": "And I was like, well, if I got his arm, I would just break it."}, {"time": 4555, "text": "And he was like, but what if he tapped?"}, {"time": 4559, "text": "I go, that's not my responsibility."}, {"time": 4563, "text": "If he taps and the ref doesn't say anything, you just break it."}, {"time": 4565, "text": "You just keep going."}, {"time": 4567, "text": "He goes, but the tap means it's over."}, {"time": 4568, "text": "And I said, no, the ref tells me when it's over."}, {"time": 4571, "text": "I go, I never give you the opportunity to tap."}, {"time": 4574, "text": "Cause if you have the opportunity to tap, that means you had the opportunity to think about how to get out, make a decision that you can't, then tap."}, {"time": 4583, "text": "I clearly operated too slowly."}, {"time": 4586, "text": "So there's a, it's either broken or I don't have it."}, {"time": 4589, "text": "You're a terrifying person to go against in Judo."}, {"time": 4593, "text": "Like on the ground, like everything you did, that's amazing."}, {"time": 4598, "text": "That's really amazing."}, {"time": 4599, "text": "That's what made you a really fun person to watch."}, {"time": 4602, "text": "Cause you really went to war with these people."}, {"time": 4605, "text": "So you know what it's like to go a hundred percent in Judo."}, {"time": 4608, "text": "Cause I know what it's like to train with somebody under the mentality of, I'm going to do everything I want to do."}, {"time": 4616, "text": "You're going to do nothing you want to do."}, {"time": 4619, "text": "And you're going to accept that."}, {"time": 4621, "text": "Do you ever train in Judo where you let people get stuff?"}, {"time": 4625, "text": "Of course, all the time."}, {"time": 4628, "text": "Now, or like."}, {"time": 4630, "text": "Even when you're sort of building up the four years, building up to the Olympics, like there's smaller guys that are throwing you in the gym and that kind of stuff."}, {"time": 4638, "text": "No, I never said that."}, {"time": 4641, "text": "That never came out of my mouth."}, {"time": 4644, "text": "I said, I let people do stuff."}, {"time": 4645, "text": "I never said smaller people throw me."}, {"time": 4647, "text": "Oh, you mean you let them get a grip, but then you'll position yourself on such a way that it's hopeless."}, {"time": 4653, "text": "The number one skillset that Judo is going to teach you is the ability to give people false hope."}, {"time": 4664, "text": "Cause I can let."}, {"time": 4665, "text": "I'm really looking forward to the video we're going to shoot later today."}, {"time": 4667, "text": "Like I can let you take a grip."}, {"time": 4670, "text": "I can let you think that there's opportunity, but what you don't understand is by the position and angle that I'm in, it's actually false hope."}, {"time": 4679, "text": "Like, as long as you don't know that it is, then now I'm free to operate and do what I want."}, {"time": 4684, "text": "See, I competed in Judo against black belts where I would go in and it looks like I could should be able to throw them."}, {"time": 4693, "text": "And then you just hit a wall."}, {"time": 4695, "text": "And then I also saw you destroy those black belts."}, {"time": 4699, "text": "So there's levels to this."}, {"time": 4701, "text": "It's the cliche thing of there's black belts and there's black belts."}, {"time": 4704, "text": "You're unique in this."}, {"time": 4706, "text": "There may be a couple other Jidoka in America, but you're really like unique."}, {"time": 4710, "text": "I then get to see people that really I felt like were 10X better than me."}, {"time": 4717, "text": "It just feels like that sometimes."}, {"time": 4719, "text": "I've learned that madness and it said it'd be truly might only be just a little better, but I saw you destroy them."}, {"time": 4726, "text": "And it was like, holy shit."}, {"time": 4729, "text": "There's a thing in Judo, right?"}, {"time": 4731, "text": "Where, you know, imagine like you as like just an adult, right?"}, {"time": 4739, "text": "And I hope people can like conceptualize this when they hear this, but imagine like you're a full grown adult, even male, female, it doesn't matter, but there's a little kid in front of you, like call him five or six years old and he's acting out."}, {"time": 4752, "text": "Like, do you think you have the physical capability of with one hand grabbing that person or that kid and making sure that they freeze?"}, {"time": 4761, "text": "Like they feel like they're nervous and like they can't do anything."}, {"time": 4766, "text": "When you fight a good Judo player, when they grab you, that's what it feels like as an adult."}, {"time": 4772, "text": "And even I've felt that from like certain players in Japan, like when they get a grip, I'm like, I've now lost the function of this one."}, {"time": 4781, "text": "That's a really good way to put it."}, {"time": 4783, "text": "I think I could potentially beat some of the people I've went against, but certain groups they took, it made me feel powerless."}, {"time": 4793, "text": "I was like, I didn't know this was possible."}, {"time": 4796, "text": "That kind of power was possible."}, {"time": 4797, "text": "And you don't even know where it originates from."}, {"time": 4800, "text": "Cause you're like, how does one person's hand do this where I can't use my whole arm?"}, {"time": 4804, "text": "Or like, I can't pick up my right foot because he's holding onto my right sleeve."}, {"time": 4809, "text": "It was kind of on a basic animalistic sense, kind of terrifying."}, {"time": 4815, "text": "It's, I mean, you don't want to, part of this is like ego, but you realize that there's a food chain and you're not at the top of it."}, {"time": 4826, "text": "That's part of the humbling process, I think of martial arts."}, {"time": 4829, "text": "It's like, I think everybody, like a lot of people think they're much higher in the food chain than they are."}, {"time": 4837, "text": "Than they really are."}, {"time": 4838, "text": "And then when you realize, this is why it's a really healthy process for people that are not even competing in the Olympics to practice martial arts."}, {"time": 4846, "text": "Cause you realize, okay, that like putting yourself more accurately in the food chain is really good way to sort of place yourself in the rest of the world."}, {"time": 4855, "text": "It humbles you to the reality, the harshness of the world."}, {"time": 4859, "text": "It's kind of like when people look at like survival in the wilderness, it's like, oh, it's not that hard."}, {"time": 4864, "text": "No, you'd probably be dying in a couple of days."}, {"time": 4867, "text": "Same thing with like judo and martial arts."}, {"time": 4869, "text": "Like, yeah, it's really not that hard, but you don't know what to do yet."}, {"time": 4875, "text": "And so when you find out that first time that you don't know what to do, it's devastating to a lot of people, but those that like stick through it and like start to learn, it's a very powerful, like feeling that now, like you can take care of yourself."}, {"time": 4891, "text": "And I think I want to talk to you a few times before you talked about that."}, {"time": 4895, "text": "There's like, like the top three, the top five in the world."}, {"time": 4898, "text": "I don't know where you put them, but they're, they're another like level above."}, {"time": 4903, "text": "They're a whole nother tier, yeah."}, {"time": 4905, "text": "And the fact that you're, I mean, it's, it's so exciting to me probably because I just felt all the levels here and I've seen you and others at that height destroy those."}, {"time": 4919, "text": "I've seen the exponential levels to this game."}, {"time": 4923, "text": "It's incredible that you're, didn't quit, didn't doubt yourself and just persevered through three Olympics to get to that highest, always fighting at that like very highest of levels, but just like, you know, from the top 10 to the top five, like really breaking in through that, I don't know."}, {"time": 4947, "text": "What would you say it took to get to that highest of levels?"}, {"time": 4950, "text": "Like if you, when you look back to all the weight cuts, to just the insane amount of injuries, believe it or not, I didn't really think I was there until 2013."}, {"time": 4962, "text": "I thought I was recognized as one of the best because I was able to fight for Oppensburg, which was the professional Bundesliga team for Germany, which is one of the top clubs in all of Europe."}, {"time": 4974, "text": "When they asked me to, I felt like Europe had like accepted me as like, oh, I'm a top level judo player, but I don't necessarily think that when I signed on to compete for them, that the division or the world of judo saw me as a top level judo player, right?"}, {"time": 4991, "text": "There's a mental shift that happens along that point."}, {"time": 4996, "text": "And for me, my mental shift really came into play in December of 2015 before Rio."}, {"time": 5006, "text": "That was like, when I lost in Japan, that's when I realized like the world respects my abilities and they compete against them."}, {"time": 5017, "text": "They don't compete against me as a person."}, {"time": 5020, "text": "They compete against the idea or the persona that I've been able to establish over the years of competing in the division."}, {"time": 5034, "text": "Wow, so you're the, they probably have a nickname for you."}, {"time": 5037, "text": "You're the system of ideas and thought that they study."}, {"time": 5042, "text": "But they're studying me as a conceptual whole, not me as the human."}, {"time": 5047, "text": "Is your style relatively unique in the 81 kilogram division?"}, {"time": 5054, "text": "It was relatively unique for Kayla, I and Jimmy up until 2016."}, {"time": 5060, "text": "Now since 2016, you can see a lot of what we used to do throughout most of Europe and even Asia."}, {"time": 5067, "text": "Like you're starting to see some of those techniques that you didn't see before starting to get implemented."}, {"time": 5072, "text": "Because when I was gearing up for 2015, I had such a slew of injuries that entire calendar year that I never should have made it to Rio."}, {"time": 5086, "text": "I should have called it quits at the end of 2015 because I suffered that major concussion in February."}, {"time": 5094, "text": "I stepped on a mat in May for the first time."}, {"time": 5097, "text": "I lost five straight tournaments."}, {"time": 5099, "text": "I left the national team, went to Japan, won Pan Am games, got a bacterial infection at the Worlds, almost had my leg cut off, tore my SI joint later on that year, and then took fifth in Japan."}, {"time": 5114, "text": "And when you look at like the calendar year as a whole, like the world should have treated me like I was washed up."}, {"time": 5122, "text": "Like this guy hasn't been training, he hasn't been doing anything, but I took fifth in Japan."}, {"time": 5126, "text": "Now, how does a guy that hasn't trained all year take fifth at one of the hardest tournaments in the world on two weeks of training?"}, {"time": 5135, "text": "Because they were fighting the guy I used to be, not the guy I was at the tournament, which means they were competing under the idea of like, what is he really capable of?"}, {"time": 5148, "text": "Not what have I brought to the table today?"}, {"time": 5153, "text": "And that just gave you the confidence."}, {"time": 5154, "text": "And that told me that like, well, if I can take fifth and I'm this bad at judo right now, wait until I'm healthy and I'm back in shape, then they're not gonna know what hit them."}, {"time": 5164, "text": "One of the essential components of being the number one in the world or up in that place is that confidence, the self belief."}, {"time": 5171, "text": "And the rest of the world believing it."}, {"time": 5174, "text": "You can have all the confidence in the world, but if the rest of the room doesn't buy it, it's nothing."}, {"time": 5181, "text": "It's like, there's certain people, right?"}, {"time": 5182, "text": "Oh, Tyson, Mike Tyson."}, {"time": 5184, "text": "They all understand he could not train and they're still scared, right?"}, {"time": 5190, "text": "Like he doesn't have to work out that hard anymore."}, {"time": 5192, "text": "There's several judo, you know this way better, but from a spectator perspective, like Ilias Iliadis is like that."}, {"time": 5198, "text": "He's one of them."}, {"time": 5199, "text": "It's like, he."}, {"time": 5201, "text": "He's portrayed over the years."}, {"time": 5202, "text": "Why is everyone so scared of that guy?"}, {"time": 5207, "text": "People were scared of you too."}, {"time": 5209, "text": "People just gave a certain level of respect to my skillset and whether I had a bad weight cut or didn't have a bad weight cut or not trained for the last three months, which never happened, I'm just saying, they were gonna fight the persona."}, {"time": 5226, "text": "And it's an important distinction when you're looking at the top five because everybody coming up, they're training against the persona, not who you are."}, {"time": 5236, "text": "Even I did that at a younger age."}, {"time": 5239, "text": "That's why I would always go to people's hometowns because I don't care about the persona."}, {"time": 5245, "text": "I wanna know what you do day in and day out."}, {"time": 5247, "text": "When I couldn't beat a Russian, I told Jimmy, send me to Russia."}, {"time": 5250, "text": "I need to understand and see it with my own eyes what they do, outperform, so that I can believe that I can beat them."}, {"time": 5259, "text": "Can I ask you on this, a small tangent."}, {"time": 5263, "text": "Dagestan has produced some incredible wrestlers."}, {"time": 5266, "text": "I don't know what the story with judo is, where the source of greatness in Russia is for judo, but what do you make of Dagestan?"}, {"time": 5275, "text": "Why, what is it in the culture of there or Russia broadly that produces greatness?"}, {"time": 5282, "text": "Specifically in the combat sports."}, {"time": 5285, "text": "I don't know, yeah, specifically in the combat sports, sorry, but I don't know if you wanna draw a distinction between wrestling and judo."}, {"time": 5290, "text": "I'm almost curious, do you understand the differences there in the culture?"}, {"time": 5295, "text": "It's still a combat sport to them."}, {"time": 5297, "text": "They're still in that same like realm of they're taking young kids and that's what they do."}, {"time": 5306, "text": "So Khabib speaks very highly of judo."}, {"time": 5309, "text": "It's funny, Khabib, Vladimir Putin."}, {"time": 5313, "text": "People don't get it, but like judo is like one of the premier sports in the world, but we just don't understand it."}, {"time": 5319, "text": "It's not just popularity, so definitely popularity, but also like this respect."}, {"time": 5324, "text": "And there's a certain thing, which is why I really value judo internationally."}, {"time": 5330, "text": "You don't get this in the United States, but internationally there's an understanding, like later in life, when you're a scientist meeting a businessman, when you both have done judo, there's this like nod of respect."}, {"time": 5346, "text": "There's very few sports like that."}, {"time": 5347, "text": "Basketball doesn't have any, I don't know almost any sport like that."}, {"time": 5352, "text": "Wrestling has that in the US, but it's the US only."}, {"time": 5356, "text": "The rest of the world doesn't do that."}, {"time": 5358, "text": "There's a few, like you could see that in like Iran or something like that."}, {"time": 5361, "text": "They'll respect wrestling in that kind of way."}, {"time": 5366, "text": "But judo on like a global scale is probably that only one, due to its like physicality and the hardships that you have to go through to reach that upper level."}, {"time": 5378, "text": "So why do you think Dagestan, why do you think Khabib is as good as he is?"}, {"time": 5381, "text": "Is this just the raw genetics of the human or is there something about the system?"}, {"time": 5388, "text": "It's all has to do with the system."}, {"time": 5390, "text": "So they grow up around fighting in all forms."}, {"time": 5397, "text": "They're also, I mean, their technique is exceptionally good."}, {"time": 5400, "text": "Because they grow up in it."}, {"time": 5402, "text": "They grow up in it."}, {"time": 5403, "text": "They don't understand anything else."}, {"time": 5408, "text": "So you don't have to, it's almost like you with the weight cutting."}, {"time": 5411, "text": "It's not like a big dramatic thing for them to fight."}, {"time": 5413, "text": "It's like, this is just part of life."}, {"time": 5416, "text": "And when you're, I don't wanna say bred into it, but when you've done it for, I wanna say like 90% of your life by the time like Khabib probably has, right from the time he could crawl, he's probably even grappling in some fashion thereof, right?"}, {"time": 5437, "text": "When you, as grapplers, like you can look at a wrestler and having never seen this person before and go, you wrestled."}, {"time": 5448, "text": "It's because he's probably wrestled since he was like six."}, {"time": 5451, "text": "So the way he carries himself, the way his body is built, the way he grew into it was framed around wrestling, right?"}, {"time": 5460, "text": "So the people in that culture are framed around fighting and grappling."}, {"time": 5467, "text": "First of all, philosophically, psychologically, but also just like the way you move your body."}, {"time": 5473, "text": "That means like when you're young, the people you admire move their body in a certain kind of way."}, {"time": 5477, "text": "And then genetically, it just, as they keep doing that, they're just gonna get better and better every generation."}, {"time": 5486, "text": "It's just gonna keep improving because they just keep building into that system of turning them out."}, {"time": 5491, "text": "And part of it, there's like cultural stuff where, I mean, it's such an interesting approach to wrestling."}, {"time": 5496, "text": "I really wanna travel to Dagestan and just talk to them because I happen to be able to speak Russian."}, {"time": 5502, "text": "Because there's less value for this kind of materialistic success that I think sometimes can get in the way of greatness, it seems like."}, {"time": 5514, "text": "It makes coaching more difficult."}, {"time": 5516, "text": "It makes like following orders as an athlete more difficult."}, {"time": 5520, "text": "We struggle with that in USA judo."}, {"time": 5523, "text": "Cause you want more money, but then more money, if not applied correctly, can corrupt the system."}, {"time": 5529, "text": "Somehow it can split people up."}, {"time": 5531, "text": "It's just, it's same thing with the prestige around certain medals over others because athletes start chasing fame instead of development."}, {"time": 5543, "text": "Yeah, that's, I mean, the Setia brothers are famous for this, like ignoring fame, ignoring all of this, like focus on the art itself."}, {"time": 5551, "text": "Not even, so it's not even the medals, exactly like you're saying, just the purity of like when you're in it and let everybody else figure out their stupid medals and money and all that."}, {"time": 5561, "text": "Cause it comes."}, {"time": 5562, "text": "It comes."}, {"time": 5563, "text": "It's a result."}, {"time": 5565, "text": "Like it's not that you don't appreciate it, but you know that it comes if you focus on the art."}, {"time": 5570, "text": "There's a distinction when you're talking about your athletic career or really any endeavor, right?"}, {"time": 5578, "text": "The problem with goal setting is nobody teaches the athletes or the people how to transition from the goal to reality, right?"}, {"time": 5588, "text": "So when you look at my career as a whole, like when I was getting ready for 2008, I actually forgot to train for it."}, {"time": 5597, "text": "I was so happy at such a young age that I became an Olympian that that in and of itself was a goal that I thought had to be admired, had to be celebrated that, you know, the games are right around the corner."}, {"time": 5610, "text": "I didn't really come down off that high."}, {"time": 5612, "text": "You're the local optimum of just winning the trials."}, {"time": 5617, "text": "That was."}, {"time": 5618, "text": "It's a big thing."}, {"time": 5620, "text": "But then you're just focusing on the accomplishment, not the."}, {"time": 5623, "text": "But at some point, right, when I went into London, I actually went into London going with, I'm gonna prove I'm the best in the world cause I believe I'm the best in the world."}, {"time": 5635, "text": "And I believe it from like the bottom of my soul that I'm winning this."}, {"time": 5640, "text": "And then you're almost like trying to tell the universe, like I'm accomplishing this thing because it's a goal."}, {"time": 5647, "text": "But when I went into Rio, I just accepted the fact that I was winning."}, {"time": 5653, "text": "It's not a goal."}, {"time": 5654, "text": "Like this is happening."}, {"time": 5656, "text": "You visualize it."}, {"time": 5658, "text": "But I felt it."}, {"time": 5659, "text": "You felt it."}, {"time": 5661, "text": "Like this is no longer a goal anymore."}, {"time": 5664, "text": "Like I anticipated, like this is happening."}, {"time": 5667, "text": "I can see this coming down the path because I'm anticipating that the games is happening and I'm gonna win."}, {"time": 5675, "text": "It's an anticipation."}, {"time": 5676, "text": "And there's a distinct distinction there between the two."}, {"time": 5681, "text": "Okay, so for people who are just watching the video of this, there should be an overlay of Young Travis."}, {"time": 5690, "text": "This is, you still had to make 81."}, {"time": 5692, "text": "Is this still a tough cut here?"}, {"time": 5694, "text": "No, this one was relatively easy."}, {"time": 5696, "text": "This is going all the way back to 2008."}, {"time": 5699, "text": "So this is the summer before the games."}, {"time": 5703, "text": "This probably happened in June, I would say."}, {"time": 5708, "text": "So this is the Olympic trials."}, {"time": 5711, "text": "So in the United States, you have to, I mean, similar to like wrestling, you have to win the trials to qualify for that particular division to represent the United States."}, {"time": 5721, "text": "So this is, you said June before an August Olympics?"}, {"time": 5725, "text": "So here, I just wanted to show this match because what was, there's another one."}, {"time": 5731, "text": "I think you do a pin, you do some nice ground work in the other one."}, {"time": 5734, "text": "But in this one."}, {"time": 5737, "text": "Fighting a teammate."}, {"time": 5740, "text": "Former teammate."}, {"time": 5741, "text": "Oh, there's an old school double leg."}, {"time": 5742, "text": "I forgot about that."}, {"time": 5743, "text": "And it's weird to see."}, {"time": 5745, "text": "So there, the Travis's opponent, and Travis is setting up here that Sayonagi posting his left arm and getting it done."}, {"time": 5759, "text": "That's a big, that's a big throw."}, {"time": 5761, "text": "You don't have too many of those big throws on video."}, {"time": 5766, "text": "Cause like you often on video, you're going against the best people in the world."}, {"time": 5769, "text": "It's tough to get like that much air."}, {"time": 5772, "text": "And a lot of times the ones that we do see and the part that a lot of people don't experience is a lot of those times where I threw people with that throw, it was in training camps."}, {"time": 5785, "text": "So by the time I got to the competition with these guys, they were playing a hundred percent defense to never let me do that."}, {"time": 5794, "text": "So you do this here."}, {"time": 5796, "text": "Are you kind of pulling him down?"}, {"time": 5798, "text": "No, he's, I'm trying to get him to come up."}, {"time": 5801, "text": "But are you pulling him down to get to fake him out?"}, {"time": 5803, "text": "I'm not doing anything with my left hand."}, {"time": 5806, "text": "So here the opponent is."}, {"time": 5808, "text": "So what I'm doing right now is his head is like in my chest."}, {"time": 5812, "text": "I'm pressing him to get his head to lift with my chest."}, {"time": 5818, "text": "So I'm pressing his hand down so I can use my chest to like pinch my scaps and roll his head up so that he wants to pick it up."}, {"time": 5826, "text": "And then he, I mean, doesn't he know what's coming here?"}, {"time": 5830, "text": "Oh no, he might not."}, {"time": 5832, "text": "Oh no, he knew, he was a former teammate."}, {"time": 5834, "text": "He knew exactly what I was trying to do."}, {"time": 5836, "text": "And that was a really big step with your right foot."}, {"time": 5840, "text": "It covers about four feet in distance."}, {"time": 5846, "text": "And your left catches up in like perfect position."}, {"time": 5852, "text": "Yeah, you back it up a little bit."}, {"time": 5856, "text": "Keep going, keep going."}, {"time": 5859, "text": "Right there, this is like an important distinction between mine and everybody else's is because I split his hip, I actually, once I'm able to split, I no longer need his center of gravity below mine."}, {"time": 5875, "text": "Right, and when you say split, you mean you put your foot in between."}, {"time": 5879, "text": "I do that split, that four foot split."}, {"time": 5882, "text": "And then when I get my feet back together, it doesn't matter that I'm under his center of gravity or not."}, {"time": 5889, "text": "That's why my chest is right around his sternum height for me."}, {"time": 5895, "text": "Yeah, so there, I mean, how does he get, for people just listening to this, Travis Steps does a big, huge step, gets."}, {"time": 5903, "text": "Like my hip is probably right around his nipple because he's sprawled back so much."}, {"time": 5910, "text": "So like, so you're, how does the physics of this work?"}, {"time": 5913, "text": "You're violating the principle of your center of mass being under, oh, I guess somehow it is."}, {"time": 5918, "text": "I don't know, but he has nowhere to go."}, {"time": 5920, "text": "He's screwed."}, {"time": 5921, "text": "Yes, that's the kicker is the way mine works is in order for him to play an effective defense, he needs to have his feet firmly planted on the ground with friction."}, {"time": 5936, "text": "Otherwise he can't press into me to stop it."}, {"time": 5939, "text": "So when I get him to sprawl back, when I split his legs, he effectively loses that contact with the floor."}, {"time": 5945, "text": "Even though his feet are on the floor, they're not in a position where he can drive from them."}, {"time": 5951, "text": "So therefore when I flip, he flips."}, {"time": 5952, "text": "So there's a natural like flailing here."}, {"time": 5957, "text": "So he's not falling forward."}, {"time": 5960, "text": "You're falling forward."}, {"time": 5962, "text": "He's just attached to you."}, {"time": 5963, "text": "So like you can keep him up there and then like legs would be just flailing."}, {"time": 5967, "text": "Yep, one of my golden rules when I'm training and I get really tired, one of the like mantras I would always tell myself is I'm gonna put my back on your chest and then I'm gonna put my back on the floor."}, {"time": 5980, "text": "It's gonna be underneath me."}, {"time": 5981, "text": "That's a good principle to."}, {"time": 5982, "text": "It's very simple."}, {"time": 5983, "text": "And it, regardless of like all the chaos and how quickly things are happening, it's something I can just dumb everything down to and focus on."}, {"time": 5991, "text": "Regardless of the gripping situation, the footwork, all of that, get my back to your chest and then put my back on the floor."}, {"time": 5998, "text": "So this step of getting your back to their chest, like for people who are sort of more, like for example, for people like me, who are just like amateur Judo people, like there's all kinds of ways to prevent this turn from happening, the gripping and just everything."}, {"time": 6017, "text": "How difficult is it at the highest level to get into this position?"}, {"time": 6021, "text": "I mean, you make it look effortless often, but like to get to the position where you're from facing them to your back is to them."}, {"time": 6029, "text": "Is that like strategy?"}, {"time": 6030, "text": "Is that timing?"}, {"time": 6034, "text": "It's timing."}, {"time": 6035, "text": "It's like anything, like if I wanted to punch you in the face, like how hard is it to really do that if you know you can just play defense and block it?"}, {"time": 6044, "text": "The trick is to get them to play defense to something that never happened."}, {"time": 6050, "text": "And then you go through like another way."}, {"time": 6052, "text": "And then you just go through what would technically be your first plan if you planned on them playing defense."}, {"time": 6058, "text": "So I set the stage from the very beginning for this to work."}, {"time": 6063, "text": "So then this, you're celebrating here, it's a huge sort of, once a big accomplishments, big relief to qualify for the Olympics."}, {"time": 6074, "text": "And then you go into the Olympics and this is where I first saw Judo."}, {"time": 6079, "text": "And I kind of thought of them as the same as Judo and Jiu Jitsu."}, {"time": 6084, "text": "And I was really impressed by your performance in that Olympics."}, {"time": 6088, "text": "The footage nowhere to be found these days, but at that time I think you could still, you could watch it live on NBC Olympics or somewhere like that."}, {"time": 6098, "text": "And I remember watching several of your matches."}, {"time": 6101, "text": "One of them was the match against Ole Bischoff, the German."}, {"time": 6105, "text": "And I remember being, it'd be nice if you can talk to that match because I don't remember it."}, {"time": 6109, "text": "All I remember is being frustrated."}, {"time": 6114, "text": "By him not letting you play Judo."}, {"time": 6119, "text": "So obviously you faced him again four years later and there's a lot of frustration there as well."}, {"time": 6125, "text": "But I remember being extra frustrated in 2008."}, {"time": 6129, "text": "What was that match like?"}, {"time": 6130, "text": "So he might've been number one in the world at the time or up there?"}, {"time": 6133, "text": "He was up there for sure, especially going into 2008."}, {"time": 6138, "text": "He was really high up there."}, {"time": 6140, "text": "And did he win gold at that Olympics?"}, {"time": 6146, "text": "Because he silvered in London."}, {"time": 6147, "text": "It was the same Olympic final both in 2008 and London."}, {"time": 6152, "text": "Okay, so you're facing him there."}, {"time": 6155, "text": "Were you intimidated?"}, {"time": 6156, "text": "What was the strategy?"}, {"time": 6157, "text": "Can you talk to that match?"}, {"time": 6159, "text": "Because it kind of sets the stage for the rematch in 2012."}, {"time": 6163, "text": "Yeah, he was somebody that I had trained with in the past."}, {"time": 6168, "text": "And for some reason, when it comes to him and I, when we train together, it's more of a physical altercation than a Judo training session."}, {"time": 6179, "text": "It's just the coaches have had to break us up a few times."}, {"time": 6184, "text": "Or you guys get almost angry too?"}, {"time": 6187, "text": "It always goes farther than it should."}, {"time": 6192, "text": "We say hello to each other."}, {"time": 6193, "text": "But for some reason, when we train together, there's something about him and me that just oil and water."}, {"time": 6200, "text": "Could it be also the gripping?"}, {"time": 6201, "text": "Because he's a great gripping strategist."}, {"time": 6204, "text": "Does he frustrate you with certain kinds of grips and then you get pissed off and then you frustrate him?"}, {"time": 6208, "text": "And then he gets pissed off and then before you know it, somebody's kicked somebody or punched somebody in the mouth or done something."}, {"time": 6214, "text": "Yeah, so one of the only evidences we have online of you fighting him is your foot in his groin area is the only thing we have from that Olympics."}, {"time": 6226, "text": "From 2008."}, {"time": 6227, "text": "From 2008, yeah."}, {"time": 6228, "text": "And to answer everybody's question, yes, it was deliberate."}, {"time": 6232, "text": "Now you can say this."}, {"time": 6234, "text": "But yeah, I remember there being a lot of frustration."}, {"time": 6237, "text": "You're actually going for a lot of stuff like sacrifice throws."}, {"time": 6240, "text": "I mean, maybe you're not going for the highest scoring epons, but you're just trying to shake things up, if I remember correctly."}, {"time": 6246, "text": "Yeah, because when he, I was so young then that, and he was in his prime really at that time, right?"}, {"time": 6253, "text": "He must've been 24, 25, 26, world medalist, European champion at the time."}, {"time": 6262, "text": "And when he would grab me, I had that sense of feeling stuck."}, {"time": 6267, "text": "Like I was strong enough if I used all my strength to not let him do anything, but then you can't be offensive when you're using all your strength to hold onto the situation."}, {"time": 6278, "text": "So I was getting really aggravated because I couldn't generate any offense with every time I felt like I gained an advantage in the gripping scenario, he would take some obscure grip somewhere that was like, well, now I've got to go address this thing, give up what I gained and I have to go back."}, {"time": 6294, "text": "And if I were to think about watching the match now, it probably looked like a lot of flailing because we're just trying to generate enough to not get a penalty, but also not enough to where he could counter it."}, {"time": 6310, "text": "Did you think you could beat him like when you were walking into the match?"}, {"time": 6314, "text": "Until I gripped him for the first time, like, cause I had trained with him before, he felt stronger and more in shape than I've ever felt him that day."}, {"time": 6324, "text": "At that Olympics, which begs a whole nother question."}, {"time": 6330, "text": "But I remember when he grabbed me for that first time, I went, this is different."}, {"time": 6340, "text": "And there was a sense of panic at the time cause I was like, holy crap, where did this come from?"}, {"time": 6345, "text": "This is not the guy that I've trained with that I expected."}, {"time": 6351, "text": "Cause it was a definite like level change in like his ability, strength, speed, and stamina."}, {"time": 6357, "text": "Like looking back at that, can you explain that?"}, {"time": 6360, "text": "Is it just you being more, less confident because it was the Olympics?"}, {"time": 6365, "text": "It was, is there some kind of routine that he followed to like really level up in intensity for this particular event?"}, {"time": 6372, "text": "I've been told that he only gets to like his prime for like really big events."}, {"time": 6380, "text": "Like he doesn't train like year round like I would train, but when it comes to like the games, he doesn't do social media, he doesn't work, he lives, breathes, eats his training for the games, which could institute that level."}, {"time": 6397, "text": "Is there a, like Dan Gable famously said, like the one loss he had in college, he was doing a lot of media and stuff."}, {"time": 6404, "text": "Back then there was no social media."}, {"time": 6406, "text": "That was a huge mistake for him."}, {"time": 6408, "text": "Do you do social media, do you do like?"}, {"time": 6411, "text": "At that, at this point?"}, {"time": 6412, "text": "Well, at that time it was like AOL."}, {"time": 6413, "text": "I don't know, what's 2008?"}, {"time": 6415, "text": "I didn't even have a Facebook page, a MySpace, nothing at this point."}, {"time": 6419, "text": "I got my first Facebook page from the USOC in 2012."}, {"time": 6424, "text": "When I went through the media thing, the lady was like, you have to have it."}, {"time": 6427, "text": "I go, I don't want it."}, {"time": 6428, "text": "I don't like people."}, {"time": 6429, "text": "I want to deal with the people."}, {"time": 6431, "text": "What am I supposed to do?"}, {"time": 6433, "text": "You know, like the social part of the social media."}, {"time": 6437, "text": "I have to bring this up because, and then you went on to face Tiago Camilo."}, {"time": 6442, "text": "You lost that match, but he went on to win bronze."}, {"time": 6444, "text": "That's also an interesting one, but we can skip ahead."}, {"time": 6447, "text": "I just remember being really impressed both by your groundwork."}, {"time": 6451, "text": "That was a match I should have won."}, {"time": 6454, "text": "I should have won that."}, {"time": 6454, "text": "I was, if you don't know judo, you would visually watch that and be like, I'm winning."}, {"time": 6460, "text": "But he was technically winning on the scoreboard."}, {"time": 6463, "text": "So it is what it is."}, {"time": 6464, "text": "But the point that he got that solidified his win, yes, it was a point back in those days."}, {"time": 6471, "text": "So I can't say anything, but like my shoulder nicked the ground."}, {"time": 6476, "text": "So it's like, I don't know."}, {"time": 6478, "text": "A lot of the stories of your Olympic career is like from a fan perspective, it seems like you should have won or you very close to could have won."}, {"time": 6489, "text": "And there was a lot of frustration in you and your game being like shut down in certain ways."}, {"time": 6494, "text": "But like the thing that immediately grabbed me in 2008 was how much, something about the way you approached judo, how much you wanted to win."}, {"time": 6504, "text": "Cause I was young then."}, {"time": 6506, "text": "I was, when I was at this time of my career, I was out to like win."}, {"time": 6514, "text": "Like there was no like, I'm going to grab you, I'm going to throw you."}, {"time": 6517, "text": "And if not, you're going to go through a battle."}, {"time": 6521, "text": "You're going to make sure you earned it."}, {"time": 6522, "text": "It so happened that you competing in 2008, I was, I became a fan of yours at that moment."}, {"time": 6531, "text": "And since then, I kind of knew about judo."}, {"time": 6535, "text": "My university had a judo club and I kind of knew about jujitsu from mixed martial arts."}, {"time": 6541, "text": "And obviously I wrestled for many years before and I love wrestling, but there's something about you competing that made me, well, there's no other way to say it, but it like changed the direction of my life."}, {"time": 6552, "text": "Cause it forced me to say, you know what?"}, {"time": 6555, "text": "I'm going to start judo and jujitsu."}, {"time": 6558, "text": "And first of all, for that, I'm really grateful, but it's fascinating to think, because this kid who's 22 years old, I'm sure I'm not the only one that you've influenced, like you've changed the direction of my life."}, {"time": 6570, "text": "And there could be huge number of others like that."}, {"time": 6573, "text": "I mean, that's the power of you as an individual at the, on the Olympic stage."}, {"time": 6578, "text": "You ever think about the pressure of that?"}, {"time": 6580, "text": "Did you, did you think as a 22 year old, there's a bunch of people, like I know I'm not the only one who changed."}, {"time": 6586, "text": "I just happened to have like a microphone recently."}, {"time": 6591, "text": "Like, is that, it's fascinating to think about, right?"}, {"time": 6594, "text": "Like you, perhaps you didn't think about this."}, {"time": 6597, "text": "It's just, it's just a judo match, but you like, you influenced hundreds of thousands of people if not millions."}, {"time": 6603, "text": "Is that interesting?"}, {"time": 6604, "text": "It's, it's not something that really hit me until 2012 when I lost, because that's when like, I would say like the world felt bad for me at that point."}, {"time": 6625, "text": "And that's when you knew that like people were watching and people were inspired by the loss because of how much went into that match."}, {"time": 6636, "text": "Because, you know, the 99% of us who watched it thought I won, except for the 1% of the people who were considered judges at that day in the event."}, {"time": 6649, "text": "But I mean, that's the, the win or lose, that, that was a really inspiring match."}, {"time": 6654, "text": "And that's when it, that's when it dinged that like, because I don't, I don't watch something and really get inspired by like the person and the act."}, {"time": 6665, "text": "It's like a, it's an accumulative thing."}, {"time": 6668, "text": "But for a lot of people, like when they watch how much goes into it, and then when I broke down on the match, like the amount of suffering that happens when you lose a match like that."}, {"time": 6680, "text": "And then, you know, really coming back and winning in Rio, there's a trend of people who were inspired that knew about London."}, {"time": 6690, "text": "And then when they found out I won in Rio, that's when like people like in droves felt like they could overcome their own personal obstacles to still achieve something because they've witnessed somebody who's fallen and gotten back up."}, {"time": 6707, "text": "But it's not something that you think about like on the day."}, {"time": 6712, "text": "It's when you look back and you go, oh, cause and effect."}, {"time": 6715, "text": "I wonder if you can comment on that."}, {"time": 6717, "text": "I'm trying to realize and live up to the fact that there's like young people that come up to me and I'm starting to realize like certain words I say will have a long lasting impact on them."}, {"time": 6732, "text": "Cause you say it as like, you don't even, it doesn't just, the whim."}, {"time": 6736, "text": "Some of them might come back 30 years later and a word I said was the reason they quit a thing and started the new thing that led them to become their true self, like to find success, all that kind of stuff like."}, {"time": 6749, "text": "On the flip side though, some people based on the actions that we do today, even with this cast will alter the course of their lives forever."}, {"time": 6760, "text": "I had a guy one time, was it after London?"}, {"time": 6764, "text": "It must've been after London."}, {"time": 6766, "text": "He actually found me on Instagram, wrote me what seemed to be like a dissertation on Instagram about how much I disrespected him 14 years earlier because I didn't step on a podium to take a picture after winning a tournament where he bronzed."}, {"time": 6787, "text": "And I'm thinking to myself, like at the time, like having dinner with my family because I had to leave the next morning was more important to me as a person, not thinking about who you potentially will become and the actions of whatever you do today, if you do become quote unquote famous or somebody in a spotlight, that that could come back to bite you."}, {"time": 6816, "text": "To me, I don't know about you, that's super motivating, like not to be a lesser version of myself ever."}, {"time": 6827, "text": "Just be on top of your game, whatever that game is, be on top of your game when you interacting with people and when you're just in your own private life."}, {"time": 6833, "text": "I'm trying to make sure that I'm the exactly same person privately as I am publicly and like making sure I'm on point."}, {"time": 6840, "text": "I see like just hanging out with Joe Rogan a lot."}, {"time": 6843, "text": "I see how he's, first of all, the exact same person."}, {"time": 6846, "text": "And second, he like walks around and there's like a huge number of fans and you'll just take pictures and like, it's very cool."}, {"time": 6854, "text": "And it's very cognizant of like certain words he says, especially young people, like they're going to take that."}, {"time": 6860, "text": "And that's going to be a memory for them for a couple of years that might be influential for the rest of their life."}, {"time": 6865, "text": "So I don't know, that's a cool responsibility, not to fuck it up."}, {"time": 6871, "text": "But anyway, I bring all that up to just say, thank you."}, {"time": 6878, "text": "So even if you like were frustrated that you didn't win a medal, at least you influenced one silly Russian kid to get into the martial arts."}, {"time": 6888, "text": "And what happens when you get into martial arts, it alters the direction of your life."}, {"time": 6892, "text": "Mine for the better."}, {"time": 6894, "text": "Okay, so let's go to London 2012 Olympics."}, {"time": 6900, "text": "One of the most dramatic judo battles of all time rematch."}, {"time": 6908, "text": "So you've reached the semifinals once again to face the German, Ole Bischoff."}, {"time": 6914, "text": "Do you mind if we step through that match a little bit?"}, {"time": 6916, "text": "Yeah, by all means."}, {"time": 6920, "text": "I've only ever watched the entire thing one time just because, fucking."}, {"time": 6929, "text": "So for context, for the listener, Travis, first of all, you don't like losing."}, {"time": 6937, "text": "I think that's fair to say."}, {"time": 6938, "text": "You know, the hard part with this match is because I went into this Olympics thinking, I'm gonna fucking win the Olympics."}, {"time": 6947, "text": "I'm the best in the world."}, {"time": 6950, "text": "I never in my right mind thought, oh, I'm gonna win a medal."}, {"time": 6956, "text": "Like that never crossed my mind."}, {"time": 6961, "text": "So it's like, I would have rather him just fucking beat me."}, {"time": 6968, "text": "Because then I lost."}, {"time": 6971, "text": "So here the referees, as many people thought, robbed you of a victory, but it was also a really close battle."}, {"time": 6978, "text": "Again, with many of the elements of frustration as 2008 in terms of strategically and gripping wise."}, {"time": 6985, "text": "And it was just a fascinating battle that went to overtime."}, {"time": 6988, "text": "So can you set the context?"}, {"time": 6990, "text": "So what did the bracket look like?"}, {"time": 6993, "text": "Who were the players here?"}, {"time": 6995, "text": "Who did you beat leading up to this match?"}, {"time": 6998, "text": "As you walk onto the mat, what happened the hours before?"}, {"time": 7003, "text": "As you're standing there."}, {"time": 7004, "text": "How bad is it when two people are standing like this?"}, {"time": 7010, "text": "That fucking guy, man."}, {"time": 7012, "text": "But this bracket was really interesting if you look at like the backstory of 81 kilos, like leading up to the Olympics, right?"}, {"time": 7023, "text": "Because at this point in time, I was inside the top 10 at all times, eight, seven, five, four, sixes."}, {"time": 7034, "text": "I fell out of there sometimes due to injuries, but I always climbed back in."}, {"time": 7038, "text": "There was another guy from Azerbaijan that was the Olympic champion at 73 kilos in 2008."}, {"time": 7048, "text": "And the entire division got rocked by match one because his first match was with Antoine Valus Fortier of Canada."}, {"time": 7061, "text": "And everybody who saw the draw come out was like, the Azerbaijanis gonna win it."}, {"time": 7067, "text": "He's the former Olympic champion."}, {"time": 7069, "text": "He's pretty much won most of the major events, including at 90 kilos, because he just had smooth judo."}, {"time": 7076, "text": "And match one rolls around, match two rolls around."}, {"time": 7081, "text": "Antoine's in the shoot and he's looking around and he's like, the Azerbaijanis not here."}, {"time": 7089, "text": "Well, where is he?"}, {"time": 7090, "text": "No joke, he runs into the venue a match before, throws his gi on and runs onto the Olympic platform."}, {"time": 7100, "text": "Loses to the Canadian in like a three minute golden score battle."}, {"time": 7106, "text": "So do you think he warmed up?"}, {"time": 7108, "text": "Didn't, he ran."}, {"time": 7109, "text": "He literally ran into the venue, threw his gi on and ran out, did no judo."}, {"time": 7115, "text": "And there you see Antoine losing in the quarters."}, {"time": 7120, "text": "So how good was Antoine?"}, {"time": 7122, "text": "At this point in time, this is, I believe his first international medal was the Olympic games."}, {"time": 7130, "text": "So I don't think he'd ever meddled in Paris."}, {"time": 7133, "text": "He went into this bracket unranked, beating the ranked guy first round because he, I don't know if he missed the bus."}, {"time": 7142, "text": "I don't know if he was off his cycle and planned on losing cause he didn't want to test positive."}, {"time": 7149, "text": "There's a lot of like questionable things out there that could have potentially caused him to, run onto the Olympic platform for match one."}, {"time": 7161, "text": "But it catapulted Antoine into like a belief that like, I beat the seated guy, I'm ready."}, {"time": 7171, "text": "And that was like a turning point in the Canadian's career just as a whole, right?"}, {"time": 7177, "text": "That's that everybody has a defining moment."}, {"time": 7180, "text": "Like mine was when I beat Bischoff in Dusseldorf at the grand prix for Germany after 2008, right?"}, {"time": 7189, "text": "I beat the Olympic champion in, on his home soil to go win the entire tournament."}, {"time": 7195, "text": "So we all have like those moments."}, {"time": 7197, "text": "It's just when it happens at the games, it throws the bracket like into a tailspin."}, {"time": 7202, "text": "Cause typically you'd know like who's going to beat who, where it's going to happen."}, {"time": 7207, "text": "And when you look at my quarter final against the Brazilian, what most people don't know is I was, I was so thankful I had that match."}, {"time": 7216, "text": "Most people would never in a million years be like, I want to fight the world number one at the Olympic games."}, {"time": 7222, "text": "That's what I want to do."}, {"time": 7223, "text": "I want to be the eighth seed fighting the world number one cause I'm going to win."}, {"time": 7227, "text": "I was pissed off at him."}, {"time": 7229, "text": "I was so angry because we, we were at the Pan Am's I think the year before and there was a team tournament and I wanted to fight him."}, {"time": 7240, "text": "I had lost the quarters to a Cuban, I think."}, {"time": 7246, "text": "In like the first gripping exchange, he threw me with a drop sale out of nowhere."}, {"time": 7251, "text": "So I wanted my hands on the Brazilian and the team match."}, {"time": 7255, "text": "Well, the Brazilian team is warming up."}, {"time": 7257, "text": "So I walk up to him, no joke."}, {"time": 7259, "text": "I walked up to him and I go, you're fighting."}, {"time": 7261, "text": "And he goes, not today."}, {"time": 7263, "text": "And I went, are you fucking kidding me?"}, {"time": 7266, "text": "I warmed up."}, {"time": 7266, "text": "I taped up that you're the only fucking guy I want to fight and you're going to fucking sit in the stands and read a goddamn book."}, {"time": 7272, "text": "I was so angry."}, {"time": 7273, "text": "I carried that anger cause I never fought him until this day."}, {"time": 7277, "text": "I was fucking pissed."}, {"time": 7278, "text": "I was ready to beat him."}, {"time": 7279, "text": "That's right, I forgot he was the world number one."}, {"time": 7284, "text": "Cause I remember being really excited at that match."}, {"time": 7287, "text": "How did you beat him?"}, {"time": 7288, "text": "I threw him with two hands on the same side, collar, like drop sale."}, {"time": 7292, "text": "I cross gripped, I yanked him behind me and I threw him."}, {"time": 7295, "text": "Epon?"}, {"time": 7296, "text": "Wazari."}, {"time": 7297, "text": "And then the match ended 30 seconds later."}, {"time": 7301, "text": "I was pumped."}, {"time": 7302, "text": "So fucking angry."}, {"time": 7303, "text": "I thought, okay, if I'm remembering correctly, I thought, okay, this guy might actually win gold."}, {"time": 7311, "text": "That's what made, for me as a spectator, remembering now the next match that much more like painful."}, {"time": 7320, "text": "And then the fans of judo that really followed the sport, the stats, when you look at the games and my draws, I had the worst possible draw as you ever could have imagined."}, {"time": 7331, "text": "At both London and Rio, I fought the world number one to get to the final or into the semis or past the semis."}, {"time": 7339, "text": "And everybody I fought in the draw either beat me the last time we fought or I had never fought before."}, {"time": 7347, "text": "So I always held a loss going onto the mat at the Olympic games."}, {"time": 7350, "text": "How'd you feel about that, by the way?"}, {"time": 7351, "text": "Like what were your feelings about facing the Brazilian first?"}, {"time": 7356, "text": "Well, that was match three."}, {"time": 7358, "text": "In London, I fought the Slovenian guy first round who beat me."}, {"time": 7364, "text": "Where'd he beat me?"}, {"time": 7365, "text": "Was it the Worlds?"}, {"time": 7366, "text": "Might've been the Worlds."}, {"time": 7367, "text": "And then, Church's Ville, I fought in the second round who threw me for Wazari in Japan."}, {"time": 7374, "text": "And then, Leandro, who I don't think I ever fought, who was world number one."}, {"time": 7379, "text": "That avoided fighting me at the team tournament."}, {"time": 7382, "text": "But I mean, every single Olympics you've fought and you really stepped up."}, {"time": 7386, "text": "It's the only tournament I've ever prepped for."}, {"time": 7389, "text": "Mentally and physically and just the whole thing?"}, {"time": 7391, "text": "We never trained through this tournament like we did for the others."}, {"time": 7395, "text": "Or I would go into it injured."}, {"time": 7398, "text": "All right, well, let's talk about, you're standing there next to the German."}, {"time": 7404, "text": "He looked always smaller than you, but you said like strong."}, {"time": 7410, "text": "So what are you feeling now, Jimmy Pedro behind you?"}, {"time": 7413, "text": "I was fucking ready to take his head off."}, {"time": 7415, "text": "Did you have an idea of what you're gonna do?"}, {"time": 7418, "text": "Did you try to, do you're thinking of winning by Ypon?"}, {"time": 7421, "text": "Were you thinking like going for big throws, or take him in deep waters, outgrip him?"}, {"time": 7428, "text": "We were about to have a battle and I wasn't gonna throw him until he broke mentally."}, {"time": 7436, "text": "That was, there was no like, oh, this is gonna be a clean throw."}, {"time": 7440, "text": "That was never, that was never the thought process."}, {"time": 7445, "text": "So here, you know there's going to be a lot of gripping."}, {"time": 7450, "text": "So we're seeing a shit ton of gripping."}, {"time": 7454, "text": "And right here, he throws it, bang, close fisted."}, {"time": 7460, "text": "You got a lot of adrenaline."}, {"time": 7461, "text": "You seem calm."}, {"time": 7462, "text": "I'm pissed."}, {"time": 7463, "text": "You're pissed."}, {"time": 7464, "text": "Like, you don't look serious, you just look like."}, {"time": 7466, "text": "I'm looking at the ref like, cause he keeps telling me to get up."}, {"time": 7468, "text": "I'm like, I have blood running down my face."}, {"time": 7472, "text": "I go."}, {"time": 7474, "text": "Here, there's blood."}, {"time": 7476, "text": "See, and he's like, oh yeah, go fix it."}, {"time": 7477, "text": "And that's on your eyebrow somewhere?"}, {"time": 7479, "text": "Yeah, he split it just underneath it."}, {"time": 7482, "text": "So you split your eyebrow."}, {"time": 7483, "text": "And so in judo, they don't, they're allergic to blood, probably for a good reason."}, {"time": 7487, "text": "But they, so now you have to try to figure out how to tape that up."}, {"time": 7494, "text": "Which already sets up one of the most bad ass looks in judo history."}, {"time": 7500, "text": "First 15 seconds, busted my eye open."}, {"time": 7504, "text": "Was that getting in the way of your eyesight at all or no?"}, {"time": 7507, "text": "Damn, he looks good at gripping."}, {"time": 7510, "text": "How difficult is it to get a grip on that guy?"}, {"time": 7514, "text": "Like I'm struggling just to get my hand in the collar and he wasn't even blocking it."}, {"time": 7518, "text": "Is he being cagey?"}, {"time": 7519, "text": "Remember like, is he interested in offense?"}, {"time": 7523, "text": "He's a very cagey, you know, methodical player."}, {"time": 7527, "text": "Like he, he never opens himself up."}, {"time": 7532, "text": "You grabbed the leg as part of a combination."}, {"time": 7535, "text": "And people have told me that he's actually very good at throwing people."}, {"time": 7539, "text": "He just doesn't."}, {"time": 7541, "text": "So, but he just doesn't show it at these."}, {"time": 7544, "text": "Cause he, he doesn't care how he wins."}, {"time": 7546, "text": "He cares that he wins."}, {"time": 7549, "text": "Which makes him very difficult to beat."}, {"time": 7551, "text": "Cause he knows when you've strategized to do that, where you look at the rule set and you develop a plan to get through the matches, then you've really got to figure out a way to get that person off that game plan."}, {"time": 7564, "text": "You know, whether you get ahead by a penalty or something."}, {"time": 7568, "text": "Right there."}, {"time": 7570, "text": "Like, he wouldn't give me the sleeve, so I grabbed all of his fingers."}, {"time": 7577, "text": "In which I open like, like this way or?"}, {"time": 7581, "text": "I grabbed them the other way and I started lifting them."}, {"time": 7584, "text": "Like I start, nice."}, {"time": 7585, "text": "Oh, like perfect."}, {"time": 7586, "text": "Reverse play and mercy."}, {"time": 7588, "text": "Oh, this is great."}, {"time": 7590, "text": "Cause he wouldn't give me the sleeve and I needed an attack."}, {"time": 7593, "text": "And then I'm like, okay, I can't hold onto this forever cause that judge is going to see it."}, {"time": 7597, "text": "So let me just do a quick throw here while I'm using the fingers in the mercy grip."}, {"time": 7600, "text": "You're holding on."}, {"time": 7602, "text": "And then I just sit out."}, {"time": 7606, "text": "And then he goes to get up and I go to get on top and right here."}, {"time": 7612, "text": "That elbow."}, {"time": 7613, "text": "You get him?"}, {"time": 7614, "text": "Oh, you got him."}, {"time": 7615, "text": "Yeah, it looks like I elbow him."}, {"time": 7617, "text": "Did you do it kind of?"}, {"time": 7620, "text": "At the time, I never knew this happened until after I watched this like three or four years later."}, {"time": 7626, "text": "Didn't even know, I didn't even feel it."}, {"time": 7628, "text": "Look at that."}, {"time": 7629, "text": "So he's legitimately angry here."}, {"time": 7630, "text": "Yeah, he's angry."}, {"time": 7633, "text": "And of course you can't, you can't move."}, {"time": 7635, "text": "Why would you move?"}, {"time": 7636, "text": "Look at this."}, {"time": 7637, "text": "This moment right there is gold."}, {"time": 7639, "text": "If you're not watching this on video, you're missing out."}, {"time": 7641, "text": "You never get this in judo."}, {"time": 7643, "text": "No, I don't know if that's ever happened."}, {"time": 7645, "text": "That little face off."}, {"time": 7646, "text": "Especially on a stage like this."}, {"time": 7649, "text": "The reference."}, {"time": 7650, "text": "And then he brings us in to like talk to us and he's like, hey, we're good, right?"}, {"time": 7653, "text": "Like, you guys aren't about to do what I think you're about to do."}, {"time": 7658, "text": "And he's like, hey, shake hands again."}, {"time": 7659, "text": "Cause the first time we did it, that wasn't good enough."}, {"time": 7661, "text": "Well, you gotta do it again."}, {"time": 7665, "text": "The heartbreaking part about this and why the IJF switched it to an unlimited golden score."}, {"time": 7671, "text": "Because we fought five minutes through the entire normal part of the match."}, {"time": 7677, "text": "And then we did the entire overtime period of three minutes."}, {"time": 7681, "text": "Not one penalty was given."}, {"time": 7684, "text": "No gripping infractions, no false attacks, like no stallings."}, {"time": 7688, "text": "Nobody was really backing up."}, {"time": 7691, "text": "I mean, he was, you know."}, {"time": 7692, "text": "So what was Jimmy telling you here?"}, {"time": 7694, "text": "Or was he talking to you at all?"}, {"time": 7696, "text": "He's not allowed to talk during medical things and my nose is now broken."}, {"time": 7701, "text": "But he's also, oh, the nose is broken."}, {"time": 7703, "text": "From what?"}, {"time": 7705, "text": "I caught an elbow from him."}, {"time": 7708, "text": "Glad his face is clean."}, {"time": 7710, "text": "And right here, I was pissed."}, {"time": 7712, "text": "I was so angry at the medic because he's fumbling around and I'm like, my whole plan is to break the German mentally."}, {"time": 7720, "text": "You gotta hurry up with the tape, man."}, {"time": 7722, "text": "He's supposed to be tired."}, {"time": 7723, "text": "He's not supposed to be resting."}, {"time": 7726, "text": "Is Jimmy yelling here?"}, {"time": 7728, "text": "He can't."}, {"time": 7729, "text": "No, not here, not here, but during the match."}, {"time": 7732, "text": "And you can see I just take it from him and I'm like, give it to me."}, {"time": 7734, "text": "I'm gonna do it myself."}, {"time": 7738, "text": "How scared is the medic?"}, {"time": 7740, "text": "He's like, this guy's gonna kill me."}, {"time": 7741, "text": "He can't even tear the tape."}, {"time": 7743, "text": "Look how nervous he is."}, {"time": 7746, "text": "We made fun of him for this so much throughout the years."}, {"time": 7750, "text": "Still do to this day."}, {"time": 7752, "text": "All right, here we go."}, {"time": 7753, "text": "Oh, you look great getting geared up."}, {"time": 7755, "text": "Can't really see, don't care."}, {"time": 7757, "text": "Was there some outcome in your mind that you could possibly beat him on the ground with a submission or a pin?"}, {"time": 7762, "text": "You knew you were gonna have to throw him."}, {"time": 7764, "text": "I knew I was gonna have to."}, {"time": 7766, "text": "If I was gonna throw him or armbar him or pin him, whatever the case may be, it was gonna be his mental like, I'm just tired of this."}, {"time": 7777, "text": "He's too cagey of a player."}, {"time": 7778, "text": "He's too experienced."}, {"time": 7781, "text": "He has to mentally make that choice to give that inch."}, {"time": 7784, "text": "And then you just have to be ready to take it."}, {"time": 7787, "text": "So I was just waiting for it."}, {"time": 7790, "text": "And so now this is four minutes in, one minute left."}, {"time": 7794, "text": "Oh, is that in your game plan two potentials like sumi gaeshi, like the sacrifice throws to him?"}, {"time": 7801, "text": "Cause the whole point of that technique and the sacrifice throws wasn't because I thought I was gonna throw him, but it disrupts the pattern enough to like get him to make a potential mistake."}, {"time": 7814, "text": "Like see, he should have gotten Ashido there."}, {"time": 7816, "text": "Hands in the face."}, {"time": 7818, "text": "But again, that's just part of judo."}, {"time": 7821, "text": "He poked me in the elbow."}, {"time": 7823, "text": "This is a rough match."}, {"time": 7825, "text": "Does he act at all or no?"}, {"time": 7827, "text": "Like, was he acting frustrated or anything like that?"}, {"time": 7830, "text": "It was all like, he's like acting for the ref."}, {"time": 7834, "text": "Like, oh, that, all that kind of stuff."}, {"time": 7835, "text": "You're just going in hard, nonstop, like angry, aggressive, feeling cardio here at all."}, {"time": 7844, "text": "I don't, I didn't get tired during this."}, {"time": 7846, "text": "And then just always pressing for."}, {"time": 7848, "text": "Time runs out."}, {"time": 7850, "text": "Now we're into golden score."}, {"time": 7851, "text": "12 minutes and 38 seconds later."}, {"time": 7854, "text": "Yeah, you think about every judo exchange, right?"}, {"time": 7856, "text": "Every time we grip up, every time we attack, sometimes it can take longer to get back to the line than the entire exchange."}, {"time": 7863, "text": "So the more aggression, the more exchanges you have, the longer the time stretches."}, {"time": 7869, "text": "Then here, the six seconds left in golden score, your tape is now yellow and red with sweat and blood, literally, and time is out."}, {"time": 7883, "text": "Now, what are you thinking here?"}, {"time": 7884, "text": "Do you think you won the match?"}, {"time": 7886, "text": "I thought I won the match a minute ago."}, {"time": 7890, "text": "I remember thinking to myself, like if this goes to the flags, I won."}, {"time": 7896, "text": "No doubt in my mind."}, {"time": 7899, "text": "Because I felt like the whole time, like I was going to him, right?"}, {"time": 7905, "text": "He was never coming at me."}, {"time": 7907, "text": "Yeah, that's the way it felt."}, {"time": 7909, "text": "And like, that's the way it felt body language wise, just the intensity, how fast you're moving towards him."}, {"time": 7915, "text": "You're constantly going for throws."}, {"time": 7920, "text": "Now, if you want to rewind that, we can talk about the whole, because it's a part of this clip."}, {"time": 7925, "text": "So wait a minute, they all went blue."}, {"time": 7928, "text": "They all did."}, {"time": 7929, "text": "So in judo, there's three referees, two on the side, one in the center, and they all vote on who won."}, {"time": 7934, "text": "And now let's pause it right there."}, {"time": 7936, "text": "Now, the way this is supposed to work, they raise their flags, they do like a one, two count, and then on three, they all raise it together."}, {"time": 7944, "text": "Now, as a little pretext to this entire match, up until this point, not one match at the Olympic Games has ever been a split decision."}, {"time": 7954, "text": "Meaning out of three people, not one of them voted against the other group members."}, {"time": 7961, "text": "So they were all unified blue or all unified white."}, {"time": 7966, "text": "Which is statistically difficult to imagine."}, {"time": 7970, "text": "It's almost like they had a referee meeting and said, it's better for the Olympics."}, {"time": 7975, "text": "To never have a split."}, {"time": 7980, "text": "So the question becomes, if you would click that frame by frame, right?"}, {"time": 7988, "text": "So right now we have all the refs with their flags out and then click that."}, {"time": 7992, "text": "So the middle guy starts."}, {"time": 7995, "text": "He is all the way up."}, {"time": 7997, "text": "All the way up."}, {"time": 7997, "text": "The other side judges haven't moved."}, {"time": 8000, "text": "We now have one side ref all the way up."}, {"time": 8003, "text": "Then we have a third side ref all the way up."}, {"time": 8009, "text": "So there's a time point when the middle guy has the flag all the way up."}, {"time": 8013, "text": "If not 80, 90% of the way there."}, {"time": 8016, "text": "Then the other one does."}, {"time": 8017, "text": "And then the third one goes."}, {"time": 8020, "text": "So now the question becomes who really, like did the outside refs really have an opinion?"}, {"time": 8027, "text": "Or were they told to wait for the center one to start and then lift whatever flag the center ref picked?"}, {"time": 8041, "text": "It's very, honestly, it's very possible that they had this meeting."}, {"time": 8045, "text": "This is the problem with the Olympics."}, {"time": 8049, "text": "They sometimes, it's also the problem in the Soviet Union with communism."}, {"time": 8054, "text": "They think the committee knows what's good for the people and so on."}, {"time": 8058, "text": "So they decide universally as opposed to letting the magic of the Olympics be what it is."}, {"time": 8065, "text": "But nevertheless, in this case, the center ref decided blue."}, {"time": 8071, "text": "Like what do you think?"}, {"time": 8073, "text": "Do you think it's just a shitty call?"}, {"time": 8076, "text": "He has the right to pick."}, {"time": 8078, "text": "But the problem is the other two I don't think did."}, {"time": 8083, "text": "And so when you do this frame by frame again, I can see from my own perspective two of the refs."}, {"time": 8094, "text": "And I see them both blue."}, {"time": 8095, "text": "So when you fast forward that a little bit to get to all the flags, I see the two go blue."}, {"time": 8103, "text": "And I go, I look over and I look at the other guy and I'm like, really?"}, {"time": 8108, "text": "All three?"}, {"time": 8110, "text": "I fought for eight minutes and I can't even get a vote."}, {"time": 8113, "text": "I didn't even get a penalty."}, {"time": 8115, "text": "I can't even get a vote."}, {"time": 8117, "text": "And that's when I broke."}, {"time": 8121, "text": "I like, oh, I couldn't believe it."}, {"time": 8125, "text": "And I'm not gonna lie, he looked shocked."}, {"time": 8132, "text": "And here you're on your knees."}, {"time": 8134, "text": "You're crying."}, {"time": 8135, "text": "Literally crying."}, {"time": 8138, "text": "But I think it's the end."}, {"time": 8139, "text": "That was such an amazing match."}, {"time": 8140, "text": "It was such a war."}, {"time": 8142, "text": "I mean, both people can't believe what happened."}, {"time": 8146, "text": "That's the, and like, honestly, I wish we had the rules that we do today, as far as the unlimited golden score, because I would have loved to have seen what would have happened."}, {"time": 8157, "text": "What was Jimmy saying here to you?"}, {"time": 8159, "text": "I mean, I guess there's nothing to say."}, {"time": 8164, "text": "He was kind of apologizing for the way the scores went."}, {"time": 8171, "text": "Cause he knows how badly you want it."}, {"time": 8173, "text": "He saw the match."}, {"time": 8174, "text": "And he felt I deserved to win it."}, {"time": 8176, "text": "Based on like, you know, what happened."}, {"time": 8179, "text": "But he probably with all his experience knows that this is what the Olympics are about."}, {"time": 8184, "text": "The refs sometimes."}, {"time": 8186, "text": "I mean, that's the magic of it, man."}, {"time": 8187, "text": "Well, and at the same time we're at, we're in the Olympic semi final in a sport that's dominated by certain continents."}, {"time": 8197, "text": "And when you look at the three refs on the mat, they're all European."}, {"time": 8203, "text": "You're telling me there couldn't have been one Pan Am, one African, one Oceana, you know, different."}, {"time": 8209, "text": "Like, why'd they all have to be European?"}, {"time": 8211, "text": "But to be fair, it's back to your sauna story."}, {"time": 8216, "text": "You've dealt with this stuff before."}, {"time": 8217, "text": "And you've won over this stuff before."}, {"time": 8220, "text": "And that's why, like, I was broken for life."}, {"time": 8222, "text": "And you thought you won here, that was."}, {"time": 8225, "text": "And when I hindered on that for a year and a half, like I couldn't even stand, I was done."}, {"time": 8233, "text": "But I'm pretty sure there's a slow motion replay on this when I watched it."}, {"time": 8236, "text": "Hey, he's all excited, that fucking guy."}, {"time": 8239, "text": "And he's all happy."}, {"time": 8240, "text": "It's a relief."}, {"time": 8241, "text": "Hey, hey, hi guys."}, {"time": 8243, "text": "I did it."}, {"time": 8246, "text": "Yeah, so here's like."}, {"time": 8246, "text": "Look at those teeth."}, {"time": 8247, "text": "My teeth are red."}, {"time": 8249, "text": "Slow motion replay of the flag being raised, the heart being broken, Travis just bending over."}, {"time": 8255, "text": "Right here, watch."}, {"time": 8255, "text": "Watch his reaction."}, {"time": 8256, "text": "Like, he, like, you could see his mouth, like, open in awe, like, really?"}, {"time": 8262, "text": "And he's looking at two refs just like I am."}, {"time": 8264, "text": "He didn't celebrate until he looked at the third one and said, oh, all three."}, {"time": 8269, "text": "So you think he knew he lost?"}, {"time": 8270, "text": "I think in his head, like, I don't think he really believed he was winning."}, {"time": 8275, "text": "He did enough to win, yeah."}, {"time": 8278, "text": "Because when his mouth dropped, like, oh yeah, hey, all three."}, {"time": 8283, "text": "Like, that's not really the reaction you would give."}, {"time": 8287, "text": "Yeah, I mean, that was, that's one of the greatest matches I've ever seen."}, {"time": 8292, "text": "I mean, obviously it's painful for you, but that pain, first of all, sets the stage for 2016."}, {"time": 8299, "text": "But even without that, I think it was just a beautiful story at the Olympics."}, {"time": 8305, "text": "You've still did incredible job at that Olympics."}, {"time": 8308, "text": "You stood toe to toe."}, {"time": 8310, "text": "I think in hindsight, having lost that match did more for me and more for the sport."}, {"time": 8320, "text": "As a whole, me losing that match."}, {"time": 8323, "text": "I mean, stories aren't about winning."}, {"time": 8326, "text": "Stories are about the fighting."}, {"time": 8327, "text": "So, and that made one hell of a story."}, {"time": 8330, "text": "But it also has to do with, you know, you know, treachery is probably not the right word to use."}, {"time": 8339, "text": "It's probably the wrong word entirely to use."}, {"time": 8342, "text": "But because of the conflict in the match and because of how the refs handled the match there at the end, it created controversy that was spoken about for months on world media, right?"}, {"time": 8358, "text": "I remember articles being written about the Olympics and, you know, the refing and how it was corrupt and that match was one of them."}, {"time": 8366, "text": "There was another one in fencing where like something happened with the timer where one of the fencers, I guess what happens in fencing, the timer resets up a second if it's down."}, {"time": 8379, "text": "So the fencer got one second played out, I think like 27 or 28 times and then one on like 30."}, {"time": 8388, "text": "So like there was like clock fixing for fencing."}, {"time": 8391, "text": "There was this match that I think just got publicity, good or bad."}, {"time": 8395, "text": "Publicity is publicity for judo."}, {"time": 8398, "text": "And then you came back to, I mean, this is the hard thing after this heartbreak to step up and continue fighting, right?"}, {"time": 8406, "text": "I really, really struggled."}, {"time": 8409, "text": "Like unbelievably struggled from 2012 to like 2014."}, {"time": 8414, "text": "I almost quit numerous times."}, {"time": 8417, "text": "I mean, at one point I got so mad at the IGF feeling like they were fucking me every step of the way."}, {"time": 8424, "text": "I threw a water bottle at a referee after a match."}, {"time": 8428, "text": "I cussed out a referee one time on a mat."}, {"time": 8430, "text": "I got suspended from the sport because I was just so angry at that point in time."}, {"time": 8436, "text": "And IGF is the International Judo Federation and are they the people that supply the referees basically like the certification?"}, {"time": 8442, "text": "They kind of run the sport on a global scale."}, {"time": 8445, "text": "So you sent a few emails 2014, 15, basically quitting."}, {"time": 8454, "text": "One of them said I'm mentally and physically broken."}, {"time": 8457, "text": "Another said, well, the subject line, I'm done."}, {"time": 8460, "text": "The weight cuts didn't break you."}, {"time": 8465, "text": "So if this broke you, you were really going through a hard time."}, {"time": 8469, "text": "I was like, you know what?"}, {"time": 8470, "text": "We're just gonna like dumb it down a little bit and get some wins under our belt."}, {"time": 8474, "text": "I'm gonna go to a world cup, which is like three stages down or four stages down from like the Olympic games."}, {"time": 8482, "text": "Like this should be like a cake walk."}, {"time": 8484, "text": "Like making the final of a world cup should be a walk in the park."}, {"time": 8490, "text": "I barely beat a 16 year old kid, barely."}, {"time": 8495, "text": "Then I got smoked in the second round."}, {"time": 8497, "text": "I got thrown three times."}, {"time": 8500, "text": "I was like, I'm fucking done."}, {"time": 8502, "text": "They changed all the fucking rules."}, {"time": 8504, "text": "They fucked me out of the Olympics."}, {"time": 8506, "text": "Like, what am I supposed to do?"}, {"time": 8509, "text": "And it was at that moment when I wrote the email where I remember sitting at a bar, I don't drink by the way, but I was sitting at a bar at the hotel sending this email and I got a response back from Jimmy and he goes, well, just stay for the training camp, go to Germany and then whatever happens, don't worry about it."}, {"time": 8530, "text": "We'll talk when you get home."}, {"time": 8532, "text": "I was like, fuck that, fuck these people, fuck the rules."}, {"time": 8536, "text": "I don't fucking care anymore."}, {"time": 8537, "text": "I'm just gonna do judo the way I wanna do judo."}, {"time": 8539, "text": "If I fucking get shit out, fuck them."}, {"time": 8542, "text": "That was my response."}, {"time": 8544, "text": "Can you become an Olympic champion?"}, {"time": 8546, "text": "Can you become an Olympic medalist?"}, {"time": 8548, "text": "With that kind of thinking, you think or no?"}, {"time": 8550, "text": "Was that, that's counterproductive?"}, {"time": 8553, "text": "Okay, just checking because maybe that's also liberating."}, {"time": 8557, "text": "The expectation was no longer that Travis is gonna win this tournament."}, {"time": 8561, "text": "The expectation was Travis is gonna come home and be fucking pissed off and we're gonna have to figure out how to manage a pissed off person that's trying to quit that shouldn't be quitting."}, {"time": 8570, "text": "And did people still believe that you can be a medalist again?"}, {"time": 8575, "text": "Like who believed that?"}, {"time": 8576, "text": "Jimmy believed it, the team managers believed it, some of my teammates still believed it, my training partners still did, but they're not the ones that are cutting the weight, flying around, feeling like all of your Judo is now null and void, right?"}, {"time": 8592, "text": "Because at this point, they took away leg grabs entirely."}, {"time": 8597, "text": "You couldn't break a grip with two hands, right?"}, {"time": 8600, "text": "The meta of Judo has changed again, right?"}, {"time": 8603, "text": "So I got fucked out of it."}, {"time": 8606, "text": "They took away how I did Judo again and now it's just got more difficult."}, {"time": 8610, "text": "So when I'm sitting in the hotel and I'm sending this email, I remember being at the training camp, I was like, I don't even fucking care what the rules are, I'm just gonna fucking throw people, I don't even care if I'm cheating, doesn't matter to me, I'll just play stupid, right?"}, {"time": 8626, "text": "So I just started going back and doing Judo without the leg grabs, but with all the same gripping that I was doing beforehand."}, {"time": 8634, "text": "And then when I got to Germany, I was like, I don't fucking care."}, {"time": 8638, "text": "I was like, if I gotta cheat to win, then I gotta fucking cheat to win."}, {"time": 8643, "text": "If I get sheeted out, then I get sheeted out and I won Germany."}, {"time": 8649, "text": "Which event in Germany?"}, {"time": 8650, "text": "The German Grand Prix, which was a week after losing the World Cup."}, {"time": 8656, "text": "Because I was trying to do Judo around the new rule set."}, {"time": 8660, "text": "I wasn't just trying to do Judo, right?"}, {"time": 8663, "text": "Because when you get to the highest level, your game tends to morph around what can you can or cannot get away with."}, {"time": 8673, "text": "I was more focused on trying to figure out what I can and can't get away with and I stopped actively doing Judo."}, {"time": 8680, "text": "Once I said, fuck whatever the rule changes are, I'm just gonna keep doing Judo the way I know how to do Judo and if I get a penalty, then so be it."}, {"time": 8688, "text": "And so that win, that started the road back."}, {"time": 8691, "text": "The road back, yeah."}, {"time": 8694, "text": "Cause now it's like, I don't care if you penalize me or not because I'm gonna throw that guy anyways."}, {"time": 8700, "text": "I'm gonna beat him anyways."}, {"time": 8702, "text": "And if I get a Shido for doing something wrong, then I'll just stop doing that one thing and just keep doing all the other things that they told me I probably shouldn't be doing but they're not calling me on it so I'm just gonna keep doing it."}, {"time": 8715, "text": "Well, you found yourself at the 2016 Olympics."}, {"time": 8721, "text": "Was that ever a doubt, by the way, after this, after 2014 in Germany?"}, {"time": 8727, "text": "I had a lot of doubt after the concussion in 2015."}, {"time": 8731, "text": "I remember when I first came back after four months of nothingness that even trying to train, the room would start to tilt the world on me."}, {"time": 8744, "text": "And then when I finally got over that and I could start doing things again, I stepped on the mat for the Pan Ams and I was like, drowning's not the right word but everything was being done in such a slow motion."}, {"time": 8757, "text": "I had sandbags everywhere that I just couldn't keep up."}, {"time": 8762, "text": "Like mental fog."}, {"time": 8764, "text": "Yeah, I remember fighting the Brazilian in the semifinal of Pan Ams."}, {"time": 8770, "text": "I was halfway through this match and I'm just like, eyes roll up, I'm like, I'm just gonna fucking wing it."}, {"time": 8776, "text": "And I just fucking winged it and I got countered and thrown free pwn and I was like, I don't even know what to do."}, {"time": 8781, "text": "And I couldn't even think clearly."}, {"time": 8784, "text": "And that's when I was like, I may not come back."}, {"time": 8788, "text": "You don't have control over how to come back from this."}, {"time": 8790, "text": "It's like, it's just your mind and it's not operating correctly."}, {"time": 8793, "text": "It's not like I can like, oh, my right hand's not working because it's fractured."}, {"time": 8797, "text": "Let me figure out a way I can not use that."}, {"time": 8799, "text": "Like when your mind's not working, like it's the one thing you need."}, {"time": 8804, "text": "Like you gotta have it."}, {"time": 8805, "text": "So I can work through anything else."}, {"time": 8807, "text": "I needed that though."}, {"time": 8809, "text": "And so how did you come back from that time?"}, {"time": 8811, "text": "That's when I wrote another email and I was like, I'm fucking off team USA."}, {"time": 8815, "text": "I'm not fucking, I'm all done with USA judo."}, {"time": 8817, "text": "I'm done with the tour."}, {"time": 8818, "text": "I was like, I quit."}, {"time": 8820, "text": "Well, I'm gonna go do my own thing."}, {"time": 8821, "text": "They were like, whoa, whoa, whoa, whoa, whoa."}, {"time": 8823, "text": "Can't quit now."}, {"time": 8824, "text": "Olympics is in like a year."}, {"time": 8825, "text": "Like let's talk about this again cause it's the second time I've tried to quit in like two years."}, {"time": 8832, "text": "So then we sit down in Jimmy's office and he's like, whoa, whoa, whoa, you can't quit."}, {"time": 8836, "text": "You're gonna kick yourself if you don't go to Rio."}, {"time": 8839, "text": "I'm telling you right now, don't do that to yourself."}, {"time": 8842, "text": "Let's figure out a way of like doing this."}, {"time": 8843, "text": "And I was like, because when we trained before, we did it as a unit, right?"}, {"time": 8849, "text": "We all went to the same tournaments."}, {"time": 8850, "text": "We all went to the same training camps."}, {"time": 8851, "text": "And I'm like, you guys are treating me like I'm the same player I used to be."}, {"time": 8856, "text": "I go, I don't, I'm not operating at the level you think I'm operating at."}, {"time": 8860, "text": "I go, I can't do that."}, {"time": 8861, "text": "And he goes, well, what do you wanna do?"}, {"time": 8863, "text": "And I go, I'll tell you what Jimmy, you know I'm being serious because my answer is something you'd never would have expected."}, {"time": 8869, "text": "I go, why don't you just send me to Japan for three weeks?"}, {"time": 8872, "text": "And he was like, really?"}, {"time": 8874, "text": "I hated Japan."}, {"time": 8875, "text": "I refused to go there up until this point."}, {"time": 8879, "text": "But I was like, I have to get to a point where I can get so tired and get through it that like my Judo will come back and my body will learn again."}, {"time": 8890, "text": "And when you say Japan, you mean the Kodokan, like what's Tokai, is that the highest level of Judo?"}, {"time": 8896, "text": "It's one of the top colleges in the world, yeah."}, {"time": 8898, "text": "And that's so you can go with the best people in the world."}, {"time": 8901, "text": "You can go to war with them."}, {"time": 8902, "text": "Top level, like strong players."}, {"time": 8904, "text": "Yeah, there's a lot of very strong players."}, {"time": 8907, "text": "There's a lot of middle class players and there's a lot of volume of rounds."}, {"time": 8912, "text": "So you value all of it, the middle class too, like the."}, {"time": 8915, "text": "Because when you're tired, like you can't just train in areas where you're battling for every inch."}, {"time": 8921, "text": "At some point you have to be successful, right?"}, {"time": 8926, "text": "So you still under duress and under strain and through exhaustion, you still have to have the ability to score."}, {"time": 8933, "text": "Well, if you're training with the best people in the world all the time, you're not always gonna be able to score."}, {"time": 8938, "text": "So you still need those B level players in order to really develop again."}, {"time": 8943, "text": "What is it like, if you can comment briefly on the training in Japan, what's it like to go into a different place?"}, {"time": 8951, "text": "You probably don't speak the language that well."}, {"time": 8954, "text": "Like, is there an isolation aspect to it?"}, {"time": 8957, "text": "Is it like purely about judo now?"}, {"time": 8959, "text": "I really want it to be isolated."}, {"time": 8962, "text": "No training partners, no coaches."}, {"time": 8964, "text": "I want it to get back to my roots and just learn how to fight again."}, {"time": 8970, "text": "I don't wanna figure out how to beat the German."}, {"time": 8972, "text": "I don't wanna figure out how I can develop a new entry into my sale against, you know, whoever it may be."}, {"time": 8982, "text": "You just wanna fight hard."}, {"time": 8982, "text": "You just wanna fight."}, {"time": 8984, "text": "Let me get back to fighting."}, {"time": 8985, "text": "Let me get back to like the root of who I am."}, {"time": 8988, "text": "What were those sessions like?"}, {"time": 8991, "text": "Five minute rounds?"}, {"time": 8991, "text": "Like what, how many?"}, {"time": 8993, "text": "Six minute rounds, 30 minute breaks, 14 rounds a session."}, {"time": 8998, "text": "Sorry, what's the 30 minute break?"}, {"time": 9000, "text": "30 second break."}, {"time": 9005, "text": "14?"}, {"time": 9008, "text": "Every day?"}, {"time": 9010, "text": "Like five days a week and then 11 or 12 rounds on Saturday."}, {"time": 9017, "text": "Plus weightlifting, plus running."}, {"time": 9021, "text": "So those are hard rounds."}, {"time": 9023, "text": "What's it feel like to go through that?"}, {"time": 9025, "text": "So you have a bunch of just a sea of black belts, Japan."}, {"time": 9031, "text": "I'm sure they're hunting you a little bit."}, {"time": 9033, "text": "Depending on who you are."}, {"time": 9035, "text": "I was hunted a little bit."}, {"time": 9036, "text": "Like I didn't really struggle because of who I am."}, {"time": 9039, "text": "Them as college athletes, they wanna show to their coaches and their higher players, like, oh look, I can throw the world number whoever."}, {"time": 9050, "text": "But if you're just a guy who shows up, like them beating you doesn't provide any value or raise their status."}, {"time": 9057, "text": "No, but you're status raising."}, {"time": 9060, "text": "So I was actually like in a situation where nobody was watching me and I was free to just battle at my own will."}, {"time": 9070, "text": "Which is what it was about for me."}, {"time": 9072, "text": "And you just push yourself."}, {"time": 9074, "text": "Because I knew how to do that."}, {"time": 9075, "text": "I know how to push myself."}, {"time": 9077, "text": "Are you, when you're doing these 14 rounds, is every single one a standalone thing for you?"}, {"time": 9084, "text": "So you're not trying to pace yourself?"}, {"time": 9086, "text": "Each one is to as much exhaustion as I can get."}, {"time": 9089, "text": "But then there must be ones where like it's like round nine where you got nothing left."}, {"time": 9095, "text": "Better figure out how to score."}, {"time": 9096, "text": "That's all you gotta do."}, {"time": 9098, "text": "You gotta survive and you gotta score."}, {"time": 9101, "text": "What's your memories of that, of those three weeks?"}, {"time": 9104, "text": "What's like, what stands out to you?"}, {"time": 9106, "text": "It seems like, cause that's the place where you found the silver medal."}, {"time": 9113, "text": "Because it's the place most people don't want to be."}, {"time": 9117, "text": "Everybody's comfortable."}, {"time": 9119, "text": "I would rather, I would rather find out who I am and what I'm made of and find those, those end points."}, {"time": 9126, "text": "And if I can't find them, then that means everybody else has given up before me."}, {"time": 9134, "text": "Were there a few people that just kinda, you returned to battle over and over in those times and then it was just."}, {"time": 9144, "text": "No social media."}, {"time": 9146, "text": "None of that, it's just like two men."}, {"time": 9148, "text": "You lock yourself in your room, you come back, you've thought about it and you come back with a game plan for that day."}, {"time": 9155, "text": "Against some players here or there and I would, I would develop a hit list."}, {"time": 9160, "text": "Like I would be like, oh, that motherfucker grabbed me at like 13 and I watched him sit fucking four rounds and then come try to kick the shit out of me."}, {"time": 9168, "text": "I'm gonna fucking grab that guy early and I'm gonna beat the shit out of him."}, {"time": 9171, "text": "And you just develop that list."}, {"time": 9173, "text": "There's probably some epic battles in that room, right?"}, {"time": 9177, "text": "What's it look like?"}, {"time": 9178, "text": "Like how crowded is it?"}, {"time": 9181, "text": "And so you're just like, yeah."}, {"time": 9182, "text": "Just sea of people."}, {"time": 9184, "text": "Sea of people."}, {"time": 9185, "text": "And you're trying to, are you doing groundwork at all?"}, {"time": 9189, "text": "No transitions, no nothing."}, {"time": 9190, "text": "But if I get pissed off and like you keep dropping or like not letting me do what I wanna do, I'll rip a choke right across your face."}, {"time": 9196, "text": "Just to let you know that like, and if I wanted to."}, {"time": 9198, "text": "You have a really nice style of just like respectfully bullying the shit out of people."}, {"time": 9206, "text": "Cause some people call me a bully and I have to remind them that like a bully enjoys like beating up the weak."}, {"time": 9215, "text": "I wanna beat the person that fights back."}, {"time": 9218, "text": "It's not fun for me if you don't fight back."}, {"time": 9221, "text": "Some of the greatest people I've seen like do this, they basically, you have this in the Iowa wrestling rooms, they'll push each other into the wall."}, {"time": 9229, "text": "Like they get, there's like anger, but it's ultimately underneath it all."}, {"time": 9233, "text": "It's like a deep respect."}, {"time": 9235, "text": "I was training with Colton Brown one time and I went to San Jose State cause I was in California for something."}, {"time": 9241, "text": "And he kept like, he kept circling to the edge."}, {"time": 9244, "text": "They had like a cupboard that had like, when you opened it, it had like all the tape and like medical supplies."}, {"time": 9249, "text": "I was like, we'll fucking put you right through that."}, {"time": 9251, "text": "And he kind of giggled."}, {"time": 9253, "text": "And then he went by that edge and I fucking ran him right through it."}, {"time": 9256, "text": "See, to me, that's an ultimate sign of respect that both you and Colton will remember well."}, {"time": 9261, "text": "And we're still friends."}, {"time": 9262, "text": "We still talk."}, {"time": 9263, "text": "It's just, I told him I was gonna do it."}, {"time": 9264, "text": "He knew I meant it too."}, {"time": 9266, "text": "He did it anyways."}, {"time": 9267, "text": "That just tested me."}, {"time": 9272, "text": "Listen, that's, and that same attitude was, that was in Japan just day after day after day after day."}, {"time": 9282, "text": "And you didn't sit out rounds?"}, {"time": 9284, "text": "And I did it all with a broken hand."}, {"time": 9290, "text": "How did you do it with a broken hand?"}, {"time": 9292, "text": "You show up every day."}, {"time": 9293, "text": "You show up."}, {"time": 9295, "text": "Which one, left or right?"}, {"time": 9296, "text": "My right."}, {"time": 9299, "text": "So you can then focus on gripping with your left."}, {"time": 9301, "text": "It's always a way."}, {"time": 9304, "text": "But that means you can't, I guess you don't have to grip with your right sometimes."}, {"time": 9307, "text": "I would palm it with my thumb just like hanging out like this, just like this."}, {"time": 9311, "text": "So you can do something."}, {"time": 9312, "text": "So you can do like a Goshi, cause you have a, cause I, what were your main throws?"}, {"time": 9317, "text": "It was Seinagi."}, {"time": 9319, "text": "Koshiguruma."}, {"time": 9321, "text": "Sumi."}, {"time": 9323, "text": "But you have this big like a Goshi type of thing."}, {"time": 9327, "text": "Like a. Yeah, but not from like around the waist."}, {"time": 9330, "text": "It's from over the shoulder."}, {"time": 9332, "text": "Over the shoulder."}, {"time": 9332, "text": "And I can do it with just the one hand."}, {"time": 9335, "text": "Oh, sorry, which one hand?"}, {"time": 9336, "text": "The right one."}, {"time": 9338, "text": "I don't need the sleeve hand."}, {"time": 9339, "text": "You don't need the sleeve hand, but you couldn't do it with the broken hand."}, {"time": 9342, "text": "I could."}, {"time": 9344, "text": "Cause I can just put my hand in the gi so it can't come off."}, {"time": 9348, "text": "And then you just, cause what happened was three days before I was leaving for Japan, a guy, my hand was rested like this on a mat and the guy, boom, took my whole thumb off and tore all the tendons in the palm."}, {"time": 9362, "text": "So when I went to the doctor, he was like, you know, do we have to put a cast on it?"}, {"time": 9366, "text": "And I go, I'm leaving in three days."}, {"time": 9368, "text": "You're not putting a cast on it."}, {"time": 9370, "text": "And I go, this is what I want you to do."}, {"time": 9371, "text": "Just like this, I said, I want you to build a cast that holds it, that Velcros around so that when I'm not training, I can wear it."}, {"time": 9381, "text": "But then when I'm training, I'll take it off and then I'll put the tape on it."}, {"time": 9385, "text": "And then whatever happens, happens."}, {"time": 9386, "text": "Whatever happens, happens."}, {"time": 9391, "text": "All right, so that's Epic."}, {"time": 9393, "text": "And that led you to the 2016 Olympics in Rio."}, {"time": 9397, "text": "Well, that led me to winning Pan Am Gold when I got back from Japan and then almost getting my leg cut off in 2015."}, {"time": 9405, "text": "That was like, I don't know, maybe a month or two later."}, {"time": 9409, "text": "I was hospitalized for seven days."}, {"time": 9411, "text": "The leg being cut off for what?"}, {"time": 9413, "text": "I had three different types of bacterial infections in my right leg, a whole leg swelled."}, {"time": 9419, "text": "And it was in my blood, skin and in my bone, in my right leg."}, {"time": 9428, "text": "So I got stuck at MGH in a hospital for seven days until they figured out what the bacteria source was."}, {"time": 9435, "text": "Where was the source of the infection?"}, {"time": 9437, "text": "Is it in the knee?"}, {"time": 9439, "text": "In the knee?"}, {"time": 9440, "text": "Okay, so obviously there's a danger of like, that's life threatening."}, {"time": 9444, "text": "Yep, so when I went into the emergency room, when I got back from the Worlds, the lady was like, hey, you need to call, you're gonna call because you may lose your leg tonight."}, {"time": 9454, "text": "And then they put me in the hospital."}, {"time": 9456, "text": "What do you think of this whole time?"}, {"time": 9458, "text": "Are you still thinking about Olympics?"}, {"time": 9460, "text": "They put me into the room like four hours later, the doctor came in."}, {"time": 9466, "text": "I was at MGH in Boston and he was like, you have a serious infection in your leg."}, {"time": 9473, "text": "I go, he's like, we have to keep you hospitalized until we can figure out what it is."}, {"time": 9477, "text": "And I was like, buddy, I have the Olympic games in less than a year."}, {"time": 9481, "text": "I go, I don't give a fuck what it is."}, {"time": 9483, "text": "I go, just fucking take it out and let me get on with my day."}, {"time": 9486, "text": "He goes, we can't do that."}, {"time": 9488, "text": "Like, I don't understand."}, {"time": 9490, "text": "I go, you told me it's infected, just cut away that part of the tissue, drain it, do whatever you gotta do and then send me on my way."}, {"time": 9497, "text": "He's like, it doesn't work like that."}, {"time": 9498, "text": "He said, until we figure out what it is, we can't figure out how to stop it from growing or how far it spread."}, {"time": 9504, "text": "So it took them seven days to figure out what it was."}, {"time": 9507, "text": "Then once they figured out what it was, I went in for surgery to remove it."}, {"time": 9512, "text": "Then I spent, I think it was eight weeks in home care with a PICC line."}, {"time": 9519, "text": "And then I came back from that."}, {"time": 9521, "text": "On the first week and a half of judo, I tore my SI joint trying to throw a guy."}, {"time": 9526, "text": "And then I came back from that about a month later and then fifth at the Connell Cup."}, {"time": 9532, "text": "And then the games six months later."}, {"time": 9534, "text": "How quickly do doctors understand who they're dealing with?"}, {"time": 9537, "text": "Like, is that difficult for you to explain who Travis Stevens is when you go to visit a doctor?"}, {"time": 9542, "text": "I don't think they understand, you know, their role is to get me to do my job to the best of their ability as a doctor."}, {"time": 9553, "text": "Meaning, it's gonna be less than what they want."}, {"time": 9556, "text": "And they struggle conceptually with like, but the textbook tells me this."}, {"time": 9566, "text": "And I go, but I'm not a textbook, right?"}, {"time": 9568, "text": "Like when you go to physical therapy, the first thing they do is they pull out that binder that says day one, we do this exercise."}, {"time": 9575, "text": "I go, but I have my own goals."}, {"time": 9578, "text": "Your job is to help me meet my goal."}, {"time": 9581, "text": "Let's work a plan to do that or I gotta go find somebody else."}, {"time": 9584, "text": "Did the doctors in general, people outside of your close knit group step up?"}, {"time": 9590, "text": "If they didn't, I found somebody else."}, {"time": 9592, "text": "And typically I could find a person who knew the right person."}, {"time": 9598, "text": "I always wonder with people like, cause I'm constantly surrounded by, one of the biggest problems in my life has been, there's a lot of people in my life who love me very much, but who want me to the equivalent of that situation."}, {"time": 9612, "text": "You know, definitely don't go to the Olympics and definitely like, it seems like the world is full of people that want you to be average and happy, which is great, which is fine."}, {"time": 9623, "text": "I mean, perhaps that's the way it should be."}, {"time": 9625, "text": "Like, you know, my parents, people close to you, that's what love, how love manifests itself often in people."}, {"time": 9631, "text": "But then like, I think the ultimate manifestation of love is understanding who this person is."}, {"time": 9637, "text": "Here's a madman who's driven towards a particular thing."}, {"time": 9640, "text": "And the best thing for you to do is not to say, like rest is to say, work harder."}, {"time": 9649, "text": "Like fuck your infection."}, {"time": 9652, "text": "You should be training."}, {"time": 9655, "text": "Have you ever met anybody as crazy as you that can help you?"}, {"time": 9658, "text": "Most of us who get to this point get there because we're all a little unstable."}, {"time": 9665, "text": "Even my wife, Galita, right?"}, {"time": 9667, "text": "Like when she was getting ready for 2016, or when she was getting ready for 2020, because she moved to Boston to be a coach, she had a neck problem, right?"}, {"time": 9682, "text": "And at some point in time, it's like, what's really important?"}, {"time": 9689, "text": "Day to day life or judo?"}, {"time": 9691, "text": "And believe it or not, the doctor in Canada was like, I am never under any circumstances doing an MRI of your neck again."}, {"time": 9702, "text": "That's what she told her."}, {"time": 9704, "text": "She goes, if you have me do an MRI, you're not doing judo again."}, {"time": 9707, "text": "So just know if you hurt your neck and it requires an MRI, you're done with judo forever."}, {"time": 9713, "text": "So decide if you wanna do judo or not."}, {"time": 9716, "text": "That was a conversation we actually had to have."}, {"time": 9718, "text": "That's a cool thing for a doctor to say."}, {"time": 9721, "text": "I mean, it depends how bad ass they sound when they say it."}, {"time": 9725, "text": "So that's a tough conversation."}, {"time": 9726, "text": "Judo one, what's this with your wife?"}, {"time": 9729, "text": "What's that relationship like?"}, {"time": 9731, "text": "So you're both a little crazy."}, {"time": 9734, "text": "In a good sense, or from my perspective, in a good sense."}, {"time": 9738, "text": "Yeah, it's just, we understand that when you set a goal to do something, you're not signing on for the good."}, {"time": 9749, "text": "You're signing on for the bad."}, {"time": 9751, "text": "And I don't think a lot of people understand that."}, {"time": 9754, "text": "That's like a Valentine's Day card from Travis Stevens."}, {"time": 9758, "text": "You have to accept everything negative that could possibly happen."}, {"time": 9762, "text": "And until you do, you're never gonna make it."}, {"time": 9764, "text": "Because you'll always sell yourself short."}, {"time": 9767, "text": "You'll never go far enough."}, {"time": 9769, "text": "And if you sign up for the whole thing, then the negative is just like, oh, great."}, {"time": 9773, "text": "I expected that."}, {"time": 9774, "text": "If you're experiencing the negative, they're also experiencing the negative."}, {"time": 9778, "text": "And if you overcome it, maybe they'll get knocked out for it."}, {"time": 9781, "text": "Maybe they won't deal with it."}, {"time": 9782, "text": "Maybe they won't train through it."}, {"time": 9785, "text": "Right, when I had my five herniated disc and I was in a neck brace, I was still in the gym at seven a.m. Yeah."}, {"time": 9790, "text": "Doing whatever it is I could do because my job is to be at the gym."}, {"time": 9795, "text": "David Goggins, I don't know if you know the guy, he's gone, he's damaged lots of parts of his body, like you, trying to achieve things."}, {"time": 9803, "text": "So, unlike you, his achievements are like, your achievements come with the medal."}, {"time": 9810, "text": "He's just running in the darkness in the middle of nowhere by himself."}, {"time": 9814, "text": "It's like, I mean, it's the same probably as with you if you're able to be introspective about it, is he's just battling his own inner demons and working through those and is breaking his body doing so."}, {"time": 9827, "text": "Are you cognizant of the trade off of the fact that you're damaging your body to get to these levels of achievements, of this level of excellence, of this level of greatness?"}, {"time": 9840, "text": "I mean, I guess that depends on what you consider damage really because I don't really see that I have damaged my body."}, {"time": 9848, "text": "If anything, I think I've strengthened it."}, {"time": 9850, "text": "My body can go through more than yours can."}, {"time": 9853, "text": "Who's is weaker?"}, {"time": 9857, "text": "It's just like the Thai boxers, right?"}, {"time": 9860, "text": "In order to strengthen their shins, they gotta break it a few times."}, {"time": 9863, "text": "It's just nature of the beast."}, {"time": 9864, "text": "You just had to break a bunch of stuff to find where the weak points are and then made them stronger."}, {"time": 9870, "text": "Or strengthen the areas around it to strengthen it by the sheer relation to it."}, {"time": 9876, "text": "But the problem is you may not be able to do judo for until you're 70."}, {"time": 9885, "text": "I may not be able to do judo to the level I used to."}, {"time": 9888, "text": "Don't get me wrong, but I can still do judo."}, {"time": 9890, "text": "You can still do judo."}, {"time": 9891, "text": "And I think a lot of people struggle with, they wanna keep doing it like they used to be able to do it."}, {"time": 9897, "text": "I don't try to do judo like I used to, like you're seeing here."}, {"time": 9900, "text": "I'm not that guy anymore."}, {"time": 9903, "text": "I don't even try to be that guy anymore."}, {"time": 9906, "text": "I'm a completely different player today than I am when I was winning Olympic medals."}, {"time": 9915, "text": "And so I guess when you're looking at my journey and the trade off is I never sacrificed anything."}, {"time": 9922, "text": "The people around me sacrificed for me."}, {"time": 9927, "text": "And I never had a downturn after the Olympics because I never identified as an Olympian."}, {"time": 9935, "text": "You know, a lot of Olympians suffer from depression afterwards."}, {"time": 9939, "text": "Because they identify as it."}, {"time": 9940, "text": "Now they don't have who they are."}, {"time": 9942, "text": "Where was your personal moment of greatness?"}, {"time": 9946, "text": "Like, or do you not experience life that way?"}, {"time": 9949, "text": "Where you were truly proud to be yourself?"}, {"time": 9952, "text": "Every day I wake up."}, {"time": 9956, "text": "You wake up and you're not proud of who you are, then you've really gotta seek out some help."}, {"time": 9961, "text": "So that's, first of all, okay, I'll do that because I definitely am not proud of who I am."}, {"time": 9967, "text": "I just wonder if you didn't identify with the Olympics, was there times, maybe in the training room, maybe in Japan, where you just kinda felt like, I get more of an emotional, I guess, trigger, right?"}, {"time": 9984, "text": "Where like, I feel proud of what I've done when I've set to a task and I've done it."}, {"time": 9993, "text": "So almost any task."}, {"time": 9995, "text": "And the more challenging the task, the more reward."}, {"time": 10000, "text": "You fought a lot of amazing battles in 2016 Olympics."}, {"time": 10004, "text": "So you got, you beat the, let's see, the world number four in the quarterfinals."}, {"time": 10011, "text": "It's like a replay."}, {"time": 10012, "text": "Every single Olympics, you're, all the people."}, {"time": 10015, "text": "I got terrible draws."}, {"time": 10017, "text": "Terrible draws."}, {"time": 10018, "text": "And then you're facing, this is where I was like watching this, I'm like, yeah, he's screwed."}, {"time": 10022, "text": "You faced the world number one, the Georgian, in the."}, {"time": 10025, "text": "By the way, for people who don't know, he beat me five times to my beating him once, and the one time I beat him was in London."}, {"time": 10033, "text": "And all other times he beat me, he beat me biathlon."}, {"time": 10036, "text": "And not by like a little throw, like he threw me on my head."}, {"time": 10042, "text": "At one point we were in Georgia."}, {"time": 10045, "text": "I'm fighting him in the final."}, {"time": 10047, "text": "I go to my teammate and I go, guess what?"}, {"time": 10049, "text": "Make sure you watch this fight."}, {"time": 10050, "text": "Somebody's getting thrown free pwn."}, {"time": 10052, "text": "This match ain't, this ain't match going to distance."}, {"time": 10054, "text": "And about a minute in, I tried to take his head off with a big Koshiguruma, which is like a head and arm."}, {"time": 10061, "text": "He caught me and then threw me on my head and ended the match."}, {"time": 10064, "text": "So first of all, we're watching the video of you, again, standing next to the guy leading up to your semifinal match."}, {"time": 10072, "text": "So here, if you win this, you're guaranteed a medal."}, {"time": 10076, "text": "But the chances of you winning, from my fan perspective, I was like, God damn it."}, {"time": 10081, "text": "You and the rest of the world, except for me."}, {"time": 10083, "text": "Except for you."}, {"time": 10084, "text": "What are you saying?"}, {"time": 10085, "text": "You're talking to yourself here."}, {"time": 10088, "text": "My name is Travis Stevens."}, {"time": 10089, "text": "I'm an Olympic champion."}, {"time": 10090, "text": "I will not be denied."}, {"time": 10094, "text": "The George is probably like, what the hell is this guy saying?"}, {"time": 10097, "text": "What is he talking to himself?"}, {"time": 10100, "text": "So he was probably ultra confident."}, {"time": 10102, "text": "Yeah, had to be."}, {"time": 10104, "text": "The difference is, is I understood the last five times he beat me."}, {"time": 10109, "text": "I was purposely trying to throw him, not beat him."}, {"time": 10113, "text": "I wanted to find out if I could."}, {"time": 10115, "text": "Turns out I can't."}, {"time": 10118, "text": "But I don't need to throw him to beat him."}, {"time": 10120, "text": "I need to know how to not lose."}, {"time": 10124, "text": "But you were still going for stuff here."}, {"time": 10127, "text": "But all of my attacks drag him to the ground."}, {"time": 10131, "text": "They're never standing on my feet."}, {"time": 10135, "text": "Which is a complete, which is a distinction that we talked about at the very beginning, right?"}, {"time": 10139, "text": "You have throws where you're standing and throws where you're dropping."}, {"time": 10141, "text": "Every time I try to throw him standing, he throws me free pony."}, {"time": 10145, "text": "He picks me up and he throws me on my head, literally."}, {"time": 10148, "text": "So what I did is I just needed to get to that last one minute mark, which is what he does mentally in his own Judo, where he changes into a panic and just tries to do things that are uncharacteristic."}, {"time": 10161, "text": "So you knew he's gonna start panicking here as the match draws to a close and you both have a Shido, a penalty."}, {"time": 10169, "text": "Did we pass the point where I went for broke and I broke my rule?"}, {"time": 10174, "text": "I went for a crazy foot sweep, like Ippon switch thing."}, {"time": 10182, "text": "I can't even remember what it's called because it's not used that often."}, {"time": 10185, "text": "And he actually landed on top of me and some people wanted it to be called Ippon."}, {"time": 10190, "text": "But he had actually let go of the gi and was looking for the mat."}, {"time": 10194, "text": "So he didn't have any control."}, {"time": 10195, "text": "So they didn't award him a point."}, {"time": 10199, "text": "Yeah, and here we go."}, {"time": 10199, "text": "Now we're getting down into the, see like he's getting frustrated."}, {"time": 10205, "text": "Second penalty, no big deal."}, {"time": 10207, "text": "We just got to get to the one minute mark."}, {"time": 10209, "text": "That's all we got to do."}, {"time": 10213, "text": "So there's no panic here for you."}, {"time": 10215, "text": "Nope, I'm right where I need to be and look it."}, {"time": 10219, "text": "Now, if you go back into this match, I would love for somebody to go back and see how many times he did a drop right Ippon Seinagi."}, {"time": 10231, "text": "Probably never."}, {"time": 10233, "text": "Why is he doing it now?"}, {"time": 10235, "text": "Cause he panics and he changes his Judo at that one minute mark."}, {"time": 10240, "text": "Look how much I kept that grip."}, {"time": 10243, "text": "Yeah, you kept, you have that grip this whole time."}, {"time": 10246, "text": "You have your left hand."}, {"time": 10248, "text": "Walking him down."}, {"time": 10251, "text": "He, you keep the grip as he's throwing."}, {"time": 10255, "text": "Which, were you thinking choke as he drops or no?"}, {"time": 10258, "text": "It's just kind of natural instinct."}, {"time": 10260, "text": "Yeah, because we drilled it."}, {"time": 10262, "text": "I spent two years drilling this transition."}, {"time": 10264, "text": "And then very, so for people that don't do Judo, Jujitsu, it's like really nice."}, {"time": 10269, "text": "You keep, everything is nicely controlled to where you're keeping that Gi under his chin."}, {"time": 10275, "text": "Like it's really tight control."}, {"time": 10276, "text": "Like it's very, like you're, I guess it's drilling, but you're cognizant of the position of your wrist the whole time."}, {"time": 10282, "text": "And you can tell based on like just years of doing it, whether it's under or it's not."}, {"time": 10287, "text": "You can just feel the difference."}, {"time": 10289, "text": "And it's probably, even if you wanted to stop that, it's very difficult because your whole time, it's like."}, {"time": 10294, "text": "Once it's under, it's almost impossible to stop."}, {"time": 10298, "text": "For people who practice Jujitsu, don't practice Judo, one of the very annoying things about Judo is in order to do Gi chokes, they have to be under the chin."}, {"time": 10310, "text": "Even though the kind of intense chokes you do work just fine over the chin, but."}, {"time": 10315, "text": "And the kicker here and why we practice this choke was because when you go back and watch all of the other matches, he always does this tripod when I try to do arm locks, which is typically what I would do."}, {"time": 10328, "text": "And when I do that, he ends up sliding out and I end up falling off."}, {"time": 10332, "text": "So you step up here with the choke, he does a tripod where he sticks his button to the air and you, dude, what's the name of this choke?"}, {"time": 10343, "text": "Bone arrow."}, {"time": 10344, "text": "No, but, okay, but I mean, when you do from like, from that position, is there a way, this entry into the bone arrow, I guess, because you're doing."}, {"time": 10353, "text": "We refer to Judo as a British strangle, when they're in that turtle position and you do that rolling motion."}, {"time": 10361, "text": "And here, when you go into that, you can fall off of him, like you said, if you're going for an arm bar, but here, literally, because you have it under the chin really well, there's just a nice control."}, {"time": 10373, "text": "And I've already planned on it being on his chin."}, {"time": 10376, "text": "That's why I've hooked the arm, right?"}, {"time": 10378, "text": "It's already starting to go straight."}, {"time": 10380, "text": "Probably this choke in the early stages, like a few frames before, feels like it, like you're safe, it's fine."}, {"time": 10391, "text": "Like the head will slip out or something like that."}, {"time": 10393, "text": "Yeah, and that's why my left knee is up by his shoulder, to keep that pressure down so that he can't posture it up."}, {"time": 10404, "text": "When did you know you have this?"}, {"time": 10405, "text": "Oh, it works right here."}, {"time": 10409, "text": "I actually panicked right about here."}, {"time": 10416, "text": "Was maybe his head could come out?"}, {"time": 10419, "text": "My hand, I tore the muscle in my palm because I was pulling so hard that I'm like, he may not tap."}, {"time": 10428, "text": "Like, is my hand just going to give out beforehand?"}, {"time": 10432, "text": "And there he is."}, {"time": 10432, "text": "And we're right on this edge, right?"}, {"time": 10435, "text": "So like, if we roll a little bit outside and I still don't have it, like that ref could stop it."}, {"time": 10440, "text": "And then I felt him tapping and."}, {"time": 10443, "text": "Oh, that, he's heartbroken."}, {"time": 10448, "text": "I felt."}, {"time": 10449, "text": "Surprised."}, {"time": 10453, "text": "The relief."}, {"time": 10453, "text": "Olympic final."}, {"time": 10457, "text": "And he knew, he knew he lost an Olympic medal right there because he already knew that the Japanese guy was going to be his bronze, that he never beats."}, {"time": 10469, "text": "See the, but also he probably in his head was confident that he would be in the final."}, {"time": 10478, "text": "And so like this, he almost is surprised."}, {"time": 10482, "text": "It's not supposed to happen this way."}, {"time": 10485, "text": "And it's the second time it's happened."}, {"time": 10487, "text": "And that's how you became an Olympic medalist."}, {"time": 10494, "text": "Man, that must be a great feeling."}, {"time": 10497, "text": "That must be a great feeling right here."}, {"time": 10500, "text": "Just like all the years of injuries, all of it."}, {"time": 10507, "text": "As fans that watch this too, it's like, holy shit."}, {"time": 10511, "text": "He actually did it."}, {"time": 10511, "text": "And it's a packed stadium too."}, {"time": 10513, "text": "Not one empty seat."}, {"time": 10518, "text": "So maybe what were you thinking here?"}, {"time": 10522, "text": "I'll just focus on the next match."}, {"time": 10525, "text": "It took me maybe like a minute or so to like decompress and then like get back to like my normal state for the final."}, {"time": 10539, "text": "So the final is against the, the Russian here."}, {"time": 10545, "text": "What can you say about your mindset?"}, {"time": 10549, "text": "You're saying the exact same thing."}, {"time": 10551, "text": "Travel Stevens, Olympic champion."}, {"time": 10554, "text": "I will not be denied because I had felt like in London and throughout the years, I felt like I kept getting robbed."}, {"time": 10562, "text": "So I made sure in my mantra to add that little bit at the end to reassure myself that like, they are not gonna control the outcome of today."}, {"time": 10570, "text": "I'm gonna control the outcome."}, {"time": 10572, "text": "What did you know about the Russian?"}, {"time": 10577, "text": "And I honestly, I thought I had won the Olympics right now."}, {"time": 10580, "text": "And I still do think that today."}, {"time": 10582, "text": "Just like mentally when you think about it, that I've won like, yeah, he threw me, but it was like a one in a million chance that that worked for him."}, {"time": 10597, "text": "Like, come on."}, {"time": 10598, "text": "So it's not like you feel lucky to be in the final."}, {"time": 10602, "text": "It's like, you deserve to be champion."}, {"time": 10604, "text": "Again, remember, I'm anticipating the goal."}, {"time": 10607, "text": "Like I'm past that."}, {"time": 10610, "text": "There's a confidence in the way you're moving and the way you're."}, {"time": 10612, "text": "Yeah, like I have his sleeve."}, {"time": 10614, "text": "He's not breaking it."}, {"time": 10615, "text": "Like still walking him down, still going forward."}, {"time": 10617, "text": "Like I knew exactly how I was gonna beat him."}, {"time": 10624, "text": "And I developed a plan because when I was getting ready for Rio, we brought in a lot of the top Japanese players that weren't invited to the camp for the national team to Boston."}, {"time": 10634, "text": "So I had four people, three of them were on the national team."}, {"time": 10637, "text": "One of them had won the universities in Japan, all at 81 kilos."}, {"time": 10643, "text": "I only got thrown once during camp for a month."}, {"time": 10646, "text": "Like I was ready."}, {"time": 10651, "text": "I just, I fucking slipped."}, {"time": 10653, "text": "Where does it happen?"}, {"time": 10656, "text": "Right when he threw me."}, {"time": 10657, "text": "So if you let this play out really quick, there's a point right here where I'm gonna come around his back and I'm kinda gonna just yoko sutemi, which means like a lateral drop."}, {"time": 10668, "text": "And I'm just gonna bring him down to the floor, which isn't a throw right here."}, {"time": 10672, "text": "It's more of like a takedown, right?"}, {"time": 10674, "text": "I'm trying to get him to the ground cause I wanna burn him."}, {"time": 10677, "text": "He doesn't do any waza."}, {"time": 10678, "text": "So I'm just gonna keep burning him."}, {"time": 10680, "text": "And you can see that like I get really close here."}, {"time": 10685, "text": "He just went a little too far to his side during this exchange."}, {"time": 10690, "text": "And like he's running."}, {"time": 10692, "text": "I'm like, ah, he."}, {"time": 10697, "text": "He's very wiry for an 81 kg player."}, {"time": 10700, "text": "There's not much like muscle on him."}, {"time": 10703, "text": "But he uses his length and his leverage very well."}, {"time": 10706, "text": "And you can see like I'm really burning the clock here."}, {"time": 10708, "text": "Like I'm owning these exchanges more than I'm owning the tachi waza ones, the ones in our feet."}, {"time": 10713, "text": "So you weren't trying to necessarily like submit him here or like really hard or like pin him."}, {"time": 10720, "text": "You were trying to break him a bit."}, {"time": 10723, "text": "I'm doing both."}, {"time": 10724, "text": "I'm being overly physical."}, {"time": 10728, "text": "And to a lot of the BJJ people who are watching this, like they're like, oh, well I would have done this."}, {"time": 10734, "text": "I would have done that."}, {"time": 10735, "text": "You've got to think like if that referee who's reffing the judo side of it looks at it for a couple of seconds and is like, he's not really moving."}, {"time": 10745, "text": "They'll stop it."}, {"time": 10747, "text": "So you're like, you understand judo."}, {"time": 10750, "text": "What's called ne waza groundwork."}, {"time": 10752, "text": "Like what you, cause you're really showing it to the ref."}, {"time": 10755, "text": "You have to show movement and progression."}, {"time": 10759, "text": "That hurt the forehead."}, {"time": 10760, "text": "Like see, I threw that hand in there kind of hard, ripping it across his face just because."}, {"time": 10769, "text": "I got to tell you there's a calm."}, {"time": 10771, "text": "Well, no, he does look a little broken, but the Russians have like this calmness."}, {"time": 10779, "text": "They're pretty good at."}, {"time": 10780, "text": "Well, don't forget they've competed like this for long time."}, {"time": 10785, "text": "It's all he knows."}, {"time": 10787, "text": "And this is where I lose it."}, {"time": 10788, "text": "See how my knee hit the ground."}, {"time": 10790, "text": "My knee wasn't supposed to touch the ground."}, {"time": 10793, "text": "I was supposed to sit to my hip to bring him down."}, {"time": 10795, "text": "Something happened where my knee touched and it didn't happen in the first one."}, {"time": 10800, "text": "It just happened there."}, {"time": 10802, "text": "So like that, we never should have been in that predicament."}, {"time": 10807, "text": "And that's one of the things where when you're looking at sports for anybody who's trying to improve, you have to, when you're trying to improve, you've really got to ignore the ends of the spectrums."}, {"time": 10824, "text": "The oopsies and the they got lucky."}, {"time": 10828, "text": "And you only focus on the middle."}, {"time": 10829, "text": "Like the technique I was doing was perfectly sound."}, {"time": 10834, "text": "It just happened that the one oopsie happened on the stage it shouldn't have happened on."}, {"time": 10838, "text": "And there's no amount of drilling that will ever like prevent that from happening."}, {"time": 10847, "text": "And that's just the."}, {"time": 10849, "text": "That's sports."}, {"time": 10850, "text": "That's sports, especially the Olympics, especially Judo when it's like one."}, {"time": 10854, "text": "You got one mistake."}, {"time": 10854, "text": "Oopsie can just be your."}, {"time": 10858, "text": "You know, it really requires and you have to wrap your head around the idea of like, if you want the ability to beat these people and throw these people, like you got to be willing to get thrown yourself."}, {"time": 10870, "text": "Like this isn't boxing."}, {"time": 10871, "text": "There's no like, I'm going to stand in a place where he can't hit me and I can hit him."}, {"time": 10876, "text": "Because we have the gi and because they can grab it, they have just as much ability to throw you as you them."}, {"time": 10882, "text": "So how'd you feel here?"}, {"time": 10884, "text": "How long was the duration of you feeling upset that you didn't get the gold versus."}, {"time": 10888, "text": "Never felt it."}, {"time": 10892, "text": "Because he didn't beat me."}, {"time": 10894, "text": "Right, it's an important distinction because when I'm training and when I'm competing, like I understand that I take risks and I accept those consequences."}, {"time": 10904, "text": "That's why I take them."}, {"time": 10906, "text": "That's a consequence."}, {"time": 10908, "text": "That's not him being the better judo player that dominated a match and I didn't have an answer and then he threw me."}, {"time": 10916, "text": "Then I would be a little upset."}, {"time": 10918, "text": "Like when you're tired and somebody's coming at you and like, you can't do anything about it, that's a shitty feeling."}, {"time": 10925, "text": "And that wasn't this."}, {"time": 10928, "text": "Like I accept losing when it's my fault."}, {"time": 10934, "text": "Well, that was a hell of a story, man."}, {"time": 10936, "text": "So from 2008, 2012, just the sheer number of injuries, the weight cuts, all of that, the wanting to quit, the doubts, I'm sure you did not get, like the fans probably started disappearing somewhere between the second and the third Olympics."}, {"time": 10955, "text": "Like the support from."}, {"time": 10958, "text": "Judo within the United States and just everybody, you know."}, {"time": 10962, "text": "The USOC tried to cut all my funding in 2015 and said, nah, you're too old."}, {"time": 10969, "text": "So through all of that, to win the medal, I mean, that's what the Olympics is about."}, {"time": 10975, "text": "Is there some, like when you look back, does that seem like another person?"}, {"time": 10979, "text": "Is this like another lifetime ago?"}, {"time": 10981, "text": "Or like, that's a hell of an accomplishment."}, {"time": 10983, "text": "How do you feel about the whole thing?"}, {"time": 10986, "text": "It's an interesting kind of predicament because there's like those cookie cutter answers about how proud you are and how grateful you are, but at the end of the day, it's not who you are."}, {"time": 11000, "text": "So that skillset and that mentality that, you know, it took to accomplish that, that's who you are."}, {"time": 11009, "text": "And so this was just a stepping stone in who I am."}, {"time": 11014, "text": "So it's in the past to me."}, {"time": 11017, "text": "Like there's no shrine in my house that has like an Olympic medal in it."}, {"time": 11021, "text": "I can't even remember the last time I looked at it."}, {"time": 11024, "text": "So you're saying like the, all the stories, the skills along the way, that's like you right now sitting here is the shrine."}, {"time": 11033, "text": "The who you become along the journey is really what the prize is, right?"}, {"time": 11039, "text": "Like when you think about any of them, most of the people that, you know, go through that depression after the games, it's because that is their shrine."}, {"time": 11050, "text": "Like that is who they've identified as."}, {"time": 11053, "text": "That is who they've told the world, the community, their friends, their family, that's how they've identified."}, {"time": 11060, "text": "I've identified as the person who perseveres, overcomes and accepts challenges."}, {"time": 11068, "text": "So like I, all those things are just like, you know, putting a suitcase off to the side and I'm onto the next great chapter thing that I'm trying to do."}, {"time": 11078, "text": "And it's both sad and cool that very few people in the world get to experience what it's like to be you."}, {"time": 11087, "text": "I mean, this level of having gone through that journey."}, {"time": 11092, "text": "Everyone has the opportunity to."}, {"time": 11098, "text": "I mean, I've done a few difficult things in my life, but I gotta tell you, weight cuts and sauna."}, {"time": 11107, "text": "And I would tell people right now who are listening, like, don't go through that."}, {"time": 11112, "text": "And I think a lot of wrestlers, a lot of young judo players, a lot of young, like just combat sports people where weight classes are a thing, they almost take a sense of pride."}, {"time": 11125, "text": "Like when I hear them talking about like, oh, how much weight do you have to cut?"}, {"time": 11129, "text": "If you have to cut a pound more, it's like you've accomplished more, like you're tougher."}, {"time": 11133, "text": "Like you're not."}, {"time": 11135, "text": "Like there's no trophies for that."}, {"time": 11138, "text": "You, whatever the reason, had a job to do and you got it done and that is truly inspiring, no matter how hard."}, {"time": 11146, "text": "That there's a big deep lesson to learn from that."}, {"time": 11149, "text": "Then you start getting to the specifics of whether you should weight cut or not."}, {"time": 11153, "text": "But if we don't, then most of the great things we have in this world, we wouldn't have."}, {"time": 11158, "text": "The reason we have many of the great things is because people did that weight cut."}, {"time": 11162, "text": "The equivalent of the weight cut for whatever the discipline, man."}, {"time": 11166, "text": "There's a difference between having to do it because you have to and you get through it, then setting yourself up to do that because you think it's the cool thing or the thing you're supposed to be doing in order to be successful."}, {"time": 11182, "text": "There are plenty of like two time Olympic medalist."}, {"time": 11185, "text": "I probably could have been a two time Olympic medalist had I not cut that much weight."}, {"time": 11190, "text": "I probably would have multiple world medals had I not cut that much weight because my body wouldn't have been that broken."}, {"time": 11196, "text": "There's always the other side of it."}, {"time": 11198, "text": "So just when you're looking at it, like I just hear it in like young kids, even some of my own, like when you hear them talk about like where their weight's at, they almost take a sense of pride on how much they have to lose because they hear stories like this."}, {"time": 11213, "text": "And it's like, that's not the takeaway."}, {"time": 11216, "text": "I did it because I had to."}, {"time": 11219, "text": "I was put in a situation where like, I may not have gone to this game had I moved up to 90 kilos because I wouldn't have had time to grow into the division."}, {"time": 11227, "text": "And then you get the job done."}, {"time": 11230, "text": "You're right, there's a very important difference."}, {"time": 11234, "text": "And that's also with sleep."}, {"time": 11236, "text": "That's what people talk to me about."}, {"time": 11238, "text": "There should not be any glorification of not sleeping."}, {"time": 11241, "text": "There should not be a glorification of cutting weight."}, {"time": 11244, "text": "But if that's on the way to your, whatever is that fire inside you that you know needs to get done, like the job at hand, if you need to sacrifice in some of those ways, you get the job done."}, {"time": 11259, "text": "Yeah, and the weight cut is an interesting one because it's different."}, {"time": 11263, "text": "I mean, you could speak to this."}, {"time": 11266, "text": "There's different sports in which the weight is more important than others."}, {"time": 11270, "text": "And there's different levels to this game."}, {"time": 11272, "text": "I think at the level you operated in, that was probably essential."}, {"time": 11277, "text": "Like there's huge games changed completely from 81 kg to 90 kg."}, {"time": 11281, "text": "It's a huge weight jump."}, {"time": 11282, "text": "It's, first of all, it's weight, but then the strategy, it's like so much changes the height and all those kinds of things."}, {"time": 11288, "text": "The physical, like people don't understand it, but the physical size of a 90 kilo judo player versus the physical size of an 81 kilo judo player, it's like putting a human in a human."}, {"time": 11299, "text": "Like there's enough space."}, {"time": 11300, "text": "That's not like, you could stand next to your friend who's 180 pounds and you could be 160 and you guys could look identical."}, {"time": 11308, "text": "It is different when both the 90 kilo, 100 kilo and 81 kilo both have 6% body fat and they're cutting into the class."}, {"time": 11315, "text": "And it always feels like there's more variety at 90 kilo because some of them are lanky and tall."}, {"time": 11320, "text": "Yeah, some are short and stocky."}, {"time": 11322, "text": "It's like 81 is more uniform, which I, but then the flip side of that is the, this is what I like in jiu jitsu, again, amateur competing against bigger guys."}, {"time": 11333, "text": "Like I love that more."}, {"time": 11334, "text": "I like cutting weight just so I'm slim."}, {"time": 11336, "text": "Like that's when I feel the best with the same thing that you mentioned."}, {"time": 11339, "text": "But like, I love going against 200, 220 that."}, {"time": 11343, "text": "Because in jiu jitsu, the weight doesn't get amplified in the sport."}, {"time": 11348, "text": "Like the weight is just the weight, right?"}, {"time": 11350, "text": "If you can leg press 220 and you can bench 220, then yeah, you can train with a guy who's 220."}, {"time": 11360, "text": "They're not gonna hurt you."}, {"time": 11362, "text": "And I mean, there is a truth that, lightweights and middleweights in jiu jitsu and the same is true for judo."}, {"time": 11369, "text": "It's just like a lot more of them."}, {"time": 11371, "text": "That means if you wanna be, you're just competing at a higher level."}, {"time": 11377, "text": "So like, there's much more variety of games."}, {"time": 11380, "text": "The level is much higher."}, {"time": 11381, "text": "So you're taking on a bigger challenge, even if you're like, have a weight advantage."}, {"time": 11387, "text": "So those are all decisions you have to kind of make."}, {"time": 11389, "text": "And certainly in jiu jitsu, people that are weight cutting are silly."}, {"time": 11392, "text": "I mean, that's the natural beginner thing to do is to feel the way the nervousness about competition expresses itself is through the desire to be as light as possible, which is the totally wrong desire to have."}, {"time": 11407, "text": "Right, like when you look at me now, I'm probably like 230, right?"}, {"time": 11416, "text": "But I probably have the strength of a 70 kilo judo player, right?"}, {"time": 11421, "text": "The weight doesn't really do much."}, {"time": 11424, "text": "Yeah, I mean, you have the same thing with wrestling."}, {"time": 11427, "text": "The skinny guys, the skinny you that we're looking at there, just the amount of power in that person is fascinating."}, {"time": 11434, "text": "Because it doesn't look like, you have some muscle, but it doesn't look, but I've felt the power of some of those people."}, {"time": 11440, "text": "Yeah, it's scary."}, {"time": 11442, "text": "Yeah, it's different."}, {"time": 11444, "text": "That's the best way I can describe it is like scary."}, {"time": 11446, "text": "It's like, oh shit, again, it's the food chain."}, {"time": 11449, "text": "You're not at the top of the food chain."}, {"time": 11452, "text": "That's the natural feeling when you go with some judo people."}, {"time": 11456, "text": "What's your sense about this recent Olympics?"}, {"time": 11458, "text": "What stands out to you as, so like Teddy Rene who was on a big run for a long time, many consider him to be one of the greatest judo players of all time, two time Olympic gold medalist and two time Olympic bronze medalist of four Olympics."}, {"time": 11477, "text": "Not counting like team stuff, just doing individual and then like 10 time world champ."}, {"time": 11484, "text": "Yeah, I'm not sure how they're gonna catalog that team event."}, {"time": 11487, "text": "Like are they all technically Olympic champions or is France an Olympic champion?"}, {"time": 11492, "text": "No, they're all technically Olympic champions, but I'm gonna ignore that."}, {"time": 11495, "text": "Is that how they're gonna classify it now?"}, {"time": 11497, "text": "According, oh, sorry, according to Wikipedia, like according to the internet."}, {"time": 11501, "text": "I don't know, according to IGF or whatever."}, {"time": 11503, "text": "Because some of those players never won a match."}, {"time": 11507, "text": "They just filled a spot."}, {"time": 11509, "text": "Oh, that's even a starker example."}, {"time": 11512, "text": "Oh, that's sad."}, {"time": 11513, "text": "You know, they lost in the individual and then they also lost in the team."}, {"time": 11519, "text": "Well, it's interesting because in the case of Teddy, he was important to the win against Japan in this Olympics."}, {"time": 11528, "text": "So like in the team event."}, {"time": 11531, "text": "So like, I feel like you should put that in the equation to say who won gold, right?"}, {"time": 11536, "text": "It does feel like he won gold in the team because he carried the team."}, {"time": 11541, "text": "Well, you have like Nomura at 60 kilos from Japan, three time Olympic gold medalist, no team event."}, {"time": 11551, "text": "Are you gonna weigh Teddy's team event?"}, {"time": 11553, "text": "No, no, we're not arguing this, of course."}, {"time": 11555, "text": "No, I'm just wondering how like the IGF, like when you look at a player stat, is it gonna be like team gold medal for the Olympics versus like their own personal gold medal?"}, {"time": 11567, "text": "Yeah, I think in sports, we have to be brutally honest."}, {"time": 11571, "text": "And I think, hopefully this doesn't piss off people."}, {"time": 11575, "text": "I hope it does."}, {"time": 11576, "text": "But judo is an individual sport."}, {"time": 11579, "text": "It's honestly just that one athlete, maybe the athlete and coach, right?"}, {"time": 11584, "text": "If you look at the big, big picture, but there's no team in judo."}, {"time": 11588, "text": "That's the beauty of combat sports."}, {"time": 11590, "text": "That's the honesty of it."}, {"time": 11592, "text": "That's the brutality of losing to another human being in a combat sport."}, {"time": 11597, "text": "That's why it's so damn embarrassing when you get slammed is because it's like, there's no team to like carry some of that responsibility."}, {"time": 11606, "text": "It's all on you and you suck."}, {"time": 11608, "text": "That's why you lost."}, {"time": 11610, "text": "There's that weight."}, {"time": 11611, "text": "And that's why it's like magical."}, {"time": 11612, "text": "It's not like soccer."}, {"time": 11614, "text": "It's not like basketball."}, {"time": 11617, "text": "Yeah, I couldn't play team sports because if one of my teammates wasn't doing their job correctly, I would go play their position."}, {"time": 11624, "text": "I'm gonna do it better than you."}, {"time": 11625, "text": "Yeah, but that, you know, some of the greatest leaders of teams also do that."}, {"time": 11628, "text": "Michael Jordan is like that, right?"}, {"time": 11630, "text": "I mean, it's like with your actions, you raised the level for everybody."}, {"time": 11637, "text": "Like excellence is expected and therefore everybody needs to step up."}, {"time": 11640, "text": "So some of the greatest, I would say, team leaders are individualists at heart."}, {"time": 11647, "text": "But it's okay."}, {"time": 11648, "text": "So Teddy, I think 10 time world champion, non team, regular."}, {"time": 11653, "text": "It's a big number, but I think he has some like open weight categories in there."}, {"time": 11656, "text": "Open weight, right, right."}, {"time": 11657, "text": "I mean, you can count those, right?"}, {"time": 11659, "text": "I mean, that's interesting."}, {"time": 11661, "text": "It's the same division twice."}, {"time": 11664, "text": "One day after another."}, {"time": 11666, "text": "I don't know if I wanna count that, yeah."}, {"time": 11668, "text": "Well, I mean, that's one of the reasons people don't usually put heavyweights in judo as like the greatest of all time, because the level of competition is lower."}, {"time": 11681, "text": "But anyway, he did lose in this match to a young Russian, Tamerlan Bashev."}, {"time": 11691, "text": "Match also not on the internet."}, {"time": 11693, "text": "Thank you Olympics."}, {"time": 11695, "text": "I am definitely going to go on some rants on the internet."}, {"time": 11699, "text": "As a fan of Olympics, I feel like this definitely needs to change moving forward."}, {"time": 11705, "text": "Like every single major Olympic event, I also like random sports like weightlifting, even though I don't do Olympic weightlifting."}, {"time": 11711, "text": "It's fun just to watch."}, {"time": 11712, "text": "Fun to watch such high level of excellence."}, {"time": 11716, "text": "And the fact that we can't just fricking watch the full, like each nicely categorized event is really heartbreaking in judo, in Olympic weightlifting, in track and gymnastics, all of that."}, {"time": 11728, "text": "Anyway, so Teddy lost."}, {"time": 11732, "text": "I mean, does that stand out to you?"}, {"time": 11733, "text": "If you were to like recap the things that you remember from this Olympics."}, {"time": 11737, "text": "I picked him losing already."}, {"time": 11739, "text": "Like in my predictions."}, {"time": 11741, "text": "Lose which, where?"}, {"time": 11742, "text": "That match or just in general somewhere?"}, {"time": 11744, "text": "In the final."}, {"time": 11745, "text": "In the final, you thought."}, {"time": 11746, "text": "Yeah, final or was it semi?"}, {"time": 11748, "text": "When I looked at his draw because he decided not to compete throughout the quad and do like the bare minimum to go, because of his age, I didn't think he would have enough energy to battle his way through the draw that he had."}, {"time": 11764, "text": "And sure enough, he didn't."}, {"time": 11766, "text": "He felt earlier than I thought, but he's not the young athletic person he used to be."}, {"time": 11773, "text": "And when they changed the rules to judo, they allowed people to take people into really, really deep waters, which you saw at this Olympics, which did it ruin the sport or did it not?"}, {"time": 11787, "text": "Like, I'm not sure, but it was definitely difficult to watch."}, {"time": 11792, "text": "Would you put him at the greatest of all time or asked another way, like who do you think is the greatest judo player of all time?"}, {"time": 11799, "text": "He's definitely not the greatest judo player, but he's definitely the best competitor."}, {"time": 11805, "text": "What's the difference in judo player and competitor?"}, {"time": 11808, "text": "There's an ability to like do the act of judo of like throwing, pinning, arm locking versus can you win a judo match?"}, {"time": 11818, "text": "Right, like when you look at somebody like Nomura who like threw everyone he fought, threw three Olympics, multiple world championships, multiple things, like that's a pure judo player."}, {"time": 11832, "text": "In the essence of judo, he can throw, pin or arm lock just about anybody he steps on the mat with during his time."}, {"time": 11841, "text": "Teddy tended to, when you look at his judo, because of his size, again, it's just because he's in the heavyweight category, he was so much bigger, so much stronger, people just couldn't handle it."}, {"time": 11855, "text": "And you would see really good judo players just break."}, {"time": 11859, "text": "Like they could hang in there for a little bit, but eventually his size, like you can't control that weight."}, {"time": 11865, "text": "Weight moves weight."}, {"time": 11866, "text": "And when you have to use all your strength to keep him upright and off of you, your muscles just give out because you don't have somebody of that stature and that skill to train with, to train those muscles."}, {"time": 11879, "text": "So you're thinking more like those 73, 81, 90 kg people that just stand in the pocket and just give everything."}, {"time": 11888, "text": "Like what comes to my mind is like a Koga."}, {"time": 11891, "text": "Koga."}, {"time": 11891, "text": "You know, a Nomura who's a 60 kilo guy, but again, like his dynamics and how long he was dominant for, like it just."}, {"time": 11900, "text": "Do you put value to like epic throws, like singular moments of greatness?"}, {"time": 11908, "text": "If it's against a noteworthy player in a noteworthy position."}, {"time": 11914, "text": "There are a lot of highlights of people that are good judo players, but their highlights are of, you know, scrubs on the IJF circuit."}, {"time": 11924, "text": "It's like, great, the Japanese guy threw the guy from, you know, Senegal free poem."}, {"time": 11932, "text": "We kind of expected that."}, {"time": 11933, "text": "You took the world number one against the 330th person in the world."}, {"time": 11937, "text": "What'd you think was gonna happen?"}, {"time": 11939, "text": "Like when I see those highlights like thrown around like social media, I'm like, that's not a highlight."}, {"time": 11945, "text": "They might as well have just been at the dojo like practice and throws."}, {"time": 11949, "text": "If you look at the like top 10 list for judo, Kano always comes up, you know, as."}, {"time": 11955, "text": "But he's not somebody that I don't think his results are there, but you don't really know how he got there."}, {"time": 11963, "text": "So it's hard for me to like, I can't see his judo."}, {"time": 11968, "text": "Kano, by the way, is the founder of judo for people who don't, who are considered to be the founder of judo."}, {"time": 11973, "text": "The sport evolves."}, {"time": 11975, "text": "The players that are like, if you took champions from the past and you fought them against the players of today, they're, it's not happening."}, {"time": 11983, "text": "And that goes with anything, right?"}, {"time": 11984, "text": "So every time you think of like, who's the best of all time, it's probably somebody within a generation or two of today."}, {"time": 11992, "text": "If I'm gonna pick my top three, let's say, top three, and I would go generationally speaking, I would pick Ono for today, probably Iliadis for like my timeframe, like the, from a developmental standpoint."}, {"time": 12009, "text": "And then I'd probably go Koga."}, {"time": 12011, "text": "And then before Koga, I'd probably go Nomura."}, {"time": 12014, "text": "As like the person of that generation that people like, as a whole in judo respected."}, {"time": 12024, "text": "Well, in the case of, I wonder if people feared Koga."}, {"time": 12029, "text": "Like you're, that little guy's gonna get under you."}, {"time": 12032, "text": "And you're gonna go for a ride."}, {"time": 12033, "text": "You know, he was 78 kilos when he took second at the All Japan's, which is an open weight class."}, {"time": 12039, "text": "You know, like he, he could throw down with anybody any weight class."}, {"time": 12044, "text": "He still went."}, {"time": 12045, "text": "He was one of the early people that planted the seed of judo, love of judo in you."}, {"time": 12050, "text": "It's like that."}, {"time": 12051, "text": "And when I looked at him, like that was how like I wanted my judo to be portrayed."}, {"time": 12057, "text": "That style."}, {"time": 12059, "text": "And then Iliadis, Iliadis, you just like, I mean, you have a similar attitude as him."}, {"time": 12064, "text": "So you just like the way he carries it."}, {"time": 12065, "text": "That's why we get along."}, {"time": 12069, "text": "You guys hang out."}, {"time": 12070, "text": "I mean, I'd love to see that conversation."}, {"time": 12072, "text": "I remember when we were talking about like his coaching, I was like, why didn't you take this team?"}, {"time": 12077, "text": "Or like, why'd you pick this team?"}, {"time": 12079, "text": "And he's like, I can't work with those people."}, {"time": 12081, "text": "Like those people are weak for children."}, {"time": 12083, "text": "Like they don't know how to train hard."}, {"time": 12085, "text": "I love that guy."}, {"time": 12087, "text": "What about Ono?"}, {"time": 12088, "text": "Cause he was competing in this Olympics."}, {"time": 12090, "text": "He got gold in this Olympics, right?"}, {"time": 12094, "text": "He lost in the team tournament though."}, {"time": 12096, "text": "I think he just didn't care."}, {"time": 12098, "text": "He just really wanted to throw that guy."}, {"time": 12099, "text": "He like throws everybody."}, {"time": 12101, "text": "So he's, he represents the thing you're mentioning."}, {"time": 12104, "text": "I signed up to the judo fanatics, best of Ono."}, {"time": 12109, "text": "Is there something that stands out to you about him that's especially you find beautiful, like, or powerful about his technique?"}, {"time": 12117, "text": "His adaptability to the situations and understanding of like what needs to happen in order to throw these people."}, {"time": 12127, "text": "I specifically watched a match with his and I was going to do a breakdown video on it because."}, {"time": 12133, "text": "Is there a match, do you remember what it is?"}, {"time": 12135, "text": "It's him versus Garvey of Hungary."}, {"time": 12141, "text": "Is he good at gripping?"}, {"time": 12141, "text": "So we're watching the match against Hungary."}, {"time": 12145, "text": "So at the one minute, so right here, coming up."}, {"time": 12148, "text": "I've heard he's freakishly strong."}, {"time": 12149, "text": "I've never had the ability to train with him."}, {"time": 12152, "text": "So I'm not."}, {"time": 12153, "text": "Obviously he looks super skinny."}, {"time": 12156, "text": "But when you see him without his gi jacket on, like he's a jacked dude, which is uncharacteristic of a Japanese player from back in the day, in a way changed all that."}, {"time": 12167, "text": "He was like, we're going to get physical to compete with the Europeans."}, {"time": 12170, "text": "That's another one of the greats, right?"}, {"time": 12173, "text": "He doesn't get mentioned enough."}, {"time": 12181, "text": "And he's a righty here, yeah, okay."}, {"time": 12184, "text": "And this is where he started setting it up."}, {"time": 12186, "text": "It's like, you can see he was standing in like a left handed stance and then he changes."}, {"time": 12191, "text": "So he grips almost like a double sleeve, not a double sleeve."}, {"time": 12197, "text": "He holds the tricep."}, {"time": 12198, "text": "The tricep."}, {"time": 12199, "text": "And the front sleeve standing like a lefty."}, {"time": 12203, "text": "And no body grip."}, {"time": 12204, "text": "Just tricep and sleeve."}, {"time": 12207, "text": "And that was like the biggest whip and twist of a nutrimata I've ever seen."}, {"time": 12212, "text": "Yeah, he doesn't actually lift him off the floor."}, {"time": 12215, "text": "And if you look at it in like slow motion almost, yeah, let's, yeah, there we go."}, {"time": 12225, "text": "The Hungarian player was like 100% defense and he still did this, right?"}, {"time": 12231, "text": "So right here, like press pause."}, {"time": 12234, "text": "This is like an identifier if you're trying to like learn judo and figure out how to set it up."}, {"time": 12242, "text": "Because knowing how to get to the point right before you pull the trigger is probably the most important."}, {"time": 12248, "text": "So when we watch this play out, what Ono's gonna do is he's gonna pivot off his right leg right here."}, {"time": 12254, "text": "He's gonna back step with his left and it's gonna pull Ungarvi's front leg all the way forward into what we would call like a neutral square stance."}, {"time": 12263, "text": "So he plants hard."}, {"time": 12265, "text": "And look at Ono."}, {"time": 12266, "text": "Oh, there's an interesting pull with the, oh no, it's not a tricep."}, {"time": 12268, "text": "He almost like, it starts with the tricep and he like collects the gear or something like that."}, {"time": 12272, "text": "But it's still above the elbow because you can see the bend, right?"}, {"time": 12276, "text": "And right here, see how he never put, back it up a little bit."}, {"time": 12281, "text": "This is kind of like one of those things, yeah, pause it right there."}, {"time": 12285, "text": "So when he puts his right foot down, he's pulling so hard with his back that when Ono goes to put his left foot down, it never touches the mat."}, {"time": 12295, "text": "But by putting his left foot back, it actually pulls Ungarvi's foot forward."}, {"time": 12299, "text": "And so he's able to speed up his throw by just continuing that motion back, which what was supposed to have been a step turned out to just, in the middle of the action, he makes a split second decision before putting the foot down to just continue."}, {"time": 12315, "text": "Cause he recognizes that feel in his hands."}, {"time": 12318, "text": "And so it's like, it never, it's a swing."}, {"time": 12320, "text": "Like he never touches the ground with his left foot."}, {"time": 12322, "text": "It never started as like a big swing to a back step."}, {"time": 12326, "text": "He changed his mind partway through."}, {"time": 12328, "text": "So it's right there, he wants to take a step."}, {"time": 12330, "text": "And then he goes, nope, he's bringing that foot forward."}, {"time": 12332, "text": "I'm just going to go for it."}, {"time": 12334, "text": "Wait, is he full?"}, {"time": 12336, "text": "Full air."}, {"time": 12338, "text": "Boom, boom."}, {"time": 12339, "text": "And look at, if you go a few more steps forward right there, his hip is the same height as Ungarvi shoulder."}, {"time": 12348, "text": "Because he's leaning so far into the throw with his body weight."}, {"time": 12353, "text": "And he's allowing that tricep grip to rotate."}, {"time": 12356, "text": "That's going to draw Ungarvi forward."}, {"time": 12358, "text": "And now when you pause it right here, you think about the sheer physics to like get your body into this position."}, {"time": 12367, "text": "Jimmy and I were so like, when we saw this for the first time, we tried to just stand like that and we couldn't do it."}, {"time": 12373, "text": "His left foot is pointing straight ahead."}, {"time": 12377, "text": "His chest is perpendicular to that foot or parallel with it, right?"}, {"time": 12381, "text": "And his head is by his foot."}, {"time": 12383, "text": "Is that only possible in the midst of a throw?"}, {"time": 12385, "text": "Do you think he works on making like?"}, {"time": 12387, "text": "I think he's done this particular throw, not this style of it, but Uchi Mata so much that his body has adapted to be able to do this."}, {"time": 12397, "text": "So when people are trying to learn and like break down videos, they don't understand like the power he has and what we call end range motion."}, {"time": 12408, "text": "Yeah, look at that."}, {"time": 12409, "text": "So like look at the full range of motion he takes, right?"}, {"time": 12413, "text": "His left foot swings all the way around and the torso starts like at three oclock and it goes all the way around like almost back to the three oclock."}, {"time": 12425, "text": "Like, like what?"}, {"time": 12428, "text": "And he never lifts his leg above his hip."}, {"time": 12432, "text": "And the crazy part is he never fell over during any of it."}, {"time": 12437, "text": "Stayed on his feet."}, {"time": 12439, "text": "What's he doing?"}, {"time": 12439, "text": "Is that a matter of pride or just?"}, {"time": 12444, "text": "I think that's just habit."}, {"time": 12446, "text": "The way the forces work, like he can just stay up."}, {"time": 12451, "text": "That's one of the most beautiful throws I've ever seen."}, {"time": 12455, "text": "There's so much wrong with it, but it worked."}, {"time": 12459, "text": "It worked."}, {"time": 12460, "text": "Because when you think about, remember what we talked about the very beginning, like he's got to get his center of gravity under his."}, {"time": 12465, "text": "Well, here's one of the top players in the world throwing another top player in the world with his hip at that guy's shoulder height and it's still working, it's."}, {"time": 12475, "text": "Okay, so he, this generation, he could be the great."}, {"time": 12479, "text": "And like he switched a lot of those details of the throw in the middle."}, {"time": 12483, "text": "In the middle."}, {"time": 12484, "text": "And that only is, that means he's probably what, like a hundred thousand times that throw has happened."}, {"time": 12491, "text": "I saw you were into chess recently."}, {"time": 12492, "text": "So you're like me, a bit of a beginner in chess."}, {"time": 12496, "text": "You're part of launching the website Effective Chess."}, {"time": 12500, "text": "So I got to ask, maybe it's a personal question, but do you have advice to yourself and to other beginners in exploring chess of how to one, have fun and two, to start getting good?"}, {"time": 12511, "text": "It's nice to see like Olympic caliber athlete take on a difficult task with a beginner's mind."}, {"time": 12520, "text": "So like, what's that process like?"}, {"time": 12522, "text": "I'm a huge fan of just learning new things in general."}, {"time": 12528, "text": "Right, like when I left Judo, like I took a job as marketing for Fuji Sports and I was getting frustrated with designers."}, {"time": 12538, "text": "So I learned Photoshop."}, {"time": 12540, "text": "I also got angry with the photographer."}, {"time": 12542, "text": "So now I take all the photos too, just because I don't mind learning."}, {"time": 12547, "text": "I've spent my entire Judo career learning all the time, like adding new techniques, finding new ways, practicing, developing."}, {"time": 12556, "text": "And so when it comes to chess, I treat it just like I do anything else."}, {"time": 12560, "text": "I just stick to one plan and I learn all the ins and outs of that one plan."}, {"time": 12566, "text": "And then I develop another plan, right?"}, {"time": 12569, "text": "Like I might practice like a London opening, for example, and just, I don't even care if I win or lose."}, {"time": 12575, "text": "I just wanna figure out how I'm gonna lose and then figure out how I'm gonna win."}, {"time": 12580, "text": "And once I know that position is now done, then I start with another position."}, {"time": 12586, "text": "And then once I figured out how I'm gonna lose and how I'm gonna win, the next thing I do is I don't go to a third."}, {"time": 12592, "text": "I figure out the bridge between the two."}, {"time": 12595, "text": "Like at what point during my openings can I transition back into this opening?"}, {"time": 12599, "text": "Right, so like you have like some basic openings and you wanna see how they go wrong, how they go right, all the different ways."}, {"time": 12606, "text": "And then that starts to solidify a higher level concept of that particular opening and you start to stitch together the concepts."}, {"time": 12612, "text": "The concepts together, cause being able to go from one to another and then back and forth is part of the reasons why like I was successful at judo is just because everything I do, at some point it touches that spider web of like being able to get from one area to another."}, {"time": 12630, "text": "We refer to it as like a toolbox, right?"}, {"time": 12632, "text": "You need more tools in your toolbox."}, {"time": 12634, "text": "But if you're always grabbing the wrong tool for that job, then you're just not gonna have success."}, {"time": 12640, "text": "I actually forgot to ask, you mentioned a few greatest chess players of all time and I noticed you didn't mention Vladimir Putin."}, {"time": 12647, "text": "I gotta ask you about his judo."}, {"time": 12650, "text": "Do you by chance know much about his judo?"}, {"time": 12653, "text": "What do you think about a president of a major nation being a judo black belt?"}, {"time": 12659, "text": "And I think from what I've seen, pretty good at it."}, {"time": 12663, "text": "I think it shows, you know, if he actually got it, like let's go with that premise of like he earned it."}, {"time": 12674, "text": "That just shows like a level of like physical persistence and mental fortitude to be able to like, you know, take those beatings and just keep showing up until you've overcome and can now give those beatings."}, {"time": 12691, "text": "As you know, in Japan and Russia, you get it by just like, when you're young, it's easier to get a black belt when you're like, just go through a bunch of beatings for like 10 years in your teenage years."}, {"time": 12702, "text": "But there's also from it springs like a camaraderie."}, {"time": 12707, "text": "Like there's a definitely a brotherhood and sisterhood in terms of judo to where you're connected forever because of that."}, {"time": 12717, "text": "For many people, it's their childhood connection."}, {"time": 12719, "text": "You sort of leave judo, you know, in your twenties and your thirties, but that's always there."}, {"time": 12724, "text": "And the same is true with wrestling."}, {"time": 12725, "text": "So it's interesting to see him pay respect to that, like by going with the Russian national judo team."}, {"time": 12735, "text": "And I think he did, obviously they have to get thrown, right?"}, {"time": 12739, "text": "But just, you can tell, and you probably could tell even better, but you can tell when a person moves in a way where you're like, okay, you've had like 10 years of beatings and you can tell the way they pull, the way they move."}, {"time": 12752, "text": "But I also like, in contrast to the US national team, or I don't even think there's a national team for US, right?"}, {"time": 12760, "text": "It's the Pedro Judo center, right?"}, {"time": 12764, "text": "That there is some, it's really cool when there's a camaraderie like that amongst the highest level Olympic caliber athletes in Russia."}, {"time": 12772, "text": "I suppose Japan might have similar kind of thing."}, {"time": 12774, "text": "And then you can have the system of people together and then you can have a strong coaching staff, not just like a coach, but a coaching staff."}, {"time": 12785, "text": "And then you can have the nation backing that staff."}, {"time": 12787, "text": "I mean, and then the result is like, you have some incredible level of judo emerge."}, {"time": 12794, "text": "Is there something you could say, we didn't talk much about Jimmy."}, {"time": 12797, "text": "I mean, he was a critical part of your just, like of your perseverance through all the, all that you had to go through."}, {"time": 12807, "text": "What did you learn from Jimmy?"}, {"time": 12809, "text": "What are some impacts that he had on your life, both on the mat and off the mat?"}, {"time": 12817, "text": "If we had to like put it down to like a very simple thing, he taught me how to win, right?"}, {"time": 12825, "text": "It wasn't necessarily like the technical side of judo."}, {"time": 12829, "text": "Like we went over gripping, we went over this, we adapted that."}, {"time": 12833, "text": "But the real strength to Jimmy was like, he knows how to win."}, {"time": 12838, "text": "And most people think, well, if I get really good at this technique, I'll be able to throw people with it, not win."}, {"time": 12845, "text": "That is not how the world of sports works, right?"}, {"time": 12849, "text": "Like I remember in one of my YouTube videos, I was doing a breakdown of a match from the Cuba Grand Prix where I was fighting a Mongolian guy."}, {"time": 12859, "text": "He's kicking the shit at me, I'm not gonna lie."}, {"time": 12862, "text": "Four minutes in, like he just throwing me like left and right, he was so fast."}, {"time": 12868, "text": "I felt like I just couldn't get to him."}, {"time": 12871, "text": "In the last 30 seconds, he changed."}, {"time": 12874, "text": "He started protecting his lead instead of continuing the fight the way the entire match was going in his favor."}, {"time": 12881, "text": "He made a mental shift and when he made that mental shift, I beat him."}, {"time": 12886, "text": "Because he didn't know how to win the fight."}, {"time": 12890, "text": "He can win exchanges, but he can't win the fight."}, {"time": 12894, "text": "So the last thing you wanna do is have to win every exchange in a match."}, {"time": 12899, "text": "You wanna know how to kick it into sixth gear."}, {"time": 12903, "text": "Like when to step off the gas, when to focus on gripping, when to attack, how often to attack, all those things like."}, {"time": 12912, "text": "And you've had those conversations with Jimmy like, this is not like how to stop trying to win every exchange, that kind of thing."}, {"time": 12918, "text": "And instead."}, {"time": 12919, "text": "Because I was a brawler before."}, {"time": 12921, "text": "I was like, if I threw you once, I'm throwing you again."}, {"time": 12923, "text": "And sometimes you get caught."}, {"time": 12925, "text": "Why would I do that?"}, {"time": 12927, "text": "I'm already winning."}, {"time": 12928, "text": "What about like the mental side of the game, the preparation, all those things?"}, {"time": 12932, "text": "One of the biggest things Jimmy brought to the forefront when it came to like the mental side was the visualization, right?"}, {"time": 12941, "text": "And when I started visualizing myself winning, I started seeing more success."}, {"time": 12946, "text": "But once I started seeing more success, with the visualization also came self doubt."}, {"time": 12952, "text": "Because as I'm starting to picture myself like, I would picture myself before fighting Church's village, I'm gonna throw him with Koshiguruma and I can see it."}, {"time": 12965, "text": "And if I stand in the shoot for too long, you start to like, but what if he counters?"}, {"time": 12971, "text": "Then you go, well, if he counters with this, I'm gonna counter with that."}, {"time": 12975, "text": "But you already let that doubt in."}, {"time": 12978, "text": "And then you start playing this like five step scenario, but you still come out on top."}, {"time": 12982, "text": "But all that doubt has like seeped into your mind, right?"}, {"time": 12986, "text": "And a lot of people don't understand that that's a bad thing."}, {"time": 12991, "text": "You're still winning in your mind, but you're also doubting yourself in your mind."}, {"time": 12995, "text": "Yeah, once you let that doubt seep in, it's destructive."}, {"time": 13000, "text": "Yeah, and so I remember I was at the World Championships."}, {"time": 13004, "text": "I can't remember what year it was, but I was ready."}, {"time": 13007, "text": "Like I was healthy, I was ready to go."}, {"time": 13010, "text": "And we all thought like, this is the year Travis wins the Worlds."}, {"time": 13015, "text": "I go out there in the first round, I'm in the shoot for like 45 minutes."}, {"time": 13021, "text": "Like the match went into golden score, then the next match went into golden score, then the fucking next match went into golden score."}, {"time": 13027, "text": "Then the referee came and told me, you can't wear your gi."}, {"time": 13030, "text": "Then Big Jim goes, why can't he wear his gi?"}, {"time": 13032, "text": "Any gi that has his name on it, we're not gonna let him wear."}, {"time": 13035, "text": "He has to wear a different gi."}, {"time": 13037, "text": "So then I go, fuck you, I'm leaving."}, {"time": 13038, "text": "And I walked out there and I fought."}, {"time": 13040, "text": "I lost in golden score because I did a kochi and they called it a false attack."}, {"time": 13043, "text": "And I went, great, I'm out of the fucking Worlds."}, {"time": 13047, "text": "But when I was in the shoot, I struggled because I started allowing the like Hungarian guy that I was gonna face to do things to me that I would have to play defense to and then counter."}, {"time": 13060, "text": "It's like, great, but now I'm doubting my own ability."}, {"time": 13064, "text": "So I went to a sports psychologist and the big game changer for me was, I focused more on the emotional, physical response that happens in matches rather than the actual quote unquote like Instagram picture that would have happened."}, {"time": 13082, "text": "So when I was getting ready for 2016, you think about like, how do you feel like standing in the shoot?"}, {"time": 13090, "text": "Like, what does your body feel like?"}, {"time": 13091, "text": "Is your heart racing?"}, {"time": 13092, "text": "How's your breath?"}, {"time": 13093, "text": "Is your mouth dry?"}, {"time": 13095, "text": "And then you think about like, okay, the ref just started the match."}, {"time": 13098, "text": "Like, how, what's the atmosphere like?"}, {"time": 13100, "text": "How do you emotionally respond to these things?"}, {"time": 13103, "text": "More so than me trying to beat a specific judo player, right?"}, {"time": 13108, "text": "Like, oh, the ref just gave you a penalty at a minute 30."}, {"time": 13111, "text": "Like, how do you feel?"}, {"time": 13112, "text": "And then you start thinking about the physical responses."}, {"time": 13115, "text": "And when you do that really well, you can actually get the pins and needles and your body will start to sweat and your heart will start to race as if you're in it."}, {"time": 13124, "text": "Cause it's not about the technique."}, {"time": 13127, "text": "It's more about the physical."}]}]