[{"title": "Jonathan Reisman: The Human Body - From Sex & Sperm to Hands & Heart | Lex Fridman Podcast #297", "id": "XOPO9J7DIXw", "quotes": [{"time": 284, "text": "And we'll never know, perhaps."}, {"time": 288, "text": "You tweeted, now I'm gonna analyze your tweets like it's Shakespeare sometimes."}, {"time": 294, "text": "You tweeted that, quote, millions of years of sex and death design the human body."}, {"time": 300, "text": "It's like poetry."}, {"time": 301, "text": "Are those two basic activities basically summarize everything that resulted in humans on Earth?"}, {"time": 309, "text": "So like, is that a good summary of the evolutionary process that led to this conscious intelligent being, is death and sex?"}, {"time": 320, "text": "So sex is how more of us get made, obviously."}, {"time": 323, "text": "And death is how we get weeded out or the gene pool gets weeded out and certain genes survive and others don't."}, {"time": 330, "text": "And, you know, the age at which we die, whether it's before we've, you know, had sex and reproduced ourselves is a big factor and who survives, who doesn't, who passes on their genes and what the future of the body looks like."}, {"time": 343, "text": "You know, who lived and who died before they were able to be at reproductive age a million years ago was pretty important in what we look like now."}, {"time": 352, "text": "And perhaps how we have sex and die now will determine what we're shaped like unless technology has an even bigger role in that, you know, a million years from now."}, {"time": 361, "text": "So you think that's fundamental to like if there's alien civilizations out there that have the same order of magnitude of intelligence or greater, do you think that we will see something like sex and something like death?"}, {"time": 373, "text": "So the reproducing and this selection process plus the weeding out of the old to make room for the new, is that kind of foundational to life?"}, {"time": 386, "text": "I mean, it sure seems to be on earth, you know, perhaps in some distant future when medicine is nearing, you know, perfection and people can live a really long time."}, {"time": 395, "text": "Maybe we won't even need to reproduce as much or something like that, you know, it's hard to even know what life will be like in the distant future."}, {"time": 404, "text": "But I would guess that any alien civilization will have the same dependence on who has sex and who dies."}, {"time": 410, "text": "Well, that's the problem with immortality."}, {"time": 411, "text": "How are we going to clear out the old to make room for the new, which is kind of a, it's like a framework of adaptability to changing environments."}, {"time": 424, "text": "So as long as the environment is changing, and it seems to always be, because the entirety of the earth system is a complex system, it seems like you have to adapt."}, {"time": 434, "text": "And to adapt, you have to kill off the stubborn old ideas."}, {"time": 439, "text": "And unless there's a way to like not become stubborn and old, but it feels like the nature of wisdom is stubborn and old."}, {"time": 450, "text": "Like that's what wisdom is."}, {"time": 452, "text": "It's like the lessons of life, the lessons of experience solidified."}, {"time": 457, "text": "And the solidification is the thing that actually prevents you from reinventing yourself to adapt to the new changing conditions."}, {"time": 467, "text": "But then again, why not have that both of those modes?"}, {"time": 469, "text": "Like have two minds and one person, one immortal person that like in the morning, they act like a teenager, in the evening they act like a old wise man."}, {"time": 480, "text": "So you see, you can imagine within one mind both modes, but those are required."}, {"time": 488, "text": "You have to have the ability to completely reinvent yourself, which is what death does in an ugly way, or a beautiful way, depending on your perspective, depending whether you take the human perspective or the human, the nature's perspective."}, {"time": 505, "text": "And then you have to have the selection."}, {"time": 507, "text": "So competition, so sexual selection."}, {"time": 510, "text": "It's an interesting, interesting little planet we got."}, {"time": 513, "text": "What's the weirdest part, function, concept, idea about the human body to you?"}, {"time": 518, "text": "We'll talk about fascinating details, but I should say for people that should read your book, they will come face to face with the fact that you do not shy away from the weird and the wonderful of the human body."}, {"time": 533, "text": "It's like, it's fun, but it's honest."}, {"time": 537, "text": "So given that, sorry to make you pick one of your children, but what's the weirdest one, would you say?"}, {"time": 546, "text": "The weirdest body part."}, {"time": 549, "text": "Or concept or function."}, {"time": 552, "text": "So the chapters, you divide it up kind of into parts, but there could be a thread that connects all of them, the weirdness, maybe, or maybe the texture of the substance."}, {"time": 563, "text": "It could be the liquids, the solids, I don't know."}, {"time": 566, "text": "Definitely every body part and bodily fluid has their own kind of both gross and fascinating aspects."}, {"time": 573, "text": "That's probably why I'm a generalist as a doctor and couldn't just, as you said, pick one of my children, become a specialist, because I like them all."}, {"time": 582, "text": "I feel like one of the strangest concepts about the human body is that kind of the aspects of it that are the most universal, that we all do, are the most taboo socially."}, {"time": 594, "text": "I wouldn't have expected that if I had, you know, just looked from the outside, like what we do in the bathroom, what we do in the bedroom, what we do to our own genitals, what we do to our, you know, quote unquote, private parts, they're private, even though it's sort of the thing that we all have in common is the most we try to hide from other people and don't talk about in polite company."}, {"time": 615, "text": "I mean, it makes sense as a human living in this society, but from the outside, it sort of might be surprising."}, {"time": 620, "text": "How do you make sense of that if you put on your Sigmund Freud hat?"}, {"time": 623, "text": "The thing we all do, why do we make that a taboo thing?"}, {"time": 628, "text": "Is it because we like taboos?"}, {"time": 630, "text": "Maybe we get off, or maybe our kinks as humans is to have taboos, and it's kind of efficient to have taboos about the things that everybody does."}, {"time": 641, "text": "Like, you can make walking taboo or something, I don't know."}, {"time": 645, "text": "But just, maybe that's what we love, that's what's exciting to us, is the forbidden."}, {"time": 652, "text": "I think, yes, society loves rules, for sure."}, {"time": 654, "text": "They love, some societies more than others."}, {"time": 657, "text": "You know, they love controlling how you think and what you do in public versus in private."}, {"time": 662, "text": "You know, there's a lot of societies where, for instance, parents have sex in front of children."}, {"time": 668, "text": "Not, you know, for instance, like in traditional Inupiat Eskimo societies, that was sort of normal."}, {"time": 674, "text": "I mean, but what are you gonna do, go outside in the middle of the winter in the Arctic and do it out there?"}, {"time": 679, "text": "So, you know, there's different taboos in different societies."}, {"time": 683, "text": "Some taboos make perfect sense."}, {"time": 685, "text": "Some taboos are even public health measures, you know, like, as I talk in the book about in India, where they, you know, the hands are symmetric, as you said, but in Indian culture, and the left hand is taboo, and the right hand is what you use for shaking hands, for eating, for other things, and the left hand is the dirty hand that you use for wiping your own bottom."}, {"time": 707, "text": "You know, that's the toilet paper is your left hand."}, {"time": 709, "text": "So, while the body is anatomically symmetric, the taboo creates this pretty intense asymmetry."}, {"time": 716, "text": "But for a good reason, you know, yet you probably shouldn't be shaking hands with other people with the same hand that you use to kind of clean your bottom."}, {"time": 722, "text": "So in that sense, it makes sense."}, {"time": 725, "text": "Yeah, maybe the roots of it makes sense, but the way it propagates, especially as the times change, might not, because you can wash your hands."}, {"time": 734, "text": "But the taboo remains."}, {"time": 736, "text": "Right, society is very slow to change."}, {"time": 739, "text": "What is the most fascinating part, function, or concept in the human body?"}, {"time": 743, "text": "So, you know, something that fills you with awe."}, {"time": 750, "text": "I guess the most obvious one is the brain, partly because it's so, you know, sort of poorly understood, though we understand more than we ever have in the past."}, {"time": 759, "text": "There's still so much that we don't understand about how the lump of matter in our skulls kind of creates this subjective experience that we all kind of understand quite viscerally."}, {"time": 771, "text": "I would say the kidneys are an underappreciated organ."}, {"time": 775, "text": "The way they tinker with the bloodstream, raise levels of this, lower levels of that, kind of our entire lives from inside the womb until we die is just really incredible."}, {"time": 787, "text": "And when you look at how much energy different organs consume, the brain and the kidneys are two of the biggest ones, because the brain obviously in us is always active, and controlling parts of the body, but the kidneys are just consuming a ton of energy to do what they do."}, {"time": 801, "text": "They're kind of the unsung hero of the body, relegated to the back of the abdomen, like some forgotten organ, but they are great."}, {"time": 808, "text": "I did consider being a nephrologist, which is a kidney specialist, because I was so taken with the kidneys, but decided I like all the organs, so couldn't pick just one."}, {"time": 817, "text": "So your book is ordered in a particular way."}, {"time": 820, "text": "It's throat, heart, feces, genitals, liver, pineal gland, brain, skin, urine, fat, lungs, eyes, mucus, fingers and toes, and blood."}, {"time": 839, "text": "First of all, great chapter titles."}, {"time": 843, "text": "Is there a reason for this ordering, or is it all madness?"}, {"time": 846, "text": "There's a few different reasons that went into it."}, {"time": 849, "text": "I did wanna start with the throat for the reason that it kind of presents the topic of death, which is sort of obviously very important in the training of a physician, in the career of physician."}, {"time": 863, "text": "It's a big part of what I deal with."}, {"time": 865, "text": "On the first day of medical school, we started the dissection of a cadaver in the class called anatomy lab."}, {"time": 872, "text": "And so in a way, we were kind of thrown right in there in the beginning, like this is the end of the human story."}, {"time": 878, "text": "Understand this, and then we sort of backed up to the beginning with embryology and reproduction and stuff."}, {"time": 883, "text": "So it's kind of like we got, and I got thrown into that right away, right in the beginning, kind of like here's a dead body."}, {"time": 890, "text": "Now start cutting it apart and learn the name and function of absolutely every bit of flesh."}, {"time": 894, "text": "How did that change you, that first experience with the cold honesty of human biology?"}, {"time": 901, "text": "Right, that's exactly what it was, is cold honesty about kind of the story of each individual human body."}, {"time": 906, "text": "It has an end, and that's it."}, {"time": 909, "text": "I think that, well, actually before the end of that first day, so what we did on that first day was study the superficial muscles of the back, like the lats or latissimus dorsi and some other muscles."}, {"time": 919, "text": "We cut through the skin of the back."}, {"time": 921, "text": "My cadaver was laying face down on this metal gurney."}, {"time": 924, "text": "We pulled back the kind of plastic sheets that would keep him moist for the next four months as we dissected him, cut through the skin on his back, and then started dissecting through the superficial muscles of the back."}, {"time": 934, "text": "And that was really all we saw that first day."}, {"time": 936, "text": "We didn't get any deeper, didn't enter the abdominal or chest cavity to see internal organs, but I was so fascinated with this sort of behind the scenes look at how things work in the body, how you move your arms, how you arch your back."}, {"time": 950, "text": "You know, these are the muscles that do it that I decided I wanted to donate my own body for the same purpose."}, {"time": 956, "text": "So I made that decision literally before the end of that first day of class, and I'm still sticking to it."}, {"time": 962, "text": "So someday there'll be a medical student that can watch and listen to this podcast while dissecting your body."}, {"time": 972, "text": "They might not know that that person they're listening to on the podcast will be the carcass in front of them, but we never learned anything."}, {"time": 978, "text": "The universe will know."}, {"time": 981, "text": "And they will acknowledge the irony or the humor, the absurdity of that."}, {"time": 986, "text": "The universe will chuckle, but the medical student won't know because they never, as I did not, learn any personal information about the person, only what I could glean from looking inside them, which actually tells you quite a bit."}, {"time": 999, "text": "I knew he was a smoker."}, {"time": 1000, "text": "I knew he had coronary artery disease."}, {"time": 1001, "text": "You know, you get a window into, I knew he was overweight."}, {"time": 1005, "text": "You get a window into people's lives just by looking in their bodies after death."}, {"time": 1009, "text": "Other cadavers in the lab, not my own, or I shared one with three other students, but other cadavers, some had metal joints, like a knee replacement."}, {"time": 1020, "text": "Some had a kidney missing."}, {"time": 1021, "text": "So they probably, and we could tell it was surgically removed, not that he was born with one."}, {"time": 1027, "text": "And we could tell that he probably had a kidney tumor or cancer that was removed."}, {"time": 1030, "text": "So you do get an insight into people's lives from picking them apart after they're dead, but you don't know their name or what podcast they've been on."}, {"time": 1039, "text": "So as the book title says, Unseen Body, so it tells some kind of story of your life."}, {"time": 1047, "text": "So it does capture the decisions you've made in your life, the things you've done, that might be kind of secret to that person and maybe to a few others that knew him or her well."}, {"time": 1061, "text": "It's so fascinating."}, {"time": 1062, "text": "So what kind of things can it reveal?"}, {"time": 1066, "text": "Like what kind of choices in terms of the injuries, the catastrophic events, the lifestyle choices of smoking and diet and all those kinds of things?"}, {"time": 1077, "text": "What can you see?"}, {"time": 1079, "text": "What kind of history can you see about the human before you?"}, {"time": 1083, "text": "So all those things you mentioned are things you can see."}, {"time": 1086, "text": "Take the skin, for example, right?"}, {"time": 1088, "text": "Most things that happen to us leave a mark, as I say, kind of a story written in the language of scar where it tells you injuries you've had."}, {"time": 1096, "text": "And same thing with animals."}, {"time": 1099, "text": "I've seen deer hides that have marks that look like they're made by maybe a barbed wire fence, something like that."}, {"time": 1104, "text": "You can tell, sometimes it's conjecture, but you can sort of imagine what might've happened to cause that."}, {"time": 1110, "text": "Perhaps two bucks were fighting and one got injured with an antler."}, {"time": 1114, "text": "And the same with humans."}, {"time": 1116, "text": "I have scars on my body, and when I notice them, I remember what happened."}, {"time": 1120, "text": "I got a big cut on my hand when I was 13, and it's still there, and I remember what happened every time I look at it."}, {"time": 1128, "text": "And so in that way, only I might know that story, but other people, when they dissect me and notice the same scars, they can kind of, it can fire their imagination as my cadaver, you know, did for me."}, {"time": 1140, "text": "They know that there is a story there."}, {"time": 1142, "text": "That's such an interesting way that the skin does tell a story, both tattoos and scars."}, {"time": 1150, "text": "Some of the fun you've had and some of the damage you've done."}, {"time": 1154, "text": "And even when I evaluate a patient, I can use scars to help me make medical decisions."}, {"time": 1160, "text": "So for instance, someone that comes in with abdominal pain into the emergency room, you can see scars on their abdomen that tell you about, you know, the past kind of activities of a surgeon, perhaps."}, {"time": 1170, "text": "I know, I recognize the scars that are left when someone has their gallbladder removed, the scars when someone has their appendix removed, maybe when someone's had a hysterectomy, and that can tell you what it might be or what it isn't."}, {"time": 1182, "text": "You know, if someone doesn't have an appendix, their abdominal pain's not appendicitis, end of story."}, {"time": 1186, "text": "So in that way, I'm sort of looking at these, the tracks or the footprints of past surgeries to tell me what might and might not be the cause of this patient's abdominal pain, which is kind of my main job in the ER is figuring out what's causing it and to help them."}, {"time": 1201, "text": "Is there ways to get more data about the human body as we look into the future of medicine biology that will be helpful to fill in some of the gaps of the story?"}, {"time": 1212, "text": "So, you know, you have companies, you have research that looks at, you know, collection of blood over long periods of time to see sort of, you know, paint the picture of what's happening in your body, mostly to help with lifestyle decisions, but also just, you know, to anticipate things that can go wrong and all that kind of stuff."}, {"time": 1235, "text": "Is there, can you just speak to a greater digital world that we're stepping in, how that can help tell a richer story?"}, {"time": 1245, "text": "I certainly think that we have more data than we know what to do with right now, especially with kind of direct to consumer medical devices, you know, smartwatches, et cetera, that are just collecting these reams of data."}, {"time": 1258, "text": "I have not seen them put to, I think the eventual use that they will."}, {"time": 1264, "text": "I think that the potential is sort of just, you know, unimaginable and I hope we're heading into a new age where, you know, you can determine, for instance, is a person gonna have more of the dangerous side effects to a drug based on their genetics or are they gonna tolerate one drug better than the other, you know, based on their genetics?"}, {"time": 1284, "text": "And we are slowly moving into that age and especially the age of kind of completely synthesizing drugs in the lab, you know, much like, for instance, some of the COVID vaccines actually, like Moderna never had the virus in their lab."}, {"time": 1301, "text": "They made that vaccine completely without ever having the virus themselves just by having the genome, which is sort of astounding."}, {"time": 1306, "text": "And there's a lot of potential going forward, you know, based on that technology and some others."}, {"time": 1311, "text": "Well, I didn't know that."}, {"time": 1312, "text": "So they basically, it's all in the computer, it's computational."}, {"time": 1314, "text": "Right, you have the genetic code, you have tremendous power, even if you don't have the organism itself."}, {"time": 1319, "text": "What do you make of Elizabeth Holmes and efforts like that?"}, {"time": 1324, "text": "First of all, I'm a curious, I'm drawn to the darkness in human nature because that somehow reveals the full spectrum of what humans could be."}, {"time": 1343, "text": "So there's a lot of sort of controversial thoughts about who she is and her efforts and so on."}, {"time": 1348, "text": "I think you may have even tweeted about it, but I've read a lot of your tweets, so I'm now forgetting."}, {"time": 1353, "text": "But what do you make of her and both those efforts and the charlatans that sort of snake oil salesmen that promise those efforts to do more than they currently can?"}, {"time": 1371, "text": "I think that her, you know, that goal that she had that she created Theranos to try to achieve, to use less blood in tests is a very worthy goal and a huge frontier that we have not achieved and that I hope we will achieve."}, {"time": 1386, "text": "So I understand why, you know, someone describes what a huge step forward that would be and it would be indeed."}, {"time": 1393, "text": "I understand why people put a ton of money behind it."}, {"time": 1395, "text": "Can you describe what was the promise?"}, {"time": 1397, "text": "What are we even talking about with Theranos, just for people who don't know?"}, {"time": 1402, "text": "So Theranos is a company that was basically started to revolutionize the way medical blood tests are done, both to use a whole lot less blood in doing it."}, {"time": 1413, "text": "You know, if anyone's ever been to the doctor and had five to 10 tubes of blood removed from them, it can be quite surprising how much they take out."}, {"time": 1421, "text": "And it's, you know, that's the limitation of our technology that we need those volumes of blood to run all the tests that we want to."}, {"time": 1427, "text": "And so the promise of Theranos was that perhaps with a single drop of blood, we would be able to know as much about the person's, the condition of their body without drawing all that blood and thereby, you know, there would be these devices she was gonna create that would sort of do it."}, {"time": 1443, "text": "You put a drop of blood in and it spits out everything you ever wanted to know about what's in your bloodstream."}, {"time": 1447, "text": "And in a way that would make it so much easier, you know, it could be, you could have one in your home theoretically, and you, I don't know why you'd wonder what your potassium level is on any given day, but you could check if you wanted to."}, {"time": 1459, "text": "And so that goal is very worthy."}, {"time": 1461, "text": "You know, I put that goal up there with the frontier of making painkillers that are as good as opioids without the addictive quality."}, {"time": 1468, "text": "You know, that would be such a huge revolution if we did have that in medicine."}, {"time": 1472, "text": "But, and particularly for me, cause I trained in both pediatrics and internal medicine."}, {"time": 1477, "text": "So I learned to care for both children and adults."}, {"time": 1480, "text": "In children, we do draw much less blood."}, {"time": 1482, "text": "They have a much lower blood volume."}, {"time": 1483, "text": "And we use these tiny little tubes to draw their blood."}, {"time": 1487, "text": "And we seemingly get equivalent information out of the larger tubes we draw from adults."}, {"time": 1492, "text": "And I'm still unclear to be honest, why we can't draw that little amount of blood from adults."}, {"time": 1496, "text": "It seems technically possible."}, {"time": 1498, "text": "I don't know what the barriers are."}, {"time": 1499, "text": "I'm sure there are, or else we'd be doing it."}, {"time": 1502, "text": "But I do think that that is a very important goal."}, {"time": 1504, "text": "And if Theranos had done it, it would have really revolutionized the practice of medicine."}, {"time": 1509, "text": "So to return to that cadaver, that first day when you got to meet with the dead, with a human body that's no longer living."}, {"time": 1521, "text": "So how quickly did it take for you to get used to sort of, you said, looking at the surface muscles of the back?"}, {"time": 1531, "text": "I mean, that can be overwhelming as a thought."}, {"time": 1534, "text": "And people listening to this that have never dissected anything might be overwhelmed by that thought."}, {"time": 1540, "text": "So like, how quickly were you able to get used to the brutal honesty of the biology before you?"}, {"time": 1548, "text": "For me, it did not take long at all."}, {"time": 1550, "text": "I guess I've never been a squeamish person."}, {"time": 1553, "text": "So for me, it was kind of riveting and fascinating right from the first moment."}, {"time": 1556, "text": "But I do know some of my fellow classmates did have some trouble with it."}, {"time": 1561, "text": "Some of them I heard had nightmares in the first few weeks of anatomy lab."}, {"time": 1568, "text": "But then everyone, as far as I know, got used to it."}, {"time": 1570, "text": "And that was also actually a big lesson for me that it's pretty amazing what people can get used to in their daily lives."}, {"time": 1576, "text": "And I kind of extrapolated that to people living through war and through just terrible situations and living under oppressive regimes."}, {"time": 1586, "text": "And it really is amazing what people can get used to, almost anything."}, {"time": 1591, "text": "Well, you know, in war, people often come back and they have nightmares."}, {"time": 1597, "text": "They suffer through it."}, {"time": 1598, "text": "There's PTSD."}, {"time": 1599, "text": "There's a lot of complicated feelings with that."}, {"time": 1603, "text": "Are echoes of those same complicated feelings possible in the case of training to be and becoming a doctor?"}, {"time": 1612, "text": "Yeah, I think sometimes, just as a barbed wire fence can leave a scar on your skin, emotional, psychological experiences can leave a mark on your brain or your memory."}, {"time": 1623, "text": "And I think that that definitely could be a problem in medical training."}, {"time": 1630, "text": "You do see a lot of things that are very shocking, very repulsive, things that you'd never forget."}, {"time": 1637, "text": "I know one of those students that had nightmares initially went on to be a surgeon."}, {"time": 1641, "text": "So I imagine she's not having the PTSD of kind of seeing inside her first dead body because she sees inside them all day, every day now."}, {"time": 1648, "text": "But I'm sure it could."}, {"time": 1650, "text": "You know, we go on to see so many kind of grosser or more shocking things in medical training through medical school and then by working with actual living patients, not just dead and embalmed bodies."}, {"time": 1663, "text": "So I do think that things can leave a mark, but I don't think that initial cadaver would be the most traumatic."}, {"time": 1671, "text": "Yeah, but maybe some of that trauma, the demons make you a better surgeon, just like some of your own psychological trauma might make you a better psychiatrist."}, {"time": 1683, "text": "Returning to the ordering, is it order or is it chaos to the ordering of the chapters from throat and heart and feces and genitals all the way to fingers and toes and blood?"}, {"time": 1696, "text": "So I did mention that, you know, throat was the first one because I kind of wanted to throw the reader right into the brutal honesty of death."}, {"time": 1704, "text": "And I followed it up with feces as the third chapter and in a way, partly to also throw them right into the deep end of how I like discussing parts of the body and revealing their gross and fascinating aspects."}, {"time": 1717, "text": "So I didn't want to hide anything."}, {"time": 1719, "text": "You know, when you train to be a doctor, everything is on the table, literally in the cadaver lab, but also just, you know, you deal with blood and piss and vomit and feces."}, {"time": 1728, "text": "And that's kind of the medium of your craft."}, {"time": 1731, "text": "And yes, the medium of the craft, that's right."}, {"time": 1735, "text": "Like if you're a painter, this is the paint."}, {"time": 1741, "text": "And then you have to create a masterpiece with it."}, {"time": 1744, "text": "Like almost like a dance because there's multiple painters."}, {"time": 1746, "text": "One of the painters is the biology."}, {"time": 1748, "text": "So let's return to throat."}, {"time": 1750, "text": "You mentioned it's a weird one."}, {"time": 1752, "text": "So first of all, a friend of mine said, I just see humans as like a bunch of holes that just walk around."}, {"time": 1764, "text": "Not untrue."}, {"time": 1765, "text": "It's a funny way to look at humans."}, {"time": 1767, "text": "So we have ears, we have nose, we have mouth, we have the sexual holes, vagina, penis."}, {"time": 1776, "text": "And then, you know, what's the medical term for your asshole?"}, {"time": 1782, "text": "Anus."}, {"time": 1783, "text": "Anus, thank you."}, {"time": 1785, "text": "This is a very technical discussion."}, {"time": 1787, "text": "The rectum's further in, don't confuse the two."}, {"time": 1789, "text": "Oh, that's very important."}, {"time": 1791, "text": "Is there a difference between throat and mouth?"}, {"time": 1794, "text": "By the way, so when you say throat, are we talking about when that hole actually becomes tubular?"}, {"time": 1800, "text": "The throat I would count as just sort of the very back of the back of the mouth, where the nose also comes down and meets it, where the tonsils are and the uvula."}, {"time": 1811, "text": "But you're right that we are a bunch of holes."}, {"time": 1813, "text": "But more accurately, we're a tube, right?"}, {"time": 1815, "text": "We start in the womb as kind of this microscopic little disc, almost like a flatbread."}, {"time": 1821, "text": "And then we roll almost like a burrito into this tube."}, {"time": 1825, "text": "And we're a simple microscopic tube."}, {"time": 1827, "text": "And from there, we grow into this bigger and bigger tube and we become more complicated."}, {"time": 1832, "text": "And each end of the tube does split into various holes."}, {"time": 1835, "text": "So all the holes you mentioned at the front end of the tube, the front end of our body, right?"}, {"time": 1838, "text": "It splits into the nose, the mouth, the ears, the sinuses, the tube to the lungs, which is the windpipe, the tube down to the stomach, which is the esophagus."}, {"time": 1848, "text": "And then the other end of the tube splits as well."}, {"time": 1851, "text": "Men end up with two holes and women end up with three holes."}, {"time": 1856, "text": "The urethra, the vagina, and the anus, and men."}, {"time": 1859, "text": "The urethra and kind of the reproductive system, they share a hole."}, {"time": 1863, "text": "So I'm learning a lot today."}, {"time": 1865, "text": "It really is incredible that you start from a sperm and an egg and you have some DNA information."}, {"time": 1872, "text": "And from that, the building project begins."}, {"time": 1875, "text": "And then what that leads to is like pizza dough and then you roll it into a tube."}, {"time": 1884, "text": "And that tube then eventually sort of becomes more and more complicated and gets eyes and a brain and then can create a Twitter account."}, {"time": 1898, "text": "So it's really incredible that we're just a fancy tube."}, {"time": 1903, "text": "Right, we are."}, {"time": 1904, "text": "And we sprout eyes and a brain and a sense of smell and taste pretty much to regulate what comes in the front of the tube."}, {"time": 1912, "text": "We don't wanna eat anything dangerous or poisonous."}, {"time": 1915, "text": "We wanna choose what we eat, even choose who we kiss."}, {"time": 1918, "text": "Well, we seem to be motivated by what comes out of the tube as well in part."}, {"time": 1924, "text": "That's not just output, it's a feedback mechanism seemingly."}, {"time": 1927, "text": "Like we're also monitoring the functioning of the output."}, {"time": 1931, "text": "We're not just obsessed about the input."}, {"time": 1934, "text": "We're very obsessed with the output."}, {"time": 1935, "text": "You're absolutely right about that."}, {"time": 1937, "text": "People have medical complaints about their output very often that are, I never cease to be surprised by a new kind of complaint or observation about the output."}, {"time": 1948, "text": "I think people have gone to wars over the output and maybe sometimes the lack of the output or the desire for output for the particular other humans that you fancy, the brain and the eyes that sprouted somehow convinced the rest of the body that this one particular other tube is fanciful."}, {"time": 1971, "text": "So you're going to go to major wars and lead global suffering because of the fancy and the desire for additional output with the other tube."}, {"time": 1981, "text": "Okay, so on the throat, that part of the tube, is it, you said the design is not, you could have thought of maybe a little bit better options because it's too multifunctional."}, {"time": 1998, "text": "Is that, can you sort of elaborate on the multifunctional nature of this part?"}, {"time": 2003, "text": "Are a lot of parts of the human body multifunctional or do you find that more specialization is going to get the job done better?"}, {"time": 2012, "text": "There is a lot of organs, for instance, do have multiple functions."}, {"time": 2015, "text": "The pancreas is like two organs in one."}, {"time": 2019, "text": "One secretes hormones like insulin into the bloodstream and the other aspect of it secretes digestive enzymes into the gut to help you digest and absorb food."}, {"time": 2029, "text": "The liver is like 15 organs in one."}, {"time": 2031, "text": "It's just amazing how many different things it does."}, {"time": 2033, "text": "But the throat, so basically the problem with the throat is as I said, we have two tubes that are right next to each other in the throat."}, {"time": 2041, "text": "One is for food, drink, saliva, mucus, snot, whatever you're gonna swallow, all of that stuff must go down the esophagus, the food tube and end up in the stomach."}, {"time": 2051, "text": "And right next to the esophagus millimeters away is the windpipe or the trachea, which goes down to the lungs."}, {"time": 2058, "text": "And your throat does these daily gymnastics to keep everything but air out of the windpipe because you slip up once and you can die."}, {"time": 2070, "text": "You can choke, you laugh or speak while eating and it's curtains, unfortunately."}, {"time": 2075, "text": "So it seems like every aspect of the body when I was learning about it in med school seemed so brilliant and so perfectly designed by evolution or whoever you might think designed it to favor survival, to enhance life, but the throat seemed the opposite."}, {"time": 2093, "text": "It seemed set up almost for failure."}, {"time": 2096, "text": "And we developed all these mechanisms as a compensation."}, {"time": 2100, "text": "We have the gag reflex whenever food or something is headed towards your air pipe, your windpipe or down to your lungs, your throat has this sort of like rejection of it."}, {"time": 2110, "text": "It pushes it away in a gag reflex."}, {"time": 2113, "text": "At the same time, we have a cough, which is something our body does when something inappropriate does get down the windpipe."}, {"time": 2119, "text": "When we get a little food down the wrong pipe, we end up coughing and the coughing does usually flush it out and get rid of it."}, {"time": 2127, "text": "We even have something called the mucus elevator in our lungs, which is this constant flow of mucus up the airways, up to the trachea, dragging with it all kinds of particulates that we've inhaled and perhaps some food that went down the wrong pipe and drags it up into the throat and we swallow it kind of unconsciously all day, every day is the truth."}, {"time": 2147, "text": "Even the mechanism of swallowing is super complicated."}, {"time": 2150, "text": "It uses a number of cranial nerves."}, {"time": 2152, "text": "It uses over 15 different muscles."}, {"time": 2155, "text": "It's this coordinated act to keep food out of the airway."}, {"time": 2160, "text": "You can see someone's Adam's apple in their neck kind of jump upward when they swallow, which helps lift the airway up against the epiglottis, which plugs it closed and allows food or swallow drink to kind of skirt just past it."}, {"time": 2175, "text": "But every time we swallow, those things do come within millimeters of going down the wrong pipe and it's just thanks to these kind of compensations, these adaptations we have to the danger of the throat that keeps us alive."}, {"time": 2187, "text": "As I actually took a sip of water, it's kind of, it makes you appreciate the wonderful machinery of it all."}, {"time": 2196, "text": "By the way, we have pulled up your Instagram that people should follow."}, {"time": 2201, "text": "You have a post about the throat and just showing so many different components from the tongue to the trachea, the esophagus, just the entire machinery of it all."}, {"time": 2216, "text": "The teeth for the chewing, it's so interesting."}, {"time": 2220, "text": "And so a lot of the structure of this, the anatomy and the physiology, does it echo other mammals?"}, {"time": 2227, "text": "Are we just basically borrowing a lot of stuff from evolution and maybe making small adjustments maybe due to the fact that we're not using our mouth to murder things as other predators might?"}, {"time": 2242, "text": "We use our thumbs."}, {"time": 2243, "text": "Exactly, we have hands, we don't need to bite them."}, {"time": 2246, "text": "Yeah, there's a lot of overlap between different animals which I find very comforting and fascinating."}, {"time": 2252, "text": "Someone asked me, is there any animal in which the throat is better designed?"}, {"time": 2256, "text": "And my first thought was whales because the blowhole's kind of up on the top of their head."}, {"time": 2260, "text": "So I was thinking, oh, maybe they are more separate."}, {"time": 2264, "text": "But when I looked into it, actually no, the paths do come very close, just like in us."}, {"time": 2268, "text": "And I saw a paper about some new discovered organ that actually helps keep food and drink out of the airway in whales that they hadn't ever noticed before."}, {"time": 2278, "text": "So it's a different mechanism, but the same kind of basic problem is that we're tubes and the air tube and food tube are right next to each other."}, {"time": 2286, "text": "How well do we understand, so just even linger on this little part, is there still mysteries about the complexity of the system?"}, {"time": 2293, "text": "You mentioned just even for swallowing all these parts in the brain that are responsible and all the different things that have to, like an orchestra play together."}, {"time": 2302, "text": "Do we have a good sense from both a medical perspective and a biology perspective or is there still mysteries?"}, {"time": 2309, "text": "There's definitely still mysteries."}, {"time": 2310, "text": "We understand a lot about, for instance, how the swallowing mechanism is coordinated in the brainstem, sometimes using some higher levels of the brain, but it is a very thoughtless thing as you mentioned when you drank the water."}, {"time": 2324, "text": "It's not something we have to think about, thankfully, or we'd be thinking about it all day."}, {"time": 2329, "text": "There's a lot we don't understand about the basic mechanisms, perhaps about how the nerves fire and how they kind of coordinate on the microscopic level, how ions rush into and out of nerve cells to kind of create that electrical signal, but we sure understand a heck of a lot and it's very fascinating."}, {"time": 2347, "text": "So, moving on to chapter two and we'll jump around."}, {"time": 2352, "text": "And you actually said the liver does a lot of things."}, {"time": 2357, "text": "I also saw you retweet something where it said, you know, showing that the liver is bigger than the heart, which is the body or the universe's way of saying you should drink more and care less, which is a good line."}, {"time": 2372, "text": "So, you give props, like you said, to the kidney, to the liver, to the maybe, to the organs, to the parts that don't often get as much credit as they deserve, but let us go for time to the human heart."}, {"time": 2390, "text": "We get chest pain."}, {"time": 2392, "text": "We talk about it when we talk about love for some reason."}, {"time": 2395, "text": "Why do we talk about the heart when we talk about love?"}, {"time": 2398, "text": "There sometimes can actually be some chest pain involved in love."}, {"time": 2401, "text": "I remember when I was a med student, I was very smitten with another medical student who was totally brilliant and beautiful."}, {"time": 2409, "text": "And it actually does cause this kind of burning in your chest."}, {"time": 2413, "text": "I don't think it's from the heart itself."}, {"time": 2416, "text": "I don't know if it was like acid reflux because I was so nervous."}, {"time": 2418, "text": "I'm not really sure, but I definitely felt something in my chest whenever I saw her."}, {"time": 2423, "text": "I don't know what that is, but you could see why someone might think, oh, you know, maybe it is your heart."}, {"time": 2428, "text": "That's kind of the most prominent organ in your chest."}, {"time": 2430, "text": "When people come to the ER with chest pain, the big question is, is it my heart?"}, {"time": 2433, "text": "And that's my main job is figuring out if it is or not."}, {"time": 2436, "text": "So I could see why."}, {"time": 2439, "text": "The way ancients saw the functions of different organs is fascinating, but often hard to explain."}, {"time": 2446, "text": "Would it be fair to say that if you look at the entirety of human history, the way most people die has to do with the heart?"}, {"time": 2455, "text": "Well, like in America today, cardiovascular disease and coronary artery disease is one of the most common, perhaps the most common cause of death."}, {"time": 2464, "text": "You know, 100 years ago, 200 years ago, it was probably not."}, {"time": 2468, "text": "People were not living as long and people were dying of infections that we tend to die less of these days."}, {"time": 2474, "text": "Sure, that's true, but in terms of things to stab, so I'm trying to sort of introspect like why talk about the heart and love?"}, {"time": 2484, "text": "My thought would be that it's because the heart was seen as the most important organism."}, {"time": 2491, "text": "It would be like the origin of life comes from the heart."}, {"time": 2495, "text": "The originator of life and the way you figure that out from sort of an ancient perspective is when you stab things, what is likely to lead to issues?"}, {"time": 2506, "text": "It's like, it's possible to imagine that the brain is not as special as we might think from when you don't understand modern biology or physiology or neuroscience, all those kinds of things, especially because pain, you know, it's painless too, if you stab it, the brain, I mean."}, {"time": 2527, "text": "Yeah, anyway, so that's really interesting."}, {"time": 2529, "text": "I'm sure there's a kind of a poetic answer to maybe the way people wrote about it, but what to you is the wisdom in the design of the heart?"}, {"time": 2540, "text": "I mean, the main function of the heart basically is to push blood through the cardiovascular system, through the branching blood vessels to feed every cell in the body."}, {"time": 2550, "text": "You know, when I believe our ancestors started off as single celled organisms floating in some ancient brew, and they were surrounded by the medium that would bring them all the nutrients they needed, so there's no issues there."}, {"time": 2562, "text": "And then once you start getting multicellular organisms, the kind of that are thicker and the ones on the inside aren't in contact with that sort of nutritious brew that they're growing in, you kind of need a way to distribute those nutrients to every cell, and so that's what the heart and the branching vascular tree do."}, {"time": 2578, "text": "So the heart, you know, it's the biggest disconnect between how the organs talked about in poetry and through history versus its actual function is probably the heart, because we ascribe all these things like love and passion and life itself sometimes to the heart, but actually it's just a simple mechanical pump, you know, that's all it is."}, {"time": 2597, "text": "I don't wanna downplay it, it's amazing, but you know, it just pushes."}, {"time": 2600, "text": "It fills with blood and then squeezes it, fills with blood and squeezes it, and just that squeezing, that pushing, creates the blood pressure that you need to get blood to every cell in your body, especially when you're standing upright to get blood to your brain, you need a certain amount of pressure to get it up there."}, {"time": 2615, "text": "Isn't it amazing to you how much volume of blood just gets pushed through by this pump?"}, {"time": 2622, "text": "Absolutely, they say every red blood cell takes about five minutes to circulate and come back to the heart, and that circulation kind of starts in the womb and continues kind of until the moment that we die, but the volume is tremendous, and it can never take a break, basically."}, {"time": 2640, "text": "And it's sort of propagating all kinds of stuff throughout the body, it's a delivery mechanism, blood for all kinds of good stuff and bad stuff, nutrition, drugs, all that."}, {"time": 2653, "text": "Right, medications too."}, {"time": 2655, "text": "Medications, such a fascinating design."}, {"time": 2659, "text": "And it also takes the waste away, it kind of brings the nutritious stuff, brings the nutrients, especially oxygen, but many other things, and then it also, as it passes the cell, takes the cell's waste, so it's sort of the fresh water and the sewage system in one."}, {"time": 2673, "text": "So about blood, what do you use fascinating about blood?"}, {"time": 2678, "text": "So we talk about the pump that spreads the blood, but the blood itself."}, {"time": 2683, "text": "Right, so the blood itself is sort of, I mean, it's the most important bodily fluid, of course."}, {"time": 2688, "text": "From moment to moment, every cell in the body needs a flow of blood to bring it, most importantly, oxygen, but also, again, all the other nutrients and to take away waste, and if that stops for even a few moments, you can be in big trouble."}, {"time": 2702, "text": "So blood is sort of the most important medium."}, {"time": 2705, "text": "It's also, doctors use it to kind of evaluate the body."}, {"time": 2709, "text": "It does have this kind of all seeing quality to it, where we can evaluate organs through the blood."}, {"time": 2716, "text": "I can tell you about your liver, your heart, your kidney just by taking a sample of your blood."}, {"time": 2721, "text": "So it's sort of like this crystal ball in a way, and we use it kind of all the time to assess someone's health, to assess their disease."}, {"time": 2729, "text": "Is it also the attack vector for diseases, for bacteria, for viruses and all that kind of stuff?"}, {"time": 2737, "text": "So viruses seem to attack either the throat, maybe you can correct me, but they seem to attack different parts of the body, depending on how easy it is to access and how easy it is to get in deep, depending on what you prefer."}, {"time": 2752, "text": "If you want to do a little bit of hard work, but you get in deep, or you don't want to do the hard work, but you don't get in deep, those are the choices viruses have."}, {"time": 2761, "text": "But is blood one of the sort of attack vectors?"}, {"time": 2764, "text": "What's like, if you were trying to break into the human body, like a parasite, a virus, a bacteria, how would you do it?"}, {"time": 2773, "text": "Like what would be the attack vectors you would explore?"}, {"time": 2776, "text": "Right, so you got to look for the body's weaknesses, of course, you know, we have inherent weaknesses, for instance, like our respiratory tract, we have to breathe, we have to get air in from the outside."}, {"time": 2786, "text": "And so that's one of the entries into the body."}, {"time": 2788, "text": "And so, you know, when we inhale, let's say a poisonous gas, you know, it's an easy way in, you have to breathe, can't hold your breath very long, but, you know, air in our lungs is still kind of contiguous with the external atmosphere, it's not really inside the body until it does cross across the lining of the alveoli into the blood, as you said, that's when it really gets inside."}, {"time": 2809, "text": "And the other besides the respiratory tract, the gastrointestinal tract is another way, kind of a chink in the armor, you know, we have to eat, we have to drink, and therefore we're taking the external world into ourselves, into our gut, in order to extract from it what we need and let the rest kind of flow out."}, {"time": 2825, "text": "So those two, the gastrointestinal and respiratory tract, you know, there's a reason that, you know, respiratory tract infections and gastrointestinal infections are kind of the most common that afflict us because those are the ways in to the body."}, {"time": 2837, "text": "So I would definitely pick one of those, not just be a lazy cold in the nose, but really a more aggressive pneumonia down deep in the lungs and get across that barrier into the blood."}, {"time": 2847, "text": "But also the whole sex thing that humans do."}, {"time": 2852, "text": "So speaking of which, let us go for time to the genitals chapter."}, {"time": 2858, "text": "So what are genitals?"}, {"time": 2861, "text": "I think I've heard of those."}, {"time": 2863, "text": "I think I've read about a penis and a vagina."}, {"time": 2865, "text": "Can you explain to me how those work?"}, {"time": 2868, "text": "Just asking for a friend, but also what do you use fascinating about it and maybe what's misunderstood or little known about them?"}, {"time": 2878, "text": "Sure, so they're very unique organs, I would say."}, {"time": 2883, "text": "One of the things that I like to point out is that, you know, while every organ from moment to moment keeps us alive and ensures our survival, the genitals are in a way the opposite."}, {"time": 2892, "text": "You know, we don't need them from moment to moment."}, {"time": 2895, "text": "You don't even have to use them at all."}, {"time": 2897, "text": "And in fact, they often make us do stupid things that are the opposite of kind of enhancing survival."}, {"time": 2903, "text": "So, and they, you know, they've affected the brain and you can become sort of focused and nuts based on those desires that kind of stem from the genitals."}, {"time": 2911, "text": "So they can be dangerous organs too."}, {"time": 2914, "text": "But you know, I mean, sexual dimorphism helps with genetic variability, as it does in so many other organisms."}, {"time": 2921, "text": "You know, you take two people and mix them together, their genetics, you just get a lot more variation and more opportunities to try different genetic codes and see what'll enhance survival as we talked about sex and death."}, {"time": 2934, "text": "I talk about in the book, a lot of, for instance, the female genital tract, how the uterus is very unusual because, you know, it doesn't even sort of wake up and start doing its thing until the second decade of life."}, {"time": 2945, "text": "You know, it's even though babies, female babies are born with all of the eggs they'll ever have in their ovaries already."}, {"time": 2954, "text": "They're just sort of in this stasis until they start waking up kind of once a month."}, {"time": 2958, "text": "And it's this cycle, you know, there's so much in our bodies that are cyclical and rhythmic, the heartbeat, the breathing, but menstruation is kind of a very strange rhythm that takes over a decade to start."}, {"time": 2971, "text": "And only, you know, the rhythm beats once a month, which is very slow compared to every other rhythm of the body."}, {"time": 2977, "text": "The other unusual thing is, you know, in medicine, when rhythms of the body cease, when they stop, those are emergencies, right?"}, {"time": 2984, "text": "When your heart stops, that's a cardiac arrest."}, {"time": 2987, "text": "You need CPR, maybe an electric shock to restart it."}, {"time": 2990, "text": "When your breathing stops, you know, you need a breathing machine to breathe for you or something to reverse whatever might be causing the suppression of your breathing."}, {"time": 2998, "text": "But when menstruation stops, it's the point of menstruation in the first place."}, {"time": 3003, "text": "The whole reason that the uterus grows a lining and sheds it each month is to one day, you know, get fertile, the ovum to get fertilized and for it to implant in the lining, and then the rhythm ceases."}, {"time": 3014, "text": "And that's obviously not a medical emergency, unlike most other rhythms, you know, cessations, it's the point of the whole thing in the first place."}, {"time": 3021, "text": "So these particular penis and vagina are that whole thing, the uterus, whatever."}, {"time": 3026, "text": "Am I not using the wrong terms?"}, {"time": 3029, "text": "I'll just keep saying."}, {"time": 3031, "text": "You use those terms."}, {"time": 3032, "text": "There's more technical, there's parts, various, various parts."}, {"time": 3035, "text": "In medical school, you learn every bump and, you know, every little part of every little organ including the genitals, so."}, {"time": 3043, "text": "I never really thought of it this way, as you said, is that most organs are kind of full time employees."}, {"time": 3051, "text": "Like 24 seven, they're doing something."}, {"time": 3054, "text": "And then there's some organs, penis, vagina being representative of this, they're not functioning all the time."}, {"time": 3063, "text": "They're only functioning every once in a while and then get us to do stupid stuff or awesome stuff and all that kind of stuff."}, {"time": 3069, "text": "But they're not essential for human survival on a second by second basis."}, {"time": 3074, "text": "And that the whole cyclical nature of the human body, how many other cycles are on a monthly basis?"}, {"time": 3080, "text": "Like that far apart."}, {"time": 3083, "text": "That's a fascinating design that the human body would do that and wouldn't start until the second decade of life."}, {"time": 3092, "text": "It's almost like, what do I want to say?"}, {"time": 3095, "text": "There's some kind of meta planning going on."}, {"time": 3099, "text": "Like this is the optimal solution for the sexual selection mechanism among like somewhat intelligent species."}, {"time": 3108, "text": "Like it's useful to after the brain has developed sufficiently long to now be making sexual selection decisions."}, {"time": 3118, "text": "Like you need time for this computer, this really powerful computer to load in the info."}, {"time": 3126, "text": "You also need the body to develop."}, {"time": 3128, "text": "A child simply isn't big enough to be pregnant and deliver another baby."}, {"time": 3134, "text": "I wonder if there's animals in which this happens at a much more accelerated pace in different stages."}, {"time": 3139, "text": "Definitely, especially certain kinds of insects, like Drosophila, a lot of the fruit fly, a lot of experiments are done on because their life cycle is so rapid."}, {"time": 3148, "text": "A lot of kind of insects and other creatures are almost ready to mate as soon as they're born."}, {"time": 3156, "text": "Is there any improvements to the design?"}, {"time": 3162, "text": "So a lot of people are very interested in these particular body parts."}, {"time": 3167, "text": "If you were to sort of step back as a geneticist, biological designer, or maybe a computer scientist, computer engineer trying to build human 2.0 or maybe a robot, how would you improve the penis and the vagina?"}, {"time": 3185, "text": "Well, the penis for starters, I mean, let's also discuss the testicles."}, {"time": 3189, "text": "They're very important too."}, {"time": 3191, "text": "Okay, so they're fragile and they're important and yet they're hanging off the body in danger basically."}, {"time": 3198, "text": "So does that make sense?"}, {"time": 3200, "text": "You know, they begin in the womb, they begin inside the abdomen and they slowly descend and sometimes before birth, sometimes in the first year of life, sometimes never, they pop out of the body and end up hanging in the scrotum."}, {"time": 3212, "text": "There's a reason because the chemical reactions that create sperm function best at a few degrees cooler than body temperature."}, {"time": 3220, "text": "And so that's why you might notice in the warm weather, they might hang further down and in the cold weather, they scrunch themselves up to get closer to the body to maintain that ideal temperature a few degrees cooler."}, {"time": 3235, "text": "So it's hard, you know, if you could create a sperm production mechanism that did not rely on that lower temperature, that would be great."}, {"time": 3240, "text": "Keep them inside the body protected like the ovaries are."}, {"time": 3244, "text": "Oh, then you wouldn't rely on the lower temperature."}, {"time": 3247, "text": "I thought you meant create some kind of weird internal cooling mechanism."}, {"time": 3251, "text": "No, well, I guess that would be one solution, but just maybe a different type of chemical reaction or, you know, would not be reliant on the lower temperature, let's say."}, {"time": 3261, "text": "You know, it'd be great to design a spermatogenesis or a sperm production process that would function best at body temperature and then we can keep those delicate organs inside the body and not have them hanging out in danger."}, {"time": 3275, "text": "Or maybe the argument for this design is maybe it's nice to put them in danger so you are constantly concerned about it."}, {"time": 3286, "text": "Could be, maybe that's beneficial for male psychology, I'm not really sure."}, {"time": 3290, "text": "There's a psychological element here about the evolution that could be."}, {"time": 3293, "text": "So that's the testicles."}, {"time": 3296, "text": "Penis?"}, {"time": 3298, "text": "A better way to do it, you know?"}, {"time": 3300, "text": "I mean, it's pretty good as it is."}, {"time": 3303, "text": "You know, it kind of, when it's time for it to work, it grows and stiffens and when it's time for it not to work, it kind of shrinks and hangs out."}, {"time": 3312, "text": "Saw this on a Seinfeld episode, so I know how it works."}, {"time": 3317, "text": "Shrinkage."}, {"time": 3319, "text": "But you know, that's also a bit unique, I suppose, that the way it has this erectile tissue."}, {"time": 3326, "text": "Actually, they're similar in the mouth of certain baleen whales, there's a certain similar kind of erectile tissue that helps cool them off because they have so much blubber and create so much heat in moving around and feeding that they have actually a similar, similar to the penis organ in their mouth that helps cool their bodies, because it's a big problem."}, {"time": 3348, "text": "They have to store all that blubber for fuel, but it makes them too hot, so as a compensation, they have this kind of erectile organ in their mouth."}, {"time": 3357, "text": "What about vagina?"}, {"time": 3359, "text": "You know, the fact that miscarriages sometimes happen because of sexually transmitted diseases, because of trauma, you know, it'd be great if the uterus where the growing fetus is is sort of even more protected from those things."}, {"time": 3375, "text": "You know, I guess that's a side effect of the fact that people still have sex when they're pregnant or still, you know, exposed to injury."}, {"time": 3383, "text": "If there was a way to make it more protected, perhaps that would be even better."}, {"time": 3387, "text": "I did see an article recently about artificial wombs, which are rapidly becoming a reality, and in animal studies, they're able to prolong the gestation of a fetus by a month in an artificial womb."}, {"time": 3400, "text": "Can you explain the artificial aspect of the artificial womb?"}, {"time": 3431, "text": "So I believe it's a sort of similar mechanism to keep blood and nutrition flowing to this fetus, and so it's just not inside the body of a parent, it's in some kind of other device, but I think that science is gonna rapidly improve."}, {"time": 3484, "text": "So some aspects of the human body, we can develop technologies that outsource them, sort of offload some of the stress and the workload from the human body to do it elsewhere."}, {"time": 3499, "text": "Like dialysis does that for kidneys, you know, people can live decades without kidneys as long as they get dialysis, which does the work for them."}, {"time": 3509, "text": "Not every organ can do that, for instance, the liver, there's no dialysis version for the liver, like if your liver fails, you need a liver transplant and that's the only thing that's gonna do it for you."}, {"time": 3520, "text": "So that's the world's first artificial womb for humans and we're looking at a picture of what looks like gigantic balloons."}, {"time": 3530, "text": "Matrix, here we come."}, {"time": 3531, "text": "This is very matrixy."}, {"time": 3533, "text": "How are they floating?"}, {"time": 3535, "text": "What are we even looking at?"}, {"time": 3537, "text": "There's giant red spheres."}, {"time": 3540, "text": "This really looks like the matrix."}, {"time": 3543, "text": "I wonder where it's from, so there seems to be a paper on this too."}, {"time": 3547, "text": "I don't know too much about it, but I did see that there, it's advancing very rapidly."}, {"time": 3552, "text": "The world's first artificial womb for humans."}, {"time": 3554, "text": "Scientists in the Netherlands say they're within 10 years of developing an artificial womb that could save the lives of premature babies."}, {"time": 3562, "text": "Premature birth before 37 weeks is globally the biggest cause of death among newborns, but the development also raises ethical questions about the future of baby making and so on and so forth."}, {"time": 3576, "text": "Wow, we're going to be facing a lot of ethical questions as we start to mess with human biology."}, {"time": 3585, "text": "In an effort to help human biology, we might start to mess with it."}, {"time": 3592, "text": "That's going to be very interesting."}, {"time": 3594, "text": "Let's take steps towards the matrix."}, {"time": 3601, "text": "All right, what about the neighbors, poop, feces?"}, {"time": 3607, "text": "There seems to be a lot of interesting stories in that particular output as well."}, {"time": 3616, "text": "What to you is fascinating?"}, {"time": 3620, "text": "What to you maybe is misunderstood or little known about poop?"}, {"time": 3630, "text": "Well, it's hilarious, for one thing, that we do it."}, {"time": 3635, "text": "The word is great as well."}, {"time": 3636, "text": "There's so many different words."}, {"time": 3638, "text": "I do, when I'm talking to the parents of pediatric patients, I use the word poop."}, {"time": 3642, "text": "I don't often, when I'm talking to adult patients, try to choose a more mature word."}, {"time": 3647, "text": "But poop is amazing."}, {"time": 3649, "text": "I mean, I guess it's sort of the dirtiest, the most vile, the most hated aspect of our bodies."}, {"time": 3657, "text": "It's the grossest, we don't want to think about it, talk about it, have it anywhere near our food or in social interactions with good reason."}, {"time": 3668, "text": "I mentioned gastrointestinal infections are one of the most common infections the human body suffers from."}, {"time": 3673, "text": "And the way they spread from person to person, grossly enough, is referred to as the fecal oral route, which means a bit of someone's stool is getting into your, you're swallowing it, through water supply."}, {"time": 3687, "text": "For instance, diarrhea is actually quite a brilliant mechanism of these microbes, right?"}, {"time": 3692, "text": "If you, let's say you're in the intestine of one person, your goal is to get into the intestines of another person."}, {"time": 3698, "text": "Brilliant to just trick their intestines into secreting all this fluid into the intestines to increase the volume of stool and its runniness so that when they do poop, it gets into the water supply and then everyone else kind of ends up getting infected as well."}, {"time": 3714, "text": "Just the same way like tuberculosis or coronavirus kind of infects your lungs and makes you cough and you send it out into the air and it ends up in other people's lungs."}, {"time": 3722, "text": "And that's all evolution."}, {"time": 3726, "text": "So diarrhea is intelligent, is a big takeaway lesson."}, {"time": 3731, "text": "It's one of the most intelligent things we can do as an entirety of an organism, not just the particular cognitive organism, but there's, we're made up of bacteria and viruses and there's a lot of visitors and so on."}, {"time": 3744, "text": "As the entirety of the system, diarrhea is one of our better accomplishments."}, {"time": 3750, "text": "Well, I wonder, why is poop funny?"}, {"time": 3754, "text": "I think a lot of that is socially constructed, just how it's sort of supposed to be hidden away yet something we always do, something we chuckle about as children."}, {"time": 3763, "text": "But even in healthcare, it becomes this big topic of conversation because you end up talking about it constantly."}, {"time": 3770, "text": "Like in the ER, people come in, they're complete strangers."}, {"time": 3775, "text": "Sometimes like a nice old lady who resembles my grandmother and all of a sudden I have to ask her all about what's happening in the bathroom."}, {"time": 3781, "text": "Like, is she straining?"}, {"time": 3783, "text": "What color is it?"}, {"time": 3784, "text": "What's the consistency?"}, {"time": 3787, "text": "Does it float on top of the water more than it should?"}, {"time": 3790, "text": "Is it hard to flush?"}, {"time": 3791, "text": "I mean, there's a million different questions you learn as a medical student and you're like this poop detective when people come in with issues."}, {"time": 3799, "text": "And so it's funny, I guess, in the exam room with the doctor patient relationship, there's sort of no barriers."}, {"time": 3806, "text": "You talk about everything and you're talking about the most intimate details of a person's life, even though you just met them a second ago."}, {"time": 3813, "text": "It's so different than normal social interactions."}, {"time": 3816, "text": "Yet there is this social aspect."}, {"time": 3818, "text": "A lot of what I do is social."}, {"time": 3820, "text": "It seems like doctors, what they do is mostly scientific, but actually it's just relating to another person and you have to maintain your professional demeanor and this normal human level interaction, even though you're talking about poop."}, {"time": 3834, "text": "And that's a skill, that's an art and a science."}, {"time": 3837, "text": "Well, okay, actually I wanna linger on that because I'm a fan of just diving into conversations right away with strangers, just getting no small talk."}, {"time": 3848, "text": "And this is the ultimate, I don't know if it's the ultimate, but it's one version of no small talk."}, {"time": 3854, "text": "You get right to the point."}, {"time": 3858, "text": "That's really powerful from a psychology perspective."}, {"time": 3861, "text": "You're a kind of therapist or you have the power to be a therapist."}, {"time": 3866, "text": "I don't mean just about the medical condition of the body, but the psychological."}, {"time": 3870, "text": "There's so much fear connected to this concern."}, {"time": 3875, "text": "Also, self doubt, insecurities, even sort of existential thoughts about your mortality, all of those things are right there in the room."}, {"time": 3890, "text": "So I think one way doctors deal with that is they kind of have this cold way about them."}, {"time": 3894, "text": "They almost have like dual mode."}, {"time": 3896, "text": "One is like, I'm going to be friendly on the surface and cold about the brutal honesty of the biology."}, {"time": 3905, "text": "But I wonder if there's like a skillful middle ground, this dangerous place where you can help people deal with their psychological insecurities, concerns, fears, all those kinds of things."}, {"time": 3921, "text": "Is that just really tough to do?"}, {"time": 3923, "text": "Yeah, it's a huge part of being a doctor is dealing with the psychological aspects of whatever's going on with the patient's body."}, {"time": 3930, "text": "I mean, in the ER, you deal with psychiatric emergencies kind of left and right more than ever these days."}, {"time": 3935, "text": "And that's a huge issue, not to mention sort of drug use, alcohol related stuff, that gets into sort of psychology and the human love of intoxicants and changing the brain's chemistry and habit, of course, we're creatures of habit and that plays in as well."}, {"time": 3951, "text": "I mean, a big part of, for instance, pediatrics is reassuring parents and kind of convincing them, giving them the confidence that what's going on with their child is not serious, will go away on its own, does not need any particular intervention."}, {"time": 3966, "text": "And, but adults too, reassurance is a huge part of the game."}, {"time": 3972, "text": "Yeah, in the ER, you see humanity at its most raw."}, {"time": 3977, "text": "I feel like you get this tremendous insight into people, how they live, what they worry about, what they think about, how their body works and also how their mind works that you almost don't see anywhere else."}, {"time": 3988, "text": "It's a really interesting place to work."}, {"time": 3990, "text": "And also the way our society is shaped, the ER is where people go for almost everything."}, {"time": 3995, "text": "When they're suicidal, they come to the ER."}, {"time": 3997, "text": "When they're too high on drugs to walk, they come to the ER."}, {"time": 4000, "text": "Children who have been abused, sexually abused, physically abused, come to the ER for us to investigate."}, {"time": 4005, "text": "It's sort of like the all purpose waste bin for the dregs of society, what people do to themselves and what they do to other people."}, {"time": 4013, "text": "You mentioned you're interested in the darkness of humanity and made me think of the ER where you really see what human life is like in the ER."}, {"time": 4022, "text": "Okay, you tweet about, you write about, you think about the emergency room ER."}, {"time": 4030, "text": "Just the little window you give to that world is fascinating."}, {"time": 4036, "text": "What lessons about humanity do you draw from this place where you're so near to death?"}, {"time": 4044, "text": "There's so much chaos."}, {"time": 4046, "text": "There's so much variety of what's wrong."}, {"time": 4049, "text": "So little information or the urgent nature of the information inflows such that you can't really reason sort of thoroughly and deeply and collect all the data, all those kinds of things."}, {"time": 4062, "text": "You have to act fast and then everybody's freaking out."}, {"time": 4065, "text": "Can you just speak to the human condition that you get a glimpse at through the ER experience?"}, {"time": 4075, "text": "Yeah, I think you do see all those things."}, {"time": 4077, "text": "I think on one end of the spectrum, it is this very unique place where you get all these unique insights."}, {"time": 4083, "text": "On the other end, it can become a ho hum workplace just like any other, which is sort of surprising."}, {"time": 4089, "text": "As I mentioned before, humans seem to be able to get used to almost anything and doctors can get ho hum used to, oh, dying of a heart attack, oh, actively in labor and the baby's half out."}, {"time": 4099, "text": "Oh, just ho hum, I know what to do, going about my job and go home and have dinner with my family and not think too much about it."}, {"time": 4108, "text": "I do try to maintain both my fascination."}, {"time": 4113, "text": "I think writers in general tend to think more about what they see, write more about what they see, maybe draw connections with what they see to other things."}, {"time": 4120, "text": "So I do think that writer's perspective does help me kind of maintain my fascination and my kind of more of an insightful perspective than just a ho hum, water cooler conversation."}, {"time": 4133, "text": "But you do see a lot."}, {"time": 4135, "text": "In a way, medical problems are sort of the great equalizer, right?"}, {"time": 4140, "text": "Class, race, culture, background, the failings of the human body, the way it fails and what we can do to help in those situations is almost universal."}, {"time": 4150, "text": "I always like this quote from, Chekhov was a doctor and a writer and he treated a lot of peasants very low class and also treated a lot of aristocrats."}, {"time": 4160, "text": "And he wrote that they all have the same ugly bodies basically, which I think is really right on."}, {"time": 4167, "text": "And it's sort of, you can see people underneath a superficial layer of clothing, maybe it's the most expensive clothing bought from the fanciest places, but underneath their body is still failing in the same way and they still have the same anxieties, the same worry about mortality, the same concerns about why their poop turned green today, all these things that they bring to the table."}, {"time": 4187, "text": "So in a way, it is this great equalizer where people are kind of all the same in some ways."}, {"time": 4193, "text": "Yeah, I feel like people sometimes, class, money, fame, power, makes you for a time forget that you're just a meat vehicle."}, {"time": 4206, "text": "And just as good and just as bad as the other meat vehicles all around you."}, {"time": 4214, "text": "In that sense, there's this question sometimes raised, are some people better than others?"}, {"time": 4220, "text": "And I usually answer no to that question because of that."}, {"time": 4224, "text": "Yeah, some people might be better at math, some people might be better at music."}, {"time": 4229, "text": "But in the end, we're just meat bags."}, {"time": 4233, "text": "Beautiful as we are."}, {"time": 4235, "text": "There's a poem that just, a small tangent I want to take, I just saw it, Just Acting, that you have written."}, {"time": 4247, "text": "I have to, would you classify it as a poem?"}, {"time": 4250, "text": "At first, if I may read it, at first you enter the clinic, shoulders weighed down by white coat pockets, book stuffed, timid, you act out a role, your white coat, a costume, your questions, a script, your demeanor, a rehearsed act."}, {"time": 4268, "text": "No one is going to buy this."}, {"time": 4270, "text": "But then, as you play the role again and again, repeating the lines and the motions, the script slowly dissolves and the interaction becomes thoughtless."}, {"time": 4280, "text": "And the rehearsed act slowly fades into a profession."}, {"time": 4284, "text": "You suddenly find yourself unable to tell if you're still acting or if you're doing it for real."}, {"time": 4291, "text": "And now you're a doctor."}, {"time": 4293, "text": "Jonathan Reisman, MD, Harvard, Massachusetts General Hospital of Medicine and Pediatrics Department."}, {"time": 4299, "text": "Beautiful, so that is what it is to be a doctor."}, {"time": 4304, "text": "You're just acting."}, {"time": 4305, "text": "Fake it till you make it."}, {"time": 4306, "text": "Exactly, fake it till you make it."}, {"time": 4308, "text": "And I think, I imagine every medical student has this feeling when they first go into a room."}, {"time": 4313, "text": "Like I talked about asking this nice old lady about the color of her poop for the first time and you're just like, what am I doing here?"}, {"time": 4320, "text": "Like, does she believe I'm a doctor?"}, {"time": 4322, "text": "You know, this just feels absurd."}, {"time": 4324, "text": "But then it's, again, ho hum, becomes normal."}, {"time": 4329, "text": "Now there's not a sperm chapter in your book."}, {"time": 4334, "text": "You mentioned offline that this is a second and a third book that you're working on all about sperm."}, {"time": 4341, "text": "But, or maybe I'm not."}, {"time": 4344, "text": "Humor tends to make way for reality."}, {"time": 4346, "text": "So the tweet was that a human, an average human male produces 500 billion sperm, I believe, which is about four to five times more than the number of people who have ever lived."}, {"time": 4362, "text": "And each of those sperm is genetically unique so you can think of them, you can kind of imagine the possible humans they could have created."}, {"time": 4371, "text": "And they're all different."}, {"time": 4373, "text": "They have similarities, of course, but they have peculiarities that make them different."}, {"time": 4377, "text": "And you can think of all the different trajectories, all the Einsteins, the Feynmans, the Hitlers, and all the people who would have died during childbirth, would have died early in their years given the different diseases."}, {"time": 4393, "text": "An average human, yeah, we're all winners of a very competitive race."}, {"time": 4399, "text": "So the people who make it, we're winners, hashtag winning."}, {"time": 4403, "text": "Is there something that you find fascinating, interesting, beautiful, ugly, surprising about sperm?"}, {"time": 4418, "text": "I think sperm is, yes, it is a very interesting bodily fluid."}, {"time": 4423, "text": "Maybe I'll write about it in a second or third book, we'll see, but I guess sperm is interesting because it's kind of the only projectile bodily fluid from the body."}, {"time": 4436, "text": "Vomit can be projectile."}, {"time": 4437, "text": "Usually that's a diseased state."}, {"time": 4439, "text": "That's not the expected kind of normal healthy state."}, {"time": 4441, "text": "Oh, sneezing, would you classify that or no?"}, {"time": 4443, "text": "True, I guess it's, yeah, there's some particles in the air."}, {"time": 4446, "text": "I guess it's not a fluid, I mean, not a liquid, but true."}, {"time": 4451, "text": "I mean, cough, in addition to sneeze, right?"}, {"time": 4453, "text": "Sneeze is how our nose gets rid of something that shouldn't be there."}, {"time": 4457, "text": "Cough is how our lungs get rid of something that shouldn't be there."}, {"time": 4459, "text": "Vomiting is sometimes how our stomachs get rid of something that shouldn't be there."}, {"time": 4462, "text": "All projectiles sometimes in their own way."}, {"time": 4465, "text": "Sperm is sort of interesting."}, {"time": 4466, "text": "It's created with the food for its journey."}, {"time": 4468, "text": "Sperm mostly feed off of fructose, a kind of sugar, for the few days that they live inside the female genital tract."}, {"time": 4501, "text": "It's really amazing."}, {"time": 4502, "text": "And when you learn about it from the biological perspective, the most amazing thing is how many things can go wrong, just in the sperm not surviving long enough for it making it to the egg, and then some genetic abnormality causing a miscarriage."}, {"time": 4517, "text": "It's sort of astounding that it works as often as it does, and I think the lesson there is just that people have a lot of sex, and so statistics just favor it's gonna work out a good number of times."}, {"time": 4529, "text": "Yeah, and there might be intelligence in the design of just the sheer number of sperm."}, {"time": 4533, "text": "Maybe that's yet another way to inject variety into the system."}, {"time": 4538, "text": "And redundancy, I guess."}, {"time": 4540, "text": "We have two kidneys, we have two hands."}, {"time": 4542, "text": "If we lose one, we can still go on."}, {"time": 4544, "text": "We have however many millions of sperm get sort of launched in every ejaculation is if a bunch fail or don't make it inside."}, {"time": 4554, "text": "There's papers on this, by the way, that I read for some reason."}, {"time": 4557, "text": "Not read, but skimmed for some reason, which is talking about which sperm usually wins."}, {"time": 4564, "text": "Like what are the characteristics of sperms that are winning, and it's not the fastest."}, {"time": 4569, "text": "So apparently there's some kind of slaughter that happens early on, people will correct me, but it's not the fastest."}, {"time": 4577, "text": "There is an aspect of it's the luckiest."}, {"time": 4579, "text": "It really is, like the body tries to make it a random selection."}, {"time": 4583, "text": "It tries to make it fair in making it as random as possible."}, {"time": 4587, "text": "Interesting, and also interesting that they're fueled by fructose."}, {"time": 4592, "text": "So they're a carb loaded athlete."}, {"time": 4597, "text": "Right, with food for the journey."}, {"time": 4598, "text": "Food for the journey, because I'm somebody that actually does a lot of running on, I guess you would call me a fat adapted athlete."}, {"time": 4606, "text": "So I do sort of meat heavy diet."}, {"time": 4611, "text": "And so you could do a lot of endurance kind of stuff when you don't need any carbs, any glucose, any of that kind of stuff."}, {"time": 4618, "text": "And you're very low."}, {"time": 4619, "text": "It's interesting to think that sperm are like, nope, they're total bros. Let's go to the gym, sprint, performance, short term performance is everything."}, {"time": 4631, "text": "All right, well, that sperm, returning to the liver, the place that deals with all our poor decisions."}, {"time": 4642, "text": "Many of our poor decisions."}, {"time": 4644, "text": "Is there, you said that the liver does quite a few things."}, {"time": 4650, "text": "What to you is fascinating, beautiful about the liver?"}, {"time": 4653, "text": "I'd say it's primary function seems to be as the sort of gatekeeper for what we eat and absorb."}, {"time": 4660, "text": "You know, the entire gastrointestinal tract from the esophagus to the rectum, the blood flows from it, not back to the heart, but to the liver where it's first examined, kind of things are evaluated, packaged, you know, processed, detoxified, perhaps."}, {"time": 4679, "text": "It's kind of this great overseer of what we digest and absorb."}, {"time": 4683, "text": "And so it kind of keeps track of what's coming in, you know, the outside world that comes in and will become part of us."}, {"time": 4691, "text": "You know, that's why partly the liver suffers sometimes the injury from certain toxins like alcohol."}, {"time": 4699, "text": "But beyond that, the liver is also the place, as I said, it metabolizes things too."}, {"time": 4703, "text": "So it metabolizes alcohol and why it can be injured by alcohol."}, {"time": 4707, "text": "It metabolizes drugs like Tylenol, which is why Tylenol can be very toxic to the liver when taken as an overdose."}, {"time": 4716, "text": "So the liver, you know, even beyond that, the liver produces a lot of different, you know, things that float in the bloodstream."}, {"time": 4723, "text": "It packages cholesterol and fats and sends them to where they're needed."}, {"time": 4728, "text": "It deals with protein in the blood."}, {"time": 4730, "text": "It deals with clotting factors in the blood, helping the blood clot, you know, processes things like bilirubin and other things that really, as I mentioned, is like 15 organs wrapped into one."}, {"time": 4740, "text": "Maybe that's why it's sort of the biggest internal organ."}, {"time": 4742, "text": "The skin's bigger, but it's not an internal organ."}, {"time": 4746, "text": "Right, the biggest organ in the human body is the skin."}, {"time": 4750, "text": "Right, but the liver's the biggest internal organ and it really is a powerhouse and does a lot, which is why when people suffer from liver failure, kind of everything goes wrong in a way."}, {"time": 4761, "text": "And in terms of replacing organs, what are organs that are easily replaceable, which are not?"}, {"time": 4769, "text": "Like on the list of things that are hard to replace and not, what would you put in number one?"}, {"time": 4774, "text": "What would you put like at the bottom?"}, {"time": 4777, "text": "Well, I'd say the kidneys are, you know, nothing's easy, but kidneys are easiest in a way."}, {"time": 4781, "text": "Partly, I mean, maybe a big factor there is that other people have two of them and can give one to you."}, {"time": 4786, "text": "So you don't have to wait for people to die, which is the case with hearts and livers."}, {"time": 4790, "text": "Sometimes you can take a part of a liver from someone who's alive and the liver does have this kind of mythological ability to regenerate itself."}, {"time": 4799, "text": "In the myth of Prometheus, he's chained to a rock and the bird eats his liver every day and it grows back every day."}, {"time": 4806, "text": "And that's actually biologically accurate."}, {"time": 4810, "text": "Not that you can completely get rid of it and it'll appear again, but when pieces of it are removed or injured, it does regenerate itself pretty amazingly."}, {"time": 4819, "text": "So I'd say the kidneys, the fact that there are more around, also it's, you know, the kidney is a smaller organ."}, {"time": 4824, "text": "It's often just, you don't have to put a transplanted kidney where the kidney should be in the back of the abdomen."}, {"time": 4829, "text": "You can just kind of stuff it into the pelvis there because it's a smaller organ."}, {"time": 4832, "text": "The liver would be hard because it's huge."}, {"time": 4836, "text": "And I guess we just have the most experience with kidney transplants because they are the most common."}, {"time": 4841, "text": "And the heart and the brain are probably quite difficult."}, {"time": 4846, "text": "Brain, as far as I know, hasn't been successfully done."}, {"time": 4849, "text": "The heart is done."}, {"time": 4852, "text": "And definitely I've evaluated a lot of patients with a heart transplant."}, {"time": 4856, "text": "It does work pretty well."}, {"time": 4858, "text": "The mechanical heart substitutes are also advancing quite rapidly these days."}, {"time": 4863, "text": "For a failing heart, there are certain kinds of devices they can surgically implant."}, {"time": 4868, "text": "Like when a failing heart isn't able to push hard enough, you know, that's the heart's job is pushing blood with sufficient pressure to create blood pressure."}, {"time": 4875, "text": "When it fails, there are actually these devices you can strap onto the heart to help it pump harder."}, {"time": 4881, "text": "Those are rapidly advancing."}, {"time": 4883, "text": "Many of those were not available even 10 years ago when I got out of med school and now they're commonly used."}, {"time": 4889, "text": "So maybe heart transplant won't be as necessary in the future if those mechanical things do advance."}, {"time": 4894, "text": "And as I said, the heart is basically a mechanical pump."}, {"time": 4897, "text": "So perhaps it would be the easiest organ to replace with some mechanical device."}, {"time": 4901, "text": "Now for something completely different, returning to testicles for a time."}, {"time": 4905, "text": "You posted a Instagram post of testicles as food."}, {"time": 4911, "text": "Perhaps eating them doesn't help libido because ingested testosterone is totally metabolized in the liver, returning to our liver, leaving none to reach the bloodstream."}, {"time": 4923, "text": "That is why testosterone only comes as injection or topical foam, not as pills."}, {"time": 4930, "text": "On the other hand, estrogen and progesterone can be absorbed orally, hence the pill."}, {"time": 4937, "text": "But testosterone is mostly responsible for libido in women too."}, {"time": 4941, "text": "I was not expecting for this biology lesson when I was looking at an Instagram picture of, are we looking at testicles?"}, {"time": 4950, "text": "Are these like, which species?"}, {"time": 4954, "text": "I believe all those are from cows."}, {"time": 4956, "text": "From cows, cow testicles."}, {"time": 4957, "text": "Cows are technically female, so bulls."}, {"time": 4959, "text": "Yeah, well, speaking of which, just we'll jump around a bit, but you've also traveled the world quite a bit."}, {"time": 4967, "text": "What is the craziest food you've eaten across the world?"}, {"time": 4976, "text": "What have you learned about the extremes of the culinary arts by traveling the world?"}, {"time": 4983, "text": "I would say, I guess I've always been extra fascinated with the diets of natives of the far north."}, {"time": 4991, "text": "I spent some time there in Russia and in Alaska and always loved their diet."}, {"time": 4998, "text": "So when I worked in Alaska in emergency room and did some other travels in Arctic Alaska, and they eat a lot of fat."}, {"time": 5007, "text": "Traditionally before contact, more than half of all calories in the Inupiat Eskimo diet came from blubber, marine mammal fat, or also fat from fish, fat from ducks and other birds that go up there to mate in the summer."}, {"time": 5021, "text": "So things like raw whale blubber was especially interesting for me and very exciting."}, {"time": 5028, "text": "You know, I had some beluga whale chowder, things like that."}, {"time": 5032, "text": "There's just all these very unusual dishes."}, {"time": 5035, "text": "You know, there's a dish called Mikiyak, which is whale meat fermented in whale blood, which is quite delicious actually."}, {"time": 5045, "text": "So is it cooked, is it eaten raw?"}, {"time": 5048, "text": "How do they like their fat?"}, {"time": 5049, "text": "Like in the same way up north in Russia, as you mentioned."}, {"time": 5054, "text": "So they often eat it raw."}, {"time": 5056, "text": "So the raw whale blubber is called Muktuk and it's often just sliced thin and it's sort of cold, but not frozen often when they eat it and they slice it thin."}, {"time": 5066, "text": "And a lot of people assume it would be very chewy, but it's not that chewy."}, {"time": 5071, "text": "It's quite pleasant actually and has this kind of sea smell to it as you're eating it."}, {"time": 5076, "text": "I quite like it."}, {"time": 5077, "text": "And what's the culinary culture like?"}, {"time": 5081, "text": "Meaning, is it just source of energy or is it art?"}, {"time": 5085, "text": "Well, there's, you know, traditionally, there's not a lot of cooking in the Arctic."}, {"time": 5091, "text": "A lot of things are eaten raw, partly because there's not a lot of fuel for making fires."}, {"time": 5096, "text": "So they will, you know, some of the big rivers in Russia, for instance, that flow north, they will bring trees, you know, dead trees and logs up to the north and they can get some wood that way."}, {"time": 5107, "text": "And same thing in some of the rivers kind of flowing northward from the Brooks Range of Alaska."}, {"time": 5112, "text": "You do get some trees, but just not enough to really produce a culinary art that requires cooking with heat."}, {"time": 5120, "text": "You know, they do have traditionally blubber lamps where the blubbers of seals and whales are used to create a little flame."}, {"time": 5128, "text": "Often that's for light and for a little bit of heat and less for cooking."}, {"time": 5134, "text": "But eating things raw is definitely a huge part of the culture there."}, {"time": 5138, "text": "And while I was, I went on a whale hunting trip out on the spring ice in the Arctic Ocean by Barrow, Alaska."}, {"time": 5144, "text": "And two of the guys, the Inupiat guys who had invited me were kind of talking about how eating things raw is sort of the most essential characteristic of Inupiat culture."}, {"time": 5154, "text": "And the one guy who's half white, half Inupiat, said people often doubt his ethnicity because he looks like a white guy."}, {"time": 5160, "text": "So he'll, you know, bite the head off of a raw bird to show them that he is truly Inupiat, is what he said."}, {"time": 5167, "text": "That's how you prove you're legit."}, {"time": 5169, "text": "We're looking at an Instagram pic."}, {"time": 5171, "text": "As a doctor, I was used to knowing fat as the most maligned of all body parts and the culprit in an obesity epidemic."}, {"time": 5179, "text": "But in Arctic Alaska, fat has always meant health and survival."}, {"time": 5184, "text": "In fact, the entire story of life in the Arctic, especially human life, is basically a tale of fat."}, {"time": 5190, "text": "And in Barrow, what's A.K.?"}, {"time": 5193, "text": "Alaska."}, {"time": 5194, "text": "Alaska, okay."}, {"time": 5196, "text": "A lawn covered with a whale blubber is still equivalent of a plush green lawn in temperature suburbia, swelling in its owner with pride."}, {"time": 5206, "text": "And that's what we're looking at, is a lawn full of whale blubber."}, {"time": 5213, "text": "A beautiful, and this, so this is, I mean, there's a lot of calories there."}, {"time": 5217, "text": "And this can feed a lot of people."}, {"time": 5218, "text": "A lot of energy, a lot of warmth."}, {"time": 5221, "text": "Absolutely, and it's delicious."}, {"time": 5223, "text": "This was like, I was a kid in a candy store, basically."}, {"time": 5226, "text": "I rounded a corner in Barrow."}, {"time": 5228, "text": "So when people do get a whale during the spring whaling season, they raise a flag or the whaling captain raises a flag over his house and everyone in town is welcome to come try some."}, {"time": 5238, "text": "And so before I went inside to try some, I was kinda playing around with blubber and I saw the, this is a bowhead whale."}, {"time": 5246, "text": "I saw its heart, which was huge, like the size of a yoga ball."}, {"time": 5251, "text": "And that was, for me, just like amazing."}, {"time": 5253, "text": "I spent probably the next 45 minutes just looking at all aspects of it."}, {"time": 5257, "text": "And the stump of aorta that was attached to it was the size of my thigh."}, {"time": 5261, "text": "That was really fascinating."}, {"time": 5263, "text": "It's similar Alaska and Northern Russia, like Siberia and out there."}, {"time": 5268, "text": "So where were you?"}, {"time": 5270, "text": "I think you have some pics from that time."}, {"time": 5273, "text": "Where were you in Russia?"}, {"time": 5275, "text": "So I spent a lot of time in kind of Western Russia as well, but I did take two trips to Kamchatka, including Northern Kamchatka."}, {"time": 5284, "text": "I didn't go far enough, I didn't go to Chukotka, for instance, until more recently when I was a ship doctor on a wildlife cruise that sailed from Anadyr, Russia, up to, through the Bering Strait into Wrangell Island."}, {"time": 5299, "text": "And we stopped in some villages in Chukotka and I got a chance to try some whale and stuff like that."}, {"time": 5305, "text": "Northern Kamchatka, where it's more the Koryak are the indigenous people."}, {"time": 5309, "text": "They do a lot of seal hunting, so I had a lot of seal blubber, but I don't believe they do any whale hunting quite there."}, {"time": 5315, "text": "But the Chukchi in a way are sort of, you know, similar to the Inupiat in their diet and their life ways."}, {"time": 5322, "text": "Of course, everyone's diet, all these people's diet has changed dramatically in the last 100 years, as it has for actually everyone living in kind of modern societies."}, {"time": 5330, "text": "But for them, perhaps more than anyone else since their diet was the most extreme, I think of any human culture on earth."}, {"time": 5337, "text": "Just to stay on the wild travel you did, and I should say, I'm using the word travel, but it really, you were a doctor there."}, {"time": 5350, "text": "Well, first of all, can you just comment on the decision to go to such places and to help people, to be a doctor there?"}, {"time": 5359, "text": "What was the thinking behind it?"}, {"time": 5360, "text": "Well, I think I got the travel bug before I ever went to medical school and even wanted to be a doctor."}, {"time": 5366, "text": "So right after college, I kind of wasn't very into college, didn't enjoy things, kind of wanted to get out there and see the world, get out of New York City where I was a student at NYU."}, {"time": 5379, "text": "The first thing I did after finishing college was I was invited to be an intern at a research center in St. Petersburg, Russia."}, {"time": 5387, "text": "I spent six months there on my first trip and went back four more times to Russia, traveled all over, including to Kamchatka twice and other parts of the country."}, {"time": 5397, "text": "I'd never heard of cities like Petrozavodsk and Syktyvkar and Pskov."}, {"time": 5402, "text": "I didn't even know a word could start with P, S, K, like the city of Pskov, but it can."}, {"time": 5408, "text": "And I was sort of fascinated."}, {"time": 5410, "text": "I was actually studying the international environmental movement and how it came to Russia after the fall of the Soviet Union and how organizations like Greenpeace and World Wildlife Fund and the World Bank are trying to kind of push the timber industry, which is huge in Russia, toward a more sustainable path."}, {"time": 5429, "text": "And so I was sort of evaluating how is it working?"}, {"time": 5432, "text": "If not, why not?"}, {"time": 5434, "text": "And that seems like such a little niche, such a small detail about Russian society, but in a way, researching that in depth was almost this window into the entire country and the history in a place I knew nothing about."}, {"time": 5446, "text": "And I learned the language, traveled all over the country, got to know the food, the history, the literature."}, {"time": 5453, "text": "It was just an immersive and amazing and life changing experience that made me want to see every spot on the globe, basically, and learn about every culture."}, {"time": 5463, "text": "So I took that desire with me to medical school."}, {"time": 5466, "text": "I decided I would go to medical school."}, {"time": 5468, "text": "And from the very beginning, I was intent on traveling around the world."}, {"time": 5473, "text": "So a lot of my career has been fashioned so that I'm practicing medicine in a place with an interesting geographic context, an interesting place with an interesting cultural context."}, {"time": 5484, "text": "And that just makes it more interesting, I find."}, {"time": 5514, "text": "And that's taken me to Arctic Alaska, to Pine Ridge Reservation, South Dakota."}, {"time": 5519, "text": "I currently work in a few different parts of Pennsylvania, Appalachia, which for me is a unique geography and culture that I didn't grow up with, wasn't familiar with."}, {"time": 5528, "text": "So in some ways, it's exotic for me as well."}, {"time": 5532, "text": "I worked in other places too, like Kolkata, India, Nepal."}, {"time": 5536, "text": "Just I think my love of travel has shaped my medical career and being a doctor does give you these opportunities to go to places and travel in a unique way through the medical profession."}, {"time": 5550, "text": "You know, there's a documentary, Happy People Here in the Taiga or something like that."}, {"time": 5555, "text": "I think Warner Herzog voices it."}, {"time": 5559, "text": "It tells a story of a simple life of survival in the taiga and I think they're trapping for food and there's an alcoholism problem too as well."}, {"time": 5571, "text": "There's like a very basic life of survival, of loneliness, of desperation, but also there's a, I think the underlying claim of the documentary is that that simple life that simple life actually has a kind of simple happiness to it, hence the name Happy People."}, {"time": 5600, "text": "Can you speak to the life that people live in those places when it may be simpler than you would in a sort of big city life?"}, {"time": 5612, "text": "It's definitely very different for sure."}, {"time": 5616, "text": "You know, I guess I found like in some of the remote villages of Kamchatka, I was actually surprised how similar they were in that I saw the same family strife, the same fights, the same kind of pairing of relationships and bickering and politics."}, {"time": 5638, "text": "In a way, I'm from the New Jersey suburbs and being in this remote village of Northern Kamchatka, I remember writing an email to my friend about how just it seemed so similar, even though on the surface it was this exotic other world, the incredible material know how they must have to get their food from the land."}, {"time": 5657, "text": "You know, that the number of animal species, plant species, the behaviors of the animals, seasons, how to live that way."}, {"time": 5665, "text": "In a way, it's more complicated in a way that I find fascinating how people live on the land and the knowledge and experience it takes to do it well and survive."}, {"time": 5673, "text": "You know, obviously other aspects of modern life in a city are much more complicated than they would be there, but I guess it's, that was something that struck me too, that it's simpler in some ways, but more complicated in other ways."}, {"time": 5685, "text": "So some of the complexity that happens in life is originated from humans, not from the technology or all that kind of stuff around us."}, {"time": 5695, "text": "You can take the human out of modernity, but they're still human."}, {"time": 5698, "text": "They're still human, and they fill the empty space with their own human complexities."}, {"time": 5703, "text": "Are there people that just stand out, memorable people, memorable experiences from those places?"}, {"time": 5713, "text": "Some people that maybe made you smile, made you cry, changed who you are as a man, changed who you are as a doctor, anything jumps to mind?"}, {"time": 5724, "text": "I think, you know, when I was, it was interesting, when I was in Russia, I found that most of the people I hung out with were old women."}, {"time": 5731, "text": "I'm not sure why."}, {"time": 5732, "text": "I mean, actually I didn't meet a lot of old men in Russia, which might speak to kind of life expectancy there for men in particular."}, {"time": 5741, "text": "But I found women, older Russian women, including, you know, Russian from St. Petersburg or some of the elderly women in Kamchatka, who were, you know, some were Koriak, some were half Koriak, half Russian, some were Chukchi."}, {"time": 5755, "text": "I just found them to be so enlightening the way they talked about history, about people, so insightful about humanity, you know, all they've lived through in the last 50 years in some of these parts of Russia, like the upheaval, societal upheaval, the destruction, the building up."}, {"time": 5772, "text": "It's just something I could not even imagine."}, {"time": 5775, "text": "And I think their insights were just very, I'm not thinking of anything in particular, but I just remember I could listen to some of these elderly women talk about their lives for hours and hours."}, {"time": 5785, "text": "I remember there was this older, elderly blind Koriak woman who you would have thought was the, you know, most country bumpkin of country bumpkin, and yet she couldn't stop talking about how much she loved reading Dostoevsky and Tolstoy, which might also speak to the Soviet education system."}, {"time": 5801, "text": "And it was just sort of surprising and fascinating, and just those stories and perspectives on life really stayed with me."}, {"time": 5808, "text": "Yeah, with babushki."}, {"time": 5813, "text": "There's a wisdom, there's a kindness."}, {"time": 5817, "text": "I mean, I suppose that's true for older people in general, but there's something about, it's not just Russia, it's Eastern Europe, it's like this kind of look of wisdom, and not just like sort of middle class wisdom or something like that."}, {"time": 5843, "text": "It's like I have seen some shit wisdom, I've seen it all."}, {"time": 5850, "text": "And on the other side, I'm left here with a pragmatism and a compassion, and also an ability to cook really well."}, {"time": 5859, "text": "That's for sure, absolutely."}, {"time": 5861, "text": "There's just this balance of just deep intelligence and deep kindness, and yeah, I mean I part much of who I am is because of the relationship I had with my grandmother who was a Russian, Ukrainian born Russian grandmother."}, {"time": 5881, "text": "Did you learn the Russian language?"}, {"time": 5883, "text": "I did, it's quite rusty at this point, but I did, one of these wonderful elderly Russians in St. Petersburg sort of adopted me."}, {"time": 5892, "text": "I think that was another thing that a lot of these elderly women on every side of the country kind of adopted me or saw me as this real curiosity."}, {"time": 5901, "text": "This was around 2002, 2003, it just wasn't common for this sort of strange American to suddenly show up in the middle of Kamchatka or even St. Petersburg, and just absolutely ravenously curious about everything they had to say."}, {"time": 5916, "text": "So I often got adopted and one of them taught me Russian and how to ride a horse, so the same babushka taught me both of those things."}, {"time": 5926, "text": "And like you said also, I should mention that there's something about the Soviet education system where yeah, everybody reads Tolstoy, Dostoevsky, it's exceptionally well read."}, {"time": 5936, "text": "No matter where life has taken you, no matter where you come from, the literature, the mathematics, the sciences, they're all like extremely well educated and that creates a fascinating populace."}, {"time": 5952, "text": "Like then you take that education, that excellent early education, and you throw a bunch of hardship at those people and then they kind of cook in that hardship and come out really fascinating people on the other end."}, {"time": 5970, "text": "It makes me surprised sort of that, for instance, like Russian medical science is not, doesn't, you don't see a lot of sort of studies, medical studies, advancing of medical science come out of Russia."}, {"time": 5982, "text": "It's just sort of, I'm surprised sort of, I wish that it would."}, {"time": 5985, "text": "I visited Akademgorodok outside Novosibirsk, which is an entire city the Soviets created just for the study of science and it's like there's the geology building and there's the biology building and there's the chemistry building and I just feel like Russia has this potential to be a science powerhouse or even in the medical sciences but I guess you just, I don't see it."}, {"time": 6007, "text": "I mean, you can certainly guess as to why and I see the same thing in the other, in the sciences I hold the dearest sort of, in computer science, in engineering fields."}, {"time": 6020, "text": "I kind of long held this desire, by long, I mean, last couple of years because a bunch of people reached out to me from Yandex and Moscow State to give lectures there to sort of connect."}, {"time": 6034, "text": "You know, why so little science is coming out of there?"}, {"time": 6037, "text": "Why so little that we hear about?"}, {"time": 6041, "text": "And it feels like we should be able to bridge the scientific community."}, {"time": 6044, "text": "Like science, let's even say, even in turmoil of geopolitics, even in global conflict, I feel like science should be bigger than that."}, {"time": 6056, "text": "But why do we not hear from the scientists is because of the limitations on human freedoms, on scientific freedoms."}, {"time": 6065, "text": "I feel like in China, in Russia, in any regime of its sort, you should give freedom to scientists to flourish and to interact with others and you can only grow from that."}, {"time": 6080, "text": "You shouldn't suppress that."}, {"time": 6083, "text": "The sort of Cold War ideas, we should put those aside."}, {"time": 6087, "text": "As somebody who spent time in Russia, as somebody who learned Russian, do you have some thoughts that you want to say about the war in Ukraine currently?"}, {"time": 6101, "text": "It's tragic, of course."}, {"time": 6104, "text": "Seemingly pointless to watch the destruction of a country in real time."}, {"time": 6111, "text": "I guess it's, you know, when you read Russian history and Ukrainian history, I guess it just, it's sort of, you know, destruction is a big part of it."}, {"time": 6119, "text": "The populace being beaten down is a big part of it, you know, from the Mongolian hordes through the Tsar and the Soviets and Putin."}, {"time": 6129, "text": "I guess, you know, it's just, in science in particular, medical science, it feels like this sort of unrealized potential."}, {"time": 6135, "text": "You know, the culture is so beautiful, the people are so smart and well educated."}, {"time": 6140, "text": "I think the word unrealized potential is kind of how I feel."}, {"time": 6144, "text": "That's why I wanted to celebrate that part of the world is there's so many beautiful people, so many brilliant people."}, {"time": 6151, "text": "And I just happen to know the language so I'm able to appreciate the beauty of those people."}, {"time": 6156, "text": "I'm sure the same is true in China."}, {"time": 6158, "text": "I'm sure, that's one of the things that makes me sad is there's all these cultures that I don't know about."}, {"time": 6164, "text": "I can't fully appreciate their brilliance."}, {"time": 6166, "text": "Even Japan and places like that that are sort of, there's channels of communication wide open and there's a lot of interaction."}, {"time": 6174, "text": "It's still, not knowing the language, I feel like I miss some of the culture."}, {"time": 6178, "text": "Or Portuguese and, you know, looking at South America and all that kind of stuff."}, {"time": 6183, "text": "But anyway, in Russia there certainly is that unrealized potential."}, {"time": 6188, "text": "In Ukraine, so many brilliant scientists, engineers came from Ukraine, from Russia."}, {"time": 6194, "text": "And I hope they get to flourish soon."}, {"time": 6198, "text": "And I hope we put this, I hope we stop this war, because all war is hell."}, {"time": 6209, "text": "Is there something to comment about the biology of war, is there echoes of the emergency room experience?"}, {"time": 6221, "text": "Have you dealt with patients that have been touched by war time?"}, {"time": 6229, "text": "Definitely, war and medicine has a very intricate and complex relationship."}, {"time": 6234, "text": "I don't know if it was Walt Whitman who said it, though he was a nurse during the Civil War, that war is the best medical school."}, {"time": 6241, "text": "But some people have said that."}, {"time": 6243, "text": "And even advancements in medicine come from war."}, {"time": 6248, "text": "The wars in Iraq and Afghanistan have, in some ways, really revolutionized certain aspects of the way we treat trauma patients in the civilian world as well."}, {"time": 6257, "text": "The importance of tourniquets, the importance of transfusing whole blood instead of red blood cells isolated from serum and platelets, et cetera."}, {"time": 6267, "text": "The importance of pain control in the battlefield, that's changed dramatically."}, {"time": 6270, "text": "Everything from ketamine injections to fentanyl lollipops in the battlefield."}, {"time": 6275, "text": "So war has really improved medicine in many ways."}, {"time": 6279, "text": "In another way, the Department of Defense spends a lot of money on medical research and really pushes the envelope."}, {"time": 6286, "text": "DARPA is one aspect of the military budget that really funds these moonshot experiments that are really fascinating and really push the frontiers more than seemingly most kind of universities doing doctors and researchers doing their research."}, {"time": 6304, "text": "So in a way, the space program, which sort of was military initially then became civilian under NASA, also has led to a lot of advances and understandings of health on Earth and in space."}, {"time": 6316, "text": "So the military or war in general is a huge way that medicine advances, not to mention the epidemics that come."}, {"time": 6325, "text": "My grandmother was from what's today Moldova, what was then Romania."}, {"time": 6329, "text": "She got typhus during World War II."}, {"time": 6333, "text": "So there's typhus outbreaks, there's cholera outbreaks, you know, all these, even infectious disease things can advance in war, which you wouldn't expect."}, {"time": 6340, "text": "You expect sort of trauma to be the sort of main problem, but actually infection is a huge problem throughout history and war."}, {"time": 6346, "text": "So we can learn a lot."}, {"time": 6348, "text": "It's this kind of horrific natural experiment in medical care."}, {"time": 6353, "text": "Yeah, and I've recently been reading about some of the horrific medical experiments performed by Nazi scientists, Nazi Germany."}, {"time": 6363, "text": "I'll talk about it another time perhaps, but nothing reveals the honesty of human biology like war."}, {"time": 6373, "text": "Just to stay on your wild journeys for a little bit longer, you have a tweet about Shackleton saying, here's a photo of Shackleton's medical kit from his storied expedition to Antarctica in the 1910s."}, {"time": 6386, "text": "Some perigoric for pain, some laxative."}, {"time": 6390, "text": "Only the essentials."}, {"time": 6393, "text": "Would you put laxative under the essentials?"}, {"time": 6396, "text": "Anyway, sorry to interrupt."}, {"time": 6399, "text": "When I worked as a ship doctor in Antarctica in 2018, I had a huge cabinet full of meds and even EKG machine."}, {"time": 6408, "text": "So if you can comment sort of on that contrast."}, {"time": 6414, "text": "First of all, your own journey, how harsh was it?"}, {"time": 6416, "text": "How difficult was it?"}, {"time": 6418, "text": "And given that context, can you think about how hard Shackleton's journey was?"}, {"time": 6426, "text": "I think the difference is unimaginably stark."}, {"time": 6429, "text": "One thing I do wanna point out is that the use of laxatives early in the 20th century and before that, they were used for a surprising number of ailments where they probably did not help at all."}, {"time": 6441, "text": "But I think that was a holdover from sort of the old theory of medicine, the humoral theory where you have to balance the fluids in the body."}, {"time": 6448, "text": "And so causing people to vomit, causing them to have diarrhea or purposely taking blood out of them in bloodletting was a big part."}, {"time": 6456, "text": "And I think that crazy use of laxatives was maybe a holdover from that time."}, {"time": 6461, "text": "But that being said, they were probably not eating very high fiber food on that expedition."}, {"time": 6467, "text": "So perhaps laxatives could have been helpful."}, {"time": 6469, "text": "There's a lot of seal, penguin and seal meat being eaten, which is not super high in fiber."}, {"time": 6476, "text": "So I don't wanna discount the importance of laxatives in that setting."}, {"time": 6480, "text": "But that wouldn't be the essential thing."}, {"time": 6482, "text": "If you're thinking of a tiny kit that has only the essentials, I mean pain, yes."}, {"time": 6489, "text": "Laxatives, I don't know, maybe not."}, {"time": 6491, "text": "I think the medical kit possibilities were much narrower back then."}, {"time": 6496, "text": "This was before antibiotics, before I think germ theory might've been, it was known, but there wasn't much to do about it."}, {"time": 6505, "text": "So the availability of medicines, I mean, that's something that exploded over the course of the 20th century."}, {"time": 6510, "text": "So what I can put in a backpack today filled with modern medications, whether injectable or to be taken orally is just many orders of magnitude greater than what they had back then."}, {"time": 6522, "text": "So when I went, my expedition was nothing like Shackleton's."}, {"time": 6526, "text": "I was on a huge cruise ship with 160 Japanese passengers who came with their own translators."}, {"time": 6533, "text": "And as I said, I had cabinets, not just one cabinet, many cabinets full of medications, both injectable, some patches, some pills."}, {"time": 6544, "text": "I was very impressed actually with what was available there."}, {"time": 6548, "text": "And I didn't have to use a lot of it, thankfully, though I did use some of it for people."}, {"time": 6554, "text": "And I slept and I got free room and board on the ship."}, {"time": 6559, "text": "So every Southern summer cruise ships go take people to Antarctica, the Southern Atlantic islands like the Falklands and other parts of the South Pacific."}, {"time": 6569, "text": "And then in the Northern summer, the same kind of cruise ship explosion happens going to Greenland and Iceland and Svalbard and Franz Josef Land and other parts of the North Alaska."}, {"time": 6580, "text": "So, and every ship needs a doctor."}, {"time": 6582, "text": "So it's a great opportunity."}, {"time": 6584, "text": "They want specifically ER doctors to deal with emergencies, but you're really working in the middle of nowhere."}, {"time": 6591, "text": "And all you have is the medications there on the ship and supplies and your knowledge and experience."}, {"time": 6597, "text": "And so it's a very different experience than working in a high tech modern hospital with every bit of technology and every sub specialist consultant available."}, {"time": 6606, "text": "But I sort of liked that challenge."}, {"time": 6608, "text": "I mean, I like going to the ends of the earth."}, {"time": 6609, "text": "It's beautiful, it's exciting, it's fascinating."}, {"time": 6612, "text": "Practicing medicine in those settings is extra challenging and really makes you hone some of your skills, which is part of the reason that I sought them out."}, {"time": 6622, "text": "Do you see echoes of some of that same effort?"}, {"time": 6625, "text": "I've gotten a chance to interact with astronauts and those kinds of folks working on space missions."}, {"time": 6630, "text": "Do you see some of those same echoes of challenging efforts going out into space and maybe landing on Mars and maybe beginning to build a small colony on Mars?"}, {"time": 6642, "text": "Yeah, I think the healthcare that is needed will be a big part of that."}, {"time": 6646, "text": "Obviously, we're probably gonna send overall quite healthy people, but there's a lot of medical decisions to make about what should be brought, what should be expected."}, {"time": 6654, "text": "To some extent, I've had a lot of doctors say, oh my goodness, I can't believe you work in the middle of nowhere."}, {"time": 6659, "text": "What do you do if someone gets a brain bleed, like falls, hits their head, needs a neurosurgeon?"}, {"time": 6664, "text": "I mean, the obvious answer is they die."}, {"time": 6666, "text": "You know, when you're in the middle of Antarctica, things kill you that wouldn't if you're inside a university hospital that's fully equipped to help with every problem that arises."}, {"time": 6676, "text": "Mars takes that to a crazy extreme, obviously."}, {"time": 6680, "text": "I know that even going to Antarctica, different countries have had different strategies."}, {"time": 6684, "text": "I believe it was Australia used to kind of just, in anticipation, remove people's gallbladders just so that it wouldn't get inflamed because that is a very common medical emergency."}, {"time": 6696, "text": "So they would just remove it beforehand, even though it was not diseased at all, just so that while they're stuck in Antarctica over the winter, for instance, that wouldn't be a problem."}, {"time": 6704, "text": "You know, there's many other issues that can arise."}, {"time": 6707, "text": "But so those are some decisions to make."}, {"time": 6709, "text": "Maybe the people who go into Mars should have their appendix removed, their gallbladder removed."}, {"time": 6713, "text": "Maybe they should have a cardiac cath to see if they have coronary artery disease just to know their chances of getting a heart attack there."}, {"time": 6719, "text": "Though it's not always predictive."}, {"time": 6720, "text": "You know, it's hard to predict who's gonna get a heart attack, but maybe with all the data around today, we'll get better at predicting."}, {"time": 6726, "text": "But that will be a huge part."}, {"time": 6727, "text": "You know, we can't have people, the few pioneers in a Mars colony dying of heart attacks and things like that."}, {"time": 6733, "text": "Don't anticipate stuff."}, {"time": 6733, "text": "Would you go?"}, {"time": 6735, "text": "You've gone to some harsh conditions to be a doctor."}, {"time": 6738, "text": "Would you go to Mars to be a doctor?"}, {"time": 6741, "text": "It would definitely be amazing, I think, because I have a wife and two small children, probably not in the cards for me at this point, but."}, {"time": 6750, "text": "You humans with your human attachments."}, {"time": 6753, "text": "Sex and death."}, {"time": 6755, "text": "If you just put more priority on the death than the sex, I think we would be better off."}, {"time": 6764, "text": "I would love to go to Mars."}, {"time": 6765, "text": "And actually, you know, I practice high altitude medicine in Nepal."}, {"time": 6768, "text": "Space medicine is sort of an extension of that."}, {"time": 6770, "text": "You know, the air is just much thinner, like nonexistent."}, {"time": 6773, "text": "You know, as you go higher in the mountains, the things that happen to human physiology are very bizarre and strange and still not well explained by science."}, {"time": 6781, "text": "And in space, it's just like a crazy extension of high altitude."}, {"time": 6787, "text": "If I could just return to the, we didn't really, I think we mentioned a little bit about the food you had."}, {"time": 6793, "text": "Just if we can high level say, what is the greatest meal you've ever had?"}, {"time": 6798, "text": "So your last meal, let's go."}, {"time": 6801, "text": "If one more meal, I get to murder you after this."}, {"time": 6806, "text": "This is your last day."}, {"time": 6807, "text": "We get to spend it together."}, {"time": 6808, "text": "Where in the world would you go?"}, {"time": 6809, "text": "What would you eat?"}, {"time": 6810, "text": "I would say the most delicious thing is bone marrow."}, {"time": 6816, "text": "And I would love a full meal of bone marrow for my last, last dish."}, {"time": 6819, "text": "I did on my birthday in 2002, ate a kilogram and a half of crab meat in Kamchatka."}, {"time": 6826, "text": "And that was also amazingly delicious."}, {"time": 6830, "text": "The king crab they have there is incredible."}, {"time": 6832, "text": "But I would go with bone marrow, which is I think just one of the most delicious foods."}, {"time": 6837, "text": "And it's sort of this weird body part."}, {"time": 6839, "text": "You know, it's basically all your stem cells, not all of them, but the stem cells that produce all your blood cells."}, {"time": 6844, "text": "So they are spitting out billions of white blood cells, red blood cells and platelets every day."}, {"time": 6849, "text": "And there's a bunch of fat in there as well."}, {"time": 6852, "text": "Just one of the places the body stores fat."}, {"time": 6854, "text": "And so you basically add heat and that's all you need."}, {"time": 6857, "text": "It's like the perfect food."}, {"time": 6858, "text": "You add heat."}, {"time": 6859, "text": "The fat for frying the stem cells is already there."}, {"time": 6862, "text": "There's naturally a bone vessel to contain it all."}, {"time": 6865, "text": "Probably add some flavor too."}, {"time": 6869, "text": "Does it matter which animal?"}, {"time": 6873, "text": "I prefer a larger animal just so there's more of it."}, {"time": 6875, "text": "I actually like, well that's true."}, {"time": 6877, "text": "I actually really like sort of bone marrow from like chicken bones."}, {"time": 6880, "text": "Right, just sucking it out of the bone."}, {"time": 6882, "text": "Yes, I'm known for leaving absolutely nothing edible on the plate except bone itself."}, {"time": 6888, "text": "There's one other human I know that loves bone marrow as much as you do and that's Joe Rogan."}, {"time": 6897, "text": "So go, it's unnatural how much that man loves bone marrow."}, {"time": 6903, "text": "I love the steak part."}, {"time": 6904, "text": "The bone marrow, you know what, let me argue with you because I don't know, it could be an acquired taste but there's just too much, it's like too much with too little work for it."}, {"time": 6920, "text": "Like it's as if you gave me lobster meat without the lobster having to clean the lobster."}, {"time": 6927, "text": "I just feel like I'm spoiling myself."}, {"time": 6930, "text": "So it's very fatty, it's, I don't know, maybe I wanna work for something that tastes like that."}, {"time": 6936, "text": "Well if you start from the whole animal, you do have to work to get at it, right?"}, {"time": 6939, "text": "A lot of animals have the teeth and the jaw muscles to chomp through bone, we do not."}, {"time": 6945, "text": "So when you buy it from the store, it's already sawed up but I've definitely gotten marrow out of deer bones with a hatchet, just chop off the fat end and start spooning it out."}, {"time": 6956, "text": "Or maybe I'll revisit it, that's fascinating."}, {"time": 6959, "text": "And where, where would you eat it?"}, {"time": 6961, "text": "Where and which place of the world?"}, {"time": 6964, "text": "Is there something about who cooks it, who you eat it with?"}, {"time": 6970, "text": "You're not allowed to pick your family."}, {"time": 6977, "text": "So like which place in the world, rural or in the city, those kinds of things, you've been to so many fascinating places."}, {"time": 6985, "text": "I would say I'm, Antarctica I would say is one of the most picturesque places I've ever been."}, {"time": 6991, "text": "I really did not, I didn't know how mountainous it was and I guess I knew there'd be ice but just I didn't know how much ice it was."}, {"time": 6999, "text": "You know, it's ice and mountains just overwhelming."}, {"time": 7002, "text": "I just, you know, as kind of overwhelming bone marrow might seem to you, sort of that feast for your eyes."}, {"time": 7008, "text": "And just ice in general is amazing, like the icebergs floating around Antarctica is just astounding, like the different shapes, the sizes are incredible."}, {"time": 7019, "text": "There's actually a, I believe it's a US Navy website that tracks the largest icebergs and you can read about each of them and how big they are and just the formations you see, similar up near Greenland, though I have not been to Greenland."}, {"time": 7032, "text": "Just ice in general is just amazing."}, {"time": 7034, "text": "So I could just look at its different forms while eating bone marrow forever, until you kill me, that is."}, {"time": 7039, "text": "Yeah, and afterwards we go."}, {"time": 7041, "text": "There's back to the death, the death and sex."}, {"time": 7045, "text": "What is it about the ice?"}, {"time": 7046, "text": "Is it sort of the enormity of nature that just reminds you that it's going to be there before you and after?"}, {"time": 7055, "text": "And then you get to partake in the eating of the thing you need for maintaining of your biological, temporary biological organism?"}, {"time": 7064, "text": "Yeah, I think it's a few things."}, {"time": 7067, "text": "One is just the shapes that you see, the wave action, just eating away at these pieces of ice."}, {"time": 7073, "text": "You get these arches and just these shapes."}, {"time": 7075, "text": "I mean, it's just like."}, {"time": 7076, "text": "Geometry."}, {"time": 7077, "text": "The geometry alone is amazing."}, {"time": 7079, "text": "I studied math as an undergrad and I've always appreciated geometry and just the shapes alone are just look like brilliant works of modernist art and just obviously no two are ever the same."}, {"time": 7092, "text": "Not to mention a lot of them are this unearthly blue color that is just really startling and fascinating."}, {"time": 7098, "text": "The same color of glaciers in various parts of the world, that blue color is just really amazing."}, {"time": 7106, "text": "And I also just love how it's sort of this constant shedding from our Antarctic continent, from Greenland."}, {"time": 7112, "text": "It's this constant process of snow falling inland and pushing the glaciers further out to sea and them breaking loose."}, {"time": 7118, "text": "I mean, obviously it seems to be happening faster these days, but it's sort of this constant shedding and sort of, I always like thinking about how the body has something similar."}, {"time": 7126, "text": "We're constantly shedding and renewing and rebuilding everything."}, {"time": 7131, "text": "And so ice is sort of this constant similar process."}, {"time": 7136, "text": "Yeah, I did not know you were a math undergrad."}, {"time": 7140, "text": "So that, I mean, you just keep getting more fascinating."}, {"time": 7145, "text": "Can you maybe take a small step into that direction?"}, {"time": 7148, "text": "What do you find beautiful about mathematics?"}, {"time": 7151, "text": "Why did you journey into that part of the world for a time?"}, {"time": 7155, "text": "I liked math."}, {"time": 7156, "text": "I especially liked, so college math, I did some calculus in high school."}, {"time": 7160, "text": "When I got to college math, I was amazed that there were no more numbers."}, {"time": 7165, "text": "The digits disappeared."}, {"time": 7166, "text": "It was just variables, concepts."}, {"time": 7170, "text": "There was almost no more numbers at all."}, {"time": 7172, "text": "It was like this totally abstract kind of way of thinking."}, {"time": 7177, "text": "But that sort of reflects the natural world and teaches you about the natural world, though it's sort of this perfect platonic ideal, perhaps, of the natural world that can still sort of help explain what happens in the natural world."}, {"time": 7189, "text": "But just these concepts are so abstract from life and from the natural world."}, {"time": 7196, "text": "I was actually getting interested in the natural world at the same time when I was at NYU studying math."}, {"time": 7202, "text": "I took a tour of Central Park that was pointing, the guy, Steve Brill, was pointing out these wild edible plants."}, {"time": 7209, "text": "And I was learning to identify the first plants and knowing what's edible, what's not."}, {"time": 7213, "text": "That was totally fascinating."}, {"time": 7215, "text": "And sort of this kind of thing that I felt like was connecting me to nature."}, {"time": 7218, "text": "And it was balanced with this utterly abstract science, or utterly abstract lessons I was getting in math class where I was thinking through series."}, {"time": 7228, "text": "As we approach infinity, what happens to these equations?"}, {"time": 7231, "text": "And concepts of like rings and abstract algebra, I don't know, it was just this dichotomy that I enjoyed both aspects of."}, {"time": 7240, "text": "Yeah, the concepts."}, {"time": 7241, "text": "But so different, this kind of logical, rigorous view of the world and the world of biology."}, {"time": 7252, "text": "Why the big, how did that feel to take the leap into the biological, the mushy mess of the human body from the mathematical, which is all very clean?"}, {"time": 7264, "text": "Right, it does feel like a big step."}, {"time": 7267, "text": "I think there's more connection than you think."}, {"time": 7269, "text": "We talked about symmetry of the body earlier."}, {"time": 7272, "text": "That is a real thing."}, {"time": 7273, "text": "Fluid dynamics of how our various bodily fluids flow and what makes them not flow as well and what makes them flow better."}, {"time": 7281, "text": "All these different aspects of science go into the body."}, {"time": 7286, "text": "Everything from hard bone to softer kind of flesh to liquids of various consistencies."}, {"time": 7296, "text": "A lot of science and math does teach you about kind of how the body works, how it can work better, what happens in sort of disease states."}, {"time": 7305, "text": "Yeah, I suppose there's a connection."}, {"time": 7309, "text": "There's also kind of a sort of computational biology of this computational equivalence of each of the disciplines which are becoming more and more fascinating with all the work that DeepMind is doing and the work of genetics, all that kind of stuff, simulating different parts of the body to try to gain an intuition understanding of it."}, {"time": 7329, "text": "That to me is super fascinating, but sometimes it does feel like an oversimplification of the way the body really does it because the body is an incredibly weird complex system and it finds a way."}, {"time": 7345, "text": "The adaptability, the resilience, the redundancy that's built in, it's weird."}, {"time": 7351, "text": "It's incredibly powerful and so unlike the kind of computer based systems that we build, at least we engineer in the software engineering world, which kind of starts to make you think how can we engineer computer systems in a different way that make them more resilient in the real world?"}, {"time": 7370, "text": "That's sort of the robotics question."}, {"time": 7375, "text": "What does it take to build a humanoid robot or robots that are as resilient as the human body?"}, {"time": 7382, "text": "How difficult do you think is that problem?"}, {"time": 7384, "text": "Having studied the human body, how hard is the engineering problem of building systems like that guy over there, the legged guy that is as resilient as the human body to the harsh conditions of the real world?"}, {"time": 7398, "text": "I think it's very hard and we definitely haven't gotten there yet."}, {"time": 7402, "text": "I think we could probably learn lessons from people who are trying to grow artificial organs in the lab to eventually transplant into people, which would solve a huge problem of needing to get those organs from others and the rejection of putting a foreign material inside your body."}, {"time": 7417, "text": "Your immune system tends not to like that."}, {"time": 7419, "text": "That has advanced a lot recently."}, {"time": 7422, "text": "I think some advances actually have been where we pay a lot of attention to stem cells, stem cells, stem cells."}, {"time": 7429, "text": "We can grow whatever we want out of stem cells, but now there's sort of a recognition that what we call the extracellular matrix, which is sort of the foundation of the body, the thing that holds all the cells into their proper shape and keeps them where they should be, that is actually crucial."}, {"time": 7447, "text": "And there's probably a lot of signaling that goes on."}, {"time": 7449, "text": "Like you stick a stem cell on the right extracellular matrix, it will turn into the kind of cell that you want and take the right shape and position and start functioning."}, {"time": 7457, "text": "I think that's been a huge, huge advance knowing that it's not just these celebrity stem cells that are the answer."}, {"time": 7465, "text": "It's this kind of part in the background, this sort of just like laying the foundation, the system that you put these cells onto."}, {"time": 7472, "text": "And we're not there yet, but there's definitely a lot happening, a lot of research happening."}, {"time": 7476, "text": "And I think there'll be some advances probably soon."}, {"time": 7479, "text": "So now on the topic of interaction of computational systems with biology."}, {"time": 7487, "text": "So if you look at a company like Neuralink or the whole effort of brain computer interfaces, now there's a neurosurgery component there."}, {"time": 7496, "text": "We have to connect electrical systems with biological systems."}, {"time": 7504, "text": "So just even the implanting is difficult."}, {"time": 7509, "text": "Then the communication is difficult."}, {"time": 7511, "text": "But what would you say from what you know about the brain, what you know about the human body and all the beautiful mess that's there, how difficult is the effort of Neuralink?"}, {"time": 7520, "text": "Do you think it's feasible?"}, {"time": 7522, "text": "I think it's definitely feasible."}, {"time": 7524, "text": "I think we need to probably know more than we do and know how to connect it in all these ways."}, {"time": 7531, "text": "I think some advances, for instance, much less sexy, but really already impacting medical care is something called deep brain stimulation, which is done for Parkinson's disease and others where neurosurgeons implant this device that's electrically stimulates the part of the brain that is not functioning in Parkinson's disease."}, {"time": 7551, "text": "And it's quite dramatic how effective it works."}, {"time": 7553, "text": "And I remember as a med student, watching a neurologist literally like turn the electricity up on this handheld thing, and you could see the person's Parkinson tremor go away and you could see them start to walk in a more steady fashion."}, {"time": 7600, "text": "As far as I know, I'm not an expert in the area."}, {"time": 7603, "text": "First of all, I believe and I trust in the adaptability of the biological system to whatever crazy stuff you try to shove in there."}, {"time": 7610, "text": "So it's going to potentially reject things, but it's also going to, if it doesn't reject things, adapt."}, {"time": 7617, "text": "And if we can create computational systems that also adapt, AI systems that adapt and can kinda, both of them reach towards each other and figure stuff out."}, {"time": 7628, "text": "But actually our current AI systems are not very adaptable to the what, like in the wild way that biology is adaptable, like adaptable to anything."}, {"time": 7639, "text": "And if we can build AI systems like that, I feel like there's some interesting things you could do, but of course there's ethics and there's real human lives at stake."}, {"time": 7649, "text": "And there you can't quite experiment."}, {"time": 7652, "text": "You have to have things that work and maybe simulation can help, but reality is, it's a dangerous playground to play on."}, {"time": 7664, "text": "It is messy."}, {"time": 7665, "text": "You tweeted that quote, \"'If you look back from far enough into the future, \"'every doctor today will look like a total quack.'\""}, {"time": 7676, "text": "First of all, that's humbling to think about."}, {"time": 7680, "text": "Like we don't know what we're doing in the great, like there's been so much progress that we kinda have this confidence that we figured it all out."}, {"time": 7689, "text": "If you look at history and you read how people thought, I mean, there's so many moments in history where people really thought that they figured it all out."}, {"time": 7698, "text": "It's almost like there's nothing else left to do at every stage in history."}, {"time": 7703, "text": "And then you realize no, progress often happens like exponentially."}, {"time": 7710, "text": "And every moment you continue to think you figured it all out."}, {"time": 7713, "text": "But if you're being honest, if you're being humble, then you realize we're just shrouded in mystery."}, {"time": 7719, "text": "So what do we make of this?"}, {"time": 7721, "text": "Like how should we feel that?"}, {"time": 7722, "text": "How should you feel as a doctor?"}, {"time": 7724, "text": "How should we feel as scientific explorers of the human body?"}, {"time": 7730, "text": "The fact that we're probably going to be wrong about everything we currently know."}, {"time": 7734, "text": "Right, there's a saying actually, by the time you finish med school, half of what you learned is wrong, which is quite illustrative."}, {"time": 7742, "text": "And becoming more true as time goes on, so much medical research going on, so much learning going on, it's really wonderful in a way."}, {"time": 7750, "text": "But in some ways we still learn these concepts from the past."}, {"time": 7754, "text": "And I know when you take a test as a medical student, sometimes you know they want you to give the old answer, but you know there's a new answer because of recent science, but you know to give the old answer, that's now incorrect to get the question right on the test."}, {"time": 7768, "text": "That happens actually quite a bit because things change so quickly."}, {"time": 7773, "text": "Yet, you know, when I look back at doctors from centuries past, I mean, it's absurd what they were doing to their patients."}, {"time": 7779, "text": "I mean, for probably for most of human history, they were doing more harm than good."}, {"time": 7783, "text": "You know, they're draining people of their blood."}, {"time": 7786, "text": "That was, you know, bloodletting was a huge part of medical care."}, {"time": 7791, "text": "You know, George Washington died of a paratonsular abscess, an abscess right next to the tonsil, which has the great name of Quincy, and they bled him to death."}, {"time": 7800, "text": "You know, I mean, kind of adding insult to injury."}, {"time": 7802, "text": "Doctors are a menace and do a lot of harm."}, {"time": 7805, "text": "I mean, hopefully not intentionally."}, {"time": 7807, "text": "You know, even medical errors are still a huge problem, cause of death and morbidity."}, {"time": 7813, "text": "So we do a lot of things that are not great, but you know, our knowledge, yeah, it's very imperfect at this point."}, {"time": 7819, "text": "I do have some confidence."}, {"time": 7821, "text": "You know, I guess perfect scientific studies that try to get at the reality of the universe are essential because when I think of why a certain medication works for a certain condition, it might make perfect sense in my head, knowing the biology, the biochemistry, the anatomy, it makes perfect sense, it must work."}, {"time": 7840, "text": "I gave it to the patient, they got better, and that's happened 20 times in the last year, but it's, you know, I'm wrong."}, {"time": 7846, "text": "Like when you actually do a study, it actually doesn't help, maybe it hurts."}, {"time": 7851, "text": "And that's really, I think the way we explain medications working in our minds is often wrong when you end up finally doing the study."}, {"time": 7861, "text": "And some of the most interesting experiments involve what we call sham surgery."}, {"time": 7889, "text": "And then it turned out that it's not clear arthroscopy is actually helping."}, {"time": 7893, "text": "And the same, there was a recent huge study of putting a stent in someone's coronary arteries if they have stable chest pain, not like I'm having a heart attack, you need a stent like right then, but, you know, kind of chronic coronary artery disease where every time I run up the stairs, I get chest pain, and then when I rest, it goes away."}, {"time": 7912, "text": "Like obviously you put a stent, you increase blood flow to the heart, like how could that not work?"}, {"time": 7917, "text": "But then when they did the sham catheterization, it actually looks like it might not actually help better than the sham."}, {"time": 7924, "text": "So I think those placebo controlled studies are essential."}, {"time": 7927, "text": "I mean, it is shocking, and this has been driven home during the last two years, how hard it is to figure out what the hell's going on in the universe, especially with our bodies."}, {"time": 7936, "text": "Like it is really hard to get at the truth and what you think makes sense, like often turns out, I mean, the history of modern medicine is littered with examples where it made perfect sense and it seemed to help some patients, and it turns out it's not doing anything or it's harmful."}, {"time": 7951, "text": "Yeah, there's all kinds of narratives swimming around."}, {"time": 7953, "text": "We convince ourselves as a human civilization that something is true."}, {"time": 7957, "text": "There's a propaganda machines, there's just self delusion."}, {"time": 7961, "text": "There's a centralized communities, like there's a scientific community that believes a certain thing."}, {"time": 7968, "text": "There's the conspiracy theories that believe a certain thing."}, {"time": 7971, "text": "Sometimes the scientific community, right?"}, {"time": 7972, "text": "Sometimes the conspiracy theorists are right throughout human history, I mean."}, {"time": 7977, "text": "And we now think the scientific community, well, now the science has really figured it out."}, {"time": 7982, "text": "We're way smarter than we were in the past."}, {"time": 7984, "text": "And then there's these like interesting studies that I've seen, I think Robin Hansen mentioned it to me, that if you look at the entirety of medication, like the effect of medication on human health, if you do those kinds of broad studies, does it actually help?"}, {"time": 8004, "text": "Like does quality of life, lifespan, certain measures of the wellbeing, does if you, and you look at human society as a whole, does taking medication or not actually help?"}, {"time": 8017, "text": "And those studies find there's no positive or negative effect with medication."}, {"time": 8022, "text": "And that's a very kind of interesting perspective."}, {"time": 8026, "text": "That mean you could probably argue a lot of ways, but the point is, because you can bring up literally a billion cases where medication has significant positive impact on a particular patient, but you have to kind of zoom out and honestly look at the positive effects of medicine, of lifestyle choices, diet choices, of exercise or not."}, {"time": 8052, "text": "Maybe we'll find eventually that exercise is actually bad for you."}, {"time": 8055, "text": "Maybe like there's all kinds of things that we're going to, I feel like we're going to figure out."}, {"time": 8064, "text": "One of the things I think we're going to figure out, everything I've learned about my body, is that aside from it being adaptable, there's a lot of very unique parameters that are opaque to me that I'm measuring through this feedback mechanism by trying stuff and learning about it."}, {"time": 8083, "text": "And one of the things we might learn is that medicine cannot be done without collecting a huge amount of data about each individual human."}, {"time": 8093, "text": "So it's absurd to be, like if I show up and see a doctor, it's absurd for that doctor to have just a couple of minutes with me."}, {"time": 8103, "text": "Like just looking at basic symptoms, looking at such crappy data."}, {"time": 8112, "text": "Like first of all, no long term data, no longitudinal data, no historical data, no detailed analysis of all the possible things."}, {"time": 8125, "text": "Not just the related to your symptoms, but related to other things that you're not complaining about."}, {"time": 8130, "text": "Just giving you a full picture of the data and then using AI to help the human doctor highlight the things that you should perhaps pay extra attention to."}, {"time": 8141, "text": "I think we'll look back at this time as ridiculous that doctors were expected to help anybody whatsoever without having the data, without having a huge amount of data about the human body."}, {"time": 8152, "text": "Like you have to do so much with so little data."}, {"time": 8155, "text": "It's very 19th century."}, {"time": 8158, "text": "So it relies on the brilliance of doctors and of course the intuition, the instinct you build up over time."}, {"time": 8165, "text": "And that's quite powerful."}, {"time": 8166, "text": "The human brain is pretty damn good for using experience to teach you how to make a good decision."}, {"time": 8172, "text": "But still it's, you might as well be bloodletting."}, {"time": 8176, "text": "Like it's humbling to think about that."}, {"time": 8182, "text": "It is humbling and it's important."}, {"time": 8184, "text": "I think doctors sometimes lose that humble perspective on what they do."}, {"time": 8190, "text": "And I think it's very important because as I said, medical history is just, medical dogma has been tossed into the trash bin so many times."}, {"time": 8197, "text": "Something doctors were sure of was the case is not."}, {"time": 8200, "text": "And it's important to be cognizant of that."}, {"time": 8206, "text": "You tweeted about somebody that had a big impact just by reading about him on my life as well."}, {"time": 8216, "text": "Still think about him."}, {"time": 8218, "text": "Rest in peace, Dr. Paul Farmer."}, {"time": 8220, "text": "A big inspiration to me."}, {"time": 8221, "text": "His medical career was a testament to what one person can do to improve the world."}, {"time": 8227, "text": "So who was Paul Farmer?"}, {"time": 8229, "text": "And what made him a great doctor and a great man and somebody who was an inspiration to you?"}, {"time": 8235, "text": "So Paul Farmer was a kind of pioneer of global health."}, {"time": 8239, "text": "He started Partners in Health, which is kind of an international health organization that operates originally in Haiti, also Rwanda and elsewhere."}, {"time": 8250, "text": "And I think he was just so a zealot for getting healthcare to some of the poorest people in the world."}, {"time": 8258, "text": "And I remember reading some of his books and a book about him by Tracy Kidder that's really great, Mountains Beyond Mountains, about how even when he was a medical student, he was flying back and forth to Haiti in between exams and just with this really intense focus and interest in getting healthcare to where it's not."}, {"time": 8278, "text": "And I think traveling around the world, especially to poor places like India, Calcutta, Nepal, you really see how unevenly the benefits of modern medicine are spread over the surface of the earth."}, {"time": 8290, "text": "Not only if you're, cause if you're in Antarctica and have a heart attack, you're in serious trouble, but just medications that cost pennies a day can help people."}, {"time": 8301, "text": "A lot of children in India under five die of diarrhea and all they need is oral rehydration solutions to stay hydrated."}, {"time": 8310, "text": "Most of them can't afford IV fluids, for instance, to get admitted to the hospital."}, {"time": 8313, "text": "And really dehydration just kills hundreds of thousands of kids throughout the world."}, {"time": 8318, "text": "Not to mention bacterial pneumonia also is a major cause of death in children under five."}, {"time": 8324, "text": "And many of them, not all, would be saved by amoxicillin, which is just pennies."}, {"time": 8330, "text": "And I, for me, I took a, had a path and I wanted to have a career in global health."}, {"time": 8336, "text": "And I started traveling abroad to India and elsewhere when I was a medical student and continued doing that."}, {"time": 8341, "text": "Paul Farmer was sort of one of the first to kind of open everyone's eyes, I think, about the good you can do with just money that we would, you know, change that we would throw away, just, you know, put in a person, forget it, or wherever we accumulate change these days."}, {"time": 8356, "text": "So that's very eye opening."}, {"time": 8358, "text": "And while medical science advances and that's good, you know, we shouldn't forget that 100 year old treatments could save lives in parts of the world where they're just not available."}, {"time": 8367, "text": "People should definitely read Mountains Beyond Mountains."}, {"time": 8370, "text": "Just, for me at least, sort of a person from outside all of it, it was the first person to make me realize how difficult and the amount of humanity that's involved in being a doctor."}, {"time": 8386, "text": "So it's not some kind of cold economics based argument about where to send treatments and so on."}, {"time": 8392, "text": "That is there too, like you said, basic treatments can help hundreds of thousands, millions of people in many parts of the world."}, {"time": 8402, "text": "But it's also when you have a patient in front of you, there's some aspect of you that's willing to give a lot of your time, a lot of your money, a lot of your effort to saving them, even though it doesn't make any sense."}, {"time": 8420, "text": "It's irrational in some sense, but it's also human."}, {"time": 8423, "text": "And that's the struggle of every doctor."}, {"time": 8425, "text": "Like when you have to choose how to allocate your time, how to allocate your mental energy."}, {"time": 8430, "text": "It's a tough choice that a doctor has to make and it's a human choice."}, {"time": 8435, "text": "It's not some kind of cold game theoretic choice."}, {"time": 8439, "text": "It's also a human choice and it can be irrational in some sense."}, {"time": 8444, "text": "People are asking you for help."}, {"time": 8445, "text": "That's basically what every patient interaction is."}, {"time": 8448, "text": "Someone's asking you for help."}, {"time": 8449, "text": "So your inclination is to help them."}, {"time": 8452, "text": "And even if it means going above and beyond, I mean, a lot of factors affect how compassionate a doctor might be on any given day or point in their career, their own stress and burnout, et cetera."}, {"time": 8465, "text": "But it's someone asking you for help and so you do what you can to help them."}, {"time": 8471, "text": "You've done quite a lot of things in your life."}, {"time": 8478, "text": "Of course, there's a lot of story yet to be written."}, {"time": 8481, "text": "But what advice would you give to young people today?"}, {"time": 8484, "text": "In high school, maybe undergrad, college, starting out on that journey."}, {"time": 8490, "text": "Maybe trying to pick majors, trying to pick jobs, careers, dreams and goals they can pursue."}, {"time": 8498, "text": "What advice would you give them to have a career they can be proud of or to even have a life they can be proud of?"}, {"time": 8505, "text": "Well, I think having passion, which isn't always a voluntary thing."}, {"time": 8510, "text": "You just have it or you don't perhaps."}, {"time": 8512, "text": "But becoming passionate about something and following it wherever it takes you, I think is really important."}, {"time": 8519, "text": "You know, when I finished college and sort of went to Russia for the first time, that was in some ways the beginning of my whole career and passions in my life."}, {"time": 8529, "text": "And I didn't know what I was going for, what was gonna happen, what kind of career it would turn into, what kind of job would it help me get when I got back."}, {"time": 8536, "text": "I wasn't thinking about any of that."}, {"time": 8537, "text": "I mean, I'm very fortunate I got that opportunity."}, {"time": 8540, "text": "I'm very fortunate to be able to go and see those places and have my mind opened."}, {"time": 8545, "text": "And I think that really just the fuel from that passion that was created during that time is still 20 years later going strong."}, {"time": 8553, "text": "I'm partial to healthcare."}, {"time": 8555, "text": "I love being a doctor."}, {"time": 8556, "text": "I think it's the perfect combination of kind of intellectual problem solving, being a detective while also working with your hands."}, {"time": 8564, "text": "You know, when you do procedures, especially in the ER, it's sort of the perfect combination."}, {"time": 8569, "text": "I'm not a surgeon, but I do use my hands quite a bit for a variety of reasons."}, {"time": 8575, "text": "And so I always loved working with my hands."}, {"time": 8577, "text": "I loved crafts, especially prehistoric crafts before medical school."}, {"time": 8583, "text": "And I just love kind of problem solving, getting clues, figuring out what's going on, following your nose, using your instincts, your knowledge, and also just keen observation of the patient."}, {"time": 8595, "text": "After seeing patient after patient, hundreds of patients, maybe thousands over years, you do get this sort of innate kind of sense, this gestalt about what might be going on."}, {"time": 8604, "text": "And, you know, it's not always a numbers thing."}, {"time": 8606, "text": "There's always, gestalt is actually a big part of medicine."}, {"time": 8610, "text": "You know, you often in ERs or in hospitals, hear a nurse or a doctor say something like, this patient just doesn't look good."}, {"time": 8617, "text": "And it's sort of, you can't point to a number, a value, a level in their blood, you know, a test, but something about them."}, {"time": 8625, "text": "And a lot of that I think has to do with the color of their skin, believe it or not, which can change in certain disease states."}, {"time": 8632, "text": "But I think that it's just, medicine combines this observation, the skills, the knowledge, it's art and science, it's human, and it's robotic, you know, algorithmic at the same time."}, {"time": 8646, "text": "And I think it just, yeah, combines kind of all my passions all in one."}, {"time": 8651, "text": "And I would, you know, if anyone's going into healthcare, I'd strongly encourage them to do so, but I'm very biased."}, {"time": 8656, "text": "So with that early passion, whatever that little flame was that brought you to Russia, were you able to vocalize it or was it just something like a gut that's pulled you towards some exploration of the unknown or something like this?"}, {"time": 8673, "text": "I think it was a combination of things."}, {"time": 8674, "text": "One was just going to a different place that was different from where I grew up, you know."}, {"time": 8679, "text": "The suburbs, you know, when you're in high school, you hate them, later on they don't seem so bad."}, {"time": 8684, "text": "But, you know, I just wanted to get, I mean, I'm very fortunate how I was raised and never wanted for anything that wasn't rich, but just to get out and see a different place, a different people with a different culture and history and language and literature and to see different climates and geographies and ecosystems, I just wanted to see something different."}, {"time": 8703, "text": "And that, I guess that's what I've sought after ever since."}, {"time": 8707, "text": "So just that was just so fascinating."}, {"time": 8709, "text": "Like my trip to Kamchatka in 2003, where I was there for four months and I didn't speak English for, I think, two months out of it."}, {"time": 8717, "text": "And just, I remember lying on the floor, some wooden floor in a hunter's cabin in the middle of Northern Kamchatka, just being like, what am I doing here?"}, {"time": 8726, "text": "This is, I'm just so grateful for like the experiences I was having, what I was seeing and realizing and learning."}, {"time": 8732, "text": "It was just, I was so grateful, even though I was lying on this hard, uncomfortable floor, it's just like, this is so amazing."}, {"time": 8737, "text": "And that, I don't think I'll ever have another travel as meaningful and life changing as that particular trip to Kamchatka was."}, {"time": 8746, "text": "Though I'm still striving after it."}, {"time": 8747, "text": "You never replicate that first high, but you always try."}, {"time": 8751, "text": "So I just think that seeing something different is kind of the game."}, {"time": 8756, "text": "And there wasn't really a plan."}, {"time": 8757, "text": "Cause I got a chance to talk to the CEO of Qualcomm recently and his advice is, always have a plan."}, {"time": 8767, "text": "And it sounds like you're saying don't have a plan."}, {"time": 8773, "text": "Don't need to have a plan."}, {"time": 8776, "text": "Just listen to your gut, your passion and follow that and see where that takes you."}, {"time": 8781, "text": "Cause it's telling you something."}, {"time": 8783, "text": "Yeah, I think, I guess the plan could be specific or it could be as general as I just wanna go far away and see something very different, that's my plan."}, {"time": 8792, "text": "And I did just one line."}, {"time": 8793, "text": "Yeah, just followed my nose from one thing to the next, just being interested, following my passion."}, {"time": 8798, "text": "And again, very fortunate I could do that."}, {"time": 8801, "text": "Are there places in the world you're kind of thinking about that your life might take you at some point to be a doctor there for a time, to explore for a time that you haven't yet?"}, {"time": 8818, "text": "I have some colleagues who do kind of global health work in various countries in Africa and Central and South America."}, {"time": 8825, "text": "I would really love to go to some of those places, not just for a short trip, but hopefully for an extended period of time with sort of the healthcare being the ticket in, but then maybe even bringing my children or just, I guess at this point, some of the travel I dream about is sort of replicating what I did and showing it to my kids in a way."}, {"time": 8847, "text": "But there's still a lot I haven't seen and would love to see as well."}, {"time": 8850, "text": "But I think those opportunities sort of lend themselves well as a doctor with kind of the ability to go there and sort of help patients, but also teach medical students and residents."}, {"time": 8862, "text": "Teaching is actually a huge part of being a doctor that's underappreciated, but that's actually part of the fun of being a doctor is that you're also a teacher."}, {"time": 8870, "text": "Of course, the word doctor means teacher, but it's come to mean something else."}, {"time": 8875, "text": "But in some of my jobs, I'm working alongside medical students and residents and I'm giving them my knowledge, my wisdom, sharing with them stories."}, {"time": 8884, "text": "And so that's a very satisfying part of the job."}, {"time": 8888, "text": "If we could take a brief step into a dark place together for a time, is there, what is a dark place you've gone in your mind in your life?"}, {"time": 8902, "text": "What would be the darkest place you ever gone for a time, for a moment?"}, {"time": 8912, "text": "And how did you survive?"}, {"time": 8914, "text": "How did you overcome it?"}, {"time": 8919, "text": "I would say I haven't had as dark moments as many of the people who I care for in the emergency room."}, {"time": 8929, "text": "I'm fortunate in that way."}, {"time": 8931, "text": "I've had a pretty enjoyable, satisfying life."}, {"time": 8936, "text": "I think everybody has dark moments though, including me."}, {"time": 8940, "text": "One of the most shocking things I feel like becoming an adult, my two big realizations have been, one, no one knows what they're doing."}, {"time": 8948, "text": "And two, suicide is incredibly common, like in all humans and all societies."}, {"time": 8954, "text": "That I just find shocking."}, {"time": 8956, "text": "I mean, I've never seriously contemplated myself, but I wouldn't say it hasn't crossed my mind during some more stressful times of life."}, {"time": 8964, "text": "I think it crosses everyone's mind."}, {"time": 8967, "text": "And sort of as a kid, I found that I never would have guessed how common suicide is."}, {"time": 8972, "text": "It's an important question to sort of the Camus question, like why live?"}, {"time": 8982, "text": "Because like life, especially when you're struggling, especially when life is shit, like why am I doing any of this?"}, {"time": 8991, "text": "And then on top of that, chemistry of your brain, it could be as simple as diet and nutrition and aforementioned exercise and things like this that affect the chemistry such that you're more predisposed to go to the places of asking the question why, and maybe struggling to find a good answer."}, {"time": 9014, "text": "Because it's actually a question with no good answer, except something in your chemistry says, well, I kind of like it."}, {"time": 9023, "text": "But there's no good intellectual answer."}, {"time": 9026, "text": "And especially if day to day, it's pain."}, {"time": 9029, "text": "You get to see these stories of Robin Williams, these people that are on top of the world from an external perspective, but from an internal perspective, it's struggle."}, {"time": 9042, "text": "Every day is pain, feels hopeless, and yeah, that's a question we all have to struggle with or learn how to ignore."}, {"time": 9053, "text": "Maybe because if you ask the question too much, you're not going to find a good answer."}, {"time": 9059, "text": "That's a choice you make."}, {"time": 9060, "text": "I personally think you should ask that question a lot."}, {"time": 9065, "text": "But maybe because I have the luxury of the chemistry I have where I'm not in danger of seriously contemplating suicide."}, {"time": 9073, "text": "But why live is an important question to answer constantly and struggle to answer that constantly."}, {"time": 9081, "text": "But people, I've been extremely fortunate to meet people over the past couple of years that are really struggling."}, {"time": 9091, "text": "And you have probably met people who are really struggling, like orders of magnitude more people who are really struggling."}, {"time": 9105, "text": "Some of it is psychological, a lot of it is biological."}, {"time": 9109, "text": "And man, life is a motherfucker."}, {"time": 9113, "text": "It's pretty tough."}, {"time": 9115, "text": "I do think also past trauma plays a big role there like we talked about, war wounds and PTSD."}, {"time": 9123, "text": "A lot of people grew up with just horrific childhoods."}, {"time": 9126, "text": "They were abused in one way or another."}, {"time": 9129, "text": "And I think a lot of people who have not, I'm not saying a majority, but a lot of people, for instance, who I see in the ER coming in for threatening suicide or actually trying and failing and being brought to the ER, a lot of them just have really traumatic experiences, saw their parent commit suicide, were abused."}, {"time": 9150, "text": "These leave scars in the human brain and mind."}, {"time": 9152, "text": "And a lot of their subsequent lives of whether it's substance abuse, alcoholism, et cetera, is almost trying to escape from their own memories."}, {"time": 9160, "text": "And it's sort of such this overwhelming battle sometimes."}, {"time": 9165, "text": "Like sometimes people get ruined, it seems, and just can't be fixed, you know what I mean?"}, {"time": 9171, "text": "Yes, you can improve diet and health and your life choices and seek out your passion and exercise."}, {"time": 9177, "text": "And those definitely will help."}, {"time": 9179, "text": "But sometimes just like, you know, you bear the scars of the past and there's no getting rid of them."}, {"time": 9184, "text": "Yeah, I think it's possible to live with them."}, {"time": 9188, "text": "To the struggle."}, {"time": 9190, "text": "I would never say give up, you know."}, {"time": 9192, "text": "Keep fighting."}, {"time": 9193, "text": "It is a constant, it can be a constant battle for some people."}, {"time": 9196, "text": "I know it can be, and I've talked to many of those folks, I know it can feel hopeless, but keep up the good fight."}, {"time": 9204, "text": "Hopelessness."}, {"time": 9204, "text": "Keep up the good fight."}, {"time": 9206, "text": "Hopelessness is kind of one of the big suicide risk factors that you sort of ask about as a doctor, you know, do you feel hopeless?"}, {"time": 9212, "text": "And that sort of can be a harbinger."}, {"time": 9217, "text": "I have quite a few dark moments."}, {"time": 9219, "text": "So if you're listening and you're struggling, we're in this together, brother and sister, keep up the good fight."}, {"time": 9231, "text": "Life is a motherfucker, as you said."}, {"time": 9232, "text": "It's really harder."}, {"time": 9235, "text": "I think as a kid, you know, in a joy free childhood, you don't realize, like, obviously there's a ton you don't realize about life, but then when you get to be an adult, you realize just how complex and hard it is."}, {"time": 9247, "text": "Is it this hard for adult animals?"}, {"time": 9253, "text": "So I haven't seen the honesty of biology before you."}, {"time": 9262, "text": "Do you contemplate death?"}, {"time": 9265, "text": "Are you afraid of your own death?"}, {"time": 9269, "text": "I've definitely thought about it, especially maybe while doing certain risky things, ice climbing and others where every time I looked down, I thought about my own death."}, {"time": 9279, "text": "But I think, you know, I think having kids changes the equation for sure, should change the equation perhaps."}, {"time": 9288, "text": "So I think a lot of, now when I think about what will happen when I die, you know, there's a lot of worrying about what will happen to the people I care for."}, {"time": 9298, "text": "You know, you think about things like insurance policy, life insurance and, you know, disability insurance, that's not related to death, but more just injuries."}, {"time": 9307, "text": "And that's part of the weight, I guess, that you feel as an adult, that I think grows rapidly when you have kids."}, {"time": 9316, "text": "Though not only, you know, there's other people you can care for, your own parents and loved ones."}, {"time": 9320, "text": "Like a lot of people depend on individuals."}, {"time": 9323, "text": "And so you think about what will happen to the other people when you die."}, {"time": 9327, "text": "But also, to push back, that weight might be something you've convinced yourself to think about."}, {"time": 9335, "text": "It's an important weight to think about."}, {"time": 9337, "text": "But you focus on that weight to escape the other weight, which is, at one point, this consciousness just comes to an end."}, {"time": 9351, "text": "And it's hard to make sense of that."}, {"time": 9354, "text": "We kind of delude ourselves in thinking, okay, it just, yeah, it ends."}, {"time": 9358, "text": "That's the natural way of things and so on."}, {"time": 9359, "text": "That makes sense, so we're good."}, {"time": 9361, "text": "Okay, that's the way of life."}, {"time": 9363, "text": "But I don't think it's cognitively easy to just realize how terrifying that is."}, {"time": 9372, "text": "We love life so much that the end of it, it just, it's something that makes no sense."}, {"time": 9384, "text": "And if you linger on that thought, I think it's a painful, I would say even terrifying thought."}, {"time": 9391, "text": "Not scared of like, in a way that's almost like philosophically terrifying."}, {"time": 9396, "text": "Like, it just reminds you, maybe humbles you that you don't know anything about anything."}, {"time": 9404, "text": "But one of the things we do as humans really well is we, especially with kids, you realize, okay, we start caring for others in the community, in the family, and so on, and that distracts us."}, {"time": 9416, "text": "So then we can at least focus on other people's problems and not deal with our own."}, {"time": 9422, "text": "When I was a medical student, I was particularly fascinated with kind of what actually happens as people die, like in the last minute, seconds of life."}, {"time": 9430, "text": "It's sort of surprising sometimes, like what actually kills people."}, {"time": 9433, "text": "You know, like you can get, let's say, a bad head injury and you know, what kills you."}, {"time": 9438, "text": "Sometimes it's just your consciousness decreases and you become kind of comatose, you aspirate, your oxygen plummets, and you get cardiac arrest."}, {"time": 9448, "text": "You know, that kind of sequence of events."}, {"time": 9451, "text": "Or, you know, a heroin overdose, let's say you stop breathing."}, {"time": 9456, "text": "Similarly, your oxygen goes down, then you get a cardiac arrest."}, {"time": 9458, "text": "So I was really fascinated with what actually happens, what makes people die."}, {"time": 9463, "text": "And it was sort of a morbid fascination, obviously, like most of med school is."}, {"time": 9467, "text": "And I had many instances where I've had patients pass and as a medical student, I was sort of learning what's actually happening, watching it happen and not always being able to prevent it."}, {"time": 9479, "text": "It was sort of a scientific exploration."}, {"time": 9483, "text": "Then the patient's family comes in and are just devastated."}, {"time": 9486, "text": "And then it's like, rips you out of this scientific perspective and you just realize how horrible death is, but the person's fine."}, {"time": 9494, "text": "You know, it's the family, I guess."}, {"time": 9495, "text": "And that's why it's always, I guess that pointed out just how what people leave behind is often kind of the horribleness of death."}, {"time": 9502, "text": "Like just becoming unconscious and staying that way doesn't seem, I guess to me personally, so bad."}, {"time": 9508, "text": "Sort of like going to sleep, not waking up, not counting the pain and stuff that precedes it."}, {"time": 9513, "text": "So the actual pain, the actual suffering is often felt by the people who love the person who died."}, {"time": 9519, "text": "So both financial pain, psychological pain, for years missing them, all those kinds of things."}, {"time": 9526, "text": "Right, never forgetting the anniversary of their death."}, {"time": 9530, "text": "You know, just having flashbacks or something reminding you."}, {"time": 9534, "text": "That sort of brought home to me sort of what death means."}, {"time": 9537, "text": "And it was more about what people leave behind than what happens to them specifically."}, {"time": 9541, "text": "See, I like those concerns because I feel like I can do a lot about those."}, {"time": 9547, "text": "Those make sense to me."}, {"time": 9549, "text": "Then just be, if you're a father, just be a good father."}, {"time": 9552, "text": "If you're sort of, you mentioned sort of insurance."}, {"time": 9555, "text": "Yeah, there's like financial stuff to take care of."}, {"time": 9558, "text": "What I don't know what to do with is the philosophical existential crisis of the fact that this fricking thing ends."}]}]