[{"title": "Robin Hanson: Alien Civilizations, UFOs, and the Future of Humanity | Lex Fridman Podcast #292", "id": "KBZP4rLk6bk", "quotes": [{"time": 247, "text": "My coauthors and I put together a paper with a particular mathematical model."}, {"time": 247, "text": "And so we use the term grabby aliens to describe that more particular model."}, {"time": 254, "text": "And the idea is it's a more particular model of the general concept of loud."}, {"time": 258, "text": "So loud would just be the general idea that they would be really obvious."}, {"time": 263, "text": "So grabby is the technical term, is it in the title of the paper?"}, {"time": 267, "text": "It's in the body."}, {"time": 267, "text": "The title is actually about loud and quiet."}, {"time": 273, "text": "So the idea is you want to distinguish your particular model of things from the general category of things everybody else might talk about."}, {"time": 278, "text": "So that's how we distinguish."}, {"time": 281, "text": "The paper title is If Loud Aliens Explain Human Earliness, Quiet Aliens Are Also Rare."}, {"time": 288, "text": "If life on earth, God, this is such a good abstract."}, {"time": 288, "text": "If life on earth had to achieve N hard steps to reach humanity's level, then the chance of this event rose as time to the nth power."}, {"time": 300, "text": "So we'll talk about power, we'll talk about linear increase."}, {"time": 300, "text": "So what is the technical definition of grabby?"}, {"time": 306, "text": "How do you envision grabbiness?"}, {"time": 306, "text": "And why are in contrast with humans, why aren't humans grabby?"}, {"time": 317, "text": "So like, where's that line?"}, {"time": 317, "text": "Is it well definable?"}, {"time": 317, "text": "What is grabbing what is not grabby?"}, {"time": 323, "text": "We have a mathematical model of the distribution of advanced civilizations, i.e."}, {"time": 323, "text": "aliens in space and time."}, {"time": 329, "text": "That model has three parameters."}, {"time": 329, "text": "And we can set each one of those parameters from data."}, {"time": 337, "text": "And therefore, we claim this is actually what we know about where they are in space time."}, {"time": 342, "text": "So the key idea is they appear at some point in space time."}, {"time": 342, "text": "And then after some short delay, they start expanding."}, {"time": 348, "text": "And they expand at some speed."}, {"time": 348, "text": "And the speed is one of those parameters."}, {"time": 354, "text": "That's one of the three."}, {"time": 354, "text": "And the other two parameters are about how they appear in time."}, {"time": 359, "text": "That is they appear at random places."}, {"time": 359, "text": "And they appear in time according to a power law."}, {"time": 364, "text": "And that power law has two parameters."}, {"time": 364, "text": "And we can fit each of those parameters to data."}, {"time": 364, "text": "And so then we can say, now we know, we know the distribution of advanced civilizations in space and time."}, {"time": 369, "text": "So we are right now a new civilization, and we have not yet started to expand."}, {"time": 376, "text": "But plausibly, we would start to do that within say, 10 million years of the current moment."}, {"time": 381, "text": "That's plenty of time."}, {"time": 387, "text": "And 10 million years is a really short duration in the history of the universe."}, {"time": 387, "text": "So we are at the moment, a sort of random sample of the kind of times at which an advanced civilization might appear."}, {"time": 397, "text": "Because we may or may not become grabby."}, {"time": 397, "text": "But if we do, we'll do it soon."}, {"time": 397, "text": "And so our current date is a sample."}, {"time": 402, "text": "And that gives us one of the other parameters."}, {"time": 402, "text": "The second parameter is the constant in front of the power law."}, {"time": 407, "text": "And that's arrived from our current date."}, {"time": 411, "text": "So power law, what is the N in the power law?"}, {"time": 418, "text": "That's the more complicated thing to explain."}, {"time": 420, "text": "Advanced life appeared by going through a sequence of hard steps."}, {"time": 420, "text": "So starting with very simple life, and here we are at the end of this process at pretty advanced life."}, {"time": 428, "text": "And so we had to go through some intermediate steps such as sexual selection, photosynthesis, multicellular animals."}, {"time": 439, "text": "And the idea is that each of those steps was hard."}, {"time": 439, "text": "Evolution just took a long time searching in a big space of possibilities to find each of those steps."}, {"time": 446, "text": "And the challenge was to achieve all of those steps by a deadline of when the planets would no longer host simple life."}, {"time": 452, "text": "And so Earth has been really lucky compared to all the other billions of planets out there, and that we managed to achieve all these steps in the short time of the five billion years that Earth can support simple life."}, {"time": 471, "text": "So not all steps, but a lot of them, because we don't know how many steps there are before you start the expansion."}, {"time": 476, "text": "So these are all the steps from the birth of life to the initiation of major expansion."}, {"time": 482, "text": "So we're pretty sure that it would happen really soon so that it couldn't be the same sort of a hard step as the last one."}, {"time": 487, "text": "So in terms of taking a long time."}, {"time": 492, "text": "So when we look at the history of Earth, we look at the durations of the major things that have happened."}, {"time": 498, "text": "That suggests that there's roughly say six hard steps that happened, say between three and 12, and that we have just achieved the last one that would take a long time."}, {"time": 514, "text": "But whatever it is, we've just achieved the last one."}, {"time": 518, "text": "We're talking about humans or aliens here."}, {"time": 518, "text": "So let's talk about some of these steps."}, {"time": 518, "text": "So Earth is really special in some way."}, {"time": 522, "text": "We don't exactly know the level of specialness."}, {"time": 522, "text": "We don't really know which steps were the hardest or not because we just have a sample of one."}, {"time": 527, "text": "But you're saying that there's three to 12 steps that we have to go through to get to where we are that are hard steps, hard to find by something that took a long time and is unlikely."}, {"time": 538, "text": "There's a lot of ways to fail."}, {"time": 547, "text": "There's a lot more ways to fail than to succeed."}, {"time": 547, "text": "The first step would be sort of the very simplest form of life of any sort."}, {"time": 553, "text": "And then we don't know whether that first sort is the first sort that we see in the historical record or not."}, {"time": 560, "text": "But then some other steps are, say, the development of photosynthesis, the development of sexual reproduction."}, {"time": 564, "text": "There's the development of eukaryote cells, which are certain kind of complicated cells that seems to have only appeared once."}, {"time": 575, "text": "And then there's multicellularity, that is multiple cells coming together to large organisms like us."}, {"time": 580, "text": "And in this statistical model of trying to fit all these steps into a finite window, the model actually predicts that these steps could be of varying difficulties."}, {"time": 588, "text": "That is, they could each take different amounts of time on average."}, {"time": 593, "text": "But if you're lucky enough that they all appear in a very short time, then the durations between them will be roughly equal."}, {"time": 598, "text": "And the time remaining leftover in the rest of the window will also be the same length."}, {"time": 604, "text": "So we at the moment have roughly a billion years left on Earth until simple life like us would no longer be possible."}, {"time": 616, "text": "Life appeared roughly 400 million years after the very first time when life was possible at the very beginning."}, {"time": 621, "text": "So those two numbers right there give you the rough estimate of six hard steps."}, {"time": 626, "text": "Just to build up an intuition here."}, {"time": 626, "text": "So we're trying to create a simple mathematical model of how life emerges and expands in the universe."}, {"time": 631, "text": "And there's a section in this paper, how many hard steps?"}, {"time": 639, "text": "The two most plausibly diagnostic Earth durations seem to be the one remaining after now before Earth becomes uninhabitable for complex life."}, {"time": 645, "text": "So you estimate how long Earth lasts, how many hard steps."}, {"time": 650, "text": "There's windows for doing different hard steps, and you can sort of like cueing theory, mathematically estimate of like the solution or the passing of the hard steps or the taking of the hard steps."}, {"time": 669, "text": "Sort of like coldly mathematical look."}, {"time": 675, "text": "If life, pre expansionary life, requires n number of steps, what is the probability of taking those steps on an Earth that lasts a billion years or two billion years or five billion years or 10 billion years?"}, {"time": 690, "text": "And you say solving for E using the observed durations of 1.1 and 0.4 then gives E values of 3.9 and 12.5 range 5.7 to 26 suggesting a middle estimate of at least six."}, {"time": 706, "text": "That's where you said six hard steps."}, {"time": 706, "text": "Just to get to where we are."}, {"time": 706, "text": "We started at the bottom."}, {"time": 714, "text": "Now we're here."}, {"time": 714, "text": "That took six steps on average."}, {"time": 714, "text": "The key point is on average, these things on any one random planet would take trillions or trillions of years, just a really long time."}, {"time": 727, "text": "And so we're really lucky that they all happened really fast in a short time before our window closed."}, {"time": 732, "text": "And the chance of that happening in that short window goes as that time period to the power of the number of steps."}, {"time": 739, "text": "And so that was where the power we talked about before came from."}, {"time": 739, "text": "And so that means in the history of the universe, we should overall roughly expect advanced life to appear as a power law in time."}, {"time": 750, "text": "So that very early on, there was very little chance of anything appearing."}, {"time": 756, "text": "And then later on as things appear, other things are appearing somewhat closer to them in time because they're all going as this power law."}, {"time": 760, "text": "What is the power law?"}, {"time": 760, "text": "Can we, for people who are not math inclined, can you describe what a power law is?"}, {"time": 766, "text": "So say the function X is linear and X squared is quadratic."}, {"time": 772, "text": "So it's the power of two."}, {"time": 772, "text": "If we make X to the three, that's cubic or the power of three."}, {"time": 779, "text": "And so X to the sixth is the power of six."}, {"time": 779, "text": "And so we'd say life appears in the universe on a planet like Earth in that proportion to the time that it's been ready for life to appear."}, {"time": 792, "text": "And that over the universe in general, it'll appear at roughly a power law like that."}, {"time": 802, "text": "What is the X, what is N?"}, {"time": 802, "text": "Is it the number of hard steps?"}, {"time": 807, "text": "Yes, the number of hard steps."}, {"time": 810, "text": "It's like if you're gambling and you're doubling up every time, this is the probability you just keep winning."}, {"time": 815, "text": "So it gets very unlikely very quickly."}, {"time": 815, "text": "And so we're the result of this unlikely chain of successes."}, {"time": 825, "text": "It's actually a lot like cancer."}, {"time": 825, "text": "So the dominant model of cancer in an organism like each of us is that we have all these cells and in order to become cancerous, a single cell has to go through a number of mutations and these very unlikely mutations."}, {"time": 840, "text": "And so any one cell is very unlikely to have any, have all these mutations happen by the time your lifespan's over."}, {"time": 845, "text": "But we have enough cells in our body that the chance of any one cell producing cancer by the end of your life is actually pretty high, more like 40%."}, {"time": 855, "text": "And so the chance of cancer appearing in your lifetime also goes as a power law, this power of the number of mutations that's required for any one cell in your body to become cancerous."}, {"time": 864, "text": "The longer you live, the likely you are to have cancer cells."}, {"time": 868, "text": "And the power is also roughly six."}, {"time": 868, "text": "That is the chance of you getting cancer is roughly the power of six of the time you've been since you were born."}, {"time": 877, "text": "It is perhaps not lost on people that you're comparing power laws of the survival or the arrival of the human species to cancerous cells."}, {"time": 890, "text": "The same mathematical model, but of course, we might have a different value assumption about the two outcomes."}, {"time": 895, "text": "But of course, from the point of view of cancer, it's more similar."}, {"time": 900, "text": "For the point of view of cancer, it's a win win."}, {"time": 900, "text": "We both get to thrive, I suppose."}, {"time": 909, "text": "It is interesting to take the point of view of all kinds of life forms on earth, of viruses, of bacteria."}, {"time": 913, "text": "They have a very different view."}, {"time": 918, "text": "It's like the Instagram channel, Nature is Metal."}, {"time": 922, "text": "The ethic under which nature operates doesn't often coincide, correlate with human morals."}, {"time": 929, "text": "It seems cold and machine like in the selection process that it performs."}, {"time": 938, "text": "I am an analyst, I'm a scholar, an intellectual, and I feel I should carefully distinguish predicting what's likely to happen and then evaluating or judging what I think would be better to happen."}, {"time": 950, "text": "And it's a little dangerous to mix those up too closely because then we can then we can have wishful thinking."}, {"time": 956, "text": "And so I try typically to just analyze what seems likely to happen regardless of whether I like it or that we do anything about it."}, {"time": 961, "text": "And then once you see a rough picture of what's likely to happen if we do nothing, then we can ask, well, what might we prefer?"}, {"time": 972, "text": "And ask, where could the levers be to move it at least a little toward what we might prefer?"}, {"time": 979, "text": "But often doing that just analysis of what's likely to happen if we do nothing offends many people."}, {"time": 984, "text": "They find that dehumanizing or cold or metal, as you say, to just say, well, this is what's likely to happen and it's not your favorite, sorry, but maybe we can do something, but maybe we can't do that much."}, {"time": 999, "text": "This is very interesting that the cold analysis, whether it's geopolitics, whether it's medicine, whether it's economics, sometimes misses some very specific aspect of human condition."}, {"time": 1019, "text": "Like for example, when you look at a doctor and the act of a doctor helping a single patient, if you do the analysis of that doctor's time and cost of the medicine or the surgery or the transportation of the patient, this is the Paul Farmer question, you know, is it worth spending ten, twenty, thirty thousand dollars on this one patient?"}, {"time": 1040, "text": "When you look at all the people that are suffering in the world, that money could be spent so much better."}, {"time": 1046, "text": "And yet there's something about human nature that wants to help the person in front of you, and that is actually the right thing to do, despite the analysis."}, {"time": 1059, "text": "And sometimes when you do the analysis, there's something about the human mind that allows you to not take that leap, that irrational leap to act in this way, that the analysis explains it away."}, {"time": 1074, "text": "Well it's like, for example, the U.S. government, you know, the DOT, Department of Transportation, puts a value of I think like nine million dollars on a human life."}, {"time": 1089, "text": "And the moment you put that number on a human life, you can start thinking, well okay, I can start making decisions about this or that, and with a sort of cold economic perspective, and then you might lose, you might deviate from a deeper truth of what it means to be human somehow."}, {"time": 1100, "text": "You have to dance, because then if you put too much weight on the anecdotal evidence on these kinds of human emotions, then you're going to lose, you could also probably more likely deviate from truth."}, {"time": 1122, "text": "But there's something about that cold analysis."}, {"time": 1122, "text": "Like I've been listening to a lot of people coldly analyze wars."}, {"time": 1127, "text": "War in Yemen, war in Syria, Israel, Palestine, war in Ukraine, and there's something lost when you do a cold analysis of why something happened."}, {"time": 1136, "text": "When you talk about energy, talking about sort of conflict, competition over resources, when you talk about geopolitics, sort of models of geopolitics, and why a certain war happened, you lose something about the suffering that happens."}, {"time": 1156, "text": "It's an interesting thing, because you're both, you're exceptionally good at models in all domains, literally, but also there's a humanity to you."}, {"time": 1162, "text": "So it's an interesting dance."}, {"time": 1171, "text": "I don't know if you can comment on that dance."}, {"time": 1171, "text": "It's definitely true, as you say, that for many people, if you are accurate in your judgment of, say, for a medical patient, what's the chance that this treatment might help?"}, {"time": 1183, "text": "And what's the cost?"}, {"time": 1183, "text": "And compare those to each other, and you might say, this looks like a lot of cost for a small medical gain."}, {"time": 1198, "text": "And at that point, knowing that fact, that might take the air out of your sails."}, {"time": 1198, "text": "You might not be willing to do the thing that maybe you feel is right anyway, which is still to pay for it."}, {"time": 1213, "text": "And then somebody knowing that might want to keep that news from you and not tell you about the low chance of success or the high cost in order to save you this tension, this awkward moment where you might fail to do what they and you think is right."}, {"time": 1230, "text": "But I think the higher calling, the higher standard to hold you to, which many people can be held to, is to say, I will look at things accurately, I will know the truth, and then I will also do the right thing with it."}, {"time": 1241, "text": "I will be at peace with my judgment about what the right thing is in terms of the truth."}, {"time": 1247, "text": "I don't need to be lied to in order to figure out what the right thing to do is."}, {"time": 1252, "text": "And I think if you do think you need to be lied to in order to figure out what the right thing to do is, you're at a great disadvantage because then people will be lying to, you will be lying to yourself, and you won't be as effective at achieving whatever good you were trying to achieve."}, {"time": 1270, "text": "But getting the data, getting the facts is step one, not the final step."}, {"time": 1275, "text": "So I would say having a good model, getting the good data is step one, and it's a burden."}, {"time": 1284, "text": "Because you can't just use that data to arrive at sort of the easy convenient thing."}, {"time": 1284, "text": "You have to really deeply think about what is the right thing."}, {"time": 1293, "text": "So the dark aspect of data, of models, is you can use it to excuse away actions that aren't ethical."}, {"time": 1302, "text": "You can use data to basically excuse away anything."}, {"time": 1310, "text": "But not looking at data lets you excuse yourself to pretend and think that you're doing good when you're not."}, {"time": 1317, "text": "But it is a burden."}, {"time": 1317, "text": "It doesn't excuse you from still being human and deeply thinking about what is right."}, {"time": 1323, "text": "That very kind of gray area, that very subjective area, that's part of the human condition."}, {"time": 1329, "text": "But let us return for a time to aliens."}, {"time": 1336, "text": "So you started to define sort of the model, the parameters of grabbiness."}, {"time": 1346, "text": "As we approach grabbiness."}, {"time": 1346, "text": "So again, there was three parameters."}, {"time": 1346, "text": "There's the speed at which they expand, there's the rate at which they appear in time, and that rate has a constant and a power."}, {"time": 1358, "text": "So we've talked about the history of life on Earth suggests that power is around 6, but maybe 3 to 12."}, {"time": 1362, "text": "We can say that constant comes from our current date, sort of sets the overall rate."}, {"time": 1368, "text": "And the speed, which is the last parameter, comes from the fact that when we look in the sky, we don't see them."}, {"time": 1374, "text": "So the model predicts very strongly that if they were expanding slowly, say 1% of the speed of light, our sky would be full of vast spheres that were full of activity."}, {"time": 1385, "text": "That is, at a random time when a civilization is first appearing, if it looks out into its sky, it would see many other grabby alien civilizations in the sky, and they would be much bigger than the full moon."}, {"time": 1395, "text": "There'd be huge spheres in the sky, and they would be visibly different."}, {"time": 1400, "text": "Can we pause for a second?"}, {"time": 1400, "text": "There's a bunch of hard steps that Earth had to pass to arrive at this place we are currently, which we're starting to launch rockets onto space."}, {"time": 1413, "text": "We're kind of starting to expand a bit, very slowly."}, {"time": 1413, "text": "But this is like the birth."}, {"time": 1413, "text": "If you look at the entirety of the history of Earth, we're now at this precipice of like expansion."}, {"time": 1426, "text": "We could, we might not choose to, but if we do, we will do it in the next 10 million years."}, {"time": 1431, "text": "10 million."}, {"time": 1435, "text": "10 million is a short time on the cosmological scale."}, {"time": 1435, "text": "So that is, it might be only a thousand, but the point is if it's, even if it's up to 10 million, that hardly makes any difference to the model."}, {"time": 1443, "text": "So I might as well give you 10 million."}, {"time": 1443, "text": "This, this makes me feel, I was, I was so stressed about planning what I'm going to do today."}, {"time": 1448, "text": "And now you got plenty of time, plenty of time."}, {"time": 1453, "text": "Uh, just need to be generating some offspring quickly here."}, {"time": 1453, "text": "Um, so, and there's this moment this 10 million, uh, year gap, uh, or window when we start expanding and you're saying, okay, so this is an interesting moment where there's a bunch of other alien civilizations that might at some history of the universe arrived at this moment we're here, they passed all the hard steps."}, {"time": 1479, "text": "There's a, there's a model for how likely it is that that happens."}, {"time": 1479, "text": "And then they start expanding and you think of an expansion is almost like a sphere."}, {"time": 1485, "text": "That's when you say speed, we're talking about the speed of the radius growth."}, {"time": 1490, "text": "Like the surface, how fast the surface."}, {"time": 1495, "text": "And so you're saying that there is some speed for that expansion, average speed, and then we can play with that parameter."}, {"time": 1501, "text": "And if that speed is super slow, then maybe that explains why we haven't seen anything."}, {"time": 1508, "text": "If it's super fast, the slow would create the puzzle."}, {"time": 1514, "text": "It's slow predicts, we would see them, but we don't see them as a way to explain that is that they're fast."}, {"time": 1518, "text": "So the idea is if they're moving really fast, then we don't see them until they're almost here."}, {"time": 1523, "text": "Okay, this is counterintuitive."}, {"time": 1523, "text": "All right, hold on a second."}, {"time": 1523, "text": "So I think this works best when I say a bunch of dumb things."}, {"time": 1528, "text": "And then you elucidate the full complexity and the beauty of the dumbness."}, {"time": 1537, "text": "So there's these spheres out there in the universe that are made visible because they're sort of using a lot of energy."}, {"time": 1544, "text": "So they're generating a lot of light stuff."}, {"time": 1549, "text": "They're changing things."}, {"time": 1549, "text": "And change would be visible a long way off."}, {"time": 1555, "text": "They would take apart stars, rearrange them, restructure galaxies."}, {"time": 1555, "text": "They would do all kinds of big, huge stuff."}, {"time": 1560, "text": "If they're expanding slowly, we would see a lot of them because the universe is old, is old enough to where we would see them."}, {"time": 1568, "text": "That is we're assuming we're just typical, you know, maybe at the 50th percentile of them."}, {"time": 1573, "text": "So like half of them have appeared so far."}, {"time": 1577, "text": "The other half will still appear later."}, {"time": 1577, "text": "And the math of our best estimate is that they appear roughly once per million galaxies."}, {"time": 1586, "text": "And we would meet them in roughly a billion years if we expanded out to meet them."}, {"time": 1593, "text": "So we're looking at a grabby aliens model 3D sim."}, {"time": 1597, "text": "That's the actual name of the video."}, {"time": 1597, "text": "By the time we get to 13.8 billion years, the fun begins."}, {"time": 1608, "text": "So this is, we're watching a three dimensional sphere rotating."}, {"time": 1608, "text": "I presume that's the universe."}, {"time": 1616, "text": "And then grabby aliens are expanding and filling that universe with all kinds of fun."}, {"time": 1624, "text": "Pretty soon it's all full."}, {"time": 1624, "text": "It's full."}, {"time": 1624, "text": "So that's how the grabby aliens come in contact."}, {"time": 1624, "text": "First of all, with other aliens and then with us humans."}, {"time": 1631, "text": "The following is a simulation of the grabby aliens model of alien civilizations."}, {"time": 1638, "text": "Civilizations are born that expand outwards at constant speed."}, {"time": 1644, "text": "A spherical region of space is shown."}, {"time": 1644, "text": "By the time we get to 13.8 billion years, this sphere will be about 3000 times as wide as the distance from the Milky Way to Andromeda."}, {"time": 1658, "text": "So why don't we see, we're one little tiny, tiny, tiny, tiny dot in that giant, giant sphere."}, {"time": 1668, "text": "Why don't we see any of the grabby aliens?"}, {"time": 1673, "text": "It depends on how fast they expand."}, {"time": 1673, "text": "So you could see that if they expanded at the speed of light, you wouldn't see them until they were here."}, {"time": 1678, "text": "So like out there, if somebody is destroying the universe with a vacuum decay, there's this, there's this doomsday scenario where somebody somewhere could change the vacuum of the universe and that would expand at the speed of light and basically destroy everything it hit."}, {"time": 1694, "text": "But you'd never see that until I got here because it's expanding at the speed of light."}, {"time": 1698, "text": "If you're expanding really slow, then you see it from a long way off."}, {"time": 1701, "text": "So the fact we don't see anything in the sky tells us they're expanding fast, say over a third the speed of light."}, {"time": 1706, "text": "And that's really, really fast."}, {"time": 1706, "text": "But that's what you have to believe if we look out and you don't see anything."}, {"time": 1712, "text": "Now you might say, well, how, maybe I just don't want to believe this whole model."}, {"time": 1717, "text": "Why should I believe this whole model at all?"}, {"time": 1717, "text": "And our best evidence why you should believe this model is our early date."}, {"time": 1722, "text": "We are right now almost 14 billion years into the universe on a planet around a star that's roughly 5 billion years old."}, {"time": 1736, "text": "But the average star out there will last roughly 5 trillion years."}, {"time": 1736, "text": "That is a thousand times longer."}, {"time": 1745, "text": "And remember that power law, it says that the chance of advanced life appearing on a planet goes as the power of sixth of the time."}, {"time": 1749, "text": "So if a planet lasts a thousand times longer, then the chance of it appearing on that planet, if everything would stay empty at least, is a thousand to the sixth power or 10 to the 18."}, {"time": 1759, "text": "So enormous, overwhelming chance that if the universe would just stay sit and empty and waiting for advanced life to appear, when it would appear would be way at the end of all these planet lifetimes."}, {"time": 1771, "text": "That is the long planets near the end of the lifetime, trillions of years into the future."}, {"time": 1779, "text": "So, but we're really early compared to that."}, {"time": 1779, "text": "And our explanation is at the moment, as you saw in the video, the universe is filling up in roughly a billion years, it'll all be full."}, {"time": 1789, "text": "And at that point, it's too late for advanced life to show up."}, {"time": 1793, "text": "So you had to show up now before that deadline."}, {"time": 1799, "text": "Or linger on some of the things you said."}, {"time": 1799, "text": "So with the power law, the things we've done on earth, the model you have says that it's very unlikely, like we're lucky SOBs."}, {"time": 1803, "text": "Is that mathematically correct to say?"}, {"time": 1811, "text": "We're crazy early."}, {"time": 1811, "text": "That is when early means like in the history of the universe."}, {"time": 1818, "text": "In the history."}, {"time": 1818, "text": "So given this model, how do we make sense of that?"}, {"time": 1818, "text": "If we're super, can we just be the lucky ones?"}, {"time": 1825, "text": "Well, 10 to the 18 lucky, you know, how lucky do you feel?"}, {"time": 1830, "text": "So, you know, that's a pretty lucky, right?"}, {"time": 1830, "text": "10 to the 18 is a billion, billion."}, {"time": 1837, "text": "So then if you were just being honest and humble, that that means, what does that mean?"}, {"time": 1845, "text": "It means one of the assumptions that calculated this crazy early must be wrong."}, {"time": 1845, "text": "That's what it means."}, {"time": 1849, "text": "So the key assumption we suggest is that the universe would stay empty."}, {"time": 1849, "text": "So most life would stay empty."}, {"time": 1856, "text": "So most life would appear like a thousand times longer later than now if everything would stay empty, waiting for it to appear."}, {"time": 1864, "text": "So what is not empty?"}, {"time": 1868, "text": "So the grabby aliens are filling the universe right now."}, {"time": 1868, "text": "Roughly at the moment, they filled half of the universe and they've changed it."}, {"time": 1871, "text": "And when they fill everything, it's too late for stuff like us to appear."}, {"time": 1876, "text": "But wait, hold on a second."}, {"time": 1876, "text": "Did anyone help us get lucky?"}, {"time": 1876, "text": "If it's so difficult, what, how do like, so it's like cancer, right?"}, {"time": 1884, "text": "There's all these cells, each of which randomly does or doesn't get cancer."}, {"time": 1890, "text": "And eventually some cell gets cancer and you know, we were one of those, but hold on a second."}, {"time": 1895, "text": "But we got it early."}, {"time": 1895, "text": "We got early compared to the prediction with an assumption that's wrong."}, {"time": 1904, "text": "That's so that's how we do a lot of, you know, theoretical analysis."}, {"time": 1908, "text": "You have a model that makes a prediction that's wrong."}, {"time": 1908, "text": "Then that helps you reject that model."}, {"time": 1912, "text": "Let's try to understand exactly where the wrong is."}, {"time": 1912, "text": "So the assumption is that the universe is empty, stays empty, stays empty and waits until this advanced life appears in trillions of years."}, {"time": 1924, "text": "That is if the universe would just stay empty, if there was just, you know, nobody else out there, then when you should expect advanced life to appear, if you're the only one in the universe, when should you expect to appear?"}, {"time": 1934, "text": "You should expect to appear trillions of years in the future."}, {"time": 1938, "text": "So this is a very sort of nuanced mathematical assumption."}, {"time": 1938, "text": "I don't think we can intuit it cleanly with words."}, {"time": 1945, "text": "But if you assume that you're just wait, the universe stays empty and you're waiting for one life civilization to pop up, then it's gonna, it should happen very late, much later than now."}, {"time": 1961, "text": "And if you look at Earth, the way things happen on Earth, it happened much, much, much, much, much earlier than it was supposed to according to this model."}, {"time": 1973, "text": "If you take the initial assumption, therefore you can say, well, the initial assumption of the universe staying empty is very unlikely."}, {"time": 1978, "text": "And the other alternative theory is the universe is filling up and will fill up soon."}, {"time": 1984, "text": "And so we are typical for the origin data of things that can appear before the deadline."}, {"time": 1990, "text": "Before the deadline."}, {"time": 1990, "text": "Okay, it's filling up."}, {"time": 1990, "text": "So why don't we see anything if it's filling up?"}, {"time": 1995, "text": "Because they're expanding really fast."}, {"time": 1995, "text": "Close to the speed of light."}, {"time": 2000, "text": "So we will only see it when it's here."}, {"time": 2000, "text": "Almost here."}, {"time": 2000, "text": "What are the ways in which we might see a quickly expanding?"}, {"time": 2008, "text": "This is both exciting and terrifying."}, {"time": 2008, "text": "It is terrifying."}, {"time": 2008, "text": "It's like watching a truck, like driving at you at 100 miles an hour."}, {"time": 2014, "text": "And so we would see spheres in the sky, at least one sphere in the sky, growing very rapidly."}, {"time": 2021, "text": "And like very rapidly, right?"}, {"time": 2021, "text": "Yes, very rapidly."}, {"time": 2029, "text": "So we're not, so there's, there's, you know, different def because we were just talking about 10 million years."}, {"time": 2034, "text": "This would be, you might see it 10 million years in advance coming."}, {"time": 2040, "text": "I mean, you still might have a long warning."}, {"time": 2040, "text": "Again, the universe is 14 billion years old."}, {"time": 2045, "text": "The typical origin times of these things are spread over several billion years."}, {"time": 2045, "text": "So the chance of one originating at a, you know, very close to you in time is very low."}, {"time": 2050, "text": "So they still might take millions of years from the time you see it, from the time it gets here."}, {"time": 2056, "text": "You'll have a million years of your years to be terrified of this mass sphere coming at you."}, {"time": 2062, "text": "But coming at you very fast."}, {"time": 2062, "text": "So if they're traveling close to the speed of light, but they're coming from a long way away."}, {"time": 2067, "text": "So remember, the rate at which they appear is one per million galaxies, right?"}, {"time": 2072, "text": "So they're roughly a hundred galaxies away."}, {"time": 2078, "text": "So the Delta between the speed of light and their actual travel speed is very important, right?"}, {"time": 2085, "text": "So even if they're going at say half the speed of light, we'll have a long time then."}, {"time": 2090, "text": "But what if they're traveling exactly at a speed of light?"}, {"time": 2090, "text": "Then we see them, like then we wouldn't have much warning, but that's less likely."}, {"time": 2095, "text": "Well, we can't exclude it."}, {"time": 2100, "text": "And they could also be somehow traveling faster than the speed of light."}, {"time": 2104, "text": "But I think we can't exclude because if they could go faster than the speed of light, then they would just already be everywhere."}, {"time": 2108, "text": "So in a universe where you can travel faster than the speed of light, you can go backwards in space time."}, {"time": 2113, "text": "So any time you appeared anywhere in space time, you could just fill up everything."}, {"time": 2117, "text": "And so anybody in the future, whoever appeared, they would have been here by now."}, {"time": 2122, "text": "Can you exclude the possibility that those kinds of aliens aren't already here?"}, {"time": 2127, "text": "Well, you have, we should have a different discussion of that."}, {"time": 2127, "text": "So let's actually lead that."}, {"time": 2133, "text": "Let's leave that discussion aside just to linger and understand the grabby alien expansion, which is beautiful and fascinating."}, {"time": 2138, "text": "So there's these giant expanding spheres of alien civilizations."}, {"time": 2145, "text": "Now, when those spheres collide, mathematically, it's very likely that we're not the first collision of grabby alien civilizations, I suppose is one way to say it."}, {"time": 2167, "text": "So there's like the first time the spheres touch each other, recognize each other."}, {"time": 2172, "text": "They meet."}, {"time": 2172, "text": "They recognize each other first before they meet."}, {"time": 2179, "text": "They see each other coming."}, {"time": 2179, "text": "And then, so there's a bunch of them."}, {"time": 2183, "text": "There's a combinatorial thing where they start seeing each other coming."}, {"time": 2183, "text": "And then there's a third neighbor."}, {"time": 2187, "text": "And then there's a fourth one."}, {"time": 2187, "text": "So what does that, you think, look like?"}, {"time": 2191, "text": "What lessons from human nature, that's the only data we have, well, can you draw the story of the history of the universe here is what I would call a living cosmology."}, {"time": 2204, "text": "So what I'm excited about in part by this model is that it lets us tell a story of cosmology where there are actors who have agendas."}, {"time": 2211, "text": "So most ancient peoples, they had cosmologies, stories they told about where the universe came from and where it's going and what's happening out there."}, {"time": 2221, "text": "And their stories, they like to have agents and actors, gods or something out there doing things."}, {"time": 2224, "text": "And lately our favorite cosmology is dead, kind of boring."}, {"time": 2224, "text": "We're the only activity we know about or see and everything else just looks dead and empty."}, {"time": 2232, "text": "But this is now telling us, no, that's not quite right."}, {"time": 2237, "text": "At the moment, the universe is filling up and in a few billion years, it'll be all full."}, {"time": 2242, "text": "And from then on, the history of the universe will be the universe full of aliens."}, {"time": 2249, "text": "So that's a really good reminder, a really good way to think about cosmology is we're surrounded by a vast darkness and we don't know what's going on in that darkness until the light from whatever generate lights arrives here."}, {"time": 2262, "text": "So we kind of, yeah, we look up at the sky, okay, there's stars, oh, they're pretty, but you don't think about the giant expanding spheres of aliens because you don't see them."}, {"time": 2275, "text": "But now our date, looking at the clock, if you're clever, the clock tells you."}, {"time": 2281, "text": "So I like the analogy with the ancient Greeks."}, {"time": 2281, "text": "So you might think that an ancient Greek staring at the universe couldn't possibly tell how far away the sun was or how far away the moon is or how big the earth is."}, {"time": 2291, "text": "All you can see is just big things in the sky, you can't tell."}, {"time": 2296, "text": "But they were clever enough actually to be able to figure out the size of the earth and the distance to the moon and the sun and the size of the moon and sun."}, {"time": 2299, "text": "That is, they could figure those things out actually by being clever enough."}, {"time": 2304, "text": "And so similarly, we can actually figure out where are the aliens out there in space time by being clever about the few things we can see, one of which is our current date."}, {"time": 2312, "text": "And so now that you have this living cosmology, we can tell the story that the universe starts out empty and then at some point, things like us appear very primitive and then some of those stop being quiet and expand."}, {"time": 2323, "text": "And then for a few billion years, they expand and then they meet each other."}, {"time": 2329, "text": "And then for the next hundred billion years, they commune with each other."}, {"time": 2333, "text": "That is, the usual models of cosmology say that in roughly 150 billion years, the expansion of the universe will happen so much that all you'll have left is some galaxy clusters that are sort of disconnected from each other."}, {"time": 2346, "text": "But before then, for the next hundred billion years, they will interact."}, {"time": 2351, "text": "There will be this community of all the grabby alien civilizations and each one of them will hear about and even meet thousands of others."}, {"time": 2364, "text": "And we might hope to join them someday and become part of that community."}, {"time": 2364, "text": "That's an interesting thing to aspire to."}, {"time": 2370, "text": "Yes, interesting is an interesting word."}, {"time": 2370, "text": "Is the universe of alien civilizations defined by war as much or more than war defined human history?"}, {"time": 2387, "text": "I would say it's defined by competition and then the question is how much competition implies war."}, {"time": 2397, "text": "So up until recently, competition defined life on Earth."}, {"time": 2397, "text": "Competition between species and organisms and among humans, competitions among individuals and communities and that competition often took the form of war in the last 10,000 years."}, {"time": 2412, "text": "Many people now are hoping or even expecting to sort of suppress and end competition in human affairs."}, {"time": 2420, "text": "They regulate business competition, they prevent military competition and that's a future I think a lot of people will like to continue and strengthen."}, {"time": 2434, "text": "People will like to have something close to world government or world governance or at least a world community and they will like to suppress war and many forms of business and personal competition over the coming centuries."}, {"time": 2444, "text": "And they may like that so much that they prevent interstellar colonization which would become the end of that era."}, {"time": 2451, "text": "That is interstellar colonization would just return severe competition to human or our descendant affairs and many civilizations may prefer that and ours may prefer that."}, {"time": 2463, "text": "But if they choose to allow interstellar colonization, they will have chosen to allow competition to return with great force."}, {"time": 2468, "text": "That is, there's really not much of a way to centrally govern a rapidly expanding sphere of civilization."}, {"time": 2473, "text": "And so I think one of the most solid things we can predict about Graviolians is they have accepted competition and they have internal competition and therefore they have the potential for competition when they meet each other at the borders."}, {"time": 2492, "text": "But whether that's military competition is more of an open question."}, {"time": 2497, "text": "So military meaning physically destructive, right."}, {"time": 2506, "text": "So there's a lot to say there."}, {"time": 2506, "text": "So one idea that you kind of proposed is progress might be maximized through competition, through some kind of healthy competition, some definition of healthy."}, {"time": 2515, "text": "So like constructive not destructive competition."}, {"time": 2523, "text": "So like we would likely grab the alien civilizations would be likely defined by competition because they can expand faster because competition allows innovation and sort of the battle of ideas."}, {"time": 2539, "text": "The way I would take the logic is to say competition just happens if you can't coordinate to stop it and you probably can't coordinate to stop it in an expanding interstellar way."}, {"time": 2551, "text": "So competition is a fundamental force in the universe."}, {"time": 2557, "text": "It has been so far and it would be within an expanding Graviolian civilization."}, {"time": 2557, "text": "But we today have the chance, many people think and hope, of greatly controlling and limiting competition within our civilization for a while."}, {"time": 2570, "text": "And that's an interesting choice whether to allow competition to sort of regain its full force or whether to suppress and manage it."}, {"time": 2582, "text": "Well one of the open questions that has been raised in the past less than 100 years is whether our desire to lessen the destructive nature of competition or the destructive kind of competition will be outpaced by the destructive power of our weapons."}, {"time": 2600, "text": "Sort of if nuclear weapons and weapons of that kind become more destructive than our desire for peace then all it takes is one asshole at the party to ruin the party."}, {"time": 2625, "text": "It takes one asshole to make a delay, but not that much of a delay on the cosmological scales we're talking about."}, {"time": 2631, "text": "So even a vast nuclear war, if it happened here right now on Earth, it would not kill all humans and it certainly wouldn't kill all life."}, {"time": 2645, "text": "And so human civilization would return within 100,000 years."}, {"time": 2649, "text": "So all the history of atrocities and if you look at the Black Plague, which is not human caused atrocities or whatever."}, {"time": 2666, "text": "There are a lot of military atrocities in history, absolutely."}, {"time": 2669, "text": "In the 20th century."}, {"time": 2669, "text": "Those are, those challenge us to think about human nature, but the cosmic scale of time and space, they do not stop the human spirit, essentially."}, {"time": 2684, "text": "The humanity goes on through all the atrocities, it goes on."}, {"time": 2690, "text": "So even a nuclear war isn't enough to destroy us or to stop our potential from expanding, but we could institute a regime of global governance that limited competition, including military and business competition of sorts, and that could prevent our expansion."}, {"time": 2708, "text": "Of course, to play devil's advocate, global governance is centralized power, power corrupts, and absolute power corrupts absolutely."}, {"time": 2720, "text": "One of the aspects of competition that's been very productive is not letting any one person, any one country, any one center of power become absolutely powerful, because that's another lesson, is it seems to corrupt."}, {"time": 2743, "text": "There's something about ego in the human mind that seems to be corrupted by power, so when you say global governance, that terrifies me more than the possibility of war, because it's... LW."}, {"time": 2757, "text": "I think people will be less terrified than you are right now, and let me try to paint the picture from their point of view."}, {"time": 2761, "text": "This isn't my point of view, but I think it's going to be a widely shared point of view."}, {"time": 2767, "text": "This is two devil's advocates arguing."}, {"time": 2770, "text": "Two devils."}, {"time": 2770, "text": "So for the last half century and into the continuing future, we actually have had a strong elite global community that shares a lot of values and beliefs and has created a lot of convergence in global policy."}, {"time": 2825, "text": "This is what human mobs or communities have done for a long time, that is, humans can coordinate together on shared behavior without a center by having gossip and reputation within a community of elites."}, {"time": 2836, "text": "And that is what we have been doing and are likely to do a lot more of."}, {"time": 2865, "text": "And that's the kind of event that actually brings world elite communities together, where they come together and they push a particular policy and position that they share and that they achieve successes."}, {"time": 2879, "text": "And the same sort of passion animates global elites with respect to, say, global warming or global poverty and other sorts of things."}, {"time": 2884, "text": "And they are, in fact, making progress on those sorts of things through shared global community of elites."}, {"time": 2896, "text": "And in some sense, they are slowly walking toward global governance, slowly strengthening various world institutions of governance, but cautiously, carefully watching out for the possibility of a single power that might corrupt it."}, {"time": 2908, "text": "I think a lot of people over the coming centuries will look at that history and like it."}, {"time": 2914, "text": "And thank you for playing that devil's advocate there."}, {"time": 2921, "text": "But I think the elites too easily lose touch of the morals that the best of human nature and power corrupts."}, {"time": 2932, "text": "Sure, but their view is the one that determines what happens."}, {"time": 2939, "text": "Their view may still end up there, even if you or I might criticize it from that point of view."}, {"time": 2946, "text": "So from a perspective of minimizing human suffering, elites can use topics of the war in Ukraine and climate change and all of those things to sell an idea to the world."}, {"time": 2954, "text": "And with disregard to the amount of suffering it causes, their actual actions."}, {"time": 2965, "text": "So like you can tell all kinds of narratives."}, {"time": 2973, "text": "That's the way propaganda works."}, {"time": 2973, "text": "Hitler really sold the idea that everything Germany is doing is either it's the victim is defending itself against the cruelty of the world, and it's actually trying to bring out about a better world."}, {"time": 2985, "text": "So every power center thinks they're doing good."}, {"time": 2992, "text": "And so this is the positive of competition, of having multiple power centers."}, {"time": 3001, "text": "This kind of gathering of elites makes me very, very, very nervous."}, {"time": 3001, "text": "The dinners, the meetings and the closed rooms."}, {"time": 3011, "text": "But remember we talked about separating our cold analysis of what's likely or possible from what we prefer."}, {"time": 3019, "text": "And so this isn't exactly enough time for that."}, {"time": 3024, "text": "We might say, I would recommend we don't go this route of a strong world governance."}, {"time": 3024, "text": "And because I would say it'll preclude this possibility of becoming rabid aliens, of filling the next nearest million galaxies for the next billion years with vast amounts of activity and interest and value of life out there."}, {"time": 3043, "text": "That's the thing we would lose by deciding that we wouldn't expand, that we would stay here and keep our comfortable shared governance."}, {"time": 3055, "text": "So you wait, you think that global governance is, makes it more likely or less likely that we expand out into the universe?"}, {"time": 3070, "text": "This is the key, this is the key point."}, {"time": 3071, "text": "So screw the elites."}, {"time": 3076, "text": "We want to, wait, do we want to expand?"}, {"time": 3079, "text": "So again, I want to separate my neutral analysis from my evaluation and say, first of all, I have an analysis that tells us this is a key choice that we will face and that it's key choice other aliens have faced out there."}, {"time": 3090, "text": "And it could be that only one in 10 or one in 100 civilizations chooses to expand and the rest of them stay quiet."}, {"time": 3095, "text": "And that's how it goes out there."}, {"time": 3100, "text": "And we face that choice too."}, {"time": 3100, "text": "And it'll happen sometime in the next 10 million years, maybe the next thousand."}, {"time": 3106, "text": "But the key thing to notice from our point of view is that even though you might like our global governance, you might like the fact that we've come together, we no longer have massive wars and we no longer have destructive competition."}, {"time": 3121, "text": "And that we could continue that, the cost of continuing that would be to prevent interstellar colonization."}, {"time": 3126, "text": "That is once you allow interstellar colonization, then you've lost control of those colonies and whatever they change into, they could come back here and compete with you back here as a result of having lost control."}, {"time": 3136, "text": "And I think if people value that global governance and global community and regulation and all the things it can do enough, they would then want to prevent interstellar colonization."}, {"time": 3151, "text": "I want to have a conversation with those people."}, {"time": 3151, "text": "I believe that both for humanity, for the good of humanity, for what I believe is good in humanity and for expansion, exploration, innovation, distributing the centers of power is very beneficial."}, {"time": 3164, "text": "So this whole meeting of elites and I've been very fortunate to meet quite a large number of elites."}, {"time": 3171, "text": "They make me nervous because it's easy to lose touch of reality."}, {"time": 3179, "text": "I'm nervous about that in myself to make sure that you never lose touch as you get sort of older, wiser, you know, how you generally get like disrespectful of kids, kids these days."}, {"time": 3199, "text": "No, the kids are okay."}, {"time": 3199, "text": "But I think you should hear a stronger case for their position."}, {"time": 3204, "text": "So I'm going to play for the elites."}, {"time": 3204, "text": "Well, for the limiting of expansion and for the regulation of behavior."}, {"time": 3212, "text": "Can I link on that?"}, {"time": 3212, "text": "So you're saying those two are connected."}, {"time": 3219, "text": "So the human civilization and alien civilizations come to a crossroads."}, {"time": 3227, "text": "They have to decide, do we want to expand or not?"}, {"time": 3227, "text": "And connected to that, do we want to give a lot of power to a central elite?"}, {"time": 3234, "text": "Or do we want to distribute the power centers, which is naturally connected to the expansion?"}, {"time": 3243, "text": "When you expand, you distribute the power."}, {"time": 3243, "text": "If say over the next thousand years, we fill up the solar system, right?"}, {"time": 3250, "text": "We go out from earth and we colonize Mars and we change a lot of things."}, {"time": 3255, "text": "Within a solar system, still everything is within reach."}, {"time": 3255, "text": "That is, if there's a rebellious colony around Neptune, you can throw rocks at it and smash it and then teach them discipline."}, {"time": 3265, "text": "A central control over the solar system is feasible."}, {"time": 3265, "text": "But once you let it escape the solar system, it's no longer feasible."}, {"time": 3274, "text": "But if you have a solar system that doesn't have a central control, maybe broken into a thousand different political units in the solar system, then any one part of that that allows interstellar colonization and it happens."}, {"time": 3284, "text": "That is interstellar colonization happens when only one party chooses to do it and is able to do it."}, {"time": 3290, "text": "And that's what it is there for."}, {"time": 3295, "text": "So we can just say in a world of competition, if interstellar colonization is possible, it will happen and then competition will continue."}, {"time": 3300, "text": "And that will sort of ensure the continuation of competition into the indefinite future."}, {"time": 3304, "text": "And competition, we don't know, but competition can take violent forms and many forms."}, {"time": 3310, "text": "And the case I was going to make is that I think one of the things that most scares people about competition is not just that it creates holocausts and death on massive scales, is that it's likely to change who we are and what we value."}, {"time": 3328, "text": "So this is the other thing with power."}, {"time": 3328, "text": "As we grow, as human civilization grows, becomes multi planetary, multi solar system potentially, how does that change us, do you think?"}, {"time": 3343, "text": "I think the more you think about it, the more you realize it can change us a lot."}, {"time": 3348, "text": "So first of all, this is pretty dark, by the way."}, {"time": 3348, "text": "Well, it's just honest."}, {"time": 3353, "text": "Well, I'm trying to get there."}, {"time": 3353, "text": "But I think the first thing you should say, if you look at history, just human history over the last 10,000 years, if you really understood what people were like a long time ago, you'd realize they were really quite different."}, {"time": 3364, "text": "Ancient cultures created people who were really quite different."}, {"time": 3364, "text": "Most historical fiction lies to you about that."}, {"time": 3369, "text": "It often offers you modern characters in an ancient world."}, {"time": 3374, "text": "But if you actually study history, you will see just how different they were and how differently they thought."}, {"time": 3379, "text": "And they've changed a lot many times, and they've changed a lot across time."}, {"time": 3385, "text": "So I think the most obvious prediction about the future is, even if you only have the mechanisms of change we've seen in the past, you should still expect a lot of change in the future."}, {"time": 3393, "text": "But we have a lot bigger mechanisms for change in the future than we had in the past."}, {"time": 3397, "text": "So I have this book called The Age of M, Work, Love, and Life, and Robots Rule the Earth."}, {"time": 3397, "text": "And it's about what happens if brain emulations become possible."}, {"time": 3404, "text": "So a brain emulation is where you take a actual human brain, and you scan it and find spatial and chemical detail to create a computer simulation of that brain."}, {"time": 3415, "text": "And then those computer simulations of brains are basically citizens in a new world."}, {"time": 3420, "text": "They work, and they vote, and they fall in love, and they get mad, and they lie to each other."}, {"time": 3424, "text": "And this is a whole new world."}, {"time": 3424, "text": "And my book is about analyzing how that world is different than our world, basically using competition as my key lever of analysis."}, {"time": 3434, "text": "That is, if that world remains competitive, then I can figure out how they change in that world, what they do differently than we do."}, {"time": 3439, "text": "And it's very different."}, {"time": 3439, "text": "And it's different in ways that are shocking sometimes to many people and ways some people don't like."}, {"time": 3446, "text": "I think it's an okay world, but I have to admit, it's quite different."}, {"time": 3452, "text": "And that's just one technology."}, {"time": 3457, "text": "If we add dozens more technologies, changes into the future, we should just expect it's possible to become very different than who we are."}, {"time": 3465, "text": "I mean, in the space of all possible minds, our minds are a particular architecture, a particular structure, a particular set of habits, and they are only one piece in a vast base of possibilities."}, {"time": 3474, "text": "The space of possible minds is really huge."}, {"time": 3480, "text": "So yeah, let's linger on the space of possible minds for a moment, just to sort of humble ourselves."}, {"time": 3487, "text": "How peculiar our peculiarities are, like the fact that we like a particular kind of sex, and the fact that we eat food through one hole and poop through another hole."}, {"time": 3499, "text": "And that seems to be a fundamental aspect of life, is very important to us."}, {"time": 3507, "text": "And that life is finite in a certain kind of way, we have a meat vehicle."}, {"time": 3515, "text": "So death is very important to us."}, {"time": 3515, "text": "I wonder which aspects are fundamental, or would be common throughout human history and also throughout, sorry, throughout history of life on Earth, and throughout other kinds of lives."}, {"time": 3527, "text": "Like what is really useful?"}, {"time": 3533, "text": "You mentioned competition seems to be a one fundamental thing."}, {"time": 3537, "text": "I've tried to do analysis of where our distant descendants might go in terms of what are robust features we could predict about our descendants."}, {"time": 3543, "text": "So again, I have this analysis of sort of the next generation, so the next era after ours."}, {"time": 3548, "text": "If you think of human history as having three eras so far, right?"}, {"time": 3553, "text": "There was the forager era, the farmer era, and the industry era."}, {"time": 3553, "text": "Then my attempt in age of M is to analyze the next era after that."}, {"time": 3558, "text": "And it's very different, but of course, there could be more and more errors after that."}, {"time": 3562, "text": "So analyzing a particular scenario and thinking it through is one way to try to see how different the future could be, but that doesn't give you some sort of sense of what's typical."}, {"time": 3572, "text": "But I have tried to analyze what's typical."}, {"time": 3578, "text": "And so I have two predictions I think I can make pretty solidly."}, {"time": 3578, "text": "One thing is that we know at the moment that humans discount the future rapidly."}, {"time": 3585, "text": "So we discount the future in terms of caring about consequences, roughly a factor of two per generation."}, {"time": 3592, "text": "And there's a solid evolutionary analysis why sexual creatures would do that."}, {"time": 3596, "text": "Because basically your descendants only share half of your genes and your descendants are a generation away."}, {"time": 3601, "text": "So we only care about our grandchildren."}, {"time": 3606, "text": "Basically that's a factor of four later because it's later."}, {"time": 3606, "text": "So this actually explains typical interest rates in the economy."}, {"time": 3614, "text": "That is interest rates are greatly influenced by our discount rates."}, {"time": 3619, "text": "And we basically discount the future by a factor of two per generation."}, {"time": 3625, "text": "But that's a side effect of the way our preferences evolved as sexually selected creatures."}, {"time": 3632, "text": "We should expect that in the longer run creatures will evolve who don't discount the future."}, {"time": 3637, "text": "They will care about the long run and they will therefore not neglect the long run."}, {"time": 3643, "text": "So for example, for things like global warming or things like that, at the moment, many commenters are sad that basically ordinary people don't seem to care much, market prices don't seem to care much and more ordinary people, it doesn't really impact them much because humans don't care much about the longterm future."}, {"time": 3657, "text": "And futurists find it hard to motivate people and to engage people about the longterm future because they just don't care that much."}, {"time": 3664, "text": "But that's a side effect of this particular way that our preferences evolved about the future."}, {"time": 3668, "text": "And so in the future, they will neglect the future less."}, {"time": 3674, "text": "And that's an interesting thing that we can predict robustly."}, {"time": 3674, "text": "Eventually, you know, maybe a few centuries, maybe longer, eventually our descendants will care about the future."}, {"time": 3684, "text": "Can you speak to the intuition behind that?"}, {"time": 3684, "text": "Is it useful to think more about the future?"}, {"time": 3689, "text": "If evolution rewards creatures for having many descendants, then if you have decisions that influence how many descendants you have, then that would be good if you made those decisions."}, {"time": 3700, "text": "But in order to do that, you'll have to care about them."}, {"time": 3704, "text": "You have to care about that future."}, {"time": 3704, "text": "So to push back, that's if you're trying to maximize the number of descendants."}, {"time": 3709, "text": "But the nice thing about not caring too much about the longterm future is you're more likely to take big risks or you're less risk averse."}, {"time": 3714, "text": "And it's possible that both evolution and just life in the universe rewards the risk takers."}, {"time": 3721, "text": "Well, we actually have analysis of the ideal risk preferences too."}, {"time": 3731, "text": "So there's a literature on ideal preferences that evolution should promote."}, {"time": 3739, "text": "And for example, there's literature on competing investment funds and what the managers of those funds should care about in terms of risk, various kinds of risks, and in terms of discounting."}, {"time": 3749, "text": "And so managers of investment funds should basically have logarithmic risk, i.e."}, {"time": 3749, "text": "in shared risk, in correlated risk, but be very risk neutral with respect to uncorrelated risk."}, {"time": 3758, "text": "So that's a feature that's predicted to happen about individual personal choices in biology and also for investment funds."}, {"time": 3774, "text": "So that's other things."}, {"time": 3774, "text": "That's also something we can say about the long run."}, {"time": 3777, "text": "What's correlated and uncorrelated risk?"}, {"time": 3777, "text": "If there's something that would affect all of your descendants, then if you take that risk, you might have more descendants, but you might have zero."}, {"time": 3791, "text": "And that's just really bad to have zero descendants."}, {"time": 3791, "text": "But an uncorrelated risk would be a risk that some of your descendants would suffer, but others wouldn't."}, {"time": 3796, "text": "And then you have a portfolio of descendants."}, {"time": 3800, "text": "And so that portfolio ensures you against problems with any one of them."}, {"time": 3806, "text": "I like the idea of portfolio descendants."}, {"time": 3806, "text": "And we'll talk about portfolios with your idea of you briefly mentioned, we'll return there with M, EM, the age of EM, work, love, and life when robots rule the earth."}, {"time": 3817, "text": "EM, by the way, is emulated minds."}, {"time": 3817, "text": "So this one of the... M is short for emulations."}, {"time": 3826, "text": "M is short for emulations."}, {"time": 3826, "text": "And it's kind of an idea of how we might create artificial minds, artificial copies of minds, or human like intelligences."}, {"time": 3836, "text": "I have another dramatic prediction I can make about long term preferences."}, {"time": 3841, "text": "Which is, at the moment, we reproduce as the result of a hodgepodge of preferences that aren't very well integrated, but sort of in our ancestral environment induced us to reproduce."}, {"time": 3852, "text": "So we have preferences over being sleepy and hungry and thirsty and wanting to have sex and wanting to be excitement, et cetera, right?"}, {"time": 3857, "text": "And so in our ancestral environment, the packages of preferences that we evolved to have did induce us to have more descendants."}, {"time": 3863, "text": "That's why we're here."}, {"time": 3871, "text": "But those packages of preferences are not a robust way to promote having more descendants."}, {"time": 3876, "text": "They were tied to our ancestral environment, which is no longer true."}, {"time": 3876, "text": "So that's one of the reasons we are now having a big fertility decline because in our current environment, our ancestral preferences are not inducing us to have a lot of kids, which is, from evolution's point of view, a big mistake."}, {"time": 3892, "text": "We can predict that in the longer run, there will arise creatures who just abstractly know that what they want is more descendants."}, {"time": 3900, "text": "That's a very robust way to have more descendants is to have that as your direct preference."}, {"time": 3905, "text": "First of all, your thinking is so clear."}, {"time": 3905, "text": "So mathematical."}, {"time": 3905, "text": "And thank you for thinking so clear with me and bearing with my interruptions and going on the tangents when we go there."}, {"time": 3919, "text": "So you're just clearly saying that successful long term civilizations will prefer to have descendants, more descendants."}, {"time": 3930, "text": "Not just prefer, consciously and abstractly prefer."}, {"time": 3930, "text": "That is, it won't be the indirect consequence of other preference."}, {"time": 3935, "text": "It will just be the thing they know they want."}, {"time": 3939, "text": "There'll be a president in the future that says, we must have more sex."}, {"time": 3944, "text": "We must have more descendants and do whatever it takes to do that."}, {"time": 3947, "text": "We must go to the moon and do the other things."}, {"time": 3947, "text": "Not because they're easy, but because they're hard."}, {"time": 3952, "text": "But instead of the moon, let's have lots of sex."}, {"time": 3956, "text": "But there's a lot of ways to have descendants, right?"}, {"time": 3958, "text": "So that's the whole point."}, {"time": 3958, "text": "When the world gets more complicated and there are many possible strategies, it's having that as your abstract preference that will force you to think through those possibilities and pick the one that's most effective."}, {"time": 3969, "text": "So just to clarify, descendants doesn't necessarily mean the narrow definition of descendants, meaning humans having sex and then having babies."}, {"time": 3978, "text": "You can have artificial intelligence systems in whom you instill some capability of cognition and perhaps even consciousness."}, {"time": 3987, "text": "You can also create through genetics and biology clones of yourself or slightly modified clones, thousands of them."}, {"time": 3992, "text": "So all kinds of descendants."}, {"time": 3992, "text": "It could be descendants in the space of ideas too, for somehow we no longer exist in this meat vehicle."}, {"time": 4001, "text": "It's now just like whatever the definition of a life form is, you have descendants of those life forms."}, {"time": 4014, "text": "And they will be thoughtful about that."}, {"time": 4014, "text": "They will have thought about what counts as a descendant and that'll be important to them to have the right concept."}, {"time": 4022, "text": "So the they there is very interesting, who the they are."}, {"time": 4025, "text": "But the key thing is we're making predictions that I think are somewhat robust about what our distant descendants will be like."}, {"time": 4030, "text": "Another thing I think you would automatically accept is they will almost entirely be artificial."}, {"time": 4034, "text": "And I think that would be the obvious prediction about any aliens we would meet."}, {"time": 4037, "text": "That is they would long since have given up reproducing biologically."}, {"time": 4044, "text": "Well, it's like organic or something."}, {"time": 4044, "text": "It's all real."}, {"time": 4048, "text": "It might be squishy and made out of hydrocarbons, but it would be artificial in the sense of made in factories with designs on CAD things, right?"}, {"time": 4053, "text": "Factories with scale economy."}, {"time": 4053, "text": "So the factories we have made on earth today have much larger scale economies than the factories in ourselves."}, {"time": 4062, "text": "So the factories in ourselves are, there are marvels, but they don't achieve very many scale economies."}, {"time": 4066, "text": "They're tiny little factories."}, {"time": 4067, "text": "But they're all factories."}, {"time": 4069, "text": "Factories on top of factories."}, {"time": 4069, "text": "So everything, the factories that are designed is different than sort of the factories that have evolved."}, {"time": 4076, "text": "I think the nature of the word design is very interesting to uncover there."}, {"time": 4076, "text": "But let me, in terms of aliens, let me go, let me analyze your Twitter like it's Shakespeare."}, {"time": 4090, "text": "There's a tweet says, define hello, in quotes, alien civilizations as one that might the next million years identify humans as intelligent and civilized, travel to earth and say hello by making their presence and advanced abilities known to us."}, {"time": 4104, "text": "The next 15 polls, this is a Twitter thread, the next 15 polls ask about such hello aliens."}, {"time": 4109, "text": "And what these polls ask is your Twitter followers, what they think those aliens will be like certain particular qualities."}, {"time": 4122, "text": "So poll number one is what percent of hello aliens evolved from biological species with two main genders?"}, {"time": 4129, "text": "And you know, the popular vote is above 80%."}, {"time": 4129, "text": "So most of them have two genders."}, {"time": 4138, "text": "I'll ask you about some of these because they're so interesting."}, {"time": 4140, "text": "It's such an interesting question."}, {"time": 4142, "text": "It is a fun set of questions."}, {"time": 4143, "text": "Yes, it's a fun set of questions."}, {"time": 4143, "text": "So the genders as we look through evolutionary history, what's the usefulness of that as opposed to having just one or like millions?"}, {"time": 4153, "text": "So there's a question in evolution of life on earth, there are very few species that have more than two genders."}, {"time": 4158, "text": "There are some, but they aren't very many."}, {"time": 4158, "text": "But there's an enormous number of species that do have two genders, much more than one."}, {"time": 4162, "text": "And so there's a literature on why did multiple genders evolve, and that's sort of what's the point of having males and females versus hermaphrodites."}, {"time": 4174, "text": "So most plants are hermaphrodites, that is they would mate male female, but each plant can be either role."}, {"time": 4180, "text": "And then most animals have chosen to split into males and females."}, {"time": 4187, "text": "And then they're differentiating the two genders."}, {"time": 4192, "text": "And there's an interesting set of questions about why that happens."}, {"time": 4196, "text": "Because you can do selection, you basically have like one gender competes for the affection of other and there's sexual partnership that creates the offspring."}, {"time": 4203, "text": "So there's sexual selection."}, {"time": 4208, "text": "It's nice to have like to a party, it's nice to have dance partners."}, {"time": 4208, "text": "And then then each one get to choose based on certain characteristics."}, {"time": 4214, "text": "And that's an efficient mechanism for adapting to the environment, being successfully adapted to the environment."}, {"time": 4224, "text": "It does look like there's an advantage."}, {"time": 4224, "text": "If you have males, then the males can take higher variants."}, {"time": 4229, "text": "And so there can be stronger selection among the males in terms of weeding out genetic mutations because the males have a higher variance in their mating success."}, {"time": 4238, "text": "Question number two, what percent of hello aliens evolved from land animals as opposed to plants or ocean slash air organisms?"}, {"time": 4244, "text": "By the way, I did recently see that there's only 10% of species on earth are in the ocean."}, {"time": 4253, "text": "So there's a lot more variety on land."}, {"time": 4263, "text": "I can't even intuit exactly why that would be."}, {"time": 4270, "text": "Maybe survival on land is harder and so you get a lot more."}, {"time": 4270, "text": "The story that I understand is it's about small niches."}, {"time": 4276, "text": "So speciation can be promoted by having multiple different species."}, {"time": 4283, "text": "So in the ocean, species are larger."}, {"time": 4283, "text": "That is there are more creatures in each species because the ocean environments don't vary as much."}, {"time": 4289, "text": "So if you're good in one place, you're good in many other places."}, {"time": 4293, "text": "But on land, and especially in rivers, rivers contain an enormous percentage of the kinds of species on land, you see, because they vary so much from place to place."}, {"time": 4298, "text": "And so a species can be good in one place and then other species can't really compete because they came from a different place where things are different."}, {"time": 4311, "text": "So it's a remarkable fact actually that speciation promotes evolution in the long run."}, {"time": 4318, "text": "That is more evolution has happened on land because there have been more species on land because each species has been smaller."}, {"time": 4323, "text": "And that's actually a warning about something called rot that I've thought a lot about, which is one of the problems with even a world government, which is large systems of software today just consistently rot and decay with time and have to be replaced."}, {"time": 4339, "text": "And that plausibly also is a problem for other large systems, including biological systems, legal systems, regulatory systems."}, {"time": 4343, "text": "And it seems like large species actually don't evolve as effectively as small ones do."}, {"time": 4349, "text": "And that's an important thing to notice about that."}, {"time": 4356, "text": "And that's different from ordinary sort of evolution in economies on Earth in the last few centuries, say."}, {"time": 4364, "text": "On Earth, the more technical evolution and economic growth happens in larger integrated cities and nations."}, {"time": 4371, "text": "But in biology, it's the other way around."}, {"time": 4371, "text": "More evolution happened in the fragmented species."}, {"time": 4376, "text": "Yeah, it's such a nuanced discussion because you can also push back in terms of nations and at least companies."}, {"time": 4382, "text": "It's like large companies seems to evolve less effectively."}, {"time": 4388, "text": "There is something that they have more resources, they don't even have better resilience."}, {"time": 4397, "text": "And when you look at the scale of decades and centuries, it seems like a lot of large companies die."}, {"time": 4403, "text": "But still large economies do better, like large cities grow better than small cities."}, {"time": 4409, "text": "Large integrated economies like the United States or the European Union do better than small fragmented ones."}, {"time": 4414, "text": "So, yeah, sure."}, {"time": 4414, "text": "That's a very interesting, long discussion."}, {"time": 4414, "text": "But so most of the people, and obviously votes on Twitter represent the absolute objective truth of things."}, {"time": 4428, "text": "But an interesting question about oceans is that, okay, remember I told you about how most planets would last for trillions of years and be later, right?"}, {"time": 4432, "text": "So people have tried to explain why life appeared on Earth by saying, oh, all those planets are going to be unqualified for life because of various problems."}, {"time": 4442, "text": "That is, they're around smaller stars, which last longer, and smaller stars have some things like more solar flares, maybe more tidal locking."}, {"time": 4446, "text": "But almost all of these problems with longer lived planets aren't problems for ocean worlds."}, {"time": 4451, "text": "And a large fraction of planets out there are ocean worlds."}, {"time": 4457, "text": "So if life can appear on an ocean world, then that pretty much ensures that these planets that last a very long time could have advanced life because there's a huge fraction of ocean worlds."}, {"time": 4470, "text": "So that's actually an open question."}, {"time": 4474, "text": "So when you say, sorry, when you say life appear, you're kind of saying life and intelligent life."}, {"time": 4481, "text": "So that's an open question."}, {"time": 4481, "text": "Is land, and that's I suppose the question behind the Twitter poll, which is a grabby alien civilization that comes to say hello, what's the chance that they first began their early steps, the difficult steps they took on land?"}, {"time": 4504, "text": "80%, most people on Twitter think it's very likely on land."}, {"time": 4514, "text": "I think people are discounting ocean worlds too much."}, {"time": 4514, "text": "That is, I think people tend to assume that whatever we did must be the only way it's possible."}, {"time": 4520, "text": "And I think people aren't giving enough credit for other possible paths."}, {"time": 4523, "text": "Dolphins, Waterworld, by the way, people criticize that movie."}, {"time": 4528, "text": "Kevin Costner can do me no wrong."}, {"time": 4532, "text": "Okay, next question."}, {"time": 4532, "text": "What percent of hello aliens once had a nuclear war with greater than 10 nukes fired in anger?"}, {"time": 4539, "text": "So not in the incompetence and as an accident, intentional firing of nukes and less than 20% was the most popular vote."}, {"time": 4554, "text": "And that just seems wrong to me."}, {"time": 4556, "text": "So like, I wonder what, so most people think once you get nukes, we're not going to fire them."}, {"time": 4562, "text": "They believe in the power."}, {"time": 4564, "text": "I think they're assuming that if you had a nuclear war, then that would just end civilization for good."}, {"time": 4568, "text": "I think that's the thinking."}, {"time": 4570, "text": "That's the main thing."}, {"time": 4571, "text": "And I think that's just wrong."}, {"time": 4571, "text": "I think you could rise again after a nuclear war."}, {"time": 4575, "text": "It might take 10,000 years or 100,000 years, but it could rise again."}, {"time": 4578, "text": "So what do you think about mutual assured destruction as a force to prevent people from firing nuclear weapons?"}, {"time": 4581, "text": "That's a question that I knew to a terrifying degree has been raised now and what's going on."}, {"time": 4591, "text": "Well, I mean, clearly it has had an effect."}, {"time": 4591, "text": "The question is just how strong an effect for how long."}, {"time": 4596, "text": "I mean, clearly we have not gone wild with nuclear war and clearly the devastation that you would get if you initiated a nuclear war is part of the reasons people have been reluctant to start a war."}, {"time": 4607, "text": "The question is just how reliably will that ensure the absence of a war?"}, {"time": 4612, "text": "The night is still young."}, {"time": 4614, "text": "This has been 70 years or whatever it's been."}, {"time": 4617, "text": "I mean, but what do you think?"}, {"time": 4617, "text": "Do you think we'll see nuclear war in the century?"}, {"time": 4626, "text": "I don't know if in the century, but it's the sort of thing that's likely to happen eventually."}, {"time": 4632, "text": "That's a very loose statement."}, {"time": 4632, "text": "Now this is where I pull you out of your mathematical model and ask a human question."}, {"time": 4637, "text": "Do you think this particular human question..."}, {"time": 4642, "text": "I think we've been lucky that it hasn't happened so far."}, {"time": 4644, "text": "But what is the nature of nuclear war?"}, {"time": 4644, "text": "Let's think about this."}, {"time": 4644, "text": "There's dictators, there's democracies, miscommunication."}, {"time": 4656, "text": "How do wars start?"}, {"time": 4656, "text": "World War I, World War II."}, {"time": 4660, "text": "So the biggest datum here is that we've had an enormous decline in major war over the last century."}, {"time": 4666, "text": "So that has to be taken into account now."}, {"time": 4666, "text": "So the problem is war is a process that has a very long tail."}, {"time": 4672, "text": "That is, there are rare, very large wars."}, {"time": 4672, "text": "So the average war is much worse than the median war because of this long tail."}, {"time": 4680, "text": "And that makes it hard to identify trends over time."}, {"time": 4680, "text": "So the median war has clearly gone way down in the last century at a medium rate of war."}, {"time": 4688, "text": "But it could be that's because the tail has gotten thicker."}, {"time": 4692, "text": "And in fact, the average war is just as bad, but most wars are gonna be big wars."}, {"time": 4697, "text": "So that's the thing we're not so sure about."}, {"time": 4701, "text": "There's no strong data on wars with one, because of the destructive nature of the weapons, kill hundreds of millions of people."}, {"time": 4711, "text": "There's no data on this."}, {"time": 4715, "text": "So, but we can start intuiting."}, {"time": 4717, "text": "But we can see that the power law, we can do a power law fit to the rate of wars and it's a power law with a thick tail."}, {"time": 4722, "text": "So it's one of those things that you should expect most of the damage to be in the few biggest ones."}, {"time": 4726, "text": "So that's also true for pandemics and a few other things."}, {"time": 4726, "text": "For pandemics, most of the damages in the few biggest ones."}, {"time": 4731, "text": "So the median pandemics of ours, less than the average that you should expect in the future."}, {"time": 4735, "text": "But those, that fitting of data is very questionable because everything you said is correct."}, {"time": 4742, "text": "The question is like, what can we infer about the future of civilization, threatening pandemics or nuclear war from studying the history of the 20th century?"}, {"time": 4759, "text": "So like, you can't just fit it to the data, the rate of wars and the destructive nature."}, {"time": 4765, "text": "Like that's not, that's not how nuclear war will happen."}, {"time": 4765, "text": "Nuclear war happens with two assholes or idiots that have access to a button."}, {"time": 4775, "text": "Small wars happen that way too."}, {"time": 4776, "text": "No, I understand that, but that's, it's very important."}, {"time": 4776, "text": "Small wars aside, it's very important to understand the dynamics, the human dynamics and the geopolitics of the way nuclear war happens in order to predict how we can minimize the chance of a..."}, {"time": 4791, "text": "But it is a common and useful intellectual strategy to take something that could be really big or, but is often very small and fit the distribution of the data, small things, which you have a lot of them and then ask, do I believe the big things are really that different?"}, {"time": 4805, "text": "So sometimes it's reasonable to say like, say with tornadoes or even pandemics or something, the underlying process might not be that different for the big and small ones."}, {"time": 4814, "text": "It might not be."}, {"time": 4814, "text": "The fact that mutual sure destruction seems to work to some degree shows you that to some degree it's different than the small wars."}, {"time": 4831, "text": "So it's a really important question to understand is, are humans capable, one human, like how many humans on earth, if I give them a button now, say you pressing this button will kill everyone on earth, everyone, right?"}, {"time": 4846, "text": "How many humans will press that button?"}, {"time": 4846, "text": "I want to know those numbers, like day to day, minute to minute, how many people have that much irresponsibility, evil, incompetence, ignorance, whatever word you want to assign, there's a lot of dynamics of the psychology that leads you to press that button, but how many?"}, {"time": 4866, "text": "My intuition is the number, the more destructive that press of a button, the fewer humans you find."}, {"time": 4872, "text": "And that number gets very close to zero very quickly, especially people have access to such a button, but that's perhaps a hope than a reality."}, {"time": 4884, "text": "And unfortunately we don't have good data on this, which is like how destructive are humans willing to be?"}, {"time": 4894, "text": "So I think part of this just has to think about, ask what your time scales you're looking at, right?"}, {"time": 4899, "text": "So if you say, if you look at the history of war, you know, we've had a lot of wars pretty consistently over many centuries."}, {"time": 4904, "text": "So if I ask, if you ask, will we have a nuclear war in the next 50 years?"}, {"time": 4910, "text": "I might say, well, probably not."}, {"time": 4910, "text": "If I say 500 or 5,000 years, like if the same sort of risks are underlying and they just continue, then you have to add that up over time and think the risk is getting a lot larger the longer a timescale we're looking at."}, {"time": 4924, "text": "But okay, let's generalize nuclear war because what I was more referring to is something that kills more than 20% of humans on earth and injures or makes the other 80% suffer horribly, survive, but suffer."}, {"time": 4945, "text": "That's what I was referring to."}, {"time": 4945, "text": "So when you look at 500 years from now, that might not be nuclear war."}, {"time": 4952, "text": "That might be something else."}, {"time": 4952, "text": "That's that kind of, has that destructive effect."}, {"time": 4956, "text": "And I don't know, these feel like novel questions in the history of humanity."}, {"time": 4965, "text": "I think since nuclear weapons, this has been, you know, engineering pandemics, for example, robotics, so nanobots."}, {"time": 4972, "text": "It just seems like a real new possibility that we have to contend with it."}, {"time": 4982, "text": "We don't have good models or from my perspective."}, {"time": 4988, "text": "So if you look on say the last thousand years or 10,000 years, we could say we've seen a certain rate at which people are willing to make big destruction in terms of war."}, {"time": 4993, "text": "And if you're willing to project that data forward, that I think like if you want to ask over periods of thousands or tens of thousands of years, you would have a reasonable data set."}, {"time": 5003, "text": "So the key question is what's changed lately?"}, {"time": 5008, "text": "And so a big question of which I've given a lot of thought to what are the major changes that seem to have happened in culture and human attitudes over the last few centuries and what's our best explanation for those so that we can project them forward into the future."}, {"time": 5024, "text": "And I have a story about that, which is the story that we have been drifting back toward forager attitudes in the last few centuries as we get rich."}, {"time": 5031, "text": "So the idea is we spent a million years being a forager and that was a very sort of standard lifestyle that we know a lot about."}, {"time": 5044, "text": "Foragers sort of live in small bands."}, {"time": 5044, "text": "They make decisions cooperatively."}, {"time": 5044, "text": "They share food."}, {"time": 5044, "text": "They, you know, they don't have much property, et cetera."}, {"time": 5050, "text": "And humans liked that."}, {"time": 5050, "text": "And then 10,000 years ago, farming became possible, but it was only possible because we were plastic enough to really change our culture."}, {"time": 5061, "text": "Farming styles and cultures are very different."}, {"time": 5061, "text": "They have slavery, they have war, they have property, they have inequality, they have kings."}, {"time": 5065, "text": "They stay in one place instead of wandering."}, {"time": 5070, "text": "They don't have as much diversity of experience or food."}, {"time": 5070, "text": "They have more disease."}, {"time": 5075, "text": "This farming life is just very different."}, {"time": 5075, "text": "But humans were able to sort of introduce conformity and religion and all sorts of things to become just a very different kind of creature as farmers."}, {"time": 5085, "text": "Farmers are just really different than foragers in terms of their values and their lives."}, {"time": 5089, "text": "But the pressures that made foragers into farmers were part mediated by poverty."}, {"time": 5095, "text": "Farmers are poor."}, {"time": 5095, "text": "And if they deviated from the farming norms that people around them supported, they were quite at risk of starving to death."}, {"time": 5100, "text": "And then in the last few centuries, we've gotten rich."}, {"time": 5105, "text": "And as we've gotten rich, the social pressures that turned foragers into farmers have become less persuasive to us."}, {"time": 5111, "text": "So, for example, a farming young woman who was told, if you have a child out of wedlock, you and your child may starve, that was a credible threat."}, {"time": 5122, "text": "She would see actual examples around her to make that a believable threat."}, {"time": 5122, "text": "Today, if you say to a young woman, you shouldn't have a child out of wedlock, she will see other young woman around her doing okay that way."}, {"time": 5131, "text": "We're all rich enough to be able to afford that sort of a thing."}, {"time": 5136, "text": "And therefore, she's more inclined often to go with her inclinations, her sort of more natural inclinations about such things rather than to be pressured to follow the official farming norms of that you shouldn't do that sort of thing."}, {"time": 5147, "text": "And all through our lives, we have been drifting back toward forager attitudes because we've been getting rich."}, {"time": 5151, "text": "And so, aside from at work, which is an exception, but elsewhere, I think this explains trends toward less slavery, more democracy, less religion, less fertility, more promiscuity, more travel, more art, more leisure, fewer work hours."}, {"time": 5172, "text": "All of these trends are basically explained by becoming more forager like."}, {"time": 5178, "text": "And much science fiction celebrates this, Star Trek or the culture novels, people like this image that we are moving toward this world."}, {"time": 5183, "text": "We're basically like foragers, we're peaceful, we share, we make decisions collectively, we have a lot of free time, we are into art."}, {"time": 5194, "text": "So forger, you know, forger is a word and it has, it's a loaded word because it's connected to the actual, what life was actually like at that time."}, {"time": 5202, "text": "As you mentioned, we sometimes don't do a good job of telling accurately what life was like back then."}, {"time": 5209, "text": "But you're saying if it's not exactly like foragers, it rhymes in some fundamental way."}, {"time": 5215, "text": "You also said peaceful."}, {"time": 5215, "text": "Is it obvious that a forager with a nuclear weapon would be peaceful?"}, {"time": 5221, "text": "I don't know if that's 100% obvious."}, {"time": 5221, "text": "So we know, again, we know a fair bit about what foragers lives were like."}, {"time": 5230, "text": "The main sort of violence they had would be sexual jealousy."}, {"time": 5234, "text": "They were relatively promiscuous and so there'd be a lot of jealousy."}, {"time": 5239, "text": "But they did not have organized wars with each other."}, {"time": 5239, "text": "That is, they were at peace with their neighboring forager bands."}, {"time": 5244, "text": "They didn't have property in land or even in people."}, {"time": 5244, "text": "They didn't really have marriage."}, {"time": 5248, "text": "And so they were, in fact, peaceful."}, {"time": 5255, "text": "When you think about large scale wars, they don't start large scale wars."}, {"time": 5258, "text": "They didn't have coordinated large scale wars like the way chimpanzees do."}, {"time": 5258, "text": "Our chimpanzees do have wars between one tribe of chimpanzees and others, but human foragers do not."}, {"time": 5262, "text": "Farmers return to that, of course, the more chimpanzee like styles."}, {"time": 5267, "text": "Well, that's a hopeful message."}, {"time": 5267, "text": "If we could return real quick to the Hello Aliens Twitter thread."}, {"time": 5272, "text": "One of them is really interesting about language."}, {"time": 5280, "text": "What percent of Hello Aliens would be able to talk to us in our language?"}, {"time": 5285, "text": "This is the question of communication."}, {"time": 5285, "text": "It actually gets to the nature of language."}, {"time": 5290, "text": "It also gets to the nature of how advanced you expect them to be."}, {"time": 5296, "text": "So I think some people see that we have advanced over the last thousands of years, and we aren't reaching any sort of limit."}, {"time": 5302, "text": "And so they tend to assume it could go on forever."}, {"time": 5308, "text": "And I actually tend to think that within, say, 10 million years, we will sort of max out on technology."}, {"time": 5314, "text": "We will sort of learn everything that's feasible to know for the most part."}, {"time": 5314, "text": "And then obstacles to understanding would more be about sort of cultural differences, like ways in which different places had just chosen to do things differently."}, {"time": 5325, "text": "And so then the question is, is it even possible to communicate across some cultural distances?"}, {"time": 5332, "text": "And I could imagine some maybe advanced aliens who just become so weird and different from each other, they can't communicate with each other."}, {"time": 5343, "text": "But we're probably pretty simple compared to them."}, {"time": 5343, "text": "So I would think, sure, if they wanted to, they could communicate with us."}, {"time": 5350, "text": "So it's the simplicity of the recipient."}, {"time": 5350, "text": "I tend to, just to push back, let's explore the possibility where that's not the case."}, {"time": 5357, "text": "Can we communicate with ants?"}, {"time": 5363, "text": "I find that this idea that... We're not very good at communicating in general."}, {"time": 5373, "text": "Oh, you're saying... All right, I see."}, {"time": 5373, "text": "You're saying once you get orders of magnitude better at communicating... Once they had maxed out on all communication technology in general, and they just understood in general how to communicate with lots of things, and had done that for millions of years."}, {"time": 5387, "text": "But you have to be able to..."}, {"time": 5387, "text": "This is so interesting."}, {"time": 5387, "text": "As somebody who cares a lot about empathy and imagining how other people feel, communication requires empathy, meaning you have to truly understand how the other person, the other organism sees the world."}, {"time": 5408, "text": "It's like a four dimensional species talking to a two dimensional species."}, {"time": 5408, "text": "It's not as trivial as, to me at least, as it might at first seem."}, {"time": 5415, "text": "So let me reverse my position a little, because I'll say, well, the hello aliens question really combines two different scenarios that we're slipping over."}, {"time": 5428, "text": "So one scenario would be that the hello aliens would be like grabby aliens."}, {"time": 5434, "text": "They would be just fully advanced."}, {"time": 5434, "text": "They would have been expanding for millions of years."}, {"time": 5438, "text": "They would have a very advanced civilization, and then they would finally be arriving here after a billion years perhaps of expanding, in which case they're going to be crazy advanced at some maximal level."}, {"time": 5447, "text": "But the hello aliens about aliens we might meet soon, which might be sort of UFO aliens, and UFO aliens probably are not grabby aliens."}, {"time": 5455, "text": "How do you get here if you're not a grabby alien?"}, {"time": 5462, "text": "Well, they would have to be able to travel."}, {"time": 5462, "text": "But they would not be expansive."}, {"time": 5471, "text": "So the road trip doesn't count as a grabby."}, {"time": 5471, "text": "So we're talking about expanding the colony, the comfortable colony."}, {"time": 5477, "text": "So the question is, if UFOs, some of them are aliens, what kind of aliens would they be?"}, {"time": 5484, "text": "This is sort of the key question you have to ask in order to try to interpret that scenario."}, {"time": 5488, "text": "The key fact we would know is that they are here right now, but the universe around us is not full of an alien civilization."}, {"time": 5496, "text": "So that says right off the bat that they chose not to allow massive expansion of a grabby civilization."}, {"time": 5510, "text": "Is it possible that they chose it, but we just don't see them yet?"}, {"time": 5510, "text": "These are the stragglers, the journeymen."}, {"time": 5516, "text": "So the timing coincidence is, it's almost surely if they are here now, they are much older than us."}, {"time": 5522, "text": "They are many millions of years older than us."}, {"time": 5522, "text": "And so they could have filled the galaxy in that last millions of years if they had wanted to."}, {"time": 5533, "text": "That is, they couldn't just be right at the edge."}, {"time": 5533, "text": "Most likely they would have been around waiting for us for a long time."}, {"time": 5538, "text": "They could have come here any time in the last millions of years and they just chosen, they've been waiting around for this or they just chose to come recently."}, {"time": 5545, "text": "But the timing coincidence, it would be crazy unlikely that they just happen to be able to get here, say in the last hundred years."}, {"time": 5551, "text": "They would no doubt have been able to get here far earlier than that."}, {"time": 5556, "text": "So this is a friend like UFO sightings on earth."}, {"time": 5556, "text": "We don't know if this kind of increase in sightings have anything to do with actual visitations."}, {"time": 5566, "text": "I'm just talking about the timing."}, {"time": 5566, "text": "They arose at some point in space time."}, {"time": 5572, "text": "And it's very unlikely that that was just to the point that they could just barely get here recently."}, {"time": 5576, "text": "Almost surely they could have gotten here much earlier."}, {"time": 5576, "text": "And throughout the stretch of several billion years that earth existed, they could have been here often."}, {"time": 5583, "text": "So they could have therefore filled the galaxy long time ago if they had wanted to."}, {"time": 5587, "text": "Let's push back on that."}, {"time": 5592, "text": "The question to me is, isn't it possible that the expansion of a civilization is much harder than the travel?"}, {"time": 5600, "text": "The sphere of the reachable is different than the sphere of the colonized."}, {"time": 5611, "text": "So isn't it possible that the sphere of places where like the stragglers go, the different people that journey out, the explorers, is much, much larger and grows much faster than the civilization?"}, {"time": 5624, "text": "So in which case, like they would visit us."}, {"time": 5624, "text": "There's a lot of visitors, the grad students of the civilization."}, {"time": 5631, "text": "They're like exploring, they're collecting the data, but we're not yet going to see them."}, {"time": 5636, "text": "And by yet, I mean across millions of years."}, {"time": 5641, "text": "The time delay between when the first thing might arrive and then when colonists could arrive in mass and do a mass amount of work is cosmologically short."}, {"time": 5650, "text": "In human history, of course, sure, there might be a century between that, but a century is just a tiny amount of time on the scales we're talking about."}, {"time": 5662, "text": "So this is, in computer science, ant colony optimization."}, {"time": 5662, "text": "It's true for ants."}, {"time": 5668, "text": "So it's like when the first ant shows up, it's likely if there's anything of value, it's likely the other ants will follow quickly."}, {"time": 5676, "text": "Relatively short."}, {"time": 5676, "text": "It's also true that traveling over very long distances, probably one of the main ways to make that feasible is that you land somewhere, you colonize a bit, you create new resources that can then allow you to go farther."}, {"time": 5688, "text": "Many short hops as opposed to a giant long journey."}, {"time": 5693, "text": "Those hops require that you are able to start a colonization of sorts along those hops."}, {"time": 5699, "text": "You have to be able to stop somewhere, make it into a way station such that you can then support you moving farther."}, {"time": 5704, "text": "So what do you think of, there's been a lot of UFO sightings."}, {"time": 5704, "text": "What do you think about those UFO sightings and what do you think if any of them are of extraterrestrial origin and we don't see giant civilizations out in the sky, how do you make sense of that then?"}, {"time": 5727, "text": "I want to do some clearing of throats, which people like to do on this topic, right?"}, {"time": 5727, "text": "They want to make sure you understand they're saying this and not that, right?"}, {"time": 5733, "text": "So I would say the analysis needs both a prior and a likelihood."}, {"time": 5739, "text": "So the prior is what are the scenarios that are at all plausible in terms of what we know about the universe."}, {"time": 5747, "text": "And then the likelihood is the particular actual sightings, like how hard are those to explain through various means."}, {"time": 5752, "text": "I will establish myself as somewhat of an expert on the prior."}, {"time": 5758, "text": "I would say my studies and the things I've studied make me an expert and I should stand up and have an opinion on that and be able to explain it."}, {"time": 5764, "text": "The likelihood, however, is not my area of expertise."}, {"time": 5769, "text": "That is, I'm not a pilot."}, {"time": 5769, "text": "I don't do atmospheric studies of studies of things I haven't studied in detail, the various kinds of atmospheric phenomena or whatever that might be used to explain the particular sightings."}, {"time": 5780, "text": "I can just say from my amateur stance, the sightings look damn puzzling."}, {"time": 5784, "text": "They do not look easy to dismiss."}, {"time": 5790, "text": "The attempts I've seen to easily dismiss them seem to me to fail."}, {"time": 5790, "text": "It seems like these are pretty puzzling, weird stuff that deserve an expert's attention in terms of considering, asking what the likelihood is."}, {"time": 5802, "text": "So analogy I would make as a murder trial."}, {"time": 5802, "text": "On average, if we say, what's the chance any one person murdered another person as a prior probability, maybe one in a thousand people get murdered."}, {"time": 5812, "text": "Maybe each person has a thousand people around them who could plausibly have done it."}, {"time": 5816, "text": "So the prior probability of a murder is one in a million."}, {"time": 5816, "text": "But we allow murder trials because often evidence is sufficient to overcome a one in a million prior because the evidence is often strong enough, right?"}, {"time": 5827, "text": "My guess, rough guess for the UFOs as aliens scenario, at least some of them, is the priors roughly one in a thousand, much higher than the usual murder trial, plenty high enough that strong physical evidence could put you over the top to think it's more likely than not."}, {"time": 5843, "text": "But I'm not an expert on that physical evidence."}, {"time": 5848, "text": "I'm going to leave that part to someone else."}, {"time": 5848, "text": "I'm going to say the prior is pretty high."}, {"time": 5853, "text": "This isn't a crazy scenario."}, {"time": 5853, "text": "So then I can elaborate on where my prior comes from."}, {"time": 5858, "text": "What scenario could make most sense of this data?"}, {"time": 5858, "text": "My scenario to make sense has two main parts."}, {"time": 5866, "text": "First is panspermia siblings."}, {"time": 5866, "text": "So panspermia is the process by which life might have arrived on earth from elsewhere."}, {"time": 5875, "text": "And a plausible time for that, I mean, it would have to happen very early in earth's history because we see life early in history."}, {"time": 5880, "text": "And a plausible time could have been during the stellar nursery where the sun was born with many other stars in the same close proximity with lots of rocks flying around, able to move things from one place to another."}, {"time": 5898, "text": "If a rock with life on it from some rock with planet with life came into that stellar nursery, it plausibly could have seeded many planets in that stellar nursery all at the same time."}, {"time": 5904, "text": "They're all born at the same time in the same place, pretty close to each other, lots of rocks flying around."}, {"time": 5913, "text": "So a panspermia scenario would then create siblings, i.e."}, {"time": 5913, "text": "there would be, say, a few thousand other planets out there."}, {"time": 5922, "text": "So after the nursery forms, it drifts, it separates, they drift apart."}, {"time": 5928, "text": "And so out there in the galaxy, there would now be a bunch of other stars all formed at the same time."}, {"time": 5932, "text": "And we can actually spot them in terms of their spectrum."}, {"time": 5932, "text": "And they would have then started on the same path of life as we did with that life being seeded, but they would move at different rates."}, {"time": 5943, "text": "And most likely, most of them would never reach an advanced level before the deadline."}, {"time": 5943, "text": "But maybe one other did, and maybe it did before us."}, {"time": 5951, "text": "So if they did, they could know all this, and they could go searching for their siblings."}, {"time": 5958, "text": "That is, they could look in the sky for the other stars that match the spectrum that matches the spectrum that came from this nursery."}, {"time": 5966, "text": "They could identify their sibling stars in the galaxy, the thousand of them."}, {"time": 5966, "text": "And those would be of special interest to them because they would think, well, life might be on those."}, {"time": 5972, "text": "And they could go looking for them."}, {"time": 5978, "text": "Can we just, such a brilliant mathematical, philosophical, physical, biological idea of panspermia siblings, because we all kind of started at a similar time in this local pocket of the universe."}, {"time": 5993, "text": "And so that changes a lot of the math."}, {"time": 6002, "text": "So that would create this correlation between when advanced life might appear, no longer just random independent spaces and space time."}, {"time": 6006, "text": "There'd be this cluster, perhaps."}, {"time": 6010, "text": "And that allows interaction between non grabby alien civilizations, like kind of primitive alien civilizations, like us with others."}, {"time": 6019, "text": "And they might be a little bit ahead."}, {"time": 6026, "text": "They would probably be a lot ahead."}, {"time": 6026, "text": "So the puzzle is, if they happened before us, they probably happened hundreds of millions of years before us."}, {"time": 6037, "text": "But less than a billion."}, {"time": 6038, "text": "Less than a billion, but still plenty of time that they could have become grabby and filled the galaxy and gone beyond."}, {"time": 6043, "text": "So the fact is, they chose not to become grabby."}, {"time": 6043, "text": "That would have to be the interpretation."}, {"time": 6049, "text": "If we have panspermia siblings..."}, {"time": 6052, "text": "Plenty of time to become grabby, you said."}, {"time": 6052, "text": "So they should be gone."}, {"time": 6054, "text": "Yes, they had plenty of time and they chose not to."}, {"time": 6058, "text": "Are we sure about this?"}, {"time": 6058, "text": "A hundred million years is enough."}, {"time": 6062, "text": "So I told you before that I said, within 10 million years, our descendants will become grabby or not."}, {"time": 6068, "text": "And they'll have that choice."}, {"time": 6070, "text": "And so they, clearly more than 10 million years earlier than us, so they chose not to."}, {"time": 6076, "text": "But still go on vacation, look around, just not grabby."}, {"time": 6080, "text": "If they chose not to expand, that's going to have to be a rule they set to not allow any part of themselves to do it."}, {"time": 6085, "text": "If they let any little ship fly away with the ability to create a colony, the game's over."}, {"time": 6091, "text": "Then the universe becomes grabby from their origin with this one colony, right?"}, {"time": 6098, "text": "So in order to prevent their civilization being grabby, they have to have a rule they enforce pretty strongly that no part of them can ever try to do that."}, {"time": 6106, "text": "Through a global authoritarian regime or through something that's internal to them, meaning it's part of the nature of life that it doesn't want... As like a political officer in the brain or whatever."}, {"time": 6119, "text": "There's something in human nature that prevents you from what or like alien nature that as you get more advanced, you become lazier and lazier in terms of exploration and expansion."}, {"time": 6134, "text": "So I would say they would have to have enforced a rule against expanding and that rule would probably make them reluctant to let people leave very far."}, {"time": 6140, "text": "You know, any one vacation trip far away could risk an expansion from this vacation trip."}, {"time": 6145, "text": "So they would probably have a pretty tight lid on just allowing any travel out from their origin in order to enforce this rule."}, {"time": 6154, "text": "But then we also know, well, they would have chosen to come here."}, {"time": 6160, "text": "So clearly they made an exception from their general rule to say, okay, but an expedition to Earth, that should be allowed."}, {"time": 6168, "text": "It could be intentional exception or incompetent exception."}, {"time": 6172, "text": "But if incompetent, then they couldn't maintain this over 100 million years, this policy of not allowing any expansion."}, {"time": 6177, "text": "So we have to see they have successfully, they not just had a policy to try, they succeeded over 100 million years in preventing the expansion."}, {"time": 6187, "text": "That's a substantial competence."}, {"time": 6189, "text": "Let me think about this."}, {"time": 6189, "text": "So you don't think there could be a barrier in 100 million years, you don't think there could be a barrier to like technological barrier to becoming expansionary."}, {"time": 6205, "text": "Imagine the Europeans have tried to prevent anybody from leaving Europe to go to the new world."}, {"time": 6210, "text": "And imagine what it would have taken to make that happen over 100 million years."}, {"time": 6216, "text": "Yeah, it's impossible."}, {"time": 6217, "text": "They would have had to have very strict, you know, guards at the borders saying, no, you can't go."}, {"time": 6224, "text": "But just to clarify, you're not suggesting that's actually possible."}, {"time": 6228, "text": "I am suggesting it's possible."}, {"time": 6231, "text": "I don't know how you keep, in my silly human brain, maybe it's the brain that values freedom, but I don't know how you can keep, no matter how much force, no matter how much censorship or control or so on, I just don't know how you can keep people from exploring into the mysterious, into the unknown."}, {"time": 6251, "text": "You're thinking of people, we're talking aliens."}, {"time": 6251, "text": "So remember, there's a vast space of different possible social creatures they could have evolved from, different cultures they could be in, different kinds of threats."}, {"time": 6258, "text": "I mean, there are many things, as you talked about, that most of us would feel very reluctant to do."}, {"time": 6265, "text": "This isn't one of those."}, {"time": 6266, "text": "Okay, so how, if the UFO sightings represent alien visitors, how the heck are they getting here under the panspermia siblings?"}, {"time": 6276, "text": "So panspermia siblings is one part of the scenario, which is that's where they came from."}, {"time": 6280, "text": "And from that, we can conclude they had this rule against expansion and they've successfully enforced that."}, {"time": 6284, "text": "That also creates a plausible agenda for why they would be here, that is to enforce that rule on us."}, {"time": 6290, "text": "That is, if we go out and expanding, then we have defeated the purpose of this rule they set up."}, {"time": 6298, "text": "So they would be here to convince us to not expand."}, {"time": 6303, "text": "Convince in quotes."}, {"time": 6305, "text": "Through various mechanisms."}, {"time": 6305, "text": "So obviously, one thing we conclude is they didn't just destroy us."}, {"time": 6309, "text": "That would have been completely possible, right?"}, {"time": 6309, "text": "So the fact that they're here and we are not destroyed means that they chose not to destroy us."}, {"time": 6313, "text": "They have some degree of empathy or whatever their morals are that would make them reluctant to just destroy us."}, {"time": 6324, "text": "They would rather persuade us."}, {"time": 6326, "text": "Destroy their brethren."}, {"time": 6326, "text": "And so they may have been, there's a difference in arrival and observation."}, {"time": 6331, "text": "They may have been observing for a very long time."}, {"time": 6335, "text": "And they arrive to try to, not to try, I don't think to try to ensure that we don't become grabby."}, {"time": 6346, "text": "Which is because we can see that they did not, they must have enforced a rule against that and they are therefore here to, that's a plausible interpretation why they would risk this expedition when they clearly don't risk very many expeditions over this long period to allow this one exception because otherwise, if they don't, we may become grabby."}, {"time": 6364, "text": "And they could have just destroyed us, but they didn't."}, {"time": 6366, "text": "And they're closely monitoring the technological advancing of our civilization."}, {"time": 6366, "text": "Like what nuclear weapons is one thing that, all right, cool."}, {"time": 6371, "text": "That might have less to do with nuclear weapons and more with nuclear energy."}, {"time": 6375, "text": "Maybe they're monitoring fusion closely."}, {"time": 6375, "text": "Like how clever are these apes getting?"}, {"time": 6383, "text": "So no doubt they have a button that if we get too uppity or risky, they can push the button and ensure that we don't expand."}, {"time": 6388, "text": "But they'd rather do it some other way."}, {"time": 6388, "text": "So now that's, that explains why they're here and why they aren't out there."}, {"time": 6392, "text": "But there's another thing that we need to explain."}, {"time": 6396, "text": "There's another key data we need to explain about UFOs if we're going to have a hypothesis that explains them."}, {"time": 6400, "text": "And this is something many people have noticed, which is they had two extreme options they could have chosen and didn't chose."}, {"time": 6410, "text": "They could have either just remained completely invisible."}, {"time": 6410, "text": "Clearly an advanced civilization could have been completely invisible."}, {"time": 6414, "text": "There's no reason they need to fly around and be noticed."}, {"time": 6418, "text": "They could just be in orbit and in dark satellites that are completely invisible to us watching whatever they want to watch."}, {"time": 6422, "text": "That would be well within their abilities."}, {"time": 6426, "text": "That's one thing they could have done."}, {"time": 6426, "text": "The other thing they could do is just show up and land on the White House lawn, as they say, and shake hands, like make themselves really obvious."}, {"time": 6433, "text": "They could have done either of those and they didn't do either of those."}, {"time": 6437, "text": "That's the next thing you need to explain about UFOs as aliens."}, {"time": 6437, "text": "Why would they take this intermediate approach, hanging out near the edge of visibility with somewhat impressive mechanisms, but not walking up and introducing themselves nor just being completely invisible?"}, {"time": 6450, "text": "So, okay, a lot of questions there."}, {"time": 6450, "text": "So one, do you think it's obvious where the White House is or the White House lawn?"}, {"time": 6459, "text": "Obvious where there are concentrations of humans that you could go up and introduce."}, {"time": 6462, "text": "But is humans the most interesting thing about Earth?"}, {"time": 6466, "text": "Are you sure about this?"}, {"time": 6468, "text": "If they're worried about an expansion, then they would be worried about a civilization that could be capable of expansion."}, {"time": 6472, "text": "Obviously humans are the civilization on Earth that's by far the closest to being able to expand."}, {"time": 6479, "text": "I just don't know if aliens obviously see...obviously see humans, like the individual humans, like the meat vehicles, as the center of focus for observing a life on a planet."}, {"time": 6499, "text": "They're supposed to be really smart and advanced."}, {"time": 6499, "text": "Like, this shouldn't be that hard for them."}, {"time": 6503, "text": "But I think we're actually the dumb ones, because we think humans are the important things."}, {"time": 6507, "text": "But it could be our ideas."}, {"time": 6507, "text": "It could be something about our technologies."}, {"time": 6512, "text": "But that's mediated with us."}, {"time": 6512, "text": "It's correlated with us."}, {"time": 6514, "text": "No, we make it seem like it's mediated by us humans."}, {"time": 6514, "text": "But the focus for alien civilizations might be the AI systems or the technologies themselves."}, {"time": 6523, "text": "That might be the organism."}, {"time": 6523, "text": "Like, what humans are like...human is the food, the source of the organism that's under observation, versus like..."}, {"time": 6539, "text": "So what they wanted to have close contact with was something that was closely near humans, then they would be contacting those."}, {"time": 6543, "text": "And we would just incidentally see, but we would still see."}, {"time": 6548, "text": "But don't you think that...isn't it possible, taking their perspective, isn't it possible that they would want to interact with some fundamental aspect that they're interested in without interfering with it?"}, {"time": 6556, "text": "And that's actually a very...no matter how advanced you are, it's very difficult to do."}, {"time": 6565, "text": "But that's puzzling."}, {"time": 6565, "text": "So, I mean, the prototypical UFO observation is a shiny, big object in the sky that has very rapid acceleration and no apparent surfaces for using air to manipulate at speed."}, {"time": 6581, "text": "And the question is, why that?"}, {"time": 6581, "text": "Again, if they just... For example, if they just wanted to talk to our computer systems, they could move some sort of like a little probe that connects to a wire and reads and sends bits there."}, {"time": 6595, "text": "They don't need a shiny thing flying in the sky."}, {"time": 6602, "text": "But don't you think they would be looking for the right way to communicate, the right language to communicate?"}, {"time": 6608, "text": "Everything you just said, looking at the computer systems, I mean, that's not a trivial thing."}, {"time": 6613, "text": "Coming up with a signal that us humans would not freak out too much about, but also understand, might not be that trivial."}, {"time": 6624, "text": "Well, so the not freak out part is another interesting constraint."}, {"time": 6624, "text": "So again, I said, like the two obvious strategies are just to remain completely invisible and watch, which would be quite feasible, or to just directly interact, come out and be really very direct, right?"}, {"time": 6636, "text": "I mean, there's big things that you can see around."}, {"time": 6636, "text": "There's big cities, there's aircraft carriers, there's lots of..."}, {"time": 6641, "text": "If you want to just find a big thing and come right up to it and like tap it on the shoulder or whatever, that would be quite feasible, then they're not doing that."}, {"time": 6649, "text": "So my hypothesis is that one of the other questions there was, do they have a status hierarchy?"}, {"time": 6657, "text": "And I think most animals on earth who are social animals who are social animals have status hierarchy, and they would reasonably presume that we have a status hierarchy."}, {"time": 6667, "text": "And... Take me to your leader."}, {"time": 6671, "text": "Well, I would say their strategy is to be impressive and sort of get us to see them at the top of our status hierarchy."}, {"time": 6677, "text": "That's how, for example, we domesticate dogs, right?"}, {"time": 6685, "text": "We convince dogs we're the leader of their pack, right?"}, {"time": 6685, "text": "And we domesticate many animals that way, but as we just swap into the top of their status hierarchy and we say, we're your top status animal, so you should do what we say, you should follow our lead."}, {"time": 6699, "text": "So the idea that would be, they are going to get us to do what they want by being top status."}, {"time": 6708, "text": "You know, all through history, kings and emperors, et cetera, have tried to impress their citizens and other people by having the bigger palace, the bigger parade, the bigger crown and diamonds, right?"}, {"time": 6716, "text": "Whatever, maybe building a bigger pyramid, et cetera."}, {"time": 6716, "text": "It's a very well established trend to just be high status by being more impressive than the rest."}, {"time": 6725, "text": "To push back when there's an order of several orders of magnitude of power differential, asymmetry of power, I feel like that status hierarchy no longer applies."}, {"time": 6731, "text": "It's like memetic theory."}, {"time": 6738, "text": "Most emperors are several orders of magnitude more powerful than any one member of their empire."}, {"time": 6742, "text": "Let's increase that by even more."}, {"time": 6742, "text": "So like if I'm interacting with ants, I no longer feel like I need to establish my power with ants."}, {"time": 6749, "text": "I actually want to lower myself to the ants."}, {"time": 6758, "text": "I want to become the lowest possible ant so that they would welcome me."}, {"time": 6764, "text": "So I'm less concerned about them worshiping me."}, {"time": 6764, "text": "I'm more concerned about them welcoming me."}, {"time": 6769, "text": "It is important that you be nonthreatening and that you be local."}, {"time": 6769, "text": "So I think for example, if the aliens had done something really big in the sky, 100 light years away, that would be there, not here."}, {"time": 6777, "text": "And that could seem threatening."}, {"time": 6777, "text": "So I think their strategy to be the high status would have to be to be visible, but to be here and nonthreatening."}, {"time": 6786, "text": "I just don't know if it's obvious how to do that."}, {"time": 6786, "text": "Take your own perspective."}, {"time": 6786, "text": "You see a planet with relatively intelligent complex structures being formed, life forms."}, {"time": 6794, "text": "You could see this under in Titan or something like that, Europa."}, {"time": 6800, "text": "You start to see not just primitive bacterial life, but multicellular life."}, {"time": 6809, "text": "And it seems to form some very complicated cellular colonies, structures that they're dynamic."}, {"time": 6816, "text": "Some gigantic cellular automata type of construct."}, {"time": 6823, "text": "How do you make yourself known to them in an impressive fashion without destroying it?"}, {"time": 6832, "text": "We know how to destroy potentially."}, {"time": 6836, "text": "So if you go touch stuff, you're likely to hurt it, right?"}, {"time": 6836, "text": "There's a good risk of hurting something by getting too close and touching it and interacting, right?"}, {"time": 6844, "text": "Yeah, like landing on a White House lawn."}, {"time": 6846, "text": "So the claim is that their current strategy of hanging out at the periphery of our vision and just being very clearly physically impressive with very clear physically impressive abilities is at least a plausible strategy they might use to impress us and convince us sort of we're at the top of their status hierarchy."}, {"time": 6865, "text": "And I would say if they came closer, not only would they risk hurting us in ways that they couldn't really understand, but more plausibly, they would reveal things about themselves we would hate."}, {"time": 6875, "text": "So if you look at how we treat other civilizations on Earth and other people, we are generally interested in foreigners and people from other plant lands."}, {"time": 6886, "text": "And we were generally interested in their varying cult customs, et cetera, until we find out that they do something that violates our moral norms and then we hate them."}, {"time": 6896, "text": "And these are aliens for God's sakes, right?"}, {"time": 6896, "text": "There's just going to be something about them that we hate."}, {"time": 6901, "text": "They eat babies."}, {"time": 6901, "text": "Who knows what it is?"}, {"time": 6901, "text": "Something they don't think is offensive, but that they think we might find."}, {"time": 6905, "text": "And so they would be risking a lot by revealing a lot about themselves."}, {"time": 6911, "text": "We would find something we hated."}, {"time": 6911, "text": "But do you resonate at all with memetic theory where like, we only feel this way about things that are very close to us."}, {"time": 6921, "text": "So aliens are sufficiently different to where we'll be like, fascinated, terrified or fascinated, but not like."}, {"time": 6926, "text": "Right, but if they want to be at the top of our status hierarchy to get us to follow them, they can't be too distant."}, {"time": 6930, "text": "They have to be close enough that we would see them that way."}, {"time": 6935, "text": "But pretend to be close enough."}, {"time": 6935, "text": "And not reveal much that mystery that old Clint Eastwood cowboy."}, {"time": 6941, "text": "I mean, we're clever enough that we can figure out their agenda."}, {"time": 6941, "text": "That is just from the fact that we're here."}, {"time": 6947, "text": "If we see that they're here, we can figure out, Oh, they want us not to expand and look, they are this huge power and they're very impressive."}, {"time": 6951, "text": "So, and a lot of us don't want to expand."}, {"time": 6955, "text": "So that could easily tip us over the edge toward we already wanted to not expand."}, {"time": 6955, "text": "We already wanted to be able to regulate and have a central community."}, {"time": 6962, "text": "And here are these very advanced smart aliens who have survived for a hundred million years and they're telling us not to expand either."}, {"time": 6972, "text": "I love this so much."}, {"time": 6972, "text": "Uh, the, the, so returning to panspermia siblings, just to clarify one thing in that framework, how would, who originated, who planted it?"}, {"time": 6991, "text": "Would it be a grabby alien civilization that planted the siblings or no?"}, {"time": 6991, "text": "The simple scenario is that life started on some other planet billions of years ago and it went through part of the stages of evolution to advance life, but not all the way to advance life."}, {"time": 7004, "text": "And then some rock hit it, grabbed a piece of it on the rock and that rock drifted for maybe in a million years until it happened to prong the stellar nursery where it then seeded many stars."}, {"time": 7014, "text": "And something about that life without being super advanced, it was nevertheless resilient to the harsh conditions of space."}, {"time": 7025, "text": "There's some graphs that I've been impressed by that show sort of the level of genetic information in various kinds of life on the history of earth."}, {"time": 7030, "text": "And basically we are now more complex than the earlier life, but the earlier life was still pretty complex."}, {"time": 7036, "text": "And so if you actually project this log graph in history, it looks like it was many billions of years ago when you get down to zero."}, {"time": 7047, "text": "So like plausible, you could say there was just a lot of evolution that had to happen before you to get to the simplest life we've ever seen in history of life on earth was still pretty damn complicated."}, {"time": 7055, "text": "And so that race, that's always been this puzzle."}, {"time": 7055, "text": "How could life get to this enormously complicated level in the short period it seems to at the beginning of earth history."}, {"time": 7066, "text": "So where, you know, it's only 300 million years at most when it appeared."}, {"time": 7072, "text": "And then it was really complicated at that point."}, {"time": 7072, "text": "So panspermia allows you to explain that complexity by saying, well, it's been another 5 billion years on another planet going through lots of earlier stages where it was working its way up to the level of complexity you see at the beginning of earth."}, {"time": 7086, "text": "We'll try to talk about other ideas of the origin of life, but let me return to UFO sightings."}, {"time": 7092, "text": "Is there other explanations that are possible outside of panspermia siblings that can explain no grabby aliens in the sky and yet alien arrival on earth?"}, {"time": 7106, "text": "Well, the other categories of explanations that most people will use is, well, first of all, just mistakes, like, you know, you're, you're, you're confusing something ordinary for something mysterious, right?"}, {"time": 7117, "text": "Or some sort of secret organization, like our government is secretly messing with us and trying to do a, you know, a false flag ops or whatever, right?"}, {"time": 7128, "text": "You know, they're trying to convince the Russians or the Chinese that there might be aliens and scare them into not attacking or something, right?"}, {"time": 7132, "text": "Because if you, you know, the history of World War II, say the US government did all these big fake operations where they were faking a lot of big things in order to mess with people."}, {"time": 7145, "text": "The government has been lying and, you know, faking things and paying people to lie about what they saw, et cetera."}, {"time": 7149, "text": "That's a plausible set of explanations for the range of sightings seen."}, {"time": 7156, "text": "And another explanation people offer is some other hidden organization on earth or some, you know, secret organization somewhere that has much more advanced capabilities than anybody's given a credit for, for some reason it's been keeping secret."}, {"time": 7170, "text": "I mean, they all sound somewhat implausible, but again, we're looking for maybe, you know, one in a thousand sort of priors."}, {"time": 7175, "text": "Question is, you know, could, could they be in that level of plausibility?"}, {"time": 7180, "text": "So you, first of all, you've written, talked about, thought about so many different topics."}, {"time": 7187, "text": "You're an incredible mind."}, {"time": 7187, "text": "And I just thank you for sitting down today."}, {"time": 7194, "text": "I'm almost like at a loss of which place we explore, but let me on this topic, ask about conspiracy theories because you've written about institutions authorities."}, {"time": 7206, "text": "What, this is a bit of a therapy session, but what do we make of conspiracy theories?"}, {"time": 7218, "text": "The phrase itself is pushing you in a direction, right?"}, {"time": 7218, "text": "So clearly in history, we've had many large coordinated keepings of secrets, right?"}, {"time": 7225, "text": "Say the Manhattan project, right?"}, {"time": 7230, "text": "And there was hundreds of thousands of people working on that over many years, but they kept it a secret, right?"}, {"time": 7234, "text": "Clearly many large military operations have kept things secrets over, you know, even decades with many thousands of people involved."}, {"time": 7239, "text": "So clearly it's possible to keep some things secret over time periods."}, {"time": 7247, "text": "You know, but the more people you involve and the more time you are assuming and the more, the less centralized an organization or the less discipline they have, the harder it gets to believe."}, {"time": 7259, "text": "But we're just trying to calibrate basically in our minds, which kind of secrets can be kept by which groups over what time periods for what purposes, right?"}, {"time": 7267, "text": "But let me, I don't have enough data."}, {"time": 7267, "text": "So I'm somebody, I, you know, I hang out with people and I love people."}, {"time": 7274, "text": "I love all things really."}, {"time": 7274, "text": "And I just, I think that most people, even the assholes have the capacity to be good and they're beautiful and I enjoy them."}, {"time": 7288, "text": "So the kind of data, my brain, whatever the chemistry of my brain is that sees the beautiful in things is maybe collecting a subset of data that doesn't allow me to intuit the competence that humans are able to achieve in constructing a conspiracy theory."}, {"time": 7302, "text": "So for example, one thing that people often talk about is like intelligence agencies, this like broad thing."}, {"time": 7310, "text": "They say the CIA, the FSB, the different, the British intelligence."}, {"time": 7315, "text": "I've fortunate or unfortunate enough, never gotten the chance that I know of to talk to any member of those intelligence agencies nor like take a peek behind the curtain or the first curtain."}, {"time": 7331, "text": "I don't know how many levels of curtains there are."}, {"time": 7336, "text": "And so I don't, I can't intuit my interactions with government."}, {"time": 7336, "text": "I was funded by DOD and DARPA and I've interacted, been to the Pentagon, like with all due respect to my friends, lovely friends in government."}, {"time": 7351, "text": "And there are a lot of incredible people, but there is a very giant bureaucracy that sometimes suffocates the ingenuity of the human spirit is one way I can put it."}, {"time": 7356, "text": "Meaning they are, I just, it's difficult for me to imagine extreme competence at a scale of hundreds or thousands human beings."}, {"time": 7370, "text": "Now that doesn't mean that's my very anecdotal data of the situation."}, {"time": 7376, "text": "And so I try to build up my intuition about centralized system of government, how much conspiracy is possible, how much the intelligence agencies or some other source can generate sufficiently robust propaganda that controls the populace."}, {"time": 7394, "text": "If you look at World War II, as you mentioned, there've been extremely powerful propaganda machines on the Nazi, on the side of Nazi Germany, on the side of the Soviet Union, on the side of the United States and all these different mechanisms."}, {"time": 7413, "text": "Sometimes they control the free press through social pressures."}, {"time": 7413, "text": "Sometimes they control the press through the threat of violence, as you do in authoritarian regimes."}, {"time": 7420, "text": "Sometimes it's like deliberately the dictator, like writing the news, the headlines and literally announcing it."}, {"time": 7427, "text": "And something about human psychology forces you to embrace the narrative and believe the narrative."}, {"time": 7442, "text": "And at scale that becomes reality when the initial spark was just the propaganda thought in a single individual's mind."}, {"time": 7449, "text": "So I can't necessarily intuit of what's possible, but I'm skeptical of the power of human institutions to construct conspiracy theories that cause suffering at scale, especially in this modern age when information is becoming more and more accessible by the populace."}, {"time": 7466, "text": "Anyway, that's the, I don't know if you can elucidate for us."}, {"time": 7475, "text": "It's called suffering at scale, but of course, say during wartime, the people who are managing the various conspiracies like D Day or Manhattan Project, they thought that their conspiracy was avoiding harm rather than causing harm."}, {"time": 7485, "text": "So if you can get a lot of people to think that supporting the conspiracy is helpful, then a lot more might do that."}, {"time": 7489, "text": "And there's just a lot of things that people just don't want to see."}, {"time": 7497, "text": "So if you can make your conspiracy the sort of thing that people wouldn't want to talk about anyway, even if they knew about it, you're most of the way there."}, {"time": 7507, "text": "So I have learned many over the years, many things that most ordinary people would never want to hear, many things that most ordinary people should be interested in, but somehow don't know, even though the data has been very widespread."}, {"time": 7517, "text": "So I have this book, The Elephant and the Brain, and one of the chapters is there on medicine."}, {"time": 7521, "text": "And basically, most people seem ignorant of the very basic fact that when we do randomized trials where we give some people more medicine than others, the people who get more medicine are not healthier."}, {"time": 7532, "text": "Just overall, in general, just like induce somebody to get more medicine because you just give them more budget to buy medicine, say."}, {"time": 7542, "text": "And not a specific medicine, just the whole category."}, {"time": 7542, "text": "And you would think that would be something most people should know about medicine."}, {"time": 7546, "text": "You might even think that would be a conspiracy theory to think that would be hidden, but in fact, most people never learn that fact."}, {"time": 7555, "text": "So just to clarify, just a general high level statement, the more medicine you take, the less healthy you are."}, {"time": 7564, "text": "Randomized experiments don't find that fact."}, {"time": 7564, "text": "Do not find that more medicine makes you more healthy."}, {"time": 7570, "text": "There's just no connection."}, {"time": 7570, "text": "In randomized experiments, there's no relationship between more medicine and being healthier."}, {"time": 7576, "text": "So it's not a negative relationship, but it's just no relationship."}, {"time": 7580, "text": "And so the conspiracy theory would say that the businesses that sell you medicine don't want you to know that fact."}, {"time": 7587, "text": "And then you're saying that there's also part of this is that people just don't want to know."}, {"time": 7593, "text": "They just don't want to know."}, {"time": 7593, "text": "And so they don't learn this."}, {"time": 7593, "text": "So I've lived in the Washington area for several decades now, reading the Washington Post regularly."}, {"time": 7598, "text": "Every week there was a special section on health and medicine."}, {"time": 7604, "text": "It never was mentioned in that section of the paper in all the 20 years I read that."}, {"time": 7610, "text": "So do you think there is some truth to this caricatured blue pill, red pill, where most people don't want to know the truth?"}, {"time": 7618, "text": "There are many things about which people don't want to know certain kinds of truths."}, {"time": 7622, "text": "That is bad looking truths, truths that discouraging, truths that sort of take away the justification for things they feel passionate about."}, {"time": 7630, "text": "Do you think that's a bad aspect of human nature?"}, {"time": 7630, "text": "That's something we should try to overcome?"}, {"time": 7636, "text": "Well, as we discussed, my first priority is to just tell people about it, to do the analysis and the cold facts of what's actually happening, and then to try to be careful about how we can improve."}, {"time": 7646, "text": "So our book, The Elephant in the Rain, coauthored with Kevin Simler, is about how we hide motives in everyday life."}, {"time": 7650, "text": "And our first priority there is just to explain to you what are the things that you are not looking at that you have reluctant to look at."}, {"time": 7655, "text": "And many people try to take that book as a self help book where they're trying to improve themselves and make sure they look at more things."}, {"time": 7664, "text": "And that often goes badly because it's harder to actually do that than you think."}, {"time": 7669, "text": "But we at least want you to know that this truth is available if you want to learn about it."}, {"time": 7676, "text": "It's the Nietzsche, if you gaze long into the abyss, the abyss gazes into you."}, {"time": 7676, "text": "Let's talk about this elephant in the brain."}, {"time": 7681, "text": "Amazing book."}, {"time": 7681, "text": "The elephant in the room is, quote, an important issue that people are reluctant to acknowledge or address a social taboo."}, {"time": 7688, "text": "The elephant in the brain is an important but unacknowledged feature of how our mind works, an introspective taboo."}, {"time": 7700, "text": "You describe selfishness and self deception as the core or some of the core elephants, some of the elephants, elephant offspring in the brain."}, {"time": 7708, "text": "Selfishness and self deception."}, {"time": 7716, "text": "Can you explain, can you explain why these are the taboos in our brain that we don't want to acknowledge to ourselves?"}, {"time": 7726, "text": "Your conscious mind, the one that's listening to me that I'm talking to at the moment, you like to think of yourself as the president or king of your mind, ruling over all that you see, issuing commands that immediately obeyed."}, {"time": 7738, "text": "You are instead better understood as the press secretary of your brain."}, {"time": 7746, "text": "You don't make decisions."}, {"time": 7746, "text": "You justify them to an audience."}, {"time": 7746, "text": "That's what your conscious mind is for."}, {"time": 7752, "text": "You watch what you're doing and you try to come up with stories that explain what you're doing so that you can avoid accusations of violating norms."}, {"time": 7760, "text": "So humans compared to most other animals have norms, and this allows us to manage larger groups with our morals and norms about what we should or shouldn't be doing."}, {"time": 7772, "text": "This is so important to us that we needed to be constantly watching what we were doing in order to make sure we had a good story to avoid norm violations."}, {"time": 7783, "text": "So many norms are about motives."}, {"time": 7783, "text": "So if I hit you on purpose, that's a big violation."}, {"time": 7788, "text": "If I hit you accidentally, that's okay."}, {"time": 7788, "text": "I need to be able to explain why it was an accident and not on purpose."}, {"time": 7794, "text": "So where does that need come from for your own self preservation?"}, {"time": 7798, "text": "So humans have norms and we have the norm that if we see anybody violating a norm, we need to tell other people and then coordinate to make them stop and punish them for violating."}, {"time": 7809, "text": "So such benefits are strong enough and severe enough that we each want to avoid being successfully accused of violating norms."}, {"time": 7815, "text": "So for example, hitting someone on purpose is a big clear norm violation."}, {"time": 7821, "text": "If we do it consistently, we may be thrown out of the group and that would mean we would die."}, {"time": 7825, "text": "So we need to be able to convince people we are not going around hitting people on purpose."}, {"time": 7830, "text": "If somebody happens to be at the other end of our fist and their face connects, that was an accident and we need to be able to explain that."}, {"time": 7837, "text": "And similarly for many other norms humans have, we are serious about these norms and we don't want people to violate."}, {"time": 7843, "text": "We find them violating, we're going to accuse them."}, {"time": 7848, "text": "But many norms have a motive component."}, {"time": 7848, "text": "And so we are trying to explain ourselves and make sure we have a good motive story about everything we do, which is why we're constantly trying to explain what we're doing."}, {"time": 7858, "text": "And that's what your conscious mind is doing."}, {"time": 7862, "text": "It is trying to make sure you've got a good motive story for everything you're doing."}, {"time": 7867, "text": "And that's why you don't know why you really do things."}, {"time": 7867, "text": "What you know is what the good story is about why you've been doing things."}, {"time": 7872, "text": "And that's the self deception."}, {"time": 7872, "text": "And you're saying that there is a machine, the actual dictator is selfish."}, {"time": 7877, "text": "And then you're just the press secretary who's desperately doesn't want to get fired and is justifying all of the decisions of the dictator."}, {"time": 7891, "text": "Now, most people actually are willing to believe that this is true in the abstract."}, {"time": 7891, "text": "So our book has been classified as psychology and it was reviewed by psychologists."}, {"time": 7896, "text": "And the basic way that psychology referees and reviewers responded is to say, this is well known."}, {"time": 7901, "text": "Most people accept that there's a fair bit of self deception."}, {"time": 7909, "text": "But they don't want to accept it about themselves."}, {"time": 7911, "text": "Well, they don't want to accept it about the particular topics that we talk about."}, {"time": 7911, "text": "So people accept the idea in the abstract that they might be self deceived or that they might not be honest about various things."}, {"time": 7920, "text": "But that hasn't penetrated into the literatures where people are explaining particular things like why we go to school, why we go to the doctor, why we vote, et cetera."}, {"time": 7925, "text": "So our book is mainly about 10 areas of life and explaining about in each area what our actual motives there are."}, {"time": 7936, "text": "And people who study those things have not admitted that hidden motives are explaining those particular areas."}, {"time": 7945, "text": "So they haven't taken the leap from theoretical psychology to actual public policy."}, {"time": 7950, "text": "And economics and all that kind of stuff."}, {"time": 7950, "text": "Well, let me just linger on this and bring up my old friends Zingman Freud and Carl Jung."}, {"time": 7958, "text": "So how vast is this landscape of the unconscious mind, the power and the scope of the dictator?"}, {"time": 7967, "text": "Is it only dark there?"}, {"time": 7967, "text": "Is it some light?"}, {"time": 7967, "text": "Is there some love?"}, {"time": 7976, "text": "The vast majority of what's happening in your head, you're unaware of."}, {"time": 7976, "text": "So in a literal sense, the unconscious, the aspects of your mind that you're not conscious of is the overwhelming majority."}, {"time": 7987, "text": "But that's just true in a literal engineering sense."}, {"time": 7987, "text": "Your mind is doing lots of low level things, and you just can't be consciously aware of all that low level stuff."}, {"time": 7992, "text": "But there's plenty of room there for lots of things you're not aware of."}, {"time": 8001, "text": "But can we try to shine a light at the things we're unaware of specifically?"}, {"time": 8001, "text": "Now, again, staying with the philosophical psychology side for a moment, can you shine a light in the Jungian shadow?"}, {"time": 8012, "text": "What's going on there?"}, {"time": 8012, "text": "What is this machine like?"}, {"time": 8012, "text": "What level of thoughts are happening there?"}, {"time": 8020, "text": "Is it something that we can even interpret?"}, {"time": 8020, "text": "If we somehow could visualize it, is it something that's human interpretable?"}, {"time": 8026, "text": "Or is it just a kind of chaos of monitoring different systems in the body, making sure you're happy, making sure you're fed all those kind of basic forces that form abstractions on top of each other, and they're not introspective at all?"}, {"time": 8041, "text": "We humans are social creatures."}, {"time": 8041, "text": "Plausibly being social is the main reason we have these unusually large brains."}, {"time": 8046, "text": "Therefore, most of our brain is devoted to being social."}, {"time": 8046, "text": "And so the things we are very obsessed with and constantly paying attention to are, how do I look to others?"}, {"time": 8053, "text": "What would others think of me if they knew these various things they might learn about me?"}, {"time": 8063, "text": "So that's close to being fundamental to what it means to be human, is caring what others think."}, {"time": 8068, "text": "To be trying to present a story that would be okay for what others think."}, {"time": 8068, "text": "But we're very constantly thinking, what do other people think?"}, {"time": 8076, "text": "So let me ask you this question then about you, Robin Hansen, who in many places, sometimes for fun, sometimes as a basic statement of principle, likes to disagree with what the majority of people think."}, {"time": 8092, "text": "So how do you explain, how are you self deceiving yourself in this task?"}, {"time": 8092, "text": "And how are you being self, like, why is the dictator manipulating you inside your head to be so critical?"}, {"time": 8102, "text": "Like, there's norms."}, {"time": 8108, "text": "Why do you want to stand out in this way?"}, {"time": 8108, "text": "Why do you want to challenge the norms in this way?"}, {"time": 8115, "text": "Almost by definition, I can't tell you what I'm deceiving myself about."}, {"time": 8115, "text": "But the more practical strategy that's quite feasible is to ask about what are typical things that most people deceive themselves about, and then to own up to those particular things."}, {"time": 8129, "text": "What's a good one?"}, {"time": 8132, "text": "So for example, I can very much acknowledge that I would like to be well thought of, that I would be seeking attention and glory and praise from my intellectual work, and that that would be a major agenda driving my intellectual attempts."}, {"time": 8147, "text": "So if there were topics that other people would find less interesting, I might be less interested in those for that reason, for example."}, {"time": 8159, "text": "I might want to find topics where other people are interested, and I might want to go for the glory of finding a big insight rather than a small one, and maybe one that was especially surprising."}, {"time": 8173, "text": "That's also, of course, consistent with some more ideal concept of what an intellectual should be."}, {"time": 8179, "text": "But most intellectuals are relatively risk averse."}, {"time": 8179, "text": "They are in some local intellectual tradition, and they are adding to that, and they are staying conforming to the sort of usual assumptions and usual accepted beliefs and practices of a particular area so that they can be accepted in that area and treated as part of the community."}, {"time": 8197, "text": "But you might think for the purpose of the larger intellectual project of understanding the world better, people should be less eager to just add a little bit to some tradition, and they should be looking for what's neglected between the major traditions and major questions."}, {"time": 8215, "text": "They should be looking for assumptions maybe we're making that are wrong."}, {"time": 8219, "text": "They should be looking at things that are very surprising, things that you would have thought a priori unlikely that once you are convinced of it, you find that to be very important and a big update."}, {"time": 8230, "text": "So you could say that one motivation I might have is less motivated to be sort of comfortably accepted into some particular intellectual community and more willing to just go for these more fundamental long shots that should be very important if you could find them."}, {"time": 8255, "text": "Which would, if you can find them, would get you appreciated across a larger number of people across the longer time span of history."}, {"time": 8265, "text": "So like maybe the small local community will say, you suck, you must conform."}, {"time": 8272, "text": "But the larger community will see the brilliance of you breaking out of the cage of the small conformity into a larger cage."}, {"time": 8280, "text": "There's always a bigger cage and then you'll be remembered by more."}, {"time": 8286, "text": "Also that explains your choice of colorful shirt that looks great in a black background."}, {"time": 8293, "text": "So you definitely stand out."}, {"time": 8297, "text": "Now, of course, you could say, well, you could get all this attention by making false claims of dramatic improvement."}, {"time": 8302, "text": "And then wouldn't that be much easier than actually working through all the details to make true claims?"}, {"time": 8310, "text": "Let me ask the press secretary."}, {"time": 8310, "text": "So of course you spoke several times about how much you value truth and the pursuit of truth."}, {"time": 8317, "text": "That's a very nice narrative."}, {"time": 8317, "text": "Hitler and Stalin also talked about the value of truth."}, {"time": 8323, "text": "Do you worry when you introspect as broadly as all humans might that it becomes a drug, this being a martyr, being the person who points out that the emperor wears no clothes, even when the emperor is obviously dressed, just to be the person who points out that the emperor is wearing no clothes."}, {"time": 8354, "text": "So I think the standards you hold yourself to are dependent on the audience you have in mind."}, {"time": 8363, "text": "So if you think of your audience as relatively easily fooled or relatively gullible, then you won't bother to generate more complicated, deep, you know, arguments and structures and evidence to persuade somebody who has higher standards because why bother?"}, {"time": 8382, "text": "Why bother?"}, {"time": 8382, "text": "You can get away with something much easier."}, {"time": 8382, "text": "And of course, if you are, say, a salesperson, you know, you make money on sales, then you don't need to convince the top few percent of the most sharp customers."}, {"time": 8393, "text": "You can just go for the bottom 60 percent of the most gullible customers and make plenty of sales, right?"}, {"time": 8398, "text": "So I think intellectuals have to vary."}, {"time": 8398, "text": "One of the main ways intellectuals vary is in who is their audience in their mind?"}, {"time": 8406, "text": "Who are they trying to impress?"}, {"time": 8409, "text": "Is it the people down the hall?"}, {"time": 8409, "text": "Is it the people who are reading their Twitter feed?"}, {"time": 8409, "text": "Is it their parents?"}, {"time": 8415, "text": "Is it their high school teacher?"}, {"time": 8415, "text": "Or is it Einstein and Freud and Socrates, right?"}, {"time": 8424, "text": "So I think those of us who are especially arrogant, especially think that we're really big shot or have a chance at being a really big shot, we were naturally going to pick the big shot audience that we can."}, {"time": 8434, "text": "We're going to be trying to impress Socrates and Einstein."}, {"time": 8439, "text": "Is that why you hang out with Tyler Cohen a lot and try to convince him yourself?"}, {"time": 8444, "text": "And you might think, you know, from the point of view of just making money or having sex or other sorts of things, this is misdirected energy, right?"}, {"time": 8448, "text": "Trying to impress the very most highest quality minds."}, {"time": 8454, "text": "That's such a small sample and they can't do that much for you anyway."}, {"time": 8459, "text": "So I might well have had more, you know, ordinary success in life, be more popular, invited to more parties, make more money if I had targeted a lower tier set of intellectuals with the standards they have."}, {"time": 8471, "text": "But for some reason I decided early on that Einstein was my audience or people like him and I was going to impress them."}, {"time": 8483, "text": "I mean, you pick your set of motivations, you know, convincing, impressing Tyler Cohen is not going to help you get laid."}, {"time": 8487, "text": "Trust me, I tried."}, {"time": 8494, "text": "What are some notable sort of effects of the elephant in the brain in everyday life?"}, {"time": 8494, "text": "So you mentioned when we try to apply that to economics, to public policy."}, {"time": 8503, "text": "So when we think about medicine, education, all those kinds of things, what are some things that we're..."}, {"time": 8513, "text": "The key thing is medicine is much less useful health wise than you think."}, {"time": 8513, "text": "So, you know, if you were focused on your health, you would care a lot less about it."}, {"time": 8519, "text": "And if you were focused on other people's health, you would also care a lot less about it."}, {"time": 8524, "text": "But if medicine is, as we suggest, more about showing that you care and let other people showing that they care about you, then a lot of priority on medicine can make sense."}, {"time": 8533, "text": "So that was our very earliest discussion in the podcast."}, {"time": 8538, "text": "You were talking about what, you know, should you give people a lot of medicine when it's not very effective?"}, {"time": 8542, "text": "And then the answer then is, well, if that's the way that you show that you care about them and you really want them to know you care, then maybe that's what you need to do if you can't find a cheaper, more effective substitute."}, {"time": 8552, "text": "So if we actually just pause on that for a little bit, how do we start to untangle the full set of self deception happening in the space of medicine?"}, {"time": 8564, "text": "So we have a method that we use in our book that is what I recommend for people to use in all these sorts of topics."}, {"time": 8569, "text": "The straightforward method is first, don't look at yourself."}, {"time": 8574, "text": "Look at other people, look at broad patterns of behavior and other people, and then ask, what are the various theories we could have to explain these patterns of behavior?"}, {"time": 8580, "text": "And then just do the simple matching, which theory better matches the behavior they have."}, {"time": 8585, "text": "And the last step is to assume that's true of you too."}, {"time": 8591, "text": "Don't assume you're an exception."}, {"time": 8591, "text": "If you happen to be an exception, that won't go so well, but nevertheless, on average, you aren't very well positioned to judge if you're an exception."}, {"time": 8602, "text": "So look at what other people do, explain what other people do, and assume that's you too."}, {"time": 8607, "text": "But also in the case of medicine, there's several parties to consider."}, {"time": 8614, "text": "So there's the individual person that's receiving the medicine."}, {"time": 8614, "text": "There's the doctors that are prescribing the medicine."}, {"time": 8618, "text": "There's drug companies that are selling drugs."}, {"time": 8618, "text": "There are governments that have regulations that are lobbyists."}, {"time": 8625, "text": "So you can build up a network of categories of humans in this and they each play their role."}, {"time": 8631, "text": "So how do you introspect the sort of analyze the system at a system scale versus at the individual scale?"}, {"time": 8640, "text": "So it turns out that in general, it's usually much easier to explain producer behavior than consumer behavior."}, {"time": 8647, "text": "That is, the drug companies or the doctors have relatively clear incentives to give the customers whatever they want."}, {"time": 8653, "text": "And so many say governments in democratic countries have the incentive to give the voters what they want."}, {"time": 8664, "text": "So that focuses your attention on the patient and the voter in this equation and saying, what do they want?"}, {"time": 8671, "text": "They would be driving the rest of the system."}, {"time": 8675, "text": "Whatever they want, the other parties are willing to give them in order to get paid."}, {"time": 8675, "text": "So now we're looking for puzzles in patient and voter behavior."}, {"time": 8682, "text": "What are they choosing?"}, {"time": 8682, "text": "And why do they choose that?"}, {"time": 8688, "text": "And how much exactly?"}, {"time": 8688, "text": "And then we can explain that potentially again, returning to the producer, but the producer being incentivized to manipulate the decision making processes of the voter and the consumer."}, {"time": 8700, "text": "Now, in almost every industry, producers are in general happy to lie and exaggerate in order to get more customers."}, {"time": 8707, "text": "This is true of auto repair as much as human body repair and medicine."}, {"time": 8711, "text": "So the differences between these industries can't be explained by the willingness of the producers to give customers what they want or to do various things that we have to again, go to the customers."}, {"time": 8720, "text": "Why are customers treating body repair different than auto repair?"}, {"time": 8726, "text": "Yeah, and that potentially requires a lot of thinking, a lot of data collection and potentially looking at historical data too, because things don't just happen overnight."}, {"time": 8739, "text": "Over time, there's trends."}, {"time": 8739, "text": "In principle it does, but actually it's a lot, actually easier than you might think."}, {"time": 8743, "text": "I think the biggest limitation is just the willingness to consider alternative hypotheses."}, {"time": 8747, "text": "So many of the patterns that you need to rely on are actually pretty obvious, simple patterns."}, {"time": 8753, "text": "You just have to notice them and ask yourself, how can I explain those?"}, {"time": 8758, "text": "Often you don't need to look at the most subtle, most difficult statistical evidence that might be out there."}, {"time": 8764, "text": "The simplest patterns are often enough."}, {"time": 8764, "text": "So there's a fundamental statement about self deception in the book."}, {"time": 8770, "text": "There's the application of that, like we just did in medicine."}, {"time": 8774, "text": "Can you steel man the argument that many of the foundational ideas in the book are wrong?"}, {"time": 8782, "text": "Meaning there's two that you just made, which is it can be a lot simpler than it looks."}, {"time": 8791, "text": "Can you steel man the case that it's, case by case, it's always super complicated."}, {"time": 8791, "text": "Like it's a complex system."}, {"time": 8798, "text": "It's very difficult to have a simple model about."}, {"time": 8798, "text": "It's very difficult to introspect."}, {"time": 8802, "text": "And the other one is that the human brain isn't, not just about self deception."}, {"time": 8802, "text": "That there's a lot of, there's a lot of motivations at play and we are able to really introspect our own mind."}, {"time": 8817, "text": "And like what, what's on the surface of the conscious is actually quite a good representation of what's going on in the brain."}, {"time": 8823, "text": "And you're not deceiving yourself."}, {"time": 8823, "text": "You're able to actually arrive to deeply think about where your mind stands and what you think about the world."}, {"time": 8827, "text": "And it's less about impressing people and more about being a free thinking individual."}, {"time": 8838, "text": "So when a child tries to explain why they don't have their homework assignment, they are sometimes inclined to say, the dog ate my homework."}, {"time": 8846, "text": "They almost never say the dragon ate my homework."}, {"time": 8852, "text": "The reason is the dragon is a completely implausible explanation."}, {"time": 8852, "text": "Almost always when we make excuses for things, we choose things that are at least in some degree plausible."}, {"time": 8858, "text": "It could perhaps have happened."}, {"time": 8864, "text": "That's an obstacle for any explanation of a hidden motive or a hidden feature of human behavior."}, {"time": 8871, "text": "If people are pretending one thing while really doing another, they're usually going to pick as a pretense something that's somewhat plausible."}, {"time": 8877, "text": "That's going to be an obstacle to proving that hypothesis if you are focused on sort of the local data that a person would typically have if they were challenged."}, {"time": 8889, "text": "So if you're just looking at one kid and his lack of homework, maybe you can't tell whether his dog ate his homework or not."}, {"time": 8898, "text": "If you happen to know he doesn't have a dog, you might have more confidence."}, {"time": 8898, "text": "You will need to have a wider range of evidence than a typical person would when they're encountering that actual excuse in order to see past the excuse."}, {"time": 8909, "text": "That will just be a general feature of it."}, {"time": 8909, "text": "So if I say, there's this usual story about where we go to the doctor and then there's this other explanation, it'll be true that you'll have to look at wider data in order to see that because people don't usually offer excuses unless in the local context of their excuse, they can get away with it."}, {"time": 8927, "text": "That is, it's hard to tell, right?"}, {"time": 8933, "text": "So in the case of medicine, I have to point you to sort of larger sets of data."}, {"time": 8938, "text": "But in many areas of academia, including health economics, the researchers there also want to support the usual points of view."}, {"time": 8947, "text": "And so they will have selection effects in their publications and their analysis whereby they, if they're getting a result too much contrary to the usual point of view everybody wants to have, they will file drawer that paper or redo the analysis until they get an answer that's more to people's liking."}, {"time": 8964, "text": "So that means in the health economics literature, there are plenty of people who will claim that in fact, we have evidence that medicine is effective."}, {"time": 8974, "text": "And when I respond, I will have to point you to our most reliable evidence."}, {"time": 8981, "text": "And ask you to consider the possibility that the literature is biased in that when the evidence isn't as reliable, when they have more degrees of freedom in order to get the answer they want, they do tend to get the answer they want."}, {"time": 8990, "text": "But when we get to the kind of evidence that's much harder to mess with, that's where we will see the truth be more revealed."}, {"time": 8995, "text": "So with respect to medicine, we have millions of papers published in medicine over the years, most of which give the impression that medicine is useful."}, {"time": 9007, "text": "There's a small literature on randomized experiments of the aggregate effects of medicine, where there's maybe a few half dozen or so papers, where it would be the hardest to hide it because it's such a straightforward experiment done in a straightforward way that it's hard to manipulate."}, {"time": 9028, "text": "And that's where I will point you to."}, {"time": 9034, "text": "Manipulate."}, {"time": 9034, "text": "And that's where I will point you to, to show you that there's relatively little correlation between health and medicine."}, {"time": 9039, "text": "But even then, people could try to save the phenomenon and say, well, it's not hidden motives."}, {"time": 9043, "text": "It's just ignorance."}, {"time": 9043, "text": "They could say, for example, you know, medicine's complicated."}, {"time": 9047, "text": "Most people don't know the literature."}, {"time": 9053, "text": "Therefore, they can be excused for ignorance."}, {"time": 9053, "text": "They are just ignorantly assuming that medicine is effective."}, {"time": 9059, "text": "It's not that they have some other motive that they're trying to achieve."}, {"time": 9062, "text": "And then I will have to do, you know, as with a conspiracy theory analysis, I'm saying, well, like, how long has this misperception been going on?"}, {"time": 9067, "text": "How consistently has it happened around the world and across time?"}, {"time": 9072, "text": "And I would have to say, look, you know, if we're talking about, say, a recent new product, like Segway scooters or something, I could say not so many people have seen them or used them."}, {"time": 9084, "text": "Maybe they could be confused about their value."}, {"time": 9084, "text": "If we're talking about a product that's been around for thousands of years, used in roughly the same way all across the world, and we see the same pattern over and over again, this sort of ignorance mistake just doesn't work so well."}, {"time": 9098, "text": "It also is a question of how much of the self deception is prevalent versus foundational."}, {"time": 9107, "text": "Because there's a kind of implied thing where it's foundational to human nature versus just a common pitfall."}, {"time": 9112, "text": "This is a question I have."}, {"time": 9112, "text": "So, like, maybe human progress is made by people who don't fall into the self deception."}, {"time": 9121, "text": "It's a baser aspect of human nature, but then you escape it easily if you're motivated."}, {"time": 9132, "text": "The motivational hypotheses about the self deceptions are in terms of how it makes you look to the people around you."}, {"time": 9137, "text": "Again, the press secretary."}, {"time": 9137, "text": "So, the story would be, most people want to look good to the people around them."}, {"time": 9143, "text": "Therefore, most people present themselves in ways that help them look good to the people around them."}, {"time": 9148, "text": "That's sufficient to say there would be a lot of it."}, {"time": 9155, "text": "It doesn't need to be 100%, right?"}, {"time": 9155, "text": "There's enough variety in people and in circumstances that sometimes taking a contrarian strategy can be in the interest of some minority of the people."}, {"time": 9164, "text": "So, I might, for example, say that that's a strategy I've taken."}, {"time": 9164, "text": "I've decided that being contrarian on these things could be winning for me in that there's a room for a small number of people like me who have these sort of messages who can then get more attention, even if there's not room for most people to do that."}, {"time": 9184, "text": "And that can be explaining sort of the variety, right?"}, {"time": 9191, "text": "Similarly, you might say, look, just look at the most obvious things."}, {"time": 9191, "text": "Most people would like to look good, right?"}, {"time": 9195, "text": "In the sense of physically, just you look good right now."}, {"time": 9195, "text": "You're wearing a nice suit, you have a haircut, you shaved, right?"}, {"time": 9198, "text": "So, and we cut my own hair by the way."}, {"time": 9203, "text": "Well, that's all the more impressive."}, {"time": 9203, "text": "That's a counter argument for your claim."}, {"time": 9209, "text": "So, clearly, if we look at most people and their physical appearance, clearly, most people are trying to look somewhat nice, right?"}, {"time": 9213, "text": "They shower, they shave, they comb their hair, but we certainly see some people around who are not trying to look so nice, right?"}, {"time": 9218, "text": "Is that a big challenge, the hypothesis that people want to look nice?"}, {"time": 9222, "text": "Not that much, right?"}, {"time": 9222, "text": "We can see in those particular people's context, more particular reasons why they've chosen to be an exception to the more general rule."}, {"time": 9235, "text": "So, the general rule does reveal something foundational generally."}, {"time": 9241, "text": "That's the way things work."}, {"time": 9241, "text": "Let me ask you, you wrote a blog post about the general rule, let me ask you, you wrote a blog post about the accuracy of authorities since we're talking about this, especially in medicine."}, {"time": 9250, "text": "Just looking around us, especially during this time of the pandemic, there's been a growing distrust of authorities, of institutions, even the institution of science itself."}, {"time": 9264, "text": "What are the pros and cons of authorities, would you say?"}, {"time": 9264, "text": "So, what's nice about authorities?"}, {"time": 9273, "text": "What's nice about institutions?"}, {"time": 9273, "text": "And what are their pitfalls?"}, {"time": 9280, "text": "One standard function of authority is as something you can defer to, respectively, without needing to seem too submissive or ignorant or, you know, gullible."}, {"time": 9285, "text": "That is, you know, when you're asking what should I act on or what beliefs should I act on, you might be worried if I chose something too contrarian, too weird, too speculative, that that would make me look bad."}, {"time": 9307, "text": "So, I would just choose something very conservative."}, {"time": 9313, "text": "So, maybe an authority lets you choose something a little less conservative because the authority is your authorization."}, {"time": 9319, "text": "The authority will let you do it."}, {"time": 9319, "text": "And you can say, and somebody says, why did you do that thing?"}, {"time": 9323, "text": "And they say, the authority authorized it."}, {"time": 9323, "text": "The authority tells me, I should do this."}, {"time": 9328, "text": "Why aren't you doing it, right?"}, {"time": 9330, "text": "So, the authority is often pushing for the conservative?"}, {"time": 9334, "text": "Well, no, the authority can do more."}, {"time": 9334, "text": "I mean, so for example, we just think about, I don't know, in a pandemic even, right?"}, {"time": 9338, "text": "You could just think, I'll just stay home and close all the doors or I'll just ignore it, right?"}, {"time": 9343, "text": "You could just think of just some very simple strategy that might be defensible if there were no authorities, right?"}, {"time": 9346, "text": "But authorities might be able to know more than that."}, {"time": 9351, "text": "They might be able to like look at some evidence, draw a more context dependent conclusion, declare it as the authority's opinion."}, {"time": 9357, "text": "And then other people might follow that and that could be better than doing nothing."}, {"time": 9361, "text": "So, what you mentioned, WHO, the world's most beloved organization."}, {"time": 9366, "text": "So, this is me speaking in general, WHO and CDC has been kind of, I, depending on degrees and details, just not behaving as I would have imagined in the best possible evolution of human civilization, authorities should act."}, {"time": 9389, "text": "They seem to have failed in some fundamental way in terms of leadership in a difficult time for our society."}, {"time": 9395, "text": "Can you say what are the pros and cons of this particular authority?"}, {"time": 9402, "text": "So, again, if there were no authorities whatsoever, no accepted authorities, then people would sort of have to sort of randomly pick different local authorities who would conflict with each other."}, {"time": 9415, "text": "And then they'd be fighting each other about that, or just not believe anybody and just do some initial default action that you would always do without responding to context."}, {"time": 9423, "text": "So, the potential gain of an authority is that they could know more than just basic ignorance."}, {"time": 9429, "text": "And if people followed them, they could both be more informed than ignorance and all doing the same thing."}, {"time": 9435, "text": "So, they're each protected from being accused or complained about."}, {"time": 9440, "text": "That's the idea of an authority."}, {"time": 9440, "text": "That would be the good."}, {"time": 9440, "text": "What's the con of that?"}, {"time": 9446, "text": "How does that go wrong?"}, {"time": 9446, "text": "So, the con is that if you think of yourself as the authority and asking what's my best strategy as an authority, it's unfortunately not to be maximally informative."}, {"time": 9460, "text": "So, you might think the ideal authority would not just tell you more than ignorance, it would tell you as much as possible."}, {"time": 9465, "text": "It would give you as much detail as you could possibly listen to and manage to assimilate."}, {"time": 9471, "text": "And it would update that as frequently as possible or as frequently as you were able to listen and assimilate."}, {"time": 9477, "text": "And that would be the maximally informative authority."}, {"time": 9477, "text": "The problem is there's a conflict between being an authority or being seen as an authority and being maximally informative."}, {"time": 9490, "text": "That was the point of my blog post that you're pointing out to here."}, {"time": 9490, "text": "That is, if you look at it from their point of view, they won't long remain the perceived authority if they are too cautious, incautious about how they use that authority."}, {"time": 9503, "text": "And one of the ways to be incautious would be to be too informative."}, {"time": 9511, "text": "That's still in the pro column for me because you're talking about the tensions that are very data driven and very honest."}, {"time": 9517, "text": "And I would hope that authorities struggle with that."}, {"time": 9524, "text": "How much information to provide to people to maximize outcomes."}, {"time": 9532, "text": "Now I'm generally somebody that believes more information is better because I trust the intelligence of people."}, {"time": 9537, "text": "But I'd like to mention a bigger con on authorities, which is the human question."}, {"time": 9543, "text": "This comes back to a global government and so on."}, {"time": 9543, "text": "Is that, you know, there's humans that sit in chairs during meetings and those authorities, they have different titles."}, {"time": 9551, "text": "It's for humans form hierarchies."}, {"time": 9556, "text": "And sometimes those titles get to your head a little bit and you start to want to think, how do I preserve my control over this authority?"}, {"time": 9560, "text": "As opposed to thinking through like, what is the mission of the authority?"}, {"time": 9566, "text": "What is the mission of WHO and the other such organization?"}, {"time": 9572, "text": "And how do I maximize the implementation of that mission?"}, {"time": 9572, "text": "You start to think, well, I kind of like sitting in this big chair at the head of the table."}, {"time": 9577, "text": "I'd like to sit there for another few years or better yet, I want to be remembered as the person who in a time of crisis was at the head of this authority and did a lot of good things."}, {"time": 9588, "text": "So you stop trying to do good under what good means given the mission of the authority."}, {"time": 9598, "text": "And you start to try to carve a narrative, to manipulate the narrative."}, {"time": 9603, "text": "First in the meeting room, everybody around you, just a small little story you tell yourself, the new interns, the managers throughout the whole hierarchy of the company."}, {"time": 9615, "text": "Okay, once everybody in the company or in the organization believes this narrative, now you start to control the release of information, not because you're trying to maximize outcomes, but because you're trying to maximize the effectiveness of the narrative that you are truly a great representative of this authority in human history."}, {"time": 9633, "text": "And I just feel like those human forces whenever you have an authority, it starts getting to people's heads."}, {"time": 9717, "text": "So this is core to sort of what it is to be an economist."}, {"time": 9726, "text": "I'm a professor of economics."}, {"time": 9726, "text": "There you go with the authority again."}, {"time": 9732, "text": "No, it's about saying, we often have a situation where we see a world of behavior and then we see ways in which particular behaviors are not sort of maximally socially useful."}, {"time": 9748, "text": "And we have a variety of reactions to that."}, {"time": 9748, "text": "So one kind of reaction is to sort of morally blame each individual for not doing the maximally socially useful thing under perhaps the idea that people could be identified and shamed for that and maybe induced into doing the better thing if only enough people were calling them out on it, right?"}, {"time": 9766, "text": "But another way to think about it is to think that people sit in institutions with certain stable institutional structures and that institutions create particular incentives for individuals and that individuals are typically doing whatever is in their local interest in the context of that institution."}, {"time": 9790, "text": "And then perhaps to less blame individuals for winning their local institutional game and more blaming the world for having the wrong institutions."}, {"time": 9795, "text": "So economists are often like wondering what other institutions we could have instead of the ones we have and which of them might promote better behavior."}, {"time": 9804, "text": "And this is a common thing we do all across human behavior is to think of what are the institutions we're in and what are the alternative variations we could imagine and then to say which institutions would be most productive."}, {"time": 9813, "text": "I would agree with you that our information institutions, that is the institutions by which we collect information and aggregate it and share it with people are especially broken in the sense of far from the ideal of what would be the most cost effective way to collect and share information."}, {"time": 9831, "text": "But then the challenge is to try to produce better institutions."}, {"time": 9836, "text": "And as an academic, I'm aware that academia is particularly broken in the sense that we give people incentives to do research that's not very interesting or important because basically they're being impressive."}, {"time": 9849, "text": "And we actually care more about whether academics are impressive than whether they're interesting or useful."}, {"time": 9860, "text": "And I can go happy to go into detail with lots of different known institutions and their known institutional failings, ways in which those institutions produce incentives that are mistaken."}, {"time": 9871, "text": "And that was the point of the post we started with talking about the authorities."}, {"time": 9871, "text": "If I need to be seen as an authority, that's at odds with my being informative and I might choose to be the authority instead of being informative because that's my institutional incentives."}, {"time": 9886, "text": "And if I may, I'd like to, given that beautiful picture of incentives and individuals that you just painted, let me just apologize for a couple of things."}, {"time": 9894, "text": "One, I often put too much blame on leaders of institutions versus the incentives that govern those institutions."}, {"time": 9903, "text": "And as a result of that, I've been, I believe too critical of Anthony Fauci, too emotional about my criticism of Anthony Fauci."}, {"time": 9920, "text": "And I'd like to apologize for that because I think there's a deep, there's deeper truths to think about."}, {"time": 9926, "text": "There's deeper incentives to think about."}, {"time": 9926, "text": "That said, I do sort of, I'm a romantic creature by nature."}, {"time": 9932, "text": "I romanticize Winston Churchill."}, {"time": 9932, "text": "When I think about Nazi Germany, I think about Hitler more than I do about the individual people of Nazi Germany."}, {"time": 9942, "text": "You think about leaders, you think about individuals, not necessarily the parameters, the incentives that govern the system that, because it's harder."}, {"time": 9951, "text": "It's harder to think through deeply about the models from which those individuals arise, but that's the right thing to do."}, {"time": 9958, "text": "So, but also I don't apologize for being emotional sometimes and being."}, {"time": 9967, "text": "I'm happy to blame the individual leaders in the sense that, you know, I might say, well, you should be trying to reform these institutions if you're just there to like get promoted and look good at being at the top."}, {"time": 9977, "text": "But maybe I can blame you for your motives and your priorities in there, but I can understand why the people at the top would be the people who are selected for having the priority of primarily trying to get to the top."}, {"time": 9989, "text": "Can I maybe ask you about particular universities?"}, {"time": 9989, "text": "They've received, like science has received an increase in distrust overall as an institution, which breaks my heart because I think science is beautiful as a, not maybe not as an institution, but as one of the things, one of the journeys that humans have taken on."}, {"time": 10011, "text": "The other one is university."}, {"time": 10011, "text": "I think university is actually a place for me, at least in the way I see it, is a place of freedom of exploring ideas, scientific ideas, engineering ideas, more than corporate, more than a company, more than a lot of domains in life."}, {"time": 10035, "text": "They're, it's not just in its ideal, but it's in its implementation, a place where you can be a kid for your whole life and play with ideas."}, {"time": 10042, "text": "And I think with all the criticism that universities still not currently receive, I think they, I don't think that criticism is representative of universities."}, {"time": 10055, "text": "They focus on very anecdotal evidence of particular departments, particular people, but I still feel like there's a lot of place for freedom of thought, at least MIT, at least in the fields I care about, in a particular kind of science, a particular kind of technical fields, mathematics, computer science, physics, engineering, so robotics, artificial intelligence."}, {"time": 10082, "text": "This is a place where you get to be a kid."}, {"time": 10082, "text": "Yet there is bureaucracy that's rising up."}, {"time": 10092, "text": "There's like more rules."}, {"time": 10092, "text": "There's more meetings and there's more administration having like PowerPoint presentations, which to me, you should like be more of a renegade explorer of ideas and meetings destroy, they suffocate that radical thought that happens when you're an undergraduate student and you can do all kinds of wild things when you're a graduate student."}, {"time": 10118, "text": "Anyway, all that to say, you've thought about this aspect too."}, {"time": 10118, "text": "Is there something positive, insightful you could say about how we can make for better universities in the decades to come?"}, {"time": 10130, "text": "This particular institution, how can we improve them?"}, {"time": 10134, "text": "I hear that centuries ago, many scientists and intellectuals were aristocrats."}, {"time": 10134, "text": "They had time and could, if they chose, choose to be intellectuals."}, {"time": 10143, "text": "That's a feature of the combination that they had some source of resources that allowed them leisure and that the kind of competition they were faced in among aristocrats allowed that sort of a self indulgence or self pursuit, at least at some point in their lives."}, {"time": 10164, "text": "So the analogous observation is that university professors often have sort of the freedom and space to do a wide range of things."}, {"time": 10179, "text": "And I am certainly enjoying that as a tenured professor."}, {"time": 10182, "text": "You're a really, sorry to interrupt, a really good representative of that."}, {"time": 10186, "text": "Just the exploration you're doing, the depth of thought, like most people are afraid to do the kind of broad thinking that you're doing, which is great."}, {"time": 10195, "text": "The fact that that can happen is a combination of these two things analogously."}, {"time": 10195, "text": "One is that we have fierce competition to become a tenured professor, but then once you become tenured, we give you the freedom to do what you like."}, {"time": 10205, "text": "And that's a happenstance."}, {"time": 10211, "text": "And in many other walks of life, even though people have a lot of resources, et cetera, they don't have that kind of freedom set up."}, {"time": 10216, "text": "So I think we're kind of, I'm kind of lucky that tenure exists and that I'm enjoying it."}, {"time": 10220, "text": "But I can't be too enthusiastic about this unless I can approve of sort of the source of the resources that's paying for all this."}, {"time": 10231, "text": "So for the aristocrat, if you thought they stole it in war or something, you wouldn't be so pleased."}, {"time": 10237, "text": "Whereas if you thought they had earned it or their ancestors had earned this money that they were spending as an aristocrat, then you could be more okay with that."}, {"time": 10241, "text": "So for universities, I have to ask, where are the main sources of resources that are going to the universities and are they getting their money's worth?"}, {"time": 10252, "text": "Are they getting a good value for that payment?"}, {"time": 10258, "text": "So first of all, they're students."}, {"time": 10258, "text": "And the question is, are students getting good value for their education?"}, {"time": 10263, "text": "And each person is getting value in the sense that they are identified and shown to be a more capable person, which is then worth more salary as an employee later."}, {"time": 10275, "text": "But there is a case for saying there's a big waste to the system because we aren't actually changing the students or educating them."}, {"time": 10281, "text": "We're more sorting them or labeling them."}, {"time": 10281, "text": "And that's a very expensive process to produce that outcome."}, {"time": 10287, "text": "And part of the expense is the freedom from tenure, I guess."}, {"time": 10293, "text": "So I feel like I can't be too proud of that because it's basically a tax on all these young students to pay this enormous amount of money in order to be labeled as better."}, {"time": 10298, "text": "Whereas I feel like we should be able to find cheaper ways of doing that."}, {"time": 10303, "text": "The other main customer is researcher patrons like the government or other foundations."}, {"time": 10309, "text": "And then the question is, are they getting their money worth out of the money they're paying for research to happen?"}, {"time": 10319, "text": "And my analysis is they don't actually care about the research progress."}, {"time": 10319, "text": "They are mainly buying an affiliation with credentialed impressiveness on the part of the researchers."}, {"time": 10329, "text": "They mainly pay money to researchers who are impressive and have high, you know, impressive affiliations."}, {"time": 10333, "text": "And they don't really much care what research project happens as a result."}, {"time": 10338, "text": "Is that a cynical?"}, {"time": 10338, "text": "So there's a deep truth to that cynical perspective."}, {"time": 10338, "text": "Is there a less cynical perspective that they do care about the long term investment into the progress of science and humanity?"}, {"time": 10352, "text": "Well, they might personally care, but they're stuck in an equilibrium."}, {"time": 10358, "text": "Wherein they, basically most foundations like governments or research or, you know, the Ford Foundation, they are, the individuals there are rated based on the prestige they bring to that organization."}, {"time": 10370, "text": "And even if they might personally want to produce more intellectual progress, they are in a competitive game where they don't have tenure and they need to produce this prestige."}, {"time": 10380, "text": "And so once they give grant money to prestigious people, that is the thing that shows that they have achieved prestige for the organization."}, {"time": 10384, "text": "And that's what they need to do in order to retain their position."}, {"time": 10388, "text": "And you do hope that there's a correlation between prestige and actual competence."}, {"time": 10394, "text": "Of course, there is a correlation."}, {"time": 10394, "text": "The question is just, could we do this better some other way?"}, {"time": 10399, "text": "I think it's almost, I think it's pretty clear we could."}, {"time": 10399, "text": "What is harder to do is move the world to a new equilibrium where we do that instead."}, {"time": 10405, "text": "What are the components of the better ways to do it?"}, {"time": 10411, "text": "So how, the sources of money and how the money is allocated to give the individual researchers freedom?"}, {"time": 10419, "text": "Years ago I started studying this topic exactly because this was my issue and this was many decades ago now."}, {"time": 10426, "text": "And I spent a long time and my best guess still is prediction markets, betting markets."}, {"time": 10431, "text": "So if you as a research paper patron want to know the answer to a particular question, like what's the mass of the electron neutrino, then what you can do is just subsidize a betting market in that question."}, {"time": 10449, "text": "And that will induce more research into answering that question because the people who then answer that question can then make money in that betting market with the new information they gain."}, {"time": 10457, "text": "So that's a robust way to induce more information on a topic."}, {"time": 10457, "text": "If you want to induce an accomplishment, you can create prizes."}, {"time": 10462, "text": "And there's of course a long history of prizes to induce accomplishments."}, {"time": 10468, "text": "And we moved away from prizes, even though we once used them far more often than we did today."}, {"time": 10475, "text": "And there's a history to that."}, {"time": 10475, "text": "And for the customers who want to be affiliated with impressive academics, which is what most of the customers want, students, journalists, and patrons, I think there's a better way of doing that, which I just wrote about in my second most recent blog post."}, {"time": 10493, "text": "What we do today is we take sort of acceptance by other academics recently as our best indication of their deserved prestige."}, {"time": 10499, "text": "That is recent publications, recent job affiliation, institutional affiliations, recent invitations to speak, recent grants."}, {"time": 10513, "text": "We are today taking other impressive academics, recent choices to affiliate with them as our best guesstimate of their prestige."}, {"time": 10521, "text": "I would say we could do better by creating betting markets in what the distant future will judge to have been their deserved prestige looking back on them."}, {"time": 10528, "text": "I think most intellectuals, for example, think that if we looked back two centuries, say to intellectuals from two centuries ago, and tried to look in detail at their research and how it influenced future research and which path it was on, we could much more accurately judge their actual deserved prestige."}, {"time": 10552, "text": "That is who was actually on the right track, who actually helped, which will be different than what people at the time judged using the immediate indications at the time of which position they had or which publications they had or things like that."}, {"time": 10591, "text": "You could, looking back centuries later, have a much better estimate of who actually had what long term effects on intellectual progress."}, {"time": 10601, "text": "So my proposal is we actually pay people in several centuries to do this historical analysis."}, {"time": 10607, "text": "And we have prediction markets today where we buy and sell assets, which will later off pay off in terms of those final evaluations."}, {"time": 10612, "text": "So now we'll be inducing people today to make their best estimate of those things by actually looking at the details of people and setting the prices accordingly."}, {"time": 10623, "text": "So my proposal would be we rate people today on those prices today."}, {"time": 10628, "text": "So instead of looking at their list of publications or affiliations, you look at the actual price of assets that represent people's best guess of what the future will say about them."}, {"time": 10638, "text": "So this concept of idea futures, can you elaborate what this would entail?"}, {"time": 10646, "text": "I've been elaborating two versions of it here."}, {"time": 10646, "text": "So one is if there's a particular question, say the mass of the electron neutrino, and what you as a patron want to do is get an answer to that question, then what you would do is subsidize the betting market in that question under the assumption that eventually we'll just know the answer and we can pay off the bets that way."}, {"time": 10667, "text": "And that is a plausible assumption for many kinds of concrete intellectual questions like what's the mass of the electron neutrino."}, {"time": 10671, "text": "In this hypothetical world that you're constructing that may be a real world, do you mean literally financial?"}, {"time": 10676, "text": "Literal."}, {"time": 10676, "text": "Very literal."}, {"time": 10676, "text": "Very cash."}, {"time": 10676, "text": "Very direct and literal."}, {"time": 10685, "text": "Or crypto."}, {"time": 10685, "text": "Well, crypto is money."}, {"time": 10685, "text": "So the idea would be research labs would be for profit."}, {"time": 10692, "text": "They would have as their expense paying researchers to study things and then their profit would come from using the insights the researchers gains to trade in these financial markets."}, {"time": 10702, "text": "Just like hedge funds today make money by paying researchers to study firms and then making their profits by trading on those that that insight in the ordinary financial market."}, {"time": 10713, "text": "And the market would, if it's efficient, would be able to become better and better at predicting the powerful ideas that the individual is able to generate."}, {"time": 10720, "text": "The variance around the mass of the electron neutrino would decrease with time as we learned that value of that parameter better and any other parameters that we wanted to estimate."}, {"time": 10729, "text": "You don't think those markets would also respond to recency of prestige and all those kinds of things?"}, {"time": 10733, "text": "They would respond, but the question is if they might respond incorrectly, but if you think they're doing it incorrectly, you have a profit opportunity where you can go fix it."}, {"time": 10743, "text": "So we'd be inviting everybody to ask whether they can find any biases or errors in the current ways in which people are estimating these things from whatever clues they have."}, {"time": 10754, "text": "There's a big incentive for the correction mechanism in academia currently."}, {"time": 10758, "text": "There's not, it's the safe choice to go with the prestige."}, {"time": 10758, "text": "And there's no."}, {"time": 10766, "text": "Even if you privately think that the prestige is over overrated."}, {"time": 10766, "text": "Even if you think strongly that it's overrated."}, {"time": 10773, "text": "Still you don't have an incentive to defy that publicly."}, {"time": 10773, "text": "You're going to lose a lot unless you're a contrarian that writes brilliant blogs and then you could talk about it in the pocket."}, {"time": 10784, "text": "I mean, initially this was my initial concept of having these betting markets on these key parameters."}, {"time": 10789, "text": "And what I then realized over time was that that's more what people pretend to care about."}, {"time": 10793, "text": "What they really mostly care about is just who's how good."}, {"time": 10793, "text": "And that's what most of the system is built on is trying to rate people and rank them."}, {"time": 10798, "text": "And so I designed this other alternative based on historical evaluation centuries later, just about who's how good, because that's what I think most of the customers really care about."}, {"time": 10810, "text": "Customers."}, {"time": 10810, "text": "I like the word customers here."}, {"time": 10810, "text": "Well, every major area of life, which, you know, has specialists who get paid to do that thing must have some customers from elsewhere who are paying for it."}, {"time": 10820, "text": "Well, who are the customers for the mass of the neutrino?"}, {"time": 10825, "text": "I, I, I understand that a sense people who are willing to pay."}, {"time": 10825, "text": "For a thing."}, {"time": 10833, "text": "That's an important thing to understand about anything."}, {"time": 10833, "text": "Who are the customers?"}, {"time": 10833, "text": "So when I think and what's the product, like medicine, education, academia, military, et cetera, that's part of the hidden motives analysis."}, {"time": 10842, "text": "Often people have a thing they say about what the product is and who the customer is."}, {"time": 10846, "text": "And maybe you need to dig a little deeper to find out what's really going on."}, {"time": 10850, "text": "Or a lot deeper."}, {"time": 10850, "text": "You, uh, you've written that you seek out quote view quakes."}, {"time": 10850, "text": "You're able as a, uh, as an intelligent black box word generating machine, you're able to generate a lot of sexy words."}, {"time": 10863, "text": "View quakes, which are insights, which dramatically changed my worldview, your worldview."}, {"time": 10870, "text": "Uh, you write, I loved science fiction as a child studied physics and artificial intelligence for a long time each, and now study economics and political science, all fields full of such insights."}, {"time": 10883, "text": "So let me ask, what are some view quakes or a beautiful, surprising idea to you from each of those fields, physics, AI, economics, political science?"}, {"time": 10896, "text": "I know it's a tough question."}, {"time": 10896, "text": "Something that springs to mind about physics, for example, that just as beautiful."}, {"time": 10900, "text": "I mean, right from the beginning, say special relativity was a big surprise."}, {"time": 10905, "text": "Uh, you know, most of us have a simple concept of time and it seems perfectly adequate for everything we've ever seen."}, {"time": 10911, "text": "And to have it explained to you that you need to sort of have a mixture concept of time and space where you put it into the space time construct, how it looks different from different perspectives."}, {"time": 10920, "text": "That was quite a shock."}, {"time": 10920, "text": "And that was, you know, such a shock that it makes you think, what else do I know that, you know, isn't the way it seems."}, {"time": 10926, "text": "Certainly quantum mechanics is certainly another enormous shock in terms of from your point, you know, you have this idea that there's a space and then there's, you know, point particles at points and maybe fields in between."}, {"time": 10941, "text": "And, um, quantum mechanics is just a whole different representation."}, {"time": 10941, "text": "It looks nothing like what you would have thought as sort of the basic representation of the physical world."}, {"time": 10952, "text": "And that was quite a surprise."}, {"time": 10952, "text": "What would you say is the catalyst for the, for the view quake in theoretical physics in the 20th century?"}, {"time": 10959, "text": "So the interesting thing about Einstein, it seems like a lot of that came from like almost thought experiments."}, {"time": 10963, "text": "It wasn't almost experimentally driven."}, {"time": 10967, "text": "Um, and with, actually, I don't know the full story of quantum mechanics, how much of it is experiment, like where, if you, if you look at the full trace of idea generation there, uh, of all the weird stuff that falls out of quantum mechanics, how much of that was the experimentalist?"}, {"time": 10987, "text": "How much was it the theoreticians?"}, {"time": 10987, "text": "But usually in theoretical physics, the theories lead the way."}, {"time": 10991, "text": "So maybe can you, uh, can you elucidate like what, what is the catalyst for these?"}, {"time": 10998, "text": "The remarkable thing about physics and about many other areas of academic intellectual life is that it just seems way overdetermined."}, {"time": 11004, "text": "That is, if it hadn't been for Einstein or if it hadn't been for Heisenberg, certainly within a half a century, somebody else would have come up with essentially the same things."}, {"time": 11016, "text": "Is that something you believe or is that something?"}, {"time": 11021, "text": "So I think when you look at sort of just the history of physics and the history of other areas, you know, some areas like that, there's just this enormous convergence that the, the different kinds of evidence that was being collected was so redundant in the sense that so many different things revealed the same things that eventually you just kind of have to accept it because it just gets obvious."}, {"time": 11042, "text": "So if you look at the details, of course, you know, Einstein did it for somebody else and it's well worth celebrating Einstein for that."}, {"time": 11048, "text": "And, you know, we, by celebrating the particular people who did something first or came across something first, we are encouraging all the rest to move a little faster, to try to, to push us all a little faster, which is great."}, {"time": 11065, "text": "But I still think we would have gotten roughly to the same place within a half century."}, {"time": 11072, "text": "So sometimes people are special because of how much longer it would have taken."}, {"time": 11072, "text": "So some people say general relativity would have taken longer without Einstein than other things."}, {"time": 11077, "text": "I mean, Heisenberg quantum mechanics, I mean, there were several different formulations of quantum mechanics all around the same few years, means no one of them made that much of a difference."}, {"time": 11086, "text": "We would have had pretty much the same thing regardless of which of them did it exactly when."}, {"time": 11091, "text": "Nevertheless, I'm happy to celebrate them all."}, {"time": 11096, "text": "But this is a choice I make in my research."}, {"time": 11096, "text": "That is, when there's an area where there's lots of people working together, you know, who are sort of scoping each other and getting a result just before somebody else does, you ask, well, how much of a difference would I make there?"}, {"time": 11110, "text": "At most, I could make something happen a few months before somebody else."}, {"time": 11110, "text": "And so I'm less worried about them missing things."}, {"time": 11116, "text": "So when I'm trying to help the world, like doing research, I'm looking for neglected things."}, {"time": 11121, "text": "I'm looking for things that nobody's doing it."}, {"time": 11121, "text": "If I didn't do it, nobody would do it."}, {"time": 11125, "text": "Nobody would do it."}, {"time": 11125, "text": "Or at least for a long time."}, {"time": 11125, "text": "In the next 10, 20 years, kind of thing."}, {"time": 11128, "text": "Same with general relativity, just, you know, who would do it?"}, {"time": 11133, "text": "It might take another 10, 20, 30, 50 years."}, {"time": 11133, "text": "So that's the place where you can have the biggest impact is finding the things that nobody would do unless you did them."}, {"time": 11140, "text": "And then that's when you get the big view quake, the insight."}, {"time": 11140, "text": "So what about artificial intelligence?"}, {"time": 11145, "text": "Would it be the EMs, the emulated minds?"}, {"time": 11145, "text": "What idea, whether that struck you in the shower one day or that you just... Clearly, the biggest view quake in artificial intelligence is the realization of just how complicated our human minds are."}, {"time": 11165, "text": "So most people who come to artificial intelligence from other fields or from relative ignorance, a very common phenomenon, which you must be familiar with, is that they come up with some concept and then they think that must be it."}, {"time": 11177, "text": "Once we implement this new concept, we will have it."}, {"time": 11182, "text": "We will have full human level or higher artificial intelligence, right?"}, {"time": 11187, "text": "And they're just not appreciating just how big the problem is, how long the road is, just how much is involved, because that's actually hard to appreciate."}, {"time": 11192, "text": "When we just think, it seems really simple."}, {"time": 11196, "text": "And studying artificial intelligence, going through many particular problems, looking at each problem, all the different things you need to be able to do to solve a problem like that, makes you realize all the things your minds are doing that you are not aware of."}, {"time": 11210, "text": "That's that vast subconscious that you're not aware of."}, {"time": 11210, "text": "That's the biggest view quake from artificial intelligence by far for most people who study artificial intelligence, is to see just how hard it is."}, {"time": 11219, "text": "I think that's a good point."}, {"time": 11219, "text": "But I think it's a very early view quake."}, {"time": 11227, "text": "It's when the Dunning Kruger crashes hard."}, {"time": 11227, "text": "It's the first realization that humans are actually quite incredible."}, {"time": 11236, "text": "The human mind, the human body is quite incredible."}, {"time": 11236, "text": "There's a lot of different parts to it."}, {"time": 11240, "text": "But then, see, it's already been so long for me to think about it."}, {"time": 11247, "text": "It's already been so long for me that I've experienced that view quake that, for me, I now experience the view quakes of, holy shit, this little thing is actually quite powerful, like neural networks."}, {"time": 11257, "text": "I'm amazed."}, {"time": 11257, "text": "Because you've become almost cynical after that first view quake of, like, this is so hard."}, {"time": 11265, "text": "Like, evolution did some incredible work to create the human mind."}, {"time": 11272, "text": "But then you realize, just like you have, you've talked about a bunch of simple models that simple things can actually be extremely powerful, that maybe emulating the human mind is extremely difficult."}, {"time": 11284, "text": "But you can go a long way with a large neural network."}, {"time": 11284, "text": "You can go a long way with a dumb solution."}, {"time": 11289, "text": "It's that Stuart Russell thing with the reinforcement learning."}, {"time": 11289, "text": "Holy crap, you can go quite a long way with a simple thing."}, {"time": 11295, "text": "But we still have a very long road to go, but not unless..."}, {"time": 11298, "text": "I can't, I refuse to sort of know."}, {"time": 11298, "text": "The road is full of surprises."}, {"time": 11298, "text": "So long is an interesting, like you said, with the six hard steps that humans have to take to arrive at where we are from the origin of life on Earth."}, {"time": 11314, "text": "So it's long, maybe, in the statistical improbability of the steps that have to be taken."}, {"time": 11322, "text": "But in terms of how quickly those steps could be taken, I don't know if my intuition says it's, if it's hundreds of years away or if it's a couple of years away, I prefer to measure..."}, {"time": 11335, "text": "Pretty confidence, at least a decade."}, {"time": 11335, "text": "And mildly confidence, at least three decades."}, {"time": 11340, "text": "I can steal man either direction."}, {"time": 11340, "text": "I prefer to measure that journey in Elon Musk's."}, {"time": 11345, "text": "That's a new... Well, we don't get Elon Musk very often, so that's a long timescale."}, {"time": 11350, "text": "For now, I don't know, maybe you can clone or maybe multiply or even know what Elon Musk, what that is."}, {"time": 11356, "text": "What is... That's a good question."}, {"time": 11361, "text": "Well, that's an excellent question."}, {"time": 11361, "text": "How does that fit into the model of the three parameters that are required for becoming a grabby alien civilization?"}, {"time": 11366, "text": "That's the question of how much any individual makes in the long path of civilization over time."}, {"time": 11373, "text": "And it's a favorite topic of historians and people to try to focus on individuals and how much of a difference they make."}, {"time": 11384, "text": "And certainly, some individuals make a substantial difference in the modest term, right?"}, {"time": 11389, "text": "Like, you know, without Hitler being Hitler in the role he took, European history would have taken a different path for a while there."}, {"time": 11395, "text": "But if we're looking over like many centuries longer term things, most individuals do fade in their individual influence."}, {"time": 11404, "text": "So, I mean..."}, {"time": 11404, "text": "Even Einstein."}, {"time": 11404, "text": "Even Einstein, no matter how sexy your hair is, you will also be forgotten in the long arc of history."}, {"time": 11413, "text": "So you said at least 10 years."}, {"time": 11413, "text": "So let's talk a little bit about this AI point of where, how we achieve, how hard is the problem of solving intelligence is the problem of solving intelligence by engineering artificial intelligence that achieves human level, human like qualities that we associate with intelligence."}, {"time": 11435, "text": "How hard is this?"}, {"time": 11441, "text": "What are the different trajectories that take us there?"}, {"time": 11441, "text": "One way to think about it is in terms of the scope of the technology space you're talking about."}, {"time": 11446, "text": "So let's take the biggest possible scope, all of human technology, right?"}, {"time": 11452, "text": "The entire human economy."}, {"time": 11452, "text": "So the entire economy is composed of many industries, each of which have many products with many different technologies supporting each one."}, {"time": 11464, "text": "At that scale, I think we can accept that most innovations are a small fraction of the total."}, {"time": 11473, "text": "That is usually have relatively gradual overall progress."}, {"time": 11473, "text": "And that individual innovations that have a substantial effect that total are rare and their total effect is still a small percentage of the total economy."}, {"time": 11485, "text": "There's very few individual innovations that made a substantial difference to the whole economy."}, {"time": 11491, "text": "What are we talking?"}, {"time": 11491, "text": "Steam engine, shipping containers, a few things."}, {"time": 11495, "text": "Shipping containers deserves to be up there with steam engines, honestly."}, {"time": 11502, "text": "Can you say exactly why shipping containers..."}, {"time": 11502, "text": "Shipping containers revolutionized shipping."}, {"time": 11508, "text": "Shipping is very important."}, {"time": 11508, "text": "But placing that at shipping containers."}, {"time": 11515, "text": "So you're saying you wouldn't have some of the magic of the supply chain, all that, without shipping containers."}, {"time": 11519, "text": "That made a big difference, absolutely."}, {"time": 11519, "text": "That's something to look into."}, {"time": 11522, "text": "We shouldn't take that tangent, although I'm tempted to."}, {"time": 11522, "text": "But anyway, so there's a few, just a few innovations."}, {"time": 11528, "text": "So at the scale of the whole economy, right?"}, {"time": 11533, "text": "Now, as you move down to a much smaller scale, you will see individual innovations having a bigger effect, right?"}, {"time": 11539, "text": "So if you look at, I don't know, lawnmowers or something, I don't know about the innovations lawnmower, but there were probably like steps where you just had a new kind of lawnmower and that made a big difference to mowing lawns because you're focusing on a smaller part of the whole technology space, right?"}, {"time": 11554, "text": "And sometimes like military technology, there's a lot of military technologies, a lot of small ones, but every once in a while, a particular military weapon like makes a big difference."}, {"time": 11565, "text": "But still, even so, mostly overall, they're making modest differences to something that's increasing relatively soon."}, {"time": 11571, "text": "Like US military is the strongest in the world consistently for a while."}, {"time": 11576, "text": "No one weapon in the last 70 years has made a big difference in terms of the overall prominence of the US military, right?"}, {"time": 11582, "text": "Because that's just saying, even though every once in a while, even the recent Soviet hyper missiles or whatever they are, they aren't changing the overall balance dramatically, right?"}, {"time": 11598, "text": "So when we get to AI, now I can frame the question, how big is AI?"}, {"time": 11598, "text": "Basically, so one way of thinking about AI is it's just all mental tasks."}, {"time": 11605, "text": "And then you ask what fraction of tasks are mental tasks?"}, {"time": 11610, "text": "And then I go, a lot."}, {"time": 11610, "text": "And then if I think of AI as like half of everything, then I think, well, it's got to be composed of lots of parts where any one innovation is only a small impact, right?"}, {"time": 11624, "text": "Now, if you think, no, no, no, AI is like AGI."}, {"time": 11624, "text": "And then you think AGI is a small thing, right?"}, {"time": 11632, "text": "There's only a small number of key innovations that will enable it."}, {"time": 11632, "text": "Now you're thinking there could be a bigger chunk that you might find that would have a bigger impact."}, {"time": 11637, "text": "So the way I would ask you to frame these things in terms of the chunkiness of different areas of technology, in part, in terms of how big they are."}, {"time": 11648, "text": "If you take 10 chunky areas and you add them together, the total is less chunky."}, {"time": 11653, "text": "But don't you, are you able until you solve the fundamental core parts of the problem to estimate the chunkiness of that problem?"}, {"time": 11664, "text": "Well, if you have a history of prior chunkiness, that could be your best estimate for future chunkiness."}, {"time": 11669, "text": "So for example, I mean, even at the level of the world economy, right?"}, {"time": 11669, "text": "We've had this, what, 10,000 years of civilization."}, {"time": 11674, "text": "Well, that's only a short time."}, {"time": 11674, "text": "You might say, oh, that doesn't predict future chunkiness."}, {"time": 11680, "text": "But it looks relatively steady and consistent."}, {"time": 11680, "text": "We can say even in computer science, we've had 70 years of computer science."}, {"time": 11687, "text": "We have enough data to look at chunkiness of computer science."}, {"time": 11692, "text": "Like when were there algorithms or approaches that made a big chunky difference and how large a fraction of that was that?"}, {"time": 11700, "text": "And I'd say mostly in computer science, most innovation has been relatively small chunks."}, {"time": 11705, "text": "The bigger chunks have been rare."}, {"time": 11709, "text": "Well, this is the interesting thing."}, {"time": 11709, "text": "This is about AI and just algorithms in general is page rank."}, {"time": 11714, "text": "So Google's, right?"}, {"time": 11714, "text": "So sometimes it's a simple algorithm that by itself is not that useful, but the scale of context and in a context that's scalable, depending on the context, all of a sudden the power is revealed."}, {"time": 11734, "text": "And there's something, I guess that's the nature of chunkiness is that things that can reach a lot of people simply can be quite chunky."}, {"time": 11745, "text": "So one standard story about algorithms is to say algorithms have a fixed cost plus a marginal cost."}, {"time": 11753, "text": "And so in history, when you had computers that were very small, you tried all the algorithms that had low fixed costs and you look for the best of those."}, {"time": 11758, "text": "But over time, as computers got bigger, you could afford to do larger fixed costs and try those."}, {"time": 11764, "text": "And some of those had more effective algorithms in terms of their marginal cost."}, {"time": 11769, "text": "And that, in fact, that roughly explains the longterm history where in fact, the rate of algorithmic improvement is about the same as the rate of hardware improvement, which is a remarkable coincidence."}, {"time": 11779, "text": "But it would be explained by saying, well, there's all these better algorithms you can't try until you have a big enough computer to pay the fixed cost of doing some trials to find out if that algorithm actually saves you on the marginal cost."}, {"time": 11795, "text": "And so that's an explanation for this relatively continuous history."}, {"time": 11795, "text": "So we have a good story about why hardware is so continuous."}, {"time": 11801, "text": "And you might think, why would software be so continuous with the hardware?"}, {"time": 11805, "text": "But if there's a distribution of algorithms in terms of their fixed costs, and it's, say, spread out at a wide log normal distribution, then we could be sort of marching through that log normal distribution, trying out algorithms with larger fixed costs and finding the ones that have lower marginal costs."}, {"time": 11822, "text": "So would you say AGI, human level, AI, even EM, M, emulated minds, is chunky?"}, {"time": 11822, "text": "Like a few breakthroughs can take us."}, {"time": 11839, "text": "So an M is by its nature chunky in the sense that if you have an emulated brain and you're 25% effective at emulating it, that's crap."}, {"time": 11845, "text": "That's nothing."}, {"time": 11845, "text": "You pretty much need to emulate a full human brain."}, {"time": 11854, "text": "Is that obvious?"}, {"time": 11856, "text": "It's pretty obvious."}, {"time": 11856, "text": "I'm talking about like, you know, so the key thing is you're emulating various brain cells."}, {"time": 11861, "text": "And so you have to emulate the input output pattern of those cells."}, {"time": 11861, "text": "So if you get that pattern somewhat close, but not close enough, then the whole system just doesn't have the overall behavior you're looking for, right?"}, {"time": 11873, "text": "But it could have functionally some of the power of the overall system."}, {"time": 11877, "text": "So there'll be some threshold."}, {"time": 11877, "text": "The point is when you get close enough, then it goes over the threshold, right?"}, {"time": 11880, "text": "It's like taking a computer chip and deleting every 1% of the gates, right?"}, {"time": 11885, "text": "No, that's very chunky."}, {"time": 11885, "text": "But the hope is that emulating the human brain, I mean, the human brain itself is not..."}, {"time": 11893, "text": "So it has a certain level of redundancy and a certain level of robustness."}, {"time": 11893, "text": "And so there's some threshold when you get close to that level of redundancy or robustness, then it starts to work."}, {"time": 11900, "text": "But until you get to that level, it's just going to be crap, right?"}, {"time": 11900, "text": "It's going to be just a big thing that isn't working for us."}, {"time": 11905, "text": "So we can be pretty sure that emulations is a big chunk in an economic sense, right?"}, {"time": 11912, "text": "At some point, you'll be able to make one that's actually effective in enable substituting for humans."}, {"time": 11917, "text": "And then that will be this huge economic product that people will try to buy like crazy."}, {"time": 11923, "text": "You'll bring a lot of value to people's lives, so they'll be willing to pay for it."}, {"time": 11927, "text": "But it could be that the first emulation costs a billion dollars each, right?"}, {"time": 11927, "text": "And then we have them, but we can't really use them."}, {"time": 11933, "text": "They're too expensive."}, {"time": 11933, "text": "And then the cost slowly comes down."}, {"time": 11936, "text": "And now we have less of a chunky adoption, right?"}, {"time": 11936, "text": "That as the cost comes down, then we use more and more of them in more and more contexts."}, {"time": 11943, "text": "And that's a more continuous curve."}, {"time": 11943, "text": "So it's only if the first emulations are relatively cheap that you get a more sudden disruption to society."}, {"time": 11955, "text": "And that could happen if sort of the algorithm is the last thing you figure out how to do or something."}, {"time": 11959, "text": "What about robots that capture some magic in terms of social connection?"}, {"time": 11959, "text": "The robots, like we have a robot dog on the carpet right there."}, {"time": 11968, "text": "Robots that are able to capture some magic of human connection as they interact with humans, but are not emulating the brain."}, {"time": 11976, "text": "What about those?"}, {"time": 11976, "text": "How far away?"}, {"time": 11982, "text": "So we're thinking about chunkiness or distance now."}, {"time": 11982, "text": "So if you ask how chunky is the task of making a, you know, emulatable robot or something, which chunkiness and time are correlated."}, {"time": 11995, "text": "But it's about how far away it is or how suddenly it would happen."}, {"time": 11995, "text": "Chunkiness is how suddenly and difficulty is just how far away it is."}, {"time": 12001, "text": "But it could be a continuous difficulty."}, {"time": 12001, "text": "It would just be far away, but we'll slowly steadily get there."}, {"time": 12007, "text": "Or there could be these thresholds where we reach a threshold and suddenly we can do a lot better."}, {"time": 12017, "text": "That's a good question for both."}, {"time": 12017, "text": "I tend to believe that all of it, not just the M, but AGI too is chunky and human level intelligence embodied in robots is also chunky."}, {"time": 12031, "text": "The history of computer science and chunkiness so far seems to be my rough best guess for the penis of AGI."}, {"time": 12036, "text": "That is, it is chunky."}, {"time": 12039, "text": "It's modestly chunky, not that chunky."}, {"time": 12043, "text": "Our ability to use computers to do many things in the economy has been moving relatively steadily."}, {"time": 12048, "text": "Overall, in terms of our use of computers in society, they have been relatively steadily improving for 70 years."}, {"time": 12055, "text": "No, but I would say that's hard."}, {"time": 12055, "text": "I would have to really think about that because neural networks are quite surprising."}, {"time": 12063, "text": "But every once in a while we have a new thing that's surprising."}, {"time": 12063, "text": "But if you stand back, you know, we see something like that every 10 years or so, some new innovation that has a big effect."}, {"time": 12072, "text": "So, moderately chunky."}, {"time": 12079, "text": "But the history of the level of disruption we've seen in the past would be a rough estimate of the level of disruption in the future."}, {"time": 12082, "text": "Unless the future is, we're going to hit a chunky territory, much chunkier than we've seen in the past."}, {"time": 12088, "text": "Well, I do think there's, it's like, like Kuhnian, like revolution type."}, {"time": 12096, "text": "It seems like the data, especially on AI, is difficult to reason with because it's so recent, it's such a recent field."}, {"time": 12106, "text": "Wow, AI's been around for 50 years."}, {"time": 12110, "text": "I mean, 50, 60, 70, 80 years being recent."}, {"time": 12113, "text": "It's enough time to see a lot of trends."}, {"time": 12118, "text": "A few trends, a few trends."}, {"time": 12118, "text": "I think the internet, computing, there's really a lot of interesting stuff that's happened over the past 30 years that I think the possibility of revolutions is likelier than it was in the..."}, {"time": 12133, "text": "I think for the last 70 years, there have always been a lot of things that look like they had a potential for revolution."}, {"time": 12141, "text": "So we can't reason well about this."}, {"time": 12141, "text": "I mean, we can reason well by looking at the past trends."}, {"time": 12145, "text": "I would say the past trend is roughly your best guess for the future."}, {"time": 12150, "text": "No, but if I look back at the things that might've looked like revolutions in the 70s and 80s and 90s, they are less like the revolutions that appear to be happening now, or the capacity of revolution that appear to be there now."}, {"time": 12163, "text": "First of all, there's a lot more money to be made."}, {"time": 12163, "text": "So there's a lot more incentive for markets to do a lot of kind of innovation, it seems like in the AI space."}, {"time": 12174, "text": "But then again, there's a history of winters and summers and so on."}, {"time": 12178, "text": "So maybe we're just like riding a nice wave right now."}, {"time": 12180, "text": "One of the biggest issues is the difference between impressive demos and commercial value."}, {"time": 12186, "text": "So we often through the history of AI, we saw very impressive demos that never really translated much into commercial value."}, {"time": 12192, "text": "Somebody who works on and cares about autonomous and semi autonomous vehicles, tell me about it."}, {"time": 12197, "text": "And there again, we return to the number of Elon Musk's per earth per year generated."}, {"time": 12204, "text": "That's the M. Coincidentally, same initials as the M. Very suspicious, very suspicious."}, {"time": 12211, "text": "We're going to have to look into that."}, {"time": 12211, "text": "Two more fields that I would like to force and twist your arm to look for view quakes and for beautiful ideas, economics."}, {"time": 12223, "text": "What is a beautiful idea to you about economics?"}, {"time": 12223, "text": "You mentioned a lot of them."}, {"time": 12233, "text": "So as you said before, there's going to be the first view cake most people encounter that makes the biggest difference on average in the world, because that's the only thing most people ever see is the first one."}, {"time": 12242, "text": "And so with AI, the first one is just how big the problem is."}, {"time": 12242, "text": "But once you get past that, you'll find others."}, {"time": 12250, "text": "Certainly for economics, the first one is just the power of markets."}, {"time": 12256, "text": "You might have thought it was just really hard to figure out how to optimize in a big, complicated space."}, {"time": 12262, "text": "And markets just do a good first pass for an awful lot of stuff."}, {"time": 12269, "text": "And they are really quite robust and powerful."}, {"time": 12269, "text": "And that's just quite the view quake, where you just say, if you want to get in the ballpark, just let a market handle it and step back."}, {"time": 12275, "text": "And that's true for a wide range of things."}, {"time": 12283, "text": "It's not true for everything, but it's a very good first approximation."}, {"time": 12288, "text": "Most people's intuitions for how they should limit markets are actually messing them up."}, {"time": 12293, "text": "They're that good in sense."}, {"time": 12293, "text": "Most people, when you go, I don't know if we want to trust that."}, {"time": 12297, "text": "Well, you should be trusting that."}, {"time": 12297, "text": "What are markets?"}, {"time": 12297, "text": "Just a couple of words."}, {"time": 12297, "text": "So the idea is if people want something, then let other companies form to try to supply that thing."}, {"time": 12312, "text": "Let those people pay for their cost of whatever they're making and try to offer that product to those people."}, {"time": 12316, "text": "Let many such firms enter that industry and let the customers decide which ones they want."}, {"time": 12322, "text": "And if the firm goes out of business, let it go bankrupt and let other people invest in whichever ventures they want to try to attract customers to their version of the product."}, {"time": 12330, "text": "And that just works for a wide range of products and services."}, {"time": 12334, "text": "And through all of this, there's a free exchange of information too."}, {"time": 12337, "text": "There's a hope that there's no manipulation of information and so on."}, {"time": 12343, "text": "Even when those things happen, still just the simple market solution is usually better than the things you'll try to do to fix it."}, {"time": 12349, "text": "Than the alternative."}, {"time": 12350, "text": "That's a view, Craig."}, {"time": 12350, "text": "It's surprising."}, {"time": 12350, "text": "It's not what you would have initially thought."}, {"time": 12355, "text": "That's one of the great, I guess, inventions of human civilization that trust the markets."}, {"time": 12362, "text": "Now, another view, Craig, that I learned in my research that's not all of economics, but something more specialized is the rationality of disagreement."}, {"time": 12365, "text": "That is, basically people who are trying to believe what's true in a complicated situation would not actually disagree."}, {"time": 12376, "text": "And of course, humans disagree all the time."}, {"time": 12376, "text": "So it was quite the striking fact for me to learn in grad school that actually rational agents would not knowingly disagree."}, {"time": 12382, "text": "And so that makes disagreement more puzzling and it makes you less willing to disagree."}, {"time": 12395, "text": "Humans are, to some degree, rational and are able to... Their priorities are different than just figuring out the truth."}, {"time": 12403, "text": "Are different than just figuring out the truth."}, {"time": 12408, "text": "Which might not be the same as being irrational."}, {"time": 12412, "text": "That's another tangent that could take an hour."}, {"time": 12416, "text": "In the space of human affairs, political science, what is a beautiful, foundational, interesting idea to you, a view, Craig, in the space of political science?"}, {"time": 12428, "text": "It's the main thing that goes wrong in politics is people not agreeing on what the best thing to do is."}, {"time": 12439, "text": "That's a wrong thing."}, {"time": 12440, "text": "So that's what goes wrong."}, {"time": 12440, "text": "That is where you say, what's fundamentally behind most political failures?"}, {"time": 12444, "text": "It's that people are ignorant of what the consequences of policy is."}, {"time": 12450, "text": "And that's surprising because it's actually feasible to solve that problem, which we aren't solving."}, {"time": 12455, "text": "So it's a bug, not a feature that there's an inability to arrive at a consensus."}, {"time": 12463, "text": "So most political systems, if everybody looked to some authority, say, on a question and that authority told them the answer, then most political systems are capable of just doing that thing."}, {"time": 12475, "text": "And so it's the failure to have trustworthy authorities that is sort of the underlying failure behind most political failure."}, {"time": 12484, "text": "We invade Iraq, say, when we don't have an authority to tell us that's a really stupid thing to do."}, {"time": 12489, "text": "And it is possible to create more informative trustworthy authorities."}, {"time": 12497, "text": "That's a remarkable fact about the world of institutions that we could do that, but we aren't."}, {"time": 12504, "text": "Yeah, that's surprising."}, {"time": 12504, "text": "We could and we aren't."}, {"time": 12508, "text": "Another big view, Craig, about politics is from the elephant in the brain that most people, when they're interacting with politics, they say they want to make the world better, they make their city better, their country better, and that's not their priority."}, {"time": 12520, "text": "They want to show loyalty to their allies."}, {"time": 12520, "text": "They want to show their people they're on their side, yes."}, {"time": 12524, "text": "Or their various tribes they're in, that's their primary priority and they do accomplish that."}, {"time": 12531, "text": "And the tribes are usually color coded, conveniently enough."}, {"time": 12535, "text": "What would you say, you know, it's the Churchill question."}, {"time": 12535, "text": "Democracy is the crappiest form of government, but it's the best one we got."}, {"time": 12541, "text": "What's the best form of government for this, our 7 billion human civilization and the maybe as we get farther and further."}, {"time": 12548, "text": "You mentioned a lot of stuff that's fascinating about human history as we become more forager like and looking out beyond what's the best form of government in the next 50, 100 years as we become a multi planetary species."}, {"time": 12566, "text": "So, the key failing is that we have existing political institutions and related institutions like media institutions and other authority institutions, and these institutions sit in a vast space of possible institutions."}, {"time": 12579, "text": "And the key failing, we're just not exploring that space."}, {"time": 12584, "text": "So, I have made my proposals in that space, and I think I can identify many promising solutions."}, {"time": 12590, "text": "And many other people have made many other promising proposals in that space."}, {"time": 12594, "text": "But the key thing is we're just not pursuing those proposals."}, {"time": 12599, "text": "We're not trying them out on small scales, we're not doing tests, we're not exploring the space of these options."}, {"time": 12604, "text": "That is the key thing we're failing to do."}, {"time": 12604, "text": "And if we did that, I am confident we would find much better institutions than one we're using now, but we would have to actually try."}, {"time": 12614, "text": "So, a lot of those topics, I do hope we get a chance to talk again."}, {"time": 12614, "text": "You're a fascinating human being."}, {"time": 12623, "text": "So, I'm skipping a lot of tangents on purpose that I would love to take."}, {"time": 12623, "text": "You're such a brilliant person on so many different topics."}, {"time": 12628, "text": "Let me take a stroll into the deep human psyche of Robin Hansen himself."}, {"time": 12640, "text": "So, first... May not be that deep."}, {"time": 12648, "text": "I might just be all on the surface."}, {"time": 12648, "text": "What you see is what you get."}, {"time": 12648, "text": "There might not be much hiding behind it."}, {"time": 12651, "text": "Some of the fun is on the surface."}, {"time": 12651, "text": "I actually think this is true of many of the most successful, most interesting people you see in the world."}, {"time": 12658, "text": "That is, they have put so much effort into the surface that they've constructed."}, {"time": 12664, "text": "And that's where they put all their energy."}, {"time": 12664, "text": "Somebody might be a statesman or an actor or something else, and people want to interview them and they want to say, what are you behind the scenes?"}, {"time": 12674, "text": "What do you do in your free time?"}, {"time": 12674, "text": "Those people don't have free time."}, {"time": 12678, "text": "They don't have another life behind the scenes."}, {"time": 12678, "text": "They put all their energy into that surface, the one we admire, the one we're fascinated by."}, {"time": 12684, "text": "And they kind of have to make up the stuff behind the scenes to supply it for you, but it's not really there."}, {"time": 12688, "text": "Well, there's several ways of phrasing that."}, {"time": 12693, "text": "So, one of it is authenticity, which is if you become the thing you are on the surface, if the depths mirror the surface, then that's what authenticity is."}, {"time": 12701, "text": "You're not hiding something."}, {"time": 12708, "text": "You're not concealing something."}, {"time": 12708, "text": "To push back on the idea of actors, they actually have often a manufactured surface that they put on and they try on different masks and the depths are very different from the surface."}, {"time": 12720, "text": "And that's actually what makes them very not interesting to interview."}, {"time": 12723, "text": "If you are an actor who actually lives the role that you play, so like, I don't know, Clint Eastwood type character who clearly represents the cowboy, like at least rhymes or echoes the person you play on the surface, that's authenticity."}, {"time": 12740, "text": "Some people are typecasts and they have basically one persona they play in all of their movies and TV shows."}, {"time": 12746, "text": "And so those people, it probably is the actual persona that they are, or it has become that over time."}, {"time": 12750, "text": "Clint Eastwood would be one."}, {"time": 12757, "text": "I think of Tom Hanks as an ever."}, {"time": 12757, "text": "I think they just always play the same person."}, {"time": 12760, "text": "And you and I are just both surface players."}, {"time": 12760, "text": "You're the fun, brilliant thinker and I am the suit wearing idiot full of silly questions."}, {"time": 12769, "text": "That said, let's put on your wise sage hat and ask you, what advice would you give to young people today in high school and college about life, about how to live a successful life in career or just in general that they can be proud of?"}, {"time": 12795, "text": "Most young people, when they actually ask you that question, what they usually mean is how can I be successful by usual standards?"}, {"time": 12802, "text": "I'm not very good at giving advice about that because that's not how I tried to live my life."}, {"time": 12808, "text": "So I would more flip it around and say, you live in a rich society and you will have a long life."}, {"time": 12816, "text": "You have many resources available to you."}, {"time": 12816, "text": "Whatever career you take, you'll have plenty of time to make progress on something else."}, {"time": 12824, "text": "Yes, it might be better if you find a way to combine your career and your interests in a way that gives you more time and energy, but there are often big compromises there as well."}, {"time": 12834, "text": "So if you have a passion about some topic or some thing that you think just is worth pursuing, you can just do it."}, {"time": 12840, "text": "You don't need other people's approval."}, {"time": 12845, "text": "And you can just start doing whatever it is you think it's worth doing."}, {"time": 12845, "text": "It might take you decades, but decades are enough to make enormous progress on most all interesting things."}, {"time": 12857, "text": "And don't worry about the commitment of it."}, {"time": 12857, "text": "I mean, that's a lot of what people worry about is, well, there's so many options."}, {"time": 12861, "text": "And if I choose a thing and I stick with it, I sacrifice all the other paths I could have taken."}, {"time": 12867, "text": "So I switched my career at the age of 34 with two kids, age zero and two, went back to grad school in social science after being a research software engineer."}, {"time": 12879, "text": "So it's quite possible to change your mind later in life."}, {"time": 12885, "text": "How can you have an age of zero?"}, {"time": 12888, "text": "Less than one."}, {"time": 12890, "text": "Oh, you index was zero."}, {"time": 12895, "text": "People also ask what to read and I say, textbooks."}, {"time": 12895, "text": "Until you've read lots of textbooks or maybe review articles, I'm not so sure you should be reading blog posts and Twitter feeds and even podcasts."}, {"time": 12908, "text": "I would say at the beginning, this is our best, humanity's best summary of how to learn things is crammed into textbooks."}, {"time": 12916, "text": "Especially the ones on like introduction to biology, introduction to everything."}, {"time": 12921, "text": "Just read all the algorithms, read as many textbooks as you can stomach."}, {"time": 12926, "text": "And then maybe if you want to know more about a subject, find review articles."}, {"time": 12930, "text": "You don't need to read the latest stuff for most topics."}, {"time": 12933, "text": "And actually textbooks often have the prettiest pictures."}, {"time": 12937, "text": "And depending on the field, if it's technical, then doing the homework problems at the end, it's actually extremely, extremely useful."}, {"time": 12942, "text": "Extremely powerful way to understand something if you allow it."}, {"time": 12947, "text": "I actually think of like high school and college, which you kind of remind me of, people don't often think of it that way, but you will almost not again get an opportunity to spend the time with a fundamental subject and like, and everybody's forcing you, like everybody wants you to do it."}, {"time": 12968, "text": "And like, you'll never get that chance again to sit there, even though it's outside of your interest, biology."}, {"time": 12974, "text": "Like in high school, I took AP biology, AP chemistry."}, {"time": 12979, "text": "I'm thinking of subjects I never again really visited seriously."}, {"time": 12979, "text": "And it was so nice to be forced into anatomy and physiology, to be forced into that world, to stay with it, to look at the pretty pictures, to certain moments to actually for a moment, enjoy the beauty of these, of like how a cell works and all those kinds of things."}, {"time": 13000, "text": "And you're somehow that stays like the ripples of that fascination that stays with you, even if you never do those, even if you never utilize those learnings in your actual work."}, {"time": 13016, "text": "A common problem, at least of many young people I meet is that they're like feeling idealistic and altruistic, but in a rush."}, {"time": 13021, "text": "So, you know, the usual human tradition that goes back, you know, hundreds of thousands of years is that people's productivity rises with time and maybe peaks around the age of 40 or 50."}, {"time": 13033, "text": "The age of 40, 50 is when you will be having the highest income, you'll have the most contacts, you will sort of be wise about how the world works."}, {"time": 13045, "text": "Expect to have your biggest impact then."}, {"time": 13045, "text": "Before then, you can have impacts, but you're also mainly building up your resources and abilities."}, {"time": 13051, "text": "That's the usual human trajectory."}, {"time": 13051, "text": "Expect that to be true of you too."}, {"time": 13058, "text": "Don't be in such a rush to like accomplish enormous things at the age of 18 or whatever."}, {"time": 13063, "text": "I mean, you might as well practice trying to do things, but that's mostly about learning how to do things by practicing."}, {"time": 13067, "text": "There's a lot of things you can't do unless you just keep trying them."}, {"time": 13070, "text": "And when all else fails, try to maximize the number of offspring, however way you can."}, {"time": 13076, "text": "That's certainly something I've neglected."}, {"time": 13076, "text": "I would tell my younger version of myself, try to have more descendants."}, {"time": 13081, "text": "It matters more than I gave, I realized at the time."}, {"time": 13089, "text": "Both in terms of making copies of yourself in mutated form and just the joy of raising them."}, {"time": 13098, "text": "I mean, the meaning even, you know, so in the literature on the value people get out of life, there's a key distinction between happiness and meaning."}, {"time": 13112, "text": "So happiness is how do you feel right now about right now and meaning is how do you feel about your whole life?"}, {"time": 13117, "text": "And, you know, many things that produce happiness don't produce meaning as reliably."}, {"time": 13124, "text": "And if you have to choose between them, you'd rather have meaning."}, {"time": 13124, "text": "And meaning is more goes along with sacrificing happiness sometimes."}, {"time": 13131, "text": "And children are an example of that."}, {"time": 13131, "text": "You get a lot more meaning out of children, even if they're a lot more work."}, {"time": 13137, "text": "What do you think kids, children are so magical, like raising kids?"}, {"time": 13145, "text": "I would love to have kids."}, {"time": 13145, "text": "And whenever I work with robots, there's some of the same magic when there's an entity that comes to life."}, {"time": 13155, "text": "And in that case, I'm not trying to draw too many parallels, but there is some echo to it, which is when you program a robot, there's some aspect of your intellect that is now instilled in this other moving being that's kind of magical."}, {"time": 13173, "text": "Well, why do you think that's magical?"}, {"time": 13173, "text": "And you said happiness and meaning as opposed to a short."}, {"time": 13180, "text": "Why is it meaningful?"}, {"time": 13180, "text": "Like I can give you several different reasons, all of which is sufficient."}, {"time": 13189, "text": "And so the question is, we don't know which ones are the correct reasons."}, {"time": 13193, "text": "Look it up."}, {"time": 13193, "text": "So, you know, I meet a lot of people interested in the future, interested in thinking about the future."}, {"time": 13199, "text": "They're thinking about how can I influence the future?"}, {"time": 13203, "text": "But overwhelmingly in history so far, the main way people have influenced the future is by having children, overwhelmingly."}, {"time": 13208, "text": "And that's just not an incidental fact."}, {"time": 13215, "text": "You are built for that."}, {"time": 13215, "text": "That is, you're the sequence of thousands of generations, each of which successfully had a descendant."}, {"time": 13222, "text": "And that affected who you are."}, {"time": 13222, "text": "You just have to expect and it's true that who you are is built to be, you know, expect to have a child, to want to have a child, to have that be a natural and meaningful interaction for you."}, {"time": 13236, "text": "And it's just true."}, {"time": 13236, "text": "It's just one of those things you just should have expected and it's not a surprise."}, {"time": 13241, "text": "Well, to push back and sort of in terms of influencing the future, as we get more and more technology, more and more of us are able to influence the future in all kinds of other ways, right?"}, {"time": 13254, "text": "Being a teacher, educator."}, {"time": 13254, "text": "Even so, though, still most of our influence in the future has probably happened being kids, even though we've accumulated more ways, other ways to do it."}, {"time": 13265, "text": "You mean at scale."}, {"time": 13265, "text": "I guess the depth of influence, like really how much of much effort, how much of yourself you really put into another human being."}, {"time": 13275, "text": "Do you mean both the raising of a kid or you mean raw genetic information?"}, {"time": 13275, "text": "Well, both, but raw genetics is probably more than half of it."}, {"time": 13284, "text": "More than half."}, {"time": 13284, "text": "Even in this modern world?"}, {"time": 13290, "text": "Let me ask some dark, difficult questions, if I might."}, {"time": 13290, "text": "Let's take a stroll into that place that may or may not exist, according to you."}, {"time": 13300, "text": "What's the darkest place you've ever gone to in your mind, in your life, a dark time, a challenging time in your life that you had to overcome?"}, {"time": 13318, "text": "You know, probably just feeling strongly rejected."}, {"time": 13318, "text": "And so I've been, I'm apparently somewhat emotionally scarred by just being very rejection averse, which must have happened because some rejections were just very scarring."}, {"time": 13331, "text": "At a scale in what kinds of communities?"}, {"time": 13331, "text": "On the individual scale?"}, {"time": 13338, "text": "I mean, lots of different scales, yeah."}, {"time": 13338, "text": "All the different, many different scales."}, {"time": 13338, "text": "Still that rejection stings."}, {"time": 13344, "text": "Hold on a second, but you are a contrarian thinker."}, {"time": 13344, "text": "You challenge the norms."}, {"time": 13353, "text": "Why, if you were scarred by rejection, why welcome it in so many ways at a much larger scale, constantly with your ideas?"}, {"time": 13363, "text": "It could be that I'm just stupid, or that I've just categorized them differently than I should or something."}, {"time": 13370, "text": "You know, the most rejection that I've faced hasn't been because of my intellectual ideas."}, {"time": 13378, "text": "So the intellectual ideas haven't been the thing to risk the rejection."}, {"time": 13386, "text": "The one that, the things that challenge your mind taking you to a dark place are the more psychological rejections."}, {"time": 13394, "text": "Well, you just asked me, you know, what took me to a dark place."}, {"time": 13401, "text": "You didn't specify it as sort of an intellectual dark place, I guess."}, {"time": 13401, "text": "Yeah, I just meant like what?"}, {"time": 13405, "text": "So intellectual is disjoint or at least at a more surface level than something emotional?"}, {"time": 13413, "text": "Yeah, I would just think, you know, there are times in your life when, you know, you're just in a dark place and that can have many different causes."}, {"time": 13418, "text": "And most, you know, most intellectuals are still just people and most of the things that will affect them are the kinds of things that affect people."}, {"time": 13427, "text": "They aren't that different necessarily."}, {"time": 13427, "text": "I mean, that's going to be true for, like, I presume most basketball players are still just people."}, {"time": 13432, "text": "If you ask them what was the worst part of their life, it's going to be this kind of thing that was the worst part of life for most people."}, {"time": 13439, "text": "So rejection early in life?"}, {"time": 13439, "text": "Yeah, I think, I mean, not in grade school probably, but, you know, yeah, sort of, you know, being a young nerdy guy and feeling, you know, not in much demand or interest or, you know, later on, lots of different kinds of rejection."}, {"time": 13453, "text": "But yeah, but I think that's, you know, most of us like to pretend we don't that much need other people."}, {"time": 13462, "text": "We don't care what they think."}, {"time": 13466, "text": "I know it's a common sort of stance if somebody rejects you or something, I didn't care about them anyway."}, {"time": 13470, "text": "I, you know, didn't, but I think to be honest, people really do care."}, {"time": 13470, "text": "Yeah, we do seek that connection, that love."}, {"time": 13480, "text": "Um, opacity, in part."}, {"time": 13480, "text": "That is, love is one of those things where we know at some level it's important to us, but it's not very clearly shown to us exactly how or why or in what ways."}, {"time": 13500, "text": "There are some kinds of things we want where we can just clearly see that we want and why that we want it, right?"}, {"time": 13503, "text": "We know when we're thirsty, and we know why we were thirsty, and we know what to do about being thirsty, and we know when it's over that we're no longer thirsty."}, {"time": 13507, "text": "Love isn't like that."}, {"time": 13514, "text": "It's like, what do we seek from this?"}, {"time": 13514, "text": "We're drawn to it, but we do not understand why we're drawn exactly."}, {"time": 13519, "text": "Because it's not just affection, because if it was just affection, we don't seem to be drawn to pure affection."}, {"time": 13525, "text": "We don't seem to be drawn to somebody who's like a servant."}, {"time": 13532, "text": "We don't seem to be necessarily drawn to somebody that satisfies all your needs or something like that."}, {"time": 13537, "text": "So it's clearly something we want or need, but we're not exactly very clear about it, and that is kind of important to it."}, {"time": 13543, "text": "So I've also noticed there are some kinds of things you can't imagine very well."}, {"time": 13548, "text": "So if you imagine a situation, there's some aspects of the situation that you can clearly, you can imagine it being bright or dim, you can imagine it being windy, or you can imagine it being hot or cold."}, {"time": 13556, "text": "But there's some aspects about your emotional stance in a situation that's actually just hard to imagine or even remember."}, {"time": 13562, "text": "You can often remember an emotion only when you're in a similar sort of emotion situation, and otherwise, you just can't bring the emotion to your mind, and you can't even imagine it, right?"}, {"time": 13572, "text": "So there's certain kinds of emotions you can have, and when you're in that emotion, you can know that you have it, and you can have a name, and it's associated."}, {"time": 13582, "text": "But later on, I tell you, remember joy, and it doesn't come to mind."}, {"time": 13588, "text": "I'm not able to replay it."}, {"time": 13588, "text": "And it's the sort of reason why we have, one of the reasons that pushes us to re consume it and reproduce it is that we can't reimagine it."}, {"time": 13593, "text": "Well, it's interesting because there's a Daniel Kahneman type of thing of reliving memories, because I'm able to summon some aspect of that emotion, again, by thinking of that situation from which that emotion came."}, {"time": 13613, "text": "So like a certain song, you can listen to it, and you can feel the same way you felt the first time you remember that song associated with it."}, {"time": 13619, "text": "So you need to remember that situation in some sort of complete package."}, {"time": 13623, "text": "You can't just take one part off of it, and then if you get the whole package again, if you remember the whole feeling."}, {"time": 13628, "text": "Or some fundamental aspect of that whole experience that arouse from which the feeling arose."}, {"time": 13633, "text": "And actually, the feeling is probably different in some way."}, {"time": 13638, "text": "It could be more pleasant or less pleasant than the feeling you felt originally, and that morphs over time every time you replay that memory."}, {"time": 13643, "text": "It is interesting."}, {"time": 13643, "text": "You're not able to replay the feeling perfectly."}, {"time": 13648, "text": "You don't remember the feeling."}, {"time": 13648, "text": "You remember the facts of the events."}, {"time": 13653, "text": "So there's a sense of which over time we expand our vocabulary as a community of language, and that allows us to sort of have more feelings and know that we are feeling them."}, {"time": 13659, "text": "Because you can have a feeling but not have a word for it, and then you don't know how to categorize it or even what it is and whether it's the same as something else."}, {"time": 13667, "text": "But once you have a word for it, you can sort of pull it together more easily."}, {"time": 13672, "text": "And so I think over time we are having a richer palette of feelings because we have more words for them."}, {"time": 13678, "text": "What has been a painful loss in your life?"}, {"time": 13685, "text": "Maybe somebody or something that's no longer in your life, but played an important part of your life."}, {"time": 13692, "text": "Youth?"}, {"time": 13694, "text": "That's a concept."}, {"time": 13694, "text": "No, it has to be..."}, {"time": 13696, "text": "I mean, but I was once younger."}, {"time": 13696, "text": "I had health and I had vitality."}, {"time": 13696, "text": "I was insomere."}, {"time": 13700, "text": "I mean, you know, I've lost that over time."}, {"time": 13702, "text": "Do you see that as a different person?"}, {"time": 13702, "text": "Maybe you've lost that person."}, {"time": 13706, "text": "I'm a different person than I was when I was younger, and I don't even remember exactly what he was."}, {"time": 13712, "text": "So I don't remember as many things from the past as many people do."}, {"time": 13712, "text": "So in some sense, I've just lost a lot of my history by not remembering it."}, {"time": 13716, "text": "And I'm not that person anymore."}, {"time": 13722, "text": "That person is gone and I don't have any of their abilities."}, {"time": 13725, "text": "Is it a painful loss, though?"}, {"time": 13727, "text": "Or is it a... Why is it painful?"}, {"time": 13727, "text": "Because you're wiser."}, {"time": 13734, "text": "There's so many things that are beneficial to getting older."}, {"time": 13737, "text": "But I just was this person and I felt assured that I could continue to be that person."}, {"time": 13746, "text": "And you're no longer that person."}, {"time": 13747, "text": "And he's gone."}, {"time": 13747, "text": "And I'm not him anymore."}, {"time": 13747, "text": "And he died without fanfare or a funeral."}, {"time": 13754, "text": "And that the person you are today talking to me, that person will be changed, too."}, {"time": 13760, "text": "And maybe in 20 years, he won't be there anymore."}, {"time": 13764, "text": "And the future person, we'll look back."}, {"time": 13764, "text": "The future version of you will... For Ems, this will be less of a problem."}, {"time": 13770, "text": "For Ems, they would be able to save an archived copy of themselves at each different age."}, {"time": 13774, "text": "And they could turn it on periodically and go back and talk to it."}, {"time": 13780, "text": "To replay."}, {"time": 13780, "text": "You think some of that will be..."}, {"time": 13780, "text": "So with emulated minds, with Ems, there's a digital cloning that happens."}, {"time": 13786, "text": "And do you think that makes you less special if you're clonable?"}, {"time": 13800, "text": "Does that make you the experience of life, the experience of a moment, the scarcity of that moment, the scarcity of that experience, isn't that a fundamental part of what makes that experience so delicious, so rich of feeling?"}, {"time": 13818, "text": "I think if you think of a song that lots of people listen to that are copies all over the world, we're going to call that a more special song."}, {"time": 13832, "text": "So there's a perspective on copying and cloning where you're just scaling happiness versus degrading it."}, {"time": 13840, "text": "I mean, each copy of a song is less special if there are many copies, but the song itself is more special if there are many copies."}, {"time": 13848, "text": "In a mass, right, you're actually spreading the happiness even if it diminishes over a large number of people at scale and that increases the overall happiness in the world."}, {"time": 13859, "text": "And then you're able to do that with multiple songs."}, {"time": 13862, "text": "Is a person who has an identical twin more or less special?"}, {"time": 13866, "text": "Well, the problem with identical twins is, you know, it's like just two with M's."}, {"time": 13876, "text": "Right, but two is different than one."}, {"time": 13878, "text": "So I think an identical twin's life is richer for having this other identical twin, somebody who understands them better than anybody else can."}, {"time": 13887, "text": "From the point of view of an identical twin, I think they have a richer life for being part of this couple, each of which is very similar."}, {"time": 13894, "text": "Now, if you said, will the world, you know, if we lose one of the identical twins, will the world miss it as much because you've got the other one and they're pretty similar?"}, {"time": 13902, "text": "Maybe from the rest of the world's point of view, they suffer less of a loss when they lose one of the identical twins."}, {"time": 13908, "text": "But from the point of view of the identical twin themselves, their life is enriched by having a twin."}, {"time": 13913, "text": "See, but the identical twin copying happens at the place of birth."}, {"time": 13918, "text": "It's different than copying after you've done some of the environment, like the nurture at the teenage or in the 20s after going to college."}, {"time": 13928, "text": "Yes, that'll be an interesting thing for M's to find out all the different ways that they can have different relationships to different people who have different degrees of similarity to them in time."}, {"time": 13937, "text": "Yeah, yeah, man."}, {"time": 13943, "text": "But it seems like a rich space to explore and I don't feel sorry for them."}, {"time": 13946, "text": "This sounds like an interesting world to live in."}, {"time": 13949, "text": "And there could be some ethical conundrums there."}, {"time": 13951, "text": "There will be many new choices to make that they don't make now."}, {"time": 13955, "text": "So, and I discussed that in the book Age of M. Like, say you have a lover and you make a copy of yourself, but the lover doesn't make a copy."}, {"time": 13963, "text": "Well now, which one of you or are both still related to the lover?"}, {"time": 13968, "text": "Socially entitled to show up."}, {"time": 13972, "text": "Yes, so you'll have to make choices then when you split yourself, which of you inherit which unique things."}, {"time": 13981, "text": "Yeah, and of course there'll be an equivalent increase in lawyers."}, {"time": 13988, "text": "Well, I guess you can clone the lawyers to help manage some of these negotiations of how to split property."}, {"time": 13996, "text": "The nature of owning, I mean, property is connected to individuals, right?"}, {"time": 14002, "text": "You only really need lawyers for this with an inefficient, awkward law that is not very transparent and able to do things."}, {"time": 14008, "text": "So, you know, for example, an operating system of a computer is a law for that computer."}, {"time": 14013, "text": "When the operating system is simple and clean, you don't need to hire a lawyer to make a key choice with the operating system."}, {"time": 14018, "text": "You don't need a human in the loop."}, {"time": 14020, "text": "You just make a choice, right?"}, {"time": 14022, "text": "So ideally we want a legal system that makes the common choices easy and not require much overhead."}, {"time": 14029, "text": "And that's the digitization of things further enables that."}, {"time": 14036, "text": "So the loss of a younger self, what about the loss of your life overall?"}, {"time": 14045, "text": "I am a cryonics customer."}, {"time": 14046, "text": "That's what this little tag around my deck says."}, {"time": 14049, "text": "It says that if you find me in a medical situation, you should call these people to enable the cryonics transfer."}, {"time": 14056, "text": "So I am taking a long shot chance at living a much longer life."}, {"time": 14062, "text": "Can you explain what cryonics is?"}, {"time": 14065, "text": "So when medical science gives up on me in this world, instead of burning me or letting worms eat me, they will freeze me or at least freeze my head."}, {"time": 14076, "text": "And there is damage that happens in the process of freezing the head."}, {"time": 14080, "text": "But once it's frozen, it won't change for a very long time."}, {"time": 14084, "text": "Chemically, it'll just be completely exactly the same."}, {"time": 14087, "text": "So future technology might be able to revive me."}, {"time": 14090, "text": "And in fact, I would be mainly counting on the brain emulation scenario, which doesn't require reviving my entire biological body."}, {"time": 14098, "text": "It means I would be in a computer simulation."}, {"time": 14102, "text": "And so I think I've got at least a 5% shot at that."}, {"time": 14106, "text": "And that's immortality."}, {"time": 14110, "text": "But most likely it won't happen."}, {"time": 14112, "text": "And therefore, I'm sad that it won't happen."}, {"time": 14114, "text": "Do you think immortality is something that you would like to have?"}, {"time": 14120, "text": "Well, I mean, just like infinity, I mean, you can't know until forever, which means never, right?"}, {"time": 14126, "text": "So all you can really, you know, the better choice is at each moment, do you want to keep going?"}, {"time": 14131, "text": "So I would like at every moment to have the option to keep going."}, {"time": 14134, "text": "The interesting thing about human experience is that the way you phrase it is exactly right."}, {"time": 14145, "text": "At every moment, I would like to keep going."}, {"time": 14148, "text": "But the thing that happens, you know, leave them wanting more of whatever that phrase is, the thing that happens is over time, it's possible for certain experiences to become bland and you become tired of them."}, {"time": 14167, "text": "And that actually makes life really unpleasant."}, {"time": 14173, "text": "Sorry, makes that experience really unpleasant."}, {"time": 14175, "text": "And perhaps you can generalize that to life itself if you have a long enough horizon."}, {"time": 14181, "text": "And so... Might happen, but might as well wait and find out."}, {"time": 14184, "text": "But then you're ending on suffering, you know?"}, {"time": 14188, "text": "So in the world of brain emulations, I have more options."}, {"time": 14192, "text": "You can return yourself."}, {"time": 14194, "text": "That is, I can make copies of myself, archive copies at various ages."}, {"time": 14199, "text": "And at a later age, I could decide that I'd rather replace myself with a new copy from a younger age."}, {"time": 14204, "text": "So does a brain emulation still operate in physical space?"}, {"time": 14208, "text": "So can we do, what do you think about like the metaverse and operating in virtual reality so we can conjure up not just emulate, not just your own brain and body, but the entirety of the environment?"}, {"time": 14220, "text": "Well, most brain emulations will, in fact, most of their time in virtual reality."}, {"time": 14226, "text": "But they wouldn't think of it as virtual reality."}, {"time": 14228, "text": "They would just think of it as their usual reality."}, {"time": 14231, "text": "I mean, the thing to notice, I think, in our world, most of us spend most time indoors."}, {"time": 14236, "text": "And indoors, we are surrounded by walls covered with paint and floors covered with tile or rugs."}, {"time": 14243, "text": "Most of our environment is artificial."}, {"time": 14246, "text": "It's constructed to be convenient for us."}, {"time": 14248, "text": "It's not the natural world that was there before."}, {"time": 14251, "text": "A virtual reality is basically just like that."}, {"time": 14253, "text": "It is the environment that's comfortable and convenient for you."}, {"time": 14257, "text": "But when it's the right, that environment for you, it's real for you."}, {"time": 14261, "text": "Just like the room you're in right now most likely is very real for you."}, {"time": 14265, "text": "You're not focused on the fact that the paint is hiding the actual studs behind the wall and the actual wires and pipes and everything else."}, {"time": 14272, "text": "The fact that we're hiding that from you doesn't make it fake or unreal."}, {"time": 14278, "text": "What are the chances that we're actually in the very kind of system that you're describing where the environment and the brain is being emulated and you're just replaying an experience when you first did a podcast with Lex after?"}, {"time": 14294, "text": "And now, the person that originally launched this already did hundreds of podcasts with Lex."}, {"time": 14299, "text": "This is just the first time and you like this time because there's so much uncertainty."}, {"time": 14304, "text": "There's nerves."}, {"time": 14305, "text": "It could have gone any direction."}, {"time": 14308, "text": "At the moment, we don't have the technical ability to create that emulation."}, {"time": 14312, "text": "So we'd have to be postulating that in the future we have that ability and then they choose to evaluate this moment now to simulate it."}, {"time": 14320, "text": "Don't you think we could be in the simulation of that exact experience right now and we wouldn't be able to know?"}, {"time": 14326, "text": "So one scenario would be this never really happened."}, {"time": 14331, "text": "This only happens as a reconstruction later on."}, {"time": 14335, "text": "That's different than the scenario that this did happen the first time and now it's happening again as a reconstruction."}, {"time": 14340, "text": "That second scenario is harder to put together because it requires this coincidence where between the two times we produce the ability to do it."}, {"time": 14348, "text": "But don't you think replay of memories, poor replay of memories is something that might be a possible thing in the future?"}, {"time": 14359, "text": "You're saying it's harder than conjure up things from scratch."}, {"time": 14365, "text": "So the main way I would think about it is in terms of the demand for simulation versus other kinds of things."}, {"time": 14371, "text": "So I've given this a lot of thought because I first wrote about this long ago when Bostrom first wrote his papers about simulation argument and I wrote about how to live in a simulation."}, {"time": 14382, "text": "And so the key issue is the fraction of creatures in the universe that are really experiencing what you appear to be really experiencing relative to the fraction that are experiencing it in a simulation way, i.e., simulated."}, {"time": 14397, "text": "So then the key parameter is at any one moment in time, creatures at that time, many of them, most of them are presumably really experiencing what they're experiencing, but some fraction of them are experiencing some past time where that past time is being remembered via their simulation."}, {"time": 14419, "text": "So to figure out this ratio, what we need to think about is basically two functions."}, {"time": 14426, "text": "One is how fast in time does the number of creatures grow?"}, {"time": 14430, "text": "And then how fast in time does the interest in the past decline?"}, {"time": 14434, "text": "Because at any one time, people will be simulating different periods in the past with different emphasis."}, {"time": 14440, "text": "I love the way you think so much."}, {"time": 14444, "text": "So if the first function grows slower than the second one declines, then in fact, your chances of being simulated are low."}, {"time": 14454, "text": "So the key question is how fast does interest in the past decline relative to the rate at which the population grows with time?"}, {"time": 14460, "text": "Does this correlate to you earlier suggested that the interest in the future increases over time, are those correlated interest in the future versus interest in the past?"}, {"time": 14469, "text": "Like, why are we interested in the past?"}, {"time": 14471, "text": "So, but the simple way to do it is, as you know, like Google Ngrams has a way to type in a word and see how interest in it declines or rises over time, right?"}, {"time": 14480, "text": "You can just type in a year and get the answer for that."}, {"time": 14484, "text": "If you type in a particular year, like 1900 or 1950, you can see with Google Ngram, how interest in that year increased up until that date and decreased after it."}, {"time": 14495, "text": "And you can see that interest in a date declines faster than does the population grow with time."}, {"time": 14502, "text": "That is brilliant."}, {"time": 14504, "text": "That is so interesting."}, {"time": 14505, "text": "And so you have the answer."}, {"time": 14510, "text": "And that was your argument against, not against to this particular aspect of the simulation, how much past simulation there will be, replay of past memories."}, {"time": 14521, "text": "First of all, if we assume that like simulation of the past is a small fraction of all the creatures at that moment."}, {"time": 14528, "text": "And then it's about how fast."}, {"time": 14530, "text": "Now, some people have argued plausibly that maybe most interest in the past falls with this fast function, but some unusual category of interest in the past won't fall that fast quickly."}, {"time": 14540, "text": "And then that eventually would dominate."}, {"time": 14542, "text": "So that's a other hypothesis you want."}, {"time": 14544, "text": "Some category."}, {"time": 14545, "text": "So that very outlier specific kind of, yeah, okay."}, {"time": 14549, "text": "Like really popular kinds of memories, like probably sexual."}, {"time": 14555, "text": "In a trillion years, there's some small research institute that tries to randomly select from all possible people in history or something to simulate."}, {"time": 14566, "text": "So the question is how big is this research institute and how big is the future in a trillion years, right?"}, {"time": 14571, "text": "And that would be hard to say."}, {"time": 14572, "text": "But if we just look at the ordinary process by which people simulate recent errors."}, {"time": 14577, "text": "So if you look at, it's also true for movies and plays and video games, overwhelmingly they're interested in the recent past."}, {"time": 14584, "text": "There's very few video games where you play someone in the Roman Empire."}, {"time": 14588, "text": "But even fewer where you play someone in the ancient Egyptian Empire."}, {"time": 14594, "text": "Yeah, just different."}, {"time": 14595, "text": "It's just declined very quickly."}, {"time": 14596, "text": "But every once in a while that's brought back."}, {"time": 14600, "text": "But yeah, you're right."}, {"time": 14601, "text": "I mean, just if you look at the mass of entertainment, movies and games, it's focusing on the present recent past."}, {"time": 14609, "text": "And maybe some, I mean, where does science fiction fit into this?"}, {"time": 14612, "text": "Because it's sort of, what is science fiction?"}, {"time": 14619, "text": "I mean, it's a mix of the past and the present and some kind of manipulation of that to make it more efficient for us to ask deep philosophical questions about humanity."}, {"time": 14628, "text": "The closest genre to science fiction is clearly fantasy."}, {"time": 14631, "text": "Fantasy and science fiction in many bookstores and even Netflix or whatever categories, they're just lumped together."}, {"time": 14636, "text": "So clearly they have a similar function."}, {"time": 14638, "text": "So that the function of fantasy is more transparent than the function of science fiction."}, {"time": 14642, "text": "So use that as your guide."}, {"time": 14644, "text": "What's fantasy for is just to take away the constraints of the ordinary world and imagine stories with much fewer constraints."}, {"time": 14650, "text": "That's what fantasy is."}, {"time": 14651, "text": "You are much less constrained."}, {"time": 14653, "text": "What's the purpose to remove constraints?"}, {"time": 14654, "text": "Is it to escape from the harshness of the constraints of the real world?"}, {"time": 14659, "text": "Or is it to just remove constraints in order to explore some, get a deeper understanding of our world?"}, {"time": 14666, "text": "I mean, why do people read fantasy?"}, {"time": 14668, "text": "I'm not a cheap fantasy reading kind of person."}, {"time": 14674, "text": "So I need to... One story that sounds plausible to me is that there are sort of these deep story structures that we love and we want to realize."}, {"time": 14683, "text": "And then many details of the world get in their way."}, {"time": 14686, "text": "Fantasy takes all those obstacles out of the way and lets you tell the essential hero story or the essential love story, whatever essential story you want to tell."}, {"time": 14693, "text": "Well, the reality and constraints are not in the way."}, {"time": 14699, "text": "And so science fiction can be thought of as like fantasy, except you're not willing to admit that it can't be true."}, {"time": 14704, "text": "So the future gives the excuse of saying, well, it could happen."}, {"time": 14709, "text": "And you accept some more reality constraints for the illusion, at least, that maybe it could really happen."}, {"time": 14716, "text": "Maybe it could happen."}, {"time": 14718, "text": "And that, it stimulates the imagination."}, {"time": 14720, "text": "Imagination is something really interesting about human beings."}, {"time": 14724, "text": "And it seems also to be an important part of creating really special things is to be able to first imagine them."}, {"time": 14730, "text": "With you and Nick Bostrom, where do you land on the simulation and all the mathematical ways of thinking it and just the thought experiment of it?"}, {"time": 14744, "text": "That was just the discussion we just had."}, {"time": 14746, "text": "That is, you should grant the possibility of being a simulation."}, {"time": 14750, "text": "You shouldn't be 100% confident that you're not."}, {"time": 14752, "text": "You should certainly grant a small probability."}, {"time": 14754, "text": "The question is, how large is that probability?"}, {"time": 14756, "text": "Are you saying we would be, I misunderstood because I thought our discussion was about replaying things that already happened."}, {"time": 14763, "text": "But the whole question is, right now, is that what I am?"}, {"time": 14768, "text": "Am I actually a replay from some distant future?"}, {"time": 14771, "text": "But it doesn't necessarily need to be a replay."}, {"time": 14773, "text": "It could be a totally new."}, {"time": 14775, "text": "You could be, you don't have to be an NPC."}, {"time": 14777, "text": "Clearly, I'm in a certain era with a certain kind of world around me."}, {"time": 14780, "text": "So either this is a complete fantasy or it's a past of somebody else in the future."}, {"time": 14786, "text": "No, it could be a complete fantasy though."}, {"time": 14788, "text": "But then you have to talk about what's the fraction of complete fantasies."}, {"time": 14793, "text": "I would say it's easier to generate a fantasy than to replay a memory."}, {"time": 14797, "text": "Oh, but the fraction is important."}, {"time": 14799, "text": "We just look at the entire history of everything."}, {"time": 14801, "text": "We just say, sure, but most things are real."}, {"time": 14803, "text": "Most things aren't fantasies."}, {"time": 14805, "text": "Therefore, the chance that my thing is real."}, {"time": 14807, "text": "So the simulation argument works stronger about sort of the past."}, {"time": 14810, "text": "We say, ah, but there's more future people than there are today."}, {"time": 14813, "text": "So you being in the past of the future makes you special relative to them, which makes you more likely to be in a simulation."}, {"time": 14820, "text": "If we're just taking the full count and saying, in all creatures ever, what percentage are in simulations?"}, {"time": 14825, "text": "Probably no more than 10%."}, {"time": 14828, "text": "So what's the good argument for that?"}, {"time": 14830, "text": "That most things are real?"}, {"time": 14832, "text": "Because a classroom says the other way, right?"}, {"time": 14834, "text": "In a competitive world, in a world where people have to work and have to get things done, then they have a limited budget for leisure."}, {"time": 14844, "text": "And so, you know, leisure things are less common than work things, like real things."}, {"time": 14849, "text": "But if you look at the stretch of history in the universe, doesn't the ratio of leisure increase?"}, {"time": 14861, "text": "Isn't that where we, isn't that the forger?"}, {"time": 14865, "text": "Right, but now we're looking at the fraction of leisure, which takes the form of something where the person doing the leisure doesn't realize it."}, {"time": 14871, "text": "Now there could be some fraction of that, but that's much smaller, right?"}, {"time": 14877, "text": "Clueless forgers."}, {"time": 14878, "text": "Or somebody is clueless in the process of supporting this leisure, right?"}, {"time": 14882, "text": "It might not be the person leisureing, somebody, they're a supporting character or something, but still that's got to be a pretty small fraction of leisure."}, {"time": 14887, "text": "What, you mentioned that children are one of the things that are a source of meaning."}, {"time": 14893, "text": "Broadly speaking, then let me ask the big question."}, {"time": 14896, "text": "What's the meaning of this whole thing?"}, {"time": 14899, "text": "Robin, meaning of life."}, {"time": 14903, "text": "We talked about alien civilizations, but this is the one we got."}, {"time": 14907, "text": "Where are the aliens?"}, {"time": 14908, "text": "Where are the human?"}, {"time": 14910, "text": "Seem to be conscious, be able to introspect."}, {"time": 14915, "text": "What's, why are we here?"}, {"time": 14917, "text": "This is the thing I told you before about how we can predict that future creatures will be different from us."}, {"time": 14923, "text": "We, our preferences are this amalgam of various sorts of random sort of patched together preferences about thirst and sex and sleep and attention and all these sorts of things."}, {"time": 14937, "text": "So we don't understand that very well."}, {"time": 14939, "text": "It's not very transparent and it's a mess, right?"}, {"time": 14943, "text": "That is the source of our motivation."}, {"time": 14945, "text": "That is how we were made and how we are induced to do things."}, {"time": 14949, "text": "But we can't summarize it very well and we don't even understand it very well."}, {"time": 14955, "text": "And often we find ourselves in a situation where we don't feel very motivated."}, {"time": 14958, "text": "In other situations, we find ourselves very motivated and we don't know why either."}, {"time": 14964, "text": "And so that's the nature of being a human of the sort that we are because even though we can think abstractly and reason abstractly, this package of motivations is just opaque and a mess."}, {"time": 14974, "text": "And that's what it means to be a human today and the motivation."}, {"time": 14979, "text": "We can't very well tell the meaning of our life."}, {"time": 14982, "text": "It is this mess that our descendants will be different."}, {"time": 14984, "text": "They will actually know exactly what they want."}, {"time": 14988, "text": "And it will be to have more descendants."}, {"time": 14990, "text": "That will be the meaning for them."}, {"time": 14992, "text": "Well, it's funny that you have the certainty."}, {"time": 14994, "text": "You have more certainty."}, {"time": 14996, "text": "You have more transparency about our descendants than you do about your own self."}]}]