[{"title": "Sergey Levine: Robotics and Machine Learning | Lex Fridman Podcast #108", "id": "kxi-_TT_-Nc", "quotes": [{"time": 382, "text": "I'm going to read into your question as asking about the implications of this for AI."}, {"time": 386, "text": "Because I'm not a biologist, I can't really like speak authoritatively."}, {"time": 390, "text": "So until we go on it, if it's so, if it's all about learning, then there's more hope for AI."}, {"time": 398, "text": "So the way that I look at this is that, you know, well, first, of course, biology is very messy."}, {"time": 405, "text": "And it's if you ask the question, how does a person do something or has a person's mind do something, you can come up with a bunch of hypotheses and oftentimes you can find support for many different, often conflicting hypotheses."}, {"time": 418, "text": "One way that we can approach the question of what the implications of this for AI are is we can think about what's sufficient."}, {"time": 425, "text": "So you know, maybe a person is from birth very, very good at some things like, for example, recognizing faces."}, {"time": 432, "text": "There's a very strong evolutionary pressure to do that."}, {"time": 433, "text": "If you can recognize your mother's face, then you're more likely to survive and therefore people are good at this."}, {"time": 440, "text": "But we can also ask like, what's the minimum sufficient thing?"}, {"time": 443, "text": "And one of the ways that we can study the minimal sufficient thing is we could, for example, see what people do in unusual situations."}, {"time": 449, "text": "If you present them with things that evolution couldn't have prepared them for, you know, our daily lives actually do this to us all the time."}, {"time": 456, "text": "We didn't evolve to deal with, you know, automobiles and space flight and whatever."}, {"time": 461, "text": "So there are all these situations that we can find ourselves in and we do very well there."}, {"time": 466, "text": "Like I can give you a joystick to control a robotic arm, which you've never used before and you might be pretty bad for the first couple of seconds."}, {"time": 472, "text": "But if I tell you like your life depends on using this robotic arm to like open this door, you'll probably manage it."}, {"time": 479, "text": "Even though you've never seen this device before, you've never used the joystick control us and you'll kind of muddle through it."}, {"time": 484, "text": "And that's not your evolved natural ability."}, {"time": 488, "text": "That's your, your flexibility or your adaptability."}, {"time": 491, "text": "And that's exactly where our current robotic systems really kind of fall flat."}, {"time": 494, "text": "But I wonder how much general, almost what we think of as common sense, pre trained models underneath all of that."}, {"time": 504, "text": "So that ability to adapt to a joystick is, requires you to have a kind of, you know, I'm human."}, {"time": 513, "text": "So it's hard for me to introspect all the knowledge I have about the world, but it seems like there might be an iceberg underneath of the amount of knowledge we actually bring to the table."}, {"time": 523, "text": "That's kind of the open question."}, {"time": 525, "text": "There's absolutely an iceberg of knowledge that we bring to the table, but I think it's very likely that iceberg of knowledge is actually built up over our lifetimes."}, {"time": 534, "text": "Because we have, you know, we have a lot of prior experience to draw on."}, {"time": 538, "text": "And it kind of makes sense that the right way for us to, you know, to optimize our, our efficiency, our evolutionary fitness and so on is to utilize all of that experience to build up the best iceberg we can get."}, {"time": 553, "text": "And that's actually one of the, you know, while that sounds an awful lot like what machine learning actually does, I think that for modern machine learning, it's actually a really big challenge to take this unstructured mass of experience and distill out something that looks like a common sense understanding of the world."}, {"time": 568, "text": "And perhaps part of that isn't, it's not because something about machine learning itself is, is broken or hard, but because we've been a little too rigid in subscribing to a very supervised, very rigid notion of learning, you know, kind of the input output, X's go to Y's sort of model."}, {"time": 583, "text": "And maybe what we really need to do is to view the world more as like a mass of experience that is not necessarily providing any rigid supervision, but sort of providing many, many instances of things that could be."}, {"time": 596, "text": "And then you take that and you distill it into some sort of common sense understanding."}, {"time": 600, "text": "I see what you're, you're painting an optimistic, beautiful picture, especially from the robotics perspective because that means we just need to invest and build better learning algorithms, figure out how we can get access to more and more data for those learning algorithms to extract signal from, and then accumulate that iceberg of knowledge."}, {"time": 622, "text": "It's a beautiful picture."}, {"time": 623, "text": "It's a hopeful one."}, {"time": 625, "text": "I think it's potentially a little bit more than just that."}, {"time": 629, "text": "And this is, this is where we perhaps reach the limits of our current understanding."}, {"time": 663, "text": "And it chooses which parts of the world it gets to interact with and observe and learn from."}, {"time": 671, "text": "It may be that the world is so complex that simply obtaining a large mass of sort of IID samples of the world is a very difficult way to go."}, {"time": 704, "text": "One reason we might think that this is true is that, you know, what we associate with common sense or lack of common sense is often characterized by the ability to reason about kind of counterfactual questions like, you know, if I were to hear this bottle of water sitting on the table, everything is fine if I were to knock it over, which I'm not going to do."}, {"time": 725, "text": "But if I were to do that, what would happen?"}, {"time": 727, "text": "And I know that nothing good would happen from that."}, {"time": 730, "text": "But if I have a bad understanding of the world, I might think that that's a good way for me to like, you know, gain more utility."}, {"time": 736, "text": "If I actually go about my daily life doing the things that my current understanding of the world suggests will give me high utility, in some ways, I'll get exactly the right supervision to tell me not to do those bad things and to keep doing the good things."}, {"time": 753, "text": "So there's a spectrum between IID, random walk through the space of data, and then there's and what we humans do, I don't even know if we do it optimal, but that might be beyond."}, {"time": 765, "text": "So this open question that you raised, where do you think systems, intelligent systems that would be able to deal with this world fall?"}, {"time": 776, "text": "Can we do pretty well by reading all of Wikipedia, sort of randomly sampling it like language models do?"}, {"time": 783, "text": "Or do we have to be exceptionally selective and intelligent about which aspects of the world we interact with?"}, {"time": 792, "text": "So I think this is first an open scientific problem, and I don't have like a clear answer, but I can speculate a little bit."}, {"time": 798, "text": "And what I would speculate is that you don't need to be super, super careful."}, {"time": 803, "text": "I think it's less about like, being careful to avoid the useless stuff, and more about making sure that you hit on the really important stuff."}, {"time": 811, "text": "So perhaps it's okay, if you spend part of your day, just, you know, guided by your curiosity, reading interesting regions of your state space, but it's important for you to, you know, every once in a while, make sure that you really try out the solutions that your current model of the world suggests might be effective, and observe whether those solutions are working as you expect or not."}, {"time": 833, "text": "And perhaps some of that is really essential to have kind of a perpetual improvement loop."}, {"time": 839, "text": "This perpetual improvement loop is really like, that's really the key, the key that's going to potentially distinguish the best current methods from the best methods of tomorrow in a sense."}, {"time": 848, "text": "How important do you think is exploration or total out of the box thinking exploration in this space as you jump to totally different domains?"}, {"time": 859, "text": "So you kind of mentioned there's an optimization problem, you kind of kind of explore the specifics of a particular strategy, whatever the thing you're trying to solve."}, {"time": 867, "text": "How important is it to explore totally outside of the strategies that have been working for you so far?"}, {"time": 875, "text": "Yeah, I think it's a very problem dependent kind of question."}, {"time": 878, "text": "And I think that that's actually, you know, in some ways that question gets at one of the big differences between sort of the classic formulation of a reinforcement learning problem and some of the sort of more open ended reformulations of that problem that have been explored in recent years."}, {"time": 898, "text": "So classically reinforcement learning is framed as a problem of maximizing utility, like any kind of rational AI agent, and then anything you do is in service to maximizing that utility."}, {"time": 908, "text": "But a very interesting kind of way to look at, I'm not necessarily saying this is the best way to look at it, but an interesting alternative way to look at these problems is as something where you first get to explore the world, however you please, and then afterwards you will be tasked with doing something."}, {"time": 926, "text": "And that might suggest a somewhat different solution."}, {"time": 949, "text": "And that you see that as the modern formulation of the reinforcement learning problem, as a kind of the more multitask, the general intelligence kind of formulation."}, {"time": 960, "text": "I think that's one possible vision of where things might be headed."}, {"time": 964, "text": "I don't think that's by any means the mainstream or standard way of doing things, and it's not like if I had to..."}, {"time": 969, "text": "But I like it."}, {"time": 970, "text": "It's a beautiful vision."}, {"time": 971, "text": "So maybe you actually take a step back."}, {"time": 974, "text": "What is the goal of robotics?"}, {"time": 976, "text": "What's the general problem of robotics we're trying to solve?"}, {"time": 978, "text": "You actually kind of painted two pictures here."}, {"time": 981, "text": "One of sort of the narrow, one of the general."}, {"time": 983, "text": "What in your view is the big problem of robotics?"}, {"time": 986, "text": "And ridiculously philosophical high level questions."}, {"time": 991, "text": "I think that maybe there are two ways I can answer this question."}, {"time": 994, "text": "One is there's a very pragmatic problem, which is like what would make robots, what would sort of maximize the usefulness of robots?"}, {"time": 1004, "text": "And there the answer might be something like a system where a system that can perform whatever task a human user sets for it, within the physical constraints, of course."}, {"time": 1019, "text": "If you tell it to teleport to another planet, it probably can't do that."}, {"time": 1022, "text": "But if you ask it to do something that's within its physical capability, then potentially with a little bit of additional training or a little bit of additional trial and error, it ought to be able to figure it out in much the same way as like a human teleoperator ought to figure out how to drive the robot to do that."}, {"time": 1036, "text": "That's kind of the very pragmatic view of what it would take to kind of solve the robotics problem, if you will."}, {"time": 1044, "text": "But I think that there is a second answer, and that answer is a lot closer to why I want to work on robotics, which is that I think it's less about what it would take to do a really good job in the world of robotics, but more the other way around, what robotics can bring to the table to help us understand artificial intelligence."}, {"time": 1064, "text": "So your dream fundamentally is to understand intelligence?"}, {"time": 1069, "text": "And I think that's the dream for many people who actually work in this space."}, {"time": 1073, "text": "I think that there's something very pragmatic and very useful about studying robotics, but I do think that a lot of people that go into this field actually, you know, the things that they draw inspiration from are the potential for robots to like help us learn about intelligence and about ourselves."}, {"time": 1090, "text": "So that's fascinating that robotics is basically the space by which you can get closer to understanding the fundamentals of artificial intelligence."}, {"time": 1100, "text": "So what is it about robotics that's different from some of the other approaches?"}, {"time": 1105, "text": "So if we look at some of the early breakthroughs in deep learning or in the computer vision space and the natural language processing, there's really nice clean benchmarks that a lot of people competed on and thereby came up with a lot of brilliant ideas."}, {"time": 1118, "text": "What's the fundamental difference to you between computer vision purely defined and ImageNet and kind of the bigger robotics problem?"}, {"time": 1126, "text": "So there are a couple of things."}, {"time": 1128, "text": "One is that with robotics, you kind of have to take away many of the crutches."}, {"time": 1135, "text": "So you have to deal with both the particular problems of perception control and so on, but you also have to deal with the integration of those things."}, {"time": 1144, "text": "And you know, classically, we've always thought of the integration as kind of a separate problem."}, {"time": 1148, "text": "So a classic kind of modular engineering approach is that we solve the individual subproblems and then wire them together and then the whole thing works."}, {"time": 1156, "text": "And one of the things that we've been seeing over the last couple of decades is that, well, maybe studying the thing as a whole might lead to just like very different solutions than if we were to study the parts and wire them together."}, {"time": 1166, "text": "So the integrative nature of robotics research helps us see, you know, the different perspectives on the problem."}, {"time": 1174, "text": "Another part of the answer is that with robotics, it casts a certain paradox into very clever relief."}, {"time": 1181, "text": "This is sometimes referred to as Moravec's paradox, the idea that in artificial intelligence, things that are very hard for people can be very easy for machines and vice versa."}, {"time": 1192, "text": "Things that are very easy for people can be very hard for machines."}, {"time": 1194, "text": "So you know, integral and differential calculus is pretty difficult to learn for people."}, {"time": 1202, "text": "But if you program a computer, do it, it can derive derivatives and integrals for you all day long without any trouble."}, {"time": 1208, "text": "Whereas some things like, you know, drinking from a cup of water, very easy for a person to do, very hard for a robot to deal with."}, {"time": 1216, "text": "And sometimes when we see such blatant discrepancies, that gives us a really strong hint that we're missing something important."}, {"time": 1223, "text": "So if we really try to zero in on those discrepancies, we might find that little bit that we're missing."}, {"time": 1228, "text": "And it's not that we need to make machines better or worse at math and better at drinking water, but just that by studying those discrepancies, we might find some new insight."}, {"time": 1237, "text": "So that could be in any space, it doesn't have to be robotics."}, {"time": 1241, "text": "But you're saying, I mean, it's kind of interesting that robotics seems to have a lot of those discrepancies."}, {"time": 1249, "text": "So the Hans Marvak paradox is probably referring to the space of the physical interaction, like you said, object manipulation, walking, all the kind of stuff we do in the physical world."}, {"time": 1261, "text": "How do you make sense if you were to try to disentangle the Marvak paradox, like why is there such a gap in our intuition about it?"}, {"time": 1277, "text": "Why do you think manipulating objects is so hard from everything you've learned from applying reinforcement learning in this space?"}, {"time": 1285, "text": "Yeah, I think that one reason is maybe that for many of the other problems that we've studied in AI and computer science and so on, the notion of input output and supervision is much, much cleaner."}, {"time": 1302, "text": "So computer vision, for example, deals with very complex inputs."}, {"time": 1305, "text": "But it's comparatively a bit easier, at least up to some level of abstraction, to cast it as a very tightly supervised problem."}, {"time": 1314, "text": "It's comparatively much, much harder to cast robotic manipulation as a very tightly supervised problem."}, {"time": 1320, "text": "You can do it, it just doesn't seem to work all that well."}, {"time": 1323, "text": "So you could say that, well, maybe we get a labeled data set where we know exactly which motor commands to send, and then we train on that."}, {"time": 1329, "text": "But for various reasons, that's not actually such a great solution."}, {"time": 1333, "text": "And it also doesn't seem to be even remotely similar to how people and animals learn to do things, because we're not told by our parents, here's how you fire your muscles in order to walk."}, {"time": 1344, "text": "So we do get some guidance, but the really low level detailed stuff we figure out mostly on our own."}, {"time": 1350, "text": "And that's what you mean by tightly coupled, that every single little sub action gets a supervised signal of whether it's a good one or not."}, {"time": 1358, "text": "So while in computer vision, you could sort of imagine up to a level of abstraction that maybe somebody told you this is a car and this is a cat and this is a dog, in motor control, it's very clear that that was not the case."}, {"time": 1369, "text": "If we look at sort of the sub spaces of robotics, that, again, as you said, robotics integrates all of them together, and we get to see how this beautiful mess interplays."}, {"time": 1380, "text": "But so there's nevertheless still perception."}, {"time": 1384, "text": "So it's the computer vision problem, broadly speaking, understanding the environment."}, {"time": 1389, "text": "And there's also maybe you can correct me on this kind of categorization of the space, and there's prediction in trying to anticipate what things are going to do into the future in order for you to be able to act in that world."}, {"time": 1404, "text": "And then there's also this game theoretic aspect of how your actions will change the behavior of others."}, {"time": 1414, "text": "In this kind of space, what, and this is bigger than reinforcement learning, this is just broadly looking at the problem of robotics, what's the hardest problem here?"}, {"time": 1422, "text": "Or is there, or is what you said true that when you start to look at all of them together, that's a whole nother thing, like you can't even say which one individually is harder because all of them together, you should only be looking at them all together."}, {"time": 1441, "text": "I think when you look at them all together, some things actually become easier."}, {"time": 1445, "text": "And I think that's actually pretty important."}, {"time": 1447, "text": "So we had back in 2014, we had some work, basically our first work on end to end reinforcement learning for robotic manipulation skills from vision, which at the time was something that seemed a little inflammatory and controversial in the robotics world."}, {"time": 1465, "text": "But other than the inflammatory and controversial part of it, the point that we were actually trying to make in that work is that for the particular case of combining perception and control, you could actually do better if you treat them together than if you try to separate them."}, {"time": 1480, "text": "And the way that we tried to demonstrate this is we picked a fairly simple motor control task where a robot had to insert a little red trapezoid into a trapezoidal hole."}, {"time": 1489, "text": "And we had our separated solution, which involved first detecting the hole using a pose detector and then actuating the arm to put it in."}, {"time": 1497, "text": "And then our intent solution, which just mapped pixels to the torques."}, {"time": 1501, "text": "And one of the things we observed is that if you use the intent solution, essentially the pressure on the perception part of the model is actually lower."}, {"time": 1508, "text": "Like it doesn't have to figure out exactly where the thing is in 3D space."}, {"time": 1511, "text": "It just needs to figure out where it is, you know, distributing the errors in such a way that the horizontal difference matters more than the vertical difference because vertically it just pushes it down all the way until it can't go any further."}, {"time": 1522, "text": "And their perceptual errors are a lot less harmful, whereas perpendicular to the direction of motion, perceptual errors are much more harmful."}, {"time": 1529, "text": "So the point is that if you combine these two things, you can trade off errors between the components optimally to best accomplish the task."}, {"time": 1538, "text": "And the components can actually be weaker while still leading to better overall performance."}, {"time": 1541, "text": "It's a profound idea."}, {"time": 1544, "text": "I mean, in the space of pegs and things like that, it's quite simple."}, {"time": 1548, "text": "It almost is tempting to overlook, but that seems to be at least intuitively an idea that should generalize to basically all aspects of perception and control, that one strengthens the other."}, {"time": 1563, "text": "And we, you know, people who have studied sort of perceptual heuristics in humans and animals find things like that all the time."}, {"time": 1568, "text": "So one very well known example of this is something called the gaze heuristic, which is a little trick that you can use to intercept a flying object."}, {"time": 1577, "text": "So if you want to catch a ball, for instance, you could try to localize it in 3D space, estimate its velocity, estimate the effect of wind resistance, solve a complex system of differential equations in your head."}, {"time": 1587, "text": "Or you can maintain a running speed so that the object stays in the same position as in your field of view."}, {"time": 1594, "text": "So if it dips a little bit, you speed up."}, {"time": 1595, "text": "If it rises a little bit, you slow down."}, {"time": 1598, "text": "And if you follow the simple rule, you'll actually arrive at exactly the place where the object lands and you'll catch it."}, {"time": 1603, "text": "And humans use it when they play baseball, human pilots use it when they fly airplanes to figure out if they're about to collide with somebody, frogs use this to catch insects and so on and so on."}, {"time": 1611, "text": "So this is something that actually happens in nature."}, {"time": 1613, "text": "And I'm sure this is just one instance of it that we were able to identify just because all the scientists were able to identify because it's so prevalent, but there are probably many others."}, {"time": 1621, "text": "Do you have a, just so we can zoom in as we talk about robotics, do you have a canonical problem, sort of a simple, clean, beautiful representative problem in robotics that you think about when you're thinking about some of these problems?"}, {"time": 1636, "text": "We talked about robotic manipulation, to me that seems intuitively, at least the robotics community has converged towards that as a space that's the canonical problem."}, {"time": 1648, "text": "If you agree, then maybe do you zoom in in some particular aspect of that problem that you just like?"}, {"time": 1654, "text": "Like if we solve that problem perfectly, it'll unlock a major step towards human level intelligence."}, {"time": 1664, "text": "I don't think I have like a really great answer to that."}, {"time": 1666, "text": "And I think partly the reason I don't have a great answer kind of has to do with the, it has to do with the fact that the difficulty is really in the flexibility and adaptability rather than in doing a particular thing really, really well."}, {"time": 1681, "text": "So it's hard to just say like, oh, if you can, I don't know, like shuffle a deck of cards as fast as like a Vegas casino dealer, then you'll be very proficient."}, {"time": 1692, "text": "It's really the ability to quickly figure out how to do some arbitrary new thing well enough to like, you know, to move on to the next arbitrary thing."}, {"time": 1706, "text": "But the source of newness and uncertainty, have you found problems in which it's easy to generate new newnessnesses?"}, {"time": 1718, "text": "New types of newness."}, {"time": 1721, "text": "So a few years ago, so if you had asked me this question around like 2016, maybe I would have probably said that robotic grasping is a really great example of that because it's a task with great real world utility."}, {"time": 1734, "text": "Like you will get a lot of money if you can do it well."}, {"time": 1737, "text": "What is robotic grasping?"}, {"time": 1738, "text": "Picking up any object with a robotic hand."}, {"time": 1743, "text": "So you will get a lot of money if you do it well, because lots of people want to run warehouses with robots and it's highly non trivial because very different objects will require very different grasping strategies."}, {"time": 1755, "text": "But actually since then, people have gotten really good at building systems to solve this problem to the point where I'm not actually sure how much more progress we can make with that as like the main guiding thing."}, {"time": 1769, "text": "But it's kind of interesting to see the kind of methods that have actually worked well in that space because robotic grasping classically used to be regarded very much as kind of almost like a geometry problem."}, {"time": 1781, "text": "So people who have studied the history of computer vision will find this very familiar that it's kind of in the same way that in the early days of computer vision, people thought of it very much as like an inverse graphics thing."}, {"time": 1792, "text": "In robotic grasping, people thought of it as an inverse physics problem essentially."}, {"time": 1797, "text": "You look at what's in front of you, figure out the shapes, then use your best estimate of the laws of physics to figure out where to put your fingers on, you pick up the thing."}, {"time": 1805, "text": "And it turns out that works really well for robotic grasping instantiated in many different recent works, including our own, but also ones from many other labs is to use learning methods with some combination of either exhaustive simulation or like actual real world trial and error."}, {"time": 1822, "text": "And it turns out that those things actually work really well and then you don't have to worry about solving geometry problems or physics problems."}, {"time": 1829, "text": "What are, just by the way, in the grasping, what are the difficulties that have been worked on?"}, {"time": 1836, "text": "So one is like the materials of things, maybe occlusions on the perception side."}, {"time": 1841, "text": "Why is it such a difficult, why is picking stuff up such a difficult problem?"}, {"time": 1845, "text": "Yeah, it's a difficult problem because the number of things that you might have to deal with or the variety of things that you have to deal with is extremely large."}, {"time": 1854, "text": "And oftentimes things that work for one class of objects won't work for other classes of objects."}, {"time": 1860, "text": "So if you, if you get really good at picking up boxes and now you have to pick up plastic bags, you know, you just need to employ a very different strategy."}, {"time": 1869, "text": "And there are many properties of objects that are more than just their geometry that has to do with, you know, the bits that are easier to pick up, the bits that are hard to pick up, the bits that are more flexible, the bits that will cause the thing to pivot and bend and drop out of your hand versus the bits that result in a nice secure grasp."}, {"time": 1888, "text": "Things that are flexible, things that if you pick them up the wrong way, they'll fall upside down and the contents will spill out."}, {"time": 1893, "text": "So there's all these little details that come up, but the task is still kind of can be characterized as one task."}, {"time": 1899, "text": "Like there's a very clear notion of you did it or you didn't do it."}, {"time": 1903, "text": "So in terms of spilling things, there creeps in this notion that starts to sound and feel like common sense reasoning."}, {"time": 1913, "text": "Do you think solving the general problem of robotics requires common sense reasoning, requires general intelligence, this kind of human level capability of, you know, like you said, be robust and deal with uncertainty, but also be able to sort of reason and assimilate different pieces of knowledge that you have?"}, {"time": 1938, "text": "What are your thoughts on the needs?"}, {"time": 1943, "text": "Of common sense reasoning in the space of the general robotics problem?"}, {"time": 1948, "text": "So I'm going to slightly dodge that question and say that I think maybe actually it's the other way around is that studying robotics can help us understand how to put common sense into our AI systems."}, {"time": 1960, "text": "One way to think about common sense is that, and why our current systems might lack common sense is that common sense is an emergent property of actually having to interact with a particular world, a particular universe, and get things done in that universe."}, {"time": 1976, "text": "So you might think that, for instance, like an image captioning system, maybe it looks at pictures of the world and it types out English sentences."}, {"time": 1985, "text": "So it kind of deals with our world."}, {"time": 1989, "text": "And then you can easily construct situations where image captioning systems do things that defy common sense, like give it a picture of a person wearing a fur coat and we'll say it's a teddy bear."}, {"time": 1998, "text": "But I think what's really happening in those settings is that the system doesn't actually live in our world."}, {"time": 2004, "text": "It lives in its own world that consists of pixels and English sentences and doesn't actually consist of having to put on a fur coat in the winter so you don't get cold."}, {"time": 2013, "text": "So perhaps the reason for the disconnect is that the systems that we have now simply inhabit a different universe."}, {"time": 2020, "text": "And if we build AI systems that are forced to deal with all of the messiness and complexity of our universe, maybe they will have to acquire common sense to essentially maximize their utility."}, {"time": 2031, "text": "Whereas the systems we're building now don't have to do that."}, {"time": 2033, "text": "They can take some shortcuts."}, {"time": 2037, "text": "You've a couple of times already sort of reframed the role of robotics in this whole thing."}, {"time": 2042, "text": "And for some reason, I don't know if my way of thinking is common, but I thought like we need to understand and solve intelligence in order to solve robotics."}, {"time": 2053, "text": "And you're kind of framing it as, no, robotics is one of the best ways to just study artificial intelligence and build sort of like, robotics is like the right space in which you get to explore some of the fundamental learning mechanisms, fundamental sort of multimodal multitask aggregation of knowledge mechanisms that are required for general intelligence."}, {"time": 2076, "text": "It's really interesting way to think about it, but let me ask about learning."}, {"time": 2081, "text": "Can the general sort of robotics, the epitome of the robotics problem be solved purely through learning, perhaps end to end learning, sort of learning from scratch as opposed to injecting human expertise and rules and heuristics and so on?"}, {"time": 2100, "text": "I think that in terms of the spirit of the question, I would say yes."}, {"time": 2104, "text": "I mean, I think that though in some ways it's maybe like an overly sharp dichotomy, I think that in some ways when we build algorithms, at some point a person does something, a person turned on the computer, a person implemented a TensorFlow."}, {"time": 2126, "text": "But yeah, I think that in terms of the point that you're getting at, I do think the answer is yes."}, {"time": 2130, "text": "I think that we can solve many problems that have previously required meticulous manual engineering through automated optimization techniques."}, {"time": 2140, "text": "And actually one thing I will say on this topic is I don't think this is actually a very radical or very new idea."}, {"time": 2145, "text": "I think people have been thinking about automated optimization techniques as a way to do control for a very, very long time."}, {"time": 2153, "text": "And in some ways what's changed is really more the name."}, {"time": 2158, "text": "So today we would say that, oh, my robot does machine learning, it does reinforcement learning."}, {"time": 2163, "text": "Maybe in the 1960s you'd say, oh, my robot is doing optimal control."}, {"time": 2168, "text": "And maybe the difference between typing out a system of differential equations and doing feedback linearization versus training a neural net, maybe it's not such a large difference."}, {"time": 2177, "text": "It's just pushing the optimization deeper and deeper into the thing."}, {"time": 2181, "text": "Well, it's interesting you think that way, but especially with deep learning that the accumulation of sort of experiences in data form to form deep representations starts to feel like knowledge as opposed to optimal control."}, {"time": 2198, "text": "So this feels like there's an accumulation of knowledge through the learning process."}, {"time": 2204, "text": "So I think that is a good point."}, {"time": 2205, "text": "That one big difference between learning based systems and classic optimal control systems is that learning based systems in principle should get better and better the more they do something."}, {"time": 2215, "text": "And I do think that that's actually a very, very powerful difference."}, {"time": 2218, "text": "So if we look back at the world of expert systems and symbolic AI and so on of using logic to accumulate expertise, human expertise, human encoded expertise, do you think that will have a role at some point?"}, {"time": 2233, "text": "The deep learning, machine learning, reinforcement learning has shown incredible results and breakthroughs and just inspired thousands, maybe millions of researchers."}, {"time": 2246, "text": "But there's this less popular now, but it used to be popular idea of symbolic AI."}, {"time": 2252, "text": "Do you think that will have a role?"}, {"time": 2255, "text": "I think in some ways the descendants of symbolic AI actually already have a role."}, {"time": 2264, "text": "So this is the highly biased history from my perspective."}, {"time": 2269, "text": "You say that, well, initially we thought that rational decision making involves logical manipulation."}, {"time": 2274, "text": "So you have some model of the world expressed in terms of logic."}, {"time": 2279, "text": "You have some query, like what action do I take in order for X to be true?"}, {"time": 2284, "text": "And then you manipulate your logical symbolic representation to get an answer."}, {"time": 2288, "text": "What that turned into somewhere in the 1990s is, well, instead of building kind of predicates and statements that have true or false values, we'll build probabilistic systems where things have probabilities associated and probabilities of being true and false."}, {"time": 2303, "text": "And that turned into Bayes nets."}, {"time": 2305, "text": "And that provided sort of a boost to what were really still essentially logical inference systems, just probabilistic logical inference systems."}, {"time": 2313, "text": "And then people said, well, let's actually learn the individual probabilities inside these models."}, {"time": 2319, "text": "And then people said, well, let's not even specify the nodes in the models, let's just put a big neural net in there."}, {"time": 2325, "text": "But in many ways, I see these as actually kind of descendants from the same idea."}, {"time": 2328, "text": "It's essentially instantiating rational decision making by means of some inference process and learning by means of an optimization process."}, {"time": 2337, "text": "So in a sense, I would say, yes, that it has a place."}, {"time": 2340, "text": "And in many ways that place is, it already holds that place."}, {"time": 2344, "text": "It's already in there."}, {"time": 2346, "text": "It's just quite different."}, {"time": 2347, "text": "It looks slightly different than it was before."}, {"time": 2350, "text": "But there are some things that we can think about that make this a little bit more obvious."}, {"time": 2353, "text": "Like if I train a big neural net model to predict what will happen in response to my robot's actions, and then I run probabilistic inference, meaning I invert that model to figure out the actions that lead to some plausible outcome, like to me, that seems like a kind of logic."}, {"time": 2367, "text": "You have a model of the world that just happens to be expressed by a neural net, and you are doing some inference procedure, some sort of manipulation on that model to figure out the answer to a query that you have."}, {"time": 2379, "text": "It's the interpretability."}, {"time": 2381, "text": "It's the explainability, though, that seems to be lacking more so because the nice thing about sort of expert systems is you can follow the reasoning of the system that to us mere humans is somehow compelling."}, {"time": 2396, "text": "It's just I don't know what to make of this fact that there's a human desire for intelligence systems to be able to convey in a poetic way to us why it made the decisions it did, like tell a convincing story."}, {"time": 2415, "text": "And perhaps that's like a silly human thing, like we shouldn't expect that of intelligence systems."}, {"time": 2423, "text": "I'm super happy that there is intelligence systems out there."}, {"time": 2427, "text": "But if I were to sort of psychoanalyze the researchers at the time, I would say expert systems connected to that part, that desire of AI researchers for systems to be explainable."}, {"time": 2440, "text": "I mean, maybe on that topic, do you have a hope that sort of inferences of learning based systems will be as explainable as the dream was with expert systems, for example?"}, {"time": 2455, "text": "I think it's a very complicated question because I think that in some ways the question of explainability is kind of very closely tied to the question of like performance, like, you know, why do you want your system to explain itself so that when it screws up, you can kind of figure out why it did it."}, {"time": 2474, "text": "But in some ways that's a much bigger problem, actually."}, {"time": 2477, "text": "Like your system might screw up and then it might screw up in how it explains itself."}, {"time": 2482, "text": "Or you might have some bug somewhere so that it's not actually doing what it was supposed to do."}, {"time": 2487, "text": "So, you know, maybe a good way to view that problem is really as a problem, as a bigger problem of verification and validation, of which explainability is sort of one component."}, {"time": 2499, "text": "I just see it differently."}, {"time": 2501, "text": "I see explainability, you put it beautifully, I think you actually summarize the field of explainability."}, {"time": 2506, "text": "But to me, there's another aspect of explainability, which is like storytelling that has nothing to do with errors or with, like, it uses errors as elements of its story as opposed to a fundamental need to be explainable when errors occur."}, {"time": 2528, "text": "It's just that for other intelligent systems to be in our world, we seem to want to tell each other stories."}, {"time": 2534, "text": "And that's true in the political world, that's true in the academic world."}, {"time": 2539, "text": "And that, you know, neural networks are less capable of doing that, or perhaps they're equally capable of storytelling and storytelling."}, {"time": 2546, "text": "Maybe it doesn't matter what the fundamentals of the system are."}, {"time": 2550, "text": "You just need to be a good storyteller."}, {"time": 2552, "text": "Maybe one specific story I can tell you about in that space is actually about some work that was done by my former collaborator, who's now a professor at MIT named Jacob Andreas."}, {"time": 2563, "text": "Jacob actually works in natural language processing, but he had this idea to do a little bit of work in reinforcement learning on how natural language can basically structure the internals of policies trained with RL."}, {"time": 2575, "text": "And one of the things he did is he set up a model that attempts to perform some task that's defined by a reward function, but the model reads in a natural language instruction."}, {"time": 2586, "text": "So this is a pretty common thing to do in instruction following."}, {"time": 2588, "text": "So you tell it like, you know, go to the red house and then it's supposed to go to the red house."}, {"time": 2593, "text": "But then one of the things that Jacob did is he treated that sentence, not as a command from a person, but as a representation of the internal kind of a state of the mind of this policy, essentially."}, {"time": 2606, "text": "So that when it was faced with a new task, what it would do is it would basically try to think of possible language descriptions, attempt to do them and see if they led to the right outcome."}, {"time": 2615, "text": "So it would kind of think out loud, like, you know, I'm faced with this new task."}, {"time": 2618, "text": "What am I going to do?"}, {"time": 2619, "text": "Let me go to the red house."}, {"time": 2620, "text": "Oh, that didn't work."}, {"time": 2621, "text": "Let me go to the blue room or something."}, {"time": 2623, "text": "Let me go to the green plant."}, {"time": 2625, "text": "And once it got some reward, it would say, oh, go to the green plant."}, {"time": 2627, "text": "That's what's working."}, {"time": 2628, "text": "I'm going to go to the green plant."}, {"time": 2629, "text": "And then you could look at the string that it came up with, and that was a description of how it thought it should solve the problem."}, {"time": 2634, "text": "So you could do, you could basically incorporate language as internal state and you can start getting some handle on these kinds of things."}, {"time": 2641, "text": "And then what I was kind of trying to get to is that also, if you add to the reward function, the convincingness of that story."}, {"time": 2650, "text": "So I have another reward signal of like people who review that story, how much they like it."}, {"time": 2656, "text": "So that, you know, initially that could be a hyperparameter sort of hard coded heuristic type of thing, but it's an interesting notion of the convincingness of the story becoming part of the reward function, the objective function of the explainability."}, {"time": 2674, "text": "That's in the world of sort of Twitter and fake news, that might be a scary notion that the nature of truth may not be as important as the convincingness of the, how convincing you are in telling the story around the facts."}, {"time": 2689, "text": "Well, let me ask the basic question."}, {"time": 2695, "text": "You're one of the world class researchers in reinforcement learning, deep reinforcement learning, certainly in the robotic space."}, {"time": 2701, "text": "What is reinforcement learning?"}, {"time": 2704, "text": "I think that what reinforcement learning refers to today is really just the kind of the modern incarnation of learning based control."}, {"time": 2713, "text": "So classically reinforcement learning has a much more narrow definition, which is that it's literally learning from reinforcement, like the thing does something and then it gets a reward or punishment."}, {"time": 2722, "text": "But really I think the way the term is used today is it's used to refer more broadly to learning based control."}, {"time": 2728, "text": "So some kind of system that's supposed to be controlling something and it uses data to get better."}, {"time": 2734, "text": "And what does control mean?"}, {"time": 2735, "text": "So this action is the fundamental element there."}, {"time": 2738, "text": "It means making rational decisions."}, {"time": 2741, "text": "And rational decisions are decisions that maximize a measure of utility."}, {"time": 2744, "text": "And sequentially, so you made decisions time and time and time again."}, {"time": 2748, "text": "Now like it's easier to see that kind of idea in the space of maybe games and the space of robotics."}, {"time": 2755, "text": "Do you see it bigger than that?"}, {"time": 2758, "text": "Is it applicable?"}, {"time": 2759, "text": "Like where are the limits of the applicability of reinforcement learning?"}, {"time": 2764, "text": "Yeah, so rational decision making is essentially the encapsulation of the AI problem viewed through a particular lens."}, {"time": 2773, "text": "So any problem that we would want a machine to do, an intelligent machine, can likely be represented as a decision making problem."}, {"time": 2780, "text": "Learning images is a decision making problem, although not a sequential one typically."}, {"time": 2786, "text": "Controlling a chemical plant is a decision making problem."}, {"time": 2790, "text": "Deciding what videos to recommend on YouTube is a decision making problem."}, {"time": 2794, "text": "And one of the really appealing things about reinforcement learning is if it does encapsulate the range of all these decision making problems, perhaps working on reinforcement learning is one of the ways to reach a very broad swath of AI problems."}, {"time": 2810, "text": "What is the fundamental difference between reinforcement learning and maybe supervised machine learning?"}, {"time": 2817, "text": "So reinforcement learning can be viewed as a generalization of supervised machine learning."}, {"time": 2822, "text": "You can certainly cast supervised learning as a reinforcement learning problem."}, {"time": 2825, "text": "You can just say your loss function is the negative of your reward."}, {"time": 2829, "text": "But you have stronger assumptions."}, {"time": 2830, "text": "You have the assumption that someone actually told you what the correct answer was, that your data was IID and so on."}, {"time": 2836, "text": "So you could view reinforcement learning as essentially relaxing some of those assumptions."}, {"time": 2840, "text": "Now that's not always a very productive way to look at it because if you actually have a supervised learning problem, you'll probably solve it much more effectively by using supervised learning methods because it's easier."}, {"time": 2849, "text": "But you can view reinforcement learning as a generalization of that."}, {"time": 2853, "text": "But they're fundamentally different."}, {"time": 2856, "text": "That's a mathematical statement."}, {"time": 2857, "text": "That's absolutely correct."}, {"time": 2858, "text": "But it seems that reinforcement learning, the kind of tools we bring to the table today of today."}, {"time": 2864, "text": "So maybe down the line, everything will be a reinforcement learning problem."}, {"time": 2869, "text": "Just like you said, image classification should be mapped to a reinforcement learning problem."}, {"time": 2873, "text": "But today, the tools and ideas, the way we think about them are different, sort of supervised learning has been used very effectively to solve basic narrow AI problems."}, {"time": 2887, "text": "Reinforcement learning kind of represents the dream of AI."}, {"time": 2891, "text": "It's very much so in the research space now in sort of captivating the imagination of people of what we can do with intelligent systems, but it hasn't yet had as wide of an impact as the supervised learning approaches."}, {"time": 2905, "text": "So my question comes from the more practical sense, like what do you see is the gap between the more general reinforcement learning and the very specific, yes, it's a question decision making with one step in the sequence of the supervised learning?"}, {"time": 2923, "text": "So from a practical standpoint, I think that one thing that is potentially a little tough now, and this is I think something that we'll see, this is a gap that we might see closing over the next couple of years, is the ability of reinforcement learning algorithms to effectively utilize large amounts of prior data."}, {"time": 2940, "text": "So one of the reasons why it's a bit difficult today to use reinforcement learning for all the things that we might want to use it for is that in most of the settings where we want to do rational decision making, it's a little bit tough to just deploy some policy that does crazy stuff and learns purely through trial and error."}, {"time": 2958, "text": "It's much easier to collect a lot of data, a lot of logs of some other policy that you've got, and then maybe if you can get a good policy out of that, then you deploy it and let it kind of fine tune a little bit."}, {"time": 2970, "text": "But algorithmically, it's quite difficult to do that."}, {"time": 2973, "text": "So I think that once we figure out how to get reinforcement learning to bootstrap effectively from large data sets, then we'll see very, very rapid growth in applications of these technologies."}, {"time": 2985, "text": "So this is what's referred to as off policy reinforcement learning or offline RL or batch RL."}, {"time": 2990, "text": "And I think we're seeing a lot of research right now that's bringing us closer and closer to that."}, {"time": 2994, "text": "Can you maybe paint the picture of the different methods?"}, {"time": 2997, "text": "So you said off policy, what's value based reinforcement learning?"}, {"time": 3002, "text": "What's policy based?"}, {"time": 3003, "text": "What's model based?"}, {"time": 3004, "text": "What's off policy, on policy?"}, {"time": 3005, "text": "What are the different categories of reinforcement learning?"}, {"time": 3008, "text": "So one way we can think about reinforcement learning is that it's, in some very fundamental way, it's about learning models that can answer kind of what if questions."}, {"time": 3020, "text": "So what would happen if I take this action that I hadn't taken before?"}, {"time": 3024, "text": "And you do that, of course, from experience, from data."}, {"time": 3026, "text": "And oftentimes you do it in a loop."}, {"time": 3028, "text": "So you build a model that answers these what if questions, use it to figure out the best action you can take, and then go and try taking that and see if the outcome agrees with what you predicted."}, {"time": 3038, "text": "So the different kinds of techniques basically refer to different ways of doing it."}, {"time": 3043, "text": "So model based methods answer a question of what state you would get, basically what would happen to the world if you were to take a certain action."}, {"time": 3050, "text": "Value based methods, they answer the question of what value you would get, meaning what utility you would get."}, {"time": 3057, "text": "But in a sense, they're not really all that different because they're both really just answering these what if questions."}, {"time": 3063, "text": "Now unfortunately for us, with current machine learning methods, answering what if questions can be really hard because they are really questions about things that didn't happen."}, {"time": 3072, "text": "If you wanted to answer what if questions about things that did happen, you wouldn't need a learn model."}, {"time": 3075, "text": "You would just like repeat the thing that worked before."}, {"time": 3079, "text": "And that's really a big part of why RL is a little bit tough."}, {"time": 3083, "text": "So if you have a purely on policy kind of online process, then you ask these what if questions, you make some mistakes, then you go and try doing those mistaken things."}, {"time": 3093, "text": "And then you observe kind of the counter examples that will teach you not to do those things again."}, {"time": 3097, "text": "If you have a bunch of off policy data and you just want to synthesize the best policy you can out of that data, then you really have to deal with the challenges of making these counterfactual."}, {"time": 3107, "text": "First of all, what's a policy?"}, {"time": 3110, "text": "A policy is a model or some kind of function that maps from observations of the world to actions."}, {"time": 3120, "text": "So in reinforcement learning, we often refer to the current configuration of the world as the state."}, {"time": 3126, "text": "So we say the state kind of encompasses everything you need to fully define where the world is at the moment."}, {"time": 3131, "text": "And depending on how we formulate the problem, we might say you either get to see the state or you get to see an observation, which is some snapshot, some piece of the state."}, {"time": 3139, "text": "So policy just includes everything in it in order to be able to act in this world."}, {"time": 3146, "text": "And so what does off policy mean?"}, {"time": 3149, "text": "Yeah, so the terms on policy and off policy refer to how you get your data."}, {"time": 3153, "text": "So if you get your data from somebody else who was doing some other stuff, maybe you get your data from some manually programmed system that was just running in the world before that's referred to as off policy data."}, {"time": 3166, "text": "But if you got the data by actually acting in the world based on what your current policy thinks is good, we call that on policy data."}, {"time": 3173, "text": "And obviously on policy data is more useful to you because if your current policy makes some bad decisions, you will actually see that those decisions are bad."}, {"time": 3181, "text": "Off policy data, however, might be much easier to obtain because maybe that's all the logged data that you have from before."}, {"time": 3188, "text": "So we talk about offline, talked about autonomous vehicles so you can envision off policy kind of approaches in robotic spaces where there's already a ton of robots out there, but they don't get the luxury of being able to explore based on a reinforcement learning framework."}, {"time": 3206, "text": "So how do we make, again, open question, but how do we make off policy methods work?"}, {"time": 3213, "text": "So this is something that has been kind of a big open problem for a while."}, {"time": 3217, "text": "And in the last few years, people have made a little bit of progress on that."}, {"time": 3221, "text": "You know, I can tell you about, and it's not by any means solved yet, but I can tell you some of the things that, for example, we've done to try to address some of the challenges."}, {"time": 3229, "text": "It turns out that one really big challenge with off policy reinforcement learning is that you can't really trust your models to give accurate predictions for any possible action."}, {"time": 3240, "text": "So if I've never tried to, if in my data set I never saw somebody steering the car off the road onto the sidewalk, my value function or my model is probably not going to predict the right thing if I ask what would happen if I were to steer the car off the road onto the sidewalk."}, {"time": 3255, "text": "So one of the important things you have to do to get off policy RL to work is you have to be able to figure out whether a given action will result in a trustworthy prediction or not."}, {"time": 3265, "text": "And you can use a kind of distribution estimation methods, kind of density estimation methods to try to figure that out."}, {"time": 3272, "text": "So you could figure out that, well, this action, my model is telling me that it's great, but it looks totally different from any action I've taken before, so my model is probably not correct."}, {"time": 3279, "text": "And you can incorporate regularization terms into your learning objective that will essentially tell you not to ask those questions that your model is unable to answer."}, {"time": 3290, "text": "What would lead to breakthroughs in this space, do you think?"}, {"time": 3294, "text": "Like what's needed?"}, {"time": 3295, "text": "Is this a data set question?"}, {"time": 3297, "text": "Do we need to collect big benchmark data sets that allow us to explore the space?"}, {"time": 3303, "text": "Is it a new kinds of methodologies?"}, {"time": 3308, "text": "Like what's your sense?"}, {"time": 3309, "text": "Or maybe coming together in a space of robotics and defining the right problem to be working on?"}, {"time": 3315, "text": "I think for off policy reinforcement learning in particular, it's very much an algorithms question right now."}, {"time": 3319, "text": "And this is something that I think is great because an algorithms question is that that just takes some very smart people to get together and think about it really hard, whereas if it was like a data problem or a hardware problem, that would take some serious engineering."}, {"time": 3334, "text": "So that's why I'm pretty excited about that problem because I think that we're in a position where we can make some real progress on it just by coming up with the right algorithms."}, {"time": 3342, "text": "In terms of which algorithms they could be, the problems at their core are very related to problems in things like causal inference."}, {"time": 3351, "text": "Because what you're really dealing with is situations where you have a model, a statistical model, that's trying to make predictions about things that it hadn't seen before."}, {"time": 3360, "text": "And if it's a model that's generalizing properly, that'll make good predictions."}, {"time": 3364, "text": "If it's a model that picks up on spurious correlations, that will not generalize properly."}, {"time": 3369, "text": "And then you have an arsenal of tools you can use."}, {"time": 3371, "text": "You could, for example, figure out what are the regions where it's trustworthy, or on the other hand, you could try to make it generalize better somehow, or some combination of the two."}, {"time": 3380, "text": "Is there room for mixing where most of it, like 90, 95% is off policy, you already have the data set, and then you get to send the robot out to do a little exploration?"}, {"time": 3396, "text": "What's that role of mixing them together?"}, {"time": 3399, "text": "I think that this is something that you actually described very well at the beginning of our discussion when you talked about the iceberg."}, {"time": 3407, "text": "This is the iceberg."}, {"time": 3408, "text": "The 99% of your prior experience, that's your iceberg."}, {"time": 3411, "text": "You'd use that for off policy reinforcement learning."}, {"time": 3414, "text": "And then, of course, if you've never opened that particular kind of door with that particular lock before, then you have to go out and fiddle with it a little bit."}, {"time": 3422, "text": "And that's that additional 1% to help you figure out a new task."}, {"time": 3425, "text": "And I think that's actually a pretty good recipe going forward."}, {"time": 3428, "text": "Is this, to you, the most exciting space of reinforcement learning now?"}, {"time": 3432, "text": "Or is there, what's, and maybe taking a step back, not just now, but what's, to you, is the most beautiful idea, apologize for the romanticized question, but the beautiful idea or concept in reinforcement learning?"}, {"time": 3447, "text": "In general, I actually think that one of the things that is a very beautiful idea in reinforcement learning is just the idea that you can obtain a near optimal control or near optimal policy without actually having a complete model of the world."}, {"time": 3465, "text": "This is, you know, it's something that feels perhaps kind of obvious if you just hear the term reinforcement learning or you think about trial and error learning."}, {"time": 3475, "text": "But from a controls perspective, it's a very weird thing because classically, you know, we think about engineered systems and controlling engineered systems as the problem of writing down some equations and then figuring out given these equations, you know, basically solve for X, figure out the thing that maximizes its performance."}, {"time": 3496, "text": "And the theory of reinforcement learning actually gives us a mathematically principled framework to think, to reason about, you know, optimizing some quantity when you don't actually know the equations that govern that system."}, {"time": 3508, "text": "And I don't, to me, that's actually seems kind of, you know, very elegant, not something that sort of becomes immediately obvious, at least in the mathematical sense."}, {"time": 3520, "text": "Does it make sense to you that it works at all?"}, {"time": 3522, "text": "Well, I think it makes sense when you take some time to think about it, but it is a little surprising."}, {"time": 3529, "text": "Well, then taking a step into the more deeper representations, which is also very surprising of sort of the richness of the state space, the space of environments that this kind of approach can operate in, can you maybe say what is deep reinforcement learning?"}, {"time": 3550, "text": "Well, deep reinforcement learning simply refers to taking reinforcement learning algorithms and combining them with high capacity neural net representations."}, {"time": 3560, "text": "Which is, you know, kind of, it might at first seem like a pretty arbitrary thing, just take these two components and stick them together."}, {"time": 3566, "text": "But the reason that it's something that has become so important in recent years is that reinforcement learning, it kind of faces an exacerbated version of a problem that has faced many other machine learning techniques."}, {"time": 3580, "text": "So if we go back to like, you know, the early two thousands or the late nineties, we'll see a lot of research on machine learning methods that have some very appealing mathematical properties like they reduce the convex optimization problems, for instance, but they require very special inputs."}, {"time": 3597, "text": "They require a representation of the input that is clean in some way."}, {"time": 3601, "text": "Like for example, clean in the sense that the classes in your multi class classification problems separate linearly."}, {"time": 3607, "text": "So they have some kind of good representation and we call this a feature representation."}, {"time": 3612, "text": "And for a long time, people were very worried about features in the world of supervised learning because somebody had to actually build those features so you couldn't just take an image and plug it into your logistic regression or your SVM or something."}, {"time": 3622, "text": "How to take that image and process it using some handwritten code."}, {"time": 3626, "text": "And then neural nets came along and they could actually learn the features and suddenly we could apply learning directly to the raw inputs, which was great for images, but it was even more great for all the other fields where people hadn't come up with good features yet."}, {"time": 3640, "text": "And one of those fields actually reinforcement learning because in reinforcement learning, the notion of features, if you don't use neural nets and you have to design your own features is very, very opaque."}, {"time": 3648, "text": "Like it's very hard to imagine, let's say I'm playing chess or go."}, {"time": 3653, "text": "What is a feature with which I can represent the value function for go or even the optimal policy for go linearly?"}, {"time": 3659, "text": "Like I don't even know how to start thinking about it."}, {"time": 3663, "text": "And people tried all sorts of things that would write down, you know, an expert chess player looks for whether the knight is in the middle of the board or not."}, {"time": 3669, "text": "So that's a feature is knight in middle of board."}, {"time": 3671, "text": "And they would write these like long lists of kind of arbitrary made up stuff."}, {"time": 3675, "text": "And that was really kind of getting us nowhere."}, {"time": 3677, "text": "And that's a little, chess is a little more accessible than the robotics problem."}, {"time": 3683, "text": "There's at least experts in the different features for chess, but still like the neural network there, to me, that's, I mean, you put it eloquently and almost made it seem like a natural step to add neural networks, but the fact that neural networks are able to discover features in the control problem, it's very interesting."}, {"time": 3705, "text": "It's hopeful."}, {"time": 3706, "text": "I'm not sure what to think about it, but it feels hopeful that the control problem has features to be learned."}, {"time": 3714, "text": "Like I guess my question is, is it surprising to you how far the deep side of deep reinforcement learning was able to like what the space of problems has been able to tackle from, especially in games with alpha star and alpha zero and just the representation power there and in the robotics space and what is your sense of the limits of this representation power and the control context?"}, {"time": 3746, "text": "I think that in regard to the limits that here, I think that one thing that makes it a little hard to fully answer this question is because in settings where we would like to push these things to the limit, we encounter other bottlenecks."}, {"time": 3764, "text": "So like the reason that I can't get my robot to learn how to like, I don't know, do the dishes in the kitchen, it's not because it's neural net is not big enough."}, {"time": 3776, "text": "It's because when you try to actually do trial and error learning, reinforcement learning, directly in the real world where you have the potential to gather these large, highly varied and complex data sets, you start running into other problems."}, {"time": 3791, "text": "Like one problem you run into very quickly, it'll first sound like a very pragmatic problem, but it actually turns out to be a pretty deep scientific problem."}, {"time": 3799, "text": "Take the robot, put it in your kitchen, have it try to learn to do the dishes with trial and error."}, {"time": 3803, "text": "It'll break all your dishes and then we'll have no more dishes to clean."}, {"time": 3807, "text": "Now you might think this is a very practical issue, but there's something to this, which is that if you have a person trying to do this, a person will have some degree of common sense."}, {"time": 3814, "text": "They'll break one dish, they'll be a little more careful with the next one, and if they break all of them, they're going to go and get more or something like that."}, {"time": 3821, "text": "So there's all sorts of scaffolding that comes very naturally to us for our learning process."}, {"time": 3826, "text": "Like if I have to learn something through trial and error, I have the common sense to know that I have to try multiple times."}, {"time": 3833, "text": "If I screw something up, I ask for help or I reset things or something like that."}, {"time": 3837, "text": "And all of that is kind of outside of the classic reinforcement learning problem formulation."}, {"time": 3842, "text": "There are other things that can also be categorized as kind of scaffolding, but are very important."}, {"time": 3847, "text": "Like for example, where do you get your reward function?"}, {"time": 3849, "text": "If I want to learn how to pour a cup of water, well, how do I know if I've done it correctly?"}, {"time": 3855, "text": "Now that probably requires an entire computer vision system to be built just to determine that, and that seems a little bit inelegant."}, {"time": 3861, "text": "So there are all sorts of things like this that start to come up when we think through what we really need to get reinforcement learning to happen at scale in the real world."}, {"time": 3868, "text": "And many of these things actually suggest a little bit of a shortcoming in the problem formulation and a few deeper questions that we have to resolve."}, {"time": 3877, "text": "I talked to David Silver about AlphaZero, and it seems like there's no, again, we haven't hit the limit at all in the context where there's no broken dishes."}, {"time": 3890, "text": "So in the case of Go, you can, it's really about just scaling compute."}, {"time": 3895, "text": "So again, like the bottleneck is the amount of money you're willing to invest in compute and then maybe the different, the scaffolding around how difficult it is to scale compute maybe, but there, there's no limit."}, {"time": 3909, "text": "And it's interesting, now we'll move to the real world and there's the broken dishes, there's all the, and the reward function, like you mentioned, that's really nice."}, {"time": 3917, "text": "So what, how do we push forward there?"}, {"time": 3919, "text": "Do you think there's, there's this kind of a sample efficiency question that people bring up of, you know, not having to break a hundred thousand dishes."}, {"time": 3930, "text": "Is this an algorithm question?"}, {"time": 3933, "text": "Is this a data selection like question?"}, {"time": 3938, "text": "How do we, how do we not break too many dishes?"}, {"time": 3942, "text": "Well, one way we can think about that is that maybe we need to be better at, at reusing our data, building that, that iceberg."}, {"time": 3980, "text": "And you know, the study of these kinds of questions typically falls under categories like multitask learning or meta learning, but they all fundamentally deal with the same general theme, which is use experience for doing other things to learn to do new things efficiently and quickly."}, {"time": 3997, "text": "So what do you think about if we just look at the one particular case study of a Tesla autopilot that has quickly approaching towards a million vehicles on the road where some percentage of the time, 30, 40% of the time is driven using the computer vision, multitask hydranet, right?"}, {"time": 4017, "text": "And then the other percent, that's what they call it, hydranet."}, {"time": 4023, "text": "The other percent is human controlled."}, {"time": 4026, "text": "In the human side, how can we use that data?"}, {"time": 4032, "text": "What's the signal?"}, {"time": 4033, "text": "Do you have ideas in this autonomous vehicle space when people can lose their lives?"}, {"time": 4037, "text": "You know, it's a safety critical environment."}, {"time": 4041, "text": "So how do we use that data?"}, {"time": 4043, "text": "So I think that actually the kind of problems that come up when we want systems that are reliable and that can kind of understand the limits of their capabilities, they're actually very similar to the kind of problems that come up when we're doing off policy reinforcement learning."}, {"time": 4061, "text": "So as I mentioned before, in off policy reinforcement learning, the big problem is you need to know when you can trust the predictions of your model, because if you're trying to evaluate some pattern of behavior for which your model doesn't give you an accurate prediction, then you shouldn't use that to modify your policy."}, {"time": 4077, "text": "It's actually very similar to the problem that we're faced when we actually then deploy that thing and we want to decide whether we trust it in the moment or not."}, {"time": 4085, "text": "So perhaps we just need to do a better job of figuring out that part, and that's a very deep research question, of course, but it's also a question that a lot of people are working on."}, {"time": 4092, "text": "So I'm pretty optimistic that we can make some progress on that over the next few years."}, {"time": 4095, "text": "What's the role of simulation in reinforcement learning, deep reinforcement learning, reinforcement learning?"}, {"time": 4101, "text": "Like how essential is it?"}, {"time": 4103, "text": "It's been essential for the breakthroughs so far for some interesting breakthroughs."}, {"time": 4108, "text": "Do you think it's a crutch that we rely on?"}, {"time": 4111, "text": "I mean, again, this connects to our off policy discussion, but do you think we can ever get rid of simulation or do you think simulation will actually take over?"}, {"time": 4120, "text": "We'll create more and more realistic simulations that will allow us to solve actual real world problems, like transfer the models we learn in simulation to real world problems."}, {"time": 4151, "text": "In fact, this is a general thing."}, {"time": 4153, "text": "If your machine has any bottleneck that is built by humans and that doesn't improve from data, it will eventually be the thing that holds it back."}, {"time": 4163, "text": "And if you're entirely reliant on your simulator, that'll be the bottleneck."}, {"time": 4165, "text": "If you're entirely reliant on a manually designed controller, that's going to be the bottleneck."}, {"time": 4170, "text": "So simulation is very useful."}, {"time": 4172, "text": "It's very pragmatic, but it's not a substitute for being able to utilize real experience."}, {"time": 4202, "text": "To throw a brief wrench into our discussion, let me ask, do you think we're living in a simulation?"}, {"time": 4208, "text": "Oh, I have no idea."}, {"time": 4209, "text": "Do you think that's a useful thing to even think about, about the fundamental physics nature of reality?"}, {"time": 4218, "text": "Or another perspective, the reason I think the simulation hypothesis is interesting is to think about how difficult is it to create sort of a virtual reality game type situation that will be sufficiently convincing to us humans or sufficiently enjoyable that we wouldn't want to leave."}, {"time": 4239, "text": "I mean, that's actually a practical engineering challenge."}, {"time": 4243, "text": "And I personally really enjoy virtual reality, but it's quite far away."}, {"time": 4247, "text": "I kind of think about what would it take for me to want to spend more time in virtual reality versus the real world."}, {"time": 4255, "text": "And that's a sort of a nice clean question because at that point, if I want to live in a virtual reality, that means we're just a few years away where a majority of the population lives in a virtual reality."}, {"time": 4269, "text": "And that's how we create the simulation, right?"}, {"time": 4271, "text": "You don't need to actually simulate the quantum gravity and just every aspect of the universe."}, {"time": 4279, "text": "And that's an interesting question for reinforcement learning too, is if we want to make sufficiently realistic simulations that may blend the difference between sort of the real world and the simulation, thereby just some of the things we've been talking about, kind of the problems go away if we can create actually interesting, rich simulations."}, {"time": 4301, "text": "And it actually, I think your question casts your previous question in a very interesting light, because in some ways asking whether we can, well, the more kind of practical version is like, you know, can we build simulators that are good enough to train essentially AI systems that will work in the world?"}, {"time": 4322, "text": "And it's kind of interesting to think about this, about what this implies, if true, it kind of implies that it's easier to create the universe than it is to create a brain."}, {"time": 4331, "text": "And that seems like, put this way, it seems kind of weird."}, {"time": 4334, "text": "The aspect of the simulation most interesting to me is the simulation of other humans."}, {"time": 4341, "text": "That seems to be a complexity that makes the robotics problem harder."}, {"time": 4347, "text": "Now I don't know if every robotics person agrees with that notion."}, {"time": 4352, "text": "Just as a quick aside, what are your thoughts about when the human enters the picture of the robotics problem?"}, {"time": 4359, "text": "How does that change the reinforcement learning problem, the learning problem in general?"}, {"time": 4364, "text": "Yeah, I think that's a, it's a kind of a complex question."}, {"time": 4368, "text": "And I guess my hope for a while had been that if we build these robotic learning systems that are multitask, that utilize lots of prior data and that learn from their own experience, the bit where they have to interact with people will be perhaps handled in much the same way as all the other bits."}, {"time": 4388, "text": "So if they have prior experience of interacting with people and they can learn from their own experience of interacting with people for this new task, maybe that'll be enough."}, {"time": 4396, "text": "Now, of course, if it's not enough, there are many other things we can do and there's quite a bit of research in that area."}, {"time": 4402, "text": "But I think it's worth a shot to see whether the multi agent interaction, the ability to understand that other beings in the world have their own goals and tensions and thoughts and so on, whether that kind of understanding can emerge automatically from simply learning to do things with and maximize utility."}, {"time": 4424, "text": "That information arises from the data."}, {"time": 4426, "text": "You've said something about gravity, that you don't need to explicitly inject anything into the system."}, {"time": 4434, "text": "They can be learned from the data."}, {"time": 4435, "text": "And gravity is an example of something that could be learned from data, so like the physics of the world."}, {"time": 4445, "text": "What are the limits of what we can learn from data?"}, {"time": 4448, "text": "Do you really think we can?"}, {"time": 4450, "text": "So a very simple, clean way to ask that is, do you really think we can learn gravity from just data, the idea, the laws of gravity?"}, {"time": 4459, "text": "So something that I think is a common kind of pitfall when thinking about prior knowledge and learning is to assume that just because we know something, then that it's better to tell the machine about that rather than have it figured out on its own."}, {"time": 4476, "text": "In many cases, things that are important that affect many of the events that the machine will experience are actually pretty easy to learn."}, {"time": 4488, "text": "If every time you drop something, it falls down, yeah, you might get the Newton's version, not Einstein's version, but it'll be pretty good and it will probably be sufficient for you to act rationally in the world because you see the phenomenon all the time."}, {"time": 4503, "text": "So things that are readily apparent from the data, we might not need to specify those by hand."}, {"time": 4508, "text": "It might actually be easier to let the machine figure them out."}, {"time": 4510, "text": "It just feels like that there might be a space of many local minima in terms of theories of this world that we would discover and get stuck on, that Newtonian mechanics is not necessarily easy to come by."}, {"time": 4528, "text": "And in fact, in some fields of science, for example, human civilization is itself full of these local optima."}, {"time": 4534, "text": "So for example, if you think about how people tried to figure out biology and medicine for the longest time, the kind of rules, the kind of principles that serve us very well in our day to day lives actually serve us very poorly in understanding medicine and biology."}, {"time": 4550, "text": "We had kind of very superstitious and weird ideas about how the body worked until the advent of the modern scientific method."}, {"time": 4558, "text": "So that does seem to be a failing of this approach, but it's also a failing of human intelligence arguably."}, {"time": 4564, "text": "Maybe a small aside, but some, you know, the idea of self play is fascinating in reinforcement learning sort of these competitive, creating a competitive context in which agents can play against each other in a, sort of at the same skill level and thereby increasing each other skill level."}, {"time": 4581, "text": "It seems to be this kind of self improving mechanism is exceptionally powerful in the context where it could be applied."}, {"time": 4589, "text": "First of all, is that beautiful to you that this mechanism work as well as it does?"}, {"time": 4594, "text": "And also can we generalize to other contexts like in the robotic space or anything that's applicable to the real world?"}, {"time": 4603, "text": "I think that it's a very interesting idea, but I suspect that the bottleneck to actually generalizing it to the robotic setting is actually going to be the same as the bottleneck for everything else that we need to be able to build machines that can get better and better through natural interaction with the world."}, {"time": 4624, "text": "And once we can do that, then they can go out and play with, they can play with each other, they can play with people, they can play with the natural environment."}, {"time": 4633, "text": "But before we get there, we've got all these other problems we've got, we have to get out of the way."}, {"time": 4637, "text": "So there's no shortcut around that."}, {"time": 4638, "text": "You have to interact with a natural environment that."}, {"time": 4641, "text": "Well because in a, in a self play setting, you still need a mediating mechanism."}, {"time": 4644, "text": "So the, the reason that, you know, self play works for a board game is because the rules of that board game mediate the interaction between the agents."}, {"time": 4653, "text": "So the kind of intelligent behavior that will emerge depends very heavily on the nature of that mediating mechanism."}, {"time": 4659, "text": "So on the side of reward functions, that's coming up with good reward functions seems to be the thing that we associate with general intelligence, like human beings seem to value the idea of developing our own reward functions of, you know, at arriving at meaning and so on."}, {"time": 4678, "text": "And yet for reinforcement learning, we often kind of specify that's the given."}, {"time": 4682, "text": "What's your sense of how we develop reward, you know, good reward functions?"}, {"time": 4688, "text": "Yeah, I think that's a very complicated and very deep question."}, {"time": 4692, "text": "And you're completely right that classically in reinforcement learning, this question, I guess, kind of been treated as an on issue that you sort of treat the reward as this external thing that comes from some other bit of your biology and you kind of don't worry about it."}, {"time": 4708, "text": "And I do think that that's actually, you know, a little bit of a mistake that we should worry about it."}, {"time": 4713, "text": "And we can approach it in a few different ways."}, {"time": 4714, "text": "We can approach it, for instance, by thinking of rewards as a communication medium."}, {"time": 4719, "text": "We can say, well, how does a person communicate to a robot what its objective is?"}, {"time": 4723, "text": "You can approach it also as a sort of more of an intrinsic motivation medium."}, {"time": 4727, "text": "You could say, can we write down kind of a general objective that leads to good capability?"}, {"time": 4735, "text": "Like for example, can you write down some objectives such that even in the absence of any other task, if you maximize that objective, you'll sort of learn useful things."}, {"time": 4742, "text": "This is something that has sometimes been called unsupervised reinforcement learning, which I think is a really fascinating area of research, especially today."}, {"time": 4751, "text": "We've done a bit of work on that recently."}, {"time": 4753, "text": "One of the things we've studied is whether we can have some notion of unsupervised reinforcement learning by means of, you know, information theoretic quantities, like for instance, minimizing a Bayesian measure of surprise."}, {"time": 4766, "text": "This is an idea that was, you know, pioneered actually in the computational neuroscience community by folks like Carl Friston."}, {"time": 4772, "text": "And we've done some work recently that shows that you can actually learn pretty interesting skills by essentially behaving in a way that allows you to make accurate predictions about the world."}, {"time": 4782, "text": "Like do the things that will lead to you getting the right answer for prediction."}, {"time": 4788, "text": "But you can, you know, by doing this, you can sort of discover stable niches in the world."}, {"time": 4793, "text": "You can discover that if you're playing Tetris, then correctly, you know, clearing the rows will let you play Tetris for longer and keep the board nice and clean, which sort of satisfies some desire for order in the world."}, {"time": 4804, "text": "And as a result, get some degree of leverage over your domain."}, {"time": 4807, "text": "So we're exploring that pretty actively."}, {"time": 4808, "text": "Is there a role for a human notion of curiosity in itself being the reward, sort of discovering new things about the world?"}, {"time": 4819, "text": "So one of the things that I'm pretty interested in is actually whether discovering new things can actually be an emergent property of some other objective that quantifies capability."}, {"time": 4830, "text": "So new things for the sake of new things maybe is not, maybe might not by itself be the right answer, but perhaps we can figure out an objective for which discovering new things is actually the natural consequence."}, {"time": 4844, "text": "That's something we're working on right now, but I don't have a clear answer for you there yet that's still a work in progress."}, {"time": 4849, "text": "You mean just that it's a curious observation to see sort of creative patterns of curiosity on the way to optimize for a particular task?"}, {"time": 4860, "text": "On the way to optimize for a particular measure of capability."}, {"time": 4865, "text": "Is there ways to understand or anticipate unexpected unintended consequences of particular reward functions, sort of anticipate the kind of strategies that might be developed and try to avoid highly detrimental strategies?"}, {"time": 4887, "text": "So classically, this is something that has been pretty hard in reinforcement learning because it's difficult for a designer to have good intuition about, you know, what a learning algorithm will come up with when they give it some objective."}, {"time": 4898, "text": "There are ways to mitigate that."}, {"time": 4900, "text": "One way to mitigate it is to actually define an objective that says like, don't do weird stuff."}, {"time": 4906, "text": "You can actually quantify it."}, {"time": 4907, "text": "You can say just like, don't enter situations that have low probability under the distribution of states you've seen before."}, {"time": 4914, "text": "It turns out that that's actually one very good way to do off policy reinforcement learning actually."}, {"time": 4919, "text": "So we can do some things like that."}, {"time": 4922, "text": "If we slowly venture in speaking about reward functions into greater and greater levels of intelligence, there's, I mean, Stuart Russell thinks about this, the alignment of AI systems with us humans."}, {"time": 4938, "text": "So how do we ensure that AGI systems align with us humans?"}, {"time": 4943, "text": "It's kind of a reward function question of specifying the behavior of AI systems such that their success aligns with this, with the broader intended success interest of human beings."}, {"time": 4960, "text": "Do you have thoughts on this?"}, {"time": 4961, "text": "Do you have kind of concerns of where reinforcement learning fits into this, or are you really focused on the current moment of us being quite far away and trying to solve the robotics problem?"}, {"time": 4971, "text": "I don't have a great answer to this, but, you know, and I do think that this is a problem that's important to figure out."}, {"time": 5008, "text": "I think at some point we'll face the issue of objectives being optimized too well, but right now I think we're, we're more likely to face the issue of them not being optimized well enough."}, {"time": 5017, "text": "But you don't think unintended consequences can arise even when you're far from optimality, sort of like on the path to it?"}, {"time": 5023, "text": "Oh no, I think unintended consequences can absolutely arise."}, {"time": 5026, "text": "It's just, I think right now the bottleneck for improving reliability, safety and things like that is more with systems that like need to work better, that need to optimize their objectives better."}, {"time": 5038, "text": "Do you have thoughts, concerns about existential threats of human level intelligence that have, if we put on our hat of looking in 10, 20, 100, 500 years from now, do you have concerns about existential threats of AI systems?"}, {"time": 5055, "text": "I think there are absolutely existential threats for AI systems, just like there are for any powerful technology."}, {"time": 5062, "text": "But I think that the, these kinds of problems can take many forms and, and some of those forms will come down to, you know, people with nefarious intent."}, {"time": 5074, "text": "Some of them will come down to AI systems that have some fatal flaws."}, {"time": 5078, "text": "And some of them will, will of course come down to AI systems that are too capable in some way."}, {"time": 5084, "text": "But among this set of potential concerns, I would actually be much more concerned about the first two right now, and principally the one with nefarious humans, because, you know, just through all of human history, actually it's the nefarious humans that have been the problem, not the nefarious machines, than I am about the others."}, {"time": 5101, "text": "And I think that right now the best that I can do to make sure things go well is to build the best technology I can and also hopefully promote responsible use of that technology."}, {"time": 5113, "text": "Do you think RL Systems has something to teach us humans?"}, {"time": 5119, "text": "You said nefarious humans getting us in trouble."}, {"time": 5121, "text": "I mean, machine learning systems have in some ways have revealed to us the ethical flaws in our data."}, {"time": 5127, "text": "In that same kind of way, can reinforcement learning teach us about ourselves?"}, {"time": 5132, "text": "Has it taught something?"}, {"time": 5134, "text": "What have you learned about yourself from trying to build robots and reinforcement learning systems?"}, {"time": 5142, "text": "I'm not sure what I've learned about myself, but maybe part of the answer to your question might become a little bit more apparent once we see more widespread deployment of reinforcement learning for decision making support in domains like healthcare, education, social media, etc."}, {"time": 5163, "text": "And I think we will see some interesting stuff emerge there."}, {"time": 5166, "text": "We will see, for instance, what kind of behaviors these systems come up with in situations where there is interaction with humans and where they have a possibility of influencing human behavior."}, {"time": 5178, "text": "I think we're not quite there yet, but maybe in the next few years we'll see some interesting stuff come out in that area."}, {"time": 5183, "text": "I hope outside the research space, because the exciting space where this could be observed is sort of large companies that deal with large data, and I hope there's some transparency."}, {"time": 5195, "text": "One of the things that's unclear when I look at social networks and just online is why an algorithm did something or whether even an algorithm was involved."}, {"time": 5205, "text": "And that'd be interesting from a research perspective, just to observe the results of algorithms, to open up that data, or to at least be sufficiently transparent about the behavior of these AI systems in the real world."}, {"time": 5223, "text": "I don't know if you looked at the blog post, Bitter Lesson, by Rich Sutton, where it looks at sort of the big lesson of researching AI and reinforcement learning is that simple methods, general methods that leverage computation seem to work well."}, {"time": 5241, "text": "So basically don't try to do any kind of fancy algorithms, just wait for computation to get fast."}, {"time": 5248, "text": "Do you share this kind of intuition?"}, {"time": 5251, "text": "I think the high level idea makes a lot of sense."}, {"time": 5254, "text": "I'm not sure that my takeaway would be that we don't need to work on algorithms."}, {"time": 5257, "text": "I think that my takeaway would be that we should work on general algorithms."}, {"time": 5263, "text": "And actually, I think that this idea of needing to better automate the acquisition of experience in the real world actually follows pretty naturally from Rich Sutton's conclusion."}, {"time": 5278, "text": "So if the claim is that automated general methods plus data leads to good results, then it makes sense that we should build general methods and we should build the kind of methods that we can deploy and get them to go out there and collect their experience autonomously."}, {"time": 5294, "text": "I think that one place where I think that the current state of things falls a little bit short of that is actually the going out there and collecting the data autonomously, which is easy to do in a simulated board game, but very hard to do in the real world."}, {"time": 5307, "text": "Yeah, it keeps coming back to this one problem, right?"}, {"time": 5311, "text": "Your mind is focused there now in this real world."}, {"time": 5315, "text": "It just seems scary, the step of collecting the data, and it seems unclear to me how we can do it effectively."}, {"time": 5324, "text": "Well, you know, seven billion people in the world, each of them had to do that at some point in their lives."}, {"time": 5331, "text": "And we should leverage that experience that they've all done."}, {"time": 5334, "text": "We should be able to try to collect that kind of data."}, {"time": 5338, "text": "Okay, big questions."}, {"time": 5342, "text": "Maybe stepping back through your life, what book or books, technical or fiction or philosophical, had a big impact on the way you saw the world, on the way you thought about in the world, your life in general?"}, {"time": 5359, "text": "And maybe what books, if it's different, would you recommend people consider reading on their own intellectual journey?"}, {"time": 5366, "text": "It could be within reinforcement learning, but it could be very much bigger."}, {"time": 5370, "text": "I don't know if this is like a scientifically, like, particularly meaningful answer."}, {"time": 5379, "text": "But like, the honest answer is that I actually found a lot of the work by Isaac Asimov to be very inspiring when I was younger."}, {"time": 5387, "text": "I don't know if that has anything to do with AI necessarily."}, {"time": 5390, "text": "You don't think it had a ripple effect in your life?"}, {"time": 5393, "text": "Maybe it did."}, {"time": 5396, "text": "But yeah, I think that a vision of a future where, well, first of all, artificial, I might say artificial intelligence system, artificial robotic systems have, you know, kind of a big place, a big role in society, and where we try to imagine the sort of the limiting case of technological advancement and how that might play out in our future history."}, {"time": 5425, "text": "But yeah, I think that that was in some way influential."}, {"time": 5430, "text": "I don't really know how."}, {"time": 5433, "text": "I would recommend it."}, {"time": 5434, "text": "I mean, if nothing else, you'd be well entertained."}, {"time": 5437, "text": "When did you first yourself like fall in love with the idea of artificial intelligence, get captivated by this field?"}, {"time": 5445, "text": "So my honest answer here is actually that I only really started to think about it as something that I might want to do actually in graduate school pretty late."}, {"time": 5456, "text": "And a big part of that was that until, you know, somewhere around 2009, 2010, it just wasn't really high on my priority list because I didn't think that it was something where we're going to see very substantial advances in my lifetime."}, {"time": 5471, "text": "And you know, maybe in terms of my career, the time when I really decided I wanted to work on this was when I actually took a seminar course that was taught by Professor Andrew Ng."}, {"time": 5484, "text": "And, you know, at that point, I, of course, had like a decent understanding of the technical things involved."}, {"time": 5490, "text": "But one of the things that really resonated with me was when he said in the opening lecture something to the effect of like, well, he used to have graduate students come to him and talk about how they want to work on AI, and he would kind of chuckle and give them some math problem to deal with."}, {"time": 5502, "text": "But now he's actually thinking that this is an area where we might see like substantial advances in our lifetime."}, {"time": 5507, "text": "And that kind of got me thinking because, you know, in some abstract sense, yeah, like you can kind of imagine that, but in a very real sense, when someone who had been working on that kind of stuff their whole career suddenly says that, yeah, like that had some effect on me."}, {"time": 5523, "text": "Yeah, this might be a special moment in the history of the field."}]}]