[{"title": "Ryan Graves: UFOs, Fighter Jets, and Aliens | Lex Fridman Podcast #308", "id": "qLDp-aYnR1Y", "quotes": [{"time": 227, "text": "Is that a realistic thing?"}, {"time": 228, "text": "It is realistic."}, {"time": 229, "text": "So driving those aircraft in the clutter, you know, all radar systems or most I should say are essentially line of sight."}, {"time": 237, "text": "And so they're going to be limited by the horizon or any clutter out there."}, {"time": 240, "text": "And even a number of radars, if they are located up high and looking down towards that aircraft, the clutter or all the objects such as trees and canyons can have effect on radar systems."}, {"time": 253, "text": "And so it can be a type of camouflage."}, {"time": 256, "text": "So that's a camouflage for the radar, but what about the surface to air missile?"}, {"time": 261, "text": "Is that a legitimate way to avoid missiles flies so low, like fly I guess below their level?"}, {"time": 271, "text": "As far as I know, you know, you can fly under any radar right now."}, {"time": 274, "text": "We don't have necessarily radars that can look through anything."}, {"time": 277, "text": "So there is always going to be the ability to mask yourself, but with a larger number of assets and distributed communication networks, where those radars are looking, it makes all the difference."}, {"time": 288, "text": "And I said, they're ingressing past an IAS and that's an integrated air defense system."}, {"time": 292, "text": "And that linking of air defense systems is what makes it so hard, so complicated is that the sensors and the weapons are disassociated from each other."}, {"time": 302, "text": "So that if you took out the target that was shooting at you, it still has ability to intercept you from another radar location."}, {"time": 311, "text": "So it's distributed and it's stronger that way."}, {"time": 314, "text": "You mean the surface to air missiles, like it's a distributed system in that if you take out one, they're still able to sort of integrate information about your location and strike at you."}, {"time": 329, "text": "And there's a lot of complication that can go, you know, once we start thinking about distributed systems like that and the ability to self heal and repair and adapt to losses, it's an interesting area."}, {"time": 339, "text": "Are you responsible for thinking about that when you're flying an airplane?"}, {"time": 343, "text": "To some degree, when we ingress to an area like that, we're presented with information about targets, air to air or air to surface, or surface to air, I should say."}, {"time": 354, "text": "And we can essentially see where essentially the danger zone, if you will, is located."}, {"time": 360, "text": "And so essentially we would stay out of that."}, {"time": 362, "text": "And so having a full picture of the environment is extremely important because, you know, at the end of the day, if we go in that circle, we can die pretty quickly."}, {"time": 370, "text": "So it's absolutely crucial."}, {"time": 372, "text": "So there's regions that have higher and lower danger based on your understanding of the actual, whatever the surface to air missiles systems are."}, {"time": 382, "text": "So you can kind of know."}, {"time": 385, "text": "I wonder how automated that could be too, especially when you don't know."}, {"time": 389, "text": "It seems like in the movie they knew the location of everything."}, {"time": 393, "text": "I imagine that's less known in most cases."}, {"time": 397, "text": "And also, a lot of those systems might be a little bit more ghetto if I can use that technical term."}, {"time": 403, "text": "Like I've gotten, ad hoc maybe is the, I don't know."}, {"time": 409, "text": "But having just recently visited Ukraine and seen a lot of aspects of the way that war is fought, there's a lot of improvised type of systems."}, {"time": 418, "text": "So you take high tech, like advanced technology, but the way you deploy it and the way you organize it is very improvised and ad hoc and is responding to the uncertainty and the dynamic environment."}, {"time": 431, "text": "And so from an enemy perspective or whoever's trying to deal with that kind of system, it's hard to figure it out."}, {"time": 437, "text": "Because it's like me, I played tennis for a long time and it's always easier to play, this is true for all sports, play tennis against a good tennis player versus a crappy tennis player."}, {"time": 449, "text": "Because the crappy tennis player is full of uncertainty."}, {"time": 452, "text": "And that's really difficult to deal with."}, {"time": 454, "text": "It seemed like in the movie the systems were really well organized."}, {"time": 458, "text": "And so you could plan."}, {"time": 460, "text": "And there's a very nice ravine that went right down the middle of them."}, {"time": 463, "text": "That's how movies work, isn't it?"}, {"time": 465, "text": "But no, I absolutely agree."}, {"time": 467, "text": "So what you say is a very good point."}, {"time": 470, "text": "And if we were to take a chunk of airspace and break it up into little bits, there'd be places that are better to fly or less good to fly."}, {"time": 480, "text": "And we are seeing that now with what they call manned unmanned teaming."}, {"time": 485, "text": "We see tactical aircraft or some type of aircraft or platform that's being automated."}, {"time": 491, "text": "And it's not being automated in traditional sense where people think aircrew are flying them around to conduct missions."}, {"time": 496, "text": "But it's very high level objective orientated mission planning that allows the aircrew to act more as a mission planner, mission commander versus having to just pick the right assets or fly them around or manipulate them somewhat physically."}, {"time": 514, "text": "So actually going back to the chess thing, can you elaborate on what you mean by playing a game of chess with yourself?"}, {"time": 520, "text": "What's, when you're flying that mission, what exactly do you mean by that?"}, {"time": 523, "text": "Well, there's a few people you're usually fighting against in the air, you know, there's the bad guys and then there's physics and mother nature, right?"}, {"time": 532, "text": "So when we're down at about 100 feet, it's a chess game to stay alive for the pilot and it's a chess game for the whizzo to process the information he needs and then communicate it to all those other aircraft that were flying around to ensure that they're putting their weapons on the right target."}, {"time": 548, "text": "What's the whizzo?"}, {"time": 549, "text": "Wizzo is a weapons systems officer."}, {"time": 551, "text": "He's a backseater who is not a pilot, but they're responsible for radar manipulation and communications and weapons appointments of certain natures."}, {"time": 559, "text": "So the chess game is against physics, against the enemy."}, {"time": 565, "text": "Time, what about your own psychology, fear, uncertainty?"}, {"time": 572, "text": "No, there's no time for that type of self reflection while we're flying."}, {"time": 576, "text": "I want to get to that, but I don't want to forget the point that you made about increased randomness being a tactical advantage."}, {"time": 618, "text": "Instead of just training to particular tactics that have to be repeatable and trainable and lethal, right?"}, {"time": 624, "text": "But not necessarily the most lethal because they have to be trainable."}, {"time": 628, "text": "But if we can introduce AI into that and to have a level of randomness or at least appearance of randomness due to complexity, you know, I would consider it like a stochastic tactical advantage because even our own blue fighters won't be able to engage in that fight because it would be unsafe essentially for anything else."}, {"time": 645, "text": "And I think that's where we have to drive to because otherwise it's always this chicken and mouse cat game about who's tactics and who knows what."}, {"time": 651, "text": "But if knowledge is no longer a factor, it's going to make things a lot different."}, {"time": 657, "text": "So out of the many things that are part of your expertise, your journey, you're also working on autonomous and semi autonomous systems, the use of AI and machine learning and manned on man team and all that kind of stuff."}, {"time": 674, "text": "But you're saying sort of when people think about the use of AI in war, in military systems, they think about like computer vision for perception or processing of sensor information in order to extract from it actionable knowledge kind of thing."}, {"time": 690, "text": "But you're saying you could also use it to generate randomness that's difficult to work with in like a game theoretic way."}, {"time": 699, "text": "Like it's difficult for human operators to respond to."}, {"time": 705, "text": "Okay, so back to Tom Cruise and Tom Gunn."}, {"time": 709, "text": "What about the dog fighting?"}, {"time": 711, "text": "What aspects of that were accurate?"}, {"time": 713, "text": "So dog fighting is kind of an interesting conversation because it's not the most tactically relevant skill set nowadays by traditional standards because the ranges with which we engage and play weapons are very significant."}, {"time": 729, "text": "And so if we're in a scenario where we're in a dog fight like that, a lot of things have probably gone wrong, right?"}, {"time": 735, "text": "And that's kind of how this mission was set up, right?"}, {"time": 737, "text": "It was a no win type scenario, most likely."}, {"time": 741, "text": "And so for a dog fight, the aircraft size and the ranges and the turn radiuses make it so it's not very theatrical, right?"}, {"time": 747, "text": "The aircraft looks small."}, {"time": 749, "text": "And while it's intense with the systems I have and the sensors and what I'm feeling and all that, if I, you know, we've done it and we've done it, right?"}, {"time": 756, "text": "We take video of that and it's just like a blue sky and you see a little dot out there."}, {"time": 759, "text": "So not very interesting."}, {"time": 760, "text": "And so anytime it really looks interesting in dog fight arena, that's most likely a fiction because we really only get close for a millisecond as we're dipping past each other at the merge."}, {"time": 770, "text": "You're breaking my heart, right?"}, {"time": 772, "text": "You're breaking my heart."}, {"time": 775, "text": "In a dog fight, you can go and have fun, but you know, in a dog fight specifically."}, {"time": 778, "text": "Maybe that was more common in the earlier wars, the World War II and before that, where the, is it due to the sort of the range and the effectiveness of the weapon systems involved?"}, {"time": 790, "text": "And the accuracy of the targeting systems at range."}, {"time": 792, "text": "But there's also a train of thought that hasn't actually been tested out yet, which is with the advent of advanced electronic warfare, EW and or unmanned assets, the battle space may get so complex and missiles may essentially just get dropped out of the sky or wasted such that you're gonna be in close with either IR missiles or guns, if it's a no kidding, you know, must defend type scenario."}, {"time": 820, "text": "First of all, what's electronic warfare?"}, {"time": 822, "text": "You know, it's basically trying to get control of electromagnetic spectrum for the interest of whatever operation is going on."}, {"time": 829, "text": "So in the tactical environment, a lot of that is trying to deceive the radar or can we deceive the missiles or just, you know, stop their guide and things of that nature."}, {"time": 838, "text": "Man, it's a battle in the space of information, of digital information."}, {"time": 843, "text": "Yeah, well F22 and F35, right?"}, {"time": 845, "text": "F22 is a big expensive aircraft and it was made to be a great fighter."}, {"time": 850, "text": "But the F35 is not as great of a fighter, but it's an electronic warfare and mission commander platform of the future where information is what's gonna win the war instead of the best dog fighter."}, {"time": 862, "text": "And so it's interesting dichotomy there."}, {"time": 864, "text": "What's the best airplane ever made, fighter jet ever made?"}, {"time": 867, "text": "I know the aviators in the audience are gonna hate my answer because they're gonna want that sexy, you know, muscly F14 Tomcat type fighter or maybe P51 type aircraft."}, {"time": 879, "text": "But the F35 is maybe not the best dog fighter, but it doesn't have to get in a dog fight, right?"}, {"time": 885, "text": "It's like how you'd be the best knife fighters, not getting a knife fight sometimes."}, {"time": 889, "text": "Lockheed Martin F35 Lightning II, it looks pretty sexy."}, {"time": 893, "text": "There's two real strengths you can have as a fighter."}, {"time": 895, "text": "You can have the ability to kind of out muscle your fighter, your opponent and beat them on Gs and power and raid around on them."}, {"time": 903, "text": "And then there's the other side of that, which is you can be overly maneuverable."}, {"time": 909, "text": "You can bleed energy quickly."}, {"time": 910, "text": "And that's what the F18 was good at because it had to be heavier to land on aircraft carrier."}, {"time": 915, "text": "We had to give it extra bulk, but it also needs a special mechanism to slow down enough to land on aircraft carrier."}, {"time": 921, "text": "And so it made it very maneuverable."}, {"time": 922, "text": "And what that leads to a lot of times is the ability to get maybe the first shot in a fight, which is very good, but if you do make that sharp turn, you're gonna bleed a lot of your energy away and be more susceptible for follow on shots if that one's less susceptible."}, {"time": 935, "text": "And so there's just kind of aggression, nonaggression game you can play depending on the type of aircraft you're fighting."}, {"time": 940, "text": "Where does the F35 land on that spectrum?"}, {"time": 943, "text": "The F35 lands somewhere behind the F22s."}, {"time": 946, "text": "So there'll probably be a row of F22s or F18s and F35 will be out back, but it'll be enabling a lot of the warfare that's happening in front of you."}, {"time": 953, "text": "Is it one of the more expensive planes because of all the stuff on it?"}, {"time": 957, "text": "It certainly is, yeah."}, {"time": 960, "text": "In the movie, they have Tom Cruise fly it over Mach 10."}, {"time": 963, "text": "So maybe can you say what are the different speeds, accelerations feel like, Mach 1, 2, 3, or hypersonic?"}, {"time": 972, "text": "Have you ever flown hypersonic?"}, {"time": 976, "text": "How tough does it get?"}, {"time": 978, "text": "I'm just gonna call out the BS of ejecting at Mach 10 just for the record, because in the movie, there's been I think at least one ejection that was supersonic, and I'll just say it was not pretty, but he survived."}, {"time": 990, "text": "So there would have to be some interesting mechanisms to eject successfully at Mach 10, but I'll digress on that for the moment."}, {"time": 996, "text": "Yeah, that seemed very strange."}, {"time": 997, "text": "And he just walked away from it, but anyway, so."}, {"time": 1000, "text": "He seemed disheveled."}, {"time": 1004, "text": "Okay, it's Tom Cruise."}, {"time": 1006, "text": "It's like Chuck Norris or something."}, {"time": 1007, "text": "Indestructible, yeah."}, {"time": 1008, "text": "Indestructible."}, {"time": 1009, "text": "He also doesn't age."}, {"time": 1010, "text": "But anyway, so what's interesting to say about the experience as you go up?"}, {"time": 1018, "text": "Does it get more and more difficult?"}, {"time": 1020, "text": "In the end of the day, crossing the sound barrier is much like crossing the speed limit on the highway."}, {"time": 1024, "text": "You don't really notice anything."}, {"time": 1027, "text": "To cross that, at least in F18, because we have a lot more weight than most fighters, typically we'll do that in a descent."}, {"time": 1033, "text": "We'll do that full afterburner, just dumping gas into the engine."}, {"time": 1038, "text": "And so that'll get us over the fastest I think I've gone with about 1.28."}, {"time": 1042, "text": "But what's interesting, people realize, is that if I take that throttle in an afterburner and I just bring it back, just bring it back to mil, which is full power, just not afterburner, the deacceleration is so strong due to the air friction that it'll throw you forward in your straps."}, {"time": 1056, "text": "Almost, I would say, maybe like 70% as strong almost as trapping on the boat, it's pretty strong."}, {"time": 1063, "text": "So it's almost like a reverse car crash just for the deacceleration."}, {"time": 1065, "text": "So the acceleration is usually kind of slow and you don't feel anything, of course, when you're crossing through it, but the deacceleration's pretty violent."}, {"time": 1073, "text": "The deacceleration's violent, huh, okay."}, {"time": 1077, "text": "But is there a fundamental difference between mach one and hypersonic, mach five and so on?"}, {"time": 1083, "text": "Does it require super special training?"}, {"time": 1086, "text": "And is that something that's used often in warfare or is it not really that necessary?"}, {"time": 1090, "text": "No, so hypersonic human flight, if it exists, is not something that's employed tactically in any sense right now that I'm aware of."}, {"time": 1099, "text": "So I think of hypersonic technology, I think of missiles and weapons systems and delivery platform, I don't think of fighter aircraft necessarily, I can think of bomber or reconnaissance aircraft perhaps, but those would be more efficient, very long range."}, {"time": 1117, "text": "So I imagine acceleration would be kind of gentle, honestly."}, {"time": 1120, "text": "The thing you experience is the acceleration, not the actual speed."}, {"time": 1124, "text": "There's been just a small tangent, a lot of discussion about hypersonic nuclear weapons, like missiles from Russia bragging about that."}, {"time": 1134, "text": "Is this something that's a significant concern or is it just a way to flex about different kinds of weapons systems?"}, {"time": 1140, "text": "Hypersonics, I do think pose a challenge for our detection systems because there are, you know, there are design considerations in these sensor systems as always, right?"}, {"time": 1152, "text": "And when you build them and the technology progresses to a point where maybe it's not feasible to use that technology, you know, there's a problem."}, {"time": 1158, "text": "But with the all domain and kind of cross domain data linking capabilities we have, it's less of, you know, it's more of an integrated picture, I'll say."}, {"time": 1170, "text": "And so the hypersonics are really, what it is is how fast can we detect and destroy a problem?"}, {"time": 1176, "text": "You're just shortening the time available to do that."}, {"time": 1179, "text": "We call something like that the kill chain, right?"}, {"time": 1180, "text": "It's from locating a target and identifying it and, you know, essentially authorizing its destruction by whatever means, employing, and then actually following up to ensure that you did what you said you were going to do in some sense, right?"}, {"time": 1195, "text": "Does it need another reattacks, something of that nature."}, {"time": 1197, "text": "And so there's an old dog fighting framework you could call it, it's called the OODA loop that kind of made its way in the engineering of business now but the old observe, orientate, decide act was initially a fighter mechanism in order to get inside that kill chain of your opponent and break it up so that he can't process his kill chain on you."}, {"time": 1217, "text": "And so hypersonics are a way of shortening those windows of opportunity to react to them."}, {"time": 1223, "text": "I wanted to, like, how much do you have to shorten it in order for the defense systems not to work anymore?"}, {"time": 1229, "text": "It seems like it's very, you know, I'm both often horrified by the thought of nuclear war, but at the same time, wonder what that looks like."}, {"time": 1281, "text": "Of course, the systems are probably incredible if they could be tested, but because they can't be really thoroughly tested in an actual attack, I wonder."}, {"time": 1292, "text": "I guess one assumption there would be that these hypersonic missiles would only be launched in the case of an attack."}, {"time": 1299, "text": "It'd be interesting if there were other hypersonic objects that we could use to flex those systems."}, {"time": 1304, "text": "Another thing that actually happened, and I just have a million questions I want to ask you, it's fascinating to me, is there's a bird strike on the plane, does that happen often?"}, {"time": 1313, "text": "Yeah, it's a serious issue."}, {"time": 1314, "text": "And it damaged the engine, and they made it seem like it's a serious, exactly a serious issue."}, {"time": 1319, "text": "I've hit birds, I know someone that took a turkey vulture to the face, through the cockpit, right, shattered the cockpit, knocked him out."}, {"time": 1328, "text": "I think that, actually, I don't know him personally, but it was a story I know from the command I was at, and I believe the backseater had to punch out and punch them both out because he was unconscious in the front seat from the bird."}, {"time": 1340, "text": "It can kill you from hitting you, it's like a bowling ball going 250 miles an hour."}, {"time": 1345, "text": "It can take out an engine very easily."}, {"time": 1350, "text": "Every airport I've flown at in the Navy, I've had to check the bird condition, if you will, to see how many birds, and we've had to cancel flights because there's too many of them around the airport."}, {"time": 1360, "text": "Some airports even have bird radars, military airports."}, {"time": 1363, "text": "Is there systems that monitor the bird condition?"}, {"time": 1365, "text": "There is, yeah, there's actual radar systems, and you can go in the, certain bases you have to call up, and they'll tell you what it is for the day or for that hour, and other ones have it in their weather report that goes out over the radio."}, {"time": 1378, "text": "What are some technological solutions to this, or is this just, because it's a low probability event, there's no real solution for it?"}, {"time": 1387, "text": "I would say it's not a low probability event."}, {"time": 1390, "text": "This is happening a lot."}, {"time": 1391, "text": "Although the hits themselves aren't necessarily that common, or I'll say a catastrophic hit, either a near miss or a hit or the pilot having to actively maneuver to avoid it is pretty common, and in fact, it seems stressful."}, {"time": 1404, "text": "It is, it's so common in fact that we know that you never want to try to go over, or you never want to go under a bird if you see it in front of you."}, {"time": 1411, "text": "You always want to try to go over it because what they'll do immediately if they see you is, and you startle them, is they'll bring their wings in and just drop straight down to try to get out of the path."}, {"time": 1419, "text": "It's interesting, I didn't know they did that, but so if you immediately, if you try to go under them, they're gonna be dropping into you, so you typically want to try to go above them."}, {"time": 1425, "text": "Is this something you can train for, or no?"}, {"time": 1429, "text": "Is this one of those things you have to really experience?"}, {"time": 1430, "text": "It's a skill set that you somewhat train for in the duties of being a fighter pilot in a sense, right?"}, {"time": 1437, "text": "Being able to react to your environment very quickly and make decisions quickly, so."}, {"time": 1441, "text": "Is that one of the more absurd things, challenges you have to deal with in flying?"}, {"time": 1446, "text": "Is there other things, sort of maybe weather conditions, like harsh weather conditions?"}, {"time": 1451, "text": "Is there something that we maybe don't often think about in terms of the challenges of flying?"}, {"time": 1457, "text": "Birds, in a way, aren't a ridiculous threat for us."}, {"time": 1460, "text": "It's a safety threat that anything physical in the air is something that we really have to be careful about, whether we're flying formation off of the aircraft right next to us or whether it's a turkey vulture at 2,000 feet or a flock of 5,000 birds, like at the runway, we have to wave off, you know?"}, {"time": 1477, "text": "And although they're low probability, a lot of bases will have actual Environmental Protection Agency employees that are responsible for safely removing migratory birds or different animals that may be in the runways or flying about."}, {"time": 1493, "text": "Wow, I didn't know what a turkey vulture is, and it really does look like a mix between a vulture and a turkey."}, {"time": 1498, "text": "Turkey."}, {"time": 1500, "text": "And look kind of dumb, no offense to turkey vultures."}, {"time": 1506, "text": "In that movie, who was the enemy nation?"}, {"time": 1508, "text": "Was it, I mean, I guess they were implying it's Iran."}, {"time": 1515, "text": "Or was it Russia?"}, {"time": 1517, "text": "I didn't think they were implying any particular nation state, frankly."}, {"time": 1519, "text": "I think they did a somewhat decent job of having some ambiguous fifth generation fighters."}, {"time": 1526, "text": "The location and the stockpile, I get how the story kind of insinuates certain things, but they seem to do a good job of not having anything directly pointing to another nation, which I thought was the good move."}, {"time": 1538, "text": "I enjoy these type of movies as an aviator and as an American, right?"}, {"time": 1544, "text": "Because it's a feel good movie, but we shouldn't be celebrating going to war with any particular country, China, Russia, whoever may have these weapons."}, {"time": 1552, "text": "It's fun to watch, but it would be an incredibly serious event to be implying these weapons."}, {"time": 1557, "text": "Yeah, and we'll talk about war in general, because yeah, the movie's kind of celebrating the human side of things and also the incredible technology involved, but there's also the cost of war and the seriousness of war and the suffering involved with war, not just in the fighting, but in the death of civilians and all those kinds of things."}, {"time": 1582, "text": "Well, you were a Navy pilot."}, {"time": 1584, "text": "Let's talk a little bit more seriously about this, and you were twice deployed in the Middle East flying the FAA 18F Super Hornet."}, {"time": 1592, "text": "Can you briefly tell the story of your career as a Navy pilot?"}, {"time": 1596, "text": "So I joined the Navy in 2009, right after college."}, {"time": 1599, "text": "I went to, essentially, officer boot camp, officer of Canada school."}, {"time": 1604, "text": "I applied as a pilot, and I got in as a pilot."}, {"time": 1607, "text": "That was the advantage of going that way is that I could essentially choose what I wanted, and if I got in, great."}, {"time": 1611, "text": "If not, I didn't get stuck doing something else."}, {"time": 1614, "text": "So you knew you wanted to be a pilot."}, {"time": 1617, "text": "I joined."}, {"time": 1618, "text": "I went through my initial training."}, {"time": 1648, "text": "It was a jet slot."}, {"time": 1649, "text": "So yeah, what that means is that I was assigned actually a tail hook at that point, which meant I would go train to fly aircraft that land on aircraft carriers, and there's essentially three aircraft that do that at the time."}, {"time": 1662, "text": "There's the F18 and the E2 and the C2."}, {"time": 1668, "text": "C2 is kind of like the mail truck for the boat."}, {"time": 1670, "text": "E2 is one of the big radar dish on top, and then there's all the F18s."}, {"time": 1675, "text": "So E2 is comms, is C2 mail truck?"}, {"time": 1680, "text": "C2 basically brings all the mail."}, {"time": 1682, "text": "They pack on the shore, and they're the ones that bring supplies to the ship via air and people."}, {"time": 1687, "text": "Sorry if I missed it."}, {"time": 1688, "text": "Is it a plane or is it a helicopter?"}, {"time": 1691, "text": "All right, and the F18 is a fighter jet."}, {"time": 1695, "text": "So I selected tail hook, which meant I could get one of those other ones, but 80% of them or so are jets, so I was in a good spot at that point, and that's when I went to Merde, Mississippi to fly my first jet, which was the T45 Gauss Hawk."}, {"time": 1708, "text": "Cool, so what kind of plane is that?"}, {"time": 1710, "text": "Is that what you were doing your training on?"}, {"time": 1713, "text": "That's the jet aircraft you get in before you actually go to the F18."}, {"time": 1717, "text": "It is a carrier capable, so go to the boat for the first time in it during the day, drop fake bombs, do dog fighting, low levels, formation flying, day and night."}, {"time": 1729, "text": "Oh, it's a pretty plane."}, {"time": 1731, "text": "Yeah, and it looks like a cone so that no one hits it."}, {"time": 1734, "text": "Okay, so it's usually not used for fighting, it's used for training?"}, {"time": 1739, "text": "It's used for training how to fight."}, {"time": 1743, "text": "Was that the first time you were sort of really getting into it?"}, {"time": 1746, "text": "Yeah, that was really interesting, because before that it was a 600 horsepower prop plane."}, {"time": 1750, "text": "Going from that to the T45 is one of the biggest jumps in power and like Navy machine operation."}, {"time": 1757, "text": "How much horsepower does the T45 have approximately?"}, {"time": 1761, "text": "Maybe like 15,000 or so."}, {"time": 1763, "text": "So it's a huge jump from 600 you said horsepower about?"}, {"time": 1766, "text": "Cool, so it's a big, big leap."}, {"time": 1768, "text": "But it's a jet, so it performs differently, it's faster."}, {"time": 1772, "text": "What that means, not just because it's faster, your whole mind needs to be faster."}, {"time": 1775, "text": "Everything happens faster in the air now, right?"}, {"time": 1777, "text": "Those comms happen faster, your landing gear has to come up faster, everything just happens faster in a jet."}, {"time": 1782, "text": "So it's a big jump."}, {"time": 1784, "text": "And I'll never forget going on my first flight in that aircraft, it was a formation flight for someone else."}, {"time": 1792, "text": "And I was just in the back watching and there was an instructor in the flight."}, {"time": 1795, "text": "And so what that means is the instructor is in a single aircraft and then there's three or four other aircraft and they're learning how to do joins and they're learning how to fly in formation."}, {"time": 1804, "text": "And as a new student in the back, it's amazing, right?"}, {"time": 1806, "text": "Cause you know, photo op time and all this, like I'm seeing aircraft up close for the first time, it's awesome, and on the way back, we couldn't get our landing gear down, ironically."}, {"time": 1819, "text": "So to make a long story short, cause it's overall not that exciting, we couldn't get the gear down, we actually went to go do a control ejection to the target area where that is, about 15, 20 miles to the north of the base."}, {"time": 1832, "text": "Wait, did you just say that's not that exciting?"}, {"time": 1836, "text": "Cause that to me is pretty exciting."}, {"time": 1838, "text": "That, I mean, how, first of all, I mean, that must be terrifying, like early on in your careers, I haven't seen those things that, yeah, like how often does that kind of thing happen?"}, {"time": 1853, "text": "Decent, more than you would think."}, {"time": 1854, "text": "More than you would think."}, {"time": 1855, "text": "There was no significant panic?"}, {"time": 1857, "text": "This is like, this understood?"}, {"time": 1858, "text": "This is what has to be done in this case?"}, {"time": 1860, "text": "I think I was probably just too dumb to realize the significance of it, cause as a new student, you know, not really appreciating, you know, just what is ahead of me if we are ejecting."}, {"time": 1870, "text": "But at the time it was more, it was just like rote, right?"}, {"time": 1872, "text": "Cause I was back there, and then I went from a observer mode to a, I'm gonna provide you the help that I can provide you as a member of this crew, you know, mode."}, {"time": 1879, "text": "And so it was less about, you know, on this 20 mile trip and thinking about my, how vulnerable I am, you know, we're going through checklists, we're talking to people, we're getting ready."}, {"time": 1889, "text": "So no, it wasn't fearful."}, {"time": 1892, "text": "And the whole time we were doing one of these to try to get the gear down."}, {"time": 1896, "text": "So we're unloading the jet and then loading it back to try to get the gear out with the stick."}, {"time": 1901, "text": "And it came down, it came down halfway there, just on its own."}, {"time": 1907, "text": "So it came back around and we did like a safety trap in case there was a problem with the gear."}, {"time": 1912, "text": "And that was my first flight, you know, a little bit of serendipity, but I'm gonna fast forward a bit."}, {"time": 1917, "text": "And I went back to that squad as an instructor about five or six years later, and I was an aviation safety officer at this point, which meant I was responsible for investigating mishaps."}, {"time": 1928, "text": "And a student went in and he went in the back seat of a form flight, just like the one I went on."}, {"time": 1937, "text": "And he went out and he ended up ejecting on that flight."}, {"time": 1940, "text": "Exact same type of flight."}, {"time": 1941, "text": "They went out and they had a runaway trim scenario."}, {"time": 1945, "text": "And it caused the aircraft essentially just inverted itself almost 180 degrees at about 600 feet over the ground."}, {"time": 1951, "text": "And they punched out just slightly outside the ejection window at about 300, 400 feet or so, but they were completely fine."}, {"time": 1959, "text": "So, you know, and then about two months later, we had another ejection."}, {"time": 1963, "text": "About three months after that, we had another ejection."}, {"time": 1965, "text": "So unfortunately, you know, it can be more common than people think."}, {"time": 1970, "text": "What does it feel like to get ejected?"}, {"time": 1972, "text": "Thankfully, I don't know."}, {"time": 1973, "text": "I can describe it to you."}, {"time": 1975, "text": "I can tell you what it's like from what I've heard, but I truly think it's one of those things that you just don't understand until it happens."}, {"time": 1982, "text": "It's like instantaneous about 250 Gs, which is only possible because of inertia in our blood."}, {"time": 1987, "text": "All right, so you can actually get like 250, 300 Gs for like a few milliseconds, and then it backs off to like 40 or 50 Gs to get you away from the vehicle itself."}, {"time": 1996, "text": "And so, you know, you may lose consciousness."}, {"time": 2000, "text": "If you do, you know, who knows where you wake up."}, {"time": 2004, "text": "You know, you could be in a tree, you could still be falling, you could be in the water, so."}, {"time": 2008, "text": "The physics of that is fascinating, how to eject safely."}, {"time": 2011, "text": "Do you know the story about how that was tested at all?"}, {"time": 2014, "text": "I don't know the full story, but there was an airport."}, {"time": 2016, "text": "I'm guessing nobody knows the full story."}, {"time": 2019, "text": "It's probably a lot of shady stuff going on."}, {"time": 2021, "text": "But anyway, you mean like in the early, early days, or?"}, {"time": 2024, "text": "They took a flight dock up to a rocket sled and just see how much their body could take it."}, {"time": 2029, "text": "And he turned a lot of his body in the mush in the process of getting that science done, but he saved a lot of lives."}, {"time": 2035, "text": "People used to be tougher back in the day."}, {"time": 2038, "text": "Yeah, that's how science used to be done."}, {"time": 2044, "text": "So how did your training continue?"}, {"time": 2045, "text": "So how, take me farther through your career as you worked towards graduating towards the F18s."}, {"time": 2053, "text": "So in VT9, where I was a student, there's two phases."}, {"time": 2056, "text": "There's an intermediate and an advanced."}, {"time": 2059, "text": "Intermediate is getting very comfortable with the aircraft."}, {"time": 2062, "text": "And at that point, you truly hear, all right, you're going jets now, or you're gonna go one of the other aircraft that land on the aircraft carrier."}, {"time": 2070, "text": "I was told I was going jets at that point."}, {"time": 2073, "text": "And then we go into same squadron, same aircraft, same instructors, but it's called advanced now."}, {"time": 2077, "text": "And now we're learning how to dog fight for the first time."}, {"time": 2081, "text": "We're doing what we call tactical formation, which is just like aggressive position keeping."}, {"time": 2088, "text": "We are doing dog fighting in low levels and all sorts of great stuff."}, {"time": 2093, "text": "So it's really that first introduction to that tactical environment and really putting Gs on the jet and on your body and maneuvering."}, {"time": 2100, "text": "Is there like tactical formation, is collaborating with other fighter jets a part of that?"}, {"time": 2105, "text": "So flying in a, that's what you mean by formation."}, {"time": 2108, "text": "So literally having an awareness."}, {"time": 2111, "text": "Is this done for you or are you as a human supposed to understand like where you are in the formation, how to maintain formation, all that kind of stuff?"}, {"time": 2120, "text": "Yeah, there's a."}, {"time": 2121, "text": "Is it done autonomously or manually?"}, {"time": 2123, "text": "There's a great autonomy point on the end of this I've thought about."}, {"time": 2125, "text": "So, but what we do, it's all manual."}, {"time": 2127, "text": "And so I'm looking at his wing and I'm looking at different visual checkpoints that form like a triangle, right?"}, {"time": 2134, "text": "Like an equal out triangle essentially."}, {"time": 2136, "text": "And then as that triangle is no longer equal, I can tell my relative position against that aircraft."}, {"time": 2143, "text": "And so that's what I'm staring at first, sometimes hours on end, several feet away, doing one of these if I'm in the weather, that's all it is."}, {"time": 2150, "text": "So you get, it's almost like, is it peripheral vision or is it your?"}, {"time": 2153, "text": "No, we're staring directly at it."}, {"time": 2154, "text": "The peripheral is going on my, on my."}, {"time": 2158, "text": "Stuff, right?"}, {"time": 2159, "text": "My sensors and all my instruments."}, {"time": 2161, "text": "And so he is my gyroscope at that point, right?"}, {"time": 2164, "text": "While you're flying, not looking straight."}, {"time": 2166, "text": "Correct, I'm flying like this for hours."}, {"time": 2168, "text": "It can hurt your neck."}, {"time": 2169, "text": "We don't like doing this as much."}, {"time": 2171, "text": "And I don't think it's just me, right?"}, {"time": 2173, "text": "It's a weird thing where when you're like this, it's actually harder to fly formation slightly than here because being in line of your hand movements and of the aircraft somehow has an effect on our ability to be more precise and comfortable."}, {"time": 2188, "text": "But so there's a symmetry to the formation usually."}, {"time": 2192, "text": "So one of the people on the other side really don't like being on that side."}, {"time": 2197, "text": "Is it, does it, who gets like the short straw?"}, {"time": 2200, "text": "How do you decide which side of the formation you are?"}, {"time": 2203, "text": "It's a good question too because there's kind of rank in some sense."}, {"time": 2206, "text": "So if it's a four person formation, right?"}, {"time": 2209, "text": "You have the vision lead who's qualified to lead a whole division, but maybe the other ones aren't."}, {"time": 2213, "text": "And he has a dash two and that's his wingman essentially."}, {"time": 2216, "text": "And then in a division, there's two other aircraft."}, {"time": 2218, "text": "And then you have another senior flight leader."}, {"time": 2220, "text": "That's the dash three position."}, {"time": 2222, "text": "And then you have dash four, the last one."}, {"time": 2225, "text": "And if you were all lined up on one side, like fingertip, one, two, three, four, that dash four guy is gonna be at the end of that whip."}, {"time": 2230, "text": "So if you're flying formation, each one's making movements relative to the lead."}, {"time": 2235, "text": "Dash four is kind of at the end of that error."}, {"time": 2239, "text": "And so his movements are kind of like a whip."}, {"time": 2241, "text": "It's very difficult to fly in that position in close."}, {"time": 2244, "text": "Is it because of the error, the aerodynamics?"}, {"time": 2245, "text": "So what's a whip?"}, {"time": 2246, "text": "If this is a flight lead and this is dash two, flight lead is rock steady and just doing his thing."}, {"time": 2250, "text": "And flight two is gonna be working that triangle moving a little bit, right?"}, {"time": 2253, "text": "And he has this small error bubble that he's doing his best to stay."}, {"time": 2257, "text": "And then, but dash three is flying off dash two."}, {"time": 2259, "text": "And so his error bubble is dash twos plus his own."}, {"time": 2262, "text": "And dash four."}, {"time": 2263, "text": "So it gets more and more stressful as you get farther out."}, {"time": 2266, "text": "Okay, what's the experience of that staring for long periods of time and trying to maintain formation?"}, {"time": 2274, "text": "How stressful is that?"}, {"time": 2276, "text": "Because we're doing that when we drive, staying in lane."}, {"time": 2281, "text": "And that becomes, after you get pretty good at it, it becomes somewhat, it's still stressful."}, {"time": 2289, "text": "Which actually is surprisingly stressful."}, {"time": 2290, "text": "When you look at lane keeping systems, they actually relieve that stress somehow."}, {"time": 2295, "text": "And it actually creates a much more pleasant experience while you're still able to maintain situational awareness and stay awake, which is really interesting."}, {"time": 2304, "text": "I don't think people realize how stressful it is to lane keep when they drive."}, {"time": 2309, "text": "So this is even more stressful."}, {"time": 2311, "text": "So are you, do you think about that?"}, {"time": 2314, "text": "Or is this, yeah, I guess how stressful is it from a psychology perspective?"}, {"time": 2319, "text": "It's very stressful."}, {"time": 2321, "text": "So I taught students how to do this as well."}, {"time": 2323, "text": "And so at our feet, we have two rudders."}, {"time": 2326, "text": "And if I'm flying off a flight lead over here, what you'll find a lot of times is you'll be flying, or like if I'm the instructor and the student's flying, I'll start to notice that he's having a harder and harder time keeping position."}, {"time": 2337, "text": "What I'll notice typically is he's locked out his leg."}, {"time": 2339, "text": "They'll lock out the leg that's closest to the aircraft they're flying against and push on the rudder subconsciously, because their whole body's trying to get away from the aircraft because they're so uncomfortable being close to it."}, {"time": 2349, "text": "And so I'll tell them, I can fix their form with just a couple of words."}, {"time": 2353, "text": "I'll say, wiggle your toes."}, {"time": 2354, "text": "And they'll wiggle their toes and they'll realize, and they'll loosen all the muscles in their legs because they realize they've been locked up and their formation flying will get a lot better."}, {"time": 2362, "text": "And so, there's a lot of stress associated with that."}, {"time": 2365, "text": "There's some interesting psychological or visual issues such as vertigo as you're flying."}, {"time": 2375, "text": "So if you're flying with him and then you fly right into a cloud, right?"}, {"time": 2378, "text": "That's when it's very stressful because you have to be very close in order to maintain visual and you might be on a thunderstorm, right?"}, {"time": 2384, "text": "And so you have to be very tight."}, {"time": 2385, "text": "You might start raining and then he's turning, but you might not even know that."}, {"time": 2390, "text": "You might not even be able to see that turn."}, {"time": 2392, "text": "And so all of a sudden you might look while you're in a turn thinking you were straight and level and you look just maybe back at your instruments very quick and you realize you're like in a 30 degree turn and your whole concept of where you are in the world starts getting very confused."}, {"time": 2405, "text": "And you immediately get this sense of, it's weird."}, {"time": 2409, "text": "Like I look at the HUD and it feels, all my senses are telling me it's spinning, but it's not."}, {"time": 2413, "text": "And so I have to trust my instruments even though it feels like it's spinning."}, {"time": 2417, "text": "And the same thing can happen when you're flying formation off of someone and it can be very dangerous and disorientating."}, {"time": 2425, "text": "But the point is to try to regain awareness by trusting the instruments, like distrust all your human senses and just use the instruments to rebuild situational awareness."}, {"time": 2437, "text": "Not in this particular case because our situational awareness is based, it's predicated off of our flight lead."}, {"time": 2443, "text": "So in a sense, I'm just trusting his movements."}, {"time": 2445, "text": "And so he's my gyroscope, but you're absolutely right."}, {"time": 2447, "text": "And if I was by myself, I would trust my instruments, but I can't just stop flying form and trust my instruments because now I'm gonna hit him."}, {"time": 2452, "text": "Oh yeah, you have to pay attention to him."}, {"time": 2454, "text": "So he's my reference."}, {"time": 2456, "text": "So the instruments are not helping you significantly with his positioning."}, {"time": 2460, "text": "Not, it's all completely manual."}, {"time": 2462, "text": "So is there a future where some of that is autonomous?"}, {"time": 2466, "text": "Yeah, and I've thought about automating that flight regime."}, {"time": 2470, "text": "But when I started thinking about it, I realized that all the formation keeping that we do is designed to enhance the aviators ability to maintain sight, right?"}, {"time": 2483, "text": "So we fly very tight formation so that we can go in weather and to reduce groups of traffic coming into the boat."}, {"time": 2490, "text": "We fly in one particular position so that all of the flight crew can look down the line and see the flight lead."}, {"time": 2498, "text": "So everything has based, everything has to do with the two air crew visually maintaining sight of each other and defending each other, right?"}, {"time": 2507, "text": "In a combat spread, I might be looking, I may be three miles away from him flying formation directly beam and looking around to make sure nothing's there."}, {"time": 2515, "text": "So as I'm looking into automating this process, I thought, well, sure it's easy to get a bunch of aircraft to fly in formation off each other, right?"}, {"time": 2523, "text": "It's trivial, but why?"}, {"time": 2525, "text": "What is the best formation?"}, {"time": 2526, "text": "Why are they doing that?"}, {"time": 2527, "text": "And that opened up a much more interesting regime of operations and flight mechanics."}, {"time": 2532, "text": "And that's when we get back to that kind of stochastic mindset where we can bring in aircraft close to do some type of normal flying or reduce congestion around airports."}, {"time": 2541, "text": "But when we consider flying or formation in a tactical environment, we can be much more effective with nontraditional formation keeping or perhaps no formation keeping perhaps."}, {"time": 2550, "text": "So autonomy used for formation keeping, not for convenience, but for the introduction of randomness."}, {"time": 2556, "text": "Like to a real time mission planner, yeah."}, {"time": 2559, "text": "And then that's where you also have some human modification."}, {"time": 2562, "text": "So it's like unmanned teaming enters that picture."}, {"time": 2567, "text": "So you use some of the human intuition and adjustment of this formation."}, {"time": 2573, "text": "The formation itself has some uncertainty."}, {"time": 2576, "text": "I mean, it's such an interesting dance."}, {"time": 2577, "text": "I think that is the most fascinating application of artificial intelligence is when it's human AI collaboration, that semi autonomous dance that you see in these semi autonomous vehicle systems in terms of cars being driving, but also in the safety critical situation of a airplane, of a fighter jet, especially when you're flying fast."}, {"time": 2602, "text": "I mean, in a split second, you have to make all these kinds of decisions and it feels like an AI system can do as much harm as it can help."}, {"time": 2611, "text": "And so to get that right is a really fascinating challenge."}, {"time": 2615, "text": "One of the challenges too, isn't just the algorithms of the autonomy itself, but how it senses the environment."}, {"time": 2621, "text": "That of course is gonna be what all these decisions are based off of."}, {"time": 2625, "text": "And that's a challenge in this type of environment."}, {"time": 2628, "text": "Well, I gotta ask."}, {"time": 2628, "text": "So F18, what's it like to fly a fighter jet as best?"}, {"time": 2633, "text": "I mean, what to you is beautiful, powerful?"}, {"time": 2638, "text": "What do you love about the experience of flying?"}, {"time": 2642, "text": "For me, and I think I'm an outlier a bit."}, {"time": 2644, "text": "It wasn't necessarily the flying itself, right?"}, {"time": 2648, "text": "It wasn't necessarily the soaring over the clouds and looking down at the earth from upside down."}, {"time": 2656, "text": "I came to love that, but it wasn't necessarily the passion that drove me there."}, {"time": 2659, "text": "I just had no exposure to that."}, {"time": 2661, "text": "The only exposure I had was reading and going in the woods and science fiction and all that."}, {"time": 2668, "text": "And so, what seemed to kind of drive me towards that was just a desire to really be operating as close to what I thought was the edge of technology or science."}, {"time": 2678, "text": "And that's the path that I chose to try to get close to that."}, {"time": 2681, "text": "I thought that being in a fighter jet and all the tools and the technology and the knowledge and the challenges and the failures and victories that would come with that just seemed like something that I wanted to be a part of."}, {"time": 2699, "text": "And it wasn't necessarily about the flying, but it was about the challenge."}, {"time": 2701, "text": "And like I said, as a person from a small town, small high school, being able to get my hands or even just near something of such technological significance was kind of empowering for me."}, {"time": 2715, "text": "And that's kind of what bore the love of flight from there."}, {"time": 2718, "text": "Becoming, having some level of mastery in the aircraft, it really feels like an extension of your body."}, {"time": 2724, "text": "And once I got there, then kind of the love of flying kind of followed."}, {"time": 2728, "text": "So you sort of, one, is the man mastery over the machine."}, {"time": 2733, "text": "And second is the machine is like the greatest thing that humans have ever created arguably."}, {"time": 2738, "text": "The things that Lockheed Martin and others have built."}, {"time": 2741, "text": "I mean, the engineering in that."}, {"time": 2746, "text": "However you feel about war, which is one of the sad things about human civilization is war inspires the engineering of tools that are incredible."}, {"time": 2759, "text": "And it's like, maybe without war, if we look at human history, we would not build some of the incredible things we built."}, {"time": 2766, "text": "So in order to win wars, to stop wars, we build these incredible systems that perhaps propagate war."}, {"time": 2775, "text": "And that's another discussion I'll ask you about."}, {"time": 2777, "text": "But this, to you, this is like, this is a chance to experience the greatest engineering humans have ever been able to do."}, {"time": 2788, "text": "Like similar, I suppose, that astronauts feel like when they're flying."}, {"time": 2791, "text": "And I wanted to be an astronaut."}, {"time": 2792, "text": "I wanted to take that route."}, {"time": 2794, "text": "I was gonna apply to test pilot school."}, {"time": 2798, "text": "It just didn't work out for me."}, {"time": 2799, "text": "I ended up having a broken foot during my window."}, {"time": 2802, "text": "But long story short, I ended up after my time in my fleet squadron, and we can get back to the rest of the timeline if you want, but I went to be an instructor pilot instead, right?"}, {"time": 2814, "text": "And then, I was talking about this with a squadron mate earlier today about how, I certainly wouldn't be talking with Lex today if I ended up going to test pilot school."}, {"time": 2824, "text": "I never would have, I never would have had the, I wouldn't, maybe recklessness, I don't know, but the willingness to have a conversation about UAP while I was, that led me to the decision to get out once I went there."}, {"time": 2840, "text": "And it kind of enabled me to talk about UAP more publicly."}, {"time": 2846, "text": "And if I stayed in the Navy, then I don't think that would have happened."}, {"time": 2849, "text": "I wouldn't have been able to if I went that route."}, {"time": 2853, "text": "Well, as a small tangent, do you hope to travel to Mars one day?"}, {"time": 2857, "text": "Do you think you'll step foot on Mars one day?"}, {"time": 2860, "text": "If you asked me that five years ago, I would have said, yes, I want to."}, {"time": 2864, "text": "In fact, I would like to die on Mars."}, {"time": 2868, "text": "Now, today, now I have some hesitations and I have some hesitations because I'm hopeful and optimistic."}, {"time": 2874, "text": "And I think that, you know, I think that we are truly like on the brink of a very wide technological revolution that's going to kind of move us how we used to move information and data in this last century."}, {"time": 2889, "text": "We're going to be manipulating and managing matter in that next century."}, {"time": 2892, "text": "And so I think that, I think our reach as humans are going to get a lot wider, a lot faster than people may realize, or at least."}, {"time": 2899, "text": "Wait, are you getting like super ambitious beyond Mars?"}, {"time": 2904, "text": "Like Mars seems kind of boring, I want to go beyond that."}, {"time": 2907, "text": "Is that what, do you mean the reach of humanity across all kinds of technologies?"}, {"time": 2912, "text": "Or do you mean literally across space?"}, {"time": 2914, "text": "Across space, you know?"}, {"time": 2938, "text": "And we may have more opportunity."}, {"time": 2940, "text": "And I'm not saying this is something I'm, you know, betting the farm on, of course, but maybe that's a road I want to explore on Earth instead of on Mars."}, {"time": 2949, "text": "Maybe there's technology that can be brought to bear with new science and harder engineering that is a road that doesn't go past Mars to get outside the solar system."}, {"time": 2959, "text": "So there are different ways to explore the universe than the traditional rocket systems."}, {"time": 2966, "text": "If we can continue sort of your journey, you said that you were attracted to the incredibly advanced technologies of the F18s and just the fighter jets in general."}, {"time": 2982, "text": "Let me ask another question, which seems incredibly difficult to do, which is landing on a carrier or taking off from a carrier and landing on a carrier."}, {"time": 2994, "text": "What are the challenges of that?"}, {"time": 2996, "text": "Taking off's pretty easy."}, {"time": 2997, "text": "It's procedurally somewhat complex where there's a lot of moving parts, almost like a clock, you know."}, {"time": 3003, "text": "You're almost in a pocket watch."}, {"time": 3004, "text": "So then you're a part of the machinery."}, {"time": 3006, "text": "And so long as you press the right buttons and do the right things, you're gonna go shooting off the front."}, {"time": 3011, "text": "So there's like a checklist to follow and there's several people involved in that checklist and you just gotta follow the checklist correctly."}, {"time": 3016, "text": "Essentially, yep."}, {"time": 3017, "text": "Lots of ways to screw it up, but you'll know how to screw it up."}, {"time": 3020, "text": "But landing on the back of the boat is a whole different animal."}, {"time": 3024, "text": "There's a lot more variables."}, {"time": 3026, "text": "There's essentially one or two people responsible for the success of that."}, {"time": 3031, "text": "The landing signal officer who actually represents a team of specially trained aviators who are responsible for helping that aviator land on the boat."}, {"time": 3041, "text": "And the pilot himself."}, {"time": 3044, "text": "And it is a hard task to actually fly precisely enough to be good at it."}, {"time": 3050, "text": "So to fly quote unquote the perfect pass, you essentially have to fly your head through a one foot by one foot box."}, {"time": 3057, "text": "That's essentially the target you're shooting for."}, {"time": 3060, "text": "Plus or minus probably about five knots on airspeed, although we don't really judge it by airspeed."}, {"time": 3064, "text": "It's something called angle of attack."}, {"time": 3066, "text": "But generally pretty tight parameters there."}, {"time": 3069, "text": "And you can do everything perfect and still fail."}, {"time": 3071, "text": "So when we go to touchdown, we immediately bring the power up and we rotate as if we were doing, as if we were bouncing off the deck."}, {"time": 3079, "text": "And if we catch it, then we slow down."}, {"time": 3083, "text": "And then someone tells us to bring the power back, which we do, we don't do it on our own."}, {"time": 3087, "text": "Cause it's such a violent experience."}, {"time": 3090, "text": "Think you're trapped or not, or something breaks and you bring your throttle back."}, {"time": 3094, "text": "And that's a very serious thing."}, {"time": 3095, "text": "It happened to best of us, I'll admit I've done it once."}, {"time": 3098, "text": "When I first got to the squadron, it's called ease guns land."}, {"time": 3102, "text": "And so I came in the boat and I brought the power."}, {"time": 3105, "text": "I cracked the power back a little bit before I've been told to her that my aircraft had finished settling in."}, {"time": 3111, "text": "And that was a big faux pas, right?"}, {"time": 3112, "text": "So, especially as a new guy."}, {"time": 3113, "text": "So it's a very serious business."}, {"time": 3117, "text": "There's a lot of eyes on you and there's a lot of ways to screw it up."}, {"time": 3120, "text": "But the physical rush of like having a great pass and then like the crash of into the boat and all that, the physical sensation from it, when everything's going great, it's top of the world, it's a great feeling."}, {"time": 3132, "text": "How much of it is feel?"}, {"time": 3133, "text": "How much of it is instruments?"}, {"time": 3136, "text": "How much is other people just doing the work for you, catching you, as long as you do everything right?"}, {"time": 3140, "text": "There's a few systems we use."}, {"time": 3141, "text": "One is called the BAL."}, {"time": 3143, "text": "And the BAL is external to our aircraft."}, {"time": 3146, "text": "And it's B A L L, BAL, like BAL, okay."}, {"time": 3149, "text": "It's a iFloss landing system, which stands for something very long convoluted."}, {"time": 3153, "text": "But essentially it's a mirror with lights on it."}, {"time": 3155, "text": "And you see the light at a different cell based on your position relative to an ideal glide slope."}, {"time": 3164, "text": "So if you're right on it, you're right in the middle."}, {"time": 3166, "text": "And if you're below, you're low."}, {"time": 3168, "text": "And as I add power and maneuver the aircraft, that BAL, I see that BAL rise, I see that BAL low."}, {"time": 3175, "text": "It's a lagging indicator though, right?"}, {"time": 3177, "text": "And your jet is a lagging engine too, right?"}, {"time": 3180, "text": "It takes time to spool up the engine."}, {"time": 3181, "text": "So that adds to the complexity."}, {"time": 3183, "text": "You have to think ahead a bit."}, {"time": 3185, "text": "So you don't want to, you can't just bring the power up and leave it there."}, {"time": 3190, "text": "You have to bring the power up, touch it, bring it back."}, {"time": 3193, "text": "And oh, by the way, your landing area is moving, not just away from you, but also on an angle, right?"}, {"time": 3197, "text": "Cause we have an angled deck."}, {"time": 3199, "text": "And so you're constantly doing one of these to correct yourself as you go."}, {"time": 3203, "text": "That seems so stressful."}, {"time": 3204, "text": "And every time you do one of those, maybe it's a 30 degree angle bank, right?"}, {"time": 3208, "text": "I'm losing lift, right?"}, {"time": 3210, "text": "And so I have to compensate with power each time I do that."}, {"time": 3213, "text": "So I'm doing another one."}, {"time": 3213, "text": "Cause you have to maintain the same level you're always lowering."}, {"time": 3218, "text": "It's a constant rate of descent that's increasing from about 200 feet per minute to about 650."}, {"time": 3223, "text": "And every time you do this, that's messing with that."}, {"time": 3226, "text": "So you have to compensate."}, {"time": 3227, "text": "And you're doing that manually."}, {"time": 3228, "text": "Do that manually."}, {"time": 3230, "text": "And then of course, as you come down that glide slope, it becomes more and more narrow."}, {"time": 3234, "text": "And you have to, of course, modulate your inputs such that they're smaller and smaller cause they have a bigger and bigger effect as you get closer in."}, {"time": 3242, "text": "And what happens too, when you get in close is that right before you cross over, if this is the boat right here, your table, right before you kind of get your wings over the boat itself, this big wind from the main tower of the boat is where it dips down."}, {"time": 3256, "text": "So the wind actually goes down and it's called the burble."}, {"time": 3258, "text": "And it'll actually pull the aircraft down, increase your rate of descent."}, {"time": 3261, "text": "So at that particular point, you need to increase your speed."}, {"time": 3264, "text": "You know, increase your power and try to compensate against that."}, {"time": 3267, "text": "And so that's kind of a third variable that's trying to screw you up on your way down."}, {"time": 3271, "text": "What's the most difficult conditions in which you had to land or you've seen somebody had to land?"}, {"time": 3276, "text": "Because I think you were also a signal officer as well."}, {"time": 3280, "text": "I was, yeah."}, {"time": 3281, "text": "I was the head landing signal officer for my squadron."}, {"time": 3284, "text": "So you've probably seen some tough landings."}, {"time": 3287, "text": "I've seen a ramp strike, which is when a part of the aircraft hits before the landing area, which is basically the round out of the boat."}, {"time": 3297, "text": "That is before the landing area."}, {"time": 3298, "text": "So they basically struck the back of the boat coming in."}, {"time": 3301, "text": "It was just their hook."}, {"time": 3302, "text": "So it wasn't their craft."}, {"time": 3304, "text": "And they were fine."}, {"time": 3305, "text": "That one was kind of ugly."}, {"time": 3307, "text": "But it like rips that part of the aircraft."}, {"time": 3310, "text": "And then you land on your bellies, that kind of thing."}, {"time": 3312, "text": "In this particular case, it hit and then it gave and essentially dragged the hook on the surface after that."}, {"time": 3318, "text": "And so he was able to grab a wire at that point."}, {"time": 3321, "text": "When does that kind of thing happen?"}, {"time": 3322, "text": "Is it just a miscalculation by the pilot or is it weather conditions?"}, {"time": 3327, "text": "I wouldn't even call it a miscalculation."}, {"time": 3328, "text": "I mean, I'm going to put the blame on the pilot because he's the only one in the cockpit."}, {"time": 3331, "text": "But then the day he's reacting to the situations he's dealing with."}, {"time": 3335, "text": "And so it may be errors or he may be doing the best with the conditions that he's been given."}, {"time": 3340, "text": "On that particular one, you just got too high rate of send."}, {"time": 3343, "text": "It's very common."}, {"time": 3344, "text": "And that's what you see it with new pilots."}, {"time": 3345, "text": "You see it with older pilots, right?"}, {"time": 3347, "text": "New ones and complacent ones."}, {"time": 3349, "text": "What you see is they'll try to make the ball go right where they want it in close."}, {"time": 3354, "text": "They think they can beat the game a little bit."}, {"time": 3356, "text": "And they try to, and so we have sayings, we teach pilots as a landing signal officer, we tell them like, don't recenter the high ball in close."}, {"time": 3364, "text": "It's one of the rules to live by."}, {"time": 3365, "text": "And so when the ball's up high, don't try to bring it back in close to like the center point when you're in close."}, {"time": 3371, "text": "Cause what you're doing is you bring the power off and you're going to crash right down."}, {"time": 3374, "text": "And that's what happens, right?"}, {"time": 3375, "text": "Cause you got the burble pulling you down."}, {"time": 3378, "text": "You might be correcting, which is decreasing your lift."}, {"time": 3381, "text": "And then you have that type of maneuvers."}, {"time": 3383, "text": "How are you supposed to do all of this in harsh weather conditions?"}, {"time": 3387, "text": "And so that's the one I wanted to tell you about."}, {"time": 3388, "text": "That's the hardest one."}, {"time": 3389, "text": "And what you hear is if you hear 99 taxi lights on, that's a really shitty day."}, {"time": 3394, "text": "99 taxi lights on, what's that mean?"}, {"time": 3397, "text": "Everyone put your taxi lights on because you're about to land on the boat."}, {"time": 3403, "text": "And you don't see the boat?"}, {"time": 3404, "text": "Weather is so bad that the landing signal officer on the boat can't see you either."}, {"time": 3408, "text": "And you can't see the boat."}, {"time": 3409, "text": "And you won't be able to see it when you touch down."}, {"time": 3412, "text": "So we call that a zero, zero landing."}, {"time": 3415, "text": "And you turn on the taxi lights so that the LSO who has a radio in his hand that looks like a phone from 1980 is talking directly to the pilot."}, {"time": 3424, "text": "And he's looking at that little light in the rain and he's telling them you're high, you're low, power, things like that."}, {"time": 3431, "text": "Come right, back to left."}, {"time": 3433, "text": "And literally talking him down to land on the boat right there."}, {"time": 3436, "text": "And the pilot, usually it comes as a surprise to the pilot, the landing, because he's just listening to the voice, can't see the ball, can't see the boat."}, {"time": 3441, "text": "And all of a sudden you just hit the boat."}, {"time": 3443, "text": "You crash, I mean you crash."}, {"time": 3444, "text": "We're going about 1,600 feet per minute descent at that point."}, {"time": 3448, "text": "So you're going super fast."}, {"time": 3450, "text": "So all of this is happening fast."}, {"time": 3452, "text": "You don't know the moment it's gonna hit."}, {"time": 3457, "text": "So you're just going into the darkness and just waiting for it to hit."}, {"time": 3461, "text": "Maybe not dark though, a lot of times it's white."}, {"time": 3463, "text": "Into the light."}, {"time": 3464, "text": "You're just going into the light."}, {"time": 3466, "text": "And then there's a voice from an 80s phone."}, {"time": 3473, "text": "But so you still have to, so this kind of thing happens."}, {"time": 3479, "text": "You still have to land."}, {"time": 3480, "text": "Sometimes you just don't have a place to divert."}, {"time": 3482, "text": "But in a sense we're trained for that because we do the night landings as well."}, {"time": 3486, "text": "And I think you'll find this interesting, but I always found that the night landings where in these particular cases, you're usually lined up behind the boat, maybe 10, 15 miles, whereas the other ones, it's like a tight circle, the landing pattern."}, {"time": 3498, "text": "And so we can potentially see the boat way out there if the lights were on, which they're not."}, {"time": 3505, "text": "But we can maybe see like the string of aircraft in front of us."}, {"time": 3508, "text": "But what's interesting is that it can take a while."}, {"time": 3511, "text": "You might be 15 miles out and your lights are turned down as dim as possible."}, {"time": 3516, "text": "You have a cloud deck maybe at six or 7,000 feet so that the starlight, there's no moon, but let's say the starlight's blocked out because just the starlight alone, no moon, you can see the boat, you can see the water."}, {"time": 3527, "text": "But when that goes away, it's like closing your eyes."}, {"time": 3530, "text": "You can't tell anything."}, {"time": 3532, "text": "It could be upside down."}, {"time": 3533, "text": "It could be in any position."}, {"time": 3535, "text": "And for me, it was almost a meditative process that I had to snap myself back out of when I was on like a long straightaway."}, {"time": 3542, "text": "And then I would see the light pop up in the sea of darkness."}, {"time": 3546, "text": "No lights anywhere."}, {"time": 3547, "text": "Can't even see the horizon."}, {"time": 3549, "text": "And I just see a light out there."}, {"time": 3550, "text": "My instruments were telling me, and they're turned down as far as they can go, right?"}, {"time": 3553, "text": "So I can barely see them."}, {"time": 3554, "text": "So my eyes can adjust."}, {"time": 3556, "text": "And I'm just staring at this light in the distance."}, {"time": 3558, "text": "And it's just very meditative and it's the hum behind you."}, {"time": 3561, "text": "And then at like four miles, you know, almost like, oh, the light is a little bit bigger."}, {"time": 3566, "text": "And you almost kind of have to snap back to it and be like, oh, I need to like kind of like look around a little bit and engage my brain, link it back to my body and like do this thing."}, {"time": 3575, "text": "Because you're going to have to actually land."}, {"time": 3576, "text": "Well, is there just, you said you don't necessarily feel the romantic notion of the whole thing, but is there some aspects of flying where you look up and maybe you see the stars or yeah, that kind of thing that you just like, holy crap, how did humans accomplish all of this?"}, {"time": 3595, "text": "Like, am I actually flying right now?"}, {"time": 3598, "text": "I used to have those moments on the boat when I was catching planes land."}, {"time": 3601, "text": "I would, they would trap and it'd be nighttime."}, {"time": 3605, "text": "And it's just all this chaos in the middle of the ocean and nothing."}, {"time": 3607, "text": "And I would have these moments where I'd be like, how the hell did I end up here?"}, {"time": 3611, "text": "You know, there's one moment in time next to an aircraft landing on a boat in the middle of the ocean, you know, where did my life, you know, how did my life go to end up here?"}, {"time": 3619, "text": "How interesting."}, {"time": 3620, "text": "But what I did start to enjoy was the night vision goggles and putting those on and looking up at the stars flying around, especially over the ocean."}, {"time": 3630, "text": "And there's just so many, there's just so many stars that, you know, you normally can't see."}, {"time": 3634, "text": "They're shooting stars all the time."}, {"time": 3636, "text": "Almost every flight you'd see them with the goggles on."}, {"time": 3639, "text": "And so it was a great pleasure to take advantage of the lack of light pollution in some cases, especially on deployment to go grab some goggles at night, go out some quiet spot in the ship that no one can see me and just kind of look around, you know."}, {"time": 3652, "text": "Yeah, it's humbling."}, {"time": 3655, "text": "Quick break, bathroom break?"}, {"time": 3657, "text": "Yeah, wouldn't mind a quick stretch of legs."}, {"time": 3659, "text": "You got a few cool patches."}, {"time": 3660, "text": "I do, so this is a VFA 11 Red Rippers patch."}, {"time": 3665, "text": "Typically going actually on our arm."}, {"time": 3669, "text": "So this is actually what we call the Boar's Head or Arnold."}, {"time": 3672, "text": "So this is actually the Boar's Head from the Gordon's Gin bottle."}, {"time": 3678, "text": "In 1918, we were in London or the UK somewhere and we apparently partied with the owner and founder of Gordon's Gin and we had a great time and there's a signed letter in our ready room that says we can use the logo in perpetuity."}, {"time": 3693, "text": "And yeah, so I'd like to give you that patch."}, {"time": 3696, "text": "I drank quite a bit of gourd, so this is good."}, {"time": 3699, "text": "And I'd like to give you that coin from our squadron."}, {"time": 3704, "text": "The Red Rippers, that's a badass name."}, {"time": 3710, "text": "So let's jump around a little bit, but let me ask you about this one set of experiences that you had and people in your squadron had."}, {"time": 3719, "text": "So you and a few people in the squadron either detected UFOs on your instruments or saw them directly."}, {"time": 3725, "text": "Tell me the full story of these UFO sightings and to the smallest technical details, because I love those."}, {"time": 3732, "text": "I'll do my best."}, {"time": 3733, "text": "So we returned from, and when I say we, I mean, not my squadron, but VFA 11, the Red Rippers."}, {"time": 3741, "text": "I was a somewhat junior pilot at the time."}, {"time": 3744, "text": "I joined them on deployment in 2012, where they had been already out there for about six months or so, operating in the vicinity of Afghanistan."}, {"time": 3755, "text": "I joined them and then we flew back and still as a relatively new guy, we came back and we entered what's considered a maintenance phase where we slow down the tactical flying a bit, kind of recuperate, do some maintenance on the aircraft."}, {"time": 3768, "text": "And our particular model of the F18, the lot number, was plumbed for the particular things that were needed to upgrade the radar from what's known as the ABG 73 to the ABG 79."}, {"time": 3784, "text": "And the ABG 73 is a mechanically scanned array radar."}, {"time": 3790, "text": "It's a perfectly fine radar, but the AESA radar is kind of a magnitude jump in capability, kind of an analog digital kind of mindset."}, {"time": 3800, "text": "So it's a leap to digital."}, {"time": 3803, "text": "ABG 73, so I mean, are these things on a carrier?"}, {"time": 3806, "text": "Like what are we talking about here?"}, {"time": 3808, "text": "How big is the radar?"}, {"time": 3809, "text": "So this is actually the radars in the F18 itself."}, {"time": 3812, "text": "Okay, so when you say they were chosen, this is to test the upgrade to the new, the 79, ABG 79."}, {"time": 3820, "text": "Less of a test and more of just, hey, it's your turn to get the upgrade."}, {"time": 3823, "text": "Like we're all going to these better radars."}, {"time": 3826, "text": "They were building ones off the line with the new radar, but we were this weird transitionary squadron in the middle that transitioned from the older ones to the new ones."}, {"time": 3835, "text": "But it's not particularly rare to fly with different types of radar because in the, and we call the fleet replacement squadron, essentially the training ground for the F18, you have all sorts of F18s with different radar."}, {"time": 3846, "text": "So you are used to having multiple ones, but in the actual deployable combat squadron, we upgraded."}, {"time": 3854, "text": "And when we upgraded, we saw that there were objects on the radar that we were seeing the next day with this new radar that weren't there with the old radar."}, {"time": 3863, "text": "And these were sometimes the same day."}, {"time": 3865, "text": "You might go on two flights."}, {"time": 3867, "text": "The one in the morning might be with the older radar, the one in the evening with the new radar."}, {"time": 3871, "text": "And you'd see the objects with the new radar."}, {"time": 3874, "text": "And that's not overly surprising in some sense."}, {"time": 3877, "text": "They are more sensitive."}, {"time": 3879, "text": "Perhaps they're not filtering out everything they should be yet, or perhaps there's some other type of error."}, {"time": 3885, "text": "Maybe it needs to be calibrated, whatever."}, {"time": 3887, "text": "It was relatively new and we were somewhat used to there being software problems with these types of things occasionally, just like anything else."}, {"time": 3895, "text": "And so, okay, maybe this is a radar software malfunction."}, {"time": 3898, "text": "We're getting some false tracks, as we call them."}, {"time": 3902, "text": "What were you seeing?"}, {"time": 3904, "text": "And so what we would see are representations of the objects."}, {"time": 3908, "text": "So this is off of our radar."}, {"time": 3909, "text": "We're not seeing a visual image here."}, {"time": 3911, "text": "This is kind of like what's being displayed to us almost like in a gaming fashion, right?"}, {"time": 3915, "text": "Like the icon, right?"}, {"time": 3916, "text": "So the icon is showing us, hey, something is there."}, {"time": 3919, "text": "And here's the parameters I can understand about it."}, {"time": 3921, "text": "So this is in the cockpit."}, {"time": 3922, "text": "There's a display that's showing some visualization with the radars detecting."}, {"time": 3929, "text": "And there's two different ways to do that."}, {"time": 3930, "text": "The first one is like the actual data, like the radar where I am, it's showing me the data kind of as if it's in front of me and I'm selecting those contacts."}, {"time": 3941, "text": "And there's another screen called the situational awareness page."}, {"time": 3943, "text": "And that's kind of a God's eye view that brings all that data into one spot."}, {"time": 3948, "text": "And so I'm gonna talk about this from the SA page, from the situational awareness page versus the individual radar ones, because it's easier, but."}, {"time": 3955, "text": "Can you, sorry to linger on that."}, {"time": 3957, "text": "So the individual displays are like first person and then SA is, when you say God's eye view, it's like from the top, the integration of all that information as if it's looking down onto the earth."}, {"time": 3972, "text": "Is that a good way to summarize it?"}, {"time": 3973, "text": "It is, but for the aviator, it's slightly different because those two radar displays I talked about are at the bottom of that display is kind of representative of where I am."}, {"time": 3982, "text": "And so I see what's in front of me."}, {"time": 3984, "text": "Whereas the situational awareness page, the aircraft is located in the center of that."}, {"time": 3989, "text": "And then all around me, based off of the data link and wherever I'm getting information from, I can see that whole awareness page."}, {"time": 3997, "text": "I can see all the situation."}, {"time": 3998, "text": "So I'm gonna kind of talk about this from the situational awareness page, which is a top down view, just to kind of frame our minds instead of jumping around."}, {"time": 4007, "text": "And so what we would see out there is we'd see these indications that something would be there and they would have a track file."}, {"time": 4013, "text": "That track file, that thing that represents the object has a line coming out of it."}, {"time": 4017, "text": "And that represents, it's called the target aspect indicator."}, {"time": 4021, "text": "So there's some tracking from the radar."}, {"time": 4023, "text": "Correct, so it's showing you where the object's going."}, {"time": 4025, "text": "This is all pretty cool that the radar can do all this."}, {"time": 4027, "text": "So radar locks in on different objects and it tracks them over time."}, {"time": 4032, "text": "That's coming from the radar."}, {"time": 4033, "text": "That's like a built in feature."}, {"time": 4036, "text": "So out there we're seeing it."}, {"time": 4037, "text": "We don't have to necessarily pull things into our tracker in some sense, right?"}, {"time": 4042, "text": "It's all out there and then we can kind of choose to highlight on stuff or to kind of focus in on it more so."}, {"time": 4047, "text": "But the information should all be out there."}, {"time": 4050, "text": "And so we'd see that that target aspect indicator, that line on a typical aircraft, it would kind of look like this."}, {"time": 4055, "text": "It would be coming out and it would go steady and if they turned, it would be like boop, boop, boop, and you see them turn, right?"}, {"time": 4061, "text": "It's not magic."}, {"time": 4062, "text": "But this object, the target aspect would kind of be like all over the place, like kind of randomly in the 360 degrees from that top down view, that line would be in any place."}, {"time": 4072, "text": "So kind of, is it unable to determine the target aspect?"}, {"time": 4076, "text": "Is it stationary?"}, {"time": 4078, "text": "And that's just how it puts it out and it's not used to seeing it."}, {"time": 4080, "text": "So I'm not saying that's necessarily super weird, but it was different than what we were used to seeing because we weren't used to seeing stationary objects out there very much."}, {"time": 4088, "text": "And what was also interesting is that these weren't just stationary on a zero wind day, right?"}, {"time": 4093, "text": "These are stationary at 20,000 feet, 15,000 feet, 500 feet with the wind blowing, you know?"}, {"time": 4101, "text": "And so much like the sea, when we're up there fighting, it affects everything."}, {"time": 4104, "text": "We consider the wind when we're shooting missiles, when we're flying or fuel considerations, it's like operating in that volume of air, like the ocean, everything's going with the current."}, {"time": 4114, "text": "And so anything that doesn't go with the current is immediately kind of identifiable and strange and that's why these were initially strangers because they would be stationary against the wind."}, {"time": 4122, "text": "So if you had something like a good drone in a windy conditions, what would that look like?"}, {"time": 4127, "text": "Would it not come off as stationary?"}, {"time": 4130, "text": "Would it sort of float about kind of thing?"}, {"time": 4133, "text": "No, I think with the drone technology we have today, they could stay within a pretty tight location."}, {"time": 4137, "text": "Well, I meant like DJI drone, I'm saying like generically speaking, not a military drone."}, {"time": 4143, "text": "No, I have a DJI drone myself even, and you know, maybe not a hundred knots, but if that thing's in 30 or 40 and not winds, the amount of distance it's going to be kind of doing one of these, like that change is not something I'm gonna detect from maybe many miles away."}, {"time": 4160, "text": "So it could look very stationary, but that wasn't necessarily, and what's interesting about this story is that there's not like the one smoking gun, right?"}, {"time": 4168, "text": "You have to kind of look at everything."}, {"time": 4169, "text": "And that's what I don't like about the Department of Defense and just generally people's take on this is that everything is kind of based around a single image, you know, or that one case, but a lot of the interestingness comes from the duration or the time it's been out there, how they're interacting relative to other objects out there."}, {"time": 4188, "text": "And you don't get that information when you just look at a frame for a second, you know?"}, {"time": 4192, "text": "Everyone kind of bites off on the shiny object, but."}, {"time": 4194, "text": "So you yourself, from your particular slice of things you've experienced and seen directly or indirectly, you've kind of built up an intuition about what are the things that were being seen."}, {"time": 4204, "text": "I wouldn't go that far."}, {"time": 4205, "text": "I've just been able to eliminate some variables because of how long I've observed it."}, {"time": 4212, "text": "So like you said, yes, can a drone stay in a particular position against the wind like that?"}, {"time": 4216, "text": "Certainly, but I don't think it can do that and then go 0.8 Mach for four hours after that, you know?"}, {"time": 4221, "text": "And so when you look at outside of that one, that moment in time, then it eliminates a lot of the potential things it could be, at least from my perspective."}, {"time": 4230, "text": "So what kind of stuff did you see in the instruments?"}, {"time": 4233, "text": "We'd see them flying in patterns, kind of racetrack patterns or circular patterns or just going kind of straight east."}, {"time": 4242, "text": "Occasionally see them supersonic, 1.1, 1.2 Mach, but typically 0.6 to 0.8 Mach, just for extremely extended periods of time, essentially all the time."}, {"time": 4253, "text": "And this is airspace where there's not supposed to be anything else at all."}, {"time": 4257, "text": "And it's pretty far out there."}, {"time": 4258, "text": "It starts 10 miles off the coast, goes like 300 miles."}, {"time": 4261, "text": "Can you say the location that we're talking about?"}, {"time": 4263, "text": "Off the coast of Virginia Beach."}, {"time": 4265, "text": "Got it, and so nobody's supposed to be out there?"}, {"time": 4269, "text": "It's possible for people to be there."}, {"time": 4270, "text": "It's not necessarily restricted, but it's well monitored and we're out there every day, all day."}, {"time": 4275, "text": "And so people know to stay clear."}, {"time": 4277, "text": "If a Cessna goes bumbling in there, everyone's gonna know about it."}, {"time": 4279, "text": "FAA is gonna call them out, gonna tell us about it."}, {"time": 4283, "text": "So incursions happen, not a big deal, but they're pretty rare, honestly, because everyone knows the area and we've been operating there for decades."}, {"time": 4292, "text": "And what are the trajectories at 0.6 to 0.8 Mach that these objects were taking?"}, {"time": 4298, "text": "Typically, they would be in some type of circular pattern or kind of racetrack pattern when they were at those speeds, or I just see them kind of, and it wasn't always like a mechanical flight description."}, {"time": 4310, "text": "And when I say that, I mean like an autopilot is gonna be just very precise, right?"}, {"time": 4314, "text": "It's gonna be locked on straight."}, {"time": 4316, "text": "Whereas I could see an airplane, I could tell if the pilot's flying it, right?"}, {"time": 4319, "text": "Because it's not gonna be perfect."}, {"time": 4321, "text": "The computer's not controlling it."}, {"time": 4322, "text": "And these seemed more like that."}, {"time": 4323, "text": "Not that they were imprecise, but that they were even much more erratic than that."}, {"time": 4327, "text": "So like, it wasn't like a straight line in a turn."}, {"time": 4330, "text": "It was just kind of like a weird drift like that in that direction."}, {"time": 4334, "text": "So it wasn't controlled by a dumb computer, or not disrespect to computers."}, {"time": 4340, "text": "So it wasn't controlled by autopilot kind of technology."}, {"time": 4343, "text": "That's not the sense that I got."}, {"time": 4345, "text": "So how many people have seen them in the squadron?"}, {"time": 4348, "text": "Sort of how many times were they seen?"}, {"time": 4351, "text": "How many were there times when there's multiple objects?"}, {"time": 4356, "text": "Once we started seeing them on the radar enough, and we would get close enough, we'd actually see them on our FLIR as well."}, {"time": 4360, "text": "So our advanced targeting pod."}, {"time": 4365, "text": "It's essentially a infrared camera that we use for targeting, mostly in the air to surface environment."}, {"time": 4371, "text": "We don't use it in the air to air arena."}, {"time": 4372, "text": "It's just not that good of a tool, frankly."}, {"time": 4376, "text": "But we would see IR energy emitting from that location where the radar was dropping us off."}, {"time": 4381, "text": "So the radar, we'd lock onto the object and our sensors would all look there."}, {"time": 4385, "text": "And so then we could see that it's looking at that right piece of sky, but there's energy actually coming from there."}, {"time": 4391, "text": "So now we started thinking that, okay, maybe not radar malfunctions, maybe more, maybe something is physically here, of course."}, {"time": 4396, "text": "And then people started to try to fly by it and see it."}, {"time": 4399, "text": "And at this point, I would say maybe 80 to 90% of our squadron had probably seen one of these on the radar at this point."}, {"time": 4404, "text": "Everyone was aware of it."}, {"time": 4406, "text": "There was small communication, I think, between squadrons of the same area that had the same radar."}, {"time": 4411, "text": "So I knew it wasn't just our squadron for whatever strange reason, because other squadrons would be out there and we would talk to them, like, hey, careful, there's an object."}, {"time": 4420, "text": "So they would be aware of it."}, {"time": 4422, "text": "And then, of course, people would want to go see what they look like, right?"}, {"time": 4425, "text": "So people would try to fly by it."}, {"time": 4426, "text": "I try to fly by it."}, {"time": 4428, "text": "I like how that's an of course."}, {"time": 4431, "text": "Of course you don't want to fly by it."}, {"time": 4433, "text": "There's an argument against that kind of perspective that maybe the thing is dangerous, so maybe we don't."}, {"time": 4440, "text": "But perhaps that's part of the reason you want to fly by it, is to understand better what it is if it's a threat."}, {"time": 4445, "text": "We have a lot of context now that we didn't back then."}, {"time": 4448, "text": "So it was still, hey, is this a balloon?"}, {"time": 4450, "text": "Is this a drone at a certain point?"}, {"time": 4452, "text": "And we're also aware of potential intelligence gathering operations that could be going on."}, {"time": 4457, "text": "We're up there flying our tactics."}, {"time": 4458, "text": "We're emitting."}, {"time": 4460, "text": "We're practicing our EW."}, {"time": 4462, "text": "We're turning at particular times."}, {"time": 4464, "text": "There's stuff that can be learned."}, {"time": 4465, "text": "It's not a secret."}, {"time": 4466, "text": "And countries keep different fishing vessels and whatnot in international waters off there."}, {"time": 4471, "text": "So it's not exactly a secret that we're being observed out there."}, {"time": 4475, "text": "So to think that a foreign nation would want to somehow intercept information, whether that's our radar signals or jamming capabilities to try to break that down or understand it better, be ready for that next fight, I mean, that's what scares me about this scenario because we didn't jump right to aliens or UFOs."}, {"time": 4499, "text": "We thought, this is a radar malfunction we need to be aware of."}, {"time": 4502, "text": "It's a safety issue."}, {"time": 4503, "text": "And then this could be a tactical problem right here because everything we do is based off a crypto and locations, everything's classified we do out there."}, {"time": 4513, "text": "And so over time, if you gather enough data about those fights and just monitor them forever, just like some nations do with other piece of technology or software, they could probably learn a lot."}, {"time": 4525, "text": "So we have to be cognizant of the fact and defend against it."}, {"time": 4529, "text": "So what can you say about the other characteristics of these objects like shape, size, texture, luminosity, how else do you describe object?"}, {"time": 4543, "text": "Is there something that could be said?"}, {"time": 4545, "text": "So you said like this is a tech town radar step one."}, {"time": 4547, "text": "Now you have FLIR images that can give you a sense that that's actually a physical object."}, {"time": 4552, "text": "What else can be said about those physical objects?"}, {"time": 4555, "text": "So eventually someone did see one with their own eyeballs, multiple people and they saw it in a somewhat interesting way."}, {"time": 4564, "text": "The object presented itself at the exact altitude and geographic location of the entry points into our working areas."}, {"time": 4573, "text": "So we enter at a very specific point at a certain altitude and people leave the areas at the same point at a lower altitude."}, {"time": 4579, "text": "Probably one of the busiest pieces of sky on the eastern seaboard."}, {"time": 4583, "text": "So two jets from my squadron went out and they went flying and they entered the area and one of these objects went right between the aircraft."}, {"time": 4588, "text": "So they're flying in formation and the object went between the aircraft."}, {"time": 4592, "text": "They went between the object I think."}, {"time": 4593, "text": "I don't think that the object was moving."}, {"time": 4595, "text": "I don't think it aggressively went at them."}, {"time": 4597, "text": "I think it was located still there and then they flew through it."}, {"time": 4601, "text": "But they didn't have it on their radar."}, {"time": 4603, "text": "And I think the radar might have been malfunctioning."}, {"time": 4608, "text": "I don't know that for sure."}, {"time": 4608, "text": "I would like to look into it but my supposition is that if their radar was malfunctioning it would make sense that they wouldn't avoid the object that was there because they knew these were physical at that point."}, {"time": 4619, "text": "And we would go up to these objects all the time and try to see them and couldn't see them."}, {"time": 4623, "text": "And we didn't know what it was."}, {"time": 4625, "text": "Was it, were they just not there or being fooled?"}, {"time": 4627, "text": "Was something happening?"}, {"time": 4628, "text": "Were they moving, dropping altitude at the last minute?"}, {"time": 4631, "text": "We're going by pretty quick so it's difficult to tell."}, {"time": 4635, "text": "But perhaps if his radar wasn't working it wasn't receiving energy from the jet."}, {"time": 4639, "text": "And the jet of course didn't know that it was there."}, {"time": 4641, "text": "And so whatever the case was, they flew right by and they described it just as a dark gray or black cube inside a clear translucent sphere."}, {"time": 4651, "text": "And the kind of the apex of the cube or touching the inside of that sphere."}, {"time": 4655, "text": "That's an image that's haunting."}, {"time": 4659, "text": "So what do they think it is?"}, {"time": 4661, "text": "What did they think at that moment?"}, {"time": 4663, "text": "That they, is it just this kind of cloud of uncertainty that they're just describing a geometric object?"}, {"time": 4671, "text": "It's not on radar so it's unclear what it is."}, {"time": 4675, "text": "Yeah, what was the, any kind of other description they've had of it in terms of the intuition from a pilot's perspective?"}, {"time": 4683, "text": "You have to kind of identify what a thing is."}, {"time": 4687, "text": "To answer the first part, they actually canceled the flight and came back because they were, it's like if there's one of these out here and we're almost hitting them and it's right there, then perhaps we need to get a different jet with better radar."}, {"time": 4698, "text": "So they came back and they're in their gear and they're talking to the front desk and talking to Skipper and like, hey, we almost hit one of those damn things out there."}, {"time": 4705, "text": "And this kind of was one of those kind of slight watershed moments where we all were kind of like, all right, like this is a serious deal now."}, {"time": 4712, "text": "Maybe it was a, maybe we thought they were balloons or drones or malfunctions, or maybe we thought it was fine."}, {"time": 4717, "text": "But at the end of the day, if we're gonna hit one of these things, then we need to take care of the situation."}, {"time": 4723, "text": "And that's actually when we started submitting hazard reports or hazard reps to the Naval Aviation Safety kind of communication network."}, {"time": 4733, "text": "And it's not like a big proactive thing where people are gonna go investigate."}, {"time": 4737, "text": "It's more of a data collection mechanism so that you can kind of share that aggregate data and make sure that things are progressing."}, {"time": 4744, "text": "So it wasn't a mechanism that would result in action being taken, but we were hoping to at least get the message out to whomever was maybe running a classified program that we were not aware of or something like that, that hey, like you could kill somebody here."}, {"time": 4756, "text": "Like you've grown too big for your bridges here."}, {"time": 4759, "text": "Take a step back."}, {"time": 4760, "text": "So that was our concern at that point."}, {"time": 4762, "text": "That's kind of where we were thinking this was going."}, {"time": 4765, "text": "What's the protocol for shooting at a thing?"}, {"time": 4769, "text": "Was there a concern that it's a direct threat, not just surveillance, but a thing that could be a threat?"}, {"time": 4776, "text": "At least from my perspective, like that never really crossed into my mind."}, {"time": 4779, "text": "I thought it was potentially an intelligence failure that could be being watched and information gathered."}, {"time": 4786, "text": "But I didn't think that it was something that would proactively engage me in a hostile manner."}, {"time": 4793, "text": "It wouldn't really make sense either too."}, {"time": 4795, "text": "It would be shocking to like have one of these objects take out an F18, but there's no real tactical advantage other than fear perhaps."}, {"time": 4801, "text": "Psychological, yeah."}, {"time": 4804, "text": "I've learned a lot about the psychological warfare in Ukraine as a big part of the war in terms of when you talk about siege warfare, about wars that last for many years, for many months, and then perhaps could extend to years."}, {"time": 4820, "text": "But yes, it didn't seem, it didn't fit your conception of a threatening entity."}, {"time": 4832, "text": "So looking back now from all the pieces of data you've integrated, you've personally added, what do you think it could be?"}, {"time": 4842, "text": "I don't know what it could be."}, {"time": 4844, "text": "I think we've been able to categorize it successfully into a few buckets."}, {"time": 4848, "text": "We've been able to say that this could be US technology that someone put in the wrong piece of sky or perhaps was developed and tested in an inappropriate spot by someone that wasn't being best practices."}, {"time": 4862, "text": "Is there, sorry to interrupt, is there a sort of modularity to the way the military operates, the way it's possible for one branch not to know about the tests of another?"}, {"time": 4873, "text": "Yeah, I think it's perfectly reasonable to think that that could occur, right?"}, {"time": 4877, "text": "And so if we just make that assumption, we can integrate that into our analysis here and just say, okay, but at the point we're at now, we have to assume that that's not the case, right?"}, {"time": 4886, "text": "With everything that's been going on and the statements have been made and the hearings, I think that if it was a noncommunication issue, we're in big trouble at this point."}, {"time": 4897, "text": "What about it being an object from another nation, from China, from Russia?"}, {"time": 4902, "text": "Or even one of our allies, perhaps, right?"}, {"time": 4904, "text": "Maybe that's, you know, I don't think it's controversial to say that our allies could be gathering information about us or anything of that nature, but that would be an extreme case, but I think it's just important to say, right?"}, {"time": 4915, "text": "To not just say Russia or China and just call them the bad guys and assume that if they don't have it, no one can do it."}, {"time": 4921, "text": "And so from my perspective, you know, anyone else, anyone else, and it doesn't necessarily need to be a foreign power."}, {"time": 4927, "text": "It could be a non government entity, perhaps, although I think that's very unlikely."}, {"time": 4930, "text": "But again, these are things you must consider if you kind of throw everything, everything other than the US under scrutiny."}, {"time": 4938, "text": "But you know, from what has been reported and the behaviors that have been seen, it would be, I would expect to see remnants of that technology elsewhere in the economy."}, {"time": 4949, "text": "There seems to be too many things that require advanced technology that would be beneficial commercially, as well as in other military applications for it to be completely locked away by one of our competitors."}, {"time": 4964, "text": "Now I could see us perhaps locking something away if we're already in the lead and having it to pull out as needed."}, {"time": 4970, "text": "But for someone that's perhaps in a power struggle and they're in second place, they might be more aggressive with the development of different types of technology willing to accept bigger risks."}, {"time": 4980, "text": "Do you think it could be natural phenomena that we don't yet understand?"}, {"time": 4986, "text": "I think that there are a number of things that this is going to be, right?"}, {"time": 4989, "text": "I don't think there's one thing at the end of the day, but I certainly think that that is part of what some of this could be."}, {"time": 4994, "text": "I don't think it's what we were seeing on the East Coast, and I don't think it is related to the Roosevelt incident, or I'll even go out and say the Nimitz incident, but."}, {"time": 5002, "text": "What's the Roosevelt incident?"}, {"time": 5004, "text": "The Roosevelt incident, typically referred to as the gimbal and or the go fast video."}, {"time": 5009, "text": "And then the Nimitz is from what the David Fravor has witnessed directly and spoken about."}, {"time": 5016, "text": "We'll talk about that as well."}, {"time": 5017, "text": "I'd just love to get your sort of interpretation of those incidents."}, {"time": 5022, "text": "But yeah, so in this particular case, natural phenomena could be a part of the picture, but you're saying not the whole picture."}, {"time": 5030, "text": "Yes, yes, and we can't discount it."}, {"time": 5034, "text": "Oh, the other thing is what about the failure of pilot eyesight?"}, {"time": 5040, "text": "Like sort of some deep mixture of actual direct vision, human vision system failure, and like psychology."}, {"time": 5050, "text": "Like seeing something weird and then filling in the gaps."}, {"time": 5057, "text": "Because in order to make sense of the weird."}, {"time": 5060, "text": "I've tried to expose myself to scenarios like that that I don't necessarily think are right, but I've explored them to see if they could have some truth."}, {"time": 5071, "text": "And one example is let's imagine a scenario where if we're seeing these objects every day off the East Coast, I can imagine a technology or an operation where you had some type of traditional propulsion system operating drones in order to gather data like we had discussed."}, {"time": 5087, "text": "And I could envision a clever enough adversary that could perhaps destroy or somehow remove these objects and replace them with new objects essentially when we're not looking, right?"}, {"time": 5098, "text": "And that accounts for the large airborne time."}, {"time": 5102, "text": "And so I explore options like that and I try to see what evidence and assumptions need to be made in order to prove or disprove that."}, {"time": 5111, "text": "And you would need so much infrastructure."}, {"time": 5114, "text": "You'd need so many assets."}, {"time": 5116, "text": "And so I try to explore some of those fallacies and some of those concerns."}, {"time": 5120, "text": "And as aviators, we're trained into many like actual physical, like eyesight and kind of illusion training."}, {"time": 5126, "text": "So like at nighttime flying, there's so many things that can happen flying with false horizons."}, {"time": 5130, "text": "And so we receive hours of training on that type of stuff, but this just falls outside the category from my perspective."}, {"time": 5138, "text": "What was the visibility conditions in the times when people were able to see it?"}, {"time": 5142, "text": "And we just earlier discussed complete nighttime, darkness."}, {"time": 5150, "text": "In this case, was it during the day?"}, {"time": 5153, "text": "It was a perfectly clear day that particular incident, yep."}, {"time": 5157, "text": "In a world that's full of mystery, I have to ask what do you think is the possibility that it's not of this earth origin?"}, {"time": 5167, "text": "I like the term nonhuman intelligence in a sense, because again, there's a lot of assumptions in there that may cause us to go down the wrong roads."}, {"time": 5180, "text": "It could, you know, these could be something that are weather phenomena of earth, right?"}, {"time": 5184, "text": "Or something else that is just something we don't understand and can't imagine right now that's still of this earth."}, {"time": 5190, "text": "If we consider extraterrestrials or something that came from a physical place far away in space time, you know, that leads us to some detection assumptions that we would need to make."}, {"time": 5200, "text": "And so I just try to not categorize it under anything and just say, hey, is this demonstrating intelligence?"}, {"time": 5207, "text": "And start from there as a single object."}, {"time": 5209, "text": "What can we learn about it kinematically?"}, {"time": 5210, "text": "How it's performing?"}, {"time": 5211, "text": "What does that mean for its energy source?"}, {"time": 5213, "text": "What does that mean for the G forces inside?"}, {"time": 5216, "text": "And then step it out a level and say, okay, how are these interacting with our fighters?"}, {"time": 5220, "text": "If they are, how are they interacting with the weather and their environment?"}, {"time": 5223, "text": "How are they interacting with each other?"}, {"time": 5224, "text": "So can we look at these and how they're interacting perhaps as a swarm, especially off the East coast where this is happening all the time with multiple objects."}, {"time": 5233, "text": "And so we might be able to determine some things about their maybe, you know, sensor capabilities or the areas of focus, you know, if we can determine how they're working in conjunction with each other."}, {"time": 5242, "text": "But, you know, seeing one little flash of an object doesn't provide that type of insight."}, {"time": 5246, "text": "But we have the systems for it, and it's kind of, you know, an irony, but it's a fact of life, the reality that many of these well deployed, highly capable systems are held under the military umbrella, which makes it difficult to provide that data for scientific analysis."}, {"time": 5264, "text": "So there's probably a lot more data on these objects that's not being, that's not made available, probably even within the military for analysis."}, {"time": 5275, "text": "Yeah, I think there's a lot of data that could be made available."}, {"time": 5278, "text": "And, you know, that's one of the reasons why, you know, I've been engaged with the American Institute of Aeronautics and Astronautics to build, you know, a large resources of cross domain expertise so that if or when that data is available or that there's additional analysis needed, you know, we can spin up those teams and make that analysis."}, {"time": 5298, "text": "So there was a recently a house intelligence subcommittee hearing on UFOs that you were a part of."}, {"time": 5305, "text": "What was the goal of that hearing?"}, {"time": 5306, "text": "And can you maybe summarize what you heard?"}, {"time": 5310, "text": "The hearings, from my perspective, seemed a bit disingenuous, kind of top level."}, {"time": 5316, "text": "I think... Who was it run by, sorry to interrupt, like who were the people involved and what was the goal, the stated goal?"}, {"time": 5323, "text": "Congressman Andre Carson did chair the committee and he was, I think, ultimately responsible for bringing it all together."}, {"time": 5329, "text": "You know, I think the intent from Congress was to try to bring light to what has been happening with the Navy and to help show the American people that Congress is taking this serious because something serious is happening."}, {"time": 5342, "text": "But, you know, the sense I got seemed a bit disingenuous."}, {"time": 5345, "text": "They talked around it a lot."}, {"time": 5346, "text": "They, you know, advertised their love of science fiction, but they, you know, they didn't treat this, I would say, in the manner it deserved as a potential tactical threat if it's coming from a foreign power."}, {"time": 5360, "text": "And I get it though, at the same day, they have very specific objectives within the DOD, right?"}, {"time": 5365, "text": "They have a very important job."}, {"time": 5367, "text": "Their job isn't necessarily to do exploratory science for no reason."}, {"time": 5371, "text": "So I applaud and I encourage their efforts on the intelligence side to help understand this, but my concern is that they play a role they're not well suited for, which is doing science."}, {"time": 5384, "text": "And the Pentagon has opened a new office to investigate UFOs called All Domain Anomaly Resolution Office."}, {"time": 5390, "text": "What do you think about this office?"}, {"time": 5392, "text": "Do you think it can help alleviate in a way which this hearing perhaps has failed to improve more the scientific rigor and the seriousness of investigating UFOs?"}, {"time": 5406, "text": "I think that remains to be seen."}, {"time": 5407, "text": "I think it's a step in the right direction, but it's a step that was taken because the previous step didn't happen, right?"}, {"time": 5414, "text": "So the AOI MSG was the progeny, essentially, of the AARO or AERO."}, {"time": 5421, "text": "And the name was changed because nothing was happening and it was essentially just a confusing mess of words that were created to make this topic unpalatable."}, {"time": 5432, "text": "The Airborne Objects Identification Synchronization Management Group."}, {"time": 5436, "text": "Quite the mouthful."}, {"time": 5438, "text": "I practice that."}, {"time": 5439, "text": "But the new All Domain Anomaly Resolution Office, from my perspective at least, at least the perspective that they're putting out, they seem to want to be open."}, {"time": 5448, "text": "They put out a Twitter handle, they're going out on Twitter and communicating, saying they want to keep this open."}, {"time": 5454, "text": "But that's gonna run into a classification wall."}, {"time": 5457, "text": "Well, so Dr. Sean Kirkpatrick seems like an interesting guy."}, {"time": 5463, "text": "He does, yes."}, {"time": 5464, "text": "So he's got a, Evan looked in too deeply, but he seems to have sort of, he's coming from like a science research perspective, like a background."}, {"time": 5475, "text": "So he might be, at least in the right mindset, the right background to kind of lead a serious investigation."}, {"time": 5486, "text": "I'll just say generally, the office has been receptive to AIAA reaching out in order to collaborate, which has been a positive sign."}, {"time": 5495, "text": "Also pass the same kudos to Dr. Spergel and NASA's effort as well."}, {"time": 5502, "text": "I see these organizations that are standing up, I do see them as good faith efforts that are coming about through a lot of difficulty and negotiation most likely, right?"}, {"time": 5513, "text": "And I see these as a small door opening that if we can take advantage of, can lead to a much more productive relationship between these organizations."}, {"time": 5523, "text": "How do you put pressure on this kind of thing?"}, {"time": 5525, "text": "Does it come from the civilian leadership?"}, {"time": 5528, "text": "Does it come from sort of Congress and presidents?"}, {"time": 5530, "text": "Does it come from the public?"}, {"time": 5532, "text": "Does the public have any power to put pressure on this?"}, {"time": 5535, "text": "Or is the giant wall of bureaucracy going to protect it against any public pressure?"}, {"time": 5542, "text": "I think we've been in that latter state for a while, but society seems to be a bit different nowadays."}, {"time": 5549, "text": "We have the ability to communicate and to group and to form relationships in a way that hasn't been able to be present in the past."}, {"time": 5557, "text": "We've been able to do research for better or worse on our own in a way that hasn't been able to happen before."}, {"time": 5563, "text": "And so I sense that people are a bit less willing to kind of buy the bottom line statement from those in power as they used to be back when they didn't have access to those tools."}, {"time": 5574, "text": "And so I do think there is a massive role for the general society, general populace to play to show that they are interested in this."}, {"time": 5582, "text": "Because it's not that I don't think the politicians or the leaders in the Pentagon, it's not that they don't like this topic necessarily or think it's toxic per se, but they exist in a culture where this has been toxic and they don't feel comfortable talking about it."}, {"time": 5596, "text": "And these are people that have spent their entire careers working towards a goal and getting to very high positions within government."}, {"time": 5602, "text": "And so this is very against their nature to take a stance on a topic like this."}, {"time": 5608, "text": "And so the fact that these are standing up, even if they do have a small budget or if they struggled a bit at first, I still think it's a massive change and it's a big step away from that stigma that has been pervading this topic for so long."}, {"time": 5621, "text": "And you're actually part of alleviating the stigma for somebody that's as credible, as intelligent, as varied in background, able to speak about these things."}, {"time": 5633, "text": "That's a big risk that you took, but it's extremely valuable because it's alleviating the stigma."}, {"time": 5639, "text": "I thank you for saying that, but it didn't feel like much of a risk for me."}, {"time": 5643, "text": "I didn't come out about aliens or whatever."}, {"time": 5646, "text": "I had a safety problem that I started asking questions about."}, {"time": 5650, "text": "And I went down a road as a Navy trained aviation safety officer, right?"}, {"time": 5655, "text": "That sent me to school for six weeks and Pensacola would be a safety officer."}, {"time": 5660, "text": "We're almost hitting these objects and it's not something that happened in the past and we want to understand it, it's happening right now."}, {"time": 5665, "text": "Like these occurrences are still happening."}, {"time": 5668, "text": "Aviators are flying right now, are still flying by these things."}, {"time": 5671, "text": "And in fact, I mentioned I was an instructor pilot."}, {"time": 5674, "text": "And I had a student call me about eight months ago or so."}, {"time": 5680, "text": "And he's like, hey, sir, I made it to the fleet finally."}, {"time": 5683, "text": "I had trained him how to fly."}, {"time": 5684, "text": "And then he goes to F18, he goes another year of training."}, {"time": 5687, "text": "And then he gets out to his squadron on the East Coast and he's flying with a senior member of the base, NAS Oceana, where the fighters fly out of Senior 0506."}, {"time": 5698, "text": "And it was kind of a bad weather day."}, {"time": 5700, "text": "And so they said, hey, if the weather's not good enough for us to do this dog fighting set, we'll go out and do a UAP hunt, and see if we can't find any things or take a look at them."}, {"time": 5709, "text": "I don't know if it was ingest or not, but I actually would say it's not ingest because there were notices that were being briefed about this being a safety hazard at this point."}, {"time": 5718, "text": "And so now that I think about it, it likely wasn't ingest."}, {"time": 5723, "text": "Long story short, they went flying."}, {"time": 5724, "text": "The weather was too bad."}, {"time": 5725, "text": "They did go on a UFO hunt and they physically saw one."}, {"time": 5728, "text": "And he called me up and said, hey, sir, I saw a Cuban sphere."}, {"time": 5731, "text": "They're still out here years later."}, {"time": 5733, "text": "And so it's almost like a generational issue for these fighter pilots, at least on East Coast."}, {"time": 5737, "text": "But that's great that they can talk about it, right?"}, {"time": 5741, "text": "They feel at least comfortable."}, {"time": 5742, "text": "They have a reporting mechanism."}, {"time": 5743, "text": "And so that was one of the problems that I noticed that we have a lot of reporting mechanisms to take care of safety issues and even tactical issues when the time's right in order to keep track of what's going on, but there's no way to communicate about this."}, {"time": 5759, "text": "Sure, we could submit a hazard report, but nothing's actually being investigated and if this is a tactical vulnerability or something more, it deserves attention."}, {"time": 5769, "text": "If I could ask your sort of take your opinion of the different UFO sightings that the DOD has released videos on."}, {"time": 5779, "text": "So what do you think about the Tic Tac UFO that David Fravor and others have sighted?"}, {"time": 5786, "text": "That's a truly anomalous experience."}, {"time": 5788, "text": "I can't do like mental models in my head to find potential solutions to discredit that, right?"}, {"time": 5799, "text": "Like as much as I try, right?"}, {"time": 5800, "text": "Just as a logical process, as a practice, I can't pick it apart in the way that we were just talking about a moment ago about thousands of drones being like sent up in very tricky manners, right?"}, {"time": 5810, "text": "I can't really bring myself to a clever solution that other than just saying the pilots are lying or it was error, you know?"}, {"time": 5817, "text": "And I believe, you know, I know Dave Fravor, you know, I consider him a friend, we talk a lot."}, {"time": 5822, "text": "I have zero, zero reason to disbelieve anything he says."}, {"time": 5828, "text": "Yeah, I agree with you, but in terms of the actual UFO, is there something anomalous and interesting to you about that particular case?"}, {"time": 5839, "text": "Maybe one interesting aspect there is how much do I understand about the water surface and underwater aspects of these UFOs?"}, {"time": 5850, "text": "It seems like a lot of the discussions is about the movement of this particular thing that seems to be weird, anomalous, seems to defy physics, but what about stuff that's happening underwater?"}, {"time": 5862, "text": "That's interesting to me."}, {"time": 5863, "text": "If I had advanced technology, I would certainly like to operate in part underwater because you can hide a lot of stuff there."}, {"time": 5871, "text": "You think it would be somewhat as easy as traveling through interstellar space, at least, right?"}, {"time": 5876, "text": "You know, I wish I had a great answer for that, but as an aviator, that's kind of a black box for us."}, {"time": 5884, "text": "We don't have great, what I would call cross domain tracking, right?"}, {"time": 5888, "text": "I can't see something go underwater and then follow it underwater."}, {"time": 5891, "text": "So it's literally not your domain, like underwater, like leave that for somebody else."}, {"time": 5895, "text": "Yeah, and you know, I use that terminology because it's kind of important, right?"}, {"time": 5900, "text": "Cross domain tracking is something that we haven't had to necessarily worry about, right?"}, {"time": 5903, "text": "Because airplanes operated in the air and submarines operated underwater and space planes operate in space, right?"}, {"time": 5910, "text": "But you know, there's going to be, you know, that's going to blur, I think, as we move along here, especially in the air and space regime and being able to perhaps transition my radar contact at 40,000 feet to another radar system that can track it up to 200,000 feet, you know, that might be a value."}, {"time": 5928, "text": "And so we seem to be missing that right now."}, {"time": 5931, "text": "So what about the go fast and the gimbal videos that you mentioned earlier?"}, {"time": 5934, "text": "There was a, like, what's interesting there to you?"}, {"time": 5938, "text": "So the gimbal, I'll talk about that one first."}, {"time": 5941, "text": "I was airborne for that one."}, {"time": 5942, "text": "The person that recorded it was a good friend of mine, but I mean, both air crew, I knew both of them, but the wizard himself, very close friends, went through a lot of her training together."}, {"time": 5952, "text": "We went to the same fleet squadron."}, {"time": 5954, "text": "He ended up transitioning to be a pilot and then came to where I was instructing."}, {"time": 5959, "text": "So I got to instruct him a bit on his transition."}, {"time": 5963, "text": "And, you know, the way that was, was we went out on a air to air training mission."}, {"time": 5968, "text": "So simulating a air fight against our own guys, they're acting like the bad guys and kind of go head to head against each other."}, {"time": 5976, "text": "And when we fly on those missions, we all fly out together, more or less, we set up and then we kind of attrite from the fight as we either, you know, run out of gas or something happens."}, {"time": 5986, "text": "And so people usually go back onesies or twosies."}, {"time": 5989, "text": "And so the air crew that recorded the gimbal, they were going back to the boat and we were on what's called a workup training event."}, {"time": 5995, "text": "And so this is like a month on the boat where we're essentially conducting war time operations, more or less, to stress ourselves out and to kind of do the last training block before we go on deployment, essentially."}, {"time": 6007, "text": "So it's pretty high stress."}, {"time": 6009, "text": "They actually do send aircraft from like land bases to kind of try to penetrate and we're expected to go intercept them."}, {"time": 6015, "text": "And so we're kind of practicing like we play."}, {"time": 6018, "text": "And so he saw these objects on the radar, the gimbal and a fleet of other aircraft or vehicles."}, {"time": 6027, "text": "And they initially thought it was part of the training exercise that they were sending something in to try to penetrate the airspace."}, {"time": 6035, "text": "And so they, you know, they flew over to it and as they got close enough to get on the FLIR, you know, I think everyone has heard their reaction and they realized that it wasn't something they were expecting to see."}, {"time": 6046, "text": "Can you actually describe what's in the video and what's the reaction in case they haven't seen it?"}, {"time": 6049, "text": "Yeah, a lot of swearing."}, {"time": 6051, "text": "But so what you see on the FLIR footage is a black or white, depending on when you look at it, object that's somewhat shaped like a gimbal."}, {"time": 6059, "text": "It appears almost as if someone put two plates together and then there seems to be almost like a small funnel of IR energy that's at the top of the bottom of those plates in a sense."}, {"time": 6069, "text": "So almost as if, you know, there's a stick going in between two plates, but not that pronounced, right?"}, {"time": 6074, "text": "So there's an energy field that kind of went to a funnel on the top and the bottom, at least that's how it's being portrayed on the FLIR."}, {"time": 6081, "text": "There's a lot of conversation about that being glare, things of that nature, but it was actually a very tight IR image."}, {"time": 6086, "text": "It just was nondescript shape, which was interesting."}, {"time": 6090, "text": "Typically we would see the skin of the aircraft, we can see the flames coming out of the exhaust, especially at those ranges."}, {"time": 6097, "text": "But... And there was no flames or there's no exhaust here."}, {"time": 6099, "text": "There was no exhaust, there was no, you know, there was no outgassing of repellent in any manner, right?"}, {"time": 6105, "text": "It was just an object that had nothing emitting from it that was stationary in the sky."}, {"time": 6109, "text": "Well, not stationary, but it was moving along a path, right?"}, {"time": 6113, "text": "It wasn't falling out of the sky."}, {"time": 6115, "text": "And it continued along, if we were to consider it from a God's eye view, again, on the SA page, it continued along in a path."}, {"time": 6122, "text": "And from the perspective, that top down view, it just went in another direction."}, {"time": 6127, "text": "So no, just an instantaneous direction change from that perspective."}, {"time": 6133, "text": "You also hear them, you know, very excitedly talking on the tapes about, you know, whatever the heck this thing is and look at the SA, there's a whole formation of them."}, {"time": 6142, "text": "And so the SA is a situational awareness page."}, {"time": 6145, "text": "And again, it's a large display that gives that God's eye view of all the radar contacts."}, {"time": 6149, "text": "So the video is actually showing just one and then they're speaking about many of them on the SA display."}, {"time": 6158, "text": "And what they essentially saw was, if we were to consider above the object north, so kind of offset to the north of the object, there was a formation of about somewhere between four and six of these objects in a rough wedge formation, you know, so kind of side by side like this."}, {"time": 6174, "text": "And again, not in a like autopilot type manner where it was very stiff."}, {"time": 6178, "text": "It was very kind of non mechanical, the flight mechanics again."}, {"time": 6182, "text": "And these objects were in that formation and they were going along and then they turned pretty sharply, but they still had a radius of turn and then went back in the opposite direction."}, {"time": 6191, "text": "And during that turn, they were kind of like all over the place."}, {"time": 6194, "text": "Like it wasn't tight."}, {"time": 6195, "text": "They weren't even like super, they weren't flying in a way I would expect them to be flying in relation to a flight lead."}, {"time": 6200, "text": "They were flying as if they were flying close to each other, but not in formation, which was kind of strange, right?"}, {"time": 6207, "text": "And then when they rolled out, they kind of tightened back up."}, {"time": 6209, "text": "Like, so when they basically, they started that turn and then 180 degrees out, essentially they start flowing in the opposite direction and kind of got back in that formation."}, {"time": 6217, "text": "And while that was happening, the gimbal object was proceeding, let's say left to right."}, {"time": 6221, "text": "And as those, the formation kind of turned up to the north and was just passing back it, the gimbal just kind of went back in the opposite direction."}, {"time": 6229, "text": "So to follow it back in that direction."}, {"time": 6234, "text": "And in the FLIR itself, you see the object changes orientation quite a bit."}, {"time": 6238, "text": "So you see it more or less level, maybe candid about 45 degrees."}, {"time": 6243, "text": "And then you see it kind of moving around like this, almost as if it was a gimbal."}, {"time": 6248, "text": "I've come to learn after some, having seen some research online and people really looking into this, that it seemed that the object actually climbed during that maneuver."}, {"time": 6259, "text": "And so the reason it looked like it turned immediately is because it turned like this."}, {"time": 6264, "text": "It turned in a vertical fashion like that, which is pretty interesting."}, {"time": 6268, "text": "That's kind of like another example of a flight mechanics that we don't normally operate because we don't change our directions by maneuvering in the vertical."}, {"time": 6277, "text": "If we can help it, you're just killing the fuel."}, {"time": 6281, "text": "And so if you're like a surveillance platform looking to spend as much time around something, you're not gonna climb 500 feet every time you make a turn."}, {"time": 6291, "text": "Unless you're Tom Cruise."}, {"time": 6293, "text": "Unless you're Tom Cruise, naturally."}, {"time": 6294, "text": "Okay, so is that one of the more impressive flight mechanics you've seen in video forms or not the direct eyesight reports, but like in terms of video evidence that we have?"}, {"time": 6306, "text": "We were seeing a lot of these, but we weren't just going on recording them all day."}, {"time": 6310, "text": "We just kind of put them in that safety bucket, be like, all right, there's objects over there."}, {"time": 6314, "text": "We're just not gonna go near it."}, {"time": 6316, "text": "And so we weren't putting our sensors on them that much."}, {"time": 6319, "text": "We were gathering the data kind of secondarily, but we weren't primarily focusing on it to see all the details."}, {"time": 6324, "text": "That's so fascinating because you have a busy day."}, {"time": 6327, "text": "You have a lot to do."}, {"time": 6328, "text": "All right, well, there's some weird stuff going on there."}, {"time": 6331, "text": "We're just not gonna go there."}, {"time": 6332, "text": "And that says something about human nature, about the way that bureaucracies function, the way the military functions."}, {"time": 6341, "text": "It fills up your day with busy, important things, and you don't get to, I mean, that is something that I'm in a sort of absurd way worry about, which is like we fill our days with so much busyness than when truly beautiful things happen, whatever they are, truly anomalous things."}, {"time": 6361, "text": "We just won't pay attention because they don't fit our busy schedule."}, {"time": 6367, "text": "Beautiful, I think that's right on the nose."}, {"time": 6370, "text": "And it's on my nose because I didn't give this topic the attention it deserved until I left, right?"}, {"time": 6376, "text": "Until I left and I went to be an instructor pilot where I had more time."}, {"time": 6381, "text": "I had more downtime to kind of process and think and get out of exactly what you just described."}, {"time": 6387, "text": "And that's kind of what broke me out of it and got me thinking more about it."}, {"time": 6391, "text": "Why do you think the DOD released these videos?"}, {"time": 6396, "text": "Did the DOD release it or did they kind of get out on their own in some sense?"}, {"time": 6399, "text": "So I don't know the answer to that question, but my understanding of the situation is that the DOD talked about them so much because they were already out there in a sense."}, {"time": 6407, "text": "And so they had a choice where they could have just straight up lied and said it wasn't theirs or it was fake."}, {"time": 6412, "text": "But again, I think our culture now is too open and the information moves too freely to do things like that."}, {"time": 6419, "text": "And it kind of left them in a pickle that they had to respond to."}, {"time": 6422, "text": "So what was the role of Pentagon's Advanced Aerospace Threat Intelligence Program, AATIP?"}, {"time": 6429, "text": "From your perspective, from what you know, maybe your intuition, is AATIP a real thing that existed?"}, {"time": 6434, "text": "I was in a position as an aviator that never would have exposed me to anything like that."}, {"time": 6440, "text": "But I was curious about what people knew."}, {"time": 6442, "text": "And I think in my mind, maybe you hoped or, hope someone was looking into this in some sense."}, {"time": 6447, "text": "But on the day that Gimbal was recorded, I heard that they caught something extra interesting on the FLIR, and I went to the Intel debrief space to go see the film."}, {"time": 6461, "text": "And everyone's gathered around watching it, very interesting, and I heard the admiral was coming down."}, {"time": 6465, "text": "And so I was like, I'm gonna hang out back quietly, mind my own business, and just wanna see his reaction, try to read it to see if this is brand new or if it is something that they've been dealing with."}, {"time": 6475, "text": "And you know, he came in and he watched a video for like five or six seconds, and he went, mm, and then like turned around and walked out."}, {"time": 6481, "text": "And you know, I was like, he's definitely seen these before."}, {"time": 6484, "text": "There's no way that you only watch that for a few seconds and don't have more interest."}, {"time": 6488, "text": "It was, you know, too bizarre."}, {"time": 6489, "text": "So kind of going back, does the office exist?"}, {"time": 6492, "text": "Well, you know, I've heard that the admiral essentially reported back to the Pentagon about that case real time, essentially, after he left, right?"}, {"time": 6503, "text": "So he basically went back and I was told he reported that to either ATEP directly or to other, you know, somehow the information got there."}, {"time": 6510, "text": "So from my perspective and from what I've experienced, it seems like, yes, it was a thing."}, {"time": 6516, "text": "But you know, as an aviator, I wouldn't know either way, right?"}, {"time": 6520, "text": "That's just my experience from what happened."}, {"time": 6521, "text": "But it seems like there's somewhere to report to."}, {"time": 6526, "text": "At the time, it seemed like there was at least someplace to complain to, if not report to."}, {"time": 6530, "text": "Let me ask you about sort of people that are taking a serious look at the videos and just the different UFO sighting reports."}, {"time": 6539, "text": "So there's a person named Meg West who is a skeptic and tries to take a skeptical view on every single piece of evidence on these UFO sightings."}, {"time": 6548, "text": "What do you think about his analysis?"}, {"time": 6551, "text": "He tries to analyze in a way that debunks some of these videos and assign probabilities to their explanations, sort of leaning towards things that give a very low probability to alien extraterrestrial type of explanations for these UFOs."}, {"time": 6571, "text": "What do you think about his approach to these analysis?"}, {"time": 6575, "text": "Well, two parts to his approach."}, {"time": 6577, "text": "One, I commend him for all the good work and effort he put into it."}, {"time": 6581, "text": "I've seen him build some models and things of that nature."}, {"time": 6584, "text": "And so I think that's something that's absolutely needed in this environment."}, {"time": 6587, "text": "No one's asking anyone to believe anyone here, right?"}, {"time": 6591, "text": "Trust but verify should certainly be the mantra."}, {"time": 6595, "text": "But where I have a disagreement with his approach is that he's approaching from a debunker standpoint."}, {"time": 6602, "text": "And from my perspective, not speaking for everyone, but when I hear that, that tells me that you're driving towards a particular conclusion, which has been a very safe process for the past X years."}, {"time": 6616, "text": "It's been like a very safe business to be in to tell people that they haven't seen aliens, but times have changed a little bit."}, {"time": 6623, "text": "And the tactics I've seen to try to retain that view on reality has included things such as completely dismissing what the aircrew are saying."}, {"time": 6636, "text": "And I think that is a fallacy to think that we have to take the human outside of that analysis."}, {"time": 6642, "text": "So those are the two things I disagree with."}, {"time": 6645, "text": "When you put the night vision on and you look at the stars and you look out there in the vast cosmos, only a small fraction of which we can see, how many intelligent alien civilizations do you think are out there?"}, {"time": 6661, "text": "You know, I'm of the theory that we are not the only people out there."}, {"time": 6664, "text": "I think it would be a statistically silly comment to assume we are, although I get that we are the only data point that we currently have."}, {"time": 6671, "text": "Although I'm willing to jump over that fence and say that yes, there most likely is intelligent life elsewhere."}, {"time": 6678, "text": "Although I'll concede that it is a possibility we are early or it could be limited or it could be in a manner that we don't recognize or can really understand."}, {"time": 6687, "text": "I spend so much time thinking about how we anthropomorphize things on this UFO topic."}, {"time": 6694, "text": "And we've done it to ourselves with media in a sense."}, {"time": 6696, "text": "We've trained ourselves what to think about, what we think is true or what this would be like."}, {"time": 6701, "text": "And by doing so, I think we're closing ourselves off to a lot of what the possibilities could be and the things that we could miss."}, {"time": 6710, "text": "You beautifully put that the thing that drew you to fighter jets is the technology."}, {"time": 6717, "text": "So if you were to think, to imagine from an alien perspective, what kind of technologies would we first encounter as human beings if we were to meet another alien civilization in the next few centuries?"}, {"time": 6733, "text": "What kind of thing would we see?"}, {"time": 6735, "text": "So you're now at the cutting edge and you see the quick progress that's happening."}, {"time": 6740, "text": "That was happening throughout the 20th century, that's happening now with greater degrees of autonomy with robots and that kind of stuff."}, {"time": 6746, "text": "What do you think we will encounter?"}, {"time": 6748, "text": "I think we're gonna see the ability to manipulate matter like we used to manipulate information."}, {"time": 6754, "text": "Like I think that's what, whether that means being able to pop something on the table that didn't exist or to influence a chemical reaction somewhere, but being able to manipulate and treat matter as if it was information."}, {"time": 6771, "text": "And so being able to design specific materials, being able to move past a lot of the barriers that seem to limit our progress with things such as miniaturized fusion or even just fusion in general is a lot of it is matter based, is material based and our ability to not manipulate, we can only discover materials in a sense."}, {"time": 6793, "text": "And so I think that a complete mastery of physical reality would be one of the key traits of a very intelligent species."}, {"time": 6801, "text": "Well, you're actually working on some, maybe you can correct me, but sort of quantum mechanical simulation to understand materials."}, {"time": 6808, "text": "So is that, do you see sort of the early steps that we're doing at quantum computing side to start to simulate, to deeper understand materials, but maybe to engineer and to mess with materials at the very low level that aliens will be able to do and hopefully humans will be able to do soon?"}, {"time": 6826, "text": "Yeah, I think that's, you know, so if we think about how, what materials are made of, it's just a collection of atoms, but each one of those atoms has a lot of data associated with it."}, {"time": 6836, "text": "So if we wanna kind of calculate how they interact with each other, it requires a massive amount of computational resources, so much so that it can't be done in a lot of cases with classical computers."}, {"time": 6846, "text": "And that's where quantum computers come in."}, {"time": 6849, "text": "Although we don't have a perfectly functioning quantum computer at this point, one of the things that we're working at at quantum general materials is to essentially bridge that gap between what a classical computer can do as far as simulating materials."}, {"time": 6861, "text": "And of course, what a fully functioning quantum computer would mean for being able to design materials."}, {"time": 6866, "text": "And so, you know, having the ability to study matter at a very fundamental level and unleashing artificial intelligence to machine learning on that problem, I think is, you know, in a sense, you know, alien in a way that we're able to advance our science using, you know, a process that we may not fully understand with perhaps a non human based intelligence in some sense."}, {"time": 6887, "text": "And so we may find patterns in the processes, right?"}, {"time": 6890, "text": "How does our machine learning output, you know, can we match behaviors with what we're observing with what may be a machine learning algorithm with output, right?"}, {"time": 6898, "text": "Can we try to classify the intelligence in that manner, perhaps?"}, {"time": 6902, "text": "And so, you know, at GenMatt, as we're looking at these materials, we're considering what these algorithms could have used for later on."}, {"time": 6909, "text": "Could we perhaps reverse the process and determine what a unique or anomalous material, what type of properties it potentially could have?"}, {"time": 6917, "text": "And you said GenMatt, right?"}, {"time": 6920, "text": "What's, what is GenMatt?"}, {"time": 6922, "text": "GenMatt is a quantum general material."}, {"time": 6924, "text": "So it's the company I work for."}, {"time": 6927, "text": "We essentially are working on a couple of verticals."}, {"time": 6931, "text": "One of them is our quantum chemistry work."}, {"time": 6933, "text": "We're essentially, we're bridging the gap between essentially physics and chemistry."}, {"time": 6938, "text": "We're working on those problems and again, implementing artificial intelligence machine learning into that process so that we can design those materials from the ground up."}, {"time": 6947, "text": "Additionally, we are what we consider a vertically integrated material science company, which means we can generate our own data."}, {"time": 6955, "text": "And so within the next quarter coming up, we are launching a satellite in the space."}, {"time": 6962, "text": "They'll have a fairly advanced hyperspectral sensor in there, which is intended to be the first launch that will help us detect different types of materials using our advanced knowledge of quantum chemistry, right?"}, {"time": 6976, "text": "We're gonna be leveraging that experience in order to better analyze that data."}, {"time": 6980, "text": "So materials that are strange or novel out there in space."}, {"time": 6986, "text": "Not necessarily, but we'll be looking back at Earth to be able to detect mineral deposits on Earth."}, {"time": 6991, "text": "Getting the greater perspective from out in space to do analysis of different materials."}, {"time": 6997, "text": "Yeah, I was really impressed by the DeepMind."}, {"time": 7000, "text": "I got to hang out with DeepMind recently and they really impressed me with the possibility of the application, as you were saying, of machine learning in the context of quantum mechanical simulation for materials, so to understand materials."}, {"time": 7013, "text": "It's really, really, really interesting."}, {"time": 7016, "text": "So manipulate matter, huh?"}, {"time": 7019, "text": "I would say the next thing is horses, right?"}, {"time": 7022, "text": "Or maybe fields."}, {"time": 7023, "text": "So manipulating or managing gravity."}, {"time": 7027, "text": "Can we maneuver within fields in some manner that allows us to perhaps move propellant less or in other manners, right?"}, {"time": 7037, "text": "And so I think essentially having a deeper understanding of different fields and being able to interact with them, I think would be a potential avenue for travel or advanced travel, right?"}, {"time": 7051, "text": "Propellant less travel."}, {"time": 7053, "text": "Can we quantum entangle gravity fields together and propel a ship by the gravity field of a planet, the mass of a planet, and a drive on a ship?"}, {"time": 7061, "text": "You know, there's all sorts of interesting things, but."}, {"time": 7064, "text": "Yeah, people will look back at people like you and say, well, they used to fly, like with this kind of propellant, it seems like to be a very antiquated way of flying, and they were very impressed with themselves, these humans, that they could fly like birds."}, {"time": 7078, "text": "It's like so much energy is used to fly such short distances from that perspective."}, {"time": 7085, "text": "We can only throw so many rocks out the back."}, {"time": 7087, "text": "There needs to be a better way."}, {"time": 7089, "text": "It just seems dumb, like these."}, {"time": 7092, "text": "It's like Flintstones or something like that."}, {"time": 7094, "text": "We're good at it, but there's a limit, right?"}, {"time": 7096, "text": "Like we need to be good."}, {"time": 7098, "text": "I mean, that's an interesting sort of trade off."}, {"time": 7101, "text": "How much do you invest in getting really good at it?"}, {"time": 7104, "text": "I tend to believe the reason why it would be very important and very powerful to put a human on Mars is not necessarily for the exploration facet, but in all the different technologies that come from that."}, {"time": 7119, "text": "So there's something about putting humans in extreme conditions where we figure out how to make it less extreme, more comfortable."}, {"time": 7128, "text": "And for that, we invent things, like the DOD sort of helping invent the internet and all the different technologies we've invented."}, {"time": 7138, "text": "It's almost like an indirect consequence of solving difficult problems, whether that problem means winning wars or colonizing other planets."}, {"time": 7147, "text": "And so I don't think Mars will help us figure out propulsion systems or to crack open physics to where you can travel close to the speed of light or faster than the speed of light, but it will help us figure out how to build some cool technology here on Earth, I think."}, {"time": 7163, "text": "So I'm a big proponent of doing really difficult things, really difficult engineering things to see what kind of technologies emerge from that."}, {"time": 7172, "text": "But let me ask you this."}, {"time": 7174, "text": "Do you think US government is hiding some technology like alien spacecraft technology?"}, {"time": 7184, "text": "I have no information either way."}, {"time": 7187, "text": "And if you did, you probably wouldn't tell me."}, {"time": 7189, "text": "But my assumptions, like what did my heart tell me?"}, {"time": 7192, "text": "My heart tells me something's going on, but I have no evidence for that."}, {"time": 7196, "text": "Maybe that's me wanting something to go on."}, {"time": 7198, "text": "Maybe that's a human feeling to want to know that my government's in control of what some strange unknown thing is."}, {"time": 7205, "text": "What's your sense if such a thing happened?"}, {"time": 7209, "text": "Would this kind of information leak?"}, {"time": 7212, "text": "Would this kind of information be released by the government?"}, {"time": 7215, "text": "I mean, that's the worry that you have is because when you don't understand a thing and it's novel, you want to hide it so that some kind of enemy doesn't get access to it and use it against you."}, {"time": 7227, "text": "I wonder if that is the underlying assumption."}, {"time": 7229, "text": "It's the one people always jump to, that it's for to maintain secrecy of technology."}, {"time": 7235, "text": "And I assume that's part of it."}, {"time": 7236, "text": "I wonder if there's any other reasons that we would want to not talk about it."}, {"time": 7240, "text": "I imagine that such information would have a shock to the social economic system of any country, if not the world."}, {"time": 7248, "text": "And so I wonder if perhaps that was part of the concern as well, how society can react to it."}, {"time": 7253, "text": "Maybe we're anti fragile enough now with everything that's going on and with our communication networks that, why not now?"}, {"time": 7263, "text": "That's something I think about as well."}, {"time": 7267, "text": "Yeah, the effect on the mass psyche of something like this, that there's another intelligence out there."}, {"time": 7278, "text": "We had trouble enough to deal with a pandemic, to have something of this scale, basically having just an inkling of a phenomena that we have no understanding of and could lead to complete destruction of human civilization or a flourishing of it."}, {"time": 7298, "text": "And what do you do?"}, {"time": 7299, "text": "What does a bureaucracy of government do with that?"}, {"time": 7302, "text": "Especially when they're the ones holding the range of power and such a communication would relinquish that power essentially, to some degree."}, {"time": 7312, "text": "Since you think there's aliens out there and you're somebody that's thought about war quite a bit, do you think alien civilizations, when we meet them, would want war?"}, {"time": 7328, "text": "Would they be a danger to us?"}, {"time": 7330, "text": "Would they be a friend to us?"}, {"time": 7333, "text": "What's your intuition about intelligences out there?"}, {"time": 7336, "text": "My intuition tells me that when two people like yourself or myself or anyone get together, often the output is greater than the individuals."}, {"time": 7346, "text": "And when we work together, we can typically do things that are more impressive and better than if a single person works alone."}, {"time": 7355, "text": "And now I know that war has driven technological progress, but perhaps there's other mechanisms that can do so."}, {"time": 7366, "text": "But regardless, I wonder if we truly think about an advanced society that has been perhaps thousands or millions of years ahead of us, I would imagine that same truth to be there, that people working together or creatures working together is a good thing for society or its society as a whole."}, {"time": 7387, "text": "And if we consider that, as we imagine a society growing and expanding, in a sense, the ultimate output of a planet could only be achieved in some senses if everyone was working towards the same goal."}, {"time": 7401, "text": "And there might be wonders and secrets and things that we can't imagine just simply because of the timeframes that we live under and we think in."}, {"time": 7410, "text": "But if a planet has a single unit and it almost is as an entity itself at a certain level, if everything's working towards the same output, I could almost imagine an intelligent species that approached us planet to planet instead of person to person, because that's how they've evolved and they've assumed any intelligent species would understand that working together is better than not."}, {"time": 7432, "text": "And so my heart tells me that at a certain point, love and caring and the desire to work together is much more powerful than the technological progress that war would bring."}, {"time": 7446, "text": "I hope so as well."}, {"time": 7448, "text": "Well, let me jump to the AI topic that you've done."}, {"time": 7451, "text": "So you've done research and development efforts focused on multiagent intelligence for collaborative autonomy, machine learning AI stuff that we've been talking about for combat, for air to air combat, manned, unmanned teaming technologies, all that kind of stuff."}, {"time": 7466, "text": "What's some interesting ideas in this space that fascinate you?"}, {"time": 7471, "text": "Randomness, being able to not predict what the enemy is doing almost no matter what, because there's a level of randomness that's within the tactical envelope."}, {"time": 7480, "text": "Even if utility of randomness."}, {"time": 7482, "text": "The utility of randomness in an increasing."}, {"time": 7484, "text": "Sounds like a book you should write."}, {"time": 7486, "text": "That would be a good title."}, {"time": 7489, "text": "Name my band."}, {"time": 7490, "text": "Name your band?"}, {"time": 7493, "text": "So yeah, can you elaborate that?"}, {"time": 7495, "text": "So like trying to deeper understand how you can integrate randomness through AI in the context of combat."}, {"time": 7503, "text": "In order to make yourself, in order to take away the enemy's ability to try to predict what you're gonna do to disrupt their technological progress cycles so that they don't have a clear target to aim at."}, {"time": 7516, "text": "And if you don't have a clear target to aim at, it's hard to hit it."}, {"time": 7518, "text": "Additionally, more distribution of assets and capability."}, {"time": 7523, "text": "So imagine being able to digitally model your weapon or your system or your entire tactical engagement or scenario, or allow a machine learning to help you better understand the technology that you need to build in order to defeat a particular scenario."}, {"time": 7538, "text": "And I'm talking hardware now, not just the tactic itself."}, {"time": 7541, "text": "And being able to use large amounts of simulation and machine learning to build individual assets that are small boutique using advanced manufacturing techniques for a mission or for a particular battle."}, {"time": 7556, "text": "Instead of just having these large things against an enemy, you're building systems and technology for individual cases."}, {"time": 7563, "text": "What about manned and unmanned teaming?"}, {"time": 7565, "text": "So man and machine working together."}, {"time": 7568, "text": "Is there interesting ideas there?"}, {"time": 7570, "text": "I approach it from the position that the human should be commanding from the highest level possible, right?"}, {"time": 7579, "text": "So mission, objective, base, targeting."}, {"time": 7583, "text": "And so if, just for an example, if there's a building here and I want that building to go away, that's the message I wanna communicate."}, {"time": 7589, "text": "I don't wanna tell certain vehicles to be in a certain spot."}, {"time": 7592, "text": "I don't wanna know how much fuel they have."}, {"time": 7593, "text": "I don't even wanna know what capabilities they have necessarily."}, {"time": 7596, "text": "I just wanna know that I have the ability to select from a cloud of capabilities and the right assets are gonna arrive such that they deal with the contingencies around the target such as protection systems or EW and then can prosecute the target to the high enough probability of satisfaction that's needed by the mission commander."}, {"time": 7614, "text": "And that's the power of the human mind is it's able to do some of these strategic calculations but also ethical calculations, all that kind of stuff."}, {"time": 7623, "text": "That's what humans are good at."}, {"time": 7625, "text": "Does it worry you a future where we have increasingly higher autonomy in our weapons systems, in our war?"}, {"time": 7634, "text": "So you said building."}, {"time": 7636, "text": "What about telling a set of fully autonomous drones to get rid of all the terrorists in the city?"}, {"time": 7646, "text": "So you said multiple buildings, region, that kind of, so greater and greater autonomy."}, {"time": 7655, "text": "So that's a fear, right?"}, {"time": 7658, "text": "You're viewing it from a we can cover more perspective which is fair and a lot of, I don't approach it from that topic."}, {"time": 7668, "text": "At least I don't think of it that way, at least morally."}, {"time": 7672, "text": "I think that with the advancement of warfare, assuming we have a just and moral leadership, if that's the case, then I am an advocate for increased autonomy and technology because I see it as an ability to be more precise."}, {"time": 7689, "text": "And if we trust the moral leadership of our government, then we would want to be as precise as possible in order to mitigate effects that we don't want."}, {"time": 7701, "text": "So I know that's not a satisfying answer and it leaves us maybe with bad feelings but."}, {"time": 7707, "text": "No, because having experienced sort of directly seen what it looks like when deliberately or carelessly war leads to the death of a large number of civilians as it does currently in Ukraine, the value of precision given ethical leadership becomes apparent."}, {"time": 7734, "text": "So there's something distinctly unethical about the murder of civilians in a time of war."}, {"time": 7742, "text": "And I think technology helps lessen that."}, {"time": 7745, "text": "Of course, all death is terrible but there's something about schools, hospitals being destroyed with everybody inside being killed."}, {"time": 7759, "text": "It's particularly terrible."}, {"time": 7761, "text": "It is and you approached it from the angle of more autonomy enables a wider swath of destruction."}, {"time": 7770, "text": "And that's where we get back into who's making the decisions based off of this."}, {"time": 7774, "text": "And my hope again would be that we would have the leadership that would use these things when needed in the precise way as possible to minimize that."}, {"time": 7782, "text": "And I've seen that firsthand, I've seen that in country, I've seen not blue forces but I've seen truck bombs go off on school buses, driving around Afghanistan while escorting convoys and it wasn't easy then and I'm sure it's not any easier now especially after what you've just seen."}, {"time": 7803, "text": "Do you have thoughts about the current war in Ukraine maybe from a military perspective, maybe from the Air Force perspective?"}, {"time": 7811, "text": "So I can just mention a few things."}, {"time": 7813, "text": "There's the Barakhtar drones that are being used."}, {"time": 7817, "text": "They're unmanned."}, {"time": 7819, "text": "I think they have capability to be autonomous but they're usually remotely controlled."}, {"time": 7823, "text": "They're used for reconnaissance but they're also used by the Ukraine side for reconnaissance and I think also to destroy different technologies, tanks and so on, different targets like this."}, {"time": 7836, "text": "So there's also on the Russian side the Orlan 10."}, {"time": 7840, "text": "There's the fighter jets, MiG 29 on the Ukraine side and the Su 25 on the Russian side."}, {"time": 7846, "text": "Is there anything kind of stands out to you about this particular aspects of what this war looks like that's unique to what you've experienced?"}, {"time": 7854, "text": "Maybe not unique but it's just been absolutely incredible to see the footage."}, {"time": 7859, "text": "We're watching war on Twitter essentially and to see these aircraft flying down low, spitting flares out, getting shot down, it's incredible to see this happening live for everyone to see."}, {"time": 7898, "text": "Especially like DJI, right?"}, {"time": 7900, "text": "Like there's obviously a lot of technology in there is being leveraged for other capabilities within PLC military or at least we would assume."}, {"time": 7909, "text": "What happens if that is more widespread, right?"}, {"time": 7912, "text": "Like what if we were creating our own drones and they were being used against us?"}, {"time": 7916, "text": "Would we want to have some type of kill switch or something like that, right?"}, {"time": 7918, "text": "So what I think governments are gonna have to consider like all these tools that are gonna be easily available to just any person could be turned into a tool of war or how do we stop that from being turned against us?"}, {"time": 7930, "text": "Especially as we look at 10 years from now when we have a large number of autonomous UAVs delivering packages and doing everything else over our country and any one of those could be potentially a weapon if we don't have the proper security."}, {"time": 7942, "text": "Well, we're now in Texas and Texas values its guns and it sees guns as among other things a protector of individual freedom."}, {"time": 7953, "text": "You could see a future perhaps where, and I've certainly have experienced this in the empowering nature of this in Ukraine where you can put the fight for independence into your own hands by literally strapping explosives to GGI drones that you purchase on your own salary."}, {"time": 7974, "text": "I mean that one of the interesting things about the voluntary army in Ukraine is that they're basically using their own salary to buy the ammunition to fight for their independence."}, {"time": 7984, "text": "It's the very kind of ideal that sort of people speak about when they speak about the Second Amendment in this country that it's interesting to see the advanced technology version of that, especially in Ukraine."}, {"time": 7999, "text": "Sort of using computer vision technology for surveillance and reconnaissance to try to integrate that information to discover the targets and all that kind of stuff."}, {"time": 8012, "text": "To put that in the hands of civilians is fascinating to see."}, {"time": 8016, "text": "So to sort of fight for their independence, you could say that to fight against authoritarian regime of your own government, all that kind of stuff."}, {"time": 8025, "text": "It shows you how complicated the war space in the future is gonna be invading a land like that where people have that many different types of resources."}, {"time": 8033, "text": "It could absolutely change warfare."}, {"time": 8035, "text": "I mean hopefully that creates a disincentive to start war."}, {"time": 8040, "text": "To go to war with a, yeah, sort of it changes the nature of guerrilla warfare."}, {"time": 8047, "text": "It does, yeah."}, {"time": 8048, "text": "I don't think Putin was expecting to be in that engagement quite as long as he has, of course, but it can show you how you can get caught up."}, {"time": 8056, "text": "If land wars turn into an inescapable quagmire each time due to the complications around the society's ability to access interesting tools, it could be a huge demotivator for aggression."}, {"time": 8076, "text": "Well, let me ask you about this."}, {"time": 8078, "text": "Do you think there will always be war in the world?"}, {"time": 8083, "text": "Is this just a part of human nature?"}, {"time": 8093, "text": "Until we move past resource limitation, there's always gonna be at least that one particular cause of conflict."}, {"time": 8106, "text": "And then we can also consider all our psychological lizard brain emotions that cause us to act out, although hopefully we have enough things in place to stop that from rising to the level of war."}, {"time": 8122, "text": "But we have our own biology, our own psychology and evolution to combat."}, {"time": 8126, "text": "But there are pragmatic reasons to exert violence sometimes, unfortunately, and one of those cases could be resource limitations."}, {"time": 8133, "text": "And so your question was, do I think there will always be war in this world?"}, {"time": 8137, "text": "My unfortunate answer is perhaps yes, but once there's more than one world and we're less resource constrained, then perhaps there'll be a valve of sorts for that."}, {"time": 8147, "text": "I talked to Jacco on this podcast."}, {"time": 8151, "text": "I told him about a song called Brothers in Arms by Dire Straits, and the question I asked him, I'd like to ask you the same question, is like the song goes, do you think we're fools to wage war on our brothers in arms?"}, {"time": 8169, "text": "And Jacco said, our enemy is not our brothers in arms, they're the enemy."}, {"time": 8176, "text": "And so this kind of notion that we're all human, that's a notion, that's a luxury you can have, but there is good and bad in this world, according to Jacco."}, {"time": 8189, "text": "I hear that anger and hate when I was in Ukraine amongst some people, where there was a sense where you could be brothers and sisters, you can have family, you can have love from Ukraine to Russia, but now that everything's changed and generational hate for some people have taken over."}, {"time": 8214, "text": "So I guess the question is, when you think about the enemy, is there hate there?"}, {"time": 8222, "text": "Do you acknowledge that they're human?"}, {"time": 8224, "text": "I had never had any hate or discontent when I was doing my job, I'll say, but I was also never in a true life or death situation where they were gonna kill me if I didn't kill them."}, {"time": 8237, "text": "But I think that environment isn't one born out of hate, being in that type of scenario, in a sense it's how to be alive, right?"}, {"time": 8246, "text": "I mean, our natural state is to be fighting for our survival in a sense."}, {"time": 8250, "text": "And so I think there's great power and strength and clarity perhaps in that, and it's not always born out of hate, but out of necessity, and we can't always control that."}, {"time": 8261, "text": "And I think as we focus on ourselves so much, we only dance on that pinhead when we find ourselves fighting for things that we need, and we're always taking from someone else at this point."}, {"time": 8273, "text": "And so as someone that's been in combat and very high above it, I'll say, right, where I didn't feel like I was in particular danger, I rationalized it and I made my way through it, knowing that there were people on the other side that were going to die that were on our side than not."}, {"time": 8292, "text": "So it was always a very human thing."}, {"time": 8295, "text": "It was never a reaction, emotional reaction of any sense."}, {"time": 8301, "text": "So you were able to see the basic, it's human versus human."}, {"time": 8307, "text": "There's some aspect of war that is basically one people fighting each other."}, {"time": 8339, "text": "I guess it's the kind of respect you have for the craftsmanship of the job that's taken on."}, {"time": 8346, "text": "Certainly, and that person didn't come out in his $100 million jet because I pissed him off."}, {"time": 8352, "text": "It's not an emotional response."}, {"time": 8353, "text": "We're both there, maybe because we chose to be in some sense, but at the behest of someone else and outside of our control and power."}, {"time": 8362, "text": "And so in a sense for me, it's almost a challenge that we've engaged upon agreeably, but that's such a romantic version that I have the luxury to have being high in my castle in the jet up there, not on the ground."}, {"time": 8375, "text": "So I understand that it's a bit more romantic than perhaps, you know, someone on the ground experiencing all the horrors down there, because everything looks very small from above."}, {"time": 8386, "text": "And that's another aspect of war with greater autonomy when you're controlling the mission versus, you know, have a Genghis Khan type of intimacy in terms of the actual experience of war where you directly have, you murder with a sword versus a gun versus a remotely controlled drone versus a strategic mission assignment to an autonomous drone that executes."}, {"time": 8414, "text": "Abstracted away until it's just a small decision."}, {"time": 8418, "text": "And my worry is the people without a voice are completely forgotten and silenced in all of these calculations."}, {"time": 8431, "text": "I spoke to a lot of people, poor people that feel like they've never really had a voice and they're too easily forgotten, even within the country of Ukraine."}, {"time": 8442, "text": "It's the big city versus the rural divide, you know."}, {"time": 8448, "text": "It's easy to forget the people that don't have a Twitter account and that their basic existence is just trying to survive, trying to put food on the table and they don't have anything else, anything else."}, {"time": 8462, "text": "And they are the ones that truly feel the pain of war, of the supply chain going down, of the food supplies going down, of a cold winter without power."}, {"time": 8475, "text": "You're still young, but you've seen some things."}, {"time": 8478, "text": "So let me ask you to put on your wise sage hat and give advice to young people, whether they're fascinated by technology or fascinated by fighter jets, whether they're fascinated by sort of engineering or the way the stars look at night."}, {"time": 8505, "text": "I'd suggest that they don't fear looking foolish."}, {"time": 8509, "text": "I spent a large portion of my life considering the laughter or the comments at my statements as indication that I shouldn't pursue that."}, {"time": 8522, "text": "And so I kind of woke up to that fact a bit later, but I would advise that people trust in themselves and trust in the things that they care about."}, {"time": 8532, "text": "It doesn't matter if they're good at it."}, {"time": 8535, "text": "All that matters is that they find something that they can apply love and care to and they will grow better at it and then most likely make the world better because of it."}, {"time": 8545, "text": "And don't be afraid to look stupid."}, {"time": 8547, "text": "Don't be afraid to look stupid."}, {"time": 8550, "text": "Yeah, that's one of the things that I think as you get older, you're expected to be, to have it all figured out and so you are afraid to take on new things."}, {"time": 8559, "text": "But I think as long as you're always, okay, looking stupid and having a beginner's mind, you can get really, really far even later on in life."}, {"time": 8567, "text": "So this isn't just advice for young people."}, {"time": 8568, "text": "This is really advice for everybody."}, {"time": 8575, "text": "Maybe a dark question, but has there been a difficult time in your life, a really dark place you've gone in your mind that stands out that you had to really overcome?"}, {"time": 8588, "text": "I would suggest that I've been pretty firm ground for most of my life."}, {"time": 8594, "text": "I haven't had too many personal tragedies."}, {"time": 8598, "text": "I'll say that have really defined me."}, {"time": 8602, "text": "Certainly none that I would think are outside the norm."}, {"time": 8605, "text": "So there was no truly low point."}, {"time": 8609, "text": "Actually, I have one and it's tough for me because I've spent most of my life beating motions and high emotional responses out of my system because that's what flying is, right?"}, {"time": 8620, "text": "It's keeping a steady line and doing what you need to do."}, {"time": 8624, "text": "In fact, there's been studies that show reduced adrenaline production in fighter pilots for a number of years after they get out."}, {"time": 8630, "text": "But getting out of the Navy was difficult for me."}, {"time": 8634, "text": "And I wasn't expecting it to be."}, {"time": 8636, "text": "A lot of bravado and machoism, of course, in the military, especially in fighter community."}, {"time": 8641, "text": "And we all have our plans made up to get out and none of it really accounts for any type of mental health or anything like that."}, {"time": 8648, "text": "It's all very much, where am I gonna get my paycheck from?"}, {"time": 8651, "text": "Where am I gonna move to?"}, {"time": 8652, "text": "And whether it's the Navy or just individuals, truly understanding the difference that makes."}, {"time": 8658, "text": "And when I got out, it was difficult for me."}, {"time": 8661, "text": "I think a lot of guys in that job, when they get out, they almost, at least I had anxiety when I got out because I was so used to being highly involved in something that just was I was always involved with that when I got out, I didn't know how to fill that space essentially."}, {"time": 8678, "text": "And while I wouldn't say it was an overly traumatic experience, I think it's one that's not accounted for enough that people that are getting out, so I would encourage them to take it serious and actually think about it and respect the change because it is a big one."}, {"time": 8693, "text": "Well, if I may say, you found a place in nature currently, a home, is there, can you speak to that being a source of happiness for you?"}, {"time": 8704, "text": "An escape from the world?"}, {"time": 8706, "text": "Certainly, it very much is."}, {"time": 8708, "text": "Was it deliberate that you found it there?"}, {"time": 8711, "text": "That's home for me."}, {"time": 8712, "text": "So, I moved back up to the Boston area and my wife and I had an idea after moving about eight or nine times in the Navy of kind of what we wanted just generally."}, {"time": 8723, "text": "And it was all really about the land and not about the house, we just wanted privacy and to be nearby."}, {"time": 8729, "text": "And so we ended up finding a lot of land, a parcel of land, we put a house on it and it provides me with a sense of peace that I think I can only get when I'm in nature."}, {"time": 8740, "text": "And a sense of clarity that helps me think, helps me relax, maybe it's so relaxing that helps me think, I don't know."}, {"time": 8746, "text": "But being surrounded by nature and birds and animals for me has always allowed me to, I don't know, feel most in touch with my own thoughts in a sense."}, {"time": 8759, "text": "It just provides clarity."}, {"time": 8761, "text": "And so this little sanctuary you could say I've built allows me to interface via a fiber line at my house but also feel like I'm a million miles away sometimes, which is the best of both worlds."}, {"time": 8773, "text": "A, you can just walk outside to escape at all."}, {"time": 8777, "text": "To experience life as hundreds of generations of human species have experienced it."}, {"time": 8783, "text": "Maybe it's the dichotomy, my desire for the fastness of technology and experience compared with the most basic baseline that we have."}, {"time": 8792, "text": "Isn't that strange?"}, {"time": 8793, "text": "How do you square that?"}, {"time": 8796, "text": "How drawn you are to the cutting edge and still the calm you find in nature."}, {"time": 8801, "text": "I think it makes sense."}, {"time": 8802, "text": "Nature is vastly superior to almost all of our technology."}, {"time": 8805, "text": "From a technology perspective?"}, {"time": 8808, "text": "And so in a way, it's being surrounded by perfection in a lot of senses."}, {"time": 8813, "text": "In the military and in general, have you contemplated your mortality?"}, {"time": 8817, "text": "Have you been afraid of death?"}]}]