[{"title": "Dan Gable: Olympic Wrestling, Mental Toughness & the Making of Champions | Lex Fridman Podcast #152", "id": "pRzelZlKl7E", "quotes": [{"time": 245, "text": "Most people thought I was already an artist just because I won 181 straight matches in seven years."}, {"time": 251, "text": "And not just winning, but you know, kind of punishing people."}, {"time": 256, "text": "And from that point of view, yeah, I might've been pretty good, but I had a long ways to go yet."}, {"time": 261, "text": "And I didn't really realize that, or I should say, I didn't really know how to get it out of me until I had a loss."}, {"time": 269, "text": "And then I realized I gotta buckle down, learn some of that science, become more of an artist."}, {"time": 274, "text": "How do you become an artist?"}, {"time": 275, "text": "So the Russian way has this drilling technique, thousands of reps. How do you think you work on the science, the art part?"}, {"time": 286, "text": "You gotta study the best in the world."}, {"time": 289, "text": "I think Dave Schultz was our guy in America that probably showed us that being artistic, you needed that."}, {"time": 299, "text": "And he studied it."}, {"time": 300, "text": "He went over there as a high schooler and rustled in some major tournaments over there."}, {"time": 304, "text": "And he saw their ways."}, {"time": 308, "text": "He used that Russian science and then he was already an American and he saw how I trained athletes."}, {"time": 315, "text": "He saw what I did in the Olympics, saw what other people, how we held up, and he applied that as well."}, {"time": 321, "text": "But I'd have to say he was more the artistic type."}, {"time": 325, "text": "He was more of a Russian than an American when it came to wrestling."}, {"time": 330, "text": "You've coached 45 national champions, 106 Big Ten champions, and eight Olympic medalists, which is incredible."}, {"time": 339, "text": "What is a common thread between them and what are maybe some of the fundamental differences?"}, {"time": 347, "text": "I think the common thread is that they all had one of those two avenues that we talked already and because we intertwined them."}, {"time": 362, "text": "So in a Russian wrestling room, they got the same people."}, {"time": 365, "text": "Most of the time in an American wrestling room, we had the same people."}, {"time": 368, "text": "But when I was out recruiting, at first I recruited just attitude, but I needed more than that."}, {"time": 376, "text": "I needed some genetics in that wrestling room to actually, that hard work people, they could look and see, wow, that execution, that's unbelievable."}, {"time": 392, "text": "But yet I can beat that guy after the first minute."}, {"time": 397, "text": "So you think the art, the technique is genetics."}, {"time": 402, "text": "You're born with it."}, {"time": 403, "text": "You think it's not something."}, {"time": 404, "text": "I think your pop and your ability to move."}, {"time": 408, "text": "Timing."}, {"time": 409, "text": "And timing and your quickness and your strength."}, {"time": 413, "text": "The Russians, they usually picked out the people that can go into that sport."}, {"time": 421, "text": "That was the old fashioned sports school."}, {"time": 424, "text": "But it's mostly like when you walk into a Russian wrestling room, you see them hitting skills, techniques."}, {"time": 432, "text": "You don't see them banging against each other that much."}, {"time": 435, "text": "But then when practice is over, you might not see a bunch of sprints."}, {"time": 438, "text": "You might see them walk over to the ropes and they drop down from the ceiling and they'll jump up and climb a rope, boom, boom, boom."}, {"time": 448, "text": "And then they come down and then they don't jump right back on."}, {"time": 451, "text": "They have three or four other guys go and then they jump back on."}, {"time": 454, "text": "Whereas I probably made my guys climb them, get right back down, climb them right back again."}, {"time": 460, "text": "But I also realized that I had to have a mix of that."}, {"time": 466, "text": "What was the role?"}, {"time": 467, "text": "What was your role?"}, {"time": 468, "text": "I mean, those guys looked up and Dan Gable and what was the role in helping these athletes become their best?"}, {"time": 474, "text": "These national champions."}, {"time": 475, "text": "Well, you had to first of all prove that you were, knew what you were doing."}, {"time": 480, "text": "In terms of technique or in terms of hard work?"}, {"time": 482, "text": "Everything, everything."}, {"time": 483, "text": "They just, you had to be the first guy there and the last guy to leave and you had to be the most dedicated guy, even though they were the ones that's trying to win the championships."}, {"time": 491, "text": "You had to prove that you were gonna work just as hard as they were as a coach."}, {"time": 497, "text": "So you can see it when you, you know it when you see it?"}, {"time": 500, "text": "Well, you're there ahead of them and you're there after they leave."}, {"time": 505, "text": "It's that simple."}, {"time": 506, "text": "I'm picking up after them and you're analyzing them."}, {"time": 509, "text": "You outwork them, you outwork them and you outthink them."}, {"time": 514, "text": "And so, you know, use that type of strategy."}, {"time": 516, "text": "And over time, when you prove it works, because some of my kids that were the best kids in the world really shouldn't have been a wrestler."}, {"time": 529, "text": "I mean, they weren't very coordinated, but they worked so hard to develop themselves."}, {"time": 536, "text": "What was your role in that process?"}, {"time": 538, "text": "I mean, that means pushing kids to their limit."}, {"time": 541, "text": "If you're not... Yeah, but you can't push kids to their limit."}, {"time": 544, "text": "And even when you push them to their limit, that's not their limit because their limit's above and beyond that."}, {"time": 549, "text": "I mean, yeah, coaches sometimes accidentally don't, they lose kids because of the heat, because of hard work and all that."}, {"time": 559, "text": "And you gotta know when to back off."}, {"time": 562, "text": "You gotta read your athletes."}, {"time": 564, "text": "And by that, I mean, you gotta know them pretty well."}, {"time": 568, "text": "Every once in a while, you make a little bit of a mistake, but if you don't react right on that mistake before it gets too far, then it's gonna be a casualty."}, {"time": 575, "text": "And I don't mean somebody dying necessarily, but maybe something that could turn them off or maybe something that could run them away or maybe something that, wow, that was close."}, {"time": 586, "text": "Maybe shouldn't have pushed them that far."}, {"time": 589, "text": "So you really have to be very educated."}, {"time": 591, "text": "And it's not just what you know, it's what you know about them."}, {"time": 596, "text": "And I'm not talking about the team."}, {"time": 597, "text": "I'm talking about each guy on the team."}, {"time": 599, "text": "Individuals, yeah."}, {"time": 600, "text": "Yeah, each person on the team."}, {"time": 601, "text": "And you know it how?"}, {"time": 603, "text": "You see it in their eyes?"}, {"time": 604, "text": "You know it how because you're the first one there and you're the last one to leave and you set in the environment with them."}, {"time": 610, "text": "You're there in the morning for practice sometimes."}, {"time": 613, "text": "You're there in the afternoon for two or three hours."}, {"time": 615, "text": "After practice, you might have a hot room or you might have a sauna or a steam or a whirlpool and you get in there with them and you listen."}, {"time": 625, "text": "You're not just feeding out information."}, {"time": 628, "text": "You do that, but you're taking in a lot of that too."}, {"time": 631, "text": "And I'm telling you, when you get in an atmosphere that they're relaxed and they feel comfortable, it's like a massage."}, {"time": 638, "text": "And that's after practice in one of those areas that people are around you, you learn a lot."}, {"time": 644, "text": "I mean, you got a lot to learn as a coach."}, {"time": 646, "text": "And when you get in that atmosphere, when all of a sudden you feel like very comfortable, words start flowing."}, {"time": 654, "text": "And when those words flow, you take them in as a coach."}, {"time": 659, "text": "And there's something probably gonna be said that you can do and act upon that's gonna help certain situations."}, {"time": 667, "text": "I've saved a couple of kids lives for sure that were on the brink."}, {"time": 671, "text": "Sometimes performance is at such a high level in a high level atmosphere that life and death is actually involved."}, {"time": 681, "text": "And I don't mean pushing a kid to where he just dies, but I mean, he might feel himself as a failure."}, {"time": 688, "text": "He might go home and take his own life."}, {"time": 690, "text": "Yeah, I mean, but that's part of it."}, {"time": 691, "text": "You're putting so much heart, so much blood and heart and sweat and your whole meaning of life becomes winning."}, {"time": 699, "text": "So, and sometimes it's so hard to lose within that context."}, {"time": 703, "text": "So if in your, I think the first wrestling life you wrote about Chad Zapato who lost, I mean, incredible wrestler, but lost in three finals in the nationals and has this tattoo of a hawk clawing out the human heart."}, {"time": 719, "text": "Yeah, so what lessons, is there any lessons from the incredible wrestling he's done, but also the incredible suffering that he went through on himself?"}, {"time": 731, "text": "Yeah, again, you like that word suffering, which is okay."}, {"time": 735, "text": "No, no, no, no, no, keep it, keep it."}, {"time": 737, "text": "Cause it fits right in where I want."}, {"time": 739, "text": "I have to turn that suffering around to where he makes and feels good about himself or better, doesn't have to feel perfect."}, {"time": 749, "text": "Cause he did lose, you know?"}, {"time": 751, "text": "And so, but you have to actually get him to realize that yeah, he's still unique compared to the walk of the earth."}, {"time": 758, "text": "He was unbelievably unique right at the top, just a little bit short of, but because it was, you know, he felt the suffering, you now have to go about and change that and put it into goodwill some way."}, {"time": 772, "text": "And because he's, you really have a lot of goodwill, you can do a lot of goodwill."}, {"time": 777, "text": "And so, and it's not easy."}, {"time": 780, "text": "It took him probably years, years of tattooing."}, {"time": 786, "text": "Years of covering the tattoos."}, {"time": 789, "text": "And, you know, he told me he moved to, I go, why are you moving to California?"}, {"time": 793, "text": "Cause he was here for a couple of years after his wrestling was done, cause he had a good job around here and he was, I thought he was doing a good job, but he just, he said, I had to escape, you know?"}, {"time": 804, "text": "Yeah, it's the same as the covering up the tattoo."}, {"time": 806, "text": "I had a wrestling terminology."}, {"time": 808, "text": "I have to get, I hate to say this, I hate to say this."}, {"time": 812, "text": "I go, where are you going?"}, {"time": 813, "text": "He said, I'm gonna go to California."}, {"time": 817, "text": "And I go, is there any reason why you're going to California?"}, {"time": 820, "text": "And he says, that's where everybody goes to hide."}, {"time": 828, "text": "But I said, I think you're wrong there, but you know, I think what will determine your life will be what you do from now on, you know?"}, {"time": 837, "text": "And if you can find, and he's actually turned it around."}, {"time": 840, "text": "I mean, he's actually turned it around."}, {"time": 841, "text": "You have to discover that yourself."}, {"time": 842, "text": "Exactly, and he went someplace that he thought he could fit into, and I think he did."}, {"time": 848, "text": "And I think he's got a good job, and he's helping people, and he covered that tattoo with feathers, another tattoo."}, {"time": 858, "text": "Well, in the end, it's a beautiful story."}, {"time": 860, "text": "Yeah, it is, it really is."}, {"time": 861, "text": "Suffering and overcoming."}, {"time": 862, "text": "Yeah, and he's not done yet."}, {"time": 865, "text": "He's not done yet."}, {"time": 865, "text": "No, he's not done."}, {"time": 866, "text": "He's got a lot more to do."}, {"time": 869, "text": "So you mentioned Roger Bannister, again, I think in your first book, and somebody you looked up to, that's the man who broke the four minute mile, right?"}, {"time": 880, "text": "When everybody said it was impossible, everyone thought it was impossible."}, {"time": 883, "text": "Oh, they thought he would die."}, {"time": 884, "text": "He would die."}, {"time": 885, "text": "It's not humanly possible, yeah."}, {"time": 889, "text": "Well, you've done your homework."}, {"time": 890, "text": "For what, the book, or what?"}, {"time": 891, "text": "Oh, I don't know, for me, you've done your homework."}, {"time": 893, "text": "Yeah, I know, but yeah."}, {"time": 895, "text": "I was sitting here by Putin to do research, yeah."}, {"time": 899, "text": "So what lesson do you take from that story for yourself, the impossible, trying to accomplish the impossible?"}, {"time": 905, "text": "Well, the impossible is possible."}, {"time": 908, "text": "It's just that simple."}, {"time": 910, "text": "Time changes things."}, {"time": 912, "text": "I mean, if you looked at where the mile time is right now, compared to that four minute mile, which when it was broke by a couple of tenths, or three or four tenths, it's now broke by another 20 seconds."}, {"time": 930, "text": "Yeah, by several hundred people, yeah."}, {"time": 932, "text": "Yeah, I mean, by tons of people."}, {"time": 935, "text": "And it's pretty much common knowledge that you gotta run a four minute mile if you're gonna go somewhere now, or below if you're gonna win events at major level, that you gotta be able to do that."}, {"time": 945, "text": "And so you can take that, and you can look at what in time history has as its record performance, and you can realize that that record performance, it's gonna change."}, {"time": 963, "text": "And they don't take into all the factors of knowledge."}, {"time": 968, "text": "They don't take in all the factors of better shoes."}, {"time": 972, "text": "They don't take in all the factors of better understanding of nutrition."}, {"time": 976, "text": "I mean, it's like me as an athlete."}, {"time": 981, "text": "I went to practice every day in high school for at least my sophomore, and my junior, and part of my senior year, and all of a sudden a new rule came up."}, {"time": 993, "text": "It said, the rule said before that, it said at least most of the coaches, we don't want you drinking water at practice."}, {"time": 1006, "text": "And okay, why?"}, {"time": 1008, "text": "Because you gotta toughen you up."}, {"time": 1010, "text": "That's a weakness, water."}, {"time": 1013, "text": "And so we would go through practice."}, {"time": 1015, "text": "I mean, and you're sweating, and then you're sweating so much that you're almost out of sweat."}, {"time": 1020, "text": "And so you're mostly at the end of practice, you're not even wrestling."}, {"time": 1025, "text": "You're setting against the wall."}, {"time": 1027, "text": "Because you're tired."}, {"time": 1028, "text": "So then all of a sudden they say, okay, go ahead and drink water during practice, drink greater aid during practice."}, {"time": 1034, "text": "And all of a sudden at the end of practice, we're still out there competing."}, {"time": 1038, "text": "And so I look at my career for two and a half years where I, and junior high too."}, {"time": 1043, "text": "So I got another three years where I didn't really, wasn't able to push as good as I could because I just was probably under."}, {"time": 1052, "text": "Under hydrated."}, {"time": 1054, "text": "So, but at the individual level, in terms of the impossible, when did you first believe the thing that maybe probably people would laugh at you about was that you would be an Olympic champion?"}, {"time": 1066, "text": "Well, I always visualized me being the best."}, {"time": 1070, "text": "You believed it in the very beginning."}, {"time": 1072, "text": "Forever, forever."}, {"time": 1073, "text": "Yeah, I was, because I was, I don't know if you'd call it a dreamer or somebody that, I was just involved with competitive sports at the YMCA from age five."}, {"time": 1085, "text": "Did you tell people that dream that you're gonna be Olympic champion one day?"}, {"time": 1088, "text": "You're gonna be the best in the world?"}, {"time": 1090, "text": "I think they knew."}, {"time": 1092, "text": "And the only reason why they knew, cause there was something a little different about this guy."}, {"time": 1097, "text": "He's not gonna stop."}, {"time": 1098, "text": "Well, he was out in the yard."}, {"time": 1100, "text": "And he was swinging baseball bats."}, {"time": 1103, "text": "He was swinging baseball at six, at seven, and eight, and nine, and 10."}, {"time": 1106, "text": "And he was swinging baseball bats, so much right handed and so much left hand with nobody even there throwing the ball."}, {"time": 1114, "text": "That all of a sudden when they walked by, all of a sudden the grass was down to dirt on both sides."}, {"time": 1121, "text": "So it's like, they saw me out in the yard playing by myself sports, or you get the neighborhood kids and you play a lot."}, {"time": 1131, "text": "But if they weren't there, if you walked in my front room, I was hiking a ball like I was the quarterback."}, {"time": 1138, "text": "And I was running and running through the furniture, that type stuff."}, {"time": 1143, "text": "So who saw this guy mostly was probably the parents."}, {"time": 1149, "text": "And the coaches at the YMCA level, the junior high level, they saw this guy come first and end up last."}, {"time": 1155, "text": "But I wasn't that great."}, {"time": 1158, "text": "I wasn't the fastest guy at that time."}, {"time": 1161, "text": "And I wasn't the strongest guy."}, {"time": 1164, "text": "Actually, before I went to the Olympics, when they tested me, they tested everybody."}, {"time": 1168, "text": "And I probably came back with one of the highest scores, but it was not like the highest person on this and this and that."}, {"time": 1178, "text": "I was all high across the board, straight across the board high on every one of them."}, {"time": 1183, "text": "But there was always people that were higher than me."}, {"time": 1186, "text": "But then they would go down."}, {"time": 1188, "text": "Then they would test on something else and go back up."}, {"time": 1190, "text": "Mine stayed high all across the board."}, {"time": 1193, "text": "And so I really didn't have too many flaws, but I didn't have any things that also said that you were gonna be unscored upon at the Olympic games."}, {"time": 1203, "text": "So take me through that day, if you could."}, {"time": 1206, "text": "1972, when you were going for the 68 kilogram freestyle wrestling gold, you scored 57 points, if I'm correct, and had zero points scored on you."}, {"time": 1218, "text": "57, zero."}, {"time": 1219, "text": "So maybe take me through almost the details."}, {"time": 1224, "text": "What was your routine?"}, {"time": 1224, "text": "What was your process?"}, {"time": 1225, "text": "What was going through your mind, your thoughts of that day?"}, {"time": 1229, "text": "Yeah, first of all, it was quite a day because we weighed in every day at that time."}, {"time": 1236, "text": "In the morning?"}, {"time": 1237, "text": "Yeah, we weighed in two hours before the start of the competition."}, {"time": 1241, "text": "And so that didn't mean that you weighed in two hours before you wrestled, because you didn't know whether you're gonna wrestle right away or later on."}, {"time": 1247, "text": "In fact, in that day, I don't think I wrestled until later on in the evening."}, {"time": 1252, "text": "So had all day to recover, but I didn't really need it anyway, because I wasn't really pulling a whole lot of weight, but it was just interesting."}, {"time": 1261, "text": "But what was in your mind?"}, {"time": 1262, "text": "What were you thinking?"}, {"time": 1264, "text": "Were you?"}, {"time": 1265, "text": "I was confident."}, {"time": 1267, "text": "You knew you were gonna win the gold."}, {"time": 1269, "text": "Yeah, I knew I was gonna win."}, {"time": 1271, "text": "But in reality, I didn't know it from a cocky point of view."}, {"time": 1276, "text": "I only knew it because for the last one, two, three and a half years, I had been going to practice, and I'd win in every practice."}, {"time": 1288, "text": "You felt good, you won."}, {"time": 1289, "text": "And I hardly ever lose a takedown."}, {"time": 1291, "text": "And if I lost, if somebody scored on me, it was like when I went to bed, I couldn't sleep until I figured it out."}, {"time": 1301, "text": "Or if I didn't figure it out, I would fall asleep and I would wake up with the answer of what I needed, why I got scored upon."}, {"time": 1311, "text": "So maybe now that you've won the gold, can you tell me in the practice room when somebody took you down, how do you take Dan Gable down in the practice room?"}, {"time": 1320, "text": "Timing, technique?"}, {"time": 1321, "text": "Very difficult, but somebody could, because they were going for one move."}, {"time": 1329, "text": "All I wanted was one move."}, {"time": 1330, "text": "Whereas if you can arrest somebody, arrest them the whole practice or half a practice for at least 10, 15 minutes, and they were maybe gonna score if they could work it in their mind."}, {"time": 1344, "text": "But they knew that was gonna be their victory."}, {"time": 1347, "text": "So in the practice room, maybe you can educate me, at that, when you're going for the Olympic gold, you didn't want to allow any takedowns."}, {"time": 1358, "text": "So there's no such thing as working on some kind of weird position, a weak point or something."}, {"time": 1362, "text": "It's important to not let down, take down."}, {"time": 1365, "text": "It's kind of like what we were saying before."}, {"time": 1367, "text": "If something happened and somebody scored on me in a certain way, I would go over that situation, over that situation, over it again, and I would come up with an answer."}, {"time": 1378, "text": "And then I would actually test it."}, {"time": 1381, "text": "Maybe I wouldn't go right back the next day because I didn't want the guy to not have some, I didn't want him to think that I was thinking about it all night, I didn't tell him."}, {"time": 1391, "text": "But maybe three days later when he wrestled again, I actually had it figured out because he wasn't able to."}, {"time": 1400, "text": "Or even if I was in on a takedown, an offensive move, and I got stopped and didn't score, I had to go back and filter that."}, {"time": 1409, "text": "But it wasn't something that usually I couldn't solve."}, {"time": 1414, "text": "I could usually solve it."}, {"time": 1415, "text": "Let's go back to the Olympic games."}, {"time": 1417, "text": "So I get up in the Olympic in the morning and I'm not sure when the weigh ins were, but I think I was probably a pound over."}, {"time": 1425, "text": "And that's about a half a kilo and 1.1 pounds is a kilo because we went in kilograms."}, {"time": 1430, "text": "So what do you do with that pound?"}, {"time": 1431, "text": "You aren't off or?"}, {"time": 1432, "text": "No, I just went over to the, they had a sauna there and I got in the sauna."}, {"time": 1436, "text": "And the funny thing was the morning of the finals, there was another athlete in the sauna."}, {"time": 1446, "text": "And it was American or?"}, {"time": 1450, "text": "No, it was a European."}, {"time": 1452, "text": "I don't remember where she was from."}, {"time": 1454, "text": "Not a Russian."}, {"time": 1456, "text": "I kind of think it was a plot because it was a girl."}, {"time": 1462, "text": "And she didn't have her top on."}, {"time": 1467, "text": "And that was pretty common."}, {"time": 1468, "text": "And so, you know, it was kind of interesting."}, {"time": 1471, "text": "You think back about it because there's some funny things that go on behind the scenes in Olympic games, in world games, anytime when you have country against country."}, {"time": 1484, "text": "And so there's some crazy stuff that goes on."}, {"time": 1487, "text": "Did any of it affect you?"}, {"time": 1489, "text": "Was there any?"}, {"time": 1489, "text": "Well, I almost stayed too long in the sauna."}, {"time": 1491, "text": "You lost a little bit over a pound."}, {"time": 1496, "text": "I lost a little more than a pound."}, {"time": 1498, "text": "But it didn't really bother me because I wasn't like cutting a lot of weight."}, {"time": 1504, "text": "So your match against the Russian, the... Azhelyov."}, {"time": 1508, "text": "Yeah, Azhelyov."}, {"time": 1509, "text": "He went on to be a two time world champion, a silver medalist as well."}, {"time": 1513, "text": "I mean, this is an incredible wrestler."}, {"time": 1515, "text": "So what was going through your mind before stepping on the mat with that guy?"}, {"time": 1520, "text": "You've beaten a bunch of wrestlers, haven't had a point scored on you."}, {"time": 1524, "text": "And you're stepping on the mat against this Russian who you said was really, they picked, the Soviets picked to beat you."}, {"time": 1531, "text": "Right, and I know why they picked him because he had a great attitude."}, {"time": 1534, "text": "So he wasn't just the typical artist."}, {"time": 1538, "text": "He was a good artist."}, {"time": 1539, "text": "He hooked elbows like Azhelyov."}, {"time": 1542, "text": "And he's from that area of the world where they have some of those types of moves."}, {"time": 1547, "text": "But he, and he was a goer, but by cutting him down a weight, he lost some of that go."}, {"time": 1554, "text": "And I don't know if, you gotta, that's a process you gotta go about scientifically."}, {"time": 1561, "text": "And so, if you don't do it as an American, it can really hurt your performance."}, {"time": 1566, "text": "If you don't do it as a Russian, it can hurt your performance."}, {"time": 1569, "text": "And they already didn't really do that a lot where you usually wrestle the weight where it was more like your weight."}, {"time": 1577, "text": "And so by cutting him down, maybe slowed his belief down a little bit."}, {"time": 1583, "text": "So you saw it in him."}, {"time": 1583, "text": "The spirit was a little bit gone when you were facing him."}, {"time": 1586, "text": "Yeah, but then he came back and he won rest of the matches and he was in the round robin and he was able to go to the finals, but he had lost another match actually against in the round robin against the Japanese."}, {"time": 1599, "text": "So I think I had already gained enough of artistic, being able to finish a match."}, {"time": 1606, "text": "Once I lost my match in college for the last two years, I took on some of that artistic work."}, {"time": 1612, "text": "And I think that he was already hoping to win, but he was hoping to win by a long ways because he had to pin me or beat me by eight points to be able to win the gold."}, {"time": 1626, "text": "And that wasn't gonna happen."}, {"time": 1629, "text": "I mean, the chances of pin is pretty good."}, {"time": 1631, "text": "Is it hard to pin Dan Gable versus take down?"}, {"time": 1634, "text": "Like, have you taken risks where you could pay for them?"}, {"time": 1637, "text": "I can't remember too many that I took that would actually put me in a danger position."}, {"time": 1643, "text": "I've taken risk, but the risks were so scientifically, technically correct that I wouldn't land in that danger zone."}, {"time": 1653, "text": "It's like, if I'm gonna lock up and throw you, I'm not gonna throw you to my own back and roll you through."}, {"time": 1658, "text": "I'm gonna turn in the air."}, {"time": 1660, "text": "So you were scientific about it."}, {"time": 1664, "text": "I learned the hard way."}, {"time": 1666, "text": "Early on, there was moves from collegiate wrestling that you did that exposed your shoulders, which it cost me in some early freestyle matches against great wrestlers."}, {"time": 1677, "text": "But I would go back to my collegiate escaping type moves to where I hit a Granby roll where you expose your shoulders and you lose two points every time."}, {"time": 1688, "text": "But you learn that that's not the system."}, {"time": 1690, "text": "But if you hadn't wrestled much, you would get exposed under maybe a desperate situation."}, {"time": 1697, "text": "You would hit it."}, {"time": 1698, "text": "So you won the gold."}, {"time": 1702, "text": "I think it would have, I think the question would be how would it feel if you lost the gold for me?"}, {"time": 1708, "text": "Because I already went through that once."}, {"time": 1712, "text": "Not at that highest level, but the National Collegiate Championship level my senior year."}, {"time": 1716, "text": "The Larry Owings loss."}, {"time": 1717, "text": "Larry Owings, yeah."}, {"time": 1719, "text": "And that didn't sit well."}, {"time": 1720, "text": "Were you afraid of that happening again at the Olympic level?"}, {"time": 1725, "text": "Was that even a thought?"}, {"time": 1726, "text": "No, I really wasn't."}, {"time": 1727, "text": "But it was why I changed my philosophy of training and added to the scientific artist type."}, {"time": 1737, "text": "And if I had won that match, even though I wouldn't have felt good about it, even though I squeaked it out, I wasn't feeling good about that match."}, {"time": 1746, "text": "It would have affected me a little bit, but if I'd have won it, I would have got over it."}, {"time": 1752, "text": "I mean, I'm not over it now."}, {"time": 1754, "text": "I mean, I don't know why I was doing this kind of stuff right before my match."}, {"time": 1759, "text": "By that, I mean this kind of stuff."}, {"time": 1761, "text": "Interviews, yeah, journalists."}, {"time": 1763, "text": "Yeah, and I really wasn't a good talker then."}, {"time": 1765, "text": "I mean, me and you were talking pretty good right now, except for I got a little cold, but I don't think I could say two words hardly then."}, {"time": 1772, "text": "And they took takes."}, {"time": 1775, "text": "Wide World of Sports said, hey, we want you to be the introduction for our next week's show."}, {"time": 1781, "text": "So I just say, hey, I'm Dan Gable."}, {"time": 1782, "text": "Come watch me as I finish my career undefeated 182 and 0."}, {"time": 1786, "text": "That's what they want me to say."}, {"time": 1787, "text": "Everybody assumed you'd be undefeated."}, {"time": 1788, "text": "And I said it."}, {"time": 1790, "text": "I had to take it 22 times."}, {"time": 1792, "text": "And the last two or three times they wrote it out and I read it and it still wasn't like I just said it."}, {"time": 1799, "text": "I was reading it like, hi, I'm Dan Gable."}, {"time": 1805, "text": "You know, that type of stuff."}, {"time": 1806, "text": "So, and he finally just closed the book and said, yeah, that's good enough."}, {"time": 1810, "text": "But I turned and it was my time to wrestle."}, {"time": 1813, "text": "And so, you know, you just, you learn that, and for me it was great coaching experience because that's what I turned into be."}, {"time": 1822, "text": "You know, I coached for longer than I wrestled."}, {"time": 1825, "text": "And I put out a lot of champions, but you learn through mistakes that even in your own career that you had made, you know, it's an ever learning process."}, {"time": 1836, "text": "It's an ever learning process."}, {"time": 1838, "text": "Have you ever been afraid on the mat?"}, {"time": 1840, "text": "Does fear have any role do you think for a wrestler or it must be out there?"}, {"time": 1846, "text": "Well, I'm sure fear is out there."}, {"time": 1848, "text": "And I'm sure that was to my advantage almost every time."}, {"time": 1852, "text": "I'm sure in my Olympic finals, I was really off."}, {"time": 1854, "text": "He had these doubts."}, {"time": 1856, "text": "He probably had these doubts."}, {"time": 1858, "text": "And that gives me the edge."}, {"time": 1862, "text": "And I don't know if I really ever had fear, but obviously there was points in times where I didn't perform as well, not many, but a few."}, {"time": 1876, "text": "And if I look back of it, look back at it, I don't think it was that American, you know, raw, raw, raw stuff."}, {"time": 1886, "text": "I think it was probably the fear of not being an artist as much."}, {"time": 1893, "text": "You know, maybe this guy might be better than me scientifically."}, {"time": 1897, "text": "And you know, you're a scientist."}, {"time": 1900, "text": "I think that got to me more than anything else."}, {"time": 1903, "text": "I said early on that I want to eliminate ever having to worry about getting tired in a match."}, {"time": 1909, "text": "So I kind of eliminated that."}, {"time": 1911, "text": "So I got rid of that point."}, {"time": 1913, "text": "And I do think that in wrestling, that is one of the fears that a lot of wrestlers have, actually how they feel during the match and are they gonna get tired and is it gonna affect my performance?"}, {"time": 1928, "text": "And as a coach, that really was one of the things I tried to eliminate on all my athletes."}, {"time": 1933, "text": "So there wasn't that fear factor, but that fear factor would be put upon my opponent, which would give me an edge."}, {"time": 1943, "text": "But that's not what I needed as much."}, {"time": 1945, "text": "I needed to just focus, make sure that I was doing the right things."}, {"time": 1948, "text": "And I needed my team to be focused."}, {"time": 1950, "text": "So I made sure that for my mistakes as an athlete or even as a coach sometimes, that I didn't repeat them."}, {"time": 1957, "text": "Didn't repeat them."}, {"time": 1958, "text": "And if you make a mistake once and then you can repeat it, then it's like you didn't learn anything."}, {"time": 1965, "text": "Your goal throughout your wrestling career, as you've beautifully put, was to work so hard that you pass out on the mat, right?"}, {"time": 1972, "text": "That you would be carried off the mat."}, {"time": 1974, "text": "So you never did successfully in, that's one of the ways you failed in your career is you've never worked so hard that you've passed out."}, {"time": 1981, "text": "Have you ever come close?"}, {"time": 1982, "text": "Do you remember a time that you've come close that you've been pushed to the limits of exhaustion?"}, {"time": 1987, "text": "You know, the question is really a good question about that pushing to you collapse."}, {"time": 1993, "text": "Because I don't, as a coach today, I don't think I get, if I said that to my athletes, I don't know, I could get in trouble."}, {"time": 2002, "text": "Because, you know, it's like."}, {"time": 2003, "text": "But it's understood, isn't it, by the athletes?"}, {"time": 2006, "text": "Yeah, they understand it."}, {"time": 2009, "text": "But the outside might not understand it."}, {"time": 2011, "text": "Because it's almost like, what do you mean there?"}, {"time": 2014, "text": "You push them to the point where they go collapse."}, {"time": 2016, "text": "It means they may die or something might happen to them."}, {"time": 2020, "text": "And, you know, that's dangerous."}, {"time": 2022, "text": "We can't have our kid in that type of atmosphere."}, {"time": 2025, "text": "But it's something that's highly unlikely that's gonna happen."}, {"time": 2029, "text": "But I'm gonna tell you, there's many times in a practice where I had pushed myself to all of a sudden the whistle blew or it was time to stop."}, {"time": 2038, "text": "And when I got up off the mat or wherever I was at and I needed water, I needed fresh air, because you're usually in a fairly small room with a lot of guys that the heat rises and it's hard to breathe."}, {"time": 2054, "text": "And that I can remember, and I stayed a lot of times not by the door, the far end of the room."}, {"time": 2060, "text": "I can remember walking from the far end of the room to that door."}, {"time": 2063, "text": "And I can remember, am I gonna make it the next step?"}, {"time": 2067, "text": "Am I gonna make it the next step?"}, {"time": 2068, "text": "I need air, I need water, I need oxygen, I need to get out of here."}, {"time": 2073, "text": "It didn't happen often, but I can recount four or five times in my career that I pushed myself to that level where I thought I was gonna maybe go out, but every step I was dizzy."}, {"time": 2084, "text": "But once I got to that door, I was able to open it and go out and grab the water and get cold water in my face."}, {"time": 2091, "text": "And so, no, I never really was able to do that."}, {"time": 2095, "text": "And I think the story is in a book where my daughter pushed a collapse, Molly."}, {"time": 2100, "text": "It made you proud."}, {"time": 2101, "text": "Oh my gosh, and she didn't win."}, {"time": 2104, "text": "But she pushed a collapse."}, {"time": 2106, "text": "Now, did she suffer because of that?"}, {"time": 2110, "text": "Well, she didn't get to go to the next event because she had to qualify."}, {"time": 2115, "text": "But I think it probably helped her too, realizing because she was winning the race and she was beating people she normally never pushed, but she was at a new level that she had never been before and she only needed about five feet to finish."}, {"time": 2128, "text": "And it was just one of those things that I bet there was a lot of learning that she did there."}, {"time": 2133, "text": "And it probably made her realize that she could be better, but she had to hold up though."}, {"time": 2140, "text": "So you mentioned in Wrestling Life that the Brands Brothers looked up to Roy Salger, who was known for pushing the limits of physical wrestling, but not getting too rough."}, {"time": 2152, "text": "So how do you find the line between extreme physical wrestling, but at the same time not rough wrestling or angry wrestling?"}, {"time": 2160, "text": "So that line between aggression, tough wrestling and anger."}, {"time": 2165, "text": "Well, I think anger would cause less successful wrestling."}, {"time": 2171, "text": "I think anger would cause you to make mistakes and actually get out of position because I think anger is kind of a loss of control."}, {"time": 2181, "text": "And there can be a furious type of attack, but I think if it crosses the line to anger, then you're gonna be vulnerable."}, {"time": 2198, "text": "And so Royce and the Brands wrestled to the edge, through the edge, but when the whistle blew, they stopped."}, {"time": 2212, "text": "And there's people that when the whistle blows, they keep going."}, {"time": 2216, "text": "It's like in a football game, a fight breaks out and it's after the whistles blow."}, {"time": 2222, "text": "Well, when the whistle blew, they backed off."}, {"time": 2227, "text": "So that whistle was something that in a match, that kind of gave them the boundaries."}, {"time": 2238, "text": "But perhaps it could be a little bit of fuel."}, {"time": 2240, "text": "So in Wrestling Tough, the book that you just got from Mike Chapman, the new edition, talks about Bill Cole, undefeated Northern Iowa wrestler."}, {"time": 2248, "text": "And how he talked about how my strength, speed and ability to think were increased tremendously by just sitting apart from the action prior to the match and getting into a state of controlled anger."}, {"time": 2262, "text": "So can anger, controlled, so anger could be fuel as long as it's controlled."}, {"time": 2270, "text": "You had that line."}, {"time": 2272, "text": "One side of the line, you can have an anger for performance and the other side of the line, if you go beyond that, it's not gonna be for performance."}, {"time": 2282, "text": "It's gonna be for not performance because you're gonna lose points."}, {"time": 2286, "text": "It's a fine line."}, {"time": 2287, "text": "There's definitely a fine line."}, {"time": 2289, "text": "You're talking about Roy Selger."}, {"time": 2291, "text": "You're talking about Tom Brands."}, {"time": 2293, "text": "You're talking about Terry Brands."}, {"time": 2294, "text": "I mean, you got world championship titles there."}, {"time": 2296, "text": "You got Olympic championship title there."}, {"time": 2298, "text": "You got a world silver medalist in Roy Selger."}, {"time": 2303, "text": "And when I talked to him about the world silver medalist, he's haunted by that."}, {"time": 2312, "text": "Cause he was actually 20 seconds away from winning when he got beat in the end there, but that's part of the game."}, {"time": 2318, "text": "And I don't know whether he's okay with it or not."}, {"time": 2323, "text": "Cause he says every, after talking about things, he goes, I'm okay with it now."}, {"time": 2329, "text": "But then he keeps talking about it."}, {"time": 2331, "text": "So I don't really think he's okay with it."}, {"time": 2334, "text": "And it's hard for him to actually make amends to himself when you really don't do it."}, {"time": 2342, "text": "I mean, it's no matter what the situation, even with the Owings loss."}, {"time": 2347, "text": "Yeah, it still eats it."}, {"time": 2349, "text": "I mean, yeah, I'm a world champion."}, {"time": 2350, "text": "He's not, and he wanted to be."}, {"time": 2353, "text": "I'm Olympic champion."}, {"time": 2354, "text": "He's not, he wanted to be."}, {"time": 2356, "text": "One of the greatest coaches of all time."}, {"time": 2359, "text": "And so, it's like, why do I keep going back to it?"}, {"time": 2365, "text": "Because you don't get over those things."}, {"time": 2370, "text": "So Roy really keeps going back to it, even though he says he's fine."}, {"time": 2375, "text": "But then he realizes he's really not fine because that's just the nature of the game."}, {"time": 2379, "text": "And that's why he was able to win national titles and make world teams and stuff like that."}, {"time": 2388, "text": "What's interesting about him, he's analyzed all the people that he's wrestled, and a lot of them have won world and Olympic championships."}, {"time": 2395, "text": "And he's beaten every one of them at one time or another."}, {"time": 2398, "text": "And he didn't get to that world championship gold or Olympic gold."}, {"time": 2403, "text": "And he says it because they did it."}, {"time": 2408, "text": "So he's showing people that I beaten those guys."}, {"time": 2414, "text": "But apparently he didn't beat them at the right time."}, {"time": 2418, "text": "And so it's still haunting."}, {"time": 2420, "text": "You don't get away from that stuff."}, {"time": 2422, "text": "I mean, it's just like anything in life that's really high."}, {"time": 2427, "text": "I mean, it doesn't have to be athletics."}, {"time": 2430, "text": "I mean, you think I'm ever gonna get over the murder of my sister?"}, {"time": 2435, "text": "And you might not even know that."}, {"time": 2437, "text": "Let me pause for a second, please."}, {"time": 2439, "text": "You've talked about it, you've written about it."}, {"time": 2441, "text": "So I hope it's okay for me to say that your sister, your older sister, on May 31st, 1964, was raped and murdered by a local boy."}, {"time": 2452, "text": "So the echoes of pain and anger from that tragic day, do they ripple through your life still?"}, {"time": 2460, "text": "Through your wrestling, through your coaching, through the way you, when you wake up in the morning?"}, {"time": 2469, "text": "It can be very emotional to me under certain circumstances."}, {"time": 2475, "text": "And it can be the mood I'm in."}, {"time": 2481, "text": "It can be maybe if I've had a Mountain Dew or maybe if I've had a Gable beer."}, {"time": 2487, "text": "Yeah, or maybe if you turn the country music up a little bit loud, emotions come out and everybody has them in their life."}, {"time": 2503, "text": "It's just so happens, what brings it out?"}, {"time": 2506, "text": "And hopefully it's nothing that you do to the extreme point to where it brings it out."}, {"time": 2512, "text": "For me, it's not extreme."}, {"time": 2514, "text": "I don't have to have any of that really, I can get emotional."}, {"time": 2517, "text": "How did that change you as a man?"}, {"time": 2521, "text": "What it did was realize that I was already pretty well developed because I was only a sophomore, 15 years old in high school."}, {"time": 2533, "text": "And I had parents that weren't making it."}, {"time": 2537, "text": "And my parents are a lot older than me."}, {"time": 2540, "text": "And now that we're down just to me and my parents, and I'm gonna be around the house for another two years."}, {"time": 2547, "text": "And they had just lost a daughter that was the only other sibling."}, {"time": 2556, "text": "They weren't handling it."}, {"time": 2557, "text": "They were the ones that were suffering much more than me, even though I always look back upon one area that I wasn't good at was communication at that time, except inside the resident room, because I had been tipped off."}, {"time": 2575, "text": "Tipped off, what do you mean?"}, {"time": 2577, "text": "Well, then everybody said that something to me about my sister just three weeks before that, that really wasn't normal or practical."}, {"time": 2588, "text": "And I said nothing to nobody."}, {"time": 2592, "text": "Is there a part of you that blames yourself?"}, {"time": 2600, "text": "But I'm 15 years old and you make mistakes."}, {"time": 2607, "text": "And you don't really act on everything that happens in your life."}, {"time": 2612, "text": "But I can tell you how it affected me."}, {"time": 2614, "text": "And I acted a lot on anything that maybe wasn't even of that consequence."}, {"time": 2619, "text": "I mean, cause I had four daughters and I'm telling you when they left every time to go somewhere in a car or go out with someplace, I always said something to them."}, {"time": 2627, "text": "And they would always say, dad, you said that last night."}, {"time": 2631, "text": "What, like I love you or like be careful?"}, {"time": 2634, "text": "I'd say like, don't be driving and drinking or don't be in a car with somebody that's of the same nature, or stay out of trouble."}, {"time": 2645, "text": "Don't go be somewhere where you have, I said, you know how to get out of a car if your car goes into the river."}, {"time": 2652, "text": "I'm always thinking ahead a little bit, just in case of something did happen."}, {"time": 2659, "text": "And it goes back to that walk to school with that young man that when he was talking to me and I just, I took it and I kept it inside me."}, {"time": 2668, "text": "And once I found out she had been murdered, it took me maybe 25 to 30 minutes."}, {"time": 2677, "text": "And I told my dad, I think I know who killed her."}, {"time": 2681, "text": "And he looked at me and he just like, he slapped me actually."}, {"time": 2686, "text": "He pushed me against the car."}, {"time": 2687, "text": "He didn't slap me."}, {"time": 2688, "text": "My mom slaps me."}, {"time": 2689, "text": "She was the one that slapped me around a little bit."}, {"time": 2691, "text": "But my dad, he pushed me against the car and go, what do you mean you might know something about this?"}, {"time": 2697, "text": "I said, dad, I don't for sure, but, and I would probably all crying, but, and I don't, I doubt if I was crying yet."}, {"time": 2706, "text": "I've probably cried a lot of tears since, but, you know, I just said, hey, I was walking to school with this neighbor and I never had walked to school with him before."}, {"time": 2717, "text": "And he was kind of a troubled kid."}, {"time": 2720, "text": "And he said something about Diane and it wasn't good, but I didn't, he goes, why didn't you say something?"}, {"time": 2729, "text": "I said, daddy, I just boy talk, you know?"}, {"time": 2733, "text": "So, you know, and so he hugged me, he hugged me, he hugged me and, you know, it was one of these things that it's definitely made me a lot of who I am because there's been a lot of choices and I don't, I took the word choice out of my life and I just like to say, okay, do the right thing, do the thing that you should do."}, {"time": 2755, "text": "And so I don't really, it's like, are you gonna do this or this?"}, {"time": 2758, "text": "Well, what do you mean?"}, {"time": 2759, "text": "Which one's better?"}, {"time": 2761, "text": "Well, then I'm, so I don't have that choice."}, {"time": 2763, "text": "Just give me the right way to go."}, {"time": 2765, "text": "And so not that I've been perfect by any means, but it's made a big difference in my life on how I handle my life."}, {"time": 2773, "text": "It's probably given me the opportunity to be married for 44 years."}, {"time": 2778, "text": "It's just given me opportunities to be better in my life."}, {"time": 2782, "text": "And I, you know, I wanna thank my sister for that, you know, and I think my family was ready to make a split because of that incident, they're blaming each other."}, {"time": 2796, "text": "And I think that I was able to help, but more than that, they really liked each other, but they didn't really know it at the time until I got out of the house."}, {"time": 2807, "text": "Two years later, it probably was going on for a couple of years until I moved on and went to college."}, {"time": 2812, "text": "Then they found out they really liked each other when they were alone and it worked out pretty good."}, {"time": 2818, "text": "But I think them being able to follow me, not just through college and the Olympics and worlds, but my coaching."}, {"time": 2828, "text": "So it's the same, the same success and factor, you know, the excitement and all those things gave them a real purpose."}, {"time": 2836, "text": "And it gave my four daughters, it gave my wife, you know, a real purpose to be able to be close to all these champions and championships."}, {"time": 2847, "text": "And now it's like, there's a family of 22 and they're all interested in what we're interested in."}, {"time": 2854, "text": "And it's going good, knock on wood."}, {"time": 2856, "text": "But you know, it's something that when all of a sudden you got too much time in your hands and you're not doing and accomplishing much that things probably, you know, get off track."}, {"time": 2867, "text": "What do you think is the role of family in wrestling?"}, {"time": 2869, "text": "Can a man do it alone?"}, {"time": 2870, "text": "And if not, where's family most important?"}, {"time": 2875, "text": "You know, you can do it alone, but why would you want to?"}, {"time": 2881, "text": "I think the chances of doing it alone are much less than the chances of doing it together."}, {"time": 2887, "text": "I know they say, don't bring your profession home sometimes."}, {"time": 2890, "text": "They say that, I never got away from my profession."}, {"time": 2896, "text": "And you know, sometimes I, it's like my house right here."}, {"time": 2901, "text": "So when I'm moving home and I'm not going to have an office because I'm not going to coach anymore or I'm not going to be an assistant athletic director for a while, that you got to do something that gives you a little bit of a break."}, {"time": 2919, "text": "Not you necessarily, maybe the person you're living with."}, {"time": 2922, "text": "And so I don't know if you looked outside there, I got a cabin right out in my backyard."}, {"time": 2925, "text": "You probably can't see it right there, but."}, {"time": 2927, "text": "What's in the cabin?"}, {"time": 2928, "text": "That's my house away from my house."}, {"time": 2931, "text": "It's only 30 feet from my house and it's my office and it's my workout room."}, {"time": 2937, "text": "I got a sauna there, it's a bed upstairs if I need it."}, {"time": 2940, "text": "If I ever get too close and she says, hey, why don't you go sleep in the other house?"}, {"time": 2945, "text": "But you know, it kicks me out of the bed, but."}, {"time": 2947, "text": "Get the heck out."}, {"time": 2948, "text": "It's never happened."}, {"time": 2949, "text": "But I do spend a lot of time out there."}, {"time": 2951, "text": "And it's, you know, you got to have a little distance sometimes and you got to know your role."}, {"time": 2958, "text": "And so all of a sudden when you're a guy that's been gone your whole life from eight o clock in the morning until close to seven, three or eight o clock at night."}, {"time": 2965, "text": "So 11, 12 hours a day, then all of a sudden you're not gone as much, even though you still work."}, {"time": 2970, "text": "She's trying to slow me down now."}, {"time": 2997, "text": "And so I said, well, you know, I'm glad to do that because that's my life, you know?"}, {"time": 3001, "text": "So, but then all of a sudden I didn't say anything to my wife until all of a sudden this morning."}, {"time": 3007, "text": "And I told her that I might go on the Friday the 21st of December."}, {"time": 3012, "text": "Well, I said, that's not Christmas."}, {"time": 3014, "text": "She goes, we're celebrating Christmas that weekend early because a lot of the family can't be here except for that weekend."}, {"time": 3023, "text": "And I said, oh, well, that's not gonna work."}, {"time": 3026, "text": "But I kind of didn't say anything to her at first."}, {"time": 3028, "text": "And then, well, I'll tell you, she started getting a little emotional."}, {"time": 3032, "text": "And if I want to stay married for another year, 45 years, then I better tell those people that I got family obligations because that depends what's most important."}, {"time": 3048, "text": "I love wrestling."}, {"time": 3048, "text": "I love wrestling and I want to start another, start another wrestlers and business network."}, {"time": 3054, "text": "But there's more than one Dan Gable out there."}, {"time": 3055, "text": "Well, maybe not, but there's a lot of people that are maybe even closer and they got big names."}, {"time": 3065, "text": "I mean, we're doing pretty well right now."}, {"time": 3066, "text": "I mean, we got first two years ago and we got second this year."}, {"time": 3072, "text": "And then we got the women's freestyles doing good in wrestling."}, {"time": 3075, "text": "We got to work a little bit on our Greco yet, but they are working on it."}, {"time": 3080, "text": "But our men's freestyle team right now are excellent."}, {"time": 3085, "text": "And the key for them is to get them all on the same page instead of just have new highlights."}, {"time": 3095, "text": "And by that, I'm saying, you look and see who won this year."}, {"time": 3099, "text": "Well, the three guys that have never won before won this year."}, {"time": 3102, "text": "We had three world champions."}, {"time": 3103, "text": "Our two past world champions didn't win this year."}, {"time": 3108, "text": "I mean, they did okay, they got medals."}, {"time": 3111, "text": "Did Borrows win?"}, {"time": 3112, "text": "No, he did not."}, {"time": 3114, "text": "He got third."}, {"time": 3115, "text": "Oh, that's right, he got bronze, yeah."}, {"time": 3116, "text": "And Sajilov got, I mean, Snyder got second."}, {"time": 3120, "text": "So those two are our main guys."}, {"time": 3122, "text": "So the three new guys that came through were guys that hadn't won world gold."}, {"time": 3128, "text": "In fact, two of them have never made a world team before."}, {"time": 3131, "text": "And so we have three world champions this year, but we needed all five of them to come through to win the championships."}, {"time": 3138, "text": "And so the key really is getting them all to do the same at the same time, year in and year out, and not just based on, okay, Borrows got beat this year, so he'll win next year."}, {"time": 3152, "text": "It's gotta be every year if you're capable of doing that."}, {"time": 3154, "text": "And that's what the coaching staff has to do."}, {"time": 3156, "text": "What's kind of funny that I do have a lot of influence actually on the coaching staffs right now at the USA level because the women's freestyle guy is Terry Steiner."}, {"time": 3166, "text": "And he wrestled for me, he was a national champion."}, {"time": 3169, "text": "He's got a twin brother that's at Fresno State."}, {"time": 3172, "text": "And then Billy Zaddik is the freestyle coach and he wrestled for the Hawkeyes back in the early days."}, {"time": 3180, "text": "And he was the national champion."}, {"time": 3182, "text": "So we've got a lot of former Gable influence on there, but it's."}, {"time": 3187, "text": "You got deep roots in there."}, {"time": 3188, "text": "In 2013, the International Olympic Committee, IOC, voted wrestling out of the Olympics."}, {"time": 3194, "text": "So a lot of folks know about this, the absurdity of it and so on."}, {"time": 3200, "text": "But in a big picture, you can step back now, it's five years later."}, {"time": 3206, "text": "Well, first of all, did it surprise me?"}, {"time": 3212, "text": "But did it really surprise me?"}, {"time": 3218, "text": "You gotta run."}, {"time": 3219, "text": "You gotta have people running the organization that are top notch."}, {"time": 3228, "text": "If you take anything for granted and you're not the person of authority, somebody can kick you out."}, {"time": 3237, "text": "And even though we had a lot of authority because we're wrestling, we're one of the first sports in the Olympics ever, and that we think that we're in 180 some countries and some of the number one countries in the world that are politically strong have the sport, we thought we were okay."}, {"time": 3263, "text": "But then you gotta look and see who's running the IOC."}, {"time": 3266, "text": "The IOC, the International Olympic Committee."}, {"time": 3272, "text": "And then you gotta see that in wrestling, we don't have anybody in there."}, {"time": 3277, "text": "I mean, that shocked me."}, {"time": 3279, "text": "We've never had anybody on the IOC from wrestling."}, {"time": 3285, "text": "Because we didn't have to, but yes, that's wrong."}, {"time": 3291, "text": "And if you don't have somebody looking out for you right within the structure, then it's pretty easy for people to turn their head."}, {"time": 3301, "text": "But all it took was the statement, you guys are kicked out of the Olympics."}, {"time": 3308, "text": "You guys are done."}, {"time": 3309, "text": "Everybody came together."}, {"time": 3311, "text": "Well, yeah, I mean, it's the first time in history that probably all this competitive people that were working for their own agenda turned that agenda to the sport."}, {"time": 3327, "text": "So that made a big difference and we got a lot done."}, {"time": 3330, "text": "In fact, in America, there was several people that were really out there that we didn't know about until this point in time."}, {"time": 3342, "text": "And when they came aboard, now they're still aboard."}, {"time": 3347, "text": "That doesn't mean we're doing everything perfect because just because we got voted back in before we even got kicked out really, that doesn't mean we're by any means safe."}, {"time": 3358, "text": "We have to do some of the things that I'm talking about or some of the things that we didn't do before."}, {"time": 3363, "text": "We can't fall right back into the same mess."}, {"time": 3366, "text": "And so our leadership got changed and it's better, but it's gotta stay better."}, {"time": 3373, "text": "But there are things that we could still be doing to make sure that we don't have situations like this happen."}, {"time": 3382, "text": "I'll tell you, when I first learned about it, I was like, I broke down and wept again."}, {"time": 3389, "text": "It's like every once in a while, I'll break down and cry about my sister or I'll break down, I don't know if I cry about losing the owings, but I probably get more determined."}, {"time": 3402, "text": "But that's kind of, you have to go back and think about those moments when you heard, when I heard that moment and it just overcame me."}, {"time": 3413, "text": "It was like four o clock, 4.30 in the morning when I heard about it."}, {"time": 3417, "text": "And my wife had been up looking at the internet and she woke me up and I thought she was joking, but I jumped out of bed really quick when she said that."}, {"time": 3425, "text": "I knew she was serious."}, {"time": 3427, "text": "And I started making phone calls right then to find out if it was true."}, {"time": 3431, "text": "And when I found out it was true, it was just like devastating."}, {"time": 3434, "text": "And it was one of these things that it's a nightmare, and, but you don't let it happen again."}, {"time": 3446, "text": "You keep getting stronger."}, {"time": 3447, "text": "Yeah, and if people haven't read, they should read The Loss of Dan Gable by Ray Thompson, the ESPN article."}, {"time": 3454, "text": "That kind of, in this very beautiful poetic way, ties together all the losses of Dan Gable, the losing your sister, losing to Larry Owens, losing wrestling from the Olympics, all of these tragedies of various forms."}, {"time": 3473, "text": "So that's, well, the IOC, there's politics, and you're sort of being very pragmatic."}, {"time": 3480, "text": "But stepping back, wrestling is one of the oldest forms of combat, period."}, {"time": 3484, "text": "Dating back, there's cave drawings 15,000 years ago."}, {"time": 3488, "text": "And if you look at the ancient Olympics, the Greek Olympics, 2,700 years ago, did you ever, when you wrestled or coached, do you now see wrestling in this way, freestyle and folk style wrestling, the purity of sort of two human beings locked in combat, the roots of that as just human beings, this fair struggle between two men or two women?"}, {"time": 3514, "text": "I don't think I ever looked at it as anything but just a combat."}, {"time": 3523, "text": "And I think there's times that have made me figure out how to make that combat better."}, {"time": 3533, "text": "There's little markers or little points in time in your life that make you wonder, or I should say determined, to be able to get more out of yourself and to be able to take it to a new level."}, {"time": 3553, "text": "And I don't think people can actually feel that way unless you've actually had a lot of accomplishments in anything."}, {"time": 3560, "text": "I think there's anything out there."}, {"time": 3562, "text": "I mean, no matter what sport or breaking the four minute mile, I mean, when you broke that, when they broke that, Roger Bannister broke that four minute mile, I can't imagine him breaking it from his best time being 4.30."}, {"time": 3577, "text": "It's one of these things that along the line that he did had some close calls or he had some coaching that was giving him the opportunity to become a little better."}, {"time": 3590, "text": "But I think because he was doing well and being very successful, that the opportunity came."}, {"time": 3598, "text": "And so it's for me, it's like the same thing."}, {"time": 3600, "text": "I had so much success and so many practices that went well and so much goodness out of this sport that it gave me the opportunity to really look more finite and look more how I can even make it better."}, {"time": 3623, "text": "And so it's like, if you look at my library upstairs, I got a library upstairs and there's a lot of books up there from the family."}, {"time": 3635, "text": "But if you look at the Gable books up there, I got a lot of Russian technique books."}, {"time": 3642, "text": "I can't read the book, but I can see the diagrams and I can see the figures."}, {"time": 3652, "text": "They don't really show it in pictures."}, {"time": 3654, "text": "They do it in drawings."}, {"time": 3656, "text": "And so it was like when I was trying to beat the best that has labeled the best because they win the world championships every year since they've been just about involved."}, {"time": 3669, "text": "And I don't think they got started involved till like the fifties, but it's something, you study the best who's out there, but then you don't focus so much on the best that you can't beat the best."}, {"time": 3685, "text": "You learn from them, but there's something that they don't have that you can have."}, {"time": 3692, "text": "Toughness to technique, to the art, to the science."}, {"time": 3696, "text": "Yeah, all that stuff."}, {"time": 3697, "text": "And that's why I even talking to you and you're sitting over there and you love MIT and you're bragging about it over Harvard."}, {"time": 3705, "text": "Cause it's true."}, {"time": 3707, "text": "In your eyes and that's great."}, {"time": 3710, "text": "And it might be, but it's the same type of thing that there's something that you're probably stealing from Harvard, but you won't give them credit."}, {"time": 3721, "text": "Well, Dan, in the interest of time, I've read that you're pretty serious."}, {"time": 3727, "text": "You're pretty seriously into fishing."}, {"time": 3730, "text": "So what's the biggest fish you ever caught?"}, {"time": 3738, "text": "No, I don't think I've ever caught a big ocean fish."}, {"time": 3742, "text": "I'm not, I'm a river lake fisherman."}, {"time": 3744, "text": "I have fish in the... Trout?"}, {"time": 3746, "text": "No, probably Northern."}, {"time": 3750, "text": "I probably caught a Northern that weighed 20 some pounds."}, {"time": 3755, "text": "The fish I like to catch is walleyes."}, {"time": 3757, "text": "And the reason why I like to catch them cause they're really good eating fish."}, {"time": 3761, "text": "And the best eating fish are not the real big ones."}, {"time": 3767, "text": "I got people hunting deer right on my land and they're looking for the big bucks, but they're not the best eaters if you want to eat, but they're the best trophy."}, {"time": 3776, "text": "So I do have a couple of trophy walleyes on the wall, but most of the time I throw the big ones back and put them back in there."}, {"time": 3785, "text": "I don't know if you know there's a book by Hemingway called Old Man in the Sea."}, {"time": 3789, "text": "Heard of it."}, {"time": 3791, "text": "Ernest Hemingway?"}, {"time": 3792, "text": "Ernest Hemingway, yeah."}, {"time": 3793, "text": "And there's an old man that basically catches an 18 footer, but it can't pull it in, doesn't have the strength."}, {"time": 3800, "text": "So they together spend while the sharks eat away at it."}, {"time": 3804, "text": "I mean, this is very powerful story."}, {"time": 3806, "text": "I think one of the Nobel Prize, but he says, it's better to be lucky."}, {"time": 3810, "text": "The old man says, it's better to be lucky, but I would rather be exact that way when luck comes, you're ready."}, {"time": 3818, "text": "So let me ask, what do you think about luck?"}, {"time": 3823, "text": "Do you believe in free will that we have actions that control the direction, destination of our life, or does luck and some other outside forces really land you where you end up?"}, {"time": 3837, "text": "For me, I'm not about luck, but I do think luck is involved."}, {"time": 3844, "text": "But I think it's mostly created, just how lucky you are through preparations."}, {"time": 3851, "text": "And things have happened in my life forever, and a lot of good things."}, {"time": 3858, "text": "And a lot of people could say, hey, you've been pretty lucky to win all these awards."}, {"time": 3862, "text": "I don't know, if you analyze my life, I don't think it was involved with luck."}, {"time": 3869, "text": "I think it was more involved with preparation."}, {"time": 3872, "text": "And again, science, had you been smarter, had you understood that you could do some things and be just as lucky, that'd be great."}, {"time": 3882, "text": "But I'm only as smart as today."}, {"time": 3886, "text": "So when I was training in my life, and me even training people in my life, as of that moment, that's how lucky I am to be able to have whatever is available to me."}, {"time": 3900, "text": "And that's what, you call that a lot of science."}, {"time": 3901, "text": "So for me, I think that, like right now, if I look back, I do a lot of things different, just because things are proven differently."}, {"time": 3912, "text": "Like I'd give people water during practice, and I did."}, {"time": 3917, "text": "And I would let them change their wrestling shoes into running shoes to run sprints on the concrete."}, {"time": 3923, "text": "Or I would actually, maybe I've had a guy climb 12 ropes after practice, one after another."}, {"time": 3930, "text": "And then maybe the next day I'd do it again."}, {"time": 3932, "text": "Ah, I might not make him do it the next day."}, {"time": 3935, "text": "I might let him recover a little bit more."}, {"time": 3938, "text": "And you gotta learn, keep adding to your philosophy."}]}]