[{"title": "Sheldon Solomon: Death and Meaning | Lex Fridman Podcast #117", "id": "qfKyNxfyWbo", "quotes": [{"time": 338, "text": "Well, from our perspective, the uniquely human awareness of death and our unwillingness to accept that fact, we would argue, is the primary motivational impetus for almost everything that people do, whether they're aware of it or not."}, {"time": 359, "text": "So that's kind of been your life work."}, {"time": 359, "text": "Your view of the human condition is that death, you've written the book Warm at the Core, that death is at the core of our consciousness of everything, of how we see the world, of what drives us."}, {"time": 369, "text": "Maybe can you, can you elaborate how you see death fitting in?"}, {"time": 374, "text": "What does it mean to be at the core of our being?"}, {"time": 382, "text": "So I think that's a great question."}, {"time": 382, "text": "And, you know, to be pedantic, I usually start, you know, my psychology classes and I say to the students, okay, you know, let's define our terms."}, {"time": 395, "text": "And the ology part, they get right away."}, {"time": 395, "text": "You know, it's the study of, and then we get to the psyche part."}, {"time": 402, "text": "And understandably, you know, the students are like, oh, that means mind."}, {"time": 402, "text": "And I'm like, well, no, that's a modern interpretation."}, {"time": 409, "text": "But in ancient Greek, it means soul, but not in the Cartesian dualistic sense that most of us in the West think when that word comes to mind."}, {"time": 425, "text": "And so you hear the word soul and you're like, well, all right, that's the nonphysical part of me that's potentially detachable from my corporal container when I'm no longer here."}, {"time": 434, "text": "But Aristotle's who coined the word psyche, I think, he was not a dualist."}, {"time": 442, "text": "He was a monist."}, {"time": 442, "text": "He thought that the soul was inextricably connected to the body."}, {"time": 451, "text": "And he defined soul as the essence of a natural body that is alive."}, {"time": 460, "text": "And then he goes on and he says, all right, let me give you an example."}, {"time": 460, "text": "If an axe was alive, the soul of an axe would be to chop."}, {"time": 470, "text": "And if you can pluck your eyeball out of your head and it was still functioning, then the soul of the eyeball would be to see, you know, and then he's like, all right, the soul of a grasshopper is to hop."}, {"time": 487, "text": "The soul of a woodpecker is to pack, which raises the question, of course, what is the essence of what it means to be human?"}, {"time": 500, "text": "And here, of course, there is no one universally accepted conception of the essence of our humanity."}, {"time": 509, "text": "All right, Aristotle, you know, gives us the idea of humans as rational animals."}, {"time": 509, "text": "You know, we're homo sapiens."}, {"time": 514, "text": "But not the only game in town got Joseph Heusinger, an anthropologist in the 20th century."}, {"time": 522, "text": "He called us homo ludens that were basically fundamentally playful creatures."}, {"time": 522, "text": "And I think it was Hannah Arendt, homo faber, were tool making creatures."}, {"time": 530, "text": "Another woman, Ellen Dizanayake, wrote a book called Homo Aestheticus."}, {"time": 537, "text": "And following Aristotle and his poetics, she's like, well, we're not only rational animals, we're also aesthetic creatures that appreciate beauty."}, {"time": 548, "text": "There's another take on humans."}, {"time": 548, "text": "I think they call us homo narratans."}, {"time": 556, "text": "We're storytelling creatures."}, {"time": 556, "text": "And I think all of those designations of what it means to be human are quite useful heuristically and certainly worthy of our collective cogitation."}, {"time": 564, "text": "But what garnered my attention when I was a young punk was just a single line in an essay by a Scottish guy, who was Alexander Smith, in a book called Dreamthwarp."}, {"time": 579, "text": "I think it's written in the 1860s."}, {"time": 587, "text": "He just says right in the middle of an essay, it is our knowledge that we have to die that makes us human."}, {"time": 593, "text": "And I remember reading that."}, {"time": 593, "text": "And in my gut, I was like, oh, man, I don't like that."}, {"time": 593, "text": "But I think you're onto something."}, {"time": 601, "text": "And then William James, the great Harvard philosopher and arguably the first academic psychologist, he referred to death as the worm at the core of the human condition."}, {"time": 616, "text": "So that's where the worm at the core idea comes in."}, {"time": 616, "text": "And that's just an allusion to the story of Genesis back in the proverbial old days in the Garden of Eden."}, {"time": 624, "text": "Everything was going tremendously well until the serpent tempts Eve to take a chop out of the apple of the tree of knowledge, and Adam partakes also."}, {"time": 639, "text": "And this is, according to the Bible, what brings death into the world."}, {"time": 647, "text": "And from our vantage point, the story of Genesis is a remarkable allegorical recount of the origin of consciousness, where we get to the point where, by virtue of our vast intelligence, we come to realize the inevitability of death."}, {"time": 665, "text": "And so, you know, the apple is beautiful and it's tasty."}, {"time": 672, "text": "But when you get right into the middle of it, there's that ugly reality, which is our finitude."}, {"time": 679, "text": "And then fast forward a bit, and I was a young professor at Skidmore College in 1980."}, {"time": 688, "text": "My PhD is in experimental social psychology, and I mainly did studies for the study of the world."}, {"time": 694, "text": "I mainly did studies with clinical psychologists evaluating the efficacy of nonpharmacological interventions to reduce stress."}, {"time": 701, "text": "And that was good work, and I found it interesting."}, {"time": 707, "text": "But in my first week as a professor at Skidmore, I'm just walking up and down the shelves of the library, saw some books by a guy I had never heard of, Ernest Becker, a cultural scientist, recently deceased."}, {"time": 721, "text": "He died in 1974."}, {"time": 721, "text": "After weeks before, actually, he was posthumously awarded the Pulitzer Prize in Nonfiction for his book, The Denial of Death."}, {"time": 737, "text": "And that was his last book?"}, {"time": 739, "text": "It's actually his next to last book."}, {"time": 739, "text": "I don't know how you pull this off, but he had one more after he died called Escape from Evil."}, {"time": 744, "text": "And evidently, it was supposed to..."}, {"time": 744, "text": "Originally, The Denial of Death was supposed to be this giant thousand page book that was both, and they split it up, and what became Escape from Evil, his wife, Marie Becker, finished."}, {"time": 765, "text": "Well, be that as it may, it is in The Denial of Death where Becker just says in the first paragraph, I believe that the terror of death and the way that human beings respond to it or decline to respond to it is primarily responsible for almost everything we do, whether we're aware of it or not, and mostly we're not."}, {"time": 790, "text": "And so I read that first paragraph, Lex, and I was like, wow, okay, this dude's... You're onto something."}, {"time": 801, "text": "You're onto something."}, {"time": 802, "text": "It's the same thing here."}, {"time": 803, "text": "It's the same thing."}, {"time": 803, "text": "And then it reminded me, I think, not to play psychologist, but let's face it, I believe there's a reason why we end up drifting where we ultimately come to."}, {"time": 811, "text": "So I'm in my mid 20s."}, {"time": 820, "text": "I got Ernest Becker's book in my hand."}, {"time": 820, "text": "And the next thing I know, I'm remembering that when I'm eight years old, the day that my grandmother died."}, {"time": 827, "text": "And the day before, my mom said, oh, say goodbye to grandma."}, {"time": 835, "text": "She's not well."}, {"time": 835, "text": "And so I was like, okay, grandma."}, {"time": 835, "text": "And I knew she wasn't well, but I didn't really appreciate the magnitude of her illness."}, {"time": 844, "text": "Well, she dies the next day."}, {"time": 850, "text": "And it's in the evening and I'm just sitting there looking at my stamp collection."}, {"time": 850, "text": "And I'm like, wow, I'm going to miss my grandmother."}, {"time": 857, "text": "And then I'm like, no, wait a minute."}, {"time": 857, "text": "That means my mother's going to die after she gets old."}, {"time": 862, "text": "And that's even worse."}, {"time": 862, "text": "After all, who's going to make me dinner?"}, {"time": 869, "text": "And that bothered me for a while."}, {"time": 869, "text": "But then I'm looking at the stamps, all the dead American presidents."}, {"time": 874, "text": "And I'm like, there's George Washington."}, {"time": 874, "text": "There's Thomas Jefferson."}, {"time": 879, "text": "My mom's going to be dead."}, {"time": 879, "text": "Oh, I'm going to get old and be dead someday."}, {"time": 879, "text": "And at eight years old, that was my first explicit existential crisis."}, {"time": 888, "text": "I remember it being, you know, one of these blood curdling realizations that I tried my best to ignore for the most of the time I was subsequently growing up."}, {"time": 903, "text": "But fast forward back to Skidmore College, mid twenties, you know, reading Becker's book in the 1980s, thinking to myself, wow, one of the reasons why I'm finding this so compelling is that it squares with my own personal experience."}, {"time": 923, "text": "And then to make a short story long, and I'll shut up, Lex, but what grabbed me about Becker, and this is in part because I read a lot of his other books, there's another book, The Birth and Death of Meaning, which is framed in from an evolutionary perspective."}, {"time": 937, "text": "And then The Denial of Death is really more framed from an existential psychodynamic vantage point."}, {"time": 945, "text": "And as a young academic, I was really taken by what I found to be a very potent juxtaposition that you really don't see that often."}, {"time": 966, "text": "Yet usually evolutionary types are eager to dismiss the psychodynamic types and vice versa."}, {"time": 974, "text": "And maybe only John Bowlby, you know, there's there's other folks."}, {"time": 974, "text": "But the attachment theorist, John Bowlby, was really one of the first serious academics to say these these ways of thinking about things are quite compatible."}, {"time": 993, "text": "And can you comment on what's what a psychodynamics view of the world is versus an evolutionary view of the world, just in case people are not?"}, {"time": 1000, "text": "Oh, yeah, absolutely."}, {"time": 1000, "text": "That's that's a fine question."}, {"time": 1000, "text": "Well, for the evolutionary types in general are interested in how it is and why it is that we have adapted to our surroundings in the service of persisting over time and being represented in the gene pool thereafter."}, {"time": 1026, "text": "You used to be a fish."}, {"time": 1026, "text": "Yeah, we used to be a fish."}, {"time": 1026, "text": "And I'll end up talking on a podcast."}, {"time": 1033, "text": "How we came to be that way."}, {"time": 1036, "text": "And so whereas the existential psychodynamic types, I would say, are more interested in development across a single lifespan."}, {"time": 1042, "text": "And but but the evolutionary types dismiss the psychodynamic types as overly speculative and devoid of empirical support for their views."}, {"time": 1058, "text": "They, you know, they'll just say these guys are talking shit, if you'll pardon the expression."}, {"time": 1064, "text": "And of course, you can turn right around and say the same about the evolutionary types that they are often and rightfully criticized evolutionary psychologists for what are called the just so stories that where it's like, oh, this is probably why fill in the blank is potentially adaptive."}, {"time": 1087, "text": "And my thought again early on was I didn't see any intrinsic antithesis between these viewpoints."}, {"time": 1100, "text": "I just found them dialectically compatible and very powerful when combined."}, {"time": 1107, "text": "So one question I would ask here is about a science being speculative."}, {"time": 1107, "text": "You know, we understand a little about the human mind."}, {"time": 1113, "text": "You said you picked up Becker's book and, you know, it felt like it was onto something."}, {"time": 1118, "text": "That's the same thing I felt when I picked up Becker's book, probably also in my early 20s."}, {"time": 1125, "text": "You know, I read a lot of philosophy, but it felt like the question of the meaning of life kind of, you know, this seemed to be the most the closest to the truth somehow."}, {"time": 1138, "text": "It was onto something."}, {"time": 1138, "text": "So I guess the question I want to ask also is like how speculative is psychology?"}, {"time": 1146, "text": "How like all of your life's work?"}, {"time": 1146, "text": "How confident do you feel about the whole thing?"}, {"time": 1154, "text": "About understanding our mind?"}, {"time": 1154, "text": "I feel confidently unconfident to have both ways."}, {"time": 1165, "text": "Like what do we make of psychology?"}, {"time": 1165, "text": "What do we make starting with Freud, you know, starting just our, or even just philosophy, even the aspects of the sciences, like, you know, my field of artificial intelligence, but also physics, you know, it often feels like, man, we don't really understand most of what's going on here."}, {"time": 1187, "text": "And certainly that's true with the human mind."}, {"time": 1193, "text": "Well, to me, that's the proper epistemological stance."}, {"time": 1193, "text": "I don't know anything."}, {"time": 1199, "text": "Well, it's the Socratic I know that I don't know, which is the first step on the path to wisdom."}, {"time": 1208, "text": "I would argue forcefully that we know a lot more than we used to."}, {"time": 1208, "text": "I would argue equally forcefully, but not that I have a PhD in the philosophy of science, but I believe that the Thomas Kuhns of the world are right when they point out that change is not necessarily progress."}, {"time": 1234, "text": "And so on the one hand, I do think we know a lot more than we did back in the day when if you wanted to fly, you put on some wax wings and jumped off a mountain."}, {"time": 1242, "text": "On the other hand, I think it's quite arrogant when scientists, I'll just speak about psychological scientists, when they have the audacity to mistake statistical precision for knowledge and insight."}, {"time": 1259, "text": "And when they make the mistake, in my estimation, that Einstein bemoaned, and that's this idea that the mere accumulation of data will necessarily result in conceptual breakthroughs."}, {"time": 1279, "text": "And so I like the, well, we're all, I hope, appreciative of the people who trained us."}, {"time": 1289, "text": "But I remember my first day in graduate school at the University of Kansas, they brought us into a room and on one side of the board was a quote by Kurt Lewin or Levine, famous German social psychologist."}, {"time": 1300, "text": "And the quote is, there's nothing more useful than a good theory."}, {"time": 1308, "text": "And then on the other side was another quote by a German physicist, his name eludes me, and it was all theories are wrong."}, {"time": 1313, "text": "And I'm like, which is it?"}, {"time": 1320, "text": "And of course, the point is that it's both."}, {"time": 1320, "text": "Our theories are, I believe, powerful ways to direct our attention to aspects of human affairs that might render us better able to understand ourselves in the world around us."}, {"time": 1341, "text": "Now, I also, as an experimental psychologist, I adhere to the view that theories are essentially hypothesis generating devices."}, {"time": 1358, "text": "And that at its best, science is a dialectical interplay where you have theoretical assertions that yield testable hypotheses and that either results in the corroboration of the theory, the rejection of it or the modification thereafter."}, {"time": 1372, "text": "If we look at the existentialists or even like modern philosopher, psychologist types like Jordan Peterson, I'm not sure if you're familiar with Jordan pretty well."}, {"time": 1387, "text": "We go way back."}, {"time": 1387, "text": "Actually, if he were here with us today, we would he would be jumping in and I believe very interesting and important ways."}, {"time": 1394, "text": "But yeah, we go back 30 years ago."}, {"time": 1402, "text": "He was basically saying our work is nonsense."}, {"time": 1402, "text": "Let's get into this."}, {"time": 1402, "text": "I'll talk to Jordan eventually on this thing."}, {"time": 1410, "text": "Yeah, there's some rough times right now."}, {"time": 1415, "text": "And I and I wish him well."}, {"time": 1415, "text": "Jordan was working on his maps of meaning and we were publishing our work."}, {"time": 1424, "text": "And I think Jordan at the time was concerned about our vague claims to the effect that all meaning is arbitrary."}, {"time": 1436, "text": "He takes a more Jungian as well as evolutionary view that I don't think is wrong, by the way, which is that there are certain kinds of meanings that are more important, let's say religious types, and that we didn't pay sufficient attention to that in our early days."}, {"time": 1465, "text": "So can you try to elucidate like what his worldview is?"}, {"time": 1465, "text": "Because he's also a religious man."}, {"time": 1471, "text": "And so what what was this?"}, {"time": 1471, "text": "What was some of the interesting aspects of the disagreements that then?"}, {"time": 1477, "text": "Yeah, well, back in the day, I just said, you know, Jordan was a young punk."}, {"time": 1477, "text": "We were young punks."}, {"time": 1482, "text": "He was just kind of flailing in an animated way at some conferences saying that we you're still both kind of punks."}, {"time": 1489, "text": "Yeah, we are kind of punk."}, {"time": 1489, "text": "So I saw him three or four years ago."}, {"time": 1493, "text": "We spoke on a it was an awesome day."}, {"time": 1493, "text": "We're in Canada at the Ontario Shakespeare Festival, where we were asked to be on a Canadian broadcast system program."}, {"time": 1500, "text": "I think we were talking about Macbeth from a psychodynamic perspective."}, {"time": 1506, "text": "And I hadn't seen him in a ton of years."}, {"time": 1506, "text": "And we spent two days together, had a great time."}, {"time": 1514, "text": "You know, we had just written our book, The Worm at the Core."}, {"time": 1520, "text": "And he's like, you know, you're you're missing a big opportunity."}, {"time": 1520, "text": "Every time you say something, you have to have your phone and you have to film yourself and then you have to put it on YouTube."}, {"time": 1532, "text": "Yeah, he was onto something that, you know, that just as a small tangent."}, {"time": 1532, "text": "It's it's almost sad to look at Jordan Peterson and somebody like yourself."}, {"time": 1540, "text": "After having done this podcast, I've realized that there is really brilliant people in this world."}, {"time": 1544, "text": "And oftentimes, especially like when they're, I mean, it would love are a little bit like punks."}, {"time": 1551, "text": "They kind of do their own thing and make the world doesn't know they exist as much as they should."}, {"time": 1558, "text": "And it's so interesting because most people are kind of boring."}, {"time": 1563, "text": "And then the interesting ones kind of go on their own."}, {"time": 1571, "text": "And there's not a smartphone."}, {"time": 1571, "text": "No, that's that's so interesting."}, {"time": 1571, "text": "He was onto something that I mean, it's interesting that I don't think he was thinking from a money perspective, but he was probably thinking of like connecting with people or sharing his knowledge."}, {"time": 1587, "text": "But people don't often think that way."}, {"time": 1587, "text": "So maybe we can try to get back to you're both brilliant people."}, {"time": 1593, "text": "And I'd love to get some interesting disagreements earlier and later about in your psychological work and your world views."}, {"time": 1599, "text": "Well, our disagreements today would be along two dimensions."}, {"time": 1610, "text": "One is he is and again, I wish he was here to correct me."}, {"time": 1610, "text": "When I say that he is more committed to the virtues of the Judeo Christian tradition, I see particularly Christianity and in a sense is a contemporary Kierkegaard of sorts when he's saying there's only one way to leap into faith."}, {"time": 1637, "text": "And I would take ardent issue with that claim on the grounds that that is one, but by no means not the only way to find meaning and value in life."}, {"time": 1646, "text": "And so and I see his."}, {"time": 1657, "text": "What's his warm at the core?"}, {"time": 1657, "text": "What is like?"}, {"time": 1657, "text": "So we're talking about a little bit of a higher level of discovering meaning."}, {"time": 1663, "text": "What's his?"}, {"time": 1663, "text": "What does he make of death?"}, {"time": 1663, "text": "Oh, I don't know."}, {"time": 1669, "text": "And this is where it would be nice to have him here."}, {"time": 1669, "text": "He has, you know, from a distance criticized our work as misguided."}, {"time": 1679, "text": "Having said that, though, when we were together, he said something along the lines that there is no theoretical body of work in academic psychology right now for which there is more empirical evidence."}, {"time": 1695, "text": "And so I appreciated that."}, {"time": 1695, "text": "He's a great researcher."}, {"time": 1695, "text": "He's a good clinician."}, {"time": 1702, "text": "The other thing that we will agree to disagree about rather vociferously is his ultimately political slash economic."}, {"time": 1710, "text": "So I remember being at dinner with him, telling him that the next book that I wanted to write was going to be called Why Left and Right are Both Beside the Point."}, {"time": 1724, "text": "And my argument was going to be and it is going to be that both liberal and political liberal and conservative political philosophy are each intellectually and morally bankrupt because they're both framed in terms of assumptions about human nature that are demonstrably false."}, {"time": 1745, "text": "And Jordan didn't mind me knocking liberal political philosophy on those grounds."}, {"time": 1754, "text": "That would basically be like Steven Pinker's blank slate."}, {"time": 1754, "text": "But he took issue when I pointed out that actually it's conservative political philosophy, which starts with John Locke's assumption that in a state of nature, there are no societies, just autonomous individuals who are striving for survival."}, {"time": 1776, "text": "That's one of the most obviously patently wrong assertions in the history of intellectual thought."}, {"time": 1785, "text": "And Locke uses that to justify his claims about the individual right to acquire unlimited amounts of property, which is ultimately the justification for neoliberal economics."}, {"time": 1803, "text": "Can you linger on that a little bit?"}, {"time": 1803, "text": "Can you describe his philosophy again as view of the world and what neoliberal economics is?"}, {"time": 1811, "text": "Yeah, let me translate it in English."}, {"time": 1819, "text": "So basically on all these days, anybody who says I'm a conservative free market type, you're following John Locke and Adam Smith, whether you're aware of it or not."}, {"time": 1830, "text": "So here's John Locke, who, by the way, all of these guys are great."}, {"time": 1835, "text": "So for me to appear to criticize any of these folks, it is with the highest regard."}, {"time": 1842, "text": "And also, we need to understand in my estimation how important their ideas are."}, {"time": 1849, "text": "Locke is working in a time where all rule was top down by divine right."}, {"time": 1857, "text": "And he's trying desperately to come up with a philosophical justification to shift power and autonomy to individuals."}, {"time": 1866, "text": "And he starts in his second treatise on government, 1690 or so, he says, okay, let's start with a state of nature."}, {"time": 1876, "text": "And he's like, in a state of nature, there's no societies, there's just individuals."}, {"time": 1882, "text": "And in a perfect universe, there wouldn't be any societies, there would just be individuals who by the law of nature have a right to survive."}, {"time": 1897, "text": "And in the service of survival, they have the right to acquire and preserve the fruits of their own labor."}, {"time": 1908, "text": "But his point is, and it's actually a good one, he's following Hobbes here."}, {"time": 1916, "text": "He's like, well, the problem with that is that people are assholes."}, {"time": 1916, "text": "And if they would let each other alone, then we would still be living in a state of nature, everybody just doing what they did to get by each day."}, {"time": 1928, "text": "But it's a whole lot easier if I see like an apple tree a mile away."}, {"time": 1936, "text": "Well, I can go over and pick an apple."}, {"time": 1936, "text": "But if you're 10 meters away with an apple in your hand, it's a lot easier if I pick up a rock and crack your head and take the apple."}, {"time": 1949, "text": "And his point was that the problem is that people can't be counted on to behave."}, {"time": 1949, "text": "They will take each other's property."}, {"time": 1958, "text": "Moreover, he argued, if someone takes your property, you have the right to retribution in proportion to the degree of the magnitude of the transgression."}, {"time": 1972, "text": "English translation, if I take your apple, you have the right to take an apple back."}, {"time": 1977, "text": "You don't have the right to kill my firstborn."}, {"time": 1984, "text": "But people being people, they're apt to escalate retaliatory behavior, thus creating what Locke called a state of war."}, {"time": 1993, "text": "So he said, in order to avoid a state of war, people reluctantly give up their freedom in exchange for security."}, {"time": 2000, "text": "They agree to obey the law and that the sole function of government is to keep domestic tranquility and to ward off foreign invasion in order to protect our right to property."}, {"time": 2014, "text": "So now here's the property thing."}, {"time": 2014, "text": "So Locke says, if you look in the Bible and in nature, there is no private property."}, {"time": 2028, "text": "But Locke says, well, surely if there's anything that you own, it's your body."}, {"time": 2028, "text": "And surely you have a right by nature to stay alive."}, {"time": 2038, "text": "And then by extension, anything that you do where you exert effort or labor, that becomes your private property."}, {"time": 2047, "text": "So back to the apple tree."}, {"time": 2047, "text": "If I walk over to an apple tree, that's everybody's apples until I pick one."}, {"time": 2054, "text": "And the minute I do, that is my apple."}, {"time": 2061, "text": "And then he says, you can have as many apples as you want, as long as you don't waste them."}, {"time": 2070, "text": "And as long as you don't impinge on somebody else's right to get apples."}, {"time": 2079, "text": "And then he says, well, okay."}, {"time": 2079, "text": "In the early days, you could only eat so many apples or you could only trade so many apples with somebody else."}, {"time": 2095, "text": "So he was like, well, if you put a fence around a bunch of apple trees, those become your apples."}, {"time": 2101, "text": "That's your property."}, {"time": 2107, "text": "Those become your apples."}, {"time": 2107, "text": "If somebody else wants to put a fence around Nebraska, that's their property."}, {"time": 2113, "text": "And everybody can have as much property as they want because the world is so big that there is no limit to what you can have if you pursue it by virtue of your own effort."}, {"time": 2133, "text": "But then he says money came into the picture."}, {"time": 2133, "text": "And this is important because he noticed long before anybody, before the Freud's of the world, that money is funky because it has no intrinsic value."}, {"time": 2148, "text": "He's like, ooh, look at that shiny piece of metal that actually has, if you're hungry and you have a choice between a carrot and a lump of gold in the desert, most people are going to go for the carrot."}, {"time": 2160, "text": "But his point is that the allure of money is that it's basically a concentrated symbol of wealth, but because it doesn't spoil, Locke said, you're entitled to have as much money as you're able to garner."}, {"time": 2178, "text": "Then he says, well, the reality is that some people are more, the word that he used was industrious."}, {"time": 2189, "text": "He said some people more industrious than others."}, {"time": 2196, "text": "All right, today we would say smarter, less lazy, more ambitious."}, {"time": 2196, "text": "He just said that's natural."}, {"time": 2196, "text": "It's also true."}, {"time": 2203, "text": "Therefore, he argued, over time, some people are going to have a whole lot of property and other people not much at all."}, {"time": 2212, "text": "Inequality for Locke is natural and beneficial for everyone."}, {"time": 2224, "text": "His argument was that the rising tide lifts all boats and that the truly creative and innovative are entitled to relatively unlimited worth because we're all better off as a result."}, {"time": 2239, "text": "So the point very simply is that, and then you have Adam Smith in the next century with the invisible hand where Adam Smith says, everyone pursuing their own selfish, that's not necessarily pejorative, if everyone pursues their own selfish interests, we will all be better off as a result."}, {"time": 2264, "text": "And what do you think is the flaw in that way of thinking?"}, {"time": 2267, "text": "Well, there's two flaws."}, {"time": 2267, "text": "One flaw is, first of all, that it is based on an erroneous assumption to begin with, which is that there never was a time in human history when we were an asocial species."}, {"time": 2285, "text": "In a sense, you don't feel like there's this emphasis of individual autonomy is a flawed promise."}, {"time": 2292, "text": "There's something fundamentally deeply interconnected between us."}, {"time": 2298, "text": "I think that Plato and Socrates in the Crito were closer to the truth when they started with the assumption that we were interdependent, then they derived individual autonomy as a manifestation of a functional social system."}, {"time": 2318, "text": "So when Margaret Thatcher, you're too young, in the 1980s, she said, societies?"}, {"time": 2318, "text": "There's no such thing as societies."}, {"time": 2324, "text": "There's just individuals pursuing their self interest."}, {"time": 2333, "text": "So that's one point where I would take issue respectfully with John Locke."}, {"time": 2337, "text": "Point number two is when Locke says in 1690, well, England's filled up, so if you want some land, just go to America, it's empty."}, {"time": 2346, "text": "Or maybe there's a few savages there, just kill them."}, {"time": 2353, "text": "So Melville does the same thing in Moby Dick where he thinks about, will there ever come a time where we run out of whales?"}, {"time": 2360, "text": "And he says, no, but we have run out of whales."}, {"time": 2366, "text": "And so Locke was right maybe in 1690 that the world was large and had infinite resources."}, {"time": 2376, "text": "He's certainly wrong today, in my opinion."}, {"time": 2376, "text": "Also wrong is the claim that the unlimited pursuit of personal wealth does not harm those around us."}, {"time": 2387, "text": "There is no doubt that radical inequality is tragic psychologically and physically."}, {"time": 2394, "text": "Poverty is not that terrible."}, {"time": 2402, "text": "It's easy for me to say because I have a place to stay and something to eat."}, {"time": 2402, "text": "But as long as you're not starving and have a place to be, poverty is not as challenging as having the impoverished in close proximity to those who are obscenely wealthy."}, {"time": 2420, "text": "LW So it's not the absolute measure of your well being, it's the inequality of that well being is the penalty painful."}, {"time": 2429, "text": "So maybe just to linger on the Jordan Peterson thing, in terms of your disagreement in his world view."}, {"time": 2437, "text": "So he went through quite a bit, there's been quite a bit of fire in his defense or maybe his opposition of the idea of equality of outcomes."}, {"time": 2445, "text": "So looking at the inequality that's in our world, looking at, you know, certain groups, measurably having an outcome that's different than other groups, and then drawing conclusions about fundamental unfairness, injustice, inequality in the system."}, {"time": 2466, "text": "So like systematic racism, systematic sexism, systematic anything else that creates inequality."}, {"time": 2473, "text": "And he's been kind of saying pretty simple things to say that, you know, the system for the most part is not broken or flawed, that the inequalities part, the inequality of outcomes is part of our world."}, {"time": 2488, "text": "What we should strive for is the, you know, equality of opportunity."}, {"time": 2499, "text": "Yeah, and I do not dispute that as an abstraction."}, {"time": 2499, "text": "But again, to back up for a second, I do take issue with Jordan's fervent devotion to the free market and his cavalier dismissal of Marxist ideas, which he has, in my estimation, mischaracterized in his public depictions."}, {"time": 2526, "text": "So he just seems to really not like socialism, Marxism, communism."}, {"time": 2533, "text": "Historically speaking, sort of, I mean, how would I characterize it?"}, {"time": 2533, "text": "I'm not exactly sure."}, {"time": 2539, "text": "I don't want to, again, he'll eventually be here to defend himself."}, {"time": 2539, "text": "John Locke, unfortunately, not here to defend himself."}, {"time": 2544, "text": "But what's your sense about Marxism and the way Jordan talks about it, the way you think about it, from the economics, from the philosophical perspective?"}, {"time": 2559, "text": "Yeah, well, if we were all here together, I'd say we need to start with Marx's economic and philosophical manuscripts of 1844, before Marx became more of a polemicist."}, {"time": 2565, "text": "And I would argue that Marx's political philosophy, he's a crappy economist, I don't dispute that."}, {"time": 2574, "text": "But his arguments about human nature, his arguments about the inevitably catastrophic psychological and environmental and economic effects of capitalism, I would argue every one of those has proven quite right."}, {"time": 2597, "text": "Marx maybe did not have the answer, but he saw in the 18, whenever he was writing, that inevitably, capitalism would lead to massive inequity, that it was ultimately based on the need to denigrate and dehumanize labor, to render them, in his language, a fleshy cog in a giant machine."}, {"time": 2629, "text": "And it would create a tension and conflict between those who own things and those who made things, that over time would always, the Thomas Pickardy guy who writes about capital, and just makes the point that return on investment will always be greater than wages."}, {"time": 2647, "text": "That means the people with money are gonna have a lot more."}, {"time": 2657, "text": "That means there's gonna come a point where the economic house of cards falls apart."}, {"time": 2663, "text": "Now, the Joseph Schumpeters of the world, they're like, that's creative destruction, bring it, that's great."}, {"time": 2669, "text": "So I think it's Niles Ferguson, he's a historian, he may be at Stanford now, he was at Harvard."}, {"time": 2675, "text": "He writes about the history of money, and he's like, yeah, there's been 20 or whatever depressions and big recessions in the last several hundred years."}, {"time": 2688, "text": "And when that happens, half of the population or whatever is catastrophically inconvenienced."}, {"time": 2696, "text": "But that's the price that we pay for progress."}, {"time": 2696, "text": "Other people would argue, and I would agree with them that I will happily sacrifice the rate of progress in order to flatten the curve of economic destruction."}, {"time": 2716, "text": "To put that in plainer English, I would direct our attention to the social democracies that forgetting for the moment of whether it's possible to do this on a scale in a country as big as ours, on all of the things that really matter, gross, domestic GDP or whatever, that's just an abstraction."}, {"time": 2744, "text": "But when you look at whatever the United Nations says, how we measure quality of life, life expectancy, education, rates of alcoholism, suicide, and so on, the countries that do better are the mixed economies."}, {"time": 2760, "text": "They're market economies that have high tax rates in exchange for the provision of services that come as a right for citizens."}, {"time": 2776, "text": "Yeah, so I mean, I guess the question is, you've kind of mentioned that, you know, as Marx described, capitalism with a slippery slope, eventually things go awry in some kind of way."}, {"time": 2790, "text": "So that's the question is, when you have, when you implement a system, how does it go wrong eventually?"}, {"time": 2795, "text": "You know, eventually we'll all be dead."}, {"time": 2803, "text": "So, and then the criticism, I mean, I think these days, unfortunately, Marxism is a dirty word."}, {"time": 2810, "text": "I say unfortunately, because even if you disagree with a philosophy, you should, like calling somebody a Marxist should not be a thing that shuts down all conversation."}, {"time": 2825, "text": "And the fact is, I'm sympathetic with Jordan's dismissal of the folks, the talking heads these days who spew Marxist words."}, {"time": 2833, "text": "To me, it's like fashionable nonsense."}, {"time": 2833, "text": "Do you know that book that the physicists wrote mocking?"}, {"time": 2842, "text": "So in the 20 or so years, we're all pretty young."}, {"time": 2848, "text": "Well, yeah, that's right."}, {"time": 2848, "text": "But I think there were these NYU physicists, they wrote a paper just mocking the kind of literary postmodern types."}, {"time": 2853, "text": "And it was, oh, those kinds of, yeah, it was just nonsense."}, {"time": 2861, "text": "And of course it was made the lead article."}, {"time": 2861, "text": "And you know, my point is Marx wouldn't be a Marxist."}, {"time": 2868, "text": "I have read and listened to some of the work of Richard Wolff."}, {"time": 2868, "text": "He speaks pretty eloquently about Marxism."}, {"time": 2876, "text": "I like him."}, {"time": 2876, "text": "He's one of the only, you know, one of the only people speaking about a lot about Marxism and the way we are now in a serious way, in a sort of saying, you know, what are the flaws of capitalism?"}, {"time": 2890, "text": "Not saying like, yeah, basically sounding very different."}, {"time": 2896, "text": "People should check out his work."}, {"time": 2896, "text": "Because all this kind of work, this kind of outrage mob culture of sort of demanding equality of outcome, that's not Marxism."}, {"time": 2910, "text": "It is not Marxism."}, {"time": 2910, "text": "You know, he literally said each, what was it like, each according to their needs and each according to their abilities or something like that."}, {"time": 2922, "text": "So the question is the implementation, like, humans are messy."}, {"time": 2922, "text": "So how does it go wrong?"}, {"time": 2927, "text": "Like, it is, there you go, Lex."}, {"time": 2927, "text": "It's messy."}, {"time": 2927, "text": "And this gets back to my rant about the book that I want to try if I don't stroke out, why left and right are both beside the point."}, {"time": 2941, "text": "You know, the people, the conservatives are right when they condemn liberals for being simple minded."}, {"time": 2951, "text": "By assuming that a modification of external conditions will yield changes in human nature."}, {"time": 2960, "text": "You know, again, that's where Marx and Skinner are odd bedfellows."}, {"time": 2960, "text": "You know, here they are just saying, oh, let's change the surroundings and things will inevitably get better."}, {"time": 2967, "text": "On the other hand, when conservatives say that people are innately selfish and they use that as the justification for glorifying the unbridled pursuit of wealth, well, they're only half right because it turns out that we can be innately selfish, but we are also innately generous and reciprocating creatures."}, {"time": 3002, "text": "There's remarkable studies, I think they've been done at Yale, of, you know, babies, 14 month old babies."}, {"time": 3008, "text": "If someone hands them a toy and then wants something in return, babies before they can walk and talk will reciprocate."}, {"time": 3019, "text": "All right, fine."}, {"time": 3023, "text": "If someone, if they want a toy, let's say, or a bottle of water, baby wants a bottle of water, and I look like I'm trying to give it to the baby, but I drop the bottle so the baby doesn't get what she or he wanted."}, {"time": 3039, "text": "When given a chance to reciprocate, little babies will reciprocate because they're aware of and are responding to intention."}, {"time": 3047, "text": "Similarly, if they see somebody behaving unfairly to someone, they will not help that person in return."}, {"time": 3055, "text": "So my point is, yeah, we are selfish creatures at times, but we are also simultaneously ubersocial creatures who are eager to reciprocate, and in fact, we're congenitally prepared to be reciprocators to the point where we will reciprocate on the basis of intentions above and beyond what actually happens."}, {"time": 3088, "text": "How close, so, I mean, your work is on the fundamental role of the fear of mortality in ourselves."}, {"time": 3097, "text": "How fundamental is this reciprocation, this human connection to other humans?"}, {"time": 3104, "text": "Oh, I think it's really innate."}, {"time": 3104, "text": "Yeah, I think it's because, yeah, bats reciprocate, not by intention, but, you know, this, I'm going here from Richard Dawkins, The Selfish Gene, you know, to, I love the early Dawkins, I'm less enamored."}, {"time": 3118, "text": "I like the early Beatles."}, {"time": 3122, "text": "Yeah, no, no, no."}, {"time": 3122, "text": "And again, I say this with great respect, but, you know, Dawkins just points out that, you know, reciprocation is just fundamental, cooperation is fundamental."}, {"time": 3133, "text": "You know, it's a one sided view of evolutionary takes on things when we see it solely in terms of individual competition."}, {"time": 3150, "text": "It's almost, from a game theoretic perspective too, it's just easier to see the world that way."}, {"time": 3156, "text": "It's easier to, I don't know, I mean, you see this in physics, there's a whole field of folks, like complexity, that kind of embrace the fact that it's all an intricately connected mess, and it's just very difficult to do anything with that kind of science."}, {"time": 3170, "text": "But it seems to be much closer to actually representing what the world is like."}, {"time": 3178, "text": "So like you put it earlier, Lex, it's messy."}, {"time": 3182, "text": "So left and right, you mentioned, you're thinking of maybe actually putting it down on paper or something?"}, {"time": 3187, "text": "Yeah, I would like to, because what I would like to point out, again, in admiration of all the people that I will then try and have the gall to criticize is, look, these are all geniuses."}, {"time": 3199, "text": "Locke, genius."}, {"time": 3199, "text": "Adam Smith, genius, when he uses the notion that we're bartering creatures."}, {"time": 3199, "text": "So he uses that reciprocation idea as the basis of his way of thinking about things."}, {"time": 3213, "text": "But that's not at the core."}, {"time": 3213, "text": "The bartering is not at the core of human nature."}, {"time": 3217, "text": "It's not at, well, he says it is."}, {"time": 3217, "text": "He says we're fundamentally bartering creatures."}, {"time": 3222, "text": "Well, that doesn't even make sense then, because then how can we then be autonomous individuals autonomous individuals?"}, {"time": 3230, "text": "Well, because we're going to barter with an eye on for ourselves, self interest."}, {"time": 3235, "text": "But all right."}, {"time": 3235, "text": "So, but back to Adam Smith for a second, Lex."}, {"time": 3235, "text": "He's like, Adam Smith, here's, he's got the invisible hand and my conservative friends."}, {"time": 3240, "text": "I'm like, you need to read his books because he is a big fan of the free market."}, {"time": 3245, "text": "And this is my other gripe with folks who support just unbridled markets."}, {"time": 3255, "text": "Adam Smith understood that there was a role for government for two reasons."}, {"time": 3263, "text": "One is, is that just like Locke, people are not going to behave with integrity."}, {"time": 3270, "text": "And he understood that one role of government is to maintain a proverbial, you know, even playing field."}, {"time": 3278, "text": "And then the other thing Smith said was that there's some things that can't be done well for a profit."}, {"time": 3284, "text": "And I believe he talked about education and public health and infrastructure as things that are best done by governments because you can't, you can make a profit, but that doesn't mean that the institutions themselves will be maximally beneficial."}, {"time": 3306, "text": "So I would, I'm just eager to engage people by saying, let's start with our most contemporary understanding of human nature, which is that we are both selfish and tend to cooperate."}, {"time": 3327, "text": "And we also can be heroically helpful to folks in our own tribe."}, {"time": 3327, "text": "And of course, how you define one's tribe becomes critically important."}, {"time": 3342, "text": "But what some people say is, look, look, what would then be, what kind of political institutions and what kind of economic organization can we think about to kind of hit that sweet spot?"}, {"time": 3359, "text": "And that would be, in my opinion, how do we maximize individual autonomy in a way that fosters creativity and innovation and the self regard that comes from creative expression while engaging our more cooperative and reciprocal tendencies in order to come up with a system that is potentially stable over time?"}, {"time": 3387, "text": "Because the other thing about all capital based systems is the stability."}, {"time": 3395, "text": "It's fundamentally unstable."}, {"time": 3401, "text": "Yeah, because it's based on infinite growth."}, {"time": 3401, "text": "And it's a positive feedback loop."}, {"time": 3401, "text": "To be silly, infinite growth is only good for malignant cancer cells and compound interest."}, {"time": 3407, "text": "But otherwise, we want to seek a steady state."}, {"time": 3414, "text": "So when Steven Pinker writes, for example, again, great scholar, but I'm going to disagree when he says the world has never been better, and all we need to do is keep making stuff and buying stuff."}, {"time": 3434, "text": "So your sense is the world sort of in disagreement with Steven Pinker, that the world is like facing a potential catastrophic collapse in multiple directions."}, {"time": 3448, "text": "And the fact that there are certain like the rate of violence and aggregate is decreasing, the death, you know, the quality of life, all those kinds of measures that you can plot across centuries that it's improving."}, {"time": 3460, "text": "That doesn't capture the fact that our world might be this, we might destroy ourselves in very painful ways in the in the in the next century."}, {"time": 3471, "text": "So I'm with Jared Diamond, you know, in the book Collapse, where he points out studying the collapse of major civilizations, that it often happens right after things appear to never have been better."}, {"time": 3483, "text": "And in that regard, I mean, there are more known voices that have taken issue with Dr. Pinker."}, {"time": 3492, "text": "I'm thinking of John Gray, who's a British philosopher and here in the States."}, {"time": 3492, "text": "I don't know where he is these days, but Robert J. Lifton, the psycho historian."}, {"time": 3501, "text": "Yeah, they're both of my view and which I hope is, by the way, wrong."}, {"time": 3512, "text": "Yeah, no, but you know, between, you know, ongoing ethnic tensions, environmental degradation, economic instability, and the fact that, you know, the world has become a Petri dish of psychopathology."}, {"time": 3529, "text": "Like what really worries me is the the quiet economic pain that people are going through, the businesses that are closed, dreams that are broken, because you can no longer do the thing that you've wanted to do and how I mentioned to you off camera that I've been reading The Rise and Fall of the Third Reich."}, {"time": 3548, "text": "And I mean, the amount of anger and hatred and on the flip side of that, sort of a nationalist pride that can arise from deep economic pain."}, {"time": 3561, "text": "Like what happens with that economic pain is you become bitter."}, {"time": 3567, "text": "You start to find the other, whether it's other European nations that mistreated you, whether it's other groups that mistreated you, it always ends up being the Jews somehow or fault here."}, {"time": 3579, "text": "That's what worries me is where this quiet anger and pain goes in 2021, 2022, 2030."}, {"time": 3591, "text": "If you look, sorry to see the parallels."}, {"time": 3591, "text": "Rise and fall of the Third Reich, but you know what happens 10, 15 years from now from what's because of the COVID pandemic that's happening now."}, {"time": 3605, "text": "And Lex, you make a, I think a really profoundly important point, you know, back to our work for a bit or Ernest Becker rather, you know, his point is, is that the way that we manage existential terror is to embrace culturally constructed belief systems that give us a sense that life has meaning and we have value."}, {"time": 3625, "text": "And in the form of self esteem, which we get from perceiving that we meet or exceed the expectations associated with the role that we play in society."}, {"time": 3640, "text": "Well, here we are right now in a world where first of all, if you have nothing, you are nothing."}, {"time": 3647, "text": "And secondly, as you were saying before we got started today, a lot of jobs are gone and they're not coming back."}, {"time": 3653, "text": "And that's the, where the self esteem, that's where the self esteem and identity come in with people."}, {"time": 3660, "text": "It's not only that you don't have anything to eat."}, {"time": 3664, "text": "You don't even have a self anymore to speak of because the, we typically define ourselves, you know, as Marx put it, you are what you do."}, {"time": 3671, "text": "And now who are you when your way of life, as well as your way of earning a living is no longer available?"}, {"time": 3684, "text": "And it feels like that yearning for self esteem that we could talk a little bit more, because you about defining self esteem is quite interesting."}, {"time": 3689, "text": "The more I've read Warm at the Core and just in general, your thinking, it made me realize I haven't thought enough about the idea of self esteem."}, {"time": 3703, "text": "But the thing I want to say is, it feels like when you lose your self esteem, it feels like when you lose your job, then it's easy to find, it's tempting to find that self esteem in a tribe that's not somehow often positive."}, {"time": 3718, "text": "It's like a tribe that defines itself on the hatred of somebody else."}, {"time": 3729, "text": "So that's brilliant."}, {"time": 3729, "text": "And this is what John Gray, the philosopher in the 1990s, predicted what's happening today."}, {"time": 3735, "text": "He wrote a book about globalism."}, {"time": 3735, "text": "And actually Hannah Arendt in the 1950s said the same thing in her book about totalitarianism."}, {"time": 3742, "text": "When she said that, you know, that economics has reached the point where most money is made, not by actually making stuff, you know, you use money to make money."}, {"time": 3759, "text": "And therefore, what happens is money chases money across national boundaries."}, {"time": 3768, "text": "Ultimately, governments become subordinate to the corporate entities whose sole function is to generate money."}, {"time": 3777, "text": "And what John Gray said is that that will inevitably produce economic upheaval in local areas, which will not be attributed to the economic order."}, {"time": 3797, "text": "It will be misattributed to whoever the scapegoat du jour is, and the anger and the distress associated with that uncertainty will be picked up on by ideological demagogues who will transform that into rage."}, {"time": 3817, "text": "So both Hannah Arendt as well as John Gray, they just said, watch out, we're gonna have right wingish populist movements where demagogues who are the alchemists of hate, what makes them brilliant is they don't, the hate's already there, but they take the fears and they expertly redirect them to who it is that I need to hate and kill in order to feel good about myself."}, {"time": 3855, "text": "So back to your point, Lex, that's right."}, {"time": 3855, "text": "So the self regard that used to come from having a job and doing it well, and as a result of that, having adequate resources to provide a decent life for your family, well, those opportunities are gone."}, {"time": 3870, "text": "And yeah, what's left?"}, {"time": 3879, "text": "So Max Weber, German sociologist at the beginning of the 20th century, he said in times of historical upheaval, we are apt to embrace, he was the one who coined the term charismatic leader, seemingly larger than life individuals who often believe or their followers believe are divinely ordained to rid the world of evil."}, {"time": 3902, "text": "All right, now, Ernest Becker, he used Weber's ideas in order to account for the rise of Hitler."}, {"time": 3911, "text": "Hitler was elected, and he was elected when Germans were in an extraordinary state of existential distress, and he said, I'm gonna make Germany great again."}, {"time": 3919, "text": "All right, now, what Becker adds to the equation is his claim that what underlies our affection for charismatic populist leaders, good and bad, is death anxiety."}, {"time": 3937, "text": "All right, now, here's where we come in, we're egghead experimental researchers."}, {"time": 3945, "text": "Becker wrote this book, The Denial of Death, and he couldn't get a job."}, {"time": 3952, "text": "People just dismiss these ideas as fanciful speculation for which there's no evidence."}, {"time": 3960, "text": "And you've done some good experiments."}, {"time": 3960, "text": "Yeah, here's where I can be more cavalier, and where what I would urge people, like what you said, Lex, is ignore my histrionic and polemic language, if possible, and step back, if you can, myself included, and let's just consider the research findings."}, {"time": 3983, "text": "Because in September 11, 2001, people that are old enough to remember that horrible day, two days before, George W. Bush had the lowest approval rating in the history of presidential polling."}, {"time": 4002, "text": "All right, three weeks later, after he said, we will rid the world of the evildoers, and then a week or two after that, he said in a cover story on Time magazine that he believed that God had chosen him to lead the world during this, to lead the country, rather, during this perilous time, he had the highest approval rating."}, {"time": 4021, "text": "And so we're like, well, what happened?"}, {"time": 4027, "text": "You know, what happened to Americans that their approval of President Bush got so high so fast?"}, {"time": 4036, "text": "Well, our view, following Becker, is that 2001 was like a giant death reminder."}, {"time": 4036, "text": "The people dying, plus the symbols of American greatness, World Trade Center and the Pentagon."}, {"time": 4045, "text": "So we did a bunch of experiments, and most of our experiments are disarmingly simple."}, {"time": 4053, "text": "We have one group of people, and we just remind them that they're going to die."}, {"time": 4057, "text": "We say, hey, write your thoughts and feelings about dying."}, {"time": 4062, "text": "Or in other cases, we stop them outside, either in front of a funeral home or 100 meters to either side."}, {"time": 4068, "text": "Our thought being that if we stop you in front of a funeral home, then death is on your mind, even if you don't know it."}, {"time": 4075, "text": "And then there's other studies, they're even more subtle, where we bring people into the lab, and they read stuff on a computer, and while they're doing that, we flash the word death for 28 milliseconds."}, {"time": 4085, "text": "It's so fast, you don't see anything."}, {"time": 4091, "text": "And then we just measure people's reactions or behavior thereafter."}, {"time": 4091, "text": "So what we found in 2003, leading up to the election of 2004, was that Americans did not care for President Bush or his policies in Iraq in controlled conditions."}, {"time": 4109, "text": "But if we reminded them of their mortality first, they liked Bush a lot more."}, {"time": 4117, "text": "So in every study that we did, Americans liked John Kerry, who was running against Bush, they liked Kerry more than Bush."}, {"time": 4129, "text": "Policy wise, in a controlled..."}, {"time": 4132, "text": "In a controlled condition."}, {"time": 4132, "text": "But if they were reminded of death first, then they liked Bush a lot more."}, {"time": 4141, "text": "So by the way, just a small pause, you said they're discerningly simple experiments."}, {"time": 4146, "text": "I think that's, and people should read Warm at the Core for some other description, you have a lot of different experiments of this nature."}, {"time": 4151, "text": "I think it's a brilliant experiment connected to the Stoics, perhaps, of how your worldview on anything and how delicious that water tastes after you're reminded of your own mortality."}, {"time": 4162, "text": "It's such a fascinating experiment that you could probably keep doing like millions of them to draw insight about the way we see the world."}, {"time": 4177, "text": "No, that's right, Lex."}, {"time": 4177, "text": "And I appreciate the compliment, not because we did anything, but because what these studies, many of which are now done by other people around the world in labs that we're not connected with, what I'm most proud about our work."}, {"time": 4189, "text": "I am proud of the experiments that we've done."}, {"time": 4194, "text": "But it's not science until somebody else can replicate your findings and independent researchers are interested in pursuing them."}, {"time": 4205, "text": "It's such a fascinating idea."}, {"time": 4205, "text": "I don't..."}, {"time": 4205, "text": "I have to think about a lot about the experiments you've done and that you've inspired, about the fact that death changes the way you see a bunch of different things."}, {"time": 4214, "text": "I think the Stoics talked about the, I mean, in general, just memento mori, like just thinking about death and meditating on death is a really positive, not a positive, it's an enlightening way to live life."}, {"time": 4228, "text": "So what do you think about that at the individual level?"}, {"time": 4237, "text": "Like, what is the role about being, bringing that terror of death, fear of death to the surface and being cognizant of it?"}, {"time": 4248, "text": "For us, that's the ball game."}, {"time": 4248, "text": "So what I'm trying to say is that so what we write in our book and here we're just paying homage to the philosophers and theologians that come before us is to point out that literally since antiquity, there has been a consensus that to lead a full life requires, Albert Camus said, come to terms with death, thereafter anything is possible."}, {"time": 4288, "text": "And so you've got the Stoics and you've got the Epicureans and then you've got the Tibetan Book of the Dead and then you've got like the medieval monks that, you know, worked with like a skull on their desk."}, {"time": 4303, "text": "And the whole idea, I should back up a bit because and just remind folks that our studies, you know, when we remind people that they're going to die and we find that, yeah, they drink more water if a famous person is, you know, advertising it, but they eat more cookies."}, {"time": 4328, "text": "They want more fancy clothes."}, {"time": 4328, "text": "They sit closer to people that look like them."}, {"time": 4336, "text": "It changes who they vote for."}, {"time": 4336, "text": "But all of those things, those are very subtle death reminders."}, {"time": 4343, "text": "You don't even know that death is on your mind."}, {"time": 4343, "text": "And so our point is that, and this is kind of counterintuitive, and that is that the most problematic and unsavory human reactions to death anxiety are malignant manifestations of repressed death anxiety."}, {"time": 4358, "text": "You know, we try and bury it under the psychological bushes and then it comes back to bear bitter fruit."}, {"time": 4365, "text": "But what the theologians and the philosophers of the world are saying is it behooves each of us to spend considerable time."}, {"time": 4382, "text": "You don't have to be a goth death rocker, you know, wallowing in death imagery to spend enough time entertaining the reality of the human condition, which is that you too will pass to get to the point where there is, to lapse into a cliche, the capacity for personal transformation and growth."}, {"time": 4411, "text": "Let's go personal for a second."}, {"time": 4411, "text": "Are you yourself afraid of death?"}, {"time": 4421, "text": "And how much do you meditate on that thought?"}, {"time": 4421, "text": "Like, maybe your own study of it is a kind of escape from your own mortality."}, {"time": 4429, "text": "So you got it."}, {"time": 4429, "text": "And like, if you figure out death, somehow you won't die."}, {"time": 4435, "text": "So no, no."}, {"time": 4435, "text": "So my my colleagues and good friends, Jeff Greenberg and Tom Posinski, you know, we met in graduate school in the 1970s."}, {"time": 4441, "text": "We've been doing this work for 40 years."}, {"time": 4446, "text": "And we cheerfully admit, even though it doesn't reflect well on us as humans, that I should just speak for myself."}, {"time": 4456, "text": "But I feel like there's a real sense in which doing these studies and writing books and lecturing has been my way of avoiding directly confronting my anxiety."}, {"time": 4474, "text": "Directly confronting my anxieties by turning it into an intellectual exercise."}, {"time": 4474, "text": "And every once in a while, therefore, when I think that I'm making some progress as a human, I have to remind myself that that is probably not the case."}, {"time": 4488, "text": "And I have at times, like all humans, been more preoccupied with the implications of these ideas for my self esteem as like, oh, we're going to write a book and maybe we'll get to go on TV or something."}, {"time": 4505, "text": "Well, no, that's not the same as to actually think about it in a way that you feel it rather than just think it."}, {"time": 4523, "text": "Yeah, like you did when you were eight."}, {"time": 4523, "text": "So when I first read The Denial of Death, I was so literally flabbergasted by it that I took a leave of absence for a year and just like did what would be considered menial jobs."}, {"time": 4537, "text": "I did construction work."}, {"time": 4537, "text": "I worked in a restaurant."}, {"time": 4543, "text": "And I was just like, well, wait a minute."}, {"time": 4543, "text": "If I understand what this guy is saying, then I'm just a culturally constructed meat puppet doing things for reasons that I know not in order to assuage death anxiety."}, {"time": 4564, "text": "And I was like, that's not acceptable."}, {"time": 4570, "text": "Maybe another interesting person to talk about is Ernest Becker himself."}, {"time": 4576, "text": "So how did he face his death?"}, {"time": 4576, "text": "Is there something interesting, personal?"}, {"time": 4584, "text": "So interesting to me is Becker also from a Jewish family, claimed to be the atheistic, did not identify ultimately as Jewish."}, {"time": 4595, "text": "I believe he converted to Christianity, but was himself a religious person."}, {"time": 4607, "text": "And he said he became religious when his first child was born."}, {"time": 4615, "text": "Now religious, what does that mean?"}, {"time": 4615, "text": "Does he have a faith?"}, {"time": 4615, "text": "Well, let's talk more."}, {"time": 4615, "text": "Most importantly, is the afterlife."}, {"time": 4623, "text": "What's his view on the afterlife?"}, {"time": 4623, "text": "He was agnostic on that, but he did."}, {"time": 4631, "text": "Now the denial of death is, there's a chapter devoted to Kierkegaard."}, {"time": 4631, "text": "And he talks about for Kierkegaard, if you want to become a mature individual, if you want to learn something, you go to the university."}, {"time": 4650, "text": "If you want to become a more mature individual, according to Kierkegaard, you got to go to the school of anxiety."}, {"time": 4656, "text": "And what Kierkegaard said is that we have to let this vague dis ease, put a hyphen between dis and ease about death."}, {"time": 4665, "text": "Kierkegaard's point is you have to really think about that."}, {"time": 4674, "text": "You have to think about it and feel it."}, {"time": 4674, "text": "You got to let it seek in or seep into your mind."}, {"time": 4683, "text": "At which point, according to Kierkegaard, basically you realize that your present identity is fundamentally a cultural construction."}, {"time": 4694, "text": "You didn't choose the time and place of your birth."}, {"time": 4699, "text": "You didn't choose your name."}, {"time": 4699, "text": "You didn't choose necessarily even the social role that you occupy."}, {"time": 4707, "text": "You might've chosen from what's available in your culture, but not from the full palette of human opportunities."}, {"time": 4712, "text": "And so what Kierkegaard said is that we need to realize that we've been living a lie of sorts."}, {"time": 4720, "text": "Becker calls it a necessary lie."}, {"time": 4720, "text": "And we have to momentarily dispose of that."}, {"time": 4731, "text": "And so now Kierkegaard says, well, here I am."}, {"time": 4731, "text": "I have shrugged off all of the all of the cultural accoutrements that I have used to define myself."}, {"time": 4740, "text": "And now what am I or who am I?"}, {"time": 4751, "text": "This is like the ancient Greek tragedy where the worst thing was to be no one or no thing."}, {"time": 4751, "text": "At this point, Kierkegaard said, you're really dangling on the precipice of oblivion."}, {"time": 4759, "text": "And some people tumble into that abyss and never come out."}, {"time": 4766, "text": "On the other hand, Kierkegaard said that what you can now do metaphorically and literally is to rebuild yourself from the ground up."}, {"time": 4774, "text": "And there's a, in the new Testament, there's something you have to die in order to be reborn."}, {"time": 4780, "text": "And Kierkegaard's view though, is that there's only one way to do that."}, {"time": 4786, "text": "This is his proverbial leap into faith."}, {"time": 4791, "text": "And in Kierkegaard's case, it was faith in Christianity, that you can't have unbridled faith in cultural constructions."}, {"time": 4801, "text": "The only thing that you can have unequivocal faith in is some kind of transcendent power."}, {"time": 4809, "text": "But of course, this raises the question of, well, is that just another death denying belief system?"}, {"time": 4817, "text": "And at the end of the denial of death, Becker admits that there's no way to tell while still advocating for what is ultimately a religious stance."}, {"time": 4826, "text": "Now, one of the things that I don't understand, and Becker has been the most singularly potent influence in my academic and personal life, but a year or two ago, I started reading Martin Heidegger."}, {"time": 4850, "text": "I'm reading Being and Time."}, {"time": 4850, "text": "And what I now wonder is why Becker, who refers to Heidegger from time to time in his work, why he didn't take Heidegger more seriously."}, {"time": 4862, "text": "Because Heidegger is like a secular Kierkegaard."}, {"time": 4868, "text": "He has the same thing, which is death anxiety."}, {"time": 4868, "text": "Oh, and I should have pointed out that what Kierkegaard says is that death anxiety, most people don't go to the school of anxiety."}, {"time": 4882, "text": "They flee from death anxiety by embracing their cultural beliefs."}, {"time": 4882, "text": "Kierkegaard says they then tranquilize themselves with the trivial."}, {"time": 4892, "text": "And I love that phrase."}, {"time": 4892, "text": "It's a beautiful phrase because at the end of the denial of death, Becker's like, look, the average American is either drinking or shopping or watching television, and they're all the same thing, right?"}, {"time": 4904, "text": "Heidegger says the same thing."}, {"time": 4910, "text": "He says, look, and he acknowledges Kierkegaard."}, {"time": 4910, "text": "He says, what makes us feel unsettled?"}, {"time": 4916, "text": "And evidently, that's an English translation of angst, that we don't feel at home in the world."}, {"time": 4926, "text": "Heidegger says that's death anxiety."}, {"time": 4926, "text": "And one direction is the Kierkegaard one."}, {"time": 4934, "text": "Heidegger calls it a flight from death."}, {"time": 4934, "text": "You just unself reflexively cling to your cultural constructions."}, {"time": 4941, "text": "And Heidegger borrows the term tranquilized, but he points out that he doesn't care for that term because tranquilized sounds like you're subdued."}, {"time": 4950, "text": "When in fact, what most culturally constructed meat puppets do is to be frenetically engaged with their surroundings to ensure that they never sit still long enough to actually think about anything consequential."}, {"time": 4969, "text": "Heidegger says there's another way, though."}, {"time": 4969, "text": "He's like, yo, what you can do is to come to terms with that death anxiety in the following way."}, {"time": 4977, "text": "Thing number one is to realize that not only are you going to die, but your death can happen at any given moment."}, {"time": 4986, "text": "So for Heidegger, if you say, I know I'm going to die in some vaguely unspecified future moment, that's still death denial because you're saying, yeah, not me, not now."}, {"time": 5002, "text": "Heidegger's point is you need to get to the point where you need to realize that I need to realize that I can walk outside and get smote by a comet, or I can stop for gas on the way home and catch the virus and be dead in two days, or any number of potentially unanticipated and uncontrollable fatal outcomes."}, {"time": 5031, "text": "That's brilliant, by the way."}, {"time": 5031, "text": "To bring it to the now."}, {"time": 5037, "text": "Yeah, it is brilliant."}, {"time": 5037, "text": "I agree, Lex, and that's just why I'm wondering why didn't Becker notice this?"}, {"time": 5043, "text": "Because that's the being and time thing, is it's got to be now."}, {"time": 5043, "text": "And then he says, so okay, so now I've dealt somewhat with the death part."}, {"time": 5049, "text": "And now he says, now you've got to deal with what he calls existential guilt."}, {"time": 5060, "text": "And he says, well, all right, you have to realize that like it or not, you have to make choices."}, {"time": 5071, "text": "This is Jean Paul Sartre, we are condemned by virtue of consciousness to choosing."}, {"time": 5077, "text": "But Heidegger is a little bit more precise."}, {"time": 5077, "text": "He's like, look, as I was saying earlier, you're in reality, you're an insignificant speck of respiring carbon based dust born into a time and place not of your choosing when you're here for a microscopic amount of time after which you are not."}, {"time": 5102, "text": "And for Heidegger, you have to realize that, like I said, I didn't choose to be born a male or Jewish or in America, the offspring of working class people."}, {"time": 5113, "text": "And Heidegger, what he says is, yeah, but you still have to make choices and accept responsibility for those choices, even though you didn't choose any of the parameters that ultimately limit what's available to you."}, {"time": 5139, "text": "And moreover, you're going to not always make good choices."}, {"time": 5139, "text": "So now you're guilty for your choices."}, {"time": 5151, "text": "And then he uses the poet Rilke, he has a phrase, Becker uses it in The Denial of Death, the guilt of unlived life."}, {"time": 5163, "text": "I just love that."}, {"time": 5163, "text": "You have to accept that you have already diminished and in many ways amputated your own possibilities by virtue of choices that you've made or just as often have declined to make because you are reluctant to accept responsibility for the opportunities that you are now able to create by virtue of seeing the possibilities that lay before you."}, {"time": 5202, "text": "So anyway, Heidegger then says, look, OK, so, you know, I'm a professor and I live in America in the 21st century."}, {"time": 5212, "text": "Well, if I was in the third century living in a year in Mongolia, I'm not going to have an opportunity to be a professor."}, {"time": 5220, "text": "But what he submits is that there is some aspects of whatever I am that are independent of my cultural and historical circumstances."}, {"time": 5230, "text": "In other words, there is a me of sorts."}, {"time": 5239, "text": "Heidegger would take vigorous issue and so would Heidegger's scholars because I'm not claiming to understand him."}, {"time": 5243, "text": "This is my classic comic book rendering."}, {"time": 5249, "text": "But Heidegger's point is that you get to the point where you're able to say, OK, I am a contingent historical and cultural artifact."}, {"time": 5254, "text": "But so what?"}, {"time": 5254, "text": "You know, if I was, you know, if I was transported a thousand years in the past in Asia, I'd be in the same situation."}, {"time": 5272, "text": "I would still be conditioned by time and place."}, {"time": 5272, "text": "I would still have choices that I could make within the confines of what opportunities are afforded to me."}, {"time": 5278, "text": "And then Heidegger says, if I can get that far in this is his language."}, {"time": 5286, "text": "He says that there is a transformation and he literally he calls it a turning."}, {"time": 5294, "text": "You're turning away from a flight from death and you are allowed you therefore you see a horizon is his word of opportunity that makes you in a state of anticipatory resoluteness with solicitous regard for others that makes your life seem like an adventure perfused with unshakable joy."}, {"time": 5324, "text": "Let me unpack those things."}, {"time": 5324, "text": "It is beautiful."}, {"time": 5324, "text": "I love, Lex, that you're resonating to the time thing."}, {"time": 5334, "text": "So he's like, OK, we already talked about now."}, {"time": 5339, "text": "Anticipatory is is already hopeful because it's looking forward to be resolute."}, {"time": 5339, "text": "It means to trust and to just have confidence in what you're doing moving forward."}, {"time": 5349, "text": "Solicitous."}, {"time": 5349, "text": "I had to look up all these words, by the way."}, {"time": 5359, "text": "It just means that you are concerned about your fellow human beings."}, {"time": 5365, "text": "And but I love the idea, even if it seems allegorical, I don't mind that at all."}, {"time": 5374, "text": "This idea you said love earlier."}, {"time": 5374, "text": "And I think that when Heidegger is talking about being solicitous, that's as close as he can get."}, {"time": 5381, "text": "There's an Italian."}, {"time": 5381, "text": "So what was that line again with the solicitous of the whole thing of turning away from death?"}, {"time": 5389, "text": "And all the words you said are just beautiful."}, {"time": 5396, "text": "I love those words."}, {"time": 5396, "text": "Anticipatory resoluteness that is accompanied with solicitous regard to our fellow humans, which makes life appear to us to be an ongoing adventure that is permeated by unshakable joy."}, {"time": 5412, "text": "Now, again, Heidegger is not Mary Poppins."}, {"time": 5412, "text": "This I just got a tattoo."}, {"time": 5420, "text": "This is great."}, {"time": 5420, "text": "I just love that exact quote."}, {"time": 5420, "text": "No, I'm piecing together."}, {"time": 5420, "text": "These are his exact words that and I spent the last two years reading almost everything that I can find because I want to."}, {"time": 5435, "text": "I'm sick of death."}, {"time": 5435, "text": "You said it."}, {"time": 5435, "text": "So I want to second what you say, Lex."}, {"time": 5435, "text": "So it's not about death."}, {"time": 5442, "text": "It's the Sherwood Anderson guy."}, {"time": 5442, "text": "He's a novelist that I like about."}, {"time": 5442, "text": "He wrote a book in Lyonsburg, Ohio."}, {"time": 5449, "text": "And now I'm going to forget what he said on his tombstone."}, {"time": 5449, "text": "But, you know, it was something to the effect."}, {"time": 5457, "text": "Oh, he said life, not death is the great adventure."}, {"time": 5457, "text": "The point being is that, you know, to consider that we must die and the existential implications of that, really, the goal, the way I see it is getting from hate to love."}, {"time": 5475, "text": "And I feel like Heidegger has a way of thinking about things that moves us more in that direction."}, {"time": 5486, "text": "And so that's kind of my current preoccupation is to take what I just said to you and to talk about it with my colleagues and other academic psychologists, because the way we started with Ernest Becker, remember I said earlier, I wasn't trained in any of these things."}, {"time": 5510, "text": "I'm an egghead researcher that was doing experiments about biofeedback."}, {"time": 5516, "text": "And, you know, then we read these Becker books, and I thought they were so interesting that for the first few years, we didn't have any studies."}, {"time": 5528, "text": "I just would travel around and I'd be like, here's what this Becker guy says."}, {"time": 5533, "text": "I think this is cool."}, {"time": 5533, "text": "Well, my present view is I'm like, here's what this Heidegger guy says."}, {"time": 5540, "text": "I think these ideas are consistent with what Becker is saying because they are anchored in death anxiety."}, {"time": 5550, "text": "But I like that direction as an alternative to the Kierkegaardian insistence that the only psychologically tenable way to extricate ourselves from maladaptive reactions to death anxiety is through faith in the traditional sense."}, {"time": 5571, "text": "Yeah, I always kind of saw Kierkegaard unfairly, like you said, in a comic book sense of the word faith as a non traditional sense."}, {"time": 5580, "text": "I kind of like the idea of leap of faith."}, {"time": 5586, "text": "Oh, I love that idea."}, {"time": 5586, "text": "And so what I've been babbling about with, you know, Heidegger, I'm like, yeah, Kierkegaard is a leap of faith in God."}, {"time": 5591, "text": "Heidegger is a leap of faith in life."}, {"time": 5601, "text": "And I just like it."}, {"time": 5601, "text": "I found the leap of faith really interesting in the technological space."}, {"time": 5609, "text": "So I've talked to on this thing with Elon Musk, but I think he's also just in general for our culture, a really important figure."}, {"time": 5617, "text": "That takes, I mean, sometimes a little bit insane on social media and just in life."}, {"time": 5623, "text": "When I met him, it was kind of interesting that, of course, there's, I mean, he's a legit engineer, so he's fun to talk to about the technical things, but he also just the way the humor and the way he sees life, it just like refuses to be conventional."}, {"time": 5645, "text": "So it's a constant leap into the unknown."}, {"time": 5645, "text": "And one of the things that he does, and this isn't even like fake."}, {"time": 5654, "text": "A lot of people say, cause he's a CEO, there's a business owner."}, {"time": 5660, "text": "So he's trying to make money."}, {"time": 5660, "text": "No, I think I looked him in his eyes."}, {"time": 5660, "text": "I mean, this is real, is a lot of the things he believes that are going to be accomplished that a lot of others are saying are impossible, like autonomous vehicles."}, {"time": 5673, "text": "He truly believes it."}, {"time": 5673, "text": "To me, that is the leap of faith of I'm almost going like, we're like the entirety of our experience is shrouded in mystery."}, {"time": 5685, "text": "We don't know what the hell's going to happen."}, {"time": 5685, "text": "We don't know what we're actually capable of as human beings."}, {"time": 5690, "text": "And he just takes the leap."}, {"time": 5690, "text": "He fully believes that we can, you know, we can go to, we can colonize Mars."}, {"time": 5696, "text": "I mean, how, how crazy is it to just believe and dream and actually be taking steps towards it to colonizing Mars when most people are like, that's the stupidest idea ever."}, {"time": 5710, "text": "Well, I'm, I'm in agreement with you on that."}, {"time": 5710, "text": "You know, two things, you know, one is it reminds me of Ben Franklin who in his autobiography, you know, has a similarly childish in the best sense of the word, unbridled imagination for what might become, you know, Ben Franklin's like, yeah, I got electricity."}, {"time": 5731, "text": "That's cool, but we'll be levitating soon."}, {"time": 5737, "text": "And I, we can't even begin to imagine what we are capable of."}, {"time": 5737, "text": "And of course, people are like, dude, that's crazy."}, {"time": 5745, "text": "And there's a guy with it's FCS Schiller, some humanistic guy at the beginning of the 20th century."}, {"time": 5753, "text": "He's like, you know, lots of things that people think about may appear to be absurd to the point of obscene."}, {"time": 5765, "text": "But the reality is historically every fantastic innovation has generally been initiated by someone who was condemned for being a lunatic."}, {"time": 5782, "text": "And it's not that anything is possible, but surely things that we don't try will never manifest as possibilities."}, {"time": 5791, "text": "And that's, that's that there's something beautiful to that."}, {"time": 5798, "text": "That's the embracing the abyss."}, {"time": 5798, "text": "And again, it's like the, it's the embracing the fear of death, the reality of death and then turning and to look at all the opportunities."}, {"time": 5814, "text": "Let me ask you, whenever I bring up Ernest Becker's work, which I do and yours is quite a bit, I find it surprising how that it's not a lot more popular in a sense that, no, we're not, I don't mean just your book."}, {"time": 5831, "text": "That's well written."}, {"time": 5831, "text": "People should read it, should buy it, whatever."}, {"time": 5836, "text": "I think it has the same kind of qualities that are useful to think about as like Jordan Peterson's work and stuff like that."}, {"time": 5843, "text": "But I just mean like why people are not, don't think of that as a compelling description of the core of the human condition."}, {"time": 5852, "text": "Like, I think what you mentioned about Heidegger is quite, connects with me quite well."}, {"time": 5862, "text": "So I ask on this podcast, I often ask people if they're afraid of death."}, {"time": 5867, "text": "That's like almost every single part."}, {"time": 5872, "text": "I almost always get criticized for asking world class people, scientists and technologists about fear of death and the meaning of life."}, {"time": 5880, "text": "And on the fear of death, they often like don't say anything interesting."}, {"time": 5889, "text": "What I mean by that is they haven't thought deeply about it."}, {"time": 5896, "text": "Like you kind of brought this up a few times of really letting it sink in."}, {"time": 5896, "text": "They kind of say this thing about what exactly you said, which is like, it's something that happens not today."}, {"time": 5902, "text": "Like I'm aware that it's something that happens."}, {"time": 5909, "text": "And I'm not, the thing they usually say is I'm not afraid of death."}, {"time": 5914, "text": "I just want to live a good life kind of thing."}, {"time": 5914, "text": "And what I'm trying to express is like when I look in their eyes and the kind of the core of the conversation, it looks like they haven't really become, like they haven't really meditated on death."}, {"time": 5927, "text": "I guess the question is, what do I say to people that there's something to really think about here?"}, {"time": 5934, "text": "Like there's some demons, some realities that need to be faced by more people."}, {"time": 5944, "text": "Well, that's a tough one."}, {"time": 5944, "text": "You know, I could tell you what not to do."}, {"time": 5950, "text": "So when we are young and annoying, a lot of famous people, mostly psychologists because that's who we intersected with, we would lay out these ideas and they would be, well, I don't think about death like that."}, {"time": 5969, "text": "So these ideas must be wrong."}, {"time": 5969, "text": "And we would say, well, you don't think about death because you're lucky enough to be comfortably ensconced in a cultural worldview from which you derive self esteem."}, {"time": 5984, "text": "And that has spared you the existential excruciations that would otherwise arise."}, {"time": 5990, "text": "But that's like Freud."}, {"time": 5990, "text": "You know, you're repressing, so you either agree with me in which case I'm right, or you disagree with me in which case you're repressing and I'm right."}, {"time": 6004, "text": "Well, so that's the Nietzsche thing."}, {"time": 6004, "text": "What I felt when I've, there've been moments in my life when I really thought about death."}, {"time": 6011, "text": "I mean, there's not too many."}, {"time": 6011, "text": "Like really, really thought about it and feel the thing when you felt that eight, maybe I'm traumatizing or romanticizing it."}, {"time": 6017, "text": "But I feel like it's, the conservatives call it popularly like, or the movie Matrix call it the red pill moment."}, {"time": 6031, "text": "I feel like it's a dangerous thought because I feel like I'm taking a step out of a society."}, {"time": 6039, "text": "Like there's a nice narrative that we've all constructed and I'm taking a step out."}, {"time": 6045, "text": "And it feels, there's this feeling like you're basically drowning."}, {"time": 6045, "text": "I mean, it's not a good feeling."}, {"time": 6055, "text": "It is not."}, {"time": 6055, "text": "But this gets back to the Heidegger Kierkegaard school of anxiety."}, {"time": 6055, "text": "You are stepping out and you are momentarily shrugging off, again, the culturally constructed psychological accoutrements that allow you to stand up in the morning."}, {"time": 6069, "text": "And so, I mean, in that sense, it feels like, I mean, how do you have that conversation?"}, {"time": 6078, "text": "Because I guess I'm dancing around a set of questions, which is like, I guess I'm disappointed that people don't, are not as willing to step outside."}, {"time": 6097, "text": "Like even just, even any kind of thought experiment."}, {"time": 6097, "text": "Forget denial of death."}, {"time": 6097, "text": "Like there's not a community of people."}, {"time": 6108, "text": "Let's take an easy one that I think is scientifically ridiculous, which is, there's a community of people that believe that the earth is flat."}, {"time": 6113, "text": "Or actually even better, the space is fake."}, {"time": 6119, "text": "Like what I find surprising is that a lot of people I talk to are not willing to be like, imagine if it is, like imagine the earth is flat."}, {"time": 6129, "text": "Like think about it."}, {"time": 6138, "text": "Like a lot of people are just like, no, the earth is round."}, {"time": 6138, "text": "They're like scientists too."}, {"time": 6138, "text": "They're like, yeah, well actually, wait, have you actually like thought about it?"}, {"time": 6145, "text": "Like imagine like a thought experiment that like basically step outside the little narrative that we are comfortable with."}, {"time": 6151, "text": "Now that one in particular is, has really strong evidence and scientific validation."}, {"time": 6158, "text": "So it's pretty simple thing to show that it at least is not flat."}, {"time": 6168, "text": "But just the willingness to take a step outside of the stories that bring us comfort, it's been disappointing that people are not willing to do that."}, {"time": 6183, "text": "And I think the philosophy that you've constructed and that Ernest Becker is constructing, you've tested, I think is really compelling."}, {"time": 6189, "text": "And the fact that people aren't often willing to take that step."}, {"time": 6194, "text": "It's disappointing."}, {"time": 6194, "text": "Well, yes, but perhaps understandable."}, {"time": 6194, "text": "I mean, one of this is an anecdote, of course, but when we were trying to get a publisher for our book, we had a meeting with a publisher who published some Malcolm Gladwell books."}, {"time": 6210, "text": "And she said, I'm very interested in your book, but can you write it without mentioning death?"}, {"time": 6221, "text": "Because people don't like death."}, {"time": 6227, "text": "And we're like, no, it's really kind of central."}, {"time": 6227, "text": "And I think that's part of it."}, {"time": 6227, "text": "I think, again, if these ideas have merit, and I actually like the way that you put it, Lex, it's that to step away is to momentarily expose yourself to all of the anxiety that our identity and our beliefs typically enable us to manage."}, {"time": 6260, "text": "I think it's as simple as that."}, {"time": 6264, "text": "Yeah, I had this experience in college with my best friend who got really high."}, {"time": 6264, "text": "And he forgot, it was in the winter, it was really freezing."}, {"time": 6276, "text": "It was memorable to me."}, {"time": 6276, "text": "I think it's an analogy, it's very useful."}, {"time": 6281, "text": "So he went to get some pizza."}, {"time": 6281, "text": "And he left me outside and said, I'll be back in five minutes."}, {"time": 6293, "text": "And he forgot that he left me outside."}, {"time": 6293, "text": "And I remember it was, I was in shorts, it was freezing winter."}, {"time": 6299, "text": "And I remember standing outside, it's a dorm, and I'm looking from the outside in, it's a light and it's warm."}, {"time": 6305, "text": "And I'm just standing there frozen, I think for an hour or more."}, {"time": 6312, "text": "And that's how I think about it."}, {"time": 6312, "text": "I don't give a damn about the stupid winter."}, {"time": 6319, "text": "I'm drawn to be back to the warm."}, {"time": 6319, "text": "And that's how I feel about thinking about death."}, {"time": 6329, "text": "At a certain point, it's too much."}, {"time": 6329, "text": "It's like that cold."}, {"time": 6329, "text": "I wanna be back into the warm."}, {"time": 6337, "text": "Getting back to Heidegger for a moment."}, {"time": 6337, "text": "He uses a lot the idea of feeling at home, not as like in your house, but just feeling like you're comfortably situated."}, {"time": 6352, "text": "Maybe you could talk about, like I had a conversation about this with my dad a little bit."}, {"time": 6358, "text": "How does religion relate to this?"}, {"time": 6361, "text": "I see it as the disease and the cure."}, {"time": 6361, "text": "In a sense, a few things."}, {"time": 6361, "text": "One is that I think a case could be made that humans are innately religious."}, {"time": 6378, "text": "So now we're gonna get into territory where there's gonna be a lot of disputes."}, {"time": 6386, "text": "And what do you mean by religious?"}, {"time": 6393, "text": "Religion is an evolutionary adaptation."}, {"time": 6396, "text": "And religion is like a belief in something outside of yourself kind of thing?"}, {"time": 6402, "text": "So here we gotta be a little bit more careful."}, {"time": 6402, "text": "And again, I'm not a scholar."}, {"time": 6410, "text": "How about I'm a well intentioned dilettante in this regard?"}, {"time": 6410, "text": "Because what I have read is that religion evolved very early on, long before our ancestors were conscious and the issue of death arose."}, {"time": 6431, "text": "And the word religion evidently is from a Latin word, regatear."}, {"time": 6431, "text": "We can look it up."}, {"time": 6431, "text": "And it means to bind."}, {"time": 6442, "text": "And Emile Durkheim, the dead French sociologist, he said, you know, originally religion is Darce Lassing, who's a dead novelist."}, {"time": 6451, "text": "She calls it the substance of we feeling that it's literally that it arose because we're uber social creatures who from time to time took comfort in just being in physical proximity with our fellow humans."}, {"time": 6471, "text": "And that there is this kind of sense of transcendent exuberance, just back to the unshakable joy that Heidegger alludes to."}, {"time": 6491, "text": "And that the original function of religion was to foster social cohesion and coordination."}, {"time": 6491, "text": "And that it was only subsequently some claim that a burgeoning level of consciousness made it such that religious belief systems that included the hope of some kind of immortality were just naturally selected thereafter."}, {"time": 6517, "text": "So there are some people."}, {"time": 6517, "text": "So it's David Sloan Wilson wrote a book called Darwin's Cathedral."}, {"time": 6526, "text": "And he said, religion has nothing to do with death."}, {"time": 6533, "text": "It's evolved to make groups viable."}, {"time": 6533, "text": "He's actually a group selection guy."}, {"time": 6540, "text": "What's group selection?"}, {"time": 6540, "text": "The idea that it's the group that is selected for rather than the individual."}, {"time": 6547, "text": "Yeah, so people have vigorous disagreements about that."}, {"time": 6547, "text": "But I guess our point would be, we see religion as being inextricably connected, ultimately, to assuaging concerns about death."}, {"time": 6561, "text": "Well, I guess another question to ask around this, like, what does the world look like without religion?"}, {"time": 6570, "text": "Will we, if it's inextricably connected to our fears of death, do you think it always returns in some kind of shape?"}, {"time": 6581, "text": "Maybe it's not called religion, but whatever, it just keeps returning?"}, {"time": 6587, "text": "Yeah, who knows?"}, {"time": 6587, "text": "So that's a great question, Lex."}, {"time": 6587, "text": "So there's a woman named Karen Armstrong."}, {"time": 6591, "text": "She was a nun turned historian."}, {"time": 6591, "text": "And she's, I can't remember the name of the book, but no matter."}, {"time": 6602, "text": "She, we could look that up, but..."}, {"time": 6602, "text": "If you want, I can look it up, but I can also, I'll just add it in post."}, {"time": 6608, "text": "Yeah, her point, it says God in the title, of course."}, {"time": 6613, "text": "But she's like, look, all religions are generally fairly right minded in that they advocate the golden rule."}, {"time": 6623, "text": "And all religions, at their best, do seem to foster pro social behavior towards the in group."}, {"time": 6635, "text": "And that confers both psychological as well as physical benefits."}, {"time": 6635, "text": "That's the good news."}, {"time": 6644, "text": "And the bad news is historically all religions are subject to being hijacked by a lunatic fringe who declares that, you know, they're the ones in sole possession of the world."}, {"time": 6662, "text": "Sole possession of the liturgical practices or whatever they call them."}, {"time": 6670, "text": "And they're the ones that turn, you know, religion at its best into your crusades and holocausts."}, {"time": 6679, "text": "My view, not that it should matter for much, but I grew up just skeptical of religion because I'm like, as a kid, I'm like, well, if we didn't have these beliefs, we wouldn't be killing each other because of them."}, {"time": 6699, "text": "And I'd be like to my parents, well, you're telling me that all people should be judged on the merits of their character, but don't come home if you don't marry a Jewish woman."}, {"time": 6711, "text": "Which is implying that if you're not Jewish, you're an inferior form of life."}, {"time": 6718, "text": "That's what tribes always do."}, {"time": 6722, "text": "And there's the tribal thing."}, {"time": 6722, "text": "And so there's a guy named Amin Malouf, a Lebanese guy who writes in French in the 1990s, I think wrote a book called In the Name of Identity, Violence and the Need to Belong."}, {"time": 6737, "text": "And that was his point is unless we can overcome this tribal mentality, this will not end well."}, {"time": 6749, "text": "But you said earlier something, Lex, that I think is profound and profoundly important."}, {"time": 6755, "text": "And that is you did not recoil in horror when I mentioned Kierkegaard's use of the term faith."}, {"time": 6764, "text": "And so I'm a big fan of faith and I'm not sure what that implies."}, {"time": 6776, "text": "And by the way, this is just a peripheral comment, but I find less resistance to Becker's ideas in our work when I'm in Jesuit schools."}, {"time": 6784, "text": "It's the Americans, the secular humanists who are most disinclined to accept these ideas."}, {"time": 6794, "text": "It's an important side comment because I think it's mostly because they don't think philosophically."}, {"time": 6801, "text": "I speak with a lot of scientists and I think that's my main criticism."}, {"time": 6807, "text": "I mean, that's the problem with science is it's so comforting to focus in on the details that you can escape thinking about the mystery of it all, the big picture things, the philosophical, like the fact that you don't actually know shit at all."}, {"time": 6823, "text": "So in terms of Jesuit, like that's the beauty of the experience of faith and so on is like, wherever that journey takes you is you actually explore the biggest questions of our world."}, {"time": 6841, "text": "So I don't see religion going away because I don't see humans as capable of surviving without faith and hope."}, {"time": 6847, "text": "And then everyone from the Pope to Elon Musk will acknowledge that it is a world that is unfathomably mysterious."}, {"time": 6869, "text": "And like it or not, in the absence of beliefs, here I'm Charles Peirce, the pragmatic philosopher, he just said beliefs are the basis of action."}, {"time": 6878, "text": "If you don't have any beliefs, you're paralyzed with indecision, whether we're aware of it or not, whether we like it or not, in order to stand up in the morning, you have to subscribe to beliefs that can never be unequivocally proven right or wrong."}, {"time": 6899, "text": "Well, then why do you maintain them?"}, {"time": 6899, "text": "Well, ultimately it's because of some form of faith."}, {"time": 6907, "text": "But also faith shouldn't be a dogmatic thing that you should always be leaping."}, {"time": 6917, "text": "I guess the problem with science or with religion is you can sort of all of a sudden take a step into a place where you're super confident that you know the absolute truth of things."}, {"time": 6930, "text": "And again, back to Socrates, Plato, back in the cave."}, {"time": 6930, "text": "At Skidmore, where I work, that's what I have the students read in their first week."}, {"time": 6937, "text": "And Plato's like, oh, look at all those poor bastards."}, {"time": 6944, "text": "They're in the cave, but they don't know it."}, {"time": 6944, "text": "And then they are freed from their chains."}, {"time": 6951, "text": "And they have to be dragged out of the cave, by the way, which is another interesting point."}, {"time": 6956, "text": "They don't run out."}, {"time": 6956, "text": "But that gets back to why people don't like to be divested of their comfortable illusions."}, {"time": 6962, "text": "But anyway, they get dragged out of the cave into the sunlight, which he claims is a representation of truth and beauty."}, {"time": 6967, "text": "And I say to the students, well, what's wrong with that?"}, {"time": 6973, "text": "And they're like, nothing."}, {"time": 6973, "text": "That's like awesome."}, {"time": 6973, "text": "And then I'm like, yo, dudes, you're out of the cave, but how do you know that you're not in another cave?"}, {"time": 6981, "text": "The illumination may be better."}, {"time": 6989, "text": "But the minute you think you're at the end of the proverbial intellectual slash epistemological trail, then you have already succumbed to either laziness or dogmatism or both."}, {"time": 7010, "text": "That's really well put."}, {"time": 7010, "text": "That's both terrifying and exciting that there's always a bigger cave."}, {"time": 7017, "text": "A little bit of an out there question, but I think some of the interesting qualities of the human mind is the ideas of intelligence and consciousness."}, {"time": 7023, "text": "So what do you make of consciousness?"}, {"time": 7031, "text": "So do you think death creates consciousness, like the fear of death, the terror of death creates consciousness and consciousness in turn magnifies the terror of death?"}, {"time": 7049, "text": "Like what is consciousness to you?"}, {"time": 7049, "text": "Don't ask me that."}, {"time": 7049, "text": "So now if I could answer that, you know, I'd be chugging rum out of a coconut with my Nobel prize that, you know, it's literally, you know, Steven Pinker, I do agree with his claim and I think how the mind works, that it is the key question for the psychological sciences broadly defined in the 21st century."}, {"time": 7082, "text": "Yeah, what is consciousness?"}, {"time": 7082, "text": "And I don't think it's an epiphenomenological afterthought."}, {"time": 7082, "text": "So a lot of people, I think Dan Wagner at Harvard, a lot of folks consider it just the ass end of a process that by the time we are aware of what it is, it's just basically an integrated rendering of something that's already happened."}, {"time": 7110, "text": "You know, evidently there's a half second delay between when something happens, you know, those studies and our awareness of it."}, {"time": 7123, "text": "And that's where like ideas of free will will step in."}, {"time": 7123, "text": "You can explain away a lot of stuff."}, {"time": 7127, "text": "And I think those are all important and interesting questions."}, {"time": 7127, "text": "I'm of the persuasion."}, {"time": 7135, "text": "I mean, even, not even, but Dawkins and the selfish gene is very thoughtful."}, {"time": 7135, "text": "Actually, in a lot of, it's actually more in notes than in the text of the book, but he's just like, it's hard for me to imagine that consciousness doesn't have some sort of important and highly adaptive function."}, {"time": 7163, "text": "And what Dawkins says is he thought about it in terms of just that we could do mental simulations, that one possibly extraordinary product of consciousness is to rather than find out often by adverse consequences through trying something would be to run mental simulations."}, {"time": 7190, "text": "And so one possibility is that consciousness is highly adaptive."}, {"time": 7195, "text": "Another possibility is Nicholas Humphrey, a British dude who wrote a book about, I think it's called Regaining Consciousness."}, {"time": 7201, "text": "And he hypothesized, I think this is 1980s, maybe even earlier, that consciousness arose as a way to better predict the behavior of others in social settings, that by knowing how I feel makes me better able to know how you may be feeling."}, {"time": 7218, "text": "This is like the rudiments of a theory of mind."}, {"time": 7227, "text": "And it really may not have had anything to do with intelligence, so much as social intelligence."}, {"time": 7237, "text": "So in that sense, consciousness is a social construct."}, {"time": 7237, "text": "It's just a useful thing for interacting with other humans."}, {"time": 7246, "text": "I don't know, but there seems to be something about realizing your own mortality that's somehow intricately connected to the idea of consciousness."}, {"time": 7259, "text": "Well, I think so also."}, {"time": 7259, "text": "So this is where, and Nietzsche, he said a solitary creature would not need consciousness."}, {"time": 7272, "text": "Well, I don't know what I think about that."}, {"time": 7272, "text": "And then he goes on to say that consciousness is the most calamitous stupidity by which we shall someday perish."}, {"time": 7278, "text": "And wow, I was like, dude."}, {"time": 7285, "text": "Relax."}, {"time": 7291, "text": "Say you were on an island alone, and you saw a reflection of yourself in the water."}, {"time": 7299, "text": "If you were alone your whole life."}, {"time": 7300, "text": "Yeah, great question."}, {"time": 7300, "text": "Nietzsche's view would be that your thoughts of yourself would never come to mind."}, {"time": 7308, "text": "I don't know how I feel about that, though."}, {"time": 7312, "text": "In a sense, this sounds weird, but in a sense, I feel like my mental conversation has always been with death."}, {"time": 7320, "text": "It's almost like another notion, like these visualizations of a death in the cloak."}, {"time": 7332, "text": "I always felt like I am a living thing, and then there's an other thing that is the end of me."}, {"time": 7339, "text": "And I'm having a conversation with that."}, {"time": 7339, "text": "So in a sense, that's the way I construct the fact that I am a thing is because there's somebody else that tells me, well, you won't be a thing eventually."}, {"time": 7356, "text": "So this feels like a conversation, perhaps, but that might be kind of this mental stimulation kind of idea."}, {"time": 7364, "text": "It's a conversation with yourself, essentially."}, {"time": 7372, "text": "Yeah, I don't know how I feel about that, but I tend to be in agreement with you when we're talking about economics more so that we're deeply social beings."}, {"time": 7380, "text": "It just feels like we're humans."}, {"time": 7391, "text": "I'm with Harari with the sapiens."}, {"time": 7391, "text": "We seem to construct ideas on top of each other, and that's fundamentally a social process."}, {"time": 7403, "text": "I think that's a fine book."}, {"time": 7403, "text": "It overlaps considerably with our take on these matters, and the fact that we get to these points, drawing on different sources, I think makes me more confident."}, {"time": 7419, "text": "It's so fascinating, just like reading your book, sorry, on a small tangent, that Sapiens is one of the most popular books in the world."}, {"time": 7426, "text": "And just reading your book is like, well, this sounds..."}, {"time": 7434, "text": "I don't know what makes a popular book."}, {"time": 7441, "text": "Well, if you want me to be petty and stupid, I will tell you that from time to time, we also wonder why our book... Like all books, people can take issue with it, but we thought it would be a bigger hit, that it would be more widely read."}, {"time": 7464, "text": "It's funny because I've..."}, {"time": 7464, "text": "I don't know if I have good examples because I forgot already, but I'm often saddened by Franz Kafka."}, {"time": 7471, "text": "I think he wasn't known in his life, but I always wonder these great..."}, {"time": 7477, "text": "Some of the greatest books ever written are completely unknown during the author's lifetime."}, {"time": 7486, "text": "And it's like, man, for some reason, it's again, it's that identity thing."}, {"time": 7493, "text": "I think, man, that sucks."}, {"time": 7496, "text": "Well, I'm comforted by that."}, {"time": 7496, "text": "So Van Gogh sold one painting in his life, and evidently Thoreau sold like 75 copies of Walden."}, {"time": 7504, "text": "Nietzsche's books did not sell well."}, {"time": 7512, "text": "And how did Ernest Becker sell?"}, {"time": 7512, "text": "His books are published by the free press and have sold more than any other books that they have published."}, {"time": 7526, "text": "It's a lot?"}, {"time": 7526, "text": "I don't know if it's like Jordan Peterson Millions, but it's hundreds of thousands."}, {"time": 7530, "text": "Was he respected?"}, {"time": 7530, "text": "I just don't see him..."}, {"time": 7537, "text": "I don't see him brought up as like in the top 10 philosophers of... No, not at all."}, {"time": 7543, "text": "So how far away is he?"}, {"time": 7543, "text": "Is he in the top 100 for people?"}, {"time": 7551, "text": "He's not brought up that often."}, {"time": 7551, "text": "Because again... Like your work is brought up more often."}, {"time": 7555, "text": "I think he's one of the great philosophers of the 20th century."}, {"time": 7563, "text": "So what we say, Lex, is that our goal, certainly when we first started and now just as much actually, but what I say at all my talks is, look, if these ideas have interest you enough to go read Ernest Becker, then this has been good."}, {"time": 7576, "text": "I consider him to be one of the most important voices of the 20th century who does not get the attention that he deserves."}, {"time": 7590, "text": "Similarly, our work I believe to be important because point by point we provide empirical corroboration for all of the claims."}, {"time": 7600, "text": "So that's literally the students that read The Denial of Death and then Escape from Evil."}, {"time": 7611, "text": "They're like, yeah, wow, every chapter of the book, you have studies."}, {"time": 7617, "text": "And I'm like, yeah, because for 40 years, if a Skidmore student said, oh, that's gotta be bullshit."}, {"time": 7624, "text": "I'm like, well, let's do a study."}, {"time": 7628, "text": "Let's do a study."}, {"time": 7628, "text": "And my own dreams are in creating robots and artificial intelligence systems that a human can love."}, {"time": 7634, "text": "And I think there's something about mortality and fear mortality that is essential for implementing in our AI systems."}, {"time": 7646, "text": "And so maybe can you comment on that?"}, {"time": 7646, "text": "So this is a different perspective on your work, which is like, how do we engineer a human?"}, {"time": 7661, "text": "Yeah, so, no, this is awesome, Lex."}, {"time": 7661, "text": "I'm delighted that you said that."}, {"time": 7661, "text": "First of all, and I may have mentioned this to you, and I can't remember because I am seeing now, when you first contacted me, I had just been told I have to learn more about your work because I'm working with some very talented people in New York and they're writing a screenplay for a movie about an artificial intelligence."}, {"time": 7692, "text": "It's a female AI set in like 30 years in the future."}, {"time": 7692, "text": "And basically the little twist, this is how I had to read Heidegger."}, {"time": 7704, "text": "So these people call me and they're like, we're making a movie."}, {"time": 7709, "text": "It's based on Becker and your work and Heidegger and this other philosopher, Levinas, and then another philosopher, Silvia Benzo, who's an Italian philosopher."}, {"time": 7725, "text": "And the long short story is the movie is about supposedly the most advanced artificial intelligence entity, an embodied one, and who... Human form?"}, {"time": 7743, "text": "Human form, who finds out, who is having essentially existential anxieties."}, {"time": 7743, "text": "And I think the project is called A Dinner with Her or something, and it doesn't really matter, but the punchline is that she finds out that her creator has made her mortal."}, {"time": 7759, "text": "And so the question is what happens phenomenologically and behaviorally to an artificial intelligence who now knows that it's mortal?"}, {"time": 7787, "text": "And it's actually the same question that you're posing."}, {"time": 7787, "text": "And that is, is that necessary in order for an AI to approximate humanity?"}, {"time": 7803, "text": "Yeah, I think, yeah."}, {"time": 7803, "text": "So the intuition, again, it's unknown, but I think it's absolutely, I think it's absolutely necessary."}, {"time": 7808, "text": "A lot of people, the same kind of shallow thinking that people have about our own end of life, our own death, is the same way people think of, I think, about artificial intelligence."}, {"time": 7823, "text": "It's like, well, okay, so yeah, so within the system, there's a terminal position where there's a point at which it ends, the program ends, there's a goal state, there's a, you reached an end point."}, {"time": 7838, "text": "But the thing is, making that end a thing that's also within the program, like making the thing, and then it's also the mystery of it."}, {"time": 7849, "text": "So the thing is, we don't know what the hell this death thing is."}, {"time": 7857, "text": "I mean, it's not like we, I mean, the program doesn't give us information about the meaning of it all."}, {"time": 7866, "text": "And that's where the terror is."}, {"time": 7866, "text": "And it feels like, I mean, in the language that you would think about is the terror of this death, or like anticipation of it, or thinking about it, is the creative force that builds everything."}, {"time": 7884, "text": "And that feels like, you know, that feels really important to implement."}, {"time": 7884, "text": "Again, it's very difficult to know how to do technically, currently, but it's important to think about."}, {"time": 7897, "text": "What I find is, you mentioned like screenplays and so on, is sci fi folks and philosophers are the the only ones thinking about it currently."}, {"time": 7905, "text": "And that's what these folks have convinced me."}, {"time": 7910, "text": "And engineers aren't, which is, I get, yeah, most of the things I talk about, I get kind of people roll their eyes from the engineer perspective."}, {"time": 7923, "text": "Not these folks."}, {"time": 7923, "text": "They're like, because again, I saw your name and they're like, wait a minute, I've just seen that."}, {"time": 7928, "text": "They're like, here's someone."}, {"time": 7933, "text": "You should check out."}, {"time": 7934, "text": "So this was a delightful conference."}, {"time": 7937, "text": "I was a huge fan of your work and Ernest Becker."}, {"time": 7937, "text": "And it's funny that not enough people are talking about it."}, {"time": 7947, "text": "I think that there's a possibility to create real deep, meaningful connections between AI systems and humans."}, {"time": 7958, "text": "And I think some of these things of fear mortality are essential, are essential for the element of human experience."}, {"time": 7964, "text": "I don't, I don't think it might be essential to create general intelligence, like very intelligent machines, but to create a machine that connects to human in some deep way."}, {"time": 7977, "text": "What's your view, not to make me the interviewer, but what's your view about machine ethics?"}, {"time": 7977, "text": "Can you imagine an ethical AI without some semblance of finitude, let's say?"}, {"time": 7996, "text": "Well, I think ethics is a, there's a trolley problem that's often used in the work that I've done at MIT with autonomous vehicles in particular."}, {"time": 8010, "text": "Oh, yeah, yeah."}, {"time": 8011, "text": "That people, I think they offload, they ask, like, how would a machine deal with an ethical situation that they themselves, the humans don't know how to deal with?"}, {"time": 8024, "text": "And so I don't know if a machine is able to do a better job on difficult ethical questions, but I certainly think to behave properly and effectively in this world is a very important thing."}, {"time": 8040, "text": "Effectively in this world, it needs to be, have a fear of mortality and like be able to even dance."}, {"time": 8046, "text": "Because I don't think you can solve ethical problems, but you have to, I think like ethics is like a dance floor."}, {"time": 8050, "text": "You have to just, you have to dance properly with the rest of the humans."}, {"time": 8057, "text": "Like if people are dancing tango, you have to dance in the same kind of way."}, {"time": 8061, "text": "And for that, you have to have a fear of mortality."}, {"time": 8061, "text": "Like I think of, more practically speaking, as I said, autonomous vehicles, like the way you interact with pedestrians fundamentally has to have a sense of mortality."}, {"time": 8073, "text": "So when pedestrians cross the road, now I've watched, well, certainly 100 plus hours of pedestrian videos."}, {"time": 8088, "text": "There's a kind of social contract where you walk in front of a car and you're putting your life in the hands of another human being."}, {"time": 8099, "text": "And like death is in the car, in the game that's being played, death is right there."}, {"time": 8107, "text": "It's part of the calculus."}, {"time": 8107, "text": "It's not, but it's not like a simple calculus."}, {"time": 8107, "text": "It's not a simple equation."}, {"time": 8111, "text": "I mean, I don't know what it is, but it's in there and it has to be part of the optimization problem."}, {"time": 8160, "text": "I don't see the, the thing is, I think it's really important to think about, I can be honest enough to say that it's, I haven't been able to figure out how to engineer any of these things."}, {"time": 8172, "text": "But I do think it's really, really important."}, {"time": 8172, "text": "Like I have, so I have a bunch of Roombas here."}, {"time": 8177, "text": "I can show it to you after that."}, {"time": 8177, "text": "Roombas is a robot that does vacuums the floor and I've had them make different sounds."}, {"time": 8185, "text": "Like I had them scream in pain and it, you immediately anthropomorphize and it creates, I don't know, knowing that they can feel pain."}, {"time": 8205, "text": "See, I'm speaking, like knowing that I immediately imagine that they can feel pain and it immediately draws me closer to them, the human experience."}, {"time": 8212, "text": "And that there's something in that that should be engineered in our systems, it feels like."}, {"time": 8219, "text": "I believe, personally, I don't know what you think, but I believe it's possible for a robot and a human to fall in love, for example, in the future."}, {"time": 8234, "text": "Oh, I think it's, yeah, it's already there."}, {"time": 8238, "text": "No, there's a certain kind of deep connection with technology."}, {"time": 8238, "text": "I mean, a real, like you would choose to marry."}, {"time": 8244, "text": "I mean, again, it sounds, I'll find a book title and I'll send it to you."}, {"time": 8244, "text": "And it's a serious consideration of people who started out with these sex dolls, but it turned into a relationship of enduring significance that the woman who wrote the book is not willing to dismiss as a perversion."}, {"time": 8270, "text": "Yeah, that's what, you know, people kind of joke about sex robots, which is funny."}, {"time": 8270, "text": "Like, it's a funny, I mean, there's a lot of stuff about robots."}, {"time": 8276, "text": "It's just kind of fun to talk about that is not necessarily connected to reality."}, {"time": 8280, "text": "People joke about sex robots, but if you actually look how sex robots, which are pretty rare these days, are used, they're not used by people who want sex."}, {"time": 8296, "text": "They're actually, They're kind of, They're actually, They're companions."}, {"time": 8301, "text": "They become companions."}, {"time": 8304, "text": "It's, yeah, it's fascinating."}, {"time": 8304, "text": "And they're just, we're not even talking about any kind of intelligence."}, {"time": 8309, "text": "We're talking about just, I mean, human beings seek companionships."}, {"time": 8313, "text": "We're deeply lonely."}, {"time": 8313, "text": "I mean, that was the other sense I have that I don't know if I can articulate clearly."}, {"time": 8317, "text": "You can probably do a better job, but I have a sense that there's a deep loneliness within all of us."}, {"time": 8325, "text": "In the face of death, it feels like we're alone."}, {"time": 8328, "text": "So, you know, the, what drew me to the existential take on things, Lex, was the, who is it, Rollo May and Erwin Yallem write about existentialism and they're like, look, what, there's different flavors of existentialism, but they all have in common, what is it, four universal concerns."}, {"time": 8356, "text": "The overriding one is about death."}, {"time": 8356, "text": "And that next is choice and responsibility."}, {"time": 8366, "text": "The next one is existential isolation."}, {"time": 8366, "text": "And they're like, that's one of the things about consciousness that, and the last one is meaninglessness, but the existential isolation point is, you know, we are by virtue of consciousness able to apprehend that unless you're a Siamese twin, you are fundamentally alone."}, {"time": 8395, "text": "And because it is claimed, it's Eric Fromm in a book called Escape from Freedom."}, {"time": 8403, "text": "He's like, look, you're smart enough to know that the most direct way that we typically communicate with our fellow human beings is through language."}, {"time": 8418, "text": "But you also know that language is a pale shadow of the totality of our interior phenomenological existence."}, {"time": 8425, "text": "Therefore, there's always going to be times in our lives where even under the best of circumstances, you could be trying desperately to convey your thoughts and feelings and somebody listening could be like, yeah, I get it, I get it, I get it."}, {"time": 8440, "text": "And you're like, you have no fucking idea what I'm talking about."}, {"time": 8447, "text": "So you can be desperately lonely in a house where you live with 10 people in the middle of Tokyo where there's millions."}, {"time": 8462, "text": "Yeah, it's the Great Gatsby."}, {"time": 8462, "text": "You could be alone in a big party."}, {"time": 8467, "text": "Maybe this is a small tangent, but let me ask you on the topic of academia, you're kind of, we talked about Jordan Peterson, there's a lot of sort of renegade type of thinkers, certainly in psychology, but it applies in all disciplines."}, {"time": 8480, "text": "What are your thoughts about academia being a place to harbor people like yourself?"}, {"time": 8489, "text": "People who think deeply about things, who are not constrained by sort of the, I don't think you're quite controversial."}, {"time": 8507, "text": "But you are a person who thinks deeply about things and it feels like academia can sometimes stifle that."}, {"time": 8516, "text": "So my concern right now, Lex, for young scholars is that the restrictions and expectations are such that it's highly unlikely that anybody will do anything of great value or innovation except for, and this is not a bad thing, but stepwise improvement of existing paradigms."}, {"time": 8549, "text": "So in simple English, I went to Princeton for a job interview 40 years ago and they're like, what are you going to do if we give you a job?"}, {"time": 8558, "text": "And I'm like, I don't know, I want to think about it and read."}, {"time": 8562, "text": "And I saw that that interview was over, the window of opportunity shut in my face and they actually called my mentors and they're like, what are you doing?"}, {"time": 8579, "text": "Tell this guy to buy some pants."}, {"time": 8579, "text": "I had hair down to my waist also."}, {"time": 8579, "text": "He's like, this guy looks like Charles Manson in Jesus."}, {"time": 8583, "text": "But the expectation is that you come to a post, you start publishing so that you can get grants."}, {"time": 8600, "text": "That's certainly true."}, {"time": 8600, "text": "But there's also kind of a behavioral thing."}, {"time": 8600, "text": "You said like long hair."}, {"time": 8604, "text": "There's a certain style of the way you're supposed to behave."}, {"time": 8604, "text": "For example, I'm wearing a suit."}, {"time": 8610, "text": "It sounds weird, but I feel comfortable in this."}, {"time": 8610, "text": "I wore it when I was teaching at MIT, I wore it to meetings and so on, the different, sometimes a blue and red tie, but that was an outsider thing to do at MIT."}, {"time": 8627, "text": "So there was a strong pressure to not wear a suit."}, {"time": 8633, "text": "And there's a pressure to behave, to have a hair thing, the way you wear your hair, the way you, this isn't like a liberal or a left or anything."}, {"time": 8637, "text": "It's just in tribes."}, {"time": 8644, "text": "And academia to me or a place, any place that dreams of having like renegade free thinkers, like really deep thinkers should in fact, like glorify the outsider."}, {"time": 8652, "text": "Should welcome just, should welcome people that don't fit in."}, {"time": 8666, "text": "No, that sounds weird, but I can just imagine an interview with at Princeton, I can imagine why aren't people, why aren't you at Harvard, for example, or MIT?"}, {"time": 8680, "text": "Well, so that, look, I would love to, I haven't lectured at MIT, but I've lectured at Harvard."}, {"time": 8688, "text": "I've gotten to lecture at almost every place that wouldn't consider me for a job."}, {"time": 8695, "text": "And I, well, a few things."}, {"time": 8695, "text": "I'm lucky because I go to Princeton, I'm like, I don't know what I want to do."}, {"time": 8704, "text": "And then two days later I go to Skidmore and I'm like, I don't know what I want to do."}, {"time": 8708, "text": "And they offer me a job later that day, which I declined for months because of the extraordinary pressure of my mentors who right mindedly felt that I wouldn't get much done there."}, {"time": 8724, "text": "But what they told me at Skidmore was take your time, show up for your classes and don't molest barnyard animals and you'll probably get tenure."}, {"time": 8731, "text": "And I'm like, I'll show up for my classes."}, {"time": 8735, "text": "We'll talk about it."}, {"time": 8737, "text": "That was the negotiation."}, {"time": 8739, "text": "Yeah, I negotiated, I drove a hard bargain."}, {"time": 8739, "text": "But honestly, Lex, that's, I feel I'm very committed to Skidmore because I was given tenure when our first terror management paper wasn't published."}, {"time": 8757, "text": "It took eight years to publish."}, {"time": 8757, "text": "It was rejected at every journal."}, {"time": 8757, "text": "And I submitted it as like a purple ditto sheet thing."}, {"time": 8763, "text": "I'm like, here's what I've been doing."}, {"time": 8763, "text": "Here's the reviews."}, {"time": 8763, "text": "Here's why I think this is still a pretty good idea."}, {"time": 8769, "text": "And I don't know that this would happen even at Skidmore anymore."}, {"time": 8775, "text": "But I was very lucky to be given the latitude and to be encouraged."}, {"time": 8775, "text": "I took classes at Skidmore."}, {"time": 8783, "text": "That's how I learned all this stuff."}, {"time": 8783, "text": "I graduated, I got a PhD unscathed by knowledge."}, {"time": 8789, "text": "We were great statisticians and methodologists, but we didn't have any substance."}, {"time": 8789, "text": "And I don't mean this cynically, but we were trained in a method in search of a question."}, {"time": 8799, "text": "So I appreciate having five years at Skidmore basically to read books."}, {"time": 8806, "text": "And I also appreciate that I look like this 40 years ago."}, {"time": 8814, "text": "And my view is that this is how I comported myself."}, {"time": 8814, "text": "Other people, the guy I learned the most from at Skidmore is now dead, a history professor, Ted Kuroda."}, {"time": 8830, "text": "He wore a bow tie."}, {"time": 8830, "text": "And there's another guy, Darnell Rucker, who taught me about philosophy."}, {"time": 8838, "text": "And he was very proper."}, {"time": 8838, "text": "And he had his jacket with the leather patches."}, {"time": 8845, "text": "But these guys weren't pompous at all."}, {"time": 8845, "text": "They were, this is the way I am."}, {"time": 8854, "text": "And I always felt that that's important that somebody who looks at you and says, oh, what a stiff, he's probably an MBA."}, {"time": 8864, "text": "Well, they're wrong."}, {"time": 8864, "text": "And someone who looks at me, when I first got to Skidmore, other professors would ask when I'd be coming to their office to empty the garbage."}, {"time": 8878, "text": "They just assumed, as in my twenties, they assumed I was housekeeping."}, {"time": 8884, "text": "I always felt that was important that the students learn not to judge an idea by the appearance of the person who pervades it."}, {"time": 8890, "text": "I guess this is such a high concern now because I personally still have faith that academia is where the great geniuses will come from and great ideas."}, {"time": 8907, "text": "I love hearing you say that."}, {"time": 8907, "text": "I still, and it's one of the reasons why I'm really apprehensive about the future of education right now in the context of the pandemic is that a lot of folks, a lot of these are Google type people who I don't, they're geniuses also, but I don't like this idea that all learning can be virtual and that much could happen."}, {"time": 8933, "text": "I'm big on embodied environments with actual humans interacting."}, {"time": 8940, "text": "I mean, there's so much to the university education, but I think the key part is the mentorship that occurs somehow at the human level."}, {"time": 8948, "text": "Like I've gotten a lot of flack, like this conversation where in person now, and I've even with Edward Snowden who done all interviews remote, I'm a stickler to in person."}, {"time": 8965, "text": "It has to be in person like, and a lot of people just don't get it."}, {"time": 8973, "text": "They're like, well, why can't, this is so much easier."}, {"time": 8978, "text": "Like why go through the pain?"}, {"time": 8978, "text": "Like I've traveled, I'm traveling in the next month to Paris for a single stupid conversation."}, {"time": 8986, "text": "Nobody cares about just to be in person."}, {"time": 8986, "text": "Well, it's important to me."}, {"time": 8992, "text": "I honestly, I was like this, and thank you for coming down to it."}, {"time": 8992, "text": "It's my pleasure, but again, it's very self serving."}, {"time": 9001, "text": "I've enjoyed this."}, {"time": 9001, "text": "I knew I was going to, but it's not about our enjoyment per se."}, {"time": 9006, "text": "Again, at the risk of sounding cavalier, there are a host of factors beyond verbal that I don't believe can be adequately captured."}, {"time": 9013, "text": "I don't care how much the acuity is decent on a zoom conversation."}, {"time": 9024, "text": "I feel again, I felt within five minutes that this was going to be for me easy in the sense that I could speak freely."}, {"time": 9035, "text": "I just don't see that happening so easily from a distance."}, {"time": 9045, "text": "Yeah, I tend to, well, I'm hopeful."}, {"time": 9045, "text": "I agree with you on the current technology, but I am hopeful on like some others on the technology eventually being able to create that kind of experience or quite far away from that, but it might be able to, my hope is, you know, I'm hopeful."}, {"time": 9063, "text": "I was at Microsoft in Seattle and I can't remember why."}, {"time": 9073, "text": "And no, I can't."}, {"time": 9073, "text": "I, that's how I'm in my early Mr. Magoo phase."}, {"time": 9073, "text": "And somebody there was showing us like a virtual wall where the entire wall, you know, when you're talking to somebody, so it's life size and they were beginning the, get the appearance of motion and stuff."}, {"time": 9095, "text": "It looked pretty."}, {"time": 9104, "text": "With virtual reality too, I don't know if you've ever been inside a virtual world."}, {"time": 9107, "text": "It's to me, it's I can just see the future."}, {"time": 9107, "text": "It's quite real in terms of like a terror of death."}, {"time": 9117, "text": "I'm afraid of heights."}, {"time": 9117, "text": "And there's, I don't know if you've ever tried, you should, if you haven't, there's a virtual reality experience where you can walk a plank."}, {"time": 9127, "text": "You can look down and man, I was on the ground like, I was like, I was afraid."}, {"time": 9127, "text": "I was deeply afraid."}, {"time": 9135, "text": "I was, it was, it was as real as, as anything else could be."}, {"time": 9135, "text": "And I mean, these are very early days of that technology, relatively speaking."}, {"time": 9143, "text": "I mean, I don't know what to do with that."}, {"time": 9143, "text": "Same with like crossing the street, we did these experiments across the street in front of a car and, you know, it's being run over by a car."}, {"time": 9155, "text": "It's just that, yeah."}, {"time": 9155, "text": "So there's a rich experience to be created there."}, {"time": 9165, "text": "We're not there yet, but, yeah."}, {"time": 9165, "text": "And I've seen a lot of people try, like you said, the Google folks, Silicon Valley folks try to create a virtual online education."}, {"time": 9179, "text": "I think they've raised really important questions."}, {"time": 9179, "text": "Like what makes the education experience fulfilling?"}, {"time": 9184, "text": "What makes it effective?"}, {"time": 9184, "text": "These are important questions."}, {"time": 9192, "text": "And I think what they highlight is we have no clue."}, {"time": 9192, "text": "Like, there's, Thomas Sowell wrote a book about, a recent book on charter schools."}, {"time": 9204, "text": "I would like to talk to him."}, {"time": 9204, "text": "Yeah, he's an interesting guy."}, {"time": 9211, "text": "We will disagree about a lot, but respectfully."}, {"time": 9211, "text": "Such a powerful mind."}, {"time": 9217, "text": "But he, I need to read, I've only heard him talk about the book, but he argues quite seemingly effectively that the public education system is broken."}, {"time": 9226, "text": "That we blame, he basically says that we kind of blame, like the conditions or the environment, but the upbringing of people, like parenting, blah, blah, blah, like the set of opportunities."}, {"time": 9245, "text": "But okay, putting that aside, it seems like charter schools, no matter who it is that attends them, does much better than in public schools."}, {"time": 9260, "text": "And he puts a bunch of data behind it."}, {"time": 9260, "text": "And in his usual way, as you know, just is very eloquent in arguing his points."}, {"time": 9267, "text": "So that to me just highlights, man, we don't, education is like one of the most important, it's probably the most important thing in our civilization, and we're doing a shitty job of it."}, {"time": 9279, "text": "In academia, in university education and, you know, younger education, the whole thing."}, {"time": 9289, "text": "And yet, we value just about anyone or anything more than educators."}, {"time": 9299, "text": "You know, part of it is just the relatively low regard that Americans have for teachers."}, {"time": 9307, "text": "Also similarly, like just people of service."}, {"time": 9318, "text": "I think great teachers are the greatest thing in our society."}, {"time": 9318, "text": "And I would say, now on a controversial note, like Black Lives Matter, you know, great police officers is the greatest thing in our society."}, {"time": 9333, "text": "Also, like all people that do service, we undervalue cops severe, like this whole defund the police is missing the point."}, {"time": 9340, "text": "And it's a stupid word."}, {"time": 9340, "text": "I'm with you on that, Lex."}, {"time": 9347, "text": "Our neighbors to one side of our house are three generations of police, our neighbors across the street are police."}, {"time": 9354, "text": "They know my, you know, political predilections."}, {"time": 9354, "text": "And we've gotten along fine for 30 years."}, {"time": 9368, "text": "And I go out and tell them every day, you know, when you go in today, you tell the people on the force that I appreciate what they're doing."}, {"time": 9374, "text": "I think it's really important to not tribalize those concerns."}, {"time": 9385, "text": "I mean, we mentioned so many brilliant books and philosophers, but it'd be nice to sort of in a focused way, try to see if we can get some recommendations from you."}, {"time": 9405, "text": "So what three books, technical or fiction or philosophical had a big impact in your life and you would recommend."}, {"time": 9414, "text": "Spent four hours driving here, perseverating about that."}, {"time": 9422, "text": "I didn't, I, everything else you sent me as fine."}, {"time": 9422, "text": "And I actually, I skimmed it and I'm like, I don't want to look at it because I want, I want us to talk."}, {"time": 9428, "text": "The ones in blue."}, {"time": 9428, "text": "I'm like, all right."}, {"time": 9435, "text": "And you know, I've already said that I've found backers work and I put the denial of death out there."}, {"time": 9444, "text": "Um, is that his best, sorry, a small tangent."}, {"time": 9444, "text": "Is there other books that of his?"}, {"time": 9451, "text": "If I could have this count as one that the, the birth and death of meaning, the denial of death and escape from evil are three books of Ernest Becker's that I believe to all be profound in a, in a little sort of brief dance around topics."}, {"time": 9464, "text": "Um, I've only read denial of death."}, {"time": 9473, "text": "Like, well, how do those books connect in here?"}, {"time": 9473, "text": "So the, the birth and death of meaning is where Becker situates his thinking in more of an evolutionary foundation."}, {"time": 9477, "text": "So I like that for that reason."}, {"time": 9487, "text": "Escape from evil is where he applies the ideas in the denial of death more directly, um, to economic matters and to inequality and also to our inability to peacefully coexist with other folks who don't share our beliefs."}, {"time": 9507, "text": "So I would put Ernest Becker out there as one."}, {"time": 9512, "text": "Um, I also like novels a lot."}, {"time": 9512, "text": "And here I was like, God damn it."}, {"time": 9512, "text": "No matter what I say, I'm going to be like, yes, but, but the existentialists, do you like all those folks?"}, {"time": 9528, "text": "You like that literary existential?"}, {"time": 9528, "text": "But I mean, you know, I, I've read all those books."}, {"time": 9536, "text": "I will tell you the last line of the plague."}, {"time": 9536, "text": "We learn in times of pestilence that there's more to admire in men than to despise."}, {"time": 9543, "text": "And I love that."}, {"time": 9543, "text": "Plagues such a, I don't know."}, {"time": 9543, "text": "I, I find the plague is a brilliant before, before, uh, the plague has come to us in 2020."}, {"time": 9557, "text": "I, it was just a book about love about, but I'll toss a one that may be less known to folks."}, {"time": 9557, "text": "I'm enamored with a novel by a woman named Carson McCullers written in 1953 called clock without hands."}, {"time": 9572, "text": "And I find it a brilliant literary depiction of many of the ideas that we have spoken about."}, {"time": 9581, "text": "Fiction?"}, {"time": 9582, "text": "Fiction."}, {"time": 9583, "text": "What's, uh, what kind of ideas are we talking about?"}, {"time": 9585, "text": "Oh, it, it, all of the existential ideas that we have encountered today, but in the context of a story of someone who finds out that he is terminally ill, it's set in the South and the, um, heyday of like segregation."}, {"time": 9599, "text": "So there's a lot of social issues, a lot of existential issues, but it's basically a novel, a fictional account of someone who finds out that they're terminally ill and who reacts originally as, um, uh, you might expect anyone, uh, becomes more, um, hostile to people who are different, like petty and stupid denies that anything's happening."}, {"time": 9632, "text": "But, uh, as the book goes on and he comes more to terms, um, with his own mortality, um, it ends lovingly."}, {"time": 9641, "text": "And then, uh, back to your idea about, you know, love being incredibly potent."}, {"time": 9653, "text": "That's the, the nice thing, as you mentioned, uh, before with, with Heidegger, I really liked that idea."}, {"time": 9659, "text": "And I've seen that in people who are terminally ill is they bring, you know, the idea of death becomes, uh, current."}, {"time": 9666, "text": "It becomes like a thing, you know, I could die."}, {"time": 9674, "text": "I really liked that idea."}, {"time": 9674, "text": "I, I can die."}, {"time": 9674, "text": "Not just tomorrow, but like now, now, now."}, {"time": 9681, "text": "Uh, that's a really useful, I don't even know."}, {"time": 9681, "text": "I think I've been too afraid to even think about that."}, {"time": 9688, "text": "Like, like, like sit here and think like in five minutes, in five minutes, it's over."}, {"time": 9699, "text": "This is five minutes."}, {"time": 9701, "text": "So that would be my most recent addition as I really am struck by Heidegger."}, {"time": 9710, "text": "Would you recommend that?"}, {"time": 9711, "text": "Well, if you have a few years, I remember I tuned out being in time."}, {"time": 9713, "text": "I was like, I tried to read it."}, {"time": 9713, "text": "I was like, that's it."}, {"time": 9717, "text": "It took me 40 years to read Ulysses that could not get past the first five pages."}, {"time": 9717, "text": "And it took me 40 years to read being in time."}, {"time": 9725, "text": "It's a slog."}, {"time": 9730, "text": "And I took a James Joyce course in college."}, {"time": 9730, "text": "So I've, uh, I, I even, uh, I, I guess read parts of Finnegan's Wake."}, {"time": 9740, "text": "But like, there's a difference between reading and like, I don't think I understood anything."}, {"time": 9747, "text": "I like his, uh, short stories on the dead, the dead."}, {"time": 9750, "text": "And, um, I like Faulkner, Absalom."}, {"time": 9750, "text": "Absalom is a, is a fine book."}, {"time": 9757, "text": "But would you, uh, is there something Heidegger connected in a book you would recommend or no?"}, {"time": 9763, "text": "So maybe I got to abandon him."}, {"time": 9763, "text": "I mean, I mean, being in time is, is awesome."}, {"time": 9763, "text": "Um, but here's an interesting thing and not to get all academic, but, you know, it's, there's two parts to it."}, {"time": 9775, "text": "And most of the, most philosophers are preoccupied with the first part."}, {"time": 9782, "text": "It's in the second part where he gets into all the flight from death stuff and this idea of, you know, a turning and philosophers don't like that."}, {"time": 9794, "text": "And I'm like, this is where he's starting to really shine, to really shine for me."}, {"time": 9799, "text": "That's a beautiful set of books."}, {"time": 9799, "text": "So what, um, advice would you give to a young person today about their career, about life, about, uh, how to survive in this world full of suffering?"}, {"time": 9816, "text": "Um, my advice is to get competent advice."}, {"time": 9816, "text": "That's what I tell my students that don't listen to me."}, {"time": 9825, "text": "Don't listen to me."}, {"time": 9825, "text": "Well, you know, I think, um, my, my big piece of advice these days is, you know, again, it's at the risk of sounding like a simpleton, but it's to emphasize a few things."}, {"time": 9841, "text": "One is, um, you know, so, uh, one of your questions I think was, you know, what's the meaning of life."}, {"time": 9852, "text": "And of course, the existentialists say life has no meaning, but it doesn't follow from that, that it's intrinsic, that it's meaningless."}, {"time": 9864, "text": "You know what the existential point is not that life is meaningless so much as it doesn't have one inevitable and intrinsic meaning, you know, which then it opens up, uh, you know, I think it was Kierkegaard who said consciousness gives us the possibility of possibilities."}, {"time": 9884, "text": "And, but there's another lunatic Oswald Spangler who wrote a book called, uh, decline of the West."}, {"time": 9892, "text": "And he says that the philosopher, the German philosopher Gerta, he says, the purpose of life is to live."}, {"time": 9899, "text": "And I let that's, so that's one of my pieces of advice."}, {"time": 9907, "text": "So the possibility of possibilities, it's interesting."}, {"time": 9907, "text": "So what do you do with this kind of sea of possibilities?"}, {"time": 9912, "text": "Like, well, this is one of the, when, when young folks talk to me, especially these days, uh, is there swimming in a sea of possibilities?"}, {"time": 9924, "text": "Well, so this is great."}, {"time": 9924, "text": "And so that's another existential point, which is that we yearn for freedom."}, {"time": 9930, "text": "We react vigorously when we perceive that our choices have been curtailed and then we're paralyzed by indecision in the wake of seemingly unlimited possibilities, because we're not choking on choice."}, {"time": 9946, "text": "And, and I'm not sure if this is helpful advice or not, but what I say to folks is that the fact of the matter is, is the, you know, for most people, choice is a first world problem."}, {"time": 9963, "text": "And sometimes the best option is to do something as silly as it sounds."}, {"time": 9976, "text": "And then if that doesn't work, do something else, which just sounds like my mom torturing me, uh, when I was young."}, {"time": 9981, "text": "But you know, part of the thing that I find myself singularly ill equipped is that we're at the, I may be at the tail end of the last generation of Americans where you like picked something and that's what you did."}, {"time": 9998, "text": "Like I've been at a job for 40 years where you can expect to do better than your parents cause those days are gone."}, {"time": 10010, "text": "And where you can make a comfortable inference that the world in a decade or two will have any remote similarity to the one that we now inhabit."}, {"time": 10025, "text": "But still you recommend just do."}, {"time": 10028, "text": "And to do so I'm again, I'm, this is, I'm so back to the Heidegger guy because, all right, I may, you know, I consider myself a professor, but what happens if most of the schools go out of business?"}, {"time": 10042, "text": "Somebody else may consider themselves a restaurant tour, but what happens if there's no more restaurants?"}, {"time": 10048, "text": "So what I, this is negative advice, but I tell folks, don't define yourself as a social caricature."}, {"time": 10056, "text": "Don't, don't limit how you feel about yourself by, through identification with a host of variables that may be uncertain."}, {"time": 10081, "text": "Maybe temporary."}, {"time": 10082, "text": "And temporary."}, {"time": 10083, "text": "What, let's say."}, {"time": 10084, "text": "No, but of course that gets back to your point earlier, Lex, where you're like, yeah, but when you step out of that, it's extraordinarily discombobulating."}, {"time": 10095, "text": "So what, I think you talked about an ax of chopping wood and soul from Socrates."}, {"time": 10104, "text": "What is your soul?"}, {"time": 10104, "text": "What is the, the essence of Schellen?"}, {"time": 10113, "text": "That was like, awesome."}, {"time": 10116, "text": "Like when God, when you, when you show up at the end of this thing, he kind of looks at you, he's like, oh yeah, yeah, I remember you."}, {"time": 10125, "text": "Well, you know, I, to be honest, what I muse about, is to me, the, when, when people are, I told you, I have to, we have two kids, late 20s, early 30s."}, {"time": 10145, "text": "And over the years, when people, when we meet people that know our kids and they're like, oh, your kids are kind and decent."}, {"time": 10153, "text": "And I'd be like, that's what I would like to be."}, {"time": 10162, "text": "Because I think intelligence is vastly overrated."}, {"time": 10162, "text": "You know, the Unabomber was a smart guy."}, {"time": 10168, "text": "And I do admire intelligence and I do venerate education and I find that to be tremendously important."}, {"time": 10175, "text": "But if I had to pay the ultimate homage to myself, it would be to be known as somebody who takes himself too seriously to take myself too seriously."}, {"time": 10191, "text": "Again, as corny as it sounds, I'd like to leave the world a time when I can be known as somebody who takes himself too seriously."}, {"time": 10201, "text": "Again, as corny as it sounds, I'd like to leave the world a tad better than I found it, or at least do no harm."}, {"time": 10214, "text": "And, I think you, I think you did all right in that, in that regard."}, {"time": 10220, "text": "I love that question, Alex."}, {"time": 10220, "text": "That's a good one."}, {"time": 10220, "text": "I think everyone should be asked that."}, {"time": 10226, "text": "I think there's a lot of lingering questions around it."}]}]