[{"title": "Jimmy Pedro: Judo and the Forging of Champions | Lex Fridman Podcast #236", "id": "uy1fX2vOAEE", "quotes": [{"time": 299, "text": "I think you have to go by that because there's so many phenomenal judo players that have come through the system of spectacular judo."}, {"time": 307, "text": "You have won countless major events, but the ability to pull it together, those magical moments, the pinnacle of the sport, the world championships, the Olympic games, and proving that you can do it time and time again makes you unstoppable, it makes you the best."}, {"time": 324, "text": "There was a guy back in the 70s and 80s by the name of Fuji and he won four world championships back to back."}, {"time": 332, "text": "And back then, the Worlds was every two years."}, {"time": 335, "text": "So here he was, a four time world champion."}, {"time": 337, "text": "That's eight years the top of the sport."}, {"time": 339, "text": "He never won an Olympic medal."}, {"time": 343, "text": "He never went to the Olympics."}, {"time": 345, "text": "So there's a guy who missed out on Olympic greatness, but was arguably the best competitor back in that period."}, {"time": 352, "text": "By the way, same Fuji as Fuji?"}, {"time": 357, "text": "Really, okay."}, {"time": 358, "text": "Wow, I didn't know there was an actual guy, Fuji."}, {"time": 360, "text": "Our brand is named after the mountain, Mount Fuji."}, {"time": 363, "text": "But this is a different guy, his name was Fuji."}, {"time": 365, "text": "All right, well, history rhymes."}, {"time": 370, "text": "What about Teddy Renier?"}, {"time": 373, "text": "10 time world champ, I think, two time gold medalist at the Olympics, two times bronze medalist at the Olympics."}, {"time": 382, "text": "Probably the most dominant judoka ever."}, {"time": 386, "text": "Is he in the running?"}, {"time": 387, "text": "What do you think about that guy?"}, {"time": 389, "text": "I think he's a freak of nature, Teddy."}, {"time": 392, "text": "If you look at the size, just how tall he is, how big he is, how physical he is of a specimen."}, {"time": 398, "text": "I sat next to him on a bus, and his legs are literally the size of my waist."}, {"time": 405, "text": "When you sit next to him and just look at the size, he's a big man."}, {"time": 409, "text": "So obviously to win 10 world titles in the sport of judo, I mean, that's almost an incomprehensible feat, two time Olympic champion, again, that puts him in one of the maybe 10 or 12 people to ever do that in the history of the sport."}, {"time": 428, "text": "So he's definitely got to be in the running for the best."}, {"time": 431, "text": "But technically, I don't think he's as technical as some of the other, in terms of pure judo finesse technique."}, {"time": 441, "text": "He's powerful, he's explosive, he's dominant, he's strong."}, {"time": 446, "text": "Teddy also grips really, really well, which makes him that much tougher to beat."}, {"time": 452, "text": "Because a lot of times heavyweights, especially in the heavyweight division, a lot of them just grab the gi and they go man to man and judo to judo and take shots at each other."}, {"time": 461, "text": "And that's why a lot of them end up getting beat."}, {"time": 463, "text": "But Teddy's in control, like positionally, he stays in really good position and he controls his opponent the whole fight."}, {"time": 469, "text": "So they really don't have a chance against them."}, {"time": 472, "text": "He doesn't give them a chance to beat him, which is why he's been so dominant."}, {"time": 475, "text": "But he's not really stalling."}, {"time": 477, "text": "So I mean, he does have a really nice Osorogari, this backward trip, outside trip, in case people don't know."}, {"time": 487, "text": "And he has just like technically pretty good throws for heavyweight."}, {"time": 492, "text": "Heavyweights can be sometimes messy with their judo."}, {"time": 496, "text": "He's pretty technical and clean in the execution of his big throws."}, {"time": 504, "text": "But a lot of that probably has to do with the dominant gripping that he does."}, {"time": 508, "text": "It's not defensive gripping, it's offensive gripping, but the dominant gripping."}, {"time": 513, "text": "He controls the grips, he controls the movement of the match as a result of that, and then he creates his own openings."}, {"time": 519, "text": "So I mean, for a heavyweight, phenomenal technique, yes."}, {"time": 523, "text": "And what you said, messy, I'd like to call it sloppy, right?"}, {"time": 526, "text": "A lot of the heavyweights tend to be sloppy."}, {"time": 529, "text": "They're falling on the ground a lot."}, {"time": 531, "text": "It's hard to move somebody that weighs 350 pounds."}, {"time": 534, "text": "It's hard to get that body moving and just with a simple pull motion."}, {"time": 538, "text": "So he's definitely found a way to do it."}, {"time": 540, "text": "But he's also, I don't know, six foot eight."}, {"time": 543, "text": "He probably weighs 140 kilos."}, {"time": 546, "text": "He's a big boy."}, {"time": 547, "text": "But he had this winning streak of just, I don't know how long, but like over 100 matches."}, {"time": 553, "text": "And he lost at this Olympics that we just went through, the 20, I don't even know what to call it, 2021 Olympics."}, {"time": 560, "text": "I don't know the proper terminology."}, {"time": 562, "text": "Tokyo 2020 is what they call it."}, {"time": 564, "text": "Tokyo 2020, all right."}, {"time": 566, "text": "So he lost to Tamerlan Bashev."}, {"time": 571, "text": "I mean, it's always sad to see a sort of greatness come to an end."}, {"time": 575, "text": "It's like Karelin in wrestling and Greco Roman."}, {"time": 579, "text": "Did you shed a bit of a tear to see greatness go?"}, {"time": 582, "text": "Or is it just the way of life?"}, {"time": 586, "text": "I mean, what did you think about sort of this dominance, this run of dominance being stopped?"}, {"time": 593, "text": "I think, I mean, it's obviously sad to see LFC and champions succeed, especially people that are good people."}, {"time": 600, "text": "And I think Teddy's a good person."}, {"time": 602, "text": "I mean, I think there's some arrogant champions that everybody would like to see lose just because they don't wanna deal with their personality."}, {"time": 610, "text": "But I think Teddy's a very humble champion."}, {"time": 614, "text": "He's a people's champion."}, {"time": 615, "text": "You know, I think he's been privileged and he makes good money from the sport of judo and the French Federation has taken care of him well."}, {"time": 621, "text": "So he's a lifelong judo icon."}, {"time": 625, "text": "So it's sad to see somebody like that get beat, especially when this could have been his third Olympic title and just put him in infamy."}, {"time": 636, "text": "So it was sad to see, but I think, you know, every athlete goes through it, right?"}, {"time": 642, "text": "I mean, it's just, that's what the Olympics is all about."}, {"time": 645, "text": "The great ones fall sometimes and."}, {"time": 648, "text": "Especially in judo, it's like so, like the margin of error."}, {"time": 653, "text": "I mean, I guess the other question I wanna ask here is, in your sense, how difficult it is to not lose for so long?"}, {"time": 662, "text": "It seems like in judo, like a little mistake and it's over."}, {"time": 666, "text": "There's no coming back and Ippon means it's over."}, {"time": 673, "text": "It's hard to stay that dominant without question."}, {"time": 675, "text": "First of all, when you are the entire world is training against you just to beat you."}, {"time": 680, "text": "They're studying every single movement."}, {"time": 682, "text": "They're studying patterns."}, {"time": 684, "text": "They're trying to break it down and find a flaw in your game."}, {"time": 687, "text": "So everybody's hunting for you when you're the best in the world, especially at the Olympics."}, {"time": 691, "text": "That's the one to beat you at."}, {"time": 692, "text": "So everybody's focused on you."}, {"time": 695, "text": "And then there's an incredible amount of pressure on that athlete to perform."}, {"time": 698, "text": "You carry the flag for your country when you're at opening ceremonies sometimes."}, {"time": 703, "text": "There's all spotlight is on you."}, {"time": 706, "text": "And it's particularly hard when things don't go well early."}, {"time": 710, "text": "In other words, when you're expected to win and then all of a sudden now you're in a hard fight and it's not going the way you want, that pressure, the one who's the favorite feels the pressure the most at the Olympics."}, {"time": 721, "text": "And that's why I think the other ones are able to win it."}, {"time": 723, "text": "I've actually never gotten a chance to listen to Teddy Renner sort of explain ideas behind his Judo."}, {"time": 731, "text": "Like I wonder what his mental game is like because I think his English is pretty, not very good."}, {"time": 736, "text": "And so, and I just haven't seen good interviews, but it's always fascinating to, there's certain great athletes that are also great thinkers and speakers, like the Satya brothers in wrestling."}, {"time": 752, "text": "Again, not meaning, that's on my to do list, 100%, I'm going to Dagestan and talking to them because they're brilliant."}, {"time": 759, "text": "But to be able to sort of, maybe after retirement, to think back, what were the systems involved?"}, {"time": 766, "text": "Both on the technical, the training side, and then the mental side."}, {"time": 773, "text": "Because to stay that dominant, just like you're saying, everybody's studying to beat you."}, {"time": 780, "text": "And the heavyweights are just these powerful dudes."}, {"time": 783, "text": "So to be able to control them with your game and the game that everybody knows is coming is, I don't know, I don't know what's behind that, but there's got to be, it feels like the mental game is exceptionally important."}, {"time": 797, "text": "I think a lot of people underestimate just how important that side is."}, {"time": 802, "text": "Being mentally prepared for victory, mentally prepared to be the best, to stay the best."}, {"time": 809, "text": "There's no way that's weak minded that they can accomplish that."}, {"time": 813, "text": "It's 100% confidence and belief in yourself."}, {"time": 816, "text": "If we take a big picture view then, not necessarily Taylor Renner, but if you want to go from the very beginning, from day one of judo class to Olympic champion or Olympic medalist, what does it take to become an Olympic medalist in judo from start to finish?"}, {"time": 836, "text": "Like how many different trajectories do you see?"}, {"time": 838, "text": "Or is there some unifying principles?"}, {"time": 841, "text": "I think a lot of it has to, your journey is gonna depend a lot by where you're from."}, {"time": 847, "text": "So a path that an American might take versus somebody who's from Japan or somebody who's from Europe."}, {"time": 852, "text": "There's two very, three very distinct paths, right?"}, {"time": 856, "text": "Because in Japan, it's part of the culture."}, {"time": 860, "text": "There's a system of excellence."}, {"time": 862, "text": "There's elementary school judo, there's junior high school, there's high school, there's collegiate, there's Olympic and much like our wrestling is here in the United States, right?"}, {"time": 874, "text": "It's very similar, there's youth wrestling, there's high school, there's NCAA and then there's Olympic wrestling."}, {"time": 880, "text": "And when your country is a factory of producing athletes at the highest level, then all of those top athletes typically go back into the sport and there's professions for them."}, {"time": 892, "text": "They have an opportunity to coach at all those different levels."}, {"time": 895, "text": "And just the level of their game and the expertise that all of them have, even down at the elementary level, make their skill so solid."}, {"time": 904, "text": "And as a coach, in that situation, you can just sit back and watch who stands out as opposed to, I think in America, I guess, you would need to craft."}, {"time": 915, "text": "You don't get to choose from a thousand people, a few people that naturally stand out at the age of nine."}, {"time": 921, "text": "You have to actually, whatever the natural resources you're given, craft them into a champion."}, {"time": 930, "text": "So if we look at that, the American way, where you just have a person with a smile show up to your dojo, says I want to be an Olympic medalist, what process do you take them through?"}, {"time": 943, "text": "The odds are really insurmountable."}, {"time": 945, "text": "It's a very, very high hill to climb."}, {"time": 947, "text": "And there's only a few, there's only a few people and there's only a few coaches in this entire country that really understand that process and that can help people reach that level, as it's been proven, right?"}, {"time": 961, "text": "Number one, you certainly have to have a solid base, a fundamental base of an expectation of what the training is gonna be."}, {"time": 970, "text": "And it has to be a level of professionalism very, very early, where you're teaching all the basic judo moves, all the basic fundamental movements, posture, gripping."}, {"time": 980, "text": "Well, maybe gripping doesn't come in so early in the game, but throwing methodology, movements, niwaza position, standing fundamental throws."}, {"time": 990, "text": "And I think most importantly is really the work ethic, just the way you're gonna train, the intensity you're gonna train with, the ability to, mindset of going to tournaments constantly."}, {"time": 1002, "text": "In order to compete with the rest of the world, our young kids need to be tested a lot when they're young."}, {"time": 1009, "text": "They have to be put through adversity because they don't get put through adversity in training because you don't have that many good training partners."}, {"time": 1015, "text": "So you get put through adversity in competition and then we see what your weaknesses are and we continue to make improvements on those."}, {"time": 1022, "text": "But the journey is, it's long."}, {"time": 1025, "text": "And until they're kind of at the teenage years, they're gonna have to pretty much stay domestic, right?"}, {"time": 1030, "text": "Cause they gotta go through life as a normal kid, but they've gotta be training in the dojo at least, five days a week."}, {"time": 1037, "text": "Sometimes they might wanna get an extra technical workout in or doing some base conditioning in addition to that."}, {"time": 1043, "text": "And then really at the teenage years, that's where we really, we've struggled in America of keeping teens in the sport of Judo as well as developing them properly."}, {"time": 1054, "text": "Cause up until around the teenage years, I think the Americans are on par with the rest of the world in terms of technique and in terms of skill and we've proven we can compete with the rest of the world up until that age."}, {"time": 1066, "text": "But that's where Japan and that's where the Europeans and the countries that are strong in Judo, that's where they put a lot of time, energy and effort is it to the teens where they have a great coaching staff, they have good training camps with 800, a thousand people going to them every single weekend."}, {"time": 1085, "text": "When you say teens, what do you mean?"}, {"time": 1087, "text": "Do you mean literally like 13?"}, {"time": 1089, "text": "Yeah, age 13 to 17, 13 to 19."}, {"time": 1092, "text": "And that's where you really accelerate your development."}, {"time": 1095, "text": "So you're saying like in America, when you're young, like before nine, 10, 11, 12, you stick in Judo, you can progress quite a bit."}, {"time": 1106, "text": "But then I guess the other competition there, if you're into two people doing stuff to each other in a combative way, the other competitor in America is wrestling."}, {"time": 1121, "text": "So Judo almost primes you, like it teaches you how to be a great wrestler as well."}, {"time": 1127, "text": "And so then you have to have a hard decision because you can probably be a collegiate wrestler."}, {"time": 1134, "text": "You have like a clear plan of where you're going to go if you wanna be a wrestler."}, {"time": 1141, "text": "With Judo, that plan is less clear."}, {"time": 1147, "text": "So you have to be on your own a bit with your coach, that kind of thing."}, {"time": 1152, "text": "Okay, so when you're on your own with your coach, to me, that's just a fascinating journey because then it's just like the purity of it."}, {"time": 1159, "text": "It's the coach and the athlete and the dream."}, {"time": 1162, "text": "It's all about the dedication, the five, six, seven days a week competing, what, once a month, twice a month."}, {"time": 1173, "text": "Okay, but also, you probably don't have that conversation."}, {"time": 1176, "text": "I don't know if you do."}, {"time": 1177, "text": "Maybe you do, saying like, we're gonna do this for the next eight years."}, {"time": 1184, "text": "Do you ever sit down?"}, {"time": 1185, "text": "Would you just take it the David Goggins way, which is like, let's just take it one step at a time."}, {"time": 1192, "text": "Let's hope we're there in eight years."}, {"time": 1194, "text": "Yeah, let's hope we're there."}, {"time": 1195, "text": "Do you actually?"}, {"time": 1196, "text": "Like right now, you have to think about, the Olympics is gonna be in Los Angeles in 2028."}, {"time": 1203, "text": "Now would be the time, and now is the time, to identify talent and get commitment out of students that in seven years, you can make a US Olympic team because we're gonna have a full team."}, {"time": 1217, "text": "America's gonna have 14 athletes compete in those games, one in every weight class."}, {"time": 1221, "text": "So now's the time, if you're gonna go on a journey to the Olympics and stay with the sport of judo, now would be the time to do it, you know?"}, {"time": 1228, "text": "And so what, you show up to the Pedro Judo Center and how much drilling, how much technique, strategy discussions, how much randori, or like live sparring, how much conditioning and strength training, how much of all that?"}, {"time": 1249, "text": "How much of cross training to other gyms or something like that, traveling abroad?"}, {"time": 1253, "text": "Is there something to be said about some aspects of that system?"}, {"time": 1258, "text": "You need it all."}, {"time": 1259, "text": "What you just said, you need it all of it."}, {"time": 1261, "text": "And we do do all of that."}, {"time": 1262, "text": "Right now, we have a young group of kids at the Academy, you'll see tonight."}, {"time": 1265, "text": "Some of them are 14, 13, 15, 17."}, {"time": 1269, "text": "Are they good?"}, {"time": 1270, "text": "Yeah, really good."}, {"time": 1270, "text": "Okay, can't wait."}, {"time": 1272, "text": "They're right around your waist, so it'll be perfect."}, {"time": 1275, "text": "They're just young boys, but they've been training hard through COVID."}, {"time": 1280, "text": "We've been, Travis and myself have been training them."}, {"time": 1283, "text": "We share responsibilities."}, {"time": 1286, "text": "They're doing randori like five nights a week."}, {"time": 1288, "text": "We have them doing randori Tuesdays, Wednesdays, Thursdays, Fridays, and Sundays is when they're doing randori."}, {"time": 1296, "text": "They're coming to the dojo Friday night and Sunday night to do training."}, {"time": 1300, "text": "We also have technical sessions for them."}, {"time": 1302, "text": "They're in school now, so it's a little bit challenging, but they come five o clock in the afternoon and they do a technical session."}, {"time": 1308, "text": "Through COVID, they were coming every morning doing technical sessions."}, {"time": 1311, "text": "What's a technical session?"}, {"time": 1313, "text": "It's an hour of repetitive throwing or repetitive drilling to reinforce movements that we deem important to our successful system."}, {"time": 1323, "text": "So, niwaza positions, groundwork positions, where we want them to be put in this position and they're gonna drill it 50 times with resistance in big groups, doing drills over and over again, picking apart the details of the technique and what they're doing wrong, showing them how to fix it."}, {"time": 1339, "text": "But now, we've done it so much that now we can do a whole drill session with them where they know all the different techniques inside and out and they can move from position to position really quickly."}, {"time": 1349, "text": "Do they do it for a period of time, like two minutes, five minutes, or is it like one, two, they're actually counting?"}, {"time": 1357, "text": "No, sometimes it's both."}, {"time": 1358, "text": "So sometimes we do it for reps, sometimes we do it for time."}, {"time": 1362, "text": "So sometimes it might be as many as they can do in 60 seconds or as many as they can do in two minutes."}, {"time": 1368, "text": "And sometimes it might just be, I want you to do every position five times."}, {"time": 1371, "text": "In terms of throws, we're not talking about it on a crash pad, right?"}, {"time": 1376, "text": "We're talking about free moving around the mat."}, {"time": 1378, "text": "And just dynamically and just throwing."}, {"time": 1382, "text": "How many, because as I was mentioning to you offline, Travis threw me a few times, a lot of times when he was visiting in Austin, and I just remembered, so there's two things."}, {"time": 1395, "text": "Fortunately or unfortunately in my life, having gotten a chance to train with folks of that level, with just cleanness of throw and the power, and it was very nice."}, {"time": 1406, "text": "I immediately actually enjoyed being thrown like that."}, {"time": 1411, "text": "To throw a little shade at Craig Jones with his current mat situation, is they're very, they were quite thin."}, {"time": 1419, "text": "And as Travis commented on, and not just the thinness of the mats, but they were laid on like concrete, right?"}, {"time": 1425, "text": "So I felt, it's like soft until it's not."}, {"time": 1430, "text": "But being thrown very cleanly, I just felt like there's, this is not gonna lead to injury, it was great."}, {"time": 1437, "text": "It wasn't injury prone."}, {"time": 1439, "text": "But then as I mentioned to you, when a day or two after, my entire leg, one of them, I guess it's the left leg, was just black, a bruise."}, {"time": 1451, "text": "It didn't hurt too bad, but it was just, the body's gotten soft."}, {"time": 1454, "text": "So I guess the question I have is, does the body get used to just that number of throws?"}, {"time": 1461, "text": "Just over time, being thrown thousands of times a month?"}, {"time": 1466, "text": "Unquestionably."}, {"time": 1467, "text": "Your body gets used to it."}, {"time": 1468, "text": "So it hardens, it gets really hard."}, {"time": 1470, "text": "Which is why judo is hard to come back to after you've taken a long period of time off, because your body is not used to that impact anymore."}, {"time": 1479, "text": "I always found out that when I was training judo a lot, it's hard to shed weight and keep weight off, because your body, it develops this layer of protection on itself that it doesn't wanna give up."}, {"time": 1493, "text": "When you're sucking a lot of weight, that means you're frail."}, {"time": 1495, "text": "So I always seem to retain weight more when you're doing hard judo training, as opposed to losing weight."}, {"time": 1502, "text": "It's easy when you go out for runs and things like that to shed the water weight, but to actually keep the pounds off was pretty hard."}, {"time": 1509, "text": "Yeah, the body develops, like you said, a level of protection."}, {"time": 1512, "text": "What about the randori?"}, {"time": 1514, "text": "Just out of curiosity, again, I haven't ever had the opportunity to train with folks at a high level."}, {"time": 1522, "text": "In jiu jitsu, there's different gyms at different styles, but I've noticed that at the highest levels, people can go pretty hard in a certain kind of way where it's more technical, and you're moving at 100%, but the power is not at 100%."}, {"time": 1543, "text": "It's a weird little dance."}, {"time": 1546, "text": "You're not really forcing stuff."}, {"time": 1551, "text": "You're more focused on the right timing, the right positioning of hands and feet and body and all those kinds of things."}, {"time": 1559, "text": "You're not forcing stuff in the way you would in competition, like really the power."}, {"time": 1564, "text": "Does that sound similar to you for the way you try to do randori?"}, {"time": 1567, "text": "So there's different styles of judo, and I'd say the Japanese style, the technical style of judo is exactly what you just talked about."}, {"time": 1574, "text": "It's almost like two guys in pajamas, right?"}, {"time": 1578, "text": "We're using minimal effort, maximum efficiency."}, {"time": 1580, "text": "We're moving around, and we're trying to feel that movement, and it's timing and finesse and technique and fun and clean throws."}, {"time": 1588, "text": "And when you train in Japan, you can train 15 rounds of randori, five minute rounds."}, {"time": 1594, "text": "That's 75 minutes of straight sparring."}, {"time": 1598, "text": "You can do that straight in Japan without a problem."}, {"time": 1601, "text": "I mean, you'll get tired, of course."}, {"time": 1602, "text": "You're gonna fall a lot, you're gonna throw a lot, but it's very free feeling, and it's technical as you explained."}, {"time": 1610, "text": "But then when you go to Europe and you try to do rounds with the Europeans, they are very physical."}, {"time": 1615, "text": "They don't have that same finesse in their training that they do in Japan."}, {"time": 1620, "text": "In Europe, you'd be hard pressed to do eight rounds of randori in a night."}, {"time": 1624, "text": "It's so physically exhausting because so much effort is going into just fighting and fending off the gripping system and the power of your opponent."}, {"time": 1633, "text": "You're physically drained after eight rounds of randori."}, {"time": 1636, "text": "So it's a much different feel."}, {"time": 1638, "text": "When you say Europe, do you mean Germany, France, Britain, Russia?"}, {"time": 1642, "text": "Is there a lot?"}, {"time": 1643, "text": "So there's a kind of similarity to all of those kinds of approaches."}, {"time": 1648, "text": "The only difference would be Russia that they do a lot more active drilling, a lot more sequential movement training."}, {"time": 1655, "text": "They don't focus as much on randori."}, {"time": 1657, "text": "You'll do much fewer rounds in Russia during training camps than you would in those other countries we just talked about, France, Germany, et cetera."}, {"time": 1666, "text": "What about in this kind of American system where you have much less talent to work with?"}, {"time": 1675, "text": "Do you just select whatever works for the particular athletes, or do you have something you prefer in your system?"}, {"time": 1683, "text": "So you need a combination of all of it."}, {"time": 1685, "text": "If you're gonna win at the Olympic level, you have to be able to deal with the finesse of the Japanese, the physicality of the Europeans."}, {"time": 1692, "text": "You have to focus on the ground, niwaza aspect, because a lot of people are weak there in the world of the sport of judo."}, {"time": 1698, "text": "That's a chance to win."}, {"time": 1732, "text": "And I think that's the secret sauce to success for your Americans, because there's no way, if we don't have eight partners to train with in a night that are gonna give us good rounds, right?"}, {"time": 1742, "text": "We might have two, so we're gonna have the same guy four times, those two people four, two times each."}, {"time": 1747, "text": "Now I have four good rounds."}, {"time": 1749, "text": "The rest of the rounds, I'm not being pushed to the limit."}, {"time": 1751, "text": "So we train differently."}, {"time": 1754, "text": "And a lot of times we do a lot of stuff like shark bait."}, {"time": 1757, "text": "When our athletes are preparing for competition, for example, when Kayla or Travis were preparing for competition, we might only have 20 people in the whole gym to work out with, those two Olympic medalists, right?"}, {"time": 1769, "text": "And of those 20 people, maybe four of them are Travis's size."}, {"time": 1773, "text": "Maybe there's only one girl in the room for Kayla, she's gotta train with guys."}, {"time": 1777, "text": "And then the other ones are teenagers that are too weak to train with either one of them."}, {"time": 1781, "text": "So what we would do is just put together four or five people that could give them a challenge and we'd line them up and they would do a minute, a minute, a minute, a minute, and they'd do five minutes in a row as hard as they can."}, {"time": 1792, "text": "That person can go hard for a minute with Travis or Kayla."}, {"time": 1795, "text": "They can't go five minutes hard, but they can go one minute hard."}, {"time": 1798, "text": "So it made their training much, much more intense, much more physically demanding."}, {"time": 1803, "text": "And then rinse and repeat that six times or eight times in a night, they just got 40 minutes of intense randori."}, {"time": 1810, "text": "The person that was training with them that wasn't as good only had to do six or eight minutes of training the whole night, you know, so."}, {"time": 1816, "text": "It's so, it's so difficult because then you look at like the Russian national team and you have just the world champions and so, or you even have like, what is it, Tom Brands and Terry Brands in the wrestling system."}, {"time": 1839, "text": "You have like these people, it's a small group of people, but they're all some of the best people in the world and they're going head to head."}, {"time": 1847, "text": "And yeah, you don't necessarily get a good look kind of a variety of styles, but just the quality is there."}, {"time": 1855, "text": "And even that is missing for people your size in America, because that is so difficult to work with, which it makes Kayla's and makes Travis's story that much more amazing."}, {"time": 1868, "text": "You mentioned kind of picking whatever the set of techniques the athlete is naturally good at or prefers or whatever."}, {"time": 1876, "text": "How much specialization is there?"}, {"time": 1879, "text": "Maybe if I give you like two choices, is it good to have like one throw and try to become the best person in the world at that throw, or do you want to have a bunch of stuff?"}, {"time": 1891, "text": "Like a variety of throws?"}, {"time": 1892, "text": "Well, for Travis, it was Ippon Seinagi, that was his main throw, right?"}, {"time": 1896, "text": "But from that Ippon Seinagi, he had a variety of other attacks he could do, you know, that mixed it up so that you kept people guessing."}, {"time": 1904, "text": "Maybe it wasn't the Ippon Seinagi that was coming, maybe it was the Koshi Gruma that he did, or maybe it was the Ippon to Osoto that he did in combination."}, {"time": 1911, "text": "So you typically have one main throw that you do."}, {"time": 1915, "text": "For me, it was Tai Otoshi."}, {"time": 1916, "text": "For Kayla, it was her Ogoshi."}, {"time": 1918, "text": "For Travis, it was his Ippon Seinagi."}, {"time": 1921, "text": "But then you come up with a variety of other throws that you do from the very same grip."}, {"time": 1926, "text": "So whatever grip you take for your main throw, you wanna develop, you know, an arsenal of attacks that go in all different directions holding that same grip."}, {"time": 1935, "text": "So you keep your opponent guessing as to what's coming."}, {"time": 1938, "text": "You know, because if they're just sitting on one technique at the highest level of sport, with the exception of a few, right?"}, {"time": 1943, "text": "We talked about Ono's Uchi Mata."}, {"time": 1946, "text": "With the exception of a few, most of the world catches on pretty quick on how to beat you."}, {"time": 1950, "text": "There is something to just sticking, making sure you really dedicate to the main thing."}, {"time": 1956, "text": "So for Travis, that would be like the main version of his Seinagi."}, {"time": 1961, "text": "Like really making sure you don't forget to really put in the time on that."}, {"time": 1966, "text": "Because I mean, one way to say it is that threat being dangerous opens up a lot of things."}, {"time": 1977, "text": "But also, I don't know."}, {"time": 1980, "text": "I think I'm just, as a fan, I think it's sad when like elite level athletes in all like combat sports, kind of start taking their main thing for granted."}, {"time": 1992, "text": "Like they think, okay, I've figured that part out."}, {"time": 1996, "text": "Now I'll be working on all this whole system on variations, on different setups, on lefty versus, some like weird variation as opposed to, you know what?"}, {"time": 2007, "text": "If you look at some of the best people ever, they seem to have not cared about variations at all."}, {"time": 2012, "text": "They're just like literally, they are more like Jiro James of Sushi and like fine tuning their ear, their ability to detect the minute movements that give you an opening on that main thing."}, {"time": 2028, "text": "And so the whole time you're just waiting for that throw, you're like dancing with the like little bit of pressure and like releasing the pressure, putting the pressure, maybe a little bit of off balance and finding like the right moment to strike and focusing on that."}, {"time": 2045, "text": "Again, maybe that's just like a romanticization of like the simplicity of that."}, {"time": 2050, "text": "Maybe it is kind of impossible to do that on a large scale, but I just, yeah, I don't know if you can comment on that, whether there is some value in still putting in like tens of thousands of reps on the main, main thing."}, {"time": 2065, "text": "Well, unquestionably that has to happen."}, {"time": 2067, "text": "You still have to drill your main throw and you have to fine tune it and continue to do repetition after repetition and throws on the crash pad or throws on the mat, moving around, just explosive movements doing your main technique."}, {"time": 2080, "text": "You're never gonna forget that and you're not gonna put it to the side and not practice it anymore."}, {"time": 2084, "text": "It still has to be part of your repertoire and part of your daily training, but you do have to evolve."}, {"time": 2089, "text": "And I think that's the sport of judo, makes you evolve."}, {"time": 2094, "text": "When I look at, we talk about Koga from before, right?"}, {"time": 2096, "text": "And we talked about, he had a dynamic Ippon Seinagi that nobody could stop for years and years and years."}, {"time": 2101, "text": "But when people started to be unorthodox and come down his back and cross grip him and he couldn't get to the lapel, he had to come up with something else."}, {"time": 2110, "text": "And all of a sudden you saw Koga doing, now he did a Sode or now he did a Tomoe Nagi, which so he can, he added to his arsenal to keep people thinking, keep people guessing."}, {"time": 2120, "text": "So it's not, you're not just that one trick pony."}, {"time": 2122, "text": "They still couldn't stop his Ippon Seinagi once he got that grip."}, {"time": 2126, "text": "But if they stopped them from getting that grip or putting two hands on the gi, he had to go to something else."}, {"time": 2131, "text": "And that's what he did."}, {"time": 2132, "text": "Does Travis's or Koga's Seinagi make sense to you?"}, {"time": 2136, "text": "That weird, so when I, Because split hip, split hip."}, {"time": 2141, "text": "So I don't know if you know this, but like I got into judo because of Travis."}, {"time": 2145, "text": "I watched him at 2008 Olympics and I was, there's something about like, just not the cockiness, but the confidence and just the refusal to quit, the refusal to just, that energy, whatever it connected with me is like, oh, that guy's bad ass."}, {"time": 2161, "text": "I want to be bad ass like that."}, {"time": 2163, "text": "And then I also there happened to be in my university judo and I got into it and just fell in love with the elegance and the beauty and the power of the sport."}, {"time": 2173, "text": "But also I started to mimic Travis's game, his and Koga's."}, {"time": 2178, "text": "And then the instructors I worked with, they said that's the wrong way to do it."}, {"time": 2184, "text": "And I always, I never found somebody that told me like, no, that's not the wrong way."}, {"time": 2189, "text": "There's a lot of ways to do it."}, {"time": 2191, "text": "And there's like the classic way and you have to understand it and you have to learn it, but this is not the wrong way."}, {"time": 2196, "text": "Cause I was trying to find somebody who understands this throw."}, {"time": 2199, "text": "Cause it was so beautiful at the highest level, especially with Koga, the way you're able, the quickness with which you can strike, the fact that you can stand on the feet and the elevation you can get and the power you can get has certain throws, just like Uchimata doesn't look powerful."}, {"time": 2218, "text": "It's just like, it looks effortless."}, {"time": 2222, "text": "But like the standing Seinagi with a split hip, it just looks powerful because there's a, you're like, you're stepping into them, you're lifting the opponent and they still have, they're not surprised, they're now like helpless."}, {"time": 2237, "text": "Right, their feet are fluttering in the air."}, {"time": 2239, "text": "And then there's just this pause and then just big slam."}, {"time": 2243, "text": "With the Uchimata, it's almost like you don't know what hit you."}, {"time": 2247, "text": "It's like Taitoshi is the same."}, {"time": 2249, "text": "It's almost like a surprise."}, {"time": 2250, "text": "Like, oh shit, I'm now on my back."}, {"time": 2252, "text": "And so I just love that throw, but like it didn't make sense to me."}, {"time": 2260, "text": "Like when trying to explain it to others, when trying to learn, it didn't make sense to me how it works."}, {"time": 2266, "text": "Does it make sense to you?"}, {"time": 2268, "text": "I was born a Judoka, right?"}, {"time": 2270, "text": "So I've lived this stuff since I was an infant and I've seen every style and every technique."}, {"time": 2278, "text": "The split hip Saiyan Aiki is difficult to learn."}, {"time": 2280, "text": "It's harder to learn than the basic form, but it is powerful and it does, upon entry, both of your opponent's feet leave the mat at the same time."}, {"time": 2290, "text": "So you've got them."}, {"time": 2291, "text": "Once you enter, you've got them."}, {"time": 2292, "text": "You just gotta finish, right?"}, {"time": 2293, "text": "You just gotta lock them and turn and go."}, {"time": 2295, "text": "So it makes sense to me."}, {"time": 2297, "text": "My dad did teach me how to do that when I was younger."}, {"time": 2300, "text": "Yeah, he wanted me to do a split hip."}, {"time": 2301, "text": "We have kids at the school today that we teach the split hip Saiyan Aiki, same way, because it is that dynamic, right?"}, {"time": 2308, "text": "You don't drop to the ground and roll and turn."}, {"time": 2311, "text": "It's not the classic form where you're giving way to your opponent."}, {"time": 2314, "text": "It's actually, you go pick the guy up in the air and then you slam him, so."}, {"time": 2321, "text": "So maybe on a small tangent, so we're talking about elite level athletes in terms of Randori, in terms of like drilling."}, {"time": 2329, "text": "For more recreational athletes, like, you know, I have personally that situation going on, but there's other people that are just recreationally training Judo."}, {"time": 2340, "text": "How do you recommend they improve Judo?"}, {"time": 2343, "text": "Like if I wanted to compete a bunch and do reasonable with a particular set of throws, say the split Saiyan Aiki, so how do you do the Randori?"}, {"time": 2356, "text": "Do you use a crash pad to get in reps?"}, {"time": 2358, "text": "Do you, like, what do you recommend?"}, {"time": 2360, "text": "So I guess there's two recreational people that we're talking about."}, {"time": 2363, "text": "One is somebody who wants to learn Judo and become good at Judo, but doesn't necessarily want to compete, but just wants to get better."}, {"time": 2370, "text": "And I think that there's not enough emphasis in this country on paying attention to that type of student."}, {"time": 2377, "text": "Everybody pushes them to competition."}, {"time": 2380, "text": "But in reality, there's a huge audience of people out there that would love to learn Judo and be very proficient at Judo and have the skills to go execute if they ever needed it."}, {"time": 2390, "text": "And there's a class and there should be a program for that athlete."}, {"time": 2393, "text": "And that athlete does not need to do Randori."}, {"time": 2396, "text": "Like the sport of Judo is physical enough where you're picking somebody up all the time and moving their body weight around the mat all the time, where you can get very physically strong, very physically fit."}, {"time": 2407, "text": "Technically, you'll be better than somebody that does Randori more than you because if you learn good technique and you learn the movement and you learn the feel and you learn the timing, you'll actually be a better athlete than the person that just focuses on Randori who does ugly technique and wins with force."}, {"time": 2424, "text": "So we have a recreational class at our school where they don't do any Randori."}, {"time": 2430, "text": "They have an option afterwards if they want to stay for 15 minutes or stay for 30 minutes where they can participate in Randori."}, {"time": 2436, "text": "But most of the adult students choose not to because they're already so tired from the other hour class."}, {"time": 2442, "text": "It's a good workout."}, {"time": 2443, "text": "Right, they're already dripping sweat."}, {"time": 2444, "text": "They're already like, if you work hard and drill hard, it's an intense workout, you're exhausted."}, {"time": 2451, "text": "So that's a specific set of program, I should say, at every academy."}, {"time": 2457, "text": "And then if you want to get good and you want to compete, then to me, once you have your techniques, it's learning how to implement a good gripping system to put yourself in a position where you can always dominate the grips, control the movement, initiate the reactions from your opponent, and then have the opportunity to attack and score."}, {"time": 2482, "text": "And I think that when people train with, or when they jump into a higher level of the sport of judo, all of a sudden the first thing they say is, I can't attack."}, {"time": 2492, "text": "I don't know how to attack."}, {"time": 2493, "text": "Because positionally, they don't know where to put their hands."}, {"time": 2496, "text": "They don't know how to hold the gi properly."}, {"time": 2498, "text": "They don't understand that they're, they have an inferior grip, and they don't know how to get into better positions so they can't attack."}, {"time": 2506, "text": "And that's a big part of the game that not a lot of people really understand."}, {"time": 2509, "text": "So you really, even for recreational competitors, you really need to have a gripping system."}, {"time": 2514, "text": "You need to understand the gripping system."}, {"time": 2517, "text": "If you want to win."}, {"time": 2518, "text": "I mean, if the goal is to go and compete, that's a different story."}, {"time": 2521, "text": "You're going, I don't have fun getting beat up or losing in competitions."}, {"time": 2524, "text": "I enjoy the..."}, {"time": 2526, "text": "I don't even know if it's the winning or the losing."}, {"time": 2529, "text": "I don't think, I think this is what, because I competed a lot in both Judo and Jiu Jitsu, and in Judo, it feels like, because I didn't have a gripping system, it feels like you're not even playing Judo against the good black belts."}, {"time": 2544, "text": "You're, they're just, they're not, they're not even trying because they have, they get a certain kind of grip, and you just can't do anything."}, {"time": 2551, "text": "And I don't have a good answer for that."}, {"time": 2553, "text": "I don't even know what I'm looking for."}, {"time": 2554, "text": "And so it's not even fun."}, {"time": 2556, "text": "It's not like even losing."}, {"time": 2557, "text": "It's like, I don't know."}, {"time": 2560, "text": "It's like you didn't even show up to play is what it feels like."}, {"time": 2564, "text": "And it's not, and I think that is a big gap in knowledge, actually, in Judo schools, is the gripping part."}, {"time": 2575, "text": "When you first go out to do Judo, right?"}, {"time": 2579, "text": "You, the first thing you have to do is you have to grab your opponent, right?"}, {"time": 2581, "text": "And a lot of times I hear coaches say, get a grip."}, {"time": 2584, "text": "Just take a grip."}, {"time": 2584, "text": "Well, sometimes if you take a grip, you're in a worse position than not having a grip at all."}, {"time": 2590, "text": "And that's what a lot of people don't understand."}, {"time": 2591, "text": "Like if you hold the gi in the wrong way, your opponent can attack you, but you can't attack him."}, {"time": 2596, "text": "So why would you ever do that grip if it's only to your detriment, right?"}, {"time": 2602, "text": "So that's, and the way you grip does set up what attacks you can do as well."}, {"time": 2608, "text": "So that is a huge part."}, {"time": 2609, "text": "And I'm not saying that you have to be 100% disciplined and only always outgrip your opponent and only be able to do throws when you have a superior grip."}, {"time": 2617, "text": "I'm just saying that to be able to put the grips together with the throws and understand the movements is gonna make you that much ahead of the game."}, {"time": 2625, "text": "So if we take a step to our previous discussion of going from zero to hero."}, {"time": 2631, "text": "So going from the early days through the teenage years to winning an Olympic medal."}, {"time": 2638, "text": "So we mentioned a lot of training, the dedication of the training, the competing, what other elements are there?"}, {"time": 2645, "text": "The mental side is visualization, believing that you could perform at that level."}, {"time": 2652, "text": "So what else can you say about that?"}, {"time": 2653, "text": "I think that comes at the highest level, the visualization, the success, that comes at the highest level."}, {"time": 2658, "text": "I think in the teen years, there's the experience, just plays a huge role in getting to train with other people."}, {"time": 2668, "text": "Like as Americans, we have to go train in Europe."}, {"time": 2670, "text": "We have to feel the European style of judo."}, {"time": 2673, "text": "You have to understand that physicality."}, {"time": 2675, "text": "They grip very differently."}, {"time": 2678, "text": "They put you in very unorthodox positions."}, {"time": 2681, "text": "And if you don't know how to deal with that, you get thrown before you even have a chance to try your own throws."}, {"time": 2687, "text": "So it takes a lot of that experience and understanding what's going on."}, {"time": 2692, "text": "And then you also need to get that physicality."}, {"time": 2695, "text": "You need to be strong and hard, I would say, by doing all those rounds with the Europeans."}, {"time": 2701, "text": "And at the same time, you need to go to Asia and you need to train in Japan because you need to feel that free flowing judo for your technical side."}, {"time": 2710, "text": "And I think that's one of the things that I was able to benefit from."}, {"time": 2713, "text": "My dad was a coach who said, ''Listen, I've taken you as far as I can take you."}, {"time": 2717, "text": "''I want you to go to the next level.''"}, {"time": 2720, "text": "And he sent me to England with Neil Adams, who was an Olympic silver medalist and was a world champion, had a great ground game and was good at gripping and actually did Tai Otoshi, which is the throw I did."}, {"time": 2730, "text": "So my dad said, ''I want you to go learn from Neil.''"}, {"time": 2732, "text": "And I ended up going to England probably eight to 10 times in my career and spending a good amount of time there training at the Neil Adams Academy."}, {"time": 2740, "text": "He's now the voice of judo, Neil Adams."}, {"time": 2743, "text": "What do you make of that guy?"}, {"time": 2743, "text": "Just a brief pause."}, {"time": 2744, "text": "He's like the, like Morgan Freeman is the voice of like March of the Penguins and any other nature documentary."}, {"time": 2752, "text": "And Neil Adams is, there's very few sports that have a Neil Adams, I would say, because he's legitimately, maybe like Joe Rogan is that from mixed martial arts."}, {"time": 2762, "text": "It's just like an exceptionally recognizable voice."}, {"time": 2766, "text": "He's really knowledgeable."}, {"time": 2767, "text": "Also the passion is conveyed so well."}, {"time": 2770, "text": "Like many times I'll watch just because he's talking."}, {"time": 2773, "text": "So who is he?"}, {"time": 2774, "text": "Since you've gotten a chance to train with him, to learn from him, who is Neil Adams?"}, {"time": 2778, "text": "He's a great friend of mine."}, {"time": 2780, "text": "He is?"}, {"time": 2781, "text": "He's a mentor."}, {"time": 2783, "text": "Like I said, I lived and trained at the Neil Adams Club in Coventry, England since I was like 16 years old."}, {"time": 2789, "text": "I went and visited him for the first time."}, {"time": 2791, "text": "He's the one who originally taught me how to do jujigatami and the way that I do jujigatami."}, {"time": 2797, "text": "I trained with him."}, {"time": 2798, "text": "He was just retired."}, {"time": 2799, "text": "He was in his early thirties when I first went out there."}, {"time": 2801, "text": "And so I trained with him many times and over the years he was a mentor."}, {"time": 2808, "text": "Great person, cares about people, cares about the sport of judo, had a good little club that was a fitness club."}, {"time": 2817, "text": "And it was judo, it was fitness."}, {"time": 2820, "text": "It used to go there."}, {"time": 2822, "text": "I'd show up at that place at like seven in the morning."}, {"time": 2825, "text": "And the first thing we would do is we'd go for a run."}, {"time": 2827, "text": "And we'd either be running mountains or we'd be doing a five mile run or we'd be doing something at the park."}, {"time": 2833, "text": "We were doing sprints and buddy carries and all this stuff."}, {"time": 2835, "text": "And then at 9 a.m. we'd have a technical session with Neil Adams where he would, for an hour and a half, we would drill techniques and learn positions."}, {"time": 2843, "text": "And it was no randori."}, {"time": 2845, "text": "It was that sequential drilling that we talked about before, right?"}, {"time": 2848, "text": "Where you're reinforcing your two or three attacks to set up your main attack."}, {"time": 2853, "text": "Or if you're on the ground, you're going through repetitions of certain movements."}, {"time": 2858, "text": "And then I'd spend all afternoon at the club, have lunch."}, {"time": 2861, "text": "I'd go do my weight training in the afternoon at that place."}, {"time": 2865, "text": "And then in the evening, we would either do randori training at the Neil Adams Club or we would all get in a car and we'd drive to another location and we'd go train at another club that might be an hour away."}, {"time": 2876, "text": "And there'd be 50 bodies there to train with."}, {"time": 2878, "text": "And each night we'd go to a different dojo."}, {"time": 2880, "text": "And so it would be all day at the club and I'd do that for like three weeks straight."}, {"time": 2884, "text": "All we'd do was train."}, {"time": 2885, "text": "Do you know how he became the voice of judo?"}, {"time": 2888, "text": "Do you have an understanding of what he's thinking is around how much he dedicates to himself to just commentating on judo?"}, {"time": 2897, "text": "I imagine the amount of research required, but also just like psychologically, just the excitement he has in his voice."}, {"time": 2905, "text": "It takes work to do that."}, {"time": 2908, "text": "Do you have an understanding of like what his vision is with that?"}, {"time": 2910, "text": "He's always been a very charismatic, animated person, Neil."}, {"time": 2915, "text": "Very passionate and loud and funny."}, {"time": 2918, "text": "And the Brits are very funny to begin with."}, {"time": 2920, "text": "So he's very charismatic."}, {"time": 2922, "text": "But I think after coaching, he tried coaching."}, {"time": 2926, "text": "He coached the country of Wales for a while."}, {"time": 2928, "text": "He tried coaching stints in other countries."}, {"time": 2931, "text": "He didn't have a lot of success on the coaching side developing an Olympic champion."}, {"time": 2936, "text": "I know that was a goal of his that he was a world champion."}, {"time": 2940, "text": "I think it was 1981."}, {"time": 2941, "text": "He won two silver medals in the Olympic games himself."}, {"time": 2945, "text": "He went on to coach for a while and had some political issues with the country of England for a while."}, {"time": 2952, "text": "And then left England and went to Wales."}, {"time": 2954, "text": "And I think he had a coaching stint somewhere else as well."}, {"time": 2957, "text": "Didn't have a lot of success coaching in the sport with athletes, not at the highest level."}, {"time": 2962, "text": "Had a great national team and things like that."}, {"time": 2964, "text": "He was really good at teaching his technique to others because he helped me a lot."}, {"time": 2970, "text": "But running a program, I think was difficult for him."}, {"time": 2973, "text": "The boys not listening and not having that same kind of passion and intensity that he... And that's why I bonded well with him because I was all in, right?"}, {"time": 2981, "text": "I went there and whatever he said, I did."}, {"time": 2983, "text": "I didn't care how hard, I didn't care how long."}, {"time": 2985, "text": "I just wanted to get as good as I could."}, {"time": 2987, "text": "And so that's why he was a good mentor for me."}, {"time": 2990, "text": "But now in terms of a commentator, he's very cerebral."}, {"time": 2994, "text": "He loves judo, he researches it nonstop."}, {"time": 3000, "text": "He's got that great voice and he knows how to bring life to the game."}, {"time": 3005, "text": "And that's what he's done."}, {"time": 3006, "text": "And now this is who he is, right?"}, {"time": 3008, "text": "He does judo full time, this is his job."}, {"time": 3011, "text": "Can I ask you a small, before we return to the actual sport, the coaching and the sport, it's a bit of a political question."}, {"time": 3018, "text": "I did a whole rant before Travis episode."}, {"time": 3023, "text": "I love Neil Adams's voice."}, {"time": 3026, "text": "I love watching judo."}, {"time": 3028, "text": "And it's really disappointing to me that the IOC and whoever is responsible, I don't understand this, that they don't make it easy for people to watch the Olympics in replay for years after."}, {"time": 3044, "text": "Like I can't watch Travis's matches."}, {"time": 3046, "text": "I can't watch, like they make it very difficult to watch stuff online."}, {"time": 3051, "text": "So what happened is I uploaded the Travis Stevens episode and we talked about his Ole Bischoff 2012 match."}, {"time": 3059, "text": "And it was like one minute of like a small overlay of the video as we're talking through it, like stepping through it."}, {"time": 3068, "text": "And it got taken down immediately from YouTube, the whole four hour conversation because of that one minute little clip."}, {"time": 3077, "text": "And the way it got taken down automatically is because the IOC has that video uploaded."}, {"time": 3084, "text": "It's set to private, but it's uploaded."}, {"time": 3087, "text": "So like they have the video and they choose not to show it."}, {"time": 3091, "text": "It's not that they're asking for money or whatever."}, {"time": 3093, "text": "They're just not showing it anywhere."}, {"time": 3095, "text": "They're not showing it through their own service."}, {"time": 3097, "text": "Like an NBC Olympics or so on."}, {"time": 3099, "text": "There's just so many great human stories that the Olympics reveals."}, {"time": 3104, "text": "They're just not made easily accessible."}, {"time": 3106, "text": "That's the Olympics charter is you want to, I think the actual line is to ensure the fullest coverage and the widest possible audience in the world for the Olympic games."}, {"time": 3118, "text": "And it seems like to me as a fan of the Olympic games, we're not getting any of that."}, {"time": 3124, "text": "Do you have an understanding of why that is?"}, {"time": 3128, "text": "Like why we can't watch Kayla's matches, Travis's matches super easily, even if we're willing to pay money for it."}, {"time": 3134, "text": "So you can't go on the International Judo Federation website right now and watch any of the Olympic footage?"}, {"time": 3143, "text": "So the only thing they have is for certain, for example, Teddy Rene match he lost."}, {"time": 3150, "text": "Not available anywhere."}, {"time": 3151, "text": "And that's like a dramatic thing."}, {"time": 3153, "text": "So the one thing they have is for certain sports at the highest level, like gymnastics, they'll have a highlight, which is the most frustrating thing to me."}, {"time": 3163, "text": "Because this is what I can't, I'm going to try to prevent myself from going on a rant."}, {"time": 3170, "text": "But people don't just want to see a two minute highlight of a historic moment."}, {"time": 3178, "text": "They want to see the buildup where the athlete is standing, the nerves, the fear, the confidence."}, {"time": 3184, "text": "You see the buildup to the event, say it's a gymnastic, whatever, floor routine."}, {"time": 3189, "text": "Like their name is announced, they're walking, the coat, then they cut to the coach, and the coach with anticipation, and then go to the athlete."}, {"time": 3196, "text": "You want the full 10 minute thing."}, {"time": 3198, "text": "You don't want a two minute highlight of what happened like last second or whatever."}, {"time": 3203, "text": "It's just like the magic of that full story."}, {"time": 3208, "text": "Like a lifetime building up to those 10 minutes, right?"}, {"time": 3212, "text": "That's the magic of the Olympics."}, {"time": 3214, "text": "The both the drama and the triumph that happens in those moments."}, {"time": 3217, "text": "And the fact that you can't relive that."}, {"time": 3221, "text": "Like Travis had a bunch of those, right?"}, {"time": 3223, "text": "Like he had a bunch of times he faced like world champions, he won and lost, and just, it's always close, it's always dramatic."}, {"time": 3231, "text": "And none of those are available except like maybe the one where he beat Armbard, or whatever the submission was, I forgot."}, {"time": 3241, "text": "The choke, yeah, the Georgian."}, {"time": 3244, "text": "But most things are not."}, {"time": 3247, "text": "Usain Bolt, the full races, not all of his races are available online."}, {"time": 3253, "text": "The race with the Italian winning the 100 meter track race, this Olympics is not only highlight is available from what I saw, I didn't look too hard."}, {"time": 3264, "text": "So like, but the fact that it's not super easily accessible if you're willing to pay money even, but probably should be for free, is heartbreaking to me."}, {"time": 3273, "text": "Because to me, the Olympics is like some of the best of humanity."}, {"time": 3280, "text": "Just like, again, the hardship they have to overcome."}, {"time": 3283, "text": "So like the losses are really powerful."}, {"time": 3285, "text": "Because it's such heartbreak, but it's also like the triumph."}, {"time": 3289, "text": "Where you're losing history."}, {"time": 3290, "text": "You're losing history is what you are, of all the magical moments of your sport, right?"}, {"time": 3295, "text": "It's a sin."}, {"time": 3298, "text": "I got to blame it on television rights and money."}, {"time": 3304, "text": "It's like billions and billions of dollars of television rights paid by NBC here in the United States and globally, whatever the main carriers are and all the other nations that are dictating what can be replayed and what can't."}, {"time": 3317, "text": "And that's what it comes down to."}, {"time": 3320, "text": "I made a DVD or a video when I first retired from the sport."}, {"time": 3326, "text": "It was called Fury on the Mat."}, {"time": 3327, "text": "It was kind of my story, right?"}, {"time": 3328, "text": "And I did it with a friend who was a videographer and we grabbed a bunch of my old footage and Olympic footage and somebody said to me, you can't use that Olympic footage."}, {"time": 3339, "text": "And I was young and I had just retired."}, {"time": 3341, "text": "I said, what do you mean I can't use the Olympic footage?"}, {"time": 3343, "text": "It's not the television footage."}, {"time": 3345, "text": "It's my buddy who filmed it with his own camera."}, {"time": 3347, "text": "It's my footage."}, {"time": 3349, "text": "And then they said, no, if it has Olympics in it or it's anything to do with the Olympics, the USOC owns it."}, {"time": 3355, "text": "I said, okay, well, they said, well, you should get to send it to them and let them review it."}, {"time": 3360, "text": "So I sent it to them and I got a bill back."}, {"time": 3362, "text": "I got a thing back that said, if you want to use this footage, it's going to be like $30,000."}, {"time": 3366, "text": "And I said, man, it's only like three minutes."}, {"time": 3369, "text": "I spliced it up as much as I could and I only have highlights in there."}, {"time": 3373, "text": "And then I said, come on."}, {"time": 3374, "text": "I went back and I negotiated with them."}, {"time": 3377, "text": "But at the end of the day, I still had to pay like $15,000 just to have a few minutes of footage in my own film."}, {"time": 3383, "text": "This is... And I'm thinking, you wouldn't even have that film if I didn't compete in it."}, {"time": 3388, "text": "You know, like you can't, you know."}, {"time": 3390, "text": "So it was a struggle."}, {"time": 3391, "text": "This is the different, like you have the same in Jiu Jitsu."}, {"time": 3394, "text": "There's certain organizations, IBJJF or like Flow Grappling and Flow Wrestling."}, {"time": 3400, "text": "I understand, I think when it's a business, it might make sense."}, {"time": 3404, "text": "First of all, you should actually be good at being a business and making money, which is why for me, the IOC doesn't make sense."}, {"time": 3411, "text": "Like it should be accessible, but it would cost money."}, {"time": 3416, "text": "I can't buy it."}, {"time": 3417, "text": "Like would I have to email them for this footage and pay $30,000?"}, {"time": 3422, "text": "No, but the question is, like the way you run a business is you make that frictionless."}, {"time": 3428, "text": "Whatever the money is, $30,000 or $30, you make it frictionless and easy to pay that money."}, {"time": 3433, "text": "But anyway, I understand why that might be the case with Flow Grappling, but to me, the Olympics is a special thing."}, {"time": 3441, "text": "It's like, like you said, it is history."}, {"time": 3443, "text": "Like there's not even, like even the world championships don't compare."}, {"time": 3447, "text": "I understand they're really important, but Olympics is history."}, {"time": 3452, "text": "And the stories should certainly belong to the athletes if they want to do like Fury on the Mat to do their own story, or like on a podcast to talk about the most tragic moment of their career."}, {"time": 3469, "text": "Do you have a sense of how that could be fixed or no?"}, {"time": 3474, "text": "The only thing I could think of is, you'd have to go to the Olympic committee."}, {"time": 3478, "text": "The US Olympic committee is the place I would start because the US controls the worldwide market when it comes to television."}, {"time": 3484, "text": "We pay the most for our television rights."}, {"time": 3486, "text": "Our sponsors pay the most for their rights to be associated with the best team in the world, which is the United States, right?"}, {"time": 3493, "text": "So all the money starts here."}, {"time": 3496, "text": "I gotta believe there has to be a way to get that footage that should be accessible to the sports themselves."}, {"time": 3502, "text": "I'm surprised it's not, but if it's not, then it's because of dollars."}, {"time": 3507, "text": "It's because people aren't, the sport itself is not willing to pay enough money to have it on its, accessible to its audience."}, {"time": 3515, "text": "It's too cost prohibitive for them to do it."}, {"time": 3518, "text": "No, but I think it's also, unfortunately, might be some mixture of incompetence and just an old way of doing things because there's a lot of money to be made on television rights where you live show the event, right?"}, {"time": 3532, "text": "But what's not being leveraged is the huge amount of money that could be made on the replay."}, {"time": 3538, "text": "This is what people don't understand is, do you know how many times, just the tens of millions of times that people watch individual events years from now?"}, {"time": 3550, "text": "You watch like all the videos on YouTube, they're still getting plays."}, {"time": 3554, "text": "Hundreds of millions of views on stuff that happened 10 years ago, 15 years ago."}, {"time": 3558, "text": "That's really powerful and there's a lot of opportunity to make a ton of money."}, {"time": 3562, "text": "So it's not that they're necessarily greedy."}, {"time": 3565, "text": "They're also just not good at being greedy."}, {"time": 3568, "text": "I get what you're saying."}, {"time": 3568, "text": "Yeah, it's not the tradition."}, {"time": 3570, "text": "Think about it though, it's not traditional, right?"}, {"time": 3572, "text": "For television studios, it's nontraditional to go to online streaming, to online access to information."}, {"time": 3580, "text": "It's not hard, right?"}, {"time": 3581, "text": "Because everybody's doing it now, but it's not typical."}, {"time": 3585, "text": "Yeah, so it requires for the IOC to operate outside their comfort zone."}, {"time": 3591, "text": "Well, I definitely hope that's the case."}, {"time": 3593, "text": "And since Travis's video got taken down, it's obvious they have it."}, {"time": 3600, "text": "They have it on their YouTube channel."}, {"time": 3602, "text": "So it's like, I hope that they will just release it."}, {"time": 3607, "text": "And for money, for whatever, but release it and have that history not be erased, right?"}, {"time": 3616, "text": "It'd be wonderful if athletes could buy."}, {"time": 3619, "text": "Even if you could buy your own footage, you can't use it commercially, you can't, but you can buy your own matches and have them available for yourself or package the footage, it'd be awesome."}, {"time": 3632, "text": "That is quite heartbreaking for me, so I wanted to talk about it a little bit."}, {"time": 3637, "text": "Let's go to you as an athlete real quick."}, {"time": 3642, "text": "You represented the United States at four Olympics, winning a bronze medal at two of them."}, {"time": 3649, "text": "Who or what was the toughest match or moment you had in those years?"}, {"time": 3655, "text": "Maybe a moment that defined you, that you remember as being particularly defining in your career."}, {"time": 3666, "text": "I would say the bronze medal match in Atlanta in 96, because up to that moment, the United States team had not won a medal, had not fought for a medal in the games."}, {"time": 3678, "text": "We were on our home turf."}, {"time": 3680, "text": "It was my second Olympic games, right?"}, {"time": 3682, "text": "So I had competed in 92 and I had won two matches and lost in the third round in Barcelona."}, {"time": 3688, "text": "I didn't make the podium."}, {"time": 3689, "text": "I lost to a Japanese guy from Japan."}, {"time": 3693, "text": "But the gold, silver, and bronze medalist at that Olympics in Barcelona were all guys that I had beat."}, {"time": 3699, "text": "In fact, two of them I was undefeated against in my entire career, the Brazilian and the Cuban I had never lost to."}, {"time": 3705, "text": "So that's when I knew I was capable of being on the podium at the Olympic games."}, {"time": 3710, "text": "When 96 came around, I was 25 years old."}, {"time": 3713, "text": "I was fairly in my prime."}, {"time": 3715, "text": "I had lived in Japan for six months."}, {"time": 3716, "text": "My technique was at a high level."}, {"time": 3719, "text": "I was amongst the best in the world."}, {"time": 3724, "text": "I lost at that Olympics to a guy from Mongolia."}, {"time": 3727, "text": "It was right before the match I was supposed to fight against Japan."}, {"time": 3730, "text": "So I was anticipating the match against Japan and I got beat by the Mongolian."}, {"time": 3735, "text": "So that was kind of a letdown."}, {"time": 3736, "text": "But the match for the bronze in front of the hometown crowd, all of my family, all of my friends, everybody who had ever helped me in the sport were in the stands that day, including all my teammates at Brown University that were on the wrestling team and little, my uncles, my aunts, everybody was in the stands, right?"}, {"time": 3757, "text": "So it was like the Jimmy Pedro day."}, {"time": 3759, "text": "And I'm getting goosebumps right now talking about it."}, {"time": 3764, "text": "But it was a match against the Brazilian for the bronze medal."}, {"time": 3767, "text": "I had beaten the Brazilian like two or three times before that."}, {"time": 3770, "text": "And I found myself down in the match."}, {"time": 3774, "text": "He actually countered me."}, {"time": 3776, "text": "I came in my Taiyo Toshi and he was waiting for it and he counted me and he scored a yuko against me."}, {"time": 3780, "text": "So I was losing the fight, came down to about the last minute in the match and I was just tucking in my gi and fixing my thing and gathering my thoughts together."}, {"time": 3789, "text": "And the whole crowd just started chanting, USA, USA, USA."}, {"time": 3796, "text": "And I like literally like got so much energy."}, {"time": 3798, "text": "I walked out there, I grabbed the guy, I came in my Taiyo Toshi again."}, {"time": 3802, "text": "He stepped off the Taiyo Toshi."}, {"time": 3804, "text": "I threw him with duchimada for Ippon."}, {"time": 3806, "text": "I won my first Olympic medal in front of the hometown crowd."}, {"time": 3811, "text": "Everybody went bananas."}, {"time": 3813, "text": "The United States judo team had our first medal from the Olympics."}, {"time": 3817, "text": "It ended up being the only Olympic medal we won at that games."}, {"time": 3821, "text": "But it was like a magical moment that defined my career and solidified myself in like history where, hey, now I get to step up on the Olympic podium and I'm Olympic medalist."}, {"time": 3830, "text": "And to me, that was my defining moment."}, {"time": 3833, "text": "And after that, I was sold."}, {"time": 3835, "text": "Like man, I had to go back to the Olympics again."}, {"time": 3837, "text": "I wanna win a gold medal."}, {"time": 3838, "text": "I want this feeling all over again."}, {"time": 3841, "text": "I don't care if I have to wait four years, let's do it."}, {"time": 3845, "text": "In your career, like moments like that, do you think you love winning or hate losing more?"}, {"time": 3853, "text": "So do you live for those moments or are you more driven by just how much you hate losing?"}, {"time": 3864, "text": "So in order to be a champion, my belief is that you have to hate losing more than you like winning."}, {"time": 3871, "text": "Hate losing more than you like winning."}, {"time": 3873, "text": "But I live for those moments when you do win."}, {"time": 3876, "text": "And what excited me the most in my career when I was competing was I loved being in the finals."}, {"time": 3884, "text": "I loved the spotlight being on me."}, {"time": 3886, "text": "I can't think of too many times in my career, of course there were a few, but there weren't too many times where the chips were down, like the lights were on and I didn't win."}, {"time": 3896, "text": "Like it was, I might've lost early in the day and didn't make it to the finals or didn't make it to the medal rounds."}, {"time": 3902, "text": "But like in my career, I have a ton of golds."}, {"time": 3906, "text": "I have a ton of bronzes, which means the lights are on and I won and I have very few silvers and very few fifths."}, {"time": 3915, "text": "So I either lost in the early rounds and didn't make it to the medal rounds in my younger days or the spotlight came and I really shined."}, {"time": 3921, "text": "Cause if you look, I don't know how many silvers, but there wasn't very many silver medals in my career that I won."}, {"time": 3927, "text": "So I just loved that moment."}, {"time": 3929, "text": "I didn't feel pressure."}, {"time": 3930, "text": "I loved the crowd."}, {"time": 3931, "text": "I loved being in the spotlight."}, {"time": 3933, "text": "I didn't have, I wasn't nervous when it came to the finals or I knew I was getting a medal."}, {"time": 3938, "text": "You know, so it was just me against the other guy and that's how I always saw it."}, {"time": 3942, "text": "And I just loved that moment."}, {"time": 3944, "text": "So your dad was your coach."}, {"time": 3948, "text": "You didn't get to meet him tonight."}, {"time": 3954, "text": "He's kind of a legend in the sport."}, {"time": 3956, "text": "So how has your dad helped you as a coach, as an athlete, as a human being throughout the years?"}, {"time": 3962, "text": "Number one, my dad is the most brutally honest person you will ever meet in your life."}, {"time": 3968, "text": "Brutally honest."}, {"time": 3969, "text": "He will tell you, if you are fat, he will tell you you're fat, right, to your face."}, {"time": 3974, "text": "He wants you to get better."}, {"time": 3975, "text": "He wants you to be healthy."}, {"time": 3977, "text": "Doesn't want you to die of obesity."}, {"time": 3978, "text": "It's just the way he is."}, {"time": 3980, "text": "If you didn't do well, he will not sugarcoat it."}, {"time": 3983, "text": "He will let you know what you didn't do right."}, {"time": 3986, "text": "So he's the ultimate litmus test."}, {"time": 3989, "text": "Second is, he is the most passionate, caring, deep, always thinking about, very cerebral, very like a student of the game, somebody who helped me immensely in defining my strategy, helping me improve, and always look for what's next."}, {"time": 4013, "text": "Third, in terms of training, I think that he's probably the most brilliant human when it comes to preparing an athlete physically, not necessarily mentally, physically, for success."}, {"time": 4030, "text": "When all the chips are down, that athlete will be ready that day, and he has a system of training and preparing and getting the athlete to peak for performance."}, {"time": 4038, "text": "You mean like conditioning, like the whole thing?"}, {"time": 4041, "text": "Okay, because I vaguely remember Kayla Harrison talking about her preparation being very difficult."}, {"time": 4053, "text": "That's him."}, {"time": 4054, "text": "Yeah, that's him."}, {"time": 4055, "text": "At the same, you go back and ask Ronda Rousey about her career, right?"}, {"time": 4059, "text": "My dad was her coach."}, {"time": 4061, "text": "My dad moved her to Camp New Hampshire in Boston, got her up, ran her in the morning, had her downstairs in the basement of his house, training with the weights."}, {"time": 4071, "text": "We brought a Russian girl in."}, {"time": 4072, "text": "She did throws on his cement outside with the little crash pad."}, {"time": 4076, "text": "Threw the Russian girl a hundred times that morning, and then every night came to Boston, to the training center in Wakefield, trained at night, and went back and slept at my dad's house, and three weeks straight before she went off to Beijing."}, {"time": 4089, "text": "And he did the same with Kayla."}, {"time": 4091, "text": "He did the same with me."}, {"time": 4094, "text": "His passion is producing athletes at the highest level, and he knows how to do it."}, {"time": 4098, "text": "And then the one side of my dad's coaching where I think there's a flaw or a weakness is on the mental preparation side of the game."}, {"time": 4108, "text": "He wasn't somebody that was, I don't know if he, maybe because he wasn't an Olympic champion himself and wasn't a world champion, he lacked the confidence in helping others be more confident."}, {"time": 4119, "text": "So he's more of a, this is what you need to work on type of thing."}, {"time": 4123, "text": "He doesn't know how to build the athletes up to make them feel invincible."}, {"time": 4128, "text": "And I feel like that's something that I was able to give all of the athletes, to help them with that visualization, belief in yourself, knowing that you're gonna win before you step out of the mat, knowing that we've earned the right to victory, seeing success in your mind, having a positive mantra that you, I'm the best in the world, nobody's beating me today, type of feeling."}, {"time": 4149, "text": "So you go out there feeling like King Kong when you step on the mat, that nobody's gonna stop you."}, {"time": 4154, "text": "And so I think the combination of both of us as coaches, I'm a lot more technical."}, {"time": 4160, "text": "My dad is good at letting, identifying what they need to do for their techniques and what, in strategy, how to beat opponents and putting game plans together."}, {"time": 4170, "text": "So combined, the two of us made an unbelievable team."}, {"time": 4173, "text": "So he's not gonna let the athlete be soft when they enter the highest, the most difficult competitions of their career."}, {"time": 4183, "text": "So on the mental side, what's mental preparation look like?"}, {"time": 4188, "text": "Like how many years before the Olympics do you start helping an athlete believe that they can win an Olympic medal?"}, {"time": 4197, "text": "Well, I think it's gotta be a seed in that athlete's brain, something they wanna do, right?"}, {"time": 4202, "text": "Nobody can quickly get there, right?"}, {"time": 4205, "text": "It's a long process."}, {"time": 4206, "text": "But if your goal, if you're national champion or you've proven yourself to win in some international tournaments, and you think the Olympics is a possibility for you, then defining it as, hey, I wanna be on the Olympic team, that would be the first step into getting ready."}, {"time": 4224, "text": "And I always make them put it on paper."}, {"time": 4228, "text": "If it really is your goal, then you show me that it's your goal and put it on paper and commit to it."}, {"time": 4232, "text": "I wanna be Olympic medalist, I wanna be Olympic champion, I wanna go to the Olympics."}, {"time": 4236, "text": "World team member, maybe junior world team member, whatever it is, we walk before we go to the highest level."}, {"time": 4241, "text": "But if the goal is to go to the Olympics, let's accomplish these other things first, right?"}, {"time": 4246, "text": "Because if we can accomplish these other things, then we're on our way to getting to the ultimate goal, which is the Olympics."}, {"time": 4254, "text": "For somebody like Kayla, for example, she didn't say that she wanted to be Olympic champion when she first came here in 2005, right?"}, {"time": 4265, "text": "We wanted to become national champion, then we wanted to be on the world team, then we wanted to be a world medalist."}, {"time": 4270, "text": "Then our sights were set on the Olympics or the Olympic gold."}, {"time": 4274, "text": "So it's having those clearly defined goals that are attainable."}, {"time": 4278, "text": "Like they should be a reach, they should be a stretch, but they have to be attainable."}, {"time": 4282, "text": "They can't be just a pipe dream."}, {"time": 4285, "text": "But once you put it to paper and you think it's achievable, then it's mapping the plan to get there."}, {"time": 4293, "text": "Is there a daily process of visualizing yourself as an Olympic champion or national champion?"}, {"time": 4300, "text": "Yes, it is, and you should do it either every night before you go to bed or before every training session or after every training session."}, {"time": 4310, "text": "One of those three times it should, or first thing you wake up in the morning, because it may be to help some people, it motivates them to go do what it is they're supposed to do in the day."}, {"time": 4320, "text": "But the process of visualization is, to me, is closing your eyes for a few moments."}, {"time": 4327, "text": "Your brain works really, really fast, right?"}, {"time": 4329, "text": "And it's actually picturing the day in its entirety, from start to finish, from the moment you wake up and you step on the scale to the moment you have your breakfast and you go through your morning routine."}, {"time": 4342, "text": "Like live the day that you're gonna have at the Olympics."}, {"time": 4344, "text": "So whatever it is you're trying to do, let's say the Olympic day, for example."}, {"time": 4349, "text": "Picture yourself making weight, picture yourself, who you're around, eating your breakfast, having maybe saying a few jokes, laughing."}, {"time": 4355, "text": "This is a real day, make it real."}, {"time": 4358, "text": "Going back and packing your judo bag for the day, getting on the bus, driving to the venue, feel what it's like walking into the stadium for the first time, going to the warmup area, seeing your drawer up on the sheet, who you're gonna fight that day, watching yourself warm up, go through your warmup routine, walking out of the shoot, into the venue, going to do that first fight."}, {"time": 4385, "text": "Picture the moment of throwing your opponent, coming off the mat, high fiving the coach, getting ready for your second fight."}, {"time": 4392, "text": "Like live the day from start to finish and make it as real as possible."}, {"time": 4427, "text": "Like the more real you can make it, even before it ever happens, right?"}, {"time": 4434, "text": "When you do that enough times, I feel that like pathways get created for you so that when your body gets to that moment, and I've been here before, this is it, this is my moment, this is what I pictured my whole life, I'm not nervous, because I've seen this, this is gonna happen, I believe it's possible, right?"}, {"time": 4453, "text": "And I believe the athletes that do that and make it real enough that when they get to that moment, they go right through, there's no hesitation."}, {"time": 4462, "text": "This is what this is meant to be, this is my destiny, this is why I did everything I did, versus the ones that don't think about it ever, but just kind of like hope, it's not real to them, it doesn't feel attainable, they don't believe it's possible, they haven't committed to believing it was possible."}, {"time": 4479, "text": "Without that commitment in yourself and that belief, it can't happen."}, {"time": 4483, "text": "And one thing that, I talked to Travis a bit about this, you probably worked with him on the details of what you're talking about, but he said that you should really focus on visualizing the sensations you feel."}, {"time": 4501, "text": "So say if you're drinking coffee or something like that, you're not thinking about like observing yourself from a third person perspective drinking coffee, like you're thinking of how your hand will feel when it touches something warm."}, {"time": 4517, "text": "Like you try to replay the actual sensations you would feel, right?"}, {"time": 4521, "text": "So it sounds kind of strange, but meaning like you really wanna put yourself in the body as you would experience those moments, as opposed to like watching yourself on TV experience in those moments, like really be inside."}, {"time": 4536, "text": "And yeah, so that means sensations, like how does it feel when you grip a gi?"}, {"time": 4540, "text": "How does it, yeah, the sweating, just the sensation of sweat, like rolling down your forehead or whatever, like all of those actual feelings."}, {"time": 4552, "text": "When I explain it to you, like I guess my body has been through it so many times, both in my mind and in reality that it brings back all of those same emotions."}, {"time": 4563, "text": "I start to get goosebumps, my armpits start to sweat, like I'm living it if it's real."}, {"time": 4569, "text": "I'm reliving it now."}, {"time": 4570, "text": "But when you're going through the visualization process, it has to be that real, the smells, the taping of the fingers, like the more colorful and the more real you can make it, the more believable it is."}, {"time": 4585, "text": "So I've been doing this kind of thing, just having listened to you enough for other stuff in life, so let's see if it works."}, {"time": 4595, "text": "But do you see this kind of visualization being useful for other things in career and all those kinds of things?"}, {"time": 4600, "text": "100%, 100%, because I just know with my own life, my own experiences, like my wife sometimes says to me, she says, well, where do you see yourself in like five years from now?"}, {"time": 4615, "text": "And five years ago, I had said to her, I wanna have my own business."}, {"time": 4620, "text": "I wanna have, this is the amount of money that I'm hoping I can make in a given year."}, {"time": 4625, "text": "Like you have to have goals for yourself."}, {"time": 4626, "text": "Like is this, if you put out there like, okay, I wanna make a million dollars in a year."}, {"time": 4633, "text": "Like for me or for the normal person, like that's a really big number."}, {"time": 4637, "text": "Like it's not, especially when you're not making that much at the time, it's a super big number, right?"}, {"time": 4642, "text": "So having those goals for yourself, like it won't happen and it's not possible unless you dream it's possible and think that it's possible."}, {"time": 4651, "text": "And then it doesn't magically happen."}, {"time": 4654, "text": "And maybe it doesn't happen in five years, maybe it happens in 10, but at least you're on the path to getting there."}, {"time": 4660, "text": "And I said, I wanna own my own business."}, {"time": 4661, "text": "I wanna control my own destiny."}, {"time": 4664, "text": "I wanna be my own boss."}, {"time": 4666, "text": "I wanna make my own decisions."}, {"time": 4667, "text": "Like these are the things that I told her I wanted to do."}, {"time": 4669, "text": "And now I'm at that point, where I work for myself, I have my own company, I have partners obviously, but like if I wanna pick up and go somewhere for a week, I just do, I don't have to ask permission to do it, right?"}, {"time": 4683, "text": "That's what life, freedom, right?"}, {"time": 4685, "text": "That's what I'd like."}, {"time": 4686, "text": "And all of it starts with a dream."}, {"time": 4689, "text": "In the same with my dojo, when I first opened."}, {"time": 4692, "text": "So I ran a dojo for a long time and I only had 60 students always, like 40 to 60 students had fluctuated."}, {"time": 4699, "text": "And I sit there and say, why can't I get more people in my door, right?"}, {"time": 4703, "text": "So I hired consultants to come in and look at my business and say why, right?"}, {"time": 4707, "text": "And they came in and said, well, this place is really intimidating."}, {"time": 4711, "text": "Like if I was coming in off the street, the first thing I see is this big Olympic champion on the wall and I see this training that's going on and these guys are flying through the air and landing hard."}, {"time": 4720, "text": "And as a white belt, you're telling me that's the class for me?"}, {"time": 4722, "text": "Like no way, I'm not gonna do that."}, {"time": 4724, "text": "So like I listened to these people and I said, you're right."}, {"time": 4727, "text": "And the training was hour and a half, two hours long."}, {"time": 4731, "text": "People can't handle an hour and a half or two hours training when they're first walking in the door."}, {"time": 4734, "text": "So I had to restructure all my programming."}, {"time": 4736, "text": "I had to look at the way I was offering my school and I had to make levels for everybody, right?"}, {"time": 4742, "text": "Like here's my four to six year old class."}, {"time": 4745, "text": "Here's my six to 13 year old class."}, {"time": 4747, "text": "There's all my beginner classes."}, {"time": 4749, "text": "They don't mix in with the advanced people."}, {"time": 4751, "text": "And I had to learn how to make it accessible for everybody instead of just the people that wanted to train hard."}, {"time": 4759, "text": "And then the challenge was, okay, if you can have a lot of people in your dojo training, it's a recreational school."}, {"time": 4766, "text": "You can't produce champions at that same school."}, {"time": 4768, "text": "That's what I was told."}, {"time": 4769, "text": "So then I got all my black belts together and I said, listen, this is my vision."}, {"time": 4773, "text": "This is what I want."}, {"time": 4774, "text": "I wanna have a club that has over 200 judo only athletes, no jujitsu, no karate, nothing, judo only."}, {"time": 4781, "text": "I want over 200 people."}, {"time": 4783, "text": "And in the inside of that dojo, I wanna have Olympic champions and I wanna have recreational, like little kids, five and six years old, older guys in their seventies train, I don't care, but I want the spectrum of recreational and I want Olympic champions."}, {"time": 4797, "text": "The only way to do that is to take your instructors and say, you're gonna do this, define the roles, who's gonna be the recreational coach, who's gonna be the competitive coach."}, {"time": 4806, "text": "How do we separate these programs?"}, {"time": 4808, "text": "And lo and behold, that was my vision that I shared with all of them and that was back in 2006."}, {"time": 4815, "text": "And by 2012, we've got Olympic champion Kayla Harrison, we have over 200 people at the school, we have a successful thriving business, but it doesn't happen without that vision, a plan and believing that it's possible."}, {"time": 4830, "text": "Believing that it's possible."}, {"time": 4832, "text": "I don't know, but I personally have on top of that almost like very specific visions of a future."}, {"time": 4841, "text": "Like, I don't know what, cause I don't wanna give actual examples."}, {"time": 4846, "text": "Cause for several reasons, one of which is just people will, as they often have, they often will in your life, they'll just laugh at it a little bit, like that seems silly."}, {"time": 4862, "text": "And I don't, I'm very hesitant to share certain things like that with people because they'll, I mean, I'm with Johnny Ive, who's the lead designer in Apple, like you want that dream, that little flame to not, people will put that flame out too easily, even people that love you."}, {"time": 4881, "text": "So I have very specific kind of visions, like maybe for Travis, it would be like a specific opponent or something like Ole Bischoff, like very specific, very specific situation of what's going to happen."}, {"time": 4896, "text": "Not just like, I wanna be an Olympic champion, but very specific, like almost silly situations."}, {"time": 4903, "text": "Yeah, like the dynamic between Travis and Ole Bischoff or something, like maybe visualize that."}, {"time": 4907, "text": "For me, that helps because it makes it all real, even more real."}, {"time": 4912, "text": "It's not like some big goal, like a million dollars or something like that, which is also really important to have because you can measure it and so on."}, {"time": 4920, "text": "But it's just like you belong in those situations."}, {"time": 4925, "text": "Just believing you belong there."}, {"time": 4928, "text": "It's not the default."}, {"time": 4929, "text": "It can be you."}, {"time": 4930, "text": "Yeah, it could be you."}, {"time": 4931, "text": "And for some reason, that really helps me, the little details."}, {"time": 4935, "text": "Like visualizing, most of them are almost a little bit funny, like focusing on the funniness."}, {"time": 4943, "text": "It's the mundaneness of it helps me a lot."}, {"time": 4948, "text": "And all the people that have done great things, they're just human too."}, {"time": 4951, "text": "Correct, and I think a lot of people overestimate who others are and sell themselves too short."}, {"time": 4962, "text": "Because at the end of the day, everybody started like everybody else, really."}, {"time": 4967, "text": "I mean, we did."}, {"time": 4969, "text": "We're all infants."}, {"time": 4970, "text": "We couldn't walk, we couldn't talk, we couldn't do anything."}, {"time": 4972, "text": "We learned along the way."}, {"time": 4974, "text": "And I think that's the one thing that I realized is that, and I tell this to my athletes, but I also tell it to my recreational students, nobody is better than you are, nobody, unless you allow them to be."}, {"time": 4989, "text": "If you really want something to happen, then like map the plan, believe in yourself, decide, and know full out, you're gonna fail a lot."}, {"time": 5000, "text": "You're gonna get beat down."}, {"time": 5002, "text": "You're gonna have losses."}, {"time": 5003, "text": "You're gonna have struggles."}, {"time": 5005, "text": "And I think that's the one thing with social media today is that everybody sees everybody succeed."}, {"time": 5010, "text": "Nobody posts the picture when they're on the ground and fail, you're losing."}, {"time": 5013, "text": "Like nobody sees when you broke your arm and you had to go through rehab, whatever it is, like had your injuries and you were on your couch watching TV and you were suffering and you were like, everybody has really, really dark, bad moments in their life and defeats and losses and suffrage."}, {"time": 5030, "text": "And it's only at the end after they've recovered from all of that, they've reclimbed up the mountain and they've gone to the pinnacle that you see them on social media with the medal, right?"}, {"time": 5039, "text": "But everybody else like struggles and was human and failed many, many times."}, {"time": 5045, "text": "And convincing yourself that you're capable, I think is the first start of everything."}, {"time": 5052, "text": "Do you need people in your life that believe in you or should most of it come from within yourself?"}, {"time": 5059, "text": "I think most of it has to come in from, it certainly helps, but it has to come from you first."}, {"time": 5065, "text": "You have to be driven, like other people can help you define where you wanna go and help you get there and encourage you and can support you and whether it's resource wise or with connections and like they can help with that path, but that first part has to come from you."}, {"time": 5082, "text": "It has to be your passion, your desire, your commitment to yourself."}, {"time": 5088, "text": "You're the one that's gonna ultimately make all the sacrifices to do it."}, {"time": 5091, "text": "So it has to be your decision, not your parents, not your spouses, something that you're really motivated to do."}, {"time": 5099, "text": "Let me ask you about Travis, Kayla, and maybe a few of the other athletes you've been involved with."}, {"time": 5104, "text": "So first, Travis."}, {"time": 5106, "text": "Travis Stevens, Olympic silver medalist, three time Olympian, 2008, 2012, 2016."}, {"time": 5117, "text": "What makes Travis Stevens great?"}, {"time": 5120, "text": "What makes him so successful?"}, {"time": 5123, "text": "What makes him unique in your mind as an athlete?"}, {"time": 5126, "text": "Through all the hardship he had to overcome, through his weird looking sayonagi that eventually worked out nicely, through the full richness of his personality, in the context of all the other great athletes you've coached, what makes him special?"}, {"time": 5145, "text": "His fight, Travis has fight."}, {"time": 5148, "text": "And you know, the first time I ever saw Travis Stevens was in, like recognized him, maybe I had seen him before as a younger boy or something, but like actually recognized him as, I brought a group of young kids to Italy for a competition in a training camp."}, {"time": 5163, "text": "And it was this program called U23 Elite."}, {"time": 5166, "text": "And I picked, handpicked 20 kids to go to this event."}, {"time": 5170, "text": "And it was the first time I coached an international team."}, {"time": 5175, "text": "And I had never seen Travis fight before, compete, train, anything."}, {"time": 5178, "text": "And during this competition, you know, he's an 81 kilo player."}, {"time": 5182, "text": "I think he was maybe like 18 years old, 17, 18 years old."}, {"time": 5188, "text": "And it was a really hard European event."}, {"time": 5191, "text": "And I think Travis won three matches and he lost two."}, {"time": 5194, "text": "But what stood out the most to me was like, the fight he had in him."}, {"time": 5199, "text": "He was scrapping every fight."}, {"time": 5201, "text": "Like he scrapped hard."}, {"time": 5202, "text": "Like he wanted to win more than any of them, right?"}, {"time": 5205, "text": "He didn't win, but he wanted to win more."}, {"time": 5207, "text": "And I noticed that right away."}, {"time": 5209, "text": "And then I also noticed that after he lost his second match and he was eliminated from the tournament, I saw how disappointed he was in himself."}, {"time": 5217, "text": "Like he actually thought he was supposed to beat those people."}, {"time": 5219, "text": "Even though he was like 17, right?"}, {"time": 5221, "text": "And he's fighting against grown men that are, you know, a high level judo, much higher than he was."}, {"time": 5226, "text": "And I said to him, I said, hey son, like, don't worry, man."}, {"time": 5229, "text": "You got a long career ahead of you."}, {"time": 5231, "text": "Like, I'm glad you're disappointed, but there's so many things you don't know and so many skills you don't have."}, {"time": 5237, "text": "The fact that you were able to hold your own and scrap like that, like you've got a good future."}, {"time": 5241, "text": "And I remember calling my friend, Jason Morris, after that tournament."}, {"time": 5246, "text": "And I said, hey man, did you ever hear of this kid, Travis Stevens?"}, {"time": 5249, "text": "He says, no, why?"}, {"time": 5250, "text": "I said, man, that kid's got some fight in him, right?"}, {"time": 5253, "text": "And I said that, I said that to Jason at the time."}, {"time": 5255, "text": "I said, that kid's got some fight in him, man."}, {"time": 5257, "text": "He's pretty talented, you know?"}, {"time": 5258, "text": "And that's how it started."}, {"time": 5261, "text": "But so I saw that in him when he was young."}, {"time": 5263, "text": "But the other thing was, Travis, like, there's no such thing as hard work to that guy."}, {"time": 5270, "text": "If you tell him to put his head through the wall and that's how he wins, he'll go put his head through the wall."}, {"time": 5275, "text": "He'll do whatever it takes for him to do to achieve success."}, {"time": 5280, "text": "And he hates failure more than he likes winning, 100%."}, {"time": 5288, "text": "He always has."}, {"time": 5288, "text": "He punishes himself when he doesn't do well."}, {"time": 5291, "text": "He makes himself work harder."}, {"time": 5292, "text": "He goes and just abuses himself when he doesn't succeed because he's so heartbroken and disappointed in himself."}, {"time": 5302, "text": "So that's a trait that I think all of the athletes that I work with closely, they all had that same trait."}, {"time": 5308, "text": "They hated losing more than anything."}, {"time": 5310, "text": "They would break their arm."}, {"time": 5311, "text": "They'd fall on their head."}, {"time": 5313, "text": "They'd rather get hit by a car than lose a judo tournament."}, {"time": 5316, "text": "And as a result, then they all had fight and they all were willing to train."}, {"time": 5320, "text": "They were willing to listen."}, {"time": 5322, "text": "They would do anything for victory."}, {"time": 5324, "text": "Within the rules, I'm not talking about taking drugs or anything like that, but they'd give 100% of themselves for victory."}, {"time": 5332, "text": "And Travis was somebody that when he was down, he found a way to get better doing something else."}, {"time": 5338, "text": "If he couldn't do standing, that's when he started jujitsu."}, {"time": 5341, "text": "He couldn't go on his feet anymore."}, {"time": 5343, "text": "He couldn't stand up and train."}, {"time": 5344, "text": "Might as well go learn jujitsu and get good on the ground because I can."}, {"time": 5349, "text": "So he always found a way no matter what obstacle was in his way, he just went around it."}, {"time": 5354, "text": "So what about, it'd be interesting to get your perspective because I know Travis's perspective is just the number of injuries."}, {"time": 5364, "text": "Like what do you make of the perseverance through all the injuries he had to overcome?"}, {"time": 5368, "text": "Specifically like you just observing this creature that you've coached."}, {"time": 5373, "text": "I mean, he seems to not see the injuries as a problem."}, {"time": 5377, "text": "He just like, just like you said, head through the wall."}, {"time": 5380, "text": "It's like what, like when we were talking about injuries, he kinda, he doesn't even see the injuries themselves as the problem because he thinks that the injuries, you know, you heal back stronger."}, {"time": 5394, "text": "I forget the exact quote, but he said like, my body is now less injury prone than most of anyone else."}, {"time": 5402, "text": "Because I've already broken everything."}, {"time": 5403, "text": "I've broken everything and it's just grown back stronger."}, {"time": 5407, "text": "Like, cause I asked him something like, do you regret sort of pushing your body to all of those places that resulted in those injuries?"}, {"time": 5415, "text": "He was, his response was like, no, I'm stronger now."}, {"time": 5419, "text": "So I don't know if that's justification, but that certainly describes a mindset that, yeah, head through the wall."}, {"time": 5426, "text": "That doesn't, it's almost not dramatic."}, {"time": 5430, "text": "Like, look, I got this injury."}, {"time": 5432, "text": "It's so, I'm so like brave and special for overcoming this injury."}, {"time": 5436, "text": "He's just, he's just, that's part of the job and he gets the job done."}, {"time": 5441, "text": "But like that job involves a lot of injuries."}, {"time": 5444, "text": "One of the talks I gave Travis and that team at that particular tournament was at the very beginning of the camp after the tournament, I said to them, listen, my vision, I shared my vision with them."}, {"time": 5454, "text": "I said, my vision is, you know, in seven years, cause that was 2005, I said in seven years, I wanna have a US team that steps on the mat that is ready to kick ass."}, {"time": 5466, "text": "And in order to get there, all of you guys can be a part of this team and part of this process."}, {"time": 5470, "text": "But in order to get there, you guys have to be the first ones to practice."}, {"time": 5474, "text": "You have to be the last ones to leave cause we have to work harder than the rest of the world because we're up against all odds."}, {"time": 5480, "text": "I said, I am sick of America being a laughing stock of judo and being the first round, easy match, warmup for everybody else."}, {"time": 5488, "text": "I said, if you get injured, you're not gonna be on the side with, you know, with a ice bag on taking off rounds."}, {"time": 5496, "text": "And then get back on the mat the next day and tell me you're okay."}, {"time": 5499, "text": "If you can train the next day, you can train today."}, {"time": 5501, "text": "So there's no injury."}, {"time": 5502, "text": "The only time you'll leave in this dojo is if the ambulance has to take you out of here."}, {"time": 5506, "text": "You know, and I do think subliminally, Travis bought into that message and heard that message then, said, if I'm gonna be a champion, that's the way I'm gonna do it."}, {"time": 5515, "text": "And he did, and he embodied it, he lived it."}, {"time": 5518, "text": "Man, do it many times in Europe where I said, dude, just tape it up, go off to the side, just take the day off, like, take the rest of the day off, you're beat up, you can't do it."}, {"time": 5528, "text": "He said, no, no, I'm gonna tape it up, I'm gonna tape it up."}, {"time": 5530, "text": "I said, no, you don't need to right now."}, {"time": 5532, "text": "And he said, no, sensei, I'm doing it."}, {"time": 5534, "text": "You know, the ambulance isn't taking me out, it's just my wrist, it's just my ankle, it's just my wrist."}, {"time": 5540, "text": "It's just my ankle, yeah, I love it."}, {"time": 5543, "text": "Yeah, what about the, so the other really big thing is you comment on a little bit is the weight cut."}, {"time": 5550, "text": "So early in his career, he was 81 kg, and that was presumably not so difficult."}, {"time": 5557, "text": "But later in his career, he is 81 kg, and it's becoming more and more difficult."}, {"time": 5562, "text": "So that's the other thing with him is, so I've known a lot of really, really tough people at the highest levels broken by the weight cut."}, {"time": 5573, "text": "Like that can break the toughest minds."}, {"time": 5575, "text": "And it doesn't seem to have broken him."}, {"time": 5578, "text": "And he's delivered on it often, on like insane weight cuts."}, {"time": 5583, "text": "So just as a coach, what do you think about his, particularly his mind and the challenge of the weight cut?"}, {"time": 5590, "text": "It was part of his process."}, {"time": 5592, "text": "It was part of his way of getting ready for battle."}, {"time": 5595, "text": "Suffering?"}, {"time": 5596, "text": "Yeah, it really was."}, {"time": 5597, "text": "And if I'm gonna suffer this much, then I'm gonna make my opponents pay for all the suffering that I went through to get here."}, {"time": 5604, "text": "That was his mindset."}, {"time": 5607, "text": "Later on in his career, you're right, like a lot of times, Travis, he would never step on a scale until he got to the tournament."}, {"time": 5615, "text": "And even when he get to the tournament, like he'd weigh like 90 kilos."}, {"time": 5619, "text": "He'd show up at the tournament nine kilos over."}, {"time": 5622, "text": "I'm like, you have to, but I never, it was just an expectation of making weight."}, {"time": 5627, "text": "Not making weight was never an option for any of our athletes."}, {"time": 5630, "text": "And Travis knew it."}, {"time": 5632, "text": "And he said, as a professional, my job is to make weight."}, {"time": 5636, "text": "If I don't make weight, he was never gonna allow that to happen."}, {"time": 5640, "text": "And he was never gonna allow us to come to him and say, hey, I told you."}, {"time": 5644, "text": "Cause losing wasn't an option, making weight wasn't, not making weight was not an option for him ever either."}, {"time": 5651, "text": "But a lot of times he wouldn't even, he'd be nine kilos over on the plane going over to the tournament and have to make weight three days later."}, {"time": 5660, "text": "And he didn't break 86 kilos until the day before the tournament."}, {"time": 5664, "text": "Like he had five kilos over the day before."}, {"time": 5666, "text": "That was his way."}, {"time": 5667, "text": "But he would do three workouts to wake up in the morning and work out."}, {"time": 5671, "text": "Then he'd eat."}, {"time": 5672, "text": "Then he'd work out in the afternoon."}, {"time": 5673, "text": "Then he'd eat again."}, {"time": 5674, "text": "Then he'd work out again at night."}, {"time": 5676, "text": "And then he'd reward himself."}, {"time": 5677, "text": "Hey, I worked out three times today."}, {"time": 5678, "text": "He'd go have a, you know, a Mountain Dew."}, {"time": 5682, "text": "You know, or a chocolate bar."}, {"time": 5684, "text": "And then his next morning, he's back up to 87 and he would never touch weight until the morning of weigh ins."}, {"time": 5691, "text": "That's a, when he, he wasn't on weight for more than like five minutes."}, {"time": 5697, "text": "His process would break a lot of people."}, {"time": 5700, "text": "So the fact that he got the job done is... Not just the job done, but every single time he got the job done."}, {"time": 5707, "text": "And I made those athletes fight."}, {"time": 5710, "text": "We would fight in Paris."}, {"time": 5711, "text": "We would do a camp for a week, double session camp for a week."}, {"time": 5715, "text": "He'd be seven kilos over, have to fight the next weekend."}, {"time": 5719, "text": "We're talking two or three days later."}, {"time": 5721, "text": "You know, so not only did he make the weight, but he did a grueling training camp twice a day."}, {"time": 5726, "text": "And then cut weight and then fought again."}, {"time": 5729, "text": "Then did another camp for a week in double session training camp, and then fought on a third weekend in a row."}, {"time": 5734, "text": "And our athletes went through hell."}, {"time": 5737, "text": "You know, all of our athletes went through hell because on the tour around the world, they fought in every event."}, {"time": 5743, "text": "They did every camp."}, {"time": 5745, "text": "They fought in every event."}, {"time": 5746, "text": "Whereas most of the other teams, like Japan comes in and fights in Paris, then they go home."}, {"time": 5751, "text": "You know, they maybe do a camp for three days, then they go home."}, {"time": 5753, "text": "They don't stay in Europe for four or five weeks straight and fight in every tournament."}, {"time": 5757, "text": "And when you get to Germany, the Germans skip the French Open."}, {"time": 5761, "text": "They skip the camp in France."}, {"time": 5762, "text": "They're just getting ready for Germany."}, {"time": 5764, "text": "Our athletes already had two competitions, two training camps, three weight cuts now."}, {"time": 5769, "text": "And then, so they're not 100% when they fight in Germany, but that's all part of the experience they need, the training that they need that they don't get here in this country."}, {"time": 5778, "text": "And all of those were just preparation for our world championships or our Olympic games."}, {"time": 5783, "text": "So by the time our athletes got to those tournaments, they felt so strong, so rested, so like, man, this guy that felt like a monster in Germany feels like nothing today because you're fully rested now, you know?"}, {"time": 5797, "text": "But part of the challenge is because the American team is smaller and more, I mean, just smaller, is all the different places you go to do the weight cut, to do the diet, to do the preparation or the recovery, there's, like that process changes every time."}, {"time": 5819, "text": "So you basically have to improvise a lot."}, {"time": 5821, "text": "So you show up to a hotel and how you do the weight cut, you don't know."}, {"time": 5825, "text": "And this is the different weather conditions."}, {"time": 5827, "text": "It's not, it's like, what is it?"}, {"time": 5831, "text": "Rocky versus Drago, right?"}, {"time": 5833, "text": "So you don't have, you have to just improvise."}, {"time": 5835, "text": "And that's also a fascinating part of the American judo story, which is like, you have to improvise more."}, {"time": 5839, "text": "Well, it was funny because when I, it was 1990, and it was at the Goodwill Games, right?"}, {"time": 5845, "text": "And we were, it was a US Olympic committee type event."}, {"time": 5848, "text": "And so we're on the bus with the swim team."}, {"time": 5851, "text": "And it was me and Jason Morris on the American team, and we're going to the judo competition, but we're on the bus with the swim team."}, {"time": 5858, "text": "I'm sorry, we're going to the venue where we're staying."}, {"time": 5860, "text": "You know, I remember being like by ourselves with no staff, no manager, no coach, we're just by ourselves going to fight in Russia, right?"}, {"time": 5868, "text": "And the swim team's on there with their full sweats and their staff and like their managers."}, {"time": 5874, "text": "And I heard the lady, the girl go, I'm sorry, this was 1994, because it was in St. Petersburg, Russia."}, {"time": 5880, "text": "So I heard the little girl on the team, she goes up to the coach, she goes, coach, do you think you can send the massage therapist to my room at 10 a.m.?"}, {"time": 5888, "text": "You know, I'm feeling kind of jet lag."}, {"time": 5890, "text": "I looked at, me and Jason looked at each other like, oh, she's scheduling a massage?"}, {"time": 5897, "text": "We don't even have a staff."}, {"time": 5898, "text": "Like what the hell is going on here?"}, {"time": 5900, "text": "You know, what a difference in sporting, you know, different sports within the same country, you know, and."}, {"time": 5907, "text": "But that, I mean, not to romanticize things, but that you do represent the spirit of the Olympics when you're kind of the improvisational nature of it."}, {"time": 5917, "text": "Cause it is just you, you and sometimes you and the coach and just pure guts and you against the world with no money."}, {"time": 5927, "text": "The warrior spirit."}, {"time": 5931, "text": "How did it feel like when he, after being in two Olympics, beating some of the best people in the world, facing some of the best people in the world and just barely losing, what did it feel like to you as a coach to see Travis Stevens win the silver medal?"}, {"time": 5950, "text": "Electric."}, {"time": 5951, "text": "I like, first of all, in 2012 in London, it was like, it felt like somebody died."}, {"time": 5960, "text": "I'm not going to be, I'm not going to lie to you."}, {"time": 5962, "text": "The Ole Bischoff match?"}, {"time": 5963, "text": "Not, no, just seeing Travis not finish on the podium period."}, {"time": 5967, "text": "You know, in the Ole Bischoff match, I thought he won regardless of who won and who lost."}, {"time": 5973, "text": "He just left everything he had on that mat, right?"}, {"time": 5975, "text": "10 minutes of probably it was a 20 something minute match, but 10 minutes of fighting actually, right?"}, {"time": 5981, "text": "He left everything he had."}, {"time": 5983, "text": "He wanted to be in the Olympic finals."}, {"time": 5984, "text": "He wanted to be Olympic champion."}, {"time": 5986, "text": "And when he didn't get that opportunity, he lost everything."}, {"time": 5989, "text": "He drained himself."}, {"time": 5990, "text": "He cried for 45 minutes straight."}, {"time": 5992, "text": "I couldn't regroup him."}, {"time": 5993, "text": "I couldn't get him up."}, {"time": 5994, "text": "I said, Travis, you've got to stop your crying."}, {"time": 5996, "text": "You've got to get off the floor."}, {"time": 5998, "text": "We've got a bronze medal fight."}, {"time": 6000, "text": "Like if you don't recover, you're not going to perform well."}, {"time": 6003, "text": "And he just didn't care."}, {"time": 6004, "text": "Like it was gold or nothing."}, {"time": 6006, "text": "And so when he walked out against the Canadian boy, he had beaten the Canadian."}, {"time": 6010, "text": "I think at that time, he had beaten that Canadian every single time, except for that bronze medal match."}, {"time": 6016, "text": "But he just didn't have the fight in him anymore."}, {"time": 6018, "text": "You know, he'd left it all in the match, in the Bischoff match."}, {"time": 6020, "text": "So to see him come back with zero, right?"}, {"time": 6023, "text": "We just had a team where his best friend, Marty Malloy, won a bronze medal, right?"}, {"time": 6029, "text": "Then the day after Travis fights, Kayla Harrison goes and wins her first gold medal, right?"}, {"time": 6034, "text": "Our first ever gold."}, {"time": 6035, "text": "So we have a gold and a bronze."}, {"time": 6036, "text": "His training partner wins a gold."}, {"time": 6038, "text": "His best friend from growing up wins a bronze."}, {"time": 6041, "text": "He has nothing, right?"}, {"time": 6042, "text": "To see him for four years go through hell, like literally like all of his injuries, every training camp, and then forget the humiliation, because every time any reporter ever came to my dojo, they want to talk to Kayla."}, {"time": 6057, "text": "She's the Olympic champion."}, {"time": 6059, "text": "Who's this Travis guy?"}, {"time": 6060, "text": "Who is this guy?"}, {"time": 6061, "text": "So he didn't medal."}, {"time": 6064, "text": "He's not that important."}, {"time": 6065, "text": "And up until you get to right before the Olympics, now they talk about he's an Olympian again."}, {"time": 6071, "text": "But up until that point, and then every little kid sees Kayla's medal."}, {"time": 6076, "text": "Oh, Travis, yeah, you went to the Olympics."}, {"time": 6078, "text": "Where's your medal?"}, {"time": 6079, "text": "How did you do?"}, {"time": 6080, "text": "You know, I took fifth, I didn't place."}, {"time": 6082, "text": "You know, it's the lowest of low, every day having that constant reminder."}, {"time": 6087, "text": "So four years later, when that guy, I mean, mentally, he was ready."}, {"time": 6095, "text": "Physically, he was ready."}, {"time": 6097, "text": "That was the best and strongest Travis Stevens that I've ever seen and I've ever felt."}, {"time": 6103, "text": "Like, cause I had to get on the mat and do some drills and stuff like that, and like try to defend armbars, and cause we didn't have a lot of bodies in Rio."}, {"time": 6111, "text": "And I was like, my God, he's, I said after one of the prizes, those are the strongest I've ever felt that guy, right?"}, {"time": 6116, "text": "Before the competition, so physically he was ready."}, {"time": 6119, "text": "Mentally, the morning of competition, I said to Travis, I looked him in the eye, and I said, you know, we're ready to go over to the venue."}, {"time": 6126, "text": "I said, are you ready today?"}, {"time": 6127, "text": "And he just looked at me like he goes, I am gonna shock the world today."}, {"time": 6132, "text": "That's what he told me, I'm gonna shock the world today."}, {"time": 6134, "text": "And I said, all right, great, let's go, right?"}, {"time": 6136, "text": "So we go to the venue, and every other athlete was just like nervously, like doing repetitions of Uchi Komis."}, {"time": 6145, "text": "You could see like sweat coming out."}, {"time": 6147, "text": "You could see like all this nervous energy going through their body."}, {"time": 6151, "text": "And here comes Travis Stevens."}, {"time": 6152, "text": "He's got these big goofy headphones on."}, {"time": 6155, "text": "He's got a tank top that says USA on it."}, {"time": 6158, "text": "He's got the swim trunks that say USA, like that have shiny letters that glow in the dark."}, {"time": 6164, "text": "And he's like, and this is in the middle of the judo hall where all these athletes are warming up for their first match."}, {"time": 6170, "text": "He's like dancing around, like doing this loose warmup, like almost like a little kid at an amusement park whose dad said, yeah, go play, you know?"}, {"time": 6179, "text": "And it was like, he had waited four years for that moment, and he was so relaxed, so focused, so relaxed, and couldn't wait."}, {"time": 6187, "text": "It was like a caged tiger."}, {"time": 6188, "text": "Like if you like coming out of the chute to go step on to the mat was like this tiger that you were just letting out of the cage, and he just go, like now's your time to go fight."}, {"time": 6198, "text": "And that's what he did that whole day."}, {"time": 6200, "text": "And like when he beat Chirikishvili in the semis and choked him out and won that fight, like there's nobody with the exception of maybe the guys in the American team, there was nobody in that stadium that expected Travis to beat him, nobody."}, {"time": 6218, "text": "Like, you know, he had smashed Travis, I don't know how many times before that free poem, like in the first minute even."}, {"time": 6224, "text": "It wasn't even a fight, right?"}, {"time": 6226, "text": "And it was great game plan."}, {"time": 6229, "text": "He's the world number one at the time too."}, {"time": 6232, "text": "World number one at the time, world champion, carried the flag for the Georgian Federation walking into the games, most dominant 81 kilo player in that weight class for quite some time."}, {"time": 6248, "text": "And man, we just had his number and Travis was ready to go."}, {"time": 6254, "text": "It was so awesome."}, {"time": 6255, "text": "I mean, we had already won, Kayla had already won her second gold, right?"}, {"time": 6260, "text": "The way the event went and Travis winning that was like icing on the cake for our team."}, {"time": 6266, "text": "That was the best performance we've ever had in history."}, {"time": 6270, "text": "So you mentioned Kayla."}, {"time": 6271, "text": "She is one of, if not the greatest American Jidoka ever."}, {"time": 6276, "text": "Two time gold medalist."}, {"time": 6279, "text": "2010 world champion."}, {"time": 6281, "text": "2010."}, {"time": 6282, "text": "First senior worlds."}, {"time": 6283, "text": "Senior worlds."}, {"time": 6285, "text": "What makes Kayla special?"}, {"time": 6289, "text": "What makes her so great?"}, {"time": 6291, "text": "What made this champion?"}, {"time": 6293, "text": "It's a combination of a lot of things."}, {"time": 6297, "text": "One was obviously Kayla's mental toughness, right?"}, {"time": 6301, "text": "To overcome what she overcame."}, {"time": 6303, "text": "You know, this is a girl who, you know, let's not say forget about the sexual abuse, but the fact that she had to go through that in life and learned how to compartmentalize that and keep that off as a separate part of her brain, you know, and forget about it and move on."}, {"time": 6321, "text": "That took an incredible team to help her do that, and my dad was a huge part of her accomplishing that."}, {"time": 6328, "text": "So for people who don't know, we should comment and say that Kayla had to go through trauma in her earlier life through sexual abuse and had to overcome that through the whole process of becoming a champion as well."}, {"time": 6343, "text": "Because she had zero self esteem, zero self worth."}, {"time": 6345, "text": "She was at the lowest of lows and didn't even want to be on this earth, right?"}, {"time": 6351, "text": "So she was traumatized obviously and getting her the right help and surrounding her with the right people who could help her get through that and be by her side as she's getting through that and letting her know and reaffirming that she's doing the right thing and she made the right decision and she should have zero guilt."}, {"time": 6371, "text": "And you know, this doesn't define her."}, {"time": 6374, "text": "It happened to her, but it doesn't define her."}, {"time": 6375, "text": "What defines her is what she does from now on."}, {"time": 6378, "text": "And then rebuilding that person to become who she became."}, {"time": 6381, "text": "I think the mental toughness is a big part of it, her mind."}, {"time": 6386, "text": "But then as an athlete, she's a lot like Travis."}, {"time": 6392, "text": "She's a warrior."}, {"time": 6394, "text": "She's a fighter."}, {"time": 6395, "text": "My dad always jokes with her."}, {"time": 6397, "text": "He says, you're a workhorse."}, {"time": 6399, "text": "You're not a thoroughbred."}, {"time": 6400, "text": "We're not gonna treat you like a thoroughbred, right?"}, {"time": 6402, "text": "You're a workhorse, so you're gonna work."}, {"time": 6405, "text": "And the way you're gonna get bigger and stronger is you're gonna work harder and you're gonna keep, you know."}, {"time": 6408, "text": "And she came to us when she was only 15."}, {"time": 6410, "text": "So at that time we got her with a really good strength and conditioning coach."}, {"time": 6415, "text": "We did all the core Olympic style lifting."}, {"time": 6417, "text": "Like as her body was developing, she was getting stronger every single day."}, {"time": 6422, "text": "And then, you know, she had the luxury of being on the mat with, at the time I was still young enough to train and be on the mat and I was around her weight class and Travis was able to train with her and we had all the top US athletes at the time training here at my school."}, {"time": 6436, "text": "So she got the benefit of all the best guys to train within the country, you know."}, {"time": 6441, "text": "And her doing all of those rounds, you know, night in, week, night, every night, every week, every year, compiled with the best, you know, highest level she could as a girl."}, {"time": 6452, "text": "She got the strength, she got the technique, she got the, and then she had the coaching on top of it with my dad being on her as, you know, working her out and, you know, having the wherewithal to develop a strategy and a plan for her."}, {"time": 6464, "text": "Because when she first came here, she competed at 63 kilos, which is 138 pounds."}, {"time": 6471, "text": "At the time, Rhonda Rousey was also training here and she was 70 kilos."}, {"time": 6476, "text": "So if Kayla was struggling making 63, so the only way to, obviously, the only way to still compete is to move up."}, {"time": 6484, "text": "But my dad said, well, if you move up, then you're in Rhonda's weight."}, {"time": 6486, "text": "So let's skip that weight and you're gonna go to 78 kilos."}, {"time": 6489, "text": "And he told her, listen, you're gonna go up two weight classes."}, {"time": 6492, "text": "She looked at him and was like, that's 172 pounds."}, {"time": 6495, "text": "And he goes, well, I don't care."}, {"time": 6497, "text": "Like, you're already struggling making 138, you weigh 150, what's the difference?"}, {"time": 6500, "text": "We put 20 pounds on, go to 170."}, {"time": 6503, "text": "So that's why she jumped two weights, because she passed Rhonda, she went to the weight above so she could make the national team and she had a chance to go to the Olympics and all that, because we envisioned Rhonda staying around till 2012."}, {"time": 6514, "text": "And that's also like a longterm vision because you kind of grow into that body then over time."}, {"time": 6521, "text": "So you can dominate, you can learn what it's like in that weight class."}, {"time": 6523, "text": "You can learn to dominate that weight class, excel and then dominate."}, {"time": 6527, "text": "People that cut weight too hard, too long, they forget about technique because they're only worried about losing weight."}, {"time": 6532, "text": "They're always tired in training."}, {"time": 6534, "text": "They don't give 100% effort, they're not getting better."}, {"time": 6537, "text": "She now is just focused on getting better at judo, getting bigger, getting stronger, getting more powerful."}, {"time": 6542, "text": "So I think giving her that purpose and that, that was a great call."}, {"time": 6547, "text": "What are some memorable or maybe the most memorable moment, Kayla Harrison moment to you as her coach?"}, {"time": 6556, "text": "Not the most perhaps, let's say, what are some memorable moments?"}, {"time": 6562, "text": "Everybody hears the good ones, right?"}, {"time": 6563, "text": "So everybody knows she won the world championships in Tokyo in 2010."}, {"time": 6568, "text": "She was our two time Olympic champion in 2012, 2016."}, {"time": 6571, "text": "I'll never forget those moments, right?"}, {"time": 6574, "text": "Cause they're historic."}, {"time": 6576, "text": "One of the biggest moments that I liked sharing this story with everybody is that in 2010 in January, Kayla was still a developing athlete and we had a local tournament in New York."}, {"time": 6590, "text": "It was in Brooklyn, New York, it was called the Starrett Cup."}, {"time": 6593, "text": "And I knew that at that tournament that two of the Canadian girls, they were like ranked 15th or 20th in the world."}, {"time": 6599, "text": "They weren't superstars, but they were tough players."}, {"time": 6602, "text": "Both of them, I knew were gonna be at that tournament."}, {"time": 6604, "text": "So I said, Kayla, we're gonna go to this tournament, you're gonna compete against the Canadian girls, get some good experience, figure out what you need to work on and then we'll go home and work on some stuff."}, {"time": 6613, "text": "Well, she went to the tournament, there was only three girls in the weight, her and the two Canadians."}, {"time": 6618, "text": "At that tournament, she lost both fights, right?"}, {"time": 6622, "text": "So this is January, 2010, she lost both matches."}, {"time": 6626, "text": "She was competitive, but certainly things she needed to work on, it was good development thing for her and for us."}, {"time": 6632, "text": "It also opened her mind to say, oh man, cause she was already a junior world champion at the time."}, {"time": 6639, "text": "But so now there's another level, this is a senior level, right?"}, {"time": 6642, "text": "You gotta go up another level."}, {"time": 6643, "text": "Here's two girls that aren't even medalists that are beating you."}, {"time": 6646, "text": "So now there's more work to be done."}, {"time": 6648, "text": "And so I like telling that story because everybody sees the champions in the greatest moments, they don't see them when they have bad days."}, {"time": 6655, "text": "And could you imagine being, oh and two, you feel like a failure, right?"}, {"time": 6661, "text": "But 10 months later, it was Tokyo 2010, she went from oh and two at Starret, New York to world champion 2010 in the motherland in Japan."}, {"time": 6676, "text": "I mean, that's an amazing turnaround."}, {"time": 6679, "text": "And that's only possible if you put the losses in their proper context, you don't let it destroy you mentally and just keep moving forward."}, {"time": 6689, "text": "This is so funny."}, {"time": 6691, "text": "So you were there 2010 at the Starret Cup?"}, {"time": 6694, "text": "Was Travis there?"}, {"time": 6696, "text": "I made all those, we fought at every, like the mentality of our team was no tournament is beneath us."}, {"time": 6703, "text": "If our goal is to go to the Olympics in the world and win, there's no tournament that's beneath us."}, {"time": 6709, "text": "We're gonna get experience, we're gonna fight, we're gonna learn, we're gonna compete, we're gonna get better, you know?"}, {"time": 6716, "text": "I actually, just as a funny little side, I was there, I competed."}, {"time": 6722, "text": "This is one of the earlier tournaments, like the beginner division."}, {"time": 6725, "text": "Oh no, I actually did black belt division too."}, {"time": 6727, "text": "That was one of the, actually yeah, I remember that."}, {"time": 6731, "text": "That's when it was so early that I thought, like I was also really strong at that time, just like physically like power lifting stuff."}, {"time": 6741, "text": "So I thought like it'll be good experience to also do black belt division."}, {"time": 6746, "text": "And remember, it must have been actually Travis's division, which is funny."}, {"time": 6752, "text": "Is Legere Brothers?"}, {"time": 6753, "text": "Yeah, Harry and Gary."}, {"time": 6755, "text": "They are super, they're super good and they're super dominant, but I think Travis faced one of them and beat them."}, {"time": 6763, "text": "I don't know, I just remembered, it's funny how there's just like these little roads that later reconnect."}, {"time": 6771, "text": "But yeah, there's some incredible people there."}, {"time": 6774, "text": "And I saw obviously the positive things and it's interesting that Kayla's story was also intersecting there and that was one of the lower points for her."}, {"time": 6784, "text": "Another story I like to share is that you have to know your athletes, right?"}, {"time": 6789, "text": "And you have to really get to know their, what they're thinking psychologically, mentally, what's going through their head."}, {"time": 6796, "text": "Another story was in Tokyo."}, {"time": 6800, "text": "It was 2015, the Tokyo Grand Slam."}, {"time": 6805, "text": "So we had had Kayla face off against almost all the top girls in her division."}, {"time": 6810, "text": "She had beaten everybody going into the 2016 Olympics."}, {"time": 6814, "text": "But at the 2015 Tokyo Grand Slam, there was a girl from Japan that she hadn't fought in a long time and she lost to the girl last time she fought her."}, {"time": 6824, "text": "So it was something we wanted her to beat this girl going into the Olympics so that she knew she could beat everybody."}, {"time": 6832, "text": "And it was a first round match and it was gonna be tough for Kayla, right?"}, {"time": 6837, "text": "It was gonna be a really hard fight."}, {"time": 6839, "text": "And she had won a bunch of tournaments in a row leading up to that."}, {"time": 6843, "text": "So her confidence was really high, but at the same time, she didn't think she needed this fight."}, {"time": 6850, "text": "And she showed up to the tournament and she said, I don't think I can fight today."}, {"time": 6855, "text": "I've got a stinger in my neck."}, {"time": 6857, "text": "I've got a stinger coming down my neck and I'm kind of sore."}, {"time": 6859, "text": "And she didn't tell us."}, {"time": 6861, "text": "She went and told the trainer."}, {"time": 6863, "text": "She walked around, she's holding her neck."}, {"time": 6865, "text": "And me and my dad were like, what's up with her?"}, {"time": 6868, "text": "And then, so maybe she doesn't wanna fight today."}, {"time": 6873, "text": "So all of a sudden the trainer comes up to us and she didn't come to us."}, {"time": 6877, "text": "The trainer came to us and says, you know, I really don't think it's a good idea that Kayla fight today."}, {"time": 6881, "text": "And we looked at him and we're like, well, your opinion doesn't really matter, does it?"}, {"time": 6887, "text": "What's up with her?"}, {"time": 6889, "text": "Well, she has this thing in her neck."}, {"time": 6889, "text": "It's like a pinched nerve and there's this and that."}, {"time": 6893, "text": "We talked, I said, is there a risk of her getting injured?"}, {"time": 6896, "text": "Like, is this pain or is this risk that she's gonna get injured and she's gonna set her back like long time in her career?"}, {"time": 6902, "text": "Says, no, she's not gonna get injured."}, {"time": 6904, "text": "It's just a pinched nerve."}, {"time": 6905, "text": "It's a little pain she's gonna have to deal with."}, {"time": 6906, "text": "I go, okay, well, can you fix the pain?"}, {"time": 6909, "text": "Says, yeah, I can do this and that and I can give her a shot and the pain will go away."}, {"time": 6913, "text": "I said, okay, then do that."}, {"time": 6915, "text": "And so Kayla comes up, she goes, didn't the trainer talk to you?"}, {"time": 6918, "text": "I said, yeah, he talked to us."}, {"time": 6920, "text": "Well, he said, I can't fight."}, {"time": 6922, "text": "I know, but we already talked to the trainer and."}, {"time": 6926, "text": "He said, you're good to go."}, {"time": 6927, "text": "She looked at us like."}, {"time": 6929, "text": "And then we had to talk to her and say, listen, you're not injured, you're in pain because we just came from a camp."}, {"time": 6935, "text": "I said, you're in pain, but here's the deal."}, {"time": 6938, "text": "We want you to fight this girl."}, {"time": 6939, "text": "We want you to go out there and beat this girl, period."}, {"time": 6942, "text": "I want to know that you can beat this girl."}, {"time": 6943, "text": "This is why we came."}, {"time": 6944, "text": "This is our last hard tournament before the Olympic games."}, {"time": 6948, "text": "This is what we want from you."}, {"time": 6950, "text": "And lo and behold, she understood."}, {"time": 6953, "text": "They gave her a quick shot."}, {"time": 6954, "text": "The rest of the world thought we were crazy making her compete."}, {"time": 6958, "text": "And then she went out there, she fought, didn't even know she was injured."}, {"time": 6963, "text": "No, you know what I mean?"}, {"time": 6964, "text": "She just went out there, she fought the tournament."}, {"time": 6966, "text": "She beat the Japanese girl."}, {"time": 6967, "text": "She ended up going through the whole tournament."}, {"time": 6969, "text": "She took a gold medal."}, {"time": 6971, "text": "She won the event."}, {"time": 6973, "text": "That turned out to be a great confidence builder, yeah."}, {"time": 6978, "text": "And that kind of sets you up for all the chaos that can happen at the Olympic games."}, {"time": 6983, "text": "And it tells you if you can beat these girls when you're not 100% and you're not at your best, you're physically beat, mentally beat, imagine what you're gonna do when you're fresh."}, {"time": 6993, "text": "Well, when she was going to the Olympic games, there's a lot."}, {"time": 6995, "text": "She had the mental game down."}, {"time": 6999, "text": "There wasn't a girl in that division that thought they could beat Kayla going into those games."}, {"time": 7003, "text": "Not a one."}, {"time": 7004, "text": "They just looked at her and went, no, not happening."}, {"time": 7008, "text": "I mean, she's a great Olympic champion, two time Olympic champion."}, {"time": 7011, "text": "But there is something that she's commented on, which is she's suffered or went through depression after winning her second Olympic gold."}, {"time": 7022, "text": "Why do you think this happens?"}, {"time": 7024, "text": "You often hear stories of great champions becoming depressed after the Olympics."}, {"time": 7031, "text": "There's a lack of purpose afterwards, right?"}, {"time": 7034, "text": "Because you've done in life what you set out to do."}, {"time": 7038, "text": "You've had a goal every day you woke up."}, {"time": 7040, "text": "You knew what your purpose was."}, {"time": 7041, "text": "You knew what your day looked like."}, {"time": 7045, "text": "You knew why you were doing that."}, {"time": 7047, "text": "And all of a sudden you won and you got all the fame and you're all happy."}, {"time": 7053, "text": "But then you wake up and you go, now what?"}, {"time": 7057, "text": "I don't have a next."}, {"time": 7059, "text": "And also because there was nothing for her, there was no path set out for Kayla that said, okay, you're gonna become an ambassador, a global ambassador of judo."}, {"time": 7071, "text": "The IJF is gonna help pay a salary."}, {"time": 7074, "text": "The USA judo is gonna give you a salary."}, {"time": 7076, "text": "Here's what we want you to go teach children."}, {"time": 7078, "text": "We want you to go be an ambassador for women."}, {"time": 7081, "text": "We're gonna fly you around and whatever it is."}, {"time": 7083, "text": "We're gonna give you a job and here's what you're gonna do if you'd like to take it."}, {"time": 7087, "text": "There was nothing for her."}, {"time": 7088, "text": "Like I remember doing the interview at the Olympics with her and they said, are you gonna compete in the next Olympics?"}, {"time": 7094, "text": "And I said, no."}, {"time": 7096, "text": "She already two time gold medalist."}, {"time": 7097, "text": "What does three time gold medalist do for her?"}, {"time": 7101, "text": "Doesn't motivate her to do it again."}, {"time": 7103, "text": "They said, are you doing MMA?"}, {"time": 7105, "text": "I said, no, why would she do MMA?"}, {"time": 7107, "text": "Like she doesn't need MMA."}, {"time": 7109, "text": "She should be able to make a living off of what she's accomplished in this sport for the rest of her life."}, {"time": 7116, "text": "But what happens is, and what most people don't understand is once you say I'm retired, I'm no longer competing in the sport of judo, you don't get a salary from USA Judo anymore, which she was getting."}, {"time": 7131, "text": "I think she got like $72,000 a year from USA Judo at the time."}, {"time": 7136, "text": "You don't get a stipend from the Olympic committee anymore."}, {"time": 7139, "text": "Goes away."}, {"time": 7141, "text": "Your sponsor, like the New York Athletic Club was a great sponsor for her for all those years."}, {"time": 7145, "text": "In fact, she could have never been the athlete she became without the support of the NYC."}, {"time": 7150, "text": "Cause I talked to them when she was 15, I said, hey, I got a girl that's really good someday."}, {"time": 7156, "text": "Like if you invest in her now, I promise you she'll pay back for you."}, {"time": 7160, "text": "And I remember the day she won the Olympic gold, I called the guy up, I said, hey, I told you so."}, {"time": 7165, "text": "But they can no longer give you stipends because you're not competing and representing them anymore."}, {"time": 7170, "text": "So that goes away."}, {"time": 7172, "text": "All of your sponsorships and all of your money that you would make from your TV commercials or whatever, that didn't happen for her after the Olympics cause Judo's a obscure sport, right?"}, {"time": 7181, "text": "So she didn't have any opportunities for that."}, {"time": 7184, "text": "At the end of the day, she has no revenue coming in."}, {"time": 7187, "text": "How do you live?"}, {"time": 7188, "text": "You get a bonus of 25 grand from the Olympic committee or whatever for winning a gold."}, {"time": 7193, "text": "But aside from that, you're not gonna live on that money."}, {"time": 7195, "text": "So no purpose, no goal, right?"}, {"time": 7199, "text": "What am I gonna wake up and do tomorrow?"}, {"time": 7200, "text": "I don't know, so she has no direction."}, {"time": 7202, "text": "And then at the same time, she has no money coming in."}, {"time": 7205, "text": "So everything shuts off."}, {"time": 7206, "text": "So now it's like, wait till you turn, what do you do?"}, {"time": 7210, "text": "And that leads to being depressed because yeah, even though I've accomplished all this stuff, I'm kind of lost in life."}, {"time": 7217, "text": "Like what's next for me?"}, {"time": 7220, "text": "And I guess you just have to ride that out because when you're a great human being, great champion, life has a way of helping you find a way."}, {"time": 7231, "text": "I mean, she's in mixed martial arts now, but she has a lot of stuff going on."}, {"time": 7235, "text": "Right, well, her kids, she adopted her sister's kids."}, {"time": 7240, "text": "So she's their legal guardian now."}, {"time": 7241, "text": "So that is her purpose, right?"}, {"time": 7243, "text": "Raising these kids and making them part of her family."}, {"time": 7246, "text": "And she's fortunate enough that she has enough money that she can do that and she can give them a good life."}, {"time": 7252, "text": "Mm hmm, I'm gonna ask you to start some trouble."}, {"time": 7255, "text": "But I heard that she said somewhere that she can be Khabib Nurmagomedov in judo."}, {"time": 7261, "text": "To be honest with you, I mean, I don't know what level of judoka."}, {"time": 7266, "text": "I don't know what level he is."}, {"time": 7267, "text": "But I do know that that Russian system respects judo immensely."}, {"time": 7272, "text": "What I will tell you is this, I trained with Kayla and I was an Olympic medalist and a world champion in judo."}, {"time": 7278, "text": "And granted, I was older when I trained with her."}, {"time": 7281, "text": "But you have to go as a man."}, {"time": 7283, "text": "You have to go 100% or she will smash you as a man."}, {"time": 7288, "text": "And I could tell you that if Khabib doesn't do a lot of just judo, doesn't like gripping and doesn't understand, if he can throw, that's one thing."}, {"time": 7298, "text": "But if he doesn't really understand judo at a high level, she will throw him."}, {"time": 7303, "text": "She would beat him in a match, in a judo contest."}, {"time": 7306, "text": "Not in a mixed martial arts contest, not in a wrestling contest, not in a submission contest."}, {"time": 7310, "text": "In a pure judo match."}, {"time": 7312, "text": "Where he cannot grab legs and he has to grip up and just throw."}, {"time": 7318, "text": "I'd put my money on Kayla."}, {"time": 7321, "text": "Unless he's, you know, if he could go place in the nationals in Russia, he would beat her."}, {"time": 7325, "text": "But if he's not at that level of judo, he's more like a brown belt or he's not, he's not a high level judo player, she will win."}, {"time": 7331, "text": "I saw her take some of our best juniors in this country."}, {"time": 7336, "text": "Some of the guys that went and won our, medaled in our senior nationals."}, {"time": 7342, "text": "I've seen her smash all of them in judo."}, {"time": 7345, "text": "Now, she's not gonna do that to a Travis Stevens."}, {"time": 7348, "text": "She's not gonna do that to a senior national champion or an Olympian in our sport."}, {"time": 7355, "text": "But she will go toe to toe with every other male, black belts or not."}, {"time": 7362, "text": "Speaking of Khabib in Russia, Vladimir Putin, I don't know if you have heard of him, he's the president of Russia, but he's also a judoka."}, {"time": 7374, "text": "Have you gotten a chance to see him do judo?"}, {"time": 7377, "text": "What do you think about his judo, if you were to analyze it?"}, {"time": 7380, "text": "So I'm actually really good friends with the Russian Federation."}, {"time": 7385, "text": "The guy in charge is Ezio Gamba."}, {"time": 7387, "text": "He's an Italian, he's a mastermind behind their success of the 2012 and 2016 Olympic teams."}, {"time": 7394, "text": "2020, he suffered from leukemia, blood cancer, so he wasn't part of their 2020 program."}, {"time": 7399, "text": "But he was part of 2012, 2016."}, {"time": 7402, "text": "That whole national, the Olympic team in 2012 came to our studio and lived here for a month in Boston."}, {"time": 7409, "text": "They went to school in Boston."}, {"time": 7411, "text": "I brought them to my house."}, {"time": 7412, "text": "They had three Olympic champions."}, {"time": 7413, "text": "Three Olympic champions."}, {"time": 7416, "text": "Oh my God, what a team."}, {"time": 7418, "text": "They all came and lived here in Boston for a month."}, {"time": 7420, "text": "They wanted to be part of experience America type program."}, {"time": 7424, "text": "So I've seen all of them with Putin in Russia at their national training center, working out with them and taking falls and doing judo with him."}, {"time": 7433, "text": "So it's hard when you're older to move in judo."}, {"time": 7438, "text": "I mean, I was at a high level and I'm now 51."}, {"time": 7441, "text": "It's hard for me to move like I used to."}, {"time": 7443, "text": "So at his age, he's gotta be what, 60, between 62, 65ish?"}, {"time": 7449, "text": "I mean, it moves really well for somebody that's that age and probably hasn't done very much judo for the last however many years, right?"}, {"time": 7457, "text": "So that tells you he, at one point, he had to be a really good judo player."}, {"time": 7461, "text": "Yeah, he put in a lot of work at some point to develop the technique."}, {"time": 7465, "text": "You could tell when a great judo player, even if they haven't practiced it, even if they're up there in age, like just the way they move, the way they go in for a Seinage, the way they go for a particular throw, the way they do foot sweeps and all that kind of stuff, you could just tell he's good at judo."}, {"time": 7483, "text": "So it's fascinating to see political leaders."}, {"time": 7488, "text": "I've gotten to interact with quite a few for whom judo was a formative experience in their life."}, {"time": 7494, "text": "And that's so interesting that for a lot of people, judo played a big part in their life, early development."}, {"time": 7500, "text": "It's similar to like if you served in the military."}, {"time": 7504, "text": "There's just something about judo."}, {"time": 7505, "text": "It's the, as a martial art, it's not just the technique."}, {"time": 7509, "text": "So yes, there's something about gaining confidence through becoming aware of what like your body can do, the sort of the artistry and the skill of it, also the power of being able to dominate another human being with technique, but also like the, I don't know, the formality, the discipline of just honoring the tradition of it."}, {"time": 7533, "text": "So all of that mixed together somehow creates."}, {"time": 7536, "text": "Memories."}, {"time": 7537, "text": "It creates memories that kind of define you as a human being and that you carry that forward throughout your life."}, {"time": 7543, "text": "And I've just been surprised to know how many powerful people internationally have like in their heart, in their, who they are, judo."}, {"time": 7554, "text": "At the core of it."}, {"time": 7555, "text": "It makes you the human being that you are."}, {"time": 7557, "text": "It really does."}, {"time": 7558, "text": "Like it becomes a fabric of, the people that stick with it, right?"}, {"time": 7562, "text": "That stay with it."}, {"time": 7563, "text": "Because it, I mean, it teaches you so many lessons."}, {"time": 7567, "text": "It's so memorable because of what you talked about, the tradition."}, {"time": 7570, "text": "But it's also, you grow with other people, and you learn from other people and you experience things with other people."}, {"time": 7578, "text": "It's such a hands on sport that it's very memorable."}, {"time": 7584, "text": "And people love it so much."}, {"time": 7585, "text": "Like right now at my dojo, we have like four generations."}, {"time": 7590, "text": "Like somebody that did judo with my dad, had a kid who trained with me, who loved judo so much, had a kid."}, {"time": 7599, "text": "That kid was now in his 20s who did judo."}, {"time": 7603, "text": "And now has a kid who's two or three or four that's coming to my toddler program at my school."}, {"time": 7608, "text": "Like we're talking four generations."}, {"time": 7609, "text": "And they all love the experience so much and what it did for them and their lives that they wanted the next generation to also experience the same thing."}, {"time": 7619, "text": "This is a tricky question, but if people are interested in judo and want to start learning it, in the United States there's thousands of jiu jitsu schools, for example, is there advice you can give to people interested in judo or maybe to jiu jitsu gym owners?"}, {"time": 7639, "text": "Like how do you get judo as part of your life in America?"}, {"time": 7645, "text": "Well, I mean, if you're fortunate to live near another dojo, right?"}, {"time": 7648, "text": "A place that has judo locally, then that's your best opportunity to learn is to go learn from another school."}, {"time": 7655, "text": "Unfortunately, sometimes the nearest dojo might not be for two hours or three hours away from where you're at, which is an obstacle."}, {"time": 7664, "text": "You're not gonna do that."}, {"time": 7665, "text": "So, I mean, Travis and I did start the American Judo System online."}, {"time": 7670, "text": "It's at usajudo.com."}, {"time": 7672, "text": "And we've broken down every single judo technique to the very, very basic elements of just movement."}, {"time": 7707, "text": "So basically from the very foundation of the movement all the way to the most advanced level, we've documented this through separate videos."}, {"time": 7716, "text": "And we've taken now, I think 12 to 15 of standing techniques combined with a whole bunch of groundwork techniques."}, {"time": 7724, "text": "And our goal is just to continue to build this platform out so that anybody anywhere can learn online and can ask questions."}, {"time": 7732, "text": "We have a live training class every couple of weeks, every two weeks, he or I answer questions online for our members."}, {"time": 7740, "text": "Ideally, what we'd like to do is have a standing curriculum for jujitsu instructors that want to learn and become black belts in judo."}, {"time": 7749, "text": "Here's how, these are the techniques you need to know."}, {"time": 7751, "text": "This is how many reps you need to do."}, {"time": 7753, "text": "This is how efficient you need to get at those techniques to become certified as an instructor or become a black belt."}, {"time": 7760, "text": "And eventually have an online promotion system where anybody anywhere can just submit videos and show us that they can do those techniques."}, {"time": 7769, "text": "And obviously we'll have people review them."}, {"time": 7771, "text": "And this is a dream and a vision, but we've already started the platform."}, {"time": 7775, "text": "We're about to do a collaborative effort with USA Judo where all of their members will start to get access to this platform as well."}, {"time": 7782, "text": "And if we can get that influx of money and people on the platform, it'll allow us to hire and grow it faster."}, {"time": 7791, "text": "So you also want to do certification there."}, {"time": 7794, "text": "It's not just instruction."}, {"time": 7798, "text": "That would be amazing."}, {"time": 7801, "text": "I mean, for me personally, sort of, I mean, mostly in Austin, Texas now."}, {"time": 7805, "text": "And there's a few judo schools, but it's not really."}, {"time": 7811, "text": "There's not, and it's just one of those cities that doesn't quite have, I mean, there's a few, it's basically just like a few random judo people that kind of kind of gather together a couple of times a week, but it's not a system, a dojo, an instructor, integrated into a jiu jitsu school or not."}, {"time": 7830, "text": "The problem with most judo dojos right now is that most of them cater towards the competitive side."}, {"time": 7839, "text": "Also, a lot of them do it recreationally, meaning this isn't how they make a living."}, {"time": 7843, "text": "So they're there three nights a week, or they're there five, even if they're there five nights a week, it's still only one junior class and one senior class, and that's it."}, {"time": 7851, "text": "And it's one size fits all."}, {"time": 7853, "text": "Doesn't matter what level you're at, it's one size fits all."}, {"time": 7855, "text": "So you can't get out of the training what you're looking to get out of the training."}, {"time": 7859, "text": "It's whatever the instructor's teaching."}, {"time": 7863, "text": "And you can't learn because it's not at the appropriate level for you."}, {"time": 7866, "text": "And usually you're pushed into doing randori where you have no choice but to do the randori part of the training."}, {"time": 7873, "text": "So it's a challenge to go learn."}, {"time": 7874, "text": "And then a lot of times the schools are old school, so they go make you do falls for a half hour."}, {"time": 7880, "text": "They make you do things, maybe you're a jujitsu person who knows how to fall already, but you haven't proven it to the judo instructor and they don't break the norm and say you still have to fall for six months, which turns a lot of people away as well."}, {"time": 7892, "text": "So it's like any business."}, {"time": 7896, "text": "If you don't deliver on your customer's expectations, you're not gonna have very many customers, which is the way it is now."}, {"time": 7904, "text": "So a lot of people who listen to this, but in general in the United States practice Brazilian jujitsu, which has a lot of similarities to judo as obviously its origins in judo."}, {"time": 7917, "text": "How would you compare the two arts from the perspective of people just interested about both arts?"}, {"time": 7924, "text": "Do you recommend people who do jujitsu get into judo?"}, {"time": 7928, "text": "How can it enrich their jujitsu?"}, {"time": 7930, "text": "How do you compare the two arts, the actual practice of it and why it might be useful to you?"}, {"time": 7935, "text": "I mean, I think that judo is a hard sport for adults to do."}, {"time": 7940, "text": "Especially people that haven't fallen in a long time, aren't very athletic, haven't..."}, {"time": 7947, "text": "I think about my own experience, right?"}, {"time": 7949, "text": "Other than judo, when did I ever do like a forward somersault?"}, {"time": 7953, "text": "Maybe when I was in grade school, right?"}, {"time": 7955, "text": "That's the last time I've left my feet was in grade school."}, {"time": 7959, "text": "Most people haven't got off of a chair or a couch."}, {"time": 7962, "text": "They spend eight to 10 hours a day either working behind a computer or sitting on their couch watching TV, right?"}, {"time": 7968, "text": "And they're not that athletic."}, {"time": 7970, "text": "And they haven't done anything athletic at least probably since high school, right?"}, {"time": 7975, "text": "That's their last athletic endeavor, most of them."}, {"time": 7977, "text": "So you're talking about as an adult, that's 35 or 40 wanting to start a sport."}, {"time": 7981, "text": "Judo is a really hard sport to start, especially in today's dojos that don't have a recreational adult program."}, {"time": 7989, "text": "You know, when it's one size fits all, it's hard."}, {"time": 7991, "text": "So for those people, jujitsu makes a heck of a lot of sense."}, {"time": 7995, "text": "Good self defense, it's cerebral, where you got to use your brain, you're a smaller person, you have to use technique, you know, it teaches all the same things as judo, but it's a safe way to do it."}, {"time": 8007, "text": "And because of the validation it has with the UFC and MMA today, right?"}, {"time": 8013, "text": "Everybody knows jujitsu."}, {"time": 8014, "text": "So now they can be part of mainstream society and talk intelligently about what they see on television or what's going on on ESPN today, right?"}, {"time": 8022, "text": "They have some knowledge."}, {"time": 8023, "text": "So they have an identity."}, {"time": 8025, "text": "And also there's a good culture in jujitsu where it's becoming a family."}, {"time": 8029, "text": "You know, the dojo is the family place."}, {"time": 8031, "text": "You go to feel good, you go to see your friends, you go to get fit and you have a good time, right?"}, {"time": 8037, "text": "So it makes a lot of sense why it's growing."}, {"time": 8039, "text": "Judo on the other hand, I think is a better sport for children to do."}, {"time": 8044, "text": "It's more, I would say fun and interactive."}, {"time": 8048, "text": "It's a little easier to teach the kids how to do the throwing skills and for safety and things like that."}, {"time": 8054, "text": "Their body can handle more than the adults can."}, {"time": 8056, "text": "They're less likely to get injured."}, {"time": 8060, "text": "It makes them better athletes because it's a lot more three dimensional in my opinion."}, {"time": 8065, "text": "So I think there's a good fit between judo can thrive from kids till whatever, high school, college."}, {"time": 8074, "text": "Jujitsu thrives from that 18 year old up, right?"}, {"time": 8077, "text": "Right now, that's kind of where it is."}, {"time": 8080, "text": "So as a dojo, you have to kind of focus on the teens and the college, like early 20s, that kind of."}, {"time": 8086, "text": "Or you need to have, if you're gonna be a successful judo dojo, you have to have that recreational fundamental adult program in your school where people actually come to judo, learn the moves, but aren't pushed into randori training and pushed into things where they're uncomfortable and they can't control the situation because there's too many unknowns."}, {"time": 8109, "text": "You got an education at Browns."}, {"time": 8112, "text": "You're somebody, it's amazing because as an Olympian and an Olympic coach, you always emphasize kind of balance and education, all of that side of life."}, {"time": 8122, "text": "So developing your brain too."}, {"time": 8124, "text": "So you are an Olympic medalist, a coach of Olympic medalists, you're a business owner."}, {"time": 8131, "text": "So successful in all these domains."}, {"time": 8133, "text": "So I have to ask, what advice would you give to young people today, high school, judo age, high school, college, undergrad, how to be successful in their career or just in life in general, how to live a life they can be proud of?"}, {"time": 8153, "text": "I think you have to be true to yourself."}, {"time": 8156, "text": "You have to decide what it is you really wanna do with your life."}, {"time": 8159, "text": "Like, and it's hard because when I grew up, I didn't know I was gonna be successful."}, {"time": 8164, "text": "When I was young, I didn't know I was gonna be an Olympic medalist."}, {"time": 8167, "text": "I certainly did envision myself owning a couple of companies that makes their living exclusively from martial arts or judo, cause that wasn't really an opportunity when I was a kid, but I've created that opportunity."}, {"time": 8179, "text": "I would just say that, pick something that you're passionate about."}, {"time": 8183, "text": "I was stuck in a career before where I wasn't passionate about it."}, {"time": 8186, "text": "And it was my wife who said, Jimmy, if you can figure out how to make your living exclusively from martial arts, where your brain and your heart and your passion is all towards one thing that you really like, then you'll be successful."}, {"time": 8201, "text": "And I left the job."}, {"time": 8202, "text": "I had three kids."}, {"time": 8203, "text": "I was working for monster.com."}, {"time": 8206, "text": "I was in internet marketing and I was working for that great company, nothing wrong with the company, but sitting behind the desk from eight till five."}, {"time": 8215, "text": "And then I get to go to judo from six till nine at night."}, {"time": 8219, "text": "My whole day is tied up doing something that I'm really not passionate about."}, {"time": 8222, "text": "She said, if you can figure out how to make money from your dojo and other things judo related, then I think you'll be successful."}, {"time": 8230, "text": "And so she's the one that my wife, Marie, gave me that advice and I would give that to others."}, {"time": 8233, "text": "Find something that you love doing where it doesn't feel like work, something you're passionate about."}, {"time": 8238, "text": "And if the opportunity doesn't exist how to make money on it, you can create the opportunity."}, {"time": 8243, "text": "Be resourceful, figure it out."}, {"time": 8245, "text": "Don't let anybody tell you you can't do it."}, {"time": 8248, "text": "I didn't know that I could have a 200 person judo school that only taught judo because that really didn't exist in this country."}, {"time": 8255, "text": "That actually charges money like jujitsu charges."}, {"time": 8258, "text": "We're talking not, there's plenty of clubs out there that charge 10 bucks a month that might have 100 people, but there's not many that, where the tuition is $150 a month having 200 people."}, {"time": 8268, "text": "So that's a successful business, but it wasn't done before."}, {"time": 8272, "text": "But be passionate about it, understand you're gonna fail, understand you're gonna get knocked down, beat up, right?"}, {"time": 8278, "text": "There's gonna be dark days, but you gotta persevere."}, {"time": 8281, "text": "You gotta believe in yourself."}, {"time": 8283, "text": "You gotta have a plan."}, {"time": 8284, "text": "You have to be willing to learn from other people."}, {"time": 8287, "text": "And that's what I did."}, {"time": 8289, "text": "If I didn't know it, I brought somebody in to tell me, what am I doing wrong?"}, {"time": 8293, "text": "Like, look from the outside, what do you see?"}, {"time": 8296, "text": "Then you gotta be willing to change."}, {"time": 8297, "text": "You gotta be willing to adapt."}, {"time": 8300, "text": "And I think listening, believing in myself, and creating opportunity."}, {"time": 8306, "text": "And the other thing is helping others."}, {"time": 8308, "text": "Something I always did in my judo life and in my business life."}, {"time": 8315, "text": "If somebody came to me and asked for help with, hey man, is there something you can do to help me?"}, {"time": 8320, "text": "I'm trying to get this thing started."}, {"time": 8322, "text": "I'm trying to get this dojo off the ground, or I'm trying to run this event series, or I was creative and trying to figure out a way to help them make it work."}, {"time": 8332, "text": "Because if that really was their dream, and I could help them do their dream, I felt like that person would then give nothing but good, good comments about us."}, {"time": 8342, "text": "Good, good, like they'll remember it forever."}, {"time": 8345, "text": "They become like family."}, {"time": 8346, "text": "And they'll be the best advocates for your business ever."}, {"time": 8349, "text": "And so the kids that I taught at my dojo were treated that way."}, {"time": 8353, "text": "The people that worked for me get treated that way."}, {"time": 8355, "text": "The people that, my customers that I work with and building their dojos, get treated that way."}, {"time": 8362, "text": "People that ran tournaments, whether it was Grappler's Quest years ago, and helping that guy with a full set of mats for his, Brian Simmons with his thing, or any of the Gracie's."}, {"time": 8374, "text": "It just became like family."}, {"time": 8376, "text": "And then I just work hard and deliver on what I say I'm gonna do."}, {"time": 8379, "text": "If I say I'm gonna do it, I do it."}, {"time": 8381, "text": "And I think it goes a long way."}, {"time": 8383, "text": "Well, and I got a comment."}, {"time": 8384, "text": "So in a small way, people may not know."}, {"time": 8388, "text": "I think it's still on YouTube."}, {"time": 8389, "text": "We previously talked many years ago."}, {"time": 8392, "text": "And I remember it, you were so kind to me."}, {"time": 8396, "text": "And you didn't really know who I was."}, {"time": 8398, "text": "You just took me as a human being."}]}]