[{"title": "Brett Johnson: US Most Wanted Cybercriminal | Lex Fridman Podcast #272", "id": "cC1LFC0KFSw", "quotes": [{"time": 281, "text": "Wait, wait, wait, the neighbor acted as a pimp?"}, {"time": 285, "text": "My mom prostituted, I mean, she acted as a pimp for a neighbor."}, {"time": 290, "text": "Her name was Debbie and my mom used to sell her out."}, {"time": 294, "text": "Debbie needed money and my mom would find men for her to sleep with for cash and she'd take a part of the cash."}, {"time": 300, "text": "So Sauna's like she diversified the methodologies by which she hustled."}, {"time": 306, "text": "Very, had that entrepreneurial spirit."}, {"time": 310, "text": "You know, we see that a lot with cyber criminals, you know, that sense of being that entrepreneur."}, {"time": 316, "text": "So what was the motivation you think for her?"}, {"time": 319, "text": "Is it money?"}, {"time": 322, "text": "Is it basically the rush of playing with the system or being able to know the rules and break the rules and get away with it?"}, {"time": 332, "text": "My mom's a complex character."}, {"time": 334, "text": "She is, there's no one single motivation."}, {"time": 336, "text": "So my mom was the individual, she's still alive."}, {"time": 340, "text": "My mom was the individual who tested people."}, {"time": 345, "text": "She wanted to know how far she could abuse you and you come back and still love her."}, {"time": 350, "text": "So, and that was with every relationship she's ever had."}, {"time": 353, "text": "She would cheat on the men she was involved with."}, {"time": 356, "text": "She would abuse her children, me and Denise."}, {"time": 359, "text": "She would..."}, {"time": 360, "text": "Psychological, physical?"}, {"time": 362, "text": "Oh, it was mental, emotional, physical, everything, everything."}, {"time": 367, "text": "I mean, she used to beat me and Denise with belt buckles, you know, and that ended when she was, I forgot what we had done."}, {"time": 378, "text": "It wasn't much."}, {"time": 379, "text": "I think that it may have been the part where she accused me of stealing her marijuana, but she was hitting me and Denise."}, {"time": 389, "text": "We were living in a single wide trailer at that point."}, {"time": 392, "text": "She was hitting me and Denise."}, {"time": 393, "text": "We were on the bed trying to get away from it."}, {"time": 395, "text": "And Denise kicks her through a closet is what happens."}, {"time": 400, "text": "And Denise stands up and she said, you're through hitting me."}, {"time": 405, "text": "And that was the last time that mom hit us at that point."}, {"time": 410, "text": "So sorry to take us there."}, {"time": 411, "text": "You're, for people who know you and people should definitely watch some of your lectures online."}, {"time": 417, "text": "You're extremely charismatic and fun and jolly and whatever word you want to use."}, {"time": 423, "text": "But, you know, if we look at that kind of life, there's darkness there, there's a struggle there."}, {"time": 430, "text": "There's a lot of darkness."}, {"time": 432, "text": "So if you, how did you feel?"}, {"time": 436, "text": "If you go back to the mind of the kid you were with your mom, was there sadness?"}, {"time": 444, "text": "Was there things like depression, self doubt, all those kinds of things, or did you see this crime, this chaos as ultimately exciting?"}, {"time": 454, "text": "You know, I don't think, back then I didn't view it as exciting."}, {"time": 457, "text": "Now it becomes exciting when I start being involved in cyber crime, all right?"}, {"time": 462, "text": "But back then it was simply a means to an end was all it was."}, {"time": 465, "text": "So you take a 10 year old kid and the way I get involved in crime is, like I said, my mom was the fraudster."}, {"time": 471, "text": "My dad was a good guy."}, {"time": 473, "text": "He just forgot he was this good guy."}, {"time": 475, "text": "You know, he was always, he always had these principles, but his issue was is he loved my mom so much, he was scared of her leaving."}, {"time": 484, "text": "So if she wanted to do something, commit crime, cheat on him, whatever, he would pretty much just put up with it the one instant."}, {"time": 494, "text": "So, I mean, this woman used to, she used to bring men home in front of him, tell him that, hey, I'm leaving you."}, {"time": 501, "text": "I don't love you anymore."}, {"time": 502, "text": "I want you to die, blah, blah, blah, blah, blah."}, {"time": 504, "text": "This was my mom."}, {"time": 505, "text": "There were two instances where the man, where he can't take it anymore."}, {"time": 513, "text": "And the first instance, I was, I guess I was seven or eight."}, {"time": 516, "text": "My sister Denise is a year younger than I am."}, {"time": 518, "text": "My dad actually files for divorce, files for divorce at that point."}, {"time": 522, "text": "My mom kind of goes crazy."}, {"time": 525, "text": "My dad, I was with my dad."}, {"time": 527, "text": "My sister was with my mother because that's that Eastern Kentucky mentality."}, {"time": 530, "text": "You know, men stay with men, women stay with women."}, {"time": 533, "text": "So he was filing for divorce."}, {"time": 537, "text": "Me and my dad, we were living in an apartment."}, {"time": 540, "text": "My mom was living with her grandparents and with her parents bouncing back and forth between the two."}, {"time": 547, "text": "And I remember I was sleeping in the bed."}, {"time": 548, "text": "We had a single wide bed."}, {"time": 549, "text": "My dad slept on the sofa."}, {"time": 552, "text": "I woke up one night and there was some sort of ruckus in the living room."}, {"time": 556, "text": "So I wake up and I walk into the living room and my mom has a knife to my dad's throat."}, {"time": 562, "text": "And basically you're not going to steal my son from me."}, {"time": 565, "text": "My mom was this individual that when she knew she went so far, like I said, she was always this person that tested."}, {"time": 572, "text": "What can I do this to you?"}, {"time": 573, "text": "And you'll still come back."}, {"time": 576, "text": "She knew, she was always also this person that if she went too far, she knew it."}, {"time": 582, "text": "And she would always try to divert that into something else."}, {"time": 586, "text": "All right, so she knew at that point she'd went too far."}, {"time": 589, "text": "So what does she do?"}, {"time": 590, "text": "She gets up crying, goes to the bathroom and pretends to slit her wrists so that my dad Ray will respond to that, not respond to what she's just done to him."}, {"time": 602, "text": "That was my mom in a nutshell."}, {"time": 603, "text": "She had a history of doing this kind of stuff."}, {"time": 607, "text": "Motivations as far as fraud with her, I think with her it was, she was an LPN."}, {"time": 614, "text": "She had a very good nurse, but she didn't want to work."}, {"time": 619, "text": "It was a lot of it."}, {"time": 621, "text": "So with her, it was easier for her to commit fraud."}, {"time": 625, "text": "And when I say commit fraud, it was against businesses, against people."}, {"time": 629, "text": "I remember at one point she's buying over the counter capsules and emptying the capsules out and putting some other crap in there and selling at a speed and people were buying it."}, {"time": 639, "text": "She did anything she could for money."}, {"time": 641, "text": "And of course I get involved with that."}, {"time": 642, "text": "What happens is we were in Panama City at that point and my mom leaves my dad and the way she left my dad, my great grandfather had died."}, {"time": 655, "text": "My mom tells all three of us, hey, I'm taking the kids and we're going back to Eastern Kentucky to attend the funeral."}, {"time": 662, "text": "Well, that was her leaving."}, {"time": 665, "text": "Me and Denise didn't know it."}, {"time": 666, "text": "She didn't pack any of our clothes at all."}, {"time": 667, "text": "She stows her clothes in the trunk of the car and she leaves my dad and I don't get to see my dad again for I think five, six years, something like that."}, {"time": 676, "text": "My mom, like I said, she used to bring men home in front of my dad."}, {"time": 679, "text": "She would, he'd sit there and cry and beg her not to do it."}, {"time": 682, "text": "She'd do it anyway."}, {"time": 684, "text": "When she leaves him, she kept up that."}, {"time": 688, "text": "So we were living at my grandparents house."}, {"time": 691, "text": "My grandfather, he had converted the house."}, {"time": 693, "text": "He had raised the house up and built apartments underneath of it."}, {"time": 697, "text": "So me and my sister and my mom lived in one of the apartments underneath and that whole side of the family was just nuts, was nuts."}, {"time": 705, "text": "My granddad, Paul, he would, this is a man that he didn't want you to eat any of his food."}, {"time": 716, "text": "So, you know, there was no such thing as me and Denise going upstairs to eat."}, {"time": 720, "text": "If he found out me and Denise was taking a bath, we were allowed to bath and bathe in two inches of water one time a week because he didn't want to have to pay the water bill."}, {"time": 730, "text": "There are rules."}, {"time": 731, "text": "You know, if you couldn't have the TV on, when he went to bed at night, you had to have the television, the volume."}, {"time": 737, "text": "You could watch it, but without volume because if he heard it, he would get up in the middle of the night and he would kick the power breaker, turn off all the power on you."}, {"time": 746, "text": "This is my, this is my, the family, right?"}, {"time": 749, "text": "So my mom, she used to leave me and Denise at home for days, man, for days."}, {"time": 754, "text": "She'd go out and, you know, party."}, {"time": 756, "text": "And I mean, sometimes she'd take me into these with her."}, {"time": 760, "text": "We'd wait in the car."}, {"time": 761, "text": "Sometimes we'd wait in the living room as she went and partied and everything else."}, {"time": 766, "text": "Most of the time she left us at home and my entry into crime, Denise walks in one day, she's nine years old, man."}, {"time": 774, "text": "She walks in one day and she's got a pack of pork chops in her hand and looked at her and I said, where'd you get that?"}, {"time": 780, "text": "She's like, I stole it."}, {"time": 781, "text": "And you know, it's like, show me how you did that."}, {"time": 784, "text": "So she takes me over and she shows me how she steals food, how she's stuffing it down her pants."}, {"time": 789, "text": "So we start stealing food."}, {"time": 790, "text": "I'm like, hell yeah, let's do that shit."}, {"time": 791, "text": "So start stealing food."}, {"time": 793, "text": "And we get to the point where we're wanting a sandwich."}, {"time": 796, "text": "Well, you can't stuff a loaf of bread down your pants."}, {"time": 798, "text": "So there was a Kmart in the shopping center."}, {"time": 800, "text": "I go over to the Kmart, get a hoodie off the rack, take the tags off of it, wear it out, work just fine."}, {"time": 808, "text": "And the way you steal bread is you put the hoodie over your shoulder, stuff a loaf of bread down the sleeve and you walk out with it."}, {"time": 814, "text": "So we started doing that."}, {"time": 816, "text": "Just thought pattern."}, {"time": 818, "text": "So there's like strategic thinking here."}, {"time": 823, "text": "Yeah, you know, you can't wear the hoodie and put the bread down here cause you might mash the bread when you zip it up or they might notice the bread."}, {"time": 829, "text": "Yeah, we have to think through that."}, {"time": 830, "text": "You gotta think through it."}, {"time": 831, "text": "But you gotta realize by this point, I'm already seeing what my parents are doing."}, {"time": 837, "text": "You know, I'm already seeing the plotting."}, {"time": 839, "text": "That kind of puzzle solving was something you were already developing yourself individually cause you're pretty young."}, {"time": 844, "text": "Yeah, 10 years old, pretty young."}, {"time": 845, "text": "But seeing how they act, how they respond to things."}, {"time": 848, "text": "And my mom, I guess you could call it a good thing, they never kept any of that hidden from the kids."}, {"time": 854, "text": "You know, there was no discussions behind closed doors."}, {"time": 857, "text": "All that happened in front of everybody."}, {"time": 859, "text": "And from your young minds perspective, seeing that kind of crime, you basically, you know, a lot of us kind of grow up thinking there's rules you're not supposed to break."}, {"time": 869, "text": "If you see other humans breaking those rules, then you realize those rules are just human made."}, {"time": 875, "text": "But it gets worse than that."}, {"time": 877, "text": "I was in an environment where there were no decent people."}, {"time": 882, "text": "I didn't really meet my first decent person until I was 16 years old."}, {"time": 888, "text": "That was a high school teacher."}, {"time": 889, "text": "So what happens is, you know, we start shoplifting food."}, {"time": 894, "text": "My mom finds out that we've been stealing stuff and you know, she joins us."}, {"time": 899, "text": "She joins us."}, {"time": 900, "text": "Yeah, she comes in, you know, I've got the television, I've got the Atari 2600, play the hell out of it."}, {"time": 905, "text": "She starts seeing this shit."}, {"time": 906, "text": "She's like, where'd this come from?"}, {"time": 908, "text": "And I'm like, well, we found it."}, {"time": 909, "text": "She's like, you didn't find that."}, {"time": 910, "text": "Denise, Denise stands up, we stole it."}, {"time": 913, "text": "My mom, show me how you did that."}, {"time": 916, "text": "And she gets her mom too, to join in."}, {"time": 919, "text": "And she used to run me and Denise as these little shoplifters."}, {"time": 921, "text": "We'd take, you know, we'd steal stuff for her."}, {"time": 924, "text": "We would distract security and her and my grandmother would steal stuff."}, {"time": 930, "text": "They got caught doing that."}, {"time": 932, "text": "But that's the entry into crime."}, {"time": 934, "text": "And Denise, you know, I'm adamant and I kind of mean it."}, {"time": 941, "text": "But the truth is I say, and I do mean it, that I'm responsible for my choices as an adult, all right?"}, {"time": 949, "text": "I believe that when you're a child, you can't control that."}, {"time": 952, "text": "The adults in your environment control what you do."}, {"time": 955, "text": "Once you're an adult though, your choices are yours."}, {"time": 958, "text": "Now that being said, there's some, you can't dismiss that childhood influencing what I did as an adult."}, {"time": 972, "text": "I mean, it was kind of written on slate that, hey, this guy's gonna be this guy when he grows up."}, {"time": 978, "text": "That's like sometimes that one person you meet, that decent person can turn the tide of your life."}, {"time": 984, "text": "So what happens is, you know, the abuse, everything continues on, when I'm 15, my dad was in Panama City, Florida."}, {"time": 993, "text": "My mom was in, you know, we were in Hazard, Kentucky."}, {"time": 998, "text": "She was dating this guy."}, {"time": 1000, "text": "My mom was this woman that the abuse would, it was crazy abuse, man, just crazy stuff."}, {"time": 1009, "text": "She would tell me and my sister, you know, that she gave up her life for us, that she was gonna leave one day and never come back, that we'd find her dead in a ditch someplace."}, {"time": 1020, "text": "She'd go out and date these men and she'd come back and she'd talk about how these men were abusing her."}, {"time": 1025, "text": "You know, so she'd be dating this guy and she'd come back and she'd, you know, start talking about how he had tried to rape her, you know, trying to get me to respond to that."}, {"time": 1034, "text": "And I would respond to that."}, {"time": 1036, "text": "Make no doubt, I would respond to that."}, {"time": 1038, "text": "Well, what happens is, and I knew that, I don't know if I knew it was abuse at that age, all right, but I knew things were fucked up."}, {"time": 1045, "text": "And I was talking to my dad in Panama City and I really had it in my head that I was gonna go down and live with my dad."}, {"time": 1055, "text": "And I called my dad one day."}, {"time": 1060, "text": "I was set to go to, me and my cousins were gonna go see Return of the Jedi."}, {"time": 1065, "text": "It had came out again in the theaters."}, {"time": 1068, "text": "So I called my dad, it was a Sunday, called my dad and he told me, he had either gotten married or he was about to get married to this woman."}, {"time": 1076, "text": "And basically Brett Johnson wasn't gonna go down to Florida."}, {"time": 1081, "text": "You know, I was gonna stay in Hazard."}, {"time": 1083, "text": "I had to call my dad from payphone, but the result of that was I walked him into a hospital, got in an elevator and a woman got in the elevator at the same time and I snapped and beat the hell out of her right there."}, {"time": 1101, "text": "And I was 15, didn't really know what the fuck happened."}, {"time": 1107, "text": "Didn't really know, but."}, {"time": 1109, "text": "Just anger came from somewhere."}, {"time": 1112, "text": "And you know, the elevator, beat the hell out of this lady."}, {"time": 1120, "text": "Turned out she looked a shitload like my mom, but the elevator doors open."}, {"time": 1128, "text": "And one of the security guards, I played basketball with his son."}, {"time": 1133, "text": "So he saw me immediately."}, {"time": 1135, "text": "I knocked the hell out of him, took off running, made it back to the house where my grandparents were."}, {"time": 1142, "text": "They didn't know what had happened."}, {"time": 1144, "text": "So I didn't say anything."}, {"time": 1147, "text": "About an hour later, Kentucky state police, they pull up in the front yard and two of them get out and I'm sitting on the front porch and me and my cousins are and they start walking up where everybody starts walking out of the house."}, {"time": 1159, "text": "And I'm like, I just remember saying, what do you want?"}, {"time": 1161, "text": "What do you want?"}, {"time": 1162, "text": "Well, you know what they wanted."}, {"time": 1163, "text": "They wanted to arrest Brett Johnson and they arrested me."}, {"time": 1167, "text": "I went in and I told them everything."}, {"time": 1171, "text": "Spent three months in a county jail."}, {"time": 1173, "text": "They didn't have juvenile facilities in that county."}, {"time": 1177, "text": "So I spent three months in solitary, went to trial, pled guilty to assault in the first degree."}, {"time": 1184, "text": "The judge sentenced me to time served and a psychological evaluation where they sent me to Louisville, Kentucky."}, {"time": 1194, "text": "Spent 30 days up there and they cut me loose."}, {"time": 1195, "text": "They wanted me to have counseling after that and never went to counseling."}, {"time": 1202, "text": "You know, I wanted to, but mom was like, don't need it."}, {"time": 1205, "text": "And so never went to counseling."}, {"time": 1208, "text": "And I became this pariah in the county."}, {"time": 1216, "text": "I mean, not a day goes by that I don't think about that."}, {"time": 1221, "text": "That moment in the elevator."}, {"time": 1224, "text": "And what happens is, you know, you're 15."}, {"time": 1229, "text": "Fuck man, you're 15."}, {"time": 1231, "text": "So I go back to the high school that I was in and I'm this piece of shit."}, {"time": 1238, "text": "So everybody, you're not the outcast."}, {"time": 1241, "text": "Everybody knows."}, {"time": 1243, "text": "So I moved, we moved, we were in Whitesburg at that point."}, {"time": 1247, "text": "I finished up the year there and moved back to Perry County, which is where Hazard is."}, {"time": 1255, "text": "So we moved there and they've got three high schools here."}, {"time": 1257, "text": "They've got MC Napier, they've got Hazard High School and then they've got Dills Combs High School."}, {"time": 1262, "text": "So I was within, me and Denise were within half mile of MC Napier."}, {"time": 1270, "text": "Show up there the first day of school and I met me and my mom and my sister were walking into the school and the kids won't let me in."}, {"time": 1280, "text": "The kids stand out there, he's not coming in."}, {"time": 1286, "text": "So my mom starts raising hell and I'm like, nah, let's just go, let's go."}, {"time": 1290, "text": "So from there it was, we went down to the city school, Hazard and the principal tells my mom, Denise can come, he can't."}, {"time": 1300, "text": "So my mom wants to raise hell and I'm like, no, let's just take me to this other school."}, {"time": 1305, "text": "So this other school was like 15 miles away and country high school."}, {"time": 1315, "text": "So I go there and they accept me and I walked in the first day and this English teacher name's Carol Combs, I walked in and handed her the paper, she was my homeroom teacher and she heard this voice, that is the way she explains it today, she heard this voice and she looks up and she was like, son, have you ever done any drama before?"}, {"time": 1344, "text": "And I'm like, no maam, but I'm interested in the academic team, I was this quick recall guy, right?"}, {"time": 1351, "text": "And she's like, no."}, {"time": 1353, "text": "She's like, drama."}, {"time": 1357, "text": "I'm like, no, I'm not interested in theater, I'm interested in academics."}, {"time": 1361, "text": "Well, she was the head of the drama department and head of the academics department."}, {"time": 1366, "text": "So the deal was, tell you what, you can get on the academics team if you start with theater too."}, {"time": 1373, "text": "And I was like, okay."}, {"time": 1374, "text": "So what happens is she was the only, she was the first decent person I met in my life and she became this kind of surrogate mother to me."}, {"time": 1381, "text": "So under her tutelage, I become one of the top academic team guys in the state."}, {"time": 1389, "text": "Around there, I was captain of the team, I was this just scourge across all the counties in that part of Kentucky."}, {"time": 1396, "text": "If we had a meet, it was like, Jesus Christ, that's Brett Johnson."}, {"time": 1401, "text": "And it was like, she used to tell people they would, the high school that I came from was Whitesburg and the first time that Whitesburg came against us, she told me, I was talking to her about a year ago and she told me, she's like, Brett, she said, that first meet against Whitesburg, she said, the captain came in, looked at you and said, oh, you've got that Johnson boy on your team?"}, {"time": 1427, "text": "And she said, my response was that Johnson boy is our team."}, {"time": 1432, "text": "So, but I did that and then with theater, I ended up, my senior year, I won best actor and actress in the state."}, {"time": 1444, "text": "Only guy to ever do that in the state."}, {"time": 1445, "text": "So, did pretty well, man, did pretty well."}, {"time": 1448, "text": "Had scholarships coming out of high school and everything else and I'm the idiot that turned them down."}, {"time": 1454, "text": "Ask you a funny question."}, {"time": 1456, "text": "You'd make a hell of a, I mean, of all the many things you could probably do, you would make a hell of a actor."}, {"time": 1463, "text": "I'm very good on stage."}, {"time": 1466, "text": "Have you acted professionally anywhere or not?"}, {"time": 1468, "text": "Not professionally."}, {"time": 1469, "text": "We've done the college circuit and stuff like that."}, {"time": 1471, "text": "What happened was is, so I turned down the scholarships, you know, scared of leaving, I guess is what it was."}, {"time": 1480, "text": "Started in community college and the community college there hires a new theater director out of California."}, {"time": 1486, "text": "Well, he knew the guy that ran the San Jose State Theater program."}, {"time": 1490, "text": "A guy named Edward Emmanuel was his name."}, {"time": 1493, "text": "His claim to fame, he had written the Three Ninjas movie."}, {"time": 1496, "text": "Remember that, the three little ninja kids back in the eighties, he had written this damn film and it had made a shitload of money."}, {"time": 1502, "text": "So, he invites Ed Emmanuel to come down and see the play and Ed had written this Civil War piece."}, {"time": 1509, "text": "So, we put that on."}, {"time": 1511, "text": "I was doing like, it was a multiple role thing."}, {"time": 1513, "text": "I was doing like 18 different roles in the show."}, {"time": 1516, "text": "So, Ed sees the show and he was like, scholarship."}, {"time": 1519, "text": "He said, look, he said, right now you're a big fish in a small pond."}, {"time": 1522, "text": "We'll make you a big fish in a big pot."}, {"time": 1524, "text": "And I was like, deal."}, {"time": 1525, "text": "So, I took the scholarship, man."}, {"time": 1527, "text": "And he was like, I'll be back in two weeks."}, {"time": 1529, "text": "So, he flies out."}, {"time": 1530, "text": "Two weeks later, this guy flies back in."}, {"time": 1532, "text": "He drives down to where I'm living."}, {"time": 1535, "text": "I'm out shooting ball with one of my cousins and friends."}, {"time": 1539, "text": "He pulls up and he gets out of the car and I was like, I'm walking over to him."}, {"time": 1543, "text": "I was like, hey man, I'll walk you in."}, {"time": 1545, "text": "You can meet my parents."}, {"time": 1547, "text": "He's like, no, I got it."}, {"time": 1548, "text": "I was like, okay."}, {"time": 1549, "text": "So, I keep shooting ball."}, {"time": 1550, "text": "He walks in the house, stays about 15 minutes, walks out, white as a sheet, doesn't say a word to me, gets in the car, leaves."}, {"time": 1560, "text": "I don't hear from him again."}, {"time": 1562, "text": "Had no idea what went on."}, {"time": 1564, "text": "Takes me a couple of weeks."}, {"time": 1566, "text": "What happened is my mom, he walks in and introduces himself."}, {"time": 1570, "text": "My mom pulls a knife on the guy."}, {"time": 1573, "text": "I will kill you."}, {"time": 1574, "text": "You are not going to steal my goddamn son from me."}, {"time": 1577, "text": "Scares the guy to death."}, {"time": 1579, "text": "He bugs out and kind of broke my spirit at that point."}, {"time": 1587, "text": "So, went into, just full fledged into scams, crimes, everything else."}, {"time": 1594, "text": "I had already been, when I was a minor, I'd already been kind of brought up on that side of the family with the crimes that they were doing."}, {"time": 1601, "text": "My mom was drug trafficking, the pimp stuff, illegally mining coal, charity fraud."}, {"time": 1608, "text": "Illegally mining coal?"}, {"time": 1610, "text": "Yeah, wildcatting coal."}, {"time": 1611, "text": "So, you... Can you explain that?"}, {"time": 1613, "text": "Yeah, so, to properly mine coal, you have to get a permit, all right?"}, {"time": 1618, "text": "Eastern Kentucky, a lot of people don't, they can't afford the permits."}, {"time": 1622, "text": "They can get them a piece of equipment."}, {"time": 1624, "text": "You get a dozer or a loader or whatever you're going to get or an auger or what have you."}, {"time": 1628, "text": "So, you start mining, but you don't get the permit."}, {"time": 1630, "text": "So, you don't have to do the, you don't have to pay."}, {"time": 1632, "text": "Back then, it was like $3,500 for a two acre permit or $5,000 for a two acre permit."}, {"time": 1637, "text": "Let you strip mine the coal on that."}, {"time": 1640, "text": "Then you have to pay for the reclamation on top of that."}, {"time": 1642, "text": "So, once you uncover the pit, take the coal out, you have to cover back up the pit, sow grass, make sure everything is environmentally friendly."}, {"time": 1650, "text": "You got a silt pond, everything else at that point."}, {"time": 1652, "text": "So, the whole idea is you buy an acre of land or some area of land and then you can, there's a whole process you're supposed to go through."}, {"time": 1658, "text": "Entire process."}, {"time": 1659, "text": "How many people involved in a mining, the smallest number of people required for a mining operation?"}, {"time": 1665, "text": "You can do it with three or four people."}, {"time": 1667, "text": "So, you've got your loader operator, you've got your dozer operator."}, {"time": 1669, "text": "You need, you can farm out the trucking to someone if you need that or trucking company if you need to do that."}, {"time": 1676, "text": "Then you've got your, whoever owns the business as well."}, {"time": 1678, "text": "So, very few people can run an operation like that and profit fairly well as long as you don't have to do the reclamation, all that crap on top of it, all right?"}, {"time": 1688, "text": "The reclamation gets pretty expensive."}, {"time": 1690, "text": "So, if you're uncovering a pit of coal, a pit, so a ton of coal is basically about 36 cubic inches is what a 2000 pounds of coal weighs if you're in Eastern Kentucky because it's at the weight of the bituminous coal and everything."}, {"time": 1705, "text": "The fact that you know this is awesome."}, {"time": 1706, "text": "The fact that you know exactly the volume of a ton of coal, I mean, it's great."}, {"time": 1714, "text": "Yeah, you learn this shit, right?"}, {"time": 1715, "text": "Can you rattle this shit off?"}, {"time": 1716, "text": "So, you uncover the pit and then you've got to sell the pit."}, {"time": 1720, "text": "Well, the thing is, is that, where are you gonna sell the coal?"}, {"time": 1723, "text": "Well, you sell it to one of these other coal tipples that knows that they're buying the shit illegally."}, {"time": 1728, "text": "So, back then a ton of coal was, they'd give you like 36 bucks per ton is what that is."}, {"time": 1734, "text": "And you'd have to go out and you'd test the BTUs on it."}, {"time": 1736, "text": "You take a sample to the lab, test the BTUs, you take that into the company."}, {"time": 1739, "text": "What BTU?"}, {"time": 1740, "text": "British Thermal Unit."}, {"time": 1742, "text": "So, you'd test what the BTU on the coal was."}, {"time": 1744, "text": "How pure the coal is."}, {"time": 1745, "text": "How pure the coal is, what BTU it burns at."}, {"time": 1748, "text": "Back then, a good BTU was around 12.9 was what you'd get, all right?"}, {"time": 1754, "text": "So, 12.9 coal, $36 a ton."}, {"time": 1757, "text": "You'd take that sample over to the coal tipple."}, {"time": 1759, "text": "They'd say, okay, we'll buy this for you."}, {"time": 1761, "text": "How many trucks you got or how many tons you got?"}, {"time": 1763, "text": "And you'd say, this is what we've got."}, {"time": 1764, "text": "Then you'd hire the trucking company."}, {"time": 1766, "text": "And where you get it out because you've got the agents that are looking for you by this point because the people that you've bought the rights to whoever the landowner is, you said you're gonna give them $2 a ton or whatever this is."}, {"time": 1781, "text": "Well, the other people there, are you paying them off or are you not?"}, {"time": 1785, "text": "Well, if you're not paying them off, guess what?"}, {"time": 1787, "text": "They know your ass is mining it illegally."}, {"time": 1789, "text": "They're gonna report you."}, {"time": 1790, "text": "Well, all of a sudden, you've got all these inspectors that are coming around and everything."}, {"time": 1794, "text": "Hey, we know what you're doing."}, {"time": 1795, "text": "So, they're looking for you to get the pit out."}, {"time": 1797, "text": "So, when do you get the pit out?"}, {"time": 1798, "text": "Right in dead of night."}, {"time": 1800, "text": "So, you're loading it up two o clock in the morning, hauling this ass out is what you're doing."}, {"time": 1804, "text": "You sell it out from there."}, {"time": 1807, "text": "And your mom ran operations like this?"}, {"time": 1810, "text": "And you said you worked the mine too when you were younger?"}, {"time": 1812, "text": "Yeah, I learned how to run a loader, run a dozer, learn how to clean off a pit, everything like that."}, {"time": 1818, "text": "So, this is the lifestyle you grow up in."}, {"time": 1822, "text": "You learn how to do this stuff."}, {"time": 1823, "text": "And so, I knew how to do charity fraud as well, insurance fraud, so."}, {"time": 1828, "text": "Charity fraud."}, {"time": 1829, "text": "Can we break down some of these?"}, {"time": 1831, "text": "Charity fraud, it's much more romantic than what it sounds."}, {"time": 1834, "text": "It was basically, it was basically standing beside the road with a sign and a bucket taking up collections for homeless shelters, for abused women, for children, stuff like that."}, {"time": 1847, "text": "Then later on, I branched off."}, {"time": 1849, "text": "When I started off on my own, I would set up my own charity company and do some telemarketing and go on by and collect checks and things like that."}, {"time": 1857, "text": "We're gonna talk about that."}, {"time": 1858, "text": "But actually, can we just step back and talk about your mom and your dad?"}, {"time": 1864, "text": "Given all of that, given all the abuse, the complex ways that she played with love, to see how far she can push you and the people around her, and they still love her."}, {"time": 1878, "text": "Today, do you love her?"}, {"time": 1880, "text": "You know, I called my dad yesterday."}, {"time": 1882, "text": "My dad, he's dying now."}, {"time": 1884, "text": "He's got a heart condition."}, {"time": 1885, "text": "He's not gonna get the operation to fix it."}, {"time": 1887, "text": "So he's like, fuck it, I'm ready to go."}, {"time": 1889, "text": "And I'm like, I looked at him, because hell, I'm 52 now."}, {"time": 1892, "text": "Prior to 52, I'd have been like, no, you need to do this."}, {"time": 1895, "text": "But I looked at him and I was like, I understand."}, {"time": 1900, "text": "And so he's not gonna get the operation."}, {"time": 1902, "text": "I was talking to him yesterday and he asked me, he's like, have you seen your mom?"}, {"time": 1905, "text": "And I was like, dad, I've not talked to her for about two years."}, {"time": 1908, "text": "And I told him, I was like, I love my mom, but my mom is not a good person."}, {"time": 1914, "text": "She's not."}, {"time": 1915, "text": "And he told me, I was talking to him on the phone yesterday, and he told me that it took him several years to really understand that."}, {"time": 1923, "text": "You know, he loved her too, but it takes, when you're getting abused like that, especially my dad, my dad came from a good family, everything else, and, you know, upstanding family."}, {"time": 1933, "text": "And I think that when you're that victim of abuse, you know, you've never seen it before, you've never encountered it, and then it happens, well, you're like that frog in water all of a sudden."}, {"time": 1945, "text": "You know, you get to the point where it gradually increases until how do you get out of it?"}, {"time": 1950, "text": "Everybody else sees what's happening, but you don't."}, {"time": 1952, "text": "I grew up in that environment though, you know, so it took me a long time to come to terms with that."}, {"time": 1959, "text": "My sister came to terms with it long before I did."}, {"time": 1962, "text": "You know, my sister, she's been a decade without talking to my mom, like she had tried to commit suicide, I didn't know that."}, {"time": 1968, "text": "What got me so bad is she said at one point that she always thought someone was gonna come in and save us, and my response, just immediate response, not even thinking about it, my response was, well, Denise, I knew no one ever was."}, {"time": 1982, "text": "And looking at things now, I think that's where our paths diverged."}, {"time": 1990, "text": "Me, it was, if you wanna do it, if anybody's gonna take care of you, you gotta take care of yourself."}, {"time": 1995, "text": "You're on your own."}, {"time": 1996, "text": "You're on your own, you know, it's up to you."}, {"time": 2000, "text": "And Denise has always been that child that has expected someone to come in and save her."}, {"time": 2007, "text": "Well, and almost like it's all going to be okay, somebody."}, {"time": 2011, "text": "Yeah, and I knew it wasn't."}, {"time": 2013, "text": "No, no, you go."}, {"time": 2014, "text": "Unless you."}, {"time": 2015, "text": "Unless you make it okay, it ain't gonna be okay."}, {"time": 2018, "text": "So, you know, I was."}, {"time": 2020, "text": "Are you able to forgive her, your mom?"}, {"time": 2025, "text": "My boundary with my mom, the reason I've not spoken with her, over two years ago, I started this legal career of mine."}, {"time": 2035, "text": "I've been the guy who has, I spent a lot of time thinking about my past and those choices and what brought those choices around."}, {"time": 2044, "text": "So I'm big about taking responsibility for my actions."}, {"time": 2046, "text": "I truly am."}, {"time": 2047, "text": "I think it's really important you have to do that."}, {"time": 2049, "text": "Well, my mom, not so much."}, {"time": 2052, "text": "So I was talking to her, you know, and I would start saying, you know, she would start the conversation talking about, she didn't understand why Denise wouldn't speak to her anymore."}, {"time": 2062, "text": "That was one of her tropes."}, {"time": 2064, "text": "So, and my response started to become, well, because you were the abuser and you spent your life doing that to her."}, {"time": 2071, "text": "So it's more healthy for her not to talk to you."}, {"time": 2074, "text": "So she's still not able to see the flaws in her ways of the past."}, {"time": 2081, "text": "So my ultimatum to my mom was, look, when you're able to admit that you abused the people in your life, accept that responsibility and be able to discuss it with me, we'll have a talk."}, {"time": 2095, "text": "Other than that, I don't want to talk to you anymore."}, {"time": 2098, "text": "So for the first year it was, you know, calling, cussing my wife out, cussing me out, you know, I don't need you, blah, blah, blah, blah, blah."}, {"time": 2107, "text": "And then finally it started to taper off and she's never really contacted me after that point."}, {"time": 2112, "text": "And your dad is dying."}, {"time": 2118, "text": "What do you take from the way he's taken on death?"}, {"time": 2121, "text": "Just saying, fuck it."}, {"time": 2122, "text": "You know, it's the man."}, {"time": 2125, "text": "And what have you learned from your dad?"}, {"time": 2127, "text": "What do you love about your dad?"}, {"time": 2130, "text": "He's one of these guys that, you know, like I told him, I told my dad about the abuse and everything else."}, {"time": 2137, "text": "And there was a point."}, {"time": 2139, "text": "So, you know, I told you about the elevator stuff, but before that, man, it was, it took me 40 years to talk about that, but it also took me 40 years to talk about, there was a point that my mom and dad would leave the house and I would urinate in the floor."}, {"time": 2164, "text": "And... Is that like out of anger?"}, {"time": 2169, "text": "No, no idea why."}, {"time": 2172, "text": "But I would."}, {"time": 2172, "text": "Piss on the carpet."}, {"time": 2173, "text": "Carpet pissers like the Lebowski, right?"}, {"time": 2178, "text": "It really tied the room together, dude."}, {"time": 2180, "text": "It really tied the room together."}, {"time": 2182, "text": "I was talking about that and this lady comes up to me after the presentation and she had a career previous to that where she dealt with abused kids."}, {"time": 2191, "text": "And she told me, she was like, Brett, she's like, it's a control mechanism."}, {"time": 2197, "text": "The only control you had was that."}, {"time": 2200, "text": "And she's like, kids do that."}, {"time": 2202, "text": "And I was like, so I'm not unique."}, {"time": 2203, "text": "She's like, no, you're not unique in that."}, {"time": 2205, "text": "So that, you know, this whole history of abuse, Denise dealt with it by drinking, by trying to commit suicide, things like that."}, {"time": 2215, "text": "And then finally she escapes."}, {"time": 2216, "text": "I'm the kid that didn't."}, {"time": 2217, "text": "And not only that, my wife pointed out to me that, again, it's that Eastern Kentucky mentality stuff."}, {"time": 2222, "text": "You know, the male's expected to do things."}, {"time": 2224, "text": "So with me, it was almost like I stepped up to take part in those crimes so that Denise didn't have to."}, {"time": 2234, "text": "And she was able to avoid all that."}, {"time": 2236, "text": "Other than that one shoplifting stuff, Denise doesn't break the law anymore."}, {"time": 2239, "text": "She goes off to be a, she's a good parent."}, {"time": 2242, "text": "She's an angry parent."}, {"time": 2244, "text": "She's a good parent."}, {"time": 2244, "text": "She's a teacher, a good citizen overall."}, {"time": 2247, "text": "I was just the guy that kept right on going with it."}, {"time": 2250, "text": "Kept on going."}, {"time": 2251, "text": "So let me ask you about that."}, {"time": 2252, "text": "So your life of cyber crime."}, {"time": 2257, "text": "In describing some of the things you did or knew about, you said, quote, \"'I once stole several thousand dollars worth of coins \"'from a family trying to sell them \"'to put a new roof on their home."}, {"time": 2268, "text": "\"'Another time, I sent a counterfeit cashier's check \"'to a victim and he ended up being arrested for it."}, {"time": 2275, "text": "\"'I lied to family, friends, everyone I knew."}, {"time": 2278, "text": "\"'I was a truly despicable person.'\""}, {"time": 2282, "text": "\"'One of my Ukrainian associates script \"'had someone who owed him money kidnapped and tortured."}, {"time": 2288, "text": "\"'He posted pictures of it online."}, {"time": 2291, "text": "\"'Another member, Iceman, \"'used to flood his enemy's email addresses \"'with child pornography, then called the police on them.'\""}, {"time": 2299, "text": "That's some stories."}, {"time": 2300, "text": "Can you tell some of these stories that stand out to you that are particularly despicable or representative or interesting when you look back that defined your approach and who you were at that time?"}, {"time": 2316, "text": "Let me say that I did not care about my victim, all right?"}, {"time": 2321, "text": "I cared about me, is what I cared about."}, {"time": 2325, "text": "It's rough to admit that."}, {"time": 2330, "text": "You don't give a shit what you're doing to anybody else, you only care about you."}, {"time": 2332, "text": "But that's the truth of the matter."}, {"time": 2334, "text": "I didn't care about the victims."}, {"time": 2336, "text": "The lady, that wasn't even at the beginning of my career as a cyber criminal, that was right at the last of it."}, {"time": 2343, "text": "Which lady?"}, {"time": 2343, "text": "The coin lady."}, {"time": 2345, "text": "By that point, Shadow Crew had made the front cover of Forbes, August of 04."}, {"time": 2350, "text": "October 26th of 04, Secret Service had shut us down, 33 people arrested, six countries in six hours."}, {"time": 2356, "text": "I was the guy that was publicly mentioned as getting away."}, {"time": 2360, "text": "What happened was is I was the guy who was, I had kind of invented this crime called tax return identity theft and was stealing a lot of money."}, {"time": 2370, "text": "I went through all my stateside savings and Shadow Crew gets shut down."}, {"time": 2375, "text": "I don't have any way to come in with any money, so I start running counterfeit cashier's checks, defrauding people with that, having them send products or bullion collections, what have you, by COD, collect on delivery, and I would pay with it with a counterfeit cashier's check."}, {"time": 2391, "text": "This lady was on eBay."}, {"time": 2394, "text": "She had been collecting these silver coins all of her life."}, {"time": 2397, "text": "You know, the U.S. currency used to be, the coins used to be silver, so she had a whole collection of these things, like, I don't know, 80, 90 pounds of this stuff, and I'm a very good social engineer."}, {"time": 2410, "text": "So, convinced her that I was a legitimate person, that, you know, hey, send it to COD, you can use my FedEx account to do that or my UPS account to do that."}, {"time": 2420, "text": "I'll pay with a cashier's check, you can take it in, same as cash."}, {"time": 2425, "text": "She believed that, she was, even on the ad, and we talked on the phone and everything else, she had told me that she was a single parent, and it was the only money that she had to put a roof on the house for her and her kids, and I didn't give a damn."}, {"time": 2441, "text": "I didn't give a damn."}, {"time": 2442, "text": "What was more important was me at that point."}, {"time": 2444, "text": "Can I ask you a question about the social engineering aspect?"}, {"time": 2446, "text": "So maybe specifics like the methodology, email, you said phone, maybe you could discuss this process from a bigger philosophical perspective of what is it about human beings that makes it possible to be social engineer, to be victims of fraud?"}, {"time": 2469, "text": "So, first let me say that I became a social engineer as a child, all right, because the adults in my environment, as a child, I had to know exactly what they were thinking and be able to try to manipulate that for survival."}, {"time": 2486, "text": "So I became a social engineer for survival initially, all right, and one of the things that I've seen with a lot of cyber criminals is the exact same thing."}, {"time": 2495, "text": "They're really expert ones."}, {"time": 2497, "text": "They become a social engineer as a child, then later on, they use those tools to victimize others."}, {"time": 2502, "text": "Which is fascinating because you're, in order to understand what others are thinking, you have to be extremely good at empathy."}, {"time": 2509, "text": "So you have to like really put yourself in the shoes of the other person."}, {"time": 2513, "text": "And yet, in order to do cyber crime, you have to not care about the pain that might cause them once you manipulate them."}, {"time": 2523, "text": "So you have to empathize and yet not care."}, {"time": 2526, "text": "Exactly, and I would argue, I would argue that that is not a sociopath because a cyber criminal, and I was no different, most cyber criminals justify those actions."}, {"time": 2535, "text": "So the justification becomes what's important."}, {"time": 2538, "text": "With me, the justification was why I did it for my family, did it for my wife, did it for my stripper girlfriend."}, {"time": 2544, "text": "So, and I believe those justifications."}, {"time": 2545, "text": "That's a good story, I heard that one."}, {"time": 2547, "text": "I like that, because I care about love a lot."}, {"time": 2548, "text": "Yeah, so the big picture of that is trust."}, {"time": 2555, "text": "How do you establish trust with a potential victim?"}, {"time": 2560, "text": "All right, now I would argue online that that trust is established through a combination of technology, tools, social engineering."}, {"time": 2567, "text": "All right, so we trust our tech."}, {"time": 2570, "text": "We trust our cell phones, we trust our laptops."}, {"time": 2573, "text": "A lot of times we don't understand how they operate, but we trust the news that comes across the line."}, {"time": 2576, "text": "We trust the phone numbers that show up."}, {"time": 2579, "text": "We trust IP addresses if we're advanced enough to look at an IP address or a domain or anything else like that."}, {"time": 2585, "text": "Criminals use tools to manipulate that, spoof phone numbers, spoof browser fingerprints, whatever that may be, whatever the tool may be."}, {"time": 2594, "text": "Then that lays a base level of trust."}, {"time": 2596, "text": "At that point, you shoot in with the social engineering and lay whatever story that is in order to manipulate that victim to act not out of reason, but out of emotion all of a sudden."}, {"time": 2607, "text": "This is fascinating about the way humans interact with the world, which is you're almost too afraid to not trust the world."}, {"time": 2615, "text": "You have to find a balance."}, {"time": 2616, "text": "You have a lot of conspiracy theories now about distrusting institutions and thinking like everything around us."}, {"time": 2624, "text": "It's like I've been listening to people who believe the earth is flat."}, {"time": 2628, "text": "And that conspiracy theory is fascinating to me because it basically says that you can't trust anybody."}, {"time": 2637, "text": "Like everything you hear is a lie."}, {"time": 2640, "text": "So that's one, you can live that life or you can live a life where you're just naively trusting everything."}, {"time": 2646, "text": "And we as humans have to, because that life is kind of full of happiness if nobody screws you over."}, {"time": 2653, "text": "Cause you meet people with the joyful heart and you get excited and all that kind of stuff."}, {"time": 2658, "text": "But if you do that too much, you're gonna get burned."}, {"time": 2661, "text": "So you have to find some kind of balance in terms of optimizing happiness where you trust, I mean, but verify and on the internet that becomes really tricky."}, {"time": 2674, "text": "You're almost too afraid to distrust everything cause you'll never get anything done on the internet."}, {"time": 2678, "text": "But then if you trust too much, you can get screwed over."}, {"time": 2681, "text": "And so the social engineering comes in where you're like, I'm not sure if I should trust this."}, {"time": 2687, "text": "You kind of help them build the narrative where it's like, it's good."}, {"time": 2693, "text": "So in a lot of the times that social engineering is just feeding into what the victim wants to believe."}, {"time": 2701, "text": "It's not really coming up with a brand new story at all."}, {"time": 2703, "text": "It's just knowing what that victim is, what the motivations of that victim is feeding into it at that point."}, {"time": 2708, "text": "So you have to, again, that social engineer has to almost immediately know what's driving that person that they're talking about."}, {"time": 2716, "text": "If I'm working on a phone, talking to someone over the phone, I have to know within seconds what I need to say, how I need to act to interact with that customer service agent or whoever I'm talking to on the other end of the line."}, {"time": 2728, "text": "So fascinating because you truly are empathizing with the other person."}, {"time": 2733, "text": "Who is it?"}, {"time": 2734, "text": "This business man, Steven Schwarzman."}, {"time": 2736, "text": "And I've talked to a few times."}, {"time": 2740, "text": "He mentioned this thing that, the way you build deep relationships is you really kind of notice the things that people are telling you."}, {"time": 2751, "text": "Like what they want and what they're bothered by, what are their big problems in their lives?"}, {"time": 2758, "text": "Because everybody's saying that all the time and most of us are just ignoring it."}, {"time": 2763, "text": "But if you take the time to listen, you know somebody at that point."}, {"time": 2767, "text": "Absolutely you do."}, {"time": 2768, "text": "Then you have to be able to dismiss it."}, {"time": 2770, "text": "You have to dismiss it after."}, {"time": 2772, "text": "You're looking for that just to see how I can manipulate that is what you're trying to do."}, {"time": 2777, "text": "So the lady was one story, another truly despicable story."}, {"time": 2782, "text": "We'll get to script in a second."}, {"time": 2783, "text": "But another truly despicable story."}, {"time": 2785, "text": "We were one of the really first groups that started phishing attacks."}, {"time": 2790, "text": "What's phishing?"}, {"time": 2791, "text": "So that is a social engineering attack."}, {"time": 2793, "text": "PH by the way."}, {"time": 2794, "text": "Yeah, PH."}, {"time": 2795, "text": "That's another social engineering attack."}, {"time": 2796, "text": "That's sending that fake email out that looks like it's coming from a website or your financial organization or whatever and saying, hey, we've got a security problem."}, {"time": 2804, "text": "We need you to update your account information."}, {"time": 2806, "text": "Well, back then no one had ever seen a phishing attack."}, {"time": 2810, "text": "So you could ask for all the information."}, {"time": 2813, "text": "You were getting just complete identity profiles on a phishing email."}, {"time": 2817, "text": "Nowadays you can't do that."}, {"time": 2818, "text": "Nowadays you look for basically credentials because everyone is aware of phishing."}, {"time": 2822, "text": "But back then it was complete information."}, {"time": 2823, "text": "We had phished out, I don't know, 200,000 eTrade accounts."}, {"time": 2828, "text": "That's what we had the login credentials for."}, {"time": 2830, "text": "The login password, yeah."}, {"time": 2831, "text": "Login password, complete social, date of birth, mother's maiden account information, everything else."}, {"time": 2837, "text": "So we had access to those eTrade accounts."}, {"time": 2840, "text": "eTrade initially had no security in place."}, {"time": 2844, "text": "So you could cash out the account, ACH the money out to whatever account you wanted to, went through just fine."}, {"time": 2851, "text": "Made them alive on that for four to six months."}, {"time": 2854, "text": "eTrade got to the point where you couldn't do any ACH coming out."}, {"time": 2861, "text": "They locked everything down."}, {"time": 2862, "text": "Well, you're still sitting on thousands of eTrade accounts."}, {"time": 2866, "text": "How do you make money on that?"}, {"time": 2871, "text": "So what you do is you find some fat cat that's got his retirement invested in blue chips."}, {"time": 2877, "text": "Same time you find a penny stock, you open up a brand new account, buy into that penny stock, cash the fat cat out, buy into that same penny stock, bump and dump schemes all of a sudden."}, {"time": 2888, "text": "So you're destroying people's retirement accounts for just a few thousand dollars."}, {"time": 2892, "text": "Bam, bam, bam."}, {"time": 2894, "text": "And of course, eTrade's response is, not our problem."}, {"time": 2897, "text": "It's your problem."}, {"time": 2898, "text": "You shouldn't give up your password or what have you at that point."}, {"time": 2901, "text": "And you still see that issue today with Zelle scams and things like that."}, {"time": 2905, "text": "Which scam?"}, {"time": 2906, "text": "Zelle."}, {"time": 2906, "text": "So you know, the instant payment that they have."}, {"time": 2908, "text": "So it's the same kind of operation, same type of difference with different payment mechanisms."}, {"time": 2912, "text": "You find an easy way to exploit a system, and typically the financial organization, not our problem."}, {"time": 2919, "text": "Our system's secure, it's the humans, it's their errors."}, {"time": 2923, "text": "You know, you've got some culpability in that, and you're just trying to avoid paying the part of the bill is what's going on."}, {"time": 2930, "text": "One of the things, just to stand fishing for a bit, is it really makes me sad because there's been people on all kinds of platforms, including YouTube comments, but emails too."}, {"time": 2942, "text": "They figured out emails somehow."}, {"time": 2944, "text": "So people are now seeing the followers of this particular podcast who are fans, they're finding them on platforms like LinkedIn and YouTube and so on, and they are figuring out ways to get to those people by another channel, which I suppose seems more authentic to those people."}, {"time": 2969, "text": "So they send them an email from what looks like me, and with this kind of loving message."}, {"time": 2977, "text": "The interesting thing, the emails sound like something I would write."}, {"time": 2981, "text": "So these aren't even, at this stage, it's not even, it doesn't feel automated."}, {"time": 2986, "text": "Or if it's automated, there's a human in the loop that's really fine tuning it to a specific, or maybe I'm very predictable."}, {"time": 2993, "text": "But it's very loving in the way I would write that message."}, {"time": 2998, "text": "So think about that, all right?"}, {"time": 2999, "text": "So when Phishing first comes out, you could look at the language of the text or the website and say, eh, if you were paying attention, that's so OK."}, {"time": 3007, "text": "So that's not an English speaker who wrote that, typically."}, {"time": 3011, "text": "But as time has went on, as the awareness of what a Phishing attack looks like, we have people that are sitting down now and making sure that the language is proper."}, {"time": 3020, "text": "It gets worse than that, though."}, {"time": 3022, "text": "If you look at business email compromise, so the way a business email compromise typically works is the attacker will find a payroll person, find a CEO."}, {"time": 3031, "text": "He will fashion a spear phishing email, which is that's a Phishing attack that's targeting one specific individual."}, {"time": 3038, "text": "So he'll fashion a spear phishing email."}, {"time": 3040, "text": "And the way he does that is he pulls all the information he possibly can on that person, that CEO."}, {"time": 3049, "text": "Maybe he'll spear that CEO just to get their login credentials to their email, just to read the emails."}, {"time": 3058, "text": "And he'll go in there, and he'll start reading all these emails."}, {"time": 3061, "text": "He'll specifically read the emails to the payroll department, see what that relationship is."}, {"time": 3066, "text": "Are they talking about their kids, talking about relationships, talking about vacation?"}, {"time": 3069, "text": "What are they talking about?"}, {"time": 3070, "text": "How are they talking?"}, {"time": 3072, "text": "Are they sterile?"}, {"time": 3073, "text": "What are they doing, all right?"}, {"time": 3075, "text": "So then he decides, well, I'm going to go ahead and spear phish the payroll department as well."}, {"time": 3080, "text": "So then he spear phishes in, gets those credentials."}, {"time": 3082, "text": "At the same time, he creates a Unicode domain in whatever the company name is, all right?"}, {"time": 3087, "text": "So instead of that English alphabet I, he's got that Russian letter that looks like an I but without the dot on top, all right?"}, {"time": 3095, "text": "Comes back into the email, into the payroll email, blocks the real CEO's email, replaces that with the Unicode email that he's got, and then sends out a message using the correct language, the correct relationships, everything else, and says, hey, we're updating our account status, I need you to send this payment instead of over here, they've set up a new account, send all payments over here now."}, {"time": 3119, "text": "And that is business email compromise in a nutshell, all right, works great."}, {"time": 3124, "text": "Probably the larger the organization, the more susceptible to that kind of attack because there's like a distribution of responsibility to where you're more likely to believe that, okay, this other person is responsible, I'm sure they secured everything."}, {"time": 3141, "text": "I'm okay listening to this."}, {"time": 3144, "text": "So that's business email compromise, and those crimes, and that's one of the things you see about cybercrime."}, {"time": 3148, "text": "Cybercrime's not really sophisticated."}, {"time": 3150, "text": "It's not, the attacks are not sophisticated."}, {"time": 3152, "text": "The stat is 90% of every single attack uses a known exploit."}, {"time": 3157, "text": "It's not zero day attacks, they're out there, but if you're a criminal waiting on a zero day to profit, you're gonna starve to death."}, {"time": 3165, "text": "The meat and potatoes are that 90%, known exploits."}, {"time": 3170, "text": "And then the rest is, well, you're saying it's, maybe you mean it's not technically sophisticated, but it's social engineering sophisticated."}, {"time": 3179, "text": "Very sophisticated on that end, very sophisticated."}, {"time": 3181, "text": "I mean, it's a fascinating study of that."}, {"time": 3183, "text": "That establishment of trust and then using that trust to defraud that victim."}, {"time": 3189, "text": "That is something."}, {"time": 3191, "text": "I wish, obviously, all of these folks are really good at hiding."}, {"time": 3196, "text": "I wish you could tell their stories in a way, which is why you're fascinating, is you're able to tell these stories now, because it is studying human nature by exploiting it, but you get to understand our weak points, our hope, our desire to trust others."}, {"time": 3215, "text": "Also, the weak points and the failures of digital systems and at scale, humans have to connect."}, {"time": 3226, "text": "This is a weird question, asking for a friend."}, {"time": 3232, "text": "Is spear phishing itself illegal?"}, {"time": 3234, "text": "What's the legality here?"}, {"time": 3236, "text": "Oh, it's all illegal."}, {"time": 3237, "text": "Absolutely it is."}, {"time": 3239, "text": "So here's what, okay, let me construct an example."}, {"time": 3242, "text": "So if my friend were to spear phish like a CEO, right, and get their information and after they get control, say, of their Twitter account, they tweet something loving and positive, what's the crime?"}, {"time": 3261, "text": "Unauthorized access of advice."}, {"time": 3263, "text": "What will be the punishment, do you think?"}, {"time": 3267, "text": "That becomes questionable."}, {"time": 3269, "text": "So no monetary loss, or was there a monetary loss?"}, {"time": 3273, "text": "Probably not, all right?"}, {"time": 3274, "text": "So you have to figure out who the victim is before charges are pressed."}, {"time": 3278, "text": "Now, the crime would be unauthorized access, all right?"}, {"time": 3282, "text": "But no real victim on that, unless the person whose account you took over takes exception to that."}, {"time": 3291, "text": "No monetary loss."}, {"time": 3293, "text": "So there's not really standard fines."}, {"time": 3295, "text": "Probably nothing's gonna happen, right."}, {"time": 3297, "text": "So, I mean, that's kind of interesting, because it's, so when I got the ransomware, when I got the zero day attack on the QNAP mass, they basically say the criminal is QNAP, the company, for having so many security vulnerabilities."}, {"time": 3320, "text": "They're like, you are the victim of QNAP's incompetence."}, {"time": 3325, "text": "That's the way they kind of phrase it."}, {"time": 3327, "text": "And see, I don't agree with that."}, {"time": 3330, "text": "I don't agree with that at all."}, {"time": 3331, "text": "So, SolarWinds."}, {"time": 3334, "text": "Let's, so I've got 130 page class action lawsuit printed out at the house, I've been going through it, that catalogs how SolarWinds lied for years about their vulnerabilities, and they lied to investors."}, {"time": 3349, "text": "The people who came in, the honorees who they would hire, would, you know, they would not pay attention to them when they said, you know, you've got these issues, they would say, go away, shit like that for years, until SolarWinds, you know, the attacks become apparent."}, {"time": 3367, "text": "My view on that is that the only person responsible for the crime are the criminals who did the attacking, the actual criminals, not SolarWinds."}, {"time": 3378, "text": "Now, does that mean that SolarWinds isn't all fucked up?"}, {"time": 3381, "text": "They are, and there needs to be some accounting in place."}, {"time": 3385, "text": "But the only individual, the only people responsible for crime are the criminals, and that's either online, in the physical world, what have you."}, {"time": 3396, "text": "Being an idiot is not a crime."}, {"time": 3399, "text": "Not a crime."}, {"time": 3400, "text": "You know, being criminally negligent is, and I think that SolarWinds is certainly responsible, not responsible, they're culpable for what happened."}, {"time": 3412, "text": "Can you actually tell folks about SolarWinds?"}, {"time": 3415, "text": "What is it, what are some interesting things that you're aware of?"}, {"time": 3420, "text": "SolarWinds was very, it provided a backbone of security for hundreds, thousands of different companies."}, {"time": 3432, "text": "If you looked at, a lot of security companies were using SolarWinds that would allow you to get a snapshot of the entire system that they were working on."}, {"time": 3440, "text": "So what happens is, is you get a Russian group that comes in and they basically, they hack into SolarWinds and get access to it, and it allows them to view every single thing, I mean, every single thing about every single client that SolarWinds had at that point."}, {"time": 3462, "text": "So entire snapshots of all the IP that was going on, all the emails, all the communications, every single secret that was going on with those companies."}, {"time": 3470, "text": "If a company had software like Microsoft, it allowed them to look at the source code of everything that was going on."}, {"time": 3477, "text": "I mean, it's just a complete and total nightmare, all right?"}, {"time": 3481, "text": "And something that you are not going to recover from."}, {"time": 3487, "text": "I mean, it's done at that point."}, {"time": 3488, "text": "You know, there's not been a lot of news lately about it, but the fact of the matter is, is that's the type of attack that's a catastrophic attack."}, {"time": 3496, "text": "So there's a huge amount of information that was read, saved elsewhere probably."}, {"time": 3503, "text": "And so now there's people sitting on information."}, {"time": 3507, "text": "So think about one of the attack vectors has been Microsoft Outlook 365, things like that."}, {"time": 3512, "text": "This allowed the attackers to look at the source codes of that."}, {"time": 3516, "text": "So they have the source code now, so they go through it line by line."}, {"time": 3521, "text": "Where are the vulnerabilities?"}, {"time": 3522, "text": "Let's find new vulnerabilities, new zero days."}, {"time": 3524, "text": "You know, I said zero days aren't common, but this opens up an entire new threat surface all of a sudden."}, {"time": 3530, "text": "So it's a completely catastrophic attack."}, {"time": 3532, "text": "Once all the chips are down, everything's tallied up, people are going to be like, yeah, we're done."}, {"time": 3538, "text": "All right, this whole computer thing, we tried it and we're walking away."}, {"time": 3547, "text": "So you're saying that there's not been obvious big negative impact from that yet."}, {"time": 3554, "text": "So, but like."}, {"time": 3555, "text": "There's been a lot of negative impact, but we're just starting."}, {"time": 3559, "text": "So the capacity for destruction is huge here."}, {"time": 3562, "text": "How much involvement from nation states do you think there is on this?"}, {"time": 3566, "text": "You know, it's interesting."}, {"time": 3569, "text": "So you've got Iran, you've got North Korea, China, Russia, you got the big four."}, {"time": 3573, "text": "You also got Brazil."}, {"time": 3575, "text": "You've got all these other countries that are interested in the United States as well."}, {"time": 3580, "text": "Nation states are interesting depending on who the nation state is."}, {"time": 3584, "text": "All right, so Russia is very good about working with the type of criminal that I used to be."}, {"time": 3588, "text": "You know, they'll enlist these guys and steal information or what have you, then Russia will take the information they want to, and they'll basically go off and sell whatever you want to and make some money."}, {"time": 3598, "text": "China's all about IP."}, {"time": 3601, "text": "North Korea is about stealing money because they really don't know what the hell else to do right now, but..."}, {"time": 3607, "text": "So North Korea is actively involved in cybercrime."}, {"time": 3610, "text": "They've stolen a shitload of Bitcoin, everything else."}, {"time": 3613, "text": "So absolutely, they're actively involved with that."}, {"time": 3616, "text": "Very, very skilled attackers, very skilled."}, {"time": 3619, "text": "But even if you look at, you know, I told you that stat about 90%, all right?"}, {"time": 3623, "text": "So even though SolarWinds is going to be the number one attack, the followup to that is this NotPetya attack that happened."}, {"time": 3633, "text": "And so that was the most sophisticated attack launched by the Russian Sandworm Group using all known exploits throughout."}, {"time": 3640, "text": "So it's not, again, it's not... You're right in the sophistication is typically not technical sophistication, but it's a social engineering sophistication."}, {"time": 3650, "text": "How do you get these things put together in line to attack and succeed?"}, {"time": 3655, "text": "But when you get access to the source code, that's where technical sophistication could really do a lot of damage."}, {"time": 3660, "text": "And that's when you find out real quick, that's what separates the men from the boys in this game."}, {"time": 3665, "text": "All right, because all of a sudden it's not, I don't have to worry about social engineering."}, {"time": 3669, "text": "I've got source codes and I've got professionals that are looking at that."}, {"time": 3673, "text": "And that's your ass."}, {"time": 3675, "text": "Which then enables probably even more powerful social engineering methods too."}, {"time": 3680, "text": "I mean, it's just the cascade of... Is this terrifying to you, by the way?"}, {"time": 3686, "text": "That this world that we're living in, as we put more and more of ourselves on the internet, into the metaverse, that there's so many more attack vectors on our wellbeing?"}, {"time": 3700, "text": "What's terrifying to me, I used to preach it on Shadow Crew, is the idea that the perception of truth is more important than the truth itself."}, {"time": 3712, "text": "It doesn't matter what the facts are, it matters what I can convince you of."}, {"time": 3716, "text": "That's what's terrifying to me."}, {"time": 3718, "text": "So you look at deep fakes, you look at fake news, all this stuff that's going out, that becomes truly terrifying."}, {"time": 3729, "text": "Maybe there's an angle where it's freeing, if nothing is true and you can't trust anything."}, {"time": 3735, "text": "But you see, we as human beings, we wanna trust."}, {"time": 3740, "text": "We do, we need human interaction."}, {"time": 3742, "text": "And for that human interaction, you have to have a degree of trust."}, {"time": 3747, "text": "But it's more like you let go of an idea of absolute truth and it more becomes like a blockchain style consensus."}, {"time": 3755, "text": "So you let go of like, you know what?"}, {"time": 3759, "text": "There's this human dream, you get this on the internet, you get like facts, as if there's at the bottom, at the bottom, there's one turtle that's holding this scroll that says, these are the truths of the world."}, {"time": 3774, "text": "The problem is, I mean, maybe believing that is counterproductive."}, {"time": 3779, "text": "Maybe human civilization is an ongoing process of consensus."}, {"time": 3784, "text": "And so it's always going to be, everything is shrouded and you can call them lies or you can call them inaccuracies or you can call them delusions."}, {"time": 3793, "text": "It's constantly going to be, it's going to be a sea of lies and delusions, but our hope is to over time develop bigger and bigger islands of consensus that allows us to live a stable and happy society."}, {"time": 3807, "text": "Don't call it true, call it a stable consensus that creates a high quality of life for the inhabitants of the island."}, {"time": 3816, "text": "I like it, I mean, I like it."}, {"time": 3818, "text": "I mean, we're going to agree on this."}, {"time": 3820, "text": "And then don't use outlook, no, I'm just kidding."}, {"time": 3823, "text": "So maybe a step back, you mentioned, I'd love to talk about ShadowCrew, maybe this is the right time to actually, yeah, let's go to ShadowCrew because it's such a fascinating story."}, {"time": 3833, "text": "So tell me the story of building ShadowCrew, the precursor to today's darknet and darknet markets."}, {"time": 3839, "text": "This is why you're the original Godfather."}, {"time": 3842, "text": "This is it, this is it."}, {"time": 3844, "text": "So I get married."}, {"time": 3846, "text": "I faked a car accident to get married, got the money from that."}, {"time": 3850, "text": "You're romantic."}, {"time": 3851, "text": "I remember, like my dad, man."}, {"time": 3853, "text": "I'm the guy that, you know, I get from mom, I get the criminal mindset."}, {"time": 3856, "text": "From dad, I get that, don't want him to leave."}, {"time": 3859, "text": "So, you know, so."}, {"time": 3862, "text": "To get married, what's that story?"}, {"time": 3866, "text": "Oh, dude, I was."}, {"time": 3868, "text": "How did you fall in love there?"}, {"time": 3869, "text": "My first girlfriend was a preacher's daughter and crazy over her, dated her for five years."}, {"time": 3875, "text": "And she figured out pretty quickly that, well, not quickly, it took her five years to figure out that Brett Johnson is not the man of God."}, {"time": 3884, "text": "I could talk it, but more that agnostic than anything, she breaks up with me."}, {"time": 3892, "text": "So I was at the community college."}, {"time": 3894, "text": "You'd make one hell of a preacher by the way."}, {"time": 3897, "text": "Let's put that."}, {"time": 3902, "text": "I've got that Langston Hughes problem."}, {"time": 3904, "text": "I'm looking for Jesus to show up and he just doesn't."}, {"time": 3908, "text": "So I was at the community college and I was a straight asshole."}, {"time": 3912, "text": "I was arrogant, conceited, everything else."}, {"time": 3914, "text": "And I had posted an advertisement on one of the billboards looking for an adult babysitter, hot blonde, you know, come visit me in the library."}, {"time": 3924, "text": "Buddy of mine shows up and he's like, Brett."}, {"time": 3926, "text": "And I was like, yeah."}, {"time": 3927, "text": "He's like, hottest girl in school, right down the hall."}, {"time": 3929, "text": "And I was like, serious?"}, {"time": 3931, "text": "And I was like, let's go see."}, {"time": 3934, "text": "Walk over and there's these two guys that are hitting on her."}, {"time": 3937, "text": "So I just walk up and me and Todd, that was my buddy, walk up and I'm just sitting there and listening."}, {"time": 3943, "text": "And they're giving the spill and everything."}, {"time": 3945, "text": "And she's just kind of taking it in."}, {"time": 3946, "text": "Finally, I looked over and I was like, you want to get out of here?"}, {"time": 3950, "text": "And one of the guys looks at me and he's like, hey, we're talking to you."}, {"time": 3954, "text": "And I was like, well, you're talking at her."}, {"time": 3955, "text": "You're not talking to her."}, {"time": 3957, "text": "I'm about to save her ass from you."}, {"time": 3959, "text": "Yeah, that's a smooth pick up line, by the way."}, {"time": 3961, "text": "If I ever heard one, that's good."}, {"time": 3962, "text": "You want to get out of here?"}, {"time": 3964, "text": "So start dating, and she was the girl that screwed my brains out."}, {"time": 3970, "text": "And I fell head over heels."}, {"time": 3973, "text": "We got married six months later."}, {"time": 3975, "text": "Six months."}, {"time": 3976, "text": "That's what love does."}, {"time": 3978, "text": "And she didn't know I was a crook."}, {"time": 3982, "text": "She had no idea."}, {"time": 3984, "text": "She knew I was very bright."}, {"time": 3986, "text": "She knew I did a lot of theater, stuff like that."}, {"time": 3990, "text": "Got a job at, I was in hazard."}, {"time": 3992, "text": "There was no jobs to be had, so I got a job in Lexington, because we were going to be moving to the UK."}, {"time": 3998, "text": "Got a job in Lexington at Lexmark testing printer boards, circuit boards."}, {"time": 4004, "text": "So I would leave on a Thursday night, work three 18 hour shifts at Lexmark, come back home on Monday."}, {"time": 4014, "text": "Got married, faked a car accident to get the rest of the money that I needed to get married."}, {"time": 4022, "text": "And the faking on that, man, I had bought a Chevy Spectrum at a car auction."}, {"time": 4028, "text": "Gave like $500 for it."}, {"time": 4029, "text": "My aunt had previously defrauded USAA insurance on a car accident, and she was telling me all about it."}, {"time": 4036, "text": "She's like, look, go down to this chiropractor."}, {"time": 4038, "text": "Make sure you get the insurance where they'll pay for a rental car."}, {"time": 4041, "text": "They'll pay lost wages."}, {"time": 4042, "text": "I was like, they pay lost wages?"}, {"time": 4044, "text": "She's like, yeah, they pay lost wages."}, {"time": 4045, "text": "I was like, hmm."}, {"time": 4046, "text": "She's like, by the way, you work for me."}, {"time": 4049, "text": "And I was like, I work for you."}, {"time": 4052, "text": "And you get to define the wage."}, {"time": 4054, "text": "And you could also define how long you were unable to work."}, {"time": 4058, "text": "And the chiropractor will sign off on any damn thing."}, {"time": 4060, "text": "So my cousin, Ronnie, he figures out that I'm going."}, {"time": 4065, "text": "He finds out I'm going to fake this car accident."}, {"time": 4067, "text": "So he comes to me."}, {"time": 4068, "text": "He's like, hey, man, can I get in on that?"}, {"time": 4069, "text": "I was like, yeah, man, you get on that."}, {"time": 4071, "text": "So this kid, he's five days younger than I am."}, {"time": 4073, "text": "This kid, he goes to the dentist the day that we're faking it, has a tooth pulled, tells the dentist not to numb it, not to stitch it, just pull it."}, {"time": 4084, "text": "He shows up the day that we're driving out to fake the accident."}, {"time": 4087, "text": "He's got blood all over his shirt."}, {"time": 4088, "text": "He's still bleeding out of the mouth and everything else."}, {"time": 4089, "text": "I'm like, are you OK?"}, {"time": 4090, "text": "He's like, yeah, man, it's going to be good."}, {"time": 4092, "text": "It's going to be good."}, {"time": 4092, "text": "I'm like, OK. My mom, by this point, I'm living with my grandparents."}, {"time": 4097, "text": "My mom is up in the head of a hollow."}, {"time": 4100, "text": "So we're like, we'll just do it up there."}, {"time": 4102, "text": "We'll go act like we're visiting my mom on the way back out, ran over a mountain."}, {"time": 4107, "text": "So we go visit and everything, come back out that night, run over the side of the hill."}, {"time": 4112, "text": "Me and Ronnie walk back up."}, {"time": 4113, "text": "Of course, it totals the car."}, {"time": 4115, "text": "Walk back to my mom's, acting like we've wrecked."}, {"time": 4117, "text": "She knows what time it is and everything else."}, {"time": 4120, "text": "And file the claims."}, {"time": 4121, "text": "So that gets the money to get married."}, {"time": 4124, "text": "And me and my wife moved from Hazard to Lexington."}, {"time": 4129, "text": "And I'm the kid that my crime, usually, if I was a single guy, wouldn't break the law."}, {"time": 4138, "text": "Wouldn't."}, {"time": 4139, "text": "I would be all right."}, {"time": 4140, "text": "But females involved, oh, yeah."}, {"time": 4143, "text": "Got to spend the money."}, {"time": 4144, "text": "Got to show them gifts."}, {"time": 4145, "text": "Everything else was never enough to show love in some sort of healthy way."}, {"time": 4149, "text": "Always had to go overboard."}, {"time": 4150, "text": "And typically, it was buying or stealing some sort of expensive crap."}, {"time": 4153, "text": "So that was the thing."}, {"time": 4155, "text": "That was the way you show love is by buying expensive gifts."}, {"time": 4159, "text": "Or something overboard."}, {"time": 4160, "text": "Back then, with Susan, initially, it was, don't worry about working."}, {"time": 4166, "text": "You just worry about going to school."}, {"time": 4167, "text": "She was a music major."}, {"time": 4169, "text": "I was like, you just worry about going to school."}, {"time": 4171, "text": "So don't worry about cooking and cleaning."}, {"time": 4175, "text": "So not only was I this guy that was going overboard, but I was kind of a control freak, too."}, {"time": 4180, "text": "So no, I got it."}, {"time": 4182, "text": "So here I am, 60 hour a week job, 18 hour class load, cooking and cleaning."}, {"time": 4188, "text": "Something had to give."}, {"time": 4190, "text": "I quit the job."}, {"time": 4191, "text": "Quit the job and start back in fraud."}, {"time": 4195, "text": "And trying to hide that from her at the same time."}, {"time": 4197, "text": "So it was initially telemarketing fraud."}, {"time": 4203, "text": "The first job I had was a telemarketer at a cemetery, selling gravesites."}, {"time": 4208, "text": "And then that ended."}, {"time": 4211, "text": "Went over to work for the Shriners Circus, Shriners Hospital."}, {"time": 4214, "text": "And it was a third party company that was doing all the telemarketing."}, {"time": 4217, "text": "Made really good money doing that."}, {"time": 4219, "text": "That job ended."}, {"time": 4221, "text": "And then they pivoted over to working with Kiwanis Clubs, selling food baskets to the food banks and everything."}, {"time": 4229, "text": "So I stole the phone list and started at my own Kiwanis Club and would do the telemarketing, go out twice a week and pick up checks."}, {"time": 4239, "text": "Well, what happened was is I'm going out picking up checks, go knock on a door."}, {"time": 4246, "text": "Turns out one of the persons that I had called was a law enforcement officer."}, {"time": 4250, "text": "So he was like, who are you?"}, {"time": 4254, "text": "I'm with the Kiwanis Club."}, {"time": 4255, "text": "And he's like, no, you're not."}, {"time": 4257, "text": "So got arrested, spent three months in a county jail for theft by deception."}, {"time": 4263, "text": "Got out."}, {"time": 4264, "text": "And we had to move from Lexington back to Hazard and live with Susan's parents."}, {"time": 4270, "text": "They had gotten a desktop computer, HP."}, {"time": 4275, "text": "And I started surfing around online."}, {"time": 4278, "text": "Found eBay."}, {"time": 4279, "text": "And didn't really know how to make money on eBay."}, {"time": 4282, "text": "At about the same time, I'm committing low level frauds online."}, {"time": 4289, "text": "And I don't really talk about that in the past."}, {"time": 4290, "text": "The first time I've really talked about that."}, {"time": 4292, "text": "But I would pay for it with bad checks."}, {"time": 4297, "text": "So more person, so not using a platform like eBay and more."}, {"time": 4301, "text": "I would find somebody that had like a stereo system on eBay, something like that."}, {"time": 4304, "text": "And I'd pay for it with a bad check and would rely on them not to chase me because they were out of state at that point."}, {"time": 4311, "text": "And the dollar amounts were very low."}, {"time": 4313, "text": "So got the money to move to finally did those schemes enough to get the money to move back to Lexington."}, {"time": 4321, "text": "Got to Lexington."}, {"time": 4322, "text": "And by this point, I'm doing, like I said, these schemes on eBay."}, {"time": 4327, "text": "And I'm like, there's got to be a better way to make money on eBay."}, {"time": 4330, "text": "Got to be."}, {"time": 4331, "text": "So didn't really know how."}, {"time": 4333, "text": "One night, I'm watching Inside Edition with Bill Riley."}, {"time": 4336, "text": "And they're profiling Beanie Babies."}, {"time": 4338, "text": "So I'm sitting there watching."}, {"time": 4339, "text": "The one they're profiling is this one called Peanut, the Royal Blue Elephant."}, {"time": 4343, "text": "Selling for $1,500 on eBay."}, {"time": 4345, "text": "I'm sitting there going like, shit, I need to find me a peanut."}, {"time": 4350, "text": "My initial thought was, well, there's got to be one in one of these Hallmark stores in Kentucky someplace."}, {"time": 4355, "text": "So I skip class the next day."}, {"time": 4356, "text": "Went out around all the Hallmark stores looking for peanut."}, {"time": 4359, "text": "No, idiot."}, {"time": 4360, "text": "He's on eBay for $1,500."}, {"time": 4363, "text": "So after a few hours of that, I'm like, hmm."}, {"time": 4369, "text": "Turns out they had a little gray Beanie Baby elephants for $8."}, {"time": 4372, "text": "Picked up one of those for $8."}, {"time": 4374, "text": "Stopped by Kroger on the way home."}, {"time": 4376, "text": "Picked up a pack of Blue Rit dye."}, {"time": 4378, "text": "Went home, tried to dye the little guy."}, {"time": 4380, "text": "So that was a nightmare."}, {"time": 4382, "text": "Turns out they're made out of polyester."}, {"time": 4384, "text": "Get them out of the bath."}, {"time": 4385, "text": "Looks like they've got the mange."}, {"time": 4388, "text": "And what happens is, so I'm trying to dye the damn thing."}, {"time": 4391, "text": "I'm like, well, that's not going to work."}, {"time": 4393, "text": "That's just not going to work."}, {"time": 4394, "text": "So I got online, found a picture of a real one, posted it on eBay, and I was like, well, what I can do is I can claim that's the one I've got and then maybe claim that it got messed up in the mail and work out like that."}, {"time": 4409, "text": "So posted a picture of a real one online."}, {"time": 4412, "text": "Woman thought I had the real thing."}, {"time": 4413, "text": "She wins the bid."}, {"time": 4415, "text": "That social engineering kicks in immediately."}, {"time": 4417, "text": "I didn't want to be on the defensive."}, {"time": 4419, "text": "I wanted to put her on the defensive."}, {"time": 4421, "text": "So as soon as she wins the bid, I send her a message."}, {"time": 4424, "text": "Hey, we've not done any business before."}, {"time": 4426, "text": "I don't even know if I can trust you."}, {"time": 4427, "text": "What I need you to do, protects us both."}, {"time": 4430, "text": "Go down the US Postal Service."}, {"time": 4432, "text": "Get two money orders totaling $1,500."}, {"time": 4434, "text": "Send them to me issued by the US government."}, {"time": 4437, "text": "That way we're both protected."}, {"time": 4440, "text": "Soon as I get the money orders, I'll send you your animal."}, {"time": 4442, "text": "She believed that."}, {"time": 4443, "text": "Didn't ask any questions at all."}, {"time": 4447, "text": "Sent me the money orders."}, {"time": 4447, "text": "I cashed them out."}, {"time": 4449, "text": "Sent her the creature."}, {"time": 4450, "text": "Immediately got a phone call."}, {"time": 4452, "text": "I didn't order this."}, {"time": 4453, "text": "My response, lady, you ordered a blue elephant."}, {"time": 4456, "text": "I sent you a blue fish elephant."}, {"time": 4459, "text": "And she got pissed."}, {"time": 4461, "text": "And she kept calling."}, {"time": 4463, "text": "What I found out, and that's really the first lesson of cybercrime that most of these criminals, including self, learns."}, {"time": 4469, "text": "If you delay a victim long enough, just keep putting them off."}, {"time": 4471, "text": "A lot of them, they get exasperated, throw their hands in the air, walk away."}, {"time": 4475, "text": "You don't hear from them."}, {"time": 4476, "text": "And none of them, to this day, none of them complain to law enforcement."}, {"time": 4481, "text": "They eat it."}, {"time": 4482, "text": "So it's a mixture of you're exhausted by the process, so it's just easier to walk away, and second, almost like an embarrassment."}, {"time": 4492, "text": "So there's a whole slew of reasons, all right?"}, {"time": 4494, "text": "There's the exhaustion, certainly."}, {"time": 4496, "text": "There's the embarrassment."}, {"time": 4497, "text": "So if you figure out, if you look at it today, where does the embarrassment come from?"}, {"time": 4500, "text": "Well, the media, family members, we're all very good about blaming the victim for crimes."}, {"time": 4506, "text": "Why would you click on the link?"}, {"time": 4507, "text": "Why would you send money to somebody you don't know?"}, {"time": 4510, "text": "So you've got that that's going on."}, {"time": 4512, "text": "You've got the issue of, who do you complain to?"}, {"time": 4515, "text": "Back then, you didn't know."}, {"time": 4516, "text": "Do you complain to local police?"}, {"time": 4518, "text": "Because she's in another state, so which local police do you complain to?"}, {"time": 4522, "text": "Do you complain to the feds?"}, {"time": 4523, "text": "Well, the dollar amounts aren't high enough to complain to feds."}, {"time": 4526, "text": "Feds are going to tell you to go local."}, {"time": 4528, "text": "Local's going to tell you, hey, it happened in Kentucky."}, {"time": 4530, "text": "Complain to them."}, {"time": 4531, "text": "Kentucky's going to tell you, well, shit, you're over there."}, {"time": 4534, "text": "We need you to come in."}, {"time": 4535, "text": "So there's this whole issue of the jurisdiction, of the blame factor, everything else."}, {"time": 4541, "text": "So I got away with that crime and did it under my own name at that point."}, {"time": 4546, "text": "I kept going and got better at it, started to understand how to hide identities, things like that."}, {"time": 4552, "text": "Started selling pirated software."}, {"time": 4554, "text": "Pirated software led into installing mod chips."}, {"time": 4558, "text": "The initial pirated software was Sega Saturn, PlayStation 1."}, {"time": 4562, "text": "Well, you had to have a mod chip in those to play the pirated disk, so I started selling and installing mod chips."}, {"time": 4568, "text": "That led into installing mod chips in the cable television boxes so you could watch all the pay per view, which in turn led into programming satellite DSS cards."}, {"time": 4578, "text": "Those 18 inch RCA satellite systems, pull the card out of it, program it, turns on all the channels."}, {"time": 4584, "text": "Started doing that."}, {"time": 4588, "text": "That is very entrepreneurial."}, {"time": 4593, "text": "So just technically, so there's laws and rules that you're breaking nonstop."}, {"time": 4603, "text": "So there's also legitimate ways of doing that, which is break the rules of the conventions of the past."}, {"time": 4609, "text": "That's the first principles thing."}, {"time": 4611, "text": "That's what Elon Musk and his ilk do all the time."}, {"time": 4615, "text": "That is guts and brilliance."}, {"time": 4619, "text": "But when it's crossing the lines of the law, actually sometimes the law is outdated."}, {"time": 4627, "text": "The thing is, as a human being, you have to then compute the ethical damage you're doing."}, {"time": 4632, "text": "Like ethically, the damage you're doing about other human beings, that is fundamentally the thing that you're breaking, is you're adding to the suffering in the world in one way or another, and you're justifying it."}, {"time": 4644, "text": "But in terms of me sort of as an engineer, that is some gutsy thinking."}, {"time": 4649, "text": "That's how Woz and Steve Jobs thought."}, {"time": 4654, "text": "That's innovation."}, {"time": 4655, "text": "And maybe just think, if you can introspect your thinking process here, this is a new, I like how you remember this in HP, this is a totally new thing to you."}, {"time": 4670, "text": "Computers is another domain."}, {"time": 4673, "text": "How were you figuring these puzzles out, presumably mostly alone?"}, {"time": 4678, "text": "Alone."}, {"time": 4678, "text": "When you were thinking through these problems, is there, this is a strange question to ask, but what is your thinking process?"}, {"time": 4688, "text": "What is your approach to solving these problems?"}, {"time": 4690, "text": "So the approach is you do something, and you fuck it up, and you're like, you think back, OK, how do I fix that?"}, {"time": 4700, "text": "You fix that aspect, you commit the crime again."}, {"time": 4703, "text": "And it goes a little bit further, and it screws up."}, {"time": 4706, "text": "OK, how do I fix that?"}, {"time": 4708, "text": "What's the issue on that?"}, {"time": 4709, "text": "How do I fix that?"}, {"time": 4710, "text": "So there's not a deep design thinking like that?"}, {"time": 4712, "text": "Later on, it becomes that."}, {"time": 4713, "text": "Once you lay that groundwork of the way these schemes are working, it becomes that."}, {"time": 4719, "text": "And you can apply that to other things in cybercrime as a whole."}, {"time": 4724, "text": "But initially, it's basically trial and error."}, {"time": 4727, "text": "You've got a problem, how do you solve that problem?"}, {"time": 4730, "text": "So I'm committing these crimes under my name, how do I solve that?"}, {"time": 4736, "text": "Well, one of the first principles that we started to teach on Shadow Crew is all crime should begin with identity theft."}, {"time": 4743, "text": "That's one of the main first principles that a lot of people to this day still don't really get."}, {"time": 4748, "text": "All right, why would I commit a crime under my name if I can do it under your name?"}, {"time": 4752, "text": "So that's one of the big buffers."}, {"time": 4753, "text": "And that takes trial and error to get to that point where you start to understand that's the way crime should operate if you're a criminal."}, {"time": 4760, "text": "But with me, it's trial and error."}, {"time": 4765, "text": "It's that childhood where that mindset is kind of ingrained in you where you're looking for ways, let's say nontraditional ways of getting around things or getting through things."}, {"time": 4777, "text": "I mean, one of the questions I'll probably ask this later is there's also a unique aspect to the outcome of what you were doing, which is you weren't, you didn't get caught for a very long time."}, {"time": 4790, "text": "We'll talk about why that is."}, {"time": 4792, "text": "And the thing is, it's so interesting, all crime probably should, to be effective, should start with identity theft."}, {"time": 4801, "text": "I like that identity theft because identity theft can take so many forms."}, {"time": 4806, "text": "So yes, so Shadow Crew."}, {"time": 4809, "text": "So what's, so as we're, you started with love."}, {"time": 4813, "text": "Started with love."}, {"time": 4814, "text": "So now we're doing these schemes online."}, {"time": 4818, "text": "I'm selling to these, I'm programming these satellite DSS cards."}, {"time": 4822, "text": "And one of the interesting things, and you still see that to this day, is something will happen that will create an industry for criminals, all right?"}, {"time": 4833, "text": "So what happened is Canada, Canadian judge, rules about the same time that I'm doing these satellite cards, Canadian judge comes out and says, hey, it's legal for my citizens to pirate those signals."}, {"time": 4847, "text": "And his reasoning was is since RCA doesn't sell the systems up here, my citizens can pirate it."}, {"time": 4853, "text": "Okay, so what happens is is overnight, about the same time PayPal comes into play."}, {"time": 4859, "text": "So PayPal is coming right online at about the same time."}, {"time": 4863, "text": "Overnight, a little cottage industry pops up in the United States."}, {"time": 4867, "text": "You go down to Best Buy, buy the system for $100, take it out in the parking lot, open system up, pull it, open box up, pull the system out, pull the card out, throw the system away, program the card, ship its ass to Canada, $500 a pop."}, {"time": 4879, "text": "Business is good."}, {"time": 4881, "text": "Making, you know, $3,000, $4,000 a week doing that."}, {"time": 4883, "text": "I'm like, yeah, that's good."}, {"time": 4886, "text": "I have so many orders, I can't fill all the orders and quickly think to myself, why do I need to fill any of them?"}, {"time": 4893, "text": "They're in Canada."}, {"time": 4894, "text": "I'm down here."}, {"time": 4897, "text": "You know, who are they gonna complain to?"}, {"time": 4899, "text": "Because I already found out people don't complain, all right?"}, {"time": 4902, "text": "They're not gonna complain to anybody."}, {"time": 4905, "text": "So I start not."}, {"time": 4906, "text": "Especially in Canada."}, {"time": 4907, "text": "And I'm having them send money."}, {"time": 4910, "text": "That's when PayPal's first into play."}, {"time": 4913, "text": "And it amazes me that everybody is using PayPal."}, {"time": 4918, "text": "It's like, you don't even have to really ask."}, {"time": 4920, "text": "They're like, can we pay by, yeah, you can pay all day long by PayPal."}, {"time": 4923, "text": "And PayPal had no clue what they were doing with security."}, {"time": 4925, "text": "So it's like, okay."}, {"time": 4928, "text": "So they're sending money to PayPal."}, {"time": 4929, "text": "I'm having the PayPal cashed out to bank accounts in my name at that point."}, {"time": 4935, "text": "And I get scared because by that point, I'm still in four to $6,000 a week."}, {"time": 4940, "text": "And I'm like, somebody's gonna be looking at money laundering."}, {"time": 4943, "text": "So get it in my head."}, {"time": 4944, "text": "I'm like, best thing that I can do is get a fake driver's license, open up a bank account using that driver's license, cash out at the ATM."}, {"time": 4954, "text": "No idea where to get a fake ID."}, {"time": 4955, "text": "Not a clue."}, {"time": 4956, "text": "So I get online, looked around."}, {"time": 4958, "text": "Spent a couple of weeks looking around."}, {"time": 4960, "text": "Thought I found a guy."}, {"time": 4961, "text": "He went by the screen name of Fake ID Man."}, {"time": 4963, "text": "Thought I found a guy, sent him $200, sent him my picture."}, {"time": 4966, "text": "Dude rips me off."}, {"time": 4968, "text": "And I'm like, what the hell, man?"}, {"time": 4972, "text": "Oh, I got played."}, {"time": 4973, "text": "He had a little website set up with reviews."}, {"time": 4977, "text": "And I'm like, oh, it's all legitimate."}, {"time": 4978, "text": "He's building that trust that I talked about."}, {"time": 4981, "text": "So the end result, I got pissed."}, {"time": 4985, "text": "And there was no site that dealt with anything criminal or cyber crime related."}, {"time": 4994, "text": "The only real avenue you had was an IRC chat session, internet relay chat."}, {"time": 4998, "text": "And that, I'm sure you've been on that."}, {"time": 5000, "text": "It's this rolling chat board."}, {"time": 5002, "text": "You don't know who the hell you're talking to."}, {"time": 5004, "text": "Most of them are full of shit."}, {"time": 5006, "text": "You can't trust anybody."}, {"time": 5007, "text": "And you're sitting there trying to conduct business."}, {"time": 5009, "text": "So if somebody claims they've got a product or service, do they have it?"}, {"time": 5013, "text": "Does it work?"}, {"time": 5013, "text": "Are they just gonna rip you off?"}, {"time": 5014, "text": "Because in those channels, everyone's a criminal."}, {"time": 5017, "text": "I kept looking around and I've happened upon a website called Counterfeit Library."}, {"time": 5024, "text": "And Counterfeit Library only dealt with counterfeit degrees and certificates, degree mail type stuff."}, {"time": 5031, "text": "But they had a forum and no one was using the forum."}, {"time": 5035, "text": "So I basically get on there and bitch every day."}, {"time": 5038, "text": "I got ripped off, don't know what to do, bam, bam, bam, bam, bam."}, {"time": 5041, "text": "About the same time I started doing that, two other guys show up."}, {"time": 5044, "text": "One's named Mr. X, he's out of Los Angeles."}, {"time": 5047, "text": "Other guy's named Beelzebub, he's out of Moose Jaw, Saskatchewan."}, {"time": 5051, "text": "And we all become buddies."}, {"time": 5053, "text": "So a few weeks of me bitching, a few weeks of them responding."}, {"time": 5057, "text": "Beelzebub gets me on ICQ and he sends me a message."}, {"time": 5060, "text": "He's like, I went by the screen name of Gollum at that point, Gollum Fun."}, {"time": 5064, "text": "And he's like, Gollum, I can make you a fake driver's license."}, {"time": 5067, "text": "And I was like, well, motherfucker, do it."}, {"time": 5068, "text": "And he's like, well, I'm gonna charge you for it."}, {"time": 5070, "text": "I'm like, yeah, you are."}, {"time": 5072, "text": "He's like, I am."}, {"time": 5073, "text": "I was like, no, you're not."}, {"time": 5075, "text": "And he's like, look, man, he said, this business, if you're gonna do this, you have to trust people or you're gonna fail."}, {"time": 5084, "text": "He said, so I'm gonna charge you $200, but I'm gonna send you a driver's license."}, {"time": 5089, "text": "Well, by this point, I'm friends with the people who own Counterfeit Library."}, {"time": 5093, "text": "We're emailing, chatting, everything else."}, {"time": 5095, "text": "And I tell him, I'm like, okay, I'm gonna send you $200."}, {"time": 5099, "text": "That way, when you rip me off, I'll have them ban you and I don't have to deal with you anymore."}, {"time": 5104, "text": "And he's like, bet."}, {"time": 5106, "text": "So I sent him $200, sent him my picture."}, {"time": 5109, "text": "Two weeks later, I get a driver's license."}, {"time": 5111, "text": "Name is Steven Schwecki out of Ohio."}, {"time": 5113, "text": "And real guy, worked at ADP payroll to this day, works at ADP, is where the guy works."}, {"time": 5120, "text": "Got the driver's license."}, {"time": 5122, "text": "And to me, at that point in time, it was the prettiest thing that I'd ever seen."}, {"time": 5127, "text": "You know, I'd never seen a fake ID before."}, {"time": 5130, "text": "Turns out, you know, looking back, it was like, eh."}, {"time": 5133, "text": "So, but."}, {"time": 5135, "text": "That is kind of a strong first step in creating a fake identity."}, {"time": 5142, "text": "Very strong, very strong."}, {"time": 5144, "text": "So that was like, Gasko just, on the point he made, that if you're gonna be successful in this, you should have people you trust."}, {"time": 5156, "text": "Is he right on that?"}, {"time": 5158, "text": "Oh, he's absolutely right."}, {"time": 5160, "text": "He's absolute."}, {"time": 5160, "text": "So you have to have, this is like mob."}, {"time": 5164, "text": "You have to have an inner circle that you trust."}, {"time": 5167, "text": "You know, I'm sure you've probably heard me say this before."}, {"time": 5171, "text": "Successful cyber crime, all right?"}, {"time": 5174, "text": "There are three necessities to being successful online if you're a criminal."}, {"time": 5178, "text": "Three necessities are gathering data, committing the crime, and then cashing it out."}, {"time": 5184, "text": "All three of those necessities have to work in conjunction."}, {"time": 5186, "text": "If they don't, the crime fails."}, {"time": 5188, "text": "The problem, and it's a huge problem, is that one guy can't do all three things."}, {"time": 5194, "text": "You know, you've got the people who gather the data."}, {"time": 5197, "text": "Basically, the general store sells people who sell PII, credit card logins, data tools."}, {"time": 5204, "text": "They always sell the spoofed phone numbers and the RDPs, stuff like that."}, {"time": 5208, "text": "A lot of the times, those people don't know how to commit the crime."}, {"time": 5211, "text": "And those people certainly don't know how to launder the money out, put cash in pocket."}, {"time": 5214, "text": "So you've got, either because of a skill level, sometimes a geographic location, limits what that individual can do, all right?"}, {"time": 5223, "text": "So you have to rely on people who are good in areas where you are not in order for that crime to succeed."}, {"time": 5230, "text": "And that means you have to trust those people."}, {"time": 5235, "text": "So what happens with Shadow Crew, all right?"}, {"time": 5237, "text": "So Counterfeit Library is the start, all right?"}, {"time": 5241, "text": "Counterfeit Library transitions over to Shadow Crew."}, {"time": 5244, "text": "Right before that transition, there's a Ukrainian guy."}, {"time": 5247, "text": "By the name of Dmitry Golubov."}, {"time": 5249, "text": "He was a spammer at that point in time."}, {"time": 5251, "text": "He saw what we were doing with Counterfeit Library and he liked it."}, {"time": 5255, "text": "He was getting all these credit card details and this kid, I mean, he's a kid."}, {"time": 5259, "text": "This kid has an idea."}, {"time": 5261, "text": "And his idea was, I wonder if people would buy stolen credit card details."}, {"time": 5265, "text": "That's pretty good Ukrainian Russian accent."}, {"time": 5267, "text": "So he picks up the phone, he calls his buddies."}, {"time": 5272, "text": "They call their buddies."}, {"time": 5273, "text": "They have a physical conference in Odessa."}, {"time": 5276, "text": "150 of these cyber criminals show up."}, {"time": 5278, "text": "And they launched this idea, this launches a website called Carter Planet, which is the genesis of all modern credit card theft as we know it, all right?"}, {"time": 5287, "text": "And so, remember I mentioned those three necessities of cyber crime."}, {"time": 5292, "text": "Dmitry had all the credit data in the world."}, {"time": 5296, "text": "And he partnered with all these other Ukrainians who had all this data as well."}, {"time": 5299, "text": "The problem was, is so much fraud had been committed on that Eastern side of Europe, that every card had been shut down."}, {"time": 5306, "text": "Even if you were a legitimate card holder and tried to cash it out, you weren't doing it at that point."}, {"time": 5312, "text": "So again, those three necessities, gathering data, committing crime, cashing out."}, {"time": 5315, "text": "Dmitry had the data."}, {"time": 5317, "text": "They could commit the crime."}, {"time": 5318, "text": "They could not put cash in pocket."}, {"time": 5321, "text": "So we were running counterfeit library."}, {"time": 5324, "text": "One day I get this message, or not a message, one day script shows up."}, {"time": 5328, "text": "And he posts just on the general forum."}, {"time": 5330, "text": "He posts, hey, I've got credit card data."}, {"time": 5334, "text": "Give me an address, give me a burner phone number, wait five business days, order whatever you want to."}, {"time": 5338, "text": "We had never seen anything like that."}, {"time": 5341, "text": "We were a PayPal fraud and eBay fraud site, is what we were, and fake driver's licenses."}, {"time": 5346, "text": "So then, and we had, I guess we had two, 3,000 members at that point."}, {"time": 5349, "text": "So the response from the members was, that can't be real."}, {"time": 5356, "text": "You've gotta be law enforcement."}, {"time": 5357, "text": "It's gotta be trying to get us arrested and everything else."}, {"time": 5361, "text": "What, let me backtrack a little bit."}, {"time": 5363, "text": "So the driver's license that I had got, Beelzebub had an idea."}, {"time": 5368, "text": "What he wanted to do is he wanted to sell driver's licenses."}, {"time": 5374, "text": "Mr. X wanted to sell social security cards."}, {"time": 5376, "text": "He made a very passable social security card."}, {"time": 5379, "text": "Me, I didn't, I had no skill level on that."}, {"time": 5380, "text": "I knew PayPal fraud and eBay fraud."}, {"time": 5382, "text": "So Beelzebub was like, I'll tell you what, you be the reviewer."}, {"time": 5387, "text": "That way you get every product or service that comes in."}, {"time": 5390, "text": "They'll have to send it to you or let you have access to it."}, {"time": 5393, "text": "You can learn the entire game."}, {"time": 5395, "text": "And because you're not selling anything, it gives you legitimacy on the reviews, all right?"}, {"time": 5401, "text": "So I started out as a reviewer, the only reviewer on Counterfeit Library."}, {"time": 5405, "text": "So over the next year, Beelzebub turns out he was a pot grower."}, {"time": 5410, "text": "He goes back to growing pot because he wasn't making shit selling driver's licenses."}, {"time": 5414, "text": "Mr. X, about a year and a half in, he gets arrested cashing out driver's, not credit cards, cashing out to casinos, doing some shit with that."}, {"time": 5424, "text": "So I'm the only guy left standing and I'm at the top of the heap."}, {"time": 5428, "text": "And it becomes this thing where if I review somebody, they make a lot of money."}, {"time": 5433, "text": "If I don't, you don't do business here."}, {"time": 5436, "text": "So script shows up saying he's got this."}, {"time": 5438, "text": "I'm the only reviewer on site."}, {"time": 5441, "text": "People think he's law enforcement."}, {"time": 5443, "text": "First week it goes like that."}, {"time": 5445, "text": "After a while, I'm like, okay, I gotta do something."}, {"time": 5447, "text": "And I'm scared, man, because I'm like, he may be law enforcement."}, {"time": 5450, "text": "So I get him on ICQ and I'm like, hey, you have to be reviewed."}, {"time": 5453, "text": "He's like, what the hell is that?"}, {"time": 5454, "text": "So I tell him what it is, he's like, you reviewed me."}, {"time": 5456, "text": "I was like, yeah, that's the idea."}, {"time": 5458, "text": "So give him a drop address, give him a burner phone number, wait five business days, and I try to hit Dell for $5,000."}, {"time": 5466, "text": "The order fails."}, {"time": 5468, "text": "I get back on ICQ, hey man, it didn't work."}, {"time": 5470, "text": "He's like, give me one more chance."}, {"time": 5472, "text": "I was like, look, I'll give you one more chance, but it's your ass after that."}, {"time": 5475, "text": "He's like, one more chance."}, {"time": 5476, "text": "I go, okay, give him another address, another phone number, wait another five business days, hit Thompson's Computer Warehouse for $4,000, Dell for $5,000."}, {"time": 5486, "text": "Order goes through, get the products in."}, {"time": 5489, "text": "I post that review on Counterfeit Library, and literally overnight, we turn from an eBay PayPal fraud site to a credit theft site."}, {"time": 5500, "text": "And that becomes a lot of money really quickly for members."}, {"time": 5504, "text": "So we were doing, now it's called CMP fraud, card not present fraud."}, {"time": 5507, "text": "So you hit an online merchant with stolen credit card data."}, {"time": 5511, "text": "Back then, a fairly experienced fraudster could profit 30 to $40,000 a month, okay?"}, {"time": 5518, "text": "Just buying laptops, what have you, and cashing out, put them on eBay for sale and sell them like that."}, {"time": 5523, "text": "And 30 to 40K a month was the profit on that."}, {"time": 5526, "text": "Script had a lot of buddies."}, {"time": 5528, "text": "He had people like Roman Vega, these other guys that would sell not just credit card data, but counterfeit physical credit cards as well."}, {"time": 5537, "text": "We had, and he."}, {"time": 5538, "text": "Counterfeit, not stolen."}, {"time": 5540, "text": "So counterfeit."}, {"time": 5541, "text": "Counterfeit."}, {"time": 5542, "text": "That must be tough to do."}, {"time": 5545, "text": "So the connection."}, {"time": 5546, "text": "That must be harder than driver's licenses."}, {"time": 5549, "text": "So what BOA initially had, and I became the United States salesperson for BOA, but what he had was, is he was the first dumps provider in the United States."}, {"time": 5562, "text": "So on the back of your credit or debit card, there's a magnetic stripe."}, {"time": 5567, "text": "Three data tracks on the stripe."}, {"time": 5568, "text": "There was the first data track is the customer's name."}, {"time": 5570, "text": "Second data track is the card number, forward slash 16 digit algorithm outside of that."}, {"time": 5576, "text": "We'll get back to that in a few minutes."}, {"time": 5578, "text": "Third data track is called indiscriminate data."}, {"time": 5580, "text": "No one uses it, all right?"}, {"time": 5582, "text": "So what's bought and sold is the second data track."}, {"time": 5585, "text": "It's called the dump."}, {"time": 5586, "text": "And the reason that's sold is when you go into a shop, you insert the card or you swipe the card, the only information that's sent out for verification is the second data track, all right?"}, {"time": 5597, "text": "That goes to the processor bank for verification."}, {"time": 5599, "text": "The first data track, that customer's name, shows up on the screen of the cashier in front of you."}, {"time": 5604, "text": "So what typically happens is, is you buy 10 of these dumps."}, {"time": 5608, "text": "You get 10 counterfeit cards in code track two on all 10 cards."}, {"time": 5612, "text": "Track one, you create one fake driver's license."}, {"time": 5615, "text": "Track one is just the name of that one fake driver's license."}, {"time": 5618, "text": "That way, when you go in the shop, swipe the card, track two gets sent off for verification."}, {"time": 5622, "text": "Track one shows up on the screen in front of the cashier."}, {"time": 5624, "text": "If you ever ask for ID, you pull out the fake ID."}, {"time": 5627, "text": "Everyone's a nice, warm, fuzzy."}, {"time": 5628, "text": "You walk out with the cameras, Rolex."}, {"time": 5631, "text": "And track one could be, it doesn't have to be connected."}, {"time": 5634, "text": "It's not connected to track two."}, {"time": 5635, "text": "Not connected at all, all right?"}, {"time": 5637, "text": "That's one of the big problems, all right?"}, {"time": 5639, "text": "So Scrip brought a host of technical people into that type of environment, all committing credit card theft."}, {"time": 5648, "text": "We had proxy providers."}, {"time": 5650, "text": "We had all these people that were doing this stuff."}, {"time": 5653, "text": "We start making a lot of money, a lot."}, {"time": 5655, "text": "And the reason that happens is, again, Scrip did not have the ability to cash out."}, {"time": 5661, "text": "So he was reduced to selling things."}, {"time": 5663, "text": "And at the same time, he's looking for, how do I make more money, all right?"}, {"time": 5668, "text": "The Ukrainians happened upon this thing called the CVV1 breach, or hack, is what they called it."}, {"time": 5676, "text": "So what happens is, remember I told you track two, card number forward slash 16 digit algorithm."}, {"time": 5683, "text": "You gotta know the algorithm to encode it so you can swipe the card or take it to the ATM machine."}, {"time": 5689, "text": "All right, ATM."}, {"time": 5691, "text": "You gotta know it."}, {"time": 5692, "text": "Now we were fishing data from hell."}, {"time": 5694, "text": "I mean, we were doing a lot of fishing, a lot."}, {"time": 5698, "text": "We were getting pins, we were getting card numbers, but you can't get that algorithm."}, {"time": 5703, "text": "So Ukrainians start testing stuff."}, {"time": 5707, "text": "What they found out was no bank had implemented the hash on track two."}, {"time": 5713, "text": "So you take the card number forward slash any 16 digits, it would encode."}, {"time": 5719, "text": "Take it to the ATM, pull cash out, because you got the pin, all right?"}, {"time": 5726, "text": "Well, wait, sorry, I'm trying to understand."}, {"time": 5728, "text": "So that means, so if there's no hash, are they generating random numbers or do they have valid numbers for track two?"}, {"time": 5737, "text": "No numbers needed at all, as long as just the track two was a complete track two."}, {"time": 5741, "text": "So it's a valid track two that doesn't match, so the pin is the thing that gets you in?"}, {"time": 5748, "text": "So back then, all right, back then, what we're talking about is you needed, typically today you need a whole track two."}, {"time": 5754, "text": "You need that valid track two."}, {"time": 5755, "text": "All right, you need the 16 digit card number, forward slash, and then whatever that algorithm does, the other side of it, all right?"}, {"time": 5763, "text": "Back then, none of the banks had implemented that algorithm."}, {"time": 5766, "text": "So while the algorithm was there, you didn't need it to encode."}, {"time": 5775, "text": "So you can make a lot of money with physical of fake."}, {"time": 5780, "text": "So much money that card not present fraud."}, {"time": 5784, "text": "Card not present fraud, remember I told you, was $30,000 to $40,000 a month, all right?"}, {"time": 5788, "text": "That turned into $30,000 to $40,000 a day."}, {"time": 5792, "text": "The Ukrainians, again, they can't cash it out."}, {"time": 5796, "text": "They've got all the data on the planet, but they can't cash it out, those three necessities of cybercrime."}, {"time": 5801, "text": "So the deal became, you have to rely on the Americans."}, {"time": 5804, "text": "Tell you what, we'll give you 40%."}, {"time": 5806, "text": "So you had all these cashiers that were 40% of $40,000 a day."}, {"time": 5811, "text": "Yeah, we'll take that, all right?"}, {"time": 5813, "text": "Send the rest of it over to buy Western Union or what have you to your Ukrainian contact."}, {"time": 5817, "text": "That's before cryptocurrency came into play."}, {"time": 5819, "text": "Now you had a couple of forerunners with eGold and Liberty Reserve, things like that."}, {"time": 5824, "text": "But back then it starts out with Western Union, then it becomes prepaid cards, sending track information over, loading the card up like that, and then finally you get to eGold, Liberty Reserve, and then today it's with crypto that's used."}, {"time": 5839, "text": "Started stealing a lot of money, a lot."}, {"time": 5843, "text": "And that got law enforcement attention."}, {"time": 5846, "text": "So we started to see, I mean, it's a crazy ass story."}, {"time": 5850, "text": "We started to see IPs coming in from law enforcement agencies, government agencies, because back then they didn't know how to shield their identity either."}, {"time": 5858, "text": "So you saw Secret Service, you saw DoD, you saw all these like, and you're like, that's interesting."}, {"time": 5865, "text": "So, you know, and at the same time, it was called a hack, but it wasn't a hack."}, {"time": 5874, "text": "We had a guy that worked at T Mobile in Los Angeles."}, {"time": 5878, "text": "This is the same guy that back then published Paris Hilton's phone contact list."}, {"time": 5884, "text": "That made a lot of news."}, {"time": 5887, "text": "Not only did he do that, but it turned out that the Los Angeles Secret Service Agency was using T Mobile phones."}, {"time": 5894, "text": "So he's getting text messages of the Secret Service investigating Shadow Crew, and he posts those damn things on Shadow Crew."}, {"time": 5901, "text": "So I'm sitting there going, head of the pile, I'm sitting there going, this is not gonna end well."}, {"time": 5907, "text": "This is not gonna end well."}, {"time": 5908, "text": "So at the same time, I had access, I started out with access to the Indiana State Sex Offenders Registry, and I was using that to create bank accounts, launder the money out, and I would sell the bank accounts, stuff like that."}, {"time": 5922, "text": "They shut that down."}, {"time": 5923, "text": "The next database I had access to was the Texas Driver's License database, and started using that to create fake driver's licenses, what have you."}, {"time": 5932, "text": "And then finally, we happened upon the California Death Index, all right?"}, {"time": 5938, "text": "Complete information, mother's maiden, socials, DOBs, all that, and it's like, gotta be a use for that."}, {"time": 5946, "text": "Well, you can use it to create identities all day long."}, {"time": 5949, "text": "My idea was, I wonder if you could take somebody that's died and then file for social security death benefit, not death benefits, but social security benefits for that individual, and get that recurring paycheck in."}, {"time": 5963, "text": "So that takes a lot of research to start seeing if you can do that."}, {"time": 5966, "text": "How does the federal government know if you're dead?"}, {"time": 5969, "text": "Do federal indexes reference state indexes?"}, {"time": 5972, "text": "You got all these questions that pop up."}, {"time": 5974, "text": "Well, it turns out, federal indexes don't reference state indexes, it's against the law."}, {"time": 5979, "text": "It also turns out, the only way the federal government knows you're dead is prior to 1998, the family had to file a social security death benefit for that person, all right?"}, {"time": 5993, "text": "Prior to 98."}, {"time": 5994, "text": "Which of course most people don't."}, {"time": 5996, "text": "Right, prior to 98, it took the family."}, {"time": 5998, "text": "After 98, the hospital can do it, funeral home can do it, or the family can do it."}, {"time": 6003, "text": "So a lot more people have it filed after, if they've died after."}, {"time": 6006, "text": "But it's still, there's a lot of people who probably don't."}, {"time": 6008, "text": "A lot of people don't."}, {"time": 6009, "text": "Because that death benefit's only like $219, okay?"}, {"time": 6013, "text": "Nobody's thinking about that shit."}, {"time": 6015, "text": "So I started to apply for social security benefits."}, {"time": 6019, "text": "Nope, number's dormant."}, {"time": 6021, "text": "So they want you to come in for a physical interview."}, {"time": 6023, "text": "Here I am, you know, 32."}, {"time": 6026, "text": "You're not gonna pass as a 65 year old, so no."}, {"time": 6029, "text": "So the next idea I had was, I wonder if you could file income tax returns on these people."}, {"time": 6037, "text": "Turns out you can, all day long."}, {"time": 6040, "text": "So I started doing that."}, {"time": 6042, "text": "And I started to steal, once I got ramped up, because you test everything."}, {"time": 6046, "text": "You know, you're testing to make sure, you gotta figure out what the deposit instrument is and everything else."}, {"time": 6051, "text": "And once you get all that lined out, I started to steal $160,000 a week, every week for 10 months out of the year."}, {"time": 6058, "text": "By paying taxes?"}, {"time": 6060, "text": "By filing fake returns."}, {"time": 6063, "text": "Yeah, filing fake tax returns."}, {"time": 6065, "text": "So you find a business, and the way the system worked is the IRS will issue a refund on somebody before they're able to verify that that person worked for an employer."}, {"time": 6075, "text": "Still works like that today."}, {"time": 6077, "text": "All right, so."}, {"time": 6078, "text": "And you're keeping the amounts relatively low."}, {"time": 6080, "text": "Keep them at $3,000."}, {"time": 6083, "text": "Amounts are very low."}, {"time": 6084, "text": "But you're still able to achieve scale because this large index of real people."}, {"time": 6087, "text": "I got to where, and I was manual."}, {"time": 6088, "text": "Later on, a couple buddies of mine went automated with it."}, {"time": 6091, "text": "Wait, you were doing this by hand?"}, {"time": 6092, "text": "So there's no code involved?"}, {"time": 6094, "text": "All manual."}, {"time": 6096, "text": "I'd file a return once every six minutes."}, {"time": 6099, "text": "Work 10 hours a day, three days a week."}, {"time": 6102, "text": "So clicking on, so typing fast and clicking."}, {"time": 6104, "text": "One return every six minutes."}, {"time": 6106, "text": "That's changing IP."}, {"time": 6107, "text": "That's changing address."}, {"time": 6109, "text": "Everything else, one return every six minutes."}, {"time": 6112, "text": "For three days a week."}, {"time": 6114, "text": "Fourth day, I would take a road trip, plot out a map of ATMs."}, {"time": 6119, "text": "And then the next two days, cash out."}, {"time": 6121, "text": "Bam, bam, bam, bam, bam."}, {"time": 6123, "text": "Come back home, rinse and repeat."}, {"time": 6126, "text": "Turns out that a backpack, I don't see anybody sitting around here, but a backpack will hold $150,000 of 20s, is what it will hold."}, {"time": 6134, "text": "So I'd put 150K and 20s in a backpack."}, {"time": 6136, "text": "I had a spare bedroom."}, {"time": 6138, "text": "I'd come in, toss the backpack in the bedroom."}, {"time": 6141, "text": "This is very, very important information."}, {"time": 6143, "text": "And the fact that you know it is also very, first we started with the volume of coal that weighs a ton, and now a backpack holds $150,000 of 20s."}, {"time": 6152, "text": "And then you can multiply that by five 400s."}, {"time": 6157, "text": "It's also times 20s coming out of ATM, right?"}, {"time": 6159, "text": "Each 20 weighs a gram."}, {"time": 6163, "text": "So you can actually go by weight, which is what federal authorities do when they get a pallet of cash, they just weigh it."}, {"time": 6169, "text": "Oh, they just, they just weigh it."}, {"time": 6172, "text": "So 150K is seven and a half keys of cash."}, {"time": 6175, "text": "One and a half, 15, oh, that's pretty light."}, {"time": 6179, "text": "Not bad, not bad."}, {"time": 6180, "text": "Yeah, you get a big backpack, go do a good run with David Goggins with it."}, {"time": 6185, "text": "The fact that you know this is great."}, {"time": 6188, "text": "So wait, where does that come in with the backpack?"}, {"time": 6191, "text": "So what happens is I didn't know how to launder money."}, {"time": 6194, "text": "All right, so I'm throwing cash in the spare bedroom."}, {"time": 6197, "text": "One day you open up the bedroom and you're like, gotta do something with those backpacks."}, {"time": 6202, "text": "And that's when you start learning how to launder money, cash based businesses, things like that."}, {"time": 6206, "text": "I had a production company, had a couple of detailing company."}, {"time": 6209, "text": "I was thinking about going into food trucks, things like that in Charleston."}, {"time": 6213, "text": "Actually, can you pause on that to take a tangent there?"}, {"time": 6215, "text": "How does money laundering work?"}, {"time": 6219, "text": "I mean, at that time and what years are we talking about?"}, {"time": 6222, "text": "This is, by the time the tax return schemes go into play, we're talking 2002, 2003 is when tax returns start."}, {"time": 6231, "text": "And so what, at that time and what you're aware of now, how it evolved, how does money laundering work?"}, {"time": 6239, "text": "You know, it's not that much different."}, {"time": 6242, "text": "You get a cash based business, start laundering the money or putting the money through that, saying the transactions are legal."}, {"time": 6248, "text": "You then start depositing into bank accounts."}, {"time": 6251, "text": "From bank accounts, my thing was is have bank accounts in the United States, Mexico, Canada, and then finally bounce over to Estonia was the final destination of all this stuff."}, {"time": 6264, "text": "And the idea is to try to move them to so many places that by the end of the day, it looks legal and you can't trace it all if you're ever caught, which you ultimately are."}, {"time": 6276, "text": "But so cash based businesses, you know."}, {"time": 6278, "text": "So when you say, sorry to interrupt, the cash based businesses, so you have money that needs to be moved to other people."}, {"time": 6288, "text": "So how does that work?"}, {"time": 6289, "text": "What's the business?"}, {"time": 6290, "text": "Are people providing you a service and you're giving them money?"}, {"time": 6294, "text": "Right, so you do the Ozark thing if you wanna do that."}, {"time": 6297, "text": "So you can gamble, cash out something like that."}, {"time": 6299, "text": "So it trips to whatever casinos you've got."}, {"time": 6302, "text": "You've got your production company or your detail company."}, {"time": 6305, "text": "So how many cars are you cleaning a day?"}, {"time": 6308, "text": "How many companies have you got to do that?"}, {"time": 6310, "text": "All right, whatever that company is, it's gotta be cash based."}, {"time": 6313, "text": "Somebody's paying you in cash is what you're doing."}, {"time": 6316, "text": "You have to have enough of those cash based businesses where it doesn't look funny."}, {"time": 6321, "text": "All right, because if you're a detail company making $100,000 a month, that's a problem."}, {"time": 6326, "text": "Okay, so then you start depositing into that."}, {"time": 6330, "text": "Well, because of the Patriot Act, a suspicious activity report, SARS, came in at $2,500 instead of the 10K that it used to be."}, {"time": 6340, "text": "So all of a sudden you've got multiple bank accounts that you've got to set up, all right?"}, {"time": 6344, "text": "Fortunately, what you also had is you had a bunch of prepaid debit cards that were coming into play at the same time."}, {"time": 6349, "text": "So a combination of bank accounts, prepaid debits that had ACH abilities attached to those as well, and you start running them all together."}, {"time": 6358, "text": "Then once it's out of the United States, you don't have to worry as much."}, {"time": 6361, "text": "You can start funneling that into fewer bank accounts until finally you've got the one main account that's over at Bank Letico in Estonia at that point."}, {"time": 6371, "text": "That's what you've got."}, {"time": 6372, "text": "So a bunch of hops that end up at a place that you can't trace."}, {"time": 6376, "text": "And to give you an idea, I was arrested February 8th, 2005."}, {"time": 6379, "text": "My last seizure was 2010."}, {"time": 6382, "text": "Got the last seizure notice."}, {"time": 6384, "text": "So they got it, but it didn't took them that long to get to it."}, {"time": 6390, "text": "So how do stories like with Script that come into play here where he had someone who owed him money kidnapped and tortured."}, {"time": 6400, "text": "So when does it turn darker?"}, {"time": 6405, "text": "It turns darker the more money you make."}, {"time": 6408, "text": "Script was a kid that he was stealing enough money that he was able to buy whatever estate he wanted to."}, {"time": 6415, "text": "And he would brag about touring the countryside."}, {"time": 6418, "text": "And if he saw property that he liked, he would buy it."}, {"time": 6420, "text": "And that was not just a brag, he was doing that."}, {"time": 6423, "text": "So this kid is stealing a lot of money."}, {"time": 6425, "text": "At the same time, he's got connections politically because of his family, he's got connections and that family's got connections with a Ukrainian mob."}, {"time": 6433, "text": "All right, so he's got these inroads and people are looking out for him and he's stealing a lot of money at the same time."}, {"time": 6440, "text": "Somebody doesn't pay him a decent amount of money."}, {"time": 6444, "text": "Somebody doesn't pay him."}, {"time": 6445, "text": "Now we had never, with Shadow Crew, with Carter Planet, with Counterfeit Library, we were basically the geeks."}, {"time": 6453, "text": "All right, we were just the fraudsters, the social engineers."}, {"time": 6456, "text": "We had never really considered violence."}, {"time": 6458, "text": "The rules that I had in play were, hey, we don't do child pornography, we don't do counterfeit currency, we don't do drugs."}, {"time": 6466, "text": "And the only thing we ended up really obeying was the child porn stuff, except for Max Butler, who you mentioned earlier."}, {"time": 6474, "text": "Script, someone rips the guy off."}, {"time": 6477, "text": "And he comes online on Shadow Crew at that point and he posts these pictures one day."}, {"time": 6484, "text": "And I mean, it was a detailed narrative through the pictures."}, {"time": 6487, "text": "Had the guy that rammed in the van, he had the door open, rammed in the van, had the guy tied up, had the guy being tortured."}, {"time": 6495, "text": "And the response was, this is what happens when you steal from me."}, {"time": 6502, "text": "And that's the first time that violence came into play at that point, and that's when things got, you start realizing things are getting a little serious."}, {"time": 6514, "text": "The first response is, can't be real."}, {"time": 6518, "text": "He's just doing that."}, {"time": 6522, "text": "You know, he's wanting to send a message."}, {"time": 6524, "text": "Then you're like, no, that's real, that's real."}, {"time": 6529, "text": "Were you afraid in your own heart that you might descend to that too?"}, {"time": 6535, "text": "Like if you see that, or was it pretty clear to you that that's a line that some people can cross and some can't and you're not one of those that can cross it?"}, {"time": 6545, "text": "You know, I gotta tell you, I joke with my wife."}, {"time": 6550, "text": "The joke I tell my wife is, you know, I knew some guy that had 8,000 Bitcoins."}, {"time": 6555, "text": "I might be persuaded to ask him for access to that."}, {"time": 6559, "text": "And she was like, how?"}, {"time": 6560, "text": "And I was like, well, hammer and toes."}, {"time": 6563, "text": "And I say that as a joke, but there's that line where you're like, I remember who I used to be."}, {"time": 6574, "text": "And if you're looking at that kind of money, I might be persuaded to do that back then."}, {"time": 6581, "text": "You know, that's, and I think that was Scripps issue is it was a lot of money to him."}, {"time": 6589, "text": "There's the money."}, {"time": 6590, "text": "And then there's, you know, violence can also be gradual."}, {"time": 6593, "text": "So over time you do a little more, a little more, a little more, a little more."}, {"time": 6596, "text": "You get used to what's going on and then I get desensitized."}, {"time": 6599, "text": "And you figure, you take somebody like Ross Ulbricht, the Silk Road guy, all right."}, {"time": 6605, "text": "Ross was not a violent guy."}, {"time": 6608, "text": "But at that point in time, you know, he was sitting on 24 million in Bitcoin."}, {"time": 6613, "text": "He was the only game in town."}, {"time": 6615, "text": "And that 24 now is like, I don't know, 22, 24 billion, some crap like that."}, {"time": 6620, "text": "But he felt in danger."}, {"time": 6627, "text": "This guy was gonna turn him in."}, {"time": 6628, "text": "You know, it was a black mountain and everything."}, {"time": 6629, "text": "So Ross thinks he hires a couple hit men to kill the guy."}, {"time": 6634, "text": "So it becomes that thing."}, {"time": 6636, "text": "And I saw that over and over again."}, {"time": 6638, "text": "And I'd like to say I wasn't like that, but given the same circumstances, I would have probably done the same thing."}, {"time": 6646, "text": "And also when you're, it's not just about money, there's a lot of other forces."}, {"time": 6650, "text": "Like if you're threatened for your wellbeing or for your wealth or for your power, all of us operate under different motivations."}, {"time": 6659, "text": "Plus that online aspect with those communities like that, if you're the head guy, you really feel like you're the parent of these guys."}, {"time": 6666, "text": "So somebody is starting to threaten them, it's like, all right, what do I need to do?"}, {"time": 6670, "text": "So what do you make of Silk Road?"}, {"time": 6672, "text": "The Shadow Crew started something that today you can call dark net and dark net markets."}, {"time": 6679, "text": "So these markets that operate, that trade, trade things, everything from child pornography to drugs, to, I mean, what else?"}, {"time": 6692, "text": "What are the dark things that humans want to do that they don't want anyone to know about?"}, {"time": 6699, "text": "So can you maybe tell me, you know what?"}, {"time": 6704, "text": "Let's just even step back."}, {"time": 6705, "text": "What is the dark net?"}, {"time": 6707, "text": "What happens there?"}, {"time": 6708, "text": "Let's backtrack a little bit more before we get to that."}, {"time": 6711, "text": "All right, what Shadow Crew did, other than dealing in all these stolen wares, what Shadow Crew did that's really important."}, {"time": 6724, "text": "Remember those three necessities that I talked about?"}, {"time": 6728, "text": "But the important thing is, is it established trust among criminals, all right?"}, {"time": 6733, "text": "Because that's a necessity."}, {"time": 6734, "text": "You have to be able to trust who you're dealing with because you have to deal with somebody."}, {"time": 6739, "text": "You have to, all right?"}, {"time": 6741, "text": "So how do you know you're not dealing with a cop?"}, {"time": 6743, "text": "How do you know you're dealing with somebody that's skilled?"}, {"time": 6745, "text": "How do you know you're going to deal with somebody that's not going to rip you off?"}, {"time": 6747, "text": "You have to be able to trust that individual."}, {"time": 6750, "text": "The Shadow Crew provided that trust mechanism for criminals."}, {"time": 6753, "text": "You had that communication channel, the forums, where you could reference conversations weeks, months old, take part and learn from those conversations."}, {"time": 6761, "text": "You had vouching systems and review systems in place, escrow systems in place."}, {"time": 6766, "text": "You knew by looking at someone's screen name, if you could trust the individual, network with the individual, all right?"}, {"time": 6773, "text": "And that community of just humans provided that backbone of trust."}, {"time": 6781, "text": "And that's really interesting when you think about it."}, {"time": 6784, "text": "You had the trust that was there, but you also had this, almost this instantaneous information that was available about the community or about cyber crime at large."}, {"time": 6795, "text": "And that's still in play today, all right?"}, {"time": 6798, "text": "So that was the way things were until a couple of things happened."}, {"time": 6803, "text": "And one was cryptocurrency."}, {"time": 6805, "text": "The other one was the Tor browser, the dark web."}, {"time": 6809, "text": "Now I was working with a secret service, ripping the secret service off, when Tor comes into play, all right?"}, {"time": 6814, "text": "So we got a memo in one day and it was talking about the Tor browser."}, {"time": 6818, "text": "And it was like, we really need to be careful with this."}, {"time": 6821, "text": "This is going to be problem."}, {"time": 6823, "text": "And so we all fired up the Tor browser and it turns out it was, this was 2005, early six."}, {"time": 6830, "text": "It turns out it was completely unusable, could not use it at all, simply because no one was using it and it was extremely slow."}, {"time": 6836, "text": "So for people who don't know, Tor browser is a way to be completely anonymous."}, {"time": 6841, "text": "As long as you properly know how to use it, huge caveat."}, {"time": 6844, "text": "All right, so developed by the United States Navy and they developed it."}, {"time": 6848, "text": "I don't know this."}, {"time": 6850, "text": "It wasn't the hackers that, interesting."}, {"time": 6853, "text": "US Navy, to this day, the number one funder of Tor, military, to this day, all right?"}, {"time": 6861, "text": "I mean, the same, I guess with the internet, the origins are the dark web and DOD."}, {"time": 6865, "text": "It was developed so that operatives could communicate with each other without being identified, all right?"}, {"time": 6871, "text": "That then goes open source."}, {"time": 6873, "text": "They release it, EFF comes in, start sponsoring and everything else like that."}, {"time": 6878, "text": "The next idea was, well, you know, people can get around their country's firewalls, whistleblowers can use it, things like that."}, {"time": 6884, "text": "Well, someone forgot to mention that the first adoptees of tech, if you can use it to launder money or remain anonymous, are criminals."}, {"time": 6892, "text": "And so criminals start to use the damn thing."}, {"time": 6896, "text": "So along the same time we get, well, a few years later, we get Satoshi Nakamoto pops up with his ideas for Bitcoin, and then Ross Ulbrich runs with it."}, {"time": 6907, "text": "Ross Ulbrich decides he's gonna start up Silk Road."}, {"time": 6910, "text": "So initially the people who were using Tor, which later is the dark web, people were using Tor or just talking with each other, visiting websites, communicating like that."}, {"time": 6921, "text": "Someone figured out, hey man, we could host websites on this thing, and they have a lot of trouble finding the box."}, {"time": 6928, "text": "So that is the advent of Silk Road all of a sudden."}, {"time": 6933, "text": "Ross Ulbrich has this idea that he's gonna change the world by becoming the largest drug dealer on the planet."}, {"time": 6940, "text": "So he opens up the Silk Road and the only payment instrument he allows is Bitcoin."}, {"time": 6946, "text": "So if those people out there are wondering why Bitcoin is going at what, 44K today?"}, {"time": 6951, "text": "Yeah, and by the time this is out, it could be 100,000 or 10,000."}, {"time": 6958, "text": "If it's 10,000, I'm going to buy some."}, {"time": 6964, "text": "Which is a hilarious statement to make because that statement would be ridiculously wrong like five years ago, right?"}, {"time": 6970, "text": "I know, I know, I know."}, {"time": 6972, "text": "People 100 years from now will be laughing, wait, it was that low back then?"}, {"time": 6978, "text": "So he only accepts Bitcoin, and of course the initial use case of crypto is no one wants to admit it today, but the initial use case is we're gonna buy a bunch of pot."}, {"time": 6989, "text": "We need somebody, we need a way to pay for it."}, {"time": 6993, "text": "So that's what happens."}, {"time": 6995, "text": "Ross, it's really interesting to me."}, {"time": 6998, "text": "If you look at motivations of cyber criminals, the motivations are status, cash, ideology, all right?"}, {"time": 7008, "text": "My guys, all cash, across the board, all cash."}, {"time": 7012, "text": "Ross is ideology."}, {"time": 7014, "text": "He really believed he was gonna change the world."}, {"time": 7017, "text": "He really didn't."}, {"time": 7017, "text": "I've been fortunate."}, {"time": 7019, "text": "I actually know the guy who ran Silk Road 2 and have talked to the kid, everything else, and I will tell you that those guys who are motivated by ideology, they are a completely different breed."}, {"time": 7037, "text": "It's not, you know, the cash guy, it's low hanging fruit."}, {"time": 7041, "text": "The ease of, it's hard to stop committing crime, but it's much easier for a cash motivated individual to stop than it is that ideology guy."}, {"time": 7052, "text": "That Silk Road 2 guy, he's still got it."}, {"time": 7055, "text": "You know, he's not breaking the law, but you can see it's like, he wants to, he wants to."}, {"time": 7061, "text": "So it's... That's fascinating that, I mean, the worst atrocities in human history are committed with people that operate under ideology."}, {"time": 7071, "text": "All the other motivations are much weaker."}, {"time": 7073, "text": "But you know, you think about it, with Ross, I mean, very bright guy, very bright guy, but think about the amount of cognitive dissonance that the guy's got, that he thinks he's gonna change the world by running a drug site."}, {"time": 7089, "text": "I mean, certainly, I mean, could he have changed the world?"}, {"time": 7092, "text": "Yeah, could he have done it like that?"}, {"time": 7097, "text": "Well, I can steel man those arguments."}, {"time": 7099, "text": "I listened to quite a few libertarians and you can push that to anarchists."}, {"time": 7105, "text": "You know, there's a lot of people that argue..."}, {"time": 7108, "text": "So I actually talked to a professor at Columbia who actually argues that all drugs should be legalized and not at a philosophical level, political level, but the fact that all the negative consequences of drugs that people talk about actually have to do with other factors in your life."}, {"time": 7127, "text": "I would agree with that."}, {"time": 7128, "text": "And so that's, okay, but that's more like a argument about negative aspects of drugs."}, {"time": 7133, "text": "I think the ideology comes in where it's like, well, nobody should tell you what to do."}, {"time": 7139, "text": "You should have the responsibility of your own actions."}, {"time": 7142, "text": "Like the government or any other institution shouldn't be the rule setters, the constraints for how you live your life."}, {"time": 7154, "text": "And so I could see that argument being made and ultimately if you like create an open market for drugs, how that could build a better society, it might break down the outdated, the corrupt, the bureaucratic institutions."}, {"time": 7169, "text": "I mean, you can make that argument."}, {"time": 7171, "text": "There's an argument and let's be fair."}, {"time": 7173, "text": "I wanna be fair with it."}, {"time": 7174, "text": "I mean, did he change the world?"}, {"time": 7178, "text": "We do have this whole thing called cryptocurrency."}, {"time": 7180, "text": "Yeah, in the long arc of history, perhaps."}, {"time": 7183, "text": "Yeah, we do have that."}, {"time": 7186, "text": "That's a biggie."}, {"time": 7188, "text": "And that might've been for it to take hold in society."}, {"time": 7190, "text": "Maybe the darker parts of society at first, maybe that was necessary."}, {"time": 7194, "text": "Right, I mean, maybe, we'll see how it pans out."}, {"time": 7197, "text": "Shadow Crew, we had this guy, Albert Gonzalez, Albert Gonzalez, that's the kid's name."}, {"time": 7204, "text": "We had, we were growing so big that I had to start farming things out."}, {"time": 7211, "text": "So the first thing I started farming, I instituted this review system, kind of establishing that trust mechanism even further for criminals to use."}, {"time": 7221, "text": "We needed somebody to take care of our tech aspects of the forum."}, {"time": 7225, "text": "So an associate of mine by the name of Kim Taylor, where we're looking for a forum techie, he comes to me one night and he's like, found our forum techie."}, {"time": 7234, "text": "I was like, who's that?"}, {"time": 7235, "text": "And he's like, it's this kid."}, {"time": 7236, "text": "And I was like, is he any good?"}, {"time": 7238, "text": "He's like, well, he knows the software."}, {"time": 7239, "text": "And I was like, okay, we'll just sign his ass on."}, {"time": 7243, "text": "He went by the screen name of Kumbajonny, was his screen name."}, {"time": 7246, "text": "And he starts selling credit cards after a while under a screen name of Scarface."}, {"time": 7251, "text": "And that CB1 breach where you're cashing out the track twos at ATMs, $40,000 a day."}, {"time": 7262, "text": "So Albert's in New Jersey one day, broad daylight, and stands at an ATM for 40 minutes, just standing there, feeding in one ATM card after another, pulling out cash, taking the 20s out, stuffing them in that backpack."}, {"time": 7279, "text": "Meanwhile, just across the street, a couple of cops just happened to be there."}, {"time": 7283, "text": "And they start noticing this kid just standing there."}, {"time": 7288, "text": "So 40 minutes, they watch this kid, 40 minutes."}, {"time": 7291, "text": "Finally, one cop looks at the other, let me see what's going on there."}, {"time": 7296, "text": "Walks over across the street, Albert's wearing a wig."}, {"time": 7299, "text": "He's got the disguise on, everything else like that."}, {"time": 7302, "text": "Ask him, kid, what are you doing?"}, {"time": 7303, "text": "Albert falls apart."}, {"time": 7306, "text": "We didn't know Albert had been arrested."}, {"time": 7308, "text": "So Albert immediately goes in, I wanna work for the Secret Service."}, {"time": 7315, "text": "At that point in time, Secret Service, I referred to, and I wanna make sure I don't say, it's not like that anymore."}, {"time": 7324, "text": "But back then, they were fucking idiots, all right?"}, {"time": 7327, "text": "They had no clue what was going on."}, {"time": 7329, "text": "So there was a competence issue that they were working through is one way to put it."}, {"time": 7332, "text": "That's a nice euphemism."}, {"time": 7335, "text": "So, or fucking idiots is another way to say it."}, {"time": 7339, "text": "So they're just not aware of the digital world."}, {"time": 7341, "text": "They had no clue, no clue."}, {"time": 7343, "text": "The way that Albert tells them how to catch us because they looked at him, how do we catch them?"}, {"time": 7348, "text": "And Albert's like, Albert, I'm serious, I'm serious."}, {"time": 7352, "text": "So Albert's like, well, you could try a VPN."}, {"time": 7355, "text": "What's a VPN?"}, {"time": 7357, "text": "So he explains it to them, they're like, that's a good idea."}, {"time": 7361, "text": "So I quit Shadow Crew."}, {"time": 7363, "text": "I was worried about all the news that was coming in and everything like that."}, {"time": 7366, "text": "I'm stealing 160K a week."}, {"time": 7367, "text": "I didn't know Albert had been arrested."}, {"time": 7371, "text": "I'm worried about being arrested."}, {"time": 7372, "text": "I know the writing's on the wall."}, {"time": 7374, "text": "And I'm like, I'm quitting."}, {"time": 7376, "text": "Where did you see the writing?"}, {"time": 7378, "text": "The IPs that were coming in, the text messages about the Secret Service investigators I referred to."}, {"time": 7384, "text": "So the pressure's building."}, {"time": 7386, "text": "This is going to be bad."}, {"time": 7389, "text": "So I announced my retirement of February 15th, I'm sorry, April 15th, 2004 is my retirement."}, {"time": 7398, "text": "I think that's the 2004."}, {"time": 7399, "text": "And I quit, I walk away."}, {"time": 7402, "text": "Well, Albert had been arrested."}, {"time": 7404, "text": "They cut him loose."}, {"time": 7406, "text": "No one knows he's been arrested."}, {"time": 7407, "text": "He comes back into Shadow Crew."}, {"time": 7409, "text": "I leave Kim Taylor at the same time."}, {"time": 7411, "text": "He's kind of on the run, which if you wanna know that story, that's a nightmare story in and of itself."}, {"time": 7416, "text": "So my second in charge, Kim Taylor, this guy, there was this guy named David, oh, what was his name?"}, {"time": 7426, "text": "He was, El Mariachi was the guy's name."}, {"time": 7429, "text": "David Thomas."}, {"time": 7430, "text": "David, yeah, he was a film guy."}, {"time": 7433, "text": "Scarface."}, {"time": 7434, "text": "So El Mariachi, real name David Thomas, he's on the run out of Nebraska for check fraud."}, {"time": 7442, "text": "He comes to us on Shadow Crew telling us this sad story."}, {"time": 7446, "text": "We take up a collection for this guy."}, {"time": 7449, "text": "Send it to him, all right?"}, {"time": 7450, "text": "I get him a job working with a low level carter trying to make him some money, all right?"}, {"time": 7456, "text": "El Mariachi, Thomas does this for a few weeks, comes to me one day and he's like, man, I'm not making any money."}, {"time": 7462, "text": "I'm like, okay, let me see what I can do."}, {"time": 7463, "text": "Well, I had a Ukrainian guy by the name of Big Buyer."}, {"time": 7467, "text": "He, a real friend of mine."}, {"time": 7469, "text": "And I contacted him, I was like, look, man, I got a guy that wants to do some work."}, {"time": 7472, "text": "Can you help the guy out?"}, {"time": 7473, "text": "And he's like, I got it."}, {"time": 7475, "text": "So he sends Thomas enough money to go, Thomas is in Texas at that point, sends Thomas enough money to go from Texas to Issaquah, Washington and rent an office space, all right?"}, {"time": 7488, "text": "So Thomas goes up there, rents his office space, him and his girlfriend rents an office space."}, {"time": 7494, "text": "And the plan is, is Big Buyer is going to place an order, get product sent, Mariachi is going to get the product, list it on eBay, cash out 50 50, easy enough, all right?"}, {"time": 7507, "text": "So Big Buyer places an order."}, {"time": 7509, "text": "First order is outpost.com, $18,000."}, {"time": 7513, "text": "The largest order outpost.com had ever received at that point in time."}, {"time": 7518, "text": "Order goes through."}, {"time": 7519, "text": "It goes through still."}, {"time": 7520, "text": "Goes through, he gets the product, all right?"}, {"time": 7523, "text": "Mariachi comes back, tells me, tells my second in charge, Kim Taylor."}, {"time": 7527, "text": "Kim Taylor at this point, I'm 33, 34."}, {"time": 7531, "text": "Kim Taylor's 46."}, {"time": 7532, "text": "He works at the Tattered Cover Bookstore in Denver, Colorado is where he works at this point."}, {"time": 7537, "text": "And he fancies himself Jason Bourne, all right?"}, {"time": 7540, "text": "He's even got one of the screen names of Jason Bourne."}, {"time": 7543, "text": "So I'm like, all right, so Mariachi is telling us how much money he's making, everything else."}, {"time": 7548, "text": "I'm like, well, that's good."}, {"time": 7549, "text": "I'm glad you're all right."}, {"time": 7550, "text": "Kim contacts me and he's like, I want to go to Issaquah."}, {"time": 7553, "text": "And I was like, why?"}, {"time": 7554, "text": "And he's like, to make some money."}, {"time": 7555, "text": "I'm like, you're making money."}, {"time": 7557, "text": "He's like, I want to go to Issaquah."}, {"time": 7558, "text": "I was like, all right, go, be careful."}, {"time": 7560, "text": "So he gets in the car, Saturn is what he's driving."}, {"time": 7564, "text": "He drives his little piece of Saturn all the way up to Issaquah."}, {"time": 7568, "text": "Gets there, you know, midnight."}, {"time": 7570, "text": "They party all night long because they've never met each other."}, {"time": 7574, "text": "They're just celebrating, partying, drinking, everything else like that."}, {"time": 7577, "text": "Meanwhile, Big Buyer has placed another order with Outpost.com, $17,000."}, {"time": 7587, "text": "The second largest order Outpost.com had ever received at that point in time."}, {"time": 7593, "text": "By this point in time, Outpost knows the first order was fraudulent."}, {"time": 7597, "text": "Guess where it's going?"}, {"time": 7598, "text": "The exact same address the first order goes."}, {"time": 7601, "text": "So Outpost picks up the phone, calls Issaquah PD."}, {"time": 7604, "text": "Hey, we got a fraudster."}, {"time": 7606, "text": "Issaquah's like, would you mind sending some empty boxes?"}, {"time": 7611, "text": "And Outpost is like, be happy to."}, {"time": 7614, "text": "So the rule was, is on credit card fraud, if you've got full account access, you place the order."}, {"time": 7621, "text": "The morning it's supposed to arrive, you sign into the bank account or the credit card account."}, {"time": 7626, "text": "If you can sign in, you go pick up your product."}, {"time": 7629, "text": "If you can't sign in, you go back to sleep that day."}, {"time": 7633, "text": "Well, Big Buyer was the guy who placed the order."}, {"time": 7637, "text": "Mariachi and my second in charge are partying, all right?"}, {"time": 7640, "text": "So they're supposed to contact Big Buyer, they don't."}, {"time": 7644, "text": "Meanwhile, Big Buyer is raising hell, getting up with me like, hey, where are the guys?"}, {"time": 7651, "text": "I can't find them."}, {"time": 7652, "text": "They don't need to pick up this product."}, {"time": 7654, "text": "So I can't get in touch with them."}, {"time": 7656, "text": "They go down to pick up the, so Mariachi's got a Cadillac, old 70s Cadillac."}, {"time": 7661, "text": "He's got a Cadillac, pulls into the complex."}, {"time": 7665, "text": "Now Mariachi's driving, Kim Taylor's in the passenger seat, David Thomas's girlfriend's in the back seat."}, {"time": 7674, "text": "As they pull into the complex, going through the parking lot, Mariachi just happens to glance over and he sees a van with a guy sitting sideways in the van."}, {"time": 7683, "text": "And he looks at Kim Taylor and he's like, that's an undercover."}, {"time": 7687, "text": "And Kim's like, ah, it's fine."}, {"time": 7690, "text": "So they pull up to the office complex."}, {"time": 7693, "text": "Kim's like, I'll go in and get the packages."}, {"time": 7696, "text": "So he walks in, looks at the guy behind the counter."}, {"time": 7699, "text": "I believe you have some packages for us."}, {"time": 7701, "text": "Guy's like, one second."}, {"time": 7703, "text": "So he disappears around the wall, out pops the Issaquah PD, arrests Kim."}, {"time": 7709, "text": "David Thomas is in the car watching all this happen."}, {"time": 7712, "text": "He bugs out and they arrest him on the interstate where he has three fake driver's licenses in his wallet along with his real driver's license, another no, no, but they get him."}, {"time": 7724, "text": "So David Thomas had outstanding warrants out of Nebraska."}, {"time": 7728, "text": "We couldn't bond him out."}, {"time": 7730, "text": "Kim Taylor didn't have any warrants."}, {"time": 7732, "text": "So we bonded him out."}, {"time": 7733, "text": "My third in charge, kid, Seth Sanders was his name."}, {"time": 7740, "text": "He bonds him out, uses his girlfriend's account to bond him out."}, {"time": 7743, "text": "And I get Kim Taylor to go to Utah where another friend of mine agrees to house him, him and his wife."}, {"time": 7755, "text": "So I think everything's fine and all that."}, {"time": 7758, "text": "About three weeks later, this guy in Utah gets me on the phone."}, {"time": 7762, "text": "I'm like, hey, he's got to go."}, {"time": 7764, "text": "I'm like, what's going on?"}, {"time": 7767, "text": "He's like, well, the only thing he's doing is popping ecstasy tablets every day, all day."}, {"time": 7773, "text": "And I'm like, seriously?"}, {"time": 7776, "text": "I was like, okay, he's got to go."}, {"time": 7777, "text": "So we kick him out of there."}, {"time": 7778, "text": "By this point, I've got another crew that's coming through."}, {"time": 7780, "text": "I mean, I had all these crews running."}, {"time": 7782, "text": "Had another crew that's coming through Denver."}, {"time": 7785, "text": "Send Kim back to Denver to partner up with these guys."}, {"time": 7790, "text": "Kim gets these guys arrested."}, {"time": 7792, "text": "So by this point in time, I'm exasperated."}, {"time": 7794, "text": "I just want to throw my hands up in the air and walk away."}, {"time": 7797, "text": "So my retirement's coming up at the same time."}, {"time": 7800, "text": "So I'm like, fuck it, I'm done."}, {"time": 7803, "text": "So I tell everybody, the rest of the admins and the mods there, I'm like, this is what's going on."}, {"time": 7808, "text": "You guys need to watch out for this."}, {"time": 7809, "text": "We need to ban Kim, not let him back in."}, {"time": 7811, "text": "Be careful what's going on."}, {"time": 7813, "text": "I walk away."}, {"time": 7815, "text": "At the same time I walk away, Cumberjani, Albert Gonzalez, comes back into play."}, {"time": 7820, "text": "He sees everything that's going on."}, {"time": 7822, "text": "He uses that to his advantage."}, {"time": 7824, "text": "He starts banning everyone that's suspicious of him, sets up the VPN at the same time and says, hey, to make sure we're all secure, I need all transactions to go through this VPN."}, {"time": 7834, "text": "VPNs ran by the Secret Service."}, {"time": 7837, "text": "All right, Secret Service ends up, I think they ended up cataloging like $7 million worth of transactions over the next four or five months."}, {"time": 7845, "text": "Shadow Crew makes the front cover of Forbes, August, 2004."}, {"time": 7849, "text": "Headline, Who's Stealing Your Identity."}, {"time": 7852, "text": "October 26, 2004, United States Secret Service arrest, 33 people, six countries, six hours."}, {"time": 7860, "text": "I was in Charleston, South Carolina when I saw it happen."}, {"time": 7862, "text": "And I'm like."}, {"time": 7863, "text": "So you're the one that got away."}, {"time": 7868, "text": "I'm the one public."}, {"time": 7869, "text": "There were a couple other guys that got away that they didn't publicly mention."}, {"time": 7872, "text": "One, his name was Tron."}, {"time": 7874, "text": "He was a zero."}, {"time": 7878, "text": "But he went by the screen name Tron."}, {"time": 7881, "text": "He had access, almost unfettered access to Bank of America."}, {"time": 7887, "text": "So what happens is they identified the guy, Secret Service is in the air to go get him."}, {"time": 7891, "text": "They call the Ukrainian police."}, {"time": 7893, "text": "Hey, we're coming down to arrest this guy."}, {"time": 7894, "text": "Ukrainian cops are like, oh, come on down."}, {"time": 7898, "text": "So as soon as they got off the phone, Ukrainian cops get in the car, go down and tell Tron, hey, they're coming to get you."}, {"time": 7905, "text": "So he bugs out down to South America and they don't catch him I think for six or seven years after that, something like that."}, {"time": 7911, "text": "But caught him eventually."}, {"time": 7912, "text": "Caught him eventually."}, {"time": 7913, "text": "Well, let me actually ask you on this point."}, {"time": 7915, "text": "You've said that if you do cyber crime eventually, it's not gonna end well."}, {"time": 7923, "text": "So I don't wanna say that's because you're gonna be arrested because honestly, very few people are arrested, all right?"}, {"time": 7930, "text": "But it doesn't end well because of the type of person that you become."}, {"time": 7934, "text": "You quoted me earlier, you lie to everybody around you."}, {"time": 7941, "text": "You lie to yourself, you lie to your friends, you lie to your family."}, {"time": 7944, "text": "Of course, you lie to your victims."}, {"time": 7945, "text": "You don't have any friends."}, {"time": 7947, "text": "You know, I went 20 years without friends."}, {"time": 7950, "text": "I had associates, I didn't have friends."}, {"time": 7953, "text": "And you can't truly trust anybody."}, {"time": 7955, "text": "You don't trust anybody."}, {"time": 7957, "text": "You know, I had my wife, I was married for nine years."}, {"time": 7961, "text": "I lied to her every single day of those nine years."}, {"time": 7966, "text": "And it took her nine years to give up on me, to realize that I was that piece of shit."}, {"time": 7972, "text": "And she leaves at that point."}, {"time": 7975, "text": "Then from there, I started dating a stripper and lied to her."}, {"time": 7979, "text": "I thought I had friends."}, {"time": 7980, "text": "I lied to all those people that I knew that thought they were my friends."}, {"time": 7984, "text": "I lied to them the entire time."}, {"time": 7986, "text": "You become that individual."}, {"time": 7988, "text": "I don't think a lot of people really understand how bad that is."}, {"time": 7994, "text": "You know, you talked about, you pointed out that woman that I ripped off."}, {"time": 7998, "text": "She was trying to put a roof on her house for her freaking kids, man."}, {"time": 8002, "text": "You're that person."}, {"time": 8004, "text": "So you're also lying to yourself."}, {"time": 8009, "text": "And that's not a mindset in which you can grow as a person, find happiness, find genuine, simple human affection, which is what love is."}, {"time": 8022, "text": "Simple, real friendship, all of those things."}, {"time": 8026, "text": "So I went to prison, of course."}, {"time": 8028, "text": "One of the things, one of the most important lessons that I've learned in prison, because cyber crime as a whole, if you're a criminal, it's an addiction, all right?"}, {"time": 8036, "text": "If you're addicted to something, whether it be drugs, crime, gambling, what have you, if you're addicted to something, you cannot love anything else except the addiction."}, {"time": 8045, "text": "The addiction comes first, all right?"}, {"time": 8048, "text": "And you pointed out some of those truly despicable things."}, {"time": 8053, "text": "Script, for example, tortures that guy."}, {"time": 8056, "text": "You get to the point where it's like, okay, this is the business."}, {"time": 8060, "text": "And I tried to convince myself that I'm a businessman, but I'm a good guy on the other end."}, {"time": 8067, "text": "And you're not, you're not."}, {"time": 8068, "text": "So those lies become part of it, everything else."}, {"time": 8071, "text": "And yeah, the higher ups are usually arrested, they are."}, {"time": 8077, "text": "But you've got millions of cyber criminals these days."}, {"time": 8080, "text": "So most guys are not gonna be arrested."}, {"time": 8083, "text": "So you may be arrested."}, {"time": 8085, "text": "You may be like freaking Jonathan James."}, {"time": 8089, "text": "He was a minor, a very, very talented individual, very competent."}, {"time": 8094, "text": "He had, as a kid, he had broke into NASA, the OD, Pentagon."}, {"time": 8099, "text": "He shut the NASA computers down for six weeks."}, {"time": 8101, "text": "This is that kid."}, {"time": 8103, "text": "Then he decides he wants to go into credit card theft, partners with Albert, he's arrested with Albert."}, {"time": 8109, "text": "Law enforcement, they were gonna blame him."}, {"time": 8113, "text": "He was the only competent individual."}, {"time": 8115, "text": "So this kid gets up one day, he wasn't in prison yet."}, {"time": 8119, "text": "He gets up one day, goes in his dad's bedroom, gets out his 45, walks in the bathroom, and blows his brains out."}, {"time": 8126, "text": "You know, you've got things like that."}, {"time": 8129, "text": "Or you're gonna rip somebody off, and you're gonna end up like scripted with that guy, the guy who ran Evolution Marketplace."}, {"time": 8137, "text": "No one knew who, two people ran that guy and a girl."}, {"time": 8140, "text": "And no one knew who they were."}, {"time": 8142, "text": "He ends up stealing about $24 million, a lot of it from Ukrainian mob, and they found him about a year later on a beach without his head in hands."}, {"time": 8151, "text": "But you know, it always goes south."}, {"time": 8153, "text": "But more than anything, to me, the negative thing is you really become somebody that, I mean, just truly a despicable human being."}, {"time": 8165, "text": "When you get to the point when you're destroying people's retirement accounts, you're stealing money from a woman that simply wants to do something good for her family."}, {"time": 8178, "text": "When you become that individual, and you're okay with that, my God, man."}, {"time": 8183, "text": "It got to the point, I had one guy I ripped off, it's like for $900, is when I first started the cybercrime stuff."}, {"time": 8189, "text": "It's when I was becoming competent."}, {"time": 8191, "text": "And I ripped him off for like $900, and he sent me an email, and he was like, the email said something like, I guess you needed the money, and it's okay."}, {"time": 8207, "text": "You know, you keep it."}, {"time": 8208, "text": "And I'm getting chills right now thinking about it."}, {"time": 8212, "text": "It's that, where you become that individual."}, {"time": 8222, "text": "Can I actually backtrack?"}, {"time": 8223, "text": "Listen, I love love, okay?"}, {"time": 8227, "text": "And there's a story that you fell in love with a stripper."}, {"time": 8231, "text": "I mean, you have to tell the story."}, {"time": 8233, "text": "So how did you fall in love with somebody, not that there's anything wrong with that profession, but it's romantic."}, {"time": 8240, "text": "It's like a true romance, by the way, great movie."}, {"time": 8243, "text": "It is a great film."}, {"time": 8244, "text": "It's truly a great film."}, {"time": 8247, "text": "Even Brad Pitt, who makes a brief appearance, is genius."}, {"time": 8251, "text": "There's so much good acting there."}, {"time": 8252, "text": "Anyway, so tell me that love story."}, {"time": 8255, "text": "All right, so like I said, from my dad, I get that fear of being abandoned."}, {"time": 8261, "text": "I lied to my wife for nine years until she leaves."}, {"time": 8265, "text": "And I was in Charleston, South Carolina."}, {"time": 8268, "text": "And what happened was, I noticed that Susan, she was not coming to bed like she used to."}, {"time": 8276, "text": "She'd stay up all night long, and sometimes she'd go and be gone a few hours and everything else."}, {"time": 8282, "text": "And I'm like, well, something's going on."}, {"time": 8283, "text": "And I'd pass by her computer and she would minimize the screens."}, {"time": 8286, "text": "And I'm like, well, gotta figure out what the hell is going on."}, {"time": 8290, "text": "So put a key logger on her system."}, {"time": 8293, "text": "As anybody should in a relationship."}, {"time": 8297, "text": "Absolutely, because you trust them, so why not?"}, {"time": 8300, "text": "You should be tracking all their movements, all their stuff."}, {"time": 8304, "text": "Like I said, I was the control freak too."}, {"time": 8306, "text": "So I found out she'd been cheating on me."}, {"time": 8309, "text": "And she was."}, {"time": 8310, "text": "See, there you go, they had a reason."}, {"time": 8311, "text": "They had a reason, I justified."}, {"time": 8314, "text": "So I found out she was cheating on me."}, {"time": 8315, "text": "She was asleep when I found it out."}, {"time": 8316, "text": "And I sat there looking at it and I was like, well, shit."}, {"time": 8320, "text": "So I got up, walked in the bedroom, opened up the wardrobe, got a suitcase out, started putting her clothes in it."}, {"time": 8326, "text": "And she wakes up, she's like, where are you going?"}, {"time": 8328, "text": "And I'm like, I'm not, you are."}, {"time": 8331, "text": "Well, my bravado disappeared pretty quickly."}, {"time": 8334, "text": "I took about a week of both of us crying and arguing and everything else."}, {"time": 8341, "text": "And she finally left."}, {"time": 8343, "text": "And I went through this depression."}, {"time": 8347, "text": "I was in Charleston, South Carolina."}, {"time": 8349, "text": "I would just walk around the house kind of stumbling in a daze."}, {"time": 8352, "text": "Realized I was getting suicidal."}, {"time": 8355, "text": "And was smart enough to do something about it."}, {"time": 8358, "text": "And picked up the phone book."}, {"time": 8359, "text": "And that's where there's always this sense of humor."}, {"time": 8362, "text": "So I picked up the phone book."}, {"time": 8363, "text": "I'm going through the yellow pages."}, {"time": 8365, "text": "I'm like, psychologist, criminal psychologist, because I need that."}, {"time": 8370, "text": "Called the psychologist, crying to her."}, {"time": 8372, "text": "I mean, crying on the phone."}, {"time": 8373, "text": "Told her everything."}, {"time": 8373, "text": "I'm this criminal."}, {"time": 8374, "text": "This is what's happened."}, {"time": 8375, "text": "She's like, come in now."}, {"time": 8376, "text": "So I go in, spill my guts."}, {"time": 8379, "text": "And saw her for about four months."}, {"time": 8382, "text": "And I joke about it, but it's true."}, {"time": 8383, "text": "She was trying to get me to stop breaking the law and to go into real estate."}, {"time": 8388, "text": "And I remember telling her, is there a difference?"}, {"time": 8391, "text": "She was like, yes, there's a difference."}, {"time": 8394, "text": "So I saw her for about four months."}, {"time": 8397, "text": "I was 34."}, {"time": 8399, "text": "I didn't start drinking until I was 34."}, {"time": 8402, "text": "I'd never done drugs or anything else like that, because my mom was an addict as well."}, {"time": 8407, "text": "So I was this guy that always wanted to be in control."}, {"time": 8409, "text": "Didn't want to lose control of myself."}, {"time": 8413, "text": "And had never been to a strip club."}, {"time": 8416, "text": "So one night, I was getting lonely."}, {"time": 8419, "text": "So I walked into the strip club."}, {"time": 8420, "text": "Actually, I was researching the strip club."}, {"time": 8422, "text": "And it was Joe's Roundup in Charleston, South Carolina."}, {"time": 8427, "text": "Joe's Roundup."}, {"time": 8428, "text": "Little bitty hole in the wall stuff."}, {"time": 8430, "text": "Yeah, real classy."}, {"time": 8432, "text": "So I walked in, and I'm literally that guy, man, that fell in love with the first stripper that he sees."}, {"time": 8441, "text": "She walks by, I'm like, that one."}, {"time": 8444, "text": "So I didn't know the strip club game."}, {"time": 8446, "text": "Again, criminal, naive as hell."}, {"time": 8448, "text": "So belly up at the bar, order the beer."}, {"time": 8452, "text": "I'm sitting there drinking it."}, {"time": 8454, "text": "She comes over to me, and we start talking."}, {"time": 8457, "text": "And she's like, would you like to get a bottle of champagne?"}, {"time": 8461, "text": "I was like, does that mean going in back or what?"}, {"time": 8463, "text": "She's like, well, yeah, you need to do the bottle when you're going back."}, {"time": 8465, "text": "And I was like, sure, let's buy a bottle of champagne."}, {"time": 8468, "text": "$400 bottle of Korbel."}, {"time": 8473, "text": "And again, that bravado disappears pretty quickly."}, {"time": 8475, "text": "I get back there, and we talk for two hours."}, {"time": 8478, "text": "And nowadays, I don't understand that most men who go to strip clubs, the strippers are their therapist most of the time."}, {"time": 8486, "text": "So I'm sitting there talking, we're talking."}, {"time": 8487, "text": "And of course, she's sizing me up."}, {"time": 8489, "text": "She's looking at the watch."}, {"time": 8490, "text": "She's like, what kind of car do you drive?"}, {"time": 8493, "text": "Everything else."}, {"time": 8494, "text": "And I'm telling her and talking."}, {"time": 8496, "text": "So at the end of the night, I'm like, really nice meeting."}, {"time": 8499, "text": "She's like, it's so nice meeting you, too."}, {"time": 8501, "text": "So I leave."}, {"time": 8504, "text": "You guys just talked."}, {"time": 8505, "text": "Just talked."}, {"time": 8506, "text": "And there's still this feeling of love and all of that."}, {"time": 8508, "text": "Yeah, so just talked."}, {"time": 8509, "text": "Just got along pretty good."}, {"time": 8511, "text": "I'm like, I like her."}, {"time": 8514, "text": "So come back in a week later."}, {"time": 8517, "text": "Walk in and call her over."}, {"time": 8519, "text": "And I was like, look, I said, that was my first time to a strip club."}, {"time": 8523, "text": "I said, don't know you."}, {"time": 8524, "text": "I like you."}, {"time": 8524, "text": "I'd like to know you more."}, {"time": 8525, "text": "Would you like to go out to dinner?"}, {"time": 8527, "text": "And she was like, yeah."}, {"time": 8530, "text": "I was like, where would you like to go?"}, {"time": 8531, "text": "So she says, Rue de Jon."}, {"time": 8533, "text": "And I was like, don't know what it is."}, {"time": 8535, "text": "That's where we'll go."}, {"time": 8536, "text": "So I go back."}, {"time": 8536, "text": "And I had a theater buddy at that point in time because I was trying to get my life together."}, {"time": 8543, "text": "JC was his name."}, {"time": 8544, "text": "And I was like, I got a date."}, {"time": 8545, "text": "He's like, you got a date?"}, {"time": 8546, "text": "I was like, yeah, man, I got a date."}, {"time": 8548, "text": "And he's like, OK, where are you going?"}, {"time": 8550, "text": "I was like, Rue de Jon."}, {"time": 8551, "text": "And he's like, take your wallet."}, {"time": 8557, "text": "I was like, all right."}, {"time": 8558, "text": "So we start doing the lunch and the dinner thing."}, {"time": 8563, "text": "And I get to where I really like her."}, {"time": 8568, "text": "She was 23 and got along really well, had common interest in music and arts and stuff like that."}, {"time": 8577, "text": "I mean, it's stereotypical."}, {"time": 8579, "text": "She had graduated college with a degree in religious studies."}, {"time": 8586, "text": "So I was like, all right."}, {"time": 8588, "text": "So yeah, you just fell in love."}, {"time": 8590, "text": "We got along really well, really well."}, {"time": 8592, "text": "So I ended up moving her in with me."}, {"time": 8594, "text": "She hadn't quit her job."}, {"time": 8596, "text": "And what was happening was she was working weekends."}, {"time": 8602, "text": "And the club would close at 3 or 4."}, {"time": 8606, "text": "She wouldn't come home until 10 or 11 in the morning."}, {"time": 8610, "text": "And most of the time, it would be a phone call saying, come and pick me up."}, {"time": 8614, "text": "I can't drive home."}, {"time": 8615, "text": "And then I'd never used drugs, had never been around."}, {"time": 8619, "text": "And my mom, Valium and pot and things like that."}, {"time": 8622, "text": "But as far as interacting with her, I'd never done anything like that."}, {"time": 8626, "text": "By this point in time, I'm kind of getting head over heels with her."}, {"time": 8628, "text": "I moved her in with me and everything."}, {"time": 8630, "text": "And I had never, I was 34, I had never went through a woman's purse in my entire life."}, {"time": 8637, "text": "And so she comes in, passes out."}, {"time": 8641, "text": "And I'm like, I got to know what the fuck's going on."}, {"time": 8644, "text": "And went over and went through her purse."}, {"time": 8648, "text": "Found cocaine and the straw, cut off straws and all that stuff."}, {"time": 8653, "text": "And I'm like, broke my heart."}, {"time": 8655, "text": "I just sat there and started crying."}, {"time": 8659, "text": "Got online, and I'm the guy that can find information."}, {"time": 8663, "text": "So I started looking for forums on strip clubs."}, {"time": 8666, "text": "Found a forum, found that one, found where it was talking about her prostituting herself to support the habit."}, {"time": 8675, "text": "And that got me, man."}, {"time": 8680, "text": "That got me."}, {"time": 8681, "text": "It was talking about everything she was doing to do that."}, {"time": 8685, "text": "And I broke your heart there."}, {"time": 8689, "text": "So I didn't have the heart to tell her that I knew she was prostituting."}, {"time": 8695, "text": "But I went to her, and I was like, she's waking up."}, {"time": 8698, "text": "And I was like, look, I found this in your purse."}, {"time": 8701, "text": "I can't have that."}, {"time": 8702, "text": "And she's like, well, you think I'm prostituting?"}, {"time": 8704, "text": "I was like, no, no, I don't think that."}, {"time": 8706, "text": "I knew it, but I didn't mention it to her."}, {"time": 8708, "text": "And I was like, I can't have that."}, {"time": 8711, "text": "Well, I don't do that."}, {"time": 8713, "text": "It's just a one time thing."}, {"time": 8715, "text": "So she went back to work and continued to do it for a couple more weeks."}, {"time": 8720, "text": "And then finally, I was like, I can't."}, {"time": 8723, "text": "So I picked her up one morning."}, {"time": 8725, "text": "She couldn't drive home."}, {"time": 8728, "text": "Before I picked her up, I had written her a note, left it on the pillow."}, {"time": 8732, "text": "So I brought her home, tucked her in the bed, and told her I'd be back that night."}, {"time": 8741, "text": "Told her she had a letter when she woke up."}, {"time": 8743, "text": "And the letter was basically, I love you."}, {"time": 8746, "text": "If you can't stop this, don't be here when I get back."}, {"time": 8750, "text": "And I went to Columbia that day, came back that night, and she had quit her job."}, {"time": 8767, "text": "And she quit drugs that night, really quit them."}, {"time": 8773, "text": "And I got it in my head that I needed to do whatever I needed to do to make sure she didn't go back to that."}, {"time": 8789, "text": "That became, to me, because of my background, that meant spending a lot of money."}, {"time": 8797, "text": "And so every night was $300 to $600 for dinner."}, {"time": 8802, "text": "It was $1,000 shoes every week, $2,000 purse every week, all that."}, {"time": 8809, "text": "I had most of my money laundered out to Estonia."}, {"time": 8814, "text": "And Elizabeth, at the same time, she quit."}, {"time": 8822, "text": "But she didn't want me to go anywhere."}, {"time": 8829, "text": "All right, she wanted me there all the time."}, {"time": 8832, "text": "I guess that was that connection."}, {"time": 8834, "text": "I guess she was scared she might go back to something."}, {"time": 8837, "text": "So Shadow Crew gets busted."}, {"time": 8841, "text": "I go through, basically, all my US funds."}, {"time": 8844, "text": "Can't get anything from overseas."}, {"time": 8846, "text": "Shadow Crew gets busted October."}, {"time": 8848, "text": "I can't go into committing tax fraud because season's over."}, {"time": 8852, "text": "Can't go back into credit fraud because Shadow Crew's been busted."}, {"time": 8855, "text": "I don't know who to trust online."}, {"time": 8858, "text": "I'm left with running counterfeit cashier's checks to get money in, trying to make it until I can start back with some other fraud, and lying to her the entire time."}, {"time": 8869, "text": "She knows about none of this."}, {"time": 8870, "text": "None of it."}, {"time": 8873, "text": "And she thinks I've got a shitload of money."}, {"time": 8875, "text": "And she's got expensive taste."}, {"time": 8879, "text": "So at the same time, she couldn't be intimate."}, {"time": 8886, "text": "I mean, the girl loved me."}, {"time": 8889, "text": "That's the first time I've really said that."}, {"time": 8892, "text": "So there's deep love there both ways."}, {"time": 8898, "text": "Things we do."}, {"time": 8901, "text": "So she couldn't be intimate unless she was stone cold drunk."}, {"time": 8910, "text": "I mean, just shit."}, {"time": 8911, "text": "Stone cold drunk."}, {"time": 8914, "text": "And shit, I didn't mind her drinking alcohol."}, {"time": 8918, "text": "I'd rather have that than cocaine."}, {"time": 8920, "text": "So that was the intimacy there."}, {"time": 8924, "text": "And I kept thinking, if I continue to invest, that it would work out, that just keep going, she'll be all right, we'll be all right."}, {"time": 8943, "text": "And what happens is, like I said, she thought I had money."}, {"time": 8947, "text": "She thought I had money."}, {"time": 8949, "text": "She wanted a couple of Tiffany engagement rings."}, {"time": 8951, "text": "So I said, we can get married."}, {"time": 8953, "text": "I figured of marriage, show her that I love her, show her it's going to be all right."}, {"time": 8958, "text": "So I was like, let's get married."}, {"time": 8961, "text": "She's like, well, I've always wanted a Tiffany ring."}, {"time": 8963, "text": "She doesn't have money to buy the Tiffany ring because all my money was overseas."}, {"time": 8966, "text": "So here I am."}, {"time": 8967, "text": "I defraud."}, {"time": 8969, "text": "So it's counterfeit cashiers."}, {"time": 8971, "text": "I find like a three carat ring on eBay for 20 grand and pay for it with a counterfeit cashiers check."}, {"time": 8980, "text": "At the same time, because she doesn't want me to leave, she needs me there, typically, if you're doing that type of crime, you need to be traveling."}, {"time": 8989, "text": "You can't do it in one central area because you're going to be identified pretty quickly."}, {"time": 8993, "text": "I knew that, but I didn't have much choice."}, {"time": 8997, "text": "So start running counterfeit cashiers checks to get the money to live and everything."}, {"time": 9003, "text": "Get the engagement ring."}, {"time": 9006, "text": "We were scheduled to be married."}, {"time": 9006, "text": "Our wedding date was February 26, 2005."}, {"time": 9019, "text": "February 8, 2005."}, {"time": 9023, "text": "I've got a Tiffany wedding band, a couple of them coming in."}, {"time": 9028, "text": "And I get arrested in Charleston, South Carolina."}, {"time": 9032, "text": "And she didn't know."}, {"time": 9034, "text": "I told her, I said, I've got to go pick up those rings."}, {"time": 9036, "text": "She thought I was just having them sent in."}, {"time": 9039, "text": "I said, I've got to go get those rings."}, {"time": 9040, "text": "And I said, we'll go out to dinner after that."}, {"time": 9043, "text": "And I left at like 8 o clock in the morning."}, {"time": 9049, "text": "And I was arrested at, I think, 1130, something like that."}, {"time": 9054, "text": "Of course, I wanted to call her."}, {"time": 9056, "text": "And the FBI got me."}, {"time": 9058, "text": "It turns out it was controlled delivery."}, {"time": 9060, "text": "There were like 30 agents in the parking lot."}, {"time": 9063, "text": "FBI got me."}, {"time": 9064, "text": "Charleston PD got me."}, {"time": 9065, "text": "Within 45 minutes, the Secret Service comes in, takes over that investigation."}, {"time": 9069, "text": "They knew exactly who they had."}, {"time": 9073, "text": "Along about 7 o clock at night, they're like, we want to search your house."}, {"time": 9078, "text": "And I was like, look, I'll sign off on the search if you let me go with you so I can see her."}, {"time": 9083, "text": "And they were like, OK."}, {"time": 9087, "text": "So I got to see my phone at that point."}, {"time": 9088, "text": "I had like 140 calls where she had been trying to call all that time."}, {"time": 9094, "text": "She was worried."}, {"time": 9096, "text": "And so they load me up."}, {"time": 9100, "text": "And hell, I mean, you talk about 10, 12 cars, 40 agents, everything else."}, {"time": 9106, "text": "She's got a dog at that point."}, {"time": 9107, "text": "I'm scared they're going to shoot the dog."}, {"time": 9109, "text": "And it was dark."}, {"time": 9115, "text": "And they had me walk up."}, {"time": 9117, "text": "And they're all behind me."}, {"time": 9118, "text": "I knock on the door and tell her the police are there."}, {"time": 9121, "text": "She needs to put the dog up."}, {"time": 9123, "text": "So she does, and they come in and just start ransacking them to put me in cuffs, set me down, start berating her with questions."}, {"time": 9131, "text": "She had no idea what the hell was going on."}, {"time": 9133, "text": "Were you able to say a word or two to help her understand?"}, {"time": 9136, "text": "Yeah, I was trying to tell her."}, {"time": 9138, "text": "And at the same time, they take a watch off her wrist."}, {"time": 9141, "text": "They let her keep the ring."}, {"time": 9144, "text": "They're telling her that I'm this guy."}, {"time": 9145, "text": "What's my real name?"}, {"time": 9147, "text": "Bang, bang, bang, bang, bang across the board."}, {"time": 9149, "text": "So she's probably terrified."}, {"time": 9153, "text": "And I tell her, I was like, look, they're going to arraign me tomorrow."}, {"time": 9158, "text": "I said, see what's going on, but don't show up."}, {"time": 9162, "text": "Of course, she's there next morning."}, {"time": 9163, "text": "Her and her dad."}, {"time": 9165, "text": "And she's back in the back crying."}, {"time": 9167, "text": "They're reading off the charges."}, {"time": 9169, "text": "I'm under $300,000 bond, everything else."}, {"time": 9179, "text": "They throw me in a cell."}, {"time": 9181, "text": "Meanwhile, more charges keep coming in."}, {"time": 9184, "text": "And it's like 10, 12 charges a day at that point."}, {"time": 9190, "text": "And I'm trying to call her to make sure she's all right."}, {"time": 9193, "text": "And does it get through?"}, {"time": 9196, "text": "So I spent three months in jail."}, {"time": 9199, "text": "And during that three months, she visits twice."}, {"time": 9201, "text": "I get like three or four phone calls to her."}, {"time": 9206, "text": "Looking back now, I understand why."}, {"time": 9208, "text": "Back then, it was like, I'm the victim."}, {"time": 9209, "text": "Why doesn't she talk to me?"}, {"time": 9211, "text": "But now I understand why."}, {"time": 9215, "text": "Hell, the girl loved me too."}, {"time": 9217, "text": "She found out I was this piece of shit."}, {"time": 9219, "text": "And after a week in county jail, two agents fly in from New Jersey, two Secret Service guys."}, {"time": 9227, "text": "Pulled me out of cell, looked at me, and they were like, we've got your laptop."}, {"time": 9232, "text": "And he's like, well, have you got anything on your laptop?"}, {"time": 9236, "text": "He's like, you're going to be charged for it."}, {"time": 9237, "text": "I was like, I figured."}, {"time": 9239, "text": "And then he looks at me, he's like, can you do anything for us?"}, {"time": 9245, "text": "And I told him my exact words were, look, you let me get back with Elizabeth."}, {"time": 9248, "text": "I'll do whatever you want me to do."}, {"time": 9251, "text": "And he looks at me, he's like, we're going to get you out."}, {"time": 9255, "text": "So they let me sit there for three months to get a taste of it and get me out."}, {"time": 9261, "text": "My sister, they have the bond reduced to $1,000."}, {"time": 9265, "text": "My sister pays the $1,000 bond."}, {"time": 9267, "text": "By this point, she's disowned me."}, {"time": 9268, "text": "And because I'm dating the stripper."}, {"time": 9271, "text": "And Denise bonds me out."}, {"time": 9276, "text": "The person that I call immediately is Elizabeth."}, {"time": 9281, "text": "And she's like, I'll be there."}, {"time": 9283, "text": "I was like, OK."}, {"time": 9284, "text": "So it's like 11 o clock at night."}, {"time": 9289, "text": "I'm in the parking lot of the Charleston County jail."}, {"time": 9293, "text": "Me and a Secret Service agent standing there."}, {"time": 9295, "text": "And Elizabeth had a friend that owned a limo company."}, {"time": 9298, "text": "So she pulls up in a limo, gets out, pops the trunk, gets these two plastic containers out that have my clothes in them, drops them off the pavement, comes over, hugs me, call me later."}, {"time": 9316, "text": "Gets in the car, drives off."}, {"time": 9318, "text": "I'm sitting there crying like a baby."}, {"time": 9320, "text": "Agent looks at me, is that your fiancee?"}, {"time": 9323, "text": "And he's like, I am so sorry."}, {"time": 9325, "text": "And I'm like, yeah."}, {"time": 9328, "text": "I had to."}, {"time": 9330, "text": "She sounds fascinating."}, {"time": 9332, "text": "Pull up in a limo."}, {"time": 9336, "text": "I had $30 in my name at that point, $30."}, {"time": 9340, "text": "The agent had to pay for my hotel room that first night."}, {"time": 9343, "text": "So he drops me off after paying for the hotel room, buy me something to eat."}, {"time": 9347, "text": "Soon as he drops me off, I take that $30, walk a half mile to Walmart, buy a prepaid debit card so I can start back in tax fraud."}, {"time": 9356, "text": "Soon as I get back to the hotel room, call Elizabeth, beg her to come see me."}, {"time": 9360, "text": "She comes to see me, and we talk most of the night, and convince her to give me a chance."}, {"time": 9365, "text": "I tell her that everything's going to be all right."}, {"time": 9367, "text": "They're going to hire me."}, {"time": 9369, "text": "I'm going to be this big consultant."}, {"time": 9371, "text": "Lies, lies, just so she'd get back with me."}, {"time": 9374, "text": "And she's like, OK. And so we move from Charleston."}, {"time": 9380, "text": "The field office is in Columbia, South Carolina."}, {"time": 9384, "text": "And I'm breaking the law."}, {"time": 9387, "text": "Even before I start working with them, I'm breaking the law."}, {"time": 9390, "text": "And so they've got me in the office, the field office."}, {"time": 9394, "text": "They got this big war room in there."}, {"time": 9396, "text": "I'm on a laptop, outside line, laptops hooked up to a 50 inch plasma monitor on the wall."}, {"time": 9403, "text": "They've got a desktop sitting directly next to me, outside line, two Secret Service officers in the room at all times with a South Carolina law enforcement officer."}, {"time": 9414, "text": "My job is 46 hours a day, surfing the web, picking up targets, intel, teaching them how cybercrime operates, everything else like that."}, {"time": 9424, "text": "For the first two weeks, they are extremely diligent."}, {"time": 9428, "text": "They pay attention to everything that's going on, ask questions, everything else."}, {"time": 9432, "text": "But the problem is that that shit gets boring real quick, because I'm very fast online doing that."}, {"time": 9440, "text": "So they're like, what the hell is he doing?"}, {"time": 9442, "text": "And it gets tiring looking at a guy just doing that shit."}, {"time": 9445, "text": "So after two weeks, they get lazy and bored."}, {"time": 9448, "text": "And they start watching porn instead of watching me."}, {"time": 9454, "text": "At the same time, they've got a keylogger."}, {"time": 9457, "text": "And they've got Spectre Pro and Camtasia, keyloggers and taking snapshots of everything that I'm doing."}, {"time": 9463, "text": "Every night, it goes on a DVD rom on a spindle."}, {"time": 9466, "text": "So I'm like, they're not going to go through that shit."}, {"time": 9471, "text": "So I'm like, fuck it."}, {"time": 9473, "text": "Start breaking the law from inside the Secret Service offices while they're in the room."}, {"time": 9480, "text": "That continues for 10 months."}, {"time": 9483, "text": "At the same time, the relationship with Elizabeth fell apart, completely fell apart."}, {"time": 9492, "text": "Do you have an understanding of why?"}, {"time": 9494, "text": "Because her heart got broken because there was lying."}, {"time": 9498, "text": "It was the trust."}, {"time": 9499, "text": "She felt like she did a lot to sacrifice for the relationship."}, {"time": 9503, "text": "You've got a woman there that she had even said it."}, {"time": 9513, "text": "She was like, she had told one of her friends we were out having dinner one night."}, {"time": 9521, "text": "And this was before I got arrested."}, {"time": 9522, "text": "She told one of her friends that I was the only guy that ever asked her to stop using drugs."}, {"time": 9532, "text": "Yeah, I have to say that part of the story is so powerful."}, {"time": 9537, "text": "And then that she chose to do it, and she chose to stop."}, {"time": 9543, "text": "And she told me that there was one instance she told me that if she didn't marry me, she'd never be married."}, {"time": 9550, "text": "And as far as I know, she's never been married."}, {"time": 9555, "text": "And so it started to fall apart there."}, {"time": 9557, "text": "Yeah, because I was that piece of shit."}, {"time": 9563, "text": "Still, you didn't take a step."}, {"time": 9565, "text": "By the way, can I just say how just moving it is, how honest you are."}, {"time": 9570, "text": "But thank you."}, {"time": 9572, "text": "Thank you for being that person."}, {"time": 9574, "text": "But at that time, there's still that lying."}, {"time": 9580, "text": "So it's falling apart."}, {"time": 9584, "text": "She wants to start going to strip clubs."}, {"time": 9586, "text": "And I'm like, fuck it."}, {"time": 9590, "text": "We'll go."}, {"time": 9591, "text": "So we start going to strip clubs, and she'll come back and get wasted."}, {"time": 9595, "text": "And we'll have sex, what have you."}, {"time": 9598, "text": "And one night, she looks at me, and she was like, I think it'd be funny if you got a blow job from somebody else."}, {"time": 9612, "text": "And that got me."}, {"time": 9616, "text": "I was like, to me, that was the final straw right there."}, {"time": 9620, "text": "I was like, she doesn't care for me anymore or anything else like that."}, {"time": 9625, "text": "We've been going to strip clubs, so I started dating another stripper."}, {"time": 9629, "text": "And she knew something was going on."}, {"time": 9633, "text": "And she looks at me one day, and she's like, why don't you just tell me that it's over?"}, {"time": 9639, "text": "And I looked at her, and I said, it's over."}, {"time": 9642, "text": "And I told her, I was like, look, I said, whatever you want."}, {"time": 9648, "text": "We were renting an apartment."}, {"time": 9649, "text": "I was like, whatever you want in here, take it."}, {"time": 9653, "text": "And I said, not only that, but I'll make sure you got money for several months so you're all right."}, {"time": 9664, "text": "And I was like, just leave me my TV and leave me some plates and stuff."}, {"time": 9671, "text": "So I go to work that day at the Secret Service, come back that night, and she's taken everything and left a picture of herself in the bedroom on the floor."}, {"time": 9682, "text": "I'm like, OK, I guess I deserve that."}, {"time": 9686, "text": "She's got, I like her."}, {"time": 9688, "text": "She's got a sense of humor."}, {"time": 9689, "text": "Yeah, she was cool."}, {"time": 9690, "text": "She was cool."}, {"time": 9693, "text": "I'm giving her $1,000 every two weeks or some shit like that."}, {"time": 9697, "text": "And it gets to the point, because I'm doing this tax fraud from inside the offices."}, {"time": 9703, "text": "Well, the debit card companies are pinging the cards."}, {"time": 9707, "text": "They start to realize that, hey, some son of a bitch is stealing money using our debit card."}, {"time": 9711, "text": "So they start to shut down the cards before I can pull cash out."}, {"time": 9714, "text": "So I start not to have the money to send to her."}, {"time": 9717, "text": "And I'm like, so she calls, and she's like, look, I have to have money."}, {"time": 9722, "text": "And I was like, well, look, I'm doing what I can."}, {"time": 9725, "text": "You promised money."}, {"time": 9726, "text": "And I was like, look, if you knew what I was doing to get this money, you wouldn't be asking that."}, {"time": 9731, "text": "And she's like, I need money."}, {"time": 9733, "text": "My rent's behind by a month right now."}, {"time": 9736, "text": "And I'm like, your rent's behind?"}, {"time": 9738, "text": "She's like, yeah."}, {"time": 9738, "text": "So I was like, OK, so I pick up the phone, call the rental office."}, {"time": 9743, "text": "And I was like, I just want to make sure that I'm sorry I'm behind on the rent for this apartment number."}, {"time": 9749, "text": "Oh, no, that rent's paid up three months."}, {"time": 9753, "text": "It's like, OK, hang up, call Elizabeth back."}, {"time": 9755, "text": "I was like, you're behind on the rent."}, {"time": 9759, "text": "And I was like, funny, they just said you're up on it three months."}, {"time": 9763, "text": "And she gets quiet, and she's like, well, you lied to me, too."}, {"time": 9767, "text": "And I was like, you're right."}, {"time": 9772, "text": "I was like, but look, I can't do it anymore."}, {"time": 9774, "text": "And that's the last time I spoke to her right there."}, {"time": 9780, "text": "What happens is I was breaking law from inside the offices."}, {"time": 9787, "text": "I had a buddy that his name was Sean Mims out of Los Angeles."}, {"time": 9792, "text": "I had taught him how to do tax return fraud."}, {"time": 9796, "text": "I had told Sean, I go missing, I go missing for three months."}, {"time": 9799, "text": "I told him if I ever went missing not to contact me."}, {"time": 9802, "text": "And so I go missing, then I show back up online."}, {"time": 9806, "text": "First day, he contacts."}, {"time": 9808, "text": "So he becomes a target."}, {"time": 9809, "text": "And they identify him pretty quickly at that point."}, {"time": 9813, "text": "He's set to be arrested sometime in March of six."}, {"time": 9818, "text": "That's when he's set to be arrested."}, {"time": 9820, "text": "Operation Rolling Stone was the name of the operation."}, {"time": 9823, "text": "Nine people were supposed to be arrested that night."}, {"time": 9825, "text": "So Secret Service goes and arrests this guy."}, {"time": 9830, "text": "They search his apartment and don't find anything."}, {"time": 9833, "text": "The apartment manager comes out and explains to him how Sean has done all kinds of work to the apartment."}, {"time": 9838, "text": "As a matter of fact, he brought in $30,000 worth of Italian tile to put in the apartment that he's renting."}, {"time": 9846, "text": "And by the way, last night he had a UHaul out here and took out a whole shitload of stuff."}, {"time": 9851, "text": "So Secret Service comes back in."}, {"time": 9855, "text": "They look at me and they're like, we need you to take a polygraph."}, {"time": 9859, "text": "And my answer was, I ain't taking a polygraph."}, {"time": 9862, "text": "So they're like, well, we'll throw you back in jail if you don't."}, {"time": 9865, "text": "And I was like, call my lawyer."}, {"time": 9866, "text": "Lawyer gets me on the phone."}, {"time": 9867, "text": "He's like, you don't have to take the polygraph."}, {"time": 9870, "text": "I was like, well, good, I'm not going to."}, {"time": 9872, "text": "But they will throw you back in jail."}, {"time": 9873, "text": "And I was like, don't want to do that."}, {"time": 9875, "text": "And he's like, have you done anything?"}, {"time": 9881, "text": "And he's like, well, you can try to pass the polygraph."}, {"time": 9886, "text": "I'm like, OK."}, {"time": 9888, "text": "So I slipped out."}, {"time": 9889, "text": "I was like, let's take the polygraph."}, {"time": 9891, "text": "They asked three questions."}, {"time": 9892, "text": "The questions were, have you talked to anybody?"}, {"time": 9896, "text": "Have you been on a computer outside of the offices?"}, {"time": 9898, "text": "Have you talked to the press, which I was interviewing with a New York Times writer the entire time?"}, {"time": 9903, "text": "And then have you contacted or warned anybody about investigations?"}, {"time": 9907, "text": "And I failed polygraph completely."}, {"time": 9909, "text": "So they revoked the bond, took me back down to Charleston County, throw me into jail."}, {"time": 9915, "text": "Three days later, Secret Service shows back up and pulled me out of a cell."}, {"time": 9921, "text": "It's Jim Ramacone and Bobby Kirby."}, {"time": 9923, "text": "And I mean, honestly, they were good men."}, {"time": 9927, "text": "And they gave me chances upon chances to do the right thing."}, {"time": 9930, "text": "And I was not ready to do that."}, {"time": 9933, "text": "And Jim Ramacone and Bobby's in there."}, {"time": 9936, "text": "And Bobby, I mean, Bobby was a friend."}, {"time": 9939, "text": "I mean, he truly was."}, {"time": 9940, "text": "Later on, a couple of years ago, I had a chance to have lunch with a man."}, {"time": 9951, "text": "And I told him I was sorry for everything I did to him because I got him and another agent fired."}, {"time": 9958, "text": "And I told him I was sorry for what happened."}, {"time": 9961, "text": "And he told me then, he's like, we were your friends, man."}, {"time": 9965, "text": "We were truly your friends."}, {"time": 9967, "text": "So they were good men."}, {"time": 9968, "text": "They wanted to help."}, {"time": 9970, "text": "They wanted you to be a good man."}, {"time": 9973, "text": "What got me so damn bad is I told him, I was like, man, I'm trying to be a better guy."}, {"time": 9979, "text": "And he's like, Brett, you always were a good guy."}, {"time": 9982, "text": "You just didn't know it."}, {"time": 9984, "text": "Fuck."}, {"time": 9985, "text": "People like that, we need people like that in this world."}, {"time": 9990, "text": "You need somebody to basically believe that you can be a good man."}, {"time": 9995, "text": "So Jim Ramacone pulls me out."}, {"time": 9997, "text": "He's the second in charge in South Carolina."}, {"time": 9999, "text": "He's got the Miranda waiver in front of him, right?"}, {"time": 10003, "text": "And he looks at me."}, {"time": 10003, "text": "He's like, I'm playing hard ass."}, {"time": 10005, "text": "Bobby's over here looking distraught and like a hurt dog."}, {"time": 10009, "text": "And Jim's like, here's the way this is going to work."}, {"time": 10012, "text": "He said, you're going to tell me everything you've done the past six years, or I'm going to make it my mission in life to fuck over you and your family."}, {"time": 10021, "text": "And he said, not just this case."}, {"time": 10023, "text": "Once you get out of prison, I'll hound you the rest of your life."}, {"time": 10027, "text": "Then he slides the Miranda waiver over, and he's like, now you want to talk?"}, {"time": 10031, "text": "And I looked at him, and I was like, nope."}, {"time": 10035, "text": "He was like, he gets up, gets all red in the face, storms out on the way out."}, {"time": 10040, "text": "He's like, fuck you very much."}, {"time": 10043, "text": "So I go back to the cell."}, {"time": 10044, "text": "A week later, I was only under state charges."}, {"time": 10048, "text": "A week later, judge rules they revoke the bond improperly."}, {"time": 10056, "text": "Reinstates the bond."}, {"time": 10057, "text": "Nobody calls the Secret Service to tell them I walk out."}, {"time": 10062, "text": "I walk out."}, {"time": 10063, "text": "I was dating this stripper, and I told my mom."}, {"time": 10066, "text": "I was like, well, if they're going to fuck me, they're going to have to find me."}, {"time": 10072, "text": "She just went on the move."}, {"time": 10073, "text": "Yeah, I called this stripper girl up."}, {"time": 10075, "text": "I'd given her like 60K, some bullshit like that."}, {"time": 10078, "text": "And I told her, I was like, Kim, I need some money."}, {"time": 10081, "text": "And she was like, what?"}, {"time": 10083, "text": "I was like, look, I said, give me $1,000."}, {"time": 10086, "text": "I'll give you back $3,000 in two weeks."}, {"time": 10088, "text": "She was like, OK."}, {"time": 10089, "text": "So I met her in Augusta, Georgia, and got the $1,000 from her and started driving west on I20."}, {"time": 10096, "text": "No idea where to go to, anything else."}, {"time": 10098, "text": "Got to Dallas."}, {"time": 10100, "text": "There was a prepaid debit card supplier in Dallas."}, {"time": 10103, "text": "Went in, walked in the office, convinced the guy, social engineering, convinced the guy to give me 60 prepaid debit cards without a driver's license, without payment, anything else he did."}, {"time": 10113, "text": "And that started the run."}, {"time": 10115, "text": "I ended up stealing."}, {"time": 10116, "text": "From that, I stole like 160K profit, used that to buy a Jeep Cherokee."}, {"time": 10121, "text": "And the idea was to steal enough money to bug out to Florianopolis, Brazil, and set up shop down there, and do it again."}, {"time": 10131, "text": "That was the dream."}, {"time": 10133, "text": "So I was on the run for four months, stole $600,000."}, {"time": 10138, "text": "I was in Las Vegas, Nevada."}, {"time": 10140, "text": "One day, I had stolen the night before."}, {"time": 10142, "text": "I had stolen 160K out of ATMs."}, {"time": 10145, "text": "Went in the next morning."}, {"time": 10146, "text": "I woke up, signed on to cartersmarket.com, which was ran by Max Butler, the ice man."}, {"time": 10152, "text": "And there's my name, US Most Wanted on it."}, {"time": 10156, "text": "And that gets your attention."}, {"time": 10158, "text": "That was my real name with the US Most Wanted beside of it."}, {"time": 10161, "text": "Nobody knew my real name in that environment at all."}, {"time": 10164, "text": "But then they did."}, {"time": 10165, "text": "And it was talking about me being part of the Secret Service, Operation Anglerfish, everything else."}, {"time": 10171, "text": "So of course, they're all like, everybody's after you."}, {"time": 10173, "text": "They're like, oh, yeah, we're going to get this son of a bitch."}, {"time": 10176, "text": "So I sat there looking at it."}, {"time": 10178, "text": "And I was like, said it out loud."}, {"time": 10179, "text": "I was like, well, Mr. Johnson, you've made the United States Most Wanted list."}, {"time": 10182, "text": "What do you do now?"}, {"time": 10184, "text": "And I was like, I'm going to Disney World."}, {"time": 10189, "text": "Said that out loud."}, {"time": 10191, "text": "So loaded up the Jeep, drove from Las Vegas to Orlando, Florida, and got the two annual passes, one to Disney World, the other one to Universal Studios."}, {"time": 10202, "text": "Paid for a timeshare."}, {"time": 10205, "text": "They were building these new timeshares right off Universal Drive, building these brand new timeshares, paid for a timeshare in nine months, cash."}, {"time": 10213, "text": "I was like, we take cash?"}, {"time": 10215, "text": "Yeah, we take cash."}, {"time": 10215, "text": "There's $12,900."}, {"time": 10218, "text": "Then it wasn't furnished."}, {"time": 10219, "text": "So I went down to a furniture store, bought $30,000 in furniture."}, {"time": 10222, "text": "They had seized a DVD collection of mine worth $30,000, bought that back, and proceeded to go to Disney World every day."}, {"time": 10232, "text": "And that lasted about six weeks."}, {"time": 10235, "text": "They used a trigger fish, is what they use."}, {"time": 10237, "text": "Nowadays, it's called a stingray to find me."}, {"time": 10242, "text": "So one day, it was like 1030 in the morning on Saturday."}, {"time": 10245, "text": "September 16 was the day, 2006."}, {"time": 10248, "text": "Yeah, 2006, September 16."}, {"time": 10250, "text": "I was used to the builders coming around knocking, making sure everything was all right."}, {"time": 10255, "text": "So I was asleep, heard this knock at the door, and get up, look through the keyhole, nobody's there."}, {"time": 10262, "text": "You know, people, nobody's there."}, {"time": 10263, "text": "I was like, huh."}, {"time": 10264, "text": "Open the door, step out into the hallway."}, {"time": 10266, "text": "Walking down the hall is Bobby Kirby, another South Carolina guy and a Orlando Orange County cop."}, {"time": 10274, "text": "And they turn around, and they're like, hey, Brett."}, {"time": 10277, "text": "And I'm like, hey, Bobby, how are you?"}, {"time": 10279, "text": "And it's like, we're good, how are you?"}, {"time": 10280, "text": "And I'm like, I'm fine, would you like to come in?"}, {"time": 10283, "text": "He was like, let's put you in cuffs first."}, {"time": 10285, "text": "And I was like, that's probably a good idea."}, {"time": 10288, "text": "He was like, he walks in, he's like, have you got anything in here?"}, {"time": 10294, "text": "And I was like, yeah, there's $120,000 in the bedroom."}, {"time": 10297, "text": "And he was like, seriously?"}, {"time": 10299, "text": "I was like, yeah, that and an AK 47."}, {"time": 10302, "text": "His face goes white, and he's like, you've got a rifle?"}, {"time": 10304, "text": "And I was like, no, I'm kidding with you."}, {"time": 10308, "text": "He was like, OK."}, {"time": 10310, "text": "So they throw me in jail in Orange County, and they give me diesel therapy."}, {"time": 10317, "text": "And diesel therapy is, it took like two weeks to transport me from Orange County, Orlando, to Columbia, South Carolina."}, {"time": 10326, "text": "And what happens is, is you stop at every county jail you possibly can, go through the processing, which is about six hours."}, {"time": 10333, "text": "Once you get to your bunk, hey, time to transport you."}, {"time": 10338, "text": "They do that on purpose?"}, {"time": 10339, "text": "On purpose, on purpose."}, {"time": 10341, "text": "Wears you down mentally and physically and everything."}, {"time": 10344, "text": "I get to Columbia, South Carolina."}, {"time": 10346, "text": "Now, while I was at Orange County, what happens is, this inmate, because we were in federal holding, this inmate, he looks at me."}, {"time": 10353, "text": "His name was Yeti."}, {"time": 10355, "text": "And he's like, hey, man, you know, the only time you get off in federal prison is the drug program."}, {"time": 10360, "text": "I was like, well, man, I don't use drugs."}, {"time": 10362, "text": "And he's like, you can find a drug problem, can't you?"}, {"time": 10365, "text": "And I was like, I can find a drug problem."}, {"time": 10368, "text": "So what happens is, is every county jail I stop at on the way to Columbia, I tell them I'm alcoholic and cocaine."}, {"time": 10376, "text": "So by the time I get to Columbia, South Carolina, they've got this paper trail of Mr. Johnson requesting help for drugs."}, {"time": 10384, "text": "I had hired Strom Thurmond's son as an attorney."}, {"time": 10389, "text": "They make me drop him because I paid for him with illegal funds."}, {"time": 10393, "text": "So they give me a public defender."}, {"time": 10395, "text": "He gets a psychological evaluation order for me."}, {"time": 10399, "text": "So psychologist comes in county jail, four hour interview."}, {"time": 10402, "text": "About halfway through, he looks at me, he's like, you using these type of drugs?"}, {"time": 10406, "text": "What do you use?"}, {"time": 10408, "text": "Smoke or snort?"}, {"time": 10409, "text": "Snort."}, {"time": 10410, "text": "An eight ball a day."}, {"time": 10414, "text": "Do you have any trouble out of that?"}, {"time": 10417, "text": "I can't get an erection."}, {"time": 10421, "text": "And I'm looking at him like, because I had gotten that shit from Boogie Nights."}, {"time": 10429, "text": "Finally, I'm like, is that right?"}, {"time": 10431, "text": "And he was like, it could happen."}, {"time": 10434, "text": "I was like, OK. That makes it into my pre sentence report."}, {"time": 10440, "text": "So all federal inmates, probation office and prosecutor, they do this detailed background check to basically tell the judge how much time to give you."}, {"time": 10449, "text": "So that drug bit with that interview makes it into the PSR."}, {"time": 10454, "text": "So day of interview, I mean, day of sentencing."}, {"time": 10457, "text": "I had pled guilty, day of sentencing."}, {"time": 10461, "text": "The prosecutor, he stands up, and this dude is screaming at this point."}, {"time": 10466, "text": "And he's like, Mr. Johnson's manipulated the Secret Service."}, {"time": 10470, "text": "He's manipulated the prosecutor."}, {"time": 10471, "text": "Then he points at the judge."}, {"time": 10473, "text": "And he's manipulating you today, Your Honor."}, {"time": 10475, "text": "We insist on the upper limits of the guidelines."}, {"time": 10478, "text": "Well, I've been telling everybody in the jail that if they give me any more than 60 months, I am not staying."}, {"time": 10485, "text": "So we're like, OK, sure."}, {"time": 10487, "text": "So the judge looks at me."}, {"time": 10490, "text": "She's like, I agree."}, {"time": 10491, "text": "I'm like, she says, 75 months."}, {"time": 10495, "text": "So I looked at my lawyer, and I was like, can you get the drug program for me?"}, {"time": 10499, "text": "He's like, I don't know why I ask."}, {"time": 10500, "text": "So he stands up."}, {"time": 10502, "text": "Your Honor, will you order the drug program for Mr. Johnson?"}, {"time": 10505, "text": "The judge says, no, but I'll recommend he gets evaluated."}, {"time": 10509, "text": "So the Secret Service had told her, hey, he's full of shit."}, {"time": 10512, "text": "So she's like, no, but I'll recommend he gets evaluated."}, {"time": 10515, "text": "I looked at my lawyer, and I was like, what does that mean?"}, {"time": 10516, "text": "He was like, you're probably not going to get it."}, {"time": 10519, "text": "I'm like, how soon can you get me to the camp?"}, {"time": 10522, "text": "And he was like, well, if you don't appeal, I can get you there pretty quick."}, {"time": 10526, "text": "My exact words were, fuck the appeal."}, {"time": 10529, "text": "Get me to the camp."}, {"time": 10530, "text": "I'll take it from there."}, {"time": 10531, "text": "He looks at me like I'm the biggest idiot in the world."}, {"time": 10535, "text": "I get sent to, because you can get a camp recommended."}, {"time": 10538, "text": "I have friends, family members look for camps that don't have a fence around them."}, {"time": 10543, "text": "And we settle on Ashland, Kentucky."}, {"time": 10547, "text": "Six weeks later, I'm in Ashland, Kentucky, and pull up there, 14 foot fence, a razor wire on top."}, {"time": 10553, "text": "And I'm like, I don't climb fences, so I go in."}, {"time": 10558, "text": "First question I ask is, are there any jobs outside of the fence?"}, {"time": 10562, "text": "And he was like, guards like, well, you can work in the national forest."}, {"time": 10565, "text": "And I'm like, no, I'll die out there."}, {"time": 10567, "text": "He was like, well, you could do landscaping."}, {"time": 10569, "text": "I'm like, I can run a weed eater."}, {"time": 10573, "text": "Two days later, I walk into the landscaping office, and the cop, this is this genius of some of these people and institutions."}, {"time": 10581, "text": "The cop, behind his desk, the entire wall is a blown up photo of the compound and the outlying area."}, {"time": 10589, "text": "So I can literally sit there and plot where I'm going."}, {"time": 10595, "text": "My dad, I hadn't spoken to that man in years."}, {"time": 10600, "text": "And he shows up at my sentencing and stands up in front of the judge."}, {"time": 10605, "text": "And he's like, Your Honor, I want to make sure Brett gets a good start."}, {"time": 10609, "text": "He can live with me when he gets out, everything else."}, {"time": 10612, "text": "Looking back, the man meant that."}, {"time": 10614, "text": "And I just thought it was bullshit at the time."}, {"time": 10618, "text": "So he starts to visit me in prison."}, {"time": 10620, "text": "I mean, yeah, in prison, he starts to visit."}, {"time": 10622, "text": "And about the third visit in, he looks at me."}, {"time": 10625, "text": "He's like, I've been reading about you online."}, {"time": 10629, "text": "He's like, that's a lot of money you made."}, {"time": 10632, "text": "He's like, you think you can teach somebody how to do that?"}, {"time": 10636, "text": "And I'm like, so what I used to say, and again, it's this thing of really coming to terms with things."}, {"time": 10646, "text": "What I used to say was I thought my dad was back in my life and that he was just trying to use me."}, {"time": 10655, "text": "The truth of the matter was is that my dad hadn't really seen me except in that frame of crime, being that criminal with my mom, everything else."}, {"time": 10666, "text": "I really think that's how the man was trying to communicate with me."}, {"time": 10670, "text": "He wanted to connect with you in the places where you know, where you love, where you're interested in, where your addiction is, essentially."}, {"time": 10676, "text": "And what I did is I manipulated the man into helping me escape."}, {"time": 10681, "text": "So I agreed to teach him how to do tax fraud."}, {"time": 10684, "text": "And in return, the only money he had to his name, he had $4,000 cash."}, {"time": 10689, "text": "So I manipulated him into giving me that and to dropping me off a change of clothes, a cell phone, and a driver's license."}, {"time": 10694, "text": "The only driver's license he had was my driver's license, Brett Johnson."}, {"time": 10698, "text": "So I was at the camp for, I don't know, six, eight weeks."}, {"time": 10702, "text": "And the hardest worker that landscaping had ever seen."}, {"time": 10706, "text": "At one point, the cops got me on a mountainside with a broom, sweeping off the mountain."}, {"time": 10711, "text": "I'm like, yeah, we'll do that, absolutely."}, {"time": 10714, "text": "So you're building trust with the guys there."}, {"time": 10716, "text": "Yeah, working my ass off."}, {"time": 10717, "text": "And in six weeks, I take off."}, {"time": 10719, "text": "And I lasted, I think, two, three weeks, something like that."}, {"time": 10723, "text": "US Marshals, I made it 100."}, {"time": 10725, "text": "They called you escaped."}, {"time": 10725, "text": "Yeah, escaped."}, {"time": 10726, "text": "Escaped."}, {"time": 10727, "text": "US Marshals, they're canvassing a three state area."}, {"time": 10730, "text": "They found me, I think, 250 miles away."}, {"time": 10732, "text": "It's like Lexington, Kentucky."}, {"time": 10733, "text": "They found me in Lexington because I had to use my real driver's license."}, {"time": 10737, "text": "I had a laptop."}, {"time": 10739, "text": "I had prepaid debit cards."}, {"time": 10740, "text": "And I had stolen identity information."}, {"time": 10743, "text": "And the way it got me was I had dyed my hair this flaming red."}, {"time": 10749, "text": "I had this deep tan."}, {"time": 10750, "text": "I didn't look anything like myself."}, {"time": 10751, "text": "And I was at a hotel, had the curtains open, saw this guy."}, {"time": 10758, "text": "I was on the laptop, saw this guy walk by."}, {"time": 10761, "text": "He walks by the window, and he stops."}, {"time": 10764, "text": "And then he backs up."}, {"time": 10766, "text": "He looks inside."}, {"time": 10768, "text": "He knocks on the window."}, {"time": 10770, "text": "I look up at him."}, {"time": 10771, "text": "He's like, you."}, {"time": 10772, "text": "I was like, me?"}, {"time": 10774, "text": "Then he pulls out this badge, and he points at it."}, {"time": 10777, "text": "He's like, and then he points at the door."}, {"time": 10779, "text": "Now!"}, {"time": 10781, "text": "So I was like, oh, OK."}, {"time": 10782, "text": "So I open up the door."}, {"time": 10784, "text": "He's like, US Marshals Service."}, {"time": 10787, "text": "So they arrest me."}, {"time": 10789, "text": "How did they track you down?"}, {"time": 10790, "text": "They canvassed that area."}, {"time": 10791, "text": "They talked to every hotel, everything else."}, {"time": 10794, "text": "So it's like a traditional, like, they were just tracking?"}, {"time": 10797, "text": "Traditional police work is what it was."}, {"time": 10798, "text": "So it wasn't like, from the internet, they kind of got something?"}, {"time": 10801, "text": "I don't know, just straight police work."}, {"time": 10803, "text": "US Marshals are outstanding in everything they do."}, {"time": 10806, "text": "I go to a, I'm initially held at a county jail in Moorhead, Kentucky."}, {"time": 10811, "text": "And that, man, that was one hell of an experience there."}, {"time": 10814, "text": "But then I'm transferred after sentencing on that."}, {"time": 10817, "text": "So sentencing, here's the weird thing."}, {"time": 10820, "text": "So I spend like, I think, two or three months at the county jail in Moorhead, Kentucky."}, {"time": 10826, "text": "Get sentenced."}, {"time": 10827, "text": "At my sentencing, it happens so quickly after the initial sentencing that they use the exact same presentence report."}, {"time": 10836, "text": "The report that's got all that drug shit in there."}, {"time": 10839, "text": "So at my sentencing, prosecutor's there, Secret Service is there, judge, me, and my attorney."}, {"time": 10847, "text": "Prosecutor stands up."}, {"time": 10848, "text": "He's like, Your Honor, we would like it if you would consider that when Mr. Johnson was arrested, he had a laptop, he had all this information with him, looks like he was engaged in identity theft yet again."}, {"time": 10860, "text": "Judge looks at the prosecutor, says no."}, {"time": 10863, "text": "Says, hey, if you were going to charge him with it, you should have charged him with it."}, {"time": 10866, "text": "I'm only considering the escape."}, {"time": 10868, "text": "Then he looks at me."}, {"time": 10869, "text": "He's like, Mr. Johnson."}, {"time": 10871, "text": "He said, it looks like by you keeping your mouth shut right now, you're really saving yourself a pretty serious charge."}, {"time": 10877, "text": "And my response was, yes, Your Honor."}, {"time": 10880, "text": "And he was like, then he opens up the presentence report, he's fingering through, and he's like, it also looks like before you got involved with all these drugs, you were a pretty good citizen."}, {"time": 10890, "text": "I was like, yes, Your Honor."}, {"time": 10893, "text": "And he's like, so here's what I'm going to do."}, {"time": 10894, "text": "He said, I'm going to give you 18 months on the escape."}, {"time": 10899, "text": "He said, I'm also going to give you, no, it's 15 months on the escape."}, {"time": 10902, "text": "He said, I'm going to give you 15 months on the escape."}, {"time": 10904, "text": "He said, and I'm also going to order the drug program for you."}, {"time": 10911, "text": "So the drug program gives you a year off, and it gives you six months and halfway house."}, {"time": 10919, "text": "So by escaping, I got out of prison three months earlier than what I should have gotten out of it."}, {"time": 10925, "text": "So the original thing about drugs worked in the long term."}, {"time": 10931, "text": "The interesting thing with that, and this was the best lie I ever told, honestly, the best lie I ever told."}, {"time": 10937, "text": "I spent eight months in solitary confinement, eight months."}, {"time": 10941, "text": "And that's an experience."}, {"time": 10944, "text": "Because you ain't got no books for the first month or so, then they give you a King James Bible."}, {"time": 10951, "text": "And then for a month, no books."}, {"time": 10954, "text": "No books for a month."}, {"time": 10956, "text": "This is a pretty small and."}, {"time": 10958, "text": "Six by nine room."}, {"time": 10959, "text": "Six by nine."}, {"time": 10961, "text": "No books."}, {"time": 10961, "text": "No books, no paper, no pen, no pencil."}, {"time": 10964, "text": "You're alone with your mind."}, {"time": 10965, "text": "You got a mat, a toilet."}, {"time": 10970, "text": "You sleep as much as you can."}, {"time": 10972, "text": "You're sleeping 16, 18 hours a day is what you're doing."}, {"time": 10975, "text": "What about, were you thinking about even just going back like Elizabeth?"}, {"time": 10981, "text": "You think about."}, {"time": 10982, "text": "You go through all that."}, {"time": 10984, "text": "Through all that."}, {"time": 10984, "text": "Every bit."}, {"time": 10985, "text": "Your mom, too."}, {"time": 10987, "text": "Going through every single bit of that."}, {"time": 10988, "text": "And so you're supposed to get out an hour a day."}, {"time": 10992, "text": "Law says you're supposed to get out an hour a day."}, {"time": 10995, "text": "That's the law."}, {"time": 10996, "text": "That's not the way things actually happen."}, {"time": 10998, "text": "What actually happens is you're lucky to get out an hour a week."}, {"time": 11001, "text": "You take a shower twice a week, and that's it."}, {"time": 11005, "text": "You get a phone call once a month."}, {"time": 11006, "text": "Oh, so you don't get to see nature."}, {"time": 11008, "text": "Don't see anything."}, {"time": 11009, "text": "You're getting solitary."}, {"time": 11011, "text": "And it takes about a week."}, {"time": 11014, "text": "The first week is the roughest."}, {"time": 11016, "text": "You're bouncing off the walls that first week because you can't sleep, can't do anything else."}, {"time": 11020, "text": "Then you start to adapt to it after a while."}, {"time": 11023, "text": "When that book does arrive, you're happy as hell to have it."}, {"time": 11026, "text": "I'm well versed in King James Bible."}, {"time": 11029, "text": "So you're happy to have it."}, {"time": 11031, "text": "Then finally, you get other books that come in from that point."}, {"time": 11036, "text": "Spent eight months at that."}, {"time": 11037, "text": "And they send me out to a real prison, Big Spring, Texas, West Texas, where have you been out there?"}, {"time": 11048, "text": "But I could tell."}, {"time": 11050, "text": "Prairie dogs and tarantulas is what it is."}, {"time": 11053, "text": "No kidding, it gets so hot that warnings come on the radio telling you not to drive on certain streets because they're melted."}, {"time": 11061, "text": "That's Big Spring."}, {"time": 11063, "text": "So if you've seen the movie From Dusk Till Dawn, the opening scene is in Big Spring, Texas."}, {"time": 11070, "text": "So it's hot."}, {"time": 11071, "text": "Yeah, very hot."}, {"time": 11073, "text": "And that's where I find out what a real prison is."}, {"time": 11075, "text": "And it's not ran by guards."}, {"time": 11078, "text": "Prisons are ran by inmates."}, {"time": 11080, "text": "And that's a fact."}, {"time": 11081, "text": "So you're met at the door by whatever race you are is what happens."}, {"time": 11088, "text": "So Big Spring is a converted Air Force compound."}, {"time": 11090, "text": "It's a disciplinary prison."}, {"time": 11092, "text": "So you get the bad guys are in there."}, {"time": 11094, "text": "So I go through processing, and I'm walking up to the unit, and I'm met at the door by a guy named Nick Sandifer."}, {"time": 11103, "text": "He's the treasurer of the Aryan Brotherhood."}, {"time": 11106, "text": "And first question out of his mouth is, any more white guys come in?"}, {"time": 11110, "text": "And shit, I didn't know."}, {"time": 11111, "text": "I was like, hell, I don't know, four or five?"}, {"time": 11113, "text": "Next question is, what are you in here for?"}, {"time": 11117, "text": "My answer was, because I'm like, I got no worries."}, {"time": 11119, "text": "My answer was, computer crime."}, {"time": 11120, "text": "Smiled at him."}, {"time": 11122, "text": "Turns out, wrong thing to say, because computer crime is not credit card theft or hacking or any bullshit like that."}, {"time": 11130, "text": "Computer crime in prison is child pornography."}, {"time": 11134, "text": "So tell him that."}, {"time": 11135, "text": "He looks at me like I'm a piece of shit, goes and gets his buddies."}, {"time": 11138, "text": "They circle around."}, {"time": 11140, "text": "What are you in here for?"}, {"time": 11141, "text": "I like how the Aryan Brotherhood has lines."}, {"time": 11145, "text": "They're like, oh, yeah, this is child porn."}, {"time": 11148, "text": "That's the bad guy."}, {"time": 11150, "text": "They're like, what did you say you're in here for?"}, {"time": 11153, "text": "So I'm sitting there trying to explain it to them."}, {"time": 11155, "text": "They're like, you tell a good story."}, {"time": 11157, "text": "You still said this."}, {"time": 11159, "text": "Computer crime basically really does mean usually child pornography."}, {"time": 11164, "text": "In prison, yeah."}, {"time": 11166, "text": "And what you see, and that's one of things you find out, the guys that are going in there for child porn, they will tell them it's credit card theft."}, {"time": 11175, "text": "They've learned."}, {"time": 11176, "text": "So I'm that guy."}, {"time": 11177, "text": "But you also don't, I mean, for people who are just listening to this, you don't exactly look like the typical computer hacker."}, {"time": 11187, "text": "But I don't look like the pedophile either."}, {"time": 11191, "text": "But it's like it doesn't make it seem like you're, I mean, I guess you're not wearing a hoodie, and you're not like emo, dark."}, {"time": 11201, "text": "The way it actually works in prison, they won't attack you until they know."}, {"time": 11207, "text": "So they have to see paperwork, which now in federal prison, you don't get transported with paperwork because of that."}, {"time": 11214, "text": "So they have to see paperwork, or a guard will tell them what you're in there for."}, {"time": 11220, "text": "Guards will tell who the pedophiles are."}, {"time": 11222, "text": "So none of the guards told them that it was anything."}, {"time": 11226, "text": "So for the first month, they think I am, but they're not doing anything because they don't know for sure."}, {"time": 11230, "text": "At the end of the first month, I'd been talking to Kevin Polson over at Wired Magazine about Max Butler."}, {"time": 11237, "text": "He does an article about that."}, {"time": 11239, "text": "It shows up in Wired Magazine."}, {"time": 11240, "text": "So at the end of the first month, Wired Magazine hits a compound, front cover, all the story."}, {"time": 11245, "text": "You would think it saved me."}, {"time": 11247, "text": "So I'm reading the article, really happy about it."}, {"time": 11249, "text": "So what happens is four o clock is mail call."}, {"time": 11251, "text": "Four o clock's a stand up count nationwide."}, {"time": 11254, "text": "After four o clock is your mail call."}, {"time": 11255, "text": "They hand out all the mail for the day."}, {"time": 11257, "text": "So the mail comes, I get the magazine."}, {"time": 11258, "text": "I'm reading through it."}, {"time": 11259, "text": "I'm like, well, shit, I'm good to go."}, {"time": 11261, "text": "Then it says, Brett Johnson, Secret Service informant in the article."}, {"time": 11267, "text": "So you're now a snitch."}, {"time": 11269, "text": "Which is right up there with the pedophiles."}, {"time": 11271, "text": "So we go to dinner after that."}, {"time": 11275, "text": "At dinner, you can hear it."}, {"time": 11277, "text": "You can hear the chat."}, {"time": 11277, "text": "We got a snitch."}, {"time": 11278, "text": "I think it's that guy over there."}, {"time": 11281, "text": "Warden, next day, shuts down the entire compound, calls me into his office."}, {"time": 11286, "text": "They got security there."}, {"time": 11287, "text": "They got the counselors there and everything else."}, {"time": 11288, "text": "Warden looks at me."}, {"time": 11289, "text": "He's like, did you give an interview to Wired Magazine?"}, {"time": 11293, "text": "He's like, do you not know they will kill you in here?"}, {"time": 11297, "text": "I was like, he was like, do you feel safe?"}, {"time": 11301, "text": "Well, I know if you tell me you don't feel safe, they transport you."}, {"time": 11305, "text": "Transport you means another eight months in solitary confinement."}, {"time": 11308, "text": "You start to see shit in solitary after a while."}, {"time": 11311, "text": "So I'm like, no, not gonna do that."}, {"time": 11313, "text": "So I'm like, completely safe."}, {"time": 11314, "text": "He was like, look, he's like, if anybody says anything to you, immediately come to us because they'll fucking kill you."}, {"time": 11324, "text": "So they do a locker search, try to confiscate the magazines."}, {"time": 11327, "text": "They can't."}, {"time": 11328, "text": "The next day, I walk into the unit."}, {"time": 11330, "text": "There's Nick Sandefur laying on his bunk, magazine wide open reading it."}, {"time": 11333, "text": "I'm like, oh shit."}, {"time": 11335, "text": "Walked up to him."}, {"time": 11336, "text": "I was like, hey, Nick, what are you doing?"}, {"time": 11338, "text": "He's like, oh, doing some reading."}, {"time": 11340, "text": "I was like, anything interesting?"}, {"time": 11341, "text": "He's like, it's getting there."}, {"time": 11343, "text": "I was like, let me save you the trouble."}, {"time": 11347, "text": "Take the magazine, turn it over to the page."}, {"time": 11348, "text": "I was like, right there is what you're looking for."}, {"time": 11350, "text": "He was like, man, I already knew."}, {"time": 11352, "text": "I was like, do we have a problem?"}, {"time": 11356, "text": "He's like, is anyone on the compound you told on?"}, {"time": 11360, "text": "I was like, no."}, {"time": 11361, "text": "He's like, until someone gets here, you snitched on."}, {"time": 11368, "text": "He's like, but I need you to do something for me."}, {"time": 11372, "text": "All right, so in federal prison, you gotta have a job."}, {"time": 11375, "text": "Everybody works."}, {"time": 11376, "text": "It doesn't matter what you do, but you gotta work."}, {"time": 11377, "text": "I got a job in education teaching a lit class."}, {"time": 11382, "text": "Every Wednesday, six to 8.30 PM, lit."}, {"time": 11385, "text": "And had all, every area on the compound signs up for the lit class."}, {"time": 11390, "text": "Had a couple of guards every now and then popped in."}, {"time": 11392, "text": "And did we teach lit?"}, {"time": 11394, "text": "No, we taught fraud."}, {"time": 11396, "text": "Every Wednesday, six to 8.30 PM."}, {"time": 11399, "text": "That's how I didn't get my ass beaten."}, {"time": 11402, "text": "And my other job, I had two jobs with them."}, {"time": 11404, "text": "The other job, you get to the point, it's weird, man."}, {"time": 11407, "text": "You get to the point, people walking off the bus, you know immediately two groups of people."}, {"time": 11414, "text": "You know who the bank robbers are immediately."}, {"time": 11416, "text": "Just by them walking off the bus, you're like, that motherfucker's a bank robber."}, {"time": 11420, "text": "And you know who the pedophiles are immediately."}, {"time": 11423, "text": "So my job as the white guy was to approach the white pedophiles and have a conversation."}, {"time": 11429, "text": "And the conversation was basically, hey, don't know what you're in here for."}, {"time": 11434, "text": "Don't care what you're in here for."}, {"time": 11437, "text": "But if you got some sort of fucked up charge, you need to tell me."}, {"time": 11443, "text": "If you tell me, everything's gonna be all right."}, {"time": 11446, "text": "If you don't tell me, you see those guys over there?"}, {"time": 11449, "text": "If you start to associate with them or they start to talk to you, and then they find out you're in here on something, they're gonna kill you."}, {"time": 11457, "text": "And what are the things, pedophile?"}, {"time": 11459, "text": "Pedophile, rapist, anything that harms children, harms women, anything like that."}, {"time": 11464, "text": "And there are, it's like the mob, there's rules, there's an ethical code."}, {"time": 11470, "text": "Even if you have the division between races on all that, you still have these lines drawn."}, {"time": 11477, "text": "And there's a hierarchy too."}, {"time": 11479, "text": "Very, very much so."}, {"time": 11480, "text": "And what that looks like in prison, depending on the, it depends on the security class that you're in, what level prison."}, {"time": 11487, "text": "But at that prison, what that looked like was you're not allowed to talk to anybody."}, {"time": 11493, "text": "You're not allowed to watch television."}, {"time": 11495, "text": "You can go to the library."}, {"time": 11497, "text": "You don't associate with anyone except your own type."}, {"time": 11500, "text": "If you do anything like this, we will kill you."}, {"time": 11504, "text": "If someone wants to extort you, we will do that too and you won't tell on us or we'll kill you."}, {"time": 11512, "text": "So that's the way that works at that point."}, {"time": 11515, "text": "And everybody quickly large this."}, {"time": 11518, "text": "Quickly, quickly."}, {"time": 11519, "text": "And so typically the guys would say, I just wanna do my own time."}, {"time": 11523, "text": "That would be the line."}, {"time": 11525, "text": "And it's like, okay, don't mess with him, all right?"}, {"time": 11529, "text": "Every now and then you'd have somebody lie and that would come with those types of consequences."}, {"time": 11534, "text": "I got to see, while I was there, saw two people murdered, saw, went through three prison riots and through my entire tenure in prison, saw four suicides."}, {"time": 11546, "text": "The people who got killed, it was, so we had, outside you had this track, a third of a mile track."}, {"time": 11553, "text": "You walk it counterclockwise."}, {"time": 11555, "text": "And inside of the track, you got two handball courts."}, {"time": 11558, "text": "So of an evening that happened both times, all of us would be walking, doing our exercises."}, {"time": 11564, "text": "And at the top of the key, like a flock of birds, you'd see all the inmates start to migrate down toward the gate."}, {"time": 11572, "text": "So the first time you see that, you see that migration, you look up in the distance and one of the inmates got another inmate down and he's just hammering his head right into the pavement, like that right there."}, {"time": 11584, "text": "Well, guards don't stop that because a guard may get hurt."}, {"time": 11587, "text": "So a guard is 15 minutes coming out to stop that until everything's over."}, {"time": 11592, "text": "By that point, the guy doesn't have a head."}, {"time": 11595, "text": "They shut the compound down and this is what happens."}, {"time": 11597, "text": "So you shut the entire compound down."}, {"time": 11600, "text": "They make two lines of the inmates."}, {"time": 11602, "text": "And what happens is the inmate walks into a room, they shut the door behind the inmate, guard asks them two questions."}, {"time": 11608, "text": "First question is, did you see anything?"}, {"time": 11611, "text": "Second question is, if you had seen anything, would you say anything?"}, {"time": 11615, "text": "Answer is no."}, {"time": 11616, "text": "Guard then says, get the fuck out."}, {"time": 11620, "text": "Anybody that stays in any longer than that is automatically suspect."}, {"time": 11625, "text": "So there was one incident, I remember this Hispanic guy, he's in there for a few minutes."}, {"time": 11631, "text": "And everybody's like, what's going on?"}, {"time": 11635, "text": "So his people then call him over, explain to us what went on."}, {"time": 11641, "text": "And it happens like that."}, {"time": 11643, "text": "It's fascinating because you talked about the network of trust in the cyber crime community."}, {"time": 11650, "text": "And here's a network of trust in the prison crime community."}, {"time": 11656, "text": "And trust."}, {"time": 11657, "text": "Trust matters."}, {"time": 11658, "text": "Trust drives everything at the end of the day."}, {"time": 11661, "text": "The riots that I went through, the first riot, man, you're scared to death."}, {"time": 11666, "text": "Scared to death."}, {"time": 11667, "text": "You know, you've got the cops dressed up in the Ninja Turtle outfits, you've got the rubber bullets, the tear gas canisters, all that crap."}, {"time": 11675, "text": "You got the inmates that are raising hell."}, {"time": 11679, "text": "The second riot, you calm down."}, {"time": 11682, "text": "Second riot, you start to notice."}, {"time": 11684, "text": "This is racial riot."}, {"time": 11686, "text": "This is typically, and almost always, it's Hispanics and African Americans."}, {"time": 11690, "text": "So you get to detect what is the motivation for the riot, what is the reason, and that gives you some calm."}, {"time": 11697, "text": "So the second riot, you start to notice this."}, {"time": 11698, "text": "Hey, man, this ain't me."}, {"time": 11700, "text": "This ain't our group."}, {"time": 11702, "text": "Third riot, no shit."}, {"time": 11703, "text": "Third riot, you lay in your bunk."}, {"time": 11707, "text": "You let them wage war all around you, and every now and then you have an inmate that'll run up to you and he'll point to a locker and say, is that your locker?"}, {"time": 11714, "text": "And if you tell him yes, they leave it alone."}, {"time": 11716, "text": "If you say it's not my locker, they'll break into it and steal everything out of it and go from there, and that's what happens, but."}, {"time": 11723, "text": "So you did your time for five years."}, {"time": 11725, "text": "Five and a half."}, {"time": 11727, "text": "You made it out."}, {"time": 11728, "text": "Made it out."}, {"time": 11729, "text": "I went through, I told you it was a good lie that I told."}, {"time": 11732, "text": "I went through the residential drug abuse program."}, {"time": 11735, "text": "It's a nine month intensive therapy, and the way I got to that, this counselor at Big Spring, he bought this."}, {"time": 11744, "text": "He wanted inmates to be educated."}, {"time": 11746, "text": "He was a really good guy."}, {"time": 11748, "text": "So he wanted inmates to be educated."}, {"time": 11749, "text": "He got a discount on a game theory class set."}, {"time": 11755, "text": "So he gets all these discs and everything, and he's asking, does anybody on the compound know anything about game theory?"}, {"time": 11760, "text": "And somebody says, if anybody does, it'll be Brett Johnson."}, {"time": 11764, "text": "So he comes up to me one day at my buggy."}, {"time": 11767, "text": "He's like, are you Brett Johnson?"}, {"time": 11770, "text": "He was like, do you know anything about game theory?"}, {"time": 11772, "text": "And I was like, yes, I do."}, {"time": 11775, "text": "So I start rattling off Prisoner's Dilemma and everything else."}, {"time": 11778, "text": "He's like, well, you teach a class?"}, {"time": 11780, "text": "So I start teaching that."}, {"time": 11781, "text": "I start teaching inmates public speaking and to make friends with this counselor."}, {"time": 11786, "text": "So it gets time where I'm supposed to be transferring out to this drug program that they only had in Fort Worth, and the transfers are taking like four or five months."}, {"time": 11796, "text": "That's four or five months I could be out free."}, {"time": 11799, "text": "So I went up to him one day and I was like, look, his name was Keely."}, {"time": 11802, "text": "I was like, look, man, I said, is there any way that I can get transferred out any sooner?"}, {"time": 11807, "text": "And he looks at me and he's like, Brett, I cannot help you."}, {"time": 11810, "text": "And I was like, I appreciate that."}, {"time": 11812, "text": "Thank you so much for even trying."}, {"time": 11813, "text": "So he said that a week later, I'm on a bus by going to Fort Worth."}, {"time": 11819, "text": "So he got me to Fort Worth."}, {"time": 11822, "text": "So it was a nine month program, 24 hours a day of cognitive behavioral therapy."}, {"time": 11826, "text": "Had nothing to do with drugs."}, {"time": 11827, "text": "It was all peer study stuff and CBT training."}, {"time": 11832, "text": "And honestly, it's the best thing that could ever happen."}, {"time": 11835, "text": "Truly is."}, {"time": 11836, "text": "So that part, what was the thing that changed you as a man?"}, {"time": 11841, "text": "Is it the solitary confinement?"}, {"time": 11843, "text": "Was it the years?"}, {"time": 11844, "text": "Was it losing the people you loved?"}, {"time": 11848, "text": "Or was it that behavioral therapy?"}, {"time": 11850, "text": "It's a combination, man."}, {"time": 11851, "text": "It's a combination."}, {"time": 11852, "text": "It was, so my sister disowns me."}, {"time": 11856, "text": "The only person I had in my life."}, {"time": 11858, "text": "I mean, me and my sister, that's it."}, {"time": 11861, "text": "I mean, yeah, I loved Elizabeth."}, {"time": 11862, "text": "I love my wife now, but it's... Me and my sister, we went through all that shit together."}, {"time": 11869, "text": "So Denise disowns me."}, {"time": 11870, "text": "She doesn't talk to me for an entire year when all this stuff happens."}, {"time": 11874, "text": "And after I get arrested on the escape, she ends up driving seven hours to come see me to tell me she loves me."}, {"time": 11882, "text": "And I don't see her again for five and a half years."}, {"time": 11885, "text": "So that's really the first turnaround."}, {"time": 11887, "text": "Took me two and a half years in prison to accept responsibility."}, {"time": 11892, "text": "That was amazing that she did that."}, {"time": 11895, "text": "She's down."}, {"time": 11897, "text": "She did that."}, {"time": 11898, "text": "Yeah, she's something."}, {"time": 11899, "text": "She's something."}, {"time": 11899, "text": "Yeah, she saw me for 10 minutes, tell me she loves me and then I don't see her again."}, {"time": 11903, "text": "Planted the seed."}, {"time": 11906, "text": "But yeah, you had time to think over those years."}, {"time": 11909, "text": "Took two and a half years to realize that I didn't commit crime because of stripper girlfriends or wives or family."}, {"time": 11915, "text": "I committed it because I wanted to, chose to."}, {"time": 11918, "text": "And that's the first turnaround."}, {"time": 11922, "text": "Second turnaround is the CBT training."}, {"time": 11925, "text": "It didn't really hit while I was in prison."}, {"time": 11930, "text": "I went through it and they ingrained it in you, but until you choose to make it work, it doesn't work."}, {"time": 11936, "text": "So I got out in 2011, didn't wanna break the law, did not."}, {"time": 11940, "text": "And I was under three years probation, couldn't touch a computer."}, {"time": 11944, "text": "I had a job offer from Deloitte to run a cyber crime office in the UK, which that was a no."}, {"time": 11951, "text": "Now you're not moving and that's a computer idiot."}, {"time": 11953, "text": "So then I had a job offer from Know Before, a phishing company, couldn't take that."}, {"time": 11960, "text": "I got to where I was trying to apply for fast food jobs."}, {"time": 11964, "text": "That's a computer, can't touch that."}, {"time": 11966, "text": "Okay, then what about a waiter's position?"}, {"time": 11968, "text": "Well, that's a computer and access to credit cards, idiot."}, {"time": 11971, "text": "Can't touch that either."}, {"time": 11973, "text": "So literally could not get a job, could not."}, {"time": 11978, "text": "Doing food stamps, I had a roommate that paid half the rent."}, {"time": 11982, "text": "They tell you when you leave prison to get a job in something you care about and you won't recidivate, couldn't get a job."}, {"time": 11988, "text": "And what I had was a cat, and Monster the Cat, that was the cat's name."}, {"time": 11995, "text": "And I had enough money to feed that little guy and didn't have money to buy toilet paper for the apartment."}, {"time": 12002, "text": "So I was on Panama City Beach."}, {"time": 12005, "text": "How long were you living like this?"}, {"time": 12007, "text": "It was a steady decline, because remember I taught my dad how to commit tax fraud."}, {"time": 12011, "text": "So he bankrolled a lot of that until he couldn't."}, {"time": 12014, "text": "And then from there, it's like, what the fuck do you do?"}, {"time": 12018, "text": "So I didn't want to go into computer crime at all."}, {"time": 12020, "text": "And I ended up shoplifting toilet paper, man."}, {"time": 12025, "text": "Shoplifting toilet paper."}, {"time": 12026, "text": "Just like for the basics, the basics of survival."}, {"time": 12030, "text": "So about the same time I had a friend that, this guy, I'd been dating the same type of women I had been dating, you know, the unhealthy ones, the hot unhealthy ones."}, {"time": 12041, "text": "Yes, love, that's how that works."}, {"time": 12045, "text": "So I had a friend post an ad for me on Plenty of Fish."}, {"time": 12049, "text": "And this woman responds, my wife, she responds."}, {"time": 12053, "text": "And the pictures I had taken were these prison type pictures, you know, the serious like, they were there."}, {"time": 12059, "text": "She sends me a message of, why aren't you smiling?"}, {"time": 12061, "text": "And my response was, that is my happy face."}, {"time": 12064, "text": "So we start talking and we started dating."}, {"time": 12069, "text": "And she's that second saving thing, man."}, {"time": 12073, "text": "I ended up moving in with her."}, {"time": 12074, "text": "I was going broke."}, {"time": 12075, "text": "I was about to get kicked out of the apartment and everything else."}, {"time": 12077, "text": "And she didn't say it, but I think she knew it."}, {"time": 12080, "text": "And moved in with her."}, {"time": 12086, "text": "And I got a job."}, {"time": 12087, "text": "And the job I got, my probation officer let me have a cell phone."}, {"time": 12091, "text": "I was going through Craigslist."}, {"time": 12092, "text": "This guy was advertising for landscaping."}, {"time": 12095, "text": "Called him up."}, {"time": 12095, "text": "His name was Dustin DeRamus."}, {"time": 12098, "text": "And he's like, come on down, talk to me."}, {"time": 12100, "text": "So he was running this business, him and his brother were, out of his house."}, {"time": 12103, "text": "So I'm sitting there talking to him for about 20 minutes."}, {"time": 12106, "text": "He looks at me."}, {"time": 12106, "text": "He's like, can I ask you a question?"}, {"time": 12109, "text": "He's like, are you on the run or something?"}, {"time": 12111, "text": "So I'm like, no, why?"}, {"time": 12113, "text": "And he's like, well, you just don't look like the kind of guy that do this."}, {"time": 12117, "text": "So I told him."}, {"time": 12119, "text": "I was like, this is who I am."}, {"time": 12119, "text": "This is what I've done."}, {"time": 12123, "text": "He's like, man, I got to think about that."}, {"time": 12125, "text": "So he tells me to go on home."}, {"time": 12128, "text": "That was a Friday."}, {"time": 12129, "text": "Sunday evening, he gives me a call."}, {"time": 12131, "text": "And he was like, Brett, if I hire you, will you actually work?"}, {"time": 12137, "text": "And I told him, I was like, Dustin, if you give me a job, I promise I'll work my ass off."}, {"time": 12142, "text": "And he's like, show up 6 o clock."}, {"time": 12145, "text": "So my job was to push a lawnmower 10 hours a day, five days a week for $400 a week, and busted my ass."}, {"time": 12153, "text": "I hit it so hard, I would come in of a night and pass out, wake up the next morning, and hit it again."}, {"time": 12162, "text": "And it got to the point, this dude ended up offering me to come in and partner with his business."}, {"time": 12171, "text": "His brother dropped out."}, {"time": 12172, "text": "And by that point, I'd learned everything on the business and everything."}, {"time": 12176, "text": "And he was like, if you'd like to come in, I'll cut you in half."}, {"time": 12179, "text": "And I was like, Dustin, I can't do it, man."}, {"time": 12182, "text": "Because I wasn't making any money."}, {"time": 12183, "text": "He didn't want to pay me anymore until he was able to do more."}, {"time": 12187, "text": "And I thought I found another job doing something else."}, {"time": 12192, "text": "And in a speech, I say it got cold and the grass started to stop growing."}, {"time": 12195, "text": "The truth of the matter was I thought I found another job."}, {"time": 12198, "text": "Guy was offering to pay me $1,500 a week doing the sales for oil rig training, was what it was."}, {"time": 12206, "text": "And I accepted the job."}, {"time": 12209, "text": "I quit working for Dustin."}, {"time": 12211, "text": "And the guy, I told him before he even offered me a job, I told him my criminal history because I was required to do that."}, {"time": 12221, "text": "So I was supposed to start work."}, {"time": 12222, "text": "Well, he calls me and tells me he can't hire me."}, {"time": 12224, "text": "So I'm out of work."}, {"time": 12226, "text": "And Dustin's already hired somebody else by that point, so I can't go back with him."}, {"time": 12231, "text": "And I'm that guy again, man."}, {"time": 12238, "text": "It's important for me to show value in a relationship."}, {"time": 12245, "text": "So Michelle was the only one working."}, {"time": 12250, "text": "I'm like, I got to do something."}, {"time": 12252, "text": "And I get it in my head."}, {"time": 12254, "text": "I was like, if nothing else, I can just bring food in the house."}, {"time": 12257, "text": "She was only making, I think she was, I mean, we had it hard, it was just her working."}, {"time": 12263, "text": "And I was like, if nothing else, I can bring food in the house and get on the dark web, get some stolen credit cards, start ordering food."}, {"time": 12273, "text": "Well, it gets worse than that."}, {"time": 12276, "text": "She's got two sons there."}, {"time": 12278, "text": "So I'm like, well, they need clothes."}, {"time": 12280, "text": "So they start stealing clothes."}, {"time": 12282, "text": "And it continues like that."}, {"time": 12284, "text": "I get arrested."}, {"time": 12285, "text": "I get arrested on a food order."}, {"time": 12288, "text": "And Michelle didn't know what I was doing."}, {"time": 12293, "text": "So she had been to work, and she was coming back from work."}, {"time": 12296, "text": "And I'm like, they let me make a phone call."}, {"time": 12299, "text": "And I call her, and I say, come to the police station."}, {"time": 12301, "text": "I've been arrested."}, {"time": 12302, "text": "And she shows up."}, {"time": 12304, "text": "And she didn't know I'd been doing that."}, {"time": 12306, "text": "My probation officer, of course, he didn't know anything else."}, {"time": 12311, "text": "At my sentencing for that, probation officer was there, prosecutor, the judge, US Marshals, Michelle, and me."}, {"time": 12321, "text": "Michelle stands up, and she tells the judge that I'm a better dad to her kids than their actual father is."}, {"time": 12326, "text": "And by that point, I'm crying."}, {"time": 12333, "text": "Probation officer stands up."}, {"time": 12335, "text": "And he was like, we think Mr. Johnson's a good guy."}, {"time": 12339, "text": "We think this is a one time thing."}, {"time": 12340, "text": "Prosecutor says the same thing."}, {"time": 12343, "text": "Judge sentences me to one year."}, {"time": 12346, "text": "Probation officer stands back up."}, {"time": 12349, "text": "And he was like, Mr. Johnson, Judge, if you can give Mr. Johnson a year and a day, he can get the good time and get back to his family sooner."}, {"time": 12359, "text": "So the judge amends the sentence to a year and a day."}, {"time": 12361, "text": "So I served 10 months."}, {"time": 12363, "text": "They sent me back to Texas."}, {"time": 12364, "text": "And that's when I find out that Michelle didn't need me for what I could give her."}, {"time": 12370, "text": "She just wanted me for me that entire time."}, {"time": 12372, "text": "She stands by me the entire time."}, {"time": 12374, "text": "I do my 10 months, get out."}, {"time": 12376, "text": "We get married after that."}, {"time": 12378, "text": "And they kill probation."}, {"time": 12380, "text": "So I can touch a computer."}, {"time": 12381, "text": "They tell you, they were like, you know, inmates, a felon, if nothing else, he can sell cars."}, {"time": 12388, "text": "Well, it turns out you can't."}, {"time": 12390, "text": "You can sell cars if you're a drug dealer."}, {"time": 12392, "text": "If you're the guy that steals all the money and people's information, no, fuck no."}, {"time": 12395, "text": "You can't get a job selling cars."}, {"time": 12397, "text": "So can't get a job."}, {"time": 12399, "text": "Cannot."}, {"time": 12400, "text": "And to this day, Lex, I know what my triggers are."}, {"time": 12405, "text": "I know what it would take to get me back into committing crime."}, {"time": 12408, "text": "So, and I knew I'd go so far at that point."}, {"time": 12410, "text": "So I looked at Michelle and I was like, let me see what I can do."}, {"time": 12413, "text": "Signed on to LinkedIn, reached out to this FBI super cop named Keith Malarski out of the Pittsburgh office."}, {"time": 12418, "text": "He was involved with my arrest and some associates and everything else and sent him a message."}, {"time": 12425, "text": "And the message was, you know, hey, I respect everything you did."}, {"time": 12427, "text": "Think you did a great job."}, {"time": 12429, "text": "By the way, I'd like to be legal."}, {"time": 12432, "text": "And dude responded within two hours."}, {"time": 12436, "text": "Two hours, he gives me references, advice, takes me in under his wing, everything else like that."}, {"time": 12442, "text": "And from that point, man, it was the head of the identity theft council did the same thing."}, {"time": 12448, "text": "Card not present group hires me to speak."}, {"time": 12451, "text": "Microsoft hires me to consult with them."}, {"time": 12454, "text": "And the Microsoft hire established enough trust in the industry that I was all right from that point."}, {"time": 12462, "text": "So now you're helping in many ways, fight the very guy that you used to be."}, {"time": 12468, "text": "So big picture advice."}, {"time": 12472, "text": "What, given that you were that guy, how do we fight cyber crime today and in the next five years, 10 years, 20 years, 50 years?"}, {"time": 12481, "text": "What advice do you have to individuals, to companies, to governments of what, and also to Elizabeth, like the humans, human beings that love, that live, that are friends with cyber criminals?"}, {"time": 12504, "text": "There's so many lessons to really be had from that."}, {"time": 12510, "text": "To me, the lesson, one of the big lessons to me is you can't serve two masters."}, {"time": 12518, "text": "If you're that guy that is committing crime or that person that's addicted, or you're in love with somebody that's addicted or has that, they don't love you."}, {"time": 12529, "text": "They love that addiction that comes first."}, {"time": 12531, "text": "It's always gonna come first."}, {"time": 12533, "text": "So you have to realize that."}, {"time": 12534, "text": "You have to know when to cut somebody off, when to end something, that knowing that they're not gonna change until they decide to change."}, {"time": 12547, "text": "At the same time, you gotta realize that the only reason I was able to turn my life around is because people took that chance on me."}, {"time": 12554, "text": "That's really the only reason."}, {"time": 12556, "text": "They believe that there's a good person in there."}, {"time": 12558, "text": "Yeah, if Malarski hadn't responded, if I hadn't had my sister, my wife, these companies that initially gave me that chance, my ass would be back in prison for 20 years."}, {"time": 12568, "text": "I have no doubt about that at all, all right?"}, {"time": 12574, "text": "Cybercrime, a lot of companies that I talk to, they don't really understand or appreciate that networking aspect, that trust aspect of how criminals establish trust with each other, how they work together."}, {"time": 12588, "text": "A lot of companies think that it's a single player that's out victimizing them."}, {"time": 12592, "text": "And when you really break down how cybercrime operates, that you've got a group of individuals that are working together to hit you, but not only hit you, but they share and exchange information freely."}, {"time": 12603, "text": "Companies don't do that."}, {"time": 12604, "text": "You've got privacy concerns, you've got competitive edge concerns, everything else."}, {"time": 12607, "text": "Companies don't share information across the board like criminals do."}, {"time": 12611, "text": "Criminals do that."}, {"time": 12613, "text": "You have to appreciate that."}, {"time": 12613, "text": "You have to understand that big statistic that 90% of your tax use known exploits."}, {"time": 12619, "text": "It's not the stuff we don't know about, it's the shit we do know about."}, {"time": 12622, "text": "We're not doing anything about."}, {"time": 12624, "text": "So the way to defend against cybercrime is like there's a lot of low hanging fruit that you should fix."}, {"time": 12630, "text": "A lot of that."}, {"time": 12632, "text": "Sort of a lot of basic stuff that's already vulnerabilities, update the system security."}, {"time": 12635, "text": "Now that doesn't take care of SolarWinds or CNAP or anything like that."}, {"time": 12641, "text": "But those instances, I mean, okay, that's a big instance."}, {"time": 12646, "text": "I mean, it is."}, {"time": 12647, "text": "But in the full spectrum of, especially in the future, because there's more and more companies that are coming online, they're becoming digital."}, {"time": 12658, "text": "And it's just more and more and more."}, {"time": 12661, "text": "And those vulnerabilities in terms of human nature, so for social engineering and the actual outdated systems, all of it."}, {"time": 12668, "text": "Some of it, I guess is, I mean, you're exceptionally good at this is educating on the social engineering side, is educating people in companies that like."}, {"time": 12676, "text": "You've got to do that."}, {"time": 12678, "text": "And companies have to, you know, I made that point that they never report to law enforcement."}, {"time": 12683, "text": "That's companies and individuals."}, {"time": 12685, "text": "You know, I've worked with Fortune 50 companies that will not press charges."}, {"time": 12690, "text": "Instead, they'll have that insider or that criminal sign an NDA, they'll pay them off."}, {"time": 12696, "text": "And we won't mention this shit anymore."}, {"time": 12699, "text": "You have to be, you have to press charges."}, {"time": 12701, "text": "You have to report, you have to raise the awareness of everyone in the group."}, {"time": 12705, "text": "You have to be, it's that idea."}, {"time": 12707, "text": "And I've talked about that before of understanding your place in that cyber crime spectrum."}, {"time": 12712, "text": "The way a criminal will victimize you depends on who you are and what you do as a person and as a business."}, {"time": 12719, "text": "So you have to understand that, design security around that."}, {"time": 12722, "text": "You know, we've got 7,500 security companies out there."}, {"time": 12725, "text": "A whole lot of them are snake oil salesmen."}, {"time": 12727, "text": "A lot of them is going to tell you that we're the one stop solution, but you're not, you're not."}, {"time": 12733, "text": "You're a tool, all right?"}, {"time": 12735, "text": "And you may have a very good tool, but it's not the only tool that's needed to protect against the attacks that are out there."}, {"time": 12742, "text": "And we have to be open and honest about that kind of stuff if we're not."}, {"time": 12745, "text": "So I guess defending defense is not just like one tool."}, {"time": 12749, "text": "It's a process of just like a diversity and just constantly educating people."}, {"time": 12756, "text": "So it's the social side, it's constantly, because there's so many probably attack vectors in terms of the software that you have."}, {"time": 12763, "text": "If you look at it, that attack surface, you can't plug everything."}, {"time": 12767, "text": "It's too damn large to plug everything."}, {"time": 12770, "text": "But you can do the best job you can possibly do, but it takes a variety of tools to do that, all right?"}, {"time": 12775, "text": "The idea, and Arcos is big about that, but the idea is to take the cost of fraud to the fraudster so high that they basically try to pick another target, all right?"}, {"time": 12788, "text": "And that's the idea that you want."}, {"time": 12789, "text": "You want it to be not worth the criminal's time to hit your company."}, {"time": 12794, "text": "What about white hat hacking?"}, {"time": 12796, "text": "So like hacking for good, sort of testing systems and then giving companies the vulnerabilities as you find them?"}, {"time": 12807, "text": "I think it's outstanding."}, {"time": 12808, "text": "I do, I think that, I think pen testing, white hat stuff is outstanding."}, {"time": 12812, "text": "I think that you have to."}, {"time": 12816, "text": "It has to be tempered with what is reality as well though."}, {"time": 12820, "text": "All right, we've got a whole industry of people who try to sell RFID wallets, that I don't know of many RFID hackers out there on the criminal side, to be honest with you."}, {"time": 12830, "text": "Yeah, so some of it is just like a psychological safety blanket that's not actually providing any protection."}, {"time": 12838, "text": "By the way, you wrote on LinkedIn something about ID me."}, {"time": 12847, "text": "I was going down a rabbit hole with you."}, {"time": 12848, "text": "I was wondering if you were gonna mention that."}, {"time": 12850, "text": "You know, they lost, I guess I was partially responsible for them losing an $86 million contract."}, {"time": 12857, "text": "What was the contract with the government?"}, {"time": 12859, "text": "With the IRS."}, {"time": 12859, "text": "Just with the IRS."}, {"time": 12862, "text": "So ID me is an identity, okay, backtrack."}, {"time": 12865, "text": "ID me is a marketing company that wants to say they're an identity verification company."}, {"time": 12870, "text": "I just wanna bring this up to see you get angry."}, {"time": 12875, "text": "I'll tell you what my issue is."}, {"time": 12876, "text": "My issue is."}, {"time": 12877, "text": "So it's a company that's used for authentication by the IRS, I guess."}, {"time": 12883, "text": "IRS, Social Security Administration, VA, at 1.23 state unemployment offices, few other services."}, {"time": 12891, "text": "So I guess the idea is that you would be able to unlock your account or authenticate yourself as a human being by using your face or something like that."}, {"time": 12904, "text": "Or private information."}, {"time": 12906, "text": "They've got a tiered system with verification."}, {"time": 12908, "text": "They've got, you can do, they've got a free system which is questionable where you submit an ID and it's been shown, several bypasses have been shown."}, {"time": 12917, "text": "And I don't wanna talk about their security horribly bad because I wanna be honest, there are bypasses for a lot of security systems out there."}, {"time": 12926, "text": "The issue that I have with ID me is that their policies are somewhat questionable."}, {"time": 12934, "text": "I don't care if you're a private company that has those policies in place."}, {"time": 12937, "text": "But if you're a government agency and you as a citizen are entitled to a benefit or a service of that government agency, and then the government agency forces you to give up your complete identity profile to a private company."}, {"time": 12953, "text": "And then that private company uses that profile for marketing purposes, to further profit, things like that."}, {"time": 12959, "text": "I have a huge issue with that."}, {"time": 12961, "text": "I don't care if you're a private company that does that."}, {"time": 12963, "text": "I just don't think that citizens need to be forced into doing that in order to get a benefit or service that they're entitled to."}, {"time": 12969, "text": "So that's my big issue."}, {"time": 12971, "text": "So that, I mean, given how much value, how much we talked about the value of identity, you don't think that should be handed over lightly?"}, {"time": 12981, "text": "And who would have thought that Brett Johnson would ever become a privacy advocate?"}, {"time": 12985, "text": "But here I am."}, {"time": 12989, "text": "I mean, it's just, people don't understand or appreciate the value of who they are."}, {"time": 12998, "text": "And certainly you've got a host of companies, ID means not the only one, but you've got some of these companies that say, well, we strip out the PII of the individual."}, {"time": 13008, "text": "We're just using the biometrics and the sites they're visiting and things like that."}, {"time": 13011, "text": "That's identity."}, {"time": 13013, "text": "You can still ping that one unique individual out of all, using that information."}, {"time": 13017, "text": "Stripping out the PII, you can still ping who that individual is."}, {"time": 13020, "text": "So having lived a life of crime for many years, I'm sure you've connected indirectly to a large number of very dangerous people."}, {"time": 13031, "text": "Directly and directly."}, {"time": 13034, "text": "But the network indirectly is even larger, right?"}, {"time": 13038, "text": "Are you, and I apologize for this question, are you ever worried for your life, for your wellbeing?"}, {"time": 13047, "text": "Like having seen a world that's really dangerous in ways that's not, that operates in the shadows."}, {"time": 13058, "text": "Like I said, when we started Shadow Crew and started that initial cybercrime business, that world, violence wasn't there."}, {"time": 13067, "text": "It came in later."}, {"time": 13069, "text": "Now violence is inherent in the system, to do the Monty Python bit."}, {"time": 13072, "text": "It's part of it."}, {"time": 13075, "text": "Yeah, the mob, the mafia are now part of this whole thing."}, {"time": 13078, "text": "Cartels are part of it."}, {"time": 13080, "text": "Drugs are inherently intertwined in cybercrime marketplaces because of the profit potential."}, {"time": 13086, "text": "And with that comes a lot of violence as well."}, {"time": 13088, "text": "Yeah, the cartels already brought the violence that they're good at from the 20th century."}, {"time": 13094, "text": "Into the technology of the 21st century."}, {"time": 13096, "text": "Now, do I worry about that?"}, {"time": 13100, "text": "It's interesting that my family worries about that."}, {"time": 13106, "text": "I think I may be just too involved in it to appreciate that type of danger."}, {"time": 13112, "text": "But my family worries about that."}, {"time": 13116, "text": "Do I think it's a possibility?"}, {"time": 13118, "text": "I'm the guy that says what needs to be said."}, {"time": 13121, "text": "I've built my trust in this industry by not being scared of calling out companies and individuals and not being scared of targeting criminals or criminal groups."}, {"time": 13134, "text": "Your honesty as a human being emotionally and intellectually is really refreshing."}, {"time": 13143, "text": "It's a gift and thank you."}, {"time": 13145, "text": "Thank you for doing that."}, {"time": 13146, "text": "Is there a device you can give to young people today about life?"}, {"time": 13153, "text": "You broke many rules, all the rules."}, {"time": 13159, "text": "Some rules should be broken."}, {"time": 13161, "text": "So if you look at somebody young today in high school and college, thinking how they can break the rules legally and live a life that's something they could be really proud of, what would you say?"}, {"time": 13175, "text": "Biggest lesson I've learned."}, {"time": 13179, "text": "You want your life to be one where you're helping people and not hurting people."}, {"time": 13185, "text": "And that really hit me the first time I walked into Quantico."}, {"time": 13189, "text": "You see the brightest minds in the United States who give up a lot of money, the opportunities of a lot of money because they believe in helping people."}, {"time": 13201, "text": "Where I spent a career just hurting and harming individuals, that's a hell of a lesson."}, {"time": 13207, "text": "And I'm glad I'm there, but I would tell people out there, it's fine to want money."}, {"time": 13213, "text": "It's fine to do that."}, {"time": 13214, "text": "It's fine to test systems."}, {"time": 13216, "text": "It's fine to circumvent the rules if you're not breaking the law."}, {"time": 13219, "text": "It's fine to do all that."}, {"time": 13220, "text": "I like doing that, all right?"}, {"time": 13222, "text": "But if you've got the mindset, if you can just adhere to the mindset of helping people and not hurting people, I think you'll be all right at the end of the day."}, {"time": 13231, "text": "What gives you, again, given the dark web, given all the dangers out there, what gives you hope about the future, looking into five, 10 years, 50 years?"}, {"time": 13243, "text": "I mean, hope for human civilization."}, {"time": 13245, "text": "If we do all right, if we make it out of this century, what do you think would be the reason?"}, {"time": 13257, "text": "That's a damn good question."}, {"time": 13259, "text": "Because I mean, we've got a lot of bad stuff going on."}, {"time": 13261, "text": "We've got a lot of reasons."}, {"time": 13263, "text": "If I asked you the other question of how do you think human civilization would destroy itself, I'm sure you have a lot of answers."}, {"time": 13270, "text": "You know what gives me hope is that you see people working together."}, {"time": 13276, "text": "The COVIDs have been a little bit different because I think too many people wanted to play politics with it."}, {"time": 13282, "text": "That's been the heartbreaking thing about COVID is it's in many ways pulled people apart."}, {"time": 13286, "text": "I mean, because a virus involves kind of being afraid of each other because I mean, that was a scary thing."}, {"time": 13295, "text": "People talk about pandemics in that way that you're afraid of other humans."}, {"time": 13300, "text": "That is the most terrifying thing."}, {"time": 13301, "text": "It's not the destructive nature of what it does to your body."}, {"time": 13304, "text": "It's just that it pulls people apart."}, {"time": 13306, "text": "And then you realize how fundamental that human connection is to human civilization."}, {"time": 13313, "text": "But you know, as human beings, we do, when things really get bad, when things really get bad, we do tend to respond and group together."}, {"time": 13324, "text": "When there's injustice, we see it, we rise up."}, {"time": 13329, "text": "I wake up every morning and I watch Fox News and CNN so I can be pissed off at everyone."}, {"time": 13337, "text": "All right, so the division, the outrage, they're really feeding."}, {"time": 13342, "text": "They want you, they want you to be angry."}, {"time": 13345, "text": "Yeah, that's what causes me to spare and what I think that, you know, we just need to."}, {"time": 13350, "text": "Elizabeth was very good."}, {"time": 13352, "text": "She taught me one hell of a lesson because before I met her, I was a news hound."}, {"time": 13357, "text": "News would be on all the time."}, {"time": 13358, "text": "A couple of channels of it."}, {"time": 13360, "text": "And she was the woman who didn't watch the news at all."}, {"time": 13365, "text": "And I didn't understand that back then, man."}, {"time": 13368, "text": "But now I do."}, {"time": 13369, "text": "You know, now I'm like, it's pretty smart, you know?"}, {"time": 13372, "text": "Don't need to listen to that bullshit as it is."}, {"time": 13375, "text": "That's why I love reading history books."}, {"time": 13379, "text": "I just, I feel like that's the right perspective on take on modern times."}, {"time": 13385, "text": "You know, how will this time be written about in the history books and react to that?"}, {"time": 13390, "text": "Don't the daily ups and downs of the outrages, which is getting worse and worse in terms of how quick the turnaround is in terms of the news."}, {"time": 13400, "text": "I'll tell you what, I'm sitting here."}, {"time": 13402, "text": "I appreciate you talking to me."}, {"time": 13404, "text": "I do, because, you know, I talk about that relationship and everything."}, {"time": 13409, "text": "It's really been this kind of realization for me on a lot of things."}, {"time": 13413, "text": "So I really appreciate you asking those questions and everything, maybe be able to talk about that."}, {"time": 13416, "text": "I love it that you value, first of all, you're self aware how important love is in a human being's life."}, {"time": 13426, "text": "It can make you do some of the best and some of the worst things in this world."}, {"time": 13430, "text": "And it's good to think about that."}, {"time": 13431, "text": "It's good to think about that."}, {"time": 13433, "text": "That is what makes us human, is that connection and that love for each other."}, {"time": 13441, "text": "This big, ridiculous question."}, {"time": 13443, "text": "Why the hell, what are we all here for?"}, {"time": 13445, "text": "I don't think it is ridiculous, man."}, {"time": 13447, "text": "To me, that meaning of life is finding out that lesson that we need to help each other."}, {"time": 13453, "text": "If you talk, you ask about security, how do you get to say that?"}, {"time": 13456, "text": "But, you know, everybody's worried about themselves."}, {"time": 13459, "text": "The way you solve that security problem is it takes everybody looking out for everyone else."}, {"time": 13466, "text": "That's how you solve that problem."}, {"time": 13469, "text": "And however you take, whatever journey you take to discovering that point."}, {"time": 13474, "text": "Yeah, I mean, with me, I've been asked a few times, do you regret anything?"}, {"time": 13478, "text": "Would you change anything?"}, {"time": 13480, "text": "I've done a shitload of despicable things in my life."}, {"time": 13486, "text": "But I'm at a point in my life where I like who I am."}, {"time": 13490, "text": "And I know that I am doing exactly what I'm supposed to be doing with my life."}, {"time": 13493, "text": "So, would I change anything?"}, {"time": 13495, "text": "As bad as a lot of that shit has been, I wouldn't."}, {"time": 13499, "text": "It made you who you are."}, {"time": 13501, "text": "The whole of it, the whole mess."}, {"time": 13503, "text": "That's trite to say that, but it's true."}, {"time": 13505, "text": "That's the weird thing, it's true."}, {"time": 13510, "text": "Also, you mentioned that you're thinking of launching a show."}, {"time": 13513, "text": "What's it gonna be called?"}, {"time": 13514, "text": "Cause you've done a couple of podcasts."}, {"time": 13516, "text": "You're incredibly good at this."}, {"time": 13517, "text": "You're so good at this."}, {"time": 13518, "text": "I've done a couple."}, {"time": 13519, "text": "I'm on a lot of podcasts and everything like that."}, {"time": 13522, "text": "I had the fraud cast with a friend of mine, Carice Hendrick."}, {"time": 13526, "text": "And that ended because of a difference of opinion."}]}]