[{"title": "William MacAskill: Effective Altruism | Lex Fridman Podcast #84", "id": "NvsI8ijW8xU", "quotes": [{"time": 418, "text": "You don't know."}, {"time": 418, "text": "You have to infer everything about this person's mental state from whether they put a full stop at the end of a text or not."}, {"time": 424, "text": "Well, the flip side of that is it truly text that's the problem here, because there's a viral aspect to the text, where you could just post text nonstop."}, {"time": 437, "text": "It's very immediate."}, {"time": 439, "text": "The times before Twitter, before the internet, the way you would exchange texts is you would write books."}, {"time": 448, "text": "And that, while it doesn't get body language, it doesn't get tone, it doesn't... so on, but it does actually boil down after some time of thinking, some editing, and so on, boil down ideas."}, {"time": 460, "text": "So is the immediacy and the viral nature, which produces the outrage mobs and so on, the potential problem?"}, {"time": 469, "text": "I think that is a big issue."}, {"time": 471, "text": "I think there's going to be this strong selection effect where something that provokes outrage, well, that's high arousal, you're more likely to retweet that, whereas kind of sober analysis is not as sexy, not as viral."}, {"time": 488, "text": "I do agree that long form content is much better to productive discussion."}, {"time": 496, "text": "In terms of the media that are very popular at the moment, I think that podcasting is great where your podcasts are two hours long, so they're much more in depth than Twitter are, and you are able to convey so much more nuance, so much more caveat, because it's an actual conversation."}, {"time": 516, "text": "It's more like the sort of communication that we've evolved to do, rather than these very small little snippets of ideas that, when also combined with bad incentives, just clearly aren't designed for helping us get to the truth."}, {"time": 529, "text": "It's kind of interesting that it's not just the length of the podcast medium, but it's the fact that it was started by people that don't give a damn about quote unquote demand, that there's a relaxed, sort of the style that Joe Rogan does, there's a freedom to express ideas in an unconstrained way that's very real."}, {"time": 555, "text": "It's kind of funny that it feels so refreshingly real to us today, and I wonder what the future looks like."}, {"time": 564, "text": "It's a little bit sad now that quite a lot of sort of more popular people are getting into podcasting, and they try to sort of create, they try to control it, they try to constrain it in different kinds of ways."}, {"time": 580, "text": "People I love, like Conan O Brien and so on, different comedians, and I'd love to see where the real aspects of this podcasting medium persist, maybe in TV, maybe in YouTube, maybe Netflix is pushing those kind of ideas, and it's kind of, it's a really exciting word, that kind of sharing of knowledge."}, {"time": 600, "text": "Yeah, I mean, I think it's a double edged sword as it becomes more popular and more profitable, where on the one hand you'll get a lot more creativity, people doing more interesting things with the medium, but also perhaps you get this place to the bottom where suddenly maybe it'll be hard to find good content on podcasts because it'll be so overwhelmed by the latest bit of viral outrage."}, {"time": 624, "text": "So speaking of that, jumping on Effective Altruism for a second, so much of that internet content is funded by advertisements."}, {"time": 636, "text": "Just in the context of Effective Altruism, we're talking about the richest companies in the world, they're funded by advertisements essentially, Google, that's their primary source of income."}, {"time": 648, "text": "Do you see that as, do you have any criticism of that source of income?"}, {"time": 655, "text": "Do you see that source of money as a potentially powerful source of money that could be used, well, certainly could be used for good, but is there something bad about that source of money?"}, {"time": 665, "text": "I think there's significant worries with it, where it means that the incentives of the company might be quite misaligned with making people's lives better, where again, perhaps the incentives are towards increasing drama and debate on your social media feed in order that more people are going to be engaged, perhaps compulsively involved with the platform."}, {"time": 702, "text": "Whereas there are other business models like having an opt in subscription service where perhaps they have other issues, but there's much more of an incentive to provide a product that its users are just really wanting, because now I'm paying for this product."}, {"time": 722, "text": "I'm paying for this thing that I want to buy rather than I'm trying to use this thing and it's going to get a profit mechanism that is somewhat orthogonal to me actually just wanting to use the product."}, {"time": 739, "text": "And so, I mean, in some cases it'll work better than others."}, {"time": 743, "text": "I can imagine, I can in theory imagine Facebook having a subscription service, but I think it's unlikely to happen anytime soon."}, {"time": 752, "text": "Well, it's interesting and it's weird now that you bring it up that it's unlikely."}, {"time": 756, "text": "For example, I pay I think 10 bucks a month for YouTube Red and I don't think I get it much for that except just for no ads, but in general it's just a slightly better experience."}, {"time": 772, "text": "And I would gladly, now I'm not wealthy, in fact I'm operating very close to zero dollars, but I would pay 10 bucks a month to Facebook and 10 bucks a month to Twitter for some kind of more control in terms of advertisements and so on."}, {"time": 789, "text": "But the other aspect of that is data, personal data."}, {"time": 793, "text": "People are really sensitive about this and I as one who hopes to one day create a company that may use people's data to do good for the world, wonder about this."}, {"time": 808, "text": "One, the psychology of why people are so paranoid."}, {"time": 812, "text": "Well, I understand why, but they seem to be more paranoid than is justified at times."}, {"time": 817, "text": "And the other is how do you do it right?"}, {"time": 819, "text": "So it seems that Facebook is, it seems that Facebook is doing it wrong."}, {"time": 827, "text": "That's certainly the popular narrative."}, {"time": 829, "text": "It's unclear to me actually how wrong."}, {"time": 833, "text": "Like I tend to give them more benefit of the doubt because it's a really hard thing to do right and people don't necessarily realize it, but how do we respect in your view people's privacy?"}, {"time": 845, "text": "Yeah, I mean in the case of how worried are people about using their data, I mean there's a lot of public debate and criticism about it."}, {"time": 858, "text": "When we look at people's revealed preferences, people's continuing massive use of these sorts of services."}, {"time": 867, "text": "It's not clear to me how much people really do care."}, {"time": 870, "text": "Perhaps they care a bit, but they're happy to in effect kind of sell their data in order to be able to kind of use a certain service."}, {"time": 877, "text": "That's a great term, revealed preferences."}, {"time": 879, "text": "So these aren't preferences you self report in the survey."}, {"time": 882, "text": "This is like your actions speak."}, {"time": 885, "text": "So you might say, oh yeah, I hate the idea of Facebook having my data."}, {"time": 891, "text": "But then when it comes to it, you actually are willing to give that data in exchange for being able to use the service."}, {"time": 900, "text": "And if that's the case, then I think unless we have some explanation about why there's some negative externality from that or why there's some coordination failure, or if there's something that consumers are just really misled about where they don't realize why giving away data like this is a really bad thing to do, then ultimately I kind of want to, you know, respect people's preferences."}, {"time": 932, "text": "They can give away their data if they want."}, {"time": 935, "text": "I think there's a big difference between companies use of data and governments having data where, you know, looking at the track record of history, governments knowing a lot about their people can be very bad if the government chooses to do bad things with it."}, {"time": 955, "text": "And that's more worrying, I think."}, {"time": 957, "text": "So let's jump into it a little bit."}, {"time": 959, "text": "Most people know, but actually I, two years ago, had no idea what effective altruism was until I saw there was a cool looking event in an MIT group here."}, {"time": 970, "text": "I think it's called the Effective Altruism Club or a group."}, {"time": 977, "text": "I was like, what the heck is that?"}, {"time": 979, "text": "And one of my friends said, I mean, he said that they're just a bunch of eccentric characters."}, {"time": 990, "text": "So I was like, hell yes, I'm in."}, {"time": 991, "text": "So I went to one of their events and looked up what's it about."}, {"time": 994, "text": "It's quite a fascinating philosophical and just a movement of ideas."}, {"time": 998, "text": "So can you tell me what is effective altruism?"}, {"time": 1002, "text": "Great, so the core of effective altruism is about trying to answer this question, which is how can I do as much good as possible with my scarce resources, my time and with my money?"}, {"time": 1013, "text": "And then once we have our best guess answers to that, trying to take those ideas and put that into practice, and do those things that we believe will do the most good."}, {"time": 1023, "text": "And we're now a community of people, many thousands of us around the world, who really are trying to answer that question as best we can and then use our time and money to make the world better."}, {"time": 1035, "text": "So what's the difference between sort of classical general idea of altruism and effective altruism?"}, {"time": 1044, "text": "So normally when people try to do good, they often just aren't so reflective about those attempts."}, {"time": 1054, "text": "So someone might approach you on the street asking you to give to charity."}, {"time": 1058, "text": "And if you're feeling altruistic, you'll give to the person on the street."}, {"time": 1064, "text": "Or if you think, oh, I wanna do some good in my life, you might volunteer at a local place."}, {"time": 1070, "text": "Or perhaps you'll decide, pursue a career where you're working in a field that's kind of more obviously beneficial like being a doctor or a nurse or a healthcare professional."}, {"time": 1082, "text": "But it's very rare that people apply the same level of rigor and analytical thinking to lots of other areas we think about."}, {"time": 1094, "text": "So take the case of someone approaching you on the street."}, {"time": 1096, "text": "Imagine if that person instead was saying, hey, I've got this amazing company."}, {"time": 1100, "text": "Do you want to invest in it?"}, {"time": 1102, "text": "It would be insane."}, {"time": 1103, "text": "No one would ever think, oh, of course, I'm just a company like you'd think it was a scam."}, {"time": 1109, "text": "But somehow we don't have that same level of rigor when it comes to doing good, even though the stakes are more important when it comes to trying to help others than trying to make money for ourselves."}, {"time": 1118, "text": "Well, first of all, so there is a psychology at the individual level of doing good just feels good."}, {"time": 1126, "text": "And so in some sense, on that pure psychological part, it doesn't matter."}, {"time": 1132, "text": "In fact, you don't wanna know if it does good or not because most of the time it won't."}, {"time": 1141, "text": "So like in a certain sense, it's understandable why altruism without the effective part is so appealing to a certain population."}, {"time": 1151, "text": "By the way, let's zoom off for a second."}, {"time": 1155, "text": "Do you think most people, two questions."}, {"time": 1158, "text": "Do you think most people are good?"}, {"time": 1160, "text": "And question number two is, do you think most people wanna do good?"}, {"time": 1164, "text": "So are most people good?"}, {"time": 1166, "text": "I think it's just super dependent on the circumstances that someone is in."}, {"time": 1171, "text": "I think that the actions people take and their moral worth is just much more dependent on circumstance than it is on someone's intrinsic character."}, {"time": 1181, "text": "So is there evil within all of us?"}, {"time": 1183, "text": "It seems like with the better angels of our nature, there's a tendency of us as a society to tend towards good, less war."}, {"time": 1193, "text": "I mean, with all these metrics."}, {"time": 1196, "text": "Is that us becoming who we want to be or is that some kind of societal force?"}, {"time": 1203, "text": "What's the nature versus nurture thing here?"}, {"time": 1205, "text": "Yeah, so in that case, I just think, yeah, so violence has massively declined over time."}, {"time": 1210, "text": "I think that's a slow process of cultural evolution, institutional evolution such that now the incentives for you and I to be violent are very, very small indeed."}, {"time": 1221, "text": "In contrast, when we were hunter gatherers, the incentives were quite large."}, {"time": 1225, "text": "If there was someone who was potentially disturbing the social order and hunter gatherer setting, there was a very strong incentive to kill that person and people did and it was just the guarded 10% of deaths among hunter gatherers were murders."}, {"time": 1244, "text": "After hunter gatherers, when you have actual societies is when violence can probably go up because there's more incentive to do mass violence, right?"}, {"time": 1254, "text": "To take over, conquer other people's lands and murder everybody in place and so on."}, {"time": 1261, "text": "Yeah, I mean, I think total death rate from human causes does go down, but you're right that if you're in a hunter gatherer situation you're kind of a group that you're part of is very small then you can't have massive wars that just massive communities don't exist."}, {"time": 1279, "text": "But anyway, the second question, do you think most people want to do good?"}, {"time": 1283, "text": "Yeah, and then I think that is true for most people."}, {"time": 1286, "text": "I think you see that with the fact that most people donate, a large proportion of people volunteer."}, {"time": 1293, "text": "If you give people opportunities to easily help other people, they will take it."}, {"time": 1298, "text": "But at the same time, we're a product of our circumstances and if it were more socially awarded to be doing more good, if it were more socially awarded to do good effectively rather than not effectively, then we would see that behavior a lot more."}, {"time": 1315, "text": "So why should we do good?"}, {"time": 1318, "text": "Yeah, my answer to this is there's no kind of deeper level of explanation."}, {"time": 1324, "text": "So my answer to kind of why should you do good is well, there is someone whose life is on the line, for example, whose life you can save via donating just actually a few thousand dollars to an effective nonprofit like the Against Malaria Foundation."}, {"time": 1341, "text": "That is a sufficient reason to do good."}, {"time": 1343, "text": "And then if you ask, well, why ought I to do that?"}, {"time": 1347, "text": "I'm like, I just show you the same facts again."}, {"time": 1349, "text": "It's that fact that is the reason to do good."}, {"time": 1352, "text": "There's nothing more fundamental than that."}, {"time": 1354, "text": "I'd like to sort of make more concrete the thing we're trying to make better."}, {"time": 1361, "text": "So you just mentioned malaria."}, {"time": 1363, "text": "So there's a huge amount of suffering in the world."}, {"time": 1366, "text": "Are we trying to remove?"}, {"time": 1370, "text": "So is ultimately the goal, not ultimately, but the first step is to remove the worst of the suffering."}, {"time": 1379, "text": "So there's some kind of threshold of suffering that we want to make sure does not exist in the world."}, {"time": 1386, "text": "Or do we really naturally want to take a much further step and look at things like income inequality?"}, {"time": 1394, "text": "So not just getting everybody above a certain threshold, but making sure that there's some, that broadly speaking, there's less injustice in the world, unfairness, in some definition, of course, very difficult to define a fairness."}, {"time": 1411, "text": "Yeah, so the metric I use is how many people do we affect and by how much do we affect them?"}, {"time": 1417, "text": "And so that can, often that means eliminating suffering, but it doesn't have to, could be helping promote a flourishing life instead."}, {"time": 1427, "text": "And so if I was comparing reducing income inequality or getting people from the very pits of suffering to a higher level, the question I would ask is just a quantitative one of just if I do this first thing or the second thing, how many people am I going to benefit and by how much am I going to benefit?"}, {"time": 1450, "text": "Am I going to move that one person from kind of 10%, 0% well being to 10% well being?"}, {"time": 1457, "text": "Perhaps that's just not as good as moving a hundred people from 10% well being to 50% well being."}, {"time": 1462, "text": "And the idea is the diminishing returns is the idea of when you're in terrible poverty, then the $1 that you give goes much further than if you were in the middle class in the United States, for example."}, {"time": 1482, "text": "And this fact is really striking."}, {"time": 1484, "text": "So if you take even just quite a conservative estimate of how we are able to turn money into well being, the economists put it as like a log curve."}, {"time": 1500, "text": "That's the or steeper."}, {"time": 1502, "text": "But that means that any proportional increase in your income has the same impact on your well being."}, {"time": 1509, "text": "And so someone moving from $1,000 a year to $2,000 a year has the same impact as someone moving from $100,000 a year to $200,000 a year."}, {"time": 1520, "text": "And then when you combine that with the fact that we in middle class members of rich countries are 100 times richer than financial terms in the global poor, that means we can do a hundred times to benefit the poorest people in the world as we can to benefit people of our income level."}, {"time": 1537, "text": "And that's this astonishing fact."}, {"time": 1539, "text": "Yeah, it's quite incredible."}, {"time": 1540, "text": "A lot of these facts and ideas are just difficult to think about because there's an overwhelming amount of suffering in the world."}, {"time": 1556, "text": "And even acknowledging it is difficult."}, {"time": 1560, "text": "Not exactly sure why that is."}, {"time": 1562, "text": "I mean, I mean, it's difficult because you have to bring to mind, you know, it's an unpleasant experience thinking about other people's suffering."}, {"time": 1571, "text": "It's unpleasant to be empathizing with it, firstly."}, {"time": 1574, "text": "And then secondly, thinking about it means that maybe we'd have to change our lifestyles."}, {"time": 1579, "text": "And if you're very attached to the income that you've got, perhaps you don't want to be confronting ideas or arguments that might cause you to use some of that money to help others."}, {"time": 1591, "text": "So it's quite understandable in the psychological terms, even if it's not the right thing that we ought to be doing."}, {"time": 1598, "text": "So how can we do better?"}, {"time": 1600, "text": "How can we be more effective?"}, {"time": 1602, "text": "How does data help?"}, {"time": 1604, "text": "Yeah, in general, how can we do better?"}, {"time": 1607, "text": "It's definitely hard."}, {"time": 1608, "text": "And we have spent the last 10 years engaged in kind of some deep research projects, to try and answer kind of two questions."}, {"time": 1619, "text": "One is, of all the many problems the world is facing, what are the problems we ought to be focused on?"}, {"time": 1624, "text": "And then within those problems that we judge to be kind of the most pressing, where we use this idea of focusing on problems that are the biggest in scale, that are the most tractable, where we can make the most progress on that problem, and that are the most neglected."}, {"time": 1643, "text": "Within them, what are the things that have the kind of best evidence, or we have the best guess, will do the most good."}, {"time": 1652, "text": "And so we have a bunch of organizations."}, {"time": 1654, "text": "So GiveWell, for example, is focused on global health and development, and has a list of seven top recommended charities."}, {"time": 1662, "text": "So the idea in general, and sorry to interrupt, is, so we'll talk about sort of poverty and animal welfare and existential risk."}, {"time": 1668, "text": "Those are all fascinating topics, but in general, the idea is there should be a group, sorry, there's a lot of groups that seek to convert money into good."}, {"time": 1684, "text": "And then you also on top of that want to have a accounting of how good they actually perform that conversion, how well they did in converting money to good."}, {"time": 1698, "text": "So ranking of these different groups, ranking these charities."}, {"time": 1704, "text": "So does that apply across basically all aspects of effective altruism?"}, {"time": 1709, "text": "So there should be a group of people, and they should report on certain metrics of how well they've done, and you should only give your money to groups that do a good job."}, {"time": 1719, "text": "That's the core idea."}, {"time": 1719, "text": "I'd make two comments."}, {"time": 1723, "text": "One is just, it's not just about money."}, {"time": 1725, "text": "So we're also trying to encourage people to work in areas where they'll have the biggest impact."}, {"time": 1731, "text": "And in some areas, you know, they're really people heavy, but money poor."}, {"time": 1736, "text": "Other areas are kind of money rich and people poor."}, {"time": 1739, "text": "And so whether it's better to focus time or money depends on the cause area."}, {"time": 1745, "text": "And then the second is that you mentioned metrics, and while that's the ideal, and in some areas we do, we are able to get somewhat quantitative information about how much impact an area is having."}, {"time": 1758, "text": "That's not always true."}, {"time": 1760, "text": "For some of the issues, like you mentioned existential risks, well, we're not able to measure in any sort of precise way like how much progress we're making."}, {"time": 1772, "text": "And so you have to instead fall back on just rigorous argument and evaluation, even in the absence of data."}, {"time": 1781, "text": "So let's first sort of linger on your own story for a second."}, {"time": 1787, "text": "How do you yourself practice effective altruism in your own life?"}, {"time": 1791, "text": "Because I think that's a really interesting place to start."}, {"time": 1794, "text": "So I've tried to build effective altruism into at least many components of my life."}, {"time": 1800, "text": "So on the donation side, my plan is to give away most of my income over the course of my life."}, {"time": 1807, "text": "I've set a bar I feel happy with and I just donate above that bar."}, {"time": 1812, "text": "So at the moment, I donate about 20% of my income."}, {"time": 1817, "text": "Then on the career side, I've also shifted kind of what I do, where I was initially planning to work on very esoteric topics in the philosophy of logic, philosophy of language, things that are intellectually extremely interesting, but the path by which they really make a difference to the world is, let's just say it's very unclear at best."}, {"time": 1840, "text": "And so I switched instead to researching ethics to actually just working on this question of how we can do as much good as possible."}, {"time": 1848, "text": "And then I've also spent a very large chunk of my life over the last 10 years creating a number of nonprofits who again in different ways are tackling this question of how we can do the most good and helping them to grow over time too."}, {"time": 1862, "text": "Yeah, we mentioned a few of them with the career selection, 80,000."}, {"time": 1866, "text": "80,000 hours."}, {"time": 1867, "text": "80,000 hours is a really interesting group."}, {"time": 1871, "text": "So maybe also just a quick pause on the origins of effective altruism because you paint a picture who the key figures are, including yourself in the effective altruism movement today."}, {"time": 1886, "text": "Yeah, there are two main strands that kind of came together to form the effective altruism movement."}, {"time": 1930, "text": "And we set up Giving What We Can in 2009, which is encouraging people to give at least 10% of their income to the most effective charities."}, {"time": 1938, "text": "And the second main strand was the formation of GiveWell, which was originally based in New York and started in about 2007."}, {"time": 1946, "text": "And that was set up by Holden Carnovsky and Elie Hassenfeld, who were two hedge fund dudes who were making good money and thinking, well, where should I donate?"}, {"time": 1958, "text": "And in the same way as if they wanted to buy a product for themselves, they would look at Amazon reviews."}, {"time": 1964, "text": "They were like, well, what are the best charities?"}, {"time": 1966, "text": "Found they just weren't really good answers to that question, certainly not that they were satisfied with."}, {"time": 1971, "text": "And so they formed GiveWell in order to try and work out what are those charities where they can have the biggest impact."}, {"time": 1979, "text": "And then from there and some other influences, kind of community grew and spread."}, {"time": 1985, "text": "Can we explore the philosophical and political space that effective altruism occupies a little bit?"}, {"time": 1991, "text": "So from the little and distant in my own lifetime that I've read of Ayn Rand's work, Ayn Rand's philosophy of objectivism, espouses, and it's interesting to put her philosophy in contrast with effective altruism."}, {"time": 2008, "text": "So it espouses selfishness as the best thing you can do."}, {"time": 2014, "text": "But it's not actually against altruism."}, {"time": 2017, "text": "It's just you have that choice, but you should be selfish in it, right?"}, {"time": 2023, "text": "Or not, maybe you can disagree here."}, {"time": 2024, "text": "But so it can be viewed as the complete opposite of effective altruism or it can be viewed as similar because the word effective is really interesting."}, {"time": 2035, "text": "Because if you want to do good, then you should be damn good at doing good, right?"}, {"time": 2042, "text": "I think that would fit within the morality that's defined by objectivism."}, {"time": 2048, "text": "So do you see a connection between these two philosophies and other perhaps in this complicated space of beliefs that effective altruism is positioned as opposing or aligned with?"}, {"time": 2064, "text": "I would definitely say that objectivism, Ayn Rand's philosophy, is a philosophy that's quite fundamentally opposed to effective altruism."}, {"time": 2073, "text": "In which way?"}, {"time": 2074, "text": "Insofar as Ayn Rand's philosophy is about championing egoism and saying that I'm never quite sure whether the philosophy is meant to say that just you ought to do whatever will best benefit yourself, that's ethical egoism, no matter what the consequences are."}, {"time": 2090, "text": "Or second, if there's this alternative view, which is, well, you ought to try and benefit yourself because that's actually the best way of benefiting society."}, {"time": 2102, "text": "Certainly, in Atlas Shalaguchi is presenting her philosophy as a way that's actually going to bring about a flourishing society."}, {"time": 2112, "text": "And if it's the former, then well, effective altruism is all about promoting the idea of altruism and saying, in fact, we ought to really be trying to help others as much as possible."}, {"time": 2122, "text": "So it's opposed there."}, {"time": 2123, "text": "And then on the second side, I would just dispute the empirical premise."}, {"time": 2128, "text": "It would seem, given the major problems in the world today, it would seem like this remarkable coincidence, quite suspicious, one might say, if benefiting myself was actually the best way to bring about a better world."}, {"time": 2141, "text": "So on that point, and I think that connects also with career selection that we'll talk about, but let's consider not objectives, but capitalism."}, {"time": 2153, "text": "And the idea that you focusing on the thing that you are damn good at, whatever that is, may be the best thing for the world."}, {"time": 2165, "text": "Part of it is also mindset, right?"}, {"time": 2169, "text": "The thing I love is robots."}, {"time": 2173, "text": "So maybe I should focus on building robots and never even think about the idea of effective altruism, which is kind of the capitalist notion."}, {"time": 2185, "text": "Is there any value in that idea in just finding the thing you're good at and maximizing your productivity in this world and thereby sort of lifting all boats and benefiting society as a result?"}, {"time": 2198, "text": "Yeah, I think there's two things I'd want to say on that."}, {"time": 2201, "text": "So one is what your comparative advantages, what your strengths are when it comes to career."}, {"time": 2205, "text": "That's obviously super important because there's lots of career paths I would be terrible at if I thought being an artist was the best thing one could do."}, {"time": 2213, "text": "Well, I'd be doomed, just really quite astonishingly bad."}, {"time": 2219, "text": "And so I do think, at least within the realm of things that could plausibly be very high impact, choose the thing that you think you're going to be able to really be passionate at and excel at over the long term."}, {"time": 2235, "text": "Then on this question of should one just do that in an unrestricted way and not even think about what the most important problems are."}, {"time": 2242, "text": "I do think that in a kind of perfectly designed society, that might well be the case."}, {"time": 2247, "text": "That would be a society where we've corrected all market failures, we've internalized all externalities, and then we've managed to set up incentives such that people just pursuing their own strengths is the best way of doing good."}, {"time": 2264, "text": "But we're very far from that society."}, {"time": 2299, "text": "So yeah, instead of pure definition capitalism, it just may very well ignore the people that are suffering the most, the white swath of them."}, {"time": 2308, "text": "So if you could allow me this line of thinking here."}, {"time": 2315, "text": "So I've listened to a lot of your conversations online."}, {"time": 2318, "text": "I find, if I can compliment you, they're very interesting conversations."}, {"time": 2326, "text": "Your conversation on Rogan, on Joe Rogan was really interesting, with Sam Harris and so on, whatever."}, {"time": 2335, "text": "There's a lot of stuff that's really good out there."}, {"time": 2338, "text": "And yet, when I look at the internet and I look at YouTube, which has certain mobs, certain swaths of right leaning folks, whom I dearly love."}, {"time": 2352, "text": "I love all people, especially people with ideas."}, {"time": 2359, "text": "They seem to not like you very much."}, {"time": 2362, "text": "So I don't understand why exactly."}, {"time": 2366, "text": "So my own sort of hypothesis is there is a right left divide that absurdly so caricatured in politics, at least in the United States."}, {"time": 2378, "text": "And maybe you're somehow pigeonholed into one of those sides."}, {"time": 2382, "text": "And maybe that's what it is."}, {"time": 2386, "text": "Maybe your message is somehow politicized."}, {"time": 2389, "text": "Yeah, I mean."}, {"time": 2390, "text": "How do you make sense of that?"}, {"time": 2392, "text": "Because you're extremely interesting."}, {"time": 2394, "text": "Like you got the comments I see on Joe Rogan."}, {"time": 2398, "text": "There's a bunch of negative stuff."}, {"time": 2400, "text": "And yet, if you listen to it, the conversation is fascinating."}, {"time": 2403, "text": "I'm not speaking, I'm not some kind of lefty extremist, but just it's a fascinating conversation."}, {"time": 2410, "text": "So why are you getting some small amount of hate?"}, {"time": 2413, "text": "So I'm actually pretty glad that Effective Altruism has managed to stay relatively unpoliticized because I think the core message to just use some of your time and money to do as much good as possible to fight some of the problems in the world can be appealing across the political spectrum."}, {"time": 2431, "text": "And we do have a diversity of political viewpoints among people who have engaged in Effective Altruism."}, {"time": 2438, "text": "We do, however, do get some criticism from the left and the right."}, {"time": 2443, "text": "What's the criticism?"}, {"time": 2444, "text": "Both would be interesting to hear."}, {"time": 2445, "text": "Yeah, so criticism from the left is that we're not focused enough on dismantling the capitalist system that they see as the root of most of the problems that we're talking about."}, {"time": 2458, "text": "And there I kind of disagree on partly the premise where I don't think relevant alternative systems would say to the animals or to the global poor or to the future generations kind of much better."}, {"time": 2475, "text": "And then also the tactics where I think there are particular ways we can change society that would massively benefit, you know, be massively beneficial on those things that don't go via dismantling like the entire system, which is perhaps a million times harder to do."}, {"time": 2490, "text": "Then criticism on the right, there's definitely like in response to the Joe Rogan podcast."}, {"time": 2496, "text": "There definitely were a number of Ayn Rand fans who weren't keen on the idea of promoting altruism."}, {"time": 2503, "text": "There was a remarkable set of ideas."}, {"time": 2506, "text": "Just the idea that Effective Altruism was unmanly, I think, was driving a lot of criticism."}, {"time": 2512, "text": "Okay, so I love fighting."}, {"time": 2516, "text": "I've been in street fights my whole life."}, {"time": 2518, "text": "I'm as alpha in everything I do as it gets."}, {"time": 2524, "text": "And the fact that Joe Rogan said that I thought Scent of a Woman is a better movie than John Wick put me into this beta category amongst people who are like basically saying this, yeah, unmanly or it's not tough."}, {"time": 2541, "text": "It's not some principled view of strength that is represented by a spasmodic."}, {"time": 2547, "text": "So actually, so how do you think about this?"}, {"time": 2551, "text": "Because to me, altruism, especially Effective Altruism, I don't know what the female version of that is, but on the male side, manly as fuck, if I may say so."}, {"time": 2566, "text": "So how do you think about that kind of criticism?"}, {"time": 2571, "text": "I think people who would make that criticism are just occupying a like state of mind that I think is just so different from my state of mind that I kind of struggle to maybe even understand it where if something's manly or unmanly or feminine or unfeminine, I'm like, I don't care."}, {"time": 2588, "text": "Like, is it the right thing to do or the wrong thing to do?"}, {"time": 2591, "text": "So let me put it not in terms of man or woman."}, {"time": 2594, "text": "I don't think that's useful, but I think there's a notion of acting out of fear as opposed to out of principle and strength."}, {"time": 2608, "text": "Here's something that I do feel as an intuition and that I think drives some people who do find Canvaean Land attractive and so on as a philosophy, which is a kind of taking control of your own life and having power over how you're steering your life and not kind of kowtowing to others, you know, really thinking things through."}, {"time": 2635, "text": "I find like that set of ideas just very compelling and inspirational."}, {"time": 2639, "text": "I actually think of effect of altruism has really, you know, that side of my personality."}, {"time": 2645, "text": "It's like scratch that itch where you are just not taking the kind of priorities that society is giving you as granted."}, {"time": 2654, "text": "Instead, you're choosing to act in accordance with the priorities that you think are most important in the world."}, {"time": 2661, "text": "And often that involves then doing quite unusual things from a societal perspective, like donating a large chunk of your earnings or working on these weird issues about AI and so on that other people might not understand."}, {"time": 2679, "text": "Yeah, I think that's a really gutsy thing to do."}, {"time": 2682, "text": "That is taking control."}, {"time": 2683, "text": "That's at least at this stage."}, {"time": 2685, "text": "I mean, that's you taking ownership, not of just yourself, but your presence in this world that's full of suffering and saying as opposed to being paralyzed by that notion is taking control and saying I could do something."}, {"time": 2703, "text": "Yeah, I mean, that's really powerful."}, {"time": 2705, "text": "But I mean, sort of the one thing I personally hate too about the left currently that I think those folks to detect is the social signaling."}, {"time": 2715, "text": "When you look at yourself, sort of late at night, would you do everything you're doing in terms of effective altruism if your name, because you're quite popular, but if your name was totally unattached to it, so if it was in secret."}, {"time": 2732, "text": "Yeah, I mean, I think I would."}, {"time": 2734, "text": "To be honest, I think the kind of popularity is like, you know, it's mixed bag, but there are serious costs."}, {"time": 2743, "text": "And I don't particularly, I don't like love it."}, {"time": 2745, "text": "Like, it means you get all these people calling you a cuck on Joe Rogan."}, {"time": 2750, "text": "It's like not the most fun thing."}, {"time": 2751, "text": "But you also get a lot of sort of brownie points for doing good for the world."}, {"time": 2756, "text": "Yeah, you do."}, {"time": 2757, "text": "But I think my ideal life, I would be like in some library solving logic puzzles all day and I'd like really be like learning maths and so on."}, {"time": 2767, "text": "So you have a like good body of friends and so on."}, {"time": 2770, "text": "So your instinct for effective altruism is something deep."}, {"time": 2774, "text": "It's not one that is communicating socially."}, {"time": 2779, "text": "It's more in your heart."}, {"time": 2781, "text": "You want to do good for the world."}, {"time": 2783, "text": "Yeah, I mean, so we can look back to early giving what we can."}, {"time": 2786, "text": "So, you know, we're setting this up, me and Toby."}, {"time": 2791, "text": "And I really thought that doing this would be a big hit to my academic career because I was now spending, you know, at that time more than half my time setting up this nonprofit at the crucial time when you should be like producing your best academic work and so on."}, {"time": 2807, "text": "And it was also the case at the time."}, {"time": 2809, "text": "It was kind of like the Toby order club."}, {"time": 2812, "text": "You know, he was he was the most popular."}, {"time": 2815, "text": "There's this personal interest story about him and his plans donate and sorry to interrupt but Toby was donating a large amount."}, {"time": 2822, "text": "Can you tell just briefly what he was doing?"}, {"time": 2825, "text": "Yeah, so he made this public commitment to give everything he earned above 20,000 pounds per year to the most effective causes."}, {"time": 2833, "text": "And even as a graduate student, he was still donating about 15, 20% of his income, which is so quite significant given that graduate students are not known for being super wealthy."}, {"time": 2844, "text": "And when we launched Giving What We Can, the media just loved this as like a personal interest story."}, {"time": 2851, "text": "So the story about him and his pledge was the most, yeah, it was actually the most popular news story of the day."}, {"time": 2860, "text": "And we kind of ran the same story a year later and it was the most popular news story of the day a year later too."}, {"time": 2865, "text": "And so it really was kind of several years before then I was also kind of giving more talks and starting to do more writing and then especially with, you know, I wrote this book Doing Good Better that then there started to be kind of attention and so on."}, {"time": 2882, "text": "But deep inside your own relationship with effective altruism was, I mean, it had nothing to do with the publicity."}, {"time": 2892, "text": "Did you see yourself?"}, {"time": 2894, "text": "How did the publicity connect with it?"}, {"time": 2896, "text": "Yeah, I mean, that's kind of what I'm saying is I think the publicity came like several years afterwards."}, {"time": 2902, "text": "I mean, at the early stage when we set up Giving What We Can, it was really just every person we get to pledge 10% is, you know, something like $100,000 over their lifetime."}, {"time": 2915, "text": "And so it was just we had started with 23 members, every single person was just this like kind of huge accomplishment."}, {"time": 2923, "text": "And at the time, I just really thought, you know, maybe over time we'll have a hundred members and that'll be like amazing."}, {"time": 2929, "text": "Whereas now we have, you know, over four thousand and one and a half billion dollars pledged."}, {"time": 2934, "text": "That's just unimaginable to me at the time when I was first kind of getting this, you know, getting the stuff off the ground."}, {"time": 2942, "text": "So can we talk about poverty and the biggest problems that you think in the near term effective altruism can attack in each one."}, {"time": 2955, "text": "So poverty obviously is a huge one."}, {"time": 2958, "text": "How can we help?"}, {"time": 2962, "text": "So poverty, absolutely this huge problem."}, {"time": 2964, "text": "700 million people in extreme poverty living in less than two dollars per day where that's what that means is what two dollars would buy in the US."}, {"time": 2974, "text": "So think about that."}, {"time": 2976, "text": "It's like some rice, maybe some beans."}, {"time": 2978, "text": "It's very, you know, really not much."}, {"time": 2980, "text": "And at the same time, we can do an enormous amount to improve the lives of people in extreme poverty."}, {"time": 2987, "text": "So the things that we tend to focus on interventions in global health and that's for a couple of few reasons."}, {"time": 2994, "text": "One is like global health just has this amazing track record life expectancy globally is up 50% relative to 60 or 70 years ago."}, {"time": 3002, "text": "We've eradicated smallpox that's which killed 2 million lives every year almost eradicated polio."}, {"time": 3008, "text": "Second is that we just have great data on what works when it comes to global health."}, {"time": 3014, "text": "So we just know that bed nets protect children from prevent them from dying from malaria."}, {"time": 3021, "text": "And then the third is just that's extremely cost effective."}, {"time": 3026, "text": "So it costs $5 to buy one bed net, protects two children for two years against malaria."}, {"time": 3031, "text": "If you spend about $3,000 on bed nets, then statistically speaking, you're going to save a child's life."}, {"time": 3037, "text": "And there are other interventions too."}, {"time": 3040, "text": "And so given the people in such suffering and we have this opportunity to, you know, do such huge good for such low cost."}, {"time": 3050, "text": "Well, yeah, why not?"}, {"time": 3052, "text": "So the individual."}, {"time": 3053, "text": "So for me today, if I wanted to look at poverty, how would I help?"}, {"time": 3059, "text": "And I wanted to say, I think donating 10% of your income is a very interesting idea or some percentage or some setting a bar and sort of sticking to it."}, {"time": 3069, "text": "How do we then take the step towards the effective part?"}, {"time": 3074, "text": "So you've conveyed some notions, but who do you give the money to?"}, {"time": 3081, "text": "So GiveWell, this organization I mentioned, well, it makes charity recommendations and some of its top recommendations."}, {"time": 3089, "text": "So Against Malaria Foundation is this organization that buys and distributes these insecticide seeded bed nets."}, {"time": 3097, "text": "And then it has a total of seven charities that it recommends very highly."}, {"time": 3101, "text": "So that recommendation, is it almost like a star of approval or is there some metrics?"}, {"time": 3108, "text": "So what are the ways that GiveWell conveys that this is a great charity organization?"}, {"time": 3118, "text": "So GiveWell is looking at metrics and it's trying to compare charities ultimately in the number of lives that you can save or an equivalent benefit."}, {"time": 3127, "text": "So one of the charities it recommends is GiveDirectly, which simply just transfers cash to the poorest families where poor family will get a cash transfer of $1,000 and they kind of regard that as the baseline intervention because it's so simple and people, you know, they know what to do with how to benefit themselves."}, {"time": 3147, "text": "That's quite powerful, by the way."}, {"time": 3150, "text": "So before GiveWell, before the Effective Altruism Movement, was there, I imagine there's a huge amount of corruption, funny enough, in charity organizations or misuse of money."}, {"time": 3163, "text": "So there was nothing like GiveWell before that?"}, {"time": 3166, "text": "I mean, there were some."}, {"time": 3167, "text": "So, I mean, the charity corruption, I mean, obviously there's some, I don't think it's a huge issue."}, {"time": 3173, "text": "They're also just focusing on the long things."}, {"time": 3173, "text": "Prior to GiveWell, there were some organizations like Charity Navigator, which were more aimed at worrying about corruption and so on."}, {"time": 3184, "text": "So they weren't saying, these are the charities where you're going to do the most good."}, {"time": 3187, "text": "Instead, it was like, how good are the charities financials?"}, {"time": 3192, "text": "How good is its health?"}, {"time": 3194, "text": "Are they transparent?"}, {"time": 3194, "text": "And yeah, so that would be more useful for weeding out some of those worst charities."}, {"time": 3199, "text": "So GiveWell has just taken a step further, sort of in this 21st century of data."}, {"time": 3205, "text": "It's actually looking at the effective part."}, {"time": 3208, "text": "So it's like, you know, if you know the wire cutter for if you want to buy a pair of headphones, they will just look at all the headphones and be like, these are the best headphones you can buy."}, {"time": 3217, "text": "That's the idea with GiveWell."}, {"time": 3219, "text": "So do you think there's a bar of what suffering is?"}, {"time": 3224, "text": "And do you think one day we can eradicate suffering in our world?"}, {"time": 3229, "text": "Amongst humans?"}, {"time": 3230, "text": "Let's talk humans for now."}, {"time": 3230, "text": "Talk humans."}, {"time": 3232, "text": "But in general, yeah, actually."}, {"time": 3235, "text": "So there's a colleague of mine calling the term abolitionism for the idea that we should just be trying to abolish suffering."}, {"time": 3242, "text": "And in the long run, I mean, I don't expect to anytime soon, but I think we can."}, {"time": 3249, "text": "I think that would require, you know, quite change, quite drastic changes to the way society is structured and perhaps even the, you know, the human, in fact, even changes to human nature."}, {"time": 3261, "text": "But I do think that suffering whenever it occurs is bad and we should want it to not occur."}, {"time": 3268, "text": "So there's a line."}, {"time": 3271, "text": "There's a gray area between suffering."}, {"time": 3273, "text": "Now I'm Russian."}, {"time": 3274, "text": "So I romanticize some aspects of suffering."}, {"time": 3278, "text": "There's a gray line between struggle, gray area between struggle and suffering."}, {"time": 3282, "text": "So one, do we want to eradicate all struggle in the world?"}, {"time": 3291, "text": "So there's an idea, you know, that the human condition inherently has suffering in it and it's a creative force."}, {"time": 3304, "text": "It's a struggle of our lives and we somehow grow from that."}, {"time": 3309, "text": "How do you think about, how do you think about that?"}, {"time": 3313, "text": "I agree that's true."}, {"time": 3315, "text": "So, you know, often, you know, great artists can be also suffering from, you know, major health conditions or depression and so on."}, {"time": 3324, "text": "They come from abusive parents."}, {"time": 3326, "text": "Most great artists, I think, come from abusive parents."}, {"time": 3329, "text": "Yeah, that seems to be at least commonly the case, but I want to distinguish between suffering as being instrumentally good, you know, it causes people to produce good things and whether it's intrinsically good and I think intrinsically it's always bad."}, {"time": 3344, "text": "And so if we can produce these, you know, great achievements via some other means where, you know, if we look at the scientific enterprise, we've produced incredible things often from people who aren't suffering, have, you know, pretty good lives."}, {"time": 3360, "text": "They're just, they're driven instead of, you know, being pushed by a certain sort of anguish."}, {"time": 3364, "text": "They're being driven by intellectual curiosity."}, {"time": 3366, "text": "If we can instead produce a society where it's all cavet and no stick, that's better from my perspective."}, {"time": 3374, "text": "Yeah, but I'm going to disagree with the notion that that's possible, but I would say most of the suffering in the world is not productive."}, {"time": 3383, "text": "So I would dream of effective altruism curing that suffering."}, {"time": 3388, "text": "Yeah, but then I would say that there is some suffering that is productive that we want to keep the because but that's not even the focus of because most of the suffering is just absurd and needs to be eliminated."}, {"time": 3404, "text": "So let's not even romanticize this usual notion I have, but nevertheless struggle has some kind of inherent value that to me at least, you're right."}, {"time": 3416, "text": "There's some elements of human nature that also have to be modified in order to cure all suffering."}, {"time": 3421, "text": "Yeah, I mean, there's an interesting question of whether it's possible."}, {"time": 3424, "text": "So at the moment, you know, most of the time we're kind of neutral and then we burn ourselves and that's negative and that's really good that we get that negative signal because it means we won't burn ourselves again."}, {"time": 3435, "text": "There's a question like could you design agents humans such that you're not hovering around the zero level you're hovering it like bliss."}, {"time": 3444, "text": "Yeah, and then you touch the flame and you're like, oh no, you're just slightly worse bliss."}, {"time": 3448, "text": "Yeah, but that's really bad compared to the bliss you were normally in so that you can have like a gradient of bliss instead of like pain and pleasure on that point."}, {"time": 3457, "text": "I think it's a really important point on the experience of suffering the relative nature of it."}, {"time": 3466, "text": "Maybe having grown up in the Soviet Union were quite poor by any measure and when I when I was in my childhood, but it didn't feel like you're poor because everybody around you were poor there's a and then in America, I feel I for the first time begin to feel poor."}, {"time": 3489, "text": "Yeah, because of the road there's different."}, {"time": 3491, "text": "There's some cultural aspects to it that really emphasize that it's good to be rich."}, {"time": 3497, "text": "And then there's just the notion that there is a lot of income inequality and therefore you experience that inequality."}, {"time": 3503, "text": "That's where suffering go."}, {"time": 3504, "text": "Do you so what do you think about the inequality of suffering that that we have to think about do you think we have to think about that as part of effective altruism?"}, {"time": 3517, "text": "Yeah, I think we're just things vary in terms of whether you get benefits or costs from them just in relative terms or in absolute terms."}, {"time": 3526, "text": "So a lot of the time yeah, there's this hedonic treadmill where if you get you know, there's money is useful because it helps you buy things or good for you because it helps you buy things, but there's also a status component too and that status component is kind of zero sum if you were saying like in Russia, you know, no one else felt poor because everyone around you is poor."}, {"time": 3553, "text": "Whereas now you've got this these other people who are you know super rich and maybe that makes you feel."}, {"time": 3562, "text": "You know less good about yourself."}, {"time": 3564, "text": "There are some other things however, which are just intrinsically good or bad."}, {"time": 3568, "text": "So commuting for example, it's just people hate it."}, {"time": 3573, "text": "It doesn't really change knowing the other people are commuting to doesn't make it any any kind of less bad, but it's sort of to push back on that for a second."}, {"time": 3582, "text": "I mean, yes, but also if some people were, you know on horseback your commute on the train might feel a lot better."}, {"time": 3592, "text": "Yeah, you know the there is a relative Nick."}, {"time": 3595, "text": "I mean everybody's complaining about society today forgetting it's forgetting how much better is the better angels of our nature how the technologies improve fundamentally improving most of the world's lives."}, {"time": 3609, "text": "Yeah, and actually there's some psychological research on the well being benefits of volunteering where people who volunteer tend to just feel happier about their lives and one of the suggested explanations is it because it extends your reference class."}, {"time": 3625, "text": "So no longer you comparing yourself to the Joneses who have their slightly better car because you realize that you know people in much worse conditions than you and so now, you know your life doesn't seem so bad."}, {"time": 3637, "text": "That's actually on the psychological level."}, {"time": 3639, "text": "One of the fundamental benefits of effective altruism."}, {"time": 3642, "text": "Yeah is is I mean, I guess it's the altruism part of effective altruism is exposing yourself to the suffering in the world allows you to be more."}, {"time": 3655, "text": "Yeah happier and actually allows you in the sort of meditative introspective way realize that you don't need most of the wealth you have to to be happy."}, {"time": 3668, "text": "I mean, I think effective options have been this huge benefit for me and I really don't think that if I had more money that I was living on that that would change my level of well being at all."}, {"time": 3678, "text": "Whereas engaging in something that I think is meaningful that I think is stealing humanity in a positive direction."}, {"time": 3685, "text": "That's extremely rewarding."}, {"time": 3687, "text": "And so yeah, I mean despite my best attempts at sacrifice."}, {"time": 3692, "text": "Um, I don't you know, I think I've actually ended up happier as a result of engaging in effective altruism than I would have done."}, {"time": 3698, "text": "That's such an interesting idea."}, {"time": 3700, "text": "Yeah, so let's let's talk about animal welfare."}, {"time": 3703, "text": "Sure, easy question."}, {"time": 3706, "text": "Yeah, especially as it has to do with the capacity to suffer."}, {"time": 3710, "text": "I think there seems to be a connection between how conscious something is the amount of consciousness and stability to suffer and that all comes into play about us thinking how much suffering there's in the world with regard to animals."}, {"time": 3725, "text": "So how do you think about animal welfare and consciousness?"}, {"time": 3729, "text": "Well consciousness easy question."}, {"time": 3731, "text": "Um, yeah, I mean, I think we don't have a good understanding of consciousness."}, {"time": 3734, "text": "My best guess is it's got and by consciousness."}, {"time": 3737, "text": "I'm meaning what it is feels like to be you the subjective experience that's seems to be different from everything else we know about in the world."}, {"time": 3746, "text": "Yeah, I think it's clear."}, {"time": 3747, "text": "It's very poorly understood at the moment."}, {"time": 3749, "text": "I think it has something to do with information processing."}, {"time": 3752, "text": "So the fact that the brain is a computer or something like a computer."}, {"time": 3756, "text": "So that would mean that very advanced AI could be conscious of information processors in general could be conscious with some suitable complexity, but that also some suitable complexity."}, {"time": 3769, "text": "It's a question whether greater complexity creates some kind of greater consciousness which relates to animals."}, {"time": 3775, "text": "Is there if it's an information processing system and it's smaller and smaller is an ant less conscious than a cow less conscious than a monkey."}, {"time": 3786, "text": "Yeah, and again this super hard question, but I think my best guess is yes, like if you if I think well consciousness, it's not some magical thing that appears out of nowhere."}, {"time": 3797, "text": "It's not you know, Descartes thought it was just comes in from this other realm and then enters through the pineal gland in your brain and that's kind of soul and it's conscious."}, {"time": 3808, "text": "So it's got something to do with what's going on in your brain."}, {"time": 3810, "text": "A chicken has one three hundredth of the size of the brain that you have ants."}, {"time": 3816, "text": "I don't know how small it is."}, {"time": 3817, "text": "Maybe it's a millionth the size my best guess which I may well be wrong about because this is so hard is that in some relevant sense the chicken is experiencing consciousness to a less degree than the human and the ants significantly less again."}, {"time": 3832, "text": "I don't think it's as little as three hundredth as much."}, {"time": 3835, "text": "I think there's everyone who's ever seen a chicken that's there's evolutionary reasons for thinking that like the ability to feel pain comes on the scene relatively early on and we have lots of our brain that's dedicated stuff that doesn't seem to have to do in anything to do with consciousness language processing and so on."}, {"time": 3853, "text": "So it seems like the easy so there's a lot of complicated questions there that we can't ask the animals about but it seems that there is easy questions in terms of suffering which is things like factory farming that could be addressed."}, {"time": 3869, "text": "Yeah, is that is that the lowest hanging fruit?"}, {"time": 3872, "text": "If I may use crude terms here of animal welfare."}, {"time": 3877, "text": "I think that's the lowest hanging fruit."}, {"time": 3879, "text": "So at the moment we kill we raise and kill about 50 billion animals every year."}, {"time": 3884, "text": "So how many 50 billion in?"}, {"time": 3888, "text": "Yeah, so for every human on the planet several times that number of being killed and the vast majority of them are raised in factory farms where basically whatever your view on animals, I think you should agree even if you think well, maybe it's not bad to kill an animal."}, {"time": 3903, "text": "Maybe if the animal was raised in good conditions, that's just not the empirical reality."}, {"time": 3907, "text": "The empirical reality is that they are kept in incredible cage confinement."}, {"time": 3912, "text": "They are de beaked or detailed without an aesthetic, you know chickens often peck each other to death other like otherwise because of them such stress."}, {"time": 3923, "text": "It's really, you know, I think when a chicken gets killed that's the best thing that happened to the chicken in the course of its life and it's also completely unnecessary."}, {"time": 3932, "text": "This is in order to save, you know a few pence for the price of meat or price of eggs and we have indeed found it's also just inconsistent with consumer preference as well people who buy the products if they could they all they when you do surveys are extremely against suffering in factory farms."}, {"time": 3952, "text": "It's just they don't appreciate how bad it is and you know, just tend to go with easy options."}, {"time": 3957, "text": "And so then the best the most effective programs I know of at the moment are nonprofits that go to companies and work with companies to get them to take a pledge to cut certain sorts of animal products like eggs from cage confinement out of their supply chain."}, {"time": 3974, "text": "And it's now the case that the top 50 food retailers and fast food companies have all made these kind of cage free pledges and when you do the numbers you get the conclusion that every dollar you're giving to these nonprofits result in hundreds of chickens being spared from cage confinement."}, {"time": 3993, "text": "And then they're working to other other types of animals other products too."}, {"time": 3999, "text": "So is that the most effective way to do in have a ripple effect essentially it's supposed to directly having regulation from on top that says you can't do this."}, {"time": 4011, "text": "So I would be more open to the regulation approach, but at least in the US there's quite intense regulatory capture from the agricultural industry."}, {"time": 4021, "text": "And so attempts that we've seen to try and change regulation have it's been a real uphill struggle."}, {"time": 4028, "text": "There are some examples of ballot initiatives where the people have been able to vote in a ballot to say we want to ban eggs from cage conditions and that's been huge."}, {"time": 4039, "text": "That's been really good, but beyond that it's much more limited."}, {"time": 4042, "text": "So I've been really interested in the idea of hunting in general and wild animals and seeing nature as a form of cruelty that I am ethically more okay with."}, {"time": 4061, "text": "Okay, just from my perspective and then I read about wild animal suffering that I'm just I'm just giving you the kind of yeah notion of how I felt because animal because animal factory farming is so bad."}, {"time": 4077, "text": "Yeah that living in the woods seem good."}, {"time": 4080, "text": "Yeah, and yet when you actually start to think about it all I mean all of the animals in the animal world the living in like terrible poverty, right?"}, {"time": 4091, "text": "Yeah, so you have all the medical conditions all of that."}, {"time": 4095, "text": "I mean they're living horrible lives."}, {"time": 4097, "text": "It could be improved."}, {"time": 4098, "text": "That's a really interesting notion that I think may not even be useful to talk about because factory farming is such a big thing to focus on."}, {"time": 4106, "text": "Yeah, but it's nevertheless an interesting notion to think of all the animals in the wild as suffering in the same way that humans in poverty are suffering."}, {"time": 4114, "text": "Yeah, I mean and often even worse so many animals we produce by our selection."}, {"time": 4119, "text": "So you have a very large number of children in the expectation that only a small number survive."}, {"time": 4126, "text": "And so for those animals almost all of them just live short lives where they starve to death."}, {"time": 4133, "text": "So yeah, there's huge amounts of suffering in nature that I don't think we should you know pretend that it's this kind of wonderful paradise for most animals."}, {"time": 4144, "text": "Yeah, their life is filled with hunger and fear and disease."}, {"time": 4150, "text": "Yeah, I did agree with you entirely that when it comes to focusing on animal welfare, we should focus in factory farming, but we also yeah should be aware to the reality of what life for most animals is like."}, {"time": 4162, "text": "So let's talk about a topic I've talked a lot about and you've actually quite eloquently talked about which is the third priority that effective altruism considers is really important is existential risks."}, {"time": 4177, "text": "Yeah, when you think about the existential risks that are facing our civilization, what's before us?"}, {"time": 4185, "text": "What concerns you?"}, {"time": 4186, "text": "What should we be thinking about from in the especially from an effective altruism perspective?"}, {"time": 4191, "text": "So the reason I started getting concerned about this was thinking about future generations where the key idea is just well future people matter morally."}, {"time": 4203, "text": "There are vast numbers of future people."}, {"time": 4205, "text": "If we don't cause our own extinction, there's no reason why civilization might not last a million years."}, {"time": 4211, "text": "I mean we last as long as a typical mammalian species or a billion years is when the Earth is no longer habitable or if we can take to the stars then perhaps it's trillions of years beyond that."}, {"time": 4223, "text": "So the future could be very big indeed and it seems like we're potentially very early on in civilization."}, {"time": 4229, "text": "Then the second idea is just well, maybe there are things that are going to really derail that things that actually could prevent us from having this long wonderful civilization and instead could cause our own cause our own extinction or otherwise perhaps like lock ourselves into a very bad state."}, {"time": 4248, "text": "And what ways could that happen?"}, {"time": 4253, "text": "Well causing our own extinction development of nuclear weapons in the 20th century at least put on the table that we now had weapons that were powerful enough that you could very significantly destroy society perhaps and all that nuclear war would cause a nuclear winter."}, {"time": 4269, "text": "Perhaps that would be enough for the human race to go extinct."}, {"time": 4274, "text": "Why do you think we haven't done it?"}, {"time": 4278, "text": "Why do you think we haven't done it yet?"}, {"time": 4279, "text": "Is it surprising to you that having, you know, always for the past few decades several thousand of active ready to launch nuclear weapons warheads and yet we have not launched them ever since the initial launch on Hiroshima and Nagasaki."}, {"time": 4302, "text": "I think it's a mix of luck."}, {"time": 4306, "text": "So I think it's definitely not inevitable that we haven't used them."}, {"time": 4309, "text": "So John F. Kennedy, general Cuban Missile Crisis put the estimate of nuclear exchange between the US and USSR that somewhere between one and three and even so, you know, we really did come close."}, {"time": 4323, "text": "At the same time, I do think mutually assured destruction is a reason why people don't go to war."}, {"time": 4328, "text": "It would be, you know, why nuclear powers don't go to war."}, {"time": 4331, "text": "Do you think that holds if you can linger on that for a second, like my dad is a physicist amongst other things and he believes that nuclear weapons are actually just really hard to build which is one of the really big benefits of them currently so that you don't have it's very hard if you're crazy to build to acquire a nuclear weapon."}, {"time": 4358, "text": "So the mutually shared destruction really works when you talk seems to work better when it's nation states, when it's serious people, even if they're a little bit, you know, dictatorial and so on."}, {"time": 4372, "text": "Do you think this mutually sure destruction idea will carry how far will it carry us in terms of different kinds of weapons?"}, {"time": 4382, "text": "Oh, yeah, I think it's your point that nuclear weapons are very hard to build and relatively easy to control because you can control fissile material is a really important one and future technology that's equally destructive might not have those properties."}, {"time": 4398, "text": "So for example, if in the future people are able to design viruses, perhaps using a DNA printing kit that's on that, you know, one can just buy."}, {"time": 4411, "text": "In fact, there are companies in the process of creating home DNA printing kits."}, {"time": 4417, "text": "Well, then perhaps that's just totally democratized."}, {"time": 4424, "text": "Perhaps the power to reap huge destructive potential is in the hands of most people in the world or certainly most people with effort and then yeah, I no longer trust mutually assured destruction because some for some people the idea that they would die is just not a disincentive."}, {"time": 4443, "text": "There was a Japanese cult, for example."}, {"time": 4445, "text": "Ohm Shinrikyo in the 90s that had they what they believed was that Armageddon was coming if you died before Armageddon, you would get good karma."}, {"time": 4457, "text": "You wouldn't go to hell if you died during Armageddon."}, {"time": 4460, "text": "Maybe you would go to hell and they had a biological weapons program chemical weapons program when they were finally apprehended."}, {"time": 4469, "text": "They hadn't stocks of southern gas that were sufficient to kill 4 million people engaged in multiple terrorist acts."}, {"time": 4476, "text": "If they had had the ability to print a virus at home, that would have been very scary."}, {"time": 4482, "text": "So it's not impossible to imagine groups of people that hold that kind of belief of death as suicide as a good thing for passage into the next world and so on and then connect them with some weapons then ideology and weaponry may create serious problems for us."}, {"time": 4507, "text": "Let me ask you a quick question on what do you think is the line between killing most humans and killing all humans?"}, {"time": 4514, "text": "How hard is it to kill everybody?"}, {"time": 4517, "text": "Yeah, have you thought about this?"}, {"time": 4519, "text": "I've thought about it a bit."}, {"time": 4520, "text": "I think it is very hard to kill everybody."}, {"time": 4522, "text": "So in the case of let's say an all out nuclear exchange and let's say that leads to nuclear winter."}, {"time": 4528, "text": "We don't really know but we you know might well happen that would I think result in billions of deaths would it kill everybody?"}, {"time": 4539, "text": "It's quite it's quite hard to see how that how it would kill everybody for a few reasons."}, {"time": 4545, "text": "One is just those are so many people."}, {"time": 4547, "text": "Yes, you know seven and a half billion people."}, {"time": 4549, "text": "So this bad event has to kill all you know, all almost all of them."}, {"time": 4554, "text": "Secondly live in such a diversity of locations."}, {"time": 4557, "text": "So a nuclear exchange or the virus that has to kill people who live in the coast of New Zealand which is going to be climatically much more stable than other areas in the world or people who are on submarines or who have access to bunkers."}, {"time": 4575, "text": "So there's a very like there's just like I'm sure there's like two guys in Siberia just badass."}, {"time": 4580, "text": "There's the just human nature somehow just perseveres."}, {"time": 4585, "text": "Yeah, and then the second thing is just if there's some catastrophic event people really don't want to die."}, {"time": 4591, "text": "So there's going to be like, you know, huge amounts of effort to ensure that it doesn't affect everyone."}, {"time": 4597, "text": "Have you thought about what it takes to rebuild a society with smaller smaller numbers like how big of a setback these kinds of things are?"}, {"time": 4607, "text": "Yeah, so then that's something where there's real uncertainty I think where at some point you just lose genetic sufficient genetic diversity such that you can't come back."}, {"time": 4618, "text": "There's it's unclear how small that population is."}, {"time": 4623, "text": "But if you've only got say a thousand people or fewer than a thousand, then maybe that's small enough."}, {"time": 4629, "text": "What about human knowledge and then there's human knowledge."}, {"time": 4634, "text": "I mean, it's striking how short on geological timescales or evolutionary timescales the progress in or how quickly the progress in human knowledge has been like agriculture."}, {"time": 4646, "text": "We only invented in 10,000 BC cities were only, you know, 3000 BC whereas typical mammal species is half a million years to a million years."}, {"time": 4657, "text": "Do you think it's inevitable in some sense agriculture everything that came the Industrial Revolution cars planes the internet that level of innovation you think is inevitable."}, {"time": 4670, "text": "I think given how quickly it arose."}, {"time": 4675, "text": "So in the case of agriculture, I think that was dependent on climate."}, {"time": 4678, "text": "So it was the kind of glacial period was over the earth warmed up a bit that made it much more likely that humans would develop agriculture when it comes to the Industrial Revolution."}, {"time": 4694, "text": "It's just you know, again only took a few thousand years from cities to Industrial Revolution if we think okay, we've gone back to this even let's say agricultural era, but there's no reason why we wouldn't go extinct in the coming tens of thousands of years or hundreds of thousands of years."}, {"time": 4713, "text": "It seems just vet."}, {"time": 4714, "text": "It would be very surprising if we didn't rebound unless there's some special reason that makes things different."}, {"time": 4720, "text": "So perhaps we just have a much greater like disease burden now so HIV exists."}, {"time": 4726, "text": "It didn't exist before and perhaps that's kind of latent and you know and being suppressed by modern medicine and sanitation and so on but would be a much bigger problem for some, you know, utterly destroyed the society that was trying to rebound or there's just maybe there's something we don't know about."}, {"time": 4747, "text": "So another existential risk comes from the mysterious the beautiful artificial intelligence."}, {"time": 4757, "text": "So what what's the shape of your concerns about AI?"}, {"time": 4762, "text": "I think there are quite a lot of concerns about AI and sometimes the different risks don't get distinguished enough."}, {"time": 4770, "text": "So the kind of classic worry most is closely associated with Nick Bostrom and Elias Joukowski is that we at some point move from having narrow AI systems to artificial general intelligence."}, {"time": 4784, "text": "You get this very fast feedback effect where AGI is able to build, you know, artificial intelligence helps you to build greater artificial intelligence."}, {"time": 4793, "text": "We have this one system that suddenly very powerful far more powerful than others than perhaps far more powerful than, you know, the rest of the world combined and then secondly, it has goals that are misaligned with human goals."}, {"time": 4810, "text": "And so it pursues its own goals."}, {"time": 4813, "text": "It realize, hey, there's this competition namely from humans."}, {"time": 4816, "text": "It would be better if we eliminated them in just the same way as homo sapiens eradicated the Neanderthals."}, {"time": 4822, "text": "In fact, it in fact killed off most large animals on the planet that walk the planet."}, {"time": 4828, "text": "So that's kind of one set of worries."}, {"time": 4832, "text": "I think that's not my I think these shouldn't be dismissed as science fiction."}, {"time": 4841, "text": "I think it's something we should be taking very seriously, but it's not the thing you visualize when you're concerned about the biggest near term."}, {"time": 4849, "text": "Yeah, I think it's I think it's like one possible scenario that would be astronomically bad."}, {"time": 4855, "text": "I think that other scenarios that would also be extremely bad comparably bad that are more likely to occur."}, {"time": 4861, "text": "So one is just we are able to control AI."}, {"time": 4865, "text": "So we're able to get it to do what we want it to do."}, {"time": 4870, "text": "And perhaps there's not like this fast takeoff of AI capabilities within a single system."}, {"time": 4874, "text": "It's distributed across many systems that do somewhat different things, but you do get very rapid economic and technological progress as a result that concentrates power into the hands of a very small number of individuals, perhaps a single dictator."}, {"time": 4889, "text": "And secondly, that single individual is or small group of individuals or single country is then able to like lock in their values indefinitely via transmitting those values to artificial systems that have no reason to die like, you know, their code is copyable."}, {"time": 4909, "text": "Perhaps, you know, Donald Trump or Xi Jinping creates their kind of AI progeny in their own image."}, {"time": 4913, "text": "And once you have a system that's once you have a society that's controlled by AI, you no longer have one of the main drivers of change historically, which is the fact that human lifespans are you know, only a hundred years give or take."}, {"time": 4933, "text": "So as opposed to sort of killing off all humans is locking in creating a hell on earth, basically a set of principles under which the society operates that's extremely undesirable."}, {"time": 4948, "text": "So everybody is suffering indefinitely."}, {"time": 4951, "text": "Or it doesn't, I mean, it also doesn't need to be hell on earth."}, {"time": 4953, "text": "It could just be the long values."}, {"time": 4955, "text": "So we talked at the very beginning about how I want to see this kind of diversity of different values and exploration so that we can just work out what is kind of morally like what is good, what is bad and then pursue the thing that's bad."}, {"time": 4969, "text": "So actually, so the idea of wrong values is actually probably the beautiful thing is there's no such thing as right and wrong values because we don't know the right answer."}, {"time": 4981, "text": "We just kind of have a sense of which value is more right, which is more wrong."}, {"time": 4986, "text": "So any kind of lock in makes a value wrong because it prevents exploration of this kind."}, {"time": 4993, "text": "Yeah, and just, you know, imagine if fascist value, you know, imagine if there was Hitler's utopia or Stalin's utopia or Donald Trump's or Xi Jinping's forever."}, {"time": 5004, "text": "Yeah, you know, how good or bad would that be compared to the best possible future we could create?"}, {"time": 5008, "text": "And my suggestion is it would really suck compared to the best possible future we could create."}, {"time": 5017, "text": "And you're just one individual."}, {"time": 5018, "text": "There's some individuals for whom Donald Trump is perhaps the best possible future."}, {"time": 5026, "text": "And so that's the whole point of us individuals exploring the space together."}, {"time": 5031, "text": "Yeah, and what's trying to figure out which is the path that will make America great again."}, {"time": 5038, "text": "So how can effective altruism help?"}, {"time": 5043, "text": "I mean, this is a really interesting notion they actually describing of artificial intelligence being used as extremely powerful technology in the hands of very few potentially one person to create some very undesirable effect."}, {"time": 5057, "text": "So as opposed to AI and again, the source of the undesirableness there is the human."}, {"time": 5063, "text": "Yeah, AI is just a really powerful tool."}, {"time": 5066, "text": "So whether it's that or whether AI's AGI just runs away from us completely."}, {"time": 5071, "text": "How as individuals, as people in the effective altruism movement, how can we think about something like this?"}, {"time": 5081, "text": "I understand poverty and animal welfare, but this is a far out incredibly mysterious and difficult problem."}, {"time": 5087, "text": "Well, I think there's three paths as an individual."}, {"time": 5090, "text": "So if you're thinking about, you know, career paths you can pursue."}, {"time": 5096, "text": "So one is going down the line of technical AI safety."}, {"time": 5099, "text": "So this is most relevant to the kind of AI winning AI taking over scenarios where this is just technical work on current machine learning systems often sometimes going more theoretical to on how we can ensure that an AI is able to learn human values and able to act in the way that you want it to act."}, {"time": 5121, "text": "And that's a pretty mainstream issue and approach in machine learning today."}, {"time": 5127, "text": "So, you know, we definitely need more people doing that."}, {"time": 5131, "text": "Second is on the policy side of things, which I think is even more important at the moment, which is how should developments in AI be managed on a political level?"}]}]