[{"title": "Oriol Vinyals: Deep Learning and Artificial General Intelligence | Lex Fridman Podcast #306", "id": "aGBLRlLe7X8", "quotes": [{"time": 378, "text": "So it has a backstory it told itself that it sticks to."}, {"time": 382, "text": "It has memories, not in terms of how the system is designed, but it's able to tell stories about its past."}, {"time": 390, "text": "It's able to have mortality and fear of mortality in the following way that it has an identity."}, {"time": 399, "text": "And if it says something stupid and gets canceled on Twitter, that's the end of that system."}, {"time": 404, "text": "So it's not like you get to rebrand yourself."}, {"time": 407, "text": "That system is, that's it."}, {"time": 409, "text": "So maybe the high stakes nature of it, because you can't say anything stupid now, or because you'd be canceled on Twitter."}, {"time": 417, "text": "And there's stakes to that."}, {"time": 419, "text": "And that I think part of the reason that makes it interesting."}, {"time": 423, "text": "And then you have a perspective, like you've built up over time that you stick with, and then people can disagree with you."}, {"time": 429, "text": "So holding that perspective strongly, holding sort of maybe a controversial, at least a strong opinion."}, {"time": 436, "text": "All of those elements, it feels like they can be learned because it feels like there's a lot of data on the internet of people having an opinion."}, {"time": 444, "text": "And then combine that with a metric of excitement, you can start to create something that, as opposed to trying to optimize for sort of grammatical clarity and truthfulness, the factual consistency over many sentences, you optimize for the humanness."}, {"time": 465, "text": "And there's obviously data for humanness on the internet."}, {"time": 468, "text": "So I wonder if there's a future where that's part, or I mean, I sometimes wonder that about myself."}, {"time": 476, "text": "I'm a huge fan of podcasts, and I listen to some podcasts, and I think like, what is interesting about this?"}, {"time": 483, "text": "What is compelling?"}, {"time": 485, "text": "The same way you watch other games."}, {"time": 487, "text": "Like you said, watch, play StarCraft, or have Magnus Carlsen play chess."}, {"time": 493, "text": "So I'm not a chess player, but it's still interesting to me."}, {"time": 496, "text": "That's the stakes of it, maybe the end of a domination of a series of wins."}, {"time": 503, "text": "I don't know, there's all those elements somehow connect to a compelling conversation."}, {"time": 508, "text": "And I wonder how hard is that to replace, because ultimately all of that connects to the initial proposition of how to test, whether an AI is intelligent or not with the Turing test, which I guess my question comes from a place of the spirit of that test."}, {"time": 523, "text": "Yes, I actually recall, I was just listening to our first podcast where we discussed Turing test."}, {"time": 530, "text": "So I would say from a neural network, AI builder perspective, there's usually you try to map many of these interesting topics you discuss to benchmarks, and then also to actual architectures on the how these systems are currently built, how they learn, what data they learn from, what are they learning, right?"}, {"time": 591, "text": "Going back to my passion, like sequences of words, letters, images, sound, there's more modalities here to be at play."}, {"time": 599, "text": "And then you're trying to just learn a function that will be happy, that maximizes the likelihood of seeing all these through a neural network."}, {"time": 610, "text": "Now, I think there's a few places where the way currently we train these models would clearly lack to be able to develop the kinds of capabilities you save."}, {"time": 622, "text": "I'll tell you maybe a couple."}, {"time": 623, "text": "One is the lifetime of an agent or a model."}, {"time": 627, "text": "So you learn from this data offline, right?"}, {"time": 630, "text": "So you're just passively observing and maximizing these, it's almost like a mountains, like a landscape of mountains, and then everywhere there's data that humans interacted in this way, you're trying to make that higher and then lower where there's no data."}, {"time": 645, "text": "And then these models generally don't then experience themselves."}, {"time": 651, "text": "They just are observers, right?"}, {"time": 652, "text": "They're passive observers of the data."}, {"time": 654, "text": "And then we're putting them to then generate data when we interact with them, but that's very limiting."}, {"time": 660, "text": "The experience they actually experience when they could maybe be optimizing or further optimizing the weights, we're not even doing that."}, {"time": 668, "text": "So to be clear, and again, mapping to AlphaGo, AlphaStar, we train the model."}, {"time": 675, "text": "And when we deploy it to play against humans, or in this case interact with humans, like language models, they don't even keep training, right?"}, {"time": 683, "text": "They're not learning in the sense of the weights that you've learned from the data, they don't keep changing."}, {"time": 689, "text": "Now, there's something a bit more feels magical, but it's understandable if you're into Neuronet, which is, well, they might not learn in the strict sense of the words, the weights changing, maybe that's mapping to how neurons interconnect and how we learn over our lifetime."}, {"time": 706, "text": "But it's true that the context of the conversation that takes place when you talk to these systems, it's held in their working memory, right?"}, {"time": 717, "text": "It's almost like you start the computer, it has a hard drive that has a lot of information, you have access to the internet, which has probably all the information, but there's also a working memory where these agents, as we call them, or start calling them, build upon."}, {"time": 733, "text": "Now, this memory is very limited."}, {"time": 736, "text": "I mean, right now we're talking, to be concrete, about 2,000 words that we hold, and then beyond that, we start forgetting what we've seen."}, {"time": 744, "text": "So you can see that there's some short term coherence already, right, with what you said."}, {"time": 749, "text": "I mean, it's a very interesting topic."}, {"time": 752, "text": "Having sort of a mapping, an agent to have consistency, then if you say, oh, what's your name, it could remember that, but then it might forget beyond 2,000 words, which is not that long of context if we think even of these podcast books are much longer."}, {"time": 771, "text": "So technically speaking, there's a limitation there, super exciting from people that work on deep learning to be working on, but I would say we lack maybe benchmarks and the technology to have this lifetime like experience of memory that keeps building up."}, {"time": 790, "text": "However, the way it learns offline is clearly very powerful, right?"}, {"time": 794, "text": "So you asked me three years ago, I would say, oh, we're very far."}, {"time": 798, "text": "I think we've seen the power of this imitation, again, on the internet scale that has enabled this to feel like at least the knowledge, the basic knowledge about the world now is incorporated into the weights, but then this experience is lacking."}, {"time": 816, "text": "And in fact, as I said, we don't even train them when we're talking to them, other than their working memory, of course, is affected."}, {"time": 824, "text": "So that's the dynamic part, but they don't learn in the same way that you and I have learned, right?"}, {"time": 830, "text": "From basically when we were born and probably before."}, {"time": 834, "text": "So lots of fascinating, interesting questions you asked there."}, {"time": 837, "text": "I think the one I mentioned is this idea of memory and experience versus just kind of observe the world and learn its knowledge, which I think for that, I would argue lots of recent advancements that make me very excited about the field."}, {"time": 853, "text": "And then the second maybe issue that I see is all these models, we train them from scratch."}, {"time": 861, "text": "That's something I would have complained three years ago or six years ago or 10 years ago."}, {"time": 866, "text": "And it feels if we take inspiration from how we got here, how the universe evolved us and we keep evolving, it feels that is a missing piece, that we should not be training models from scratch every few months, that there should be some sort of way in which we can grow models much like as a species and many other elements in the universe is building from the previous sort of iterations."}, {"time": 895, "text": "And that from a just purely neural network perspective, even though we would like to make it work, it's proven very hard to not throw away the previous weights, right?"}, {"time": 907, "text": "This landscape we learn from the data and refresh it with a brand new set of weights, given maybe a recent snapshot of these data sets we train on, et cetera, or even a new game we're learning."}, {"time": 920, "text": "So that feels like something is missing fundamentally."}, {"time": 924, "text": "We might find it, but it's not very clear how it will look like."}, {"time": 928, "text": "There's many ideas and it's super exciting as well."}, {"time": 930, "text": "Yes, just for people who don't know, when you're approaching a new problem in machine learning, you're going to come up with an architecture that has a bunch of weights and then you initialize them somehow, which in most cases is some version of random."}, {"time": 947, "text": "So that's what you mean by starting from scratch."}, {"time": 949, "text": "And it seems like it's a waste every time you solve the game of Go and chess, StarCraft, protein folding, like surely there's some way to reuse the weights as we grow this giant database of neural networks that have solved some of the toughest problems in the world."}, {"time": 970, "text": "And so some of that is, what is that?"}, {"time": 975, "text": "Methods, how to reuse weights, how to learn, extract what's generalizable or at least has a chance to be and throw away the other stuff."}, {"time": 987, "text": "And maybe the neural network itself should be able to tell you that."}, {"time": 991, "text": "Like what, yeah, how do you, what ideas do you have for better initialization of weights?"}, {"time": 997, "text": "Maybe stepping back, if we look at the field of machine learning, but especially deep learning, right?"}, {"time": 1004, "text": "At the core of deep learning, there's this beautiful idea that is a single algorithm can solve any task, right?"}, {"time": 1039, "text": "I mean, image classification is very clear example, images to maybe one of a thousand categories, that's what ImageNet is like, but many, many, if not all problems can be mapped this way."}, {"time": 1050, "text": "And then there's a generic recipe, right?"}, {"time": 1053, "text": "That you can use."}, {"time": 1055, "text": "And this recipe with very little change, and I think that's the core of deep learning research, right?"}, {"time": 1061, "text": "That what is the recipe that is universal?"}, {"time": 1064, "text": "That for any new given task, I'll be able to use without thinking, without having to work very hard on the problem at stake."}, {"time": 1072, "text": "We have not found this recipe, but I think the field is excited to find less tweaks or tricks that people find when they work on important problems specific to those and more of a general algorithm, right?"}, {"time": 1087, "text": "So at an algorithmic level, I would say we have something general already, which is this formula of training a very powerful model, a neural network on a lot of data."}, {"time": 1097, "text": "And in many cases, you need some specificity to the actual problem you're solving, protein folding being such an important problem has some basic recipe that is learned from before, right?"}, {"time": 1110, "text": "Like transformer models, graph neural networks, ideas coming from NLP, like something called BERT, that is a kind of loss that you can emplace to help the knowledge distillation is another technique, right?"}, {"time": 1126, "text": "So this is the formula."}, {"time": 1127, "text": "We still had to find some particular things that were specific to alpha fold, right?"}, {"time": 1133, "text": "That's very important because protein folding is such a high value problem that as humans, we should solve it no matter if we need to be a bit specific."}, {"time": 1142, "text": "And it's possible that some of these learnings will apply then to the next iteration of this recipe that deep learners are about."}, {"time": 1149, "text": "But it is true that so far, the recipe is what's common, but the weights you generally throw away, which feels very sad."}, {"time": 1157, "text": "Although, maybe in the last, especially in the last two, three years, and when we last spoke, I mentioned this area of meta learning, which is the idea of learning to learn."}, {"time": 1168, "text": "That idea and some progress has been had starting, I would say, mostly from GPT3 on the language domain only, in which you could conceive a model that is trained once."}, {"time": 1181, "text": "And then this model is not narrow in that it only knows how to translate a pair of languages or even a set of or it only knows how to assign sentiment to a sentence."}, {"time": 1191, "text": "These actually, you could teach it by a prompting, it's called, and this prompting is essentially just showing it a few more examples, almost like you do show examples, input, output examples, algorithmically speaking to the process of creating this model."}, {"time": 1206, "text": "But now you're doing it through language, which is very natural way for us to learn from one another."}, {"time": 1211, "text": "I tell you, hey, you should do this new task."}, {"time": 1213, "text": "I'll tell you a bit more."}, {"time": 1214, "text": "Maybe you ask me some questions and now you know the task, right?"}, {"time": 1217, "text": "You didn't need to retrain it from scratch."}, {"time": 1220, "text": "And we've seen these magical moments almost in this way to do few shot promptings through language on language only domain."}, {"time": 1228, "text": "And then in the last two years, we've seen these expanded to beyond language, adding vision, adding actions and games, lots of progress to be had."}, {"time": 1239, "text": "But this is maybe, if you ask me like about how are we gonna crack this problem?"}, {"time": 1243, "text": "This is perhaps one way in which you have a single model."}, {"time": 1248, "text": "The problem of this model is it's hard to grow in weights or capacity, but the model is certainly so powerful that you can teach it some tasks, right?"}, {"time": 1258, "text": "In this way that I teach you, I could teach you a new task now, if we were all at a text based task or a classification of vision style task."}, {"time": 1268, "text": "But it still feels like more breakthroughs should be had, but it's a great beginning, right?"}, {"time": 1274, "text": "We have a good baseline."}, {"time": 1275, "text": "We have an idea that this maybe is the way we want to benchmark progress towards AGI."}, {"time": 1280, "text": "And I think in my view, that's critical to always have a way to benchmark the community sort of converging to these overall, which is good to see."}, {"time": 1289, "text": "And then this is actually what excites me in terms of also next steps for deep learning is how to make these models more powerful, how do you train them, how to grow them if they must grow, should they change their weights as you teach it task or not?"}, {"time": 1306, "text": "There's some interesting questions, many to be answered."}, {"time": 1308, "text": "Yeah, you've opened the door about to a bunch of questions I want to ask, but let's first return to your tweet and read it like a Shakespeare."}, {"time": 1317, "text": "You wrote, God is not the end, it's the beginning."}, {"time": 1321, "text": "And then you wrote meow and then an emoji of a cat."}, {"time": 1326, "text": "So first two questions."}, {"time": 1327, "text": "First, can you explain the meow and the cat emoji?"}, {"time": 1330, "text": "And second, can you explain what Godot is and how it works?"}, {"time": 1333, "text": "Right, indeed."}, {"time": 1334, "text": "I mean, thanks for reminding me that we're all exposing on Twitter and."}, {"time": 1339, "text": "Permanently there."}, {"time": 1340, "text": "Yes, permanently there."}, {"time": 1341, "text": "One of the greatest AI researchers of all time, meow and cat emoji."}, {"time": 1349, "text": "Can you imagine like touring, tweeting, meow and cat, probably he would, probably would."}, {"time": 1355, "text": "So yeah, the tweet is important actually."}, {"time": 1358, "text": "You know, I put thought on the tweets, I hope people."}, {"time": 1360, "text": "Which part do you think?"}, {"time": 1361, "text": "Okay, so there's three sentences."}, {"time": 1364, "text": "Godot is not the end, Godot is the beginning, meow, cat emoji."}, {"time": 1370, "text": "Okay, which is the important part?"}, {"time": 1371, "text": "The meow, no, no."}, {"time": 1373, "text": "Definitely that it is the beginning."}, {"time": 1376, "text": "I mean, I probably was just explaining a bit where the field is going, but let me tell you about Godot."}, {"time": 1383, "text": "So first the name Godot comes from maybe a sequence of releases that DeepMind had that named, like used animal names to name some of their models that are based on this idea of large sequence models."}, {"time": 1399, "text": "Initially they're only language, but we are expanding to other modalities."}, {"time": 1403, "text": "So we had, you know, we had Gopher, Chinchilla, these were language only."}, {"time": 1409, "text": "And then more recently we released Flamingo, which adds vision to the equation."}, {"time": 1415, "text": "And then Godot, which adds vision and then also actions in the mix, right?"}, {"time": 1421, "text": "As we discuss actually actions, especially discrete actions like up, down, left, right."}, {"time": 1427, "text": "I just told you the actions, but they're words."}, {"time": 1429, "text": "So you can kind of see how actions naturally map to sequence modeling of words, which these models are very powerful."}, {"time": 1437, "text": "So Godot was named after, I believe, I can only from memory, right?"}, {"time": 1443, "text": "These, you know, these things always happen with an amazing team of researchers behind."}, {"time": 1448, "text": "So before the release, we had a discussion about which animal would we pick, right?"}, {"time": 1454, "text": "And I think because of the word general agent, right?"}, {"time": 1458, "text": "And this is a property quite unique to Godot."}, {"time": 1461, "text": "We kind of were playing with the GA words and then, you know, Godot."}, {"time": 1466, "text": "Rhymes with cat."}, {"time": 1468, "text": "And Godot is obviously a Spanish version of cat."}, {"time": 1470, "text": "I had nothing to do with it, although I'm from Spain."}, {"time": 1472, "text": "Oh, how do you, wait, sorry."}, {"time": 1473, "text": "How do you say cat in Spanish?"}, {"time": 1474, "text": "Gato."}, {"time": 1475, "text": "Oh, gato, okay."}, {"time": 1476, "text": "Now it all makes sense."}, {"time": 1477, "text": "Okay, okay, I see, I see, I see."}, {"time": 1479, "text": "How do you say meow in Spanish?"}, {"time": 1480, "text": "No, that's probably the same."}, {"time": 1481, "text": "I think you say it the same way, but you write it as M, I, A, U."}, {"time": 1488, "text": "Okay, it's universal."}, {"time": 1490, "text": "All right, so then how does the thing work?"}, {"time": 1491, "text": "So you said general is, so you said language, vision."}, {"time": 1497, "text": "And action."}, {"time": 1499, "text": "How does this, can you explain what kind of neural networks are involved?"}, {"time": 1504, "text": "What does the training look like?"}, {"time": 1506, "text": "And maybe what do you, are some beautiful ideas within the system?"}, {"time": 1511, "text": "Yeah, so maybe the basics of Gato are not that dissimilar from many, many work that come."}, {"time": 1519, "text": "So here is where the sort of the recipe, I mean, hasn't changed too much."}, {"time": 1524, "text": "There is a transformer model that's the kind of recurrent neural network that essentially takes a sequence of modalities, observations that could be words, could be vision or could be actions."}, {"time": 1538, "text": "And then its own objective that you train it to do when you train it is to predict what the next anything is."}, {"time": 1546, "text": "And anything means what's the next action."}, {"time": 1548, "text": "If this sequence that I'm showing you to train is a sequence of actions and observations, then you're predicting what's the next action and the next observation, right?"}, {"time": 1557, "text": "So you think of these really as a sequence of bites, right?"}, {"time": 1560, "text": "So take any sequence of words, a sequence of interleaved words and images, a sequence of maybe observations that are images and moves in Atari up, down, left, right."}, {"time": 1574, "text": "And these you just think of them as bites and you're modeling what's the next bite gonna be like."}, {"time": 1580, "text": "And you might interpret that as an action and then play it in a game, or you could interpret it as a word and then write it down if you're chatting with the system and so on."}, {"time": 1592, "text": "So Gato basically can be thought as inputs, images, text, video, actions."}, {"time": 1601, "text": "It also actually inputs some sort of proprioception sensors from robotics because robotics is one of the tasks that it's been trained to do."}, {"time": 1609, "text": "And then at the output, similarly, it outputs words, actions."}, {"time": 1613, "text": "It does not output images, that's just by design, we decided not to go that way for now."}, {"time": 1620, "text": "That's also in part why it's the beginning because there's more to do clearly."}, {"time": 1624, "text": "But that's kind of what the Gato is, is this brain that essentially you give it any sequence of these observations and modalities and it outputs the next step."}, {"time": 1633, "text": "And then off you go, you feed the next step into and predict the next one and so on."}, {"time": 1640, "text": "Now, it is more than a language model because even though you can chat with Gato, like you can chat with Chinchilla or Flamingo, it also is an agent, right?"}, {"time": 1653, "text": "So that's why we call it A of Gato, like the letter A and also it's general."}, {"time": 1661, "text": "It's not an agent that's been trained to be good at only StarCraft or only Atari or only Go."}, {"time": 1667, "text": "It's been trained on a vast variety of datasets."}, {"time": 1671, "text": "What makes it an agent, if I may interrupt, the fact that it can generate actions?"}, {"time": 1676, "text": "Yes, so when we call it, I mean, it's a good question, right?"}, {"time": 1680, "text": "When do we call a model?"}, {"time": 1682, "text": "I mean, everything is a model, but what is an agent in my view is indeed the capacity to take actions in an environment that you then send to it and then the environment might return with a new observation and then you generate the next action."}, {"time": 1697, "text": "This actually, this reminds me of the question from the side of biology, what is life?"}, {"time": 1703, "text": "Which is actually a very difficult question as well."}, {"time": 1705, "text": "What is living, what is living when you think about life here on this planet Earth?"}, {"time": 1711, "text": "And a question interesting to me about aliens, what is life when we visit another planet?"}, {"time": 1715, "text": "Would we be able to recognize it?"}, {"time": 1717, "text": "And this feels like, it sounds perhaps silly, but I don't think it is."}, {"time": 1721, "text": "At which point is the neural network a being versus a tool?"}, {"time": 1728, "text": "And it feels like action, ability to modify its environment is that fundamental leap."}, {"time": 1734, "text": "Yeah, I think it certainly feels like action is a necessary condition to be more alive, but probably not sufficient either."}, {"time": 1744, "text": "So sadly I..."}, {"time": 1745, "text": "It's a soul consciousness thing, whatever."}, {"time": 1746, "text": "Yeah, yeah, we can get back to that later."}, {"time": 1749, "text": "But anyways, going back to the meow and the gato, right?"}, {"time": 1752, "text": "So one of the leaps forward and what took the team a lot of effort and time was, as you were asking, how has gato been trained?"}, {"time": 1763, "text": "So I told you gato is this transformer neural network, models actions, sequences of actions, words, et cetera."}, {"time": 1770, "text": "And then the way we train it is by essentially pulling data sets of observations, right?"}, {"time": 1779, "text": "So it's a massive imitation learning algorithm that it imitates obviously to what is the next word that comes next from the usual data sets we use before, right?"}, {"time": 1790, "text": "So these are these web scale style data sets of people writing on webs or chatting or whatnot, right?"}, {"time": 1798, "text": "So that's an obvious source that we use on all language work."}, {"time": 1802, "text": "But then we also took a lot of agents that we have at DeepMind."}, {"time": 1806, "text": "I mean, as you know, DeepMind, we're quite interested in learning reinforcement learning and learning agents that play in different environments."}, {"time": 1817, "text": "So we kind of created a data set of these trajectories, as we call them, or agent experiences."}, {"time": 1823, "text": "So in a way, there are other agents we train for a single mind purpose to, let's say, control a 3D game environment and navigate a maze."}, {"time": 1833, "text": "So we had all the experience that was created through one agent interacting with that environment."}, {"time": 1839, "text": "And we added this to the data set, right?"}, {"time": 1841, "text": "And as I said, we just see all the data, all these sequences of words or sequences of this agent interacting with that environment or agents playing Atari and so on."}, {"time": 1852, "text": "We see it as the same kind of data."}, {"time": 1854, "text": "And so we mix these data sets together."}, {"time": 1857, "text": "And we train Gato."}, {"time": 1860, "text": "That's the G part, right?"}, {"time": 1861, "text": "It's general because it really has mixed."}, {"time": 1865, "text": "It doesn't have different brains for each modality or each narrow task."}, {"time": 1869, "text": "It has a single brain."}, {"time": 1870, "text": "It's not that big of a brain compared to most of the neural networks we see these days."}, {"time": 1874, "text": "It has 1 billion parameters."}, {"time": 1878, "text": "Some models we're seeing get in the trillions these days."}, {"time": 1881, "text": "And certainly, 100 billion feels like a size that is very common from when you train these jobs."}, {"time": 1889, "text": "So the actual agent is relatively small."}, {"time": 1892, "text": "But it's been trained on a very challenging, diverse data set, not only containing all of the internet but containing all these agent experience playing very different, distinct environments."}, {"time": 1903, "text": "So this brings us to the part of the tweet of this is not the end, it's the beginning."}, {"time": 1908, "text": "It feels very cool to see Gato, in principle, is able to control any sort of environments, especially the ones that it's been trained to do, these 3D games, Atari games, all sorts of robotics tasks, and so on."}, {"time": 1924, "text": "But obviously, it's not as proficient as the teachers it learned from on these environments."}, {"time": 1930, "text": "Not obvious."}, {"time": 1931, "text": "It's not obvious that it wouldn't be more proficient."}, {"time": 1935, "text": "It's just the current beginning part is that the performance is such that it's not as good as if it's specialized to that task."}, {"time": 1943, "text": "So it's not as good, although I would argue size matters here."}, {"time": 1948, "text": "So the fact that I would argue always size always matters."}, {"time": 1951, "text": "That's a different conversation."}, {"time": 1953, "text": "But for neural networks, certainly size does matter."}, {"time": 1956, "text": "So it's the beginning because it's relatively small."}, {"time": 1959, "text": "So obviously, scaling this idea up might make the connections that exist between text on the internet and playing Atari and so on more synergistic with one another."}, {"time": 1973, "text": "And you might gain."}, {"time": 1974, "text": "And that moment, we didn't quite see."}, {"time": 1976, "text": "But obviously, that's why it's the beginning."}, {"time": 1978, "text": "That synergy might emerge with scale."}, {"time": 1980, "text": "Right, might emerge with scale."}, {"time": 1982, "text": "And also, I believe there's some new research or ways in which you prepare the data that you might need to make it more clear to the model that you're not only playing Atari, and you start from a screen."}, {"time": 1996, "text": "And here is up and a screen and down."}, {"time": 1998, "text": "Maybe you can think of playing Atari as there's some sort of context that is needed for the agent before it starts seeing, oh, this is an Atari screen."}, {"time": 2006, "text": "I'm going to start playing."}, {"time": 2008, "text": "You might require, for instance, to be told in words, hey, in this sequence that I'm showing, you're going to be playing an Atari game."}, {"time": 2019, "text": "So text might actually be a good driver to enhance the data."}, {"time": 2024, "text": "So then these connections might be made more easily."}, {"time": 2026, "text": "So that's an idea that we start seeing in language."}, {"time": 2031, "text": "But obviously, beyond, this is going to be effective."}, {"time": 2035, "text": "It's not like I don't show you a screen, and you, from scratch, you're supposed to learn a game."}, {"time": 2041, "text": "There is a lot of context we might set."}, {"time": 2043, "text": "So there might be some work needed as well to set that context."}, {"time": 2047, "text": "But anyways, there's a lot of work."}, {"time": 2050, "text": "So that context puts all the different modalities on the same level ground to provide the context best."}, {"time": 2056, "text": "So maybe on that point, so there's this task, which may not seem trivial, of tokenizing the data, of converting the data into pieces, into basic atomic elements that then could cross modalities somehow."}, {"time": 2075, "text": "So what's tokenization?"}, {"time": 2077, "text": "How do you tokenize text?"}, {"time": 2079, "text": "How do you tokenize images?"}, {"time": 2082, "text": "How do you tokenize games and actions and robotics tasks?"}, {"time": 2088, "text": "So tokenization is the entry point to actually make all the data look like a sequence, because tokens then are just these little puzzle pieces."}, {"time": 2099, "text": "We break down anything into these puzzle pieces, and then we just model, what's this puzzle look like when you make it lay down in a line, so to speak, in a sequence?"}, {"time": 2109, "text": "So in Gato, the text, there's a lot of work."}, {"time": 2115, "text": "You tokenize text usually by looking at commonly used substrings, right?"}, {"time": 2120, "text": "So there's ING in English is a very common substring, so that becomes a token."}, {"time": 2125, "text": "There's quite a well studied problem on tokenizing text."}, {"time": 2129, "text": "And Gato just used the standard techniques that have been developed from many years, even starting from ngram models in the 1950s and so on."}, {"time": 2138, "text": "Just for context, how many tokens, what order, magnitude, number of tokens is required for a word, usually?"}, {"time": 2146, "text": "Yeah, for a word in English, I mean, every language is very different."}, {"time": 2151, "text": "The current level or granularity of tokenization generally means it's maybe two to five."}, {"time": 2157, "text": "I mean, I don't know the statistics exactly, but to give you an idea, we don't tokenize at the level of letters."}, {"time": 2164, "text": "Then it would probably be, I don't know what the average length of a word is in English, but that would be the minimum set of tokens you could use."}, {"time": 2171, "text": "It was bigger than letters, smaller than words."}, {"time": 2173, "text": "And you could think of very, very common words like the."}, {"time": 2176, "text": "I mean, that would be a single token, but very quickly you're talking two, three, four tokens or so."}, {"time": 2182, "text": "Have you ever tried to tokenize emojis?"}, {"time": 2184, "text": "Emojis are actually just sequences of letters, so."}, {"time": 2190, "text": "Maybe to you, but to me they mean so much more."}, {"time": 2193, "text": "Yeah, you can render the emoji, but you might if you actually just."}, {"time": 2196, "text": "Yeah, this is a philosophical question."}, {"time": 2199, "text": "Is emojis an image or a text?"}, {"time": 2203, "text": "The way we do these things is they're actually mapped to small sequences of characters."}, {"time": 2209, "text": "So you can actually play with these models and input emojis, it will output emojis back, which is actually quite a fun exercise."}, {"time": 2217, "text": "You probably can find other tweets about these out there."}, {"time": 2222, "text": "But yeah, so anyways, text."}, {"time": 2224, "text": "It's very clear how this is done."}, {"time": 2226, "text": "And then in Gato, what we did for images is we map images to essentially we compressed images, so to speak, into something that looks more like less like every pixel with every intensity."}, {"time": 2241, "text": "That would mean we have a very long sequence, right?"}, {"time": 2243, "text": "Like if we were talking about 100 by 100 pixel images, that would make the sequences far too long."}, {"time": 2250, "text": "So what was done there is you just use a technique that essentially compresses an image into maybe 16 by 16 patches of pixels, and then that is mapped, again, tokenized."}, {"time": 2262, "text": "You just essentially quantize this space into a special word that actually maps to these little sequence of pixels."}, {"time": 2271, "text": "And then you put the pixels together in some raster order, and then that's how you get out or in the image that you're processing."}, {"time": 2280, "text": "But there's no semantic aspect to that, so you're doing some kind of, you don't need to understand anything about the image in order to tokenize it currently."}, {"time": 2289, "text": "No, you're only using this notion of compression."}, {"time": 2292, "text": "So you're trying to find common, it's like JPG or all these algorithms."}, {"time": 2297, "text": "It's actually very similar at the tokenization level."}, {"time": 2300, "text": "All we're doing is finding common patterns and then making sure in a lossy way we compress these images given the statistics of the images that are contained in all the data we deal with."}, {"time": 2311, "text": "Although you could probably argue that JPEG does have some understanding of images."}, {"time": 2318, "text": "Because visual information, maybe color, compressing crudely based on color does capture something important about an image that's about its meaning, not just about some statistics."}, {"time": 2334, "text": "Yeah, I mean, JP, as I said, the algorithms look actually very similar to they use the cosine transform in JPG."}, {"time": 2344, "text": "The approach we usually do in machine learning when we deal with images and we do this quantization step is a bit more data driven."}, {"time": 2351, "text": "So rather than have some sort of Fourier basis for how frequencies appear in the natural world, we actually just use the statistics of the images and then quantize them based on the statistics, much like you do in words, right?"}, {"time": 2368, "text": "So common substrings are allocated a token and images is very similar."}, {"time": 2374, "text": "But there's no connection."}, {"time": 2376, "text": "The token space, if you think of, oh, like the tokens are an integer and in the end of the day."}, {"time": 2382, "text": "So now like we work on, maybe we have about, let's say, I don't know the exact numbers, but let's say 10,000 tokens for text, right?"}, {"time": 2391, "text": "Certainly more than characters because we have groups of characters and so on."}, {"time": 2395, "text": "So from one to 10,000, those are representing all the language and the words we'll see."}, {"time": 2401, "text": "And then images occupy the next set of integers."}, {"time": 2404, "text": "So they're completely independent, right?"}, {"time": 2405, "text": "So from 10,001 to 20,000, those are the tokens that represent these other modality images."}, {"time": 2412, "text": "And that is an interesting aspect that makes it orthogonal."}, {"time": 2418, "text": "So what connects these concepts is the data, right?"}, {"time": 2421, "text": "Once you have a data set, for instance, that captions images that tells you, oh, this is someone playing a frisbee on a green field."}, {"time": 2430, "text": "Now the model will need to predict the tokens from the text green field to then the pixels."}, {"time": 2437, "text": "And that will start making the connections between the tokens."}, {"time": 2440, "text": "So these connections happen as the algorithm learns."}, {"time": 2443, "text": "And then the last, if we think of these integers, the first few are words, the next few are images."}, {"time": 2448, "text": "In Gato, we also allocated the highest order of integers to actions, right?"}, {"time": 2456, "text": "Which we discretize and actions are very diverse, right?"}, {"time": 2459, "text": "In Atari, there's, I don't know if 17 discrete actions."}, {"time": 2464, "text": "In robotics, actions might be torques and forces that we apply."}, {"time": 2468, "text": "So we just use kind of similar ideas to compress these actions into tokens."}, {"time": 2474, "text": "And then we just, that's how we map now all the space to these sequence of integers."}, {"time": 2480, "text": "But they occupy different space and what connects them is then the learning algorithm."}, {"time": 2484, "text": "That's where the magic happens."}, {"time": 2486, "text": "So the modalities are orthogonal to each other in token space."}, {"time": 2490, "text": "So in the input, everything you add, you add extra tokens."}, {"time": 2495, "text": "And then you're shoving all of that into one place."}, {"time": 2500, "text": "Yes, the transformer."}, {"time": 2501, "text": "And that transformer, that transformer tries to look at this gigantic token space and tries to form some kind of representation, some kind of unique wisdom about all of these different modalities."}, {"time": 2522, "text": "If you were to sort of like put your psychoanalysis hat on and try to psychoanalyze this neural network, is it schizophrenic?"}, {"time": 2531, "text": "Does it try to, given this very few weights, represent multiple disjoint things and somehow have them not interfere with each other?"}, {"time": 2542, "text": "Or is it somehow building on the joint strength, on whatever is common to all the different modalities?"}, {"time": 2551, "text": "Like what, if you were to ask a question, is it schizophrenic or is it of one mind?"}, {"time": 2558, "text": "I mean, it is one mind and it's actually the simplest algorithm, which that's kind of in a way how it feels like the field hasn't changed since back propagation and gradient descent was purpose for learning neural networks."}, {"time": 2575, "text": "So there is obviously details on the architecture."}, {"time": 2578, "text": "This has evolved."}, {"time": 2579, "text": "The current iteration is still the transformer, which is a powerful sequence modeling architecture."}, {"time": 2587, "text": "But then the goal of this, you know, setting these weights to predict the data is essentially the same as basically I could describe."}, {"time": 2597, "text": "I mean, we described a few years ago, Alpha star language modeling and so on, right?"}, {"time": 2601, "text": "We take, let's say an Atari game, we map it to a string of numbers that will all be probably image space and action space interleaved."}, {"time": 2612, "text": "And all we're gonna do is say, okay, given the numbers, you know, 10,001, 10,004, 10,005, the next number that comes is 20,006, which is in the action space."}, {"time": 2625, "text": "And you're just optimizing these weights via very simple gradients."}, {"time": 2631, "text": "Like, you know, mathematical is almost the most boring algorithm you could imagine."}, {"time": 2635, "text": "We settle the weights so that given this particular instance, these weights are set to maximize the probability of having seen this particular sequence of integers for this particular game."}, {"time": 2649, "text": "And then the algorithm does this for many, many, many iterations, looking at different modalities, different games, right?"}, {"time": 2657, "text": "That's the mixture of the dataset we discussed."}, {"time": 2660, "text": "So in a way, it's a very simple algorithm and the weights, right, they're all shared, right?"}, {"time": 2667, "text": "So in terms of, is it focusing on one modality or not?"}, {"time": 2670, "text": "The intermediate weights that are converting from these input of integers to the target integer you're predicting next, those weights certainly are common."}, {"time": 2680, "text": "And then the way that tokenization happens, there is a special place in the neural network, which is we map this integer, like number 10,001, to a vector of real numbers."}, {"time": 2691, "text": "Like real numbers, we can optimize them with gradient descent, right?"}, {"time": 2696, "text": "The functions we learn are actually surprisingly differentiable."}, {"time": 2699, "text": "That's why we compute gradients."}, {"time": 2701, "text": "So this step is the only one that this orthogonality you mentioned applies."}, {"time": 2706, "text": "So mapping a certain token for text or image or actions, each of these tokens gets its own little vector of real numbers that represents this."}, {"time": 2717, "text": "If you look at the field back many years ago, people were talking about word vectors or word embeddings."}, {"time": 2723, "text": "These are the same."}, {"time": 2724, "text": "We have word vectors or embeddings."}, {"time": 2726, "text": "We have image vector or embeddings and action vector of embeddings."}, {"time": 2730, "text": "And the beauty here is that as you train this model, if you visualize these little vectors, it might be that they start aligning even though they're independent parameters."}, {"time": 2741, "text": "There could be anything, but then it might be that you take the word gato or cat, which maybe is common enough that it actually has its own token."}, {"time": 2750, "text": "And then you take pixels that have a cat and you might start seeing that these vectors look like they align, right?"}, {"time": 2757, "text": "So by learning from this vast amount of data, the model is realizing the potential connections between these modalities."}, {"time": 2765, "text": "Now, I will say there will be another way, at least in part, to not have these different vectors for each different modality."}, {"time": 2775, "text": "For instance, when I tell you about actions in certain space, I'm defining actions by words, right?"}, {"time": 2782, "text": "So you could imagine a world in which I'm not learning that the action app in Atari is its own number."}, {"time": 2791, "text": "The action app in Atari maybe is literally the word or the sentence app in Atari, right?"}, {"time": 2797, "text": "And that would mean we now leverage much more from the language."}, {"time": 2801, "text": "This is not what we did here, but certainly it might make these connections much easier to learn and also to teach the model to correct its own actions and so on, right?"}, {"time": 2811, "text": "So all these to say that gato is indeed the beginning, that it is a radical idea to do this this way, but there's probably a lot more to be done and the results to be more impressive, not only through scale, but also through some new research that will come hopefully in the years to come."}, {"time": 2830, "text": "So just to elaborate quickly, you mean one possible next step or one of the paths that you might take next is doing the tokenization fundamentally as a kind of linguistic communication."}, {"time": 2848, "text": "So like you convert even images into language."}, {"time": 2851, "text": "So doing something like a crude semantic segmentation, trying to just assign a bunch of words to an image that like have almost like a dumb entity explaining as much as it can about the image."}, {"time": 2865, "text": "And so you convert that into words and then you convert games into words and then you provide the context in words and all of it."}, {"time": 2872, "text": "And eventually getting to a point where everybody agrees with Noam Chomsky that language is actually at the core of everything."}, {"time": 2880, "text": "That's it's the base layer of intelligence and consciousness and all that kind of stuff, okay."}, {"time": 2887, "text": "You mentioned early on like size, it's hard to grow."}, {"time": 2891, "text": "What did you mean by that?"}, {"time": 2892, "text": "Because we're talking about scale might change."}, {"time": 2897, "text": "There might be, and we'll talk about this too, like there's a emergent, there's certain things about these neural networks that are emergent."}, {"time": 2905, "text": "So certain like performance we can see only with scale and there's some kind of threshold of scale."}, {"time": 2910, "text": "So why is it hard to grow something like this Meow network?"}, {"time": 2916, "text": "So the Meow network, it's not hard to grow if you retrain it."}, {"time": 2922, "text": "What's hard is, well, we have now 1 billion parameters."}, {"time": 2926, "text": "We train them for a while."}, {"time": 2928, "text": "We spend some amount of work towards building these weights that are an amazing initial brain for doing these kinds of tasks we care about."}, {"time": 2938, "text": "Could we reuse the weights and expand to a larger brain?"}, {"time": 2943, "text": "And that is extraordinarily hard, but also exciting from a research perspective and a practical perspective point of view, right?"}, {"time": 2952, "text": "So there's this notion of modularity in software engineering and we starting to see some examples and work that leverages modularity."}, {"time": 2963, "text": "In fact, if we go back one step from Gato to a work that I would say train much larger, much more capable network called Flamingo."}, {"time": 2972, "text": "Flamingo did not deal with actions, but it definitely dealt with images in an interesting way, kind of akin to what Gato did, but slightly different technique for tokenizing, but we don't need to go into that detail."}, {"time": 2985, "text": "But what Flamingo also did, which Gato didn't do, and that just happens because these projects, they're different, it's a bit of like the exploratory nature of research, which is great."}, {"time": 2997, "text": "The research behind these projects is also modular."}, {"time": 3001, "text": "And it has to be, right?"}, {"time": 3002, "text": "We need to have creativity and sometimes you need to protect pockets of people, researchers and so on."}, {"time": 3010, "text": "By we, you mean humans."}, {"time": 3012, "text": "And also in particular researchers and maybe even further DeepMind or other such labs."}, {"time": 3018, "text": "And then the neural networks themselves."}, {"time": 3020, "text": "So it's modularity all the way down."}, {"time": 3023, "text": "All the way down."}, {"time": 3024, "text": "So the way that we did modularity very beautifully in Flamingo is we took Chinchilla, which is a language only model, not an agent, if we think of actions being necessary for agency."}, {"time": 3036, "text": "So we took Chinchilla, we took the weights of Chinchilla and then we froze them."}, {"time": 3042, "text": "We said, these don't change."}, {"time": 3044, "text": "We train them to be very good at predicting the next word."}, {"time": 3047, "text": "It's a very good language model, state of the art at the time you release it, et cetera, et cetera."}, {"time": 3052, "text": "We're going to add a capability to see, right?"}, {"time": 3055, "text": "We are going to add the ability to see to this language model."}, {"time": 3058, "text": "So we're going to attach small pieces of neural networks at the right places in the model."}, {"time": 3063, "text": "It's almost like I'm injecting the network with some weights and some substructures in a good way, right?"}, {"time": 3072, "text": "So you need the research to say, what is effective?"}, {"time": 3075, "text": "How do you add this capability without destroying others, et cetera."}, {"time": 3078, "text": "So we created a small sub network initialized, not from random, but actually from self supervised learning that a model that understands vision in general."}, {"time": 3092, "text": "And then we took data sets that connect the two modalities, vision and language."}, {"time": 3098, "text": "And then we froze the main part, the largest portion of the network, which was Chinchilla, that is 70 billion parameters."}, {"time": 3105, "text": "And then we added a few more parameters on top, trained from scratch, and then some others that were pre trained with the capacity to see, like it was not tokenization in the way I described for Gato, but it's a similar idea."}, {"time": 3121, "text": "And then we trained the whole system."}, {"time": 3123, "text": "Parts of it were frozen, parts of it were new."}, {"time": 3126, "text": "And all of a sudden, we developed Flamingo, which is an amazing model that is essentially, I mean, describing it is a chatbot where you can also upload images and start conversing about images."}, {"time": 3139, "text": "But it's also kind of a dialogue style chatbot."}, {"time": 3143, "text": "So the input is images and text and the output is text."}, {"time": 3148, "text": "How many parameters, you said 70 billion for Chinchilla?"}, {"time": 3151, "text": "Yeah, Chinchilla is 70 billion."}, {"time": 3153, "text": "And then the ones we add on top, which kind of almost is almost like a way to overwrite its little activations so that when it sees vision, it does kind of a correct computation of what it's seeing, mapping it back towards, so to speak."}, {"time": 3167, "text": "That adds an extra 10 billion parameters, right?"}, {"time": 3170, "text": "So it's total 80 billion, the largest one we released."}, {"time": 3173, "text": "And then you train it on a few datasets that contain vision and language."}, {"time": 3179, "text": "And once you interact with the model, you start seeing that you can upload an image and start sort of having a dialogue about the image, which is actually not something, it's very similar and akin to what we saw in language only."}, {"time": 3192, "text": "These prompting abilities that it has, you can teach it a new vision task, right?"}, {"time": 3222, "text": "We can upload, I think one of the tweets talking about Twitter was this image from Obama that is placing a weight and someone is kind of weighting themselves and it's kind of a joke style image."}, {"time": 3234, "text": "And it's notable because I think Andrew Carpati a few years ago said, no computer vision system can understand the subtlety of this joke in this image, all the things that go on."}, {"time": 3246, "text": "And so what we try to do, and it's very anecdotally, I mean, this is not a proof that we solved this issue, but it just shows that you can upload now this image and start conversing with the model, trying to make out if it gets that there's a joke because the person weighting themselves doesn't see that someone behind is making the weight higher and so on and so forth."}, {"time": 3267, "text": "So it's a fascinating capability and it comes from this key idea of modularity where we took a frozen brain and we just added a new capability."}, {"time": 3277, "text": "So the question is, should we, so in a way you can see even from DeepMind, we have Flamingo that this moderate approach and thus could leverage the scale a bit more reasonably because we didn't need to retrain a system from scratch."}, {"time": 3292, "text": "And on the other hand, we had Gato, which used the same data sets, but then he trained it from scratch, right?"}, {"time": 3297, "text": "And so I guess big question for the community is should we train from scratch or should we embrace modularity?"}, {"time": 3304, "text": "And this lies, like this goes back to modularity as a way to grow, but reuse seems like natural and it was very effective, certainly."}, {"time": 3357, "text": "Yeah, so that vision is beautiful."}, {"time": 3359, "text": "I think there's still the question about within single modalities, like Chinchilla was reused, but now if we train a next iteration of language models, are we gonna use Chinchilla or not?"}, {"time": 3371, "text": "Yeah, how do you swap out Chinchilla?"}, {"time": 3373, "text": "Right, so there's still big questions, but that idea is actually really akin to software engineering, which we're not reimplementing libraries from scratch, we're reusing and then building ever more amazing things, including neural networks with software that we're reusing."}, {"time": 3388, "text": "So I think this idea of modularity, I like it, I think it's here to stay and that's also why I mentioned it's just the beginning, not the end."}, {"time": 3398, "text": "You've mentioned meta learning, so given this promise of Gato, can we try to redefine this term that's almost akin to consciousness because it means different things to different people throughout the history of artificial intelligence, but what do you think meta learning is and looks like now in the five years, 10 years, will it look like the system like Gato, but scaled?"}, {"time": 3423, "text": "What's your sense of, what does meta learning look like?"}, {"time": 3427, "text": "Do you think with all the wisdom we've learned so far?"}, {"time": 3431, "text": "Maybe it's good to give another data point looking backwards rather than forward."}, {"time": 3436, "text": "So when we talk in 2019, meta learning meant something that has changed mostly through the revolution of GPT3 and beyond."}, {"time": 3451, "text": "So what meta learning meant at the time was driven by what benchmarks people care about in meta learning."}, {"time": 3458, "text": "And the benchmarks were about a capability to learn about object identities."}, {"time": 3464, "text": "So it was very much overfitted to vision and object classification."}, {"time": 3470, "text": "And the part that was meta about that was that, oh, we're not just learning a thousand categories that ImageNet tells us to learn."}, {"time": 3477, "text": "We're going to learn object categories that can be defined when we interact with the model."}, {"time": 3483, "text": "So it's interesting to see the evolution, right?"}, {"time": 3486, "text": "The way this started was we have a special language that was a data set, a small data set that we prompted the model with saying, hey, here is a new classification task."}, {"time": 3498, "text": "I'll give you one image and the name, which was an integer at the time of the image and a different image and so on."}, {"time": 3505, "text": "So you have a small prompt in the form of a data set, a machine learning data set."}, {"time": 3511, "text": "And then you got then a system that could then predict or classify these objects that you just defined kind of on the fly."}, {"time": 3520, "text": "So fast forward, it was revealed that language models are few shot learners."}, {"time": 3527, "text": "That's the title of the paper."}, {"time": 3529, "text": "So very good title."}, {"time": 3530, "text": "Sometimes titles are really good."}, {"time": 3531, "text": "So this one is really, really good."}, {"time": 3533, "text": "Because that's the point of GPT3 that showed that, look, sure, we can focus on object classification and what meta learning means within the space of learning object categories."}, {"time": 3545, "text": "This goes beyond, or before rather, to also Omniglot, before ImageNet and so on."}, {"time": 3550, "text": "So there's a few benchmarks."}, {"time": 3551, "text": "To now, all of a sudden, we're a bit unlocked from benchmarks."}, {"time": 3555, "text": "And through language, we can define tasks."}, {"time": 3557, "text": "So we're literally telling the model some logical task or a little thing that we wanted to do."}, {"time": 3563, "text": "We prompt it much like we did before, but now we prompt it through natural language."}, {"time": 3568, "text": "And then not perfectly, I mean, these models have failure modes and that's fine, but these models then are now doing a new task."}, {"time": 3577, "text": "And so they meta learn this new capability."}, {"time": 3580, "text": "Now, that's where we are now."}, {"time": 3583, "text": "Flamingo expanded this to visual and language, but it basically has the same abilities."}, {"time": 3589, "text": "You can teach it, for instance, an emergent property was that you can take pictures of numbers and then do arithmetic with the numbers just by teaching it, oh, when I show you 3 plus 6, I want you to output 9."}, {"time": 3603, "text": "And you show it a few examples, and now it does that."}, {"time": 3606, "text": "So it went way beyond the image net categorization of images that we were a bit stuck maybe before this revelation moment that happened in 2000."}, {"time": 3619, "text": "I believe it was 19, but it was after we checked."}, {"time": 3621, "text": "In that way, it has solved meta learning as was previously defined."}, {"time": 3626, "text": "Yes, it expanded what it meant."}, {"time": 3627, "text": "So that's what you say, what does it mean?"}, {"time": 3629, "text": "So it's an evolving term."}, {"time": 3631, "text": "But here is maybe now looking forward, looking at what's happening, obviously, in the community with more modalities, what we can expect."}, {"time": 3642, "text": "And I would certainly hope to see the following."}, {"time": 3645, "text": "And this is a pretty drastic hope."}, {"time": 3648, "text": "But in five years, maybe we chat again."}, {"time": 3651, "text": "And we have a system, a set of weights that we can teach it to play StarCraft."}, {"time": 3659, "text": "Maybe not at the level of AlphaStar, but play StarCraft, a complex game, we teach it through interactions to prompting."}, {"time": 3666, "text": "You can certainly prompt a system."}, {"time": 3668, "text": "That's what Gata shows to play some simple Atari games."}, {"time": 3671, "text": "So imagine if you start talking to a system, teaching it a new game, showing it examples of in this particular game, this user did something good."}, {"time": 3682, "text": "Maybe the system can even play and ask you questions."}, {"time": 3685, "text": "Say, hey, I played this game."}, {"time": 3687, "text": "I just played this game."}, {"time": 3688, "text": "Did I do well?"}, {"time": 3689, "text": "Can you teach me more?"}, {"time": 3690, "text": "So five, maybe to 10 years, these capabilities, or what meta learning means, will be much more interactive, much more rich, and through domains that we were specializing."}, {"time": 3701, "text": "So you see the difference."}, {"time": 3702, "text": "We built AlphaStar Specialized to play StarCraft."}, {"time": 3707, "text": "The algorithms were general, but the weights were specialized."}, {"time": 3710, "text": "And what we're hoping is that we can teach a network to play games, to play any game, just using games as an example, through interacting with it, teaching it, uploading the Wikipedia page of StarCraft."}, {"time": 3724, "text": "This is in the horizon."}, {"time": 3726, "text": "And obviously, there are details that need to be filled and research needs to be done."}, {"time": 3731, "text": "But that's how I see meta learning above, which is going to be beyond prompting."}, {"time": 3735, "text": "It's going to be a bit more interactive."}, {"time": 3738, "text": "The system might tell us to give it feedback after it maybe makes mistakes or it loses a game."}, {"time": 3744, "text": "But it's nonetheless very exciting because if you think about this this way, the benchmarks are already there."}, {"time": 3750, "text": "We just repurposed the benchmarks."}, {"time": 3753, "text": "So in a way, I like to map the space of what maybe AGI means to say, OK, we went 101% performance in Go, in Chess, in StarCraft."}, {"time": 3767, "text": "The next iteration might be 20% performance across, quote unquote, all tasks."}, {"time": 3774, "text": "And even if it's not as good, it's fine."}, {"time": 3777, "text": "We have ways to also measure progress because we have those specialized agents and so on."}, {"time": 3784, "text": "So this is, to me, very exciting."}, {"time": 3786, "text": "And these next iteration models are definitely hinting at that direction of progress, which hopefully we can have."}, {"time": 3794, "text": "There are obviously some things that could go wrong in terms of we might not have the tools."}, {"time": 3800, "text": "Maybe transformers are not enough."}, {"time": 3802, "text": "There are some breakthroughs to come, which makes the field more exciting to people like me as well, of course."}, {"time": 3808, "text": "But that's, if you ask me, five to 10 years, you might see these models that start to look more like weights that are already trained."}, {"time": 3816, "text": "And then it's more about teaching or make their meta learn what you're trying to induce in terms of tasks and so on, well beyond the simple now tasks we're starting to see emerge like small arithmetic tasks and so on."}, {"time": 3834, "text": "So a few questions around that."}, {"time": 3837, "text": "So that kind of teaching, interactive, so it's beyond prompting."}, {"time": 3842, "text": "So it's interacting with the neural network."}, {"time": 3845, "text": "That's different than the training process."}, {"time": 3848, "text": "So it's different than the optimization over differentiable functions."}, {"time": 3855, "text": "This is already trained."}, {"time": 3857, "text": "And now you're teaching, I mean, it's almost akin to the brain, the neurons already set with their connections."}, {"time": 3866, "text": "On top of that, you're now using that infrastructure to build up further knowledge."}, {"time": 3873, "text": "So that's a really interesting distinction that's actually not obvious from a software engineering perspective, that there's a line to be drawn."}, {"time": 3882, "text": "Because you always think for a neural network to learn, it has to be retrained, trained and retrained."}, {"time": 3889, "text": "And prompting is a way of teaching."}, {"time": 3894, "text": "And you'll now work a little bit of context about whatever the heck you're trying it to do."}, {"time": 3897, "text": "So you can maybe expand this prompting capability by making it interact."}, {"time": 3904, "text": "By the way, this is not, if you look at way back at different ways to tackle even classification tasks."}, {"time": 3911, "text": "So this comes from longstanding literature in machine learning."}, {"time": 3918, "text": "What I'm suggesting could sound to some like a bit like nearest neighbor."}, {"time": 3923, "text": "So nearest neighbor is almost the simplest algorithm that does not require learning."}, {"time": 3930, "text": "So it has this interesting, you don't need to compute gradients."}, {"time": 3934, "text": "And what nearest neighbor does is you, quote unquote, have a data set or upload a data set."}, {"time": 3939, "text": "And then all you need to do is a way to measure distance between points."}, {"time": 3944, "text": "And then to classify a new point, you're just simply computing, what's the closest point in this massive amount of data?"}, {"time": 3951, "text": "And that's my answer."}, {"time": 3952, "text": "So you can think of prompting in a way as you're uploading not just simple points."}, {"time": 3958, "text": "And the metric is not the distance between the images or something simple."}, {"time": 3963, "text": "It's something that you compute that's much more advanced."}, {"time": 3966, "text": "But in a way, it's very similar."}, {"time": 3969, "text": "You simply are uploading some knowledge to this pre trained system in nearest neighbor."}, {"time": 3975, "text": "Maybe the metric is learned or not, but you don't need to further train it."}, {"time": 3979, "text": "And then now you immediately get a classifier out of this."}, {"time": 3983, "text": "Now it's just an evolution of that concept, very classical concept in machine learning, which is just learning through what's the closest point, closest by some distance, and that's it."}, {"time": 3994, "text": "It's an evolution of that."}, {"time": 3996, "text": "And I will say how I saw meta learning when we worked on a few ideas in 2016 was precisely through the lens of nearest neighbor, which is very common in computer vision community."}, {"time": 4010, "text": "There's a very active area of research about how do you compute the distance between two images."}, {"time": 4015, "text": "But if you have a good distance metric, you also have a good classifier."}, {"time": 4019, "text": "All I'm saying is now these distances and the points are not just images."}, {"time": 4023, "text": "They're like words or sequences of words and images and actions that teach you something new."}, {"time": 4030, "text": "But it might be that technique wise those come back."}, {"time": 4034, "text": "And I will say that it's not necessarily true that you might not ever train the weights a bit further."}, {"time": 4041, "text": "Some aspect of meta learning, some techniques in meta learning do actually do a bit of fine tuning as it's called."}, {"time": 4049, "text": "They train the weights a little bit when they get a new task."}, {"time": 4052, "text": "So as I call the how or how we're going to achieve this, as a deep learner, I'm very skeptic."}, {"time": 4059, "text": "We're going to try a few things, whether it's a bit of training, adding a few parameters, thinking of these as nearest neighbor, or just simply thinking of there's a sequence of words, it's a prefix."}, {"time": 4070, "text": "And that's the new classifier."}, {"time": 4073, "text": "There's the beauty of research."}, {"time": 4075, "text": "But what's important is that is a good goal in itself that I see as very worthwhile pursuing for the next stages of not only meta learning."}, {"time": 4085, "text": "I think this is basically what's exciting about machine learning period to me."}, {"time": 4091, "text": "Well, and the interactive aspect of that is also very interesting, the interactive version of nearest neighbor to help you pull out the classifier from this giant thing."}, {"time": 4103, "text": "OK, is this the way we can go in 5, 10 plus years from any task, sorry, from many tasks to any task?"}, {"time": 4119, "text": "What does it need to be actually trained on?"}, {"time": 4122, "text": "Which point is the network had enough?"}, {"time": 4125, "text": "So what does a network need to learn about this world in order to be able to perform any task?"}, {"time": 4132, "text": "Is it just as simple as language, image, and action?"}, {"time": 4137, "text": "Or do you need some set of representative images?"}, {"time": 4142, "text": "Like if you only see land images, will you know anything about underwater?"}, {"time": 4146, "text": "Is that some fundamentally different?"}, {"time": 4149, "text": "I mean, those are open questions, I would say."}, {"time": 4152, "text": "I mean, the way you put, let me maybe further your example."}, {"time": 4155, "text": "If all you see is land images but you're reading all about land and water worlds but in books, imagine, would that be enough?"}, {"time": 4167, "text": "But I guess maybe you can join us if you want in our quest to find this."}, {"time": 4172, "text": "That's precisely."}, {"time": 4173, "text": "Water world, yeah."}, {"time": 4174, "text": "Yes, that's precisely, I mean, the beauty of research."}, {"time": 4177, "text": "And that's the research business we're in, I guess, is to figure this out and ask the right questions and then iterate with the whole community, publishing findings and so on."}, {"time": 4192, "text": "But yeah, this is a question."}, {"time": 4195, "text": "It's not the only question, but it's certainly, as you ask, on my mind constantly."}, {"time": 4200, "text": "And so we'll need to wait for maybe the, let's say, five years, let's hope it's not 10, to see what are the answers."}, {"time": 4209, "text": "Some people will largely believe in unsupervised or self supervised learning of single modalities and then crossing them."}, {"time": 4218, "text": "Some people might think end to end learning is the answer."}, {"time": 4221, "text": "Modularity is maybe the answer."}, {"time": 4223, "text": "So we don't know, but we're just definitely excited to find out."}, {"time": 4227, "text": "But it feels like this is the right time and we're at the beginning of this journey."}, {"time": 4231, "text": "We're finally ready to do these kind of general big models and agents."}, {"time": 4237, "text": "What do you sort of specific technical thing about Gato, Flamingo, Chinchilla, Gopher, any of these that is especially beautiful, that was surprising, maybe?"}, {"time": 4251, "text": "Is there something that just jumps out at you?"}, {"time": 4255, "text": "Of course, there's the general thing of like, you didn't think it was possible and then you realize it's possible in terms of the generalizability across modalities and all that kind of stuff."}, {"time": 4265, "text": "Or maybe how small of a network, relatively speaking, Gato is, all that kind of stuff."}, {"time": 4270, "text": "But is there some weird little things that were surprising?"}, {"time": 4275, "text": "Look, I'll give you an answer that's very important because maybe people don't quite realize this, but the teams behind these efforts, the actual humans, that's maybe the surprising in an obviously positive way."}, {"time": 4291, "text": "So anytime you see these breakthroughs, I mean, it's easy to map it to a few people."}, {"time": 4297, "text": "There's people that are great at explaining things and so on."}, {"time": 4299, "text": "And that's very nice."}, {"time": 4300, "text": "But maybe the learnings or the method learnings that I get as a human about this is, sure, we can move forward."}, {"time": 4310, "text": "But the surprising bit is how important are all the pieces of these projects, how do they come together?"}, {"time": 4320, "text": "So I'll give you maybe some of the ingredients of success that are common across these, but not the obvious ones on machine learning."}, {"time": 4328, "text": "I can always also give you those."}, {"time": 4331, "text": "But basically, there is engineering is critical."}, {"time": 4337, "text": "So very good engineering because ultimately we're collecting data sets, right?"}, {"time": 4343, "text": "So the engineering of data and then of deploying the models at scale into some compute cluster that cannot go understated, that is a huge factor of success."}, {"time": 4356, "text": "And it's hard to believe that details matter so much."}, {"time": 4361, "text": "We would like to believe that it's true that there is more and more of a standard formula, as I was saying, like this recipe that works for everything."}, {"time": 4370, "text": "But then when you zoom into each of these projects, then you realize the devil is indeed in the details."}, {"time": 4377, "text": "And then the teams have to work together towards these goals."}, {"time": 4383, "text": "So engineering of data and obviously clusters and large scale is very important."}, {"time": 4389, "text": "And then one that is often not, maybe nowadays it is more clear is benchmark progress, right?"}, {"time": 4397, "text": "So we're talking here about multiple months of tens of researchers and people that are trying to organize the research and so on working together."}, {"time": 4408, "text": "And you don't know that you can get there."}, {"time": 4412, "text": "I mean, this is the beauty."}, {"time": 4414, "text": "If you're not risking to trying to do something that feels impossible, you're not going to get there."}, {"time": 4421, "text": "But you need a way to measure progress."}, {"time": 4423, "text": "So the benchmarks that you build are critical."}, {"time": 4427, "text": "I've seen this beautifully play out in many projects."}, {"time": 4430, "text": "I mean, maybe the one I've seen it more consistently, which means we establish the metric, actually the community did."}, {"time": 4438, "text": "And then we leverage that massively is alpha fold."}, {"time": 4441, "text": "This is a project where the data, the metrics were all there."}, {"time": 4446, "text": "And all it took was, and it's easier said than done, an amazing team working not to try to find some incremental improvement and publish, which is one way to do research that is valid, but aim very high and work literally for years to iterate over that process."}, {"time": 4464, "text": "And working for years with the team, I mean, it is tricky that also happened to happen partly during a pandemic and so on."}, {"time": 4472, "text": "So I think my meta learning from all this is the teams are critical to the success."}, {"time": 4477, "text": "And then if now going to the machine learning, the part that's surprising is so we like architectures like neural networks."}, {"time": 4488, "text": "And I would say this was a very rapidly evolving field until the transformer came."}, {"time": 4494, "text": "So attention might indeed be all you need, which is the title, also a good title, although in hindsight is good."}, {"time": 4502, "text": "I don't think at the time I thought this is a great title for a paper."}, {"time": 4505, "text": "But that architecture is proving that the dream of modeling sequences of any bytes, there is something there that will stick."}, {"time": 4515, "text": "And I think these advance in architectures in how neural networks are architecture to do what they do."}, {"time": 4523, "text": "It's been hard to find one that has been so stable and relatively has changed very little since it was invented five or so years ago."}, {"time": 4533, "text": "So that is a surprising, is a surprise that keeps recurring into other projects."}, {"time": 4538, "text": "Try to, on a philosophical or technical level, introspect, what is the magic of attention?"}, {"time": 4545, "text": "What is attention?"}, {"time": 4547, "text": "That's attention in people that study cognition, so human attention."}, {"time": 4552, "text": "I think there's giant wars over what attention means, how it works in the human mind."}, {"time": 4557, "text": "So there's very simple looks at what attention is in a neural network from the days of attention is all you need."}, {"time": 4564, "text": "But do you think there's a general principle that's really powerful here?"}, {"time": 4568, "text": "Yeah, so a distinction between transformers and LSTMs, which were what came before."}, {"time": 4575, "text": "And there was a transitional period where you could use both."}, {"time": 4579, "text": "In fact, when we talked about AlphaStar, we used transformers and LSTMs."}, {"time": 4584, "text": "So it was still the beginning of transformers."}, {"time": 4587, "text": "But LSTMs were also very powerful sequence models."}, {"time": 4591, "text": "So the power of the transformer is that it has built in what we call an inductive bias of attention that makes the model."}, {"time": 4603, "text": "When you think of a sequence of integers, like we discussed this before, this is a sequence of words."}, {"time": 4610, "text": "When you have to do very hard tasks over these words, this could be we're going to translate a whole paragraph or we're going to predict the next paragraph given 10 paragraphs before."}, {"time": 4624, "text": "There's some loose intuition from how we do it as a human that is very nicely mimicked and replicated structurally speaking in the transformer, which is this idea of you're looking for something."}, {"time": 4641, "text": "So you're sort of when you just read a piece of text, now you're thinking what comes next."}, {"time": 4647, "text": "You might want to relook at the text or look it from scratch."}, {"time": 4651, "text": "I mean, literally is because there's no recurrence."}, {"time": 4655, "text": "You're just thinking what comes next."}, {"time": 4657, "text": "And it's almost hypothesis driven."}, {"time": 4660, "text": "So if I'm thinking the next word that I write is cat or dog, the way the transformer works almost philosophically is it has these two hypotheses."}, {"time": 4672, "text": "Is it going to be cat or is it going to be dog?"}, {"time": 4675, "text": "And then it says, OK, if it's cat, I'm going to look for certain words."}, {"time": 4679, "text": "Not necessarily cat, although cat is an obvious word you would look in the past to see whether it makes more sense to output cat or dog."}, {"time": 4685, "text": "And then it does some very deep computation over the words and beyond."}, {"time": 4691, "text": "So it combines the words, but it has the query as we call it that is cat."}, {"time": 4698, "text": "And then similarly for dog."}, {"time": 4700, "text": "And so it's a very computational way to think about, look, if I'm thinking deeply about text, I need to go back to look at all of the text, attend over it."}, {"time": 4710, "text": "But it's not just attention."}, {"time": 4712, "text": "What is guiding the attention?"}, {"time": 4714, "text": "And that was the key insight from an earlier paper is not how far away is it?"}, {"time": 4719, "text": "I mean, how far away is it is important?"}, {"time": 4720, "text": "What did I just write about?"}, {"time": 4722, "text": "That's critical."}, {"time": 4724, "text": "But what you wrote about 10 pages ago might also be critical."}, {"time": 4728, "text": "So you're looking not positionally, but content wise."}, {"time": 4733, "text": "And transformers have this beautiful way to query for certain content and pull it out in a compressed way."}, {"time": 4740, "text": "So then you can make a more informed decision."}, {"time": 4742, "text": "I mean, that's one way to explain transformers."}, {"time": 4745, "text": "But I think it's a very powerful inductive bias."}, {"time": 4750, "text": "There might be some details that might change over time, but I think that is what makes transformers so much more powerful than the recurrent networks that were more recency bias based, which obviously works in some tasks, but it has major flaws."}, {"time": 4766, "text": "Transformer itself has flaws."}, {"time": 4769, "text": "And I think the main one, the main challenge is these prompts that we just were talking about, they can be 1,000 words long."}, {"time": 4778, "text": "But if I'm teaching you StarGraph, I'll have to show you videos."}, {"time": 4781, "text": "I'll have to point you to whole Wikipedia articles about the game."}, {"time": 4786, "text": "We'll have to interact probably as you play."}, {"time": 4788, "text": "You'll ask me questions."}, {"time": 4789, "text": "The context required for us to achieve me being a good teacher to you on the game as you would want to do it with a model, I think goes well beyond the current capabilities."}, {"time": 4801, "text": "So the question is, how do we benchmark this?"}, {"time": 4803, "text": "And then how do we change the structure of the architectures?"}, {"time": 4807, "text": "I think there's ideas on both sides, but we'll have to see empirically, obviously, what ends up working."}, {"time": 4813, "text": "And as you talked about, some of the ideas could be keeping the constraint of that length in place, but then forming hierarchical representations to where you can start being much clever in how you use those 1,000 tokens."}, {"time": 4832, "text": "But it also is possible that this attentional mechanism where you basically, you don't have a recency bias, but you look more generally, you make it learnable."}, {"time": 4842, "text": "The mechanism in which way you look back into the past, you make that learnable."}, {"time": 4846, "text": "It's also possible we're at the very beginning of that because that, you might become smarter and smarter in the way you query the past."}, {"time": 4858, "text": "So recent past and distant past and maybe very, very distant past."}, {"time": 4862, "text": "So almost like the attention mechanism will have to improve and evolve as good as the tokenization mechanism so you can represent long term memory somehow."}, {"time": 4876, "text": "And I mean, hierarchies are very, I mean, it's a very nice word that sounds appealing."}, {"time": 4882, "text": "There's lots of work adding hierarchy to the memories."}, {"time": 4885, "text": "In practice, it does seem like we keep coming back to the main formula or main architecture."}, {"time": 4893, "text": "That sometimes tells us something."}, {"time": 4895, "text": "There is such a sentence that a friend of mine told me, like, whether it wants to work or not."}, {"time": 4901, "text": "So Transformer was clearly an idea that wanted to work."}, {"time": 4904, "text": "And then I think there's some principles we believe will be needed."}, {"time": 4909, "text": "But finding the exact details, details matter so much."}, {"time": 4912, "text": "That's going to be tricky."}, {"time": 4914, "text": "I love the idea that there's like you as a human being, you want some ideas to work."}, {"time": 4921, "text": "And then there's the model that wants some ideas to work and you get to have a conversation to see which more likely the model will win in the end."}, {"time": 4930, "text": "Because it's the one, you don't have to do any work."}, {"time": 4932, "text": "The model is the one that has to do the work."}, {"time": 4934, "text": "So you should listen to the model."}, {"time": 4935, "text": "And I really love this idea that you talked about the humans in this picture."}, {"time": 4939, "text": "If I could just briefly ask, one is you're saying the benchmarks about the modular humans working on this, the benchmarks providing a sturdy ground of a wish to do these things that seem impossible."}, {"time": 4954, "text": "They give you, in the darkest of times, give you hope because little signs of improvement."}, {"time": 4962, "text": "Like somehow you're not lost if you have metrics to measure your improvement."}, {"time": 4968, "text": "And then there's other aspect."}, {"time": 4970, "text": "You said elsewhere and here today, like titles matter."}, {"time": 4976, "text": "I wonder how much humans matter in the evolution of all of this, meaning individual humans."}, {"time": 4986, "text": "Something about their interactions, something about their ideas, how much they change the direction of all of this."}, {"time": 4992, "text": "Like if you change the humans in this picture, is it that the model is sitting there and it wants some idea to work?"}, {"time": 5002, "text": "Or is it the humans, or maybe the model is providing you 20 ideas that could work."}, {"time": 5007, "text": "And depending on the humans you pick, they're going to be able to hear some of those ideas."}, {"time": 5013, "text": "Because you're now directing all of deep learning and deep mind, you get to interact with a lot of projects, a lot of brilliant researchers."}, {"time": 5020, "text": "How much variability is created by the humans in all of this?"}, {"time": 5024, "text": "Yeah, I mean, I do believe humans matter a lot, at the very least at the time scale of years on when things are happening and what's the sequencing of it."}, {"time": 5036, "text": "So you get to interact with people that, I mean, you mentioned this."}, {"time": 5042, "text": "Some people really want some idea to work and they'll persist."}, {"time": 5047, "text": "And then some other people might be more practical, like I don't care what idea works."}, {"time": 5052, "text": "I care about cracking protein folding."}, {"time": 5056, "text": "And at least these two kind of seem opposite sides."}, {"time": 5061, "text": "We need both."}, {"time": 5062, "text": "And we've clearly had both historically, and that made certain things happen earlier or later."}, {"time": 5068, "text": "So definitely humans involved in all of this endeavor have had, I would say, years of change or of ordering how things have happened, which breakthroughs came before, which other breakthroughs, and so on."}, {"time": 5083, "text": "So certainly that does happen."}, {"time": 5085, "text": "And so one other, maybe one other axis of distinction is what I called, and this is most commonly used in reinforcement learning, is the exploration exploitation trade off as well."}, {"time": 5097, "text": "It's not exactly what I meant, although quite related."}, {"time": 5100, "text": "So when you start trying to help others, like you become a bit more of a mentor to a large group of people, be it a project or the deep learning team or something, or even in the community when you interact with people in conferences and so on, you're identifying quickly some things that are explorative or exploitative."}, {"time": 5127, "text": "And it's tempting to try to guide people, obviously."}, {"time": 5130, "text": "I mean, that's what makes our experience."}, {"time": 5133, "text": "We bring it, and we try to shape things sometimes wrongly."}, {"time": 5136, "text": "And there's many times that I've been wrong in the past."}, {"time": 5140, "text": "But it would be wrong to dismiss any sort of the research styles that I'm observing."}, {"time": 5149, "text": "And I often get asked, well, you're in industry, right?"}, {"time": 5152, "text": "So we do have access to large compute scale and so on."}, {"time": 5155, "text": "So there are certain kinds of research I almost feel like we need to do responsibly and so on."}, {"time": 5161, "text": "But it is, Carlos, we have the particle accelerator here, so to speak, in physics."}, {"time": 5166, "text": "So we need to use it."}, {"time": 5167, "text": "We need to answer the questions that we should be answering right now for the scientific progress."}, {"time": 5172, "text": "But then at the same time, I look at many advances, including attention, which was discovered in Montreal initially because of lack of compute, right?"}, {"time": 5182, "text": "So we were working on sequence to sequence with my friends over at Google Brain at the time."}, {"time": 5187, "text": "And we were using, I think, eight GPUs, which was somehow a lot at the time."}, {"time": 5192, "text": "And then I think Montreal was a bit more limited in the scale."}, {"time": 5196, "text": "But then they discovered this content based attention concept that then has obviously triggered things like Transformer."}, {"time": 5203, "text": "Not everything obviously starts Transformer."}, {"time": 5206, "text": "There's always a history that is important to recognize because then you can make sure that then those who might feel now, well, we don't have so much compute, you need to then help them optimize that kind of research that might actually produce amazing change."}, {"time": 5224, "text": "Perhaps it's not as short term as some of these advancements or perhaps it's a different time scale."}, {"time": 5229, "text": "But the people and the diversity of the field is quite critical that we maintain it."}, {"time": 5235, "text": "And at times, especially mixed a bit with hype or other things, it's a bit tricky to be observing maybe too much of the same thinking across the board."}, {"time": 5247, "text": "But the humans definitely are critical."}, {"time": 5250, "text": "And I can think of quite a few personal examples where also someone told me something that had a huge effect onto some idea."}, {"time": 5260, "text": "And then that's why I'm saying at least in terms of years, probably some things do happen."}, {"time": 5266, "text": "And it's also fascinating how constraints somehow are essential for innovation."}, {"time": 5271, "text": "And the other thing you mentioned about engineering, I have a sneaking suspicion."}, {"time": 5274, "text": "Maybe I over, my love is with engineering."}, {"time": 5280, "text": "So I have a sneaky suspicion that all the genius, a large percentage of the genius is in the tiny details of engineering."}, {"time": 5289, "text": "So I think we like to think our genius, the genius is in the big ideas."}, {"time": 5297, "text": "I have a sneaking suspicion that because I've seen the genius of details, of engineering details, make the night and day difference."}, {"time": 5308, "text": "And I wonder if those kind of have a ripple effect over time."}, {"time": 5312, "text": "So that too, so that's sort of taking the engineering perspective that sometimes that quiet innovation at the level of an individual engineer or maybe at the small scale of a few engineers can make all the difference."}, {"time": 5326, "text": "Because we're working on computers that are scaled across large groups, that one engineering decision can lead to ripple effects."}, {"time": 5339, "text": "Yeah, I mean, engineering, there's also kind of a historical, it might be a bit random."}, {"time": 5346, "text": "Because if you think of the history of how especially deep learning and neural networks took off, feels like a bit random because GPUs happened to be there at the right time for a different purpose, which was to play video games."}, {"time": 5360, "text": "So even the engineering that goes into the hardware and it might have a time, the time frame might be very different."}, {"time": 5368, "text": "I mean, the GPUs were evolved throughout many years where we didn't even were looking at that."}, {"time": 5373, "text": "So even at that level, that revolution, so to speak, the ripples are like, we'll see when they stop."}, {"time": 5382, "text": "But in terms of thinking of why is this happening, I think that when I try to categorize it in sort of things that might not be so obvious, I mean, clearly there's a hardware revolution."}, {"time": 5394, "text": "We are surfing thanks to that."}, {"time": 5398, "text": "Data centers as well."}, {"time": 5399, "text": "I mean, data centers are like, I mean, at Google, for instance, obviously they're serving Google."}, {"time": 5404, "text": "But there's also now thanks to that and to have built such amazing data centers, we can train these models."}, {"time": 5411, "text": "Software is an important one."}, {"time": 5413, "text": "I think if I look at the state of how I had to implement things to implement my ideas, how I discarded ideas because they were too hard to implement."}, {"time": 5423, "text": "Yeah, clearly the times have changed."}, {"time": 5425, "text": "And thankfully, we are in a much better software position as well."}, {"time": 5429, "text": "And then, I mean, obviously there's research that happens at scale and more people enter the field."}, {"time": 5435, "text": "That's great to see."}, {"time": 5435, "text": "But it's almost enabled by these other things."}, {"time": 5438, "text": "And last but not least is also data, right?"}, {"time": 5440, "text": "Curating data sets, labeling data sets, these benchmarks we think about."}, {"time": 5444, "text": "Maybe we'll want to have all the benchmarks in one system."}, {"time": 5448, "text": "But it's still very valuable that someone put the thought and the time and the vision to build certain benchmarks."}, {"time": 5454, "text": "We've seen progress thanks to."}, {"time": 5456, "text": "But we're going to repurpose the benchmarks."}, {"time": 5459, "text": "That's the beauty of Atari is like we solved it in a way."}, {"time": 5464, "text": "But we use it in Gato."}, {"time": 5466, "text": "It was critical."}, {"time": 5466, "text": "And I'm sure there's still a lot more to do thanks to that amazing benchmark that someone took the time to put, even though at the time maybe, oh, you have to think what's the next iteration of architectures."}, {"time": 5479, "text": "That's what maybe the field recognizes."}, {"time": 5481, "text": "But that's another thing we need to balance in terms of humans behind."}, {"time": 5485, "text": "We need to recognize all these aspects because they're all critical."}, {"time": 5489, "text": "And we tend to think of the genius, the scientist, and so on."}, {"time": 5494, "text": "But I'm glad I know you have a strong engineering background."}, {"time": 5498, "text": "But also, I'm a lover of data."}, {"time": 5500, "text": "And the pushback on the engineering comment ultimately could be the creators of benchmarks who have the most impact."}, {"time": 5507, "text": "Andrej Karpathy, who you mentioned, has recently been talking a lot of trash about ImageNet, which he has the right to do because of how critical he is about ImageNet, how essential he is to the development and the success of deep learning around ImageNet."}, {"time": 5521, "text": "And he's saying that that's actually that benchmark is holding back the field."}, {"time": 5525, "text": "Because I mean, especially in his context on Tesla Autopilot, that's looking at real world behavior of a system."}, {"time": 5534, "text": "There's something fundamentally missing about ImageNet that doesn't capture the real worldness of things."}, {"time": 5540, "text": "That we need to have data sets, benchmarks that have the unpredictability, the edge cases, whatever the heck it is that makes the real world so difficult to operate in."}, {"time": 5552, "text": "We need to have benchmarks of that."}, {"time": 5554, "text": "But just to think about the impact of ImageNet as a benchmark, and that really puts a lot of emphasis on the importance of a benchmark, both sort of internally a deep mind and as a community."}, {"time": 5566, "text": "So one is coming in from within, like, how do I create a benchmark for me to mark and make progress?"}, {"time": 5575, "text": "And how do I make benchmark for the community to mark and push progress?"}, {"time": 5582, "text": "You have this amazing paper you coauthored, a survey paper called Emergent Abilities of Large Language Models."}, {"time": 5590, "text": "It has, again, the philosophy here that I'd love to ask you about."}, {"time": 5594, "text": "What's the intuition about the phenomena of emergence in neural networks transformed as language models?"}, {"time": 5600, "text": "Is there a magic threshold beyond which we start to see certain performance?"}, {"time": 5607, "text": "And is that different from task to task?"}, {"time": 5609, "text": "Is that us humans just being poetic and romantic?"}, {"time": 5612, "text": "Or is there literally some level at which we start to see breakthrough performance?"}, {"time": 5618, "text": "Yeah, I mean, this is a property that we start seeing in systems that actually tend to be so in machine learning, traditionally, again, going to benchmarks."}, {"time": 5631, "text": "I mean, if you have some input, output, right, like that is just a single input and a single output, you generally, when you train these systems, you see reasonably smooth curves when you analyze how much the data set size affects the performance, or how the model size affects the performance, or how long you train the system for affects the performance, right?"}, {"time": 5659, "text": "So if we think of ImageNet, the training curves look fairly smooth and predictable in a way."}, {"time": 5668, "text": "And I would say that's probably because it's kind of a one hop reasoning task, right?"}, {"time": 5676, "text": "It's like, here is an input, and you think for a few milliseconds or 100 milliseconds, 300 as a human, and then you tell me, yeah, there's an alpaca in this image."}, {"time": 5687, "text": "So in language, we are seeing benchmarks that require more pondering and more thought in a way, right?"}, {"time": 5698, "text": "This is just kind of you need to look for some subtleties."}, {"time": 5702, "text": "It involves inputs that you might think of, even if the input is a sentence describing a mathematical problem, there is a bit more processing required as a human and more introspection."}, {"time": 5715, "text": "So I think how these benchmarks work means that there is actually a threshold."}, {"time": 5724, "text": "Just going back to how transformers work in this way of querying for the right questions to get the right answers, that might mean that performance becomes random until the right question is asked by the querying system of a transformer or of a language model like a transformer."}, {"time": 5742, "text": "And then only then you might start seeing performance going from random to nonrandom."}, {"time": 5750, "text": "And this is more empirical."}, {"time": 5753, "text": "There's no formalism or theory behind this yet, although it might be quite important."}, {"time": 5757, "text": "But we are seeing these phase transitions of random performance until some, let's say, scale of a model."}, {"time": 5764, "text": "And then it goes beyond that."}, {"time": 5766, "text": "And it might be that you need to fit a few low order bits of thought before you can make progress on the whole task."}, {"time": 5777, "text": "And if you could measure, actually, those breakdown of the task, maybe you would see more smooth, like, yeah, once you get these and these and these and these and these, then you start making progress in the task."}, {"time": 5790, "text": "But it's somehow a bit annoying because then it means that certain questions we might ask about architectures possibly can only be done at a certain scale."}, {"time": 5802, "text": "And one thing that, conversely, I've seen great progress on in the last couple of years is this notion of science of deep learning and science of scale in particular."}, {"time": 5815, "text": "So on the negative is that there are some benchmarks for which progress might need to be measured at minimum at a certain scale until you see then what details of the model matter to make that performance better."}, {"time": 5829, "text": "So that's a bit of a con."}, {"time": 5831, "text": "But what we've also seen is that you can empirically analyze behavior of models at scales that are smaller."}, {"time": 5842, "text": "So let's say, to put an example, we had this Chinchilla paper that revised the so called scaling laws of models."}, {"time": 5851, "text": "And that whole study is done at a reasonably small scale, that may be hundreds of millions up to 1 billion parameters."}, {"time": 5858, "text": "And then the cool thing is that you create some loss, some loss that some trends, you extract trends from data that you see, OK, it looks like the amount of data required to train now a 10x larger model would be this."}, {"time": 5872, "text": "And these laws so far, these extrapolations have helped us save compute and just get to a better place in terms of the science of how should we run these models at scale, how much data, how much depth, and all sorts of questions we start asking extrapolating from a small scale."}, {"time": 5890, "text": "But then these emergence is sadly that not everything can be extrapolated from scale depending on the benchmark."}, {"time": 5896, "text": "And maybe the harder benchmarks are not so good for extracting these laws."}, {"time": 5901, "text": "But we have a variety of benchmarks at least."}, {"time": 5904, "text": "So I wonder to which degree the threshold, the phase shift scale is a function of the benchmark."}, {"time": 5912, "text": "So some of the science of scale might be engineering benchmarks where that threshold is low, sort of taking a main benchmark and reducing it somehow where the essential difficulty is left but the scale of which the emergence happens is lower just for the science aspect of it versus the actual real world aspect."}, {"time": 5936, "text": "Yeah, so luckily we have quite a few benchmarks, some of which are simpler or maybe they're more like I think people might call these systems one versus systems two style."}, {"time": 5945, "text": "So I think what we're not seeing luckily is that extrapolations from maybe slightly more smooth or simpler benchmarks are translating to the harder ones."}, {"time": 5958, "text": "But that is not to say that this extrapolation will hit its limits."}, {"time": 5962, "text": "And when it does, then how much we scale or how we scale will sadly be a bit suboptimal until we find better laws."}, {"time": 5971, "text": "And these laws, again, are very empirical laws."}, {"time": 5973, "text": "They're not like physical laws of models, although I wish there would be better theory about these things as well."}, {"time": 5980, "text": "But so far, I would say empirical theory, as I call it, is way ahead than actual theory of machine learning."}, {"time": 5987, "text": "Let me ask you almost for fun."}, {"time": 5990, "text": "So this is not, Oriol, as a deep mind person or anything to do with deep mind or Google, just as a human being, looking at these news of a Google engineer who claimed that, I guess, the lambda language model was sentient."}, {"time": 6011, "text": "And you still need to look into the details of this."}, {"time": 6014, "text": "But making an official report and the claim that he believes there's evidence that this system has achieved sentience."}, {"time": 6025, "text": "And I think this is a really interesting case on a human level, on a psychological level, on a technical machine learning level of how language models transform our world, and also just philosophical level of the role of AI systems in a human world."}, {"time": 6044, "text": "So what do you find interesting?"}, {"time": 6048, "text": "What's your take on all of this as a machine learning engineer and a researcher and also as a human being?"}, {"time": 6054, "text": "Yeah, I mean, a few reactions."}, {"time": 6057, "text": "Quite a few, actually."}, {"time": 6058, "text": "Have you ever briefly thought, is this thing sentient?"}, {"time": 6062, "text": "Right, so never, absolutely never."}, {"time": 6064, "text": "Like even with Alpha Star?"}, {"time": 6068, "text": "Sadly, though, I think, yeah, sadly, I have not."}, {"time": 6071, "text": "Yeah, I think the current, any of the current models, although very useful and very good, yeah, I think we're quite far from that."}, {"time": 6082, "text": "And there's kind of a converse side story."}, {"time": 6085, "text": "So one of my passions is about science in general."}, {"time": 6090, "text": "And I think I feel I'm a bit of a failed scientist."}, {"time": 6094, "text": "That's why I came to machine learning, because you always feel, and you start seeing this, that machine learning is maybe the science that can help other sciences, as we've seen."}, {"time": 6106, "text": "It's such a powerful tool."}, {"time": 6108, "text": "So thanks to that angle, that, OK, I love science."}, {"time": 6112, "text": "I love, I mean, I love astronomy."}, {"time": 6113, "text": "I love biology."}, {"time": 6114, "text": "But I'm not an expert."}, {"time": 6116, "text": "And I decided, well, the thing I can do better at is computers."}, {"time": 6119, "text": "But having, especially with when I was a bit more involved in AlphaFold, learning a bit about proteins and about biology and about life, the complexity, it feels like it really is."}, {"time": 6134, "text": "I mean, if you start looking at the things that are going on at the atomic level, and also, I mean, there's obviously the, we are maybe inclined to try to think of neural networks as like the brain."}, {"time": 6150, "text": "But the complexities and the amount of magic that it feels when, I mean, I'm not an expert, so it naturally feels more magic."}, {"time": 6158, "text": "But looking at biological systems, as opposed to these computational brains, just makes me like, wow, there's such a level of complexity difference still, like orders of magnitude complexity that, sure, these weights, I mean, we train them and they do nice things."}, {"time": 6178, "text": "But they're not at the level of biological entities, brains, cells."}, {"time": 6186, "text": "It just feels like it's just not possible to achieve the same level of complexity behavior."}, {"time": 6192, "text": "And my belief, when I talk to other beings, is certainly shaped by this amazement of biology that, maybe because I know too much, I don't have about machine learning, but I certainly feel it's very far fetched and far in the future to be calling or to be thinking, well, this mathematical function that is differentiable is, in fact, sentient and so on."}, {"time": 6219, "text": "There's something on that point that is very interesting."}, {"time": 6222, "text": "So you know enough about machines and enough about biology to know that there's many orders of magnitude of difference and complexity."}, {"time": 6231, "text": "But you know how machine learning works."}, {"time": 6236, "text": "So the interesting question for human beings that are interacting with a system that don't know about the underlying complexity."}, {"time": 6242, "text": "And I've seen people, probably including myself, that have fallen in love with things that are quite simple."}, {"time": 6248, "text": "And so maybe the complexity is one part of the picture, but maybe that's not a necessary condition for sentience, for perception or emulation of sentience."}, {"time": 6265, "text": "So I mean, I guess the other side of this is that's how I feel personally."}, {"time": 6269, "text": "I mean, you asked me about the person, right?"}, {"time": 6272, "text": "Now, it's very interesting to see how other humans feel about things, right?"}, {"time": 6277, "text": "We are, again, I'm not as amazed about things that I feel this is not as magical as this other thing because of maybe how I got to learn about it and how I see the curve a bit more smooth because I've just seen the progress of language models since Shannon in the 50s."}, {"time": 6296, "text": "And actually looking at that time scale, we're not that fast progress, right?"}, {"time": 6300, "text": "I mean, what we were thinking at the time almost 100 years ago is not that dissimilar to what we're doing now."}, {"time": 6308, "text": "But at the same time, yeah, obviously others, my experience, the personal experience, I think no one should tell others how they should feel."}, {"time": 6320, "text": "I mean, the feelings are very personal, right?"}, {"time": 6322, "text": "So how others might feel about the models and so on."}, {"time": 6326, "text": "That's one part of the story that is important to understand for me personally as a researcher."}, {"time": 6366, "text": "Versus then the complexity of the creation of humans from their inception, right?"}, {"time": 6373, "text": "And also the complexity of evolution of the whole universe to where we are that feels orders of magnitude more complex and fascinating to me."}, {"time": 6383, "text": "So I think, yeah, maybe part of the only thing I'm thinking about trying to tell you is, yeah, I think explaining a bit of the magic."}, {"time": 6392, "text": "There is a bit of magic."}, {"time": 6393, "text": "It's good to be in love, obviously, with what you do at work."}, {"time": 6396, "text": "And I'm certainly fascinated and surprised quite often as well."}, {"time": 6401, "text": "But I think, hopefully, as experts in biology, hopefully will tell me this is not as magic."}, {"time": 6407, "text": "And I'm happy to learn that through interactions with the larger community, we can also have a certain level of education that in practice also will matter because, I mean, one question is how you feel about this."}, {"time": 6420, "text": "But then the other very important is you starting to interact with these in products and so on."}, {"time": 6426, "text": "It's good to understand a bit what's going on, what's not going on, what's safe, what's not safe, and so on, right?"}, {"time": 6433, "text": "Otherwise, the technology will not be used properly for good, which is obviously the goal of all of us, I hope."}, {"time": 6440, "text": "So let me then ask the next question."}, {"time": 6442, "text": "Do you think in order to solve intelligence or to replace the leg spot that does interviews as we started this conversation with, do you think the system needs to be sentient?"}, {"time": 6454, "text": "Do you think it needs to achieve something like consciousness?"}, {"time": 6458, "text": "And do you think about what consciousness is in the human mind that could be instructive for creating AI systems?"}, {"time": 6467, "text": "Honestly, I think probably not to the degree of intelligence that there's this brain that can learn, can be extremely useful, can challenge you, can teach you."}, {"time": 6482, "text": "Conversely, you can teach it to do things."}, {"time": 6485, "text": "I'm not sure it's necessary, personally speaking."}, {"time": 6489, "text": "But if consciousness or any other biological or evolutionary lesson can be repurposed to then influence our next set of algorithms, that is a great way to actually make progress, right?"}, {"time": 6505, "text": "And the same way I try to explain transformers a bit how it feels we operate when we look at text specifically, these insights are very important, right?"}, {"time": 6516, "text": "So there's a distinction between details of how the brain might be doing computation."}, {"time": 6523, "text": "I think my understanding is, sure, there's neurons and there's some resemblance to neural networks, but we don't quite understand enough of the brain in detail, right, to be able to replicate it."}, {"time": 6535, "text": "But then if you zoom out a bit, our thought process, how memory works, maybe even how evolution got us here, what's exploration, exploitation, like how these things happen, I think these clearly can inform algorithmic level research."}, {"time": 6552, "text": "And I've seen some examples of this being quite useful to then guide the research, even it might be for the wrong reasons, right?"}, {"time": 6561, "text": "So I think biology and what we know about ourselves can help a whole lot to build, essentially, what we call AGI, this general, the real ghetto, right?"}, {"time": 6574, "text": "The last step of the chain, hopefully."}, {"time": 6576, "text": "But consciousness in particular, I don't myself at least think too hard about how to add that to the system."}, {"time": 6584, "text": "But maybe my understanding is also very personal about what it means, right?"}, {"time": 6588, "text": "I think even that in itself is a long debate that I know people have often."}, {"time": 6595, "text": "And maybe I should learn more about this."}, {"time": 6597, "text": "Yeah, and I personally, I notice the magic often on a personal level, especially with physical systems like robots."}, {"time": 6606, "text": "I have a lot of legged robots now in Austin that I play with."}, {"time": 6611, "text": "And even when you program them, when they do things you didn't expect, there's an immediate anthropomorphization."}, {"time": 6618, "text": "And you notice the magic, and you start to think about things like sentience that has to do more with effective communication and less with any of these kind of dramatic things."}, {"time": 6630, "text": "It seems like a useful part of communication."}, {"time": 6632, "text": "Having the perception of consciousness seems like useful for us humans."}, {"time": 6638, "text": "We treat each other more seriously."}, {"time": 6640, "text": "We are able to do a nearest neighbor shoving of that entity into your memory correctly, all that kind of stuff."}, {"time": 6648, "text": "It seems useful, at least to fake it, even if you never make it."}, {"time": 6652, "text": "So maybe, like, yeah, mirroring the question."}, {"time": 6655, "text": "And since you talked to a few people, then you do think that we'll need to figure something out in order to achieve intelligence in a grander sense of the word."}, {"time": 6666, "text": "Yeah, I personally believe yes, but I don't even think it'll be like a separate island we'll have to travel to."}, {"time": 6674, "text": "I think it will emerge quite naturally."}, {"time": 6676, "text": "OK, that's easier for us then."}, {"time": 6680, "text": "But the reason I think it's important to think about is you will start, I believe, like with this Google engineer, you will start seeing this a lot more, especially when you have AI systems that are actually interacting with human beings that don't have an engineering background."}, {"time": 6695, "text": "And we have to prepare for that."}, {"time": 6698, "text": "Because I do believe there will be a civil rights movement for robots, as silly as it is to say."}, {"time": 6704, "text": "There's going to be a large number of people that realize there's these intelligent entities with whom I have a deep relationship, and I don't want to lose them."}, {"time": 6713, "text": "They've come to be a part of my life, and they mean a lot."}, {"time": 6715, "text": "They have a name."}, {"time": 6717, "text": "They have a story."}, {"time": 6718, "text": "They have a memory."}, {"time": 6719, "text": "And we start to ask questions about ourselves."}, {"time": 6721, "text": "Well, this thing sure seems like it's capable of suffering, because it tells all these stories of suffering."}, {"time": 6729, "text": "It doesn't want to die and all those kinds of things."}, {"time": 6731, "text": "And we have to start to ask ourselves questions."}, {"time": 6734, "text": "What is the difference between a human being and this thing?"}, {"time": 6736, "text": "And so when you engineer, I believe from an engineering perspective, from a deep mind or anybody that builds systems, there might be laws in the future where you're not allowed to engineer systems with displays of sentience, unless they're explicitly designed to be that, unless it's a pet."}, {"time": 6757, "text": "So if you have a system that's just doing customer support, you're legally not allowed to display sentience."}, {"time": 6764, "text": "We'll start to ask ourselves that question."}, {"time": 6767, "text": "And then so that's going to be part of the software engineering process."}, {"time": 6772, "text": "Which features do we have?"}, {"time": 6773, "text": "And one of them is communications of the sentience."}, {"time": 6776, "text": "But it's important to start thinking about that stuff, especially how much it captivates public attention."}, {"time": 6783, "text": "It's definitely a topic that is important."}, {"time": 6786, "text": "We think about."}, {"time": 6787, "text": "And I think in a way, I always see not every movie is equally on point with certain things."}, {"time": 6796, "text": "But certainly science fiction in this sense at least has prepared society to start thinking about certain topics that even if it's too early to talk about, as long as we are reasonable, it's certainly going to prepare us for both the research to come and how to."}, {"time": 6814, "text": "I mean, there's many important challenges and topics that come with building an intelligent system, many of which you just mentioned."}, {"time": 6824, "text": "So I think we're never going to be fully ready unless we talk about these."}, {"time": 6831, "text": "And we start also, as I said, just expanding the people we talk to not include only our own researchers and so on."}, {"time": 6843, "text": "And in fact, places like DeepMind but elsewhere, there's more interdisciplinary groups forming up to start asking and really working with us on these questions."}, {"time": 6854, "text": "Because obviously, this is not initially what your passion is when you do your PhD, but certainly it is coming."}, {"time": 6863, "text": "It's the thing that brings me to one of my passions that is learning."}, {"time": 6868, "text": "So in this sense, this is a new area that, as a learning system myself, I want to keep exploring."}, {"time": 6876, "text": "And I think it's great to see parts of the debate."}, {"time": 6881, "text": "And even I've seen a level of maturity in the conferences that deal with AI."}, {"time": 6886, "text": "If you look five years ago to now, just the amount of workshops and so on has changed so much."}, {"time": 6893, "text": "It's impressive to see how much topics of safety, ethics, and so on come to the surface, which is great."}, {"time": 6901, "text": "And if it were too early, clearly it's fine."}, {"time": 6903, "text": "I mean, it's a big field, and there's lots of people with lots of interests that will do progress or make progress."}, {"time": 6911, "text": "And obviously, I don't believe we're too late."}, {"time": 6914, "text": "So in that sense, I think it's great that we're doing this already."}, {"time": 6918, "text": "It better be too early than too late when it comes to super intelligent AI systems."}, {"time": 6922, "text": "Let me ask, speaking of sentient AIs, you gave props to your friend Ilyas Etzgever for being elected the fellow of the Royal Society."}, {"time": 6931, "text": "So just as a shout out to a fellow researcher and a friend, what's the secret to the genius of Ilyas Etzgever?"}, {"time": 6939, "text": "And also, do you believe that his tweets, as you've hypothesized and Andrej Karpathy did as well, are generated by a language model?"}, {"time": 6949, "text": "So I strongly believe Ilya is going to visit in a few weeks, actually."}, {"time": 6954, "text": "So I'll ask him in person."}, {"time": 6958, "text": "Will he tell you the truth?"}, {"time": 6959, "text": "Yes, of course, hopefully."}, {"time": 6960, "text": "I mean, ultimately, we all have shared paths, and there's friendships that go beyond, obviously, institutions and so on."}, {"time": 6969, "text": "So I hope he tells me the truth."}, {"time": 6971, "text": "Well, maybe the AI system is holding him hostage somehow."}, {"time": 6974, "text": "Maybe he has some videos that he doesn't want to release."}, {"time": 6976, "text": "So maybe it has taken control over him."}, {"time": 6979, "text": "So he can't tell the truth."}, {"time": 6980, "text": "Well, if I see him in person, then I think he will know."}, {"time": 6983, "text": "But I think Ilya's personality, just knowing him for a while, everyone in Twitter, I guess, gets a different persona."}, {"time": 6996, "text": "And I think Ilya's one does not surprise me."}, {"time": 7000, "text": "So I think knowing Ilya from before social media and before AI was so prevalent, I recognize a lot of his character."}, {"time": 7007, "text": "So that's something for me that I feel good about a friend that hasn't changed or is still true to himself."}, {"time": 7015, "text": "Obviously, there is, though, a fact that your field becomes more popular, and he is obviously one of the main figures in the field, having done a lot of advancement."}, {"time": 7027, "text": "So I think that the tricky bit here is how to balance your true self with the responsibility that your words carry."}, {"time": 7033, "text": "So in this sense, I appreciate the style, and I understand it."}, {"time": 7039, "text": "But it created debates on some of his tweets that maybe it's good we have them early anyways."}, {"time": 7047, "text": "But yeah, then the reactions are usually polarizing."}, {"time": 7051, "text": "I think we're just seeing the reality of social media be there as well, reflected on that particular topic or set of topics he's tweeting about."}, {"time": 7060, "text": "Yeah, I mean, it's funny that he used to speak to this tension."}, {"time": 7062, "text": "He was one of the early seminal figures in the field of deep learning, so there's a responsibility with that."}, {"time": 7068, "text": "But he's also, from having interacted with him quite a bit, he's just a brilliant thinker about ideas, which, as are you."}, {"time": 7081, "text": "And there's a tension between becoming the manager versus the actual thinking through very novel ideas, the scientist versus the manager."}, {"time": 7093, "text": "And he's one of the great scientists of our time."}, {"time": 7097, "text": "So this was quite interesting."}, {"time": 7098, "text": "And also, people tell me quite silly, which I haven't quite detected yet."}, {"time": 7103, "text": "But in private, we'll have to see about that."}, {"time": 7107, "text": "I mean, just on the point of, I mean, Ilya has been an inspiration."}, {"time": 7113, "text": "I mean, quite a few colleagues, I can think, shaped the person you are."}, {"time": 7118, "text": "Like, Ilya certainly gets probably the top spot, if not close to the top."}, {"time": 7123, "text": "And if we go back to the question about people in the field, like how their role would have changed the field or not, I think Ilya's case is interesting because he really has a deep belief in the scaling up of neural networks."}, {"time": 7139, "text": "There was a talk that is still famous to this day from the Sequence to Sequence paper, where he was just claiming, just give me supervised data and a large neural network, and then you'll solve basically all the problems."}, {"time": 7156, "text": "That vision was already there many years ago."}, {"time": 7159, "text": "So it's good to see someone who is, in this case, very deeply into this style of research and clearly has had a tremendous track record of successes and so on."}, {"time": 7174, "text": "The funny bit about that talk is that we rehearsed the talk in a hotel room before, and the original version of that talk would have been even more controversial."}, {"time": 7184, "text": "So maybe I'm the only person that has seen the unfiltered version of the talk."}, {"time": 7189, "text": "And maybe when the time comes, maybe we should revisit some of the skip slides from the talk from Ilya."}, {"time": 7197, "text": "But I really think the deep belief into some certain style of research pays out, is good to be practical sometimes."}, {"time": 7206, "text": "And I actually think Ilya and myself are practical, but it's also good."}, {"time": 7210, "text": "There's some sort of long term belief and trajectory."}, {"time": 7214, "text": "Obviously, there's a bit of lack involved, but it might be that that's the right path."}, {"time": 7218, "text": "Then you clearly are ahead and hugely influential to the field as he has been."}, {"time": 7223, "text": "Do you agree with that intuition that maybe was written about by Rich Sutton in The Bitter Lesson, that the biggest lesson that can be read from 70 years of AI research is that general methods that leverage computation are ultimately the most effective?"}, {"time": 7242, "text": "Do you think that intuition is ultimately correct?"}, {"time": 7248, "text": "General methods that leverage computation, allowing the scaling of computation to do a lot of the work."}, {"time": 7256, "text": "And so the basic task of us humans is to design methods that are more and more general versus more and more specific to the tasks at hand."}, {"time": 7267, "text": "I certainly think this essentially mimics a bit of the deep learning research, almost like philosophy, that on the one hand, we want to be data agnostic."}, {"time": 7280, "text": "We don't want to preprocess data sets."}, {"time": 7282, "text": "We want to see the bytes, the true data as it is, and then learn everything on top."}, {"time": 7287, "text": "So very much agree with that."}, {"time": 7290, "text": "And I think scaling up feels, at the very least, again, necessary for building incredible complex systems."}, {"time": 7298, "text": "It's possibly not sufficient, barring that we need a couple of breakthroughs."}, {"time": 7305, "text": "I think Reed Sutton mentioned search being part of the equation of scale and search."}, {"time": 7312, "text": "I think search, I've seen it, that's been more mixed in my experience."}, {"time": 7317, "text": "So from that lesson in particular, search is a bit more tricky because it is very appealing to search in domains like Go, where you have a clear reward function that you can then discard some search traces."}, {"time": 7361, "text": "So I've seen examples of it being literally mapped to search and scale."}, {"time": 7366, "text": "I'm not so convinced about the search bit, but certainly I'm convinced scale will be needed."}, {"time": 7371, "text": "So we need general methods."}, {"time": 7372, "text": "We need to test them, and maybe we need to make sure that we can scale them given the hardware that we have in practice."}, {"time": 7379, "text": "But then maybe we should also shape how the hardware looks like based on which methods might be needed to scale."}, {"time": 7385, "text": "And that's an interesting contrast of these GPU comments that is we got it for free almost because games were using these."}, {"time": 7395, "text": "But maybe now if sparsity is required, we don't have the hardware."}, {"time": 7400, "text": "Although in theory, many people are building different kinds of hardware these days."}, {"time": 7404, "text": "But there's a bit of this notion of hardware lottery for scale that might actually have an impact at least on the scale of years on how fast we will make progress to maybe a version of neural nets or whatever comes next that might enable truly intelligent agents."}, {"time": 7424, "text": "Do you think in your lifetime we will build an AGI system that would undeniably be a thing that achieves human level intelligence and goes far beyond?"}, {"time": 7438, "text": "I definitely think it's possible that it will go far beyond."}, {"time": 7443, "text": "But I'm definitely convinced that it will be human level intelligence."}, {"time": 7448, "text": "And I'm hypothesizing about the beyond because the beyond bit is a bit tricky to define, especially when we look at the current formula of starting from this imitation learning standpoint."}, {"time": 7463, "text": "So we can certainly imitate humans at language and beyond."}, {"time": 7470, "text": "So getting at human level through imitation feels very possible."}]}]