[{"title": "Gavin Miller: Adobe Research | Lex Fridman Podcast #23", "id": "q0mokx-iiws", "quotes": [{"time": 300, "text": "So I was kind of in love with this idea of magical realism and whether it was possible to do that with technology."}, {"time": 304, "text": "So that was a case where the sort of the agent sort of intrigued me from a literary point of view and became a personality."}, {"time": 310, "text": "I think more recently, I've also written plays and when plays you write dialogue and obviously you write a fixed set of dialogue that follows a linear narrative."}, {"time": 323, "text": "But with modern agents, as you design a personality or a capability for conversation, you're sort of thinking of, I kind of have imaginary dialogue in my head."}, {"time": 333, "text": "And then I think, what would it take not only to have that be real, but for it to really know what it's talking about."}, {"time": 338, "text": "So it's easy to fall into the uncanny valley with AI where it says something it doesn't really understand, but it sounds good to the person."}, {"time": 348, "text": "But you rapidly realize that it's kind of just stimulus response."}, {"time": 348, "text": "It doesn't really have real world knowledge about the thing it's describing."}, {"time": 355, "text": "And so when you get to that point, it really needs to have multiple ways of talking about the same concept."}, {"time": 361, "text": "So it sounds as though it really understands it."}, {"time": 365, "text": "Now, what really understanding means is in the eye of the beholder, right?"}, {"time": 365, "text": "But if it only has one way of referring to something, it feels like it's a canned response."}, {"time": 371, "text": "But if it can reason about it, or you can go at it from multiple angles and give a similar kind of response that people would, then it starts to seem more like there's something there that's sentient."}, {"time": 388, "text": "You can say the same thing, multiple things from different perspectives."}, {"time": 388, "text": "I mean, with the automatic image captioning that I've seen the work that you're doing, there's elements of that, right?"}, {"time": 397, "text": "Being able to generate different kinds of statements about the same picture."}, {"time": 400, "text": "So in my team, there's a lot of work on turning a medium from one form to another, whether it's auto tagging imagery or making up full sentences about what's in the image, then changing the sentence, finding another image that matches the new sentence or vice versa."}, {"time": 418, "text": "And in the modern world of GANs, you sort of give it a description and it synthesizes an asset that matches the description."}, {"time": 426, "text": "So I've sort of gone on a journey."}, {"time": 426, "text": "My early days in my career were about 3D computer graphics, the sort of pioneering work, sort of before movies had special effects done with 3D graphics, and sort of rode that revolution."}, {"time": 437, "text": "And that was very much like the Renaissance where people would model light and color and shape and everything."}, {"time": 445, "text": "And now we're kind of in another wave where it's more impressionistic and it's sort of the idea of something can be used to generate an image directly, which is sort of the new frontier in computer image generation using AI algorithms."}, {"time": 463, "text": "So the creative process is more in the space of ideas or becoming more in the space of ideas versus in the raw pixels?"}, {"time": 470, "text": "Well, it's interesting."}, {"time": 470, "text": "I think at Adobe, we really want to span the entire range from really, really good, what you might call low level tools by low level as close to say, analog workflows as possible."}, {"time": 482, "text": "So what we do there is we make up systems that do really realistic oil paint and watercolor simulations."}, {"time": 488, "text": "So if you want every bristle to behave as it would in the real world and leave a beautiful analog trail of water and then flow after you've made the brushstroke, you can do that."}, {"time": 498, "text": "And that's really important for people who want to create something really expressive or really novel because they have complete control."}, {"time": 506, "text": "And then as certain other tasks become automated, it frees the artists up to focus on the inspiration and less of the perspiration."}, {"time": 515, "text": "So thinking about different ideas, obviously."}, {"time": 515, "text": "Once you finish the design, there's a lot of work to, say, do it for all the different aspect ratio of phones or websites and so on."}, {"time": 528, "text": "And that used to take up an awful lot of time for artists."}, {"time": 531, "text": "It still does for many what we call content velocity."}, {"time": 531, "text": "And one of the targets of AI is actually to reason about from the first example of what are the likely intent for these other formats?"}, {"time": 543, "text": "Maybe if you change the language to German and the words are longer, how do you reflow everything so that it looks nicely artistic in that way?"}, {"time": 552, "text": "And so the person can focus on the really creative bit in the middle, which is what is the look and style and feel and what's the message and what's the story and the human element?"}, {"time": 561, "text": "So I think creativity is changing."}, {"time": 561, "text": "So that's one way in which we're trying to just make it easier and faster and cheaper to do so that there can be more of it, more demand because it's less expensive."}, {"time": 573, "text": "So everyone wants beautiful artwork for everything from a school website to Hollywood movie."}, {"time": 579, "text": "On the other side, as some of these things have automatic versions of them, people will possibly change role from being the hands on artisan to being either the art director or the conceptual artist."}, {"time": 593, "text": "And then the computer will be a partner to help create polished examples of the idea that they're exploring."}, {"time": 599, "text": "Let's talk about Adobe products, AI and Adobe products."}, {"time": 602, "text": "Just so you know where I'm coming from, I'm a huge fan of Photoshop for images, Premiere for video, Audition for audio."}, {"time": 612, "text": "I'll probably use Photoshop to create the thumbnail for this video, Premiere to edit the video, Audition to do the audio."}, {"time": 619, "text": "That said, everything I do is really manually and I set up, I use this old school Kinesis keyboard and I have auto hotkey that just, it's really about optimizing the flow."}, {"time": 632, "text": "Of just making sure there's as few clicks as possible, so just being extremely efficient, something you started to speak to."}, {"time": 639, "text": "So before we get into the fun sort of awesome deep learning things, where does AI, if you could speak a little more to it, AI or just automation in general, do you see in the coming months and years or in general, prior in 2018, fitting into making the life, the low level pixel work flow easier?"}, {"time": 664, "text": "Yeah, that's a great question."}, {"time": 665, "text": "So we have a very rich array of algorithms already in Photoshop, just classical procedural algorithms as well as ones based on data."}, {"time": 674, "text": "In some cases, they end up with a large number of sliders and degrees of freedom."}, {"time": 680, "text": "So one way in which AI can help is just an auto button, which comes up with default settings based on the content itself rather than default values for the tool."}, {"time": 689, "text": "At that point, you then start tweaking."}, {"time": 691, "text": "So that's a very kind of make life easier for people whilst making use of common sense from other example images."}, {"time": 699, "text": "So like smart defaults."}, {"time": 700, "text": "Smart defaults, absolutely."}, {"time": 702, "text": "Another one is something we've spent a lot of work over the last 20 years I've been at Adobe, or 19, thinking about selection, for instance, where, you know, with quick select, you would look at color boundaries and figure out how to sort of flood fill into regions that you thought were physically connected in the real world."}, {"time": 723, "text": "But that algorithm had no visual common sense about what a cat looks like or a dog."}, {"time": 728, "text": "It would just do it based on rules of thumb, which were applied to graph theory."}, {"time": 732, "text": "And it was a big improvement over the previous work where you had sort of almost click everything by hand."}, {"time": 739, "text": "Or if it just did similar colors, it would do little tiny regions that wouldn't be connected."}, {"time": 744, "text": "But in the future, using neural nets to actually do a great job with, say, a single click or even in the case of well known categories like people or animals, no click where you just say select the object and it just knows the dominant object is a person in the middle of the photograph."}, {"time": 760, "text": "Those kinds of things are really valuable if they can be robust enough to give you good quality results or they can be a great start for like tweaking it."}, {"time": 771, "text": "So, for example, background removal."}, {"time": 774, "text": "Like one thing I'll, in a thumbnail, I'll take a picture of you right now and essentially remove the background behind you."}, {"time": 781, "text": "And I want to make that as easy as possible."}, {"time": 784, "text": "You don't have flowing hair, like rich at the moment."}, {"time": 788, "text": "I had it in the past."}, {"time": 790, "text": "It may come again in the future."}, {"time": 793, "text": "So that sometimes makes it a little more challenging to remove the background."}, {"time": 797, "text": "How difficult do you think is that problem for AI for basically making the quick selection tool smarter and smarter and smarter?"}, {"time": 805, "text": "Well, we have a lot of research on that already."}, {"time": 806, "text": "If you want a sort of quick, cheap and cheerful, look, I'm pretending I'm in Hawaii, but it's sort of a joke, then you don't need perfect boundaries."}, {"time": 816, "text": "And you can do that today with a single click with the algorithms we have."}, {"time": 820, "text": "We have other algorithms where with a little bit more guidance on the boundaries, like you might need to touch it up a little bit."}, {"time": 828, "text": "We have other algorithms that can pull a nice mat from a crude selection."}, {"time": 833, "text": "So we have combinations of tools that can do all of that."}, {"time": 837, "text": "And at our recent Max conference at Adobe Max, we demonstrated how very quickly, just by drawing a simple polygon around the object of interest, we could not only do it for a single still, but we could pull a mat, well, pull at least a selection mask from a moving target, like a person dancing in front of a brick wall or something."}, {"time": 859, "text": "And so it's going from hours to a few seconds for workflows that are really nice, and then you might go in and touch up a little."}, {"time": 868, "text": "So that's a really interesting question."}, {"time": 870, "text": "You mentioned the word robust."}, {"time": 871, "text": "You know, there's like a journey for an idea, right?"}, {"time": 876, "text": "And what you presented probably at Max has elements of just sort of, it inspires the concept, it can work pretty well in a majority of cases."}, {"time": 885, "text": "But how do you make something that works, well, in majority of cases, how do you make something that works, maybe in all cases, or it becomes a robust tool that can... Well, there are a couple of things."}, {"time": 897, "text": "So that really touches on the difference between academic research and industrial research."}, {"time": 902, "text": "So in academic research, it's really about who's the person to have the great new idea that shows promise."}, {"time": 909, "text": "And we certainly love to be those people too."}, {"time": 912, "text": "But we have sort of two forms of publishing."}, {"time": 915, "text": "One is academic peer review, which we do a lot of, and we have great success there as much as some universities."}, {"time": 922, "text": "But then we also have shipping, which is a different type of... And then we get customer review, as well as, you know, product critics."}, {"time": 930, "text": "And that might be a case where it's not about being perfect every single time, but perfect enough of the time, plus a mechanism to intervene and recover where you do have mistakes."}, {"time": 943, "text": "So we have the luxury of very talented customers."}, {"time": 946, "text": "We don't want them to be overly taxed doing it every time."}, {"time": 950, "text": "But if they can go in and just take it from 99 to 100 with the touch of a mouse or something, then for the professional end, that's something that we definitely want to support as well."}, {"time": 963, "text": "And for them, it went from having to do that tedious task all the time to much less often."}, {"time": 969, "text": "So I think that gives us an out."}, {"time": 969, "text": "If it had to be 100% automatic all the time, then that would delay the time at which we could get to market."}, {"time": 979, "text": "So on that thread, maybe you can untangle something."}, {"time": 983, "text": "Again, I'm sort of just speaking to my own experience."}, {"time": 988, "text": "Maybe that is the most useful."}, {"time": 990, "text": "So I think Photoshop, as an example, or Premiere, has a lot of amazing features that I haven't touched."}, {"time": 1001, "text": "And so in terms of AI helping make my life or the life of creatives easier, this collaboration between human and machine, how do you learn to collaborate better?"}, {"time": 1017, "text": "How do you learn the new algorithms?"}, {"time": 1018, "text": "Is it something where you have to watch tutorials and you have to watch videos and so on?"}, {"time": 1023, "text": "Or do you think about the experience itself through exploration, being the teacher?"}, {"time": 1030, "text": "We absolutely do."}, {"time": 1031, "text": "So I'm glad that you brought this up."}, {"time": 1035, "text": "We sort of think about two things."}, {"time": 1037, "text": "One is helping the person in the moment to do the task that they need to do, but the other is thinking more holistically about their journey learning a tool."}, {"time": 1044, "text": "And when it's like, think of it as Adobe University, where you use the tool long enough, you become an expert."}, {"time": 1050, "text": "And not necessarily an expert in everything."}, {"time": 1052, "text": "It's like living in a city."}, {"time": 1053, "text": "You don't necessarily know every street, but you know the important ones you need to get to."}, {"time": 1058, "text": "So we have projects in research, which actually look at the thousands of hours of tutorials online and try to understand what's being taught in them."}, {"time": 1066, "text": "And then we had one publication at CHI where it was looking at, given the last three or four actions you did, what did other people in tutorials do next?"}, {"time": 1074, "text": "So if you want some inspiration for what you might do next, or you just want to watch the tutorial and see, learn from people who are doing similar workflows to you, you can without having to go and search on keywords and everything."}, {"time": 1086, "text": "So really trying to use the context of your use of the app to make intelligent suggestions, either about choices that you might make, or in a more assistive way, where it could say, if you did this next, we could show you."}, {"time": 1101, "text": "And that's basically the frontier that we're exploring now, which is, if we really deeply understand the domain in which designers and creative people work, can we combine that with AI and pattern matching of behavior to make intelligent suggestions, either through, you know, verbal, possibilities, or just showing the results of if you try this."}, {"time": 1121, "text": "And that's really the sort of, you know, I was in a meeting today thinking about these things."}, {"time": 1130, "text": "Well, it's still a grand challenge."}, {"time": 1130, "text": "You know, we'd all love an artist over one shoulder and a teacher over the other, right?"}, {"time": 1137, "text": "And we hope to get there."}, {"time": 1137, "text": "And the right thing to do is to give enough at each stage that it's useful in itself, but it builds a foundation for the next stage."}, {"time": 1147, "text": "Give enough at each stage that it's useful in itself, but it builds a foundation for the next level of expectation."}, {"time": 1154, "text": "Are you aware of this gigantic medium of YouTube that's creating just a bunch of creative people, both artists and teachers of different kinds?"}, {"time": 1166, "text": "And the more we can understand those media types, both visually and in terms of transcripts and words, the more we can bring the wisdom that they embody into the guidance that's embedded in the tool."}, {"time": 1178, "text": "That would be brilliant to remove the barrier from having to yourself type in the keyword searching, so on."}, {"time": 1185, "text": "And then in the longer term, an interesting discussion is, does it ultimately not just assist with learning the interface we have, but does it modify the interface to be simpler?"}, {"time": 1196, "text": "Or do you fragment into a variety of tools, each of which has a different level of visibility of the functionality?"}, {"time": 1202, "text": "I like to say that if you add a feature to a GUI, you have to have yet more visual complexity confronting the new user."}, {"time": 1208, "text": "Whereas if you have an assistant with a new skill, if you know they have it, so you know to ask for it, then it's sort of additive without being more intimidating."}, {"time": 1220, "text": "So we definitely think about new users and how to onboard them."}, {"time": 1225, "text": "Many actually value the idea of being able to master that complex interface and keyboard shortcuts like you were talking about earlier, because with great familiarity, it becomes a musical instrument for expressing your visual ideas."}, {"time": 1237, "text": "And other people just want to get something done quickly in the simplest way possible."}, {"time": 1243, "text": "And that's where a more assistive version of the same technology might be useful, maybe on a different class of device, which is more in context for CAPTCHA, say."}, {"time": 1255, "text": "Whereas somebody who's in a deep post production workflow maybe want to be on a laptop or a big screen desktop and have more knobs and dials to really express the subtlety of what they want to do."}, {"time": 1295, "text": "Can you talk through a favorite or some of them or examples that popped in mind?"}, {"time": 1304, "text": "I'm sure I'll be able to provide links to other ones we don't talk about because there's visual elements to all of them that are exciting."}, {"time": 1318, "text": "Why they're interesting for different reasons might be a good way to go."}, {"time": 1318, "text": "So I think sky replace is interesting because we talked about selection being sort of an atomic operation."}, {"time": 1323, "text": "It's almost like if you think of an assembly language, it's like a single instruction."}, {"time": 1328, "text": "Whereas sky replace is a compound action where you automatically select the sky, you look for stock content that matches the geometry of the scene."}, {"time": 1341, "text": "You try to have variety in your choices so that you do coverage of different moods."}, {"time": 1347, "text": "It then mats in the sky behind the foreground."}, {"time": 1347, "text": "But then importantly, it uses the foreground of the other image that you just searched on to recolor the foreground of the image that you're editing."}, {"time": 1359, "text": "So if you say go from a midday sky to an evening sky, it will actually add sort of an orange glow to the foreground objects as well."}, {"time": 1371, "text": "I was a big fan in college of Magritte and he has a number of paintings where it's surrealism because he'll like do a composite, but the foreground building will be at night and the sky will be during the day."}, {"time": 1381, "text": "There's one called The Empire of Light, which was on my wall in college."}, {"time": 1386, "text": "And we're trying not to do surrealism."}, {"time": 1386, "text": "It can be a choice, but we'd rather have it be natural by default rather than it looking fake."}, {"time": 1393, "text": "And then you have to do a whole bunch of post production to fix it."}, {"time": 1397, "text": "So that's a case where we're kind of capturing an entire workflow into a single action and doing it in about a second rather than a minute or two."}, {"time": 1403, "text": "And when you do that, you can not just do it once, but you can do it for say like 10 different backgrounds."}, {"time": 1409, "text": "And then you're almost back to this inspiration idea of I don't know quite what I want, but I'll know it when I see it."}, {"time": 1419, "text": "And you can just explore the design space as close to final production value as possible."}, {"time": 1425, "text": "And then when you really pick one, you might go back and slightly tweak the selection mask just to make it perfect and do that kind of polish that professionals like to bring to their work."}, {"time": 1434, "text": "So then there's this idea of, you mentioned the sky, replacing it to different stock images of the sky."}, {"time": 1440, "text": "But in general, you have this idea."}, {"time": 1440, "text": "Or it could be on your disc or whatever."}, {"time": 1444, "text": "Disc, right."}, {"time": 1444, "text": "But making even more intelligent choices about ways to search stock images, which is really interesting."}, {"time": 1450, "text": "It's kind of spatial."}, {"time": 1453, "text": "So that was something we called concept canvas."}, {"time": 1453, "text": "So normally when you do a say an image search, you would I assuming it's just based on text, you would give the keywords of the things you want to be in the image, and it would find the nearest one that had those tags."}, {"time": 1472, "text": "For many tasks, you really want, you know, to be able to say I want a big person in the middle or in a dog to the right and umbrella above the left because you want to leave space for the text or whatever for the and so concept canvas lets you assign spatial regions to the keywords."}, {"time": 1487, "text": "And then we've already pre indexed the images to know where the important concepts are in the picture."}, {"time": 1493, "text": "So we then go through that index matching to assets."}, {"time": 1493, "text": "And even though it's just another form of search, because you're doing spatial design or layout, it starts to feel like design, you sort of feel oddly responsible for the image that comes back as if you invented it."}, {"time": 1505, "text": "So it's, it's a it's a good example where giving enough control starts to make people have a sense of ownership over the outcome of the event."}, {"time": 1518, "text": "And then we also have technologies in Photoshop, we physically can move the dog in post as well."}, {"time": 1523, "text": "But for concept canvas, it was just a very fast way to sort of loop through and be able to lay things out."}, {"time": 1529, "text": "And in terms of being able to remove objects from a scene and fill in the background, right, automatically."}, {"time": 1538, "text": "I so that's extremely exciting."}, {"time": 1545, "text": "And that's so neural networks are stepping in there."}, {"time": 1545, "text": "I just talked this week, Ian Goodfellow, so the GANs for doing that is definitely one approach."}, {"time": 1550, "text": "So that is that is that a really difficult problem?"}, {"time": 1556, "text": "Is it as difficult as it looks, again, to take it to a robust product level?"}, {"time": 1561, "text": "Well, there are certain classes of image for which the traditional algorithms like content aware fill work really well, like if you have a naturalistic texture, like a gravel path or something, because it's patch based, it will make up a very plausible looking intermediate thing and fill in the hole."}, {"time": 1577, "text": "And then we use some algorithms to sort of smooth out the lighting so you don't see any brightness contrast in that region, or you've gradually ramped from one from dark to light, if it straddles the boundary, where it gets complicated as if you have to infer invisible structure behind behind the person in front."}, {"time": 1593, "text": "And that really requires a common sense knowledge of the world to know what, you know, if I see three quarters of a house, do I have a rough sense of what the rest of the house looks like?"}, {"time": 1605, "text": "If you just fill it in with patches, it can end up sort of doing things that make sense locally, but you look at the global structure, and it looks like it's just sort of crumpled or messed up."}, {"time": 1613, "text": "And so what GANs and neural nets bring to the table is this common sense learned from the training set."}, {"time": 1620, "text": "And the challenge right now is that the generative methods that can make up missing holes using that kind of technology are still only stable at low resolutions."}, {"time": 1634, "text": "And so you either need to then go from a low resolution to a high resolution using some other algorithm, or we need to push the state of the art and it's still in research to get to that point."}, {"time": 1643, "text": "Of course, if you show it something, say it's trained on houses, and then you show it an octopus, it's not going to do a very good job of showing common sense about octopuses."}, {"time": 1655, "text": "So again, you're asking about how you know that it's ready for primetime."}, {"time": 1655, "text": "You really need a very diverse training set of images."}, {"time": 1664, "text": "And ultimately, that may be a case where you put it out there with some guardrails where you might do a detector which looks at the image and sort of estimates its own competence of how well a job could this algorithm do."}, {"time": 1681, "text": "So eventually, there may be this idea of what we call an ensemble of experts where any particular expert is specialized in certain things."}, {"time": 1693, "text": "And then there's sort of a, either they vote to say how confident they are about what to do, this is sort of more future looking, or there's some dispatcher which says you're good at houses, you're good at trees."}, {"time": 1702, "text": "So I mean, all this adds up to a lot of work because each of those models will be a whole bunch of work."}, {"time": 1709, "text": "But I think over time, you'd gradually fill out the set and initially focus on certain workflows and then sort of branch out as you get more capable."}, {"time": 1720, "text": "You mentioned workflows, and have you considered maybe looking far into the future?"}, {"time": 1763, "text": "And this is a big topic in the whole world of AI is what data can you gather and why?"}, {"time": 1767, "text": "At one level, a way to think about it is we not only want to train our customers in how to use our products, but we want them to teach us what's important and what's useful."}, {"time": 1779, "text": "At the same time, we want to respect their privacy."}, {"time": 1784, "text": "And obviously, we wouldn't do things without their explicit permission."}, {"time": 1792, "text": "And I think the modern spirit of the age around this is you have to demonstrate to somebody how they're benefiting from sharing their data with the tool."}, {"time": 1797, "text": "Either it's helping in the short term to understand their intent, so you can make better recommendations, or if they're friendly to your cause, or your tool, or they want to help you evolve quickly, because they depend on you for their livelihood, they may be willing to share some of their workflows or choices with the data set to be then trained."}, {"time": 1821, "text": "There are technologies for looking at learning without necessarily storing all the information permanently, so that you can sort of learn on the fly, but not keep a record of what somebody did."}, {"time": 1833, "text": "So we're definitely exploring all of those possibilities."}, {"time": 1870, "text": "It's nice for you to say that."}, {"time": 1870, "text": "I mean, I think there are some professional workflows where people might be very protective of what they're doing, such as if I was preparing evidence for a legal case, I wouldn't want any of that, you know, phoning home to help train the algorithm or anything."}, {"time": 1884, "text": "There may be other cases where people are, say, having a trial version, or they're doing some, I'm not saying we're doing this today, but there's a future scenario where somebody has a more permissive relationship with Adobe, where they explicitly say, I'm fine, I'm only doing hobby projects, or things which are non confidential."}, {"time": 1899, "text": "And in exchange for some benefit, tangible or otherwise, I'm willing to share very fine grained data."}, {"time": 1906, "text": "So another possible scenario is to capture relatively crude, high level things from more people, and then more detailed knowledge from people who are willing to participate."}, {"time": 1919, "text": "We do that today with explicit customer studies where, you know, we go and visit somebody and ask them to try the tool and we human observe what they're doing."}, {"time": 1929, "text": "In the future, to be able to do that enough to be able to train an algorithm, we'd need a more systematic process."}, {"time": 1935, "text": "But we'd have to do it very consciously, because is one of the things people treasure about Adobe is a sense of trust."}, {"time": 1940, "text": "And we don't want to endanger that through overly aggressive data collection."}, {"time": 1946, "text": "So we have a chief privacy officer."}, {"time": 1946, "text": "And it's definitely front and center of thinking about AI rather than an afterthought."}, {"time": 1957, "text": "Well, when you start that program, sign me up."}, {"time": 1960, "text": "Okay, happy to."}, {"time": 1962, "text": "Is there other projects that you wanted to mention that that I didn't perhaps that pop into mind?"}, {"time": 1967, "text": "Well, you covered the number, I think you mentioned Project Puppetron, I think that one is interesting, because it's, you might think of Adobe as only thinking in 2d."}, {"time": 1979, "text": "And that's a good example where we're actually thinking more three dimensionally about how to assign features to faces so that we can, you know, if you take so what puppet run does, it takes either a still or a video of a person talking, and then it can take a painting of somebody else and then apply the style of the painting to the person who's talking in the video."}, {"time": 1996, "text": "And it's unlike a sort of screen door post filter effect that you sometimes see online, it really looks as though it's sort of somehow attached or reflecting the motion of the face."}, {"time": 2011, "text": "And so that's the case where even to do a 2d workflow, like stylization, you really need to infer more about the 3d structure of the world."}, {"time": 2022, "text": "And I think, as 3d computer vision algorithms get better, initially, they'll focus on particular domains, like faces, where you have a lot of prior knowledge about structure, and you can maybe have a parameterized template that you fit to the image."}, {"time": 2038, "text": "But over time, this should be possible for more general content."}, {"time": 2038, "text": "And it might even be invisible to the user that you're doing 3d reconstruction, but under the hood, but it might then let you do edits much more reliably or correctly than you would otherwise."}, {"time": 2055, "text": "And, you know, the face is a very important application, right?"}, {"time": 2060, "text": "So making things work."}, {"time": 2062, "text": "And a very sensitive one."}, {"time": 2062, "text": "If you do something uncanny, it's very disturbing."}, {"time": 2066, "text": "You have to get it right."}, {"time": 2066, "text": "So in the space of augmented reality and virtual reality, what do you think is the role of AR and VR and in the content we consume as people, as consumers, and the content we create as creators?"}, {"time": 2085, "text": "Now, that's a great question."}, {"time": 2085, "text": "We think about this a lot, too."}, {"time": 2085, "text": "So I think VR and AR serve slightly different purposes."}, {"time": 2091, "text": "So VR can really transport you to an entire immersive world, no matter what your personal situation is."}, {"time": 2097, "text": "To that extent, it's a bit like a really, really widescreen television, where it sort of snaps you out of your context and puts you in a new one."}, {"time": 2106, "text": "And I think it's still evolving in terms of the hardware."}, {"time": 2112, "text": "I actually worked on VR in the 90s trying to solve the latency and sort of nausea problem, which we did, but it was very expensive and a bit early."}, {"time": 2116, "text": "There's a new wave of that now, I think."}, {"time": 2122, "text": "And increasingly, those devices are becoming all in one rather than something that's tethered to a box."}, {"time": 2126, "text": "I think the market seems to be bifurcating into things for consumers and things for professional use cases, like for architects and people designing where your product is a building and you really want to experience it better than looking at a scale model or a drawing, I think, or even than a video."}, {"time": 2143, "text": "So I think for that, where you need a sense of scale and spatial relationships, it's great."}, {"time": 2148, "text": "I think AR holds the promise of sort of taking digital assets off the screen and putting them in context in the real world on the table in front of you, on the wall behind you."}, {"time": 2161, "text": "And that has the corresponding need that the assets need to adapt to the physical context in which they're being placed."}, {"time": 2168, "text": "I mean, it's a bit like having a live theater troupe come to your house and put on Hamlet."}, {"time": 2173, "text": "My mother had a friend who used to do this at Stately Homes in England for the National Trust."}, {"time": 2179, "text": "And they would adapt the scenes and even they'd walk the audience through the rooms to see the action based on the country house they found themselves in for two days."}, {"time": 2191, "text": "And I think AR will have the same issue that, you know, if you have a tiny table and a big living room or something, it'll try to figure out what can you change and what's fixed."}, {"time": 2200, "text": "And there's a little bit of a tension between fidelity where if you captured, say, Nureyev doing a fantastic ballet, you'd want it to be sort of exactly reproduced."}, {"time": 2213, "text": "And maybe all you could do is scale it down."}, {"time": 2213, "text": "Whereas somebody telling you a story might be walking around the room doing some gestures and that could adapt to the room in which they were telling the story."}, {"time": 2225, "text": "And do you think fidelity is that important in that space or is it more about the storytelling?"}, {"time": 2230, "text": "I think it may depend on the characteristic of the media."}, {"time": 2230, "text": "If it's a famous celebrity, then it may be that you want to catch every nuance and they don't want to be reanimated by some algorithm."}, {"time": 2241, "text": "It could be that if it's really, you know, a lovable frog telling you a story and it's about a princess and a frog, then it doesn't matter if the frog moves in a different way."}, {"time": 2253, "text": "I think a lot of the ideas that have sort of grown up in the game world will now come into the broader commercial sphere once they're needing adaptive characters in AR."}, {"time": 2265, "text": "Are you thinking of engineering tools that allow creators to create in the augmented world, basically making a Photoshop for the augmented world?"}, {"time": 2276, "text": "Well, we have shown a few demos of sort of taking a Photoshop layer stack and then expanding it into 3D."}, {"time": 2282, "text": "That's actually been shown publicly as one example in AR."}, {"time": 2282, "text": "Where we're particularly excited at the moment is in 3D."}, {"time": 2288, "text": "3D design is still a very challenging space."}, {"time": 2288, "text": "And we believe that it's a worthwhile experiment to try to figure out if AR or immersive makes 3D design more spontaneous."}, {"time": 2303, "text": "Can you give me an example of 3D design, just like applications?"}, {"time": 2306, "text": "Literally, a simple one would be laying out objects, right?"}, {"time": 2306, "text": "So on a conventional screen, you'd sort of have a plan view and a side view and a perspective view, and you'd sort of be dragging it around with a mouse."}, {"time": 2315, "text": "And if you're not careful, it would go through the wall and all that."}, {"time": 2319, "text": "Whereas if you were really laying out objects, say, in a VR headset, you could literally move your head to see a different viewpoint."}, {"time": 2326, "text": "They'd be in stereo."}, {"time": 2326, "text": "So you'd have a sense of depth because you're already wearing the depth glasses, right?"}, {"time": 2330, "text": "So it would be those sort of big gross motor move things around kind of skills seem much more spontaneous, just like they are in the real world."}, {"time": 2340, "text": "The frontier for us, I think, is whether that same medium can be used to do fine grained design tasks, like very accurate constraints on, say, a CAD model or something that may be better done on a desktop, but it may just be a matter of inventing the right UI."}, {"time": 2357, "text": "So we're hopeful that because there will be this potential explosion of demand for 3D assets driven by AR and more real time animation on conventional screens, that those tools will also help with, or those devices will help with designing the content as well."}, {"time": 2380, "text": "You've mentioned quite a few interesting sort of new ideas."}, {"time": 2380, "text": "And at the same time, there's old timers like me that are stuck in their old ways and are... Well, I think I'm the old timer."}, {"time": 2391, "text": "But the opposed all change at all costs."}, {"time": 2397, "text": "When you're thinking about creating new interfaces, do you feel the burden of just this giant user base that loves the current product?"}, {"time": 2402, "text": "So anything new you do, any new idea comes at a cost that you'll be resisted?"}, {"time": 2413, "text": "Well, I think if you have to trade off control for convenience, then our existing user base would definitely be offended by that."}, {"time": 2419, "text": "I think if there are some things where you have more convenience and just as much control, that may be more welcome."}, {"time": 2426, "text": "We do think about not breaking well known metaphors for things."}, {"time": 2432, "text": "So things should sort of make sense."}, {"time": 2432, "text": "Photoshop has never been a static target."}, {"time": 2439, "text": "It's always been evolving and growing."}, {"time": 2439, "text": "And to some extent, there's been a lot of brilliant thought along the way of how it works today."}, {"time": 2445, "text": "So we don't want to just throw all that out."}, {"time": 2450, "text": "If there's a fundamental breakthrough, like a single click is good enough to select an object rather than having to do lots of strokes, that actually fits in quite nicely to the existing toolset, either as an optional mode or as a starting point."}, {"time": 2460, "text": "I think where we're looking at radical simplicity, where you could encapsulate an entire workflow with a much simpler UI, then sometimes that's easier to do in the context of either a different device, like a mobile device, where the affordances are naturally different."}, {"time": 2478, "text": "Or in a tool that's targeted at a different workflow, where it's about spontaneity and velocity rather than precision."}, {"time": 2484, "text": "And we have projects like Rush, which can let you do professional quality video editing for a certain class of media output that is targeted very differently in terms of users and the experience."}, {"time": 2499, "text": "And ideally, people would go, if I'm feeling like doing Premiere, big project, I'm doing a four part television series, that's definitely a Premiere thing."}, {"time": 2514, "text": "But if I want to do something to show my recent vacation, maybe I'll just use Rush because I can do it in the half an hour I have free at home rather than the four hours I need to do it at work."}, {"time": 2524, "text": "And for the use cases, which we can do well, it really is much faster to get the same output."}, {"time": 2531, "text": "But the more professional tools obviously have a much richer toolkit and more flexibility in what they can do."}, {"time": 2536, "text": "And then at the same time with the flexibility and control, I like this idea of smart defaults, of using AI to coach you to like what Google has, I'm feeling lucky button."}, {"time": 2550, "text": "Or one button kind of gives you a pretty good set of settings."}, {"time": 2550, "text": "And then that's almost an educational tool to show."}, {"time": 2558, "text": "Because sometimes when you have all this control, you're not sure about the correlation between the different bars that control different elements of the image and so on."}, {"time": 2571, "text": "And sometimes there's a degree of, you don't know what the optimal is."}, {"time": 2579, "text": "And then some things are sort of on demand, like help, right?"}, {"time": 2579, "text": "Where I'm stuck, I need to know what to look for."}, {"time": 2585, "text": "I'm not quite sure what it's called."}, {"time": 2585, "text": "And something that was proactively making helpful suggestions or, you could imagine a make a suggestion button where you'd use all of that knowledge of workflows and everything to maybe suggest something to go and learn about or just to try or show the answer."}, {"time": 2601, "text": "And maybe it's not one intelligent default, but it's like a variety of defaults."}, {"time": 2608, "text": "And then you go, I like that one."}, {"time": 2608, "text": "Several options."}, {"time": 2608, "text": "So back to poetry."}, {"time": 2616, "text": "We're going to interleave."}, {"time": 2616, "text": "So first few lines of a recent poem of yours before I ask the next question."}, {"time": 2624, "text": "This is about the smartphone."}, {"time": 2624, "text": "Today I left my phone at home and went down to the sea."}, {"time": 2633, "text": "The sand was soft, the ocean glass, but I was still just me."}, {"time": 2633, "text": "This is a poem about you leaving your phone behind and feeling quite liberated because of it."}, {"time": 2640, "text": "So this is kind of a difficult topic and let's see if we can talk about it, figure it out."}, {"time": 2648, "text": "But so with the help of AI more and more, we can create sort of versions of ourselves, versions of reality that are in some ways more beautiful than actual reality."}, {"time": 2660, "text": "And some of the creative ways that we can do that, some of the creative effort there is part of creating this illusion."}, {"time": 2676, "text": "So of course this is inevitable, but how do you think we should adjust as human beings to live in this digital world that's partly artificial, that's better than the world that we lived in a hundred years ago when you didn't have Instagram and Facebook versions of ourselves and the online Oh, this is sort of showing off better versions of ourselves."}, {"time": 2696, "text": "We're using the tooling of modifying the images or even with artificial intelligence ideas of deep fakes and creating adjusted or fake versions of ourselves and reality."}, {"time": 2710, "text": "I think it's an interesting question."}, {"time": 2710, "text": "You're all sort of historical bent on this."}, {"time": 2716, "text": "So I actually wonder if 18th century aristocrats who commissioned famous painters to paint portraits of them had portraits that were slightly nicer than they actually looked in practice."}, {"time": 2728, "text": "So human desire to put your best foot forward has always been true."}, {"time": 2737, "text": "I think it's interesting."}, {"time": 2737, "text": "You sort of framed it in two ways."}, {"time": 2737, "text": "One is if we can imagine alternate realities and visualize them, is that a good or bad thing?"}, {"time": 2742, "text": "In the old days, you do it with storytelling and words and poetry, which still resides sometimes on websites, but we've become a very visual culture in particular."}, {"time": 2754, "text": "In the 19th century, we're very much a text based culture."}, {"time": 2762, "text": "People would read long tracks, political speeches were very long."}, {"time": 2766, "text": "Nowadays, everything's very kind of quick and visual and snappy."}, {"time": 2770, "text": "I think it depends on how harmless your intent."}, {"time": 2770, "text": "A lot of it's about intent."}, {"time": 2770, "text": "So if you have a somewhat flattering photo that you pick out of the photos that you have in your inbox to say, this is what I look like, it's probably fine."}, {"time": 2782, "text": "If someone's going to judge you by how you look, then they'll decide soon enough when they meet you whether the reality, you know."}, {"time": 2800, "text": "I think where it can be harmful is if people hold themselves up to an impossible standard, which they then feel bad about themselves for not meeting."}, {"time": 2806, "text": "I think that definitely can be an issue."}, {"time": 2815, "text": "But I think the ability to imagine and visualize an alternate reality, which sometimes you then go off and build later, can be a wonderful thing too."}, {"time": 2818, "text": "People can imagine architectural styles, which they then, you know, have a startup, make a fortune, and then build a house that looks like their favorite video game."}, {"time": 2830, "text": "Is that a terrible thing?"}, {"time": 2837, "text": "I think I used to worry about exploration, actually, that part of the joy of going to the moon."}, {"time": 2843, "text": "When I was a tiny child, I remember it in grainy black and white, was to know what it would look like when you got there."}, {"time": 2850, "text": "And I think now we have such good graphics for visualizing the experience before it happens, that I slightly worry that it may take the edge off actually wanting to go, you know what I mean?"}, {"time": 2860, "text": "Because we've seen it on TV."}, {"time": 2860, "text": "We kind of, oh, you know, by the time we finally get to Mars, we'll go, yeah, yeah, so it's Mars."}, {"time": 2864, "text": "That's what it looks like."}, {"time": 2868, "text": "But then, you know, the outer exploration, I mean, I think Pluto was a fantastic recent discovery where nobody had any idea what it looked like."}, {"time": 2876, "text": "And it was just breathtakingly varied and beautiful."}, {"time": 2880, "text": "So I think expanding the ability of the human toolkit to imagine and communicate on balance is a good thing."}, {"time": 2887, "text": "I think there are abuses, we definitely take them seriously and try to discourage them."}, {"time": 2893, "text": "I think there's a parallel side where the public needs to know what's possible through events like this, right?"}, {"time": 2901, "text": "So that you don't believe everything you read in print anymore."}, {"time": 2907, "text": "And it may over time become true of images as well."}, {"time": 2907, "text": "Or you need multiple sets of evidence to really believe something rather than a single media asset."}, {"time": 2914, "text": "So I think it's a constantly evolving thing."}, {"time": 2919, "text": "It's been true forever."}, {"time": 2919, "text": "There's a famous story about Anne of Cleves and Henry VIII where luckily for Anne, they didn't get married, right?"}, {"time": 2925, "text": "So, or they got married and broke up in it."}, {"time": 2933, "text": "What's the story?"}, {"time": 2934, "text": "Oh, so Holbein went and painted a picture and then Henry VIII wasn't pleased and, you know, history doesn't record whether Anne was pleased, but I think she was pleased not to be married more than a day or something."}, {"time": 2944, "text": "So, I mean, this has gone on for a long time, but I think it's just a part of the magnification of human capability."}, {"time": 2954, "text": "You've kind of built up an amazing research environment here, research culture, research lab, and you've written that the secret to a thriving research lab is interns."}, {"time": 2964, "text": "Can you unpack that a little bit?"}, {"time": 2966, "text": "So a couple of reasons."}, {"time": 2966, "text": "As you see looking at my personal history, there are certain ideas you bond with at a certain stage of your career and you tend to keep revisiting them through time."}, {"time": 2977, "text": "If you're lucky, you pick one that doesn't just get solved in the next five years and then you're sort of out of luck."}, {"time": 2983, "text": "So I think a constant influx of new people brings new ideas with it."}, {"time": 2988, "text": "From the point of view of industrial research, because a big part of what we do is really taking those ideas to the point where they can ship as very robust features, you end up investing a lot in a particular idea."}, {"time": 2999, "text": "And if you're not careful, people can get too conservative in what they choose to do next, knowing that the product teams will want it."}, {"time": 3010, "text": "And interns let you explore the more fanciful or unproven ideas in a relatively lightweight way, ideally leading to new publications for the intern and for the researcher."}, {"time": 3024, "text": "And it gives you then a portfolio from which to draw which idea am I going to then try to take all the way through to being robust in the next year or two to ship."}, {"time": 3029, "text": "So it sort of becomes part of the funnel."}, {"time": 3035, "text": "It's also a great way for us to identify future full time researchers."}, {"time": 3035, "text": "Many of our greatest researchers were former interns."}, {"time": 3040, "text": "It builds a bridge to university departments so we can get to know and build an enduring relationship with the professors whom we often do academic give funds to as well as an acknowledgement of the value the interns add in their own collaborations."}, {"time": 3057, "text": "So it's sort of a virtuous cycle."}, {"time": 3057, "text": "And then the long term legacy of a great research lab hopefully will be not only the people who stay, but the ones who move through and then go off and carry that same model to other companies."}, {"time": 3069, "text": "And so we believe strongly in industrial research and how it can complement academia."}, {"time": 3076, "text": "And we hope that this model will continue to propagate and be invested in by other companies, which makes it harder for us to recruit, of course, but that's a sign of success."}, {"time": 3087, "text": "And a rising tide lifts all ships in that sense."}, {"time": 3087, "text": "And where's the idea born with the interns?"}, {"time": 3094, "text": "Is there brainstorming?"}, {"time": 3094, "text": "Is there discussions about, you know, like what?"}, {"time": 3102, "text": "Where do the ideas come from?"}, {"time": 3103, "text": "As I'm asking the question, I realize how dumb it is, but I'm hoping you have a better answer."}, {"time": 3108, "text": "A question I ask at the beginning of every summer."}, {"time": 3108, "text": "So what will happen is we'll send out a call for interns."}, {"time": 3117, "text": "They'll, we'll have a number of resumes come in."}, {"time": 3117, "text": "People will contact the candidates, talk to them about their interests."}, {"time": 3122, "text": "They'll usually try to find some, somebody who has a reasonably good match to what they're already doing, or just has a really interesting domain that they've been pursuing in their PhD."}, {"time": 3132, "text": "And we think we'd love to do one of those projects too."}, {"time": 3137, "text": "And then the intern stays in touch with the mentor, as we call them."}, {"time": 3137, "text": "And then they come and at the end of two weeks, they have to decide."}, {"time": 3146, "text": "So they'll often have a general sense by the time they arrive."}, {"time": 3151, "text": "And we'll have internal discussions about what are all the general ideas that we're wanting to pursue to see whether two people have the same idea, and maybe they should talk and all that."}, {"time": 3161, "text": "But then once the intern actually arrives, sometimes the idea goes linearly."}, {"time": 3161, "text": "And sometimes it takes a giant left turn."}, {"time": 3167, "text": "And we go, that sounded good."}, {"time": 3167, "text": "But when we thought about it, there's this other project, or it's already been done."}, {"time": 3171, "text": "And we found this paper, we were scooped."}, {"time": 3175, "text": "But we have this other great idea."}, {"time": 3175, "text": "So it's pretty, pretty flexible at the beginning."}, {"time": 3175, "text": "One of the questions for research labs is who's deciding what to do?"}, {"time": 3182, "text": "And then who's to blame if it goes wrong?"}, {"time": 3188, "text": "Who gets the credit if it goes right?"}, {"time": 3188, "text": "And so in Adobe, we push the needle very much towards freedom of choice of projects by the researchers and the interns."}, {"time": 3195, "text": "But then we reward people based on impact."}, {"time": 3202, "text": "So if the projects ultimately end up impacting the products and having papers and so on."}, {"time": 3208, "text": "And so your alternative model, just to be clear, is that you have one lab director who thinks he's a genius and tells everybody what to do, takes all the credit if it goes well, blames everybody else if it goes badly."}, {"time": 3218, "text": "So we don't want that model."}, {"time": 3218, "text": "And this helps new ideas percolate up."}, {"time": 3225, "text": "The art of running such a lab is that there are strategic priorities for the company."}, {"time": 3229, "text": "And there are areas where we do want to invest and pressing problems."}, {"time": 3229, "text": "And so it's a little bit of a trickle down and filter up meets in the middle."}, {"time": 3235, "text": "And so you don't tell people you have to do X, but you say X would be particularly appreciated this year."}, {"time": 3240, "text": "And then people reinterpret X through the filter of things they want to do and they're interested in."}, {"time": 3246, "text": "And miraculously, it usually comes together very well."}, {"time": 3251, "text": "One thing that really helps is Adobe has a really broad portfolio of products."}, {"time": 3257, "text": "So if we have a good idea, there's usually a product team that is intrigued or interested."}, {"time": 3264, "text": "So it means we don't have to qualify things too much ahead of time."}, {"time": 3270, "text": "Once in a while, the product teams sponsor extra intern, because they have a particular problem that they really care about, in which case it's a little bit more, we really need one of these."}, {"time": 3280, "text": "And then we sort of say, great, I get an extra intern, we find an intern who thinks that's a great problem."}, {"time": 3284, "text": "But that's not the typical model."}, {"time": 3284, "text": "That's sort of the icing on the cake as far as the budget is concerned."}, {"time": 3288, "text": "And all of the above end up being important."}, {"time": 3288, "text": "It's really hard to predict at the beginning of the summer, which we all have high hopes of all of the intern projects, but ultimately, some of them pay off and some of them sort of are a nice paper, but don't turn into a feature."}, {"time": 3304, "text": "Others turn out not to be as novel as we thought, but they'd be a great feature, but not a paper."}, {"time": 3309, "text": "And then others, we make a little bit of progress and we realize how much we don't know."}, {"time": 3315, "text": "And maybe we revisit that problem several years in a row until it, finally we have a breakthrough and then it becomes more on track to impact a product."}, {"time": 3326, "text": "Jumping back to a big overall view of Adobe research, what are you looking forward to in 2019 and beyond?"}, {"time": 3332, "text": "What is, you mentioned there's a giant suite of products, a giant suite of ideas, new interns, a large team of researchers."}, {"time": 3349, "text": "What do you think the future holds?"}, {"time": 3352, "text": "In terms of the technological breakthroughs?"}, {"time": 3354, "text": "Technological breakthroughs, especially ones that will make it into product, will get to impact the world."}, {"time": 3361, "text": "So I think the creative or the analytics assistants that we talked about where they're constantly trying to figure out what you're trying to do and how can they be helpful and make useful suggestions is a really hot topic."}, {"time": 3370, "text": "And it's very unpredictable as to when it'll be ready, but I'm really looking forward to seeing how much progress we make against that."}, {"time": 3380, "text": "I think some of the core technologies like generative adversarial networks are immensely promising and seeing how quickly those become practical for mainstream use cases at high resolution with really good quality is also exciting."}, {"time": 3394, "text": "And they also have this sort of strange way of even the things they do oddly are odd in an interesting way."}, {"time": 3398, "text": "So it can look like dreaming or something."}, {"time": 3403, "text": "So that's fascinating."}, {"time": 3403, "text": "I think internally, we have a Sensei platform, which is a way in which we're pulling our neural nets and other intelligence models into a central platform, which can then be leveraged by multiple product teams at once."}, {"time": 3425, "text": "So we're in the middle of transitioning from once you have a good idea, you pick a product team to work with and they sort of hand design it for that use case to a more sort of Henry Ford standard up in a standard way, which can be accessed in a standard way, which should mean that the time between a good idea and impacting our products will be greatly shortened."}, {"time": 3441, "text": "And when one product has a good idea, many of the other products can just leverage it too."}, {"time": 3447, "text": "So it's sort of an economy of scale."}, {"time": 3453, "text": "So that's more about the how than the what."}, {"time": 3453, "text": "But that combination of this sort of renaissance in AI, there's a comparable one in graphics with real time ray tracing and other really exciting emerging technologies."}, {"time": 3463, "text": "And when these all come together, you'll sort of basically be dancing with light, right, where you'll have real time shadows, reflections and as if it's a real world in front of you."}, {"time": 3475, "text": "But then with all these magical properties brought by AI, where it sort of anticipates or modifies itself in ways that make sense based on how it understands the creative task you're trying to do."}, {"time": 3484, "text": "That's a really exciting future for creative for myself to the creator."}, {"time": 3491, "text": "So first of all, I work in autonomous vehicles."}, {"time": 3491, "text": "I'm a roboticist."}, {"time": 3491, "text": "I love robots."}, {"time": 3496, "text": "And I think you have a fascination with snakes, both natural and artificial robots."}, {"time": 3496, "text": "I share your fascination."}, {"time": 3502, "text": "I mean, their movement is beautiful, adaptable."}, {"time": 3502, "text": "The adaptability is fascinating."}, {"time": 3508, "text": "There are, I looked it up, 2,900 species of snakes in the world."}, {"time": 3513, "text": "875 venomous."}, {"time": 3513, "text": "Some are tiny, some are huge."}, {"time": 3513, "text": "I saw that there's one that's 25 feet in some cases."}, {"time": 3513, "text": "So what's the most interesting thing that you connect with in terms of snakes, both natural and artificial?"}, {"time": 3529, "text": "What was the connection with robotics AI and this particular form of a robot?"}, {"time": 3536, "text": "Well, it actually came out of my work in the 80s on computer animation, where I started doing things like cloth simulation and other kind of soft body simulation."}, {"time": 3541, "text": "And you'd sort of drop it and it would bounce and then it would just sort of stop moving."}, {"time": 3546, "text": "And I thought, well, what if you animate the spring lengths and simulate muscles?"}, {"time": 3550, "text": "And the simplest object I could do that for was an earthworm."}, {"time": 3555, "text": "So I actually did a paper in 1988 called The Motion Dynamics of Snakes and Worms."}, {"time": 3561, "text": "And I read the physiology literature on both how snakes and worms move and then did some of the early computer animation examples of that."}, {"time": 3567, "text": "And so your interest in robotics came out of simulation and graphics."}, {"time": 3575, "text": "When I moved from Alias to Apple, we actually did a movie called Her Majesty's Secret Serpent, which is about a secret agent snake that parachutes in and captures a film canister from a satellite, which tells you how old fashioned we were thinking back then."}, {"time": 3587, "text": "Sort of classic 1950s or 60s Bond movie kind of thing."}, {"time": 3591, "text": "And at the same time, I'd always made radio controlled chips when I was a child and from scratch."}, {"time": 3598, "text": "And I thought, well, how can it be to build a real one?"}, {"time": 3603, "text": "And so then started what turned out to be like a 15 year obsession with trying to build better snake robots."}, {"time": 3610, "text": "And the first one that I built just sort of slithered sideways, but didn't actually go forward."}, {"time": 3615, "text": "Then I added wheels and building things in real life makes you honest about the friction."}, {"time": 3620, "text": "The thing that appeals to me is I love creating the illusion of life, which is what drove me to animation."}, {"time": 3626, "text": "And if you have a robot with enough degrees of coordinated freedom that move in a kind of biological way, then it starts to cross the Ancani Valley and to seem like a creature rather than a thing."}, {"time": 3636, "text": "And I certainly got that with the early snakes by S3, I had it able to sidewind as well as go directly forward."}, {"time": 3642, "text": "My wife to be suggested that it would be the ring bearer at our wedding."}, {"time": 3650, "text": "So it actually went down the aisle carrying the rings and got in the local paper for that, which was really fun."}, {"time": 3654, "text": "And this was all done as a hobby."}, {"time": 3662, "text": "And then I, at the time that can onboard compute was incredibly limited."}, {"time": 3662, "text": "It was sort of."}, {"time": 3667, "text": "So you should explain that these things, the whole idea is that you would, you're trying to run it autonomously."}, {"time": 3672, "text": "Autonomously on board right."}, {"time": 3672, "text": "And so the very first one, I actually built the controller from discrete logic cause I used to do LSI, you know, circuits and things when I was a teenager."}, {"time": 3686, "text": "And then the second and third one, the eight bit microprocessors were available with like the whole 256 bytes of RAM, which you could just about squeeze in."}, {"time": 3692, "text": "So they were radio controlled rather than autonomous and really were more about the physicality and coordinated motion."}, {"time": 3703, "text": "I've occasionally taken a sidestep into, if only I could make it cheaply enough, bake a great toy, which has been a lesson in how clockwork is its own magical realm that you venture into and learn things about backlash and other things you don't take into account as a computer scientist, which is why what seemed like a good idea doesn't work."}, {"time": 3723, "text": "So it was quite humbling."}, {"time": 3727, "text": "And then more recently I've been building S9, which is a much better engineered version of S3 where the motors wore out and it doesn't work anymore."}, {"time": 3734, "text": "And you can't buy replacements, which is sad given that it was such a meaningful one."}, {"time": 3738, "text": "S5 was about twice as long and looked much more biologically inspired."}, {"time": 3746, "text": "Unlike the typical roboticist, I taper my snakes."}, {"time": 3746, "text": "There are good mechanical reasons to do that, but it also makes them look more biological, although it means every segment's unique rather than a repetition, which is why most engineers don't do it."}, {"time": 3758, "text": "It actually saves weight and leverage and everything."}, {"time": 3764, "text": "And that one is currently on display at the International Spy Museum in Washington, DC."}, {"time": 3770, "text": "Not that it's done any spying."}, {"time": 3770, "text": "It was on YouTube and it got its own conspiracy theory where people thought that it wasn't real because I work at Adobe, it must be fake graphics."}, {"time": 3781, "text": "And people would write to me, tell me it's real."}, {"time": 3781, "text": "You know, they say the background doesn't move and it's like, it's on a tripod, you know?"}, {"time": 3786, "text": "So that one, but you can see the real thing, so it really is true."}, {"time": 3792, "text": "And then the latest one is the first one where I could put a Raspberry Pi, which leads to all sorts of terrible jokes about Pythons and things."}, {"time": 3798, "text": "But this one can have on board compute."}, {"time": 3805, "text": "And then where my hobby work and my work work are converging is you can now add vision accelerator chips, which can evaluate neural nets and do object recognition and everything."}, {"time": 3813, "text": "So both for the snakes and more recently for the spider that I've been working on, having, you know, desktop level compute is now opening up a whole world of true autonomy with onboard compute, onboard batteries, and still having that sort of biomimetic quality that appeals to children in particular."}, {"time": 3838, "text": "They are really drawn to them and adults think they look creepy, but children actually think they look charming."}]}]