[{"title": "Ryan Schiller: Librex and the Free Exchange of Ideas on College Campuses | Lex Fridman Podcast #172", "id": "UOEpe17nPhE", "quotes": [{"time": 236, "text": "It's deep fake, but for positive applications."}, {"time": 236, "text": "It's like the only deep fake positive application I've seen."}, {"time": 240, "text": "I have a friend who's obsessed with deep fakes."}, {"time": 245, "text": "What's great about, I think, deep fakes is that it's going to do the opposite of sort of what's happening with our culture, where everyone will have plausible deniability."}, {"time": 250, "text": "I mean, that's the hope for me is there's so many fake things out there that we're going to actually be much more skeptical, and think, and take in multiple sources, and actually like reason, like use common sense, and use like deep thinking to understand like what is true and what is not."}, {"time": 274, "text": "Because, you know, we used to have like traditional sources like the New York Times, and all these kinds of publications that had a reputation."}, {"time": 280, "text": "There are these institutions, and they're the source of truth."}, {"time": 285, "text": "And when you no longer can trust anything as a source of truth, you start to think on your own."}, {"time": 290, "text": "That gets part of the individual."}, {"time": 290, "text": "That goes, that takes us way back to like where I came from, the Soviet Union, where you can't really trust any one source of news."}, {"time": 295, "text": "You have to think on your own."}, {"time": 300, "text": "You have to talk to your friends."}, {"time": 300, "text": "Tremendous amount of intellectual autonomy, don't you think?"}, {"time": 304, "text": "Think about the societal consequences."}, {"time": 304, "text": "I mean, we see so much decentralization in all aspects of our digital lives now, but this is like the decentralization of thought."}, {"time": 310, "text": "You could say it's sadly, or I don't think it's sad, is decentralization of truth, where like truth is a clustering thing, where you have these like this point cloud of people just swimming around, like billions of them, and they all have certain ideas."}, {"time": 332, "text": "And what's thought of as truth is almost like a clustering algorithm."}, {"time": 339, "text": "When you just get a bunch of people that believe the same thing, that's truth."}, {"time": 344, "text": "But there's also another truth, and there may be like multiple truths, and it's almost will be like a battle of truths."}, {"time": 349, "text": "Maybe even the idea of truth will like lessen its power in society that there is such a thing as a truth."}, {"time": 357, "text": "Because like the downside of saying something is true is it's almost the downside of what people like religious people call scientism, which is like once science has declared something as true, you can't no longer question it."}, {"time": 371, "text": "But the reality is science is a moving mechanism."}, {"time": 378, "text": "You constantly question, you constantly questioning, and maybe truth should be renamed as a process, not a final destination."}, {"time": 383, "text": "The whole point is to keep questioning, keep questioning, keep discovering."}, {"time": 392, "text": "Kind of like we're going backwards in time."}, {"time": 392, "text": "So like back when people were sort of finding their identities and we were less globalized, right?"}, {"time": 400, "text": "Like people would get together and they'd get together around common value system, common morals, and a common place."}, {"time": 406, "text": "And those would be sort of these clusters of their truth, right?"}, {"time": 410, "text": "And so we have all these different civilizations and societies across the world that created their own truths."}, {"time": 416, "text": "We talk about the Jews and the Talmud and Torah."}, {"time": 421, "text": "We look at Buddhist texts."}, {"time": 421, "text": "We can look at all sorts of different truths and how many of them get at the same things, but many of them have different ideas or different articulations."}, {"time": 432, "text": "Yeah, Harari and sapiens, it rewinds that even farther back into like caveman times."}, {"time": 432, "text": "That's the thing that made us humans special, is who can develop these clusters of ideas, hold them in their minds through stories, pass them on to each other, and it grows and grows."}, {"time": 442, "text": "And finally, we have Bitcoin."}, {"time": 447, "text": "Which money is another belief system that has power only because we believe in it."}, {"time": 457, "text": "And is that truth?"}, {"time": 457, "text": "I don't know, but it has power."}, {"time": 457, "text": "And it's carried in the minds of millions and thereby has power."}, {"time": 464, "text": "But back to Librex."}, {"time": 464, "text": "So what's the founding story?"}, {"time": 464, "text": "What's the founding principles of Librex?"}, {"time": 471, "text": "So I was on campus as a freshman, and I was talking to my friends."}, {"time": 478, "text": "Many of them felt like it was hard to raise your hand in class to ask a question."}, {"time": 478, "text": "They really felt like even outside the classroom, it was hard to be vulnerable."}, {"time": 484, "text": "And the thing you have to understand about Yale is it's not that big a place."}, {"time": 488, "text": "Everyone knows someone who knows someone who knows you, basically."}, {"time": 493, "text": "And people come to these schools, first of all, they're home for people, and they want to be themselves."}, {"time": 499, "text": "They want to feel like they can be authentic."}, {"time": 499, "text": "They want to make real friendships."}, {"time": 503, "text": "And second of all, it's a place where people go for intellectual vitality to explore important ideas and to grow as thinkers."}, {"time": 508, "text": "And fortunately, due to the culture, my friends expressed that it was very difficult to do that."}, {"time": 515, "text": "And I felt it, too."}, {"time": 515, "text": "And then I couldn't talk to my professors."}, {"time": 520, "text": "And I remember I talked to one specific global affairs professor, and I was taking his class, and his area of expertise was in the Middle Eastern conflict."}, {"time": 526, "text": "And I went to him and I said, Professor, we're almost finished this class."}, {"time": 530, "text": "And we haven't even gotten to sort of the reason I originally wanted to take the class was to hear about your perspective on the Middle Eastern conflict."}, {"time": 540, "text": "Because something I'd learned at Yale, and this is maybe the most important thing, but I'll flush it out a bit."}, {"time": 544, "text": "Something I've learned at Yale is that you can learn all sorts of things from a textbook."}, {"time": 551, "text": "And what you kind of go to Yale to do is to get the opinions of the experts that go beyond the textbook and to have those more in depth conversations."}, {"time": 557, "text": "And so that's sort of the added value of going to a place like Yale and taking a course there as opposed to just reading a textbook."}, {"time": 566, "text": "But also interact with that opinion."}, {"time": 569, "text": "To interact with that opinion, to hear it, to respond to it, to push back on it, and to have that with some great minds."}, {"time": 574, "text": "And there really are great minds at Yale, don't get me wrong."}, {"time": 579, "text": "It's still a place of tremendous brilliance."}, {"time": 584, "text": "So I'm talking to this professor, right?"}, {"time": 584, "text": "And I'm like, I haven't heard your area of expertise."}, {"time": 588, "text": "And I'm like, are we going to get to it?"}, {"time": 588, "text": "What's the deal?"}, {"time": 588, "text": "And this is during office hours, mind you."}, {"time": 594, "text": "So we're one on one."}, {"time": 594, "text": "He says, Ryan, to be honest, I used to teach this area every single year."}, {"time": 599, "text": "In fact, I would do a section on it, which is like a small seminar, like breakaway from the class where he would talk to the students in small groups and explain his perspective, his research and have a real debate about it, like around a Harkness table."}, {"time": 610, "text": "And he said, I used to do this."}, {"time": 615, "text": "And then about two years ago, a student reported me to the school and I realized my job was at risk."}, {"time": 622, "text": "And I realized the best course of action was basically just not to approach the topic."}, {"time": 628, "text": "And so now I just don't even mention it."}, {"time": 628, "text": "And he's like, you can say whatever you want, but I'm not going to be a part of it."}, {"time": 635, "text": "And it's a real shame."}, {"time": 635, "text": "It's a real loss to all of the students who I think came to the school to learn from these brilliant professors."}, {"time": 645, "text": "In that context of these world experts, the problem seems to be that reporting mechanism where there's a disproportionate power to a complaint of a young student, a complaint that an idea is painful or an idea is disrespectful to, you know, or ideas creating an unsafe space."}, {"time": 670, "text": "And the conclusion of that, I mean, I'm not sure what to do with that because it's a single reporting, maybe a couple, but that has more power than the idea itself."}, {"time": 675, "text": "And that's strange."}, {"time": 683, "text": "I don't know how to fix that in the administration except to fire everybody."}, {"time": 683, "text": "So like this is to push back against this storyline that academia is somehow fundamentally broken."}, {"time": 695, "text": "I think we have to separate a lot of things out."}, {"time": 695, "text": "Like one is you have to look at faculty and you have to look at the administration."}, {"time": 702, "text": "And like at MIT, for example, the administration does, tries to do well, but they're the ones that often lack courage."}, {"time": 711, "text": "They're often the ones who are the source of the problem."}, {"time": 717, "text": "When people criticize academia, and I'll just speak to myself, you know, I'm willing to take heat for this, is they really are criticizing the administration, not the faculty because the faculty oftentimes are the most brilliant, the bolder thinkers that you think."}, {"time": 739, "text": "Whenever you talk about we need like the truth to be spoken, the faculty are often the ones who are in the possession of the deepest truths in their mind in that sense."}, {"time": 745, "text": "And they also have the capacity to truly educate in the way that you're saying."}, {"time": 750, "text": "And so it's not broken, like fundamentally, but there's stuff that like needs, that's not working that well."}, {"time": 757, "text": "It needs to be fixed."}, {"time": 762, "text": "You kind of took my words."}, {"time": 762, "text": "That's what I thought you were going to ask me if I think the Ivy League is broken."}, {"time": 766, "text": "That's totally, that's exactly it."}, {"time": 766, "text": "So you don't think, yeah."}, {"time": 766, "text": "So on the question, do you think the Ivy League is broken?"}, {"time": 770, "text": "Like what, how do you think about it?"}, {"time": 770, "text": "The academia in general, I suppose, but Ivy League still, I think it represents some of the best qualities of academia."}, {"time": 780, "text": "What more is there to say there?"}, {"time": 780, "text": "I think the Ivy League is producing tremendous thinkers to this day."}, {"time": 785, "text": "I think the culture has a lot that can be improved, but I have a lot of faith in the people who are in these institutions."}, {"time": 791, "text": "I think, like you said, the administration, and I have to be a little careful because I've been in some of these committees and I've talked to the administration about these sorts of things."}, {"time": 802, "text": "I think they have a lot of stakeholders and unfortunately it makes it difficult for them to always serve these brilliant faculty and the students in the way that they would probably like to."}, {"time": 813, "text": "So this is me speaking, right?"}, {"time": 813, "text": "The administration, I know the people, and they're oftentimes the faculty holding positions in these committees, right?"}, {"time": 823, "text": "But it's in the role of quote unquote service."}, {"time": 823, "text": "They're trying to do well."}, {"time": 832, "text": "They're trying to do good."}, {"time": 832, "text": "But I think you could say it's the mechanism is not working, but I could also say my personal opinion is they lack courage, and one, courage, and two, grace when they walk through the fire."}, {"time": 852, "text": "So courage is stepping into the fire, and grace when you walk through the fire is like maintaining that like as opposed to being rude and insensitive to the lived quote unquote experience of others or like, you know, just not eloquent at all."}, {"time": 873, "text": "Like as you step in and take the courageous step of talking and saying the difficult thing, doing it well, like doing it skillfully."}, {"time": 879, "text": "So both of those are important, the courage and the skill to communicate difficult ideas, and they often lack them because they weren't trained for it, I think."}, {"time": 889, "text": "So you can blame the mechanisms that don't, that allow 19, 20 year old students to have more power than the entire faculty, or you could just say that the faculty need to step up and grow some guts and skill of graceful communication."}, {"time": 902, "text": "And really administration."}, {"time": 908, "text": "And the administration."}, {"time": 908, "text": "That's the administration."}, {"time": 913, "text": "Because the faculty are sometimes some of the most brave outspoken people within the bounds of their career."}, {"time": 919, "text": "So that takes a, that's like the founding kind of spark of a fire that led you to then say, okay, so how can I help?"}, {"time": 930, "text": "And I explored a lot."}, {"time": 930, "text": "I explored a lot of options."}, {"time": 935, "text": "I wrote many articles to my friends, talked to them, and I realized it sort of needed to be a cultural change."}, {"time": 941, "text": "Sort of need to be bottom up, grassroots."}, {"time": 941, "text": "Something, I knew the energy was there because you just look at the most recent institutional assessment from Yale."}, {"time": 948, "text": "This was basically the number one thing that students, faculty, and alumni all pointed to, to the administration was cultivating more conversations on campus and more difficult conversations on campus."}, {"time": 965, "text": "So the people on campus know it."}, {"time": 965, "text": "And you look at a Gallup poll, 61% of students are on Ivy League campuses, afraid to speak their minds because of the campus culture."}, {"time": 976, "text": "The campus culture is causing a sort of freezing effect on discourse."}, {"time": 983, "text": "Can you pause on that again?"}, {"time": 983, "text": "So what percentage of students feel afraid to speak their mind?"}, {"time": 988, "text": "61% nationally."}, {"time": 988, "text": "And then you're talking about, you know, places, nothing like the Ivy League where I'd say, I'd imagine it would be even worse because of just the way that these communities kind of come about and the sorts of people who are attracted or are invited to these sorts of communities."}, {"time": 1007, "text": "That's nationwide that college students, and it's going up, that college students are afraid to say what they believe because of their campus climate."}, {"time": 1018, "text": "So it's a majority."}, {"time": 1018, "text": "It's not a conservative thing."}, {"time": 1018, "text": "It's not a liberal thing."}, {"time": 1025, "text": "It's a group thing."}, {"time": 1025, "text": "We're all feeling it."}, {"time": 1025, "text": "The majority of us are feeling it."}, {"time": 1028, "text": "And basically just, it doesn't even, you don't even necessarily need to have anything to say."}, {"time": 1033, "text": "You just have a fear."}, {"time": 1037, "text": "So when you're like teaching, you know, metaphor is a really powerful thing to explain, you know, and there's just the caution that you feel that's just horrible for humor."}, {"time": 1043, "text": "Now, comedians have the freedom to just talk shit, which is why I really appreciate somebody who's been a friend recently, Tim Dillon, who gives zero, pardon my French, fucks about anything, which is very liberating, very important person to just tear down the powerful."}, {"time": 1066, "text": "But, you know, inside the academia as an educator, as a teacher, as a professor, you don't have the same freedom."}, {"time": 1072, "text": "So that fear is felt, I guess, by a majority of students."}, {"time": 1077, "text": "And you were getting at something there too, which is that if you're afraid to speak metaphorically, if you're afraid to speak imprecisely, it can be very difficult to actually think at all and to think to the extremities of what you're capable of, because these are the mechanisms we use when we don't have quite the precise mathematical language to quite pinpoint what we're talking about yet."}, {"time": 1095, "text": "This is the beginning."}, {"time": 1095, "text": "This is the creative step that leads to new knowledge."}, {"time": 1100, "text": "And so that really scares me is that if I'm not allowed to sort of excavate these things, these ideas with people in the sort of messy, sloppy way that we do as humans when we're first being creative, are we going to be able to continue to innovate?"}, {"time": 1116, "text": "Are we going to continue to be able to learn?"}, {"time": 1116, "text": "And that's what really starts to scare me."}, {"time": 1121, "text": "So you've explored a bunch of different ideas."}, {"time": 1121, "text": "You ordered a bunch of different stuff."}, {"time": 1125, "text": "How did lead bricks come about?"}, {"time": 1127, "text": "Basically, it came to me that it had to be kind of a grassroots movement and it had to be something that changed culturally."}, {"time": 1133, "text": "And it had to be relatively personal, people meeting people, people finding out that, no, I'm not the only one on campus who feels this way."}, {"time": 1138, "text": "I feel alone."}, {"time": 1138, "text": "And there are a lot of other people who feel alone."}, {"time": 1145, "text": "I believe this thing."}, {"time": 1145, "text": "And it's not as unpopular as I thought."}, {"time": 1150, "text": "Basically, creating heterodoxy of thought."}, {"time": 1150, "text": "And it's creating that moment where you realize that your politics are personal and that your politics are shared by a lot of people on campus."}, {"time": 1163, "text": "And so I just started coding it."}, {"time": 1163, "text": "I didn't have much coding experience, but went headfirst in and figured how hard could it be?"}, {"time": 1170, "text": "I mean, this is really fascinating."}, {"time": 1170, "text": "So I talked to a lot of software engineers, AI people."}, {"time": 1177, "text": "Obviously, that's where my passion, my interests are."}, {"time": 1184, "text": "My focus has been throughout my life."}, {"time": 1184, "text": "The fascinating thing about your story, I think it should be truly inspiring to people that want to change the world, is that you don't have a background in programming."}, {"time": 1196, "text": "You don't have even maybe a technical background."}, {"time": 1196, "text": "So you saw a problem, you explored different ideas, and then you just decided you're going to learn how to build an app without a technical background."}, {"time": 1212, "text": "That's so bold."}, {"time": 1212, "text": "That is so beautiful, man."}, {"time": 1212, "text": "Can you take me through the journey of deciding to do that, of learning to program without a programming background, and building the app?"}, {"time": 1229, "text": "Detail, how do you start?"}, {"time": 1233, "text": "You want to buy a Mac?"}, {"time": 1233, "text": "I'm just going to go step by step."}, {"time": 1233, "text": "I'll be as dumb as possible."}, {"time": 1242, "text": "Because it was truly leading by your feet."}, {"time": 1248, "text": "So you need a computer for this?"}, {"time": 1249, "text": "I had a PC at the time, and I was Android at the time."}, {"time": 1249, "text": "And I realized it should be an iOS app."}, {"time": 1254, "text": "And so that was a decision."}, {"time": 1254, "text": "But I knew kids these days, they're always on their phone."}, {"time": 1261, "text": "And I wanted you to be able to say a passing thought in class."}, {"time": 1261, "text": "You're walking around, and you have a thought, and you can express it."}, {"time": 1268, "text": "Or you're in the dining hall, and you have your phone out, you can express it."}, {"time": 1271, "text": "So it was clear to me it should be an iOS app."}, {"time": 1274, "text": "By the way, Android is great."}, {"time": 1274, "text": "Definitely check it out."}, {"time": 1278, "text": "We also are now available on Android, but we'll get there, for the new Android users from MIT, Stanford, or the Ivy League."}, {"time": 1281, "text": "So back to how it happened."}, {"time": 1281, "text": "So I realized I need a Mac."}, {"time": 1287, "text": "So I went out and got a Mac."}, {"time": 1287, "text": "And I realized I need an iPhone for testing eventually."}, {"time": 1294, "text": "Got an iPhone."}, {"time": 1294, "text": "So those were the real robot blocks to start with."}, {"time": 1294, "text": "From there, I mean, there's almost too much information out there about programming."}, {"time": 1301, "text": "And the question is, where do you start, and what's going to be useful to you?"}, {"time": 1305, "text": "And my first thought was I should look at some Yale classes."}, {"time": 1312, "text": "But it became very clear, very quickly, that that was not the right place to start."}, {"time": 1318, "text": "That would probably be the right place to start if I wanted to get a job at Amazon, but my goal was slightly different."}, {"time": 1321, "text": "And I definitely had it in mind that what I was trying to make was I'm trying to prove out an idea."}, {"time": 1327, "text": "I'm not trying to make a finished product."}, {"time": 1331, "text": "I'm just trying to get to the first step."}, {"time": 1331, "text": "Because I figured if I keep getting to the next step, at least I won't die now."}, {"time": 1338, "text": "At least things will move forward."}, {"time": 1338, "text": "I'll learn new things."}, {"time": 1338, "text": "Maybe I'll meet new people."}, {"time": 1343, "text": "I'll show a degree of seriousness about what I'm doing."}, {"time": 1343, "text": "And things will come together."}, {"time": 1347, "text": "And that is, as you'll see, what ends up happening."}, {"time": 1347, "text": "So I start with Swift."}, {"time": 1347, "text": "And I find this video from the Stanford professor that had a million views that was how to make, basically, Swift apps perfect."}, {"time": 1359, "text": "And you just like, so you got this Mac, and you go to google.com, and you type in Xcode."}, {"time": 1366, "text": "And then I type in on YouTube like Stanford, iOS, Swift, enter."}, {"time": 1377, "text": "First YouTube video has a million views."}, {"time": 1377, "text": "I'm like, it has to be good at Stanford has a million views."}, {"time": 1381, "text": "I got lucky."}, {"time": 1381, "text": "I mean, that turned out to be a very good video."}, {"time": 1381, "text": "It's basically like introductory course to Swift."}, {"time": 1387, "text": "I mean, you say introductory."}, {"time": 1387, "text": "I think most of the people in that class probably had a much better background than I did software developers probably computer scientists."}, {"time": 1398, "text": "And it was slow for me."}, {"time": 1398, "text": "I don't think I realized it fully at the time just how far behind I was from the rest of the class because I was like, wow, it seems like people are picking this up really quickly."}, {"time": 1407, "text": "So it took a little longer and you know, a lot of time on Stack Overflow."}, {"time": 1412, "text": "But eventually I made a truly minimal viable product."}, {"time": 1412, "text": "The most minimal like we're talking, you know, put text on screen, add text to screen, comment on top of text, you know, make a post, make a response."}, {"time": 1424, "text": "And anyone with a Yale email can do this."}, {"time": 1424, "text": "And you plug it into a certain cloud server and you verify people's accounts."}, {"time": 1432, "text": "And you you're off you have to figure out how to like the whole idea of like having an account."}, {"time": 1439, "text": "So there's a permanence like you can create an account with an email, verify it, verify it."}, {"time": 1445, "text": "OK, so that that's not, you know, and that's literally how I thought about it."}, {"time": 1452, "text": "Like, so what do I need to do?"}, {"time": 1452, "text": "And I'm like, well, first thing I need is a login page."}, {"time": 1455, "text": "And I'm like, how to make a login page in Swift."}, {"time": 1461, "text": "I mean, it's that easy."}, {"time": 1461, "text": "If someone this has been done before, of course."}, {"time": 1461, "text": "And then the first page that pops up is probably a pretty damn good page when it wasn't that bad."}, {"time": 1465, "text": "But like maybe it got me 80 percent of the way there."}, {"time": 1470, "text": "And then I came into some bugs and then, you know, I asked Stack Overflow a few questions and then I got a little further and then I found some more bugs."}, {"time": 1480, "text": "And then I'm like, maybe this isn't the right way to do."}, {"time": 1480, "text": "Maybe I should do it this way."}, {"time": 1483, "text": "And I'm sure my code isn't great, but the goal isn't to make great code."}, {"time": 1483, "text": "The goal wasn't to make scalable code."}, {"time": 1488, "text": "It was to understand, is this something my friends will use?"}, {"time": 1488, "text": "Like, what is the reaction going to be if I put it in their hands and am I capable of making this thing?"}, {"time": 1498, "text": "And so you're focusing on the experience, like actually just really driving towards that first step, figuring out the first step and really driving towards it."}, {"time": 1504, "text": "Of course, you have to also figure out like this concept of like storage, like database."}, {"time": 1513, "text": "You know something funny?"}, {"time": 1515, "text": "I just made the database structure with no knowledge of databases whatsoever."}, {"time": 1519, "text": "And I start showing it to my friends who have an experience in CS and they're like, you used to heap."}, {"time": 1523, "text": "You're like, why did you decide to store it in this way?"}, {"time": 1528, "text": "I'm like, bro, I don't even know what a heap is."}, {"time": 1528, "text": "I just did it because it works."}, {"time": 1528, "text": "Like I'm trying to make calls and stuff."}, {"time": 1535, "text": "And they're like, yeah, they're like, the hierarchy is really like, I'm like, what?"}, {"time": 1540, "text": "Well, there's a deep profound lesson in there that I don't know how much you've interacted with computer science people since, but they tend to optimize and have these kinds of discussions."}, {"time": 1549, "text": "And what leads, what results is over optimization."}, {"time": 1549, "text": "It's like worrying, is this really the right way to do it?"}, {"time": 1555, "text": "And then you go as opposed to doing the first thing on Stack Overflow, you go down this like rabbit hole of what's the actual proper way to do it."}, {"time": 1560, "text": "And then you're like, you wake up five years later working on Amazon because you've never finished the login page."}, {"time": 1566, "text": "Like it's kind of hilarious, but that's a really deep lesson."}, {"time": 1573, "text": "Like just get it done."}, {"time": 1573, "text": "And there's like, what's a heap, bro?"}, {"time": 1580, "text": "Is the right, that should be a t shirt."}, {"time": 1580, "text": "That's really the right approach to building something that ultimately creates an experience."}, {"time": 1587, "text": "And then you iterate eventually."}, {"time": 1587, "text": "That's how the great, some of the greatest software products in this world have been built is you create it quickly and then just iterate."}, {"time": 1599, "text": "What was, by the way, in your mind, the thing that you were chasing as a prototype?"}, {"time": 1605, "text": "Like what, what was the first step that it feels like something is working?"}, {"time": 1605, "text": "Like did you see you interacting with another friend?"}, {"time": 1612, "text": "I think the first step was like, it's one thing to tell someone about an idea, but it's another thing to put in their hands and kind of see like the way their, their eyes kind of look."}, {"time": 1624, "text": "And when I'd go, I'd walk around cross campus, which is part of Yale, and I'd literally just go up to people and run up to them and be like, try this, try this, you got to try this."}, {"time": 1635, "text": "This is pre quarantine, by the way, of course, this would never be the same post quarantine, but like, you got to try this, you got to try this."}, {"time": 1639, "text": "And I'd be like, and I explain it's like an anonymous discussion feed for our Yale campus."}, {"time": 1642, "text": "And you see their gears turning and they just, some people would be like, not interested."}, {"time": 1647, "text": "I'm like, fine, not your target demographic."}, {"time": 1652, "text": "You'll come eventually."}, {"time": 1652, "text": "But some people like you could see it, they got it."}, {"time": 1658, "text": "They're like, yes."}, {"time": 1658, "text": "And that's when I was like, okay, okay, there is, and you don't need, I mean, you don't need 50% of people to like it."}, {"time": 1666, "text": "You need what, 5%, 10% to love it."}, {"time": 1666, "text": "And then they'll tell 5%, 10%."}, {"time": 1673, "text": "Yeah, word of mouth."}, {"time": 1673, "text": "And you're good."}, {"time": 1673, "text": "Of course, the first version was very, very crappy, but seeing people trying despite all the crappiness wasn't, it was sort of enough to be the first step."}, {"time": 1685, "text": "And since then, all of my code has been stripped out."}, {"time": 1685, "text": "I now have friends who basically have told me, don't bother with the coding part."}, {"time": 1692, "text": "You do the rest."}, {"time": 1692, "text": "You just make sure that we can code because they want to code."}, {"time": 1697, "text": "I mean, I'm not an engineer."}, {"time": 1697, "text": "I never intended to be an engineer."}, {"time": 1702, "text": "And there's a lot to do that's not engineering."}, {"time": 1702, "text": "But the point was just to validate the idea, so to speak."}, {"time": 1707, "text": "When was the moment that you felt like we've created something special?"}, {"time": 1713, "text": "Maybe a moment where you're proud of that this is, this has the potential to actually be the very implementation of the idea that I initially had."}, {"time": 1724, "text": "There's so many little moments."}, {"time": 1724, "text": "It's like, and I bet there'll still be moments in the future that make it hard to like totally say, like."}, {"time": 1731, "text": "Yeah, we should say this is, this is still very early days of Librex."}, {"time": 1738, "text": "It's only been a year since we've had like actual, like a lot of people on the app."}, {"time": 1744, "text": "About a year."}, {"time": 1744, "text": "I mean, there's some crazy moments I could talk about sort of going to Dartmouth because it's one thing to like get some traction at your school."}, {"time": 1754, "text": "People know you and you know, it's your school, you know, it's another thing to go to another school and where no one knows you and sign up 90% of the campus overnight."}, {"time": 1765, "text": "So tell me that story."}, {"time": 1765, "text": "You're invading another territory."}, {"time": 1765, "text": "It was literally like that."}, {"time": 1771, "text": "Did you buy it like a Dartmouth sweatshirt?"}, {"time": 1771, "text": "Purposefully, I didn't want to fraud anyone, but I was purposefully nondescript in my clothing."}, {"time": 1777, "text": "No Yale stuff, no Dartmouth stuff."}, {"time": 1783, "text": "Just blended."}, {"time": 1783, "text": "I'll go back there."}, {"time": 1783, "text": "So what happened was this was like March of last year."}, {"time": 1783, "text": "So almost, almost a year ago today."}, {"time": 1794, "text": "And I really wanted to see if we could go from sort of one campus to two campuses."}, {"time": 1800, "text": "So I didn't know anyone at Dartmouth's campus, but I kind of, I had some cold emails, some warmish emails."}, {"time": 1810, "text": "And I went to people and I was like, basically, can I sleep on your floor for two days during finals period?"}, {"time": 1816, "text": "I had a lot of people who said, this is crazy."}, {"time": 1816, "text": "Like no one's going to, no one wants to download an app during finals period, a social app during finals period."}, {"time": 1826, "text": "But I emailed a few people."}, {"time": 1826, "text": "I was like, you know, can I sleep on your floor?"}, {"time": 1826, "text": "And one of them was crazy enough to say, sure, come to my, come to my dorm."}, {"time": 1831, "text": "I have a nice floor."}, {"time": 1831, "text": "And he ended up, today, he's still really close."}, {"time": 1837, "text": "He's a really close friend."}, {"time": 1837, "text": "But anyway, I take a train, knowing nothing about this guy besides his first and last name."}, {"time": 1842, "text": "And I arrive and Dartmouth is really, really remote, way more remote than you think to the point where I'm like, he's like, he warned me."}, {"time": 1856, "text": "He's a really hospitable guy."}, {"time": 1856, "text": "He warned me like, it's going to be hard to get to campus from the train station because it's really remote."}, {"time": 1860, "text": "And I'm like, I'm sure it's fine."}, {"time": 1860, "text": "I'll just get an Uber."}, {"time": 1864, "text": "There are no Ubers in Hanover."}, {"time": 1864, "text": "What do you think this is?"}, {"time": 1869, "text": "This is New Hampshire."}, {"time": 1869, "text": "So, Connecticut, I mean, Yale is pretty remote as well, no?"}, {"time": 1874, "text": "Yale is, well, I mean, Yale is in New Haven, which is a real city."}, {"time": 1874, "text": "It has Ubers."}, {"time": 1874, "text": "It has food."}, {"time": 1881, "text": "It has culture."}, {"time": 1881, "text": "It has a nightclub even."}, {"time": 1881, "text": "Like, we're talking about a real city."}, {"time": 1881, "text": "Like, it's not New York."}, {"time": 1886, "text": "It's not Philadelphia, where I'm from, but it's a city."}, {"time": 1886, "text": "New Hampshire is something very different."}, {"time": 1892, "text": "Beautiful campus, I'm sure."}, {"time": 1892, "text": "Oh, my gosh."}, {"time": 1892, "text": "I could talk so much about, I was blown away by Dartmouth."}, {"time": 1897, "text": "I started wondering like why I didn't apply."}, {"time": 1902, "text": "Legitimately, between the people and the culture, it was a beautiful vacation."}, {"time": 1902, "text": "So, I arrived there, no Uber, but eventually I call this guy who's like the only guy who can get you to Dartmouth and it takes a couple hours, but we get there."}, {"time": 1914, "text": "I sleep on this guy's floor."}, {"time": 1914, "text": "I wake up."}, {"time": 1920, "text": "I ask him if there's any printing."}, {"time": 1920, "text": "He's like, oh, Dartmouth happens to have free printing in the copy room."}, {"time": 1923, "text": "I print out like 2000 posters until the guy in the copy room literally goes to me, he's like, kid, I don't know what you're doing, but you need to get out of here."}, {"time": 1930, "text": "I'm like, I'm going, I'm going."}, {"time": 1935, "text": "I found the limits."}, {"time": 1935, "text": "Yeah, I found the limit."}, {"time": 1935, "text": "I think a lot of startups about finding the limits."}, {"time": 1940, "text": "That's a little piece of advice."}, {"time": 1940, "text": "Socially, he's like, you got to get out of here."}, {"time": 1946, "text": "I then go to every single dorm door."}, {"time": 1946, "text": "I put a poster under every single dorm door, advertising the app with a QR code."}, {"time": 1954, "text": "I walk around campus saying hi to everyone and telling them about the app."}, {"time": 1960, "text": "I go from table to table in the cafeteria, introduce myself, say hi and tell them to download the app."}, {"time": 1964, "text": "It's an exhausting day."}, {"time": 1964, "text": "So many steps, so many crotching down to slip the poster under the dorm door."}, {"time": 1968, "text": "My legs were burning."}, {"time": 1974, "text": "But by the end of it, 24 hours later, I'm sitting in a bus and I'm just pressing the refresh button on the account creation panels."}, {"time": 1982, "text": "It's like going up by hundreds."}, {"time": 1982, "text": "And I'm like, oh my gosh."}, {"time": 1987, "text": "The word of mouth is working in a sense."}, {"time": 1987, "text": "I mean, certainly your initial seed is powerful."}, {"time": 1994, "text": "Just a piece."}, {"time": 1995, "text": "Yeah, but then the word of mouth is what carries it forward."}, {"time": 1995, "text": "And what was the explanation you gave to the app?"}, {"time": 2000, "text": "Is anonymity a fundamental part of it?"}, {"time": 2000, "text": "Like saying, this is a chance for you to speak your mind about your experiences on campus."}, {"time": 2012, "text": "Yeah, I think people get it."}, {"time": 2012, "text": "What I've realized is you don't need to tell people why to try it."}, {"time": 2020, "text": "There's a hunger for this."}, {"time": 2022, "text": "So all I do is I'm very factual."}, {"time": 2022, "text": "I said, and this is where I kind of ended up coining the line that I now used to say it because I said it so many times in those 24 hours."}, {"time": 2035, "text": "I just said, it's an anonymous discussion feed for Dartmouth."}, {"time": 2035, "text": "And they're like, yes."}, {"time": 2042, "text": "Like they've been waiting for it."}, {"time": 2042, "text": "Some people are more skeptical, but a lot of people were like, great, I'm excited to try this."}, {"time": 2046, "text": "I'm excited to meet people and connect."}, {"time": 2046, "text": "And I mean, the way Dartmouth is taken to is incredible."}, {"time": 2051, "text": "Everything from professors writing poems during finals period to be like, good luck in finals period."}, {"time": 2057, "text": "You're going to rise like a Phoenix or whatever to like, yeah, it's crazy."}, {"time": 2062, "text": "To I heard about two women meeting on Librex and starting a finance club at Dartmouth to significant others meeting."}, {"time": 2069, "text": "There was an article recently written up at Yale as well about two queer women who met on Librex and started a relationship, which was pretty, it was pretty interesting to see people throwing parties pre COVID."}, {"time": 2087, "text": "It was just amazing to see how, when you allow people to be vulnerable and social, they connect."}, {"time": 2091, "text": "People have this natural desire to connect."}, {"time": 2094, "text": "When, when you have, would have a natural desire to have a voice."}, {"time": 2094, "text": "And then when that voice is, is paired with freedom, that you could truly express yourself and there's something liberating about that."}, {"time": 2108, "text": "And in that sense, you're like, you're connecting as your true self, whatever that is."}, {"time": 2114, "text": "What are the most powerful conversation you've seen on the app?"}, {"time": 2114, "text": "You mentioned like people connecting."}, {"time": 2119, "text": "The hard part of that, that is the sorting, you know, figuring out which one, which one am I going to put at the top?"}, {"time": 2123, "text": "Mental sorting out."}, {"time": 2123, "text": "Just something that stands out to you."}, {"time": 2127, "text": "I don't mean to do like the top 10 conversations ever of all time, ever on the app."}, {"time": 2131, "text": "I just mean like stuff that you remember that stands out to you."}, {"time": 2135, "text": "I remember this one really amazing comment from this."}, {"time": 2135, "text": "He was a Mexican international student who spoke out and this, this, this post was super edgy, but yet it got hundreds and hundreds of upvotes within the Yale community."}, {"time": 2151, "text": "It was a Yale community specific post."}, {"time": 2151, "text": "And we should point out that there's a school specific community now and there's an all Ivy community."}, {"time": 2155, "text": "So this was specifically in the Yale community."}, {"time": 2160, "text": "And this was a little while ago, but it stuck with me."}, {"time": 2160, "text": "This Mexican international student comes to Yale and he starts talking about his experience in the La Casa, which is the Mexican Latina X as they would say, cultural center at Yale, and how he doesn't feel welcome there because he's Roman Catholic basically and international and how he doesn't feel like he fits with their agenda."}, {"time": 2186, "text": "And as a result, this place that's supposed to be home for him, he feels outcasted and feels more alone than he does anywhere else on campus."}, {"time": 2196, "text": "That was powerful to me."}, {"time": 2196, "text": "It's hearing someone, someone who should be feeling supported by this culture say, actually, this is not doing anything for me."}, {"time": 2202, "text": "Like this is not helping me."}, {"time": 2210, "text": "This is not where I feel at home."}, {"time": 2210, "text": "So what do you make of anonymity?"}, {"time": 2219, "text": "Because it seems to be a fundamental aspect of the power of the app, right?"}, {"time": 2219, "text": "But at the same time, anonymity on the internet, so it protects us, right?"}, {"time": 2226, "text": "It gives us freedom to have a voice, but it can also bring out the dark sides of human nature, like trolls or people who want to be malicious, want to hurt others purely for the joy of hurting others, being cruel for fun and going to the dark places."}, {"time": 2248, "text": "So like, what do you make of anonymity as a fundamental feature of social interaction, like the pros and the cons?"}, {"time": 2253, "text": "Just to break that down a bit, I would say a lot of those same things about a place like Twitter where people are very unanonymous."}, {"time": 2262, "text": "Having said that, of course, there's a different sort of capacity people have when they're anonymous, right?"}, {"time": 2269, "text": "In all different sorts of ways."}, {"time": 2269, "text": "So what do I make of anonymity?"}, {"time": 2269, "text": "I think it can be incredibly liberating and allow people to be incredibly vulnerable and to connect in different ways, both on politics, and there was a lot to talk about this year regarding politics, and personally being vulnerable, talking about relationships and mental health."}, {"time": 2290, "text": "I think it allows people to have a community that's not performative."}, {"time": 2294, "text": "And of course, there's this other side where people can sometimes break rules or say things that they wouldn't otherwise say that people don't always agree with or that people might find repugnant."}, {"time": 2305, "text": "And to an extent, these can facilitate great conversations."}, {"time": 2305, "text": "And on the other hand, we have to have moderation in place, and we have to have community guidelines to make sure that the anonymity doesn't overwhelm the purpose, which is that anonymity, first of all, anonymity is a tool in Librex."}, {"time": 2322, "text": "It was not the purpose of Librex."}, {"time": 2322, "text": "It is a way that we get towards these authentic conversations given our campus climate."}, {"time": 2328, "text": "And second of all, I would say it's a spectrum."}, {"time": 2337, "text": "It's not just Librex is anonymous because Librex isn't totally anonymous."}, {"time": 2337, "text": "Everyone's a verified Ivy League student."}, {"time": 2345, "text": "You know exactly what school everyone goes to."}, {"time": 2345, "text": "You only have one account per person at Yale."}, {"time": 2351, "text": "I mean, what that amounts to is people have more of an ownership in the community and people know that they're connected and they have a common vernacular."}, {"time": 2363, "text": "So the anonymity is a scale and it's a tool."}, {"time": 2363, "text": "But you can also trust, I mean, this is the difference between Reddit anonymity, where you can easily create multiple accounts."}, {"time": 2373, "text": "When you have only one account per person, or at least it's very difficult to create multiple accounts, then you can trust that the anonymous person you're talking to is a human being."}, {"time": 2385, "text": "Not a bot."}, {"time": 2386, "text": "I try to be completely unanonymous now in my all public interactions."}, {"time": 2386, "text": "I try to be as real in every way possible, like zero gap between private me and public me."}, {"time": 2399, "text": "Why exactly did you, it seems like this is an intentional mission."}, {"time": 2399, "text": "What made you want to sort of bridge that gap between the private sphere and public sphere?"}, {"time": 2404, "text": "Because that's unique."}, {"time": 2404, "text": "I know a lot of intellectuals who would make a different decision."}, {"time": 2413, "text": "I had a discussion with Naval about this, actually, with a few others that have a very clear distinction between public and private."}, {"time": 2424, "text": "Something I'm struggling with, by the way, personally, and thinking about."}, {"time": 2427, "text": "So one on the very basic surface level is if you carry with yourself lies, small lies or big lies, it's extra mental effort to remember what you're supposed to say and not supposed to say."}, {"time": 2451, "text": "So that's on a very surface level of like, it's just easier to live life when you have the smaller the gap between the private you and the public you."}, {"time": 2461, "text": "And the second is, I think for me, from an engineering perspective, like if I'm dishonest with others, I will too quickly become dishonest with myself."}, {"time": 2476, "text": "And in so doing, I will not truly be able to think deeply about the world and come up and build revolutionary ideas."}, {"time": 2482, "text": "There's something about honesty that feels like it's that first principles thinking that's almost like overused as a term, but it feels like that requires radical honesty, not radical asshole and lishness, but radical honesty with yourself, with yourself."}, {"time": 2498, "text": "And it feels like it's difficult to be radically honest with yourself when you're being dishonest with the public."}, {"time": 2504, "text": "And also I have a nice feature, honestly, that in this current social context, so we can talk about race and gender and what are the other topics that are touchy?"}, {"time": 2512, "text": "Ethnicity and nationality."}, {"time": 2523, "text": "All those things."}, {"time": 2523, "text": "I mean, like."}, {"time": 2524, "text": "Family structure."}, {"time": 2525, "text": "Maybe I'm ineloquent in the way I speak about them, but I honestly, when I look in the mirror, like I'm not deeply hateful of a particular race or even just hateful particular race."}, {"time": 2539, "text": "I'm sure I'm biased and I've tried to like think about those biases and so on."}, {"time": 2539, "text": "And also, I don't have any creepy shit in my closet."}, {"time": 2556, "text": "It seems like a lot of people did a lot of creepy stuff in their life."}, {"time": 2563, "text": "I've gotten a bit of a platform."}, {"time": 2563, "text": "And I think it all started when I went to this female comedian, Whitney Brown, and I was like, you know, I really value love, long term monogamy with like one person."}, {"time": 2592, "text": "And it's like, I really value liberating as a human being."}, {"time": 2622, "text": "Forget public, all that."}, {"time": 2622, "text": "Because then I feel like I'm on sturdy ground when I say difficult things."}, {"time": 2646, "text": "And at the same time, sorry, I'm ranting on this."}, {"time": 2652, "text": "Like I won't be able to fake it."}, {"time": 2652, "text": "Like they'll see it through."}, {"time": 2652, "text": "So I feel like if you're not lying about stuff, you have the freedom to truly be yourself."}, {"time": 2663, "text": "And the internet will figure it out."}, {"time": 2670, "text": "Like we'll figure who you are."}, {"time": 2670, "text": "People have a natural tendency to be able to tell bullshit."}, {"time": 2675, "text": "It makes sense from an evolutionary standpoint, right?"}, {"time": 2675, "text": "Why wouldn't, why, like, of all the things that we could evolve to be good at, being able to detect honesty seems like one that would be particularly valuable, especially in the sorts of societies we developed into."}, {"time": 2689, "text": "And then also from a selfish perspective, like a success perspective, I think there's a lot of folks that have inspired me, like Elon is one of them, that shows that there's a hunger for genuineness."}, {"time": 2701, "text": "Like you can build a business as a CEO and be genuine and like real and do stupid shit every once in a while, as long as it's coming from the same place of who you truly are."}, {"time": 2715, "text": "Like Elon is inspirational with that."}, {"time": 2715, "text": "And then there's a lot of other people I admire that are counter inspirations in the sense like they're very formal."}, {"time": 2719, "text": "They hold back a lot of themselves."}, {"time": 2728, "text": "And it's like, I know how brilliant those people are."}, {"time": 2728, "text": "And I think they're not being as effective of leaders, public faces of companies as they could be."}, {"time": 2733, "text": "I mean, to be honest, like not to throw shade, but I will, it's like Mark Zuckerberg is an example of that."}, {"time": 2741, "text": "Jack Dorsey is also a bit of an example of that."}, {"time": 2749, "text": "I like Jack a lot."}, {"time": 2749, "text": "I've talked to him a lot."}, {"time": 2749, "text": "I will talk to him more."}, {"time": 2754, "text": "I think he's a much more amazing person than he conveys through his public presentation."}, {"time": 2754, "text": "I think a lot of that has to do with PR and marketing people having an effect."}, {"time": 2763, "text": "This is difficult."}, {"time": 2763, "text": "I think it's really difficult."}, {"time": 2768, "text": "It's probably many of the same difficulties you will face as the pressures."}, {"time": 2774, "text": "But it's hard to know what to do."}, {"time": 2774, "text": "But I think as much as possible as an individual, you should try to be honest in the face of the world and the company that wants you to be more polished."}, {"time": 2780, "text": "And that being more polished turns you into a politician and politician eventually turns into being dishonest."}, {"time": 2793, "text": "Dishonest with the world and dishonest with yourself."}, {"time": 2797, "text": "Something I noticed, which was of the people you mentioned, those things have had ramifications in terms of letting things go too far or get out of hand."}, {"time": 2803, "text": "And you wonder, it's an aspect of lying, right?"}, {"time": 2811, "text": "You say one lie goes to another lie."}, {"time": 2811, "text": "You push it down."}, {"time": 2811, "text": "You can figure it out later."}, {"time": 2817, "text": "Pretty soon, you've dug a pretty big hole."}, {"time": 2817, "text": "And I think if we look at Twitter and we look at Facebook, I think it goes without saying what sorts of holes have been dug because of, perhaps because of a lack of honesty that goes all the way up to the leaders."}, {"time": 2834, "text": "So yeah, there's two problems within the company."}, {"time": 2834, "text": "It doesn't make you as effective of a leader, I think."}, {"time": 2840, "text": "And two, for social media companies, I think people need to trust, like it doesn't have to be the CEO, but it has to be like, this is how humans work."}, {"time": 2848, "text": "We want to look to somebody we're like, I trust you."}, {"time": 2854, "text": "If you're going to use a social media platform, I think you have to trust the set of individuals working at the top of that social."}, {"time": 2863, "text": "Something I realized really quickly, one of the lessons throughout the startup was that people don't totally connect to products as much as they connect to people."}, {"time": 2875, "text": "And I mean, I don't know how much you've spent on Librex."}, {"time": 2883, "text": "You've only been here the last week, but I mean, I love the product."}, {"time": 2883, "text": "And one of the aspects of me loving the product is that I was super active and I've been super active throughout the entire time."}, {"time": 2895, "text": "And the amount of support I've received has made that very easy to do from the community and the fact that I could, I mean, so I came to Boston for this interview, right?"}, {"time": 2906, "text": "I came to Boston."}, {"time": 2906, "text": "I got off the train."}, {"time": 2906, "text": "It was around 5.30 PM."}, {"time": 2906, "text": "I checked Librex."}, {"time": 2906, "text": "Someone is writing, hey, I'm in Boston."}, {"time": 2914, "text": "Does anyone want to get dinner?"}, {"time": 2914, "text": "30 minutes later, I'm getting dinner with them."}, {"time": 2918, "text": "And I mean, it's incredible."}, {"time": 2918, "text": "First of all, as an entrepreneur, the amount of stuff I learn from these people and when they reiterate and I hear that they got the message through the product."}, {"time": 2932, "text": "I mean, that's incredibly validating, but also, I mean, I think it's just important to be able to put a face to a brand and especially a brand that's built on trust because fundamentally the users are trusting us with some really important discussions and some really, and a movement to some degree."}, {"time": 2949, "text": "It's a community and a movement."}, {"time": 2953, "text": "I'll tell you actually why I didn't use the app very much so far is there's something really powerful about the way it's constructed, which I felt like a bit of an outsider, because I don't know the communities."}, {"time": 2966, "text": "It felt like it's a really strong community around each of these places."}, {"time": 2974, "text": "And so I felt like I was, it made me really wish there was an MIT one."}, {"time": 2974, "text": "And so there's both discussions about the deep community issues within Columbia or Yale or so on, and Dartmouth, and there's also the broader community of the Ivy Leagues that people are discussing."}, {"time": 2992, "text": "But I could see that actually expanding more and more and more, but which is, it's a powerful coupling, which is the feeling of like this little village, this little community we're building together, but also the broader issues."}, {"time": 3002, "text": "So you could do both discussions."}, {"time": 3008, "text": "One thing that was important to me is talking about social media as a concept."}, {"time": 3008, "text": "I think the way people socialize is very much context dependent."}, {"time": 3016, "text": "So we're talking about people understanding each other through language, through English."}, {"time": 3023, "text": "And these languages are constructed in a very nuanced way, in a very sort of temperamental way, right?"}, {"time": 3031, "text": "And you kind of need a similar context to be able to have productive conversations."}, {"time": 3038, "text": "So to me, it's really important that these groups, they share something in common, a really big lived experience, the Ivy League, or their school community."}, {"time": 3045, "text": "And they have a similar vocabulary, they have a similar background, they know what's happening in their community."}, {"time": 3055, "text": "And so having social media that is community connected to me was fundamental."}, {"time": 3060, "text": "Like, you talk about anonymity."}, {"time": 3060, "text": "To me, community is the thing that when I think about Librex, I think what makes it different."}, {"time": 3066, "text": "It's the fact that everyone knows what's going on."}, {"time": 3066, "text": "Everyone comes from a similar context and people can socialize in a way where they understand each other because they've been through, you used the word lived experience, they've been through so many of the same lived experiences."}, {"time": 3083, "text": "One clarification, is there an easy way, if you choose, to then connect in meat space, in physical space?"}, {"time": 3094, "text": "So the, I guess the sort of magic of it, and I was talking to a bunch of Harvard Librexers who I met off the app while I was in Boston."}, {"time": 3101, "text": "And every time they told me this is my favorite part of the app, this is what I love about the app."}, {"time": 3106, "text": "We have this matching system, which is an anonymous direct message that you can send to any poster."}, {"time": 3110, "text": "So, like, I was talking to this guy who, he was really into coin collection."}, {"time": 3119, "text": "And he met other people who are really into coin collection through a post and what they he would make a post about coin collection."}, {"time": 3124, "text": "And then someone would come to him and they'd be like, and they could direct message him anonymously."}, {"time": 3129, "text": "And it would just show them that his it would just show him their school."}, {"time": 3133, "text": "And then they could just text chat, totally anonymously, direct message if he accepted the anonymous request."}, {"time": 3142, "text": "Do they see the usernames, right?"}, {"time": 3143, "text": "There are no usernames on Librex."}, {"time": 3143, "text": "It's all just school's names."}, {"time": 3143, "text": "So he made this post about coin collection."}, {"time": 3150, "text": "And he got a direct message."}, {"time": 3154, "text": "Yeah, I guess so, right?"}, {"time": 3155, "text": "No usernames."}, {"time": 3158, "text": "I was just looking at the text."}, {"time": 3162, "text": "And I can tell you, I can go into why."}, {"time": 3166, "text": "Yeah, I can go into it."}, {"time": 3167, "text": "So it truly is anonymous."}, {"time": 3169, "text": "Well, I mean, it depends on what you mean by anonymous."}, {"time": 3172, "text": "It's a very different kind of anonymous."}, {"time": 3176, "text": "And the reason that we made that decision is because we wanted people to connect to ideas."}, {"time": 3182, "text": "We want people to connect to things in the moment."}, {"time": 3182, "text": "We don't want people to go, oh, I know this guy."}, {"time": 3186, "text": "He said this other thing."}, {"time": 3186, "text": "And we didn't want people to feel like they were at risk of being doxxed."}, {"time": 3190, "text": "So it's just these are small communities, right?"}, {"time": 3190, "text": "We talked about this."}, {"time": 3190, "text": "Everyone knows someone who knows you."}, {"time": 3195, "text": "And in 2021, it would not take much to be able to figure out who someone might be just through a couple of posts."}, {"time": 3203, "text": "So it's both safety and about the ideas in terms of not adding usernames."}, {"time": 3209, "text": "Anyway, we have this anonymous direct message system where you can direct message the original poster of any post, the OP, if you're a Redditor, of any post."}, {"time": 3214, "text": "And that makes it really easy to meet up because once you guys are one on one, you can exchange a number."}, {"time": 3221, "text": "You can exchange a Snapchat."}, {"time": 3226, "text": "You can exchange an email."}, {"time": 3226, "text": "Probably not very often, but you could."}, {"time": 3233, "text": "And then that's how people meet up."}, {"time": 3233, "text": "Matching."}, {"time": 3236, "text": "And then a lot of people connect in this way."}, {"time": 3236, "text": "Let me just take a small step into the technical."}, {"time": 3241, "text": "I read somewhere, I don't know if it's true, that one of the reasons you were rejected from YC, Y Combinator, in the final rounds is because one of the principles is to refuse to sell user data."}, {"time": 3255, "text": "Why do you think it's important not to sell user data?"}, {"time": 3264, "text": "Which draws a clear contrast between other, basically any other service on the internet."}, {"time": 3270, "text": "I mean, to be honest, it's quite simple."}, {"time": 3270, "text": "I mean, we talk about this platform."}, {"time": 3270, "text": "People are talking about their most intimate secrets, their political opinions."}, {"time": 3277, "text": "How are they feeling about what's going on in their city during the summer?"}, {"time": 3284, "text": "How are they feeling about the political cycle and also their mental health, their relationships?"}, {"time": 3294, "text": "These are some of the most intimate thoughts that people were having."}, {"time": 3300, "text": "Point blank, I don't think it was ethical to pawn them off for a profit."}, {"time": 3307, "text": "I didn't think it was moral."}, {"time": 3307, "text": "I don't think I could sleep at night if that was what I was doing, is turning these people's most intimate beliefs and secrets into a currency that I bought and sold."}, {"time": 3320, "text": "There's something very off about that."}, {"time": 3322, "text": "Yeah, I tend to believe that there is some room, so like Facebook would just take that data and sell it, right?"}, {"time": 3330, "text": "But there's some room in transparency and giving people the choice on which parts they can, I wouldn't even see it as sell, but like share with advertisers."}, {"time": 3342, "text": "Are you going to give them a profit?"}, {"time": 3344, "text": "So right, you have to monetize, you have to create an entire system, you have to rethink this whole thing, right?"}, {"time": 3347, "text": "But as long as you give people control and are transparent and make it easy, like I think it's really difficult to delete a Facebook account or like delete all your data."}, {"time": 3359, "text": "I've tried, it's very difficult."}, {"time": 3363, "text": "So like just make it easy and trust in that if you create a great product, people are not going to do it."}, {"time": 3367, "text": "And if they do it, then they're not actually a deep loving member of the community."}, {"time": 3374, "text": "So we very quickly realized that user privacy was something that was not only a core value, but was something that users really cared about."}, {"time": 3383, "text": "And we added this functionality."}, {"time": 3383, "text": "It's just a button that says, forget me."}, {"time": 3388, "text": "You press it, like two clicks."}, {"time": 3388, "text": "It's not that hard."}, {"time": 3388, "text": "We just remove your email from the database."}, {"time": 3400, "text": "I think Facebook should have that."}, {"time": 3400, "text": "I honestly, so call me crazy, but maybe you can actually speak to this, but I don't think Facebook, well now they would, but if they did it earlier, they would lose that much money."}, {"time": 3413, "text": "If they allow like transparently tell people, you could just delete everything."}, {"time": 3419, "text": "They also explained that like in ways that's going to potentially like lessen your experience in the short term, like explain that."}, {"time": 3425, "text": "But then there shouldn't be like multiple clicks of a button that don't make any sense."}, {"time": 3432, "text": "I'm trying to hold back from ranting about Instagram because let me just say real quick, because I've been locked out of Instagram for a month."}, {"time": 3445, "text": "And there's a whole group inside Facebook that are like supporters of like Lex, help Lex."}, {"time": 3451, "text": "Free Lex?"}, {"time": 3451, "text": "Free Lex."}, {"time": 3451, "text": "I wasn't blocked."}, {"time": 3451, "text": "It was just like a bug in the system."}, {"time": 3459, "text": "Somebody was hammering the API with my account."}, {"time": 3459, "text": "And so they kept thinking I'm a bot."}, {"time": 3459, "text": "Anyway, it's a bug."}, {"time": 3464, "text": "It happens to a lot of people, but like, first of all, I appreciate the love from all the amazing engineers in Instagram and Facebook."}, {"time": 3469, "text": "All of those folks, the entire mechanism though is somehow broken."}, {"time": 3474, "text": "I mean, I put that on the leadership, but it's also difficult to operate a large company once it scales, all those kinds of things, but it should not be that difficult to do some basic, basic things that you want to do, which is in the case of Facebook, that's verify your identity to the app."}, {"time": 3495, "text": "And also in the case of Facebook, in the case of Librex, like disappear if you choose."}, {"time": 3502, "text": "There's downsides to disappearing, but it should not be a difficult process."}, {"time": 3511, "text": "And yeah, I think people are waking up to that."}, {"time": 3511, "text": "I think there's a lot of room for an app like Librex with its foundational ideas to redefine what social media should look like."}, {"time": 3527, "text": "You know, and like you said, I think beautifully, anonymity is not the core value."}, {"time": 3527, "text": "It's just a tool you use."}, {"time": 3533, "text": "And who knows, maybe anonymity will not always be the tool you use."}, {"time": 3533, "text": "Like if you give people the choice, who knows what this evolves from the login page you initially created."}, {"time": 3546, "text": "The key thing is the founding principles."}, {"time": 3546, "text": "And again, who knows if you give people a really nice way to monetize their data, maybe there'll no longer be a thing that you say, do not sell user data."}, {"time": 3555, "text": "Yeah, all those kinds of things."}, {"time": 3555, "text": "But the basic principles should be there."}, {"time": 3555, "text": "And also a good, simple interface design goes a really long way."}, {"time": 3562, "text": "Like simplicity and elegance, which Librex currently is."}, {"time": 3570, "text": "Clubhouse is another app."}, {"time": 3572, "text": "It's gotten a lot better, by the way."}, {"time": 3572, "text": "I don't mean to go too deep into the history, but the..."}, {"time": 3579, "text": "It was bad?"}, {"time": 3579, "text": "I didn't look at the early pictures."}, {"time": 3581, "text": "Oh, thank goodness."}, {"time": 3583, "text": "I read somewhere that it was like a white screen, like with black."}, {"time": 3587, "text": "The up and down buttons were like these big freaking boxes."}, {"time": 3587, "text": "And I could go on, but it was my genius design skills."}, {"time": 3597, "text": "I almost failed art class when I was in first grade."}, {"time": 3597, "text": "And I think I still have similar skills to my first grade self, but it's gotten a lot better."}, {"time": 3605, "text": "And thanks to a lot of my friends who have sort of chipped in here and there."}, {"time": 3614, "text": "Oh, I love the idea of a button that just forget me."}, {"time": 3614, "text": "That's really moving, actually."}, {"time": 3620, "text": "That's actually all people want, is they want, I think..."}, {"time": 3620, "text": "Okay, I'll speak to my experience."}, {"time": 3628, "text": "I would give so much more if I could just disappear if I needed to."}, {"time": 3634, "text": "And I trusted the community."}, {"time": 3634, "text": "I trusted the founders and the principals."}, {"time": 3634, "text": "That's really powerful, man."}, {"time": 3642, "text": "The trust and ease of escape."}, {"time": 3642, "text": "You've also kind of mentioned moderation, which is really interesting."}, {"time": 3651, "text": "So with this anonymity and this community, I don't know if you've heard of the internet, but there's trolls on the internet."}, {"time": 3661, "text": "So I've heard."}, {"time": 3661, "text": "And even if they go to Yale and Dartmouth, there's still people that probably enjoy sort of being the guerrilla warfare, counter revolutionary, and just like creating chaos in a place of love."}, {"time": 3679, "text": "So how do you prevent chaos and hatred breaking out in Librex?"}, {"time": 3687, "text": "So the way I think about it is we have these principals."}, {"time": 3687, "text": "They're pretty simple and they're pretty easy to enforce."}, {"time": 3693, "text": "And then beyond the principals, we have a set of moderators, moderate from every single Ivy League school, a team of diverse moderators who enforce these principals, but not only enforce the principals, but kind of clue us in to what's happening in their community and how the real life context of their community translates to the Librex context of their community."}, {"time": 3712, "text": "And beyond that, we have conversation with them about the standards of the community."}, {"time": 3719, "text": "And we're constantly talking about what needs to be further elucidated and what needs to be tweaked."}, {"time": 3723, "text": "And we're in constant communication with the community."}, {"time": 3728, "text": "Now, if you want me to get into the principals that underlie Librex's moderation policy."}, {"time": 3734, "text": "Maybe you can explain that there's moderators."}, {"time": 3734, "text": "How are they chosen?"}, {"time": 3737, "text": "And what are the principals under which they operate?"}, {"time": 3740, "text": "So how are the moderators chosen?"}, {"time": 3740, "text": "The moderators are all volunteers."}, {"time": 3740, "text": "They're Librexers who reach out to me and respond to the opportunity to become moderator."}, {"time": 3746, "text": "And the way they're chosen is basically we want to make sure that they're in tune with their community."}, {"time": 3753, "text": "We want to make sure they come from diverse backgrounds and we want to make sure that they sort of understand what the community is about."}, {"time": 3763, "text": "And then we ask them some questions about how they would deal with certain scenarios, ones that we've had in the past and we feel strongly about."}, {"time": 3772, "text": "And then also ones that are a little more murky, where we want to see that they're sort of thinking about these things in a critical way."}, {"time": 3776, "text": "And from there, we choose a set and they have the power to take down posts."}, {"time": 3783, "text": "Of course, everything at the end of the day pens my review, but they can take them down and we can reinstate them if it's a problem."}, {"time": 3790, "text": "But they can take down posts and they can advocate for different moderation standards and different moderation policies."}, {"time": 3802, "text": "So for now, you're the Linus Torvalds of this community."}, {"time": 3802, "text": "So meaning like you're able to, like people are actually able to like email you or like text you, contact you and get a response."}, {"time": 3817, "text": "Like you respond to basically everybody."}, {"time": 3817, "text": "And then you're like really, you know, you're, you're living that live on people's floor life currently."}, {"time": 3822, "text": "That's not necessarily, this is the early days folks."}, {"time": 3827, "text": "I knew Ryan before he was a billionaire and he was cool."}, {"time": 3834, "text": "And then he was in a mansion making meats on his barbecue."}, {"time": 3834, "text": "But you know, how does it scale?"}, {"time": 3842, "text": "Like what I suppose, how does it scale is the question."}, {"time": 3842, "text": "I mean, with Linus, I don't know if you're familiar with the Linux open source community, but he still stayed at the top for a while."}, {"time": 3857, "text": "It was really important."}, {"time": 3857, "text": "Like leadership there was really important to drive that large scale, really productive open source community."}, {"time": 3866, "text": "What do you see your role as Librex grows and in general, what are the mechanisms of scaling here for moderation?"}, {"time": 3875, "text": "Where I see it, open discourse is fundamental to the purpose of the app, right?"}, {"time": 3875, "text": "So as the, I guess you could say founder, CEO, what have you, part of my purpose has to be to enforce the vision, right?"}, {"time": 3889, "text": "And part of the vision is open discourse."}, {"time": 3889, "text": "And that does come down in part to reasonable moderation and community guided reasonable moderation."}, {"time": 3894, "text": "So I imagine that will always be something that I'm intimately involved with to some degree."}, {"time": 3900, "text": "Now the degree to which the way in which that manifests, I imagine will have to change, right?"}, {"time": 3905, "text": "And hopefully I'll be able to, just like you can hire a CTO, hopefully I'll be able to be in integrated in hiring people who understand the way that we are sort of operating and the reasonable standards of moderation."}, {"time": 3927, "text": "And there can be a sort of hierarchical structure."}, {"time": 3932, "text": "But I think when you have a product whose key purpose is to allow people to have these difficult conversations on campus that need to be had, I can never fully, I don't think I can fully ever abdicate that responsibility."}, {"time": 3946, "text": "I think that would be like, I mean, that would be like Bezos abdicating eCommerce, right?"}, {"time": 3951, "text": "That's part of the job."}, {"time": 3957, "text": "Yeah, of course you can run companies in different ways."}, {"time": 3957, "text": "I think because he might have abdicated quite a bit of the details there."}, {"time": 3965, "text": "It's hard for me to say."}, {"time": 3966, "text": "Because Amazon does so many things."}, {"time": 3966, "text": "I think probably the better examples like Elon with rockets, he's still at the core of the engineering."}, {"time": 3970, "text": "He's at the core of the engineering."}, {"time": 3970, "text": "There's some fundamental questions."}, {"time": 3975, "text": "He probably does way too much of the engineering."}, {"time": 3975, "text": "He's the lowest level detail."}, {"time": 3980, "text": "But you're saying the core things that make the app work is the moderation of difficult conversations."}, {"time": 3990, "text": "And by the way, I'm 21 years old."}, {"time": 3990, "text": "Let's remind everyone of that."}, {"time": 3990, "text": "If this thing does scale and if this thing continues to be a positive force in a lot of people's lives, who knows what will happen in the next, what I'll learn."}, {"time": 4004, "text": "I'm still growing definitely as a leader, still growing as a thinker, still growing as a person."}, {"time": 4010, "text": "I can't pretend that I know how to run a business that is worth up to $1 billion, whatever."}, {"time": 4016, "text": "I can't pretend I know how to run a business that's going to have millions and millions of users."}, {"time": 4023, "text": "I expect that there are going to be a lot of amazing people who will teach me and that a lot of people who have already kind of stepped into my life and helped me out and taught me things."}, {"time": 4031, "text": "And I imagine that I'll learn so much more."}, {"time": 4037, "text": "I just know that moderation is always going to be important to me because I don't think Librex is Librex unless we have open discourse and moderation, reasonable, open, light touch moderation is at the heart of creating that, right?"}, {"time": 4055, "text": "So as a creator of this kind of community in place with anonymity and difficult conversations, what do you think about this touchy three words that people have been tossing around and politicizing, I would say, but is at the core of the founding of this country, which is the freedom of speech?"}, {"time": 4072, "text": "How do you think about the freedom of speech, this particular kind of freedom of expression?"}, {"time": 4078, "text": "And do you think it's a fundamental human right?"}, {"time": 4078, "text": "How do you define it to yourself when you're thinking about it?"}, {"time": 4084, "text": "I went down, especially preparing for this conversation down a rabbit hole of like just how unclear it is philosophically what is meant by this kind of freedom."}, {"time": 4097, "text": "It's not as easy as people think, but it's interesting pragmatically speaking to hear how you think about it in the context of Librex."}, {"time": 4111, "text": "Yeah, it's a tough one, right?"}, {"time": 4111, "text": "So I come from the background of being a math major."}, {"time": 4117, "text": "Maybe it's important to start with that."}, {"time": 4117, "text": "And I found myself in the middle of this question of freedom of speech."}, {"time": 4124, "text": "One of the wonderful things is that the Librex community is filled with PhDs and governance majors who have taught me a ton about this sort of thing."}, {"time": 4136, "text": "And I'm still learning."}, {"time": 4136, "text": "I'm still growing."}, {"time": 4136, "text": "I'm still probably going to modify my perspective to some degree."}, {"time": 4140, "text": "I imagine I'll always support free discourse."}, {"time": 4148, "text": "Like learning how to speak about stuff is critical here because it's like I'm learning that this is like a minefield of conversations because the moment you say like even saying freedom of speech is a complicated concept, people will be like, oh, we spotted a communist."}, {"time": 4169, "text": "Like they'll say, there's nothing complicated about freedom."}, {"time": 4169, "text": "Freedom is freedom, bro."}, {"time": 4174, "text": "It is complicated."}, {"time": 4174, "text": "First of all, if you talk about there's different definitions of freedom of speech."}, {"time": 4181, "text": "If you want to go constitutionally, if you want to talk about the United States specifically and what's legal, it's actually not as exciting and not as beautiful as what people think of."}, {"time": 4192, "text": "I think there's ideals behind it that we want to see."}, {"time": 4199, "text": "What does that actually materialize itself in the digital world where we're trying to communicate in ways that allows for difficult conversations and also at the same time doesn't result in the silencing of voices, not through like censorship, but through like just assholes being rude."}, {"time": 4224, "text": "So it could be just bots."}, {"time": 4229, "text": "Going back to the name of the app, Librex."}, {"time": 4229, "text": "Libre, free."}, {"time": 4229, "text": "X was put onto for free exchange and the free exchange of what my purpose was to create as much inner communication of ideas, be them repugnant or otherwise as possible."}, {"time": 4246, "text": "And of course, to do that within legal bounds and to do that without causing anyone to be harassed or doxxed."}, {"time": 4253, "text": "So to keep things focused on the ideas, not the people."}, {"time": 4258, "text": "And then no BS crap stuff."}, {"time": 4258, "text": "And so to me, the easiest way to moderate around that, because as you said, figuring out what is hateful and what is hate speech is really hard, was to say no sweeping statements against core identity groups."}, {"time": 4281, "text": "And that seems to work on the whole pretty well to be pretty light touch."}, {"time": 4285, "text": "And it's hard to do though."}, {"time": 4287, "text": "We like to generalize, we humans."}, {"time": 4290, "text": "It's difficult, but what it comes down to is be specific."}, {"time": 4293, "text": "And when you think about what are sweeping statements against core identity groups, oftentimes these are sort of hackneyed subjects."}, {"time": 4297, "text": "These are things that have been broached and we've heard them before."}, {"time": 4303, "text": "They don't really lead anywhere productive."}, {"time": 4303, "text": "So it goes under this principle of be specific in the ideas you're discussing."}, {"time": 4312, "text": "So even for like positive and humorous stuff, you try to avoid generalizations."}, {"time": 4317, "text": "Against core identity groups."}, {"time": 4318, "text": "Core identity groups."}, {"time": 4318, "text": "Sorry, what are core identity groups?"}, {"time": 4321, "text": "We're talking, kind of like, You know, race, religion."}, {"time": 4326, "text": "Even positive stuff?"}, {"time": 4331, "text": "Well, against, negative."}, {"time": 4333, "text": "Oh, against."}, {"time": 4333, "text": "Sorry, against, against."}, {"time": 4336, "text": "Very, very, we've learned to be very specific."}, {"time": 4336, "text": "Very few words, but the community gets it, you know?"}, {"time": 4343, "text": "Yeah, they get it."}, {"time": 4343, "text": "I mean, this is the thing."}, {"time": 4343, "text": "The trouble with rules is as the community grows, they'll figure out ways to manipulate the rules."}, {"time": 4353, "text": "It's creativity."}, {"time": 4357, "text": "Something beautiful about it, of course."}, {"time": 4360, "text": "From an evolutionary perspective, yes."}, {"time": 4361, "text": "Yeah, the fact that people are so creative and so looking to, because people are genuinely interested in figuring out these things about social media."}, {"time": 4370, "text": "And so they'll 100% see like, where's the edge?"}, {"time": 4370, "text": "And I mean, part of that's maintaining some level of vagueness in your rule set, which has its own set of questions and something we could think about."}, {"time": 4382, "text": "And I'm not implying I have all the answers, but there is something really interesting about people being so engaged that they're looking to figure out where are those edges and what does that mean?"}, {"time": 4391, "text": "What does that edge mean, you know?"}, {"time": 4394, "text": "Well, so one of the things I'm kind of thinking about, like from an individual user of Librex or an individual user of the internet, I think about like that one person that is on Reddit saying hateful stuff or positive stuff, doesn't matter, or funny stuff."}, {"time": 4407, "text": "One of the things I think about is the trajectory of that individual through life and how social media can help that person become the best version of themselves."}, {"time": 4421, "text": "I don't mean from like an Orwellian sense, like educate them properly or something."}, {"time": 4426, "text": "I just mean like, we're all, I believe, we're all fundamentally good."}, {"time": 4426, "text": "And I also believe we all have the capacity to do, to create some amazing stuff in this world, whether that's ideas or art or engineering, all those kinds of things, just to be amazing people."}, {"time": 4447, "text": "And I kind of think about like, you know, a lot of social media mechanisms bring out the worst in us."}, {"time": 4453, "text": "And I try to think like, in the long term, how can the social media or how can a website, how can a tool that you create can make the best, like you take a trajectory that makes you better, better and better and like the best version of yourself."}, {"time": 4468, "text": "So I think about that because like, you know, Twitter can really take you down some dark trajectories."}, {"time": 4473, "text": "I've seen people just not being the best version of themselves."}, {"time": 4479, "text": "Forget the cancel culture and all that kind of stuff."}, {"time": 4479, "text": "It's just like they're not developing intellectually in the way that's going to make the best version of themselves."}, {"time": 4489, "text": "I think Reddit, I'm not sure what I think about Reddit yet, because one positive side is all the shit posting I read."}, {"time": 4495, "text": "It could be just like a release valve for some stress in life."}, {"time": 4495, "text": "And you almost have like a parallel life where you're in meat space."}, {"time": 4501, "text": "You might be actually becoming successful and so on and growing and so on, but you just need some times to be angry at somebody."}, {"time": 4511, "text": "But I tend to not think that's possible."}, {"time": 4511, "text": "I think if you're shit posting, you're probably not spending your time the best way you could."}, {"time": 4519, "text": "I'm torn on that."}, {"time": 4519, "text": "But do you think about that with Librex of creating a trajectory for the Yale, for the Dartmouth, for the students, to where they grow intellectually?"}, {"time": 4533, "text": "One thing that I think about a lot is how do you incentivize positive content creation?"}, {"time": 4533, "text": "How do you incentivize really intellectual content creation?"}, {"time": 4541, "text": "It's something that, frankly, I think about every single day."}, {"time": 4550, "text": "And I think there are ways that..."}, {"time": 4550, "text": "I mean, one thing that's great about humans is that they can be incentivized, right?"}, {"time": 4558, "text": "And I think there are ways that you can incentivize people to make the right kind of content if that's your goal."}, {"time": 4566, "text": "So you think such mechanisms exist for such incentivization?"}, {"time": 4570, "text": "I don't want to let the cat out of the bag, so to speak."}, {"time": 4573, "text": "Do you have already concrete ideas in your mind?"}, {"time": 4576, "text": "I have about three concrete ideas that I'm very, very optimistic about."}, {"time": 4582, "text": "You don't even need to share them."}, {"time": 4582, "text": "I understand totally."}, {"time": 4582, "text": "But the fact that you have them, that's really good."}, {"time": 4586, "text": "Because I feel like sometimes the downfall of the social media is that there's literally not even a thinking or a discussion about the incentivization of positive long term content creation."}, {"time": 4603, "text": "Twitter, I really was excited about this when they said like, when Jack has talked about creating healthy conversations."}, {"time": 4612, "text": "He does seem to care."}, {"time": 4612, "text": "I've listened to him."}, {"time": 4612, "text": "I mean, he has a very particular way of saying things."}, {"time": 4617, "text": "But you get the impression that he's someone who actually cares about these things within the limits of his power."}, {"time": 4623, "text": "And that's the question, the limits of the power."}, {"time": 4623, "text": "Librex is growing not just in the number of communities, but also in the way you're incentivizing positive conversations, like coupled with a moderation and so on."}, {"time": 4638, "text": "So you think there's a lot of innovation to be had in that area?"}, {"time": 4642, "text": "There's a tremendous amount."}, {"time": 4642, "text": "I think when you think about the reasons people post, fundamentally, people want to make a positive impact on their community to some degree."}, {"time": 4647, "text": "Now, there will always be bad actors."}, {"time": 4654, "text": "And part of the benefit of our moderation structure is that we can limit some of those bad actors, no bot accounts, no brigading."}, {"time": 4659, "text": "At the same time, the more you incentivize a certain type of behavior, the better it's going to be."}, {"time": 4665, "text": "And we don't see it as our role as the platform to force the community in a direction."}, {"time": 4670, "text": "And frankly, I don't think it would be good for anyone, the community or the conversations, if we forced a specific type of conversation."}, {"time": 4683, "text": "We just need to make the tools to allow people to be good and to incentivize good behavior."}, {"time": 4690, "text": "Yeah, I believe that."}, {"time": 4690, "text": "You will not need to censor if you allow people at scale to be good."}, {"time": 4690, "text": "The good will overpower the assholes."}, {"time": 4701, "text": "That's my fundamental belief."}, {"time": 4701, "text": "I'm very optimistic about that."}, {"time": 4706, "text": "But currently, Librex is small in the sense that it's a small set of communities that I believe."}, {"time": 4712, "text": "And you mentioned to me offline that by design, you're scaling slowly and carefully."}, {"time": 4718, "text": "So how does Librex scale?"}, {"time": 4718, "text": "Facebook also started with a small set of communities that were schools, and then now grew to be basically the, if not one of the largest social networks in the world."}, {"time": 4735, "text": "Do you see Librex as potentially scaling to be beyond even college campuses, but encompassing the whole world?"}, {"time": 4746, "text": "It's a long timeline."}, {"time": 4746, "text": "I'll say this."}, {"time": 4746, "text": "This gets back to where did Facebook go wrong?"}, {"time": 4757, "text": "Because clearly, they did a lot right."}, {"time": 4757, "text": "And we can only speculate about what the objectives were of the founders of Facebook."}, {"time": 4764, "text": "I'm sure they've said some things, but it's always interesting to know what the mythology is versus what the truth is of the matter."}, {"time": 4770, "text": "So perhaps they've been very successful."}, {"time": 4776, "text": "I mean, they've taken over the world to some extent."}, {"time": 4783, "text": "At the same time, the goals of Librex are to create these positive communities and these open conversations where people can have real conversation and connection in their communities in a vulnerable and authentic way."}, {"time": 4794, "text": "And so to that end, which I imagine might be different than the goals of a Facebook, for example, one thing that we want to do is keep things intimate and community based."}, {"time": 4806, "text": "So each school is its own community."}, {"time": 4806, "text": "And perhaps you could have a slightly broader community."}, {"time": 4813, "text": "Maybe you could have a, I know the California system is an obvious one."}, {"time": 4819, "text": "Packed time might be an obvious one."}, {"time": 4819, "text": "And we can think about that."}, {"time": 4819, "text": "But fundamentally, the unit of community is your school or your school community."}, {"time": 4824, "text": "So that's one difference that I think will help us."}, {"time": 4833, "text": "The other thing is that we're scaling intentionally, meaning that when we expand to a school, we have moderators in place."}, {"time": 4838, "text": "We have moderators who understand that school's environment in a very personal level."}, {"time": 4844, "text": "And we're growing responsibly."}, {"time": 4844, "text": "We're growing as we're ready, both technologically, but also socially."}, {"time": 4850, "text": "But as we think we have the tools to preserve the community and to encourage the community to create the sort of content that we want them to create."}, {"time": 4862, "text": "And there's a lot of ways to define community."}, {"time": 4862, "text": "So first of all, there's geographic community as well."}, {"time": 4869, "text": "But the way you're kind of defining community with Yale and Dartmouth is the email, right?"}, {"time": 4876, "text": "That's what gives you, there's a power to the email in the sense that that's how you can verify, efficiently verify yourself with being a single individual in the university."}, {"time": 4884, "text": "In that same way, you can verify your employment at a company, for example, like Google, Microsoft, Facebook."}, {"time": 4899, "text": "Do you see potentially taking on those communities?"}, {"time": 4899, "text": "That'd be fascinating, getting like anonymous community conversations inside Google."}, {"time": 4910, "text": "100% crossed my mind."}, {"time": 4910, "text": "To some extent, this is something where I understand the college experience."}, {"time": 4917, "text": "I understand the need."}, {"time": 4917, "text": "And I've never worked at Google."}, {"time": 4917, "text": "I don't know if they would hire me."}, {"time": 4924, "text": "Hopefully, maybe as a product manager."}, {"time": 4924, "text": "I think if there's a community that needs this product, and has that will, which I think, especially as Librex continues to grow and expand and change and learn."}, {"time": 4942, "text": "Because that's what we're doing is we're learning, right?"}, {"time": 4942, "text": "With each community, it's not just about growing."}, {"time": 4947, "text": "It's about learning from each of these communities and iterating."}, {"time": 4947, "text": "I think it's quite likely there are going to be all sorts of communities that could use this tool to improve their culture, so to speak."}, {"time": 4960, "text": "So forgive me, I'm not actually that knowledgeable about the history of attempts of building social networks to solve the problem that you're solving."}, {"time": 4968, "text": "But I was made aware that there was an app or at least a social network called Yik Yak that had a similar kind of focus."}, {"time": 4987, "text": "I think the thing you've spoken about that differs between Librex and Yik Yak is that Yik Yak was defined, am I pronouncing it right even?"}, {"time": 4994, "text": "You good?"}, {"time": 4994, "text": "I'm good."}, {"time": 4994, "text": "I met the founder so I can confirm."}, {"time": 5001, "text": "Okay, you can confirm, cool."}, {"time": 5001, "text": "That it was constrained to a geographical area versus like to the actual community and that somehow had fundamental like actual differences in social dynamics that resulted."}, {"time": 5018, "text": "But can you speak to the history of Yik Yak?"}, {"time": 5018, "text": "Like how does Librex differ?"}, {"time": 5018, "text": "What lessons have you learned from that?"}, {"time": 5025, "text": "Oh, and I should say that I guess there was controversial, I don't know, I didn't look at the details, but I'm guessing there's a bunch of racism and hate speech and all that kind of stuff that emerged on Yik Yak."}, {"time": 5033, "text": "Okay, so that's an example of like, okay, here's how it goes wrong when you have anonymity on college campuses."}, {"time": 5041, "text": "So how does Librex going to do better?"}, {"time": 5041, "text": "Yeah, Yik Yak had a lot of problems, content problems, but the content problems go deeper than maybe what the press would reveal."}, {"time": 5054, "text": "There's a lot to say and part of it is parsing exactly what to talk about when it comes to Yik Yak and when you talk about startups, I mean you know this, you know startups, and you look at the postmortem, it's almost never what people think it is."}, {"time": 5067, "text": "And oftentimes these things are somewhat unknowable and the degree to which people seeking confirmation bias to somebody, seeking closure, look to find a singular attribute that caused the failure."}, {"time": 5079, "text": "It feels like the little details often make all the difference."}, {"time": 5084, "text": "Yes, and I think the details are so little that as humans we are not capable of parsing even what they are."}, {"time": 5091, "text": "But I'll tell you my perspective on it, knowing that I am also a human with biases."}, {"time": 5098, "text": "In this particular case, very significant biases."}, {"time": 5108, "text": "So I started building Librex for its own merits."}, {"time": 5108, "text": "At first I wasn't aware of Yik Yak, but as I started to talk to people about this platform I was building, I was made aware of Yik Yak and I built it from day one with a lot of the issues Yik Yak had in mind."}, {"time": 5120, "text": "So as you said, the one difference between Yik Yak is the geographical versus community based aspect."}, {"time": 5128, "text": "Going along with that, one thing I realized by researching social media sites is that the majority of the negative content, the content that's terrible and breaking all the rules is created by really, and the people who are not reformable, so to speak, the people who are not showing the best part of the human experience."}, {"time": 5154, "text": "It's a really small minority, right?"}, {"time": 5154, "text": "I remember, I was listening to the founder of 4ChamMoot talk about this, how like one guy was able to basically destroy like large swaths of his community."}, {"time": 5170, "text": "Yeah, that's part of what makes it exciting for that minority is how much power they can have."}, {"time": 5176, "text": "So if you're predisposed to think in this way, it's exciting that you can walk into, like I mentioned the party before, you have a party of a lot of positive people and it feels, especially if you don't have much power in this world, it feels exceptionally empowering to just, to destroy like the lives of many."}, {"time": 5204, "text": "And if you think this way, it's a problem."}, {"time": 5204, "text": "But I'm hopeful that you're right, that in most cases it's going to be a minority of people."}, {"time": 5211, "text": "And that's what the research has showed."}, {"time": 5216, "text": "And one really powerful thing is that we can really actively control who comes in and out of our community based on the.edu verification."}, {"time": 5224, "text": "And we can also control who's not in our community because we have that lever where each account is associated with a.edu."}, {"time": 5230, "text": "So that's the first point I would point out there."}, {"time": 5236, "text": "Second point is controlled expansion, meaning that we have community moderation."}, {"time": 5242, "text": "We have this panel that allows the moderators to see all of the highly downloaded content, all of the reported content, all the flagged content and look through it and decide what they like and what's appropriate and what's not appropriate."}, {"time": 5254, "text": "And we have, we ping every moderator when there's a report."}, {"time": 5260, "text": "So things are taken down pretty quickly."}, {"time": 5260, "text": "And we have our standards and we have, I think above all of that, we have a mission and it's a community based mission."}, {"time": 5271, "text": "Yik Yak was more of a fun app and by its own admission, it was a place where people could enjoy themselves and could sort of yak."}, {"time": 5277, "text": "Yik Yak, chit chat."}, {"time": 5277, "text": "We have a bigger purpose than that, frankly."}, {"time": 5285, "text": "And I think that shows in the people who self select to be on that app, to be on Librex and to be on Yik Yak, respectively."}, {"time": 5291, "text": "The last thing I'll say is Yik Yak was very few characters."}, {"time": 5291, "text": "It was a Twitter esque platform."}, {"time": 5298, "text": "And that doesn't allow for a tremendous amount of nuance."}, {"time": 5298, "text": "It doesn't allow for a tremendous amount of conversation."}, {"time": 5302, "text": "Librex is much more long form."}, {"time": 5308, "text": "And so the kind of posts that you'll get on Librex can span pages."}, {"time": 5308, "text": "What people are starting to realize is that they can reach a lot more people at a lot more pertinent of a time a lot more quickly by posting their thoughts on Librex than if they went to their school newspaper."}, {"time": 5327, "text": "And I think the school newspapers might be a little worried about that."}, {"time": 5327, "text": "But more importantly, we're connecting people in this way where long form communication with nuance that takes into account everything that's happening in the community temporally is really available at Librex and not really communicable in 240 or 480 or whatever the number of characters the yaks were bound to."}, {"time": 5351, "text": "And I could talk about the history of Yik Yak if you want me to go further."}, {"time": 5351, "text": "They started, I think they were at 12 schools."}, {"time": 5359, "text": "And then spring break hit."}, {"time": 5359, "text": "People told their friends, look at this app."}, {"time": 5365, "text": "A thousand schools signed up and had active communities."}, {"time": 5365, "text": "They had a problem on their hands."}, {"time": 5370, "text": "And then the high schools come on board."}, {"time": 5370, "text": "I think a lot of the things you said ring true to me, but especially the vision one, which I do think having a vision in the leadership, having a mission makes all the difference in the world."}, {"time": 5382, "text": "That's both for the engineers that are building, like the team that's building the app, the moderation and users because they kind of, the mission carries itself through the behavior of the people on the social network."}, {"time": 5402, "text": "As a small tangent, let me ask you something about Parler, but it's less about Parler, more about AWS."}, {"time": 5408, "text": "So AWS removed Parler from his platform, you know, for whatever reasons, it doesn't really matter."}, {"time": 5414, "text": "But the fact that AWS would do this was really, really bothered me personally, because I saw AWS as the computing infrastructure and I always thought that part could not put a finger on its scale."}, {"time": 5429, "text": "And I don't know what your thoughts are."}, {"time": 5429, "text": "Like, were you bothered by Parler being removed from AWS?"}, {"time": 5434, "text": "And how does that affect how you think about the computing infrastructure on which Librex is based?"}, {"time": 5445, "text": "I was bothered not so much by Parler specifically being taken out of AWS, but more the fact that something that's like a highway, something that people rely on, that people build on top of, that people assume is going to be somewhat position agnostic, like a road that people drive on, is becoming ideologically sort of discriminatory."}, {"time": 5466, "text": "And of course, mind you, Amazon can do what it wants."}, {"time": 5473, "text": "It's a private company and I support the rights of private companies."}, {"time": 5473, "text": "I just, on an ethical and sort of a deep moral level, I wonder, like, at what point should a company sort of be agnostic in that regard and let developers build on top of their infrastructure?"}, {"time": 5487, "text": "And where does that responsibility hold?"}, {"time": 5496, "text": "Yes, it makes you hope that there's going to be, from a capitalistic sense, competitors to AWS would say, like, we're not going to put our finger on the scale."}, {"time": 5503, "text": "I mean, on the highway is a good sort of example."}, {"time": 5509, "text": "It's like if a privately owned highway said, you know, we're no longer going to allow, we're only going to allow electric vehicles."}, {"time": 5516, "text": "And a bunch of people in this world would be like, yes, because electric is good for the environment."}, {"time": 5523, "text": "And, you know, I think that's a good example."}, {"time": 5532, "text": "You know, yes, but then you have to consider the, like, the slippery slope nature of it, but also like the negative impact on the lives of many others and what that means for innovation and for, like, competition, again, in a capitalistic sense."}, {"time": 5545, "text": "So, there's some nature, there's some level to this hierarchy of our existence that we should not allow to manipulate what's built on top of it."}, {"time": 5552, "text": "It should be truly infrastructure."}, {"time": 5560, "text": "And it feels like compute is storage and compute is that layer."}, {"time": 5560, "text": "Like, it shouldn't be messed with."}, {"time": 5568, "text": "I haven't seen anybody really complain about it, like, in terms of government."}, {"time": 5573, "text": "And I'm not even sure government is the right mechanism through policy and regulation to step in."}, {"time": 5579, "text": "Because again, they do a messy job of fixing things."}, {"time": 5579, "text": "But I do hope there's competitors to AWS to make AWS then step up."}, {"time": 5586, "text": "Because I do think, you know, I'm a fan of AWS, except this."}, {"time": 5592, "text": "Good service."}, {"time": 5593, "text": "It's a good service until this."}, {"time": 5595, "text": "Until, yeah, until they rip out the rug."}, {"time": 5600, "text": "And the point is, it's not that necessarily their decision was a bad one with Parler, in particular."}, {"time": 5606, "text": "It's that, like, the slippery slope nature of it, but also the, it takes the good actors that are creating amazing products and makes them more fearful."}, {"time": 5618, "text": "And when you're more fearful, it's the same reason that anonymity is a tool that you don't create the best thing you could possibly create."}, {"time": 5623, "text": "When you're fearful, you don't create."}, {"time": 5628, "text": "I think we've kind of talked about it a little bit."}, {"time": 5628, "text": "But I wonder if we can kind of revisit it a little bit."}, {"time": 5634, "text": "I talked to a guy named Ronald Sullivan, who's a faculty at Harvard, a law professor."}, {"time": 5640, "text": "He was on the legal defense team."}, {"time": 5640, "text": "He was the lawyer for Harvey Weinstein and Aaron Hernandez for the double murder case."}, {"time": 5647, "text": "So he takes on these really difficult cases of unpopular figures because he believes like that's the way you test that we believe in the rule of law."}, {"time": 5660, "text": "But he was, there's a big protest in Harvard to get him, basically censor him and to get him to no longer be faculty dean, all those kinds of things."}, {"time": 5670, "text": "And it was by a minority of students, but there's a huge blowback, obviously in the public, but also inside Harvard, like that's not okay."}, {"time": 5684, "text": "He stands for the very principles at the founding of Harvard and at the principles of the founding of this country and the law and so on."}, {"time": 5688, "text": "But the basic argument is that it was about safe spaces, that it's unsafe to have somebody who is basically supporting Harvey Weinstein, right?"}, {"time": 5705, "text": "What do you think about this whole idea of safe spaces on college campuses?"}, {"time": 5705, "text": "Because it feels like the mission of Librex is pushing back against the idea of safe spaces."}, {"time": 5719, "text": "I think safe spaces are fine when they're within people's private lives, within their homes, within their religious organizations."}, {"time": 5723, "text": "I think the problem becomes when the institution starts encouraging or backing safe spaces because what are people being safe from?"}, {"time": 5728, "text": "And oftentimes, it seems like there's this idea that the harm that's being attempted to be mitigated is the harm of confronting opinions you disagree with, opinions you might find repugnant."}, {"time": 5752, "text": "And if this is conflated with a need for safety, then that's where the idea of liberal arts education sort of dies."}, {"time": 5758, "text": "Of course, it's complicated and we still want to have safe intellectual environments."}, {"time": 5765, "text": "But the way that I hear the term safe space used today, I think it doesn't really have a place within the intellectual context."}, {"time": 5777, "text": "I mean, this is why Librex is really exciting, is it's pushing those difficult conversations."}, {"time": 5783, "text": "And I'd love to see, ultimately, there does seem to be an asymmetry of power that results in the concept of safe spaces and hate speech being redefined in the slippery slope kind of way where it means basically anything you want it to mean."}, {"time": 5799, "text": "And it basically is used to silence people, to silence people."}, {"time": 5804, "text": "They're like good, thoughtful experts."}, {"time": 5840, "text": "I mean, you don't have to slip that far to see why that's a problem."}, {"time": 5845, "text": "Once we start making words into violence and we start criminalizing words, we get into some really authoritarian territory, things that I think, I mean, myself and my background, I don't know how much we have to go into it, but things that my ancestors certainly would be worried about."}, {"time": 5862, "text": "What's your background?"}, {"time": 5866, "text": "I'm a child of Holocaust survivors and pro grom survivors, so."}, {"time": 5872, "text": "Yeah, I mean, me as well from different directions."}, {"time": 5872, "text": "I come from the Soviet Union, so there's, well, like in most of us, hate and love runs through our blood from our history."}, {"time": 5884, "text": "You mentioned MIT is being added to Librex."}, {"time": 5884, "text": "Has it already been added?"}, {"time": 5887, "text": "Yes, it was added today."}, {"time": 5889, "text": "Today, okay."}, {"time": 5889, "text": "So let me ask you, this is exciting because I don't know what your thoughts are about this, but I'll tell you from my perspective, if you're, and a lot of MIT folks listen to this, I would love it if you joined Librex."}, {"time": 5902, "text": "It'd be interesting to explore conversations on several topics inside MIT, but one of the most moving that hasn't been discussed at all at all, except in little flourishes here and there, is the topic of Jeffrey Epstein."}, {"time": 5927, "text": "Now, there's been a huge amount of, like, impact that the connections of various faculty to Jeffrey Epstein and the various things that have been said had on MIT, but it feels like the difficult conversation haven't had been had."}, {"time": 5944, "text": "It's the administration trying to clean up and give a bunch of BS to try to pretend, like, let's just hide this part."}, {"time": 5951, "text": "Like nothing is broken, nothing to see here."}, {"time": 5958, "text": "Here's a bad dude that did some bad things and some faculty that kind of misbehaved a little bit because they're a little bit clueless."}, {"time": 5965, "text": "Let's all look the other way."}, {"time": 5965, "text": "Harvard did this much better, by the way."}, {"time": 5971, "text": "They completely, it's almost like people pretend like Harvard didn't have anything to do with Jeffrey Epstein."}, {"time": 5977, "text": "But I think I'd be curious to hear what those conversations are because there's conversations on the topic of like, well, obviously sort of sexual assault and disrespecting women on any kind of level within academia, but just women in general."}, {"time": 6000, "text": "That's an important topic to talk about, various, many sets of difficult conversations."}, {"time": 6000, "text": "And the other topic is, you know, funding for research."}, {"time": 6005, "text": "Like how are, like, what are we okay taking money from and what are we not okay taking money from?"}, {"time": 6015, "text": "You know, there's a lot of just interesting difficult conversations to be had."}, {"time": 6020, "text": "I've worked with people who, you know, refuse to take money from DOD, Department of Defense, for example, because in some indirect or direct way, you're funding military industrial complex, all those kinds of things."}, {"time": 6032, "text": "I think with Jeffrey Epstein, it's even more stark, this contrast of like, well, what is and isn't ethical to take money from?"}, {"time": 6044, "text": "And I just think, forget academia, I think there's just a lot of interesting, deep human discussions to be had."}, {"time": 6051, "text": "And they haven't been."}, {"time": 6051, "text": "And there's been somebody, I don't know if you're familiar with Eric Weinstein, who has been outraged by the fact that nobody's talking about Jeffrey Epstein."}, {"time": 6062, "text": "Nobody's having these difficult conversations."}, {"time": 6062, "text": "And Eric himself has had a sort of complicated journey through academia, in the sense that he's a really kind of renegade thinker in many kinds of ways."}, {"time": 6076, "text": "I'm not sure if you know who Eric is, by any chance."}, {"time": 6076, "text": "Heard the name."}, {"time": 6076, "text": "I actually checked out ZEV."}, {"time": 6081, "text": "ZEV."}, {"time": 6081, "text": "It was heartening for me to see that I was not the youngest person on this podcast."}, {"time": 6088, "text": "You're the second youngest."}, {"time": 6088, "text": "Second youngest."}, {"time": 6094, "text": "But Eric, he's kind of a renegade thinker."}, {"time": 6094, "text": "He's a mathematical physicist with, I believe, a PhD at Harvard, and he spent some time at MIT and so on."}, {"time": 6105, "text": "But he speaks to the fact that there's a culture of conformity and so on."}, {"time": 6112, "text": "And if you're somebody who's a bit outside of the box, a bit weird, in whatever dimension of weird, that makes you actually kind of interesting that the system kind of wants to make you an outcast, wants to throw you out."}, {"time": 6123, "text": "And so he kind of opposes that whole idea."}, {"time": 6129, "text": "He's the perfect person to have conversations with in this kind of Librex kind of context of anonymity."}, {"time": 6134, "text": "Because I'll tell you the few conversations that came across and they were very quickly silenced."}, {"time": 6142, "text": "And I'm troubled by it."}, {"time": 6142, "text": "I'm not sure what to think of it."}, {"time": 6150, "text": "Is there's a few threads inside MIT, like on a mailing list, discussing Marvin Minsky."}, {"time": 6159, "text": "He's an AI researcher."}, {"time": 6159, "text": "He's a seminal figure in AI before your time, but one of the most important people in the history of artificial intelligence."}, {"time": 6164, "text": "And there was a discussion on a thread that involved the interaction between Marvin Minsky and Jeffrey Epstein."}, {"time": 6181, "text": "That conversation was quickly shut down."}, {"time": 6181, "text": "One person was pushed out of MIT, Richard Stallman, who's one of the key figures in the, because of that, because he wanted some clarity about the situation."}, {"time": 6193, "text": "But he also miss, he spoke, like we mentioned earlier, without grace, right?"}, {"time": 6200, "text": "But he was quickly punished by the administration because of a few people protesting."}, {"time": 6200, "text": "And just that conversation, I guess what bothered me most is it didn't continue."}, {"time": 6207, "text": "It didn't expand."}, {"time": 6207, "text": "There was no like complexity."}, {"time": 6216, "text": "And it was, there was a hunger that was clear behind that conversation, especially sort of for me, I'd like to understand Marvin Minsky was one of the reasons I wanted to come to MIT."}, {"time": 6229, "text": "He's passed away, but he's one of the key figures in the field that I deeply care about, artificial intelligence."}, {"time": 6236, "text": "And I thought that his name was dragged through the mud, through that situation, and without ever being like resolved."}, {"time": 6243, "text": "And so it's unclear to me, like, what am I supposed to think about all this?"}, {"time": 6251, "text": "And the only way to come to a conclusion there is to keep talking."}, {"time": 6258, "text": "It's like the thing we started this conversation with about truth is like, is conversation."}, {"time": 6264, "text": "So in that sense, I'd love if people on Librex, perhaps in other places, but it seems like Librex is a nice platform to discuss Marvin Minsky, to discuss Jeffrey Epstein, to learn from it, to grow from it, to see how we can make MIT better."}, {"time": 6276, "text": "As I'm still one of the people, I've always dreamed of being at MIT and it was a dream come true in many ways."}, {"time": 6282, "text": "And I still believe that MIT is one of the most special places in this world."}, {"time": 6289, "text": "Like many other universities, universities in general is truly special, man."}, {"time": 6294, "text": "It hurts my heart when people speak poorly of academia."}, {"time": 6301, "text": "I understand what they mean."}, {"time": 6301, "text": "They're very correct, but there is much more, in my opinion, that's beautiful about academia than that's broken."}, {"time": 6306, "text": "I mean, I don't know if you have something to comment."}, {"time": 6312, "text": "It doesn't necessarily need to be about Jeffrey Epstein, but there's these difficult things that come up that test the academic community, right?"}, {"time": 6318, "text": "That it feels like conversation is the only way to resolve it."}, {"time": 6326, "text": "I think people have a natural need for closure."}, {"time": 6326, "text": "And it's not just, I'm not as plugged into the, what academics are talking about as you would be Lux, but I even..."}, {"time": 6338, "text": "In case these days, no respect for Minsky."}, {"time": 6338, "text": "I mean, especially in the AI community, I'm not necessarily a programmer."}, {"time": 6345, "text": "But what I will say is that people come to Librex and we always see a huge spike in users whenever there's a tragedy on campus or something where people need closure."}, {"time": 6358, "text": "Recently, there was a suicide just the other day on Yale's campus, and people were just coming to pay respects and to say, rest in peace, and speak also about what might've led to an environment where people are drawn to these terrible results."}, {"time": 6383, "text": "So just having a conversation is important there, because it brings closure."}, {"time": 6388, "text": "People need the space, especially when no one wants to go out and put their head above, be the longest blade of grass on that one because of the stigma."}, {"time": 6394, "text": "People need to be able to speak."}, {"time": 6401, "text": "Yeah, that fear really bothers me, the fear that silences people."}, {"time": 6401, "text": "Like, were they self censor?"}, {"time": 6401, "text": "Were they self silence?"}, {"time": 6406, "text": "Well, you've created an amazing place."}, {"time": 6406, "text": "I'm kind of interested in your struggle and your journey of creating positive incentives, because it's a problem in a very different domain that I'm also interested in."}, {"time": 6427, "text": "So I love robotics."}, {"time": 6427, "text": "I love human robot interaction."}, {"time": 6427, "text": "And so I believe that most people are good and we can bring out the best in human nature."}, {"time": 6436, "text": "Social networks is a very tricky space to do that in."}, {"time": 6441, "text": "So I'm glad you're taking on the problem and I'm glad you have the mission that you do."}, {"time": 6445, "text": "I hope you succeed."}, {"time": 6445, "text": "But you mentioned offline that you used to be into chess."}, {"time": 6453, "text": "Tell me about your journey through chess."}, {"time": 6453, "text": "I was a very competitive tournament player growing up till about like 13."}, {"time": 6457, "text": "I got for the chess fans, I got to around 2000."}, {"time": 6457, "text": "USCF."}, {"time": 6457, "text": "So I was a competitive player, especially my age group."}, {"time": 6465, "text": "And that actually led me to poker."}, {"time": 6465, "text": "I was I was playing a tournament."}, {"time": 6473, "text": "And what happens is when you're like a very strong 13 year old and you're playing locally, if you want a good match, you're gonna end up playing a lot of adults and you're gonna end up playing if you want a good match, you're gonna end up playing a lot of adults."}, {"time": 6481, "text": "And I ended up playing this mid 40s guy who we played a really strong game."}, {"time": 6484, "text": "He actually beat me."}, {"time": 6484, "text": "I still I still remember the game and think I could I should have played that move instead of that one."}, {"time": 6492, "text": "But after after the game, we had a postmortem."}, {"time": 6496, "text": "It was this me I think I was 13 at the time and this 40 year old like hanging over this chessboard and looking over the moves."}, {"time": 6500, "text": "And even at that even at my age, that this guy was absolutely brilliant."}, {"time": 6506, "text": "And after after the postmortem, not only by the way, in chess, but just like in the way he articulates his thoughts, as some people are."}, {"time": 6511, "text": "After postmortem, I went and looked him up online, I found out that he was a World Series of Poker Champion."}, {"time": 6521, "text": "And his name is Bill Chen."}, {"time": 6521, "text": "And I haven't really kept up with him, except one time there was another chess tournament when I was around 14."}, {"time": 6527, "text": "And I followed him into an elevator as he was leaving the chess hall, like pretending that I was going to go up just because I wanted to, I just wanted to talk to him."}, {"time": 6537, "text": "And I suggested a sequel or some changes that he could that I thought he could make for his book."}, {"time": 6541, "text": "And he was like, actually, I was thinking of doing the same thing, which is incredibly validating to my 14 year old or 15 year old self."}, {"time": 6545, "text": "But I really haven't kept up with him."}, {"time": 6550, "text": "So shout out to him."}, {"time": 6550, "text": "But and then that he wrote a book called the mathematics of poker that I started reading."}, {"time": 6555, "text": "And that, first of all, kickstarted my interest in game theory."}, {"time": 6561, "text": "And second of all, in poker."}, {"time": 6561, "text": "So it started from chess and then poker."}, {"time": 6561, "text": "And I started with Bitcoin poker and had a lot of success with that met a lot of amazing friends."}, {"time": 6568, "text": "Learned a ton about I mean, I think about entrepreneurship as well as taking risks, reasonable risks, positive expected value risks."}, {"time": 6581, "text": "And also just growing as a person and mathematician."}, {"time": 6581, "text": "And what did you say Bitcoin poker?"}, {"time": 6588, "text": "Yeah, what's Bitcoin poker?"}, {"time": 6588, "text": "So you have to understand I was 14 years old, right?"}, {"time": 6588, "text": "So how is a 14 year old with wonderful parents who care about him?"}, {"time": 6594, "text": "And probably don't want him playing poker."}, {"time": 6599, "text": "Going to start playing poker, because I wanted I wanted to challenge I love the challenge of the competition."}, {"time": 6605, "text": "And I realized the answer is probably Bitcoin."}, {"time": 6605, "text": "Because the implications of that."}, {"time": 6612, "text": "And they had they had these free roll tournaments, which for those who don't know what free rolls are, there's these promotional tournaments that sites put on where they'll put like a few dollars in and then 1000s of people sign up and the winners get like a dollar."}, {"time": 6627, "text": "And I started there and I worked my way up."}, {"time": 6627, "text": "And that's amazing."}, {"time": 6627, "text": "What's your sense about from that time to today of the growth of the cryptocurrency community?"}, {"time": 6633, "text": "I'm actually having like four or five conversations with Bitcoin proponents, Bitcoin maximalists, and like all these I'm just having all these cryptocurrency conversations currently, because there's so many brilliant, like technically brilliant, but also financially and philosophically brilliant people in those communities."}, {"time": 6653, "text": "It's fascinating with the explosion of impact, like and also, if you look into the future, the possible revolutionary impact on society in general, but what's your sense about this whole growth of Bitcoin?"}, {"time": 6669, "text": "I'm definitely less knowledgeable on the currency."}, {"time": 6669, "text": "Again, like programming, it was a means to an end."}, {"time": 6676, "text": "What I will say is that there was this amazing community that grew out of it."}, {"time": 6682, "text": "And you'd have people who were willing to stake me or have me be their horse and they're my backer."}, {"time": 6688, "text": "For having never met me for literally full Bitcoin tournaments, like full Bitcoin entry fee tournaments, and I get a percentage of the profits and they get a percentage."}, {"time": 6697, "text": "And to have that level of community for that degree of money, I mean, it gives you hope about the potential for, you know, humans to act in mutual best interest with a degree of trust."}, {"time": 6708, "text": "Yeah, there's a really fascinating, strong community there."}, {"time": 6716, "text": "But speaking of like bringing out the best of human nature, it's a community that's currently struggling a little bit in terms of their ability to communicate in a positive, inspiring way."}, {"time": 6727, "text": "Like the Bitcoin folks, and we talk about this a lot."}, {"time": 6727, "text": "I honestly think they have a lot of love in their hearts and minds, but they just kind of naturally, naturally, because the world has been like institutions and the centralized powers have been sort of mocking and fighting them for many years that they've become sort of worn down and cynical."}, {"time": 6759, "text": "And so they tend to be a little bit more aggressive and negative on the internet in the way they communicate, especially on Twitter."}, {"time": 6764, "text": "And it's just created this whole community of of basically being derisive and mocking and trolling and all this kind of stuff."}, {"time": 6775, "text": "But people are trying to, you know, as the Bitcoin community grows, as the cryptocurrency community grows, they're trying to revolutionize that aspect too."}, {"time": 6780, "text": "So they're trying to find the positive core and grow and grow in that way."}, {"time": 6785, "text": "So it's fascinating because I think all of us are trying to find the positive aspects of ourselves and trying to learn how to communicate in a positive way online."}, {"time": 6798, "text": "It's like the internet hasn't been around."}, {"time": 6798, "text": "Social networks haven't been around that long."}, {"time": 6798, "text": "We're trying to figure this thing out."}, {"time": 6802, "text": "Let me ask you the ridiculous question."}, {"time": 6802, "text": "I don't know if you have an answer, but who is the greatest chess player of all time in your view?"}, {"time": 6808, "text": "So since you like chess."}, {"time": 6813, "text": "That's how you define it."}, {"time": 6813, "text": "But if you're talking about raw skill, like if you put everyone across time into a torment together, Carlson would win."}, {"time": 6819, "text": "I don't think that's particularly controversial."}, {"time": 6824, "text": "Oh, you mean like with the same exact skill level?"}, {"time": 6824, "text": "Now if you talk about political importance, I think Bobby Fischer is, you know, he's the only one that people still, when you go to someone on the street, they know Bobby Fischer because of what he represented, right?"}, {"time": 6842, "text": "Who do you think is more famous on the street?"}, {"time": 6842, "text": "Garry Kasparov or Bobby Fischer?"}, {"time": 6848, "text": "Bobby Fischer."}, {"time": 6848, "text": "In America, Bobby Fischer."}, {"time": 6848, "text": "I think we're gonna have to put that to the test."}, {"time": 6852, "text": "Yeah, maybe it's more reflective of the community that I was a part of, but yeah."}, {"time": 6857, "text": "Oh, so in the community you're a part of like Young Minds playing chess, Bobby Fischer was a superstar in terms of the roots."}, {"time": 6862, "text": "Yeah, I think so because he's American and, you know, he stood up against the big bad Russians at the time and, you know, unfortunately he had a very bad downfall."}, {"time": 6875, "text": "But, you know, for our geopolitical situation, he meant a lot."}, {"time": 6875, "text": "And then if you talk about compared to contemporaries, actually, I would say Paul Morphy was a bit of a throwback."}, {"time": 6889, "text": "He's one of those geniuses that was just head and shoulders above everyone else."}, {"time": 6896, "text": "Is there somebody that inspired your own play, like as a Young Mind?"}, {"time": 6896, "text": "Yeah, I really liked Mikhail Tal."}, {"time": 6900, "text": "I think he was very aggressive, right?"}, {"time": 6900, "text": "Yeah, very tactical."}, {"time": 6900, "text": "Which is funny because I found that I was better at like sort of slow methodical play than quick tactics, but I just, I mean, there's something beautiful about the creativity and that's something I always latched onto as being a creative player, being a creative person."}, {"time": 6918, "text": "I mean, chess doesn't really reward creativity as much as a lot of other things, especially entrepreneurial pursuits, which I think is part of the reason why I sort of grew out of it."}, {"time": 6928, "text": "But I always was attracted to the creativity that I did see in chess."}, {"time": 6935, "text": "So let me ask the flip, the other, because you said poker, is there somebody that stands out to you as could be the greatest poker player of all time?"}, {"time": 6941, "text": "Like who do you admire?"}, {"time": 6946, "text": "That's a more controversial one because these chess players are such like, first of all, there's more an objective standard."}, {"time": 6955, "text": "And second of all, there's like, they're like almost like cultural figures to me."}, {"time": 6959, "text": "Whereas poker players are more like live, living."}, {"time": 6965, "text": "They feel more like, yeah, they feel more accessible."}, {"time": 6965, "text": "But they also have like personalities in poker."}, {"time": 6969, "text": "They have vices, they have quirks, they have humor."}, {"time": 6969, "text": "Like, I guess we've seen videos of them because it's such a recent development."}, {"time": 6978, "text": "I'll say one person who I admire so much."}, {"time": 6983, "text": "And like, if I could like have a dinner list of people that I want to have dinner with, like maybe it'll happen now, actually."}, {"time": 6989, "text": "I would love to have dinner with him."}, {"time": 6989, "text": "Phil Galfond, who most people probably won't know."}, {"time": 6995, "text": "But on this podcast, but the way, first of all, he democratized poker learning in like the mathematical nitty gritty, how do you get good at poker type sense to the entire world in like an unprecedented way."}, {"time": 7009, "text": "He gave, he had this gift that he had learned and distilled by working with some of the greatest poker minds."}, {"time": 7017, "text": "And he just democratized it through his website."}, {"time": 7021, "text": "And I learned a ton from him."}, {"time": 7021, "text": "And not only that, but you just listen to him think."}, {"time": 7029, "text": "And it's almost like a philosophical meditation, the way that he breaks things down and thinks about these different elements and has such a holistic thought process."}, {"time": 7038, "text": "It's like watching a genius work."}, {"time": 7038, "text": "And, you know, he's also just a nice, fun, sociable guy that like, you can, you can imagine being at your dinner table."}, {"time": 7044, "text": "So all that combined."}, {"time": 7050, "text": "Which is not true for a lot of poker players, right?"}, {"time": 7050, "text": "A lot of them are dark souls."}, {"time": 7054, "text": "To say the least, yes."}, {"time": 7054, "text": "I like, I really like the, what is he, Canadian Daniel Negrano."}, {"time": 7061, "text": "He's also a nice guy."}, {"time": 7061, "text": "He's also a nice guy, but he's also somebody who's able to express his thoughts about poker really well, but also in an entertaining way."}, {"time": 7065, "text": "He seems to be able to predict cards better than anybody I've ever seen."}, {"time": 7071, "text": "Like what."}, {"time": 7071, "text": "Did you watch the challenge?"}, {"time": 7071, "text": "Which challenge?"}, {"time": 7077, "text": "He, he lost like a million dollars recently to Doug Polk."}, {"time": 7077, "text": "He lost a million dollars to Doug Polk, heads up online."}, {"time": 7083, "text": "It's, it's awesome to watch these guys work."}, {"time": 7089, "text": "So I know you're 20, 21."}, {"time": 7089, "text": "So, so asking you for advice is, is a little bit funny, but, but at the same time, not because you've created a social network."}, {"time": 7099, "text": "You've created a startup from nothing as we talked about earlier, like without knowing how to program you've programmed."}, {"time": 7105, "text": "I mean, you've taken this whole journey that a lot of people I think would be really inspired by."}, {"time": 7114, "text": "So given that, and given the fact that 20 years from now, you probably laugh at the advice you're going to give now."}, {"time": 7120, "text": "If I don't laugh at the advice I give now, something went desperately wrong, right?"}, {"time": 7124, "text": "So do you have advice for people that want to follow in your footsteps and create a startup, whether it's in a software app domain or whether it's anything else."}, {"time": 7138, "text": "So I'll speak specifically about social media apps."}, {"time": 7138, "text": "Try to keep it as narrow as possible so I can laugh as little as possible when I'm 41."}, {"time": 7145, "text": "And what I would say is that if you're like a 21, 22 year old, who's looking at me and being like, I want to do something like this."}, {"time": 7158, "text": "What I would say is you probably know better than just about anyone."}, {"time": 7158, "text": "And if you have a feeling in yourself that this is something that I have to do, and this is something I could imagine myself doing for the next 10 years, because if you're successful, you are going to have to do it for the next 10 years."}, {"time": 7175, "text": "And through the ups and the downs, through the amazing interviews with Lex, and through the not so amazing articles you might have with other people, right?"}, {"time": 7180, "text": "And you're going to have to ride those highs and lows and you have to believe in what you're doing."}, {"time": 7187, "text": "But if you have that feeling, what I would say is listen to as few people as possible, because people are experts in domains."}, {"time": 7198, "text": "But when it comes to what's hot and what makes sense in a social context, you are the authority as a young person who's going through these things and living in your sort of milieu."}, {"time": 7212, "text": "And I mean, I've talked to, at this point, you know, so many experts, so many investors, VCs."}, {"time": 7221, "text": "You'd be amazed at the advice I've gotten."}, {"time": 7221, "text": "Advice I've gotten."}, {"time": 7229, "text": "So there's like a minefield of bad advice."}, {"time": 7232, "text": "That's the hardest part, I think, for young people."}, {"time": 7232, "text": "And it's the thing, when people, like, I help Yellies all the time who ask, like, I never turn down, when a founder asks me to have a conversation, I never turn it down."}, {"time": 7243, "text": "I'm always there for them."}, {"time": 7243, "text": "And the number one thing I worry about is that at Yale, we're taught implicitly and explicitly that you listen to the adult in the room, you listen to the person with the highest, you know, pay grade."}, {"time": 7255, "text": "And it's devastating, because that's how innovation dies."}, {"time": 7262, "text": "And, you know, yeah, it's intimidating to, like, you talk to VC who probably means worth a billion dollars, a billion dollars, and they're going to tell you, you know, all the, all the successful startups they have funders or even just a successful business owner, uh, is going to tell you some advice and it's hard psychologically to think that they might be wrong."}, {"time": 7288, "text": "Yeah, but you're saying that's the only way you succeed."}, {"time": 7291, "text": "The only way you succeed, because if they knew what they were doing, they would have built it themselves."}, {"time": 7295, "text": "Um, and what's especially hard is people go, oh, of course, you know, I'll listen to people's, I'll listen to their advice, but I'll know why it's wrong."}, {"time": 7306, "text": "And then I'll, and I'll do my own thing."}, {"time": 7306, "text": "And that sounds great in the abstract, but sometimes you can't always even put your finger on why they're wrong."}, {"time": 7310, "text": "And I think to have the conviction, to say, you're wrong and I can't tell you why, but I still think I'm right."}, {"time": 7314, "text": "It's a rare thing, especially at like, it's very counterintuitive."}, {"time": 7321, "text": "And you might even say it's hubris or arrogant, but I think it's necessary because a lot of these things are, they're not things that you can really put into words until you see them in action."}, {"time": 7333, "text": "Like a lot of them are kind of happy accidents."}, {"time": 7339, "text": "It's been, it's been tough for me, like as a, as a person who, um, like I'm very empathetic."}, {"time": 7345, "text": "So I, when people tell me stuff, I kind of want to understand them."}, {"time": 7383, "text": "Like, I love my parents very much, but like, they're just like, they don't get it."}, {"time": 7390, "text": "And, and as you put it beautifully, it's very difficult to put your finger on exactly why, because, uh, a lot of advice sounds reasonable."}, {"time": 7397, "text": "That's the worst kind."}, {"time": 7405, "text": "Uh, if it, if it sounds really good, that just means it's an earworm."}, {"time": 7405, "text": "Like, that's like a song that you hear on the radio and then you're like, you're humming it in the car and it's like, it's the same thing."}, {"time": 7415, "text": "The more, the better it sounds, the more skeptical."}, {"time": 7415, "text": "Reason is a, is a bad drug."}, {"time": 7421, "text": "Like, should be very careful because, like, you know, the things that seem impossible, every, every major innovation, every major business seems impossible at birth."}, {"time": 7459, "text": "But that advice is useless when you're in love."}, {"time": 7459, "text": "I guess the best the point is to just pat the person on the back and say, go get him, kid."}, {"time": 7464, "text": "Good Will Hunting."}, {"time": 7470, "text": "I went to see about a girl."}, {"time": 7470, "text": "I love that movie."}, {"time": 7470, "text": "But yeah, that, that's, that took me a long time to figure out."}, {"time": 7479, "text": "I'm still trying to fight through it, but especially when you're young, that's hard."}, {"time": 7484, "text": "But, you know, it's, it's, it's, it's, it's, it's, but, uh, nothing in life is, uh, worth accomplishing is easy."}, {"time": 7493, "text": "So, but I think it's really interesting."}, {"time": 7500, "text": "You make that connection between like startup advice and like your parents, because it's the exact same sort of mechanism where when you're young, your parents are usually like, right."}, {"time": 7509, "text": "And the experts are usually right."}, {"time": 7509, "text": "And, you know, if you listen to them and you, you, you follow their orders, you're going to go to a school like Yale and at a certain point stops making sense."}, {"time": 7518, "text": "And I've, I've seen my friends at Yale go down paths because they just continued listening to their parents that I know in their heart of hearts is not the right path for them."}, {"time": 7533, "text": "That's how I see like the education system."}, {"time": 7533, "text": "The whole point is to guide you to a certain point in your life."}, {"time": 7542, "text": "And everybody's point is different."}, {"time": 7542, "text": "And your task is to, at that point, to have a personal revolution and create your own path."}, {"time": 7551, "text": "But no one tells you that."}, {"time": 7557, "text": "Nobody tells you that because they're, they want you to keep following the same path as they, they're leading you towards."}, {"time": 7560, "text": "Like they're not going to say your whole job is to eventually rebel."}, {"time": 7565, "text": "That's how revolution, that's how rebellion works."}, {"time": 7565, "text": "You're not supposed to be told, but that is the task."}, {"time": 7571, "text": "They can take you just like you said, and depending who you are, they can take you really far."}, {"time": 7576, "text": "But at a certain point you have to rebel."}, {"time": 7576, "text": "That could be getting your PhD, that could be in your undergrad, that could be high school."}, {"time": 7581, "text": "It could be any point."}, {"time": 7585, "text": "One thing that I think played a pretty pivotal role, and I've never really mentioned this, he might not even know the person about to tell you about, in sort of me actually going out and making Librex was that I was taking this graduate level math class, my sophomore year."}, {"time": 7597, "text": "And I met this, I met this PhD student who was also in it and had considerable citations and also startup experience."}, {"time": 7613, "text": "And I think he actually ended up being the CTO of a unicorn later on."}, {"time": 7613, "text": "I've sort of lost touch with him, but we're still Facebook friends as it is in the 21st century."}, {"time": 7619, "text": "So, and I was in a class and I was telling him, I really want to, I really want to make this thing, but I have no technical background."}, {"time": 7630, "text": "And he, this guy's a computer genius."}, {"time": 7630, "text": "He worked under Dan Spielman at Yale."}, {"time": 7630, "text": "So he's a good guy."}, {"time": 7639, "text": "And we were doing some math together."}, {"time": 7639, "text": "We were doing something on discrepancy for those of you who really care about math."}, {"time": 7643, "text": "So combinatorics."}, {"time": 7643, "text": "And he just turns to me, he's like, I think you could do it."}, {"time": 7651, "text": "Like, what do you mean you think I could do?"}, {"time": 7651, "text": "He's like, I think you could do it."}, {"time": 7655, "text": "And I was like, really?"}, {"time": 7655, "text": "But I respected this guy so much."}, {"time": 7661, "text": "His name was Young Duck."}, {"time": 7661, "text": "Shout out to Young Duck."}, {"time": 7661, "text": "I respected this guy so much that I was like, if Young Duck says I can do it and Young Duck is a legit genius and he knows, and he knows me, because we were in two classes together and we'd spent a lot of time together."}, {"time": 7675, "text": "If he thinks I can do it, then who am I to say I can't do it?"}, {"time": 7679, "text": "You know, that's a lesson for mentorship is like, by the way, he has no idea probably."}, {"time": 7686, "text": "Well, he might not even remember that interaction, which is funny."}, {"time": 7686, "text": "But the point is that when a crazy young kid comes up to you with a crazy dream, you know, every once in a while, you should just pat him on the back and say, I believe in you."}, {"time": 7699, "text": "Like you can do it."}, {"time": 7699, "text": "If they look up to you, that means your words have power."}, {"time": 7705, "text": "And if you say, no, no, come on, be like reasonable, like, you know, finish your schoolwork kind of thing."}, {"time": 7712, "text": "Like that's, that's unreasonable to take that leap now."}, {"time": 7719, "text": "Just finish your education, blah, blah, blah, whatever, whatever the reasonable advice is every once in a while, maybe often as a mentor, you should say, you know, go see about a girl in California or whatever the equivalent is."}, {"time": 7730, "text": "That was my moment."}, {"time": 7730, "text": "That was my good will hunting moment."}, {"time": 7736, "text": "That's your good will hunting moment."}, {"time": 7736, "text": "Man, I miss Robin Williams."}, {"time": 7736, "text": "I was a special guy."}, {"time": 7743, "text": "People love it when I ask about book recommendations in general."}, {"time": 7743, "text": "Of course, your journey is just beginning."}, {"time": 7748, "text": "But is there something that jumps out to you?"}, {"time": 7748, "text": "Technical, fiction, philosophical, sci fi, coloring books, blog posts you read somewhere that had an impact on your life?"}, {"time": 7758, "text": "Video games."}, {"time": 7758, "text": "Video games that you recommend to others."}, {"time": 7758, "text": "Minecraft, manual."}, {"time": 7766, "text": "Manga."}, {"time": 7766, "text": "I mean, yeah, video, you could mention video games too, if there's something that jumps out to you that just had like an impact."}, {"time": 7776, "text": "I guess I'll say I really liked the book, The War of Art, which is a book about creative resistance and the creative struggle and what it means to be creative."}, {"time": 7783, "text": "And part of what I see in this conversation and what you're doing, Lex, is so much of The War of Art's idea is that you just keep writing and writing and writing until you get to the new crap."}, {"time": 7795, "text": "And you just roll with it, right?"}, {"time": 7803, "text": "And that's sort of what happens when you have like three hour conversations with people is you can only have so much scripted or societally constructed stuff until you get to the real you."}, {"time": 7815, "text": "And you have to show up."}, {"time": 7815, "text": "I mean, that book is kind of painful."}, {"time": 7818, "text": "It's really painful."}, {"time": 7818, "text": "And it's not something I would recommend for every part of it, but for what it did in my life at the time."}, {"time": 7822, "text": "It also kind of normalized, I don't know, part of my coming of age story is part of it's about realizing that I'm a creative person and person who needs to create."}, {"time": 7835, "text": "That's sort of a God given thing, I think, for a lot of people."}, {"time": 7841, "text": "But it's something that I don't really feel like I can live without."}, {"time": 7841, "text": "And part of it was realizing that even within some of these more rigid structures, it's okay that I don't sort of fit in with them."}, {"time": 7850, "text": "And to hear about the struggles of other creatives was something for my own self esteem and my own growing up that was really important to me."}, {"time": 7855, "text": "So I don't think the book itself might be perfect, but for what it did for my life, it was really impactful."}, {"time": 7866, "text": "Yeah, I think exactly."}, {"time": 7866, "text": "The words may not be exactly right by way of advice, but I think the journey that a lot of creatives take by reading that book is kind of profound."}, {"time": 7873, "text": "He also has another one called Turning Pro, I think."}, {"time": 7880, "text": "I mean, he in general espouses like taking it seriously."}, {"time": 7886, "text": "If you have a creative mind and you want to create something special in this world, go do it."}, {"time": 7892, "text": "Don't show up."}, {"time": 7892, "text": "Look at that blank page."}, {"time": 7898, "text": "So many people would tell me, would encourage me either blatantly or through implicit means to basically take the Apple S seriously."}, {"time": 7905, "text": "It's a good signal, by the way."}, {"time": 7905, "text": "It's a good signal because my really close friends, the ones who have always supported me, they never said that because they got it."}, {"time": 7918, "text": "They understood that that was my path."}, {"time": 7918, "text": "And they might be skeptical."}, {"time": 7918, "text": "They might be like, I mean, one of my friends I remember told me, I was always taken aback about why you were so certain this would work out."}, {"time": 7929, "text": "And he's like, I finally got it once I saw it popping off, but before that, I just didn't get it."}, {"time": 7934, "text": "But he still supported me."}, {"time": 7934, "text": "And I think it's a really good signal."}, {"time": 7940, "text": "And actually just the fact of going through this process has made me socially feel so much more connected."}, {"time": 7947, "text": "And I've somewhat consolidated my social life to some degree, but it's so much more vulnerable, connected."}, {"time": 7951, "text": "And that's part of the creative process."}, {"time": 7951, "text": "I have to thank for that, I think."}, {"time": 7956, "text": "There's something that's unstoppable about the creative mind."}, {"time": 7956, "text": "It's right there, that fire."}, {"time": 7962, "text": "And I guess part of the thing that you're supposed to do is let that fire burn."}, {"time": 7969, "text": "In whichever direction."}, {"time": 7969, "text": "And it's going to hurt."}, {"time": 7969, "text": "It's going to hurt."}, {"time": 7969, "text": "Fire will hurt."}, {"time": 7975, "text": "But on the topic of video games, you mentioned the Stanley Parable offline."}, {"time": 7980, "text": "You said you played some video games."}, {"time": 7980, "text": "Is there a video game that you especially love that you recommend I play, for example?"}, {"time": 7984, "text": "Yeah, I'll mention."}, {"time": 7984, "text": "It's actually really in keeping with what we've been talking about."}, {"time": 7990, "text": "It's the Beginner's Guide, which was made by the same guy, Davey Rendon, who made the Stanley Parable, which I briefly saw you."}, {"time": 7996, "text": "I just clicked the video and then I went to sleep."}, {"time": 8002, "text": "It was like 2 a.m."}, {"time": 8002, "text": "But I briefly saw that you were looking at."}, {"time": 8002, "text": "And it's a game that is better treated as art."}, {"time": 8012, "text": "And I think I won't claim to understand the creator, because that would be a cardinal sin to me as a creative person."}, {"time": 8020, "text": "But it gets to the heart of a lot of the things that we've been talking about, which is the creative mind."}, {"time": 8029, "text": "The game can be interpreted in a lot of ways in a feminist way."}, {"time": 8034, "text": "It could be interpreted as a story of friends."}, {"time": 8034, "text": "It could be interpreted as the story of critics versus a creative."}, {"time": 8041, "text": "The way I like to interpret it, and I don't want to give away too much, is the story of the creative part of your mind that creates just for the sake of creating."}, {"time": 8056, "text": "Meaning the part that creates for no rhyme or reason or clear meaning."}, {"time": 8056, "text": "It's almost ethereal."}, {"time": 8064, "text": "Versus the part that's, you could call it the editor."}, {"time": 8064, "text": "You could call it the pragmatist."}, {"time": 8072, "text": "You could call it the necessary force of ego in our lives."}, {"time": 8072, "text": "We can't totally be egoless, right?"}, {"time": 8078, "text": "But we need to be egoless to be creative."}, {"time": 8078, "text": "And how that sort of internal censure, what role does it play?"}, {"time": 8085, "text": "And how do we allow our creative minds to be creative?"}, {"time": 8085, "text": "And yet, how do we still become useful?"}, {"time": 8092, "text": "And it's funny that a video game could have this in."}, {"time": 8095, "text": "It's a fascinating tension, which reminds me about the ridiculous question that every once in a while asks about meaning and death."}, {"time": 8102, "text": "So, this whole ride ends."}, {"time": 8102, "text": "You're at the beginning of the ride, but it could end any day, actually."}, {"time": 8111, "text": "That's kind of the way human life works."}, {"time": 8111, "text": "You could die today, you could die tomorrow."}, {"time": 8117, "text": "Do you think about your mortality?"}, {"time": 8117, "text": "Do you think about death?"}, {"time": 8122, "text": "Do you meditate on it?"}, {"time": 8122, "text": "And in that context, as the creative, but a pragmatist, too, as running a startup, what do you think is the meaning of this whole thing?"}, {"time": 8135, "text": "Yeah, so, on mortality, right?"}, {"time": 8135, "text": "About three years ago, four years ago now, I was excited to go to Yale."}, {"time": 8146, "text": "I was playing six hours of squash a day, which squash is a sport I love so much."}, {"time": 8146, "text": "And I was really getting a lot better."}, {"time": 8153, "text": "And I was even thinking I could maybe walk onto the Yale team."}, {"time": 8160, "text": "And I woke up one day, I felt really, really sick."}, {"time": 8160, "text": "I went and I decided not to go squash that day."}, {"time": 8171, "text": "I wanted to, I almost did."}, {"time": 8171, "text": "And you'll see how this story turns out."}, {"time": 8171, "text": "You'll decide if I made the right choice."}, {"time": 8180, "text": "I decided not to go squash today."}, {"time": 8180, "text": "And I decided to get my driver's license, or I had to get my driver's license because I wanted to get a driver's license before I went off to college, because otherwise I might never get it."}, {"time": 8191, "text": "And I'm going back and I successfully got my driver's license for Hashem."}, {"time": 8195, "text": "And I go back to my house and I decided I don't want to drive back because I just feel so sick."}, {"time": 8204, "text": "Like things are spinning."}, {"time": 8204, "text": "I have the worst headache."}, {"time": 8204, "text": "I come home, I run back right into my bed and feeling really sick to the point where I even like asked my mom who is a doctor, I'm like, should I go to the hospital?"}, {"time": 8215, "text": "And she's like, you can just wait it out and she'll get better."}, {"time": 8220, "text": "And then, you know, and then at one point I look at my arms and they're like covered in this like red splotchy stuff."}, {"time": 8228, "text": "And I'm like, mom, I think."}, {"time": 8228, "text": "And she's like, yeah, we have to go."}, {"time": 8234, "text": "And so I go there and they're like, you have scarlet fever."}, {"time": 8234, "text": "And they're like, there's nothing we can do."}, {"time": 8240, "text": "You should probably just go back home."}, {"time": 8240, "text": "So I go back home."}, {"time": 8240, "text": "Six hours later I wake up in the morning."}, {"time": 8244, "text": "They'd let me out at like 3 a.m."}, {"time": 8244, "text": "They let me, I come home in the morning and I feel this, like a spear through my chest."}, {"time": 8250, "text": "And I never felt anything like it."}, {"time": 8250, "text": "And I was, it was very disconcerting when you have a, cause we're all used to different sorts of pain, right?"}, {"time": 8261, "text": "And that was the sort of pain I never felt before."}, {"time": 8261, "text": "As far as an athlete, you're used to like, you know, pain."}, {"time": 8266, "text": "So I told my parents and immediately we hop back in the car."}, {"time": 8266, "text": "We go up to the same hospital I was at six hours ago."}, {"time": 8271, "text": "And they initially didn't want to let me in."}, {"time": 8271, "text": "And I was like, I have chest pain."}, {"time": 8275, "text": "They're like, oh, come in."}, {"time": 8275, "text": "Cause they're like, you're a healthy guy, wait your turn."}, {"time": 8278, "text": "And I'm like, no, you don't understand."}, {"time": 8278, "text": "I have like a pain in my chest."}, {"time": 8282, "text": "And then they let me in."}, {"time": 8282, "text": "They start doing tests on me."}, {"time": 8282, "text": "They like put something like in my back, which is really scary."}, {"time": 8287, "text": "It's a huge needle."}, {"time": 8287, "text": "And I'm smiling because it's like one of the ways I reduce stress, I guess, or deal with this sort of thing and make light of it."}, {"time": 8292, "text": "But like, you know, that, you know, it's definitely very scary in the moment, shocking and scary."}, {"time": 8302, "text": "And they go and they, they do a bunch of tests and they determined that a virus like attacked my heart and I had myocarditis and pericarditis."}, {"time": 8308, "text": "And they said I had maybe 25 to 35% chance at one point of dying."}, {"time": 8315, "text": "And so I'm sitting in my, they admit me into the hospital."}, {"time": 8315, "text": "I'm in the bed, in my bed for about three weeks."}, {"time": 8323, "text": "And I'm just, I'm just standing there."}, {"time": 8323, "text": "And I had this moment also that I remember very specifically where I was in so much pain that like I was crying, not out of like emotional standpoint, but actually just purely out of the pain itself."}, {"time": 8341, "text": "Like I could feel my heart in my chest."}, {"time": 8347, "text": "And when I leaned back, I felt it touch my rib cage and feel horrible."}, {"time": 8352, "text": "So I couldn't go to sleep and lean back."}, {"time": 8352, "text": "I had to lean forward all throughout the night."}, {"time": 8357, "text": "And I'm feeling my, and I'm feeling my chest."}, {"time": 8357, "text": "I'm feeling this terrible pain in my chest."}, {"time": 8361, "text": "I'm crying unstoppably."}, {"time": 8361, "text": "And I mean, also maybe I should mention that at the time I was someone who like refused to take in anything into my body that wasn't natural."}, {"time": 8368, "text": "And so a lot of the time I, I tried to be unmedicated."}, {"time": 8373, "text": "Eventually I didn't allow them to add a little medication to my body, but there's just so much uncertainty and pain."}, {"time": 8380, "text": "And the first time I had to come to terms with mortality."}, {"time": 8386, "text": "First of all, I think you still should have gone and played squash."}, {"time": 8386, "text": "I mean, come on."}, {"time": 8392, "text": "I thought you're serious about this."}, {"time": 8392, "text": "You still carry that with you sort of."}, {"time": 8401, "text": "There is power to realizing the ride can end."}, {"time": 8401, "text": "Very suddenly."}, {"time": 8408, "text": "And painfully."}, {"time": 8408, "text": "And, you know, it, it has pragmatic application to like what you, to trajectories you take through life."}, {"time": 8419, "text": "Something else that is worth noting is that I, for the next year, couldn't walk to my classes."}, {"time": 8427, "text": "So I get to Yale, they put me in a medical single alone, and I have to get shuttled to all my classes."}, {"time": 8435, "text": "I have to ask, I had to ask a few professors to even move classes so I could actually get there."}, {"time": 8439, "text": "I can't move my book."}, {"time": 8439, "text": "I can't lift my book bags."}, {"time": 8439, "text": "I can't, I can't walk upstairs."}, {"time": 8448, "text": "I spent like 12 hours a day in my dorm room, just like staring at the walls and more so."}, {"time": 8448, "text": "And more than that, all this, like, you, I got to watch my body, like, deteriorate and like the muscle, like fall off of it."}, {"time": 8465, "text": "Cause I was, I was taking these pills and they're kind of catabolic."}, {"time": 8465, "text": "And for an 18 year old, I mean, I think every 18 year old has feelings about their body, man or woman."}, {"time": 8478, "text": "And, you know, just seeing this, it's like, you're watching sort of death transpire."}, {"time": 8478, "text": "And it's like, and you're also very fatigued because your heart's not at peak condition."}, {"time": 8484, "text": "And you're thinking about the future and a lot of the things you enjoy have kind of been stripped away from you."}, {"time": 8495, "text": "And I took up a meditation practice, like started with like five minutes a day."}, {"time": 8495, "text": "At my peak, I was at like 40 minutes a day, kept it up consistently for about two years."}, {"time": 8503, "text": "And I started thinking about, like, what do I want to do?"}, {"time": 8510, "text": "And like, what do I care about?"}, {"time": 8510, "text": "And to get to your point, I think you were asking, like, how does this carry forward?"}]}]