[{"title": "Nick Lane: Origin of Life, Evolution, Aliens, Biology, and Consciousness | Lex Fridman Podcast #318", "id": "tOtdJcco3YM", "quotes": [{"time": 287, "text": "It's taking the hydrogen, the bubbles out of the earth in these hydrothermal vents, and it sticks it on CO2."}, {"time": 293, "text": "And it's kind of really as simple as that."}, {"time": 296, "text": "And actually, thermodynamically, there's the thing that I find most troubling is that if you do these experiments in the lab, the molecules you get are exactly the molecules that we see at the heart of biochemistry in the heart of life."}, {"time": 308, "text": "Is there something to be said about the earliest origins of that little potion, that chemical process?"}, {"time": 321, "text": "What really is the spark there?"}, {"time": 324, "text": "There isn't a spark."}, {"time": 328, "text": "There is a continuous chemical reaction."}, {"time": 331, "text": "And there is kind of a spark, but it's a continuous electrical charge which helps drive that reaction."}, {"time": 337, "text": "There's a literally spark."}, {"time": 339, "text": "Well, the charge at least, but yes."}, {"time": 341, "text": "I mean, a spark in that sense is, we tend to think of in terms of Frankenstein, we tend to think in terms of electricity and one moment you zap something and it comes alive."}, {"time": 353, "text": "It's come alive and now what's sustaining it?"}, {"time": 356, "text": "Well, we are sustained by oxygen, by this continuous chemical reaction."}, {"time": 362, "text": "And if you put a plastic bag on your head, then you've got a minute or something before it's all over."}, {"time": 367, "text": "So some way of being able to leverage a source of energy."}, {"time": 371, "text": "Well, the source of energy at the origin of life is the reaction between carbon dioxide and hydrogen."}, {"time": 375, "text": "And amazingly, most of these reactions are exergonic, which is to say they release energy."}, {"time": 381, "text": "If you have hydrogen and CO2 and you put them together in a falcon tube and you warm it up to say 50 degrees centigrade and you put in a couple of catalysts and you shake it, nothing's gonna happen."}, {"time": 392, "text": "But thermodynamically, that is less stable."}, {"time": 395, "text": "Two gases, hydrogen and CO2, is less stable than cells."}, {"time": 399, "text": "What should happen is you get cells coming out."}, {"time": 403, "text": "So why doesn't that happen?"}, {"time": 405, "text": "It's because of the kinetic barriers."}, {"time": 407, "text": "That's where you need the spark."}, {"time": 409, "text": "Is it possible that life originated multiple times on Earth?"}, {"time": 414, "text": "The way you describe it, you make it sound so easy."}, {"time": 417, "text": "There's a long distance to go from the first bits of prebiotic chemistry to, say, molecular machines like ribosomes."}, {"time": 425, "text": "Is that the first thing that you would say is life?"}, {"time": 429, "text": "Like if I introduce you, the two of you at a party, you would say that's a living thing?"}, {"time": 435, "text": "I would say as soon as we introduce genes, information, into systems that are growing anyway, so I would talk about growing protocells, as soon as we introduce even random bits of information into there, I'm thinking about RNA molecules, for example, doesn't have to have any information in it."}, {"time": 456, "text": "It can be a completely random sequence."}, {"time": 458, "text": "But if it's introduced into a system which is in any case growing and doubling itself and reproducing itself, then any changes in that sequence that allow it to do so better or worse are now selected by perfectly normal natural selection."}, {"time": 471, "text": "But it's a system."}, {"time": 472, "text": "So that's when it becomes alive to my mind."}, {"time": 474, "text": "That's encompassed into like an object that keeps information and evolves that information over time or changes that information over time in response to the."}, {"time": 487, "text": "So it's always part of a cell system from the very beginning."}, {"time": 491, "text": "So is your sense that it started only once because it's difficult or is it possibly started in multiple locations on Earth?"}, {"time": 498, "text": "It's possible it started multiple occasions."}, {"time": 502, "text": "There's two provisos to that."}, {"time": 503, "text": "One of them is oxygen makes it impossible really for life to start."}, {"time": 509, "text": "So as soon as we've got oxygen in the atmosphere, then life isn't gonna keep starting over."}, {"time": 514, "text": "So I often get asked by people, why can't we have life starting?"}, {"time": 517, "text": "If it's so easy, why can't life start in these vents now?"}, {"time": 520, "text": "And the answer is if you want hydrogen to react with CO2 and there's oxygen there, hydrogen reacts with oxygen instead."}, {"time": 526, "text": "It's just, you get an explosive reaction that way."}, {"time": 528, "text": "It's rocket fuel."}, {"time": 530, "text": "So it's never gonna happen."}, {"time": 531, "text": "But for the origin of life earlier than that, all we know is that there's a single common ancestor for all of life."}, {"time": 538, "text": "There could have been multiple origins and they all just disappeared."}, {"time": 542, "text": "But there's a very interesting deep split in life between bacteria and what are called archaea, which look just the same as bacteria."}, {"time": 552, "text": "And they're not quite as diverse, but nearly."}, {"time": 554, "text": "And they are very different in their biochemistry."}, {"time": 558, "text": "And so any explanation for the origin of life has to account as well for why they're so different and yet so similar."}, {"time": 564, "text": "And that makes me think that life probably did arise only once."}, {"time": 569, "text": "Can you describe the difference that's interesting there?"}, {"time": 571, "text": "Well, how they're similar, how they're different?"}, {"time": 574, "text": "Well, they're different in their membranes primarily."}, {"time": 578, "text": "They're different in things like DNA replication."}, {"time": 580, "text": "They use completely different enzymes and the genes behind it for replicating DNA."}, {"time": 584, "text": "So they both have membranes, both have DNA replication."}, {"time": 588, "text": "The process of that is different."}, {"time": 590, "text": "They both have DNA."}, {"time": 592, "text": "The genetic code is identical in them both."}, {"time": 594, "text": "The way in which it's transcribed into RNA, into the copy of a gene, and the way that that's then translated into a protein, that's all basically the same in both of these groups."}, {"time": 605, "text": "So they clearly share a common ancestor."}, {"time": 608, "text": "It's just that they're different in fundamental ways as well."}, {"time": 610, "text": "And if you think about, well, what kind of processes could drive that divergence very early on?"}, {"time": 618, "text": "I can think about it in terms of membranes, in terms of the electrical charges on membranes."}, {"time": 622, "text": "And it's that that makes me think that there was probably, there were probably many unsuccessful attempts but only one really successful attempt."}, {"time": 630, "text": "Can you explain why that divergence makes you think there's one common ancestor?"}, {"time": 636, "text": "Okay, can you describe that intuition?"}, {"time": 638, "text": "I'm a little bit unclear about why the divert, like the leap from the divergence means there's one."}, {"time": 643, "text": "Do you mean like the divergence indicates that there was a big invention at that time from one source?"}, {"time": 652, "text": "If you'd got, as I imagine it, you have a common ancestor living in a hydrothermal vent."}, {"time": 659, "text": "Let's say there are millions of vents and millions of potential common ancestors living in all of those vents, but only one of them makes it out first."}, {"time": 669, "text": "Then you could imagine that that cell is then gonna kind of take over the world and wipe out everything else."}, {"time": 674, "text": "And so what you would see would be a single common ancestor for all of life."}, {"time": 678, "text": "But with lots of different vent systems all kind of vying to create the first life forms, you might say."}, {"time": 685, "text": "So this thing is a cell, a single cell organism."}, {"time": 688, "text": "We're always talking about populations of cells, but yes."}, {"time": 692, "text": "These are single celled organisms."}, {"time": 693, "text": "But the fundamental life form is a single cell, right?"}, {"time": 697, "text": "So like, or, so they're always together but they're alone together."}, {"time": 704, "text": "There's a machinery in each one individual component that if left by itself would still work, right?"}, {"time": 711, "text": "It's the unit of selection is a single cell."}, {"time": 714, "text": "But selection operates over generations and changes over generations in populations of cells."}, {"time": 719, "text": "So it would be impossible to say that a cell is the unit of selection in the sense that unless you have a population, you can't evolve, you can't change."}, {"time": 727, "text": "Right, but there was one Chuck Norris, it's an American reference cell that made it out of the vents, right?"}, {"time": 737, "text": "Or like the first one."}, {"time": 739, "text": "So imagine then that there's one cell gets out and it takes over the world."}, {"time": 743, "text": "It gets out in the water, it's like floating around."}, {"time": 745, "text": "We're deep in the ocean somewhere."}, {"time": 748, "text": "But actually two cells got out and they appear to have got out from the same vent because they both share the same code and everything else."}, {"time": 758, "text": "So unless all the, you know, we've got a million different common ancestors in all these different vents."}, {"time": 764, "text": "So either they all have the same code and two cells spontaneously merge from different places or two different cells, fundamentally different cells came from the same place."}, {"time": 775, "text": "So either way, what are the constraints that say, not just one came out or not half a million came out, but two came out."}, {"time": 783, "text": "That's kind of a bit strange."}, {"time": 785, "text": "So how did they come out?"}, {"time": 786, "text": "Well, they come out because what are you doing inside a vent is you're relying on the electrical charges down there to power this reaction between hydrogen and CO2 to make yourself grow."}, {"time": 796, "text": "And when you leave the vent, you've got to do that yourself."}, {"time": 799, "text": "You've got to power up your own membrane."}, {"time": 801, "text": "And so the question is, well, how do you power up your own membrane?"}, {"time": 804, "text": "And the answer is, well, you need to pump."}, {"time": 807, "text": "You need to pump ions to give an electrical charge on the membrane."}, {"time": 810, "text": "So what do the pumps look like?"}, {"time": 812, "text": "Well, the pumps look different in these two groups."}, {"time": 815, "text": "It's as if they both emerged from a common ancestor."}, {"time": 817, "text": "As soon as you've got that ancestor, things move very quickly and divergently."}, {"time": 823, "text": "Why does the DNA replication look different?"}, {"time": 825, "text": "Well, it's joined to the membrane."}, {"time": 827, "text": "The membranes are different."}, {"time": 828, "text": "The DNA replication is different because it's joined to a different kind of membrane."}, {"time": 832, "text": "So there's interesting, this is detail, you may say, but it's also fundamental because it's about the two big divergent groups of life on Earth that seem to have diverged really early on."}, {"time": 842, "text": "And it all started from one organism."}, {"time": 846, "text": "And then that organism just start replicating the heck out of itself with some mutation of the DNA."}, {"time": 854, "text": "So like there's some, there's a competition through the process of evolution."}, {"time": 859, "text": "They're not like trying to beat each other up."}, {"time": 861, "text": "They're just, they're just trying to live."}, {"time": 864, "text": "Just replicate us."}, {"time": 866, "text": "Well, you know, let's not minimize there."}, {"time": 869, "text": "They're just trying to chill."}, {"time": 870, "text": "They're trying to relax up."}, {"time": 872, "text": "There's no, but there's no sense of trying to survive."}, {"time": 875, "text": "They're replicating."}, {"time": 876, "text": "I mean, there's no sense in which they're trying to do anything."}, {"time": 879, "text": "They're just kind of an outgrowth of the Earth, you might say."}, {"time": 882, "text": "Of course, the aliens would describe us humans in that same way."}, {"time": 885, "text": "They might be right."}, {"time": 887, "text": "This primitive life."}, {"time": 888, "text": "It's just ants that are hairless, mostly hairless."}, {"time": 896, "text": "What do you think about the idea of panspermia that the theory that life did not originate on Earth and was planted here from outer space?"}, {"time": 906, "text": "Or pseudopanspermia, which is like the basic ingredients, the magic that you mentioned was planted here from elsewhere in space?"}, {"time": 914, "text": "I don't find them helpful."}, {"time": 916, "text": "That's not to say they're wrong."}, {"time": 918, "text": "So, pseudotranspermia, the idea that the chemicals, the amino acids, the nucleotides are being delivered from space."}, {"time": 924, "text": "Well, we know that happens."}, {"time": 925, "text": "It's unequivocal."}, {"time": 927, "text": "They're delivered on meteorites, comets, and so on."}, {"time": 930, "text": "So what do they do next?"}, {"time": 931, "text": "That's, to me, the question."}, {"time": 933, "text": "Well, what do they do is they stock a soup."}, {"time": 935, "text": "Presumably, they land in a pond or in an ocean or wherever they land."}, {"time": 939, "text": "And then you end up with a best possible case scenario is you end up with a soup of nucleotides and amino acids."}, {"time": 944, "text": "And then you have to say, so now what happens?"}, {"time": 946, "text": "And the answer is, oh, well, they have to go, bloop, become alive."}, {"time": 950, "text": "So how did they do that?"}, {"time": 951, "text": "And you may as well say then a miracle happened."}, {"time": 954, "text": "I don't believe in soup."}, {"time": 957, "text": "I think what we have in event is a continuous conversion, a continuous growth, a continuous reaction, a continuous converting a flow of molecules into more of yourself, you might say, even if it's a small bit."}, {"time": 968, "text": "So you've got a kind of continuous self organization and growth from the very beginning."}, {"time": 974, "text": "You never have that in a soup."}, {"time": 977, "text": "Isn't the entire universe and living organisms in the universe, isn't it just soup all the way down?"}, {"time": 985, "text": "Isn't it all soup?"}, {"time": 985, "text": "No, no, I mean, soup almost by definition doesn't have a structure."}, {"time": 989, "text": "But soup is a collection of ingredients that are like randomly interacting."}, {"time": 994, "text": "Yeah, but they're not random."}, {"time": 996, "text": "They're not, I mean, we have chemistry going on here."}, {"time": 998, "text": "We have metal grains forming, which are, you know, effective oil water interactions."}, {"time": 1003, "text": "Okay, so it feels like there's a direction to a process, like a directed process."}, {"time": 1007, "text": "There are directions to processes, yeah."}, {"time": 1009, "text": "And if you're starting with CO2 and you've got two reactive fluids being brought together and they react, what are they gonna make?"}, {"time": 1017, "text": "Well, they make carboxylic acids, which include the fatty acids that make up the cell membranes."}, {"time": 1023, "text": "And they form directly into bilayer membranes."}, {"time": 1026, "text": "They form like soap bubbles."}, {"time": 1027, "text": "It's spontaneous organization caused by the nature of the molecules."}, {"time": 1032, "text": "And those things are capable of growing and are capable in effect of being selected even before there are genes."}, {"time": 1038, "text": "We have this, so we have a lot of order and that order is coming from thermodynamics."}, {"time": 1042, "text": "And the thermodynamics is always about increasing the entropy of the universe."}, {"time": 1047, "text": "But if you have oil and water and they're separating, you're increasing the entropy of the universe, even though you've got some order, which is the soap and the water are not missable."}, {"time": 1056, "text": "Now, to come back to your first question about panspermia properly, that just pushes the question somewhere else."}, {"time": 1065, "text": "That just, even if it's true, maybe life did start on Earth by panspermia."}, {"time": 1069, "text": "So what are the principles that govern the emergence of life on any planet?"}, {"time": 1075, "text": "It's an assumption that life started here."}, {"time": 1077, "text": "And it's an assumption that it started in a hydrothermal vent or it started in a terrestrial geothermal system."}, {"time": 1084, "text": "The question is, can we work out a testable sequence of events that would lead from one to the other one and then test it and see if there's any truth in it or not?"}, {"time": 1092, "text": "With panspermia, you can't do any of that."}, {"time": 1094, "text": "But the fundamental question of panspermia is, do we have the machine here on Earth to build life?"}, {"time": 1103, "text": "Is the vents enough?"}, {"time": 1105, "text": "Is oxygen and hydrogen and whatever the heck else we want and some source of energy and heat, is that enough to build life?"}, {"time": 1117, "text": "Well, that's, of course you would say that as a human."}, {"time": 1122, "text": "But there could be aliens right now chuckling at that idea."}, {"time": 1126, "text": "Maybe you need some special sauce, special elsewhere sauce."}, {"time": 1132, "text": "So your sense is we have everything here."}, {"time": 1134, "text": "I mean, this is precisely the question."}, {"time": 1137, "text": "I like to, when I'm talking in schools, I like to start out with the idea of we can make a time machine."}, {"time": 1143, "text": "We go back four billion years and we go to these environments that people talk about."}, {"time": 1147, "text": "We go to a deep sea hydrothermal vent, we go to a kind of Yellowstone Park type place environment and we find some slime that looks like we can test it."}, {"time": 1158, "text": "It's made of organic molecules."}, {"time": 1160, "text": "It's got a structure which is not obviously cells, but you know, is this a stepping stone on the way to life or not?"}, {"time": 1167, "text": "How do we know?"}, {"time": 1169, "text": "Unless we've got an intellectual framework that says this is a stepping stone and that's not a step."}, {"time": 1174, "text": "You know, we'd never know."}, {"time": 1175, "text": "We wouldn't know which environment to go to, what to look for, how to say this."}, {"time": 1178, "text": "So all we can ever hope for, because we're never gonna build that time machine, is to have an intellectual framework that can explain step by step, experiment by experiment, how we go from a sterile inorganic planet to living cells as we know them."}, {"time": 1192, "text": "And in that framework, every time you have a choice, it could be this way or it could be that way, or there's lots of possible forks down that road."}, {"time": 1202, "text": "Did it have to be that way?"}, {"time": 1203, "text": "Could it have been the other way?"}, {"time": 1205, "text": "And would that have given you life with very different properties?"}, {"time": 1208, "text": "And so if you come up with a, you know, it's a long hypothesis, because as I say, we're going from really simple prebiotic chemistry all the way through to genes and molecular machines."}, {"time": 1217, "text": "That's a long, long pathway."}, {"time": 1220, "text": "And nobody in the field would agree on the order in which these things happened, which is not a bad thing, because it means that you have to go out and do some experiments and try and demonstrate that it's possible or not possible."}, {"time": 1229, "text": "It's so freaking amazing that it happened though."}, {"time": 1237, "text": "It feels like there's a direction to the thing."}, {"time": 1241, "text": "Can you try to answer from a framework perspective of what is life?"}, {"time": 1249, "text": "So you said there's some order and yet there's complexity."}, {"time": 1257, "text": "So it's not perfectly ordered."}, {"time": 1259, "text": "It's not boring."}, {"time": 1260, "text": "There's still some fun in it."}, {"time": 1262, "text": "And it also feels like the processes have a direction through the selection mechanism."}, {"time": 1267, "text": "They seem to be building something, always better, always improving."}, {"time": 1274, "text": "I mean, maybe it's..."}, {"time": 1275, "text": "I mean, that's a perception."}, {"time": 1276, "text": "That's our romanticization of things are always better."}, {"time": 1280, "text": "Things are getting better, we'd like to believe that."}, {"time": 1282, "text": "I mean, you think about the world from the point of view of bacteria and bacteria are the first things to emerge from whatever environment they came from."}, {"time": 1290, "text": "And they dominated the planet very, very quickly."}, {"time": 1292, "text": "And they haven't really changed."}, {"time": 1294, "text": "Four billion years later, they look exactly the same."}, {"time": 1296, "text": "So about four billion years ago, bacteria started to really run the show."}, {"time": 1302, "text": "And then nothing happened for a while."}, {"time": 1304, "text": "Nothing happened for two billion years."}, {"time": 1307, "text": "Then after two billion years, we see another single event origin, if you like, of our own type of cell, the eukaryotic cells."}, {"time": 1313, "text": "So cells with a nucleus and lots of stuff going on inside."}, {"time": 1317, "text": "Another singular origin."}, {"time": 1318, "text": "It only happened once in the history of life on earth."}, {"time": 1321, "text": "Maybe it happened multiple times and there's no evidence."}, {"time": 1323, "text": "Everything just disappeared, but we have to at least take it seriously that there's something that stops bacteria from becoming more complex because they didn't."}, {"time": 1333, "text": "That's a fact that they emerged four billion years ago."}, {"time": 1337, "text": "And something happened two billion years ago, but the bacteria themselves didn't change."}, {"time": 1341, "text": "They remain bacterial."}, {"time": 1342, "text": "So there is no trajectory, necessary trajectory towards great complexity in human beings at the end of it."}, {"time": 1348, "text": "It's very easy to imagine that without photosynthesis arising or without eukaryotes arising, that a planet could be full of bacteria and nothing else."}, {"time": 1356, "text": "We'll get to that because that's a brilliant invention."}, {"time": 1359, "text": "And there's a few brilliant invention along the way."}, {"time": 1361, "text": "But what is life?"}, {"time": 1364, "text": "If you were to show up on earth, but to take that time machine, and you said, asking yourself the question, is this a stepping stone towards life?"}, {"time": 1372, "text": "As you step along, when you see the early bacteria, how would you know it's life?"}, {"time": 1379, "text": "And then this is really important question when you go to other planets and look for life."}, {"time": 1384, "text": "Like what is the framework of telling a difference between a rock and a bacteria?"}, {"time": 1392, "text": "I mean, the question's kind of both impossible to answer and trivial at the same time."}, {"time": 1396, "text": "And I don't like to answer it because I don't think there is an answer."}, {"time": 1399, "text": "I think we're trying to describe the process of time."}, {"time": 1402, "text": "Those are the most fun questions."}, {"time": 1402, "text": "What do you mean there's no answer?"}, {"time": 1403, "text": "No, there is no answer."}, {"time": 1404, "text": "I mean, there's lots of, there are at least 40 or 50 different definitions of life out there."}, {"time": 1409, "text": "And most of them are, well, obviously bad in one way or another."}, {"time": 1414, "text": "I mean, there's freaks."}, {"time": 1417, "text": "I can never remember the exact words that people use, but there's a NASA working definition of life, which more or less says a system, which is capable of self sustaining system, capable of evolution or something along those lines."}, {"time": 1432, "text": "And I immediately have a problem with the word self sustaining because it's sustained by the environment."}, {"time": 1438, "text": "And I know what they're getting at."}, {"time": 1440, "text": "I know what they're trying to say, but I pick a hole in that."}, {"time": 1443, "text": "And there's always wags who say, but you know, by that definition, a rabbit is not alive."}, {"time": 1447, "text": "Only a pair of rabbits would be alive because a single rabbit is incapable of copying itself."}, {"time": 1452, "text": "There's all kinds of pedantic, silly, but also important objections to any hypothesis."}, {"time": 1459, "text": "The real question is what is, you know, we can argue all day or people do argue all day about is a virus alive or not?"}, {"time": 1467, "text": "And it depends on the content."}, {"time": 1469, "text": "Most biologists could not agree about that."}, {"time": 1471, "text": "So then what about a jumping gene, a retro element or something that is even simpler than a virus, but it's capable of converting its environment into a copy of itself."}, {"time": 1482, "text": "And that's about as close, this is not a definition, but this is a kind of a description of life is that it's able to parasitize the environment."}, {"time": 1492, "text": "And that goes for plants as well as animals and bacteria and viruses to make a relatively exact copy of themselves, informationally exact copy of themselves."}, {"time": 1504, "text": "By the way, it doesn't really have to be a copy of itself, right?"}, {"time": 1507, "text": "It just has to be, you have to create something that's interesting, the way evolution is."}, {"time": 1516, "text": "So it is extremely powerful process of evolution, which is basically make a copy of yourself and sometimes mess up a little bit."}, {"time": 1525, "text": "That seems to work really well."}, {"time": 1526, "text": "I wonder if it's possible to mess up big time as a standard, as a default."}, {"time": 1532, "text": "It's called a hopeful monster and in principle it can."}, {"time": 1536, "text": "Actually, it turns out, I would say that this is due a reemergence, this is some amazing work from Michael Levin, I don't know if you came across him, but if you haven't interviewed him, you should interview him about, yeah."}, {"time": 1550, "text": "I'm talking to him in a few days."}, {"time": 1553, "text": "Oh, fantastic."}, {"time": 1554, "text": "So I mentioned, there's two people that Andre, if I may mention, Andre Kapathe is a friend who's really admired in the AI community, said you absolutely must talk to Michael and to Nick."}, {"time": 1569, "text": "So of course, I'm a huge fan of yours, so I'm really fortunate that we can actually make this happen."}, {"time": 1574, "text": "Anyway, you were saying?"}, {"time": 1576, "text": "Well, Michael Levin is doing amazing work, basically about the way in which electrical fields control development and he's done some work with planarian worms, so flat worms, where he'll tell you all about this, so I won't say any more than the minimum, but basically you can cut their head off and they'll redevelop a different, a new head."}, {"time": 1595, "text": "But the head that they develop depends, if you knock out just one iron pump in a membrane, so you change the electrical circuitry just a little bit, you can come up with a completely different head."}, {"time": 1607, "text": "It can be a head which is similar to those that diverged 150 million years ago or it can be a head which no one's ever seen before, a different kind of head."}, {"time": 1616, "text": "Now that is really, you might say, a hopeful monster."}, {"time": 1619, "text": "This is a kind of leap into a different direction."}, {"time": 1622, "text": "The only question for natural selection is does it work?"}, {"time": 1625, "text": "Is the change itself feasible as a single change?"}, {"time": 1628, "text": "And the answer is yes, it's just a small change to a single gene."}, {"time": 1631, "text": "And the second thing is it gives rise to a completely different morphology."}, {"time": 1636, "text": "And if it works, that can easily be a shift."}, {"time": 1641, "text": "But for it to be a speciation, for it to continue, for it to give rise to a different morphology over time, then it has to be perpetuated."}, {"time": 1652, "text": "So that shift, that change in that one gene has to work well enough that it is selected and it goes on."}, {"time": 1661, "text": "And copied enough times to where you can really test it."}, {"time": 1664, "text": "So the likelihood, it would be lost, but there will be some occasions where it survives."}, {"time": 1668, "text": "And yes, the idea that we can have sudden, fairly abrupt changes in evolution, I think it's time for a rebirth."}, {"time": 1674, "text": "What about this idea that kind of trying to mathematize a definition of life and saying how many steps, the shortest amount of steps it takes to build the thing, almost like an engineering view of it?"}, {"time": 1689, "text": "Ah, I like that view."}, {"time": 1691, "text": "Because I think that in a sense, that's not very far away from what a hypothesis needs to do to be a testable hypothesis for the origin of life."}, {"time": 1699, "text": "You need to spell out, here's each step, and here's the experiment to do for each step."}, {"time": 1704, "text": "The idea that we can do it in the lab, some people say, oh, we'll have created life within five years, but ask them what they mean by life."}, {"time": 1714, "text": "We have a planet four billion years ago with these vent systems across the entire surface of the planet, and we have millions of years if we wanted."}, {"time": 1721, "text": "I have a feeling that we're not talking about millions of years."}, {"time": 1724, "text": "I have a feeling we're talking about maybe millions of nanoseconds or picoseconds."}, {"time": 1729, "text": "We're talking about chemistry, which is happening quickly."}, {"time": 1733, "text": "But we still need to constrain those steps, but we've got a planet doing similar chemistry."}, {"time": 1740, "text": "You asked about a trajectory."}, {"time": 1742, "text": "The trajectory is the planetary trajectory."}, {"time": 1745, "text": "The planet has properties."}, {"time": 1746, "text": "Basically, it's got a lot of iron at the center of it."}, {"time": 1748, "text": "It's got a lot of electrons at the center of it."}, {"time": 1750, "text": "It's more oxidized on the outside, partly because of the sun and partly because the heat of volcanoes puts out oxidized gases."}, {"time": 1757, "text": "So the planet is a battery."}, {"time": 1759, "text": "It's a giant battery, and we have a flow of electrons going from inside to outside in these hydrothermal vents, and that's the same topology that a cell has."}, {"time": 1769, "text": "A cell is basically just a micro version of the planet, and there is a trajectory in all of that, and there's an inevitability that certain types of chemical reaction are going to be favored over others, and there's an inevitability in what happens in water, the chemistry that happens in water."}, {"time": 1787, "text": "Some will be immiscible with water and will form membranes and will form insoluble structures, and nobody really understands water very well, and it's another big question."}, {"time": 1800, "text": "For experiments on the origin of life, what do you put it in?"}, {"time": 1804, "text": "What kind of structure do we want to induce in this water?"}, {"time": 1807, "text": "Because the last thing it's likely to be is just kind of bulk water."}, {"time": 1811, "text": "How fundamental is water to life, would you say?"}, {"time": 1814, "text": "I would say pretty fundamental."}, {"time": 1817, "text": "I wouldn't like to say it's impossible for life to start any other way, but water is everywhere."}, {"time": 1826, "text": "Water's extremely good at what it does, and carbon works in water especially well."}, {"time": 1831, "text": "So those things, and carbon is everywhere."}, {"time": 1833, "text": "So those things together make me think probabilistically, if we found a thousand life forms, 995 of them would be carbon based and living in water."}, {"time": 1841, "text": "Now the reverse question, if you found a puddle of water elsewhere and some carbon, no, just a puddle of water."}, {"time": 1850, "text": "Is a puddle of water a pretty damn good indication that life either exists here or has once existed here?"}, {"time": 1862, "text": "So it doesn't work the other way."}, {"time": 1864, "text": "I think you need a living planet."}, {"time": 1867, "text": "You need a planet which is capable of turning over its surface."}, {"time": 1870, "text": "It needs to be a planet with water."}, {"time": 1872, "text": "It needs to be capable of bringing those electrons from inside to the outside."}, {"time": 1878, "text": "It needs to turn over its surface."}, {"time": 1879, "text": "It needs to make that water work and turn it into hydrogen."}, {"time": 1882, "text": "So I think you need a living planet."}, {"time": 1884, "text": "But once you've got the living planet, I think the rest of it is kind of thermodynamics all the way."}, {"time": 1889, "text": "So if you were to run Earth over a million times up to this point, maybe beyond, to the end, let's run it to the end, what is it?"}, {"time": 1901, "text": "How much variety is there?"}, {"time": 1902, "text": "You kind of spoke to this trajectory that the environment dictates chemically, I don't know in which other way, spiritually, I don't know, like dictates kind of the direction of this giant machine that seems chaotic, but it does seem to have order in the steps it's taking."}, {"time": 1926, "text": "How often will life, how often will bacteria emerge?"}, {"time": 1931, "text": "How often will something like humans emerge?"}, {"time": 1933, "text": "How much variety do you think there would be?"}, {"time": 1935, "text": "I think at the level of bacteria, not much variety."}, {"time": 1939, "text": "I think we would get, that's how many times you say you want to run it, a million times."}, {"time": 1944, "text": "I would say at least a few hundred thousand will get bacteria again."}, {"time": 1948, "text": "Oh, wow, nice."}, {"time": 1949, "text": "Because I think there's some level of inevitability that a wet rocky planet will give rise through the same processes to something very close."}, {"time": 1983, "text": "So it wouldn't surprise me any longer if we found life on Mars and it had a genetic code that was not very different to the genetic code that we have here, without it just being transferred across."}, {"time": 1993, "text": "There's some inevitability about the whole of the beginnings of life, in my view."}, {"time": 1998, "text": "That's really promising, because if the basic chemistry is tightly linked to the genetic code, that means we can interact with other life if it exists out there."}, {"time": 2010, "text": "Well, that's potentially."}, {"time": 2012, "text": "That's really exciting, if that's the case."}, {"time": 2014, "text": "Okay, but then bacteria."}, {"time": 2016, "text": "We've got bacteria."}, {"time": 2019, "text": "How easy is photosynthesis?"}, {"time": 2022, "text": "Much harder, I would say."}, {"time": 2026, "text": "Let's go through the inventions."}, {"time": 2029, "text": "What is photosynthesis?"}, {"time": 2032, "text": "Well, there are different forms."}, {"time": 2035, "text": "I mean, basically, you're taking hydrogen and you're sticking it onto CO2, and it's powered by the sun."}, {"time": 2040, "text": "Question is, where are you taking the hydrogen from?"}, {"time": 2042, "text": "And in photosynthesis that we know in plants, it's coming from water."}, {"time": 2046, "text": "So you're using the power of the sun to split water, take out the hydrogen, stick it onto CO2, and the oxygen is a waste product, and you just throw it out, throw it away."}, {"time": 2055, "text": "So it's the single greatest planetary pollution event in the whole history of the Earth."}, {"time": 2061, "text": "The pollutant being oxygen."}, {"time": 2064, "text": "It also made possible animals."}, {"time": 2066, "text": "You can't have large, active animals without an oxygenated atmosphere, at least not in the sense that we know on Earth."}, {"time": 2073, "text": "So that's a really big invention in the history of Earth."}, {"time": 2075, "text": "Huge invention, yes."}, {"time": 2077, "text": "And it happened once."}, {"time": 2078, "text": "There's a few things that happen once on Earth, and you're always stuck with this problem."}, {"time": 2082, "text": "Once it happened, did it become so good so quickly that it precluded the same thing happening ever again?"}, {"time": 2088, "text": "Or are there other reasons?"}, {"time": 2089, "text": "And we really have to look at each one in turn and think, why did it only happen once?"}, {"time": 2093, "text": "In this case, it's really difficult to split water."}, {"time": 2097, "text": "It requires a lot of power, and that power, you're effectively separating charge across a membrane, and the way in which you do it, if it doesn't all rush back and kind of cause an explosion right at the site, requires really careful wiring."}, {"time": 2110, "text": "And that wiring, it can't be easy to get it right because the plants that we see around us, they have chloroplasts."}, {"time": 2119, "text": "Those chloroplasts were cyanobacteria ones."}, {"time": 2121, "text": "Those cyanobacteria are the only group of bacteria that can do that type of photosynthesis."}, {"time": 2125, "text": "So there's plenty of opportunity."}, {"time": 2128, "text": "So not even many bacteria."}, {"time": 2129, "text": "So who invented photosynthesis?"}, {"time": 2132, "text": "The cyanobacteria, or their ancestors."}, {"time": 2134, "text": "And there's not many?"}, {"time": 2136, "text": "No other bacteria can do what's called oxygenic photosynthesis."}, {"time": 2139, "text": "Lots of other bacteria can split."}, {"time": 2142, "text": "I mean, you can take your hydrogen from somewhere else."}, {"time": 2144, "text": "You can take it from hydrogen sulfide bubbling out of a hydrothermal vent."}, {"time": 2147, "text": "Grab your two hydrogens."}, {"time": 2149, "text": "The sulfur is the waste now."}, {"time": 2152, "text": "You can do it from iron."}, {"time": 2153, "text": "You can take electrons."}, {"time": 2154, "text": "So the early oceans were probably full of iron."}, {"time": 2156, "text": "You can take an electron from ferrous iron, so iron two plus and make it iron three plus, which now precipitates as rust, and you take a proton from the acidic early ocean, stick it there."}, {"time": 2168, "text": "Now you've got a hydrogen atom."}, {"time": 2169, "text": "Stick it onto CO2."}, {"time": 2170, "text": "You've just done the trick."}, {"time": 2172, "text": "The trouble is you bury yourself in rusty iron."}, {"time": 2176, "text": "And with sulfur, you can bury yourself in sulfur."}, {"time": 2178, "text": "One of the reasons oxygenic photosynthesis is so much better is that the waste product is oxygen, which just bubbles away."}, {"time": 2186, "text": "That seems like extremely unlikely, and it's extremely essential for the evolution of complex organisms because of all the oxygen."}, {"time": 2196, "text": "Yeah, and that didn't accumulate quickly either."}, {"time": 2199, "text": "So it's converting, what is it?"}, {"time": 2202, "text": "It's converting energy from the sun and the resource of water into the resource needed for animals."}, {"time": 2210, "text": "Both resources needed for animals."}, {"time": 2212, "text": "We need to eat, and we need to burn the food, and we're eating plants, which are getting their energy from the sun, and we're burning it with their waste product, which is the oxygen."}, {"time": 2222, "text": "So there's a lot of kind of circularity in that, but without an oxygenated planet, you couldn't really have predation."}, {"time": 2232, "text": "You can have animals, but you can't really have animals that go around and eat each other."}, {"time": 2237, "text": "You can't have ecosystems as we know them."}, {"time": 2239, "text": "Well, let's actually step back."}, {"time": 2241, "text": "What about eukaryotic versus prokaryotic cells, prokaryotes?"}, {"time": 2245, "text": "What are each of those, and how big of an invention is that?"}, {"time": 2251, "text": "I personally think that's the single biggest invention in the whole history of life."}, {"time": 2254, "text": "Exciting."}, {"time": 2255, "text": "So what are they?"}, {"time": 2257, "text": "Yeah, so I mentioned bacteria and archaea."}, {"time": 2260, "text": "These are both prokaryotes."}, {"time": 2263, "text": "They're basically small cells that don't have a nucleus."}, {"time": 2265, "text": "If you look at them under a microscope, you don't see much going on."}, {"time": 2268, "text": "If you look at them under a super resolution microscope, then they're fantastically complex."}, {"time": 2273, "text": "In terms of their molecular machinery, they're amazing."}, {"time": 2275, "text": "In terms of their morphological appearance under a microscope, they're really small and really simple."}, {"time": 2283, "text": "The earliest life that we can physically see on the planet are stromatolites, which are made by things like cyanobacteria, and they're large superstructures."}, {"time": 2291, "text": "Effectively, biofilms plated on top of each other, and you end up with quite large structures that you can see in the fossil record."}, {"time": 2299, "text": "But they never came up with animals."}, {"time": 2303, "text": "They never came up with plants."}, {"time": 2304, "text": "They came up with multicellular things, filamentous cyanobacteria, for example."}, {"time": 2308, "text": "They're just long strings of cells."}, {"time": 2311, "text": "But the origin of the eukaryotic cell seems to have been what's called an endosymbiosis, so one cell gets inside another cell."}, {"time": 2319, "text": "And I think that that's transformed the energetic possibilities of life."}, {"time": 2323, "text": "So what we end up with is a kind of supercharged cell, which can have a much larger nucleus with many more genes, all supported."}, {"time": 2334, "text": "If you think about it, you could think about it as multi bacterial power without the overhead."}, {"time": 2338, "text": "So you've got a cell and it's got bacteria living in it, and those bacteria are providing it with the energy currency it needs."}, {"time": 2344, "text": "But each bacterium has a genome of its own, which costs a fair amount of energy to express, to kind of turn over and convert into proteins and so on."}, {"time": 2355, "text": "What the mitochondria did, which are these power packs in our own cells, they were bacteria once, and they threw away virtually all their genes."}, {"time": 2364, "text": "They've only got a few left."}, {"time": 2365, "text": "So mitochondria is, like you said, is the bacteria that got inside a cell and then throw away all this stuff it doesn't need to, survive inside the cell, and then kept what?"}, {"time": 2375, "text": "So what we end up with, so it kept always a handful of genes."}, {"time": 2378, "text": "In our own case, 37 genes."}, {"time": 2381, "text": "But there's a few protists, which are single celled things that have got as many as 70 or 80 genes."}, {"time": 2387, "text": "So it's not always the same, but it's always a small number."}, {"time": 2391, "text": "And you can think of it as a paired down power pack where the control unit has really been, has been kind of paired down to almost nothing."}, {"time": 2398, "text": "So you're putting out the same power, but the investment in the overheads is really paired down."}, {"time": 2404, "text": "That means that you can support a much larger nuclear genome."}, {"time": 2408, "text": "So we've gone up in the number of genes, but also the amount of power you have to convert those genes into proteins."}, {"time": 2414, "text": "We've gone up about fourfold in the number of genes, but in terms of the size of genomes and your ability to make the building blocks, make the proteins, we've gone up 100,000 fold or more."}, {"time": 2425, "text": "So it's huge step change in the possibilities of evolution."}, {"time": 2429, "text": "And it's interesting then that the only two occasions that complex life has arisen on Earth, plants and animals, fungi you could say are complex as well, but they don't form such complex morphology as plants and animals."}, {"time": 2444, "text": "Start with a single cell."}, {"time": 2445, "text": "They start with an oocyte and a sperm fused together to make a zygote."}, {"time": 2450, "text": "So we start development with a single cell and all the cells in the organism have identical DNA."}, {"time": 2456, "text": "And you switch off in the brain, you switch off these genes and you switch on those genes and liver, you switch off those and you switch on a different set."}, {"time": 2464, "text": "And the standard evolutionary explanation for that is that you're restricting conflict."}, {"time": 2468, "text": "You don't have a load of genetically different cells that are all fighting each other."}, {"time": 2473, "text": "And so it works."}, {"time": 2474, "text": "The trouble with bacteria, they form these biofilms and they're all genetically different."}, {"time": 2478, "text": "And effectively they're incapable of that level of cooperation."}, {"time": 2483, "text": "They would get in a fight."}, {"time": 2486, "text": "Okay, so why is this such a difficult invention of getting this bacteria inside and becoming an engine which the mitochondria is?"}, {"time": 2497, "text": "Why do you assign it such great importance?"}, {"time": 2500, "text": "Is it great importance in terms of the difficulty of how it was to achieve or great importance in terms of the impact it had on life?"}, {"time": 2508, "text": "It had a huge impact on life because if that had not happened, you can be certain that life on earth would be bacterial only."}, {"time": 2516, "text": "And that took a really long time too."}, {"time": 2518, "text": "It took 2 billion years."}, {"time": 2519, "text": "And it hasn't happened since to the best of our knowledge."}, {"time": 2522, "text": "So it looks as if it's genuinely difficult."}, {"time": 2525, "text": "And if you think about it then from just an informational perspective, you think bacteria have got, they structure their information differently."}, {"time": 2535, "text": "So a bacterial cell has a small genome, you might have 4,000 genes in it, but a single E. coli cell has access to about 30,000 genes potentially."}, {"time": 2544, "text": "It's got a kind of metagenome where other E. coli out there have got different gene sets and they can switch them around between themselves."}, {"time": 2551, "text": "And so you can generate a huge amount of variation and they've got more, an E. coli metagenome is larger than the human genome."}, {"time": 2560, "text": "We own 20,000 genes or something."}, {"time": 2563, "text": "So, and they've had 4 billion years of evolution to work out what can I do and what can't I do with this metagenome?"}, {"time": 2571, "text": "And the answer is you're stuck, you're still bacteria."}, {"time": 2574, "text": "So they have explored genetic sequence space far more thoroughly than eukaryotes ever did because they've had twice as long at least and they've got much larger populations and they never got around this problem."}, {"time": 2588, "text": "So why can't they?"}, {"time": 2589, "text": "It seems as if you can't solve it with information alone."}, {"time": 2594, "text": "The problem is structure."}, {"time": 2596, "text": "If the very first cells needed an electrical charge on their membrane to grow and in bacteria, it's the outer membrane that surrounds the cell which is electrically charged."}, {"time": 2608, "text": "You try and scale that up and you've got a fundamental design problem, you've got an engineering problem."}, {"time": 2613, "text": "And there are examples of it and what we see in all these cases is what's known as extreme polyploidy, which is to say they have tens of thousands of copies of their complete genome, which is energetically hugely expensive and you end up with a large bacteria with no further development."}, {"time": 2632, "text": "What you need is to incorporate these electrically charged power pack units inside with their control units intact and for them not to conflict so much with the host cell that it all goes wrong."}, {"time": 2645, "text": "Perhaps it goes wrong more often than not."}, {"time": 2647, "text": "And then you change the topology of the cell."}, {"time": 2650, "text": "Now you don't necessarily have any more DNA than a giant bacterium with extreme polyploidy, but what you've got is an asymmetry."}, {"time": 2659, "text": "You now have a giant nuclear genome which surrounded by lots of subsidiary energetic genomes that do all the, they're the control units that are doing all the control of energy generation."}, {"time": 2672, "text": "Could this have been done gradually or does it have to be done, the power pack has to be all intact and ready to go and working?"}, {"time": 2680, "text": "I mean, it's a kind of step change in the possibilities of evolution, but it doesn't happen overnight."}, {"time": 2684, "text": "It's gonna still require multiple, multiple generations."}, {"time": 2687, "text": "So it could take millions of years."}, {"time": 2690, "text": "It could take shorter times."}, {"time": 2692, "text": "There's another thing I would like to put the number of steps and try and work out what's required at each step."}, {"time": 2696, "text": "And we are trying to do that with sex for example."}, {"time": 2698, "text": "You can't have a very large genome unless you have sex at that point."}, {"time": 2702, "text": "So what are the changes to go from bacterial recombination to eukaryotic recombination?"}, {"time": 2707, "text": "What do you need to do?"}, {"time": 2709, "text": "Why do we go from passing around bits of DNA as if it's loose change to fusing cells together, lining up the chromosomes, recombining across the chromosomes, and then going through two rounds of cell division to produce your gametes?"}, {"time": 2722, "text": "All eukaryotes do it that way."}, {"time": 2724, "text": "So again, why switch?"}, {"time": 2727, "text": "What are the drivers here?"}, {"time": 2728, "text": "So there's a lot of time, there's a lot of evolution, but as soon as you've got cells living inside another cell, what you've got is a new design."}, {"time": 2736, "text": "You've got new potential that you didn't have before."}, {"time": 2739, "text": "So the cell living inside another cell, that design allows for better storage of information, better use of energy, more delegation, like a hierarchical control of the whole thing."}, {"time": 2755, "text": "And then somehow that leads to ability to have multi cell organisms."}, {"time": 2760, "text": "I'm not sure that you have hierarchical control necessarily, but you've got a system where you can have a much larger information storage depot in the nucleus."}, {"time": 2769, "text": "You can have a much larger genome."}, {"time": 2800, "text": "But all the genes are there at the beginning."}, {"time": 2802, "text": "That means you've got to have a lot of genes in one cell and you've got to be able to maintain them."}, {"time": 2805, "text": "And the problem with bacteria is they don't get close to having enough genes in one cell."}, {"time": 2809, "text": "So if you were to try and make a multicellular organism from bacteria, you'd bring different types of bacteria together and hope they'll cooperate."}, {"time": 2816, "text": "And the reality is they don't."}, {"time": 2817, "text": "That's really, really tough to do."}, {"time": 2820, "text": "We know they don't because it doesn't exist."}, {"time": 2822, "text": "We have the data as far as we know."}, {"time": 2824, "text": "I'm sure there's a few special ones and they dead off quickly."}, {"time": 2828, "text": "I'd love to know some of the most fun things bacteria have done since."}, {"time": 2832, "text": "Oh, there's a few."}, {"time": 2833, "text": "I mean, they can do some pretty funky things."}, {"time": 2835, "text": "And this is broad brushstroke that I'm talking about."}, {"time": 2839, "text": "Generally speaking."}, {"time": 2841, "text": "So how was, so another fun invention."}, {"time": 2845, "text": "Us humans seem to utilize it well, but you say it's also very important early on is sex."}, {"time": 2851, "text": "So what is sex?"}, {"time": 2856, "text": "And when was it invented and how hard was it to invent, just as you were saying, and why was it invented?"}, {"time": 2862, "text": "Why, how hard was it and when?"}, {"time": 2865, "text": "I have a PhD student who's been working on this and we've just published a couple of papers on sex."}, {"time": 2870, "text": "What do you publish?"}, {"time": 2871, "text": "Does biology, is it biology, genetics, journals?"}, {"time": 2875, "text": "This is actually PNAS, which is Proceedings of the National Academy."}, {"time": 2880, "text": "Broad, big, big picture stuff."}, {"time": 2882, "text": "Everyone's interested in sex."}, {"time": 2884, "text": "And the job of a biologist is to make sex dull."}, {"time": 2887, "text": "Yes, yeah, that's a beautiful way to put it."}, {"time": 2890, "text": "Okay, so when was it invented?"}, {"time": 2893, "text": "It was invented with eukaryotes about two billion years ago."}, {"time": 2896, "text": "All eukaryotes share the same basic mechanism that you produce gametes, the gametes fuse together."}, {"time": 2903, "text": "So a gamete is the egg cell and the sperm."}, {"time": 2906, "text": "They're not necessarily even different in size or shape."}, {"time": 2909, "text": "So the simplest eukaryotes produce what are called motile gametes."}, {"time": 2912, "text": "They're all like sperm and they all swim around."}, {"time": 2914, "text": "They find each other, they fuse together."}, {"time": 2916, "text": "They don't have kind of much going on there beyond that."}, {"time": 2919, "text": "And then these are haploid, which is to say we all have two copies of our genome and the gametes have only a single copy of the genome."}, {"time": 2929, "text": "So when they fuse together, you now become diploid again, which is to say you now have two copies of your genome."}, {"time": 2935, "text": "And what you do is you line them all up and then you double everything."}, {"time": 2941, "text": "So now we have four copies of the complete genome."}, {"time": 2943, "text": "And then we crisscross between all of these things."}, {"time": 2945, "text": "So we take a bit from here and stick it on there and a bit from here and we stick it on here."}, {"time": 2949, "text": "That's recombination."}, {"time": 2951, "text": "And then we go through two rounds of cell division."}, {"time": 2954, "text": "So we divide in half."}, {"time": 2955, "text": "So now the two daughter cells have two copies and we divide in half again."}, {"time": 2959, "text": "Now we have some gametes, each of which has got a single copy of the genome."}, {"time": 2964, "text": "And that's the basic ground plan for what's called meiosis and Syngami."}, {"time": 2969, "text": "That's basically sex."}, {"time": 2971, "text": "And it happens at the level of single celled organisms."}, {"time": 2973, "text": "And it happens pretty much the same way in plants and pretty much the same way in animals and so on."}, {"time": 2978, "text": "And it's not found in any bacteria."}, {"time": 2980, "text": "They switch things around using the same machinery and they take up a bit of DNA from the environment."}, {"time": 2984, "text": "They take out this bit and stick in that bit and it's the same molecular machinery they're using to do it."}, {"time": 2990, "text": "So what about the kind of, you said, find each other, this kind of imperative, find each other."}, {"time": 2997, "text": "Like, is that?"}, {"time": 2998, "text": "Well, you've got a few cells together."}, {"time": 3000, "text": "So the bottom line on all of this is bacteria."}, {"time": 3004, "text": "I mean, it's kind of simple when you've figured it out and figuring it out, this is not me, this is my PhD student, Marco Colnaghi."}, {"time": 3013, "text": "And in effect, if you're doing lateral, you're a Nicoli cell, you've got 4,000 genes."}, {"time": 3019, "text": "You wanna scale up to a eukaryotic size."}, {"time": 3022, "text": "I wanna have 20,000 genes."}, {"time": 3025, "text": "And I need to maintain my genome so it doesn't get shot to pieces by mutations."}, {"time": 3030, "text": "And I'm gonna do it by lateral gene transfer."}, {"time": 3032, "text": "So I know I've got a mutation in a gene."}, {"time": 3035, "text": "I don't know which gene it is because I'm not sentient, but I know I can't grow."}, {"time": 3040, "text": "I know all my regulation systems are saying, something wrong here, something wrong, pick up some DNA, pick up a bit of DNA from the environment."}, {"time": 3047, "text": "If you've got a small genome, the chances of you picking up the right bit of DNA from the environment is much higher than if you've got a genome of 20,000 genes."}, {"time": 3054, "text": "To do that, you've effectively got to be picking up DNA all the time, all day long and nothing else."}, {"time": 3060, "text": "And you're still gonna get the wrong DNA."}, {"time": 3062, "text": "You've got to pick up large chunks."}, {"time": 3063, "text": "And in the end, you've got to align them."}, {"time": 3065, "text": "You're forced into sex, to coin a phrase."}, {"time": 3070, "text": "So you're... You're forced."}, {"time": 3072, "text": "So there is a kind of incentive."}, {"time": 3078, "text": "If you wanna have a large genome, you've got to prevent it mutating to nothing."}, {"time": 3082, "text": "That will happen with bacteria."}, {"time": 3083, "text": "This is another reason why bacteria can't have a large genome."}, {"time": 3086, "text": "But as soon as you give them the power pack, as soon as you give eukaryotic cells the power pack that allows them to increase the size of their genome, then you face the pressure that you've got to maintain its quality."}, {"time": 3096, "text": "You've got to stop it just mutating away."}, {"time": 3098, "text": "What about sexual selection?"}, {"time": 3099, "text": "So the finding, like, I don't like this one."}, {"time": 3104, "text": "I don't like this one."}, {"time": 3105, "text": "This one seems all right."}, {"time": 3107, "text": "Like, what's the... Is it... At which point does it become less random?"}, {"time": 3114, "text": "Because eukaryotes just kind of float around."}, {"time": 3116, "text": "Just kind of have... Yeah, I mean, is there sexual selection in single celled eukaryotes?"}, {"time": 3120, "text": "There probably is."}, {"time": 3121, "text": "It's just that I don't know very much about it."}, {"time": 3122, "text": "By the time we get onto... You don't hang out with the eukaryotes."}, {"time": 3125, "text": "Well, I do all the time, but..."}, {"time": 3127, "text": "But you can't communicate with them yet."}, {"time": 3129, "text": "Yeah, a peacock or something."}, {"time": 3132, "text": "The kind of standard answer, this is not quite what I work on, but the standard answer is that it's female mate choice."}, {"time": 3139, "text": "She is looking for good genes."}, {"time": 3142, "text": "And if you can have a tail that's like this and still survive, still be alive, not actually have been taken down by the nearest predator, then you must've got pretty good genes because despite this handicap, you're able to survive."}, {"time": 3156, "text": "So those are like human interpretable things, like with a peacock."}, {"time": 3159, "text": "But I wonder, I'm sure echoes of the same thing are there with more primitive organisms."}, {"time": 3166, "text": "Basically your PR, like how you advertise yourself that you're worthy of."}, {"time": 3174, "text": "So one big advertisement is the fact that you survived it all."}, {"time": 3178, "text": "Let me give you one beautiful example of an algal bloom."}, {"time": 3183, "text": "And this can be a sign of bacteria."}, {"time": 3185, "text": "It's gonna be in bacteria."}, {"time": 3187, "text": "So if suddenly you pump nitrate or phosphate or something into the ocean and everything goes green, you end up with all this algae growing there."}, {"time": 3198, "text": "A viral infection or something like that can kill the entire bloom overnight."}, {"time": 3203, "text": "And it's not that the virus takes out everything overnight."}, {"time": 3206, "text": "It's that most of the cells in that bloom kill themselves before the virus can get onto them."}, {"time": 3211, "text": "And it's through a form of cell death called programmed cell death."}, {"time": 3215, "text": "And we do the same things."}, {"time": 3216, "text": "It's how we have the gaps between our fingers and so on."}, {"time": 3219, "text": "It's how we craft synapses in the brain."}, {"time": 3223, "text": "It's fundamental again to multicellular life."}, {"time": 3227, "text": "They have the same machinery in these algal blooms."}, {"time": 3231, "text": "How do they know who dies?"}, {"time": 3232, "text": "The answer is they will often put out a toxin."}, {"time": 3236, "text": "And that toxin is kind of a challenge to you."}, {"time": 3240, "text": "Either you can cope with the toxin or you can't."}, {"time": 3243, "text": "If you can cope with it, you form a spore and you will go on to become the next generation."}, {"time": 3249, "text": "You're forming kind of a resistance spore."}, {"time": 3251, "text": "You sink down a little bit, you get out of the way, you're out of the, you can't be attacked by a virus if you're a spore or it's not so easily."}, {"time": 3259, "text": "Whereas if you can't deal with that toxin, you pull the plug and you trigger your death apparatus and you kill yourself."}, {"time": 3267, "text": "Oh, so it's truly life and death selection."}, {"time": 3269, "text": "Yeah, so it's really, it's a challenge."}, {"time": 3271, "text": "And this is a bit like sexual selection."}, {"time": 3273, "text": "It's not so, they're all pretty much genetically identical, but they've had different life histories."}, {"time": 3279, "text": "So have you had a tough day?"}, {"time": 3281, "text": "Did you happen to get infected by this virus?"}, {"time": 3284, "text": "Or did you run out of iron?"}, {"time": 3285, "text": "Or did you get a bit too much sun?"}, {"time": 3287, "text": "Whatever it may be, if this extra stress of the toxin just pushes you over the edge, then you have this binary choice."}, {"time": 3293, "text": "Either you're the next generation or you kill yourself now using this same machinery."}, {"time": 3297, "text": "It's also actually exactly the way I approach dating, but that's probably why I'm single."}, {"time": 3303, "text": "Okay, what about if we can step back, DNA?"}, {"time": 3307, "text": "Just mechanism of storing information."}, {"time": 3310, "text": "RNA, DNA, how big of an invention was that?"}, {"time": 3313, "text": "That seems to be, that seems to be fundamental to like something deep within what life is, is the ability, as you said, to kind of store and propagate information."}, {"time": 3328, "text": "But then you also kind of infer that with your and your students work, that there's a deep connection between the chemistry and the ability to have this kind of genetic information."}, {"time": 3339, "text": "So how big of an invention is it to have a nice representation, nice hard drive for info to pass on?"}, {"time": 3346, "text": "Huge, I suspect."}, {"time": 3347, "text": "I mean, but when I was talking about the code, you see the code in RNA as well."}, {"time": 3352, "text": "And RNA almost certainly came first."}, {"time": 3356, "text": "And there's been an idea going back decades called the RNA world, because RNA in theory can copy itself and can catalyze reactions."}, {"time": 3364, "text": "So it kind of cuts out this chicken and egg loop."}, {"time": 3367, "text": "So DNA as possible is not that special."}, {"time": 3369, "text": "So RNA, RNA is the thing that does the work really."}, {"time": 3373, "text": "And the code lies in RNA."}, {"time": 3375, "text": "The code lies in the interactions between RNA and amino acids."}, {"time": 3378, "text": "And it still is there today in the ribosome, for example, which is just kind of a giant ribozyme, which is to say it's an enzyme that's made of RNA."}, {"time": 3388, "text": "So getting to RNA, I suspect is probably not that hard, but getting from RNA, how do you, you know, there's multiple different types of RNA now."}, {"time": 3399, "text": "How do you distinguish?"}, {"time": 3402, "text": "This is something we're actively thinking about."}, {"time": 3403, "text": "How do you distinguish between, you know, a random population of RNA?"}, {"time": 3407, "text": "Some of them go on to become messenger RNA."}, {"time": 3410, "text": "This is the transcript of the code of the gene that you want to make."}, {"time": 3414, "text": "Some of them become transfer RNA, which is kind of the unit that holds the amino acid that's going to be polymerized."}, {"time": 3421, "text": "Some of them become ribosomal RNA, which is the machine which is joining them all up together."}, {"time": 3427, "text": "How do they discriminate themselves?"}, {"time": 3430, "text": "And, you know, is some kind of phase transition going on there?"}, {"time": 3436, "text": "And we're now in the region of biology where information is coming in."}, {"time": 3439, "text": "But the thing about RNA is very, very good at what it does."}, {"time": 3442, "text": "But the largest genome supported by RNA are RNA viruses like HIV, for example."}, {"time": 3448, "text": "They're pretty small."}, {"time": 3449, "text": "And so there's a limit to how complex life could be unless you come up with DNA, which chemically is a really small change."}, {"time": 3459, "text": "But how easy it is to make that change, I don't really know."}, {"time": 3462, "text": "As soon as you've got DNA, then you've got an amazingly stable molecule for information storage."}, {"time": 3468, "text": "And you can do absolutely anything."}, {"time": 3470, "text": "But how likely that transition from RNA to DNA was, I don't know either."}, {"time": 3474, "text": "How much possibility is there for variety in ways to store information?"}, {"time": 3480, "text": "Because it seems to be very, there's specific characteristics about the programming language of DNA."}, {"time": 3486, "text": "Yeah, there's a lot of work going on on what's called the xenodNA or RNA."}, {"time": 3491, "text": "Can we replace the bases themselves, the letters, if you like, in RNA or DNA?"}, {"time": 3498, "text": "Can we replace the backbone?"}, {"time": 3499, "text": "Can we replace, for example, phosphate with arsenate?"}, {"time": 3503, "text": "Can we replace the sugar ribose or deoxyribose with a different sugar?"}, {"time": 3506, "text": "And the answer is yes, you can."}, {"time": 3509, "text": "Within limits, there's not an infinite space there."}, {"time": 3514, "text": "Arsenate doesn't really work if the bonds are not as strong as phosphate."}, {"time": 3518, "text": "It's probably quite hard to replace phosphate."}, {"time": 3522, "text": "It's possible to do it."}, {"time": 3523, "text": "The question to me is why is it this way?"}, {"time": 3527, "text": "Is it because there was some form of selection that this is better than the other forms and there were lots of competing forms of information storage early on and this one was the one that worked out?"}, {"time": 3536, "text": "Or was it kind of channeled that way, that these are the molecules that you're dealing with and they work?"}, {"time": 3543, "text": "And I'm increasingly thinking it's that way, that we're channeled towards ribose, phosphate, and the bases that are used."}, {"time": 3551, "text": "But there are 200 different letters kicking around out there that could have been used."}, {"time": 3558, "text": "If you look in the programming world in computer science, there's a programming language called JavaScript, which was written super quickly."}, {"time": 3566, "text": "It's a giant mess, but it took over the world."}, {"time": 3569, "text": "And it was kind of a..."}, {"time": 3570, "text": "Sounds very biological."}, {"time": 3571, "text": "It was kind of a running joke that like, like surely this can't be, this is a terrible programming language."}, {"time": 3580, "text": "It's full of bugs."}, {"time": 3581, "text": "It's so easy to write really crappy code, but it took over all a front end development in the web browser."}, {"time": 3589, "text": "If you have any kind of dynamic interactive website, it's usually running JavaScript."}, {"time": 3594, "text": "And it's now taking over much of the backend, which is like the serious heavy duty computational stuff."}, {"time": 3600, "text": "And it's become super fast with the different compilation engines that are running it."}, {"time": 3606, "text": "So it's like, it really took over the world."}, {"time": 3608, "text": "It's very possible that this initially crappy derided language actually takes everything over."}, {"time": 3614, "text": "And then the question is, did human civilization always strive towards JavaScript?"}, {"time": 3621, "text": "Or was JavaScript just the first programming language that ran on the browser and still sticky?"}, {"time": 3627, "text": "The first is the sticky one."}, {"time": 3629, "text": "And so it wins over anything else because it was first."}, {"time": 3632, "text": "And I don't think that's answerable, right?"}, {"time": 3634, "text": "But it's good to ask that."}, {"time": 3637, "text": "I suppose in the lab, you can't run it with programming languages, but in biology you can probably do some kind of small scale evolutionary test to try to infer, which is which."}, {"time": 3655, "text": "I mean, in a way we've got the hardware and the software here."}, {"time": 3658, "text": "And the hardware is maybe the DNA and the RNA itself."}, {"time": 3662, "text": "And then the software perhaps is more about the code."}, {"time": 3666, "text": "Did the code have to be this way?"}, {"time": 3667, "text": "Could it have been a different way?"}, {"time": 3669, "text": "People talk about the optimization of the code and there's some suggestion for that."}, {"time": 3674, "text": "I think it's weak actually."}, {"time": 3676, "text": "But you could imagine you could come out with a million different codes and this would be one of the best ones."}, {"time": 3682, "text": "Well, we don't know this."}, {"time": 3684, "text": "Well, I mean, people have tried to model it based on the effect that mutations would have."}, {"time": 3691, "text": "So no, you're right."}, {"time": 3692, "text": "We don't know because that's a single assumption that a mutation is what's being selected on there."}, {"time": 3697, "text": "And there's other possibilities too."}, {"time": 3699, "text": "I mean, there does seem to be a resilience and a redundancy to the whole thing."}, {"time": 3703, "text": "It's hard to mess up and the way you mess it up often is likely to produce interesting results."}, {"time": 3711, "text": "So it's... Are you talking about JavaScript or the genetic code now?"}, {"time": 3715, "text": "Yeah, well, I mean, it's almost, biology is underpinned by this kind of mess as well."}, {"time": 3720, "text": "And you look at the human genome and it's full of stuff that is really either broken or dysfunctional or was a virus once, whatever it may be."}, {"time": 3728, "text": "And somehow it works."}, {"time": 3729, "text": "And maybe we need a lot of this mess."}, {"time": 3731, "text": "We know that some functional genes are taken from this mess."}, {"time": 3735, "text": "So what about, you mentioned the predatory behavior."}, {"time": 3740, "text": "We talked about sex."}, {"time": 3741, "text": "What about violence, predator and prey dynamics?"}, {"time": 3746, "text": "When was that invented?"}, {"time": 3749, "text": "And poetic and biological ways of putting it, how do you describe predator prey relationship?"}, {"time": 3757, "text": "Is it a beautiful dance or is it a violent atrocity?"}, {"time": 3763, "text": "Well, I guess it's both, isn't it?"}, {"time": 3764, "text": "I mean, when does it start?"}, {"time": 3765, "text": "It starts in bacteria."}, {"time": 3766, "text": "You see these amazing predators."}, {"time": 3769, "text": "Della Vibrio is one that Lynn Margulis used to talk about a lot."}, {"time": 3773, "text": "It's got a kind of a drill piece that drills through the wall and the membrane of the bacterium."}, {"time": 3778, "text": "And then it effectively eats the bacterium from just inside the periplasmic space and makes copies of itself that way."}, {"time": 3784, "text": "So that's straight predation."}, {"time": 3786, "text": "There are predators among bacteria."}, {"time": 3788, "text": "So predation in that, sorry to interrupt, means you murder somebody and use their body as a resource in some way."}, {"time": 3798, "text": "But it's not parasitic in that you need them to be still alive."}, {"time": 3803, "text": "No, no, I mean, predation is you kill them, really."}, {"time": 3806, "text": "You murder."}, {"time": 3807, "text": "Parasites, so you kind of live on them."}, {"time": 3810, "text": "Okay, so, but it seems the predator is the really popular."}, {"time": 3814, "text": "So what we see if we go back 560, 570 million years before the Cambrian explosion, there is what's known as the Ediacaran fauna, or sometimes they call Vendobionts, which is a lovely name."}, {"time": 3831, "text": "And it's not obvious that they're animals at all."}, {"time": 3835, "text": "They're stalked things."}, {"time": 3836, "text": "They often have fronds that look a lot like leaves with kind of fractal branching patterns on them."}, {"time": 3841, "text": "And the thing is, they're found, sometimes geologists can figure out the environment that they were in and say, this is more than 200 meters deep because there's no sign of any waves."}, {"time": 3854, "text": "There's no storm damage down here, this kind of thing."}, {"time": 3858, "text": "They were more than 200 meters deep, so they're definitely not photosynthetic."}, {"time": 3861, "text": "These are animals and they're filter feeders."}, {"time": 3865, "text": "And we know sponges and corals and things are filter feeding animals."}, {"time": 3869, "text": "They're stuck to the spot."}, {"time": 3870, "text": "And little bits of carbon that come their way, they filter it out and that's what they're eating."}, {"time": 3876, "text": "So no predation involved in this, beyond stuff just dies anyway."}, {"time": 3880, "text": "And it feels like a very gentle, rather beautiful, rather limited world, you might say."}, {"time": 3885, "text": "There's not a lot going on there."}, {"time": 3888, "text": "And something changes."}, {"time": 3891, "text": "Oxygen definitely changes during this period."}, {"time": 3893, "text": "Other things may have changed as well."}, {"time": 3895, "text": "But the next thing you really see in the fossil record is the Cambrian explosion."}, {"time": 3900, "text": "And what do we see there?"}, {"time": 3902, "text": "We're now seeing animals that we would recognize."}, {"time": 3904, "text": "They've got eyes, they've got claws, they've got shells."}, {"time": 3907, "text": "They're plainly killing things or running away and hiding."}, {"time": 3914, "text": "And so we've gone from a rather gentle but limited world to a rather vicious, unpleasant world that we recognize and which leads to kind of arms races, evolutionary arms races, which again is something that when we think about a nuclear arms race, we think, Jesus, we don't want to go there."}, {"time": 3934, "text": "It's not done anybody any good."}, {"time": 3937, "text": "In some ways, maybe it does do good."}, {"time": 3940, "text": "I don't want to make an argument for nuclear arms."}, {"time": 3942, "text": "But predation as a mechanism forces organisms to adapt to change to be better to escape or to kill."}, {"time": 3952, "text": "If you need to eat, then you've got to eat."}, {"time": 3955, "text": "And a cheetah's not going to run at that speed unless it has to because the zebra is capable of escaping."}, {"time": 3963, "text": "So it leads to much greater feats of evolution than would ever have been possible without it."}, {"time": 3969, "text": "And in the end, to a much more beautiful world."}, {"time": 3972, "text": "And so it's not all bad by any means."}, {"time": 3977, "text": "But the thing is you can't have this if you don't have an oxygenated planet."}, {"time": 3981, "text": "Because it's all in the end, it's about how much energy can you extract from the food you eat."}, {"time": 3986, "text": "And if you don't have an oxygenated planet, you can get about 10% out, not much more than that."}, {"time": 3992, "text": "And if you've got an oxygenated planet, you can get about 40% out."}, {"time": 3995, "text": "And that means you can have, instead of having one or two trophic levels, you can have five or six trophic levels."}, {"time": 4002, "text": "And that means things can eat things that eat other things and so on."}, {"time": 4005, "text": "And you've gone to a level of ecological complexity, which is completely impossible in the absence of oxygen."}, {"time": 4011, "text": "This reminds me of the Hunter S. Thompson quote, that for every moment of triumph, for every instance of beauty, many souls must be trampled."}, {"time": 4022, "text": "The history of life on Earth, unfortunately, is that of violence."}, {"time": 4029, "text": "Just the trillions and trillions of multi cell organisms that were murdered in the struggle for survival."}, {"time": 4037, "text": "It's a sorry statement, but yes, it's basically true."}, {"time": 4040, "text": "And that somehow is a catalyst from an evolutionary perspective for creativity, for creating more and more complex organisms that are better and better at surviving."}, {"time": 4050, "text": "I mean, survival of the fittest, if you just go back to that old phrase, means death of the weakest."}, {"time": 4056, "text": "Now, what's fit, what's weak, these are terms that don't have much intrinsic meaning."}, {"time": 4061, "text": "But the thing is, evolution only happens because of death."}, {"time": 4065, "text": "One way to die is the constraints, the scarcity of the resources in the environment, but that seems to be not nearly as good of a mechanism for death than other creatures roaming about in the environment."}, {"time": 4081, "text": "When I say environment, I mean like the static environment, but then there's the dynamic environment of bigger things trying to eat you and use you for your energy."}, {"time": 4090, "text": "It forces you to come up with a solution to your specific problem that is inventive and is new and hasn't been done before."}, {"time": 4098, "text": "And so it forces, I mean, literally change, literally evolution on populations."}, {"time": 4106, "text": "They have to become different."}, {"time": 4107, "text": "And it's interesting that humans have channeled that into more, I mean, I guess what humans are doing is they're inventing more productive and safe ways of doing that."}, {"time": 4119, "text": "You know, this whole idea of morality and all those kinds of things, I think they ultimately lead to competition versus violence, because I think violence can have a cold, brutal, inefficient aspect to it."}, {"time": 4136, "text": "But if you channel that into more controlled competition in the space of ideas, in the space of approaches to life, maybe you can be even more productive than evolution is."}, {"time": 4150, "text": "Because evolution is very wasteful."}, {"time": 4152, "text": "Like the amount of murder required to really test a good idea, genetically speaking, is just a lot."}, {"time": 4159, "text": "Many, many, many generations."}, {"time": 4161, "text": "Morally, we cannot base society on the way that evolution works."}, {"time": 4166, "text": "That's an invention, right?"}, {"time": 4167, "text": "But actually, in some respects we do, which is to say, this is how science works."}, {"time": 4171, "text": "We have competing hypotheses that have to get better, otherwise they die."}, {"time": 4175, "text": "It's the way that society works."}, {"time": 4176, "text": "You know, in ancient Greece, we had the Athens and Sparta and city states, and then we had the Renaissance and nation states, and universities compete with each other."}, {"time": 4188, "text": "Tremendous amount of companies competing with each other all the time."}, {"time": 4191, "text": "It drives innovation."}, {"time": 4195, "text": "And if we want to do it without all the death that we see in nature, then we have to have some kind of societal level control that says, well, there's some limits, guys, and these are what the limits are gonna be."}, {"time": 4207, "text": "And society as a whole has to say, right, we want to limit the amount of death here, so you can't do this and you can't do that."}, {"time": 4212, "text": "And you know, who makes up these rules, and how do we know?"}, {"time": 4215, "text": "It's a tough thing, but it's basically trying to find a moral basis for avoiding the death of evolution and natural selection and keeping the innovation and the richness of it."}, {"time": 4227, "text": "And I forgot who said it, but that murder is illegal."}, {"time": 4231, "text": "Probably Kurt Vonnegut."}, {"time": 4233, "text": "Murder is illegal except when it's done to the sound of trumpets and at a large scale."}, {"time": 4238, "text": "So we still have wars."}, {"time": 4241, "text": "But we are struggling with this idea that murder is a bad thing."}, {"time": 4247, "text": "It's so interesting how we're channeling the best of the evolutionary imperative and trying to get rid of the stuff that's not productive."}, {"time": 4258, "text": "Trying to almost accelerate evolution."}, {"time": 4260, "text": "The same kind of thing that makes evolution creative."}, {"time": 4265, "text": "We're trying to use that."}, {"time": 4267, "text": "I think we naturally do it."}, {"time": 4268, "text": "I mean, I don't think we can help ourselves do it."}, {"time": 4270, "text": "And you know, capitalism as a form is basically about competition and differential rewards."}, {"time": 4277, "text": "But we, society, and you know, we have a, I keep using this word moral obligation, but you know, we cannot operate as a society if we go that way."}, {"time": 4289, "text": "It's interesting that we've had problems achieving balance."}, {"time": 4295, "text": "So for example, in the financial crash in 2009, do you let banks go to the wall or not?"}, {"time": 4301, "text": "This kind of question."}, {"time": 4302, "text": "In evolution, certainly you let them go to the wall."}, {"time": 4305, "text": "And in that sense, you don't need the regulation because they just die."}, {"time": 4311, "text": "Whereas if we, as a society, think about what's required for society as a whole, then you don't necessarily let them go to the wall."}, {"time": 4319, "text": "In which case you then have to impose some kind of regulation that the bankers themselves will, in an evolutionary manner, exploit."}, {"time": 4328, "text": "Yeah, we've been struggling with this kind of idea of capitalism, the cold brutality of capitalism that seems to create so much beautiful things in this world."}, {"time": 4340, "text": "And then the ideals of communism that seem to create so much brutal destruction in history."}, {"time": 4346, "text": "We struggle with ideas of, well, maybe we didn't do it right."}, {"time": 4350, "text": "How can we do things better?"}, {"time": 4351, "text": "And then the ideas are the things where we're playing with as opposed to people."}, {"time": 4355, "text": "If a PhD student has a bad idea, we don't shoot the PhD student."}, {"time": 4359, "text": "We just criticize their idea and hope they improve."}, {"time": 4362, "text": "You have a very humane lab."}, {"time": 4364, "text": "Yeah, I don't know how you guys do it."}, {"time": 4366, "text": "The way I run things, it's always life and death."}, {"time": 4369, "text": "Okay, so it is interesting about humans that there is an inner sense of morality which begs the question of how did homo sapiens evolve?"}, {"time": 4382, "text": "If we think about the invention of, early invention of sex and early invention of predation, what was the thing invented to make humans?"}, {"time": 4397, "text": "I mean, I suppose a couple of things I'd say."}, {"time": 4399, "text": "Number one is you don't have to wind the clock back very far, five, six million years or so, and let it run forwards again."}, {"time": 4406, "text": "And the chances of humans as we know them is not necessarily that high."}, {"time": 4411, "text": "You know, imagine as an alien, you find planet Earth and it's got everything apart from humans on it."}, {"time": 4416, "text": "It's an amazing, wonderful, marvelous planet, but nothing that we would recognize as extremely intelligent life, kind of space faring civilization."}, {"time": 4425, "text": "So when we think about aliens, we're kind of after something like ourselves."}, {"time": 4429, "text": "We're after a space faring civilization."}, {"time": 4431, "text": "We're not after zebras and giraffes and lions and things, amazing though they are."}, {"time": 4437, "text": "But the additional kind of evolutionary steps to go from large, complex mammals, monkeys, let's say, to humans doesn't strike me as that long a distance."}, {"time": 4452, "text": "It's all about the brain."}, {"time": 4454, "text": "And where's the brain and morality coming from?"}, {"time": 4457, "text": "It seems to me to be all about groups, human groups and interactions between groups."}, {"time": 4462, "text": "The collective intelligence of it."}, {"time": 4464, "text": "Yes, the interactions really."}, {"time": 4466, "text": "And there's a guy at UCL called Mark Thomas, who's done a lot of really beautiful work, I think, on this kind of question."}, {"time": 4473, "text": "So I talk to him every now and then, so my views are influenced by him."}, {"time": 4478, "text": "But a lot seems to depend on population density, that the more interactions you have going on between different groups, the more transfer of information, if you like, between groups, people moving from one group to another group, almost like lateral gene transfer in bacteria, the more expertise you're able to develop and maintain, the more culturally complex your society can become."}, {"time": 4504, "text": "And groups that have become detached, like on Easter Island, for example, very often degenerate in terms of the complexity of their civilization."}, {"time": 4513, "text": "Is that true for complex organisms in general?"}, {"time": 4516, "text": "Population density is often productive."}, {"time": 4519, "text": "Really matters, but in human terms, I don't know what the actual factors were that were driving a large brain, but you can talk about fire, you can talk about tool use, you can talk about language, and none of them seem to correlate especially well with the actual known trajectory of human evolution in terms of cave art and these kind of things."}, {"time": 4542, "text": "That seems to work much better just with population density and number of interactions between different groups, all of which is really about human interactions, human human interactions and the complexity of those."}, {"time": 4558, "text": "But population density is the thing that increases the number of interactions, but then there must have been inventions forced by that number of interactions that actually led to humans."}, {"time": 4574, "text": "So like Richard Wrangham talks about that it's basically the beta males had to beat up the alpha male."}, {"time": 4582, "text": "So that's what collaboration looks like, is they, when you're living together, our early ancestors don't like the dictatorial aspect of a single individual at the top of a tribe."}, {"time": 4596, "text": "So they learned to collaborate how to basically create a democracy of sorts, a democracy that prevents, minimizes, or lessens the amount of violence, which essentially gives strength to the tribe and make the war between tribes versus the dictator."}, {"time": 4615, "text": "I mean, I think one of the most wonderful things about humans is we're all of those things."}, {"time": 4620, "text": "I mean, we are deeply social as a species and we're also deeply selfish."}, {"time": 4625, "text": "And it seems to me the conflict between capitalism and communism, it's really just two aspects of human nature, both of which are."}, {"time": 4631, "text": "We have both and we have a constant kind of vying between the two sides."}, {"time": 4636, "text": "We really do care about other people beyond our families, beyond our immediate people."}, {"time": 4641, "text": "We care about society and the society that we live in."}, {"time": 4644, "text": "And you could say that's a drawing towards socialism or communism."}, {"time": 4648, "text": "On the other side, we really do care about ourselves."}, {"time": 4650, "text": "We really do care about our families, about working for something that we gain from."}, {"time": 4654, "text": "And that's the capitalist side of it."}, {"time": 4655, "text": "They're both really deeply ingrained in human nature."}, {"time": 4658, "text": "In terms of violence and interactions between groups, yes, all this dynamic of, if you're interacting between groups, you can be certain that they're gonna be burning each other and all kinds of physical violent interactions as well, which will drive the kind of cleverness of how do you resist this?"}, {"time": 4677, "text": "Let's build a tower."}, {"time": 4679, "text": "What are we gonna do to prevent being overrun by those marauding gangs from over there?"}, {"time": 4686, "text": "And you look outside humans and you look at chimps and bonobos and so on, and they're very, very different structures to society."}, {"time": 4693, "text": "Chimps tend to have an aggressive alpha male type structure and bonobos, there's basically a female society where the males are predominantly excluded and only brought in at the behest of the female."}, {"time": 4705, "text": "We have a lot in common with both of those groups."}, {"time": 4709, "text": "And there's, again, tension there."}, {"time": 4711, "text": "And probably chimps, more violence, the bonobos, probably more sex."}, {"time": 4715, "text": "That's another tension."}, {"time": 4716, "text": "How serious do we wanna be?"}, {"time": 4722, "text": "How much fun we wanna be?"}, {"time": 4724, "text": "Asking for a friend again, what do you think happened to Neanderthals?"}, {"time": 4727, "text": "What did we cheeky humans do to the Neanderthals, Homo sapiens?"}, {"time": 4733, "text": "Do you think we murdered them?"}, {"time": 4734, "text": "Was it, how do we murder them?"}, {"time": 4736, "text": "How do we outcompete them?"}, {"time": 4739, "text": "Or do we mate them?"}, {"time": 4742, "text": "I mean, I think there's unequivocal evidence that we mated with them."}, {"time": 4745, "text": "We always try to mate with everything."}, {"time": 4747, "text": "Yes, pretty much."}, {"time": 4749, "text": "There's some interesting, the first sequences that came along were in mitochondrial DNA."}, {"time": 4754, "text": "And that was back to about 2002 or thereabouts."}, {"time": 4758, "text": "What was found was that Neanderthal mitochondrial DNA was very different to human mitochondria."}, {"time": 4763, "text": "Oh, that's so interesting."}, {"time": 4764, "text": "You could do a clock on it and it said the divergent state was about 600,000 years ago or something like that."}, {"time": 4769, "text": "So not so long ago."}, {"time": 4771, "text": "And then the first full genomes were sequenced maybe 10 years after that."}, {"time": 4776, "text": "And they showed plenty of signs of mating between."}, {"time": 4779, "text": "So the mitochondrial DNA effectively says no mating."}, {"time": 4783, "text": "And the nuclear genes say, yeah, lots of mating."}, {"time": 4787, "text": "But we don't know."}, {"time": 4789, "text": "So can you explain the difference between mitochondrial DNA and nucleus?"}, {"time": 4793, "text": "I've talked before about the mitochondria, which are the power packs in cells."}, {"time": 4797, "text": "These are the paired down control units is their DNA."}, {"time": 4801, "text": "So it's passed on by the mother only."}, {"time": 4805, "text": "And in the egg cell, we might have half a million copies of mitochondrial DNA."}, {"time": 4810, "text": "There's only 37 genes left and they do a, it's basically the control unit of energy production."}, {"time": 4817, "text": "That's what it's doing."}, {"time": 4818, "text": "It's a basic old school machine that does."}, {"time": 4821, "text": "And it's got genes that were considered to be effectively trivial because they did a very narrowly defined job, but they're not trivial in the sense that that narrowly defined job is about everything that is being alive."}, {"time": 4835, "text": "So they're much easier to sequence."}, {"time": 4838, "text": "You've got many more copies of these things and you can sequence them very quickly."}, {"time": 4842, "text": "But the problem is because they go down only the maternal line from mother to daughter, your mitochondrial DNA and mine is going nowhere."}, {"time": 4850, "text": "Any kids we have, they get their mother's mitochondrial DNA except in very, very rare and strange circumstances."}, {"time": 4859, "text": "And so it tells a different story and it's not a story which is easy to reconcile always."}, {"time": 4866, "text": "And what it seems to suggest to my mind at least is that there was one way traffic of genes probably going from humans into Neanderthals rather than the other way around."}, {"time": 4878, "text": "Why did the Neanderthals disappear?"}, {"time": 4880, "text": "I mean, I suspect that they were, I suspect they were probably less violent, less clever, less populous, less willing to fight."}, {"time": 4892, "text": "I mean, I think it probably drove them to extinction at the margins of Europe."}, {"time": 4897, "text": "And it's interesting how much, if we ran Earth over and over again, how many of these branches of intelligent beings that have figured out some kind of how to leverage collective intelligence, which ones of them emerge?"}, {"time": 4913, "text": "Which ones of them succeed?"}, {"time": 4915, "text": "Is it the more violent ones?"}, {"time": 4917, "text": "Is it the more isolated ones?"}, {"time": 4921, "text": "Like what dynamics result in more productivity?"}, {"time": 4923, "text": "And I suppose we'll never know."}, {"time": 4926, "text": "The more complex the organism, the harder it is to run the experiment in the lab."}, {"time": 4932, "text": "And in some respects, maybe it's best if we don't know."}, {"time": 4936, "text": "The truth might be very painful."}, {"time": 4938, "text": "What about if we actually step back a couple of interesting things that we humans do?"}, {"time": 4944, "text": "One is object manipulation and movement."}, {"time": 4948, "text": "And of course, movement was something that was done, that was another big invention, being able to move around the environment."}, {"time": 4956, "text": "And the other one is this sensory mechanism, how we sense the environment."}, {"time": 4961, "text": "One of the coolest high definition ones is vision."}, {"time": 4965, "text": "How big are those inventions in the history of life on Earth?"}, {"time": 4970, "text": "Vision, movement, I mean, again, extremely important, going back to the origin of animals, the Cambrian explosion where suddenly you're seeing eyes in the fossil record."}, {"time": 4981, "text": "And you can, it's not necessarily, again, lots of people historically have said what use is half an eye?"}, {"time": 4986, "text": "And you can go in a series of steps from a light sensitive spot on a flat piece of tissue to an eyeball with a lens and so on."}, {"time": 5000, "text": "If you assume no more than, I don't remember, this was a specific model that I have in mind, but it was 1% change or half a percent change for each generation."}, {"time": 5009, "text": "How long would it take to evolve an eye as we know it?"}, {"time": 5011, "text": "And the answer is half a million years."}, {"time": 5014, "text": "It doesn't have to take long."}, {"time": 5015, "text": "That's not how evolution works."}, {"time": 5016, "text": "That's not an answer to the question."}, {"time": 5018, "text": "It just shows you can reconstruct the steps and you can work out roughly how it can work."}, {"time": 5024, "text": "So it's not that big a deal to evolve an eye, but once you have one, then there's nowhere to hide."}, {"time": 5031, "text": "And again, we're back to predator prey relationships."}, {"time": 5035, "text": "We're back to all the benefits that being able to see brings you."}, {"time": 5038, "text": "And if you think philosophically what bats are doing with eco location and so on, I have no idea, but I suspect that they form an image of the world in pretty much the same way that we do."}, {"time": 5047, "text": "It's just a matter of mental reconstruction."}, {"time": 5050, "text": "So I suppose the other thing about sight, there are single celled organisms that have got a lens and a retina and a cornea and so on."}, {"time": 5061, "text": "Basically they've got a camera type eye in a single cell."}, {"time": 5064, "text": "They don't have a brain."}, {"time": 5067, "text": "What they understand about their world is impossible to say, but they're capable of coming up with the same structures to do so."}, {"time": 5074, "text": "So I suppose then is that once you've got things like eyes, then you have a big driving pressure on the central nervous system to figure out what it all means."}, {"time": 5084, "text": "And then we come around to your other point about manipulation, sensory input, and so on about now you have a huge requirement to understand what your environment is and what it means and how it reacts and how you should run away and where you should stay put."}, {"time": 5099, "text": "Actually on that point, let me, I don't know if you know the work of Donald Hoffman, who uses the argument, the mechanism of evolution to say that there's not necessarily a strong evolutionary value to seeing the world as it is."}, {"time": 5123, "text": "So objective reality, that our perception actually is very different from what's objectively real."}, {"time": 5129, "text": "We're living inside an illusion and we're basically the entire set of species on earth, I think, I guess, are competing in a space that's an illusion that's distinct from, that's far away from physical reality as it is, as defined by physics."}, {"time": 5146, "text": "I'm not sure it's an illusion so much as a bubble."}, {"time": 5148, "text": "I mean, we have a sensory input, which is a fraction of what we could have a sensory input on, and we interpret it in terms of what's useful for us to know to stay alive."}, {"time": 5158, "text": "So yes, it's an illusion in that sense, but the tree is physically there."}, {"time": 5163, "text": "And if you walk into that tree, you know, that there is, it's not purely a delusion, there's some physical reality to it."}, {"time": 5170, "text": "So it's a sensory slice into reality as it is, but because it's just a slice, you're missing a big picture."}, {"time": 5178, "text": "But he says that that slice doesn't necessarily need to be a slice."}, {"time": 5183, "text": "It could be a complete fabrication that's just consistent amongst the species, which is an interesting, or at least it's a humbling realization that our perception is limited and our cognitive abilities are limited."}, {"time": 5200, "text": "And at least to me, it's argument from evolution, I don't know how much, how strong that is as an argument, but I do think that life can exist in the mind."}, {"time": 5214, "text": "In the same way that you can do a virtual reality video game and you can have a vibrant life inside that place and that place is not real in some sense, but you could still have a vibrant, all the same forces of evolution, all the same competition, the dynamics of between humans you can have, but I don't know if, I don't know if there's evidence for that being the thing that happened on earth."}, {"time": 5243, "text": "It seems that earth."}, {"time": 5245, "text": "I think in either environment, I wouldn't deny that you could have exactly the world that you talk about and it would be very difficult to, the idea in matrix movies and so on that the whole world is completely a construction and we're fundamentally deluded."}, {"time": 5263, "text": "It's difficult to say that's impossible or couldn't happen or, and certainly we construct in our minds what the outside world is, but we do it on input and that input, I would hesitate to say it's not real because it's precisely how we do understand the world."}, {"time": 5280, "text": "We have eyes, but if you keep someone in, apparently this kind of thing happens, someone kept in a dark room for five years or something like that, they never see properly again because the neural wiring that underpins how we interpret vision never developed."}, {"time": 5298, "text": "You need, when you watch a child develop, it walks into a table, it bangs his head on the table and it hurts and now you've got two inputs."}, {"time": 5308, "text": "You've got one pain from this sharp edge and number two, you probably, you've touched it and realized it's there, it's a sharp edge and you've got the visual input and you put the three things together and think, I don't wanna walk into a table again."}, {"time": 5318, "text": "So you're learning and it's a limited reality, but it's a true reality and if you don't learn that properly, then you will get eaten, you will get hit by a bus, you will not survive."}, {"time": 5328, "text": "And same, if you're in some kind of, let's say, computer construction of reality, I'm not in my ground here, but if you construct the laws that this is what reality is inside this, then you play by those laws."}, {"time": 5345, "text": "Yeah, I mean, as long as the laws are consistent."}, {"time": 5347, "text": "So just like you said in the lab, the interesting thing about the simulation question, yes, it's hard to know if we're living inside a simulation, but also, yes, it's possible to do these kinds of experiments in the lab now more and more."}, {"time": 5361, "text": "To me, the interesting question is, how realistic does a virtual reality game need to be for us to not be able to tell the difference?"}, {"time": 5370, "text": "A more interesting question to me is, how realistic or interesting does a virtual reality world need to be in order for us to want to stay there forever or much longer than physical reality, prefer that place?"}, {"time": 5387, "text": "And also prefer it not as we prefer hard drugs, but prefer it in a deep, meaningful way in the way we enjoy life."}, {"time": 5397, "text": "I mean, I suppose the issue with the matrix, I imagine that it's possible to dilute the mind sufficiently that you genuinely, in that way, do think that you are interacting with the real world when in fact the whole thing's a simulation."}, {"time": 5414, "text": "How good does a simulation need to be to be able to do that?"}, {"time": 5417, "text": "Well, it needs to convince you that all your sensory input is correct and accurate and joins up and makes sense."}, {"time": 5426, "text": "Now, that sensory input is not something that we're born with."}, {"time": 5429, "text": "We're born with a sense of touch."}, {"time": 5431, "text": "We're born with eyes and so on, but we don't know how to use them."}, {"time": 5434, "text": "We don't know what to make of them."}, {"time": 5435, "text": "We go around, we bump into trees."}, {"time": 5437, "text": "We cry a lot."}, {"time": 5438, "text": "We're in pain a lot."}, {"time": 5439, "text": "We're basically booting up the system so that it can make head or tail of the sensory input that it's getting."}, {"time": 5447, "text": "And that sensory input's not just a one way flux of things."}, {"time": 5449, "text": "It's also, you have to walk into things."}, {"time": 5451, "text": "You have to hear things."}, {"time": 5452, "text": "You have to put it together."}, {"time": 5453, "text": "Now, if you've got just babies in the matrix who are slotted into this, I don't think they have that kind of sensory input."}, {"time": 5462, "text": "I don't think they would have any way to make sense of New York as a world that they're part of."}, {"time": 5468, "text": "The brain is just not developed in that way."}, {"time": 5470, "text": "Well, I can't make sense of New York in this physical reality either."}, {"time": 5473, "text": "But yeah, I mean, but you said pain and the walking into things."}, {"time": 5477, "text": "Well, you can create a pain signal."}, {"time": 5479, "text": "And as long as it's consistent, that certain things result in pain, you can start to construct a reality."}, {"time": 5485, "text": "There's some, maybe you disagree with this, but I think we are born almost with a desire to be convinced by our reality, like a desire to make sense of our reality."}, {"time": 5498, "text": "Oh, I'm sure we are, yes."}, {"time": 5500, "text": "So there's an imperative."}, {"time": 5501, "text": "So whatever that reality is given to us, like the table hurts, fire is hot."}, {"time": 5506, "text": "I think we wanna be diluted in the sense that we want to make a simple, like Einstein's simple theory of the thing around us."}, {"time": 5516, "text": "We want that simplicity."}, {"time": 5518, "text": "And so maybe the hunger for the simplicity is the thing that could be used to construct a pretty dumb simulation that tricks us."}, {"time": 5527, "text": "So maybe tricking humans doesn't require building a universe."}, {"time": 5532, "text": "I mean, this is not what I work on, so I don't know how close to it we are."}, {"time": 5535, "text": "I don't think anyone works on it."}, {"time": 5536, "text": "But I agree with you that, yeah, I'm not sure that it's a morally justifiable thing to do, but is it possible in principle?"}, {"time": 5546, "text": "I think it would be very difficult, but I don't see why in principle it wouldn't be possible."}, {"time": 5551, "text": "And I agree with you that we try to understand the world."}, {"time": 5555, "text": "We try to integrate the sensory inputs that we have, and we try to come up with a hypothesis that explains what's going on."}, {"time": 5561, "text": "I think though that we have huge input from the social context that we're in."}, {"time": 5569, "text": "We don't do it by ourselves."}, {"time": 5570, "text": "We don't kind of blunder around in a universe by ourself and understand the whole thing."}, {"time": 5575, "text": "We're told by the people around us what things are and what they do, and language is coming in here and so on."}, {"time": 5581, "text": "So it would have to be an extremely impressive simulation to simulate all of that."}, {"time": 5588, "text": "Yeah, simulate all of that, including the social construct, the spread of ideas and the exchange of ideas."}, {"time": 5596, "text": "But those questions are really important to understand as we become more and more digital creatures."}, {"time": 5602, "text": "It seems like the next step of evolution is us becoming all the same mechanisms we've talked about are becoming more and more plugged into the machine."}, {"time": 5611, "text": "We're becoming cyborgs."}, {"time": 5614, "text": "And there's an interesting interplay between wires and biology."}, {"time": 5620, "text": "Zeros and ones and the biological systems."}, {"time": 5623, "text": "And I don't think we'll have the luxury to see humans as disjoint from the technology we've created for much longer."}, {"time": 5633, "text": "We are an organism that's."}, {"time": 5636, "text": "Yeah, I mean, I agree with you."}, {"time": 5640, "text": "But we come really with this to consciousness."}, {"time": 5646, "text": "And is there a distinction there?"}, {"time": 5648, "text": "Because what you're saying, the natural end point says we are indistinguishable, that if you are capable of building an AI, which is sufficiently close and similar that we merge with it, then to all intents and purposes, that AI is conscious as we know it."}, {"time": 5666, "text": "And I don't have a strong view, but I have a view."}, {"time": 5675, "text": "And I wrote about it in the epilogue to my last book, because 10 years ago, I wrote a chapter in a book called Life Ascending about consciousness."}, {"time": 5685, "text": "And the subtitle of Life Ascending was The 10 Great Inventions of Evolution."}, {"time": 5689, "text": "And I couldn't possibly write a book with a subtitle like that that did not include consciousness."}, {"time": 5694, "text": "And specifically consciousness as one of the great inventions."}, {"time": 5699, "text": "And it was in part because I was just curious to know more and I read more for that chapter."}, {"time": 5704, "text": "I never worked on it, but I've always, how can anyone not be interested in the question?"}, {"time": 5709, "text": "And I was left with the feeling that A, nobody knows, and B, there are two main schools of thought out there with a big kind of skew in distribution."}, {"time": 5721, "text": "One of them says, oh, it's a property of matter."}, {"time": 5723, "text": "It's an unknown law of physics."}, {"time": 5726, "text": "Panpsychism, everything is conscious."}, {"time": 5728, "text": "The sun is conscious."}, {"time": 5729, "text": "It's just a matter of, or a rock is conscious."}, {"time": 5731, "text": "It's just a matter of how much."}, {"time": 5733, "text": "And I find that very unpersuasive."}, {"time": 5736, "text": "I can't say that it's wrong."}, {"time": 5737, "text": "It's just that I think we somehow can tell the difference between something that's living and something that's not."}, {"time": 5745, "text": "And then the other end is it's an emergent property of a very complex central nervous system."}, {"time": 5751, "text": "And I never quite understand what people mean by words like emergence."}, {"time": 5757, "text": "I mean, there are genuine examples, but I think we very often tend to use it to plaster over ignorance."}, {"time": 5768, "text": "As a biochemist, the question for me then was, okay, it's a concoction of a central nervous system."}, {"time": 5776, "text": "A depolarizing neuron gives rise to a feeling, to a feeling of pain, or to a feeling of love, or anger, or whatever it may be."}, {"time": 5787, "text": "So what is then a feeling in biophysical terms in the central nervous system?"}, {"time": 5791, "text": "Which bit of the wiring gives rise to, and I've never seen anyone answer that question in a way that makes sense to me."}, {"time": 5801, "text": "And that's an important question to answer."}, {"time": 5803, "text": "I think if we want to understand consciousness, that's the only question to answer."}, {"time": 5807, "text": "Because certainly an AI is capable of out thinking, and it's only a matter of time."}, {"time": 5813, "text": "Maybe it's already happened."}, {"time": 5814, "text": "In terms of just information processing and computational skill, I don't think we have any problem in designing a mind which is at least the equal of the human mind."}, {"time": 5827, "text": "But in terms of what we value the most as humans, which is to say our feelings, our emotions, our sense of what the world is in a very personal way, that I think means as much or more to people than their information processing."}, {"time": 5844, "text": "And that's where I don't think that AI necessarily will become conscious, because I think it's the property of life."}, {"time": 5853, "text": "Well, let's talk about it more."}, {"time": 5854, "text": "You're an incredible writer, one of my favorite writers."}, {"time": 5856, "text": "So let me read from your latest book, Transformers, what you write about consciousness."}, {"time": 5862, "text": "I think therefore I am, said Descartes, is one of the most celebrated lines ever written."}, {"time": 5869, "text": "But what am I exactly?"}, {"time": 5871, "text": "An artificial intelligence can think too, by definition, and therefore is, yet few of us could agree whether AI is capable in principle of anything resembling human emotions, of love or hate, fear and joy, of spiritual yearnings, for oneness or oblivion, or corporeal pangs of thirst and hunger."}, {"time": 5894, "text": "The problem is we don't know what emotions are, as you were saying."}, {"time": 5899, "text": "What is the feeling in physical terms?"}, {"time": 5901, "text": "How does a discharging neuron give rise to a feeling of anything at all?"}, {"time": 5905, "text": "This is the hard problem of consciousness, the seeming duality of mind and matter, the physical makeup of our innermost self."}, {"time": 5914, "text": "We can understand in principle how an extremely sophisticated parallel processing system could be capable of wondrous feats of intelligence, but we can't answer in principle whether such a supreme intelligence would experience joy or melancholy."}, {"time": 5929, "text": "What is the quantum of solace?"}, {"time": 5932, "text": "I, speaking to the question of emergence, you know, there's just technical, there's an excellent paper on this recently about this kind of phase transition, emergence of performance in neural networks on the problem of NLP, natural language processing."}, {"time": 5954, "text": "So language models, there seems to be this question of size."}, {"time": 5959, "text": "At some point, there is a phase transition as you grow the size of the neural network."}, {"time": 5965, "text": "So the question is, that's sort of somewhat of a technical question that you can philosophize over."}, {"time": 5972, "text": "The technical question is, is there a size of a neural network that starts to be able to form the kind of representations that can capture a language, and therefore be able to, not just language, but linguistically capture knowledge that's sufficient to solve a lot of problems in language, like be able to have a conversation."}, {"time": 5992, "text": "And there seems to be not a gradual increase, but a phase transition."}, {"time": 5997, "text": "And they're trying to construct the science of where that is, like what is a good size of a neural network, and why does such a phase transition happen?"}, {"time": 6005, "text": "Anyway, that sort of points to emergence, that there could be stages where a thing goes from being, oh, you're very intelligent toaster, to a toaster that's feeling sad today and turns away and looks out the window, sighing, having an existential crisis."}, {"time": 6030, "text": "Thinking of Marvin, the paranoid android."}, {"time": 6033, "text": "Marvin is simplistic because Marvin is just cranky."}, {"time": 6040, "text": "So easily programmed."}, {"time": 6041, "text": "Yeah, easily programmed, nonstop existential crisis."}, {"time": 6045, "text": "You're almost basically, what is it?"}, {"time": 6047, "text": "Notes from Underground by Dostoevsky, like just constantly complaining about life."}, {"time": 6053, "text": "No, they're capturing the full rollercoaster of human emotion, the excitement, the bliss, the connection, the empathy and all that kind of stuff."}, {"time": 6063, "text": "And then the selfishness, the anger, the depression, all that kind of stuff."}, {"time": 6069, "text": "They're capturing all of that and be able to experience it deeply."}, {"time": 6074, "text": "Like it's the most important thing you could possibly experience today."}, {"time": 6078, "text": "The highest highs, the lowest lows, this is it."}, {"time": 6081, "text": "My life will be over."}, {"time": 6084, "text": "I cannot possibly go on that feeling."}, {"time": 6086, "text": "And then like after a nap, you're feeling amazing."}, {"time": 6090, "text": "That might be something that emerges."}, {"time": 6093, "text": "So why would a nap make an AI being feel better?"}, {"time": 6102, "text": "First of all, we don't know that for a human either, right?"}, {"time": 6105, "text": "But we do know that that's actually true for many people much of the time."}, {"time": 6108, "text": "You may be utterly depressed and you have a nap and you do in fact feel better, so."}, {"time": 6113, "text": "Oh, you are actually asking the technical question there, is there, so that's a very, there's a biological answer to that."}, {"time": 6119, "text": "And so the question is whether AI needs to have the same kind of attachments to its body, bodily function and preservation of the brain's successful function, self preservation essentially in some deep biological sense."}, {"time": 6137, "text": "I mean, to my mind, it comes back round to the problem we were talking about before about simulations and sensory input and learning what all of this stuff means and life and death, that biology unlike society has a death penalty over everything and natural selection works on that death penalty."}, {"time": 6158, "text": "That if you make this decision wrongly, you die."}, {"time": 6167, "text": "And the next generation is represented by beings that made a slightly different decision on balance."}, {"time": 6176, "text": "And that is something that's intrinsically difficult to simulate in all this richness, I would say."}, {"time": 6186, "text": "So what is?"}, {"time": 6189, "text": "Death in all its richness."}, {"time": 6192, "text": "Our relationship with death or the whole of it."}, {"time": 6196, "text": "So which when you say richness, of course, there's a lot in that."}, {"time": 6202, "text": "Which is hard to simulate."}, {"time": 6203, "text": "What's part of the richness that's hard to simulate?"}, {"time": 6207, "text": "I suppose the complexity of the environment and your position in that or the position of an organism in that environment, in the full richness of that environment over its entire life, over multiple generations with changes in gene sequence over those generations."}, {"time": 6224, "text": "So slight changes in the makeup of those individuals over generations."}, {"time": 6228, "text": "But if you take it back to the level of single cells, which I do in the book and ask how does a single cell in effect know it exists as a unit, as an entity?"}, {"time": 6242, "text": "I mean, no, in inverted commas, obviously it doesn't know anything, but it acts as a unit and it acts with astonishing precision as a unit."}, {"time": 6254, "text": "And I had suggested that that's linked to the electrical fields on the membranes themselves and that they give some indication of how am I doing in relation to my environment as a kind of real time feedback on the world."}, {"time": 6268, "text": "And this is something physical, which can be selected over generations that if you get this wrong, it's linked with this set of circumstances that I've just, as an individual, I have a moment of blind panic and run as a bacterium or something."}, {"time": 6290, "text": "You have some electrical discharge that says blind panic and it runs whatever it may be."}, {"time": 6296, "text": "And you associate over generations, multiple generations that this electrical phase that I'm in now is associated with a response like that."}, {"time": 6307, "text": "And it's easy to see how feelings come in through the back door almost with that kind of giving real time feedback on your position in the world in relation to how am I doing."}, {"time": 6322, "text": "And then you complexify the system and yes, I have no problem with phase transition."}, {"time": 6327, "text": "And can all of this be done purely by the language, by the issues with how the system understands itself?"}, {"time": 6342, "text": "Maybe it can, I honestly don't know."}, {"time": 6345, "text": "But the philosophers for a long time have talked about the possibility that you can have a zombie intelligence and that there are no feelings there, but everything else is the same."}, {"time": 6359, "text": "I mean, I have to throw this back to you really."}, {"time": 6361, "text": "How do you deal with the zombie intelligence?"}, {"time": 6363, "text": "So first of all, I can see that from a biologist perspective, you think of all the complexities that led up to the human being."}, {"time": 6372, "text": "The entirety of the history of four billion years that in some deep sense integrated the human being into this environment."}, {"time": 6380, "text": "And that dance of the organism and the environment, you could see how emotions arise from that."}, {"time": 6387, "text": "And then emotions are deeply connected and creating a human experience."}, {"time": 6392, "text": "And from that, you mix in consciousness and the full mess of it, yeah."}, {"time": 6397, "text": "But from a perspective of an intelligent organism that's already here, like a baby that learns, it doesn't need to learn how to be a collection of cells or how to do all the things it needs to do."}, {"time": 6412, "text": "The basic function of a baby as it learns is to interact with its environment, to learn from its environment, to learn how to fit in to the social society, to like... And the basic response of the baby is to cry a lot of the time."}, {"time": 6427, "text": "To cry, well, to convince the humans to protect it or to discipline it, to teach it."}, {"time": 6434, "text": "I mean, we've developed a bunch of different tricks, how to get our parents to take care of us, to educate us, to teach us about the world."}, {"time": 6444, "text": "Also, we've constructed the world in such a way that it's safe enough for us to survive in and yet dangerous enough for learning the valuable lessons."}, {"time": 6452, "text": "Like the tables are still hard with corners, so it can still run into them."}, {"time": 6456, "text": "It hurts like how..."}, {"time": 6458, "text": "So AI needs to solve that problem, not the problem of constructing this super complex organism that leads up... To run the whole... To make an apple pie, to build the whole universe, you need to build a whole universe."}, {"time": 6475, "text": "I think the zombie question is something I would leave to the philosophers."}, {"time": 6484, "text": "Because... And I will also leave to them the definition of love and what happens between two human beings when there's a magic that just grabs them."}, {"time": 6498, "text": "Like nothing else matters in the world and somehow you've been searching for this feeling, this moment, this person your whole life."}, {"time": 6505, "text": "That feeling, the philosophers can have a lot of fun with that one and also say that that's just... You can have a biological explanation, you can have all kinds of..."}, {"time": 6515, "text": "It's all fake, it's actually... Ayn Rand will say it's all selfish."}, {"time": 6520, "text": "There's a lot of different interpretations."}, {"time": 6522, "text": "I'll leave it to the philosophers."}, {"time": 6523, "text": "The point is the feeling sure as hell feels very real."}, {"time": 6528, "text": "And if my toaster makes me feel like it's the only toaster in the world."}, {"time": 6535, "text": "And when I leave and I miss the toaster and when I come back, I'm excited to see the toaster and my life is meaningful and joyful and the friends I have around me get a better version of me because that toaster exists."}, {"time": 6550, "text": "That sure as hell feels like a conscious toaster."}, {"time": 6553, "text": "Is that psychologically different to having a dog?"}, {"time": 6556, "text": "Because I mean most people would dispute whether we can say a dog..."}, {"time": 6560, "text": "I would say a dog is undoubtedly conscious, but some people say it doesn't."}, {"time": 6564, "text": "But there's degrees of consciousness and so on, but people are definitely much more uncomfortable saying a toaster can be conscious than a dog."}, {"time": 6572, "text": "And there's still a deep connection."}, {"time": 6575, "text": "You could say our relationship with the dog has more to do with anthropomorphism."}, {"time": 6580, "text": "Like we kind of project the human being onto it."}, {"time": 6583, "text": "We can do the same damn thing with a toaster."}, {"time": 6585, "text": "Yes, but you can look into the dog's eyes and you can see that it's sad, that it's delighted to see you again."}, {"time": 6592, "text": "I don't have a dog, by the way."}, {"time": 6593, "text": "It's not that I'm a dog person or a cat person."}, {"time": 6594, "text": "And dogs are actually incredibly good at using their eyes to do just that."}, {"time": 6600, "text": "Now, I don't imagine that a dog is remotely as close to being intelligent as an AI intelligence, but it's certainly capable of communicating emotionally with us."}, {"time": 6611, "text": "But here's what I would venture to say."}, {"time": 6613, "text": "We tend to think because AI plays chess well and is able to fold proteins now well, that it's intelligent."}, {"time": 6621, "text": "I would argue that in order to communicate with humans, in order to have emotional intelligence, it actually requires another order of magnitude of intelligence."}, {"time": 6628, "text": "It's not easy to be flawed."}, {"time": 6634, "text": "Solving a mathematical puzzle is not the same as the full complexity of human to human interaction."}, {"time": 6642, "text": "That's actually, we humans just take for granted the things we're really good at."}, {"time": 6649, "text": "Nonstop, people tell me how shitty people are driving."}, {"time": 6652, "text": "No, humans are incredible at driving."}, {"time": 6656, "text": "Bipedal walking, walking, object manipulation."}, {"time": 6660, "text": "We're incredible at this."}, {"time": 6661, "text": "And so people tend to discount the things we all just take for granted."}, {"time": 6667, "text": "And one of those things that they discount is our ability, the dance of conversation and interaction with each other."}, {"time": 6675, "text": "The ability to morph ideas together."}, {"time": 6678, "text": "The ability to get angry at each other and then to miss each other."}, {"time": 6681, "text": "Like to create a tension that makes life fun and difficult and challenging in a way that's meaningful."}, {"time": 6688, "text": "That is a skill that's learned and AI would need to solve that problem."}, {"time": 6693, "text": "I mean, in some sense, what you're saying is AI cannot become meaningfully emotional, let's say, until it experiences some kind of internal conflict that is unable to reconcile these various aspects of reality or its reality with a decision to make."}, {"time": 6714, "text": "And then it feels sad, necessarily, because it doesn't know what to do."}, {"time": 6719, "text": "And I certainly can't dispute that."}, {"time": 6721, "text": "That may very well be how it works."}, {"time": 6723, "text": "I think the only way to find out is to do it."}, {"time": 6725, "text": "And to build it."}, {"time": 6726, "text": "Yeah, and leave it to the philosophers if it actually feels sad or not."}, {"time": 6731, "text": "The point is the robot will be sitting there alone having an internal conflict, an existential crisis, and that's required for it to have a deep, meaningful connection with another human being."}, {"time": 6741, "text": "Now, does it actually feel that?"}, {"time": 6744, "text": "But I'd like to throw something else at you, which troubles me on reading it."}, {"time": 6751, "text": "Noah Harari's book, 21 Lessons for the 21st Century."}, {"time": 6755, "text": "And he's written about this kind of thing on various occasions."}, {"time": 6758, "text": "And he sees biochemistry as an algorithm."}, {"time": 6760, "text": "And then AI will necessarily be able to hack that algorithm and do it better than humans."}, {"time": 6766, "text": "So there will be AI better at writing music that we appreciate than Mozart ever could, or writing better than Shakespeare ever did, and so on."}, {"time": 6773, "text": "Because biochemistry is algorithmic, and all you need to do is figure out which bits of the algorithm to play to make us feel good or bad or appreciate things."}, {"time": 6782, "text": "And as a biochemist, I find that argument an argument close to irrefutable and not very enjoyable."}, {"time": 6793, "text": "I don't like the sound of it."}, {"time": 6794, "text": "That's just my reaction as a human being."}, {"time": 6796, "text": "You might like the sound of it because that says that AI is capable of the same kind of emotional feelings about the world as we are, because the whole thing is an algorithm and you can program an algorithm, and there you are."}, {"time": 6811, "text": "He then has a peculiar final chapter where he talks about consciousness in rather separate terms."}, {"time": 6817, "text": "And he's talking about meditating and so on and getting in touch with his inner conscious."}, {"time": 6821, "text": "I don't meditate, I don't know anything about that."}, {"time": 6824, "text": "But he wrote in very different terms about it, as if somehow it's a way out of the algorithm."}, {"time": 6832, "text": "Now, it seems to me that consciousness in that sense is capable of scuppering the algorithm."}, {"time": 6838, "text": "I think in terms of the biochemical feedback loops and so on, it is undoubtedly algorithmic."}, {"time": 6844, "text": "But in terms of what we decide to do, it can be much more based on an emotion."}, {"time": 6854, "text": "We can just think, I don't care."}, {"time": 6856, "text": "I can't resolve this complex situation."}, {"time": 6860, "text": "I'm gonna do that."}, {"time": 6861, "text": "And that can be based on, in effect, a different currency, which is the currency of feelings and something where we don't have very much personal control over."}, {"time": 6869, "text": "And then it comes back around to you and what are you trying to get at with AI?"}, {"time": 6875, "text": "Do we need to have some system which is capable of overriding a rational decision which cannot be made because there's too much conflicting information by effectively an emotional judgmental decision that just says, do this and see what happens."}, {"time": 6890, "text": "That's what consciousness is really doing in my view."}, {"time": 6893, "text": "Yeah, and the question is whether it's a different process or just a higher level process."}, {"time": 6899, "text": "I might, you know, the idea that biochemistry is an algorithm is, to me, an oversimplistic view."}, {"time": 6907, "text": "There's a lot of things that the moment you say it, it's irrefutable, but it simplifies."}, {"time": 6917, "text": "And in the process loses something fundamental."}, {"time": 6921, "text": "So for example, calling a universe and an information processing system, sure, yes."}, {"time": 6927, "text": "You could make that."}, {"time": 6929, "text": "It's a computer that's performing computations, but you're missing the process of the entropy somehow leading to pockets of complexity that creates these beautiful artifacts that are incredibly complex and they're like machines."}, {"time": 6948, "text": "And then those machines are through the process of evolution are constructing even further complexity."}, {"time": 6954, "text": "Like in calling universe information processing machine, you're missing those little local pockets and how difficult it is to create them."}, {"time": 6965, "text": "So the question to me is if biochemistry is an algorithm, how difficult is it to create a software system that runs the human body, which I think is incorrect."}, {"time": 6976, "text": "I think that is going to take so long."}, {"time": 6981, "text": "I mean, that's going to be centuries from now to be able to reconstruct the human."}, {"time": 6985, "text": "Now, what I would venture to say to get some of the magic of a human being with what we're saying with the emotions and the interactions and like a dog makes a smile and joyful and all those kinds of things that will come much sooner, but that doesn't require us to reverse engineer the algorithm of biochemistry."}, {"time": 7004, "text": "Yes, but the toaster is making you happy."}, {"time": 7008, "text": "It's not about whether you make the toaster happy."}, {"time": 7011, "text": "No, it has to be."}, {"time": 7016, "text": "The toaster has to be able to leave me happy."}, {"time": 7018, "text": "Yeah, but it's the toaster is the AI in this case is very intelligent."}, {"time": 7020, "text": "Yeah, the toaster has to be able to be unhappy and leave me."}, {"time": 7023, "text": "That's essential."}, {"time": 7027, "text": "That's essential for my being able to miss the toaster."}, {"time": 7029, "text": "If the toaster is just my servant, that's not, or a provider of like services, like tells me the weather makes toast, that's not going to deep connection."}, {"time": 7042, "text": "It has to have internal conflict."}, {"time": 7044, "text": "You write about life and death."}, {"time": 7046, "text": "It has to be able to be conscious of its mortality and the finiteness of its existence."}, {"time": 7053, "text": "And that life is for temporary and therefore it needs to be more selective."}, {"time": 7058, "text": "One of the most moving moments in the movies from when I was a boy was the unplugging of Hal in 2001, where that was the death of a sentient being and Hal knew it."}, {"time": 7071, "text": "So I think we all kind of know that a sufficiently intelligent being is going to have some form of consciousness, but whether it would be like biological consciousness, I just don't know."}, {"time": 7087, "text": "And if you're thinking about how do we bring together, I mean, obviously we're going to interact more closely with AI, but is a dog really like a toaster or is there really some kind of difference there?"}, {"time": 7105, "text": "You were talking about biochemistry is algorithmic, but it's not single algorithm and it's very complex, of course it is."}, {"time": 7113, "text": "So it may be that there are again conflicts in the circuits of biochemistry, but I have a feeling that the level of complexity of the total biochemical system at the level of a single cell is less complex than the level of neural networking in the human brain or in an AI."}, {"time": 7132, "text": "Well, I guess I assumed that we were including the brain in the biochemistry algorithm, because you have to..."}, {"time": 7139, "text": "I would see that as a higher level of organization of neural networks."}, {"time": 7142, "text": "They're all using the same biochemical wiring within themselves."}, {"time": 7146, "text": "Yeah, but the human brain is not just neurons."}, {"time": 7149, "text": "It's the immune system."}, {"time": 7151, "text": "It's the whole package."}, {"time": 7153, "text": "I mean, to have a biochemical algorithm that runs an intelligent biological system, you have to include the whole damn thing."}, {"time": 7161, "text": "And it's pretty fascinating that it comes from like, from an embryo, like the whole, I mean, oh boy."}, {"time": 7169, "text": "I mean, if you can, what is a human being?"}, {"time": 7173, "text": "Because it's just some code and then you built, and then that says DNA doesn't just tell you what to build, but how to build it."}, {"time": 7180, "text": "I mean, the thing is impressive."}, {"time": 7184, "text": "And the question is how difficult is it to reverse engineer the whole shebang?"}, {"time": 7194, "text": "I would say it's, don't want to say impossible, but it's like, it's much easier to build a human than to reverse engineer, to build like a fake human, human like thing than to reverse engineer the entirety of the process of the evolution."}, {"time": 7215, "text": "I'm not sure if we are capable of reverse engineering the whole thing."}, {"time": 7221, "text": "If the human mind is capable of doing that."}, {"time": 7223, "text": "I mean, I wouldn't be a biologist if I wasn't trying, but I know I can't understand the whole problem."}, {"time": 7231, "text": "I'm just trying to understand the rudimentary outlines of the problem."}, {"time": 7235, "text": "There's another aspect though, you're talking about developing from a single cell to the human mind and all the part system, subsystems that are part of the immune system and so on."}, {"time": 7248, "text": "This is something that you'll talk about, I imagine, with Michael Levin, but so little is known about, you talk about reverse engineering, so little is known about the developmental pathways that go from a genome to going to a fully wired organism."}, {"time": 7269, "text": "And a lot of it seems to depend on the same in electrical interactions that I was talking about happening at the level of single cells and its interaction with the environment."}, {"time": 7279, "text": "There's a whole electrical field side to biology that is not yet written into any of the textbooks, which is about how does an embryo develop into or a single cell develop into these complex systems?"}, {"time": 7292, "text": "What defines the head, what defines the immune system, what defines the brain and so on?"}, {"time": 7297, "text": "That really is written in a language that we're only just beginning to understand and frankly, biologists, most biologists are still very reluctant to even get themselves tangled up in questions like electrical fields influencing development."}, {"time": 7311, "text": "It seems like mumbo jumbo to a lot of biologists and it should not be because this is the 21st century biology, this is where it's going."}, {"time": 7319, "text": "But we're not gonna reverse engineer a human being or the mind or any of these subsystems until we understand how this developmental process or how electricity in biology really works."}, {"time": 7330, "text": "And if it is linked with feelings and with consciousness and so on, that's the, I mean, in the meantime, we have to try, but I think that's where the answer lies."}, {"time": 7342, "text": "So you think it's possible that the key to things like consciousness are some of the more tricky aspects of cognition might lie in that early development, the interaction of electricity and biology."}, {"time": 7359, "text": "Electrical fields."}, {"time": 7360, "text": "But we already know the EEG and so on is telling us a lot about brain function, but we don't know which cells, which parts of a neural network is giving rise to the EEG."}, {"time": 7368, "text": "We don't know the basics."}, {"time": 7370, "text": "The assumption is, I mean, we know it's neural networks, we know it's multiple cells, hundreds or thousands of cells involved in it and we assume that it has to do with depolarization during action potentials and so on."}, {"time": 7383, "text": "But the mitochondria which are in there have much more membranes than the plasma membrane of the neuron and there's a much greater membrane potential and it's formed in parallel, very often parallel cristae, which are capable of reinforcing a field and generating fields over longer distances."}, {"time": 7401, "text": "And nobody knows if that plays a role in consciousness or not."}, {"time": 7404, "text": "There's reasons to argue that it could, but frankly we simply do not know and it's not taken into consideration."}, {"time": 7411, "text": "You look at the structure of the mitochondrial membranes in the brains of simple things like Drosophila, the fruit fly, and they have amazing structures."}, {"time": 7422, "text": "You can see lots of little rectangular things all lined up in amazing patterns."}, {"time": 7429, "text": "Why are they like that?"}, {"time": 7429, "text": "We haven't the first clue."}, {"time": 7432, "text": "What do you think about organoids and brain organoids and so in a lab trying to study the development of these in the Petri dish development of organs."}, {"time": 7445, "text": "Do you think that's promising?"}, {"time": 7446, "text": "Do you have to look at whole systems?"}, {"time": 7448, "text": "I've never done anything like that."}, {"time": 7450, "text": "I don't know much about it."}, {"time": 7451, "text": "The people who I've talked to who do work on it say amazing things can happen and a bit of a brain grown in a dish is capable of experiencing some kind of feelings or even memories of its former brain."}, {"time": 7463, "text": "Again, I have a feeling that until we understand how to control the electrical fields that control development, we're not going to understand how to turn an organoid into a real functional system."}, {"time": 7476, "text": "But how do we get that understanding?"}, {"time": 7478, "text": "It's so incredibly difficult."}, {"time": 7481, "text": "I mean, you would have to, I mean, one promising direction, I'd love to get your opinion on this."}, {"time": 7486, "text": "I don't know if you're familiar with the work of DeepMind and AlphaFold with protein folding and so on."}, {"time": 7492, "text": "Do you think it's possible that that will give us some breakthroughs in biology trying to basically simulate and model the behavior of trivial biological systems as they become complex biological systems?"}, {"time": 7511, "text": "I'm sure it will."}, {"time": 7512, "text": "The interesting thing to me about protein folding is that for a long time, my understanding, this is not what I work on, so I may have got this wrong, but my understanding is that you take the sequence of a protein and you try to fold it."}, {"time": 7528, "text": "And there are multiple ways in which it can fold."}, {"time": 7531, "text": "And to come up with the correct conformation is not a very easy thing because you're doing it from first principles from a string of letters, which specify the string of amino acids."}, {"time": 7539, "text": "But what actually happens is when a protein is coming out of a ribosome, it's coming out of a charged tunnel and it's in a very specific environment, which is going to force this to go there now and then this one to go there and this one to come like that."}, {"time": 7553, "text": "And so you're forcing a specific conformational set of changes onto it as it comes out of the ribosome."}, {"time": 7558, "text": "So by the time it's fully emerged, it's already got its shape."}, {"time": 7561, "text": "And that shape depended on the immediate environment that it was emerging into one letter, one amino acid at a time."}, {"time": 7571, "text": "And I don't think that the field was looking at it that way."}, {"time": 7576, "text": "And if that's correct, then that's very characteristic of science, which is to say it asks very often the wrong question and then does really amazingly sophisticated analyses on something having never thought to actually think, well, what is biology doing?"}, {"time": 7589, "text": "And biology is giving you a charged electrical environment that forces you to be this way."}, {"time": 7593, "text": "Now, did DeepMind come up through patterns with some answer that was like that?"}, {"time": 7599, "text": "I've got absolutely no idea."}, {"time": 7601, "text": "It ought to be possible to deduce that from the shapes of proteins."}, {"time": 7606, "text": "It would require a much greater skill than the human mind has."}, {"time": 7612, "text": "But the human mind is capable of saying, well, hang on, let's look at this exit tunnel and try and work out what shape is this protein going to take?"}, {"time": 7618, "text": "And we can figure that out."}, {"time": 7620, "text": "That's really interesting about the exit tunnel, but like sometimes we get lucky and just like in science, the simplified view or the static view will actually solve the problem for us."}, {"time": 7632, "text": "So in this case, it's very possible that the sequence of letters has a unique mapping to our structure without considering how it unraveled."}, {"time": 7641, "text": "So without considering the tunnel."}, {"time": 7643, "text": "And so that seems to be the case in this situation where the cool thing about proteins, all the different shapes they can possibly take, it actually seems to take very specific unique shapes given the sequence."}, {"time": 7656, "text": "That's forced on you by an exit tunnel."}, {"time": 7658, "text": "So the problem is actually much simpler than you thought."}, {"time": 7660, "text": "And then there's a whole army of proteins which change the conformational state, chaperone proteins."}, {"time": 7669, "text": "And they're only used when there's some presumably issue with how it came out of the exit tunnel and you wanna do it differently to that."}, {"time": 7678, "text": "So very often the chaperone proteins will go there and will influence the way in which it falls."}, {"time": 7683, "text": "So there's two ways of doing it."}, {"time": 7686, "text": "Either you can look at the structures and the sequences of all the proteins and you can apply an immense mind to it and figure out what the patterns are and figure out what happened."}, {"time": 7695, "text": "Or you can look at the actual situation where it is and say, well, hang on, it was actually quite simple."}, {"time": 7700, "text": "It's got a charged environment and then it's forced to come out this way."}, {"time": 7703, "text": "And then the question will be, well, do different ribosomes have different charged environments?"}, {"time": 7707, "text": "What happens if a chaperone?"}, {"time": 7708, "text": "You're asking a different set of questions to come to the same answer in a way which is telling you a much simpler story and explains why it is rather than saying it could be, this is one in a billion different possible conformational states that this protein could have."}, {"time": 7722, "text": "You're saying, well, it has this one because that was the only one it could take given its setting."}, {"time": 7728, "text": "Well, yeah, I mean, currently humans are very good at that kind of first principles thinking."}, {"time": 7732, "text": "I was stepping back, but I think AI is really good at collecting a huge amount of data and a huge amount of data of observation of planets and figure out that Earth is not at the center of the universe, that there's actually a sun, we're orbiting the sun."}, {"time": 7748, "text": "But then you can, as a human being, ask, well, how do solar systems come to be?"}, {"time": 7755, "text": "What are the different forces that are required to make this kind of pattern emerge?"}, {"time": 7759, "text": "And then you start to invent things like gravity."}, {"time": 7766, "text": "I mixed up the ordering of gravity, wasn't considered as a thing that connects planets, but we are able to think about those big picture things as human beings."}, {"time": 7778, "text": "AI is just very good to infer simple models from a huge amount of data."}, {"time": 7785, "text": "And the question is with biology, we kind of go back and forth at how we solve biology."}, {"time": 7790, "text": "Listen, protein folding was thought to be impossible to solve, and there's a lot of brilliant PhD students that worked one protein at a time trying to figure out the structure."}, {"time": 7800, "text": "And the fact that I was able to do that."}, {"time": 7803, "text": "Oh, I'm not knocking it at all, but I think that people have been asking the wrong question."}, {"time": 7809, "text": "But then, as the people start to ask better and bigger questions, the AI kind of enters the chat and says, I'll help you out with that."}, {"time": 7822, "text": "Can I give you another example for my own work?"}, {"time": 7827, "text": "The risk of getting a disease as we get older, there are genetic aspects to it."}, {"time": 7835, "text": "If you spend your whole life overeating and smoking and whatever, that's a whole separate question."}, {"time": 7841, "text": "But there's a genetic side to the risk."}, {"time": 7843, "text": "And we know a few genes that increase your risk of certain things."}, {"time": 7847, "text": "And for probably 20 years now, people have been doing what's called GWAS, which is genome wide association studies."}, {"time": 7855, "text": "So you've effectively scanned the entire genome for any single nucleotide polymorphisms, which is to say a single letter change in one place, that has a higher association of being linked with a particular disease or not."}, {"time": 7869, "text": "And you can come up with thousands of these things across the genome."}, {"time": 7873, "text": "And if you add them all up and try and say, well, so do they add up to explain the known genetic risk of this disease?"}, {"time": 7883, "text": "And the known genetic risk often comes from twin studies."}, {"time": 7886, "text": "And you can say that if this twin gets epilepsy, there's a 40 or 50% risk that the other twin, identical twin will also get epilepsy."}, {"time": 7895, "text": "Therefore, the genetic factor is about 50%."}, {"time": 7899, "text": "And so the gene similarities that you see should account for 50% of that known risk."}, {"time": 7906, "text": "Very often it accounts for less than a 10th of the known risk."}, {"time": 7910, "text": "And there's two possible explanations."}, {"time": 7912, "text": "And there's one which people tend to do, which is to say, ah, well, we don't have enough statistical power."}, {"time": 7918, "text": "If we, maybe there's a million, we've only found a thousand of them."}, {"time": 7921, "text": "But if we find the other million, they're weakly related, but there's a huge number of them."}, {"time": 7925, "text": "And so we'll account for that whole risk."}, {"time": 7927, "text": "Maybe there's a billion of them."}, {"time": 7931, "text": "So that's one way."}, {"time": 7932, "text": "The other way is to say, well, hang on a minute, you're missing a system here."}, {"time": 7937, "text": "That system is the mitochondrial DNA, which people tend to dismiss because it's small and it doesn't change very much."}, {"time": 7947, "text": "But a few single letter changes in that mitochondrial DNA, it controls some really basic processes."}, {"time": 7953, "text": "It controls not only all the energy that we need to live and to move around and do everything we do, but also biosynthesis to make the new building blocks to make new cells."}, {"time": 7967, "text": "And cancer cells very often kind of take over the mitochondria and rewire them so that instead of using them for making energy, they're effectively using them as precursors for the building blocks for biosynthesis."}, {"time": 7978, "text": "You need to make new amino acids, new nucleotides for DNA."}, {"time": 7981, "text": "You wanna make new lipids to make your membranes and so on."}, {"time": 7984, "text": "So they kind of rewire metabolism."}, {"time": 7986, "text": "Now, the problem is that we've got all these interactions between mitochondrial DNA and the genes in the nucleus that are overlooked completely because people throw away, literally throw away the mitochondrial genes."}, {"time": 7998, "text": "And we can see in fruit flies that they interact and produce big differences in risk."}, {"time": 8004, "text": "So you can set AI onto this question of exactly how many of these base changes there are."}, {"time": 8015, "text": "And this is one possible solution that maybe there are a million of them and it does account for the greatest part of the risk."}, {"time": 8021, "text": "Or the other one is they aren't, it's just not there."}, {"time": 8023, "text": "That actually the risk lies in something you weren't even looking at."}, {"time": 8027, "text": "And this is where human intuition is very important."}, {"time": 8030, "text": "And just this feeling that, well, I'm working on this and I think it's important and I'm bloody minded about it."}, {"time": 8036, "text": "And in the end, some people are right."}, {"time": 8037, "text": "It turns out that it was important."}, {"time": 8040, "text": "Can you get AI to do that, to be bloody minded?"}, {"time": 8043, "text": "And that, hang on a minute, you might be missing a whole other system here that's much bigger."}, {"time": 8051, "text": "That's the moment of discovery of scientific revolution."}, {"time": 8057, "text": "I'm giving up on saying AI can't do something."}, {"time": 8062, "text": "I've said it enough times about enough things."}, {"time": 8065, "text": "I think there's been a lot of progress."}, {"time": 8067, "text": "And instead I'm excited by the possibility of AI helping humans."}, {"time": 8071, "text": "But at the same time, just like I said, we seem to dismiss the power of humans."}, {"time": 8078, "text": "Like we're so limited in so many ways that we kind of, in what we feel like dumb ways, like we're not strong, we're kind of our attention, our attention, our memory is limited."}, {"time": 8097, "text": "Our ability to focus on things is limited in our own perception of what limited is."}, {"time": 8102, "text": "But that actually, there's an incredible computer behind the whole thing that makes this whole system work."}, {"time": 8108, "text": "Our ability to interact with the environment, to reason about the environment."}, {"time": 8113, "text": "There's magic there."}, {"time": 8114, "text": "And I'm hopeful that AI can capture some of that same magic."}, {"time": 8118, "text": "But that magic is not gonna look like Deep Blue playing chess."}, {"time": 8122, "text": "No, it's going to be more interesting."}, {"time": 8124, "text": "But I don't think it's gonna look like pattern finding either."}, {"time": 8127, "text": "I mean, that's essentially what you're telling me."}, {"time": 8129, "text": "It does very well at the moment."}, {"time": 8130, "text": "And my point is it works very well where you're looking for the right pattern."}, {"time": 8136, "text": "But we are storytelling animals and the hypothesis is a story."}, {"time": 8140, "text": "It's a testable story."}, {"time": 8142, "text": "But a new hypothesis is a leap into the unknown and it's a new story basically."}, {"time": 8148, "text": "And it says this leads to this leads to that."}, {"time": 8151, "text": "It's a causal set of storytelling."}, {"time": 8154, "text": "It's also possible that the leap into the unknown has a pattern of its own."}, {"time": 8159, "text": "And it's possible that it's learnable."}, {"time": 8162, "text": "I'm sure it is."}, {"time": 8164, "text": "There's a nice book by Arthur Kessler on the nature of creativity."}, {"time": 8171, "text": "And he likens it to a joke where the punchline goes off in a completely unexpected direction and says that this is the basis of human creativity."}, {"time": 8178, "text": "That some creative switch of direction to an unexpected place is similar to a joke."}, {"time": 8185, "text": "I'm not saying that's how it works, but it's a nice idea and there must be some truth in it."}, {"time": 8190, "text": "And it's one of these, most of the stories we tell are probably the wrong story and probably going nowhere and probably not helpful."}, {"time": 8197, "text": "And we definitely don't do as well at seeing patterns in things."}, {"time": 8201, "text": "But some of the most enjoyable human aspects is finding a new story that goes to an unexpected place."}, {"time": 8207, "text": "And again, these are all aspects of what being human means to me."}, {"time": 8212, "text": "And maybe these are all things that AI figures out for itself, or maybe they're just aspects."}, {"time": 8218, "text": "But I just have the feeling sometimes that the people who are trying to understand what we are like, if we wish to craft an AI system which is somehow human like, that we don't have a firm enough grasp of what humans really are like in terms of how we are built."}, {"time": 8241, "text": "But we get a better, better understanding of that."}, {"time": 8245, "text": "I agree with you completely."}, {"time": 8246, "text": "We try to build a thing and then we go, hang on a minute, there's another system here."}, {"time": 8253, "text": "And that's actually the attempt to build AI that's human like, is getting us to a deeper understanding of human beings."}, {"time": 8259, "text": "The funny thing that I recently talked to Magnus Carlsen, why they consider to be the greatest chess player of all time."}, {"time": 8266, "text": "And he talked about AlphaZero, which is a system from DeepMind that plays chess."}, {"time": 8271, "text": "And he had a funny comment."}, {"time": 8275, "text": "He has a kind of dry sense of humor."}, {"time": 8277, "text": "But he was extremely impressed when he first saw AlphaZero play."}, {"time": 8282, "text": "And he said that it did a lot of things that could easily be mistaken for creativity."}, {"time": 8287, "text": "So he like, as a typical human, refused to give the system sort of its due."}, {"time": 8296, "text": "Because he came up with a lot of things that a lot of people are extremely impressed by."}, {"time": 8302, "text": "Not just the sheer calculation, but the brilliance of play."}, {"time": 8306, "text": "So one of the things that it does in really interesting ways is it sacrifices pieces."}, {"time": 8315, "text": "So in chess, that means you basically take a few steps back and then take a step forward."}, {"time": 8321, "text": "You give away pieces for some future reward."}, {"time": 8326, "text": "And that, for us humans, is where art is in chess."}, {"time": 8330, "text": "You take big risks."}, {"time": 8332, "text": "That for us humans, those risks are especially painful because you have a fog of uncertainty before you."}, {"time": 8342, "text": "So to take a risk now based on intuition of I think this is the right risk to take, but there's so many possibilities, that that's where it takes guts."}, {"time": 8351, "text": "That's where art is, that's that danger."}, {"time": 8354, "text": "And then the alpha, alpha zero takes those same kind of risks and does them even greater degree."}, {"time": 8362, "text": "But of course, it does it from a, well, you could easily reduce down to a cold calculation over patterns."}, {"time": 8374, "text": "But boy, when you see the final result, it sure looks like the same kind of magic that we see in creativity."}, {"time": 8381, "text": "When we see creative play on the chessboard, but the chessboard is very limited."}, {"time": 8386, "text": "And the question is, as we get better and better, can we do that same kind of creativity in mathematics, in programming, and then eventually in biology, psychology, and expand into more and more complex systems?"}, {"time": 8404, "text": "I was, I used to go running when I was a boy, and fell running, which is to say, running up and down mountains."}, {"time": 8410, "text": "And I was never particularly great at it, but there were some people who were amazingly fast, especially at running down."}, {"time": 8418, "text": "And I realized in trying to do this, that there's only really two ways, there's three possible ways of doing it, and there's only two that work."}, {"time": 8427, "text": "Either you go extremely slowly and carefully, and you figure out, okay, there's a stone, I'll put my foot on this stone, and then there's another, there's a muddy puddle I'm going to avoid."}, {"time": 8437, "text": "And you know, it's slow, it's laborious."}, {"time": 8439, "text": "You figure it out step by step."}, {"time": 8442, "text": "Or you can just go incredibly fast, and you don't think about it at all."}, {"time": 8445, "text": "The entire conscious mind is shut out of it, and it's probably the same playing table tennis or something, there's something in the mind, which is doing a whole lot of subconscious calculations about exact, and it's amazing."}, {"time": 8455, "text": "You can run at astonishing speed down a hillside with no idea how you did it at all."}, {"time": 8460, "text": "And then you panic, and you think, I'm going to break my leg if I keep doing this, I've got to think about where I'm going to put my foot."}, {"time": 8465, "text": "So you slow down a bit and try to bring those conscious mind in, and then you do, you crash."}, {"time": 8469, "text": "You cannot think consciously while running downhill."}, {"time": 8474, "text": "So it's amazing how many calculations the mind is able to make."}, {"time": 8481, "text": "And now the problem with playing chess or something, if you're able to make all of those subconscious kind of forward calculations about what is the likely outcome of this move now in the way that we can by running down a hillside or something, it's partly about what we have adapted to do."}, {"time": 8498, "text": "It's partly about the reality of the world that we're in."}, {"time": 8500, "text": "Running fast downhill is something that we better be bloody good at, otherwise we're going to be eaten."}, {"time": 8506, "text": "Whereas trying to calculate multiple, multiple moves into the future is not something we've ever been called on to do."}, {"time": 8514, "text": "Two or three, four moves into the future is quite enough for most of us most of the time."}, {"time": 8518, "text": "Yeah, yeah, so yeah, just solving chess may not, we may not be as far towards solving the problem of downhill running as we might think just because we solve chess."}, {"time": 8537, "text": "Still, it's beautiful to see creativity."}, {"time": 8540, "text": "Humans create machines."}, {"time": 8543, "text": "They're able to create art and art on a chessboard and art otherwise."}, {"time": 8549, "text": "Who knows how far that takes us."}, {"time": 8551, "text": "So I mentioned Andrej Karpathy earlier."}, {"time": 8555, "text": "Him and I are big fans of yours."}, {"time": 8557, "text": "If you're taking votes, his suggestion was you should write your next book on the Fermi Paradox."}, {"time": 8563, "text": "So let me ask you on the topic of alien life."}, {"time": 8569, "text": "Since we've been talking about life and we're a kind of aliens, how many alien civilizations are out there, do you think?"}, {"time": 8578, "text": "Well, the universe is very big, so some, but not as many as most people would like to think is my view because the idea that there is a trajectory going from simple, simple cellular life like bacteria all the way through to humans."}, {"time": 8597, "text": "It seems to me there's some big gaps along that way that the eukaryotic cell, the complex cell that we have is the biggest of them, but also photosynthesis is another."}, {"time": 8607, "text": "The other, another interesting gap is a long gap from the origin of the eukaryotic cell to the first animals."}, {"time": 8614, "text": "That was about a billion years, maybe more than that."}, {"time": 8618, "text": "A long delay in when oxygen began to accumulate in the atmosphere."}, {"time": 8622, "text": "So from the first appearance of oxygen in the Great Oxidation Event to enough for animals to respire, it was close to two billion years."}, {"time": 8632, "text": "Why so long?"}, {"time": 8633, "text": "It seems to be planetary factors."}, {"time": 8634, "text": "It seems to be geology as much as in anything else."}, {"time": 8637, "text": "And we don't really know what was going on."}, {"time": 8640, "text": "So the idea that there's a kind of an inevitable march towards complexity and sentient life, I don't think is right."}, {"time": 8652, "text": "Doesn't, not to say it's not gonna happen, but I think it's not gonna happen often."}, {"time": 8657, "text": "So if you think of Earth, given the geological constraints and all that kind of stuff, do you have a sense that life, complex life, intelligent life happened really quickly on Earth or really long?"}, {"time": 8671, "text": "So just to get a sense of, are you more sort of saying that it's very unlikely to get the kind of conditions required to create humans?"}, {"time": 8682, "text": "Or is it, even if you have the condition, it's just statistically difficult?"}, {"time": 8686, "text": "I think the, I mean, the problem, the single great problem at the center of all of that, to my mind, is the origin of the eukaryotic cell, which happened once and without eukaryotes, nothing else would have happened."}, {"time": 8696, "text": "And that is something that."}, {"time": 8698, "text": "That's because you're saying it's super important, the eukaryotes, but."}, {"time": 8702, "text": "I'm saying a tantamount to saying that it is impossible to build something as complex as a human being from bacterial cells."}, {"time": 8709, "text": "Totally agree in some deep fundamental way."}, {"time": 8711, "text": "But it's just like a one cell going inside another."}, {"time": 8714, "text": "Is that so difficult to get to work right?"}, {"time": 8717, "text": "That like."}, {"time": 8718, "text": "Well, again, it happened once."}, {"time": 8721, "text": "And if you think about, if you think, I mean, I'm in a minority view in this position."}, {"time": 8727, "text": "Most biologists probably wouldn't agree with me anyway."}, {"time": 8730, "text": "But if you think about the starting point, we've got a simple cell, it's an alkyl cell, we can be fairly sure about that."}, {"time": 8736, "text": "So it looks a lot like a bacterium, but is in fact from this other domain of life."}, {"time": 8742, "text": "So it looks a lot like a bacterial cell."}, {"time": 8744, "text": "That means it doesn't have anything."}, {"time": 8746, "text": "It doesn't have a nucleus."}, {"time": 8747, "text": "It doesn't really have complex endomembrane."}, {"time": 8750, "text": "It has a little bit of stuff, but not that much."}, {"time": 8753, "text": "And it takes up an endosymbiont."}, {"time": 8756, "text": "So what happens next?"}, {"time": 8758, "text": "And the answer is basically everything to do with complexity."}, {"time": 8762, "text": "To me, there's a beautiful paradox here."}, {"time": 8764, "text": "Plants and animals and fungi all have exactly the same type of cell."}, {"time": 8771, "text": "But they all have really different ways of living."}, {"time": 8774, "text": "So a plant cell, it's photosynthetic."}, {"time": 8779, "text": "They started out as algae in the oceans and so on."}, {"time": 8782, "text": "So think of algal blooms, single cell things."}, {"time": 8784, "text": "The basic cell structure that it's built from is exactly the same with a couple of small differences."}, {"time": 8793, "text": "It's got chloroplasts as well."}, {"time": 8795, "text": "It's got a vacuole."}, {"time": 8795, "text": "It's got a cell wall."}, {"time": 8796, "text": "But that's about it."}, {"time": 8797, "text": "Pretty much everything else is exactly the same in a plant cell and an animal cell."}, {"time": 8802, "text": "And yet the ways of life are completely different."}, {"time": 8804, "text": "So this cell structure did not evolve in response to different ways of life, different environments."}, {"time": 8810, "text": "I'm in the ocean doing photosynthesis."}, {"time": 8811, "text": "I'm on land running around as part of an animal."}, {"time": 8814, "text": "I'm a fungus in a soil, spreading out long shoots into whatever it may be, mycelium."}, {"time": 8822, "text": "So they all have the same underlying cell structure."}, {"time": 8826, "text": "Almost certainly it was driven by adaptation to the internal environment, to having these pesky endosymbionts that forced all kinds of change on the host cell."}, {"time": 8836, "text": "Now, in one way you could see that as a really good thing because it may be that there's some inevitability to this process that as soon as you got endosymbionts, you're more or less bound to go in that direction."}, {"time": 8845, "text": "Or it could be that there's a huge fluke about it and it's almost certain to go wrong in just about every case possible."}, {"time": 8851, "text": "That the conflict will lead to effectively war leading to death and extinction."}, {"time": 8856, "text": "And it simply doesn't work out."}, {"time": 8857, "text": "So maybe it happened millions of times and it went wrong every time."}, {"time": 8860, "text": "Or maybe it only happened once and it worked out because it was inevitable."}, {"time": 8864, "text": "And actually we simply do not know enough now to say which of those two possibilities is true."}, {"time": 8869, "text": "But both of them are a bit grim."}, {"time": 8870, "text": "But you're leaning towards, we just got really lucky in that one leap."}, {"time": 8876, "text": "Like we got, so do you have a sense that our galaxy, for example, has just maybe millions of planets with bacteria living on it?"}, {"time": 8886, "text": "I would expect billions, tens of billions of planets with bacteria living on it practically."}, {"time": 8891, "text": "I mean, there's probably what, five to 10 planets per star of which I would hope that at least one would have bacteria on."}, {"time": 8900, "text": "So I expect bacteria to be very common."}, {"time": 8903, "text": "I simply can't put a number otherwise."}, {"time": 8905, "text": "I mean, I expect it will happen elsewhere."}, {"time": 8907, "text": "It's not that I think we're living in a completely empty universe."}, {"time": 8911, "text": "But I think that it's not gonna happen inevitably."}, {"time": 8915, "text": "And there's something, it wasn't, that's not the only problem with complex life on earth."}, {"time": 8921, "text": "I mentioned oxygen and animals and so on as well."}, {"time": 8924, "text": "And even humans, we came along very late."}, {"time": 8926, "text": "You go back 5 million years and would we be that impressed if we came across a planet full of giraffes?"}, {"time": 8932, "text": "I mean, you'd think, hey, there's life here and it's a nice planet to colonize or something."}, {"time": 8936, "text": "We wouldn't think, oh, let's try and have a conversation with this giraffe."}, {"time": 8940, "text": "Yeah, I'm not sure what exactly we would think."}, {"time": 8944, "text": "I'm not exactly sure what makes humans so interesting from an alien perspective or how they would notice."}, {"time": 8951, "text": "I'll talk to you about cities too because that's an interesting perspective of how to look at human civilization."}, {"time": 8958, "text": "But your sense, I mean, of course you don't know, but it's an interesting world, it's an interesting galaxy, it's an interesting universe to live in that's just like every sun, like 90% of solar systems have bacteria in it."}, {"time": 8979, "text": "Imagine that world and the galaxy maybe has just a handful if not one intelligent civilization."}, {"time": 8991, "text": "That's a wild world."}, {"time": 8993, "text": "I didn't even think about that world."}, {"time": 8995, "text": "There's a kind of thought that, like one of the reasons it would be so exciting to find life on Mars or Titan or whatever is like if its life is elsewhere, then surely, statistically, that life, no matter how unlikely you query as multicellular organisms, sex, violence, what else is extremely difficult?"}, {"time": 9019, "text": "I mean, photosynthesis, figuring out some machinery that involves the chemistry and the environment to allow the building up of complex organisms, surely that would arise."}, {"time": 9032, "text": "But man, I don't know how I would feel about just bacteria everywhere."}, {"time": 9038, "text": "Well, it would be depressing if it was true."}, {"time": 9040, "text": "I suppose depressing, I don't think, I don't."}, {"time": 9042, "text": "I don't know what's more depressing, bacteria everywhere or nothing everywhere."}, {"time": 9046, "text": "Yes, either of them are chilling."}, {"time": 9049, "text": "But whether it's chilling or not, I don't think should force us to change our view about whether it's real or not."}, {"time": 9058, "text": "And what I'm saying may or may not be true."}, {"time": 9060, "text": "So how would you feel if we discovered life on Mars?"}, {"time": 9064, "text": "It sounds like you would be less excited than some others because you're like, well."}, {"time": 9068, "text": "What I would be most interested in is how similar to life on Earth it would be."}, {"time": 9072, "text": "It would actually turn into quite a subtle problem because the likelihood of life having gone to and fro between Mars and the Earth is quite, I wouldn't say high, but it's not low, it's quite feasible."}, {"time": 9087, "text": "And so if we found life on Mars and it had very similar genetic code, but it was slightly different, most people would interpret that immediately as evidence that they've been transit one way or the other and that it was a common origin of life on Mars or on the Earth and it went one way or the other way."}, {"time": 9103, "text": "The other way to see that question though would be to say, well, actually the beginnings of life lie in deterministic chemistry and thermodynamics, starting with the most likely abundant materials, CO2 and water and a wet rocky planet."}, {"time": 9117, "text": "And Mars was wet and rocky at the beginning."}, {"time": 9119, "text": "And will, I won't say inevitably, but potentially almost inevitably come up with a genetic code which is not very far away from the genetic code that we already have."}, {"time": 9129, "text": "So we see subtle differences in the genetic code."}, {"time": 9132, "text": "Could be very difficult to interpret."}, {"time": 9134, "text": "Is it possible, do you think, to tell the difference of something that truly originated?"}, {"time": 9139, "text": "I think if the stereochemistry was different, we have sugars, for example, that are the L form or the D form and we have D sugars and L amino acids right across all of life."}, {"time": 9152, "text": "But lipids, the bacteria have one stereoisomer and the bacteria have the other, the opposite stereoisomer."}, {"time": 9162, "text": "So it's perfectly possible to use one or the other one."}, {"time": 9166, "text": "And the same would almost certainly go for, and I think George Church has been trying to make life based on the opposite stereoisomer."}, {"time": 9176, "text": "So it's perfectly possible to do and it will work."}, {"time": 9180, "text": "And if we were to find life on Mars that was using the opposite stereoisomer, that would be unequivocal evidence that life had started independently there."}, {"time": 9188, "text": "So hopefully the life we find will be on Titan and Europa or something like that where it's less likely that we shared and it's harsher conditions so there's gonna be weirder kind of life."}, {"time": 9200, "text": "I wouldn't count on that because if life started in deep sea hydrothermal vents here, that's pretty harsh."}, {"time": 9208, "text": "So Titan is different."}, {"time": 9209, "text": "Europa is probably quite similar to Earth in the sense that we're dealing with an ocean, some acidic ocean there, as the early Earth would have been."}, {"time": 9218, "text": "And it almost certainly has hydrothermal systems."}, {"time": 9221, "text": "Same with Enceladus."}, {"time": 9223, "text": "We can tell that from these plumes coming from the surface through the ice."}, {"time": 9226, "text": "We know there's a liquid ocean and we can tell roughly what the chemistry is."}, {"time": 9231, "text": "For Titan, we're dealing with liquid methane and things like that."}, {"time": 9234, "text": "So that would really, if there really is life there, it would really have to be very, very different to anything that we know on Earth."}, {"time": 9240, "text": "So the hard leap, the hardest leap, the most important leap is from prokaryotes to eukaryotes."}, {"time": 9247, "text": "It's eukaryotic."}, {"time": 9249, "text": "What's the second, if we're ranking?"}, {"time": 9252, "text": "What's the, you gave a lot of emphasis on photosynthesis."}, {"time": 9257, "text": "Yeah, and that would be my second one, I think."}, {"time": 9260, "text": "But it's not so much, I mean, photosynthesis is part of the problem."}, {"time": 9265, "text": "It's a difficult thing to do."}, {"time": 9266, "text": "Again, we know it happened once."}, {"time": 9269, "text": "We don't know why it happened once."}, {"time": 9271, "text": "But the fact that it was kind of taken on board completely by plants and algae and so on as chloroplasts and did very well in completely different environments and then on land and whatever else seems to suggest that there's no problem with exploring, whether you could have a separate origin that explored this whole domain over there that the bacteria had never gone into."}, {"time": 9298, "text": "So that kind of says that the reason that it only happened once is probably because it's difficult, because the wiring is difficult."}, {"time": 9305, "text": "But then it happened at least 2.2 billion years ago, right before the GOE, maybe as long as 3 billion years ago, when there are, some people say there are whiffs of oxygen, there's just kind of traces in the fossil in the geochemical record that say, maybe there was a bit of oxygen then."}, {"time": 9322, "text": "That's really disputed."}, {"time": 9323, "text": "Some people say it goes all the way back four billion years ago and then it's gone."}, {"time": 9328, "text": "And the common ancestor of life on Earth was photosynthetic."}, {"time": 9332, "text": "So immediately you've got groups of people who disagree over a two billion year period of time about when it started."}, {"time": 9341, "text": "But let's take the latest date when it's unequivocal, that's 2.2 billion years ago, through to around about the time of the Cambrian explosion when oxygen levels definitely got close to modern levels, which was around about 550 million years ago."}, {"time": 9356, "text": "So we've gone more than one and a half billion years where the Earth was in stasis."}, {"time": 9363, "text": "Nothing much changed."}, {"time": 9364, "text": "It's known as the boring billion, in fact."}, {"time": 9368, "text": "Probably stuff was, that was when eukaryotes arose somewhere in there, but it's..."}, {"time": 9375, "text": "So this idea that the world is constantly changing, that we're constantly evolving, that we're moving up some ramp is a very human idea."}, {"time": 9382, "text": "But in reality, there are kind of tipping points to a new stable equilibrium where the cells that are producing oxygen are precisely counterbalanced by the cells that are consuming that oxygen, which is why it's 21% now and has been that way for hundreds of millions of years."}, {"time": 9404, "text": "We have a very precise balance."}, {"time": 9406, "text": "You go through a tipping point and you don't know where the next stable state's gonna be, but it can be a long way from here."}, {"time": 9414, "text": "And so if we change the world with global warming, there will be a tipping point."}, {"time": 9418, "text": "The question is where and when, and what's the next stable state?"}, {"time": 9421, "text": "It may be uninhabitable to us."}, {"time": 9423, "text": "It'll be habitable to life, for sure."}, {"time": 9427, "text": "But there may be something like the Permian extinction where 95% of species go extinct and there's a five to 10 million year gap and then life recovers, but without humans."}, {"time": 9436, "text": "And the question statistically, well, without humans, but statistically does that ultimately lead to greater complexity, more interesting life, more intelligent life?"}, {"time": 9445, "text": "Well, after the first appearance of oxygen with the GOE, there was a tipping point which led to a longterm stable state that was equivalent to the Black Sea today, which is to say oxygenated at the very surface and stagnant, sterile, not sterile, but sulfurous, lower down."}, {"time": 9463, "text": "And that was stable certainly around the continental margins for more than a billion years."}, {"time": 9470, "text": "It was not a state that led to progression in an obvious way."}, {"time": 9475, "text": "Yeah, I mean, it's interesting to think about evolution, like what leads to stable states and how often are evolutionary pressures emerging from the environment."}, {"time": 9491, "text": "So maybe other planets are able to create evolutionary pressures, chemical pressures, whatever, some kind of pressure that say, you're screwed unless you get your shit together in the next like 10,000 years, like a lot of pressure."}, {"time": 9506, "text": "It seems like Earth, like the boring building might be explained in two ways."}, {"time": 9511, "text": "One is super difficult to take any kind of next step."}, {"time": 9514, "text": "And the second way it could be explained is there's no reason to take the next step."}, {"time": 9519, "text": "No, I think there is no reason, but at the end of it, there was a snowball Earth."}, {"time": 9524, "text": "So there was a planetary catastrophe on a huge scale where the ice was, the sea was frozen at the equator."}, {"time": 9534, "text": "And that forced change in one way or another."}, {"time": 9538, "text": "It's not long after that, 100 million years, perhaps after that, so not a short time, but this is when we begin to see animals."}, {"time": 9543, "text": "There was a shift again, another tipping point that led to catastrophic change that led to a takeoff then."}, {"time": 9550, "text": "We don't really know why, but one of the reasons why that I discuss in the book is about sulfate being washed into the oceans, which sounds incredibly parochial."}, {"time": 9562, "text": "But the issue is, I mean, what the data is showing, we can track roughly how oxygen was going into the atmosphere from carbon isotopes."}, {"time": 9575, "text": "So there's two main isotopes of carbon that we need to think about here."}, {"time": 9578, "text": "One is carbon 12, 99% of carbon is carbon 12."}, {"time": 9581, "text": "And then 1% of carbon is carbon 13, which is a stable isotope."}, {"time": 9586, "text": "And then there's carbon 14, which is a trivial radioactive, it's trivial in amount."}, {"time": 9590, "text": "So carbon 13 is 1%."}, {"time": 9593, "text": "And life and enzymes generally, you can think of carbon atoms as little balls bouncing around, ping pong balls bouncing around."}, {"time": 9601, "text": "Carbon 12 moves a little bit faster than carbon 13 because it's lighter and it's more likely to encounter an enzyme."}, {"time": 9608, "text": "And so it's more likely to be fixed into organic matter."}, {"time": 9611, "text": "And so organic matter is enriched."}, {"time": 9613, "text": "And this is just an observation."}, {"time": 9614, "text": "It's enriched in carbon 12 by a few percent compared to carbon 13, relative to what you would expect if it was just equal."}, {"time": 9621, "text": "And if you then bury organic matter as coal or oil or whatever it may be, then it's no longer oxidized."}, {"time": 9631, "text": "So some oxygen remains leftover in the atmosphere."}, {"time": 9635, "text": "And that's how oxygen accumulates in the atmosphere."}, {"time": 9637, "text": "And you can work out historically how much oxygen there must've been in the atmosphere by how much carbon was being buried."}, {"time": 9643, "text": "And you think, well, how can we possibly know how much carbon was being buried?"}, {"time": 9646, "text": "And the answer is, well, if you're burying carbon 12, what you're leaving behind is more carbon 13 in the oceans and that precipitates out into limestone."}, {"time": 9654, "text": "So you can look at limestones over these ages and work out what's the carbon 13 signal."}, {"time": 9659, "text": "And that gives you a kind of a feedback on what the oxygen content."}, {"time": 9663, "text": "Right before the Cambrian explosion, there was what's called a negative isotope anomaly excursion, which is basically the carbon 13 goes down by a massive amount and then back up again 10 million years later."}, {"time": 9675, "text": "And what that seems to be saying is the amount of carbon 12 in the oceans was disappearing, which is to say it was being oxidized."}, {"time": 9690, "text": "And if it's being oxidized, it's consuming oxygen."}, {"time": 9693, "text": "And that should, so a big carbon 13 signal says the ratio of carbon 12 to carbon 13 is really going down, which means there's much more carbon 12 being taken out and being oxidized."}, {"time": 9704, "text": "Sorry, this is getting too complex, but."}, {"time": 9706, "text": "Well, it's a good way to estimate the amount of oxygen."}, {"time": 9709, "text": "If you calculate the amount of oxygen based on the assumption that all this carbon 12 that's being taken out is being oxidized by oxygen, the answer is all the oxygen in the atmosphere gets stripped out, there is none left."}, {"time": 9721, "text": "And yet the rest of the geological indicators say, no, there's oxygen in the atmosphere."}, {"time": 9726, "text": "So it's a kind of a paradox."}, {"time": 9727, "text": "And the only way to explain this paradox just on mass balance of how much stuff is in the air, how much stuff is in the oceans and so on, is to assume that oxygen was not the oxygen, it was sulfate."}, {"time": 9739, "text": "Sulfate was being washed into the oceans."}, {"time": 9742, "text": "It's used as an electron acceptor by sulfate reducing bacteria, just as we use oxygen as an electron acceptor."}, {"time": 9748, "text": "So they pass their electrons to sulfate instead of oxygen."}, {"time": 9751, "text": "Bacteria did."}, {"time": 9754, "text": "So these are bacteria."}, {"time": 9756, "text": "So they're oxidizing carbon, organic carbon with sulfate, passing the electrons onto sulfate, that reacts with iron to form iron pyrite or fool's gold, sinks down to the bottom, gets buried out of the system."}, {"time": 9771, "text": "And this can account for the mass balance."}, {"time": 9773, "text": "So why does it matter?"}, {"time": 9775, "text": "It matters because what it says is there was a chance event, tectonically there was a lot of sulfate sitting on land as some kind of mineral."}, {"time": 9786, "text": "So calcium sulfate minerals, for example, are evaporitic."}, {"time": 9791, "text": "And because there happened to be some continental collisions, mountain building, the sulfate was pushed up the side of a mountain and happened to get washed into the ocean."}, {"time": 9804, "text": "Yeah, so I wonder how many happy accidents like that are possible."}, {"time": 9807, "text": "Statistically, it's really hard."}, {"time": 9808, "text": "Maybe you can rule that in statistically, but this is the course of life on earth."}, {"time": 9814, "text": "Without all that sulfate being raised up, this Cambrian explosion almost certainly would not have happened."}, {"time": 9819, "text": "And then we wouldn't have had animals and so on and so on."}, {"time": 9822, "text": "So it's this kind of explanation of the Cambrian explosion."}, {"time": 9828, "text": "So let me actually say in several ways."}, {"time": 9831, "text": "So folks who challenge the validity of the theory of evolution will give us an example."}, {"time": 9840, "text": "Now I'm not well studied in this, but will give us an example of the Cambrian explosion as like, this thing is weird."}, {"time": 9847, "text": "Oh, it is weird, yeah."}, {"time": 9848, "text": "So the question I would have is what's the biggest mystery or gap in understanding about evolution?"}, {"time": 9859, "text": "Is it the Cambrian explosion?"}, {"time": 9861, "text": "And if so, what's our best understanding of how to explain, first of all, what is it?"}, {"time": 9868, "text": "In my understanding, in the short amount of time, maybe 10 million years, 100 million years, something like that, a huge number of animals, a variety, diversity of animals were created."}, {"time": 9879, "text": "Anyway, there's like five questions in there."}, {"time": 9881, "text": "Is that the biggest mystery?"}, {"time": 9883, "text": "No, I don't think it's a particularly big mystery really anymore."}, {"time": 9888, "text": "There are still mysteries about why then."}, {"time": 9891, "text": "And I've just said sulfate being washed into the oceans is one."}, {"time": 9894, "text": "It needs oxygen and oxygen levels rose around that time."}, {"time": 9899, "text": "So probably before that, they weren't high enough for animals."}, {"time": 9902, "text": "What we're seeing with the Cambrian explosion is the beginning of predators and prey relationships."}, {"time": 9907, "text": "We're seeing modern ecosystems and we're seeing arms races and we're seeing the full creativity of evolution unleashed."}, {"time": 9920, "text": "So I talked about the boring billion, nothing happens for one and a half billion years, one and a half billion years."}, {"time": 9929, "text": "The assumption, and this is completely wrong, this assumption, is then that evolution works really slowly and that you need billions of years to affect some small change and then another billion years to do something else."}, {"time": 9944, "text": "Evolution gets stuck in a stasis and it stays that way for tens of millions, hundreds of millions of years."}, {"time": 9950, "text": "And Steven Jay Gould used to argue this, he called it punctuated equilibrium, but he was doing it to do with animals and to do with the last 500 million years or so, where it's much less obvious than if you think about the entire planetary history."}, {"time": 9962, "text": "And then you realize that the first two billion years was bacteria only."}, {"time": 9966, "text": "You have the origin of life, two billion years of just bacteria, oxygen photosynthesis arising here."}, {"time": 9971, "text": "Then you have a global catastrophe, snowball earths and great oxidation event and then another billion years of nothing happening and then some period of upheavals and then another snowball earth and then suddenly you see the Cambrian explosion."}, {"time": 9983, "text": "This is long periods of stasis where the world is in a stable state and is not geared towards increasing complexity."}, {"time": 9991, "text": "It's just everything is in balance."}, {"time": 9993, "text": "And only when you have a catastrophic level, global level problem like a snowball earth, it forces everything out of balance and there's a tipping point and you end up somewhere else."}, {"time": 10002, "text": "Now, the idea that evolution is slow is wrong."}, {"time": 10008, "text": "It can be incredibly fast."}, {"time": 10010, "text": "And I mentioned earlier on that you can, in theory, it would take half a million years to invent an eye, for example, from a light sensitive spot."}, {"time": 10017, "text": "It doesn't take long to convert one kind of tube into a tube with nobbles on it into a tube with arms on it and then multiple arms and then at one end is the head where it starts out as a swelling."}, {"time": 10031, "text": "It's not difficult intellectually to understand how these things can happen."}, {"time": 10038, "text": "It boggles the mind that it can happen so quickly, but we're used to human timescales."}, {"time": 10044, "text": "And what we need to talk about is generations of things that live for a year in the ocean."}, {"time": 10050, "text": "And then a million years is a million generations."}, {"time": 10053, "text": "And the amount of change that you can do, it can affect in that period of time is enormous."}, {"time": 10058, "text": "And we're dealing with large populations of things where selection is sensitive to pretty small changes and can, so again, as soon as you throw in the competition of predators and prey and you're ramping up the scale of evolution, it's not very surprising that it happens very quickly when the environment allows it to happen."}, {"time": 10078, "text": "So I don't think there's a big mystery."}, {"time": 10079, "text": "There's lots of details that need to be filled in."}, {"time": 10083, "text": "I mean, the big mystery in biology is consciousness."}, {"time": 10091, "text": "The big mystery in biology is consciousness."}, {"time": 10093, "text": "Well, intelligence is kind of a mystery too."}, {"time": 10101, "text": "I mean, you said biology, not psychology."}, {"time": 10108, "text": "Because from a biology perspective, it seems like intelligence and consciousness all are the same, like weird, like all the brain stuff."}, {"time": 10117, "text": "I don't see intelligence as necessarily that difficult, I suppose."}, {"time": 10122, "text": "I mean, I see it as a form of computing and I don't know much about computing, so I... You don't know much about consciousness either."}, {"time": 10130, "text": "So I mean, I suppose, oh, I see."}, {"time": 10134, "text": "I see, I see, I see, I see."}, {"time": 10137, "text": "That consciousness you do know a lot about as a human being."}, {"time": 10140, "text": "No, no, I mean, I think I can understand the wiring of a brain as a series of, in pretty much the same way as a computer in theory, in terms of the circuitry of it."}, {"time": 10156, "text": "The mystery to me is how this system gives rise to feelings, as we were talking about earlier on."}, {"time": 10163, "text": "Yeah, I just, I think we oversimplify intelligence."}, {"time": 10167, "text": "I think the dance, the magic of reasoning is as interesting as the magic of feeling."}, {"time": 10176, "text": "We tend to think of reasoning as like very, running a very simplistic algorithm."}, {"time": 10185, "text": "I think reasoning is the interplay between memory, whatever the hell is going on, the unconscious mind, all of that."}, {"time": 10195, "text": "I'm not trying to diminish it in any way at all."}, {"time": 10198, "text": "Obviously, it's extraordinarily exquisitely complex, but I don't see a logical difficulty with how it works."}, {"time": 10206, "text": "Yeah, no, I mean, I agree with you, but sometimes, yeah, there's a big cloak of mystery around consciousness."}, {"time": 10216, "text": "Let me compare it with classical versus quantum physics."}, {"time": 10220, "text": "Classical physics is logical, and you can understand the kind of language we're dealing with."}, {"time": 10227, "text": "It's almost at the human level, we're dealing with stars and things that we can see."}, {"time": 10231, "text": "And when you get to quantum mechanics and things, it's practically impossible for the human mind to compute what just happened there."}, {"time": 10239, "text": "Yeah, I mean, that is the same."}, {"time": 10241, "text": "It's like, you understand mathematically that the notes of a musical composition, that's intelligence."}, {"time": 10249, "text": "But why it makes you feel a certain way, that is much harder to understand."}, {"time": 10257, "text": "Yeah, that's really, but it was interesting framing that that's a mystery at the core of biology."}, {"time": 10265, "text": "I wonder who solves consciousness."}, {"time": 10269, "text": "I tend to think consciousness will be solved by the engineer, meaning the person who builds it, who keeps trying to build the thing, versus biology, such a complicated system."}, {"time": 10284, "text": "I feel like the building blocks of consciousness from a biological perspective are like, that's like the final creation of a human being."}, {"time": 10296, "text": "So you have to understand the whole damn thing."}, {"time": 10298, "text": "You said the electrical field, but like, electrical field is plus plus."}, {"time": 10303, "text": "Everything, the whole shebang."}, {"time": 10307, "text": "I'm inclined to agree."}, {"time": 10308, "text": "I mean, my feeling is from my meager knowledge of the history of science is that the biggest breakthrough has usually come through from a field that was not related."}, {"time": 10317, "text": "So if anyone is not going to be a biologist who solves consciousness, just because biologists are too embedded in the nature of the problem."}, {"time": 10326, "text": "And then nobody's going to believe you when you've done it, because nobody's going to be able to prove that this AI is in fact conscious and sad in any case, and any more than you can prove that a dog is conscious and sad."}, {"time": 10340, "text": "So it tells you that it is in good language, and you must believe it."}, {"time": 10344, "text": "But I think most people will accept, if faced with that, that that's what it is."}, {"time": 10350, "text": "All of this probability of complex life, in one way, I think why it matters is that my expectation, I suppose, is that we will be over the next 100 years or so, if we survive at all, that AI will increasingly dominate."}, {"time": 10373, "text": "And pretty much anything that we put out into space looking for other, well, for the universe, for what's out there, will be AI, won't be us."}, {"time": 10383, "text": "We won't be doing that."}, {"time": 10384, "text": "Or when we do, it'll be on a much more limited scale."}, {"time": 10387, "text": "I suppose the same would apply to any alien civilization."}, {"time": 10392, "text": "So perhaps rather than looking for signs of life out there, we should be looking for AI out there."}, {"time": 10399, "text": "But then we face the problem that I don't see how a planet is going to give rise directly to AI."}, {"time": 10409, "text": "I can see how a planet can give rise directly to organic life."}, {"time": 10414, "text": "And if the principles that govern the evolution of life on Earth apply to other planets as well, and I think a lot of them would, then the likelihood of ending up with a humanlike civilization capable of giving rise to AI in the first place is massively limited."}, {"time": 10432, "text": "Once you've done it once, perhaps it takes over the universe, and maybe there's no issue."}, {"time": 10437, "text": "But it seems to me that the two are necessarily linked, that you're not going to just turn a sterile planet into an AI life form without the intermediary of the organics first."}, {"time": 10448, "text": "So you have to run the full evolutionary computation with the organics to create AI."}, {"time": 10455, "text": "How does AI bootstrap itself up without the aid, if you like, of an intelligent designer?"}, {"time": 10460, "text": "The origin of AI is going to have to be in the chemistry of a planet."}, {"time": 10467, "text": "But that's not a limiting factor, right?"}, {"time": 10469, "text": "So let me ask the Fermi paradox question."}, {"time": 10475, "text": "Let's say we live in this incredibly dark and beautiful world of just billions of planets with bacteria on it and very few intelligent civilizations, and yet there's a few out there."}, {"time": 10492, "text": "Why haven't we, at scale, seen them visit us?"}, {"time": 10499, "text": "Is it because they don't exist?"}, {"time": 10502, "text": "Well, don't exist in the right part of the universe at the right time."}, {"time": 10505, "text": "That's the simplest answer for it."}, {"time": 10508, "text": "Is that the one you find the most compelling, or is there some other explanation?"}, {"time": 10513, "text": "I find that, no, it's not that I find it more compelling."}, {"time": 10516, "text": "It's that I find more probable."}, {"time": 10519, "text": "And I find all of them, I mean, there's a lot of handwaving in this."}, {"time": 10524, "text": "So I'm trying to read out from what I know about life on Earth to what might happen somewhere else."}, {"time": 10530, "text": "And it gives, to my mind, a bit of a pessimistic view of bacteria everywhere and only occasional intelligent life and running forward humans only once on Earth and nothing else that you would necessarily be any more excited about making contact with than you would be making contact with them on Earth."}, {"time": 10549, "text": "So I think the chances are pretty limited."}, {"time": 10552, "text": "And the chances of us surviving are pretty limited, too, in the way we're going on at the moment."}, {"time": 10558, "text": "The likelihood of us not making ourselves extinct within the next few hundred years, possibly within the next 50 or 100 years, seems quite small."}, {"time": 10568, "text": "I hope we can do better than that."}, {"time": 10571, "text": "So maybe the only thing that will survive from humanity will be AI."}, {"time": 10574, "text": "And maybe AI, once it exists and once it's capable of effectively copying itself and cutting humans out of the loop, then maybe that will take over the universe."}, {"time": 10584, "text": "I mean, there's a kind of inherent sadness to the way you described that."}, {"time": 10588, "text": "But isn't that also potentially beautiful, that that's the next step of life, I suppose, from your perspective, as long as it carries the flame of consciousness somehow?"}, {"time": 10601, "text": "No, I think, yes, there can be some beauty to it being the next step of life."}, {"time": 10604, "text": "And I don't know if consciousness matters or not, from that point of view, to be honest with you."}, {"time": 10610, "text": "But there's some sadness, yes, probably, because I think it comes down to the selfishness that we were talking about earlier on."}, {"time": 10619, "text": "I am an individual with a desire not to be displaced from life."}, {"time": 10626, "text": "I want to stay alive."}, {"time": 10627, "text": "I want to be here."}, {"time": 10631, "text": "So I suppose the threat that a lot of people would feel is that we will just be wiped out, so that there will be potential conflict between AI and humans and that AI will win because it's a lot smarter."}, {"time": 10645, "text": "Boy, would that be a sad state of affairs if consciousness is just an intermediate stage between bacteria and AI, right?"}, {"time": 10656, "text": "Well, I would see bacteria as being potentially a kind of primitive form of consciousness anyway."}, {"time": 10661, "text": "So the whole of life on Earth, to my mind, is capable of some form of feelings in response to the environment."}, {"time": 10667, "text": "That's not to say it's intelligent, it's got its own algorithms for intelligence, but nothing comparable with us."}, {"time": 10675, "text": "I think it's beautiful what a planet, what a sterile planet, can come up with."}, {"time": 10679, "text": "It's astonishing that it's come up with all of this stuff that we see around us and that either we or whatever we produce is capable of destroying all of that is a sad thought."}, {"time": 10692, "text": "But it's also hugely pessimistic."}, {"time": 10697, "text": "I'd like to think that we're capable of giving rise to something which is at least as good, if not better than us, as AI."}, {"time": 10704, "text": "Yeah, I have that same optimism, especially a thing that is able to propagate throughout the universe more efficiently than humans can."}, {"time": 10713, "text": "Or extensions of humans, some merger with AI and humans, whether that comes from bioengineering of the human body to extend its life somehow, to carry that flame of consciousness and that personality and the beautiful tension that's within all of us, carry that through to multiple planets, to multiple solar systems, all out there in the universe."}, {"time": 10739, "text": "I mean, that's a beautiful vision."}, {"time": 10742, "text": "Whether AI can do that or bioengineered humans can, that's an exciting possibility."}, {"time": 10749, "text": "And especially meeting other alien civilizations in that same kind of way."}, {"time": 10754, "text": "Do you think aliens have consciousness?"}, {"time": 10756, "text": "If they're organic."}, {"time": 10758, "text": "So organic is connected to consciousness."}, {"time": 10760, "text": "I mean, I think any system which is going to bootstrap itself up from planetary origins, I mean, let me finish this and then come on to something else."}, {"time": 10771, "text": "But from planetary origins is going to face similar constraints."}, {"time": 10776, "text": "And those constraints are going to be addressed in similar basic engineering ways."}, {"time": 10780, "text": "And I think it will be cellular."}, {"time": 10781, "text": "And I think it will have electrical charges."}, {"time": 10783, "text": "And I think it will have to be selected in populations over time."}, {"time": 10787, "text": "And all of these things will tend to give rise to the same processes as the simplest fix to a difficult problem."}, {"time": 10793, "text": "So I would expect it to be conscious, yes."}, {"time": 10794, "text": "And I would expect it to resemble life on Earth in many ways."}, {"time": 10800, "text": "When I was about, I guess, 15 or 16, I remember reading a book by Fred Hoyle called The Black Cloud, which I was a budding biologist at the time."}, {"time": 10811, "text": "And this was the first time I'd come across someone really challenging the heart of biology and saying, you are far too parochial."}, {"time": 10818, "text": "You're thinking about life as carbon based."}, {"time": 10820, "text": "Here's a life form which is kind of dust, interstellar dust on a solar system scale."}, {"time": 10830, "text": "And it's a novel."}, {"time": 10832, "text": "But I felt enormously challenged by that novel because it hadn't occurred to me how limited my thinking was, how narrow minded I was being."}, {"time": 10843, "text": "And here was a great physicist with a completely different conception of what life could be."}, {"time": 10848, "text": "And since then, I've seen him attacked in various ways."}, {"time": 10851, "text": "And I'm kind of reluctant to say the attacks make more sense to me than the original story, which is to say, even in terms of information processing, if you're on that scale and there's a limit to the speed of light, how quickly can something think if you're needing to broadcast across the solar system, it's going to be slow."}, {"time": 10876, "text": "It's not going to hold a conversation with you on the kind of timelines that Fred Hoyle was imagining, at least not by any easy way of doing it, assuming that the speed of light is a limit."}, {"time": 10888, "text": "And then again, you really can't."}, {"time": 10892, "text": "This is something Richard Dawkins argued long ago."}, {"time": 10894, "text": "And I do think he's right."}, {"time": 10896, "text": "There is no other way to generate this level of complexity than natural selection."}, {"time": 10901, "text": "Nothing else can do it."}, {"time": 10902, "text": "You need populations."}, {"time": 10904, "text": "And you need selection in populations and a kind of an isolated interstellar cloud."}, {"time": 10913, "text": "Again, there's unlimited time."}, {"time": 10915, "text": "And maybe there's no problems with distance."}, {"time": 10917, "text": "But you need to have a certain frequency of generational time to generate a serious level of complexity."}, {"time": 10927, "text": "And I just have a feeling it's never going to work."}, {"time": 10931, "text": "Well, as far as we know, so natural selection and evolution is really a powerful tool here on Earth."}, {"time": 10937, "text": "But there could be other mechanisms."}, {"time": 10939, "text": "So I don't know if you're familiar with cellular automata, but complex systems that have really simple components and seemingly move based on simple rules when they're taken as a whole, really interesting complexity emerges."}, {"time": 10956, "text": "I don't know what the pressures on that are."}, {"time": 10958, "text": "It's not really selection, but interesting complexity seems to emerge."}, {"time": 10962, "text": "And that's not well understood exactly why that complexity emerges."}, {"time": 10966, "text": "I think there's a difference between complexity and evolution."}, {"time": 10971, "text": "So some of the work we're doing on the origin of life is thinking about how do genes arise?"}, {"time": 10979, "text": "How does information arise in biology?"}, {"time": 10981, "text": "And thinking about it from the point of view of reacting CO2 with hydrogen, what do you get?"}, {"time": 10986, "text": "Well, what you're going to get is carboxylic acids, then amino acids."}, {"time": 10989, "text": "It's quite hard to make nucleotides."}, {"time": 10993, "text": "And it's possible to make them, and it's been done, and it's been done following this pathway as well."}, {"time": 10998, "text": "But you make trace amounts."}, {"time": 11000, "text": "And so the next question, assuming that this is the right way of seeing the question, which maybe it's just not, but let's assume it is, is, well, how do you reliably make more nucleotides?"}, {"time": 11009, "text": "And how do you become more complex and better at becoming a nucleotide generating machine?"}, {"time": 11015, "text": "And the answer is, well, you need positive feedback loops, some form of autocatalysis."}, {"time": 11020, "text": "So that can work, and we know it happens in biology."}, {"time": 11023, "text": "If this nucleotide, for example, catalyzes CO2 fixation, then you're going to increase the rate of flux through the whole system, and you're going to effectively steepen the driving force to make more nucleotides."}, {"time": 11036, "text": "And this can be inherited because there are forms of membrane heredity that you can have."}, {"time": 11042, "text": "And effectively, if a cell divides in two and it's got a lot of stuff inside it, and that stuff is basically bound as a network which is capable of regenerating itself, then it will inevitably regenerate itself."}, {"time": 11057, "text": "And so you can develop greater complexity."}, {"time": 11061, "text": "But everything that I've said depends on the underlying rules of thermodynamics."}, {"time": 11065, "text": "There is no evolvability about that."}, {"time": 11067, "text": "It's simply an inevitable outcome of your starting point, assuming that you're able to increase the driving force through the system."}, {"time": 11077, "text": "You will generate more of the same."}, {"time": 11078, "text": "You'll expand on what you can do, but you'll never get anything different than that."}, {"time": 11082, "text": "And it's only when you introduce information into that as a gene, as a kind of small stretch of RNA, which can be random stretch, then you get real evolvability."}, {"time": 11095, "text": "Then you get biology as we know it."}, {"time": 11097, "text": "But you also have selection as we know it."}, {"time": 11100, "text": "Yeah, I mean, I don't know how to think about information."}, {"time": 11106, "text": "That's a kind of memory of the system."}, {"time": 11108, "text": "So it's not, yeah, at the local level, it's propagation of copying yourself and changing and improving your adaptability to the environment."}, {"time": 11117, "text": "But if you look at Earth as a whole, it has a kind of memory."}, {"time": 11123, "text": "That's the key feature of it."}, {"time": 11127, "text": "It remembers the stuff it tries."}, {"time": 11130, "text": "Like, if you were to describe Earth, I think evolution is something that we experience as individual organisms."}, {"time": 11141, "text": "That's how the individual organisms interact with each other."}, {"time": 11145, "text": "There's a natural selection."}, {"time": 11147, "text": "But when you look at Earth as an organism in its entirety, how would you describe it?"}, {"time": 11156, "text": "Well, not as an organism."}, {"time": 11157, "text": "I mean, the idea of Gaia is lovely."}, {"time": 11160, "text": "And James Lovelock originally put Gaia out as an organism that had somehow evolved."}, {"time": 11167, "text": "And he was immediately attacked by lots of people."}, {"time": 11170, "text": "And he's not wrong, but he backpedaled somewhat because that was more of a poetic vision than the science."}, {"time": 11180, "text": "The science is now called Earth systems science."}, {"time": 11183, "text": "And it's really about how does the world regulate itself so it remains within the limits which are hospitable to life."}, {"time": 11189, "text": "And it does it amazingly well."}, {"time": 11190, "text": "And it is working at a planetary level of integration, of regulation."}, {"time": 11198, "text": "But it's not evolving by natural selection."}, {"time": 11201, "text": "And it can't because there's only one of it."}, {"time": 11203, "text": "And so it can change over time."}, {"time": 11205, "text": "But it's not evolving."}, {"time": 11206, "text": "All the evolution is happening in the parts of the system."}, {"time": 11210, "text": "Yeah, but it's a self sustaining organism."}, {"time": 11213, "text": "No, it's sustained by the sun."}, {"time": 11216, "text": "Right, so you don't think it's possible to see Earth as its own organism?"}, {"time": 11223, "text": "I think it's poetic and beautiful."}, {"time": 11224, "text": "And I often refer to the Earth as a living planet."}, {"time": 11228, "text": "But it's not, in biological terms, an organism, no."}, {"time": 11234, "text": "If aliens were to visit Earth, what would they notice?"}, {"time": 11240, "text": "What would be the basic unit of light they would notice?"}, {"time": 11244, "text": "Trees, probably."}, {"time": 11245, "text": "I mean, it's green."}, {"time": 11246, "text": "It's green and blue."}, {"time": 11247, "text": "I think that's the first thing you'd notice."}, {"time": 11249, "text": "It stands out from space as being different to any of the other planets."}, {"time": 11253, "text": "So it would notice the trees at first because the green."}, {"time": 11256, "text": "Well, I would."}, {"time": 11256, "text": "I notice the green, yes."}, {"time": 11259, "text": "And then probably notice, figure out the photosynthesis."}, {"time": 11262, "text": "Probably notice cities a second, I suspect, maybe first."}, {"time": 11267, "text": "If they arrived at night, they'd notice cities first, that's for sure."}, {"time": 11270, "text": "Depends the time."}, {"time": 11272, "text": "You write quite beautifully in Transformers."}, {"time": 11275, "text": "Once again, I think you opened the book in this way."}, {"time": 11279, "text": "From space, describing Earth, it's such an interesting idea of what Earth is, you also, I mean, Hitchhiker's Guide, summarizing it as harmless, or mostly harmless."}, {"time": 11293, "text": "It's a beautifully poetic thing."}, {"time": 11295, "text": "You open Transformers with, from space, it looks gray and crystalline, obliterating the blue green colors of the living Earth."}, {"time": 11304, "text": "It is crisscrossed by irregular patterns and convergent striations."}, {"time": 11310, "text": "There's a central amorphous density where these scratches seem lighter."}, {"time": 11315, "text": "This, quote, growth does not look alive, although it has extended out along some lines, and there is something grasping and parasitic about it."}, {"time": 11324, "text": "Across the globe, there are thousands of them, varying in shape and detail, but all of them gray, angular, and organic, spreading."}, {"time": 11334, "text": "Yet at night, they light up, glowing up the dark sky, suddenly beautiful."}, {"time": 11340, "text": "Perhaps these cankers on the landscape are in some sense living."}, {"time": 11345, "text": "There's a controlled flow of energy."}, {"time": 11347, "text": "There must be information and some form of metabolism, some turnover of materials."}, {"time": 11352, "text": "Are they alive?"}, {"time": 11356, "text": "They are cities."}, {"time": 11358, "text": "So is there some sense that cities are living beings?"}, {"time": 11362, "text": "You think aliens would think of them as living beings?"}, {"time": 11364, "text": "Well, it'd be easy to see it that way, wouldn't it?"}, {"time": 11367, "text": "It wakes up at night, they wake up at night."}, {"time": 11370, "text": "Strictly nocturnal, yes."}, {"time": 11373, "text": "I imagine that any aliens that are smart enough to get here would understand that they're not living beings."}, {"time": 11380, "text": "My reason for saying that is that we tend to think of biology in terms of information and forget about cells."}, {"time": 11392, "text": "I was trying to draw a comparison between the cell as a city and the energy flow through the city and the energy flow through cells and the turnover of materials."}, {"time": 11401, "text": "And an interesting thing about cities is that they're not really exactly governed by anybody."}, {"time": 11409, "text": "There are regulations and systems and whatever else, but it's pretty loose."}, {"time": 11416, "text": "They have their own life, their own way of developing over time."}, {"time": 11420, "text": "And in that sense, they're quite biological."}, {"time": 11423, "text": "There was a plan after the great fire of London."}, {"time": 11427, "text": "Christopher Wren was making plans not only for St. Paul's Cathedral, but also to rebuild in large Parisian type boulevards, a large part of the area of central London that was burned."}, {"time": 11440, "text": "And it never happened because they didn't have enough money, I think."}, {"time": 11444, "text": "But it's interesting what was in the plan."}, {"time": 11445, "text": "There were all these boulevards that were built in the middle of the city."}, {"time": 11448, "text": "It's interesting what was in the plan."}, {"time": 11450, "text": "There were all these boulevards, but there were no pubs and no coffee houses or anything like that."}, {"time": 11456, "text": "And the reality was London just kind of grew up in a set of jumbled streets."}, {"time": 11463, "text": "And it was the coffee houses and the pubs where all the business of the city of London was being done."}, {"time": 11467, "text": "And that was where the real life of the city was."}, {"time": 11469, "text": "And no one had planned it."}, {"time": 11470, "text": "The whole thing was unplanned and works much better that way."}, {"time": 11473, "text": "And in that sense, the cell is completely unplanned, is not controlled by the genes in the nucleus in the way that we might like to think that it is, but it's kind of evolved entity that has the same kind of flux, the same animation, the same life."}, {"time": 11485, "text": "So I think it's a beautiful analogy, but I wouldn't get too stuck with it as a metaphor."}, {"time": 11493, "text": "I disagree with you."}, {"time": 11494, "text": "I think you are so steeped, and actually the entirety of science, the history of science is steeped in a biological framework of thinking about what is life."}, {"time": 11510, "text": "And not just biological, it's very human centric too."}, {"time": 11514, "text": "That human, the human organism is the epitome of life on earth."}, {"time": 11521, "text": "I think there is some deep fundamental way in which a city is a living being in the same way that a human individual can."}, {"time": 11529, "text": "But it doesn't give rise to an offspring city."}, {"time": 11533, "text": "So it doesn't work by natural selection."}, {"time": 11535, "text": "It works by, if anything, memes."}, {"time": 11537, "text": "It works by copying itself conceptually as a mode of being."}, {"time": 11544, "text": "So maybe memes, maybe ideas are the organisms that are really essential to life on earth."}, {"time": 11552, "text": "Maybe it's much more important about the collective aspect of human nature, the collective intelligence than the individual intelligence."}, {"time": 11560, "text": "Maybe the collective humanity is the organism."}, {"time": 11563, "text": "And the thing that defines the collective intelligence of humanity is the ideas."}, {"time": 11570, "text": "And maybe the way that manifests itself is cities, maybe, or societies or geographically concentrated societies or nations and all that kind of stuff."}, {"time": 11579, "text": "I mean, from an alien perspective, it's possible that that is the more deeply noticeable thing, not from a place of ignorance."}, {"time": 11588, "text": "What's noticeable doesn't tell you how it works."}, {"time": 11592, "text": "I think, I mean, I don't have any problem with what you're saying really, except that it's not possible without the humans."}, {"time": 11600, "text": "You know, we went from a hunter gatherers type economy, if you like, without cities to cities."}, {"time": 11608, "text": "And as soon as we get into human evolution and culture and society and so on, then yes, there are other forms of evolution, other forms of change."}, {"time": 11618, "text": "But cities don't directly propagate themselves, they propagate themselves through human societies and human societies only exist because humans as individuals propagate themselves."}, {"time": 11628, "text": "So there's a kind of, there is a hierarchy there and without the humans in the first place, none of the rest of it exists."}, {"time": 11634, "text": "So do you, life is primarily defined by the basic unit on which evolution can operate?"}, {"time": 11641, "text": "I think it's a really important thing, yes."}, {"time": 11645, "text": "And we don't know, we don't have any other better ideas than evolution for how to create life."}, {"time": 11650, "text": "I never came across a better idea than evolution."}, {"time": 11653, "text": "I mean, maybe I'm just ignorant and I don't know."}, {"time": 11655, "text": "And there's, you know, you mentioned that's no automator and so on, and I don't think specifically about that, but I have thought about it in terms of selective units of the origin of life and the difference between evolvability and complexity or just increasing complexity, but within very narrow, narrowly defined limits."}, {"time": 11675, "text": "The great thing about genes and about selection is it just knocks down all those limits."}, {"time": 11681, "text": "It gives you a world of information in the end which is limited only by the biophysical reality of what kind of an organism you are, what kind of a planet you live on and so on."}, {"time": 11692, "text": "And cities and all these other forms that look alive and could be described as alive because they can't propagate themselves can only exist as the product of something that did propagate itself."}, {"time": 11707, "text": "I mean, there's a deeply compelling truth to that kind of way of looking at things, but I just hope that we don't miss the giant cloud among us."}, {"time": 11718, "text": "I kind of hope that I'm wrong about a lot of this because I can't say that my worldview is particularly uplifting, but in some sense, it doesn't matter if it's uplifting or not."}, {"time": 11729, "text": "Science is about what's reality, what's out there, why is it this way?"}, {"time": 11735, "text": "And I think there's beauty in that too."}, {"time": 11739, "text": "There's beauty in darkness."}, {"time": 11741, "text": "You write about life and death sort of at the biological level."}, {"time": 11746, "text": "Does the question of suicide, why live, does the question of why the human mind is capable of depression, are you able to introspect that from a place of biology?"}, {"time": 11760, "text": "Why our minds, why we humans can go to such dark places?"}, {"time": 11765, "text": "Why can we commit suicide?"}, {"time": 11768, "text": "Why can we go suffer, suffer period, but also suffer from a feeling of meaninglessness of going to a dark place that depression can take you?"}, {"time": 11783, "text": "Is this a feature of life or is it a bug?"}, {"time": 11791, "text": "I mean, if it's a feature of life, then I suppose it would have to be true of other organisms as well."}, {"time": 11795, "text": "And I don't know, we were talking about dogs earlier on and they can certainly be very sad and upset and may mooch for days after their owner died or something like that."}, {"time": 11807, "text": "So I suspect in some sense it's a feature of biology."}, {"time": 11810, "text": "It's probably a feature of mortality."}, {"time": 11814, "text": "It's probably a, but beyond all of that, I mean, I guess there's two ways you could come at it."}, {"time": 11821, "text": "There's one of them would be to say, well, you can effectively do the math and come to the conclusion that it's all pointless and that there's really no point in me being here any longer."}, {"time": 11834, "text": "And maybe that's true in the greater scheme of things."}, {"time": 11837, "text": "You can justify yourself in terms of society, but society will be gone soon enough as well."}, {"time": 11842, "text": "And you end up with a very bleak place just by logic."}, {"time": 11846, "text": "In some sense, it's surprising that we can find any meaning at all."}, {"time": 11850, "text": "Well, maybe this is where consciousness comes in that we have transient joy, but with transient joy, we have transient misery as well."}, {"time": 11857, "text": "And sometimes with everything in biology, getting the regulation right is practically impossible."}, {"time": 11865, "text": "You will always have a bell shaped curve where some people unfortunately are at the joy end and some people are at the misery end."}, {"time": 11872, "text": "And that's the way brains are wired."}, {"time": 11875, "text": "And I doubt there's ever an escape from that."}, {"time": 11878, "text": "It's the same with sex and everything else as well."}, {"time": 11880, "text": "We're dealing with, you can't regulate it."}, {"time": 11884, "text": "So anything goes, it's all part of biology."}, {"time": 11892, "text": "Amen to that."}, {"time": 11893, "text": "Let me, on writing in your book, Power, Sex and Suicide."}, {"time": 11901, "text": "First of all, can I just read off the books you've written?"}, {"time": 11904, "text": "If there's any better titles and topics to be covered, I don't know what they are."}, {"time": 11908, "text": "It makes me look forward to whatever you're going to write next."}, {"time": 11911, "text": "I hope there's things you write next."}, {"time": 11914, "text": "So first you wrote oxygen, the molecule that made the world as we've talked about this idea of the role of oxygen in life on earth."}, {"time": 11921, "text": "Then wait for it, power, sex, suicide, mitochondria and the meaning of life."}, {"time": 11928, "text": "Then life ascending, the 10 great inventions of evolution."}, {"time": 11932, "text": "The vital question, the first book I've read of yours, the vital question, why is life the way it is?"}, {"time": 11938, "text": "And the new book, Transformer, the deep chemistry of life and death."}, {"time": 11943, "text": "In Power, Sex and Suicide, you write about writing or about a lot of things, but I have a question about writing."}, {"time": 11953, "text": "You write, in The Hitchhiker's Guide to the Galaxy, Ford Perfect spends 15 years researching his revision to the guide's entry on the earth, which originally read harmless."}, {"time": 11966, "text": "By the way, I would also as a side quest, as a side question would like to ask you what would be your summary of what earth is."}, {"time": 11974, "text": "You write, his long essay on the subject is edited down by the guide to read mostly harmless."}, {"time": 11981, "text": "I suspect that too many new editions suffer similar fate, if not through absurd editing decisions, at least through a lack of meaningful change in content."}, {"time": 11991, "text": "As it happens, nearly 15 years have passed since the first edition of Power, Sex, Suicide was published and I am resisting the temptation to make any lame revisions."}, {"time": 12002, "text": "Some say that even Darwin lessened the power of his arguments in The Origin of Species through his multiple revisions, in which he dealt with criticisms and sometimes shifted his views in the wrong direction."}, {"time": 12016, "text": "I prefer my original to speak for itself, even if it turns out to be wrong."}, {"time": 12023, "text": "Let me ask the question about writing, both your students in the academic setting, but also writing some of the most brilliant writings on science and humanity I've ever read."}, {"time": 12033, "text": "What's the process of writing?"}, {"time": 12036, "text": "How do you advise other humans?"}, {"time": 12043, "text": "If you were to talk to young Darwin or the young you and just young anybody and give advice about how to write and how to write well about these big topics, what would you say?"}, {"time": 12056, "text": "I mean, I suppose there's a couple of points."}, {"time": 12059, "text": "One of them is what's the story?"}, {"time": 12063, "text": "What do I want to know?"}, {"time": 12064, "text": "What do I want to convey?"}, {"time": 12066, "text": "Why does it matter to anybody?"}, {"time": 12068, "text": "And very often the biggest, most interesting questions, the childlike questions are the one actually that everybody wants to ask, but dents quite, do it in case they look stupid."}, {"time": 12084, "text": "And one of the nice things about being in science is the longer you're in, the more you realize that everybody doesn't know the answer to these questions and it's not so stupid to ask them after all."}, {"time": 12096, "text": "So trying to ask the questions that I would have been asking myself at the age of 15, 16, when I was really hungry to know about the world and didn't know very much about it and wanted to go to the edge of what we know, but be helped to get there."}, {"time": 12118, "text": "I don't want to be too much terminology."}, {"time": 12121, "text": "And so I want someone to keep a clean eye on what the question is."}, {"time": 12127, "text": "Beyond that, I've wondered a lot about who am I writing for?"}, {"time": 12133, "text": "And that was in the end, the only answer I had was myself at the age of 15 or 16, because even if you just don't know who's reading, but also where are they reading it?"}, {"time": 12147, "text": "Are they reading it in the bath or in bed or on the Metro or listening to an audio book?"}, {"time": 12154, "text": "Do you want to have a recapitulation every few pages because you read three pages at a time or are you really irritated by that?"}, {"time": 12164, "text": "You're going to get criticism from people who are irritated by what you're doing."}, {"time": 12168, "text": "And you don't know who they are or what you're going to do that's going to irritate people."}, {"time": 12171, "text": "And in the end, all you can do is just try and please yourself."}, {"time": 12177, "text": "And that means, well, what are these big fun, fascinating and big questions?"}, {"time": 12183, "text": "And what do we know about it?"}, {"time": 12184, "text": "And can I convey that?"}, {"time": 12187, "text": "And I kind of learned in trying to write, first of all, say what we know."}, {"time": 12194, "text": "And I was shocked in the first couple of books how often I came up quickly against all the stuff we don't know."}, {"time": 12201, "text": "And if you're trying to, I've realized later on in supervising various physicists and mathematicians who are PhD students, their maths is way beyond what I can do."}, {"time": 12214, "text": "But the process of trying to work out what are we actually going to model here?"}, {"time": 12217, "text": "What's going into this equation?"}, {"time": 12219, "text": "It's a very similar one to writing."}, {"time": 12220, "text": "What am I going to put on a page?"}, {"time": 12222, "text": "What's the simplest possible way I can encapsulate this idea?"}, {"time": 12225, "text": "So that I now have it as a unit that I can kind of see how it interacts with the other units."}, {"time": 12230, "text": "And you realize that, well, if this is like that and this is like this, then that can't be true."}, {"time": 12238, "text": "So you end up navigating your own path through this landscape."}, {"time": 12242, "text": "And that can be thrilling because you don't know where it's going."}, {"time": 12245, "text": "And I'd like to think that that's one of the reasons my books have worked for people because this sense of the thrilling adventure ride that I don't know where it's going either."}, {"time": 12254, "text": "So finding the simplest possible way to explain the things we know and the simplest possible way to explain the things we don't know and the tension between those two."}, {"time": 12262, "text": "And that's where the story emerges."}, {"time": 12265, "text": "What about the edit?"}, {"time": 12267, "text": "Do you find yourself to the point of this, you know, editing down to mostly harmless?"}, {"time": 12276, "text": "To arrive at simplicity, do you find the edit is productive or does it destroy the magic that was originally there?"}, {"time": 12284, "text": "No, I usually find, I think I'm perhaps a better editor than I am a writer."}, {"time": 12288, "text": "I write and rewrite and rewrite and rewrite."}, {"time": 12291, "text": "Put a bunch of crap on the page first and then see the edit where it takes you."}, {"time": 12295, "text": "Yeah, but then there's the professional editors who come along as well."}, {"time": 12299, "text": "And I mean, in Transformer, the editor came back to me after I'd sent him, two months after I sent the first edition, he'd read the whole thing and he said, the first two chapters prevent a formidable hurdle to the general reader."}, {"time": 12314, "text": "Go and do something about it."}, {"time": 12316, "text": "And that was the last thing I really wanted to do."}, {"time": 12318, "text": "Your editor sounds very eloquent in speech."}, {"time": 12321, "text": "Yeah, well, this was an email, but I thought about it, you know, the bottom line is he was right."}, {"time": 12328, "text": "And so I put the whole thing aside for about two months, spent the summer, this would have been, I guess last summer, and then turned to it with full attention in about September or something and rewrote those chapters almost from scratch."}, {"time": 12342, "text": "I kept some of the material, but it took me a long time to process it, to work out what needs to change, where does it need to, I wasn't writing in this time."}, {"time": 12351, "text": "How am I going to tell this story better so it's more accessible and interesting?"}, {"time": 12354, "text": "And in the end, I think it worked."}, {"time": 12356, "text": "It's still difficult."}, {"time": 12358, "text": "It's still biochemistry, but it has, he ended up saying, now he's got a barreling energy to it."}, {"time": 12363, "text": "And I was, you know, because he'd been, because he'd told me the truth the first time, I decided to believe that he was telling me the truth the second time as well and was delighted."}, {"time": 12373, "text": "Could you give advice to young people in general, folks in high school, folks in college, how to take on some of the big questions you've taken on?"}, {"time": 12383, "text": "Now you've done that in the space of biology and expanded out."}, {"time": 12386, "text": "How can they have a career they can be proud of or have a life they can be proud of?"}, {"time": 12395, "text": "Gosh, that's a big question."}, {"time": 12400, "text": "I'm sure you've gathered some wisdom that you can impart."}, {"time": 12404, "text": "Yeah, so the only advice that I actually ever give to my students is follow what you're interested in because they're often worried that if they make this decision now and do this course instead of that course, then they're going to restrict their career opportunities and there isn't a career path in science."}, {"time": 12428, "text": "It's not, I mean, there is, but there isn't."}, {"time": 12432, "text": "There's a lot of competition, there's a lot of death symbolically."}, {"time": 12437, "text": "So who survives?"}, {"time": 12439, "text": "The people who survive are the people who care enough to still do it."}, {"time": 12445, "text": "And they're very often the people who don't worry too much about the future and are able to live in the present."}, {"time": 12453, "text": "Because if you do a PhD, you've competed hard to get onto the PhD, then you have to compete hard to get a postdoc job and you have the next one maybe on another continent and it's only two years anyway."}, {"time": 12466, "text": "And so, and there's no guarantee you're going to get a faculty position at the end of it."}, {"time": 12473, "text": "And there's always the next step to compete."}, {"time": 12474, "text": "If you get a faculty position, you get a tenure and with tenure go full professor and full professor, then you go to some kind of, whatever the discipline is, there's an award."}, {"time": 12484, "text": "If you're in physics, you're always competing for the Nobel Prize."}, {"time": 12486, "text": "There's different awards."}, {"time": 12488, "text": "And then eventually you're all competing to, I mean, there's always a competition."}, {"time": 12492, "text": "So there is no happiness."}, {"time": 12493, "text": "Happiness does not lie."}, {"time": 12494, "text": "If you're looking into the future, yes."}, {"time": 12496, "text": "And if what you're caring about is a career, then it's probably not the one for you."}, {"time": 12502, "text": "If though you can put that aside, and I've also worked in industry for a brief period and I was made redundant twice."}, {"time": 12510, "text": "So I know that."}, {"time": 12512, "text": "You know, there's no guarantee that you've got a career that way either."}, {"time": 12518, "text": "So, so live in the moment and try and enjoy what you're doing."}, {"time": 12524, "text": "And that means really go to the, go to the themes that you're most interested in and try and follow them as well as you can."}, {"time": 12532, "text": "And that tends to pay back in surprising ways."}, {"time": 12537, "text": "I don't know if you've found this as well, but I found that people will help you often."}, {"time": 12544, "text": "If they see some light shining in the eye, you're excited about their subject and you know, just want to talk about it."}, {"time": 12555, "text": "And they know that their friend in California has got a job coming up."}, {"time": 12559, "text": "They'll say, go for this, this guy's all right."}, {"time": 12561, "text": "You know, they'll use the network to help you out if you really care."}, {"time": 12567, "text": "And you're not gonna have a job two years down the line, but if what you really care about is what you're doing now, then it doesn't matter if you have a job in two years time or not."}, {"time": 12575, "text": "It'll work itself out if you've got the light in your eye."}, {"time": 12579, "text": "And so that's the only advice I can give."}, {"time": 12582, "text": "And most people probably drop out through that system because the fight is just not worth it for them."}, {"time": 12589, "text": "Yeah, when you have the light in your eye, when you have the excitement for the thing, what happens is you start to surround yourself with others that are interested in that same thing, that also have the light."}, {"time": 12599, "text": "If you really are rigorous about this because I think it does take, it doesn't, it takes effort to make."}, {"time": 12607, "text": "Oh, you've got to be obsessive."}, {"time": 12608, "text": "But if you're doing what you really love doing, then it's not work anymore, it's what you do."}, {"time": 12613, "text": "Yeah, but I also mean the surrounding yourself with other people that are obsessed about the same thing because depending on."}, {"time": 12619, "text": "Oh, that takes some work as well, yes."}, {"time": 12621, "text": "And luck."}, {"time": 12621, "text": "Finding the right, yeah, finding the right mentors, the collaborators, because I think one of the problem with the PhD process is people are not careful enough in picking their mentors."}, {"time": 12634, "text": "Those are people, mentors and colleagues and so on, those are people who are gonna define the direction of your life, how much you love a thing, how much, I mean the power of just like the few little conversations you have in the hallway, it's incredible."}, {"time": 12652, "text": "So you have to be a little bit careful in that."}, {"time": 12655, "text": "Sometimes you just get randomly almost assigned, really pursue, I suppose, the subject as much as you pursue the people that do that subject."}, {"time": 12667, "text": "So like both, the whole dance of it."}, {"time": 12669, "text": "They kind of go together really."}, {"time": 12670, "text": "Yeah, they really do."}, {"time": 12671, "text": "But take that part seriously."}, {"time": 12674, "text": "And probably in the way you're describing it, careful how you define success."}, {"time": 12682, "text": "You'll never find happiness in success."}, {"time": 12684, "text": "There's a lovely quote from Robert Louis Stevenson, I think, who said, nothing in life is so disenchanting as attainment."}, {"time": 12693, "text": "Yeah, so I mean, in some sense, the true definition of success is getting to do today what you really enjoy doing."}, {"time": 12703, "text": "Just what fills you with joy."}, {"time": 12706, "text": "And that's ultimately success."}, {"time": 12708, "text": "So success isn't the thing beyond the horizon, the big trophy, the financials."}, {"time": 12714, "text": "I think it's as close as we can get to happiness."}, {"time": 12717, "text": "That's not to say you're full of joy all the time, but it's as close as we can get to a sustained human happiness is by getting some fulfillment from what you're doing on a daily basis."}, {"time": 12726, "text": "And if what you're looking for is the world giving you the stamp of approval with a Nobel Prize or a fellowship or whatever it is, then I've known people like this who, they're eaten away by the anger, the kind of caustic resentment that they've not been awarded this prize that they deserve."}, {"time": 12751, "text": "And the other way, if you put too much value into those kinds of prizes and you win them, I've gotten a chance to see that it also, the more quote unquote successful you are in that sense, the more you run the danger of growing ego so big that you don't get to actually enjoy the beauty of this life."}, {"time": 12776, "text": "You start to believe that you figured it all out as opposed to, I think what ultimately the most fun thing is is being curious about everything around you, being constantly surprised, and these little moments of discovery of enjoying beauty in small and big ways all around you."}, {"time": 12792, "text": "And I think the bigger your ego grows, the more you start to take yourself seriously, the less you're able to enjoy that."}, {"time": 12797, "text": "Amen to that, I couldn't agree more."}, {"time": 12800, "text": "So the summary from harmless to mostly harmless in Hitchhiker's Guide to the Galaxy, how would you try to summarize Earth?"}, {"time": 12811, "text": "And if you were given, if you had to summarize the whole thing in a couple of sentences, and maybe throw in meaning of life in there, like what, why, why, why, maybe, is that a defining thing about humans that we care about the meaning of the whole thing?"}, {"time": 12832, "text": "I wonder if that should be part of the, these creatures seem to be very lost."}, {"time": 12838, "text": "Yes, they're always asking why."}, {"time": 12840, "text": "I mean, that's my defining question is why."}, {"time": 12842, "text": "It was, as people used to make a joke, I have a small scar on my forehead from a climbing accident years ago."}, {"time": 12851, "text": "And the guy I was climbing with had dislodged a rock and he shouted something."}, {"time": 12855, "text": "He shouted below, I think, meaning that the rock was coming down."}, {"time": 12858, "text": "And I hadn't caught what he said, so I looked up and then smashed the street on my forehead."}, {"time": 12863, "text": "And everybody around me took the piss, saying he looked up to ask why."}, {"time": 12873, "text": "But that's a human imperative."}, {"time": 12874, "text": "That's part of what it means to be human."}, {"time": 12877, "text": "Look up to the sky and ask why, and ask why."}, {"time": 12882, "text": "So your question, define the earth."}, {"time": 12889, "text": "I'm not sure I can do that."}, {"time": 12890, "text": "I mean, the first word that comes to mind is living."}, {"time": 12894, "text": "I wouldn't like to say mostly living, but perhaps."}, {"time": 12897, "text": "Mostly living."}, {"time": 12898, "text": "Well, it's interesting because like, if you were to write the Hitchhiker's Guide to the Galaxy, I suppose, say our idea that we talked about, that bacteria is the most prominent form of life throughout the galaxy and the universe."}, {"time": 12917, "text": "I suppose that earth would be kind of unique and would require."}, {"time": 12922, "text": "There's abundance in that case."}, {"time": 12925, "text": "It's profligate, it's rich, it's enormously, enormously living."}, {"time": 12929, "text": "So how would you describe that it's not bacteria?"}, {"time": 12936, "text": "Eukaryotic."}, {"time": 12939, "text": "Well, I mean, that's the technical term, but it is basically it's."}, {"time": 12946, "text": "Yeah, and then."}, {"time": 12947, "text": "How would I describe that?"}, {"time": 12949, "text": "I've actually really struggled with that term because the word, I mean, there's few words quite as good as eukaryotic to put everybody off immediately."}, {"time": 12958, "text": "You start using words like that and they'll leave the room."}, {"time": 12961, "text": "A Krebs cycle is another one that gets people to leave the room, but so I've tried to think, is there another word for eukaryotic that I can use?"}, {"time": 12970, "text": "And really the only word that I've been able to use is complex, complex cells, complex life and so on."}, {"time": 12978, "text": "And that word, it serves one immediate purpose, which is to convey an impression."}, {"time": 12986, "text": "But then it means so many different things to everybody that actually is lost immediately."}, {"time": 12993, "text": "And so it's kind of."}, {"time": 12996, "text": "Well, that's a noticeable from the perspective of other planets, that is a noticeable phase transition of complexity is the eukaryotic."}, {"time": 13006, "text": "What about the harmless and the mostly harmless?"}, {"time": 13009, "text": "Is that kind of."}, {"time": 13011, "text": "Probably accurate on a universal kind of scale."}, {"time": 13015, "text": "I don't think that humanity is in any danger of disturbing the universe at the moment."}, {"time": 13022, "text": "At the moment, which is why the mostly, we don't know."}, {"time": 13026, "text": "Depends what Elon is up to, depends how many rockets."}, {"time": 13030, "text": "It'll be still even then a while, I think, before we disturb the fabric of time and space."}, {"time": 13037, "text": "Was the aforementioned Andrej Karpathy, I think he summarized Earth as a system where you hammer it with a bunch of photons."}, {"time": 13050, "text": "The input is like photons and the output is rockets."}, {"time": 13055, "text": "If you just."}, {"time": 13057, "text": "Well, that's a hell of a lot of photons before there was a rocket launch."}, {"time": 13060, "text": "But like, you know, maybe in the span of the universe, it's not that much time."}, {"time": 13066, "text": "And so, and I do wonder, you know, what the future is, whether we're just in the early beginnings of this Earth, which is important when you try to summarize it, or we're at the end, where humans have finally gained the ability to destroy the entirety of this beautiful project we've got going on."}, {"time": 13086, "text": "Not with nuclear weapons, with engineered viruses, with all those kinds of things."}, {"time": 13090, "text": "Or just inadvertently through global warming and pollution and so on."}, {"time": 13095, "text": "We're quite capable of that."}, {"time": 13095, "text": "I mean, we just need to pass the tipping point."}, {"time": 13098, "text": "I mean, I think we're more likely to do it inadvertently than through a nuclear war, which could happen at any time."}, {"time": 13104, "text": "But my fear is we just don't know where the tipping points are."}, {"time": 13111, "text": "And we will, we kind of think we're smart enough to fix the problem quickly if we really need to."}]}]