[{"title": "Bishop Robert Barron: Christianity and the Catholic Church | Lex Fridman Podcast #304", "id": "WgytXF0SPh0", "quotes": [{"time": 252, "text": "I always like Aquinas who says the language about God that we use is analogical."}, {"time": 257, "text": "So it's not univocal, meaning what I say about that can or about this bottle, I can say about God."}, {"time": 263, "text": "No, that makes God an entity."}, {"time": 265, "text": "At the same time, it's not simply equivocal."}, {"time": 268, "text": "So if I say, well, that thing is and God is, I mean totally different things."}, {"time": 273, "text": "No, no, I mean something analogous."}, {"time": 276, "text": "So to be God is to be, to be."}, {"time": 278, "text": "So the real meaning of being is the being of God."}, {"time": 282, "text": "The being of that thing or this thing, or the being of galaxies or subatomic particles would be analogous to God's manner of being."}, {"time": 290, "text": "So on that basis, I can make some statements."}, {"time": 293, "text": "I can, I can theorize."}, {"time": 296, "text": "And even at the limit, as you suggest, I can visualize."}, {"time": 299, "text": "So we have metaphors for God, and the Bible is replete with those, right?"}, {"time": 304, "text": "So God is a rock."}, {"time": 306, "text": "You know, God's like a lion."}, {"time": 307, "text": "God's like this and that."}, {"time": 308, "text": "Or the Bible will sometimes imagine God as a human being walking around, you know."}, {"time": 314, "text": "Now, only the crudest fundamentalism would say, well, that's a univocal, accurate description of God."}, {"time": 320, "text": "It's an image that's catching something of God's manner of being."}, {"time": 325, "text": "Then what does it mean to believe in God?"}, {"time": 331, "text": "So there's a word, and we have to limit ourselves to human interpretable words today."}, {"time": 337, "text": "There's a word called faith."}, {"time": 339, "text": "What does faith mean?"}, {"time": 340, "text": "So if we can't really directly know God, you kind of sneak up to the idea of God with metaphors."}, {"time": 350, "text": "Better he sneaks up on us."}, {"time": 351, "text": "Because I like the language of grace."}, {"time": 353, "text": "God's action comes first."}, {"time": 355, "text": "So if I stay perfectly within the realm of I'm seeking with my kind of eagle eyes and my inquiring mind, I'm not gonna find God that way."}, {"time": 366, "text": "I might find a path that opens up."}, {"time": 369, "text": "But I would say finally God finds me, and I think then the language of faith begins to make more sense."}, {"time": 376, "text": "I'm with Paul Tillich, though, the Protestant theologian, said the most misunderstood word in the religious vocabulary is faith."}, {"time": 382, "text": "Because he said the way we take it usually is something subrational."}, {"time": 386, "text": "You know, I have proof of this."}, {"time": 389, "text": "I really know this, and I only kind of believe that."}, {"time": 392, "text": "Like, that's just a personal opinion or impression."}, {"time": 395, "text": "But that's to identify faith with the kind of infrarational."}, {"time": 400, "text": "And that's not it."}, {"time": 401, "text": "I mean, I don't want something infrarational."}, {"time": 403, "text": "I don't want superstition or childish credulity."}, {"time": 407, "text": "So authentic faith is the darkness beyond reason and on the far side of reason."}, {"time": 412, "text": "It's super irrational, not infrarational."}, {"time": 415, "text": "And that's a very important move."}, {"time": 418, "text": "At the limit of what I can know, at the limit of my striving and my vision, there's this horizon that opens up."}, {"time": 424, "text": "And I think that's true even in ordinary ways of knowing."}, {"time": 428, "text": "There's a kind of a horizon that lures us beyond what I've got."}, {"time": 431, "text": "Faith has to do more with that kind of darkness rather than a darkness prior to reason."}, {"time": 438, "text": "The darkness beyond the horizon prior to reason, first of all, the poetry of your language is incredible."}, {"time": 444, "text": "To be, to be, I have a million questions."}, {"time": 447, "text": "Yeah, go ahead."}, {"time": 448, "text": "I do too on this."}, {"time": 450, "text": "So first of all, let me just jump around."}, {"time": 452, "text": "You mentioned to be, to be a few times."}, {"time": 456, "text": "Well, to be me is to be a human being, right?"}, {"time": 459, "text": "To be this is to be a table, to be this is to be a microphone."}, {"time": 461, "text": "So it's, I'll use Aquinas's language."}, {"time": 464, "text": "It's the act of being poured, if you want, into the receptacle of some essential principle."}, {"time": 470, "text": "So it's got an ontological structure."}, {"time": 472, "text": "It's an existent, it's a thing that exists, but it's existing in a limited way according to an essential principle."}, {"time": 481, "text": "So God, so what's God?"}, {"time": 484, "text": "What's God's name?"}, {"time": 485, "text": "What kind of being is he?"}, {"time": 487, "text": "We'll go back to Moses now."}, {"time": 490, "text": "When the Israelites asked me, you know, what's your name?"}, {"time": 493, "text": "What should I tell them?"}, {"time": 494, "text": "And he says, you know, famously, I am who I am."}, {"time": 497, "text": "But see, Aquinas reads that as a very accurate remark."}, {"time": 500, "text": "So Moses is wondering, okay, there's a lot of gods and there's a lot of things, a lot of entities."}, {"time": 505, "text": "Well, which one are you?"}, {"time": 506, "text": "You gotta be one of them."}, {"time": 507, "text": "So tell me your name."}, {"time": 509, "text": "In philosophical language, give me the essence that receives your act of existing, right?"}, {"time": 514, "text": "And God's answer blows the mind of Moses and the whole tradition."}, {"time": 518, "text": "I am who I am."}, {"time": 520, "text": "To be God is to be."}, {"time": 523, "text": "So I'm not this or that."}, {"time": 524, "text": "I'm not up or down."}, {"time": 525, "text": "I'm not here or there."}, {"time": 526, "text": "God is that whose center is everywhere and whose circumference is nowhere, as the mystics put it."}, {"time": 531, "text": "Now, can I get a clear and distinct idea of that?"}, {"time": 534, "text": "No, and in a way, that's the whole point."}, {"time": 536, "text": "If I could, I'd be talking about a being of some kind."}, {"time": 540, "text": "So to be God is to be."}, {"time": 541, "text": "To be is to, and that's, you know, Moses, take off your sandals, you're on holy ground."}, {"time": 546, "text": "So I'm gonna go over confidently and find out what this thing is, this burning bush."}, {"time": 549, "text": "I'm gonna find out."}, {"time": 552, "text": "Take off your shoes, you're on holy ground because you're not in charge here."}, {"time": 556, "text": "You're not in command."}, {"time": 557, "text": "Because if you've got shoes on, you can walk wherever you want."}, {"time": 561, "text": "You can walk with confidence."}, {"time": 562, "text": "But you take your shoes off, you're much more vulnerable."}, {"time": 566, "text": "And that's appropriate when you're talking about God."}, {"time": 569, "text": "But here's another interesting thing."}, {"time": 570, "text": "I didn't think about the burning bush in this connection before, but it's a bush that's on fire but not consumed."}, {"time": 579, "text": "Beings are competitive with each other."}, {"time": 581, "text": "And so these can't be in the same place at the same time, these two beings."}, {"time": 584, "text": "They're mutually exclusive if you want."}, {"time": 588, "text": "But as God comes close to a creature, he doesn't destroy it or consume it."}, {"time": 595, "text": "But the creature becomes more beautiful and more radiant, right?"}, {"time": 599, "text": "And see, compare it to the classical gods and goddesses."}, {"time": 603, "text": "When they come bursting into life and experience, things are incinerated and people give way and they're overwhelmed."}, {"time": 610, "text": "Then there's this biblical idea of God comes close and sets things on fire but doesn't burn them up."}, {"time": 617, "text": "And that's because he's not a competitive being in the world."}, {"time": 620, "text": "If he were a big being, then he'd be competing for space, so to speak, on the same ontological grid."}, {"time": 627, "text": "But he's not like that."}, {"time": 630, "text": "So God can come close and we come more fully alive."}, {"time": 635, "text": "Now we're starting to gesture toward the incarnation, I mean, the central Christian doctrine, that God can actually become a human without overwhelming the human he becomes, right?"}, {"time": 645, "text": "So I mean, that's kind of the next step."}, {"time": 647, "text": "But the basic idea of God is noncompetitively transcendent to the world."}, {"time": 653, "text": "That's another way to get at it."}, {"time": 654, "text": "Noncompetitively transcendent to the world so as beyond being as the source of being."}, {"time": 663, "text": "Let me make it maybe more imagistic."}, {"time": 666, "text": "I think a really good analogy would be author to book."}, {"time": 670, "text": "Right, so like Tolkien or someone that writes one of these big sprawling novels."}, {"time": 676, "text": "And Tolkien's good too because he creates a whole world."}, {"time": 678, "text": "He creates a new nature, a new language, new history, all that, think of the thousands of characters and the plots and subplots and all of it."}, {"time": 686, "text": "Tolkien is utterly responsible for every bit of that story, right?"}, {"time": 691, "text": "Every character, every plot, every subplot, every description, he's completely responsible."}, {"time": 696, "text": "He's involved in every nook and cranny of it."}, {"time": 699, "text": "But he's not in the story, he's not in the book."}, {"time": 703, "text": "You're not gonna find him as a character in the book."}, {"time": 705, "text": "So that's the category mistake of the atheist in a way is I'm looking for God, he's a character in this story somewhere."}, {"time": 711, "text": "No, he's the author of the story."}, {"time": 714, "text": "Mysteriously present to every aspect of the story, but not a character in it."}, {"time": 720, "text": "Right, he is deeply in the story somehow."}, {"time": 723, "text": "He's present, but he's not, even if he is a character, he's not really, the full embodiment is not a character."}, {"time": 733, "text": "And people inside the book can't really know about the author."}, {"time": 739, "text": "No, right."}, {"time": 739, "text": "Well, see, Augustine says, God is simultaneously intime or intimo meo et superior sumo meo."}, {"time": 746, "text": "He's closer to me than I am to myself, and he's higher than anything I could possibly imagine at the same time."}, {"time": 754, "text": "But see, once you get the insight that God is the sheer act of to be, well, of course that's true."}, {"time": 760, "text": "So right now, God is sustaining us in existence."}, {"time": 766, "text": "Aquinas says, God is in all things by essence, presence, and power, and most intimately so."}, {"time": 773, "text": "And he's nowhere in this room."}, {"time": 776, "text": "Okay, well, where's God?"}, {"time": 778, "text": "He's nowhere in this room."}, {"time": 779, "text": "He's totaliter aliter, we say."}, {"time": 782, "text": "He's totally other."}, {"time": 783, "text": "Same time."}, {"time": 785, "text": "But once you crack that code, though, I think you see it of why that would be true."}, {"time": 789, "text": "And see, now I'm getting from more philosophical language to more mystical language, because all the mystics talk that way in these high paradoxes about God's availability and unavailability."}, {"time": 800, "text": "I've often thought in the Bible, story after story, God can neither be grasped nor hidden from."}, {"time": 810, "text": "So the first sinful instinct is to grasp at God."}, {"time": 812, "text": "I've got him, I understand him, I can manipulate him."}, {"time": 817, "text": "Story after story is told, you can't do that."}, {"time": 819, "text": "Well, then the other extreme of the sinner, all right, then I'm gonna run from God."}, {"time": 823, "text": "I'm gonna avoid God."}, {"time": 825, "text": "Jonah and the whale, so he has the call from God, and he said, no, no, I'm gonna refuse that."}, {"time": 831, "text": "I'm gonna run as far away."}, {"time": 833, "text": "I'm gonna go to Tarshish, which meant Timbuktu for them, at the end of the world."}, {"time": 838, "text": "God's got the whale, swallows him up, and brings him right back where God wants him."}, {"time": 841, "text": "It's a poetic way of saying you can't escape the press of God."}, {"time": 845, "text": "At the same time, Tower of Babel."}, {"time": 847, "text": "I'm gonna build a tower up to God."}, {"time": 849, "text": "I'm gonna grab hold of God."}, {"time": 851, "text": "No, no, no, you can't do that."}, {"time": 852, "text": "So, live in the space in between those two things, which would be the space of friendship with God, falling in love with God is neither grasping nor hiding from God."}, {"time": 865, "text": "You mentioned, again, a lot of beautiful poetic things."}, {"time": 868, "text": "You mentioned grace."}, {"time": 871, "text": "You mentioned sin."}, {"time": 872, "text": "You mentioned incarnation."}, {"time": 875, "text": "Is there a philosophical, pragmatic way to start talking about the pillars of Christianity?"}, {"time": 880, "text": "What are the defining things that make Christianity to you, and broadly speaking, to those that follow the religion?"}, {"time": 891, "text": "In a way, what we're doing so far is a necessary propaedeutic, because we're talking about God."}, {"time": 898, "text": "What makes Christianity distinctive, of course, is the claim of the incarnation."}, {"time": 901, "text": "So, we come up out of Judaism."}, {"time": 903, "text": "We come up out of this great monotheistic tradition."}, {"time": 906, "text": "And the Bible itself and all the great commentaries within Judaism, I think, would agree with this basic theistic stuff that I've been talking about."}, {"time": 915, "text": "Take Moses Maimonides, for example."}, {"time": 918, "text": "Now, what makes Christianity distinct, this supremely weird claim that God becomes one of us, God becomes a creature, but without ceasing to be God and without overwhelming the integrity of the creature he becomes."}, {"time": 933, "text": "What we see in the burning bush, that principle which obtains across the board, so the closer God comes to me, the more radiant I become, right?"}, {"time": 942, "text": "But take that now to the nth degree, would be what we mean by the incarnation, the incarnation of the Son of God becoming a creature in such a way as to make humanity radiant and beautiful."}, {"time": 957, "text": "That's the pillar of Christianity."}, {"time": 958, "text": "It's the incarnation."}, {"time": 961, "text": "And what follows from that is the redemption of all of reality, so not just of human beings, but in becoming a creature, God divinizes the world."}, {"time": 974, "text": "The Greek fathers always said God became human, that humans might become God."}, {"time": 979, "text": "And that's a good way to sum up, I think, the essence of Christianity."}, {"time": 983, "text": "Why is this such an important thing?"}, {"time": 985, "text": "So it's a distinctive thing, but why is it so important philosophically to what it means to be a Christian?"}, {"time": 994, "text": "What impact did that have on our world, on human civilization, on human nature, on our morals of why live, what to live for, and the meaning of it all?"}, {"time": 1004, "text": "Why is incarnation so important?"}, {"time": 1006, "text": "Well, I think it's massively important because it's the divinization principle that God wants to divinize his creation and sort of in this concentrated point of Jesus of Nazareth."}, {"time": 1016, "text": "But then we talk about the mystical body of Jesus, so that goes right back to Paul."}, {"time": 1020, "text": "As we're grafted onto Christ, we talk about that as the church, we become like cells and molecules in an organism."}, {"time": 1028, "text": "That's the church, it's not an organization, that's a deformation of ecclesiology."}, {"time": 1033, "text": "The church is this organism that begins with Jesus and then he's drawing all of humanity, but ultimately all of nature, all of creation to himself."}, {"time": 1046, "text": "When the Son of Man is lifted up, he will draw all things to himself, that idea of the gathering in of a scattered creation."}, {"time": 1054, "text": "So in that way, it's at the heart of it."}, {"time": 1056, "text": "Then there's all kinds of things."}, {"time": 1057, "text": "If God becomes human, that means there's a dignity to humanity, which goes beyond anything any humanist of any stripe has ever said, right?"}, {"time": 1066, "text": "Ancient, medieval, modern, contemporary."}, {"time": 1070, "text": "Christianity is the greatest humanism imaginable."}, {"time": 1073, "text": "God became one of us in order to divinize us."}, {"time": 1076, "text": "The goal of my life is not just to be a good person, not just to be materially successful, not just to be a member of society."}, {"time": 1085, "text": "The goal of my life is to become a participant in the divine nature."}, {"time": 1089, "text": "And so I don't think there is a humanism greater than that, even conceivably."}, {"time": 1093, "text": "So that's where I think humanism is profoundly influenced by the incarnation."}, {"time": 1100, "text": "And just our notion of God is noncompetitive to us."}, {"time": 1105, "text": "And it's so important, because I think in so many systems from mythology onward, you have these competitive understandings of God."}, {"time": 1112, "text": "When Jesus says to his disciples the night before he dies, I no longer call you servants but friends, it's an extraordinary moment."}, {"time": 1120, "text": "Because every God who's ever been served, well, that's the best we can hope for is that we'll be as the servant of God."}, {"time": 1128, "text": "You know, I'll try to obey you, Lord."}, {"time": 1130, "text": "I'll try to do what you want."}, {"time": 1131, "text": "But when Jesus says, I no longer call you servants or slaves, he would have said in the Greek there, you know."}, {"time": 1138, "text": "But friends, I don't know, I can't imagine anything greater than that, becoming God's friend."}, {"time": 1144, "text": "That's a call to become one with God."}, {"time": 1148, "text": "It's possible to become one with God."}, {"time": 1152, "text": "Now I should mention, you're one of the greatest religious communicators I've ever experienced."}, {"time": 1157, "text": "A huge number of people are fans of yours."}, {"time": 1159, "text": "You've done a lot of great conversations."}, {"time": 1163, "text": "You've done Reddit AMAs, which is a very unique, bold, brave thing."}, {"time": 1169, "text": "And on one of them, somebody asked, what's the most challenging of the seven deadly sins?"}, {"time": 1177, "text": "So first, what are the seven deadly sins?"}, {"time": 1181, "text": "What do they have to do with Christianity?"}, {"time": 1183, "text": "How essential, how crucial they are to the religion?"}, {"time": 1187, "text": "And what's the most challenging in our modern day?"}, {"time": 1191, "text": "Yeah, to name them, pride, envy, anger, sloth, avarice, gluttony, and lust are the seven deadly sins."}, {"time": 1201, "text": "We're called capital sins sometimes, they're the head sins from which things tend to flow."}, {"time": 1207, "text": "The most fundamental is pride."}, {"time": 1211, "text": "Probably most people today, if you talk about like vice, or you talk about a deadly sin, they would think about lust."}, {"time": 1216, "text": "But the classical authors, including Dante, who does this pictorially, that's the least of the deadly sins is lust, because it's the one that's most sort of dependent upon the body and its passions and so on."}, {"time": 1229, "text": "The most important is pride."}, {"time": 1230, "text": "Pride is the deadliest of deadly sins."}, {"time": 1233, "text": "And it's very simple to see why."}, {"time": 1234, "text": "Pride is, Augustine calls it incurvatus in se."}, {"time": 1238, "text": "I'm caved in around myself."}, {"time": 1240, "text": "Like a black hole, right, to get into the scientific."}, {"time": 1244, "text": "But the black hole to me is a great symbol, you know, that it's so heavy that it draws everything, including light."}, {"time": 1250, "text": "Nothing can escape from it."}, {"time": 1252, "text": "See, that's the sinner."}, {"time": 1254, "text": "We're all sinners."}, {"time": 1255, "text": "We're like black holes, that we draw everything into ourselves."}, {"time": 1260, "text": "So as a sinner, and I'll confess I'm a sinner, the temptation is, okay, this is the Bishop Barron moment, and I'm drawing you now into my world and so on."}, {"time": 1273, "text": "What that does is it kills us off, and it darkens life, and it makes it small, and heavy, and awful, right?"}, {"time": 1283, "text": "It's like, but see, compared to the contrasting thing, is when you're lost in a moment, you're not concerned about the impression I'm making."}, {"time": 1293, "text": "You're not concerned about drawing the world into yourself."}, {"time": 1295, "text": "You're not concerned about this monkey on my back that's always telling me, you know, look good and sound right."}, {"time": 1301, "text": "But you're lost in something."}, {"time": 1304, "text": "You're just talking, you know, to a friend, and the two of you together are discovering something true or beautiful."}, {"time": 1310, "text": "You're lost in a movie, or you're lost in a book."}, {"time": 1313, "text": "Those are the best moments in life."}, {"time": 1314, "text": "Those are the best, because they're the least prideful moments, right?"}, {"time": 1318, "text": "That's when the light comes out."}, {"time": 1320, "text": "I become radiant, because I'm overcoming this tendency to fall in on myself."}, {"time": 1328, "text": "Dante is so good, because the way he pictures Satan in Divine Comedy, and you know, he's at the center of the Earth."}, {"time": 1335, "text": "So like a black hole that way, like he's at the center of gravity."}, {"time": 1339, "text": "He's at the heaviest place."}, {"time": 1341, "text": "And there's not fire where he is, but ice, which is a much, much better image, that you're frozen in place, and you're stuck."}, {"time": 1349, "text": "And he's got wings, right?"}, {"time": 1351, "text": "And they used to be angel wings, because he's an angel, but now they're like bat wings for Dante, and they're flapping."}, {"time": 1357, "text": "And all they're doing is making the world around him colder, because he's ice, he's stuck in his own iciness, and then he's beating his wings over the ice, making everyone else colder."}, {"time": 1366, "text": "It's a great image."}, {"time": 1368, "text": "And then he has, this is cool too, he has three faces, Satan, because he's the simulacrum of the Trinity."}, {"time": 1375, "text": "So every sinner thinks he's God."}, {"time": 1377, "text": "So I pretend I'm God."}, {"time": 1378, "text": "So he's got the three faces."}, {"time": 1380, "text": "And from all six eyes, he weeps."}, {"time": 1383, "text": "Also from all three mouths, he's chewing a sinner."}, {"time": 1387, "text": "He's got Cassius, Brutus, and Judas in the three mouths, you know, the three traitors."}, {"time": 1393, "text": "But I thought, it's just a great image of all of us sinners, is we're stuck, it's heavy, it's cold, we're chewing on our past resentments, we're weeping in our sadness, and we're making the world around us colder."}, {"time": 1409, "text": "It's beautiful, it's great."}, {"time": 1410, "text": "So that's pride."}, {"time": 1411, "text": "See, that's an image of pride, because Satan, that's his great sin, pride, which is why he needed Michael, right, Mikael, who's like God, so that the great challenge to him, which we need all the time, is someone to say, wait a minute, wait a minute, you're not God."}, {"time": 1426, "text": "But the minute we say, I'm God, whew, black hole, I now cave in on myself, I suck everything into myself, and I turn into Dante Satan."}, {"time": 1437, "text": "So that's a great image, that's pride."}, {"time": 1439, "text": "That's the most fundamental."}, {"time": 1441, "text": "That's the uber capital sin."}, {"time": 1444, "text": "All the other ones flow from that, in a way."}, {"time": 1446, "text": "So in general, empathy, humility, compassion, love thy neighbor, is the way to fight the sin of pride."}, {"time": 1454, "text": "Right, which is why the masters tend to say, this was Bernard, St. Bernard was asked, what are the three most important virtues?"}, {"time": 1461, "text": "And he said, humilitas, humilitas, and humilitas, because it's the opposite of pride."}, {"time": 1466, "text": "So, but you know, they're bringing Aquinas in again, because we think, oh, humility, I'm no good."}, {"time": 1472, "text": "That's not what it means at all."}, {"time": 1473, "text": "It means what I was describing before, when you're just lost in something, you're just lost in it."}, {"time": 1479, "text": "My image, I live out in Santa Barbara, and I like to walk on the beach out there, and there's a section of the beach where they let the dogs run free without leashes."}, {"time": 1488, "text": "And when you see a dog, and he's well cared for, and his master's right there, and the master's throwing the tennis ball out into the surf, and the dog goes galloping out into the surf, and he gets it with a big smile, and comes running back."}, {"time": 1502, "text": "That's an image of heaven, because he's just lost in that moment."}, {"time": 1505, "text": "He doesn't care about impressing anybody."}, {"time": 1507, "text": "He doesn't care about what people think of him."}, {"time": 1510, "text": "He's just lost in it."}, {"time": 1513, "text": "That's it, that's heaven, right?"}, {"time": 1516, "text": "And those moments in our life, when we get that, it's a little hint of paradise."}, {"time": 1521, "text": "But the trouble is most of us live, frankly, most of the time in various levels of hell, and we're dealing with these deadly sins."}, {"time": 1529, "text": "Like envy flows from pride, because if I'm prideful, I'm a black hole, I'm in Curvatus In Se, I'm collapsed in, what am I really gonna be concerned about?"}, {"time": 1537, "text": "That guy's getting more attention than I am."}, {"time": 1539, "text": "That guy's richer than I am."}, {"time": 1540, "text": "That lady, she's got a bigger reputation than I do, and why don't I have that, right?"}, {"time": 1546, "text": "So envy is a very close daughter of pride."}, {"time": 1550, "text": "Anger flows from it."}, {"time": 1551, "text": "Why do I get angry?"}, {"time": 1553, "text": "The dog isn't getting angry on the beach when he's running after the tennis ball."}, {"time": 1556, "text": "But I get angry all the time, I sputter with anger when things aren't going my way, and you're insulting me, and you're not doing what I want, and I'm being hurt, my reputation."}, {"time": 1564, "text": "So anger flows from pride, you know?"}, {"time": 1567, "text": "All of them do, all of the deadly sins do."}, {"time": 1570, "text": "So you said, I'm a sinner."}, {"time": 1573, "text": "So we're all sinners."}, {"time": 1577, "text": "And you mentioned Satan."}, {"time": 1579, "text": "Where's the, so there's heaven and hell, there's God and Satan."}, {"time": 1585, "text": "Where's the line between what it means to be good and not good enough?"}, {"time": 1594, "text": "Or I hesitate to use the word sort of evil, but maybe overwhelmingly sinful."}, {"time": 1603, "text": "Where's the line between hell and heaven?"}, {"time": 1605, "text": "Think of them as limit concepts, maybe."}, {"time": 1607, "text": "They're like heuristic devices."}, {"time": 1609, "text": "So heaven would name this ultimate friendship with God."}, {"time": 1613, "text": "So think of the dog on the beach, who is just, he's fallen in love with his environment, with his master, with the surf."}, {"time": 1619, "text": "He's just lost in it, right?"}, {"time": 1621, "text": "He's forgotten himself, he's transcended himself, and is now lost in the wonder of the beauty of that place."}, {"time": 1628, "text": "Now, imagine the limit of that is the friendship with God that we talked about, that I become the friend of God."}, {"time": 1636, "text": "I become so forgetful of myself, so lost in the beauty and truth and goodness of God that I found beatitude, right?"}, {"time": 1645, "text": "I found joy, the beatific vision, we call it."}, {"time": 1650, "text": "That's the limit case."}, {"time": 1651, "text": "That's where we're tending."}, {"time": 1652, "text": "That's where God wants us to go."}, {"time": 1654, "text": "Think of hell as the limit case in the opposite direction."}, {"time": 1656, "text": "That's curvatus in se."}, {"time": 1657, "text": "That's the black hole."}, {"time": 1659, "text": "And we're all sinners, meaning we're somewhere on that spectrum."}, {"time": 1662, "text": "We have good days and bad days, and we have good moments and bad moments, and I can be drawn toward sin."}, {"time": 1671, "text": "What's God's purpose on Christianity's reading is to bring us out of that."}, {"time": 1676, "text": "Now, where did he go?"}, {"time": 1677, "text": "He went all the way into it to get us out of it."}, {"time": 1680, "text": "It's like pulling a sock back out."}, {"time": 1682, "text": "The sock's inside out, you have to go all the way in and pull it back out."}, {"time": 1685, "text": "And so God had to go all the way down."}, {"time": 1688, "text": "There's the trajectory of the incarnation."}, {"time": 1693, "text": "Though he was in the form of God, and this is St. Paul, Jesus did not deem equality with God a thing to be grasped at, but rather emptied himself and took the form of a slave, being born in the likeness of men."}, {"time": 1703, "text": "But then he was known to be of human estate, and he accepted even death, death on a cross."}, {"time": 1710, "text": "And so Paul imagines the incarnation as this downward journey in order to get all of us, right?"}, {"time": 1716, "text": "All of us who were stuck, were stuck in our sin."}, {"time": 1720, "text": "And so again, Paul says he became sin on the cross."}, {"time": 1724, "text": "It's a really, really powerful idea."}, {"time": 1726, "text": "He wasn't a sinner, because then he'd need to be saved too."}, {"time": 1729, "text": "He's not a sinner, but he entered into our dysfunction in order to pull us back out of it."}, {"time": 1735, "text": "So that's a really powerful message, an embodiment, sort of educating the world about sin."}, {"time": 1747, "text": "That said, day to day, there's oscillations in terms of how much each human sins, and there's a struggle against that."}, {"time": 1757, "text": "So that dog that loses himself on the beach may have had a lot of sex with other dogs leading up to that."}, {"time": 1766, "text": "That was, may have been not the best dog he could be leading up to that."}, {"time": 1772, "text": "So how, if it's a math equation, what does the final calculation look like in terms of ending up in heaven?"}, {"time": 1780, "text": "What does it mean to live a good life in the end?"}, {"time": 1784, "text": "Is it the average amount of sin you do is low?"}, {"time": 1790, "text": "Are you allowed to make mistakes?"}, {"time": 1792, "text": "Yeah, the metric is love, right?"}, {"time": 1796, "text": "And love is not a feeling, it's an act of the will."}, {"time": 1799, "text": "To will the good of the other."}, {"time": 1801, "text": "That's Aquinas again."}, {"time": 1802, "text": "To will the good of the other as other."}, {"time": 1804, "text": "You see, that's the anti black hole principle."}, {"time": 1807, "text": "When I, I don't."}, {"time": 1808, "text": "Will the good of the other."}, {"time": 1810, "text": "As other."}, {"time": 1811, "text": "See, because if I'm willing your good, because it's good for me."}, {"time": 1815, "text": "So again, it's good for you that I'm on this program, I guess, I'm willing your good, but that's because it's gonna be down to my benefit."}, {"time": 1821, "text": "That's just an indirect egotism."}, {"time": 1823, "text": "That's why I see love is really rare and strange, that I really want what's good for you as other."}, {"time": 1832, "text": "So not connected to the black hole tendency of my own prideful ego."}, {"time": 1836, "text": "When I've broken that, I've forgotten self and I've moved into the space of your own good."}, {"time": 1844, "text": "Now, God wants us to be, by this they will know that you're my disciples, that you love one another, Jesus says."}, {"time": 1852, "text": "Now, I mean, life is ups and downs and back and forth and we're better or worse at that."}, {"time": 1859, "text": "The point of a church is to graft us onto Christ that we might become more and more conformed to love."}, {"time": 1865, "text": "But you know, the final calculus, I'll leave that to God."}, {"time": 1867, "text": "I mean, but use love as the metric."}, {"time": 1869, "text": "At the end of the day, when you examine your conscience, did I will the good of the other today?"}, {"time": 1874, "text": "How effective was I at that?"}, {"time": 1877, "text": "And be, just like Ignatius of Loyola, be brutally honest."}, {"time": 1881, "text": "Or was I just willing someone's good because it was good for me?"}, {"time": 1885, "text": "Where were those moments where I was like the dog on the beach, see?"}, {"time": 1889, "text": "And then see, play it the way, not so much God the law giver surveying and you did three of those and four."}, {"time": 1895, "text": "It's God wants us to be fully alive."}, {"time": 1899, "text": "Saint Irenaeus is one of my great heroes, ancient, you know, patristic figure."}, {"time": 1903, "text": "And his famous line is gloria de homo vivens, right?"}, {"time": 1906, "text": "The glory of God is a human being fully alive."}, {"time": 1910, "text": "See, and that gets us over this sort of obsession with the illegalism and did I do enough?"}, {"time": 1915, "text": "And is that, that's a big enough sin."}, {"time": 1918, "text": "God wants us fully alive."}, {"time": 1920, "text": "The key to that is willing the good of the other."}, {"time": 1922, "text": "He died that we might come to a richer appropriation of that."}, {"time": 1928, "text": "So to be fully alive is to be in love with the world or to love the world deeply."}, {"time": 1937, "text": "And what love means is the other."}, {"time": 1940, "text": "Is."}, {"time": 1941, "text": "Get out of yourself, right."}, {"time": 1942, "text": "It's the humility, yeah, getting out of yourself."}, {"time": 1946, "text": "Let go."}, {"time": 1946, "text": "That somehow is not, that's not even selfless because the word selfless requires there to be a self."}, {"time": 1955, "text": "It's almost like just letting go."}, {"time": 1958, "text": "Yeah, I might talk about like a gift of self that you're self aware but you give a gift of yourself."}, {"time": 1963, "text": "Your self becomes not a magnet drawing things into itself but it becomes a radiant source of life for others."}, {"time": 1969, "text": "I think Mother Teresa would have had a keen sense of herself, it seems to me."}, {"time": 1972, "text": "But it was to light other people up so that they might be radiant."}, {"time": 1980, "text": "That's the game."}, {"time": 1980, "text": "So you could probably articulate it that way too."}, {"time": 1985, "text": "I love love."}, {"time": 1986, "text": "It's such an interesting thing."}, {"time": 1988, "text": "But we have to be hard nosed about it."}, {"time": 1989, "text": "Like your friend Dostoevsky, love is a harsh and dreadful thing, right."}, {"time": 1993, "text": "It's not a feeling."}, {"time": 1994, "text": "And our culture is so sentimentalized love that it's having warm feelings or doing what people want."}, {"time": 2000, "text": "And that's not it at all."}, {"time": 2000, "text": "Love is always correlated to the order of the good."}, {"time": 2004, "text": "Because if I'm willing the good of the other, I have to know what that good is, right."}, {"time": 2008, "text": "So a parent does this, oh, I'll give the kid whatever she wants."}, {"time": 2011, "text": "Well, that's not love, that's indulgence or that's sentimentality."}, {"time": 2015, "text": "But I have to know what the goods really are if I'm gonna will them for you, right."}, {"time": 2019, "text": "Yeah, in some sense, you're absolutely right."}, {"time": 2023, "text": "A component of love is the struggle to know the other."}, {"time": 2028, "text": "It's the struggle to understand."}, {"time": 2029, "text": "I mean, that's what I mean by empathy."}, {"time": 2032, "text": "It's the, yeah, it's not Valentine's Day romantic gifts."}, {"time": 2037, "text": "It's a struggle."}, {"time": 2039, "text": "It's like trying to understand, trying to perturb your own mind and that of another human being to try to figure out who they are, what they want, what makes them happy, what are they afraid of, what are they hoping for."}, {"time": 2056, "text": "And it's like a dance, a dance of conversation, a dance of just shared experiences and all that kind of stuff."}, {"time": 2064, "text": "And all of that requires for you to be, I guess, yeah, empathize."}, {"time": 2071, "text": "Imagine yourself in their place and then love that person when you're living inside that person."}, {"time": 2080, "text": "Yeah, several minutes ago about the pillars of Christianity."}, {"time": 2083, "text": "So we talked about God, talked about incarnation, but you're getting now to a third key one, namely the Trinity."}, {"time": 2090, "text": "Because we're monotheists, right, but we don't think God is monolithically one."}, {"time": 2094, "text": "We think God is a play of persons."}, {"time": 2097, "text": "And the Father from all eternity by a great mental act forms his interior word, as Aquinas puts it."}, {"time": 2108, "text": "And that's the logos, right?"}, {"time": 2110, "text": "That's the verbum, that's the word by which the Father knows himself."}, {"time": 2113, "text": "And we call it the Son."}, {"time": 2114, "text": "So the imago, it's the image of the Father."}, {"time": 2117, "text": "But then see, the great thing is that imago is not like just a dead image on a mirror or a dead image at a pond or something."}, {"time": 2124, "text": "It's a full reflection of the Father's being."}, {"time": 2129, "text": "He's one in being with the Father."}, {"time": 2131, "text": "Therefore, the Son has everything the Father has except being the Father."}, {"time": 2135, "text": "But that means that the two of them look at each other and they're just crazy in love with each other because the Father's the fullness of being, the Son is the fullness of being."}, {"time": 2146, "text": "And they're so crazy in love with each other that they, this is Fulton Sheen put it this way, that there's this, ah, they just, they love each other with this sigh."}, {"time": 2158, "text": "And we call that the Spiritus Sanctus."}, {"time": 2160, "text": "That's the holy breath, right?"}, {"time": 2161, "text": "The holy sigh of love between the Father and the Son."}, {"time": 2166, "text": "And that's one being, one essence we say of God."}, {"time": 2170, "text": "But in these three persons, but all your language about like dance and play and community, the Greek Fathers talked about perichoresis, which means God, the three persons kind of sit in a choir together."}, {"time": 2183, "text": "So they sing together, you know?"}, {"time": 2187, "text": "And that's why, see, Christianity is unique in this claim, that God is love."}, {"time": 2194, "text": "So every religion will say God loves, you know, in some way."}, {"time": 2198, "text": "Love is an attribute of God."}, {"time": 2200, "text": "God is, or love is a thing that God does sometimes."}, {"time": 2203, "text": "But Christianity is unique in all the religions in saying that God is love."}, {"time": 2207, "text": "And somehow the Holy Trinity embodies that idea."}, {"time": 2212, "text": "I mean, that philosophically has always been confusing to me, what it means to be three things and at the same time be one God, the Father, Son, and the Holy Spirit."}, {"time": 2227, "text": "What is this dance between these three?"}, {"time": 2230, "text": "What exact, like how do you visualize, how do you understand this?"}, {"time": 2235, "text": "This very fascinating, essential thing for Christianity."}, {"time": 2240, "text": "The first thing I'd say is what we already have been sort of talking about, is if you say God is love, and most people probably say, yeah, I like that."}, {"time": 2245, "text": "It's a good idea, God is love."}, {"time": 2247, "text": "But it's very peculiar because if he is love, there has to be in his unity a lover, a beloved, and the love that they share."}, {"time": 2257, "text": "Otherwise he isn't loved by his very essence."}, {"time": 2260, "text": "He would love, it would be an attribute of God or an action of God."}, {"time": 2265, "text": "But if it's his very nature, there has to be lover, beloved, and love shared."}, {"time": 2269, "text": "And the tradition eventually came to see that."}, {"time": 2272, "text": "The image I was using before of the Father, his imago, the Son, well that's born of God's infinite mind."}, {"time": 2280, "text": "So of course God has an image of himself."}, {"time": 2282, "text": "Heck, I've got an image of myself."}, {"time": 2284, "text": "That's something I can pull off as a puny little creature."}, {"time": 2287, "text": "God in his infinity has a perfect imago of himself."}, {"time": 2291, "text": "And they have to fall in love with each other."}, {"time": 2293, "text": "What else can they do?"}, {"time": 2294, "text": "Because they're in the presence of infinite good."}, {"time": 2297, "text": "And so it has to follow that you then have the shared love that connects them."}, {"time": 2302, "text": "And that's how we generate, if you want, this idea of the three persons in God."}, {"time": 2307, "text": "Let me ask you about the church."}, {"time": 2310, "text": "One of the defining characteristics of Catholicism is the Catholic church."}, {"time": 2318, "text": "What is the Catholic church?"}, {"time": 2320, "text": "I would say it's the mystical body of Jesus."}, {"time": 2323, "text": "So as I said before, it's not an organization."}, {"time": 2325, "text": "If we do it that way, we're gonna miss it."}, {"time": 2326, "text": "It's got organizational elements to it."}, {"time": 2328, "text": "So I'm a bishop, I'm a office holder within the church."}, {"time": 2332, "text": "But the church is an organism, not an organization."}, {"time": 2336, "text": "So it's a organism of interconnected cells, as I said, namely all of the baptized, gathered around Christ in a mystical union."}, {"time": 2346, "text": "That's the church."}, {"time": 2347, "text": "But there's buildings, there's titles."}, {"time": 2350, "text": "Sure, because it manifests itself institutionally then."}, {"time": 2354, "text": "So are the sort of heavy things about that all have to do with pride?"}, {"time": 2360, "text": "The sexiness of the buildings?"}, {"time": 2362, "text": "Yeah, no, whatever is corrupt in the church, of course, it comes from pride, from sin."}, {"time": 2366, "text": "And one thing I like about the New Testament is so clear on that."}, {"time": 2369, "text": "Paul is, in his little tiny communities, so before there was a Vatican or dioceses or anything, Paul had these little tiny communities of Christians like in Corinth and Ephesus."}, {"time": 2379, "text": "What's the one thing we know about them?"}, {"time": 2381, "text": "Is they fought with each other."}, {"time": 2382, "text": "Because Paul's always uprating them and telling them, come on, would you people get it together?"}, {"time": 2388, "text": "Who's bewitched you?"}, {"time": 2389, "text": "So from the beginning, we've been fighting with each other because we're made up of sinners."}, {"time": 2395, "text": "So one thing we do in Catholic ecclesiology is the official name for the study of the church, is to talk about the treasure in earthen vessels."}, {"time": 2404, "text": "Paul's language again."}, {"time": 2405, "text": "The treasure is Christ."}, {"time": 2407, "text": "The treasure is the love he's bequeathed to the world."}, {"time": 2411, "text": "That's the treasure that we have."}, {"time": 2412, "text": "But it's always held in these really fragile vessels, namely us, and so it's gonna be marked by corruption and stupidity and pride and everything else."}, {"time": 2421, "text": "Well, nevertheless, there's a hierarchy."}, {"time": 2423, "text": "There's titles and so on."}, {"time": 2426, "text": "If we remove pride from the picture, so the best possible interpretation of the hierarchy that makes up this one organism, this living organism, what's the role of the pope, for example?"}, {"time": 2439, "text": "What is the role of a bishop, for example?"}, {"time": 2444, "text": "What is the role of the hierarchy in terms of the broader vision of Christianity, Catholicism as a religion?"}, {"time": 2460, "text": "And he said the purpose of the pope is to symbolize and embody and draw together the unity of the entire church."}, {"time": 2470, "text": "So he's the personal symbol of the unity of the church."}, {"time": 2474, "text": "Who's a bishop?"}, {"time": 2475, "text": "The bishop is the personal symbol of the unity of a diocese."}, {"time": 2479, "text": "Who's a pastor of a parish?"}, {"time": 2480, "text": "He's the personal symbol of the unity of that parish."}, {"time": 2484, "text": "So he understood it not so much organizationally as organically, again."}, {"time": 2488, "text": "It was like, what, that around which the pattern organizes itself."}, {"time": 2494, "text": "And if you don't have that unifying figure, the community will kind of reciprocate."}, {"time": 2499, "text": "And you see that all the time."}, {"time": 2500, "text": "Without headship, we would say."}, {"time": 2503, "text": "So it's more symbolic and organic than it is organizational."}, {"time": 2507, "text": "So symbols for community."}, {"time": 2509, "text": "But there's such fascinating peculiarities to each individual symbol."}, {"time": 2515, "text": "There's different characteristics that make up the different people."}, {"time": 2518, "text": "They have different ways of communicating."}, {"time": 2521, "text": "They have different hopes and fears and all that kind of stuff."}, {"time": 2526, "text": "If they're all symbols, what's the role of the different peculiarities of those symbols?"}, {"time": 2534, "text": "Of being an inspiring uniter versus maybe a stronger type of more judgmental kind of communicator, all that kind of stuff."}, {"time": 2547, "text": "Can you maybe speak to the human part of these symbols?"}, {"time": 2552, "text": "Yeah, well, I might just shift to another image of shepherd."}, {"time": 2557, "text": "So that's a classic biblical image."}, {"time": 2558, "text": "And as a bishop, I walk around with this thing called a crozier, which is a shepherd's staff."}, {"time": 2563, "text": "So it's the symbol of the bishop's office."}, {"time": 2565, "text": "And the crozier, though, is a kind of in your face thing in a way, because it's got the end of it was meant to hold off wild animals."}, {"time": 2575, "text": "And then the crook part of it was meant to bring sheep back to the fold."}, {"time": 2580, "text": "So I walk in with that, oh, this is nice."}, {"time": 2581, "text": "Oh, look at the bishop coming in."}, {"time": 2583, "text": "But that's a kind of in your face symbol that I'm here to defend the church against predators."}, {"time": 2589, "text": "And I'm also here to draw people in who are wandering too far away."}, {"time": 2594, "text": "I mean, that's part of the role of the hierarchy and the Pope and bishops and pastors."}, {"time": 2600, "text": "Pastor just means shepherd, right?"}, {"time": 2601, "text": "So I'm the shepherd of a parish."}, {"time": 2605, "text": "It's not like just all sunshine and light and what a pretty image."}, {"time": 2608, "text": "The one who embodies the unity of the community is also the shepherd."}, {"time": 2612, "text": "Okay, but again, leaning on the human thing."}, {"time": 2617, "text": "The church is an institution."}, {"time": 2620, "text": "And I don't know if you've heard, but there is an element of power that corrupts."}, {"time": 2626, "text": "An absolute power corrupts absolutely, as the old saying goes."}, {"time": 2631, "text": "Let me ask you something else that came up on the Reddit AMA."}, {"time": 2636, "text": "Yeah, megachurches and the prosperity gospel."}, {"time": 2639, "text": "And you've mentioned that you may not be a fan."}, {"time": 2643, "text": "What are your views on this?"}, {"time": 2645, "text": "And what are your views in general of money and power corrupting the heads of these institutions?"}, {"time": 2652, "text": "I don't like the prosperity gospel because the gospel is about Jesus journey into radical self forgetfulness on the cross."}, {"time": 2661, "text": "And he never makes a promise of earthly, of earthly well being."}, {"time": 2667, "text": "Can you explain what the prosperity gospel is?"}, {"time": 2669, "text": "Yeah, the view that if I follow Jesus and I follow God with great trust that I will be rewarded with wealth and position and status in this world."}, {"time": 2679, "text": "It might be God's will when I get that."}, {"time": 2681, "text": "But you know, Aquinas said this, say I look at a very sinful person, I say, kind of, he's got a great house and he's richer than I am and all that."}, {"time": 2687, "text": "Aquinas says, yeah, but maybe that's a punishment."}, {"time": 2691, "text": "Cause maybe all that is leading him away from God."}, {"time": 2693, "text": "And actually that's God's way of punishing him."}, {"time": 2695, "text": "And the fact that you don't have wealth in a big house is actually a great gift to you because now it frees you for doing God's will."}, {"time": 2702, "text": "So we can't read, you know, God's favor in worldly terms."}, {"time": 2708, "text": "I would say God's favor is, am I awakened to deeper love?"}, {"time": 2713, "text": "Then I know that I'm finding God's favor."}, {"time": 2715, "text": "Now, God might decide, sure, I want you to have this and that."}, {"time": 2718, "text": "I want to provide this to you."}, {"time": 2720, "text": "Then I say, thank you, Lord."}, {"time": 2721, "text": "How can I use it as an instrument of love?"}, {"time": 2725, "text": "All the masters talk about detachment."}, {"time": 2727, "text": "And that's another reason I don't like the prosperity gospel is though I'm getting attached now to all these material advantages."}, {"time": 2734, "text": "And I'm even seeing them as a sign of God's favor."}, {"time": 2737, "text": "Let go of all that."}, {"time": 2738, "text": "You let go of it and use it as a vehicle of love."}, {"time": 2741, "text": "So if you're rich, the right question is, okay, Lord, why did you allow me to become rich?"}, {"time": 2746, "text": "So that, what can I do?"}, {"time": 2747, "text": "How can my riches be an expression of love?"}, {"time": 2750, "text": "If I'm popular, if I'm healthy, okay, why am I popular?"}, {"time": 2753, "text": "Why am I healthy?"}, {"time": 2754, "text": "How can I use that for your good?"}, {"time": 2756, "text": "I'm sick, in bed, I'm suffering."}, {"time": 2759, "text": "Okay, Lord, how can I use that as an expression of love?"}, {"time": 2763, "text": "So I'd rather measure it that way than through worldly success."}, {"time": 2767, "text": "That's why I'm against the prosperity gospel."}, {"time": 2770, "text": "So there's a, don't seek worldly possessions, but whatever happens to you, good or bad, seek how that could be used to increase the amount of love in the world."}, {"time": 2784, "text": "The image I love for this is the Wheel of Fortune, which is a device on a lot of the Gothic cathedrals."}, {"time": 2789, "text": "And it's this great circle, right, this wheel."}, {"time": 2792, "text": "At the top of it is a king."}, {"time": 2794, "text": "And then it turns this way, and the king has lost his crown."}, {"time": 2796, "text": "And the bottom is a pauper."}, {"time": 2797, "text": "And then over here is a king, is a guy climbing up to power, right?"}, {"time": 2802, "text": "And then in the middle is a depiction of Christ."}, {"time": 2805, "text": "And the idea is just very simple, but very profound, that the wheel is life, you know?"}, {"time": 2809, "text": "It's sometimes you're up, sometimes you're down."}, {"time": 2811, "text": "Sometimes you have power and popularity and prestige."}, {"time": 2815, "text": "Other times you're losing it, you're going down."}, {"time": 2816, "text": "Other times you got none of it."}, {"time": 2817, "text": "Other times you're coming back up."}, {"time": 2820, "text": "Don't live on the rim of the wheel."}, {"time": 2821, "text": "It'll make you crazy."}, {"time": 2822, "text": "Every point on the rim of the wheel is a point of anxiety."}, {"time": 2826, "text": "Where you should live is the center of the wheel, where Christ is, right?"}, {"time": 2830, "text": "Because that's the link now to the eternity of God."}, {"time": 2833, "text": "That's the point of love, where love can flow through you to the world."}, {"time": 2837, "text": "And then you can look at the wheel."}, {"time": 2839, "text": "You're a Beatles fan, right?"}, {"time": 2841, "text": "I think I discovered that."}, {"time": 2842, "text": "I love the Beatles."}, {"time": 2843, "text": "And the song that always comes to my mind when I think of that image is John Lennon, the end of his life."}, {"time": 2849, "text": "So a guy that, I mean, rode the wheel of fortune like crazy."}, {"time": 2852, "text": "You know, he was at the top of the world in every way."}, {"time": 2856, "text": "And then Beatles break up and he kind of loses it."}, {"time": 2859, "text": "And then he's at the lost weekend in the 70s at the very bottom."}, {"time": 2862, "text": "When he died, he was just kind of coming back up again."}, {"time": 2865, "text": "But the song I always think of is watching the wheels, right?"}, {"time": 2869, "text": "I'm just sitting here watching the wheels go round and round."}, {"time": 2870, "text": "I really love to watch them roll because I'm no longer riding on the merry go round."}, {"time": 2874, "text": "That's right out of the medieval mystics, that he's not riding on the wheel."}, {"time": 2879, "text": "He's just watching it go round and round."}, {"time": 2881, "text": "That's the point of, the Greeks called it apotheia, and the Latins called it indifference, you know?"}, {"time": 2896, "text": "I'm detached from that."}, {"time": 2898, "text": "I'm sitting here watching the wheel go round and round because I'm not riding on it anymore."}, {"time": 2902, "text": "The mystics have always made that transition."}, {"time": 2905, "text": "Let me ask you a difficult question about the darker side of human nature, of human power, of institutions."}, {"time": 2914, "text": "What's your view on the long history and widespread reports of sexual abuse of children by a Catholic priest?"}, {"time": 2920, "text": "So this is a difficult topic, but maybe an important one to shine a light on."}, {"time": 2925, "text": "Yeah, it's awful, you know, and it's been a problem."}, {"time": 2928, "text": "Go back to Peter Damian back in the 11th century was talking about it."}, {"time": 2932, "text": "So it's been a problem, and whenever really sinful human beings have been in close proximity to children, we find this issue."}, {"time": 2939, "text": "Has it been around the church?"}, {"time": 2943, "text": "Has it surfaced in a kind of sickening way in the last 30 years?"}, {"time": 2947, "text": "So I'm glad the church has made important strides, and it has."}, {"time": 2953, "text": "Back in 2002, there was a thing called the Dallas Accords where the bishops of America put a lot of these protocols in place that really have been effective at ameliorating this problem."}, {"time": 2964, "text": "The numbers spiked in the 70s and 80s, and that's been demonstrated over and over again."}, {"time": 2969, "text": "And then they fell dramatically after that."}, {"time": 2971, "text": "So that's not to excuse anything, but it's to say I think progress has been made with it."}, {"time": 2976, "text": "What's the impulse to secrecy?"}, {"time": 2978, "text": "Yeah, well, to protect institutions."}, {"time": 2980, "text": "That's always, that's a sinful instinct."}, {"time": 2983, "text": "I'm not all together."}, {"time": 2984, "text": "I mean, sure, an institution is worth protecting, but if it reaches the point where you're indifferent to people's wellbeing, then you're in trouble."}, {"time": 2992, "text": "So institutions role should be transparent and honest with the sins of its members and of itself."}, {"time": 3002, "text": "So maybe you can speak to the fact as a priest, a bishop, as part of Catholicism, you're not allowed to marry, not allowed to have sex, you're sworn to celibacy."}, {"time": 3022, "text": "What is behind that idea?"}, {"time": 3025, "text": "What is the sort of, we've talked about some broad stroke ideas of love, what's behind the idea of celibacy?"}, {"time": 3033, "text": "And that's a good way to get at it."}, {"time": 3034, "text": "It's a path of love."}, {"time": 3035, "text": "So the church is always in favor of inculcating love."}, {"time": 3039, "text": "Marriage is a path of love, but so is celibacy."}, {"time": 3043, "text": "Saint Paul talks about someone who is preoccupied with the things of this world and family and those who are free from that are freer for doing the work of God."}, {"time": 3053, "text": "So that's kind of a pragmatic justification for celibacy."}, {"time": 3056, "text": "And we still, I think, take that seriously."}, {"time": 3059, "text": "I look at my own life."}, {"time": 3059, "text": "I mean, celibacy has enabled me to do all kinds of things and go places and minister in a way that I could not if I had been married."}, {"time": 3069, "text": "So I get it, I get the pragmatic side."}, {"time": 3071, "text": "But I'm more interested in the sort of mystical side of it."}, {"time": 3077, "text": "Remember Jesus was challenged about the person who had a whole series of husbands and then they all died."}, {"time": 3082, "text": "And so in heaven, which husband will the wife have?"}, {"time": 3086, "text": "And his answer is, in heaven, people don't marry and they're not given in marriage."}, {"time": 3091, "text": "There's a higher way of love."}, {"time": 3094, "text": "It's a more radical way of love."}, {"time": 3095, "text": "It's not tied to a particular, but I think through God is tied to everybody."}, {"time": 3100, "text": "The celibate, and this has been to the beginning of the church, not as a law, but there were celibates from the very beginning of the church, including Jesus, of course, and Paul."}, {"time": 3110, "text": "They sense something, that that way of living mystically anticipates the way we'll love in heaven."}, {"time": 3118, "text": "It's a sign even now within this world of how we will all love in heaven."}, {"time": 3124, "text": "So in that way, it's a bit like pacifists."}, {"time": 3130, "text": "I'm glad there are pacifists in the church."}, {"time": 3132, "text": "And I've known some very powerful witnesses to pacifism."}, {"time": 3137, "text": "I'm glad they're pacifists because they witness even now to how we will be in heaven when every tear is wiped away and we beat our swords into plowshares and heaven's a place of radical peace, that some people even now live it."}, {"time": 3152, "text": "At the same time, I'm glad not everyone's a pacifist because I would hold with the church to just war theory that sometimes all we can do in this finite world is to fight manifest wickedness."}, {"time": 3166, "text": "And just in the same way there's just sex?"}, {"time": 3169, "text": "Well, no, right, I'm glad there are celibates, but I'm glad not everyone's a celibate."}, {"time": 3174, "text": "I mean, because married love is a marvelous expression of the divine love."}, {"time": 3179, "text": "So that's why it's good there are some."}, {"time": 3181, "text": "And it's always been a small number."}, {"time": 3183, "text": "The actual experience of it, would you, the spiritual nature of it, is it similar to fasting?"}, {"time": 3190, "text": "So I've been enjoying fasting recently, so not eating."}, {"time": 3196, "text": "For several days, that kind of stuff."}, {"time": 3198, "text": "And that somehow brings you even deeper."}, {"time": 3201, "text": "I'm in general in love with everything, with nature and everything."}, {"time": 3205, "text": "I see the beauty in the world."}, {"time": 3206, "text": "But there's a greater intensity to that when you're fasting, for example."}, {"time": 3211, "text": "Yeah, I might use the language of sublimation or redirection of energy and all that."}, {"time": 3218, "text": "There's a certain sublimation of energies into prayer, into mysticism, into ministry, a redirection of energies."}, {"time": 3230, "text": "So it's meant to be life enhancing."}, {"time": 3232, "text": "The same way fasting is."}, {"time": 3233, "text": "It's meant ultimately to be life enhancing and make you healthier and happier."}, {"time": 3237, "text": "So celibacy is a path of love."}, {"time": 3240, "text": "And I think it does involve a certain redirection of energies, I'd say that."}, {"time": 3243, "text": "Don't you think, do you think it's a heavy burden for some humans to bear?"}, {"time": 3251, "text": "For some priests to bear?"}, {"time": 3253, "text": "I'm just saying, given the sexual abuse scandal, is that the thing that breaks humans?"}, {"time": 3262, "text": "No, I wouldn't tie that to celibacy."}, {"time": 3264, "text": "And that's been demonstrated over and over again."}, {"time": 3267, "text": "There's a priest named Andrew Greeley who was a priest from my home diocese of Chicago."}, {"time": 3270, "text": "And Andy did a lot of research, he was a sociologist of religion, did a lot of research into that very question."}, {"time": 3276, "text": "And there really is not a correlation between celibacy per se and the sexual abuse of children or of anybody."}, {"time": 3282, "text": "So I wouldn't make that correlation."}, {"time": 3284, "text": "So bad people, sinful people are going to do what they're going to do."}, {"time": 3288, "text": "I think people who have a tendency toward abusing children sexually are drawn to situations where they get ready access to kids and they get institutional cover."}, {"time": 3300, "text": "So that's the only thing that can go through the list from sports and Boy Scouts, et cetera."}, {"time": 3306, "text": "And that's been proven again and again."}, {"time": 3308, "text": "So I would tie it more to that."}, {"time": 3309, "text": "I wouldn't tie it to celibacy."}, {"time": 3311, "text": "So the challenge of course is all kinds of, you said institutional cover, there's all kinds of institutions that cover for people that do evil onto the world, that do sinful things onto the world."}, {"time": 3325, "text": "But there's something about the church which is, as an organism, is supposed to be an embodiment of good in this world, of love in this world."}, {"time": 3335, "text": "And it breaks people's hearts to see this kind of, even a small amount, this kind of thing happen within the church."}, {"time": 3343, "text": "It wakes you up to the cruelty, the absurdity of the world sometimes."}, {"time": 3348, "text": "Like it's back to the question of why do bad things happen to good people?"}, {"time": 3356, "text": "Why does God allow this kind of thing to happen?"}, {"time": 3360, "text": "And sort of maybe an unanswerable question."}, {"time": 3364, "text": "I can gesture toward it using rather abstract language, which is true enough, it's completely emotionally unsatisfying, but it's naming it truthfully enough."}, {"time": 3375, "text": "And it goes back to Augustine, which is God permits evil to bring about a greater good."}, {"time": 3384, "text": "Now again, I know how unsatisfying that sort of spare, austere language can sound, but it gets us off the horns of a dilemma."}, {"time": 3392, "text": "Aquinas, when he lays out a question, he always has the objections first."}, {"time": 3396, "text": "So is there a God?"}, {"time": 3398, "text": "Well, objection one, objection two, objection three."}, {"time": 3400, "text": "And he's really, you talk about steel manning and argument, Aquinas is great at that."}, {"time": 3406, "text": "One of the really steel manned arguments, is that the right grammatical form?"}, {"time": 3411, "text": "What's the past participle of the steel man?"}, {"time": 3415, "text": "But one of the best arguments, he formulates it this way."}, {"time": 3420, "text": "If one of two contraries be infinite, the other would be altogether destroyed."}, {"time": 3425, "text": "And as an example from his medieval physics, he goes, if there were an infinite heat, there'd be no cold, right?"}, {"time": 3431, "text": "But God is described as infinitely good."}, {"time": 3435, "text": "Therefore, if God exists, there should be no evil."}, {"time": 3438, "text": "But there is evil."}, {"time": 3440, "text": "Therefore, God does not exist."}, {"time": 3442, "text": "That's a darn good argument."}, {"time": 3443, "text": "That's a really persuasive argument."}, {"time": 3445, "text": "And I think, I've done this for a long time in apologetics and in sort of higher philosophy, that's the best argument against God."}, {"time": 3453, "text": "But here's something, before I press head with it, something I find really interesting."}, {"time": 3457, "text": "I think the three best arguments against God all come from within the religious tradition."}, {"time": 3463, "text": "Namely, the book of Job."}, {"time": 3466, "text": "So Job, he's great."}, {"time": 3468, "text": "I mean, he's a great guy."}, {"time": 3470, "text": "He does everything right."}, {"time": 3471, "text": "He's God's great servant, and he's punished in every possible way."}, {"time": 3477, "text": "He has every possible suffering."}, {"time": 3479, "text": "Aquinas's argument from the Summa, from the Summa, and then to your friend and mine, Dostoevsky."}, {"time": 3486, "text": "I think in the Brothers Karamazov, Ivan's argument, when he's trying to wreck the faith of Alyosha."}, {"time": 3493, "text": "And these examples drawn, they think, from Dostoevsky, from the headlines of his own time, of the most abject cruelty to children, like an innocent child being made to suffer."}, {"time": 3507, "text": "How in God's name could that happen if God exists and he's all good?"}, {"time": 3514, "text": "So I get it, but see, the book of Job, Thomas Aquinas, Dostoevsky, these are all profoundly believing people."}, {"time": 3521, "text": "It's like when I hear Stephen Fry, the famously atheist writer, he will bring out this argument with great authority."}, {"time": 3530, "text": "He does, of children with bone cancer and worms that go into the eyes of children and blind them before they kill them."}, {"time": 3537, "text": "And, but he's been preceded by the author of Job, Thomas Aquinas and Dostoevsky, who stood right, think of Job, in the whirlwind."}, {"time": 3548, "text": "He stands there in the whirlwind, you know?"}, {"time": 3552, "text": "So you can't blame the Christian tradition for not dealing with this problem, for brushing it under the carpet."}, {"time": 3560, "text": "I mean, it has stood in the whirlwind of this problem."}, {"time": 3563, "text": "It's still a difficult problem to deal with, that there's all this cruelty of the world."}, {"time": 3569, "text": "There's a lot of example through history, just in my own family history with the Soviet Union, with Stalin, the atrocities that Stalin has brought onto the people of the Soviet Union throughout the 20th century is nearly immeasurable."}, {"time": 3591, "text": "And yet, when you look at the entirety of human history, you will see progress, not just the Soviet Union, but the entirety of the civilization throughout the 20th century, and Stalin has a role to play."}, {"time": 3605, "text": "There's a dark aspect to, somehow evil helps us make progress."}, {"time": 3614, "text": "And I don't know how to put that in the calculation."}, {"time": 3618, "text": "It's a, I don't, you know, on the local scale, I want to alleviate suffering."}, {"time": 3623, "text": "I'm probably lean, heavily lean pacifist."}, {"time": 3629, "text": "Not out of weakness, but out of strength, but man, it does seem that history is sprinkled with evil, and that evil does somehow nudge us towards good."}, {"time": 3642, "text": "Yes, sometimes we can see it, and that's where the idea comes from, that evil's permitted to bring about some greater good, and we can sometimes really see it."}, {"time": 3653, "text": "Can we always see it?"}, {"time": 3655, "text": "In fact, typically we don't see it, but now you bring another factor into this, which is the difference between our minds and God's mind."}, {"time": 3662, "text": "So our minds, I mean, look, even, they're remarkably capacious, but they take in a tiny, tiny, tiny swath of space and time, and even our eyes kind of take in so much of the light spectrum, and these little ape sensorium that we have that could just take in a little tiny bit of reality, really."}, {"time": 3682, "text": "How are we ever in a position to say, oh no, there's no possible good that would ever come from that?"}, {"time": 3688, "text": "Even the greatest evil that Dostoevsky can conjure up, and Stephen Fry, still, how could we have the arrogance to say, I know there's no good that could ever come from that."}, {"time": 3702, "text": "I know there's no morally justifiable reason why God would ever permit that, because I think that's hubris to the nth degree for us to say that, and that's the assumption behind this claim that God can permit evil to bring about a greater good."}, {"time": 3717, "text": "Now, God understands it, but we're like little kids, like a four year old, and their parents make a decision, and we say, what in the, why in the world would you do this to me?"}, {"time": 3730, "text": "This is my pastoral experience."}, {"time": 3732, "text": "Years ago, there was a young father, and his son was like three or something, and he was in the hospital for something, I forgot what it was, but he had to undergo surgery, right?"}, {"time": 3741, "text": "So after the surgery, he's in great pain, this poor kid, this three year old kid, and the dad was there with him, holding his hand, and the son, this is what the father told me, he said, he's looking at me like, what gives here?"}, {"time": 3755, "text": "I mean, why would you, you love me, I've always assumed that, and yet you're presiding over this somehow, you're approving of this, and doing nothing to get me out of it, right?"}, {"time": 3766, "text": "And he said, the kid couldn't articulate that, but his eyes did, and the father said, it was just killing me, because I knew I couldn't explain it to him."}, {"time": 3775, "text": "And it's true, I mean, he could vaguely gesture toward, but the kid didn't understand surgery, and cutting his body, and taking things out of it, and that this was gonna make him much better in the long run, but I remember thinking, that's a great metaphor for us vis a vis God, is here's God, infinitely loving God, who's with us all the time, and we say, what are you doing?"}, {"time": 3794, "text": "Why aren't you taking this away from me?"}, {"time": 3797, "text": "And the answer, I mean, ultimately is trust, trust me, trust me, surrender to me."}, {"time": 3804, "text": "And when we don't, that's, we get in trouble with the old pride, and the hubris, and all that kind of stuff."}, {"time": 3811, "text": "Yeah, no, but trust me when I tell you, I mean, I completely get it in my own life, and as a priest, you're dealing with suffering all the time, with people in pain all the time."}, {"time": 3821, "text": "I remember as a young priest, there was a policeman in our parish, so he had a gun, and inexplicably, no one had any clue."}, {"time": 3832, "text": "He got up one night, shot his son to death, and then shot himself."}, {"time": 3837, "text": "This is my parish."}, {"time": 3838, "text": "So I went to the wake, I remember, I show up, and I'm this young, 27 year old goofball priest, and I roll my collar around, and I walk in, and there were two coffins, the two coffins in the room, there's the son and the father."}, {"time": 3851, "text": "And the mother was there, and she went like this to me."}, {"time": 3857, "text": "She saw me, okay, you're the religious guy here, what?"}, {"time": 3861, "text": "And just by instinct, I went like that too."}, {"time": 3866, "text": "I went like, I don't know what to tell, I can't, I don't have an answer for you."}, {"time": 3872, "text": "But I was there, and I'm not saying to pat myself on the back, this is, that's where the church goes, because Jesus went there."}, {"time": 3881, "text": "Now we're gesturing toward a more theological response."}, {"time": 3884, "text": "The first one's more austerely philosophical, God permits evil to bring about a good."}, {"time": 3889, "text": "But the theological response is, that's where Christ went, is he went all the way down."}, {"time": 3894, "text": "He went all the way down into our suffering."}, {"time": 3896, "text": "And see the cross as the limit case of evil, humiliation and cruelty and institutional injustice and psychological suffering and spiritual suffering and death, it's all there."}, {"time": 3913, "text": "And that's where the Son of God went."}, {"time": 3916, "text": "And I would say that's why, as a priest, I went there."}, {"time": 3919, "text": "That's my job, is to go to those places."}, {"time": 3922, "text": "So that's the ultimate answer to the problem."}, {"time": 3926, "text": "So there is, we can't comprehend it, but there is meaning to the suffering and the injustice."}, {"time": 3934, "text": "We trust it because we know on other grounds of God's existence."}, {"time": 3938, "text": "See, I would resist the claim that, well, this is such a knockdown argument, so now we know there is no God."}, {"time": 3943, "text": "I would say, no, there are all kinds of other rational warrants for God."}, {"time": 3946, "text": "And so I know that God exists."}, {"time": 3949, "text": "I know that God is infinite love, and now I gotta square that with this experience."}, {"time": 3954, "text": "And the way I do that is by a trusting confidence that God knows what he's about."}, {"time": 3961, "text": "Again, I know how inadequate that always seems to anyone who's suffering, including myself, when I'm in great suffering."}, {"time": 3967, "text": "But I think that's the best that we've done in the great tradition."}, {"time": 3971, "text": "So if you were to steel man the case against God or the existence of God, you find the most convincing argument is there's evil in the world, therefore there's no God."}, {"time": 3984, "text": "There's too much of it."}, {"time": 3985, "text": "If I were to steel man that argument, I'd do what Stephen Fry does."}, {"time": 3988, "text": "I would do what Dostoevsky's Ivan does."}, {"time": 3990, "text": "I would do exactly that."}, {"time": 3991, "text": "I would say there's just too much."}, {"time": 3994, "text": "And then if you wanna keep pressing it, animal suffering."}, {"time": 3997, "text": "So we talk about human suffering, but the suffering of animals over the eons and so on, isn't there just too much suffering to be reconciled with an infinitely good God?"}, {"time": 4009, "text": "And that's, again, Thomas Aquinas."}, {"time": 4011, "text": "I've just used his very steel man argument."}, {"time": 4015, "text": "You mentioned that, again, on Reddit, somebody asked who your favorite communicator of atheist ideas was, and you mentioned Christopher Hitchens."}, {"time": 4026, "text": "Are there other ideas for atheism that you find particularly challenging?"}, {"time": 4035, "text": "Well, that's the one, is the problem of evil."}, {"time": 4038, "text": "The other objection in Aquinas, which has a lot of contemporary resonance, is can't we just explain everything through natural causes?"}, {"time": 4046, "text": "Why would you have to invoke a cause beyond the causes in the world?"}, {"time": 4050, "text": "So as I'm trying to explain, let's say for Aquinas, motion, causality, finality, can I just do that with natural causes?"}, {"time": 4059, "text": "Wouldn't that suffice to explain it?"}, {"time": 4061, "text": "So I get like when naturalists are speaking or people that are pure materialists, they'll just say, no, that's perfectly adequate."}, {"time": 4069, "text": "A scientific account of reality is utterly adequate to our experience."}, {"time": 4075, "text": "So I would steel man that and say, well, show me why we need something more."}, {"time": 4079, "text": "And to do that, you gotta get out of Plato's cave, it seems to me."}, {"time": 4083, "text": "Because my objection to naturalism is it's staying within the realm of the immediately empirically observable and making the mistake of saying that's all there is to being."}, {"time": 4099, "text": "That's all there is that needs to be explained."}, {"time": 4102, "text": "And long before we get to religion, just stay with Plato."}, {"time": 4107, "text": "The first step out of the cave, if you combine it now with the parable of the line, is mathematical objects."}, {"time": 4113, "text": "And I'm with those, the many people that would say, mathematics is an experience of the immaterial."}, {"time": 4119, "text": "I've stepped out of a merely empirical, physical, naturalistic world."}, {"time": 4125, "text": "The minute I understand a pure number or a pure equation or a pure mathematical relationship, which would obtain in any possible world, which are not tied to space and time, that's a first step out of the cave."}, {"time": 4141, "text": "And then that leads to the more metaphysical reflections."}, {"time": 4145, "text": "For example, in the nature of being."}, {"time": 4147, "text": "I mean, so I could talk about this thing as a physical object and I can analyze it at all kinds of levels and follow all the scientists up and down through this thing, and fine, fine."}, {"time": 4156, "text": "But I'm still in Plato's cave."}, {"time": 4157, "text": "I'm still looking at the flickering images on the wall."}, {"time": 4160, "text": "But when I step out of that into the mathematical realm, I have entered a different realm of being, seems to me."}, {"time": 4168, "text": "Do you think it's possible for the cave to expand so large that it encompasses the whole world?"}, {"time": 4172, "text": "Meaning, is it possible that we're just clueless right now in terms of, scientifically speaking, with most of the world we haven't figured out yet?"}, {"time": 4185, "text": "But do you think it's possible through science to know God, to look outside the world?"}, {"time": 4190, "text": "So it's fundamentally the limit of the empirical scientific method, is that we can't know some of these very big questions."}, {"time": 4197, "text": "No, I'm not a scientist, and I was never all that good at science."}, {"time": 4202, "text": "I was more of a humanities guy."}, {"time": 4203, "text": "But I love and respect the sciences, but I hate scientism."}, {"time": 4206, "text": "And scientism is rampant today, with especially young people."}, {"time": 4210, "text": "The reduction of all knowledge to the scientific form of knowledge."}, {"time": 4213, "text": "And I'm a vehement opponent of that."}, {"time": 4216, "text": "There are dimensions of being that are not capturable through a scientific method of mere observation, hypothesis formation, experimentation, et cetera."}, {"time": 4224, "text": "As great as that is, as wonderful as that is, but it's still, I think, within Plato's cave."}, {"time": 4229, "text": "And that's not to say it's not real."}, {"time": 4231, "text": "It's just at a relatively low level of reality."}, {"time": 4234, "text": "You step out of Plato's cave when you go into pure mathematics."}, {"time": 4237, "text": "That's why, you know that article, I just came across it recently, and discovered this whole literature around it, is Eugene Wigner's article, 1960, called the unreasonable applicability of mathematics to the physical sciences."}, {"time": 4250, "text": "I think that's the title of it."}, {"time": 4251, "text": "Or effectiveness or something like that, yeah."}, {"time": 4253, "text": "But what's so cool is that he's not a religious man."}, {"time": 4256, "text": "He was kind of a secular Jew."}, {"time": 4257, "text": "But yet he uses the word miracle like eight times in that article."}, {"time": 4261, "text": "Because he just is so impressed by the fact that high, complex mathematics describes so accurately the physical world and can be used to create things and to manipulate."}, {"time": 4273, "text": "And why should that be true?"}, {"time": 4275, "text": "That there's something very weirdly mysterious about that relationship."}, {"time": 4279, "text": "And I would say it's because you stepped into a higher order of being, which is inclusive of a lower level being."}, {"time": 4286, "text": "That's the Platonic approach, is that as you move, now I'm going to a different metaphor, you move to higher levels, they're inclusive of the lower levels."}, {"time": 4293, "text": "Yeah, there's some magic there that seems to, at least in our current understanding of science, to be not quite capturable."}, {"time": 4302, "text": "Even consciousness, the idea of consciousness."}, {"time": 4305, "text": "Can I ask you, where do you think the laws of nature come from?"}, {"time": 4308, "text": "So, I mean, sort of the Vigner question, where does the deep mathematical structure of things come from?"}, {"time": 4317, "text": "The mathematical structure or the fact that the structure is somehow pleasing and beautiful."}, {"time": 4324, "text": "Because those are two different."}, {"time": 4327, "text": "Well, do the first one first."}, {"time": 4328, "text": "I'm just curious to tell you, where do you think it comes from?"}, {"time": 4331, "text": "I tend to believe, even in terms of physics, we don't really know what's going on."}, {"time": 4335, "text": "There's so, so, so much more to be discovered."}, {"time": 4338, "text": "We're walking around in the dark trying to figure out a little puzzles here and there, and we're patting ourselves on the back and how many puzzles we've discovered so far."}, {"time": 4348, "text": "Even Gadot's incompleteness theorem, what are the limits of mathematics, axiomatic systems?"}, {"time": 4353, "text": "I don't know what is the purpose of mathematics, what is the power of mathematics?"}, {"time": 4358, "text": "Is it just a useful tool to study the world around us, or is it something deeper that we're just discovering?"}, {"time": 4370, "text": "All I know from my emotional perspective, now I am an engineer, I'm a robotics AI person, from an emotional perspective, I just find the whole thing beautiful."}, {"time": 4379, "text": "Yeah, but that's really cool to me."}, {"time": 4381, "text": "That's a very interesting clue."}, {"time": 4383, "text": "See, one of the arguments for God is based on the intelligibility of the world."}, {"time": 4388, "text": "It's like Wigner, it's a very peculiar fact, it seems to me, that the world is so radically intelligible."}, {"time": 4393, "text": "Why should that be true?"}, {"time": 4394, "text": "Why should it be the case that being has this intelligible structure to it?"}, {"time": 4398, "text": "So it corresponds to an inquiring mind."}, {"time": 4401, "text": "So Aquinas can say that the intelligible in act is the intellect in act."}, {"time": 4407, "text": "Meaning there's some deep correspondence between this and that."}, {"time": 4412, "text": "And I'm with Wigner."}, {"time": 4414, "text": "That's, I think, really weird and unreasonable and strange."}, {"time": 4419, "text": "Now, my answer is, because the creator of the universe is a great mind and has stamped the world with intelligibility."}, {"time": 4430, "text": "In the beginning was the Word, right?"}, {"time": 4432, "text": "And the Word was with God, and all things came to be through the Word."}, {"time": 4436, "text": "We shouldn't picture that so much."}, {"time": 4438, "text": "It's gesturing in this very powerful direction."}, {"time": 4441, "text": "There's an intelligence that has imbued the world with intelligibility."}, {"time": 4447, "text": "And we discover that, you know?"}, {"time": 4449, "text": "There's something about the simplicity of the way the world works, that's where the beauty comes from."}, {"time": 4455, "text": "And yes, there's something profound to the mechanism, whatever that is, God, that brought that to be."}, {"time": 4463, "text": "That thought it into being."}, {"time": 4465, "text": "That the world has been, and the Bible says that God said, \"'Let there be light,' and there was light.\""}, {"time": 4469, "text": "God said, well, again, we don't literalize the poetry, but it's very rich that God spoke the world into being."}, {"time": 4477, "text": "So that means it's been imbued with intelligibility from the beginning."}, {"time": 4482, "text": "They say that the condition for the possibility of the Western physical sciences was a basically Christian idea, namely that the world is not God."}, {"time": 4491, "text": "Therefore, I can analyze it, experiment upon it."}, {"time": 4494, "text": "I don't divinize it."}, {"time": 4495, "text": "I don't have a mystical relation to the world."}, {"time": 4497, "text": "It's not God."}, {"time": 4499, "text": "But secondly, that it's absolutely in every nook and cranny intelligible."}, {"time": 4503, "text": "And those two ideas are correlated to the idea of creation."}, {"time": 4506, "text": "So it's been created, it's not God, it's other than God, but yet it's touched in every dimension by God's mind."}, {"time": 4513, "text": "And when those two things are in place, the sciences get underway."}, {"time": 4517, "text": "You know, I don't worship the world anymore, but I'm also utterly confident I can come to know it."}, {"time": 4522, "text": "And those are theological ideas."}, {"time": 4524, "text": "Well, we live in this world, so we can solve quite a lot of problems of this world by making the assumption that this world is fully understandable."}, {"time": 4534, "text": "And we don't need to worry about what's outside the world in some sense in order to build bridges and rockets and computers and all that kind of stuff."}, {"time": 4543, "text": "It's only when we get to the questions that are deeper about why we're here at all, what does it mean to be good, all those kinds of things do we need to reach outside of this world?"}, {"time": 4554, "text": "Can I introduce another one?"}, {"time": 4555, "text": "So I talked about mathematics."}, {"time": 4557, "text": "I think it's stepping out of the cave, it's stepping out of just the purely empirical world."}, {"time": 4562, "text": "But the very fact that we use a word like universe to me is very interesting."}, {"time": 4566, "text": "Even if you say multiple universes, to me it's like, well, whatever the whole is, the totality."}, {"time": 4573, "text": "Universum, turn toward the one."}, {"time": 4577, "text": "Why would we call it that?"}, {"time": 4578, "text": "Why wouldn't we just call it an aggregate?"}, {"time": 4580, "text": "You know, it's just an aggregate of stuff."}, {"time": 4582, "text": "It's an aggregate of all kinds."}, {"time": 4583, "text": "But we call it a universe."}, {"time": 4584, "text": "And my answer from the classical metaphysical tradition is it's the intuition of being."}, {"time": 4590, "text": "So I immediately experience things here, the color and shape, and I can measure them."}, {"time": 4595, "text": "But when I've really stepped out of the cave and I've now engaged beyond mathematics even, I'm now into metaphysical reflection."}, {"time": 4601, "text": "I'm interested not just in this thing as an object and how it's colored and shaped and what its atoms and quarks and all that are."}, {"time": 4609, "text": "But I'm interested now in, I don't mean to say this thing is real."}, {"time": 4613, "text": "So what makes this a being?"}, {"time": 4616, "text": "And then what are the characteristics of being?"}, {"time": 4618, "text": "So now from Aristotle to Heidegger, this question of the nature of being."}, {"time": 4622, "text": "But see, I would say we call it a universe because it's turned toward the one of being."}, {"time": 4628, "text": "It's this intuition that whatever, from quarks to galaxies to whatever, give me a billion other universes, it would still be existence, right?"}, {"time": 4637, "text": "It's turned toward the one."}, {"time": 4639, "text": "That being unites our experience."}, {"time": 4642, "text": "And so now I'm at the metaphysical level of analysis."}, {"time": 4644, "text": "I've taken another step out of the cave."}, {"time": 4647, "text": "In Plato's language, I'm at the formal level now, beyond mathematics, the level of forms."}, {"time": 4651, "text": "And the formal is inclusive of the mathematical, which is inclusive of the physical."}, {"time": 4656, "text": "And I think that's Eugene Wigner, is that the mathematical includes the physical."}, {"time": 4659, "text": "It is metaphysically prior to it."}, {"time": 4663, "text": "But here we are sitting in the physical trying to make sense of why the unreasonable effectiveness is the thing that's beyond, which is the mathematics."}, {"time": 4671, "text": "My answer is God."}, {"time": 4673, "text": "And I don't know a better answer."}, {"time": 4674, "text": "And as I read Wigner, he wasn't ready to say that."}, {"time": 4678, "text": "But I think the language is gesturing."}, {"time": 4681, "text": "I was reading someone recently, some very well known physicist, who said his answer to Wigner's question is that whoever is responsible for the universe must be a mathematician."}, {"time": 4693, "text": "And I thought, yeah, that's right."}, {"time": 4696, "text": "Let me ask you about Jordan Peterson."}, {"time": 4698, "text": "We had a great conversation with him."}, {"time": 4700, "text": "He has a complicated and nuanced view of faith, or faith period."}, {"time": 4706, "text": "He has said that he believes in Jesus, the person and the myth, and some of the full richness and complexity that you've talked about."}, {"time": 4715, "text": "But he's surprised by his faith."}, {"time": 4717, "text": "He's not sure what to make of it."}, {"time": 4719, "text": "He's almost like meta struggling with what the heck his faith means."}, {"time": 4723, "text": "He's a super powerful intellect that can't compute the faith that he's experiencing."}, {"time": 4729, "text": "So what are some interesting differences between the two of you, or some commonalities in terms of your understanding of faith?"}, {"time": 4739, "text": "He's a very interesting guy."}, {"time": 4740, "text": "I've had a couple of conversations with him."}, {"time": 4742, "text": "And I do think he's moving in the direction of faith."}, {"time": 4746, "text": "And his lectures on the Bible are very fine, I think."}, {"time": 4749, "text": "He reminds me of the church fathers, because the church fathers would have looked at the, they call it the moral sense of the scripture."}, {"time": 4755, "text": "Peterson probably called it the psychological meaning."}, {"time": 4758, "text": "But I think he's doing a lot of that."}, {"time": 4759, "text": "He, as I read him and talk to him, I think he's kind of at a Kantian level in regard to Jesus."}, {"time": 4765, "text": "What I mean there is, for Kant, Jesus is, it's not so much the historical Jesus, this figure from long ago."}, {"time": 4771, "text": "It's Jesus as an archetype of the moral life."}, {"time": 4775, "text": "You know, he says he's the image of the person perfectly pleasing to God."}, {"time": 4779, "text": "And so Jesus inhabits our kind of moral imagination as a heuristic, as a goal that we're tending toward."}, {"time": 4788, "text": "But the historical person of Jesus for Kant is like, well, let's not fuss about that so much."}, {"time": 4792, "text": "It's this figure."}, {"time": 4794, "text": "And as I read Peterson, especially, and talk to him, I think he's kind of there with the archetype of Jesus."}, {"time": 4801, "text": "And even language of like, live as though God exists."}, {"time": 4804, "text": "That's the als ob of Kant."}, {"time": 4806, "text": "You know, the kind of as if attitude."}, {"time": 4809, "text": "And where I repress him when we talk is in the direction of, no, that's not Christianity yet."}, {"time": 4814, "text": "I mean, that's enlightenment moral philosophy."}, {"time": 4818, "text": "But Christianity is very interested in this historical figure, and very interested that God really became one of us."}, {"time": 4826, "text": "And he's not just an archetype of the moral life."}, {"time": 4829, "text": "He's someone, he's a person who's invaded our world and gone all the way to the bottom of sin and thereby saved us, you know."}, {"time": 4837, "text": "So the facticity of Jesus ended up the resurrection."}, {"time": 4840, "text": "So like, Peterson will talk about the resurrection as a myth and all that."}, {"time": 4845, "text": "And you can find that in different cultures, et cetera."}, {"time": 4847, "text": "But Christianity is saying something else."}, {"time": 4851, "text": "So in Christianity, when we're talking about who is Jesus, it's not just an archetype."}, {"time": 4856, "text": "It's not just a myth."}, {"time": 4857, "text": "It's a historical figure."}, {"time": 4859, "text": "And the very grounded fact that God became one of us is fundamental to this idea of what Christianity is, what it means to be a Christian."}, {"time": 4869, "text": "It's the sin and the love that came here down to earth."}, {"time": 4876, "text": "It means we can be one with God."}, {"time": 4877, "text": "So that's essential."}, {"time": 4878, "text": "It's not just an archetype."}, {"time": 4880, "text": "You know, it always strikes me, the difference between, let's say, mythic expressions and the New Testament."}, {"time": 4888, "text": "Read someone like Carl Jung and then Joseph Campbell, whom he influenced, and then now Jordan Peterson, who's very Jungian."}, {"time": 4895, "text": "And this sort of archetypal reading of the scriptures."}, {"time": 4897, "text": "And great."}, {"time": 4898, "text": "I mean, I think it's very interesting, and there's a lot going on there."}, {"time": 4902, "text": "There's a sort of calmness, though, about it."}, {"time": 4904, "text": "Like, yeah, interesting."}, {"time": 4905, "text": "And that's in this culture and that culture, and it's the form of the moral life, and mm hmm, I understand all that."}, {"time": 4911, "text": "Then you read the New Testament."}, {"time": 4913, "text": "Whatever those people are talking about, it's not that."}, {"time": 4917, "text": "They are grabbing you by the shoulders and shaking you to get your attention, to tell you about something that happened to them, right?"}, {"time": 4926, "text": "Like the resurrection, you know, the myth of the dying and rising God and how powerful it is in shaping our consciousness."}, {"time": 4933, "text": "Mm hmm, that's fascinating."}, {"time": 4935, "text": "That's not the New Testament."}, {"time": 4936, "text": "The New Testament is, did you hear?"}, {"time": 4938, "text": "Did you, Jesus of Nazareth, whom they put to death, God raised him from the dead, and he was seen by 500, and he was seen by Peter."}, {"time": 4946, "text": "And then lastly, I saw him."}, {"time": 4949, "text": "That's how Paul talks."}, {"time": 4951, "text": "It's not the detached, you know, psychologist musing on archetypal things."}, {"time": 4957, "text": "And I think that makes a huge difference when it comes to Christianity."}, {"time": 4961, "text": "The intensity of the historical details are essential here."}, {"time": 4995, "text": "So the historical nature of the Bible."}, {"time": 4998, "text": "We're an historical religion."}, {"time": 4999, "text": "And we've been, it's important."}, {"time": 5001, "text": "We generate philosophical reflection."}, {"time": 5003, "text": "We can find common ground with archetypal thinking and all that, we can."}, {"time": 5008, "text": "And the church fathers used Greek philosophy, and Aquinas uses Aristotle, and all that's great."}, {"time": 5013, "text": "But we're an historical religion, and that matters immensely."}, {"time": 5017, "text": "Is the Bible the literal word of God?"}, {"time": 5020, "text": "How do you make sense of the words that make up the Bible?"}, {"time": 5024, "text": "I think the best way to get at the Bible is to think of it as a library, not a book."}, {"time": 5028, "text": "So it's a collection of books, right, from a wide variety of periods, different authors, different audiences, and different genre."}, {"time": 5036, "text": "So in the Bible, you find poetry, you find song, you find something like history, not in our sense, but something like history."}, {"time": 5043, "text": "You find gospel, which is its own genre."}, {"time": 5045, "text": "You find epistolary literature like Paul."}, {"time": 5048, "text": "You find apocalyptic."}, {"time": 5050, "text": "There's all this in the Bible."}, {"time": 5053, "text": "So is the Bible literally the word of God?"}, {"time": 5055, "text": "It's like saying, is the library literally true?"}, {"time": 5058, "text": "It depends on what section you're in, right?"}, {"time": 5060, "text": "So parts of like one and two Samuel, one and two Kings, number of places in the Old Testament."}, {"time": 5067, "text": "Are there elements of the historical in there?"}, {"time": 5069, "text": "Sure, but it's theologically interpreted history."}, {"time": 5071, "text": "It's not like our sense of history of, you know, give me 10,000 footnotes and I'm gonna look at all the source material I can possibly find."}, {"time": 5080, "text": "It's more like ancient history, like Herodotus, people like that."}, {"time": 5084, "text": "But then there's poetry and there's myth and there's legend and there's song and all that stuff in the Bible."}, {"time": 5088, "text": "So God breathes through all of it, I would say."}, {"time": 5095, "text": "He inspired all of it, right, inspirare."}, {"time": 5098, "text": "He's breathing through all of it."}, {"time": 5100, "text": "God is speaking through all of it."}, {"time": 5102, "text": "But he speaks in different voices."}, {"time": 5105, "text": "He uses different human instruments and he uses different genre and different types of language."}, {"time": 5109, "text": "So we have to be sensitive to that when we're interpreting the Bible."}, {"time": 5112, "text": "So the different instruments are more or less, some are more perfect than others in terms of music?"}, {"time": 5118, "text": "No, I wouldn't say that."}, {"time": 5118, "text": "I wouldn't say more perfect."}, {"time": 5119, "text": "I'd say they're just different."}, {"time": 5120, "text": "It's like a symphony and God's like a conductor and there's all kinds of different instruments in the orchestra and he loves to breathe through the Psalms."}, {"time": 5127, "text": "I prayed the Psalms this morning, I do every day."}, {"time": 5129, "text": "In my office, you know, those are songs."}, {"time": 5132, "text": "They probably were literally sung, most of them, at one point."}, {"time": 5135, "text": "He breathes through apocalyptic."}, {"time": 5138, "text": "Like we're reading the book of Revelation now in the Easter season and it's this wild and woolly book."}, {"time": 5143, "text": "It should be filmed by Spielberg or somebody today."}, {"time": 5147, "text": "And he speaks through the Gospels."}, {"time": 5149, "text": "The Gospels correspond in genre to what I call ancient biography."}, {"time": 5154, "text": "That's the genre of the Gospels."}, {"time": 5156, "text": "It's wrong to call them like mythic or simply literary."}, {"time": 5159, "text": "They're like ancient biographies."}, {"time": 5162, "text": "You have the Pauline letters which are about particular cities that Paul was visiting and particular people he knew."}, {"time": 5169, "text": "So you just gotta be sensitive to the genre all the time."}, {"time": 5172, "text": "Let's return back to human institutions and talk about history of human civilization and politics."}, {"time": 5179, "text": "So one question to ask is was America founded as a Christian nation in your view?"}, {"time": 5186, "text": "If we look at the Declaration of Independence, what did the words mean?"}, {"time": 5190, "text": "We hold these truths to be self evident that all men are created equal, that they are endowed by their creator with certain inalienable rights that among these are life, liberty, and the pursuit of happiness."}, {"time": 5203, "text": "It seems like God is breathing through those words too."}, {"time": 5209, "text": "The founders would be some kind of combination of deism, certainly Christianity is coming up through them, enlightenment, rationalism, all in kind of a mix."}, {"time": 5221, "text": "So you're not gonna find in our founding fathers simply a Thomas Aquinas or like a purely classically Christian understanding."}, {"time": 5228, "text": "It's Christianity in those various expressions."}, {"time": 5231, "text": "Because actually I would see the enlightenment as a sort of child of Christianity."}, {"time": 5236, "text": "We could talk about that."}, {"time": 5237, "text": "But having said all that, yes, I think they are expressing at least the residue of a once deeply integrated Christian sense of things that our rights are not created by the government."}, {"time": 5252, "text": "They're not doled out by the government."}, {"time": 5256, "text": "They come from God."}, {"time": 5257, "text": "And the other thing I find really interesting is equality because look in classical philosophy, political philosophy, Plato, Aristotle, Cicero, it's not equality."}, {"time": 5267, "text": "For them it's our inequality that's really interesting."}, {"time": 5270, "text": "So Plato divides us into these three classes and Aristotle says only a tiny little coterie of property males of sufficient education should be in the political life."}, {"time": 5279, "text": "The rest should all be in private life."}, {"time": 5281, "text": "And then some are suited for slavery."}, {"time": 5283, "text": "So I mean he divides us dramatically."}, {"time": 5285, "text": "Same with Cicero and so on."}, {"time": 5288, "text": "Where does this come from, this weird idea that we're all equal?"}, {"time": 5292, "text": "I mean how?"}, {"time": 5292, "text": "We're not equal in beauty, not equal in strength."}, {"time": 5294, "text": "We're not equal in moral attainment."}, {"time": 5296, "text": "We're not equal in intelligence."}, {"time": 5300, "text": "And I think the residue especially comes through in that little word that all men are created equal."}, {"time": 5307, "text": "That's our equality, that we're all equally children of God."}, {"time": 5311, "text": "So take God out of the picture."}, {"time": 5312, "text": "I think we are gonna slide rapidly into an embrace of inequality."}, {"time": 5318, "text": "Now in the classical world, yes, but heck, look at the 20th century."}, {"time": 5322, "text": "I mean when God is excluded in a very systematic way, I think you saw the suspension of rights and the suspension of equality like mad."}, {"time": 5331, "text": "So no, I think it's very important that God is in the picture and that we're a nation under God."}, {"time": 5337, "text": "It matters enormously."}, {"time": 5338, "text": "That's not pious boilerplate."}, {"time": 5340, "text": "That's at the rational foundations of our democracy."}, {"time": 5343, "text": "So do you think Nietzsche was onto something with the idea, looking into the 20th century, that God is dead?"}, {"time": 5350, "text": "That there is a cultural distancing from a belief in God?"}, {"time": 5359, "text": "Yeah, I'd be somewhat sympathetic to Jordan Peterson's reading of Nietzsche there."}, {"time": 5363, "text": "Namely, it's not Nietzsche crowing from the mountaintop."}, {"time": 5366, "text": "Hey, God is dead."}, {"time": 5368, "text": "It's more of a lament."}, {"time": 5370, "text": "God is dead and we've killed him."}, {"time": 5372, "text": "And what will happen in the wake of that?"}, {"time": 5375, "text": "And I think, yeah, much of the totalitarianism of the 20th century follows from that questioning of God and the dismissal of God from public life."}, {"time": 5386, "text": "So I would be sympathetic with that."}, {"time": 5390, "text": "When we're beyond good and evil, and all that's left is the will to power, and then why are we surprised at the powerful rise and that they use the powerless for their purposes?"}, {"time": 5401, "text": "When we forget ideas like equality and rights, which are grounded in God, why are we surprised that death camps follow?"}, {"time": 5408, "text": "So I think there's a correlation there for sure."}, {"time": 5411, "text": "I don't know, I believe that there's a capacity to do good in all of us and a capacity to do evil, and there's something that tends towards good, whatever that is."}, {"time": 5422, "text": "I tend to think that if that community, that love that we talked about, they find each other, they find the good."}, {"time": 5430, "text": "If you don't constrain the resources, if you don't push them, if you don't artificially create conflict through power centers and evil charismatic leaders, then people will be good to each other."}, {"time": 5442, "text": "And whether that's God or some other source of deep moral meaning, that seems to be essential for a functioning civilization."}, {"time": 5456, "text": "And it's hard, I mean, that's what humans are."}, {"time": 5458, "text": "We're searching for what that God is, what that means."}, {"time": 5461, "text": "You know what that triggers in my mind?"}, {"time": 5462, "text": "I wonder if you agree with this, that the modern sciences drew their strength from their narrowness."}, {"time": 5467, "text": "And what I mean there is they almost completely bracketed formal and final causality in the Aristotelian sense, and they focused on efficient and material causality."}, {"time": 5476, "text": "And that gave, as I say, great strength, but from the narrowness of focus."}, {"time": 5480, "text": "But for Aristotle, the more important causes are the final and the formal causes."}, {"time": 5484, "text": "And so final causality there, what's drawing us?"}, {"time": 5488, "text": "So for Aristotle, he'd look at someone like me and say, okay, you have a intelligible structure, and that leads you to seek certain things for the perfection of that structure, you know?"}, {"time": 5500, "text": "And fair enough, I think that's right."}, {"time": 5501, "text": "So I seek the good."}, {"time": 5502, "text": "Right now, I'm seeking the good of being with you."}, {"time": 5504, "text": "I said, yeah, I'll sit down with Lex Friedman and we'll talk about deep and important things."}, {"time": 5509, "text": "That's the good I sought this morning when I woke up."}, {"time": 5512, "text": "Now, why am I seeking that?"}, {"time": 5514, "text": "Well, for a higher reason, a higher good, you know?"}, {"time": 5516, "text": "Because it's part of my work, my ministry is to, you know, the church reaching out beyond itself to the wider culture, and okay, well, why do you want that?"}, {"time": 5528, "text": "Well, because I want to bring more and more people into what I think is beautiful and true and good in the church."}, {"time": 5533, "text": "Well, how come you want that?"}, {"time": 5535, "text": "Well, because a long time ago, I was kind of myself brought into that realm and find it very compelling."}, {"time": 5541, "text": "Yeah, but then why do you want that?"}, {"time": 5542, "text": "Well, because ultimately, I want to be friends with God."}, {"time": 5545, "text": "Now, I've given you one example there, but any act of the will, it seems to me, has to be analyzed that way."}, {"time": 5552, "text": "The will seeks something."}, {"time": 5554, "text": "It seeks the good, right, by definition."}, {"time": 5556, "text": "But the good always nests like a Russian doll in a higher good, right, which then nests into still higher good."}, {"time": 5563, "text": "Until you come, this is Aquinas, to some, in this sense, uncaused cause, an uncaused final cause, there has to be some summum bonum, right, some supreme good that you're looking for."}, {"time": 5577, "text": "And that's God, by the way."}, {"time": 5579, "text": "That's another, I think, rational path to God, is every single moment, every day, we are implicitly seeking God."}, {"time": 5587, "text": "So with your Word on Fire ministries and the website and the communication efforts, what is the thing you're seeking?"}, {"time": 5595, "text": "Just you, if we can pause and for a brief moment, allow you to be prideful."}, {"time": 5601, "text": "Or, of course, just joking, but what is your local efforts, your small little pocket of the world with small, in quotes, with Word on Fire?"}, {"time": 5615, "text": "Yeah, it's just using the media, especially the new media, the social media, to get the gospel out."}, {"time": 5621, "text": "So I started, what, 20 some years ago, just on a radio show in Chicago, 515 on Sunday morning."}, {"time": 5627, "text": "I had a 15 minute sermon show."}, {"time": 5629, "text": "And I asked the people in this parish I was at, I said, I need $50,000 to get on for 15 minutes at 515 on Sunday morning."}, {"time": 5636, "text": "And they all laughed when I proposed that, but they gave me the money."}, {"time": 5640, "text": "So that's how I got started, just doing a sermon on the radio."}, {"time": 5642, "text": "And then it branched off into video stuff and TV."}, {"time": 5646, "text": "And then I did a documentary."}, {"time": 5648, "text": "I went all over the world and kind of told the story of Catholicism."}, {"time": 5651, "text": "So that's how we started."}, {"time": 5652, "text": "And now I'm using all the new media and social media."}, {"time": 5655, "text": "But what I really love, what we're doing today, something I really like, which is having a conversation outside of just the narrow Catholic world or even the narrow Christian world, but to look out to the wider culture and who's talking about interesting things and how can the church engage there?"}, {"time": 5671, "text": "And so that's the purpose of Word on Fire."}, {"time": 5674, "text": "Is it overwhelming to face so many different atheists than complex thinkers like Jordan Peterson and some of the more political style thinkers that you've spoken with?"}, {"time": 5689, "text": "Is that, what is it, Dave Rubin, who's also has a way different worldview as well?"}, {"time": 5698, "text": "Is that terrifying?"}, {"time": 5701, "text": "Is it challenging?"}, {"time": 5703, "text": "Yeah, maybe all of the above, but more exciting."}, {"time": 5706, "text": "I would say I like doing that."}, {"time": 5708, "text": "I was a teacher for a long time."}, {"time": 5709, "text": "I taught in the seminary for like 20 years."}, {"time": 5710, "text": "And so I've been engaging these questions for a long time."}, {"time": 5713, "text": "I'm a writer."}, {"time": 5714, "text": "I've written about 20 some books."}, {"time": 5715, "text": "And I write some at a popular level."}, {"time": 5717, "text": "I write some at a high academic level."}, {"time": 5719, "text": "And I like doing all that."}, {"time": 5721, "text": "So I love those ideas."}, {"time": 5723, "text": "I love those questions, love engaging people."}, {"time": 5726, "text": "And I find my own experience, you do run into, of course, a lot of the vitriol and kind of just stupidity and all that online."}, {"time": 5734, "text": "And I get it."}, {"time": 5735, "text": "And religion is such a magnet for people's hostility for different reasons."}, {"time": 5740, "text": "So I get that."}, {"time": 5740, "text": "Like you read it, we talked about, you have to wade through swamps of obscenity and everything."}, {"time": 5747, "text": "But I do it."}, {"time": 5750, "text": "And it's worthwhile."}, {"time": 5751, "text": "Because in that Reddit experience, so many of the issues that preoccupy young people, I can name them for you."}, {"time": 5757, "text": "Exactly what they are."}, {"time": 5758, "text": "It comes to religion."}, {"time": 5759, "text": "How do you know there's a God?"}, {"time": 5761, "text": "So the God question."}, {"time": 5762, "text": "Secondly, why is there so much suffering in the world?"}, {"time": 5765, "text": "Third question, why do you think your religion is the right religion?"}, {"time": 5768, "text": "Fourth, why are you so mean to gay people?"}, {"time": 5771, "text": "So those are the four things that I, again and again, come up when dealing with young people."}, {"time": 5776, "text": "I've told my brother bishops and priests about that."}, {"time": 5779, "text": "I said, structure your adult education programs or structure your youth outreach around those four questions."}, {"time": 5786, "text": "Well, let me ask you about gay marriage."}, {"time": 5788, "text": "How do we make sense of the love between a man and a man and a woman and a woman and the institution of marriage?"}, {"time": 5797, "text": "We love friendship."}, {"time": 5799, "text": "And friendship is at the heart of things."}, {"time": 5801, "text": "And so nothing wrong with friendship between a man and a man, a woman and a woman."}, {"time": 5805, "text": "But go back to Aristotle, Thomas Aquinas about natural finalities and intelligible forms, that there's a certain form to human being, which includes the physical and includes the sexual."}, {"time": 5816, "text": "It has a proper finality."}, {"time": 5818, "text": "And so we'd recognize that finality is twofold, both unitive and procreative."}, {"time": 5823, "text": "And so those two we recognize as the appropriate expression of human sexuality."}, {"time": 5828, "text": "So that's why the church holds to sex between a man and a woman within the context of marriage is the right expression."}, {"time": 5838, "text": "We reach out to everybody in love and in respect and deep understanding and seeking to understand their lives from the inside."}, {"time": 5848, "text": "So I mean, all of that, I agree with the bridge building that we need to do to people like in the gay community and people in gay marriage and so on."}, {"time": 5856, "text": "So the church holds to the intelligible structure, if you want, of human sexuality and it reaches out to real human beings always in an attitude of invitation and love and so on."}, {"time": 5867, "text": "So it's somewhere in there that the church takes its stance."}, {"time": 5871, "text": "And so there's probably variation in the stances that it takes."}, {"time": 5878, "text": "So you're saying the institution of marriage is about the unitive, which is like the friendship, the deep connection between two humans and the procreative."}, {"time": 5888, "text": "So being able to have children and all that kind of stuff."}, {"time": 5894, "text": "So is our gay couples seen as sinful?"}, {"time": 5899, "text": "So does the church acknowledge the love?"}, {"time": 5904, "text": "That's the deep love that's possible between a man and a man."}, {"time": 5907, "text": "Yeah, which is why the church says in its official teaching, it's the physical expression, let's say, of sexual passion between two men that is problematic, not their friendship, not their love for each other."}, {"time": 5920, "text": "So I think, yeah, we confirm the first."}, {"time": 5923, "text": "Well, let me ask you another difficult topic that's just happening."}, {"time": 5926, "text": "Unlike the other ones we talked about."}, {"time": 5929, "text": "That's going on in the news now."}, {"time": 5931, "text": "As we sit here today, the Supreme Court has voted to overturn abortion rights in a draft majority opinion striking down the landmark Roe versus Wade decision."}, {"time": 5944, "text": "First of all, the human institution of the Supreme Court making these decisions throughout its history."}, {"time": 5950, "text": "And second of all, just the idea, the really powerful, the controversial, the difficult idea of abortion."}, {"time": 5960, "text": "Yeah, I mean, I'm against abortion."}, {"time": 5962, "text": "I'm pro life."}, {"time": 5965, "text": "The church recognizes from the moment of conception, we're dealing with a human life that's worthy of respect and protection."}, {"time": 5972, "text": "Especially as you see the unfolding of that person across a pregnancy."}, {"time": 5978, "text": "But at every stage, we recognize the beauty and the dignity of that human being."}, {"time": 5984, "text": "And so we stand opposed to this, the outright killing of the innocent."}, {"time": 5989, "text": "So that's the church's view."}, {"time": 5992, "text": "Again, reaching out always in love and understanding and compassion to those who are dealing."}, {"time": 5998, "text": "And believe me, every single pastor, every single priest understands that, because we deal with people all the time who are in these painful situations."}, {"time": 6005, "text": "But that's the moral side of it."}, {"time": 6008, "text": "The legal side, I think Roe v. Wade was terribly decided."}, {"time": 6011, "text": "I think one of the worst expressions of American law since the Dred Scott decision."}, {"time": 6015, "text": "So I stand in favor of a returning Roe v. Wade and Casey."}, {"time": 6019, "text": "I think they were terrible."}, {"time": 6021, "text": "The Casey decision is instructive to me."}, {"time": 6025, "text": "It belongs to the nature of freedom, that decision says, to determine the meaning of one's own life."}, {"time": 6030, "text": "And I don't get the language exactly right, but end of the universe."}, {"time": 6034, "text": "Like it gives this staggering scope to our freedom, that we can determine the meaning."}, {"time": 6040, "text": "See, but that's repugnant to everything we've just talked about."}, {"time": 6043, "text": "That I'm inventing the meaning of my life and of the universe."}, {"time": 6048, "text": "And so Casey, though, was instructive in a way because it tips its hat toward the problem culturally, is that I think in my freedom, I can determine everything."}, {"time": 6059, "text": "My choice is all that matters."}, {"time": 6061, "text": "And I would say, no, your choice should be correlated to the order of the good."}, {"time": 6066, "text": "It's not sovereign."}, {"time": 6068, "text": "It doesn't reign sovereignly over being and it makes its own decisions."}, {"time": 6072, "text": "So I think Casey was terrible law and it was backing up Roe v. Wade, which is terrible law."}, {"time": 6078, "text": "So I'm in favor of the overturning of those."}, {"time": 6080, "text": "I've spoken out that many times."}, {"time": 6082, "text": "Now it'll return it to the individual states."}, {"time": 6084, "text": "It's not gonna solve the problem."}, {"time": 6087, "text": "The individual states will have to decide."}, {"time": 6089, "text": "I just heard yesterday, we were up in Sacramento, the bishops having our annual meeting."}, {"time": 6095, "text": "And so we got the word from the governor and the legislators that they're gonna push for a constitutional amendment in California."}, {"time": 6101, "text": "So basically to make any attempt to limit abortion in any way just illegal."}, {"time": 6107, "text": "I think that's barbaric."}, {"time": 6109, "text": "So I stand radically opposed to that."}, {"time": 6111, "text": "It's such an interesting line because if you believe that there's a, it's a line that struggles with the question of what does it mean to be a living being or to give life to something."}, {"time": 6128, "text": "Because if you believe that at the moment of conception you're basically creating a human life, then abortion is murder."}, {"time": 6139, "text": "And then if you don't, then it's a sort of basic biological choice that's not taking away of a life."}, {"time": 6150, "text": "And the gap between those two beliefs is so vast that it's hard and yet so fundamental to the question of what it means to be alive and the fundamental question about the respect for human life and human dignity."}, {"time": 6165, "text": "It's interesting to see."}, {"time": 6169, "text": "And also about freedom too."}, {"time": 6171, "text": "All of those things are mixed in there."}, {"time": 6173, "text": "It's a beautiful struggle."}, {"time": 6175, "text": "Maybe the freedom is the most important, this sort of freedom run amok."}, {"time": 6178, "text": "Or in classical philosophy and theology, freedom is not self determination."}, {"time": 6187, "text": "Freedom is the disciplining of desire so as to make the achievement of the good first possible and then effortless."}, {"time": 6200, "text": "So modern freedom and the roots of that are people like William of Ockham in the late Middle Ages."}, {"time": 6206, "text": "Freedom means I hover above the yes and the no."}, {"time": 6208, "text": "Do I do yes or no?"}, {"time": 6209, "text": "And I'm the sovereign subject of that choice."}, {"time": 6211, "text": "And on no basis I will say yes or no."}, {"time": 6215, "text": "I'm like Louis XIV or I'm like Stalin or something."}, {"time": 6219, "text": "But Aquinas wouldn't have recognized that as freedom."}, {"time": 6222, "text": "For him, I got this desire in me."}, {"time": 6226, "text": "I've got this will and it's pushing toward the good."}, {"time": 6229, "text": "But the trouble is I got so many attachments and I'm so stupid and I'm so conditioned by my sin that I can't achieve it."}, {"time": 6236, "text": "So I need to be disciplined in my desire so as to make that achievement possible and then effortless so right now I'm freely speaking English to you."}, {"time": 6247, "text": "And you had the experience and I've had it too of learning a foreign language."}, {"time": 6251, "text": "And don't you feel unfree?"}, {"time": 6254, "text": "You know, like when you're struggling with a language."}, {"time": 6257, "text": "When I was over in Paris doing my doctoral work and I was okay with French, but my first time in a seminar and there's all these intelligent francophones around the table and they're all just, and I'm trying to say my little thing in my awkward French."}, {"time": 6272, "text": "And I felt unfree because my desire wasn't directed."}, {"time": 6280, "text": "But then over time I became freer and freer speaker of French."}, {"time": 6284, "text": "I was ordered more to the good."}, {"time": 6287, "text": "That's a better understanding of freedom than sort of sovereign self determination."}, {"time": 6291, "text": "But our country is now I think really in the grip of that."}, {"time": 6295, "text": "I decide and that's where the Nietzschean thing comes to my mind of the will to power."}, {"time": 6300, "text": "I'm beyond good and evil."}, {"time": 6301, "text": "It's just up to me to decide."}, {"time": 6304, "text": "God help us."}, {"time": 6305, "text": "No, it's the values that we intuit around us."}, {"time": 6308, "text": "Intellectual, moral and aesthetic, the values."}, {"time": 6311, "text": "Think of the dog on the beach again."}, {"time": 6312, "text": "And that you get ordered to those by your education, by your family, by your religion."}, {"time": 6319, "text": "That makes you free."}, {"time": 6320, "text": "Now I can freely enter into this."}, {"time": 6323, "text": "So this sovereign self determination business, that's not my game."}, {"time": 6328, "text": "The values come in part from the tradition carried through the generations."}, {"time": 6333, "text": "Let me ask you to put on your wise hat and give advice to young folks."}, {"time": 6338, "text": "So high school and college, thinking about what to do with their life, career, there's so many options out there."}, {"time": 6348, "text": "How can they have a career they can be proud of or even just a life they can be proud of?"}, {"time": 6356, "text": "I think I'd say find something you're good at because that's from God."}, {"time": 6361, "text": "It's a gift that God's given you."}, {"time": 6363, "text": "And then dedicate it to love."}, {"time": 6366, "text": "You're good at science or math or sports or whatever."}, {"time": 6371, "text": "Okay, I'm gonna use that now for my aggrandizement, for my wealth, for my privileges and to become famous."}, {"time": 6377, "text": "No, no, no, don't."}, {"time": 6379, "text": "Find what you're good at, but now dedicate it to willing the good of the other."}, {"time": 6383, "text": "So use your science and use your mathematics and use your sports and use your musicianship to benefit the world."}, {"time": 6392, "text": "That's how I'd say them."}, {"time": 6393, "text": "So find what you're good at."}, {"time": 6395, "text": "That's from God."}, {"time": 6395, "text": "Well, that's a tricky one."}, {"time": 6397, "text": "Finding what you're good at because it's not just raw skill."}, {"time": 6401, "text": "It's also what you connect with."}, {"time": 6403, "text": "And it's also like this iterative process of if you wanna add love to the world, you have to see how can you be effective at doing that."}, {"time": 6415, "text": "So it's not just the things you're good at."}, {"time": 6417, "text": "There's like, I'm good at building bridges out of toothpicks."}, {"time": 6422, "text": "I'm not exactly sure that's going to be useful for the world."}, {"time": 6425, "text": "Then again, to push back on that, the joy brings me, maybe somehow the joy radiates out."}, {"time": 6431, "text": "Yeah, well, you're good at what you're doing right now."}, {"time": 6433, "text": "And you've dedicated that to bringing more light and illumination and joy to the world."}, {"time": 6441, "text": "That was a searching."}, {"time": 6443, "text": "That's a process of trying stuff and figuring it out."}, {"time": 6447, "text": "And ultimately, yes, asking the question, how is this making the world at all better at every step of the way as opposed to enriching yourself and all those kinds of things?"}, {"time": 6457, "text": "Right, I think that's the name of the game."}, {"time": 6459, "text": "But it's tricky."}, {"time": 6460, "text": "And if we don't have moral mentors and intellectual mentors, it becomes hard."}, {"time": 6464, "text": "And if you tell a kid, that's deadly to me, just decide for yourself, just off you go."}, {"time": 6470, "text": "And you make your own choices."}, {"time": 6472, "text": "I mean, your choice has to be disciplined."}, {"time": 6475, "text": "Your desire has gotta be directed."}, {"time": 6477, "text": "Then you'll find your creative path."}, {"time": 6479, "text": "Everyone does it in its own way."}, {"time": 6481, "text": "But it's a guided choice."}, {"time": 6483, "text": "Your freedom is not sovereign."}, {"time": 6485, "text": "It's a guided freedom."}, {"time": 6488, "text": "So in the struggle and the suffering you've seen in the world, let me ask you the question of death."}, {"time": 6499, "text": "How often do you think about your own mortality?"}, {"time": 6503, "text": "And one, are you afraid of it, the uncertainty of it?"}, {"time": 6510, "text": "And what do you think happens after you die?"}, {"time": 6512, "text": "Sure, I'm afraid of it."}, {"time": 6513, "text": "I mean, because I don't know what's next."}, {"time": 6517, "text": "I mean, I can't know it the way I know you."}, {"time": 6519, "text": "So of course I'm afraid of it."}, {"time": 6521, "text": "And I think of it every day."}, {"time": 6525, "text": "My prayer life compels me."}, {"time": 6528, "text": "We have this, the Hail Mary prayer."}, {"time": 6531, "text": "So you pray the rosary."}, {"time": 6532, "text": "Now and at the hour of our death, amen."}, {"time": 6536, "text": "Now at the hour of our death, amen."}, {"time": 6538, "text": "You pray the whole rosary."}, {"time": 6539, "text": "50 times you've reminded yourself of your own death."}, {"time": 6543, "text": "But I do."}, {"time": 6544, "text": "I think about it because it's the ultimate limit."}, {"time": 6546, "text": "It's why it's beguiled every artist and writer and philosopher."}, {"time": 6549, "text": "It's the ultimate limit question."}, {"time": 6552, "text": "But yeah, sure."}, {"time": 6554, "text": "I'm afraid of it because it's the unknown."}, {"time": 6557, "text": "What do I think happens?"}, {"time": 6560, "text": "I think I'm drawn into the deeper embrace of God's love."}, {"time": 6565, "text": "You know, that's stating it kind of in a more poetic way."}, {"time": 6570, "text": "Do you know John Polkinghorne's work?"}, {"time": 6571, "text": "Do you know that name?"}, {"time": 6572, "text": "John Polkinghorne was a very interesting, he just died recently."}, {"time": 6575, "text": "He was a Cambridge University particle physicist, right?"}, {"time": 6578, "text": "High, high level scientist who at midlife became an Anglican priest."}, {"time": 6584, "text": "He left his job at Cambridge and went to the seminary and became an Anglican priest, right?"}, {"time": 6588, "text": "And then wrote, I think some of the best stuff on science and religion, because he really knew the science from the inside."}, {"time": 6594, "text": "Here's Polkinghorne's account that I've always found persuasive."}, {"time": 6598, "text": "He said, what survives after we die?"}, {"time": 6602, "text": "So this body clearly dies and goes into the ground or it's burned up or it goes away, right?"}, {"time": 6608, "text": "But what's preserved?"}, {"time": 6609, "text": "And he says, what Aristotle would have called the form, Polkinghorne calls it the pattern."}, {"time": 6614, "text": "So the pattern that's organized the matter that's made me up over all these years, that's obviously not the same as it was even, I mean, you would know how often does it all change, all your atoms and cells and, you know."}, {"time": 6628, "text": "In other words, the little, you know, Bobby Baron who was growing up in Birmingham, Michigan, I can have a picture of him and then there's me."}, {"time": 6636, "text": "And I say, oh, that's the same person."}, {"time": 6637, "text": "Well, I mean, clearly not materially speaking, not at all."}, {"time": 6640, "text": "Completely different."}, {"time": 6641, "text": "But there's a unity to whatever that pattern is by which all of that materiality has been kind of organized, you know?"}, {"time": 6648, "text": "So Polkinghorne says, I think that pattern is remembered by God and remember it's the wrong word, as though it's like derivative."}, {"time": 6657, "text": "I mean, it's known by God."}, {"time": 6659, "text": "And so God can therefore reembody me according to that pattern at a higher pitch, what we call the resurrected body."}]}]