[{"title": "Michael Mina: Rapid Testing, Viruses, and the Engineering Mindset | Lex Fridman Podcast #146", "id": "L-RuvUkcyJI", "quotes": [{"time": 444, "text": "So what terrifies me is just how easily this particular pandemic could have been so much worse."}, {"time": 449, "text": "This could have been a virus that is much worse than it is."}, {"time": 453, "text": "You know, same thing with H1N1 back in 2009."}, {"time": 457, "text": "That terrifies me."}, {"time": 458, "text": "If a virus like that was much more detrimental, you know, that would be, it could be much more devastating."}, {"time": 466, "text": "Although it's hard to say, you know, the human species were, well, I hesitate to say that we're good at responding to things because there are some aspects that were, this particular virus, SARS COVID 2 and COVID 19 has found a sweet spot where it's not quite serious enough on an individual level that humans just don't, we haven't seen much of a useful response by many humans."}, {"time": 494, "text": "A lot of people even think it's a hoax."}, {"time": 495, "text": "And so it's led us down this path of, it's not quite serious enough to get everyone to respond immediately and with the most urgency, but it's enough, it's bad enough that, you know, it's caused our economies to shut down and collapse."}, {"time": 510, "text": "And so I think I know enough about virus biology to be terrified for humans that, you know, it can, it just takes one virus, just takes the wrong one to just obliterate us or not obliterate us, but really do much more damage than we've seen."}, {"time": 525, "text": "It's fascinating to think that COVID 19 is a result of a virus evolving together with like Twitter, like figuring out how we can sneak past the defenses of the humans."}, {"time": 536, "text": "So it's not bad enough."}, {"time": 538, "text": "And then the misinformation, all that kind of stuff together is operating in such a way that the virus can spread effectively."}, {"time": 546, "text": "I wonder, I mean, obviously a virus is not intelligent, but there's a rhyme and a rhythm to the way this whole evolutionary process works and creates these fascinating things that spread throughout the entire civilization."}, {"time": 563, "text": "Absolutely, it's, yeah, I'm completely fascinated by this idea of social media in particular, how it replicates, how it grows."}, {"time": 576, "text": "You know, I've been, how it actually starts interacting with the biology of the virus, masks, who's gonna get vaccinated, politics, like these seem so external to virus biology, but it's become so intertwined."}, {"time": 592, "text": "And it's interesting."}, {"time": 595, "text": "And I actually think we could find out that the virus actually becomes, obviously not intentionally, but we could find that people choosing not to wear masks, choosing not to counter this virus in a regimented and sort of organized way, effectively gives the virus more opportunity to escape."}, {"time": 618, "text": "We can look at vaccines."}, {"time": 620, "text": "We're about to have one of the most aggressive vaccination programs the world has ever seen."}, {"time": 627, "text": "But we are unfortunately doing it right at the peak of viral transmission when millions and millions of people are still getting infected."}, {"time": 636, "text": "And when we do that, that just gives this virus so many more opportunities."}, {"time": 640, "text": "I mean, orders of magnitude more opportunity to mutate around our immune system."}, {"time": 646, "text": "Now, if we were to vaccinate everyone when there's not a lot of virus, then there's just not a lot of virus."}, {"time": 651, "text": "And so there's not going to be as many, I don't even know how many zeros are at the end of however many viral particles there are in the world right now, more than quadrillions."}, {"time": 662, "text": "And so if you assume that at any given time, somebody might have trillions of virus in them and any given individual, so then multiply trillions by millions and you get a lot of viruses out there."}, {"time": 672, "text": "And if you start applying pressure, ecological pressure, to this virus, that when it's not abundant, God, the opportunity for a virus to sneak around immunity, especially when all the vaccines are identical, essentially, it's... All it takes is one to mutate and then jumps."}, {"time": 692, "text": "Takes one."}, {"time": 693, "text": "Takes one in the whole world."}, {"time": 695, "text": "And we have to not forget that this particular virus was one."}, {"time": 699, "text": "It was one opportunity and it has spread across the globe and there's no reason that can't happen tomorrow anew."}, {"time": 709, "text": "I have a million other questions in this direction, but I'd love to talk about one of the most exciting aspects of your work, which is testing or rapid testing."}, {"time": 720, "text": "You wrote a great article in Time on November 17th."}, {"time": 724, "text": "This is like a month ago about rapid testing titled, How We Can Stop the Spread of COVID 19 by Christmas."}, {"time": 733, "text": "Let's jot down the fact that this is a month ago."}, {"time": 735, "text": "So maybe your timeline would be different, but let's say in a month."}, {"time": 739, "text": "So you've talked about this powerful idea for quite a while throughout the COVID 19 pandemic."}, {"time": 745, "text": "How do we stop the spread of COVID 19 in a month?"}, {"time": 749, "text": "Well, we use tests like these."}, {"time": 753, "text": "So the only reason the virus continues spreading is because people spread it to each other."}, {"time": 759, "text": "This isn't magic."}, {"time": 762, "text": "And so there's a few ways to stop the virus from spreading to each other."}, {"time": 767, "text": "And that is you either can vaccinate everyone and vaccinating everyone is a way to immunologically prevent the virus from growing inside of somebody and therefore spreading."}, {"time": 778, "text": "We don't know yet actually if this vaccine, if any of these vaccines are going to prevent onward transmission."}, {"time": 785, "text": "So that may or may not serve to be one opportunity."}, {"time": 790, "text": "Certainly I think it will decrease transmission."}, {"time": 792, "text": "But the other idea that we have at our disposal now, we had it in May, we had it in June, July, August, September, October, November, and now it's December."}, {"time": 802, "text": "We still have it."}, {"time": 803, "text": "We still choose not to use it in this country and in much of the world."}, {"time": 808, "text": "And that's rapid testing."}, {"time": 809, "text": "That is giving, it's empowering people to know that they are infected and giving them the opportunity to not spread it to their loved ones and their friends and neighbors and whoever else."}, {"time": 821, "text": "We could have done this."}, {"time": 823, "text": "We still can."}, {"time": 824, "text": "Today we could start."}, {"time": 826, "text": "We have millions of these tests."}, {"time": 828, "text": "These tests are simple paper strip tests."}, {"time": 831, "text": "They are, inside of this thing is just a little piece of paper."}, {"time": 838, "text": "Now I can actually open it up here."}, {"time": 841, "text": "So this, this is how we do it right here."}, {"time": 845, "text": "We have this little paper strip test."}, {"time": 848, "text": "This is enough to let you know if you're infectious."}, {"time": 851, "text": "With somewhere around the order of 99% sensitivity, 99% specificity, you can know if you have infectious virus in you."}, {"time": 860, "text": "If we can get these out to everyone's homes, build these, make 10 million, 20 million, 30 million of them a day."}, {"time": 866, "text": "You know, we make more bottles of Dasani water every day."}, {"time": 870, "text": "We can make these little paper strip tests."}, {"time": 873, "text": "And if we do that and we get these into people's homes so that they can use them twice a week, then we can know if we're infectious."}, {"time": 881, "text": "You know, is it perfect?"}, {"time": 884, "text": "But is it near perfect?"}, {"time": 886, "text": "You know, and so if we can say, hey, the transmission of this is, you know, for every hundred people that get infected right now, they go on to infect maybe 130 additional people."}, {"time": 897, "text": "And that's exponential growth."}, {"time": 899, "text": "So a hundred becomes 130."}, {"time": 901, "text": "A couple of days later that 130 becomes another 165 people have now been infected."}, {"time": 908, "text": "And you know, go over three weeks and a hundred people become 500 people infected."}, {"time": 913, "text": "Now it doesn't take much to have those hundred people not infect 130, but infect 90."}, {"time": 920, "text": "All we have to do is remove say 30, 40% of new infections from continuing their spread."}, {"time": 926, "text": "And then instead of exponential growth, you have exponential decay."}, {"time": 930, "text": "So this doesn't need to be perfect."}, {"time": 932, "text": "We don't have to go from a hundred to zero."}, {"time": 934, "text": "We just have to go and have those hundred people infect 90 and those 90 people infect, you know, 82, whatever it might be."}, {"time": 941, "text": "And you do that for a few weeks and boom, you have now gone instead of a hundred to 500, you've gone from a hundred to 20."}, {"time": 948, "text": "It's not very hard."}, {"time": 949, "text": "And so the way to do that is to let people know that they're infectious."}, {"time": 955, "text": "I mean, we're a perfect example right now."}, {"time": 958, "text": "This morning I used these tests to make sure that I wasn't infectious."}, {"time": 963, "text": "Is it perfect?"}, {"time": 964, "text": "No, but it reduced my odds 99%."}, {"time": 966, "text": "I already was at extremely low odds because I spend my life quarantining these days."}, {"time": 971, "text": "Well, the interesting thing with this test, with the testing in general, which is why I love what you've been espousing, is it's really confusing to me that this has not been taken on as it's one actual solution that was available for a long time."}, {"time": 988, "text": "There doesn't seem to have been solutions proposed at a large scale and a solution that it seems like a lot of people would be able to get behind."}, {"time": 998, "text": "There's some politicization or fear of other solutions that people have proposed, which is like lockdown."}, {"time": 1007, "text": "And there's a worry, you know, especially in the American spirit of freedom, like you can't tell me what to do."}, {"time": 1012, "text": "The thing about tests is it like empowers you with information essentially."}, {"time": 1019, "text": "So like it gives you more information about your, like your role in this pandemic, and then you can do whatever the hell you want."}, {"time": 1030, "text": "Like it's all up to your ethics and so on."}, {"time": 1033, "text": "So like, and it's obvious that with that information, people would be able to protect their loved ones and also do their sort of quote unquote duty for their country, right?"}, {"time": 1045, "text": "Is protect the rest of the country."}, {"time": 1047, "text": "I mean, it's just, it's empowerment, but you know, this is a problem."}, {"time": 1052, "text": "We have not put these into action in large part because we have a medical industry that doesn't want to see them be used."}, {"time": 1060, "text": "We have a political and a regulatory industry that doesn't want to see them be used."}, {"time": 1065, "text": "That sounds crazy."}, {"time": 1066, "text": "Why wouldn't they want them to be used?"}, {"time": 1068, "text": "We have a very paternalistic approach to everything in this country."}, {"time": 1072, "text": "You know, despite this country kind of being founded on this individualistic ideal, pull yourself up from your bootstraps, all that stuff."}, {"time": 1081, "text": "When it comes to public health, we have a bunch of ivory tower academics who want data."}, {"time": 1089, "text": "They, you know, they want to see perfection."}, {"time": 1092, "text": "And we have this issue of letting perfection get in the way of actually doing something at all, you know, doing something effective."}, {"time": 1101, "text": "And so we keep comparing these tests, for example, to the laboratory based PCR test."}, {"time": 1107, "text": "And sure, this isn't a PCR test, but this doesn't cost a hundred dollars and it doesn't take five days to get back, which means in every single scenario, this is the more effective test."}, {"time": 1118, "text": "And we have, unfortunately, a system that's not about public health."}, {"time": 1122, "text": "We have entirely eroded any ideals of public health in our country for the biomedical complex, you know, this medical industrial complex, which overrides everything."}, {"time": 1135, "text": "And that's why, you know, I'm just, can I swear on this pot?"}, {"time": 1140, "text": "I'm just so fucking pissed that these tests don't exist."}, {"time": 1146, "text": "Meanwhile, and everyone says, you know, oh, we couldn't make these, you know, that we could never do it."}, {"time": 1151, "text": "That would be such a hard, a difficult problem."}, {"time": 1154, "text": "Meanwhile, the vaccine gets, we have at the same time that we could have gotten these stupid little paper strip tests out to every household, we have developed a brand new vaccine."}, {"time": 1165, "text": "We've gone through phase one, phase two, phase three trials."}, {"time": 1167, "text": "We've scaled up its production."}, {"time": 1169, "text": "And now we have UPS and FedEx and all the logistics in the world, getting freezers out to where they need to be."}, {"time": 1175, "text": "We have this immense, we see when it comes to sort of medicine, you know, something you're injecting into somebody, then all of a sudden people say, oh, yes we can."}, {"time": 1185, "text": "But you say, oh no, that's too simple a solution, too cheap a solution."}, {"time": 1189, "text": "No way could we possibly do that."}, {"time": 1192, "text": "It's this faulty thinking in our country, which, you know, frankly is driven by big money, big, you know, the only time when we actually think that we can do something that's maybe aggressive and complicated is when there's billions and billions of billions of dollars in it, you know."}, {"time": 1208, "text": "I mean, on a difficult note, because this is part of your work from before the COVID, it does seem that I saw a statistic currently is that 40% would not be taken, of Americans would not be taking the vaccine, some number like this."}, {"time": 1221, "text": "So you also have to acknowledge that all the money that's been invested, like there doesn't appear to be a solution to deal with like the fear, distrust that people have."}, {"time": 1232, "text": "I bet, I don't know if you know this number, but for taking a strip, like a rapid test like this, I bet you people would say, like the percentage of people that wouldn't take it is in the single digits, probably."}, {"time": 1245, "text": "I completely think so."}, {"time": 1246, "text": "And you know, there's a lot of people who don't want to get a test today."}, {"time": 1250, "text": "And that's because it gets sent to a lab, it gets reported, it has all this stuff."}, {"time": 1255, "text": "And we're a country which teaches people from the time they're babies, you know, to keep their medical data close to them."}, {"time": 1264, "text": "We have HIPAA, we have all these, we have immense rules and regulations to ensure the privacy of people's medical data."}, {"time": 1271, "text": "And then a pandemic comes around and we just assume that the average person is gonna wipe all that away and say, oh no, I'm happy giving out not just my own medical data, but also to tell the authorities, everyone who I've spent my time with, so that they all get a call and are pissed at me for giving up their names."}, {"time": 1288, "text": "You know, so people aren't getting tested and they're definitely not giving up their contacts when it comes to contact tracing."}, {"time": 1294, "text": "And so for so many reasons, that approach is failing."}, {"time": 1298, "text": "Not to even mention the delays in testing and things like that."}, {"time": 1301, "text": "And so this is a whole different approach, but it's an approach that empowers people and takes the power a bit away from the people in charge."}, {"time": 1311, "text": "You know, and that's what's really grating on, I think, public health officials who say, no, we need the data."}, {"time": 1317, "text": "So they're effectively saying, if I can't have the data, I don't want the individuals, I don't want the public to have their own data either."}, {"time": 1324, "text": "Which is a terrible approach to a pandemic where we can't solve a public health crisis without actively engaging the public."}, {"time": 1333, "text": "It just doesn't work."}, {"time": 1334, "text": "And you know, and that's what we're trying to do right now, which is a terrible approach."}, {"time": 1339, "text": "So first of all, there's a, you have a really nice informative website, rapidtest.org, with information on this."}, {"time": 1344, "text": "I still can't believe this is not more popular."}, {"time": 1347, "text": "Okay, but our, one of the FAQs you have is a rapid test too expensive."}, {"time": 1355, "text": "So can cost be brought down?"}, {"time": 1358, "text": "Like I pay, I take a weekly PCR test and I think I pay 160, 170 bucks a week."}, {"time": 1366, "text": "No, I mean, it's criminal."}, {"time": 1367, "text": "Absolutely we can get costs."}, {"time": 1369, "text": "This thing right here costs less than a dollar to make."}, {"time": 1373, "text": "With everything combined, plus the swabs, you know, maybe it costs a dollar 50."}, {"time": 1378, "text": "Could be sold for, frankly, it could be sold for $3 and still make a profit if they wanna sell it for five."}, {"time": 1384, "text": "This one here, this is a slightly more complicated one, but you can see it's just got the exact same paper strip inside."}, {"time": 1393, "text": "And this is really, it doesn't look like much, but it's kind of the cream of the crop in terms of these rapid tests."}, {"time": 1399, "text": "This is the one that the US government bought and it is doing an amazing job."}, {"time": 1403, "text": "It has a 99.9% sensitivity and specificity."}, {"time": 1407, "text": "So it's really, it's really good."}, {"time": 1409, "text": "And so essentially the way it works is you just, you use a swab, you put the, once you kind of use a swab on yourself, you put the swab into these little holes here."}, {"time": 1419, "text": "You put some buffer on it and you close it and a line will show up if it's positive and a line won't show up if it's negative."}, {"time": 1425, "text": "It takes five, 10 minutes."}, {"time": 1428, "text": "This whole thing, this can be made so cheap that the US government was able to buy them, buy 150 million of them from Abbott for $5 a piece."}, {"time": 1440, "text": "So anyone who says that these are expensive, we have the proof is right here."}, {"time": 1445, "text": "This one at its, Abbott did not lose money on this deal."}, {"time": 1450, "text": "They got $750 million for selling 150 million of these at five bucks a piece."}, {"time": 1457, "text": "All of these tests can do the same."}, {"time": 1460, "text": "So anyone who says that these should be, unfortunately what's happening though is the FDA is only authorizing all of these tests as medical devices."}, {"time": 1468, "text": "So what happens when you, if I'm a medical company, if I'm a test production company and I wanna make this test and I go through and the FDA at the end of my authorization, the FDA says, okay, you now have a medical device, not a public health tool, but a medical device."}, {"time": 1487, "text": "And that affords you the ability to charge insurance companies for it."}, {"time": 1493, "text": "Why would I ever as a, you know, in our capitalistic economy and sort of infrastructure, why would I ever not sell this for $30 when insurance will pay for it or $100?"}, {"time": 1506, "text": "You know, it might only cost me 50 cents to make, but by pushing all of these tests through a medical pathway at the FDA, what extrudes out the other side is an expensive medical device that's erroneously expensive."}, {"time": 1520, "text": "It doesn't need to be inflated in cost, but the companies say, well, I'd rather make fewer of them and just sell them all for $30 a piece than make tens of millions of them, which I could do, and sell them at a dollar marginal profit."}, {"time": 1539, "text": "And so it's a problem with our whole medical industry that we see tests only as medical devices and what I would like to see is for the government in the same way that they bought 150 million of these from Abbott, they should be buying, you know, all of these tests, they should be buying 20 million a day and getting them out to people's homes."}, {"time": 1560, "text": "This virus has cost trillions of dollars to the American people."}, {"time": 1565, "text": "It's closed down restaurants and stores and obviously the main streets across America have shuttered."}, {"time": 1571, "text": "It's killing people, it's killing our economy, it's killing lifestyles and lives."}, {"time": 1577, "text": "This is an obvious solution."}, {"time": 1579, "text": "To me, this is exciting."}, {"time": 1580, "text": "This is like, this is a solution."}, {"time": 1581, "text": "I wish like in April or something like that to launch like the larger scale manufacturing deployment of tests."}, {"time": 1593, "text": "Doesn't matter what test they are."}, {"time": 1595, "text": "It's obviously the capitalist system would create cheaper and cheaper tests that would be hopefully driving down to $1."}, {"time": 1603, "text": "In America, there's, I don't know, 300 plus million people."}, {"time": 1609, "text": "So that means you wanna be testing regularly, right?"}, {"time": 1614, "text": "So how many do you think is possible to manufacture?"}, {"time": 1617, "text": "What would be the ultimate goal to manufacture per month?"}, {"time": 1620, "text": "Yep, so if we wanna slow this virus and actually stop it from transmitting, achieve what I call herd effects."}, {"time": 1627, "text": "Like vaccine herd immunity, herd effects are when you get that R value below one through preventing onward transmission."}, {"time": 1634, "text": "If we wanna do that with these tests, we need about 20 million to 40 million of them every day, which is not a lot."}, {"time": 1641, "text": "In the United States."}, {"time": 1643, "text": "So we could do it."}, {"time": 1644, "text": "There's other ways."}, {"time": 1645, "text": "You can have two people in a household swab each other, swab themselves rather, and then mix, put the swabs into the same tube and onto one test so you can pool."}, {"time": 1655, "text": "So you can get a two or three X gain in efficiency through pooling in the household."}, {"time": 1662, "text": "You could do that in schools or offices too, wherever and just use a swab."}, {"time": 1665, "text": "You have a, there's two people."}, {"time": 1667, "text": "I mean, even if it's just standing in line at a public testing site or something, you could just say, okay, these two are the last people to test or swab themselves."}, {"time": 1677, "text": "They go into one thing."}, {"time": 1678, "text": "And if it comes back positive, then you just do each person and it's rapid."}, {"time": 1682, "text": "So you can just say to the people, one of you is positive."}, {"time": 1685, "text": "Let's test you again."}, {"time": 1687, "text": "So there's ways to get the efficiency gains much better."}, {"time": 1690, "text": "But let's say, I think that the optimal number right now that matches sort of what we can produce more or less today, if we want it, is 20 million a day."}, {"time": 1699, "text": "Right now, one company that, I don't have their test here, but one company is already producing 5 million tests themselves and shipping them overseas."}, {"time": 1707, "text": "It's an American company based in California called Inova, and they are giving 5 million tests to the UK every day."}, {"time": 1716, "text": "Not to the, you know, and this is just because there's no, the federal government hasn't authorized these tests."}, {"time": 1722, "text": "So without the support of the government."}, {"time": 1724, "text": "So yeah, so essentially, if the government just puts some support behind it, then yeah, you can get 20 million, probably easy."}, {"time": 1733, "text": "Oh yeah, this, I mean, just here, I have three different companies."}, {"time": 1737, "text": "These, they all look similar."}, {"time": 1738, "text": "Well, this one's closed, but these are three different companies right here."}, {"time": 1742, "text": "This is a fourth, Abbott."}, {"time": 1744, "text": "Now, this is a fifth."}, {"time": 1745, "text": "This is a sixth."}, {"time": 1747, "text": "These two are a little bit different."}, {"time": 1748, "text": "Do you mind if in a little bit, would you take some of these or?"}, {"time": 1751, "text": "Yeah, let's do it."}, {"time": 1752, "text": "We can absolutely do them."}, {"time": 1755, "text": "So you have a lot of tests in front of you."}, {"time": 1757, "text": "Could you maybe explain some of them?"}, {"time": 1761, "text": "So there's a few different classes of tests that I just have here, and there's more tests."}, {"time": 1766, "text": "There's many more different tests out in the world too."}, {"time": 1768, "text": "These are one class of tests."}, {"time": 1771, "text": "These are rapid antigen tests that are just the most bare bones paper strip tests."}, {"time": 1776, "text": "These are, this is the type that I wanna see produced in the tens of millions every day."}, {"time": 1783, "text": "It's so simple."}, {"time": 1785, "text": "You don't even need the plastic cartridge."}, {"time": 1787, "text": "You can just make the paper strip, and you could have a little tube like this that you just dunk the paper strip into."}, {"time": 1797, "text": "You don't actually need the plastic, which I'd actually prefer, because if we start making tens of millions of these, this becomes a lot of waste."}, {"time": 1805, "text": "So I'd rather not see this kind of waste be out there."}, {"time": 1807, "text": "And there's a few companies, Quidel is making a test called the Quick View, which is just this."}, {"time": 1812, "text": "It's a, they've gotten rid of all the plastic."}, {"time": 1816, "text": "And for people who are just listening to this, we're looking at some very small tests that fit in the palm of your hand, and they're basically paper strips fit into different containers."}, {"time": 1826, "text": "And that's hence the comment about the plastic containers."}, {"time": 1829, "text": "These are just injection molded, I think."}, {"time": 1832, "text": "And they're, you know, they can build them at high numbers, but then they have to like place them in there appropriately and all this stuff."}, {"time": 1839, "text": "So it is a bottleneck, or somewhat of a bottleneck in manufacturing."}, {"time": 1844, "text": "The actual bottleneck, which the government, I think, should use the Defense Productions Act to build up, is there's a nitrocellulose membrane, a laminated membrane on this, that allows the material, the buffer with the swab mixture to flow across it."}, {"time": 1862, "text": "So the way these work, they're called lateral flow tests."}, {"time": 1865, "text": "And you take a swab, you swab the front of your nose, you dunk that swab into some buffer, and then you put a couple of drops of that buffer onto the lateral flow."}, {"time": 1877, "text": "And just like paper, if you dip a piece of paper into a cup of water, the paper will pull the water up through capillary action."}, {"time": 1885, "text": "This actually works very similarly."}, {"time": 1886, "text": "It flows through somewhat a capillary action through this nitrocellulose membrane."}, {"time": 1892, "text": "And there's little antibodies on there, these little proteins that are very specific, in this case, for antigens or proteins of the virus."}, {"time": 1899, "text": "So these are antibodies similar to the antibodies that our body makes from our immune system, but they're just printed on these lateral flow tests, and they're printed just like a little, a line."}, {"time": 1910, "text": "So then you slice these all up into individual ones."}, {"time": 1914, "text": "And if there's any virus on that buffer, as it flows across, the antibodies grab that virus, and it creates a little reaction with some colloids in here that cause it to turn dark."}, {"time": 1924, "text": "Just like a pregnancy test, one line means negative, it means a control strip worked, and two lines mean positive."}, {"time": 1933, "text": "It means, you know, if you get two lines, it just means you have virus there."}, {"time": 1937, "text": "You're very, very likely to have virus there."}, {"time": 1938, "text": "And so they're super simple."}, {"time": 1941, "text": "It is the exact same technology as pregnancy tests."}, {"time": 1943, "text": "It's the technology, this particular one from Abbott, this has been used for other infectious diseases like malaria, and actually a number of these companies have made malaria tests that do the exact same thing."}, {"time": 1957, "text": "So they just coopted the same form factor and just changed the antibodies so it picks up SARS CoV2 instead of other infections."}, {"time": 1966, "text": "Is it also, the Abbott one, is it also a strip?"}, {"time": 1968, "text": "Yep, yeah, this Abbott one here is, there's the, in this case, instead of being put in a plastic sheath, it's just put in a cardboard thing and literally glued on."}, {"time": 1976, "text": "I mean, it looks like nothing, you know, it's just, it looks like a, like, I mean, it's just the simplest thing you could imagine."}, {"time": 1984, "text": "The exterior packaging looks very Apple like, it's nice."}, {"time": 1987, "text": "It does, yeah, yeah."}, {"time": 1989, "text": "Yeah, so it's nice when it comes in a, this is how they're packaged, you know, so, and they don't have to, you know, these are coming in individual packages against, again, because they're really considered individual medical devices, but you could package them in bigger packets and stuff."}, {"time": 2007, "text": "You wanna be careful with humidity so they all have a little, one of those humidity removing things and oxygen removing things."}, {"time": 2016, "text": "So that's, this is one class, these antigen tests."}, {"time": 2019, "text": "If we could just pause for a second, if it's okay, and could you just briefly say what is an antigen test and what other tests there are out there, like categories of tests?"}, {"time": 2031, "text": "Just really quick."}, {"time": 2032, "text": "So the testing landscape is a little bit complicated, but it's, but I'll break it down."}, {"time": 2036, "text": "There's really just three major classes of tests."}, {"time": 2040, "text": "We'll start with the first two."}, {"time": 2042, "text": "The first two tests are just looking for the virus or looking for antibodies against the virus."}, {"time": 2050, "text": "So we've heard about serology tests, or maybe some people have heard about it."}, {"time": 2054, "text": "Those are a different kind of test."}, {"time": 2055, "text": "They're looking to see has somebody in the past, does somebody have an immune response against the virus, which would indicate that they were infected or exposed to it."}, {"time": 2064, "text": "So we're not talking about the antibody tests."}, {"time": 2066, "text": "I'll just leave it at that."}, {"time": 2067, "text": "Those, they actually can look very similar to this, or they can be done in a laboratory."}, {"time": 2075, "text": "Those are usually done from blood and they're looking for an immune response to the virus."}, {"time": 2081, "text": "Everything I'm talking about here is looking for the virus itself, not the immune response to the virus."}, {"time": 2086, "text": "And so there's two ways to look for the virus."}, {"time": 2089, "text": "You can either look for the genetic code of the virus, like the RNA, just like the DNA of somebody's human cells, or you can look for the proteins themselves, the antigens of the virus."}, {"time": 2099, "text": "So I like to differentiate them."}, {"time": 2102, "text": "If you were a PCR test that looks for RNA in, let's say if we made it against humans, it would be looking for the DNA inside of our cells."}, {"time": 2113, "text": "That would be actually looking for our genetic code."}, {"time": 2116, "text": "The equivalent to an antigen test is sort of a test that like actually is looking for our eyes or our nose or physical features of our body that would delineate, okay, this is Michael, for example."}, {"time": 2130, "text": "And so you're either looking for a sequence or you're looking for a structure."}, {"time": 2135, "text": "The PCR tests that a lot of people have gotten now and they're done in labs usually are looking for the sequence of the virus, which is RNA."}, {"time": 2143, "text": "This test here by a company called Detect, this is one of Jonathan Rothberg's companies."}, {"time": 2150, "text": "He's the guy who helped create modern day sequencing and all kinds of other things."}, {"time": 2156, "text": "So this Detect device, that's the name of the company, this is actually a rapid RNA detection device."}, {"time": 2161, "text": "So it's almost, it's like a PCR like test and we could even do it here."}, {"time": 2166, "text": "It's really, it's a beautiful test in my opinion, works exceedingly well."}, {"time": 2170, "text": "It's gonna be a little bit more expensive."}, {"time": 2172, "text": "So I think it could confirm, could be used as a confirmatory test for these."}, {"time": 2176, "text": "Is there a greater accuracy to it?"}, {"time": 2179, "text": "Yes, I would say that there is a greater accuracy."}, {"time": 2181, "text": "There's also a downfall though of PCR and tests that look for RNA."}, {"time": 2186, "text": "They can sometimes detect somebody who is no longer infectious."}, {"time": 2192, "text": "So you have the RNA test and then you have these antigen tests."}, {"time": 2195, "text": "The antigen tests look for structures, but they're generally only going to turn positive if people have actively replicating virus in them."}, {"time": 2203, "text": "And so what happens after an infection dissipates, you've just gone from having sort of a spike."}, {"time": 2211, "text": "So if you get infected, maybe three days later, the virus gets into exponential growth and it can replicate to trillions of viruses inside the body."}, {"time": 2220, "text": "Your immune system then kind of tackles it and beats it down to nothing."}, {"time": 2224, "text": "But what ends up in the wake of that, you just had a battle."}, {"time": 2228, "text": "You had this massive battle that just took place inside your upper respiratory tract."}, {"time": 2232, "text": "And because of that, you've had trillions and trillions of viruses go to zero, essentially."}, {"time": 2239, "text": "But the RNA is still there."}, {"time": 2241, "text": "It's just these remnants."}, {"time": 2243, "text": "In the same way that if you go to a crime scene and blood was sort of spread all over the crime scene, you're going to find a lot of DNA."}, {"time": 2250, "text": "There's tons of DNA."}, {"time": 2251, "text": "There's no people anymore, but there's a lot of DNA there."}, {"time": 2255, "text": "Same thing happens here."}, {"time": 2256, "text": "And so what's happening with PCR testing is when people go and use these exceedingly high sensitivity PCR tests, people will stay positive for weeks or months after their infection has subsided, which has caused a lot of problems, in my opinion."}, {"time": 2271, "text": "It's problems that the CDC and the FDA and doctors don't want to deal with."}, {"time": 2276, "text": "But I've tried to publish on it."}, {"time": 2278, "text": "I've tried to suggest that this is an issue, both to New York Times and others."}, {"time": 2282, "text": "And now it's unfortunately kind of taken on a life of its own of conspiracy theorists thinking that they call it a case demic."}, {"time": 2290, "text": "They say, oh, you know, PCR is detecting people who are no longer, who are false positive."}, {"time": 2296, "text": "They're not false positives."}, {"time": 2297, "text": "They're late positives, no longer transmissible."}, {"time": 2300, "text": "I think the way you, like what I saw in rapidtest.org, I really liked the distinction between diagnostic sensitivity and contagiousness sensitivity."}, {"time": 2310, "text": "That's, it's so, that website is so obvious that it's painful because it's like, yeah, that's what we should be talking about is how accurately is a test able to detect your contagiousness?"}, {"time": 2326, "text": "And you have different plots that show that actually there's, you know, that antigen tests, the tests we're looking at today, like rapid tests, are actually really good at detecting contagiousness."}, {"time": 2339, "text": "It all mixes back with this whole idea that, of the medical industrial complex."}, {"time": 2344, "text": "You know, in this country, and in most countries, we have almost entirely defunded and devalued public health, period."}, {"time": 2353, "text": "You know, we just have."}, {"time": 2355, "text": "And what that means is that we don't even, we don't have a language for it."}, {"time": 2362, "text": "We don't have a lexicon for it."}, {"time": 2363, "text": "We don't have a regulatory landscape for it."}, {"time": 2365, "text": "And so the only window we have to look at a test today is as a medical diagnostic test."}, {"time": 2372, "text": "And that becomes very problematic when we're trying to tackle a public health threat and a public health emergency."}, {"time": 2382, "text": "By definition, this is a public health emergency that we're in."}, {"time": 2385, "text": "And yet we keep evaluating tests as though the diagnostic benchmark is the gold standard."}, {"time": 2392, "text": "Where if I'm a physician, I am a physician, so I'll put on that physician hat for a moment."}, {"time": 2399, "text": "And if I have a patient who comes to me and wants to know if their symptoms are a result of them having COVID, then I want every shred of evidence that I can get to see, does this person currently or did they recently have this infection inside of them?"}, {"time": 2417, "text": "And so in that sense, the PCR test is the perfect test."}, {"time": 2421, "text": "It's really sensitive."}, {"time": 2422, "text": "It will find the RNA if it's there at all so that I could say, you know, yeah, you have a low amount of RNA left."}, {"time": 2428, "text": "You might've been, you said your symptoms started two weeks ago."}, {"time": 2432, "text": "You probably were infectious two weeks ago and you have lingering symptoms from it."}, {"time": 2438, "text": "But that's a medical diagnosis."}, {"time": 2441, "text": "It's kind of like a detective recreating a crime scene."}, {"time": 2444, "text": "They wanna go back there and recreate the pieces so that they can assign blame or whatever it might be."}, {"time": 2452, "text": "But that's not public health."}, {"time": 2453, "text": "In public health, we need to only look forward."}, {"time": 2456, "text": "We don't wanna go back and say, well, was this person, are there symptoms because they had an infection two weeks ago?"}, {"time": 2461, "text": "In public health, we just wanna stop the virus from spreading to the next person."}, {"time": 2466, "text": "And so that's where we don't care if somebody was infected two weeks ago."}, {"time": 2471, "text": "We only care about finding the people who are infectious today."}, {"time": 2475, "text": "And unfortunately, our regulatory landscape fails to apply that knowledge to evaluate these tests as public health tools."}, {"time": 2486, "text": "They're only evaluating the tests as medical tools."}, {"time": 2489, "text": "And therefore, we get all kinds of complaints that say this test, which detects 99 plus, 99.8% of current infectious people, by the FDA's rubric, they'll say, no, no, it's only 50% sensitive."}, {"time": 2508, "text": "And that's because when you go out into the world and you just compare this against PCR positivity, most people who are PCR positive in the world right now at any given time are post infectious."}, {"time": 2520, "text": "They're no longer infectious because you might only be infectious for five days, but then you'll remain PCR positive for three or four or five weeks."}, {"time": 2529, "text": "And so when you go and just evaluate these tests and you say, okay, this person's PCR positive, does the rapid antigen test detect that?"}, {"time": 2537, "text": "More often than not, it's no."}, {"time": 2539, "text": "But that's because those people don't need isolation."}, {"time": 2543, "text": "They're post infectious."}, {"time": 2544, "text": "And it's become much more of a problem than I think even the FDA themself is recognizing because they are unwilling at this point to look at this as a public health problem requiring public health tools."}, {"time": 2558, "text": "We'll definitely talk about this a little bit more because the concern I have is that a bigger pandemic comes along."}, {"time": 2565, "text": "What are the lessons we draw from this and how we move forward?"}, {"time": 2568, "text": "Let's talk about that in a bit."}, {"time": 2570, "text": "But sort of, can we discuss further the lay of the land here of the different tests before us?"}, {"time": 2577, "text": "So I talked about PCR tests and those are done in the lab or they're done essentially with a rapid test like this, the detect, and we can even try this in a moment."}, {"time": 2587, "text": "It goes into a little heater."}, {"time": 2589, "text": "So you might have one of these in a household or one of these in a nursing home or something like that or in an airport."}, {"time": 2596, "text": "Or you could have one that has 100 different outlets."}, {"time": 2599, "text": "This is just to heat the tube up."}, {"time": 2601, "text": "These are the rapid tests."}, {"time": 2602, "text": "They're super simple, no frills."}, {"time": 2605, "text": "You just swab your nose and you put the swab into a buffer and you put the buffer on the test."}, {"time": 2612, "text": "So we can use these right now if you want."}, {"time": 2614, "text": "We can try it out."}, {"time": 2615, "text": "And all the tests we're talking about, they're usually swabbing the nose."}, {"time": 2619, "text": "Like that's the... That's still the main, yeah."}, {"time": 2623, "text": "There are some saliva tests coming about and these can all work potentially with saliva."}, {"time": 2628, "text": "They just have to be recalibrated."}, {"time": 2630, "text": "But these swabs are really not bad."}, {"time": 2632, "text": "This isn't the deep swab that goes like way back into your nose or anything."}, {"time": 2638, "text": "This is just a swab that you do yourself like right in the front of your nose."}, {"time": 2643, "text": "So if you wanna do it."}, {"time": 2644, "text": "Yeah, do you mind if I?"}, {"time": 2646, "text": "Yeah, why don't we start with this one?"}, {"time": 2648, "text": "Because this is Abbott's Buy Next Now test and it's really, it's pretty simple."}, {"time": 2652, "text": "This is the swab from the Abbott test."}, {"time": 2656, "text": "That's the swab from the Abbott test."}, {"time": 2658, "text": "So what I'm gonna do to start is I'm going to take this buffer here, which is, this is just the buffer that goes onto this test."}, {"time": 2667, "text": "So this is a brand new one."}, {"time": 2668, "text": "I just opened this test out."}, {"time": 2672, "text": "I'm gonna just take six drops of this buffer and put it right onto this test here."}, {"time": 2680, "text": "Two, three, four, five, six."}, {"time": 2684, "text": "And now you're gonna take that swab, open it up."}, {"time": 2688, "text": "Yep, and now just wipe it around inside the, into the front of your nose."}, {"time": 2692, "text": "Do a few circles on each nostril."}, {"time": 2698, "text": "That looks good."}, {"time": 2703, "text": "This always makes me wanna sneeze."}, {"time": 2707, "text": "Okay, now I'm gonna have you do it yourself."}, {"time": 2711, "text": "I'm getting emotional."}, {"time": 2713, "text": "Hold it parallel to the test."}, {"time": 2714, "text": "So put the test down on the table."}, {"time": 2716, "text": "Yep, and then go into that bottom hole."}, {"time": 2719, "text": "Yep, and push forward so that you can start to see it in the other hole."}, {"time": 2723, "text": "Now turn, if it's, once it hits up against the top, just turn it three times."}, {"time": 2728, "text": "One, two, three, and sort of, yep."}, {"time": 2730, "text": "And now you just close, so pull off that adhesive sticker there."}, {"time": 2737, "text": "And now you just close the whole thing."}, {"time": 2744, "text": "Now what we will see is we will see a line form."}, {"time": 2749, "text": "What's happening now is the buffer that you put in there is now moving up onto the paper strip test, and it has the material from the swab in there."}, {"time": 2762, "text": "And so what we'll see is a line will form, and that's gonna be the control line."}, {"time": 2768, "text": "And then we'll also see the, ideally we'll see no line for the actual line."}, {"time": 2774, "text": "We'll see no line for the actual test line."}, {"time": 2777, "text": "And that's because you should be negative."}, {"time": 2780, "text": "So one line will be positive and two lines will be negative."}, {"time": 2784, "text": "That's very cool."}, {"time": 2785, "text": "There's this purple thing creeping up onto the control line."}, {"time": 2792, "text": "That's what you wanna be seeing."}, {"time": 2795, "text": "So you want to see that, so right now you essentially want to see that that blue line turns pink or purply color."}, {"time": 2805, "text": "There's a blue line that's already there printed."}, {"time": 2809, "text": "It should turn sort of a purple pink color."}, {"time": 2812, "text": "And ideally there will be no additional line for the sample."}, {"time": 2820, "text": "And if there is, that's the 99 point whatever percent accuracy on, that means I have, I'm contagious."}, {"time": 2829, "text": "That would mean that you're likely contagious or you likely have infectious virus in you."}, {"time": 2834, "text": "What we can do, because one of the things that my plan calls for is because sometimes these tests can get false positive results, it's rare."}, {"time": 2844, "text": "Maybe 1% or in the case of this Binex now, this Abbott test 0.1%."}, {"time": 2850, "text": "So one in a thousand, one in 500, something like that can be falsely positive."}, {"time": 2854, "text": "What I recommend is that when somebody is positive on one of these, you turn around and you immediately test on a different test."}, {"time": 2862, "text": "You could either do it on the same, but for good measure, you want to use a separate test that is somewhat orthogonal, meaning that it shouldn't turn falsely positive for the same reason."}, {"time": 2876, "text": "This particular test here, this detect test because it is looking for the RNA and not the antigen, this is an amazingly accurate test and it's sort of a perfect gold standard or confirmatory test for any of these antigen tests."}, {"time": 2892, "text": "So one of the recommendations that I've had, especially if people start using antigen tests before you get onto a plane or as what I call entrance screening, if somebody is positive, you don't immediately tell them, you're positive, go isolate for 10 days."}, {"time": 2908, "text": "You tell them, let's confirm on one of these, on a detect test."}, {"time": 2913, "text": "That is because it's completely orthogonal, it's looking for the RNA instead of the antigen."}, {"time": 2920, "text": "There's no reason, no biological reason that both of these should be falsely positive."}, {"time": 2927, "text": "So if one's falsely positive and the other one is negative, especially because this one's more sensitive, then I would trust this as a confirmatory test."}, {"time": 2936, "text": "If this one's negative, then the antigen test would be considered falsely positive."}, {"time": 2942, "text": "It does look like there's only a single line, so this is very exciting news."}, {"time": 2945, "text": "That's right, yep."}, {"time": 2946, "text": "It says wait 15 minutes to see both lines, but in general, if somebody's really gonna be positive, that line starts showing up within a minute or two."}, {"time": 2957, "text": "So you wanna keep the whole, we'll keep watching it for the whole 15 minutes as it's sitting there, but I would say you're knowing that you've had PCR tests recently and all that."}, {"time": 2966, "text": "The odds are pretty good."}, {"time": 2967, "text": "The odds are very good."}, {"time": 2968, "text": "The packaging, very iPhone like."}, {"time": 2970, "text": "I'm digging the sexy packaging."}, {"time": 2973, "text": "I'm a sucker for good packaging, okay."}, {"time": 2976, "text": "So then there's this test here, which is, this is another, it's funny."}, {"time": 2981, "text": "Let me open this up and show you."}, {"time": 2982, "text": "This is a really nice test."}, {"time": 2984, "text": "It's another antigen test."}, {"time": 2985, "text": "Works the exact same way as this, essentially, but what you can see is it's got lights in it and a power button and stuff."}, {"time": 2992, "text": "This is called an allume test, which is fine, and it's a really nice test, to be honest, but it has to pair with an iPhone."}, {"time": 3004, "text": "And so it's good as a, I think that this is gonna become, there's a lot of use for this from a medical perspective, where you want good reporting."}, {"time": 3013, "text": "This can, because it pairs with an iPhone, it can immediately send the report to a department of health, whereas these paper strip tests, they're just paper."}, {"time": 3023, "text": "They don't report anything unless you wanna report it."}, {"time": 3026, "text": "Okay, so I'm gonna just pick it apart."}, {"time": 3028, "text": "And so you can see is there's fluorescent readers and little lasers and LEDs and stuff in there."}, {"time": 3034, "text": "You can actually see the lights going off."}, {"time": 3037, "text": "And there's a paper strip test right inside there, but you can see that there's a whole circuit board and all this stuff, right?"}, {"time": 3044, "text": "And so this is the kind of thing that the FDA is looking for, for home use and things like that, because it's kind of foolproof."}, {"time": 3056, "text": "You can't go wrong with it."}, {"time": 3058, "text": "It pairs with an iPhone, so you need Bluetooth."}, {"time": 3060, "text": "So it's gonna be more limited."}, {"time": 3061, "text": "It's a great test, don't get me wrong."}, {"time": 3063, "text": "It's as good as any of these."}, {"time": 3065, "text": "But when you compare this thing with a battery and a circuit board and all this stuff, it's got its purpose, but it's not a public health tool."}, {"time": 3074, "text": "I don't wanna see this made in the tens of millions a day and thrown away."}, {"time": 3078, "text": "This is just."}, {"time": 3079, "text": "But FDA likes that kind of stuff."}, {"time": 3080, "text": "FDA loves this stuff, because they can't get it out of their mind that this is a public health crisis."}, {"time": 3086, "text": "We need, I mean, just look at the difference here."}, {"time": 3089, "text": "Something with flashing lights is essential."}, {"time": 3092, "text": "It's got batteries, it's got a Bluetooth thing."}, {"time": 3094, "text": "It's a great test, but to be honest, it's not any better than this one."}, {"time": 3099, "text": "And so I want this one."}, {"time": 3103, "text": "It's nice and all."}, {"time": 3104, "text": "The form factor is nice, and it's really nice that it goes to Bluetooth."}, {"time": 3109, "text": "But it goes against the principle of just 20 million a day."}, {"time": 3112, "text": "The easy solution, everybody has it."}, {"time": 3114, "text": "You can manufacture and probably, you could've probably scaled this up in a couple of weeks."}, {"time": 3120, "text": "These companies, I mean, the rest of the world has these."}, {"time": 3124, "text": "They can be scaled up."}, {"time": 3125, "text": "They already exist."}, {"time": 3126, "text": "You know, SD biosensors, one company's making tens of millions a day, not coming to the United States, but going all over Europe, going all over Southeast Asia and East Asia."}, {"time": 3136, "text": "So they exist."}, {"time": 3137, "text": "The US is just, you know, we can't get out of our own way."}, {"time": 3141, "text": "I wonder why somebody, I don't know if you were paying attention, but somebody like an Elon Musk type character."}, {"time": 3146, "text": "So he was really into doing some like obvious engineering solution, like this at home rapid test seems like a very Elon Musk thing to do."}, {"time": 3157, "text": "I don't know if you saw, but I had a little Twitter conversation with Elon Musk."}, {"time": 3161, "text": "Does he not like, what is he, do you know what his thoughts are on rapid testing?"}, {"time": 3165, "text": "Well, he was using a slightly different one, one of these, but that requires an instrument called the BD Veritor."}, {"time": 3170, "text": "And he got a false positive, or no, I shouldn't say, he didn't necessarily get a false positive."}, {"time": 3174, "text": "He got discrepant results."}, {"time": 3175, "text": "He did this test four times."}, {"time": 3177, "text": "He got two positives, two negatives, but then he got a PCR test and it was a very low positive result."}, {"time": 3185, "text": "So I think what happened is he just tested himself at the tail end of an, this was actually right before he was about to send those."}, {"time": 3191, "text": "It was the day of essentially that he was sending the astronauts up to the space station the other day."}, {"time": 3195, "text": "So he was using these rapid tests cause he wanted to make sure that he was good to go in and he got discrepant results."}, {"time": 3203, "text": "Ultimately they were correct, but two were negative, two were positive."}, {"time": 3206, "text": "But what really happened once he shared his PCR results and they were very low positive."}, {"time": 3212, "text": "So really what was happening is, my guess is he found himself right at the edge of his positivity, of his infectiousness."}, {"time": 3219, "text": "And so the test worked how it was supposed to work."}, {"time": 3222, "text": "It probably had he used it two days earlier, it would have been screaming positive."}, {"time": 3227, "text": "He wouldn't have gotten discrepant results, but he found himself right at the edge by the time he used the test."}, {"time": 3232, "text": "So the PCR would always pick it up cause it's still, cause that will still stay positive then for weeks potentially."}, {"time": 3239, "text": "But the rapid antigen test was starting to falter, not in a bad way, but just he probably was really no longer particularly infectious."}, {"time": 3247, "text": "And so it was kind of when it gets to be a very low viral load, it becomes stochastic."}, {"time": 3252, "text": "It's fascinating this duality."}, {"time": 3254, "text": "So one you can think from an individual perspective, it's unclear when you take four and half are positive, half are negative, like what are you supposed to do?"}, {"time": 3265, "text": "But from a societal perspective, it seems like if just one of them is positive, just stay home for a couple of days, for a while."}, {"time": 3274, "text": "So when you're a CEO of a company, you're launching astronauts to space, you may not want to rely absolutely on the antigen test as a thing by which you steer your decisions of like 10,000 plus people companies."}, {"time": 3290, "text": "But us individuals just living in the world, if you can, if it comes up positive, then you make decisions based on that."}, {"time": 3299, "text": "And then that scales really nicely to an entire society of hundreds of millions of people."}, {"time": 3303, "text": "And that's how you get that virus to stop spreading."}, {"time": 3308, "text": "You don't have to catch every single one."}, {"time": 3310, "text": "And the nice thing is that these will, these will catch the people who are most infectious."}, {"time": 3315, "text": "So with Elon Musk, it generally that test, we don't have the counterfactual."}, {"time": 3320, "text": "We don't have his results from three days earlier when he was probably most infectious."}, {"time": 3326, "text": "But my guess is the fact that it was catching two out of the four, even when he was down at a CT value of really, really very, very low viral load on the PCR test suggests that it was doing its job."}, {"time": 3339, "text": "And you just wanna, and the nice thing is because these can be produced at such scale, getting one positive doesn't immediately have to mean 10 days of isolation."}, {"time": 3351, "text": "That's the CDC is more conservative stance to say, if you're positive on any tests, stay home for 10 days and isolate."}, {"time": 3359, "text": "But here, people would just have more tests."}, {"time": 3361, "text": "So the recommendation should be test daily."}, {"time": 3364, "text": "If you turn positive, test daily until you've been negative for 24, 48 hours and then go back to work."}, {"time": 3370, "text": "And the nice thing there is right now, people just aren't testing because they don't wanna take 10 days off."}, {"time": 3375, "text": "They're not getting paid for it."}, {"time": 3376, "text": "So they can't take 10 days off."}, {"time": 3378, "text": "Do you know what Elon thinks about this idea of rapid testing for everybody?"}, {"time": 3383, "text": "So I understood I need to look at that whole Twitter thread."}, {"time": 3386, "text": "So I understand his perhaps criticism of, he had like a conspiratorial tone from my vague look at it of like, what's going on here with these tests?"}, {"time": 3397, "text": "But what does he actually think about this very practical to me engineering solution of just deploying rapid tests to everybody?"}, {"time": 3405, "text": "It seems like that's a way to open up the economy in April."}, {"time": 3408, "text": "Well, to be honest, I've been trying to get in touch with him again."}, {"time": 3411, "text": "I think, take somebody like Elon Musk with the engineering prowess within his ranks, to easily, easily build these at the tens of millions a day."}, {"time": 3424, "text": "He could build the machines from scratch."}, {"time": 3427, "text": "A lot of the companies, they buy the machines from South Korea or Taiwan, I believe."}, {"time": 3432, "text": "We don't have to, we can build these machines."}, {"time": 3435, "text": "They're simple to build."}, {"time": 3436, "text": "Put somebody like Elon Musk on it, take some of his best engineers and say, look, the US needs a solution in two weeks."}, {"time": 3446, "text": "Build these machines, figure it out."}, {"time": 3449, "text": "He'll do it, he could do it."}, {"time": 3450, "text": "This is a guy who is literally, he has started multiple entirely new industries."}, {"time": 3457, "text": "He has the capital to do it without the US government if he wanted to."}, {"time": 3461, "text": "And you know what, it would, the return on investment for him would be huge."}, {"time": 3467, "text": "But frankly, the return on investment in the country would be hundreds of billions of dollars, because it means we could get society open."}, {"time": 3475, "text": "So I know that his first experience with these rapid tests was confusing, which is how I ended up having this Twitter kind of conversation with him very briefly."}, {"time": 3486, "text": "But I think that if he understood sort of a little bit more, and I think he does, I really love to talk to him about it, because I think he could totally change the course of this pandemic in the United States, single handedly."}, {"time": 3498, "text": "He loves grand things."}, {"time": 3499, "text": "Yeah, I think out of all the solutions I've seen, this is the obvious engineering solution to at least a pandemic of this scale."}, {"time": 3512, "text": "I love that you say the engineering solution."}, {"time": 3515, "text": "So this is something I've been really trying to, I'm an engineer, my previous history was all engineering, and that's really how I think."}, {"time": 3524, "text": "I then went into medicine and PhD world, but I think that the world, like one of the major catastrophes, or one of the major problems, is that we have physicians making the decisions about public health and a pandemic, when really we need engineers."}, {"time": 3543, "text": "This is an engineering problem."}, {"time": 3545, "text": "And so what I've been trying to do, I actually really want to start a whole new field called public health engineering."}, {"time": 3552, "text": "And so I've been, eventually I want to try to bring it to MIT and get MIT to want to start a new department or something."}, {"time": 3559, "text": "That's a doubly awesome idea."}, {"time": 3562, "text": "That, this is really, okay."}, {"time": 3564, "text": "I love this, I love every aspect."}, {"time": 3566, "text": "I love everything you're talking about."}, {"time": 3569, "text": "A lot of people believe, because vaccines started being deployed currently, that we are no longer in need of a solution."}, {"time": 3579, "text": "We're no longer in need of slowing the spread of the virus."}, {"time": 3585, "text": "To me, as I understand, it seems like this is the most important time to have something like a rapid testing solution."}, {"time": 3592, "text": "Can you kind of break that apart?"}, {"time": 3594, "text": "What's the role of rapid testing currently in the next, what is it, three, four months maybe?"}, {"time": 3602, "text": "The vaccine rollout isn't gonna be as peachy as everyone is hoping."}, {"time": 3607, "text": "And I hate to be the Debbie Downer here, but there's a lot of unknowns with this vaccine."}, {"time": 3613, "text": "You've already mentioned one, which is there's a lot of people who just don't want to get the vaccine."}, {"time": 3619, "text": "I hope that that might change as things move forward and people see their neighbors getting it and their family getting it and it's safe and all."}, {"time": 3625, "text": "We don't know how effective the vaccine is gonna be after two or three months."}, {"time": 3628, "text": "We've only measured it in the first two or three months, which is a massive problem, which we can go into biologically, because there's very good reasons to believe that the efficacy could fall way down after two or three months."}, {"time": 3642, "text": "We don't know if it's gonna stop transmission."}, {"time": 3644, "text": "And if it doesn't stop transmission, then there's, you know, herd immunity is much, much more difficult to get because that's all based on transmission blockade."}, {"time": 3654, "text": "And frankly, we don't know how easily we're going to be able to roll it out."}, {"time": 3658, "text": "Some of the vaccines need really significant cold chains, have very short half lives outside of that cold chain."}, {"time": 3665, "text": "We need to organize massive numbers of people to be able to distribute these."}, {"time": 3671, "text": "Most hospitals today are saying that they're not equipped to hire the right people to be even administering enough of these vaccines."}, {"time": 3679, "text": "And then a lot of the hospitals are frustrated because they're getting much lower, smaller allocations than they were expecting."}, {"time": 3684, "text": "So I think right now, like you say, right now is the best time, you know, besides three or four or five or six months ago, right now is the best time to get these rapid tests out."}, {"time": 3698, "text": "And we need to, I mean, the country has the capacity to build them."}, {"time": 3702, "text": "We have, we're shipping them overseas right now."}, {"time": 3705, "text": "We just need to flip a switch, get the FDA to recognize that there's more important things than diagnostic medicine, which is the effectiveness of the public health program when we're dealing with a pandemic."}, {"time": 3717, "text": "They need to authorize these as public health tools, or, you know, frankly, the president could, you know, there's a lot of other ways to get these tests to not have to go through the normal FDA authorization program, but maybe have the NIH and the CDC give a stamp of approval."}, {"time": 3735, "text": "And if we could, we could get these out tomorrow."}, {"time": 3739, "text": "And that's where that article came from, you know, how we can stop the spread of this virus by Christmas, we could, you know, now it's getting late."}, {"time": 3746, "text": "And so we have to keep updating that timeframe, maybe putting Christmas in the title wasn't, I should have said how we can stop the spread of this virus in a month."}, {"time": 3755, "text": "It would be a little bit more timeless, but we could do it, you know, we really could do it."}, {"time": 3760, "text": "And that's the most frustrating part here is that we're just choosing not to as a country."}, {"time": 3766, "text": "We're choosing to bankrupt our society because some people at the FDA and other places just can't seem to get their head around the fact that this is a public health problem, not a bunch of medical problems."}, {"time": 3778, "text": "Is there a way to change that policy wise?"}, {"time": 3780, "text": "So this is a much bigger thing that you're speaking to, which I love in terms of the MIT engineering approach to public health."}, {"time": 3791, "text": "Is there a way to push this?"}, {"time": 3793, "text": "Is this a political thing?"}, {"time": 3794, "text": "Like where some Andrew Yang type characters need to like start screaming about it?"}, {"time": 3800, "text": "Is it more of an Elon Musk thing where people just need to build it and then on Twitter start talking crap to politicians for not doing it?"}, {"time": 3811, "text": "What are the ideas here?"}, {"time": 3814, "text": "I think it's a little of both."}, {"time": 3817, "text": "I think it's political on the one hand, and I've certainly been talking to Congress a lot, talking to senators."}, {"time": 3822, "text": "Are they receptive?"}, {"time": 3824, "text": "I mean, that's the crazy thing."}, {"time": 3825, "text": "Everyone but the FDA is receptive."}, {"time": 3827, "text": "I mean, it's astounding."}, {"time": 3829, "text": "I mean, I advise, informally I advise the president and the president elects teams."}, {"time": 3835, "text": "I talk to Congress, I talk to senators, governors, and then all the way down to mayors of towns and things."}, {"time": 3845, "text": "And I mean, months ago I held a round table discussion with Mayor Garcetti, who's the mayor of LA, and I brought all the companies who make these things."}, {"time": 3855, "text": "This was in like July or August or something."}, {"time": 3857, "text": "I brought all the companies to the table and said, okay, how can we get these out?"}, {"time": 3861, "text": "And unfortunately, it went nowhere because the FDA won't authorize them as public health tools."}, {"time": 3868, "text": "The nice thing is that this is one of the nice and frustrating things."}, {"time": 3872, "text": "This is one of the few bipartisan things that I know of."}, {"time": 3875, "text": "And like you said, it's a real solution."}, {"time": 3878, "text": "Lockdowns aren't a solution."}, {"time": 3880, "text": "They're an emergency bandaid to a catastrophe that's currently happening."}, {"time": 3886, "text": "They're not a solution."}, {"time": 3888, "text": "And they're definitely not a public health solution if we're taking a more holistic view of public health, which includes people's wellbeing, includes their psychological wellbeing, their financial wellbeing."}, {"time": 3899, "text": "Just stopping a virus if it means that all those other things get thrown under the bus is not a public health solution."}, {"time": 3905, "text": "It's a myopic or very tunnel visioned approach to a virus that's spreading."}, {"time": 3914, "text": "This is a simple solution with essentially no downfall."}, {"time": 3920, "text": "There is nothing bad about this."}, {"time": 3922, "text": "It's just giving people a result."}, {"time": 3925, "text": "And it's bipartisan."}, {"time": 3927, "text": "The most conservative and the most liberal people, everyone just wants to know their status."}, {"time": 3932, "text": "Nobody wants to have to wait in line for four hours to find out their status on Monday, a week later, on Saturday."}, {"time": 3940, "text": "It just doesn't make any sense."}, {"time": 3941, "text": "It's a useless test at that point."}, {"time": 3943, "text": "And everyone recognizes that."}, {"time": 3945, "text": "So why do you think, like the mayor of LA, why do you think politicians are going for these, from my perspective, like kind of half ass lockdowns, which is not, so I have seen good evidence that like a complete lockdown can work, but that's in theory, it's just like communism in theory can work."}, {"time": 3969, "text": "Like theoretically speaking, but it just doesn't, at least in this country, we don't, I think it's just impossible to have complete lockdown."}, {"time": 3977, "text": "And still politicians are going for these kind of lockdowns that everybody hates, that's really hurting small businesses."}, {"time": 3988, "text": "Like why are they going for that?"}, {"time": 3989, "text": "And big businesses, and yeah, all businesses, but like basically not just hurting, they're destroying small businesses, right?"}, {"time": 3998, "text": "Which is going to have potentially, I mean, yeah, I've been reading as I don't shut up about the rise and fall of the Third Reich, and there's economic effects that take a decade to, there's going to be long lasting effects that may be destructive to the very fabric of this nation."}, {"time": 4022, "text": "So why are they doing it, and why are they not using the solution?"}, {"time": 4026, "text": "Is there any intuition?"}, {"time": 4027, "text": "I mean, you've said that FDA has a stranglehold, I guess, on this whole public health problem."}, {"time": 4034, "text": "Is that all it is?"}, {"time": 4036, "text": "That's honestly, it's pretty much all it is."}, {"time": 4040, "text": "The companies, so somebody like Mayor Garcetti or Governor Baker, Cuomo, Newsom, any of these, DeWine, I've talked to a lot of governors in this country at this point, and of course the federal government, including the president's own teams, and the heads of the NIH, the heads of the CDC about this."}, {"time": 4065, "text": "The problem is the tests don't exist in this country at the level that we need them to right now to make that kind of policy, to make that kind of program."}, {"time": 4077, "text": "They could, but they don't."}, {"time": 4079, "text": "And so what that means is that when Mayor Garcetti says, okay, what are my actual options today, despite these sounding like a great idea, he looks around and he says, well, they're not authorized."}, {"time": 4091, "text": "They don't exist right now for at home use."}, {"time": 4095, "text": "And from his perspective, he's not about to pick that fight with the FDA, and it turns out nobody is."}, {"time": 4100, "text": "Why are people afraid of, it seems like an easy struggle to fight."}, {"time": 4105, "text": "It's like a..."}, {"time": 4105, "text": "So they don't see it as a fight."}, {"time": 4108, "text": "They think that the FDA is the end all be all."}, {"time": 4111, "text": "Everyone thinks the FDA is the end all be all."}, {"time": 4114, "text": "And so they just defer, everyone is deferential, including the heads of all the other government agencies because that is their role."}, {"time": 4122, "text": "But what everyone is failing to see is that the FDA doesn't even have a mandate or a remit to evaluate these tests as public health tools."}, {"time": 4130, "text": "So they're just falling in this weird gray zone where the FDA is saying, look, we evaluate medical products."}, {"time": 4137, "text": "That's the only thing that I meant, like Tim Stenzel, head of in vitro diagnostics at the FDA, he's doing what his job is, which is to evaluate medical tools."}, {"time": 4149, "text": "Unfortunately, this is where I think the CDC has really blundered."}, {"time": 4153, "text": "They haven't made the right distinction to say, look, okay, the FDA is evaluating these for doctors to use and all that, but we're the CDC and we're the public health agency of this country and we recognize that these tools require a different authorization pathway and a different use, not prescription."}, {"time": 4170, "text": "There's a difference between medical devices and public health."}, {"time": 4175, "text": "And I guess FDA is not designed for this public health, especially in emergency situations."}, {"time": 4180, "text": "And they actually explicitly say that."}, {"time": 4183, "text": "I mean, when I go and talk to Tim, and he's a very reasonable guy, but when I talk to him, he says, look, we don't, we just do not evaluate a public health tool."}, {"time": 4196, "text": "If you're telling me this is a public health tool, great, go and use it."}, {"time": 4199, "text": "And so I say, okay, great, we'll go and use it."}, {"time": 4203, "text": "And then the comment is, but does it give a result back to somebody?"}, {"time": 4208, "text": "I say, well, yes, of course it gives a result back to somebody, it's being done in their home."}, {"time": 4213, "text": "So then it's defined as a medical tool, can't use it."}, {"time": 4216, "text": "So it's stuck in this gray zone where unfortunately, there's this weird definition that any tool, any test that gives a result back to an individual is defined by CMS, Centers for Medicaid Services, as a medical device requiring medical authorization."}, {"time": 4234, "text": "But then you go and ask, it gets crazier, because then you go and ask Seema Verma, the head of CMS, you know, okay, can these be authorized as public health tools and not fall under your definition of a medical device?"}, {"time": 4250, "text": "So then the FDA doesn't have to be the ones authorizing it as a public health tool."}, {"time": 4254, "text": "And Seema Verma says, oh, we don't have any jurisdiction over point of care and sort of rapid devices like this."}, {"time": 4264, "text": "We only have jurisdiction over lab devices."}, {"time": 4267, "text": "So it's like nobody has ownership over it, which means that they just keep, they stay in this purgatory of not being approved."}, {"time": 4275, "text": "And so this is where I think, frankly, it needs a president."}, {"time": 4278, "text": "It needs a presidential order to just unlock them, to say this is more important than having a prescription."}, {"time": 4285, "text": "And in fact, I mean, really what's happening now, because there is this sense that tests are public health tools, even if they're not being defined as such, the FDA now is pretty much, not only are they not authorizing these as public health tools, what they're doing by authorizing what are effectively public health tools as medical devices, they're just diluting down the practice of medicine."}, {"time": 4310, "text": "I mean, his answer right now, unfortunately is, well, I don't know why you want these to be sort of available to everyone without a prescription."}, {"time": 4318, "text": "We've already said that a doctor can write a whole prescription for a whole college campus."}, {"time": 4324, "text": "It's like, well, if you're going in that direction then, and that's no longer medicine, having a doctor write a prescription for a college campus, for everyone on the campus to have repeat testing, now we're just in the territory of eroding medicine and eroding all of the legal rules and reasons that we have prescriptions in the first place."}, {"time": 4343, "text": "So it's just everything about it is just destructive instead of just making a simple solution, which is these are okay as public health tools as long as they meet X and Y metrics, go and CDC can put their stamp of approval on them."}, {"time": 4358, "text": "What do you think, sorry if I'm stuck on this, your mention of MIT and public health engineering, right?"}, {"time": 4367, "text": "I mean, it has a sense of, I talked to computational biology folks."}, {"time": 4371, "text": "It's always exciting to see computer scientists start entering the space of biology."}, {"time": 4376, "text": "And there's actually a lot of exciting things that happen because of that, trying to understand the fundamentals of biology."}, {"time": 4383, "text": "So from the engineering approach to public health, what kind of problems do you think can be tackled?"}, {"time": 4389, "text": "What kind of disciplines are involved?"}, {"time": 4391, "text": "Like, do you have ideas in this space?"}, {"time": 4395, "text": "I mean, I can speak to one of the major activities that I wanna do."}, {"time": 4400, "text": "So what I normally do in my research lab is develop technologies that can take a drop of somebody's blood or some saliva and profile for hundreds of thousands of different antibodies against every single pathogen that somebody could be possibly exposed to."}, {"time": 4416, "text": "So this is all new technology that we've been developing more from a bioengineering perspective."}, {"time": 4423, "text": "But then I use a lot of the mathematics tools to A, interpret that."}, {"time": 4429, "text": "But what I really wanna do, for example, to kind of kick off this new field of what I consider public health engineering is to create, maybe it's a little ambitious, but create a weather system for viruses."}, {"time": 4442, "text": "I want us to be able to open up our iPhones, plug in our zip code and get a better sense, get a probability of why my kid has a runny nose today."}, {"time": 4451, "text": "Is it COVID?"}, {"time": 4453, "text": "Is it a rhinovirus, an adenovirus, or is it flu?"}, {"time": 4456, "text": "And we can do that."}, {"time": 4457, "text": "We can start building the rules of virus spread across the globe, both for pandemic preparedness, but also for just everyday use in the same way that people used to think that predicting the weather was gonna be impossible."}, {"time": 4473, "text": "Of course, we know that's not impossible now."}, {"time": 4474, "text": "Is it always perfect?"}, {"time": 4475, "text": "No, but does it offer, does it completely change the way that we go about our days?"}, {"time": 4484, "text": "I envision, for example, right now, we open up our iPhone, we plug in a zip code, and if it tells us it's gonna rain today, we bring an umbrella."}, {"time": 4493, "text": "So in the future, it tells us, hey, there's a lot of SARS CoV2 in your community."}, {"time": 4499, "text": "Instead of grabbing your umbrella, you grab your mask."}, {"time": 4502, "text": "We don't have to have masks all the time."}, {"time": 4505, "text": "But if we know the rules of the game that these viruses play by, we can start preparing for those."}, {"time": 4510, "text": "And every year, we go into every flu season blindfolded with our hands tied behind our back, just saying, I hope this isn't a bad flu season this year."}, {"time": 4521, "text": "I don't, I mean, this is, we're in the 21st century."}, {"time": 4528, "text": "We have the tools at our disposal now to not have that attitude."}, {"time": 4532, "text": "This isn't like 1920s."}, {"time": 4535, "text": "You know, we can just say, hey, this is gonna be a bad flu season this year."}, {"time": 4540, "text": "Let's act accordingly and with a targeted approach."}, {"time": 4544, "text": "You know, we don't, for example, we don't just use our umbrellas all day long, every single day, in case it might rain."}, {"time": 4553, "text": "We don't board up our homes every single day in case there's a hurricane."}, {"time": 4556, "text": "We wait, and if we know that there's one coming, then we act for a small period of time accordingly."}, {"time": 4563, "text": "And then we go back, and we've prepared ourselves in like these little bursts to not have it ruin our days."}, {"time": 4569, "text": "I can't tell you how exciting that vision of the future is."}, {"time": 4573, "text": "I think that's incredible."}, {"time": 4574, "text": "And it seems like it should be within our reach, the, just these like weather maps of viruses floating about the Earth, and it seems obvious."}, {"time": 4586, "text": "It's one of those things where right now, it seems like maybe impossible."}, {"time": 4591, "text": "And then looking back like 20 years from now, we'll wonder like why the hell this hasn't been done way earlier."}, {"time": 4599, "text": "Though one difference between weather, I don't know if you have interesting ideas in this space."}, {"time": 4605, "text": "The difference between weather and viruses is it includes, the collection of the data includes the human body, potentially."}, {"time": 4614, "text": "And that means that there is some, as with the contact tracing question, there's some concern about privacy."}, {"time": 4623, "text": "There seems to be this dance that's really complicated."}, {"time": 4627, "text": "With Facebook getting a lot of flack for basically misusing people's data, or just whether it's perception or reality, there's certainly a lot of reality to it too, where they're not good stewards of our private data."}, {"time": 4645, "text": "So there's this weird place where it's like obvious that if we do, if we collect a lot of data about human beings and maintain privacy and maintain all like basic respect for that data, just like honestly common sense respect for the data, that we can do a lot of amazing things for the world, like a weather map for viruses."}, {"time": 4668, "text": "Is there a way forward to gain trust of people or to do this well, do you have ideas here?"}, {"time": 4676, "text": "How big is this problem?"}, {"time": 4678, "text": "I think it's a central problem."}, {"time": 4680, "text": "There's a couple central problems that need to be solved."}, {"time": 4682, "text": "One, how do you get all the samples?"}, {"time": 4685, "text": "That's not actually too difficult."}, {"time": 4687, "text": "I'm actually, I have a pilot project going right now with getting samples from across all the United States."}, {"time": 4694, "text": "Tens of thousands of samples every week are flowing into my lab and we process them."}, {"time": 4699, "text": "So it's taking the, it's taking like one of the, basically there's biology here and chemistry and converting that into numbers."}, {"time": 4708, "text": "So what we're doing, for example, there's a lot of people who go to the hospital every day, a lot of people who donate blood, people who donate plasma."}, {"time": 4716, "text": "So one of the projects that I have, I'll get to the privacy question in a moment, but this, so what I wanna do is the name that I've given this as a global immunological observatory."}, {"time": 4726, "text": "There's no reason not to have that."}, {"time": 4729, "text": "I've said, instead of saying, well, how do we possibly get enough people on board to send in samples all the time?"}, {"time": 4736, "text": "Well, just go to the source."}, {"time": 4737, "text": "So there's a company in Massachusetts that makes 80% of all the instruments that are used globally to collect plasma from plasma donors."}, {"time": 4747, "text": "So I went to this company, Hemenetics, and said, is there a way you have 80% of the global market on plasma donations?"}, {"time": 4758, "text": "Can we start getting plasma samples from healthy people that use your machines?"}, {"time": 4764, "text": "So that hooked me up with this company called Octopharma."}, {"time": 4766, "text": "And Octopharma has a huge reach and offices all over the country where they're just collecting people's plasma."}, {"time": 4772, "text": "They actually pay people for their plasma and then that gets distributed to hospitals and all this stuff is anonymous plasma."}, {"time": 4779, "text": "So I've just been collecting anonymous samples."}, {"time": 4783, "text": "And we're processing them, in this case, for COVID antibodies to watch from January up through December, we're able to watch how the virus entered into the United States and how it's transmitting every day across the US."}, {"time": 4798, "text": "So we're getting those results organized now and we're gonna start putting them publicly online soon to start making at least a very rough map of COVID."}, {"time": 4810, "text": "But that's the type of thinking that I have in terms of like, how do you actually capture huge numbers of specimens?"}, {"time": 4817, "text": "You can't ask everyone to participate on sort of a, I mean, you maybe could if you have the right tools and you can offer individuals something in return like 23andMe does."}, {"time": 4827, "text": "That's a great way to get people to give specimens and they get results back."}, {"time": 4831, "text": "So with these technologies that I've been building along with some collaborators at Harvard, we can come up with tools that people might actually want."}, {"time": 4839, "text": "So I can offer you your immunological history."}, {"time": 4843, "text": "I can say, give me a drop of your blood on a filter paper, mail it in and I will be able to tell you every infectious disease you've ever encountered and maybe even when you encountered it roughly."}, {"time": 4855, "text": "I could tell you, do you have COVID antibodies right now?"}, {"time": 4858, "text": "Do you have Lyme disease antibodies right now?"}, {"time": 4860, "text": "Flu, triple E and all these different viruses."}, {"time": 4863, "text": "Also peanut allergies, milk allergies, anything."}, {"time": 4867, "text": "If your immune system makes a response to it, we can detect that response."}, {"time": 4874, "text": "So all of a sudden we have this very valuable technology that on the one hand gives people maybe information they might want to know about themselves, but on the other hand becomes this amazingly rich source of big data to enter into this global immunological observatory sort of mathematical framework to start building these maps, these epidemiological tools."}, {"time": 4894, "text": "But you asked about privacy and absolutely that's essential to keep in mind first and foremost."}, {"time": 4901, "text": "So privacy can be, you can keep these samples 100% anonymous."}, {"time": 4907, "text": "They are just, when I get them, they show up with nothing."}, {"time": 4909, "text": "They're literally just tubes."}, {"time": 4911, "text": "I know a date that they were collected and a zip code that they're collected from or even just sort of a county level ID."}, {"time": 4919, "text": "So with an IRB and with ethical approval and with the people's consent, we can maybe collect more data, but that would require consent."}, {"time": 4927, "text": "But then there's this other approach which I'm really excited about, which is certainly going to gain some scrutiny I think, but we'll have to figure out where it comes into play."}, {"time": 4937, "text": "But I've been recognizing that we can take somebody's immunological profile and we can make a biological fingerprint out of it."}, {"time": 4945, "text": "And it's actually stable enough so that I could take your blood."}, {"time": 4948, "text": "Let's say I don't know who you are, but you sent me a drop of blood a year ago and then you sent me a drop of blood today."}, {"time": 4956, "text": "I don't know that those two blood spots are coming from the same person."}, {"time": 4959, "text": "They're just showing up in my lab."}, {"time": 4962, "text": "But I can run our technology over and it just gives me your immunological history."}, {"time": 4969, "text": "But your immunological history is so unique to you and the way that your body responds to these pathogens is so unique to you that I can use that to tether your two samples."}, {"time": 4979, "text": "I don't know who you are, I know nothing about you."}, {"time": 4982, "text": "I only know when those samples came out of a person."}, {"time": 4986, "text": "But I can say, oh, these two samples a year apart actually belong to the same person."}, {"time": 4990, "text": "Yeah, so there's sufficient information in that immunological history to match the samples."}, {"time": 4996, "text": "Or from a privacy perspective, that's really exciting."}, {"time": 4998, "text": "Does that generally hold for humans?"}, {"time": 5000, "text": "So you're saying there's enough uniqueness to match?"}, {"time": 5003, "text": "Yeah, because it's very stochastic, even twins."}, {"time": 5005, "text": "So this, I believe, we haven't published this yet."}, {"time": 5008, "text": "We will soon."}, {"time": 5009, "text": "You have a twin too, right?"}, {"time": 5010, "text": "I do have a twin, I have an identical twin brother, which makes me interested in this."}, {"time": 5014, "text": "He looks very much like me."}, {"time": 5016, "text": "Oh, is that how that works?"}, {"time": 5018, "text": "And DNA can't really tell us apart."}, {"time": 5022, "text": "But this tool is one of the only tools in the world that could tell twins apart from each other."}, {"time": 5028, "text": "Could still be accurate enough to say this blood, it's like 99.999% accurate to say that these two blood samples came from the same individual."}, {"time": 5040, "text": "And it's because it's a combination, both of your immunological history, but also how your unique body responds to a pathogen, which is random."}, {"time": 5050, "text": "The way that we make antibodies is, by and large, it's got an element of randomness to it."}, {"time": 5057, "text": "How the cells, when they make an antibody, they chop up the genetic code to say, okay, this is the antibody that I'm gonna form for this pathogen."}, {"time": 5066, "text": "And you might form, if you get a coronavirus, for example, you might form hundreds of different antibodies, not just one antibody against the spike protein, but hundreds of different antibodies against all different parts of the virus."}, {"time": 5078, "text": "So that gives this really rich resolution of information that when I then do the same thing across hundreds of different pathogens, some of which you've seen, some of which you haven't, it gives you an exceedingly unique fingerprint that is sufficiently stable over years and years and years to essentially give you a barcode."}, {"time": 5097, "text": "And I don't have to know who you are, but I can know that these two specimens came from the same person somewhere out in the world."}, {"time": 5104, "text": "So fascinating that there's this trace, your life story in the space of viruses, in the space of pathogen, like these, you know, because there's this entire universe of these organisms that are trying to destroy each other."}, {"time": 5123, "text": "And then your little trajectory through that space leaves a trace, and then you can look at that trace."}, {"time": 5130, "text": "And that, I mean, there's, okay, that data period is just fascinating."}, {"time": 5135, "text": "And the vision of making that data universally connected to where you can make, like infer things, and just like with the weather, is really fascinating."}, {"time": 5147, "text": "And there's probably artificial intelligence applications there, start making predictions, start finding patterns."}, {"time": 5153, "text": "Exactly, we're doing a lot of that already."}, {"time": 5154, "text": "And that's how, how do we have this going?"}, {"time": 5157, "text": "You know, I've been trying to get this funded for years now."}, {"time": 5160, "text": "And I've spoken to governments, you know, everyone says, cool idea, not gonna do it."}, {"time": 5165, "text": "You know, why do we need it?"}, {"time": 5168, "text": "The why do you need it?"}, {"time": 5168, "text": "Yeah, the why do you need it."}, {"time": 5170, "text": "And of course now, you know, I mean, I wrote in 2015 about this, why we would, why this would be useful."}, {"time": 5178, "text": "And of course, now we're seeing why it would be useful."}, {"time": 5181, "text": "Had we had this up and running in 2019, had we had it going, we were drawing blood from, you know, we're getting blood samples from hospitals and clinics and blood donors from New York City, let's just say, you know, that could have, we didn't run the first PCR test for coronavirus until probably a month and a half or two months after the virus started transmitting in New York City."}, {"time": 5206, "text": "So it's like with the rain, we didn't start wearing umbrella or taking out umbrellas."}, {"time": 5212, "text": "Exactly, for two months, but different than the rain, we couldn't actually see that it was spreading right now."}, {"time": 5218, "text": "And so Andrew Cuomo had no choice but to leave the city open."}, {"time": 5222, "text": "You know, there were hints that maybe the virus was spreading in New York City, but you know, he didn't have any data to back it up."}, {"time": 5227, "text": "No data."}, {"time": 5228, "text": "And so it was just week on week and week."}, {"time": 5232, "text": "And he didn't have any information to really go by to allow him to have the firepower to say we're closing down the city."}, {"time": 5240, "text": "This is an emergency."}, {"time": 5241, "text": "We have to stop spread before it starts."}, {"time": 5245, "text": "And so they waited until the first PCR tests were coming about."}, {"time": 5249, "text": "And then the moment they started running PCR tests, they find out it's everywhere."}, {"time": 5252, "text": "You know, and so that was a disaster because of course New York City, you know, was just hit so bad because nobody was, you know, we were blind to it."}, {"time": 5261, "text": "We didn't have to be blind to it."}, {"time": 5263, "text": "And the nice thing about this technology is we wouldn't have, with the exact same technology we had in 2017, we could have detected this novel coronavirus spreading in New York City in 2020."}, {"time": 5276, "text": "Not because we changed, not because we are actually actively looking for this novel coronavirus, but because we would see, we would have seen patterns in people's immune responses using AI, or just frankly using our, just the raw data itself."}, {"time": 5290, "text": "We could have said, hey, it looks like there's something that looks like known coronavirus is spreading in New York, but there's gaps."}, {"time": 5298, "text": "You know, there's, for some reason, people aren't developing an immune response to this coronavirus that seems to be spreading to these normal things that, you know, and it just looks, the profile looks different."}, {"time": 5309, "text": "And we could have seen that and immediately, especially since we had an idea that there was a novel coronavirus circulating in the world, we could have very quickly and easily seen, hey, clearly we're seeing a spike of something that looks like a known coronavirus, but people are responding weirdly to it."}, {"time": 5326, "text": "Our AI algorithms would have picked it up, and just our basic, heck, you could have put it in an Excel spreadsheet, we would have seen it."}, {"time": 5336, "text": "Some basic visualization would have shown it."}, {"time": 5338, "text": "Exactly, we would have seen spikes, and they would have been kind of like off, you know, immune responses that the shape of them just looked a little bit different, but they would have been growing, and we would have seen it, and it could have saved tens of thousands of lives in New York City."}, {"time": 5352, "text": "So to me, the fascinating question, everything we've talked about, so both the huge collection of data at scale, just super exciting, and then the kind of obvious at scale solution to the current virus and future ones is the rapid testing."}, {"time": 5370, "text": "Can we talk about the future of viruses that might be threatening our very existence?"}, {"time": 5379, "text": "So do you think like a future natural virus can have an order of magnitude greater effect on human civilization than anything we've ever seen?"}, {"time": 5392, "text": "So something that either kills all humans, or kills, I don't know, 60, 70% of humans."}, {"time": 5401, "text": "So something like something we can't even imagine."}, {"time": 5409, "text": "Because it seems to not have happened yet."}, {"time": 5411, "text": "So maybe like the entirety, whoever the programmer is of the simulation that sort of launched the evolution from the Big Bang seems to not want to destroy us humans."}, {"time": 5424, "text": "Or maybe that's the natural side effect of the evolutionary process that humans are useful."}, {"time": 5430, "text": "But do you think it's possible that the evolutionary process will produce a virus that will kill all humans?"}, {"time": 5435, "text": "I think it could."}, {"time": 5436, "text": "I don't think it's likely."}, {"time": 5438, "text": "And the reason I don't think it's likely is on the one hand, it hasn't happened yet, in part because mobility is a recent phenomena."}, {"time": 5450, "text": "People weren't particularly mobile until fairly recently."}, {"time": 5455, "text": "Now, of course, now that we have people flying back and forth across the globe all the time, the chances of global pandemics has escalated exponentially, of course."}, {"time": 5468, "text": "And so on the one hand, that's part of why it hasn't happened yet."}, {"time": 5471, "text": "We can look at things like Ebola."}, {"time": 5474, "text": "Now, Ebola, we haven't generally had major Ebola epidemics in the past, not because Ebola wasn't transmitting and infecting humans, but because it was largely affecting and infecting humans in disconnected communities."}, {"time": 5489, "text": "So you see out in rural parts of Africa, for example, in Western Africa, you might end up having isolated Ebola outbreaks, but there weren't connections that were fast enough that would allow people to then spread it into the cities."}, {"time": 5505, "text": "Of course, we saw back in 2014, 15 massive Ebola outbreak that wasn't because it was a new strain of Ebola, but it was because there's new inroads and connections between the communities and people got it to the city."}, {"time": 5524, "text": "And so we saw it start to spread."}, {"time": 5527, "text": "So that should be a little bit foreshadowing of what's to come."}, {"time": 5532, "text": "And now we have this pandemic."}, {"time": 5535, "text": "We had 2009, we have this."}, {"time": 5538, "text": "There is a benefit or there is sort of a natural check."}, {"time": 5543, "text": "And this is like kind of like a Voltaire predator prey dynamic kind of systems, ecological systems and mathematics that if you have something that's so deadly, people will respond more maybe with a greater panic, a greater sense of panic, which alone could, you know, destroy humanity."}, {"time": 5563, "text": "But at the same time, we now know that we can lock down."}, {"time": 5567, "text": "We know that that's possible."}, {"time": 5569, "text": "And so if this was a worse virus that was actually killing 60% of people as infecting, we would lock down very quickly."}, {"time": 5575, "text": "My biggest fear though, is let's say that was happening."}, {"time": 5579, "text": "You need serious lockdowns if you're gonna keep things going."}, {"time": 5583, "text": "So the only reason we were able to keep things going during our lockdowns is because it wasn't so bad that we were still able to have people work in the grocery stores."}, {"time": 5593, "text": "Still have people work in the shipping to get the food onto the shelves."}, {"time": 5596, "text": "So on the one hand, we could probably figure out how to stop the virus, but can we stop the virus without starving?"}, {"time": 5604, "text": "You know, and I'm not sure that that, if this was another acute respiratory virus that say had a slightly, say it transmitted the same way, but say it actually did worse damage to your heart, but it was like a month later that people started having heart attacks in mass."}, {"time": 5621, "text": "You know, it's like not just one offs, but really severe."}, {"time": 5625, "text": "Well, that could be a serious problem for humanity."}, {"time": 5630, "text": "So in some ways I think that there are lots of ways that we could end up dying at the hand of a virus."}, {"time": 5636, "text": "I mean, we're already seeing it."}, {"time": 5637, "text": "Just, I mean, my fear is still, I think coronaviruses have demonstrated a keen ability to destroy or to create outbreaks that can potentially be deadly to large numbers of people."}, {"time": 5650, "text": "Flu strains, though, are still by and large my concern."}, {"time": 5654, "text": "So you think the bad one might come from the flu, the influenza?"}, {"time": 5658, "text": "Yeah, their replication cycle, they're able to genetically recombine in a way that coronaviruses aren't."}, {"time": 5664, "text": "They have segmented genomes, which means that they can just swap out whole parts of their genomes, no problem, repackage them, and then boom, you have a whole antigenic shift, not a drift."}, {"time": 5675, "text": "What that means is that on any occasion, any day of the year, you can have, boom, a whole new virus that didn't exist yesterday."}, {"time": 5684, "text": "And now with farming and industrial livestock, we're seeing animals and humans come into contact much more."}, {"time": 5693, "text": "Just the opportunities for an influenza strain that is unique and deadly to humans increases."}, {"time": 5701, "text": "All the while, transmission and mobility has increased."}, {"time": 5706, "text": "It's just a matter of time, in my opinion."}, {"time": 5709, "text": "What about from immunology perspective of the idea of engineering a virus?"}, {"time": 5716, "text": "So not just the virus leaking from a lab or something, but actually being able to understand the protein, like everything about what makes a virus enough to be able to figure out ways to maybe target it or untarget it, attack biologics."}, {"time": 5736, "text": "Subverse immunity."}, {"time": 5739, "text": "Is that something, obviously that's somewhere on the list of concerns, but is that anywhere close of the top 10 highlights along with nuclear weapons and so on that we should be worried about?"}, {"time": 5753, "text": "Or is the natural pandemic really the one that's much greater concern?"}, {"time": 5758, "text": "I would say that the former, that manmade viruses and genetically engineered viruses should be right up there with the greatest concerns for humanity right now."}, {"time": 5771, "text": "We know that the tools, for better or worse, the tools for creating a virus are there."}, {"time": 5779, "text": "We can do it."}, {"time": 5780, "text": "And I mean, heck, the human species is no longer vaccinated against smallpox."}, {"time": 5788, "text": "I didn't get a smallpox vaccine."}, {"time": 5789, "text": "You didn't get a smallpox vaccine, at least I don't think."}, {"time": 5792, "text": "And so if somebody wanted to make smallpox and distribute it to the world in some way, it could be exceedingly deadly and detrimental to humans."}, {"time": 5806, "text": "And that's not even sort of using your imagination to create a new virus."}, {"time": 5812, "text": "That's one that we already have."}, {"time": 5814, "text": "Unlike the past when smallpox would circulate, you had large fractions of the community that was already immune to it."}, {"time": 5822, "text": "And so it wouldn't spread or it would spread a little bit slower."}, {"time": 5825, "text": "But now we have essentially in a few years, we'll have a whole global population that is susceptible."}, {"time": 5831, "text": "Let's look at measles."}, {"time": 5832, "text": "We have an entire, I mean, measles, I have, there are some researchers in the world right now, which for various reasons are working on creating a measles strain that evades immunity."}, {"time": 5846, "text": "It's not for bioterrorism, at least that's not the expectation."}, {"time": 5849, "text": "It's for using measles as an oncolytic virus to kill cancer."}, {"time": 5854, "text": "And the only way you can really do that is if your immune system doesn't, if you take a measles virus and there's, we don't have to go into the details of why it would work, but it could work."}, {"time": 5864, "text": "Measles likes to target potentially cancer cells."}, {"time": 5869, "text": "But to get your immune system not to kill off the virus if you're trying to use the virus to target it, you maybe want to make it blind to the immune system."}, {"time": 5877, "text": "But now imagine we took some virus like measles, which has an R naught of 18, transmits extremely quickly."}, {"time": 5884, "text": "And now we have essentially, let's say we had a whole human race that is susceptible to measles."}, {"time": 5890, "text": "And this is a virus that spreads orders of magnitude easier than this current virus."}, {"time": 5897, "text": "Imagine if you were to plug something toxic or detrimental into that virus and release it to the world."}, {"time": 5904, "text": "So it's possible to be both accidental and intentional."}, {"time": 5910, "text": "Yeah, so Mark Lipsitch is a good colleague of mine at Harvard, we're both in the, he's the director of the Center for Communicable Disease Dynamics from a faculty member."}, {"time": 5920, "text": "He's spoken very, very forcefully and he's very outspoken about the dangers of gain of function testing, where in the lab we are intentionally creating viruses that are exceedingly deadly under the auspices of trying to learn about them."}, {"time": 5939, "text": "So that if the idea is that if we kind of accelerate evolution and make these really deadly viruses in the lab, we can be prepared for if that virus ever comes about naturally or through unnatural means."}, {"time": 5954, "text": "The concern though is, okay, that's one thing, but what if that virus got out on somebody's shoe?"}, {"time": 5960, "text": "Just what if?"}, {"time": 5964, "text": "If the effects of an accident are potentially catastrophic, is it worth taking the chances just to be prepared a little bit for something that may or may not ever actually develop?"}, {"time": 5976, "text": "And so it's a serious ethical quandary we're in, how to both be prepared, but also not cause a catastrophic mistake."}, {"time": 5989, "text": "As a small tangent, there's a recent really exciting breakthrough of alpha two, of alpha fold two solving protein folding or achieving state of the art performance on protein folding."}, {"time": 6002, "text": "And then I thought proteins have a lot to do with viruses."}, {"time": 6009, "text": "It seems like being able to use machine learning to design proteins that achieve certain kinds of functions will naturally allow you to use maybe down the line, not yet, but allow you to use machine learning to design basically viruses, maybe like measles, like for good, which is like to attack cancer cells, but also for bad."}, {"time": 6037, "text": "Is that a crazy thought or is this a natural place where this technology may go?"}, {"time": 6046, "text": "I suppose as all technologies can, which is for good and for bad."}, {"time": 6052, "text": "Do you think about the role of machine learning in this?"}, {"time": 6054, "text": "Oh yeah, absolutely, I mean, alpha fold is amazing."}, {"time": 6059, "text": "It's an amazing algorithm, a series of algorithms."}, {"time": 6063, "text": "And it does demonstrate, to me, it demonstrates just how powerful, everything in the world has rules."}, {"time": 6072, "text": "We just don't know the rules."}, {"time": 6073, "text": "We often don't know them, but our brain has rules, how it works."}, {"time": 6077, "text": "Everything is plus and minus."}, {"time": 6079, "text": "There's nothing in the world that's really not at its most basic level, positive, negative."}, {"time": 6085, "text": "It's all, obviously, it's all just charge."}, {"time": 6088, "text": "And that means everything."}, {"time": 6090, "text": "You can figure it out with enough computational power and enough, in this case, I mean, machine learning and AI is just one way to learn rules."}, {"time": 6100, "text": "It's an empirical way to learn rules, but it's a profoundly powerful way."}, {"time": 6104, "text": "And certainly, now that we are getting to a point where we can take a protein and know how it folds, given its sequence, we can reverse engineer that and we can say, okay, we want a protein to fold this way."}, {"time": 6121, "text": "What does the sequence need to be?"}, {"time": 6123, "text": "We haven't done that yet so much, but it's just the next iteration of all of this."}, {"time": 6129, "text": "And so let's say somebody wants to develop a virus it's gonna start with somebody wanting to develop a virus to defeat cancer, something good."}, {"time": 6138, "text": "And so it would start with a lot of money from the federal government for all the positives that will come out of it."}, {"time": 6147, "text": "But we have to be really careful because that will come about."}, {"time": 6152, "text": "There's no doubt in my mind that we will develop, we're already doing it."}, {"time": 6156, "text": "We engineer molecules all the time for specific uses."}, {"time": 6159, "text": "Oftentimes, we take them from a lab and then we take them from a lab and then we make them."}, {"time": 6164, "text": "Oftentimes, we take them from nature and then tweak them."}, {"time": 6168, "text": "But now we can supercharge it."}, {"time": 6169, "text": "We can accelerate the pace of discovery."}, {"time": 6173, "text": "To not have it just be discovery, we have it be true ground up engineering."}, {"time": 6178, "text": "Let's say you're trying to make a new molecule to stabilize somebody with some retinal disease."}, {"time": 6186, "text": "So we come up with some molecule to stability of somebody with retinal degeneration."}, {"time": 6194, "text": "Just a small tweak to that, to say make a virus that causes the human race to become blind."}, {"time": 6200, "text": "I mean, it sounds really conspiracy theoryish, but it's not."}, {"time": 6205, "text": "We're learning so much about biology and there's always nefarious reasons."}, {"time": 6208, "text": "I mean, heck, look at how AI and just Google searches, those can be, they are every single day being leveraged by nefarious actors to take advantage of people, to steal money, to do whatever it might be."}, {"time": 6225, "text": "Eventually, probably to create wars or already to create wars."}, {"time": 6230, "text": "And I mean, I don't think there's any question at this point behind disinformation campaigns."}, {"time": 6235, "text": "And so it's being leveraged."}, {"time": 6236, "text": "This thing that could be wholly good is always going to be leveraged for bad."}, {"time": 6242, "text": "And so how do you balance that as a species?"}, {"time": 6244, "text": "I'm not quite sure."}, {"time": 6246, "text": "The hope is, as you mentioned previously, that there's some, that we were able to also develop defense mechanisms."}, {"time": 6252, "text": "And there's something about the human species that seems to keep coming up with ways to, just like on the deadline, just at the last moment, figuring out how to avoid destruction."}, {"time": 6266, "text": "I think I'm eternally optimistic about the human race not destroying ourselves, but you could do a lot of things that would be very painful."}, {"time": 6276, "text": "Well, we're doing it already, just, I mean, we are seeing how our regulation today, we did this thing, it started as a good thing, regulation of medical products, but now it is unwillingly and unintentionally harming us."}, {"time": 6295, "text": "Our regulatory landscape, which was developed totally for good in our country is getting in the way of us deploying a tool that could stop our economies from having to be sort of sputteringly closed, that could stop deaths from happening at the rate that they are."}, {"time": 6314, "text": "And it's, I think we will come to a solution."}, {"time": 6319, "text": "Of course, now we're gonna get the vaccine and it's gonna make people lose track of like why we even bother testing, which is a bad idea."}, {"time": 6325, "text": "But we're already seeing that."}, {"time": 6328, "text": "We have this amazing capacity to both do damage when we don't intend to do damage and then also to pull up when we need to pull up and stop complete catastrophe."}, {"time": 6341, "text": "And so we are an interesting species in that way, that's for sure."}, {"time": 6347, "text": "So there's a lot of young folks, undergrads, grads, they're also young, listen to this."}, {"time": 6354, "text": "So is there, you've talked about a lot of fascinating stuff that's like, there's ways that things are done and there's actual solutions and they're not always like intersecting."}, {"time": 6365, "text": "Do you have advice for undergraduate students or graduate students or even people in high school now about a life, about a career of how they might be able to solve real big problems in the world, how they should live their life in order to have a chance to solve big problems in the world?"}, {"time": 6386, "text": "I struggle a little bit sometimes to give advice because the advice that I give from my own personal experience is necessarily distinct from the advice that would make other people successful."}, {"time": 6396, "text": "I have unending ambitions to make things better, I suppose."}, {"time": 6402, "text": "And I don't see barricades where other people sometimes see barricades."}, {"time": 6408, "text": "Now, even just little things like when this virus started, I'm a medical director at Brigham and Women's Hospital and so I oversee or helped oversee molecular virology diagnostics."}, {"time": 6418, "text": "So when this virus started, wearing my epidemiology hat and wearing my sort of viral outbreak hat, I recognized that this is gonna be a big virus that was important on a global level."}, {"time": 6427, "text": "Even if the CDC and WHO weren't ready to admit that it was a pandemic, it was obvious in January that it was a pandemic."}, {"time": 6434, "text": "So I started trying to get a test built at the Brigham, which is one of Harvard's teaching hospitals."}, {"time": 6440, "text": "The first encounters I had with the upper administration of the hospital were pretty much, no, why would we do that?"}, {"time": 6448, "text": "That's silly, who are you?"}, {"time": 6450, "text": "And I said, well, okay, don't believe me, sure."}, {"time": 6453, "text": "But I kept pushing on it."}, {"time": 6455, "text": "And then eventually I got them to agree."}, {"time": 6458, "text": "It was really only a couple of weeks before the Biogen conference happened."}, {"time": 6463, "text": "We started building the test."}, {"time": 6464, "text": "I think they started looking abroad and saying, okay, this is happening, sure, like, maybe he was right."}, {"time": 6470, "text": "But then I went a step further and I said, we're not gonna have enough tests at the hospital."}, {"time": 6475, "text": "And so my ambition was to get a better testing program started and so I figured what better place to scale up testing than the Broad Institute."}, {"time": 6486, "text": "Broad Institute is amazing, very high throughput, high efficiency research institute that does a lot of genomic sequencing, things like that."}, {"time": 6493, "text": "So I went to the Broad and I said, hey, there's this coronavirus that's obviously gonna impact our society greatly."}, {"time": 6500, "text": "Can we start modifying your high efficiency instruments and robots for coronavirus testing?"}, {"time": 6507, "text": "Everyone in my orbit, in the hospital world, just said, that's ridiculous."}, {"time": 6515, "text": "How could you possibly plan to do that?"}, {"time": 6518, "text": "And to me, it was like the most dead simple thing to do."}, {"time": 6523, "text": "It didn't, but the higher ups and the people who think about, I think one of the things is to recognize that most people in the world don't see solutions, they just see problems."}, {"time": 6533, "text": "And it's because it's an easy thing to do."}, {"time": 6535, "text": "Thinking of problems and how things will go wrong is really easy because you're not coming up with a brand new solution."}, {"time": 6544, "text": "And this to me was just a super simple solution."}, {"time": 6547, "text": "Hey, let's get the Broad to help build tests."}, {"time": 6549, "text": "Every single hospital director told me no, like it's impossible."}, {"time": 6553, "text": "My own superiors, the ones I report to in the hospital, said, you know, Mike, you're a new faculty member."}, {"time": 6560, "text": "Your ideas probably would be right, but you're too naive and young to know that it's impossible."}, {"time": 6567, "text": "Obviously now the Broad is the highest throughput laboratory in the country."}, {"time": 6572, "text": "And so I think my recommendation to people is as much as possible, get out of the mode of thinking about things as problems."}, {"time": 6582, "text": "Sometimes you piss people off, I could probably use a better filter sometimes to try to like be not so upfront with certain things."}, {"time": 6591, "text": "But it's just so crucial to always just see, to just bring it, like think about things in new ways that other people haven't."}, {"time": 6599, "text": "Cause usually there's something else out there."}, {"time": 6601, "text": "And one of the things that has been most beneficial to me, which is that my education was really broad."}, {"time": 6607, "text": "It was engineering and physics."}, {"time": 6610, "text": "And well, and then I became a Buddhist monk."}, {"time": 6613, "text": "Well, and then I became a Buddhist monk for a while."}, {"time": 6615, "text": "And so that gave me a different perspective, but then it was medicine and immunology."}, {"time": 6620, "text": "And now I've brought all of it together from a mathematics and biology and medicine perspective and policy and public health."}, {"time": 6629, "text": "And I think that, you know, I'm not the best in any one of these things."}, {"time": 6632, "text": "I recognize that there are gonna be geniuses out there who are just worlds better than me at any one of these things that I try to work on."}, {"time": 6641, "text": "But my superpower is bringing them all together, you know, and just thinking, and that's, I think how you can really change the world."}, {"time": 6649, "text": "You know, I don't know that I'll ever change the world in the way that I hope."}, {"time": 6653, "text": "But that's how you can have a chance."}, {"time": 6655, "text": "Yeah, that's how you can have a chance, exactly."}, {"time": 6657, "text": "And I think it's also what, you know, this to me, this rapid testing program, like this is the most dead simple solution in the world."}, {"time": 6666, "text": "And this literally could change the world."}, {"time": 6667, "text": "It could change the world."}, {"time": 6668, "text": "It could change, and it is, you know, there's countries that are doing it now."}, {"time": 6671, "text": "The US isn't, but I've been advising many countries on it."}, {"time": 6673, "text": "And I would say that, you know, some of the early papers that we put out earlier on, a lot of the things actually are changing."}, {"time": 6682, "text": "You don't always, unless you really look hard, you don't know where you're actually having an effect."}, {"time": 6686, "text": "Sometimes it's more overt than other times."}, {"time": 6690, "text": "In April, I published a paper that was saying, hey, with the PCR values from these tests, we need to really focus on the CT values, the actual quantitative values of these lab based PCR tests."}, {"time": 6702, "text": "At the time, all the physicians and laboratory directors told me that was stupid."}, {"time": 6706, "text": "You know, why would you do that?"}, {"time": 6708, "text": "They're not accurate enough."}, {"time": 6709, "text": "And of course, now it's headline news that, you know, Florida, they just mandated reporting out the CT values of these tests, cause there's a real utility of them."}, {"time": 6718, "text": "You can understand public health from it."}, {"time": 6720, "text": "You can understand better clinical management."}, {"time": 6723, "text": "You know, that was a simple solution to a pretty difficult problem."}, {"time": 6727, "text": "And it is changing."}, {"time": 6729, "text": "The way that we approach all of the lab testing in this country is starting to, it's taken a few months, but it's starting to change because of that."}, {"time": 6735, "text": "And, you know, that was just me saying, hey, this is something we should be focusing on."}, {"time": 6740, "text": "Got some other people involved and other people."}, {"time": 6742, "text": "And now people recognize, hey, there's actual value in this number that comes out of these lab based PCR tests."}, {"time": 6749, "text": "So sometimes it does grow fairly quickly."}, {"time": 6753, "text": "But I think the real answer, if my only answer, I don't know what, you know, I recognize that everyone, some people are gonna be really focused on and have one small, but deep skillset."}, {"time": 6765, "text": "I go the opposite direction."}, {"time": 6766, "text": "I try to bring things together."}, {"time": 6768, "text": "And, but the biggest thing I think is just, don't see barriers, like just see, like there's always a solution to a barrier."}, {"time": 6778, "text": "If there's a barrier, that literally means there's a solution to it."}, {"time": 6781, "text": "That's why it's called a barrier."}, {"time": 6782, "text": "And just like you said, most people will just present to you, only be thinking about it and present to you with barriers."}, {"time": 6789, "text": "And so it's easy to start thinking that's all there is in this world."}, {"time": 6792, "text": "And just think big."}, {"time": 6793, "text": "I mean, God, you know, there's nothing wrong with thinking big."}, {"time": 6797, "text": "Elon Musk thought big and, you know, and then thinking big builds on itself."}, {"time": 6801, "text": "You know, you get a billion dollars from one big idea and then that allows you to make three new big ideas."}, {"time": 6807, "text": "And there's a hunger for it if you think big and you communicate that vision with the world."}, {"time": 6812, "text": "All the most brilliant and like passionate people will just like, you'll attract them and they'll come to you."}, {"time": 6818, "text": "And then it makes your life actually really exciting."}, {"time": 6821, "text": "The people I've met at like Tesla and Neuralink, I mean, there's just like this fire in their eyes."}, {"time": 6827, "text": "They just love life."}, {"time": 6828, "text": "And it's amazing, I think, to be around those people."}, {"time": 6833, "text": "I have to ask you about what was the philosophy, the journey that took you to becoming a Buddhist monk and what did you learn about life?"}, {"time": 6847, "text": "What did you take away from that experience?"}, {"time": 6849, "text": "How did you return back to Harvard and the world that's unlike that experience, I imagine?"}, {"time": 6857, "text": "Yeah, well, I was at Dartmouth at the time."}, {"time": 6862, "text": "Well, I went to Sri Lanka."}, {"time": 6863, "text": "I was already pretty interested in developing countries and sort of under resourced areas."}, {"time": 6867, "text": "And I was doing a lot of engineering work and I went there, but I was also starting to think maybe health was something of interest."}, {"time": 6877, "text": "And so I went to Sri Lanka because I had a long interest in Buddhism as well, just kind of interested in it as a thing."}, {"time": 6886, "text": "Which aspect of the philosophy attracted you?"}, {"time": 6889, "text": "I would say that the thing that interested me most was really this idea of kind of a butterfly effect of like what you do now has ripple effects that extend out beyond what you can possibly imagine, both in your own life and in other people's lives."}, {"time": 6910, "text": "And in some ways, Buddhism has, not in some ways, in a pretty deep way, Buddhism has that as part of its underlying philosophy in terms of rebirth and sort of your actions today propagate to others, but also propagate to sort of what might happen in your circle of what's called samsara and rebirth."}, {"time": 6932, "text": "And I don't know that I subscribe fully to this idea that we are reborn, which always was a little bit of a debate internally, I suppose, when I was a monk."}, {"time": 6947, "text": "But it has always been, it was that and then it was also meditation."}, {"time": 6952, "text": "At the time I was a fairly elite rower."}, {"time": 6955, "text": "I was rowing at the national level and rowing to me was very meditative."}, {"time": 6961, "text": "It was just, even if you're in a boat with other people, I mean, on the one hand, it's like the extreme of like a team sport, but it's also the extreme sort of focus and concentration that's required of it."}, {"time": 6976, "text": "And so I was always really into just meditative type of things."}, {"time": 6979, "text": "I was doing a lot of pottery too, which was also very meditative."}, {"time": 6982, "text": "And so Buddhism just kind of really, there are a lot of things about meditating that just appealed."}, {"time": 6990, "text": "And so I moved to Sri Lanka, planning to only be there for a couple of months."}, {"time": 6995, "text": "And then I was shadowing in this medical clinic and there was this physician who was just really, I mean, it's just kind of a horrible situation."}, {"time": 7003, "text": "Frankly, this guy was trained decades earlier."}, {"time": 7006, "text": "He was an older physician and he was still just practicing like these fairly barbaric approaches to medicine because he was a rural town and he just didn't have a lot of, he didn't have any updated training, frankly."}, {"time": 7020, "text": "And so, I just remember this like girl came in with like shrapnel in her hand and his solution was to like air it out."}, {"time": 7028, "text": "And so he was like, without even numbing her hand, he was like cutting it open more with this idea that like the more oxygen and stuff."}, {"time": 7040, "text": "And it just, I think there was something about all of this."}, {"time": 7043, "text": "And I was already talking to these monks at the time."}, {"time": 7045, "text": "I would be in this clinic in the morning and I'd go and my idea was to teach English to these monks in the evening."}, {"time": 7054, "text": "Turned out I'm a really bad English teacher."}, {"time": 7057, "text": "So they just taught, they allowed me just to sit with them and meditate and they were teaching me more about Buddhism than I could have possibly taught them about English or being an American or something."}, {"time": 7070, "text": "And so I just slowly, I just couldn't take, I like couldn't handle being in that clinic."}, {"time": 7075, "text": "So more and more, I just started moving to, spending more and more time at this monastery."}, {"time": 7079, "text": "And then after about two months, I was supposed to come back to the States and I decided I didn't want to."}, {"time": 7084, "text": "So I moved to this monastery in the mountains primarily because I didn't have the money to like just keep living."}, {"time": 7091, "text": "So living in a monastery is free."}, {"time": 7093, "text": "And so I moved there and just started meditating more and more and then months went by and it just really gravitated."}, {"time": 7102, "text": "I gravitated to the whole notion of it."}, {"time": 7104, "text": "I mean, it became, it sounds strange, but meditating almost just like anything that you've put your mind to became exciting."}, {"time": 7114, "text": "It became like there weren't enough hours in the day to meditate."}, {"time": 7145, "text": "Buddha talked about them and these are ancient writings, which exist."}, {"time": 7148, "text": "I mean, the writings are real."}, {"time": 7149, "text": "They're thousands of years old now."}, {"time": 7151, "text": "And so whether it was Buddha writing them or whoever, there are lots of different people who have contributed to these writings over the years."}, {"time": 7162, "text": "But they're very prescribed and they tell you what you're gonna go through."}, {"time": 7166, "text": "And I didn't really focus too much on them."}, {"time": 7170, "text": "I read a little bit about them, but your mind really does."}, {"time": 7172, "text": "When you actually start meditating at that level, like not an hour here and there, but like truly just spending your day as meditating, it becomes kind of like this other world where it becomes exciting and you're actively working, you're actively meditating, not just kind of trying to quiet things."}, {"time": 7191, "text": "That's sort of just the first stage of trying to get your mind to focus."}, {"time": 7194, "text": "Most people never get past that first stage, especially in our culture."}, {"time": 7198, "text": "Could you briefly summarize what's waiting beyond the stage of just quieting the mind?"}, {"time": 7205, "text": "It's hard for me to imagine that there's something that could be described as exciting on there."}, {"time": 7212, "text": "Yeah, it's an interesting question."}, {"time": 7214, "text": "So I would say, so the first thing, the first step is truly just to like be able to close your eyes, focus on your breath and not have other thoughts enter into your mind."}, {"time": 7226, "text": "That alone is just so hard to do."}, {"time": 7228, "text": "Like I couldn't do it now if I wanted, but I could then."}, {"time": 7233, "text": "But once you get past that stage, you start entering into like all these other, you go through the kind of, I went through this like pretty trippy stage, which is a little bit euphoric where you just kind of start not hallucinating."}, {"time": 7249, "text": "I mean, it wasn't like some crazy thing that would happen in a movie, but definitely just weird."}, {"time": 7289, "text": "I lived on this mountainside in this cottage thing, it was built into the rock."}, {"time": 7293, "text": "And so every morning I would wake up early and sweep around it and stuff, cause that's just what we did."}, {"time": 7300, "text": "And you start to, you meditate on all those activities."}, {"time": 7304, "text": "And one of the things that was so exciting, which sounds completely ridiculous now was just almost learning about your daily activities in ways that you never would have thought about before."}, {"time": 7316, "text": "So what's involved with like picking up this glass of water?"}, {"time": 7323, "text": "If I said, okay, I'm just gonna pick, I'm gonna take a drink of water, to me right now, it's a single activity."}, {"time": 7330, "text": "But during meditation, it's not a single activity."}, {"time": 7336, "text": "It's a whole series of activities of like little engineering feats and feelings."}, {"time": 7341, "text": "And it's gripping the water and it's feeling that the glass is cold and it's lifting and it's moving and dragging and dragging."}, {"time": 7349, "text": "And you start to learn a whole new language of life."}, {"time": 7354, "text": "And that to me was like this really exhilarating thing that it was an exhilarating component of meditation that there was never enough time."}, {"time": 7364, "text": "It's kind of like learning a new computer language."}, {"time": 7366, "text": "Like it gets really exciting when you start coding and all these new things you can do."}, {"time": 7370, "text": "You learn how to experience life in a much richer way."}, {"time": 7375, "text": "And so you never run out of ways to go deeper and deeper and deeper in the way you experienced even just the drinking of the glass of water."}, {"time": 7383, "text": "And what becomes kind of exhilarating is you start to be able to predict things that you never are, I don't even have predictions, right word."}, {"time": 7391, "text": "But I always think of the matrix, where I forget who it was, somebody was shooting at Neo and he like leans backwards and he dodges the bullets."}, {"time": 7402, "text": "In some ways, when you start breaking every little action that your hands do or that your feet do or that your body does down into all these little actions that make up one what we normally think of as an action, all of a sudden you can start to see things almost in slow motion."}, {"time": 7417, "text": "I like to think of it very much like language."}, {"time": 7420, "text": "The first time somebody hears a foreign language, it sounds really fast usually."}, {"time": 7425, "text": "You don't hear the spaces between words."}, {"time": 7428, "text": "And it just sounds like a stream of consciousness."}, {"time": 7433, "text": "And it just sounds like a stream of noises if you've never heard the language before."}, {"time": 7437, "text": "And as you learn the language, you hear clear breaks between words and it starts to gain context."}, {"time": 7442, "text": "And all of a sudden like that, what once sounded very fast slows down and it has meaning."}, {"time": 7450, "text": "That's our whole life."}, {"time": 7451, "text": "Well, there's this whole language happening that we don't speak generally."}, {"time": 7455, "text": "But if you start to speak it and if you start to learn it and you start to say, hey, I'm picking up this glass is actually 18 little movements."}, {"time": 7464, "text": "Then all of a sudden it becomes extremely exciting and exhilarating to just breathe."}, {"time": 7469, "text": "Breathing alone and the rise and fall of your abdomen or the way the air pushes in and out of your nose becomes almost interesting."}, {"time": 7477, "text": "And what's really neat is the world just starts slowing down and I'll never forget that feeling."}, {"time": 7484, "text": "And if there was one euphoric feeling from meditation I want to gain back, but I don't think I could without really meditating like that again and I don't think I will, was this like slow motion of the world."}, {"time": 7497, "text": "It was finding the spaces between all the movements in the same way that the spaces between all the words happen."}, {"time": 7504, "text": "And then it almost gives you this new appreciation for everything, it was really amazing."}, {"time": 7510, "text": "And so I think it came to an abrupt end though when the tsunami hit."}, {"time": 7515, "text": "I was there in the Indian Ocean tsunami hit in 2004."}, {"time": 7519, "text": "And it was like this dichotomy of being a monk and just meditating in this extraordinary place."}, {"time": 7528, "text": "And then the tsunami hits and kills 40,000 people in a few minutes on the coast of this really small little country in Sri Lanka."}, {"time": 7534, "text": "And then my whole world of being a monk came crashing down."}, {"time": 7541, "text": "And when I go to the coast, and I mean, that was just a devastating visual sight and emotional sight."}, {"time": 7554, "text": "But the strangest thing happened, which was that everyone just wanted me to stay as a monk."}, {"time": 7559, "text": "You know, people in that culture, they wanted to, the monks largely fled from the coastlines those, you know, and so then there I was and people wanted me to be a monk."}, {"time": 7571, "text": "They wanted me to stay on the coast, but be a monk and not help, like not help in the way that I considered helping."}, {"time": 7578, "text": "They wanted me just to keep meditating so that they could bring me offerings and have their sort of karmic responsibilities attended to as well."}, {"time": 7589, "text": "And so that was really bizarre to me."}, {"time": 7592, "text": "It was like, how could I possibly just sit around while all these people, half of everyone's family just died?"}, {"time": 7600, "text": "And so in any case, I stopped being a monk and I moved to this refugee camp and lived there for another six months or so and just stayed there, not as a monk, but tried to raise some money from the US and tried to like, I didn't know what I was doing."}, {"time": 7618, "text": "Frankly, I was 22."}, {"time": 7623, "text": "And I don't think I appreciated at the time how much of a role I was having in that community's life."}]}]