[{"title": "Dmitry Korkin: Evolution of Proteins, Viruses, Life, and AI | Lex Fridman Podcast #153", "id": "I51DuprOb0o", "quotes": [{"time": 400, "text": "So the spike protein."}, {"time": 401, "text": "And so it was solved very quickly."}, {"time": 406, "text": "And the reason for that is the advancement of this technology is pretty spectacular."}, {"time": 413, "text": "How many domains does the, is it more than one domain?"}, {"time": 418, "text": "Oh yes, I mean, so it's a very complex structure."}, {"time": 421, "text": "And we, you know, on top of the complexity of a single protein, right?"}, {"time": 428, "text": "So this structure is actually is a complex, is a trimer."}, {"time": 433, "text": "So it needs to form a trimer in order to function properly."}, {"time": 437, "text": "What's a complex?"}, {"time": 438, "text": "So a complex is a glomeration of multiple proteins."}, {"time": 442, "text": "And so we can have the same protein copied in multiple, you know, made up in multiple copies and forming something that we called a homo oligomer."}, {"time": 456, "text": "Homo means the same, right?"}, {"time": 458, "text": "So in this case, so the spike protein is the, is an example of a homo tetram, homo trimer, sorry."}, {"time": 466, "text": "So you need three copies of it?"}, {"time": 468, "text": "Three copies."}, {"time": 468, "text": "In order to."}, {"time": 470, "text": "We have these three chains, the three molecular chains coupled together and performing the function."}, {"time": 478, "text": "That's what, when you look at this protein from the top, you see a perfect triangle."}, {"time": 484, "text": "So, but other, you know, so other complexes are made up of, you know, different proteins."}, {"time": 492, "text": "Some of them are completely different."}, {"time": 495, "text": "Some of them are similar."}, {"time": 496, "text": "The hemoglobin molecule, right?"}, {"time": 498, "text": "So it's actually, it's a protein complex."}, {"time": 501, "text": "It's made of four basic subunits."}, {"time": 505, "text": "Two of them are identical to each other."}, {"time": 509, "text": "Two other identical to each other, but they are also similar to each other, which sort of gives us some ideas about the evolution of this, you know, of this molecule."}, {"time": 520, "text": "And perhaps, so one of the hypothesis is that, you know, in the past, it was just a homo tetramer, right?"}, {"time": 528, "text": "So four identical copies, and then it became, you know, sort of modified, it became mutated over the time and became more specialized."}, {"time": 540, "text": "Can we linger on the spike protein for a little bit?"}, {"time": 542, "text": "Is there something interesting or like beautiful you find about it?"}, {"time": 546, "text": "I mean, first of all, it's an incredibly challenging protein."}, {"time": 550, "text": "And so we, as a part of our sort of research to understand the structural basis of this virus, to sort of decode, structurally decode, every single protein in its proteome, which, you know, we've been working on this spike protein."}, {"time": 571, "text": "And one of the main challenges was that the cryoEM data allows us to reconstruct or to obtain the 3D coordinates of roughly two thirds of the protein."}, {"time": 588, "text": "The rest of the one third of this protein, it's a part that is buried into the membrane of the virus and of the viral envelope."}, {"time": 601, "text": "And it also has a lot of unstable structures around it."}, {"time": 606, "text": "So it's chemically interacting somehow with whatever the hex is connecting to."}, {"time": 610, "text": "Yeah, so people are still trying to understand."}, {"time": 612, "text": "So the nature of, and the role of this one third, because the top part, you know, the primary function is to get attached to the ACE2 receptor, human receptor."}, {"time": 628, "text": "There is also beautiful mechanics of how this thing happens, right?"}, {"time": 634, "text": "So because there are three different copies of this chains, you know, there are three different domains, right?"}, {"time": 643, "text": "So we're talking about domains."}, {"time": 644, "text": "So this is the receptor binding domains, RBDs, that gets untangled and get ready to get attached to the receptor."}, {"time": 655, "text": "And now they are not necessarily going in a sync mode."}, {"time": 662, "text": "As a matter of fact."}, {"time": 664, "text": "It's asynchronous."}, {"time": 665, "text": "So yes, and this is where another level of complexity comes into play because right now what we see is, we typically see just one of the arms going out and getting ready to be attached to the ACE2 receptors."}, {"time": 687, "text": "However, there was a recent mutation that people studied in that spike protein."}, {"time": 695, "text": "And very recently, a group from UMass Medical School will happen to collaborate with groups."}, {"time": 705, "text": "So this is a group of Jeremy Lubin and a number of other faculty."}, {"time": 711, "text": "They actually solve the mutated structure of the spike."}, {"time": 719, "text": "And they showed that actually, because of these mutations, you have more than one arms opening up."}, {"time": 728, "text": "And so now, so the frequency of two arms going up increase quite drastically."}, {"time": 738, "text": "Does that change the dynamics somehow?"}, {"time": 740, "text": "It potentially can change the dynamics because now you have two possible opportunities to get attached to the ACE2 receptor."}, {"time": 750, "text": "It's a very complex molecular process, mechanistic process."}, {"time": 754, "text": "But the first step of this process is the attachment of this spike protein, of the spike trimer to the human ACE2 receptor."}, {"time": 766, "text": "So this is a molecule that sits on the surface of the human cell."}, {"time": 771, "text": "And that's essentially what initiates, what triggers the whole process of encapsulation."}, {"time": 778, "text": "If this was dating, this would be the first date."}, {"time": 781, "text": "So this is the..."}, {"time": 783, "text": "In a way."}, {"time": 785, "text": "So is it possible to have the spike protein just like floating about on its own?"}, {"time": 790, "text": "Or does it need that interactability with the membrane?"}, {"time": 794, "text": "Yeah, so it needs to be attached, at least as far as I know."}, {"time": 799, "text": "But when you get this thing attached on the surface, there is also a lot of dynamics on how it sits on the surface."}, {"time": 808, "text": "So for example, there was a recent work in, again, where people use the cryolectron microscopy to get the first glimpse of the overall structure."}, {"time": 818, "text": "It's a very low res, but you still get some interesting details about the surface, about what is happening inside, because we have literally no clue until recent work about how the capsid is organized."}, {"time": 834, "text": "What's a capsid?"}, {"time": 835, "text": "So a capsid is essentially, it's the inner core of the viral particle where there is the RNA of the virus, and it's protected by another protein, N protein, that essentially acts as a shield."}, {"time": 853, "text": "But now we are learning more and more, so it's actually, it's not just this shield, it potentially is used for the stability of the outer shell of the virus."}, {"time": 865, "text": "So it's pretty complicated."}, {"time": 867, "text": "And I mean, understanding all of this is really useful for trying to figure out like developing a vaccine or some kind of drug to attack, any aspects of this, right?"}, {"time": 876, "text": "So, I mean, there are many different implications to that."}, {"time": 879, "text": "First of all, it's important to understand the virus itself, right?"}, {"time": 884, "text": "So in order to understand how it acts, what is the overall mechanistic process of this virus replication, of this virus proliferation to the cell, right?"}, {"time": 900, "text": "So that's one aspect."}, {"time": 903, "text": "The other aspect is designing new treatments."}, {"time": 906, "text": "So one of the possible treatments is designing nanoparticles."}, {"time": 912, "text": "And so some nanoparticles that will resemble the viral shape that would have the spike integrated, and essentially would act as a competitor to the real virus by blocking the ACE2 receptors, and thus preventing the real virus entering the cell."}, {"time": 930, "text": "Now, there are also, you know, there is a very interesting direction in looking at the membrane, at the envelope portion of the protein and attacking its M protein."}, {"time": 944, "text": "So there are, you know, to give you a, you know, sort of a brief overview, there are four structural proteins."}, {"time": 952, "text": "These are the proteins that made up a structure of the virus."}, {"time": 958, "text": "So SPIKE, S protein that acts as a trimer, so it needs three copies."}, {"time": 966, "text": "E, envelope protein that acts as a pantomime, so it needs five copies to act properly."}, {"time": 973, "text": "M is a membrane protein, it forms dimers, and actually it forms beautiful lattice."}, {"time": 980, "text": "And this is something that we've been studying and we are seeing it in simulations."}, {"time": 984, "text": "It actually forms a very nice grid or, you know, threads, you know, of different dimers attached next to each other."}, {"time": 993, "text": "Just a bunch of copies of each other, and they naturally, when you have a bunch of copies of each other, they form an interesting lattice."}, {"time": 999, "text": "And, you know, if you think about this, right?"}, {"time": 1002, "text": "So this complex, you know, the viral shape needs to be organized somehow, self organized somehow, right?"}, {"time": 1012, "text": "So it, you know, if it was a completely random process, you know, you probably wouldn't have the envelope shell of the ellipsoid shape, you know, you would have something, you know, pretty random, right, shape."}, {"time": 1027, "text": "So there is some, you know, regularity in how this, you know, how this M dimers get to attach to each other in a very specific directed way."}, {"time": 1040, "text": "Is that understood at all?"}, {"time": 1043, "text": "It's not understood."}, {"time": 1044, "text": "We are now, we've been working in the past six months since, you know, we met, actually, this is where we started working on trying to understand the overall structure of the envelope and the key components that made up this, you know, structure."}, {"time": 1061, "text": "Wait, does the envelope also have the lattice structure or no?"}, {"time": 1064, "text": "So the envelope is essentially is the outer shell of the viral particle."}, {"time": 1068, "text": "The N, the nucleocapsid protein, is something that is inside."}, {"time": 1074, "text": "But get that, the N is likely to interact with M. Does it go M and E?"}, {"time": 1081, "text": "Like, where's the E and the M?"}, {"time": 1082, "text": "So E, those different proteins, they occur in different copies on the viral particle."}, {"time": 1090, "text": "So E, this pentamer complex, we only have two or three, maybe, per each particle, okay?"}, {"time": 1098, "text": "We have thousand or so of M dimers that essentially made up, that makes up the entire, you know, outer shell."}, {"time": 1110, "text": "So most of the outer shell is the M. M dimer."}, {"time": 1114, "text": "And the M protein."}, {"time": 1115, "text": "When you say particle, that's the virion, the virus, the individual virus."}, {"time": 1120, "text": "It's a single, yes."}, {"time": 1120, "text": "Single element of the virus, it's a single virus."}, {"time": 1123, "text": "Single virus, right."}, {"time": 1125, "text": "And we have about, you know, roughly 50 to 90 spike trimmers."}, {"time": 1131, "text": "So when you, you know, when you show a..."}, {"time": 1134, "text": "Per virus particle."}, {"time": 1136, "text": "Sorry, what did you say, 50 to 90?"}, {"time": 1138, "text": "50 to 90, right?"}, {"time": 1140, "text": "So this is how this thing is organized."}, {"time": 1144, "text": "And so now, typically, right, so you see these, the antibodies that target, you know, spike protein, certain parts of the spike protein, but there could be some, also some treatments, right?"}, {"time": 1157, "text": "So these are, you know, these are small molecules that bind strategic parts of these proteins, disrupting its function."}, {"time": 1169, "text": "So one of the promising directions, it's one of the newest directions, is actually targeting the M dimer of the protein."}, {"time": 1180, "text": "Targeting the proteins that make up this outer shell."}, {"time": 1184, "text": "Because if you're able to destroy the outer shell, you're essentially destroying the viral particle itself."}, {"time": 1192, "text": "So preventing it from, you know, functioning at all."}, {"time": 1196, "text": "So that's, you think is, from a sort of cyber security perspective, virus security perspective, that's the best attack vector?"}, {"time": 1205, "text": "Is, or like, that's a promising attack vector?"}, {"time": 1208, "text": "I would say, yeah."}, {"time": 1209, "text": "So, I mean, there's still tons of research needs to be, you know, to be done."}, {"time": 1214, "text": "But yes, I think, you know, so."}, {"time": 1216, "text": "There's more attack surface, I guess."}, {"time": 1218, "text": "More attack surface."}, {"time": 1219, "text": "But, you know, from our analysis, from other evolutionary analysis, this protein is evolutionarily more stable compared to the, say, to the spike protein."}, {"time": 1231, "text": "Oh, and stable means a more static target?"}, {"time": 1235, "text": "Well, yeah, so it doesn't change."}, {"time": 1238, "text": "It doesn't evolve from the evolutionary perspective so drastically as, for example, the spike protein."}, {"time": 1246, "text": "There's a bunch of stuff in the news about mutations of the virus in the United Kingdom."}, {"time": 1251, "text": "I also saw in South Africa something."}, {"time": 1254, "text": "Maybe that was yesterday."}, {"time": 1256, "text": "You just kind of mentioned about stability and so on."}, {"time": 1260, "text": "Which aspects of this are mutatable and which aspects, if mutated, become more dangerous?"}, {"time": 1267, "text": "And maybe even zooming out, what are your thoughts and knowledge and ideas about the way it's mutated, all the news that we've been hearing?"}, {"time": 1275, "text": "Are you worried about it from a biological perspective?"}, {"time": 1278, "text": "Are you worried about it from a human perspective?"}, {"time": 1281, "text": "So, I mean, you know, mutations are sort of a general way for these viruses to evolve, right?"}, {"time": 1288, "text": "So, it's, you know, it's essentially, this is the way they evolve."}, {"time": 1294, "text": "This is the way they were able to jump from one species to another."}, {"time": 1302, "text": "We also see some recent jumps."}, {"time": 1306, "text": "There were some incidents of this virus jumping from human to dogs."}, {"time": 1311, "text": "So, you know, there is some danger in those jumps because every time it jumps, it also mutates, right?"}, {"time": 1319, "text": "So, when it jumps to the species and jumps back, right?"}, {"time": 1326, "text": "So, it acquires some mutations that are sort of driven by the environment of a new host, right?"}, {"time": 1336, "text": "And it's different from the human environment."}, {"time": 1339, "text": "And so, we don't know whether the mutations that are acquired in the new species are neutral with respect to the human host or maybe, you know, maybe damaging."}, {"time": 1352, "text": "Yeah, change is always scary, but so are you worried about, I mean, it seems like because the spread is, during winter now, seems to be exceptionally high and especially with a vaccine just around the corner already being actually deployed, is there some worry that this puts evolutionary pressure, selective pressure on the virus for it to mutate?"}, {"time": 1379, "text": "Is that a source of worry?"}, {"time": 1380, "text": "Well, I mean, there is always this thought in the scientist's mind, you know, what will happen, right?"}, {"time": 1388, "text": "So, I know there've been discussions about sort of the arms race between the ability of the humanity to get vaccinated faster than the virus, you know, essentially, you know, it becomes, you know, resistant to the vaccine."}, {"time": 1414, "text": "I mean, I don't worry that much simply because, you know, there is not that much evidence to that."}, {"time": 1424, "text": "To aggressive mutation around the vaccine."}, {"time": 1427, "text": "Exactly, you know, obviously there are mutations around the vaccine, so the reason we get vaccinated every year against the seasonal mutations, right?"}, {"time": 1441, "text": "But, you know, I think it's important to study it."}, {"time": 1446, "text": "No doubts, right?"}, {"time": 1484, "text": "And hopefully that knowledge will enable us to sort of forecast the evolutionary traces, the future evolutionary traces of this virus."}, {"time": 1495, "text": "I mean, what, from a biological perspective, this might be a dumb question, but is there parts of the virus that if souped up, like through mutation, could make it more effective at doing its job?"}, {"time": 1509, "text": "We're talking about this specific coronavirus because we were talking about the different, like, the membrane, the M protein, the E protein, the N and the S, the spike, is there some?"}, {"time": 1524, "text": "And there are 20 or so more in addition to that."}, {"time": 1527, "text": "But is that a dumb way to look at it?"}, {"time": 1529, "text": "Like, which of these, if mutated, could have the greatest impact, potentially damaging impact, on the effectiveness of the virus?"}, {"time": 1541, "text": "So it's actually, it's a very good question because, and the short answer is, we don't know yet."}, {"time": 1548, "text": "But of course there is capacity of this virus to become more efficient."}, {"time": 1553, "text": "The reason for that is, you know, so if you look at the virus, I mean, it's a machine, right?"}, {"time": 1559, "text": "So it's a machine that does a lot of different functions, and many of these functions are sort of nearly perfect, but they're not perfect."}, {"time": 1567, "text": "And those mutations can have the greatest impact and make those functions more perfect."}, {"time": 1574, "text": "For example, the attachment to ACE2 receptor, right, of the spike, right?"}, {"time": 1579, "text": "So, you know, has this virus reached the efficiency in which the attachment is carried out?"}, {"time": 1591, "text": "Or there are some mutations that still to be discovered, right, that will make this attachment sort of stronger, or, you know, something more, in a way more efficient from the point of view of this virus functioning."}, {"time": 1611, "text": "That's sort of the obvious example."}, {"time": 1614, "text": "But if you look at each of these proteins, I mean, it's there for a reason, it performs certain function."}, {"time": 1620, "text": "And it could be that certain mutations will, you know, enhance this function."}, {"time": 1628, "text": "It could be that some mutations will make this function much less efficient, right?"}, {"time": 1633, "text": "So that's also the case."}, {"time": 1636, "text": "Let's, since we're talking about the evolutionary history of a virus, let's zoom back out and look at the evolution of proteins."}, {"time": 1645, "text": "I glanced at this 2010 Nature paper on the quote, ongoing expansion of the protein universe."}, {"time": 1654, "text": "And then, you know, it kind of implies and talks about that proteins started with a common ancestor, which is, you know, kind of interesting."}, {"time": 1664, "text": "It's interesting to think about like, even just like the first organic thing that started life on Earth."}, {"time": 1671, "text": "And from that, there's now, you know, what is it?"}, {"time": 1676, "text": "3.5 billion years later, there's now millions of proteins."}, {"time": 1679, "text": "And they're still evolving."}, {"time": 1681, "text": "And that's, you know, in part, one of the things that you're researching."}, {"time": 1685, "text": "Is there something interesting to you about the evolution of proteins from this initial ancestor to today?"}, {"time": 1694, "text": "Is there something beautiful and insightful about this long story?"}, {"time": 1698, "text": "So I think, you know, if I were to pick a single keyword about protein evolution, I would pick modularity, something that we talked about in the beginning."}, {"time": 1712, "text": "And that's the fact that the proteins are no longer considered as, you know, as a sequence of letters."}, {"time": 1721, "text": "There are hierarchical complexities in the way these proteins are organized."}, {"time": 1728, "text": "And these complexities are actually going beyond the protein sequence."}, {"time": 1733, "text": "It's actually going all the way back to the gene, to the nucleotide sequence."}, {"time": 1740, "text": "And so, you know, again, these protein domains, they are not only functional building blocks, they are also evolutionary building blocks."}, {"time": 1749, "text": "And so what we see in the sort of, in the later stages of evolution, I mean, once this stable structurally and functionally building blocks were discovered, they essentially, they stay, those domains stay as such."}, {"time": 1768, "text": "So that's why if you start comparing different proteins, you will see that many of them will have similar fragments."}, {"time": 1777, "text": "And those fragments will correspond to something that we call protein domain families."}, {"time": 1782, "text": "And so they are still different because you still have mutations and, you know, the, you know, different mutations are attributed to, to, you know, diversification of the function of this, you know, protein domains."}, {"time": 1798, "text": "However, you don't, you very rarely see, you know, the evolutionary events that would split this domain into fragments because, and it's, you know, once you have the domain split, you actually, you, you know, you can completely cancel out its function or at the very least you can reduce it."}, {"time": 1826, "text": "And that's not, you know, efficient from the point of view of the, you know, of the cell functioning."}, {"time": 1832, "text": "So, so the, the, the protein domain level is a very important one."}, {"time": 1839, "text": "Now, on top of that, right?"}, {"time": 1842, "text": "So if you look at the proteins, right, so you have this structural units and they carry out the function, but then much less is known about things that connect this protein domains, something that we call linkers."}, {"time": 1856, "text": "And those linkers are completely flexible, you know, parts of the protein that nevertheless carry out a lot of function."}, {"time": 1866, "text": "So it's like little tails, little heads."}, {"time": 1868, "text": "So, so, so we do have tails."}, {"time": 1869, "text": "So they're called termini, C and N termini."}, {"time": 1872, "text": "So these are things right on the, on, on, on one and another ends of the protein sequence."}, {"time": 1880, "text": "So they are also very important."}, {"time": 1882, "text": "So they, they attributed to very specific interactions between the proteins."}, {"time": 1888, "text": "But you're referring to the links between domains."}, {"time": 1890, "text": "That connect the domains."}, {"time": 1892, "text": "And, you know, apart from the, just the, the simple perspective, if you have, you know, a very short domain, you have, sorry, a very short linker, you have two domains next to each other."}, {"time": 1905, "text": "They are forced to be next to each other."}, {"time": 1907, "text": "If you have a very long one, you have the domains that are extremely flexible and they carry out a lot of sort of spatial reorganization, right?"}, {"time": 1918, "text": "But on top of that, right, just this linker itself, because it's so flexible, it actually can adapt to a lot of different shapes."}, {"time": 1927, "text": "And therefore it's a, it's a very good interactor when it comes to interaction between this protein and other protein, right?"}, {"time": 1935, "text": "So these things also evolve, you know, and they in a way have different sort of laws of the driving laws that underlie the evolution because they no longer need to, to preserve certain structure, right?"}, {"time": 1957, "text": "Unlike protein domains."}, {"time": 1958, "text": "And so on top of that, you have something that is even less studied."}, {"time": 1965, "text": "And this is something that attribute to, to the concept of alternative splicing."}, {"time": 1973, "text": "So alternative splicing."}, {"time": 1974, "text": "So it's a, it's a very cool concept."}, {"time": 1976, "text": "It's something that we've been fascinated about for, you know, over a decade in my lab and trying to do research with that."}, {"time": 1985, "text": "But so, you know, so typically, you know, a simplistic perspective is that one gene is equal one protein product, right?"}, {"time": 1996, "text": "So you have a gene, you know, you transcribe it and translate it and it becomes a protein."}, {"time": 2004, "text": "In reality, when we talk about eukaryotes, especially sort of more recent eukaryotes that are very complex, the gene is no longer equal to one protein."}, {"time": 2020, "text": "It actually can produce multiple functionally, you know, active protein products."}, {"time": 2030, "text": "And each of them is, you know, is called an alternatively spliced product."}, {"time": 2037, "text": "The reason it happens is that if you look at the gene, it actually has, it has also blocks."}, {"time": 2045, "text": "And the blocks, some of which, and it's essentially, it goes like this."}, {"time": 2050, "text": "So we have a block that will later be translated."}, {"time": 2053, "text": "We call it exon."}, {"time": 2055, "text": "Then we'll have a block that is not translated, cut out."}, {"time": 2059, "text": "We call it intron."}, {"time": 2060, "text": "So we have exon, intron, exon, intron, et cetera, et cetera, et cetera, right?"}, {"time": 2064, "text": "So sometimes you can have, you know, dozens of these exons and introns."}, {"time": 2069, "text": "So what happens is during the process when the gene is converted to RNA, we have things that are cut out, the introns that are cut out, and exons that now get assembled together."}, {"time": 2087, "text": "And sometimes we will throw out some of the exons and the remaining protein product will become still be the same."}, {"time": 2096, "text": "Oh, different."}, {"time": 2097, "text": "So now you have fragments of the protein that no longer there."}, {"time": 2101, "text": "They were cut out with the introns."}, {"time": 2103, "text": "Sometimes you will essentially take one exon and replace it with another one, right?"}, {"time": 2109, "text": "So there's some flexibility in this process."}, {"time": 2112, "text": "So that creates a whole new level of complexity."}, {"time": 2117, "text": "Cause now."}, {"time": 2118, "text": "Is this random though?"}, {"time": 2118, "text": "Is it random?"}, {"time": 2119, "text": "It's not random."}, {"time": 2120, "text": "We, and this is where I think now the appearance of this modern single cell and before that tissue level sequencing, next generation sequencing techniques such as RNA seed allows us to see that these are the events that often happen in response."}, {"time": 2141, "text": "It's a dynamic event that happens in response to disease or in response to certain developmental stage of a cell."}, {"time": 2151, "text": "And this is an incredibly complex layer that also undergoes, I mean, because it's at the gene level, right?"}, {"time": 2161, "text": "So it undergoes certain evolution, right?"}, {"time": 2165, "text": "And now we have this interplay between what is happening in the protein world and what is happening in the gene and RNA world."}, {"time": 2177, "text": "And for example, it's often that we see that the boundaries of this exons coincide with the boundaries of the protein domains, right?"}, {"time": 2192, "text": "So there is this close interplay to that."}, {"time": 2196, "text": "It's not always, I mean, otherwise it would be too simple, right?"}, {"time": 2200, "text": "But we do see the connection between those sort of machineries."}, {"time": 2205, "text": "And obviously the evolution will pick up this complexity and, you know."}, {"time": 2211, "text": "Select for whatever is successful, whatever is interesting function."}, {"time": 2215, "text": "We see that complexity in play and makes this question more complex, but more exciting."}, {"time": 2222, "text": "Small detour, I don't know if you think about this into the world of computer science."}, {"time": 2227, "text": "There's a Douglas Hostetter, I think, came up with the name of Quine, which are, I don't know if you're familiar with these things, but it's computer programs that have, I guess, exon and intron, and they copy, the whole purpose of the program is to copy itself."}, {"time": 2246, "text": "So it prints copies of itself, but can also carry information inside of it."}, {"time": 2250, "text": "So it's a very kind of crude, fun exercise of, can we sort of replicate these ideas from cells?"}, {"time": 2260, "text": "Can we have a computer program that when you run it, just print itself, the entirety of itself, and does it in different programming languages and so on."}, {"time": 2270, "text": "I've been playing around and writing them."}, {"time": 2271, "text": "It's a kind of fun little exercise."}, {"time": 2273, "text": "You know, when I was a kid, so you know, it was essentially one of the sort of main stages in informatics Olympiads that you have to reach in order to be any so good, is you should be able to write a program that replicates itself."}, {"time": 2296, "text": "And so the task then becomes even sort of more complicated."}, {"time": 2300, "text": "So what is the shortest program?"}, {"time": 2304, "text": "And of course, it's a function of a programming language, but yeah, I remember a long, long, long time ago when we tried to make it short and short and find the shortcut."}, {"time": 2316, "text": "There's actually on a stack exchange, there's a entire site called CodeGolf, I think, where the entirety is just the competition."}, {"time": 2326, "text": "People just come up with whatever task, I don't know, like write code that reports the weather today."}, {"time": 2334, "text": "And the competition is about whatever programming language, what is the shortest program?"}, {"time": 2340, "text": "And it makes you actually, people should check it out because it makes you realize there's some weird programming languages out there."}, {"time": 2347, "text": "But just to dig on that a little deeper, do you think, in computer science, we don't often think about programs, just like the machine learning world now, that's still kind of basic programs."}, {"time": 2366, "text": "And then there's humans that replicate themselves, right?"}, {"time": 2369, "text": "And there's these mutations and so on."}, {"time": 2371, "text": "Do you think we'll ever have a world where there's programs that kind of have an evolutionary process?"}, {"time": 2380, "text": "So I'm not talking about evolutionary algorithms, but I'm talking about programs that kind of mate with each other and evolve and like on their own replicate themselves."}, {"time": 2389, "text": "So this is kind of the idea here is, that's how you can have a runaway thing."}, {"time": 2397, "text": "So we think about machine learning as a system that gets smarter and smarter and smarter and smarter."}, {"time": 2401, "text": "At least the machine learning systems of today are like, it's a program that you can like turn off, as opposed to throwing a bunch of little programs out there and letting them like multiply and mate and evolve and replicate."}, {"time": 2417, "text": "Do you ever think about that kind of world, when we jump from the biological systems that you're looking at to artificial ones?"}, {"time": 2427, "text": "I mean, it's almost like you take the sort of the area of intelligent agents, right?"}, {"time": 2434, "text": "Which are essentially the independent sort of codes that run and interact and exchange the information, right?"}, {"time": 2442, "text": "So I don't see why not."}, {"time": 2445, "text": "I mean, it could be sort of a natural evolution in this area of computer science."}, {"time": 2452, "text": "I think it's kind of an interesting possibility."}, {"time": 2454, "text": "It's terrifying too, but I think it's a really powerful tool."}, {"time": 2458, "text": "Like to have like agents that, you know, we have social networks with millions of people and they interact."}, {"time": 2463, "text": "I think it's interesting to inject into that, was already injected into that bots, right?"}, {"time": 2468, "text": "But those bots are pretty dumb."}, {"time": 2471, "text": "You know, they're probably pretty dumb algorithms."}, {"time": 2475, "text": "You know, it's interesting to think that there might be bots that evolve together with humans."}, {"time": 2480, "text": "And there's the sea of humans and robots that are operating first in the digital space."}, {"time": 2486, "text": "And then you can also think, I love the idea."}, {"time": 2489, "text": "Some people worked, I think at Harvard, at Penn, there's robotics labs that, you know, take as a fundamental task to build a robot that given extra resources can build another copy of itself, like in the physical space, which is super difficult to do, but super interesting."}, {"time": 2510, "text": "I remember there's like research on robots that can build a bridge."}, {"time": 2515, "text": "So they make a copy of themselves and they connect themselves and the sort of like self building bridge based on building blocks."}, {"time": 2522, "text": "You can imagine like a building that self assembles."}, {"time": 2525, "text": "So it's basically self assembling structures from robotic parts."}, {"time": 2530, "text": "But it's interesting to, within that robot, add the ability to mutate and do all the interesting like little things that you're referring to in evolution to go from a single origin protein building block to like this weird complex."}, {"time": 2548, "text": "And if you think about this, I mean, you know, the bits and pieces are there, you know."}, {"time": 2554, "text": "So you mentioned the evolution algorithm, right?"}, {"time": 2557, "text": "You know, so this is sort of, and maybe sort of the goal is in a way different, right?"}, {"time": 2563, "text": "So the goal is to, you know, to essentially, to optimize your search, right?"}, {"time": 2570, "text": "So, but sort of the ideas are there."}, {"time": 2573, "text": "So people recognize that, you know, that the recombination events lead to global changes in the search trajectories, the mutations event is a more refined, you know, step in the search."}, {"time": 2589, "text": "Then you have, you know, other sort of nature inspired algorithm, right?"}, {"time": 2596, "text": "So one of the reasons that, you know, I think it's one of the funnest one is the slime based algorithm, right?"}, {"time": 2604, "text": "So it's, I think the first was introduced by the Japanese group, where it was able to solve some pre complex problems."}, {"time": 2615, "text": "So that's, and then I think there are still a lot of things we've yet to, you know, borrow from the nature, right?"}, {"time": 2628, "text": "So there are a lot of sort of ideas that nature, you know, gets to offer us that, you know, it's up to us to grab it and to, you know, get the best use of it."}, {"time": 2642, "text": "Including neural networks, you know, we have a very crude inspiration from nature on neural networks."}, {"time": 2648, "text": "Maybe there's other inspirations to be discovered in the brain or other aspects of the various systems, even like the immune system, the way it interplays."}, {"time": 2660, "text": "I recently started to understand that the, like the immune system has something to do with the way the brain operates."}, {"time": 2666, "text": "Like there's multiple things going on in there, which all of which are not modeled in artificial neural networks."}, {"time": 2672, "text": "And maybe if you throw a little bit of that biological spice in there, you'll come up with something, something cool."}, {"time": 2679, "text": "I'm not sure if you're familiar with the Drake equation that estimate, I just did a video on it yesterday because I wanted to give my own estimate of it."}, {"time": 2689, "text": "It's an equation that combines a bunch of factors to estimate how many alien civilizations are in the galaxy."}, {"time": 2696, "text": "I've heard about it, yes."}, {"time": 2698, "text": "So one of the interesting parameters, you know, it's like how many stars are born every year, how many planets are on average per star for this, how many habitable planets are there."}, {"time": 2714, "text": "And then the one that starts being really interesting is the probability that life emerges on a habitable planet."}, {"time": 2724, "text": "So like, I don't know if you think about, you certainly think a lot about evolution, but do you think about the thing which evolution doesn't describe, which is like the beginning of evolution, the origin of life."}, {"time": 2736, "text": "I think I put the probability of life developing in a habitable planet at 1%."}, {"time": 2741, "text": "This is very scientifically rigorous."}, {"time": 2744, "text": "Okay, well, first at a high level for the Drake equation, what would you put that percent at on earth?"}, {"time": 2751, "text": "And in general, do you have something, do you have thoughts about how life might've started, you know, like the proteins being the first kind of, one of the early jumping points?"}, {"time": 2762, "text": "Yeah, so I think back in 2018, there was a very exciting paper published in Nature where they found one of the simplest amino acids, glycine, in a comet dust."}, {"time": 2783, "text": "So this is, and I apologize if I don't pronounce, it's a Russian named comet, it's I think Chugryumov Gerasimenko."}, {"time": 2794, "text": "This is the comet where, and there was this mission to get close to this comet and get the stardust from its tail."}, {"time": 2808, "text": "And when scientists analyzed it, they actually found traces of, you know, of glycine, which, you know, makes up, you know, it's one of the basic, one of the 20 basic amino acids that makes up proteins, right?"}, {"time": 2826, "text": "So that was kind of very exciting, right?"}, {"time": 2830, "text": "But, you know, the question is very interesting, right?"}, {"time": 2834, "text": "So what, you know, if there is some alien life, is it gonna be made of proteins, right?"}, {"time": 2842, "text": "Or maybe RNAs, right?"}, {"time": 2844, "text": "So we see that, you know, the RNA viruses are certainly, you know, very well established sort of, you know, group of molecular machines, right?"}, {"time": 2857, "text": "So, yeah, it's a very interesting question."}, {"time": 2862, "text": "What probability would you put?"}, {"time": 2863, "text": "Like, how hard is this job?"}, {"time": 2865, "text": "Like, how unlikely just on Earth do you think this whole thing is that we got going?"}, {"time": 2871, "text": "Like, are we really lucky or is it inevitable?"}, {"time": 2874, "text": "Like, what's your sense when you sit back and think about life on Earth?"}, {"time": 2878, "text": "Is it higher or lower than 1%?"}, {"time": 2880, "text": "Well, because 1% is pretty low, but it still is like, damn, that's a pretty good chance."}, {"time": 2885, "text": "Yes, it's a pretty good chance."}, {"time": 2886, "text": "I mean, I would, personally, but again, you know, I'm, you know, probably not the best person to do such estimations, but I would, you know, intuitively, I would probably put it lower."}, {"time": 2903, "text": "But still, I mean, you know, given."}, {"time": 2904, "text": "So we're really lucky here on Earth."}, {"time": 2908, "text": "Or the conditions are really good."}, {"time": 2910, "text": "It's, you know, I think that there was, everything was right in a way, right?"}, {"time": 2915, "text": "So we still, it's not, the conditions were not like ideal if you try to look at, you know, what was, you know, several billions years ago when the life emerged."}, {"time": 2928, "text": "So there is something called the Rare Earth Hypothesis that, you know, in counter to the Drake Equation says that the, you know, the conditions of Earth, if you actually were to describe Earth, it's quite a special place."}, {"time": 2945, "text": "So special it might be unique in our galaxy and potentially, you know, close to unique in the entire universe."}, {"time": 2952, "text": "Like it's very difficult to reconstruct those same conditions."}, {"time": 2956, "text": "And what the Rare Earth Hypothesis argues is all those different conditions are essential for life."}, {"time": 2963, "text": "And so that's sort of the counter, you know, like all the things we, you know, thinking that Earth is pretty average."}, {"time": 2971, "text": "I mean, I can't really, I'm trying to remember to go through all of them, but just the fact that it is shielded from a lot of asteroids, the, obviously the distance to the sun, but also the fact that it's like a perfect balance between the amount of water and land and all those kinds of things."}, {"time": 2993, "text": "I don't know, there's a bunch of different factors that I don't remember, there's a long list."}, {"time": 2997, "text": "But it's fascinating to think about if in order for something like proteins and then DNA and RNA to emerge, you need, and basic living organisms, you need to be very close to an Earth like planet, which will be sad or exciting, I don't know which."}, {"time": 3019, "text": "If you ask me, I, you know, in a way I put a parallel between, you know, between our own research."}, {"time": 3028, "text": "And I mean, from the intuitive perspective, you know, you have those two extremes and the reality is never very rarely falls into the extremes."}, {"time": 3041, "text": "It's always the optimus always reached somewhere in between."}, {"time": 3046, "text": "So, and that's what I tend to think."}, {"time": 3050, "text": "I think that, you know, we're probably somewhere in between."}, {"time": 3054, "text": "So they were not unique, unique, but again, the chances are, you know, reasonably small."}, {"time": 3061, "text": "The problem is we don't know the other extreme is like, I tend to think that we don't actually understand the basic mechanisms of like what this is all originated from, like, it seems like we think of life as this distinct thing, maybe intelligence is a distinct thing, maybe the physics that, from which planets and suns are born is a distinct thing."}, {"time": 3084, "text": "But that could be a very, it's like the Stephen Wolfram thing, it's like the, from simple rules emerges greater and greater complexity."}, {"time": 3091, "text": "So, you know, I tend to believe that just life finds a way."}, {"time": 3096, "text": "Like, we don't know the extreme of how common life is because it could be life is like everywhere."}, {"time": 3104, "text": "Like, so everywhere that it's almost like laughable, like that we're such idiots to think who are you?"}, {"time": 3112, "text": "Like, it's like ridiculous to even like think, it's like ants thinking that their little colony is the unique thing and everything else doesn't exist."}, {"time": 3123, "text": "I mean, it's also very possible that that's the extreme and we're just not able to maybe comprehend the nature of that life."}, {"time": 3132, "text": "Just to stick on alien life for just a brief moment more, there is some signs of life on Venus in gaseous form."}, {"time": 3142, "text": "There's hope for life on Mars, probably extinct."}, {"time": 3147, "text": "We're not talking about intelligent life."}, {"time": 3149, "text": "Although that has been in the news recently."}, {"time": 3152, "text": "We're talking about basic like, you know, bacteria."}, {"time": 3156, "text": "Yeah, and then also, I guess, there's a couple moons."}, {"time": 3160, "text": "Europe."}, {"time": 3161, "text": "Yeah, Europa, which is Jupiter's moon."}, {"time": 3165, "text": "I think there's another one."}, {"time": 3166, "text": "Are you, is that exciting or is it terrifying to you that we might find life?"}, {"time": 3172, "text": "Do you hope we find life?"}, {"time": 3173, "text": "I certainly do hope that we find life."}, {"time": 3176, "text": "I mean, it was very exciting to hear about this news about the possible life on Venus."}, {"time": 3189, "text": "It'd be nice to have hard evidence of something with, which is what the hope is for Mars and Europa."}, {"time": 3197, "text": "But do you think those organisms will be similar biologically or would they even be sort of carbon based if we do find them?"}, {"time": 3205, "text": "I would say they would be carbon based."}, {"time": 3208, "text": "How similar, it's a big question, right?"}, {"time": 3211, "text": "So it's the moment we discover things outside Earth, right?"}, {"time": 3219, "text": "Even if it's a tiny little single cell."}, {"time": 3223, "text": "I mean, there is so much."}, {"time": 3225, "text": "Just imagine that, that would be so."}, {"time": 3227, "text": "I think that that would be another turning point for the science, you know?"}, {"time": 3232, "text": "Especially if it's different in some very new way."}, {"time": 3237, "text": "Because that says, that's a definitive statement, not a definitive, but a pretty strong statement that life is everywhere in the universe."}, {"time": 3245, "text": "To me at least, that's really exciting."}, {"time": 3248, "text": "You brought up Joshua Lederberg in an offline conversation."}, {"time": 3253, "text": "I think I'd love to talk to you about Alpha Fold and this might be an interesting way to enter that conversation because, so he won the 1958 Nobel Prize in Physiology and Medicine for discovering that bacteria can mate and exchange genes."}, {"time": 3269, "text": "But he also did a ton of other stuff, like we mentioned, helping NASA find life on Mars and the... Dendro."}, {"time": 3280, "text": "Dendro."}, {"time": 3282, "text": "The chemical expert system."}, {"time": 3285, "text": "Expert systems, remember those?"}, {"time": 3286, "text": "What do you find interesting about this guy and his ideas about artificial intelligence in general?"}, {"time": 3294, "text": "So I have a kind of personal story to share."}, {"time": 3300, "text": "So I started my PhD in Canada back in 2000."}, {"time": 3305, "text": "And so essentially my PhD was, so we were developing sort of a new language for symbolic machine learning."}, {"time": 3312, "text": "So it's different from the feature based machine learning."}, {"time": 3315, "text": "And one of the sort of cleanest applications of this approach, of this formalism was to cheminformatics and computer aided drug design."}, {"time": 3328, "text": "So essentially we were, as a part of my research, I developed a system that essentially looked at chemical compounds of say the same therapeutic category, you know, male hormones, right?"}, {"time": 3345, "text": "And try to figure out the structural fragments that are the structural building blocks that are important that define this class versus structural building blocks that are there just because, you know, to complete the structure."}, {"time": 3364, "text": "But they are not essentially the ones that make up the chemical, the key chemical properties of this therapeutic category."}, {"time": 3372, "text": "And, you know, for me, it was something new."}, {"time": 3376, "text": "I was trained as an applied mathematicians, you know, as with some machine learning background, but, you know, computer aided drug design was a completely new territory."}, {"time": 3387, "text": "So because of that, I often find myself asking lots of questions on one of these sort of central forums."}, {"time": 3396, "text": "Back then, there were no Facebooks or stuff like that."}, {"time": 3400, "text": "There was a forum, you know, it's a forum."}, {"time": 3403, "text": "It's essentially, it's like a bulletin board."}, {"time": 3406, "text": "On the internet."}, {"time": 3407, "text": "Yeah, so you essentially, you have a bunch of people and you post a question and you get, you know, an answer from, you know, different people."}, {"time": 3415, "text": "And back then, just like one of the most popular forums was CCL, I think Computational Chemistry Library, not library, but something like that, but CCL, that was the forum."}, {"time": 3429, "text": "And there, I, you know, I..."}, {"time": 3432, "text": "Asked a lot of dumb questions."}, {"time": 3434, "text": "Yes, I asked questions."}, {"time": 3435, "text": "Also shared some, you know, some information about how formal it is and how we do and whether whatever we do makes sense."}, {"time": 3445, "text": "And so, you know, and I remember that one of these posts, I mean, I still remember, you know, I would call it desperately looking for a chemist advice, something like that, right?"}, {"time": 3460, "text": "And so I post my question, I explained, you know, how formalism is, what it does and what kind of applications I'm planning to do."}, {"time": 3473, "text": "And, you know, and it was, you know, in the middle of the night and I went back to bed."}, {"time": 3479, "text": "And next morning, have a phone call from my advisor who also looked at this forum."}, {"time": 3486, "text": "It's like, you won't believe who replied to you."}, {"time": 3491, "text": "And it's like, who?"}, {"time": 3493, "text": "And he said, well, you know, there is a message to you from Joshua Lederberg."}, {"time": 3499, "text": "And my reaction was like, who is Joshua Lederberg?"}, {"time": 3502, "text": "Your advisor hung up."}, {"time": 3502, "text": "So, and essentially, you know, Joshua wrote me that we had conceptually similar ideas in the dendrial project."}, {"time": 3516, "text": "You may wanna look it up."}, {"time": 3519, "text": "And we should also, sorry, and it's a side comment, say that even though he won the Nobel Prize at a really young age, in 58, but so he was, I think he was what, 33."}, {"time": 3532, "text": "It's just crazy."}, {"time": 3533, "text": "So anyway, so that's, so hence in the 90s, responding to young whippersnappers on the CCL forum."}, {"time": 3542, "text": "And so back then he was already very senior."}, {"time": 3545, "text": "I mean, he unfortunately passed away back in 2008, but, you know, back in 2001, he was, I mean, he was a professor emeritus at Rockefeller University."}, {"time": 3555, "text": "And, you know, that was actually, believe it or not, one of the reasons I decided to join, you know, as a postdoc, the group of Andre Salle, who was at Rockefeller University, with the hope that, you know, that I could actually, you know, have a chance to meet Joshua in person."}, {"time": 3578, "text": "And I met him very briefly, right?"}, {"time": 3582, "text": "Just because he was walking, you know, there's a little bridge that connects the, sort of the research campus with the, with the sort of skyscraper that Rockefeller owns, the where, you know, postdocs and faculty and graduate students live."}, {"time": 3600, "text": "And so I met him, you know, and had a very short conversation, you know."}, {"time": 3606, "text": "But so I started, you know, reading about Dendral and I was amazed, you know, it's, we're talking about 1960, right?"}, {"time": 3616, "text": "The ideas were so profound."}, {"time": 3619, "text": "Well, what's the fun about the ideas of it?"}, {"time": 3621, "text": "The reason to make this is even crazier."}, {"time": 3625, "text": "So, Lederberg wanted to make a system that would help him study the extraterrestrial molecules, right?"}, {"time": 3639, "text": "So, the idea was that, you know, the way you study the extraterrestrial molecules is you do the mass spec analysis, right?"}, {"time": 3646, "text": "And so the mass spec gives you sort of bits, numbers about essentially gives you the ideas about the possible fragments or, you know, atoms, you know, and maybe a little fragments, pieces of this molecule that make up the molecule, right?"}, {"time": 3663, "text": "So now you need to sort of, to decompose this information and to figure out what was the hole before it became fragments, bits and pieces, right?"}, {"time": 3732, "text": "But the original idea, I suppose, is to solve the entirety of this problem automatically."}, {"time": 3737, "text": "So he, you know, so he, back then he approached."}, {"time": 3741, "text": "60s."}, {"time": 3745, "text": "Yes, believe that, it's amazing."}, {"time": 3748, "text": "I mean, it still blows my mind, you know, that it's, that's, and this was essentially the origin of the modern bioinformatics, cheminformatics, you know, back in 60s."}, {"time": 3762, "text": "So that's, you know, every time you deal with projects like this, with the, you know, research like this, you just, you know, so the power of the, you know, intelligence of this people is just, you know, overwhelming."}, {"time": 3781, "text": "Do you think about expert systems, is there, and why they kind of didn't become successful, especially in the space of bioinformatics, where it does seem like there is a lot of expertise in humans, and, you know, it's possible to see that a system like this could be made very useful."}, {"time": 3804, "text": "And be built up."}, {"time": 3805, "text": "So it's actually, it's a great question, and this is something, so, you know, so, you know, at my university, I teach artificial intelligence, and, you know, we start, my first two lectures are on the history of AI."}, {"time": 3820, "text": "And there we, you know, we try to, you know, go through the main stages of AI."}, {"time": 3828, "text": "And so, you know, the question of why expert systems failed or became obsolete, it's actually a very interesting one."}, {"time": 3838, "text": "And there are, you know, if you try to read the, you know, the historical perspectives, there are actually two lines of thoughts."}, {"time": 3845, "text": "One is that they were essentially not up to the expectations."}, {"time": 3854, "text": "And so therefore they were replaced, you know, by other things, right?"}, {"time": 3861, "text": "The other one was that completely opposite one, that they were too good."}, {"time": 3868, "text": "And as a result, they essentially became sort of a household name, and then essentially they got transformed."}, {"time": 3877, "text": "I mean, in both cases, sort of the outcome was the same."}, {"time": 3880, "text": "They evolved into something, right?"}, {"time": 3883, "text": "And that's what I, you know, if I look at this, right?"}, {"time": 3887, "text": "So the modern machine learning, right?"}, {"time": 3891, "text": "So there's echoes in the modern machine learning."}, {"time": 3893, "text": "I think so, I think so, because, you know, if you think about this, you know, and how we design, you know, the most successful algorithms, including AlphaFold, right?"}, {"time": 3904, "text": "You built in the knowledge about the domain that you study, right?"}, {"time": 3909, "text": "So you built in your expertise."}, {"time": 3912, "text": "So speaking of AlphaFold, so DeepMind's AlphaFold 2 recently was announced to have, quote unquote, solved protein folding."}, {"time": 3921, "text": "But how exciting is this to you?"}, {"time": 3924, "text": "It seems to be one of the, one of the exciting things that have happened in 2020."}, {"time": 3929, "text": "It's an incredible accomplishment from the looks of it."}, {"time": 3932, "text": "What part of it is amazing to you?"}, {"time": 3933, "text": "What part would you say is over hype or maybe misunderstood?"}, {"time": 3939, "text": "It's definitely a very exciting achievement."}, {"time": 3941, "text": "To give you a little bit of perspective, right?"}, {"time": 3943, "text": "So in bioinformatics, we have several competitions."}, {"time": 3950, "text": "And so the way, you know, you often hear how those competitions have been explained to sort of to non bioinformaticians is that, you know, they call it bioinformatics Olympic games."}, {"time": 3961, "text": "And there are several disciplines, right?"}, {"time": 3963, "text": "So the historically one of the first one was the discipline in predicting the protein structure, predicting the 3D coordinates of the protein."}, {"time": 3972, "text": "But there are some others."}, {"time": 3973, "text": "So the predicting protein functions, predicting effects of mutations on protein functions, then predicting protein, protein interactions."}, {"time": 3984, "text": "So the original one was CASP or a critical assessment of a protein structure."}, {"time": 3992, "text": "And the, you know, typically what happens during this competitions is, you know, scientists, experimental scientists solve the structures, but don't put them into the protein data bank, which is the centralized database that contains all the 3D coordinates."}, {"time": 4017, "text": "Instead, they hold it and release protein sequences."}, {"time": 4022, "text": "And now the challenge of the community is to predict the 3D structures of this proteins and then use the experimental results structures to assess which one is the closest one, right?"}, {"time": 4036, "text": "And this competition, by the way, just a bunch of different tangents."}, {"time": 4039, "text": "And maybe you can also say, what is protein folding?"}, {"time": 4042, "text": "Then this competition, CASP competition has become the gold standard."}, {"time": 4047, "text": "And that's what was used to say that protein folding was solved."}, {"time": 4052, "text": "So just to add a little, just a bunch."}, {"time": 4055, "text": "So if you could, whenever you say stuff, maybe throw in some of the basics for the folks that might be outside of the field."}, {"time": 4062, "text": "So, yeah, so, you know, so the reason it's, you know, it's relevant to our understanding of protein folding is because, you know, we've yet to learn how the folding mechanistically works, right?"}, {"time": 4078, "text": "So there are different hypothesis, what happens to this fold?"}, {"time": 4082, "text": "For example, there is a hypothesis that the folding happens by, you know, also in the modular fashion, right?"}, {"time": 4092, "text": "So that, you know, we have protein domains that get folded independently because their structure is stable."}, {"time": 4099, "text": "And then the whole protein structure gets formed."}, {"time": 4103, "text": "But, you know, within those domains, we also have a so called secondary structure, the small alpha helices, beta schists."}, {"time": 4109, "text": "So these are, you know, elements that are structurally stable."}, {"time": 4114, "text": "And so, and the question is, you know, when do they get formed?"}, {"time": 4120, "text": "Because some of the secondary structure elements, you have to have, you know, a fragment in the beginning and say the fragment in the middle, right?"}, {"time": 4129, "text": "So you cannot potentially start having the full fold from the get go, right?"}, {"time": 4137, "text": "So it's still, you know, it's still a big enigma, what happens."}, {"time": 4141, "text": "We know that it's an extremely efficient and stable process, right?"}, {"time": 4145, "text": "So there's this long sequence and the fold happens really quickly."}, {"time": 4150, "text": "So that's really weird, right?"}, {"time": 4151, "text": "And it happens like the same way almost every time."}, {"time": 4156, "text": "That's really weird."}, {"time": 4157, "text": "That's freaking weird."}, {"time": 4159, "text": "It's, yeah, that's why it's such an amazing thing."}, {"time": 4162, "text": "But most importantly, right?"}, {"time": 4164, "text": "So it's, you know, so when you see the, you know, the translation process, right?"}, {"time": 4169, "text": "So when you don't have the whole protein translated, right, it's still being translated, you know, getting out from the ribosome, you already see some structural, you know, fragmentation."}, {"time": 4185, "text": "So folding starts happening before the whole protein gets produced, right?"}, {"time": 4192, "text": "And so this is obviously, you know, one of the biggest questions in, you know, in modern molecular biologists."}, {"time": 4200, "text": "Not like maybe what happens, like that's not as bigger than the question of folding."}, {"time": 4207, "text": "That's the question of like, something like deeper fundamental idea of folding."}, {"time": 4212, "text": "Behind folding."}, {"time": 4214, "text": "So, you know, so obviously if we are able to predict the end product of protein folding, we are one step closer to understanding sort of the mechanisms of the protein folding."}, {"time": 4230, "text": "Because we can then potentially look and start probing what are the critical parts of this process and what are not so critical parts of this process."}, {"time": 4241, "text": "So we can start decomposing this, you know, so in a way this protein structure prediction algorithm can be used as a tool, right?"}, {"time": 4253, "text": "So you change the, you know, you modify the protein, you get back to this tool, it predicts, okay, it's completely unstable."}, {"time": 4264, "text": "Yeah, which aspects of the input will have a big impact on the output?"}, {"time": 4271, "text": "So what happens is, you know, we typically have some sort of incremental advancement, you know, each stage of this CASP competition, you have groups with incremental advancement and, you know, historically the top performing groups were, you know, they were not using machine learning."}, {"time": 4345, "text": "But what happens when we don't have these relatives?"}, {"time": 4347, "text": "This is when it becomes really, really hard, right?"}, {"time": 4351, "text": "So that's so called de novo, you know, de novo protein structure prediction."}, {"time": 4357, "text": "And in this case, those methods were traditionally very good."}, {"time": 4363, "text": "But what happened in the last year, the original alpha fold came into and all of a sudden it's much better than everyone else."}, {"time": 4376, "text": "This is 2018."}, {"time": 4378, "text": "Oh, and the competition is only every two years, I think."}, {"time": 4382, "text": "And then, so, you know, it was sort of kind of over shockwave to the bioinformatics community that, you know, we have like a state of the art machine learning system that does, you know, structure prediction."}, {"time": 4398, "text": "And essentially what it does, you know, so if you look at this, it actually predicts the context."}, {"time": 4406, "text": "So, you know, so the process of reconstructing the 3D structure starts by predicting the context between the different parts of the protein."}, {"time": 4418, "text": "And the context essentially is the parts of the proteins that are in a close proximity to each other."}, {"time": 4423, "text": "Right, so actually the machine learning part seems to be estimating, you can correct me if I'm wrong here, but it seems to be estimating the distance matrix, which is like the distance between the different parts."}, {"time": 4435, "text": "Yeah, so we call the contact map."}, {"time": 4438, "text": "Contact map."}, {"time": 4438, "text": "So once you have the contact map, the reconstruction is becoming more straightforward, right?"}, {"time": 4444, "text": "But so the contact map is the key."}, {"time": 4446, "text": "And so, you know, so that what happened."}, {"time": 4451, "text": "And now we started seeing in this current stage, right?"}, {"time": 4455, "text": "Well, in the most recent one, we started seeing the emergence of these ideas in other people works, right?"}, {"time": 4465, "text": "But yet here's, you know, AlphaFold2 that again outperforms everyone else."}, {"time": 4473, "text": "And also by introducing yet another wave of the machine learning ideas."}, {"time": 4478, "text": "Yeah, there don't seem to be also an incorporation."}, {"time": 4481, "text": "First of all, the paper is not out yet, but there's a bunch of ideas already out."}, {"time": 4484, "text": "There does seem to be an incorporation of this other thing."}, {"time": 4488, "text": "I don't know if it's something that you could speak to, which is like the incorporation of like other structures, like evolutionary similar structures that are used to kind of give you hints."}, {"time": 4503, "text": "Yes, so evolutionary similarity is something that we can detect at different levels, right?"}, {"time": 4510, "text": "So we know, for example, that the structure of proteins is more conserved than the sequence."}, {"time": 4520, "text": "The sequence could be very different, but the structural shape is actually still very conserved."}, {"time": 4526, "text": "So that's sort of the intrinsic property that, you know, in a way related to protein folds, you know, to the evolution of the, you know, of the proteins and protein domains, et cetera."}, {"time": 4537, "text": "But we know that, I mean, there've been multiple studies."}, {"time": 4541, "text": "And, you know, ideally, if you have structures, you know, you should use that information."}, {"time": 4548, "text": "However, sometimes we don't have this information."}, {"time": 4551, "text": "Instead, we have a bunch of sequences."}, {"time": 4553, "text": "Sequences, we have a lot, right?"}, {"time": 4554, "text": "So we have, you know, hundreds, thousands of, you know, different organisms sequenced, right?"}, {"time": 4564, "text": "And by taking the same protein, but in different organisms and aligning it, so making it, you know, making the corresponding positions aligned, we can actually say a lot about sort of what is conserved in this protein and therefore, you know, structurally more stable, what is diverse in this protein."}, {"time": 4588, "text": "So on top of that, we could provide sort of the information about the sort of the secondary structure of this protein, et cetera, et cetera."}, {"time": 4596, "text": "So this information is extremely useful and it's already there."}, {"time": 4601, "text": "So while it's tempting to, you know, to do a complete ab initio, so you just have a protein sequence and nothing else, the reality is such that we are overwhelmed with this data."}, {"time": 4614, "text": "So why not use it?"}, {"time": 4616, "text": "And so, yeah, so I'm looking forward to reading this paper."}, {"time": 4621, "text": "It does seem to, like they've, in the previous version of Alpha Fold, they didn't, for this evolutionary similarity thing, they didn't use machine learning for that."}, {"time": 4632, "text": "Or rather, they used it as like the input to the entirety of the neural net, like the features derived from the similarity."}, {"time": 4642, "text": "It seems like there's some kind of quote, unquote, iterative thing where it seems to be part of the learning process is the incorporation of this evolutionary similarity."}, {"time": 4654, "text": "Yeah, I don't think there is a bioarchive paper, right?"}, {"time": 4657, "text": "No, there's nothing."}, {"time": 4658, "text": "There's a blog post that's written by a marketing team, essentially, which, you know, it has some scientific similarity, probably, to the actual methodology used, but it could be, it's like interpreting scripture."}, {"time": 4675, "text": "It could be just poetic interpretations of the actual work as opposed to direct connection to the work."}, {"time": 4681, "text": "So now, speaking about protein folding, right?"}, {"time": 4684, "text": "So, you know, in order to answer the question whether or not we have solved this, right?"}, {"time": 4689, "text": "So we need to go back to the beginning of our conversation with the realization that an average protein is that typically what the CASP has been focusing on is this competition has been focusing on the single, maybe two domain proteins that are still very compact."}, {"time": 4711, "text": "And even those ones are extremely challenging to solve."}, {"time": 4715, "text": "But now we talk about, you know, an average protein that has two, three protein domains."}, {"time": 4722, "text": "If you look at the proteins that are in charge of the, you know, of the process with the neural system, right, perhaps one of the most recently evolved sort of systems in an organism, right?"}, {"time": 4743, "text": "All of them, well, the majority of them are highly multi domain proteins."}, {"time": 4749, "text": "So they are, you know, some of them have five, six, seven, you know, and more domains, right?"}, {"time": 4756, "text": "And, you know, we are very far away from understanding how these proteins are folded."}, {"time": 4762, "text": "So the complexity of the protein matters here."}, {"time": 4764, "text": "The complexity of the protein modules or the protein domains."}, {"time": 4770, "text": "So you're saying solved, so the definition of solved here is particularly the CASP competition achieving human level, not human level, achieving experimental level performance on these particular sets of proteins that have been used in these competitions."}, {"time": 4790, "text": "Well, I mean, you know, I do think that, you know, especially with regards to the alpha fold, you know, it is able to, you know, to solve, you know, at the near experimental level, pre big majority of the more compact proteins like, or protein domains."}, {"time": 4816, "text": "Because again, in order to understand how the overall protein, you know, multi domain protein fold, we do need to understand the structure of its individual domains."}, {"time": 4828, "text": "I mean, unlike if you look at alpha zero or like even mu zero, if you look at that work, you know, it's nice reinforcement learning self playing mechanisms are nice cause it's all in simulation."}, {"time": 4842, "text": "So you can learn from just huge amounts."}, {"time": 4845, "text": "Like you don't need data."}, {"time": 4847, "text": "It was like the problem with proteins, like the size, I forget how many 3D structures have been mapped, but the training data is very small."}, {"time": 4856, "text": "No matter what, it's like millions, maybe a one or two million or something like that, but it's some very small number, but like, it doesn't seem like that's scalable."}, {"time": 4866, "text": "There has to be, I don't know, it feels like you want to somehow 10 X the data or a hundred X the data somehow."}, {"time": 4875, "text": "Yes, but we also can take advantage of homology models, right, so the models that are of very good quality because they are essentially obtained based on the evolutionary information, right?"}, {"time": 4893, "text": "So you can, there is a potential to enhance this information and, you know, use it again to empower the training set."}, {"time": 4903, "text": "And it's, I think, I am actually very optimistic."}, {"time": 4909, "text": "I think it's been one of this sort of, you know, churning events where you have a system that is, you know, a machine learning system that is truly better than the machine learning system."}, {"time": 4932, "text": "Better than the sort of the more conventional biophysics based methods."}, {"time": 4937, "text": "That's a huge leap."}, {"time": 4939, "text": "This is one of those fun questions, but where would you put it in the ranking of the greatest breakthroughs in artificial intelligence history?"}, {"time": 4951, "text": "So like, okay, so let's see who's in the running."}, {"time": 4955, "text": "So you got like AlphaZero and AlphaGo beating the world champion at the game of Go."}, {"time": 4964, "text": "Thought to be impossible like 20 years ago."}, {"time": 4968, "text": "Or at least the AI community was highly skeptical."}, {"time": 4971, "text": "Then you got like also Deep Blue original Kasparov."}, {"time": 4975, "text": "You have deep learning itself, like the maybe, what would you say, the AlexNet, ImageNet moment."}, {"time": 4980, "text": "So the first neural network achieving human level performance."}, {"time": 4984, "text": "Super, that's not true."}, {"time": 4987, "text": "Achieving like a big leap in performance on the computer vision problem."}, {"time": 4994, "text": "There is OpenAI, the whole like GPT3, that whole space of transformers and language models just achieving this incredible performance of application of neural networks to language models."}, {"time": 5011, "text": "Boston Dynamics, pretty cool."}, {"time": 5013, "text": "Like robotics."}, {"time": 5015, "text": "People are like, there's no AI."}, {"time": 5018, "text": "No, no, there's no machine learning currently."}, {"time": 5021, "text": "But AI is much bigger than machine learning."}, {"time": 5024, "text": "So that just the engineering aspect, I would say it's one of the greatest accomplishments in engineering side."}, {"time": 5032, "text": "Engineering meaning like mechanical engineering of robotics ever."}, {"time": 5037, "text": "Then of course, autonomous vehicles."}, {"time": 5039, "text": "You can argue for Waymo, which is like the Google self driving car."}, {"time": 5043, "text": "Or you can argue for Tesla, which is like actually being used by hundreds of thousands of people on the road today, machine learning system."}, {"time": 5053, "text": "And I don't know if you can, what else is there?"}, {"time": 5057, "text": "But I think that's it."}, {"time": 5058, "text": "And then AlphaFold, many people are saying is up there, potentially number one."}, {"time": 5063, "text": "Would you put them at number one?"}, {"time": 5064, "text": "Well, in terms of the impact on the science and on the society beyond, it's definitely, to me would be one of the... Top three?"}, {"time": 5079, "text": "What you want?"}, {"time": 5079, "text": "Maybe, I mean, I'm probably not the best person to answer that."}, {"time": 5085, "text": "But I do have, I remember my, back in, I think 1997, when Deep Blue, that Kasparov, it was, I mean, it was a shock."}, {"time": 5101, "text": "I mean, it was, and I think for the, for the pre substantial part of the world, that especially people who have some experience with chess, and realizing how incredibly human this game, how much of a brain power you need to reach those levels of grandmasters, right, level."}, {"time": 5136, "text": "And it's probably one of the first time, and how good Kasparov was."}, {"time": 5139, "text": "And again, yeah, so Kasparov's arguably one of the best ever, right?"}, {"time": 5145, "text": "And you get a machine that beats him."}, {"time": 5147, "text": "All right, so it's... First time a machine probably beat a human at that scale of a thing, of anything."}, {"time": 5154, "text": "So that was, to me, that was like, you know, one of the groundbreaking events in the history of AI."}, {"time": 5160, "text": "Yeah, that's probably number one."}, {"time": 5162, "text": "Probably, like we don't, it's hard to remember."}, {"time": 5165, "text": "It's like Muhammad Ali versus, I don't know, any of the Mike Tyson, something like that."}, {"time": 5169, "text": "It's like, nah, you gotta put Muhammad Ali at number one."}, {"time": 5173, "text": "Same with Deep Blue, even though it's not machine learning based."}, {"time": 5179, "text": "Still, it uses advanced search, and search is the integral part of AI, right?"}, {"time": 5184, "text": "It's not, people don't think of it that way at this moment."}, {"time": 5187, "text": "In vogue currently, search is not seen as a fundamental aspect of intelligence, but it very well, I mean, it very likely is."}, {"time": 5197, "text": "In fact, I mean, that's what neural networks are, is they're just performing search on the space of parameters, and it's all search."}, {"time": 5205, "text": "All of intelligence is some form of search, and you just have to become cleverer and clever at that search problem."}, {"time": 5210, "text": "And I also have another one that you didn't mention that's one of my favorite ones is, so you've probably heard of this, it's, I think it's called Deep Rembrandt."}, {"time": 5223, "text": "It's the project where they trained, I think there was a collaboration between the sort of the experts in Rembrandt painting in Netherlands, and a group, an artificial intelligence group, where they train an algorithm to replicate the style of the Rembrandt, and they actually printed a portrait that never existed before in the style of Rembrandt."}, {"time": 5252, "text": "I think they printed it on a sort of, on the canvas that, you know, using pretty much same types of paints and stuff."}, {"time": 5262, "text": "To me, it was mind blowing."}, {"time": 5264, "text": "Yeah, and the space of art, that's interesting."}, {"time": 5266, "text": "There hasn't been, maybe that's it, but I think there hasn't been an image in that moment yet in the space of art."}, {"time": 5276, "text": "You haven't been able to achieve superhuman level performance in the space of art, even though there's this big famous thing where a piece of art was purchased, I guess for a lot of money."}, {"time": 5289, "text": "Yeah, but it's still, you know, people are like in the space of music at least, that's, you know, it's clear that human created pieces are much more popular."}, {"time": 5301, "text": "So there hasn't been a moment where it's like, oh, this is, we're now, I would say in the space of music, what makes a lot of money, we're talking about serious money, it's music and movies, or like shows and so on, and entertainment."}, {"time": 5316, "text": "There hasn't been a moment where AI created, AI was able to create a piece of music or a piece of cinema, like Netflix show, that is, you know, that's sufficiently popular to make a ton of money."}, {"time": 5336, "text": "And that moment would be very, very powerful, because that's like, that's an AI system being used to make a lot of money."}, {"time": 5343, "text": "And like direct, of course, AI tools, like even Premiere, audio editing, all the editing, everything I do, to edit this podcast, there's a lot of AI involved."}, {"time": 5351, "text": "Actually, this is a program, I wanna talk to those folks, just cause I wanna nerd out, it's called iZotope, I don't know if you're familiar with it."}, {"time": 5358, "text": "They have a bunch of tools of audio processing, and they have, I think they're Boston based, just, it's so exciting to me to use it, like on the audio here, cause it's all machine learning."}, {"time": 5370, "text": "It's not, cause most audio production stuff is like any kind of processing you do, it's very basic signal processing, and you're tuning knobs and so on."}, {"time": 5381, "text": "They have all of that, of course, but they also have all of this machine learning stuff, like where you actually give it training data, you select parts of the audio you train on, you train on it, and it figures stuff out."}, {"time": 5396, "text": "It's great, it's able to detect, like the ability of it to be able to separate voice and music, for example, or voice and anything, is incredible."}, {"time": 5407, "text": "Like it just, it's clearly exceptionally good at applying these different neural networks models to just separate the different kinds of signals from the audio."}, {"time": 5419, "text": "That, okay, so that's really exciting."}, {"time": 5422, "text": "Photoshop, Adobe people also use it, but to generate a piece of music that will sell millions, a piece of art, yeah."}, {"time": 5431, "text": "No, I agree, and you know, it's, that's, you know, as I mentioned, I offer my AI class, and you know, an integral part of this is the project, right?"}, {"time": 5444, "text": "So it's my favorite, ultimate favorite part, because it typically, we have these project presentations the last two weeks of the classes, right before, you know, the Christmas break, and it's sort of, it adds this cool excitement, and every time, I mean, I'm amazed, you know, with some projects that people, you know, come up with."}, {"time": 5467, "text": "And so, and quite a few of them are actually, you know, they have some link to arts."}, {"time": 5477, "text": "I mean, you know, I think last year we had a group who designed an AI producing hokus, Japanese poems."}, {"time": 5489, "text": "So, and some of them, so, you know, it got trained on the English based, haikus, haikus, right?"}, {"time": 5496, "text": "So, and some of them, you know, they get to present, like, the top selection."}, {"time": 5503, "text": "They were pretty good."}, {"time": 5504, "text": "I mean, you know, I mean, of course, I'm not a specialist, but you read them, and you see this is real."}, {"time": 5509, "text": "It seems profound."}, {"time": 5510, "text": "Yes, yeah, it seems real."}, {"time": 5515, "text": "We also had a couple of projects where people tried to teach AI how to play, like, rock music, classical music."}, {"time": 5522, "text": "I think, and popular music."}, {"time": 5527, "text": "Interestingly enough, you know, classical music was among the most difficult ones."}, {"time": 5535, "text": "And, you know, of course, if you, if, you know, you know, if you look at the, you know, the, like, grandmasters of music, like Bach, right?"}, {"time": 5548, "text": "So there is a lot of, there is a lot of, there is a lot of almost math."}, {"time": 5554, "text": "Yeah, well, he's very mathematical."}, {"time": 5557, "text": "So this is, I would imagine that at least some style of this music could be picked up, but then you have this completely different spectrum of classical composers."}, {"time": 5569, "text": "And so, you know, it's almost like, you know, you don't have to sort of look at the data."}, {"time": 5576, "text": "You just listen to it and say, nah, that's not it, not yet."}, {"time": 5581, "text": "That's not it, yeah."}, {"time": 5583, "text": "There's OpenAI has, I think, OpenMuse or something like that, the system."}, {"time": 5587, "text": "It's cool, but it's like, eh, it's not compelling for some reason."}, {"time": 5592, "text": "It could be a psychological reason too."}, {"time": 5594, "text": "Maybe we need to have a human being, a tortured soul behind the music."}, {"time": 5602, "text": "I completely agree."}, {"time": 5603, "text": "But yeah, whether or not we'll have, one day we'll have, you know, a song written by an AI engine to be like in top charts, musical charts, I wouldn't be surprised."}, {"time": 5620, "text": "I wouldn't be surprised."}, {"time": 5623, "text": "I wonder if we already have one and it just hasn't been announced."}, {"time": 5628, "text": "We wouldn't know."}, {"time": 5629, "text": "How hard is the multi protein folding problem?"}, {"time": 5633, "text": "Is that kind of something you've already mentioned which is baked into this idea of greater and greater complexity of proteins?"}, {"time": 5641, "text": "Like multi domain proteins, is that basically become multi protein complexes?"}, {"time": 5648, "text": "Yes, you got it right."}, {"time": 5650, "text": "So it's sort of, it has the components of both of protein folding and protein, protein interactions."}, {"time": 5661, "text": "Because in order for these domains, many of these proteins actually, they never form a stable structure."}, {"time": 5671, "text": "One of my favorite proteins, and pretty much everyone who works in the, I know, whom I know, who works with proteins, they always have their favorite proteins."}, {"time": 5684, "text": "Right, so one of my favorite proteins, probably my favorite protein, the one that I worked when I was a postdoc is so called post synaptic density 95, PSD 95 protein."}, {"time": 5696, "text": "So it's one of the key actors in the majority of neurological processes at the molecular level."}, {"time": 5704, "text": "So it's a, and essentially it's a key player in the post synaptic density."}, {"time": 5713, "text": "So this is the crucial part of this synapse where a lot of these chemical processes are happening."}, {"time": 5722, "text": "So it has five domains, right?"}, {"time": 5726, "text": "So five protein domains."}, {"time": 5727, "text": "So pretty large proteins, I think 600 something assets."}, {"time": 5735, "text": "But the way it's organized itself, it's flexible, right?"}, {"time": 5741, "text": "So it acts as a scaffold."}, {"time": 5743, "text": "So it is used to bring in other proteins."}, {"time": 5749, "text": "So they start acting in the orchestrated manner, right?"}, {"time": 5754, "text": "So, and the type of the shape of this protein, it's in a way, there are some stable parts of this protein, but there are some flexible."}, {"time": 5764, "text": "And this flexibility is built in into the protein in order to become sort of this multifunctional machine."}, {"time": 5773, "text": "So do you think that kind of thing is also learnable through the alpha fold two kind of approach?"}, {"time": 5779, "text": "I mean, the time will tell."}, {"time": 5782, "text": "Is it another level of complexity?"}, {"time": 5784, "text": "Is it like how big of a jump in complexity is that whole thing?"}, {"time": 5788, "text": "To me, it's yet another level of complexity because when we talk about protein, protein interactions, and there is actually a different challenge for this called Capri, and so this, that is focused specifically on macromolecular interactions, protein, protein, protein, DNA, et cetera."}, {"time": 5808, "text": "So, but it's, there are different mechanisms that govern molecular interactions and that need to be picked up, say by a machine learning algorithm."}, {"time": 5823, "text": "Interestingly enough, we actually, we participated for a few years in this competition."}, {"time": 5831, "text": "We typically don't participate in competitions, I don't know, don't have enough time, because it's very intensive, it's a very intensive process."}, {"time": 5843, "text": "But we participated back in about 10 years ago or so."}, {"time": 5850, "text": "And the way we entered this competition, so we design a scoring function, right?"}, {"time": 5855, "text": "So the function that evaluates whether or not your protein, protein interaction is supposed to look like experimentally solved, right?"}, {"time": 5863, "text": "So the scoring function is very critical part of the model prediction."}, {"time": 5869, "text": "So we designed it to be a machine learning one."}, {"time": 5872, "text": "And so it was one of the first machine learning based scoring function used in Capri."}, {"time": 5880, "text": "And we essentially learned what should contribute, what are the critical components contributing into the protein, protein interaction."}, {"time": 5890, "text": "So this could be converted into a learning problem and thereby it could be learned?"}, {"time": 5895, "text": "I believe so, yes."}, {"time": 5897, "text": "Do you think AlphaFold2 or something similar to it from DeepMind or somebody else will be, will result in a Nobel Prize or multiple Nobel Prizes?"}, {"time": 5908, "text": "So like, you know, obviously, maybe not so obviously, you can't give a Nobel Prize to a computer program."}, {"time": 5918, "text": "At least for now, give it to the designers of that program."}, {"time": 5922, "text": "But do you see one or multiple Nobel Prizes where AlphaFold2 is like a large percentage of what that prize is given for?"}, {"time": 5934, "text": "Would it lead to discoveries at the level of Nobel Prizes?"}, {"time": 5940, "text": "I mean, I think we are definitely destined to see the Nobel Prize becoming sort of, to be evolving with the evolution of science and the evolution of science as such that it now becomes like really multi facets, right?"}, {"time": 5957, "text": "So where you don't really have like a unique discipline, you have sort of the, a lot of cross disciplinary talks in order to achieve sort of, you know, really big advancements, you know."}, {"time": 5972, "text": "So I think, you know, the computational methods will be acknowledged in one way or another."}, {"time": 5982, "text": "And as a matter of fact, you know, they were first acknowledged back in 2013, right?"}, {"time": 5990, "text": "Where, you know, the first three people were, you know, awarded the Nobel Prize for study the protein folding, right, the principle."}, {"time": 6001, "text": "And, you know, I think all three of them are computational biophysicists, right?"}, {"time": 6006, "text": "So, you know, that I think is unavoidable."}, {"time": 6013, "text": "You know, it will come with the time."}, {"time": 6016, "text": "The fact that, you know, alpha fold and, you know, similar approaches, because again, it's a matter of time that people will embrace this, you know, principle and we'll see more and more such, you know, such tools coming into play."}, {"time": 6036, "text": "But, you know, these methods will be critical in a scientific discovery, no doubts about it."}, {"time": 6047, "text": "On the engineering side, maybe a dark question, but do you think it's possible to use these machine learning methods to start to engineer proteins?"}, {"time": 6059, "text": "And the next question is something quite a few biologists are against, some are for, for study purposes, is to engineer viruses."}, {"time": 6069, "text": "Do you think machine learning, like something like alpha fold could be used to engineer viruses?"}, {"time": 6074, "text": "So to answer the first question, you know, it has been, you know, a part of the research in the protein science, the protein design is, you know, is a very prominent areas of research."}, {"time": 6089, "text": "Of course, you know, one of the pioneers is David Baker and Rosetta algorithm that, you know, essentially was doing the de novo design and was used to design new proteins, you know."}, {"time": 6101, "text": "And design of proteins means design of function."}, {"time": 6104, "text": "So like when you design a protein, you can control, I mean, the whole point of a protein with the protein structure comes a function, like it's doing something."}, {"time": 6114, "text": "So you can design different things."}, {"time": 6116, "text": "So you can, yeah, so you can, well, you can look at the proteins from the functional perspective."}, {"time": 6120, "text": "You can also look at the proteins from the structural perspective, right?"}, {"time": 6124, "text": "So the structural building blocks."}, {"time": 6125, "text": "So if you want to have a building block of a certain shape, you can try to achieve it by, you know, introducing a new protein sequence and predicting, you know, how it will fold."}, {"time": 6137, "text": "So with that, I mean, it's a natural, one of the, you know, natural applications of these algorithms."}, {"time": 6148, "text": "Now, talking about engineering a virus."}, {"time": 6154, "text": "With machine learning."}, {"time": 6155, "text": "With machine learning, right?"}, {"time": 6156, "text": "So, well, you know, so luckily for us, I mean, we don't have that much data, right?"}, {"time": 6167, "text": "We actually, right now, one of the projects that we are carrying on in the lab is we're trying to develop a machine learning algorithm that determines the, whether or not the current strain is pathogenic."}, {"time": 6182, "text": "And the current strain of the coronavirus."}, {"time": 6184, "text": "Of the virus."}, {"time": 6186, "text": "I mean, so there are applications to coronaviruses because we have strains of SARS COVID 2, also SARS COVID, MERS that are pathogenic, but we also have strains of other coronaviruses that are, you know, not pathogenic."}, {"time": 6200, "text": "I mean, the common cold viruses and, you know, some other ones, right?"}, {"time": 6205, "text": "So, so pathogenic meaning spreading."}, {"time": 6208, "text": "Pathogenic means actually inflicting damage."}, {"time": 6215, "text": "There are also some, you know, seasonal versus pandemic strains of influenza, right?"}, {"time": 6221, "text": "And determining the, what are the molecular determinant, right?"}, {"time": 6226, "text": "So that are built in, into the protein sequence, into the gene sequence, right?"}, {"time": 6230, "text": "So, and whether or not the machine learning can determine those, those components, right?"}, {"time": 6239, "text": "So like using machine learning to do, that's really interesting to, to, to given, give the input is like what the entire, the protein sequence and then determine if this thing is going to be able to do damage to a biological system."}, {"time": 6255, "text": "So, so I mean, It's a good machine learning, you're saying we don't have enough data for that?"}, {"time": 6259, "text": "We, I mean, for, for this specific one, we do."}, {"time": 6262, "text": "We might actually, I have, you know, have to back up on this because we're still in the process."}, {"time": 6267, "text": "There was one work that appeared in bioarchive by Eugene Kunin, who is one of these, you know, pioneers in, in, in evolutionary genomics."}, {"time": 6279, "text": "And they tried to look at this, but, you know, the methods were sort of standard, you know, supervised learning methods."}, {"time": 6288, "text": "And now the question is, you know, can you advance it further by, by using, you know, not so standard methods, you know?"}, {"time": 6298, "text": "So there's obviously a lot of hope in, in transfer learning where you can actually try to transfer the information that the machine learning learns about the proper protein sequences, right?"}, {"time": 6311, "text": "And, you know, so, so there is some promise in going this direction, but if we have this, it would be extremely useful because then we could essentially forecast the potential mutations that would make the current strain more or less pathogenic."}, {"time": 6327, "text": "Anticipate, anticipate them from a vaccine development, for the treatment, antiviral drug development."}, {"time": 6334, "text": "That, that would be a very crucial task."}, {"time": 6336, "text": "But you could also use that system to then say, how would we potentially modify this virus to make it more pathogenic?"}, {"time": 6347, "text": "This, that's true."}, {"time": 6350, "text": "And then, you know, the, again, the hope is, well, several things, right?"}, {"time": 6359, "text": "So one is that, you know, it's, even if you design a, you know, a sequence, right?"}, {"time": 6366, "text": "So to carry out the actual experimental biology, to ensure that all the components working, you know, is a completely different matter."}, {"time": 6379, "text": "Difficult process."}, {"time": 6380, "text": "Then the, you know, we've seen in the past, there could be some regulation of the moment the scientific community recognizes that it's now becoming no longer a sort of a fun puzzle to, you know, for machine learning."}, {"time": 6396, "text": "Could be open."}, {"time": 6397, "text": "Yeah, so then there might be some regulation."}, {"time": 6400, "text": "So I think back in, what, 2015, there was, you know, there was an issue on regulating the research on influenza strains, right?"}, {"time": 6412, "text": "There were several groups, you know, used sort of the mutation analysis to determine whether or not this strain will jump from one species to another."}, {"time": 6423, "text": "And I think there was like a half a year moratorium on the research on the paper published until, you know, scientists, you know, analyzed it and decided that it's actually safe."}, {"time": 6436, "text": "I forgot what that's called."}, {"time": 6437, "text": "Something of function, test of function."}, {"time": 6440, "text": "Gain of function."}, {"time": 6440, "text": "Gain of function, yeah."}, {"time": 6442, "text": "Gain of function, loss of function, that's right."}, {"time": 6446, "text": "It's like, let's watch this thing mutate for a while to see like, to see what kind of things we can observe."}, {"time": 6453, "text": "I guess I'm not so much worried about that kind of research if there's a lot of regulation and if it's done very well and with competence and seriously."}, {"time": 6462, "text": "I am more worried about kind of this, you know, the underlying aspect of this question is more like 50 years from now."}, {"time": 6472, "text": "Speaking to the Drake equation, one of the parameters in the Drake equation is how long civilizations last."}, {"time": 6479, "text": "And that seems to be the most important value actually for calculating if there's other alien intelligent civilizations out there."}, {"time": 6488, "text": "That's where there's most variability."}, {"time": 6490, "text": "Assuming like if life, if that percentage that life can emerge is like not zero, like if we're a super unique, then it's the how long we last is basically the most important thing."}, {"time": 6506, "text": "So from a selfish perspective, but also from a Drake equation perspective, I'm worried about our civilization lasting."}, {"time": 6515, "text": "And you kind of think about all the ways in which machine learning can be used to design greater weapons of destruction, right?"}, {"time": 6525, "text": "And I mean, one way to ask that if you look sort of 50 years from now, a hundred years from now, would you be more worried about natural pandemics or engineered pandemics?"}, {"time": 6539, "text": "Like who's the better designer of viruses, nature or humans if we look down the line?"}, {"time": 6545, "text": "I think in my view, I would still be worried about the natural pandemics simply because I mean, the capacity of the nature producing this."}, {"time": 6560, "text": "It does pretty good job, right?"}, {"time": 6563, "text": "And the motivation for using virus, engineering viruses as a weapon is a weird one because maybe you can correct me on this, but it seems very difficult to target a virus, right?"}, {"time": 6575, "text": "The whole point of a weapon, the way a rocket works, if a starting point, you have an end point and you're trying to hit a target, to hit a target with a virus is very difficult."}, {"time": 6584, "text": "It's basically just, right?"}, {"time": 6587, "text": "The target would be the human species."}, {"time": 6592, "text": "Yeah, I have a hope in us."}, {"time": 6594, "text": "I'm forever optimistic that we will not, there's insufficient evil in the world to lead to that kind of destruction."}, {"time": 6604, "text": "Well, I also hope that, I mean, that's what we see."}, {"time": 6607, "text": "I mean, with the way we are getting connected, the world is getting connected."}, {"time": 6614, "text": "I think it helps for the world to become more transparent."}, {"time": 6622, "text": "So the information spread is, I think it's one of the key things for the society to become more balanced one way or another."}, {"time": 6636, "text": "This is something that people disagree with me on, but I do think that the kind of secrecy that governments have."}, {"time": 6643, "text": "So you're kind of speaking more to the other aspects, like a research community being more open, companies are being more open."}, {"time": 6652, "text": "Government is still like, we're talking about like military secrets."}, {"time": 6657, "text": "I think military secrets of the kind that could destroy the world will become also a thing of the 20th century."}, {"time": 6667, "text": "It'll become more and more open."}, {"time": 6670, "text": "I think nations will lose power in the 21st century, like lose sufficient power towards secrecies."}, {"time": 6675, "text": "Transparency is more beneficial than secrecy, but of course it's not obvious."}, {"time": 6681, "text": "Let's hope so."}, {"time": 6682, "text": "Let's hope so that the governments will become more transparent."}, {"time": 6691, "text": "What, so we last talked, I think in March or April, what have you learned?"}, {"time": 6696, "text": "How has your philosophical, psychological, biological worldview changed since then?"}, {"time": 6703, "text": "Or you've been studying it nonstop from a computational biology perspective."}, {"time": 6708, "text": "How has your understanding and thoughts about this virus changed over those months from the beginning to today?"}, {"time": 6714, "text": "One thing that I was really amazed at how efficient the scientific community was."}, {"time": 6723, "text": "I mean, and even just judging on this very narrow domain of protein structure and understanding the structural characterization of this virus from the components point of view, whole virus point of view."}, {"time": 6741, "text": "If you look at SARS, something that happened less than 20, but close enough, 20 years ago, and you see what, when it happened, what was sort of the response by the scientific community, you see that the structure characterizations did a cure, but it took several years, right?"}, {"time": 6771, "text": "Now the things that took several years, it's a matter of months, right?"}, {"time": 6776, "text": "So we see that the research pop up."}, {"time": 6781, "text": "We are at the unprecedented level in terms of the sequencing, right?"}, {"time": 6835, "text": "It'd be cool if we also had a lot more data about, so that the spread of this virus, not maybe, well, it'd be nice if we had it for like contact tracing purposes for this virus, but it'd be also nice if we had it for the study for future viruses to be able to respond and so on, but it's already nice that we have geographical data and the basic data from individual humans, yeah."}, {"time": 6858, "text": "Exactly, no, I think contact tracing is obviously a key component in understanding the spread of this virus."}, {"time": 6869, "text": "There is also, there is a number of challenges, right?"}, {"time": 6871, "text": "So XPRIZE is one of them, we just recently took a part of this competition, it's the prediction of the number of infections in different regions."}, {"time": 6888, "text": "So, you know, obviously the AI is the main topic in those predictions."}, {"time": 6895, "text": "Yeah, but it's still, the data, I mean, that's a competition, but the data is weak on the training."}, {"time": 6903, "text": "Like, it's great, it's much more than probably before, but like, it'd be nice if it was like really rich."}, {"time": 6911, "text": "I talked to Michael Mina from Harvard, I mean, he dreams that the community comes together with like a weather map to where viruses, right, like really high resolution sensors on like how from person to person the viruses that travel, all the different kinds of viruses, right?"}, {"time": 6931, "text": "Because there's a ton of them, and then you'd be able to tell the story that you've spoken about of the evolution of these viruses, like day to day mutations that are occurring."}, {"time": 6943, "text": "I mean, that'd be fascinating just from a perspective of study and from the perspective of being able to respond to future pandemics."}, {"time": 6951, "text": "That's ultimately what I'm worried about."}, {"time": 6951, "text": "People love books."}, {"time": 6955, "text": "Is there some three or whatever number of books, technical, fiction, philosophical, that brought you joy in life, had an impact on your life, and maybe some that you would recommend others?"}, {"time": 6971, "text": "I'll give you three very different books, and I also have a special runner up."}, {"time": 6975, "text": "Honorable mention."}, {"time": 6979, "text": "I mean, it's an audiobook, and that's some specific reason behind it."}, {"time": 6983, "text": "So the first book is something that sort of impacted my earlier stage of life, and I'm probably not going to be very original here."}, {"time": 6995, "text": "It's Bulgakov's Master and Margarita."}, {"time": 6999, "text": "For a Russian, maybe it's not super original, but it's a really powerful book, even in English."}, {"time": 7007, "text": "It is incredibly powerful, and I mean, the way it ends."}, {"time": 7015, "text": "I still have goosebumps when I read the very last sort of, it's called prologue, where it's just so powerful."}, {"time": 7023, "text": "What impact did it have on you?"}, {"time": 7023, "text": "What ideas?"}, {"time": 7027, "text": "What insights did you get from it?"}, {"time": 7027, "text": "I was just taken by the fact that you have those parallel lives apart from many centuries, and somehow they got sort of intertwined into one story, and that to me was fascinating."}, {"time": 7051, "text": "And of course the romantic part of this book is like it's not just romance, it's like the romance empowered by sort of magic, right?"}, {"time": 7067, "text": "And maybe on top of that, you have some irony, which is unavoidable, right?"}, {"time": 7071, "text": "Because it was that Soviet time."}, {"time": 7075, "text": "But it's very deeply Russian, so that's the wit, the humor, the pain, the love, all of that is one of the books that kind of captures something about Russian culture that people outside of Russia should probably read."}, {"time": 7091, "text": "What's the second one?"}, {"time": 7091, "text": "So the second one is again another one that it happened I read it later in my life."}, {"time": 7099, "text": "I think I read it first time when I was a graduate student."}, {"time": 7107, "text": "And that's the Solzhenitsyn's Cancer Word."}, {"time": 7111, "text": "That is amazingly powerful book."}, {"time": 7115, "text": "What is it about?"}, {"time": 7115, "text": "It's about, I mean, essentially based on Solzhenitsyn was diagnosed with cancer when he was reasonably young, and he made a full recovery."}, {"time": 7127, "text": "So this is about a person who was sentenced for life in one of these camps."}, {"time": 7139, "text": "And he had some cancer, so he was transported back to one of these Soviet republics, I think it was South Asian republics."}, {"time": 7151, "text": "And the book is about his experience being a prisoner, being a patient in the cancer clinic, in the cancer ward, surrounded by people, many of which die."}, {"time": 7175, "text": "But in the way it reads, first of all, later on I read the accounts of the doctors who describe the experiences in the book by the patient as incredibly accurate."}, {"time": 7199, "text": "So I read that there was some doctor saying that every single doctor should read this book to understand what the patient feels."}, {"time": 7207, "text": "But again, as many of the Solzhenitsyn's books, it has multiple levels of complexity."}, {"time": 7219, "text": "And obviously if you look above the cancer and the patient, the tumor that was growing and then disappeared in his body with some consequences, this is allegorically the Soviet, and he actually when he was asked, he said that this is what made him think about this, how to combine these experiences."}, {"time": 7255, "text": "Him being a part of the Soviet regime, also being a part of the someone sent to Gulag camp, and also someone who experienced cancer in his life."}, {"time": 7271, "text": "The Gulag Archipelago and this book, these are the works that actually made him receive a Nobel Prize."}, {"time": 7279, "text": "But to me I've read other books by Solzhenitsyn."}, {"time": 7291, "text": "This one to me is the most powerful one."}, {"time": 7295, "text": "And by the way, both this one and the previous one you read in Russian?"}, {"time": 7299, "text": "So now there is the third book is an English book and it's completely different."}, {"time": 7303, "text": "So we're switching the gears completely."}, {"time": 7307, "text": "So this is the book which, it's not even a book, it's an essay by Jonathan Neumann called The Computer and the Brain."}, {"time": 7319, "text": "And that was the book he was writing knowing that he was dying of cancer."}, {"time": 7327, "text": "So the book was released back, it's a very thin book."}, {"time": 7331, "text": "But the power, the intellectual power in this book, in this essay is incredible."}, {"time": 7339, "text": "I mean you probably know that von Neumann is considered to be one of the biggest thinkers."}, {"time": 7347, "text": "So his intellectual power was incredible."}, {"time": 7351, "text": "And you can actually feel this power in this book where the person is writing knowing that he will be, he will die."}, {"time": 7359, "text": "The book actually got published only after his death back in 1958."}, {"time": 7363, "text": "He died in 1957."}, {"time": 7367, "text": "So he tried to put as many ideas that he still hadn't realized."}, {"time": 7379, "text": "So this book is very difficult to read because every single paragraph is just compact, is filled with these ideas."}, {"time": 7391, "text": "And the ideas are incredible."}, {"time": 7395, "text": "Even nowadays, so he tried to put the parallels between the brain computing power, the neural system, and the computers as they were understood."}, {"time": 7407, "text": "Do you remember what year he was working on this?"}, {"time": 7411, "text": "57."}, {"time": 7411, "text": "So that was right during his, when he was diagnosed with cancer and he was essentially... Yeah, he's one of those, there's a few folks people mention, I think Ed Witten is another that like everyone that meets them, they say he's just an intellectual powerhouse."}, {"time": 7431, "text": "Okay, so who's the honorable mention?"}, {"time": 7435, "text": "And this is, I mean, the reason I put it sort of in a separate section because this is a book that I recently listened to."}, {"time": 7443, "text": "So it's an audio book."}, {"time": 7447, "text": "And this is a book called Lab Girl by Hope Jarron."}, {"time": 7451, "text": "So Hope Jarron, she is a scientist, she's a geochemist that essentially studies the fossil plants."}, {"time": 7463, "text": "And so she uses this fossil plant, the chemical analysis to understand what was the climate back in a thousand years, hundreds of thousands of years ago."}, {"time": 7479, "text": "And so something that incredibly touched me by this book, it was narrated by the author."}, {"time": 7487, "text": "And it's an incredibly personal story, incredibly."}, {"time": 7491, "text": "So certain parts of the book, you could actually hear the author crying."}, {"time": 7499, "text": "And that to me, I mean, I never experienced anything like this, reading the book, but it was like the connection between you and the author."}, {"time": 7511, "text": "And I think this is really a must read, but even better, a must listen to audio book for anyone who wants to learn about sort of academia, science, research in general, because it's a very personal account about her becoming a scientist."}, {"time": 7535, "text": "So we're just before New Year's."}, {"time": 7543, "text": "We talked a lot about some difficult topics of viruses and so on."}, {"time": 7547, "text": "Do you have some exciting things you're looking forward to in 2021?"}, {"time": 7551, "text": "Some New Year's resolutions, maybe silly or fun, or something very important and fundamental to the world of science or something completely unimportant?"}, {"time": 7567, "text": "Well, I'm definitely looking forward to towards things becoming normal."}, {"time": 7575, "text": "So yes, I really miss traveling."}, {"time": 7579, "text": "Every summer I go to an international summer school."}, {"time": 7583, "text": "It's called the School for Molecular and Theoretical Biology."}, {"time": 7587, "text": "It's held in Europe."}, {"time": 7591, "text": "It's organized by very good friends of mine."}]}]