[{"title": "Rohit Prasad: Amazon Alexa and Conversational AI | Lex Fridman Podcast #57", "id": "Ad89JYS-uZM", "quotes": [{"time": 351, "text": "One with you on your mobile device, one at your home, one at work."}, {"time": 356, "text": "So you have to respect these superhuman capabilities too."}, {"time": 360, "text": "Plus as humans, we have certain attributes we are very good at, very good at reasoning."}, {"time": 365, "text": "AI assistance not yet there, but in the realm of AI assistance, what they're great at is computation, memory, it's infinite and pure."}, {"time": 374, "text": "These are the attributes you have to start respecting."}, {"time": 376, "text": "So I think the comparison with human like versus the other aspect, which is also superhuman, has to be taken into consideration."}, {"time": 382, "text": "So I think we need to elevate the discussion to not just human like."}, {"time": 387, "text": "So there's certainly elements, we just mentioned, Alexa is everywhere, computation speaking."}, {"time": 393, "text": "So this is a much bigger infrastructure than just the thing that sits there in the room with you."}, {"time": 398, "text": "But it certainly feels to us mere humans that there's just another little creature there when you're interacting with it."}, {"time": 408, "text": "You're not interacting with the entirety of the infrastructure, you're interacting with the device."}, {"time": 412, "text": "The feeling is, okay, sure, we anthropomorphize things, but that feeling is still there."}, {"time": 418, "text": "So what do you think we as humans, the purity of the interaction with a smart device, interaction with a smart assistant, what do you think we look for in that interaction?"}, {"time": 430, "text": "I think in the certain interactions I think will be very much where it does feel like a human because it has a persona of its own."}, {"time": 439, "text": "And in certain ones it wouldn't be."}, {"time": 440, "text": "So I think a simple example to think of it is if you're walking through the house and you just wanna turn on your lights on and off and you're issuing a command, that's not very much like a human like interaction and that's where the AI shouldn't come back and have a conversation with you, just it should simply complete that command."}, {"time": 458, "text": "So those, I think the blend of, we have to think about this is not human, human alone."}, {"time": 463, "text": "It is a human machine interaction and certain aspects of humans are needed and certain aspects are in situations demand it to be like a machine."}, {"time": 471, "text": "So I told you, it's gonna be philosophical in parts."}, {"time": 475, "text": "What's the difference between human and machine in that interaction?"}, {"time": 478, "text": "When we interact to humans, especially those are friends and loved ones versus you and a machine that you also are close with."}, {"time": 490, "text": "I think the, you have to think about the roles the AI plays, right?"}, {"time": 493, "text": "So, and it differs from different customer to customer, different situation to situation, especially I can speak from Alexa's perspective."}, {"time": 501, "text": "It is a companion, a friend at times, an assistant, an advisor down the line."}, {"time": 507, "text": "So I think most AIs will have this kind of attributes and it will be very situational in nature."}, {"time": 513, "text": "So where is the boundary?"}, {"time": 514, "text": "I think the boundary depends on exact context in which you're interacting with the AI."}, {"time": 519, "text": "So the depth and the richness of natural language conversation is been by Alan Turing been used to try to define what it means to be intelligent."}, {"time": 530, "text": "There's a lot of criticism of that kind of test, but what do you think is a good test of intelligence in your view, in the context of the Turing test and Alexa or the Alexa prize, this whole realm, do you think about this human intelligence, what it means to define it, what it means to reach that level?"}, {"time": 550, "text": "I do think the ability to converse is a sign of an ultimate intelligence."}, {"time": 555, "text": "I think that there's no question about it."}, {"time": 558, "text": "So if you think about all aspects of humans, there are sensors we have, and those are basically a data collection mechanism."}, {"time": 566, "text": "And based on that, we make some decisions with our sensory brains, right?"}, {"time": 570, "text": "And from that perspective, I think there are elements we have to talk about how we sense the world and then how we act based on what we sense."}, {"time": 580, "text": "Those elements clearly machines have, but then there's the other aspects of computation that is way better."}, {"time": 588, "text": "I also mentioned about memory again, in terms of being near infinite, depending on the storage capacity you have, and the retrieval can be extremely fast and pure in terms of like, there's no ambiguity of who did I see when, right?"}, {"time": 602, "text": "I mean, machines can remember that quite well."}, {"time": 604, "text": "So again, on a philosophical level, I do subscribe to the fact that to be able to converse and as part of that, to be able to reason based on the world knowledge you've acquired and the sensory knowledge that is there is definitely very much the essence of intelligence."}, {"time": 623, "text": "But intelligence can go beyond human level intelligence based on what machines are getting capable of."}, {"time": 629, "text": "So what do you think maybe stepping outside of Alexa broadly as an AI field, what do you think is a good test of intelligence?"}, {"time": 638, "text": "Put it another way outside of Alexa, because so much of Alexa is a product, is an experience for the customer."}, {"time": 644, "text": "On the research side, what would impress the heck out of you if you saw, you know, what is the test where you said, wow, this thing is now starting to encroach into the realm of what we loosely think of as human intelligence?"}, {"time": 660, "text": "So, well, we think of it as AGI and human intelligence altogether, right?"}, {"time": 664, "text": "So in some sense, and I think we are quite far from that."}, {"time": 668, "text": "I think an unbiased view I have is that the Alexa's intelligence capability is a great test."}, {"time": 677, "text": "I think of it as there are many other true points like self driving cars, game playing like go or chess."}, {"time": 686, "text": "Let's take those two for as an example, clearly requires a lot of data driven learning and intelligence, but it's not as hard a problem as conversing with, as an AI is with humans to accomplish certain tasks or open domain chat, as you mentioned, Alexa prize."}, {"time": 704, "text": "In those settings, the key differences that the end goal is not defined unlike game playing."}, {"time": 711, "text": "You also do not know exactly what state you are in in a particular goal completion scenario."}, {"time": 718, "text": "In certain sense, sometimes you can, if it's a simple goal, but if you're even certain examples like planning a weekend or you can imagine how many things change along the way, you look for whether you may change your mind and you change the destination, or you want to catch a particular event and then you decide, no, I want this other event I want to go to."}, {"time": 740, "text": "So these dimensions of how many different steps are possible when you're conversing as a human with a machine makes it an extremely daunting problem."}, {"time": 749, "text": "And I think it is the ultimate test for intelligence."}, {"time": 752, "text": "And don't you think that natural language is enough to prove that conversation, just pure conversation?"}, {"time": 760, "text": "From a scientific standpoint, natural language is a great test, but I would go beyond, I don't want to limit it to as natural language as simply understanding an intent or parsing for entities and so forth."}, {"time": 772, "text": "We are really talking about dialogue."}, {"time": 774, "text": "Dialogue, yeah."}, {"time": 775, "text": "So I would say human machine dialogue is definitely one of the best tests of intelligence."}, {"time": 782, "text": "So can you briefly speak to the Alexa Prize for people who are not familiar with it, and also just maybe where things stand and what have you learned and what's surprising?"}, {"time": 795, "text": "What have you seen that's surprising from this incredible competition?"}, {"time": 798, "text": "Absolutely, it's a very exciting competition."}, {"time": 800, "text": "Alexa Prize is essentially a grand challenge in conversational artificial intelligence, where we threw the gauntlet to the universities who do active research in the field, to say, can you build what we call a social bot that can converse with you coherently and engagingly for 20 minutes?"}, {"time": 819, "text": "That is an extremely hard challenge, talking to someone who you're meeting for the first time, or even if you've met them quite often, to speak at 20 minutes on any topic, an evolving nature of topics is super hard."}, {"time": 837, "text": "We have completed two successful years of the competition."}, {"time": 841, "text": "The first was won with the University of Washington, second, the University of California."}, {"time": 845, "text": "We are in our third instance."}, {"time": 846, "text": "We have an extremely strong team of 10 cohorts, and the third instance of the Alexa Prize is underway now."}, {"time": 854, "text": "And we are seeing a constant evolution."}, {"time": 857, "text": "First year was definitely a learning."}, {"time": 858, "text": "It was a lot of things to be put together."}, {"time": 861, "text": "We had to build a lot of infrastructure to enable these universities to be able to build magical experiences and do high quality research."}, {"time": 871, "text": "Just a few quick questions, sorry for the interruption."}, {"time": 873, "text": "What does failure look like in the 20 minute session?"}, {"time": 877, "text": "So what does it mean to fail, not to reach the 20 minute mark?"}, {"time": 879, "text": "Oh, awesome question."}, {"time": 881, "text": "So there are one, first of all, I forgot to mention one more detail."}, {"time": 885, "text": "It's not just 20 minutes, but the quality of the conversation too that matters."}, {"time": 889, "text": "And the beauty of this competition before I answer that question on what failure means is first that you actually converse with millions and millions of customers as the social bots."}, {"time": 900, "text": "So during the judging phases, there are multiple phases, before we get to the finals, which is a very controlled judging in a situation where we bring in judges and we have interactors who interact with these social bots, that is a much more controlled setting."}, {"time": 915, "text": "But till the point we get to the finals, all the judging is essentially by the customers of Alexa."}, {"time": 922, "text": "And there you basically rate on a simple question, how good your experience was."}, {"time": 928, "text": "So that's where we are not testing for a 20 minute boundary being crossed, because you do want it to be very much like a clear cut, winner, be chosen, and it's an absolute bar."}, {"time": 940, "text": "So did you really break that 20 minute barrier is why we have to test it in a more controlled setting with actors, essentially interactors."}, {"time": 948, "text": "And see how the conversation goes."}, {"time": 950, "text": "So this is why it's a subtle difference between how it's being tested in the field with real customers versus in the lab to award the prize."}, {"time": 960, "text": "So on the latter one, what it means is that essentially there are three judges and two of them have to say this conversation has stalled, essentially."}, {"time": 973, "text": "And the judges are human experts."}, {"time": 975, "text": "Judges are human experts."}, {"time": 977, "text": "So this is in the third year."}, {"time": 979, "text": "So what's been the evolution?"}, {"time": 980, "text": "How far, so the DARPA challenge in the first year, the autonomous vehicles, nobody finished."}, {"time": 986, "text": "In the second year, a few more finished in the desert."}, {"time": 990, "text": "So how far along in this, I would say much harder challenge are we?"}, {"time": 996, "text": "This challenge has come a long way to the extent that we're definitely not close to the 20 minute barrier being with coherence and engaging conversation."}, {"time": 1004, "text": "I think we are still five to 10 years away in that horizon to complete that."}, {"time": 1009, "text": "But the progress is immense."}, {"time": 1011, "text": "Like what you're finding is the accuracy and what kind of responses these social bots generate is getting better and better."}, {"time": 1019, "text": "What's even amazing to see that now there's humor coming in."}, {"time": 1023, "text": "The bots are quite..."}, {"time": 1025, "text": "You know, you're talking about ultimate science of intelligence."}, {"time": 1029, "text": "I think humor is a very high bar in terms of what it takes to create humor."}, {"time": 1034, "text": "And I don't mean just being goofy."}, {"time": 1036, "text": "I really mean good sense of humor is also a sign of intelligence in my mind and something very hard to do."}, {"time": 1043, "text": "So these social bots are now exploring not only what we think of natural language abilities, but also personality attributes and aspects of when to inject an appropriate joke, when you don't know the domain, how you come back with something more intelligible so that you can continue the conversation."}, {"time": 1063, "text": "If you and I are talking about AI and we are domain experts, we can speak to it."}, {"time": 1067, "text": "But if you suddenly switch a topic to that I don't know of, how do I change the conversation?"}, {"time": 1072, "text": "So you're starting to notice these elements as well."}, {"time": 1075, "text": "And that's coming from partly by the nature of the 20 minute challenge that people are getting quite clever on how to really converse and essentially mask some of the understanding defects if they exist."}, {"time": 1089, "text": "So some of this, this is not Alexa, the product."}, {"time": 1092, "text": "This is somewhat for fun, for research, for innovation and so on."}, {"time": 1097, "text": "I have a question sort of in this modern era, there's a lot of, if you look at Twitter and Facebook and so on, there's discourse, public discourse going on and some things that are a little bit too edgy, people get blocked and so on."}, {"time": 1110, "text": "I'm just out of curiosity, are people in this context pushing the limits?"}, {"time": 1115, "text": "Is anyone using the F word?"}, {"time": 1117, "text": "Is anyone sort of pushing back sort of arguing, I guess I should say, as part of the dialogue to really draw people in?"}, {"time": 1128, "text": "First of all, let me just back up a bit in terms of why we are doing this, right?"}, {"time": 1132, "text": "So you said it's fun."}, {"time": 1134, "text": "I think fun is more part of the engaging part for customers."}, {"time": 1139, "text": "It is one of the most used skills as well in our skill store."}, {"time": 1144, "text": "But up that apart, the real goal was essentially what was happening is with a lot of AI research moving to industry, we felt that academia has the risk of not being able to have the same resources at disposal that we have, which is lots of data, massive computing power, and a clear ways to test these AI advances with real customer benefits."}, {"time": 1168, "text": "So we brought all these three together in the Alexa price."}, {"time": 1170, "text": "That's why it's one of my favorite projects in Amazon."}, {"time": 1173, "text": "And with that, the secondary effect is yes, it has become engaging for our customers as well."}, {"time": 1180, "text": "We're not there in terms of where we want it to be, right?"}, {"time": 1183, "text": "But it's a huge progress."}, {"time": 1185, "text": "But coming back to your question on how do the conversations evolve?"}, {"time": 1188, "text": "Yes, there is some natural attributes of what you said in terms of argument and some amount of swearing."}, {"time": 1194, "text": "The way we take care of that is that there is a sensitive filter we have built that sees keywords."}, {"time": 1200, "text": "It's more than keywords, a little more in terms of, of course, there's keyword based too, but there's more in terms of these words can be very contextual, as you can see, and also the topic can be something that you don't want a conversation to happen because this is a communal device as well."}, {"time": 1217, "text": "A lot of people use these devices."}, {"time": 1219, "text": "So we have put a lot of guardrails for the conversation to be more useful for advancing AI and not so much of these other issues you attributed what's happening in the AI field as well."}, {"time": 1232, "text": "Right, so this is actually a serious opportunity."}, {"time": 1235, "text": "I didn't use the right word, fun."}, {"time": 1236, "text": "I think it's an open opportunity to do some of the best innovation in conversational agents in the world."}, {"time": 1245, "text": "Why just universities?"}, {"time": 1249, "text": "Because as I said, I really felt Young minds."}, {"time": 1252, "text": "Young minds, it's also to, if you think about the other aspect of where the whole industry is moving with AI, there's a dearth of talent given the demands."}, {"time": 1264, "text": "So you do want universities to have a clear place where they can invent and research and not fall behind that they can't motivate students."}, {"time": 1273, "text": "Imagine all grad students left to industry like us or faculty members, which has happened too."}, {"time": 1282, "text": "So this is a way that if you're so passionate about the field where you feel industry and academia need to work well, this is a great example and a great way for universities to participate."}, {"time": 1295, "text": "So what do you think it takes to build a system that wins the Alexa Prize?"}, {"time": 1299, "text": "I think you have to start focusing on aspects of reasoning that it is, there are still more lookups of what intents customers asking for and responding to those rather than really reasoning about the elements of the conversation."}, {"time": 1348, "text": "Like if you just said, I learned this fun fact about Tom Brady rather than really say how he played the game the previous night, then the conversation is not really that intelligent."}, {"time": 1362, "text": "So you have to go to more reasoning elements of understanding the context of the dialogue and giving more appropriate responses, which tells you that we are still quite far because a lot of times it's more facts being looked up and something that's close enough as an answer, but not really the answer."}, {"time": 1382, "text": "So that is where the research needs to go more and actual true understanding and reasoning."}, {"time": 1388, "text": "And that's why I feel it's a great way to do it because you have an engaged set of users working to help these AI advances happen in this case."}, {"time": 1398, "text": "You mentioned customers, they're quite a bit, and there's a skill."}, {"time": 1402, "text": "What is the experience for the user that's helping?"}, {"time": 1406, "text": "So just to clarify, this isn't, as far as I understand, the Alexa, so this skill is a standalone for the Alexa Prize."}, {"time": 1413, "text": "I mean, it's focused on the Alexa Prize."}, {"time": 1415, "text": "It's not you ordering certain things on Amazon."}, {"time": 1417, "text": "Like, oh, we're checking the weather or playing Spotify, right?"}, {"time": 1420, "text": "This is a separate skill."}, {"time": 1422, "text": "And so you're focused on helping that, I don't know, how do people, how do customers think of it?"}, {"time": 1428, "text": "Are they having fun?"}, {"time": 1429, "text": "Are they helping teach the system?"}, {"time": 1432, "text": "What's the experience like?"}, {"time": 1433, "text": "I think it's both actually."}, {"time": 1434, "text": "And let me tell you how you invoke this skill."}, {"time": 1437, "text": "So all you have to say, Alexa, let's chat."}, {"time": 1440, "text": "And then the first time you say, Alexa, let's chat, it comes back with a clear message that you're interacting with one of those university social bots."}, {"time": 1448, "text": "And there's a clear, so you know exactly how you interact, right?"}, {"time": 1451, "text": "And that is why it's very transparent."}, {"time": 1454, "text": "You are being asked to help, right?"}, {"time": 1456, "text": "And we have a lot of mechanisms where as we are in the first phase of feedback phase, then you send a lot of emails to our customers and then they know that the team needs a lot of interactions to improve the accuracy of the system."}, {"time": 1473, "text": "So we know we have a lot of customers who really want to help these university bots and they're conversing with that."}, {"time": 1480, "text": "And some are just having fun with just saying, Alexa, let's chat."}, {"time": 1484, "text": "And also some adversarial behavior to see whether, how much do you understand as a social bot?"}, {"time": 1490, "text": "So I think we have a good, healthy mix of all three situations."}, {"time": 1493, "text": "So what is the, if we talk about solving the Alexa challenge, the Alexa prize, what's the data set of really engaging, pleasant conversations look like?"}, {"time": 1507, "text": "Because if we think of this as a supervised learning problem, I don't know if it has to be, but if it does, maybe you can comment on that."}, {"time": 1515, "text": "Do you think there needs to be a data set of what it means to be an engaging, successful, fulfilling conversation?"}, {"time": 1522, "text": "I think that's part of the research question here."}, {"time": 1524, "text": "This was, I think, we at least got the first part right, which is have a way for universities to build and test in a real world setting."}, {"time": 1535, "text": "Now you're asking in terms of the next phase of questions, which we are still, we're also asking, by the way, what does success look like from a optimization function?"}, {"time": 1545, "text": "That's what you're asking in terms of, we as researchers are used to having a great corpus of annotated data and then making, then sort of tune our algorithms on those, right?"}, {"time": 1557, "text": "And fortunately and unfortunately, in this world of Alexa prize, that is not the way we are going after it."}, {"time": 1565, "text": "So you have to focus more on learning based on life feedback."}, {"time": 1570, "text": "That is another element that's unique, where just not to, I started with giving you how you ingress and experience this capability as a customer."}, {"time": 1581, "text": "What happens when you're done?"}, {"time": 1583, "text": "So they ask you a simple question on a scale of one to five, how likely are you to interact with this social bot again?"}, {"time": 1591, "text": "That is a good feedback and customers can also leave more open ended feedback."}, {"time": 1597, "text": "And I think partly that to me is one part of the question you're asking, which I'm saying is a mental model shift that as researchers also, you have to change your mindset that this is not a DARPA evaluation or NSF funded study and you have a nice corpus."}, {"time": 1614, "text": "This is where it's real world."}, {"time": 1616, "text": "You have real data."}, {"time": 1618, "text": "The scale is amazing and that's a beautiful thing."}, {"time": 1621, "text": "And then the customer, the user can quit the conversation at any time."}, {"time": 1626, "text": "Exactly, the user can, that is also a signal for how good you were at that point."}, {"time": 1631, "text": "So, and then on a scale one to five, one to three, do they say how likely are you or is it just a binary?"}, {"time": 1638, "text": "One to five."}, {"time": 1640, "text": "Wow, okay, that's such a beautifully constructed challenge."}, {"time": 1644, "text": "You said the only way to make a smart assistant really smart is to give it eyes and let it explore the world."}, {"time": 1654, "text": "I'm not sure it might've been taken out of context, but can you comment on that?"}, {"time": 1658, "text": "Can you elaborate on that idea?"}, {"time": 1660, "text": "Is that I personally also find that idea super exciting from a social robotics, personal robotics perspective."}, {"time": 1666, "text": "Yeah, a lot of things do get taken out of context."}, {"time": 1668, "text": "This particular one was just as philosophical discussion we were having on terms of what does intelligence look like?"}, {"time": 1675, "text": "And the context was in terms of learning, I think just we said we as humans are empowered with many different sensory abilities."}, {"time": 1685, "text": "I do believe that eyes are an important aspect of it in terms of if you think about how we as humans learn, it is quite complex and it's also not unimodal that you are fed a ton of text or audio and you just learn that way."}, {"time": 1703, "text": "No, you learn by experience, you learn by seeing, you're taught by humans and we are very efficient in how we learn."}, {"time": 1713, "text": "Machines on the contrary are very inefficient on how they learn, especially these AIs."}, {"time": 1718, "text": "I think the next wave of research is going to be with less data, not just less human, not just with less labeled data, but also with a lot of weak supervision and where you can increase the learning rate."}, {"time": 1735, "text": "I don't mean less data in terms of not having a lot of data to learn from that we are generating so much data, but it is more about from a aspect of how fast can you learn?"}, {"time": 1744, "text": "So improving the quality of the data, the quality of data and the learning process."}, {"time": 1749, "text": "I think more on the learning process."}, {"time": 1751, "text": "I think we have to, we as humans learn with a lot of noisy data, right?"}, {"time": 1755, "text": "And I think that's the part that I don't think should change."}, {"time": 1761, "text": "What should change is how we learn, right?"}, {"time": 1763, "text": "So if you look at, you mentioned supervised learning, we have making transformative shifts from moving to more unsupervised, more weak supervision."}, {"time": 1771, "text": "Those are the key aspects of how to learn."}, {"time": 1774, "text": "And I think in that setting, I hope you agree with me that having other senses is very crucial in terms of how you learn."}, {"time": 1784, "text": "And from a machine learning perspective, which I hope we get a chance to talk to a few aspects that are fascinating there, but to stick on the point of sort of a body, an embodiment."}, {"time": 1796, "text": "So Alexa has a body."}, {"time": 1797, "text": "It has a very minimalistic, beautiful interface where there's a ring and so on."}, {"time": 1802, "text": "I mean, I'm not sure of all the flavors of the devices that Alexa lives on, but there's a minimalistic basic interface."}, {"time": 1813, "text": "And nevertheless, we humans, so I have a Roomba, I have all kinds of robots all over everywhere."}, {"time": 1818, "text": "So what do you think the Alexa of the future looks like if it begins to shift what his body looks like?"}, {"time": 1829, "text": "Maybe beyond the Alexa, what do you think are the different devices in the home as they start to embody their intelligence more and more?"}, {"time": 1836, "text": "What do you think that looks like?"}, {"time": 1838, "text": "Philosophically, a future, what do you think that looks like?"}, {"time": 1841, "text": "I think let's look at what's happening today."}, {"time": 1843, "text": "You mentioned, I think our devices as an Amazon devices, but I also wanted to point out Alexa is already integrated a lot of third party devices, which also come in lots of forms and shapes, some in robots, some in microwaves, some in appliances that you use in everyday life."}, {"time": 1862, "text": "So I think it's not just the shape Alexa takes in terms of form factors, but it's also where all it's available."}, {"time": 1873, "text": "And it's getting in cars, it's getting in different appliances in homes, even toothbrushes, right?"}, {"time": 1878, "text": "So I think you have to think about it as not a physical assistant."}, {"time": 1885, "text": "It will be in some embodiment, as you said, we already have these nice devices, but I think it's also important to think of it, it is a virtual assistant."}, {"time": 1895, "text": "It is superhuman in the sense that it is in multiple places at the same time."}, {"time": 1900, "text": "So I think the actual embodiment in some sense, to me doesn't matter."}, {"time": 1907, "text": "I think you have to think of it as not as human like and more of what its capabilities are that derive a lot of benefit for customers and how there are different ways to delight it and delight customers and different experiences."}, {"time": 1923, "text": "And I think I'm a big fan of it not being just human like, it should be human like in certain situations."}, {"time": 1931, "text": "Alexa price social bot in terms of conversation is a great way to look at it, but there are other scenarios where human like, I think is underselling the abilities of this AI."}, {"time": 1942, "text": "So if I could trivialize what we're talking about."}, {"time": 1946, "text": "So if you look at the way Steve Jobs thought about the interaction with the device that Apple produced, there was a extreme focus on controlling the experience by making sure there's only this Apple produced devices."}, {"time": 1960, "text": "You see the voice of Alexa being taking all kinds of forms depending on what the customers want."}, {"time": 1967, "text": "And that means it could be anywhere from the microwave to a vacuum cleaner to the home and so on the voice is the essential element of the interaction."}, {"time": 1977, "text": "I think voice is an essence, it's not all, but it's a key aspect."}, {"time": 1982, "text": "I think to your question in terms of, you should be able to recognize Alexa and that's a huge problem."}, {"time": 1990, "text": "I think in terms of a huge scientific problem, I should say like, what are the traits?"}, {"time": 1993, "text": "What makes it look like Alexa, especially in different settings and especially if it's primarily voice, what it is, but Alexa is not just voice either, right?"}, {"time": 2002, "text": "I mean, we have devices with a screen."}, {"time": 2005, "text": "Now you're seeing just other behaviors of Alexa."}, {"time": 2008, "text": "So I think we're in very early stages of what that means and this will be an important topic for the following years."}, {"time": 2014, "text": "But I do believe that being able to recognize and tell when it's Alexa versus it's not is going to be important from an Alexa perspective."}, {"time": 2023, "text": "I'm not speaking for the entire AI community, but I think attribution and as we go into more of understanding who did what, that identity of the AI is crucial in the coming world."}, {"time": 2038, "text": "I think from the broad AI community perspective, that's also a fascinating problem."}, {"time": 2042, "text": "So basically if I close my eyes and listen to the voice, what would it take for me to recognize that this is Alexa?"}, {"time": 2048, "text": "Or at least the Alexa that I've come to know from my personal experience in my home through my interactions that come through."}, {"time": 2054, "text": "Yeah, and the Alexa here in the US is very different than Alexa in UK and the Alexa in India, even though they are all speaking English or the Australian version."}, {"time": 2063, "text": "So again, so now think about when you go into a different culture, a different community, but you travel there, what do you recognize Alexa?"}, {"time": 2071, "text": "I think these are super hard questions actually."}, {"time": 2074, "text": "So there's a team that works on personality."}, {"time": 2076, "text": "So if we talk about those different flavors of what it means culturally speaking, India, UK, US, what does it mean to add?"}, {"time": 2084, "text": "So the problem that we just stated, it's just fascinating, how do we make it purely recognizable that it's Alexa, assuming that the qualities of the voice are not sufficient?"}, {"time": 2098, "text": "It's also the content of what is being said."}, {"time": 2102, "text": "How does the personality come into play?"}, {"time": 2104, "text": "What's that research gonna look like?"}, {"time": 2106, "text": "I mean, it's such a fascinating subject."}, {"time": 2108, "text": "We have some very fascinating folks who from both the UX background and human factors are looking at these aspects and these exact questions."}, {"time": 2116, "text": "But I'll definitely say it's not just how it sounds, the choice of words, the tone, not just, I mean, the voice identity of it, but the tone matters, the speed matters, how you speak, how you enunciate words, what choice of words are you using, how terse are you, or how lengthy in your explanations you are."}, {"time": 2140, "text": "All of these are factors."}, {"time": 2142, "text": "And you also, you mentioned something crucial that you may have personalized it, Alexa, to some extent in your homes or in the devices you are interacting with."}, {"time": 2153, "text": "So you, as your individual, how you prefer Alexa sounds can be different than how I prefer."}, {"time": 2161, "text": "And the amount of customizability you want to give is also a key debate we always have."}, {"time": 2167, "text": "But I do want to point out it's more than the voice actor that recorded and it sounds like that actor."}, {"time": 2174, "text": "It is more about the choices of words, the attributes of tonality, the volume in terms of how you raise your pitch and so forth."}, {"time": 2182, "text": "All of that matters."}, {"time": 2183, "text": "This is such a fascinating problem from a product perspective."}, {"time": 2187, "text": "I could see those debates just happening inside of the Alexa team of how much personalization do you do for the specific customer?"}, {"time": 2194, "text": "Because you're taking a risk if you over personalize."}, {"time": 2198, "text": "Because you don't, if you create a personality for a million people, you can test that better."}, {"time": 2206, "text": "You can create a rich, fulfilling experience that will do well."}, {"time": 2210, "text": "But the more you personalize it, the less you can test it, the less you can know that it's a great experience."}, {"time": 2216, "text": "So how much personalization, what's the right balance?"}, {"time": 2219, "text": "I think the right balance depends on the customer."}, {"time": 2221, "text": "Give them the control."}, {"time": 2222, "text": "So I'll say, I think the more control you give customers, the better it is for everyone."}, {"time": 2229, "text": "And I'll give you some key personalization features."}, {"time": 2233, "text": "I think we have a feature called Remember This, which is where you can tell Alexa to remember something."}, {"time": 2239, "text": "There you have an explicit sort of control in customer's hand because they have to say, Alexa, remember X, Y, Z."}, {"time": 2246, "text": "What kind of things would that be used for?"}, {"time": 2248, "text": "So you can like you, I have stored my tire specs for my car because it's so hard to go and find and see what it is, right?"}, {"time": 2256, "text": "When you're having some issues."}, {"time": 2258, "text": "I store my mileage plan numbers for all the frequent flyer ones where I'm sometimes just looking at it and it's not handy."}, {"time": 2266, "text": "So those are my own personal choices I've made for Alexa to remember something on my behalf, right?"}, {"time": 2272, "text": "So again, I think the choice was be explicit about how you provide that to a customer as a control."}, {"time": 2280, "text": "So I think these are the aspects of what you do."}, {"time": 2283, "text": "Like think about where we can use speaker recognition capabilities that it's, if you taught Alexa that you are Lex and this person in your household is person two, then you can personalize the experiences."}, {"time": 2297, "text": "Again, these are very in the CX customer experience patterns are very clear about and transparent when a personalization action is happening."}, {"time": 2310, "text": "And then you have other ways like you go through explicit control right now through your app that your multiple service providers, let's say for music, which one is your preferred one."}, {"time": 2319, "text": "So when you say play sting, depend on your whether you have preferred Spotify or Amazon music or Apple music, that the decision is made where to play it from."}, {"time": 2329, "text": "So what's Alexa's backstory from her perspective?"}, {"time": 2332, "text": "Is there, I remember just asking as probably a lot of us are just the basic questions about love and so on of Alexa, just to see what the answer would be."}, {"time": 2343, "text": "It feels like there's a little bit of a personality but not too much."}, {"time": 2352, "text": "Is Alexa have a metaphysical presence in this human universe we live in or is it something more ambiguous?"}, {"time": 2363, "text": "Is there a past?"}, {"time": 2365, "text": "Is there a birth?"}, {"time": 2366, "text": "Is there a family kind of idea even for joking purposes and so on?"}, {"time": 2371, "text": "I think, well, it does tell you if I think you, I should double check this but if you said when were you born, I think we do respond."}, {"time": 2379, "text": "I need to double check that but I'm pretty positive about it."}, {"time": 2381, "text": "I think you do actually because I think I've tested that."}, {"time": 2384, "text": "But that's like how I was born in your brand of champagne and whatever the year kind of thing, yeah."}, {"time": 2391, "text": "So in terms of the metaphysical, I think it's early."}, {"time": 2395, "text": "Does it have the historic knowledge about herself to be able to do that?"}, {"time": 2401, "text": "Maybe, have we crossed that boundary?"}, {"time": 2403, "text": "Not yet, right?"}, {"time": 2404, "text": "In terms of being, thank you."}, {"time": 2406, "text": "Have we thought about it quite a bit but I wouldn't say that we have come to a clear decision in terms of what it should look like."}, {"time": 2413, "text": "But you can imagine though, and I bring this back to the Alexa Prize social bot one, there you will start seeing some of that."}, {"time": 2421, "text": "Like these bots have their identity and in terms of that, you may find, this is such a great research topic that some academia team may think of these problems and start solving them too."}, {"time": 2435, "text": "So let me ask a question."}, {"time": 2438, "text": "It's kind of difficult, I think, but it feels, and fascinating to me because I'm fascinated with psychology."}, {"time": 2445, "text": "It feels that the more personality you have, the more dangerous it is in terms of a customer perspective of product."}, {"time": 2454, "text": "If you want to create a product that's useful."}, {"time": 2457, "text": "By dangerous, I mean creating an experience that upsets me."}, {"time": 2462, "text": "And so how do you get that right?"}, {"time": 2466, "text": "Because if you look at the relationships, maybe I'm just a screwed up Russian, but if you look at the human to human relationship, some of our deepest relationships have fights, have tension, have the push and pull, have a little flavor in them."}, {"time": 2482, "text": "Do you want to have such flavor in an interaction with Alexa?"}, {"time": 2488, "text": "So there's one other common thing that you didn't say, but we think of it as paramount for any deep relationship."}, {"time": 2495, "text": "That's trust."}, {"time": 2496, "text": "Trust, yeah."}, {"time": 2497, "text": "So I think if you trust every attribute you said, a fight, some tension, is all healthy."}, {"time": 2504, "text": "But what is sort of unnegotiable in this instance is trust."}, {"time": 2509, "text": "And I think the bar to earn customer trust for AI is very high, in some sense, more than a human."}, {"time": 2516, "text": "It's not just about personal information or your data."}, {"time": 2522, "text": "It's also about your actions on a daily basis."}, {"time": 2525, "text": "How trustworthy are you in terms of consistency, in terms of how accurate are you in understanding me?"}, {"time": 2531, "text": "Like if you're talking to a person on the phone, if you have a problem with your, let's say your internet or something, if the person's not understanding, you lose trust right away."}, {"time": 2539, "text": "You don't want to talk to that person."}, {"time": 2540, "text": "That whole example gets amplified by a factor of 10, because when you're a human interacting with an AI, you have a certain expectation."}, {"time": 2549, "text": "Either you expect it to be very intelligent and then you get upset, why is it behaving this way?"}, {"time": 2554, "text": "Or you expect it to be not so intelligent and when it surprises you, you're like, really, you're trying to be too smart?"}, {"time": 2560, "text": "So I think we grapple with these hard questions as well."}, {"time": 2563, "text": "But I think the key is actions need to be trustworthy."}, {"time": 2567, "text": "From these AIs, not just about data protection, your personal information protection, but also from how accurately it accomplishes all commands or all interactions."}, {"time": 2579, "text": "Well, it's tough to hear because trust, you're absolutely right, but trust is such a high bar with AI systems because people, and I see this because I work with autonomous vehicles."}, {"time": 2588, "text": "I mean, the bar that's placed on AI system is unreasonably high."}, {"time": 2593, "text": "Yeah, that is going to be, I agree with you."}, {"time": 2596, "text": "And I think of it as it's a challenge and it's also keeps my job, right?"}, {"time": 2603, "text": "So from that perspective, I totally, I think of it at both sides as a customer and as a researcher."}, {"time": 2610, "text": "I think as a researcher, yes, occasionally it will frustrate me that why is the bar so high for these AIs?"}, {"time": 2616, "text": "And as a customer, then I say, absolutely, it has to be that high, right?"}, {"time": 2620, "text": "So I think that's the trade off we have to balance, but it doesn't change the fundamentals."}, {"time": 2626, "text": "That trust has to be earned and the question then becomes is are we holding the AIs to a different bar in accuracy and mistakes than we hold humans?"}, {"time": 2636, "text": "That's going to be a great societal questions for years to come, I think for us."}, {"time": 2640, "text": "Well, one of the questions that we grapple as a society now that I think about a lot, I think a lot of people in the AI think about a lot and Alexis taking on head on is privacy."}, {"time": 2651, "text": "The reality is us giving over data to any AI system can be used to enrich our lives in profound ways."}, {"time": 2665, "text": "So if basically any product that does anything awesome for you, the more data it has, the more awesome things it can do."}, {"time": 2674, "text": "And yet on the other side, people imagine the worst case possible scenario of what can you possibly do with that data?"}, {"time": 2682, "text": "People, it's goes down to trust, as you said before."}, {"time": 2685, "text": "There's a fundamental distrust of, in certain groups of governments and so on."}, {"time": 2690, "text": "And depending on the government, depending on who's in power, depending on all these kinds of factors."}, {"time": 2695, "text": "And so here's Alexa in the middle of all of it in the home, trying to do good things for the customers."}, {"time": 2702, "text": "So how do you think about privacy in this context, the smart assistance in the home?"}, {"time": 2706, "text": "How do you maintain, how do you earn trust?"}, {"time": 2709, "text": "So as you said, trust is the key here."}, {"time": 2712, "text": "So you start with trust and then privacy is a key aspect of it."}, {"time": 2716, "text": "It has to be designed from very beginning about that."}, {"time": 2720, "text": "And we believe in two fundamental principles."}, {"time": 2723, "text": "One is transparency and second is control."}, {"time": 2726, "text": "So by transparency, I mean, when we build what is now called smart speaker or the first echo, we were quite judicious about making these right trade offs on customer's behalf, that it is pretty clear when the audio is being sent to cloud, the light ring comes on when it has heard you say the word wake word, and then the streaming happens, right?"}, {"time": 2749, "text": "So when the light ring comes up, we also had, we put a physical mute button on it, just so if you didn't want it to be listening, even for the wake word, then you turn the power button or the mute button on, and that disables the microphones."}, {"time": 2764, "text": "That's just the first decision on essentially transparency and control."}, {"time": 2769, "text": "Oh, then even when we launched, we gave the control in the hands of the customers that you can go and look at any of your individual utterances that is recorded and delete them anytime."}, {"time": 2779, "text": "And we've got to true to that promise, right?"}, {"time": 2782, "text": "So, and that is super, again, a great instance of showing how you have the control."}, {"time": 2789, "text": "Then we made it even easier."}, {"time": 2790, "text": "You can say, like I said, delete what I said today."}, {"time": 2793, "text": "So that is now making it even just more control in your hands with what's most convenient about this technology is voice."}, {"time": 2802, "text": "You delete it with your voice now."}, {"time": 2804, "text": "So these are the types of decisions we continually make."}, {"time": 2808, "text": "We just recently launched this feature called, what we think of it as, if you wanted humans not to review your data, because you've mentioned supervised learning, right?"}, {"time": 2819, "text": "So in supervised learning, humans have to give some annotation."}, {"time": 2823, "text": "And that also is now a feature where you can essentially, if you've selected that flag, your data will not be reviewed by a human."}, {"time": 2831, "text": "So these are the types of controls that we have to constantly offer with customers."}, {"time": 2838, "text": "So why do you think it bothers people so much that, so everything you just said is really powerful."}, {"time": 2846, "text": "So the control, the ability to delete, cause we collect, we have studies here running at MIT that collects huge amounts of data and people consent and so on."}, {"time": 2854, "text": "The ability to delete that data is really empowering and almost nobody ever asked to delete it, but the ability to have that control is really powerful."}, {"time": 2864, "text": "But still, there's these popular anecdote, anecdotal evidence that people say, they like to tell that, them and a friend were talking about something, I don't know, sweaters for cats."}, {"time": 2876, "text": "And all of a sudden they'll have advertisements for cat sweaters on Amazon."}, {"time": 2881, "text": "That's a popular anecdote as if something is always listening."}, {"time": 2885, "text": "What, can you explain that anecdote, that experience that people have?"}, {"time": 2889, "text": "What's the psychology of that?"}, {"time": 2891, "text": "What's that experience?"}, {"time": 2893, "text": "And can you, you've answered it, but let me just ask, is Alexa listening?"}, {"time": 2898, "text": "No, Alexa listens only for the wake word on the device."}, {"time": 2902, "text": "And the wake word is?"}, {"time": 2903, "text": "The words like Alexa, Amazon, Echo, but you only choose one at a time."}, {"time": 2909, "text": "So you choose one and it listens only for that on our devices."}, {"time": 2914, "text": "So that's first."}, {"time": 2915, "text": "From a listening perspective, we have to be very clear that it's just the wake word."}, {"time": 2918, "text": "So you said, why is there this anxiety, if you may?"}, {"time": 2922, "text": "It's because there's a lot of confusion, what it really listens to, right?"}, {"time": 2925, "text": "And I think it's partly on us to keep educating our customers and the general media more in terms of like how, what really happens."}, {"time": 2934, "text": "And we've done a lot of it."}, {"time": 2936, "text": "And our pages on information are clear, but still people have to have more, there's always a hunger for information and clarity."}, {"time": 2946, "text": "And we'll constantly look at how best to communicate."}, {"time": 2949, "text": "If you go back and read everything, yes, it states exactly that."}, {"time": 2953, "text": "And then people could still question it."}, {"time": 2955, "text": "And I think that's absolutely okay to question."}, {"time": 2957, "text": "What we have to make sure is that we are, because our fundamental philosophy is customer first, customer obsession is our leadership principle."}, {"time": 2967, "text": "If you put, as researchers, I put myself in the shoes of the customer, and all decisions in Amazon are made with that."}, {"time": 2975, "text": "And trust has to be earned, and we have to keep earning the trust of our customers in this setting."}, {"time": 2981, "text": "And to your other point on like, is there something showing up based on your conversations?"}, {"time": 2986, "text": "No, I think the answer is like, a lot of times when those experiences happen, you have to also know that, okay, it may be a winter season, people are looking for sweaters, right?"}, {"time": 2996, "text": "And it shows up on your amazon.com because it is popular."}, {"time": 2999, "text": "So there are many of these, you mentioned that personality or personalization, turns out we are not that unique either, right?"}, {"time": 3009, "text": "So those things we as humans start thinking, oh, must be because something was heard, and that's why this other thing showed up."}, {"time": 3016, "text": "The answer is no, probably it is just the season for sweaters."}, {"time": 3021, "text": "I'm not gonna ask you this question because people have so much paranoia."}, {"time": 3027, "text": "But let me just say from my perspective, I hope there's a day when customer can ask Alexa to listen all the time, to improve the experience, to improve because I personally don't see the negative because if you have the control and if you have the trust, there's no reason why I shouldn't be listening all the time to the conversations to learn more about you."}, {"time": 3048, "text": "Because ultimately, as long as you have control and trust, every data you provide to the device, that the device wants is going to be useful."}, {"time": 3060, "text": "And so to me, as a machine learning person, I think it worries me how sensitive people are about their data relative to how empowering it could be relative to how empowering it could be for the devices around them, how enriching it could be for their own life to improve the product."}, {"time": 3085, "text": "So I just, it's something I think about sort of a lot, how do we make that devices, obviously Alexa thinks about a lot as well."}, {"time": 3092, "text": "I don't know if you wanna comment on that, sort of, okay, have you seen, let me ask it in the form of a question, okay."}, {"time": 3098, "text": "Have you seen an evolution in the way people think about their private data in the previous several years?"}, {"time": 3106, "text": "So as we as a society get more and more comfortable to the benefits we get by sharing more data."}, {"time": 3113, "text": "First, let me answer that part and then I'll wanna go back to the other aspect you were mentioning."}, {"time": 3118, "text": "So as a society, on a general, we are getting more comfortable as a society."}, {"time": 3123, "text": "Doesn't mean that everyone is, and I think we have to respect that."}, {"time": 3127, "text": "I don't think one size fits all is always gonna be the answer for all, right?"}, {"time": 3134, "text": "So I think that's something to keep in mind in these."}, {"time": 3137, "text": "Going back to your, on what more magical experiences can be launched in these kinds of AI settings."}, {"time": 3146, "text": "I think again, if you give the control, we, it's possible certain parts of it."}, {"time": 3152, "text": "So we have a feature called follow up mode where you, if you turn it on and Alexa, after you've spoken to it, will open the mics again, thinking you will answer something again."}, {"time": 3164, "text": "Like if you're adding lists to your shopping item, so right, or a shopping list or to do list, you're not done."}, {"time": 3171, "text": "You want to keep, so in that setting, it's awesome that it opens the mic for you to say eggs and milk and then bread, right?"}, {"time": 3177, "text": "So these are the kinds of things which you can empower."}, {"time": 3179, "text": "So, and then another feature we have, which is called Alexa Guard."}, {"time": 3184, "text": "I said it only listens for the wake word, right?"}, {"time": 3187, "text": "But if you have, let's say you're going to say, like you leave your home and you want Alexa to listen for a couple of sound events like smoke alarm going off or someone breaking your glass, right?"}, {"time": 3199, "text": "So it's like just to keep your peace of mind."}, {"time": 3202, "text": "So you can say Alexa on guard or I'm away and then it can be listening for these sound events."}, {"time": 3209, "text": "And when you're home, you come out of that mode, right?"}, {"time": 3213, "text": "So this is another one where you again gave controls in the hands of the user or the customer and to enable some experience that is high utility and maybe even more delightful in the certain settings like follow up mode and so forth."}, {"time": 3226, "text": "And again, this general principle is the same, control in the hands of the customer."}, {"time": 3232, "text": "So I know we kind of started with a lot of philosophy and a lot of interesting topics and we're just jumping all over the place, but really some of the fascinating things that the Alexa team and Amazon is doing is in the algorithm side, the data side, the technology, the deep learning, machine learning and so on."}, {"time": 3248, "text": "So can you give a brief history of Alexa from the perspective of just innovation, the algorithms, the data of how it was born, how it came to be, how it's grown, where it is today?"}, {"time": 3262, "text": "Yeah, it start with in Amazon, everything starts with the customer and we have a process called working backwards."}, {"time": 3270, "text": "Alexa and more specifically than the product Echo, there was a working backwards document essentially that reflected what it would be, started with a very simple vision statement for instance that morphed into a full fledged document along the way changed into what all it can do, right?"}, {"time": 3291, "text": "But the inspiration was the Star Trek computer."}, {"time": 3294, "text": "So when you think of it that way, everything is possible, but when you launch a product, you have to start with some place."}, {"time": 3301, "text": "And when I joined, the product was already in conception and we started working on the far field speech recognition because that was the first thing to solve."}, {"time": 3310, "text": "By that we mean that you should be able to speak to the device from a distance."}, {"time": 3315, "text": "And in those days, that wasn't a common practice."}, {"time": 3318, "text": "And even in the previous research world I was in was considered to an unsolvable problem then in terms of whether you can converse from a length."}, {"time": 3328, "text": "And here I'm still talking about the first part of the problem where you say, get the attention of the device as in by saying what we call the wake word, which means the word Alexa has to be detected with a very high accuracy because it is a very common word."}, {"time": 3344, "text": "It has sound units that map with words like I like you or Alec, Alex, right?"}, {"time": 3351, "text": "So it's a undoubtedly hard problem to detect the right mentions of Alexa's address to the device versus I like Alexa."}, {"time": 3362, "text": "So you have to pick up that signal when there's a lot of noise."}, {"time": 3366, "text": "Not only noise but a lot of conversation in the house, right?"}, {"time": 3369, "text": "You remember on the device, you're simply listening for the wake word, Alexa."}, {"time": 3373, "text": "And there's a lot of words being spoken in the house."}, {"time": 3375, "text": "How do you know it's Alexa and directed at Alexa?"}, {"time": 3381, "text": "Because I could say, I love my Alexa, I hate my Alexa."}, {"time": 3385, "text": "I want Alexa to do this."}, {"time": 3387, "text": "And in all these three sentences, I said, Alexa, I didn't want it to wake up."}, {"time": 3392, "text": "Can I just pause on that second?"}, {"time": 3393, "text": "What would be your device that I should probably in the introduction of this conversation give to people in terms of them turning off their Alexa device if they're listening to this podcast conversation out loud?"}, {"time": 3409, "text": "Like what's the probability that an Alexa device will go off because we mentioned Alexa like a million times."}, {"time": 3415, "text": "So it will, we have done a lot of different things where we can figure out that there is the device, the speech is coming from a human versus over the air."}, {"time": 3428, "text": "Also, I mean, in terms of like, also it is think about ads or so we have also launched a technology for watermarking kind of approaches in terms of filtering it out."}, {"time": 3438, "text": "But yes, if this kind of a podcast is happening, it's possible your device will wake up a few times."}, {"time": 3444, "text": "It's an unsolved problem, but it is definitely something we care very much about."}, {"time": 3451, "text": "But the idea is you wanna detect Alexa."}, {"time": 3453, "text": "Meant for the device."}, {"time": 3456, "text": "First of all, just even hearing Alexa versus I like something."}, {"time": 3460, "text": "I mean, that's a fascinating part."}, {"time": 3461, "text": "So that was the first relief."}, {"time": 3463, "text": "That's the first."}, {"time": 3463, "text": "The world's best detector of Alexa."}, {"time": 3465, "text": "Yeah, the world's best wake word detector in a far field setting, not like something where the phone is sitting on the table."}, {"time": 3473, "text": "This is like people have devices 40 feet away like in my house or 20 feet away and you still get an answer."}, {"time": 3480, "text": "So that was the first part."}, {"time": 3482, "text": "The next is, okay, you're speaking to the device."}, {"time": 3485, "text": "Of course, you're gonna issue many different requests."}, {"time": 3513, "text": "So this is like a common household setting where the words you're speaking to Alexa need to be recognized with very high accuracy, right?"}, {"time": 3523, "text": "Now we are still just in the recognition problem."}, {"time": 3525, "text": "We haven't yet come to the understanding one, right?"}, {"time": 3528, "text": "And if I pause them, sorry, once again, what year was this?"}, {"time": 3531, "text": "Is this before neural networks began to start to seriously prove themselves in the audio space?"}, {"time": 3540, "text": "Yeah, this is around, so I joined in 2013 in April, right?"}, {"time": 3545, "text": "So the early research and neural networks coming back and showing some promising results in speech recognition space had started happening, but it was very early."}, {"time": 3555, "text": "But we just now build on that on the very first thing we did when I joined with the team."}, {"time": 3563, "text": "And remember, it was a very much of a startup environment, which is great about Amazon."}, {"time": 3568, "text": "And we doubled down on deep learning right away."}, {"time": 3571, "text": "And we knew we'll have to improve accuracy fast."}, {"time": 3576, "text": "And because of that, we worked on, and the scale of data, once you have a device like this, if it is successful, will improve big time."}, {"time": 3584, "text": "Like you'll suddenly have large volumes of data to learn from to make the customer experience better."}, {"time": 3591, "text": "So how do you scale deep learning?"}, {"time": 3592, "text": "So we did one of the first works in training with distributed GPUs and where the training time was linear in terms of the amount of data."}, {"time": 3603, "text": "So that was quite important work where it was algorithmic improvements as well as a lot of engineering improvements to be able to train on thousands and thousands of speech."}, {"time": 3614, "text": "And that was an important factor."}, {"time": 3615, "text": "So if you ask me like back in 2013 and 2014, when we launched Echo, the combination of large scale data, deep learning progress, near infinite GPUs we had available on AWS even then, was all came together for us to be able to solve the far field speech recognition to the extent it could be useful to the customers."}, {"time": 3640, "text": "It's still not solved."}, {"time": 3641, "text": "Like, I mean, it's not that we are perfect at recognizing speech, but we are great at it in terms of the settings that are in homes, right?"}, {"time": 3648, "text": "So, and that was important even in the early stages."}, {"time": 3650, "text": "So first of all, just even, I'm trying to look back at that time."}, {"time": 3654, "text": "If I remember correctly, it was, it seems like the task would be pretty daunting."}, {"time": 3661, "text": "So like, so we kind of take it for granted that it works now."}, {"time": 3666, "text": "Yes, you're right."}, {"time": 3667, "text": "So let me, like how, first of all, you mentioned startup."}, {"time": 3670, "text": "I wasn't familiar how big the team was."}, {"time": 3672, "text": "I kind of, cause I know there's a lot of really smart people working on it."}, {"time": 3676, "text": "So now it's a very, very large team."}, {"time": 3679, "text": "How big was the team?"}, {"time": 3680, "text": "How likely were you to fail in the eyes of everyone else?"}, {"time": 3684, "text": "And ourselves?"}, {"time": 3686, "text": "And yourself?"}, {"time": 3687, "text": "So like what?"}, {"time": 3688, "text": "I'll give you a very interesting anecdote on that."}, {"time": 3691, "text": "When I joined the team, the speech recognition team was six people."}, {"time": 3697, "text": "My first meeting, and we had hired a few more people, it was 10 people."}, {"time": 3702, "text": "Nine out of 10 people thought it can't be done."}, {"time": 3708, "text": "Who was the one?"}, {"time": 3710, "text": "The one was me, say, actually I should say, and one was semi optimistic."}, {"time": 3716, "text": "And eight were trying to convince, let's go to the management and say, let's not work on this problem."}, {"time": 3723, "text": "Let's work on some other problem, like either telephony speech for customer service calls and so forth."}, {"time": 3730, "text": "But this was the kind of belief you must have."}, {"time": 3732, "text": "And I had experience with far field speech recognition and my eyes lit up when I saw a problem like that saying, okay, we have been in speech recognition, always looking for that killer app."}, {"time": 3743, "text": "And this was a killer use case to bring something delightful in the hands of customers."}, {"time": 3748, "text": "So you mentioned the way you kind of think of it in the product way in the future, have a press release and an FAQ and you think backwards."}, {"time": 3755, "text": "Did you have, did the team have the echo in mind?"}, {"time": 3761, "text": "So this far field speech recognition, actually putting a thing in the home that works, that it's able to interact with, was that the press release?"}, {"time": 3768, "text": "What was the?"}, {"time": 3769, "text": "The way close, I would say, in terms of the, as I said, the vision was start a computer, right?"}, {"time": 3775, "text": "Or the inspiration."}, {"time": 3776, "text": "And from there, I can't divulge all the exact specifications, but one of the first things that was magical on Alexa was music."}, {"time": 3788, "text": "It brought me to back to music because my taste was still in when I was an undergrad."}, {"time": 3794, "text": "So I still listened to those songs and I, it was too hard for me to be a music fan with a phone, right?"}, {"time": 3801, "text": "So I, and I don't, I hate things in my ears."}, {"time": 3804, "text": "So from that perspective, it was quite hard and music was part of the, at least the documents I have seen, right?"}, {"time": 3813, "text": "So from that perspective, I think, yes, in terms of how far are we from the original vision?"}, {"time": 3820, "text": "I can't reveal that, but it's, that's why I have done a fun at work because every day we go in and thinking like, these are the new set of challenges to solve."}, {"time": 3829, "text": "Yeah, that's a great way to do great engineering as you think of the press release."}, {"time": 3833, "text": "I like that idea actually."}, {"time": 3835, "text": "Maybe we'll talk about it a bit later, but it's just a super nice way to have a focus."}, {"time": 3839, "text": "I'll tell you this, you're a scientist and a lot of my scientists have adopted that."}, {"time": 3843, "text": "They have now, they love it as a process because it was very, as scientists, you're trained to write great papers, but they are all after you've done the research or you've proven that and your PhD dissertation proposal is something that comes closest or a DARPA proposal or a NSF proposal is the closest that comes to a press release."}, {"time": 3863, "text": "But that process is now ingrained in our scientists, which is like delightful for me to see."}, {"time": 3870, "text": "You write the paper first and then make it happen."}, {"time": 3873, "text": "In fact, it's not."}, {"time": 3874, "text": "State of the art results."}, {"time": 3876, "text": "Or you leave the results section open where you have a thesis about here's what I expect, right?"}, {"time": 3881, "text": "And here's what it will change, right?"}, {"time": 3884, "text": "So I think it is a great thing."}, {"time": 3886, "text": "It works for researchers as well."}, {"time": 3889, "text": "So far field recognition."}, {"time": 3892, "text": "What was the big leap?"}, {"time": 3893, "text": "What were the breakthroughs and what was that journey like to today?"}, {"time": 3898, "text": "Yeah, I think the, as you said first, there was a lot of skepticism on whether far field speech recognition will ever work to be good enough, right?"}, {"time": 3906, "text": "And what we first did was got a lot of training data in a far field setting."}, {"time": 3911, "text": "And that was extremely hard to get because none of it existed."}, {"time": 3916, "text": "So how do you collect data in far field setup, right?"}, {"time": 3920, "text": "With no customer base at this time."}, {"time": 3921, "text": "With no customer base, right?"}, {"time": 3922, "text": "So that was first innovation."}, {"time": 3924, "text": "And once we had that, the next thing was, okay, if you have the data, first of all, we didn't talk about like, what would magical mean in this kind of a setting?"}, {"time": 3935, "text": "What is good enough for customers, right?"}, {"time": 3937, "text": "That's always, since you've never done this before, what would be magical?"}, {"time": 3941, "text": "So it wasn't just a research problem."}, {"time": 3944, "text": "You had to put some in terms of accuracy and customer experience features, some stakes on the ground saying, here's where I think it should get to."}, {"time": 3955, "text": "So you established a bar and then how do you measure progress towards given you have no customer right now."}, {"time": 3961, "text": "So from that perspective, we went, so first was the data without customers."}, {"time": 3967, "text": "Second was doubling down on deep learning as a way to learn."}, {"time": 3971, "text": "And I can just tell you that the combination of the two got our error rates by a factor of five."}, {"time": 3979, "text": "From where we were when I started to within six months of having that data, we, at that point, I got the conviction that this will work, right?"}, {"time": 3989, "text": "So, because that was magical in terms of when it started working and."}, {"time": 3994, "text": "That reached the magical bar."}, {"time": 3996, "text": "That came close to the magical bar."}, {"time": 3998, "text": "To the bar, right?"}, {"time": 3999, "text": "That we felt would be where people will use it."}, {"time": 4004, "text": "That was critical."}, {"time": 4005, "text": "Because you really have one chance at this."}, {"time": 4008, "text": "If we had launched in November 2014 is when we launched, if it was below the bar, I don't think this category exists if you don't meet the bar."}, {"time": 4018, "text": "Yeah, and just having looked at voice based interactions like in the car or earlier systems, it's a source of huge frustration for people."}, {"time": 4028, "text": "In fact, we use voice based interaction for collecting data on subjects to measure frustration."}, {"time": 4034, "text": "So, as a training set for computer vision, for face data, so we can get a data set of frustrated people."}, {"time": 4040, "text": "That's the best way to get frustrated people is having them interact with a voice based system in the car."}, {"time": 4045, "text": "So, that bar I imagine is pretty high."}, {"time": 4048, "text": "It was very high."}, {"time": 4049, "text": "And we talked about how also errors are perceived from AIs versus errors by humans."}, {"time": 4055, "text": "But we are not done with the problems that ended up, we had to solve to get it to launch."}, {"time": 4059, "text": "So, do you want the next one?"}, {"time": 4061, "text": "Yeah, the next one."}, {"time": 4062, "text": "So, the next one was what I think of as multi domain natural language understanding."}, {"time": 4102, "text": "And again, no customer base yet."}, {"time": 4104, "text": "Again, no customer base."}, {"time": 4106, "text": "So, now you're looking at meaning understanding and intent understanding and taking actions on behalf of customers."}, {"time": 4111, "text": "Based on their requests."}, {"time": 4113, "text": "And that is the next hard problem."}, {"time": 4116, "text": "Even if you have gotten the words recognized, how do you make sense of them?"}, {"time": 4122, "text": "In those days, there was still a lot of emphasis on rule based systems for writing grammar patterns to understand the intent."}, {"time": 4132, "text": "But we had a statistical first approach even then, where for our language understanding we had, and even those starting days, an entity recognizer and an intent classifier, which was all trained statistically."}, {"time": 4146, "text": "In fact, we had to build the deterministic matching as a follow up to fix bugs that statistical models have."}, {"time": 4154, "text": "So, it was just a different mindset where we focused on data driven statistical understanding."}, {"time": 4160, "text": "It wins in the end if you have a huge data set."}, {"time": 4162, "text": "Yes, it is contingent on that."}, {"time": 4164, "text": "And that's why it came back to how do you get the data."}, {"time": 4167, "text": "Before customers, the fact that this is why data becomes crucial to get to the point that you have the understanding system built up."}, {"time": 4177, "text": "And notice that for you, we were talking about human machine dialogue, and even those early days, even it was very much transactional, do one thing, one shot utterances in great way."}, {"time": 4190, "text": "There was a lot of debate on how much should Alexa talk back in terms of if you misunderstood it."}, {"time": 4195, "text": "If you misunderstood you or you said play songs by the stones, and let's say it doesn't know early days, knowledge can be sparse, who are the stones?"}, {"time": 4209, "text": "It's the Rolling Stones."}, {"time": 4212, "text": "And you don't want the match to be Stone Temple Pilots or Rolling Stones."}, {"time": 4217, "text": "So, you don't know which one it is."}, {"time": 4218, "text": "So, these kind of other signals, now there we had great assets from Amazon in terms of... UX, like what is it, what kind of... Yeah, how do you solve that problem?"}, {"time": 4231, "text": "In terms of what we think of it as an entity resolution problem, right?"}, {"time": 4234, "text": "So, because which one is it, right?"}, {"time": 4236, "text": "I mean, even if you figured out the stones as an entity, you have to resolve it to whether it's the stones or the Stone Temple Pilots or some other stones."}, {"time": 4244, "text": "Maybe I misunderstood, is the resolution the job of the algorithm or is the job of UX communicating with the human to help the resolution?"}, {"time": 4252, "text": "Well, there is both, right?"}, {"time": 4254, "text": "It is, you want 90% or high 90s to be done without any further questioning or UX, right?"}, {"time": 4261, "text": "So, but it's absolutely okay, just like as humans, we ask the question, I didn't understand you, Lex."}, {"time": 4269, "text": "It's fine for Alexa to occasionally say, I did not understand you, right?"}, {"time": 4272, "text": "And that's an important way to learn."}, {"time": 4274, "text": "And I'll talk about where we have come with more self learning with these kind of feedback signals."}, {"time": 4280, "text": "But in those days, just solving the ability of understanding the intent and resolving to an action where action could be play a particular artist or a particular song was super hard."}, {"time": 4291, "text": "Again, the bar was high as we were talking about, right?"}, {"time": 4295, "text": "So, while we launched it in sort of 13 big domains, I would say in terms of, we think of it as 13, the big skills we had, like music is a massive one when we launched it."}, {"time": 4307, "text": "And now we have 90,000 plus skills on Alexa."}, {"time": 4311, "text": "So, what are the big skills?"}, {"time": 4312, "text": "Can you just go over them?"}, {"time": 4313, "text": "Because the only thing I use it for is music, weather and shopping."}, {"time": 4318, "text": "So, we think of it as music information, right?"}, {"time": 4322, "text": "So, weather is a part of information, right?"}, {"time": 4325, "text": "So, when we launched, we didn't have smart home, but within, by smart home I mean, you connect your smart devices, you control them with voice."}, {"time": 4333, "text": "If you haven't done it, it's worth, it will change your life."}, {"time": 4335, "text": "Like turning on the lights and so on."}, {"time": 4336, "text": "Turning on your light to anything that's connected and has a, it's just that."}, {"time": 4341, "text": "What's your favorite smart device for you?"}, {"time": 4343, "text": "My light."}, {"time": 4344, "text": "And now you have the smart plug with, and you don't, we also have this echo plug, which is."}, {"time": 4349, "text": "Oh yeah, you can plug in anything."}, {"time": 4350, "text": "You can plug in anything and now you can turn that one on and off."}, {"time": 4353, "text": "I use this conversation motivation to get one."}, {"time": 4355, "text": "Garage door, you can check your status of the garage door and things like, and we have gone, make Alexa more and more proactive, where it even has hunches now, that, oh, looks, hunches, like you left your light on."}, {"time": 4370, "text": "Let's say you've gone to your bed and you left the garage light on."}, {"time": 4372, "text": "So it will help you out in these settings, right?"}, {"time": 4376, "text": "That's smart devices, information, smart devices."}, {"time": 4380, "text": "You said music."}, {"time": 4381, "text": "Yeah, so I don't remember everything we had, but alarms, timers were the big ones."}, {"time": 4385, "text": "Like that was, you know, the timers were very popular right away."}, {"time": 4389, "text": "Music also, like you could play song, artist, album, everything, and so that was like a clear win in terms of the customer experience."}, {"time": 4399, "text": "So that's, again, this is language understanding."}, {"time": 4402, "text": "Now things have evolved, right?"}, {"time": 4404, "text": "So where we want Alexa definitely to be more accurate, competent, trustworthy, based on how well it does these core things, but we have evolved in many different dimensions."}, {"time": 4415, "text": "First is what I think of are doing more conversational for high utility, not just for chat, right?"}, {"time": 4420, "text": "And there at Remars this year, which is our AI conference, we launched what is called Alexa Conversations."}, {"time": 4428, "text": "That is providing the ability for developers to author multi turn experiences on Alexa with no code, essentially, in terms of the dialogue code."}, {"time": 4438, "text": "Initially it was like, you know, all these IVR systems, you have to fully author if the customer says this, do that, right?"}, {"time": 4447, "text": "So the whole dialogue flow is hand authored."}, {"time": 4451, "text": "And with Alexa Conversations, the way it is that you just provide a sample interaction data with your service or your API, let's say your Atom tickets that provides a service for buying movie tickets."}, {"time": 4463, "text": "You provide a few examples of how your customers will interact with your APIs."}, {"time": 4467, "text": "And then the dialogue flow is automatically constructed using a record neural network trained on that data."}, {"time": 4473, "text": "So that simplifies the developer experience."}, {"time": 4475, "text": "We just launched our preview for the developers to try this capability out."}, {"time": 4480, "text": "And then the second part of it, which shows even increased utility for customers is you and I, when we interact with Alexa or any customer, as I'm coming back to our initial part of the conversation, the goal is often unclear or unknown to the AI."}, {"time": 4498, "text": "If I say, Alexa, what movies are playing nearby?"}, {"time": 4502, "text": "Am I trying to just buy movie tickets?"}, {"time": 4507, "text": "Am I actually even, do you think I'm looking for just movies for curiosity, whether the Avengers is still in theater or when is it?"}, {"time": 4515, "text": "Maybe it's gone and maybe it will come on my missed it."}, {"time": 4517, "text": "So I may watch it on Prime, right?"}, {"time": 4520, "text": "Which happened to me."}, {"time": 4521, "text": "So from that perspective now, you're looking into what is my goal?"}, {"time": 4527, "text": "And let's say I now complete the movie ticket purchase."}, {"time": 4531, "text": "Maybe I would like to get dinner nearby."}, {"time": 4535, "text": "So what is really the goal here?"}, {"time": 4538, "text": "Is it night out or is it movies?"}, {"time": 4541, "text": "As in just go watch a movie?"}, {"time": 4544, "text": "The answer is, we don't know."}, {"time": 4546, "text": "So can Alexa now figuratively have the intelligence that I think this meta goal is really night out or at least say to the customer when you've completed the purchase of movie tickets from Atom tickets or Fandango, or pick your anyone."}, {"time": 4561, "text": "Then the next thing is, do you want to get an Uber to the theater, right?"}, {"time": 4569, "text": "Or do you want to book a restaurant next to it?"}, {"time": 4572, "text": "And then not ask the same information over and over again, what time, how many people in your party, right?"}, {"time": 4582, "text": "So this is where you shift the cognitive burden from the customer to the AI."}, {"time": 4589, "text": "Where it's thinking of what is your, it anticipates your goal and takes the next best action to complete it."}, {"time": 4597, "text": "Now that's the machine learning problem."}, {"time": 4600, "text": "But essentially the way we solve this first instance, and we have a long way to go to make it scale to everything possible in the world."}, {"time": 4608, "text": "But at least for this situation, it is from at every instance, Alexa is making the determination, whether it should stick with the experience with Atom tickets or not."}, {"time": 4618, "text": "Or offer you based on what you say, whether either you have completed the interaction, or you said, no, get me an Uber now."}, {"time": 4627, "text": "So it will shift context into another experience or skill or another service."}, {"time": 4632, "text": "So that's a dynamic decision making."}, {"time": 4635, "text": "That's making Alexa, you can say more conversational for the benefit of the customer, rather than simply complete transactions, which are well thought through."}, {"time": 4644, "text": "You as a customer has fully specified what you want to be accomplished."}, {"time": 4649, "text": "It's accomplishing that."}, {"time": 4650, "text": "So it's kind of as we do this with pedestrians, like intent modeling is predicting what your possible goals are and what's the most likely goal and switching that depending on the things you say."}, {"time": 4662, "text": "So my question is there, it seems maybe it's a dumb question, but it would help a lot if Alexa remembered me, what I said previously."}, {"time": 4673, "text": "Is it trying to use some memories for the customer?"}, {"time": 4678, "text": "Yeah, it is using a lot of memory within that."}, {"time": 4680, "text": "So right now, not so much in terms of, okay, which restaurant do you prefer, right?"}, {"time": 4685, "text": "That is a more longterm memory, but within the short term memory, within the session, it is remembering how many people did you, so if you said buy four tickets, now it has made an implicit assumption that you were gonna have, you need at least four seats at a restaurant, right?"}, {"time": 4701, "text": "So these are the kind of context it's preserving between these skills, but within that session."}, {"time": 4706, "text": "But you're asking the right question in terms of for it to be more and more useful, it has to have more longterm memory and that's also an open question and again, these are still early days."}, {"time": 4717, "text": "So for me, I mean, everybody's different, but yeah, I'm definitely not representative of the general population in the sense that I do the same thing every day."}, {"time": 4727, "text": "Like I eat the same, I do everything the same, the same thing, wear the same thing clearly, this or the black shirt."}, {"time": 4735, "text": "So it's frustrating when Alexa doesn't get what I'm saying because I have to correct her every time in the exact same way."}, {"time": 4742, "text": "This has to do with certain songs, like she doesn't know certain weird songs I like and doesn't know, I've complained to Spotify about this, talked to the RD, head of RD at Spotify, it's their way to heaven."}, {"time": 4755, "text": "I have to correct it every time."}, {"time": 4756, "text": "It doesn't play Led Zeppelin correctly."}, {"time": 4758, "text": "It plays cover of Led's of Stairway to Heaven."}, {"time": 4762, "text": "So I'm."}, {"time": 4762, "text": "You should figure, you should send me your, next time it fails, feel free to send it to me, we'll take care of it."}, {"time": 4769, "text": "Because Led Zeppelin is one of my favorite brands, it works for me, so I'm like shocked it doesn't work for you."}, {"time": 4774, "text": "This is an official bug report."}, {"time": 4775, "text": "I'll put it, I'll make it public, I'll make everybody retweet it."}, {"time": 4779, "text": "We're gonna fix the Stairway to Heaven problem."}, {"time": 4780, "text": "Anyway, but the point is, you know, I'm pretty boring and do the same things, but I'm sure most people do the same set of things."}, {"time": 4788, "text": "Do you see Alexa sort of utilizing that in the future for improving the experience?"}, {"time": 4792, "text": "Yes, and not only utilizing, it's already doing some of it."}, {"time": 4796, "text": "We call it, where Alexa is becoming more self learning."}, {"time": 4799, "text": "So, Alexa is now auto correcting millions and millions of utterances in the US without any human supervision involved."}, {"time": 4808, "text": "The way it does it is, let's take an example of a particular song didn't work for you."}, {"time": 4814, "text": "What do you do next?"}, {"time": 4815, "text": "You either it played the wrong song and you said, Alexa, no, that's not the song I want."}, {"time": 4820, "text": "Or you say, Alexa play that, you try it again."}, {"time": 4825, "text": "And that is a signal to Alexa that she may have done something wrong."}, {"time": 4830, "text": "And from that perspective, we can learn if there's that failure pattern or that action of song A was played when song B was requested."}, {"time": 4841, "text": "And it's very common with station names because play NPR, you can have N be confused as an M. And then you, for a certain accent like mine, people confuse my N and M all the time."}, {"time": 4854, "text": "And because I have a Indian accent, they're confusable to humans."}, {"time": 4859, "text": "It is for Alexa too."}, {"time": 4861, "text": "And in that part, but it starts auto correcting and we collect, we correct a lot of these automatically without a human looking at the failures."}, {"time": 4872, "text": "So one of the things that's for me missing in Alexa, I don't know if I'm a representative customer, but every time I correct it, it would be nice to know that that made a difference."}, {"time": 4887, "text": "Like the sort of like, I heard you like a sort of."}, {"time": 4891, "text": "Some acknowledgement of that."}, {"time": 4893, "text": "We work a lot with Tesla, we study autopilot and so on."}, {"time": 4897, "text": "And a large amount of the customers that use Tesla autopilot, they feel like they're always teaching the system."}, {"time": 4903, "text": "They're almost excited by the possibility that they're teaching."}, {"time": 4905, "text": "I don't know if Alexa customers generally think of it as they're teaching to improve the system."}, {"time": 4911, "text": "And that's a really powerful thing."}, {"time": 4912, "text": "Again, I would say it's a spectrum."}, {"time": 4915, "text": "Some customers do think that way and some would be annoyed by Alexa acknowledging that."}, {"time": 4922, "text": "So there's, again, no one, while there are certain patterns, not everyone is the same in this way."}, {"time": 4928, "text": "But we believe that, again, customers helping Alexa is a tenet for us in terms of improving it."}, {"time": 4935, "text": "And some more self learning is by, again, this is like fully unsupervised, right?"}, {"time": 4940, "text": "There is no human in the loop and no labeling happening."}, {"time": 4943, "text": "And based on your actions as a customer, Alexa becomes smarter."}, {"time": 4949, "text": "Again, it's early days, but I think this whole area of teachable AI is gonna get bigger and bigger in the whole space, especially in the AI assistant space."}, {"time": 4960, "text": "So that's the second part where I mentioned more conversational."}, {"time": 4964, "text": "This is more self learning."}, {"time": 4966, "text": "The third is more natural."}, {"time": 4968, "text": "And the way I think of more natural is we talked about how Alexa sounds."}, {"time": 4973, "text": "And we have done a lot of advances in our text to speech by using, again, neural network technology for it to sound very humanlike."}, {"time": 4983, "text": "From the individual texture of the sound to the timing, the tonality, the tone, everything, the whole thing."}, {"time": 4989, "text": "I would think in terms of, there's a lot of controls in each of the places for how, I mean, the speed of the voice, the prosthetic patterns, the actual smoothness of how it sounds, all of those are factored and we do a ton of listening tests to make sure."}, {"time": 5007, "text": "But naturalness, how it sounds should be very natural."}, {"time": 5010, "text": "How it understands requests is also very important."}, {"time": 5013, "text": "And in terms of, we have 95,000 skills."}, {"time": 5017, "text": "And if we have, imagine that in many of these skills, you have to remember the skill name and say, Alexa, ask the tide skill to tell me X."}, {"time": 5031, "text": "Now, if you have to remember the skill name, that means the discovery and the interaction is unnatural."}, {"time": 5036, "text": "And we are trying to solve that by what we think of as, again, you don't have to have the app metaphor here."}, {"time": 5045, "text": "These are not individual apps, right?"}, {"time": 5047, "text": "Even though they're, so you're not sort of opening one at a time and interacting."}, {"time": 5051, "text": "So it should be seamless because it's voice."}, {"time": 5054, "text": "And when it's voice, you have to be able to understand these requests independent of the specificity, like a skill name."}, {"time": 5060, "text": "And to do that, what we have done is again, built a deep learning based capability where we shortlist a bunch of skills when you say, Alexa, get me a car."}, {"time": 5068, "text": "And then we figure it out, okay, it's meant for an Uber skill versus a Lyft or based on your preferences."}, {"time": 5074, "text": "And then you can rank the responses from the skill and then choose the best response for the customer."}, {"time": 5081, "text": "So that's on the more natural, other examples of more natural is like, we were talking about lists, for instance, and you don't wanna say, Alexa, add milk, Alexa, add eggs, Alexa, add cookies."}, {"time": 5095, "text": "No, Alexa, add cookies, milk, and eggs and that in one shot, right?"}, {"time": 5099, "text": "So that works, that helps with the naturalness."}, {"time": 5101, "text": "We talked about memory, like if you said, you can say, Alexa, remember I have to go to mom's house, or you may have entered a calendar event through your calendar that's linked to Alexa."}, {"time": 5113, "text": "You don't wanna remember whether it's in my calendar or did I tell you to remember something or some other reminder, right?"}, {"time": 5120, "text": "So you have to now, independent of how customers create these events, it should just say, Alexa, when do I have to go to mom's house?"}, {"time": 5129, "text": "And it tells you when you have to go to mom's house."}, {"time": 5132, "text": "Now that's a fascinating problem."}, {"time": 5133, "text": "Who's that problem on?"}, {"time": 5135, "text": "So there's people who create skills."}, {"time": 5138, "text": "Who's tasked with integrating all of that knowledge together so the skills become seamless?"}, {"time": 5144, "text": "Is it the creators of the skills or is it an infrastructure that Alexa provides problem?"}, {"time": 5151, "text": "It's both."}, {"time": 5152, "text": "I think the large problem in terms of making sure your skill quality is high, that has to be done by our tools, because it's just, so these skills, just to put the context, they are built through Alexa Skills Kit, which is a self serve way of building an experience on Alexa."}, {"time": 5171, "text": "This is like any developer in the world could go to Alexa Skills Kit and build an experience on Alexa."}, {"time": 5176, "text": "Like if you're a Domino's, you can build a Domino's Skills."}, {"time": 5180, "text": "For instance, that does pizza ordering."}, {"time": 5182, "text": "When you have authored that, you do want to now, if people say, Alexa, open Domino's or Alexa, ask Domino's to get a particular type of pizza, that will work, but the discovery is hard."}, {"time": 5197, "text": "You can't just say, Alexa, get me a pizza."}, {"time": 5199, "text": "And then Alexa figures out what to do."}, {"time": 5202, "text": "That latter part is definitely our responsibility in terms of when the request is not fully specific, how do you figure out what's the best skill or a service that can fulfill the customer's request?"}, {"time": 5216, "text": "And it can keep evolving."}, {"time": 5217, "text": "Imagine going to the situation I said, which was the night out planning, that the goal could be more than that individual request that came up."}, {"time": 5225, "text": "A pizza ordering could mean a night in, where you're having an event with your kids in their house, and you're, so this is, welcome to the world of conversational AI."}, {"time": 5236, "text": "This is super exciting because it's not the academic problem of NLP, of natural language processing, understanding, dialogue."}, {"time": 5243, "text": "This is like real world."}, {"time": 5244, "text": "And the stakes are high in the sense that customers get frustrated quickly, people get frustrated quickly."}, {"time": 5251, "text": "So you have to get it right, you have to get that interaction right."}, {"time": 5255, "text": "So it's, I love it."}, {"time": 5256, "text": "But so from that perspective, what are the challenges today?"}, {"time": 5261, "text": "What are the problems that really need to be solved in the next few years?"}, {"time": 5265, "text": "What's the focus?"}, {"time": 5266, "text": "First and foremost, as I mentioned, that get the basics right is still true."}, {"time": 5273, "text": "Basically, even the one shot requests, which we think of as transactional requests, needs to work magically, no question about that."}, {"time": 5281, "text": "If it doesn't turn your light on and off, you'll be super frustrated."}, {"time": 5285, "text": "Even if I can complete the night out for you and not do that, that is unacceptable as a customer, right?"}, {"time": 5290, "text": "So that you have to get the foundational understanding going very well."}, {"time": 5295, "text": "The second aspect when I said more conversational is as you imagine is more about reasoning."}, {"time": 5300, "text": "It is really about figuring out what the latent goal is of the customer based on what I have the information now and the history, what's the next best thing to do."}, {"time": 5311, "text": "So that's a complete reasoning and decision making problem."}, {"time": 5315, "text": "Just like your self driving car, but the goal is still more finite."}, {"time": 5318, "text": "Here it evolves, your environment is super hard and self driving and the cost of a mistake is huge here, but there are certain similarities."}, {"time": 5328, "text": "But if you think about how many decisions Alexa is making or evaluating at any given time, it's a huge hypothesis space."}, {"time": 5336, "text": "And we're only talked about so far about what I think of reactive decision in terms of you asked for something and Alexa is reacting to it."}, {"time": 5345, "text": "If you bring the proactive part, which is Alexa having hunches."}, {"time": 5350, "text": "So any given instance then it's really a decision at any given point based on the information."}, {"time": 5357, "text": "Alexa has to determine what's the best thing it needs to do."}, {"time": 5360, "text": "So these are the ultimate AI problem about decisions based on the information you have."}, {"time": 5365, "text": "Do you think, just from my perspective, I work a lot with sensing of the human face."}, {"time": 5371, "text": "Do you think they'll, and we touched this topic a little bit earlier, but do you think it'll be a day soon when Alexa can also look at you to help improve the quality of the hunch it has, or at least detect frustration or detect, improve the quality of its perception of what you're trying to do?"}, {"time": 5394, "text": "I mean, let me again bring back to what it already does."}, {"time": 5397, "text": "We talked about how based on you barge in over Alexa, clearly it's a very high probability it must have done something wrong."}, {"time": 5406, "text": "That's why you barged in."}, {"time": 5408, "text": "The next extension of whether frustration is a signal or not, of course, is a natural thought in terms of how that should be in a signal to it."}, {"time": 5418, "text": "You can get that from voice."}, {"time": 5419, "text": "You can get from voice, but it's very hard."}, {"time": 5421, "text": "Like, I mean, frustration as a signal historically, if you think about emotions of different kinds, there's a whole field of affective computing, something that MIT has also done a lot of research in, is super hard."}, {"time": 5435, "text": "And you are now talking about a far field device, as in you're talking to a distance noisy environment."}, {"time": 5441, "text": "And in that environment, it needs to have a good sense for your emotions."}, {"time": 5447, "text": "This is a very, very hard problem."}, {"time": 5449, "text": "Very hard problem, but you haven't shied away from hard problems."}, {"time": 5451, "text": "So, Deep Learning has been at the core of a lot of this technology."}, {"time": 5457, "text": "Are you optimistic about the current Deep Learning approaches to solving the hardest aspects of what we're talking about?"}, {"time": 5463, "text": "Or do you think there will come a time where new ideas need to further, if we look at reasoning, so OpenAI, DeepMind, a lot of folks are now starting to work in reasoning, trying to see how we can make neural networks reason."}, {"time": 5476, "text": "Do you see that new approaches need to be invented to take the next big leap?"}, {"time": 5483, "text": "Absolutely, I think there has to be a lot more investment."}, {"time": 5487, "text": "And I think in many different ways, and there are these, I would say, nuggets of research forming in a good way, like learning with less data or like zero short learning, one short learning."}, {"time": 5499, "text": "And the active learning stuff you've talked about is incredible stuff."}, {"time": 5503, "text": "So, transfer learning is also super critical, especially when you're thinking about applying knowledge from one task to another, or one language to another, right?"}, {"time": 5512, "text": "It's really ripe."}, {"time": 5512, "text": "So, these are great pieces."}, {"time": 5515, "text": "Deep learning has been useful too."}, {"time": 5516, "text": "And now we are sort of marrying deep learning with transfer learning and active learning."}, {"time": 5522, "text": "Of course, that's more straightforward in terms of applying deep learning and an active learning setup."}, {"time": 5526, "text": "But I do think in terms of now looking into more reasoning based approaches is going to be key for our next wave of the technology."}, {"time": 5539, "text": "But there is a good news."}, {"time": 5540, "text": "The good news is that I think for keeping on to delight customers, that a lot of it can be done by prediction tasks."}, {"time": 5547, "text": "So, we haven't exhausted that."}, {"time": 5550, "text": "So, we don't need to give up on the deep learning approaches for that."}, {"time": 5557, "text": "So, that's just I wanted to sort of point that out."}, {"time": 5559, "text": "Creating a rich, fulfilling, amazing experience that makes Amazon a lot of money and a lot of everybody a lot of money because it does awesome things, deep learning is enough."}, {"time": 5569, "text": "The point."}, {"time": 5571, "text": "I don't think, I wouldn't say deep learning is enough."}, {"time": 5574, "text": "I think for the purposes of Alexa accomplished the task for customers."}, {"time": 5578, "text": "I'm saying there are still a lot of things we can do with prediction based approaches that do not reason."}, {"time": 5585, "text": "I'm not saying that and we haven't exhausted those."}, {"time": 5588, "text": "But for the kind of high utility experiences that I'm personally passionate about of what Alexa needs to do, reasoning has to be solved to the same extent as you can think of natural language understanding and speech recognition to the extent of understanding intents has been how accurate it has become."}, {"time": 5610, "text": "But reasoning, we have very, very early days."}, {"time": 5612, "text": "Let me ask it another way."}, {"time": 5614, "text": "How hard of a problem do you think that is?"}, {"time": 5616, "text": "Hardest of them."}, {"time": 5619, "text": "I would say hardest of them because again, the hypothesis space is really, really large."}, {"time": 5627, "text": "And when you go back in time, like you were saying, I wanna, I want Alexa to remember more things that once you go beyond a session of interaction, which is by session, I mean a time span, which is today to versus remembering which restaurant I like."}, {"time": 5643, "text": "And then when I'm planning a night out to say, do you wanna go to the same restaurant?"}, {"time": 5647, "text": "Now you're up the stakes big time."}, {"time": 5649, "text": "And this is where the reasoning dimension also goes way, way bigger."}, {"time": 5654, "text": "So you think the space, we'll be elaborating that a little bit, just philosophically speaking, do you think when you reason about trying to model what the goal of a person is in the context of interacting with Alexa, you think that space is huge?"}, {"time": 5671, "text": "It's huge, absolutely huge."}, {"time": 5672, "text": "Do you think, so like another sort of devil's advocate would be that we human beings are really simple and we all want like just a small set of things."}, {"time": 5681, "text": "And so do you think it's possible?"}, {"time": 5684, "text": "Cause we're not talking about a fulfilling general conversation."}, {"time": 5689, "text": "Perhaps actually the Alexa prize is a little bit after that."}, {"time": 5693, "text": "Creating a customer, like there's so many of the interactions, it feels like are clustered in groups that are, don't require general reasoning."}, {"time": 5706, "text": "I think you're right in terms of the head of the distribution of all the possible things customers may wanna accomplish."}, {"time": 5713, "text": "But the tail is long and it's diverse, right?"}, {"time": 5718, "text": "So from that."}, {"time": 5719, "text": "There's many, many long tails."}, {"time": 5721, "text": "So from that perspective, I think you have to solve that problem otherwise, and everyone's very different."}, {"time": 5728, "text": "Like, I mean, we see this already in terms of the skills, right?"}, {"time": 5732, "text": "I mean, if you're an average surfer, which I am not, right?"}, {"time": 5736, "text": "But somebody is asking Alexa about surfing conditions, right?"}, {"time": 5741, "text": "And there's a skill that is there for them to get to, right?"}, {"time": 5745, "text": "That tells you that the tail is massive."}, {"time": 5747, "text": "Like in terms of like what kind of skills people have created, it's humongous in terms of it."}, {"time": 5754, "text": "And which means there are these diverse needs."}, {"time": 5756, "text": "And when you start looking at the combinations of these, right?"}, {"time": 5760, "text": "Even if you had pairs of skills and 90,000 choose two, it's still a big set of combinations."}, {"time": 5767, "text": "So I'm saying there's a huge to do here now."}, {"time": 5771, "text": "And I think customers are, you know, wonderfully frustrated with things."}, {"time": 5778, "text": "And they have to keep getting to do better things for them."}, {"time": 5781, "text": "And they're not known to be super patient."}, {"time": 5783, "text": "So you have to."}, {"time": 5784, "text": "Do it fast."}, {"time": 5785, "text": "You have to do it fast."}, {"time": 5786, "text": "So you've mentioned the idea of a press release, the research and development, Amazon Alexa and Amazon general, you kind of think of what the future product will look like."}, {"time": 5797, "text": "And you kind of make it happen."}, {"time": 5798, "text": "You work backwards."}, {"time": 5800, "text": "So can you draft for me, you probably already have one, but can you make up one for 10, 20, 30, 40 years out that you see the Alexa team putting out just in broad strokes, something that you dream about?"}, {"time": 5816, "text": "I think let's start with the five years first, right?"}, {"time": 5820, "text": "So, and I'll get to the 40 years too."}, {"time": 5823, "text": "Cause I'm pretty sure you have a real five year one."}, {"time": 5826, "text": "That's why I didn't want to, but yeah, in broad strokes, let's start with five years."}, {"time": 5830, "text": "I think the five year is where, I mean, I think of in these spaces, it's hard, especially if you're in the thick of things to think beyond the five year space, because a lot of things change, right?"}, {"time": 5840, "text": "I mean, if you ask me five years back, will Alexa will be here?"}, {"time": 5844, "text": "I wouldn't have, I think it has surpassed my imagination of that time, right?"}, {"time": 5849, "text": "So I think from the next five years perspective, from a AI perspective, what we're gonna see is that notion, which you said goal oriented dialogues and open domain like Alexa prize."}, {"time": 5862, "text": "I think that bridge is gonna get closed."}, {"time": 5865, "text": "They won't be different."}, {"time": 5866, "text": "And I'll give you why that's the case."}, {"time": 5868, "text": "You mentioned shopping."}, {"time": 5870, "text": "How do you shop?"}, {"time": 5872, "text": "Do you shop in one shot?"}, {"time": 5875, "text": "Sure, your double A batteries, paper towels."}, {"time": 5879, "text": "Yes, how long does it take for you to buy a camera?"}, {"time": 5884, "text": "You do ton of research, then you make a decision."}, {"time": 5887, "text": "So is that a goal oriented dialogue when somebody says, Alexa, find me a camera?"}, {"time": 5895, "text": "Is it simply inquisitiveness, right?"}, {"time": 5898, "text": "So even in the something that you think of it as shopping, which you said you yourself use a lot of, if you go beyond where it's reorders or items where you sort of are not brand conscious and so forth."}, {"time": 5913, "text": "So that was just in shopping."}, {"time": 5915, "text": "Just to comment quickly, I've never bought anything through Alexa that I haven't bought before on Amazon on the desktop after I clicked in a bunch of read a bunch of reviews, that kind of stuff."}, {"time": 5924, "text": "So it's repurchase."}, {"time": 5925, "text": "So now you think in, even for something that you felt like is a finite goal, I think the space is huge because even products, the attributes are many, and you wanna look at reviews, some on Amazon, some outside, some you wanna look at what CNET is saying or another consumer forum is saying about even a product for instance, right?"}, {"time": 5946, "text": "So that's just shopping where you could argue the ultimate goal is sort of known."}, {"time": 5953, "text": "And we haven't talked about Alexa, what's the weather in Cape Cod this weekend, right?"}, {"time": 5958, "text": "So why am I asking that weather question, right?"}, {"time": 5962, "text": "So I think of it as how do you complete goals with minimum steps for our customers, right?"}, {"time": 5970, "text": "And when you think of it that way, the distinction between goal oriented and conversations for open domain say goes away."}, {"time": 5978, "text": "I may wanna know what happened in the presidential debate, right?"}, {"time": 5983, "text": "And is it I'm seeking just information or I'm looking at who's winning the debates, right?"}, {"time": 5989, "text": "So these are all quite hard problems."}, {"time": 5993, "text": "So even the five year horizon problem, I'm like, I sure hope we'll solve these."}, {"time": 5999, "text": "And you're optimistic because that's a hard problem."}, {"time": 6003, "text": "Which part?"}, {"time": 6004, "text": "The reasoning enough to be able to help explore complex goals that are beyond something simplistic."}, {"time": 6012, "text": "That feels like it could be, well, five years is a nice."}, {"time": 6016, "text": "Is a nice bar for it, right?"}, {"time": 6018, "text": "I think you will, it's a nice ambition and do we have press releases for that?"}, {"time": 6023, "text": "Absolutely, can I tell you what specifically the roadmap will be?"}, {"time": 6028, "text": "And what, and will we solve all of it in the five year space?"}, {"time": 6031, "text": "No, this is, we'll work on this forever actually."}, {"time": 6035, "text": "This is the hardest of the AI problems and I don't see that being solved even in a 40 year horizon because even if you limit to the human intelligence, we know we are quite far from that."}, {"time": 6047, "text": "In fact, every aspects of our sensing to neural processing, to how brain stores information and how it processes it, we don't yet know how to represent knowledge, right?"}]}]