[{"title": "Ishan Misra: Self-Supervised Deep Learning in Computer Vision | Lex Fridman Podcast #206", "id": "FUS6ceIvUnI", "quotes": [{"time": 348, "text": "And maybe that perhaps is when Yann LeCun and you argue that unsupervised is the incorrect terminology here."}, {"time": 355, "text": "So what is the supervision signal when the humans aren't part of the picture or not a big part of the picture?"}, {"time": 362, "text": "Right, so self supervised, the reason that it has the term supervised in itself is because you're using the data itself as supervision."}, {"time": 370, "text": "So because the data serves as its own source of supervision, it's self supervised in that way."}, {"time": 375, "text": "Now, the reason a lot of people, I mean, we did it in that blog post with Yann, but a lot of other people have also argued for using this term self supervised."}, {"time": 382, "text": "So starting from like 94 from Virginia Desas group, I think UCSD, and now she's at UCSD."}, {"time": 388, "text": "Jeetendra Malik has said this a bunch of times as well."}, {"time": 391, "text": "So you have supervised, and then unsupervised basically means everything which is not supervised, but that includes stuff like semi supervised, that includes other like transductive learning, lots of other sort of settings."}, {"time": 403, "text": "So that's the reason like now people are preferring this term self supervised because it explicitly says what's happening."}, {"time": 409, "text": "The data itself is the source of supervision and any sort of learning algorithm which tries to extract just sort of data supervision signals from the data itself is a self supervised algorithm."}, {"time": 419, "text": "But there is within the data, a set of tricks which unlock the supervision."}, {"time": 425, "text": "So can you give maybe some examples and there's innovation ingenuity required to unlock that supervision."}, {"time": 432, "text": "The data doesn't just speak to you some ground truth, you have to do some kind of trick."}, {"time": 437, "text": "So I don't know what your favorite domain is."}, {"time": 439, "text": "So you specifically specialize in visual learning, but is there favorite examples, maybe in language or other domains?"}, {"time": 446, "text": "Perhaps the most successful applications have been in NLP, not language processing."}, {"time": 451, "text": "So the idea basically being that you can train models that can you have a sentence and you mask out certain words."}, {"time": 457, "text": "And now these models learn to predict the masked out words."}, {"time": 460, "text": "So if you have like the cat jumped over the dog, so you can basically mask out cat."}, {"time": 465, "text": "And now you're essentially asking the model to predict what was missing, what did I mask out?"}, {"time": 470, "text": "So the model is going to predict basically a distribution over all the possible words that it knows."}, {"time": 475, "text": "And probably it has like if it's a well trained model, it has a sort of higher probability density for this word cat."}, {"time": 482, "text": "For vision, I would say the sort of more, I mean, the easier example, which is not as widely used these days, is basically say, for example, video prediction."}, {"time": 492, "text": "So video is again, a sequence of things."}, {"time": 494, "text": "So you can ask the model, so if you have a video of say 10 seconds, you can feed in the first nine seconds to a model and then ask it, hey, what happens basically in the 10 second, can you predict what's going to happen?"}, {"time": 504, "text": "And the idea basically is because the model is predicting something about the data itself."}, {"time": 509, "text": "Of course, you didn't need any human to tell you what was happening because the 10 second video was naturally captured."}, {"time": 514, "text": "Because the model is predicting what's happening there, it's going to automatically learn something about the structure of the world, how objects move, object permanence, and these kinds of things."}, {"time": 524, "text": "So like, if I have something at the edge of the table, it will fall down."}, {"time": 527, "text": "Things like these, which you really don't have to sit and annotate."}, {"time": 530, "text": "In a supervised learning setting, I would have to sit and annotate."}, {"time": 532, "text": "This is a cup, now I move this cup, this is still a cup, and now I move this cup, it's still a cup, and then it falls down, and this is a fallen down cup."}, {"time": 538, "text": "So I won't have to annotate all of these things in a self supervised setting."}, {"time": 542, "text": "Isn't that kind of a brilliant little trick of taking a series of data that is consistent and removing one element in that series, and then teaching the algorithm to predict that element?"}, {"time": 557, "text": "Isn't that, first of all, that's quite brilliant."}, {"time": 560, "text": "It seems to be applicable in anything that has the constraint of being a sequence that is consistent with the physical reality."}, {"time": 570, "text": "The question is, are there other tricks like this that can generate the self supervision signal?"}, {"time": 577, "text": "So sequence is possibly the most widely used one in NLP."}, {"time": 581, "text": "For vision, the one that is actually used for images, which is very popular these days, is basically taking an image, and now taking different crops of that image."}, {"time": 590, "text": "So you can basically decide to crop, say the top left corner, and you crop, say the bottom right corner, and asking a network to basically present it with a choice, saying that, okay, now you have this image, you have this image, are these the same or not?"}, {"time": 604, "text": "And so the idea basically is that because different crop, like in an image, different parts of the image are going to be related."}, {"time": 609, "text": "So for example, if you have a chair and a table, basically these things are going to be close by, versus if you take, again, if you have like a zoomed in picture of a chair, if you're taking different crops, it's going to be different parts of the chair."}, {"time": 622, "text": "So the idea basically is that different crops of the image are related, and so the features or the representations that you get from these different crops should also be related."}, {"time": 630, "text": "So this is possibly the most like widely used trick these days for self supervised learning and computer vision."}, {"time": 635, "text": "So again, using the consistency that's inherent to physical reality in visual domain, that's, you know, parts of an image are consistent, and then in the language domain, or anything that has sequences, like language or something that's like a time series, then you can chop up parts in time."}, {"time": 655, "text": "It's similar to the story of RNNs and CNNs, of RNNs and ConvNets."}, {"time": 662, "text": "You and Yann LeCun wrote the blog post in March, 2021, titled, Self Supervised Learning, The Dark Matter of Intelligence."}, {"time": 671, "text": "Can you summarize this blog post and maybe explain the main idea or set of ideas?"}, {"time": 675, "text": "The blog post was mainly about sort of just telling, I mean, this is really a accepted fact, I would say for a lot of people now, that self supervised learning is something that is going to play an important role for machine learning algorithms that come in the future, and even now."}, {"time": 690, "text": "Let me just comment that we don't yet have a good understanding of what dark matter is."}, {"time": 697, "text": "So the idea basically being..."}, {"time": 700, "text": "So maybe the metaphor doesn't exactly transfer, but maybe it's actually perfectly transfers, that we don't know, we have an inkling that it'll be a big part of whatever solving intelligence looks like."}, {"time": 711, "text": "Right, so I think self supervised learning, the way it's done right now is, I would say like the first step towards what it probably should end up like learning or what it should enable us to do."}, {"time": 720, "text": "So the idea for that particular piece was, self supervised learning is going to be a very powerful way to learn common sense about the world, or like stuff that is really hard to label."}, {"time": 730, "text": "For example, like is this piece over here heavier than the cup?"}, {"time": 735, "text": "Now, for all these kinds of things, you'll have to sit and label these things."}, {"time": 738, "text": "So supervised learning is clearly not going to scale."}, {"time": 741, "text": "So what is the thing that's actually going to scale?"}, {"time": 743, "text": "It's probably going to be an agent that can either actually interact with it to lift it up, or observe me doing it."}, {"time": 749, "text": "So if I'm basically lifting these things up, it can probably reason about, hey, this is taking him more time to lift up, or the velocity is different, whereas the velocity for this is different, probably this one is heavier."}, {"time": 759, "text": "So essentially, by observations of the data, you should be able to infer a lot of things about the world without someone explicitly telling you, this is heavy, this is not, this is something that can pour, this is something that cannot pour, this is somewhere that you can sit, this is not somewhere that you can sit."}, {"time": 773, "text": "But you just mentioned ability to interact with the world."}, {"time": 777, "text": "There's so many questions that are yet, that are still open, which is, how do you select the set of data over which the self supervised learning process works?"}, {"time": 788, "text": "How much interactivity like in the active learning or the machine teaching context is there?"}, {"time": 794, "text": "What are the reward signals?"}, {"time": 796, "text": "Like how much actual interaction there is with the physical world?"}, {"time": 801, "text": "So that could be a huge question."}, {"time": 804, "text": "And then on top of that, which I have a million questions about, which we don't know the answers to, but it's worth talking about is, how much reasoning is involved?"}, {"time": 815, "text": "How much accumulation of knowledge versus something that's more akin to learning or whether that's the same thing."}, {"time": 823, "text": "But so we're like, it is truly dark matter."}, {"time": 826, "text": "We don't know how exactly to do it."}, {"time": 829, "text": "But we are, I mean, a lot of us are actually convinced that it's going to be a sort of major thing in machine learning."}, {"time": 835, "text": "So let me reframe it then, that human supervision cannot be at large scale the source of the solution to intelligence."}, {"time": 844, "text": "So the machines have to discover the supervision in the natural signal of the world."}, {"time": 850, "text": "I mean, the other thing is also that humans are not particularly good labelers."}, {"time": 854, "text": "They're not very consistent."}, {"time": 856, "text": "For example, like what's the difference between a dining table and a table?"}, {"time": 859, "text": "Is it just the fact that one, like if you just look at a particular table, what makes us say one is dining table and the other is not?"}, {"time": 866, "text": "Humans are not particularly consistent."}, {"time": 868, "text": "They're not like very good sources of supervision for a lot of these kinds of edge cases."}, {"time": 872, "text": "So it may be also the fact that if we want an algorithm or want a machine to solve a particular task for us, we can maybe just specify the end goal and like the stuff in between, we really probably should not be specifying because we're not maybe going to confuse it a lot actually."}, {"time": 889, "text": "Well, humans can't even answer the meaning of life."}, {"time": 891, "text": "So I'm not sure if we're good supervisors of the end goal either."}, {"time": 895, "text": "So let me ask you about categories."}, {"time": 896, "text": "Humans are not very good at telling the difference between what is and isn't a table, like you mentioned."}, {"time": 902, "text": "Do you think it's possible, let me ask you like pretend you're Plato."}, {"time": 910, "text": "Is it possible to create a pretty good taxonomy of objects in the world?"}, {"time": 916, "text": "It seems like a lot of approaches in machine learning kind of assume a hopeful vision that it's possible to construct a perfect taxonomy or it exists perhaps out of our reach, but we can always get closer and closer to it."}, {"time": 928, "text": "Or is that a hopeless pursuit?"}, {"time": 931, "text": "I think it's hopeless in some way."}, {"time": 933, "text": "So the thing is for any particular categorization that you create, if you have a discrete sort of categorization, I can always take the nearest two concepts or I can take a third concept and I can blend it in and I can create a new category."}, {"time": 944, "text": "So if you were to enumerate N categories, I will always find an N plus one category for you."}, {"time": 948, "text": "That's not going to be in the N categories."}, {"time": 950, "text": "And I can actually create not just N plus one, I can very easily create far more than N categories."}, {"time": 955, "text": "The thing is a lot of things we talk about are actually compositional."}, {"time": 958, "text": "So it's really hard for us to come and sit and enumerate all of these out."}, {"time": 963, "text": "And they compose in various weird ways, right?"}, {"time": 965, "text": "Like you have like a croissant and a donut come together to form a cronut."}, {"time": 969, "text": "So if you were to like enumerate all the foods up until, I don't know, whenever the cronut was about 10 years ago or 15 years ago, then this entire thing called cronut would not exist."}, {"time": 979, "text": "Yeah, I remember there was the most awesome video of a cat wearing a monkey costume."}, {"time": 986, "text": "People should look it up, it's great."}, {"time": 988, "text": "So is that a monkey or is that a cat?"}, {"time": 991, "text": "It's a very difficult philosophical question."}, {"time": 993, "text": "So there is a concept of similarity between objects."}, {"time": 997, "text": "So you think that can take us very far?"}, {"time": 999, "text": "Just kind of getting a good function, a good way to tell which parts of things are similar and which parts of things are very different."}, {"time": 1011, "text": "So you don't necessarily need to name everything or assign a name to everything to be able to use it, right?"}, {"time": 1017, "text": "So there are like lots of... Shakespeare said that, what's in a name?"}, {"time": 1021, "text": "What's in a name, yeah, okay."}, {"time": 1023, "text": "And I mean, lots of like, for example, animals, right?"}, {"time": 1025, "text": "They don't have necessarily a well formed like syntactic language, but they're able to go about their day perfectly."}, {"time": 1031, "text": "The same thing happens for us."}, {"time": 1032, "text": "So, I mean, we probably look at things and we figure out, oh, this is similar to something else that I've seen before."}, {"time": 1039, "text": "And then I can probably learn how to use it."}, {"time": 1042, "text": "So I haven't seen all the possible doorknobs in the world."}, {"time": 1046, "text": "But if you show me, like I was able to get into this particular place fairly easily, I've never seen that particular doorknob."}, {"time": 1052, "text": "So I of course related to all the doorknobs that I've seen and I know exactly how it's going to open."}, {"time": 1056, "text": "I have a pretty good idea of how it's going to open."}, {"time": 1059, "text": "And I think this kind of translation between experiences only happens because of similarity."}, {"time": 1063, "text": "Because I'm able to relate it to a doorknob."}, {"time": 1065, "text": "If I related it to a hairdryer, I would probably be stuck still outside, not able to get in."}, {"time": 1070, "text": "Again, a bit of a philosophical question, but can similarity take us all the way to understanding a thing?"}, {"time": 1078, "text": "Can having a good function that compares objects get us to understand something profound about singular objects?"}, {"time": 1087, "text": "I think I'll ask you a question back."}, {"time": 1088, "text": "What does it mean to understand objects?"}, {"time": 1091, "text": "Well, let me tell you what that's similar to."}, {"time": 1093, "text": "No, so there's an idea of sort of reasoning by analogy kind of thing."}, {"time": 1099, "text": "I think understanding is the process of placing that thing in some kind of network of knowledge that you have."}, {"time": 1108, "text": "That it perhaps is fundamentally related to other concepts."}, {"time": 1113, "text": "So it's not like understanding is fundamentally related by composition of other concepts and maybe in relation to other concepts."}, {"time": 1123, "text": "And maybe deeper and deeper understanding is maybe just adding more edges to that graph somehow."}, {"time": 1131, "text": "So maybe it is a composition of similarities."}, {"time": 1135, "text": "I mean, ultimately, I suppose it is a kind of embedding in that wisdom space."}, {"time": 1142, "text": "Yeah, okay, wisdom space is good."}, {"time": 1146, "text": "I think, I do think, right?"}, {"time": 1148, "text": "So similarity does get you very, very far."}, {"time": 1150, "text": "Is it the answer to everything?"}, {"time": 1152, "text": "I mean, I don't even know what everything is, but it's going to take us really far."}, {"time": 1156, "text": "And I think the thing is things are similar in very different contexts, right?"}, {"time": 1161, "text": "So an elephant is similar to, I don't know, another sort of wild animal."}, {"time": 1165, "text": "Let's just pick, I don't know, lion in a different way because they're both four legged creatures."}, {"time": 1170, "text": "They're also land animals."}, {"time": 1172, "text": "But of course they're very different in a lot of different ways."}, {"time": 1173, "text": "So elephants are like herbivores, lions are not."}, {"time": 1177, "text": "So similarity and particularly dissimilarity also actually helps us understand a lot about things."}, {"time": 1183, "text": "And so that's actually why I think discrete categorization is very hard."}, {"time": 1187, "text": "Just like forming this particular category of elephant and a particular category of lion, maybe it's good for just like taxonomy, biological taxonomies."}, {"time": 1195, "text": "But when it comes to other things which are not as maybe, for example, like grilled cheese, right?"}, {"time": 1201, "text": "I have a grilled cheese, I dip it in tomato and I keep it outside."}, {"time": 1203, "text": "Now, is that still a grilled cheese or is that something else?"}, {"time": 1206, "text": "Right, so categorization is still very useful for solving problems."}, {"time": 1211, "text": "But is your intuition then sort of the self supervised should be the, to borrow Jan Lekun's terminology, should be the cake and then categorization, the classification, maybe the supervised like layer should be just like the thing on top, the cherry or the icing or whatever."}, {"time": 1231, "text": "So if you make it the cake, it gets in the way of learning."}, {"time": 1235, "text": "If you make it the cake, then you won't be able to sit and annotate everything."}, {"time": 1239, "text": "That's as simple as it is."}, {"time": 1240, "text": "Like that's my very practical view on it."}, {"time": 1243, "text": "It's just, I mean, in my PhD, I sat down and annotated like a bunch of cards for one of my projects."}, {"time": 1248, "text": "And very quickly, I was just like, it was in a video and I was basically drawing boxes around all these cards."}, {"time": 1253, "text": "And I think I spent about a week doing all of that and I barely got anything done."}, {"time": 1257, "text": "And basically this was, I think my first year of my PhD or like a second year of my master's."}, {"time": 1262, "text": "And then by the end of it, I'm like, okay, this is just hopeless."}, {"time": 1265, "text": "I can keep doing it."}, {"time": 1265, "text": "And when I'd done that, someone came up to me and they basically told me, oh, this is a pickup truck."}, {"time": 1270, "text": "This is not a card."}, {"time": 1272, "text": "And that's when like, aha, this actually makes sense because a pickup truck is not really like, what was I annotating?"}, {"time": 1277, "text": "Was I annotating anything that is mobile or was I annotating particular sedans or was I annotating SUVs?"}, {"time": 1282, "text": "What was I doing?"}, {"time": 1283, "text": "By the way, the annotation was bounding boxes?"}, {"time": 1285, "text": "Bounding boxes, yeah."}, {"time": 1286, "text": "There's so many deep, profound questions here that you're almost cheating your way out of by doing self supervised learning, by the way, which is like, what makes for an object?"}, {"time": 1297, "text": "As opposed to solve intelligence, maybe you don't ever need to answer that question."}, {"time": 1302, "text": "I mean, this is the question that anyone that's ever done annotation because it's so painful gets to ask, like, why am I drawing very careful line around this object?"}, {"time": 1315, "text": "Like, what is the value?"}, {"time": 1317, "text": "I remember when I first saw semantic segmentation where you have like instant segmentation where you have a very exact line around the object in a 2D plane of a fundamentally 3D object projected on a 2D plane."}, {"time": 1333, "text": "So you're drawing a line around a car that might be occluded."}, {"time": 1336, "text": "There might be another thing in front of it, but you're still drawing the line of the part of the car that you see."}, {"time": 1343, "text": "How is that the car?"}, {"time": 1345, "text": "Why is that the car?"}, {"time": 1347, "text": "Like, I had like an existential crisis every time."}, {"time": 1351, "text": "Like, how's that going to help us understand a solved computer vision?"}, {"time": 1355, "text": "I'm not sure I have a good answer to what's better."}, {"time": 1358, "text": "And I'm not sure I share the confidence that you have that self supervised learning can take us far."}, {"time": 1408, "text": "Can I ask you just an out there question?"}, {"time": 1410, "text": "I remember, I think Andre Karpathy had a blog post about computer vision, like being really hard."}, {"time": 1419, "text": "I forgot what the title was, but it was many, many years ago."}, {"time": 1422, "text": "And he had, I think President Obama stepping on a scale and there was humor and there was a bunch of people laughing and whatever."}, {"time": 1428, "text": "And there's a lot of interesting things about that image and I think Andre highlighted a bunch of things about the image that us humans are able to immediately understand."}, {"time": 1439, "text": "Like the idea, I think of gravity and that you have the concept of a weight."}, {"time": 1444, "text": "You immediately project because of our knowledge of pose and how human bodies are constructed, you understand how the forces are being applied with the human body."}, {"time": 1454, "text": "The really interesting other thing that you're able to understand, there's multiple people looking at each other in the image."}, {"time": 1460, "text": "You're able to have a mental model of what the people are thinking about."}, {"time": 1463, "text": "You're able to infer like, oh, this person is probably thinks, like is laughing at how humorous the situation is."}, {"time": 1471, "text": "And this person is confused about what the situation is because they're looking this way."}, {"time": 1475, "text": "We're able to infer all of that."}, {"time": 1477, "text": "So that's human vision."}, {"time": 1481, "text": "How difficult is computer vision?"}, {"time": 1485, "text": "Like in order to achieve that level of understanding and maybe how big of a part does self supervised learning play in that, do you think?"}, {"time": 1494, "text": "And do you still, you know, back, that was like over a decade ago, I think Andre and I think a lot of people agreed is computer vision is really hard."}, {"time": 1503, "text": "Do you still think computer vision is really hard?"}, {"time": 1506, "text": "I think it is, yes."}, {"time": 1507, "text": "And getting to that kind of understanding, I mean, it's really out there."}, {"time": 1512, "text": "So if you ask me to solve just that particular problem, I can do it the supervised learning route."}, {"time": 1517, "text": "I can always construct a data set and basically predict, oh, is there humor in this or not?"}, {"time": 1521, "text": "And of course I can do it."}, {"time": 1522, "text": "Actually, that's a good question."}, {"time": 1523, "text": "Do you think you can, okay, okay."}, {"time": 1525, "text": "Do you think you can do human supervised annotation of humor?"}, {"time": 1529, "text": "To some extent, yes."}, {"time": 1529, "text": "I'm sure it will work."}, {"time": 1530, "text": "I mean, it won't be as bad as like randomly guessing."}, {"time": 1534, "text": "I'm sure it can still predict whether it's humorous or not in some way."}, {"time": 1537, "text": "Yeah, maybe like Reddit upvotes is the signal."}, {"time": 1541, "text": "I mean, it won't do a great job, but it'll do something."}, {"time": 1543, "text": "It may actually be like, it may find certain things which are not humorous, humorous as well, which is going to be bad for us."}, {"time": 1549, "text": "But I mean, it'll do, it won't be random."}, {"time": 1552, "text": "Yeah, kind of like my sense of humor."}, {"time": 1554, "text": "Okay, so fine."}, {"time": 1555, "text": "So you can, that particular problem, yes."}, {"time": 1557, "text": "But the general problem you're saying is hard."}, {"time": 1559, "text": "The general problem is hard."}, {"time": 1560, "text": "And I mean, self supervised learning is not the answer to everything."}, {"time": 1563, "text": "Of course it's not."}, {"time": 1564, "text": "I think if you have machines that are going to communicate with humans at the end of it, you want to understand what the algorithm is doing, right?"}, {"time": 1570, "text": "You want it to be able to produce an output that you can decipher, that you can understand, or it's actually useful for something else, which again is a human."}, {"time": 1579, "text": "So at some point in this sort of entire loop, a human steps in."}, {"time": 1583, "text": "And now this human needs to understand what's going on."}, {"time": 1586, "text": "And at that point, this entire notion of language or semantics really comes in."}, {"time": 1590, "text": "If the machine just spits out something and if we can't understand it, then it's not really that useful for us."}, {"time": 1596, "text": "So self supervised learning is probably going to be useful for a lot of the things before that part, before the machine really needs to communicate a particular kind of output with a human."}, {"time": 1606, "text": "Because, I mean, otherwise, how is it going to do that without language?"}, {"time": 1609, "text": "Or some kind of communication."}, {"time": 1611, "text": "But you're saying that it's possible to build a big base of understanding or whatever, of what's a better?"}, {"time": 1618, "text": "Of concepts."}, {"time": 1618, "text": "Concepts, yeah."}, {"time": 1619, "text": "Like common sense concepts."}, {"time": 1622, "text": "Supervised learning in the context of computer vision is something you've focused on, but that's a really hard domain."}, {"time": 1629, "text": "And it's kind of the cutting edge of what we're, as a community, working on today."}, {"time": 1633, "text": "Can we take a little bit of a step back and look at language?"}, {"time": 1636, "text": "Can you summarize the history of success of self supervised learning in natural language processing, language modeling?"}, {"time": 1643, "text": "What are transformers?"}, {"time": 1645, "text": "What is the masking, the sentence completion that you mentioned before?"}, {"time": 1651, "text": "How does it lead us to understand anything?"}, {"time": 1653, "text": "Semantic meaning of words, syntactic role of words and sentences?"}, {"time": 1657, "text": "So I'm, of course, not the expert on NLP."}, {"time": 1660, "text": "I kind of follow it a little bit from the sides."}, {"time": 1663, "text": "So the main sort of reason why all of this masking stuff works is, I think it's called the distributional hypothesis in NLP."}, {"time": 1670, "text": "The idea basically being that words that occur in the same context should have similar meaning."}, {"time": 1675, "text": "So if you have the blank jumped over the blank, it basically, whatever is like in the first blank is basically an object that can actually jump, is going to be something that can jump."}, {"time": 1685, "text": "So a cat or a dog, or I don't know, sheep, something, all of these things can basically be in that particular context."}, {"time": 1691, "text": "And now, so essentially the idea is that if you have words that are in the same context and you predict them, you're going to learn lots of useful things about how words are related, because you're predicting by looking at their context where the word is going to be."}, {"time": 1704, "text": "So in this particular case, the blank jumped over the fence."}, {"time": 1708, "text": "So now if it's a sheep, the sheep jumped over the fence, the dog jumped over the fence."}, {"time": 1712, "text": "So essentially the algorithm or the representation basically puts together these two concepts together."}, {"time": 1717, "text": "So it says, okay, dogs are going to be kind of related to sheep because both of them occur in the same context."}, {"time": 1722, "text": "Of course, now you can decide depending on your particular application downstream, you can say that dogs are absolutely not related to sheep because well, I don't, I really care about dog food, for example, I'm a dog food person and I really want to give this dog food to this particular animal."}, {"time": 1737, "text": "So depending on what your downstream application is, of course, this notion of similarity or this notion or this common sense that you've learned may not be applicable."}, {"time": 1745, "text": "But the point is basically that this, just predicting what the blanks are is going to take you really, really far."}, {"time": 1751, "text": "So there's a nice feature of language that the number of words in a particular language is very large, but it's finite and it's actually not that large in the grand scheme of things."}, {"time": 1764, "text": "I still got it because we take it for granted."}, {"time": 1766, "text": "So first of all, when you say masking, you're talking about this very process of the blank, of removing words from a sentence and then having the knowledge of what word went there in the initial data set, that's the ground truth that you're training on and then you're asking the neural network to predict what goes there."}, {"time": 1786, "text": "That's like a little trick."}, {"time": 1789, "text": "It's a really powerful trick."}, {"time": 1790, "text": "The question is how far that takes us."}, {"time": 1793, "text": "And the other question is, is there other tricks?"}, {"time": 1796, "text": "Because to me, it's very possible there's other very fascinating tricks."}, {"time": 1800, "text": "I'll give you an example in autonomous driving, there's a bunch of tricks that give you the self supervised signal back."}, {"time": 1810, "text": "For example, very similar to sentences, but not really, which is you have signals from humans driving the car because a lot of us drive cars to places."}, {"time": 1823, "text": "And so you can ask the neural network to predict what's going to happen the next two seconds for a safe navigation through the environment."}, {"time": 1833, "text": "And the signal comes from the fact that you also have knowledge of what happened in the next two seconds, because you have video of the data."}, {"time": 1842, "text": "The question in autonomous driving, as it is in language, can we learn how to drive autonomously based on that kind of self supervision?"}, {"time": 1853, "text": "Probably the answer is no."}, {"time": 1855, "text": "The question is how good can we get?"}, {"time": 1857, "text": "And the same with language, how good can we get?"}, {"time": 1860, "text": "And are there other tricks?"}, {"time": 1862, "text": "Like we get sometimes super excited by this trick that works really well."}, {"time": 1865, "text": "But I wonder, it's almost like mining for gold."}, {"time": 1869, "text": "I wonder how many signals there are in the data that could be leveraged that are like there."}, {"time": 1877, "text": "I just wanted to kind of linger on that because sometimes it's easy to think that maybe this masking process is self supervised learning."}, {"time": 1884, "text": "No, it's only one method."}, {"time": 1887, "text": "So there could be many, many other methods, many tricky methods, maybe interesting ways to leverage human computation in very interesting ways that might actually border on semi supervised learning, something like that."}, {"time": 1900, "text": "Obviously the internet is generated by humans at the end of the day."}, {"time": 1904, "text": "So all that to say is what's your sense in this particular context of language, how far can that masking process take us?"}, {"time": 1914, "text": "So it has stood the test of time, right?"}, {"time": 1916, "text": "I mean, so Word2vec, the initial sort of NLP technique that was using this to now, for example, like all the BERT and all these big models that we get, BERT and Roberta, for example, all of them are still sort of based on the same principle of masking."}, {"time": 1930, "text": "It's taken us really far."}, {"time": 1932, "text": "I mean, you can actually do things like, oh, these two sentences are similar or not, whether this particular sentence follows this other sentence in terms of logic, so entailment, you can do a lot of these things with just this masking trick."}, {"time": 1943, "text": "So I'm not sure if I can predict how far it can take us, because when it first came out, when Word2vec was out, I don't think a lot of us would have imagined that this would actually help us do some kind of entailment problems and really that well."}, {"time": 1958, "text": "And so just the fact that by just scaling up the amount of data that we're training on and using better and more powerful neural network architectures has taken us from that to this, is just showing you how maybe poor predictors we are, as humans, how poor we are at predicting how successful a particular technique is going to be."}, {"time": 1977, "text": "So I think I can say something now, but like 10 years from now, I look completely stupid basically predicting this."}, {"time": 1982, "text": "In the language domain, is there something in your work that you find useful and insightful and transferable to computer vision, but also just, I don't know, beautiful and profound that I think carries through to the vision domain?"}, {"time": 1998, "text": "I mean, the idea of masking has been very powerful."}, {"time": 2001, "text": "It has been used in vision as well for predicting, like you say, the next sort of if you have and sort of frames and you predict what's going to happen in the next frame."}, {"time": 2009, "text": "So that's been very powerful."}, {"time": 2010, "text": "In terms of modeling, like in just terms in terms of architecture, I think you would have asked about transformers a while back."}, {"time": 2016, "text": "That has really become like, it has become super exciting for computer vision now."}, {"time": 2020, "text": "Like in the past, I would say year and a half, it's become really powerful."}, {"time": 2024, "text": "What's a transformer?"}, {"time": 2026, "text": "I mean, the core part of a transformer is something called the self attention model."}, {"time": 2029, "text": "So it came out of Google and the idea basically is that if you have N elements, what you're creating is a way for all of these N elements to talk to each other."}, {"time": 2037, "text": "So the idea basically is that you are paying attention."}, {"time": 2041, "text": "Each element is paying attention to each of the other element."}, {"time": 2044, "text": "And basically by doing this, it's really trying to figure out, you're basically getting a much better view of the data."}, {"time": 2051, "text": "So for example, if you have a sentence of like four words, the point is if you get a representation or a feature for this entire sentence, it's constructed in a way such that each word has paid attention to everything else."}, {"time": 2063, "text": "Now, the reason it's like different from say, what you would do in a ConvNet is basically that in the ConvNet, you would only pay attention to a local window."}, {"time": 2071, "text": "So each word would only pay attention to its next neighbor or like one neighbor after that."}, {"time": 2076, "text": "And the same thing goes for images."}, {"time": 2077, "text": "In images, you would basically pay attention to pixels in a three cross three or a seven cross seven neighborhood."}, {"time": 2083, "text": "Whereas with the transformer, the self attention mainly, the sort of idea is that each element needs to pay attention to each other element."}, {"time": 2090, "text": "And when you say attention, maybe another way to phrase that is you're considering a context, a wide context in terms of the wide context of the sentence in understanding the meaning of a particular word and in computer vision that's understanding a larger context to understand the local pattern of a particular local part of an image."}, {"time": 2113, "text": "Right, so basically if you have say, again, a banana in the image, you're looking at the full image first."}, {"time": 2118, "text": "So whether it's like, you know, you're looking at all the pixels that are off a kitchen or for dining table and so on."}, {"time": 2123, "text": "And then you're basically looking at the banana also."}, {"time": 2125, "text": "Yeah, by the way, in terms of, if we were to train the funny classifier, there's something funny about the word banana."}, {"time": 2132, "text": "Just wanted to anticipate that."}, {"time": 2133, "text": "I am wearing a banana shirt, so yeah."}, {"time": 2136, "text": "Is there bananas on it?"}, {"time": 2139, "text": "Okay, so masking has worked for the vision context as well."}, {"time": 2142, "text": "And so this transformer idea has worked as well."}, {"time": 2144, "text": "So basically looking at all the elements to understand a particular element has been really powerful in vision."}, {"time": 2149, "text": "The reason is like a lot of things when you're looking at them in isolation."}, {"time": 2153, "text": "So if you look at just a blob of pixels, so Antonio Torralba at MIT used to have this like really famous image, which I looked at when I was a PhD student."}, {"time": 2161, "text": "But he would basically have a blob of pixels and he would ask you, hey, what is this?"}, {"time": 2164, "text": "And it looked basically like a shoe or like it could look like a TV remote."}, {"time": 2168, "text": "It could look like anything."}, {"time": 2170, "text": "And it turns out it was a beer bottle."}, {"time": 2172, "text": "But I'm not sure it was one of these three things, but basically he showed you the full picture and then it was very obvious what it was."}, {"time": 2177, "text": "But the point is just by looking at that particular local window, you couldn't figure it out."}, {"time": 2181, "text": "Because of resolution, because of other things, it's just not easy always to just figure it out by looking at just the neighborhood of pixels, what these pixels are."}, {"time": 2189, "text": "And the same thing happens for language as well."}, {"time": 2192, "text": "For the parameters that have to learn something about the data, you need to give it the capacity to learn the essential things."}, {"time": 2199, "text": "Like if it's not actually able to receive the signal at all, then it's not gonna be able to learn that signal."}, {"time": 2204, "text": "And in order to understand images, to understand language, you have to be able to see words in their full context."}, {"time": 2210, "text": "Okay, what is harder to solve, vision or language?"}, {"time": 2214, "text": "Visual intelligence or linguistic intelligence?"}, {"time": 2217, "text": "So I'm going to say computer vision is harder."}, {"time": 2219, "text": "My reason for this is basically that language of course has a big structure to it because we developed it."}, {"time": 2226, "text": "Whereas vision is something that is common in a lot of animals."}, {"time": 2229, "text": "Everyone is able to get by a lot of these animals on earth are actually able to get by without language."}, {"time": 2235, "text": "And a lot of these animals we also deem to be intelligent."}, {"time": 2238, "text": "So clearly intelligence does have like a visual component to it."}, {"time": 2242, "text": "And yes, of course, in the case of humans, it of course also has a linguistic component."}, {"time": 2246, "text": "But it means that there is something far more fundamental about vision than there is about language."}, {"time": 2250, "text": "And I'm sorry to anyone who disagrees, but yes, this is what I feel."}, {"time": 2254, "text": "So that's being a little bit reflected in the challenges that have to do with the progress of self supervised learning, would you say?"}, {"time": 2262, "text": "Or is that just a peculiar accidents of the progress of the AI community that we focused on like, or we discovered self attention and transformers in the context of language first?"}, {"time": 2273, "text": "So like the self supervised learning success was actually for vision has not much to do with the transformers part."}, {"time": 2279, "text": "I would say it's actually been independent a little bit."}, {"time": 2282, "text": "I think it's just that the signal was a little bit different for vision than there was for like NLP and probably NLP folks discovered it before."}, {"time": 2291, "text": "So for vision, the main success has basically been this like crops so far, like taking different crops of images."}, {"time": 2296, "text": "Whereas for NLP, it was this masking thing."}, {"time": 2298, "text": "But also the level of success is still much higher for language."}, {"time": 2302, "text": "So that has a lot to do with, I mean, I can get into a lot of details."}, {"time": 2306, "text": "For this particular question, let's go for it, okay."}, {"time": 2309, "text": "So the first thing is language is very structured."}, {"time": 2312, "text": "So you are going to produce a distribution over a finite vocabulary."}, {"time": 2315, "text": "English has a finite number of words."}, {"time": 2317, "text": "It's actually not that large."}, {"time": 2319, "text": "And you need to produce basically, when you're doing this masking thing, all you need to do is basically tell me which one of these like 50,000 words it is."}, {"time": 2327, "text": "Now for vision, let's imagine doing the same thing."}, {"time": 2329, "text": "Okay, we're basically going to blank out a particular part of the image and we ask the network or this neural network to predict what is present in this missing patch."}, {"time": 2338, "text": "It's combinatorially large, right?"}, {"time": 2339, "text": "You have 256 pixel values."}, {"time": 2342, "text": "If you're even producing basically a seven cross seven or a 14 cross 14 like window of pixels, at each of these 169 or each of these 49 locations, you have 256 values to predict."}, {"time": 2353, "text": "And so it's really, really large."}, {"time": 2355, "text": "And very quickly, the kind of like prediction problems that we're setting up are going to be extremely like interactable for us."}, {"time": 2362, "text": "And so the thing is for NLP, it has been really successful because we are very good at predicting, like doing this like distribution over a finite set."}, {"time": 2370, "text": "And the problem is when this set becomes really large, we are going to become really, really bad at making these predictions and at solving basically this particular set of problems."}, {"time": 2381, "text": "So if you were to do it exactly in the same way as NLP for vision, there is very limited success."}, {"time": 2387, "text": "The way stuff is working right now is actually not by predicting these masks."}, {"time": 2391, "text": "It's basically by saying that you take these two like crops from the image, you get a feature representation from it."}, {"time": 2397, "text": "And just saying that these two features, so they're like vectors, just saying that the distance between these vectors should be small."}, {"time": 2403, "text": "And so it's a very different way of learning from the visual signal than there is from NLP."}, {"time": 2409, "text": "Okay, the other reason is the distributional hypothesis that we talked about for NLP, right?"}, {"time": 2412, "text": "So a word given its context, basically the context actually supplies a lot of meaning to the word."}, {"time": 2418, "text": "Now, because there are just finite number of words and there is a finite way in like which we compose them."}, {"time": 2425, "text": "Of course, the same thing holds for pixels, but in language, there's a lot of structure, right?"}, {"time": 2429, "text": "So I always say whatever, the dash jumped over the fence, for example."}, {"time": 2433, "text": "There are lots of these sentences that you'll get."}, {"time": 2436, "text": "And from this, you can actually look at this particular sentence might occur in a lot of different contexts as well."}, {"time": 2441, "text": "This exact same sentence might occur in a different context."}, {"time": 2444, "text": "So the sheep jumped over the fence, the cat jumped over the fence, the dog jumped over the fence."}, {"time": 2448, "text": "So you immediately get a lot of these words, which are because this particular token itself has so much meaning, you get a lot of these tokens or these words, which are actually going to have sort of this related meaning across given this context."}, {"time": 2460, "text": "Whereas for vision, it's much harder because just by like pure, like the way we capture images, lighting can be different."}, {"time": 2467, "text": "There might be like different noise in the sensor."}, {"time": 2469, "text": "So the thing is you're capturing a physical phenomenon and then you're basically going through a very complicated pipeline of like image processing."}, {"time": 2476, "text": "And then you're translating that into some kind of like digital signal."}, {"time": 2480, "text": "Whereas with language, you write it down and you transfer it to a digital signal, almost like it's a lossless like transfer."}, {"time": 2487, "text": "And each of these tokens are very, very well defined."}, {"time": 2490, "text": "There could be a little bit of an argument there because language as written down is a projection of thought."}, {"time": 2499, "text": "This is one of the open questions is if you perfectly can solve language, are you getting close to being able to solve easily with flying colors past the towing test kind of thing."}, {"time": 2512, "text": "So that's, it's similar, but different and the computer vision problem is in the 2D plane is a projection with three dimensional world."}, {"time": 2522, "text": "So perhaps there are similar problems there."}, {"time": 2525, "text": "Maybe this is a good."}, {"time": 2526, "text": "I mean, I think what I'm saying is NLP is not easy."}, {"time": 2528, "text": "Of course, don't get me wrong."}, {"time": 2529, "text": "Like abstract thought expressed in knowledge or knowledge basically expressed in language is really hard to understand, right?"}, {"time": 2536, "text": "I mean, we've been communicating with language for so long and it is of course a very complicated concept."}, {"time": 2542, "text": "The thing is at least getting like somewhat reasonable, like being able to solve some kind of reasonable tasks with language, I would say slightly easier than it is with computer vision."}, {"time": 2553, "text": "Yeah, I would say, yeah."}, {"time": 2555, "text": "So that's well put."}, {"time": 2556, "text": "I would say getting impressive performance on language is easier."}, {"time": 2563, "text": "I feel like for both language and computer vision, there's going to be this wall of like, like this hump you have to overcome to achieve superhuman level performance or human level performance."}, {"time": 2576, "text": "And I feel like for language, that wall is farther away."}, {"time": 2580, "text": "So you can get pretty nice."}, {"time": 2581, "text": "You can do a lot of tricks."}, {"time": 2584, "text": "You can show really impressive performance."}, {"time": 2586, "text": "You can even fool people that you're tweeting or you write blog posts writing or your question answering has intelligence behind it."}, {"time": 2596, "text": "But to truly demonstrate understanding of dialogue, of continuous long form dialogue that would require perhaps big breakthroughs."}, {"time": 2608, "text": "In the same way in computer vision, I think the big breakthroughs need to happen earlier to achieve impressive performance."}, {"time": 2616, "text": "This might be a good place to, you already mentioned it, but what is contrastive learning and what are energy based models?"}, {"time": 2623, "text": "Contrastive learning is sort of the paradigm of learning where the idea is that you are learning this embedding space or so you're learning this sort of vector space of all your concepts."}, {"time": 2634, "text": "And the way you learn that is basically by contrasting."}, {"time": 2636, "text": "So the idea is that you have a sample, you have another sample that's related to it."}, {"time": 2641, "text": "So that's called the positive and you have another sample that's not related to it."}, {"time": 2645, "text": "So that's negative."}, {"time": 2646, "text": "So for example, let's just take an NLP or in a simple example in computer vision."}, {"time": 2650, "text": "So you have an image of a cat, you have an image of a dog and for whatever application that you're doing, say you're trying to figure out what the pets are, you're saying that these two images are related."}, {"time": 2660, "text": "So image of a cat and dog are related, but now you have another third image of a banana because you don't like that word."}, {"time": 2666, "text": "So now you basically have this banana."}, {"time": 2668, "text": "Thank you for speaking to the crowd."}, {"time": 2670, "text": "And so you take both of these images and you take the image from the cat, the image from the dog, you get a feature from both of them."}, {"time": 2676, "text": "And now what you're training the network to do is basically pull both of these features together while pushing them away from the feature of a banana."}, {"time": 2684, "text": "So this is the contrastive part."}, {"time": 2685, "text": "So you're contrasting against the banana."}, {"time": 2687, "text": "So there's always this notion of a negative and a positive."}, {"time": 2691, "text": "Now, energy based models are like one way that Jan sort of explains a lot of these methods."}, {"time": 2697, "text": "So Jan basically, I think a couple of years or more than that, like when I joined Facebook, Jan used to keep mentioning this word, energy based models."}, {"time": 2705, "text": "And of course I had no idea what he was talking about."}, {"time": 2707, "text": "So then one day I caught him in one of the conference rooms and I'm like, can you please tell me what this is?"}, {"time": 2711, "text": "So then like very patiently, he sat down with like a marker and a whiteboard."}, {"time": 2715, "text": "And his idea basically is that rather than talking about probability distributions, you can talk about energies of models."}, {"time": 2721, "text": "So models are trying to minimize certain energies in certain space, or they're trying to maximize a certain kind of energy."}, {"time": 2728, "text": "And the idea basically is that you can explain a lot of the contrastive models, GANs, for example, which are like Generative Adversarial Networks."}, {"time": 2736, "text": "A lot of these modern learning methods or VAEs, which are Variational Autoencoders, you can really explain them very nicely in terms of an energy function that they're trying to minimize or maximize."}, {"time": 2745, "text": "And so by putting this common sort of language for all of these models, what looks very different in machine learning that, oh, VAEs are very different from what GANs are, are very, very different from what contrastive models are, you actually get a sense of like, oh, these are actually very, very related."}, {"time": 2760, "text": "It's just that the way or the mechanism in which they're sort of maximizing or minimizing this energy function is slightly different."}, {"time": 2767, "text": "It's revealing the commonalities between all these approaches and putting a sexy word on top of it, like energy."}, {"time": 2773, "text": "And so similarities, two things that are similar have low energy."}, {"time": 2776, "text": "Like the low energy signifying similarity."}, {"time": 2781, "text": "So basically the idea is that if you were to imagine like the embedding as a manifold, a 2D manifold, you would get a hill or like a high sort of peak in the energy manifold, wherever two things are not related."}, {"time": 2792, "text": "And basically you would have like a dip where two things are related."}, {"time": 2795, "text": "So you'd get a dip in the manifold."}, {"time": 2797, "text": "And in the self supervised context, how do you know two things are related and two things are not related?"}, {"time": 2804, "text": "So this is where all the sort of ingenuity or tricks comes in, right?"}, {"time": 2807, "text": "So for example, like you can take the fill in the blank problem, or you can take in the context problem."}, {"time": 2814, "text": "And what you can say is two words that are in the same context are related."}, {"time": 2817, "text": "Two words that are in different contexts are not related."}, {"time": 2820, "text": "For images, basically two crops from the same image are related."}, {"time": 2823, "text": "And whereas a third image is not related at all."}, {"time": 2826, "text": "Or for a video, it can be two frames from that video are related because they're likely to contain the same sort of concepts in them."}, {"time": 2832, "text": "Whereas a third frame from a different video is not related."}, {"time": 2835, "text": "So it basically is, it's a very general term."}, {"time": 2838, "text": "Contrastive learning is nothing really to do with self supervised learning."}, {"time": 2840, "text": "It actually is very popular in for example, like any kind of metric learning or any kind of embedding learning."}, {"time": 2846, "text": "So it's also used in supervised learning."}, {"time": 2848, "text": "And the thing is because we are not really using labels to get these positive or negative pairs, it can basically also be used for self supervised learning."}, {"time": 2857, "text": "So you mentioned one of the ideas in the vision context that works is to have different crops."}, {"time": 2865, "text": "So you could think of that as a way to sort of manipulating the data to generate examples that are similar."}, {"time": 2873, "text": "Obviously, there's a bunch of other techniques."}, {"time": 2875, "text": "You mentioned lighting as a very, in images lighting is something that varies a lot and you can artificially change those kinds of things."}, {"time": 2884, "text": "There's the whole broad field of data augmentation, which manipulates images in order to increase arbitrarily the size of the data set."}, {"time": 2893, "text": "First of all, what is data augmentation?"}, {"time": 2895, "text": "And second of all, what's the role of data augmentation in self supervised learning and contrastive learning?"}, {"time": 2902, "text": "So data augmentation is just a way like you said, it's basically a way to augment the data."}, {"time": 2906, "text": "So you have say n samples."}, {"time": 2908, "text": "And what you do is you basically define some kind of transforms for the sample."}, {"time": 2912, "text": "So you take your say image and then you define a transform where you can just increase say the colors like the colors or the brightness of the image or increase or decrease the contrast of the image for example, or take different crops of it."}, {"time": 2924, "text": "So data augmentation is just a process to like basically perturb the data or like augment the data, right?"}, {"time": 2931, "text": "And so it has played a fundamental role for computer vision for self supervised learning especially."}, {"time": 2936, "text": "The way most of the current methods work contrastive or otherwise is by taking an image in the case of images is by taking an image and then computing basically two perturbations of it."}, {"time": 2948, "text": "So these can be two different crops of the image with like different types of lighting or different contrast or different colors."}, {"time": 2955, "text": "So you jitter the colors a little bit and so on."}, {"time": 2957, "text": "And now the idea is basically because it's the same object or because it's like related concepts in both of these perturbations, you want the features from both of these perturbations to be similar."}, {"time": 2968, "text": "So now you can use a variety of different ways to enforce this constraint, like these features being similar."}, {"time": 2974, "text": "You can do this by contrastive learning."}, {"time": 2976, "text": "So basically, both of these things are positives, a third sort of image is negative."}, {"time": 2980, "text": "You can do this basically by like clustering."}, {"time": 2983, "text": "For example, you can say that both of these images should, the features from both of these images should belong in the same cluster because they're related, whereas image like another image should belong to a different cluster."}, {"time": 2993, "text": "So there's a variety of different ways to basically enforce this particular constraint."}, {"time": 2997, "text": "By the way, when you say features, it means there's a very large neural network that extracting patterns from the image and the kind of patterns that extracts should be either identical or very similar."}, {"time": 3008, "text": "That's what that means."}, {"time": 3009, "text": "So the neural network basically takes in the image and then outputs a set of like, basically a vector of like numbers, and that's the feature."}, {"time": 3017, "text": "And you want this feature for both of these like different crops that you computed to be similar."}, {"time": 3022, "text": "So you want this vector to be identical in its like entries, for example."}, {"time": 3026, "text": "Be like literally close in this multi dimensional space to each other."}, {"time": 3031, "text": "And like you said, close can mean part of the same cluster or something like that in this large space."}, {"time": 3037, "text": "First of all, that, I wonder if there is connection to the way humans learn to this, almost like maybe subconsciously, in order to understand a thing, you kind of have to see it from two, three multiple angles."}, {"time": 3054, "text": "I wonder, I have a lot of friends who are neuroscientists maybe and cognitive scientists."}, {"time": 3060, "text": "I wonder if that's in there somewhere."}, {"time": 3063, "text": "Like in order for us to place a concept in its proper place, we have to basically crop it in all kinds of ways, do basic data augmentation on it in whatever very clever ways that the brain likes to do."}, {"time": 3079, "text": "Like spinning around in our minds somehow that that is very effective."}, {"time": 3083, "text": "So I think for some of them, we like need to do it."}, {"time": 3085, "text": "So like babies, for example, pick up objects, like move them and put them close to their eye and whatnot."}, {"time": 3090, "text": "But for certain other things, actually we are good at imagining it as well, right?"}, {"time": 3093, "text": "So if you, I have never seen, for example, an elephant from the top."}, {"time": 3096, "text": "I've never basically looked at it from like top down."}, {"time": 3099, "text": "But if you showed me a picture of it, I could very well tell you that that's an elephant."}, {"time": 3103, "text": "So I think some of it, we're just like, we naturally build it or transfer it from other objects that we've seen to imagine what it's going to look like."}, {"time": 3110, "text": "Has anyone done that with augmentation?"}, {"time": 3113, "text": "Like imagine all the possible things that are occluded or not there, but not just like normal things, like wild things, but they're nevertheless physically consistent."}, {"time": 3126, "text": "So, I mean, people do kind of like occlusion based augmentation as well."}, {"time": 3131, "text": "So you place in like a random like box, gray box to sort of mask out a certain part of the image."}, {"time": 3137, "text": "And the thing is basically you're kind of occluding it."}, {"time": 3140, "text": "For example, you place it say on half of a person's face."}, {"time": 3143, "text": "So basically saying that, you know, something below their nose is occluded because it's grayed out."}, {"time": 3148, "text": "So, you know, I meant like, you have like, what is it?"}, {"time": 3151, "text": "A table and you can't see behind the table."}, {"time": 3153, "text": "And you imagine there's a bunch of elves with bananas behind the table."}, {"time": 3158, "text": "Like, I wonder if there's useful to have a wild imagination for the network because that's possible or maybe not elves, but like puppies and kittens or something like that."}, {"time": 3169, "text": "Just have a wild imagination and like constantly be generating that wild imagination."}, {"time": 3175, "text": "Because in terms of data augmentation, as currently applied, it's super ultra, very boring."}, {"time": 3181, "text": "It's very basic data augmentation."}, {"time": 3182, "text": "I wonder if there's a benefit to being wildly imaginable while trying to be consistent with physical reality."}, {"time": 3191, "text": "I think it's a kind of a chicken and egg problem, right?"}, {"time": 3194, "text": "Because to have like amazing data augmentation, you need to understand what the scene is."}, {"time": 3198, "text": "And what we're trying to do data augmentation to learn what a scene is anyway."}, {"time": 3202, "text": "So it's basically just keeps going on."}, {"time": 3203, "text": "Before you understand it, just put elves with bananas until you know it's not to be true."}, {"time": 3209, "text": "Just like children have a wild imagination until the adults ruin it all."}, {"time": 3213, "text": "Okay, so what are the different kinds of data augmentation that you've seen to be effective in visual intelligence?"}, {"time": 3220, "text": "For like vision, it's a lot of these image filtering operations."}, {"time": 3224, "text": "So like blurring the image, you know, all the kind of Instagram filters that you can think of."}, {"time": 3229, "text": "So like arbitrarily like make the red super red, make the green super greens, like saturate the image."}, {"time": 3235, "text": "Rotation, cropping."}, {"time": 3236, "text": "Rotation, cropping, exactly."}, {"time": 3238, "text": "All of these kinds of things."}, {"time": 3239, "text": "Like I said, lighting is a really interesting one to me."}, {"time": 3242, "text": "Like that feels like really complicated to do."}, {"time": 3244, "text": "I mean, they don't, the augmentations that we work on aren't like that involved, they're not going to be like physically realistic versions of lighting."}, {"time": 3251, "text": "It's not that you're assuming that there's a light source up and then you're moving it to the right and then what does the thing look like?"}, {"time": 3257, "text": "It's really more about like brightness of the image, overall brightness of the image or overall contrast of the image and so on."}, {"time": 3262, "text": "But this is a really important point to me."}, {"time": 3265, "text": "I always thought that data augmentation holds an important key to big improvements in machine learning."}, {"time": 3273, "text": "And it seems that it is an important aspect of self supervised learning."}, {"time": 3279, "text": "So I wonder if there's big improvements to be achieved on much more intelligent kinds of data augmentation."}, {"time": 3286, "text": "For example, currently, maybe you can correct me if I'm wrong, data augmentation is not parameterized."}, {"time": 3293, "text": "You're not learning."}, {"time": 3295, "text": "To me, it seems like data augmentation potentially should involve more learning than the learning process itself."}, {"time": 3305, "text": "You're almost like thinking of like generative kind of, it's the elves with bananas."}, {"time": 3310, "text": "You're trying to, it's like very active imagination of messing with the world and teaching that mechanism for messing with the world to be realistic."}, {"time": 3320, "text": "Because that feels like, I mean, it's imagination."}, {"time": 3324, "text": "It's just, as you said, it feels like us humans are able to, maybe sometimes subconsciously, imagine before we see the thing, imagine what we're expecting to see, like maybe several options."}, {"time": 3337, "text": "And especially, we probably forgot, but when we were younger, probably the possibilities were wilder, more numerous."}, {"time": 3344, "text": "And then as we get older, we become to understand the world and the possibilities of what we might see becomes less and less and less."}, {"time": 3353, "text": "So I wonder if you think there's a lot of breakthroughs yet to be had in data augmentation."}, {"time": 3357, "text": "And maybe also can you just comment on the stuff we have, is that a big part of self supervised learning?"}, {"time": 3362, "text": "So data augmentation is like key to self supervised learning that has like the kind of augmentation that we're using."}, {"time": 3368, "text": "And basically the fact that we're trying to learn these neural networks that are predicting these features from images that are robust under data augmentation has been the key for visual self supervised learning."}, {"time": 3379, "text": "And they play a fairly fundamental role to it."}, {"time": 3382, "text": "Now, the irony of all of this is that for like deep learning purists will say the entire point of deep learning is that you feed in the pixels to the neural network and it should figure out the patterns on its own."}, {"time": 3393, "text": "So if it really wants to look at edges, it should look at edges."}, {"time": 3395, "text": "You shouldn't really like really go and handcraft these like features, right?"}, {"time": 3398, "text": "You shouldn't go tell it that look at edges."}, {"time": 3401, "text": "So data augmentation should basically be in the same category, right?"}, {"time": 3404, "text": "Why should we tell the network or tell this entire learning paradigm what kinds of data augmentation that we're looking for?"}, {"time": 3410, "text": "We are encoding a very sort of human specific bias there that we know things are like, if you change the contrast of the image, it should still be an apple or it should still see apple, not banana."}, {"time": 3422, "text": "And basically if we change like colors, it should still be the same kind of concept."}, {"time": 3428, "text": "Of course, this is not one, this is doesn't feel like super satisfactory because a lot of our human knowledge or our human supervision is actually going into the data augmentation."}, {"time": 3437, "text": "So although we are calling it self supervised learning, a lot of the human knowledge is actually being encoded in the data augmentation process."}, {"time": 3443, "text": "So it's really like, we've kind of sneaked away the supervision at the input and we're like really designing these nice list of data augmentations that are working very well."}, {"time": 3451, "text": "Of course, the idea is that it's much easier to design a list of data augmentation than it is to do."}, {"time": 3456, "text": "So humans are doing nevertheless doing less and less work and maybe leveraging their creativity more and more."}, {"time": 3462, "text": "And when we say data augmentation is not parameterized, it means it's not part of the learning process."}, {"time": 3468, "text": "Do you think it's possible to integrate some of the data augmentation into the learning process?"}, {"time": 3474, "text": "And in fact, it will be really beneficial for us because a lot of these data augmentations that we use in vision are very extreme."}, {"time": 3481, "text": "For example, like when you have certain concepts, again, a banana, you take the banana and then basically you change the color of the banana, right?"}, {"time": 3490, "text": "So you make it a purple banana."}, {"time": 3492, "text": "Now this data augmentation process is actually independent of the, like it has no notion of what is present in the image."}, {"time": 3498, "text": "So it can change this color arbitrarily."}, {"time": 3500, "text": "It can make it a red banana as well."}, {"time": 3502, "text": "And now what we're doing is we're telling the neural network that this red banana and so a crop of this image which has the red banana and a crop of this image where I changed the color to a purple banana should be, the features should be the same."}, {"time": 3514, "text": "Now bananas aren't red or purple mostly."}, {"time": 3516, "text": "So really the data augmentation process should take into account what is present in the image and what are the kinds of physical realities that are possible."}, {"time": 3523, "text": "It shouldn't be completely independent of the image."}, {"time": 3525, "text": "So you might get big gains if you, instead of being drastic, do subtle augmentation but realistic augmentation."}, {"time": 3533, "text": "Right, realistic."}, {"time": 3534, "text": "I'm not sure if it's subtle, but like realistic for sure."}, {"time": 3536, "text": "If it's realistic, then even subtle augmentation will give you big benefits."}, {"time": 3541, "text": "And it will be like for particular domains you might actually see like, if for example, now we're doing medical imaging, there are going to be certain kinds of like geometric augmentation which are not really going to be very valid for the human body."}, {"time": 3555, "text": "So if you were to like actually loop in data augmentation into the learning process, it will actually be much more useful."}, {"time": 3561, "text": "Now this actually does take us to maybe a semi supervised kind of a setting because you do want to understand what is it that you're trying to solve."}, {"time": 3569, "text": "So currently self supervised learning kind of operates in the wild, right?"}, {"time": 3572, "text": "So you do the self supervised learning and the purists and all of us basically say that, okay, this should learn useful representations and they should be useful for any kind of end task, no matter it's like banana recognition or like autonomous driving."}, {"time": 3586, "text": "Now it's a tall order."}, {"time": 3587, "text": "Maybe the first baby step for us should be that, okay, if you're trying to loop in this data augmentation into the learning process, then we at least need to have some sense of what we're trying to do."}, {"time": 3596, "text": "Are we trying to distinguish between different types of bananas or are we trying to distinguish between banana and apple or are we trying to do all of these things at once?"}, {"time": 3604, "text": "And so some notion of like what happens at the end might actually help us do much better at this side."}, {"time": 3614, "text": "If I were to give you like a black box, like a choice to have an arbitrary large data set of real natural data versus really good data augmentation algorithms, which would you like to train in a self supervised way on?"}, {"time": 3631, "text": "So natural data from the internet are arbitrary large, so unlimited data, or it's like more controlled good data augmentation on the finite data set."}, {"time": 3643, "text": "The thing is like, because our learning algorithms for vision right now really rely on data augmentation, even if you were to give me like an infinite source of like image data, I still need a good data augmentation algorithm."}, {"time": 3654, "text": "You need something that tells you that two things are similar."}, {"time": 3658, "text": "And so something, because you've given me an arbitrary large data set, I still need to use data augmentation to take that image construct, like these two perturbations of it, and then learn from it."}, {"time": 3668, "text": "So the thing is our learning paradigm is very primitive right now."}, {"time": 3672, "text": "Even if you were to give me lots of images, it's still not really useful."}, {"time": 3675, "text": "A good data augmentation algorithm is actually going to be more useful."}, {"time": 3678, "text": "So you can like reduce down the amount of data that you give me by like 10 times, but if you were to give me a good data augmentation algorithm, that would probably do better than giving me like 10 times the size of that data, but me having to rely on like a very primitive data augmentation algorithm."}, {"time": 3692, "text": "Like through tagging and all those kinds of things, is there a way to discover things that are semantically similar on the internet?"}, {"time": 3699, "text": "Obviously there is, but they might be extremely noisy."}, {"time": 3702, "text": "And the difference might be farther away than you would be comfortable with."}, {"time": 3707, "text": "So, I mean, yes, tagging will help you a lot."}, {"time": 3709, "text": "It'll actually go a very long way in figuring out what images are related or not."}, {"time": 3714, "text": "And then, so, but then the purists would argue that when you're using human tags, because these tags are like supervision, is it really self supervised learning now?"}, {"time": 3723, "text": "Because you're using human tags to figure out which images are like similar."}, {"time": 3727, "text": "Hashtag no filter means a lot of things."}, {"time": 3731, "text": "I mean, there are certain tags which are going to be applicable pretty much to anything."}, {"time": 3735, "text": "So they're pretty useless for learning."}, {"time": 3738, "text": "But I mean, certain tags are actually like the Eiffel Tower, for example, or the Taj Mahal, for example."}, {"time": 3743, "text": "These tags are like very indicative of what's going on."}, {"time": 3746, "text": "And they are, I mean, they are human supervision."}, {"time": 3750, "text": "This is one of the tasks of discovering from human generated data strong signals that could be leveraged for self supervision."}, {"time": 3759, "text": "Like humans are doing so much work already."}, {"time": 3762, "text": "Like many years ago, there was something that was called, I guess, human computation back in the day."}, {"time": 3768, "text": "Humans are doing so much work."}, {"time": 3770, "text": "It'd be exciting to discover ways to leverage the work they're doing to teach machines without any extra effort from them."}, {"time": 3777, "text": "An example could be, like we said, driving, humans driving and machines can learn from the driving."}, {"time": 3783, "text": "I always hope that there could be some supervision signal discovered in video games, because there's so many people that play video games that it feels like so much effort is put into video games, into playing video games, and you can design video games somewhat cheaply to include whatever signals you want."}, {"time": 3804, "text": "It feels like that could be leverage somehow."}, {"time": 3807, "text": "So people are using that."}, {"time": 3808, "text": "Like there are actually folks right here in UT Austin, like Philip Granbull is a professor at UT Austin."}, {"time": 3813, "text": "He's been like working on video games as a source of supervision."}, {"time": 3818, "text": "I mean, it's really fun."}, {"time": 3819, "text": "Like as a PhD student, getting to basically play video games all day."}, {"time": 3822, "text": "Yeah, but so I do hope that kind of thing scales and like ultimately boils down to discovering some undeniably very good signal."}, {"time": 3831, "text": "It's like masking in NLP."}, {"time": 3834, "text": "But that said, there's non contrastive methods."}, {"time": 3837, "text": "What do non contrastive energy based self supervised learning methods look like?"}, {"time": 3843, "text": "And why are they promising?"}, {"time": 3845, "text": "So like I said about contrastive learning, you have this notion of a positive and a negative."}, {"time": 3850, "text": "Now, the thing is, this entire learning paradigm really requires access to a lot of negatives to learn a good sort of feature space."}, {"time": 3859, "text": "The idea is if I tell you, okay, so a cat and a dog are similar, and they're very different from a banana."}, {"time": 3865, "text": "The thing is, this is a fairly simple analogy, right?"}, {"time": 3868, "text": "Because bananas look visually very different from what cats and dogs do."}, {"time": 3872, "text": "So very quickly, if this is the only source of supervision that I'm giving you, your learning is not going to be like, after a point, the neural network is really not going to learn a lot."}, {"time": 3881, "text": "Because the negative that you're getting is going to be so random."}, {"time": 3883, "text": "So it can be, oh, a cat and a dog are very similar, but they're very different from a Volkswagen Beetle."}, {"time": 3889, "text": "Now, like this car looks very different from these animals again."}, {"time": 3892, "text": "So the thing is in contrastive learning, the quality of the negative sample really matters a lot."}, {"time": 3898, "text": "And so what has happened is basically that typically these methods that are contrastive really require access to lots of negatives, which becomes harder and harder to sort of scale when designing a learning algorithm."}, {"time": 3909, "text": "So that's been one of the reasons why non contrastive methods have become like popular and why people think that they're going to be more useful."}, {"time": 3916, "text": "So a non contrastive method, for example, like clustering is one non contrastive method."}, {"time": 3920, "text": "The idea basically being that you have two of these samples, so the cat and dog or two crops of this image, they belong to the same cluster."}, {"time": 3930, "text": "And so essentially you're basically doing clustering online when you're learning this network, and which is very different from having access to a lot of negatives explicitly."}, {"time": 3938, "text": "The other way which has become really popular is something called self distillation."}, {"time": 3943, "text": "So the idea basically is that you have a teacher network and a student network, and the teacher network produces a feature."}, {"time": 3949, "text": "So it takes in the image and basically the neural network figures out the patterns gets the feature out."}, {"time": 3955, "text": "And there's another neural network which is the student neural network and that also produces a feature."}, {"time": 3959, "text": "And now all you're doing is basically saying that the features produced by the teacher network and the student network should be very similar."}, {"time": 3966, "text": "There is no notion of a negative anymore."}, {"time": 3970, "text": "So it's all about similarity maximization between these two features."}, {"time": 3973, "text": "And so all I need to now do is figure out how to have these two sorts of parallel networks, a student network and a teacher network."}, {"time": 3980, "text": "And basically researchers have figured out very cheap methods to do this."}, {"time": 3984, "text": "So you can actually have for free really two types of neural networks."}, {"time": 3989, "text": "They're kind of related, but they're different enough that you can actually basically have a learning problem set up."}, {"time": 3994, "text": "So you can ensure that they always remain different enough."}, {"time": 3998, "text": "So the thing doesn't collapse into something boring."}, {"time": 4001, "text": "So the main sort of enemy of self supervised learning, any kind of similarity maximization technique is collapse."}, {"time": 4007, "text": "It's a collapse means that you learn the same feature representation for all the images in the world, which is completely useless."}, {"time": 4014, "text": "Everything's a banana."}, {"time": 4015, "text": "Everything is a banana."}, {"time": 4016, "text": "Everything is a cat."}, {"time": 4017, "text": "Everything is a car."}, {"time": 4019, "text": "And so all we need to do is basically come up with ways to prevent collapse."}, {"time": 4023, "text": "Contrastive learning is one way of doing it."}, {"time": 4025, "text": "And then for example, like clustering or self distillation or other ways of doing it."}, {"time": 4029, "text": "We also had a recent paper where we used like de correlation between like two sets of features to prevent collapse."}, {"time": 4036, "text": "So that's inspired a little bit by like Horace Barlow's neuroscience principles."}, {"time": 4040, "text": "By the way, I should comment that whoever counts the number of times the word banana, apple, cat and dog were using this conversation wins the internet."}, {"time": 4050, "text": "I wish you luck."}, {"time": 4052, "text": "What is Suave and the main improvement proposed in the paper on supervised learning of visual features by contrasting cluster assignments?"}, {"time": 4062, "text": "Suave basically is a clustering based technique, which is for again, the same thing for self supervised learning in vision where we have two crops."}, {"time": 4072, "text": "And the idea basically is that you want the features from these two crops of an image to lie in the same cluster and basically crops that are coming from different images to be in different clusters."}, {"time": 4083, "text": "Now, typically in a sort of, if you were to do this clustering, you would perform clustering offline."}, {"time": 4089, "text": "What that means is you would, if you have a dataset of N examples, you would run over all of these N examples, get features for them, perform clustering."}, {"time": 4097, "text": "So basically get some clusters and then repeat the process again."}, {"time": 4101, "text": "So this is offline basically because I need to do one pass through the data to compute its clusters."}, {"time": 4107, "text": "Suave is basically just a simple way of doing this online."}, {"time": 4110, "text": "So as you're going through the data, you're actually computing these clusters online."}, {"time": 4114, "text": "And so of course there is like a lot of tricks involved in how to do this in a robust manner without collapsing, but this is this sort of key idea to it."}, {"time": 4122, "text": "Is there a nice way to say what is the key methodology of the clustering that enables that?"}, {"time": 4127, "text": "Right, so the idea basically is that when you have N samples, we assume that we have access to, like there are always K clusters in a dataset."}, {"time": 4137, "text": "K is a fixed number."}, {"time": 4137, "text": "So for example, K is 3000."}, {"time": 4140, "text": "And so if you have any, when you look at any sort of small number of examples, all of them must belong to one of these K clusters."}, {"time": 4148, "text": "And we impose this equipartition constraint."}, {"time": 4150, "text": "What this means is that basically your entire set of N samples should be equally partitioned into K clusters."}, {"time": 4159, "text": "So all your K clusters are basically equal, they have equal contribution to these N samples."}, {"time": 4164, "text": "And this ensures that we never collapse."}, {"time": 4166, "text": "So collapse can be viewed as a way in which all samples belong to one cluster, right?"}, {"time": 4170, "text": "So all this, if all features become the same, then you have basically just one mega cluster."}, {"time": 4175, "text": "You don't even have like 10 clusters or 3000 clusters."}, {"time": 4178, "text": "So Suave basically ensures that at each point, all these 3000 clusters are being used in the clustering process."}, {"time": 4186, "text": "Basically just figure out how to do this online."}, {"time": 4188, "text": "And again, basically just make sure that two crops from the same image belong to the same cluster and others don't."}, {"time": 4195, "text": "And the fact they have a fixed K makes things simpler."}, {"time": 4198, "text": "Fixed K makes things simpler."}, {"time": 4200, "text": "Our clustering is not like really hard clustering, it's soft clustering."}, {"time": 4203, "text": "So basically you can be 0.2 to cluster number one and 0.8 to cluster number two."}, {"time": 4208, "text": "So it's not really hard."}, {"time": 4209, "text": "So essentially, even though we have like 3000 clusters, we can actually represent a lot of clusters."}, {"time": 4215, "text": "What is SEER, S E E R?"}, {"time": 4219, "text": "And what are the key results and insights in the paper, Self Supervised Pre Training of Visual Features in the Wild?"}, {"time": 4227, "text": "What is this big, beautiful SEER system?"}, {"time": 4230, "text": "SEER, so I'll first go to Suave because Suave is actually like one of the key components for SEER."}, {"time": 4235, "text": "So Suave was, when we use Suave, it was demonstrated on ImageNet."}, {"time": 4239, "text": "So typically like self supervised methods, the way we sort of operate is like in the research community, we kind of cheat."}, {"time": 4247, "text": "So we take ImageNet, which of course I talked about as having lots of labels."}, {"time": 4251, "text": "And then we throw away the labels, like throw away all the hard work that went behind basically the labeling process."}, {"time": 4256, "text": "And we pretend that it is unsupervised."}, {"time": 4260, "text": "But the problem here is that we have, like when we collected these images, the ImageNet dataset has a particular distribution of concepts, right?"}, {"time": 4269, "text": "So these images are very curated."}, {"time": 4271, "text": "And what that means is these images, of course, belong to a certain set of noun concepts."}, {"time": 4277, "text": "And also ImageNet has this bias that all images contain an object, which is like very big and it's typically in the center."}, {"time": 4284, "text": "So when you're talking about a dog, it's a well framed dog, it's towards the center of the image."}, {"time": 4288, "text": "So a lot of the data augmentation, a lot of the sort of hidden assumptions in self supervised learning, actually really exploit this bias of ImageNet."}, {"time": 4297, "text": "And so, I mean, a lot of my work, a lot of work from other people always uses ImageNet sort of as the benchmark to show the success of self supervised learning."}, {"time": 4305, "text": "So you're implying that there's particular limitations to this kind of dataset?"}, {"time": 4309, "text": "Yes, I mean, it's basically because our data augmentation that we designed, like all data augmentation that we designed for self supervised learning in vision are kind of overfit to ImageNet."}, {"time": 4319, "text": "But you're saying a little bit hard coded like the cropping."}, {"time": 4323, "text": "Exactly, the cropping parameters, the kind of lighting that we're using, the kind of blurring that we're using."}, {"time": 4328, "text": "Yeah, but you would, for more in the wild dataset, you would need to be clever or more careful in setting the range of parameters and those kinds of things."}, {"time": 4338, "text": "So for SEER, our main goal was twofold."}, {"time": 4341, "text": "One, basically to move away from ImageNet for training."}, {"time": 4344, "text": "So the images that we used were like uncurated images."}, {"time": 4347, "text": "Now there's a lot of debate whether they're actually curated or not, but I'll talk about that later."}, {"time": 4352, "text": "But the idea was basically, these are going to be random internet images that we're not going to filter out based on like particular categories."}, {"time": 4360, "text": "So we did not say that, oh, images that belong to dogs and cats should be the only images that come in this dataset, banana."}, {"time": 4367, "text": "And basically, other images should be thrown out."}, {"time": 4370, "text": "So we didn't do any of that."}, {"time": 4371, "text": "So these are random internet images."}, {"time": 4373, "text": "And of course, it also goes back to like the problem of scale that you talked about."}, {"time": 4377, "text": "So these were basically about a billion or so images."}, {"time": 4380, "text": "And for context ImageNet, the ImageNet version that we use was 1 million images earlier."}, {"time": 4384, "text": "So this is basically going like three orders of magnitude more."}, {"time": 4387, "text": "The idea was basically to see if we can train a very large convolutional model in a self supervised way on this uncurated, but really large set of images."}, {"time": 4396, "text": "And how well would this model do?"}, {"time": 4398, "text": "So is self supervised learning really overfit to ImageNet or can it actually work in the wild?"}, {"time": 4403, "text": "And it was also out of curiosity, what kind of things will this model learn?"}, {"time": 4407, "text": "Will it actually be able to still figure out different types of objects and so on?"}, {"time": 4412, "text": "Would there be particular kinds of tasks that would actually do better than an ImageNet train model?"}, {"time": 4418, "text": "And so for Sear, one of our main findings was that we can actually train very large models in a completely self supervised way on lots of internet images without really necessarily filtering them out."}, {"time": 4428, "text": "Which was in itself a good thing because it's a fairly simple process, right?"}, {"time": 4431, "text": "So you get images which are uploaded and you basically can immediately use them to train a model in an unsupervised way."}, {"time": 4437, "text": "You don't really need to sit and filter them out."}, {"time": 4439, "text": "These images can be cartoons, these can be memes, these can be actual pictures uploaded by people."}, {"time": 4444, "text": "And you don't really care about what these images are."}, {"time": 4446, "text": "You don't even care about what concepts they contain."}, {"time": 4448, "text": "So this was a very sort of simple setup."}, {"time": 4450, "text": "What image selection mechanism would you say is there like inherent in some aspect of the process?"}, {"time": 4458, "text": "So you're kind of implying that there's almost none, but what is there would you say if you were to introspect?"}, {"time": 4464, "text": "Right, so it's not like uncurated can basically like one way of imagining uncurated is basically you have like cameras that can take pictures at random viewpoints."}, {"time": 4475, "text": "When people upload pictures to the internet, they are typically going to care about the framing of it."}, {"time": 4480, "text": "They're not going to upload, say, the picture of a zoomed in wall, for example."}, {"time": 4483, "text": "Well, when you say internet, do you mean social networks?"}, {"time": 4487, "text": "So these are not going to be like pictures of like a zoomed in table or a zoomed in wall."}, {"time": 4491, "text": "So it's not really completely uncurated because people do have the like photographer's bias where they do want to keep things towards the center a little bit, or like really have like nice looking things and so on in the picture."}, {"time": 4502, "text": "So that's the kind of bias that typically exists in this data set and also the user base, right?"}, {"time": 4507, "text": "You're not going to get lots of pictures from different parts of the world because there are certain parts of the world where people may not actually be uploading a lot of pictures to the internet or may not even have access to a lot of internet."}, {"time": 4517, "text": "So this is a giant data set and a giant neural network."}, {"time": 4521, "text": "I don't think we've talked about what architectures work well for SSL, for self supervised learning."}, {"time": 4529, "text": "For SEER and for SWAB, we were using convolutional networks, but recently in a work called Dyno, we've basically started using transformers for vision."}, {"time": 4536, "text": "Both seem to work really well, Connets and transformers."}, {"time": 4539, "text": "And depending on what you want to do, you might choose to use a particular formulation."}, {"time": 4543, "text": "So for SEER, it was a Connet."}, {"time": 4545, "text": "It was particularly a RegNet model, which was also a work from Facebook."}, {"time": 4549, "text": "RegNets are like really good when it comes to compute versus like accuracy."}, {"time": 4554, "text": "So because it was a very efficient model, compute and memory wise efficient, and basically it worked really well in terms of scaling."}, {"time": 4562, "text": "So we used a very large RegNet model and trained it on a billion images."}, {"time": 4565, "text": "Can you maybe quickly comment on what RegNets are?"}, {"time": 4569, "text": "It comes from this paper, Designing Network Design Spaces."}, {"time": 4573, "text": "This is a super interesting concept that emphasizes how to create efficient neural networks, large neural networks."}, {"time": 4579, "text": "So one of the sort of key takeaways from this paper, which the authors, like whenever you hear them present this work, they keep saying is, a lot of neural networks are characterized in terms of flops, right?"}, {"time": 4589, "text": "Flops basically being the floating point operations."}, {"time": 4591, "text": "And people really love to use flops to say, this model is like really computationally heavy, or like our model is computationally cheap and so on."}, {"time": 4599, "text": "Now it turns out that flops are really not a good indicator of how well a particular network is, like how efficient it is really."}, {"time": 4605, "text": "And what a better indicator is, is the activation or the memory that is being used by this particular model."}, {"time": 4612, "text": "And so designing, like one of the key findings from this paper was basically that you need to design network families or neural network architectures that are actually very efficient in the memory space as well, not just in terms of pure flops."}, {"time": 4624, "text": "So RegNet is basically a network architecture family that came out of this paper that is particularly good at both flops and the sort of memory required for it."}, {"time": 4633, "text": "And of course it builds upon like earlier work, like ResNet being like the sort of more popular inspiration for it, where you have residual connections."}, {"time": 4640, "text": "But one of the things in this work is basically they also use like squeeze excitation blocks."}, {"time": 4645, "text": "So it's a lot of nice sort of technical innovation in all of this from prior work, and a lot of the ingenuity of these particular authors in how to combine these multiple building blocks."}, {"time": 4654, "text": "But the key constraint was optimize for both flops and memory when you're basically doing this, don't just look at flops."}, {"time": 4659, "text": "And that allows you to what have a, sort of have very large networks through this process, can optimize for low, like for efficiency, for low memory."}, {"time": 4671, "text": "Also in just in terms of pure hardware, they fit very well on GPU memory."}, {"time": 4675, "text": "So they can be like really powerful neural network architectures with lots of parameters, lots of flops, but also because they're like efficient in terms of the amount of memory that they're using, you can actually fit a lot of these on like a, you can fit a very large model on a single GPU for example."}, {"time": 4689, "text": "Would you say that the choice of architecture matters more than the choice of maybe data augmentation techniques?"}, {"time": 4698, "text": "Is there a possibility to say what matters more?"}, {"time": 4701, "text": "You kind of imply that you can probably go really far with just using basic conv nuts."}, {"time": 4707, "text": "All right, I think like data and data augmentation, the algorithm being used for the self supervised training matters a lot more than the particular kind of architecture."}, {"time": 4716, "text": "With different types of architecture, you will get different like properties in the resulting sort of representation."}, {"time": 4721, "text": "But really, I mean, the secret sauce is in the augmentation and the algorithm being used to train them."}, {"time": 4727, "text": "The architectures, I mean, at this point, a lot of them perform very similarly, depending on like the particular task that you care about, they have certain advantages and disadvantages."}, {"time": 4736, "text": "Is there something interesting to be said about what it takes with Sears to train a giant neural network?"}, {"time": 4741, "text": "You're talking about a huge amount of data, a huge neural network."}, {"time": 4745, "text": "Is there something interesting to be said of how to effectively train something like that fast?"}, {"time": 4751, "text": "Lots of GPUs."}, {"time": 4755, "text": "I mean, so the model was like a billion parameters."}, {"time": 4758, "text": "And it was trained on a billion images."}, {"time": 4760, "text": "So if like, basically the same number of parameters as the number of images, and it took a while."}, {"time": 4766, "text": "I don't remember the exact number, it's in the paper, but it took a while."}, {"time": 4771, "text": "I guess I'm trying to get at is, when you're thinking of scaling this kind of thing, I mean, one of the exciting possibilities of self supervised learning is the several orders of magnitude scaling of everything, both the neural network and the size of the data."}, {"time": 4790, "text": "And so the question is, do you think there's some interesting tricks to do large scale distributed compute, or is that really outside of even deep learning?"}, {"time": 4800, "text": "That's more about like hardware engineering."}, {"time": 4804, "text": "I think more and more there is like this, a lot of like systems are designed, basically taking into account the machine learning needs, right?"}, {"time": 4812, "text": "So because whenever you're doing this kind of distributed training, there is a lot of intercommunication between nodes."}, {"time": 4817, "text": "So like gradients or the model parameters are being passed."}, {"time": 4820, "text": "So you really want to minimize communication costs when you really want to scale these models up."}, {"time": 4825, "text": "You want basically to be able to do as much, like as limited amount of communication as possible."}, {"time": 4831, "text": "So currently like a dominant paradigm is synchronized sort of training."}, {"time": 4835, "text": "So essentially after every sort of gradient step, all you basically have like a synchronization step between all the sort of compute chips that you're going on with."}, {"time": 4845, "text": "I think asynchronous training was popular, but it doesn't seem to perform as well."}, {"time": 4850, "text": "But in general, I think that's sort of the, I guess it's outside my scope as well."}, {"time": 4855, "text": "But the main thing is like minimize the amount of synchronization steps that you have."}, {"time": 4861, "text": "That has been the key takeaway, at least in my experience."}, {"time": 4864, "text": "The others I have no idea about, how to design the chip."}, {"time": 4866, "text": "Yeah, there's very few things that I see Jim Keller's eyes light up as much as talking about giant computers doing like that fast communication that you're talking to well when they're training machine learning systems."}, {"time": 4881, "text": "What is VSSL, V I S S L, the PyTorch based SSL library?"}, {"time": 4887, "text": "What are the use cases that you might have?"}, {"time": 4890, "text": "VSSL basically was born out of a lot of us at Facebook are doing the self supervised learning research."}, {"time": 4895, "text": "So it's a common framework in which we have like a lot of self supervised learning methods implemented for vision."}, {"time": 4901, "text": "It's also, it has in itself like a benchmark of tasks that you can evaluate the self supervised representations on."}, {"time": 4908, "text": "So the use case for it is basically for anyone who's either trying to evaluate their self supervised model or train their self supervised model, or a researcher who's trying to build a new self supervised technique."}, {"time": 4919, "text": "So it's basically supposed to be all of these things."}, {"time": 4921, "text": "So as a researcher before VSSL, for example, or like when we started doing this work fairly seriously at Facebook, it was very hard for us to go and implement every self supervised learning model, test it out in a like sort of consistent manner."}, {"time": 4934, "text": "The experimental setup was very different across different groups."}, {"time": 4938, "text": "Even when someone said that they were reporting image net accuracy, it could mean lots of different things."}, {"time": 4943, "text": "So with VSSL, we tried to really sort of standardize that as much as possible."}, {"time": 4946, "text": "And there was a paper like we did in 2019 just about benchmarking."}, {"time": 4949, "text": "And so VSSL basically builds upon a lot of this kind of work that we did about like benchmarking."}, {"time": 4955, "text": "And then every time we try to like, we come up with a self supervised learning method, a lot of us try to push that into VSSL as well, just so that it basically is like the central piece where a lot of these methods can reside."}, {"time": 4966, "text": "Just out of curiosity, people may be, so certainly outside of Facebook, but just researchers, or just even people that know how to program in Python and know how to use PyTorch, what would be the use case?"}, {"time": 4978, "text": "What would be a fun thing to play around with VSSL on?"}, {"time": 4981, "text": "Like what's a fun thing to play around with self supervised learning on, would you say?"}, {"time": 4987, "text": "Is there a good Hello World program?"}, {"time": 4989, "text": "Like is it always about big size that's important to have, or is there fun little smaller case playgrounds to play around with?"}, {"time": 4999, "text": "So we're trying to like push something towards that."}, {"time": 5002, "text": "I think there are a few setups out there, but nothing like super standard on the smaller scale."}, {"time": 5006, "text": "I mean, ImageNet in itself is actually pretty big also."}, {"time": 5009, "text": "So that is not something which is like feasible for a lot of people."}, {"time": 5013, "text": "But we are trying to like push up with like smaller sort of use cases."}, {"time": 5016, "text": "The thing is, at a smaller scale, a lot of the observations or a lot of the algorithms that work don't necessarily translate into the medium or the larger scale."}, {"time": 5025, "text": "So it's really tricky to come up with a good small scale setup where a lot of your empirical observations will really translate to the other setup."}, {"time": 5031, "text": "So it's been really challenging."}, {"time": 5033, "text": "I've been trying to do that for a little bit as well because it does take time to train stuff on ImageNet."}, {"time": 5036, "text": "It does take time to train on like more images, but pretty much every time I've tried to do that, it's been unsuccessful because all the observations I draw from my set of experiments on a smaller data set don't translate into ImageNet or like don't translate into another sort of data set."}, {"time": 5051, "text": "So it's been hard for us to figure this one out, but it's an important problem."}, {"time": 5055, "text": "So there's this really interesting idea of learning across multiple modalities."}, {"time": 5060, "text": "You have a CVPR 2021 best paper candidate titled audio visual instance discrimination with cross modal agreement."}, {"time": 5071, "text": "What are the key results, insights in this paper and what can you say in general about the promise and power of multimodal learning?"}, {"time": 5077, "text": "For this paper, it actually came as a little bit of a shock to me at how well it worked."}, {"time": 5081, "text": "So I can describe what the problem set up was."}, {"time": 5084, "text": "So it's been used in the past by lots of folks like for example, Andrew Owens from MIT, Alyosha Efros from Berkeley, Andrew Zisserman from Oxford."}, {"time": 5091, "text": "So a lot of these people have been sort of showing results in this."}, {"time": 5093, "text": "Of course, I was aware of this result, but I wasn't really sure how well it would work in practice for like other sort of downstream tasks."}, {"time": 5100, "text": "So the results kept getting better."}, {"time": 5102, "text": "And I wasn't sure if like a lot of our insights from self supervised learning would translate into this multimodal learning problem."}, {"time": 5108, "text": "So multimodal learning is when you have like, when you have multiple modalities."}, {"time": 5114, "text": "That's not even cool."}, {"time": 5115, "text": "Okay, so the particular modalities that we worked on in this work were audio and video."}, {"time": 5122, "text": "So the idea was basically, if you have a video, you have its corresponding audio track."}, {"time": 5125, "text": "And you want to use both of these signals, the audio signal and the video signal to learn a good representation for video and good representation for audio."}, {"time": 5132, "text": "Like this podcast."}, {"time": 5133, "text": "Like this podcast, exactly."}, {"time": 5135, "text": "So what we did in this work was basically train two different neural networks, one on the video signal, one on the audio signal."}, {"time": 5141, "text": "And what we wanted is basically the features that we get from both of these neural networks should be similar."}, {"time": 5146, "text": "So it should basically be able to produce the same kinds of features from the video and the same kinds of features from the audio."}, {"time": 5153, "text": "Now, why is this useful?"}, {"time": 5154, "text": "Well, for a lot of these objects that we have, there is a characteristic sound, right?"}, {"time": 5158, "text": "So trains, when they go by, they make a particular kind of sound."}, {"time": 5160, "text": "Boats make a particular kind of sound."}, {"time": 5162, "text": "People, when they're jumping around, will like shout, whatever."}, {"time": 5166, "text": "Bananas don't make a sound."}, {"time": 5167, "text": "So where you can't learn anything about bananas there."}, {"time": 5169, "text": "Or when humans mentioned bananas."}, {"time": 5171, "text": "Well, yes, when they say the word banana, then."}, {"time": 5173, "text": "So you can't trust basically anything that comes out of a human's mouth as a source, that source of audio is useless."}, {"time": 5179, "text": "The typical use case is basically like, for example, someone playing a musical instrument."}, {"time": 5182, "text": "So guitars have a particular kind of sound and so on."}, {"time": 5184, "text": "So because a lot of these things are correlated, the idea in multimodal learning is to take these two kinds of modalities, video and audio, and learn a common embedding space, a common feature space where both of these related modalities can basically be close together."}, {"time": 5198, "text": "And again, you use contrastive learning for this."}, {"time": 5200, "text": "So in contrastive learning, basically the video and the corresponding audio are positives."}, {"time": 5205, "text": "And you can take any other video or any other audio and that becomes a negative."}, {"time": 5209, "text": "And so basically that's it."}, {"time": 5211, "text": "It's just a simple application of contrastive learning."}, {"time": 5213, "text": "The main sort of finding from this work for us was basically that you can actually learn very, very powerful feature representations, very, very powerful video representations."}, {"time": 5222, "text": "So you can learn the sort of video network that we ended up learning can actually be used for downstream, for example, recognizing human actions or recognizing different types of sounds, for example."}, {"time": 5234, "text": "So this was sort of the key finding."}, {"time": 5237, "text": "Can you give kind of an example of a human action or like just so we can build up intuition of what kind of thing?"}, {"time": 5244, "text": "Right, so there is this data set called kinetics, for example, which has like 400 different types of human actions."}, {"time": 5249, "text": "So people jumping, people doing different kinds of sports or different types of swimming."}, {"time": 5254, "text": "So like different strokes and swimming, golf and so on."}, {"time": 5257, "text": "So there are like just different types of actions right there."}, {"time": 5260, "text": "And the point is this kind of video network that you learn in a self supervised way can be used very easily to kind of recognize these different types of actions."}, {"time": 5268, "text": "It can also be used for recognizing different types of objects."}, {"time": 5273, "text": "And what we did is we tried to visualize whether the network can figure out where the sound is coming from."}, {"time": 5277, "text": "So basically, give it a video and basically play say of a person just strumming a guitar, but of course, there is no audio in this."}, {"time": 5284, "text": "And now you give it this sound of a guitar."}, {"time": 5287, "text": "And you ask like basically try to visualize where the network thinks the sound is coming from."}, {"time": 5292, "text": "And that can kind of basically draw like when you visualize it, you can see that it's basically focusing on the guitar."}, {"time": 5297, "text": "Yeah, that's surreal."}, {"time": 5298, "text": "And the same thing, for example, for certain people's voices, like famous celebrities voices, it can actually figure out where their mouth is."}, {"time": 5306, "text": "So it can actually distinguish different people's voices, for example, a little bit as well."}, {"time": 5310, "text": "Without that ever being annotated in any way."}, {"time": 5313, "text": "Right, so this is all what it had discovered."}, {"time": 5315, "text": "We never pointed out that this is a guitar and this is the kind of sound it produces."}, {"time": 5320, "text": "It can actually naturally figure that out because it's seen so many correlations of this sound coming with this kind of like an object that it basically learns to associate this sound with this kind of an object."}, {"time": 5330, "text": "Yeah, that's really fascinating, right?"}, {"time": 5333, "text": "So the idea with this kind of network is then you then fine tune it for a particular task."}, {"time": 5337, "text": "So this is forming like a really good knowledge base within a neural network based on which you could then the train a little bit more to accomplish a specific task."}, {"time": 5347, "text": "Well, so you don't need a lot of videos of humans doing actions annotated."}, {"time": 5352, "text": "You can just use a few of them to basically get your."}, {"time": 5356, "text": "How much insight do you draw from the fact that it can figure out where the sound is coming from?"}, {"time": 5363, "text": "I'm trying to see, so that's kind of very, it's very CVPR beautiful, right?"}, {"time": 5368, "text": "It's a cool little insight."}, {"time": 5370, "text": "I wonder how profound that is."}, {"time": 5373, "text": "Does it speak to the idea that multiple modalities are somehow much bigger than the sum of their parts?"}, {"time": 5384, "text": "Or is it really, really useful to have multiple modalities?"}, {"time": 5388, "text": "Or is it just that cool thing that there's parts of our world that can be revealed like effectively through multiple modalities, but most of it is really all about vision or about one of the modalities."}, {"time": 5403, "text": "I would say a little tending more towards the second part."}, {"time": 5407, "text": "So most of it can be sort of figured out with one modality, but having an extra modality always helps you."}, {"time": 5413, "text": "So in this case, for example, like one thing is when you're, if you observe someone cutting something and you don't have any sort of sound there, whether it's an apple or whether it's an onion, it's very hard to figure that out."}, {"time": 5426, "text": "But if you hear someone cutting it, it's very easy to figure it out because apples and onions make a very different kind of characteristics on when they're cut."}, {"time": 5434, "text": "So you really figure this out based on audio, it's much easier."}, {"time": 5438, "text": "So your life will become much easier when you have access to different kinds of modalities."}, {"time": 5442, "text": "And the other thing is, so I like to relate it in this way, it may be like completely wrong, but the distributional hypothesis in NLP, where context basically gives kind of meaning to that word, sound kind of does that too."}, {"time": 5455, "text": "So if you have the same sound, so that's the same context across different videos, you're very likely to be observing the same kind of concept."}, {"time": 5463, "text": "So that's the kind of reason why it figures out the guitar thing, right?"}, {"time": 5466, "text": "It observed the same sound across multiple different videos and it figures out maybe this is the common factor that's actually doing it."}, {"time": 5473, "text": "I wonder, I used to have this argument with my dad a bunch for creating general intelligence, whether smell is an important, like if that's important sensory information, mostly we're talking about like falling in love with an AI system and for him, smell and touch are important."}, {"time": 5491, "text": "And I was arguing that it's not at all."}, {"time": 5493, "text": "It's important, it's nice and everything, but like you can fall in love with just language really, but a voice is very powerful and vision is next and smell is not that important."}, {"time": 5503, "text": "Can I ask you about this process of active learning?"}, {"time": 5506, "text": "You mentioned interactivity."}, {"time": 5510, "text": "Is there some value within the self supervised learning context to select parts of the data in intelligent ways such that they would most benefit the learning process?"}, {"time": 5526, "text": "So I think so."}, {"time": 5527, "text": "I mean, I know I'm talking to an active learning fan here, so of course I know the answer."}, {"time": 5532, "text": "First you were talking bananas and now you're talking about active learning."}, {"time": 5536, "text": "I think Yannakun told me that active learning is not that interesting."}, {"time": 5540, "text": "I think back then I didn't want to argue with him too much, but when we talk again, we're gonna spend three hours arguing about active learning."}, {"time": 5548, "text": "My sense was you can go extremely far with active learning, perhaps farther than anything else."}, {"time": 5554, "text": "Like to me, there's this kind of intuition that similar to data augmentation, you can get a lot from the data, from intelligent optimized usage of the data."}, {"time": 5570, "text": "I'm trying to speak generally in such a way that includes data augmentation and active learning, that there's something about maybe interactive exploration of the data that at least is part of the solution to intelligence, like an important part."}, {"time": 5587, "text": "I don't know what your thoughts are on active learning in general."}, {"time": 5589, "text": "I actually really like active learning."}, {"time": 5590, "text": "So back in the day we did this largely ignored CVPR paper called learning by asking questions."}, {"time": 5596, "text": "So the idea was basically you would train an agent that would ask a question about the image."}, {"time": 5600, "text": "It would get an answer and basically then it would update itself."}, {"time": 5603, "text": "It would see the next image."}, {"time": 5604, "text": "It would decide what's the next hardest question that I can ask to learn the most."}, {"time": 5608, "text": "And the idea was basically because it was being smart about the kinds of questions it was asking, it would learn in fewer samples."}, {"time": 5615, "text": "It would be more efficient at using data."}, {"time": 5617, "text": "And we did find to some extent that it was actually better than randomly asking questions."}, {"time": 5622, "text": "Kind of weird thing about active learning is it's also a chicken and egg problem because when you look at an image, to ask a good question about the image, you need to understand something about the image."}, {"time": 5630, "text": "You can't ask a completely arbitrarily random question."}, {"time": 5633, "text": "It may not even apply to that particular image."}, {"time": 5635, "text": "So there is some amount of understanding or knowledge that basically keeps getting built when you're doing active learning."}, {"time": 5641, "text": "So I think active learning by itself is really good."}, {"time": 5644, "text": "And the main thing we need to figure out is basically how do we come up with a technique to first model what the model knows and also model what the model does not know."}, {"time": 5656, "text": "I think that's the sort of beauty of it."}, {"time": 5658, "text": "Because when you know that there are certain things that you don't know anything about, asking a question about those concepts is actually going to bring you the most value."}, {"time": 5666, "text": "And I think that's the sort of key challenge."}, {"time": 5668, "text": "Now, self supervised learning by itself, like selecting data for it and so on, that's actually really useful."}, {"time": 5672, "text": "But I think that's a very narrow view of looking at active learning."}, {"time": 5675, "text": "If you look at it more broadly, it is basically about if the model has a knowledge about N concepts, and it is weak basically about certain things."}, {"time": 5683, "text": "So it needs to ask questions either to discover new concepts or to basically increase its knowledge about these N concepts."}, {"time": 5690, "text": "So at that level, it's a very powerful technique."}, {"time": 5693, "text": "I actually do think it's going to be really useful."}, {"time": 5696, "text": "Even in like simple things such as like data labeling, it's super useful."}, {"time": 5700, "text": "So here is like one simple way that you can use active learning."}, {"time": 5704, "text": "For example, you have your self supervised model, which is very good at predicting similarities and dissimilarities between things."}, {"time": 5710, "text": "And so if you label a picture as basically say a banana, now you know that all the images that are very similar to this image are also likely to contain bananas."}, {"time": 5721, "text": "So probably when you want to understand what else is a banana, you're not going to use these other images."}, {"time": 5726, "text": "You're actually going to use an image that is not completely dissimilar, but somewhere in between, which is not super similar to this image, but not super dissimilar either."}, {"time": 5735, "text": "And that's going to tell you a lot more about what this concept of a banana is."}, {"time": 5739, "text": "So that's kind of a heuristic."}, {"time": 5741, "text": "I wonder if it's possible to also learn ways to discover the most likely, the most beneficial image."}, {"time": 5752, "text": "So like, so not just looking a thing that's somewhat similar to a banana, but not exactly similar, but have some kind of more complicated learning system, like learned discovering mechanism that tells you what image to look for."}, {"time": 5769, "text": "Like how, yeah, like actually in a self supervised way, learning strictly a function that says, is this image going to be very useful to me given what I currently know?"}, {"time": 5782, "text": "I think there's a lot of synergy there."}, {"time": 5783, "text": "It's just, I think, yeah, it's going to be explored."}, {"time": 5787, "text": "I think very much related to that."}, {"time": 5789, "text": "I kind of think of what Tesla Autopilot is doing currently as kind of active learning."}, {"time": 5796, "text": "There's something that Andre Capati and their team are calling a data engine."}, {"time": 5801, "text": "So you're basically deploying a bunch of instantiations of a neural network into the wild, and they're collecting a bunch of edge cases that are then sent back for annotation for particular, and edge cases as defined as near failure or some weirdness on a particular task that's then sent back."}, {"time": 5821, "text": "It's that not exactly a banana, but almost the banana cases sent back for annotation."}, {"time": 5827, "text": "And then there's this loop that keeps going and you keep retraining and retraining."}, {"time": 5831, "text": "And the active learning step there, or whatever you want to call it, is the cars themselves that are sending you back the data."}, {"time": 5839, "text": "Like, what the hell happened here?"}, {"time": 5840, "text": "This was weird."}, {"time": 5842, "text": "What are your thoughts about that sort of deployment of neural networks in the wild?"}, {"time": 5848, "text": "Another way to ask a question from first is your thoughts."}, {"time": 5851, "text": "And maybe if you want to comment, is there applications for autonomous driving, like computer vision based autonomous driving, applications of self supervised learning in the context of computer vision based autonomous driving?"}, {"time": 5868, "text": "I think for self supervised learning to be used in autonomous driving, there are lots of opportunities."}, {"time": 5871, "text": "I mean, just like pure consistency in predictions is one way, right?"}, {"time": 5875, "text": "So because you have this nice sequence of data that is coming in, a video stream of it, associated of course with the actions that say the car took, you can form a very nice predictive model of what's happening."}, {"time": 5888, "text": "So for example, like all the way, like one way possibly in which how they're figuring out what data to get labeled is basically through prediction uncertainty, right?"}, {"time": 5897, "text": "So you predict that the car was going to turn right."}, {"time": 5900, "text": "So this was the action that was going to happen, say in the shadow mode."}, {"time": 5903, "text": "And now the driver turned left."}, {"time": 5904, "text": "And this is a really big surprise."}, {"time": 5907, "text": "So basically by forming these good predictive models, you are, I mean, these are kind of self supervised models."}, {"time": 5912, "text": "Prediction models are basically being trained just by looking at what's going to happen next and asking them to predict what's going to happen next."}, {"time": 5918, "text": "So I would say this is really like one use of self supervised learning."}, {"time": 5922, "text": "It's a predictive model and you're learning a predictive model basically just by looking at what data you have."}, {"time": 5926, "text": "Is there something about that active learning context that you find insights from?"}, {"time": 5933, "text": "Like that kind of deployment of the system, seeing cases where it doesn't perform as you expected and then retraining the system based on that?"}, {"time": 5941, "text": "I think that, I mean, that really resonates with me."}, {"time": 5943, "text": "It's super smart to do it that way."}, {"time": 5945, "text": "Because I mean, the thing is with any kind of like practical system, like autonomous driving, there are those edge cases that are the things that are actually the problem, right?"}, {"time": 5954, "text": "I mean, highway driving or like freeway driving has basically been like, there has been a lot of success in that particular part of autonomous driving for a long time."}, {"time": 5962, "text": "I would say like since the eighties or something."}, {"time": 5965, "text": "Now the point is all these failure cases are the sort of reason why autonomous driving hasn't become like super, super mainstream and available like in every possible car right now."}, {"time": 5975, "text": "And so basically by really scaling this problem out by really trying to get all of these edge cases out as quickly as possible, and then just like using those to improve your model, that's super smart."}, {"time": 5985, "text": "And prediction uncertainty to do that is like one really nice way of doing it."}, {"time": 5989, "text": "Let me put you on the spot."}, {"time": 5992, "text": "So we mentioned offline Jitendra, he thinks that the Tesla computer vision approach or really any approach for autonomous driving is very far away."}, {"time": 6002, "text": "How many years away, if you have to bet all your money on it, are we to solving autonomous driving with this kind of computer vision only machine learning based approach?"}, {"time": 6013, "text": "Okay, so what does solving autonomous driving mean?"}, {"time": 6015, "text": "Does it mean solving it in the US?"}, {"time": 6017, "text": "Does it mean solving it in India?"}, {"time": 6018, "text": "Because I can tell you that very different types of driving happening."}, {"time": 6021, "text": "Not India, not Russia."}, {"time": 6023, "text": "In the United States, autonomous, so what solving means is when the car says it has control, it is fully liable."}, {"time": 6034, "text": "You can go to sleep, it's driving by itself."}, {"time": 6037, "text": "So this is highway and city driving, but not everywhere, but mostly everywhere."}, {"time": 6042, "text": "And it's, let's say significantly better, like say five times less accidents than humans."}, {"time": 6050, "text": "Sufficiently safer such that the public feels like that transition is enticing beneficial both for our safety and financial and all those kinds of things."}, {"time": 6061, "text": "Okay, so first disclaimer, I'm not an expert in autonomous driving."}, {"time": 6064, "text": "So let me put it out there."}, {"time": 6065, "text": "I would say like at least five to 10 years."}, {"time": 6069, "text": "This would be my guess from now."}, {"time": 6072, "text": "Yeah, I'm actually very impressed."}, {"time": 6074, "text": "Like when I sat in a friend's Tesla recently and of course, like looking on that screen, it basically shows all the detections and everything."}, {"time": 6082, "text": "The car is doing as you're driving by and that's super distracting for me as a person because all I keep looking at is like the bounding boxes in the cars it's tracking and it's really impressive."}, {"time": 6091, "text": "Like especially when it's raining and it's able to do that, that was the most impressive part for me."}, {"time": 6096, "text": "It's actually able to get through rain and do that."}, {"time": 6098, "text": "And one of the reasons why like a lot of us believed and I would put myself in that category is LIDAR based sort of technology for autonomous driving was the key driver, right?"}, {"time": 6108, "text": "So Waymo was using it for the longest time."}, {"time": 6110, "text": "And Tesla then decided to go this completely other route that we are not going to even use LIDAR."}, {"time": 6115, "text": "So their initial system I think was camera and radar based and now they're actually moving to a completely like vision based system."}, {"time": 6122, "text": "And so that was just like, it sounded completely crazy."}, {"time": 6124, "text": "Like LIDAR is very useful in cases where you have low visibility."}, {"time": 6129, "text": "Of course it comes with its own set of complications."}, {"time": 6131, "text": "But now to see that happen in like on a live Tesla that basically just proves everyone wrong I would say in a way."}, {"time": 6138, "text": "And that's just working really well."}, {"time": 6140, "text": "I think there were also like a lot of advancements in camera technology."}, {"time": 6143, "text": "Now there were like, I know at CMU when I was there there was a particular kind of camera that had been developed that was really good at basically low visibility setting."}, {"time": 6152, "text": "So like lots of snow and lots of rain it could actually still have a very reasonable visibility."}, {"time": 6157, "text": "And I think there are lots of these kinds of innovations that will happen on the sensor side itself which is actually going to make this very easy in the future."}, {"time": 6163, "text": "And so maybe that's actually why I'm more optimistic about vision based self, like autonomous driving."}, {"time": 6169, "text": "I was going to call it self supervised driving, but."}, {"time": 6171, "text": "Vision based autonomous driving."}, {"time": 6173, "text": "That's the reason I'm quite optimistic about it because I think there are going to be lots of these advances on the sensor side itself."}, {"time": 6178, "text": "So acquiring this data we're actually going to get much better about it."}, {"time": 6182, "text": "And then of course, once we're able to scale out and get all of these edge cases in as like Andre described I think that's going to make us go very far away."}, {"time": 6191, "text": "Yeah, so it's funny."}, {"time": 6193, "text": "I'm very much with you on the five to 10 years maybe 10 years but you made it, I'm not sure how you made it sound but for some people that seem that might seem like really far away."}, {"time": 6205, "text": "And then for other people, it might seem like very close."}, {"time": 6210, "text": "There's a lot of fundamental questions about how much game theory is in this whole thing."}, {"time": 6216, "text": "So like, how much is this simply a collision avoidance problem and how much of it is you still interacting with other humans in the scene and you're trying to create an experience that's compelling."}, {"time": 6229, "text": "So you want to get from point A to point B quickly you want to navigate the scene in a safe way but you also want to show some level of aggression because well, certainly this is why you're screwed in India because you have to show aggression."}, {"time": 6243, "text": "Or Jersey or New Jersey."}, {"time": 6244, "text": "Or Jersey, right."}, {"time": 6245, "text": "So like, or New York or basically any major city but I think it's probably Elon that I talked the most about this which is a surprise to the level of which they're not considering human beings as a huge problem in this, as a source of problem."}, {"time": 6262, "text": "Like the driving is fundamentally a robot on robot versus the environment problem versus like you can just consider humans not part of the problem."}, {"time": 6275, "text": "I used to think humans are almost certainly have to be modeled really well."}, {"time": 6281, "text": "Pedestrians and cyclists and humans inside other cars you have to have like mental models for them."}, {"time": 6286, "text": "You cannot just see it as objects but more and more it's like the it's the same kind of intuition breaking thing that's self supervised learning does, which is well maybe through the learning you'll get all the human like human information you need."}, {"time": 6304, "text": "Like maybe you'll get it just with enough data."}, {"time": 6307, "text": "You don't need to have explicit good models of human behavior."}, {"time": 6310, "text": "Maybe you get it through the data."}, {"time": 6312, "text": "So, I mean my skepticism also just knowing a lot of automotive companies and how difficult it is to be innovative."}, {"time": 6318, "text": "I was skeptical that they would be able at scale to convert the driving scene across the world into digital form such that you can create this data engine at scale."}, {"time": 6333, "text": "And the fact that Tesla is at least getting there or are already there makes me think that it's now starting to be coupled to this self supervised learning vision which is like if that's gonna work if through purely this process you can get really far then maybe you can solve driving that way."}, {"time": 6355, "text": "I tend to believe we don't give enough credit to the how amazing humans are both at driving and at supervising autonomous systems."}, {"time": 6369, "text": "And also we don't, this is, I wish we were."}, {"time": 6373, "text": "I wish there was much more driver sensing inside Teslas and much deeper consideration of human factors like understanding psychology and drowsiness and all those kinds of things when the car does more and more of the work."}, {"time": 6388, "text": "How to keep utilizing the little human supervision that are needed to keep this whole thing safe."}, {"time": 6395, "text": "I mean it's a fascinating dance of human robot interaction."}, {"time": 6398, "text": "To me autonomous driving for a long time is a human robot interaction problem."}, {"time": 6405, "text": "It is not a robotics problem or computer vision problem."}, {"time": 6408, "text": "Like you have to have a human in the loop."}, {"time": 6410, "text": "But so which is why I think it's 10 years plus."}, {"time": 6413, "text": "But I do think there'll be a bunch of cities and contexts where geo restricted it will work really, really damn well."}, {"time": 6422, "text": "So I think for me that gets five if I'm being optimistic and it's going to be five for a lot of cases and 10 plus, yeah, I agree with you."}, {"time": 6429, "text": "10 plus basically if we want to recover most of the, say, contiguous United States or something."}, {"time": 6436, "text": "So my optimistic is five and pessimistic is 30."}, {"time": 6440, "text": "30."}, {"time": 6441, "text": "I have a long tail on this one."}, {"time": 6442, "text": "I haven't watched enough driving videos."}, {"time": 6444, "text": "I've watched enough pedestrians to think like we may be, like there's a small part of me still, not a small, like a pretty big part of me that thinks we will have to build AGI to solve driving."}, {"time": 6458, "text": "Like there's something to me, like because humans are part of the picture, deeply part of the picture, and also human society is part of the picture in that human life is at stake."}, {"time": 6467, "text": "Anytime a robot kills a human, it's not clear to me that that's not a problem that machine learning will also have to solve."}, {"time": 6476, "text": "Like it has to, you have to integrate that into the whole thing."}, {"time": 6480, "text": "Just like Facebook or social networks, one thing is to say how to make a really good recommender system."}, {"time": 6486, "text": "And then the other thing is to integrate into that recommender system, all the journalists that will write articles about that recommender system."}, {"time": 6493, "text": "Like you have to consider the society within which the AI system operates."}, {"time": 6498, "text": "And in order to, and like politicians too, this is the regulatory stuff for autonomous driving."}, {"time": 6504, "text": "It's kind of fascinating that the more successful your AI system becomes, the more it gets integrated in society and the more precious politicians and the public and the clickbait journalists and all the different fascinating forces of our society start acting on it."}, {"time": 6520, "text": "And then it's no longer how good you are at doing the initial task."}, {"time": 6523, "text": "It's also how good you are at navigating human nature, which is a fascinating space."}, {"time": 6529, "text": "What do you think are the limits of deep learning?"}, {"time": 6532, "text": "If you allow me, we'll zoom out a little bit into the big question of artificial intelligence."}, {"time": 6538, "text": "You said dark matter of intelligence is self supervised learning, but there could be more."}, {"time": 6544, "text": "What do you think the limits of self supervised learning and just learning in general, deep learning are?"}, {"time": 6550, "text": "I think like for deep learning in particular, because self supervised learning is I would say a little bit more vague right now."}, {"time": 6556, "text": "So I wouldn't, like for something that's so vague, it's hard to predict what its limits are going to be."}, {"time": 6561, "text": "But like I said, I think anywhere you want to interact with human self supervised learning kind of hits a boundary very quickly because you need to have an interface to be able to communicate with the human."}, {"time": 6571, "text": "So really like if you have just like vacuous concepts or like just like nebulous concepts discovered by a network, it's very hard to communicate those with the human without like inserting some kind of human knowledge or some kind of like human bias there."}, {"time": 6585, "text": "In general, I think for deep learning, the biggest challenge is just like data efficiency."}, {"time": 6590, "text": "Even with self supervised learning, even with anything else, if you just see a single concept once, like one image of like, I don't know, whatever you want to call it, like any concept, it's really hard for these methods to generalize by looking at just one or two samples of things and that has been a real challenge."}, {"time": 6609, "text": "I think that's actually why like these edge cases, for example, for Tesla are actually that important."}, {"time": 6614, "text": "Because if you see just one instance of the car failing and if you just annotate that and you get that into your data set, you have like very limited guarantee that it's not going to happen again."}, {"time": 6625, "text": "And you're actually going to be able to recognize this kind of instance in a very different scenario."}, {"time": 6628, "text": "So like when it was snowing, so you got that thing labeled when it was snowing, but now when it's raining, you're actually not able to get it."}, {"time": 6634, "text": "Or you basically have the same scenario in a different part of the world."}, {"time": 6637, "text": "So the lighting was different or so on."}, {"time": 6639, "text": "So it's just really hard for these models, like deep learning especially to do that."}, {"time": 6643, "text": "How do we solve handwritten digit recognition problem when we only have one example for each number?"}, {"time": 6651, "text": "It feels like humans are using something like learning."}, {"time": 6655, "text": "I think we are good at transferring knowledge a little bit."}, {"time": 6659, "text": "We are just better at like for a lot of these problems where we are generalizing from a single sample or recognizing from a single sample, we are using a lot of our own domain knowledge and a lot of our like inductive bias into that one sample to generalize it."}, {"time": 6672, "text": "So I've never seen you write the number nine, for example."}, {"time": 6675, "text": "And if you were to write it, I would still get it."}, {"time": 6677, "text": "And if you were to write a different kind of alphabet and like write it in two different ways, I would still probably be able to figure out that these are the same two characters."}, {"time": 6684, "text": "It's just that I have been very used to seeing handwritten digits in my life."}, {"time": 6689, "text": "The other sort of problem with any deep learning system or any kind of machine learning system is like, it's guarantees, right?"}, {"time": 6694, "text": "There are no guarantees for it."}, {"time": 6695, "text": "Now you can argue that humans also don't have any guarantees."}, {"time": 6698, "text": "Like there is no guarantee that I can recognize a cat in every scenario."}, {"time": 6702, "text": "I'm sure there are going to be lots of cats that I don't recognize, lots of scenarios in which I don't recognize cats in general."}, {"time": 6708, "text": "But I think from just a sort of application perspective, you do need guarantees, right?"}, {"time": 6714, "text": "We call these things algorithms."}, {"time": 6716, "text": "Now algorithms, like traditional CS algorithms have guarantees."}, {"time": 6719, "text": "Sorting is a guarantee."}, {"time": 6721, "text": "If you were to call sort on a particular array of numbers, you are guaranteed that it's going to be sorted."}, {"time": 6727, "text": "Otherwise it's a bug."}, {"time": 6729, "text": "Now for machine learning, it's very hard to characterize this."}, {"time": 6732, "text": "We know for a fact that a cat recognition model is not going to recognize cats, every cat in the world in every circumstance."}, {"time": 6739, "text": "I think most people would agree with that statement, but we are still okay with it."}, {"time": 6743, "text": "We still don't call this as a bug."}, {"time": 6745, "text": "Whereas in traditional computer science or traditional science, like if you have this kind of failure case existing, then you think of it as like something is wrong."}, {"time": 6753, "text": "I think there is this sort of notion of nebulous correctness for machine learning."}, {"time": 6757, "text": "And that's something we just need to be very comfortable with."}, {"time": 6759, "text": "And for deep learning, or like for a lot of these machine learning algorithms, it's not clear how do we characterize this notion of correctness."}, {"time": 6766, "text": "I think limitation in our understanding, or at least a limitation in our phrasing of this."}, {"time": 6771, "text": "And if we were to come up with better ways to understand this limitation, then it would actually help us a lot."}, {"time": 6777, "text": "Do you think there's a distinction between the concept of learning and the concept of reasoning?"}, {"time": 6784, "text": "Do you think it's possible for neural networks to reason?"}, {"time": 6790, "text": "So I think of it slightly differently."}, {"time": 6791, "text": "So for me, learning is whenever I can like make a snap judgment."}, {"time": 6796, "text": "So if you show me a picture of a dog, I can immediately say it's a dog."}, {"time": 6798, "text": "But if you give me like a puzzle, like whatever a Goldsberg machine of like things going to happen, then I have to reason because I've never, it's a very complicated setup."}, {"time": 6807, "text": "I've never seen that particular setup."}, {"time": 6809, "text": "And I really need to draw and like imagine in my head what's going to happen to figure it out."}, {"time": 6814, "text": "So I think, yes, neural networks are really good at recognition, but they're not very good at reasoning."}, {"time": 6821, "text": "Because they have seen something before or seen something similar before, they're very good at making those sort of snap judgments."}, {"time": 6828, "text": "But if you were to give them a very complicated thing that they've not seen before, they have very limited ability right now to compose different things."}, {"time": 6836, "text": "Like, oh, I've seen this particular part before."}, {"time": 6838, "text": "I've seen this particular part before."}, {"time": 6840, "text": "And now probably like this is how they're going to work in tandem."}, {"time": 6842, "text": "It's very hard for them to come up with these kinds of things."}, {"time": 6845, "text": "Well, there's a certain aspect to reasoning that you can maybe convert into the process of programming."}, {"time": 6851, "text": "And so there's the whole field of program synthesis and people have been applying machine learning to the problem of program synthesis."}, {"time": 6858, "text": "And the question is, can they, the step of composition, why can't that be learned?"}, {"time": 6865, "text": "You know, this step of like building things on top of you, like little intuitions, concepts on top of each other, can that be learnable?"}, {"time": 6876, "text": "Or like, I guess similar set of techniques, do you think that will be applicable?"}, {"time": 6882, "text": "So I think it is, of course, it is learnable because like we are prime examples of machines that have like, or individuals that have learned this, right?"}, {"time": 6889, "text": "Like humans have learned this."}, {"time": 6891, "text": "So it is, of course, it is a technique that is very easy to learn."}, {"time": 6895, "text": "I think where we are kind of hitting a wall basically with like current machine learning is the fact that when the network learns all of this information, we basically are not able to figure out how well it's going to generalize to an unseen thing."}, {"time": 6910, "text": "And we have no, like a priori, no way of characterizing that."}, {"time": 6915, "text": "And I think that's basically telling us a lot about, like a lot about the fact that we really don't know what this model has learned and how well it's basically, because we don't know how well it's going to transfer."}, {"time": 6925, "text": "There's also a sense in which it feels like we humans may not be aware of how much like background, how good our background model is, how much knowledge we just have slowly building on top of each other."}, {"time": 6941, "text": "It feels like neural networks are constantly throwing stuff out."}, {"time": 6943, "text": "Like you'll do some incredible thing where you're learning a particular task in computer vision, you celebrate your state of the art successes and you throw that out."}, {"time": 6952, "text": "Like, it feels like it's, you're never using stuff you've learned for your future successes in other domains."}, {"time": 6960, "text": "And humans are obviously doing that exceptionally well, still throwing stuff away in their mind, but keeping certain kernels of truth."}, {"time": 6967, "text": "Right, so I think we're like, continual learning is sort of the paradigm for this in machine learning."}, {"time": 6971, "text": "And I don't think it's a very well explored paradigm."}, {"time": 6975, "text": "We have like things in deep learning, for example, catastrophic forgetting is like one of the standard things."}, {"time": 6980, "text": "The thing basically being that if you teach a network like to recognize dogs, and now you teach that same network to recognize cats, it basically forgets how to recognize dogs."}, {"time": 6989, "text": "So it forgets very quickly."}, {"time": 6990, "text": "I mean, and whereas a human, if you were to teach someone to recognize dogs and then to recognize cats, they don't forget immediately how to recognize these dogs."}, {"time": 6998, "text": "I think that's basically sort of what you're trying to get."}, {"time": 7000, "text": "Yeah, I just, I wonder if like the long term memory mechanisms or the mechanisms that store not just memories, but concepts that allow you to the reason and compose concepts, if those things will look very different than neural networks, or if you can do that within a single neural network with some particular sort of architecture quirks, that seems to be a really open problem."}, {"time": 7027, "text": "And of course I go up and down on that because there's something so compelling to the symbolic AI or to the ideas of logic based sort of expert systems."}, {"time": 7040, "text": "You have like human interpretable facts that built on top of each other."}, {"time": 7044, "text": "It's really annoying like with self supervised learning that the AI is not very explainable."}, {"time": 7051, "text": "Like you can't like understand all the beautiful things it has learned."}, {"time": 7055, "text": "You can't ask it like questions, but then again, maybe that's a stupid thing for us humans to want."}, {"time": 7062, "text": "Right, I think whenever we try to like understand it, we are putting our own subjective human bias into it."}, {"time": 7068, "text": "And I think that's the sort of problem with self supervised learning, the goal is that it should learn naturally from the data."}, {"time": 7074, "text": "So now if you try to understand it, you are using your own preconceived notions of what this model has learned."}, {"time": 7080, "text": "And that's the problem."}, {"time": 7083, "text": "High level question."}, {"time": 7084, "text": "What do you think it takes to build a system with superhuman, maybe let's say human level or superhuman level general intelligence?"}, {"time": 7093, "text": "We've already kind of started talking about this, but what's your intuition?"}, {"time": 7097, "text": "Like, does this thing have to have a body?"}, {"time": 7100, "text": "Does it have to interact richly with the world?"}, {"time": 7105, "text": "Does it have to have some more human elements like self awareness?"}, {"time": 7110, "text": "I think emotion."}, {"time": 7112, "text": "I think emotion is something which is like, it's not really attributed typically in standard machine learning."}, {"time": 7118, "text": "It's not something we think about, like there is NLP, there is vision, there is no like emotion."}, {"time": 7122, "text": "Emotion is never a part of all of this."}, {"time": 7124, "text": "And that just seems a little bit weird to me."}, {"time": 7127, "text": "I think the reason basically being that there is surprise and like, basically emotion is like one of the reasons emotions arise is like what happens and what do you expect to happen, right?"}, {"time": 7137, "text": "There is like a mismatch between these things."}, {"time": 7139, "text": "And so that gives rise to like, I can either be surprised or I can be saddened or I can be happy and all of this."}, {"time": 7145, "text": "And so this basically indicates that I already have a predictive model in my head and something that I predicted or something that I thought was likely to happen."}, {"time": 7153, "text": "And then there was something that I observed that happened that there was a disconnect between these two things."}, {"time": 7158, "text": "And that basically is like maybe one of the reasons like you have a lot of emotions."}, {"time": 7164, "text": "Yeah, I think, so I talk to people a lot about them like Lisa Feldman Barrett."}, {"time": 7169, "text": "I think that's an interesting concept of emotion but I have a sense that emotion primarily in the way we think about it, which is the display of emotion is a communication mechanism between humans."}, {"time": 7183, "text": "So it's a part of basically human to human interaction, an important part, but just the part."}, {"time": 7190, "text": "So it's like, I would throw it into the full mix of communication."}, {"time": 7198, "text": "And to me, communication can be done with objects that don't look at all like humans."}, {"time": 7205, "text": "I've seen our ability to anthropomorphize our ability to connect with things that look like a Roomba our ability to connect."}, {"time": 7212, "text": "First of all, let's talk about other biological systems like dogs, our ability to love things that are very different than humans."}, {"time": 7219, "text": "But they do display emotion, right?"}, {"time": 7220, "text": "I mean, dogs do display emotion."}, {"time": 7223, "text": "So they don't have to be anthropomorphic for them to like display the kind of emotions that we don't."}, {"time": 7229, "text": "So, I mean, but then the word emotion starts to lose."}, {"time": 7233, "text": "So then we have to be, I guess specific, but yeah."}, {"time": 7236, "text": "So have rich flavorful communication."}, {"time": 7239, "text": "Communication, yeah."}, {"time": 7240, "text": "Yeah, so like, yes, it's full of emotion."}, {"time": 7243, "text": "It's full of wit and humor and moods and all those kinds of things, yeah."}, {"time": 7250, "text": "So you're talking about like flavor."}, {"time": 7253, "text": "Flavor, yeah."}, {"time": 7254, "text": "Okay, let's call it that."}, {"time": 7255, "text": "So there's content and then there is flavor and I'm talking about the flavor."}, {"time": 7258, "text": "Do you think it needs to have a body?"}, {"time": 7260, "text": "Do you think like to interact with the physical world?"}, {"time": 7262, "text": "Do you think you can understand the physical world without being able to directly interact with it?"}, {"time": 7267, "text": "I don't think so, yeah."}, {"time": 7268, "text": "I think at some point we will need to bite the bullet and actually interact with the physical, as much as I like working on like passive computer vision where I just like sit in my arm chair and look at videos and learn."}, {"time": 7279, "text": "I do think that we will need to have some kind of embodiment or some kind of interaction to figure out things about the world."}, {"time": 7288, "text": "Do you think, how often do you think about consciousness when you think about your work?"}, {"time": 7294, "text": "You could think of it as the more simple thing of self awareness, of being aware that you are a perceiving, sensing, acting thing in this world."}, {"time": 7306, "text": "Or you can think about the bigger version of that, which is consciousness, which is having it feel like something to be that entity, the subjective experience of being in this world."}, {"time": 7319, "text": "So I think of self awareness a little bit more than like the broader goal of it, because I think self awareness is pretty critical for like any kind of like any kind of AGI or whatever you want to call it that we build, because it needs to contextualize what it is and what role it's playing with respect to all the other things that exist around it."}, {"time": 7337, "text": "I think that requires self awareness."}, {"time": 7339, "text": "It needs to understand that it's an autonomous car, right?"}, {"time": 7346, "text": "What are the things that it is supposed to do and so on?"}, {"time": 7349, "text": "What is its role in some way?"}, {"time": 7350, "text": "Or, I mean, these are the kinds of things that we kind of expect from it, I would say."}, {"time": 7356, "text": "And so that's the level of self awareness that's, I would say, basically required at least, if not more than that."}, {"time": 7364, "text": "Yeah, I tend to, on the emotion side, believe that it has to have, it has to be able to display consciousness."}, {"time": 7372, "text": "Display consciousness, what do you mean by that?"}, {"time": 7374, "text": "Meaning like for us humans to connect with each other or to connect with other living entities, I think we need to feel, like in order for us to truly feel like that there's another being there, we have to believe that they're conscious."}, {"time": 7391, "text": "And so we won't ever connect with something that doesn't have elements of consciousness."}, {"time": 7397, "text": "Now I tend to think that that's easier to achieve than it may sound, because we anthropomorphize stuff so hard."}, {"time": 7405, "text": "Like you have a mug that just like has wheels and like rotates every once in a while and makes a sound."}, {"time": 7411, "text": "I think a couple of days in, especially if you don't hang out with humans, you might start to believe that mug on wheels is conscious."}, {"time": 7422, "text": "So I think we anthropomorphize pretty effectively as human beings."}, {"time": 7426, "text": "But I do think that it's in the same bucket that we'll call emotion, that show that you're, I think of consciousness as the capacity to suffer."}, {"time": 7438, "text": "And if you're an entity that's able to feel things in the world and to communicate that to others, I think that's a really powerful way to interact with humans."}, {"time": 7450, "text": "And in order to create an AGI system, I believe you should be able to richly interact with humans."}, {"time": 7458, "text": "Like humans would need to want to interact with you."}, {"time": 7461, "text": "Like it can't be like, it's the self supervised learning versus like, like the robot shouldn't have to pay you to interact with me."}, {"time": 7470, "text": "So like it should be a natural fun thing."}, {"time": 7473, "text": "And then you're going to scale up significantly how much interaction it gets."}, {"time": 7479, "text": "It's the Alexa prize, which they were trying to get me to be a judge on their contest."}, {"time": 7484, "text": "Let's see if I want to do that."}, {"time": 7486, "text": "But their challenge is to talk to you, make the human sufficiently interested that the human keeps talking for 20 minutes."}, {"time": 7496, "text": "To Alexa?"}, {"time": 7497, "text": "To Alexa, yeah."}, {"time": 7498, "text": "And right now they're not even close to that because it just gets so boring when you're like, when the intelligence is not there, it gets very not interesting to talk to it."}, {"time": 7506, "text": "And so the robot needs to be interesting."}, {"time": 7508, "text": "And one of the ways it can be interesting is display the capacity to love, to suffer."}, {"time": 7514, "text": "And I would say that essentially means the capacity to display consciousness."}, {"time": 7520, "text": "Like it is an entity, much like a human being."}, {"time": 7525, "text": "Of course, what that really means, I don't know if that's fundamentally a robotics problem or some kind of problem that we're not yet even aware."}, {"time": 7533, "text": "Like if it is truly a hard problem of consciousness, I tend to maybe optimistically think it's a, we can pretty effectively fake it till we make it."}, {"time": 7542, "text": "So we can display a lot of human like elements for a while."}, {"time": 7546, "text": "And that will be sufficient to form really close connections with humans."}, {"time": 7552, "text": "What's used the most beautiful idea in self supervised learning?"}, {"time": 7555, "text": "Like when you sit back with, I don't know, with a glass of wine and an armchair and just at a fireplace, just thinking how beautiful this world that you get to explore is, what do you think is the especially beautiful idea?"}, {"time": 7573, "text": "The fact that like object level, what objects are and some notion of objectness emerges from these models by just like self supervised learning."}, {"time": 7583, "text": "So for example, like one of the things like the dyno paper that I was a part of at Facebook is the object sort of boundaries emerge from these representations."}, {"time": 7595, "text": "So if you have like a dog running in the field, the boundaries around the dog, the network is basically able to figure out what the boundaries of this dog are automatically."}, {"time": 7605, "text": "And it was never trained to do that."}, {"time": 7607, "text": "It was never trained to, no one taught it that this is a dog and these pixels belong to a dog."}, {"time": 7612, "text": "It's able to group these things together automatically."}, {"time": 7616, "text": "I think in general, that entire notion that this dumb idea that you take like these two crops of an image and then you say that the features should be similar, that has resulted in something like this, like the model is able to figure out what the dog pixels are and so on."}, {"time": 7630, "text": "That just seems like so surprising."}, {"time": 7633, "text": "And I mean, I don't think a lot of us even understand how that is happening really."}, {"time": 7638, "text": "And it's something we are taking for granted, maybe like a lot in terms of how we're setting up these algorithms, but it's just, it's a very beautiful and powerful idea."}, {"time": 7646, "text": "So it's really fundamentally telling us something about that there is so much signal in the pixels that we can be super dumb about it."}, {"time": 7654, "text": "How about how we are setting up the self sequencing problem."}, {"time": 7657, "text": "And despite being like super dumb about it, we'll actually get very good, like we'll actually get something that is able to do very like surprising things."}, {"time": 7665, "text": "I wonder if there's other like objectness of other concepts that can emerge."}, {"time": 7671, "text": "I don't know if you follow Francois Chollet, he had the competition for intelligence that basically it's kind of like an IQ test, but for machines, but for an IQ test, you have to have a few concepts that you want to apply."}, {"time": 7685, "text": "One of them is objectness."}, {"time": 7687, "text": "I wonder if those concepts can emerge through self supervised learning on billions of images."}, {"time": 7694, "text": "I think something like object permanence can definitely emerge, right?"}, {"time": 7697, "text": "So that's like a fundamental concept which we have, maybe not through images, through video, but that's another concept that should be emerging from it because it's not something that, like if we don't teach humans that this isn't, this is like about this concept of object permanence, it actually emerges."}, {"time": 7712, "text": "And the same thing for like animals, like dogs, I think actually permanence automatically is something that they are born with."}, {"time": 7718, "text": "So I think it should emerge from the data."}, {"time": 7720, "text": "It should emerge basically very quickly."}, {"time": 7722, "text": "I wonder if ideas like symmetry, rotation, these kinds of things might emerge."}, {"time": 7727, "text": "So I think rotation, probably yes."}, {"time": 7730, "text": "Yeah, rotation, yes."}, {"time": 7731, "text": "I mean, there's some constraints in the architecture itself, but it's interesting if all of them could be, like counting was another one, being able to kind of understand that there's multiple objects of the same kind in the image and be able to count them."}, {"time": 7750, "text": "I wonder if all of that could be, if constructed correctly, they can emerge because then you can transfer those concepts to then interpret images at a deeper level."}, {"time": 7761, "text": "Counting, I do believe, I mean, it should be possible."}, {"time": 7764, "text": "You don't know like yet, but I do think it's not that far in the realm of possibility."}, {"time": 7769, "text": "Yeah, that'd be interesting if using self supervised learning on images can then be applied to then solving those kinds of IQ tests, which seem currently to be kind of impossible."}, {"time": 7780, "text": "What idea do you believe might be true that most people think is not true or don't agree with you on?"}, {"time": 7788, "text": "Is there something like that?"}, {"time": 7790, "text": "So this is going to be a little controversial, but okay, sure."}, {"time": 7793, "text": "I don't believe in simulation."}, {"time": 7795, "text": "Like actually using simulation to do things very much."}, {"time": 7798, "text": "Just to clarify, because this is a podcast where you talk about, are we living in a simulation often?"}, {"time": 7803, "text": "You're referring to using simulation to construct worlds that you then leverage for machine learning."}, {"time": 7811, "text": "For example, like one example would be like to train an autonomous car driving system."}, {"time": 7815, "text": "You basically first build a simulator, which builds like the environment of the world."}, {"time": 7819, "text": "And then you basically have a lot of like, you train your machine learning system in that."}, {"time": 7825, "text": "So I believe it is possible, but I think it's a really expensive way of doing things."}, {"time": 7830, "text": "And at the end of it, you do need the real world."}, {"time": 7833, "text": "So I'm not sure."}, {"time": 7835, "text": "So maybe for certain settings, like maybe the payout is so large, like for autonomous driving, the payout is so large that you can actually invest that much money to build it."}, {"time": 7843, "text": "But I think as a general sort of principle, it does not apply to a lot of concepts."}, {"time": 7847, "text": "You can't really build simulations of everything."}, {"time": 7849, "text": "Not only because like one, it's expensive, because second, it's also not possible for a lot of things."}, {"time": 7854, "text": "So in general, like there's a lot of work on like using synthetic data and like synthetic simulators."}, {"time": 7862, "text": "I generally am not very, like I don't believe in that."}, {"time": 7865, "text": "So you're saying it's very challenging visually, like to correctly like simulate the visual, like the lighting, all those kinds of things."}, {"time": 7873, "text": "I mean, all these companies that you have, right?"}, {"time": 7875, "text": "So like Pixar and like whatever, all these companies are, all this like computer graphics stuff is really about accurately, a lot of them is about like accurately trying to figure out how the lighting is and like how things reflect off of one another and so on, and like how sparkly things look and so on."}, {"time": 7892, "text": "So it's a very hard problem."}, {"time": 7894, "text": "So do we really need to solve that first to be able to like do computer vision?"}, {"time": 7900, "text": "And for me, in the context of autonomous driving, it's very tempting to be able to use simulation, right?"}, {"time": 7908, "text": "Because it's a safety critical application, but the other limitation of simulation that perhaps is a bigger one than the visual limitation is the behavior of objects."}, {"time": 7920, "text": "So you're ultimately interested in edge cases."}, {"time": 7923, "text": "And the question is, how well can you generate edge cases in simulation, especially with human behavior?"}, {"time": 7931, "text": "I think another problem is like for autonomous driving, it's a constantly changing world."}, {"time": 7935, "text": "So say autonomous driving like in 10 years from now, like there are lots of autonomous cars, but they're still going to be humans."}, {"time": 7942, "text": "So now there are 50% of the agents say, which are humans, 50% of the agents that are autonomous, like car driving agents."}, {"time": 7948, "text": "So now the mixture has changed."}, {"time": 7950, "text": "So now the kinds of behaviors that you actually expect from the other agents or other cars on the road are actually going to be very different."}, {"time": 7956, "text": "And as the proportion of the number of autonomous cars to humans keeps changing, this behavior will actually change a lot."}, {"time": 7962, "text": "So now if you were to build a simulator based on just like right now to build them today, you don't have that many autonomous cars on the road."}, {"time": 7968, "text": "So you would try to like make all of the other agents in that simulator behave as humans, but that's not really going to hold true 10, 15, 20, 30 years from now."}, {"time": 7981, "text": "How hard is it?"}, {"time": 7982, "text": "This is why I think it's an interesting question."}, {"time": 7984, "text": "How hard is it to build a video game, like virtual reality game where it is so real, forget like ultra realistic to where you can't tell the difference, but like it's so nice that you just want to stay there."}, {"time": 8000, "text": "You just want to stay there and you don't want to come back."}, {"time": 8004, "text": "Do you think that's doable within our lifetime?"}, {"time": 8009, "text": "Within our lifetime, probably."}, {"time": 8012, "text": "I eat healthy, I live long."}, {"time": 8013, "text": "Does that make you sad that there'll be like like population of kids that basically spend 95%, 99% of their time in a virtual world?"}, {"time": 8030, "text": "Very, very hard question to answer."}, {"time": 8033, "text": "For certain people, it might be something that they really derive a lot of value out of, derive a lot of enjoyment and like happiness out of, and maybe the real world wasn't giving them that."}, {"time": 8043, "text": "That's why they did that."}, {"time": 8043, "text": "So maybe it is good for certain people."}, {"time": 8045, "text": "So ultimately, if it maximizes happiness, Right, I think if."}, {"time": 8050, "text": "Or we could judge."}, {"time": 8051, "text": "Yeah, I think if it's making people happy, maybe it's okay."}, {"time": 8054, "text": "Again, I think this is a very hard question."}, {"time": 8058, "text": "So like you've been a part of a lot of amazing papers."}, {"time": 8063, "text": "What advice would you give to somebody on what it takes to write a good paper?"}, {"time": 8069, "text": "Grad students writing papers now, is there common things that you've learned along the way that you think it takes, both for a good idea and a good paper?"}, {"time": 8079, "text": "Right, so I think both of these have picked up from like lots of people I've worked with in the past."}, {"time": 8086, "text": "So one of them is picking the right problem to work on in research is as important as like finding the solution to it."}, {"time": 8093, "text": "So I mean, there are multiple reasons for this."}, {"time": 8096, "text": "So one is that there are certain problems that can actually be solved in a particular timeframe."}, {"time": 8102, "text": "So now say you want to work on finding the meaning of life."}, {"time": 8106, "text": "This is a great problem."}, {"time": 8107, "text": "I think most people will agree with that."}, {"time": 8109, "text": "But do you believe that your talents and like the energy that you'll spend on it will make some kind of meaningful progress in your lifetime?"}, {"time": 8118, "text": "If you are optimistic about it, then go ahead."}, {"time": 8121, "text": "That's why I started this podcast."}, {"time": 8122, "text": "I keep asking people about the meaning of life."}, {"time": 8124, "text": "I'm hoping by episode like 2.20, I'll figure it out."}, {"time": 8127, "text": "Oh, not too many episodes to go."}, {"time": 8131, "text": "Maybe today, I don't know, but you're right."}, {"time": 8133, "text": "So that seems intractable at the moment."}, {"time": 8136, "text": "Right, so I think it's just the fact of like, if you're starting a PhD, for example, what is one problem that you want to focus on that you do think is interesting enough, and you will be able to make a reasonable amount of headway into it that you think you'll be doing a PhD for?"}, {"time": 8150, "text": "So in that kind of a timeframe."}, {"time": 8153, "text": "Of course, there's the second part, which is what excites you genuinely."}, {"time": 8156, "text": "So you shouldn't just pick problems that you are not excited about, because as a grad student or as a researcher, you really need to be passionate about it to continue doing that, because there are so many other things that you could be doing in life."}, {"time": 8167, "text": "So you really need to believe in that to be able to do that for that long."}, {"time": 8170, "text": "In terms of papers, I think the one thing that I've learned is, like in the past, whenever I used to write things, and even now, whenever I do that, I try to cram in a lot of things into the paper, whereas what really matters is just pushing one simple idea, that's it."}, {"time": 8185, "text": "That's all because the paper is going to be like, whatever, eight or nine pages."}, {"time": 8192, "text": "If you keep cramming in lots of ideas, it's really hard for the single thing that you believe in to stand out."}, {"time": 8222, "text": "So as a grad student, I used to always wait to it, maybe in the last week or whatever, to write the paper, because I used to always believe that doing the experiments was actually the bigger part of research than writing."}, {"time": 8233, "text": "And my advisor always told me that you should start writing very early on, and I thought, oh, it doesn't matter, I don't know what he's talking about."}, {"time": 8239, "text": "But I think more and more I realized that's the case."}, {"time": 8242, "text": "Whenever I write something that I'm doing, I actually think much better about it."}, {"time": 8246, "text": "And so if you start writing early on, you actually, I think, get better ideas, or at least you figure out holes in your theory, or particular experiments that you should run to plug those holes, and so on."}, {"time": 8258, "text": "Yeah, I'm continually surprised how many really good papers throughout history are quite short and quite simple."}, {"time": 8268, "text": "And there's a lesson to that."}, {"time": 8270, "text": "If you want to dream about writing a paper that changes the world, and you wanna go by example, they're usually simple."}, {"time": 8278, "text": "And that's, it's not cramming, or it's focusing on one idea, and thinking deeply."}, {"time": 8287, "text": "And you're right that the writing process itself reveals the idea."}, {"time": 8292, "text": "It challenges you to really think about what is the idea that explains it, the thread that ties it all together."}, {"time": 8299, "text": "And so a lot of famous researchers I know actually would start off, like, first they were, even before the experiments were in, a lot of them would actually start with writing the introduction of the paper, with zero experiments in."}, {"time": 8312, "text": "Because that at least helps them figure out what they're trying to solve, and how it fits in the context of things right now."}, {"time": 8318, "text": "And that would really guide their entire research."}, {"time": 8320, "text": "So a lot of them would actually first write in intros with zero experiments in, and that's how they would start projects."}, {"time": 8326, "text": "Some basic questions about people maybe that are more like beginners in this field."}, {"time": 8331, "text": "What's the best programming language to learn if you're interested in machine learning?"}, {"time": 8336, "text": "I would say Python, just because it's the easiest one to learn."}, {"time": 8340, "text": "And also a lot of like programming and machine learning happens in Python."}, {"time": 8345, "text": "So if you don't know any other programming language, Python is actually going to get you a long way."}, {"time": 8349, "text": "Yeah, it seems like sort of a, it's a toss up question because it seems like Python is so much dominating the space now."}, {"time": 8356, "text": "But I wonder if there's an interesting alternative."}, {"time": 8358, "text": "Obviously there's like Swift, and there's a lot of interesting alternatives popping up, even JavaScript."}, {"time": 8363, "text": "So I, or are more like for the data science applications."}, {"time": 8368, "text": "But it seems like Python more and more is actually being used to teach like introduction to programming at universities."}, {"time": 8375, "text": "So it just combines everything very nicely."}, {"time": 8379, "text": "Even harder question."}, {"time": 8381, "text": "What are the pros and cons of PyTorch versus TensorFlow?"}, {"time": 8389, "text": "You can go with no comment."}, {"time": 8391, "text": "So a disclaimer to this is that the last time I used TensorFlow was probably like four years ago."}, {"time": 8396, "text": "And so it was right when it had come out because so I started on like deep learning in 2014 or so, and the dominant sort of framework for us then for vision was Cafe, which was out of Berkeley."}, {"time": 8409, "text": "And we used Cafe a lot, it was really nice."}, {"time": 8412, "text": "And then TensorFlow came in, which was basically like Python first."}, {"time": 8415, "text": "So Cafe was mainly C++, and it had like very loose kind of Python binding."}, {"time": 8419, "text": "So Python wasn't really the first language you would use."}, {"time": 8421, "text": "You would really use either MATLAB or C++ like get stuff done in like Cafe."}, {"time": 8428, "text": "And then Python of course became popular a little bit later."}, {"time": 8430, "text": "So TensorFlow was basically around that time."}, {"time": 8432, "text": "So 2015, 2016 is when I last used it."}, {"time": 8436, "text": "It's been a while."}, {"time": 8437, "text": "And then what, did you use Torch or did you?"}, {"time": 8440, "text": "So then I moved to LuaTorch, which was the torch in Lua."}, {"time": 8444, "text": "And then in 2017, I think basically pretty much to PyTorch completely."}, {"time": 8449, "text": "So you went to Lua, cool."}, {"time": 8451, "text": "Huh, so you were there before it was cool."}, {"time": 8454, "text": "Yeah, I mean, so LuaTorch was really good because it actually allowed you to do a lot of different kinds of things."}, {"time": 8461, "text": "So which Cafe was very rigid in terms of its structure."}, {"time": 8463, "text": "Like you would create a neural network once and that's it."}, {"time": 8466, "text": "Whereas if you wanted like very dynamic graphs and so on, it was very hard to do that."}, {"time": 8470, "text": "And LuaTorch was much more friendly for all of these things."}, {"time": 8473, "text": "Okay, so in terms of PyTorch and TensorFlow, my personal bias is PyTorch just because I've been using it longer and I'm more familiar with it."}, {"time": 8480, "text": "And also that PyTorch is much easier to debug is what I find because it's imperative in nature compared to like TensorFlow, which is not imperative."}, {"time": 8488, "text": "But that's telling you a lot that basically the imperative design is sort of a way in which a lot of people are taught programming and that's what actually makes debugging easier for them."}, {"time": 8498, "text": "So like I learned programming in C, C++."}, {"time": 8500, "text": "And so for me, imperative way of programming is more natural."}, {"time": 8504, "text": "Do you think it's good to have kind of these two communities, this kind of competition?"}, {"time": 8508, "text": "I think PyTorch is kind of more and more becoming dominant in the research community, but TensorFlow is still very popular in the more sort of application machine learning community."}, {"time": 8517, "text": "So do you think it's good to have that kind of split in code bases?"}, {"time": 8522, "text": "Or so like the benefit there is the competition challenges the library developers to step up to a game."}, {"time": 8529, "text": "But the downside is there's these code bases that are in different libraries."}, {"time": 8535, "text": "Right, so I think the downside is that, I mean, for a lot of research code that's released in one framework and if you're using the other one, it's really hard to like really build on top of it."}, {"time": 8543, "text": "But thankfully the open source community in machine learning is amazing."}, {"time": 8547, "text": "So whenever like something pops up in TensorFlow, you wait a few days and someone who's like super sharp will actually come and translate that particular code based into PyTorch and basically have figured that all the nooks and crannies out."}, {"time": 8559, "text": "So the open source community is amazing and they really like figure out this gap."}, {"time": 8564, "text": "So I think in terms of like having these two frameworks or multiple, I think of course there are different use cases so there are going to be benefits to using one or the other framework."}, {"time": 8572, "text": "And like you said, I think competition is just healthy because both of these frameworks keep or like all of these frameworks really sort of keep learning from each other and keep incorporating different things to just make them better and better."}, {"time": 8583, "text": "What advice would you have for someone new to machine learning, you know, maybe just started or haven't even started but are curious about it and who want to get in the field?"}, {"time": 8594, "text": "Don't be afraid to get your hands dirty."}, {"time": 8596, "text": "I think that's the main thing."}, {"time": 8597, "text": "So if something doesn't work, like really drill into why things are not working."}, {"time": 8602, "text": "Can you elaborate what your hands dirty means?"}, {"time": 8604, "text": "Right, so for example, like if an algorithm, if you try to train the network and it's not converging, whatever, rather than trying to like Google the answer or trying to do something, like really spend those like five, eight, 10, 15, 20, whatever number of hours really trying to figure it out yourself."}, {"time": 8619, "text": "Because in that process, you'll actually learn a lot more."}, {"time": 8622, "text": "Googling is of course like a good way to solve it when you need a quick answer."}, {"time": 8625, "text": "But I think initially, especially like when you're starting out, it's much nicer to like figure things out by yourself."}, {"time": 8631, "text": "And I just say that from experience because like when I started out, there were not a lot of resources."}, {"time": 8635, "text": "So we would like in the lab, a lot of us, like we would look up to senior students and then the senior students were of course busy and they would be like, hey, why don't you go figure it out?"}, {"time": 8643, "text": "Because I just don't have the time."}, {"time": 8644, "text": "I'm working on my dissertation or whatever."}, {"time": 8646, "text": "I'll find a PhD students."}, {"time": 8647, "text": "And so then we would sit down and like just try to figure it out."}, {"time": 8650, "text": "And that I think really helped me."}, {"time": 8652, "text": "That has really helped me figure a lot of things out."}, {"time": 8655, "text": "I think in general, if I were to generalize that, I feel like persevering through any kind of struggle on a thing you care about is good."}, {"time": 8665, "text": "So you're basically, you try to make it seem like it's good to spend time debugging, but really any kind of struggle, whatever form that takes, it could be just Googling a lot."}, {"time": 8676, "text": "Just basically anything, just sticking with it and going through the hard thing that could take a form of implementing stuff from scratch."}, {"time": 8683, "text": "It could take the form of re implementing with different libraries or different programming languages."}, {"time": 8689, "text": "It could take a lot of different forms, but struggle is good for the soul."}, {"time": 8693, "text": "So like in Pittsburgh, where I did my PhD, the thing was it used to snow a lot."}, {"time": 8698, "text": "And so when it was snowed, you really couldn't do much."}, {"time": 8700, "text": "So the thing that a lot of people said was snow builds character."}, {"time": 8705, "text": "Because when it's snowing, you can't do anything else."}, {"time": 8707, "text": "You focus on work."}, {"time": 8709, "text": "Do you have advice in general for people, you've already exceptionally successful, you're young, but do you have advice for young people starting out in college or maybe in high school?"}, {"time": 8718, "text": "Advice for their career, advice for their life, how to pave a successful path in career and life?"}, {"time": 8725, "text": "I would say just be hungry."}, {"time": 8727, "text": "Always be hungry for what you want."}, {"time": 8729, "text": "And I think I've been inspired by a lot of people who are just driven and who really go for what they want, no matter what, like you shouldn't want it, you should need it."}, {"time": 8740, "text": "So if you need something, you basically go towards the ends to make it work."}, {"time": 8744, "text": "How do you know when you come across a thing that's like you need?"}, {"time": 8751, "text": "I think there's not going to be any single thing that you're going to need."}, {"time": 8753, "text": "There are going to be different types of things that you need, but whenever you need something, you just go push for it."}, {"time": 8757, "text": "And of course, once you, you may not get it, or you may find that this was not even the thing that you were looking for, it might be a different thing."}, {"time": 8763, "text": "But the point is like you're pushing through things and that actually brings a lot of skills and builds a certain kind of attitude which will probably help you get the other thing once you figure out what's really the thing that you want."}, {"time": 8778, "text": "Yeah, I think a lot of people are, I've noticed, kind of afraid of that is because one, it's a fear of commitment."}]}]