[{"title": "Paul Krugman: Economics of Innovation, Automation, Safety Nets & UBI | Lex Fridman Podcast #67", "id": "OJQepiqSWvg", "quotes": [{"time": 482, "text": "Or is most of the disagreement simply about the path to get there?"}, {"time": 491, "text": "Oh, I think there's two levels of disagreement."}, {"time": 491, "text": "One, maybe not utopia, but justice."}, {"time": 491, "text": "You know, what is a just society?"}, {"time": 500, "text": "And that's, there are different views."}, {"time": 500, "text": "I mean, I teach my students that there are, you know, broadly speaking, two views of justice."}, {"time": 505, "text": "One focuses on outcomes."}, {"time": 514, "text": "You ask yourself, a just society is the one you would choose if you were trying to, the one that you would choose to live in if you didn't know who you were going to be, that's kind of John Rawls."}, {"time": 525, "text": "And the other focuses on process, that a just society is one in which there is no coercion except where absolutely necessary."}, {"time": 532, "text": "And there's no objective way to choose between those."}, {"time": 540, "text": "I'm pretty much a Rawlsian, and I think many people are."}, {"time": 540, "text": "But anyway, so there's a legitimate dispute about what we mean by a just society anyway."}, {"time": 546, "text": "But then there's also a lot of a lot of dispute about what actually works."}, {"time": 553, "text": "There's a range of legitimate dispute."}, {"time": 553, "text": "I mean, any card carrying economist will say that incentives matter, but how much do they matter?"}, {"time": 562, "text": "How much does a higher tax rate actually deter people from working?"}, {"time": 568, "text": "How much does a stronger safety net actually lead people to get lazy?"}, {"time": 574, "text": "I have a pretty strong view that the evidence points to conclusions that are considerably to the left of where most of our politicians are."}, {"time": 586, "text": "But there is legitimate room for disagreement on those things."}, {"time": 593, "text": "So you've mentioned outcomes."}, {"time": 593, "text": "What are some metrics you think about that you keep in mind, like the Gini coefficient, but really anything that measures how good we're doing, whatever we're trying to do?"}, {"time": 607, "text": "What are the metrics you keep an eye on?"}, {"time": 612, "text": "Well, I'm actually I'm not a fan of the Gini coefficient, not because what is the Gini coefficient?"}, {"time": 617, "text": "Yeah, the Gini coefficient is a measure of inequality, and it is commonly used because it's a single number."}, {"time": 623, "text": "It usually tracks with other measures, but the trouble is there's no sort of natural interpretation of it."}, {"time": 629, "text": "If you ask me what does a society with a Gini of 0.45 look like as opposed to a society with a Gini of 0.25?"}, {"time": 640, "text": "And I can kind of tell you, you know, when 0.25 is Denmark and 0.45 is Brazil, but there's no sort of easy way to do that mapping."}, {"time": 656, "text": "I mean, I look at things like what is, first of all, things like what is the income of the median family?"}, {"time": 664, "text": "What is the income of the top 1%?"}, {"time": 664, "text": "How many people are in poverty by various measures of poverty?"}, {"time": 672, "text": "And then I think you want to look at questions like how healthy are people?"}, {"time": 678, "text": "How is life expectancy doing?"}, {"time": 678, "text": "And how satisfied are people with their lives?"}, {"time": 690, "text": "Because there is that sounds like a squishy number, not so much happiness."}, {"time": 690, "text": "It turns out that life satisfaction is a better measure than happiness."}, {"time": 695, "text": "But life satisfaction, that varies quite a lot."}, {"time": 700, "text": "And I think it's meaningful, if not too rigorous to say, look, according to polling, people in Denmark are pretty satisfied with their lives and people in the United States, not so much so."}, {"time": 716, "text": "And of course, Sweden wins every time."}, {"time": 721, "text": "No, actually Denmark wins these days."}, {"time": 721, "text": "Denmark and Norway tend to win these days."}, {"time": 721, "text": "Sweden doesn't do badly."}, {"time": 726, "text": "None of these are perfect."}, {"time": 726, "text": "But look, I think by and large, there's a bit of a pornography test."}, {"time": 738, "text": "How do you know a decent society?"}, {"time": 738, "text": "Well, you kind of know it when you see it."}, {"time": 743, "text": "Where does America stand on that?"}, {"time": 746, "text": "We have a remarkable..."}, {"time": 746, "text": "There are a lot of virtues to America, but there's a level of harshness, brutality, an ability for somebody who just has bad luck to fall off the edge, that is really, shouldn't be happening in a country as rich as ours."}, {"time": 766, "text": "So we have somehow managed to produce a a crueller society than almost any other wealthy country for no good reason."}, {"time": 779, "text": "What do you think is lacking in the safety net that the United States provides?"}, {"time": 779, "text": "You said there's a harshness to it."}, {"time": 784, "text": "And what are the benefits and maybe limits of a safety net in a country like ours?"}, {"time": 791, "text": "Well, every other advanced country has some universal guarantee of adequate healthcare."}, {"time": 796, "text": "The United States is the only place where citizens can actually fail to get basic healthcare because they can't afford it."}, {"time": 807, "text": "It's not hard to do."}, {"time": 807, "text": "Everybody else does it, but we don't."}, {"time": 807, "text": "We've gotten a little bit better at it than we were, but still, that's a big deal."}, {"time": 814, "text": "We have remarkably weak support for children."}, {"time": 825, "text": "Most countries have substantial safety... Parents of young children get much more support elsewhere."}, {"time": 833, "text": "They get often nothing in the US."}, {"time": 833, "text": "We have limited care for people."}, {"time": 833, "text": "Long term care for the elderly is a very hit and miss thing."}, {"time": 844, "text": "But I think that the really big issues are that we don't take care of children who make the mistake of having the wrong parents, and we don't take care of people who make the mistake of getting sick."}, {"time": 860, "text": "And those are things that a rich country should be doing."}, {"time": 866, "text": "Sorry for sort of a difficult question, but what you just said kind of feels like the right thing to do in terms of a just society."}, {"time": 872, "text": "But is it also good for the economic health of society to take care of the people who are the unfortunate members of society?"}, {"time": 884, "text": "By and large, it looks like doing the right thing in terms of justice is also the right thing in terms of economics."}, {"time": 892, "text": "If we're talking about a society that has extremely high tax rates that deter, remove all incentives to provide a safety net that is so generous that why bother working or striving, that could be a problem."}, {"time": 907, "text": "But I don't actually know any society that looks like that."}, {"time": 913, "text": "Even in European countries with very generous safety nets, people work and innovate and do all of these things."}, {"time": 920, "text": "And there's a lot of evidence now that lacking those basics is actually destructive, that children who grow up without adequate health care, without adequate nutrition, are developmentally challenged."}, {"time": 934, "text": "They don't live up to their potential as adults."}, {"time": 934, "text": "So the United States actually probably pays a price."}, {"time": 940, "text": "We're harsh, we're cruel, and we actually make ourselves poorer as a society, not just the individuals, by being so harsh and cruel."}, {"time": 952, "text": "Okay, so Invisible Hand, Smith, where does that fit in?"}, {"time": 952, "text": "The power of just people acting selfishly and somehow everything taking care of itself to where the economy grows, nobody, there's no cruelty, no injustice, that the markets regulate themselves."}, {"time": 966, "text": "Is there power to that idea and what are its limits?"}, {"time": 974, "text": "There's a lot of power to that."}, {"time": 974, "text": "I mean, there's a reason why I don't think sensible people want the government running steel mills or they want the government to own the farms, right?"}, {"time": 989, "text": "The markets are a pretty effective way of getting incentives aligned, of inducing people to do stuff that works."}, {"time": 1000, "text": "And the Invisible Hand is saying that farmers aren't growing crops because they want to feed people, they're growing crops because they can make money by it, but it actually turns out to be a pretty good way of getting an agrarian of getting agricultural products grown."}, {"time": 1016, "text": "So the Invisible Hand is an important part, but there's nothing mystical about it."}, {"time": 1024, "text": "It's a mechanism, it's a way to organize economic activity, which works well given a bunch of preconditions, which means that it actually works well for agriculture, it works well for manufacturing, it works well for many services, it doesn't work well for healthcare, it doesn't work well for education."}, {"time": 1042, "text": "So having a society which is kind of three quarters Invisible Hand and one quarter Visible Hand, something on that order seems to be the balance that works best."}, {"time": 1059, "text": "You don't want to romanticize or make something mystical out of it."}, {"time": 1067, "text": "This is one way to organize stuff that happens to have broad but not universal application."}, {"time": 1074, "text": "So then forgive me for romanticizing it, but it does seem pretty magical."}, {"time": 1074, "text": "I kind of have an intuitive understanding of what happens when you have like five, ten, maybe even a hundred people together, the dynamics of that."}, {"time": 1086, "text": "But the fact that these large society of people for the most part acting in a self interested way and maybe electing representatives for themselves, that it all kind of seems to work, it's pretty magical."}, {"time": 1097, "text": "The fact that right now there's a wide assortment of fresh fruit and vegetables in the local markets up and down the street, who's planning that?"}, {"time": 1119, "text": "And the answer is nobody."}, {"time": 1119, "text": "That's the Invisible Hand at work and that's great."}, {"time": 1123, "text": "And that's a lesson that Adam Smith figured out more than 200 years ago and it continues to apply."}, {"time": 1136, "text": "But even Adam Smith has a section in his book about why it's important to regulate banks."}, {"time": 1142, "text": "So the Invisible Hand has its limits."}, {"time": 1142, "text": "And that example is actually a powerful one in terms of the supermarket and fruit."}, {"time": 1147, "text": "That was my experience coming from Russia from the Soviet Union is when I first entered a supermarket and just seeing the assortment of fruit, bananas."}, {"time": 1153, "text": "I don't think I've seen bananas before, first of all, but just the selection of fresh fruit was just mind blowing."}, {"time": 1167, "text": "Beyond words and the fact that, like you said, I don't know what made that happen."}, {"time": 1172, "text": "Well, there is some magic to the market."}, {"time": 1172, "text": "As showing my age, but the old movie quote, sometimes the magic works and sometimes it doesn't."}, {"time": 1180, "text": "And you have to have some idea of when it doesn't."}, {"time": 1183, "text": "So how do you get regulation?"}, {"time": 1183, "text": "What can government at its best do?"}, {"time": 1183, "text": "Government, strangely enough in this country today, seems to get a bad rap."}, {"time": 1192, "text": "Everybody's against the government."}, {"time": 1201, "text": "Well, a lot of money has been spent on making people hate the government."}, {"time": 1204, "text": "But the reality is government does some things pretty well."}, {"time": 1204, "text": "I mean, government does health insurance pretty well."}, {"time": 1212, "text": "So much so, I mean, given our anti government bias, it really is true that there are people out there saying, don't let the government get its hands on Medicare."}, {"time": 1217, "text": "So people actually love the government health insurance program far more than they love private health insurance."}, {"time": 1228, "text": "Basic education."}, {"time": 1228, "text": "It turns out that your local public high school is the right place to have students trained and private for, certainly for profit education is by and large a nightmare of rip offs and grift and people not getting what they thought they were paying for."}, {"time": 1256, "text": "It's a judgment case."}, {"time": 1256, "text": "And it's funny, there are things, I mean, everybody talks about the DMV as being, do you want the economy?"}, {"time": 1265, "text": "Actually, my experience is that the DMV have always been positive."}, {"time": 1271, "text": "Maybe I'm just going to the right DMVs, but in fact, a lot of government works pretty well."}, {"time": 1277, "text": "So to some extent, you can do these things on a priori grounds."}, {"time": 1277, "text": "You can talk about the logic of why healthcare is not going to be handled well by the market, but partly it's just experience."}, {"time": 1290, "text": "We tried, or at least some countries have tried nationalizing their steel industries, that didn't go well."}, {"time": 1294, "text": "But we've tried privatizing education and that didn't go well."}, {"time": 1294, "text": "So you find out what works."}, {"time": 1300, "text": "What about this new world of tech?"}, {"time": 1300, "text": "How do you see, what do you think works for tech?"}, {"time": 1309, "text": "Is it more regulation or less regulation?"}, {"time": 1309, "text": "There are some things that need more regulation."}, {"time": 1309, "text": "I mean, we're finding out that the world of social media is one in which competitive forces aren't working very well and trusting the companies to regulate themselves isn't working very well."}, {"time": 1327, "text": "But I'm on the whole a tech skeptic, not in the sense that I think the tech doesn't work and it doesn't do stuff, but the idea that we're living through greater technological change than ever before is really an illusion."}, {"time": 1344, "text": "Ever since the beginning of the industrial revolution, we've had a series of epical shifts in the nature of work and in the kinds of jobs that are available."}, {"time": 1358, "text": "And it's not at all clear that what's happening now is any bigger or faster or harder to cope with than past shocks."}, {"time": 1366, "text": "It is a popular notion in today's sort of public discourse that automation is going to have a huge impact on the job market now."}, {"time": 1374, "text": "There is something transformational happening now."}, {"time": 1381, "text": "Can you talk about that, maybe elaborate a little bit more?"}, {"time": 1381, "text": "Do you not see the software revolutions happening now with machine learning, availability of data, that kind of automation, being able to sort of process, clean, find patterns in data, and you don't see that disrupting any one sector to a point where there's a huge loss of jobs?"}, {"time": 1405, "text": "There may be some things."}, {"time": 1405, "text": "I mean, actually, you know, translators, there's really reduced demand for translators because machine translation ain't perfect, but it ain't bad."}, {"time": 1418, "text": "There are some kinds of things that are changed, but overall productivity growth has actually been slow in recent years."}, {"time": 1425, "text": "It's been much slower than in some past periods."}, {"time": 1436, "text": "So the idea that automation is taking away all the jobs, the counterpart would be that we would be able to produce stuff with many fewer workers than before, and that's not happening."}, {"time": 1447, "text": "There are a few isolated sectors."}, {"time": 1447, "text": "There are some kinds of jobs that are going away, but that keeps on happening."}, {"time": 1454, "text": "I mean, New York City used to have thousands and thousands of longshoremen taking stuff off ships and putting them on ships."}, {"time": 1460, "text": "They're almost all gone now."}, {"time": 1460, "text": "Now you have the giant cranes taking containers on and off ships in Elizabeth, New Jersey."}, {"time": 1476, "text": "That's not robots."}, {"time": 1476, "text": "It doesn't sound high tech, but it actually pretty much destroyed an occupation."}, {"time": 1484, "text": "Well, you know, it wasn't fun for the longshoremen, to say the least."}, {"time": 1484, "text": "But it's not, we coped, we moved on, and that sort of thing happens all the time."}, {"time": 1492, "text": "You mean farmers."}, {"time": 1500, "text": "We used to be a nation which was mostly farmers."}, {"time": 1500, "text": "There are now very few farmers left."}, {"time": 1500, "text": "And the reason is not that we've stopped eating, it's that farming has become so efficient that we don't need a lot of farmers, and we coped with that too."}, {"time": 1514, "text": "So the idea that there's something qualitatively different about what's happening now so far isn't true."}, {"time": 1519, "text": "So your intuition is there is going to be lots of jobs, but it's just the thing that just continues."}, {"time": 1526, "text": "There's nothing qualitatively different about this moment."}, {"time": 1532, "text": "Some jobs will be lost, others will be created, as has always been the case so far."}, {"time": 1536, "text": "I mean, maybe there's a singularity."}, {"time": 1536, "text": "Maybe there's a moment when the machines get smarter than we are, and sky tech kills us all or something, right?"}, {"time": 1542, "text": "But that's not visible in anything we're seeing now."}, {"time": 1548, "text": "You mentioned the metric of productivity."}, {"time": 1548, "text": "Could you explain that a little bit?"}, {"time": 1553, "text": "Because it's a really interesting one."}, {"time": 1553, "text": "I've heard you mention that before in connection with automation."}, {"time": 1558, "text": "So what is that metric?"}, {"time": 1558, "text": "And if there is something qualitatively different, what should we see in that metric?"}, {"time": 1563, "text": "Well, okay, productivity."}, {"time": 1563, "text": "First of all, production."}, {"time": 1569, "text": "We do have a measure of the economy's total production, you know, real GDP, which is itself, it's a little bit of a construct because it's quite literally, it's adding apples and oranges."}, {"time": 1581, "text": "So we have to add together various things, which we basically do by using market prices, but we try to adjust for inflation."}, {"time": 1587, "text": "But it's kind of, it's a reasonable measure of how much the economy is producing."}, {"time": 1592, "text": "Sorry to interrupt."}, {"time": 1592, "text": "Is it goods and services?"}, {"time": 1592, "text": "It's goods and services."}, {"time": 1597, "text": "Productivity is, you divide that total output by the number of hours worked."}, {"time": 1605, "text": "So we're basically asking how much stuff does the average worker produce in an hour of work."}, {"time": 1612, "text": "And if you're seeing really rapid technological progress, then you'd expect to see productivity rising at a rapid clip, which we did, you know, for the generation after World War II, productivity rose, you know, 2% a year on a sustained basis."}, {"time": 1625, "text": "Then it dropped down for a while."}, {"time": 1625, "text": "Then there was a kind of a decade of fairly rapid growth from the mid nineties to the mid two thousands."}, {"time": 1638, "text": "And then it's, it dropped off again and it's not, it's not impressive right now."}, {"time": 1638, "text": "So you're just not seeing an epical shift in, in, in the economy."}, {"time": 1642, "text": "So let me then ask you about the psychology of blaming automation."}, {"time": 1649, "text": "A few months ago, you wrote in the New York Times, quote, the other day I found myself, as I often do at a conference, discussing lagging wages and soaring inequality."}, {"time": 1659, "text": "There was a lot of interesting discussion, but one thing that struck me was how many of the participants just assumed that robots are a big part of the problem, that machines are taking away the good jobs or even jobs in general."}, {"time": 1670, "text": "For the most part, this wasn't even presented as a hypothesis, just as part of what everyone knows."}, {"time": 1676, "text": "So why is, maybe can you psychoanalyze our, the public intellectuals or economists or us actually in the general public, why this is happening?"}, {"time": 1692, "text": "Why this assumption has just infiltrated public discourse?"}, {"time": 1692, "text": "There's a couple of things."}, {"time": 1699, "text": "One is that the particular technologies that are advancing now are ones that are a lot more visible to the chattering class."}, {"time": 1706, "text": "When containerization did away with the jobs of longshoremen, well, not a whole lot of college professors are close friends with longshoremen."}, {"time": 1717, "text": "And so we see this one."}, {"time": 1723, "text": "Then there's a second thing, which is, we just went through a severe financial crisis and a period of very high unemployment."}, {"time": 1729, "text": "It's finally come down."}, {"time": 1729, "text": "There's really no question that that high unemployment was about macroeconomics."}, {"time": 1736, "text": "It was about a failure of demand."}, {"time": 1742, "text": "But macroeconomics is really not intuitive."}, {"time": 1742, "text": "I mean, people just have a hard time wrapping their minds around it."}, {"time": 1747, "text": "And among other things, people have a hard time believing that something as trivial as, well, people who just aren't spending enough can lead to the kind of mass misery that we saw in the 1930s or the not quite so severe, but still serious misery that we saw after 2008."}, {"time": 1762, "text": "And there's always a tendency to say it must be something big."}, {"time": 1762, "text": "It must be technological change."}, {"time": 1768, "text": "That means we don't need workers anymore."}, {"time": 1768, "text": "There was a lot of that in the 30s."}, {"time": 1768, "text": "And that same thing happened after 2008, the assumption that it has to be some deep cause, not something as trivial as a failure of investor confidence and inadequate monetary and fiscal response."}, {"time": 1787, "text": "And the last thing on wages."}, {"time": 1787, "text": "A lot of what's happened on wages is at some level political."}, {"time": 1797, "text": "It's the collapse of the union movement."}, {"time": 1797, "text": "It's policies that have squeezed workers bargaining power."}, {"time": 1802, "text": "And for kind of obvious reasons, there are a lot of influential people who don't want to hear that story."}, {"time": 1808, "text": "They want it to be an inevitable force of nature."}, {"time": 1808, "text": "Technology has made it impossible to have people earn middle class wages."}, {"time": 1814, "text": "And so they don't like the story that says, actually, no, it's kind of the political decisions that we made that have caused this income stagnation."}, {"time": 1828, "text": "And so they're a receptive audience for technological determinism."}, {"time": 1834, "text": "So what comes first in your view, the economy or politics in terms of what has impact on the other?"}, {"time": 1841, "text": "Oh, look, everything interacts."}, {"time": 1841, "text": "That's one of the rules that I was taught in economics."}, {"time": 1848, "text": "Everything affects everything else in at least two ways."}, {"time": 1848, "text": "I mean, clearly the economy drives a lot of political stuff."}, {"time": 1857, "text": "But also clearly politics has a huge impact on the economy."}, {"time": 1857, "text": "We look at the decline of unions in America and say, well, the world has changed and unions don't have a role."}, {"time": 1875, "text": "But two thirds of workers in Denmark are unionized."}, {"time": 1875, "text": "And Denmark has the same technology and faces the same global economy that we do."}, {"time": 1881, "text": "It's just a difference in political choices that leads to that difference."}, {"time": 1886, "text": "So I actually teach a course here at CUNY called Economics of the Welfare State, which is about things like healthcare and retirement and to some extent wage policy and so on."}, {"time": 1898, "text": "And the message I keep on trying to drive home is that, look, all advanced countries have got roughly equal competence."}, {"time": 1906, "text": "We all have the same technology, but we make very different choices."}, {"time": 1911, "text": "Not that America always makes the wrong choices."}, {"time": 1911, "text": "We do some things pretty well."}, {"time": 1911, "text": "Our retirement system is one of the better ones."}, {"time": 1916, "text": "But the point is that there's a huge amount of political choice involved in the shape of the economy."}, {"time": 1923, "text": "What is a welfare state?"}, {"time": 1923, "text": "Well, welfare state is the old term, but it basically refers to all the programs that are there to mitigate, if you like, the risks and injustices of the market economy."}, {"time": 1939, "text": "So in the US, the welfare state is Social Security, Medicare, Medicaid, minimum wages, food stamps."}, {"time": 1945, "text": "When you say welfare state, my first sort of feeling is a negative one."}, {"time": 1952, "text": "Even though I like all, I probably generally, at least theoretically, like all the welfare programs."}, {"time": 1959, "text": "Well, it's been demonized."}, {"time": 1959, "text": "And to some extent, I'm doing a little bit of thumbing my nose at all of that by just using the term welfare state."}, {"time": 1966, "text": "Although it's not."}, {"time": 1973, "text": "Yeah, I got you."}, {"time": 1973, "text": "But everybody, every advanced country actually has a lot of welfare state, even the US."}, {"time": 1979, "text": "I mean, that's a fundamental part of the fabric of our society."}, {"time": 1979, "text": "Social Security, Medicare, Medicaid are just things we take for granted as part of the scene."}, {"time": 1987, "text": "There's a lot of there's people on the right wing who are saying, oh, it's all socialism."}, {"time": 1997, "text": "And well, words, I guess, mean what you want them to mean."}, {"time": 2005, "text": "And just today, I told my class about the record that Ronald Reagan made in 1961, warning that Medicare would destroy American freedom."}, {"time": 2021, "text": "And but that sort of didn't happen on the topic of welfare state."}, {"time": 2021, "text": "What are your thoughts on universal basic income?"}, {"time": 2030, "text": "And that's sort of a not a generic, but a universal safety net of this kind?"}, {"time": 2038, "text": "There's always a trade off when we talk about social safety net programs."}, {"time": 2038, "text": "There's always a trade off between universality, which is clean, but means that you're giving a lot of money to people who don't necessarily need it and some kind of targeting, which makes it easier to get to deal with the crucial problems with limited resources."}, {"time": 2060, "text": "But both has incentive problems and kind of political and I would say even psychological issues."}, {"time": 2067, "text": "So the great thing about Social Security and Medicare is no questions asked."}, {"time": 2076, "text": "You don't have to prove that you need them."}, {"time": 2085, "text": "It just comes."}, {"time": 2085, "text": "I'm on Medicare, allegedly."}, {"time": 2085, "text": "I mean, it's run through my New York Times health insurance, but I didn't have to file an application with the Medicare office to prove that I needed it."}, {"time": 2102, "text": "It just happened when I turned 65."}, {"time": 2102, "text": "That's good for dignity and it's also good for the political support because everybody gets Medicare."}, {"time": 2108, "text": "On the other hand, if you and we can do that with health care to give everybody a guarantee of an income that's enough to live on comfortably."}, {"time": 2124, "text": "That's a lot of money."}, {"time": 2124, "text": "What about enough income to carry you over through difficult periods, like if you lose a job or that kind of?"}, {"time": 2134, "text": "Well, we have unemployment insurance and I think our unemployment insurance is too short lived and too stingy."}, {"time": 2138, "text": "It would be better to have a more comprehensive unemployment insurance benefit."}, {"time": 2144, "text": "But the trouble with something like universal basic income is that either the bar is too low, so it's really not something you can live on, or it's an enormously expensive program."}, {"time": 2158, "text": "And so at this point, I think that we can do far better by building on the kinds of safety net programs we have."}, {"time": 2165, "text": "I mean, food stamps, earned income tax credit."}, {"time": 2172, "text": "We should have a lot more family support policies."}, {"time": 2177, "text": "Those things can do a lot more to really diminish the amount of misery in this country."}, {"time": 2184, "text": "UBI is something that is being..."}, {"time": 2184, "text": "I mean, it goes kind of hand in hand with this belief that the robots are going to take all of our jobs."}, {"time": 2193, "text": "And if that was really happening, then I might reconsider my views on UPI, but I don't see that happening."}, {"time": 2197, "text": "So are you happy with discourse that's going on now in terms of politics?"}, {"time": 2205, "text": "So you mentioned a few political candidates."}, {"time": 2205, "text": "Is the kind of thing going on both on Twitter and debates and the media through the written word, through the spoken word, how do you assess the public discourse now in terms of politics?"}, {"time": 2220, "text": "We're in a fragmented world."}, {"time": 2225, "text": "More so than before."}, {"time": 2227, "text": "More so than ever before."}, {"time": 2227, "text": "So at this point, the public discourse that you see if Fox News is your principal news source is very different from the one you get if you read the New York Times."}, {"time": 2246, "text": "On the whole, my sense is that mainstream political reporting, policy reporting is a, not too great, but b, better than it's ever been."}, {"time": 2253, "text": "Because when I first got into the pundit business, it was just awful."}, {"time": 2261, "text": "Lots of things just never got covered."}, {"time": 2261, "text": "And if things did get covered, it was always both sides."}, {"time": 2266, "text": "It's the line that comes back from me writing during the 2000 campaign was that if one of the candidates said that the earth was flat, the headline would be views differ on shape of planet."}, {"time": 2280, "text": "I mean, that's less true."}, {"time": 2280, "text": "There's still a fair bit of that out there, but it's less true than there used to be."}, {"time": 2286, "text": "And there are more people reporting, writing on policy issues who actually understand them than ever before."}, {"time": 2292, "text": "So though that's good."}, {"time": 2298, "text": "But still, how much the typical voter is actually informed is unclear."}, {"time": 2298, "text": "I mean, the Democratic debates, I'm hoping that we finally get down to not having 27 people on the stage or whatever it is they have, but they're reasonably substantive, certainly better than before."}, {"time": 2324, "text": "And while there's a lot of still theater criticism instead of actual analysis and the reporting, it's not as totally dominant as in the past."}, {"time": 2340, "text": "Can I ask maybe a dumb question, but from an open minded perspective, when people on the left and people on the right, I think view the others as sometimes complete idiots."}, {"time": 2361, "text": "What do we do with that?"}, {"time": 2361, "text": "Is it possible that the people on the right are correct about their what they currently believe?"}, {"time": 2372, "text": "Is that kind of open mindedness helpful or is this division long term productive for us to sort of have this food fight?"}, {"time": 2388, "text": "Well, the trouble you have to confront is that there's a lot of stuff that just is false out there but commands extensive political allegiance."}, {"time": 2395, "text": "So the idea, well, both sides need to listen to each other respectfully."}, {"time": 2402, "text": "I'm happy to do that when there's a view that is worthy of respect, but a lot of stuff is not."}, {"time": 2409, "text": "And so take economics is something where I think I know something, and I'm not sure that I'm always right."}, {"time": 2418, "text": "In fact, I know I've been wrong plenty of times."}, {"time": 2418, "text": "But I think that there is a difference between economic views that are within the realm of we can actually have an interesting discussion and those that are just crank doctrines or things that are purely being disseminated because people are being paid to disseminate them."}, {"time": 2442, "text": "So there are plenty of good, serious center right economists that I'm happy to talk to."}, {"time": 2447, "text": "None of those center right economists has any role in the Trump administration."}, {"time": 2454, "text": "The Trump administration and by and large Republicans in Congress only want to listen to people who are cranks."}, {"time": 2459, "text": "And so I think it's being dishonest with my readers to pretend otherwise."}, {"time": 2467, "text": "There's no way I can reach out to people who think that reading Ayn Rand novels is how you learn about monetary economics."}, {"time": 2477, "text": "So if you look at Ayn Rand, okay, so you said center right."}, {"time": 2477, "text": "What about extreme?"}, {"time": 2482, "text": "People who have like radical views, you think they're not grounded in any kind of data, in any kind of reality."}, {"time": 2491, "text": "I'm just sort of curious about how open we should be to ideas that seem radical."}, {"time": 2497, "text": "Oh, radical ideas is fine, but then you have to ask, is there some basis for the radicalism?"}, {"time": 2504, "text": "And if it's something that is not grounded in anything, then, and particularly, by the way, if it's something that's been refuted by evidence again and again, and the people just keep saying it, if it's a zombie, if it's a zombie idea, and there's a lot of those out there, then there comes a point when it's not worth trying to fake respect for it."}, {"time": 2529, "text": "So there's a, through the scientific process, you've shown that this idea does not hold water, but I like the idea of zombie ideas, but they live on through, it's like the idea that the earth is flat, for example, has been for the most part, disproven."}, {"time": 2548, "text": "But it lives on, actually, and growing in popularity currently."}, {"time": 2548, "text": "And there's a lot of that out there, and you can't wish it away, and you're not being fair to either yourself, or if you're somebody who writes for the public, you're not being fair to your readers to pretend otherwise."}, {"time": 2566, "text": "So quantum mechanics is a strange theory, but it's testable, and so while being strange, it's widely accepted amongst physicists."}, {"time": 2573, "text": "How robust and testable are economics theories if we compare them to quantum mechanics and physics and so on?"}, {"time": 2581, "text": "Okay, economics, look, it's a complex system, and it's also one in which, by and large, you don't get to do experiments, and so economics is never going to be like quantum mechanics."}, {"time": 2598, "text": "That said, you get natural experiments, you get tests of rival doctrines."}, {"time": 2598, "text": "In the immediate aftermath of the financial crisis, there was one style, one basic theory of macroeconomics, which ultimately goes back to John Maynard Keynes that made a few predictions."}, {"time": 2616, "text": "It said, under these circumstances, the economy is going to collapse."}, {"time": 2620, "text": "It's going to collapse."}, {"time": 2628, "text": "Printing money will not be inflationary."}, {"time": 2628, "text": "Running big budget deficits will not cause a rise in interest rates."}, {"time": 2634, "text": "Slashing government spending austerity policies will lead to depressions if tried."}, {"time": 2642, "text": "Other people had exactly the opposite predictions, and we got a fairly robust test, and one theory won."}, {"time": 2651, "text": "Interest rates stayed low."}, {"time": 2651, "text": "Inflation stayed low."}, {"time": 2651, "text": "Austerity, countries that implemented harsh austerity policies suffered severe economic downturns."}, {"time": 2657, "text": "You don't get much, you know, that's pretty clear, and that's not going to be true on everything, but there's a lot of empirical."}, {"time": 2669, "text": "I mean, the younger economists these days are very heavily data based, and that's great, and I think that's the way to go."}, {"time": 2682, "text": "Trey Lockerbie What theories of economics are there?"}, {"time": 2682, "text": "Is there currently a lot of disagreement about, would you say?"}, {"time": 2687, "text": "John Ligato Oh, first of all, there's just a lot less disagreement, really, among serious researchers in economics than people imagine."}, {"time": 2694, "text": "We actually, we can track that."}, {"time": 2694, "text": "The Chicago Booth School has a panel, an ideologically diverse panel, and they pose regularly posed questions, and on most things, there's a huge, there's remarkable consensus."}, {"time": 2707, "text": "There's a lot of things where people imagine that there's dispute, but the illusion of dispute is something that's basically being fed by political forces, and there isn't really."}, {"time": 2722, "text": "I mean, there are, I think, questions about what are effective ways to regulate technology industries."}, {"time": 2728, "text": "We really don't know the answers there."}, {"time": 2741, "text": "There's a, or, look, I don't follow every part."}, {"time": 2741, "text": "Minimum wages."}, {"time": 2741, "text": "I think there's pretty overwhelming evidence that a modest increase in the minimum wage from current levels would be, would not have any noticeable adverse effect on jobs."}, {"time": 2757, "text": "But if you ask, how high could it go?"}, {"time": 2766, "text": "$12 seems pretty safe, given what we know."}, {"time": 2766, "text": "Is $15 okay?"}, {"time": 2766, "text": "There's some legitimate disagreement there, I think probably, but people have a point."}, {"time": 2777, "text": "$20, where is the line at which it starts to become a problem, and the answer is, truly, we don't know."}, {"time": 2784, "text": "It's fascinating to try to, such a cool, economics is cool in that sense, because you're trying to predict something that hasn't been done before, the impact, the effects of something that hasn't been done before."}, {"time": 2800, "text": "Yeah, you're trying, you're going out of sample, and we have good reason to believe that there are, you know, that it's nonlinear, that there comes a point at which it doesn't work the way it has in the past."}, {"time": 2809, "text": "So, as an economist, how do you see science and technological innovation?"}, {"time": 2809, "text": "When I took various economics courses in college, technological innovation seemed like a no brainer way of growing an economy, and we should invest in it aggressively."}, {"time": 2822, "text": "I may be biased, but it seemed like the various ways to grow an economy, it seems like the easiest way, especially long term."}, {"time": 2834, "text": "Is that correct?"}, {"time": 2834, "text": "And if so, why aren't we doing it more?"}, {"time": 2840, "text": "Well, that's, okay, the first question is, yeah, I mean, all, it's pretty much overwhelming."}, {"time": 2847, "text": "We think we can more or less measure this, although there are some assumptions involved, but it's something like 70 to 80% of the growth in per capita income is basically the advance of knowledge."}, {"time": 2858, "text": "It's not just, it's not just the crude accumulation of capital."}, {"time": 2858, "text": "It is the fact that we get smarter."}, {"time": 2863, "text": "A lot of that, by the way, is more prosaic kinds of technology."}, {"time": 2863, "text": "So, you know, I like to talk about things like containerization, or, you know, in an earlier period, the invention of the flat pack cardboard box."}, {"time": 2881, "text": "That had to be invented, and now all of your deliveries from Amazon are made possible by the existence of that technology."}, {"time": 2890, "text": "The web stuff is important too, but what would we do without cardboard boxes?"}, {"time": 2900, "text": "But all of that stuff is really important in driving economic progress."}, {"time": 2900, "text": "Well, why don't we invest more?"}, {"time": 2906, "text": "Why don't we invest more in, again, more prosaic stuff?"}, {"time": 2906, "text": "Why haven't we built another goddamn rail tunnel under the Hudson River, for which the need is so totally overwhelmingly obvious?"}, {"time": 2924, "text": "How do you think about, first of all, I don't even know what the word prosaic means, but I inferred it, but how do you think about prosaic?"}, {"time": 2928, "text": "Is it the really most basic, dumb technology innovation, or is it just like the lowest hanging fruit of where benefit can be gained?"}, {"time": 2942, "text": "When I say prosaic, I mean stuff that is not sexy and fancy and high tech."}, {"time": 2942, "text": "It's building bridges and tunnels, inventing the cardboard box, or the, I don't know, where do we put EasyPass in there?"}, {"time": 2964, "text": "It is actually using some modern technology and all that, but it's not going to have, I don't think we're going to make a movie about the guy, whoever it was that invented EasyPass, but it's actually a pretty significant productivity booster."}, {"time": 2981, "text": "To me, it always seemed like it's something that everybody should be able to agree on and just invest."}, {"time": 2987, "text": "So in the same way, the investment in the military and the DOD is huge."}, {"time": 2996, "text": "So everyone kind of, not everyone, but there's an agreement amongst people that somehow that a large defense is important."}, {"time": 3005, "text": "It always seemed to me like that should be shifted towards, if you want to grow prosperity of the nation, you should be investing in knowledge."}, {"time": 3022, "text": "Yes, prosaic stuff, investing in infrastructure and so on."}, {"time": 3029, "text": "I mean, sorry to linger on it, but do you have any intuition?"}, {"time": 3029, "text": "Do you have a hope that that changes?"}, {"time": 3035, "text": "Do you have intuition why it's not changing?"}, {"time": 3038, "text": "More than intuition, I have a theory."}, {"time": 3038, "text": "I'm reasonably certain that I understand why we don't do it."}, {"time": 3042, "text": "And it's because we have a real values dispute about the welfare state, about how much the government should do to help the unfortunate."}, {"time": 3055, "text": "And politicians believe, probably rightly, that there's a kind of halo effect that surrounds any kind of government intervention."}, {"time": 3069, "text": "That even though providing people with enhanced social security benefits is really very different from building a tunnel under the Hudson River, politicians of both parties seem to believe that if the government is seen to be successful at doing one kind of thing, it will make people think more favorably on doing other kinds of things."}, {"time": 3088, "text": "And so we have conservatives tend to be opposed to any kind of increase in government spending, except military, no matter how obviously a good idea it is, because they fear that it's the thin end of the wedge for bigger government in general."}, {"time": 3106, "text": "And to some extent, liberals tend to favor spending on these things, partly because they see it as a way of proving that government can do things well, and therefore it can turn to broader social goals."}, {"time": 3119, "text": "What you might have thought would be a technocratic discussion about government investment, both in research and in infrastructure, is contaminated by the fact that government is government and people link it to other government actions."}, {"time": 3141, "text": "Perhaps a silly question, but as a species, we're currently working on venturing out into space, one day colonizing Mars."}, {"time": 3148, "text": "So when we start a society on Mars from scratch, what political and economic system should it operate under?"}, {"time": 3161, "text": "Oh, I'm a big believer in... First of all, I don't think we're actually going to do that, but let's hypothesize that we colonize Mars or something."}, {"time": 3165, "text": "Look, representative democracy versus pure democracy."}, {"time": 3174, "text": "Well, yeah, pure democracy where people vote directly on everything is really problematic, because people don't have time to try and master every issue."}, {"time": 3186, "text": "I mean, we can see what government by referendum looks like."}, {"time": 3196, "text": "There's a lot of that in California, and it doesn't work so good because it's hard to explain to people that the various things they vote for may conflict."}, {"time": 3206, "text": "So representative democracy, it's got lots of problems."}, {"time": 3206, "text": "And kind of the Winston Churchill thing, right?"}, {"time": 3217, "text": "It's the worst system we know, except for all the others."}, {"time": 3217, "text": "So yeah, sticking with the representative and basically the American system of regulation and markets and the economy we have going on is a pretty good one for Mars."}, {"time": 3232, "text": "If you start from scratch."}, {"time": 3232, "text": "If you're gonna start from scratch, you wouldn't want a Senate where 16% of the population has half the seats."}, {"time": 3246, "text": "You probably would want one which is actually more representative than what we have."}, {"time": 3251, "text": "And the details, it's unclear."}, {"time": 3251, "text": "When times are good, all of the various representative democracy systems, whether it's parliamentary democracies or a US style system, whether you have a prime minister or the head of state as an elected president, they all kind of work well, when times are good, and they all have different modes of breakdown."}, {"time": 3276, "text": "So I'm not sure I know what the answer is."}, {"time": 3280, "text": "But something like that is given what we've seen through history, it's the least bad system out there."}, {"time": 3289, "text": "I'm a big fan of the TV series The Expanse, and it's kind of gratifying that out there, it's the Martian Congressional Republic."}, {"time": 3302, "text": "In a brief sense, so amongst many things, you're also an expert at international trade."}, {"time": 3313, "text": "What do you make of the complexity?"}, {"time": 3313, "text": "So I can understand trade between two people, say two neighboring farmers."}, {"time": 3324, "text": "It seems pretty straightforward to me."}, {"time": 3330, "text": "But internationally, we need to start talking about nations and nations trading seems to be very complicated."}, {"time": 3335, "text": "So from a high level, why is it so complicated?"}, {"time": 3335, "text": "What are all the different factors that weigh the objectives that need to be considered in international trade?"}, {"time": 3342, "text": "And maybe feeding that into a question of, do you have concerns about the two giants right now of the U.S. and China, and the tension that's going on with the international trade there with the trade war?"}, {"time": 3361, "text": "Well, first of all, international trade is not really that different from trade among individuals."}, {"time": 3365, "text": "It's vastly more complex, and there are many more players."}, {"time": 3365, "text": "But in the end, the reasons why countries trade are pretty much the same as the reasons why individuals trade."}, {"time": 3375, "text": "Countries trade because they're different, and they can derive mutual advantage from concentrating on the things they do relatively well."}, {"time": 3385, "text": "And also, there are economies of scale."}, {"time": 3385, "text": "Individuals have to decide whether to be a surgeon or an accountant."}, {"time": 3396, "text": "It's probably not a good idea to try and be both, and countries benefit from specializing just because of the inherent advantages of specialization."}, {"time": 3408, "text": "Now, the fact that it's a big world, and we're talking about millions of products being traded, and in today's world, often trade involves many stages."}, {"time": 3416, "text": "So that made in China iPhone is actually assembled from components that are made all over the world."}, {"time": 3425, "text": "But it doesn't really change the fundamentals all that much."}, {"time": 3431, "text": "There's a recurrent..."}, {"time": 3431, "text": "I mean, the dirty little secret of international trade conflict is that actually it's not..."}, {"time": 3442, "text": "Conflicts among countries are really not that important."}, {"time": 3447, "text": "Most trade is beneficial to both sides and to both countries, but it has big impacts on the distribution of income within countries."}, {"time": 3457, "text": "So the growth of US trade with China has made both US and China richer, but it's been pretty bad for people who were employed in the North Carolina furniture industry, who did find that their jobs were displaced by a wave of imports from China."}]}]