[{"title": "Oliver Stone: Vladimir Putin and War in Ukraine | Lex Fridman Podcast #286", "id": "ygAqYC8JOQI", "quotes": [{"time": 528, "text": "Who's gonna lead the way on nuclear, do you think?"}, {"time": 531, "text": "You mentioned Russia, France, China, United States, who's gonna lead?"}, {"time": 534, "text": "Yeah, I don't think it's gonna be a United Nations kind of thing, because the world doesn't seem capable of uniting."}, {"time": 541, "text": "We go to these conferences, Kyoto, and we talk and we agree, but then we don't actually enforce, so I don't think it can happen that way."}, {"time": 549, "text": "I think it's gonna be an individual race with countries."}, {"time": 553, "text": "They're gonna just do it for their own self interest, like China's doing it."}, {"time": 558, "text": "China, the thing is, if it works, and I'm praying that it will really work on a big scale, China will back away from coal naturally."}, {"time": 566, "text": "The same thing will be true of India."}, {"time": 567, "text": "They will see the benefits, because if you go to India, you see the cities, the pollution."}, {"time": 573, "text": "You walk around in that stuff, and you get, it's not, there's no hope in this, and you sense it."}, {"time": 579, "text": "So people will move in this direction naturally, because nuclear is clean energy."}, {"time": 584, "text": "And the amount of casualties of nuclear is the lowest on the industrial scale for energy producing, from coal down to oil, everything."}, {"time": 594, "text": "The lowest casualty rate, very lowest, .002 or something, is nuclear."}, {"time": 600, "text": "So not that many people have died from nuclear."}, {"time": 604, "text": "Not that many, I think 50 people at Chernobyl, which was the worst accident."}, {"time": 609, "text": "Nobody had died at Fukushima."}, {"time": 612, "text": "Nobody died at Three Mile Island, and that's what you hear all over and over again, these accidents."}, {"time": 619, "text": "The environmentalists have sold us the idea that they're dangerous."}, {"time": 624, "text": "And it's, a lot of environmentalists, thank God, are changing, they've come off that routine, and they've saying, this, we were wrong."}, {"time": 632, "text": "We've done a lot of good work."}, {"time": 634, "text": "Greenpeace did a lot of good work."}, {"time": 635, "text": "Whale, whales, saving this, saving that."}, {"time": 638, "text": "But they admit themselves, not they don't, but people who have been in the organization have said, we were wrong."}, {"time": 646, "text": "In 1956, we show the articles in the New York Times that came out, the Rockefeller Foundation, which of course is a big producer of oil, the Rockefeller family, and the foundation came out with a study, which was weighted."}, {"time": 669, "text": "They tipped the scale, put a thumb on the scale, but it was a scientific expose of radiation in the study that came out, printed in the New York Times, because the New York Times publisher, Salzburger, was on their board, he was one of the board members."}, {"time": 688, "text": "So they got a lot of strong publicity condemning radiation, which killed, started the process of doubting nuclear energy."}, {"time": 699, "text": "The radiation levels that they pointed out were very minor, and of course, if you go into a scientific analysis of this now with what we know, it's just not true."}, {"time": 709, "text": "But it tilted the scale back in the 50s, 60s, and started the questioning the nuclear business."}, {"time": 716, "text": "Do you think that was malevolence or incompetence?"}, {"time": 719, "text": "No, I think it was competition."}, {"time": 721, "text": "I don't think it was conspiracy as much as it was essentially, we don't want this, nuclear energy's gonna end the dominance of oil, absolutely, and it will."}, {"time": 730, "text": "And it will anyway, because it's the only sane way for the world to proceed."}, {"time": 734, "text": "But the world will have to learn through adversity."}, {"time": 740, "text": "So in other words, this situation could get worse, much worse, and certain countries are just gonna have to adapt, like we always do."}, {"time": 748, "text": "When things become too hard, you've got to go, you have to change your thinking."}, {"time": 753, "text": "And humans are pretty good at that."}, {"time": 755, "text": "Yes, talking about human nature, they're very adept at that, Germany, for example."}, {"time": 760, "text": "I mean, they were, when the Fukushima happened, they went out of the nuclear business."}, {"time": 764, "text": "That was shocking to me."}, {"time": 766, "text": "They just pulled out and they destroyed, destructed several of their nuclear reactors who were still functioning, and put up coal, or yeah, put up coal and oil, replaced it."}, {"time": 779, "text": "And as a result, Germany drifted into this place next to France, their electricity bills went up, and France stayed the same."}, {"time": 789, "text": "They don't have that, they have a different system in Europe, but more or less, no question that France was doing a lot better than Germany."}, {"time": 795, "text": "And now, with this Ukraine issue, it's a very interesting fulcrum point, whether Germany is, what direction they're gonna go now."}, {"time": 805, "text": "How can they, how can they keep going with coal?"}, {"time": 809, "text": "They just can't."}, {"time": 810, "text": "What's the connection between oil, coal, nuclear, and war?"}, {"time": 816, "text": "Sort of energy and conflict."}, {"time": 821, "text": "When you look at the 21st century, when you were doing this documentary, were you thinking of nuclear as a way to power the world, but is it also to avoid conflict over resources?"}, {"time": 833, "text": "Is there some aspect to energy being a source of conflict that we're trying to avoid?"}, {"time": 844, "text": "I don't have the energy, the history of energy at my fingertips, and it's a very long history here."}, {"time": 852, "text": "But I would say, apparently not."}, {"time": 855, "text": "It does seem that individually, each country can answer its needs by building."}, {"time": 861, "text": "And up until now, we haven't had conflict, except in this issue of Russia supplying Europe."}, {"time": 871, "text": "Obviously, the pipeline, Nord Stream 2 has been closed, and Nord Stream 1 is also probably gonna be phased out."}, {"time": 878, "text": "And the concept of Russia supplying gas to Europe is now up in the air, and who knows what's gonna happen."}, {"time": 887, "text": "I just don't see how Europe can get away from using Russian gas."}, {"time": 893, "text": "But Russian gas is not the solution, because it's methane, too, and it goes up into the atmosphere."}, {"time": 898, "text": "Methane, in the short term, is worse than coal, worse."}, {"time": 904, "text": "There's all kinds of charts we show in the film."}, {"time": 906, "text": "We try not to be too overfactual, but methane is not the answer."}, {"time": 912, "text": "It's a short term answer."}, {"time": 918, "text": "Will countries go to war over energy is a question that I'm trying to think of all the wars that happened."}, {"time": 925, "text": "You could say Germany, of course, during World War II needed oil very badly, and it dictated their strategy with Romania, et cetera, and getting the oil fields open."}, {"time": 936, "text": "But I haven't thought that one through."}, {"time": 940, "text": "I'd have to make a documentary on it to really understand how energy and war interface."}, {"time": 947, "text": "It's always part of the calculation, but it's a question of how much."}, {"time": 953, "text": "I just have to ask, because you mentioned your mom was from France, you've traveled for this documentary, and you traveled in general throughout the world in Russia, Ukraine."}, {"time": 964, "text": "What are the defining characteristics of these cultures?"}, {"time": 967, "text": "Let's go with Russia."}, {"time": 969, "text": "So as I told you, I'm half Ukrainian, half Russian."}, {"time": 974, "text": "I came from that part of the world."}, {"time": 976, "text": "What are some interesting, beautiful aspects of the culture of Russia and Ukraine?"}, {"time": 981, "text": "I can't really speak honestly of Ukraine."}, {"time": 983, "text": "I was there only in 1983 when I visited the Soviet Union under the communism, and Kiev was beautiful and was one of the nicer places I went, but they were very much stultified by the communist system, they all were."}, {"time": 1001, "text": "The best places to visit in Russia were always in the South, whether Georgia or the Muslim countries, it was always a better culture in terms of comfort."}, {"time": 1012, "text": "But communism was rough, and that was the end of it, pretty much Brezhnev regime, and then Andropov."}, {"time": 1018, "text": "Gorbachev was three years in the future when I was there."}, {"time": 1021, "text": "So I can't talk about Ukraine, and they've not been friendly to me since ISIS, of course, since I made the Putin interviews, you know, Ukraine has banned me, I believe, they've been very tough on people who are critical."}, {"time": 1036, "text": "I think the Russian people have been very special to me, and perhaps because of my European upbringing, but I enjoy talking to them, I find them very open, very generous, and they appreciate support, they appreciate people who say, you know, I understand why your government is doing this or this or this, I've tried to stay open minded and listen to both sides."}, {"time": 1059, "text": "The thing that I have seen as an American is, of course, this American enmity towards Russia from the very beginning."}, {"time": 1095, "text": "And television shows were based on this, it was very much the J. Edgar Hoover mentality that communism was even behind the student protests of the 1960s, this was the direction in which the FBI and the CIA were thinking."}, {"time": 1110, "text": "So I grew up with a prejudice, and it took me many years, my father was a Republican and he was a stockbroker and he was a very intelligent man, but even he, because he was a World War II soldier, he was a colonel, had fallen under the influence."}, {"time": 1127, "text": "In order to be successful in American business in the 1950s, you had to have a very strong anti Soviet line, very strong, you wouldn't get ahead."}, {"time": 1138, "text": "If you expressed any kind of, let's end this Cold War, any kind of activity of that nature, you'd be cast aside as a pinko or somebody who was not completely on the board with the American way of doing business, which was capitalism works, communism doesn't."}, {"time": 1156, "text": "And in particular, communism was embodied by the Soviet Union as the enemy."}, {"time": 1164, "text": "So hence the narrative behind the Cold War."}, {"time": 1169, "text": "Behind the Cold War, that's correct, and it basically lasted, I mean, you saw the ups and downs of it."}, {"time": 1177, "text": "When Reagan came in, I was, well, first of all, we had the crisis of 1962 with the Cuban Missile Crisis, and Kennedy proved himself to be a warrior for peace."}, {"time": 1187, "text": "He resolved that with Khrushchev."}, {"time": 1189, "text": "That was a big moment, huge moment, and people don't give him credit enough for really saving us from a war that could have affected all of mankind."}, {"time": 1199, "text": "But it still didn't avert."}, {"time": 1202, "text": "No, because the moment he was killed, honestly, there was a lot of, we can talk about that, and as you know, I've made a film, JFK Revisited is a documentary we released this year about the movie I made in 1991."}, {"time": 1218, "text": "But the moment he was killed, I would argue that Lyndon Johnson went back immediately to the old way of thinking, the old way of doing business, which was the Eisenhower, Truman way, which we had adapted since World War II."}, {"time": 1233, "text": "That was an interim."}, {"time": 1234, "text": "You have to think about it from, Roosevelt dies in 45."}, {"time": 1237, "text": "Roosevelt has an interim of 15 years where he, he has more of a democratic regime, more liberal."}, {"time": 1247, "text": "He establishes, he recognizes the Soviet Union for the first time since the revolution, and he actually has a relationship with them."}, {"time": 1254, "text": "He sends ambassadors who are friendly, and he has a relationship with Stalin, et cetera, and at Yalta, or no, at Tehran, rather, that's where he had the relationship."}, {"time": 1268, "text": "Do you think if JFK lived, we would not have a Cold War?"}, {"time": 1270, "text": "No, absolutely not, and we go into great depth on that in the film, and I'd urge you to see it, because it goes into all the issues around the world."}, {"time": 1279, "text": "Kennedy was being very much an anti imperialist."}, {"time": 1311, "text": "He made a big effort."}, {"time": 1312, "text": "Unfortunately, it didn't work out, because Dag Hammarskjold was killed, and then Kennedy was killed, and Congo descended into the chaos of Joseph Mobutu's dictatorship."}, {"time": 1324, "text": "But Kennedy was very active in terms of, as an Irishman, not as an Englishman, he was an Irishman."}, {"time": 1330, "text": "And I say that because, well, we'll come back to that, because Mr. Joe Biden is an Irishman, but it's a different kind of an Irishman."}, {"time": 1336, "text": "They're both Catholic Irish, but Kennedy really made an effort to change the imperialist mindset that still was very strong in America and Europe."}, {"time": 1350, "text": "Lyndon Johnson changed back to the old policy, and we were never able to really keep big talk going with the Russians."}, {"time": 1357, "text": "Briefly had it with Carter, but then Brzezinski came in."}, {"time": 1362, "text": "Brzezinski was his national security advisor."}, {"time": 1365, "text": "He was put there by Rockefeller, and Brzezinski was a Pole, he got revenge from Poland."}, {"time": 1370, "text": "Poland has always been attacking Russia, as far as I remember, back to another century."}, {"time": 1375, "text": "I mean, the two world wars that occupied Russia, so tragically, entry points were always through Poland and Ukraine."}, {"time": 1385, "text": "So Brzezinski got his revenge, and Carter ended up being an enemy of the Soviet Union, and creating, as Brzezinski took pride in it, he created the atmosphere of the trap for the Soviets to go into Afghanistan in 79."}, {"time": 1400, "text": "That trap was set, he says, he said, in 1978."}, {"time": 1406, "text": "So there was never, except for brief moments, periods of detente with the Soviets, and I grew up under that."}, {"time": 1415, "text": "I didn't really know anything of this going on, because I was learning, I was educating myself as I was going, learning movies, and trying to be a dramatist, and this and that, so I wasn't thinking about this."}, {"time": 1427, "text": "Then, when Reagan came in, I was worried again, because it was the beat of the old beat, which was there, the most evil empire."}, {"time": 1434, "text": "I mean, it goes on in American history, it doesn't end."}, {"time": 1437, "text": "Reagan got a lot of points for that, and of course, when Gorbachev came in, it was a beautiful moment for the world."}, {"time": 1447, "text": "It was a great surprise."}, {"time": 1449, "text": "It was probably the best years for America, at least from my point of view, in terms of this relaxation in the mood."}, {"time": 1456, "text": "1986 to 1991 were great years in terms of ability to believe, once again, that there could be a peace dividend, but the world changed again in 1991, 92."}, {"time": 1470, "text": "There's an internal mechanism, who knows?"}, {"time": 1471, "text": "You could blame the United States, you could blame Russia for... Gorbachev was perhaps not the right man to try to administer that country at that point."}, {"time": 1483, "text": "He had great visions, he was a man of peace, but it was very difficult to hold together such a huge empire."}, {"time": 1490, "text": "So vision is not enough to hold together the Soviet Union?"}, {"time": 1493, "text": "I think the details are interesting."}, {"time": 1496, "text": "I followed up on that a little bit, because I was recently in countries like Kazakhstan, talked about the negotiations that were going on, and the breakup of the Soviet Union."}, {"time": 1508, "text": "It's a very interesting story, because it involves everything, Ukraine, of course, everything that's going on now."}, {"time": 1514, "text": "Some, what is it, 30 million Russians were left outside of the Soviet Union when it collapsed."}, {"time": 1519, "text": "They had no home anymore, they were homes in other countries, such as in Ukraine."}, {"time": 1525, "text": "So it's an interesting story, and with repercussions today, Kazakhstan is a good example of keeping a balance, keeping it neutral."}, {"time": 1536, "text": "He played both sides, and because Yeltsin wanted him to join the Russian Confederation in a certain way where he'd be supporting, against Gorbachev, there's a whole inward battle there."}, {"time": 1553, "text": "I think the Ukraine came along with Yeltsin, as well as, I'm sorry, I don't remember now, but two other regions came with him, and that was a block that broke up the Soviet Union."}, {"time": 1569, "text": "It was Yeltsin's plan to, and it wasn't make the Russian Federation, and they did."}, {"time": 1575, "text": "I would love to return back to JFK eventually, because he's such a fascinating figure in the history of human civilization, but let me ask you, fast forward."}, {"time": 1586, "text": "In 2000, Yeltsin was no longer president, and Vladimir Putin became president."}, {"time": 1592, "text": "You did a series of interviews with Vladimir Putin, as you mentioned, over a period of two years, from 2015 to 2017."}, {"time": 1603, "text": "Let me ask with a high level question."}, {"time": 1605, "text": "What was your goal with that conversation?"}, {"time": 1609, "text": "Oh, came out in 2017, I guess I started them in 2014."}, {"time": 1615, "text": "At that point, the Snowden affair had happened, and I was working on a movie on Snowden."}, {"time": 1620, "text": "That happened in 13, Ukraine happened in 14, and one thing after another."}, {"time": 1630, "text": "By 14, Putin was enemy number, again, becoming a wanted man on the American list."}, {"time": 1637, "text": "He was enemy, he was certainly in the top five."}, {"time": 1642, "text": "But the animosity towards Putin had been growing since 2007 at Munich."}, {"time": 1647, "text": "I remember that speech when he made it."}, {"time": 1649, "text": "It's in my documentary, that's a four hour documentary, four different conversations."}, {"time": 1654, "text": "I mean, we talked over two years, two and a half years, but I remember that image of him at Munich making a very important speech about world harmony, about the balance necessary in the world, and I remember the sneer, the sneer on John McCain's face."}, {"time": 1672, "text": "He was in Munich, obviously eyeballing Putin and hating him, and it was so evident that McCain had no belief whatsoever that this, he was almost treating him like these are the communists are back, and we know that Putin was not a communist."}, {"time": 1685, "text": "We know that Putin is very much a market man, and he made it very clear and tried to keep an open climate, a new relationship with Europe, but the United States always, certain people in the United States always saw that as a threat, like Putin is trying to take Europe away from us as if we own it, as if we have the right to own it."}, {"time": 1704, "text": "But Putin was making the point, it's very important, about sovereignty, and sovereignty for countries is crucial for this new world to have balance."}, {"time": 1715, "text": "That's sovereignty for China, sovereignty for Russia, sovereignty for Iran, sovereignty for Venezuela, sovereignty for Cuba."}, {"time": 1723, "text": "This is an idea that's crucial to the new world, and I think the United States has never accepted that."}, {"time": 1729, "text": "Sovereignty is not an idea that they can allow."}, {"time": 1733, "text": "You have to be obedient to the United States idea of so called democracy and freedom, but much more important is sovereignty for these countries, and the United States has not obeyed that, has not even acknowledged it, and it never comes up."}, {"time": 1753, "text": "So from the perspective of the United States, when power centers arise in the world, you start to oppose those, not because of the ideas, but merely because they have power."}, {"time": 1768, "text": "Isn't that at the heart of the doctrine of the neoconservatives, and the pact for the new American century they wrote down in 1996, seven, they said there shall be no emergence of a rival power."}, {"time": 1781, "text": "It was very clear it was about power, and they've stuck to that doctrine, which is if you start to get dangerous in any way or have power, we're gonna knock you out."}, {"time": 1792, "text": "Now that won't work, and I don't believe it can work, and that is unfortunately a policy the United States is following, and the neoconservatives group, which is very small, but it's very strong apparently, and their idea has resonated."}, {"time": 1808, "text": "It was behind the George Bush's invasion of Iraq."}, {"time": 1812, "text": "It was part of not only Iraq, but cleaning out the whole world, draining the swamp, going to Afghanistan first, and then although Iraq had nothing to do with al Qaeda's attack, going after Iraq."}, {"time": 1825, "text": "And of course 60 some other countries that were terrorism had some signs of, wherever America judged would be a dangerous country."}, {"time": 1838, "text": "We had the right, you're either with us or against us."}, {"time": 1841, "text": "Now that is a disastrous policy, and led to one thing after another."}, {"time": 1845, "text": "The Iraq war never learned a lesson."}, {"time": 1848, "text": "The neoconservatives were never fired, never thrown out of office."}, {"time": 1851, "text": "The people who prosecuted that war are still around."}, {"time": 1855, "text": "Many of them are still around, and they're obviously guiding America now."}, {"time": 1860, "text": "Let me return to this question of power."}, {"time": 1863, "text": "Don't forget the sneer that I saw there."}, {"time": 1867, "text": "That emblemized the United States reaction."}, {"time": 1869, "text": "Also there were several other American representatives who were laughing, kind of mocking Putin."}, {"time": 1876, "text": "It was very serious."}, {"time": 1877, "text": "I felt there was a divide there."}, {"time": 1881, "text": "So since then, I mean in a certain sense, the Europe reaction to Putin is crucial, and they were more with him back then."}, {"time": 1891, "text": "And a big thing for America was always to keep NATO, to keep Europe in its pocket as a satellite."}, {"time": 1897, "text": "And with this recent war, of course they've succeeded in beyond their dreams."}, {"time": 1902, "text": "The Russians have fulfilled the fantasy of the United States, to finally be this aggressor that they have pictured for years."}, {"time": 1910, "text": "We can talk about that later."}, {"time": 1911, "text": "But at that time, Europe had significant support for Putin, and the United States was sneering at Putin."}, {"time": 1921, "text": "That's correct, you can say that."}, {"time": 1923, "text": "And then, so there was this, there was uncertainty as to the direction, as to the future of Russia."}, {"time": 1933, "text": "And that's exactly when you interviewed Vladimir Putin."}, {"time": 1936, "text": "I wanted to know what they thought, because we couldn't get the information war that the United States was fighting against Russia."}, {"time": 1946, "text": "It was in evidence back then."}, {"time": 1948, "text": "It was full out."}, {"time": 1949, "text": "The condemnation of Russia on all fronts."}, {"time": 1953, "text": "I never saw a positive article about Putin."}, {"time": 1956, "text": "Although when I traveled in the world, and I traveled a lot doing documentaries, it was very clear in the Middle East, in Africa, in Asia, there was respect for him."}, {"time": 1965, "text": "That he was a man who was getting his job done in the interest of Russia."}, {"time": 1970, "text": "He was, as I said in the documentary, a son of Russia."}, {"time": 1973, "text": "Very much so, in the positive sense, a son of Russia."}, {"time": 1978, "text": "Not that he's out there trying to destroy the interests of other countries, no."}, {"time": 1985, "text": "That he was out there to promote the interests of Russia, but at the same time, keep a balance."}, {"time": 1991, "text": "Keep the world into a harmony."}, {"time": 1994, "text": "This has always been his picture."}, {"time": 1995, "text": "Peace was always his idea."}, {"time": 1997, "text": "In other words, he always referred to the United States in all these interviews as our partners."}, {"time": 2002, "text": "And I said, will you stop using that word?"}, {"time": 2006, "text": "And he was a little bit slow in waking up to what the United States was doing."}, {"time": 2011, "text": "Well, that said, he's one of the most powerful men in the world."}, {"time": 2015, "text": "He was at that time."}, {"time": 2017, "text": "And let me ask you the human question."}, {"time": 2022, "text": "As the old adage goes, power corrupts and absolute power corrupts absolutely."}, {"time": 2027, "text": "Did you see any corroding effects of power on the man?"}, {"time": 2032, "text": "Forget the political leader, on just the human being that carries that power on his shoulders for so many years."}, {"time": 2039, "text": "Keep in mind that he's been, unlike most modern leaders, he's been in office off and on, because Medvedev was president and he was not literally in charge."}, {"time": 2052, "text": "He took another appointment at that point, but he was still very much involved."}, {"time": 2058, "text": "But for 20 years, more or less, he's been at the administrator of the state, the protector of the state."}, {"time": 2066, "text": "And he's apparently done a good enough job that the Russian people have kept him there."}, {"time": 2072, "text": "Because contrary to what many people think, I really believe that if the Russian people didn't want him, he would be out."}, {"time": 2079, "text": "I firmly believe that."}, {"time": 2080, "text": "I don't think you can go against the will of the people."}, {"time": 2082, "text": "Now, it expresses itself in many ways, at the ballot box and so forth, but also in other ways in Russia."}, {"time": 2087, "text": "There's a strong currents of opinion."}, {"time": 2091, "text": "So contrary to what the position of him as a dictator, he wouldn't last if he was unpopular, number one."}, {"time": 2098, "text": "Number two, Russia is much more divided than people know."}, {"time": 2101, "text": "There's other factors in Russia."}, {"time": 2104, "text": "There are always tensions around the Kremlin, who has power, who doesn't have power."}, {"time": 2109, "text": "That's been going on for 100 years."}, {"time": 2112, "text": "But the factions in Russia are very much there."}, {"time": 2117, "text": "So when people refer to Russia as Putin, they're mistaken."}, {"time": 2122, "text": "And they do this regularly in the New York papers and all this."}, {"time": 2125, "text": "They say, Putin did this, Putin did that, Putin's doing that, but it's Russia that's doing it."}, {"time": 2131, "text": "And that's what, there's a distinction there that I, it's changed."}, {"time": 2135, "text": "In the old days, I would read about Khrushchev, but it was never Khrushchev personally."}, {"time": 2140, "text": "It was about the Soviet Union."}, {"time": 2143, "text": "There was respect for a country."}, {"time": 2145, "text": "And now when it started to get personal with Putin, it changed and our thinking changed in a negative way."}, {"time": 2153, "text": "We no longer respected it as a country, we were seeing it as a man."}, {"time": 2157, "text": "And the man we had trashed repeatedly, repeatedly as a poisoner, as a murderer, and none of which has ever been proven, but which has always been repeated and repeated to the point at which it becomes like an Orwell mantra."}, {"time": 2170, "text": "It becomes like, he is of course a bad guy."}, {"time": 2173, "text": "Can I just ask you, as a great filmmaker, as a human being, what was it like talking to one of the most powerful men in the world?"}, {"time": 2183, "text": "For honestly, and I'm not naive, I've talked to a lot of powerful people."}, {"time": 2188, "text": "In the movie business, there are powerful people and many of them are corrupted."}, {"time": 2192, "text": "I've talked to many people in my life."}, {"time": 2194, "text": "I've been in the military, I've seen, I've had other jobs."}, {"time": 2198, "text": "I have to say, I found him to be a human being."}, {"time": 2200, "text": "I just found him to be reasonable, calm."}, {"time": 2204, "text": "I never saw him lose his temper."}, {"time": 2205, "text": "And I mean, you have to understand that most people, most people in the Western way of doing business get emotional."}, {"time": 2213, "text": "I don't see that."}, {"time": 2214, "text": "I saw him as a balanced man, as a man who had studied this like you have."}, {"time": 2219, "text": "There's a calmness to you."}, {"time": 2220, "text": "It comes from studying the world and having a rational response to it."}, {"time": 2226, "text": "It's interesting, his two daughters, one of them is very scientific and the other one's doing very well in another profession, but they're a thinking family."}, {"time": 2235, "text": "His wife too was."}, {"time": 2238, "text": "I can't talk for the new wife because I don't know about it, but he kept his family with great respect."}, {"time": 2243, "text": "He's raised his daughter's right."}, {"time": 2246, "text": "He served Yeltsin the way he looked at it."}, {"time": 2248, "text": "He served Yeltsin well, and he never trashed Yeltsin."}, {"time": 2252, "text": "Certainly a lot of people did, but I asked him repeatedly was he an alcoholic, this or that, but he wouldn't even go that far."}, {"time": 2260, "text": "Just respect."}, {"time": 2261, "text": "And this man, Yeltsin, was in many ways ridiculed by the Russians, and he turned over the power because he felt like he was overwhelmed."}, {"time": 2273, "text": "He turned over the power to this man because why?"}, {"time": 2276, "text": "How many people had he fired before him?"}, {"time": 2277, "text": "Several, several prime ministers, this, that."}, {"time": 2280, "text": "Why did he turn power over to Mr. Putin?"}, {"time": 2283, "text": "Because he respected him for his work ethic and his balance, his maturity."}, {"time": 2290, "text": "And that's what I can say is I saw in him."}, {"time": 2292, "text": "A poor person from a poor family who worked his way up through the KGB, Americans keep saying he's a KGB agent, but it's like saying George Bush was a CIA agent, but he became, you grow, you grow in your life."}, {"time": 2308, "text": "And he went from the KGB to this technocratic position."}, {"time": 2313, "text": "He dealt with many problems, including the Chechnyan War, which is a very difficult situation, as well as the Russian submarine problem."}, {"time": 2323, "text": "Several things happened early in his, that gave him a lot of experience, and he handled them all pretty well."}, {"time": 2329, "text": "Do you think he was an honest man?"}, {"time": 2332, "text": "Now, of course, the question of money, the charge is that he's the richest man in the world, or ludicrous, certainly doesn't live like it or act like it."}, {"time": 2341, "text": "If you're rich, I've been around a lot of rich people in my life."}, {"time": 2345, "text": "You'd probably have, too."}, {"time": 2346, "text": "In America, you run into them."}, {"time": 2347, "text": "So many of them are arrogant."}, {"time": 2348, "text": "I'm actually good friends now with the richest man in the world."}, {"time": 2353, "text": "Of course, I saw your interview with Mr. Musk, who I appreciate."}, {"time": 2358, "text": "At least he speaks freely."}, {"time": 2361, "text": "I'm positive about him owning Twitter, because Twitter has become censorship city, as has all the major tech."}, {"time": 2369, "text": "I mean, the censorship that we are now seeing in the United States is so unAmerican and shocking to me."}, {"time": 2374, "text": "And he is a resistance to that, that is true."}, {"time": 2376, "text": "Yeah, I like Musk for that."}, {"time": 2378, "text": "Just for that only."}, {"time": 2379, "text": "But I also appreciate him, his adventuresome, his nature and his desire to explore the world and to ask questions."}, {"time": 2389, "text": "Yeah, there's certain ways you sound when you speak freely."}, {"time": 2394, "text": "There's certain ways you sound, a man sounds when he speaks freely, and he speaks freely."}, {"time": 2400, "text": "And it's refreshing."}, {"time": 2402, "text": "No matter whether you're rich or not, it doesn't matter."}, {"time": 2405, "text": "When you speak freely, it's a beautiful thing."}, {"time": 2406, "text": "Actually, Musk, in a major point on going back to nuclear energy, he never believed in it at first, apparently."}, {"time": 2415, "text": "He was going for batteries, right?"}, {"time": 2417, "text": "And he put a lot of money into batteries."}, {"time": 2419, "text": "He made them bigger and bigger batteries."}, {"time": 2420, "text": "But it just, as Bill Gates has said, it's just, it's not gonna get us there."}, {"time": 2425, "text": "And now I think Musk is on another path."}, {"time": 2428, "text": "He understands the need for nuclear."}, {"time": 2429, "text": "Yeah, he's a supporter of nuclear."}, {"time": 2435, "text": "Putin never asked for one thing, never."}, {"time": 2437, "text": "It was an interview, it was free form."}, {"time": 2439, "text": "Ask anything you want."}, {"time": 2441, "text": "No restrictions, no rules."}, {"time": 2444, "text": "As with Castro, frankly, Castro did the same thing as did Chavez."}, {"time": 2447, "text": "So I've had good luck in interviewing free ranging subjects, people willing to express themselves."}, {"time": 2452, "text": "He's much more guarded than Castro or Chavez, because as you know, he's setting government policy when he speaks."}, {"time": 2461, "text": "Anything he says is gonna be taken out of context."}, {"time": 2463, "text": "But there was no restrictions on what to talk about, none of that."}, {"time": 2467, "text": "Nor any desire to see anything before we published it."}, {"time": 2470, "text": "No need to check it with him."}, {"time": 2474, "text": "It was a completely."}, {"time": 2477, "text": "Do you think he watched the final product?"}, {"time": 2479, "text": "Yes, I do, but I don't think he made judgments on it."}, {"time": 2483, "text": "I think he was pleased."}, {"time": 2485, "text": "He doesn't go either way."}, {"time": 2486, "text": "You see, he's pleased."}, {"time": 2488, "text": "I mean, it went well and he's happy for us."}, {"time": 2490, "text": "But I don't think he had great enthusiasm expressed it to me."}, {"time": 2494, "text": "He trusted me."}, {"time": 2495, "text": "And you can see the way he dealt with me each time."}, {"time": 2498, "text": "He warmed up to me four times."}, {"time": 2501, "text": "The first time I might've been a little stiff."}, {"time": 2504, "text": "You're asking, you don't know who you're dealing with and so forth."}, {"time": 2509, "text": "But he's used to it now."}, {"time": 2511, "text": "He's done a lot of press."}, {"time": 2513, "text": "The worst press he's done, frankly, has been the American press."}, {"time": 2517, "text": "And not because of his fault, but because of the way they have treated him."}, {"time": 2521, "text": "If you look at the interviews, they're awful."}, {"time": 2524, "text": "First of all, I noticed one thing as a filmmaker, right away, they use an overdub."}, {"time": 2529, "text": "They put a Russian speaker for everything he says, who's much harsher."}, {"time": 2532, "text": "He speaks Russian in a much harsher manner than actually Putin does."}, {"time": 2537, "text": "On my interview, I left him in his original language with translator, and I think that's important because he expresses himself very clearly and calmly."}, {"time": 2547, "text": "When you listen to the American broadcast, it's a belligerent person who looks like he's about to bang his shoe on the table."}, {"time": 2553, "text": "And secondly, the questions are highly aggressive from the beginning."}, {"time": 2558, "text": "There's no sense of rapport, there's no sense of, well, it's why, Mr. Putin, did you poison this person?"}, {"time": 2564, "text": "Why, Mr. Putin, did you kill this person?"}, {"time": 2566, "text": "Why are you a murderer?"}, {"time": 2567, "text": "I mean, it's blunt, blunt negative television."}, {"time": 2572, "text": "Yeah, it's not just aggressive."}, {"time": 2573, "text": "So I obviously speak Russian, so I get to appreciate both the original and the translation."}, {"time": 2580, "text": "And it's not just aggressive, it's very shallow."}, {"time": 2584, "text": "They're not looking to understand."}, {"time": 2586, "text": "To me, aggression is okay if that's the way you wanna approach it, but it should be, there should be underlying kind of empathy for another human being in order to be able to understand."}, {"time": 2599, "text": "And so some of the worst interviews I've ever listened to is by American press of Vladimir Putin."}, {"time": 2605, "text": "So NBC and all those kinds of organizations, it's very painful to watch."}, {"time": 2612, "text": "And you saw the reception to the Putin interviews in America was hostile without seeing it."}, {"time": 2617, "text": "So many people criticized my series without having seen it."}, {"time": 2623, "text": "Even, I went on a show, a television show with this famous coal bearer."}, {"time": 2627, "text": "You know, he's very famous in America."}, {"time": 2629, "text": "And I was shocked on the show to find out that he hadn't seen anything of the four hours."}, {"time": 2633, "text": "He was just attacking Putin."}, {"time": 2636, "text": "And he threw me, I was complicit, therefore I was a Putin supporter."}, {"time": 2641, "text": "And the show was a disaster."}, {"time": 2643, "text": "It's one of my worst television shows."}, {"time": 2645, "text": "I actually, I had to just shut up and get off the air."}, {"time": 2650, "text": "I mean, at some point, it was embarrassing."}, {"time": 2653, "text": "Because the audience, too, was clapping for Kobe on anything he said."}, {"time": 2657, "text": "Well, as an interviewer in that situation, because between you and Vladimir Putin, there was camaraderie, there was joking, there was... Are you worried, do you put that into the calculation when you're making a film with somebody that could be lying to you, that could be evil?"}, {"time": 2681, "text": "When you talk about Castro, you talk about, so are you worried about how charisma of a man across the table from you can... Do I take that into account?"}, {"time": 2693, "text": "I absolutely take that into account."}, {"time": 2695, "text": "I mean, doing Castro, he's a wonderful speaker, he's charismatic, so is Chavez."}, {"time": 2701, "text": "Look at those interviews."}, {"time": 2703, "text": "I took it into account."}, {"time": 2704, "text": "But Putin doesn't play that game."}, {"time": 2706, "text": "He doesn't charm you, he doesn't try to overwhelm you with his bon ami at all."}, {"time": 2713, "text": "He just says, okay, ask your question, I'll give you my answer straight."}, {"time": 2717, "text": "Here it is, and he analyzes it."}, {"time": 2719, "text": "This is the history of NATO, this is the history of our relationship with the United States."}, {"time": 2723, "text": "How many times have we tried to talk to them about such and such and such and such, and each time, we get nowhere."}, {"time": 2729, "text": "In fact, it's a very..."}, {"time": 2732, "text": "I would like to get along with the United States so much, he's saying it so clearly in all his words."}, {"time": 2738, "text": "So to play devil's advocate."}, {"time": 2740, "text": "But he's not making a big deal about it."}, {"time": 2742, "text": "But there is a charisma in the calmness."}, {"time": 2745, "text": "So let's just calm everything down, it's simple facts."}, {"time": 2750, "text": "That you can call, so there's like the Hitler thing, which is screaming, being very loud, charismatic, strong message and so on."}, {"time": 2762, "text": "And then there's a Putin style, I'm not comparing those two, there's the Putin style communication of calmness."}, {"time": 2767, "text": "And that, at least to me, my personality, that can be very captivating, is bringing everything down, the facts are simple."}, {"time": 2775, "text": "But then when you say the facts are simple, you can now start lying."}, {"time": 2778, "text": "And you don't know what's true and what's lies."}, {"time": 2781, "text": "It behooves you to do some research."}, {"time": 2784, "text": "And frankly, when it comes to research, you're gonna have a problem."}, {"time": 2787, "text": "Because if you go to the Americanized versions of Russian history, you're gonna run into a problem."}, {"time": 2793, "text": "And that includes even Wikipedia."}, {"time": 2795, "text": "They will tell you things that are just not factually supported."}, {"time": 2799, "text": "So it was a problem in terms of, if you read all the books in the American library about Putin, there's nothing positive about it."}, {"time": 2808, "text": "They're awful, they're awful."}, {"time": 2809, "text": "And a lot of them, I had a good relationship with Professor Stephen Cohen, who's the most, I think, one of the most informed men on Russia, he'd done a lot of research all his life."}, {"time": 2819, "text": "And knew Gorbachev very well."}, {"time": 2822, "text": "And was very analytical about all these situations that happened before his death in 2019."}, {"time": 2831, "text": "I'm not quite sure when Stephen died, but I knew him well."}, {"time": 2835, "text": "And he gave me the best information I could get."}, {"time": 2840, "text": "I would go to Stephen and I'd say, I'm confused here, tell me the history of this accusation of poisoning against this person and so forth."}, {"time": 2847, "text": "And he'd explain it to me in, I think, the clearest ways that I understood."}, {"time": 2852, "text": "And he said to me once, he said, most of these people who go to Russia and write this stuff about Putin are going off internet."}, {"time": 2858, "text": "The internet has really been a source of a lot of fractured facts here."}, {"time": 2862, "text": "He said, pure analysis."}, {"time": 2864, "text": "You have to go back to the texts, all the documents, and to really fully understand."}, {"time": 2870, "text": "But he spoke Russian."}, {"time": 2874, "text": "And his wife and him, Katerina Vanhoovle, who's an editor, publisher of The Nation magazine, would go to Russia several times a year and talk to their friend Gorbachev."}, {"time": 2888, "text": "And Gorbachev's an interesting character."}, {"time": 2890, "text": "I talked to him, interviewed him, not interviewed him, but talked to him at length, and I like him very much."}, {"time": 2896, "text": "And I saw the divide, as you saw in the Putin interviews, between Gorbachev and Putin."}, {"time": 2900, "text": "Early on in the interviews, you sense Putin doesn't particularly care for Gorbachev because in his point of view, he screwed up the administration of Russia and is responsible for so much of the disaster of leaving all those people outside the Soviet Union."}, {"time": 2916, "text": "So these are problems that continue into the future."}, {"time": 2919, "text": "But they see each other at the, or he knows he's there at the May Day Parade, we filmed, and his attitude is funny, it's very human."}, {"time": 2933, "text": "He says, you know, he's welcome, he's got his pension, he's a pensioneer, he's done his duty."}, {"time": 2939, "text": "There's no animus towards him."}, {"time": 2944, "text": "Even when Gorbachev, in the early days, as you remember, criticized for his manners in terms of democracy, but I don't know that that becomes a quarrel."}, {"time": 2954, "text": "But frankly, by the end of the situation, it's very clear that Gorbachev has now moved closer and closer to the, says that Russia is now really under attack."}, {"time": 2964, "text": "This is, he sees where the United States has made a concerted effort to undermine Putin."}, {"time": 2971, "text": "And he's repeated this several times about Ukraine."}, {"time": 2975, "text": "I think you've seen what he said."}, {"time": 2977, "text": "You can quote it."}, {"time": 2979, "text": "And Gorbachev is, we have no respect for Gorbachev even, even at this juncture."}, {"time": 2983, "text": "When can you see Gorbachev's ideas printed in most American newspapers?"}, {"time": 2988, "text": "Very rarely, very rarely, and recently not at all."}, {"time": 2992, "text": "So Gorbachev, who was our hero back in, an American hero back in the 1980s, has now been condemned to the garbage can, so to speak, of history."}, {"time": 3001, "text": "Well, in this complicated geopolitical picture you just outlined, can we talk about the recent invasion of Ukraine?"}, {"time": 3012, "text": "So you wrote on Facebook a pretty eloquent analysis, I think on March 3rd."}, {"time": 3022, "text": "Let me just read a small section of that, just to give context, and maybe we can talk a little bit more about both Russia and the man Putin."}, {"time": 3033, "text": "You wrote, although the United States has many wars of aggression on its conscience, it doesn't justify Mr. Putin's aggression in Ukraine."}, {"time": 3041, "text": "A dozen wrongs don't make a right."}, {"time": 3044, "text": "Russia was wrong to invade."}, {"time": 3046, "text": "It has made too many mistakes."}, {"time": 3048, "text": "One, underestimating Ukraine resistance."}, {"time": 3051, "text": "Two, overestimating the military ability to achieve its objective."}, {"time": 3055, "text": "Three, underestimating Europe's reaction, especially Germany, upping its military contribution to NATO, which they've resisted for some 20 years."}, {"time": 3064, "text": "Even Switzerland has joined the cause."}, {"time": 3067, "text": "Russia will be more isolated than ever from the West."}, {"time": 3071, "text": "Four, underestimating the enhanced power of NATO, which will now put more pressure on Russia's borders."}, {"time": 3078, "text": "Five, probably putting Ukraine into NATO."}, {"time": 3082, "text": "Six, underestimating the damage to its own economy, and certainly creating more internal resistance in Russia."}, {"time": 3089, "text": "Seven, creating a major readjustment of power in its oligarch class."}, {"time": 3094, "text": "Eight, putting cluster and vacuum bombs into play."}, {"time": 3099, "text": "Nine, and underestimating the power of social media worldwide."}, {"time": 3105, "text": "And you go on for a while giving a much broader picture of the history and the geopolitics of all of this."}, {"time": 3113, "text": "So now, a little bit later, two months later, what are your thoughts about the invasion of Ukraine?"}, {"time": 3125, "text": "Well, it's very hard to be honest in this regard because the West has brought down a curtain here and anyone who questions the invasion of Ukraine and its consequences is an enemy of the people."}, {"time": 3144, "text": "It's become so difficult."}, {"time": 3146, "text": "I've never seen in my lifetime ever such a wall of propaganda as I've seen in the West."}, {"time": 3158, "text": "And that includes France too because I was there recently and England."}, {"time": 3162, "text": "England is of course really vociferous."}, {"time": 3166, "text": "It's shocking to me how quickly Europe moved in this direction and that includes Germany."}, {"time": 3172, "text": "I have German friends who express to me their shock over Ukraine."}, {"time": 3176, "text": "I have Italian friends, same thing."}, {"time": 3178, "text": "And Italy of course has been perhaps the most understanding and compassionate of countries."}, {"time": 3183, "text": "So it's quite evident that there's a united, and this attests to the power of the United States."}, {"time": 3191, "text": "And of course you have Finland and Svinland which has generally been reasonable jumping in, talking about joining NATO and Sweden too."}, {"time": 3201, "text": "Generally there's been some more restraint in Europe."}, {"time": 3206, "text": "That's what surprised me the most, Europe."}, {"time": 3209, "text": "How quickly they fell into this NATO basket which is very dangerous for Europe, very dangerous."}, {"time": 3216, "text": "This goes back to my idea what I was saying earlier about sovereignty."}, {"time": 3221, "text": "These countries don't really give me a sense that they have sovereignty over their own countries."}, {"time": 3227, "text": "They don't feel, to me I'm obviously intuition here is working, I just don't feel that they have freedom to say what they really think and they're scared to say it."}, {"time": 3239, "text": "When the United States invaded Iraq in 2003, I remember with great in a sense satisfaction that at least France, Chirac who I had not really known much about, stood up and said the United States we're not gonna join you in this expedition, basically into madness."}, {"time": 3258, "text": "Schroeder in Germany, same thing."}, {"time": 3261, "text": "Of course Putin condemned the invasion and Putin had been an ally of the United States since 9 11 if you remember correctly."}, {"time": 3269, "text": "And had called Bush and they were getting along."}, {"time": 3272, "text": "So even Putin said I won't go, don't go into Iraq."}, {"time": 3276, "text": "This is not the solution."}, {"time": 3278, "text": "He didn't oppose Afghanistan but he opposed Iraq."}, {"time": 3281, "text": "So Chirac and Schroeder stood for the old Europe."}, {"time": 3286, "text": "I remember de Gaulle, Charles de Gaulle, he was independent of the United States."}, {"time": 3292, "text": "Charles de Gaulle pulled France out of NATO because he saw the dangers of NATO, which is to say you have to fight an American war."}, {"time": 3299, "text": "When they say and they put nuclear weapons on your territory in England and France and Italy and Germany, when they do that, you're hitched to this superpower and you have no say in what they're gonna do."}, {"time": 3314, "text": "If they declare war and they use your territory, you're gonna be involved in a major conflict."}, {"time": 3320, "text": "I'm talking about sovereignty."}, {"time": 3322, "text": "Where is that sovereignty?"}, {"time": 3323, "text": "They don't have it."}, {"time": 3324, "text": "And that has influenced their mindset for years now."}, {"time": 3328, "text": "Since 1940, well de Gaulle was the 60s."}, {"time": 3333, "text": "He actually reversed the whole flow and I think it was Sarkozy who put France back into NATO and now it's Macron."}, {"time": 3344, "text": "I hope because he was talking to Putin would at least have an independent viewpoint that could be helpful here, so he rolled it up."}, {"time": 3353, "text": "He may have told Putin something else, but within days he had rolled it up and gone along with the United States position, which was enforced by the United States in a very fierce way."}, {"time": 3363, "text": "The propaganda, as I say, I don't know how much time you spend in America, but it was vicious and everything was anti Russian."}, {"time": 3370, "text": "Russia were killing all these people, were shooting down civilians, although there was no proof of it."}, {"time": 3378, "text": "There was just, these are the accidents of war, but all of a sudden it was a campaign of criminality and they were talking about bringing Putin into war crime trial."}, {"time": 3387, "text": "Well, why didn't they talk like that when Iraq was going on and Bush was killing far more people?"}, {"time": 3393, "text": "Or for that matter, why were they not talking about the killings in Donbass and Lugansk during that 2014 to 2022 period?"}, {"time": 3405, "text": "That is what, it's a crime."}, {"time": 3407, "text": "There were so many people that were killed, many of them innocent, many of them innocent."}, {"time": 3411, "text": "What would be the way for Vladimir Putin to stop the killing in Donbass without the invasion of Ukraine?"}, {"time": 3422, "text": "That's a very good question and I've asked that several times and I don't have the, I have not talked to him since about two years now."}, {"time": 3433, "text": "What's the mistakes, what the human mistakes and the leadership mistakes made by Vladimir Putin?"}, {"time": 3439, "text": "You see, what the American press has not said and the Western press has not said is that on February 24, was it, that was, on that day when they invaded, the day before, if you check the logs of the European organization that was supervising, was in the field in Ukraine."}, {"time": 3457, "text": "These are neutral observers."}, {"time": 3459, "text": "They were seeing heavier and heavier artillery fire going into Donbass from the Ukrainian side."}, {"time": 3470, "text": "So they had, apparently, Ukraine had 110,000 troops on the border."}, {"time": 3476, "text": "They were about to invade Donbass, that was the plan."}, {"time": 3480, "text": "Russia, because of the buildup on the border of Donbass, brought 130, they say 130,000 troops to the area near Donbass, right?"}, {"time": 3493, "text": "So you have buildup of forces on both sides, but you wouldn't know that from reading the press in the West."}, {"time": 3499, "text": "You'd believe that the Russians suddenly put all these men into the situation with the idea of invading Ukraine, not only Donbass, but invading all of Ukraine and getting rid of the, decapitating the government there, which is all assumption."}, {"time": 3514, "text": "We don't know what they would intend it to do."}, {"time": 3516, "text": "But you, at the time, as in a lot of people, thought that all the talk of the invasion, Russian invasion of Ukraine, is just propaganda."}, {"time": 3529, "text": "It's very unlikely to happen."}, {"time": 3530, "text": "I think many of us thought that the United States is building this up into an invasion."}, {"time": 3534, "text": "In other words, that is the nature of false flag operations, when you create this propaganda."}, {"time": 3540, "text": "They are gonna invade."}, {"time": 3542, "text": "And then, when they invaded, the United States was completely ready, and all their allies were completely ready for the invasion, correct?"}, {"time": 3549, "text": "So why did Putin do that?"}, {"time": 3551, "text": "He fell into this, theoretically, into this trap set by the United States."}, {"time": 3556, "text": "Here you're telling all your allies across the board they're gonna invade."}, {"time": 3559, "text": "But you."}, {"time": 3561, "text": "Why do you think he did it?"}, {"time": 3563, "text": "So here, is it madness, or is it common strategic calculation, perhaps?"}, {"time": 3569, "text": "This one I cannot answer you faithfully, because, first of all, we don't know what he was told."}, {"time": 3574, "text": "If he was indeed getting the right intelligence estimates, from what I said earlier in that essay I wrote, you would think he was not well informed, perhaps, about the degree of cooperation he would get from the Ukrainian Russians in Ukraine."}, {"time": 3597, "text": "That would be one factor, that he wasn't, he didn't assess the operation correctly."}, {"time": 3603, "text": "Remember this."}, {"time": 3604, "text": "Mr. Putin has had this cancer, and I think he's licked it, but he's also been isolated because of COVID."}, {"time": 3612, "text": "And some people would argue that the isolation from normal activity, which he was meeting people face to face, but all of a sudden he was meeting people across the table 100 yards away, or whatever, 10 yards away, it was very hard."}, {"time": 3626, "text": "Perhaps he lost touch with, contact with people."}, {"time": 3630, "text": "So it's not just power, it's the very simple fact that you're just distant from humans."}, {"time": 3634, "text": "As I say, I'm speculating, I don't know."}, {"time": 3636, "text": "I see that, and I also, perhaps he thought in his mind that there would be a faster resolution that the Ukrainian, because the evidence had been that the Ukrainian Russians, the Ukrainian army had folded so many times, and that they were only backed up and they were stiffened by the resistance of the Nazi oriented Azov battalions."}, {"time": 3662, "text": "That was a factor, of course."}, {"time": 3664, "text": "And that is a big factor for the Russians because these people are very tough, they rush."}, {"time": 3668, "text": "See, what people don't understand is that Ukraine, since 2014, has been a terror state."}, {"time": 3674, "text": "They've been run, anytime a Ukrainian has expressed any understanding of the Russian Ukrainian position, they've been threatened by the state."}, {"time": 3688, "text": "From 2014 to 2022, there's been a set of hideous murders that people don't even know about in the West."}, {"time": 3694, "text": "Journalists, people who speak out, liberals, people who, I interviewed Viktor Medvedev, who they make out to be some kind of horrible person, but Medvedev was a very important figure in the administration of Khushma, the first Ukrainian Prime Minister in the 1990s, and he did a great job on the economy."}, {"time": 3714, "text": "He was a very thoughtful man."}, {"time": 3715, "text": "If you'll see my interview, it's called Ukraine Revealed."}, {"time": 3718, "text": "He's very thoughtful about the future of Ukraine."}, {"time": 3720, "text": "He doesn't want to go back and join Russia."}, {"time": 3722, "text": "He wants it to be an independent country."}, {"time": 3724, "text": "Ukraine is independent, and he wants it to be a functioning economic democracy, more or less, a democracy, if you can get that, that exists in a neutral state, a neutral state, which Ukraine used to be before 2014."}, {"time": 3739, "text": "It was neutral from 1991 to 2014, neutral, very important."}, {"time": 3745, "text": "Under Poroshenko, it just immediately went into an anti Soviet Cold War position as an ally of the United States, and my point was that it was a very dangerous place in Ukraine."}, {"time": 3759, "text": "People were being killed, death squads were out there."}, {"time": 3763, "text": "Medvedev, they stripped him of his television stations very suddenly, this is Zelensky, the new president."}, {"time": 3770, "text": "Zelensky was elected on a peace platform, remember that."}, {"time": 3774, "text": "70% of the country was for him to make peace with Russia."}, {"time": 3777, "text": "Did he ever even try to make peace with Russia?"}, {"time": 3780, "text": "Did he attend any of the Minsk Two agreements?"}, {"time": 3784, "text": "Did he visit, did he pay any attention to the Minsk?"}, {"time": 3788, "text": "Did he pay attention to Putin?"}, {"time": 3789, "text": "Did he go to Russia?"}, {"time": 3791, "text": "The moment he got into office, I'm convinced that the militant sector of the right sector parties of Ukraine let him know that you will not make a deal with Russia, there'll be no concessions to Russia."}, {"time": 3810, "text": "This is very dangerous."}, {"time": 3811, "text": "This is where this attitude that's very, very hostile to Russia has hurt us."}, {"time": 3815, "text": "The whole world is being hurt by this, and no one calls them out."}, {"time": 3820, "text": "No one calls them out."}, {"time": 3821, "text": "Zelensky backed off from his platform as running for president, and as president, has been ineffective, did nothing to promote it."}, {"time": 3830, "text": "On the contrary, went the other way, and seemed to support the Ukrainian aggression."}, {"time": 3836, "text": "Well, he found his support in this war."}, {"time": 3839, "text": "You've revealed through your work some of the most honest and dark aspects of war."}, {"time": 3844, "text": "Nevertheless, this is a war, and there's a humanitarian crisis."}, {"time": 3850, "text": "Millions of people, refugees, escape in Ukraine."}, {"time": 3856, "text": "What do you think about the human cost of this war, initiated by whoever, just as you write, whatever the context, whatever NATO, whatever pressure, as you wrote, Russia was wrong to invade."}, {"time": 3872, "text": "Okay, yeah, let's get back to that original question."}, {"time": 3876, "text": "You said, what was he thinking at that time?"}, {"time": 3878, "text": "We never answered that."}, {"time": 3879, "text": "Now, by the way, among those people who've been ruined by this war, you have to include the 2014 to 2022 Ukrainian Russians."}, {"time": 3893, "text": "14,000 were killed, not necessarily by, some of them by maybe accident and this and that, but certainly a large number of that is responsible to the Ukrainian military and the Nazi related battalions who have done a good job of death squatting that whole area."}, {"time": 3911, "text": "And remember, I did a film about Salvador."}, {"time": 3913, "text": "I know a little bit about death squads and how they work, and I know about paramilitaries, because in South America, they're all over the place."}, {"time": 3919, "text": "America supports, hates Venezuela, goes on about Venezuela, but do they tell you anything about Colombia, its next door neighbor?"}, {"time": 3927, "text": "Colombia for years has been plagued by paramilitaries that are right wing, and the United States has said, nothing about them except occasionally, there's a newspaper report now."}, {"time": 3936, "text": "So this support of death squads by the United States is all over the world."}, {"time": 3940, "text": "It's not just in South America and Central America where we see plenty of evidence of it."}, {"time": 3946, "text": "It's here too, and this is what's horrible about this whole thing, this hypocrisy of America that they can support such evil, such evil."}, {"time": 3955, "text": "Now, going back to your larger question about, yeah, it's a terrible refugee disaster, but again, we have to get the numbers."}, {"time": 3963, "text": "Let's get the numbers and get the evidence, because I would ask you, I'm not sure at this point whether more civilians were killed before 2022 in Donbass than have been killed in this latest."}, {"time": 3975, "text": "So we can't talk about this without, we can't talk about the invasion of Ukraine without considering the full war between Russia and Ukraine since 2014."}, {"time": 3984, "text": "That's correct, absolutely, and take the toll on both sides, and you might be surprised by the result."}, {"time": 3992, "text": "I think the Russian military, of course, I'm not there, and I'm not, this is speculation."}, {"time": 3997, "text": "The Russian military has slowed down, and part of that reason is not to keep the civilian corridors open, and I think the Ukrainian military has made it more difficult on purpose, especially some of these battalions that are death squad battalions have gone out of their way to keep the civilians locked into these cities in danger because it's in their interest to do so."}, {"time": 4018, "text": "So there's no reason why Ukrainian military, who have killed Ukrainian civilians for years, would change their policies."}, {"time": 4026, "text": "They would have no compunctions about wiping out, for example, people with white armbands in Bukha."}, {"time": 4032, "text": "Okay, as to what Putin was thinking at the time, I wondered this, and I still do."}, {"time": 4038, "text": "I said, okay, so Putin can say, let's say the Ukrainian government wants to now invade Donbass."}, {"time": 4047, "text": "This is on February 23, and they have artillery, they're peppering the whole place."}, {"time": 4052, "text": "They're gonna go in, and they're gonna get Donbass back."}, {"time": 4056, "text": "And you have Russian separatists, who are Russian Ukrainians who are on, who are gonna fight."}, {"time": 4067, "text": "How far do you go in supporting them?"}, {"time": 4069, "text": "Can Russia at this point say, well, we can't help you."}, {"time": 4071, "text": "You have to get along, you have to somehow, you have to be absorbed by the Kiev, you're gonna be absorbed by them, and they're not gonna give you autonomy, and you have to live with them, and there's gonna be a price to pay."}, {"time": 4084, "text": "You could do that, and you could also say, well, we open our borders to Donbass."}, {"time": 4088, "text": "You can come in to our country, you can leave, and we will help you to resettle."}, {"time": 4093, "text": "And that would be a reasonable approach."}, {"time": 4096, "text": "So you take it to the next stage, as Putin's thinking."}, {"time": 4098, "text": "You take it to the next stage."}, {"time": 4100, "text": "You stall, it's harder for your, of course, there's this pressure on Putin from inside his own government to say, what are you gonna do?"}, {"time": 4108, "text": "I mean, you can't do this, there's a lot of nationalists in Russia."}, {"time": 4111, "text": "They would certainly bring, it would be to his, they'd say Putin is weak, and that's the biggest rap you can ever give a Russian leader, is you're weak, you can't get anything done."}, {"time": 4121, "text": "So there would have been some damage, but let's say he goes with that, and he says, okay, we know what the United States intention is."}, {"time": 4127, "text": "It's to get rid of me, regime change, and to get another Yeltsin in."}, {"time": 4133, "text": "That's what they want."}, {"time": 4134, "text": "And they will go to any ends, they will destroy Ukraine if necessary, but they want regime change in Russia."}, {"time": 4140, "text": "And then after they do that, of course, they'll go after China, but that's the ultimate policy of the United States."}, {"time": 4146, "text": "This is a country that has no compunctions about going all the way, and it will use hypocrisy and all the news propaganda in the world to get what it wants."}, {"time": 4156, "text": "This is the equivalent, frankly, of Germany's goals in World War II, world domination."}, {"time": 4162, "text": "There's no question in my mind, but we're going about it in our way as opposed to Hitler's way."}, {"time": 4169, "text": "So just to finish your thought, where do they go?"}, {"time": 4172, "text": "What's stage two?"}, {"time": 4173, "text": "Okay, let's say they take, Ukraine takes back Donbas."}, {"time": 4176, "text": "Let's say people get killed in large quantities."}, {"time": 4180, "text": "So we now to the next stage, we're finished with the Minsk II agreements that were never adhered to."}, {"time": 4185, "text": "So what does Russia do?"}, {"time": 4186, "text": "They wait for the next aggression, which is gonna come in one form or another."}, {"time": 4192, "text": "Perhaps in Georgia, I don't know what happened, what the US is thinking, but the US cannot say Russia has done anything."}, {"time": 4202, "text": "They have not used violence to stop Donbas from belonging back to Ukraine, right?"}, {"time": 4207, "text": "So you're in a new setup now."}, {"time": 4210, "text": "It's a whole thing rearranges."}, {"time": 4212, "text": "Now you have, but you still have nuclear weapons, and you still have a Russian nuclear weapons, and they're serious weapons."}, {"time": 4219, "text": "They're very well developed, crude, but not as refined as the American nuclear force, but powerful."}, {"time": 4226, "text": "That becomes another game."}, {"time": 4227, "text": "Then you open another chess board, and you still haven't been condemned."}, {"time": 4231, "text": "The sanctions haven't been imposed."}, {"time": 4233, "text": "That's a new, it's a new game."}, {"time": 4235, "text": "Could he have done, could he have lived with that?"}, {"time": 4236, "text": "That's the question I ask myself."}, {"time": 4239, "text": "So you see ultimately Ukraine today as a battleground for the proxy war between Russia and the United States."}, {"time": 4245, "text": "The United States would have then NATOized Ukraine, or certainly put more weapons in."}, {"time": 4251, "text": "The United States has already done a lot in Ukraine with intelligence, with training advisors."}, {"time": 4257, "text": "The intelligence aspect of the Ukrainian army has been raised enormously by the United States contribution."}, {"time": 4264, "text": "Is it possible for you to steal man, to play devil's advocate against yourself, and say that Vladimir Zelensky is fighting for the sovereignty of his nation?"}, {"time": 4274, "text": "And in a way against Russia, but also against the United States, it just happens that for now, the United States is a useful ally."}, {"time": 4283, "text": "But ultimately, the man, the leader, is fighting for the sovereignty of his nation."}, {"time": 4289, "text": "I would think, he thinks so."}, {"time": 4291, "text": "Yes, and he could say that."}, {"time": 4293, "text": "But he's not acknowledging that the sovereignty of his nation was stolen in 2014 with the coup d'tat that brought this right sector into power, and they have controlled the country since then."}, {"time": 4306, "text": "It's thuggery, what they've done."}, {"time": 4310, "text": "The Medvedev case is a case in point."}, {"time": 4312, "text": "They just take what they need."}, {"time": 4313, "text": "They go to a house, and they have a, how many people have been killed?"}, {"time": 4317, "text": "Serious people, journalists killed by these battalions."}, {"time": 4322, "text": "That's what people don't realize."}, {"time": 4324, "text": "In other words, you can't speak out."}, {"time": 4326, "text": "A person like me would have been on the death list on day five."}, {"time": 4331, "text": "There's no opposition to Zelensky, so he doesn't have a real sovereignty."}, {"time": 4336, "text": "It was a stolen sovereignty."}, {"time": 4337, "text": "Do you think President Zelensky would accept an interview with you today?"}, {"time": 4344, "text": "Actually, since I made Ukraine on Fire, a documentary which perhaps you've seen, which records the incidents of 2014 and the Maidan demonstrations, and shows you the dishonesty behind it, no, I think that they've been very negative, and they would kill me if I was in Ukraine."}, {"time": 4366, "text": "I mean, they don't have any, these people are very tough."}, {"time": 4370, "text": "These are as rough as they come, in my opinion, and I've seen rough in my life."}, {"time": 4374, "text": "I mean, these guys are not playing fair at all."}, {"time": 4377, "text": "These are death squads."}, {"time": 4379, "text": "No, I don't think, and Zelensky would have nothing to do with it, but of course, it would be dangerous for me, and they've been very hostile in their policies to any Ukrainians abroad who are also threatened."}, {"time": 4391, "text": "In other words, you could be in Paris, but if you speak out too much, I think Ukrainians know that they're gonna be targeted, and I think that's part of the reason they don't talk."}, {"time": 4401, "text": "A lot of them, you have to take the anti Russian line, but I think a lot of them are divided."}, {"time": 4406, "text": "So you think you would be killed, and Zelensky wouldn't even know about it, so there is?"}, {"time": 4411, "text": "Well, I don't think, if I was killed certainly abroad, no, they wouldn't kill me abroad."}, {"time": 4415, "text": "I think they'd figure out a way."}, {"time": 4417, "text": "No, no, no, no, if you traveled to Ukraine, I mean."}, {"time": 4420, "text": "I wouldn't get in, I wouldn't get in, except through Donbass, I'd come through."}, {"time": 4424, "text": "There are some Americans in Donbass who are reporting on the war there, and I read their reports, actually."}, {"time": 4429, "text": "They're pretty interesting, because they show you the cruelty of what's going on, but never mentioned in the West, never."}, {"time": 4435, "text": "That's what's so strange about this."}, {"time": 4438, "text": "This is a modern world that we're living in, and yet this information is not coming out to the mass of the people, and on the contrary, the United States has closed down all the information centers that are possible to alternative news getting to the American people."}, {"time": 4455, "text": "They've seriously made an effort, and the BBC, English, and France."}, {"time": 4460, "text": "I was shocked when France closed RT down, because RT is actually pretty good."}, {"time": 4464, "text": "Yes, they may, it's called, there are distortions, but you know as well as I do, because you hear, you speak that RT has done a very brave job of putting correspondents into the field in very dangerous positions, and they've gotten great footage of some of the violence that's going on."}, {"time": 4480, "text": "Well, given the wall of propaganda in the West, I also see the wall of propaganda in Russia, the wall of propaganda in China, the wall of propaganda in India."}, {"time": 4491, "text": "What do we do with these walls of propaganda?"}, {"time": 4494, "text": "Yes, let's talk about Russia, because you would know more about it, but my last experience there, newspapers, it was more interesting, put it this way, when I went to Venezuela, the United States was saying back then that Chavez controlled the press."}, {"time": 4509, "text": "I get to Venezuela, and there's nothing but criticism of Chavez in the press."}, {"time": 4512, "text": "It was owned by the oligarchs of Venezuela, and who hated him, so it was across the board."}, {"time": 4518, "text": "That's why Chavez opened the state television, spent more money on it, and advertised his point of view through state television."}, {"time": 4527, "text": "But in Russia, there is, what I saw was criticism."}, {"time": 4532, "text": "I met with a publisher who got the Nobel Prize of that famous newspaper, and his point of view at that time when I spoke to him a few years ago was we're operating, there is criticism of him, but you can't call for the overthrow of the government, nor in Venezuela, nor in the United States for that matter."}, {"time": 4550, "text": "If you call for the overthrow of the government of the United States, you're gonna be in deep trouble."}, {"time": 4555, "text": "Well, all right, so to push back on that, it's interesting, it's so interesting, because we mentioned Elon Musk, and there's a way that people sound when they speak freely."}, {"time": 4566, "text": "When I speak to, I have family in Ukraine, I have family in Russia."}, {"time": 4571, "text": "When I speak to people in Russia, let's put my family aside, when I speak to people in Russia, I think there's fear."}, {"time": 4581, "text": "I think they don't, sometimes when you call for the overthrow of government, that's important, not because you necessarily believe for the overthrow of the government, but you just need to test the power centers and make sure they're responsive to the people."}, {"time": 4601, "text": "And I feel like there's a mix of fear and apathy that has a different texture than it does in the United States."}, {"time": 4613, "text": "That worries me, because I would like to see the flourishing of a people in all places."}, {"time": 4621, "text": "Well, as I said, my impression was that there's far more freedom in the press than was pictured by the West, and that means different points of view, because the Russians are always arguing with themselves."}, {"time": 4632, "text": "I've never seen a country that's so contentious."}, {"time": 4634, "text": "There's more intellectuals in Moscow and the cities than you can believe, and you know the Russian people there."}, {"time": 4643, "text": "They've been fighting government for years, back from the 1870s, it was czarist times, they're always plotting against the government, and the intelligentsia has known through history as being contentious and anti government in many ways."}, {"time": 4657, "text": "And we see the same thing, educated people turning against Russia."}, {"time": 4660, "text": "I don't appreciate those people, because I think they're very spoiled, and they don't understand some of the stuff that's going on in the West."}, {"time": 4666, "text": "But we have a lot of Russians in Europe and America that attack Russia and sometimes don't understand that they are under pressure from the United States, and they don't understand the size of the pressure."}, {"time": 4679, "text": "And that's why Putin connects with the people, because he represents the common, more the common man who's saying to you, your interests are threatened, Russia is threatened."}, {"time": 4691, "text": "We are representing only the interests of Russia, not, we're not an empire, we're not gonna expand."}, {"time": 4696, "text": "He has no empire intentions, although the West paints it as empire."}, {"time": 4701, "text": "I see no evidence of it."}, {"time": 4704, "text": "Why didn't he do something in all these years?"}, {"time": 4706, "text": "Nothing, he did nothing except defend the country in Georgia and in Chechnya."}, {"time": 4710, "text": "So the imperialist imperative is coming more from the West."}, {"time": 4714, "text": "It's the imperialist, it's the imperialist agenda."}, {"time": 4717, "text": "Going back to, I'm sorry, where we left our discussion off, I mean, I was gonna go on with America not only being censored, closed down now, closed down."}, {"time": 4727, "text": "And you say it's not fear, well, it is fear."}, {"time": 4730, "text": "I am scared, because if you get your Facebook page suspended or your YouTube, your Twitter account thrown off, a lot of good people are getting there, thrown off."}, {"time": 4742, "text": "You can't speak out, it affects your business."}, {"time": 4744, "text": "It goes back to the 1950s when my father's world, when you could not express any sympathy for a Soviet Union without endangering your job, without basically being not trusted."}, {"time": 4756, "text": "You had to be part of the program to get along, to go along."}, {"time": 4760, "text": "Same thing when the United Kingdom, I mean, for all their talk, this Boris Johnson is an idiot."}, {"time": 4766, "text": "But all their talk about, do you remember their policies with the IRA in Ireland when Ireland was threatening them?"}, {"time": 4772, "text": "They cut off the IRA completely."}, {"time": 4774, "text": "Gerry Adams, who was a wonderful guy, I met him, was not allowed to even be heard in Britain during certain years."}, {"time": 4781, "text": "In France, all constantly through the Algerian War, the Algerians were not allowed to be heard."}, {"time": 4786, "text": "The Algerian War for Independence divided France greatly."}, {"time": 4791, "text": "You could not even show Paths of Glory, World War I film in France for, I don't know, 20 years after it came out."}, {"time": 4798, "text": "Censorship is a way of life when democracies also feel threatened."}, {"time": 4802, "text": "They are much more fragile than they pretend to be."}, {"time": 4805, "text": "A healthy democracy would take all the criticism in the world and shrug it off and say, okay, that's what's good about our country."}, {"time": 4811, "text": "Well, I'd like to see that in America."}, {"time": 4813, "text": "There are times that it's been like that, but it's so scary now."}, {"time": 4817, "text": "So it is scary, that's what I was trying to say."}, {"time": 4820, "text": "It's not unscary to me."}, {"time": 4822, "text": "In China, I would say to you, yes, it's much scarier to me because there is the internet wall that they cut off, and I got into problems in China too because I said something years ago about you have to discover your own history."}, {"time": 4837, "text": "You have to be honest about Mao."}, {"time": 4838, "text": "You have to go back and let's make a movie about Mao."}, {"time": 4842, "text": "That upset them and show his negatives."}, {"time": 4846, "text": "So China has been much more sensitive than Russia about criticism, much more."}, {"time": 4851, "text": "And it is a source of problems, but on the other hand, China has a lot of grievances, a lot going back to the 19th century and the British imperialism of that era and the American imperialism."}, {"time": 4862, "text": "If you could talk to Vladimir Putin once again now, what kind of things would you talk about here?"}, {"time": 4871, "text": "What kind of questions would you ask?"}, {"time": 4873, "text": "Huh, well, one thing I would certainly ask is what you were thinking on February 23, and I would ask him to reply to my question about what if you took this to phase two."}, {"time": 4886, "text": "You surrendered in Donbass."}, {"time": 4888, "text": "You had no ego about it."}, {"time": 4890, "text": "You just surrendered."}, {"time": 4891, "text": "It's in your interest to your country, and you invited all the refugees from Donbass into Russia as much as they can."}, {"time": 4898, "text": "What would you do now?"}, {"time": 4900, "text": "What's the US next move in your opinion?"}, {"time": 4903, "text": "How are you gonna, okay, where are we gonna go?"}, {"time": 4906, "text": "That would be the key question because it's, but he didn't go that way."}, {"time": 4911, "text": "He chose to take the sanctions and to go this way."}, {"time": 4916, "text": "Why he did that is a key question for our time."}, {"time": 4920, "text": "Perhaps it was a mistake."}, {"time": 4921, "text": "Perhaps it was his judgment."}, {"time": 4923, "text": "Perhaps, as I said, but I don't, knowing the man I did, I don't think so."}, {"time": 4927, "text": "I think it was calculated."}, {"time": 4929, "text": "Now this is projection and speculation, but there's something different about him in the past several months."}, {"time": 4936, "text": "It could be the COVID thing, the isolation that you mentioned."}, {"time": 4940, "text": "I listen to a lot of interviews and speeches in Russian, and there's something about power over time that can change you, that can isolate you."}, {"time": 4950, "text": "Well, when I was there, no, he'd been in office for already 15 years."}, {"time": 4955, "text": "He had power."}, {"time": 4957, "text": "He didn't misuse it in my opinion."}, {"time": 4958, "text": "He was very even."}, {"time": 4959, "text": "I saw him go on television and talk to his fellows the same way he always talked to them."}, {"time": 4964, "text": "He grew in intelligence and knowledge because he had dealings with the whole world."}, {"time": 4970, "text": "Now people had come to him."}, {"time": 4972, "text": "He was very well known in Africa and Middle East, certainly Syria, and I just never saw misuse of his power."}, {"time": 4981, "text": "I saw humility in him, actually."}, {"time": 4983, "text": "So perhaps there was a calculation and he calculated wrong in terms of what happens if he doesn't invade."}, {"time": 4992, "text": "Perhaps there was a calculation, perhaps he had a calm and clear mind, and he calculated wrong."}, {"time": 4998, "text": "Well, he also made the point that he, the talk of Zelensky saying, well, nuclear weapons were gonna come into Ukraine."}, {"time": 5005, "text": "There was talk about that right before the invasion too, and certainly that would have set off alarms."}, {"time": 5010, "text": "You know, the United States is already kind of doing that by not only putting its intelligence and its heavy weaponry into Ukraine, but you've got to deal with the question, the next question that comes up, the most immediate question is, is the United States gonna start?"}, {"time": 5027, "text": "And I'm saying this is good."}, {"time": 5030, "text": "They're making a lot of noise in United States press about Russia using nuclear weapons and chemical weapons."}, {"time": 5036, "text": "That's a lot of noise."}, {"time": 5038, "text": "Again, going back to my analogy, when the United States starts that, it starts the conversation going."}, {"time": 5044, "text": "It's in the interest of the United States for Russia to be pinned with any kind of chemical or nuclear incident."}, {"time": 5056, "text": "Except, for example, it'd be very, not simple, but it would be possible to explode a nuclear device in Donbass and kill thousands of people."}, {"time": 5067, "text": "And we would not know right away who did it, but of course the blame would go right to Russia, right to Russia, even if it didn't make sense, if there was no motivation for it."}, {"time": 5076, "text": "It would just be blamed on Russia."}, {"time": 5078, "text": "The United States might well be the one who does that false flag operation."}, {"time": 5082, "text": "It would not be beyond them."}, {"time": 5084, "text": "It would be a very dramatic solution to sealing this war off as a major victory for the United States."}, {"time": 5092, "text": "No, but it can happen."}, {"time": 5093, "text": "It can happen."}, {"time": 5094, "text": "A one kiloton device, low yield, it's possible."}, {"time": 5099, "text": "So when you walk across that line, you can potentially never walk back."}, {"time": 5105, "text": "Well, I think the United States is calculating that it's a dangerous, yes, I agree, but I think the neoconservative arrogance is such that they really believe they can push their advantage to the max now because of all these propaganda successes up to now."}, {"time": 5121, "text": "The Ukrainian army could be wiped out for all we know."}, {"time": 5123, "text": "There's all this leftists or neo, Nazi brigades, but they're being advised very well by US and they're sending the weapons in, are huge amounts of weapons."}, {"time": 5131, "text": "What about American budget?"}, {"time": 5133, "text": "No one talks about how much money we're giving to Ukraine."}, {"time": 5136, "text": "It's a billion dollars already in weaponry and not most of it just poured in."}, {"time": 5141, "text": "What about, you know, the Russian budget is, defense budget is 60 some billion dollars a year."}, {"time": 5151, "text": "It's nothing compared to the United States, 1 15th of it."}, {"time": 5154, "text": "But yet we've put so much weaponry into Ukraine."}, {"time": 5159, "text": "The money we've spent on Ukraine is equivalent almost to what we spent on COVID in our own country."}, {"time": 5167, "text": "It's astounding the distortion of our priorities."}, {"time": 5171, "text": "There's also chemical."}, {"time": 5172, "text": "Don't forget chemical is probably the easier way to go."}, {"time": 5175, "text": "But in Syria, there was far too many incidents of America in its quest to demonize Assad and the Russians of all these chemical attacks that were happening that they were vowing came from Russia."}, {"time": 5191, "text": "And in spite of the fact that Russia just pulled out of the, signed the agreement on chemical arms and apparently destroyed its stock several years ago, it's strange that the strangest incidents happened in Syria."}, {"time": 5207, "text": "You go back to them, trace every one, good journalism was done."}, {"time": 5211, "text": "The White Helmets got a lot of fame, but they were corrupted."}, {"time": 5215, "text": "And many good journalists tried to point out the inconsistencies in the American accusations."}, {"time": 5224, "text": "Robert Parry among them, who was one of my mentors at Consortium Press."}, {"time": 5228, "text": "A lot of good, you'd have to go back, but trace each, like you would trace each time they made an accusation against Putin of murder."}, {"time": 5236, "text": "You need that same kind of Sherlock Holmes intensity, investigation, and they don't do it because the United Nations or the chemical, not the United Nations as much as the chemical people, the organization has been tampered with."}, {"time": 5250, "text": "If you remember correctly, there was accusations that the chemical investigative unit, I don't know the name of it, was tampered with."}, {"time": 5259, "text": "And people quit, people who were working on that commission quit and said that this is not legit."}, {"time": 5265, "text": "So very interesting, that Syria story is wacko."}, {"time": 5268, "text": "So the United States is willing to use chemical in Syria freely."}, {"time": 5272, "text": "It did it three, four times."}, {"time": 5273, "text": "If you remember correctly, Trump was challenged that he did not attack after a chemical incident in Syria."}, {"time": 5279, "text": "All these newscasters in the United States, the most heaviest of them were saying, well, President Trump is now finally acting like a real president when he attacks, when he drops missiles in Syria."}, {"time": 5292, "text": "They actually said that."}, {"time": 5294, "text": "In other words, they wanted Trump to go to war on Syria, but he didn't."}, {"time": 5297, "text": "Chemical weapons and nuclear is really terrifying."}, {"time": 5303, "text": "Do you think, now combine this with the fascinating choice in your interviews with Vladimir Putin to watch Stanley Kubrick's Dr. Strangelove or How I Learned to Stop Worrying and Love the Bomb."}, {"time": 5318, "text": "And given the fact that you did that, now looking at the fact that the word nuclear, and it feels like the world hangs on the brink of nuclear war, do you think that that's overstating the case?"}, {"time": 5335, "text": "No, that's what worried me from the beginning, and that's probably why I got involved in all this stuff, because I go back to the 60s when we were so close to nuclear war."}, {"time": 5347, "text": "I lived through that period, and I thought, as many people did, that this was, it was gonna come now."}, {"time": 5354, "text": "So I've lived through that, and I didn't sense the period in 83 when Reagan took us to the edge, if you remember correctly."}, {"time": 5362, "text": "Able Archer was an exercise that almost brought us to, because the Russians were really paranoid at that point, and they were responding to our military exercise on Able Archer."}, {"time": 5373, "text": "There was also the Korean airliner, they went down."}, {"time": 5375, "text": "There were numerous incidents in the 80s, but I never felt the fear."}, {"time": 5380, "text": "I thought Reagan was testing the limits, but perhaps if I'd been younger, I would've felt it."}, {"time": 5386, "text": "But anyway, no, we come close."}, {"time": 5388, "text": "The United States has risked this several times."}, {"time": 5391, "text": "If I told you, it would be hard for you to believe, if I could set a scene for you in a drama in 1962 when Kennedy has a meeting with the Joint Chiefs of Staff and the CIA, and they talk about a plan, a military plan, to first strike the Soviet Union and China."}, {"time": 5411, "text": "It was an Eisenhower plan that had been put into potential operation in early 60s or 50s, late 50s, SIOP 62."}, {"time": 5427, "text": "This was an attack on the Soviet Union, first strike."}, {"time": 5429, "text": "That's why the United States has never given up the concept of first strike."}, {"time": 5434, "text": "It's interesting that the Russian nuclear policy posture is more defensive than the American one, which leaves options open."}, {"time": 5444, "text": "The same options are open in neoconservative agreements that we see from the late 90s, where they say, the emergence of a rival power will not be tolerated."}, {"time": 5456, "text": "That's a very broad statement, and it allows you to do a lot, including nuclear."}, {"time": 5461, "text": "So you have to understand the United States is always, first of all, it breaks so many treaties."}, {"time": 5467, "text": "We know that from the Putin story about the Anti Ballistic Missile Treaty in 2002, and then the INF Treaty of, they broke that one."}, {"time": 5477, "text": "That was the intermediate missiles."}, {"time": 5479, "text": "That was 2019."}, {"time": 5481, "text": "I don't know when they broke it off, but the United States has not been very faithful on its nuclear agreements, and so I don't know that we can even deal with the United States diplomatically."}, {"time": 5492, "text": "It seems to be impossible."}, {"time": 5494, "text": "Now, it brings me to Biden."}, {"time": 5496, "text": "And this is the opposite of Kennedy."}, {"time": 5500, "text": "Kennedy was a Catholic Irish anti imperialist."}, {"time": 5503, "text": "Biden seems to be the opposite."}, {"time": 5505, "text": "He seems to be a get along, go along guy who's been not only old, but he's also gone along with this program, which I voted for Biden because I feared Trump, but I thought Biden at a certain age would mellow."}, {"time": 5519, "text": "I really did."}, {"time": 5520, "text": "He's not mellowed, apparently."}, {"time": 5521, "text": "He's still listening to these people, and he believes them."}, {"time": 5525, "text": "And it seems that his, that horrible woman, Victoria Nuland, who was Under Secretary of State, he appointed her to this sector of the world."}, {"time": 5534, "text": "She's very influential, and she's been one of the worst people on Ukraine."}, {"time": 5539, "text": "Obviously, she's behind the coup."}, {"time": 5541, "text": "She was the one who boasted that, you know, we got our man in, Yats, whatever it is, Yatsenuk."}, {"time": 5548, "text": "And also, remember the famous statement, fuck the EU?"}, {"time": 5552, "text": "All these things, but she's back, and she said the other day about if the Soviets, if the Russians use nuclear weaponry of any kind, there's gonna be a horrible price to pay."}, {"time": 5564, "text": "She was out of the blue."}, {"time": 5564, "text": "I said, what the hell is she doing?"}, {"time": 5566, "text": "She's talking nuclear all of a sudden."}, {"time": 5568, "text": "And then since that day, everybody in the US press, all the shows have gone, talk nuclear, nuclear, nuclear."}, {"time": 5575, "text": "Secretary of State has done it, Blinken, it scares you."}, {"time": 5585, "text": "If you think about it, the United States scares me."}, {"time": 5588, "text": "So that's the military industrial complex machine, fully functional, fully operational behind this whole thing."}, {"time": 5594, "text": "Is that what's to blame?"}, {"time": 5597, "text": "That's why I showed him Strangelove, because I wanted him to show him."}, {"time": 5600, "text": "I wanted Mr. Putin to say, look at this film."}, {"time": 5602, "text": "You never saw it."}, {"time": 5603, "text": "How can you not say, you know, it's a seminal film in American history to those people who care."}, {"time": 5608, "text": "And it shows you the Kubrick had a pacifist, thank God, antiwar mentality, which he showed in Bows of Glory as well as Strangelove."}, {"time": 5622, "text": "And it's such a dire, well done scenario that I wanted Mr. Putin to be aware of the way the United States thinks."}, {"time": 5631, "text": "Yeah, the absurdity of escalation, the absurdity of war at the largest scale, the absurdity of nuclear war, especially."}, {"time": 5639, "text": "Can we walk back from the brink of nuclear war?"}, {"time": 5645, "text": "Yes, yes we can."}, {"time": 5646, "text": "What's the path to walk back?"}, {"time": 5649, "text": "Between who and whom?"}, {"time": 5650, "text": "Reason and diplomacy."}, {"time": 5651, "text": "There's no reason."}, {"time": 5652, "text": "I mean, talk to the guy."}, {"time": 5655, "text": "Mr. Biden, why don't you calm down and go and talk to Mr. Putin in Moscow?"}, {"time": 5660, "text": "Why don't you just sit across the table from him and try to have a discussion without falling into ideologies and stuff like that?"}, {"time": 5671, "text": "You did some of the most difficult interviews ever."}, {"time": 5674, "text": "Do you have advice that you can give to someone like me or anyone hoping to understand something about a human being sitting across from them about what it takes to do a good interview?"}, {"time": 5687, "text": "You're doing one."}, {"time": 5688, "text": "Well, no, but there's a, listen, there's levels to this game."}, {"time": 5695, "text": "And interviewing somebody like Vladimir Putin, also language barrier, sit across from the man, try to keep an open mind, try to also ask challenging questions, but not challenging with an agenda, but seeking to understand and understand deeply."}, {"time": 5715, "text": "Seeking the truth."}, {"time": 5718, "text": "Seeking the truth, being a questioner like you are."}, {"time": 5720, "text": "You wanna know what is really going on."}, {"time": 5723, "text": "I could not get anywhere with Biden or Bush or for that matter, Obama."}, {"time": 5728, "text": "They'd be opaque with me."}, {"time": 5730, "text": "There's no interview possible with the president of the United States because he's got to stand for all the stuff that they stand for, which is imperialism, which is control of the world."}, {"time": 5739, "text": "How can you defend that?"}, {"time": 5741, "text": "No one's gonna come out and say that."}, {"time": 5742, "text": "They're always gonna blame the enemy."}, {"time": 5744, "text": "They're gonna blame Iran."}, {"time": 5745, "text": "They're gonna blame China."}, {"time": 5747, "text": "So with some people, it may not be possible to break through the opaqueness."}, {"time": 5751, "text": "You can't, you can't."}, {"time": 5752, "text": "I mean, have you ever seen an interview with the president besides being personable, where he actually discussed American policy?"}, {"time": 5760, "text": "Yeah, I mean, not really, but maybe after their president."}, {"time": 5763, "text": "I could see Obama being able to do such an interview."}, {"time": 5766, "text": "I could see George W. being able to do such an interview."}, {"time": 5770, "text": "Or are they not able to reflect at all on the?"}, {"time": 5773, "text": "George W. hasn't shown much conscience in terms of thinking about what he's done."}, {"time": 5777, "text": "You've seen that."}, {"time": 5778, "text": "You ever see my movie, W.?"}, {"time": 5780, "text": "I think that's one of my best movies because it shows a man who's just out of his depth and has no, he has a conscience at the end of the movie."}, {"time": 5788, "text": "If you remember correctly, he talks to his wife and he says, I don't get it."}, {"time": 5793, "text": "I'm trying to do good in the world."}, {"time": 5794, "text": "I've done, I believe in good and right."}, {"time": 5796, "text": "And why do people not understand that kind of complaint as if he can't get outside himself to understand the way other people think?"}, {"time": 5805, "text": "Empathies, walking like a dramatist is what I do."}, {"time": 5807, "text": "You walk in the footsteps of other people."}, {"time": 5810, "text": "When I did a movie about Richard Nixon, it wasn't because I liked him."}, {"time": 5814, "text": "It was because I wanted to, I think I understood a part of him because of my father and I think I wanted to walk in his footsteps."}, {"time": 5820, "text": "That's not to say I sympathize with him because I didn't."}, {"time": 5823, "text": "I don't think he helped the American cause at all, but it was empathize as opposed to sympathize."}, {"time": 5828, "text": "Same thing with Bush."}, {"time": 5830, "text": "People were shocked when I did the Bush movie."}, {"time": 5831, "text": "They said, how can you be in any way receptive to this guy?"}, {"time": 5838, "text": "That's wrong."}, {"time": 5839, "text": "Dramatists don't have political positions."}, {"time": 5842, "text": "They walk in the shoes of."}, {"time": 5843, "text": "That's why Bush movie perhaps was surprising and many people didn't care for it."}, {"time": 5849, "text": "Maybe that's what, but that's, you've got to go there."}, {"time": 5854, "text": "If you did a movie about a villain, you have to go there."}, {"time": 5858, "text": "You have to walk in their shoes."}, {"time": 5861, "text": "So see them, cause they usually, villains usually see themselves as the hero."}, {"time": 5867, "text": "So you have to consider what is it like to live in a world where this person is the hero?"}, {"time": 5875, "text": "Is that a burden?"}, {"time": 5876, "text": "Is that hard?"}, {"time": 5877, "text": "Not for George W. Bush."}, {"time": 5879, "text": "He's bitching because they didn't understand him, but he had a good vision he said of democracy and you know, democracy forgives a lot of sins."}, {"time": 5889, "text": "Can I ask you a hard question on that?"}, {"time": 5893, "text": "So because empathy is so important to a great interview, let's ask the most challenging version of empathy, which is when you're sitting across from a man on the brink of war that leads to tens of millions of deaths, which is Hitler."}, {"time": 5908, "text": "So if you could interview Hitler in 1939, as the drums of war start to beat or 1941 when they're already full on war, but there's still a lot of pacifists, there's still a lot of people unsure what are the motivations behind what Hitler's doing."}, {"time": 5928, "text": "How would you do that interview?"}, {"time": 5929, "text": "Well it depends when you do it."}, {"time": 5930, "text": "If you do it in 38, I certainly would have, no you have to, if you sit down across from Hitler, you empathize."}, {"time": 5937, "text": "What is your beef?"}, {"time": 5939, "text": "Where have you been?"}, {"time": 5940, "text": "What is your consciousness?"}, {"time": 5942, "text": "Why do you hate Jewish people?"}, {"time": 5945, "text": "Why, what is, all these questions that come up."}, {"time": 5950, "text": "His sense of grievance as a result of World War I."}, {"time": 5953, "text": "There's justifications there, et cetera."}, {"time": 5956, "text": "But if I, and by the way, Churchill was trying to make a deal with him in 38."}, {"time": 5961, "text": "That's a fact that people don't know."}, {"time": 5963, "text": "Churchill himself, there was still the desire in England to make peace with Germany."}, {"time": 5969, "text": "And it was seen as a possible, what Churchill really wanted was Hitler to go against Russia."}, {"time": 5976, "text": "And anything to destroy the Bolsheviks."}, {"time": 5980, "text": "So he was using Hitler as much as he could to go after Russia, but Hitler was too elusive to get, to pin him down."}, {"time": 5988, "text": "But if you remember, Hitler was very kind at the end of, kind is not the right word, was, did not go after the British Empire when he had France."}, {"time": 5998, "text": "And he could have."}, {"time": 6000, "text": "He had another objective, which was obviously the East."}, {"time": 6004, "text": "So Hitler's goal, I think, he always had an admiration for England."}, {"time": 6009, "text": "It's an interesting story, always."}, {"time": 6013, "text": "And the empire."}, {"time": 6015, "text": "Yes, and certainly Churchill, we have no doubts now from history revisionism that Churchill's interest, main interest, was not Germany."}, {"time": 6024, "text": "It was the British Empire."}, {"time": 6026, "text": "And to preserve it to India, the road to India and all that, and Middle East."}, {"time": 6031, "text": "Churchill fought the entire war with the concept of preserving the British Empire."}, {"time": 6036, "text": "All his goals, he sent America on a goose chase into Italy, you could argue, instead of establishing a sincere second front in Western Europe."}, {"time": 6047, "text": "Interesting man."}, {"time": 6049, "text": "So I would have tried to get, you know, I think I would have approached it the same way."}, {"time": 6052, "text": "In 1939, it would have been a different story because at that point, he'd attacked Poland, and in 1940, France."}, {"time": 6060, "text": "So it's another ball game."}, {"time": 6062, "text": "But certainly, at whatever point you talk to him, I would try to understand his point."}, {"time": 6067, "text": "I'm not judging you, Hitler."}, {"time": 6069, "text": "I'm saying to you, tell me what you're thinking."}, {"time": 6071, "text": "Why are you invading Russia?"}, {"time": 6072, "text": "What's your thought?"}, {"time": 6073, "text": "That's all an interviewer should do."}, {"time": 6075, "text": "He shouldn't be expressing his contempt for Hitler, which like an American journalist interviewing Putin, I'm getting brownie points for expressing my contempt for you."}, {"time": 6086, "text": "That doesn't wash with me."}, {"time": 6087, "text": "That's ugly."}, {"time": 6089, "text": "Seek to understand."}, {"time": 6092, "text": "This is a technical question, but was language a barrier as an interviewer?"}, {"time": 6096, "text": "To some degree."}, {"time": 6097, "text": "It's very hard to learn Russian."}, {"time": 6100, "text": "But I had very, they have excellent translators in the Kremlin, excellent."}, {"time": 6103, "text": "They are people who are trained very seriously for months or years before they, these people are young and they're very bright."}, {"time": 6113, "text": "I was very impressed with the Russian translators."}, {"time": 6116, "text": "I mean, I'm impressed as well, but there's a humor that's lost."}, {"time": 6121, "text": "There's a wit, a dry wit."}, {"time": 6123, "text": "There's stuff said between the lines."}, {"time": 6126, "text": "That's not actually how much content, but it's more kind of the things that make communication more frictionless."}, {"time": 6135, "text": "It's the, there's a kind of sadness to a Russian humor that permeates all things."}, {"time": 6142, "text": "And that sometimes is lost in translation."}, {"time": 6144, "text": "The translation is a little bit colder, meaning it just conveys the facts."}, {"time": 6149, "text": "Would you call it sardonic humor?"}, {"time": 6151, "text": "I would say so, yeah."}, {"time": 6153, "text": "And so it's interesting."}, {"time": 6154, "text": "But I think you could see that from facial expressions when you're sitting across from the person and you can feel it."}, {"time": 6159, "text": "I feel it, yeah."}, {"time": 6161, "text": "Let me ask you in general, what's the role of love in the human condition, in your life, in life in general?"}, {"time": 6170, "text": "You've talked, you looked at some of the darkest aspect of human nature."}, {"time": 6175, "text": "What's the role of this, one of the more beautiful aspects of human nature?"}, {"time": 6179, "text": "I think without love, I wouldn't, I don't think I'd be able to carry on."}, {"time": 6182, "text": "I think that love is my, love is the greatest, the ability to love is the greatest virtue you can have."}, {"time": 6191, "text": "It's the ability to share with another, with your family, with your children, with your wife, with your lover, your partner."}, {"time": 6199, "text": "It's an ability to extend yourself into the world and it brings empathy with it."}, {"time": 6203, "text": "If you love well, I think you expand it to the human race too."}, {"time": 6208, "text": "And it's the strength behind the great novelists, the great artists of our time."}, {"time": 6215, "text": "I think part of the reason I suppose we're scared of science sometimes is because the scientists sometimes don't express that clearly."}, {"time": 6225, "text": "You can lose that when you focus on the facts, on empirical data, on the science of things."}, {"time": 6234, "text": "You can lose the humanity that's between the lines."}, {"time": 6238, "text": "I'm often struck by when I talk to scientists and I've talked to a few, that how arrogant they can be about, they don't talk to you if you don't understand their world and they talk to each other and there's an arrogance, a closed circle kind of thing."}, {"time": 6250, "text": "Oh, he's not at my level, I can't, there's no discussion to be had with this person, he's a human being."}, {"time": 6256, "text": "That arrogance is terrifying to me because it's next door neighbor to closed mindedness which then can be used by charismatic leaders as it was in Nazi Germany to commit some of the worst atrocities."}, {"time": 6269, "text": "The scientists can be used as pawns in a very cruel game."}, {"time": 6277, "text": "What advice would you give to young people?"}, {"time": 6279, "text": "You've done, first of all, some of the greatest films ever."}, {"time": 6283, "text": "You've lived a heck of a life."}, {"time": 6287, "text": "You've, were fearless and bold in asking some really difficult questions of this world."}, {"time": 6293, "text": "What advice would you give to young people today, high school, college, about career?"}, {"time": 6300, "text": "How to have a career they can be proud of or how to have a life they can be proud of?"}, {"time": 6306, "text": "Well, I have three children so obviously I'm not necessarily the best advisor in the world and I do find that the children, I've raised them with a sense of freedom and they do what they want."}, {"time": 6319, "text": "In the end, it's their life, their destiny, their character."}, {"time": 6322, "text": "That's what comes out."}, {"time": 6324, "text": "You can try to influence it but you can try to get your daughter to wake up at a certain hour in the day but it never works."}, {"time": 6334, "text": "So I long ago gave up on that and my children are all grown now but aside from that, I think if I was a teacher in a school and teaching film, I'd say to the students, get an education."}, {"time": 6349, "text": "You can't just look at film because it's not a full education, it's not the spectrum."}, {"time": 6355, "text": "I don't think you should teach film as a, I think you need a base in other worlds."}, {"time": 6362, "text": "One of the greatest courses I took at NYU was, and I was a war veteran on the GI Bill so I was older than the other students."}, {"time": 6370, "text": "One of the great, I took a class outside the film school in Greek classics because I hadn't had much history and I wanted to know more about the world of Homer and so forth and the teacher opened my eyes to so much in that class and I wrote about it in my memoir, it's called Chasing the Light about Professor Leahy and what he did to me."}, {"time": 6393, "text": "He gave me the concepts clearly of consciousness which is the Homeric theme of Odysseus and also lethe, L E T H E, which is sleep and how most of the crew, Odysseus's crew, were experiencing lethe and how necessary it was to stay awake."}, {"time": 6418, "text": "So it's not just film, it's just you have to learn the world as much as you can when you're young and so that I think is the basis of a good education and a classic one is important, a basis."}, {"time": 6435, "text": "I think then you go on and you can learn computer if you want but that's specialization."}, {"time": 6441, "text": "If you're a computer geek, is that a life?"}, {"time": 6444, "text": "Does that give you enough satisfaction?"}, {"time": 6446, "text": "Do you get the joy out of people?"}, {"time": 6449, "text": "No, just like filmmaking is a skill."}, {"time": 6452, "text": "You have the broad background to understand the world, literature, history."}, {"time": 6463, "text": "So one of the things about being human is life is finite."}, {"time": 6468, "text": "It ends."}, {"time": 6474, "text": "Absolutely, you have to come to terms with death and that's a tough one for many people."}, {"time": 6478, "text": "It's always there."}, {"time": 6479, "text": "I'm older than you, obviously, and I'm getting closer to it."}, {"time": 6482, "text": "Couldn't happen any day, actually."}, {"time": 6484, "text": "When you get to a certain age, you can't assume that you're gonna be alive tomorrow."}, {"time": 6488, "text": "So I try to deal with that."}, {"time": 6492, "text": "Much less so than I was when I was younger."}, {"time": 6495, "text": "Remember, I was in Vietnam but I thought I dealt with it there but when I came back, I realized that I wanted to live."}, {"time": 6501, "text": "So yes, I've learned over time to get more and more used to it and get ready for it."}, {"time": 6507, "text": "What's a good answer to the question of why live?"}, {"time": 6511, "text": "So the realization that you wanted to live."}, {"time": 6514, "text": "What was the reason to live?"}, {"time": 6516, "text": "Because it was better than being one of those corpses that I saw in the jungle."}, {"time": 6520, "text": "I saw how finite death is."}, {"time": 6525, "text": "Are there things in your life you regret?"}, {"time": 6535, "text": "Is there something you wish you could have done differently?"}, {"time": 6538, "text": "Like if you could go back to do one thing differently or that it regrets all of it."}, {"time": 6541, "text": "Did you ask Musk this?"}, {"time": 6544, "text": "Offline all the time."}]}]