[{"title": "Lisa Feldman Barrett: Love, Evolution, and the Human Brain | Lex Fridman Podcast #140", "id": "S_AFc_BXht4", "quotes": [{"time": 317, "text": "So then I thought, okay, well, maybe I'll try the Personals ads, which I had never used before in my life."}, {"time": 323, "text": "And I first tried the paper Personals ads."}, {"time": 329, "text": "Like in the newspaper?"}, {"time": 330, "text": "Like in the newspaper, that didn't work."}, {"time": 333, "text": "And then a friend of mine said, oh, you know, there's this thing called Net News."}, {"time": 336, "text": "So we're going, this is like 1992 maybe."}, {"time": 340, "text": "So there was this anonymous, you could do it anonymously."}, {"time": 343, "text": "So you would read, you could post or you could read ads and then respond to an address which was anonymous and that was yoked to somebody's real address."}, {"time": 357, "text": "And there was always a lag because it was this like a bulletin board sort of thing."}, {"time": 364, "text": "So at first I read them over and I decided to respond to one or two."}, {"time": 372, "text": "And, you know, it was interesting."}, {"time": 375, "text": "Sorry, this is not on the internet."}, {"time": 376, "text": "Yeah, this is totally on the internet."}, {"time": 378, "text": "But it takes, there's a delay of a couple of days or whatever."}, {"time": 381, "text": "It's 1992, there's no web, web pictures."}, {"time": 385, "text": "There's no pictures, the web doesn't exist."}, {"time": 387, "text": "It's all done in ASCII format sort of."}, {"time": 390, "text": "And, you know, but the ratio, but the ratio of men to women was like 10 to one."}, {"time": 398, "text": "I mean, there were many more men because it was basically academics and the government."}, {"time": 402, "text": "That was it."}, {"time": 404, "text": "I mean, I think AOL maybe was just starting to become popular, but."}, {"time": 411, "text": "And so the first person I met told me that he was a scientist who worked for NASA and, yeah."}, {"time": 423, "text": "Anyways, it turned out that he didn't actually."}, {"time": 427, "text": "Yeah, this is how they brag is like you elevate your, as opposed to saying you're taller than you are, you say like your position is higher."}, {"time": 434, "text": "Yeah, and I actually, I would have been fine dating somebody who wasn't a scientist."}, {"time": 438, "text": "It's just that they have, it's just that whoever I date has to just accept that I am and that I was pretty ambitious and was trying to make my career."}, {"time": 450, "text": "And, you know, that's not, I think it's maybe more common now for men to maybe accept that in their female partners, but at that time, not so common."}, {"time": 460, "text": "It could be intimidating, I guess."}, {"time": 461, "text": "Yes, that has been said."}, {"time": 464, "text": "And so then the next one I actually corresponded with, and we actually got to the point of talking on the phone, and we had this really kind of funny conversation where, you know, we're chatting and he said, he introduces the idea that, you know, he's really looking for a dominant woman."}, {"time": 482, "text": "And I'm thinking, I'm a psychologist by training, so I'm thinking, oh, he means sex roles."}, {"time": 487, "text": "Like, I'm like, no, I'm very assertive and I'm glad you think that, you know, okay."}, {"time": 490, "text": "Anyways, long story short, that's not really what he meant."}, {"time": 497, "text": "Yeah, so, and I just, you know, that will just show you my level of naivete."}, {"time": 502, "text": "Like, I was like, I didn't completely understand, but I was like, well, yeah, you know, no."}, {"time": 507, "text": "At one point he asked me how I felt about him wearing my lingerie, and I was like, I don't even share my lingerie with my sister."}, {"time": 515, "text": "Like, I don't share my lingerie with anybody, you know?"}, {"time": 520, "text": "The third one I interacted with was a banker who lived in Singapore, and that conversation didn't last very long because he made an analogy, I guess he made an analogy between me and a character in The Fountainhead, the woman who's raped in The Fountainhead, and I was like, okay, that's not."}, {"time": 548, "text": "That's not a good."}, {"time": 549, "text": "That's not a good, no, that's not a good one."}, {"time": 551, "text": "Not that part, not that scene."}, {"time": 552, "text": "Not that scene."}, {"time": 553, "text": "So then I was like, okay, you know what?"}, {"time": 556, "text": "I'm gonna post my own ad, and so I did."}, {"time": 558, "text": "I posted, well, first I wrote my ad, and then I, of course, I checked it with my friends who were all also assistant professors."}, {"time": 564, "text": "They were like my little Greek chorus, and then I posted it, and I got something like, I don't know, 80 something responses in 24 hours."}, {"time": 574, "text": "I mean, it was very."}, {"time": 575, "text": "Do you remember the pitch?"}, {"time": 577, "text": "Like how you, I guess, condensed yourself?"}, {"time": 580, "text": "I don't remember it exactly, although Dan has it, but actually for our 20th wedding anniversary, he took our exchanges, and he printed them off and put them in a leather bound book for us to read, which was really sweet."}, {"time": 597, "text": "Yeah, I think I was just really direct."}, {"time": 598, "text": "Like I'm almost 30."}, {"time": 601, "text": "I'm not looking, I'm looking for something serious."}, {"time": 604, "text": "But the thing is, I forgot to say where my location was and my age, which I forgot."}, {"time": 612, "text": "So I got lots of, I mean, I will say, so I printed off all of the responses, and I had all my friends over, and we had a big, I made a big pot of gumbo, and we drank through several bottles of wine reading these responses."}, {"time": 628, "text": "And I would say for the most part, they were really sweet, like earnest and genuine as much as you could tell that somebody is being genuine."}, {"time": 637, "text": "I mean, it seemed, there were a couple of really funky ones, like this one couple who told me that I was their soulmate, the two of them, when they were looking for a third person, and I was like, oh, okay."}, {"time": 648, "text": "But mostly super, seemed like super genuine people."}, {"time": 653, "text": "And so I chose five men to start corresponding with, and I was corresponding with them."}, {"time": 658, "text": "And then about a week later, I get this other email."}, {"time": 663, "text": "And okay, and then I post something the next day that said, okay, thank you so much, and I'm gonna, I answered every person back."}, {"time": 670, "text": "But then after that, I said, okay, and I'm not gonna answer anymore, because they were still coming in, and I couldn't, I have a job, and a house to take care of and stuff."}, {"time": 678, "text": "So, and then about a week later, I get this other email."}, {"time": 682, "text": "And he says, he just describes himself, like I'm this, I'm this, I'm this, I'm a chef, I'm a scientist, I'm a this, I'm a this."}, {"time": 692, "text": "And so I emailed him back, and I said, you know, you seem interesting, you can write me at my actual address if you want, here's my address."}, {"time": 700, "text": "I'm not really responding, I'm not really responding to other people anymore, but you seem interesting, you know, you can write to me if you want."}, {"time": 706, "text": "And then he wrote to me, and I wrote him back, and it was a nondescript kind of email, and I wrote him back, and I said, thanks for responding."}, {"time": 716, "text": "You know, I'm really busy right now."}, {"time": 718, "text": "I was in the middle of writing my first slate of grant applications, so I was really consumed, and I said, I'll get back to you in a couple of days."}, {"time": 726, "text": "And so I did, I waited a couple days till my grants were, you know, safe, grant applications safely out the door."}, {"time": 733, "text": "And then I emailed him back, and then he emailed me, and then really across two days, we sent 100 emails."}, {"time": 742, "text": "And text only, was there pictures or any of that stuff?"}, {"time": 745, "text": "Text only, text only."}, {"time": 747, "text": "And then, so this was like a Thursday and a Friday, and then Friday, he said, let's talk on the weekend on the phone."}, {"time": 755, "text": "And I said, okay."}, {"time": 757, "text": "And he wanted to talk Sunday night, and I had a date Sunday night."}, {"time": 762, "text": "So I said, okay, sure, we can talk Sunday night."}, {"time": 768, "text": "And then I was like, well, you know, I don't really wanna cancel my date, so I'm just gonna call him on Saturday."}, {"time": 772, "text": "So I just called, I cold called him on Saturday, and a woman answered."}, {"time": 779, "text": "That's not cool."}, {"time": 779, "text": "Not cool."}, {"time": 781, "text": "And so she says, you know, hello."}, {"time": 784, "text": "And I say, oh, you know, stand there."}, {"time": 786, "text": "And she said, sure, can I ask who's calling?"}, {"time": 789, "text": "And I said, tell him it's Lisa."}, {"time": 791, "text": "And she went, oh my God, oh my God, I'm just a friend."}, {"time": 794, "text": "I'm just a friend."}, {"time": 795, "text": "I just need to tell you, I'm just a friend."}, {"time": 797, "text": "And I was like, this is adorable, right?"}, {"time": 801, "text": "She doesn't, and then he gets on the phone, not hi, nice to meet you."}, {"time": 804, "text": "The first thing he says to me, she's just a friend."}, {"time": 807, "text": "So I was just so charmed really by the whole thing."}, {"time": 812, "text": "So it was Yom Kippur."}, {"time": 814, "text": "It was the Jewish day of atonement that was ending and they were baking cookies and going to a break fast."}, {"time": 820, "text": "So people, you know, as you know, fast all day, and then they go to a party and they break fast."}, {"time": 824, "text": "So I thought, okay, I'll just cancel my date."}, {"time": 829, "text": "So I did, and I stayed home and we talked for eight hours."}, {"time": 836, "text": "And then the next night for six hours."}, {"time": 838, "text": "And basically it just went on like that."}, {"time": 840, "text": "And then by the end of the week, he flew to stay college."}, {"time": 846, "text": "And, you know, we'd gone through this whole thing where I'd said, we're gonna take it slow."}, {"time": 850, "text": "We're gonna get to know each other, you know."}, {"time": 852, "text": "And then really by, I think we talked like two or three times these like really long conversations."}, {"time": 858, "text": "And then he said, I'm just gonna fly there."}, {"time": 860, "text": "And then, so of course there's, I don't even know that there were fax machines at that point."}, {"time": 867, "text": "Maybe there were, but I don't think so."}, {"time": 871, "text": "Anyway, so he, we decided we'll exchange pictures."}, {"time": 874, "text": "And so he, you know, I take my photograph and I give it to my secretary."}, {"time": 879, "text": "And I say to my secretary."}, {"time": 881, "text": "Fax this."}, {"time": 882, "text": "I say that, send this priority mail."}, {"time": 885, "text": "Priority mail, yeah."}, {"time": 885, "text": "And he goes, okay, I'll send a priority mail."}, {"time": 887, "text": "And I'm like, it's a priority mail."}, {"time": 888, "text": "He's like, I know, priority mail, okay."}, {"time": 890, "text": "And then, so I get Dan's photograph in the mail."}, {"time": 895, "text": "And, you know, it's him in shorts."}, {"time": 899, "text": "And you can see that he's probably somewhere like the Bahamas or something like that."}, {"time": 903, "text": "And it's like cropped."}, {"time": 905, "text": "So clearly what he's done is he's taken a photograph where, you know, he's in it with someone else who turned out to be his ex wife."}, {"time": 911, "text": "So I'm thinking, well, this is awesome."}, {"time": 914, "text": "You know, I've hit the jackpot."}, {"time": 915, "text": "He's, you know, very appealing to me, very attractive."}, {"time": 918, "text": "And then, you know, my photograph doesn't show up and it doesn't show up."}, {"time": 924, "text": "And, you know, so like one day and then two days and then, you know, he's like, you know, I said, well, I asked my secretary to send a priority."}, {"time": 934, "text": "I mean, I don't know, you know, what he did."}, {"time": 937, "text": "And he's like, I said, I'm like, well, you don't have to, you know, you don't have to come."}, {"time": 941, "text": "And he's like, no, no, no, I'm gonna, you know, we've had like five dates, the equivalent of five dates practically."}, {"time": 948, "text": "And then, so he's supposed to fly on a Thursday or Friday, I can't remember."}, {"time": 953, "text": "And I get a call like maybe an hour before his flight's supposed to leave."}, {"time": 958, "text": "And he says, hi."}, {"time": 959, "text": "And I say, and it's just something in his voice, right?"}, {"time": 960, "text": "And I say, cause at this point I think I've talked to him like for 25 hours, I don't know."}, {"time": 967, "text": "And I'm like, you got the picture."}, {"time": 969, "text": "And he's like, yeah."}, {"time": 970, "text": "And I'm like, you don't like it."}, {"time": 972, "text": "And he's like, well, I'm sure it's not, I'm sure it's your, I'm sure it's just not a good, you know, it's not, it's probably not your best."}, {"time": 985, "text": "You know, you don't, you don't have to come."}, {"time": 988, "text": "And he's like, no, no, no, I'm coming."}, {"time": 989, "text": "And I'm like, no, you don't have to come."}, {"time": 990, "text": "And he's like, no, no, I really wanna, I'm, you know, I'm getting on the plane."}, {"time": 993, "text": "I'm like, you don't have to get on the plane."}, {"time": 996, "text": "He's like, no, I'm getting on the plane."}, {"time": 998, "text": "And so I go down to my, I go, I'm in my office, this is happening, right?"}, {"time": 1002, "text": "So I go downstairs to one of my closest friends who is still actually one of my closest friends, who is one of my colleagues and Kevin."}, {"time": 1011, "text": "And I say, Kevin, and I go to Kevin, I go, Kevin, Kevin, Kevin, he doesn't like the photograph."}, {"time": 1015, "text": "And Kevin's like, well, which photograph should you send?"}, {"time": 1017, "text": "And I'm like, well, you know the one where we're shooting pool?"}, {"time": 1019, "text": "And he's like, you sent that photograph?"}, {"time": 1023, "text": "That's a horrible photograph."}, {"time": 1025, "text": "I'm like, yeah, but it's the only one that I had that was like, where my hair was kind of similar to what it is now, and he's like, Lisa, like, do I have to check everything for you?"}, {"time": 1035, "text": "You should not have sent that, you know?"}, {"time": 1038, "text": "But still, he flew over."}, {"time": 1040, "text": "So he flew."}, {"time": 1040, "text": "Where from, by the way?"}, {"time": 1042, "text": "He was in graduate school at Amherst, yeah, at UMass Amherst."}, {"time": 1047, "text": "So he flew and I picked him up at the airport and he was happy, so whatever the concern was, was gone."}, {"time": 1058, "text": "And I was dressed, you know, I carefully, carefully dressed."}, {"time": 1063, "text": "Were you nervous?"}, {"time": 1064, "text": "I was really, really nervous."}, {"time": 1066, "text": "Because I don't really believe in fate and I don't really think there's only one person that you can be with."}, {"time": 1074, "text": "But I think some people are curvy, you know, people who, some people are curvy, they're kind of complicated, and so the number of people who fit them is maybe less than."}, {"time": 1088, "text": "I like it, mathematically speaking, yeah."}, {"time": 1090, "text": "And so when I was going to pick him up at the airport, I was thinking, well, this could, I could be going to pick up the person I'm gonna marry."}, {"time": 1101, "text": "I mean, like, I really, but I really, you know, like, our conversations were just very authentic and very moving and we really connected."}, {"time": 1113, "text": "And I really felt like he understood me, actually, in a way that a lot of people don't."}, {"time": 1121, "text": "And what was really nice was, at the time, you know, the airport was this tiny little airport out in a cornfield, basically."}, {"time": 1134, "text": "And so driving back to the town, we were in the car for 15 minutes, completely in the dark, as I was driving."}, {"time": 1142, "text": "And so it was very similar to, we had just spent, you know, 20 something hours on the telephone, sitting in the dark, talking to each other."}, {"time": 1151, "text": "So it was very familiar."}, {"time": 1154, "text": "And we basically spent the whole weekend together and he met all my friends and we had a big party."}, {"time": 1159, "text": "And at the end of the weekend, I said, okay, you know, if we're gonna give this a shot, we probably shouldn't see other people."}, {"time": 1173, "text": "So it's a risk, you know?"}, {"time": 1175, "text": "Commitment."}, {"time": 1176, "text": "But I just didn't see how it would work if we were dating people locally and then also seeing each other at a distance."}, {"time": 1184, "text": "Because, you know, I've had long distance relationships before and they're hard and they take a lot of effort."}, {"time": 1190, "text": "And so we decided we'd give it three months and see what happened and that was it."}, {"time": 1194, "text": "This is an interesting thing."}, {"time": 1197, "text": "Like we're all, what is it?"}, {"time": 1198, "text": "There's several billion of us and we're kind of roaming this world and then you kind of stick together."}, {"time": 1204, "text": "You find somebody that just like gets you."}, {"time": 1207, "text": "And it's interesting to think about, there's probably thousands if not millions of people that would be sticky to you, depending on the curvature of your space."}, {"time": 1217, "text": "But what is the, could you speak to the stickiness?"}, {"time": 1223, "text": "Like to the, just the falling in love?"}, {"time": 1225, "text": "Like seeing that somebody really gets you?"}, {"time": 1229, "text": "Maybe by way of telling, do you think, do you remember there was a moment when you just realized, damn it, I think I'm, like I think this is the guy."}, {"time": 1242, "text": "I think I'm in love."}, {"time": 1244, "text": "We were having these conversations actually from the, really from the second weekend we were together."}, {"time": 1249, "text": "So he flew back the next weekend to State College because it was my birthday."}, {"time": 1252, "text": "It was my 30th birthday."}, {"time": 1253, "text": "My friends were throwing me a party."}, {"time": 1255, "text": "And we went hiking and we hiked up some mountain and we were sitting on a cliff over this overlook and talking to each other."}, {"time": 1262, "text": "And I was thinking, and I actually said to him, like I haven't really known you very long, but I feel like I'm falling in love with you, which can't possibly be happening."}, {"time": 1270, "text": "I must be projecting, but it certainly feels that way."}, {"time": 1274, "text": "Like I don't believe in love at first sight."}, {"time": 1276, "text": "So this can't really be happening, but it sort of feels like it is."}, {"time": 1280, "text": "And he was like, I know what you mean."}, {"time": 1281, "text": "And so for the first three months or four months, we would say things to each other."}, {"time": 1285, "text": "Like, I feel like I'm in love with you, but you know, but that can't, but things don't really work like that."}, {"time": 1294, "text": "So, but you know, so, and then it became a joke."}, {"time": 1297, "text": "Like I feel like I'm in love with you."}, {"time": 1298, "text": "And then eventually, you know, I think, but I think that was one moment where we were talking about just, you know, not just all the great aspirations you have or all the things, but also things you don't like about yourself, things that you're worried about, things that you're scared of."}, {"time": 1319, "text": "And then I think that was sort of solidified the relationship."}, {"time": 1324, "text": "And then there was one weekend where we went to Maine in the winter, which I mean, I really love the beach always, but in the winter, particularly."}, {"time": 1335, "text": "Because it's just beautiful and calm and whatever."}, {"time": 1339, "text": "And I also, I do find beauty in starkness sometimes."}, {"time": 1344, "text": "Like, so there's this grand majestic scene of, you know, this very powerful ocean and it's all these like beautiful blue grays and it's just stunning."}, {"time": 1355, "text": "And so we were sitting on this huge rock in Maine and where we'd gone for the weekend, it was freezing cold."}, {"time": 1362, "text": "And I honestly can't remember what he said or what I said or what, but I definitely remember having this feeling of, I absolutely wanna stay with this person."}, {"time": 1377, "text": "And I don't know what my life will be like if I'm not with this person."}, {"time": 1380, "text": "Like I need to be with this person."}, {"time": 1382, "text": "Can we, from a scientific and a human perspective, dig into your belief that first love at first sight is not possible?"}, {"time": 1391, "text": "You don't believe in it?"}, {"time": 1393, "text": "Cause there is, you don't think there's like a magic where you see somebody in the Jack Kerouac way and you're like, wow, that's something."}, {"time": 1402, "text": "That's a special little glimmer or something."}, {"time": 1406, "text": "Oh, I definitely think you can connect with someone instant, in an instance."}, {"time": 1412, "text": "And I definitely think you can say, oh, there's something there and I'm really clicking with that person."}, {"time": 1417, "text": "Romantically, but also just as friends, it's possible to do that."}, {"time": 1420, "text": "You recognize a mind that's like yours or that's compatible with yours."}, {"time": 1427, "text": "There are ways that you feel like you're being understood or that you understand something about this person or maybe you see something in this person that you find really compelling or intriguing."}, {"time": 1438, "text": "But I think your brain is predictive organ, right?"}, {"time": 1443, "text": "You're using your past."}, {"time": 1445, "text": "You're projecting."}, {"time": 1446, "text": "You're using your past to make predictions and I mean, not deliberately."}, {"time": 1452, "text": "That's how your brain is wired."}, {"time": 1454, "text": "That's what it does."}, {"time": 1455, "text": "And so it's filling in all of the gaps that you, there are lots of gaps of information that you don't, information you don't have."}, {"time": 1466, "text": "And so your brain is filling those in and."}, {"time": 1471, "text": "But isn't that what love is?"}, {"time": 1472, "text": "No, I don't think so, actually."}, {"time": 1475, "text": "I mean, to some extent, sure, you always, there's research to show that people who are in love always see the best in each other and when there's a negative interpretation or a positive interpretation, they choose the positive ones."}, {"time": 1490, "text": "There's a little bit of positive illusion there going on."}, {"time": 1494, "text": "That's what the research shows."}, {"time": 1495, "text": "But I think that when you find somebody when you find somebody who not just appreciates your faults but loves you for them actually, like maybe even doesn't see them as a fault, that's, so you have to be honest enough about what your faults are."}, {"time": 1524, "text": "So it's easy to love someone for all the things that they, for all the wonderful characteristics they have."}, {"time": 1534, "text": "It's harder, I think, to love someone despite their faults or maybe even the faults that they see aren't really faults at all to you."}, {"time": 1541, "text": "They're actually something really special."}, {"time": 1543, "text": "But isn't that, can't you explain that by saying the brain kind of, like you're projecting, you have a conception of a human being or just a spirit that really connects with you and you're projecting that onto that person and within that framework, all their faults then become beautiful, like little."}, {"time": 1566, "text": "Maybe, but you just have to pay attention to the prediction error."}, {"time": 1571, "text": "No, but maybe that's what love, like maybe you started ignoring the prediction error."}, {"time": 1577, "text": "Maybe love is just your ability, like."}, {"time": 1581, "text": "To ignore the prediction error."}, {"time": 1582, "text": "Well, I think that there's some research that might say that, but that's not my experience, I guess."}, {"time": 1590, "text": "But there is some research that says, I mean, there's some research that says you have to have an optimal margin of illusion, which means that you put a positive spin on smaller things, but you don't ignore the bigger things, right?"}, {"time": 1605, "text": "And I think without being judgmental at all, when someone says to me, you're not who I thought you were, I mean, nobody has said that to me in a really long time, but certainly when I was younger, that was, you're not who I thought you were."}, {"time": 1618, "text": "My reaction to that was, well, whose fault is that?"}, {"time": 1621, "text": "You know, I'm a pretty upfront person."}, {"time": 1628, "text": "I mean, I will though say that in my experience, people don't lie to you about who they are."}, {"time": 1635, "text": "They lie to themselves in your presence."}, {"time": 1638, "text": "And so, you know, you don't wanna get tied up in that, tangled up in that."}, {"time": 1650, "text": "And I think from the get go, Dan and I were just for whatever reason, maybe it's because we both had been divorced already and, you know, he told me who we thought he was and he was pretty accurate as far as I could, pretty much actually."}, {"time": 1668, "text": "I mean, there's very, I can't say that I've ever come across a characteristic in him that really surprised me in a bad way."}, {"time": 1678, "text": "It's hard to know yourself."}, {"time": 1680, "text": "It is hard to know yourself."}, {"time": 1681, "text": "And to communicate that."}, {"time": 1683, "text": "I mean, I'll say, you know, I had the advantage of training as a therapist, which meant for five years I was under a fucking microscope."}, {"time": 1692, "text": "You know, when I was training as a therapist, it was hour for hour supervision, which meant if you were in a room with a client for an hour, you had an hour with a supervisor."}, {"time": 1703, "text": "So that supervisor was behind the mirror for your session."}, {"time": 1708, "text": "And then you went and had an hour of discussion about what you said, what you didn't say, learning to use your own feelings and thoughts as a tool to probe the mind of the client and so on."}, {"time": 1722, "text": "And so you can't help but learn a lot of, you can't help but learn a lot about yourself in that process."}, {"time": 1728, "text": "Do you think knowing or learning how the sausage is made ruins the magic of the actual experience?"}, {"time": 1738, "text": "Like you as a neuroscientist who studies the brain, do you think it ruins the magic of like love at first sight?"}, {"time": 1745, "text": "Or are you, do you consciously are still able to lose yourself in the moment?"}, {"time": 1751, "text": "I'm definitely able to lose myself in the moment."}, {"time": 1753, "text": "Is wine involved?"}, {"time": 1754, "text": "Not always, chocolate."}, {"time": 1757, "text": "I mean, some kind of mind altering substance, right?"}, {"time": 1760, "text": "But yeah, for sure."}, {"time": 1763, "text": "I mean, I guess what I would say though, is that for me, part of the magic is the process."}, {"time": 1771, "text": "Like, so I remember a day there was, while I was working on this book of essays, I was in New York."}, {"time": 1781, "text": "I can't remember why I was in New York, but I was in New York for something."}, {"time": 1784, "text": "And I was in Central Park and I was looking at all the people with their babies."}, {"time": 1790, "text": "And I was thinking, each one of these, there's a tiny little brain that's wiring itself right now."}, {"time": 1800, "text": "And I just, I felt in that moment, I was like, I am never gonna look at an infant in the same way ever again."}, {"time": 1808, "text": "And so to me, I mean, honestly, before I started learning about brain development, I thought babies were cute, but not that interesting until they could do interact with you and do things."}, {"time": 1821, "text": "Of course, my own infant, I thought, was extraordinarily interesting, but they're kind of like lumps."}, {"time": 1827, "text": "That's until they can interact with you, but they are anything but lumps."}, {"time": 1831, "text": "I mean, so, and part of the, I mean, all I can say is I have deep affection now for like tiny little babies in a way that I didn't really before because of the, I'm just so curious."}, {"time": 1851, "text": "But the actual process of the mechanisms of the wiring of the brain, the learning, all the magic of the neurobiology."}, {"time": 1858, "text": "Yeah, and or something like, when you make eye contact with someone directly, sometimes you feel something, right?"}, {"time": 1870, "text": "Yeah, that's weird."}, {"time": 1874, "text": "And what is that?"}, {"time": 1875, "text": "And so to me, that's not backing away from the moment."}, {"time": 1880, "text": "That's like expanding the moment."}, {"time": 1882, "text": "It's like, that's incredibly cool."}, {"time": 1884, "text": "You know, when I was, I'll just say that when I was in graduate school, I also was in therapy because it's almost a given that you're gonna be in therapy yourself if you're gonna become a therapist."}, {"time": 1898, "text": "And I had a deal with my therapist, which was that I could call timeout at any moment that I wanted to, as long as I was being responsible about it."}, {"time": 1908, "text": "And I wasn't using it as a way to get out of something."}, {"time": 1910, "text": "And he could tell me, no, he could decline and say, no, you're using this to get out of something."}, {"time": 1916, "text": "But I could call timeout whenever I want and say, what are you doing right now?"}, {"time": 1920, "text": "Like, what are you, here's what I'm experiencing."}, {"time": 1922, "text": "What are you trying to do?"}, {"time": 1923, "text": "Like I wanted to use my own experience to interrogate what the process was."}, {"time": 1930, "text": "And that made it more helpful in a way."}, {"time": 1938, "text": "Do you know what I mean?"}, {"time": 1938, "text": "So yeah, I don't think learning how something works makes it less magical actually, but that's just me, I guess."}, {"time": 1945, "text": "I don't know, would you?"}, {"time": 1949, "text": "I tend to have two modes."}, {"time": 1952, "text": "One is an engineer and one is a romantic."}, {"time": 1955, "text": "And I'm conscious of like, there's two rooms."}, {"time": 1961, "text": "You can go into the one, the engineer room."}, {"time": 1963, "text": "And I think that ruins the romance."}, {"time": 1965, "text": "So I tend to, there's two rooms."}, {"time": 1968, "text": "One is the engineering room."}, {"time": 1970, "text": "Think from first principles, how do we build the thing that creates this kind of behavior?"}, {"time": 1975, "text": "And then you go into the romantic room where you're like emotional, it's a roller coaster."}, {"time": 1980, "text": "And then the thing is, let's take it slow."}, {"time": 1983, "text": "And then you get married the next night that you just this giant mess and you write a song and then you cry and then you send a bunch of texts and anger and whatever."}, {"time": 1994, "text": "And somehow you're in Vegas and there's random people and you're drunk and whatever, all that, like in poetry and just mess of it, fighting."}, {"time": 2001, "text": "Yeah, that's not, those are two rooms and you go back between them."}, {"time": 2007, "text": "But I think the way you put it is quite poetic."}, {"time": 2009, "text": "I think you're much better at adulting with love than perhaps I am."}, {"time": 2017, "text": "Because there's a magic to children."}, {"time": 2020, "text": "I also think like of adults as children."}, {"time": 2025, "text": "It's kind of cool to see, it's a cool thought experiment to look at adults and think like that used to be a baby."}, {"time": 2033, "text": "And then that's like a fully wired baby."}, {"time": 2036, "text": "And it's just walking around pretending to be like all serious and important, wearing a suit or something."}, {"time": 2041, "text": "But that used to be a baby."}, {"time": 2043, "text": "And then you think of like the parenting and all the experiences they had."}, {"time": 2047, "text": "Like it's cool to think of it that way."}, {"time": 2049, "text": "But then I start thinking like from a machine learning perspective."}, {"time": 2053, "text": "But once you're like the romantic moments, all that kind of stuff, all that falls away."}, {"time": 2059, "text": "I forget about all of that, I don't know."}, {"time": 2061, "text": "That's the Russian thing."}, {"time": 2064, "text": "But I also think it might be an age thing or maybe an experience thing."}, {"time": 2068, "text": "So I think we all, I mean, if you're exposed to Western culture at all, you are exposed to the sort of idealized, stereotypic, romantic exchange."}, {"time": 2085, "text": "And what does it mean to be romantic?"}, {"time": 2088, "text": "And so here's a test."}, {"time": 2093, "text": "I'm seeing how to phrase it."}, {"time": 2095, "text": "Okay, so not really a test, but this tells you something about your own ideas about romance."}, {"time": 2103, "text": "For Valentine's Day one year, my husband bought me a six way plug."}, {"time": 2110, "text": "Is that romantic or not romantic?"}, {"time": 2114, "text": "Like, sorry, six way plug, is that like an outlet?"}, {"time": 2117, "text": "Yeah, like to put it in an outlet."}, {"time": 2121, "text": "I mean, it depends the look in his eyes when he does it."}, {"time": 2128, "text": "I mean, it depends on the conversation that led up to that point."}, {"time": 2133, "text": "Depends how much, it's like the music, because you have a very, you're both from the, my experiences with you as a fan, you have both a romantic niche, but you have a very pragmatic, like you cut through the bullshit of the fuzziness."}, {"time": 2151, "text": "And there's something about a six way plug that cuts through the bullshit that connects to the human, like he understands who you are."}, {"time": 2160, "text": "That was the most romantic gift he could have given me because he knows me so well."}, {"time": 2165, "text": "He has a deep understanding of me, which is that I will sit and suffer and complain about the fact that I have to plug and unplug things."}, {"time": 2175, "text": "And I will bitch and moan until the cows come home, but it would never occur to me to go buy a bloody six way plug."}, {"time": 2183, "text": "Whereas for him, he bought it, he plugged it in, he arranged, he taped up all my wires, he made it like really usable."}, {"time": 2191, "text": "And for me, that was the best present."}, {"time": 2198, "text": "It was the most romantic thing because he understood who I was and he did something very, or just the casual, like we moved into a house that we went from having a two car garage to a one car garage."}, {"time": 2212, "text": "And I said, okay, I'm from Canada, I'm not bothered by snow."}, {"time": 2216, "text": "Well, I mean, I'm a little bothered by snow, but he's very bothered by snow."}, {"time": 2219, "text": "So I'm like, okay, you can park your car in the garage, it's fine."}, {"time": 2223, "text": "Every day when it snows, he goes out and cleans my car."}, {"time": 2228, "text": "I never asked him to do it, he just does it because he knows that I'm cutting it really close in the morning, when we all used to go to work."}, {"time": 2238, "text": "I have a time to the second so that I can get up as late as possible, work out as long as possible, and make it into my office like a minute before my first meeting."}, {"time": 2249, "text": "And so if it snows unexpectedly or something, I'm screwed because now that's an added 10 or 15 minutes and I'm gonna be late."}, {"time": 2256, "text": "Anyways, it's just these little tiny things."}, {"time": 2259, "text": "He's a really easygoing guy and he doesn't look like somebody who pays attention to detail."}, {"time": 2268, "text": "He doesn't fuss about detail, but he definitely pays attention to detail."}, {"time": 2273, "text": "And it is very, very romantic in the sense that he loves me despite my little details."}, {"time": 2284, "text": "And understands you."}, {"time": 2285, "text": "Yeah, he understands me."}, {"time": 2286, "text": "It is kind of hilarious that that is, the six way plug is the most fulfilling, richest display of romance in your life."}, {"time": 2300, "text": "That's what I mean about romance."}, {"time": 2301, "text": "Romance is really, it's not all about chocolates and flowers and whatever."}, {"time": 2305, "text": "I mean, those are all nice too, but..."}, {"time": 2308, "text": "Sometimes it's about the six way plug."}, {"time": 2312, "text": "So maybe one way I could ask before we talk about the details, you also have the author of another book as we talked about how emotions are made."}, {"time": 2321, "text": "So it's interesting to talk about the process of writing."}, {"time": 2324, "text": "You mentioned you were in New York."}, {"time": 2326, "text": "What have you learned from writing these two books about the actual process of writing?"}, {"time": 2330, "text": "And maybe, I don't know what's the most interesting thing to talk about there."}, {"time": 2334, "text": "Maybe the biggest challenges or the boring, mundane, systematic, like day to day of what worked for you, like hacks or even just about the neuroscience that you've learned through the process of trying to write them."}, {"time": 2348, "text": "Here's the thing I learned."}, {"time": 2349, "text": "If you think that it's gonna take you a year to write your book, it's going to take you three years to write your book."}, {"time": 2355, "text": "That's the first thing I learned is that no matter how organized you are, it's always gonna take way longer than what you think in part because very few people make an outline and then just stick to it."}, {"time": 2376, "text": "Some of the topics really take on a life of their own and to some extent you wanna let them have their voice."}, {"time": 2383, "text": "You wanna follow leads until you feel satisfied that you've dealt with the topic appropriately."}, {"time": 2392, "text": "But that part is actually fun."}, {"time": 2394, "text": "It's not fun to feel like you're constantly behind the eight ball in terms of time."}, {"time": 2399, "text": "But it is the exploration and the foraging for information is incredibly fun."}, {"time": 2405, "text": "For me anyways, I found it really enjoyable."}, {"time": 2407, "text": "And if I wasn't also running a lab at the same time and trying to keep my family going, the whole thing would have just been fun."}, {"time": 2415, "text": "But I would say the hardest thing about, the most important thing I think I learned is also the hardest thing and that for me, which is knowing what to leave out."}, {"time": 2427, "text": "A really good storyteller knows what to leave out."}, {"time": 2432, "text": "In academic writing, you shouldn't leave anything out."}, {"time": 2438, "text": "All the details should be there."}, {"time": 2445, "text": "I've written or participated in writing over 200 papers, peer reviewed papers."}, {"time": 2454, "text": "So I'm pretty good with detail."}, {"time": 2457, "text": "Knowing what to leave out and not harming the validity of the story."}, {"time": 2464, "text": "That is a tricky, tricky thing."}, {"time": 2466, "text": "It was tricky when I wrote How Emotions Are Made, but that's a standard popular science book."}, {"time": 2473, "text": "So it's 300 something pages."}, {"time": 2475, "text": "And then it has like a thousand end notes."}, {"time": 2478, "text": "And then each of the end notes is attached to a web note, which is also long."}, {"time": 2483, "text": "So I mean, it's, and it start, and I mean the final draft, I mean, I wrote three drafts of that book actually."}, {"time": 2493, "text": "And the final draft, and then I had to cut by a third."}, {"time": 2496, "text": "I mean, it was like 150,000 words or something."}, {"time": 2502, "text": "And I had to cut it down to like 110."}, {"time": 2504, "text": "So obviously it's, I struggle with what to leave out."}, {"time": 2509, "text": "Brevity is not my strong suit."}, {"time": 2510, "text": "I'm always telling people that it's a warning."}, {"time": 2512, "text": "So that's why this book was, I'd always been really fascinated with essays."}, {"time": 2518, "text": "I love reading essays."}, {"time": 2519, "text": "And after reading a small set of essays by Anne Fadiman called At Large and At Small, which I just love these little essays."}, {"time": 2530, "text": "What's the topic of those essays?"}, {"time": 2532, "text": "They are, they're called familiar essays."}, {"time": 2535, "text": "So the topics are like everyday topics, like mail, coffee, chocolate."}, {"time": 2542, "text": "I mean, just like, and what she does is she weaves her own experience."}, {"time": 2546, "text": "It's a little bit like these conversations that you're so good at curating, actually."}, {"time": 2552, "text": "You're weaving together history and philosophy and science and also personal reflections."}, {"time": 2558, "text": "And a little bit, you feel like you're like eavesdropping on someone's train of thought in a way."}, {"time": 2567, "text": "It's really, they're really compelling to me."}, {"time": 2571, "text": "Even if it's just a mundane topic."}, {"time": 2573, "text": "Yeah, but it's so interesting to learn about like all of these little stories in the wrapping of the history of like mail."}, {"time": 2588, "text": "Like that's really interesting."}, {"time": 2590, "text": "And so I read these essays and then I wrote to her a little fan girl email."}, {"time": 2595, "text": "This was many years ago."}, {"time": 2596, "text": "And I said, I just love this book."}, {"time": 2601, "text": "And how did you learn to write essays like this?"}, {"time": 2603, "text": "And she gave me a reading list of essays that I should read like writers."}, {"time": 2607, "text": "And so I read them all."}, {"time": 2608, "text": "And anyway, so I decided it would be a really good challenge for me to try to write something really brief where I could focus on one or two really fascinating tidbits of neuroscience, connect each one to something philosophical or like just a question about human nature."}, {"time": 2636, "text": "Do it in a really brief format without violating the validity of the science."}, {"time": 2645, "text": "That was a, I just set myself this, what I thought of as a really, really big challenge in part because it was an incredibly hard thing for me to do in the first book."}, {"time": 2653, "text": "Yeah, we should say that this is, The Seven and a Half Lessons is a very short book."}, {"time": 2657, "text": "I mean, it's like it embodies brevity, right?"}, {"time": 2662, "text": "The whole point throughout is just, I mean, you could tell that there's editing, like there's pain in trying to bring it as brief as possible, as clean as possible, yeah."}, {"time": 2675, "text": "Yeah, so it's, the way I think of it is, it's a little book of big science and big ideas."}, {"time": 2681, "text": "Yeah, really big ideas in brief little packages."}, {"time": 2684, "text": "And I wrote it so that people could read it."}, {"time": 2689, "text": "I love reading on the beach."}, {"time": 2691, "text": "I love reading essays on the beach."}, {"time": 2693, "text": "I read it, I wrote it so people could read it on the beach or in the bathtub or a subway stop."}, {"time": 2698, "text": "Even if the beach is frozen over in the snow."}, {"time": 2702, "text": "Yeah, so my husband, Dan, calls it the first neuroscience beach read."}, {"time": 2706, "text": "That's his phrasing, yeah."}, {"time": 2711, "text": "And like you said, you learn a lot about writing from your husband, like you were saying offline."}, {"time": 2715, "text": "Well, he is, of the two of us, he is the better writer."}, {"time": 2720, "text": "He is a masterful writer."}, {"time": 2724, "text": "He's also, I mean, he's a PhD in computer science."}, {"time": 2728, "text": "He's a software engineer, but he's also really good at organization of knowledge."}, {"time": 2736, "text": "So he built for a company he used to work for, he built one of the first knowledge management systems."}, {"time": 2741, "text": "And he now works at Google where he does engineering education."}, {"time": 2746, "text": "Like he understands how to tell a good story, just about anything, really."}, {"time": 2755, "text": "He's got impeccable timing, he's really funny."}, {"time": 2759, "text": "And luckily for me, he knows very little about psychology or neuroscience."}, {"time": 2763, "text": "Well, now he knows more, obviously, but."}, {"time": 2765, "text": "So when How Emotions Were Made, he was really, really helpful to me because the first draft of every chapter was me talking to him about what, I would talk out loud about what I wanted to say and the order in which I wanted to say it."}, {"time": 2784, "text": "And then I would write it and then he would read it and tell me all the bits that could be excised."}, {"time": 2793, "text": "And sometimes we would, I should say, I mean, we don't, he and I don't really argue about much except directions in the car."}, {"time": 2801, "text": "Like if we're gonna have an argument, that's gonna be where it's gonna happen, where."}, {"time": 2806, "text": "What's the nature of the argument about directions exactly?"}, {"time": 2810, "text": "I don't really know, it's just that we're very, I think it's that spatially, I use egocentric space."}, {"time": 2818, "text": "So I wanna say, turn left."}, {"time": 2821, "text": "Like I'm reasoning in relation to my own physical corporeal body."}, {"time": 2826, "text": "So you walk to the church and you turn left and you, then whatever, I'm always like, and he gives directions allocentrically, which means organized around north, south, east, west."}, {"time": 2841, "text": "So to you, the earth is at the center of the solar system and to him, reasonably."}, {"time": 2846, "text": "I'm at the center."}, {"time": 2847, "text": "You're at the center of the solar system."}, {"time": 2850, "text": "Anyway, but here, we had some really riproaring arguments, like really riproaring arguments where he would say, like, who is this for?"}, {"time": 2861, "text": "Is this for the 1%?"}, {"time": 2864, "text": "And I'd be like, 1% meaning not wealth, but like civilians versus academics."}, {"time": 2871, "text": "Are these for the scientists or is this for the civilians, right?"}, {"time": 2874, "text": "So he speaks for the people, for the civilians."}, {"time": 2876, "text": "He speaks for the people and I'd be like, no, you have to."}, {"time": 2879, "text": "And so he made, after one terrible argument that we had where it was really starting to affect our relationship because we were so mad at each other all the time, he made these little signs, writing and science."}, {"time": 2894, "text": "And we only use them, this was like, when you pulled out a sign, that's it."}, {"time": 2900, "text": "Like the other person just wins and you have to stop fighting about it and that's it."}, {"time": 2905, "text": "And so we just did that."}, {"time": 2906, "text": "And we didn't really have to use it too much for this book because this book was in some ways, I didn't have to learn a lot of new things for this book."}, {"time": 2917, "text": "I had to learn some, but a lot of what I learned for How Emotions Are Made really stood me in good stead for this book."}, {"time": 2929, "text": "So there was a little bit, each essay was a little bit of learning."}, {"time": 2932, "text": "A couple were, was a little more than the small amount."}, {"time": 2935, "text": "But I didn't have so much trouble here."}, {"time": 2939, "text": "I had a lot of trouble with the first book."}, {"time": 2942, "text": "But still even here, he would tell me that I could take something out and I really wanted to keep it."}, {"time": 2950, "text": "And I think we only use the signs once."}, {"time": 2954, "text": "Well, if we could dive in some aspects of the book, I would love that."}, {"time": 2958, "text": "Can we talk about, so one of the essays looks at evolution."}, {"time": 2963, "text": "It looks at evolution."}, {"time": 2968, "text": "Let me ask the big question."}, {"time": 2970, "text": "Did the human brain evolve to think?"}, {"time": 2973, "text": "That's essentially the question that you address in the essay."}, {"time": 2980, "text": "The big caveat here is that we don't really know why brains evolved."}, {"time": 2985, "text": "The big why questions are called teleological questions."}, {"time": 2989, "text": "And in general, scientists should avoid those questions because we don't know really why, we don't know the why."}, {"time": 2998, "text": "However, for a very long time, the assumption was that evolution worked in a progressive upward scale, that you start off with simple organisms and those organisms get more complex and more complex and more complex."}, {"time": 3014, "text": "Now, obviously that's true in some like really general way, right, that life started off as single cell organisms and things got more complex."}, {"time": 3024, "text": "But the idea that brains evolved in some upward trajectory from simple brains in simple animals to complex brains in complex animals is called a phylogenetic scale."}, {"time": 3040, "text": "And that phylogenetic scale is embedded in a lot of evolutionary thinking, including Darwin's actually."}, {"time": 3048, "text": "And it's been seriously challenged, I would say, by modern evolutionary biology."}, {"time": 3057, "text": "And so thinking is something that, rationality is something that humans, at least in the West, really prize as a great human achievement."}, {"time": 3070, "text": "And so the idea that the most common evolutionary story is that brains evolved in like sedimentary rock with a layer for instincts, that's your lizard brain, and a layer on top of that for emotions, that's your limbic system, limbic meaning border."}, {"time": 3093, "text": "So it borders the parts that are for instincts."}, {"time": 3097, "text": "And then the neocortex or new cortex where rationality is supposed to live."}, {"time": 3106, "text": "That's the sort of traditional story."}, {"time": 3108, "text": "It just keeps getting layered on top by evolution."}, {"time": 3112, "text": "And so you can think about, I mean, sedimentary rock is the way typically people describe it."}, {"time": 3118, "text": "The way I sometimes like to think about it is thinking about the cerebral cortex like icing on an already baked cake, where the cake is your inner beast."}, {"time": 3131, "text": "These like boiling, roiling instincts and emotions that have to be contained by the cortex."}, {"time": 3139, "text": "And it's just, it's a fiction, it's a myth."}, {"time": 3143, "text": "It's a myth that you can trace all the way back to stories about morality in ancient Greece."}, {"time": 3151, "text": "But what you can do is look at the scientific record and say, well, there are other stories that you could tell about brain evolution and the context in which brains evolved."}, {"time": 3165, "text": "So when you look at creatures who don't have brains and you look at creatures who do, what's the difference?"}, {"time": 3175, "text": "And you can look at some animals."}, {"time": 3182, "text": "So we call, scientists call an environment that an animal lives in a niche, their environmental niche."}, {"time": 3189, "text": "What are the things, what are the parts of the environment that matter to that animal?"}, {"time": 3193, "text": "And so there are some animals whose niche hasn't changed in 400 million years."}, {"time": 3198, "text": "So they're not, these creatures are modern creatures but they're living in a niche that hasn't changed much."}, {"time": 3204, "text": "And so their biology hasn't changed much."}, {"time": 3207, "text": "And you can kind of verify that by looking at the genes that lurk deep in the molecular structure of cells."}, {"time": 3214, "text": "And so you can, by looking at various animals in their developmental state, meaning not, you don't look at adult animals, you look at embryos of animals and developing animals, you can see, you can piece together a different story."}, {"time": 3229, "text": "And that story is that brains evolved under the selection pressure of hunting."}, {"time": 3237, "text": "That in the Cambrian period, hunting emerged on the scene where animals deliberately ate one another."}, {"time": 3246, "text": "And what, so before the Cambrian period, the animals didn't really have, well, they didn't have brains, but they also didn't have senses really, the very, very rudimentary senses."}, {"time": 3260, "text": "So the animal that I wrote about in seven and a half lessons is called an amphioxus or a lancelet."}, {"time": 3269, "text": "And little amphioxus has no eyes, it has no ears, it has no nose, it has no eyes."}, {"time": 3278, "text": "It has a couple of cells for detecting light and dark for circadian rhythm purposes."}, {"time": 3287, "text": "And it can't hear, it has a vestibular cell to keep its body upright."}, {"time": 3293, "text": "It has a very rudimentary sense of touch and it doesn't really have any internal organs other than this like basically stomach."}, {"time": 3303, "text": "It's like a, just like a, it doesn't have an enteric nervous system."}, {"time": 3306, "text": "It doesn't have like a gut that moves like we do."}, {"time": 3311, "text": "It just has basically a tube."}, {"time": 3314, "text": "So it's like a little container, yeah."}, {"time": 3316, "text": "And so, and really it doesn't move very much."}, {"time": 3320, "text": "It can move, it just sort of wriggles."}, {"time": 3322, "text": "It doesn't have very sophisticated movement."}, {"time": 3324, "text": "And it's this really sweet little animal."}, {"time": 3327, "text": "It sort of wriggles its way to a spot and then plants itself in the sand and just filters food as the food goes by."}, {"time": 3337, "text": "And then when the food concentration decreases, it just ejects itself, wriggles to some spot randomly where probabilistically there will be more food and plants itself again."}, {"time": 3351, "text": "So it's not really aware, very aware that it has an environment."}, {"time": 3358, "text": "It has a niche, but that niche is very small and it's not really experiencing that niche very much."}, {"time": 3365, "text": "So it's basically like a little stomach on a stick."}, {"time": 3368, "text": "That's really what it is."}, {"time": 3369, "text": "And, but when animals start to literally hunt each other, all of a sudden it becomes important to have, to be able to sense your environment."}, {"time": 3380, "text": "Cause you need to know, is that blob up ahead gonna eat me or should I eat it?"}, {"time": 3387, "text": "And so all of a sudden you want, distance senses are very useful."}, {"time": 3391, "text": "And so in the water, distance senses are vision and a little bit hearing."}, {"time": 3398, "text": "Olfaction, smelling and touch, because in the water touch is a distance sense cause you can feel the vibration, so it's right."}, {"time": 3409, "text": "So on land, you know, vision is a distance sense, touch not so much, but for elephants maybe, right?"}, {"time": 3418, "text": "The vibrations."}, {"time": 3419, "text": "Vibrations, olfaction definitely because of the distance sense."}, {"time": 3424, "text": "And so it's very important to have a sense of touch and olfaction definitely because of the concentration of, you know, the more concentrated something is, the more likely it is to be close to you."}, {"time": 3434, "text": "So animals developed senses."}, {"time": 3437, "text": "They developed a head, like a literal head."}, {"time": 3440, "text": "So amphyoxus doesn't even have a head really."}, {"time": 3442, "text": "It's just a long."}, {"time": 3443, "text": "What's the purpose of a head?"}, {"time": 3447, "text": "Is it to have a jaw?"}, {"time": 3450, "text": "So jaw, so yes, jaws are a major."}, {"time": 3455, "text": "Useful feature."}, {"time": 3456, "text": "Yeah, obviously they're a major adaptation after there's a split between vertebrates and invertebrates."}, {"time": 3462, "text": "So amphyoxus is thought to be very, very similar to the animal that's before that split."}, {"time": 3468, "text": "But then after the development, very quickly after the development of a head is the development of a jaw, which is a big thing."}, {"time": 3476, "text": "And what goes along with that is the development of a brain."}, {"time": 3482, "text": "It's weird, is that just a coincidence that the thing, the part of our body, of the mammal, I think, body that we eat with and attack others with is also the thing that contains all the majority of the brain type of stuff."}, {"time": 3501, "text": "Well, actually the brain goes with the development of a head and the development of a visual system and an auditory system and an olfactory system and so on."}, {"time": 3511, "text": "So your senses are developing and the other thing that's happening is that animals are getting bigger because they're, and also their niche is getting bigger."}, {"time": 3524, "text": "Well, this is the, just sorry to take a tiny tangent on the niche thing is it seems like the niche is getting bigger, but not just bigger, like more complicated, like shaped in weird ways."}, {"time": 3536, "text": "So predation seems to create, the whole world becomes your oyster, whatever, but you also start to carve out the places in which you can operate the best."}, {"time": 3548, "text": "Yeah, and in fact, that's absolutely right."}, {"time": 3550, "text": "And in fact, some scientists think that theory of mind, your ability to make inferences about the inner life of other creatures actually developed under the selection pressure of predation because it makes you a better predator."}, {"time": 3568, "text": "Do you ever look at, you just said you looked at babies as these wiring creatures."}, {"time": 3574, "text": "Do you ever think of humans as just clever predators?"}, {"time": 3579, "text": "Like that there's, underneath it all is this the Nietzschean will to power in all of its forms?"}, {"time": 3589, "text": "Or are we now friendlier?"}, {"time": 3592, "text": "Yeah, so it's interesting."}, {"time": 3594, "text": "I mean, there are zeitgeists in how humans think about themselves, right?"}, {"time": 3599, "text": "And so if you look in the 20th century, you can see that the idea of an inner beast that we're just predators, we're just basically animals, baseless animals, violent animals that have to be contained by culture and by our prodigious neocortex really took hold, particularly after World War I, and really held sway for much of that century."}, {"time": 3632, "text": "And then around, at least in Western writing, I would say, you know, we're talking mainly about Western scientific writing, Western philosophical writing."}, {"time": 3642, "text": "And then, you know, late 90s maybe, you start to see books and articles about our social nature, that we're social animals."}, {"time": 3653, "text": "And we are social animals, but what does that mean exactly?"}, {"time": 3657, "text": "And about."}, {"time": 3660, "text": "It's us carving out different niches in the space of ideas, it looks like."}, {"time": 3663, "text": "I think so, I think so."}, {"time": 3664, "text": "So, you know, do humans, can humans be violent?"}, {"time": 3675, "text": "Can humans be really helpful?"}, {"time": 3679, "text": "And humans are interesting creatures because, you know, other animals can also be helpful to one another."}, {"time": 3688, "text": "In fact, there's a whole literature, booming literature on how other animals support one another."}, {"time": 3698, "text": "They regulate each other's nervous systems in interesting ways, and they will be helpful to one another, right?"}, {"time": 3703, "text": "So for example, there's a whole literature on rodents and how they signal one another what is safe to eat, and they will perform acts of generosity to their conspecifics that are related to them, or who they were raised with."}, {"time": 3723, "text": "So if an animal was raised in a litter that they were raised in, although not even at the same time, they'll be more likely to help that animal."}, {"time": 3731, "text": "So there's always some kind of physical relationship between animals that predicts whether or not they'll help one another."}, {"time": 3739, "text": "For humans, you know, we have ways of categorizing who's in our group and who isn't by nonphysical ways, right?"}, {"time": 3752, "text": "Even by just something abstract, like an idea."}, {"time": 3755, "text": "And we are much more likely to extend help to people in our own group, whatever that group may be at that moment, whatever feature you're using to do that."}, {"time": 3768, "text": "Feature you're using to define who's in your group and who isn't."}, {"time": 3773, "text": "We're more likely to help those people than even members of our own family at times."}, {"time": 3779, "text": "So humans are much more flexible in their, in the way that they help one another, but also in the way that they harm one another."}, {"time": 3788, "text": "So I don't think I subscribe to, I don't think I subscribe to, you know, we are primarily this or we are primarily that."}, {"time": 3801, "text": "I don't think humans have essences in that way, really."}, {"time": 3805, "text": "I apologize to take us in this direction for a brief moment, but I've been really deep on Stalin and Hitler recently in terms of reading."}, {"time": 3814, "text": "And is there something that you think about in terms of the nature of evil from a neuroscience perspective?"}, {"time": 3824, "text": "Is there some lessons that are sort of hopeful about human civilization that we can find in our brain with regard to the Hitlers of the world?"}, {"time": 3841, "text": "Do you think about the nature of evil?"}, {"time": 3847, "text": "I don't know that what I have to say is so useful from a, I don't know that I can say as a neuroscientist, well, here's a study that, you know, so I sort of have to take off my lab coat, right?"}, {"time": 3860, "text": "And now I'm gonna now conjecture as a human who just also, who has opinions, but who also maybe has some knowledge about neuroscience."}, {"time": 3905, "text": "It's just, the question is really how much encouragement does it take from the environment to get them to do something bad?"}, {"time": 3911, "text": "That's what I kind of, when I look at the life of Hitler, it seems like there's so many places where... Something could have intervened."}, {"time": 3920, "text": "Intervene, no, it could change completely the person."}, {"time": 3923, "text": "I mean, there's like the caricature, like the obvious places where he was an artist and if he wasn't rejected as an artist, he was a reasonably good artist."}, {"time": 3932, "text": "So that could have changed, but just his entire, like where he went in Vienna and all these kinds of things, like little interactions could have changed and there's probably millions of other people who are capable, who the environment may be able to mold in the same way it did this particular person to create this particular kind of charismatic leader in this particular moment of time."}, {"time": 3957, "text": "Absolutely, and I guess the way that I would say it, I would agree 100% and I guess the way that I would say it is like this, in the West, we have a way of reasoning about causation, which focuses on single, simple causes for things."}, {"time": 3981, "text": "There's an essence to Hitler, there's an essence to his character."}, {"time": 3984, "text": "He was born with that essence or it was forged very, very early in his life and that explains the horrible landscape of his behavior."}, {"time": 3998, "text": "But there's another way to think about it, a way that actually is much more consistent with what we know about biology, how biology works in the physical world."}, {"time": 4008, "text": "And that is that most things are complex, not as in, wow, this is really complex and hard, but complex as in complexity, that is more than the sum of their parts and that most phenomena have many, many weak nonlinear interacting causes."}, {"time": 4028, "text": "And so little things that we might not even be aware of can shift someone's developmental trajectory from this to that and that's enough to take it on a whole set of other paths and that these things are happening all the time."}, {"time": 4048, "text": "So it's not random and it's not really, it's not deterministic in the sense that like everything you do determines your outcome, but it's a little more like you're nudging someone from one set of possibilities to another set of possibilities."}, {"time": 4066, "text": "But I think the thing that I find optimistic is that the other side of that coin is also true."}, {"time": 4074, "text": "So look at all the people who risked their lives to help people they didn't even know."}, {"time": 4085, "text": "I mean, I just watched Borat, the new Borat movie."}, {"time": 4089, "text": "And the thing that I came away with, but the thing I came away with was, look at how generous people were in that."}, {"time": 4099, "text": "Oh, he's making, there are a lot of people he makes fun of and that's fine, but think about like those two people two guys, those."}, {"time": 4107, "text": "The Trump supporter guys."}, {"time": 4109, "text": "Those guys."}, {"time": 4110, "text": "That was cool, there was kindness in them, right?"}, {"time": 4113, "text": "They took a complete stranger in a pandemic into their house."}, {"time": 4121, "text": "Who does that?"}, {"time": 4122, "text": "Like that's a really nice thing."}, {"time": 4124, "text": "Or there's one scene, I mean, I don't wanna spoil it for people who haven't seen it, but there's one scene where he goes in, he dresses up as a Jew, I laugh myself sick at that scene, seriously, but he goes in and there are these two old Jewish ladies."}, {"time": 4144, "text": "What a bunch of sweethearts, oh my gosh."}, {"time": 4147, "text": "Like really, I mean, that was what I was struck by actually."}, {"time": 4152, "text": "I mean, there are other ones or like the babysitter, right?"}, {"time": 4155, "text": "I mean, she was really kind."}, {"time": 4158, "text": "And yeah, so that's really what I was more struck by."}, {"time": 4162, "text": "Like sure, there are other people who do very bad things or say bad things or whatever, but like there's one guy who's completely stoic, like the guy who's sending the messages, I don't know if it's facts or whatever."}, {"time": 4181, "text": "He's just completely stoic, but he's doing his job actually."}, {"time": 4185, "text": "Like you don't know what he was thinking inside his head, you don't know what he's feeling, but he was totally professional doing his job."}, {"time": 4193, "text": "So I guess I just, I had a bit of a different view, I guess."}, {"time": 4198, "text": "So I also think that about people, I think everybody is capable of kindness, but the question is how much does it take and what are the circumstances?"}, {"time": 4209, "text": "So for some people it's gonna take a lot and for some people it only takes a little bit, but are we actually cultivating an environment for the next generation that provides opportunities for people to go in the direction of caring and kindness or, and I'm not saying that as like a Pollyanna ish person."}, {"time": 4240, "text": "I think there's a lot of room for competition and debate and so on, but I don't see Hitler as an anomaly and I never have, that was even before I learned anything about neuroscience."}, {"time": 4252, "text": "And now I would say knowing what we know about developmental trajectories and life histories and how important that is, knowing what we know about that the whole question of like nature versus nurture is a completely wrong question."}, {"time": 4267, "text": "We have the kind of nature that requires nurture, we have the kind of genes that allow infants to be born with unfinished brains where the brains, their brains are wired across a 25 year period with wiring instructions from the world that is created for them."}, {"time": 4285, "text": "And so I don't think Hitler is an anomaly, even if it's less probable that that would happen, it's possible that it could happen again and it's not like, you know, he's a bad seed."}, {"time": 4303, "text": "I mean, that doesn't, I just wanna say for like, of course he's completely 100% responsible for his actions and all the bad things that happen."}, {"time": 4310, "text": "So I'm not in any way, this is not me saying."}, {"time": 4313, "text": "But the environment is also responsible in part for creating the evil in this world."}, {"time": 4319, "text": "So like Hitler's in different versions of even more subtle, more smaller scale versions of evil."}, {"time": 4327, "text": "But I tend to believe that there's a much stronger, I don't like to talk about evolutionary advantages, but it seems like it makes sense for love to be a more powerful emergent phenomena of our collective intelligence versus hate and evil and destruction."}, {"time": 4350, "text": "Because from a survival, from a niche perspective, it seems to be like in my own life and my thinking about the intuition about the way humans work together to solve problems, it seems that love is a very useful tool."}, {"time": 4367, "text": "I definitely agree with you."}, {"time": 4370, "text": "But I think the caveat here is that, you know, humans, the research suggests that humans are capable of great acts of kindness and great acts of generosity to people in their in group."}, {"time": 4387, "text": "Right, so we're also tribal."}, {"time": 4391, "text": "Yeah, I mean, that's the kitschy way to say it."}, {"time": 4394, "text": "We're tribes, we're tribal, yeah."}, {"time": 4396, "text": "So that's the kitschy way to say it."}, {"time": 4398, "text": "What I would say is that, you know, there are a lot of features that you can use to describe yourself."}, {"time": 4408, "text": "You don't have one identity, you don't have one self, you have many selves, you have many identities."}, {"time": 4414, "text": "Sometimes you're a man, sometimes you're a scientist, sometimes you're a, do you have a brother or a sister?"}, {"time": 4420, "text": "Yeah, brother."}, {"time": 4421, "text": "So sometimes you're a brother."}, {"time": 4422, "text": "You know, sometimes you're a friend."}, {"time": 4425, "text": "Sometimes you're a human so you can keep zooming out."}, {"time": 4428, "text": "Living organism on Earth."}, {"time": 4429, "text": "Yes, exactly, that's exactly right."}, {"time": 4433, "text": "And so there are some people who there is research which suggests that there are some people who will tell you, I think it's appropriate and better to help."}, {"time": 4448, "text": "I should help my family more than I should help my neighbors and I should help my neighbors more than I should help the average stranger."}, {"time": 4455, "text": "And I should help, you know, the average stranger in my country more than I should help somebody outside my country."}, {"time": 4462, "text": "And I should help humans more than I should help, you know, other animals."}, {"time": 4466, "text": "And I should, right, so there's a clear hierarchy of helping and there are other people who, you know, they are, their niche is much more inclusive, right?"}, {"time": 4477, "text": "And that they're humans first, right?"}, {"time": 4480, "text": "Or creatures of the Earth first, let's say."}, {"time": 4485, "text": "And I don't think we know how flexible those attitudes are because I don't think the research really tells us that."}, {"time": 4493, "text": "But in any case, there are, you know, and there are beliefs, people also have beliefs about, there's this really interesting research in, really in anthropology that looks at what are cultures particularly afraid of?"}, {"time": 4512, "text": "Like what the people in a particular culture are organizing their social systems to prevent certain types of problems."}, {"time": 4520, "text": "So what are the problems that they're worried about?"}, {"time": 4522, "text": "And so there are some cultures that are much more hierarchical and some cultures that are, you know, much more egalitarian."}, {"time": 4530, "text": "There are some cultures that, you know, in the debate of like getting along versus getting ahead, there are some cultures that really prioritize the individual over the group."}, {"time": 4540, "text": "And there are other cultures that really prioritize the group over the individual."}, {"time": 4543, "text": "You know, it's not like one of these is right and one of these is wrong, it's that, you know, different combinations of these features are different solutions that humans have come up with for living in groups, which is a major adaptive advantage of our species."}, {"time": 4560, "text": "And it's not the case that one of these is better and one of these is worse."}, {"time": 4563, "text": "Although as a person, of course, I have opinions about that."}, {"time": 4567, "text": "And as a person, I can say, I would very much prefer certain, I have certain beliefs and I really want everyone in the world to live by those beliefs, you know."}, {"time": 4577, "text": "But as a scientist, I know that it's not really the case that for the species, any one of these is better than any other."}, {"time": 4586, "text": "There are different solutions that work differentially well in particular, you know, ecological parts of the world."}, {"time": 4596, "text": "But for individual humans, there are definitely some systems that are better and some systems that are worse, right?"}, {"time": 4603, "text": "But when anthropologists or when neuroscientists or biologists are talking, they're not usually talking about the lives of individual people, they're talking about, you know, the species, what's better for the species, the survivability of the species."}, {"time": 4617, "text": "And what's better for the survivability of the species is variation, that we have lots of cultures with lots of different solutions because if the environment were to change drastically, some of those solutions will work better than others."}, {"time": 4637, "text": "And you can see that happening with COVID."}, {"time": 4641, "text": "Right, so some people might be more susceptible to this virus than others."}, {"time": 4646, "text": "And so variation is very useful."}, {"time": 4648, "text": "Say COVID was much, much more destructive than it is."}, {"time": 4652, "text": "And like, I don't know, 20% of the population died."}, {"time": 4656, "text": "So, you know, it's good to have variability because then at least some percent will survive."}, {"time": 4662, "text": "Yeah, I mean, the way that I used to describe it was, you know, using, you know, those movies like the War of the Worlds or Pacific Rim, you know, where like aliens come down from outer space and they, you know, wanna kill humans."}, {"time": 4681, "text": "And so all the humans band together as a species and they all, like all the, you know, little squabbling from countries and whatever all, you know, goes away and everyone is just one big, you know."}, {"time": 4693, "text": "Well, that, you know, that doesn't happen."}, {"time": 4699, "text": "I mean, cause COVID is, you know, a virus like COVID 19 is like a creature from outer space."}, {"time": 4709, "text": "And that's not what you see happening."}, {"time": 4711, "text": "What you do see happening, it is true that some people, I mean, we could use this as an example of essentialism also."}, {"time": 4717, "text": "So just to say, like exposure to the virus does not mean that you will become infected with a disease."}, {"time": 4725, "text": "So, I mean, in controlled studies, one of which was actually a coronavirus, not COVID, but this was, these are studies from 10 or so years ago, you know, only somewhere between 20 and 40% of people were developed respiratory illness when a virus was placed in their nose."}, {"time": 4747, "text": "And there's a dose question, all those."}, {"time": 4749, "text": "Well, not in these studies, actually."}, {"time": 4750, "text": "So in these studies, the dose was consistent across all people and everything, you know, they were sequestered in hotel rooms and what they ate was, you know, measured out by scientists and so on."}, {"time": 4763, "text": "And so when you hold dose, I mean, the dose issue is a real issue in the real world, but in these studies, that was controlled."}, {"time": 4772, "text": "And only somewhere between 20, depending on the study, between 20 and 40% of people became infected with a disease."}, {"time": 4778, "text": "So exposure to a virus doesn't mean de facto that you will develop an illness."}, {"time": 4786, "text": "You will be a carrier and you will spread the virus to other people, but you yourself may not, your immune system may be in a state that you can make enough antibodies to not show symptoms, not develop symptoms."}, {"time": 4805, "text": "And so, of course, what this means is, again, is that, you know, like if I asked you, do you think, you know, a virus is the cause of a common cold or, you know, most people, if I asked this question, I can tell you, because I asked this question."}, {"time": 4821, "text": "So do you think a virus is the cause of a cold?"}, {"time": 4825, "text": "Most people would say, yes, I think it is."}, {"time": 4827, "text": "And then I say, yeah, well, only 20 to 40% of people develop respiratory illness in exposure to a virus."}, {"time": 4834, "text": "So clearly it is a necessary cause, but it's not a sufficient cause."}, {"time": 4839, "text": "And there are other causes, again, so not simple single causes for things, right?"}, {"time": 4844, "text": "Multiple interacting influences."}, {"time": 4847, "text": "So it is true that individuals vary in their susceptibility to illness upon exposure, but different cultures have different sets of norms and practices that allow, that will slow or speed the spread."}, {"time": 4865, "text": "And that's the point that I was actually trying to make here that, you know, when the environment changes, that is, there's a mutation of a virus that is incredibly infectious, some cultures will succumb, people in some cultures will succumb faster because of the particular norms and practices that they've developed in their culture versus other cultures."}, {"time": 4896, "text": "Now, there could be some other, you know, thing that changes that where those other cultures or, you know, would do better."}, {"time": 4906, "text": "So very individualistic cultures like ours may do much better under other types of selection pressures."}, {"time": 4913, "text": "But for COVID, for things like COVID, you know, my colleague Michelle Gelfant, her research shows that she looks at like loose cultures and tight cultures, so cultures that have very, very strict rules versus cultures that are much more individualistic and where personal freedoms are more valued."}, {"time": 4934, "text": "And she, you know, her research suggests that for pandemic circumstances, tight cultures actually, the people survive better."}, {"time": 4944, "text": "Just to linger a little bit longer, we started this part of the conversation talking about, you know, did humans evolve to think, did the human brain evolve to think, implying is there like a progress to the thing that's always improving?"}, {"time": 4961, "text": "That's right, we never, yeah, and so the answer is no."}, {"time": 4966, "text": "But let me sort of push back, but so your intuition is very strong here, not your intuition, the way you describe this, but is it possible there's a direction to this evolution?"}, {"time": 4978, "text": "Like, do you think of this evolution as having a direction?"}, {"time": 4981, "text": "Like it's like walking along a certain path towards something?"}, {"time": 4986, "text": "Is it, you know, what is it?"}, {"time": 4992, "text": "Is it Elon Musk said like the Earth got bombarded with photons and then all of a sudden, like a Tesla was launched into space or whatever, a rocket started coming?"}, {"time": 5004, "text": "Like, is there a sense in which, even though in the, like within the system, the evolution seems to be this mess of variation, we're kind of trying to find our niches and so on, but do you think there, ultimately, when you zoom out, there is a direction that's strong, that does tend towards greater complexity and intelligence?"}, {"time": 5030, "text": "So, I mean, and again, what I would say is I'm really, I'm really just echoing people who are much smarter than I am about this."}, {"time": 5040, "text": "But see, you're saying smarter."}, {"time": 5041, "text": "I thought it doesn't, there's no, I thought there's no smarter."}, {"time": 5044, "text": "No, I didn't say there's no smarter."}, {"time": 5046, "text": "I said there's no direction."}, {"time": 5048, "text": "So I think the thing to say, or what I understand to be the case, is that there's variation."}, {"time": 5055, "text": "It's not unbounded variation."}, {"time": 5057, "text": "And there are selectors."}, {"time": 5058, "text": "There are pressures that will select."}, {"time": 5062, "text": "And so not anything is possible because we live on a planet that has certain physical realities to it, right?"}, {"time": 5071, "text": "But those physical realities are what constrain the possibilities, the physical realities of our genes and the physical realities of our corporeal bodies and the physical realities of life on this planet."}, {"time": 5091, "text": "So what I would say is that there's no direction, but there is, it's not infinite possibility because we live on a particular planet that has particular statistical regularities in it, and some things will never happen."}, {"time": 5112, "text": "And so all of those things are interacting with our genes and so on, and the physical nature of our bodies to make some things more possible and some things less possible."}, {"time": 5126, "text": "Look, I mean, humans have very complex brains, but birds have complex brains, and so do octopuses have very complex brains."}, {"time": 5137, "text": "And all three sets of all three of those brains are somewhat different from one another."}, {"time": 5145, "text": "Some birds have very complex brains."}, {"time": 5147, "text": "Some even have rudimentary language."}, {"time": 5148, "text": "They have no cerebral cortex."}, {"time": 5151, "text": "I mean, admittedly, they have, this is now lesson two, right?"}, {"time": 5154, "text": "They have, is it lesson two or lesson one?"}, {"time": 5156, "text": "Let me think."}, {"time": 5157, "text": "No, this is lesson one."}, {"time": 5158, "text": "They have the same neurons, the same neurons that in a human become the cerebral cortex."}, {"time": 5169, "text": "Birds have those neurons."}, {"time": 5170, "text": "They just don't form themselves into a cerebral cortex."}, {"time": 5173, "text": "But I mean, crows, for example, are very sophisticated animals."}, {"time": 5177, "text": "They can do a lot of the things that humans can do."}, {"time": 5179, "text": "In fact, all of the things that humans do that are very special, that seem very special, there's at least one other animal on the planet that can do those things too."}, {"time": 5189, "text": "What's special about the human brain is that we put them all together."}, {"time": 5193, "text": "So we learn from one another."}, {"time": 5195, "text": "We don't have to experience everything ourselves."}, {"time": 5197, "text": "We can watch another animal or another human experience something, and we can learn from that."}, {"time": 5202, "text": "Well, there are many other animals who can learn by copying."}, {"time": 5205, "text": "That we communicate with each other very, very efficiently."}, {"time": 5208, "text": "We have language."}, {"time": 5209, "text": "But we're not the only animals who are efficient communicators."}, {"time": 5212, "text": "There are lots of other animals who can efficiently communicate, like bees, for example."}, {"time": 5218, "text": "We cooperate really well with one another to do grand things."}, {"time": 5221, "text": "But there are other animals that cooperate too."}, {"time": 5223, "text": "And so every innovation that we have, other animals have too."}, {"time": 5227, "text": "What we have is we have all of those together interwoven in this very complex dance in a brain that is not unique exactly, but that is, it does have some features that make it particularly useful for us to do all of these things, to have all of these things intertwined."}, {"time": 5255, "text": "So our brains are, actually the last time we talked, I made a mistake because I said in my enthusiasm, I said, you know, our brains are not larger, or relative to our bodies, our brains are not larger than other primates."}, {"time": 5275, "text": "And that's actually not true, actually."}, {"time": 5277, "text": "Our brains relative to our body size is somewhat larger."}, {"time": 5281, "text": "So an ape who's not a human, that's not a human, their brains are larger than their body sizes than say, relative to like a smaller monkey."}, {"time": 5293, "text": "And a human's brain is larger relative to its body size than a gorilla."}, {"time": 5298, "text": "So that's a good approximation of your, of whatever, of the bunch of stuff that you can shove in there."}, {"time": 5305, "text": "But, well, what I was gonna say is, but our cerebral cortex is not larger than what you would expect for a brain of its size."}, {"time": 5313, "text": "So relative to say an ape, like a gorilla or a chimp, or even a mammal like a dolphin or an elephant, you know, our brains, our cerebral cortex is as large as you would expect it to be for a brain of our size."}, {"time": 5333, "text": "So there's nothing special about our cerebral cortex."}, {"time": 5337, "text": "And this is something I explain in the book, where I say, okay, you know, like by analogy, if you walk into somebody's house and you see that they have a huge kitchen, you might think, well, maybe this is a place I really definitely wanna eat dinner at because these people must be gourmet cooks."}, {"time": 5356, "text": "But you don't know anything about what the size of their kitchen means unless you consider it in relation to the size of the rest of the house."}, {"time": 5363, "text": "If it's a big kitchen in a really big house, it's not telling you anything special, right?"}, {"time": 5369, "text": "If it's a big kitchen in a small house, then that might be a place that you wanna eat for, you wanna stay for dinner because it's more likely that that kitchen is large for a special reason."}, {"time": 5379, "text": "And so the cerebral cortex of a human brain isn't in and of itself special because of its size."}, {"time": 5388, "text": "However, there are some genetic changes that have happened in the human brain as it's grown to whatever size is typical for the whole brain size, right?"}, {"time": 5404, "text": "There are some changes that do give the human brain slightly more of some capacities."}, {"time": 5412, "text": "They're not special, but we can do some things much better than other animals."}, {"time": 5421, "text": "And correspondingly, other animals can do some things much better than we can."}, {"time": 5425, "text": "We can't grow back limbs, we can't lift 50 times our own body weight."}, {"time": 5429, "text": "Well, I mean, maybe you can, but I can't lift 50 times my own body weight."}, {"time": 5431, "text": "Ants with that regard are very impressive."}, {"time": 5434, "text": "And then you're saying with the frontal cortex, like that's the size is not always the right measure of capability, I guess."}, {"time": 5444, "text": "So size isn't everything."}, {"time": 5446, "text": "Size isn't everything."}, {"time": 5448, "text": "That's a quoted book."}, {"time": 5449, "text": "People like it when I disagree, so let me disagree with you on something or just like play devil's advocate a little bit."}, {"time": 5456, "text": "So you've painted a really nice picture that evolution doesn't have a direction, but is it possible if we just ran Earth over and over again, like this video game, that the final result will be the same."}, {"time": 5471, "text": "So in the sense that we're, eventually there'll be an AGI type, HAL 9000 type system that just like flies and colonizes nearby Earth like planets."}, {"time": 5485, "text": "And it's always will be the same."}, {"time": 5486, "text": "And the different organisms and the different evolution of the brain, like it doesn't feel like it has like a direction, but given the constraints of Earth and whatever this imperative, whatever the hell is running this universe, like it seems like it's running towards something, is it possible that it will always be the same?"}, {"time": 5509, "text": "Thereby it will be a direction."}, {"time": 5511, "text": "Yeah, I think as you know better than anyone else that the answer to that question is, of course there's some probability that could happen, right?"}, {"time": 5523, "text": "It's not a yes or no answer."}, {"time": 5524, "text": "It's what's the probability that that would happen?"}, {"time": 5527, "text": "And there's a whole distribution of possibilities."}, {"time": 5534, "text": "So maybe we end up, what's the probability we end up with exactly the same compliment of creatures, including us?"}, {"time": 5542, "text": "What's the likelihood that we end up with creatures that are similar to humans, but similar in certain ways, let's say, but not exactly humans or all the way to a completely different distribution of creatures."}, {"time": 5561, "text": "What's the intuition?"}, {"time": 5562, "text": "Like if you were to bet money, what does that distribution look like if we ran Earth over and over and over again?"}, {"time": 5567, "text": "I would say given the, you're now asking me questions that."}, {"time": 5571, "text": "This is not science."}, {"time": 5573, "text": "But I would say, okay, well, what's the probability that it's gonna be a carbon life form?"}, {"time": 5579, "text": "Probably high."}, {"time": 5580, "text": "But that's because I don't know anything about really."}, {"time": 5583, "text": "Yeah, I'm not really well versed that."}, {"time": 5587, "text": "What's the probability that, so what's the probability that the animals will begin in the ocean and crawl out onto land?"}, {"time": 5594, "text": "Versus the other way."}, {"time": 5595, "text": "Versus the, I would say probably high."}, {"time": 5600, "text": "You know, but do I think what's the likelihood that we would end up with exactly the same or very similar?"}, {"time": 5606, "text": "I think it's low actually."}, {"time": 5608, "text": "I wouldn't say it's low, but I would say it's not 100%."}, {"time": 5612, "text": "And I'm not even sure it's 50%."}, {"time": 5614, "text": "You know, I would say, I don't think that we're here by accident because I think, like I said, there are constraints."}, {"time": 5621, "text": "Like there are some physical constraints about Earth."}, {"time": 5624, "text": "Now, of course, if you were a cosmologist, you could say, well, the fact that the Earth is, if you were to do the Big Bang over again and keep doing it over and over and over again, would you still get the same solar systems?"}, {"time": 5636, "text": "Would you still get the same planets?"}, {"time": 5638, "text": "Would, you know, would you still get the same galaxies, the same solar systems, the same planets?"}, {"time": 5642, "text": "You know, I don't know, but my guess is probably not because there are random things that happen that can, again, send things in one direct, you know, make one set of trajectories possible and another set impossible."}, {"time": 5655, "text": "So, but I guess my, if I were gonna bet money or something valuable, I would probably say, it's not zero and it's not 100% and it's probably not even 50%."}, {"time": 5673, "text": "So there's some probability, but I don't know."}, {"time": 5674, "text": "That it will be similar."}, {"time": 5675, "text": "That it will be similar, but I don't think, I just think there are too many degrees of freedom."}, {"time": 5680, "text": "There are too many degrees of freedom."}, {"time": 5682, "text": "I mean, one of the real tensions in writing this book is to, on the one hand, there's some truth in saying that humans are not special."}, {"time": 5697, "text": "We are just, you know, we're not special in the animal kingdom."}, {"time": 5703, "text": "All animals are well adapted."}, {"time": 5707, "text": "If they're survived, they're well adapted to their niche."}, {"time": 5711, "text": "It does happen to be the case that our niche is large."}, {"time": 5715, "text": "For any individual human, your niche is whatever it is."}, {"time": 5718, "text": "But for the species, right?"}, {"time": 5720, "text": "We live almost everywhere, not everywhere, but almost everywhere on the planet, but not in the ocean."}, {"time": 5728, "text": "And actually other animals like bacteria, for example, have us beat miles, you know, hands down, right?"}, {"time": 5735, "text": "So we're, by any definition, we're not special."}, {"time": 5743, "text": "We're just, you know, adapted to our environment."}, {"time": 5746, "text": "But bacteria don't have a podcast."}, {"time": 5750, "text": "And so that's the other, so that's the tension, right?"}, {"time": 5753, "text": "So on the one hand, you know, we're not special animals."}, {"time": 5755, "text": "We're just, you know, particularly well adapted to our niche."}, {"time": 5758, "text": "On the other hand, our niche is huge."}, {"time": 5760, "text": "And we, you know, we don't just adapt to our environment."}, {"time": 5763, "text": "We add to our environment."}, {"time": 5764, "text": "We make stuff up, give it a name, and then it becomes real."}, {"time": 5768, "text": "And so no other animal can do that."}, {"time": 5770, "text": "And so I think the thing, the way to think about it from my perspective or the way I made sense of it is to say, you can look at any individual single characteristic that a human has that seems remarkable."}, {"time": 5786, "text": "And you can find that in some other animal."}, {"time": 5790, "text": "What you can't find in any other animal is all of those characteristics together in a brain that is souped up in particular ways, like ours is."}, {"time": 5804, "text": "And if you combine these things, multiple interacting causes, right?"}, {"time": 5808, "text": "Not one essence, like your cortex, your big neocortex, but which isn't really that big."}, {"time": 5816, "text": "I mean, it's just big for your big brain, for the size of your big brain."}, {"time": 5821, "text": "It's the size it should be."}, {"time": 5824, "text": "If you add all those things together and they interact with each other, that produces some pretty remarkable results."}, {"time": 5830, "text": "And if you're aware of that, then you can start asking different kinds of questions about what it means to be human and what kind of a human you wanna be and what kind of a world do you wanna curate for the next generation of humans."}, {"time": 5851, "text": "I think that's the goal anyways, right?"}, {"time": 5853, "text": "Is just to have a glimpse of, instead of thinking about things in a simple linear way, just to have a glimpse of some of the things that matter, that evidence suggests matters to the kind of brain in the kind of bodies that we have."}, {"time": 5875, "text": "Once you know that, you can work with it a little bit."}, {"time": 5878, "text": "You write, words have power over your biology."}, {"time": 5882, "text": "Right now, I can text the words, I love you from the United States to my close friend in Belgium."}, {"time": 5888, "text": "And even though she cannot hear my voice or see my face, I will change her heart rate, her breathing and her metabolism."}, {"time": 5896, "text": "By the way, beautifully written."}, {"time": 5899, "text": "Or someone could text something ambiguous to you, like, is your door locked?"}, {"time": 5904, "text": "And odds are that it would affect your nervous system in an unpleasant way."}, {"time": 5909, "text": "So, I mean, there's a lot of stuff to talk about here, but just one way to ask is, why do you think words have so much power over our brain?"}, {"time": 5923, "text": "Well, I think we just have to look at the anatomy of the brain to answer that question."}, {"time": 5928, "text": "So, if you look at the parts of the brain, the systems that are important for processing language, you can see that some of these regions are also important for controlling your major organ systems."}, {"time": 5945, "text": "And like your autonomic nervous system, that controls your cardiovascular system, your respiratory system, and so on."}, {"time": 5952, "text": "That these regions control your endocrine system, your immune system, and so on."}, {"time": 5960, "text": "So, and you can actually see this in other animals too."}, {"time": 5962, "text": "So in birds, for example, the neurons that are responsible for birdsong also control the systems of a bird's body."}, {"time": 5970, "text": "And the reason why I bring that up is that the, there's some scientists think that the anatomy of a bird's brain that control birdsong are homologous or structurally have a similar origin to the human system for language."}, {"time": 5988, "text": "So, the parts of the brain that are important for processing language are not unique in, and specialized for language."}, {"time": 5997, "text": "They do many things."}, {"time": 5999, "text": "And one of the things they do is control your major organ systems."}, {"time": 6003, "text": "Do you think we can fall in love, I have arguments about this all the time."}, {"time": 6007, "text": "Do you think we can fall in love based on words alone?"}, {"time": 6010, "text": "Well, I think people have been doing it for centuries."}, {"time": 6014, "text": "I mean, maybe it used to be the case that people wrote letters to each other, you know, and then that was how they communicated."}, {"time": 6022, "text": "I guess that's how you and Dan got it."}, {"time": 6024, "text": "Exactly, exactly, exactly."}, {"time": 6028, "text": "So is the answer a clear yes there?"}, {"time": 6031, "text": "Because I get a lot of pushback from people often that you need the touch and the smell and, you know, the bodily stuff."}, {"time": 6042, "text": "I think the touch and the smell and the bodily stuff helps."}, {"time": 6046, "text": "But I don't think it's necessary."}, {"time": 6047, "text": "Do you think you can have a lifelong monogamous relationship with an AI system that only communicates with you on text, romantic relationship?"}, {"time": 6058, "text": "Well, I suppose that's an empirical question that hasn't been answered yet."}, {"time": 6062, "text": "But I guess what I would say is I don't think I could."}, {"time": 6070, "text": "Could any human?"}, {"time": 6072, "text": "Could the average human?"}, {"time": 6074, "text": "Could, you know, so if I, if I even, I wanna even modify that and say, I'm thinking now of Tom Hanks and the movie."}, {"time": 6091, "text": "Castaway?"}, {"time": 6091, "text": "Yeah, you know, with Wilson."}, {"time": 6094, "text": "I think if that was, if you had to make that work, if you had to make that work."}, {"time": 6099, "text": "With a volleyball, yeah."}, {"time": 6100, "text": "If you had to make it work, could you, could you, prediction and simulation, right?"}, {"time": 6105, "text": "So if you had to make it work, could you make it work?"}, {"time": 6109, "text": "Using simulation and, you know, your past experience, could you make it work?"}, {"time": 6116, "text": "Could you make it work?"}, {"time": 6117, "text": "You as a human, could you, could you like?"}, {"time": 6119, "text": "Could you have a relationship literally with an inanimate object and have it sustain you in the way that another human could?"}, {"time": 6128, "text": "Your life would probably be shorter because you wouldn't actually derive the body budgeting benefits from, right?"}, {"time": 6135, "text": "So we've talked about, you know, how your brain, its most important job is to control your body and you can describe that as your brain running a budget for your body and there are metaphorical, you know, deposits and withdrawals into your body budget and you also make deposits and withdrawals in other people's body budgets, figuratively speaking."}, {"time": 6160, "text": "So you wouldn't have that particular benefit."}, {"time": 6165, "text": "So your life would probably be shorter but I think it would be harder for some people than for other people."}, {"time": 6172, "text": "Yeah, I tend to, my intuition is that you can have a deep fulfilling relationship with a volleyball."}, {"time": 6179, "text": "I think, I think a lot of the, the environments that set up, I think that's a really good example."}, {"time": 6185, "text": "Like the constraints of your particular environment define the, like I believe like scarcity is a good catalyst for deep, meaningful connection with other humans and with inanimate objects."}, {"time": 6202, "text": "So the less you have, the more fulfilling those relationships are."}, {"time": 6205, "text": "And I would say a relationship with a volleyball, the sex is not great but everything else, I feel like it could be a very fulfilling relationship which I don't know from an engineering perspective what to do with that."}, {"time": 6218, "text": "And just like you said, it is an empirical question but."}, {"time": 6221, "text": "But there are places to learn about that, right?"}, {"time": 6223, "text": "So for example, think about children and their blankets."}, {"time": 6229, "text": "Right, so there, there's something tactile and there's something olfactory and it's very comforting."}, {"time": 6236, "text": "I mean, even for, even for nonhuman little animals, right?"}, {"time": 6240, "text": "Like puppies and so I don't know about cats but, but."}, {"time": 6244, "text": "Cats are cold hearted, there's no, there's nothing going on there."}, {"time": 6248, "text": "I don't know, there are some cats that are very doglike."}, {"time": 6252, "text": "I mean, really, so."}, {"time": 6254, "text": "Some cats identify as dogs, yes."}, {"time": 6255, "text": "I think that's true, yeah, they're species fluid."}, {"time": 6261, "text": "So you also write, when it comes to human minds, variation is the norm."}, {"time": 6268, "text": "And what we call quote, human nature is really many human natures."}, {"time": 6272, "text": "So again, many questions I can ask here."}, {"time": 6276, "text": "But maybe an interesting one to ask is I often hear, we often hear this idea of be yourself."}, {"time": 6285, "text": "Is this possible to be yourself?"}, {"time": 6288, "text": "Is it a good idea to strive to be yourself?"}, {"time": 6291, "text": "Is it, does that even have any meaning?"}, {"time": 6294, "text": "It's a very Western question, first of all, because which self are you talking about?"}, {"time": 6300, "text": "You don't have one self."}, {"time": 6301, "text": "There is no self that's an essence of you."}, {"time": 6304, "text": "You have multiple selves."}, {"time": 6305, "text": "Actually, there is research on this."}, {"time": 6309, "text": "To quote the great social psychologist, Hazel Marcus, you're never, you cannot be a self by yourself."}, {"time": 6318, "text": "And so different contexts pull for or draw on different features of who you are or what you believe, what you feel, what your actions are."}, {"time": 6332, "text": "A different context will put certain things, make some features be more in the foreground and some in the background."}, {"time": 6339, "text": "It takes us back right to our discussion earlier about Stalin and Hitler and so on."}, {"time": 6346, "text": "The thing that I would caution, in addition to the fact that there is no single self, that you have multiple selves, who you can be, and you can certainly choose the situations that you put yourself in to some extent."}, {"time": 6361, "text": "Not everybody has complete choice, but everybody has a little bit of choice."}, {"time": 6364, "text": "And I think I said this to you before, that one of the pieces of advice that we gave Sophia when she went, our daughter, when she was going off to college, was try to spend time around people, choose relationships that allow you to be your best self."}, {"time": 6381, "text": "We should have said your best selves, but, you know."}, {"time": 6388, "text": "The pool of selves given the environment."}, {"time": 6391, "text": "Yeah, but the one thing I do wanna say is that the risk of saying be yourself, just be yourself, is that that can be used as an excuse."}, {"time": 6402, "text": "Well, this is just the way that I am, I'm just like this."}, {"time": 6405, "text": "And that, I think, should be tremendously resisted."}, {"time": 6411, "text": "So that's one, that's for the excuse side, but, you know, I'm really self critical often, I'm full of doubt, and people often tell me, just don't worry about it, just be yourself, man."}, {"time": 6424, "text": "And it's, the thing is, it almost, it's not, from an engineering perspective, does not seem like actionable advice."}, {"time": 6432, "text": "Because, I guess, constantly worrying about who, what are the right words to say to express how I'm feeling is, I guess, myself."}, {"time": 6450, "text": "There's a kind of line, I guess, that this might be a Western idea, but something that feels genuine and something that feels non genuine."}, {"time": 6459, "text": "And I'm not sure what that means, because I would like to be fully genuine and fully open, but I'm also aware, like this morning, I was very silly and giddy, I was like, this is just being funny and relaxed and light, like there's nothing that could bother me in the world, I was just smiling and happy."}, {"time": 6482, "text": "And then I remember last night, was just feeling very grumpy, like stuff was bothering me."}, {"time": 6489, "text": "Like certain things were bothering me."}, {"time": 6490, "text": "And like, what are those?"}, {"time": 6492, "text": "Are those different selves?"}, {"time": 6494, "text": "Like what, who am I in that?"}, {"time": 6496, "text": "And what do I do?"}, {"time": 6497, "text": "Because if we take Twitter as an example, if I actually send a tweet last night and a tweet this morning, it's gonna be very two different people tweeting that."}, {"time": 6508, "text": "And I don't know what to do with that, because one does seem to be more me than the other, but that's maybe because there's a story that I'm trying, there's something I'm striving to be, like the ultimate human that I might become, I have maybe a vision of that, and I'm trying to become that."}, {"time": 6526, "text": "But it does seem like there's a lot of different minds in there."}, {"time": 6531, "text": "And they're all like having a discussion and a battle for who's gonna win."}, {"time": 6536, "text": "I suppose you could think of it that way, but there's another way to think of it, I think, and that is that maybe the more Buddhist way to think of it, right, or a more contemplative way to think about it, which is not that you have multiple personalities inside your head, but you have, your brain has this amazing capacity."}, {"time": 6558, "text": "It has a population of experiences that you've had that it can regenerate, reconstitute."}, {"time": 6567, "text": "And it can even take bits and pieces of those experiences and combine them into something new."}, {"time": 6575, "text": "And it's often doing this to predict what's going to happen next and to plan your actions, but it's also happening, this also happens just, that's what mind wandering is, or just internal thought and so on."}, {"time": 6590, "text": "It's the same mechanism, really."}, {"time": 6592, "text": "And so a lot of times we hear the saying, just think, if you think differently, you'll feel differently."}, {"time": 6630, "text": "So in some ways, you could also say, the way that you feel, I think we talked before about affective feeling or mood, coming from the sensations of body budgeting, influences what you think."}, {"time": 6650, "text": "And as much as, so feelings influence thought, as much as thought influence feeling, and maybe more."}, {"time": 6658, "text": "But just the whole thing doesn't seem stable."}, {"time": 6661, "text": "Well, it's a dynamic system, Mr."}, {"time": 6661, "text": "Engineer, right?"}, {"time": 6665, "text": "It's a dynamic, it's a dynamical system, right?"}, {"time": 6667, "text": "Nonlinear dynamical system."}, {"time": 6669, "text": "And I think that's, I'm actually writing a paper with a bunch of engineers about this actually."}, {"time": 6674, "text": "But I mean, other people have talked about the brain as a dynamical system before, but the real tricky bit is trying to figure out how do you get mental features out of that system?"}, {"time": 6684, "text": "I guess one thing to figure out how you get a motor movement out of that system, it's another thing to figure out how you get a mental feature, like a feeling of being loved or a feeling of being worthwhile, or a feeling of just basically feeling like shit."}, {"time": 6698, "text": "How do you get a feeling, a mental features out of that system?"}, {"time": 6703, "text": "So what I would say is that you aren't, the Buddhist thing to say is that you're not one person and you're not many people."}, {"time": 6712, "text": "You are the sum of your experiences and who you are in any given moment, meaning what your actions will be, is influenced by the state of your body and the state of the world that you've put yourself in."}, {"time": 6730, "text": "And you can change either of those things."}, {"time": 6732, "text": "One is a little easier to change than the other, right?"}, {"time": 6735, "text": "You can change your environment by literally getting up and moving, or you can change it by paying attention to some things differently and letting some features come to the fore and other features be backgrounded."}, {"time": 6748, "text": "Like I'm looking around your place."}, {"time": 6750, "text": "Oh no, this is not something you should do."}, {"time": 6752, "text": "No, but I'm gonna say one thing."}, {"time": 6754, "text": "No green plants, no green plants."}, {"time": 6759, "text": "Because green plants mean a home and I want this to be temporary."}, {"time": 6763, "text": "Fair, fair, but."}, {"time": 6765, "text": "What goes to your mind when you see no green plants?"}, {"time": 6768, "text": "No, I'm just making the point that what if you, again, not everybody has control over their environment."}, {"time": 6779, "text": "Some people don't have control over the noise or the temperature or any of those things."}, {"time": 6784, "text": "But everybody has a little bit of control and you can place things in your environment, photographs, plants, anything that's meaningful to you and use it as a shift of environment when you need it."}, {"time": 6799, "text": "You can also do things to change the conditions of your body."}, {"time": 6804, "text": "When you exercise every day, you're making an investment in your body."}, {"time": 6808, "text": "Actually, you're making an investment in your brain too."}, {"time": 6811, "text": "It makes you, even though it's unpleasant and there's a cost to it, if you replenish, if you invest and you make up that, you make a deposit and you make up what you've spent, you're basically making an investment in making it easier for your brain to control your body in the future."}, {"time": 6831, "text": "So you can make sure you're hydrated."}, {"time": 6834, "text": "Drink water."}, {"time": 6835, "text": "You don't have to drink bottled water."}, {"time": 6837, "text": "You can drink water from the tap."}, {"time": 6838, "text": "This is in most places, maybe not everywhere, but most places in the developed world."}, {"time": 6846, "text": "You can try to get enough sleep."}, {"time": 6849, "text": "Not everybody has that luxury, but everybody can do something to make their body budgets a little more solvent."}, {"time": 6857, "text": "And that will also make it more likely that certain thoughts will emerge from that prediction machine, basically."}, {"time": 6867, "text": "That's the control you do have, is being able to control the environment."}, {"time": 6874, "text": "I don't think we've talked about this, so let's go to the biggest unanswerable questions of consciousness."}, {"time": 6881, "text": "What is, you just rolled your eyes."}, {"time": 6883, "text": "I did, that was my, yeah."}, {"time": 6885, "text": "So what is consciousness from a neuroscience perspective?"}, {"time": 6889, "text": "I know you, I mean."}, {"time": 6892, "text": "I made notes, you know, because you gave me some questions in advance and I made notes for every single."}, {"time": 6898, "text": "Oh, except that one?"}, {"time": 6898, "text": "Yeah, well that one I had, what the fuck?"}, {"time": 6901, "text": "And then I took it out."}, {"time": 6904, "text": "So is there something interesting, because you're so pragmatic."}, {"time": 6907, "text": "Is there something interesting to say about intuition building about consciousness?"}, {"time": 6913, "text": "Or is this something that we're just totally clueless about that this is, let's focus on the body, the brain listens to the body, the body speaks to the brain, and let's just figure this piece out, and then consciousness will probably emerge somehow after that."}, {"time": 6930, "text": "No, I think, you know, well, first of all, I'll just say up front, I am not a philosopher of consciousness and I'm not a neuroscientist who focuses on consciousness."}, {"time": 6940, "text": "I mean, in some sense, I do study it because I study affect and mood."}, {"time": 6944, "text": "And that is the, you know, to use the phrase, that is the hard question of consciousness."}, {"time": 6954, "text": "How is it that your brain is modeling your body?"}, {"time": 6957, "text": "Brain is modeling the sensory conditions of your body."}, {"time": 6962, "text": "And it's being updated, that model is being updated by the sense data that's coming from your body and it's happening continuously your whole life."}, {"time": 6971, "text": "And you don't feel those sensations directly."}, {"time": 6975, "text": "What you feel is a general sense of pleasantness or unpleasantness, comfort, discomfort, feeling worked up, feeling calm."}, {"time": 6982, "text": "So we call that affect, you know, most people call it mood."}, {"time": 6986, "text": "So how is it that your brain gives you this very low dimensional feeling of mood or affect when it's presumably receiving a very high dimensional array of sense data?"}, {"time": 6999, "text": "And the model that the brain is running of the body has to be high dimensional because there's a lot going on in there, right?"}, {"time": 7007, "text": "You're not aware, but as you're sitting there quietly, as your listeners or as our viewers are sitting."}, {"time": 7014, "text": "They might be working out, running now, or as many of them write to me."}, {"time": 7018, "text": "They're laying in bed, smoking weed with their eyes closed."}, {"time": 7021, "text": "That's fair, so maybe we should say that bit again then."}, {"time": 7025, "text": "So if, so some people may be working out, some people may be, you know, relaxing."}, {"time": 7031, "text": "But you know, even if you're sitting very still while you're watching this or listening to this, there's a whole drama going on inside your body that you're largely unaware of."}, {"time": 7041, "text": "Yet your brain makes you aware or gives you a status report in a sense by virtue of these mental features of feeling pleasant, feeling unpleasant, feeling comfortable, feeling uncomfortable, feeling energetic, feeling tired and so on."}, {"time": 7058, "text": "And so how the hell is it doing that?"}, {"time": 7061, "text": "That is the basic question of consciousness."}, {"time": 7066, "text": "And like the status reports seem to be, in the way we experience them, seem to be quite simple."}, {"time": 7072, "text": "Like it doesn't feel like there's a lot of data."}, {"time": 7076, "text": "Yeah, no, there isn't."}, {"time": 7077, "text": "So when you feel, when you feel discomfort, when you're feeling basically like shit, you feel like shit, what does that tell you?"}, {"time": 7086, "text": "Like, what are you supposed to do next?"}, {"time": 7088, "text": "What caused it?"}, {"time": 7089, "text": "I mean, the thing is not one thing caused it, right?"}, {"time": 7092, "text": "It's multiple factors probably influencing your physical state."}, {"time": 7096, "text": "Your body budget."}, {"time": 7097, "text": "It's very high dimensional, yeah."}, {"time": 7098, "text": "It's very high dimensional."}, {"time": 7100, "text": "And there are different temporal scales of influence, right?"}, {"time": 7108, "text": "So the state of your gut is not just influenced by what you ate five minutes ago."}, {"time": 7114, "text": "It's also what you ate a day ago and two days ago and so on."}, {"time": 7118, "text": "So I think the, you know, when I'm, I'm not trying to weasel out of the question, I just think it's the hardest question actually."}, {"time": 7135, "text": "Do you think we'll ever understand it as scientists?"}, {"time": 7143, "text": "I think that we will understand it as well as we understand other things like the birth of the universe or the, you know, the nature of the universe, I guess I would say."}, {"time": 7158, "text": "So do I think we can get to that level of an explanation?"}, {"time": 7161, "text": "I do actually, but I think that we have to start asking somewhat different questions and approaching the science somewhat differently than we have in the past."}, {"time": 7170, "text": "I mean, it's also possible that consciousness is much more difficult to understand than the nature of the universe."}, {"time": 7175, "text": "It is, but I wasn't necessarily saying that it was a question that was of equivalent complexity."}, {"time": 7180, "text": "I was saying that I do think that we could get to some, I am optimistic that I would not, I would be very willing to invest the time, my time on this earth as a scientist in trying to answer that question if I could do it the way that I wanna do it, not in the way that it's currently being done."}, {"time": 7204, "text": "So like rigorously?"}, {"time": 7205, "text": "I don't wanna say unrigorously."}, {"time": 7206, "text": "I just wanna say that there are certain set of assumptions that, you know, scientists have what I would call ontological commitments."}, {"time": 7213, "text": "They're commitments about the way the world is or the way that nature is."}, {"time": 7218, "text": "And these commitments lead scientists sometimes blindly without, they don't, scientists sometimes, sometimes scientists are aware of these commitments, but sometimes they're not."}, {"time": 7228, "text": "And these commitments on the list influence how scientists ask questions, what they measure, how they measure, and I just have very different views than a lot of my colleagues about the ways to approach this."}, {"time": 7243, "text": "Not everybody, but the way that I would approach it would be different and it would cost more and it would take longer."}, {"time": 7252, "text": "It doesn't fit very well into the current incentive structure of science."}, {"time": 7256, "text": "And so do I think that doing science the way science is currently done with the budget that it currently has and the incentive structure that it currently has will we have an answer?"}, {"time": 7265, "text": "No, I think absolutely not."}, {"time": 7266, "text": "Good luck is what I would say."}, {"time": 7269, "text": "People love book recommendations."}, {"time": 7272, "text": "Let me ask what three books."}, {"time": 7274, "text": "Oh, you can't just like, you can't just give me three."}, {"time": 7277, "text": "I mean, like really three?"}, {"time": 7278, "text": "What seven and a half books you can recommend."}, {"time": 7282, "text": "So you're also the author of seven and a half lessons about the brain."}, {"time": 7286, "text": "You're a author of how emotions are made."}, {"time": 7289, "text": "Okay, so definitely those are the top two recommendations of all, the two greatest books of all time."}, {"time": 7295, "text": "Other than that, are there books that technical, fiction, philosophical that you've enjoyed or you might recommend to others?"}, {"time": 7302, "text": "Yes, actually, you know, every PhD student when they graduate with their PhD, I give them a set, like a little library, like a set of books, you know, some of which they've already read, some of which I want them to read or, but I think nonfiction books, I would read, the things I would recommend are The Triple Helix by Richard Lewontin."}, {"time": 7330, "text": "It's a little book published in 2000, which is, I think, a really good introduction to complexity and population thinking as opposed to essentialism."}, {"time": 7345, "text": "So this idea, essentialism is this idea that, you know, there's an essence to each person, whether it's a soul or your genes or what have you, as opposed to this idea that you, we have the kind of nature that requires a nurture."}, {"time": 7358, "text": "We are, we are, you are the product of a complex dance between an environment, between a set of genes and an environment that turns those genes on and off to produce your brain and your body and really who you are at any given moment."}, {"time": 7376, "text": "It's a good title for that, Triple Helix."}, {"time": 7379, "text": "So playing on the double helix where it's just the biology, it's bigger than the biology."}, {"time": 7385, "text": "It's a wonderful book."}, {"time": 7386, "text": "I've read it probably six or seven times throughout the year."}, {"time": 7389, "text": "He has another book too, which is, it's more, I think scientists would find it, I don't know, I've loved it."}, {"time": 7395, "text": "It's called Biology as Ideology."}, {"time": 7398, "text": "And it really is all about, I wouldn't call it one of the best books of all time, but I love the book because it really does point out, you know, that science is its currently practice."}, {"time": 7411, "text": "I mean, the book was written in 1991, but it actually, I think, still holds, that science is a currently practice, has a set of ontological commitments, which are somewhat problematic."}, {"time": 7421, "text": "So the assumptions are limiting."}, {"time": 7423, "text": "Yeah, in ways that you, it's, you know, it's like you're a fish in water and you don't, like, okay, so, yeah, so here's the."}, {"time": 7429, "text": "David Foster Wallace, that stuff."}, {"time": 7430, "text": "Yeah, but, you know, but here's a really cool thing I just learned recently."}, {"time": 7435, "text": "Is it okay to go off on this tangent for a minute?"}, {"time": 7437, "text": "Yeah, yeah, let's go tangents, great."}, {"time": 7440, "text": "I was just gonna say that I just learned recently that we don't have water receptors on our skin."}, {"time": 7446, "text": "So how do you know when you're sweating?"}, {"time": 7447, "text": "How do you know when a raindrop, when, you know, when it's gonna rain and, you know, like a raindrop hits your skin and you can feel that little drop of wetness."}, {"time": 7456, "text": "How is it that you feel that drop of wetness when we don't have water receptors in our skin?"}, {"time": 7462, "text": "And I was, when I."}, {"time": 7463, "text": "My mind's blown already."}, {"time": 7464, "text": "Yeah, that was, I have my reaction too, right?"}, {"time": 7467, "text": "I was like, of course we don't because we evolved in the water."}, {"time": 7471, "text": "Like, why would we need, you know, it just, it was just this like, you know, you have these moments where you're like, oh, of course, there's like a, yeah, so."}, {"time": 7478, "text": "You'll never see rain the same way again."}, {"time": 7480, "text": "So the answer is it's a combination of temperature and touch, but it's a complex sense that's only computed in your brain."}, {"time": 7492, "text": "There's no receptor for it."}, {"time": 7495, "text": "Yeah, that's why like snow versus cold rain versus warm rain all feel different because you're trying to infer stuff from the temperature and the size of the droplets is fascinating."}, {"time": 7505, "text": "Yeah, your brain is a prediction machine."}, {"time": 7507, "text": "It's using lots and lots of information and combining it."}, {"time": 7511, "text": "You know, anyway, so."}, {"time": 7512, "text": "But so biology is ideology is, I wouldn't say it's one of the greatest books of all time, but it is a really useful book."}, {"time": 7522, "text": "There's a book by, if you're interested in psychology or the mind at all, there's a wonderful book, a little, it's a fairly small book called Naming the Mind by Kurt Danziger, who's a historian of psychology."}, {"time": 7538, "text": "Everybody in my lab reads both of these books."}, {"time": 7542, "text": "So what's the book?"}, {"time": 7543, "text": "It's about the origin of the, where did we get the theory of mind that we have that the human mind is populated by thoughts and feelings and perceptions and where did those categories come from?"}, {"time": 7557, "text": "Because they don't exist in all cultures."}, {"time": 7561, "text": "Oh, so this isn't, that's a cultural construct?"}, {"time": 7565, "text": "The idea that you have thoughts and feelings and they're very distinct is definitely a cultural construct."}, {"time": 7571, "text": "That's another mind blowing thing, just like the rain."}, {"time": 7576, "text": "So Kurt Danziger is a, the opening chapter in that book is absolutely mind blowing."}, {"time": 7586, "text": "I love it, I love it."}, {"time": 7589, "text": "I just think it's fantastic."}, {"time": 7592, "text": "And I would say that there are many, many popular science books that I could recommend that I think are extremely well written in their own way."}, {"time": 7602, "text": "You know, before I, maybe I said this to you, but before I undertook writing How Emotions Are Made, I read, I don't know, somewhere on the order of 50 or 60 popular science books to try to figure out how to write a popular science book."}, {"time": 7620, "text": "Because while there are many books about writing, Stephen King has a great book about writing."}, {"time": 7627, "text": "And, you know, where he gives tips interlaced with his own personal history."}, {"time": 7634, "text": "That was where I learned you write for a specific person."}, {"time": 7637, "text": "You have a specific person in mind."}, {"time": 7639, "text": "And that's, for me, that person is Dan."}, {"time": 7643, "text": "I mean, that's a whole nother conversation to have like which popular science books, like what you learned from that search."}, {"time": 7651, "text": "Because there's, I have some, for me, some popular science books that like I just roll my eyes, like this is too, it's the same with TED Talks."}, {"time": 7661, "text": "Like some of them go too much into the flowery and don't, I would say don't give enough respect to the intelligence of the reader."}, {"time": 7671, "text": "And, but that's, this is my own bias very specifically."}, {"time": 7675, "text": "I completely agree with you."}, {"time": 7676, "text": "And in fact, I have a colleague, his name is Van Yang, who, you know, he produced a cinematic lecture of how emotions are made that we wrote together with Joseph Fridman, no relation."}, {"time": 7694, "text": "Well, we're all related."}, {"time": 7696, "text": "Well, I mean, you and I are probably, you know, have some, yeah."}, {"time": 7700, "text": "It's the memories are in there somewhere."}, {"time": 7702, "text": "Yeah, it's from many, many, many generations ago."}, {"time": 7706, "text": "Well, half my family is Russian, so from."}, {"time": 7708, "text": "The good half."}, {"time": 7709, "text": "The good half, right."}, {"time": 7711, "text": "But, you know, he, his goal actually is to produce, you know, videos and lectures that are beautiful and educational and that don't dumb the material down."}, {"time": 7736, "text": "And he's really remarkable at it actually."}, {"time": 7739, "text": "I mean, just, but again, you know, that requires a bit of a paradigm shift."}, {"time": 7744, "text": "We could have a whole conversation about the split between entertainment and education in this country and why it is the way it is, but that's another conversation."}, {"time": 7753, "text": "To be continued."}, {"time": 7754, "text": "But I would say if I were to pick one book that I think is a really good example of good science writing, it would be The Beak of the Finch."}, {"time": 7763, "text": "Which won a Pulitzer Prize a number of years ago."}, {"time": 7770, "text": "And I'm not, I'm not remembering the author's name."}, {"time": 7774, "text": "I'm blanking."}, {"time": 7775, "text": "But the, I'm guessing, is it focusing on birds and the evolution of birds?"}, {"time": 7782, "text": "Actually, there's also The Evolution of Beauty, which is, yeah, which is also a great book."}, {"time": 7788, "text": "But no, The Beak of the Finch is, it's a, it has two storylines that are interwoven."}, {"time": 7796, "text": "One is about Darwin and Darwin's explorations in the Galapagos Island."}, {"time": 7804, "text": "And then modern day researchers from Princeton who have a research program in the Galapagos looking at Darwin's finches."}, {"time": 7813, "text": "And it's just a really, first of all, there's top notch science in there."}, {"time": 7821, "text": "And really science, like evolutionary biology that a lot of people don't know."}]}]