[{"title": "Daniel Kahneman: Thinking Fast and Slow, Deep Learning, and AI | Lex Fridman Podcast #65", "id": "UwwBG-MbniY", "quotes": [{"time": 332, "text": "The loyalty and affection towards in group and the willingness to dehumanize the out group, that is in human nature."}, {"time": 350, "text": "That's what I think probably didn't need the Holocaust to teach us that."}, {"time": 350, "text": "But the Holocaust is a very sharp lesson of what can happen to people and what people can do."}, {"time": 365, "text": "So the effect of the in group and the out group."}, {"time": 365, "text": "IA It's clear."}, {"time": 365, "text": "Those were people, you could shoot them."}, {"time": 373, "text": "They were not human."}, {"time": 373, "text": "There was no empathy, or very, very little empathy left."}, {"time": 383, "text": "So occasionally, there might have been."}, {"time": 383, "text": "And very quickly, by the way, the empathy disappeared, if there was initially."}, {"time": 392, "text": "And the fact that everybody around you was doing it, that completely, the group doing it, and everybody shooting Jews, I think that makes it permissible."}, {"time": 411, "text": "Now, how much, whether it could happen in every culture, or whether the Germans were just particularly efficient and disciplined, so they could get away with it."}, {"time": 421, "text": "It's an interesting question."}, {"time": 430, "text": "Are these artifacts of history or is it human nature?"}, {"time": 430, "text": "IA I think that's really human nature."}, {"time": 435, "text": "You put some people in a position of power relative to other people, and then they become less human, they become different."}, {"time": 444, "text": "But in general, in war, outside of concentration camps in World War Two, it seems that war brings out darker sides of human nature, but also the beautiful things about human nature."}, {"time": 459, "text": "IA Well, I mean, what it brings out is the loyalty among soldiers."}, {"time": 459, "text": "I mean, it brings out the bonding, male bonding, I think is a very real thing that happens."}, {"time": 469, "text": "And there is a certain thrill to friendship, and there is certainly a certain thrill to friendship under risk and to shared risk."}, {"time": 483, "text": "And so people have very profound emotions, up to the point where it gets so traumatic that little is left."}, {"time": 492, "text": "So let's talk about psychology a little bit."}, {"time": 492, "text": "In your book, Thinking Fast and Slow, you describe two modes of thought, system one, the fast and instinctive, and emotional one, and system two, the slower, deliberate, logical one."}, {"time": 511, "text": "At the risk of asking Darwin to discuss theory of evolution, can you describe distinguishing characteristics for people who have not read your book of the two systems?"}, {"time": 526, "text": "IA Well, I mean, the word system is a bit misleading, but at the same time it's misleading, it's also very useful."}, {"time": 532, "text": "But what I call system one, it's easier to think of it as a family of activities."}, {"time": 541, "text": "And primarily, the way I describe it is there are different ways for ideas to come to mind."}, {"time": 549, "text": "And some ideas come to mind automatically, and the standard example is two plus two, and then something happens to you."}, {"time": 557, "text": "And in other cases, you've got to do something, you've got to work in order to produce the idea."}, {"time": 566, "text": "And my example, I always give the same pair of numbers as 27 times 14, I think."}, {"time": 572, "text": "You have to perform some algorithm in your head, some steps."}, {"time": 578, "text": "IA Yes, and it takes time."}, {"time": 578, "text": "It's a very difference."}, {"time": 578, "text": "Nothing comes to mind except something comes to mind, which is the algorithm, I mean, that you've got to perform."}, {"time": 590, "text": "And then it's work, and it engages short term memory, it engages executive function, and it makes you incapable of doing other things at the same time."}, {"time": 598, "text": "So the main characteristic of system two is that there is mental effort involved, and there is a limited capacity for mental effort, whereas system one is effortless, essentially."}, {"time": 610, "text": "That's the major distinction."}, {"time": 615, "text": "So you talk about there, you know, it's really convenient to talk about two systems, but you also mentioned just now and in general that there's no distinct two systems in the brain from a neurobiological, even from a psychology perspective."}, {"time": 629, "text": "But why does it seem to, from the experiments you've conducted, there does seem to be kind of emergent two modes of thinking?"}, {"time": 636, "text": "So at some point, these kinds of systems came into a brain architecture."}, {"time": 647, "text": "Maybe mammals share it."}, {"time": 657, "text": "Or do you not think of it at all in those terms that it's all a mush and these two things just emerge?"}, {"time": 661, "text": "Evolutionary theorizing about this is cheap and easy."}, {"time": 661, "text": "So it's the way I think about it is that it's very clear that animals have perceptual system, and that includes an ability to understand the world, at least to the extent that they can predict, they can't explain anything, but they can anticipate what's going to happen."}, {"time": 687, "text": "And that's a key form of understanding the world."}, {"time": 694, "text": "And my crude idea is that what I call system two, well, system two grew out of this."}, {"time": 705, "text": "And, you know, there is language and there is the capacity of manipulating ideas and the capacity of imagining futures and of imagining counterfactual things that haven't happened and to do conditional thinking."}, {"time": 718, "text": "And there are really a lot of abilities that without language and without the very large brain that we have compared to others would be impossible."}, {"time": 726, "text": "Now, system one is more like what the animals are, but system one also can talk."}, {"time": 733, "text": "I mean, it has language."}, {"time": 740, "text": "It understands language."}, {"time": 740, "text": "Indeed, it speaks for us."}, {"time": 740, "text": "I mean, you know, I'm not choosing every word as a deliberate process."}, {"time": 746, "text": "The words, I have some idea and then the words come out and that's automatic and effortless."}, {"time": 752, "text": "And many of the experiments you've done is to show that, listen, system one exists and it does speak for us and we should be careful about the voice it provides."}, {"time": 764, "text": "Well, I mean, you know, we have to trust it because it's the speed at which it acts."}, {"time": 775, "text": "System two, if we're dependent on system two for survival, we wouldn't survive very long because it's very slow."}, {"time": 781, "text": "Crossing the street."}, {"time": 786, "text": "I mean, many things depend on their being automatic."}, {"time": 786, "text": "One very important aspect of system one is that it's not instinctive."}, {"time": 792, "text": "You use the word instinctive."}, {"time": 792, "text": "It contains skills that clearly have been learned."}, {"time": 800, "text": "So that skilled behavior like driving a car or speaking, in fact, skilled behavior has to be learned."}, {"time": 808, "text": "And so it doesn't, you know, you don't come equipped with driving."}, {"time": 815, "text": "You have to learn how to drive and you have to go through a period where driving is not automatic before it becomes automatic."}, {"time": 821, "text": "You construct, I mean, this is where you talk about heuristic and biases is you, to make it automatic, you create a pattern and then system one essentially matches a new experience against the previously seen pattern."}, {"time": 837, "text": "And when that match is not a good one, that's when the cognitive, all the mess happens, but it's most of the time it works."}, {"time": 848, "text": "And so it's pretty."}, {"time": 848, "text": "Most of the time, the anticipation of what's going to happen next is correct."}, {"time": 853, "text": "And most of the time the plan about what you have to do is correct."}, {"time": 853, "text": "And so most of the time everything works just fine."}, {"time": 862, "text": "What's interesting actually is that in some sense, system one is much better at what it does than system two is at what it does."}, {"time": 869, "text": "That is there is that quality of effortlessly solving enormously complicated problems, which clearly exists so that the chess player, a very good chess player, all the moves that come to their mind are strong moves."}, {"time": 892, "text": "So all the selection of strong moves happens unconsciously and automatically and very, very fast."}, {"time": 898, "text": "And all that is in system one."}, {"time": 898, "text": "So system two verifies."}, {"time": 907, "text": "So along this line of thinking, really what we are are machines that construct a pretty effective system one."}, {"time": 912, "text": "You could think of it that way."}, {"time": 912, "text": "So we're not talking about humans, but if we think about building artificial intelligence systems, robots, do you think all the features and bugs that you have highlighted in human beings are useful for constructing AI systems?"}, {"time": 932, "text": "So both systems are useful for perhaps instilling in robots?"}, {"time": 939, "text": "What is happening these days is that actually what is happening in deep learning is more like a system one product than like a system two product."}, {"time": 950, "text": "I mean, deep learning matches patterns and anticipate what's going to happen."}, {"time": 957, "text": "So it's highly predictive."}, {"time": 957, "text": "What deep learning doesn't have and many people think that this is the critical, it doesn't have the ability to reason."}, {"time": 972, "text": "So there is no system two there."}, {"time": 972, "text": "But I think very importantly, it doesn't have any causality or any way to represent meaning and to represent real interactions."}, {"time": 979, "text": "So until that is solved, what can be accomplished is marvelous and very exciting, but limited."}, {"time": 995, "text": "That's actually really nice to think of current advances in machine learning as essentially system one advances."}, {"time": 1000, "text": "So how far can we get with just system one?"}, {"time": 1000, "text": "If we think of deep learning in artificial intelligence systems?"}, {"time": 1006, "text": "I mean, you know, it's very clear that deep mind has already gone way beyond what people thought was possible."}, {"time": 1012, "text": "I think the thing that has impressed me most about the developments in AI is the speed."}, {"time": 1020, "text": "It's that things, at least in the context of deep learning, and maybe this is about to slow down, but things moved a lot faster than anticipated."}, {"time": 1034, "text": "The transition from solving chess to solving Go, that's bewildering how quickly it went."}, {"time": 1045, "text": "The move from Alpha Go to Alpha Zero is sort of bewildering the speed at which they accomplished that."}, {"time": 1051, "text": "Now, clearly, there are many problems that you can solve that way, but there are some problems for which you need something else."}, {"time": 1061, "text": "Something like reasoning."}, {"time": 1065, "text": "Well, reasoning and also, you know, one of the real mysteries, psychologist Gary Marcus, who is also a critic of AI."}, {"time": 1074, "text": "I mean, what he points out, and I think he has a point, is that humans learn quickly."}, {"time": 1085, "text": "Children don't need a million examples, they need two or three examples."}, {"time": 1085, "text": "So, clearly, there is a fundamental difference."}, {"time": 1096, "text": "And what enables a machine to learn quickly, what you have to build into the machine, because it's clear that you have to build some expectations or or something in the machine to make it ready to learn quickly."}, {"time": 1110, "text": "That at the moment seems to be unsolved."}, {"time": 1118, "text": "I'm pretty sure that DeepMind is working on it, but if they have solved it, I haven't heard yet."}, {"time": 1127, "text": "They're trying to actually, them and OpenAI are trying to start to get to use neural networks to reason."}, {"time": 1134, "text": "So, assemble knowledge."}, {"time": 1134, "text": "Of course, causality is, temporal causality, is out of reach to most everybody."}, {"time": 1142, "text": "You mentioned the benefits of System 1 is essentially that it's fast, allows us to function in the world."}, {"time": 1150, "text": "Fast and skilled, yeah."}, {"time": 1153, "text": "It's skill."}, {"time": 1153, "text": "And it has a model of the world."}, {"time": 1153, "text": "You know, in a sense, I mean, there was the early phase of AI attempted to model reasoning."}, {"time": 1159, "text": "And they were moderately successful, but, you know, reasoning by itself doesn't get you much."}, {"time": 1169, "text": "Deep learning has been much more successful in terms of, you know, what they can do."}, {"time": 1177, "text": "But now, it's an interesting question, whether it's approaching its limits."}, {"time": 1184, "text": "I think absolutely."}, {"time": 1184, "text": "So, I just talked to Gian LeCun."}, {"time": 1184, "text": "He mentioned, you know, so he thinks that the limits, we're not going to hit the limits with neural networks, that ultimately, this kind of System 1 pattern matching will start to look like System 2 without significant transformation of the architecture."}, {"time": 1206, "text": "So, I'm more with the majority of the people who think that, yes, neural networks will hit a limit in their capability."}, {"time": 1216, "text": "He, on the one hand, I have heard him tell them it's a sub, it's essentially that, you know, what they have accomplished is not a big deal, that they have just touched, that basically, you know, they can't do unsupervised learning in an effective way."}, {"time": 1228, "text": "But you're telling me that he thinks that the current, within the current architecture, you can do causality and reasoning?"}, {"time": 1241, "text": "So, he's very much a pragmatist in a sense that's saying that we're very far away, that there's still, I think there's this idea that he says is, we can only see one or two mountain peaks ahead and there might be either a few more after or thousands more after."}, {"time": 1259, "text": "Yeah, so that kind of idea."}, {"time": 1261, "text": "I heard that metaphor."}, {"time": 1263, "text": "But nevertheless, it doesn't see the final answer not fundamentally looking like one that we currently have."}, {"time": 1273, "text": "So, neural networks being a huge part of that."}, {"time": 1278, "text": "Yeah, I mean, that's very likely because pattern matching is so much of what's going on."}, {"time": 1286, "text": "And you can think of neural networks as processing information sequentially."}, {"time": 1290, "text": "Yeah, I mean, you know, there is an important aspect to, for example, you get systems that translate and they do a very good job, but they really don't know what they're talking about."}, {"time": 1305, "text": "And for that, I'm really quite surprised."}, {"time": 1305, "text": "For that, you would need an AI that has sensation, an AI that is in touch with the world."}, {"time": 1318, "text": "Yes, self awareness and maybe even something resembles consciousness kind of ideas."}, {"time": 1324, "text": "Certainly awareness of, you know, awareness of what's going on so that the words have meaning or can get, are in touch with some perception or some action."}, {"time": 1336, "text": "Yeah, so that's a big thing for Jan and as what he refers to as grounding to the physical space."}, {"time": 1343, "text": "So that's what we're talking about the same thing."}, {"time": 1346, "text": "Yeah, so how do you ground?"}, {"time": 1349, "text": "I mean, the grounding, without grounding, then you get a machine that doesn't know what it's talking about because it is talking about the world ultimately."}, {"time": 1360, "text": "The question, the open question is what it means to ground."}, {"time": 1360, "text": "I mean, we're very human centric in our thinking, but what does it mean for a machine to understand what it means to be in this world?"}, {"time": 1370, "text": "Does it need to have a finiteness like we humans have all of these elements?"}, {"time": 1377, "text": "It's a very, it's an open question."}, {"time": 1382, "text": "You know, I'm not sure about having a body, but having a perceptual system, having a body would be very helpful too."}, {"time": 1385, "text": "I mean, if you think about human, mimicking human, you know, but having a perception that seems to be essential so that you can build, you can accumulate knowledge about the world."}, {"time": 1400, "text": "So if you can imagine a human completely paralyzed, and there's a lot that the human brain could learn, you know, with a paralyzed body."}, {"time": 1413, "text": "So if we got a machine that could do that, that would be a big deal."}, {"time": 1418, "text": "TK And then the flip side of that, something you see in children and something in machine learning world is called active learning."}, {"time": 1424, "text": "Maybe it is also in, is being able to play with the world."}, {"time": 1432, "text": "How important for developing System 1 or System 2 do you think it is to play with the world?"}, {"time": 1439, "text": "To be able to interact with the world?"}, {"time": 1440, "text": "MG A lot of what you learn is you learn to anticipate the outcomes of your actions."}, {"time": 1440, "text": "I mean, you can see that how babies learn it, you know, with their hands, how they learn, you know, to connect, you know, the movements of their hands with something that clearly is something that happens in the brain and the ability of the brain to learn new patterns."}, {"time": 1460, "text": "So, you know, it's the kind of thing that you get with artificial limbs, that you connect it and then people learn to operate the artificial limb, you know, really impressively quickly, at least from what I hear."}, {"time": 1484, "text": "So we have a system that is ready to learn the world through action."}, {"time": 1489, "text": "TK At the risk of going into way too mysterious of land, what do you think it takes to build a system like that?"}, {"time": 1492, "text": "Obviously, we're very far from understanding how the brain works, but how difficult is it to build this mind of ours?"}, {"time": 1508, "text": "MG You know, I mean, I think that Jan LeCun's answer that we don't know how many mountains there are, I think that's a very good answer."}, {"time": 1513, "text": "I think that, you know, if you look at what Ray Kurzweil is saying, that strikes me as off the wall."}, {"time": 1520, "text": "But I think people are much more realistic than that, where actually Demis Hassabis is and Jan is, and so the people are actually doing the work fairly realistic, I think."}, {"time": 1535, "text": "TK To maybe phrase it another way, from a perspective not of building it, but from understanding it, how complicated are human beings in the following sense?"}, {"time": 1544, "text": "You know, I work with autonomous vehicles and pedestrians, so we tried to model pedestrians."}, {"time": 1552, "text": "How difficult is it to model a human being, their perception of the world, the two systems they operate under, sufficiently to be able to predict whether the pedestrian is going to cross the road or not?"}, {"time": 1569, "text": "MG I'm, you know, I'm fairly optimistic about that, actually, because what we're talking about is a huge amount of information that every vehicle has, and that feeds into one system, into one gigantic system."}, {"time": 1586, "text": "And so anything that any vehicle learns becomes part of what the whole system knows."}, {"time": 1593, "text": "And with a system multiplier like that, there is a lot that you can do."}, {"time": 1601, "text": "So human beings are very complicated, and the system is going to make mistakes, but human makes mistakes."}, {"time": 1608, "text": "I think that they'll be able to, I think they are able to anticipate pedestrians, otherwise a lot would happen."}, {"time": 1616, "text": "They're able to, you know, they're able to get into a roundabout and into traffic, so they must know both to expect or to anticipate how people will react when they're sneaking in."}, {"time": 1634, "text": "And there's a lot of learning that's involved in that."}, {"time": 1638, "text": "RL Currently, the pedestrians are treated as things that cannot be hit, and they're not treated as agents with whom you interact in a game theoretic way."}, {"time": 1648, "text": "So, I mean, it's not, it's a totally open problem, and every time somebody tries to solve it, it seems to be harder than we think."}, {"time": 1661, "text": "And nobody's really tried to seriously solve the problem of that dance, because I'm not sure if you've thought about the problem of pedestrians, but you're really putting your life in the hands of the driver."}, {"time": 1674, "text": "RL You know, there is a dance, there's part of the dance that would be quite complicated, but for example, when I cross the street and there is a vehicle approaching, I look the driver in the eye, and I think many people do that."}, {"time": 1685, "text": "And, you know, that's a signal that I'm sending, and I would be sending that machine to an autonomous vehicle, and it had better understand it, because it means I'm crossing."}, {"time": 1700, "text": "RL So, and there's another thing you do, that actually, so I'll tell you what you do, because we watched, I've watched hundreds of hours of video on this, is when you step in the street, you do that before you step in the street, and when you step in the street, you actually look away."}, {"time": 1716, "text": "RL Look away."}, {"time": 1716, "text": "Now, what is that?"}, {"time": 1716, "text": "What that's saying is, I mean, you're trusting that the car who hasn't slowed down yet will slow down."}, {"time": 1728, "text": "And you're telling him, I'm committed."}, {"time": 1728, "text": "I mean, this is like in a game of chicken, so I'm committed, and if I'm committed, I'm looking away."}, {"time": 1733, "text": "So, there is, you just have to stop."}, {"time": 1740, "text": "RL So, the question is whether a machine that observes that needs to understand mortality."}, {"time": 1746, "text": "RL Here, I'm not sure that it's got to understand so much as it's got to anticipate."}, {"time": 1746, "text": "So, and here, but you know, you're surprising me, because here I would think that maybe you can anticipate without understanding, because I think this is clearly what's happening in playing go or in playing chess."}, {"time": 1770, "text": "There's a lot of anticipation, and there is zero understanding."}, {"time": 1775, "text": "RL Exactly."}, {"time": 1776, "text": "RL So, I thought that you didn't need a model of the human and a model of the human mind to avoid hitting pedestrians, but you are suggesting that actually... RL There you go, yeah."}, {"time": 1791, "text": "RL You do."}, {"time": 1791, "text": "Then it's a lot harder, I thought."}, {"time": 1796, "text": "RL And I have a follow up question to see where your intuition lies."}, {"time": 1796, "text": "It seems that almost every robot human collaboration system is a lot harder than people realize."}, {"time": 1802, "text": "So, do you think it's possible for robots and humans to collaborate successfully?"}, {"time": 1810, "text": "We talked a little bit about semi autonomous vehicles, like in the Tesla autopilot, but just in tasks in general."}, {"time": 1823, "text": "If you think we talked about current neural networks being kind of system one, do you think those same systems can borrow humans for system two type tasks and collaborate successfully?"}, {"time": 1840, "text": "RL Well, I think that in any system where humans and the machine interact, the human will be superfluous within a fairly short time."}, {"time": 1849, "text": "That is, if the machine is advanced enough so that it can really help the human, then it may not need the human for a long time."}, {"time": 1861, "text": "Now, it would be very interesting if there are problems that for some reason the machine cannot solve, but that people could solve."}, {"time": 1868, "text": "Then you would have to build into the machine an ability to recognize that it is in that kind of problematic situation and to call the human."}, {"time": 1882, "text": "That cannot be easy without understanding."}, {"time": 1882, "text": "That is, it must be very difficult to program a recognition that you are in a problematic situation without understanding the problem."}, {"time": 1899, "text": "That's very true."}, {"time": 1899, "text": "In order to understand the full scope of situations that are problematic, you almost need to be smart enough to solve all those problems."}, {"time": 1911, "text": "RL It's not clear to me how much the machine will need the human."}, {"time": 1911, "text": "I think the example of chess is very instructive."}, {"time": 1921, "text": "I mean, there was a time at which Kasparov was saying that human machine combinations will beat everybody."}, {"time": 1926, "text": "Even stockfish doesn't need people and Alpha Zero certainly doesn't need people."}, {"time": 1935, "text": "The question is, just like you said, how many problems are like chess and how many problems are not like chess?"}, {"time": 1940, "text": "Every problem probably in the end is like chess."}, {"time": 1940, "text": "The question is, how long is that transition period?"}, {"time": 1949, "text": "RL That's a question I would ask you."}, {"time": 1949, "text": "Autonomous vehicle, just driving, is probably a lot more complicated than Go to solve that problem."}, {"time": 1958, "text": "Because it's open."}, {"time": 1958, "text": "That's not surprising to me because there is a hierarchical aspect to this, which is recognizing a situation and then within the situation bringing up the relevant knowledge."}, {"time": 1978, "text": "For that hierarchical type of system to work, you need a more complicated system than we currently have."}, {"time": 1995, "text": "A lot of people think, because as human beings, this is probably the cognitive biases, they think of driving as pretty simple because they think of their own experience."}, {"time": 2002, "text": "This is actually a big problem for AI researchers or people thinking about AI because they evaluate how hard a particular problem is based on very limited knowledge, based on how hard it is for them to do the task."}, {"time": 2023, "text": "And then they take for granted, maybe you can speak to that because most people tell me driving is trivial and humans in fact are terrible at driving is what people tell me."}, {"time": 2036, "text": "And I see humans and humans are actually incredible at driving and driving is really terribly difficult."}, {"time": 2042, "text": "Is that just another element of the effects that you've described in your work on the psychology side?"}, {"time": 2053, "text": "No, I mean, I haven't really, I would say that my research has contributed nothing to understanding the ecology and to understanding the structure of situations and the complexity of problems."}, {"time": 2067, "text": "So all we know is very clear that that goal, it's endlessly complicated, but it's very constrained."}, {"time": 2078, "text": "And in the real world, there are far fewer constraints and many more potential surprises."}, {"time": 2089, "text": "So that's obvious because it's not always obvious to people, right?"}, {"time": 2089, "text": "So when you think about... Well, I mean, you know, people thought that reasoning was hard and perceiving was easy, but you know, they quickly learned that actually modeling vision was tremendously complicated and modeling, even proving theorems was relatively straightforward."}, {"time": 2115, "text": "To push back on that a little bit on the quickly part, it took several decades to learn that and most people still haven't learned that."}, {"time": 2122, "text": "I mean, our intuition, of course, AI researchers have, but you drift a little bit outside the specific AI field, the intuition is still perceptible to solve that."}, {"time": 2136, "text": "No, I mean, that's true."}, {"time": 2136, "text": "Intuitions, the intuitions of the public haven't changed radically."}, {"time": 2141, "text": "And they are, as you said, they're evaluating the complexity of problems by how difficult it is for them to solve the problems."}, {"time": 2148, "text": "And that's got very little to do with the complexities of solving them in AI."}, {"time": 2158, "text": "How do you think from the perspective of an AI researcher, do we deal with the intuitions of the public?"}, {"time": 2166, "text": "So in trying to think, arguably, the combination of hype investment and the public intuition is what led to the AI winters."}, {"time": 2175, "text": "I'm sure that same could be applied to tech or that the intuition of the public leads to media hype, leads to companies investing in the tech, and then the tech doesn't make the company's money."}, {"time": 2189, "text": "And then there's a crash."}, {"time": 2196, "text": "Is there a way to educate people to fight the, let's call it system one thinking?"}, {"time": 2203, "text": "In general, no."}, {"time": 2203, "text": "I think that's the simple answer."}, {"time": 2203, "text": "And it's going to take a long time before the understanding of what those systems can do becomes public knowledge."}, {"time": 2214, "text": "And then the expectations, there are several aspects that are going to be very complicated."}, {"time": 2229, "text": "The fact that you have a device that cannot explain itself is a major, major difficulty."}, {"time": 2240, "text": "And we're already seeing that."}, {"time": 2249, "text": "I mean, this is really something that is happening."}, {"time": 2249, "text": "So it's happening in the judicial system."}, {"time": 2255, "text": "So you have system that are clearly better at predicting parole violations than judges, but they can't explain their reasoning."}, {"time": 2263, "text": "And so people don't want to trust them."}, {"time": 2276, "text": "We seem to in system one, even use cues to make judgements about our environment."}, {"time": 2276, "text": "So this explainability point, do you think humans can explain stuff?"}, {"time": 2291, "text": "No, but I mean, there is a very interesting aspect of that."}, {"time": 2291, "text": "Humans think they can explain themselves."}, {"time": 2300, "text": "So when you say something and I ask you, why do you believe that?"}, {"time": 2300, "text": "Then reasons will occur to you."}, {"time": 2308, "text": "But actually, my own belief is that in most cases, the reasons have very little to do with why you believe what you believe."}, {"time": 2315, "text": "So that the reasons are a story that comes to your mind when you need to explain yourself."}, {"time": 2321, "text": "But people traffic in those explanations I mean, the human interaction depends on those shared fictions and, and the stories that people tell themselves."}, {"time": 2338, "text": "You just made me actually realize and we'll talk about stories in a second."}, {"time": 2338, "text": "That not to be cynical about it, but perhaps there's a whole movement of people trying to do explainable AI."}, {"time": 2351, "text": "And really, we don't necessarily need to explain AI doesn't need to explain itself."}, {"time": 2359, "text": "It just needs to tell a convincing story."}, {"time": 2363, "text": "It doesn't necessarily, the story doesn't necessarily need to reflect the truth as it might, it just needs to be convincing."}, {"time": 2369, "text": "There's something to that."}, {"time": 2372, "text": "You can say exactly the same thing in a way that sounds cynical or doesn't sound cynical."}, {"time": 2379, "text": "But the objective of having an explanation is to tell a story that will be acceptable to people."}, {"time": 2388, "text": "And, and, and for it to be acceptable and to be robustly acceptable, it has to have some elements of truth."}, {"time": 2396, "text": "But, but the objective is for people to accept it."}, {"time": 2404, "text": "It's quite brilliant, actually."}, {"time": 2404, "text": "But so on the, on the stories that we tell, sorry to ask me, ask you the question that most people know the answer to, but you talk about two selves in terms of how life is lived, the experienced self and remembering self."}, {"time": 2418, "text": "Can you describe the distinction between the two?"}, {"time": 2426, "text": "I mean, the, there is an aspect of, of life that occasionally, you know, most of the time we just live and we have experiences and they're better and they're worse and it goes on over time."}, {"time": 2438, "text": "And mostly we forget everything that happens or we forget most of what happens."}, {"time": 2445, "text": "Then occasionally you, when something ends or at different points, you evaluate the past and you form a memory and the memory is schematic."}, {"time": 2456, "text": "It's not that you can roll a film of an interaction."}, {"time": 2463, "text": "You construct, in effect, the elements of a story about an, about an episode."}, {"time": 2463, "text": "So there is the experience and there is the story that is created about the experience."}, {"time": 2472, "text": "And that's what I call the remembering."}, {"time": 2478, "text": "So I had the image of two selves."}, {"time": 2478, "text": "So there is a self that lives and there is a self that evaluates life."}, {"time": 2484, "text": "Now the paradox and the deep paradox in that is that we have one system or one self that does the living, but the other system, the remembering self is all we get to keep."}, {"time": 2501, "text": "And basically decision making and, and everything that we do is governed by our memories, not by what actually happened."}, {"time": 2509, "text": "It's, it's governed by, by the story that we told ourselves or by the story that we're keeping."}, {"time": 2515, "text": "So that's, that's the distinction."}, {"time": 2523, "text": "I mean, there's a lot of brilliant ideas about the pursuit of happiness that come out of that."}, {"time": 2528, "text": "What are the properties of happiness which emerge from a remembering self?"}, {"time": 2534, "text": "There are, there are properties of how we construct stories that are really important."}, {"time": 2539, "text": "So that I studied a few, but, but a couple are really very striking."}, {"time": 2539, "text": "And one is that in stories, time doesn't matter."}, {"time": 2549, "text": "There's a sequence of events or there are highlights or not."}, {"time": 2557, "text": "And, and how long it took, you know, they lived happily ever after or three years later or something."}, {"time": 2565, "text": "It, time really doesn't matter."}, {"time": 2565, "text": "And in stories, events matter, but time doesn't."}, {"time": 2573, "text": "That, that leads to a very interesting set of problems because time is all we got to live."}, {"time": 2583, "text": "I mean, you know, time is the currency of life."}, {"time": 2583, "text": "And yet time is not represented basically in evaluated memories."}, {"time": 2591, "text": "So that, that creates a lot of paradoxes that I've thought about."}, {"time": 2598, "text": "They're fascinating."}, {"time": 2598, "text": "But if you were to give advice on how one lives a happy life based on such properties, what's the optimal?"}, {"time": 2613, "text": "You know, I gave up, I abandoned happiness research because I couldn't solve that problem."}, {"time": 2618, "text": "I couldn't, I couldn't see."}, {"time": 2618, "text": "And in the first place, it's very clear that if you do talk in terms of those two selves, then that what makes the remembering self happy and what makes the experiencing self happy are different things."}, {"time": 2631, "text": "And I, I asked the question of, suppose you're planning a vacation and you're just told that at the end of the vacation, you'll get an amnesic drug, so you remember nothing."}, {"time": 2644, "text": "And they'll also destroy all your photos."}, {"time": 2650, "text": "So there'll be nothing."}, {"time": 2650, "text": "Would you still go to the same vacation?"}, {"time": 2650, "text": "And, and it's, it turns out we go to vacations in large part to construct memories, not to have experiences, but to construct memories."}, {"time": 2666, "text": "And it turns out that the vacation that you would want for yourself, if you knew, you will not remember is probably not the same vacation that you will want for yourself if you will remember."}, {"time": 2678, "text": "So I have no solution to these problems, but clearly those are big issues."}, {"time": 2687, "text": "And you've talked about, you've talked about sort of how many minutes or hours you spend about the vacation."}, {"time": 2693, "text": "It's an interesting way to think about it because that's how you really experience the vacation outside the being in it."}, {"time": 2698, "text": "But there's also a modern, I don't know if you think about this or interact with it."}, {"time": 2703, "text": "There's a modern way to, um, magnify the remembering self, which is by posting on Instagram, on Twitter, on social networks."}, {"time": 2711, "text": "A lot of people live life for the picture that you take, that you post somewhere."}, {"time": 2717, "text": "And now thousands of people share and potentially potentially millions."}, {"time": 2724, "text": "And then you can relive it even much more than just those minutes."}, {"time": 2729, "text": "Do you think about that magnification much?"}, {"time": 2734, "text": "You know, I'm too old for social networks."}, {"time": 2734, "text": "I, you know, I've never seen Instagram, so I cannot really speak intelligently about those things."}, {"time": 2741, "text": "I'm just too old."}, {"time": 2746, "text": "But it's interesting to watch the exact effects you've described."}, {"time": 2749, "text": "Make a very big difference."}, {"time": 2749, "text": "I mean, and it will make, it will also make a difference."}, {"time": 2755, "text": "And that I don't know whether, uh, it's clear that in some ways the devices that serve us are supplant functions."}, {"time": 2766, "text": "So you don't have to remember phone numbers."}, {"time": 2766, "text": "You don't have, you really don't have to know facts."}, {"time": 2772, "text": "I mean, the number of conversations I'm involved with, somebody says, well, let's look it up."}, {"time": 2779, "text": "Uh, so it's, it's in a way it's made conversations."}, {"time": 2787, "text": "Well it's, it means that it's much less important to know things."}, {"time": 2787, "text": "You know, it used to be very important to know things."}, {"time": 2793, "text": "This is changing."}, {"time": 2793, "text": "So the requirements of that, that we have for ourselves and for other people are changing because of all those supports and because, and I have no idea what Instagram does, but it's, uh, well, I'll tell you, I wish I could just have the, my remembering self could enjoy this conversation, but I'll get to enjoy it even more by having watched, by watching it and then talking to others."}, {"time": 2823, "text": "It'll be about a hundred thousand people as scary as this to say, well, listen or watch this, right?"}, {"time": 2834, "text": "It changes things."}, {"time": 2834, "text": "It changes the experience of the world that you seek out experiences which could be shared in that way."}, {"time": 2840, "text": "It's in, and I haven't seen, it's, it's the same effects that you described."}, {"time": 2845, "text": "And I don't think the psychology of that magnification has been described yet because it's a new world."}, {"time": 2853, "text": "But the sharing, there was a, there was a time when people read books and, uh, and, and you could assume that your friends had read the same books that you read."}, {"time": 2863, "text": "So there was kind of invisible sharing."}, {"time": 2871, "text": "There was a lot of sharing going on and there was a lot of assumed common knowledge and, you know, that was built in."}, {"time": 2877, "text": "I mean, it was obvious that you had read the New York Times."}, {"time": 2883, "text": "It was obvious that you had read the reviews."}, {"time": 2883, "text": "I mean, so a lot was taken for granted that was shared."}, {"time": 2889, "text": "And, you know, when there were, when there were three television channels, it was obvious that you'd seen one of them probably the same."}, {"time": 2906, "text": "So sharing, sharing always was always there."}, {"time": 2906, "text": "It was just different."}, {"time": 2912, "text": "At the risk of, uh, inviting mockery from you, let me say that I'm also a fan of Sartre and Camus and existentialist philosophers."}, {"time": 2920, "text": "And, um, I'm joking of course about mockery, but from the perspective of the two selves, what do you think of the existentialist philosophy of life?"}, {"time": 2934, "text": "So trying to really emphasize the experiencing self as the proper way to, or the best way to live life."}, {"time": 2945, "text": "I don't know enough philosophy to answer that, but it's not, uh, you know, the emphasis on, on experience is also the emphasis in Buddhism."}, {"time": 2958, "text": "So, uh, that's, you just have got to, to experience things and, and, and not to evaluate and not to pass judgment and not to score, not to keep score."}, {"time": 2967, "text": "So, uh, If, when you look at the grand picture of experience, you think there's something to that, that one, one of the ways to achieve contentment and maybe even happiness is letting go of any of the things, any of the procedures of the remembering self."}, {"time": 2991, "text": "Well, yeah, I mean, I think, you know, if one could imagine a life in which people don't score themselves, uh, it, it feels as if that would be a better life as if the self scoring and you know, how am I doing a kind of question, uh, is not, is not a very happy thing to have."}, {"time": 3018, "text": "But I got out of that field because I couldn't solve that problem and, and that was because my intuition was that the experiencing self, that's reality."}, {"time": 3031, "text": "But then it turns out that what people want for themselves is not experiences."}, {"time": 3031, "text": "They want memories and they want a good story about their life."}, {"time": 3036, "text": "And so you cannot have a theory of happiness that doesn't correspond to what people want for themselves."}, {"time": 3041, "text": "And when I, when I realized that this, this was where things were going, I really sort of left the field of research."}, {"time": 3054, "text": "Do you think there's something instructive about this emphasis of reliving memories in building AI systems."}, {"time": 3061, "text": "So currently artificial intelligence systems are more like experiencing self in that they react to the environment."}, {"time": 3069, "text": "There's some pattern formation like a learning so on, but you really don't construct memories, uh, except in reinforcement learning every once in a while that you replay over and over."}, {"time": 3085, "text": "Yeah, but you know, that would in principle would not be."}, {"time": 3090, "text": "Do you think that's useful?"}, {"time": 3090, "text": "Do you think it's a feature or a bug of human beings that we, that we look back?"}, {"time": 3097, "text": "Oh, I think that's definitely a feature."}, {"time": 3097, "text": "That's not a bug."}, {"time": 3097, "text": "I mean, you, you have to look back in order to look forward."}, {"time": 3103, "text": "So, uh, without, without looking back, you couldn't, you couldn't really intelligently look forward."}, {"time": 3113, "text": "You're looking for the echoes of the same kind of experience in order to predict what the future holds."}, {"time": 3119, "text": "So though Victor Frankel in his book, man's search for meaning, I'm not sure if you've read, describes his experience at the consecration concentration camps during world war two as a way to describe that finding identifying a purpose in life, a positive purpose in life can save one from suffering."}, {"time": 3138, "text": "First of all, do you connect with the philosophy that he describes there?"}, {"time": 3148, "text": "I mean, the, so I can, I can really see that somebody who has that feeling of purpose and meaning and so on, that, that could sustain you."}, {"time": 3157, "text": "Uh, I in general don't have that feeling and I'm pretty sure that if I were in a concentration camp, I'd give up and die, you know?"}, {"time": 3170, "text": "So he talks, he is, he is a survivor."}, {"time": 3177, "text": "And, you know, he survived with that."}, {"time": 3177, "text": "And I'm, and I'm not sure how essential to survival this sense is, but I do know when I think about myself that I would have given up."}, {"time": 3184, "text": "Oh, this isn't going anywhere."}, {"time": 3192, "text": "And there is, there is a sort of character that, that, that manages to survive in conditions like that."}, {"time": 3200, "text": "And then because they survive, they tell stories and it sounds as if they survive because of what they were doing."}, {"time": 3206, "text": "They survived because the kind of people that they are and the other kind of people who survives and would tell themselves stories of a particular kind."}, {"time": 3216, "text": "So I'm not, uh, So you don't think seeking purpose is a significant driver in our being?"}, {"time": 3226, "text": "Oh, I mean, it's, it's a very interesting question because when you ask people whether it's very important to have meaning in their life, they say, oh yes, that's the most important thing."}, {"time": 3236, "text": "But when you ask people, what kind of a day did you have?"}, {"time": 3236, "text": "And, and you know, what were the experiences that you remember?"}, {"time": 3243, "text": "You don't get much meaning."}, {"time": 3243, "text": "You get social experiences."}, {"time": 3250, "text": "Then, uh, and, and some people say that, for example, in, in, in child, you know, in taking care of children, the fact that they are your children and you're taking care of them, uh, makes a very big difference."}, {"time": 3265, "text": "I think that's entirely true."}, {"time": 3265, "text": "Uh, but it's more because of a story that we're telling ourselves, which is a very different story when we're taking care of our children or when we're taking care of other things."}, {"time": 3285, "text": "Jumping around a little bit in doing a lot of experiments, let me ask a question."}, {"time": 3285, "text": "Most of the work I do, for example, is in the, in the real world, but most of the clean good science that you can do is in the lab."}, {"time": 3296, "text": "So that distinction, do you think we can understand the fundamentals of human behavior through controlled experiments in the lab?"}, {"time": 3304, "text": "If we talk about pupil diameter, for example, it's much easier to do when you can control lighting conditions, right?"}, {"time": 3318, "text": "So when we look at driving, lighting variation destroys almost completely your ability to use pupil diameter."}, {"time": 3327, "text": "But in the lab for, as I mentioned, semi autonomous or autonomous vehicles in driving simulators, we can't, we don't capture true, honest, uh, human behavior in that particular domain."}, {"time": 3343, "text": "How much of human behavior can we study in this controlled environment of the lab?"}, {"time": 3349, "text": "A lot, but you'd have to verify it, you know, that your, your conclusions are basically limited to the situation, to the experimental situation."}, {"time": 3363, "text": "Then you have to jump the big inductive leap to the real world."}, {"time": 3369, "text": "Uh, so, and, and that's the flare."}, {"time": 3369, "text": "That's where the difference, I think, between the good psychologists and others that are mediocre is in the sense of that your experiment captures something that's important and something that's real and others are just running experiments."}, {"time": 3393, "text": "So what is that?"}, {"time": 3393, "text": "Like the birth of an idea to his development in your mind to something that leads to an experiment."}, {"time": 3399, "text": "Is that similar to maybe like what Einstein or a good physicist do is your intuition."}, {"time": 3404, "text": "You basically use your intuition to build up."}, {"time": 3408, "text": "Yeah, but I mean, you know, it's, it's very skilled intuition."}, {"time": 3408, "text": "I mean, I just had that experience actually."}, {"time": 3414, "text": "I had an idea that turns out to be very good idea a couple of days ago and, and you, and you have a sense of that building up."}, {"time": 3420, "text": "So I'm working with a collaborator and he essentially was saying, you know, what, what are you doing?"}, {"time": 3428, "text": "What's, what's going on?"}, {"time": 3434, "text": "And I was, I really, I couldn't exactly explain it, but I knew this is going somewhere, but you know, I've been around that game for a very long time."}, {"time": 3441, "text": "And so I can, you, you develop that anticipation that yes, this, this is worth following up."}, {"time": 3446, "text": "That's part of the skill."}, {"time": 3454, "text": "Is that something you can reduce to words in describing a process in the form of advice to others?"}, {"time": 3463, "text": "Follow your heart, essentially."}, {"time": 3465, "text": "I mean, you know, it's, it's like trying to explain what it's like to drive."}, {"time": 3465, "text": "It's not, you've got to break it apart and it's not."}, {"time": 3474, "text": "And then you lose."}, {"time": 3475, "text": "And then you lose the experience."}, {"time": 3478, "text": "You mentioned collaboration."}, {"time": 3478, "text": "You've written about your collaboration with Amos Tversky that this is you writing, the 12 or 13 years in which most of our work was joint were years of interpersonal and intellectual bliss."}, {"time": 3490, "text": "Everything was interesting."}, {"time": 3490, "text": "Almost everything was funny."}, {"time": 3496, "text": "And there was a current joy of seeing an idea take shape."}, {"time": 3496, "text": "So many times in those years, we shared the magical experience of one of us saying something, which the other one would understand more deeply than the speaker had done."}, {"time": 3507, "text": "Contrary to the old laws of information theory, it was common for us to find that more information was received than had been sent."}, {"time": 3518, "text": "I have almost never had the experience with anyone else."}, {"time": 3518, "text": "If you have not had it, you don't know how marvelous collaboration can be."}, {"time": 3529, "text": "So let me ask a perhaps a silly question."}, {"time": 3529, "text": "How does one find and create such a collaboration?"}, {"time": 3538, "text": "That may be asking like, how does one find love?"}, {"time": 3541, "text": "Yeah, you have to be lucky."}, {"time": 3541, "text": "And I think you have to have the character for that because I've had many collaborations."}, {"time": 3550, "text": "I mean, none were as exciting as with Amos, but I've had and I'm having just very."}, {"time": 3557, "text": "So it's a skill."}, {"time": 3557, "text": "I think I'm good at it."}, {"time": 3557, "text": "Not everybody is good at it."}, {"time": 3567, "text": "And then it's the luck of finding people who are also good at it."}, {"time": 3572, "text": "Is there advice in a form for a young scientist who also seeks to violate this law of information theory?"}, {"time": 3588, "text": "I really think it's so much luck is involved."}, {"time": 3588, "text": "And in those really serious collaborations, at least in my experience, are a very personal experience."}, {"time": 3599, "text": "And I have to like the person I'm working with."}, {"time": 3606, "text": "Otherwise, I mean, there is that kind of collaboration, which is like an exchange, a commercial exchange of giving this, you give me that."}, {"time": 3613, "text": "But the real ones are interpersonal."}, {"time": 3621, "text": "They're between people who like each other and who like making each other think and who like the way that the other person responds to your thoughts."}, {"time": 3628, "text": "You have to be lucky."}, {"time": 3637, "text": "But I already noticed that even just me showing up here, you've quickly started to digging in on a particular problem I'm working on and already new information started to emerge."}, {"time": 3649, "text": "Is that a process, just the process of curiosity of talking to people about problems and seeing?"}, {"time": 3656, "text": "I'm curious about anything to do with AI and robotics."}, {"time": 3656, "text": "And I knew you were dealing with that."}, {"time": 3663, "text": "So I was curious."}, {"time": 3665, "text": "Just follow your curiosity."}, {"time": 3665, "text": "Jumping around on the psychology front, the dramatic sounding terminology of replication crisis, but really just the, at times, this effect that at times studies do not, are not fully generalizable."}, {"time": 3689, "text": "You are being polite."}, {"time": 3689, "text": "It's worse than that."}, {"time": 3693, "text": "So I'm actually not fully familiar to the degree how bad it is, right?"}, {"time": 3693, "text": "So what do you think is the source?"}, {"time": 3699, "text": "Where do you think?"}, {"time": 3701, "text": "I think I know what's going on actually."}, {"time": 3701, "text": "I mean, I have a theory about what's going on and what's going on is that there is, first of all, a very important distinction between two types of experiments."}, {"time": 3715, "text": "And one type is within subject."}, {"time": 3715, "text": "So it's the same person has two experimental conditions."}, {"time": 3723, "text": "And the other type is between subjects where some people are this condition, other people are that condition."}, {"time": 3729, "text": "They're different worlds."}, {"time": 3729, "text": "And between subject experiments are much harder to predict and much harder to anticipate."}, {"time": 3734, "text": "And the reason, and they're also more expensive because you need more people."}, {"time": 3745, "text": "And it's just, so between subject experiments is where the problem is."}, {"time": 3751, "text": "It's not so much in within subject experiments, it's really between."}, {"time": 3758, "text": "And there is a very good reason why the intuitions of researchers about between subject experiments are wrong."}, {"time": 3766, "text": "And that's because when you are a researcher, you're in a within subject situation."}, {"time": 3774, "text": "That is you are imagining the two conditions and you see the causality and you feel it."}, {"time": 3780, "text": "But in the between subject condition, they live in one condition and the other one is just nowhere."}, {"time": 3789, "text": "So our intuitions are very weak about between subject experiments."}, {"time": 3798, "text": "And that I think is something that people haven't realized."}, {"time": 3806, "text": "And in addition, because of that, we have no idea about the power of manipulations of experimental manipulations because the same manipulation is much more powerful when you are in the two conditions than when you live in only one condition."}, {"time": 3822, "text": "And so the experimenters have very poor intuitions about between subject experiments."}, {"time": 3828, "text": "And there is something else which is very important, I think, which is that almost all psychological hypotheses are true."}, {"time": 3844, "text": "That is in the sense that, you know, directionally, if you have a hypothesis that A really causes B, that it's not true that A causes the opposite of B."}, {"time": 3853, "text": "Maybe A just has very little effect, but hypotheses are true mostly, except mostly they're very weak."}, {"time": 3861, "text": "They're much weaker than you think when you are having images."}, {"time": 3868, "text": "So the reason I'm excited about that is that I recently heard about some friends of mine who they essentially funded 53 studies of behavioral change by 20 different teams of people with a very precise objective of changing the number of times that people go to the gym."}, {"time": 3899, "text": "And the success rate was zero."}, {"time": 3899, "text": "Not one of the 53 studies worked."}, {"time": 3912, "text": "Now, what's interesting about that is those are the best people in the field and they have no idea what's going on."}, {"time": 3918, "text": "So they're not calibrated."}, {"time": 3918, "text": "They think that it's going to be powerful because they can imagine it, but actually it's just weak because you are focusing on your manipulation and it feels powerful to you."}, {"time": 3930, "text": "There's a thing that I've written about that's called the focusing illusion."}, {"time": 3937, "text": "That is that when you think about something, it looks very important, more important than it really is."}, {"time": 3948, "text": "More important than it really is."}, {"time": 3948, "text": "But if you don't see that effect, the 53 studies, doesn't that mean you just report that?"}, {"time": 3953, "text": "So what was, I guess, the solution to that?"}, {"time": 3959, "text": "Well, I mean, the solution is for people to trust their intuitions less or to try out their intuitions before."}, {"time": 3967, "text": "I mean, experiments have to be pre registered and by the time you run an experiment, you have to be committed to it and you have to run the experiment seriously enough and in a public."}, {"time": 3980, "text": "And so this is happening."}, {"time": 3980, "text": "The interesting thing is what happens before and how do people prepare themselves and how they run pilot experiments."}, {"time": 3992, "text": "It's going to train the way psychology is done and it's already happening."}, {"time": 4001, "text": "Do you have a hope for, this might connect to the study sample size."}, {"time": 4009, "text": "Do you have a hope for the internet?"}, {"time": 4011, "text": "Well, I mean, you know, this is really happening."}, {"time": 4011, "text": "MTurk, everybody's running experiments on MTurk and it's very cheap and very effective."}, {"time": 4023, "text": "Do you think that changes psychology essentially?"}, {"time": 4023, "text": "Because you're thinking you cannot run 10,000 subjects."}, {"time": 4030, "text": "Eventually it will."}, {"time": 4030, "text": "I mean, I, you know, I can't put my finger on how exactly, but it's, that's been true in psychology with whenever an important new method came in, it changes the field."}, {"time": 4044, "text": "So, and MTurk is really a method because it makes it very much easier to do something, to do some things."}, {"time": 4055, "text": "Is there a undergrad students who'll ask me, you know, how big a neural network should be for a particular problem?"}, {"time": 4060, "text": "So let me ask you an equivalent question."}, {"time": 4060, "text": "How big, how many subjects does the study have for it to have a conclusive result?"}, {"time": 4073, "text": "Well, it depends on the strength of the effect."}, {"time": 4073, "text": "So if you're studying visual perception or the perception of color, many of the classic results in visual, in color perception were done on three or four people."}, {"time": 4088, "text": "And I think one of them was colorblind, but partly colorblind, but on vision, you know, it's highly reliable."}, {"time": 4094, "text": "Many people don't need a lot of replications for some type of neurological experiment."}, {"time": 4104, "text": "When you're studying weaker phenomena and especially when you're studying them between subjects, then you need a lot more subjects than people have been running."}, {"time": 4121, "text": "And that is, that's one of the things that are happening in psychology now is that the power, the statistical power of experiments is increasing rapidly."}, {"time": 4134, "text": "Does the between subject, as the number of subjects goes to infinity approach?"}, {"time": 4139, "text": "Well, I mean, you know, it goes to infinity is exaggerated, but people, the standard number of subjects for an experiment in psychology were 30 or 40."}, {"time": 4146, "text": "And for a weak effect, that's simply not enough."}, {"time": 4155, "text": "And you may need a couple of hundred."}, {"time": 4155, "text": "I mean, it's that sort of order of magnitude."}, {"time": 4168, "text": "What are the major disagreements in theories and effects that you've observed throughout your career that still stand today?"}, {"time": 4175, "text": "You've worked on several fields, but what still is out there as a major disagreement that pops into your mind?"}, {"time": 4187, "text": "I've had one extreme experience of, you know, controversy with somebody who really doesn't like the work that Amos Tversky and I did."}, {"time": 4194, "text": "And he's been after us for 30 years or more, at least."}, {"time": 4202, "text": "Do you want to talk about it?"}, {"time": 4203, "text": "Well, I mean, his name is Gerd Gigerenzer."}, {"time": 4203, "text": "He's a well known German psychologist."}, {"time": 4203, "text": "And that's the one controversy, which I, it's been unpleasant."}, {"time": 4210, "text": "And no, I don't particularly want to talk about it."}, {"time": 4221, "text": "But is there is there open questions, even in your own mind, every once in a while?"}, {"time": 4221, "text": "You know, we talked about semi autonomous vehicles."}, {"time": 4225, "text": "In my own mind, I see what the data says, but I also constantly torn."}, {"time": 4231, "text": "Do you have things where you or your studies have found something, but you're also intellectually torn about what it means?"}, {"time": 4238, "text": "And there's maybe disagreements within your own mind about particular things."}, {"time": 4247, "text": "I mean, it's, you know, one of the things that are interesting is how difficult it is for people to change their mind."}, {"time": 4252, "text": "Essentially, you know, once they are committed, people just don't change their mind about anything that matters."}, {"time": 4260, "text": "And that is surprisingly, but it's true about scientists."}, {"time": 4265, "text": "So the controversy that I described, you know, that's been going on like 30 years and it's never going to be resolved."}, {"time": 4272, "text": "And you build a system and you live within that system and other other systems of ideas look foreign to you and there is very little contact and very little mutual influence."}, {"time": 4287, "text": "That happens a fair amount."}, {"time": 4293, "text": "Do you have a hopeful advice or message on that?"}, {"time": 4293, "text": "Thinking about science, thinking about politics, thinking about things that have impact on this world, how can we change our mind?"}, {"time": 4309, "text": "I think that, I mean, on things that matter, which are political or really political or religious and people just don't, don't change their mind."}, {"time": 4316, "text": "And by and large, and there's very little that you can do about it."}, {"time": 4324, "text": "The, what does happen is that if leaders change their minds."}, {"time": 4333, "text": "So for example, the public, the American public doesn't really believe in climate change, doesn't take it very seriously."}, {"time": 4339, "text": "But if some religious leaders decided this is a major threat to humanity, that would have a big effect."}, {"time": 4346, "text": "So that we have the opinions that we have, not because we know why we have them, but because we trust some people and we don't trust other people."}, {"time": 4359, "text": "And so it's much less about evidence than it is about stories."}, {"time": 4369, "text": "So the way, one way to change your mind isn't at the individual level, is that the leaders of the communities you look up with, the stories change and therefore your mind changes with them."}, {"time": 4379, "text": "So there's a guy named Alan Turing, came up with a Turing test."}, {"time": 4388, "text": "Perhaps we're drifting in a topic that we're maybe philosophizing about, but what do you think is a good test for intelligence, for an artificial intelligence system?"}, {"time": 4403, "text": "Well, the standard definition of artificial general intelligence is that it can do anything that people can do and it can do them better."}, {"time": 4412, "text": "What we are seeing is that in many domains, you have domain specific devices or programs or software, and they beat people easily in a specified way."}, {"time": 4431, "text": "What we are very far from is that general ability, general purpose intelligence."}, {"time": 4444, "text": "In machine learning, people are approaching something more general."}]}]