[{"title": "Georges St-Pierre, John Danaher & Gordon Ryan: The Greatest of All Time | Lex Fridman Podcast #260", "id": "KdmDtqB46Jc", "quotes": [{"time": 1046, "text": "Uh, I basically play it per per person I just I basically fire back with like one step above what what they do."}, {"time": 1050, "text": "It's always plus one."}, {"time": 1050, "text": "Yeah, okay So I go I usually go hard like they fire a bullet then I drop a Duke And then and then after that initial shot then we go back and forth and I'll just keep one upping them So, you know, there's a lot of people that love you, but there's also a lot of people that love to hate you."}, {"time": 1067, "text": "Yeah it's so like what do those people like energize you or do you just Or is it funny to you?"}, {"time": 1080, "text": "Like what as an athlete as a performer?"}, {"time": 1080, "text": "You should not think about them It's like a fun thing It's like it's just like a fun thing that keeps me occupied Like because like because most of them that like talk shit they like just say stuff that's factually incorrect So then I just argue with like actual statistics."}, {"time": 1094, "text": "Yeah, it's just like You suck or you're not gonna beat this person."}, {"time": 1099, "text": "I'm like, I've already submitted that guy Yeah, so I just it riles them up and it's just it's just a fun thing for me to do my my downtime Yeah, your responses are usually very factual."}, {"time": 1108, "text": "It's very scientific."}, {"time": 1108, "text": "I appreciate Thank you."}, {"time": 1113, "text": "You actually you start by talking trash, but then you respond with science."}, {"time": 1113, "text": "It's good mix."}, {"time": 1113, "text": "That's a good mix I Mean a topic of haters are more specifically sort of doubts within yourself of doubts around you as you're coming up Maybe George you can comment."}, {"time": 1129, "text": "Oh, we're just ignoring John completely in this conversation."}, {"time": 1129, "text": "I Was gonna ask you another question, but let me just ask you on this on this topic Are there times in your life yet?"}, {"time": 1144, "text": "You were surrounded by people that that doubted you all the time And so what is there something you could say as in by way of advice how you overcome?"}, {"time": 1153, "text": "The doubt either yourself or others around you all the time the first time I Manifest my desire to become a professional Mixed martial art athlete everybody doubt me Just not even I'm not talking about the UFC just to become a professional fighter Everybody doubt me and I became a I became a professional fighter."}, {"time": 1171, "text": "I had few amateur fight I won them all then I I fought my first fight in In Montreal, I won and I became a professional Then I I told people that I wanted to fight in UFC."}, {"time": 1184, "text": "Everybody doubt me again."}, {"time": 1244, "text": "So it's not no longer competing against my opponent I was you know as a competitor you always you never wanted to be you never want to be satisfied because when Satisfaction is the death, you know when you're satisfied you better retire because it's over So always I have to find motivation what you can have more."}, {"time": 1262, "text": "I want more don't be satisfied in life."}, {"time": 1329, "text": "I I did it so John do you ever use this in one way or the other by saying I don't think you can do this to motivate them to prove you wrong or more general question of You know the mental toughness required to achieve or confidence required to achieve greatness Like what's your role as a coach when you have these two athletes with regards to your your first question?"}, {"time": 1357, "text": "Would I ever say to someone you can't do this as a kind of reverse psychology?"}, {"time": 1465, "text": "I Will tell people hey, you're doing a really good job with that move."}, {"time": 1626, "text": "I couldn't figure out the right like it made sense."}, {"time": 1626, "text": "It made sense in the case of Gary tone because there were more opportunities per minute Of his grappling for guillotines The investment and time was worth it for another athlete."}, {"time": 1635, "text": "I might have said well He hardly ever gets in the situation the front headlong so guillotine so it's not even worth investing the training time Let me ask you a question on the on the competition side mentioned haters And do you think about this aspect of the competition with athletes?"}, {"time": 1652, "text": "If there's a great question and the answer is no I'm You can see that you could you couldn't find two more polar opposites psychologically than than George St. Pierre and this monstrosity on my left and I've I've never said to my athletes."}, {"time": 1672, "text": "Hey, I think this is the sort of demeanor you should carry yourself with I'm myself a very flawed character and I'm the last person on earth Who should be delving out moral advice to other people?"}, {"time": 1688, "text": "The only thing is that I you know, of course, I believe some things are off limits But as long as it's done in the context of sport with no one's physically attacking people or do anything crazy Where it just goes completely over the top then I give almost zero Moral advice to my athletes."}, {"time": 1704, "text": "I'm a jiu jitsu coach not a preacher I If I can if I may We are entertainers You know, we're athletes or professional athletes, but we make We make a living because of people or want to see us perform Same thing an actor or something a singer and a lot of the time especially in the fight game An event is promoted."}, {"time": 1731, "text": "It needs to be with emotion Love me hate me, but do not ignore me and You know it when it's authentic and It's done."}, {"time": 1778, "text": "They would that's the reason why we may we can make a living out of this Yeah, they're better entertainers, but you're right."}, {"time": 1781, "text": "The authenticity seems to be really important."}, {"time": 1781, "text": "There's actually something very interesting there It's time to break out some some secrets Do you know who like you think of George St. Pierre you think of like the highly technical polished Martial artists."}, {"time": 1798, "text": "Oh, this is gonna be great."}, {"time": 1798, "text": "Do you know who his favorite fighters to watch were?"}, {"time": 1806, "text": "You'd probably be thinking of probably someone who's really technically advanced Actually, it was Mark Coleman."}, {"time": 1810, "text": "Oh, no, Kevin Randleman and Phil Barone He used to love watching that was a hammer house."}, {"time": 1816, "text": "That was his favorite."}, {"time": 1816, "text": "He would love those guys and whenever their fights were on georgie watching the hammer house crew and It's funny what you said about how those guys bought an intensity to To MMA that was off the charts."}, {"time": 1833, "text": "Have you ever met those guys in?"}, {"time": 1838, "text": "And in their prime, let me tell you it was it was something to behold and I had this crazy larger than life personality Most of the things I did made no sense whatsoever But I mean technically but that was their appeal and they were these guys and George loved to watch them more than anyone else You never know what what could happen with these guys."}, {"time": 1856, "text": "I remember when Mark Coleman won the Pride Grand Prix I was in my living room."}, {"time": 1861, "text": "I was jumping I was so happy."}, {"time": 1861, "text": "I was like, yeah Yeah, he beat Igor Vorchevchin."}, {"time": 1864, "text": "That was like I like for to me."}, {"time": 1872, "text": "Because of the emotion that they brought into the fight George is actually very interested by something you said that normally when I Ask what is the appeal of a given fighter?"}, {"time": 1928, "text": "technical understanding of what's happening as they watch a fight It's tiny It's absolutely tiny the vast majority of people who watch a professional fight have almost no technical understanding of What's going on in front of them?"}, {"time": 1945, "text": "So how do they relate to the fight?"}, {"time": 1945, "text": "What's the only way they can?"}, {"time": 2055, "text": "I believe also Emotion can be used as a weapon For example, I've learned I've learned this from my favorite boxer is sugar a Leonard Sugar a Leonard."}, {"time": 2069, "text": "I remember I was very young So I watched his fight later when I was older, but I know that sugar a Leonard Was the best boxer of his era to me personally and I don't think nobody could beat him I think it was skill skill wise it was the best."}, {"time": 2132, "text": "So that's why I never got involved that was my way to defend myself against Some kind of bullying is to put like a like a shield in front but some other guy like Gordon he expressed himself differently."}, {"time": 2147, "text": "Of course, there's a language barrier, but for him he's better at Given giving giving back that says he's a better counter attacker, you know that's the way you respond to to to the aggression of An emotional attack."}, {"time": 2162, "text": "I think everybody is different in that regards."}, {"time": 2162, "text": "What's interesting that John said that he doesn't Study the tactics of this game or maybe you're not interested in the tactics of this game Because it seems like this is more than just being an entertainer It seems like it could be an effective part of the match."}, {"time": 2179, "text": "Yeah, I just feel like whatever investment you make in that is It's going to get negligible rewards first of all, it's probably only going to pertain to one match in front of you rather than the totality of your career and Whatever gains you get out of psychological trickery and play Typically Don't last long you you've raised an excellent example with sugar rate Leonard."}, {"time": 2203, "text": "He did fight outside of his usual manner in that regard, but rather than me try to tell someone hey Behave like this before a fight I would have been probably more forceful between rounds with an athlete and say no No, you're fighting this fight the wrong way and that would have a much more beneficial impact on my athletes and Psychological trickery before a fight."}, {"time": 2230, "text": "I believe another example of Emotion that leads to failure is a Jose Aldo against Connor McGregor."}, {"time": 2239, "text": "I think it was it was on purpose that Connor McGregor Did this try to bait Aldo to become over aggressive to open himself because he's an excellent counter puncher puncher That's what I believe."}, {"time": 2275, "text": "I just won It was incredibly fresh."}, {"time": 2279, "text": "It's fascinating to watch like a grown man sort of lose composure Yeah Gordon one thing I've always been very impressed with you and that's No matter how heated talk gets Before a match with you when you go out to grapple."}, {"time": 2297, "text": "You're absolutely cold Like I've you've never gone into a match carrying anything other than just cold blooded calculation and You've always been able to separate very well the idea of words and deeds."}, {"time": 2310, "text": "And I think that's always been one of your One of your strongest assets a way I often measure this is when a match is over I will ask the athlete questions about the match and If they can't answer the question, what were you doing in the fourth minute?"}, {"time": 2329, "text": "Okay What was that set up you used in in the third minute?"}, {"time": 2336, "text": "They got you into the Kimura law if they can't answer that that tells me they were just fighting on instincts and emotion But with Gordon, it's like a logbook It's like okay in the seventh minute you went for that Judy Gatami set up from from on the left side What were you thinking?"}, {"time": 2354, "text": "He can always give an answer."}, {"time": 2354, "text": "He's absolutely stone cold Speaking of emotion Speaking of emotion Gordon you will potentially if you're healthy face Andre Galvao and the ADCC coming up super fight Who is Andre Galvao for people who don't know?"}, {"time": 2373, "text": "Can you tell the story of your beef with?"}, {"time": 2379, "text": "The the emotional interaction with a man."}, {"time": 2379, "text": "Yeah, so Andre is He's considered the greatest ADCC competitor of all time multiple time black belt world champion winningest ADCC champion ever he has six six gold medals and I've been trying to compete against him Pretty much forever like since I got my black belt in 2016."}, {"time": 2429, "text": "But if he wants to compete and that's great."}, {"time": 2467, "text": "He's actually blocked me on Instagram now So he just won't engage no one from Atos will engage now But it's gonna be interesting how he how he shows up if he can keep it under control or not Do you think how do you explain that level of emotion?"}, {"time": 2481, "text": "Is this fear of losing your throne?"}, {"time": 2486, "text": "Is it or is it just a human being like with the cyborg just Just becoming emotionally unstable."}, {"time": 2491, "text": "Well, it might just be me I just have a way to get and get under people's skin."}, {"time": 2494, "text": "It's just I don't know He's he's he was he was cool for a while and then I just I don't know it just Then everyone gets like this."}, {"time": 2555, "text": "There's a lot of variables and what I have to see how my stomach is and to if I'm actually gonna show up and compete My stomach's healthy."}, {"time": 2561, "text": "I doubt that Andre will actually show up to compete I've been trying to compete against him for six years and he hasn't done it So there's no reason to think he would now is it possible for you to speak to where like your estimates are about your stomach?"}, {"time": 2574, "text": "Or is it too unclear for now still too early to tell I have this round of treatment that I'm doing until late February And I'm pretty sure that I need to do the same test They did initially to retest all my levels and then go from there So I've been feeling a little bit better."}, {"time": 2587, "text": "Like it's not nearly as bad as it used to be I was explaining to someone the other day like for the last four years I would be so nauseous that every time I would walk into a new room I'd have to actively locate a garbage can in case I have to throw up So I'm like one step above that right now."}, {"time": 2602, "text": "I'm like doing a little bit better than that So it's definitely getting a little bit better, but it's not it's not where it needs to be Can we talk about diet for just a sec because both of you George and and Gordon?"}, {"time": 2616, "text": "Like suffered from stomach issues different kind and have arrived for now for different places so can you maybe George speak to The general question of what is the best diet for performance for training like what have you learned through your career about this?"}, {"time": 2634, "text": "Well, I think everybody is different to me personally I implement fasting Time restricted eating and and prolonged fasting What's the longest you've done so far?"}, {"time": 2647, "text": "The longest I've done is five days."}, {"time": 2647, "text": "I do it quite often I do I do four times a year."}, {"time": 2652, "text": "I do three to five days water fast And I liked it."}, {"time": 2659, "text": "It helps me with inflammation."}, {"time": 2659, "text": "I think it boosts the immune system and That this about the I read papers about about this and I it helps me also feel Feel good."}, {"time": 2673, "text": "It's kind of Tera very therapeutic to physical and mental just mental It meant mental and physical because when I eat my when I break my fast and I sit at the table with with other people It doesn't matter what I eat if we all eat the same thing."}, {"time": 2750, "text": "I mean there is carbs."}, {"time": 2750, "text": "There is a lot of fruit I got a lot of the the carbs from the fruit Okay, a lot of organs organs."}, {"time": 2760, "text": "I Know a little bit about paleontology and in the past About you a prehistoric human and and I I know that And not not only about that."}, {"time": 2774, "text": "I know because I have travels a certain place in the world I want to visit the Maasai in Africa the hunter gatherer tribe and I know that when they kill an animal They go for the organs first and I know a pretty most predatory animal."}, {"time": 2785, "text": "They do the same thing So organs I believe is something that normally in our culture in the western part of the world We don't really eat but it's something that is very nutritious Have you been able to convince Gordon to try fasting?"}, {"time": 2806, "text": "Talk about diets It's a different situation."}, {"time": 2808, "text": "I think for Gordon because he's an heavyweight."}, {"time": 2808, "text": "He doesn't want to lose weight You know when the heavyweight the range of like my range was like I was a welterweight and middleweight But the heavyweight it's like some of the guys that you compete can compete against their it might be 300 pounds."}, {"time": 2819, "text": "So if you lose weight It's a it's a big problem."}, {"time": 2829, "text": "So and there is things that will work for me that might not works for Gordon, you know So we have to make his own experience and and I told Gordon sometime when everybody goes left You try to go right see how you feel with certain things experiment Not not a topic That's part of your optimization Optimal performance formula."}, {"time": 2847, "text": "Well what I used to do before my stomach issues and for those of you listening who don't know I had recurring staph infections in 2018 and I took a bunch of oral antibiotics and it just completely wiped out my stomach So I just was diagnosed."}, {"time": 2861, "text": "It was misdiagnosed as gastroparesis So for those of you messaging me on Instagram who are just watching Rogan asking me about my gastroparesis."}, {"time": 2865, "text": "That's not what I have They misdiagnosed it and I did some other tests and for four years I didn't even know what it was and then I got this I went to this doctor in California who?"}, {"time": 2882, "text": "Diagnosed me with H. Pylori and then a fungal and a bacterial overgrowth in my small intestines."}, {"time": 2915, "text": "So right now it's like rice chicken eggs fish vegetables fruits and Pretty much nothing else like anything hard to digest Anything spicy red meat fast food all that's all that's hard for me Which sucks because in Texas things?"}, {"time": 2932, "text": "Yeah barbecue And I mean this diet is really important for you John I can tell Like is it is that something you think about for athletes at all again, that's part of the I've to be honest with you I've never seen any measurable Improvement in sports performance in jiu jitsu by change of diet."}, {"time": 2953, "text": "I do believe that diet is important for longevity and Human beings and I do think it makes a difference, especially once you get past the age of 40 with regards longevity For older athletes."}, {"time": 2968, "text": "I do believe it makes some difference."}, {"time": 2968, "text": "But my observation is in athletes and In their youth and working up into their prime."}, {"time": 2975, "text": "I've seen athletes have the worst diets God bless Travis Stevens for that guy won Olympic silver medal basically on McDonald's and candy."}, {"time": 2982, "text": "Yeah George St. Pierre for 80% of your career."}, {"time": 2990, "text": "You were powered by McDonald's and coca cola To Gina Alfredo."}, {"time": 3074, "text": "A lot of them have very Strong beliefs about like this Particular food being good for them, but there's no agreement among them."}, {"time": 3084, "text": "No agreement."}, {"time": 3084, "text": "Yeah Yeah, so believe is more important than the actual time."}, {"time": 3089, "text": "Yeah I'm sorry if I can after You know after a night out when you're hanging over I Think the best thing and and I'm saying this and all certain sincerity I think the best thing to eat to me was like like a cheese cheeseburgers with We call that a puts in back home because it's very fat."}, {"time": 3111, "text": "It's greasy."}, {"time": 3111, "text": "So it up so the next day When you wake up, I think you feel better because it absorbed the outcome."}, {"time": 3117, "text": "I'm My mom told me the same story once and then I try it was like I was hung over for some party and I woke up."}, {"time": 3130, "text": "I was like probably I don't know 19 or 20 I woke up and My mom's like, yeah, just have it have a cheeseburger go go eat something greasy and I did and I was like Oh, I feel kind of better now."}, {"time": 3140, "text": "I do not know that science the exact science behind it but I I always notice and I don't know if it's placebo, but I always notice that if I I'm if I party hard and I've been drinking a lot If I don't eat before I go into bed if I don't eat Shitty food the next day will wake up and feel worse than if I eat shitty food."}, {"time": 3158, "text": "I feel better I know it sounds crazy."}, {"time": 3184, "text": "I do believe that diet is important for longevity."}, {"time": 3184, "text": "However, and For that alone it may well be worth investing time in it But with regards sports performance at least in jiu jitsu, I've never seen any significant difference Well, we had a little bit of a difference of opinion on this I think what about strength training and muscle building or at least we had a discussion about this So what do you believe is the value of?"}, {"time": 3243, "text": "That was the thing That that's how we should do it, you know for to get ready for a fight But I realized later on That it's all about efficiency and some guys they don't lift at all and they're doing pretty well, so I Do cross training mostly for longevity It's mostly for a therapeutic Like a therapy."}, {"time": 3270, "text": "It's more therapeutic than For performance is to keep my body healthy to do a certain movement that are different than what I do every day in the gym in combat sport to keep me Healthy and and athletic so all the interesting movement stuff that you've done outside the sport that was for Therapeutic mostly therapeutic."}, {"time": 3291, "text": "I think it does it could Transcend to performance, but it's mostly therapeutic."}, {"time": 3295, "text": "I do not believe that Squatting five plates or bench bench pressing three plate will make me a better fighter I do not I believe actually it could hurt me more."}, {"time": 3306, "text": "It could damage me more than than benefit me so Gordon as somebody who on instagram posts A lot of pictures of you being shredded and huge What's the value of of strength?"}, {"time": 3321, "text": "So I do like a combination John got us big into like gymnastics type movements like toes to bar and muscle ups and things like that when we were young Like toes to bar because that's like the exact motion you have to do when you're retaining guard it needs to chest So I do a lot of that stuff In combination with I do a lot of Opposite of george."}, {"time": 3343, "text": "I do a lot of bodybuilding workouts Where I do like a basic split like a chest to chest Triceps back and biceps day."}, {"time": 3350, "text": "Um, and my idea is that Weight lifting should always be a supplement to jiu jitsu."}, {"time": 3404, "text": "So that that's more for endurance and raw strength yeah, and also I think close to the competition i'll pick the intensity up and While there's no real way to get significant gains in vo2 max."}, {"time": 3450, "text": "But does muscle help you?"}, {"time": 3457, "text": "It's like the actual mass of muscle Like the actual mass of muscle like this."}, {"time": 3459, "text": "So I think being stronger will always help in a combo will always help."}, {"time": 3459, "text": "Yeah To some degree."}, {"time": 3464, "text": "It's not going to be to a degree where It overrides efficiency, but I think that It can't help being strong or can't hurt being stronger."}, {"time": 3473, "text": "There's a bunch of people who believe depending on the sport that The strength can quickly become a That have detrimental effects to efficiency Yeah, like I agree that certain kind of I mean if strength is purely is like very cleanly Purely applied to the exact movements of the sport."}, {"time": 3493, "text": "So in judo the explosiveness you need Is very difficult to replicate in any kind of way except by doing judo."}, {"time": 3542, "text": "How would you fight a silverback gorilla?"}, {"time": 3547, "text": "I mean, is there which animal do you think you can actually defeat that would be impressive that most people would say you can't you know, I actually I don't have an uh an answer to this I thought you were gonna say I want I want I want to say that me and john had like a four hour discussion on This one time i'm like, what would win bear or gorilla?"}, {"time": 3566, "text": "Uh, and he went into like this whole dissertation about how like jaguars spin underneath and like berimbolo silverbacks and kill them and like rip Their rip their artery and their legs out."}, {"time": 3573, "text": "Okay, so before we talk about strength john, let me ask you what Do you think people would be surprised by if two animals faced?"}, {"time": 3584, "text": "One of them would win and people wouldn't predict that So they would be surprised by the effectiveness of certain animal at fighting in the whether it's in the forest in the jungle So let's slow down here."}, {"time": 3593, "text": "Okay, so there's two animals of different species fighting And and most people would pick So for example, the lion gets a lot of credit for some reason i'm not exactly sure why the king of the jungle well, I You know a lot of people told me that the lion for example, the tiger can Be a lion."}, {"time": 3615, "text": "Yeah, this is one of those age old debates It's okay."}, {"time": 3618, "text": "Well in grappling in fighting it feels like some animals use teeth And some use other parts of their body also like bear actually, I don't even know how they They have extraordinarily powerful And long claws and in addition, they're powerful biters as well."}, {"time": 3635, "text": "So I wonder and the same with the silverback I don't know how much they're I love that we're having this discussion I think we need joe rogan for this discussion."}, {"time": 3645, "text": "Um, so uh Your your question has gone in about five different."}, {"time": 3651, "text": "So it started with strength."}, {"time": 3651, "text": "Uh, and let's go back there, which is Do you think for for an athlete in jiu jitsu?"}, {"time": 3660, "text": "Let's let's stick to grappling All right."}, {"time": 3665, "text": "Do you think strength strength is helpful or detrimental?"}, {"time": 3709, "text": "It's always a good thing to have better endurance It's always a good thing to have better balance or whatever other attribute you throw out there."}, {"time": 3714, "text": "Um Gordon's point was okay."}, {"time": 3822, "text": "Everyone acknowledges that these physical uh Attributes are important and everyone understands that becoming stronger or fitter is a desirable thing and every athlete should work on them The interesting question becomes okay at what point?"}, {"time": 3840, "text": "Do you start to say i'm not going to be helped by further increases?"}, {"time": 3873, "text": "It's uh, it seems to be more fun to build muscle mass Um, it's like an addiction that people have there's also economic elements too Like most people I I hate to say this but it's true."}, {"time": 3936, "text": "Yeah tank abbott No Fedor, maybe Yeah, yeah, we need at the very top."}, {"time": 3944, "text": "There's there's something about uh aesthetic Like image of strength and power."}, {"time": 3949, "text": "It's also and also a personal thing if you look at yourself in the mirror Do you like what what you see?"}, {"time": 3956, "text": "Yeah, you find yourself attractive You know, what what can you do to make you look better?"}, {"time": 3962, "text": "And I think to me to me it was something that one of the reason I work out it's also for for that Well, i'm sure if fedor looks in the mirror."}, {"time": 3967, "text": "He says I look damn good today Yeah, you could be too."}, {"time": 3971, "text": "It's also a genetic factor some people, you know, it's harder for them."}, {"time": 3971, "text": "I mean, yeah All right."}, {"time": 3978, "text": "So the question on training you guys john gordon train Often three times a day every day um, georgia had a different like, um a different approach to training so like what is uh For for no, I don't mean that in a kind of the opposite or something."}, {"time": 3995, "text": "It's just not every single day so and obviously you are legitimately at the very top Uh in terms of performance accomplishment in the field."}, {"time": 4006, "text": "So what have you learned about?"}, {"time": 4013, "text": "What it takes to train to become not just the lead but the best well, I I um A lot of people when you say train they they see training hard."}, {"time": 4020, "text": "I believe you need to be very constant Uh, and uh, very disciplined you need to train but you don't need to train hard every day That's what john, uh taught me um For me is the nervous system."}, {"time": 4036, "text": "Sometimes I feel if I load it up too much it comes to a point that you're It's too much."}, {"time": 4130, "text": "It's it's very unlikely."}, {"time": 4130, "text": "I mean it could it can happen but so I Do you remember we did the round three minutes?"}, {"time": 4137, "text": "We did all the round I was doing were three minute round So it gives a different Uh rhythm to the training it forced me to be more opportunist To be more of a finisher because I had only three minutes to to do what I needed to do So if I if I see something I need to to go for the kill right away."}, {"time": 4154, "text": "I cannot be too over patient You know what?"}, {"time": 4160, "text": "I mean?"}, {"time": 4189, "text": "I believe you need a lot of volume But when you get ready for a competition, you need some to be something that replicate What you're gonna be facing?"}, {"time": 4198, "text": "What do you what are we talking about?"}, {"time": 4203, "text": "Like is there rest days five days a week?"}, {"time": 4206, "text": "Twice a day once a day."}, {"time": 4206, "text": "Is there any one formula like that?"}, {"time": 4206, "text": "I don't know This this I don't I do not believe in overtraining."}, {"time": 4209, "text": "I believe in under arrest I believe You can be under arrest and people Always link that immediately to the volume of their how much volume they they train Which it could be something else."}, {"time": 4227, "text": "How are you feeling?"}, {"time": 4227, "text": "I'm emotionally."}, {"time": 4227, "text": "Are you you having uh, Problems, uh personal problem."}, {"time": 4233, "text": "Do you have a have a hard time sleeping because you have a like someone died or I don't know Like you you hold money you're broke or what like, you know what I mean could be anything There is something that can affect you psychologically or emotionally That made it in a way that you cannot sleep."}, {"time": 4251, "text": "Well because your your stress your cortisol level is high You're you know what?"}, {"time": 4257, "text": "I mean all these factors need to be take taken in consideration."}, {"time": 4257, "text": "It's not only about the volume of training people always think The volume of the training is the only thing that can affect Recuperation which is not you know."}, {"time": 4271, "text": "Yeah, you have to minimize the amount of stress from all kinds of factors It's a very stressful job to be a professional combat athlete whether you're a grappler a boxer a kickboxer a fighter and you need to be taking as a Into account is it more or less stressful than marriage?"}, {"time": 4288, "text": "Just kidding Uh next question, uh So, I don't know how to ask this question given what george just said but you're training three times a day And finishing And what what have you learned about what what brings out the best in you as as the elite level grappler?"}, {"time": 4313, "text": "Um, so over the recent years have actually changed it up a little bit um when I was Coming up through from white to black belt Uh, I felt that the volume was the most important so it would be anywhere from like three To seven sessions a day Um going from school to school from new york to new jersey."}, {"time": 4331, "text": "Um, and I think that the volume was very important to build the skills um where I just Didn't know how to move my body at purple belt the way that I should."}, {"time": 4341, "text": "Um, so I think that building the skills Is uh is super important."}, {"time": 4346, "text": "I think that early on volume is very important Uh now that I already have the skills built."}, {"time": 4517, "text": "You're scored by who wins the most matches over five matches As a result the application of the techniques, especially the grappling techniques has to be done at a certain pace as george pointed out realistically the maximum application time you're going to get in most situations is somewhere between 15 seconds and three minutes Even for a specialized grappler like damien meyer."}, {"time": 4614, "text": "A grappler doesn't have to face that you can be completely Exhausted and grappling and just sit in the bottom of the mountain."}, {"time": 4669, "text": "Uh exhaustion as a As a framework of learning so like from a place of exhaustion Is there any benefit to the you on the you said being at the bottom of mouth sort of understanding?"}, {"time": 4714, "text": "Yeah, there's uh, I mean for me for a recreational person getting Exhaustion allows you the great benefit to experience what it feels like to really get dominated At an even greater frequency than you otherwise would And there's something there."}, {"time": 4733, "text": "There's some animalistic thing."}, {"time": 4733, "text": "That's very unpleasant and then afterwards it takes you to a nice to a place of like, um humility and I don't know you get it forces you to rethink life in positive ways There's something about dominance."}, {"time": 4749, "text": "It can mean if you get dominated a few times you can uh, rationalize it somehow You say okay Well, I screwed this up But with when you're exhausted and you have to do like 30 minutes or 40 minutes or an hour of just being dominant Over and over and over being submitted It uh, I don't know."}, {"time": 4801, "text": "It's the it removes the bullshit It's like we see The world through some kind of fog and it just removes it and now you can see things clearly."}, {"time": 4848, "text": "I do it all the time and track and feel it it helps me to To to know myself better."}, {"time": 4854, "text": "It's a it's a good point It's like it's like the scrimmage wrestling rounds we do."}, {"time": 4881, "text": "You have to play inside your mind."}, {"time": 4881, "text": "It's it's your That keep you that keep you uh sharp, you know what I mean?"}, {"time": 4885, "text": "Because you just want to lay down and beat it Because you're completely exhausted, you know What do you think uh is the connection john between this ego pride thing?"}, {"time": 4901, "text": "Martial arts and actual violence in our with our ancestors."}, {"time": 4901, "text": "Do you think You ever plug into that?"}, {"time": 4907, "text": "Do you think that's a good thing?"}, {"time": 4910, "text": "With our ancestors."}, {"time": 4910, "text": "Do you think you ever plug into that?"}, {"time": 4914, "text": "You think there's echoes of something going on there or like you mentioned you have flaws and demons Is it deep in there somewhere?"}, {"time": 4920, "text": "Do you think we're struggling with those demons?"}, {"time": 4924, "text": "Yeah, uh, you'll need to patch up your question a little bit though."}, {"time": 4924, "text": "It's going to say we're different donations."}, {"time": 4924, "text": "Wow, that was Not only might be dominating just I mean dominating interviewing."}, {"time": 4931, "text": "No, no, no, but i'm not Patched up that question."}, {"time": 4935, "text": "Uh, it's not brother seeing where they're like, okay now we interview you But you you went down the evolution I mean, do you think do you um, I don't mean just the line between what is what is martial arts and what is violence?"}, {"time": 4951, "text": "I mean there there seems to be a gray area And that connects us to the the evolutionary ancestors."}, {"time": 4954, "text": "I mean, I I think there's a deep recognition in all of us that um, and this is The evidence for this is is so easy to uh to see in in in daily life."}, {"time": 5074, "text": "Um george used the word pride and I believe that's a big part of it."}, {"time": 5222, "text": "I really have to ask you about this then."}, {"time": 5222, "text": "There's a guy even harvard uh named richard rangham And there's a lot of people that believe this he wrote this book that um Um, basically, there's a lot of people studying is what happened?"}, {"time": 5236, "text": "How did we get from apes to humans?"}, {"time": 5241, "text": "Like what was the magic thing?"}, {"time": 5241, "text": "Right a lot of people attributed to fire and ability to cook meat There's a lot of different theories so he actually um His theory How do I describe this is basically that that the beta males won?"}, {"time": 5340, "text": "Um There's a sense in which uh That's an interesting metaphor for humanity itself everything we do in life."}, {"time": 5349, "text": "We do alone, but we grow up in this Given community and and what have you?"}, {"time": 5358, "text": "um With regards to the the whole alpha male beta male thing, um Humans are it's true."}, {"time": 5366, "text": "This fellow's correct."}, {"time": 5409, "text": "Um uh, so was the cooperation allowed us to To have a greater scale of hierarchy with the alpha male on top or the alpha creature on top."}, {"time": 5478, "text": "Um, the rise of technology Uh and the growth of community After the imposition of language, these are other things that would have been Very very important factors and and humanity's rise george."}, {"time": 5488, "text": "You made an interesting point if you look at humans Just the raw material of humans."}, {"time": 5495, "text": "We're we're We're fucking pathetic."}, {"time": 5497, "text": "We did and a predatory animal kingdom."}, {"time": 5497, "text": "We're just the absolute bottom of the food chain Um, we don't have a single effective Weapon other than better than average endurance."}, {"time": 5539, "text": "You know how i'll fight him in a deep water pool because he cannot swim So I don't have to touch him You'll be in a Because he cannot swim so I don't have to touch him you'll drown and I'll get him into the pool You know why because someone told me because we live in a community someone told me that information."}, {"time": 5555, "text": "So I know he passed it on to me Yeah, he taught you Well, you have to convince him to you have to somehow convince them to join you in the pool, which is very difficult It's very problem."}, {"time": 5570, "text": "Very very difficult."}, {"time": 5570, "text": "Um From a technical perspective john you've looked at Martial arts fighting in general and grappling."}, {"time": 5580, "text": "What's the difference between fighting and grappling?"}, {"time": 5585, "text": "That's something i'd love to Ask all of you."}, {"time": 5587, "text": "Maybe john you can start like, um, well, uh when you talk about fighting you mean unrestricted Uh mma top type fighting."}, {"time": 5594, "text": "You said unrestricted mma type fight mma type fighting So there's there's this street fighting."}, {"time": 5601, "text": "Yeah, there's mma fighting and then there's grappling It's really the sport of grappling."}, {"time": 5607, "text": "You're saying okay."}, {"time": 5607, "text": "What's the difference between mma and grappling?"}, {"time": 5607, "text": "Okay Um, see that would have been a much better question to ask."}, {"time": 5612, "text": "Um, well the uh, uh the single When you talk about grappling you're talking about jujitsu rules or yeah I mean you could maybe also mention different rule sets that somehow fundamentally challenge change the sport, you know Um in the sport of mixed martial arts uh You've got two Ways to inflict damage on the human body."}, {"time": 5759, "text": "You can make a terrible mistake End up in a terrible position and still fight your way out and win In mixed martial arts, it's much much less forgiving If you get hit and stunned your chances of recovery Are minimal you're going to get swarmed on and unless it's right at the end of the round you it's very very hard to recover From getting hit and swarmed on."}, {"time": 5879, "text": "They're completely Oriented in different directions grappling is ground centered Mma is typically standing centered at the beginning of every round you have to start standing again If I disengage from a ground grappling situation stand up and walk away from my opponent My opponent must follow me up to the feet In grappling it's the exact opposite."}, {"time": 5900, "text": "If I sit to the ground my opponent must follow me to the ground It's written into the rule set and so one is inherently ground or oriented and one is inherently standing oriented So it's more it's more difficult to dictate where the fight happens in mixed martial arts Yes, you have to be able to impose where the fight is whereas in grappling you can simply choose it."}, {"time": 5915, "text": "So George, what is uh your sense of the the difference in terms of how you approached it?"}, {"time": 5927, "text": "Uh between the two sports so you also are a student of wrestling and grappling so in preparing for fights What parts of grappling purely the sport that you have to leave behind well, I I uh I'm, very lucky."}, {"time": 5943, "text": "I had the opportunity to I train with I consider the best mentor trainer I ever ever had and I have Some of the best grapplers that I can train with they were they were there to help me through my career so uh for my training is Of course because I do not dedicate as much time in one specific area."}, {"time": 6016, "text": "What about you gordon?"}, {"time": 6016, "text": "What um, You know, what do you think is very distinct about grappling in the way you approach it versus fighting?"}, {"time": 6021, "text": "I think most of it was covered But I think that the the one one of the big things is the fact that when you're looking at mma You have a pretty general agreed upon and unified rule set where if you look at ufc versus bellator They're they have slight differences in the rules maybe um, but it's pretty much the same thing Whereas in grappling you have ebi rules, then you have adcc rules."}, {"time": 6045, "text": "You have ibgf rules."}, {"time": 6045, "text": "You have no time limit rules um, and Each rule set will play to the skills of different athletes."}, {"time": 6053, "text": "Um, if you have if you do adcc rules Uh, it generally is slightly biased towards wrestlers or if they can stall to the overtime And then hit a takedown in the overtime and not really doing jiu jitsu, but they score a takedown."}, {"time": 6165, "text": "uh, yes, I mean I have to say yes, right, um, but uh I fought him initially when I first got my black belt, um that I fought him a year later."}, {"time": 6170, "text": "So 2016 and 2017 Um, and despite what people remember about the match And whenever people talk about it's like oh, yeah, the guy who strangled gordon, but no one remembers that the first match was like a 45 minute war Um, and then the second match with the full 20 minutes of adcc and if I didn't get my back taken in like the last Minute and a half two minutes, it would have went into an overtime."}, {"time": 6256, "text": "He's anywhere near my level and um, he was much bigger than me both times We fought um the first time he was much bigger than me the second time."}, {"time": 6263, "text": "He was one weight class above me um, so now there's not going to be an advantage in Technicality and it's also not going to be a physicality advantage."}, {"time": 6272, "text": "So I think he's just going to be beat everywhere This is uh, this is a good example of the scientific response to a um, Um to a comment to a to a question."}, {"time": 6310, "text": "I think out of that entire bracket."}, {"time": 6310, "text": "Um, Felipe is probably going to be the one of the easiest matches because of the fact that I can easily take him down And if I take him down i'm going to pass his guard Whereas I feel like the other guys because they're so much bigger and they're very cagey."}, {"time": 6324, "text": "Um, it may take me a while to actually Take them to the ground."}, {"time": 6377, "text": "Maybe two what lessons you gained from that fight?"}, {"time": 6384, "text": "It was you're fighting on mine Well, maybe it also tell what happened in terms of your injury I think third round."}, {"time": 6424, "text": "So I came back standing up and there's a A famous video one that goes on the internet about when I go back in the corner And I tell my my coach i'm like, I don't know what it is."}, {"time": 6532, "text": "I find it for me for myself."}, {"time": 6532, "text": "I specialize more into Explosive takedown in the center of the octagon because I found it more economical for me What what did you see you were you're commenting john about the wrestling That was that was quite interesting."}, {"time": 6551, "text": "I mean also, can you generally comment on the fact that george sanpia who don't I don't think you wrestled I wrestle I started wrestling."}, {"time": 6560, "text": "I was 19 years old, but I wrestled some very good russian guys."}, {"time": 6560, "text": "So they took me underneath their wing and but My ability to cover distance Come from karate does not come from wrestling wrestling is how I finish once I got the leg how I finish the takedown Uh, so the the timing and the movement and the explosion required for this karate."}, {"time": 6767, "text": "It was in his country."}, {"time": 6767, "text": "It was physically banned Uh, they had to fight on indian reservations and you know, and this is way back in the wild west days of mma and so as a as a young developing athlete he had to More or less do this by himself If you ever want to hear some incredible stories talk about teenage george saint pierre Who had a coach who used to make him put on boxing gloves now?"}, {"time": 6847, "text": "I always give the same three things The athlete who can dominate the pace of the match The athlete who can dominate the direction of the match and the athlete who can dominate the setups will win the vast majority of fights They're in those three things The direction the pace and the setups you dominate all three of those You're going to win 90 of the matches."}, {"time": 6977, "text": "It's it's what he did during that time."}, {"time": 7053, "text": "How does each one win in your view if one wins or the other one wins what happened interestingly they're actually very similar in size despite the fact that George fought at welterweight and kabib fought it Lightweight if you actually see them standing next to each other the of similar height."}, {"time": 7067, "text": "Kabib's actually a little more thick set Yeah, he's actually heavier than you walking around."}, {"time": 7074, "text": "Um, uh, george walked around most of his career between 188 and 191 191 pounds And so kabib actually would ironically have a kind of size and strength advantage Uh despite being in the lighter weight division that's been the general trend as mma Has grown is that athletes will come further down and wait to make weight divisions."}, {"time": 7094, "text": "Um, Uh I believe that george has the best takedowns in history, uh in the open in the cage Um, kabib was his great strength was using the fence to facilitate takedowns."}, {"time": 7162, "text": "Um Um, yeah, it's just a fascinating idea."}, {"time": 7164, "text": "So it's almost like who gets the first takedown."}, {"time": 7164, "text": "Yeah, I do believe that They could probably stand up on each other I don't think either one of them would be able to hold the other down for a whole round Um, both of them are notoriously difficult people to hold down So I don't think that whoever won the first takedown wins the match."}, {"time": 7217, "text": "weaker Um, george would often fight both forwards and backwards."}, {"time": 7218, "text": "It was the giago elvis fight Most of the standing time."}, {"time": 7225, "text": "Yeah, it was was going backwards."}, {"time": 7225, "text": "Um That's probably the single biggest difference between the two athletes and skill level would be in the standing position um on the ground, uh Kabib slight edge and takedowns on the fence george slight edge and takedowns in the center um Ability to inflict damage on the floor roughly equal ability to fight off the back roughly equal Ability to stand up from bottom roughly equal."}, {"time": 7254, "text": "It's a very very hard match um In terms of the biggest difference in skill level is going to be in a standing position and so it would come down to um, that doesn't necessarily mean that kabib would lose in the standing position."}, {"time": 7267, "text": "He might just push it to the fence and just use match tactics where he Kept the fight on the fence for significant periods of time um Uh, and you can win rounds in that fashion."}, {"time": 7280, "text": "So it's a match that could go either way Both of them are absolutely the best that you'll ever see I've always believed the three greatest mixed martial artists i've ever seen in my life were george saint pierre kabib."}, {"time": 7346, "text": "So that was a similarity between the three of them."}, {"time": 7346, "text": "Um, all three of them Have had the ability To dominate the direction of fights when they want it to go down it goes down when they don't want it to go down It doesn't um That's why I put such a heavy emphasis on that idea that a mixed martial arts champion Must be able to determine the direction of a fight."}, {"time": 7371, "text": "It's the single most important attribute that they all must have um As to which of the three is the best it's going to come down to criteria You you can't pull them apart Which answer you give as to which of those three is the greatest of all time will come down to the criteria that you use Okay, is it being undefeated?"}, {"time": 7395, "text": "um Uh, is it the amount of time was it the quality of the opponents that they had if you do it by quality of opponents?"}, {"time": 7475, "text": "I think you In sport where you can measure the performance, uh track and field Olympic lifting you can you know someone Is better than the other one because you can measure the performance fighting."}, {"time": 7489, "text": "It's all subjective."}, {"time": 7489, "text": "We always debate of who would win but 10 the tendency in sport is that Performance get better."}, {"time": 7502, "text": "I don't think it's because the athlete necessarily get better It's because they have access to better technology knowledge And they learn from their predecessor As long as that knowledge is transferred forward Something tells me that the greatest of all time lived a few thousand years ago and it's forgotten some of the greatest warriors Like you imagine the kind of grapplers."}, {"time": 7553, "text": "A fighter of modern days facing the champion of pancration."}, {"time": 7634, "text": "Um, plato the great philosopher uh Was a pancreasianist in his youth."}, {"time": 7675, "text": "They would have funneled athletes in And brought in the best coaches and they had that for many hundreds of years like it's quite conceivable that the best pancreasian athletes were of the absolute first quality and um, uh, it it's It's so sad to think we'll never know."}, {"time": 7696, "text": "What was their skill level and uh, It's interesting to think about what kind of techniques they developed whether There's stuff we haven't discovered yet in class."}, {"time": 7705, "text": "You're talking about the most effective Of takedown strategy in wrestling and collegiate wrestling."}, {"time": 7709, "text": "So maybe let me ask first, uh, because we offline talked about this, too What is the highest percentage submission in grappling overall?"}, {"time": 7716, "text": "You have to go with the rear naked strangle strangles from the back If you look at most tournaments and most rule sets It has success across all rule sets."}, {"time": 7728, "text": "Um, all weight divisions All body types."}, {"time": 7733, "text": "It doesn't require any kind of specific Physical advantage such as height, uh in order to be effective Um, it works equally well in both fighting and grappling."}, {"time": 7742, "text": "Um It will work regardless of how physically and mentally tough your opponent is."}, {"time": 7779, "text": "So when you look at an athlete, maybe Gordon you could speak to this like What's the best, uh, you mentioned Gary with the guillotine What's the best submission to really invest in?"}, {"time": 7789, "text": "Is it the rear naked choke?"}, {"time": 7794, "text": "To really invest your development like understanding the entirety of the system that leads into that Uh, I think that I mean you have to do them all obviously But if I had like one submission that I would only one submission I could pick for the rest of my life It would definitely be a rear naked Can you explain maybe some of the actual technical details of why that's the case?"}, {"time": 7814, "text": "Well as John spoke about they're different in joint locks."}, {"time": 7814, "text": "Whereas You don't have to tap you can just let your leg break and then keep going with the strangle."}, {"time": 7818, "text": "There's there's no, uh, There's none of that."}, {"time": 7824, "text": "Um, and then it's just an inherent Advantage you have being behind someone Um, whereas if you go for an armbar you stop you start from top mount and you're facing the guy and then you put them Down and you're not directly behind them with leg locks."}, {"time": 7835, "text": "You're facing the guy Whereas when you're on someone's back you have them in a pin where you can your chest to back You have a body triangle and you're pinning the guy in place."}, {"time": 7843, "text": "He can't explode out."}, {"time": 7843, "text": "He can't grease his way out Most of the time, uh, and there's an inherent advantage you have being behind them due to the fact that We're poorly set up to deal with threats behind us So would you say that's the most dominant position jiu jitsu like more than mount?"}, {"time": 7862, "text": "More than yeah Sack control more than I think uh, if you look at most matches historically Most guys who get stuck in positions For long amounts of time are guys that they're back taking."}, {"time": 7922, "text": "They were not a standard part of class Um, and sometime around the late 1990s early 2000s people started to realize hey, this is a stronger method of control um it It greatly increases the amount of control you have over your of your opponent's hips and torso over regular hooks Uh, it's not for all athletes."}, {"time": 7945, "text": "It's difficult for most people who are of shorter thicker statue, uh, to Employ on on on big people if your opponent's very broadly built through the stomach."}, {"time": 8002, "text": "Maybe georgie can comment on like what what's the uh, the highest percentage?"}, {"time": 8009, "text": "Not statistically speaking."}, {"time": 8009, "text": "Perhaps that's also interesting as john talked about but just for you in terms of mastery of a takedown What's what's the best way to take down a human being?"}, {"time": 8020, "text": "in wrestling well, I Personally for me, it depends For every fighter are different."}, {"time": 8025, "text": "They have a different set of skill For me, I when I look someone Want to bring down a tree a big strong high tree He cut it from the base So the legs that that's what we stand on so it was to attack the leg But is it single leg double leg?"}, {"time": 8045, "text": "Is it we talked about like, uh, Well, there's also the the john smith low single."}, {"time": 8049, "text": "Actually, I don't even know if that's applicable for jiu jitsu at all Applicable for jiu jitsu at all."}, {"time": 8055, "text": "You you can use it, but it runs into the problem with submission holds Yeah, it's it's not impossible to use but without shoes and in a situation where there's a whole plethora of submission holds in the scoring It's a little more difficult to use, you know It is interesting something being a high percentage in terms of effectiveness tells a story You're saying that every athlete is different."}, {"time": 8079, "text": "But if it's more effective for most people I mean, it's interesting."}, {"time": 8122, "text": "Oh, yeah, I believe you need to the high percentage move There's a reason why it works."}, {"time": 8127, "text": "I think it's It's made for a bigger amount of people um For example, I one of my main strength Athletic strength is i'm an explosive person So i'll use technique that are explosive if I got a single leg my my one of my thing I like to do is to go for the double power double but for uh Someone else we got for example in a single leg position."}, {"time": 8151, "text": "Maybe he likes Like body throw better."}, {"time": 8157, "text": "He's more a greco guy like so or he's a judo guy."}, {"time": 8157, "text": "He's gonna go for something something else."}, {"time": 8157, "text": "So But there there is move that are I would say like you just mentioned are universal like statistically speaking."}, {"time": 8163, "text": "They're The highest percentage move that works for pretty much everybody everybody pretty much can do a an adhaka jimmy, you know It's very easy But it's not everybody that can lock a triangle with their legs So so those move like a rear naked choke adhaka jimmy is the highest percentage move because it's maybe It's maybe more accessible It's accessible for a bigger range."}, {"time": 8193, "text": "Yeah based on the physical characteristics of the people Do you draw any wisdom from these high percentages john for like in terms of what to focus on?"}, {"time": 8198, "text": "Yeah, absolutely Um juditsu has an ocean of moves and you can get lost on that ocean You can drift for a long period of time and and and that was very little to show for it So my whole thing is focus."}, {"time": 8214, "text": "We only live one lifetime And your training lifetime is even shorter than your actual lifetime so in that time I must die on the mat That is the same."}, {"time": 8227, "text": "Yeah Uh, I I put a very high value on Choosing what I believe to be the most high percentage Uh moves and putting an extraordinary amount of focus on them Um, the only problem is that in one generation a move which can be considered low percentage might actually turn out to be high Percentage in another generation, for example We talked earlier about leg locks when I was first started judice."}, {"time": 8253, "text": "They were considered the ultimate low percentage move and Uh a big part of my career has been convincing people that in fact that was That was incorrect that they can be a high percentage move if we just change our approach to them um so we can't just Follow tradition And say oh, this is low percentage."}, {"time": 8273, "text": "This is high percentage."}, {"time": 8273, "text": "It has to be part of a fairly systematic study where you investigate What are the reasons why it's high percentage or low percentage with regards to takedowns?"}, {"time": 8289, "text": "If you look at what?"}, {"time": 8314, "text": "He's going to fall down to his butt Now he might be able to recover from there, but he will fall down Even easier than that is to be behind someone Takedowns from in front of someone are difficult you go right into their hips their head their hands You go into all their defensive weapons."}, {"time": 8330, "text": "If you're already behind someone and you're doing what in america They refer to as a mat return."}, {"time": 8335, "text": "This is significantly easier than taking someone down from the front If you have control of their head in a front headlock position You have already closed distance on your opponent."}, {"time": 8346, "text": "You already have close contact."}, {"time": 8346, "text": "You don't have to worry about shooting anymore There's no sprawl out of that."}, {"time": 8351, "text": "You don't have to worry about guillotines kimoras or the uh, standard defenses Those will intrinsically be easier takedowns out of front headlock And so if we're going to talk about high percentage technique, I always go back to the mechanics of it Rather than just historical tradition because historical tradition can be wrong."}, {"time": 8365, "text": "It was wrong about leg locks It can be wrong about other things too So my primary thing is okay."}, {"time": 8374, "text": "Talk to me about mechanics That's what ultimately is going to determine whether something is high percentage or not."}, {"time": 8376, "text": "Um, Gordon pointed out earlier that when you're behind someone you have innate physical advantages over the other guy the human We the human body is set up entirely to to defend threats from the front We are poorly adapted to defending threats from the rear."}, {"time": 8458, "text": "It's possible that an outside low single leading to a double leg is much higher percentage It's like there's a lot of chain wrestling yet You know that needs to be considered as a possibility maybe a straight on and part of this cultural too Are people afraid of this kind of thing that they came to be the case with leg locks?"}, {"time": 8479, "text": "Are people aware of this?"}, {"time": 8481, "text": "Are they worried about this?"}, {"time": 8481, "text": "Are they training for this to defend this?"}, {"time": 8586, "text": "They're specific to a rule set Yeah, think about that in terms of Imagine for example in mixed martial arts if they just said hey starting next week Instead of having three five minute rounds."}, {"time": 8640, "text": "Yeah, so uh, george brought up babasar."}, {"time": 8640, "text": "I I um, will likely probably talk to babasar on this podcast and then um Um, and then john had this a skeptical look on his face about about aliens."}, {"time": 8651, "text": "So let me ask uh, john and gordon Uh, do you think there's intelligent alien civilizations out there in the universe outside of our own?"}, {"time": 8713, "text": "It could be different other color saucers Um, and that question i'm i'm i'm not at all convinced."}, {"time": 8757, "text": "Uh, I just reserve judgment."}, {"time": 8762, "text": "I just say i'm agnostic about these things."}, {"time": 8762, "text": "I think it's possible but um all the evidence that i've been showing so far was insufficient to come to any kind of definite conclusions until Aliens land in central park on tuesday afternoon at 3 p.m And get out with little alien ray guns and start shooting people."}, {"time": 8779, "text": "I didn't believe in Many of the stories that get told Well, what about if it's not little aliens with ray guns, but something very different very very difficult to detect for us humans That's very human central creature at that point."}, {"time": 8793, "text": "It's a it's a fascinating idea and it's certainly possible, but show me the evidence All right, what about you gordon Do you do you uh look at the cosmos and ponder the stars often?"}, {"time": 8804, "text": "I think it's fair points."}, {"time": 8804, "text": "John raised uh, something really interesting I saw the other day was uh, Someone posted like if an alien organ or a civilization 65 million light years away Somehow managed to look at earth They would theoretically see the dinosaurs because they're 65 million light years away."}, {"time": 8824, "text": "So like imagine us looking at Galaxies that are 100 million light years away."}, {"time": 8830, "text": "That's 100 million years ago."}, {"time": 8830, "text": "You have no idea what it looks like now Um, so that's super interesting to me about it Yeah, the the expanse is huge and so much cool stuff could be going out there."}, {"time": 8883, "text": "So we will we will perish one day."}, {"time": 8883, "text": "Yeah There's also just the the sheer difficulty of um, of Of travel through space like space is an unimaginably inhospitable environment And to the best of our knowledge This even the theoretical speeds that we can attain in space even if we could Travel at the speed of light."}, {"time": 8910, "text": "We're not even remotely close to that Still the distances that need to be traveled to get to even relatively close solar systems."}, {"time": 8913, "text": "Um, Very very long if you look at astronauts Who have spent significant amounts of time in space just orbiting the earth?"}, {"time": 8928, "text": "It has severe health effects on them."}, {"time": 8928, "text": "We're just not built for space."}, {"time": 8928, "text": "We're supposed to be In a gravitational environment, but we you're referring to your biological meat bag that's containing the essence Of the mind that is john donahoe."}, {"time": 8939, "text": "Maybe we can transfer the mind alone The the the the bag the meat the meat bag is not designed for space But maybe the but again, this is all that's of the mind."}, {"time": 8949, "text": "It's It's possible, but what do you think of concrete evidence you folks who like difficult things?"}, {"time": 8960, "text": "Uh, what do you think about uh, elon musk going to colonize mars?"}, {"time": 8964, "text": "Is this something that's going to happen?"}, {"time": 8966, "text": "Colonize mars."}, {"time": 8966, "text": "Is this something you find an interesting or a um, Aimless pursuit."}, {"time": 8975, "text": "I think it's a must or a salvation We need to leave at some point the planet because historically in the past we know that we've been bombarded by a steroid volcano There are crazy things happen here."}, {"time": 8988, "text": "It's very unstable."}, {"time": 8988, "text": "You know, we if you look at it to To a lifetime of a human being it's nothing but just look 12 000 years ago."}, {"time": 8992, "text": "What happened, you know, so so There is cataclysm that happen all the time."}, {"time": 9042, "text": "There, you know, the goal is to allow civilians to travel Perhaps in our lifetime Meaning affordably you can do so now unaffordably Traveling to space and traveling to mars are two different things."}, {"time": 9052, "text": "I think I would like to travel into space I don't know if I would like to travel all the way to mars because of the risks involved just because Boring Is there some part of you that enjoys the I think that if I was like towards the end of my life I would like to travel to mars because it'll be nice just die just for the experience."}, {"time": 9070, "text": "Yeah, but if I go to mars I'm not coming back."}, {"time": 9074, "text": "I think that's it one way ticket May with the technology we have now maybe in the future maybe our The children of our children will will be able to to experience that to go to the well the the weekend on mars Uh, well the the whole design of the starship that spacex is working on is supposed to come back Supposed to be reusable."}, {"time": 9097, "text": "So it's not it's not a one way ticket."}, {"time": 9097, "text": "That's the whole point It's always going back and forth back and forth."}, {"time": 9101, "text": "What's the time frame between two planets?"}, {"time": 9107, "text": "Like to travel from I think the current thing you'd be stuck on mars for two years But how long does it take to get from earth to mars?"}, {"time": 9112, "text": "Oh, it's pretty I'm not exactly sure but it's pretty quick It's pretty quick."}, {"time": 9117, "text": "Like, uh, I don't know and the scale of months not scale of years."}, {"time": 9117, "text": "You might not be healthy When you come back, you know, all the astronauts they experience health issues, you know, they lose a lot of muscle mass bone density."}, {"time": 9123, "text": "So Yeah, I don't think the technology is good right now."}, {"time": 9130, "text": "I mean Let's say that it is I would love to be doing it for a weekend if it's safe I would love to be the first one to do it for a professional fighter who sacrifices body for something So there's some sacrifice we do in life, right?"}, {"time": 9145, "text": "I don't want to be the first I wouldn't want to I least The other one but when I know it's it's safe."}, {"time": 9150, "text": "Okay, count me in So one of the things that people say and this is something I wonder about is It's like having children or something once you see once you're out in space and you look out and you see earth You look back at earth."}, {"time": 9163, "text": "That's an experience."}, {"time": 9163, "text": "It's not like anything else like you can't replicate it here Um is to look back at that like blue dot And that's nerve wracking Like you see like earth disappear into the distance."}, {"time": 9175, "text": "Yeah disappear Into the distance and then you get to actually stand on mars and see And just to look you're standing on the ground and you're looking out And you see the planet from which you came and where you might not be coming back But there's a challenge to the whole thing."}, {"time": 9192, "text": "Whereas the risk is tremendous And I don't know I find that risk really compelling for some reason but that could be just The exploration like I guess that's a genetic thing too."}, {"time": 9202, "text": "How much do you want to explore?"}, {"time": 9207, "text": "There's a sense though in which even in the best case scenario where they did get the technology to whisk you to mars and in a fairly short period of time it's kind of an inauthentic sense of exploration because your participation in it is no more exciting than your Participation in an airline flight to a foreign country."}, {"time": 9227, "text": "You're basically you You didn't have anything to do with the creation of the of the vessel."}, {"time": 9231, "text": "You're not in command of the vessel."}, {"time": 9264, "text": "We have nothing to contribute Okay, like you will have to tell what you do you go through like a training program you go training program and then there's uh, There's technical things you'll be contributing."}, {"time": 9276, "text": "So they would bring people You know in terms of agriculture, I don't know."}, {"time": 9280, "text": "Okay, so this is this is better This sounds like they're actual they're more like explorers like if you talked before about explorers and and human history where Magellan sets off on his boat and every person on the boat had a specific function."}, {"time": 9291, "text": "They were they were all Into the mission in a very authentic fashion if they weren't on the boat the performance of the crew would somehow suffer So this sounds much better and just with like with Magellan."}, {"time": 9376, "text": "This is why you have government organizations."}, {"time": 9376, "text": "Like what's the purpose of nasa?"}, {"time": 9383, "text": "NASA would answer that by saying okay."}, {"time": 9412, "text": "Well currently most of the funding was the spacex is nasa giving money uh to So they're making a competition who can who can get our satellites."}, {"time": 9424, "text": "We need to go to um you know for the space station to Resupply the space station or we need to launch satellites up who's going to carry those quote unquote payloads But they just need so nasa's paying whoever the heck wants to uh get kilograms of thing up into space Why did this is nasa's specialty?"}, {"time": 9448, "text": "Why did they just give up on that?"}, {"time": 9452, "text": "Well, they why they realized or mr. Musk came along and then bezos and others that said we could do it for one tenth the price So why did the why should the taxpayers pay for the why don't you nasa do what you do well?"}, {"time": 9466, "text": "You know, which is like test out cutting edge stuff."}, {"time": 9466, "text": "Make sure they're safe and now That we've developed um a car Let us let us ups and fedex take care of Doing this at scale doing it cheaper doing it better."}, {"time": 9507, "text": "We'll reuse the rocket."}, {"time": 9507, "text": "That was one of the sort of cutting edge inventions It's a dumb obvious idea Like ilan says why do you throw away the play?"}, {"time": 9518, "text": "It's the equivalent as if you flew a plane every time you threw it away Why are we every time throwing away the plane?"}, {"time": 9526, "text": "But nasa's tried that kind of thing with the space shuttle since the 1970s And yes, well, they did that with the space shuttle, but not not at the scale here that uh, it was the space shuttle was seen as this like Majestic amazing thing that requires a huge amount of investment with ilan musk is like no every basic rocket Should be reusable Nice cut cut cost cut cost."}, {"time": 9547, "text": "Do you do you think like?"}, {"time": 9551, "text": "Like the more technology we have the more advanced we become the more Specialized we need to be like is that for that reason that now they they there's different branch Like you just explained out now that so they're specialized in this but they left, you know other branch Yeah, there's there's the greater and greater specializations."}, {"time": 9566, "text": "We build up more stuff, which is fascinating because Is it making us?"}, {"time": 9574, "text": "more Dumb in a way."}, {"time": 9636, "text": "Are we capable now to do?"}, {"time": 9642, "text": "A robot that is self aware That's that's one the legged one."}, {"time": 9645, "text": "I uh, it's self aware."}, {"time": 9645, "text": "It's not self aware It's been listening, but it's not self aware."}, {"time": 9699, "text": "It just feels Like it has the magic of what is a living being And which is what humans have and I try to think about how do you replicate that into a machine?"}, {"time": 9710, "text": "So when you turn it on enough you feel like it dies every time and he reborn So for most machines, we don't feel that way."}, {"time": 9715, "text": "We don't when we unplug things Things we don't feel that way."}, {"time": 9719, "text": "I don't know why we don't feel that way."}, {"time": 9719, "text": "But I think when When the robot has certain qualities like memory Like ability to recognize you Yeah, you start to feel like you're turning off an organism So so whenever I have like the robots that recognize me And remember this is important that all the things we've experienced together Then it's like holy shit That's a that's a living thing."}, {"time": 9750, "text": "But does he remember?"}, {"time": 9750, "text": "It feels like a living thing."}, {"time": 9750, "text": "Does he remember Your robot does he remember things that happened before you unplugged it?"}, {"time": 9756, "text": "Is it like he's sleeping?"}, {"time": 9763, "text": "Like is he wake up or is he like that?"}, {"time": 9763, "text": "So right now we start to zero everything."}, {"time": 9763, "text": "Uh, no, it doesn't start at zero It remembers everything."}, {"time": 9769, "text": "That's the key."}, {"time": 9769, "text": "Every time you like you you unplug."}, {"time": 9769, "text": "Wow It's storing the memory, but the memories are basic."}, {"time": 9774, "text": "They're like they're like, okay, we walked around the kitchen and then Um, you looked at me."}, {"time": 9781, "text": "I mean the memories it's like data."}, {"time": 9781, "text": "It's just it's not like we've experienced it's able to actually Uh experience anything deep like we humans can but just the fact of memory It's like the toaster or the microwave."}, {"time": 9794, "text": "Don't don't give a shit about me They don't know me."}, {"time": 9799, "text": "They don't know me by name."}, {"time": 9828, "text": "Of course, that's kind of an anthropomorphism we do to each other But uh, that's something You know that That's something that makes me believe it's possible to create."}, {"time": 9839, "text": "Um Systems with which we can have a connection that are nonhuman like similar to dogs and cats and so on It just makes me and that's what's interesting to me because ultimately I feel like that'll help us understand ourselves And maybe practice grappling moves anyway, um Well, let me ask the uh advice question Uh, now that we're together i've asked i've spoken to john."}, {"time": 9869, "text": "I spoke to george What what advice would you give to young folks whether?"}, {"time": 9878, "text": "we're talking about sport like excelling becoming great at grappling becoming great at fighting become a great at whatever sport they take on or Life in general whether there may be in high school or in college What advice would you give them to uh, excel?"}, {"time": 9895, "text": "At that thing they take on I don't know if i'm qualified to answer this because i'm only 26 So you're at the top you said giving advice to young people."}, {"time": 9901, "text": "Um for me, I think the two biggest things are Are find something that you're both talented in and you enjoy um I think that if you enjoy something, but you're terrible at it."}, {"time": 9914, "text": "It's going to be hard for you to be successful In life at that given in that given area Um, and it's going to be hard to do something for long amounts of time Uh if you're talented at it, but you don't enjoy doing it."}, {"time": 9955, "text": "So you've been training insane amount, you know a lot you've been doing it for a long time Um, is there's is there ways to rediscover the joy in it?"}, {"time": 9988, "text": "So Who am I gonna compete against?"}, {"time": 10027, "text": "Yeah, I because you become a better and better teacher over the years."}, {"time": 10070, "text": "and long term Use certain things maybe sometimes you don't love but where you want to propel yourself in the future?"}, {"time": 10078, "text": "Not what your parent your your friend wants you to become what you you you want to become So one once you find it You cannot Doing it by yourself everything that are that is big achievement in life."}, {"time": 10088, "text": "We cannot do it doing it by ourselves so what I would say is second thing is Try to build up your team and try to build up your team to be able to achieve your goal Of people that are competent And people that you trust You need both competency and trust I see a lot of people sometime in business."}]}]