[{"title": "Botez Sisters: Chess, Streaming, and Fame | Lex Fridman Podcast #319", "id": "srUlKNLZTas", "quotes": [{"time": 313, "text": "So you'd be driving this huge van and then another car comes on a cliff and you're just waiting for it to slowly pass."}, {"time": 319, "text": "So it took all of my focus and concentration to drive well in Italy, but it was actually really relaxing because the hardest thing about making a lot of videos online is you're always thinking about it, what's coming next."}, {"time": 333, "text": "And when we were in Italy, it was so chaotic that I did not think about work for a good week and a bit."}, {"time": 339, "text": "Oh, cause you're just."}, {"time": 340, "text": "We were stressed."}, {"time": 341, "text": "I was just trying to keep us alive."}, {"time": 342, "text": "It seemed higher priority."}, {"time": 344, "text": "And that was kind of fun."}, {"time": 345, "text": "It was kind of fun."}, {"time": 346, "text": "No planning, nothing."}, {"time": 348, "text": "Just on a whim."}, {"time": 349, "text": "I wouldn't recommend it or ever do that again, but."}, {"time": 352, "text": "It sounds pretty awesome."}, {"time": 354, "text": "And we even randomly ran into two friends of ours who were in the same city and we just traveled with them for about half of the trip."}, {"time": 361, "text": "Yeah, so you just took on the chaos."}, {"time": 363, "text": "Exactly, it was an adventure."}, {"time": 364, "text": "Okay, and I see like, cause you were using your hands a lot."}, {"time": 367, "text": "You picked up some of the Italian hand gestures."}, {"time": 371, "text": "We did get yelled at by a lot of Italians."}, {"time": 374, "text": "The old Italian grandmas would come to us after breakfast cause we'd leave something on the plate and she'd be like, you could feed an entire village with that."}, {"time": 381, "text": "Tell your friends."}, {"time": 382, "text": "And we'd feel so ashamed."}, {"time": 384, "text": "Yeah, we got cursed out a lot, but it really reminded me of where we grew up and helped."}, {"time": 389, "text": "Yeah, bring back those mechanisms."}, {"time": 390, "text": "Where'd you grow up?"}, {"time": 392, "text": "We're Romanian, but it was like an immigrant neighborhood."}, {"time": 395, "text": "In Canada."}, {"time": 396, "text": "So, same if you don't finish your plate, that's disrespectful to the people who made the food."}, {"time": 402, "text": "How was the food in Italy?"}, {"time": 403, "text": "I feel like the carbs thing is too intense."}, {"time": 406, "text": "Yeah, I think very overrated in my opinion."}, {"time": 408, "text": "So I'm actually not supposed to eat gluten cause I have an allergy, but I was in Italy and it's gluten galore."}, {"time": 416, "text": "So I was actually eating a lot of it and it was very interesting cause I didn't get sick while I was in Italy, but I do while I'm in the US."}, {"time": 423, "text": "So somehow the food was actually maybe more okay for me to digest, which I appreciated, but I didn't like it as much as I thought."}, {"time": 431, "text": "Did you like the food there?"}, {"time": 432, "text": "Yeah, no, I did, I did."}, {"time": 436, "text": "I love carbs, but it feels like Vegas when I go there for the food is like, if I stay here too long, I'm gonna do things I regret."}, {"time": 448, "text": "That's what it feels like with the food."}, {"time": 450, "text": "I don't know how to moderate and everybody is pushing very large portions and while kind of eating things on you, pasta, pizza and bread, so delicious."}, {"time": 461, "text": "So yeah, I love it, but I regret everything."}, {"time": 465, "text": "So it's like, I don't wanna go to a place where I'm going to regret everything I do for too long of a time."}, {"time": 474, "text": "Yeah, surprisingly the people there though are still very fit and everyone stays in good shape, but that's probably because you're walking around all day and you're much more active than anyone."}, {"time": 482, "text": "And they also just know how to moderate food."}, {"time": 484, "text": "I think I've gotten used to the US way of eating."}, {"time": 487, "text": "The US portions."}, {"time": 489, "text": "Just a lot, always a lot and more."}, {"time": 494, "text": "And I feel in the US food advertisements are also much more in your face and you're more often reminded of junk food than we were in Italy."}, {"time": 502, "text": "So even though we were eating less healthy things, I think we were getting cravings and being pushed towards junk food less often."}, {"time": 510, "text": "All right, I gotta ask you a hard question."}, {"time": 513, "text": "So the romance languages."}, {"time": 514, "text": "So I think French is up there as like number one."}, {"time": 518, "text": "Number one in terms of?"}, {"time": 521, "text": "Who's ranking them?"}, {"time": 522, "text": "Oh, you guys speak Italian or no?"}, {"time": 525, "text": "Not Italian, but we studied French and Spanish in school."}, {"time": 529, "text": "And Romanian."}, {"time": 530, "text": "I feel like every country calls their language a romance language."}, {"time": 533, "text": "But it's Romanian, French, Spanish, Portuguese."}, {"time": 538, "text": "And I think there was one more that was like this dialect, but those are considered the romance languages."}, {"time": 543, "text": "Okay, so where would you put Italian?"}, {"time": 545, "text": "I think we got yelled at so much in Italian that it's not gonna be a love word."}, {"time": 550, "text": "So it wasn't working."}, {"time": 551, "text": "It's on the bottom of the list cause people did not use it nicely to us."}, {"time": 555, "text": "But I always really liked how French sounds."}, {"time": 559, "text": "I think something about it where maybe Spanish actually sounds nicer to the ears, but French has more character and it feels more sultry."}, {"time": 567, "text": "So I like French."}, {"time": 569, "text": "Yeah, that was my answer too."}, {"time": 571, "text": "Sultry, okay."}, {"time": 573, "text": "I feel like French, in France, I feel like I'm always being judged."}, {"time": 579, "text": "Like they're better than me."}, {"time": 580, "text": "That's what French."}, {"time": 581, "text": "They are better than us."}, {"time": 583, "text": "It's just so true."}, {"time": 585, "text": "Which is why I long to belong to that."}, {"time": 590, "text": "I like the British accent."}, {"time": 591, "text": "The British accent?"}, {"time": 593, "text": "Actually, one thing we did on our Italian trip is we just picked up British accents for the entire trip for fun."}, {"time": 600, "text": "And we forgot we were doing them to the point where we talked to British people and they'd ask us, why are you talking like that?"}, {"time": 605, "text": "We just couldn't stop."}, {"time": 607, "text": "I did feel much more elegant and mature."}, {"time": 611, "text": "People like, I don't know if they felt the same way about us, but it was more of the confidence."}, {"time": 616, "text": "You do feel like you're more poised for sure."}, {"time": 620, "text": "So how'd you guys get into chess?"}, {"time": 622, "text": "When did you first, let's say, when did you first fall in love with chess?"}, {"time": 628, "text": "So we both started playing when we were pretty young, around six years old."}, {"time": 632, "text": "That's when our dad taught us."}, {"time": 633, "text": "And I enjoyed playing chess because I had good results early on, but a lot of it was being pushed from my dad to play chess."}, {"time": 642, "text": "And I only really started loving it when we moved from Canada and we started moving a lot and chess was the one stable thing that I had."}, {"time": 650, "text": "And it was also where all of my friends were."}, {"time": 653, "text": "So it was kind of that foundational thing for me."}, {"time": 657, "text": "And that's when I started studying chess very intensely."}, {"time": 659, "text": "And when I started putting in the hours out of my own will and not because I was being pushed by my dad, that's when I started really loving it."}, {"time": 665, "text": "And I even wanted to take time off college to just focus on chess."}, {"time": 669, "text": "So training and competing?"}, {"time": 671, "text": "Training and competing, yeah."}, {"time": 672, "text": "It was when I was doing it for myself that I started getting my best results."}, {"time": 677, "text": "And actually enjoying the thing."}, {"time": 679, "text": "And really enjoying it, yeah."}, {"time": 681, "text": "I would spend summer vacations studying for tournaments and my mom would come and say, \"'You need to make friends, go leave the house.\""}, {"time": 687, "text": "And I'd be like, no, I need to play chess."}, {"time": 689, "text": "And I remember those moments."}, {"time": 691, "text": "That you rebelled by playing chess, that's awesome."}, {"time": 695, "text": "How did you get into it?"}, {"time": 696, "text": "Yeah, my experience with loving in high school is very opposite from Alex's, but right, my sister was playing and my dad taught me when I was also six."}, {"time": 704, "text": "Andrea was cool in high school, unlike me."}, {"time": 706, "text": "You were."}, {"time": 707, "text": "I wouldn't say cool, I'd say more balanced and I was interested in other hobbies."}, {"time": 711, "text": "In my childhood, if I ever really did love chess, there's certainly moments about traveling and being together with my family and spending those moments together, but those are more the social and the experiences."}, {"time": 722, "text": "But funny enough, I think my happiest moment where I really played the game for my own enjoyment was probably my most recent tournament."}, {"time": 731, "text": "Because this was after, obviously, we've been streaming and I'm no longer in high school, but when I was in school, I was always playing for college and for the results, trying to build a resume."}, {"time": 742, "text": "So I was too stressed out about the pressure to really enjoy the game."}, {"time": 745, "text": "Whereas when I just played my first tournament, so it was after a two year break because of the pandemic and it was also all live on Twitch, so there was some pressure, but it was the first time that I was really eager to study for the game, sitting and focusing since we've been streaming and not getting distracted by something else."}, {"time": 764, "text": "In years, like I said."}, {"time": 766, "text": "And the tournament experience, I hit my highest rating and it was my best tournament ever."}, {"time": 770, "text": "And I think most of that is because it came from my own enjoyment."}, {"time": 774, "text": "So you didn't enjoy the domination?"}, {"time": 776, "text": "Because I think you did really well, right?"}, {"time": 778, "text": "This is like a couple months ago?"}, {"time": 780, "text": "Oh yeah, yeah, the tournament."}, {"time": 781, "text": "Well, of course, I think the results came from enjoying the tournament."}, {"time": 784, "text": "Because I would be in high school studying triple the amount of time, like six hours every day compared to this tournament, I didn't even prepare for it."}, {"time": 792, "text": "And for three years, I wouldn't be able to pass one rating, whereas in this one tournament, I passed it by like 70 points without even any preparation."}, {"time": 799, "text": "So it was, I think, as soon as you stopped worrying about the competitions, when the games get much better."}, {"time": 804, "text": "What does it mean to pass a rating?"}, {"time": 806, "text": "So I was stuck at 1900."}, {"time": 808, "text": "1900 is 100 points off of expert."}, {"time": 812, "text": "Usually when you reach 2000, you're considered an expert, which is the rating Andrea was going for."}, {"time": 816, "text": "Okay, expert, that's a technical term or that's like a talk and trash term?"}, {"time": 820, "text": "It's more of a colloquial term where if somebody is around a 2000 and you're playing them in a tournament, they won't have the actual title next to their name, but you always say, I'm playing an expert."}, {"time": 829, "text": "What about like the more official things like master?"}, {"time": 832, "text": "Does that have to do with the rating or something else?"}, {"time": 833, "text": "Yeah, so national master in the US is when you're 2200."}, {"time": 837, "text": "Okay, and what's international master?"}, {"time": 839, "text": "International master is based off of a different system, the FIDE system, which is international."}, {"time": 844, "text": "To be an international master, it's 2400 and you have to have three international master norms."}, {"time": 852, "text": "Yeah, I think Magnus said he's a 28, six something."}, {"time": 856, "text": "That was, yeah."}, {"time": 857, "text": "And then he said, that's pretty decent."}, {"time": 860, "text": "Well, he always talks a lot about that."}, {"time": 861, "text": "But see the thing is, I think what he meant is that's a decent rating because it accurately captures his actual level."}, {"time": 869, "text": "So it's not overinflated or underinflated and so on."}, {"time": 872, "text": "And so the discussion there was how do you get to, can a human being get to 2900?"}, {"time": 878, "text": "And then he says, because my current rating is pretty decent at representing my skill level, it's gonna be a long road to actually get there."}, {"time": 886, "text": "Because it's like, so you have to beat people at your same level, that's how the number increases."}, {"time": 892, "text": "And you beat a bunch of people in the tournament, right?"}, {"time": 894, "text": "That are higher than your luck."}, {"time": 895, "text": "I did, I got very lucky."}, {"time": 896, "text": "I was playing, I was really nervous because my category was like 200 points above my rating."}, {"time": 901, "text": "And of course, I was very rusty and I didn't play in a tournament in a while, but it went pretty well."}, {"time": 907, "text": "Do you feel the pressure when you're actually recording it, like the streaming?"}, {"time": 911, "text": "It was definitely, so before every round I was vlogging and I was doing meet and greets and doing other things for the livestream."}, {"time": 918, "text": "Yeah, I saw you do a meet and greet."}, {"time": 921, "text": "You didn't know what the hell you were doing, it's great."}, {"time": 924, "text": "Like what am I, how do I do this?"}, {"time": 925, "text": "Yeah, I see."}, {"time": 927, "text": "It was actually really wholesome."}, {"time": 929, "text": "The beginning was very silly because I was just not expecting that it was gonna be more of a seminar."}, {"time": 935, "text": "I thought it was like, oh, you pose and take pictures, but they actually asked really nice, meaningful questions, but unfortunately it's bad for YouTube retention and we cut them all out, so."}, {"time": 943, "text": "Bad for YouTube?"}, {"time": 945, "text": "The good long form conversation."}, {"time": 947, "text": "So it was like questions, Q and A type of thing."}, {"time": 948, "text": "Exactly, you have to have very fast paced for YouTube and that seminar was not fast paced."}, {"time": 954, "text": "Okay, well, not everything in life needs to be on YouTube, right?"}, {"time": 957, "text": "There's like two parallel things, stuff that's fun for YouTube."}, {"time": 960, "text": "Yes, one day we'll post that Q and A. Yeah, when you guys like, when you become like ultra famous, you're currently just regular famous."}, {"time": 968, "text": "And then they'll appreciate the long, slow content, yes."}, {"time": 972, "text": "And that, the YouTube aspect, the creation aspect, does that add to the fun, ultimately, of the chess, of like your love of chess?"}, {"time": 980, "text": "Oh, for the love of chess in general or just for competing in that one tournament?"}, {"time": 984, "text": "No, love of chess in general."}, {"time": 985, "text": "I think you said that for competing for that tournament is adding pressure."}, {"time": 1022, "text": "So I would say Twitch was the thing that really changed how I approached the game."}, {"time": 1027, "text": "I think with some YouTubers, there's a pressure to be almost somebody else."}, {"time": 1031, "text": "You create a persona and you're stuck in that persona."}, {"time": 1034, "text": "I think I'm too much of a boomer to know what the hell Twitch is anyway, but it feels like when you're actually live streaming, you can't help but be who you really are."}, {"time": 1046, "text": "I think it's, oh, well, I think when you're live streaming and I've talked to a lot of other streamers about this, you kind of just over exaggerate one side of your personality."}, {"time": 1054, "text": "And of course, it's kind of like being like on all the time."}, {"time": 1057, "text": "Like you're trying to be more entertaining and sometimes you're being silly at moments or more, you take what character traits like people know you for."}, {"time": 1066, "text": "And for me, one is being like ADHD and the younger sibling who's very energetic and causes trouble, even though sometimes it's a little switch."}, {"time": 1074, "text": "Yeah, I'm sure you cause trouble just for the camera."}, {"time": 1099, "text": "And also there's things that you are really interested in about what you do."}, {"time": 1104, "text": "Like I love competitive chess where I could sit and really think about it, but I know that that is not gonna be as entertaining for stream."}, {"time": 1111, "text": "I know that's not gonna be as entertaining for YouTube."}, {"time": 1113, "text": "So you kind of have to take what you like, but then really adapt it for whatever the format is."}, {"time": 1118, "text": "And sometimes that feels inauthentic, but other times it just feels like repackaging what you love for people in a more general audience to enjoy."}, {"time": 1129, "text": "Do you feel like it's a trap a little bit as you evolve?"}, {"time": 1131, "text": "Like you're trapped in?"}, {"time": 1133, "text": "Oh, I think social media, oh, sorry, go ahead."}, {"time": 1136, "text": "Social media in general is a trap of that kind?"}, {"time": 1139, "text": "Well, so we've been trying to switch to learn how to make YouTube videos recently."}, {"time": 1143, "text": "And so much of learning YouTube school is kind of the beastification of content where you try to get to the point of the video within like the first 10 seconds to not lose people."}, {"time": 1155, "text": "The beastificate, you mean like Mr."}, {"time": 1155, "text": "Beast?"}, {"time": 1158, "text": "Yeah, where it's so fast paced, there's a reason to wait, there's high stakes."}, {"time": 1161, "text": "And everything is created to keep people watching the video and keep people on the platform."}, {"time": 1165, "text": "And in some ways it is a trap because it's harder to do the kind of content you like because you really have to squeeze it to be like, okay, well, do we have a good thumbnail for this?"}, {"time": 1176, "text": "Do we have a good title for this?"}, {"time": 1178, "text": "And that's something that we're trying to figure out how to keep true to what we wanna do."}, {"time": 1185, "text": "Yeah, see, the way I think about it is, yeah, there's a lot of stuff you can create and yeah, the Mr. Beastification process."}, {"time": 1193, "text": "But also I think about what are the videos, conversations or things I will create in this life that will be the best thing I do."}, {"time": 1204, "text": "And I try not to do things in my life that will prevent me from getting there."}, {"time": 1210, "text": "I feel like if you're always focusing on doing kind of, optimizing the thumbnail in the 10 seconds and so on, you'll never do the thing that's truly you're known for and remembered for."}, {"time": 1222, "text": "So finding that balance is tricky."}, {"time": 1225, "text": "I get that, but at the same time, this might be my own copium, which I know is a word you know now."}, {"time": 1231, "text": "Yeah, I'm slowly learning the full complexity of the term, yes."}, {"time": 1235, "text": "But the other way I think about it is, it is a skill to learn how to communicate with large audiences."}, {"time": 1244, "text": "And first I started streaming chess, which is something I just did and really loved, but now I have to learn how to translate that format."}, {"time": 1252, "text": "And if that's a skillset we could build, then we could use it to do really important things."}, {"time": 1257, "text": "And I've seen a lot of YouTubers who have done interviews about how, they didn't love the kind of content they did at first, but what they're doing right now is really meaningful."}, {"time": 1266, "text": "So I like to think of it, maybe like skill development, cause not everybody hits off podcasts where they can talk to super interesting people right off the bat."}, {"time": 1274, "text": "Yeah, you can be slow and boring in a podcast."}, {"time": 1277, "text": "You don't have to worry about the first 10 seconds."}, {"time": 1279, "text": "I mean, people like keep pushing me for, cause the first 10 seconds of the videos I do is, well, I know it's most important for YouTube, but I don't give a damn."}, {"time": 1288, "text": "I wrote a Chrome extension that hides all the views and likes."}, {"time": 1292, "text": "I don't look at the click through."}, {"time": 1294, "text": "I don't look at Twitch views, Andrea does."}, {"time": 1297, "text": "So we also can relate."}, {"time": 1299, "text": "I love numbers too, but that's why I don't look at it."}, {"time": 1301, "text": "Cause you become like, oh, you'll start to think that a conversation or I think you did sucks because it doesn't get views, but that's just not the case."}, {"time": 1310, "text": "YouTube algorithm is this monster that figures stuff out."}, {"time": 1314, "text": "And if you let it control your mind, I feel like it's going to destroy you creatively."}, {"time": 1318, "text": "So you have to find a nice balance."}, {"time": 1321, "text": "I have to say, I was laughing a little bit when I was listening to the Magnus episode and the first 10 minutes, you guys are talking about soccer, football."}, {"time": 1328, "text": "Two robots seem human in the conversation."}, {"time": 1331, "text": "I was like, let's have some fun, make conversation about non chess related topics."}, {"time": 1337, "text": "Yeah, talk about sports."}, {"time": 1339, "text": "Yeah, it was kind of hilarious."}, {"time": 1340, "text": "I was surprised that even at his level, I wasn't sure, but I was surprised how much he loves chess."}, {"time": 1348, "text": "It sounds cliche to say, but like the way he looked at a chess board, you know those memes like, I wish somebody looked at me the way he still like the way he glanced down and he reached for the pieces with excitement to show me something."}, {"time": 1362, "text": "There was, there wasn't like, okay, I'll show you."}, {"time": 1365, "text": "It was like, like there was still that fire."}, {"time": 1369, "text": "That's something that always shocks me about some of like super grandmasters."}, {"time": 1373, "text": "Like one of my coaches was a person who also, his name's GM Hammer of Norway."}, {"time": 1378, "text": "He also coached Magnus."}, {"time": 1380, "text": "He was his second and he was helping me train for my tournament."}, {"time": 1384, "text": "And I was kind of putting off doing the homework."}, {"time": 1386, "text": "He's like, if you're putting it off, that means you're studying the wrong thing."}, {"time": 1389, "text": "Like you should be enjoying even when you're practicing, which when I grew up, I thought to get to the top level, like practicing has to be hard and unpleasant."}, {"time": 1397, "text": "And when I was listening to Magnus episode, he was like, I didn't read books very much."}, {"time": 1400, "text": "Or there was one thing that you said that's like very normal for studying classical chess that he didn't do just because it didn't interest him."}, {"time": 1407, "text": "He says, I suck at puzzles."}, {"time": 1409, "text": "I don't like puzzles."}, {"time": 1410, "text": "Yeah, and he doesn't do what he doesn't enjoy."}, {"time": 1412, "text": "And that's because it's like purely driven out of passion."}, {"time": 1415, "text": "I think the internet was like, I suck at puzzles too."}, {"time": 1418, "text": "Yeah, they like that."}, {"time": 1419, "text": "They're grandmasters."}, {"time": 1421, "text": "I don't have to study at all."}, {"time": 1423, "text": "It's just, it's fun."}, {"time": 1424, "text": "And, but I think the lesson there that's really powerful is he spends most of the day thinking about chess because he wants to."}, {"time": 1431, "text": "So do whatever, if you're into getting better at chess, do whatever it takes to actually just the number of hours you spend a day thinking about chess, maximize that."}, {"time": 1440, "text": "If you're like super serious about it."}, {"time": 1442, "text": "I actually get very addicted whenever I start studying chess, which is why I don't do it as seriously when I'm focused on content."}, {"time": 1450, "text": "Cause I go through these rabbit holes where if I'm focusing on chess, I wanna be as good as I possibly can at the game."}, {"time": 1457, "text": "Otherwise it's hard for me to enjoy it cause it's such a competitive thing."}, {"time": 1461, "text": "And I remember training for tournaments and when you're training for tournaments, you even start dreaming about chess and you can stop thinking about it."}, {"time": 1469, "text": "And it's as if you're flipped into this completely different world, which is also what I like best about the game that it's a completely different living experience."}, {"time": 1478, "text": "And then you take some drugs and now you start to see things on the ceiling."}, {"time": 1481, "text": "Is there some factual hallucination like to the Queen's Gambit, like those scenes?"}, {"time": 1488, "text": "I think it's... Is that based on your life story?"}, {"time": 1491, "text": "Well, I can't say that on camera."}, {"time": 1495, "text": "Actually chess players are very careful to not take drugs."}, {"time": 1498, "text": "They drink a lot."}, {"time": 1500, "text": "They drink so much."}, {"time": 1501, "text": "It's actually crazy for how good they're able to play chess when they do."}, {"time": 1505, "text": "But when it comes to things like psychedelics or other things, they usually stay away from those cause they don't wanna mess anything up in their brain."}, {"time": 1512, "text": "So this is actually intervention."}, {"time": 1513, "text": "I saw that you mentioned somewhere, I think it was the lie detector test where you have a drinking problem."}, {"time": 1520, "text": "Is that an actual..."}, {"time": 1522, "text": "I think that's actually a meme that we like to joke about on stream because occasionally we'd have like a white claw on stream or something like that."}, {"time": 1531, "text": "And then people meme about it."}, {"time": 1532, "text": "It goes back to Andrea's point of amplifying a part of your personality to make yourself a little bit more entertaining."}, {"time": 1539, "text": "I'm gonna use that as an excuse from now on."}, {"time": 1541, "text": "This podcast is just amplifying a part of that personality."}, {"time": 1545, "text": "I'm not really like this, but have you played drunk?"}, {"time": 1548, "text": "Like Magnus has played drunk."}, {"time": 1550, "text": "He says it helps someone with the creativity."}, {"time": 1553, "text": "Well, Andrea is under 21, so she's obviously would never do that."}, {"time": 1559, "text": "But I have played while drinking."}, {"time": 1561, "text": "Actually, I enjoy playing chess and drinking more than pre gaming or going out to a club and drinking, which sounds really silly."}, {"time": 1570, "text": "And I'll usually play against opponents who are also having some beer."}, {"time": 1574, "text": "And it does make you feel like you're seeing the game from a fresher perspective where it can sometimes make you feel more confident, liquid confidence, and it does help with creativity."}, {"time": 1584, "text": "You just feel like you could pull things off, but there's also a limit."}, {"time": 1588, "text": "It's more like you've had one drink or two drink, but then it goes beyond that."}, {"time": 1591, "text": "And then you just start missing tactics and it's not worth it."}, {"time": 1594, "text": "Yeah, I think it only helps players in very short time controls."}, {"time": 1598, "text": "One time I was challenging this grandmaster on stream and we were playing bullet chess, which is one minute chess."}, {"time": 1604, "text": "And I was giving him handicaps."}, {"time": 1605, "text": "And I said, okay, you have to take four shots before the next game."}, {"time": 1608, "text": "And he just got like 10 times stronger and transformed into like the Hulk and destroyed me more than the last game."}, {"time": 1615, "text": "But of course, if you're playing like a three hour game, it's gonna get old."}, {"time": 1618, "text": "But I think in short time controls, it's amazing."}, {"time": 1620, "text": "Yeah, definitely has to be blitz."}, {"time": 1622, "text": "It has to be where it's more intuition rather than sitting and calculating."}, {"time": 1626, "text": "This is probably like negatively affecting your ability to calculate."}, {"time": 1630, "text": "How much when you guys play, when you look at the chess board, how much of it is calculation?"}, {"time": 1637, "text": "How much of it is memorized openings?"}, {"time": 1642, "text": "It really depends between short form chess."}, {"time": 1645, "text": "So five minutes, three minutes, one minute and classical chess."}, {"time": 1649, "text": "What's your favorite to play?"}, {"time": 1650, "text": "I love playing blitz now because that's most of what I do."}, {"time": 1653, "text": "And that's actually how I got into chess streaming because I couldn't spend entire weekends or weeks playing tournaments."}, {"time": 1658, "text": "I would just, while I was in college, log on and play these long blitz or bullet sessions."}, {"time": 1663, "text": "And it's very fast."}, {"time": 1664, "text": "So you don't have time to go calculate as deeply."}, {"time": 1668, "text": "You basically have to calculate short lines pretty quickly."}, {"time": 1671, "text": "And a lot of it is pattern recognition and intuition."}, {"time": 1675, "text": "As three minutes, you said?"}, {"time": 1676, "text": "Three minutes, yeah."}, {"time": 1678, "text": "And so for that, it's just basically intuition."}, {"time": 1680, "text": "A lot of it is intuition, yeah."}, {"time": 1682, "text": "See, I saw on streams you actually keep talking while playing chess."}, {"time": 1685, "text": "It seems really difficult."}, {"time": 1686, "text": "Yeah, that helps my result."}, {"time": 1687, "text": "That doesn't help my result."}, {"time": 1688, "text": "It doesn't, it hurts."}, {"time": 1689, "text": "It helps content, not the game."}, {"time": 1691, "text": "But you can still do it."}, {"time": 1692, "text": "Because it feels like how can you possibly concentrate while talking?"}, {"time": 1697, "text": "It's because so much of it is intuition."}, {"time": 1699, "text": "You're not, while you're talking, you're thinking about that topic, but then you just come to the board and you just understand what you should be doing here."}, {"time": 1706, "text": "And then sometimes you get in trouble because you're talking and you have now lost half of your time."}, {"time": 1710, "text": "You have a minute and a half, your opponent has three, and you're kind of at a disadvantage."}, {"time": 1714, "text": "But that kind of goes to show that that's how blitz chess usually works, whereas classical is very different."}, {"time": 1720, "text": "Which of you is better at chess?"}, {"time": 1721, "text": "I mean, let's do it this way."}, {"time": 1723, "text": "Can you, Andrea, can you say what, in which way is Alex stronger than you?"}, {"time": 1729, "text": "Which way is she weaker than you?"}, {"time": 1731, "text": "Not physically in terms of chess."}, {"time": 1736, "text": "Well, yes, of course she is higher rated."}, {"time": 1738, "text": "But when we do play, I think her strengths against me where she really gets me is the end game."}, {"time": 1743, "text": "She has stronger end game, so she can, and I actually have a stronger opening, but as soon as she's able to simplify."}, {"time": 1749, "text": "Andrea, I'm supposed to say what is good about you, not you."}, {"time": 1752, "text": "You know, I'm getting there."}, {"time": 1753, "text": "Well, see, this is what I'm saying, because don't worry, it's related, okay?"}, {"time": 1757, "text": "Because if I can get an advantage in the beginning of the game, but as soon as she starts trading pieces down, like my confidence drops, because I know that the end game is the hardest part of the game and the longest, and that's where she ends up beating me."}, {"time": 1769, "text": "So her end game is I think really what makes the difference."}, {"time": 1772, "text": "It sounds like her psychological warfare is better too, because if you're getting nervous."}, {"time": 1779, "text": "But it's harder to play against higher rated players, same how Magnus and former world champions have that psychological edge."}, {"time": 1786, "text": "So I think it's always going to be different for Andrea, because she knows statistically she should be winning something like one in four games, but she usually does better than that, because she's very distracting and talks a lot."}, {"time": 1798, "text": "That does help."}, {"time": 1799, "text": "What does it feel like to play a higher rated player?"}, {"time": 1801, "text": "What's the experience of that?"}, {"time": 1806, "text": "Playing somebody like Magnus."}, {"time": 1808, "text": "So it depends on how much higher rated than you they are."}, {"time": 1811, "text": "If it's someone who's like between me and Andrea, let's say it's a 200 point difference, you know they should win, but at least you still feel like you have a chance."}, {"time": 1819, "text": "I was playing in a title Tuesday, which is this tournament chess.com has every Tuesday."}, {"time": 1824, "text": "And I got really lucky, beat a GM, drew an international master, and then I got paired against Hikaru Nakamura."}, {"time": 1830, "text": "And my brain just went blank, because I just know that I'm so unlikely to win that I couldn't even play the game properly when it's that much of a difference where they should be winning like 99% of the time."}, {"time": 1842, "text": "But that's like psychological."}, {"time": 1843, "text": "So you're saying that's the biggest experience is like actually knowing the numbers and statistically thinking there's no way I can win."}, {"time": 1850, "text": "But I meant like, is there a suffocating feeling like positionally you feel like you're constantly under attack?"}, {"time": 1857, "text": "You just feel like you're slowly getting outsmarted."}, {"time": 1860, "text": "And the worst is when you don't even know what you're doing wrong."}, {"time": 1863, "text": "You come out of that and you're like, I thought I was doing great and I got slowly squeezed."}, {"time": 1868, "text": "I didn't understand what was going on."}, {"time": 1870, "text": "And you're just kind of baffled."}, {"time": 1871, "text": "It's kind of like watching AlphaZero beat up Stockfish."}, {"time": 1875, "text": "And you don't really understand why it's making certain moves or how it thought of the plan."}, {"time": 1879, "text": "You just see it slowly getting the position better."}, {"time": 1882, "text": "And that's what it feels like."}, {"time": 1884, "text": "I would add it's kind of different for me if they're someone who's significantly higher rated."}, {"time": 1889, "text": "So let's say more than like 300 points or you're playing Magnus."}, {"time": 1892, "text": "What I notice is I just feel lost straight as soon as I don't know my preparation because they know so many opening lines that they're gonna know the best line to beat you that you haven't studied."}, {"time": 1902, "text": "So then on move 10, you're like, he already has a maybe plus 0.5 advantage which is really small."}, {"time": 1908, "text": "But for someone with such a significant skill level you know you already lost at that point."}, {"time": 1913, "text": "And it's like a third of the game."}, {"time": 1917, "text": "What are the strengths and weaknesses of Andrea?"}, {"time": 1920, "text": "Andrea is very good at opening preparation."}, {"time": 1924, "text": "As she said."}, {"time": 1925, "text": "As she said, she likes bringing that up."}, {"time": 1927, "text": "I mean, she's very meticulous about it where she'll really go in and learn her lines."}, {"time": 1933, "text": "And having that initial starting confidence isn't just helpful for the opening but it helps develop your plans for the middle game."}, {"time": 1940, "text": "So I think she's very good at that."}, {"time": 1943, "text": "I think she's actually pretty good at tactical combinations."}, {"time": 1948, "text": "What is tactics?"}, {"time": 1949, "text": "Tactics is like solving puzzles or basically finding lines that are forced where if you find them, you're going to win."}, {"time": 1959, "text": "So that's like puzzles within a position."}, {"time": 1962, "text": "Whereas strategic chess is making slow moves and over the process of like 20 moves you get a slightly better position based on an understanding of the overall strategy."}, {"time": 1974, "text": "So in my extensive research review on Wikipedia, it says your most played opening is the King's Indian defense."}, {"time": 1982, "text": "In which, quote, black allows white to advance their pawns to the center of the board in the first two moves."}, {"time": 1989, "text": "Is there any truth to this?"}, {"time": 1991, "text": "So the King's Indian."}, {"time": 1993, "text": "Probably is my most played opening."}, {"time": 1995, "text": "And it's one where even when my coach who was a grandmaster taught me, he was like, so you know, I've been playing the King's Indian for 10 years and I still don't understand it."}, {"time": 2005, "text": "And it's one of those openings that computers really don't like because you do, or at least Stockfish doesn't like it."}, {"time": 2011, "text": "Maybe AlphaZero would change their mind."}, {"time": 2012, "text": "I forgot to look at what."}, {"time": 2014, "text": "Can you show me, by the way, what it is?"}, {"time": 2016, "text": "Is it white's opening or black's opening?"}, {"time": 2019, "text": "Black responds to the D4 Queen's pawn push."}, {"time": 2024, "text": "And you take your knight out to F6."}, {"time": 2026, "text": "I'll just put in the stereotypical, classical King's Indian more so to say."}, {"time": 2034, "text": "We actually have a very famous King's Indian game in the notes that we prepared."}, {"time": 2039, "text": "For the record, I asked you guys for some games that you find pretty cool and maybe to get a chance to talk about some."}, {"time": 2047, "text": "So this is the King's Indian."}, {"time": 2049, "text": "As you can see, white has much more control over the center."}, {"time": 2054, "text": "White has three pawns in the center while black has none past the fifth rank."}, {"time": 2059, "text": "And you just have this pawn on D6."}, {"time": 2061, "text": "And one of the ideas in chess is if you're not taking the center, then your plan revolves around trying to continually challenge it."}, {"time": 2069, "text": "But what is really fun about the King's Indian is that black sometimes gets these crazy King side attacks while white gets Queen side attacks."}, {"time": 2079, "text": "And even though it's a little bit suspicious for black and the computer could usually break it, it's hard to defend as a human when you're being attacked."}, {"time": 2089, "text": "But if you don't pull off the attack as black, then you're just gonna end up being lost in the end game."}, {"time": 2094, "text": "So it's like a very asymmetrical position."}, {"time": 2096, "text": "It's very asymmetrical, although a lot of people now stop playing into the classical King's Indian, even though computers give it a big advantage."}, {"time": 2104, "text": "And they play these slower lines in the King's Indian, which are less fun to play."}, {"time": 2109, "text": "What's slower mean?"}, {"time": 2110, "text": "It takes a longer time to do something interesting with?"}, {"time": 2115, "text": "They basically don't let you get as much of a King side attack because they try opening up the center and then you have no weaknesses, but you're just slowly improving the position of your pieces instead of being able to go for that King side attack."}, {"time": 2129, "text": "So for people just listening, there is the white pawns are all on the fourth row in a row together."}, {"time": 2135, "text": "That feels like a bad position."}, {"time": 2137, "text": "For black?"}, {"time": 2138, "text": "For white."}, {"time": 2139, "text": "Oh, you don't like taking the center?"}, {"time": 2141, "text": "No, I like taking the center."}, {"time": 2143, "text": "Now you're talking trash already."}, {"time": 2145, "text": "But it's just like they're like feel vulnerable there in a row together."}, {"time": 2150, "text": "Like it's like, you know, cause they're like, who's gonna defend them?"}, {"time": 2154, "text": "I guess the Knights defend and the Queen defends it."}, {"time": 2157, "text": "You're actually talking about a theme that you do see sometimes, which is called hanging pawns."}, {"time": 2162, "text": "And when you have two pawns right next to each other with no other pawns to defend them."}, {"time": 2166, "text": "Yeah, so it is a valid point."}, {"time": 2169, "text": "And actually as black, you're trying to break apart these pawns or get them to push and create some holes into the position, but it's a trade off."}, {"time": 2177, "text": "And that's a lot of what chess openings are about."}, {"time": 2180, "text": "You get more space, but you'll also end up having to protect your pawns potentially or move them forward to the point where they're overextended."}, {"time": 2187, "text": "And plus pawns being vulnerable, it's kind of fun."}, {"time": 2190, "text": "It's like, there's more stuff in danger."}, {"time": 2191, "text": "They're not, cause if it's like this, everything's like trapped, like you can't do anything."}, {"time": 2197, "text": "Everything's blocked, yeah."}, {"time": 2198, "text": "And blocked off, yeah."}, {"time": 2200, "text": "It's like you can't have fun."}, {"time": 2201, "text": "Yeah, one of the most, one of the opening principles for white is get your pawns in the center."}, {"time": 2207, "text": "So I'd say like this is actually preferable for white."}, {"time": 2211, "text": "Let's go over some opening principles."}, {"time": 2214, "text": "Cause this is a very good learning lesson for any chess beginners in the audience."}, {"time": 2221, "text": "Okay, so first thing you wanna do is control the center."}, {"time": 2224, "text": "There we go, E4, the more aggressive one."}, {"time": 2227, "text": "Isn't that like the basic vanilla move?"}, {"time": 2229, "text": "I didn't, somebody told me that's the most popular opening move in chess."}, {"time": 2235, "text": "Why is that considered aggressive?"}, {"time": 2236, "text": "So it's E4 and D4 and the king's pawn is known as being for more tactical players, whereas D4 is known for more positional players."}, {"time": 2245, "text": "So that's why it's considered more aggressive."}, {"time": 2248, "text": "Tactical."}, {"time": 2249, "text": "More gambits with E4, I think."}, {"time": 2250, "text": "So tactical means I'm gonna try to attack you."}, {"time": 2255, "text": "You're gonna try to go for puzzles and rely more on your combination abilities."}, {"time": 2262, "text": "Whereas if it's something positional, you usually have like three to four moves that are all good in the position, whereas tactics, you need to see this one line."}, {"time": 2270, "text": "So it's more precise."}, {"time": 2272, "text": "So this one's cool cause he can like, the queen can come out, the bishop can come out."}, {"time": 2277, "text": "Yeah, and that's one of the most popular checkmates and usually what you teach new students to try to cheese their friends cause then they feel really excited that they know this new trap where you bring the bishop and the queen out and you try to checkmate on F7."}, {"time": 2290, "text": "It's the trap that queen's gambit, Beth Harmon, falls for in their first game versus the janitor."}, {"time": 2296, "text": "She gets all mad cause she gets checkmated very early."}, {"time": 2298, "text": "Oh, that's the one she gets checkmated with?"}, {"time": 2301, "text": "I love how you guys were actually paying attention to the games carefully, which is pretty cool that they did a good job of improving, evolving her game throughout the show to actually represent an actual growth of a chess player."}, {"time": 2314, "text": "They really took every detail into consideration, which was cool."}, {"time": 2320, "text": "That's, I brought stuff into the center."}, {"time": 2321, "text": "We'll do the same."}, {"time": 2323, "text": "So then you want to develop your pieces."}, {"time": 2325, "text": "So in the beginning of the game, you want to take out the bishops and knights first because you don't want to start with the most valuable piece like the queen cause then it'll become a vulnerability and it'll get attacked very early on."}, {"time": 2337, "text": "And the reason you're taking out these two pieces first is cause you want to castle your king."}, {"time": 2342, "text": "So you can move a knight move or a bishop move and that's considered developing."}, {"time": 2347, "text": "So at this stage, not like even before getting a few pawns out."}, {"time": 2351, "text": "You usually want to start with getting a pawn because you want to get space in the center, but also when you push pawns, it helps free up some of your pieces."}, {"time": 2362, "text": "So usually start with one pawn first and then you could start taking out your minor pieces, which is the bishop and the knight."}, {"time": 2368, "text": "I have anxiety about a pawn just floating out there."}, {"time": 2371, "text": "Defenseless."}, {"time": 2372, "text": "But it's not attacked yet."}, {"time": 2374, "text": "See, those are what you call ghost threats."}, {"time": 2376, "text": "So you're scared of something that hasn't happened yet."}, {"time": 2378, "text": "So if I were to attack it."}, {"time": 2380, "text": "Feel like there's a deeper thing going on here."}, {"time": 2383, "text": "Actually, let's say."}, {"time": 2384, "text": "Yeah, so you're attacking the pawn in the center here and it is vulnerable, but as soon as you do that, I can develop my own knight and defend it as well."}, {"time": 2394, "text": "And now for people just listening, there's two pawns that just came out to meet each other and a couple of knights."}, {"time": 2400, "text": "You love the chess commentary."}, {"time": 2403, "text": "The pawns met after midnight."}, {"time": 2406, "text": "Well, I'm going to romanticize the game a bit."}, {"time": 2410, "text": "So like there's, if you bring out the bishops with the knights, you're matching that with the other."}, {"time": 2416, "text": "Black is going to match it."}, {"time": 2419, "text": "Whatever you're attacking with."}, {"time": 2419, "text": "Yep, he's developing."}, {"time": 2420, "text": "It's going to defend it."}, {"time": 2421, "text": "Now you could develop your bishop or your knight, whatever you'd like."}, {"time": 2425, "text": "Oh no, now you give him options."}, {"time": 2430, "text": "Now I am attacking the pawn in the center, which is what you were afraid about before, but let's see how you defend it here."}, {"time": 2441, "text": "By doing this symmetrical thing, bringing out the knight on the other side."}, {"time": 2445, "text": "And actually your other move was good as well, defending with the pawn, because then you're freeing up space for your bishop."}, {"time": 2451, "text": "So you're basically trying to develop your pieces as quickly as possible, put your pawns in the center, and then get your king to safety."}, {"time": 2459, "text": "And that's usually the basic opening tips that you get."}, {"time": 2463, "text": "And it is kind of counterintuitive that safety is in the corner of the board for a king."}, {"time": 2469, "text": "That was always confusing to me, but you know."}, {"time": 2471, "text": "Three pawns in front, though you typically don't push those."}, {"time": 2475, "text": "Maybe like one, maybe I'll go one square, but these will be like the wall of defense that keep him safe."}, {"time": 2482, "text": "But another way to also think about it is your pieces usually wanna point towards the center."}, {"time": 2488, "text": "If you have a knight closer to the center than closer to the side, it actually has more squares it can go to."}, {"time": 2494, "text": "So a huge part of it is just wanting to have flexibility for where your pieces go."}, {"time": 2498, "text": "So more pieces are going to be able to make threats in the center or even open up the position."}, {"time": 2505, "text": "So since that's where it's most likely to open, you want your king somewhere where the position will stay closed so that you have the pawns to defend."}, {"time": 2512, "text": "You know, there's like rules like this, but I always wonder, cause I've built chess engines, but then you start to wonder like, why is it that positionally these things are good?"}, {"time": 2523, "text": "Like you've built up an intuition about it, but I wish, and that's the thing that would be amazing if engines could explain, why is this kind of thing better than this kind of thing?"}, {"time": 2533, "text": "You start to build up an intuition, but if I'm just like knowing nothing about chess, it feels confusing that cornering your king, like getting him like trapped here."}, {"time": 2545, "text": "Like it feels like you could get checkmated easier there if I was just using like dumb intuition, but it seems like that's not the case."}, {"time": 2553, "text": "I imagine maybe, cause AlphaZero learned by playing games against itself, right?"}, {"time": 2558, "text": "And I imagine if you have a lot of games and you do build an intuition, because if you were to keep your king in the center, you just see that in those games, you're dealing with threats a lot more often."}, {"time": 2568, "text": "But yeah, there's shortcut rules and this doesn't even mean it's the best way to play chess as we've seen with AlphaZero kind of changing the rules of the game a little bit."}, {"time": 2578, "text": "But as a human, to learn it from scratch is a lot more difficult than to start with principles."}, {"time": 2583, "text": "So that's why beginners usually learn chess this way."}, {"time": 2587, "text": "Yeah, because you're playing other humans and the other humans have also operated on a different principles."}, {"time": 2593, "text": "And that's why people that come up now that are training with engines are just going to be much better than the people of the past because they're gonna try out weirder ideas that go against the principles of old."}, {"time": 2607, "text": "And they're gonna do like weird stuff, including sacrifices and stuff like that."}, {"time": 2610, "text": "Yeah, and I also think that's why AlphaZero was so shocking because Stockfish was using an opening database."}, {"time": 2617, "text": "So it was already based off of knowledge that humans have from playing chess for years that we just thought is how you're supposed to play."}, {"time": 2623, "text": "Whereas AlphaZero just learned from playing the game so many times and came up with very novel opening ideas."}, {"time": 2629, "text": "Were you impressed by AlphaZero?"}, {"time": 2632, "text": "Have you seen some of the games?"}, {"time": 2633, "text": "I have seen some of the games."}, {"time": 2634, "text": "I think impressed, bewildered, and motivated were the three things I experienced."}, {"time": 2641, "text": "I think Magnus said he was also impressed that it could easily be mistaken for creativity."}, {"time": 2649, "text": "That's his trash talk towards the AI."}, {"time": 2650, "text": "That was a beautiful sentence."}, {"time": 2652, "text": "I was listening to the podcast."}, {"time": 2654, "text": "I mean, as a human, I agree with him because you don't wanna give the machine the power of creativity, but if it looks creative, give it a compliment."}, {"time": 2667, "text": "I know that you're being nice to the machines in case they are ever looking back through this."}, {"time": 2673, "text": "What other principles are there for the opening?"}, {"time": 2676, "text": "You can go a little bit more forward, let's say."}, {"time": 2679, "text": "Yeah, we can finish full development."}, {"time": 2682, "text": "Positions like this, let's just say you developed all of your pieces."}, {"time": 2685, "text": "So that's like a really nice, like nobody took any pieces and we're just in a nice positional thing."}, {"time": 2693, "text": "Yeah, so it's not actually a very accurate one."}, {"time": 2696, "text": "So I'm actually, I could put a different one on the board, but usually after you've developed all of your pieces, you wanna get your queen out a little bit to connect your rooks, and you also start thinking about certain pawn pushes and getting more space."}, {"time": 2711, "text": "But another good tip is just can you improve the position of your pieces?"}, {"time": 2715, "text": "Think about timing."}, {"time": 2716, "text": "So if you've already moved a piece once and there's a piece that hasn't moved at all, then you wanna focus on the piece that hasn't moved at all to be able to have it more likely to jump into the game."}, {"time": 2726, "text": "Right, so don't move pieces multiple times."}, {"time": 2729, "text": "Like try to move it to the most optimal position."}, {"time": 2733, "text": "What, so what's the Indian, I think we kind of went over it, but did you ever say why you like it so much?"}, {"time": 2741, "text": "Because it's weird?"}, {"time": 2742, "text": "Because it's king size?"}, {"time": 2743, "text": "I liked it because it's a very fun, aggressive defense where you're just throwing your pieces towards white, and there's so many sacrificing opportunities."}, {"time": 2755, "text": "And for some reason, tactical games always feel like the most beautiful, the most satisfying, and that's what I liked about the King's Indian."}, {"time": 2763, "text": "But I also suffered a lot from this love because I would play things that are not necessarily correct, then my attack wouldn't pan out, and then I would just struggle the rest of the game having no play and just trying to defend."}, {"time": 2774, "text": "So if you're always attacking, Wikipedia also says that, that you're known for your attacking play."}, {"time": 2779, "text": "It's also known for losses according to Stanford."}, {"time": 2782, "text": "Okay, let's not bring that up."}, {"time": 2783, "text": "See Wikipedia doesn't talk trash, it just says nice things."}, {"time": 2787, "text": "Yeah, Wikipedia's a lot nicer."}, {"time": 2789, "text": "I actually played a lot of positional chess in classic because I really like the slow squeeze, but when I transitioned to playing a lot of online chess, it's almost as if I was looking for more instant gratification because it feels so much better to beat someone with an attack."}, {"time": 2806, "text": "And even if sometimes it doesn't pan out, I was okay with it because you get so many games in."}, {"time": 2811, "text": "So I think my style in online chess really changed from my classical chess."}, {"time": 2816, "text": "What about you Andrea?"}, {"time": 2817, "text": "Do you have a style?"}, {"time": 2818, "text": "Are you attacking?"}, {"time": 2819, "text": "Are you a more like conservative defensive player?"}, {"time": 2822, "text": "Are you chaotic?"}, {"time": 2823, "text": "Opening wise, I like to play more positionally."}, {"time": 2826, "text": "Like I like to push T4 and just slowly improve my pieces and slowly get an attack."}, {"time": 2830, "text": "But like Alex said, if you're playing bullet chess or blitz against viewers, you often like wanna play riskier moves that may not be as good."}, {"time": 2840, "text": "And then that's kind of when I would play more aggressive."}, {"time": 2843, "text": "But I do enjoy tournaments for that reason because then like once you're 15 moves in, which as soon as you're out of your prep, I like sitting and thinking in more positional, yeah, positional middle games."}, {"time": 2857, "text": "One of the games you found to be pretty cool was the Hakara Nakamura versus Galfan in 2009."}, {"time": 2864, "text": "And that one I think includes the King's Indian defense."}, {"time": 2869, "text": "Why is that an interesting one to you?"}, {"time": 2872, "text": "I also play the King's Indian as black and I love this model game."}, {"time": 2876, "text": "But as Alex was saying, like all these advantages for the King's Indian."}, {"time": 2880, "text": "But now there's this one line that like every higher rated player just destroys my King's Indian."}, {"time": 2886, "text": "And you see these beautiful games and like, ah, yes, I wanna play for these ideas."}, {"time": 2890, "text": "But now no one plays into it anymore and you just get demolished."}, {"time": 2893, "text": "So this is why I don't play the King's Indian anymore, but not to ruin the fun."}, {"time": 2896, "text": "It's a love hate relationship, truly."}, {"time": 2898, "text": "The reality."}, {"time": 2899, "text": "But that's like the higher level players do or does everybody?"}, {"time": 2901, "text": "Yeah, if you're studying openings and you know this line as white, you just, you automatically get the upper edge."}, {"time": 2907, "text": "And that's kind of how openings develop."}, {"time": 2909, "text": "You start having players trying new lines and then you see ones and then everybody adopts it if they think it's the best one."}, {"time": 2916, "text": "But yeah, so Hikaru is really known for his aggressive style of play."}, {"time": 2921, "text": "Is Hikaru black here or what?"}, {"time": 2922, "text": "Yeah, Hikaru is black here."}, {"time": 2923, "text": "So he's playing the King's Indian."}, {"time": 2925, "text": "And as you can see in this position, white already has a lot, a huge center advantage."}, {"time": 2931, "text": "But what Hikaru is gonna start doing even with the next move is bringing all of his pieces towards the white King side, because his plan is to start pushing his pawns towards the white King and ignore the attack that goes on in the Queen side."}, {"time": 2944, "text": "It's all of the dream attack with the King's Indian."}, {"time": 2946, "text": "So there's a complete asymmetry towards the King side and the left side of the board is a ton of pieces."}, {"time": 2954, "text": "Wow, he moved the knight like three times in a row."}, {"time": 2957, "text": "Yep, and that's what you need to do because you have to move the knight in order to make space for your pawn."}, {"time": 2962, "text": "So again, this is why it's so counterintuitive and Stockfish doesn't like it."}, {"time": 2966, "text": "You're putting almost most of your pieces on the back rank and you're pushing your King side pawns and you're blocking your own dark squared Bishop."}, {"time": 2973, "text": "So none of it makes sense."}, {"time": 2975, "text": "You're mimicking it, that's awesome."}, {"time": 2977, "text": "Okay, so yeah, here you see white going for a Queen side attack, black going for the King side attack and you can keep going a little bit and I'll wait to where he starts with the pretty sacrifices."}, {"time": 2987, "text": "It's more fun to analyze games in person than on the computer, I think."}, {"time": 2993, "text": "Okay, so here Hikaru is preparing the attack and what I really like about this game is that he finds these tactics that are not necessarily what a computer would go for but it's very hard to face as a human and that's why a lot of people play the King's Indian because in practice it's hard to defend against."}, {"time": 3012, "text": "So we can keep moving a little bit forward."}, {"time": 3019, "text": "Yep, so white is just continuing the King side plan."}, {"time": 3021, "text": "No, is that like the first piece I think that's taken in the game?"}, {"time": 3025, "text": "Yep, that's the first trade."}, {"time": 3026, "text": "Attack begins."}, {"time": 3027, "text": "Exactly, Hikaru had to pause his attack for a little bit to just make sure that white didn't have two dire threats on the Queen side."}, {"time": 3035, "text": "So cool to see the asymmetry of this thing."}, {"time": 3037, "text": "Exactly, that's what's beautiful about the King's Indian."}, {"time": 3039, "text": "And just one thing to highlight because his rook move here is very bizarre and typically like a computer probably didn't like this but the ideas are interesting because this is a major weakness for black that they're coming to attack and he's also making room for his Bishop to come backwards and challenge."}, {"time": 3056, "text": "So this is like a human like maneuver that computers would like."}, {"time": 3059, "text": "I think computers would like this though because you'd have to move it regardless because he takes the pawn here and his rook would be under attack."}, {"time": 3065, "text": "Yeah, well having looked at it, when I actually studied this as a line and this right away isn't the best move cutting computer."}, {"time": 3071, "text": "So actually that's such a good question."}, {"time": 3073, "text": "So do you guys when you study games use your mind but do you also use computers to build up your intuition of like looking at a position like this and what would a computer do and then try to understand why it wants to do that?"}, {"time": 3084, "text": "When I was studying seriously I would try to use my own mind because you're never gonna get the exact same position so you really need to notice trends and often computers will give you moves that are only specific to that position because of a certain tactic."}, {"time": 3100, "text": "But I do use computers to check what I did and make sure I didn't make any obvious blunder that I might have missed."}, {"time": 3105, "text": "What does a computer tell you?"}, {"time": 3107, "text": "Just like what is the best move or does it give you any kind of explanation of why?"}, {"time": 3112, "text": "It doesn't tell you why but it gives you the different valuations of the position like black is down a half pawn here or something like that but it hints you towards what the right move is and then it's on you to figure out why and you can usually figure out why if not right away then just by going through a few moves and being like, oh, okay, that makes sense."}, {"time": 3132, "text": "I feel like a computer will take you down with some weird lines potentially like sacrifice."}, {"time": 3138, "text": "Like why the hell am I sacrificing this?"}, {"time": 3140, "text": "Well, we'll get to the pretty sacrifice soon."}, {"time": 3144, "text": "So we could just keep playing."}, {"time": 3145, "text": "The pawns are being pushed forward."}, {"time": 3147, "text": "Yeah, and Hikaru is kind of ignoring the queen side attack here."}, {"time": 3153, "text": "They basically both only reply to each other's plan when they have to."}, {"time": 3159, "text": "This is where you convert all the podcast viewers to YouTube."}, {"time": 3164, "text": "They have no idea what we're talking about right now."}, {"time": 3166, "text": "There is a Zen like experience of just like listening and imagining."}, {"time": 3170, "text": "The board."}, {"time": 3171, "text": "Just imagine the pieces on the ceiling."}, {"time": 3172, "text": "Yeah, we should be calling them out and then people will be freaking out even more."}, {"time": 3176, "text": "Am I supposed to keep track of what the position is?"}, {"time": 3179, "text": "It's too late now."}, {"time": 3181, "text": "It's too many."}, {"time": 3182, "text": "How hard is blindfold chess?"}, {"time": 3183, "text": "Have you tried?"}, {"time": 3184, "text": "Like are you able to keep the mind?"}, {"time": 3185, "text": "I've played blindfold chess before."}, {"time": 3188, "text": "For me, it's pretty hard."}, {"time": 3189, "text": "It's not a muscle that I've trained as much and I'm very visual when it comes to chess."}, {"time": 3194, "text": "But it is one as a top player that starts becoming very second nature for you."}, {"time": 3200, "text": "Actually, this is what, I talked to Magnus about this."}, {"time": 3203, "text": "Maybe I was, again, influenced by Queen's Gambit."}, {"time": 3206, "text": "What do you actually visualize when it's in your head?"}, {"time": 3209, "text": "So for Magnus, it was a boring 2D board."}, {"time": 3212, "text": "Do you have some kind of?"}, {"time": 3213, "text": "That's every chess player, no."}, {"time": 3214, "text": "You don't have like, cause you know some chess like computer games, you can do all kinds of skins and like fancy stuff."}, {"time": 3221, "text": "You don't have any fancy stuff?"}, {"time": 3222, "text": "Sadly, I don't have like a cool 3D warrior mode on."}, {"time": 3225, "text": "It's just the basic."}, {"time": 3226, "text": "I just have the default chess base board in my head."}, {"time": 3229, "text": "Cause you don't, yeah, you can't use your brain power for adding colors to it cause you already have to keep track of the pieces."}, {"time": 3235, "text": "And it's one board at a time?"}, {"time": 3238, "text": "The current position."}, {"time": 3239, "text": "Yeah, I bet every chess."}, {"time": 3240, "text": "I wonder if there's any who hit it differently."}, {"time": 3241, "text": "There's certain players who are really good and they can even play blindfold chess and play multiple games at the same time."}, {"time": 3249, "text": "So I would be curious how they do it."}, {"time": 3251, "text": "But usually when you're thinking of one game, that's the only one in your mind."}, {"time": 3254, "text": "Yeah, but you have to do this operation where you move one piece."}, {"time": 3258, "text": "You're doing like the branch analysis."}, {"time": 3262, "text": "Like, and so you still have to somehow visualize the branching process and not forget stuff."}, {"time": 3271, "text": "Maybe that's like constant memory recall or something."}, {"time": 3274, "text": "You're always looking at one board at a time, but."}, {"time": 3276, "text": "And you're also, oh, cause you're also looking in the future."}, {"time": 3279, "text": "Cause then you have to back track."}, {"time": 3280, "text": "Calculating variations and coming back."}, {"time": 3281, "text": "I guess you're keeping the position in your memory."}, {"time": 3284, "text": "So you're remembering where all the pieces are and then you're playing it out on one board and then you can come back to the initial one that you started with that you kind of just keep in your brain and it's also easier to come back to it once you've played a position from it."}, {"time": 3297, "text": "I feel like it's that memory recall that gets you to blunder."}, {"time": 3304, "text": "So I'll like see that I'm being attacked by certain things, but then because I get so exhausted thinking about a different thing, I forget, I actually forget about an entire branch of things that I was supposed to be worried about."}, {"time": 3317, "text": "It happens very often."}, {"time": 3339, "text": "It's often called tunneling where you're just looking so deeply on one thing you forget about the rest of the board."}, {"time": 3345, "text": "And it's the worst when, at least in a beginner level, there's like a, I don't know, a Bishop just sitting there, obviously attacking your like queen or something."}, {"time": 3354, "text": "And then you just forget that Bishop exists."}, {"time": 3357, "text": "Cause if they just sit there for a few moves and don't move, you just forget their existence."}, {"time": 3362, "text": "And then it's just, yeah, that's definitely very embarrassing."}, {"time": 3365, "text": "Well, it happens to everyone, so."}, {"time": 3371, "text": "Okay, so we see a few trades happening on the queen side where he had to go for those, otherwise he's in trouble."}, {"time": 3378, "text": "And this is where the game, oh, sorry."}, {"time": 3382, "text": "This is where it gets exciting."}, {"time": 3383, "text": "Yeah, so Knight H4 is really when the sacrifice starts."}, {"time": 3388, "text": "And here the two important pawns are the ones in front of the King, cause they're helping with the entire defense and Hikaru is actually preparing to sacrifice his Knight for a pawn just so that he can continue his attack and open up the position."}, {"time": 3403, "text": "Because if you don't do that here as black and don't get some kind of attack, you are completely lost on the queen side."}, {"time": 3409, "text": "And also you've pushed all of your own king side pawns, so you're gonna be in danger."}, {"time": 3413, "text": "So it's one of those do or die moments."}, {"time": 3415, "text": "Oh, okay, so that's what makes it all in, cause the King is wide open."}, {"time": 3418, "text": "Yeah, yeah, the King is wide open and all of White's pieces are pointed towards the queen side too, where you're also cramped."}, {"time": 3426, "text": "So is the attack primarily by black done by the two pawns and the Knight?"}, {"time": 3430, "text": "And the light squared Bishop is always extremely important."}, {"time": 3433, "text": "So you don't wanna trade this in the King's Indian because it's very helpful for a lot of attacks."}, {"time": 3438, "text": "Even though it's on the other side of the board, I guess it can go all the way across in, like I'm not sure what it's doing here, but probably threatening."}, {"time": 3446, "text": "Like for example, if it was another move black could have played would be something like Bishop H3, where if you take the Bishop, you actually get mated on G2."}, {"time": 3455, "text": "With what?"}, {"time": 3456, "text": "So let's say you take here and then you could push the pawn and then it would be checkmate."}, {"time": 3460, "text": "So you're kind of using your Bishop to sacrifice against White's King side pawns."}, {"time": 3467, "text": "Yeah, I'll be freaking out if their Bishop did that."}, {"time": 3470, "text": "What are they up to?"}, {"time": 3471, "text": "Right, and that's the thing, this position looks very scary as White because all of Black's pawns are starting to come towards you."}, {"time": 3478, "text": "And it's one of those things where humans do start to worry in these positions, whereas computers obviously can just calculate the best line and maybe the attack doesn't go through."}, {"time": 3487, "text": "So you're saying the computer might say that the White is actually a slight favorite here?"}, {"time": 3492, "text": "Yeah, potentially."}, {"time": 3493, "text": "Okay, so then White makes a little bit of room by moving the Rook."}, {"time": 3499, "text": "And the attack begins."}, {"time": 3500, "text": "I like the commentary here."}, {"time": 3503, "text": "The Knight is hugging the King."}, {"time": 3506, "text": "And actually White can't even take the King here because then H4 and H3 is coming in."}, {"time": 3511, "text": "White can't take the Knight."}, {"time": 3512, "text": "Yeah, oh did I say King?"}, {"time": 3513, "text": "Yes, thank you, the Knight."}, {"time": 3515, "text": "White can't take the Knight because why?"}, {"time": 3517, "text": "So if White takes the Knight here, then Black starts pushing his pawn to H4 with H3 incoming and the idea of trying to defend against this is, it looks very difficult."}, {"time": 3529, "text": "So White just chooses."}, {"time": 3531, "text": "It'd be cool to watch a chess game, to experience watching it without understanding it just for a day."}, {"time": 3537, "text": "Feel like I could use that to make better content."}, {"time": 3542, "text": "I mean, that's what getting drunk does."}, {"time": 3543, "text": "Unfortunately for chess players, it never leaves your brain."}, {"time": 3547, "text": "Doesn't matter how."}, {"time": 3548, "text": "But this is actually a very cute move because Black's Queen is under attack, but the King is so cramped that he can't actually take it or he's gonna get checkmated by a pawn, which is a sad way to go cruelly."}, {"time": 3560, "text": "Yeah, those pawns are doing a lot of work here."}, {"time": 3564, "text": "That is the King's Indian."}, {"time": 3564, "text": "This is the King's Indian player's dream."}, {"time": 3566, "text": "The attack of the King side pawns."}, {"time": 3569, "text": "Yeah, these pawns are like, right, so they're the ones that are doing a lot of the threatening."}, {"time": 3573, "text": "Right, and they're also opening up the position to bring more of the pieces in."}, {"time": 3577, "text": "But the pawns kind of help break open the King side, but they can't checkmate by themselves."}, {"time": 3583, "text": "So after the pawns come in, that's when you need to start bringing in pieces as well, which you will see Ahi Kar do here."}, {"time": 3590, "text": "He puts."}, {"time": 3590, "text": "One more sacrifice."}, {"time": 3592, "text": "This was actually another beautiful sacrifice in the game."}, {"time": 3596, "text": "But then puts the King in check with a pawn."}, {"time": 3599, "text": "Right, and the pawn is going to be given here for free, but the idea is you're giving your own piece because you want to have more space and open up the King, which is what you're always trying to do when you have a King side."}, {"time": 3610, "text": "You're trying to remove as many of the King's defenders as you can without giving up too much."}, {"time": 3614, "text": "And then you have a ton of pieces on the King side for black, just waiting to."}, {"time": 3621, "text": "To do harm."}, {"time": 3623, "text": "And notice how every single move, white is getting attacked."}, {"time": 3626, "text": "Like they're just never getting a break."}, {"time": 3628, "text": "Black just keeps throwing all their pieces."}, {"time": 3630, "text": "So it's funny that black's Queen has been hanging for like three moves now and white still can't do anything about it."}, {"time": 3636, "text": "So rook puts the King in check."}, {"time": 3638, "text": "The King runs."}, {"time": 3640, "text": "And then again, we leave the Queen hanging and you develop a piece, this light squared Bishop that's so important, and you're once again threatening checkmate on G2."}, {"time": 3651, "text": "And then Bishops coming to the game."}, {"time": 3653, "text": "Once again, the Queen hanging."}, {"time": 3655, "text": "I mean, the game is just so beautiful."}, {"time": 3657, "text": "The amount of calculation Hikaru put into this position."}, {"time": 3662, "text": "It feels like so much is in danger."}, {"time": 3667, "text": "And Knight takes what?"}, {"time": 3669, "text": "A pawns."}, {"time": 3669, "text": "So now his Queen is attacked twice and he doesn't care."}, {"time": 3673, "text": "He takes the Bishop and he's still threatening the checkmate on G2."}, {"time": 3678, "text": "And then the Queen takes the Bishop."}, {"time": 3681, "text": "So now he's defending against G2 and black just goes and grabs some material back here."}, {"time": 3689, "text": "So here, black is already is winning."}, {"time": 3692, "text": "Well, he ends up winning a Knight here because black had to be so much on the defensive."}, {"time": 3698, "text": "He's just taking pieces."}, {"time": 3699, "text": "Yeah, I mean at this point, you're up two whole pieces."}, {"time": 3701, "text": "So you knew it was in here."}, {"time": 3706, "text": "And Queen."}, {"time": 3707, "text": "Queen."}, {"time": 3709, "text": "And then you take, and then the rook takes and there's not as much of an attack on the King anymore, but Hikaru is up a Knight here, which is GG."}, {"time": 3721, "text": "Yeah, what's the correct way of saying that?"}, {"time": 3724, "text": "Because I played Demis Hassabis."}, {"time": 3727, "text": "I played him in chess."}, {"time": 3729, "text": "And then I quickly realized like from his facial expressions that I should have like stopped playing."}, {"time": 3737, "text": "It was like, it's already set."}, {"time": 3739, "text": "Yeah, when it's."}, {"time": 3740, "text": "And then he's like, like, this is the good time to like, give up."}, {"time": 3745, "text": "You're not gonna get to checkmate where like this, you know, he could see like, the checkmate is like five or seven moves away or something."}, {"time": 3752, "text": "And what's the play?"}, {"time": 3754, "text": "Usually you have to resign if you're in a position or you should through chess etiquette resign when you're in a position where your opponent is definitely gonna win out of respect."}, {"time": 3766, "text": "Like if you're a piece down."}, {"time": 3768, "text": "And obviously all top grandmasters do that."}, {"time": 3771, "text": "The only people who don't do that is kids because their coaches."}, {"time": 3774, "text": "They love to play till the checkmate."}, {"time": 3775, "text": "Their coaches always tell them never resign and they'll be in hopelessly lost positions playing against like two rooks, a king, and they only have their sole king, but they're still playing on."}, {"time": 3785, "text": "So that's a position where it's obvious they can't win."}, {"time": 3788, "text": "Because the kids might make errors."}, {"time": 3790, "text": "And so it might as well."}, {"time": 3791, "text": "That was the interesting thing about, I think game six of the previous world championship with Magnus."}, {"time": 3796, "text": "Was it the one where he beat Nap?"}, {"time": 3798, "text": "Yeah, the first time he beat him, where it was like, he said that, I don't know how often you come across this kind of situation."}, {"time": 3806, "text": "He said, the engines predict a draw, but that doesn't mean that it's going to be a draw."}, {"time": 3813, "text": "So you play on hoping that you take a person into, I mean, this is, I guess, an end game thing."}, {"time": 3820, "text": "You take them to deep water and they make a positional mistake or something."}, {"time": 3823, "text": "I don't know when, like he from his gut knows that this is supposed to be a draw, but he still plays on."}, {"time": 3830, "text": "Yeah, I mean, that is one where it could theoretically be a draw, but it could be very hard to defend because it's a hard technique to know as a human."}, {"time": 3839, "text": "And especially in that game, I know that Nepo was also in time pressure, which makes it even harder."}, {"time": 3845, "text": "So in situations like that, you should always continue."}, {"time": 3847, "text": "It's more where an engine would give you something like plus 10 or something where it's not just clearly a win, but anybody would know how to win."}, {"time": 3856, "text": "And that's where you're usually supposed to resign."}, {"time": 3858, "text": "So what do you find beautiful about this game?"}, {"time": 3860, "text": "Is it the attacking chess and just the asymmetry of it?"}, {"time": 3867, "text": "It's the asymmetry."}, {"time": 3868, "text": "And it's the fact that this is the dream for the King's Indian, where you're able to get a beautiful attack."}, {"time": 3876, "text": "And there was also those two really nice sacrifices where Black just continuously kept putting pressure on White's King to the point where he was able to win material."}, {"time": 3887, "text": "And the best part of it is that if the attack didn't work out, Black would have been completely lost."}, {"time": 3893, "text": "How often does that happen, by the way?"}, {"time": 3894, "text": "Like as an attacking player, how often do you put yourself in the position of like, I'm screwed unless this works out?"}, {"time": 3901, "text": "In online chess more than I should."}, {"time": 3904, "text": "And it's usually when I sacrifice, I know it's either gonna work or I'm lost."}, {"time": 3909, "text": "And those are the most fun positions to play usually."}, {"time": 3913, "text": "But in tournaments, if you're doing a sacrifice, you're playing it with 100% confidence because you're taking the time to calculate it."}, {"time": 3920, "text": "But yeah, when you have three minutes, you don't have time."}, {"time": 3923, "text": "So you take a whim and you follow your intuition and you find out later."}, {"time": 3927, "text": "Or you're very confident it'll work and you haven't calculated all the way until the end, but you've calculated to the point where you have enough in exchange for the sack and you think you could play that position."}, {"time": 3937, "text": "How do you train chess these days?"}, {"time": 3941, "text": "What's, do you practice?"}, {"time": 3944, "text": "Do you do deliberate practice?"}, {"time": 3945, "text": "I mean, you're in this tough position because you're also a creator and educator and entertainer."}, {"time": 3950, "text": "So do you try to put in time of like daily practice?"}, {"time": 3955, "text": "I don't train chess anymore when I'm focusing on creating."}, {"time": 3960, "text": "I do if I'm preparing for a tournament."}, {"time": 3962, "text": "But back in the day, I would train very seriously for tournaments."}, {"time": 3967, "text": "And the way it would work is I do opening preparation for a specific tournament because that's when you really need to have those lines memorized and you could also prepare for specific opponents."}, {"time": 3977, "text": "And I would do tactics to make sure I stay sharp."}, {"time": 3980, "text": "So those were the two things I would do every single day for a tournament and then mix up the rest with like maybe some end games, maybe some positional chess."}, {"time": 3988, "text": "So what does tactics preparation looks like?"}, {"time": 3990, "text": "Do you do like a puzzle, like a random puzzle thing?"}, {"time": 3994, "text": "Yeah, I would just train puzzles for at least like 30 to 60 minutes or books."}, {"time": 3999, "text": "And sometimes you were, and there's different kinds of puzzles."}, {"time": 4002, "text": "One you could train for pattern recognition where you're supposed to go through them very quickly."}, {"time": 4006, "text": "And that's just so that when you're playing the game, if your mind is tired, it's still keeping track of things a little bit more easily."}, {"time": 4013, "text": "And then there's where you're practicing your combination and those sometimes take like 20 minutes to find because you have to just calculate a lot."}, {"time": 4020, "text": "And it's more like making sure that you've trained with that muscle."}, {"time": 4023, "text": "But Andrea is actually very good at finding ways to balance and still study while also doing content."}, {"time": 4029, "text": "Yeah, so what, you're able to do both?"}, {"time": 4031, "text": "That's the hard thing."}, {"time": 4032, "text": "I was getting very irritated with content because I'm very competitive."}, {"time": 4036, "text": "I don't like playing chess if I'm losing."}, {"time": 4038, "text": "And if you're talking and entertaining, you're gonna be losing more games than winning."}, {"time": 4042, "text": "So then I started doing more training streams where I'd bring on my coach."}, {"time": 4047, "text": "And one of the things that I wanted to add to Alex's training repertoire."}, {"time": 4050, "text": "So I would do daily puzzles every time I'm streaming, which helped me a lot, even if it's like, there's this thing on chess.com called Puzzle Rush, where you have three minutes and you just do puzzle after puzzle where they get incrementally harder."}, {"time": 4065, "text": "And it's just a really good way to build your pattern recognition, especially when you're rusty."}, {"time": 4069, "text": "So I would do that till I hit a high score and I wouldn't play any blitz until I hit the score that I want."}, {"time": 4075, "text": "But that's kind of more like the fun part of chess studying."}, {"time": 4079, "text": "The very important one is actually analyzing your losses in your tournament games."}, {"time": 4084, "text": "And first you sit and you look through your mistake yourself and try to see if you can find the better moves."}, {"time": 4090, "text": "And then that's when you would check over with a computer to see if you're right."}, {"time": 4093, "text": "So game analysis is also very important, which I try to do."}, {"time": 4096, "text": "I remember to give a shout out, I listened to a couple of episodes of the Perpetual Chess Podcast, which is pretty good."}, {"time": 4104, "text": "But whatever I listened to, I remember the, it's, I think they really focus on like teaching people."}, {"time": 4114, "text": "How to train."}, {"time": 4115, "text": "Yeah, how to play, how to train, all that kind of stuff."}, {"time": 4117, "text": "They do like, yeah, I'm looking now, adult improver."}, {"time": 4121, "text": "So basically like how do regular noobs get better at chess?"}, {"time": 4126, "text": "One of the things that, one of the person that said, I think he was the grandmaster, but he said, to maximize the amount of time you spend every day of like, basically as you were saying, like suffering."}, {"time": 4138, "text": "So like you, it's not about the, like you should be thinking."}, {"time": 4142, "text": "You should be doing calculating."}, {"time": 4144, "text": "So it's the opposite of what Magnus said."}, {"time": 4146, "text": "Like you should be doing a lot of time."}, {"time": 4148, "text": "It doesn't matter what the puzzle is or whatever the hell you're doing, but you should be like doing that difficult calculation."}, {"time": 4154, "text": "That's how you get better."}, {"time": 4155, "text": "Yeah, it really depends what you're training."}, {"time": 4157, "text": "Cause I used to think the same, but it depends what you're weaker at."}, {"time": 4160, "text": "Cause if you're doing the really difficult puzzles, you're training for like visualization and calculating more moves ahead than you typically would, which maybe you wouldn't get into that as often in a regular game because typically you run into like three to four tactics, which are actually the easier and more fun ones to solve."}, {"time": 4177, "text": "So it really depends."}, {"time": 4179, "text": "And on top of that, as a hobbyist, your motivation is very different than when you're playing from a young age and have pretty high competitive ambition."}, {"time": 4188, "text": "And a lot of people who are new to chess, you could basically work on anything and still improve."}, {"time": 4195, "text": "So if you're focusing on something you like, you're probably gonna stick to it more and be more consistent, which I think is more helpful longterm."}, {"time": 4203, "text": "What was the most embarrassing loss of your career?"}, {"time": 4208, "text": "I had so many flashbacks, but I'm so glad it's a question for Andrea."}, {"time": 4212, "text": "I like that you specified."}, {"time": 4215, "text": "Cause."}, {"time": 4216, "text": "I mean, because you said you're so competitive and like."}, {"time": 4220, "text": "I could tell just even from the way you said it, that like you hate losing."}, {"time": 4224, "text": "Yeah, I mean, that was the reason I hated chess in high school, cause it'd always be like, but okay, there's many traumatizing losses where it's like your top three, you're running for first."}, {"time": 4234, "text": "And then you throw a game you shouldn't, and this shouldn't hurt my ego as much as it does, but it's always kids."}, {"time": 4242, "text": "Or when I was a high school girl, it's the younger boys who are really cocky."}, {"time": 4246, "text": "And when they win, they start rubbing it in your face and they're yawning and looking around when like 90% of the game you were destroying them and you had this one tiny mistake and now their ego's huge."}, {"time": 4257, "text": "But I'll never forget I was playing like for a chess scholarship."}, {"time": 4261, "text": "And it was tiebreaker for first, and I think I lost to a 12 year old girl who couldn't even use the scholarship, but she beat me in one first place and she got some other prize."}, {"time": 4272, "text": "So yeah, I was losing to that little girl who's literally like 2300 now, so makes sense."}, {"time": 4277, "text": "Right, you keep telling yourself that."}, {"time": 4278, "text": "What do you think, do you think Gasparro was feeling that when he was playing 13 year old Magnus?"}, {"time": 4286, "text": "As much as it's a beauty of the sport that any age can be brilliant, any demographic, anything, I feel like when you're adults and you're paired against the kid, it's just hard not to let it get to you."}, {"time": 4298, "text": "And it depends, maybe if they're a really sweet kid, but most of the times I play kids, they're just really arrogant."}, {"time": 4303, "text": "And I don't think they do it intentionally because they're kids."}, {"time": 4306, "text": "I mean, there is a certain etiquette thing where like you said, yawning, and in general, like it's not."}, {"time": 4312, "text": "If they're kids, there's no etiquette."}, {"time": 4315, "text": "Yeah, the kids traumatized me too."}, {"time": 4317, "text": "I was playing in Vegas and it was not even my opponent."}, {"time": 4321, "text": "It was the board next to me."}, {"time": 4323, "text": "And the kid was at least 10 years old, 12 max, and he was playing against an adult and he takes out his hand and he starts doing a fake phone to which the kid sitting across diagonally picks up their banana and starts talking like it's a phone and they're just mouthing words while their two adult opponents are thinking intensely at the game."}, {"time": 4343, "text": "And then I see the adult look up, look at the kid, just making banana phone and the despair in his eyes as he sighs."}, {"time": 4351, "text": "And they're not even doing it for trash talk."}, {"time": 4354, "text": "They're just bored."}, {"time": 4354, "text": "They're just bored kids."}, {"time": 4356, "text": "What was the, cause you play a bunch of people for your channel."}, {"time": 4361, "text": "What was the most like memorable?"}, {"time": 4363, "text": "What's the most fun, most intense?"}, {"time": 4366, "text": "There's a bunch of fun ones."}, {"time": 4367, "text": "You've played kids before, some trash talking kids."}, {"time": 4372, "text": "They trash talk kids."}, {"time": 4374, "text": "Nothing like losing a 12 year old who then starts doing a Fortnite dance."}, {"time": 4380, "text": "So that actually happened?"}, {"time": 4381, "text": "That did happen."}, {"time": 4382, "text": "He is a very young master."}, {"time": 4385, "text": "I think he became master when he was like nine years old or something."}, {"time": 4388, "text": "And he's very good at chess and doing a lot of training, but he's also incredibly good at trash talking."}, {"time": 4393, "text": "And he beat me one game and he stood up and he started doing the Fortnite dance."}, {"time": 4398, "text": "So you gotta just swallow your pride in those moments."}, {"time": 4402, "text": "What is that culture of like street chess players?"}, {"time": 4405, "text": "It seems pretty interesting."}, {"time": 4407, "text": "Like, I don't know, that seems to be celebrating the beauty of the game."}, {"time": 4411, "text": "It's the trash talking, but also having fun with it, but also taking it seriously."}, {"time": 4416, "text": "And you've done a few of those."}, {"time": 4417, "text": "Did you go to New York?"}, {"time": 4419, "text": "Yeah, in Union Square Park in Washington Square."}, {"time": 4423, "text": "It's such a unique place."}, {"time": 4426, "text": "I haven't seen it anywhere else in the US where people are just professional chess hustlers, even if they're not necessarily a top player, but they play chess every single day."}, {"time": 4438, "text": "And so many of them learn chess by themselves and never had a professional coach."}, {"time": 4443, "text": "So they are quite good at it."}, {"time": 4445, "text": "They're also very tight knit."}, {"time": 4446, "text": "They all know each other."}, {"time": 4447, "text": "And it's a very social thing where you're not just playing chess."}, {"time": 4451, "text": "It's the experience of getting to know this person who's very much a personality and they talk to you."}, {"time": 4456, "text": "They could either give you tips or they could be really chatty and talk to you during."}, {"time": 4460, "text": "So it's a chess experience rather than just playing a game."}, {"time": 4464, "text": "Do you tell them like what your rating is or do you just let people, like both ways, do you discover how good the person actually is?"}, {"time": 4471, "text": "Initially, I loved going and not telling people my rating and just surprising them and winning games."}, {"time": 4479, "text": "But now we've gone so many times that they just know us."}, {"time": 4481, "text": "So we can't get away with it anymore."}, {"time": 4483, "text": "One time, actually, I don't know if I should share this, but one time we dressed up as grandmothers and we had prosthetics on our face."}, {"time": 4491, "text": "And I think they still recognized us."}, {"time": 4494, "text": "Yeah, it's probably the, there's other components, like probably the trash talk and all that kind of stuff."}, {"time": 4498, "text": "Actually, no, it was funny."}, {"time": 4500, "text": "We were talking like grandmothers, but it was the way I held, it was the way I held them."}, {"time": 4504, "text": "Grandmother talk like, back of my day."}, {"time": 4506, "text": "No, no, no, no, no, no, we're not bringing this back."}, {"time": 4510, "text": "We're not bringing this back."}, {"time": 4511, "text": "Okay, what were your names, what were the code names?"}, {"time": 4514, "text": "I think it was Edna, Edna, and I had a really, I can't remember the other one."}, {"time": 4520, "text": "But it was embarrassing because we were walking so slowly and Andrea dropped her cane or something at one point and then people in the park came to help her."}, {"time": 4527, "text": "We felt so embarrassed."}, {"time": 4529, "text": "But yeah, it was funny."}, {"time": 4531, "text": "Cause they didn't know it was us until he saw the way I reached for my pawn."}, {"time": 4535, "text": "And he said, the way you held your pawn, I knew it was you."}, {"time": 4538, "text": "It was like such a niche thing."}, {"time": 4540, "text": "That was what blew the grandma cover."}, {"time": 4542, "text": "Yeah, do you have a style of how you play physically?"}, {"time": 4547, "text": "Is that recognizable?"}, {"time": 4547, "text": "I didn't think we did until grandma went to play chess, but."}, {"time": 4551, "text": "Yeah, I've never thought about that."}, {"time": 4553, "text": "Yeah, I think our style is just trash talking now."}, {"time": 4556, "text": "Style is very, if you're talking about style on YouTube and Twitch, we definitely have a distinctive style."}, {"time": 4564, "text": "What's your distinctive, just talking shit?"}, {"time": 4567, "text": "But not going too far."}, {"time": 4569, "text": "No, no, definitely that's, definitely going to."}, {"time": 4572, "text": "If it's us two against each other."}, {"time": 4574, "text": "Oh, we trash talk each other so hard."}, {"time": 4576, "text": "So brutally."}, {"time": 4577, "text": "And I love looking at Andrea and watching her little nose scrunch up as she's annoyed and the satisfaction I get when that happens."}, {"time": 4584, "text": "How many times do you play against each other on online publicly?"}, {"time": 4588, "text": "I think I've seen a couple of games."}, {"time": 4589, "text": "We played a lot of times."}, {"time": 4591, "text": "We try not to do it too often cause it's repetitive, but every now and then when we haven't done it for a while, we'll go at it again."}, {"time": 4596, "text": "What do you mean repetitive?"}, {"time": 4597, "text": "Is that implied trash talk right there?"}, {"time": 4600, "text": "No, it just, we play similar openings."}, {"time": 4602, "text": "So you just start seeing the same position too often."}, {"time": 4604, "text": "It's the same opening against each other every time."}, {"time": 4606, "text": "Andrea's really good at opening."}, {"time": 4608, "text": "So I just start playing bad openings to get her out of her preparation."}, {"time": 4611, "text": "Cause I don't like opening theory very much."}, {"time": 4613, "text": "I just like playing the game and getting into middle games and end games."}, {"time": 4617, "text": "But yeah, typically the only time we're playing each other is when we're setting up in the park and we don't have opponents yet and we need content."}, {"time": 4624, "text": "So we just play each other until people show up."}, {"time": 4625, "text": "But we always put stakes on the line, which makes it very interesting."}, {"time": 4629, "text": "Cause otherwise it wouldn't be fun to play each other if there's no stakes."}, {"time": 4631, "text": "Where's the most fun place you've played?"}, {"time": 4634, "text": "Is it New York?"}, {"time": 4636, "text": "And it was actually when we set up in Times Square one night, we just brought a table with us and chess."}, {"time": 4642, "text": "And it's not even where people usually play chess, but it was so lively."}, {"time": 4647, "text": "There were all of the lights out and so many people just kept stopping by to play chess."}, {"time": 4651, "text": "And it was really one of my favorite streams."}, {"time": 4653, "text": "It's just the opposite of like the classical chess world."}, {"time": 4656, "text": "It's super loud."}, {"time": 4657, "text": "There's music, there's cars, there's street dancers, even some naked people walking around who we had to be careful not to get banned."}, {"time": 4664, "text": "But I honestly really liked the chaotic environments for chess games."}, {"time": 4668, "text": "Cause I think it's a good way to break more into the mainstream culture and make it entertaining and appealing to anyone who doesn't know anything about chess."}, {"time": 4676, "text": "And also in an authentic way, because it's what we really like about chess when you're just enjoying the game, but also the atmosphere and the people who you're playing with."}, {"time": 4685, "text": "And that's one of the things that I think you see less when you're just thinking of chess as a competitive thing."}, {"time": 4692, "text": "You've mentioned a few other games, like the Bobby Fischer games, the Candidates match, the game of the century, which I feel like is a weird game to call the game of the century when there's still like a few decades left in the century."}, {"time": 4705, "text": "I mean, it wasn't an official thing."}, {"time": 4707, "text": "It was just the chess journalist."}, {"time": 4708, "text": "It's just like made on a chess article."}, {"time": 4709, "text": "But it's stuck if you look on."}, {"time": 4711, "text": "Yeah, no, it did stick."}, {"time": 4712, "text": "Again, Wikipedia."}, {"time": 4713, "text": "This is all I do research wise."}, {"time": 4714, "text": "Because there's, so that particular one was a 13 year old Fischer and he did a queen sacrifice."}, {"time": 4724, "text": "I wonder, there's that movie searching for Bobby Fischer."}, {"time": 4727, "text": "Was that related?"}, {"time": 4728, "text": "Cause didn't they have a young somebody who's supposed to be kind of like Bobby Fischer played by Josh Waitzkin."}, {"time": 4734, "text": "Yeah, I think he ended up being an international master."}, {"time": 4737, "text": "It wasn't based on Bobby Fischer."}, {"time": 4739, "text": "It was based on another player, but I liked how they told it through the lens of being inspired by Bobby Fischer."}, {"time": 4744, "text": "Do you remember that game?"}, {"time": 4745, "text": "Like why do you think it was dubbed the game of the century?"}, {"time": 4748, "text": "It was just journalists being like."}, {"time": 4750, "text": "I think part of it was the atmosphere where you have the US junior champion who's this 13 year old nobody."}, {"time": 4757, "text": "And it's the first time he's playing in a very competitive landscape against some of the top American players."}, {"time": 4763, "text": "And he goes up against an international master."}, {"time": 4766, "text": "So somebody who's a lot stronger than he is who's played in Olympiads for the American team."}, {"time": 4772, "text": "He's having a bad tournament, but then he has this one game where he just shows off his tactical prowess and plays incredibly well."}, {"time": 4781, "text": "And I don't know if this is true, but in the paper clippings of it, they'd say things like grandmasters were by the board and they would say things like, oh, Bobby is lost in this position."}, {"time": 4791, "text": "But there's this 13 year old kid who's just playing incredibly well."}, {"time": 4795, "text": "And then that also happened before Bobby's started really rapidly improving at chess."}, {"time": 4801, "text": "Not that people knew that, but he kind of seemed like a rising star."}, {"time": 4803, "text": "So I think the game was beautiful, but I also think the idea of a 13 year old kid coming out from nowhere and beating a top American player was very fascinating."}, {"time": 4812, "text": "And there was aggressive chess and it was interesting ideas."}, {"time": 4817, "text": "Yeah, taking big risks."}, {"time": 4818, "text": "It's cool to see a 13 year old do that."}, {"time": 4821, "text": "What about the, you mentioned that his match against Mark Taimano from their 71 candidates match was interesting in some way."}, {"time": 4831, "text": "Why is it interesting to you?"}, {"time": 4833, "text": "Move 45, I'm looking at some notes."}, {"time": 4836, "text": "This is with the Bishop E3."}, {"time": 4838, "text": "I think I know which one you're talking about."}, {"time": 4841, "text": "It's, I wouldn't say, a lot of these games on these lists I think are really great combinations that when tactics come into play, which is what we're talking about."}, {"time": 4852, "text": "But they're very good at exemplifying lessons."}, {"time": 4856, "text": "This is why you study famous games."}, {"time": 4858, "text": "So you can apply these lessons to your own games."}, {"time": 4860, "text": "And I think the main takeaway for this one was they're punishing their opponent from steering away from opening principles, which is something that we learned a little earlier where he delayed the development of his King and put his Queen out a little bit too exposed."}, {"time": 4877, "text": "So Bobby Fisher immediately punished that."}, {"time": 4879, "text": "And then there was just like a beautiful combination where it was like a 12 in a row perfect moves, which was a tactic, just winning the game."}, {"time": 4887, "text": "But it only came from punishing those mistakes."}, {"time": 4890, "text": "The mistake being bringing the Queen out?"}, {"time": 4892, "text": "Bringing the Queen out and yeah, not castling your King right away."}, {"time": 4895, "text": "And these were just like opening principles that now they're written in books, but for books you would study these principles by studying games."}, {"time": 4905, "text": "And also, I'm looking at some notes, his dominance during the candidate's turn was unprecedented."}, {"time": 4912, "text": "He swept two top grandmasters."}, {"time": 4914, "text": "I mean, that guy's meteoric rise is incredible."}, {"time": 4917, "text": "Sad that I think at whatever in his 20s, he then quit chess."}, {"time": 4923, "text": "One has to wonder where he could have gone."}, {"time": 4927, "text": "Yeah, it is sad that we lost such a brilliant mind so early on."}, {"time": 4932, "text": "And it's also sad, I think kind of what ended up happening in his life and the slowly going crazier."}, {"time": 4938, "text": "Is there some aspect of chess that opens the door to crazy?"}, {"time": 4943, "text": "Like how challenging it is on you, the stress, the anxiety of it, the isolation."}, {"time": 4950, "text": "And being alone."}, {"time": 4952, "text": "It's a very lonely sport."}, {"time": 4953, "text": "It is, even do you guys, since you both play it, it's still lonely, the experience of it?"}, {"time": 4958, "text": "It was when I was competing a lot."}, {"time": 4960, "text": "I think the crazy part of it for me was how obsessed you can get about a board game where you're optimizing your entire life to beat another person at pushing wooden pieces across the board."}, {"time": 4973, "text": "And it doesn't necessarily translate to other things."}, {"time": 4977, "text": "And the fact that so many people spend so much of their life on it, but you can also spend so much of your life because it's so deep and so interesting."}, {"time": 4987, "text": "And I mean, I've definitely experienced moments where I didn't want to do anything but chess."}, {"time": 4993, "text": "And I had that before I went to college where I just wanted to take a gap year and focus on chess because I went to high school, we moved a lot, there was always other things going on."}, {"time": 5003, "text": "So I felt like I could never really focus on chess."}, {"time": 5006, "text": "And the one time I could, by taking a gap year, I ended up not doing because my parents really wanted me to go to university right away."}, {"time": 5013, "text": "But I think maybe if I had taken that gap year, I don't know if I would have gone back to school."}, {"time": 5017, "text": "So maybe it wasn't a bad thing."}, {"time": 5019, "text": "I'd also say that's pretty universal."}, {"time": 5020, "text": "I think if you want to be the best at anything you do or any sport, you have to be that level of obsessed."}, {"time": 5025, "text": "So I don't know if that's only chess."}, {"time": 5027, "text": "Well, some things, some obsessions are more transferable to a balanced social life."}, {"time": 5034, "text": "Like healthy development."}, {"time": 5035, "text": "Yeah, chess is a lot less social than most other sports."}, {"time": 5038, "text": "Yeah, there's something deeply isolating about this game."}, {"time": 5041, "text": "I mean, the great chess players I've met, I mean, it's really competitive too."}, {"time": 5047, "text": "And there's something that you're almost nonstop paranoid about blundering at every level."}, {"time": 5058, "text": "And that develops a person who is really anxious about losing versus someone who deeply enjoys perfection or winning and so on."}, {"time": 5067, "text": "It's just this constant paranoia about losing."}, {"time": 5070, "text": "Maybe I'm misinterpreting it, but that creates huge amount of stress over like thousands of games, especially in a young person."}, {"time": 5081, "text": "And that blundering is such a painful experience because you could be playing a game that you've played for five, six hours and you have one lapse in focus and you blunder and you throw the entire game away."}, {"time": 5094, "text": "And sometimes not just the entire game, but the entire tournament."}, {"time": 5097, "text": "Now you can't place or do anything anymore."}, {"time": 5099, "text": "So you just feel those mistakes so strongly."}, {"time": 5102, "text": "Yeah, there's no one to blame but yourself."}, {"time": 5106, "text": "Are you guys hard on yourself?"}, {"time": 5108, "text": "Have you been about losing?"}, {"time": 5110, "text": "Like before you became super famous for streaming where you could be like, well, fuck this, at least I can have fun playing."}, {"time": 5117, "text": "So I was really hard on myself and I went to play a tournament in Canada to try to qualify for the Olympiad team."}, {"time": 5124, "text": "And I was like, well, I'm an adult now."}, {"time": 5128, "text": "I'm not gonna feel emotional if I lose."}, {"time": 5130, "text": "And then I got there on the first day."}, {"time": 5133, "text": "I think I was ranked like fourth in Canada for females."}, {"time": 5138, "text": "How long ago was this?"}, {"time": 5140, "text": "This was like earlier in the year actually."}, {"time": 5143, "text": "And I go and I lose to somebody lower rated on the first day."}, {"time": 5147, "text": "And I think it was because I blundered and I went back to my room and I was like, I am not an adult."}, {"time": 5152, "text": "I'm not eating, I'm not leaving this room."}, {"time": 5154, "text": "I feel terrible and I know I shouldn't, but it just cuts so deep."}, {"time": 5159, "text": "And then I actually ended up qualifying for the Olympiad team, but I didn't wanna play because I didn't have enough time to train and the losses are so painful that I was like, it's not worth it."}, {"time": 5169, "text": "Yeah, in high school and growing up, I just remember weekends."}, {"time": 5174, "text": "And I think being competitive in any sport, again, probably people relate to this, which is like spending weekends crying."}, {"time": 5180, "text": "And even like Alex said, like punishing yourself because you're disappointed in yourself because you fight so hard and you prepare and you study and you're like, oh, yeah."}, {"time": 5189, "text": "But that's once again on the bright side though, when you're studying so hard and after like a four hour game and you actually are on the opposite end and you win, you feel like such a huge rush of dopamine and serotonin and you're like on a high from the wind."}, {"time": 5205, "text": "So there's also plus sides or you can turn this around."}, {"time": 5207, "text": "But yeah, like Alex said, like losing after preparing for something and fighting on hours and hours is the worst feeling in the world."}, {"time": 5214, "text": "Did you ever get anything like that with martial arts?"}, {"time": 5218, "text": "Yeah, so, you know, wrestling, I wrestled all through high school and middle school."}, {"time": 5222, "text": "Definitely, so it's an individual sport."}, {"time": 5223, "text": "I did a lot of individual sport, tennis, those kinds of things."}, {"time": 5227, "text": "But I think even with wrestling and tennis, you're still on a team."}, {"time": 5231, "text": "You can still like, there's still a comradery there."}, {"time": 5234, "text": "I feel like with chess, especially you go on your own with the tournaments, like you really are alone."}, {"time": 5240, "text": "But I mean, I always personally just had like a very self critical mind in general."}, {"time": 5245, "text": "I would not."}, {"time": 5246, "text": "It's one of the reasons I decided not to play chess because I think when I was really young, I met somebody who was able to play blindfold chess."}, {"time": 5258, "text": "They were teaching me, they were laying in there on the couch, trashed, drinking and smoking."}, {"time": 5262, "text": "And there were."}, {"time": 5263, "text": "Sounds like a Russian."}, {"time": 5265, "text": "There are now a faculty somewhere in the United States."}, {"time": 5269, "text": "But he making jokes, talking to others and he would move the pieces, like he would yell across the room."}, {"time": 5278, "text": "And I remember thinking that if a person is able to do that, then that kind of world you can live in inside your mind that becomes the chessboard."}, {"time": 5289, "text": "To me, that meant like the chessboard is not just out here."}, {"time": 5292, "text": "It could be in here and you could do these beautiful, you can create these beautiful patterns in your mind."}, {"time": 5297, "text": "I thought like, I had such a strong pull towards that where I had to decide either I'm gonna dedicate everything to this or not."}, {"time": 5309, "text": "You can't do half assed."}, {"time": 5310, "text": "And then that's when I decided to walk away from it because I had so much other beautiful things in my life."}, {"time": 5317, "text": "I loved mathematics."}, {"time": 5318, "text": "I loved, just everything was beautiful to me."}, {"time": 5320, "text": "I thought chess would pull me all in."}, {"time": 5324, "text": "And there was nothing like it, I think, in my whole life since then."}, {"time": 5329, "text": "I think it's such a dangerous addiction."}, {"time": 5332, "text": "It's such a beautiful addiction, but it's a dangerous one, depending on what your mind is like."}, {"time": 5336, "text": "It reminds me of something I thought of before I stopped competing as much."}, {"time": 5341, "text": "And I'd look at people and think, imagine being so intelligent that you could become a grandmaster and yet only spending the rest of your life being a grandmaster."}, {"time": 5351, "text": "Because it's one of those things where it does require a lot of mental power, but by doing chess, you're not gonna be able to explore other subjects deeply."}, {"time": 5361, "text": "And not in a way that is bad necessarily, more an admiration and wondering what else could have been because I've just seen people get to these levels of obsession where it's all they wanna do."}, {"time": 5371, "text": "And they're grandmasters, but they're not even top players."}, {"time": 5374, "text": "So they're never gonna make a living out of it."}, {"time": 5376, "text": "They'll make like maybe 30, 40K a year max."}, {"time": 5378, "text": "They can't even focus on their competitive chess because they have to supplement it by teaching and doing things they don't like."}, {"time": 5385, "text": "And it's just because of how strong of an obsession it can be because it truly is very intellectually rewarding."}, {"time": 5392, "text": "And I think that's what people are addicted to in the self improvement, but you can get that from a lot of other things as well."}, {"time": 5398, "text": "Well, I think for me, what I was inspired by that stuck with me is that a human being could be so good at one thing."}, {"time": 5410, "text": "To me, that person on the couch drinking and so on, I assumed he was the best chess player in the world."}, {"time": 5414, "text": "Like to be able to play inside your head, it just felt like a feat that's incredible."}, {"time": 5422, "text": "And so I fell in love with the idea that I hope to be something like that in my life at something."}, {"time": 5427, "text": "It would be pretty cool to be really good at one thing."}, {"time": 5431, "text": "And like life in some sense is a search for the things that you could be that good at."}, {"time": 5436, "text": "I didn't even think about like how much money does it make or any of that."}, {"time": 5440, "text": "It's can I fall in love with something and make it a life pursuit where I can be damn good at it."}, {"time": 5446, "text": "And being damn good at it is the source of enjoyment."}, {"time": 5450, "text": "Not like not to win because you want to win a tournament or win because like you just want to be better at somebody else."}, {"time": 5459, "text": "No, it's for the beauty of the game itself or the beauty of the activity itself."}, {"time": 5463, "text": "And then you realize that that's one of the compelling things about chess."}, {"time": 5466, "text": "It is a game with rules and you can win."}, {"time": 5470, "text": "If you want to be really damn good in some aspect of life like that, it's a harder and weirder pursuit."}, {"time": 5479, "text": "Don't you feel like you kind of did that with computer science or AI related things?"}, {"time": 5484, "text": "Like getting that level of damn good."}, {"time": 5487, "text": "That's one of the cool things about AI and robotics or intellectual pursuits or scientific pursuits is you can spend until you're 80 doing it."}, {"time": 5496, "text": "So I'm in the early days of that."}, {"time": 5497, "text": "One of the reasons I came to Texas, one of the reasons I didn't want to pursue an academic career at MIT is I want to build a company."}, {"time": 5509, "text": "And so I'm in the early days of that AI company."}, {"time": 5512, "text": "And so it's an open world to see if I'm actually going to be good at it."}, {"time": 5517, "text": "But the thing that's there that I've been cognizant of my whole life is that I have a passion for it."}, {"time": 5523, "text": "Something within me draws me to that thing."}, {"time": 5526, "text": "And you have to listen to that, to that voice."}, {"time": 5529, "text": "So with chess, you're fucked unless you like early on are really training really hard."}, {"time": 5536, "text": "I think life is more forgiving."}, {"time": 5539, "text": "You can be world class at a thing after making a lot of mistakes."}, {"time": 5545, "text": "And after spending the first few decades of your life doing something completely different."}, {"time": 5550, "text": "And chess, it's like an Olympic sport."}, {"time": 5554, "text": "Like there's no, perfection is a requirement, is a necessity."}, {"time": 5559, "text": "What do you think is that pursuit for you?"}, {"time": 5562, "text": "Like why did you decide to stream?"}, {"time": 5565, "text": "What drew you?"}, {"time": 5566, "text": "I like these questions."}, {"time": 5568, "text": "Now we're really getting deep."}, {"time": 5570, "text": "Yeah, this is like a therapy session."}, {"time": 5571, "text": "I mean, isn't it terrifying to be in front of a camera?"}, {"time": 5575, "text": "Well, it's terrifying to be in front of five cameras."}, {"time": 5578, "text": "The set up is."}, {"time": 5579, "text": "Corrections, six."}, {"time": 5580, "text": "Six, okay."}, {"time": 5581, "text": "It's more terrifying for me to try to remember if I actually turned them all."}, {"time": 5586, "text": "Like I mentioned to you off mic, I'm still suffering from a bit of PTSD after screwing up a recording of Magnus."}, {"time": 5595, "text": "He had to console me because that was the thing."}, {"time": 5599, "text": "I felt, okay, you wanna build robots."}, {"time": 5604, "text": "If you can't get a camera to even run correctly, how are you gonna do anything else in life?"}, {"time": 5610, "text": "Oh no, don't let it spiral like that."}, {"time": 5613, "text": "It was spiraling hard and I was just laying there and just feeling sorry for myself."}, {"time": 5618, "text": "But I think that feeling, by the way, and the small tangent, is really useful."}, {"time": 5624, "text": "I feel like a lot of growing happens when you feel shitty."}, {"time": 5628, "text": "As long as you can get out of it."}, {"time": 5630, "text": "Like don't let it spiral indefinitely."}, {"time": 5633, "text": "But just feeling really, really shitty about everything in my life."}, {"time": 5636, "text": "Like I was having an existential crisis."}, {"time": 5638, "text": "Like how will I be able to do anything at all?"}, {"time": 5641, "text": "Like you're a giant failure, all those kinds of negative voices."}, {"time": 5646, "text": "But I think I made some good decisions in the week after that."}, {"time": 5650, "text": "Of like, okay."}, {"time": 5651, "text": "Do you think you couldn't have made those decisions if you were less hard on yourself?"}, {"time": 5656, "text": "Me personally, no."}, {"time": 5658, "text": "I'm too lazy."}, {"time": 5659, "text": "Okay, so you really need to be angry at yourself enough to go and do what you need."}, {"time": 5664, "text": "Yeah, it's not even angry, it's just upset of being self critical."}, {"time": 5667, "text": "Like also for me personally, because I don't have proclivities for depression, I have a lot more room to feel extremely shitty about myself."}, {"time": 5681, "text": "So if you're somebody that can get stuck in that place, like clinically depressed, you have to be really, really careful."}, {"time": 5688, "text": "You have to notice the triggers, you don't wanna get into that place."}, {"time": 5691, "text": "But for me, just looking empirically, feeling shitty has always been productive."}, {"time": 5698, "text": "Like it makes me long term happier."}, {"time": 5700, "text": "Ultimately, it makes me more grateful to be alive and it helps me grow, all those kinds of things."}, {"time": 5706, "text": "So I kinda embrace it."}, {"time": 5710, "text": "Otherwise, I feel like I will never do anything."}, {"time": 5712, "text": "I have to feel shitty, but that's not a thing I prescribe to others."}, {"time": 5716, "text": "There's a famous professor at MIT, his name is Marvin Minsky."}, {"time": 5722, "text": "And when he was giving advice about like to the students, he said, the secret to my success was that I always hated everything I did in the past."}, {"time": 5733, "text": "So always sort of being self critical about everything you've accomplished, never really take a moment of gratitude."}, {"time": 5739, "text": "And I think for a lot of people that hear that, that's not good."}, {"time": 5742, "text": "You should like take a pause and be grateful, but it really worked for him."}, {"time": 5747, "text": "So it's a choice you have to make."}, {"time": 5750, "text": "It reminds me of the quote, be happy but never satisfied, where you can have a positive spin and still want to improve yourself."}, {"time": 5760, "text": "But yeah, like when did you decide to take a step in the spotlight, that terrifying spotlight of the internet?"}, {"time": 5771, "text": "It was actually my senior year of college and I was really busy with work and school and chess was kind of like this lost love."}, {"time": 5781, "text": "And the interesting thing is that the longer I don't play chess, the more I kind of miss playing it casually and enjoy it more."}, {"time": 5787, "text": "Cause then I start looking at it with fresh eyes, but I didn't have time to play tournaments."}, {"time": 5792, "text": "So I started streaming online because it was more social than just playing strangers on the internet without knowing anything about who they are."}, {"time": 5801, "text": "And I started slowly growing a community and got in touch with chess.com pretty quickly too."}, {"time": 5807, "text": "So then it was this hobby that I would do once a week, every Thursday at 8 p.m. And it was one of the things that brought me a lot of joy."}, {"time": 5815, "text": "And actually I, speaking of depression, did struggle for it with at least 10 years of my life."}, {"time": 5822, "text": "And it was one of those things where chess and streaming was such a distraction and it brought me such great joy that I just kept doing it cause I really, really liked it."}, {"time": 5833, "text": "And then I was working on something that didn't pan out and decided to go and take a risk and just stream full time, which, you know, seemed a little bit weird at the moment."}, {"time": 5846, "text": "Was that terrifying, that leap?"}, {"time": 5849, "text": "It was terrifying, but I had taken so many terrifying leaps in the past and they didn't, you know, the last two hadn't worked out, but I was like, well, I'll get it eventually."}, {"time": 5859, "text": "So somehow having failed before and going through failure and knowing that it'll be okay, made me more likely to just try something that was a very, very weird job."}, {"time": 5871, "text": "Goodbye camera."}, {"time": 5872, "text": "I saw it die."}, {"time": 5873, "text": "Yeah, the camera, we don't need it."}, {"time": 5875, "text": "But one of the cameras died."}, {"time": 5876, "text": "Luckily we have another five."}, {"time": 5879, "text": "Like this is where this triggers the spiral, Alexis is gonna go to A to death now."}, {"time": 5884, "text": "It's still somehow awake."}, {"time": 5889, "text": "Is there advice you can give about the dark places you've gone in your mind, the depression you suffered from, how to get out from your own story?"}, {"time": 5898, "text": "Whenever I go to those really dark places, the scariest thing is that it feels like I will never get rid of this feeling and it is very overwhelming."}, {"time": 5911, "text": "And I just have to kind of look back over time spans and remember that every single time I have got through it and remind myself that it is just temporary."}, {"time": 5922, "text": "And that has been the most helpful thing for me because I just try to combat the scariest thing about it."}, {"time": 5929, "text": "And then believe, have faith that it's gonna, like this will go away."}, {"time": 5933, "text": "And take action obviously to make sure it goes away."}, {"time": 5937, "text": "And I've also tried to spin it as depression is one of the hardest things I've had to deal with, but also one of the biggest motivators because if I just am left with my own brain, I get very depressed."}, {"time": 5947, "text": "Then I really like working or focusing on things."}, {"time": 5950, "text": "So it actually pushed me to try to focus on school, try to focus on chess, focus on whatever I'm doing."}, {"time": 5956, "text": "And also if I'm feeling really bad, then there's probably something a little bit off and I use it as a signal and try to think of it as, okay, this is just a sign that there's things that could be improved for long term."}, {"time": 5967, "text": "What about you, Andrea?"}, {"time": 5968, "text": "Have you gone to dark places in your mind?"}, {"time": 5971, "text": "I'd say my family, like I see Alex going through this, my mom also has very serious depression."}, {"time": 5978, "text": "Luckily, I got the genes where I don't go through that serious level of depression that they do."}, {"time": 5984, "text": "I'd say mine is much more temporarily."}, {"time": 5987, "text": "So it's more similar to what I was feeling when I was feeling shitty about it."}, {"time": 5991, "text": "Exactly, you go through periods, yes, exactly, where like, but I know that it's not something that's clinical and that's just a genetic thing or a mental thing, whereas I know it's more serious for like my family members."}, {"time": 6024, "text": "So it's short term and then it helps me come up with the things that I enjoy the most content wise and it also long term taught me just how to have a more balanced life, like doing small things that make me happier on a daily basis, to like working out, to eating healthier, which I notice when I don't do for weeks, I just get a lot more depressed."}, {"time": 6044, "text": "What has playing chess taught you about life?"}, {"time": 6048, "text": "Has it made you better at life in any kind of way or has it made you worse?"}, {"time": 6054, "text": "You know, a lot of people kind of romanticize the idea that chess is kind of like life or life is kind of like chess and becoming better at making decisions on the chess board is gonna make you better at making decisions in life."}, {"time": 6066, "text": "Is there some truth to that?"}, {"time": 6069, "text": "I always shy away from these comparisons with chess and life."}, {"time": 6075, "text": "Cause yeah, it has both positives and negatives."}, {"time": 6077, "text": "So one thing it really helps develop from an early age is having an analytical mind, but then you could also get like paralysis of analysis where you've just thought of everything to death and you're moving too slowly when you just have to keep going forward cause there's not a great path ahead."}, {"time": 6093, "text": "So it's more like exercising your brain and staying sharp and then also applying that to other things."}, {"time": 6101, "text": "Whereas if instead of playing chess, you were watching TV or something like that, you'd probably end up being less sharp."}, {"time": 6107, "text": "Yeah, I used to, in high school, I'd always preach like, ah, chess transfers to life skills that I would teach."}, {"time": 6115, "text": "I taught chess for juvenile department for a special education school."}, {"time": 6118, "text": "I'd cite studies in prisons where like, oh, playing chess helped them with X and for your kids, it helps with teamwork and thinking over life choices."}, {"time": 6127, "text": "And now that I'm older, I don't believe in any of that BS."}, {"time": 6129, "text": "But I do think that the process of working really hard at something which takes really long to see results and you have to be really dedicated."}, {"time": 6140, "text": "And like, I remember in high school and in middle school, well, all my friends, they were having fun on the weekends and I'd have to be there studying as a chess a day and knowing one day I'll pay off, but for like two, three years, nothing paid off."}, {"time": 6152, "text": "Kind of learning that type of patience with anything, it's like, you know, like getting a real job."}, {"time": 6157, "text": "I can't say I ever really worked a real job in my life since I went straight into streaming and I got to work for myself, but I'd say it's what people go to college for."}, {"time": 6167, "text": "Like they learn how to live in the real world and I'd say that that's what chess taught me as a kid."}, {"time": 6172, "text": "When you're streaming, when you're doing the creative work, do you feel lonely?"}, {"time": 6178, "text": "So a bunch of creators talk about sort of the, it's counterintuitive because you're famous now, you know."}, {"time": 6186, "text": "Sort of, not quite, but we're very lucky to have each other."}, {"time": 6191, "text": "So is that the source of the comfort and like, is there some sense where it's isolating to have these personalities, they have to always be having fun, being wild and so on?"}, {"time": 6204, "text": "Or is it actually the opposite?"}, {"time": 6205, "text": "Like, is it a source of comfort to know that there's so many cool people out there that are giving you their love?"}, {"time": 6211, "text": "It started as a source of comfort because it started with a very small community who would be something, it would be around 200 to 300 viewers and you know, only like 30 to 40 of them would actually chat actively."}, {"time": 6225, "text": "So you felt like it was a community, not an audience."}, {"time": 6227, "text": "So you like knew them personally almost."}, {"time": 6230, "text": "And it was people who were interested in chess and I would really enjoy that."}, {"time": 6235, "text": "And then as, you know, we started growing bigger, the audience kind of changed where they're not there for you personally, they're there while you're entertaining and it changed for me."}, {"time": 6248, "text": "And I ended up being a lot more self conscious of things online and started even thinking of myself more like a product than a human being when I'm online because I had to."}, {"time": 6258, "text": "Brand."}, {"time": 6259, "text": "Otherwise you just start taking everything personally that people comment about you and it's based off a very small clip."}, {"time": 6266, "text": "I see, so it was almost a kind of a defense mechanism."}, {"time": 6270, "text": "And it took time to get enough, because even if you have tough skin, eventually it gets to you when you're online every single day listening to, you know, thousands of people's feedback on you."}, {"time": 6281, "text": "I think the loneliest part of being creator is going through burnout, which everyone is just, it's bound to happen, which is why I think we're very lucky that we have each other because right, it's a numbers game and you're viral and trendy at one point and then you have to fall."}, {"time": 6298, "text": "And then there's months where you're just grinding."}, {"time": 6300, "text": "And I just come into my friends room and I'm like, Andrea, we're irrelevant."}, {"time": 6302, "text": "That's where I'm glad, that's really like the worst part of being creator and figuring out how to get over that hump."}, {"time": 6308, "text": "But it makes me very grateful that I have my sister because I know that I'm not the only person going through it."}, {"time": 6314, "text": "And yeah, I know that most of my creator friends feel very lonely in that process because they don't have someone who's their family and their business partner and they're working by each other side by side."}, {"time": 6324, "text": "You kind of tie in your self worth to your job and your content and maybe even more extremely than other jobs because you also are the entire company and the entire product."}, {"time": 6335, "text": "So when things are going well or when things are not, you just need to be careful to not reflect it like, oh, I am doing bad."}, {"time": 6341, "text": "I am bad rather than the trends have now changed."}, {"time": 6344, "text": "There's outside things we're gonna keep going and this is just the normal waves, which is how we think about it now."}, {"time": 6349, "text": "And also just about, are we enjoying this?"}, {"time": 6352, "text": "Is this what we wanna make?"}, {"time": 6353, "text": "But we were stuck in the camp for a while when we 10Xed our viewership after the pandemic because people were home and playing chess."}, {"time": 6362, "text": "And then of course that dropped by like 70%."}, {"time": 6364, "text": "And then you see that and you're trying your best and you just kind of have to deal with it and be like, okay, I'm just gonna keep persevering and maybe it'll get better."}, {"time": 6374, "text": "I mean, this is a struggle of sorts in the 21st century of like how to be an artist, how to be a creator, how to be an interesting mind in response to this algorithm."}, {"time": 6387, "text": "I'm telling you, turning off views and likes is really good."}, {"time": 6390, "text": "I don't look at Twitch views for that reason."}, {"time": 6392, "text": "And I get obsessed with the numbers too."}, {"time": 6394, "text": "And I know Andrea does, but for me, what I try now is to be more focused in the moment, but Andrea somehow can do it even with the views."}, {"time": 6402, "text": "So you just, you get, you have fun with it."}, {"time": 6404, "text": "I'm too much of like a given to the temporary satisfaction."}, {"time": 6408, "text": "Like I like seeing, I like knowing that if something happens right now, viewership's gonna boost by a couple of hundred and seeing that I'm right, of course."}, {"time": 6417, "text": "But what about when the viewers start dropping?"}, {"time": 6418, "text": "Exactly, well, and I always, like you just have this intuition now."}, {"time": 6422, "text": "But I think also the reason that it doesn't affect me so much is when we first started our content journey, we were only Twitch streamers."}, {"time": 6430, "text": "And we, our livelihood were based on Twitch viewers."}, {"time": 6433, "text": "But now like I've learned how to recycle that content into like YouTube and shorts and other things where I know like, okay, if this stream does badly, there's so many more things you can do that also just have a much larger output."}, {"time": 6444, "text": "So it doesn't get to me as much as it did."}, {"time": 6447, "text": "Do you ever feel that with your podcasts or do you feel like it's been authentic since the start?"}, {"time": 6452, "text": "No, so there's a million things to say there."}, {"time": 6455, "text": "So one is there's a reason I stopped taking a salary at MIT and moved to Texas is I wanted my bank account to go to zero because I do my best with my back against the wall."}, {"time": 6468, "text": "So one of the comforts I have is I don't care if this podcast is popular or not."}, {"time": 6472, "text": "I want it to not be popular."}, {"time": 6474, "text": "So I don't want it to make money."}, {"time": 6476, "text": "You're failing Lex."}, {"time": 6477, "text": "Yeah, I wanna, I mean, I just do best when I'm more desperate."}, {"time": 6483, "text": "That's like one thing to say."}, {"time": 6484, "text": "Seems like a reoccurring theme with how you build up your greatest work, which is honestly very respectable."}, {"time": 6490, "text": "Yeah, so thank you."}, {"time": 6495, "text": "I wouldn't recommend."}, {"time": 6497, "text": "Right, thank you for finding the silver lining for an unhealthy mental state."}, {"time": 6504, "text": "But the other thing is I was very conscious just like with chess and those kinds of things that I love numbers."}, {"time": 6511, "text": "And I would be, if I paid attention, if I tried to be somebody at their best, like Mr."}, {"time": 6518, "text": "Beast who really pays attention to numbers, I would just not, I'd become destroyed by it."}, {"time": 6527, "text": "The highs and the lows of it."}, {"time": 6528, "text": "And I just don't think I would be creating the best work possible."}, {"time": 6534, "text": "But one of the big benefits of a podcast, it's listeners and there's an intimacy with the voice."}, {"time": 6542, "text": "And I think that is much more stable and a deeper and a more meaningful connection than YouTube."}, {"time": 6550, "text": "YouTube is a fickle mistress."}, {"time": 6553, "text": "So it's a weird drug that like, it really wants you."}, {"time": 6558, "text": "With very addicting feedback loops."}, {"time": 6560, "text": "When you have a video that's number one out of 10, oh my God, the adrenaline you get."}, {"time": 6565, "text": "And then the thing I really don't like also is the world will introduce you as a person that has a video on YouTube with some X number of views."}, {"time": 6579, "text": "Like the world wants you to be addicted to these numbers."}, {"time": 6583, "text": "Because they associate it with having done a good job."}, {"time": 6586, "text": "Because that's what people think views are, even if it's not."}, {"time": 6588, "text": "And primarily because they don't have any other signal of what's a good job."}, {"time": 6593, "text": "I think the much better signal is people that are close to you, your family, your colleagues, that say, wow, that was cool, I listened to that, that was really, I didn't know this, this was really powerful, this is really moving and so on."}, {"time": 6605, "text": "But definitely I'm terrified of numbers."}, {"time": 6608, "text": "Because I feel like, just like I said, I'd rather be a Stanley Kubrick, right?"}, {"time": 6616, "text": "You'd rather create great art, not to be pretentious, but the best possible thing you can create."}, {"time": 6624, "text": "Whatever the beauty that's, the capacity for creating beauty that's in you, I would like to maximize that."}, {"time": 6629, "text": "And I feel like for some people like Mr."}, {"time": 6629, "text": "Beast, I think those are perfectly aligned."}, {"time": 6635, "text": "Because he just loves the most epic thing possible, but not for everybody."}, {"time": 6638, "text": "I think there's a lot of people for whom that's not perfectly aligned."}, {"time": 6642, "text": "And so I'm definitely one of those."}, {"time": 6644, "text": "And I'm still really confused why anybody listens to this anyway."}, {"time": 6649, "text": "But that's also something I guess you're trying to find, trying to figure out."}, {"time": 6654, "text": "I get very afraid of ever becoming someone who just makes junk food content, where you can't stop while you're in the moment, and it has all of your attention, but when you're done, it didn't really bring any value to your life, which is something that I think the algorithm still does really reward."}, {"time": 6674, "text": "And making sure that as we are learning how to create better content, it's still something that is gonna be meaningful long term."}, {"time": 6681, "text": "Well, ultimately, you inspire a lot of young people."}, {"time": 6686, "text": "Yeah, those are the best."}, {"time": 6687, "text": "When I get messages from people who are like, I played you a year ago, and my rating was 1400, and now I'm 1900."}, {"time": 6694, "text": "I'd like to challenge you again."}, {"time": 6695, "text": "It's a 14 year old writing a former email."}, {"time": 6698, "text": "Those things are always very, very fun to get."}, {"time": 6700, "text": "And even just outside of chess, it's just empowering to see, like for young women too, to see that kind of thing."}, {"time": 6706, "text": "I mean, you guys are being yourself, and making money for being yourself, and having fun, and growing as human beings, which I think is really inspiring for people to see."}, {"time": 6717, "text": "So in that sense, it's really rewarding."}, {"time": 6719, "text": "And then the way I think about it is there is some benefit of doing entertaining type of stuff so that you get the, kind of like Mr."}, {"time": 6730, "text": "Beast does with philanthropy, right?"}, {"time": 6733, "text": "The bigger Mr."}, {"time": 6733, "text": "Beast becomes, the more effective he is at actually doing positive impact on the world."}, {"time": 6738, "text": "So those things are tied together."}, {"time": 6742, "text": "But of course, with podcasts, you guys, well, maybe you have these kinds of tense things, but what kind of ideas, what kind of people do platform?"}, {"time": 6751, "text": "What kind of person, what kind of human being do you wanna be?"}, {"time": 6759, "text": "Because you are actually becoming a person, and a set of ideas in front of the public eye, and you have to ask yourself that question really hard, like really seriously."}, {"time": 6770, "text": "Because if you're doing stuff in private, you have the complete luxury to try shit out."}, {"time": 6778, "text": "I think you have less of a luxury to try shit out because the internet can be vicious in punishing you for trying shit out."}, {"time": 6785, "text": "And do you think that's sometimes a bad thing where you have less freedom to make mistakes?"}, {"time": 6791, "text": "Yeah, you have two choices."}, {"time": 6792, "text": "So one, you put up a wall and say I don't give a shit what people think."}, {"time": 6797, "text": "I don't like doing that because I like being fragile to the world, keeping my, sort of wearing my heart on my sleeve."}, {"time": 6803, "text": "Or the other one, yeah, you have to be, you have to actually think through what you're gonna say."}, {"time": 6810, "text": "You have to think of like, what do I believe?"}, {"time": 6813, "text": "You have to be more serious about what you put out there."}, {"time": 6818, "text": "It's annoying, but it's also actually, you should have always been doing that."}, {"time": 6823, "text": "You should be deliberate with your actions and your words."}, {"time": 6828, "text": "But I don't know, it's, but some of it, it's such a balance because some of my favorite people are brilliant people that allow themselves to act ridiculous and be silly."}, {"time": 6841, "text": "Elon Musk, who's become a good friend, is the silliest human of all."}, {"time": 6845, "text": "I mean, he's incredibly brilliant and productive and so on, but allows themselves to be silly."}, {"time": 6851, "text": "And that's also inspiring to people."}, {"time": 6853, "text": "Like you don't have to be perfect."}, {"time": 6855, "text": "You don't have to, you can be a weird, a giant weird mess."}, {"time": 6859, "text": "Then it's okay."}, {"time": 6862, "text": "I think when you start to delve into political topics, into topics that really get tense for people, then you have to be a little bit more careful and deliberate."}, {"time": 6871, "text": "But it's also wise to stay the hell away from those topics in general."}, {"time": 6875, "text": "Like I mentioned to you offline, somebody I've been debating whether I want to talk to or not is Karjakin on the chess board because chess is just a game, but throughout the history of the 20th century, it was played between the Russians and the Americans and so on where they were at war, cold or hot war."}, {"time": 6897, "text": "Those are interesting conversations to be had at the Olympics and so on."}, {"time": 6903, "text": "It's not just a game."}, {"time": 6905, "text": "It's like a mini war."}, {"time": 6908, "text": "And so I have to decide whether I want to talk to him or not and those kinds of things."}, {"time": 6912, "text": "You have to make those kinds of decisions."}, {"time": 6914, "text": "For now, you guys are not playing chess with Donald Trump or Obama or so on."}, {"time": 6918, "text": "We are not right now, no."}, {"time": 6920, "text": "How long is a stream?"}, {"time": 6922, "text": "Like a few hours, right?"}, {"time": 6923, "text": "Now they're two to three hours."}, {"time": 6924, "text": "When I was first streaming, I'd stream for like six hours a day."}, {"time": 6928, "text": "A day."}, {"time": 6929, "text": "At least usually."}, {"time": 6930, "text": "Yeah, for like six to seven days a week."}, {"time": 6933, "text": "Are you doing just like a talking one?"}, {"time": 6934, "text": "No, I'd be playing chess the entire time while talking."}, {"time": 6938, "text": "And when I started streaming, that's kind of how everybody blows up on Twitch."}, {"time": 6944, "text": "You're just putting in crazy hours and you're always there."}, {"time": 6947, "text": "It's not about making the best content."}, {"time": 6949, "text": "It's about letting people feel like they're hanging out with you and just being on as much as you can."}, {"time": 6955, "text": "But I ended up feeling very burnt out because it's hard to be your best self when you're in front of a camera for that long because you do get scared of going into places where you want to learn, but you might not be the best in."}, {"time": 6969, "text": "Because it's harder to learn in public than do something that like, yeah, we're better than 99% of our viewers at chess."}, {"time": 6974, "text": "So that's a lot less scary than trying to play a game that you're bad at or discuss topics that you're interested in."}, {"time": 6982, "text": "Yeah, have the beginner's mind and be dumb at something."}, {"time": 6987, "text": "Yeah, which is where the fun is and you get to learn together, but people punish you for it on the internet."}, {"time": 6995, "text": "Yeah, I think like Alex said at the beginning, when we were grinding a lot, you don't really even have time for much of a private life because you're streaming every hour of your life and people want it, like the appeal of streamers, it's called like being parasocial where you feel like they're your friend and they like it because they want you to share everything about your life."}, {"time": 7017, "text": "Really the main challenge for me at first when trying to prioritize quantity over quality, which we're not doing anymore, was realizing that I can't turn everything I'm interested in and every passion into content."}, {"time": 7031, "text": "Before I'm like, well, I must stream more, but I like music and I like playing piano and I like reading into these topics and I like fitness and then I try to live stream all of it and that's just, at some point it's like, just enjoy your time off for those hobbies and prioritize what you're good at because that's just gonna be better for the channel overall."}, {"time": 7052, "text": "So that was a learning lesson for sure."}, {"time": 7054, "text": "It's nice because there are some intersections when I have tried new things that I really enjoy and it pays off, but that's less often."}, {"time": 7061, "text": "So it's more like you can be yourself, but only specific parts of yourself online and the rest, sometimes it's nice to just keep private and feel that you could just give it your 100% freedom."}, {"time": 7076, "text": "See, I feel like I try to be the exact same person on podcasts as in private life."}, {"time": 7083, "text": "I really don't like hiding anything."}, {"time": 7086, "text": "But you're also a generalist, right?"}, {"time": 7088, "text": "Where you have people with all topics."}, {"time": 7090, "text": "For us, we built our audience off a very specific thing so people sometimes feel like, even at the start when we started playing less chess, they're like, I subbed for chess."}, {"time": 7098, "text": "Why are you not playing chess?"}, {"time": 7101, "text": "People are tuning in for an interesting conversation on a bunch of topics."}, {"time": 7105, "text": "So like the more you are yourself, the better it is, but it is very hard when you build your brand on like one type of gaming content."}, {"time": 7111, "text": "Build your brand."}, {"time": 7114, "text": "But yeah, the way you become a generalist is you slowly expand."}, {"time": 7118, "text": "It's like expand to checkers."}, {"time": 7125, "text": "I guess that's like a downward."}, {"time": 7127, "text": "Maybe poker."}, {"time": 7128, "text": "Poker, yeah, exactly, poker."}, {"time": 7130, "text": "But also just the ideas, the space of ideas."}, {"time": 7132, "text": "And one of the cool things about chess is when you're talking over the chess board, you're, it's a kind of podcast, you know?"}, {"time": 7139, "text": "That is actually an idea we've had with playing chess while also doing a podcast and talking with people."}, {"time": 7145, "text": "It's kind of like an icebreaker."}, {"time": 7146, "text": "We're also focusing on the game at the same time."}, {"time": 7148, "text": "But you know, we are slowly evolving and we're doing more things."}, {"time": 7152, "text": "Like one thing we wanted to do is spend less time in front of the computer."}, {"time": 7156, "text": "So now we're doing a chess travel show where we go to different countries and look at the chess culture."}, {"time": 7160, "text": "So it actually feels like we're doing things that we would want to do and explore anyway."}, {"time": 7165, "text": "And maybe it's not as much in the idea space, which we both enjoy and do a lot in our own free time, but in the sharing cool experiences with our audience that we actually want to do."}, {"time": 7176, "text": "Where do you look forward to going?"}, {"time": 7177, "text": "We're going to Romania on September 9th."}, {"time": 7181, "text": "And I think this is the most exciting for me because we're going back to, you know, the country where our entire family's from, where our grandmother taught our dad who taught us how to play chess."}, {"time": 7192, "text": "It has a very strong chess culture."}, {"time": 7194, "text": "So it'll be very unique to go back and see how everything is when we haven't been back for a very long time."}, {"time": 7201, "text": "And for Romanians, like it's very rare when there's like a famous Romanian who accomplishes something, which is why like right now, Andrew Tate's the most famous Romanian."}, {"time": 7210, "text": "But he's banned for a bad reason."}, {"time": 7213, "text": "And there's like something very special about Romanian pride."}, {"time": 7217, "text": "And when we meet fellow Romanians in the US, like it's just an amazing connection."}, {"time": 7222, "text": "And like, I hear the way my dad talk about like, for example, Nadia, who was a famous Romanian gymnast and he's like, yeah, like Romania, we sucked at everything."}, {"time": 7231, "text": "But when she won the Olympics for gymnast, every kid on the street was doing gymnastics because it's very rare that they make it to that level of success."}, {"time": 7239, "text": "And I'm not saying that we're super successful, super famous, but it is really cool to meet other Romanians through chess because it's a very special bond."}, {"time": 7245, "text": "Yeah, you feel like it's a community and like you belong."}, {"time": 7250, "text": "Yeah, you can't get that anywhere else."}, {"time": 7253, "text": "Let me ask your opinion since you mentioned him, Andrew Tate, you're both women, successful women, you're both creators."}, {"time": 7261, "text": "So Andrew Tate is an example of somebody that has become exceptionally successful at galvanizing public attention, but he's also, from many perspective, a misogynist."}, {"time": 7276, "text": "Do you think I should talk to him on this podcast?"}, {"time": 7279, "text": "How would you feel as a fan as somebody, I'm talking to the great Alex and Andrea Botez and the next episode is with Andrew Tate?"}, {"time": 7292, "text": "I think it's a double edged sword and most of these things are not as black and white as they seem, you know, because on one hand, I don't agree with his beliefs and I think he said a lot of things that are very hurtful and that influence people's opinions."}, {"time": 7345, "text": "And the thing about the internet, you make the wrong decision, you're gonna pay for it."}, {"time": 7428, "text": "Would you think that's morally ethical?"}, {"time": 7429, "text": "So that is something that I think is important."}, {"time": 7434, "text": "We try to find ways to have conversations and reach some mutual understanding and try instead of just amplifying the worst about every human being."}, {"time": 7444, "text": "Well, so one of the major reasons I'm struggling with is because I really enjoy talking to brilliant women."}, {"time": 7451, "text": "I think it's also, a lot of women reached out to me saying like, it is what it is, but they're inspired when the female guest is on."}, {"time": 7460, "text": "And to me, if I talk to somebody like Andrew Tate, even if I have a really hard hitting, I think it could be a very good conversation that lessens the likelihood that a brilliant, powerful female will go on the show."}, {"time": 7477, "text": "Because they'll never watch it, but the thing we do in this society is we put labels on each other."}, {"time": 7482, "text": "Well, Lex is the person that platforms misogynists."}, {"time": 7488, "text": "I did a thing where Joe Rogan got in trouble over an N word controversy earlier in the year."}, {"time": 7496, "text": "And Joe's a good friend of mine and I said that I stand with Joe, that he's not a racist or something like that."}, {"time": 7502, "text": "And within certain communities, I'm now somebody who's an apologist for racists, right?"}, {"time": 7509, "text": "Or a racist myself, that kind of thing."}, {"time": 7512, "text": "And we put labels without ever listening to the content, without ever sort of, actually just even the very simple step or it seems to be difficult of like, taking on the best possible interpretation of what a person said and giving them the benefit of the doubt and having empathy for another person."}, {"time": 7531, "text": "So you have to play in this field where people will assign labels to each other and it's difficult."}, {"time": 7539, "text": "But ultimately, I believe, I hope that good conversations is a way to like a greater understanding for people to grow together as a society and improve and learn the lessons, the mistakes of the past."}, {"time": 7552, "text": "But you also have to play this game where people just like putting labels on each other and canceling each other over those."}, {"time": 7558, "text": "Or that guy said one thing nice about Donald Trump, he must be a far right Nazi."}, {"time": 7564, "text": "Or the opposite, that this person said something nice about the vaccine, he must be a far left whatever, because apologist for whatever, for Fauci."}, {"time": 7580, "text": "Or most of us I think are ultimately in the middle."}, {"time": 7583, "text": "It's a weird, it's a weird thing."}, {"time": 7585, "text": "But I think, and it's also painful on a personal level."}, {"time": 7588, "text": "Like people have written to me about things like single words, half sentences that I've said about either Putin or Zelensky where they have hate towards me because of what I said."}, {"time": 7603, "text": "Either both directions."}, {"time": 7605, "text": "I've now accumulated very passionate people that some call me a Putin apologist, some call me a Zelensky apologist."}, {"time": 7614, "text": "And it hurts to, given how much I have family there, how much I've seen of suffering there, and to carry that burden over time and not let it destroy you is tough."}, {"time": 7624, "text": "So like, do you wanna take on another thing like that when you have conversations?"}, {"time": 7629, "text": "Or can I just talk to awesome people like you two?"}, {"time": 7633, "text": "Where it's not that burden."}, {"time": 7634, "text": "We're not controversial."}, {"time": 7636, "text": "Or you're interesting, you're fascinating, you're inspiring, you're like fun."}, {"time": 7641, "text": "Not all those difficult things that come with more difficult conversations."}, {"time": 7646, "text": "But somebody has to be making those difficult decisions and challenging the notions that we should cancel someone just for slightly disagreeing with us."}, {"time": 7657, "text": "And it's very hard to take that on personally."}, {"time": 7660, "text": "And I think that's a huge part of it."}, {"time": 7662, "text": "When you know it's something you're doing for the right reasons and you're getting a lot of people coming and misinterpreting it, it's very painful."}, {"time": 7672, "text": "But I think you have to ask yourself long term if when you made that decision, you ultimately thought it would be better or worse for your listeners to know that conversation."}, {"time": 7682, "text": "And then if you can sleep with it at night, take the risk."}, {"time": 7685, "text": "Yeah, actually when I talk to people that, especially astrophysicists, and you realize how tiny we are."}, {"time": 7692, "text": "How incredible, like how huge the universe is."}, {"time": 7694, "text": "Like you don't, it doesn't matter, you can do anything."}, {"time": 7696, "text": "You could like, you can walk around naked, talk shit to people, do whatever the hell."}, {"time": 7703, "text": "And actually in modern social media, people just like forget."}, {"time": 7706, "text": "It's like, it's ultimately liberating."}, {"time": 7709, "text": "Just try to do, at least from my perspective, the best possible thing for the world you can."}, {"time": 7714, "text": "Take big risks, and it doesn't matter."}, {"time": 7717, "text": "And that's the other thing with being canceled nowadays because everyone's attention is much more shortsighted."}, {"time": 7723, "text": "You can get canceled and then it'll blow over in three days."}, {"time": 7726, "text": "And you actually see things like this on Twitch very often where people just have bursts of outrage and they come into your chat and they're all spamming and saying mean things, and then three days after."}, {"time": 7735, "text": "And of course they're not actually ever serious things."}, {"time": 7737, "text": "They're usually like things clipped of any streamers in like their worst moments, but then people forget about it pretty soon after."}, {"time": 7744, "text": "So you're able to accept that?"}, {"time": 7746, "text": "Like when somebody is being shitty to you for a day?"}, {"time": 7749, "text": "Yeah, I mean, I still get sometimes emotional about it, especially when I'm like, oh wow, these things that are being said are not true or like this was clearly taken out of context, but I've just accepted that it's part of the job."}, {"time": 7762, "text": "And if I am trying my best and I am trying things with as good intentions as possible, then I just try to learn every time that happens and be like, okay, what could I do better?"}, {"time": 7772, "text": "And what is just part of the job?"}, {"time": 7775, "text": "Well, let's start some controversy."}, {"time": 7777, "text": "Who's the greatest chess player of all time?"}, {"time": 7779, "text": "Is it Magnus Carlsen, is it Gary Kasparov, is it somebody else, Bobby Fischer?"}, {"time": 7786, "text": "Do you have a favorite, Alex?"}, {"time": 7788, "text": "So whenever I hear this question, I interpret it in a very specific way where it's not who was the most talented chess player or who had the most impact on the chess world, but who is the greatest at playing chess?"}, {"time": 7802, "text": "Where if you were putting all of these players at their peak, who would be the best?"}, {"time": 7807, "text": "And we're kind of living in a world where obviously humans are becoming more like cyborgs and their tools make them a lot more powerful."}, {"time": 7818, "text": "And the computer is the most powerful tool for chess that we've ever witnessed."}, {"time": 7823, "text": "And the top players now, someone like Magnus Carlsen or Gary Kasparov, if they were gonna go towards people like even Lasker or Bobby Fischer back in the day, Lasker, he was world champion for 27 years, he was the best in his field by far, but would he be able to stand up to someone like Magnus Carlsen who has had these tools?"}, {"time": 7845, "text": "So most chess players have said Gary Kasparov and I think even Magnus has said that in the past, but I like to think of it as Magnus in his peak and Gary at his peak, and because Magnus was able to live more in a computer era, I feel like so far he's the greatest of all time."}, {"time": 7862, "text": "And some studies say things like how there's rating inflation, but I looked into some of them and they basically calculated people's play over the years and it seems that there hasn't been inflation, people are just getting better and I think it's because you have better tools at chess."}, {"time": 7878, "text": "And also one of the cases, what's your?"}, {"time": 7881, "text": "I was gonna say, I actually, I disagree with that."}, {"time": 7884, "text": "Good, make it interesting."}, {"time": 7886, "text": "I think I would judge the greatest player of all time in relative to the time that they lived in and Magnus, although he is technically the strongest chess player in history, that is because he had computers to study chess with."}, {"time": 7901, "text": "And of course, if you compare him to like Gary Kasparov, he plays most like Stockfish, but Gary Kasparov at his time, he beat more players of his skill level than Magnus did."}, {"time": 7913, "text": "Magnus loses more often."}, {"time": 7915, "text": "He also of course held the belt for 20 years more."}, {"time": 7917, "text": "So I'd say actually, because Gary lacked the help of computers to study chess and overall performed better against players of his skill level, I think he would be number one."}, {"time": 7959, "text": "And I think Kasparov was much more like."}, {"time": 7962, "text": "Never saw him play drunk, right?"}, {"time": 7964, "text": "Yeah, and it's very focused on the world championship."}, {"time": 7967, "text": "It's very, very limited number of games and very focused on winning."}, {"time": 7972, "text": "And so there's some aspect to the versatility, the aggressive play, the fun, all of that, that I think you have to give credit to."}, {"time": 7982, "text": "In terms of just the scope, the scale of the variety of genius exhibited by Magnus."}, {"time": 7990, "text": "And he might not even be done yet."}, {"time": 7992, "text": "I don't know if he'll ever hit 2,900, but we can't judge yet because he's not at the peak of his career potentially."}, {"time": 7998, "text": "What do you think about him not playing world championship?"}, {"time": 8000, "text": "Isn't that like, isn't that wild?"}, {"time": 8003, "text": "The entirety of the history of chess in the 20th century going like meh."}, {"time": 8007, "text": "It's walking away from this one tournament that seems to be at the center of chess."}, {"time": 8015, "text": "What do you think about that decision?"}, {"time": 8017, "text": "I mean, you can't help but be disappointed as a chess fan who wants to see the best player in the world defend his title."}, {"time": 8024, "text": "But I also understand it on a personal level and not feeling as satisfied when you're going to the world championship and having to defend against people who are less strong than you."}, {"time": 8037, "text": "And also imagine winning world championships and not feeling a joy out of that."}, {"time": 8042, "text": "So maybe by not doing that and focusing instead on a goal like 2,900, he'll be more likely to accomplish it because he's focusing on what actually motivates him to play chess."}, {"time": 8053, "text": "But I do think that it will hurt how we judge the next world champion."}, {"time": 8061, "text": "I think it won't change him being the best player in the world."}, {"time": 8065, "text": "And for someone to replace him, even let's say like Nepo versus Sting, even if one of them win and right on some stance, it does lower the merit because now who has the world chess championship title isn't actually the best player in the world."}, {"time": 8079, "text": "And that has happened before in the past, but still going to take the same effort to prove when they would pass him like 10, 20 years to become stronger than Magnus."}, {"time": 8089, "text": "So I don't think it changes the skill level that it takes to become the best chess player in the world."}, {"time": 8094, "text": "I think for chess fans, it's very disappointing, but I think in the overall like grand scheme of like the public view to people who don't really, so like, you know, what breaks the popular culture and you think of what names people know who don't play chess like Bobby Fischer did it."}, {"time": 8110, "text": "Most people know Casper over Magnus."}, {"time": 8112, "text": "It takes the same ability and talent and that doesn't change."}, {"time": 8115, "text": "I think it does change though if you're playing a player who's not as strong, but I see your point as well."}, {"time": 8122, "text": "And I know we differ on this."}, {"time": 8123, "text": "Like I said, I heard you ask Magnus, but what is your take on it?"}, {"time": 8130, "text": "Well, listen, his answer is kind of brilliant, which he's not saying he's bored of the world championship."}, {"time": 8139, "text": "He's bored of a process that doesn't determine the best player."}, {"time": 8144, "text": "Like, and it's too exciting inducing to him to have a small number of games."}, {"time": 8150, "text": "He doesn't mind losing, which is really fascinating to a better player or somebody who is his level."}, {"time": 8158, "text": "He's more anxious about losing to a weaker player because of the small sample size."}, {"time": 8167, "text": "Now, if like poker players had that anxiety, they would never play at all, right?"}, {"time": 8171, "text": "That's the World Series of Poker."}, {"time": 8173, "text": "You get to lose against weaker players all the time."}, {"time": 8177, "text": "That's the throw of the dice."}, {"time": 8179, "text": "But that's an interesting perspective that he would love to play 20, 30, 40 games in the world championship, and then he would enjoy it much more."}, {"time": 8188, "text": "And also play shorter games because they emphasize the like pure chess, actually being able to like much more variety in the middle game just to see a bunch of chaos and see how you're able to compute, calculate and intuition, all that kind of stuff."}, {"time": 8208, "text": "I wish the chess world would step up and meet him in a place that makes sense, change the world championship."}, {"time": 8216, "text": "So FIDE changing it somehow, a loss for that."}, {"time": 8220, "text": "Or having other really respected tournaments that become like an annual thing that step up to that."}, {"time": 8227, "text": "Or more kind of online YouTube type of competitions, which I think they're trying to do more and more, like the Crypto Cup and all those kinds of things."}, {"time": 8236, "text": "And the Grand Tour does play in, which takes a lot of the top players and they do it online in shorter formats."}, {"time": 8243, "text": "But there's, so that's his perspective."}, {"time": 8246, "text": "My perhaps narrow perspective is I romanticize the Olympic games and those are every four years and the world championships because they're rare, because the sample size is so small."}, {"time": 8262, "text": "Everything's on the line for people that spend their whole life, 20 years of dedication, everything you have, every minute of the day spent for that moment."}, {"time": 8274, "text": "You think about like gymnastics at the Olympic games."}, {"time": 8277, "text": "There's certain sports where a single mistake and you're fucked."}, {"time": 8281, "text": "And that stress, that pressure, it can break people or it can create magic."}, {"time": 8291, "text": "Like a person that's the underdog has the best night of their life or the person that's been dominating for years all of a sudden slips up."}, {"time": 8299, "text": "That drama from a human perspective is beautiful."}, {"time": 8302, "text": "So I still like the world championships, but then again, looking at all the draws, looking at like, well, the magic isn't quite there."}, {"time": 8313, "text": "So to me, when I see faster games of chess, that's much more beautiful."}, {"time": 8319, "text": "But then I don't understand the game of chess deeply enough to know."}, {"time": 8323, "text": "Like, does it have to be so many draws?"}, {"time": 8328, "text": "Like, is there a way to create a more dynamic chess?"}, {"time": 8331, "text": "And he talked about random chess with a random starting position."}, {"time": 8336, "text": "But then of course, that's like, then you do have to play hundreds of games and that kind of stuff."}, {"time": 8343, "text": "But I think it's great that the world number one is struggling with these questions because he's in the position, he has the leverage to actually change the game of chess as it's publicly seen, as it's publicly played."}, {"time": 8361, "text": "He's still young enough to dominate for quite a long time if he wants."}, {"time": 8367, "text": "I, you know, with Kasparov, the fight between nations, I hope they have the world championship and I hope he's still a part of it somehow."}, {"time": 8378, "text": "I hope he changes his mind."}, {"time": 8380, "text": "And comes back."}, {"time": 8381, "text": "Comes back."}, {"time": 8382, "text": "Kind of dramatic thing."}, {"time": 8384, "text": "But it is, his heart is not in it."}, {"time": 8387, "text": "And then, and then that's not beautiful to see, right?"}, {"time": 8397, "text": "Yeah, it is beautiful that the thing he wants is a great game of chess against an opponent that's his level or better."}, {"time": 8407, "text": "And that's great that he's coming from that place."}, {"time": 8410, "text": "But I hope he comes back tomorrow."}, {"time": 8411, "text": "Because the world championship is a special thing in any sport."}, {"time": 8416, "text": "So you do wish that the person who wins the world championship is the best player in the world?"}, {"time": 8425, "text": "I hope that the best people in the world, the two best people in the world are the ones that sit down."}, {"time": 8433, "text": "But the person that wins is the person that, that's the magic of it."}, {"time": 8437, "text": "Nobody knows who's going to win."}, {"time": 8439, "text": "I think Magnus is so, he really wants the best person to win."}, {"time": 8444, "text": "Like the, that's why he wants the large sample size."}, {"time": 8448, "text": "But to me there's some magic to it."}, {"time": 8450, "text": "The stress of it, the drama of it."}, {"time": 8453, "text": "That's all part of the game."}, {"time": 8455, "text": "Like it's not just about the purity of the game, like the calculation."}, {"time": 8460, "text": "The pure chess of it."}, {"time": 8461, "text": "It's also like the drama."}, {"time": 8463, "text": "Like the, yeah, the pressure, the drama, all of it."}, {"time": 8467, "text": "The shit talking, if it gets to you, the mind games."}, {"time": 8470, "text": "This is the part that's fun to watch, but less fun to be playing."}, {"time": 8474, "text": "But that's why it's great."}, {"time": 8475, "text": "Who can melt, who can rise under that pressure and who melts under that pressure."}, {"time": 8482, "text": "There's a lot of people that look up to you, like they're inspired by you because you've taken a kind of nonlinear path through life."}, {"time": 8488, "text": "Is there any advice you have for people like in high school today?"}, {"time": 8493, "text": "They're trying to figure out what they want to do."}, {"time": 8495, "text": "Do they want to go to Stanford?"}, {"time": 8497, "text": "Do they want to pursue a career in, I don't know, in industry or go kind of the path you guys have taken, which is have the ability to do all of that and still choose to make the thing that you're passionate about your life."}, {"time": 8513, "text": "I always liked the calculated risks approach where when you're younger, it's okay to take more risks because you have a lot more time, but there has to be a reason why you're doing that particular risk."}, {"time": 8526, "text": "Is it something that you've spent a lot of time already really passionate and working on or is it just something that's trendy and you want to do it because you don't have a better option?"}, {"time": 8533, "text": "And that's actually similar to what Andrea did when she decided to go into streaming instead of school."}, {"time": 8539, "text": "Yeah, the reason I got into streaming because I was initially going to go to college, but the pandemics, it was right at the beginning of the pandemic and all my classes were online."}, {"time": 8549, "text": "And I never thought, ever since I was 12, like my dream was school and I saw myself nowhere else than going to university."}, {"time": 8557, "text": "And I thought of it and kind of weighed out the risks."}, {"time": 8560, "text": "I'm like, well, if I take a gap year and I try streaming with my sister, what do I have to lose?"}, {"time": 8565, "text": "I gained some experience working with someone who has a lot more experience than I do."}, {"time": 8569, "text": "And then I can go back to school after."}, {"time": 8572, "text": "And if I go to school right now, I do online classes for a year and that's something that I could do at any time."}, {"time": 8577, "text": "So that's why it made a lot of sense for me to go into this."}, {"time": 8580, "text": "But of course, this is also a very unique opportunity."}, {"time": 8584, "text": "So I don't know how applicable, but I do think overall the calculated risk is a really good lesson."}, {"time": 8588, "text": "So life is like chess."}, {"time": 8591, "text": "Maybe sometime."}, {"time": 8593, "text": "You also, have you considered a career in professional fighting?"}, {"time": 8596, "text": "I saw you did a self defense class, you did a little Jiu Jitsu."}, {"time": 8600, "text": "Did you see the 10 year old kid who..."}, {"time": 8602, "text": "Throwing her?"}, {"time": 8604, "text": "Yes, and apparently I could have broken a leg."}, {"time": 8606, "text": "But it's actually funny, like chess boxing is a thing and I have been doing a lot of boxing."}, {"time": 8612, "text": "Physical activity is like, honestly, one of my favorite things to do."}, {"time": 8615, "text": "And I have been testing it out on content and we have a creator friend who's hosting a chess boxing tournament, but there's no woman who could match me, unfortunately, because all the opponents are male and I can't fight a guy."}, {"time": 8630, "text": "How does chess boxing work?"}, {"time": 8631, "text": "So you do a round of chess and a round of boxing."}, {"time": 8634, "text": "And we actually did a training camp for it before."}, {"time": 8636, "text": "And of course, after you go into the ring."}, {"time": 8639, "text": "Is this real?"}, {"time": 8640, "text": "Is this serious?"}, {"time": 8641, "text": "Yes, it's amazing."}, {"time": 8641, "text": "We went to a London chess boxing club."}, {"time": 8643, "text": "And after you get... No, it seemed like videos, I thought it was something you'd just do in Russia or something."}, {"time": 8647, "text": "No, it's a real sport."}, {"time": 8648, "text": "It's a real sport."}, {"time": 8649, "text": "Yeah, no, it's very cool."}, {"time": 8650, "text": "But after you get really tired, you're more likely to make a mistake and they call them Jaffers or something."}, {"time": 8656, "text": "Yeah, there's probably good strategies, like what do you want to... Because some of it is a cardio thing."}, {"time": 8661, "text": "Do you want to work on your chess or your boxing?"}, {"time": 8663, "text": "They do both, it's very fun."}, {"time": 8665, "text": "But yeah, from a content perspective, I'm sure there's a lot of people that would love to see."}, {"time": 8671, "text": "I don't want to see Andrea getting hit."}, {"time": 8673, "text": "That would be..."}, {"time": 8674, "text": "I would love to fight."}, {"time": 8675, "text": "Unless she doesn't get hit."}, {"time": 8677, "text": "Our roommate fought in a fight and she did end up winning, but seeing her get hit, I thought I was going to throw up off screen."}, {"time": 8683, "text": "I just think it was so cool."}, {"time": 8684, "text": "She had no experience in boxing whatsoever."}, {"time": 8687, "text": "And then coming from someone in the content world, where you start waking up six days a week at 6 a.m. and she's training every day, like a real professional athlete, I think like it's such a unique experience and also like a really test of how much you can really commit to this and progress."}, {"time": 8702, "text": "And I think that's really rewarding."}, {"time": 8705, "text": "Did you ever end up doing the marathon with David Goggins that you were training for?"}, {"time": 8709, "text": "No, I got injured, but we're going to do it soon."}, {"time": 8711, "text": "That's on my bucket list, just to see what your limits are."}, {"time": 8715, "text": "You're ready to do it?"}, {"time": 8716, "text": "What did you do leading up to this?"}, {"time": 8719, "text": "You're just going to go into it."}, {"time": 8720, "text": "It's mental anyway."}, {"time": 8722, "text": "Oh, you don't..."}, {"time": 8723, "text": "I run a lot to make sure like there's no... You have to have a base level of fitness to make sure your body doesn't completely freak out."}, {"time": 8732, "text": "But other than that, 50 plus miles is just about like taking it one step at a time and just being able to deal with the suffering and all the voices, the little voices that tell you all the excuses, like why are you doing this?"}, {"time": 8747, "text": "This blister is bleeding, whatever."}, {"time": 8749, "text": "Whatever the thing that makes you want to stop, just shut it off."}, {"time": 8754, "text": "Sometimes it feels like you like pain."}, {"time": 8756, "text": "No, well, no, no."}, {"time": 8760, "text": "But the pain does seem to show the way to progress."}, {"time": 8765, "text": "So what..."}, {"time": 8766, "text": "In your turn of life."}, {"time": 8768, "text": "In my world."}, {"time": 8768, "text": "Something that's really hard and I don't want to do, that's usually the right thing to do."}, {"time": 8774, "text": "And I'm not saying that's like a universal truth."}, {"time": 8777, "text": "It's just, if there's a few doors to go into, the one that I want to go into least, that's the one that usually is the right one."}, {"time": 8787, "text": "Afterwards, I will learn something from it."}, {"time": 8789, "text": "The David Goggins thing, I don't know."}, {"time": 8791, "text": "Listen, we're talking offline, the conversation with Liv, she has a very numeric, calculated risk."}, {"time": 8798, "text": "Everything is planned."}, {"time": 8799, "text": "I go with the heart."}, {"time": 8801, "text": "I just go whatever the hell."}, {"time": 8802, "text": "I think two years ago, I woke up, it was summer, I decided to tweet, I will do as many pushups."}, {"time": 8813, "text": "I don't know why I did this, but I will do as many pushups and pull ups as this week gets likes, something like that."}, {"time": 8822, "text": "And then that it got like 30,000."}, {"time": 8827, "text": "Once you put it out on the internet, you're held accountable."}, {"time": 8829, "text": "Well, for myself, I mean, in some sense."}, {"time": 8831, "text": "And then that's when, I already was connected to David at that point, but that's when he called me."}, {"time": 8838, "text": "And then didn't have to do it."}, {"time": 8839, "text": "And then I did it and it was one of the hardest things I've ever done."}, {"time": 8842, "text": "How long did you take?"}, {"time": 8843, "text": "I did it for seven days and I got injured."}, {"time": 8845, "text": "So I did about a few thousand."}, {"time": 8847, "text": "Wait, so this is what got you to be injured?"}, {"time": 8849, "text": "This challenge?"}, {"time": 8850, "text": "No, it's different."}, {"time": 8851, "text": "I keep getting injured doing stuff."}, {"time": 8854, "text": "But this particular thing, I started doing the, you don't realize that you have to really ramp up."}, {"time": 8859, "text": "So I got like overuse injury tendonitis on the shoulder all the way down to the elbow."}, {"time": 8866, "text": "So I took like eight or nine days off and then started again."}, {"time": 8871, "text": "And then it took about 31 days to do."}, {"time": 8875, "text": "30,000."}, {"time": 8877, "text": "The number was like 26, 27,000."}, {"time": 8883, "text": "And it took like three, four hours a day."}, {"time": 8888, "text": "Sounds like torture."}, {"time": 8888, "text": "And not, you know, constantly asking myself, what am I doing with my life?"}, {"time": 8893, "text": "This is why you're single, was the voice in my head."}, {"time": 8896, "text": "This is what are you doing?"}, {"time": 8898, "text": "It's like face down on the carpet."}, {"time": 8901, "text": "Like exhausted."}, {"time": 8903, "text": "Like what, what?"}, {"time": 8904, "text": "Because of a tweet?"}, {"time": 8906, "text": "Did you record it or you just?"}, {"time": 8909, "text": "I did record it for myself."}, {"time": 8911, "text": "Now imagine doing this every day and that's what it's like to be a Twitch streamer."}, {"time": 8916, "text": "I'm doing stupid things."}, {"time": 8917, "text": "That was really important to me actually to not make it into content."}, {"time": 8922, "text": "You know, I recorded everything."}, {"time": 8923, "text": "So maybe one day I could publish it."}, {"time": 8924, "text": "I recorded it mostly because it's really hard to count."}, {"time": 8929, "text": "When you get exhausted."}, {"time": 8931, "text": "Like I just, so you actually enter the Zen place where with pushups, where it's just like, it's almost like breathing."}, {"time": 8939, "text": "You get into a rhythm and you can do quite a lot."}, {"time": 8942, "text": "But I wanted to make sure like, if I actually get this done, I want there to be evidence that I got it done for myself so I can count it."}, {"time": 8950, "text": "I had this idea that I would use machine learning to like automatically process the video to count it."}, {"time": 8955, "text": "But then like, after like 10 days, I didn't even give a shit what anyone thought."}, {"time": 8959, "text": "It was about me versus me."}, {"time": 8961, "text": "I didn't even care."}, {"time": 8962, "text": "Lex versus Lex."}, {"time": 8966, "text": "And David was extremely supportive."}, {"time": 8967, "text": "But that's when I realized like, I really want to go head to head with him."}, {"time": 8971, "text": "So yeah, those kinds of people are beautiful."}, {"time": 8974, "text": "They really challenge you to your limits."}, {"time": 8976, "text": "Whatever that is."}, {"time": 8977, "text": "It's like, the thing is physical exercise is such an easy way to push yourself to your limit."}, {"time": 8982, "text": "There's in all other walks of life, it's trickier to configure."}, {"time": 8986, "text": "Like how do you push yourself to your limits in chess?"}, {"time": 8988, "text": "It's hard to figure out."}, {"time": 8990, "text": "But like in physical."}, {"time": 8991, "text": "Do you think it's ever dangerous?"}, {"time": 8994, "text": "And that's why it's beautiful."}, {"time": 8996, "text": "The danger."}, {"time": 8996, "text": "She likes the pain."}, {"time": 8997, "text": "I don't like that your eyes lit up as I said."}, {"time": 9001, "text": "Like if you don't know how you're gonna get out of it, you're gonna have to figure out something profound about yourself."}, {"time": 9010, "text": "And I mean, one of the reasons I went to Ukraine is I really wanted to experience the hardship and the intensity of war that people are experiencing so I can understand myself better, I can understand them better."}, {"time": 9027, "text": "So the words that are leaving my mouth are grounded in a better understanding of who they are."}, {"time": 9032, "text": "And I mean, the running a lot with David Gong is it's a much simpler thing to do."}, {"time": 9040, "text": "Simpler way to understand something about yourself, about like the limits of human nature."}, {"time": 9044, "text": "I think most growth happens with voluntary suffering or struggle, involuntary stuff."}, {"time": 9050, "text": "That's where the dark trauma is created."}, {"time": 9052, "text": "But I don't know, maybe it is."}, {"time": 9055, "text": "Maybe I'm just attracted to torture."}, {"time": 9057, "text": "And what is it that your mind does when you're going through this involuntary suffering?"}, {"time": 9063, "text": "I think, there's like stages."}, {"time": 9075, "text": "First, all the excuses start coming."}, {"time": 9077, "text": "Like why are you doing this?"}, {"time": 9080, "text": "And then you start to wonder like what kind of person do you want to be?"}, {"time": 9086, "text": "So all the dreams you had, all the promises you made to yourself and to others, all the ambitions you had that haven't come yet realized, somehow that all becomes really intensely like visceral as the struggle is happening."}, {"time": 9101, "text": "And then when all of that is allowed to pass from your mind, you have this clear appreciation of what you really love in life, which is just like just living."}, {"time": 9113, "text": "Just the moment, the step at a time."}]}]