[{"title": "Vitalik Buterin: Ethereum 2.0 | Lex Fridman Podcast #188", "id": "XW0QZmtbjvs", "quotes": [{"time": 331, "text": "And this created a bit of a Twitter splat."}, {"time": 334, "text": "Now, the Shiba people were more clever."}, {"time": 336, "text": "The Shiba people, instead of dumping to that wallet, they dumped to my cold wallet, right?"}, {"time": 341, "text": "So in a cryptocurrency, right, there's this concept of like cold wallets and hot wallets."}, {"time": 345, "text": "Basically, like the thing that actually owns your money is like this 80 digit number called a private key, right?"}, {"time": 352, "text": "And a hot wallet is when that private key is just stored in memory on your computer, on your phone, really easy to access."}, {"time": 358, "text": "Cold wallet means it's either written down on a piece of paper or it's on a computer that's just never accessed the internet, right?"}, {"time": 367, "text": "So cold is very inconvenient, but cold is also much more secure, right?"}, {"time": 370, "text": "Because even if that computer has some viruses on it, like it's like air gapped, it's not actually going to be able to upload it."}, {"time": 377, "text": "So this cold wallet and like all the money is out of the cold wallet, so it's safe for me to talk about my setup now, right?"}, {"time": 384, "text": "But it was a laptop that was sitting in Canada."}, {"time": 387, "text": "And I also had two pieces of paper where I wrote down two numbers on those two pieces of paper."}, {"time": 393, "text": "One was with me, one was in Canada."}, {"time": 395, "text": "And if you add those two numbers together, you get the private key."}, {"time": 398, "text": "So because of COVID travel restrictions, and this cold wallets in Canada, like it's very difficult for me to actually access it, right?"}, {"time": 408, "text": "And I'm not sure if they knew this, maybe they just got lucky, but basically they sent a lot of these dog tokens into this wallet where it was very difficult for me to access it."}, {"time": 420, "text": "But then I saw these dog tokens, I saw more and more people talking about them."}, {"time": 424, "text": "And then at some point I realized that like, hey, these things are worth billions of dollars."}, {"time": 429, "text": "And like, no, there's lots of really good things that you could do with that amount of money."}, {"time": 433, "text": "And it would actually be a waste to just like see it go."}, {"time": 436, "text": "So I made the decision that like, I would actually power through and figure out how to like safely, like basically get my private key."}, {"time": 444, "text": "I actually had to call up my family, tell them to read out their number off of their piece of paper."}, {"time": 450, "text": "I entered that into a fresh laptop that I bought from Target."}, {"time": 455, "text": "Then I put in my other number on my piece of paper, added the two numbers together on the computer, there's the key."}, {"time": 461, "text": "And at the same time, like just scrambled for two days, setting up a new wallet where I could move my ETH to safely, like getting people to be multisig partners, just like doing all sorts of like stuff that 10 years ago you would expect to just be part of a cyberpunk science fiction novel, but now it's all real."}, {"time": 479, "text": "So you're doing this all by yourself, essentially."}, {"time": 483, "text": "Most of it by myself."}, {"time": 484, "text": "So you have to keep it secret."}, {"time": 485, "text": "Right, and I needed my family to actually like go and read the number on their piece of paper."}, {"time": 492, "text": "And then in my new multisig wallet, like there's other people that are signatories, but I'm obviously not gonna reveal any details beyond that."}, {"time": 502, "text": "So I did this, right?"}, {"time": 504, "text": "And I actually managed to like get the private key, make the first transaction that would just move all my ETH to the multisig wallet so it's safe."}, {"time": 512, "text": "And then second transact, put the private key on my main computer, then started going in and just selling some of the dog tokens and then just like giving them to these different charities."}, {"time": 523, "text": "Now, at the time I actually did not even like have any idea of how much you would be able to get, right?"}, {"time": 530, "text": "Because like on paper, the dog tokens are $7 billion, but like in reality, it's a very liquid market."}, {"time": 536, "text": "Are you gonna crash it after you sell 1 million worth or are you gonna crash it after 10 million?"}, {"time": 543, "text": "Might you actually be able to get like an entire 200 million?"}, {"time": 548, "text": "So I definitely was just over the mindset, like, okay, I mean, I'll sell a bit, maybe I get some ETH and then donated some ETH to give well, donated some to other groups."}, {"time": 559, "text": "And then, okay, have some dog tokens."}, {"time": 561, "text": "Like I don't have an easy ability to sell more myself, but then I'll just like give them to these groups and like, hopefully they'll do good things with them."}, {"time": 569, "text": "It was actually, I actually donated at 20% then dumped 80%."}, {"time": 573, "text": "Yeah, so the COVID India group got one batch and then there's another group that got another batch."}, {"time": 580, "text": "And I don't wanna say who they are cause I think that they wanna announce themselves at some point."}, {"time": 586, "text": "Yeah, but you can see the fact that these transactions were made on the blockchain, but it was just very interesting and unexpected and just an insanely crazy situation."}, {"time": 600, "text": "It's been a couple of weeks."}, {"time": 602, "text": "First of all, thank you for helping me hang up some curtains."}, {"time": 606, "text": "This is a first for the podcast and shows that you're a truly a special person to be willing to help."}, {"time": 614, "text": "But now a couple of weeks later, do you regret any aspect of that decision?"}, {"time": 620, "text": "I'm sure there is some things that I probably could have done better."}, {"time": 623, "text": "Like I was actually talking to some of these charities and I was impressed by just how much money they managed to get out of selling some of these coins."}, {"time": 632, "text": "So I probably could have done better by just talking more with the traders and actually ensuring that they can do a better job of maximizing the value of all of them."}, {"time": 648, "text": "But it was a very stressful time and I did have to act quickly."}, {"time": 653, "text": "Like I did manage to make a lot of the donations before, a few days before the great crypto crash happened."}, {"time": 661, "text": "So it was, it's difficult to, obviously there's parallel universes in which I did better, but at the same time, there's also lots of parallel universes where because I hesitated more and tried to spend more time thinking I missed the opportunity."}, {"time": 677, "text": "So on that, it's like a luck of the draw and I'm just happy that everything was able to turn out as well as it did."}, {"time": 687, "text": "But psychologically, you mentioned stress."}, {"time": 690, "text": "How hard was it?"}, {"time": 692, "text": "It was stressful, right?"}, {"time": 693, "text": "I think, well, one of the really stressful parts was just the fact that I had to basically move all of my funds, including the 325,000 ether from one cold wallet into another hot wallet, or sorry, into another multi SIG wallet."}, {"time": 708, "text": "And maybe the multi SIG wallet had a bug in it."}, {"time": 710, "text": "Maybe there's like some mistake I'll make in the middle that causes the funds to get lost."}, {"time": 715, "text": "You know, that part was stressful."}, {"time": 718, "text": "And I was definitely stressing out for two days."}, {"time": 721, "text": "I mean, triple checking the new wallet."}, {"time": 723, "text": "I even did a bit of an audit of the code myself."}, {"time": 725, "text": "I wrote my own JavaScript to DAP to make confirmations because Gnosis Safe didn't work with the status wallet well."}, {"time": 734, "text": "So there was definitely, that whole thing was definitely a bit of a marathon."}, {"time": 739, "text": "I was also a kind of definitely a bit worried about or uncertain, I guess, how the public and including the coin communities would perceive the whole thing."}, {"time": 751, "text": "But I was actually impressed."}, {"time": 753, "text": "Like I, for every poster that was saying like, no, you know, why did Vitalik like rug pull on us?"}, {"time": 760, "text": "He was, his wallet was supposed to be a burn address."}, {"time": 764, "text": "You know, there's like 10 people that are like, oh, you know, I thought I was just in this because it's a fun pyramid gambling thing."}, {"time": 772, "text": "But instead I ended up being part of this, you know, great public good thing for humanity."}, {"time": 776, "text": "And that's like even more amazing."}, {"time": 778, "text": "So the amounts of that that I got was very impressive."}, {"time": 783, "text": "So, you know, all in all, you know, I think the dog people did great."}, {"time": 787, "text": "The dog people."}, {"time": 788, "text": "Is there something you can extend to the bigger picture of it in the principles you apply to making this decision?"}, {"time": 795, "text": "Is there some principles, philosophies that you apply also to the decisions you make around Ethereum?"}, {"time": 804, "text": "I think a big one for me is just this idea that crypto, you know, isn't just an opportunity to give people like slightly better ways to save value in all of these things."}, {"time": 817, "text": "Like it's also an opportunity to like basically create these like new digital institutions that could serve the public good in new ways."}, {"time": 827, "text": "And that's something that I've been interested in for a long time."}, {"time": 831, "text": "I actually even have this article in Bitcoin Magazine back in 2014, where I basically suggested this idea that, you know, you would have coins that represent causes and like people would just like buy and accept those coins because they support those causes."}, {"time": 845, "text": "So I think it's called markets, institutions, and currencies, a new form of social incentivization or something like that."}, {"time": 851, "text": "And I'm sure you can find it and throw it in the links."}, {"time": 854, "text": "So that was interesting to kind of see becoming real."}, {"time": 859, "text": "And like in general, I think, you know, public goods are very important and on the internet, public goods are even more important."}, {"time": 866, "text": "Like every single Lex Friedman podcast is just on YouTube and no anyone can go and see it."}, {"time": 871, "text": "Like there's no way for you to like, you know, sell it and so that some people can see it, but then other people can't see it."}, {"time": 878, "text": "Like, you know, you could do that, but then you'd obviously be reducing your impact."}, {"time": 882, "text": "So thank you for making the amazing Lex Friedman podcast so freely available."}, {"time": 888, "text": "Well, that's actually a tense thing is how do you do it in a way that's not controlled in a centralized fashion?"}, {"time": 895, "text": "Cause actually YouTube feels free and open, but it nevertheless is one company making centralized decisions."}, {"time": 901, "text": "And the first time I realized YouTube is not forever is when a lot of the Joe Rogan experience library was pulled from YouTube as part of the Spotify deal."}, {"time": 913, "text": "And it made me realize we need to, it's like the realization that fiat money is centralized is realizing that, you know, this is not forever and you might want to come up with schemes to distribute it, to decentralize the control of it in a way that audio for podcasts is just an RSS feed."}, {"time": 935, "text": "And I think one of the kind of philosophical things that I hope to achieve is kind of decouple the concept of public goods, which are incredibly important and are the lifeblood of modern civilization from the idea that there is or can be one central organization that represents the public and like perfectly understands and can impose their idea of what is the good, right?"}, {"time": 958, "text": "Like it's, when people talk about public goods, it just often comes with this baggage of, you know, either centralization or conformism."}, {"time": 967, "text": "And I think like it doesn't have to, right?"}, {"time": 969, "text": "Like often the most important public goods are the ones that are created by, you know, the crazy individualists that disagree with everyone else."}, {"time": 977, "text": "So trying to make this kind of synthesis where you combine the values of decentralization and the values of open source, but you're not naive about it."}, {"time": 989, "text": "And like, you know, you realize that for these things to be produced, there needs to be a way for it to be sustainable."}, {"time": 996, "text": "There needs to be some way of supporting people who are working these projects."}, {"time": 999, "text": "But at the same time, you want to avoid that turning into a vector of centralization, like trying to sort of get all of the good things without the bad things."}, {"time": 1010, "text": "To me, that's a big part of sort of what my grand experiment in crypto is about."}, {"time": 1018, "text": "And like, we are doing things in different kinds of things for this, right?"}, {"time": 1022, "text": "Like there's the Gitcoin Grants quadratic funding in the Ethereum ecosystem."}, {"time": 1027, "text": "There's obviously these dog coins that just happens, I guess, accidentally."}, {"time": 1034, "text": "There's other projects that, like for example, you know, Uniswap has their Uniswap DAO that just has a huge amount of funding."}, {"time": 1042, "text": "And like, we haven't seen yet how that's going to be deployed, but, you know, it could be potentially deployed to do lots of really good and amazing things."}, {"time": 1051, "text": "Do you see Ethereum as essentially a mechanism to fight for social causes?"}, {"time": 1061, "text": "I definitely see Ethereum as being a mechanism to fight for definitely some specific things that are social causes."}, {"time": 1074, "text": "Like just, you know, the fact of creating an open financial system that anyone can participate in no matter where they are in the world, that's a social cause."}, {"time": 1083, "text": "Just, you know, giving people the ability to organize and create projects, even if it's five people in five different countries."}, {"time": 1090, "text": "I think that kind of inclusiveness, I think that's a social cause and it's a core crypto value."}, {"time": 1098, "text": "But then at the same time, like the other important and if part of the magic of Ethereum that you have to balance that against is that it is also this open platform where ultimately, you know, the things that are on Ethereum is just the things that the community makes of it."}, {"time": 1115, "text": "Well, you kind of briefly opened the door, so let's go there."}, {"time": 1119, "text": "When it comes to government regulation of crypto, what's the best case scenario?"}, {"time": 1126, "text": "What's the worst case scenario?"}, {"time": 1128, "text": "In terms of, you know, as you've kind of mentioned, Ethereum challenges the power centers of the world and how do you see the interplay between governments and this new technology that resists centralized power?"}, {"time": 1146, "text": "Best case and worst case."}, {"time": 1213, "text": "Like, you know, the concept of corporate taxes, for example, right?"}, {"time": 1248, "text": "And, you know, there are going to be things that people are unhappy about."}, {"time": 1252, "text": "There's always gonna be the people that, you know, wants to surveil everyone but if the kind of effect of crypto from just empowering people is greater than that and greater than that in a way that people can just easily see, then, you know, that would be a good scenario, right?"}, {"time": 1269, "text": "And we'll just become kind of incorporated and accepted the same way as happened with the internet."}, {"time": 1276, "text": "But in the worst case scenario would, of course, be just like people suddenly, you know, flipping and going into moral panic mode and just, you know, oh my God, like this technology is used by like, you know, insert bad group over the day."}, {"time": 1291, "text": "And then I don't think governments have the ability to ban crypto to the extent of just complete like preventing blockchains from existing but they definitely have the ability to really marginalize it, right?"}, {"time": 1302, "text": "Like if you just ban all exchanges, like in ban all links from the Fiat ecosystem to crypto and, you know, you ban all kind of mainstream employers from accepting or paying in cryptocurrency, then like you can successfully like turn it into a, like, you know, a fairly kind of niche countercultural thing that has much less impact than otherwise would."}, {"time": 1327, "text": "So it's somewhere between the good scenario and the bad scenario."}, {"time": 1330, "text": "I'm obviously hoping for the good."}, {"time": 1332, "text": "Well, that's interesting also the tension between governments and companies."}, {"time": 1337, "text": "Like if you have a bunch of billionaires or a bunch of companies like Tesla investing in Bitcoin and then governments resisting that, it's interesting who wins out in that worst case scenario."}, {"time": 1347, "text": "And almost when companies and rich, quote unquote, respectable people embrace cryptocurrencies, Bitcoin, Ethereum, so on, even the dot coins, it's almost sends a signal to everybody else that this is a revolution that's here to stay."}, {"time": 1369, "text": "On this one little tangent that you brought up, this is almost an outdated idea, but it's still with us, which is cryptocurrencies are used for illegal activity, for drugs, for crime, and so on."}, {"time": 1382, "text": "Is there some sense that worries you that if cryptocurrency, if Ethereum runs the world, then making money from crime will be easier?"}, {"time": 1397, "text": "There's always that possibility, but like at the same time, I think if you look at, you know, the world as a whole and like the way all the other technological trends are going, like, you know, in person surveillance is just going up every year, right?"}, {"time": 1410, "text": "Like if you commit a crime in, you know, meat space, it's getting harder and harder to get away with it."}, {"time": 1416, "text": "So like, you know, if you wants to do something, and this is something that's just like happening as a result of, you know, just better technology and information transparency, like a lot of it's hard to prevent even if you really tried."}, {"time": 1431, "text": "So the world where like things go dark to such an extent, you know, as the police hawks sometimes like to say, to such an extent that like, you know, oh my God, the criminals are committing crimes with impunity and we can't see anything, like that just seems unlikely."}, {"time": 1449, "text": "But, you know, on the other hand, like the world where there just, you know, is no privacy, for example, or the world where there just like is no ability to kind of act outside of the confines of, you know, mainstream institutions, like that's something that's more realistic and that seems like something that could lead to a lot of kind of a lot of scary things, right?"}, {"time": 1480, "text": "And like, even from a government's point of view, right?"}, {"time": 1482, "text": "Like I think governments over the last few years, a lot of them, they're very worried about sovereignty."}, {"time": 1487, "text": "You know, they're worried about like, if their country is economies and, you know, social environments are just completely dependent on basically foreign tech companies controlled by foreign governments, like, you know, governments are not on team government, right?"}, {"time": 1501, "text": "It's like, you know, the Indian government is on, you know, team India, then the Russian government is on team Russia and so forth, right?"}, {"time": 1508, "text": "So like, you know, they don't want the US to be able to like have this big backdoor into everything."}, {"time": 1514, "text": "So, I mean, I do think that a balance is needed, but at the same time, I do think, I guess I definitely like worry more about the possibility that just like without things to like crypto kind of acting outside of institutions becomes too impossible."}, {"time": 1540, "text": "And I don't even necessarily mean outside of governments, even just, you know, outside of corporations, like becomes too impossible."}, {"time": 1545, "text": "And there's just like terrible things that come as a result."}, {"time": 1548, "text": "I mean, if things going in the other direction, like it obviously is a risk, but no, at the same time, I think in the longterm, like a crypto can potentially even like offer defenses as much as attacks against that sort of thing."}, {"time": 1563, "text": "Yeah, many throughout history, many of the most destructive things came from centralized institutions versus sort of from the people operating in the shadows."}, {"time": 1573, "text": "And, you know, I've been talking to a bunch of psychedelics folks that people doing researches like Rick Doblin in Johns Hopkins, there's a lot of exciting research on psychedelics."}, {"time": 1583, "text": "And one thing you could say about operating at the edge of legality, it could actually accelerate the adoption of particular things like whether it's marijuana or psychedelics, they can help people out."}, {"time": 1599, "text": "It's almost accelerates the policy."}, {"time": 1601, "text": "It forces the policy to catch up to where the people stand."}, {"time": 1604, "text": "So there's a positive way of doing things that are in the gray area of legality and creating a market that allows people to in a safe way be able to participate in this gray area of legality."}, {"time": 1617, "text": "The other thing to keep in mind, of course, is that the set of like the kinds of things that just like payment processors as companies try to restrict you from is much larger than the set of things that's illegal, right?"}, {"time": 1628, "text": "Like part of that is because they wanna be super conservative and like the more layers you have, the more they're like conservative because they're scared of what the layer below them will do to them."}, {"time": 1638, "text": "Sometimes they have their own moral opinions of various kinds."}, {"time": 1643, "text": "They go after lots of people, right?"}, {"time": 1644, "text": "Like they make life really hard for sex workers, for example, psychedelics, as you mentioned, there's a lot of activity, even including stuff that is totally legal that just there's this like shadow like PayPal credit card governments or whatever you wanna call it."}, {"time": 1663, "text": "And that makes it just hard to participate in this stuff."}, {"time": 1667, "text": "So I think like reducing the number of intermediaries is definitely normally a good thing."}, {"time": 1674, "text": "All right, let's talk about one of the most exciting technologies like technically, philosophically, like socially, financially in every way, which is Ethereum 2.0."}, {"time": 1687, "text": "There's a million things to talk about, but step one is probably a good thing to do, which is can you briefly summarize your vision how Ethereum 2.0 will make Ethereum more scalable, secure and sustainable?"}, {"time": 1703, "text": "Sure, so I think recently we've actually been kind of deemphasizing the ETH 2.0 branding, I guess."}, {"time": 1710, "text": "So the reason behind that was that originally we envisioned something more like a big grand event where all the good things would happen at the same time and it would be a new blockchain, and it would be a new protocol and people would have to take a lot of effort to migrate over."}, {"time": 1726, "text": "But later we've slowly changed the roadmap over to something that's much more incremental, right?"}, {"time": 1733, "text": "So proof of stake happens kind of over time and then sharding gets added over time and all of these features get added over time."}, {"time": 1739, "text": "And so the experience for just a regular Ethereum user still feels very seamless, right?"}, {"time": 1744, "text": "It's like maybe a little bit more complex than the hard forks that we've already done from a user's point of view, but not by that much, right?"}, {"time": 1753, "text": "So the big two things that are happening, right?"}, {"time": 1757, "text": "These are what used to be considered the two flagship features of ETH 2.0 and now they're just the flagship features of the next devolution of Ethereum, as proof of stake and sharding."}, {"time": 1771, "text": "So proof of stake is a consensus algorithm."}, {"time": 1774, "text": "It's a, or a consensus mechanism, I should say."}, {"time": 1778, "text": "The difference is that like an algorithm is something that you run by yourself."}, {"time": 1781, "text": "A mechanism is like interactions between people and it could even include incentives and all of that."}, {"time": 1788, "text": "So a consensus mechanism, so by which nodes in the network agree on which blocks came in, which transactions came in, what order, make sure that once a block gets accepted, it can't get reverted and all of these things that we expect from a blockchain."}, {"time": 1806, "text": "So existing blockchains, including Bitcoin, including the Ethereum of today, and including a lot of them, they use proof of work, right?"}, {"time": 1813, "text": "So the reason why we need proof of anything is because they serve this function that I call an economic civil resistance."}, {"time": 1825, "text": "So that's obviously a big word for, especially if you've never heard of symbols before, but like the basic idea is, right, that you have a network and you have lots of computers that agree on like which blocks to accept."}, {"time": 1836, "text": "And sometimes you get two blocks that get published at the same time and you just have to agree on an order."}, {"time": 1841, "text": "So there has to be some kind of voting game."}, {"time": 1844, "text": "But then the question is, well, in this voting game, who gets to vote, who gets to participate?"}, {"time": 1849, "text": "Now, you can't say one person, one vote, right?"}, {"time": 1852, "text": "The reason why you cannot say one person, one vote is because you need some kind of like authority or some kind of mechanism to say who the humans are."}, {"time": 1860, "text": "And if you don't have that, then a bad guy could just come in with a virtual machine or with a computer that has on it 10 billion virtual machines that have 10 billion virtual nodes."}, {"time": 1871, "text": "And then just like say, look, I'm 99% of the network, I should control everything."}, {"time": 1875, "text": "So to prevent this, what proof of work and proof of stake both do is they basically say, well, the weight of your vote, like how much influence your votes have in the consensus is proportional to like what quantity of economic resources you bring in."}, {"time": 1891, "text": "So in the case of proof of work, you prove what economic resources you have because your economic resources are computers and you prove that you have them by just running them 24 seven using these hash algorithms, right?"}, {"time": 1902, "text": "So this does solve the problem, right?"}, {"time": 1905, "text": "Because in order to attack the network, you have to come in with more computers and more money invested into computers and electricity than the rest of the network puts together."}, {"time": 1915, "text": "And that's extremely expensive."}, {"time": 1917, "text": "In proof of stake, instead of relying on people with computers that are just constantly cranking out hashes 24 seven, as you're like a unit of economic resources, you just use like holdings of coins inside the system, right?"}, {"time": 1931, "text": "So all of these blockchains, they have some kind of coin in them."}, {"time": 1934, "text": "Bitcoin has Bitcoin, Ethereum has ether, they all have a coin."}, {"time": 1938, "text": "So why not just use that as the economic resource that you're using to measure participation."}, {"time": 1945, "text": "So that's like the core distinction between proof of work and proof of stake."}, {"time": 1951, "text": "I like proof of stake and I've liked proof of stake for many years, basically because like it just requires much less ongoing resource consumption, right?"}, {"time": 1961, "text": "Like with proof of work, you have to like actually go and buy these physical computers and these days, they have specialized hardware, ASICs, application specific integrated circuits."}, {"time": 1971, "text": "You have to go produce them and you have to go buy them."}, {"time": 1974, "text": "And unless you have millions of dollars, you have to buy them from one of these other people who creates them and those other people often end up taking a huge cut of the profits themselves."}, {"time": 1983, "text": "And then you have to plug them in, you have to just burn all of this electricity that's just running 24 seven."}, {"time": 1991, "text": "So it consumes a huge amount of energy, right?"}, {"time": 1994, "text": "And not just energy, it also, just to create the hardware, right?"}, {"time": 1999, "text": "Like people focus a lot on energy, but like actually about half the cost of proof of work mining is the cost of the hardware."}, {"time": 2005, "text": "So hardware is a very big deal too."}, {"time": 2008, "text": "And you need this really big and powerful, very specialized hardware, another kind that fills up these big warehouses."}, {"time": 2015, "text": "So proof of stake, you don't really need that much electricity, you just need just a little bit to run a regular computer."}, {"time": 2022, "text": "You can run proof of stake validators on computers that you already have."}, {"time": 2027, "text": "So it's just much less resource intensive."}, {"time": 2032, "text": "And like, this is good for a few reasons, right?"}, {"time": 2033, "text": "Like one is, you know, the kind of environmental rationale that, you know, you're not breaking the environment."}, {"time": 2039, "text": "The second is that you're not taking away electricity and like other resources from other people."}, {"time": 2046, "text": "I mean, like right now there's, I think just today I saw a story about like Iran wanting to shut down some Bitcoin mining because it was just grabbing up so much electricity that it was, you know, outbidding the nearby towns and they just didn't have enough."}, {"time": 2059, "text": "And then there was like Chia, the one that's doing proof of like hard disk mining basically is just like grabbing up so many hard disks, there's a shortage, right?"}, {"time": 2068, "text": "So that's the second reason."}, {"time": 2069, "text": "And then the third more selfish reason is that because participating in consensus does not require so much energy expenditure, you don't need to pay people as much to participate, right?"}, {"time": 2080, "text": "So like Bitcoin and Ethereum, they both issue somewhere around 4% of the total supply every year right now to miners."}, {"time": 2088, "text": "So Ethereum is about 4.7 million ether and the current supply is about 115 million."}, {"time": 2093, "text": "But with proof of stake, like we expect it'll be somewhere between 500,000 and one million per year."}, {"time": 2100, "text": "So that means, you know, the supply doesn't have to increase so quickly."}, {"time": 2107, "text": "One of the pros that the people sort of argue for the proof of work is that it is secure because it's much more difficult to sort of, as you've highlighted, it's difficult to participate."}, {"time": 2119, "text": "Is there, what are your thoughts about the security of the proof of stake mechanism?"}, {"time": 2128, "text": "Is there ways to make it secure?"}, {"time": 2130, "text": "So I think proof of stake is very secure because in order to be able to attack the system, you needs to have like basically as much stake as the rest of the network, right?"}, {"time": 2141, "text": "So that means like right now, for example, we have 5 million eth staking."}, {"time": 2144, "text": "So you have to come up with 5 million eth and then join the network."}, {"time": 2147, "text": "And then the other, so 5 million eth is a lot, right?"}, {"time": 2151, "text": "It's like, how much is it now?"}, {"time": 2153, "text": "Like $15 billion."}, {"time": 2155, "text": "So that's actually more than I believe the cost of attacking the Bitcoin network."}, {"time": 2160, "text": "And then the second thing is that recovering from attacks is much easier in proof of stake than in proof of work, right?"}, {"time": 2165, "text": "Because in proof of stake, you have, like, first of all, we have for many kinds of attacks that you do against this network, we have this concept of like automatic slashing, right?"}, {"time": 2174, "text": "Which basically means that in order to like revert a finalized block, so if there's one block that's like accepted by the network and you try to convince the network to kind of revert that block and accept a different block, in order to make that kind of attack, you basically have to have your validator, like a big portion of your validator assigned to conflicting messages."}, {"time": 2195, "text": "And this is something that like once these messages are on the network, like you can go and prove, like, look, these people did it."}, {"time": 2201, "text": "And so we have this feature in the protocol called slashing where you basically take all these people who provably misbehaved and you burn their coins, right?"}, {"time": 2208, "text": "And you don't burn anyone else's coins."}, {"time": 2210, "text": "Now, there are other cases, like for example, if instead of reverting blocks, the attack just tries to censor everyone, right?"}, {"time": 2217, "text": "Then everyone who got censored would just like basically create the minority chain and then the community would basically have to do a soft fork, right?"}, {"time": 2226, "text": "They would just have to say like, look, this chain is clearly attacking us, this chain is the one not attacking us, and so we're gonna join this chain."}, {"time": 2232, "text": "And then what happens is that on that new chain, the attackers also lose a lot of coins, right?"}, {"time": 2237, "text": "So the difference between proof of stake and proof of work is that in a proof of stake system, like you can identify specific participants and you can say, you know, these, and like this isn't like, you know, a human going in and saying, I don't like you, I don't like you, I don't like you, this is like automated, right?"}, {"time": 2252, "text": "So the slashing process is automated."}, {"time": 2257, "text": "So that's a painful process where the coins are burned."}, {"time": 2261, "text": "It is painful, yes."}, {"time": 2262, "text": "I think, I mean, the one big unknown, of course, is like if an attack actually happens and like if an attack happens that requires the community to actually choose one of these minority forks, then like what would the community actually successfully coordinating on this look like, right?"}, {"time": 2279, "text": "Like it's like, you know, we can talk about it and we can, you know, write like science fiction novels about it, but like until it's happened, you don't really know the details of like what it looks like and how difficult it is."}, {"time": 2291, "text": "What are the channels of communication for the community?"}, {"time": 2293, "text": "If you can enlighten me a little bit, like what, you know, in many ways in the political realm, Twitter is often used as a way to kind of have these emerging phenomena of large groups of people coming to a consensus about a particular idea."}, {"time": 2308, "text": "And then there's battle for consensus."}, {"time": 2310, "text": "What's in the Ethereum community, how do people, what are the sources of natural language based communication that have an emergent belief structure that you would say?"}, {"time": 2323, "text": "Or is it all through money?"}, {"time": 2325, "text": "Is it all through trading that the communication happens?"}, {"time": 2328, "text": "There's definitely talking as well."}, {"time": 2330, "text": "I mean, like we have to agree on protocol changes somehow, right, like there's Twitter, there's Reddit, there's GitHub, there's all of the various Ethereum forums, Ethereum magicians, Ethereum research."}, {"time": 2342, "text": "There's just in person communication."}, {"time": 2345, "text": "Then there's just kind of like the hidden web of everyone talking to everyone on Telegram or Signal."}, {"time": 2351, "text": "So it's like some of everything, right?"}, {"time": 2354, "text": "But I think like the thing to emphasize around like, can you actually come to consensus on, you know, whether or not to fork the chain because the attacker is censoring everyone, just for example, is like everyone who's running a node is going to see almost the same thing, right?"}, {"time": 2370, "text": "Like they're gonna be off by a few seconds and like maybe they'll be off by a few minutes, they'll disagree by a few minutes."}, {"time": 2375, "text": "But like if it's a serious attack, you know, people are gonna know, right?"}, {"time": 2378, "text": "It's not like one of those things where, you know, oh, we're trying to agree on like, I don't know, did Epstein kill himself or like some random political fact where like in reality, no one knows a single thing about what's actually going on and they're all speculating."}, {"time": 2392, "text": "Like it is much more visible, right?"}, {"time": 2394, "text": "So we do have that, but you know, at the same time, I'm happy to admit that like, these are fairly untested mechanisms, but like at the same time, they're also untested mechanisms in Proof of Work, right?"}, {"time": 2405, "text": "And like in Proof of Work, it's even harder because in Proof of Work, you don't have the ability to like identify and say, like, you know, I'm going to these miners attacked and so we're not gonna let these miners in, these miners did not attack, so we're gonna keep them in."}, {"time": 2420, "text": "Like you have to pretty much, you know, either take out none of the miners or you do a fork that changes the Proof of Work algorithm which takes out all of the miners, right?"}, {"time": 2428, "text": "So the economics of like recovering from attacks in Proof of Work, at least to me, actually do seem like more unfavorable, but you know, I'm sure the Proof of Work people you talk to will give a very different and contradictory opinions and that's totally fine and amazing."}, {"time": 2444, "text": "Some people describe MEV, minor extractable value, as an existential risk to Ethereum."}, {"time": 2451, "text": "What is MEV?"}, {"time": 2452, "text": "How important is it to solve MEV?"}, {"time": 2455, "text": "If it's important, what ideas do you have?"}, {"time": 2457, "text": "Sure, how about after this one, we'll also talk about sharding because it's amazing and it's part of you too."}, {"time": 2461, "text": "Yes, we'll return back to sharding which is, we'll return to the big picture of the scaling problem as you mentioned."}, {"time": 2467, "text": "I love this conversation, you know, depth first search instead of breadth first."}, {"time": 2471, "text": "So basically, okay, MEV, minor extractable value, it is not different in Proof of Work and Proof of Stake, right, so like if you want to call it, you know, block proposer extractable value, like it sounds a lot sexy, but you know, we can call it BPEV instead of MEV, who cares?"}, {"time": 2487, "text": "So this is a problem in both Proof of Work and Proof of Stake?"}, {"time": 2490, "text": "Yes, so the basic idea is that if you have the ability to choose which transactions go into a block and in what order, then you have the ability to like take advantage of that position for economic gain and for economic gain in a lot more ways than just collecting transaction fees, right?"}, {"time": 2510, "text": "Like for example, there's decentralized exchanges on chain like Uniswap and like let's say the price of ETH versus USDC was 2,700 the previous block, but then there was a bit of a market drop and now it's 2,680 where you can go on Uniswap and you can just like gobble up the entire part of, you know, the automated order book that's like between 2,700 and 2,680, right?"}, {"time": 2533, "text": "And that's, and then at the same time, you like run a bot and you know, you buy some ETH back at 2,680 and you've just like made about $10 of profit, right?"}, {"time": 2541, "text": "So, or well, $10 times, you know, whatever the depth is."}, {"time": 2545, "text": "Right, so there's lots of little things like that."}, {"time": 2548, "text": "There's also things that involve like front running other people's transactions."}, {"time": 2582, "text": "Then you get to make a little bit of money that way."}, {"time": 2583, "text": "Exactly, so there's a lot of these different like arbitrage, front running, back running, these different tricks that allow block proposers to."}, {"time": 2591, "text": "To get some percentage on top, like overhead."}, {"time": 2623, "text": "Because if you're just collecting transaction fees, there aren't really economies of scale, there aren't really benefits to centralizing, right?"}, {"time": 2629, "text": "Because it's a very simple formula, you just like grab up the transactions that pay you the most."}, {"time": 2633, "text": "But with MEV, there's all these sophisticated algorithms and if you have lots of money, then you can hire really smart people to make amazing algorithms and then you can use the other half of your money to get a lot of mining power or a lot of stake and you get a lot of opportunities to use your even better algorithms."}, {"time": 2649, "text": "So there's this risk that like as a result of this, mining is basically, or even validating proof of stake is going to centralize."}, {"time": 2660, "text": "So I think the ecosystem is best replied to this sort of risk and it's the direction where projects like Flashbots are going already is if you can't eliminate the centralization, then you try to firewall it, right?"}, {"time": 2675, "text": "And the way that you firewall it is you basically say, we're going to try to deliberately create a marketplace where people can just do the complicated work of creating what are called bundles, like bundles of transactions that are very profitable, right?"}, {"time": 2691, "text": "And then at the other side of the market, you just have like block proposes reminders that are just dumb notes."}, {"time": 2697, "text": "And they go and ask the what are called searchers, the bundle creators, and they just ask like, hey, like how much can you give me if I put in your bundle?"}, {"time": 2705, "text": "And then they just take the highest offer, right?"}, {"time": 2707, "text": "So you sort of separate out the task and you have the easy part and then you have the hard part and you have like this special class of actor called a searcher that does the hard part and then the easy part, the people doing the easy part, which is just miners and validators, they kind of just talk to all the different people doing the searching and they just accept the highest bidder."}, {"time": 2727, "text": "So this is also just like an interesting example of like economic design philosophy, right?"}, {"time": 2735, "text": "Like sometimes you can't just like make centralization go away, sometimes it's inevitable, but no, at least you can try to kind of contain it, you can direct it or you can even sort of firewall it away from core consensus, the parts that really do need to be decentralized."}, {"time": 2751, "text": "But you don't see it as an existential risk, it's just a bit of a problem that it has to be constantly dealt with."}, {"time": 2757, "text": "It's a risk, like there's obviously a risk that it's a very severe problem and that even this flash bots approach has some fatal flaw or whatever."}, {"time": 2768, "text": "But we're definitely approaching it with the mindset of this is a problem and like, yes, we do have to do some work to solve it, but we're doing it and so far it's being solved."}, {"time": 2780, "text": "Okay, let's talk about the other really, really fascinating part of the future of Ethereum."}, {"time": 2786, "text": "Let's not call it Ethereum 2.0, but the future of Ethereum that also may require a hard fork, I don't know, you can correct me on this, is well, broadly ideas for scaling."}, {"time": 2800, "text": "And more specifically sort of layer two or layer one and two intersection ideas of how to achieve scaling."}, {"time": 2810, "text": "And at the core of that is the idea of sharding."}, {"time": 2812, "text": "So first, what is sharding?"}, {"time": 2815, "text": "Okay, so there's two major paradigms for scaling blockchains, right?"}, {"time": 2821, "text": "As you said, layer one and layer two."}, {"time": 2823, "text": "And layer one basically means make the blockchain itself capable of processing more transactions by having some mechanism by which it can do that despite the fact that there's a limit to the capacity of each participant in the blockchain."}, {"time": 2838, "text": "And then layer two says, well, we're gonna keep the blockchain as is, but we're gonna create clever protocols that sit on top of the blockchain that still use the blockchain and then still kind of inherit things like the security guarantees of a blockchain."}, {"time": 2851, "text": "But at the same time, a lot of things are done off chain."}, {"time": 2853, "text": "And so you get more scalability that way."}, {"time": 2856, "text": "So in Ethereum, the most popular paradigm for layer two is rollups and the most popular paradigm for layer one is sharding."}, {"time": 2863, "text": "So one way to achieve layer one scaling is to increase the block size."}, {"time": 2868, "text": "Block size wars, quote, unquote."}, {"time": 2871, "text": "And you actually tweeted something about, people are saying that Vitalik changed his mind about, he went from being a small blocker to a big to small."}, {"time": 2885, "text": "But you said, I've been a medium blocker all along."}, {"time": 2889, "text": "So maybe you can also comment on where, on the very basic aspect before we even get to sharding of where you stand on this block size debate."}, {"time": 2898, "text": "So the way that I think about the trade off is I think about it as a trade off between making it easy to write to the blockchain and making it easy to read the blockchain."}, {"time": 2906, "text": "So when I say read, I just mean, have a node and actually verify it and make sure that it's correct and all of those things."}, {"time": 2912, "text": "And then by write, I mean send transactions."}, {"time": 2914, "text": "So I think for decentralization, it's important for both of these tasks to be accessible."}, {"time": 2920, "text": "And I think that they're about equally importance."}, {"time": 2923, "text": "If you have a chain that's too expensive to read, then everyone will just trust a few people to read for them."}, {"time": 2928, "text": "And then those people can change the rules without anyone else's permission."}, {"time": 2931, "text": "But if on the other hand, it becomes really expensive to write, then everyone will move on to basically second layer systems that are incredibly centralized."}, {"time": 2941, "text": "And that takes away from decentralization and self sovereignty as well."}, {"time": 2946, "text": "So this has been my viewpoints pretty much the whole time, right?"}, {"time": 2949, "text": "It's like, you need this balance and going in one direction or the other direction is very unhealthy."}, {"time": 2954, "text": "In the Bitcoin case, basically what happened was that Bitcoin originally, at the very beginning, it didn't really have a block size."}, {"time": 2962, "text": "It just had an accidental block size of 32 meg, or block size limit of 32 megabytes because that just happens to be the limit of the peer to peer messages."}, {"time": 2971, "text": "But then..."}, {"time": 2972, "text": "Interesting, I didn't even know that part."}, {"time": 2973, "text": "Yeah, but then Satoshi back in 2010 was worried that even 32 megabyte blocks would be too hard to process."}, {"time": 2979, "text": "So he put the limit down to one megabyte."}, {"time": 2982, "text": "And I think the..."}, {"time": 2984, "text": "I put, you mean sneaked in there."}, {"time": 2987, "text": "Yeah, just like made an update to the Bitcoin software that made blocks bigger than one, I think it's a million bytes invalid."}, {"time": 2994, "text": "And I think the impression that most people had at the time is that this is just a temporary safety measure."}, {"time": 3001, "text": "And over time, as we become more confident in the software, that limit would be raised somewhat."}, {"time": 3010, "text": "But then when the actual usage of the blockchain started going up, and then it started going up first to 100 kilobytes per block, then to 250 kilobytes per block, then to 500 kilobytes per block, there started coming out of the woodworks this opinion that no, that limit should just not be increased."}, {"time": 3031, "text": "And then there are all of these attempts at compromising."}, {"time": 3036, "text": "First, there was a proposal for 20 megabyte blocks."}, {"time": 3040, "text": "Then there was the 248 proposal, which is a bit ironic because the 248 proposal started off being a small block negotiating position."}, {"time": 3049, "text": "But then when the big block people came back and said, hey, aren't we gonna do this?"}, {"time": 3053, "text": "They're like, oh, no, no, no, we don't want them."}, {"time": 3055, "text": "We don't want the block size increases anymore."}, {"time": 3057, "text": "So there were these two different positions, the small blockers."}, {"time": 3062, "text": "I think they valued one megabyte blocks for two reasons."}, {"time": 3066, "text": "One is that they just really, really believe in the importance of being able to read the chain."}, {"time": 3070, "text": "But two is that a lot of them really believe in maintaining this norm of never hard forking, right?"}, {"time": 3078, "text": "So the difference between a hard fork and a soft fork is basically that in a soft fork, any block that's valid under the new rules was still valid under the old rules."}, {"time": 3090, "text": "So if you have a client that verifies according to the old rules, then you'll still be able to accept the chain that follows the new rules."}, {"time": 3097, "text": "Whereas with a hard fork, you have to update your code in order to stay on the chain."}, {"time": 3103, "text": "And look, they have this belief that soft forks are kind of either less coercive than hard forks, which by the way, I completely disagree with."}, {"time": 3113, "text": "I actually think soft forks are more coercive because basically they force everyone who disagrees to sort of go along by default."}, {"time": 3119, "text": "But, or they have this opinion that there's like, it's more difficult to abuse soft forks to do really mean things like, or that like completely violate people's expectations, like increasing the supply, which is like, I think there is some truth to that."}, {"time": 3138, "text": "So because of these reasons, they just say we're only going to do soft forks and we want to just not do any hard forks."}, {"time": 3145, "text": "And they eventually discovered this idea called segregated witness that allows for like a very tiny block size increase to like the equivalent of about two megabytes with a soft fork."}, {"time": 3156, "text": "It's this really like weird and devious trick."}, {"time": 3161, "text": "Like basically what they do is they take the signatures of transactions and then they put them outside of the block."}, {"time": 3168, "text": "And then they add an extra rule that says that like every, for a block to be valid, the block has to come with a separate, like basically extension block that contains all of the transaction signatures, right?"}, {"time": 3178, "text": "So when you measure it, according to the old rules, like, hey, it adds up to less than a million, but actually there's this extension block that the old protocol doesn't even know about."}, {"time": 3187, "text": "It's a hack that seemed to work to in a small way extend the size of the block size."}, {"time": 3192, "text": "So the small block side was like happy with these very low levels of block size."}, {"time": 3196, "text": "And then the big block side wanted to expand to, at the very least go to four megabytes, then maybe go maybe eight, 20."}, {"time": 3203, "text": "There's disagreements within there as well."}, {"time": 3206, "text": "I definitely was favoring the big side the whole way through, as you can probably tell, but."}, {"time": 3213, "text": "Even though, so the argument against the big is that it makes things more centralized."}, {"time": 3220, "text": "Yes, because fewer people can run a note that verifies the chain."}, {"time": 3224, "text": "And also because any of these things would require a hard fork and hard forks are inherently risky."}, {"time": 3229, "text": "Do you think there's truth to that?"}, {"time": 3231, "text": "I'm pro hard fork."}, {"time": 3232, "text": "I think hard forks are actually like in a political economic sense, they're better than soft forks."}, {"time": 3239, "text": "Well, let's, okay, okay."}, {"time": 3240, "text": "I think that's a beautiful principle as stated that soft forks may be more coercive than hard forks."}, {"time": 3250, "text": "This is not just about cryptocurrency."}, {"time": 3253, "text": "This is about politics and life."}, {"time": 3257, "text": "So you're okay with hard forks."}, {"time": 3260, "text": "In fact, you think hard forks is the right way to make changes because then everybody's forced to make a decision."}, {"time": 3267, "text": "Do you accept this change or not as opposed to ideas being sneaked in behind the door and that decision is forced on you?"}, {"time": 3276, "text": "Okay, so, but hard forks, some people say, this is when they talk about sort of Ethereum, is there's some aspect to a hard fork where you're trying to upgrade a, what is it, airplane while it's flying."}, {"time": 3290, "text": "I think soft forks are also upgrading an airplane while it's flying."}, {"time": 3293, "text": "But it's a smaller upgrades."}, {"time": 3296, "text": "That's, there's some truth to that."}, {"time": 3298, "text": "Like there's definitely a bit more risk of like a split as a result of a hard fork than as a result of a soft fork."}, {"time": 3307, "text": "And the split is highly undesirable, right?"}, {"time": 3310, "text": "Well, it depends."}, {"time": 3311, "text": "Like if it's a split because of a bug, then that's horrible."}, {"time": 3314, "text": "If it's a split as a result of political differences, then I think like a split is better than, you know, one side being forced to basically just like suck it up and accept the majority position even if it really hates it."}, {"time": 3327, "text": "Well, there's also political connections throughout the history of the United States."}, {"time": 3330, "text": "It's like sometimes groups of people that strongly disagree with each other should be forced to work it out."}, {"time": 3338, "text": "Even if they, even when a split seems like an easy thing in the short term."}, {"time": 3343, "text": "And I think like, well, for blockchains in particular, the costs of people being able to like peacefully do their, go off and do their own thing are much lower, right?"}, {"time": 3352, "text": "Like, you know, okay, if you have a country and you have two groups, then like often enough, like fighting out the new rules requires, you know, a civil war requires everyone to move and so forth."}, {"time": 3363, "text": "But no, on a blockchain, like, you know, the costs are lower and so."}, {"time": 3367, "text": "So if you were to look at the way things worked out with the block size wars and there was a split, what is it, Bitcoin Cash and all this?"}, {"time": 3375, "text": "In Bitcoin."}, {"time": 3377, "text": "Would you, like you looking, putting on your historian hat, you mentioned offline you like Dan Carlin."}, {"time": 3383, "text": "So if Dan Carlin wanted to do an episode on the block size wars, do you think it could've turned out better or do you, are you okay with the way it turned out?"}, {"time": 3397, "text": "I'm definitely disappointed with what happens with the block, with the big block side."}, {"time": 3404, "text": "I think the source of my disappointment is that like, one of the things that you notice when just looking at like this political disagreements generally, especially when you have environments where, you know, they're authoritarian or like single party dominated and then there's some opposition party and the opposition often has like very legitimate grievances."}, {"time": 3423, "text": "But at the same time, the thing you notice is that often enough the opposition just sucks, right?"}, {"time": 3427, "text": "Like it just doesn't have, you know, political capacity."}, {"time": 3430, "text": "It doesn't have like the ability to come up with policy because it's entire culture is like designed around resisting much more than it's designed around like, you know, actually debating serious policy trade offs."}, {"time": 3443, "text": "And I worry or I guess not so much worry because it's already happened."}, {"time": 3448, "text": "I unfortunately think that Bitcoin Cash ended up being a victim of this, right?"}, {"time": 3454, "text": "Like first, no, there was a split with Bitcoin Cash."}, {"time": 3457, "text": "And then of course, Craig Wright came in and you know, Craig Wright was this basically scammer who just keeps on pretending that he is Satoshi Nakamoto, the inventor of Bitcoin."}, {"time": 3467, "text": "Hey, Craig Wright's legal team, do you hear me?"}, {"time": 3469, "text": "Yes, I still think your client is a scammer."}, {"time": 3472, "text": "So sue me."}, {"time": 3473, "text": "This is definitely gonna be death for a search because I gotta ask you about Craig."}, {"time": 3476, "text": "I guess these people have been contacting me and I'm trying to figure out like, what is up with this human being?"}, {"time": 3482, "text": "So for people who don't know, there's somebody who is, let's start this Satoshi Nakamoto, who is the creator of Bitcoin, who's anonymous."}, {"time": 3491, "text": "And actually most really big people in the cryptocurrency space do not like yourself and others do not dare claim that they are even for fun Satoshi Nakamoto."}, {"time": 3505, "text": "In fact, if Satoshi Nakamoto is still alive and is like, if say you were Satoshi Nakamoto, it seems like the thing he would do is probably or she is trying to remain anonymous."}, {"time": 3515, "text": "On the flip side of that, there's a guy named Craig Wright who continually keeps claiming that he is in fact Satoshi Nakamoto and keeps suing a lot of people."}, {"time": 3525, "text": "So on him, if we could just linger on him, what do you make of this character?"}, {"time": 3532, "text": "What are we supposed to make of this character?"}, {"time": 3534, "text": "Should he be ignored?"}, {"time": 3536, "text": "Is there any possible truth to his claims?"}, {"time": 3541, "text": "The analogy that's at the top of my head will get a bit political, but that's fine."}, {"time": 3546, "text": "You've had Michael Malice."}, {"time": 3547, "text": "So I guess I view Craig Wright as being kind of like a Donald Trump figure in that he's not very intellectual, but I think he gets a big audience because he says things that play to the resentments that people have and he says things that people wants to hear."}, {"time": 3567, "text": "Like in the wake of this block size war, the big blockers did feel very disenchanted."}, {"time": 3572, "text": "They felt that Bitcoin always had this vision that we were supposed to just keep increasing the block size and Bitcoin is peer to peer cash."}, {"time": 3579, "text": "It says so in the white paper."}, {"time": 3580, "text": "And then this elitist clique of core devs just came in and said, no, no, no, we're gonna impose this totally different vision."}, {"time": 3587, "text": "And if you ever want your scalability, you'll have to wait for us to create this totally unproven fancy technology called the lightning network that works under completely different principles."}, {"time": 3596, "text": "And they were very angry at this."}, {"time": 3598, "text": "And I mean, I think a lot of that anger is justified, but at the same time, when people are in that mental state, like it's very easy for you to just kind of like latch on."}, {"time": 3610, "text": "And if you find someone who expresses anger at the same things that you're angry at, and also like it seems like someone who's strong and seems like someone who might be good to rally around, it's very easy to just like get behind that."}, {"time": 3624, "text": "But that extra part about it where he's Satoshi Nakamura, I don't understand why that's necessary."}, {"time": 3629, "text": "I think that's, he could have done it without that, but that just, it's a marketing strategy."}, {"time": 3636, "text": "Like it sort of gives him more salience."}, {"time": 3638, "text": "Like there's other big block personalities, right?"}, {"time": 3640, "text": "Well, what's the difference with Craig Wright?"}, {"time": 3643, "text": "He's not just a big block personality, he's potentially Satoshi."}, {"time": 3648, "text": "And he did say all the big block things, right?"}, {"time": 3652, "text": "Like he talked about how, oh, the concept of a fee market is fundamentally like economically wrong and it should be a free market and you should be able to have blocks as big as you want."}, {"time": 3662, "text": "So like he repeated all the talking points."}, {"time": 3663, "text": "And so a lot of people were kind of sucked into that, right?"}, {"time": 3667, "text": "And so he unfortunately was able to basically dominate a big part of the Bitcoin cash community for a long time."}, {"time": 3675, "text": "And then eventually, of course, more and more people started to catch on."}, {"time": 3680, "text": "He would just say technical things that are completely wrong, right?"}, {"time": 3684, "text": "Like one example of this that I remember is that he mixed up the concept of 256 bits and two to the power of 256 bits, right?"}, {"time": 3696, "text": "So the difference is, it's like the difference between 80 and the concept of 80 digit numbers, right?"}, {"time": 3702, "text": "And because of this, like he made this arguments that said that Bitcoin's elliptic curve is friendly to cryptographic pairings."}, {"time": 3712, "text": "Like you don't have to understand what that is, but if you want to know, I have articles on both at Vitalik.ca."}, {"time": 3718, "text": "But basically he made this like technical argument that really hedged on this point."}, {"time": 3723, "text": "And then when people pressed him on, it was like, yes, but no, no, like what?"}, {"time": 3726, "text": "Look, exactly, the height is like what?"}, {"time": 3729, "text": "Two to the 256 bits."}, {"time": 3731, "text": "That's a very tiny amount of information."}, {"time": 3734, "text": "No, no, no, no, two to the 256 bits is more than the amount of information in the universe."}, {"time": 3739, "text": "And like he equivocated and kind of like preyed on people's inability to understand that mathematical nuance."}, {"time": 3746, "text": "And I called him out."}, {"time": 3747, "text": "And eventually I even called him out in person at this conference in Seoul."}, {"time": 3751, "text": "Like I just stood up and asked, hey, conference organizer, why are you letting this fraud speak at this conference?"}, {"time": 3759, "text": "And I remember even some big blockers at the time getting angry at me."}, {"time": 3764, "text": "But eventually they did get rid of him."}, {"time": 3767, "text": "And then Craig, well, basically Craig Wright was forced to split off because the rest of the community refused to accept some network change that he wanted."}, {"time": 3776, "text": "And so then there was the BCH and BSP."}, {"time": 3779, "text": "And then in the Bitcoin Cash community, there was this drama of, are they going to add a developer fund where they redirect 12 and a half percent of the revenue from the miners to the devs?"}, {"time": 3788, "text": "And according to the libertarian not aggression principle, is this technically theft?"}, {"time": 3792, "text": "Like his understanding of the technical depths of cryptocurrency was lacking in a way that Satoshi Nakamoto certainly would not."}, {"time": 3804, "text": "But the point is that even after Craig Wright got expunged, the Bitcoin Cash community kept having these disagreements."}, {"time": 3810, "text": "And now after this development funds dispute, there was a further split between Bitcoin Cash and ABC."}, {"time": 3817, "text": "So the branch continues to extend."}, {"time": 3821, "text": "So in that way, it's disappointing to see those kinds of splitting that was never resolved."}, {"time": 3827, "text": "I would have definitely like wanted to see more of a kind of like the principled coin with like tries to be Bitcoin, but follows consistent big block values."}, {"time": 3839, "text": "But I know maybe I should just like stop expecting projects that I have no involvement in to care at all about what my values are."}, {"time": 3847, "text": "And like maybe Ethereum just like is."}, {"time": 3849, "text": "I think you have a powerful voice and you can inspire other projects to live up to their best possible selves."}, {"time": 3859, "text": "Okay, so that's the layer one approach."}, {"time": 3865, "text": "The other layer one within Ethereum is the idea of sharding."}, {"time": 3870, "text": "What the heck is sharding?"}, {"time": 3872, "text": "What does the future of sharding look like?"}, {"time": 3873, "text": "Right, so to summarize that big long tangent that we just went into."}, {"time": 3877, "text": "It's a beautiful tangent by the way."}, {"time": 3878, "text": "It's the basic tangent."}, {"time": 3880, "text": "And I think like crypto is just one of the most underrated aspects of crypto is I think how you can like analyze the sociology and the politics and the anthropology."}, {"time": 3889, "text": "And I'm sure Dan Carlin would have fun exploring the space at some point."}, {"time": 3894, "text": "But like the core trade off, right?"}, {"time": 3896, "text": "Is that if you scale blockchains the dumb way just by increasing the parameters, then eventually you just make it harder and harder to participate as a node and you end up with a system where there's like 20 computers running the whole thing."}, {"time": 3907, "text": "And it's just very centralized."}, {"time": 3909, "text": "So sharding basically says, well, instead of just increasing the parameters, what we're going to do is we're going to change the blockchain architecture in such a way that each individual node in the blockchain only needs to store a small portion of the data and only needs to process a small portion of the transactions."}, {"time": 3928, "text": "So you can think about it as being like inspired by BitTorrent, right?"}, {"time": 3931, "text": "Like on BitTorrent, there's no such thing as a BitTorrent full node that has every movie, right?"}, {"time": 3935, "text": "You know, the work is like split up among a huge number of computers and like that makes sense."}, {"time": 3940, "text": "That's, you know, the only sane way to scale a system like that."}, {"time": 3945, "text": "And if they actually tried making a version of BitTorrent that required full nodes that store every movie, then, you know, it would have like zero censorship resistance and it would just like, you know, be dead in an instant."}, {"time": 3956, "text": "So the challenge with taking that model and applying it to blockchains, right?"}, {"time": 3961, "text": "Is that blockchains aren't just about like spreading data around, they're about agreeing on exactly what data was spread around and ensuring that everything that you agree on actually is correct."}, {"time": 3972, "text": "And so you have this paradox where let's say you want to have a system that supports 10,000 transactions a second, but each computer in the network can only personally verify a hundred transactions a second."}, {"time": 3985, "text": "So how can each computer get a guarantee about the other 9,900 without actually going and verifying them themselves?"}, {"time": 3993, "text": "And it turns out that there are some, like a bundle of different tricks that can do that, right?"}, {"time": 4000, "text": "So like one of them is just random sampling."}, {"time": 4003, "text": "So the idea behind random sampling is like, let's say for simplicity, this is a proof of stake chain and you have 10,000 validators, validators are like, you know, the stakers and like for simplicity, we'll assume they all have the same number of coins, right?"}, {"time": 4017, "text": "If someone has more coins, we'll just kind of split them up and pretend they're 10 stakers."}, {"time": 4021, "text": "Then you do like some random shuffling and you basically say, these random hundred validators are assigned to validate this block."}, {"time": 4030, "text": "These random hundred validators are assigned to validate this block."}, {"time": 4036, "text": "And so each individual computer only gets assigned to validate like a small piece, but then the way that the information about like what's valid gets passed around, right?"}, {"time": 4045, "text": "Is that when these hundred participants validate a block, they all sign a message basically saying like, yes, we agree that this block is valid."}, {"time": 4055, "text": "And then like they combine that signature into one and then they broadcast that signature."}, {"time": 4059, "text": "And then everyone else, instead of verifying the blocks directly, just verifies that signature, right?"}, {"time": 4064, "text": "And so if I see the signature, I'm not directly convinced that that block is valid, but what I am convinced of is that out of this committee of this randomly selected group of a hundred validators, let's say at least 70 of them agree that this block is valid."}, {"time": 4079, "text": "And so if I trust that the majority of these participants are all honest, then because it's all randomly selected, the attacker can't just like force themselves into one committee."}, {"time": 4089, "text": "And so the attacker is gonna be evenly spread out too."}, {"time": 4093, "text": "And so if the entire set of validators is mostly honest, every committee is gonna be mostly honest."}, {"time": 4099, "text": "And so like bad blocks are not gonna go through, right?"}, {"time": 4102, "text": "So that's like one simple form of sharding."}, {"time": 4104, "text": "There was also other more clever things that you can do."}, {"time": 4106, "text": "So for example, there's this concept of a ZK snarks, right?"}, {"time": 4109, "text": "I'll call it as your knowledge proofs."}, {"time": 4111, "text": "So this is the idea that you can make a cryptographic proof that says, I verified or I ran some complex computation on this piece of data and I got this answer."}, {"time": 4123, "text": "And so if you make these kinds of proofs, then like if you see a ZK snark that says some block is valid, then you're convinced that that block is valid."}, {"time": 4131, "text": "And even if everyone in that committee is evil, like they have no way of making a valid proof for a bad block, right?"}, {"time": 4139, "text": "Like, because the proof itself, like it is a proof that you did the computation where that proof is much easier to verify than just running the computation yourself."}, {"time": 4148, "text": "And there's once again, super awesome mathematical or cryptographic magic behind making ZK snarks work."}, {"time": 4157, "text": "But it gives you a little bit of a leg up over the 51% honest assumption."}, {"time": 4163, "text": "So it's a little hack that improves upon the random sampling thing."}, {"time": 4167, "text": "And like, there's other hacks, right?"}, {"time": 4168, "text": "Like there is another hack called data availability sampling that allows you to make sure that the data in the blocks was actually published."}, {"time": 4175, "text": "But like, basically, like if you stack a couple of these tricks on top of each other, you can create a system where like I, as an individual participant can be convinced that everything that's going on in this distributed blockchain thing is correct without actually personally checking more than like a percent of it."}, {"time": 4191, "text": "So that's sharding."}, {"time": 4192, "text": "That's sharding."}, {"time": 4192, "text": "But the, as I understand, maybe correct me on this, is in the space of Ethereum, the sharding happens on some fixed number."}, {"time": 4205, "text": "Like the split is on some fixed number."}, {"time": 4207, "text": "I think it's 64 is the currently sort of proposed number."}, {"time": 4211, "text": "So how does that help scaling?"}, {"time": 4215, "text": "Is it just the fixed constant scaling by 64?"}, {"time": 4219, "text": "And is that a way to achieve those crazy, the crazy amount of scaling that seems to be required to use cryptocurrency for purchasing?"}, {"time": 4228, "text": "So doing like competing with credit cards and Visa and so on."}, {"time": 4231, "text": "So first, I think like the 64 can be hard forked up over time."}, {"time": 4235, "text": "So we've set it so that like there's theoretically space in the data structure for 1024 shards, it's just that 64 of them are turned on."}, {"time": 4245, "text": "There are challenges with having more shards because like you have to have logic that just like checks and manages all of those shards."}, {"time": 4251, "text": "And if there's too many of them, then that becomes too expensive."}, {"time": 4254, "text": "But even still, you can improve quite a bit."}, {"time": 4257, "text": "And then the other thing that we're doing is if what we're getting maximum scalability by combining rollups and sharding."}, {"time": 4265, "text": "So this might be a good time to talk about rollups."}, {"time": 4267, "text": "What are rollups?"}, {"time": 4269, "text": "Now we're moving into layer two ideas."}, {"time": 4272, "text": "So the idea behind a rollup is basically that, so instead of just publishing transactions directly on chain and having everyone do all of the checking of those transactions, what you do is you create a system where users send their transactions to some central party called an aggregator."}, {"time": 4297, "text": "And like, well, theoretically, you can have a system where like the aggregator switches around or where anyone can be an aggregator."}, {"time": 4303, "text": "So it's still like permissionless to send things."}, {"time": 4306, "text": "Then what the aggregator does is they strip out all of the transaction data that like is not relevant to helping people update the state."}, {"time": 4317, "text": "So when I say the state, this is a very important kind of technical term for blockchains."}, {"time": 4321, "text": "I mean, like account balances, code, like things that are like memory, internal memory of smart contracts, like basically everything the blockchain actually has to keep track of and remember, right?"}, {"time": 4334, "text": "So you just put in, you take all these transactions, strip out all the data that's not relevant to telling people how to update the state."}, {"time": 4344, "text": "And then you take the data that's needed to update the state, and then you like really compress it, right?"}, {"time": 4349, "text": "So like, for example, if we say, I, Vitalik, have an account that's 0xAB58, blah, blah, blah, blah, blah, and it's 20 bytes."}, {"time": 4357, "text": "Well, instead we can say, well, I have an account that is number 1874224 in the tree."}, {"time": 4364, "text": "And that goes down from 20 bytes to just like an index and a position, which is three bytes, right?"}, {"time": 4369, "text": "So you use all sorts of these fancy compression tricks, and you basically just, instead of publishing all these transactions, you publish this like tiny compressed blob, right?"}, {"time": 4378, "text": "So the amount of data that goes on chain goes down by maybe about a factor of 10, right?"}, {"time": 4382, "text": "And then the second thing is that you don't do the computation on chain, instead you do the computation off chain, and there's one of two ways to do this, right?"}, {"time": 4391, "text": "One is called a ZK rollup, which is you just provide a ZK SNARK that basically says, hey, look, I did this computation, and I have this proof that here's, you know, some hash of the result and it's correct."}, {"time": 4403, "text": "And then you stick it on chain, and everyone verifies this one proof instead of verifying all these transactions."}, {"time": 4409, "text": "And then the other approach is called an optimistic rollup, which is basically made of the scheme where, like, first someone says like, hey, this is what I think the result of applying these transactions is."}, {"time": 4420, "text": "And then someone else can say, I disagree, the result is different."}, {"time": 4423, "text": "And only if two people disagree, do you actually just like publish all of the data and run that whole block on chain."}, {"time": 4432, "text": "So if there's disagreements, then you just like run everything on chain and whoever was wrong, like loses a lot of money, right?"}, {"time": 4438, "text": "So like disagreements are very rare and they're very expensive."}, {"time": 4441, "text": "And then a ZK rollup, you don't even rely on this like challenging game at all, you just rely on a proof."}, {"time": 4446, "text": "So the core principle is basically that instead of lots of transactions and everyone verifies every transaction, it is you take the transactions, you strip them down and compress them as much as possible, then stick that on the blockchain."}, {"time": 4462, "text": "You do need to stick something on the blockchain just so that everyone else can like keep up to date with the state so they know what all the contracts are, what all the balances are and all of this, but it's a very small amount of data."}, {"time": 4473, "text": "And then you use one of these other off chain games, could be this optimistic game, could be a ZK snark to just prove that somebody out there did the computation and the result is correct, right?"}, {"time": 4484, "text": "So you're pushing like 90% of the work off chain and then, well, 90% of the data and 99% of the computation off chain, and then you still have 10% of the data and 1% of the computation on chain."}, {"time": 4496, "text": "And so your scalability goes up by a factor of about 100."}, {"time": 4499, "text": "So these systems are already alive for some applications, right?"}, {"time": 4505, "text": "So there's something called loopering, which is just a ZK roll up for payments, right?"}, {"time": 4510, "text": "So you can have assets inside of the loopering system and you can go around and transfer them, and you get like much lower transaction fees, right?"}, {"time": 4524, "text": "Like instead of $5, you'd have to pay like less than 5 cents."}, {"time": 4528, "text": "But the only problem is that this only supports a couple of applications right now, like making one that supports anything that you can do on Ethereum just takes a bit more work, but that's being done as well, right?"}, {"time": 4540, "text": "So like within a few months, I'm expecting fully Ethereum capable roll ups to be available as well."}, {"time": 4548, "text": "So roll ups, just summarizing, do most of the work off chain, put only a little bit on chain, factor of 100 scaling, sharding, another factor of 100 scaling, 100 times 100 factor of 10,000, hundreds of thousands of transactions a second, and like, you know, there's your scalability."}, {"time": 4564, "text": "Okay, so you achieve scalability, you can do a large number of transactions very quickly and the cost of doing those transactions are much lower."}, {"time": 4571, "text": "You wrote that in the long term ZK roll ups are going to win in terms of layer two technology."}, {"time": 4578, "text": "Specifically you wrote, in general, my own view is that in the short term, optimistic roll ups, as you were saying, are likely to win out of general purpose EVM computation and ZK roll ups are likely to win out for simple payments, exchange and other application specific use cases, just as you were saying."}, {"time": 4599, "text": "But in the medium to long term, ZK roll ups will win out in all use cases as ZK SNARK technology improves."}, {"time": 4609, "text": "Why do you think ZK roll ups are going to win the big picture battle over layer two technologies?"}, {"time": 4615, "text": "So I think ZK roll ups, like once you accept that the technology works are just like conceptually simpler and they have nicer properties."}, {"time": 4624, "text": "The reason is that they do not have this concept of a challenge game, right?"}, {"time": 4628, "text": "Like, as I mentioned in an optimistic roll up, the way that you ensure that the results are correct is that you let one person submit and like they just submit with no proof."}, {"time": 4636, "text": "They just say, here's what I think the result is."}, {"time": 4638, "text": "And then if someone else disagrees, they make their own submission."}, {"time": 4642, "text": "And then if you have two disagreeing submissions, then you actually publish it on Chase."}, {"time": 4645, "text": "And then you see who's right."}, {"time": 4647, "text": "But for this to work, like you need to actually wait for someone to disagree, right?"}, {"time": 4652, "text": "So like, for example, if I have an asset inside of an optimistic roll up and I wants to withdraw it, then I actually have to wait a week to withdraw it."}, {"time": 4658, "text": "Because like, if the block that contains my withdrawal turned out to be invalid, then there needs to be space for someone to disagree with it, right?"}, {"time": 4667, "text": "Whereas with a ZK roll up, like you don't need time for disagreeing because you just have a proof, right?"}, {"time": 4671, "text": "As soon as a block is submitted, there's a proof and you know it's correct."}, {"time": 4675, "text": "So if disagreements, especially in the longterm are sparse, then you don't want to do the optimistic, the game theoretic thing, you wanna do the ZK stock."}, {"time": 4685, "text": "Right, the ZK stuff is just, like you can win a ZK roll up, you can withdraw immediately."}, {"time": 4691, "text": "You don't have to like worry about the economics of proving as much, right?"}, {"time": 4695, "text": "There's just like fewer issues."}, {"time": 4698, "text": "The reason why ZK roll ups are not winning everywhere today is because ZK stocks are still a crazy new technology, right, like this is something that 10 years ago, it existed only in theory and there was none in practice."}, {"time": 4711, "text": "Then, eight years ago, people were just getting excited about it in Bitcoin conferences for the first time."}, {"time": 4717, "text": "Like four years, starting four years ago or three and a half years ago even, that was the first time you were able to make any ZK stock based anything on Ethereum."}, {"time": 4726, "text": "And then people started making them and ZK technology has only really become efficient enough to do a lot of things within the past maybe one and a half years."}, {"time": 4735, "text": "So it's new technology, it's crazy technology, it's admittedly scary technology."}, {"time": 4742, "text": "If you wanna learn more, I also have an article about this on Vitality.ca."}, {"time": 4746, "text": "It's actually really, really good."}, {"time": 4747, "text": "You're, most of your writing, it goes, it's technical but it's accessible."}, {"time": 4754, "text": "I highly, highly recommend to check out Vitality's articles and blogs, whatever you call them on the website."}, {"time": 4760, "text": "It's brilliant summary of the work."}, {"time": 4762, "text": "Actually, Ethereum documentation period is really good."}, {"time": 4765, "text": "I think that's somewhat crowdsourced."}, {"time": 4768, "text": "That documentation is really, really accessible and brilliant."}, {"time": 4772, "text": "But let me ask about sort of other approaches to layer two, like side chains."}, {"time": 4779, "text": "So the one popular one is Polygon."}, {"time": 4782, "text": "What are your thoughts about Polygon, which is a layer two network?"}, {"time": 4788, "text": "Is it positive?"}, {"time": 4789, "text": "Is it negative for Ethereum?"}, {"time": 4792, "text": "Does it have a future?"}, {"time": 4793, "text": "Which is its own chain, but it's using Ethereum."}, {"time": 4798, "text": "It's like based on Ethereum essentially."}, {"time": 4800, "text": "Or maybe you can describe what it is."}, {"time": 4802, "text": "So I think there's a really big and important difference in security models between rollups and side chains, which is basically that rollups inherit from the security of Ethereum, right?"}, {"time": 4813, "text": "So if I have coins inside of Loopring or Optimism or Arbitrum or ZK Sync, then even if everyone else in the world who is participating in these ecosystems hates me and wants to steal my money, I can still personally make sure that no matter what happens, I get my money out."}, {"time": 4833, "text": "It might be a bit expensive for me to get my money out and I have to do transactions on the main chain, but I'll be able to do it."}, {"time": 4839, "text": "Whereas in Polygon, which is a side chain, and so instead of being secured by Ethereum, it's also in part secured by its own proof of stake consensus with its own token."}, {"time": 4850, "text": "So if 70% of the whole, or even 51% of the holders of Polygon tokens wanted to take my money in Polygon, they can, right?"}, {"time": 4859, "text": "So that's the, and like, to be fair, like there aren't even, like the supply, I don't think is even that widely distributed, right?"}, {"time": 4868, "text": "So like potentially you could, this idea of 51% of the token holders coming together and stealing everything, like it's not impossible, right?"}, {"time": 4879, "text": "Where does the scaling of Polygon come from?"}, {"time": 4881, "text": "Like why is it able to process much more transactions than the Ethereum main chain?"}, {"time": 4888, "text": "What's the idea there?"}, {"time": 4889, "text": "I think in part, like I imagine, I'm not sure exactly what its capacity level is, but like I imagine it has a higher capacity because it's a bit more willing to take centralization trade offs."}, {"time": 4900, "text": "And then another thing is that like, if the Ethereum ecosystem, like even if it did not do that, right?"}, {"time": 4906, "text": "If you think about an Ethereum ecosystem hypothetically scaling with side chains, then you would have a hundred copies of Polygon and they would each have their own tokens, they would each have their own chains."}, {"time": 4915, "text": "And so even if each one of those chains was only as scalable as Ethereum, you could still, like the total sum of them would still be a hundred times more than Ethereum."}, {"time": 4927, "text": "The thing that I want to say in Polygon's favor just to be very fair to them, like I really, you know, I definitely really, you know, respect the work that they're doing."}, {"time": 4936, "text": "So, you know, start with a bit with that word of not criticism caution, right?"}, {"time": 4943, "text": "Like it's that they made this kind of deliberate trade off for very pragmatic reasons, which is that the Ethereum ecosystem needs to scale now."}, {"time": 4953, "text": "And there are applications that want to do something now."}, {"time": 4955, "text": "And, you know, if there aren't Ethereum friendly options for them, then like, they're not going to just wait peacefully and do nothing for 12 months."}, {"time": 4962, "text": "And they're going to go to, you know, either Binance Smart Chain or, you know, one of some other system or potentially something that just has totally no alignment with Ethereum values whatsoever."}, {"time": 4975, "text": "But whereas, you know, with Polygon, like the best thing that you can say in Polygon's favor and against optimism is that, you know, optimism is not live and Polygon is live, right?"}, {"time": 4985, "text": "Like it just takes more work to create a system that has these extra rollups, security features."}, {"time": 4992, "text": "And so Polygon just said, we're going to be the system that makes the pragmatic trade off."}, {"time": 4996, "text": "We're going to go, you know, functionality first, and then, you know, we can talk about adding back the security later."}, {"time": 5002, "text": "So I've talked to them and like, in principle, I think they're very, you know, open to the idea of like adding more security and like becoming more, becoming a rollup or at least, you know, adding a Polygon chain that's a rollup at some point in the future, which is definitely something I think they, you know, absolutely should follow through on."}, {"time": 5024, "text": "But like the fact that like they exist now, and so, you know, applications can kind of bootstrap now on a chain that, you know, even though its security isn't perfect, at least it exists and people can go use it."}, {"time": 5035, "text": "And then over time, you know, the chain matures as the applications mature."}, {"time": 5040, "text": "Like, you know, it's, I think a very reasonable strategy and I'm definitely really happy that they're part of the ecosystem."}, {"time": 5048, "text": "Yeah, it's kind of interesting."}, {"time": 5049, "text": "The history of cryptocurrency has this tension of really good ideas that are hard to implement."}, {"time": 5057, "text": "So they take longer to implement and ideas that are not as good, but are faster to implement."}, {"time": 5063, "text": "This is like the story of like, you have like JavaScript that basically took over the world because it was quick to implement within 10 days."}, {"time": 5071, "text": "And then like later kept fixing itself."}, {"time": 5077, "text": "Sort of from an engineering perspective, I'm more and more becoming comfortable and accepting the fact that our whole world will run a technology that's not as good as it could have been."}, {"time": 5088, "text": "Just because the crappy solution is faster to implement and it sticks."}, {"time": 5095, "text": "I think the compromise that we've been taking within Ethereum is like when we have to take the crappy solution, we look for crappy solutions that are forward compatible with becoming good over time."}, {"time": 5107, "text": "When you build the quick and dirty thing, you would still already have ideas in your head about what the more complete thing with all the security features added on would look like."}, {"time": 5118, "text": "Even if it requires a hard fork?"}, {"time": 5123, "text": "For example, with sharding, I think it's likely that the first version of sharding that comes out is not going to have zkstarks and data availability sampling, for example."}, {"time": 5132, "text": "But we know what these technologies are."}, {"time": 5134, "text": "We feel like we have wrapped our heads around them."}, {"time": 5137, "text": "And so we know how to build a system where we can put all the pieces in place so that it becomes very easy to bolt those components on in the future."}, {"time": 5146, "text": "So if you do things that way, then at the beginning, you can have your system that has the functionality, but say has less security or less sustainability or less of something else."}, {"time": 5158, "text": "But then over time, it's designed in such a way that it has this easy on ramp to adding those things."}, {"time": 5165, "text": "And if you don't think explicitly about being future compatible, then you do often end up with a quick and dirty solution that backs you into a corner."}, {"time": 5174, "text": "And then there are definitely cases where I think the Ethereum ecosystem has suffered from that."}, {"time": 5178, "text": "And we have had to expand pretty significant effort on, for example, removing features that we didn't realize that we actually can't sustain."}, {"time": 5189, "text": "Like one big example is just increasing the gas costs."}, {"time": 5192, "text": "So like making some operations more expensive because they should be expensive because they actually take a lot of time in the process."}, {"time": 5200, "text": "So that's making something more expensive, kind of like taking some functionality away."}, {"time": 5206, "text": "So if you can like be cognizant of where you're likely going into the future, and if you don't know, like even be cognizant of both the most likely paths that you'll take in the future and coming, like thinking about your roadmap and coming up with a roadmap where you know that like if you wants to do either of those things, then you have a clean path toward it."}, {"time": 5226, "text": "That's probably the best kind of practical way to get the best of both worlds that we have."}, {"time": 5232, "text": "Okay, let's talk about this wonderful process of merging."}, {"time": 5239, "text": "Okay, so there's the main net, which is the Ethereum 1.0 chain, or the, what should we say, the chain that uses proof of work as a consensus mechanism."}, {"time": 5250, "text": "And then there's, what is it called?"}, {"time": 5253, "text": "The beacon chain that uses the proof of stake mechanism."}, {"time": 5260, "text": "And I believe the beacon has been deployed successfully, is working, so that was in December of 2020."}, {"time": 5269, "text": "There's a bunch of questions around that that's fascinating as well, but I think the most fascinating question is about merging those two."}, {"time": 5278, "text": "When do the two chains, one that's proof of work, one that's proof of stake, merge?"}, {"time": 5286, "text": "And what are the most difficult parts of this process?"}, {"time": 5290, "text": "Right, so as you've said, right, the way that we have set up this proof of stake transition is that at first, the proof of stake chain just launches on its own, right?"}, {"time": 5299, "text": "And this is the thing that happened in December."}, {"time": 5302, "text": "And the proof of stake chain has been running for close to six months now."}, {"time": 5308, "text": "I mean, by the time people watch this, it might actually be six months."}, {"time": 5313, "text": "But it isn't actually coming to consensus on anything except for itself, right?"}, {"time": 5317, "text": "So the idea behind that is to just give the proof of stake chain time to mature, time for people to build the ecosystem around it, time to make sure that there aren't any bugs, and just like prove to the community that no proof of stake actually is real, and a full transition is realistic, because the thing that you're transitioning to already exists and already works."}, {"time": 5339, "text": "And then at some point in the future, you have this event called the merge, where you basically take the activity that's being done inside of the proof of work chain, and you actually move it over into the proof of stake chain, so you get rid of the proof of work side completely."}, {"time": 5353, "text": "So the way that the merge will work is, it's definitely gone through a few different iterations."}, {"time": 5362, "text": "Like the earlier versions of this actually required more work for users and more work for clients."}, {"time": 5367, "text": "It was much more like, oh, there's this new chain, there's this old chain, and then everyone has to migrate from the old chain to the new chain, and then at some point we'll forget about the old chain."}, {"time": 5377, "text": "The new version is designed to be much more seamless for users, right?"}, {"time": 5383, "text": "So basically what actually happens is that the old chain basically becomes embedded inside the new chain, right?"}, {"time": 5390, "text": "So starting from the merge transition block, every proof of stake chain block is going to contain a block of the, what we consider now to be, what we consider to be the Ethereum chain today, but we'll call it the execution chain."}, {"time": 5405, "text": "And then at the same time, to create one of these blocks, you're not going to need proof of work anymore, right?"}, {"time": 5410, "text": "So basically at the same time, you would both get rid of the proof of work requirements for one of these blocks to be valid, but instead you require these blocks to be embedded inside of the proof of stake blocks, right?"}, {"time": 5421, "text": "So you basically have like a chain inside a chain."}, {"time": 5424, "text": "And this is, from an architecture perspective, you might think it's a little bit suboptimal, but it actually has some nice properties and makes it easier to kind of think about the consensus and think about what we call the execution layer, like transactions and contracts kind of separately and upgrade them separately."}, {"time": 5442, "text": "And it also just means that the upgrade process is extremely seamless, right?"}, {"time": 5447, "text": "Because from the point of view of a client that's following the chain, you basically have to update nothing, right?"}, {"time": 5453, "text": "You're still following the same chain and follows the same rules, except instead of checking proof of work, you'll switch to checking that these blocks are embedded inside of blocks of the proof of stake chain."}, {"time": 5463, "text": "So there'll be this merge block that will mark this transition."}, {"time": 5468, "text": "And over time, I guess the new chain will contain the full record of all the transactions that's ever happened on the previous chain, on the old chain."}, {"time": 5477, "text": "So maybe I'm asking a dumb question here, but in this process, is the new chain going to have all the information of the past transactions?"}, {"time": 5489, "text": "The new chain is not going to hold information from what happened in the Ethereum chain before the merge, right, so Ethereum clients that people are going to use around the time of the merge and soon after the merge, they're probably just going to sync and check the proof of work chain up to the merge, and then they're gonna check the proof of stake chain."}, {"time": 5512, "text": "But at some point in the future, I think people will just stop bothering checking the proof of work before the merge."}, {"time": 5517, "text": "Got it, so that old history information is not important for the future, like if you're operating actively on the new chain, that history is not important to you."}, {"time": 5528, "text": "It's not important, so it's not strictly important for just like any smart contract or just like applications that run on the blockchain."}, {"time": 5539, "text": "It can be important to users, and it can be important for some applications, but we're basically saying that like maintaining and serving that is not going to be a simultaneous with the responsibility of every Ethereum node."}, {"time": 5552, "text": "If you want that information, there can be separate protocols for backing it up."}, {"time": 5556, "text": "And like these other protocols actually exist, right?"}, {"time": 5558, "text": "Like there's something called the graph, which is doing some history retrieval."}, {"time": 5562, "text": "Potentially, you can just take that entire chain and stake it on BitTorrent."}, {"time": 5565, "text": "Like there's lots of ways to like archive it and create kind of customized search protocols for it."}, {"time": 5571, "text": "So what's your sense why, so there's a Python 2 and Python 3, and it took forever for people to switch."}, {"time": 5578, "text": "What's your sense why this merge has been taking longer than perhaps was expected?"}, {"time": 5585, "text": "I think the biggest reason is just we've been underestimating the technical complexity."}, {"time": 5591, "text": "There's a lot of technical complexity in making a successful proof of stake chain."}, {"time": 5594, "text": "There's a lot of technical complexity in actually figuring out the transition process."}, {"time": 5602, "text": "So that's bigger than social complexity."}, {"time": 5604, "text": "So the technical complexity you would say is the bigger reason for any delays than the social complexity?"}, {"time": 5611, "text": "I actually think so."}, {"time": 5612, "text": "I think we've been very fortunate to not have too much social complexity around the merge."}, {"time": 5617, "text": "So not much drama."}, {"time": 5620, "text": "I think the biggest part of the reason is just because we have been talking about proof of stake and sharding as being part of the roadmap since almost the very beginning of the project, right?"}, {"time": 5629, "text": "Like the very first proof of stake blog post is from January 2014, which was two months after the project started and maybe even a day after the announcement."}, {"time": 5641, "text": "So proof of stake was not something that we kind of put on anybody by surprise."}, {"time": 5649, "text": "And then when the Dow fork happened and the people on the ETC side split off, I think it also just happens that a lot of the people that were not willing to stomach the Dow fork and then join the ETC side, they were the more Bitcoiny types."}, {"time": 5663, "text": "And the more Bitcoiny types do also tend to like proof of work more."}, {"time": 5666, "text": "And so like that also sort of ended up, sort of like purifying the communities on both sides, I guess."}, {"time": 5673, "text": "So Ethereum Classic is not switching to proof of stake and they're happy with their setup."}, {"time": 5678, "text": "And by the time that it came to the beacon chain launching into now, I think the community is very strongly in favor of the proof of stake switch."}, {"time": 5690, "text": "But let me ask the question that no engineer wants to hear, which is the question of timeline."}, {"time": 5700, "text": "When do you think the merge will happen?"}, {"time": 5703, "text": "Do you have a sense it might happen this year?"}, {"time": 5706, "text": "Do you have a sense it might be pushed towards next year, 2022 or even beyond?"}, {"time": 5714, "text": "I think early 2022 is the most realistic."}, {"time": 5720, "text": "There's definitely still like an optimistic case of it happening this year, but the realistic thing to count on is definitely the very early part of next year."}, {"time": 5731, "text": "Is there specific things that stand out to you that will make you feel good about progress if you see it happening?"}, {"time": 5740, "text": "So the thing that we had last month is we had this online hackathon called Rayanism, where basically a bunch of the different client developers that are going to be part of the transition, like hacks together some test nets of the post merge Ethereum chain."}, {"time": 5757, "text": "So these were only test nets of what would happen after the merge."}, {"time": 5761, "text": "They were not test nets of the transition itself."}, {"time": 5763, "text": "So the thing that people are working on now actually is the transition."}, {"time": 5768, "text": "So having a full specification of both the transition and post transition, and we have specifications now, but in a realistic way, they'll probably needs to have a couple of changes and have things that continue to be ironed out, and then have a test net that does both the transition and the post transition."}, {"time": 5787, "text": "And then once you have a test network, then you just have to do a lot of testing and audit it, and then do some runs on not just a specialized test network but on say an existing test network like a Robson or Rinkeby that Ethereum people already significantly use."}, {"time": 5805, "text": "And if it works, then you can deploy the transition on mainnet."}, {"time": 5809, "text": "Just as a quick comment, because this is fascinating."}, {"time": 5812, "text": "In August of last year, there was this Medalla."}, {"time": 5817, "text": "I believe it's pronounced Medasha."}, {"time": 5819, "text": "It's a South American subway station."}, {"time": 5822, "text": "I forget where."}, {"time": 5823, "text": "But spelled with two Ls."}, {"time": 5824, "text": "Yeah, yeah, because that's how Spanish works, right?"}, {"time": 5827, "text": "Like the two Ls have a... Medasha."}, {"time": 5831, "text": "Anyway, but I read about it in middle of August, August 14th, there was an incident on that test net."}, {"time": 5837, "text": "How does this process work?"}, {"time": 5842, "text": "What do you learn from those kinds of incidents when stuff goes wrong in the test process?"}, {"time": 5847, "text": "I think that incident was that there was a consensus failure of some kind as I remember."}, {"time": 5853, "text": "Basically just different clients interpreting things in different ways, and then one of them getting kicked off the network."}, {"time": 5859, "text": "And then it ended up taking a while to actually get everyone to get back online."}, {"time": 5865, "text": "A big part of the reason why it took weeks to resolve is because it's on a test network, like the coins are valueless."}, {"time": 5872, "text": "And so there's not really this big push of any kind for people to actually go and download the new clients so they can start participating again."}, {"time": 5880, "text": "And so it definitely took a while until the chain started finalizing again."}, {"time": 5886, "text": "And then also there was, I think, another round of just not finalizing in October, as I remember."}, {"time": 5895, "text": "There were definitely things that we learned."}, {"time": 5897, "text": "Like there were a lot of things, especially that client developers just learned about like optimization and how to build their clients in a way that they can process things efficiently."}, {"time": 5908, "text": "There's a lot that we learned from just like seeing the full life cycle of what happens when more than a third of the validators go offline and then finalization stops."}, {"time": 5917, "text": "And then that kind of weird unusual state of the chain continues for a while."}, {"time": 5923, "text": "And then eventually everyone who is not participating just gets enough of their stake."}, {"time": 5928, "text": "Like we don't use the word slashed, we use the word leaked for this, but like basically also burned until the people who are participating go back up to two thirds and then the chain goes back to finalizing."}, {"time": 5939, "text": "So just seeing all of those edge cases play out live, I think actually helped a lot and probably helped to really contribute to making us feel better about Mainnet."}, {"time": 5948, "text": "I mean, there's also an incident just recently in April 24th of 2021 where this was on Beacon, I guess."}, {"time": 5958, "text": "There was a bug discovered in the software client Prism that prevented roughly 70% of validators on the network from producing blocks."}, {"time": 5968, "text": "I mean, maybe you can comment on what happened, but broadly like the big picture, what kind of stuff are you worried about in terms of problems that might arise?"}, {"time": 5979, "text": "Are we talking about small bugs?"}, {"time": 5981, "text": "Are we talking about like emergent social, unexpected social bugs?"}, {"time": 5988, "text": "What are the things that worry you about the future of Ethereum that you want to make sure you construct mechanisms that prevent those things from happening?"}, {"time": 5995, "text": "So one of the lucky things there was that this particular bug only prevented proposed self blocks."}, {"time": 6001, "text": "It did not prevent attestations."}, {"time": 6003, "text": "So attestations is just a mechanism for voting on blocks."}, {"time": 6006, "text": "And it's the attestations that are actually responsible for the chain finalizing."}, {"time": 6009, "text": "So like coming to this more permanence agreements on blocks."}, {"time": 6012, "text": "So the chain was actually quite stable all the way through."}, {"time": 6019, "text": "I think the thing that we generally learned from these experiences is just how valuable it is to have this multi client network."}, {"time": 6028, "text": "So this is one of these areas where I think Ethereum distinguishes itself from like Bitcoin, for example."}, {"time": 6033, "text": "That in Ethereum, we don't have one single client that everyone just runs, right?"}, {"time": 6041, "text": "There's multiple implementations of the protocol."}, {"time": 6044, "text": "And these multiple implementations, they all process and verify the blocks that each other can verify, right?"}, {"time": 6052, "text": "So they all speak the same language."}, {"time": 6054, "text": "Now, sometimes when there's a bug, they disagree."}, {"time": 6056, "text": "And when two clients disagree because of a bug, we call this a consensus failure."}, {"time": 6061, "text": "And consensus failures are pretty serious, right?"}, {"time": 6063, "text": "And when you have a client's monoculture like Bitcoin does, then it's more rare to have consensus failures."}, {"time": 6072, "text": "Though you still have them actually."}, {"time": 6073, "text": "Bitcoin had a consensus failure between two different versions of the same client back in 2013, but they're less likely to happen."}, {"time": 6081, "text": "But the interesting thing is that the multi client architecture has actually, I think, saved Ethereum much more than it's heard it."}, {"time": 6090, "text": "So even in this most recent incident, right?"}, {"time": 6091, "text": "Like Prism was not producing blocks, but all the other clients were still producing blocks."}, {"time": 6096, "text": "There's four others, right?"}, {"time": 6098, "text": "Yes, it's a Prism, Nimbus, Teku, and the Lighthouse."}, {"time": 6103, "text": "And then also Ethereum back in 2016 had this fun events that we call the Shanghai DOS attacks."}, {"time": 6109, "text": "They're called that because the attacks started right on the first day of our annual conference at DEF CON that happens to be in Shanghai that year."}, {"time": 6119, "text": "So what happened basically was that someone came up with a way to create blocks that were very slow for one client to process, but not the other client."}, {"time": 6130, "text": "So at that time, there were basically two Ethereum clients."}, {"time": 6132, "text": "They were called Geth and Parity."}, {"time": 6135, "text": "Right now, I think the top three ones are Geth, Nethermind, and Basu."}, {"time": 6140, "text": "But what happened as a result of us having two clients is that the attacker was just not able to come up with blocks that both clients were completely failing at processing."}, {"time": 6152, "text": "And so a lot of the miners and a lot of network participants, they just kept on switching between the two implementations depending on which one worked."}, {"time": 6159, "text": "And that actually really helped the chain survive through that month of attacks as the attacker just kept on hammering at our system and identifying all of the weaknesses and just forcing our clients to do this rapid sprint of just optimizing the hell out of everything and make sure there aren't any of those DOS blocks or DOS bugs remaining."}, {"time": 6182, "text": "So that was another example."}, {"time": 6184, "text": "And then as a counter example, so something that also shows the point from the other side, Bitcoin had this bug in 2010, the balance overflow bug."}, {"time": 6195, "text": "Basically someone created a transaction that had two outputs and those outputs were both of a few billion Bitcoin."}, {"time": 6204, "text": "So like about two to the power of 63 Satoshis."}, {"time": 6207, "text": "And then if you add those numbers together, you'll go above two to the power of 64."}, {"time": 6211, "text": "And of course, computers like once you go above to the power of 64, you wrap around."}, {"time": 6216, "text": "And so the Bitcoin nodes thought that there was enough money to pay for the transaction because it was asking for, let's say like a billion Satoshis or something, but actually it was asking for two to the power of 64 plus a billion."}, {"time": 6228, "text": "And so the attacker just managed to create like billions of Bitcoin out of thin air."}, {"time": 6233, "text": "And this was not only discovered and fixed after something like 12 hours, but if there had been, if Bitcoin had been a multiple implementation system, then what would have almost certainly happened is like one of the clients would have bugged out, but the other clients would have probably actually had a check for that, right?"}, {"time": 6255, "text": "And so there would have been a consensus failure, but at least that would have like alerted everyone that there is a problem very quickly."}, {"time": 6264, "text": "And it also would have given everyone just like obvious social permission to go and, you know, pick whichever one of the chains is correct and solve the problem."}, {"time": 6271, "text": "So like, that's, I think a big learning that we've had from multiple of our experiences in the Ethereum ecosystem, just like validating this multi client model."}, {"time": 6283, "text": "And like, to be fair, it's a model that we get criticized for a lot, right?"}, {"time": 6286, "text": "Like Bitcoin people talk about, you know, the risk of consensus failures that this creates."}, {"time": 6291, "text": "VC types are like, well, you know, isn't it expensive and wasteful to fund three software teams where you could just be making, you know, one quote focused effort, you know, they love the word focused."}, {"time": 6300, "text": "And like, you know, Ethereum is not that, but it's amazing despite not being that."}, {"time": 6308, "text": "Basically, yeah, so that was interesting."}, {"time": 6312, "text": "And then there have definitely been other learnings as well, just from like seeing the chain live and seeing what actually is the staking experience like, what are the actual incentives for all the different participants."}, {"time": 6326, "text": "So I definitely feel like we're gaining a lot from this sort of one year of trial running the chain before we actually make all of Ethereum depend on it."}, {"time": 6335, "text": "Let me ask perhaps a strange question, but you know, proponents of Bitcoin will say things like, Bitcoin fixes everything."}, {"time": 6344, "text": "So why do we need Ethereum?"}, {"time": 6347, "text": "Versus like Bitcoin plus lightning network for scalability and then using Bitcoin for, with this proof of work for security."}, {"time": 6358, "text": "So in this kind of, it is perhaps sort of a strange question, but it's a high level question."}, {"time": 6364, "text": "Why do we need another technology?"}, {"time": 6367, "text": "Yes, it has a bunch of nice features, but like doesn't Bitcoin fix everything already?"}, {"time": 6373, "text": "So the thing that always attracted me about Bitcoin is these values of decentralization, creating these open provisional systems that anyone can participate in and that aren't just going to flop over and die if whoever created them gets bored and that are resistant to like whoever runs them breaking the rules and all of these things."}, {"time": 6395, "text": "And I think that pretty strongly that these principles are like really valid in importance to much more things than just money, right?"}, {"time": 6402, "text": "Like Bitcoin is the blockchain for money and Ethereum was built from the start as a general purpose blockchain, right?"}, {"time": 6409, "text": "There is ether the asset on Ethereum, but then you can also make decentralized financial things, what we call DeFi today."}, {"time": 6418, "text": "You can make like ENS, the decentralized domain name system."}, {"time": 6422, "text": "You can put, make prediction markets on it."}, {"time": 6425, "text": "You can make totally nonfinancial systems that just like keep track of whether or not some certificate was signed or whether or not some like cryptographic key got revoked."}, {"time": 6436, "text": "There's this big long list of like just interesting things that you could use about blockchains to do, right?"}, {"time": 6443, "text": "Like basically they are sort of the missing piece that where without them, the kinds of things that a decentralized computer network can do is very limited."}, {"time": 6452, "text": "And once you have them, a lot of those limitations end up going away."}, {"time": 6456, "text": "And so Ethereum was like always from the beginning about that, right?"}, {"time": 6463, "text": "It's about like, hey, this isn't just money."}, {"time": 6496, "text": "Hence the smart contracts as being a sort of a core technology as part of Ethereum."}, {"time": 6502, "text": "Smart contracts, the computer programs that are running on Ethereum, they are like the core of what makes Ethereum general purpose."}, {"time": 6509, "text": "Yeah, so I do think that there's a lot more wrong with the world than just money, right?"}, {"time": 6517, "text": "Like I'm not one of these people who thinks that if you get rid of fiat currency and you replace it with cryptocurrency, then suddenly wars are gonna go away, right?"}, {"time": 6525, "text": "Because like, first of all, like say your average revenue is only a small portion of government revenue, right?"}, {"time": 6531, "text": "It's like what, 5%, 10%, something like that."}, {"time": 6534, "text": "Second of all, like if you are the sort of, this is one of the things I don't even get about their philosophy."}, {"time": 6541, "text": "Like, let's say you're the sort of person who is an extreme and very distrusting libertarian and you think that these governments are terrible, right?"}, {"time": 6549, "text": "Like we know today that governments find a combination of things like welfare and things like the military that goes and like bombs people in Afghanistan, right?"}, {"time": 6561, "text": "And so the question you have to ask is like, okay, you with your new, you know, magic newfangled cyber currency that takes over the world, take away the government's ability to have seniorized revenue and so you reduce the government's revenue by 10%."}, {"time": 6577, "text": "If the government is that evil, which portion of its expenses is it gonna take that 10% from?"}, {"time": 6583, "text": "Is it gonna stop the bombing people in Afghanistan or is it gonna cut welfare?"}, {"time": 6587, "text": "If you think it's the first, you have a very optimistic view of the government, right?"}, {"time": 6591, "text": "So that's, I guess, my perspective on like why the whole, you know, we're going to save the world and create peace by like denying governments the right to stealth taxation kind of perspective doesn't really make much sense for me."}, {"time": 6609, "text": "And I do think that there is real value that comes from a decentralized and open currency."}, {"time": 6614, "text": "Like just the fact that there is a financial infrastructure that anyone in the world can go ahead and use, right?"}, {"time": 6621, "text": "It's, that's something that can easily be a big boon for people, right?"}, {"time": 6625, "text": "There's a lot of places where the currency and is much less stable than the dollar."}, {"time": 6632, "text": "And, you know, these people like they don't like, well, if they use Bitcoin, their only option is to get Bitcoins, right?"}, {"time": 6639, "text": "Which, you know, are also pretty volatile."}, {"time": 6642, "text": "If they use Ethereum, then, you know, they can get ether, but then they can also get stable coins, right?"}, {"time": 6646, "text": "And you might think that, you know, oh, you're not being ideologically pure."}, {"time": 6649, "text": "Now you're giving them stable coins, which are mirroring dollars."}, {"time": 6652, "text": "And obviously dollars are going to collapse too."}, {"time": 6654, "text": "But the reality is that dollars are vastly more stable than the Venezuelan Bolivar."}, {"time": 6658, "text": "So like, there are really meaningful and beneficial things that you can give to people by having a global and open financial system."}, {"time": 6669, "text": "But I think if you want to actually do that, like you have to have much more than just a currency, right?"}, {"time": 6674, "text": "And then if you want to go beyond financial things, then, you know, you have to obviously have much more than a currency and then, you know, you also have to actually take scalability seriously because the nonfinancial applications, like nobody's going to pay $5 a transaction for them."}, {"time": 6691, "text": "Can we return to dogs?"}, {"time": 6694, "text": "Woof, woof."}, {"time": 6700, "text": "The other one's categorically forbidden."}, {"time": 6701, "text": "Yeah, categorically forbidden."}, {"time": 6703, "text": "Is there any cryptocurrency based on cats actually?"}, {"time": 6705, "text": "I think there are."}, {"time": 6706, "text": "Like, there was cat coin, there was nan coin."}, {"time": 6709, "text": "For some reason, they just didn't catch on as much as the dog coins did."}, {"time": 6713, "text": "Okay, so let's talk about Dogecoin and Elon Musk."}, {"time": 6717, "text": "Elon said that, quote, ideally, Doge speeds up block time 10x, increases block size 10x, and drops fee 100x."}, {"time": 6730, "text": "Then it wins hands down, end quote."}, {"time": 6734, "text": "You said in a blog post, partially responding to that, that there are subtle technical reasons why this is not possible."}, {"time": 6743, "text": "To this, Elon said that you, quote, fear the Doge."}, {"time": 6750, "text": "So let's talk about this."}, {"time": 6751, "text": "What are the technical hurdles for Dogecoin that prevent it from becoming one of the primary cryptocurrencies of the world?"}, {"time": 6758, "text": "And do you, in fact, fear the Doge?"}, {"time": 6761, "text": "I definitely feel obligated to correct the record."}, {"time": 6763, "text": "I definitely do not fear the Doge."}, {"time": 6766, "text": "No, I love the Doge."}, {"time": 6767, "text": "I actually visited the Doge in Japan a few years back."}, {"time": 6771, "text": "She's an amazing dog, she's still alive."}, {"time": 6774, "text": "Wait, the original Doge?"}, {"time": 6778, "text": "So, you know, we accept Doge every year for our annual DEF CON conferences."}, {"time": 6785, "text": "So, I definitely don't think Ethereum is opposed to Doge coins."}, {"time": 6791, "text": "I kind of want to feel like Ethereum is at least a little bit in spirit itself a Dogecoin."}, {"time": 6796, "text": "And then, as I mentioned, I love Doge, I bought a bunch of Doge, I still hold a bunch of Doge."}, {"time": 6804, "text": "On the scalability question, the challenge basically is the limits to scalability and the trade offs with centralization, right?"}, {"time": 6811, "text": "If you just increase the parameters without doing anything else, then it just becomes more and more difficult for people to validate the chain and it just becomes more likely that the chain becomes centralized and becomes vulnerable to all kinds of capture."}, {"time": 6825, "text": "So, does it need like some of the layer two technologies that we've been talking about?"}, {"time": 6830, "text": "I personally think that if Doge wants to somehow bridge through Ethereum and then people can trade Doge thousands of times a second inside of a loop ring, then that would be amazing."}, {"time": 6841, "text": "If they want to just like take ZK roll up style technology and just have thousands of transactions a second on their own chain, then that would be a great outcome as well."}, {"time": 6851, "text": "So, is there ways for Ethereum and Dogecoin to work together?"}, {"time": 6856, "text": "Okay, so there's a power behind a person like Elon Musk pushing the development of a cryptocurrency."}, {"time": 6865, "text": "Is there ways to leverage that power and that momentum to improve Ethereum, to improve some of the sort of cryptocurrencies that are already technologically advanced and pushing forward that kind of technology?"}, {"time": 6881, "text": "I definitely think there's room for... You know that meme of Doge like taking over, like that storm?"}, {"time": 6889, "text": "I've seen it."}, {"time": 6890, "text": "Is there a way to ride that storm, that wave of the Doge that's taking over?"}, {"time": 6897, "text": "I think if we can have a secure Doge to Ethereum bridge, then that would be amazing."}, {"time": 6902, "text": "And then when Ethereum gets its scalability, any scalability thing that works for Ethereum assets, you would be able to also trade wrapped Doge with extremely low transaction fees and very high speed as well."}, {"time": 6913, "text": "Is there precedence for building secure bridges between cryptocurrencies?"}, {"time": 6918, "text": "Is that, I mean, how difficult is this kind of task?"}, {"time": 6921, "text": "It's definitely something that's in its infancy."}, {"time": 6923, "text": "There definitely have been some cross chain interaction things that have been done before."}, {"time": 6928, "text": "So, the earliest is probably the concept of merge mining, right, when a chain just makes its entire proof of work algorithm dependent on the proof of work algorithm of another chain."}, {"time": 6938, "text": "So, I think famous Dogecoin actually merge mines to Litecoin, which is, I think in retrospect, not looking like a very good choice because now Dogecoin is bigger than Litecoin."}, {"time": 6949, "text": "But, you know, if there's potentially some way for Dogecoin to merge mine with an Ethereum proof of stake of some kinds, then that could be an interesting alternative."}, {"time": 6964, "text": "So, that's one type of chain interaction."}, {"time": 6966, "text": "As far as bridges, like one chain reading another chain, early in Ethereum's history, there was this project called BTC Relay."}, {"time": 6973, "text": "It's a smart contract on Ethereum that just verifies Bitcoin blocks."}, {"time": 6977, "text": "I think people stopped really caring about it and maintaining it because there just weren't enough applications that were actually interested in using it at the time."}, {"time": 6985, "text": "And then the transaction fees got too high to actually maintain it."}, {"time": 6988, "text": "So, I think if we want to make a BTC Relay 2.0, that becomes cheaper because, you know, it uses snarks or something like that, then you probably could."}, {"time": 6998, "text": "But maybe now's the time when you actually can do that sort of one way verification."}, {"time": 7004, "text": "But the one challenge though, is that if he wants to have a bridge that allows you to move assets between chains, then you don't just need one way verification, you need two way verification, right?"}, {"time": 7013, "text": "And Ethereum can verify anything because Ethereum smart contracts can just run arbitrary code."}, {"time": 7018, "text": "But if you want Bitcoin to be able to do things based on what happens in Ethereum lands, then Bitcoin would have to basically, well, they can do everything with soft forks because that's their religion, but they'll do it that way."}, {"time": 7032, "text": "And if Doge wants to make a fork where that allows for two way transferability with Ethereum, then they could."}, {"time": 7042, "text": "I mean, I think that would be a lovely collaboration to make if there's interest."}, {"time": 7047, "text": "I think there might actually even be some multi SIG funds that has some funding."}, {"time": 7054, "text": "It's just a bounty for someone to make a bridge between the two."}, {"time": 7057, "text": "Oh, could you maybe try to psychoanalyze Elon Musk for a brief second?"}, {"time": 7062, "text": "So what are your thoughts about Tesla and Elon Musk's journey through the cryptocurrency world?"}, {"time": 7069, "text": "So first with Bitcoin and then with Dogecoin."}, {"time": 7073, "text": "So acquiring, holding a large amount of Bitcoin."}, {"time": 7077, "text": "And I believe, at least considering the acquiring and holding a large amount of Dogecoin."}, {"time": 7083, "text": "Positives, negatives, what do you think the future for Tesla and SpaceX in the cryptocurrency space looks like?"}, {"time": 7090, "text": "Do you think they'll consider Ethereum?"}, {"time": 7093, "text": "I'm sure that if they stay in the cryptocurrency system at all, then they have to at some point."}, {"time": 7099, "text": "Bitcoin number one, Dogecoin number, I mean, come on, it deserves to be number three."}, {"time": 7109, "text": "And then, or number two."}, {"time": 7111, "text": "And then Ethereum can be whatever that other number is."}, {"time": 7119, "text": "If Ethereum only becomes a Dogecoin somehow, maybe change the logo to incorporate a dog of some sort."}, {"time": 7126, "text": "Almost like Doge sneaking behind."}, {"time": 7130, "text": "Oh, that would be fascinating."}, {"time": 7132, "text": "For when the merge happens."}, {"time": 7133, "text": "And I think, Elon, you definitely, I think you would make a mistake if you were to kind of ascribe too much sophisticated, malevolent, or any deep intentionality to the whole process."}, {"time": 7147, "text": "I think he's just a human being and he likes dogs, just like I like dogs."}, {"time": 7151, "text": "Yeah, I think that is literally the reasoning behind the whole Dogecoin thing."}, {"time": 7156, "text": "There is some aspect to which, I mean, the guy helped launch a car into space, right?"}, {"time": 7164, "text": "Like you could ask, like, what is the purpose of that?"}, {"time": 7167, "text": "I think the purpose of that is fun."}, {"time": 7171, "text": "I think he truly is more and more, especially lately, embodying the whole idea that the most entertaining outcome is the most likely and he's fully embracing the most entertaining outcome."}, {"time": 7184, "text": "And in many ways, Dogecoin is the most entertaining cryptocurrency."}, {"time": 7188, "text": "As cryptocurrency becomes more and more impactful in the world, people are getting more and more serious about it."}, {"time": 7193, "text": "And so he's selecting the cryptocurrency that is the least serious and the most fun."}, {"time": 7199, "text": "And there's something to that, like coupling fun with technological sophistication and somehow figuring out a way to do that well."}, {"time": 7210, "text": "I want the world to be fun."}, {"time": 7212, "text": "I think the world being fun is great."}, {"time": 7215, "text": "Okay, let me ask about a couple of other technologies if it's okay."}, {"time": 7220, "text": "What are your thoughts about Chainlink and hybrid smart contracts that utilize off chain external data sources?"}, {"time": 7228, "text": "And I think it's definitely necessary for a smart contract so that do a lot of things to use off chain data of some kind, right?"}, {"time": 7236, "text": "Like if you want to have a stable coin, you need a price oracle so you know what price you're targeting."}, {"time": 7241, "text": "If you want to have some fancy no crop insurance gadget, like I think EtherRisk has been doing a lot of good work with that."}, {"time": 7249, "text": "And I think it was either Kenya or Sri Lanka or both, like they're making a lot of good progress in some of those places."}, {"time": 7259, "text": "Like you need some kind of oracle to tell you, did it actually rain in this particular area?"}, {"time": 7265, "text": "If he wants to have like assets that mirror other financial assets, you need an oracle."}, {"time": 7269, "text": "If you want to have a prediction market, you need an oracle."}, {"time": 7272, "text": "And so projects that provide oracles are definitely really important."}, {"time": 7278, "text": "There are definitely different kinds of use cases."}, {"time": 7280, "text": "Like Augur is more about events and the Augur oracle is designed, I think differently from Chainlink, right?"}, {"time": 7286, "text": "Like Chainlink emphasizes the whole, we have a fast automated thing that just gives you data quickly."}, {"time": 7293, "text": "Whereas Augur is more, we don't give a crap about speed."}, {"time": 7298, "text": "And look, we don't need to give a crap about speed because if you want to get your money out on a prediction market that where in reality it's resolved, you can probably just sell your coins for 99 cents anyway."}, {"time": 7308, "text": "So I mean, I think Chainlink is definitely taking a good and important part of the oracle design space."}, {"time": 7318, "text": "And I'm definitely happy that there's that project taking the task on."}, {"time": 7322, "text": "I mean, at the same time, I do think that their frog army on Twitter can get a bit intense at times, but like."}, {"time": 7328, "text": "I mean, is there a way to incorporate sort of oracle network type of ideas into Ethereum?"}, {"time": 7334, "text": "I personally would prefer the Ethereum base layer, like stay away from trying to provide too much functionality because like once you have the Ethereum base layer making a claim about like say the US dollar to Ethereum price, like at some sense, you're basically saying that like Ethereum as a base platform starts making what could be geopolitical statements, right?"}, {"time": 7360, "text": "Like for example, imagine if there was some civil war and the US split up and you had two currencies that both claims to be the US dollar, well, Ethereum would have to pick one for the sake of everyone who was already using that oracle."}, {"time": 7373, "text": "So does that mean that the blockchain would be taking a position in this big mega political debate?"}, {"time": 7379, "text": "So I think like for just those kinds of reasons, I would personally like prefer Ethereum itself to be more of this sort of pure platform that just analyzes transactions just mathematically using deterministic consensus rules."}, {"time": 7397, "text": "And then if you need the oracles, that can be layer twos."}, {"time": 7400, "text": "Like I think Ethereum like benefits from not trying to do everything at layer one and having this like very robust layer two ecosystem where you have all these projects doing interesting things."}, {"time": 7411, "text": "Yeah, focus on the basic technology avoid the politics."}, {"time": 7416, "text": "Let me ask a bit of a human question."}, {"time": 7420, "text": "Charles Hoskinson, someone you've worked with in the early days of Ethereum, there appears to my outsider view to have been a bit of a falling out."}, {"time": 7431, "text": "Is there positive inspiring human story to be told about why you two parted ways?"}, {"time": 7436, "text": "I kind of want to let the various books about Ethereum speak for themselves, but I feel like since that time, I think Charles has clearly progressed and matured in a lot of ways."}, {"time": 7456, "text": "And people who follow Charles closely have definitely told me that like 2021 Charles is very different from a 2014 Charles."}, {"time": 7464, "text": "And I'm sure it's 2021 Vitalik is much different from 2014 Vitalik as well."}, {"time": 7468, "text": "I'm kind of interested how the 2030 and 2040 Vitalik and Charles look like as well."}, {"time": 7475, "text": "Like the progression of the humans."}, {"time": 7477, "text": "Is this going to be one of those things where like everyone comes full circle and then 2030 Vitalik and Charles are best friends?"}, {"time": 7483, "text": "Yeah, not necessarily best friends, but some kind of are able to reminisce in ways that puts some of the tension of the past behind."}, {"time": 7495, "text": "I think such things are possible."}, {"time": 7498, "text": "I think people definitely absolutely have a right to, and I think should strive to just constantly change and reinvent themselves."}, {"time": 7508, "text": "Is there something you could say about your thoughts about the Cardano project that Charles Hoskinson leads?"}, {"time": 7515, "text": "They've worked on some interesting ideas that mirror some of the ideas in Ethereum, proof of stake, working on smart contracts and all those kinds of things."}, {"time": 7528, "text": "Is there something, again, positive, inspiring that you could say?"}, {"time": 7533, "text": "Are they a competitor?"}, {"time": 7537, "text": "There's definitely interesting ideas in there."}, {"time": 7540, "text": "I do think Cardano takes a bit of a different approach than Ethereum in that they really emphasize having these big academic proofs for everything, whereas Ethereum tends to be more okay with heuristic arguments in part because it's just trying to do more faster."}, {"time": 7555, "text": "But there's definitely very interesting things that come out of IOHK research."}, {"time": 7563, "text": "Can you comment on that kind of idea?"}, {"time": 7565, "text": "I, as sort of having a foot in research, enjoy Charles's kind of emphasis on papers and deep academic rigor."}, {"time": 7575, "text": "What's the role of deep research rigor in the world of cryptocurrency?"}, {"time": 7581, "text": "I'm actually the sort of person who thinks deep rigor is overrated."}, {"time": 7585, "text": "The reason why I think deep rigor is overrated is because I think in terms of why protocols fail, I think the number of failures that are outside the model is even more important, is bigger and more important than the failures that are inside the model."}, {"time": 7601, "text": "So if you take selfish mining, for example, that original discovery from 2013 that showed how Bitcoin does, even if it has a 50% fault tolerance, assuming everyone's honest, it only has a zero to 33% fault tolerance, depending on your network model, if you assume rational actors."}, {"time": 7625, "text": "And to me, that was a great example of an outside the model failure, right?"}, {"time": 7630, "text": "Because traditional consensus research, just up until or before the blockchain days, did not think about like incentivization much, right?"}, {"time": 7639, "text": "There was a little bit of thought about incentivization."}, {"time": 7641, "text": "There's like a couple of papers on the Byzantine altruist rational model, but it wasn't that deep."}, {"time": 7646, "text": "It was mostly operating under the assumption that we're gonna make consensus between 15 participants and these are institutions."}, {"time": 7654, "text": "And if something goes wrong, then we can figure out whether or not it was deliberate offline."}, {"time": 7660, "text": "And if they did something evil, we can sue them."}, {"time": 7662, "text": "Whereas in the crypto world, you can't sue that, right?"}, {"time": 7664, "text": "And so that whole discovery basically arose just because the model of traditional consensus research just didn't cover those possibilities."}, {"time": 7674, "text": "And then once you go out of the model, those other issues do exist, right?"}, {"time": 7679, "text": "So, but then at the same time, there definitely are protocols that turn out to be, that do have failures inside the model."}, {"time": 7688, "text": "Like this reminds me of the time when I think I found a bug in a proposed consensus implementation from either BitShares or EOS."}, {"time": 7698, "text": "This happened around the end of 2017."}, {"time": 7701, "text": "So that was definitely inside the model because like they had a very clear idea of what they were trying to achieve."}, {"time": 7706, "text": "They had a very clear description and like there's a very clear mathematical argument for why the description doesn't lead to what they're trying to achieve."}, {"time": 7713, "text": "But ultimately what you're trying to achieve can never be fully described in formal language, right?"}, {"time": 7718, "text": "Like I think this is the big discovery of, the AI safety people, for example, right?"}, {"time": 7723, "text": "Like just having a specification of what you want is an insanely hard problem."}, {"time": 7729, "text": "And like the more powerful the optimizer that you're giving the instructions to, the more you have to be careful."}, {"time": 7735, "text": "And so, I think there are the kind of these two sides."}, {"time": 7742, "text": "And then the other thing is that a lot of the academic approach ends up basically optimizing for other people inside of the academic system."}, {"time": 7752, "text": "And it doesn't really optimize for like curious outsiders."}, {"time": 7757, "text": "Whereas like I personally totally optimize for curious outsiders, or at least I feel like I strive to."}, {"time": 7763, "text": "So I guess like that's my case for why I like tends to behave in ways that, you know, occasionally traditional academic types criticize as being reckless."}, {"time": 7775, "text": "But I mean, on the other hand, you know, there's definitely real benefits that come from like just taking a rigorous approach, especially when, you know, you know what the thing, like, you know what the specification is of what you're trying to get."}, {"time": 7793, "text": "And like, you're trying to kind of improve your ways or provide protocols that actually provide that."}, {"time": 7798, "text": "And like, you know exactly what you're looking for."}, {"time": 7800, "text": "I feel like realistically, you probably wants to do both kinds of analysis."}, {"time": 7806, "text": "And like, sometimes you even want to do both kinds of analysis in stages, right?"}, {"time": 7809, "text": "Like you have, you want to do more quick and dirty things and even wants public feedback on the quick and dirty stuff."}, {"time": 7814, "text": "And then later on you formalize it more and then you get more feedback."}, {"time": 7818, "text": "Like in general, I guess I feel like the norms of research in the future, like the internet has just changed so much."}, {"time": 7827, "text": "There's no way that it's not going."}, {"time": 7829, "text": "And you know, it's even changed like collaboration structures and like the patterns in which we work with each other."}, {"time": 7835, "text": "There's no way that the correct structure for collaborative research is the same as what it was 15 years ago."}, {"time": 7842, "text": "But like, what combination of these existing components and of new ideas it is, like that's something that's, you know, totally legitimate to kind of fight it out."}, {"time": 7852, "text": "And I think it's great that there's different ecosystems that have different attitudes to things."}, {"time": 7856, "text": "Like, you know, I think, you know, there's a big possibility that, you know, things that the Ethereum, ways that the Ethereum ecosystem approaches some problems is totally wrong."}, {"time": 7864, "text": "And if there's other ecosystems with different principles and they do well, that's something that we can learn from."}, {"time": 7869, "text": "In the spirit of the depth for a search, can you comment on AI safety?"}, {"time": 7873, "text": "And some people are really worried about the existential risks of artificial intelligence."}, {"time": 7878, "text": "Is there something you could say that's hopeful about how we avoid in the same kind of line of reasoning about creating formal models versus kind of looking outside the model into what the real world actually is like?"}, {"time": 7893, "text": "Is there some lessons from that we can take and map onto the AI safety world where the potentials of the technology, whether it's in autonomous weapon systems or just the paperclip problem that we can avoid AI destroying the world?"}, {"time": 7911, "text": "So my impression is actually that, like, this is more of a kind of far away impression and it could be wrong, that it might even be that one of the challenges is that AI is not formal enough."}, {"time": 7921, "text": "Like, because AI is very practitioner oriented, right?"}, {"time": 7925, "text": "Like, it's all about like, hey, I found a couple of hacks and look, I ran them and look, they seem to improve classification accuracy from 0.684 to 0.773."}, {"time": 7935, "text": "So a lot of the time there just isn't actual science behind why this hack works and why this other hack doesn't work."}, {"time": 7943, "text": "You just sort of like trial and error your way into it."}, {"time": 7947, "text": "And I could see how that approach works, but at the same time, like, that approach is not good for eligibility, for example."}, {"time": 7954, "text": "Like, it's not good for like understanding what the heck is actually going on, like how these kinds of systems conceivably might fail."}, {"time": 7962, "text": "Like, there's even, you know, a debate on like, can you take GPT3 like things and just scale them up and their intelligence will continue to improve or is there just like some types of reasoning that they're fundamentally bad at and like they're not gonna get good at it no matter how much you like scale this exact same approach and add more hardware to it."}, {"time": 7981, "text": "So having like thinking about what's going on more explicitly, I mean, my understanding is that a big part of AI safety research is trying to do that sort of stuff, right?"}, {"time": 7993, "text": "Formalize."}, {"time": 7994, "text": "Yeah, formalize, try to improve just AI eligibility, like trying to understand, you know, if the AI makes some classification so we can actually see like what happens and like what's going on in the middle, right?"}, {"time": 8007, "text": "Whereas with crypto or with traditional cryptography, you know, it's like very much not, well, okay, I mean, I shouldn't quite say that."}, {"time": 8015, "text": "It's, traditional cryptography is this interesting mix of being very formal and being very informal because it's very formal with, given these security assumptions, prove that the protocol works under these security assumptions."}, {"time": 8027, "text": "The places where it's very informal is like, well, how do we even know that there isn't an efficient algorithm for factoring numbers?"}, {"time": 8033, "text": "Yeah, we kind of tried it for 40 years."}, {"time": 8036, "text": "And then, you know, so far, no one's found anything better than the general number field sieve."}, {"time": 8040, "text": "And like, okay, fine, we'll just assume it's fine."}, {"time": 8043, "text": "You know, how do we know you can't find the discrete log between two elliptic curve points?"}, {"time": 8048, "text": "Like, nope, did it a couple of decades, no one's found anything faster than like baby step, giant step stuff."}, {"time": 8055, "text": "So that's, and like, there's definitely ways in which that approach really makes sense, right?"}, {"time": 8065, "text": "Because at least you can concentrate your analysis on a small number of building blocks."}, {"time": 8070, "text": "And like, you know, you do have some intuitive reasoning about those building blocks, but like at least there is a small number of building blocks and lots of people are looking at them."}, {"time": 8078, "text": "And then everything else just sort of gets formally built on top and you actually can like mathematically reduce the security of big things to building blocks, right?"}, {"time": 8085, "text": "Like you can have mathematical proofs that say, you know, if you make a ZK Synarch of a yes statement when in reality that statement is false, then you can use that to like extract information out of elliptic curves that, you know, it completely breaks the problem or something like that."}, {"time": 8104, "text": "So ZK Synarch is an example where formalism is beneficial."}, {"time": 8109, "text": "And so maybe you can have the same kind of stuff in the AI safety within AI systems that you can get a hold of some kind of aspect of the systems that you can control provably."}, {"time": 8121, "text": "And then in blockchains and cryptocurrency, I think the one area where consensus mechanisms is still more an art than a science is that these aren't just like technological systems, they're crypto economic systems, right?"}, {"time": 8133, "text": "And they make assumptions about people."}, {"time": 8135, "text": "And which assumptions you can make about people is not something that you can prove with math."}, {"time": 8139, "text": "Right, even just the basic 51%."}, {"time": 8144, "text": "Honest."}, {"time": 8145, "text": "Can you trust the 51%?"}, {"time": 8147, "text": "If you can't trust the 51%, can you trust the other 49% to be able to coordinate on like making their own fork?"}, {"time": 8155, "text": "What will happen to coin prices?"}, {"time": 8156, "text": "Like how do people as human beings react to these events?"}, {"time": 8160, "text": "Like there's all of these assumptions."}, {"time": 8162, "text": "But no, at the same time, look, if you can write down the assumptions, then you can like do formal things with them."}, {"time": 8168, "text": "I almost forgot to ask you about one of the most exciting aspects of Ethereum."}, {"time": 8173, "text": "I mean, it's non technical."}, {"time": 8174, "text": "I think it's a societal, it's social, which is NFTs."}, {"time": 8179, "text": "So what do you think about the explosion of NFTs in the recent months, especially in the art world and beyond, and what does the future look like?"}, {"time": 8191, "text": "So this is maybe the social impact on the world, on the individual creators of all kinds."}, {"time": 8198, "text": "Like is that something you've actually expected to see, NFTs having this kind of impact?"}, {"time": 8204, "text": "And beyond, what do you think will happen in the digital space with NFTs, in virtual reality, in gaming, all those kinds of things?"}, {"time": 8215, "text": "I was definitely surprised by like NFTs in particular."}, {"time": 8218, "text": "Like I even actually think might be on record somewhere on some tech conference panel."}, {"time": 8223, "text": "Like they were asking, you know, it was one of those overrated or underrated sections and ask about NFTs and I thought, and I said like, hey, I think NFTs are overrated."}, {"time": 8231, "text": "And, you know, in retrospect, that turned out to be quite wrong."}, {"time": 8234, "text": "I think, like, I guess I just personally can't really relate to this concept of like spending a lot of money on a thing."}, {"time": 8242, "text": "Like there's nothing, you know, there's no clear kind of understanding of why that thing would maintain its value."}, {"time": 8252, "text": "Uniqueness of a thing having value."}, {"time": 8256, "text": "That's like, I definitely like cannot really understand, you know, the psychology behind like buying, you know, paying $200,000 for original art painting."}, {"time": 8264, "text": "I'd be like, you know, if I had a mansion, just like give me photocopies of everything."}, {"time": 8268, "text": "You can hang three photocopies of the Mona Lisa section."}, {"time": 8272, "text": "Why would I even have the Mona Lisa?"}, {"time": 8273, "text": "I think I'd probably just like have some Nyan Cats or something."}, {"time": 8276, "text": "That's one thing where mathematics or theoretical computer science cannot formalize why the heck NFTs are valuable."}, {"time": 8282, "text": "But the thing that makes me very happy about the space now that it has happened is that, and this gets back to the conversation that we had at the beginning, right?"}, {"time": 8292, "text": "Like I'm interested in this concept of decentralized public goods funding, right?"}, {"time": 8297, "text": "Like I want things that are good and valuable to as much as possible also be things that can economically sustain the people who produce them, right?"}, {"time": 8306, "text": "Because if you don't have that, then either the public goods just don't get produced at all or people make like centralized versions that have some of the properties and try to be substitutes, but actually just like concentrate control in a very small group, right?"}, {"time": 8321, "text": "And both of those things are not very nice."}, {"time": 8323, "text": "So the nice thing about NFTs would be, well, if you're an artist and you can just mint NFTs and this is a source of revenue, then like great, that's another stream of revenue for creative work that often does still get underfunded and that's amazing."}, {"time": 8338, "text": "Okay, let me ask you a weird question."}, {"time": 8339, "text": "We talked about Craig Wright a little bit, but a lot of people write to me, one of two emails."}, {"time": 8346, "text": "One email is calling any coin outside of Bitcoin a scam and then the other email is saying, my favorite coin is the best coin, it's going to save the world, whatever that coin is."}, {"time": 8365, "text": "And so I sit back and I look, I have no idea."}, {"time": 8368, "text": "I try to figure out like the humans that I trust in this space, just the basic human qualities, but do you think some coins are scams?"}, {"time": 8383, "text": "Do you think some coins, maybe another way to ask it, are scamier than other coins?"}, {"time": 8388, "text": "How are people that are looking outside of this space where there's all of these cryptocurrencies supposed to figure out what is a scam and not, or how to use the right kind of language when talking about them?"}, {"time": 8401, "text": "Because there's the harshness of the language from the Bitcoin maximalists that doesn't just say everything's a scam, including Ethereum, but they use terms like shit coin that says it's not only a scam, it's like a waste of time."}, {"time": 8414, "text": "I mean, every word you can use, they say that."}, {"time": 8417, "text": "That's very harsh."}, {"time": 8418, "text": "And then some people just apply the word scam much, much more conservatively and just refer to coins that legitimately are trying to scam people out of their money as scams."}, {"time": 8431, "text": "So what do we do with this word scam?"}, {"time": 8433, "text": "Should it ever be applied to coins?"}, {"time": 8435, "text": "And is it a binary thing or is it a gray area?"}, {"time": 8441, "text": "I think it's definitely a gray area."}, {"time": 8442, "text": "There's definitely things that are really and actually scams."}, {"time": 8446, "text": "I mean, Bitconnect would be one example of something that's way on the scam spectrum."}, {"time": 8451, "text": "Did you see their 2017 promotional video, by the way?"}, {"time": 8454, "text": "Of Bitconnect?"}, {"time": 8455, "text": "Yeah, hey, hey, hey, what's up, what's up, what's up?"}, {"time": 8459, "text": "Bitconnect!"}, {"time": 8461, "text": "It was this three minute, 48 second video that was just of this guy making this totally crazy rant."}, {"time": 8467, "text": "And it was at some conference in Vietnam where they were, of course, trying to convince a whole bunch of people to buy this coin and they had these claims about how it would go up in value."}, {"time": 8477, "text": "That was definitely the peak of these pure, completely scammy coins."}, {"time": 8484, "text": "And that was definitely really terrible."}, {"time": 8487, "text": "And I feel like we have less, despite cryptocurrency as a whole being bigger, we actually have quite a bit less of that now."}, {"time": 8520, "text": "So if you wanna go a step, like if that's 100% scam, then what would I call say 80% scam?"}, {"time": 8529, "text": "Well, like Bitcoin SV is one example."}, {"time": 8531, "text": "This is a Craig Wright's fork of Bitcoin."}, {"time": 8533, "text": "Theoretically, it's a blockchain, right?"}, {"time": 8535, "text": "It's a fork of Bitcoin."}, {"time": 8537, "text": "It has some 512 megabyte blocks."}, {"time": 8540, "text": "If you really wanted to, you could use the blockchain."}, {"time": 8543, "text": "It satisfies the property so that you can send transactions onto it."}, {"time": 8547, "text": "You can probably use it as a backup to store your files if you really wanted to just because it has so much space."}, {"time": 8555, "text": "It might fail, but at the same time, as we basically said, Craig Wright is a scammer and half the community is just totally batshit insane."}, {"time": 8569, "text": "So the humans of a particular cryptocurrency is what makes for a scam and not like the humans at the top that have a voice guiding the community."}, {"time": 8578, "text": "Yeah, I think in the case of BSV, the humans, they make just completely wrong and just obviously wrong claims about what BSV is capable of accomplishing and what it can say we could accomplish."}, {"time": 8592, "text": "And there's just a lot of aspects of it that make it feel like a money grab."}, {"time": 8598, "text": "And then you gotta go a bit further and then you have the trons of the world."}, {"time": 8603, "text": "And that's a platform, you can use it, you can do stuff on it."}, {"time": 8607, "text": "But at the same time, they did plagiarize the IPFS white paper and then they..."}, {"time": 8614, "text": "So there's scammy qualities."}, {"time": 8616, "text": "See, the thing that throws me off a lot, it's very difficult for me, is that most coins, but the ones that make me feel like are scammy have a large community of people that are super positive about it."}, {"time": 8633, "text": "Like, and they'll write to me."}, {"time": 8636, "text": "Now that said, sort of on the flip side of that, Bitcoin people are also very positive."}, {"time": 8644, "text": "There's some sense in..."}, {"time": 8645, "text": "The reason I was having like squinty eyes looking at Bitcoin for quite a while is like, why is everyone so positive?"}, {"time": 8654, "text": "I was getting total cult vibes."}, {"time": 8658, "text": "Like the ideas are not grounded in truth, but are grounded in an obsession of like when you can artificially conjure up a truth, which is why I was a little bit like worried about Bitcoin."}, {"time": 8671, "text": "I think I've learned a lot since then to where like, I learned to separate the community from the ideas."}, {"time": 8679, "text": "And I think Bitcoin is a revolutionary idea on many fronts, but still a community that's like dogmatically excited about something, whatever that is, makes me skeptical."}, {"time": 8691, "text": "Maybe it's just like my upbringing, but when everybody's really excited about something, it makes me skeptical."}, {"time": 8702, "text": "But it also makes me difficult to decide what is this scam or not, because some of the most exciting ideas in this world have a community of people who are excited about it, right?"}, {"time": 8709, "text": "Because it's, I don't know."}, {"time": 8712, "text": "I think space exploration is super exciting."}, {"time": 8714, "text": "And there's people, I know a lot of them that are exceptionally excited about space exploration."}, {"time": 8721, "text": "Does that mean it's a scam?"}, {"time": 8724, "text": "So I don't know what to do with that."}, {"time": 8726, "text": "And so most I just try to stay away, I suppose, but it's unfortunate because I'm sure there's a lot of exciting technologies in that space."}, {"time": 8733, "text": "Like in the case of Bitcoin, like I would definitely not call Bitcoin a scam."}, {"time": 8737, "text": "But I would also not call Litecoin a scam."}, {"time": 8743, "text": "There's people who call Litecoin a scam because they just like say, oh, look, it has no fundamental use case."}, {"time": 8749, "text": "And the concept of being silver to Bitcoin's gold is just like stupid."}, {"time": 8753, "text": "And like milli Bitcoin is the silver to Bitcoin's gold."}, {"time": 8758, "text": "But at the same time, like if you have these people who just, they do seem to earnestly believe this."}, {"time": 8766, "text": "And like they're trying to just like make Litecoin be a Litecoin as best as they can."}, {"time": 8771, "text": "Then like, to me that's enough for it to not be a scam."}, {"time": 8777, "text": "And then, so yeah, I think the biggest gray area is definitely between like projects that are earnest but they have just all sorts of these like different combinations of flawed qualities to them."}, {"time": 8794, "text": "I mean, the ones that legitimately is a scam is when the key people that are at the head of the project are intentionally lying."}, {"time": 8802, "text": "And I think as long as the intent is to try to do good in the world, even if your actual implementation of that is flawed, I think that's not a scam."}, {"time": 8813, "text": "It could be flawed ideas, it could be wrong ideas, but it's not a scam."}, {"time": 8818, "text": "I'm learning to navigate this space."}, {"time": 8820, "text": "Yeah, it's definitely a very challenging space to navigate, I mean, it's in some ways the reflection of the world at large."}, {"time": 8830, "text": "Yeah, and as we've said, maybe offline that the fact that money is involved makes it a little bit more complicated that lives can be ruined by the choice of technologies that are taken on."}, {"time": 8845, "text": "So it makes it more real, more painful, more like elevated the impact of this."}, {"time": 8851, "text": "Like imagine like Mac versus PC wars if everyone who bought a MacBook had 10 Apple shares inside of it, and everyone who had a PC had 10 Microsoft shares inside of it."}, {"time": 8862, "text": "And then you had the elites who bought their Macs back in 1983, and then they spent $500 debt, and now they have $40 million, and they just think that they're these gurus who understands the future of finance and geopolitics, and they make theories about why Apple is the one that's gonna bring freedom to the world, and Windows is secretly allied with the axis of evil."}, {"time": 8886, "text": "So yeah, this is so brilliant."}, {"time": 8887, "text": "So I think the right way to think about this is we map some of the cryptocurrency battles into the space of like EMAX versus VIM, or Apple versus PC, if there were some stock that came along with each implementation of each PC, each Mac, that's fascinating."}, {"time": 8905, "text": "This is 100% correct, 100% correct."}, {"time": 8908, "text": "Because then that really energizes the armies of people debating over this in a way that something without money does not."}, {"time": 8915, "text": "Okay, let me ask you about something really fascinating that you are also excited about, which is longevity, antiaging."}, {"time": 8924, "text": "You have donated money to the SENS Foundation, so you have an interest in this whole space of lifespan research."}, {"time": 8933, "text": "What's your vision here?"}, {"time": 8934, "text": "Or what do you hope to see in antiaging and longevity research?"}, {"time": 8939, "text": "I think I hope to see the concept of seeing your parents and grandparents die just slowly disappear from the public consciousness as an experience that happens over the course of half a century, the same way that getting lost in a city slowly disappeared over the public consciousness over the last 50 now that we have smartphones."}, {"time": 8959, "text": "The thing you have from Nick Bostrom, the essay pinned in your Twitter argues that essentially death is almost unethical."}, {"time": 8973, "text": "The fact that we don't do something about this thing that, this, in the essay, is a dragon that keeps murdering everybody around us, including our parents and grandparents, is, the fact that we don't try to do something aggressively about that dragon doesn't make any sense."}, {"time": 8993, "text": "So you think this is a battle worth fighting, a battle for immortality, or at least longevity?"}, {"time": 9001, "text": "I'd say absolutely."}, {"time": 9002, "text": "And I'd say a battle where we really have started over the last five years in particular to see the first cracks of humanity starting to make things that look like they'll turn into victories."}, {"time": 9018, "text": "Do you think humans can eventually live forever?"}, {"time": 9022, "text": "And maybe as a side comment to that, what technology do you think will enable that as a genetic modification?"}, {"time": 9029, "text": "Is it cloning, is it uploading your mind?"}, {"time": 9032, "text": "Define forever, like are we talking 1,000 years, a million, 10 to the 14, 10 to the 45?"}, {"time": 9038, "text": "Well, let's start, as I tweeted today, eventually everything, the universe will be filled with supermassive black holes."}, {"time": 9044, "text": "So that forever, maybe like backtracking to where."}, {"time": 9049, "text": "We'll have 10 to the 16 years to figure it out."}, {"time": 9055, "text": "Yeah, maybe travel between the multiverse, between the different universes of the multiverse."}, {"time": 9062, "text": "I mean, but forever meaning like, you know, millennia."}, {"time": 9071, "text": "I definitely think that we can get there."}, {"time": 9073, "text": "I definitely think that it's the sort of thing that's going to take an insanely huge amount of work."}, {"time": 9079, "text": "And I definitely think it's the sort of thing where once we figure out the first crop of problems and like people start living to 150, we'll just realize that there's like 10 other problems that kill you half as slowly and we'll have to do more work."}, {"time": 9092, "text": "But the good news is that this is Aubrey's longevity escape velocity argument that if you get everyone to live to 150 now, then you have half a century to fix all those other problems as well."}, {"time": 9104, "text": "So I'm optimistic for that reason."}, {"time": 9107, "text": "I think you definitely do not want to underestimate human ingenuity, especially over the longterm."}, {"time": 9114, "text": "Like just to look at what happens to computers between the ENIAC in 1950 and we're around 2020, right?"}, {"time": 9120, "text": "Like that's a span of 70 years."}, {"time": 9122, "text": "So like, you know, both of us, I think, with just present day technology, I have like at least 70 more years to live."}, {"time": 9131, "text": "So just like imagine what kind of sea change will happen in biomedicine during that time."}, {"time": 9136, "text": "And the other thing that made me optimistic is that I actually think COVID has been this kind of event that's really kind of pushed biomedicine and especially like activist approaches to biomedicine really into the public consciousness, right?"}, {"time": 9152, "text": "Like it basically, it's put people into this mindset that, you know, wait, but like, you know, it's not just like, you know, the bits and tweets that are gonna save the world, you know, the bio is actually like super important and huge."}, {"time": 9166, "text": "And, you know, ultimately what's ending COVID basically, you know, is the vaccines and the vaccines have just been, you know, amazing."}, {"time": 9208, "text": "And like this exists everywhere in the political spectrum."}, {"time": 9211, "text": "So there's nature as in literal nature."}, {"time": 9213, "text": "And my view is that like the right wing version of that is markets as nature, right?"}, {"time": 9217, "text": "Like, you know, the way that like that kind of philosophy talks about, you know, markets and like the goal of not interfering with them, like, you know, it is very kind of like nature styled."}, {"time": 9231, "text": "And then of course, you know, the conservative one, which is like traditional culture that existed before the activists started controlling everything as also being a kind of nature."}, {"time": 9241, "text": "But the 21st century attitude and like really COVID, you know, has flipped a lot of minds because with COVID what's happened is that, well, no, like it's not, nature is not safe, right?"}, {"time": 9253, "text": "The default is that is like, you know, untold misery and suffering in tens of millions of people dying."}, {"time": 9259, "text": "The only way out for us is through like basically human ingenuity."}, {"time": 9265, "text": "And that frame of mind is one that's like much more friendly to one, this other change of minds that I want to see, which is like basically treating aging as an engineering problem, right?"}, {"time": 9279, "text": "Like the default is all 7.8 billion human beings that are currently on this earth are gonna die and they're gonna live their last decade of life in debilitating pain."}, {"time": 9288, "text": "And the only way to stop that is human ingenuity."}, {"time": 9291, "text": "And, you know, we don't have that solution yet, but, you know, if we work hard, we will."}, {"time": 9296, "text": "And more and more people on the biology side, computational biology are basically converting the mess of the human biology into an engineering problem."}, {"time": 9305, "text": "And once that conversion is happening, looking at the genetic code, the proteins, all those kinds of things, once that conversion happens, you can now apply the tools that we know how to solve engineering problems to solving it that way."}, {"time": 9318, "text": "And then there's also the other version, which is, you know, why do we romanticize this meat vehicle that ultimately is just the thing that carries the brain, maybe we can more and more convert ourselves into the digital realm."}, {"time": 9332, "text": "This is where like Neuralink have the computer interfaces and then achieve immortality in the space of information and the digital space versus the biology space."}, {"time": 9340, "text": "That stuff's interesting too, I agree."}, {"time": 9342, "text": "Again, I think, you know, we have enough resources and we should just try all the parallel tracks."}, {"time": 9348, "text": "You know, it's great that we have people just trying to make our bodies work."}, {"time": 9351, "text": "It's great that we have people trying to upload or improve brain scanning."}, {"time": 9356, "text": "It's also great that we have just like people improving cryonics."}, {"time": 9359, "text": "So like we could just like, you know, go to sleep in the freezer and eventually, hopefully sometime in the future, you know, Hal Finney is gonna be able to wake up, all of this, you know, anyone who gets cryo chronically frozen today will be able to wake up, but you know, that's a bet, right?"}, {"time": 9377, "text": "That's the last resort."}, {"time": 9378, "text": "And then the other interesting thing about the like extreme uploading approach, right, is we're excited about space."}, {"time": 9387, "text": "And one of the points that a lot of science or like hard science fiction types make is that, you know, if you want to explore space, that's a lot easier if you're not a human, right?"}, {"time": 9398, "text": "Like one example of this is that, you know, in the context of humans, we're talking about like, oh, we're gonna be able to go to the moon, oh, we're gonna be able to go to Mars, but there's this project called Starshot, I believe, right?"}, {"time": 9409, "text": "That's basically trying to send spacecraft to mini spacecrafts to Alpha Centauri, and they literally believe that they're going to be able to get spacecraft over to Alpha Centauri like four light years away by like the 2060s."}, {"time": 9423, "text": "Now, I mean."}, {"time": 9424, "text": "By traveling close to the speed of light, yeah."}, {"time": 9425, "text": "Exactly, like, so the way it works is, you know, you have these light sails, like you basically take these a spacecraft and you shine a laser at it, and the laser is insanely strong, quickly accelerated at a hundred Gs or, no, I think it was 10,000 Gs until it gets to 20% of the speed of light, and then, you know, it goes on your merry way, right?"}, {"time": 9442, "text": "So if you wants to be in, like personally explore the Alpha Centauri system within like two centuries or one century, then, you know, being a robot is like, by far the most practical way to do it, because there's no way that a human being can survive 10,000 Gs."}, {"time": 9462, "text": "So it's definitely interesting longterm, but at the same time, there's definitely a lot of like psychological hangups and a lot of like deep philosophy that we'll just have to grapple with to get there."}, {"time": 9475, "text": "I think what it hangs on the topic of whether we can convert consciousness into an engineering problem."}, {"time": 9481, "text": "So like, is consciousness tied to our biology?"}, {"time": 9485, "text": "Because the moment we can convert consciousness into a digital form, then we can send it with that light sail to Alpha Centauri."}, {"time": 9492, "text": "Until then, a robot is not carrying anything except maybe some basic knowledge like Wikipedia."}, {"time": 9498, "text": "It's not carrying the flame of human consciousness."}, {"time": 9501, "text": "I have high hopes for converting consciousness into an engineering problem."}, {"time": 9507, "text": "In fact, I think it's not as difficult as people think."}, {"time": 9510, "text": "I'm like, yeah, I agree with that."}, {"time": 9511, "text": "I'm definitely in the camp that consciousness is a property of the algorithm and not a property of a brain structure."}, {"time": 9518, "text": "The other fun, like the kinds of philosophical things we'd have to grapple with is like, once you upload yourself, like you can hit Control C, you know, like it wouldn't be lovely to have like 10 copies of Alex Friedman and then like we could just interview everyone."}, {"time": 9533, "text": "So this is, I mean, this is, I have to ask this question."}, {"time": 9536, "text": "It's a difficult one, which I don't think it'd be wonderful, first of all."}, {"time": 9542, "text": "So in the following way, and this has to do with immortality as well, there's something about scarcity that creates value."}, {"time": 9551, "text": "Or there's a bunch of philosophers, Viktor Frankl, Bernard Williams, Ernest Becker, they argue that death or the scarcity of life creates meaning."}, {"time": 9561, "text": "The reason we, life is beautiful, the reason so many moments of experience of love or delicious food, all those things are made delicious because they're finite, because they end, and because we don't have that many of them."}, {"time": 9579, "text": "And there's a kind of worry that if we extend the human lifespan, if we achieve immortality, or if we, God forbid, clone me multiple times, then you lose the richness of what it means to have this life, to have this experience."}, {"time": 9596, "text": "Is that worry you at all?"}, {"time": 9598, "text": "Do you think there's some aspect to which death does in fact give meaning to life?"}, {"time": 9602, "text": "I guess like the one historical parallel, and this might be a bit unfair, is that there have been philosophers that have said things like, war gives meaning to human collectives, and the struggle for supremacy between nations and races is this big driver of progress that ensures that everyone strives to be their best."}, {"time": 9625, "text": "And of course, this viewpoint got into the head of a crazy Austrian guy, and 20 years later, his soldiers were shooting at my grandparents."}, {"time": 9633, "text": "So these days we don't really have that, but yet life still feels meaningful."}, {"time": 9639, "text": "We've still found other ways to, there's still a striving for technological progress."}, {"time": 9647, "text": "There's still a striving for self improvements in general."}, {"time": 9652, "text": "And it turns out that you don't actually need to have existential conflicts in order to have that."}, {"time": 9658, "text": "Now, maybe you need conflict, but we have other kinds of conflict, right?"}, {"time": 9661, "text": "Like we have competition between businesses, competition between political ideologies, competition between projects."}, {"time": 9667, "text": "And so these are, like whatever the psychological needs are, like they're just our substitutes for it."}, {"time": 9674, "text": "So I guess like, yeah, so if we trying to say, I feel like once we start living to the age of 200, then like, I'm just intuitively expecting that we'll see substitutes emerge in the same way."}, {"time": 9691, "text": "Yeah, we'll create conflicts of other sorts that lead to less human suffering than wars do."}, {"time": 9698, "text": "Like we'll just start playing Diablo four, five, six, cause you die in video games."}, {"time": 9704, "text": "So maybe we'll get some of the inkling of scarcity through the activities we partake in as opposed to our own body dying."}, {"time": 9712, "text": "I mean, I feel shitty when I, like you can, I remember in Diablo three, you can play in hardcore mode where if you die in the game, your character's dead."}, {"time": 9723, "text": "Maybe we'll get the richness that we currently get from life by having like little artificial versions of ourselves that die."}, {"time": 9732, "text": "Interesting enough, as I've just like personally spent more time in this world, I've started realizing that there is a concept of like real finiteness that still exists and it might even still be a thing that provides meaning that doesn't require anyone to actually die."}, {"time": 9748, "text": "Like for example, like how many people from middle school or even high school are yours?"}, {"time": 9754, "text": "Like do you still talk to regularly?"}, {"time": 9756, "text": "I happen to be close friends with like four or five of them."}, {"time": 9759, "text": "Okay, well, like in my case, the answer is zero for middle school and two for high school."}, {"time": 9764, "text": "It dropped close to zero."}, {"time": 9765, "text": "Exactly, it dropped a lot, right?"}, {"time": 9767, "text": "And so like there's a lot of these just like relationships that end up being very finite."}, {"time": 9772, "text": "A person changes their, I feel like a person changes enough of their worldview after 25 years."}, {"time": 9778, "text": "Was there even a study about this?"}, {"time": 9779, "text": "Something like a person and themselves 25 years later are about as different as like two different people or something like this."}, {"time": 9788, "text": "So, I mean, just like you can have conflict without bloodshed, I think you can have finiteness and even the necessary sorrows of finiteness that give meaning without like literally anyone having to end their life."}, {"time": 9802, "text": "And hopefully if we do extend our life, we'll figure out ways to extend the period of time where there's neuroplasticity to where we could change our worldviews continually throughout that time."}, {"time": 9814, "text": "So you can have these different phases of life."}, {"time": 9818, "text": "I thought it would be fun to hear you speak a little Russian."}, {"time": 9821, "text": "Do you speak Russian?"}, {"time": 9824, "text": "How did your Russian roots help you?"}, {"time": 9830, "text": "What can you say in Russian about that?"}, {"time": 9832, "text": "What can I say about my Russian roots?"}, {"time": 9835, "text": "When I just look at other projects, other people in the blockchain industry, sometimes when I look at what Russian people are doing, what other people are doing, I can sometimes feel that these people who are Russian have something that feels similar to me, but I don't know how to explain it."}, {"time": 9872, "text": "Do you think there's, so for people who don't speak Russian, that Vitalik said that there is something to the spirit of the people that are Russian that are working in the cryptocurrency world that is a little bit different and it's something that connects to some kind of aspect of your own self, some kind of roots there."}, {"time": 9894, "text": "And it's kind of interesting."}, {"time": 9896, "text": "Do you think that there's, does it make you sad that there's these two different worlds that are sort of in part disconnected by language?"}, {"time": 9907, "text": "And I'm sure the same could be the case with China and other parts of the world, where the language slows the transmission of the beauty of the culture in a certain kind of way where you can't truly collaborate."}, {"time": 9921, "text": "Like you can all speak English, so you're collaborating on maybe a technical level, but you're not collaborating on the level of some deep human connection."}, {"time": 9930, "text": "Do you see that being able to speak both languages?"}, {"time": 9934, "text": "There's definitely benefits, I think, to be able to speak multiple languages."}, {"time": 9938, "text": "And once you can, you discover that even your mindset changes while you're speaking in one language versus the other."}, {"time": 9947, "text": "People have told me this, like, when I speak Russian, I sound more, I guess, to the point and pragmatic."}, {"time": 9954, "text": "When I speak Chinese, I sound more cute."}, {"time": 9956, "text": "When I speak English, I'm something else."}, {"time": 9960, "text": "I guess there's definitely a richness that you're missing if you're only in one of these language bubbles."}, {"time": 9970, "text": "But I guess the arguments on the other side would be that if everyone spoke the same language, then there would just be one bubble."}, {"time": 9979, "text": "This is the challenge, I think."}, {"time": 9982, "text": "There are actually benefits to having cultural diversity, and you definitely don't want the entire world to be too conformist."}, {"time": 9990, "text": "Well, one of the interesting things about crypto is that it's just a culture that actually manages to somehow have its uniqueness and even preserve its independence from all of these surrounding countries despite being embedded in all of them."}, {"time": 10004, "text": "So it spans outside of the geographic boundaries, and language in some ways does as well."}, {"time": 10011, "text": "And the way these cultures, these bubbles are created, I mean, they overlap in interesting ways."}, {"time": 10016, "text": "It's almost like a hierarchy, and the same is the case of the crypto world."}, {"time": 10020, "text": "There's communities associated with these cryptocurrencies."}, {"time": 10023, "text": "There's communities within those communities, and it's... Yeah, I mean, I think it's definitely sad whenever these groups are fighting each other, and it's definitely good for them if people can cooperate more."}, {"time": 10039, "text": "But at the same time, just having groups of people that have different kinds of life experiences, there's definitely something to benefit from that."}, {"time": 10050, "text": "So let me ask one last question."}, {"time": 10051, "text": "I don't think I asked you last time the ridiculous question about the meaning of life."}, {"time": 10057, "text": "You know, Dostoevsky said, beauty will save the world."}, {"time": 10060, "text": "Krasata spacet mir."}, {"time": 10063, "text": "Some people believe money is a big part of happiness, and you've turned... First of all, you've made a lot of money."}, {"time": 10070, "text": "You turned away a lot of money."}, {"time": 10071, "text": "You turned away a lot of power."}, {"time": 10073, "text": "So you're a fascinating person to ask, what do you think is meaning to life?"}, {"time": 10079, "text": "The thing that I've realized with money as I have experienced both having little of it and having a lot of it is that the benefit of... You can get the most out of money if you think of it not as something that lets you do and have more things, but as something that lets you worry about fewer things, right?"}, {"time": 10102, "text": "Like, if your savings are just nonzero at all, then you don't have to worry as much about losing your job."}, {"time": 10111, "text": "And if you feel like you have a job that just really conflicts with your values, then if you have even six months saved up, that just makes it easier for you to say, bye bye, I'm going to do something else."}, {"time": 10122, "text": "If you have more money, then you can not worry about even what you're doing needing to be profitable at all."}, {"time": 10133, "text": "Once you get more money, then you can choose transportation options and food options that just have less hassle in your life and allow you to be lazier."}, {"time": 10144, "text": "So, this aspect of just reducing troubles and opening up room for other things, I think, is a big part of it."}, {"time": 10156, "text": "If you instead think of money as being this positive or this thing that gives you stuff and you try to derive meaning from the stuff, I think that's much more likely to be a road to basically squandering that opportunity."}, {"time": 10172, "text": "So, yeah, and I guess my philosophy on that is definitely more subtractive than additive there."}, {"time": 10178, "text": "But once you have enough money that you don't have to worry about the money, you're burdened with another question, which is of meaning."}, {"time": 10185, "text": "Do you think there's meaning to it all?"}, {"time": 10187, "text": "Or it seems like your own life, you're trying to build cool stuff that alleviates some level of suffering in the world."}, {"time": 10199, "text": "Well, I mean, one way to think about it is like, think back to how you thought about life when you were in school, right?"}, {"time": 10206, "text": "In school, this act is interesting to think about, right?"}, {"time": 10209, "text": "Because in a lot of ways, it's just totally outside of bounds of the kinds of systems, like social systems that we live in as adults, or maybe not, like maybe things like academia are intended to replicate parts of school."}, {"time": 10223, "text": "Like, first of all, school is very totalitarian, right?"}, {"time": 10226, "text": "Like, you have to follow the teacher's instructions, the bulk of your schedule is like forced to be in particular areas, and you can control the real purview from leaving the grounds during this period of time, assign a lot of homework."}, {"time": 10245, "text": "But at the same time, also, school is a bit of a post scarcity utopia in that you just don't have to worry about getting resources for yourself."}, {"time": 10253, "text": "And we've both lived through 12 years of that, right?"}, {"time": 10257, "text": "So, what does that say about us?"}, {"time": 10259, "text": "And I think one thing of aspects, obviously, is that there's definitely an easiness to living life if all of your decisions are made for you."}, {"time": 10272, "text": "And one of the challenges of adulthood, I guess, is moving to this world where all your choices are much more self directed, and you just have to learn to live and deal with that."}, {"time": 10286, "text": "Yeah, dealing with the burden of freedom, in some sense."}, {"time": 10290, "text": "It's actually interesting, because in some ways, I feel like even my first five years of doing Ethereum things, my life was not even all that self directed, because a lot of it was just responding to obligations."}, {"time": 10307, "text": "Like someone said, oh, come to speak at this event in Korea."}, {"time": 10311, "text": "Okay, come to speak at this thing in Taiwan."}, {"time": 10315, "text": "For Ethereum to launch, we need this particular piece to be done and tested."}, {"time": 10320, "text": "Okay, work on that."}, {"time": 10321, "text": "We need some proof of stake algorithm, work on that."}, {"time": 10325, "text": "And the last year of COVID life, basically, I was holed up in Singapore for much of it."}, {"time": 10334, "text": "And it gave me a lot more alone time."}, {"time": 10336, "text": "I had much less travel."}, {"time": 10338, "text": "And that was definitely a very new and interesting experience for me."}, {"time": 10341, "text": "Would you characterize it by sadness, melancholy, hope, dreaming, innovative period?"}, {"time": 10351, "text": "How would you characterize that alone time?"}, {"time": 10353, "text": "Some of all five, definitely some self discovery."}, {"time": 10357, "text": "I definitely did make this very deliberate decision that, okay, I have this time, and I'm going to actually make something meaningful out of it."}, {"time": 10368, "text": "So one example of the things I did is I just actually started listening to your audio books and podcasts much more."}, {"time": 10377, "text": "Just this year, I basically discovered that the podcast space is real for the first time, I guess."}, {"time": 10383, "text": "Like before that, there would be things that I would get interviewed for, but I was not mentally incorporate this idea that podcasts are a thing that you can go listen to."}, {"time": 10396, "text": "And this year I did."}, {"time": 10397, "text": "My friend, Carl Lafleur, one of the optimism people, recommended hardcore history to me."}, {"time": 10404, "text": "And so I went ahead and just listened to all the hardcore histories."}, {"time": 10407, "text": "And then after that, I listened to like 10 Luxfried mids and then a bunch of others."}, {"time": 10412, "text": "And after that, I also got into audio books."}, {"time": 10417, "text": "Oh, I listened to the entire The Rise and Fall of the Third Reich, the whole thing, 45 hours."}, {"time": 10424, "text": "That was fascinating."}, {"time": 10425, "text": "So let me ask about Dan, because Dan is going to love hearing this."}, {"time": 10428, "text": "I'm going to send it to him."}, {"time": 10430, "text": "Do you have a period of history, whether it's Dan or in general, that you draw for your own life, like kind of thinking about the world, about human nature that you go to?"}, {"time": 10439, "text": "Is it World War II?"}, {"time": 10441, "text": "Is it Wrath of the Khans, the Genghis Khan?"}, {"time": 10445, "text": "Is it some other more ancient history?"}, {"time": 10448, "text": "Is it World War I?"}, {"time": 10449, "text": "Is there something that kind of echoes with you in the voice of Dan or anyone else that you connect to?"}, {"time": 10456, "text": "I feel like the 1930s and 40s are fascinating because they force you to really grapple with the question of where does evil come from, right?"}, {"time": 10465, "text": "The sort of mental puzzle that I've always had in my head is, on the one hand, things like the Holocaust happened."}, {"time": 10473, "text": "But on the other hand, if you just go and have a coffee with people, then a hundred times out of a hundred, everyone just seems so nice."}, {"time": 10483, "text": "How do you kind of reconcile the macro and the micro there, right?"}, {"time": 10487, "text": "And that's the sort of thing that's very difficult if you don't have a lot of, I guess, the right kind of personal experience, especially if your personal experience starts off being sheltered, like it was for me, right?"}, {"time": 10503, "text": "I know the stereotype is that the nerds get bullied in school, but actually for me, in my school experience was just being treated with kindness by everyone."}, {"time": 10512, "text": "So that definitely made it harder to understand things."}, {"time": 10515, "text": "I remember actually being pretty blindsided when I started Ethereum."}, {"time": 10519, "text": "And then within six months, there started being fights over who would get more shares if Ethereum turned out to be a company."}, {"time": 10526, "text": "And then I suggested we should just make it to be a non profit, and somehow that ended up upsetting people."}, {"time": 10534, "text": "So the fascinating thing for me is that I've been obviously reading and listening to the history, and then at the same time, just observing things happening in the crypto world."}, {"time": 10545, "text": "And so one of my interesting mental intuitions that I've gotten is that I think most evil doesn't come out of greed, it comes out of fear."}, {"time": 10558, "text": "And one example of this in Ethereum lands, right, is I think the part of Ethereum history where I thought that the Ethereum community was at its lowest, and even when I personally was at my lowest."}, {"time": 10572, "text": "Now, if you go back to the Dow fork in 2016, right, so the Dow hack happened, and then we made this controversial decision to change the Ethereum protocol."}, {"time": 10581, "text": "And then there was that Ethereum Classic split."}, {"time": 10588, "text": "And as soon as that Ethereum Classic split happened, there was a lot of anger everywhere."}]}]