[{"title": "Barry Barish: Gravitational Waves and the Most Precise Device Ever Built | Lex Fridman Podcast #213", "id": "J48bm21q8_A", "quotes": [{"time": 346, "text": "But is there a moment where you looked up to the stars and also, the same way you wondered about water, wondered about some of the things that are out there in the universe?"}, {"time": 361, "text": "Oh, yeah, I think everybody looks and is in awe and is curious about what it is out there."}, {"time": 361, "text": "And as I learned more, I learned, of course, that we don't know very much about what's there."}, {"time": 370, "text": "And the more we learn, the more we know we don't know."}, {"time": 377, "text": "I mean, we don't know what the majority of anything is out there."}, {"time": 382, "text": "It's all what we call dark matter and dark energy."}, {"time": 382, "text": "And that's one of the big questions."}, {"time": 387, "text": "When I was a student, those weren't questions."}, {"time": 387, "text": "So we even know less, in a sense, the more we look."}, {"time": 393, "text": "So of course, I think that's one of the areas that almost it's universal."}, {"time": 403, "text": "People see the sky, they see the stars and they're beautiful and see it looks different on different nights."}, {"time": 409, "text": "And it's a curiosity that we all have."}, {"time": 414, "text": "What are some questions about the universe that in the same way that you felt about the ice that today?"}, {"time": 421, "text": "You mentioned to me offline, you're teaching a course on the frontiers of science, frontiers of physics."}, {"time": 427, "text": "What are some questions outside the ones we'll probably talk about that kind of, yeah, fill you with the, get your flame of curiosity up and firing up, you know, fill you with awe?"}, {"time": 443, "text": "Well, first, I'm a physicist, not an astronomer."}, {"time": 443, "text": "So I'm interested in the physical phenomenon, really."}, {"time": 449, "text": "So the question of dark matter and dark energy, which we probably won't talk about, our recent last 20, 30 years, certainly dark energy."}, {"time": 456, "text": "Dark energy is a complete puzzle."}, {"time": 465, "text": "It goes against what you will ask me about, which is general relativity and Einstein's general relativity."}, {"time": 473, "text": "It basically takes something that he thought was what he called a constant, which isn't."}, {"time": 480, "text": "And if that's even the right theory, and it represents most of the universe."}, {"time": 480, "text": "And then we have something called dark matter, and there's good reason to believe it might be an exotic form of particles."}, {"time": 494, "text": "And that is something I've always worked on, on particle accelerators and so forth."}, {"time": 502, "text": "And it's a big puzzle, what it is."}, {"time": 502, "text": "It's a bit of a cottage industry in that there's lots and lots of searches, but it may be a little bit like, you know, looking for a treasure under rocks or something."}, {"time": 514, "text": "You don't, it's hard to, we don't have really good guidance, except that we have very, very good information that is pervasive and it's there."}, {"time": 520, "text": "And that it's probably particles, small, that the evidence is all of those things."}, {"time": 529, "text": "But then the most logical solution doesn't seem to work, something called supersymmetry."}, {"time": 537, "text": "And do you think the answer could be something very complicated?"}, {"time": 546, "text": "You know, I like to hope that, think that most things that appear complicated are actually simple if you really understand them."}, {"time": 552, "text": "I think we just don't know at the present time, and it isn't something that affects us."}, {"time": 559, "text": "It does affect, it affects how the stars go around each other and so forth, because we detect that there's missing gravity, but it doesn't affect everyday life at all."}, {"time": 572, "text": "I tend to think and expect maybe, and that the answers will be simple."}, {"time": 572, "text": "We just haven't found it yet."}, {"time": 582, "text": "Do you think those answers might change the way we see other sources of gravity, black holes, the way we see the parts of the universe that we do study?"}, {"time": 589, "text": "The black holes that we've found in our experiment, we're trying now to understand the origin of those."}, {"time": 597, "text": "It's conceivable, but doesn't seem the most likely that they were primordial, that is, they were made at the beginning."}, {"time": 611, "text": "And in that sense, they could represent at least part of the dark matter."}, {"time": 616, "text": "So there can be connections, dark black holes or how many there are, how much of the mass they encompass is still pretty primitive."}, {"time": 623, "text": "So before I talk to you more about black holes, let me take a step back to, I actually went to high school in Chicago and would go to take classes at Fermilab, watch the buffalo and so on."}, {"time": 634, "text": "So let me ask about, you mentioned that Enrico for me was somebody who was inspiring to you in a certain kind of way."}, {"time": 650, "text": "He was amazing, actually."}, {"time": 650, "text": "He's the last, I'll come to the reason in a minute, but he had a big influence on me at a young age."}, {"time": 660, "text": "But he was the last physicist of note that was both an experimental physicist and a theorist at the same time."}, {"time": 671, "text": "And he did two amazing things within months in 1933."}, {"time": 677, "text": "We didn't really know what the nucleus was, what radioactive decay was, what beta decay was when electrons come out of a nucleus."}, {"time": 689, "text": "And near the end of 1933, the neutron had just been discovered."}, {"time": 702, "text": "And that meant that we knew a little bit more about what the nucleus is, that it's made out of neutrons and protons."}, {"time": 707, "text": "The neutron wasn't discovered till 1932."}, {"time": 707, "text": "And then once we discovered that there was a neutron and proton and they made the nucleus and then their electrons that go around, the basic ingredients were there."}, {"time": 720, "text": "And he wrote down not only just the theory, a theory, but a theory that lasted decades and has only been improved on of beta decay, that is, the radiation."}, {"time": 736, "text": "He did this, came out of nowhere, and it was a fantastic theory."}, {"time": 736, "text": "He submitted it to Nature magazine, which was the primary best place to publish even then."}, {"time": 744, "text": "And it got rejected as being too speculative."}, {"time": 753, "text": "And so he went back to his drawing board in Rome where he was, added some to it, made it even longer, because it's really a classic article, and then published it in the local Italian journal for physics and the German one."}, {"time": 768, "text": "At the same time, in January of 1932, Giulio and Curie, for the first time, saw artificial radioactivity."}, {"time": 778, "text": "This was an important discovery because radioactivity had been discovered much earlier."}, {"time": 787, "text": "They had x rays and you shouldn't be using them, but there was radioactivity."}, {"time": 794, "text": "People knew it was useful for medicine."}, {"time": 801, "text": "But radioactive materials are hard to find, and so it wasn't prevalent."}, {"time": 801, "text": "But if you could make them, they had great use."}, {"time": 806, "text": "And Giulio and Curie were able to bombard aluminum or something with alpha particles and find that they excited something that decayed and had some half life and so forth, meaning it was artificial version, or let's call it not a natural version, an induced version of radioactive materials."}, {"time": 831, "text": "And Fermi somehow had the insight, and I still can't see where he got it, that the right way to follow that up was not using charged particles like alphas and so forth, but use these newly discovered neutrons as the bombarding particle."}, {"time": 852, "text": "It seemed impossible they barely had been seen."}, {"time": 859, "text": "It was hard to get very many of them."}, {"time": 859, "text": "But it had the advantage that they're not charged, so they go right into the nucleus."}, {"time": 866, "text": "And that turned out to be the experimental work that he did that won him the Nobel Prize."}, {"time": 875, "text": "And it was the first step in fission, discovery of fission."}, {"time": 882, "text": "And he did this two completely different things, an experiment that was a great idea and a tremendous implementation, because how do you get enough neutrons?"}, {"time": 890, "text": "And then he learned quickly that not only do you want neutrons, but you want really slow ones."}, {"time": 898, "text": "He learned that experimentally, and he learned how to make slow ones, and then they were able to go through the go through the periodic table and make lots of particles."}, {"time": 909, "text": "He missed on fission at the moment, but he had the basic information, and then fission follows soon after that."}, {"time": 921, "text": "Forgive me for not knowing, but is the birth of the idea of bombarding with neutrons, is that an experimental idea?"}, {"time": 929, "text": "Was it born out of an experiment?"}, {"time": 929, "text": "Did he just observe something, or is this an Einstein style idea where you come up from basic intuition?"}, {"time": 940, "text": "I think it took a combination, because he realized that neutrons had a characteristic that would allow them to go all the way into the nucleus when we didn't really understand what the structure was of all this."}, {"time": 953, "text": "So that took an understanding or recognition of the physics itself of how a neutron interacts compared to, say, an alpha particle that Julio and Curie had used."}, {"time": 966, "text": "And then he had to invent a way to have enough neutrons, and he had a team of associates, and he pulled it off quite quickly."}, {"time": 976, "text": "So it was pretty astounding."}, {"time": 981, "text": "And probably, maybe you can speak to it, his ability to put together the engineering aspects of great experiments and doing the theory, they probably fed each other."}, {"time": 988, "text": "I wonder, can you speak to why we don't see more of that?"}, {"time": 993, "text": "Is that just really difficult to do?"}, {"time": 998, "text": "It's difficult to do."}, {"time": 998, "text": "Yeah, I think in both theory and experiment in physics anyway, it was conceivable if you had the right person to do it, and no one's been able to do it since."}, {"time": 1007, "text": "So I had the dream that that was what I was going to be like, Fermi."}, {"time": 1016, "text": "But you love both sides of it, the theory."}, {"time": 1016, "text": "Yeah, I never liked the idea that you did experiments without really understanding the theory, or the theory should be related very closely to experiments."}, {"time": 1025, "text": "And so I've always done experimental work that was closely related to the theoretical ideas."}, {"time": 1031, "text": "I think I told you I'm Russian, so I'm going to ask some romantic questions."}, {"time": 1036, "text": "But is it tragic to you that he's seen as the architect of the nuclear age, that some of his creations led to potentially, some of his work has led to potentially still the destruction of the human species, some of the most destructive weapons?"}, {"time": 1058, "text": "Yeah, I think even more general than him, I gave you all the virtues of curiosity a few minutes ago."}, {"time": 1067, "text": "There's an interesting book called The Ratchet of Curiosity."}, {"time": 1067, "text": "A ratchet is something that goes in one direction."}, {"time": 1072, "text": "And that is written by a guy who's probably a sociologist or philosopher or something."}, {"time": 1079, "text": "And he picks on this particular problem, but other ones."}, {"time": 1079, "text": "And that is the danger of knowledge, basically."}, {"time": 1086, "text": "You're curious, you learn something."}, {"time": 1086, "text": "So it's a little bit like curiosity killed the cat."}, {"time": 1091, "text": "You have to be worried about whether you can handle new information that you get."}, {"time": 1096, "text": "So in this case, the new information had to do with really understanding nuclear physics."}, {"time": 1102, "text": "And that information, maybe we didn't have the sophistication to know how to keep it under control."}, {"time": 1110, "text": "And Fermi himself was a very apolitical person."}, {"time": 1110, "text": "So he wasn't very driven by, or at least he appears in all of his writing, the writing of his wife, the interactions that others had with him."}, {"time": 1126, "text": "Either he avoided it all or he was pretty apolitical."}, {"time": 1126, "text": "I mean, he just saw the world through kind of the lens of a scientist."}, {"time": 1132, "text": "But he asked if it's tragic."}, {"time": 1132, "text": "The bomb was tragic, certainly on Japan."}, {"time": 1141, "text": "And he had a role in that."}, {"time": 1141, "text": "So I wouldn't want it as my legacy, for example."}, {"time": 1141, "text": "But brought it to the human species that it's the ratchet of curiosity that we do stuff just to see what happens."}, {"time": 1159, "text": "That curiosity, that in sort of my area of artificial intelligence, that's been a concern."}, {"time": 1167, "text": "On a small scale, on a silly scale, perhaps currently, there's constantly unintended consequences."}, {"time": 1173, "text": "You create a system and you put it out there and you have intuitions about how it will work."}, {"time": 1180, "text": "You have hopes how it will work, but you put it out there just to see what happens."}, {"time": 1184, "text": "And in most cases, because artificial intelligence is currently not super powerful, it doesn't create a large scale negative effects, but that same curiosity as it progresses might lead to something that destroys the human species."}, {"time": 1198, "text": "And the same may be true for bioengineering."}, {"time": 1204, "text": "There's people that engineer viruses to protect us from viruses to see how close is this to mutating so it can jump to humans or engineering defenses against those."}, {"time": 1215, "text": "And it seems exciting and the application, the positive applications are really exciting at this time, but we don't think about how that runs away in decades to come."}, {"time": 1230, "text": "And I think it's the same idea as this little book, The Ratchet of Science, The Ratchet of Curiosity."}, {"time": 1236, "text": "I mean, whether you pursue, take curiosity and let artificial intelligence or machine learning run away with having its solutions to whatever you want, or we do it, it's, I think, a similar consequence."}, {"time": 1259, "text": "I think from what I've read about Enrico Fermi, he became a little bit cynical about the human species towards the end of his life, both having observed what he observed."}, {"time": 1272, "text": "Well, he didn't write much."}, {"time": 1272, "text": "I mean, he died young."}, {"time": 1272, "text": "He died soon after the World War."}, {"time": 1272, "text": "There was already, you know, the work by Teller to develop the hydrogen bomb."}, {"time": 1280, "text": "And I think he was a little cynical of that, you know, pushing it even further and rising tensions between the Soviet Union and the U.S. and looked like an endless thing."}, {"time": 1292, "text": "So, but he didn't say very much, but a little bit, as you said."}, {"time": 1298, "text": "Yeah, there's a few clips to sort of maybe picked on a bad mood, but in a sense that almost like a sadness, a melancholy sadness to a hope that waned a little bit about that perhaps we can do, like this curious species can find the way out."}, {"time": 1315, "text": "Well, especially, I think, people who worked like he did at Los Alamos and spent years of their life somehow had to convince themselves that dropping these bombs would bring lasting peace and that it didn't."}, {"time": 1328, "text": "As a small, interesting aside, it'd be interesting to hear if you have opinions on this."}, {"time": 1338, "text": "His name is also attached to the Fermi Paradox, which asks if there is a, you know, it's a very interesting question, which is if it does seem if you sort of reason basically that there should be a lot of alien civilizations out there."}, {"time": 1357, "text": "If the human species, if Earth is not that unique by basic, no matter the values you pick, it's likely that there's a lot of alien civilizations out there."}, {"time": 1366, "text": "And if that's the case, why have they not at least obviously visited us or sent us loud signals that everybody can hear?"}, {"time": 1379, "text": "Fermi's quoted as saying, sitting down at lunch, I think it was with Teller and Herb York, who was kind of one of the fathers of the atomic bomb."}, {"time": 1389, "text": "And he sat down and he said something like, where are they?"}, {"time": 1395, "text": "Which meant, where are these other?"}, {"time": 1395, "text": "And then he did some numerology where he calculated, you know, how many, what they knew about how many galaxies there are and how many stars and how many planets then are like the Earth and blah, blah, blah."}, {"time": 1411, "text": "That's been done much better by somebody named Drake."}, {"time": 1417, "text": "And so, people usually refer to the, I don't know whether it's called the Drake formula or something, but it has the same conclusion."}, {"time": 1422, "text": "The conclusion is it would be a miracle if there weren't other, you know, the statistics are so high that how can we be singular and separate?"}, {"time": 1433, "text": "So, probably there is, but there's almost certainly life somewhere."}, {"time": 1433, "text": "Maybe there was even life on Mars a while back, but intelligent life, probably."}, {"time": 1444, "text": "So, you know, the statistics say that communicating with us, I think that it's harder than people think."}, {"time": 1453, "text": "We might not know the right way to expect the communication, but all the communication that we know about travels at the speed of light."}, {"time": 1474, "text": "And we don't think anything can go faster than the speed of light."}, {"time": 1481, "text": "That limits the problem quite a bit."}, {"time": 1481, "text": "And it makes it difficult to have any back and forth communication."}, {"time": 1488, "text": "You could send signals like we try to or look for, but to have any communication, it's pretty hard when it has to be close enough that the speed of light would mean we could communicate with each other."}, {"time": 1500, "text": "And I think, and we didn't even understand that."}, {"time": 1500, "text": "I mean, we're an advanced civilization, but we didn't even understand that a little more than a hundred years ago."}, {"time": 1511, "text": "So, are we just not advanced enough?"}, {"time": 1511, "text": "Maybe to know something about that's the speed of light."}, {"time": 1522, "text": "Maybe there's some other way to communicate that isn't based on electromagnetism."}, {"time": 1526, "text": "Gravity seems to be also have the same speed."}, {"time": 1526, "text": "That was a principle that Einstein had and something we've measured actually."}, {"time": 1533, "text": "So is it possible?"}, {"time": 1533, "text": "I mean, so we'll talk about gravitational waves and in some sense, there's a brainstorming going on, which is like, how do we detect the signal?"}, {"time": 1548, "text": "Like what would a signal look like and how would we detect it?"}, {"time": 1548, "text": "And that's true for gravitational waves."}, {"time": 1552, "text": "That's true for basically any physics phenomena."}, {"time": 1552, "text": "You have to predict that that signal should exist."}, {"time": 1557, "text": "You have to have some kind of theory and model why that signal should exist."}, {"time": 1562, "text": "I mean, is it possible that aliens are communicating with us via gravity?"}, {"time": 1562, "text": "Like why not?"}, {"time": 1569, "text": "Well, yeah, it's true."}, {"time": 1569, "text": "For us, it's very hard to detect these gravitational effects."}, {"time": 1578, "text": "They have to come from something pretty that has a lot of gravity like black holes, but we're pretty primitive at this stage."}, {"time": 1584, "text": "There's very reputable physicists that look for a fifth force, one that we haven't found yet."}, {"time": 1596, "text": "Maybe it's the key."}, {"time": 1596, "text": "What would a fifth force of physics look like exactly?"}, {"time": 1604, "text": "Well, usually they think it's probably a longer range force than we have now."}, {"time": 1610, "text": "But there are reputable colleagues of mine that spend their life looking for a fifth force."}, {"time": 1616, "text": "So longer range than gravity?"}, {"time": 1616, "text": "Super long?"}, {"time": 1616, "text": "It doesn't fall off like one over r squared, but maybe separately."}, {"time": 1622, "text": "Gravity, Newton taught us, goes like inversely one over the square of the distance apart you are."}, {"time": 1630, "text": "So it falls pretty fast."}, {"time": 1630, "text": "So now we have a theory of what consciousness is."}, {"time": 1634, "text": "It's just the fifth force of physics."}, {"time": 1644, "text": "Speaking of gravity, what are gravitational waves?"}, {"time": 1644, "text": "Let's maybe start from the basics."}, {"time": 1652, "text": "We learned gravity from Newton, right?"}, {"time": 1652, "text": "When you were young, you were told that if you jumped up, the earth pulls you down."}, {"time": 1659, "text": "And when the apple falls out of the tree, the earth pulls it down."}, {"time": 1667, "text": "And maybe you even asked your teacher why, but most of us accepted that."}, {"time": 1667, "text": "That was Newton's picture, the apple falling out of the tree."}, {"time": 1675, "text": "But Newton's theory never told you why the apple was attracted to the earth."}, {"time": 1680, "text": "That was a missing in Newton's theory."}, {"time": 1680, "text": "Newton's theory also Newton recognized at least one of the two problems."}, {"time": 1687, "text": "I'll tell you one of them is there's more than those, but one is why does the earth, what's the mechanism by which the earth pulls the apple or holds the moon when it goes around, whatever it is."}, {"time": 1700, "text": "That's not explained by Newton, even though he has the most successful theory of physics ever went 200 and some years with nobody ever seeing a violation."}, {"time": 1711, "text": "But he accurately describes the movement of an object falling down to earth, but he's not answering why that what's yeah, because it's a distance."}, {"time": 1718, "text": "He gives a formula, which it's a product of the earth's mass, the apple's mass inversely proportional to the square of the distance between and then the strength he called capital G, the strength he couldn't determine, but it was determined 100 years later."}, {"time": 1737, "text": "But no one ever saw a violation of this until a possible violation, which Einstein fixed, which was very small that has to do with mercury going around the sun, the orbit being slightly wrong if you calculate it by Newton's theory."}, {"time": 1756, "text": "But so like most theories then in physics, you can have a wonderful one like Newton's theory."}, {"time": 1765, "text": "It isn't wrong."}, {"time": 1765, "text": "But you have to have an improvement on it to answer things that it can't answer."}, {"time": 1765, "text": "And in this case, Einstein's theory is the next step."}, {"time": 1774, "text": "We don't know if it's anything like a final theory or even the only way to formulate it either."}, {"time": 1781, "text": "But he formulated this theory, which he released in 1915."}, {"time": 1791, "text": "He took 10 years to develop it, even though in 1905, he solved three or four of the most important problems in physics in a matter of months."}, {"time": 1796, "text": "And then he spent 10 years on this problem before he let it out."}, {"time": 1802, "text": "And this is called general relativity."}, {"time": 1802, "text": "It's a new theory of gravity."}, {"time": 1807, "text": "In 1916, Einstein wrote a little paper where he did not do some fancy derivation."}, {"time": 1818, "text": "Instead, he did what I would call he used his intuition, which he was very good at too."}, {"time": 1818, "text": "And that is he noticed that if he wrote the formulas for general relativity in a particular way, they looked a lot like the formulas for electricity and magnetism."}, {"time": 1840, "text": "Being Einstein, he then took the leap that electricity and magnetism, we discovered only 20 years before that in the 1880s, have waves."}, {"time": 1846, "text": "Of course, that's light and electromagnetic waves, radio waves, everything else."}, {"time": 1854, "text": "So he said, if the formulas look similar, then gravity probably has waves too."}, {"time": 1861, "text": "That's such a big leap, by the way."}, {"time": 1861, "text": "I mean, maybe you could go back to the 1880s, maybe you can correct me, but that just seems like a heck of a leap."}, {"time": 1875, "text": "And it was considered to be a heck of a leap."}, {"time": 1875, "text": "So first that paper was, except for this intuition, was poorly written, had a serious mistake."}, {"time": 1882, "text": "It had a factor of two wrong in the strength of gravity, which meant if we use those formulas, we would... And two years later, he wrote a second paper."}, {"time": 1897, "text": "And in that paper, it turns out to be important for us because in that paper, he not only fixed his factor of two mistake, which he never admitted, he just wrote it, fixed it like he always did."}, {"time": 1910, "text": "And then he told us how you make gravitational waves, what makes gravitational waves."}, {"time": 1918, "text": "And you might recall in electromagnetism, we make electromagnetic waves in a simple way."}, {"time": 1925, "text": "You take a plus charge and minus charge, you oscillate like this, and that makes the electromagnetic waves."}, {"time": 1930, "text": "And a physicist named Hertz made a receiver that could detect the waves and put it in the next room."}, {"time": 1936, "text": "He saw them and moved forward and backward and saw that it was wave like."}, {"time": 1942, "text": "So Einstein said, it won't be a dipole like that, it'll be a four pole thing."}, {"time": 1942, "text": "And that's what it's called, it's called a quadrupole moment that gives the gravitational wave."}, {"time": 1950, "text": "So that again, by insight, not by derivation."}, {"time": 1956, "text": "That set the table for what you needed to do to do it."}, {"time": 1956, "text": "At the same time, in the same year, Schwarzschild, not Einstein, said there were things called black holes."}, {"time": 1963, "text": "So it's interesting that that came the same."}, {"time": 1969, "text": "So what year was that?"}, {"time": 1969, "text": "It was in parallel... Well, I should probably know this, but did Einstein not have an intuition that there should be such things as black holes?"}, {"time": 1981, "text": "That came from Schwarzschild."}, {"time": 1987, "text": "So Schwarzschild, who was a German theoretical physicist, he got killed in the war, I think, in the First World War, two years later or so."}, {"time": 1994, "text": "He's the one that proposed black holes, that there were black holes."}, {"time": 2001, "text": "That feels like a natural conclusion of general relativity, no?"}, {"time": 2001, "text": "Or is that not?"}, {"time": 2007, "text": "Well, it may seem like it, but I don't know about a natural conclusion."}, {"time": 2007, "text": "It's a result of curved space time though."}, {"time": 2014, "text": "But it's such a weird result that you might have to..."}, {"time": 2020, "text": "It's a special... Yeah, it's a special case."}, {"time": 2020, "text": "Anyway, Einstein then, an interesting part of the story is that Einstein then left the problem."}, {"time": 2028, "text": "Most physicists, because it really wasn't derived, he just made this, didn't pick up on it or general relativity much because quantum mechanics became the thing in physics."}, {"time": 2041, "text": "And Einstein only picked up this problem again after he immigrated to the US."}, {"time": 2050, "text": "So he came to the US in 1932."}, {"time": 2050, "text": "And I think in 1934 or 1935, he was working with another physicist called Rosen, who he did several important works with, and they revisited the question."}, {"time": 2064, "text": "And they had a problem that most of us as students always had, that study general relativity."}, {"time": 2072, "text": "General relativity is really hard because it's four dimensional instead of three dimensional."}, {"time": 2077, "text": "And if you don't set it up right, you get infinities, which don't belong there."}, {"time": 2082, "text": "We call them coordinate singularities as a name."}, {"time": 2082, "text": "But if you get these infinities, you don't get the answers you want."}, {"time": 2089, "text": "And he was trying to derive now general relativity from general relativity, gravitational waves."}, {"time": 2097, "text": "And in doing it, he kept getting these infinities."}, {"time": 2104, "text": "And so he wrote a paper with Rosen that he submitted to our most important journal, Physical Review Letters."}, {"time": 2110, "text": "And that when it was submitted to Physical Review Letters, it was entitled, Do Gravitational Waves Exist?"}, {"time": 2117, "text": "A very funny title to write 20 years after he proposed they exist."}, {"time": 2124, "text": "But it's because he had found these singularities, these infinities."}, {"time": 2124, "text": "And so the editor at that time, and the part of it that I don't know, is peer review."}, {"time": 2132, "text": "We live and die by peer review as scientists send our stuff out."}, {"time": 2143, "text": "We don't know when peer review actually started or what peer review Einstein ever experienced before this time."}, {"time": 2149, "text": "But the editor of Physical Review sent this out for review."}, {"time": 2155, "text": "He had a choice."}, {"time": 2155, "text": "He could take any article and just accept it."}, {"time": 2162, "text": "He could reject it, or he could send it for review."}, {"time": 2162, "text": "I believe the editors used to have much more power."}, {"time": 2167, "text": "And he was a young man."}, {"time": 2167, "text": "His name was Tate."}, {"time": 2167, "text": "And he ended up being editor for years."}, {"time": 2173, "text": "So he sent this for review to a theoretical physicist named Robertson, who was also in this field of general relativity, who happened to be on sabbatical at that moment at Caltech."}, {"time": 2187, "text": "Otherwise, his institution was Princeton, where Einstein was."}, {"time": 2187, "text": "And he saw that the way they set up the problem, the infinities were like I make it as a student, because if you don't set it up right in general relativity, you get these infinities."}, {"time": 2202, "text": "And so he reviewed the article and gave an illustration that if they set it up in what are called cylindrical coordinates, these infinities went away."}, {"time": 2214, "text": "The editor of Physical Review was obviously intimidated by Einstein."}, {"time": 2223, "text": "He wrote this really not a letter back like I would get saying, you're screwed up in your paper instead."}, {"time": 2228, "text": "It was kind of, what do you think of the comments of our referee?"}, {"time": 2228, "text": "Einstein wrote back, and it's a well documented letter, wrote back a letter to Physical Review saying, I didn't send you the paper to send it to one of your so called experts."}, {"time": 2244, "text": "I sent it to you to publish."}, {"time": 2244, "text": "I withdraw the paper."}, {"time": 2251, "text": "And he never published again in that journal."}, {"time": 2251, "text": "That was 1936."}, {"time": 2251, "text": "Instead, he rewrote it with the fixes that were made, changed the title and published it in what was called the Franklin Review, which is the Franklin Institute in Philadelphia, which is Benjamin Franklin Institute, which doesn't have a journal now, but did at that time."}, {"time": 2276, "text": "So the article is published."}, {"time": 2281, "text": "It's the last time he ever wrote about it."}, {"time": 2281, "text": "It remained controversial."}, {"time": 2281, "text": "So it wasn't until close to 1960, 1958, where there was a conference that brought together the experts in general relativity to try to sort out whether it was true that there were gravitational waves or not."}, {"time": 2309, "text": "And there was a very nice derivation by a British theorist from the heart of the theory that gets gravitational waves."}, {"time": 2320, "text": "And that was number one."}, {"time": 2320, "text": "The second thing that happened at that meeting is Richard Feynman was there."}, {"time": 2326, "text": "And Feynman said, well, if there's typical Feynman, if there's gravitational waves, they need to be able to do something, otherwise they don't exist."}, {"time": 2333, "text": "So they have to be able to transfer energy."}, {"time": 2338, "text": "So he made an idea of a gedankenexperiment that is just a bar with a couple of rings on it."}, {"time": 2345, "text": "And then if a gravitational wave goes through, it distorts the bar and that creates friction on these little rings and that's heat and that's energy."}, {"time": 2351, "text": "So that meant... Is that a good idea?"}, {"time": 2359, "text": "That sounds like a good idea."}, {"time": 2359, "text": "It means that he showed that that with the distortion of space time, you could transfer energy just by this little idea."}, {"time": 2371, "text": "And it was shown theoretically."}, {"time": 2371, "text": "So at that point, it was believed theoretically then by people that gravitational waves should exist."}, {"time": 2379, "text": "No, we should be able to detect them."}, {"time": 2385, "text": "We should be able to detect them, except that they're very, very small."}, {"time": 2389, "text": "And so what kind of, there's a bunch of questions here, but what kind of events would generate gravitational waves?"}, {"time": 2395, "text": "You have to have this, what I call quadrupole moment."}, {"time": 2401, "text": "That comes about if I have, for example, two objects that go around each other like this, like the earth around the sun or the moon around the earth, or in our case, it turns out to be two black holes going around each other like this."}, {"time": 2414, "text": "So how's that different than basic oscillation back and forth?"}, {"time": 2419, "text": "Is it just more common in nature to have... Oscillation is a dipole moment."}, {"time": 2419, "text": "So it has to be in three dimensional space kind of oscillation."}, {"time": 2424, "text": "So you have to have something that's three dimensional that'll give what I called a quadrupole moment."}, {"time": 2427, "text": "That's just built into this."}, {"time": 2432, "text": "And luckily in nature you have stuff... And luckily things exist."}, {"time": 2432, "text": "And it is luckily because the effect is so small that you could say, look, I could take a barbell and spin it, right?"}, {"time": 2443, "text": "And detect the gravitational waves."}, {"time": 2443, "text": "But unfortunately, no matter how much I spin it, how fast I spin it, so I know how to make gravitational waves, but they're so weak, I can't detect them."}, {"time": 2456, "text": "So we have to take something that's stronger than I can make."}, {"time": 2456, "text": "Otherwise we would do what Hertz did for electromagnetic waves."}, {"time": 2461, "text": "Go in our lab, take a barbell, put it on something, spin it."}, {"time": 2467, "text": "Can I ask a dumb question?"}, {"time": 2467, "text": "So a single object that's weirdly shaped, does that generate gravitational waves?"}, {"time": 2473, "text": "So if it's rotating?"}, {"time": 2473, "text": "But it's just a much weaker signal."}, {"time": 2480, "text": "It's weaker."}, {"time": 2480, "text": "Well, we didn't know what the strongest signal would be that we would see."}, {"time": 2486, "text": "We targeted seeing something called neutron stars actually, because black holes we don't know very much about."}, {"time": 2491, "text": "It turned out we were a little bit lucky."}, {"time": 2491, "text": "There was a stronger source, which was the black holes."}, {"time": 2495, "text": "Well, another ridiculous question."}, {"time": 2495, "text": "So you say waves."}, {"time": 2495, "text": "What does a wave mean?"}, {"time": 2503, "text": "Like the most ridiculous version of that question is, what does it feel like to ride a wave as you get closer to the source?"}, {"time": 2512, "text": "Or experience it?"}, {"time": 2512, "text": "Well, if you experience a wave, imagine that this is what happens to you."}, {"time": 2520, "text": "I don't know what you mean about getting close."}, {"time": 2520, "text": "It comes to you."}, {"time": 2520, "text": "So it's like this light wave or something that comes through you."}, {"time": 2526, "text": "So when a light hits you, it makes your eyes detect it."}, {"time": 2532, "text": "I flashed it."}, {"time": 2532, "text": "What does this do?"}, {"time": 2532, "text": "It's like going to the amusement park, and they have these mirrors."}, {"time": 2540, "text": "You look in this mirror and you look short and fat, and the one next to you makes you tall and thin."}, {"time": 2545, "text": "Imagine that you went back and forth between those two mirrors once a second."}, {"time": 2552, "text": "That would be a gravitational wave with a period of once a second."}, {"time": 2552, "text": "If you did it 60 times a second, go back and forth."}, {"time": 2558, "text": "And then that's all that happens."}, {"time": 2558, "text": "It makes you taller and shorter and fatter back and forth as it goes through you at the frequency of the gravitational wave."}, {"time": 2563, "text": "So the frequencies that we detect are higher than one a second, but that's the idea."}, {"time": 2570, "text": "And the amount is small."}, {"time": 2577, "text": "Amount is small, but if you're closer to the source of the wave, is it the same amount?"}, {"time": 2587, "text": "Yeah, it doesn't dissipate."}, {"time": 2587, "text": "It doesn't dissipate."}, {"time": 2587, "text": "Okay, so it's not that fun of an amusement ride."}, {"time": 2594, "text": "Well, it does dissipate, but it's proportional to the distance."}, {"time": 2602, "text": "It's not a big power."}, {"time": 2604, "text": "But it would be a fun ride if you get a little bit closer or a lot closer."}, {"time": 2611, "text": "I mean, I wonder what the..."}, {"time": 2611, "text": "Okay, this is a ridiculous question, but I have you here."}, {"time": 2616, "text": "I mean, the getting fatter and taller, I mean, that experience, for some reason, that's mind blowing to me because it brings the distortion of space time to you."}, {"time": 2624, "text": "I mean, space time is being morphed, right?"}, {"time": 2631, "text": "Like this is a wave."}, {"time": 2637, "text": "That's so weird."}, {"time": 2639, "text": "And we're in space, so we're affected by it."}, {"time": 2641, "text": "Yeah, we're in space and now it's moving."}, {"time": 2643, "text": "I don't know what to do with it."}, {"time": 2643, "text": "I mean, does it..."}, {"time": 2648, "text": "How much do you think about the philosophical implications of general relativity?"}, {"time": 2653, "text": "Like that we're in space time and it can be bent by gravity."}, {"time": 2661, "text": "Like, is that just what it is?"}, {"time": 2661, "text": "Are we supposed to be okay with this?"}, {"time": 2661, "text": "Because like Newton, even Newton is a little weird, right?"}, {"time": 2667, "text": "But that at least like makes sense."}, {"time": 2671, "text": "That's our physical world."}, {"time": 2671, "text": "When an apple falls, it makes sense."}, {"time": 2671, "text": "But the fact that entirety of the space time we're in can bend, that's really mind blowing."}, {"time": 2687, "text": "Let me make another analogy."}, {"time": 2689, "text": "This is a therapy session for me at this point."}, {"time": 2690, "text": "Another analogy."}, {"time": 2693, "text": "So imagine you have a trampoline."}, {"time": 2696, "text": "What happens if you put a marble on a trampoline?"}, {"time": 2702, "text": "Just a little bit, but not much."}, {"time": 2704, "text": "I mean, just if I drop it, it's not going to go anywhere."}, {"time": 2708, "text": "Now imagine I put a bowling ball at the center of the trampoline."}, {"time": 2712, "text": "Now I come up to the trampoline and I put a marble on, what happens?"}, {"time": 2718, "text": "It'll roll towards the bowling ball."}, {"time": 2720, "text": "So what's happened is the presence of this massive object distorted the space that the trampoline did."}, {"time": 2728, "text": "This is the same thing that happens to the presence of the earth, the earth and the apple."}, {"time": 2736, "text": "The presence of the earth affects the space around it, just like the bowling ball on the trampoline."}, {"time": 2743, "text": "This doesn't make me feel better."}, {"time": 2743, "text": "I'm referring from the perspective of an ant walking around on that trampoline."}, {"time": 2747, "text": "Then some guy just dropped a ball and then not only dropped the ball, right?"}, {"time": 2755, "text": "It's not just dropping a bowling ball."}, {"time": 2755, "text": "It's making the ball go up and down or doing some kind of oscillation thing where it's like waves."}, {"time": 2762, "text": "And that's so fundamentally different from the experience on being on flatland and walking around and just finding delicious, sweet things as ant does."}, {"time": 2773, "text": "And it just feels like to me from a human experience perspective, completely, it's humbling."}, {"time": 2780, "text": "It's truly humbling."}, {"time": 2782, "text": "It's humbling, but we see that kind of phenomenon all the time."}, {"time": 2786, "text": "Imagine that you walk up to a still pond."}, {"time": 2793, "text": "Now I throw, you throw a rock in it, what happens?"}, {"time": 2793, "text": "The rock goes in, sinks to the bottom, fine."}, {"time": 2801, "text": "And these little ripples go out and they travel out."}, {"time": 2801, "text": "That's exactly what happens."}, {"time": 2801, "text": "I mean, there's a disturbance, which is these, say, the bowling ball or black holes."}, {"time": 2808, "text": "And then the ripples that go out in the water, they're not, they don't have any, they don't have the rock, any part, pieces of the rock."}, {"time": 2822, "text": "See, the thing is, I guess what's not disturbing about that is it's a, I mean, I guess a flat two dimensional surface that's being disturbed."}, {"time": 2830, "text": "Like for a three dimensional surface, a three dimensional space to be disturbed feels weird."}, {"time": 2839, "text": "It's four dimensional because it's space and time."}, {"time": 2843, "text": "Time, yeah."}, {"time": 2844, "text": "So that's why you need Einstein is to make it four dimensional."}, {"time": 2848, "text": "To make it okay?"}, {"time": 2849, "text": "No, to make it."}, {"time": 2850, "text": "To make it four dimensional?"}, {"time": 2852, "text": "Yeah, to take the same phenomenon and look at it in all of space and time."}, {"time": 2852, "text": "Anyway, luckily for you and I and all of us, the amount of distortion is incredibly small."}, {"time": 2867, "text": "So it turns out that if you think of space itself, now this is going to blow your mind too, if you think of space as being like a material, like this table, it's very stiff."}, {"time": 2874, "text": "You know, we have materials that are very pliable, materials that are very stiff."}, {"time": 2880, "text": "So space itself is very stiff."}, {"time": 2886, "text": "So when gravitational waves come through it, luckily for us, it doesn't distort it so much that it affects our ordinary life very much."}, {"time": 2896, "text": "No, I mean, that's great."}, {"time": 2896, "text": "I thought there was something bad coming."}, {"time": 2899, "text": "No, this is great."}, {"time": 2899, "text": "That's great news."}, {"time": 2899, "text": "So I mean, that, I mean, perhaps we evolved as life on Earth to be such that for us, this particular set of effects of gravitational waves is not that significant."}, {"time": 2912, "text": "Maybe that's why."}, {"time": 2916, "text": "You probably used this effect today or yesterday."}, {"time": 2921, "text": "Did what?"}, {"time": 2922, "text": "So it's pervasive."}, {"time": 2922, "text": "Well, because... You mean gravity or the way, or external?"}, {"time": 2925, "text": "Because I only... Curvature of space and time."}, {"time": 2930, "text": "Curvature of space."}, {"time": 2930, "text": "I only care, a person is a human, right?"}, {"time": 2930, "text": "The gravity of Earth."}, {"time": 2936, "text": "But you use it every day, almost."}, {"time": 2939, "text": "Oh, it's curving."}, {"time": 2941, "text": "It's in this thing."}, {"time": 2941, "text": "Every time it tells you where you are, how does it tell you where you are?"}, {"time": 2947, "text": "It tells you where you are because we have 24 satellites or some number that are going around in space and it asks how long it takes the beam to go to the satellite and come back, the signal, to different ones."}, {"time": 2964, "text": "And then it triangulates and tells you where you are."}, {"time": 2964, "text": "And then if you go down the road, it tells you where you are."}, {"time": 2968, "text": "Do you know that if you did that with the satellites and you didn't use Einstein's equations?"}, {"time": 2976, "text": "You won't get the right answer."}, {"time": 2976, "text": "And in fact, if you take a road that's, say, 10 meters wide, I've done these numbers, and you ask how long you'd stay on the road if you didn't make the correction for general relativity, this thing you're poo pooing, because you're using every day, you'd go off the road in about a minute."}, {"time": 2996, "text": "Well, actually, that might be my problem."}, {"time": 2997, "text": "So you use it."}, {"time": 2997, "text": "So don't poo poo it."}, {"time": 3000, "text": "Well, I think I'm using an Android, so maybe, and the GPS doesn't work that well, so maybe I'm using Newton's physics."}, {"time": 3004, "text": "So I need to upgrade to general relativity."}, {"time": 3004, "text": "So gravitational waves and Einstein had, wait, Feynman really does have a part in the story?"}, {"time": 3017, "text": "Was that one of the first kind of experimental proposed to detect gravitational waves?"}, {"time": 3022, "text": "Well, he did what we call a Godonkin experiment."}, {"time": 3022, "text": "That's a thought experiment."}, {"time": 3025, "text": "Not a real experiment."}, {"time": 3025, "text": "But then after that, then people believe gravitational waves must exist."}, {"time": 3031, "text": "You can kind of calculate how big they are."}, {"time": 3031, "text": "They're tiny."}, {"time": 3031, "text": "And so people started searching."}, {"time": 3037, "text": "The first idea that was used was Feynman's idea, and the very end of it."}, {"time": 3044, "text": "And it was to take a great big, huge bar of aluminum and then put around, and it's made like a cylinder, and then put around it some very, very sensitive detectors so that if a gravitational wave happened to go through it, it would go, and you'd detect this extra strain that was there."}, {"time": 3063, "text": "And that was this method that was used until we came along."}, {"time": 3063, "text": "It wasn't a very good method to use."}, {"time": 3072, "text": "And what was the, so we're talking about a pretty weak signal here."}, {"time": 3076, "text": "Yeah, that's why that method didn't work."}, {"time": 3079, "text": "So what, can you tell the story of figuring out what kind of method would be able to detect this very weak signal of gravitational waves?"}, {"time": 3090, "text": "So remembering what happens when you go to the amusement park, that it's going to do something like stretch this way and squash that way, squash this way and stretch this way."}, {"time": 3098, "text": "We do have an instrument that can detect that kind of thing."}, {"time": 3104, "text": "It's called an interferometer."}, {"time": 3110, "text": "And what it does is it just basically takes, usually light, and the two directions that we're talking about, you send light down one direction and the perpendicular direction."}, {"time": 3124, "text": "And if nothing changes, it takes the same, and the arms are the same length, it just goes down, bounces back."}, {"time": 3130, "text": "And if you invert one compared to the other, they cancel so that nothing happens."}, {"time": 3137, "text": "But if it's like the amusement park and one of the arms got shorter and fatter, so it took longer to go horizontally than it did to go vertically, then when the light comes back, that comes back somewhat out of time."}, {"time": 3150, "text": "And that basically is the scheme."}, {"time": 3150, "text": "The only problem is that that's not done very accurately in general, and we had to do it extremely accurately."}, {"time": 3165, "text": "So what's the difficulty of doing so accurately?"}, {"time": 3172, "text": "So the measurement that we have to do is a distortion in time."}, {"time": 3172, "text": "It's a distortion that's one part in 10 to the 21."}, {"time": 3180, "text": "That's 21 zeros and a one."}, {"time": 3188, "text": "So this is like a delay in the thing coming back?"}, {"time": 3193, "text": "One of them coming back after the other one, but the difference is just one part in 10 to the 21."}, {"time": 3197, "text": "So for that reason, we make it big, let the arms be long."}, {"time": 3197, "text": "Okay, so one part in 10 to the 21."}, {"time": 3206, "text": "In our case, it's kilometers long."}, {"time": 3206, "text": "So we have an instrument that's kilometers in one direction, kilometers in the other."}, {"time": 3214, "text": "How many kilometers are we talking about?"}, {"time": 3214, "text": "Four kilometers."}, {"time": 3217, "text": "Four kilometers in each direction."}, {"time": 3217, "text": "If you take then one part in 10 to the 21, we're talking about measuring something to 10 to the minus 18 meters."}, {"time": 3235, "text": "Now, to tell you how small that is, the proton thing we're made of, which you can't go and grab so easily, is 10 to the minus 15 meters."}, {"time": 3241, "text": "So this is one one thousandth the size of a proton."}, {"time": 3247, "text": "That's the size of the effect."}, {"time": 3247, "text": "Einstein himself didn't think this could be measured."}, {"time": 3253, "text": "We've never seen, actually, he said that."}, {"time": 3253, "text": "But that's because he didn't anticipate modern lasers and techniques that we developed."}, {"time": 3267, "text": "So maybe can you tell me a little bit what you're referring to as LIGO, the Laser Interferometer Gravitational Wave Observatory."}, {"time": 3274, "text": "What is LIGO?"}, {"time": 3274, "text": "Can you just elaborate kind of the big picture view here before I ask you specific questions about it?"}, {"time": 3284, "text": "So in the same idea that I just said, we have two long vacuum pipes, four kilometers long."}, {"time": 3294, "text": "We start with a laser beam and we divide the beam going down the two arms."}, {"time": 3294, "text": "And we have a mirror at the other end, reflects it back."}, {"time": 3303, "text": "It's more subtle, but we bring it back."}, {"time": 3303, "text": "If there's no distortion in space time and the lengths are exactly the same, which we calibrate them to be, then when it comes back, if we just invert one signal compared to the other, they'll just cancel."}, {"time": 3320, "text": "So we see nothing."}, {"time": 3320, "text": "But if one arm got a little bit longer than the other, then they don't come back at exactly the same time."}, {"time": 3326, "text": "They don't exactly cancel."}, {"time": 3331, "text": "That's what we measure."}, {"time": 3331, "text": "So to give a number to it, we have the change of length to be able to do this 10 to the minus 18 meters to one part in 10 to the 12th."}, {"time": 3342, "text": "And that was the big experimental challenge that required a lot of innovation to be able to do."}, {"time": 3355, "text": "You gave a lot of credit to, I think, Caltech and MIT for some of the technical developments within this project."}, {"time": 3362, "text": "Is there some interesting things you can speak to at the low level of some cool stuff that had to be solved?"}, {"time": 3370, "text": "I'm a software engineer, so I have so much more respect for everything done here than anything I've ever done."}, {"time": 3377, "text": "So I'll give you an example of doing mechanical engineering at a better, basically mechanical engineering and geology and maybe at a level."}, {"time": 3395, "text": "So what's the problem?"}, {"time": 3395, "text": "The problem is the following, that I've given you this picture of an instrument that by some magic, I can make good enough to measure this very short distance."}, {"time": 3407, "text": "But then I put it down here, it won't work."}, {"time": 3407, "text": "And the reason it doesn't work is that the Earth itself is moving all over the place all the time."}, {"time": 3414, "text": "You don't realize it, it seems pretty good to you, but it's moving all the time."}, {"time": 3419, "text": "So somehow it's moving so much that we can't deal with it."}, {"time": 3425, "text": "We happen to be trying to do the experiment here on Earth, but we can't deal with it."}, {"time": 3430, "text": "So we have to make the instrument isolated from the Earth at the frequencies we're at."}, {"time": 3436, "text": "We've got to float it."}, {"time": 3436, "text": "That's an engineering problem, not a physics problem."}, {"time": 3444, "text": "So we're having a conversation on a podcast right now, and people who record music work with this, how to create an isolated room."}, {"time": 3452, "text": "And they usually build a room within a room, but that's still not isolated."}, {"time": 3459, "text": "In fact, they say it's impossible to truly isolate from sound, from noise and stuff like that."}, {"time": 3463, "text": "But that's like one step of millions that you took is building a room inside a room, because you basically have to isolate all."}, {"time": 3476, "text": "No, this is actually an easier problem."}, {"time": 3476, "text": "You just have to do it really well."}, {"time": 3476, "text": "So making a clean room is really a tough problem because you have to put a room inside a room."}, {"time": 3482, "text": "This is really simple engineering or physics."}, {"time": 3487, "text": "Okay, so what do you have to do?"}, {"time": 3487, "text": "How do you isolate yourself from the Earth?"}, {"time": 3494, "text": "First, we work at, we're not looking at all frequencies for gravitational waves."}, {"time": 3501, "text": "We're looking at particular frequencies that you can deal with here on Earth."}, {"time": 3506, "text": "So what are frequencies would those be?"}, {"time": 3506, "text": "You were just talking about frequencies."}, {"time": 3514, "text": "We know by evolution, our bodies know, it's the audio band."}, {"time": 3514, "text": "Okay, the reason our ears work where they work is that's where the Earth isn't going, making too much noise."}, {"time": 3525, "text": "Okay, so the reason our ears work the way they work is because this is where it's quiet."}, {"time": 3528, "text": "So if you go to one Hertz instead of 10 Hertz, the Earth is really moving around."}, {"time": 3539, "text": "So somehow we live in what we call the audio band."}, {"time": 3539, "text": "It's tens of Hertz to thousands of Hertz."}, {"time": 3546, "text": "That's where we live, okay?"}, {"time": 3546, "text": "If we're going to do an experiment on the Earth, it's the same frequency."}, {"time": 3554, "text": "That's where the Earth is the quietest."}, {"time": 3554, "text": "So we have to work in that frequency."}, {"time": 3558, "text": "So we're not looking at all frequencies, okay?"}, {"time": 3558, "text": "So the solution for the shaking of the Earth to get rid of it is pretty mundane if we do the same thing that you do to make your car drive smoothly down the road."}, {"time": 3573, "text": "So what happens when your car goes over a bump?"}, {"time": 3573, "text": "Early cars did that, they bounced."}, {"time": 3581, "text": "Okay, but you don't feel that in your car."}, {"time": 3581, "text": "So what happened to that energy?"}, {"time": 3581, "text": "You can't just disappear energy."}, {"time": 3587, "text": "So we have these things called shock absorbers in the car."}, {"time": 3587, "text": "What they do is they take the thing that went like that, and they basically can't get rid of the energy, but they move it to very, very low frequency."}, {"time": 3598, "text": "So what you feel isn't, you feel it go smoothly, okay?"}, {"time": 3608, "text": "So we also work at this frequency."}, {"time": 3608, "text": "So we basically, why don't we have to do anything other than shock absorbers?"}, {"time": 3618, "text": "So we made the world's fanciest shock absorbers, okay?"}, {"time": 3618, "text": "Not just like in your car where there's one layer of them."}, {"time": 3626, "text": "They're just the right squishiness and so forth."}, {"time": 3626, "text": "They're better than what's in the cars."}, {"time": 3630, "text": "And we have four layers of it."}, {"time": 3630, "text": "So whatever shakes and gets through the first layer, we treat it in a second, third, fourth layer."}, {"time": 3635, "text": "So it's a mechanical engineering problem."}, {"time": 3640, "text": "Yeah, that's what I said."}, {"time": 3640, "text": "So it's not, there's no weird tricks to it, like a chemistry type thing."}, {"time": 3646, "text": "Just, well, the right squishiness, you need the right material inside."}, {"time": 3651, "text": "And ours look like little springs, but they're."}, {"time": 3651, "text": "Springs?"}, {"time": 3651, "text": "They're springs?"}, {"time": 3651, "text": "So like legitimately, like shock absorbers."}, {"time": 3658, "text": "And this is now experimental physics at the, at its limit."}, {"time": 3666, "text": "So you do this and we make the world's fanciest shock absorbers, just mechanical engineering."}, {"time": 3671, "text": "Just mechanical engineering, this is hilarious."}, {"time": 3671, "text": "But we didn't, we weren't good enough to discover gravitational waves."}, {"time": 3676, "text": "So we did another, we added another feature and it's something else that you're aware of, probably have one."}, {"time": 3685, "text": "And that is to get rid of noise."}, {"time": 3693, "text": "You've probably noise, which is, you don't like."}, {"time": 3693, "text": "And that's the same principle that's in these little Bose earphones."}, {"time": 3700, "text": "Noise canceling?"}, {"time": 3700, "text": "Noise canceling."}, {"time": 3700, "text": "So how do they work?"}, {"time": 3700, "text": "They basically, you go on an airplane and they sense the ambient noise from the engines and cancel it."}, {"time": 3713, "text": "Cause it's just the same over and over again."}, {"time": 3713, "text": "They cancel it."}, {"time": 3713, "text": "And when the stewardess comes and asks you whether you want coffee or tea or a drink or something, you hear, you're fine because she's not ambient."}, {"time": 3723, "text": "She's the signal."}, {"time": 3723, "text": "Are we talking about active canceling?"}, {"time": 3723, "text": "Like where are the."}, {"time": 3729, "text": "Active canceling."}, {"time": 3729, "text": "This is, okay."}, {"time": 3729, "text": "So another."}, {"time": 3729, "text": "Don't tell me you have active canceling on this."}, {"time": 3736, "text": "Besides the shock absorbers."}, {"time": 3736, "text": "So we had this, so inside this array of shock absorbers."}, {"time": 3742, "text": "We, you asked for some interesting."}, {"time": 3742, "text": "So inside this, it's harder than the, the earphone problem, but it's just engineering."}, {"time": 3749, "text": "We have to see measure, not just that the engine still made noise, but the earth is shaking."}, {"time": 3756, "text": "It's moving in some direction."}, {"time": 3756, "text": "So we have to actually tell not only that there's noise and cancel it, but what direction it's from."}, {"time": 3762, "text": "So we put this array of seismometers inside this array of shock absorbers and measure the residual motion and its direction."}, {"time": 3778, "text": "And we put little actuators that push back against it and cancel it."}, {"time": 3787, "text": "So you have the actuators and you have the thing that is sensing the, the vibrations and then you have the actual actuators that adjust for that and do so in perfect synchrony."}, {"time": 3796, "text": "What if it all works right."}, {"time": 3796, "text": "And so how much do we reduce the shaking of the earth?"}, {"time": 3802, "text": "I mean, one part in 10 to the 12th."}, {"time": 3802, "text": "One part in 10."}, {"time": 3802, "text": "So what gets through us is one part in 10 to the 12th."}, {"time": 3811, "text": "That's pretty big reduction."}, {"time": 3811, "text": "You don't need that in your car, but that's what we do."}, {"time": 3819, "text": "And so that's how isolated we are from the earth."}, {"time": 3819, "text": "And that was the biggest, and that was the biggest, I'd say technical problem outside of the physics instrument, the interferometer."}, {"time": 3829, "text": "Can I ask you a weird question here?"}, {"time": 3829, "text": "You make it very poetically and humorously is saying it's just a mechanical engineering problem, but is this one of the biggest precision mechanical engineering efforts ever?"}, {"time": 3841, "text": "I mean, this seems exceptionally difficult."}, {"time": 3849, "text": "And so it took a long time."}, {"time": 3849, "text": "And I think nobody seems to challenge the statement that this is the most precision, precise instrument it's ever been built, LIGO."}, {"time": 3862, "text": "I wonder what like listening to Led Zeppelin sounds on this thing, because it's so isolated."}, {"time": 3865, "text": "I mean, this is like, I don't know."}, {"time": 3870, "text": "No background."}, {"time": 3870, "text": "No, no back."}, {"time": 3870, "text": "It's wow."}, {"time": 3870, "text": "So when you were first conceiving this, I would probably, if I was knowledgeable enough, kind of laugh off the possibility that this is even possible."}, {"time": 3888, "text": "I'm sure, like how many people believe that this is possible?"}, {"time": 3888, "text": "Did you believe this is possible?"}, {"time": 3894, "text": "I didn't know that we needed, for sure that we needed active."}, {"time": 3894, "text": "When we started, we did dispassive, but we were doing the tests to develop the active to add as a second stage, which we ended up needing."}, {"time": 3908, "text": "But there was a lot of, you know, now there was a lot of skepticism."}, {"time": 3915, "text": "A lot of us, especially astronomers, felt that money was being wasted, because we were also expensive."}, {"time": 3920, "text": "Doing what I told you is not cheap."}, {"time": 3920, "text": "So it was kind of controversial."}, {"time": 3926, "text": "It was funded by the National Science Foundation."}, {"time": 3926, "text": "Can you just linger on this just for a little longer?"}, {"time": 3932, "text": "The actuator thing, the act of canceling."}, {"time": 3932, "text": "Do you remember like little experiments that were done along the way to prove to the team themselves that this is even possible?"}, {"time": 3949, "text": "Because I work with quite a bit of robots, and to me, the idea that you could do it this precisely is humbling and embarrassing, frankly."}, {"time": 3954, "text": "Because like, this is another level of precision that I can't even, because robots are a mess."}, {"time": 3961, "text": "And this is basically one of the most precise robots ever."}, {"time": 3972, "text": "So like, is there, do you have any like small scale experiments that were done that just be like, this is possible?"}, {"time": 3978, "text": "Yeah, and larger scale."}, {"time": 3978, "text": "We made a test, that also has to be in vacuum too, but we made test chambers that had this system in it, our first mock of this system, so we could test it and optimize it and make it work."}, {"time": 3993, "text": "But it's just a mechanical engineering problem."}, {"time": 4001, "text": "And humans are just ape descendants."}, {"time": 4001, "text": "Is there any video of this?"}, {"time": 4001, "text": "Like some kind of educational purpose visualizations of this act of canceling?"}, {"time": 4018, "text": "I mean, does this live on?"}, {"time": 4048, "text": "I mean, at this point, it's a little expensive."}, {"time": 4048, "text": "So you never know, never know where this leads."}, {"time": 4056, "text": "So maybe on the, let me ask you, just sticking it a little longer, this silly old mechanical engineering problem."}, {"time": 4065, "text": "What was to you kind of the darkest moment of what was the hardest stumbling block to get over on the engineer side?"}, {"time": 4073, "text": "Like, was there any time where there's a doubt, where it's like, I'm not sure we would be able to do this, a kind of engineering challenge that was hit?"}, {"time": 4083, "text": "Do you remember anything like that?"}, {"time": 4083, "text": "I think the one that my colleague at MIT, Ray Weiss, worked on so hard and was much more of a worry than this."}, {"time": 4091, "text": "This is only a question if you're not doing well enough, you have to keep making it better somehow."}, {"time": 4098, "text": "But this whole huge instrument has to be in vacuum."}, {"time": 4106, "text": "And the vacuum tanks are, you know, this big around."}, {"time": 4106, "text": "And so it's the world's biggest high vacuum system."}, {"time": 4114, "text": "And how do you make it?"}, {"time": 4114, "text": "First of all, how do you make this four meter long sealed vacuum system?"}, {"time": 4122, "text": "It has to be made out of four kilometers, four kilometers long."}, {"time": 4122, "text": "Would I say something else?"}, {"time": 4128, "text": "Meters."}, {"time": 4128, "text": "Four kilometers long."}, {"time": 4128, "text": "Big difference."}, {"time": 4128, "text": "And so, but to make it, yeah, we started with a roll of stainless steel, and then we roll it out like a spiral so that there's a spiral weld on it."}, {"time": 4144, "text": "Okay, so the engineering was fine."}, {"time": 4144, "text": "We did that."}, {"time": 4144, "text": "We worked through very good companies and so forth to build it."}, {"time": 4154, "text": "But the big worry was, what if you develop a leak?"}, {"time": 4165, "text": "This is a high vacuum, not just vacuum system."}, {"time": 4165, "text": "Typically, in a laboratory, if there's a leak, you put helium around the thing you have, and then you detect where the helium is coming in."}, {"time": 4180, "text": "But if you have something as big as this, you can't surround it with helium."}, {"time": 4180, "text": "So you might not actually even know that there's a leak and it will be affecting it."}, {"time": 4184, "text": "Well, we can measure how good the vacuum is so we can know that, but a leak can develop and then we don't, how do we fix it or how do we find it?"}, {"time": 4198, "text": "And so that was, you asked about a worry."}, {"time": 4198, "text": "That was always a really big worry."}, {"time": 4204, "text": "What's the difference, you know, high vacuum and a vacuum?"}, {"time": 4204, "text": "What is high vacuum?"}, {"time": 4204, "text": "That's like some delta close to vacuum?"}, {"time": 4211, "text": "Is it some threshold?"}, {"time": 4211, "text": "Well, there's a unit."}, {"time": 4211, "text": "High vacuum is when the vacuum and the units that are used, which are tors, there's 10 to the minus nine."}, {"time": 4220, "text": "And there's high vacuum is usually used in small places."}, {"time": 4227, "text": "The biggest vacuum system period is at CERN in this big particle accelerator, but the high vacuum where they need really good vacuum so particles don't scatter in it is smaller than ours."}, {"time": 4240, "text": "So ours is a really large high vacuum system."}, {"time": 4247, "text": "I mean, this is basically by far the greatest listening device ever built by human."}, {"time": 4253, "text": "The fact that like descendants of apes could do this, that evolution started with single cell organisms."}, {"time": 4259, "text": "I mean, is there any more, I'm a huge theory is like, yeah, yeah."}, {"time": 4259, "text": "But like bridges, when I look at bridges from a civil engineering perspective, it's one of the most beautiful creations by human beings."}, {"time": 4271, "text": "You're using physics to construct objects that can support huge amount of mass and it's like structural, but it's also beautiful."}, {"time": 4281, "text": "And that humans can collaborate to create that throughout history."}, {"time": 4281, "text": "And then you take this on another level."}, {"time": 4286, "text": "This is, this is like, it's exciting to me beyond measure that humans can create something so precise."}, {"time": 4295, "text": "But another concept lost in this, you just said, you started talking about single cell."}, {"time": 4301, "text": "You have to realize this discovery that we made that everybody's bought off on happened 1.3 billion years ago, somewhere."}, {"time": 4307, "text": "And then the signal came to us 1.3 billion years ago, we were just converting on the earth from single cell to multi cell life."}, {"time": 4321, "text": "So when this actually happened, this collision of two black holes, we weren't here."}, {"time": 4321, "text": "We weren't even close to developing single."}, {"time": 4327, "text": "Yeah, we were had, we're going from single cell to multi cell life at that point."}, {"time": 4334, "text": "All to meet up at this, at this point."}, {"time": 4334, "text": "That's like, that's almost romantic."}, {"time": 4340, "text": "So on the human side of things, it's kind of fascinating because you're talking about over a thousand people team for LIGO."}, {"time": 4352, "text": "They started out with, you know, around a hundred and you've for parts of the time at least led this team."}, {"time": 4359, "text": "What does it take to lead a team like this of incredibly brilliant theoreticians and engineers and just a lot of different parties involved?"}, {"time": 4376, "text": "A lot of egos, a lot of ideas."}, {"time": 4376, "text": "You had this fun, funny example, I forget where, where in publishing a paper, you have to all agree on like, you know, the phrasing of a certain sentence or the title of the paper and so on."}, {"time": 4390, "text": "That's a very interesting, simple example."}, {"time": 4395, "text": "I'd love you to speak to that, but just in general, how, what does it take to lead this kind of team?"}, {"time": 4400, "text": "I think that the general idea is one we all know."}, {"time": 4400, "text": "You want to, you want to, you want to get where the, the sum of something is more than the individual parts is what we say, right?"}, {"time": 4417, "text": "So that's what you're trying to achieve."}, {"time": 4417, "text": "Actually, mostly if we take multiple objects or people, I mean, you put them together, the sum is less."}, {"time": 4429, "text": "Because they overlap."}, {"time": 4429, "text": "So you don't have individual things that, you know, this person does that, this person does that, then you get exactly the sum."}, {"time": 4436, "text": "But what you want is to develop where you get more than what the individual contributions are."}, {"time": 4442, "text": "We know that's very common."}, {"time": 4447, "text": "People use that expression everywhere."}, {"time": 4447, "text": "And it's the expression that has to be kind of built into how people feel it's working."}, {"time": 4454, "text": "Because if you're part of a team, and you realize that somehow the team is able to do more than the individuals could do themselves, then they buy on kind of in terms of the process."}, {"time": 4467, "text": "So that's the, that's the goal that you have to have is to, to achieve that."}, {"time": 4476, "text": "And that means that you have to realize parts of what you're trying to do that require not that one person couldn't do it, it requires the combined talents to be able to do something that neither of them could do themselves."}, {"time": 4492, "text": "And we have a lot of that kind of thing."}, {"time": 4492, "text": "And I think, I mean, build into the some of the examples that I gave you."}, {"time": 4497, "text": "And so, how do you then, so, so the key almost in anything you do is the people themselves, right?"}, {"time": 4506, "text": "So in our case, the first and most important was to attract to spend years of their life on this."}, {"time": 4512, "text": "And the best possible people in the world to do it."}, {"time": 4520, "text": "So the only way to convince them is that somehow it's better and more interesting for them than what they could do themselves."}, {"time": 4528, "text": "And so that's part of this idea."}, {"time": 4534, "text": "Yeah, that's powerful."}, {"time": 4534, "text": "But nevertheless, there's best people in the world, there's egos."}, {"time": 4534, "text": "Is there something to be said about managing egos?"}, {"time": 4542, "text": "Oh, that's the human problem is always the hardest."}, {"time": 4547, "text": "And so there's, that's an art, not a science, I think."}, {"time": 4547, "text": "I think the fact here that combined, there's a was a romantic goal that we had to, you know, do something that people hadn't done before, which was important scientifically and, and a huge challenge, enabled us to say, take and get, I mean, what we did just to take an example, we use the light to go in this thing comes from lasers."}, {"time": 4584, "text": "We need a certain kind of laser."}, {"time": 4584, "text": "So the kind of laser that we use, there were three different institutions in the world that had the experts that do this, maybe in competition with each other."}, {"time": 4598, "text": "So we got all three to join together and work with us to work on this as an example."}, {"time": 4598, "text": "So that you had, and they had the thing that they were working together on a kind of object that they wouldn't have otherwise."}, {"time": 4611, "text": "And we're part of a bigger team where they could discover something that isn't even engineers."}, {"time": 4617, "text": "These are engineers that do laser."}, {"time": 4617, "text": "So, and they're part of our laser physicists."}, {"time": 4623, "text": "So could you describe the moment or the period of time when finally this incredible creation of human beings led to a detection of gravitational waves?"}, {"time": 4634, "text": "It's a long story."}, {"time": 4634, "text": "Unfortunately, this is a part that we started failures along the way kind of thing or all failures."}, {"time": 4642, "text": "That's all that's built into it."}, {"time": 4648, "text": "If you're not, if you're not mechanical engineering, you build on your failures, that's expected."}, {"time": 4656, "text": "So we're trying things that no one's done before."}, {"time": 4656, "text": "So it's technically not just gravitational waves."}, {"time": 4661, "text": "And so it's built on failures."}, {"time": 4661, "text": "But anyway, we did before me, even there, the people did R&D on the concepts."}, {"time": 4668, "text": "But starting in 1994, we got money from the National Science Foundation to build this thing."}, {"time": 4677, "text": "It took about five years to build it."}, {"time": 4677, "text": "So by 1999, we had built the basic unit."}, {"time": 4686, "text": "It did not have active seismic isolation at that stage, didn't have some other things that we have now."}, {"time": 4693, "text": "What we did at the beginning was stick to technologies that we had at least enough knowledge that we could make work or had tested in our own laboratories."}, {"time": 4707, "text": "And so then we put together the instrument."}, {"time": 4713, "text": "We made it work."}, {"time": 4713, "text": "It didn't work very well, but it worked."}, {"time": 4713, "text": "And we didn't see any gravitational waves."}, {"time": 4721, "text": "Then we figured out what limited us."}, {"time": 4721, "text": "And we went through this every year for almost 10 years, never seeing gravitational waves."}, {"time": 4725, "text": "We would run it, looking for gravitational waves for months, learn what limited us, fix it for months, and then run it again."}, {"time": 4746, "text": "Eventually, we knew we had to take another big step."}, {"time": 4746, "text": "And that's when we made several changes, including adding these active seismic isolation, which turned out to be a key."}, {"time": 4753, "text": "And we fortunately got the National Science Foundation to give us another couple hundred million dollars, 100 million more."}, {"time": 4767, "text": "And we rebuild it or fixed or improved it."}, {"time": 4767, "text": "And then in 2015, we turned it on."}, {"time": 4782, "text": "And we almost instantly saw this first collision of two black holes."}, {"time": 4793, "text": "And then we went through a process of, do we believe what we've seen?"}, {"time": 4798, "text": "Yeah, I think you're one of the people that went through that process."}, {"time": 4798, "text": "It sounds like some people immediately believed it."}, {"time": 4802, "text": "And then you're like..."}, {"time": 4805, "text": "So as human beings, we all have different reactions to almost anything."}, {"time": 4805, "text": "And so quite a few of my colleagues had a eureka moment immediately."}, {"time": 4810, "text": "I mean, the figure that we put in our paper, first is just data."}, {"time": 4820, "text": "We didn't have to go through fancy computer programs to do anything."}, {"time": 4827, "text": "And we show next to it the calculations of Einstein's equations."}, {"time": 4827, "text": "It looks just like what we detected."}, {"time": 4836, "text": "And we did it in two different detectors halfway across the US."}, {"time": 4836, "text": "So it was pretty convincing, but you don't want to fool yourself."}, {"time": 4842, "text": "So being a scientist, for me, we had to go through and try to understand that the instrument itself, which was new, I said we had rebuild it, couldn't somehow generate things that look like this."}, {"time": 4858, "text": "That took some tests."}, {"time": 4858, "text": "And then the second, you'll appreciate more, we had to somehow convince ourselves we weren't hacked in some clever way."}, {"time": 4872, "text": "Cybersecurity question."}, {"time": 4874, "text": "Even though we're not on the internet, but... Yeah."}, {"time": 4878, "text": "No, it can be physical access too."}, {"time": 4878, "text": "It's fascinating that you would think about that."}, {"time": 4883, "text": "I mean, not enough."}, {"time": 4883, "text": "I mean, because it matches prediction."}, {"time": 4883, "text": "So the chances of it actually being manipulated is very, very low."}, {"time": 4894, "text": "But nevertheless... We still could have disgruntled all the graduate students who had worked with us earlier that... Who want you to..."}, {"time": 4903, "text": "I don't know how that's supposed to embarrass you."}, {"time": 4903, "text": "I suppose, yeah."}, {"time": 4903, "text": "I suppose I see."}, {"time": 4908, "text": "But about what I think you said, within a month, you kind of convinced yourself officially."}, {"time": 4915, "text": "Within a month, we convinced ourselves."}, {"time": 4915, "text": "We kept a thousand collaborators quiet during that time."}, {"time": 4921, "text": "Then we spent another month or so trying to understand what we'd seen so that we could do the science with it instead of just putting it out to the world and let somebody else understand that it was two black holes and what it was."}, {"time": 4934, "text": "The fact that a thousand collaborators were quiet is a really strong indication that this is a really close knit team."}, {"time": 4940, "text": "And they're around the world."}, {"time": 4945, "text": "Either strong knit or tight knit or had a strong dictatorship or something."}, {"time": 4955, "text": "Either fear or love."}, {"time": 4955, "text": "You can rule by fear or love."}, {"time": 4955, "text": "You can go back to Machiavelli."}, {"time": 4959, "text": "Well, this is really exciting that that's a success story because it didn't have to be a success story, right?"}, {"time": 4971, "text": "I mean, eventually, perhaps you could say it'll be an event, but it could have taken over a century to get there."}, {"time": 4976, "text": "And it's only downhill now."}, {"time": 4986, "text": "You mean with gravitational waves?"}, {"time": 4986, "text": "Well, now we're off because of the pandemic, but when we turned off, we were seeing some sort of gravitational wave event each week."}, {"time": 5006, "text": "Now we're fixing, we're adding features where it'll probably be when we turn back on next year, it'll probably be one every couple days."}, {"time": 5012, "text": "And they're not all the same."}, {"time": 5012, "text": "So it's learning about what's out there in gravity instead of just optics."}, {"time": 5018, "text": "So it's all great."}, {"time": 5025, "text": "We're only limited by the fantastic thing other than that this is a great field and it's all new and so forth is that experimentally, the great thing is that we're limited by technology and technical limitations, not by science."}, {"time": 5044, "text": "So another really important discovery that was made before ours was what's called the Higgs boson made on the big accelerator at CERN."}, {"time": 5056, "text": "This huge accelerator, they discovered a really important thing."}, {"time": 5063, "text": "We have Einstein's equation, E equals MC squared."}, {"time": 5069, "text": "So energy makes mass or mass can make energy and that's the bomb."}, {"time": 5069, "text": "But the mechanism by which that happens, not vision, but how do you create mass from energy was never understood until there was a theory of it about 70 years ago now."}, {"time": 5088, "text": "And so they discovered it's named after a man named Higgs."}, {"time": 5098, "text": "It's called the Higgs boson."}, {"time": 5098, "text": "And so it was discovered, but since that time, and I worked on those experiments since that time, they haven't been able to progress very much further, a little bit, but not a lot further."}, {"time": 5109, "text": "And the difference is that we're really lucky we're in what we're doing in that there you see this Higgs boson, but there's tremendous amount of other physics that goes on and you have to pick out the needle in the haystack of physics."}, {"time": 5128, "text": "You can't make the physics go away, it's there."}, {"time": 5128, "text": "In our case, we have a very weak signal, but once we get good enough to see it, it's weak compared to where we've reduced the background, but the background is not physics, it's just technology."}, {"time": 5140, "text": "It's getting ourselves better isolated from the Earth or getting a more powerful laser."}, {"time": 5147, "text": "And so since 2015, when we saw the first one, we continually can make improvements that are enabling us to turn this into a real science to do astronomy, a new kind of astronomy."}, {"time": 5163, "text": "It's a little like astronomy."}, {"time": 5163, "text": "Galileo started the field."}, {"time": 5172, "text": "He basically took lenses that were made for classes and he didn't invent the first telescope, but made a telescope, looked at Neptune and saw that it had four moons."}, {"time": 5180, "text": "That was the birth of not just using your eyes to understand what's out there."}, {"time": 5188, "text": "And since that time, we've made better and better telescopes, obviously, and astronomy thrives."}, {"time": 5194, "text": "And in a similar way, we're starting to be able to crawl, but we're starting to be able to do that with gravitational waves."}, {"time": 5201, "text": "And it's going to be more and more that we can do as we can make better and better instruments because, as I say, it's not limited by picking it out of others."}, {"time": 5215, "text": "Yeah, it's not limited by the physics."}, {"time": 5222, "text": "So you have an optimism about engineering that as human progress marches on, engineering will always find a way to build a large enough device, accurate enough device to detect the same thing."}, {"time": 5237, "text": "As long as it's not limited by physics, yeah, they'll do it."}, {"time": 5241, "text": "So you, two other folks and the entire team won the Nobel prize for this big effort."}, {"time": 5254, "text": "There's a million questions I can ask for, but looking back, where does the Nobel prize fit into all of this?"}, {"time": 5269, "text": "If you think hundreds of years from now, I venture to say that people will not remember the winners of a prize, but they'll remember creations like these."}, {"time": 5283, "text": "Maybe I'm romanticizing engineering, but I guess I want to ask how important is the Nobel prize in all of this?"}, {"time": 5290, "text": "Well, that's a complicated question."}, {"time": 5290, "text": "As a physicist, it's something if you're trying to win a Nobel prize, forget it because they give one a year."}, {"time": 5302, "text": "So there's been 200 physicists who have won the Nobel prize since 1900."}, {"time": 5310, "text": "And so things just have to fall right."}, {"time": 5310, "text": "So your goal cannot be to win a Nobel prize."}, {"time": 5320, "text": "It wasn't my dream."}, {"time": 5320, "text": "It's tremendous for science."}, {"time": 5320, "text": "Why the Nobel prize for a guy that made dynamite and stuff is what it is."}, {"time": 5331, "text": "It's a long story, but it's the one day a year where actually the science that people have done is all over the world and so forth."}, {"time": 5338, "text": "Forget about the people again."}, {"time": 5344, "text": "It is really good for science."}, {"time": 5344, "text": "It celebrates science for several days, different fields, chemistry, medicine and so forth."}, {"time": 5354, "text": "And everybody doesn't understand everything about these."}, {"time": 5361, "text": "They're generally fairly abstract, but then it's on the front page of newspapers around the world."}, {"time": 5367, "text": "So it's really good for science."}, {"time": 5367, "text": "It's not easy to get science on the front page of the New York Times."}, {"time": 5372, "text": "It's not there."}, {"time": 5372, "text": "Should be, but it's not."}, {"time": 5372, "text": "And so the Nobel prize is important in that way."}, {"time": 5381, "text": "Otherwise, I have a certain celebrity that I didn't have before."}, {"time": 5381, "text": "And now you get to be a celebrity that advertises science."}, {"time": 5393, "text": "It's a mechanism to remind us how incredible, how much credit science deserves and everything."}, {"time": 5401, "text": "Well, it has a little bit more."}, {"time": 5401, "text": "One thing I didn't expect, which is good, is that we have a government."}, {"time": 5406, "text": "I'm not picking on ours necessarily, but it's true of all governments are not run by scientists."}, {"time": 5416, "text": "In our case, it's run by lawyers and businessmen."}, {"time": 5423, "text": "And at best they may have an aide or something that knows a little science."}, {"time": 5423, "text": "So in all countries hardly take into account science in making decisions."}, {"time": 5442, "text": "And having a Nobel prize, the people in those positions actually listen."}, {"time": 5444, "text": "So you have more influence."}, {"time": 5453, "text": "I don't care whether it's about global warming or what the issue is."}, {"time": 5453, "text": "There's some influence, which is lacking otherwise."}, {"time": 5458, "text": "And people pay attention to what I say."}, {"time": 5458, "text": "If I talk about global warming, they wouldn't have before I had the Nobel prize."}, {"time": 5465, "text": "Yeah, this is very true."}, {"time": 5465, "text": "You're like the celebrities who talk."}, {"time": 5472, "text": "Celebrity has power."}, {"time": 5480, "text": "Singling out people, I mean, on the other side of it, singling out people has all kinds of, whether it's for Academy Awards or for this, have unfairness and arbitrariness and so forth and so on."}, {"time": 5492, "text": "So that's the other side of the coin."}, {"time": 5492, "text": "Just like you said, especially with the huge experimental projects like this, you know, it's a large team and it does the nature of the Nobel prizes."}, {"time": 5505, "text": "It singles out a few individuals to represent the team."}, {"time": 5509, "text": "Nevertheless, it's a beautiful thing."}, {"time": 5509, "text": "What are ways to improve LIGO in the future, increase the sensitivity?"}, {"time": 5517, "text": "I've seen a few ideas that are kind of fascinating."}, {"time": 5517, "text": "Are you interested in them?"}, {"time": 5523, "text": "I'm not speaking about five years."}, {"time": 5523, "text": "Perhaps you could speak to the next five years, but also the next hundred years."}, {"time": 5529, "text": "So let me talk to both the instrument and the science."}, {"time": 5536, "text": "So they go hand in hand."}, {"time": 5536, "text": "I mean, the thing that I said is if we make it better, we see more kinds of weaker objects and we do astronomy."}, {"time": 5541, "text": "We're very motivated to make a new instrument, which will be a big step, the next step, like making a new kind of telescope or something."}, {"time": 5556, "text": "And the ideas of what that instrument should be haven't converged yet."}, {"time": 5556, "text": "There's different ideas in Europe."}, {"time": 5564, "text": "They've done more work to kind of develop the ideas, but they're different from ours and we have ideas."}, {"time": 5572, "text": "But I think over the next few years, we'll develop those."}, {"time": 5572, "text": "The idea is to make an instrument that's at least 10 times better than what we can do with this instrument, 10 times better than that."}, {"time": 5586, "text": "10 times better means you can look 10 times further out."}, {"time": 5586, "text": "10 times further out is a thousand times more volume."}, {"time": 5593, "text": "So you're seeing much, much more of the universe."}, {"time": 5593, "text": "The best way to look at it is to look further out."}, {"time": 5601, "text": "The big change is that if you can see far out, you see further back in history."}, {"time": 5609, "text": "Yeah, you're traveling back in time."}, {"time": 5609, "text": "And so we can start to do what we call cosmology instead of astronomy or astrophysics."}, {"time": 5616, "text": "Cosmology is really the study of the evolution of the universe."}, {"time": 5624, "text": "And so then you can start to hope to get to the important problems having to do with how the universe began, how it evolved and so forth, which we really only study now with optical instruments or electromagnetic waves."}, {"time": 5642, "text": "And early in the universe, those were blocked because it was, basically it wasn't transparent."}, {"time": 5652, "text": "So the photons couldn't get out when everything was too dense."}, {"time": 5658, "text": "What do you think, sorry on this tangent, what do you think an understanding of gravitational waves from earlier in the universe can help us understand about the Big Bang and all that kind of stuff?"}, {"time": 5668, "text": "But it's a non, it's another perspective on the thing."}, {"time": 5668, "text": "Is there some insights you think could be revealed just to help a layman understand?"}, {"time": 5677, "text": "First, we don't understand."}, {"time": 5677, "text": "We use the word Big Bang."}, {"time": 5683, "text": "We don't understand the physics of what the Big Bang itself was."}, {"time": 5690, "text": "So I think, and in the early stage, there were particles and there was a huge amount of gravity and mass being made."}, {"time": 5698, "text": "So I'll say two things."}, {"time": 5698, "text": "One is, how did it all start?"}, {"time": 5698, "text": "How did it happen?"}, {"time": 5698, "text": "I'll give you at least one example that we don't understand what we should understand."}, {"time": 5710, "text": "We don't know why we're here."}, {"time": 5716, "text": "No, we do not."}, {"time": 5716, "text": "I don't mean it philosophically."}, {"time": 5716, "text": "I mean it in terms of physics."}, {"time": 5724, "text": "Now, what do I mean by that?"}, {"time": 5724, "text": "If I go into my laboratory at CERN or somewhere and I collide particles together or put energy together, I make as much anti matter as matter."}, {"time": 5730, "text": "Anti matter then annihilates matter and makes energy."}, {"time": 5738, "text": "So in the early universe, you made somehow a lot of matter and anti matter, but there was an asymmetry."}, {"time": 5749, "text": "Somehow there was more matter and anti matter."}, {"time": 5755, "text": "The matter and anti matter annihilated each other."}, {"time": 5755, "text": "At least that's what we think."}, {"time": 5759, "text": "And there was only matter leftover."}, {"time": 5759, "text": "And we live in a universe that we see this all matter."}, {"time": 5765, "text": "We don't have any idea."}, {"time": 5765, "text": "We have ideas, but we don't have any way to understand that at the present time with the physics that we know."}, {"time": 5772, "text": "Does anti matter have anything like a gravitational field to send signals?"}, {"time": 5779, "text": "So how does this asymmetry of matter and anti matter could be investigated or further understood by observing gravitational fields or weirdnesses in gravitational fields?"}, {"time": 5795, "text": "I think that in principle, if there were anti neutron stars, instead of just neutron stars, we would see different kinds of signals, but it didn't get to that."}, {"time": 5811, "text": "We live in a universe that we've done enough looking because we don't see anti matter, anti protons anywhere, no matter what we look at, that it's all made out of matter."}, {"time": 5821, "text": "There is no anti matter except when we go in our laboratories."}, {"time": 5826, "text": "So, but when we go in our laboratories, we make as much anti matter as matter."}, {"time": 5831, "text": "So there's something about the early universe that made this asymmetry."}, {"time": 5831, "text": "So we can't even explain why we're here."}, {"time": 5836, "text": "That's what I meant."}, {"time": 5836, "text": "Physics wise, not in terms of how we evolved and all that kind of stuff."}, {"time": 5845, "text": "So there might be inklings of some of the physics that gravitational So gravitational waves don't get obstructed like light."}, {"time": 5856, "text": "So I said light only goes to 300,000 years."}, {"time": 5862, "text": "So it goes back to the beginning."}, {"time": 5862, "text": "So if you could study the early universe with gravitational waves, we can't do that yet."}, {"time": 5867, "text": "Then it took 400 years to be able to do that with optical, but but then you can really understand the very, maybe understand the very early universe."}, {"time": 5880, "text": "So in terms of questions like why we're here or what the big bang was, we should be, we can, in principle, study that with gravitational waves."}, {"time": 5890, "text": "So to keep moving in this direction, it's a unique kind of way to understand our universe."}, {"time": 5900, "text": "So you think there's more Nobel prize level ideas to be discovered in relation to I'd be shocked if there, if there isn't, not even going to that, which is a very long range problem."}, {"time": 5911, "text": "But I think that we only see with electromagnetic waves, 4% of what's out there."}, {"time": 5919, "text": "There must be, we looked for things that we knew should be there."}, {"time": 5919, "text": "There should be, I would be shocked if there wasn't physics, objects, science, and with gravity that doesn't show up in everything we do with telescopes."}, {"time": 5938, "text": "So I think we're just limited by not having powerful enough instruments yet to do this."}, {"time": 5950, "text": "Do you have a preference?"}, {"time": 5950, "text": "I keep seeing this E. Lisa idea."}, {"time": 5958, "text": "Is it, do you have a preference for earthbound or space faring mechanisms for?"}, {"time": 5966, "text": "They're complimentary."}, {"time": 5966, "text": "It's a little bit like, it's completely analogous to what's been done in astronomy."}, {"time": 5972, "text": "So astronomy from the time of Galileo was done with visible light."}, {"time": 5982, "text": "The big advances in astronomy in the last 50 years are because we have instruments that look at the infrared, microwave, ultraviolet and so forth."}, {"time": 5986, "text": "So looking at different wavelengths has been important."}, {"time": 5994, "text": "Basically going into space means that we'll look at instead of the audio band, which we look at, as we said on the Earth's surface, we'll look at lower frequencies."}, {"time": 6005, "text": "So it's completely complimentary and it starts to be looking at different frequencies just like we do with astronomy."}, {"time": 6014, "text": "It seems almost incredible to me, engineering wise, just like on earth to send something that's kilometers across into space."}, {"time": 6018, "text": "Is that harder to engineer?"}, {"time": 6025, "text": "It actually is a little different."}, {"time": 6025, "text": "It's three satellites separated by hundreds of thousands of kilometers and they send a laser beam from one to the other."}, {"time": 6032, "text": "And if the triangle changes shape a little bit, they detect that from a graph."}, {"time": 6045, "text": "Did you say hundreds of thousands of kilometers?"}, {"time": 6045, "text": "Sending lasers to each other."}, {"time": 6056, "text": "It's just engineering."}, {"time": 6059, "text": "Is it possible though?"}, {"time": 6059, "text": "Is it doable?"}, {"time": 6063, "text": "That's just incredible because they have to maintain, I mean, the precision here is probably, there might be some more, what is it?"}, {"time": 6071, "text": "Maybe noise is a smaller problem."}, {"time": 6071, "text": "I guess there's no vibration to worry about like seismic stuff."}, {"time": 6076, "text": "So getting away from earth, maybe you get away from seismic stuff."}, {"time": 6083, "text": "Those parts are easier."}, {"time": 6083, "text": "They don't have to measure it as accurately at low frequencies."}, {"time": 6089, "text": "But they have a lot of tough engineering problems."}, {"time": 6093, "text": "In order to detect that the gravitational waves affect things, the sensors have to be what we call free masses, just like ours, are isolated from the earth."}, {"time": 6104, "text": "They have to isolate it from the satellite."}, {"time": 6108, "text": "And that's a hard problem."}, {"time": 6108, "text": "They have to do that pretty, not as well as we have to do it, but very well."}, {"time": 6114, "text": "And they've done a test mission and the engineering seems to be at least in principle in hand."}, {"time": 6120, "text": "This will be in the 2030s."}, {"time": 6126, "text": "2030s?"}, {"time": 6129, "text": "This is incredible."}, {"time": 6129, "text": "Let me ask about black holes."}, {"time": 6137, "text": "So what we're talking about is observing orbiting black holes."}, {"time": 6137, "text": "I saw the terminology of like binary black hole systems."}, {"time": 6148, "text": "Binary black holes."}, {"time": 6149, "text": "Is that the one that's when they're dancing?"}, {"time": 6153, "text": "They're both going around each other, just like the earth around the sun."}, {"time": 6156, "text": "Is that weird that there's black holes going around each other?"}, {"time": 6160, "text": "So the finding binary systems of stars is similar to finding binary systems of... Of black holes."}, {"time": 6166, "text": "Well, they were once stars."}, {"time": 6166, "text": "So we haven't said what a black hole is physically yet."}, {"time": 6175, "text": "What's a black hole?"}, {"time": 6176, "text": "So black hole is first, it's a mathematical concept or a physical concept."}, {"time": 6176, "text": "And that is a region of space."}, {"time": 6183, "text": "So it's simply a region of space where the curvature of space time, meaning the gravitational field is so strong that nothing can get out, including light."}, {"time": 6199, "text": "And there's light gets bent if the space time is warped enough."}, {"time": 6206, "text": "And so even light gets bent around and stays in it."}, {"time": 6206, "text": "So that's the concept of a black hole."}, {"time": 6213, "text": "And maybe you can make..."}, {"time": 6213, "text": "So that's a concept that didn't say how they come about."}, {"time": 6220, "text": "And there could be different ways they come about."}, {"time": 6220, "text": "The ones that we are seeing, we're not sure."}, {"time": 6228, "text": "That's what we're trying to learn now is what they..."}, {"time": 6232, "text": "But the general expectation is that they come..."}, {"time": 6232, "text": "These black holes happen when a star dies."}, {"time": 6242, "text": "So what does that mean that a star dies?"}, {"time": 6242, "text": "A star like our sun basically makes heat and light by fusion."}, {"time": 6248, "text": "It's made up."}, {"time": 6248, "text": "And as it burns, it burns up the hydrogen and then the helium and slowly works its way up to the heavier and heavier elements that are in the star."}, {"time": 6264, "text": "And when it gets up to iron, the fusion process doesn't work anymore."}, {"time": 6270, "text": "And so the stars die and that happens to stars."}, {"time": 6270, "text": "And then they do what's called a supernova."}, {"time": 6277, "text": "What happens then is that a star is a delicate balance between an outward pressure from fusion and light and burning and an inward pressure of gravity trying to pull the masses together."}, {"time": 6291, "text": "Once it burns itself out, it goes and it collapses and that's a supernova."}, {"time": 6297, "text": "When it collapses, all the mass that was there is in a very much smaller space."}, {"time": 6297, "text": "And if a star, if you do the calculations, if a star is big enough, that can create a strong enough gravitational field to make a black hole."}, {"time": 6311, "text": "Our sun won't."}, {"time": 6311, "text": "It's too small."}, {"time": 6317, "text": "Too small."}, {"time": 6319, "text": "And we don't know exactly what, but it's usually thought that a star has to be at least three times as big as our sun to make a black hole."}, {"time": 6326, "text": "But that's the physical way there."}, {"time": 6332, "text": "You can make black holes."}, {"time": 6332, "text": "That's the first explanation that one would give for what we see, but it's not necessarily true."}, {"time": 6341, "text": "We're not sure yet."}, {"time": 6345, "text": "What we see in terms of, for the origins of black holes?"}, {"time": 6348, "text": "No, the black holes that we see in gravitational waves."}, {"time": 6352, "text": "So the, but you're also looking for the ones who are binary solar systems."}, {"time": 6356, "text": "So they're binary systems, but they could have been made from binary stars."}, {"time": 6356, "text": "So there's binary stars around."}, {"time": 6361, "text": "So that's, so that's the first explanation is that that's what they are."}, {"time": 6369, "text": "Other explanations, but what we see has some puzzles."}, {"time": 6369, "text": "This is kind of the way science works, I guess."}, {"time": 6376, "text": "We see heavier ones than up to, we've seen one system that was 140 times the mass of our own sun."}, {"time": 6389, "text": "That's not believed to be possible with the parent being a big star because big stars can only be so big or they are unstable."}, {"time": 6399, "text": "It's just the fact that they live in an environment that makes them unstable."}, {"time": 6409, "text": "So the fact that we see bigger ones, they may be come from something else."}, {"time": 6415, "text": "It's possible that they were made in a different way by little ones eating each other up or maybe they were made or maybe they came with the big bang."}, {"time": 6424, "text": "The prime, what we call primordial, which means they're really different."}, {"time": 6431, "text": "They came from that."}, {"time": 6431, "text": "We don't know at this point if they came with a big bang, then maybe they account for what we call dark matter or some of it."}, {"time": 6441, "text": "Like there was a lot of them if they came with it because there's a lot of dark matter."}, {"time": 6447, "text": "But will gravitational waves give you any kind of intuition about the origin of these oscillating?"}, {"time": 6454, "text": "We think that if we see the distributions enough of them, the distributions of their masses, the distributions of how they're spinning, so we can actually measure when they're going around each other, whether they're spinning like this or whether the whole system has any wobbles."}, {"time": 6475, "text": "So this is now."}, {"time": 6480, "text": "We're doing that."}, {"time": 6481, "text": "And then you're constantly kind of crawling back and back in time."}, {"time": 6484, "text": "And we're crawling back in time and seeing how many there are as we go back."}, {"time": 6484, "text": "And so do they point back."}, {"time": 6490, "text": "So you're like, what is that discipline called, cartography or something?"}, {"time": 6490, "text": "You're like mapping this, the early universe via the lens of gravitational waves."}, {"time": 6501, "text": "Not yet the early universe, but at least back in time."}, {"time": 6504, "text": "Earlier."}, {"time": 6504, "text": "So black holes are this mathematical phenomenon, but they come about in different ways."}, {"time": 6512, "text": "We have a huge black hole at the center of our galaxy and other galaxies."}, {"time": 6512, "text": "Those probably were made some other way."}, {"time": 6519, "text": "We don't know when the galaxies themselves had to do with the formation of galaxies."}, {"time": 6524, "text": "So the fact that we use the word black hole, the origin of black holes might be quite different depending on how they happen."}, {"time": 6530, "text": "They just have to in the end have a gravitational field that will bend everything in."}, {"time": 6541, "text": "How do you feel about black holes as a human being?"}, {"time": 6541, "text": "There's this thing that's nearly infinitely dense, doesn't let light escape."}, {"time": 6546, "text": "Isn't that kind of terrifying?"}, {"time": 6546, "text": "It feels like the stuff in nightmares."}, {"time": 6554, "text": "I think it's an opportunity."}, {"time": 6559, "text": "To do what exactly?"}, {"time": 6561, "text": "So like the early universe is an opportunity."}, {"time": 6561, "text": "If we can study the early universe, we can learn things like I told you."}, {"time": 6566, "text": "And here again, we have an embarrassing situation in physics."}, {"time": 6572, "text": "We have two wonderful theories of physics, one based on quantum mechanics, quantum field theory."}, {"time": 6579, "text": "And we can go to a big accelerator like at CERN and smash particles together and almost explain anything that happens beautifully using quantum field theory and quantum mechanics."}, {"time": 6591, "text": "Then we have another theory of physics called general relativity, which is what we've been talking about most of the time, which is fantastic at describing the things at high velocities, long distances, and so forth."}, {"time": 6602, "text": "So that's not the way it's supposed to be."}, {"time": 6612, "text": "We're trying to create a theory of physics, not two theories of physics."}, {"time": 6618, "text": "So we have an embarrassment that we have two different theories of physics."}, {"time": 6618, "text": "People have tried to make a unified theory, what they call a unified theory."}, {"time": 6622, "text": "You've heard those words for decades."}, {"time": 6628, "text": "They still haven't."}, {"time": 6628, "text": "That's been primarily done theoretically or tried."}, {"time": 6636, "text": "People actively do that."}, {"time": 6636, "text": "My personal belief is that like much of physics, we need some clues."}, {"time": 6644, "text": "So we need some experimental evidence."}, {"time": 6644, "text": "So where is there a place?"}, {"time": 6644, "text": "If we go to CERN and do those experiments, gravitational waves or general relativity don't matter."}, {"time": 6651, "text": "If we go to study our black holes, elementary particle physics doesn't matter."}, {"time": 6656, "text": "We're studying these huge objects."}, {"time": 6662, "text": "So where might we have a place where both phenomena have to be satisfied?"}, {"time": 6669, "text": "An example is black holes."}, {"time": 6669, "text": "Inside black holes."}, {"time": 6669, "text": "So we can't do that today."}, {"time": 6669, "text": "But when I think of black hole, it's a potential treasure chest of understanding the fundamental problems of physics and maybe can give us clues to how we bring to the embarrassment of having two theories of physics together."}, {"time": 6692, "text": "That's my own romantic idea."}, {"time": 6692, "text": "What's the worst that could happen?"}, {"time": 6698, "text": "It's so enticing."}, {"time": 6698, "text": "Just go in and look."}, {"time": 6698, "text": "Do you think, how far are we away from figuring out the unified theory of physics, the theory of everything?"}, {"time": 6710, "text": "Who will solve it?"}, {"time": 6710, "text": "Like what discipline will solve it?"}, {"time": 6710, "text": "I think so little progress has been made without more experimental clues, as I said, that we're just not able to say that we're close without some clues."}, {"time": 6736, "text": "The most popular theory these days that might lead to that is called string theory."}, {"time": 6746, "text": "The problem with string theory is it solves a lot of beautiful mathematical problems we have in physics."}, {"time": 6754, "text": "It's very satisfying theoretically, but it has almost no predictive, maybe no predictive ability because it is a theory that works in 11 dimensions."}, {"time": 6773, "text": "We live in a physical world of three space and one time dimension."}, {"time": 6773, "text": "In order to make predictions in our world with string theory, you have to somehow get rid of these other seven dimensions."}, {"time": 6788, "text": "That's done mathematically by saying they curl up on each other on scales that are too small to affect anything here."}, {"time": 6795, "text": "That's an okay argument, but how you do that is not unique."}, {"time": 6803, "text": "That means if I start with that theory and I go to our world here, I can't uniquely go to it."}, {"time": 6810, "text": "And if I can't, it's not predictive."}, {"time": 6810, "text": "And that's actually a killer."}, {"time": 6817, "text": "That's a killer."}, {"time": 6817, "text": "And string theory is, it seems like from my outsider's perspective has lost favor over the years, perhaps because of this very idea."}, {"time": 6822, "text": "It's a lack of predictive power."}, {"time": 6826, "text": "I mean, that science has to connect to something where you make predictions as beautiful as it might be."}, {"time": 6832, "text": "So I don't think we're close."}, {"time": 6832, "text": "I think we need some experimental clues."}, {"time": 6839, "text": "It may be that information on something we don't understand presently at all, like dark energy or probably not dark matter, but dark energy or something might give us some ideas."}, {"time": 6852, "text": "But I can't envision right now in the short term, meaning the horizon that we can see how we're going to bring these two theories together."}, {"time": 6871, "text": "A kind of a two part question, maybe just asking the same thing in two different ways."}, {"time": 6878, "text": "One question is, do you have hope that humans will colonize the galaxy?"}, {"time": 6878, "text": "So expand out, become a multi planetary species."}, {"time": 6887, "text": "Another way of asking that from a gravitational and a propulsion perspective, do you think we'll come up with ways to travel closer to the speed of light or maybe faster than the speed of light, which would make it a whole heck of a lot easier to expand out into the universe?"}, {"time": 6906, "text": "Well, I think that's very futuristic."}, {"time": 6906, "text": "I think we're not that far from being able to make a one way trip to Mars."}, {"time": 6917, "text": "That's then a question of whether people are willing to send somebody on a one way trip."}, {"time": 6931, "text": "Oh, I think they are."}, {"time": 6931, "text": "There's a lot of the explorers burned bright within our hearts."}, {"time": 6937, "text": "There's a lot of people willing to die for the opportunity to explore new territory."}, {"time": 6942, "text": "So this recent landing on Mars is pretty impressive."}, {"time": 6942, "text": "They have a little helicopter."}, {"time": 6942, "text": "They're going to fly around."}, {"time": 6951, "text": "You can imagine in the not too distant future that you could have, I don't think civilizations colonizing, I can envision, but I can envision something more like the South Pole."}, {"time": 6964, "text": "We haven't colonized Antarctica because it's all ice and cold and so forth."}, {"time": 6972, "text": "But we have stations."}, {"time": 6972, "text": "So we have a station that's self sustaining at the South Pole."}, {"time": 6979, "text": "I've been there."}, {"time": 6984, "text": "Because there's parallels there to go to Mars."}, {"time": 6991, "text": "What's the journey like?"}, {"time": 6993, "text": "The journey involves going."}, {"time": 6993, "text": "The South Pole station is run in the US by the National Science Foundation."}, {"time": 7001, "text": "I went because I was on the National Science Board that runs the National Science Foundation."}, {"time": 7008, "text": "And so you get a VIP trip if you're healthy enough to the South Pole to see it, which I took."}, {"time": 7016, "text": "You fly from the US to Australia to Christchurch in Southern Australia."}, {"time": 7016, "text": "And from there you fly to McMurdo Station, which is on the coast."}, {"time": 7028, "text": "And it's the station with about a thousand people right on the coast of Antarctica."}, {"time": 7033, "text": "It's about a seven or eight hour flight and they can't predict the weather."}, {"time": 7040, "text": "So when I flew from Christchurch to McMurdo Station, they tell you in advance, you do it in a military aircraft, they tell you in advance that they can't predict whether they can land because they have to land on ice."}, {"time": 7057, "text": "And reassuring."}, {"time": 7058, "text": "And so about halfway the pilot got on and said, sorry, this is a, they call it a boomerang flight."}, {"time": 7066, "text": "You know, boomerang goes out and goes back."}, {"time": 7066, "text": "So we had to stay a little while in Christchurch, but then we eventually went to McMurdo Station and then flew to the South Pole."}, {"time": 7079, "text": "The South Pole itself is, when I was there, it was minus 51 degrees."}, {"time": 7079, "text": "That was summer."}, {"time": 7087, "text": "Zero humidity."}, {"time": 7087, "text": "And it's about 11,000 feet altitude because it's never warm enough for anything to melt."}, {"time": 7106, "text": "So it doesn't snow very much, but it's about 11,000 feet of snowpack."}, {"time": 7112, "text": "So you land in a place that's high altitude, cold as could be, and incredibly dry, which means you have a physical adjustment."}, {"time": 7121, "text": "The place itself is fantastic."}, {"time": 7121, "text": "They have this great station there."}, {"time": 7132, "text": "They do astronomy at the South Pole."}, {"time": 7132, "text": "Nature wise, is it beautiful?"}, {"time": 7140, "text": "Or is it like visiting any town?"}, {"time": 7140, "text": "No, it's very small."}, {"time": 7140, "text": "There's only less than a hundred people there."}, {"time": 7145, "text": "Even when I was there, there were about 50 or 60 there."}, {"time": 7153, "text": "And in the winter, there's less, half of that."}, {"time": 7153, "text": "Their winter."}, {"time": 7153, "text": "It gets real cold."}, {"time": 7158, "text": "It gets really cold, yeah."}, {"time": 7158, "text": "But it's a station."}, {"time": 7158, "text": "And I think, and that's, I mean, we haven't gone beyond that."}, {"time": 7168, "text": "On the coast of Antarctica, they have greenhouses and they're self sustaining in McMurdo Station, but we haven't really settled more than that kind of thing in Antarctica, which is a big country or a big plot, a big piece of land."}, {"time": 7180, "text": "So I don't, I can't envision kind of colonizing at people living so much, as much as I can see the equivalent of the South Pole Station."}, {"time": 7204, "text": "Well, in the computing world, there's an idea of backing up your data and then you want to do offsite backup, to make sure that if the whole thing burns, if your whole house burns down, that you can have a backup offsite of the data."}, {"time": 7216, "text": "I think the difference between Antarctica and Mars is Mars is an offsite backup."}, {"time": 7221, "text": "That if we have nuclear war, whatever the heck might happen here on earth, it'd be nice to have a backup elsewhere."}, {"time": 7232, "text": "And it'd be nice to have a large enough colony where we sent a variety of people except a few silly astronauts in suits, have an actual vibrant, get a few musicians and artists up there, get a few, maybe like one or two computer scientists, those are essential."}, {"time": 7253, "text": "Maybe even a physicist, but I'm not sure."}, {"time": 7256, "text": "Yeah, maybe not."}, {"time": 7256, "text": "So that comes back to something you talked about earlier, which is the paradox, Fermi's paradox, because you talked about having to escape."}, {"time": 7262, "text": "And so one number you don't know how to use in Fermi's calculation or Drake, who's done it better, is how long do civilizations last?"}, {"time": 7275, "text": "We've barely gotten to where we can communicate with electricity and magnetism and maybe we'll wipe ourselves out pretty soon."}, {"time": 7288, "text": "Are you hopeful in general?"}, {"time": 7288, "text": "Like you think we've got another couple of hundred years at least?"}, {"time": 7292, "text": "Or are you worried?"}, {"time": 7295, "text": "Well, no, I'm hopeful, but I don't know if I'm hopeful in the longterm."}, {"time": 7295, "text": "If you say, are we able to go for another couple of thousand years?"}, {"time": 7307, "text": "I think we have where we started, the fact that we can do things that don't allow us to kind of keep going or there can be, whether it ends up being a virus that we create or ends up being the equivalent of nuclear war or something else."}, {"time": 7326, "text": "It's not clear that we can control things well enough."}, {"time": 7333, "text": "So speaking of really cold conditions and not being hopeful and eventual suffering and destruction of the human species, let me ask you about Russian literature."}, {"time": 7340, "text": "You mentioned, how's that for transition?"}, {"time": 7346, "text": "I'm doing my best here."}, {"time": 7346, "text": "You mentioned that you used to love literature when you were younger and you even were hoping to be a writer yourself."}, {"time": 7350, "text": "That was the motivation."}, {"time": 7356, "text": "And some of the books I've seen that you listed that were inspiring to you was from Russian literature, like Tolstoy, Dostoevsky, Solzhenitsyn."}, {"time": 7363, "text": "Maybe in general you can speak to your fascination with Russian literature or in general what you picked up from those."}, {"time": 7378, "text": "I'm not surprised you picked up on the Russian literature, your background, but that's okay."}, {"time": 7388, "text": "You should be surprised I didn't make the entire conversation about this."}, {"time": 7388, "text": "That's the real surprise."}, {"time": 7393, "text": "When I didn't really become a physicist or want to go in science until I started college."}, {"time": 7404, "text": "So when I was younger, I was good at math and that kind of stuff, but I didn't really, I came from a family, nobody went to college and I didn't have any mentors."}, {"time": 7409, "text": "But I liked to read when I was really young."}, {"time": 7416, "text": "And so when I was very young, I always carried around a pocket book and read it."}, {"time": 7422, "text": "And my mother read these mystery stories and I got bored by those eventually."}, {"time": 7429, "text": "And then I discovered real literature."}, {"time": 7429, "text": "I don't know what age, but about 12 or 13."}, {"time": 7435, "text": "And so then I started reading good literature and there's nothing better than Russian literature, of course."}, {"time": 7442, "text": "Reading good literature."}, {"time": 7442, "text": "So I read quite a bit of Russian literature at that time."}, {"time": 7442, "text": "And so you asked me about, well, I don't know, I'll say a few words, Dostoevsky."}, {"time": 7456, "text": "So what about Dostoevsky?"}, {"time": 7462, "text": "For me, Dostoevsky was important in two, I mean, I've read a lot of literature because it's kind of the other thing I do with my life."}, {"time": 7473, "text": "And he made two incredible, in addition to his own literature, he influenced literature tremendously by having, I don't know how to pronounce polyphony."}, {"time": 7486, "text": "So he's the first real serious author that had multiple narrators."}, {"time": 7493, "text": "And he absolutely is the first."}, {"time": 7493, "text": "And he also was the first, he began existential literature."}, {"time": 7505, "text": "So the most important book that I've read in the last year when I've been forced to be isolated was existential literature."}, {"time": 7512, "text": "I decided to reread Camus, The Plague."}, {"time": 7520, "text": "That's a great book."}, {"time": 7523, "text": "It's a great book and it's right now to read it."}, {"time": 7526, "text": "I think that book is about love, actually."}, {"time": 7526, "text": "Love for humanity."}, {"time": 7530, "text": "It is, but it has all the, if you haven't read it in recent years, I had read it before, of course, but to read it during this, because it's about a plague."}, {"time": 7537, "text": "So it's really fantastic to read down."}, {"time": 7543, "text": "But that reminds me of, he was a great existentialist, but the beginning of existential literature was Dostoevsky."}, {"time": 7550, "text": "Dostoevsky, yeah."}, {"time": 7551, "text": "So in addition to his own great novels, he had a tremendous impact on literature."}, {"time": 7560, "text": "And there's also for Dostoevsky, unlike most other existentialists, he was at least in part religious."}, {"time": 7566, "text": "I mean, religiosity permeated his idea."}, {"time": 7566, "text": "I mean, one of my favorite books of his is The Idiot, which is a Christlike figure in there."}, {"time": 7576, "text": "Well, there's Prince Mishkin, is that his name?"}, {"time": 7579, "text": "Prince Mishkin, yeah."}, {"time": 7583, "text": "That's one thing about, you read it in English, I presume."}, {"time": 7586, "text": "So the names, that's what gets a lot of people."}, {"time": 7586, "text": "There's so many names, so hard to pronounce."}, {"time": 7590, "text": "You have to remember all of them."}, {"time": 7590, "text": "It's like you have the same problem."}, {"time": 7595, "text": "But he was a great character."}, {"time": 7598, "text": "I kind of have a connection with him, because I often, the title of the book, The Idiot, is I kind of, I often call myself an idiot, because that's how I feel."}, {"time": 7607, "text": "I feel so naive about this world."}, {"time": 7612, "text": "And I'm not sure, I'm not sure why that is."}, {"time": 7612, "text": "Maybe it's genetic or so on."}, {"time": 7619, "text": "But I have a connection, a spiritual connection to that character."}, {"time": 7625, "text": "To Mishkin."}, {"time": 7626, "text": "To Mishkin, yeah."}, {"time": 7627, "text": "But he was far from an idiot."}, {"time": 7630, "text": "No, in some sense, in some sense."}, {"time": 7630, "text": "But in another sense, maybe not of this world."}, {"time": 7637, "text": "In another sense he was."}, {"time": 7637, "text": "I mean, he was a bumbler, a bunker."}, {"time": 7643, "text": "But you also mentioned Solzhenitsyn, very interesting."}, {"time": 7648, "text": "And he always confused me."}, {"time": 7648, "text": "Of course, he was really, really important in writing about Stalin, and first getting in trouble, and then later he wrote about Stalin in a way, I forget what the book was, in a way that was very critical of Lenin."}, {"time": 7675, "text": "Yeah, he's evolved through the years, and he actually showed support for Putin eventually."}, {"time": 7680, "text": "It was a very interesting transition he took, no, journey he took through thinking about Russia and the Soviet Union."}, {"time": 7688, "text": "But I think what I get from him is basic, it's like Viktor has this man's search for meaning."}, {"time": 7697, "text": "I have a similar kind of sense of the cruelty of human nature, cruelty of indifference, but also the ability to find happiness in the small joys of life."}, {"time": 7711, "text": "That's something, there's nothing like a prison camp that makes you realize you could still be happy with a very, very little."}, {"time": 7721, "text": "Yeah, his description of how to go through a day and actually enjoy it in a prison camp is pretty amazing."}, {"time": 7730, "text": "And some prison camp, it's the worst of the worst."}, {"time": 7736, "text": "And also, I do think about the role of authoritarian states in hopeful idealistic systems somehow leading to the suffering of millions."}, {"time": 7749, "text": "And this might be arguable, but I think a lot of people believe that Stalin, I think, genuinely believed that he's doing good for the world."}, {"time": 7764, "text": "And he wasn't."}, {"time": 7764, "text": "It's a very valuable lesson that even evil people think they're doing good."}, {"time": 7772, "text": "Otherwise, it's too difficult to do the evil."}, {"time": 7772, "text": "The best way to do evil is to believe about framing it in a way like you're doing good."}, {"time": 7778, "text": "And then this is a very clear picture of that, which is the gulags."}, {"time": 7784, "text": "And Solzhenitsyn is one of the best people to reveal that."}, {"time": 7793, "text": "The most recent thing I read, it isn't actually fiction, was the woman, I can't remember her name, who got the Nobel Prize about within the last five years."}, {"time": 7798, "text": "I don't know whether she's Ukrainian or Russian, but there are interviews."}, {"time": 7804, "text": "Have you read that?"}, {"time": 7809, "text": "Interview of Ukrainian survivors of... Well, I think she may be originally Ukrainian."}, {"time": 7812, "text": "The book's written in Russian and translated in English, and many of the interviews are in Moscow and places."}, {"time": 7818, "text": "But she won the Nobel Prize within the last five years or so."}, {"time": 7823, "text": "But what's interesting is that these are people of all different ages, all different occupations and so forth, and they're reflecting on their reaction to basically the present Soviet system, the system they lived with before."}, {"time": 7845, "text": "There's a lot of looking back by a lot of them with, well, it being much better before."}, {"time": 7857, "text": "I don't know what..."}, {"time": 7857, "text": "In America, we think we know the right answer, what it means to be, to build a better world."}, {"time": 7865, "text": "I think we're all just trying to figure it out."}, {"time": 7872, "text": "Yeah, there's... We're doing our best."}, {"time": 7877, "text": "Is there advice you can give to young people today, besides reading Russian literature at a young age, about how to find their way in life, how to find success in Korea or just life in general?"}, {"time": 7897, "text": "My own belief, it may not be very deep, but I believe it."}, {"time": 7897, "text": "I think you should follow your dreams and you should have dreams and follow your dreams if you can, to the extent that you can."}, {"time": 7908, "text": "And we spend a lot of our time doing something with ourselves."}, {"time": 7908, "text": "In my case, physics, in your case, I don't know, whatever it is, machine learning and this."}, {"time": 7915, "text": "Yeah, you should have fun."}, {"time": 7925, "text": "What was..."}, {"time": 7925, "text": "Follow your dreams."}, {"time": 7925, "text": "What dream did you have?"}, {"time": 7925, "text": "Because there's... Well, originally, I was... Because you didn't follow your dream."}, {"time": 7934, "text": "I thought you were supposed to be a writer."}, {"time": 7936, "text": "I changed along the way."}, {"time": 7936, "text": "I was gonna be, but I changed."}, {"time": 7941, "text": "That was... What happened?"}, {"time": 7941, "text": "Oh, I read..."}, {"time": 7941, "text": "I decided to take the most serious literature course in my high school, which was a mistake."}, {"time": 7948, "text": "I'd probably be a second rate writer now."}, {"time": 7954, "text": "And... Could be a Nobel Prize winning writer."}, {"time": 7957, "text": "And the book that we read, even though I had read Russian novels, I was 15, I think, cured me from being a novelist."}, {"time": 7973, "text": "Destroyed your dream?"}, {"time": 7975, "text": "Cured you."}, {"time": 7975, "text": "What was the book?"}, {"time": 7976, "text": "Moby Dick."}, {"time": 7978, "text": "So, why Moby Dick?"}, {"time": 7981, "text": "So, I've read it since, and it's a great novel."}, {"time": 7981, "text": "Maybe it's as good as the Russian novels."}, {"time": 7987, "text": "I've never made it through."}, {"time": 7987, "text": "It was too boring."}, {"time": 7987, "text": "It was too long."}, {"time": 7991, "text": "Your words are gonna mesh with what I say."}, {"time": 7995, "text": "And you may have the same problem at older ages."}, {"time": 7997, "text": "That's why I'm not a writer."}, {"time": 7999, "text": "It may be."}, {"time": 7999, "text": "So, the problem is, Moby Dick is... What I remember was there was a chapter that was maybe 100 pages long, all describing this, why there was Ahab and the white whale, and it was the battle between Ahab with his wooden peg leg and the white whale."}, {"time": 8019, "text": "And there was a chapter that was 100 pages long in my memory, I don't know how long it really was, that described in detail, though, great white whale and what he was doing and what his fins were like and this and that."}, {"time": 8032, "text": "And it was so incredibly boring, the word you used, that I thought, if this is great literature, screw it."}, {"time": 8041, "text": "And now, why did I have a problem?"}, {"time": 8041, "text": "I know now in reflection, because I still read a lot, and I read that novel after I was 30 or 40 years old, and the problem was simple."}, {"time": 8058, "text": "I diagnosed what the problem was."}, {"time": 8058, "text": "That novel, in contrast to the Russian novels, which are very realistic and point of view, is one huge metaphor."}, {"time": 8072, "text": "At 15 years old, I probably didn't know the word, and I certainly didn't know the meaning of metaphor."}, {"time": 8078, "text": "Yeah, like, why do I care about a fish?"}, {"time": 8078, "text": "Why are you telling me all about this fish?"}, {"time": 8082, "text": "It's one big metaphor."}, {"time": 8082, "text": "So, reading it later as a metaphor, I could really enjoy it."}, {"time": 8087, "text": "But the teacher gave me the wrong book, or maybe it was the right book because I went into physics."}, {"time": 8091, "text": "But it was truly, I think, I may oversimplify, but it was really that I was too young to read that book."}, {"time": 8099, "text": "Not too young to read the Russian novels, interestingly, but too young to read that because I probably didn't even know the word, and I certainly didn't understand it as a metaphor."}, {"time": 8110, "text": "Well, in terms of fish, I recommend people read Old Man and the Sea, much shorter, much better."}, {"time": 8115, "text": "It's still a metaphor, though."}, {"time": 8115, "text": "But you can read it just as a story about a guy catching a fish, and it's still fun to read."}, {"time": 8121, "text": "I had the same experience as you, not with Moby Dick, but later in college, I took a course on James Joyce."}, {"time": 8129, "text": "Don't ask me why."}, {"time": 8129, "text": "I was majoring in computer science, I took a course on James Joyce."}, {"time": 8134, "text": "And I was kept being told that he is widely considered, by many considered, to be the greatest literary writer of the 20th century."}, {"time": 8146, "text": "And I kept reading, I think, so his short story is The Dead, I think it's called."}, {"time": 8152, "text": "It was very good."}, {"time": 8152, "text": "Well, not very good, but pretty good."}, {"time": 8152, "text": "And then Ulysses."}, {"time": 8157, "text": "It's actually very good."}, {"time": 8158, "text": "It is very good."}, {"time": 8158, "text": "Only The Dead, the final story, it still rings with me today."}, {"time": 8158, "text": "But then Ulysses was, I got through Ulysses with the help of some Cliff Notes and so on."}, {"time": 8162, "text": "And so I did Ulysses and then Finnegan's Wake."}, {"time": 8169, "text": "The moment I started Finnegan's Wake, I said, this is stupid."}, {"time": 8174, "text": "That's when I went full into like, I don't know, that's when I went full Kafka, Bukowski, like people who just talk about the darkness of the human condition in the fewest words possible and without any of the music of language."}, {"time": 8188, "text": "So it was a turning point as well."}, {"time": 8196, "text": "I wonder when is the right time to appreciate the beauty of language."}, {"time": 8205, "text": "Like even Shakespeare."}, {"time": 8205, "text": "I was very much off put by Shakespeare in high school and only later I started to appreciate its value in the same way."}, {"time": 8215, "text": "I mean, because you've read Russian literature, let me ask this one last question."}, {"time": 8224, "text": "I might be lying."}, {"time": 8224, "text": "There might be a couple more, but what do you think is the meaning of this whole thing?"}, {"time": 8230, "text": "You got a Nobel prize for looking out into the, trying to reach back into the beginning of the universe, listening to the gravitational waves, but that still doesn't answer the why."}, {"time": 8244, "text": "Beyond just the matter and anti matter, the philosophical question."}, {"time": 8255, "text": "The philosophical question about the meaning of life, I'm probably not really good at."}, {"time": 8262, "text": "I think that the individual meaning, I would say it rather simplistically is whether you've made a difference, a positive difference, I'd say for anything besides yourself."}]}]