[{"title": "Sarma Melngailis: Bad Vegan, Fraud, Prison, and Sociopathy | Lex Fridman Podcast #288", "id": "iZjby1LkTWQ", "quotes": [{"time": 316, "text": "I don't know, just a lot of famous people."}, {"time": 324, "text": "But then one day Hunter S. Thompson came to speak and that was the only one I attended."}, {"time": 329, "text": "That was the only interesting person who came to speak on the campus that I attended, was Hunter S. Thompson."}, {"time": 333, "text": "And he had a glass of whatever it was, whiskey."}, {"time": 340, "text": "And I don't remember a whole lot about it, but it was entertaining."}, {"time": 344, "text": "And yeah, I mean, later in his life, he started making less and less sense, but he was still somehow embodying the crazy that he represented throughout his life."}, {"time": 348, "text": "The boldness, the fearlessness, the wildness, all that kind of stuff."}, {"time": 354, "text": "And we'll talk about Johnny Depp a little bit too."}, {"time": 358, "text": "Funny enough, there's like a echo."}, {"time": 358, "text": "Obviously, Johnny Depp played him, or he starred in a film, Unloathing, and they hung out together."}, {"time": 365, "text": "And it just seemed to somehow, like the universe rhymes in these two individuals."}, {"time": 370, "text": "They're both madmen in different kinds of ways."}, {"time": 376, "text": "So you also told me that Leon the Professional is one of your favorite films."}, {"time": 376, "text": "It's also the reason you named your dog Leon."}, {"time": 383, "text": "So what do you find beautiful and powerful about this film?"}, {"time": 389, "text": "I've watched it a bunch of times, but it's been a while since I've watched it."}, {"time": 393, "text": "So for people who haven't watched it, there's a guy named Leon played by Jean Reno."}, {"time": 393, "text": "There's a young girl, I don't know, 13, 14, Matilda played by Natalie Portman."}, {"time": 401, "text": "And she's abused."}, {"time": 410, "text": "She has a really hard life."}, {"time": 410, "text": "Her parents are, spoiler alert, murdered."}, {"time": 410, "text": "And then she finds protection under this fella, Leon, who also happens to be a professional assassin."}, {"time": 430, "text": "And he is also kind of a Forrest Gump type character."}, {"time": 430, "text": "Like he's a really simple, simple human."}, {"time": 436, "text": "He almost, he seems to be like the immature one or like rather the one who's young."}, {"time": 436, "text": "And she seems to have a wisdom far beyond her age because of the hard life she had to live through."}, {"time": 443, "text": "And then they're here huddling together from the cruelty of the world and finding connection."}, {"time": 457, "text": "Yeah, I think it's one of those films where there's so many interesting things about it, but I'm sure one of them is just the contradiction of him being a caring person and reluctant to get attached to her."}, {"time": 469, "text": "He tries to, I think he knows he's very reluctant to get attached to her in the beginning."}, {"time": 474, "text": "And so you see all of his humanity, but yet he's also an assassin that kills people."}, {"time": 484, "text": "And I think probably a psychoanalyst would have a field day with why I like that movie so much."}, {"time": 489, "text": "And I haven't gone there myself, but there's something I think about she, even in the brief part that depicts her in the beginning, it seems clear that she's sort of out of place in her family."}, {"time": 503, "text": "And then, yeah, there's all kinds of interesting things about their relationship along the way."}, {"time": 512, "text": "What I like about that movie, and I had to think about it recently because I've read stuff about it that bothered me."}, {"time": 517, "text": "Or it bothered me the fact that I haven't really thought about it before."}, {"time": 524, "text": "For people who haven't watched the movie, so here's a young underage girl who kind of comes on to him."}, {"time": 529, "text": "First of all, I think she actually just doesn't know what like familial love is."}, {"time": 537, "text": "So this is the only way she knows how to express love."}, {"time": 537, "text": "And two is, a lot of bad people in this world would take advantage of that."}, {"time": 545, "text": "And the fact that she finally met a human being who doesn't, and is just there to protect her."}, {"time": 555, "text": "That's a real sort of, I don't know, a powerful statement of what it means to be sort of like a father figure, I suppose, a protector."}, {"time": 570, "text": "So that, that to me, I love the idea of being sort of the protector."}, {"time": 570, "text": "That there's something, like something worthwhile in this world to protect amidst all the cruelty that's all around."}, {"time": 586, "text": "That's a beautiful kind of, you're basically saving this young human's, or you're repairing this young human's path to love, to real love in life."}, {"time": 596, "text": "Because that idea of love was destroyed for her."}, {"time": 608, "text": "Just family, everything is sort of, everything around her is broken."}, {"time": 608, "text": "And he's kind of repairing it by reestablishing what that kind of love can be."}, {"time": 622, "text": "And the plant."}, {"time": 622, "text": "They saved the plant also."}, {"time": 627, "text": "Well, there's also just a simple, the simplicity of the film, just from a cinematic perspective, is beautiful."}, {"time": 632, "text": "The music, the way it looks, the minimalism."}, {"time": 636, "text": "Even the violence was beautiful."}, {"time": 639, "text": "Yeah, violence."}, {"time": 639, "text": "It was over the top."}, {"time": 639, "text": "And also the bad guy, the bad cop, played by Gary Oldman."}, {"time": 649, "text": "Yeah, he was amazing."}, {"time": 650, "text": "Yeah, I think he was listening to Beethoven or something like that."}, {"time": 650, "text": "And he was taking some sort of pills and drugs of some kind."}, {"time": 655, "text": "And so there was a kind of, like it's part of the orchestra, like the violence was part of the, of some kind of musical creation."}, {"time": 668, "text": "Yeah, it's interesting because I turn away from violence or films usually that have violence or TV or anything that has that sort of element to it, except in certain cases where... Where the violence is beautiful."}, {"time": 686, "text": "Or did you see the movie True Romance?"}, {"time": 693, "text": "That's my second favorite movie."}, {"time": 695, "text": "Okay, that's probably my favorite movie."}, {"time": 697, "text": "Oh, well, interesting."}, {"time": 700, "text": "That's a more simple kind of love, but also with the violence that is beautiful, I suppose you could say."}, {"time": 706, "text": "And my favorite scene is the one with Patricia Arquette and James Gandolfini."}, {"time": 712, "text": "Oh yeah, where she, there's a shotgun involved."}, {"time": 717, "text": "It actually makes me cry every time I see it, for some reason."}, {"time": 721, "text": "So for people who haven't seen the film, I think, I think he's actually, I think he's hitting her or like there's blood and violence and so on because she's resisting being murdered."}, {"time": 738, "text": "Oh yeah, there's a lot of, yeah, there's a lot of violence."}, {"time": 738, "text": "And then, you know, he throws her into the glass, the shower thing, and she's all cut up and beat up and... Oh, and she laughs."}, {"time": 750, "text": "Yeah, there's just so much passion in it."}, {"time": 750, "text": "She knows she's going to, or in that moment she knows or thinks she knows that she's going to die anyway, because she knows he's going to kill her."}, {"time": 762, "text": "So she kind of gives it her, gives it all she has."}, {"time": 766, "text": "But she also just has guts, she's not afraid."}, {"time": 770, "text": "Well, and also she's, you know, she loves Clarence."}, {"time": 775, "text": "The love comes through through that violence."}, {"time": 778, "text": "Just like Clarence, her fella in that film has the same kind of thing when he visits... Well, it was Gary Oldman again."}, {"time": 788, "text": "It was Gary Oldman again."}, {"time": 788, "text": "The pimp."}, {"time": 790, "text": "Looking very different."}, {"time": 791, "text": "Drexel."}, {"time": 792, "text": "Drexel, yeah."}, {"time": 793, "text": "And he's also fearless in that interaction saying she's now mine."}, {"time": 798, "text": "That movie is so romantic."}, {"time": 798, "text": "And happy ending, spoiler alert, in a way."}, {"time": 804, "text": "That's what I like about it too, because I feel like some movies should come with..."}, {"time": 808, "text": "I don't want to watch a movie if it's going to be devastating, usually, unless it's worthwhile in some other way, but I'm kind of sensitive and I don't want..."}, {"time": 817, "text": "I don't like movies that have a terrible ending, you know?"}, {"time": 817, "text": "I mean, there's a book I read because it got so many good reviews, and the very last scene the woman steps in front of a train and it was like..."}, {"time": 829, "text": "So, I'm partial to movies with happy endings."}, {"time": 832, "text": "Leon ends with loss, Leon, the movie."}, {"time": 838, "text": "Right, but it's still inspiring."}, {"time": 840, "text": "A love persists in some kind of form."}, {"time": 844, "text": "She persists."}, {"time": 848, "text": "Okay, sure, sure."}, {"time": 848, "text": "True Romance does have one of the..."}, {"time": 852, "text": "I mean, it's probably unhealthy."}, {"time": 854, "text": "That ending scene is just amazing."}, {"time": 856, "text": "You're so cool when you're in the movie."}, {"time": 858, "text": "You're so cool where she... Is that one the one where she just kind of looks at Clarence and her son and child or whatever and she's saying, you're so cool, you're so cool."}, {"time": 873, "text": "I just thought that movie has so much in it because it's, you know, it's funny and there's so many good actors in that film."}, {"time": 881, "text": "And Brad Pitt plays in that film a pivotal role of Pothead on couch."}, {"time": 887, "text": "Yeah, they're all so good and funny."}, {"time": 890, "text": "And Michael Rapaport and even Val Kilmer, people don't realize he's in the movie because he doesn't look like himself."}, {"time": 897, "text": "Wait, what did Val Kilmer play?"}, {"time": 899, "text": "Val Kilmer's in the very end."}, {"time": 902, "text": "You know when there's like the Elvis sitting there talking to him in the end?"}, {"time": 907, "text": "That's Val Kilmer."}, {"time": 910, "text": "Yeah, you don't notice it unless you somehow either are very perceptive or noticed it in the credits."}, {"time": 917, "text": "And Quentin Tarantino wrote the film, I think."}, {"time": 921, "text": "Which is interesting."}, {"time": 923, "text": "Directed by Tony Scott and the music is beautiful too."}, {"time": 928, "text": "And Christopher Walken and Dennis Hopper."}, {"time": 933, "text": "Dennis Hopper."}, {"time": 934, "text": "Dennis Hopper plays Clarence's dad and they have this very racist sounding scene."}, {"time": 941, "text": "But the big important aspect of that scene is it's a father willing to die to protect the son."}, {"time": 950, "text": "I mean, it's so much beautiful violence in that film."}, {"time": 955, "text": "I love that film so much."}, {"time": 957, "text": "And she's a prostitute or not really part time, short time."}, {"time": 962, "text": "No, it was her first time."}, {"time": 966, "text": "And he saved her."}, {"time": 967, "text": "My third favorite film has no violence whatsoever."}, {"time": 976, "text": "What's your third?"}, {"time": 977, "text": "A Room with a View."}, {"time": 980, "text": "I feel like you'd like it."}, {"time": 984, "text": "I forget the author."}, {"time": 985, "text": "It's a book and I read the book much later."}, {"time": 987, "text": "But it's Helena Bonham Carter and Daniel Day Lewis is in it and Julian Sands."}, {"time": 1000, "text": "Daniel Day Lewis is a fascinating character."}, {"time": 1003, "text": "He's amazing in this film because he plays, he's very funny."}, {"time": 1007, "text": "He sort of plays a, he's a comical character, which is unlike most of what he does, I think."}, {"time": 1013, "text": "I don't watch a ton of movies."}, {"time": 1015, "text": "So, but yeah, he played, his role is funny."}, {"time": 1021, "text": "Well, that's a heck of a top three."}, {"time": 1025, "text": "You brought me some books, some bread and books."}, {"time": 1029, "text": "Some Russian bread, Russian inspired bread."}, {"time": 1032, "text": "I mean, it's Latvian, but it's similar to."}, {"time": 1035, "text": "Close enough."}, {"time": 1036, "text": "Similar to what's made in Russia."}, {"time": 1038, "text": "And it's made at a Russian bakery."}, {"time": 1040, "text": "Where your dad is from, right?"}, {"time": 1041, "text": "My dad is from Latvia."}, {"time": 1042, "text": "So you got me some books, Beautiful Ruins."}, {"time": 1046, "text": "Yeah, and if you never read them, who cares?"}, {"time": 1048, "text": "That's totally fine."}, {"time": 1049, "text": "You know, people give you books and then you feel like you just, you sort of feel like."}, {"time": 1054, "text": "I see this as, we'll talk about this."}, {"time": 1056, "text": "This is part therapy session."}, {"time": 1057, "text": "I don't feel the need to satisfy people's happiness."}, {"time": 1063, "text": "Okay, so, but it could also be an opportunity to experience something I never otherwise would have."}, {"time": 1070, "text": "So Beautiful Ruins."}, {"time": 1073, "text": "It's a book that made me laugh and cry."}, {"time": 1076, "text": "And it's just a happy story."}, {"time": 1078, "text": "And for some reason, I don't know exactly why, but for some reason, when you asked me to come, it just, I thought, oh, I'm going to bring a copy of that book."}, {"time": 1088, "text": "That's, you just felt it came, the voice told you."}, {"time": 1092, "text": "There's others, Darkness Visible."}, {"time": 1094, "text": "These are more."}, {"time": 1095, "text": "A memoir of madness, compelling, harrowing, a vivid portrait of a debilitating disorder."}, {"time": 1101, "text": "It offers the solace of shared experience."}, {"time": 1104, "text": "The New York Times, William Styron."}, {"time": 1106, "text": "There's a little bit about this book that reminds me of the Carl Diceroth book because he writes about his own condition in, I mean, he's an amazing writer."}, {"time": 1120, "text": "So he writes about it in this beautiful way."}, {"time": 1122, "text": "And oddly enough, in some ways, it's kind of delightful."}, {"time": 1126, "text": "So it's not at all a depressing book."}, {"time": 1129, "text": "At least I didn't find it depressing at all."}, {"time": 1132, "text": "But he writes about his own experience with depression in such a beautiful way."}, {"time": 1139, "text": "My own copy is full of underlines."}, {"time": 1144, "text": "I would love that copy too."}, {"time": 1146, "text": "I would love to look into the underlines and then the books with notes, those little secrets that people leave traces."}, {"time": 1153, "text": "That's part of why I like paper books is because I underline."}, {"time": 1157, "text": "I tend to underline like crazy."}, {"time": 1158, "text": "The Carl Diceroth book is full of underlines too."}, {"time": 1162, "text": "Well, I do the same thing on Kindle, but and then you can actually more effectively go back to the things you've underlined because you highlight and so on."}, {"time": 1170, "text": "But in fact, when you underline on paper books, you sometimes never go back, which always makes me sad."}, {"time": 1179, "text": "To the book?"}, {"time": 1179, "text": "To the things you've underlined."}, {"time": 1181, "text": "In the paper books?"}, {"time": 1182, "text": "Yeah, in the paper books."}, {"time": 1182, "text": "Oh, I do."}, {"time": 1183, "text": "I go back."}, {"time": 1184, "text": "Yeah, I go back a lot."}, {"time": 1185, "text": "Do you wonder what the heck you were thinking about when you wrote something?"}, {"time": 1189, "text": "Well, sometimes I underline things that are... Well, also what I do is I have in a whole file in Evernote of transcribed quotes from books, ones that I want to save."}, {"time": 1199, "text": "So I might underline a lot of things in a book and then maybe like a third of them, I want to write them down somewhere."}, {"time": 1206, "text": "So I write those down and I think even the time it takes to transcribe it is somehow worthwhile."}, {"time": 1212, "text": "It's like searing it in your brain."}, {"time": 1215, "text": "And you're reliving the memory, having read it the first time."}, {"time": 1220, "text": "Yeah, and then sometimes I'll pick up books."}, {"time": 1221, "text": "I even and sometimes I just underline sentences that are..."}, {"time": 1226, "text": "It's not the content of the sentence."}, {"time": 1228, "text": "It's more that it's just a beautifully written sentence or like a particularly apt metaphor or something that's really nice."}, {"time": 1234, "text": "And I like paper books too because I bought Beautiful Ruins."}, {"time": 1238, "text": "I would have never heard of it, I don't think, except one of my favorite things is to go to used bookstores."}, {"time": 1245, "text": "Actually, Goodwill sometimes has really good big book selections depending on the area where you go."}, {"time": 1253, "text": "Sometimes you find a lot of treasures there."}, {"time": 1255, "text": "And what ends up happening a lot is I end up buying books that I know sometimes also because I lost all my belongings at one point."}, {"time": 1262, "text": "So, I'll very often buy books that I've already read just to have them."}, {"time": 1269, "text": "But then what always ends up happening is I'll find..."}, {"time": 1273, "text": "There'll be a couple of books that I buy that I've never heard of the author."}, {"time": 1275, "text": "I don't really know anything about the book at all, but something drew me to it."}, {"time": 1279, "text": "And what I like about that is you're buying used books so it costs a dollar or two."}, {"time": 1285, "text": "So, if you made a mistake, like no big deal, who cares?"}, {"time": 1288, "text": "So, but every time I come back with a book haul, there's usually at least one gem that I end up loving and I'm so glad that I read it."}, {"time": 1298, "text": "And Beautiful Ruins was that book for me."}, {"time": 1300, "text": "And I was drawn to it because of the cover art."}, {"time": 1302, "text": "Like I just loved the cover and the colors and then I picked it up and read the back and bought it."}, {"time": 1309, "text": "And I also feel bad sometimes buying used books when the author is still alive because I feel like if you write a book, you should get the royalties."}, {"time": 1319, "text": "But you get to live with that regret."}, {"time": 1322, "text": "Well, also, I mean, I'll usually end up putting a picture of Leon reading the book online and then other people buy it and read it."}, {"time": 1329, "text": "And so I feel like I've made up for... You make up for it."}, {"time": 1332, "text": "I've made up for depriving him of the royalties."}, {"time": 1335, "text": "I used to live in Cambridge, Massachusetts."}, {"time": 1338, "text": "I know it well."}, {"time": 1340, "text": "I used to hang out at the pit in Harvard Square with my green and blue hair when I was very way too young to be doing that by myself."}, {"time": 1349, "text": "And there's a guy that I think has been there for a long time, sort of between Kendall and Central that would just lay out used books and sell them."}, {"time": 1359, "text": "And I always loved that guy."}, {"time": 1361, "text": "Whoever he was, he had a cool hat."}, {"time": 1364, "text": "He's an older gentleman and you could just tell he's seen some things."}, {"time": 1369, "text": "I don't know who he is."}, {"time": 1370, "text": "I always wanted to actually like talk to him for a long time, but I was too afraid."}, {"time": 1375, "text": "Maybe because I wouldn't be able to handle what he had to tell me."}, {"time": 1379, "text": "Because I almost wanted to maintain the innocence of just, okay, here's this guy."}, {"time": 1382, "text": "But he was so... Every time you would ask him a question about a book, first of all, he's read all of them."}, {"time": 1389, "text": "Which means he's traveled quite a few places inside these worlds."}, {"time": 1394, "text": "And then you would tell him, I would look at a book and he would catch you being curious about it and then he would walk up to you and then he would start talking about the book and he would always forget that you were there."}, {"time": 1408, "text": "He's almost like, he's not trying to sell you the books."}, {"time": 1410, "text": "Part talking to himself?"}, {"time": 1413, "text": "Almost like an ex girlfriend he's visiting through this book or something."}, {"time": 1417, "text": "Did you buy books from him?"}, {"time": 1420, "text": "But the experience of just being there because he lays them out and people actually that watch or listen to this probably would be able to tell me what his name is because I'd love to find that guy again."}, {"time": 1430, "text": "I'm sure he's still there."}, {"time": 1430, "text": "Maybe you'll have him on the podcast."}, {"time": 1432, "text": "I 100% will."}, {"time": 1435, "text": "But it's almost terrifying."}, {"time": 1437, "text": "I'm not sure I can handle."}, {"time": 1439, "text": "Because he's been through some things."}, {"time": 1441, "text": "I'm not sure if he's homeless or just looks like it."}, {"time": 1446, "text": "That's sometimes a thing."}, {"time": 1450, "text": "And some of my favorite people either are homeless or look like it."}, {"time": 1457, "text": "Okay, what's the third one?"}, {"time": 1458, "text": "The A Confession of a Sociopath by M.E."}, {"time": 1458, "text": "Thomas, A Life Spent Hiding in Plain Sight."}, {"time": 1464, "text": "It's a book I recommend a lot because I've read a lot about sociopathy and I've read all the books by psychologists and this one's written by a woman who understands herself that she is a sociopath."}, {"time": 1480, "text": "And so it's beautifully written, but I learned more from that book than from any other book."}, {"time": 1485, "text": "And I think I thought about it a long time ago."}, {"time": 1489, "text": "I think a lot of conversations you've talked a lot about good and evil and whether everybody's really good or some people are not good."}, {"time": 1498, "text": "And I think sociopathy is something that I think the world needs to understand much better."}, {"time": 1545, "text": "So I just found that book fascinating."}, {"time": 1548, "text": "And we'll return to this idea because it's fascinating."}, {"time": 1555, "text": "We'll return to human psychology and human nature."}, {"time": 1558, "text": "But let's go through the timeline of your life."}, {"time": 1565, "text": "Let's take a stroll."}, {"time": 1567, "text": "So you wrote that the documentary about you called Bad Vegan Fame Fraud Fugitives is not a documentary."}, {"time": 1575, "text": "It got some things right, some things wrong, and some were quote, disturbingly misleading."}, {"time": 1581, "text": "So let's go through and get things right today."}, {"time": 1586, "text": "First, can I give you a whirlwind summary the way I understand it and also for context of people."}, {"time": 1593, "text": "So 2004, you, Matthew Kenney, and Jeffrey Jotaro opened Pure Foods and Wine in New York City."}, {"time": 1602, "text": "Did I say their names correctly?"}, {"time": 1604, "text": "Pure Food and Wine."}, {"time": 1605, "text": "No, their names."}, {"time": 1606, "text": "Oh, theirs."}, {"time": 1608, "text": "Matthew Kenney and Jeffrey Jotaro."}, {"time": 1611, "text": "So it's, and I'll ask about what it takes to launch and run a restaurant in New York City."}, {"time": 1618, "text": "That's a fascinating story in itself."}, {"time": 1620, "text": "So it's an upscale raw food restaurant."}, {"time": 1623, "text": "All right, that's 2004."}, {"time": 1625, "text": "2007, you opened One Lucky Duck Juice and Takeaway."}, {"time": 1629, "text": "And second and third locations in 2009 and 14."}, {"time": 1632, "text": "All of those things closed in 2016, 15, 16, 15 and 16."}, {"time": 1642, "text": "2009, Jeffrey lends you $2.1 million to buy the business outright and Matthew is out."}, {"time": 1651, "text": "Matthew was out earlier than that."}, {"time": 1653, "text": "And then time passed, time passed."}, {"time": 1655, "text": "And I had, what was complicated is I had started the One Lucky Duck brand on my own."}, {"time": 1662, "text": "At first it was a dot com that was doing like delivery."}, {"time": 1666, "text": "It was a dot com where people could order ingredients and things and all of the products that we made and packaged."}, {"time": 1673, "text": "So we made a bunch of cookies and snacks and things that were, I think, different."}, {"time": 1677, "text": "And if I may say so myself, better than other."}, {"time": 1683, "text": "Products out there."}, {"time": 1683, "text": "Talking trash already."}, {"time": 1685, "text": "About the cookies."}, {"time": 1686, "text": "But I feel like I can brag about our food and products because a few recipes early on I came up with, but it was the people that worked with me that created really good recipes and products."}, {"time": 1702, "text": "And I was just kind of there curating it all or helping to get it out there."}, {"time": 1712, "text": "What was your favorite thing that you've created, maybe yourself eat?"}, {"time": 1716, "text": "That not you created, but this whole, all of these efforts have created in terms of meal."}, {"time": 1722, "text": "Like you said, cookies."}, {"time": 1724, "text": "Oh, that's a hard question."}, {"time": 1726, "text": "It's just, okay, not the favorite, but like something that pops into memory that brought you joy."}, {"time": 1731, "text": "The Malamar."}, {"time": 1732, "text": "Everybody loved the Malamar."}, {"time": 1734, "text": "So very often we made like raw vegan versions of things that people are familiar with."}, {"time": 1741, "text": "So it was a, I think it was pecans."}, {"time": 1744, "text": "It was like a salty cookie made with nuts and then covered in chocolate."}, {"time": 1748, "text": "And then there's a big blob of coconut cream, which it didn't taste coconutty."}, {"time": 1756, "text": "Our ice cream was made with a coconut also."}, {"time": 1759, "text": "It's like the meat from coconuts pureed."}, {"time": 1761, "text": "And then there's some soaked cashews in there."}, {"time": 1763, "text": "But anyway, it was a blob of vanilla flavored cream, kind of like a healthy natural version of fluff."}, {"time": 1771, "text": "I don't know if you're familiar with fluff."}, {"time": 1772, "text": "Basically every single word you say, I'm not familiar with."}, {"time": 1775, "text": "You should see my diet."}, {"time": 1777, "text": "I don't, it's like steak and vegetables."}, {"time": 1780, "text": "Fluff is like a thing that I remember it from my childhood, like peanut butter and fluff is a ridiculously delicious combination."}, {"time": 1787, "text": "Is it fluffy or is it not?"}, {"time": 1788, "text": "It's like a marshmallow."}, {"time": 1789, "text": "It's basically like, like if you softened the marshmallows and made it into a luxurious, amazing goo."}, {"time": 1796, "text": "Oh, so it's like a fancy marshmallow."}, {"time": 1797, "text": "And then put it in a jar."}, {"time": 1799, "text": "And then made it spreadable."}, {"time": 1801, "text": "It's spreadable marshmallows, kind of."}, {"time": 1804, "text": "I think that's, yeah."}, {"time": 1806, "text": "So spreadable marshmallows."}, {"time": 1808, "text": "So there's a big blob of that."}, {"time": 1809, "text": "I didn't know that existed."}, {"time": 1810, "text": "That's a thing?"}, {"time": 1813, "text": "Does everyone, do people know about this?"}, {"time": 1816, "text": "Oh yeah, everybody knows."}, {"time": 1818, "text": "People, I mean, I think so."}, {"time": 1819, "text": "People know about fluff."}, {"time": 1821, "text": "See, I think I went, I took the road less traveled by, you know, I went the peanut butter and Nutella road in terms of spreadable things."}, {"time": 1830, "text": "Nutella is like the chocolate version."}, {"time": 1833, "text": "And then fluff is like the vanilla equivalent sort of."}, {"time": 1838, "text": "But I think commercial fluff that you buy in the store is just like sugar and whatever else they put in there."}, {"time": 1845, "text": "It's not actually fluffy."}, {"time": 1848, "text": "It's kind of fluffy."}, {"time": 1849, "text": "But it's wet."}, {"time": 1851, "text": "Because Nutella is not fluffy."}, {"time": 1853, "text": "Yeah, it's, it, so it's like Nutella if you whipped it and then kind of got a little bit like a little bit aerated."}, {"time": 1861, "text": "So it's a bit more fluffy."}, {"time": 1863, "text": "So fluff was a part of the formula here."}, {"time": 1866, "text": "So this fluff."}, {"time": 1866, "text": "So the, the coconut cream that we made was like a healthy version of fluff kind of."}, {"time": 1875, "text": "Except it would, you know, you could make a, a Quesnel, like a, like a little scoop of it and it would stay in that form."}, {"time": 1884, "text": "Malamars were refrigerated and then there's like chocolate drizzled over that."}, {"time": 1889, "text": "So it had that like salty, sweet thing going on."}, {"time": 1893, "text": "That was probably my favorite."}, {"time": 1895, "text": "That's a dessert."}, {"time": 1896, "text": "Yeah, it was like a, it was like a dessert snack."}, {"time": 1899, "text": "It wasn't as, you wouldn't order it on the restaurant menu, but in the takeaway you could get them or sometimes some people would get them shipped on dry ice and pay a lot of money, like a lot of money to have them shipped on dry ice."}, {"time": 1914, "text": "People are funny."}, {"time": 1916, "text": "I kind of want to like name drop cause it was Tom Brady used to order them."}, {"time": 1921, "text": "They would order those shipped on ice to Boston."}, {"time": 1928, "text": "Um, continuing on in 2011, you meet Anthony Strangers on Twitter and then in real life, also around this time, I think before you got your rescue dog, a pit bull named Leon."}, {"time": 1943, "text": "2011, 2010."}, {"time": 1945, "text": "Um, it was September, 2010."}, {"time": 1947, "text": "So, cause I think he was born roughly around March."}, {"time": 1950, "text": "I gave him a designated birthday of March 10th, 2010."}, {"time": 1955, "text": "Why, why March 10th?"}, {"time": 1957, "text": "I wrote about the story of adopting him on my website a long time ago."}, {"time": 1962, "text": "And then I reposted it here on my current website."}, {"time": 1964, "text": "And, um, what happened, I got weirdly obsessed with Leon before he was Leon."}, {"time": 1970, "text": "He was a dog in a shelter named Quinn and, um, I couldn't stop thinking about him and the Him specifically."}, {"time": 1976, "text": "Him specifically."}, {"time": 1977, "text": "You saw him and there's something very special about him."}, {"time": 1980, "text": "I was trying to convince somebody else to adopt a dog."}, {"time": 1983, "text": "So, and I Alec Baldwin."}, {"time": 1985, "text": "Yeah, and it didn't occur to me that I would get a dog."}, {"time": 1987, "text": "I like how you didn't name drop him, but you named him Tom Brady."}, {"time": 1993, "text": "Um, so I was trying to convince him to get a dog cause I thought, you know, he should have a dog."}, {"time": 2001, "text": "I saw Leon's picture and just got weirdly obsessed with it in a way that I couldn't really explain."}, {"time": 2006, "text": "And, um, I was laying in bed one night and thinking, I just couldn't stop thinking about him, um, the dog and the paperwork or the, his description in the shelter bio said that he was roughly five months old or however, whatever it gave us his age."}, {"time": 2023, "text": "I went back and it would have been March 20, would have been March of that year that he was born."}, {"time": 2029, "text": "And, um, I had a cat that I was particularly attached to."}, {"time": 2034, "text": "I had two cats, brother and sister, but the boy cat, we had sort of like a, something that felt like a, you know, like we'd look at each other and like there was something there."}, {"time": 2044, "text": "I don't know what it was, but, um, and in fact, when he got sick, I knew it before he even had any symptoms."}, {"time": 2050, "text": "It was like something in the way that he looked at me."}, {"time": 2052, "text": "I knew something was wrong."}, {"time": 2054, "text": "And then, uh, was it friendship?"}, {"time": 2056, "text": "Was it like, uh, was there a power dynamic?"}, {"time": 2061, "text": "Cats seem to not really give a fuck."}, {"time": 2064, "text": "They seem to dismiss you."}, {"time": 2067, "text": "Usually."}, {"time": 2069, "text": "Your entire worth as a human being."}, {"time": 2071, "text": "In a single look."}, {"time": 2073, "text": "Was that there or?"}, {"time": 2074, "text": "Um, he was more dog like."}, {"time": 2077, "text": "He would occasionally fetch like this little styrofoam thing I had."}, {"time": 2080, "text": "He would fetch it and bring it back and he was, um, friendly and, you know, if somebody came over, he would jump in their lap."}, {"time": 2087, "text": "Um, he was less standoffish than most cats."}, {"time": 2091, "text": "Um, but there was just something about the way he would look at me."}, {"time": 2095, "text": "And I maybe probably in his mind, he's just a cat."}, {"time": 2100, "text": "I give him food."}, {"time": 2102, "text": "Whereas in my mind, it's some kind of, you know, great soul connection."}, {"time": 2107, "text": "Great, great long running, uh, romance."}, {"time": 2110, "text": "Not in his kitty mind, but either way."}, {"time": 2112, "text": "So he died in March and I thought, um, so I sort of concocted this."}, {"time": 2118, "text": "I just thought, um, you know, that, well, if he died and he died on March 10th."}, {"time": 2124, "text": "And so I thought, well, maybe Leon was born that same day."}, {"time": 2126, "text": "And that's why, that's why I'm so drawn to him."}, {"time": 2135, "text": "But then you just felt like when you saw him, you just like, there's something."}, {"time": 2139, "text": "It was his picture."}, {"time": 2141, "text": "Oh, the picture."}, {"time": 2142, "text": "And you were drawn something about the personality in the eyes."}, {"time": 2147, "text": "It was something about his picture."}, {"time": 2148, "text": "I don't know what it was."}, {"time": 2149, "text": "And, um, and everybody at the time was like, what are you thinking?"}, {"time": 2155, "text": "Why would you get a dog?"}, {"time": 2156, "text": "You can't, you know, can't even take care of yourself."}, {"time": 2160, "text": "You're overworked and busy."}, {"time": 2161, "text": "And why would you get a five month old pit bull mix?"}, {"time": 2165, "text": "You know, why not get an older dog?"}, {"time": 2166, "text": "That's easier to take care of."}, {"time": 2168, "text": "And, um, for me, it was like, I don't, I don't want any dog."}, {"time": 2172, "text": "I don't want, my intention isn't to get a dog, but there's something about this dog that I have to get."}, {"time": 2178, "text": "And so I went to see him, um, and then I had already filled out an application."}, {"time": 2185, "text": "It was just, I went to see him and then I, it was the afternoon and I sort of decided in my head, like, all right, I'm coming back to get him."}, {"time": 2195, "text": "And so the next morning I got on the subway and went back to get him."}, {"time": 2198, "text": "Um, and I was crying on the subway."}, {"time": 2201, "text": "And I remember thinking that people, I don't like crying in public."}, {"time": 2204, "text": "I cry a lot, but I don't like crying in front of other people."}, {"time": 2208, "text": "And, um."}, {"time": 2211, "text": "I thought people on the train looking at me probably think that, you know, I just, somebody died or."}, {"time": 2216, "text": "Sorry, you, you're crying on the way there or on the way back?"}, {"time": 2219, "text": "On the way there to get him."}, {"time": 2220, "text": "I don't, and I don't know why I was crying."}, {"time": 2222, "text": "It was just something about it was overwhelming."}, {"time": 2225, "text": "So tears of happiness or tears of something."}, {"time": 2228, "text": "Something."}, {"time": 2229, "text": "I, yeah, I think tears are overwhelming."}, {"time": 2233, "text": "I, and now I'm like jumping off, but there was some, I don't, now I'm trying."}, {"time": 2239, "text": "Was it in your conversation or the book?"}, {"time": 2241, "text": "Carl Diceruff talks about tears of joy and trying to explain them."}, {"time": 2245, "text": "And he said something about how it was like about, you know, cause tears of sadness could be understood in a having like a evolutionary purpose."}, {"time": 2256, "text": "Um, but why tears of joy?"}, {"time": 2258, "text": "And I think he said it was something about like hope that could be like lost."}, {"time": 2266, "text": "So if you cried at a wedding, it might be like, you're crying because their love is beautiful and you're crying because, you know, they could get hit by a bus tomorrow or something, you know, like it had something to do with that."}, {"time": 2277, "text": "And I thought, um, but I thought to me, it feels like overwhelmed."}, {"time": 2282, "text": "Cause then how would that explain music?"}, {"time": 2285, "text": "Cause music will make me cry."}, {"time": 2286, "text": "A lot because it's, it's anything beautiful, like love, you realize you're going to have, it's going to be over one day."}, {"time": 2296, "text": "So it's just overwhelming."}, {"time": 2298, "text": "It could be overwhelming."}, {"time": 2299, "text": "I think it's just overwhelming."}, {"time": 2300, "text": "But over, it could be like, if you had to explain like one way to explain it, as you're saying is it's so awesome that it breaks your heart."}, {"time": 2309, "text": "That's going to be over."}, {"time": 2310, "text": "This feeling is going to be over the either it's the song or the person."}, {"time": 2317, "text": "You're going to lose them one day."}, {"time": 2319, "text": "But even when you're just watching something that this is completely ridiculous, but I remember one time I probably was hormonal or something, but it was like an episode of family feud years ago and the fam, oh no."}, {"time": 2333, "text": "Um, wheel of fortune."}, {"time": 2335, "text": "It was wheel of fortune and some family like won all this money and they were so happy."}, {"time": 2338, "text": "Like it just, they were so happy."}, {"time": 2341, "text": "They must probably needed the money or something."}, {"time": 2343, "text": "I started crying and I'm thinking, why am I crying?"}, {"time": 2346, "text": "But I think it's just, I think it's just like an overwhelming, I think it's overwhelming in some way and crying because crying is a relief."}, {"time": 2354, "text": "Like you feel better after you cry, but that's not, doesn't explain the crying."}, {"time": 2360, "text": "You feel better after you cry and you're saying it's overwhelming, but that's on the surface."}, {"time": 2365, "text": "The question is what's going on underneath."}, {"time": 2368, "text": "That's the yin and yang shadow."}, {"time": 2370, "text": "And I don't think neither you or I can answer that question, but there's something going on underneath."}, {"time": 2375, "text": "There's probably something that touches you in some specific way."}, {"time": 2380, "text": "And so you were crying on the subway."}, {"time": 2382, "text": "So I was crying on the subway."}, {"time": 2383, "text": "It's very, it's very New York thing to do."}, {"time": 2386, "text": "Well, that's one of the things I love about New York is people, you can be weird and do strange things and nobody's going to look at you strangely or."}, {"time": 2394, "text": "The fascinating thing about New York is super crowded and yet you can still feel super alone."}, {"time": 2401, "text": "But also energized because a lot of other things and places will make me feel depleted, but there's something about the energy of New York specifically that feels energizing."}, {"time": 2414, "text": "I mean, everybody's going up about their day excited for a future they're building and so on and that could be energy."}, {"time": 2426, "text": "It could be overwhelming though."}, {"time": 2430, "text": "I mean, also depending on what neighborhood and what part."}, {"time": 2433, "text": "Well, I'm just talking about the subway."}, {"time": 2436, "text": "And then there's the musicians."}, {"time": 2438, "text": "I love New York."}, {"time": 2439, "text": "New York at its best is a special place."}, {"time": 2441, "text": "I've never lived, but every time I visit, it's so many characters, so many fascinating people."}, {"time": 2446, "text": "Yeah, and then there's a bunch of people always crying in the subway and you're one of those people."}, {"time": 2451, "text": "I was one of those people one day."}, {"time": 2453, "text": "So you got."}, {"time": 2453, "text": "I befriended some busking musicians like the guys that just play out on the street, these two young guys playing guitar."}, {"time": 2461, "text": "And I felt like it was one of those moments where it was like candid camera because nobody was paying attention and I thought it was like, it was so beautiful."}, {"time": 2468, "text": "I may have cried or almost cried or, but anyway, I ended up becoming friends with them and helping them out in some ways."}, {"time": 2475, "text": "And I knew, I was like, well, they're gonna do really well."}, {"time": 2481, "text": "And now they're like playing large places and it's kind of fun to watch via Instagram."}, {"time": 2488, "text": "You know, they're going on tour in Europe and they were these two scrappy guys."}, {"time": 2494, "text": "Well, now it's just one of the guys."}, {"time": 2497, "text": "But they had like no money, nowhere to live, nothing."}, {"time": 2500, "text": "And now they're on tour."}, {"time": 2502, "text": "And they didn't quit?"}, {"time": 2505, "text": "Persisted."}, {"time": 2507, "text": "So, but I cried on the subway and I got there and he was there and I adopted him."}, {"time": 2512, "text": "But it just felt very profoundly like a force that was beyond me."}, {"time": 2521, "text": "Like I couldn't not get him."}, {"time": 2523, "text": "So he was the same in person as he was in the picture."}, {"time": 2526, "text": "Like, meaning in terms of like something like pulling you towards him, like some."}, {"time": 2533, "text": "Yeah, when I first met him the day before, he was really distracted, which I think is, you know, he is a puppy that spends most of his day in a cage, which is not natural."}, {"time": 2543, "text": "So when I, they let me take him for a walk and he was kind of, you know, distracted and all over the place."}, {"time": 2550, "text": "But then when we put him back in the cage, he sort of lay down and looked at me and I looked back at him."}, {"time": 2556, "text": "And of course, I imagined all kinds of, I just looked at him and I thought, all right, I'm, don't worry, I'm coming back to get you."}, {"time": 2563, "text": "Like I'll, I'll get you."}, {"time": 2565, "text": "So, yeah, it just, it felt like, it felt like something that I had no choice that I had to do."}, {"time": 2576, "text": "And that was the beginning of a 12 year journey together."}, {"time": 2581, "text": "An ongoing, an ongoing one."}, {"time": 2583, "text": "But so I wrote about these things on my website and I think it was, you know, among the many things that was later weaponized by Anthony Strangest."}, {"time": 2596, "text": "Just because I was so open about it."}, {"time": 2599, "text": "And also just, it's not like I believe that he was, you know, that I was just expressing my feelings about how I felt going to get him, that there was something about Leon specifically that I, it was like, I felt like I had to get him."}, {"time": 2612, "text": "So, is there words you can put to your connection with Leon?"}, {"time": 2618, "text": "Like, is it love?"}, {"time": 2621, "text": "Is it friendship?"}, {"time": 2623, "text": "Is it some kind of, like, what is it?"}, {"time": 2629, "text": "Or are we getting to the crying and being overwhelmed?"}, {"time": 2633, "text": "Something you just can't put words to?"}, {"time": 2636, "text": "Yeah, it's probably something that's hard to put words to."}, {"time": 2638, "text": "Kind of like, I sort of feel like love being something that's hard to define is part of, is the definition of love."}, {"time": 2649, "text": "The fact that you can't define it."}, {"time": 2651, "text": "You know, the moment you define it, you're no longer talking about love."}, {"time": 2654, "text": "Sort of, something like that."}, {"time": 2658, "text": "Well, my definition of love is whatever's going on in true romance."}, {"time": 2662, "text": "Let me fly through the timeline before we get to any of the interesting details."}, {"time": 2668, "text": "So, in 2011, you meet Anthony Stranjes."}, {"time": 2673, "text": "Then in 2012, you two get married."}, {"time": 2678, "text": "2015, the staff walk out due to failure to pay from the two restaurants."}, {"time": 2685, "text": "It reopens in April of 2015 and July of that year, there's another walkout."}, {"time": 2692, "text": "There's all this kind of stuff."}, {"time": 2694, "text": "It's a confusing timeline."}, {"time": 2696, "text": "Well, it's not, to me, that's not even."}, {"time": 2699, "text": "The point is in 2015, there's chaos happening."}, {"time": 2704, "text": "2016, in the spring, Pure Foods and Wine closes."}, {"time": 2709, "text": "Closed in 2015."}, {"time": 2713, "text": "There's some factual stuff that's not, yeah, maybe correct me on it."}, {"time": 2717, "text": "To me, it's not that important."}, {"time": 2718, "text": "To me, the spirit of the thing is important."}, {"time": 2721, "text": "May 12, 2016, you and your then husband, Anthony Stranjes, were arrested after he ordered pizza using his real name."}, {"time": 2732, "text": "In May 2017, you pleaded guilty to stealing more than $2 million from investors and scheming to defraud, as well as, this is from Wikipedia."}, {"time": 2744, "text": "Yeah, that's wrong."}, {"time": 2746, "text": "Well, let me just finish reading it and then you tell me why it's wrong."}, {"time": 2749, "text": "In May 2017, you pleaded guilty to stealing more than $2 million from investors and scheming to defraud, as well as, criminal tax fraud charges."}, {"time": 2758, "text": "Why is Wikipedia wrong?"}, {"time": 2759, "text": "And how dare you?"}, {"time": 2761, "text": "Well, I mean, I did plead guilty to those things, which I had to."}, {"time": 2765, "text": "Oh, I got a jury duty summons and I had to fill out what charges I pled guilty to."}, {"time": 2772, "text": "And I had to go online and look it up because I didn't really remember, which is, I thought that was interesting."}, {"time": 2779, "text": "I had to go look it up, but... Actually, let me finish the time because there's one more point."}, {"time": 2784, "text": "March 16, 2022, Bad Vegan Documentary comes out, where you're interviewed."}, {"time": 2792, "text": "Does they tell the story?"}, {"time": 2795, "text": "Some stuff is true, some is not, some is disturbingly misleading, as you said."}, {"time": 2800, "text": "Timeline over."}, {"time": 2801, "text": "Anyway, what's wrong with the... How would you elaborate onto the you pleading guilty for $2 million stealing?"}, {"time": 2809, "text": "So, a lot of people plead guilty for reasons other than they're actually guilty."}, {"time": 2815, "text": "So, even right now, if I knew that I was going to have to spend four months or three and a half at Rikers, and I was thinking about this recently, and even if I knew that I'd be acquitted, at the end of a trial, I very likely would have just taken the four months because the stress of going through a trial, but in particular, it'd be incredibly stressful not knowing the outcome."}, {"time": 2848, "text": "And then money and expense I didn't have."}, {"time": 2851, "text": "And so, people plead guilty all the time, even if they don't think that they should."}, {"time": 2856, "text": "And my situation was so complicated and hard to understand that it just was the easier thing to do."}, {"time": 2864, "text": "But also, I just was kind of going on the advice of lawyers and..."}, {"time": 2868, "text": "So, the choice, just so I understand, was to plead guilty or to go through a lengthy trial."}, {"time": 2876, "text": "And that trial would stretch a long time, and it would be extremely stressful."}, {"time": 2883, "text": "And extremely expensive."}, {"time": 2888, "text": "Because you have to pay the lawyers."}, {"time": 2890, "text": "And I didn't have anything."}, {"time": 2891, "text": "And so, a lot of people in that situation might choose to plead guilty."}, {"time": 2898, "text": "And so, that doesn't necessarily mean the full heaviness of that statement of guilt."}, {"time": 2904, "text": "And I think people plead guilty all the time in situations where they're being threatened with a heavy sentence, and they sort of feel like they have no choice."}, {"time": 2916, "text": "But that's kind of part of a lot of things that are messed up about the system overall that didn't necessarily apply in my case."}, {"time": 2923, "text": "So, we'll talk about to what degree you're guilty and what that even means."}, {"time": 2929, "text": "Because it depends on intention, I think."}, {"time": 2934, "text": "But then the word intention also means a lot of things, like the word love."}, {"time": 2944, "text": "So, the restaurant closed the first time when I was away and told to be off communication."}, {"time": 2956, "text": "And then I... By Anthony."}, {"time": 2960, "text": "He told you not to talk to anybody."}, {"time": 2961, "text": "He told me not to talk to anybody."}, {"time": 2963, "text": "He told me not to like open email or look at my phone or whatever."}, {"time": 2969, "text": "And so, when I came back and had to get it reopened, which seemed like an unbelievably difficult task, and I was kind of shocked that I was able to pull it off."}, {"time": 2983, "text": "You know, I worked incredibly hard to get it reopened."}, {"time": 2986, "text": "And, you know, because that place meant everything to me."}, {"time": 2986, "text": "And so, I just had to get it reopened."}, {"time": 2995, "text": "Were you surrounded by people that were just angry at you?"}, {"time": 2998, "text": "At that time?"}, {"time": 2998, "text": "Not... Well... Just the staff and all that."}, {"time": 3002, "text": "Yeah, but most of them came back."}, {"time": 3002, "text": "A lot of them came back."}, {"time": 3005, "text": "I think what was so unbelievably painful about that whole time was like not being able to tell anybody what was really going on."}, {"time": 3015, "text": "And in a sense, not really knowing what was going on myself, but not being able to... Like having to pretend all the time was just like soul crushing."}, {"time": 3023, "text": "So you didn't really tell anybody about Anthony?"}, {"time": 3026, "text": "About him and what was really going on, in part because I didn't really understand what was going on."}, {"time": 3031, "text": "So what I did was I raised money to reopen the restaurant, and I think I raised something like eight, maybe like 900 grand."}, {"time": 3040, "text": "And probably 90% of that went to reopen the restaurant."}, {"time": 3047, "text": "And I even made two sales tax payments right before we disappeared."}, {"time": 3053, "text": "So it just sort of logically seemed like..."}, {"time": 3057, "text": "So I didn't..."}, {"time": 3057, "text": "It's not like all of this money was taken and then he and I ran off together with a whole bunch of money."}, {"time": 3064, "text": "It was like I raised a bunch of money to reopen the restaurant, not because I wanted the restaurant to exist again and I wanted to run it."}, {"time": 3074, "text": "I wanted to reopen the restaurant."}, {"time": 3076, "text": "And most of that money went to reopen the restaurant and then I disappeared."}, {"time": 3083, "text": "So sort of the timeline gets a bit wonky."}, {"time": 3089, "text": "So this impression was created that we ran off with a whole bunch of money and we didn't."}, {"time": 3095, "text": "So if I wanted to be a criminal and steal a bunch of money, why would I have put it all back into the restaurant and reopened it?"}, {"time": 3104, "text": "And then also made two $10,000 sales tax payments that I didn't... And I also repaid $10,000 of another loan."}, {"time": 3115, "text": "I was making repayments and stuff and then boom, I disappear."}, {"time": 3118, "text": "So is your mind going through a roller coaster here?"}, {"time": 3118, "text": "So could there have been multiple yous there?"}, {"time": 3125, "text": "So one mind is like, I love this restaurant."}, {"time": 3125, "text": "I'm going to reopen it."}, {"time": 3130, "text": "I'm this chef, business owner, this person."}, {"time": 3135, "text": "And then the other is a human that's in this complicated love affair."}, {"time": 3142, "text": "It wasn't a love affair."}, {"time": 3150, "text": "I don't want to..."}, {"time": 3150, "text": "I say that lightly, but also not because love can make us do dark things."}, {"time": 3158, "text": "You can say that's not love, but okay."}, {"time": 3163, "text": "The thing that traps us, the things that pulls us in to a connection with another human being, that's love, even when it's abusive and dark and toxic and all those kinds of things."}, {"time": 3174, "text": "In some cases, I think, like if it's voluntary, but in other cases, somebody pulls you in."}, {"time": 3181, "text": "So it's not like you're drawn towards them."}, {"time": 3185, "text": "So just to clarify, even when it's not physical, when the pull is with words, so it's emotional."}, {"time": 3194, "text": "Where is your mind when you raise $800,000 to $900,000 to open the restaurant, working your ass off to open this thing, making payments, and then all of a sudden disappearing?"}, {"time": 3213, "text": "Where was your mind?"}, {"time": 3213, "text": "If you had a lengthy conversation with Karl Deisseroth in privacy, what would you be telling him as your therapist?"}, {"time": 3222, "text": "I would probably be asking him questions."}, {"time": 3225, "text": "I forget Karl is part of this."}, {"time": 3228, "text": "Well, actually, I have more questions for Andrew Huberman because I've had to investigate all of these things myself, like dissociation."}, {"time": 3242, "text": "There's a psychologist who believes that he must have used neurolinguistic programming on me, which is something that Keith Ranieri from the NXIVM cult, he was known to have used that with people."}, {"time": 3252, "text": "And I think neurolinguistic programming is kind of the same as like a sort of like hypnotism."}, {"time": 3260, "text": "The only reason I know about what NLP is, is because in what I do, there's something called natural language processing, artificial intelligence stuff."}, {"time": 3266, "text": "So it has the same, like three letters."}, {"time": 3273, "text": "What was the other thing that NLP, neurolinguistic program?"}, {"time": 3276, "text": "Neurolinguistic programming."}, {"time": 3277, "text": "Well, we talked about Andrew, my friend Andrew Huberman offline, and you definitely, you should do a podcast with him."}, {"time": 3284, "text": "He's a fascinating, he's such a brilliant and kind human being."}, {"time": 3288, "text": "Definitely worth talking to."}, {"time": 3292, "text": "Yeah, I've listened to a lot of his podcasts."}, {"time": 3294, "text": "And you said that you listened to a lot of his instructions on getting light in the morning or whatever during the day."}, {"time": 3300, "text": "It's very important for your mental, like there's all these kinds of studies."}, {"time": 3303, "text": "It's good for your mind, for your... Oh, and also the other thing that he got me to do is to try to delay having coffee."}, {"time": 3307, "text": "So instead of having coffee right when you wake up, I always drink a lot of water first, but then instead of having coffee right away, if you wait an hour or an hour and a half or two hours, then your body is able to naturally do something that drinking coffee too soon would sort of blunt that."}, {"time": 3323, "text": "So then you'll be more tired in the afternoon."}, {"time": 3329, "text": "So if you wait an hour and a half or two hours, or as long, you know, before you have your first cup of coffee, then you won't be as tired in the afternoon."}, {"time": 3341, "text": "There's a lot of..."}, {"time": 3343, "text": "One coffee addict talking to another coffee addict."}, {"time": 3346, "text": "Yes, it works."}, {"time": 3346, "text": "And so I try to get up and do other things first before I have coffee."}, {"time": 3353, "text": "And the light thing also makes a lot of sense to me."}, {"time": 3353, "text": "Getting light early in the morning, I have one of those bright light boxes, and I would love to have an apartment that had a little deck or something where I could just step outside, because when you live in an apartment, you kind of have to like go all the way outside, and then there's people everywhere."}, {"time": 3371, "text": "And so to get that early morning light isn't that hard to do when you're... Are people good for you or bad for you?"}, {"time": 3379, "text": "What does Andrew Huberman say about that?"}, {"time": 3379, "text": "I'm just kidding, it's a joke."}, {"time": 3379, "text": "Okay, so moving back to where was your mind that led you to disappear to, did you guys go to Vegas first and then to Tennessee?"}, {"time": 3391, "text": "No, I kind of refer to it as like the road trip from hell."}, {"time": 3394, "text": "It's a very Hunter S. Thompson way to describe it."}, {"time": 3394, "text": "You went back to back country."}, {"time": 3400, "text": "Maybe it was sort of Hunter S. Thompsonesque, except without actual drugs."}, {"time": 3405, "text": "That was one of the first questions my father asked me was, was it drugs?"}, {"time": 3405, "text": "And I wished that I could have said yes, because I didn't know how to explain what had happened."}, {"time": 3413, "text": "But he took me away involuntarily, except, you know, of course, he wasn't holding a gun to my head."}, {"time": 3421, "text": "But all along, it was like a metaphorical gun."}, {"time": 3429, "text": "Was there ever physical contact with your father?"}, {"time": 3432, "text": "What would qualify as sexual abuse?"}, {"time": 3432, "text": "But physically, no."}, {"time": 3442, "text": "A couple of times we would get into a slightly physical fights, but he never..."}, {"time": 3447, "text": "I mean, he was big and as large and blubbery as he was."}, {"time": 3447, "text": "He was also really strong."}, {"time": 3457, "text": "So sometimes he would like subdue me."}, {"time": 3457, "text": "But other than that, no, there wasn't physical violence."}, {"time": 3462, "text": "But a lot of people will say that the psychological violence is, I don't want to diminish physical violence, but some people say that the psychological and emotional violence is more destructive."}, {"time": 3477, "text": "It's just that the physical violence is easier to identify."}, {"time": 3481, "text": "It's easier to identify."}, {"time": 3481, "text": "It's easier to identify the physical violence."}, {"time": 3485, "text": "It's easier to identify and it seems kind of more straightforward."}, {"time": 3490, "text": "Whereas psychological, you know, and you have a bruise on your face or you break a bone and those things hopefully heal in a visible way."}, {"time": 3495, "text": "But psychological stuff, you know, you can't easily identify or understand or others can't easily identify it."}, {"time": 3505, "text": "And then you find yourself crying for no reason at a beautiful song at some point."}, {"time": 3512, "text": "And that has to do something happening in the depth of your mind."}, {"time": 3518, "text": "Okay, so he took you away."}, {"time": 3518, "text": "But where was, I mean, where was your mind that was doing both of those things?"}, {"time": 3526, "text": "Was able to be taken away, but also was pushing to the flourishing, the reopening and the flourishing of the restaurant?"}, {"time": 3535, "text": "Well, you know, I wouldn't have reopened the restaurant and then knowing I was gonna all of a sudden be taken away from it and it was gonna get closed again."}, {"time": 3541, "text": "You know, it's like, why would I do that?"}, {"time": 3541, "text": "Why would anybody do that?"}, {"time": 3547, "text": "And one of the things that I tried to do towards the end was I was trying to get myself off the bank accounts because I didn't want him to be able to get money out of me."}, {"time": 3554, "text": "And so there was one time when I tried to get one of the investors, we went to the bank together to put her on as the signer and take me off."}, {"time": 3565, "text": "And because we didn't have the operating agreement, they wouldn't let us do it."}, {"time": 3569, "text": "So it was like this little snafu."}, {"time": 3569, "text": "And so all of these things are sort of the opposite of criminal intent."}, {"time": 3578, "text": "But that's a legal thing."}, {"time": 3578, "text": "What's going on in your mind at this time?"}, {"time": 3584, "text": "Were you, did you give yourself a chance to just think?"}, {"time": 3591, "text": "And I think that's part of one of the things that might have saved me or anybody that's pulled into a cult."}, {"time": 3599, "text": "One of the things that they do is they keep you exhausted, overwhelmed, confused and afraid."}, {"time": 3608, "text": "And so you don't have any time to think."}, {"time": 3608, "text": "So you're just kind of constantly running and you're confused and then things are happening."}, {"time": 3614, "text": "I have some quotes in my book draft because I listen to a lot of podcasts."}, {"time": 3618, "text": "I don't know what the logistics are of like crediting a quote from a podcast in a book."}, {"time": 3624, "text": "But I have a couple."}, {"time": 3624, "text": "I think it was Andrew Huberman on Joe Rogan said something about if a animal, if a human or animal, I don't know how he would know, the human or animal is stressed."}, {"time": 3642, "text": "And I'm paraphrasing this horribly, but they're much more easily prone to be, not prone to, but forced into delusional thinking."}, {"time": 3653, "text": "And so that quote resonated for me because he kept me in this incredibly stressed out, afraid, confused state."}, {"time": 3661, "text": "And then whatever he's sort of planting in my mind, I'm going to be that much more likely to just kind of go along with it."}, {"time": 3667, "text": "Well, we'll see how this whole journey ends."}, {"time": 3667, "text": "Let's actually just step back a little bit and just looking at the employees at the restaurant and so on."}, {"time": 3676, "text": "Do you have remorse for what happened, especially from the perspective of the employees and the staff?"}, {"time": 3681, "text": "I mean, hurting them was sort of the last thing that I would ever have wanted to do."}, {"time": 3687, "text": "And in part, I mean, there was financial harm, but I don't I don't know whether it's more important or not."}, {"time": 3687, "text": "But, you know, it was taking a place that was very much like a family to them."}, {"time": 3704, "text": "And it was as if I destroyed it."}, {"time": 3704, "text": "And so I think that because we were so much like a family, it was almost as if."}, {"time": 3714, "text": "Like mom went off the deep end and got together with some cuckoo abusive guy and and sort of abandoned them and they didn't know what was going on and what was happening."}, {"time": 3724, "text": "And so do you regret lying to them?"}, {"time": 3728, "text": "I regret lying to anybody in all of those circumstances, but I wasn't lying."}, {"time": 3739, "text": "You know, he made me think that, you know, everything was going to be reversed and OK, and anybody that money was borrowed from, they would get it back, you know, maybe tenfold."}, {"time": 3749, "text": "And so it was this weird situation of having like one foot in his reality and potentially believing the things he was saying or even over time wanting to believe them more and more because the alternative was so."}, {"time": 3767, "text": "The alternative was worse."}, {"time": 3767, "text": "The alternative was like."}, {"time": 3767, "text": "Was increasingly a bigger and bigger nightmare."}, {"time": 3773, "text": "So there's this whole situation where you're constantly giving him money, you're constantly borrowing and borrowing money."}, {"time": 3779, "text": "Well, this idea that it'll be repaid like a hundred X fold, right?"}, {"time": 3785, "text": "Kind of like sort of like lying to somebody because you're planning their surprise party."}, {"time": 3790, "text": "You think like, well, I'm lying to somebody, but I'm but it's because there's a good reason."}, {"time": 3795, "text": "Yeah, you know, it's sort of that's not a good example."}, {"time": 3798, "text": "But but you could have not made it a surprise party and be like, pull him in onto the planning of the party and be honest about."}, {"time": 3808, "text": "Like everything that's happening, not in a negative way, but like get him in on the fact that, OK, I just need to give money to this guy, but we'll get he is a super rich person of some kind."}, {"time": 3823, "text": "And he'll repay."}, {"time": 3827, "text": "I mean, I wish I well."}, {"time": 3829, "text": "Because you're holding on to this time."}, {"time": 3832, "text": "That's part of the torture is that you're isolated and unable, unable to tell anybody."}, {"time": 3838, "text": "But you're not unable or he was telling you, you're not allowed to say anything to anybody."}, {"time": 3843, "text": "I mean, you're choosing not to say anything, but it's because of the sort of the weight of it, because it's embarrassing to sort of."}, {"time": 3852, "text": "Is it embarrassing something?"}, {"time": 3854, "text": "I mean, why do you not tell others?"}, {"time": 3856, "text": "You know, what is that?"}, {"time": 3858, "text": "What's what's happening to the mind where you don't tell others?"}, {"time": 3863, "text": "You're part of why the story, you know, everything that happened is hard to summarize and talk about in any concise way is that."}, {"time": 3874, "text": "So much of it happens in this very slow, slow, slow way."}, {"time": 3878, "text": "And, you know, people always use the whole like frog in boiling water example so that by the time you realize you're fucked, it's too late."}, {"time": 3890, "text": "And and it seems hard to believe or understand other people because they see where you are or where you ended up and they think, well, how did you let that happen?"}, {"time": 3899, "text": "Well, I don't know what I have willingly destroyed my life and hurt all the people I care about."}, {"time": 3905, "text": "And, you know, allowed my mother to get hurt and I wouldn't have ever willingly done that."}, {"time": 3911, "text": "So something else must have happened."}, {"time": 3913, "text": "And that's that's the part that's difficult to understand."}, {"time": 3917, "text": "Let me ask you about another hard question."}, {"time": 3920, "text": "Do you deserve most or all of the blame for the failure of the business or are others at fault too?"}, {"time": 3929, "text": "Well, the business didn't fail."}, {"time": 3930, "text": "It was doing well and so it's closing is like it was destroyed."}, {"time": 3939, "text": "Who deserves the blame for that?"}, {"time": 3941, "text": "I'm asking from your perspective when you think about it in the privacy in your mind."}, {"time": 3947, "text": "Are you angry at Anthony or are you angry yourself?"}, {"time": 3953, "text": "I think that in the privacy of my own mind and to everybody listening, it's it's I feel responsible."}, {"time": 3966, "text": "I feel responsible in the same way that if you kind of did something, if you were driving and you did something stupid and caused an accident in which other people died, you would feel, I think, horrifically responsible and you'd blame yourself because maybe you looked away or checked your phone or something."}, {"time": 3987, "text": "But you didn't intend to kill those people, of course."}, {"time": 3991, "text": "So for me, it's like I didn't intend to kill."}, {"time": 3996, "text": "You know, sometimes I say like my own child, I don't know if that's offensive to some people, but it's like as if I killed my own child."}, {"time": 4003, "text": "It was it was it was a business, but it was special."}, {"time": 4006, "text": "So I don't feel guilt."}, {"time": 4012, "text": "I feel responsibility."}, {"time": 4014, "text": "And then, you know, I'm angry at him, even though that anger is pointless."}, {"time": 4023, "text": "OK, because this has come up, let's continue with the hard questions."}, {"time": 4030, "text": "Are they going to get easier?"}, {"time": 4031, "text": "They're going to get easier."}, {"time": 4033, "text": "Most of them are easy."}, {"time": 4034, "text": "This is this is fun."}, {"time": 4036, "text": "You posted on Instagram the ending."}, {"time": 4041, "text": "No, I'm going to say Instagram like it's Shakespeare."}, {"time": 4043, "text": "OK, the ending is disturbingly misleading, but still, I'm very grateful for this coverage."}, {"time": 4049, "text": "It's talking about the documentary, in quotes, documentary."}, {"time": 4054, "text": "I'm OK with the criticism and judgment, but would rather it be based on what's true."}, {"time": 4059, "text": "And then you say a couple more sentences and then you say, and then you say Leon, who has his own Instagram account."}, {"time": 4067, "text": "One lucky rescue dog says hello."}, {"time": 4070, "text": "He loves you all."}, {"time": 4071, "text": "Even if you call me a, quote, defective, arrogant sociopath, it's all OK."}, {"time": 4078, "text": "So the hard question, do you think you are in part a sociopath?"}, {"time": 4085, "text": "Would you know it if you were?"}, {"time": 4088, "text": "So what have you learned from reading this book?"}, {"time": 4090, "text": "I had all these interesting thoughts, all these sort of questions and thoughts about it, because the book I'm reading now that I'm only about a third of the way through, she talks about some of the things in the brain structure that are particular to sociopaths."}, {"time": 4104, "text": "And so then it makes you think, well, what if that could be tweaked in some way?"}, {"time": 4110, "text": "Like, could you unsociopath a sociopath?"}, {"time": 4113, "text": "Is it nature or nurture, I suppose is the question."}, {"time": 4117, "text": "I think it's genetic."}, {"time": 4119, "text": "And then it's like genes that are turned on by things like a particularly violent childhood or some sort of dysfunction."}, {"time": 4130, "text": "So I think somebody could have the gene, it's not turned on, and then the sociopaths have the gene and it's turned on."}, {"time": 4140, "text": "So sociopath means that you're not able to be empathetic or you're generally not empathetic to the suffering of others or to the emotions of others?"}, {"time": 4150, "text": "It's a hollowness."}, {"time": 4151, "text": "So it's like you don't have just completely lacking the capacity."}, {"time": 4158, "text": "I mean, it's tragic because they wouldn't understand or feel love, but it's like a hollowness."}, {"time": 4166, "text": "And then something also about the wiring."}, {"time": 4170, "text": "And I think also because of that hollowness, they're able to incredibly quickly look at others and identify their insecurities and buttons and weak spots."}, {"time": 4184, "text": "So they're incredibly good at manipulation."}, {"time": 4187, "text": "Is that because they're just able to objectively observe the situation?"}, {"time": 4192, "text": "Probably in part, but there was some other explanation related to the brain structure that I read somewhere that made sense to me."}, {"time": 4199, "text": "And I won't remember it because I don't usually... You're not Andrew Huberman who seems to reference perfectly every single line from every book or paper he's ever read?"}, {"time": 4210, "text": "I don't remember things in that way."}, {"time": 4212, "text": "I try to usually remember the conclusions."}, {"time": 4214, "text": "So I might remember that he might give a whole long explanation about why it's good to do this or to take this supplement."}, {"time": 4223, "text": "That's a bad habit I have."}, {"time": 4224, "text": "Sometimes I'll order supplements and then by the time they arrive, I've forgotten why."}, {"time": 4228, "text": "I forgot why."}, {"time": 4229, "text": "Just take them all."}, {"time": 4229, "text": "I'm supposed to take them all."}, {"time": 4230, "text": "Harris Thompson, but the healthy version."}, {"time": 4232, "text": "I hope we get to talk about food because I feel like you have a brain that should be fed only the best food."}, {"time": 4240, "text": "So we can talk about that later."}, {"time": 4241, "text": "I have a lot of philosophies about that, but certainly fluff is not in the best."}, {"time": 4247, "text": "What is best?"}, {"time": 4247, "text": "We'll definitely talk about food throughout."}, {"time": 4254, "text": "That makes me think of Conan."}, {"time": 4255, "text": "And I just talked to Oliver Stone, who I didn't realize wrote Conan the Barbarian."}, {"time": 4261, "text": "Do you know that in my head I pictured Conan O Brien?"}, {"time": 4264, "text": "That's what I was sitting there going, wait, why?"}, {"time": 4269, "text": "But when you said that, I was like, why did that make you think of Conan O Brien?"}, {"time": 4276, "text": "Such a brilliant human."}, {"time": 4283, "text": "So it's stuff about the brain, fine, but how do you know you're not a sociopath?"}, {"time": 4289, "text": "Would you know it?"}, {"time": 4290, "text": "Am I a sociopath?"}, {"time": 4292, "text": "How would I know it?"}, {"time": 4294, "text": "Well, having listened to a lot."}, {"time": 4296, "text": "Well, wouldn't I be able to be good at faking it?"}, {"time": 4298, "text": "Isn't that what?"}, {"time": 4299, "text": "Well, because you would be out there."}, {"time": 4300, "text": "There's a mask on the cover of this book with lipstick."}, {"time": 4303, "text": "I don't think you would be doing the work that you're doing."}, {"time": 4305, "text": "I don't wear lipstick."}, {"time": 4305, "text": "You'd probably be running for office or a trader on Wall Street."}, {"time": 4309, "text": "Or one of the things about sociopaths is they kind of need like the stimulation of risk and danger."}, {"time": 4319, "text": "Well, a need."}, {"time": 4324, "text": "More than average."}, {"time": 4325, "text": "I like, hmm, okay."}, {"time": 4327, "text": "But Wall Street, there's a fakeness, like I don't like the fakeness of the game of it."}, {"time": 4334, "text": "That's why I left."}, {"time": 4335, "text": "I didn't, I just, it was a strange environment."}, {"time": 4340, "text": "So you're not, you're not a quote defective, arrogant sociopath."}, {"time": 4345, "text": "What does defective even mean?"}, {"time": 4346, "text": "Well, I think that somebody had just called me that."}, {"time": 4348, "text": "And I think that, you know, it's easy for people to say like, don't read the comments, but it's hard not to, because then also you'd miss the beautiful ones."}, {"time": 4359, "text": "Or sometimes like you have to go on there to check a private message and you just stuff, it's there, people saying terrible things."}, {"time": 4367, "text": "So I try to, people say, you know, don't pay attention to the comments, it's hard not to, but I try to."}, {"time": 4376, "text": "Even with the documentary, you try to still kind of see, to look, to look for the good ones, for the kind ones, for the supportive ones."}, {"time": 4387, "text": "Well, there were overwhelming kind comments and so that, that helped and felt a lot better, but sometimes, sometimes the, the negative comments are based on, you know, they're based on false information."}, {"time": 4403, "text": "So if somebody understood, if somebody knew everything that happened and then wanted to judge me or say things like that's somehow, at least that's all right."}, {"time": 4412, "text": "But people saying these things based on things that are totally false, it's just, it's hard, it's hard to just let that go."}, {"time": 4425, "text": "But I know that people also say things, you know, for their own personal reasons."}, {"time": 4435, "text": "I had a fascinating exchange with somebody who direct messaged me and called me trash."}, {"time": 4440, "text": "You responded."}, {"time": 4442, "text": "I responded because it was, no, it was amazing."}, {"time": 4446, "text": "So I would do this for a while, it's sort of like, I might be procrastinating or, but I would scroll through because the private messages were overwhelming and there's still just this massive backlog that I'll never probably get to read."}, {"time": 4462, "text": "But the one that called you trash as a pickup, as an opener, you were like, this is interesting."}, {"time": 4468, "text": "I just was in a mood and so I responded and I wish I hadn't deleted it because I sort of deleted a bunch and then I was like, oh, why did I delete that one?"}, {"time": 4478, "text": "Because I was curious what exactly I said to him, but I responded to him in a nice way and then he responded back and then it started this whole back and forth conversation."}, {"time": 4488, "text": "So he was kind quickly or no?"}, {"time": 4492, "text": "And then also like wanted to get to know me and lives in Pennsylvania and was like, I'll come to you."}, {"time": 4498, "text": "You realize if we, you know, if somehow this just turned into like, that would be our, how did you meet story?"}, {"time": 4504, "text": "Well, he called me trash online."}, {"time": 4506, "text": "That's a pretty good."}, {"time": 4508, "text": "He ended up having such an insightful comment."}, {"time": 4512, "text": "I just found it interesting and I think at first he said, I never imagined you'd reply, which is, you know, it's like part of the whole thing with social media, although this guy wasn't anonymous."}, {"time": 4522, "text": "Was not anonymous."}, {"time": 4524, "text": "No, he had a, I think he had a private account, but it's like his name and his face was there."}, {"time": 4528, "text": "People forget that you're a human being when they message you."}, {"time": 4532, "text": "Folks, when you message me, I'm a human being."}, {"time": 4534, "text": "So I told him that that was, you know, like that, that I was hurtful and, and I guess I wanted to understand more why he said it."}, {"time": 4542, "text": "And it was surprisingly insightful, but he said something about, again, I wish I hadn't deleted it."}, {"time": 4548, "text": "But he, he was like, I guess I was just angry because like that guy, he said something like, I guess I was just angry because that guy got you and I would have, you know, so it made me think of the whole like sort of."}, {"time": 4568, "text": "Incel jealousy thing that can be very terrifying if you're female is that like, if you reject a guy, they might turn around and be violent or angry at you."}, {"time": 4584, "text": "And so his."}, {"time": 4586, "text": "Well, to be fair, there's a dormant anger in probably all of us."}, {"time": 4590, "text": "I believe there's a capacity for cruelty and anger and destruction all of us and the whole struggle of life is to emphasize the good stuff."}, {"time": 4602, "text": "So it's not just an Incel thing."}, {"time": 4604, "text": "It's true for men and women, both capable of cruelty."}, {"time": 4608, "text": "That's, that is very true."}, {"time": 4609, "text": "But this one guy, so then you put on my therapist hat."}, {"time": 4613, "text": "We started, what did we start with?"}, {"time": 4617, "text": "I already forgot, but the, oh, Leon."}, {"time": 4620, "text": "He's coming back to sociopath."}, {"time": 4622, "text": "No, no, just, you know, maybe it's not the best idea to answer the comments that start with your trash."}, {"time": 4631, "text": "I don't do it all the time."}, {"time": 4632, "text": "It just, I happened upon that one and I was just in a certain mood."}, {"time": 4635, "text": "I was just in a certain mood."}, {"time": 4636, "text": "Well, let's, let's further offline sort of discuss this mood that you're in because it might get you in trouble at some point in your future."}, {"time": 4650, "text": "Can we just jump back?"}, {"time": 4651, "text": "Speaking of guys that say as an opening to your trash, how did you and Anthony Stranges meet?"}, {"time": 4660, "text": "Can we jump around and tell some of the details here?"}, {"time": 4663, "text": "Because that, I believe the documentary doesn't cover that that well."}, {"time": 4667, "text": "There's some Twitter interactions and you've kind of assumed."}, {"time": 4674, "text": "By the way, I do think you need some social media coaching on this because I think, you know, I have some books you need to read, I think."}, {"time": 4685, "text": "Some manuals on how to use Twitter properly."}, {"time": 4688, "text": "But anyway, apparently you kind of thought that this person who turned out to be, what was his name?"}, {"time": 4695, "text": "He called himself Shane Fox, but he turned out to be Anthony Stranges, that he was somehow friends with Al Baldwin because of their friendly interaction on Twitter."}, {"time": 4704, "text": "And so you started interacting with him."}, {"time": 4706, "text": "And then there was, how did that escalate quickly to meeting?"}, {"time": 4712, "text": "It escalated slowly."}, {"time": 4714, "text": "And I think I'm sure it was intentional because had I met him right away, I would have probably thought like, oh, he's not what I thought he was and no thanks."}, {"time": 4726, "text": "But it was a long time."}, {"time": 4729, "text": "It was many weeks of back and forth conversation digitally one way or another."}, {"time": 4734, "text": "So it was, you know, via Twitter and then via direct message and then we both played Words with Friends back then and we would message in Words with Friends and then eventually, you know, we exchanged phone numbers."}, {"time": 4747, "text": "How does Words with Friends work?"}, {"time": 4750, "text": "I know that's a popular game."}, {"time": 4752, "text": "Is that like Scrabble?"}, {"time": 4753, "text": "It's like Scrabble and you're playing other people and then there's like a chat function."}, {"time": 4759, "text": "And you can chat with them."}, {"time": 4761, "text": "And so you were this intellectual stimulating game and you were what?"}, {"time": 4765, "text": "Like flirting and that kind of stuff."}, {"time": 4768, "text": "Like witty banter."}, {"time": 4771, "text": "AKA flirting."}, {"time": 4774, "text": "But all of that lasted a really long time and he would give me like little tiny bits and pieces of information about himself that made him seem kind of mysterious."}, {"time": 4787, "text": "This is a dark, mysterious man who was a Navy SEAL, strong."}, {"time": 4793, "text": "And he would always imply things versus say them outright."}, {"time": 4796, "text": "So you're kind of always guessing and filling things in."}, {"time": 4799, "text": "Clint Eastwood type of character."}, {"time": 4800, "text": "He's not going to say it outright."}, {"time": 4802, "text": "He's what?"}, {"time": 4803, "text": "He's a Clint Eastwood type of character."}, {"time": 4806, "text": "He's just going to act badass."}, {"time": 4810, "text": "And plus intellectual because of Words with Friends."}, {"time": 4814, "text": "Is that still a thing by the way?"}, {"time": 4815, "text": "Words with Friends?"}, {"time": 4816, "text": "I think it still exists."}, {"time": 4818, "text": "But I feel like if I started playing it again, I would get a little addicted."}, {"time": 4825, "text": "Stick to the coffee addiction."}, {"time": 4826, "text": "One of the interesting things is that I used to think that he like used an app to look up things, but then he would do it in front of me."}, {"time": 4835, "text": "He was really good at it and he could look at the board and just like come up with a hundred point word that I'd never even heard of."}, {"time": 4847, "text": "So I think he had a little bit of that something going on in his brain that was like, I don't know, a little rain mannish or something in the way that he was able to recall."}, {"time": 4857, "text": "I think his recall is incredibly."}, {"time": 4860, "text": "It's important if you lie a lot."}, {"time": 4863, "text": "If you lie a lot, yeah."}, {"time": 4864, "text": "To have good recall."}, {"time": 4866, "text": "So when, it's okay."}, {"time": 4868, "text": "So how did it escalate slowly from Words with Friends to meeting in real life?"}, {"time": 4874, "text": "Like what, you know what?"}, {"time": 4876, "text": "I mean, what, okay."}, {"time": 4877, "text": "I know it's not a love affair."}, {"time": 4880, "text": "That said, when did you kind of get hooked by the, oh, I wonder, you know, like fall in love."}, {"time": 4891, "text": "I think it was just a slow."}, {"time": 4894, "text": "When did you fall in love?"}, {"time": 4895, "text": "It was a slow process and I think he found me at a time when there was sort of a perfect storm of the right conditions for me to fall into whatever I fell into with him because that was heartbroken for the first time in my life."}, {"time": 4913, "text": "Where was the heartbreak coming from?"}, {"time": 4915, "text": "I had split with my boyfriend of four years."}, {"time": 4919, "text": "And that broke your heart."}, {"time": 4922, "text": "I mean, it was, I knew it was a relationship that I knew would end even when I got into it in the first place."}, {"time": 4929, "text": "How did you know?"}, {"time": 4930, "text": "Because he's 15 years younger than me."}, {"time": 4932, "text": "Surely that can't be the only reason it wouldn't work."}, {"time": 4937, "text": "I need to also give you a book on love."}, {"time": 4943, "text": "I'm going to write it."}, {"time": 4946, "text": "That's called a joke."}, {"time": 4947, "text": "Because there's another book that I didn't bring."}, {"time": 4949, "text": "There's no book on Twitter and there's no book on love."}, {"time": 4952, "text": "Because there's actually a book on love that I really like that I think you might like."}, {"time": 4957, "text": "Like love languages?"}, {"time": 4958, "text": "I still have to read that one."}, {"time": 4959, "text": "No, it's called On Love."}, {"time": 4961, "text": "I can't wait."}, {"time": 4963, "text": "I'm going to read the cliff notes."}, {"time": 4965, "text": "It's short by this guy named Alain de Botton."}, {"time": 4969, "text": "French name."}, {"time": 4971, "text": "I don't trust him already."}, {"time": 4973, "text": "No, it's funny and it's beautiful and shocking that he wrote it when he was very young."}, {"time": 4978, "text": "And I first heard him on a Krista Tippett podcast."}, {"time": 4982, "text": "That's how I end up reading a lot of books is like you hear somebody on a podcast."}, {"time": 4988, "text": "So you were heartbroken."}, {"time": 4991, "text": "You knew it wasn't going to work."}, {"time": 4992, "text": "I knew it wasn't going to work."}, {"time": 4993, "text": "Because of the age difference."}, {"time": 4995, "text": "That's just because of the age difference also."}, {"time": 4998, "text": "I just knew that eventually he'd want to move on and probably he'd find somebody younger and or was young enough that he still needed to go have a bunch of other experiences."}, {"time": 5010, "text": "And, you know, probably wanted a family or whatnot eventually."}, {"time": 5014, "text": "So he was 21 and I was 34 when we first met."}, {"time": 5022, "text": "But and but then we ended up living together for four years and it was the most drama free."}, {"time": 5028, "text": "Like there was no drama."}, {"time": 5030, "text": "And I had just come off my prior relationship was Matthew Kenny, which was very dark in many ways and full of all kinds of."}, {"time": 5042, "text": "And I just couldn't couldn't handle that."}, {"time": 5044, "text": "So ask you a personal question."}, {"time": 5047, "text": "Between us and between us friends."}, {"time": 5051, "text": "Is there a part of you that's attracted to the drama and the chaos?"}, {"time": 5057, "text": "Now, looking back."}, {"time": 5061, "text": "I feel like that happens a lot."}, {"time": 5063, "text": "And maybe there was at some point, but I don't think so."}, {"time": 5070, "text": "Because, you know, what made that relationship work with his name was Tobin was that there was no drama."}, {"time": 5083, "text": "And I don't think I could have handled it."}, {"time": 5085, "text": "And I feel that way now, too, like I just couldn't."}, {"time": 5087, "text": "I can't like fighting or any kind of like the people being passive aggressive."}, {"time": 5092, "text": "I can't I can't handle that."}, {"time": 5095, "text": "So you've had enough storms."}, {"time": 5097, "text": "Now you want the calm."}, {"time": 5101, "text": "So you knew it wasn't work."}, {"time": 5103, "text": "I knew it was going to work forever."}, {"time": 5105, "text": "Well, that that could be just insecurity and cynicism."}, {"time": 5109, "text": "But fair enough."}, {"time": 5110, "text": "And then the heart was broken."}, {"time": 5113, "text": "Yes, and now the heart was broken and fragile and there to be manipulated in some sense."}, {"time": 5124, "text": "And there's another person that I heard that I quoted my book saying that when you're heartbroken, you can't rely on your instincts."}, {"time": 5134, "text": "Somehow your instincts are compromised when you're heartbroken."}, {"time": 5138, "text": "And maybe I'm just like looking for excuses."}, {"time": 5141, "text": "No, no, it's true."}, {"time": 5143, "text": "But I was heartbroken and then."}, {"time": 5147, "text": "I like to see people when they're heartbroken because it's like shows how much they really loved somebody."}, {"time": 5159, "text": "But like sometimes love doesn't reveal itself as richly when you're in it versus when you lose it."}, {"time": 5168, "text": "That's probably true."}, {"time": 5169, "text": "Anyway, so your judgment wasn't good."}, {"time": 5173, "text": "So now you're so you're lonely and you're super busy running the restaurant."}, {"time": 5178, "text": "But when you get home, you're lonely or like in between."}, {"time": 5184, "text": "And I was kind of overwhelmed."}, {"time": 5185, "text": "And I'm sure you were getting a lot of really positive attention from other guys to, well, New York."}, {"time": 5195, "text": "Or too busy."}, {"time": 5196, "text": "No, because because it was a restaurant, there was constantly you're like constantly meeting people and really interesting people."}, {"time": 5204, "text": "And New York is full of a lot of interesting people."}, {"time": 5210, "text": "And you're, you know, attractive."}, {"time": 5213, "text": "So why are you connected to some mysterious distant man from somewhere else playing over words?"}, {"time": 5221, "text": "Because well, I think now looking back, I think it's because I felt like he understood me."}, {"time": 5227, "text": "And, you know, what was that feeling from coming from you think like what?"}, {"time": 5232, "text": "Why did you why does one feel that you're understood?"}, {"time": 5236, "text": "One thing that made me extra easy to target is that I had written a lot of very personal blogs and things."}, {"time": 5243, "text": "In addition to him asking me questions and me probably just being insanely open and answering whatever he asked me, I had also written and posted a bunch of personal blogs."}, {"time": 5253, "text": "Some of them I've reposted on my new website and then some of them I haven't."}, {"time": 5258, "text": "But in one of them, I go into detail about my frustrations professionally in growing the business."}, {"time": 5268, "text": "And having read that and being a very smart person, he would have known kind of precisely what to say to get me to get me drawn in."}, {"time": 5280, "text": "So I think by waiting so long before we met in person, he'd already he'd already gotten me hooked in a way that was going to then make it possible for me to see him."}, {"time": 5293, "text": "And even though he doesn't look like I thought he did, I'll make excuses for it."}, {"time": 5293, "text": "Or I mean, it's a dangerous thing about when people and I'm not saying I fell in love with him in this way."}, {"time": 5305, "text": "I feel like there's another explanation for the what felt like love."}, {"time": 5310, "text": "But when people fall in love quickly, there's that danger that because that's what happens first, that the more you learn about them, you'll sort of rationalize away things that might be red flags or things that you don't like."}, {"time": 5325, "text": "So I think it's safer to fall in love when you get to know somebody not in the context of dating them, like Jim and Pam on The Office."}, {"time": 5325, "text": "Did you watch The Office?"}, {"time": 5344, "text": "Yeah, of course I watched The Office."}, {"time": 5344, "text": "British Office is better."}, {"time": 5344, "text": "But yes."}, {"time": 5344, "text": "So well, yeah, fine."}, {"time": 5355, "text": "It might be a bit romantic."}, {"time": 5356, "text": "Yeah, I like the romantic."}, {"time": 5356, "text": "Yeah, it's fine."}, {"time": 5356, "text": "But just I think the better lesson is, yes, that's one thing to say, but the other is like when you see the red flags, notice them, be a little better about noticing them, even amidst the passion."}, {"time": 5373, "text": "What if a brilliant woman kind of threw herself in your path?"}, {"time": 5373, "text": "Because talking on a podcast is a little bit like having a blog where you overshare because people learn everything about you, what you like, what you don't like, what your wants and dreams."}, {"time": 5390, "text": "So some woman could pretend to throw herself in your path seemingly accidentally, and then you meet."}, {"time": 5399, "text": "She has a Russian accent and probably works for FSB."}, {"time": 5403, "text": "No, but whatever."}, {"time": 5403, "text": "She is who she is, and then she sort of slides into the conversation like a quote from The Idiot."}, {"time": 5403, "text": "And you're like, boom."}, {"time": 5417, "text": "But she's not who she, that's all a pretend."}, {"time": 5417, "text": "And so you very quickly could fall in love with her, and she's going to turn out to enjoy the game of destroying your life."}, {"time": 5431, "text": "That or it's the love of my life."}, {"time": 5436, "text": "It could be, but not if she did all those things intentionally."}, {"time": 5439, "text": "But you don't really know."}, {"time": 5439, "text": "But you have to then pay attention to, that's the dark aspect here."}, {"time": 5439, "text": "You mentioned blog."}, {"time": 5447, "text": "I love when people have stuff about themselves online because you get to really learn."}, {"time": 5447, "text": "I mean, I'm a fan of podcasts."}, {"time": 5447, "text": "I'm a fan of people."}, {"time": 5455, "text": "I love learning about them, the personal stuff and so on, hopefully for good reasons."}, {"time": 5461, "text": "So the people you connect with, the good ones are the ones that are going to be very sort of empathetic."}, {"time": 5461, "text": "And the bad ones are the ones that are going to be fake empathetic."}, {"time": 5472, "text": "Like they're going to learn everything about you and use you to manipulate you as opposed to learn everything about you to fall deeper in love with you as a friend or as a romantic partner."}, {"time": 5483, "text": "Or like genuine curiosity."}, {"time": 5485, "text": "Yeah, genuine curiosity."}, {"time": 5485, "text": "Like there's something you're drawing."}, {"time": 5485, "text": "Like imagine your dog, Leon, had a blog after."}, {"time": 5485, "text": "Oh yeah, he does now."}, {"time": 5494, "text": "He kind of does."}, {"time": 5495, "text": "When you met him, right?"}, {"time": 5495, "text": "Then you'd be like, what is this?"}, {"time": 5495, "text": "What is there that's pulling me towards this creature, this entity?"}, {"time": 5507, "text": "And it'd be fascinating to learn more and then you fall in love with the details, not just with some kind of ethereal thing."}, {"time": 5514, "text": "Yeah, you don't know."}, {"time": 5514, "text": "You have to pay attention to the red flags."}, {"time": 5540, "text": "But I mean, on the other side, when you meet people, yeah, I still like the falling in love."}, {"time": 5540, "text": "Because the red flags, whether you see them early or later, it doesn't matter."}, {"time": 5540, "text": "I'd rather see the red flags right away."}, {"time": 5554, "text": "Just get to know a person."}, {"time": 5554, "text": "Get to know quickly."}, {"time": 5554, "text": "Get to know the person."}, {"time": 5554, "text": "Challenge."}, {"time": 5571, "text": "Travel with them."}, {"time": 5572, "text": "Travel with them is really powerful."}, {"time": 5572, "text": "Road trip from hell or not, go on a road trip and find out if it's a road trip from hell."}, {"time": 5602, "text": "So you literally baggage the ex."}, {"time": 5646, "text": "And then he pretended to get incredibly upset and to feel horrible and remorseful about it and it was like all we talked about for the next few hours and then I kind of thought like, well, okay, you know, I can get over that and then the relationship continued and it was a dark and destructive one."}, {"time": 5665, "text": "Whereas, you know, had I seen him behave that way before we were in a relationship, I would have known to back away."}, {"time": 5676, "text": "You could still walk away."}, {"time": 5703, "text": "I mean, it's like being in a cult of one."}, {"time": 5703, "text": "So the people who've been in cults and gotten out, we understand each other very well because the same psychology was used, the same psychological tactics were used on us."}, {"time": 5722, "text": "And then we experienced the same thing on the other side of it, which is it's hard for us to understand and it's hard for other people to understand and everybody's saying that would never happen to me or they're saying, I don't get it because you're smart, how could you let that happen?"}, {"time": 5734, "text": "Why didn't you leave?"}, {"time": 5734, "text": "Why didn't you walk away?"}, {"time": 5734, "text": "And on the other side of it, we don't have the answers or it takes a really long time of self reflection and reading and investigation to try and figure out how it is that it happened and why didn't we walk away."}, {"time": 5768, "text": "There are some people that kind of thrive on conflict."}, {"time": 5771, "text": "But you should still just be self aware like I think you've talked about, give yourself time to think about the red flags and like I pride myself on being able to walk away."}, {"time": 5783, "text": "You have to think like is this the kind of thing I can live with in friendship and business partners and because the little things that bother you turn out to be big things down the line."}, {"time": 5811, "text": "It's safer."}, {"time": 5812, "text": "I like it though."}, {"time": 5814, "text": "But that's again my Russian slash Ukrainian male perspective."}, {"time": 5821, "text": "Anyway, so, Meeting Mr. Fox."}, {"time": 5828, "text": "Anthony."}, {"time": 5829, "text": "That's a chapter title in my book, Meeting Mr. Fox."}, {"time": 5832, "text": "Meeting Mr. Fox."}, {"time": 5833, "text": "So you're working on a book about this."}, {"time": 5837, "text": "I'm almost done."}, {"time": 5838, "text": "It's taken a really long time."}, {"time": 5840, "text": "Can you define almost done?"}, {"time": 5843, "text": "Because I've said that it's like when people say like they're leaving, like I'm almost in the car."}, {"time": 5855, "text": "They're not really."}, {"time": 5856, "text": "They haven't even started the showering yet or something."}, {"time": 5858, "text": "Yeah, I think I probably need some like therapist to work with me on this."}, {"time": 5864, "text": "Are you usually late to things?"}, {"time": 5883, "text": "I'm like always early."}, {"time": 5886, "text": "So I'm loitering outside like a weirdo but glad to come in if it's not too early."}, {"time": 5892, "text": "The crippling fear of being late makes me chronically early and today is no exception."}, {"time": 5898, "text": "So I got here before I rang the bell."}, {"time": 5901, "text": "I was outside for a little while like just killing time going I'm way too early."}, {"time": 5906, "text": "But it's really hot out."}, {"time": 5931, "text": "It's in word count."}, {"time": 5932, "text": "So all the things are already completed and you're just editing down or just things aren't written?"}, {"time": 5936, "text": "No, I wish."}, {"time": 5937, "text": "It's in five parts and I've written one through four."}, {"time": 5941, "text": "And part five is like the chapters are all there but some of them are messy."}, {"time": 5946, "text": "Some of them are just like a few paragraphs."}, {"time": 5949, "text": "Some of them are just notes."}, {"time": 5951, "text": "Some of them are done."}, {"time": 5960, "text": "But I've been editing along the way."}, {"time": 5964, "text": "So this is going to come out in 2023, I think you mentioned."}, {"time": 5967, "text": "So it won't come out for a bit or we'll figure it out."}, {"time": 5972, "text": "What have you learned about yourself from putting some of these things down on paper?"}, {"time": 5977, "text": "What's like the darkest thing you've realized about yourself from writing?"}, {"time": 5998, "text": "Oh, so he had access to your email."}, {"time": 6002, "text": "He deleted it on that side too."}, {"time": 6007, "text": "And then at the end was also emailing people as me which was incredibly mortifying to come home and then get back into my old email and find that."}, {"time": 6017, "text": "And I think he was also texting people as me and those I'll never know unless somebody brings it to my attention because after a certain date in 2015, he had my phone and he had exclusive access to my phone and email."}, {"time": 6047, "text": "So I don't know what he texted to other people as me after that time."}, {"time": 6066, "text": "It was like if you work with people and you use Gmail, it's a really easy way to just message back and forth."}, {"time": 6070, "text": "It's a chat client within Google but I think Google shut it down already or no?"}, {"time": 6074, "text": "I think it's still there."}, {"time": 6088, "text": "People don't love Google social products for some reason."}, {"time": 6092, "text": "The social network they tried several times, Google Plus, it just dies out."}, {"time": 6102, "text": "Anyway, it is very lonely in that Google chat window."}, {"time": 6106, "text": "It makes total sense though."}, {"time": 6107, "text": "Anyway, so that was still there so you're reading through them."}, {"time": 6113, "text": "And then I kept finding like more layers of stuff including a journal that I didn't find the DA, the prosecutor found."}, {"time": 6123, "text": "Written by?"}, {"time": 6124, "text": "Me."}, {"time": 6125, "text": "My journal that I thought he'd thrown away."}, {"time": 6127, "text": "I didn't know it existed."}, {"time": 6128, "text": "So somehow he still had it and they found my journal which was for the year 2014 and the very beginning of 2015."}, {"time": 6144, "text": "It was in the middle of it, yeah."}, {"time": 6145, "text": "So reading that was fascinating."}, {"time": 6149, "text": "Yeah, what's some interesting things there?"}, {"time": 6157, "text": "It was weird because no."}, {"time": 6161, "text": "Were you concerned?"}, {"time": 6162, "text": "Were you in love?"}, {"time": 6163, "text": "Were you afraid?"}, {"time": 6164, "text": "I was not in love."}, {"time": 6166, "text": "I definitely write repeatedly in there that I'm afraid of him."}, {"time": 6170, "text": "I also write repeatedly things like I don't know what's going on, like please let this be over, please let this be over, please let this be over."}, {"time": 6193, "text": "I was trying to be positive."}, {"time": 6214, "text": "I haven't read it yet, but as soon as I get a PDF copy, I'll send it to you."}, {"time": 6229, "text": "But, you know, nobody's writing a journal thinking that."}, {"time": 6232, "text": "I can just imagine like a 14 year old thinking they're going to be a historical person, right?"}, {"time": 6238, "text": "Well, no, I mean like, you know, presidents who keep journals and then they're later on."}, {"time": 6243, "text": "So you write it."}, {"time": 6244, "text": "You don't think anybody's going to read it."}, {"time": 6246, "text": "And so that was a weird feeling."}, {"time": 6264, "text": "So it was in my own handwriting, which I could read really fast because even though it's messy, I wrote it so I could read it really fast."}, {"time": 6270, "text": "And I read the whole thing and was crying because I thought, okay, finally, like, surely nobody could read this and think that I intended to commit crimes."}, {"time": 6293, "text": "You're responsible."}, {"time": 6294, "text": "You know, here's probation."}, {"time": 6297, "text": "But it didn't seem to make any difference, which was strange."}, {"time": 6323, "text": "Like the more they turned up, the better for me because I wanted them to see everything."}, {"time": 6328, "text": "And there are just so many examples in the correspondence between him and me where he's, you know, threatening me and, you know, lying to me and telling me that if I don't do what he says, my whole life will be destroyed and I'll lose everything I ever cared about, all kinds of things like that."}, {"time": 6343, "text": "But what I still don't quite understand and what one of my lawyers said why all of that wasn't as useful as I thought it might be is because so much of that correspondence, I'm like sarcastically, angrily."}, {"time": 6361, "text": "I'm yelling at him."}, {"time": 6362, "text": "I'm mad at him."}, {"time": 6364, "text": "I'm making fun of him."}, {"time": 6365, "text": "I call him names."}, {"time": 6367, "text": "I'll say to him, like, you're lying."}, {"time": 6370, "text": "You told me you'd pay me back before, but you didn't."}, {"time": 6373, "text": "So it seems like it doesn't make sense."}, {"time": 6393, "text": "And then I'll look at my timeline of things and I'll see, oh, I sent him a wire for $80,000."}, {"time": 6400, "text": "How do you explain your ability to still joke around and also to be mean to him in a joking way?"}, {"time": 6411, "text": "Couples can do that."}, {"time": 6415, "text": "There's cruel ways of doing that and then there's humorous ways, just like you're talking shit, whatever."}, {"time": 6421, "text": "You were able to do that still and yet you're sending over the money and are afraid."}, {"time": 6428, "text": "Like how can you be those two things?"}, {"time": 6432, "text": "Like as opposed to completely shutting down."}, {"time": 6437, "text": "I mean, these are all interesting questions that I have as well."}, {"time": 6439, "text": "Like how is it that I was functional and yet also doing these things."}, {"time": 6445, "text": "And so the year that we were gone is like a different level because I no longer was running the business."}, {"time": 6452, "text": "But the thing about dissociation is that you're functioning but like your feelings and your thinking are detached in some way so that like you're functioning and people wouldn't look at you and go, oh, that person is dissociating because you're functioning."}, {"time": 6467, "text": "You seem normal but somehow in your head you're like disconnecting your feelings and your thinking."}, {"time": 6474, "text": "So you're still able to be like the game of social interaction and being witty and so on, all that kind of stuff."}, {"time": 6482, "text": "For me, I think it's like a coping mechanism too because I haven't been to a funeral in a long time but if I went, I'd probably like find absurd thing or I'll tend to like either make jokes or want to make jokes at really inappropriate times, even in tragic times because it's almost like a defense mechanism, I think."}, {"time": 6505, "text": "Like you said, you told me you like dark humor."}, {"time": 6510, "text": "My next door neighbor is Michael Malice."}, {"time": 6514, "text": "I have one of his books."}, {"time": 6516, "text": "The Hero?"}, {"time": 6517, "text": "Dear Reader."}, {"time": 6518, "text": "Dear Reader, yeah."}, {"time": 6519, "text": "And he loves, he embodies dark humor, trolling and dark humor and is underneath the sweetest human being."}, {"time": 6526, "text": "He's writing a book now, The White Pill, that's really focused on Stalin and the Holodomor."}, {"time": 6534, "text": "There's basically atrocities throughout the 20th century and I think he needs the dark humor to release the valve."}, {"time": 6542, "text": "I think there's something about incredibly good, the most offensive comedians tend to have the kindest hearts, I think."}, {"time": 6552, "text": "This is my theory."}, {"time": 6553, "text": "People like Ricky Gervais, who goes out and insults people and makes jokes that people find horribly offensive and crude and yet is a huge animal rights guy and appears to be an incredibly sweet and kind person and sensitive."}, {"time": 6574, "text": "And Howard Stern, people who are like incredibly crude very often are, in my experience, to the extent that I've gotten either to know people personally, observe them, learn about them in other ways, but almost like the more crude and offensive, the comedian or the person, they tend to have the kindest."}, {"time": 6599, "text": "Yeah, I don't know if it's a universal rule, but yeah, I see what you mean."}, {"time": 6602, "text": "And you lost me with Howard Stern."}, {"time": 6604, "text": "He seems like not a good person."}, {"time": 6606, "text": "Oh no, he's such a good person."}, {"time": 6607, "text": "Underneath it, in short."}, {"time": 6608, "text": "Oh yeah, such a good person."}, {"time": 6609, "text": "He's just said so much, so I'm friends with Rogan, he said so many ignorant things about Rogan, but I suppose that's..."}, {"time": 6616, "text": "So I haven't heard, I haven't listened to Howard Stern in a long time."}, {"time": 6620, "text": "And I also think that people who say bad things about Rogan don't listen to his podcast."}, {"time": 6627, "text": "Because I've listened to his podcast and people think that, I think people would assume that I don't like him because, or the whole like vegan thing and he's all about meat and they would think that I would think, no."}, {"time": 6642, "text": "Because I've listened to enough of his podcast, I've heard the one where he talked about why he hunts, whereas if I only knew him via his Instagram, I might think he's an asshole."}, {"time": 6657, "text": "But having listened to all of his, not all of, I don't listen to all of them, there's a ton of them, but having listened to a lot of his podcasts, enough to know that he's an extremely kind person with all the best intentions."}, {"time": 6672, "text": "And I think that a lot of that judgment comes from people who are just seeing little clips."}, {"time": 6677, "text": "It's probably easy to take little clips from him that sound... Yeah, the lesson there is just not make judgments on people without getting to know them, especially, and you have no excuse when the content is out there, like, don't be lazy."}, {"time": 6688, "text": "Yeah, I try."}, {"time": 6688, "text": "That's, yeah, I'm very careful when, you know, a lot of these cases, you know, like the, the Depp herd thing or, oh, Johnny Depp and Elizabeth Holmes and anything like controversial."}, {"time": 6705, "text": "And sometimes that makes me, I can't think of an example, but very often, like when somebody criticizes something or something becomes controversial, that's what gets me to want to understand it better."}, {"time": 6717, "text": "So then I'll go like read the book that everybody's mad about."}, {"time": 6720, "text": "Yeah, it's hard to know what's true though."}, {"time": 6722, "text": "I tried to have humility and always assume I don't really know the full story and keep pulling at the string, keep learning more and more."}, {"time": 6722, "text": "But even then, like, the more you learn, the more you realize the things are complex."}, {"time": 6735, "text": "What do you think about as a small tangent, Johnny Depp, Amber Heard, trials going on, it's a quick pause, it's going to resume next week."}, {"time": 6746, "text": "So again, this is one of those situations where, you know, I have very limited information because I'm also not sitting there watching the trial."}, {"time": 6753, "text": "Have you watched any of it?"}, {"time": 6754, "text": "Little bits of it."}, {"time": 6754, "text": "And it's like, I know that if I go there, then I'm going to want to watch it all."}, {"time": 6762, "text": "It's raw human relationships that is most toxic and it's most deep also because there's you can tell there's love probably still there's love, which is the interesting thing."}, {"time": 6762, "text": "They probably still love each other even though they hate each other."}, {"time": 6777, "text": "And like there's a lot of lying going on."}, {"time": 6780, "text": "It looks like it's Amber Heard lying to my foolish eyes."}, {"time": 6780, "text": "It seems like she's lying nonstop."}, {"time": 6780, "text": "But, you know, I want to know the full story and we'll never get to know it."}, {"time": 6792, "text": "But you see this raw, like postmortem on a relationship on a love affair that was clearly passionate."}, {"time": 6799, "text": "There was clearly something deep of a connection there."}, {"time": 6799, "text": "And it just that's the sad thing about love."}, {"time": 6805, "text": "It can destroy you as much as it can uplift you."}, {"time": 6808, "text": "It can be also used to destroy people."}, {"time": 6811, "text": "Yeah, to manipulate and all that kind of stuff."}, {"time": 6813, "text": "So people who feel strongly are, I think, particularly vulnerable."}, {"time": 6821, "text": "Yeah, it's it's hard to talk about because I've dipped into like a podcast or something where other people are discussing bad vegan and like a pop culture way and they're analyzing it."}, {"time": 6821, "text": "And it's so annoying to listen to."}, {"time": 6838, "text": "So I'm like, oh, my God, that's totally wrong."}, {"time": 6838, "text": "That's totally wrong."}, {"time": 6838, "text": "Well, if they only knew this, well, I have no that's wrong."}, {"time": 6843, "text": "So, you know, listening to other people analyzing my situation or my psychology when they don't have all the information has been really frustrating."}, {"time": 6856, "text": "There's a difference because the world doesn't know much about you except for the Netflix documentary."}, {"time": 6862, "text": "There's a lot more information about both Johnny Depp and Amber Heard and The Trial is revealing the real people."}, {"time": 6862, "text": "This one is so interesting."}, {"time": 6869, "text": "But I haven't watched it all."}, {"time": 6870, "text": "OK, but there's a difference between a documentary and like a raw human being sitting there."}, {"time": 6876, "text": "The real trial."}, {"time": 6877, "text": "You can see the body language."}, {"time": 6879, "text": "It's so interesting that I think you could tell the difference between a person who is full of shit and not."}, {"time": 6890, "text": "It's another."}, {"time": 6890, "text": "I'm going to."}, {"time": 6892, "text": "And sorry."}, {"time": 6892, "text": "I keep interrupting you."}, {"time": 6892, "text": "But on top of this, there are actors, too, which is very annoying."}, {"time": 6900, "text": "Because like I don't know if they're putting it be sure as hell looks like Amber Heard is putting on like a soap opera act."}, {"time": 6906, "text": "Soap opera meaning like really bad acting and lies."}, {"time": 6910, "text": "But I would say all of these things are really hard."}, {"time": 6914, "text": "People would say about me, I don't look like a victim."}, {"time": 6917, "text": "And I don't mind you interrupting me because Andrew Huberman said that that means you're interested in the conversation."}, {"time": 6923, "text": "He said it was a good thing."}, {"time": 6925, "text": "So you don't have to apologize for interrupting me."}, {"time": 6929, "text": "It keeps coming up, but I keep thinking of these."}, {"time": 6932, "text": "That's one of the things that Andrew told me that I'm like, are you sure?"}, {"time": 6936, "text": "Because it just does seem like an asshole thing to do."}, {"time": 6939, "text": "I guess it depends on the context."}, {"time": 6941, "text": "If we're in a business meeting and somebody talks over you to kind of make their point heard."}, {"time": 6946, "text": "But if it's a one on one situation, then it's not."}, {"time": 6948, "text": "I could argue that forever."}, {"time": 6950, "text": "But so a long time ago, I listened to there was a audio call, an audio that was released of a taped argument between Johnny Depp and Amber Heard."}, {"time": 6961, "text": "And I don't remember why, like which one of them had taped it and if they knew it was being taped."}, {"time": 6966, "text": "But it was like an hour and a half."}, {"time": 6967, "text": "And I listened to it almost like you would listen to a podcast where I was doing other things, like cleaning my apartment."}, {"time": 6972, "text": "And I was fascinated listening to it to a fight."}, {"time": 6974, "text": "So I was and it's interesting, too, because it was just the audio, not so you're not looking at their body language, which can be completely misleading."}, {"time": 6983, "text": "And there was another podcast where they talked about how judges make worse decisions on whether or not somebody deserves parole or to be released on bail when they see the person in person versus if they're just looking at the information on paper."}, {"time": 6999, "text": "So I think body language and those kinds of things can be can actually be misleading."}, {"time": 7005, "text": "Or we think that like by looking somebody in the eye will know if they're lying or not, but the skilled liars are able to bypass that or they because I'm jumping all over the place."}, {"time": 7017, "text": "But one of the things about sociopaths is they're not going to have the same tell."}, {"time": 7021, "text": "So like if I was lying, somebody would know because I'm like stressed out, mortified, I'm probably doing all the things that we do when we lie because it's stressful for me, whereas they don't have those things."}, {"time": 7033, "text": "So I think that, you know, they could, for example, I think that they could pass a lie detector test."}, {"time": 7039, "text": "They also don't have like a startle response."}, {"time": 7042, "text": "So the activity in their brain, like if you and I watch something graphic and tragic on TV or watch something happen, like things would happen in our brains that don't happen in the brains of sociopaths."}, {"time": 7054, "text": "So they don't react to things in the same way that that we do."}, {"time": 7058, "text": "Again, you keep assuming I'm not associated."}, {"time": 7060, "text": "I didn't say I'm not associated, Beth."}, {"time": 7062, "text": "This assumption you keep making is very interesting."}, {"time": 7064, "text": "Then why did I murder all those people?"}, {"time": 7066, "text": "Let's get back to the what were we talking about?"}, {"time": 7069, "text": "Johnny Depp and Amber Heard."}, {"time": 7070, "text": "So the audio that I heard made me, without knowing anything else, made me very inclined to be Team Johnny Depp."}, {"time": 7081, "text": "Based on that, just based on that audio."}, {"time": 7084, "text": "Well, that's how the people are feeling about this whole interaction."}, {"time": 7087, "text": "By the way, I do think it's a very healthy thing to do in a relationship is to record each other for months at a time."}, {"time": 7092, "text": "Every time you fight, that just seems like a very, that's sarcasm."}, {"time": 7097, "text": "I don't understand how that, because they both recorded each other."}, {"time": 7100, "text": "I suppose you could look back at all human relations and be like, this was ridiculous."}, {"time": 7108, "text": "But when you're in it, you don't."}, {"time": 7112, "text": "I wondered that too."}, {"time": 7113, "text": "Like who made the recording and why?"}, {"time": 7115, "text": "And did they both know about it, that it was being recorded?"}, {"time": 7121, "text": "Sometimes they did."}, {"time": 7122, "text": "Sometimes they didn't."}, {"time": 7123, "text": "All I know is just the poetry of Johnny Depp's speaking and sort of movement about the whole thing."}, {"time": 7135, "text": "It makes you wonder what's real."}, {"time": 7137, "text": "Maybe this is whole, maybe they're both in love and this is like a troll that they played on the world."}, {"time": 7145, "text": "It makes me wonder what's real at all."}, {"time": 7151, "text": "Because you have to remember they're actors too."}, {"time": 7154, "text": "Yeah, I don't think he would have filed a lawsuit."}, {"time": 7157, "text": "No, I mean, I'm joking."}, {"time": 7160, "text": "But no, I mean, my point is if somebody was trying to make the argument that like he's the abuser and that he's lying and he's full of shit, it sort of doesn't make sense that he would have filed a lawsuit unless he's trying to have this all come out in the open because he believes he's in the right."}, {"time": 7183, "text": "You know, again, I have no idea."}, {"time": 7186, "text": "As a fan of love and human nature, I appreciate the fact that they went through this."}, {"time": 7191, "text": "I know it's probably extremely painful."}, {"time": 7193, "text": "But it's fascinating to watch human relationships be presented in such a wrong way and it made me realize how rare it is to get a glimpse like that."}, {"time": 7204, "text": "Yeah, and I think one of the reasons I like that book Confessions of a Sociopath also is it's, you know, female who's writing it."}, {"time": 7212, "text": "And I think statistically men are more likely to be sociopaths, maybe not."}, {"time": 7218, "text": "I mean, these are all things where a lot of times there exist statistics that would be inherently hard to get."}, {"time": 7228, "text": "So who knows?"}, {"time": 7230, "text": "But I think that people tend to think of sociopaths more as men and then which probably gives female sociopaths the advantage in that people are less likely to like the Elizabeth Holmes, like people who are really manipulative and really good at it."}, {"time": 7251, "text": "And part of how they're able to succeed is that people don't understand their motives or people will assume that people behave rationally, even if rationally means it's like Anthony Stranges."}, {"time": 7265, "text": "You know, it would have made more sense if he had gotten all this money out of me and, you know, put it in an overseas account and then ditched me and got on a plane to Mexico, like everybody would understand that more."}, {"time": 7277, "text": "Whereas, you know, the way things happened and he dragged me around the country and like, what were we doing in Tennessee?"}, {"time": 7285, "text": "And then why didn't like nothing really makes any sense."}, {"time": 7290, "text": "But and also all of the things that he did to me and had me do, it was as if all of those things together only make sense if his primary goal was to maximally destroy me and also make it like have me burn all my bridges and make it so I'll never recover."}, {"time": 7311, "text": "And when you read a book like that, you understand that that's that's what he wanted."}, {"time": 7316, "text": "Like, that's his life."}, {"time": 7316, "text": "It's like a game."}, {"time": 7320, "text": "Like, what do you think?"}, {"time": 7321, "text": "It's about power and it's a game."}, {"time": 7323, "text": "Do you think he understood the long term goals he has or was it the short term game of it that he enjoyed, the ability to destroy you?"}, {"time": 7330, "text": "Well, yeah, it was the short term game of it."}, {"time": 7333, "text": "To control another human?"}, {"time": 7335, "text": "And also, I think for him, like, the motivations are just different."}, {"time": 7335, "text": "So, you know, he spent a year incarcerated because he never got out on bail."}, {"time": 7348, "text": "But then he got out."}, {"time": 7350, "text": "He's out of prison, though."}, {"time": 7352, "text": "He got out before I went in to serve my time, which was particularly, you know, like, psychologically, I had to try really hard not to be infuriated."}, {"time": 7369, "text": "But anyway, so I think for him, you know, the consequence of spending time in jail is sort of like an inconvenience."}, {"time": 7376, "text": "You know, it's like life is a game."}, {"time": 7379, "text": "And so he wouldn't feel if you're not capable of being emotionally hurt, then you're, you know, you have immense power because you can go around and do things."}, {"time": 7392, "text": "And people can't hurt you."}, {"time": 7392, "text": "It's like a superpower."}, {"time": 7395, "text": "And he did this for people who are not familiar."}, {"time": 7395, "text": "I guess he did this to other women."}, {"time": 7403, "text": "I think it was in the documentary that his, I guess, ex wife from somewhere else."}, {"time": 7413, "text": "Of course, Florida."}, {"time": 7416, "text": "Strong, strong words."}, {"time": 7418, "text": "Well, it's just like when there's the weirdest story about, you know, people eating Tide pods and then doing crazy."}, {"time": 7425, "text": "It's like it's always in, it's always in Florida."}, {"time": 7427, "text": "So I feel like whenever crazy things, so to me it makes sense that he would have spent time in Florida before and that's where."}, {"time": 7433, "text": "Crazy in a good way."}, {"time": 7434, "text": "And I mean that on an insult on him."}, {"time": 7436, "text": "I also like she's an amazing person."}, {"time": 7439, "text": "So it's like it's him that I'm making the like Florida is a bit weird."}, {"time": 7445, "text": "Yes, he manipulated her as well, lied to her, that kind of things."}, {"time": 7450, "text": "Well, jumping around, but one of the things you said that was disturbingly misleading is the ending of the documentary."}, {"time": 7457, "text": "And the ending has a phone call, I think, of you and Anthony talking."}, {"time": 7464, "text": "So high level, let me ask."}, {"time": 7467, "text": "How many times have you talked with Anthony since you got out of prison and what did you talk about?"}, {"time": 7475, "text": "And why is that quote misleading, that segment of audio misleading?"}, {"time": 7481, "text": "My issue with it also was that it was deliberately misleading, which was what was particularly infuriating about it."}, {"time": 7492, "text": "And then also there was, it was like there were things, one major thing that was incorrect that I think helped allow people to make an incorrect conclusion at the end was in the film it talks about, I say something about how my accountant made a joke about if I married him, he could easily transfer me money without tax consequences."}, {"time": 7513, "text": "And then the film has me saying something like, you know, and then within 24 hours we were married."}, {"time": 7520, "text": "But that's like audio from here and audio from here spliced together."}, {"time": 7524, "text": "So they made it seem like there's a."}, {"time": 7526, "text": "Like I married him because it was like he could give me money and that wasn't the case."}, {"time": 7530, "text": "So you're part mastermind of some kind of scheme that involve money transfer and you got married and that kind of thing."}, {"time": 7537, "text": "Or if nothing else, I had like, I was trying to get money."}, {"time": 7540, "text": "That's why I married him."}, {"time": 7541, "text": "So which is absurd because again, you know, New York is full of legitimate people with loads of money."}, {"time": 7547, "text": "If I really wanted to marry somebody for money in New York, it wouldn't be that hard to do."}, {"time": 7552, "text": "But anyway, it was like it was just a deliberate making it seem like my intention was, you know, to marry him for his fictitious money."}, {"time": 7562, "text": "Okay, so that's one."}, {"time": 7565, "text": "And either way."}, {"time": 7566, "text": "Let's go to that ending thing because we're on that sort of topic."}, {"time": 7569, "text": "When you got out of prison, you know, what the film implies is that whatever, there's a small aspect of your mind that still wants to continue a relationship with Anthony."}, {"time": 7585, "text": "Yeah, that's not the case."}, {"time": 7586, "text": "And not just that, but there's still flirtation and that kind of a body and collide."}, {"time": 7593, "text": "And then I was laughing."}, {"time": 7594, "text": "Like, we got the world like at our fingertips, we're playing."}, {"time": 7601, "text": "So, I mean, one of the exciting things about being like a couple that's fucking with the world that's getting away with something is that there's all these powerful forces that want to catch you in a crime and you keep getting away with it."}, {"time": 7621, "text": "In some romantic world, it could be."}, {"time": 7627, "text": "And also, I always have to keep reminding people like, get away with what?"}, {"time": 7631, "text": "Because I lost everything and all these people lost other, you know, people I cared about lost a lot."}, {"time": 7638, "text": "My mother lost a lot, but I lost everything too."}, {"time": 7642, "text": "Yeah, your restaurant, your dream."}, {"time": 7646, "text": "Yeah, my reputation, my stuff, my home, you know, ending up with millions of dollars of debt."}, {"time": 7654, "text": "Like, it's not even like I lost it all and then it's a clean slate."}, {"time": 7657, "text": "It's like I lost it all and now I have this like giant boulder of, or like this wobbly, unclear how to like, yeah."}, {"time": 7669, "text": "So when people say, got away with something, I'm always like, got away with what?"}, {"time": 7676, "text": "Destroying my life and ending up in debt?"}, {"time": 7678, "text": "Because that's, it's not even like, you can't even sort of point to like, as if I was trying to do something and then oops, that happened."}, {"time": 7686, "text": "It's like, there's no, nothing that logically makes sense if somebody was trying to decipher my, you know, whatever motives I might have had."}, {"time": 7699, "text": "Yeah, you didn't walk away from the explosion, you were inside the explosion."}, {"time": 7703, "text": "Okay, but that said, the movie implied, and so, I mean, it's interesting to ask, not just in clarifying the movie, but just as a human being, you're out of prison, he's out of prison."}, {"time": 7721, "text": "There was, you know, there was that toxic connection, but it was there, and there's a depth to it, so toxic connections can be pretty deep."}, {"time": 7733, "text": "So how, what was the conversation like and how often have you talked with him?"}, {"time": 7739, "text": "Well, we don't speak anymore, and that call at the end was... Not even on Gchat?"}, {"time": 7746, "text": "Was recorded on, like, I recorded the call and gave it to them, you know, so I was like, deliberately recording him."}, {"time": 7746, "text": "It's not like I was caught on a hot mic, like, I made that call."}, {"time": 7758, "text": "It's part of the documentary."}, {"time": 7759, "text": "I recorded him intentionally, I was trying to get him to repeat some of like, the kookier things he would say about like, his meat suit or some of the weird like, the things about something not being real."}, {"time": 7772, "text": "The more like, fantastical things, I was trying to get him to repeat those things."}, {"time": 7776, "text": "It was probably like a 40 minute call, which I mean, it's actually on my phone, I still have it, I haven't gone back to listen to it, but... Do you ever think of publishing that whole thing?"}, {"time": 7784, "text": "Oh yeah, oh I think about publishing everything, my entire journal, all... You should publish that call unedited, just publish it."}, {"time": 7792, "text": "No, I want to publish like, a lot of stuff."}, {"time": 7792, "text": "He took all these videos of me also, that they used a couple of clips of, and I would, I mean, I would, they're also on my phone, I would publish them all."}, {"time": 7792, "text": "I would publish everything."}, {"time": 7804, "text": "In particular, because I... You should release that with your book."}, {"time": 7809, "text": "Yeah, I probably, I mean, I've planned to do that eventually, if all of that material would be really useful to psychologists or people studying it."}, {"time": 7809, "text": "So, to the extent that it would help other people understand what happened, which I think would be meaningful."}, {"time": 7826, "text": "Well, he's still out there, he's fascinating."}, {"time": 7828, "text": "Yeah, he's still out there doing weird, weird shit with his clean slate."}, {"time": 7828, "text": "I get a little annoyed about that."}, {"time": 7828, "text": "He's got the clean slate walking away."}, {"time": 7837, "text": "Well, he didn't have a restaurant, he didn't have a persona."}, {"time": 7837, "text": "Does he have any public persona, or no?"}, {"time": 7837, "text": "Or we don't know?"}, {"time": 7845, "text": "He got booted off of Twitter."}, {"time": 7847, "text": "He had a tweet."}, {"time": 7848, "text": "Maybe Elon will put him back on."}, {"time": 7850, "text": "Is that a passive aggressive statement?"}, {"time": 7852, "text": "I find that whole conversation really, really interesting."}, {"time": 7857, "text": "Whether to put somebody like Anthony on, back on Twitter?"}, {"time": 7860, "text": "Well, no, I think, because I used to always think like, if only everybody had to identify as themselves on Twitter, and you could have like a parody account."}, {"time": 7869, "text": "Or like, Leon has an account, but it's very clear that it's me behind it."}, {"time": 7869, "text": "Or sometimes there's like, you know, Devin Nunes cow."}, {"time": 7877, "text": "Like, so people have parody accounts, but if we could identify who it is, then a lot of... Why did he get booted off of Twitter?"}, {"time": 7886, "text": "But I used to, so in the last few years, I would periodically, probably like once a month, maybe more, I would like, look at his Twitter, just to kind of see like, well, where is he and, you know, like, just to see like, what is he up to?"}, {"time": 7902, "text": "And I figured out, I could tell from the photographs that he'd moved to California."}, {"time": 7907, "text": "And I think he might have told me one of the last times I spoke to him that he was going to move to California."}, {"time": 7916, "text": "And then I also screen grabbed a lot of stuff that he put on Twitter, and he put these creepy videos of himself on Twitter at the beginning of COVID."}, {"time": 7916, "text": "I screen grabbed those."}, {"time": 7927, "text": "And then one day I went and like, he was, you know, account was suspended."}, {"time": 7927, "text": "And then I kept going back and it's like been suspended ever since."}, {"time": 7927, "text": "So he might have started a new account."}, {"time": 7927, "text": "And I don't, I don't know what it is."}, {"time": 7927, "text": "Probably..."}, {"time": 7939, "text": "He's probably in California, you're saying?"}, {"time": 7942, "text": "He is in California."}, {"time": 7942, "text": "That's been verified."}, {"time": 7945, "text": "Somebody who was going to have to interact with him in an official capacity was going to go meet him."}, {"time": 7945, "text": "And I said, and was nervous about it."}, {"time": 7945, "text": "And I said, he's going to be really likable, like, you're going to like him."}, {"time": 7959, "text": "He's probably going to like figure out what you're interested in."}, {"time": 7959, "text": "Talk sports, talk, whatever it is that he figures out quickly that you're interested in."}, {"time": 7959, "text": "He's going to be really nice."}, {"time": 7959, "text": "He's going to seem like a nice guy."}, {"time": 7970, "text": "And that person later got back to me and was like, you're exactly right."}, {"time": 7975, "text": "So yeah, that's the, that's the sociopath thing, right?"}, {"time": 7979, "text": "You have to be extremely careful."}, {"time": 7979, "text": "But inside a relationship, that's even more dangerous."}, {"time": 7979, "text": "Like..."}, {"time": 7983, "text": "So I think that part of the reason I spoke to him was entirely self serving and strategic after the fact."}, {"time": 7992, "text": "For the documentary."}, {"time": 7993, "text": "Well, even before I knew there was ever going to be a documentary, I spoke to him."}, {"time": 7993, "text": "And I, and I knew how dangerous it was because I knew that in a situation like this, you're supposed to have no contact, which makes sense."}, {"time": 8007, "text": "And I understand why, which makes it extra tragic when people have kids with a sociopath or in a narcissistic abusive relationship."}, {"time": 8007, "text": "If you have kids, then you're tethered, which is tragic."}, {"time": 8007, "text": "But... Why are you supposed to avoid conversations?"}, {"time": 8019, "text": "Because you can get pulled right back."}, {"time": 8022, "text": "So they have no contact."}, {"time": 8022, "text": "Yeah, because they'll continue abuse or they'll, you'll be vulnerable to them being able to pull you back in."}, {"time": 8022, "text": "So I knew that to be the case."}, {"time": 8035, "text": "But why was it self serving?"}, {"time": 8035, "text": "Why did you talk to him anyway?"}, {"time": 8040, "text": "Because he was getting out, he was going to be out free out in the open while I was going to be locked up at Rikers for three and a half months."}, {"time": 8050, "text": "And the one thing that, you know, if his motivation was to destroy me, then what what else could he do to really, like, you know, hammer that last nail in the coffin?"}, {"time": 8065, "text": "That would be Leon."}, {"time": 8065, "text": "And so he would have known that Leon would be staying with my mother."}, {"time": 8071, "text": "You know, he knows where he spent a lot of time at her house."}, {"time": 8071, "text": "He knows where she lives."}, {"time": 8071, "text": "It would be super easy for him to just drive up there, you know, wait for her to let him out."}, {"time": 8081, "text": "And then, you know, he because out in the country, he can be off leash and all he'd have to do is kind of whistle, call him over and he could take him away and do whatever."}, {"time": 8092, "text": "So I was completely, like, gripped with that fear."}, {"time": 8097, "text": "So not fear for yourself, but fear for Leon."}, {"time": 8100, "text": "Well, I was going to be at least safe from him, but I was going to be locked away."}, {"time": 8107, "text": "Rikers."}, {"time": 8107, "text": "So I got it."}, {"time": 8112, "text": "I would be powerless to do any things."}, {"time": 8112, "text": "And he would have free rein to go destroy me further by, you know, taking or hurting Leon."}, {"time": 8125, "text": "And then when he got out, I still I had unfollowed him from my own account, but Leon had never unfollowed him."}, {"time": 8125, "text": "So I was looking at I know I was looking at his at his account."}, {"time": 8140, "text": "Can I just say, because Joe has an account for his dog, too."}, {"time": 8140, "text": "I just love when people do that."}, {"time": 8140, "text": "Because I actually pretend in my mind, for some reason, I do think Leon has an account."}, {"time": 8140, "text": "Like, I don't."}, {"time": 8140, "text": "You forget that there's a human behind it."}, {"time": 8156, "text": "You're like, oh, OK, cool."}, {"time": 8156, "text": "I love it when people do that."}, {"time": 8156, "text": "Anyway, so continue."}, {"time": 8156, "text": "So Leon didn't unfollow him."}, {"time": 8165, "text": "So I was able to go back and look at his Twitter and he somehow quickly got a phone, but he very quickly started tweeting right after he got out."}, {"time": 8177, "text": "And and I was kind of like fascinated because I didn't know what to expect or what he was going to be saying."}, {"time": 8184, "text": "And and and then he started saying things that I could tell were directed at me, you know, like little things that only I would know, you know, like random things, like things that were like the equivalent of like an inside joke that you have."}, {"time": 8198, "text": "And just so he was posting things like that."}, {"time": 8198, "text": "And there's so many things going on at once."}, {"time": 8198, "text": "So another thing that would have in a twisted, but I think understandable way."}, {"time": 8215, "text": "Sort of a sick way that I was fully aware of is that here I am having gone through this completely like messed up thing that now I'm in trouble for."}, {"time": 8215, "text": "Everybody's looking at and nobody understands."}, {"time": 8228, "text": "And so there was this unfortunate situation of the only person who understands what I went through is the person who put me through it."}, {"time": 8240, "text": "So is that were you also just a little bit seeking closure of some kind?"}, {"time": 8246, "text": "Probably a lot."}, {"time": 8246, "text": "But also with the awareness that I probably wasn't going to get it, you know."}, {"time": 8246, "text": "And I mean, I I know for a fact I would never get it in the same way that which is why."}, {"time": 8259, "text": "I was able to later on, like in the context of recording those calls, I was able to talk to him in this detached way because I know he doesn't give a shit that like he doesn't give any shits about what he did to my mother or me or anybody or anything just doesn't care."}, {"time": 8280, "text": "So he's certainly not going to care if I, you know, he's never going to say like I'm sorry or I did a bad thing or or like he's not going to be affected."}, {"time": 8292, "text": "Like if I yelled and screamed at him, that would just be frustrating for me."}, {"time": 8292, "text": "And he would actually probably be gratified by that."}, {"time": 8300, "text": "So that gave you that empowered you in being cold and sort of distant."}, {"time": 8307, "text": "Prior experience where I had to do the same thing, where, like, if you're if you're able to be very cold and not allow somebody to push your buttons, then you're taking away their power."}, {"time": 8322, "text": "And then that feels empowering or feels like reclaiming a little bit of your power."}, {"time": 8326, "text": "So in my talking to him, I always had a reason, you know, like there was always like I didn't want him to hurt Leon or I wanted information or I wanted to know where he was."}, {"time": 8337, "text": "I'd rather let him think that, you know, maybe he could still manipulate me one day or whatever."}, {"time": 8343, "text": "It was like safer to keep that there than to not know where he was and if I was going to like be walking Leon and turn the corner and he's standing there and like it."}, {"time": 8356, "text": "Like if there's a crazy murderer out on the loose, you'd rather know where they are than have no idea."}, {"time": 8361, "text": "So there are a lot of different reasons."}, {"time": 8364, "text": "Why does it upset you?"}, {"time": 8366, "text": "Why was it wrong to have that audio clip at the end of the documentary?"}, {"time": 8370, "text": "What did it well, because it implied all kinds of things that were completely not true."}, {"time": 8374, "text": "And it also just didn't make sense."}, {"time": 8374, "text": "And it confused people."}, {"time": 8377, "text": "And so so for people who haven't watched this spoiler alert is they play the clip of."}, {"time": 8385, "text": "So I don't even remember what was said, but it was kind of."}, {"time": 8389, "text": "That last what we spoke about."}, {"time": 8392, "text": "What was the what was I only watched like I still haven't watched it."}, {"time": 8396, "text": "I only watched the film once while, you know, people were looking at me for my reaction and I was crying and it was really weird and strange and surreal and I haven't gone back to watch it again."}, {"time": 8408, "text": "I feel like I'm just going to get more annoyed, but I will eventually."}, {"time": 8412, "text": "But and when I when the ending happened, I immediately blurted out, like, I hate that."}, {"time": 8412, "text": "I hate that ending."}, {"time": 8412, "text": "But I sort of assumed a lot of people saw it for what it was."}, {"time": 8426, "text": "They saw that it was like the director doing a weird thing and that it was kind of just weird and off and like, that doesn't make sense."}, {"time": 8433, "text": "But they didn't draw conclusions from it."}, {"time": 8435, "text": "So it was basically you joking around, like flirting almost."}, {"time": 8437, "text": "It made it seem like as if we're still friendly."}, {"time": 8442, "text": "And there's more to come."}, {"time": 8442, "text": "It's almost like there's going to be a bad vegan too."}, {"time": 8448, "text": "And then also, I mean, it made it seem like, you know, if I was laughing with him that I don't take anything seriously, you know, that I don't take what happened seriously or."}, {"time": 8461, "text": "Don't feel any remorse."}, {"time": 8464, "text": "And they after that, he goes to the credits with Wild World, which is a great song."}, {"time": 8472, "text": "Oh, baby."}, {"time": 8472, "text": "It's a wild world."}, {"time": 8475, "text": "I never got to hear that because the version I watched didn't have the end credits, but I knew that they used that song at the end and paid a lot for it."}, {"time": 8486, "text": "I was like, oh, well, you got this song."}, {"time": 8489, "text": "Did you ever say what was the darkest thing about yourself that you discover from the book?"}, {"time": 8496, "text": "We took attention."}, {"time": 8496, "text": "We started talking about exactly."}, {"time": 8496, "text": "About the G chats."}, {"time": 8503, "text": "And I think it was, I guess it was trying to understand how I was able to be sarcastic and make jokes at his expense."}, {"time": 8515, "text": "Dirt while all that stuff was going on."}, {"time": 8520, "text": "Have you figured out what that means about you?"}, {"time": 8526, "text": "No, it just was interesting to look at."}, {"time": 8531, "text": "Also, I think, you know, I have a tendency sometimes to be sort of like jokingly hyperbolic or sarcastic, and it's gotten me into trouble."}, {"time": 8545, "text": "One time I got locked up in the Harlem psych ward for a day because of my hyperbole and sarcasm and lost in translation errors."}, {"time": 8563, "text": "That's a heck of a lost in translation error."}, {"time": 8563, "text": "Did you say something funny to a therapist?"}, {"time": 8571, "text": "I mean, I was sort of making jokes about how bad I was feeling, but in a hyperbolic way."}, {"time": 8578, "text": "And so then suddenly somebody told somebody and then the loss in translation and then they were worried that I might kill myself and then did a wellness check and then tried to call me."}, {"time": 8588, "text": "And I was in the shower, so I didn't answer the phone."}, {"time": 8588, "text": "So then somebody called the police to do a wellness check on me."}, {"time": 8595, "text": "Things just escalated."}, {"time": 8595, "text": "And then not knowing that if I had handled it the right, if I had immediately, if I'd sort of understood what was going on and handled it the right way immediately, I probably could have gotten out of it."}, {"time": 8611, "text": "But they err on the side of taking you to the hospital no matter what."}, {"time": 8611, "text": "Makes a lot of sense."}, {"time": 8611, "text": "And I didn't know that."}, {"time": 8611, "text": "And it also."}, {"time": 8616, "text": "So you really leaned into the joke by going to the hospital."}, {"time": 8620, "text": "It's sort of one of those situations that was both comical and tragic because, and would actually make a really good, it's weird how I do this sometimes."}, {"time": 8632, "text": "Like it would make a really good scene in a filmed version."}, {"time": 8636, "text": "Who would play you in the film?"}, {"time": 8638, "text": "There is a thing being made that's a scary thing because."}, {"time": 8638, "text": "Sharon Stone?"}, {"time": 8638, "text": "Who would play?"}, {"time": 8645, "text": "Have you cast the scene yet?"}, {"time": 8647, "text": "No, but there's a thing being made that I have nothing to do with, which is frustrating and weird."}, {"time": 8654, "text": "What film about you?"}, {"time": 8655, "text": "About, it's like somebody is making a fictionalized drama and it's frustrating because for all kinds of obvious reasons, it's like annoying and."}, {"time": 8665, "text": "It can go any way."}, {"time": 8666, "text": "It could go any way."}, {"time": 8667, "text": "You could be like the bad guy."}, {"time": 8668, "text": "And inevitably they'll get a bajillion things wrong."}, {"time": 8668, "text": "And there are also a bunch of people like profiting off of it and like, thanks guys."}, {"time": 8677, "text": "You know, so it's infuriating for all kinds of reasons."}, {"time": 8681, "text": "Do you know who's playing?"}, {"time": 8681, "text": "Who are the actors?"}, {"time": 8683, "text": "No, I don't even like, I just don't like, I'll, I'll inevitably know, but I don't really want to know."}, {"time": 8683, "text": "The whole thing is just annoying."}, {"time": 8690, "text": "And also I've always, people ask me this all the time and I always thought because of the way everything that happened was such a kind of a slow build and there was so much nuance and it's, it's kind of really hard to understand that it could only really be done well in like a Breaking Bad type of series long, like a long series."}, {"time": 8712, "text": "Where like you would be taken through these kind of gut wrenching, icky, slow build things and then that would make it all make sense."}, {"time": 8722, "text": "Like that, if it was done that way, it could be done accurately."}, {"time": 8726, "text": "But the reason why I think, so I made these stupid jokes and then somebody did a wellness check and, or asked the police to do it well, but when they knocked on my door and came in, it was like a repeat of getting arrested."}, {"time": 8743, "text": "So I sort of weirdly flashed back to that and then burst into tears, which isn't the appropriate response if you're trying to diffuse a, if you're trying to discourage the people coming to do the wellness check from taking you to the hospital, starting to cry is not the good, the right reaction."}, {"time": 8765, "text": "So the thing is, I mean, there is, it's funny, but it could be also through the joke that the joke, the best jokes are grounded in truth and pain."}, {"time": 8779, "text": "In this case, pain."}, {"time": 8782, "text": "So there, you know, have you ever, if I may ask, considered suicide?"}, {"time": 8796, "text": "Well, I'm kind of a wimp, so, you know, I'm afraid of all of the gruesome ways, but one of the things I remember doing is sort of hoarding medications, which I had when, around the time and before he took me away, because I wanted, like I wanted to, I wanted the safety of a, like an out."}, {"time": 8827, "text": "But around that time, so when, that's the road trip, right before the road trip from hell, you were hoarding."}, {"time": 8833, "text": "Around that time, yeah."}, {"time": 8834, "text": "Hoarding medication and."}, {"time": 8835, "text": "Like I, yeah, like if I could get my hands on any sort of weird medication, I would, I would kind of hold on to it."}, {"time": 8845, "text": "To all the chaos that you go through."}, {"time": 8846, "text": "But I think I knew that it would be hard to do it that way."}, {"time": 8850, "text": "But you were thinking."}, {"time": 8851, "text": "I thought about it, but I never."}, {"time": 8855, "text": "In that really tough time, you know, you're thinking about, you're thinking about taking your own life."}, {"time": 8864, "text": "What gave you hope?"}, {"time": 8867, "text": "What gave you sort of, because the business, the restaurant that you give so much of yourself to is lost."}, {"time": 8875, "text": "You're lying to everybody."}, {"time": 8879, "text": "You're in the hole financially."}, {"time": 8882, "text": "You're being psychologically trapped, manipulated."}, {"time": 8886, "text": "I might just go kill myself now."}, {"time": 8890, "text": "Well, you're still there."}, {"time": 8893, "text": "Please don't."}, {"time": 8894, "text": "See, I made a joke about it."}, {"time": 8895, "text": "Like that's."}, {"time": 8898, "text": "But it's always there."}, {"time": 8900, "text": "As the Albert Camus, you know, says, you basically always have to be aggressively looking for a reason to live."}, {"time": 8916, "text": "Otherwise it's easy to go the other way."}, {"time": 8918, "text": "Because why live is a very good question."}, {"time": 8921, "text": "But anyways, by way of hope, by way, you know, it's a dark time."}, {"time": 8927, "text": "It's a dark time."}, {"time": 8928, "text": "If you could sort of look back, what gave you just strength?"}, {"time": 8935, "text": "I think that just, you know, just having like a sort of relentless optimism."}, {"time": 8944, "text": "And I think, too, that sometimes people assume that suicide is the result of circumstances, which maybe in some cases it is."}, {"time": 8954, "text": "But I think one of the things that that book explains well is that very often it doesn't have anything to do with circumstances."}, {"time": 8959, "text": "It's just the pain."}, {"time": 8963, "text": "The Darkness Visible."}, {"time": 8966, "text": "You know, because people like to."}, {"time": 8967, "text": "So when somebody commits suicide, people will very often criticize them like it was a selfish act if they have a family, which most people do."}, {"time": 8975, "text": "But especially if they have kids."}, {"time": 8976, "text": "And I think that, yeah, everybody's quick to sort of call the person who killed themselves selfish."}, {"time": 8984, "text": "And I think that the type of pain that one is experiencing that leads to that is something that most people, and I don't, like people don't understand, but it's not a selfish thing."}, {"time": 8997, "text": "It's just like quite literally becomes intolerable from what I understand."}, {"time": 9002, "text": "And it can hit you."}, {"time": 9003, "text": "It could be slow."}, {"time": 9004, "text": "It could be fast."}, {"time": 9007, "text": "That pain."}, {"time": 9009, "text": "So I think because for me, it was more just my circumstances were so crappy, but also I had an awareness that even in Rikers, I knew how wildly lucky I was to have, you know, family, a support system, you know, opportunities."}, {"time": 9030, "text": "And like, I'll always be OK one way or another."}, {"time": 9038, "text": "So I felt lucky that I have that."}, {"time": 9043, "text": "But, you know, also I want the shame of everything that happened."}, {"time": 9049, "text": "And, you know, will I ever be able to crawl out from under it and rebuild something?"}, {"time": 9057, "text": "So there were certainly times where, especially when I would learn something new, like reading the emails between Mr. Fox, my mother, I just wanted a, I wanted like a meteor to hit my particular spot on the earth right then and there just because it was."}, {"time": 9075, "text": "He was manipulating your mom, too, because your mom loved you and was willing to give money."}, {"time": 9080, "text": "And it was really grotesque."}, {"time": 9083, "text": "And so and I feel like it's my fault."}, {"time": 9086, "text": "What's your mom say about this whole situation now looking back?"}, {"time": 9091, "text": "We don't talk about it as much as one would think that we would because I feel sickening because I feel like it's my fault."}, {"time": 9100, "text": "And I think she also feels sick over it."}, {"time": 9104, "text": "And so we don't talk about it as much as one might think of."}, {"time": 9107, "text": "Sometimes I've had to ask questions in the process of writing the book."}, {"time": 9111, "text": "And then there are other things where, like, I could ask the questions, but I just don't want to because I don't want to put her through that or, you know, it's not really necessary to ask the questions."}, {"time": 9121, "text": "But there are things that I'm sort of curious about."}, {"time": 9127, "text": "When you went on that road trip from hell, what was that like?"}, {"time": 9127, "text": "Where'd you guys go first?"}, {"time": 9127, "text": "Vegas?"}, {"time": 9127, "text": "So you drove New York where?"}, {"time": 9142, "text": "It was a series of stops at like hotel, motel type places."}, {"time": 9147, "text": "I did a similar road trip, but from Boston."}, {"time": 9147, "text": "I drove across the United States with no destination."}, {"time": 9153, "text": "I had always wanted to do that."}, {"time": 9153, "text": "And now I feel like it's one of those things that's sort of like ruined for me because a lot of you can always reclaim it."}, {"time": 9161, "text": "Yeah, I could."}, {"time": 9161, "text": "But now."}, {"time": 9165, "text": "I did think about like how one day if I did some sort of a book tour or something that I imagine this."}, {"time": 9172, "text": "Leon and I in a car."}, {"time": 9172, "text": "It has to be different than, man, book tours, if you're not careful, can suck the soul out of a human being."}, {"time": 9188, "text": "I think you have to do like a Hunter S. Thompson style book tour where you miss a bunch of the dates because you got too drunk the night before."}, {"time": 9196, "text": "Or I just what I worry about is that I just would be feeling terrible in some way and not be up for it."}, {"time": 9206, "text": "Up for the trip or up for the speaking?"}, {"time": 9208, "text": "For like a certain type of appearance."}, {"time": 9208, "text": "I think I'm always afraid of that in committing to things like if it involved going to a big public event."}, {"time": 9221, "text": "Yeah, I think you have to be very careful."}, {"time": 9221, "text": "Like podcast is an interesting one."}, {"time": 9221, "text": "I'm always surprised that people just jump on podcasts they haven't really listened to."}, {"time": 9229, "text": "And just do a lot of podcasts, a kind of book tour."}, {"time": 9229, "text": "First of all, financially, it doesn't make any sense."}, {"time": 9236, "text": "Like especially going on small podcasts, like what's the benefit?"}, {"time": 9236, "text": "Like really, you want to go on just a couple of big podcasts that you're actually a fan of."}, {"time": 9243, "text": "It's really, really, really important."}, {"time": 9243, "text": "People don't, like they don't understand the power."}, {"time": 9243, "text": "I mean, maybe you just don't understand podcasts."}, {"time": 9252, "text": "But me as a fan of podcasts is like the biggest thing I love listening to is when a guest is a fan, they understand the culture, the style, the sound, the feel of the podcast."}, {"time": 9265, "text": "They understand the other person, they feel the pain, the hopes of the other person, the weird like quirks of the other person makes for much better listening."}, {"time": 9276, "text": "And ultimately, the appearance itself is not just enough to sell the book."}, {"time": 9276, "text": "You're selling yourself as a human being."}, {"time": 9276, "text": "And that requires having chemistry and all those kinds of things."}, {"time": 9287, "text": "And podcast appearances are exhausting."}, {"time": 9287, "text": "Like you're giving a lot of yourself."}, {"time": 9287, "text": "It's intimate."}, {"time": 9287, "text": "It's deep."}, {"time": 9295, "text": "Anyway, road trip."}, {"time": 9295, "text": "You don't remember the motels and the hotels along the way?"}, {"time": 9301, "text": "Well, there are a lot of things where like, I'll remember things that happened, but I don't remember where it was."}, {"time": 9306, "text": "He just drove without a destination."}, {"time": 9306, "text": "Really."}, {"time": 9310, "text": "I assume he must have known ahead of time, but he made it seem like, like, oh, funny we ended up in Vegas."}, {"time": 9310, "text": "Funny how that happened."}, {"time": 9320, "text": "But it now when I see all the places that we stopped, they were all places with where there are casinos."}, {"time": 9327, "text": "So there's a lot more casinos around the country than I knew."}, {"time": 9333, "text": "And they're."}, {"time": 9335, "text": "So he had a gambling addiction."}, {"time": 9338, "text": "But I think that it's not."}, {"time": 9338, "text": "So I think that regular people have gambling addictions and it's a horrible, tragic thing and can destroy their lives."}, {"time": 9348, "text": "And I know people like it."}, {"time": 9348, "text": "Regular people can have a gambling addiction, which is explained in the way that addictions are explained for him."}, {"time": 9359, "text": "I don't think it was so much an addiction as like a thrill seeking because he could win money, lose money, and he didn't really care."}, {"time": 9370, "text": "Whereas somebody who has an actual addiction and then all normal people with normal human emotions, you know, would either be elated and relieved or devastated to lose a lot of money."}, {"time": 9385, "text": "And for him, it didn't really care."}, {"time": 9385, "text": "It was more, again, I think it was more just like a game."}, {"time": 9390, "text": "Like, what was going through your mind here?"}, {"time": 9390, "text": "Like, would you be on the run?"}, {"time": 9390, "text": "Did you feel like you were on the run?"}, {"time": 9397, "text": "Did you know you were on the run?"}, {"time": 9400, "text": "So I didn't know that."}, {"time": 9400, "text": "I mean, the other thing is the restaurant was operating and he took me away."}, {"time": 9408, "text": "And then, like, people weren't paid and it all sort of fell apart."}, {"time": 9413, "text": "And you weren't checking your texts or any of that?"}, {"time": 9416, "text": "And then he had my phone and my email."}, {"time": 9416, "text": "I did later on get, later on I got a brand new phone with like an empty phone with no existing numbers in it or whatnot."}, {"time": 9431, "text": "And so that he and I could communicate when, you know, I was, went to the grocery store or something like that."}, {"time": 9439, "text": "What was the, what was the reason he had the phone?"}, {"time": 9439, "text": "Like, what was the narrative, the story that he was taking over your phone?"}, {"time": 9448, "text": "Was it, I mean, like, how did you allow that to happen?"}, {"time": 9448, "text": "Or maybe a better way to ask is, how did he make that happen?"}, {"time": 9460, "text": "Well, I was conditioned to it before because before he was always checking my phone, which was wildly infuriating."}, {"time": 9460, "text": "And I feel like, like."}, {"time": 9473, "text": "You fixed it by giving him the phone."}, {"time": 9476, "text": "Well, I mean, the conditions were different later on."}, {"time": 9479, "text": "But in some sense, I didn't want my phone because everything, like I was in a state of shock and it was just like, take it, fine."}, {"time": 9486, "text": "Like, I give up."}, {"time": 9486, "text": "Like, I guess I'd given up."}, {"time": 9486, "text": "And so, yeah, I'd given up."}, {"time": 9486, "text": "So there was no, like, I wasn't going to fight back on anything."}, {"time": 9496, "text": "Before, when he would take my phone and look through it, it was, it was infuriating."}, {"time": 9496, "text": "And he sort of forced me to get used to it."}, {"time": 9505, "text": "And this is, again, something that, like, people who've been in cults would understand because it's like they condition you to not react negatively to things that you would normally react negatively to."}, {"time": 9515, "text": "And like, if I was in a relationship, like, if somebody, I would never, ever look in somebody's phone."}, {"time": 9515, "text": "And if somebody did that to me, I would be like, goodbye."}, {"time": 9530, "text": "So I'm pretty sensitive about that."}, {"time": 9530, "text": "And so it was very infuriating when he would take my phone and look at it."}, {"time": 9539, "text": "And it got to the point where not only did I feel like everything I, you know, said or wrote or emailed digitally or whatnot would be read, but he got me to the point of feeling like I was being watched all the time in a non explainable way."}, {"time": 9561, "text": "Yeah, what were some of the, you didn't mention them, the documentary touched on some of them."}, {"time": 9561, "text": "What are some of the fantastical stories?"}, {"time": 9561, "text": "So he mentioned that he might help make Leon immortal."}, {"time": 9577, "text": "All of that was always really vague."}, {"time": 9577, "text": "Intentionally, like a lot of what he talked about was always very vague."}, {"time": 9577, "text": "But a lot of that stuff was very vague."}, {"time": 9577, "text": "And again, like, slowly over time."}, {"time": 9589, "text": "And a lot of those things, too, are things that, you know, conveniently, you kind of can't disprove."}, {"time": 9589, "text": "So it's almost like, you know, people believe in God or religious people believe certain things."}, {"time": 9604, "text": "And so one could argue, why is it that much crazier for me to have been open to the idea that, you know, maybe Leon, maybe we do live forever, in some way when a lot of religious people have similar beliefs."}, {"time": 9621, "text": "So one of the other thing is, he was, what, maybe you can correct me, but reincarnated or something like that, or?"}, {"time": 9630, "text": "He acted like he had lived many lifetimes, and had all kinds of wisdom from having lived all these prior lifetimes, and being aware of it."}, {"time": 9644, "text": "So was that, and it was vague, but it was somehow believable?"}, {"time": 9644, "text": "Or is it just like part of the charm?"}, {"time": 9644, "text": "Like, what, how do you, how do you not call bullshit?"}, {"time": 9660, "text": "Not necessarily bullshit."}, {"time": 9660, "text": "I understand when you're smitten in whatever way."}, {"time": 9660, "text": "But like, a little more details, proof."}, {"time": 9660, "text": "I suppose it's easy to just, you know, like, put it off for later."}, {"time": 9660, "text": "Assume that more details will come later."}, {"time": 9681, "text": "But I think he's a mentalist or an illusionist named Darren Brown."}, {"time": 9681, "text": "And it was on a Joe Rogan podcast."}, {"time": 9681, "text": "I think Joe interviewed Darren Brown."}, {"time": 9681, "text": "I think Sam Harris interviewed him."}, {"time": 9681, "text": "I got really intrigued."}, {"time": 9697, "text": "And then I was looking for other podcasts, or maybe Joe interviewed him, like, right after."}, {"time": 9697, "text": "I may have gone looking for it."}, {"time": 9697, "text": "But anyway, it was in the conversation with Joe where Darren explains, he's somebody I would love to meet, a mentalist and an illusionist, because they understand a lot of the ways in which the mind can be manipulated."}, {"time": 9716, "text": "So I feel like they would, if they looked at everything about my situation, they would be able to understand better how he was able to get me to believe things or go along with things."}, {"time": 9716, "text": "Because Darren Brown is pretty fascinating what he does."}, {"time": 9731, "text": "And he's really seems like a very kind person, and he's very open about it."}, {"time": 9731, "text": "And when he was talking to Joe, he said this thing that, and I use this quote in my book."}, {"time": 9731, "text": "And again, I'm paraphrasing because I don't have it in front of me."}, {"time": 9747, "text": "But it's like, he says something about how we want to believe the lie, because we'd rather believe that it's something amazing than just that ugly and pathetic a lie."}, {"time": 9747, "text": "And whatever he said was said in a much better way."}, {"time": 9765, "text": "And so he was explaining it in the context of the way that an illusionist or whatever they're called is able to pull off certain things, which is about somebody who was watching and watched that person leverage people's tendency to want to believe that something amazing and cool is about to happen versus this is just a really ugly, pathetic lie."}, {"time": 9794, "text": "So I think that a lot of the things that Mr. Fox, that he put forward, I couldn't understand it from the perspective of it being a lie because it just seemed too weird and crazy."}, {"time": 9794, "text": "So I think that this happens sometimes where you believe somebody because it seems so weird that they would lie about it."}, {"time": 9819, "text": "I think that somebody has, or it's been said sometimes that the more fantastical the lie, the more believable it is because you don't believe that somebody would tell that lie."}, {"time": 9819, "text": "And I think something also that Mr. Fox, people like him are capable of doing is going out and lying in very brazen ways that normal people would be terrified to do."}, {"time": 9842, "text": "And that kind of also makes it more believable."}, {"time": 9842, "text": "So if somebody could go out on a world stage and lie and not kind of feel weird about that or even knowing that it's a lie that can be pointed out as being a lie."}, {"time": 9860, "text": "There's also the layer of to what extent is this person in some way also delusional themselves and sort of believing their lies because people have asked me that and I've wondered the same thing."}, {"time": 9860, "text": "To what extent did he believe some of the stuff he was saying?"}, {"time": 9874, "text": "And I think probably there was some sort of delusional aspect, almost like he was sort of halfway aware of playing his own sort of virtual reality game, like he was in some kind of metaverse in his brain."}, {"time": 9891, "text": "So you think he believed some of the things he was saying?"}, {"time": 9894, "text": "In some way, yeah."}, {"time": 9894, "text": "Or he wanted to, because he wanted to be his own, he wanted to be a superhero."}, {"time": 9894, "text": "He never built anything or created anything or accomplished anything in his life."}, {"time": 9894, "text": "Yet, so in his own brain, if he could turn himself into a movie superhero."}, {"time": 9913, "text": "That's a nice shortcut."}, {"time": 9913, "text": "What about the Navy SEAL thing?"}, {"time": 9913, "text": "Did that ever get resolved?"}, {"time": 9913, "text": "The lie that he said that he's a Navy SEAL?"}, {"time": 9926, "text": "I don't know if he said he was a Navy SEAL or that he implied that he worked with the CIA or then it was like he worked with Black Ops that is by definition under the radar."}, {"time": 9926, "text": "So I mean, that's obviously a huge red flag now going forward."}, {"time": 9945, "text": "First of all, if somebody tells you that information pretty quickly, that's itself a red flag."}, {"time": 9952, "text": "You crossed that off my list of pickup lines."}, {"time": 9958, "text": "But, you know, conveniently, if he say in some world he actually did work for like Blackwater or one of those places, I wouldn't be able to just call someplace and verify it."}, {"time": 9976, "text": "Anyway, I think that in some psychological way that I don't understand, he probably did in some way halfway exists in this world where he was this, you know, like fighter and he would say things like, it's because of people like me that people like you can sleep at night, which is probably a line out of a movie that I've never seen."}, {"time": 9999, "text": "I feel like a lot of things."}, {"time": 9999, "text": "That is a great."}, {"time": 9999, "text": "Who said that?"}, {"time": 9999, "text": "Is that really a line out of a movie?"}, {"time": 9999, "text": "It's not a movie."}, {"time": 10010, "text": "You know what would happen at Rikers is when these things would happen where one of us couldn't think of something and you're like, oh, who was that actor in that movie in that thing?"}, {"time": 10019, "text": "And so what we do is like somebody would be on the phone and you'd be like, hey, who are you talking to?"}, {"time": 10019, "text": "Can you ask them to look up on their phone?"}, {"time": 10019, "text": "Like, so we'd ask people on the phone or somebody would go make a call and, you know, you'd have to call somebody and ask them to Google the cast of a movie or something like that."}, {"time": 10037, "text": "I think you would find jail."}, {"time": 10037, "text": "Don't ever get arrested or try not to, but I think you would find jail fascinating."}, {"time": 10042, "text": "Oh, I always wanted to go to jail, prison, because there's a lot of elements to it and I'll ask you questions about it, but I feel like I can get a lot of reading done."}, {"time": 10052, "text": "I got a ton of reading done."}, {"time": 10053, "text": "Yeah, yeah, yes."}, {"time": 10053, "text": "I remember now."}, {"time": 10053, "text": "People attribute this to George Orwell, but they're not sure if George Orwell ever said it, but it's something like there's a lot of different variations."}, {"time": 10064, "text": "But we sleep safely at night because rough men stand ready to visit violence on those who would harm us."}, {"time": 10064, "text": "And there's a lot of variations of this, but basically we depend, our entire society depends on bad motherfuckers who are willing to fight to protect our freedoms, to protect our wellbeing."}, {"time": 10084, "text": "And one of the things about the United States is because we're surrounded by water, we don't get to see the violence that's required in part to protect the sovereignty of nations."}, {"time": 10100, "text": "You mentioned that I would, not to go to prison, but that I may enjoy my time there."}, {"time": 10100, "text": "Let me ask you, by the way, I love prison movies."}, {"time": 10113, "text": "You would find it fascinating."}, {"time": 10113, "text": "I don't because it's still kind of too soon."}, {"time": 10118, "text": "Well, how was your time?"}, {"time": 10118, "text": "You spent three and a half months at Rikers."}, {"time": 10118, "text": "How was that?"}, {"time": 10118, "text": "How was your experience in prison?"}, {"time": 10118, "text": "How's the food from a chef perspective?"}, {"time": 10131, "text": "Not good, but Rikers was, when I got to Rikers, so I was arrested."}, {"time": 10131, "text": "I spent, I think about 10 days in a small town Tennessee jail."}, {"time": 10131, "text": "Pigeon Forge is also the weirdest place on earth."}, {"time": 10149, "text": "Is it a town?"}, {"time": 10150, "text": "Yes, it's the town where I was arrested."}, {"time": 10152, "text": "Why is it so weird?"}, {"time": 10154, "text": "In the film, I told them, I told them, you have to go to Pigeon Forge, you have to go there, you have to go there."}, {"time": 10154, "text": "And I think I was pushing them because it was going to potentially be the end of the season."}, {"time": 10166, "text": "It's like a summertime or it's a tourist destination."}, {"time": 10166, "text": "And it's so bizarre and weird and trippy that it doesn't even seem real."}, {"time": 10180, "text": "It seems like a carnival is happening there nonstop."}, {"time": 10182, "text": "I think I say that in my intro, that it's carnivalesque and trippy and weird."}, {"time": 10190, "text": "Is there a lot of clowns walking around?"}, {"time": 10193, "text": "Not necessarily clowns, but there is a video on YouTube that I, cause I got to the chapter where we arrive in Pigeon Forge and I'll never forget, although I have forgotten, but I remember being like weirdly, like felt like we were, had entered a different universe driving down the strip and just looking at everything on either side."}, {"time": 10216, "text": "And I'm wishing that I could remember in more detail, like the names of the places or what was there because I wanted to describe it in this chapter."}, {"time": 10224, "text": "And I was like, I wish somebody, I wish there was like a video of somebody going down the street, kind of showing what's on one side and then the other side."}, {"time": 10231, "text": "And I was like, there probably is, and there is on YouTube."}, {"time": 10231, "text": "Like I found it and I watched the whole thing."}, {"time": 10237, "text": "How does this come up from prison exactly?"}, {"time": 10239, "text": "Pigeon."}, {"time": 10241, "text": "Why did that spark?"}, {"time": 10242, "text": "So that's the town that I went to jail in."}, {"time": 10246, "text": "In Tennessee."}, {"time": 10248, "text": "The food there and some of the conditions, the food made, when I got to, then I was extradited and transferred to Rikers."}, {"time": 10258, "text": "And when I got to Rikers, I felt like it was like the four seasons in comparison."}, {"time": 10264, "text": "So, and I really kind of appreciated a lot of things about New York when I got to Rikers, even though there are a lot of things that are very scary about it."}, {"time": 10275, "text": "Where's Rikers located?"}, {"time": 10275, "text": "Is it close to New York City?"}, {"time": 10279, "text": "And in a very kind of almost poetically interesting way."}, {"time": 10285, "text": "The dorm room where I was when I was there for the three and a half months was one of the ones that faced Manhattan, so I could go across the room and look out the window and see the whole Manhattan skyline."}, {"time": 10297, "text": "Get a view."}, {"time": 10298, "text": "Which was."}, {"time": 10299, "text": "I remember being shocked by the cost per prisoner per year."}, {"time": 10308, "text": "That New York pays."}, {"time": 10308, "text": "It's like $400,000, $500,000 or something."}, {"time": 10313, "text": "I didn't think it was that much."}, {"time": 10313, "text": "I thought I wrote it down, but either way it is."}, {"time": 10316, "text": "No, I mean, it's elevated during COVID, which is fascinating to that the number I just said."}, {"time": 10324, "text": "During COVID, I felt sick to my stomach thinking about people stuck there."}, {"time": 10329, "text": "And again, so Rikers isn't like a long term prison."}, {"time": 10332, "text": "It's most of the people at Rikers are awaiting trial and they've been arrested but not convicted."}, {"time": 10339, "text": "And then if you're convicted and you're sentenced to less than a year, then you put on a different color uniform and you go upstairs to different dorms."}, {"time": 10347, "text": "If you're convicted and sentenced to more than a year, you're sent to one of the upstate prisons."}, {"time": 10353, "text": "So most of the people at Rikers are there in transition."}, {"time": 10353, "text": "They've been arrested but not convicted or awaiting trial."}, {"time": 10353, "text": "So you could be perfectly innocent and you're stuck there and that happens to a lot of people."}, {"time": 10369, "text": "Or you could be arrested over some kind of comparatively petty thing or nonviolent thing and stuck there because you don't have as little as $500 to pay bail, which is completely messed up and unjust."}, {"time": 10387, "text": "And I think most people, most reasonable people agree that it's unjust."}, {"time": 10387, "text": "But it's different when you're there and you see those people and you see kind of the anguish."}, {"time": 10399, "text": "I mean, I have no idea if they're guilty of what."}, {"time": 10399, "text": "I mean, I usually don't know what people are there for or what the situation is, but you watch the sort of helplessness set in because you're kind of powerless there."}, {"time": 10399, "text": "You have very little contact with the outside world."}, {"time": 10417, "text": "You have these limited phone calls."}, {"time": 10419, "text": "And so for people who had kids and a job and an apartment, it's like one by one those things are lost or their kids are now being looked after by their abusive ex husband or something like that."}, {"time": 10430, "text": "And so watching that is just gut wrenching."}, {"time": 10433, "text": "And then also knowing that the only reason they're unable to get out is because of, you know, a thousand dollars, two thousand dollars, in some cases five hundred dollars."}, {"time": 10433, "text": "There were people."}, {"time": 10433, "text": "So there's all of these tragic cases."}, {"time": 10449, "text": "But then there was also while I was there, I mean, if I'd had any money, I would have been wanting to bail people out left and right."}, {"time": 10456, "text": "And then in some cases, I think there was a woman there snored really loud and her bail was five hundred dollars."}, {"time": 10456, "text": "And I was like, I wish I had a bail."}, {"time": 10466, "text": "She just wanted to bail her out."}, {"time": 10466, "text": "So because I'm pretty sensitive to sounds and being in a room with 50 people, inevitably."}, {"time": 10474, "text": "So you're in a room with a large number of people."}, {"time": 10477, "text": "Yeah, there are there are areas there with cells, but a lot of the areas there are rooms with 50 beds."}, {"time": 10488, "text": "So and there are about three feet apart from each other."}, {"time": 10488, "text": "So during covid, there was certainly no social distancing."}, {"time": 10495, "text": "And that just felt kind of sickening, especially because so many people are there for nonviolent things or drug addiction related or mental health issues."}, {"time": 10509, "text": "How did that, you personally, just having spent that time there for three and a half months, how did that change you?"}, {"time": 10509, "text": "Like what did that have an effect on your mind?"}, {"time": 10526, "text": "On my mind, personally, I think I was I was surprised at how well I adapted and then how I was able to."}, {"time": 10539, "text": "And then I think I sort of took it to the next level when one of the books somebody sent me was The Untethered Soul by Michael Singer."}, {"time": 10547, "text": "And it's very much about like observing your mind."}, {"time": 10547, "text": "And that kind of helped take it to the next level."}, {"time": 10555, "text": "So was this like a meditation retreat for you?"}, {"time": 10558, "text": "Well, it's like it'd be like trying to meditate in the middle of a circus or in crazy circumstances because you're never alone."}, {"time": 10568, "text": "There's nowhere to be alone."}, {"time": 10568, "text": "And there's always talking, there's noises, there's fighting noises, chaos."}, {"time": 10575, "text": "Did you feel in danger?"}, {"time": 10575, "text": "Yes, but I never I never felt terrified there."}, {"time": 10588, "text": "You know, one of my friends, the bathroom is the scary place because they don't have cameras in the in the bathroom."}, {"time": 10596, "text": "So that's sort of a one has to watch out there."}, {"time": 10596, "text": "And I did one of my friends who I one of the people I was friends with there, she did get beat up a bit in the bathroom one day."}, {"time": 10609, "text": "A lot of weird shit happened in the bathroom."}, {"time": 10614, "text": "But it was from a if you're interested in human behavior and psychology, and it's, it can be fascinating to kind of sit there and watch."}, {"time": 10626, "text": "You're saying like, you might enjoy prison for that perspective, like just you get to watch human nature."}, {"time": 10631, "text": "It's like, I don't want to say that it's worse, but like the full variety that it can take."}, {"time": 10637, "text": "And there was a lot of beauty there as well."}, {"time": 10640, "text": "Was there love?"}, {"time": 10641, "text": "People being well, again, depends on the definition of love, but people being, you know, incredibly generous and kind to each other."}, {"time": 10653, "text": "Sometimes people singing at night."}, {"time": 10658, "text": "There was just a lot of."}, {"time": 10661, "text": "And then there's a lot of, you know, hilarious stuff."}, {"time": 10664, "text": "It's just it's all there."}, {"time": 10664, "text": "There's like, there's tragic things."}, {"time": 10664, "text": "You know, interesting things."}, {"time": 10672, "text": "A lot of people with mental health issues, which is can be difficult to witness."}, {"time": 10678, "text": "So very different experience."}, {"time": 10678, "text": "I should ask you this, but somebody that's currently in prison."}, {"time": 10687, "text": "Ghislaine Maxwell, I believe she spent approximately 500 days in isolation."}, {"time": 10695, "text": "So it's a very difficult, different prison experience."}, {"time": 10700, "text": "But what do you think about her case?"}, {"time": 10700, "text": "What do you think about her and Jeffrey Epstein?"}, {"time": 10704, "text": "She, so her brother, her family, she says that she's a victim, not the monster."}, {"time": 10716, "text": "I think this is an especially fascinating case because and I've I have listened to podcasts about the Epstein situation."}, {"time": 10728, "text": "And there is one that was more focused on her by Vicki Ward that I would definitely listen to."}, {"time": 10735, "text": "Vicki Ward is a journalist."}, {"time": 10738, "text": "I think she'd written an article about Jeffrey Epstein for Vanity Fair."}, {"time": 10741, "text": "So she got to know Jeffrey Epstein and then she knew Ghislaine Maxwell from being sort of part of the social circle in which they would have overlapped."}, {"time": 10751, "text": "Have you, by the way, ever met them since this New York?"}, {"time": 10755, "text": "Do you remember meeting this, you know, Jeffrey or Ghislaine?"}, {"time": 10761, "text": "No, I never met them."}, {"time": 10761, "text": "But they're also very much like this sort of Upper East Side crowd."}, {"time": 10766, "text": "I did meet Harvey Weinstein once that made me have all kinds of interesting thoughts later."}, {"time": 10771, "text": "At the restaurant or elsewhere?"}, {"time": 10772, "text": "No, it was weird."}, {"time": 10772, "text": "It was out on the street."}, {"time": 10776, "text": "And we had this really strange interaction."}, {"time": 10776, "text": "And knowing what I know now, it was eerie."}, {"time": 10783, "text": "And and also, like, had he contacted me after that and made it seem like he could have done something for me?"}, {"time": 10790, "text": "Like, would I have been, you know, say he said, oh, I'm going to finance your whole expansion or something and like, come to my, you know, come meet me at this hotel."}, {"time": 10801, "text": "And then I go to that hotel and he's like, come up to the room."}, {"time": 10801, "text": "And then I would have been like, uh."}, {"time": 10805, "text": "And you're wondering whether you would have done it."}, {"time": 10809, "text": "And sadly, I think I would have."}, {"time": 10809, "text": "And so I felt a lot of compassion for those who, you know, didn't yell at him and leave or didn't storm out."}, {"time": 10825, "text": "And because I think what happens in those situations is, you know, there's all kinds of uncertainty in the moment and you sort of freeze and then you'll if I'm probably one of those people that would sit there and somehow in the moment."}, {"time": 10844, "text": "Without clarity, just instinctively feel like somehow I must have done something wrong and it's my fault."}, {"time": 10844, "text": "And I'm like, I led him on and are just being afraid."}, {"time": 10855, "text": "And then and then you don't know how to deal with it."}, {"time": 10855, "text": "And so you freeze."}, {"time": 10860, "text": "So I think that, you know, if you're somebody that maybe was raised differently or you have a lot of self confidence or you might have reacted differently and kind of pushed him away and stormed out."}, {"time": 10879, "text": "But I am probably not one of those people."}, {"time": 10882, "text": "But I did not ever meet Jeffrey Epstein, but he seems very straightforwardly, you know, just a classic, the way he was able to charm people, the way he could step into these roles."}, {"time": 10896, "text": "You know, I think he was teaching at Dalton and then just kind of the way he would get himself into the the academic crowd within Harvard and I think also MIT, right?"}, {"time": 10907, "text": "So he's playing a role, but he's doing it so well that he fools all these people."}, {"time": 10913, "text": "And and the things that people would in hindsight say about him are just the same things that people say about it's like you hear the same things over and over again."}, {"time": 10924, "text": "You hear the same thing said about those people who were taken in by Elizabeth Holmes is that they were like it was as if he was under a spell."}, {"time": 10932, "text": "It was as if I was under a spell is something you hear a lot."}, {"time": 10936, "text": "So it's like they have this powerful charm that's almost over."}, {"time": 10941, "text": "It's overwhelming in that they overwhelm your better judgment or they overwhelm your like normal, otherwise normally functioning capacity for rational thought."}, {"time": 10954, "text": "And they sort of overwhelm that with their charm."}, {"time": 10956, "text": "So, you know, when you look at I think it was like James Mattis invested a bunch of money with Elizabeth Holmes and all these people were involved with her and nobody really did their due diligence where they just sort of trusted her."}, {"time": 10969, "text": "And Jeffrey Epstein, I think it's still unclear where he got all of his money, but the guy Wexner, Les Wexner, who had, you know, an enormous amount of money and somehow very quickly turned over management of it to Jeffrey Epstein."}, {"time": 10986, "text": "And so people wonder, like, why would he do that?"}, {"time": 10989, "text": "And then other people have commented about that relationship like it was as if he was under Jeffrey's spell."}, {"time": 10989, "text": "You know, observers would say I couldn't understand it."}, {"time": 10989, "text": "It was as if he was under his spell."}, {"time": 11000, "text": "And so somebody observing me and Mr. Fox could have possibly said the same thing about me."}, {"time": 11006, "text": "But it's a bit different because it wasn't all charm."}, {"time": 11008, "text": "I think Epstein used his charm and then was probably very, very, very crafty and getting another thing that people like him do and cults do also is to get is to get you somehow compromised because then they've got you."}, {"time": 11024, "text": "So I think some kind of usually sex related."}, {"time": 11029, "text": "And with Epstein, certainly, you know, he was known to have cameras everywhere."}, {"time": 11029, "text": "And so if he got any of these people on camera doing something compromising and all very powerful people, then he's got them."}, {"time": 11042, "text": "And I think he was also very smart to do that, to target people of both parties so that politically that he was able to maintain his power like no matter like nobody wanted him to be totally exposed because then people, a lot of people would be exposed."}, {"time": 11062, "text": "By the way, that part, you know, that's all kind of conspiracy, right?"}, {"time": 11071, "text": "I, so a lot of people believe that and, you know, I tend to kind of naturally believe that because it makes sense, but it's also possible that straight up with charisma."}, {"time": 11082, "text": "I mean, he did record people and there were recordings."}, {"time": 11085, "text": "So I listened to an interview with a woman who, I mean, was a girl back then."}, {"time": 11091, "text": "Maybe she was 15 or 16 back then."}, {"time": 11091, "text": "And subsequently, years later, was able to see some of the video of, I mean, I think it's a verifiable thing that there were video cameras all over his house."}, {"time": 11106, "text": "Yeah, the degree to which it was used."}, {"time": 11111, "text": "And to the degree of how many people were involved and so on, there's all kinds of conspiracies around the man."}, {"time": 11111, "text": "But the question about her, Ghislaine."}, {"time": 11123, "text": "So I only know what I know from the inputs, which are the Vicky Ward."}, {"time": 11123, "text": "It's one of the podcasts."}, {"time": 11123, "text": "It's a narrative podcast."}, {"time": 11123, "text": "So it's like an audio kind of a documentary or journalistic piece that she did and put out."}, {"time": 11141, "text": "I thought it was really, really well done."}, {"time": 11141, "text": "I think it's called Chasing Ghislaine."}, {"time": 11146, "text": "And I listened to that whole thing."}, {"time": 11146, "text": "I didn't intend to listen to it all in one stretch."}, {"time": 11151, "text": "That's how you know it's good."}, {"time": 11152, "text": "I mean, it was like a weekend and I basically was, you know, cleaning and doing other things and walking Leon and listening to it."}, {"time": 11152, "text": "And I got through it pretty quickly."}, {"time": 11160, "text": "But I got really fascinated by it because I don't I don't know."}, {"time": 11160, "text": "But I think I feel like I find the whole situation gut wrenching because I think Jeffrey Epstein is a straight up like straight up sociopath, like no question with her."}, {"time": 11184, "text": "Everybody's calling her evil."}, {"time": 11184, "text": "And for her to have enabled and done a lot of the things that she did could potentially require."}, {"time": 11198, "text": "One might say that it could require a lack of empathy to be able to do those things knowingly."}, {"time": 11206, "text": "But at the same time, I think the information that was conveyed in the Vicki Ward piece was fascinating to me because it's clear that at the very least, it's like it's like all of these things could be true."}, {"time": 11221, "text": "She could maybe be not enough of a good person to have, you know, horribly victimized these young girls and destroy their lives."}, {"time": 11230, "text": "But she could have, I feel like I'm gonna get bashed for saying this, but she could have in some way of not quite known what she was doing or been a bit out of her mind."}, {"time": 11242, "text": "Like manipulating."}, {"time": 11243, "text": "I'm just saying people, I would hope that people would be open to that to exploring that as a possibility."}, {"time": 11251, "text": "Well, her family and friends are making that case."}, {"time": 11251, "text": "They're painting a broad picture of who she is as a human being and showing that she couldn't have done any of those things without being like systematically manipulated."}, {"time": 11271, "text": "What I listened to in that podcast about her relationship with her father, how her father died, her things about her childhood, and then Epstein coming into her life and basically kind of pushing all those buttons and becoming like the father figure."}, {"time": 11292, "text": "And so she would be in a position of kind of always wanting his approval."}, {"time": 11292, "text": "And just the way that things that are described about the way that she like was so subservient to him in this kind of astonishing way that seems really weird and abnormal."}, {"time": 11316, "text": "And yet I think she had a lot of money and connections and I think she lost the money but had all the connections."}, {"time": 11316, "text": "Either way, there was a ton that Epstein gained via his relationship with her, like a ton."}, {"time": 11331, "text": "So it makes sense that he would have manipulated her."}, {"time": 11331, "text": "He manipulates everybody."}, {"time": 11331, "text": "So without question, I think one could argue he definitely manipulated her."}, {"time": 11342, "text": "And again, I want to be careful not to be saying that's an excuse for what she did."}, {"time": 11342, "text": "I just think that it's important to explore these things and be open to them as opposed to just like broad brush painting her as a horrible person."}, {"time": 11361, "text": "Because people could say that based on things they've read or things that I did that like I'm a horrible person."}, {"time": 11361, "text": "And it's very different because what she did involved young girls whose lives were destroyed."}, {"time": 11378, "text": "But I think that people could be a bit open to understanding how somebody could be manipulated."}, {"time": 11378, "text": "There's a psychologist that I'm friends with that I got to know after I watched him on Leah Remini's show."}, {"time": 11398, "text": "So Leah Remini is the actress who was in Scientology, got out and has really been speaking out about it and trying to expose what they're all about and how diabolical that organization is."}, {"time": 11410, "text": "And a lot of people are exposing them and doing this type of work."}, {"time": 11410, "text": "And so she had this guy on her show who was in The Moonies and his name is Steve Haasen."}, {"time": 11410, "text": "And so he was in a cult and then he got out again by extreme circumstances."}, {"time": 11429, "text": "He got in a car accident and almost died."}, {"time": 11429, "text": "And that's what ended up getting him out of the cult that he was in."}, {"time": 11429, "text": "But really smart guy, was targeted when he was young, got pulled into The Moonies."}, {"time": 11441, "text": "But watching this interview of him on her show, he's talking about his experience and he said, if they had told me to kill somebody, I would have."}, {"time": 11441, "text": "And in that moment made me cry."}, {"time": 11441, "text": "But I also felt like I understand that."}, {"time": 11459, "text": "And not that if Mr. Fox had told me to kill somebody, I don't think I would have."}, {"time": 11459, "text": "But again, I understand how it could get to that point."}, {"time": 11459, "text": "So that makes me feel like with her, like I would be curious what Steve Haasen would think, kind of analyzing the entire situation."}, {"time": 11477, "text": "Because it's hard to understand that unless you've been in it."}, {"time": 11477, "text": "And I understand with him how he could have said that."}, {"time": 11477, "text": "If they had told me to kill somebody, I would have."}, {"time": 11477, "text": "That's pretty intense."}, {"time": 11477, "text": "I mean, that's pretty extreme."}, {"time": 11489, "text": "And it's interesting how you can get into it, how far you can go just one day at a time, like gradually."}, {"time": 11489, "text": "Just like the frog in the boiling water."}, {"time": 11502, "text": "I mean, all of these cases are fascinating, like Patty Hearst, that whole story."}, {"time": 11506, "text": "Well, I'm just also, I just, it's already a while ago, reread The Rise and Fall of the Third Reich."}, {"time": 11506, "text": "I've been reading a lot about Hitler and Goebbels for a long time working on a series about Hitler and the Third Reich."}, {"time": 11525, "text": "Because for me, it's like returning."}, {"time": 11525, "text": "So much of my family was destroyed or impacted by this time in history."}, {"time": 11525, "text": "That is somehow a way to find out more about myself is going back to that time."}, {"time": 11544, "text": "Have you ever thought about inherited trauma?"}, {"time": 11548, "text": "This sounds not to mock people, but this sounds like a thing that... Like a woke thing?"}, {"time": 11561, "text": "Like a woke thing, yeah."}, {"time": 11563, "text": "I don't mean it that way at all, but I get it because sometimes now when I say, now I almost have to put air quotes when I say something's triggering because I feel like I'm using a word that's now like overused or used in less serious."}, {"time": 11563, "text": "So now when I say something's triggering, it's like, I use air quotes."}, {"time": 11582, "text": "Yeah, it's funny because good words get taken up and then they get destroyed."}, {"time": 11586, "text": "Or overusing gaslighting."}, {"time": 11586, "text": "And I worry that that would happen with sociopathy."}, {"time": 11586, "text": "I think people need to understand sociopathy."}, {"time": 11586, "text": "I think it's critical for humanity that people understand it."}, {"time": 11597, "text": "Yeah, so just because you're being an asshole doesn't mean you're a sociopath."}, {"time": 11600, "text": "Doesn't mean you're a sociopath, exactly."}, {"time": 11600, "text": "And I feel like it's going to be this thing where now everybody's going to start calling everybody else a sociopath and it's like, ugh."}, {"time": 11600, "text": "And right now everybody calls everything gaslighting."}, {"time": 11600, "text": "If somebody's lying, it's not gaslighting."}, {"time": 11611, "text": "We started talking about, I already forgot, fluff?"}, {"time": 11611, "text": "Is it fluff?"}, {"time": 11611, "text": "It's fluff, right?"}, {"time": 11616, "text": "Fluff, yeah."}, {"time": 11617, "text": "Okay, so that was great."}, {"time": 11617, "text": "That's a new discovery for me."}, {"time": 11617, "text": "Let's talk about food a little bit, if we can."}, {"time": 11626, "text": "You know what, let's talk about restaurants first."}, {"time": 11626, "text": "That's the fascinating part of the story before anything else, which is opening an exceptionally successful restaurant in NYC, New York City."}, {"time": 11640, "text": "What does that take?"}, {"time": 11640, "text": "What does it take to open up from the very beginning, from the idea stage to the launching it, both the finances and the skill of actually getting people super excited by it, and then running it, all that chaos."}, {"time": 11656, "text": "I mean, to me, am I over romanticizing, but it seems like New York City is a really tough place to launch a restaurant in."}, {"time": 11664, "text": "Well, I think because it's extremely competitive and the standards are so high."}, {"time": 11664, "text": "So I think that's why there are so many good restaurants in New York, because if they're not good, they're not going to survive."}, {"time": 11678, "text": "So even like you could walk into what looks like a hole in the wall and it's going to have amazing food."}, {"time": 11678, "text": "That happens a lot."}, {"time": 11687, "text": "So what was the menu?"}, {"time": 11687, "text": "Was it vegan and raw from the beginning?"}, {"time": 11692, "text": "Yeah, it was."}, {"time": 11694, "text": "And raw means what?"}, {"time": 11695, "text": "Now I'm getting thrown back to all the interviews I did when people asked me these questions."}, {"time": 11695, "text": "It was so long ago."}, {"time": 11700, "text": "What's it like being vegan?"}, {"time": 11703, "text": "Nothing was cooked over roughly 118 degrees."}, {"time": 11703, "text": "There were people who are hardcore raw foodists, and there's also people who are hardcore vegans, and I was never any of those things."}, {"time": 11725, "text": "But what parts of your life where you're a vegan?"}, {"time": 11725, "text": "Are you still a vegan?"}, {"time": 11725, "text": "Do you eat meat?"}, {"time": 11725, "text": "Are you a vegetarian?"}, {"time": 11725, "text": "Are you raw?"}, {"time": 11737, "text": "I don't apply labels."}, {"time": 11743, "text": "I'm beyond those labels myself as well."}, {"time": 11743, "text": "But I'm a carnivore most of the time."}, {"time": 11743, "text": "It's the opposite of vegan, unfortunately."}, {"time": 11743, "text": "But no judgment."}, {"time": 11743, "text": "I think that's a beautiful thing to be is vegan."}, {"time": 11761, "text": "I think that it's people who are very adamantly one way or the other."}, {"time": 11761, "text": "I think that after all my years in this world and in this world in general and also consuming an enormous amount of inputs and podcasts about health, like I love listening to different points of view."}, {"time": 11783, "text": "So I love when somebody's arguing vegan and then somebody's arguing carnivore."}, {"time": 11796, "text": "Not just vaguely saying what's healthy or not for you, but really what is life like under this particular diet?"}, {"time": 11813, "text": "And I think that probably everybody's different."}, {"time": 11864, "text": "And there's athletes and there's people like Rich Roll who I like who's vegan and an athlete, but it might be something where that's working really well for him, but it wouldn't work well for somebody else."}, {"time": 11876, "text": "And I think there's also an element of people who try these things and then feel really good or feel really bad and they make a conclusion based on that initial period of time when it might be something where it makes you feel really good temporarily, but then over time you're gonna be depleted of certain things."}, {"time": 11891, "text": "And then we also live in a world where like our soil is depleted and there's a lot of processing that takes out of foods, a lot of things that we need."}, {"time": 11903, "text": "So I just think that there's no kind of one right answer."}, {"time": 11903, "text": "You can look at it from just a health perspective and then you can also look at it from like a morality and ethics perspective and then also like what's the impact on the environment and all those things are important."}, {"time": 11919, "text": "And I think that I've watched a lot of films and things and for a while right after that I might think, oh my God, I can't believe I ate this thing last week and now I'm gonna go back to being 100% vegan because I just watched this thing and it's fresh in my mind and now I'm thinking about it in a certain way."}, {"time": 11936, "text": "But then over time that sort of fades and then you start to get a bit more loose."}, {"time": 11936, "text": "And for me, I will end up eating a lot of things that aren't vegan usually in the context where I'm not adding to the consumption of it."}, {"time": 11957, "text": "So like at Rikers, most of the meat there was kind of weird and fake but there was like a chicken every Thursday and Sunday there was actual chicken, like the leg."}, {"time": 11972, "text": "Was that the most exciting thing for people?"}, {"time": 11974, "text": "Oh yeah, oh and then the most fights broke out on chicken day because there was like heightened."}, {"time": 11978, "text": "Thursday and Sunday you said?"}, {"time": 11980, "text": "Chicken day."}, {"time": 11981, "text": "So that was the most real meat you're getting is the chicken."}, {"time": 11985, "text": "Yeah, a lot of the rest of it."}, {"time": 11987, "text": "Chicken breast or white or dark meat?"}, {"time": 11990, "text": "Dark is the leg and the thigh."}, {"time": 11990, "text": "And it was cooked surprisingly well."}, {"time": 11990, "text": "And so I would always eat it."}, {"time": 11990, "text": "I mean, it's there and it's not, from a health perspective, one could say, well, that's probably the shittiest of the shitty chickens that are full of antibiotics and hormones and terrible things."}, {"time": 12010, "text": "So it's not optimal from that point of view."}, {"time": 12010, "text": "But it's like if it's otherwise going to be thrown in the trash, then."}, {"time": 12019, "text": "Yeah, you're not adding to it."}, {"time": 12020, "text": "Or, you know, like I've been drunk at a party and eaten a bunch of stuff that one would think I would never eat."}, {"time": 12028, "text": "But it's not like I ran to the store and bought it or went to a restaurant and ordered it."}, {"time": 12031, "text": "No, I'm the same."}, {"time": 12031, "text": "Liquor makes me eat things I shouldn't be eating."}, {"time": 12031, "text": "Or maybe should."}, {"time": 12031, "text": "As you wrote me in the email, life is complicated and fascinating and so is our decisions when we're drunk."}, {"time": 12047, "text": "I actually am a big fan of 7 Eleven."}, {"time": 12047, "text": "I go there sometimes late at night to think about life, and I'll eat whatever the stuff they have."}, {"time": 12058, "text": "I also think it's fascinating how our bodies intuitively know if you're quiet enough and you think about what you're craving."}, {"time": 12066, "text": "As long as it's not like if you're craving some processed junky food, that's probably something that's not quite functional."}, {"time": 12074, "text": "Sometimes I'll be like, I must have avocado, or I'll want to eat an entire parsley salad."}, {"time": 12074, "text": "And then it's happened."}, {"time": 12074, "text": "I went through a phase where, and here I'm like, do I say this out loud?"}, {"time": 12090, "text": "I could tell that my body wanted whatever was there."}, {"time": 12107, "text": "I suppose I could have investigated it and thought, well, what's in there?"}, {"time": 12107, "text": "Is it vitamin K, vitamin D?"}, {"time": 12107, "text": "What is it in the grass fed butter?"}, {"time": 12107, "text": "Because it wasn't regular butter."}, {"time": 12107, "text": "Ew, no."}, {"time": 12107, "text": "But this grass fed butter, I felt like I just wanted, I needed it."}, {"time": 12121, "text": "So there's probably something in there, and maybe I could have gone and just taken a lot of vitamin K and then not eaten the butter."}, {"time": 12128, "text": "There is something in there that's fascinating."}, {"time": 12128, "text": "I had that last night, actually, with, I went to a grocery store and I had a craving for tomatoes."}, {"time": 12128, "text": "I was like, what the hell is this?"}, {"time": 12128, "text": "Like, what?"}, {"time": 12128, "text": "It was weird."}, {"time": 12142, "text": "You should listen to that and then just get a bunch of tomatoes, because there's probably something in there."}, {"time": 12146, "text": "It was like, it felt right."}, {"time": 12155, "text": "And today, I have zero interest in tomatoes."}, {"time": 12158, "text": "Did you eat the tomatoes, though?"}, {"time": 12162, "text": "Or maybe not enough."}, {"time": 12162, "text": "So yeah, what you were saying?"}, {"time": 12169, "text": "Anyway, I think these things shift and change, and there's not a right answer."}, {"time": 12169, "text": "And then there's something where it's like one person might do well on something, another person doesn't."}, {"time": 12190, "text": "But then once I get them, I'm fine, and I don't need that anymore."}, {"time": 12190, "text": "And I could potentially get those from other sources."}, {"time": 12208, "text": "I would only eat the whole ones, which have the bones in them."}, {"time": 12211, "text": "And I used to chew on chicken bones and try to eat eggshells when I was little."}, {"time": 12211, "text": "So I think all of those things have calcium and other minerals in common, so there's probably something there that I needed."}, {"time": 12211, "text": "Because you'd think as a little kid, I wouldn't be drawn to oily fish and bones and eggshells."}, {"time": 12231, "text": "Yeah, it's interesting because you're saying the explanation for the craving is probably the nutrients you're getting."}, {"time": 12231, "text": "But when you're imagining the craving, you're not obviously imagining the nutrients, you're imagining the texture, the taste, the feel, a lot of the things that we actually experience as we're eating."}, {"time": 12231, "text": "That's our brain probably tricking us."}, {"time": 12251, "text": "Right, but do you love tomatoes?"}, {"time": 12254, "text": "Well, I think we determine that love is impossible to define."}, {"time": 12267, "text": "Maybe it's generational because it's a big Russian thing with potatoes and tomatoes because it's good with vodka salted."}, {"time": 12276, "text": "We were talking about the menu in the early days of the restaurant in New York."}, {"time": 12276, "text": "So what was on the menu?"}, {"time": 12276, "text": "What kind of foods were you playing with?"}, {"time": 12298, "text": "Well, over time, it got easier and easier."}, {"time": 12298, "text": "And then also I wasn't coming up with new dishes."}, {"time": 12298, "text": "It was the people that worked there."}, {"time": 12298, "text": "So I feel like if I could take credit for something, it would be recognizing talent."}, {"time": 12298, "text": "And when dishes were developed, this is when I was on my own."}, {"time": 12317, "text": "So it was opened with Matthew and Jeffrey."}, {"time": 12317, "text": "And then within a year, Matthew was out and Jeffrey was still involved as like the corporate sort of side of it."}, {"time": 12329, "text": "But then over time, I separated from that infrastructure as well and then was completely on my own."}, {"time": 12337, "text": "And in part, I did that because I was growing One Lucky Duck on the side and that was growing and growing and growing."}, {"time": 12337, "text": "And I knew there was something there."}, {"time": 12337, "text": "And yet the two businesses were completely intertwined."}, {"time": 12348, "text": "And so potential investors would come at me and they would see this very messy situation where I owned One Lucky Duck and Jeffrey Chatterot owned the restaurant."}, {"time": 12348, "text": "And how do we move forward from there?"}, {"time": 12360, "text": "And then people would say I should shut down the restaurant and just focus on One Lucky Duck."}, {"time": 12360, "text": "And I wanted them all to be together under one umbrella and to move forward where everybody's incentives were aligned."}, {"time": 12371, "text": "What was the magic?"}, {"time": 12371, "text": "Why was it so successful so quickly, would you say?"}, {"time": 12375, "text": "I want to half jokingly, but not joking, but sort of say that it was about the love and the food and the space."}, {"time": 12383, "text": "Can you define love?"}, {"time": 12386, "text": "But there was something special."}, {"time": 12386, "text": "So when people ask me about opening a restaurant, I say I don't want to get back into the restaurant business unless it's the same restaurant in the same space."}, {"time": 12396, "text": "Because there was something about that space that felt, I guess, felt magical, for lack of a better word, and the energy of a lot of the people there."}, {"time": 12409, "text": "And I think that people really cared about it."}, {"time": 12409, "text": "And so for whatever reason, there was an energy about the place."}, {"time": 12418, "text": "Would you ever do it again?"}, {"time": 12421, "text": "Would you ever consider reopening?"}, {"time": 12422, "text": "In the same space."}, {"time": 12423, "text": "That's a tough thing in New York, but you're thinking, okay, well."}, {"time": 12431, "text": "It's there?"}, {"time": 12432, "text": "Let me ask you this question, because I've been searching for that myself, asking myself this question, the last meal question."}, {"time": 12440, "text": "What's the best meal you've ever eaten in your life?"}, {"time": 12445, "text": "If I had to murder you at the end of this and you get one meal, but you can travel anywhere in the world, what would you eat?"}, {"time": 12455, "text": "It's one of those questions where I feel like I should have an answer prepared."}, {"time": 12460, "text": "It's too difficult to sort of pick favorites, but if somebody would force you to choose, you'd have to."}, {"time": 12469, "text": "I was eating something once and I had the thought that if I was going to die, I would come here and order plate after plate of this and eat this."}, {"time": 12478, "text": "Do you remember what it was?"}, {"time": 12480, "text": "Some diner in the middle of nowhere?"}, {"time": 12481, "text": "No, it was Pure Food and Wine was on Irving Place and then the kitchen connected to the One Lucky Duck juice bar, which had an entrance on 17th Street."}, {"time": 12492, "text": "So it was kind of like this L shape."}, {"time": 12493, "text": "And then there was a huge garden in the back."}, {"time": 12495, "text": "On the corner was Casamono and Bar Jamon, which was Mario Batali and Joe Bastianich were behind that."}, {"time": 12504, "text": "And it was very focused on meat, but also like organ meats and strange, unusual meats."}, {"time": 12510, "text": "Spanish restaurant."}, {"time": 12511, "text": "Wow, lots of good reviews."}, {"time": 12512, "text": "Yeah, it was really good."}, {"time": 12514, "text": "This is just a funny that we surrounded it, but Bar Jamon was this tiny little bar."}, {"time": 12521, "text": "And I went in there once with Tobin late and I don't know why we ended up going there, but it was right before they closed and drank red wine and they had tomato bread."}, {"time": 12534, "text": "And it's just like a baguette, although it's a Spanish or whatever."}, {"time": 12540, "text": "It's like a bread, like a baguette, like a thin that they toast."}, {"time": 12543, "text": "And I think they rub it with garlic and they don't even put tomato slices on it."}, {"time": 12547, "text": "It's like they rub it and the tomato juice is all over it."}, {"time": 12551, "text": "It was just bread and tomato juice and probably some garlic flavor and really good salt and some wine and red wine."}, {"time": 12560, "text": "And we sat there and ordered a plate, ate it, ordered another one, ate it, ordered another one."}, {"time": 12565, "text": "I think we had like six plates."}, {"time": 12567, "text": "And I remember sitting there thinking I could just eat this until my stomach bursts."}, {"time": 12572, "text": "And then, and so if this is like, if somebody was like, what's the last, I would just want to sit there and eat plate after plate."}, {"time": 12579, "text": "I think if you went back there and ate the same thing, it wouldn't taste nearly as good."}, {"time": 12582, "text": "And like, was there something magical about that night, about the way that bread was made on that night, the way you felt at that night, the wine, the something?"}, {"time": 12596, "text": "Or do you think like, where's the power from that food come from?"}, {"time": 12600, "text": "Is it the food itself or is it the environment?"}, {"time": 12604, "text": "I'm sure it's both, but like if somebody brought a plate of it here right now, it would be completely delicious."}, {"time": 12611, "text": "But it might not feel as kind of, not that it felt magical, but it was the whole warmth of the experience and the red wine."}, {"time": 12622, "text": "It's the afternoon in Texas right now, so it's different."}, {"time": 12625, "text": "I keep forgetting and thinking it's late at night."}, {"time": 12628, "text": "Yeah, we're surrounded by, this whole place is anti Huberman."}, {"time": 12633, "text": "There's no light."}, {"time": 12635, "text": "Well, it's pro Huberman if it's in the afternoon or the evening, except for these bright lights."}, {"time": 12641, "text": "If they were lower down, if they were like down below, then they're hitting the tops of our eyes."}, {"time": 12647, "text": "But it's the light coming from above that's destructive at night because it's hitting the bottom of your eyes."}, {"time": 12652, "text": "So it's like mimicking the sun, which is signaling your body that it's time to be awake."}, {"time": 12657, "text": "So as much as possible."}, {"time": 12659, "text": "So I do this in the evenings."}, {"time": 12660, "text": "I shut off all the overhead lights."}, {"time": 12662, "text": "I try to dim the lights as much as I can, and I turn on like a lamp versus an overhead light."}, {"time": 12668, "text": "Are you also doing the caffeine thing, like not consuming much caffeine way before bed?"}, {"time": 12674, "text": "Oh, I can't."}, {"time": 12675, "text": "Yeah, I usually don't have caffeine late."}, {"time": 12680, "text": "I try not to have it."}, {"time": 12681, "text": "I drink into the night."}, {"time": 12684, "text": "2 p.m. would be my last."}, {"time": 12686, "text": "Ideally, I wouldn't drink coffee after two, but plenty of times I do."}, {"time": 12690, "text": "Especially if I haven't had midday coffee, then I worry I'm going to get a headache."}, {"time": 12694, "text": "That makes you way more responsible than me."}, {"time": 12696, "text": "Let me return to love."}, {"time": 12700, "text": "What do you think makes for a good romantic relationship, given your experience?"}, {"time": 12712, "text": "I mean this question."}, {"time": 12713, "text": "I think a mutual respect is a big part of it."}, {"time": 12716, "text": "Mutual respect."}, {"time": 12719, "text": "Well, and understanding it in a way that you want what's best for the other person, not in a way that you would sacrifice yourself for them necessarily, but in a very healthy way."}, {"time": 12733, "text": "So I think a healthy relationship is where you want what's best for the other person."}, {"time": 12737, "text": "So I always find it tragic."}, {"time": 12740, "text": "Like say you started dating somebody who then would get jealous or upset if you spent too much time working on something, right?"}, {"time": 12751, "text": "But that's like your life."}, {"time": 12753, "text": "So if you're working on some robotics thing and you're having some breakthrough and so you just want to spend a lot of time wherever you spend a lot of time doing those things, and then that other person got all bent out of shape and it became like a competition."}, {"time": 12767, "text": "That to me seems very unhealthy because if somebody, if it was like a genuine healthy love, she would want you to be doing those things."}, {"time": 12782, "text": "Yeah, that's a good observation."}, {"time": 12784, "text": "To me, I think the way to achieve that is actually, or the easiest way to achieve that, at least for me, is actually legitimately be excited by the things the other person is excited by."}, {"time": 12800, "text": "So like not in some generic sense, it's good for them to be doing the robotics thing."}, {"time": 12806, "text": "It's more like you become a fan of all the cool things that they're doing in their life."}, {"time": 12814, "text": "Somebody told me recently, there's a term for this, but I love watching other people succeed, be excited about shit."}, {"time": 12828, "text": "I like celebrating other people."}, {"time": 12830, "text": "It's fun for me to watch people do the thing they love doing."}, {"time": 12833, "text": "So in some sense, that's reinvigorating to me and exciting to me."}, {"time": 12839, "text": "And so one of the things for me in a relationship is you get excited by watching another person do the thing they're excited about."}, {"time": 12847, "text": "It's not like I intellectually know it's good for them to have their own thing."}, {"time": 12851, "text": "It's like I legit get excited by their own thing."}, {"time": 12856, "text": "Right, but that's what I mean."}, {"time": 12858, "text": "It's like that person would be excited because you're excited."}, {"time": 12863, "text": "But I think the easiest way to achieve that is actually be like, what am I trying to say?"}, {"time": 12868, "text": "It's not like saying that you should be excited."}, {"time": 12872, "text": "It's like you can't help yourself but be excited."}, {"time": 12875, "text": "Right, but I think that's possible."}, {"time": 12877, "text": "It's possible for that to be the case for somebody that might have an appreciation for what you're doing, but that's not what that person is going to go spend their time on themselves."}, {"time": 12893, "text": "Yeah, they were by themselves."}, {"time": 12894, "text": "Right, so the other person might be really good at a musical instrument that requires a lot of practice, and you're not interested in playing that musical instrument."}, {"time": 12902, "text": "But you appreciate the beauty of the music and understand that that person is getting something out of it."}, {"time": 12907, "text": "So you would be excited when they get a chance to practice or whatnot."}, {"time": 12911, "text": "Do you think love should be simple or complicated in a relationship?"}, {"time": 12918, "text": "Well, it might be inherently complicated."}, {"time": 12921, "text": "I may have asked Huberman the exact same question."}, {"time": 12925, "text": "I forget what he said."}, {"time": 12927, "text": "I thought it was interesting when you asked Elon about love."}, {"time": 12930, "text": "Oh, boy, yeah."}, {"time": 12932, "text": "That's going to be conversation number like seven that he actually answers it."}, {"time": 12939, "text": "Well, what was interesting that I found admirable was this sort of like a duty to humanity."}, {"time": 12946, "text": "I think you asked about it not in a person but about the work."}, {"time": 12952, "text": "And so it was like to put all this energy to try to kind of like move things forward, knowing that he will probably die before it gets there."}, {"time": 12964, "text": "You're talking about like something related to the science of rocketry."}, {"time": 12970, "text": "Yeah, he's kind of a rocket scientist."}, {"time": 12973, "text": "But whatever you were asking him about whether something could be accomplished, and he said yes, but not in his lifetime."}, {"time": 12979, "text": "But he's going to keep pushing it forward anyway."}, {"time": 12981, "text": "So I felt like that was a really, you know, to put so much of yourself into something just to kind of move the baton forward for humanity was a struck me as an admirable thing."}, {"time": 12995, "text": "You know, there's no great reward in terms of you're going to, you know, you're going to see that invention happen or you're going to see Mars colonized or whatever it is."}, {"time": 13006, "text": "But you're willing to put in all the work and brainpower to try to push it along."}, {"time": 13012, "text": "Like thinking about the biggest possible impact on the world."}, {"time": 13015, "text": "Just thinking about humanity."}, {"time": 13017, "text": "I think all of us, when we do cool things, are contributing to humanity."}, {"time": 13021, "text": "And it's good to think of it that way."}, {"time": 13024, "text": "When you run a restaurant and you make all the people happy, I don't know, that's part of that."}, {"time": 13029, "text": "It's good to think big like that."}, {"time": 13032, "text": "And Elon does definitely."}, {"time": 13034, "text": "When I asked him about love, you know, just knowing him personally now, I'm asking about the personal question about love."}, {"time": 13044, "text": "But I'm giving him the freedom to escape it, which he always does."}, {"time": 13048, "text": "That's very generous."}, {"time": 13051, "text": "Because I don't want to trap him."}, {"time": 13053, "text": "I understand it's a difficult."}, {"time": 13055, "text": "So, you know, he's better at solving engineering problems than talking about love."}, {"time": 13059, "text": "The other thing he's really good at is going to the joke."}, {"time": 13079, "text": "It's the stuff, the easiest way you can talk about it is humor."}, {"time": 13082, "text": "The same with trauma, like personal trauma, the easiest stuff for him to talk about is laugh about it."}, {"time": 13088, "text": "He's been very tough privately or on podcasts to talk about personal, like difficult stuff."}, {"time": 13098, "text": "And for me, obviously, that's often the most interesting stuff as humans, like, where's your darkness?"}, {"time": 13104, "text": "You know, but for him, it's tough."}, {"time": 13108, "text": "For a lot of people, it's tough."}, {"time": 13109, "text": "But it's important to go there."}, {"time": 13111, "text": "Maybe first in the privacy of your mind."}, {"time": 13115, "text": "And I think, you know, bringing it back to the relationship thing is wanting to."}, {"time": 13121, "text": "Like, understand and accept those things about somebody else, I mean, sort of cliche to say that you can't change somebody."}, {"time": 13131, "text": "And you don't want to also, like, try to change yourself for somebody, but you can sort of figure things out and be willing to make adjustments and navigate for the sake of something working."}, {"time": 13145, "text": "And sometimes that comes from understanding, which might require a lot of effort and open mindedness if somebody is kind of very different from you."}, {"time": 13157, "text": "Yeah, and being fragile yourself, revealing your flaws and getting to learn about theirs and getting to see the beauty in them."}, {"time": 13166, "text": "Because that's the good stuff."}, {"time": 13169, "text": "Or if the flaws are too much of a red flag, then you walk away."}, {"time": 13173, "text": "That's the hard stuff."}, {"time": 13174, "text": "Either the red flags might be the thing that you actually get to love deeply because they're a flawed human, or it might be the reason to walk away quickly."}, {"time": 13184, "text": "And you don't know."}, {"time": 13186, "text": "It's a gamble."}, {"time": 13188, "text": "If it's a red flag, then it, by definition, is something that's telling you to walk away."}, {"time": 13192, "text": "If it was just, like, something about their character that's challenging, you could appreciate that or understand it."}, {"time": 13201, "text": "But it's not something that, like, they're intentionally trying to use to deceive you."}, {"time": 13206, "text": "I think red flags, I guess it's more about, like, manipulation and or, like, somebody's kind of extreme dysfunction or something would be red flags."}, {"time": 13216, "text": "But I think there could be things that are quirky or weird or even dark about somebody that are acceptable."}, {"time": 13226, "text": "Yeah, but they might look like red flags."}, {"time": 13228, "text": "If there's someone crying on the subway, that's a red flag for me."}, {"time": 13235, "text": "That she might be, like, an emotional basket case, an eye maintenance crazy person."}, {"time": 13241, "text": "But, you know, it could also be, there could be a deeper story to it."}, {"time": 13244, "text": "So that's what I'm trying to tell you."}, {"time": 13249, "text": "What advice would you give to young folks today if they want to launch a restaurant in New York City and then message somebody on Twitter?"}, {"time": 13258, "text": "I was, before you finished the sentence, I was about to say read a lot of books."}, {"time": 13263, "text": "But then you said, because you said what advice would you give to young people today?"}, {"time": 13267, "text": "And I was like, read a lot of books."}, {"time": 13270, "text": "And then you got to the restaurant part."}, {"time": 13273, "text": "No, I mean, I was joking about the restaurants."}, {"time": 13275, "text": "Yeah, about life, I would say."}, {"time": 13277, "text": "Not just about career as a restaurateur, but just in life, how to be successful, how to be, how to live a life that can be fulfilling and how to live a life they can be proud of."}, {"time": 13291, "text": "So read a lot of books."}, {"time": 13296, "text": "But I think self awareness is key, but I also think there's some of those things where, like, people kind of have to learn their own lessons."}, {"time": 13306, "text": "But I think in part because I never had kids and I never wanted kids, I feel like through my book, I keep thinking that I want a lot of the lessons that I learned to be useful to other people, particularly younger people, and in many cases, younger females, to maybe understand themselves a little better along the way."}, {"time": 13332, "text": "Because I think that a lot of mistakes that I made and things that happened or things that I did that I'm embarrassed about or things that I stepped into that I wouldn't have otherwise stepped into or allowed to happen were a result of, in many cases, like insecurity, like a lack of confidence."}, {"time": 13377, "text": "They're just repeated a lot."}, {"time": 13378, "text": "But anyway, the idea that people repeat patterns, right?"}, {"time": 13384, "text": "I think that's very true."}, {"time": 13387, "text": "And so to be aware of that and to figure it out sooner rather than later so you don't keep stepping into the same thing over and over again."}, {"time": 13396, "text": "You mentioned sort of giving yourself time and space to think."}, {"time": 13402, "text": "Yeah, which sometimes isn't possible."}, {"time": 13404, "text": "Don't let momentum of life sort of carry you away."}, {"time": 13407, "text": "And I think for me, one of the things that would have scared me about having kids is the chaos of it or not being able to handle it."}, {"time": 13418, "text": "But I think that's just me, not most people."}, {"time": 13421, "text": "You ran a restaurant."}, {"time": 13432, "text": "Do you like a good cry?"}, {"time": 13443, "text": "Yeah, is there candles?"}, {"time": 13444, "text": "I cried this morning."}, {"time": 13446, "text": "Not intentionally, not for long."}, {"time": 13447, "text": "Happiness or just overwhelmed?"}, {"time": 13458, "text": "Very often they're like these little animal rescue stories or whatever, but this was this guy Matt who used to be my trainer years ago and put this little montage video to music."}, {"time": 13471, "text": "If there hadn't been music, I probably wouldn't have cried."}, {"time": 13473, "text": "But it was showing his wife having their second child, not showing it, but like the sort of before and then the baby in her arms right afterwards and then bringing the baby home."}, {"time": 13485, "text": "It was a very short little clip, but set to music."}, {"time": 13489, "text": "And I watched that and started to cry."}, {"time": 13491, "text": "But like I didn't sob or anything, so I think I cry easily."}, {"time": 13499, "text": "Interestingly though, in actual horrifically tragic things or when they apply to me, I might not cry and then people find that unusual."}, {"time": 13528, "text": "When I was sentenced to jail, I didn't cry."}, {"time": 13546, "text": "So you kind of cry it out later slowly."}, {"time": 13551, "text": "Maybe years later."}, {"time": 13554, "text": "And maybe that's what I'm really crying about when I cry at these little videos or something."}, {"time": 13558, "text": "But I'm glad for it because I feel like it always feels like kind of a relief."}, {"time": 13563, "text": "Well, let me ask this because it's interesting what you would say."}, {"time": 13568, "text": "Do you have regrets about things in your life?"}, {"time": 13575, "text": "Like what do you regret?"}, {"time": 13576, "text": "If there's one day you could live again, which day would you pick?"}, {"time": 13583, "text": "Like relive and make different choices?"}, {"time": 13587, "text": "Well, like one obvious thing could be the day that I let Anthony Strangers in the door."}, {"time": 13613, "text": "I think one could argue that's the biggest mistake."}, {"time": 13627, "text": "Am I having the One Lucky Duck brand?"}, {"time": 13643, "text": "So I wouldn't go undo it."}, {"time": 13644, "text": "So I feel like a lot of things are like that."}, {"time": 13646, "text": "And I guess I could optimistically hope that there are good things down the road where I'll think, well, I'm here and I'm grateful for it and therefore I'm grateful for the things that got me here, which include a lot of dark things."}, {"time": 13661, "text": "It's hard to say because a lot of people were hurt in my case, but I am optimistic that I can make those things up."}, {"time": 13676, "text": "And I feel like those are numbers and the employees were all paid back."}, {"time": 13682, "text": "So anybody else that is out money because of everything that happened isn't somebody that's like not able to feed themselves."}, {"time": 13698, "text": "And it's numbers."}, {"time": 13704, "text": "And sometimes when I think about my own challenges, they feel sort of inconsequential in comparison to other things going on in the world."}, {"time": 13715, "text": "So yes, it's hard being humiliated or it's hard to have people say nasty things about you on Twitter, Instagram, but really who cares?"}, {"time": 13728, "text": "Because that's just words and things."}, {"time": 13730, "text": "And I'm not like fleeing my home and watching people get shot."}, {"time": 13746, "text": "Maybe something even more beautiful than you've ever done before."}, {"time": 13750, "text": "I am optimistic."}, {"time": 13752, "text": "And I also feel like part of the reason I like having these conversations is because I feel like people will learn stuff from my shitty experiences to avoid going through their own shitty experience."}, {"time": 13765, "text": "And I've heard a ton of that from a lot of women and some men writing to me saying that they went through something similar and nobody understood."}, {"time": 13775, "text": "And my story helped them or might help them get somebody else out of a situation."}, {"time": 13783, "text": "So making it useful feels good."}, {"time": 13786, "text": "So through all of this, Leon was with you."}, {"time": 13790, "text": "He recently had a birthday, March I guess."}, {"time": 13794, "text": "Yes, 12."}, {"time": 13796, "text": "I made him a phenomenal meat cake or a layered cake that involved a variety of animal foods."}, {"time": 13806, "text": "He's not a vegetarian?"}, {"time": 13807, "text": "No, he's not."}, {"time": 13808, "text": "But I also give him like really high quality stuff."}, {"time": 13812, "text": "But yeah, he's not a vegan or vegetarian."}, {"time": 13814, "text": "Let me ask you a hard question."}, {"time": 13816, "text": "Do you think about the tragic fact that dogs live much shorter lives than us humans?"}, {"time": 13822, "text": "Do you think about his mortality?"}, {"time": 13827, "text": "I kind of try not to, but all the time."}, {"time": 13830, "text": "Because you told me in traveling here to Austin, Texas, you're not in the habit of leaving Leon by himself."}, {"time": 13841, "text": "Well, he's not by himself, but I know I haven't been away from him in certainly since before COVID."}, {"time": 13853, "text": "So I'm not used to it."}, {"time": 13855, "text": "And so I people always say that dogs have like that dogs have attachment issues or get separation anxiety."}, {"time": 13863, "text": "But in my case, at least it's like I think he's fine."}, {"time": 13867, "text": "I'm the one that is, you know, he's like fine."}, {"time": 13870, "text": "I'm the one that gets anxious about it, being away from him."}, {"time": 13875, "text": "You're the one who acts like a dog when you say you come back and you're super excited to see him."}, {"time": 13879, "text": "Yeah, I can pee on the floor and wiggle your tail and drool and all that kind of stuff."}, {"time": 13884, "text": "But do you think about the fact, you know, that you might lose Leon soon?"}, {"time": 13890, "text": "I think about it all."}, {"time": 13891, "text": "I mean, I try not to think about it."}, {"time": 13893, "text": "Are you scared of it?"}, {"time": 13895, "text": "But then I also just try to understand that it's inevitable."}, {"time": 13900, "text": "And I mean, yeah, assuming I'm still around, then that's I think one of the things about having adopting a dog or caring for an animal, unless it's one of those animals that lives a really long time."}, {"time": 13918, "text": "I just found out that parrots live an extraordinarily long time."}, {"time": 13923, "text": "But they're annoying."}, {"time": 13925, "text": "So you get, it's a trade off."}, {"time": 13927, "text": "The ones we love live a short time."}, {"time": 13929, "text": "The ones that annoy you live a long time."}, {"time": 13932, "text": "So I just think it's one of those things that you just know it's going to happen and it's just part of life."}, {"time": 13938, "text": "And I think it's one of those pains that's, it's painful, but you just kind of have to go through it."}, {"time": 13946, "text": "And what's the alternative?"}, {"time": 13948, "text": "You're not going to, it's like saying you would never want to fall in love because of the heartbreak that's going to inevitably come."}, {"time": 13954, "text": "So some people do that."}, {"time": 13956, "text": "They just avoid ever."}, {"time": 13958, "text": "You're saying, screw it, I'm diving right in."}, {"time": 13961, "text": "It was all worth it."}, {"time": 13962, "text": "What about your own mortality?"}, {"time": 13963, "text": "You think about yourself dying?"}, {"time": 13965, "text": "Less so than I was before."}, {"time": 13969, "text": "I think I wrote about that and I put this letter, Dear Mr. Fox, online, which I never intended to do."}, {"time": 13976, "text": "But I did because of all the misconceptions about the film and our relationship."}, {"time": 13980, "text": "And so I put this thing up online that I'd written on my phone on multiple subway rides."}, {"time": 13987, "text": "And at the end of it, I talk about because especially then when it was the height of everything was gone and what do I have to live for?"}, {"time": 13995, "text": "I sort of noticed and wrote about how differently I felt about things, whereas I used to be afraid."}, {"time": 14002, "text": "I used to have a healthy fear of being pushed in front of a train because that happens in New York or anywhere."}, {"time": 14009, "text": "Or I had a healthy fear of, I don't know, walking down a dark street at night."}, {"time": 14016, "text": "But I noticed that at the time I didn't really have those fears because I was like, what do I have to lose?"}, {"time": 14025, "text": "I don't have anything anymore."}, {"time": 14026, "text": "What do I have to lose?"}, {"time": 14027, "text": "So I certainly feel much less that way."}, {"time": 14032, "text": "But something about those feelings lingered where I'm less afraid of it or more just less afraid of it, but hoping it's not some sort of a gruesome way."}, {"time": 14045, "text": "I mean, some people are really afraid of flying."}, {"time": 14047, "text": "And I feel like, well, statistically, it's extremely safe."}, {"time": 14050, "text": "And if it's going to happen, it's going to happen."}, {"time": 14052, "text": "There's nothing you can do."}, {"time": 14054, "text": "There's really nothing you can do unless you're going to do what that guy in that small plane did the other day and leap over and was able to take control of the plane."}, {"time": 14063, "text": "But I mean like a commercial flight."}, {"time": 14065, "text": "So it's like if you're going to die, you're going to die."}, {"time": 14067, "text": "And it's just your time."}, {"time": 14068, "text": "And all you can do is hope that I would probably prefer to have as little awareness about it as possible."}, {"time": 14076, "text": "You know, it's like you'd rather have somebody if you're going to get shot, you'd rather have somebody shoot you in the back of the head and you didn't see it coming and just boom, lights out versus somebody holding a gun to your head."}, {"time": 14088, "text": "And then you're going to feel all this fear and have to like feel all of that."}, {"time": 14094, "text": "Which also made me think of, you know, animals and animal suffering in the way that some people argue that because of the conditions and the fear that that's like that's like in their bodies when they're killed, which is an interesting thing to think about."}, {"time": 14115, "text": "Yeah, I clearly struggle with the ethics of I just I think about it a lot about like our current food system, which involves a system that everybody has sort of accepted and normalized where."}, {"time": 14142, "text": "Like say aliens did come down and looked at us and realized that we're a particularly good source of whatever fuel they need."}, {"time": 14153, "text": "So then they imprisoned us all in cages that were like the equivalent of like sardines and jammed in an elevator."}, {"time": 14162, "text": "And then we were bred and we would get sick and we'd go crazy and we'd do the equivalent of like pecking and then we'd get abused and then like grotesquely and brutally killed."}, {"time": 14177, "text": "And that was like our entire lives."}, {"time": 14179, "text": "And so if like aliens came down and started and did all of that, we would have to be OK with that, which is something that my was said to me after watching this movie called Our Daily Bread many years ago."}, {"time": 14197, "text": "But it's an interesting way to think about it, because I mean, we would have to be OK with it because that's kind of what we're doing now."}, {"time": 14207, "text": "Yeah, we've normalized certain kinds of cruelty."}, {"time": 14210, "text": "And I don't people think, yeah, people think that like I would object to hunting hunting for sport, I think, is grotesque."}, {"time": 14219, "text": "But if you're hunting and then you're going to eat the entire animal and you're hunting in a way where it's kind of like."}, {"time": 14229, "text": "You know, that that animal like lived a free and happy life until that moment in the same way that the animal lived a free and happy moment, lived a free and happy life."}, {"time": 14239, "text": "Or we don't know, maybe they were depressed, but they lived a free life until like the lion came and took it down."}, {"time": 14247, "text": "So is a human shooting an animal for food somehow more tragic or horrible than a lion attacking an elk?"}, {"time": 14257, "text": "Yeah, well, so there's a lot of complexities to it on top of all of that."}, {"time": 14261, "text": "So one, you said sort of hunting for sport is bad, but there's this complex ethical equation of the fact that hunting for sport is the thing that often funds the preservation of a species."}, {"time": 14273, "text": "That's well, no, that's another complicated layer."}, {"time": 14275, "text": "There's like the Maui venison, all the deer in Hawaii."}, {"time": 14280, "text": "And I might have gotten Maui venison treats for Leon."}, {"time": 14286, "text": "But they're they're hunting those deer is a way of preserving."}, {"time": 14294, "text": "So, I mean, these things are complicated."}, {"time": 14296, "text": "But that's why I don't have a problem with somebody shooting an elk or bringing it home and eating it like my you know, like I've eaten elk jerky and things like that from."}, {"time": 14308, "text": "That's one of those situations where like I wouldn't morally have a problem with it."}, {"time": 14313, "text": "And for me, it's also I'm not one of those people where I think like, you know, I wouldn't eat meat."}, {"time": 14319, "text": "It's more like I don't want to add to the consumption of it."}, {"time": 14322, "text": "And I wouldn't want to eat sort of like the factory farmed meat necessarily unless I'm in prison and it's otherwise going to get thrown away."}, {"time": 14331, "text": "But hashtag a lot of a lot of things, you know, you know, you make do things differently there."}, {"time": 14343, "text": "So, you know, it's just these things are complicated."}, {"time": 14343, "text": "But so it's not about like, you know, I don't want that in my body."}, {"time": 14348, "text": "It's sort of like what?"}, {"time": 14348, "text": "Where did it come from and what's going on here?"}, {"time": 14353, "text": "And I think that like if you just followed Joe Rogan's Instagram, there's sort of a bit of a glorification of meat that."}, {"time": 14367, "text": "Because I listen to enough that I heard the one where he talked, there was a recent one where he's talking about Anthony Bourdain."}, {"time": 14374, "text": "And in that conversation, I think it was that one."}, {"time": 14377, "text": "He explained that he sort of did it in summary."}, {"time": 14377, "text": "So I feel like he talked about it in the past, but did all this research and came to the conclusion."}, {"time": 14386, "text": "Based on all his research, came to the conclusion that he was either going to be vegetarian or shoot his own meat."}, {"time": 14393, "text": "And hunt."}, {"time": 14393, "text": "And so that that's totally different."}, {"time": 14397, "text": "That's something I mean, that's very like admirable, I think."}, {"time": 14397, "text": "And he has the means to do it."}, {"time": 14403, "text": "Not only that, he does it with a bow."}, {"time": 14403, "text": "Even more so."}, {"time": 14408, "text": "It is a good question."}, {"time": 14408, "text": "It's a good question how we get out of this factory."}, {"time": 14415, "text": "Because I do like I like meat."}, {"time": 14415, "text": "I think it's delicious."}, {"time": 14421, "text": "And we're dependent on the not just on the nutrients and the taste."}, {"time": 14421, "text": "We're also dependent on the cost."}, {"time": 14429, "text": "A lot of people have gotten used to a particular kind of cost that they pay for meat."}, {"time": 14434, "text": "But I think if you wiped out all the government subsidies, it would be a completely different story."}, {"time": 14440, "text": "Because why are vegetables so expensive?"}, {"time": 14440, "text": "And all the subsidies."}, {"time": 14445, "text": "Somebody who bought some tomatoes yesterday."}, {"time": 14445, "text": "I'm protesting."}, {"time": 14445, "text": "Why is salad so expensive?"}, {"time": 14451, "text": "But none of the if you if you look at the subsidies that are given to the all of the inputs to the meat industry, like the grain and soy and whatnot, and then to the meat and dairy industries and all the subsidies that prop up those industries and allow those products to be cheap and and sustainable from a business perspective, not environmental."}, {"time": 14478, "text": "It's government subsidies."}, {"time": 14478, "text": "So what if we took all that away?"}, {"time": 14481, "text": "And then also, what if we gave that to, you know, the the kale and hemp and fresh greens farmers then and made those foods more affordable and then had meat reflect its actual true cost?"}, {"time": 14498, "text": "Then, you know, then people would just eat more vegetables and less meat because of the cost."}, {"time": 14505, "text": "You mentioned that you crossed off one item from your list."}, {"time": 14505, "text": "I forget what the item was, but."}, {"time": 14511, "text": "Oh, it was I had previously thought that I would want to go to Vegas one day just to cross that off my list."}, {"time": 14516, "text": "And it's not like I was like, oh, one day I want to go to Vegas."}, {"time": 14516, "text": "It was just like, I imagined I would only go there once just to see it and then be done with it."}, {"time": 14526, "text": "And I still think you can do it because there's a particular Vegas experience that's worth having."}, {"time": 14526, "text": "And there's maybe a couple of Vegas experiences that are worth having."}, {"time": 14539, "text": "I find casinos horribly depressing because I think they're just predatory."}, {"time": 14539, "text": "Everything about them is predatory."}, {"time": 14546, "text": "It's not it's not it's not the casinos that are important."}, {"time": 14546, "text": "It's the people."}, {"time": 14549, "text": "The culture and the whole crazy atmosphere."}, {"time": 14551, "text": "The people you meet, the people you meet in the chaos that is Las Vegas can create a memorable experience."}, {"time": 14560, "text": "You lose track of what is what is day, what is night."}, {"time": 14560, "text": "You can get drunk and make all the mistakes that somehow create a beautiful masterpiece at the end of it."}, {"time": 14571, "text": "That's for another time."}, {"time": 14571, "text": "What else is on the bucket list?"}, {"time": 14571, "text": "What items on the bucket list you haven't done yet?"}, {"time": 14571, "text": "You really, really would like."}, {"time": 14578, "text": "We talked about mortality, that there's a finite deadline."}, {"time": 14578, "text": "What pops in your head is something that you want to still do."}, {"time": 14586, "text": "What I want is to not die and owe people money."}, {"time": 14591, "text": "So whatever mistakes you make."}, {"time": 14593, "text": "I want to I want to live to write those things."}, {"time": 14593, "text": "And I also felt really strongly about my what I what I and everybody in the business had built."}, {"time": 14593, "text": "And so a big part of me wants to resurrect the brand."}, {"time": 14616, "text": "Because when I I felt really strongly about it, like I had that feeling that this was."}, {"time": 14623, "text": "This was going to be a thing that I I wanted to build and grow and could have a really positive impact and outlast me."}, {"time": 14630, "text": "And would you bring it back as the same name?"}, {"time": 14634, "text": "Yeah, well, I put the logo on my arm."}, {"time": 14634, "text": "That's kind of how strongly I felt about it."}, {"time": 14634, "text": "And so when I did that and around that time and all of that time, I felt really, really strongly that."}, {"time": 14649, "text": "Quietly, because it feels like a little bit bold, but quietly felt really almost with a certainty that it was going to be something really big and it was growing and growing and all signs were pointing towards there."}, {"time": 14667, "text": "I was just sort of stalled and couldn't figure out the logistics and then enter Mr. Fox."}, {"time": 14673, "text": "So the universe can be quite absurdly cruel at times."}, {"time": 14680, "text": "But yeah, but that is something that's something worth reaching for is repay the debts of the past."}, {"time": 14690, "text": "And then people have said to me that Leon achieved some kind of immortality via being in the documentary."}, {"time": 14690, "text": "And then I might I don't understand this world at all, but I might do like an NFT thing related to Leon's image, which would be another way of kind of immortalizing his image, at least."}, {"time": 14712, "text": "Yeah, but that's a I mean, it's a potentially in progress kind of a crazy leap."}, {"time": 14721, "text": "But and potentially relaunching the restaurant."}, {"time": 14726, "text": "Possibly, yes, there's the restaurant and there's one lucky duck in that brand and they're sort of separate but related and they could each exist independently."}, {"time": 14739, "text": "I liked it better when they existed together because I felt like they were very complimentary in a lot of ways and they made sense together."}, {"time": 14739, "text": "But either one could be done separately without the other."}, {"time": 14750, "text": "Do you think you will find love again, given the chaos you had to go through?"}, {"time": 14759, "text": "I have and I never talk about it."}, {"time": 14759, "text": "I've never talked about it."}, {"time": 14764, "text": "You have found love again?"}, {"time": 14766, "text": "Yes, but also in a kind of possibly doomed temporary way, which You don't like it simple do you?"}, {"time": 14777, "text": "It's not that it's not simple."}, {"time": 14777, "text": "It's actually quite simple."}, {"time": 14777, "text": "It's just that, again, there's a large age gap."}, {"time": 14784, "text": "I'm the older one, which in itself isn't a problem, because, again, I wouldn't I wouldn't want to like if somebody wanted kids in a family, I wouldn't want to hold them back from that."}, {"time": 14797, "text": "And so if I sort of wanted to be with somebody who wanted those things, even if I was completely in love with somebody, I would have to kind of like."}, {"time": 14809, "text": "You know, hurt, endure the pain to be like, no, I'm going to keep you from those things, so you should go do those things."}, {"time": 14818, "text": "So that's that's the source of the temporariness?"}, {"time": 14823, "text": "No, it's a bit related to like logistics and living one place and having like extremely different lifestyles."}, {"time": 14835, "text": "Is this a prince of some sort?"}, {"time": 14838, "text": "Does he have a castle?"}, {"time": 14845, "text": "Are you going to say who it is or we're going to keep that a mystery?"}, {"time": 14849, "text": "I don't on the one hand, like I feel like it's a it's protective for me to talk about it in some ways."}, {"time": 14856, "text": "But I also worry because very often I avoid saying anything because for a lot of reasons, but one being that people freak out and just assume that I'm going to step into something horrible again, because I did step into something horribly destructive again after Mr. Fox."}, {"time": 14875, "text": "And what happened was I allowed something to happen."}, {"time": 14875, "text": "And so going back to that, what advice would you give to people?"}, {"time": 14875, "text": "I would I would tell people to be very careful to be deliberate about who they're getting involved with and thoughtful about it and making sure that they're not just allowing something to happen."}, {"time": 14895, "text": "So it's like, you know, men can sometimes be and I suppose women can be as well."}, {"time": 14895, "text": "But people can be very persistent."}, {"time": 14895, "text": "Sometimes that's a good thing."}, {"time": 14906, "text": "But it could also be a dangerous thing because sometimes somebody might just and this has happened to me a lot where somebody just wears you down and you're like, oh, fine, you know?"}, {"time": 14918, "text": "And yeah, no, but it works."}, {"time": 14918, "text": "It's shockingly like the things that I've done in the spirit of like or not wanting to hurt somebody's feelings."}, {"time": 14918, "text": "That's another that's another dangerous to be nice."}, {"time": 14918, "text": "Let's get married just to be nice."}, {"time": 14918, "text": "That's another dangerous thing."}, {"time": 14931, "text": "And also maybe you should say I'm like circling back to all these unanswered questions from before."}, {"time": 14936, "text": "But I didn't marry."}, {"time": 14936, "text": "I married I married him."}, {"time": 14936, "text": "He like convinced me to marry him in this very quick, annoying way."}, {"time": 14936, "text": "And as if it was like something I had to do and I'd be protected and all kinds of weird reasons."}, {"time": 14950, "text": "And it was just like my response to my my agreeing to marry him was like, oh, fine."}, {"time": 14959, "text": "And then I remember being embarrassed at City Hall going to get the license."}, {"time": 14967, "text": "You know, people who are in love and wanting to get married aren't sitting in City Hall mortified and embarrassed, you know, so yeah, but so it was so I sort of cringe when people call him my ex husband because I don't think of him that way."}, {"time": 14979, "text": "It sort of is even though technically that's correct."}, {"time": 14979, "text": "Yeah, but there's a there's a powerful romantic notion to the thing and do those words and that that had nothing to do with you getting married."}, {"time": 14979, "text": "It was more."}, {"time": 14991, "text": "It was just like another thing that he made me do like a chore that just had, you know, unfortunate consequences of like then having to get divorced and the whole."}, {"time": 15001, "text": "Yeah, I think I think even weddings are romantic like the whole the cheesy thing."}, {"time": 15001, "text": "There's, you know."}, {"time": 15001, "text": "Yeah, they are."}, {"time": 15001, "text": "Those are cool."}, {"time": 15001, "text": "We don't get many, many of those in life."}, {"time": 15014, "text": "Well, you know what, let's keep it a mystery."}, {"time": 15014, "text": "Let's keep the person a mystery."}, {"time": 15021, "text": "To be continued on season two on conversations with some like a known person or anything, but I feel like people always worry that."}, {"time": 15032, "text": "I'm stepping back into something and I don't have the energy to be so should they be defensive and no."}, {"time": 15038, "text": "Don't worry friends."}, {"time": 15038, "text": "And also just."}, {"time": 15042, "text": "Remember that thing I was saying about how like it's good if you get to know somebody really slowly over a long period of time."}, {"time": 15042, "text": "Yeah, it's kind of one of those situations."}, {"time": 15042, "text": "So I feel very confident that I'm like certain that I'm not stepping into something where I'm going to be surprised and somebody turns out to be not who they presented themselves to be."}, {"time": 15059, "text": "So that's the wise way to do it."}, {"time": 15062, "text": "Especially for me."}, {"time": 15062, "text": "And also, again, it's like I would I would I would caution people to be careful about, you know, wanting to go into something deliberately versus kind of getting caught up in something and or rushed or."}, {"time": 15080, "text": "That said, I would I would suggest people take that cautionary advice, but sometimes you just fall in love."}, {"time": 15088, "text": "Love at first sight is the thing."}, {"time": 15088, "text": "There are those stories of, you know, sweet stories of older people that have been married forever."}, {"time": 15096, "text": "You can get hurt for it too, but don't don't listen to your heart."}, {"time": 15103, "text": "This was an incredible conversation."}, {"time": 15106, "text": "We talked for way over four hours."}, {"time": 15110, "text": "And I feel like I can keep talking to you."}, {"time": 15110, "text": "Summer, thank you so much for being honest, for for being fearless in answering all the questions, all the difficult questions."}]}]