[{"title": "Josh Barnett: Philosophy of Violence, Power, and the Martial Arts | Lex Fridman #165", "id": "YJWPowbCK_I", "quotes": [{"time": 403, "text": "And I gotta figure out what areas those are gonna be."}, {"time": 405, "text": "And so, you know, I thought, oh yeah, if I think of original sin actually can be, that can be kind of a clever idea, but it's also just accepting that we're all uniquely strange and unequal in our own ways, but we have to figure out how that fits in."}, {"time": 422, "text": "The word authenticity kind of connects to all of that."}, {"time": 425, "text": "So striving to be your authentic self means figuring out exactly the shape of the flaws, the character of your little demons that you get to play with and around them finding a path to whatever the hell ideal versions of yourself you can carve and pretending like that's such a thing as even possible."}, {"time": 445, "text": "The other idea about Nietzsche is on his idea of morality."}, {"time": 449, "text": "He presents the argument that morality is a human illusion and that there's not such a thing as good and evil, and these are all kind of constructs."}, {"time": 459, "text": "Do you think there's such a thing as good and evil that's connected to some objective reality?"}, {"time": 464, "text": "I think that there are some, I actually do believe that there are some universals."}, {"time": 469, "text": "I'm not Kantian in any way, but I do think that there are some universals."}, {"time": 473, "text": "And the thing that actually brought me to even the concept of that was Jung."}, {"time": 477, "text": "So Jung's concept of collective unconsciousness and then taking that thought and then applying it to looking through history and the most varied history you can find."}, {"time": 491, "text": "So I would say probably religion is your earliest one that you can get for written history or written examples of human behavior and psychology at the furthest that we can look into it from man's hand to whatever the medium is, cuneiform or whatever."}, {"time": 512, "text": "But as you do that, and then let's say going from Mesopotamia to India to Europe and just going from all these places, as disparate as they may seem, as many different cultures and ethnicities and religions and how the religions will vary quite a bit from monotheist to polytheist and so on and so forth."}, {"time": 533, "text": "But then just seeing how there's all the through lines."}, {"time": 535, "text": "And of course, Campbell, he did this much earlier than me thinking about it."}, {"time": 541, "text": "But I think that by looking at things that way and starting to find the threads instead of always just looking at everything as being its own compartmentalized concept as if it only applies to this time, this people, like getting overly pomo about it is just a really idiotic postmodern."}, {"time": 561, "text": "So you think that there is, just like with Joseph Campbell, there's a thread that connects all of these stories, narratives that we constructed for ourselves as we evolve."}, {"time": 570, "text": "And that thread is grounded in some kind of absolute ideas of maybe on the morality side, which is the trickiest one of good and evil."}, {"time": 579, "text": "Somewhat, yeah, I think that a lot of this stuff is just derived from a biological perspective."}, {"time": 584, "text": "I feel like these things are innate within us."}, {"time": 587, "text": "Do you think our innately humans are good?"}, {"time": 592, "text": "I feel like, I also feel like there's the issue of scale too."}, {"time": 596, "text": "Like Nassim Taleb likes to talk about how he views his, the way he interacts with groups in terms of scale."}, {"time": 605, "text": "What is this thing about like at the familial level, I'm a communist and then at the civic level, I'm a Republican or something."}, {"time": 614, "text": "And at this other level, and then it goes on at the widest level, he's a libertarian or something of that nature."}, {"time": 620, "text": "Like fundamentally human interaction changes."}, {"time": 622, "text": "On scale."}, {"time": 623, "text": "And scale and also from subjective to the environment around them."}, {"time": 629, "text": "So, and I don't even mean environment just in the sake of physical environment, nature, right?"}, {"time": 635, "text": "Like nature is constantly trying to murder you."}, {"time": 636, "text": "Well, it's not really trying."}, {"time": 637, "text": "It's just nature's being nature."}, {"time": 639, "text": "The universe is the universe."}, {"time": 641, "text": "And at times it takes you out."}, {"time": 643, "text": "It's just not with any particular compunction or prejudice."}, {"time": 649, "text": "It's just, oops, you know, sorry, there's no more dodos."}, {"time": 652, "text": "My bad."}, {"time": 653, "text": "But don't you think the particular flavor of the complexity that is the human mind was created, like let me make an argument for that all people are fundamentally good."}, {"time": 665, "text": "Is there's an evolutionary advantage to being, to striving to cooperate, to add more love to the world of like compassion, empathy, all that kind of stuff."}, {"time": 678, "text": "And that the very thing that created the human mind was this evolutionary advantage, whatever the forces behind this evolutionary advantage."}, {"time": 688, "text": "And scale, yes."}, {"time": 689, "text": "So when we're dealing with a small tribe, sure."}, {"time": 693, "text": "When you meet another tribe, maybe."}, {"time": 696, "text": "There's other factors that are going into that."}, {"time": 698, "text": "Let's say you scale up."}, {"time": 701, "text": "And so your 150 has exceeded their 150."}, {"time": 706, "text": "And like, you start to get to a certain point where you can't really be close enough to someone down the line of some of that next, like that 150 is 150, 150."}, {"time": 718, "text": "And they just now all of a sudden become some guy, whatever."}, {"time": 723, "text": "And when it comes to some guy, once it starts hitting scale, I don't know that it's capable."}, {"time": 732, "text": "People can be as magnanimous to a stranger as to the known."}, {"time": 776, "text": "But another way to frame that is maybe it's less about scale and more about the amount of resources available."}, {"time": 782, "text": "So if we're overflowing with resources in terms of security and safety, all the things you've mentioned, if we have more than enough resources, then the way we treat a stranger, the way we position ourselves towards that stranger might be in a way that allows us to be our real human selves as opposed to sort of our animal self."}, {"time": 807, "text": "And therefore it's mostly about how clever can we descendants of Abe's be in coming up with all cool kinds of technologies and ways to efficiently use the resources we have such that we're not constrained."}, {"time": 820, "text": "And my hope is that human innovation will outpace the growth of our, the number of people that are starving for resources."}, {"time": 832, "text": "Yes, I think that there's a lot of rationality behind this argument."}, {"time": 839, "text": "And in some ways I agree and in a lot of ways I see it as missing the point of how this experiment has been playing out across time."}, {"time": 853, "text": "When you look at what, for one, it's like define resources."}, {"time": 858, "text": "What is a resource of as humans would define it, right?"}, {"time": 865, "text": "Or wealth even."}, {"time": 866, "text": "And so you can say, well, an iPhone's a resource, the internet's a resource, water obviously is a resource."}, {"time": 874, "text": "But if we weigh them, what is more important to human beings, water, internet or iPhones?"}, {"time": 881, "text": "It's water, right?"}, {"time": 882, "text": "So if we look at resources, if we start with what do human beings need to live?"}, {"time": 888, "text": "I mean, actually live, not live here in this bullshit fantasy creation extension of our own ingenuity and a prison of our own creation and also a paradise of our own creation."}, {"time": 902, "text": "But this is not how human beings normally live."}, {"time": 904, "text": "This is all built upon stuff, it's built on concept, on idea and some of it's built on just, well, this is the paradigm so this is what you do."}, {"time": 958, "text": "That's fascinating to think of that as a basic resource, the knowledge to attain the very low level things of water."}, {"time": 964, "text": "Right, and we'll figure it out."}, {"time": 965, "text": "We did it once before and we've done it over and over and over and over again."}, {"time": 969, "text": "It's just costly."}, {"time": 971, "text": "Yes, it has costs for sure."}, {"time": 974, "text": "But when you think of how you look at the, well, we'll just deal with the first world of the West."}, {"time": 983, "text": "You look at the pathway of Western civilization and its growth and then you look at how technology injected into it over time, how it magnifies things or pushes things at orders of magnitude faster and then the internet comes along and even faster."}, {"time": 1003, "text": "So you're watching industrial revolution to, what is it, the capacitor and then so on."}, {"time": 1010, "text": "It goes further and further."}, {"time": 1011, "text": "And as the internet and technology, especially on the electronic side of things, start increasing in capability, it massively outpaces even our necessity for it at times."}, {"time": 1024, "text": "It becomes, you know, plant obsolescence happens quicker and over and over and over again and wealth increases, increases, increases, increases in terms of the things that we're able to acquire, right?"}, {"time": 1036, "text": "I mean, I've seen homeless people with smartphones, you know, so we're living in the most wealth laden, luxury laden age of all of humanity yet."}, {"time": 1049, "text": "What happens when we see calamity or people go on hard time?"}, {"time": 1053, "text": "What are the things that they value?"}, {"time": 1056, "text": "You know, what do people go to an argument about the cost of things that are luxury items generally and not necessity items?"}, {"time": 1064, "text": "You know, we get into fights about things that are at the end of the day, not necessities to us."}, {"time": 1073, "text": "You know, people are so concerned about Netflix and the internet and personally, I'm very concerned about the internet because I look at it as my own little personal library of Alexandria in my pocket."}, {"time": 1085, "text": "That's what I love about it."}, {"time": 1086, "text": "And the ability to have a tool as effective as it is, even though I'm in a constant battle to not let that tool become a vice or to become something that actually brings me to a lower state."}, {"time": 1099, "text": "But are we willing, the question is over the, are we willing to murder each other over Netflix versus murder each other over water?"}, {"time": 1107, "text": "We're willing to murder each other over water."}, {"time": 1109, "text": "That's a given."}, {"time": 1110, "text": "Right, but that's our animalistic selves."}, {"time": 1113, "text": "Well, it's also a necessity for, it's animalistic, but it's also either you do it or you don't, right?"}, {"time": 1118, "text": "Like unless somebody's willing to share that water or if that water is of such a limited capability or such a limited amount, then you will have to murder to have that water."}, {"time": 1130, "text": "Netflix, the argument is the higher, we get up to this hierarchy of what we consider in Los Angeles resources, we're less willing to be, to commit violence."}, {"time": 1142, "text": "We're less willing to commit violence, I would say over Netflix, but we are willing to commit violence over Netflix, over everything associated with Netflix, over televisions, over sneakers, over, you know, I mean, when we look at a good, I mean, the majority of the stuff that came with the riots, I mean, it was used car dealerships, targets."}, {"time": 1166, "text": "I mean, and then you look and it's like, well, okay, well, what are people, what do they gotta, what are they so hell bent to get out of this whole thing?"}, {"time": 1174, "text": "And I'm even talking about the ideological elements or anything like that."}, {"time": 1177, "text": "Just like, okay, something's going on, boom, looting, whatever, you know, what are you gonna loot?"}, {"time": 1182, "text": "You know, you'll have AOC say, oh, people needing bread."}, {"time": 1186, "text": "I didn't see a single loaf of bread."}, {"time": 1188, "text": "You know, I saw televisions and shoes and you know, but to me, it is poetry in a sense, because you get to see who we, how we actually are operating, you know, what is becoming first principles to most people."}, {"time": 1203, "text": "But wait, wait, but you could also argue though, those riots were more like the madness of crowds, which is definitely a lot more than just that."}, {"time": 1210, "text": "I'm just saying that given a chance, it's like, okay, boom, the lights are off, the grid is down."}, {"time": 1215, "text": "We've hacked into the whole system, turned into an 80s movie."}, {"time": 1219, "text": "And you have the ability to go get ahold of whatever it is that you think is most important."}, {"time": 1226, "text": "And what do we do?"}, {"time": 1227, "text": "And I say, we, as in, you know, including all of us, we grab a TV, we attack it."}, {"time": 1232, "text": "We break into a sneaker store in Melrose."}, {"time": 1235, "text": "We do, it's just like, ah, we still giant cause statues where the value of that is completely market driven."}, {"time": 1243, "text": "Like it's just a piece of polypropylene or whatever, butyl and you know, it's cool."}, {"time": 1248, "text": "I'm a big fan of art, but it's like, you know, I can't eat that."}, {"time": 1254, "text": "And at the end of the day, man, you're sitting there with your, like, what'd you do today, honey?"}, {"time": 1258, "text": "What'd you get?"}, {"time": 1259, "text": "You know, man, we were able to, you know, oh, I got this, I got this designer art statue."}, {"time": 1264, "text": "Are you going to go, well, you can't really sell it on the, on like the art markets where people were really going to pay for it."}, {"time": 1270, "text": "So are you going to become an underground art dealer with your one piece of cause art?"}, {"time": 1275, "text": "One interesting thing you just said before I forget it, you mentioned the library of Alexandria and your."}, {"time": 1281, "text": "Phone."}, {"time": 1282, "text": "Well, your phone, but also just thinking of your little world that you're creating for yourself on the internet."}, {"time": 1288, "text": "That's a really powerful way to actually phrase it."}, {"time": 1290, "text": "One of the things that you've been on Joe Rogan several times."}, {"time": 1294, "text": "Although everybody always comes to me and go, oh, that was so great."}, {"time": 1296, "text": "I didn't know you, you're on, you've on Joe Rogan."}, {"time": 1298, "text": "I go, this is like my fifth time, dude."}, {"time": 1300, "text": "I've been a fan of yours for a long time from other avenues."}, {"time": 1305, "text": "This is a long time coming actually."}, {"time": 1306, "text": "Everybody, you have no idea."}, {"time": 1308, "text": "Like how many times through messaging and missing each other over the years."}, {"time": 1314, "text": "This is ridiculous."}, {"time": 1314, "text": "This is a long time coming."}, {"time": 1316, "text": "You don't realize how special this is for us."}, {"time": 1318, "text": "This is, well, I'm also starstruck."}, {"time": 1320, "text": "We'll talk about this, but you symbolize something very important to me through my journey, through wrestling, through Jiu Jitsu, through Judo, through just street fighting, through just combat."}, {"time": 1331, "text": "There's a, you're the, in some sense, the devil on my shoulder of like, of violence."}, {"time": 1337, "text": "In a good, in a, devil gets a bad rap."}, {"time": 1342, "text": "He does get a bad rap."}, {"time": 1343, "text": "I realize, you know, sitting encased in ice down at that low ass level, you know."}, {"time": 1349, "text": "But, you know, the angel side is more like the athletic, the sport, the science, the technical, the chess side of things."}, {"time": 1356, "text": "So, but on the library, Alexander, let me ask, because you were on Joe Rogan, it does make me really sad."}, {"time": 1366, "text": "And I realize that I'm just probably being romantic that his, most of his library of interviews that were on YouTube have now been taken down because he went to Spotify."}, {"time": 1378, "text": "And that was the first, I'm probably an idiot, but it was the first time I realized that this knowledge that we've been building up on the internet doesn't necessarily last forever."}, {"time": 1388, "text": "No, it doesn't, unless you preserve it."}, {"time": 1390, "text": "I mean, it's like all things."}, {"time": 1391, "text": "If you do not preserve them, if you do not make efforts, you know, so many of my, it just really brings the minor off the top of my head."}, {"time": 1400, "text": "All my, so many friends of mine that are Jewish, you know, they're basically secular."}, {"time": 1407, "text": "But yet through even the secular aspect of just keeping the traditions alive, it's like, well, you could always pick a book and read about it."}, {"time": 1417, "text": "Clearly, it's called the Torah."}, {"time": 1419, "text": "But if you don't put these things into action, if you don't make them a part of your consciousness, maybe even on the subconsciousness, just through repetition, they will die."}, {"time": 1433, "text": "They will become simply something that exists somewhere until you find it again."}, {"time": 1438, "text": "And Carl Gotch used to say something, he would say that I don't invent moves, I just rediscover them."}, {"time": 1445, "text": "But yet Gotch and Billy Robinson also would understand that you, if someone's not carrying the torch, it'll go out."}, {"time": 1456, "text": "Now that doesn't mean fire can't be rekindled."}, {"time": 1458, "text": "It just means that it, that torch no longer is lighting the way on this knowledge."}, {"time": 1464, "text": "And so it's important to be an individual, even on an individual level, to be a repository for aspects of knowledge."}, {"time": 1475, "text": "You mentioned Gotch."}, {"time": 1477, "text": "You consider yourself a catch wrestler."}, {"time": 1484, "text": "So I've mentioned to you offline that I competed in a couple of catch wrestling tournaments."}, {"time": 1489, "text": "Can we go Wikipedia level at the very basic, you're the exactly right person to ask, what is catch wrestling?"}, {"time": 1496, "text": "And what are its defining principles?"}, {"time": 1498, "text": "I would say the easiest way for us to talk about and give an overview of what catch is in the simplest terms is think of collegiate wrestling with submissions."}, {"time": 1513, "text": "That is essentially what catch is."}, {"time": 1515, "text": "And it's not surprising because collegiate wrestling is actually derived from catch as catch can."}, {"time": 1521, "text": "It's just that over time certain aspects were removed from the competition structure so that they became null elements, things that were discarded."}, {"time": 1533, "text": "But it's funny that you can take a high level amateur collegiate types and you can show them a move and then add a little bit to it and go, oh, well, hey, that was just like what we already do here, but except, oh, I didn't know you could take it all the way to this point."}, {"time": 1550, "text": "Or things of that nature, especially when it comes to professional wrestling, teaching people like, no, I know you're just using this in a show, but this is actually a real move and here's how it really feels."}, {"time": 1562, "text": "And so collegiate wrestling and wrestling in general for people who are not aware is basically two people start on their feet and they have to score, they're trying to take each other down and they score points along the way."}, {"time": 1575, "text": "You can end matches by pinning them, for example, on their back."}, {"time": 1580, "text": "I think one way to describe wrestling is it's very much about figuring out ways to establish control and leverage in these kind of tie ups, or there's different styles where you can do more from a distance to where it's more about the timing and all that kind of stuff."}, {"time": 1599, "text": "Ultimately, it's an art of like both upper body and lower body and you could choose the different puzzles that you solve there."}, {"time": 1606, "text": "You could be attacking the head, the arms, you could be attacking the legs."}, {"time": 1611, "text": "There's also part of collegiate wrestling that's on the ground that has more, what's called like a referee's position or whatever."}, {"time": 1618, "text": "The referee's position where you're on your hands and knees basically."}, {"time": 1624, "text": "Do you understand what that's supposed to simulate?"}, {"time": 1626, "text": "Why is that one of the standard positions?"}, {"time": 1628, "text": "It's one of the standard positions because one, it's one of the easiest ways to actually get up, but two, it's because you cannot be on your back."}, {"time": 1635, "text": "If you're on your back, you're getting pinned."}, {"time": 1637, "text": "And back exposure or being pinned is pretty much the universal wrestling thing."}, {"time": 1646, "text": "One, taking the guy from their feet to the floor and two, pinning them."}, {"time": 1653, "text": "As you go from like, what is it?"}, {"time": 1657, "text": "Cornish wrestling, Turkish oil wrestling, Mongolian, Sumo, Indian, well, they'll call it Palwani."}, {"time": 1666, "text": "It's also called Kushti, Jiu Jitsu, Judo."}, {"time": 1672, "text": "So many of them is like, there's a, you sombo, even if it doesn't end the match, it's still like one of the most important aspects of the competition itself, across almost every style."}, {"time": 1685, "text": "And this is where submission, like catch wrestling or submission wrestling or Jiu Jitsu feels different, which it seems like for most wrestling, for a lot of wrestling, the dominance is the goal, as opposed to submission, which I guess those are two are related, but dominating the position."}, {"time": 1707, "text": "So that's what pinning is."}, {"time": 1708, "text": "It's almost like breaking your opponent, like breaking through all of their defenses to where they're completely defenses and you could do anything with them that you want."}, {"time": 1719, "text": "Maybe that's what could be a definition of dominance."}, {"time": 1722, "text": "I mean, it sounds very much like a chain to a radiator."}, {"time": 1728, "text": "Yeah, there's a threat that connects all runners, but submission feels different."}, {"time": 1735, "text": "It is actually different when you think about it across the landscape."}, {"time": 1738, "text": "I don't think radically different, but just still slightly different."}, {"time": 1741, "text": "And that if you think of wrestling as being derived from combat, right?"}, {"time": 1747, "text": "So, well, it is combat sports, but more lethal combat."}, {"time": 1751, "text": "Getting somebody off their feet and onto their back is about as lethal a place for the person on bottom to be in general."}, {"time": 1758, "text": "I mean, don't come at me with your talks about your fucking worm guards and blah, blah, blah, and whatever spider, bear, okay, get out of here with that."}, {"time": 1769, "text": "We're not talking about you in this highly regimented sporting environment."}, {"time": 1774, "text": "We're talking about general, all the body hair, none of the waxing human beings."}, {"time": 1779, "text": "So getting someone on their back, okay, as you're trying to get up, you're getting hit with a rock or stabbed or what have you set on fire, who knows?"}, {"time": 1792, "text": "Generally, these conflicts are not just isolated to one on one."}, {"time": 1797, "text": "If it's four on two, your buddy that was with you back to back, now he's on his back."}, {"time": 1804, "text": "And now it's gonna be one on one while three go on one."}, {"time": 1806, "text": "So, and then you elevate this to armored combat, right?"}, {"time": 1810, "text": "And it's boom, put them on the ground."}, {"time": 1812, "text": "Oh, crap, it's hard to get up."}, {"time": 1813, "text": "Well, while you're struggling to get up, stab."}, {"time": 1816, "text": "That's where jujitsu's concepts come from with all their leveraging and off balancing is, oh man, if I end up in this situation in tight close quarters combat, yes, we could fight it out with swords and knives and what have you, but it's way easier if the first thing I can do is foot sweep you on your back and then pull my knife and just go stick."}, {"time": 1836, "text": "Is there a thread that connects all of these different arts from not just arts, but from the very base violence of war, just like you said that there's no rules to the very regimented IBJF."}, {"time": 1853, "text": "Jiu Jitsu tournaments and just, you've kind of laid out some of it, but can you go all the way to the."}, {"time": 1857, "text": "So when you start off with absolute skills in the sense of absolute offense and defense in the taking or preserving of life, right?"}, {"time": 1867, "text": "Full on at its purest form of self defense and self preservation, okay?"}, {"time": 1875, "text": "And then you extrapolate part of that in that all animals train in violence."}, {"time": 1883, "text": "All play usually degenerates into some sort of soft violence."}, {"time": 1887, "text": "So be it cats when they're kittens and puppies and everything learns how to kill, how to fight."}, {"time": 1894, "text": "Not that, you know, just that dumb alpha meme stuff where the idea is that, oh, by being alpha, that means you run around like basically just being a bully and a shithead."}, {"time": 1905, "text": "No, actually alpha wolves spend very little time fighting because if you were actually alpha, you don't get into fights, there's no need to."}, {"time": 1915, "text": "And if you're probably getting into any large amount of fights, it's probably because you're being shitty at being an alpha and now people are tired of you being in charge."}, {"time": 1926, "text": "And yet in the animal world, and it would be the same for human beings at that base beginning level of violence, there's a big risk."}, {"time": 1937, "text": "So I know that we live in this place with healthcare or you might be in a place with nationalized health, whatever, right?"}, {"time": 1944, "text": "So there's band aids, there's penicillin, there's all that kind of stuff."}, {"time": 1952, "text": "But that's not the normal way of things, you know?"}, {"time": 1956, "text": "Yeah, there's a channel that just hurts me every time."}, {"time": 1960, "text": "I used to follow it and I had to unfollow it because it was too painful for me as a human being called Nature is Metal on Instagram."}, {"time": 1967, "text": "It was sobering and then it was like, this is too sobering."}, {"time": 1971, "text": "It's very sobering."}, {"time": 1972, "text": "So in there, the risk is at its highest level."}, {"time": 1976, "text": "The damage you take, the winner walks away hurt."}, {"time": 1982, "text": "Getting lamed when you need every aspect of your physical and athletic faculties to survive because this isn't the first and it's definitely not gonna be the last, especially if you're the slowest one."}, {"time": 1997, "text": "What is it, there's a lyric from a clutch song."}, {"time": 2003, "text": "Don't go for the fat ones, just go for the slow ones."}, {"time": 2006, "text": "Oh man, but that's the universal truth of the way nature works."}, {"time": 2013, "text": "You said it's not cruel, it's not cruel, it's just the way it is."}, {"time": 2016, "text": "Yeah, I mean, watch animals getting into fights on any of these sort of documentary stuff."}, {"time": 2021, "text": "You'll see an intense short and then dispersal."}, {"time": 2026, "text": "You'll see as soon as one feels like things have switched just enough to boom, the bear or whatever it is takes off."}, {"time": 2031, "text": "It's like, I'm done with this."}, {"time": 2033, "text": "Because if you can get out of there with just some scars and what have you, okay."}, {"time": 2038, "text": "You lose an eye, nah, it's not as good."}, {"time": 2041, "text": "You really get hurt bad and get infected, you're done."}, {"time": 2044, "text": "So there's a serious risk to be that can come with these sort of things."}, {"time": 2050, "text": "Yet, I believe that we are inherently born for at least aspects of and use of violence."}, {"time": 2059, "text": "And so at the end of the day, we need these things not just to, not just survive each other, but they're a part of being able to hunt and other things."}, {"time": 2071, "text": "So violence is a part of human nature."}, {"time": 2073, "text": "Violence is, it's an absolute."}, {"time": 2076, "text": "It is in every person, it is a part of every interaction, it is a part of every law, everything."}, {"time": 2081, "text": "And I'm not, by the way, I'm not an ANCAP."}, {"time": 2083, "text": "So don't even, don't hit your wagon to me on that one."}, {"time": 2087, "text": "ANCAP is anarchic capitalist."}, {"time": 2087, "text": "Anarchic capitalist, yes."}, {"time": 2090, "text": "Not an ANCAP."}, {"time": 2092, "text": "They have nice book shops."}, {"time": 2094, "text": "Yeah, they do."}, {"time": 2095, "text": "I mean, I'm not gonna sit here and shit talk ANCAPs."}, {"time": 2099, "text": "Although I also used to get into the conversations with an ANCOM, anarcho communist, a good friend of mine."}, {"time": 2106, "text": "And he would bring up this stuff and I'm like, yeah, cool, man, I'm down with anarchy."}, {"time": 2111, "text": "You ain't gonna like it."}, {"time": 2114, "text": "I go, cause I'm gonna take all, I'm gonna gather all kinds of people together."}, {"time": 2117, "text": "I'm gonna make this, I'm gonna get the strongest together and I'm going to take your shit."}, {"time": 2120, "text": "Okay, can I ask you on that topic, I have a friend of mine now, a fellow Russian, Ukrainian, Michael Malice."}, {"time": 2132, "text": "Oh, yeah, I'm familiar with Michael Malice."}, {"time": 2134, "text": "I watched a little bit of your guy's show."}, {"time": 2135, "text": "I watched a little bit of your guy's conversation."}, {"time": 2138, "text": "So this is really good to ask you because..."}, {"time": 2142, "text": "I like how he's in the white suit and you're in the white and black."}, {"time": 2146, "text": "But he lives in New York City."}, {"time": 2149, "text": "He espouses ideas of anarchism and his idea, and this is different than sort of the Ayn Rand set of ideas that there's a line between sort of capitalism that's backed by the state and just pure anarchism."}, {"time": 2166, "text": "And his idea that violence won't take over in an anarchism is one that feels to me not grounded in reality."}, {"time": 2178, "text": "I may be wrong."}, {"time": 2179, "text": "So is there some, so the idea with pure capitalism is that... You mean laissez faire, completely deregulated?"}, {"time": 2188, "text": "Yeah, well, what it will agree, it'll end up in one, it'll end up in, if you're anti globalist, it's gonna be that."}, {"time": 2195, "text": "It's gonna be globalist 100% because it has no..."}, {"time": 2200, "text": "Pure capitalism has no consideration for your native users or of any sort, like it doesn't matter."}, {"time": 2210, "text": "But the idea of governments is that the land, the little piece of land geographically you're born on means you're going to stick to whatever founding documents created that little land."}, {"time": 2221, "text": "So anarchism is against that."}, {"time": 2224, "text": "And the argument is you should be able to choose which ideas you live with."}, {"time": 2228, "text": "And the concern there is nobody, this geographical land, the governments that organize on that land do not need to protect you from the violence."}, {"time": 2241, "text": "And my sense is there does need to be an army, there does need to be police that help, however the form that police takes."}, {"time": 2249, "text": "But there needs to be a more centralized, not completely centralized, but more centralized safety net to protect you from the violence."}, {"time": 2259, "text": "Scale again, right?"}, {"time": 2260, "text": "So if you want to have your anarchist utopia, well, we won't call it utopia, your anarchist creation here."}, {"time": 2270, "text": "At certain scale, I'm sure it's doable."}, {"time": 2274, "text": "But as it scales, as the scale increases, it's completely untenable."}, {"time": 2280, "text": "And a state will emerge."}, {"time": 2282, "text": "A state will always emerge."}, {"time": 2283, "text": "Because even people always think of states as like people rubbing their hands and smoking cigars in back rooms and just out of nowhere coming around and just like, oh, we're going to create this big centralized thing and just so that we can tell everybody what to do and we can be in charge."}, {"time": 2297, "text": "I mean, I know that there are people like that that exist, that they would like to do things of that nature and that they see the use of power as something to be used more for their personal gains over first, which again, self interest in human beings."}, {"time": 2316, "text": "But eventually a state, people want, they want something to go like, okay, who's taking care of this?"}, {"time": 2325, "text": "And who's taking care of that?"}, {"time": 2326, "text": "And how do we create some sort of protocol for this?"}, {"time": 2333, "text": "Like, okay, well, when it's not Bob, when is it Susie, when is it whatever?"}, {"time": 2336, "text": "I mean, like, how do we, it's gotta get done if we want this thing to become bigger, if we want all of our plumbing to work right, if we want, it's just, I'm sorry, a state's gonna happen."}, {"time": 2346, "text": "A state is also, when you think about it, it's supposed to have consideration to tribe, right?"}, {"time": 2353, "text": "So if people think that we're not tribes, well, you're not really thinking very deeply."}, {"time": 2358, "text": "We're all tribes of a sort."}, {"time": 2360, "text": "And everybody likes to use the word tribalism in this idea of this antagonistic concept."}, {"time": 2368, "text": "And while sure, tribalism can be antagonistic, tribalism can also be a positive thing, or I could just say, it just seems to be a natural thing."}, {"time": 2376, "text": "People, they create their groups of one sort or another."}, {"time": 2380, "text": "And so when you have, well, when you think about when nation states really started to become a thing, and I don't mean even the more modern looking variants that we could think back up and say the 19th century or something like that, even older than that."}, {"time": 2397, "text": "I mean, you think the Assyrians didn't have a state of some sort?"}, {"time": 2400, "text": "Of course they did."}, {"time": 2402, "text": "How do you increase your empire if you don't actually have a place to start from?"}, {"time": 2407, "text": "Just to be a ruler."}, {"time": 2408, "text": "So you're saying like naturally, when you start talking and thinking about scale of humans, naturally states emerge."}, {"time": 2416, "text": "And so can we try to make an argument for anarchism, which is, so anarchy in a sense is an opposition to the unhelpful, unproductive, inefficient bureaucracies that eventually the states lead to."}, {"time": 2437, "text": "Yes, and that's what we can see."}, {"time": 2438, "text": "I mean, I would say less anarchy, more study James Burnham, you know, or, well, anybody that wants to talk about the managerial problem and the managerial."}, {"time": 2455, "text": "I see, so you have a sense, a hope, maybe let's think like what is the path forward with the inefficient state?"}, {"time": 2464, "text": "Is it revolution or is it to work within the system to constantly improve it, to manage better?"}, {"time": 2469, "text": "Man, I don't know that one."}, {"time": 2470, "text": "I mean, my general sense, and maybe this is the Nietzschean part of me, is that, yeah, it would take maybe not even just, maybe not even defining it specifically as revolution."}, {"time": 2482, "text": "Maybe it would just take just total calamity to get people to stop being shitty, to not stop being a lesser version of themselves, to stop thinking more about things from the paradigm that we exist in now, where we're giving so much value to stuff that isn't really all that valuable."}, {"time": 2501, "text": "Where we're so concerned about likes, and I don't just mean like whether we get them or not, but that, oh man, maybe we should take this off of our platform, because this is too destabilizing to people."}, {"time": 2513, "text": "Because once you exceed Dunbar's number, I think it's actually, without having the right faculties, which would need to be developed, because this is dealing with tech that brings things, ways of approaching being that we are not naturally programmed to be able to handle appropriately."}, {"time": 2538, "text": "And I think it's even more detrimental to women than men, because I think women have a more natural proclivity towards group association and more group oriented thinking and patterning."}, {"time": 2558, "text": "And now, and with also coupled with seemingly more sensitivity towards human states."}, {"time": 2569, "text": "So I feel like women, like the classic idea is like, oh, you know, women are psychic, you know, they have a sixth sense and what have you."}, {"time": 2575, "text": "And I think that's just a way of simplifying, what I think is that women may be more in tune with picking up on the unsaid."}, {"time": 2587, "text": "Like they might be better at seeing physical cues, inflection and tone, like different, like they may be far more sensitive to these things, which to me would make sense, because dealing with children that can't communicate."}, {"time": 2602, "text": "So distinctively, right now, okay."}, {"time": 2607, "text": "Now, whether it be a woman or a man, but especially with even the social push on this concept of empathy, which of course it gets to the point where it loses any meaning anymore."}, {"time": 2619, "text": "Like people use the word empathy absolutely incorrectly all the time."}, {"time": 2622, "text": "And they don't even understand what you're really asking of people."}, {"time": 2627, "text": "But let's just take it as we're using empathy in the correct sense."}, {"time": 2630, "text": "And you're taking on the emotional content of the thing itself."}, {"time": 2635, "text": "Now you open that up to thousands of people, maybe hundreds of thousands of people all across the world that you will never meet, that you will never know, that you're not even getting an actual true representation most of the time of who these people are."}, {"time": 2648, "text": "You're meeting persona."}, {"time": 2650, "text": "And some of these personas are even deliberately created to elicit a response inauthentically."}, {"time": 2660, "text": "Are you referring to bots or?"}, {"time": 2662, "text": "Could be bots or actual people."}, {"time": 2664, "text": "Bots are one thing, but I mean, there are literal people out there that will create something, create GoFundMes for tragedies that never didn't really, or events that didn't happen or any number of things."}, {"time": 2676, "text": "Okay, I mean, burn their own house down and then say, you know, we were attacked."}, {"time": 2680, "text": "And then it comes down, oh, you did it to yourself because you wanted money and empathy and this, that."}, {"time": 2685, "text": "And you wanted all this emotional wealth, let's say this emotional coin, as well as actual if possible."}, {"time": 2692, "text": "You wanted to leverage it in some way."}, {"time": 2695, "text": "That's not the majority of people, but I would say a good amount of folks are thinking, well, if I post this photo and I put this little blurb in there, I bet I can get this much cache out of it in this sense."}, {"time": 2710, "text": "And I'm not even, and this isn't just a reference to like butt pics and stuff like that."}, {"time": 2714, "text": "Because clearly, obviously people understand that our inborn sexual nature is easy to manipulate."}, {"time": 2723, "text": "I mean, that's pretty obvious."}, {"time": 2725, "text": "But you're saying this kind of new medium of communication on social media is unnatural."}, {"time": 2732, "text": "And it preys on us."}, {"time": 2733, "text": "And so as you want this, you know, you look at an anarchist kind of mindset, right?"}, {"time": 2741, "text": "And so you're just like, there's no, there is no overarching state to create any kind of a structure, right?"}, {"time": 2751, "text": "And so if you have that unfettered capitalism aspect with it, and before I say anything particularly damning about unfettered capitalism, I'm a massive capitalist because I view capitalism essentially as, what it boils down to is I get these arguments to people too."}, {"time": 2769, "text": "They start giving me all these extra definitions about capitalism like, no, no, this is obviously some sort of theory you're taking from other shit."}, {"time": 2776, "text": "But that doesn't describe capitalism."}, {"time": 2777, "text": "Capitalism is the ability for us to create whatever we want or, you know, create our thoughts, ideas, physical things and trade them freely amongst each other in ways that we find acceptable, right?"}, {"time": 2794, "text": "You know, I'm not even using the word fair because I might think it's fair to me."}, {"time": 2799, "text": "You might think, huh, well, I mean, that was actually, I think what he thought was unfair to him and it's more fair to me."}, {"time": 2804, "text": "And then someone, a third observer goes, oh man, you should not have paid that for that."}, {"time": 2809, "text": "You should have paid this."}, {"time": 2810, "text": "And it's like, well, you know what?"}, {"time": 2810, "text": "It works for me without..."}, {"time": 2812, "text": "Sufficiently acceptable that you both agree to the transaction."}, {"time": 2818, "text": "But also at the root of that is freedom, right?"}, {"time": 2821, "text": "And as far as I can tell, I've been banging this around in my head, it's like for every one unit of freedom, you need two units of accountability."}, {"time": 2832, "text": "And if you don't have that, what you end up with is human self interest."}, {"time": 2839, "text": "We're not even gonna get into evil."}, {"time": 2841, "text": "Human self interest, sabotaging other things, even not in a sense to be malicious."}, {"time": 2847, "text": "Okay, so in terms of, let's put this as mathematically speaking, I love this."}, {"time": 2852, "text": "So anarchism is more like two units of freedom and one unit of accountability or maybe zero units of accountability."}, {"time": 2858, "text": "Possibly, I mean, the anarchists tend to think like, no, everyone will be accountable."}, {"time": 2862, "text": "It's like, fuck they will."}, {"time": 2864, "text": "When have you seen this happen in real life?"}, {"time": 2866, "text": "People aren't even accountable in their revolutions at the time."}, {"time": 2869, "text": "So you aren't looking at the way people really are."}, {"time": 2876, "text": "Marx is like, yeah, the people are like this, they're like that."}, {"time": 2879, "text": "Look at how capitalism does it."}, {"time": 2880, "text": "I mean, he of course assigns a lot of really ridiculous economic principles and practice, but and also assumes that everybody who makes any profit from anything is somehow stealing it and really assigns a negative moral aspect to them."}, {"time": 2895, "text": "And then it's like, oh yeah, but then eventually communism will happen."}, {"time": 2899, "text": "No one will act that way anymore."}, {"time": 2900, "text": "And you're like, whoa, hold on."}, {"time": 2901, "text": "You just said that people are all, are you saying it's all due to capitalism or is it innate?"}, {"time": 2907, "text": "It's just, it's a fundamental misunderstanding of, and it's like, hey, look at you."}, {"time": 2915, "text": "You're like a notorious, like antisemitic, angry, like just absolute curmudgeon of a human being who seems to be really not all that fun to be around."}, {"time": 2926, "text": "Marx?"}, {"time": 2927, "text": "Yeah, and then it's just like."}, {"time": 2928, "text": "So you have to think like, if there was 1 billion Marx's in the world, how would they behave?"}, {"time": 2933, "text": "It would be absolute."}, {"time": 2936, "text": "They would hate each other so bad."}, {"time": 2938, "text": "And this isn't, for me to even poison them well on Marx is like, oh, his personality sucks."}, {"time": 2943, "text": "Like there's lots of people whose personality sucks."}, {"time": 2945, "text": "That doesn't mean they can't make, I don't know that it's never, what?"}, {"time": 2949, "text": "You know what, somebody argues."}, {"time": 2950, "text": "He's just a loner."}, {"time": 2952, "text": "I mean, I don't know that his personality sucked at all."}, {"time": 2954, "text": "Let me walk that back and that he was human."}, {"time": 2957, "text": "Say his personality sucked."}, {"time": 2959, "text": "He was sometimes contradictory, irrational."}, {"time": 2963, "text": "Sometimes he was quite sexist despite the emails I've gotten."}, {"time": 2969, "text": "That told me that there's people who has written to me that Nietzsche has been unfairly labeled as sexist in his discussion about women."}, {"time": 2983, "text": "I'm pretty sure there's a bunch of documents where he's just like, he's just a bitter guy."}, {"time": 2991, "text": "I will agree with you."}, {"time": 2992, "text": "And Marx is as bitter as they come to, but bitterness in and of itself doesn't make, like why I hate Marxism comes from the entirety of the thing."}, {"time": 3008, "text": "But I'm not going to say that Marxism or practic... Man, you can find any forbidden book and it could have something good in it."}, {"time": 3020, "text": "As colonel is a good idea."}, {"time": 3021, "text": "Yeah, and like at the end of the day, Marx is a human being."}, {"time": 3025, "text": "He's got a nice beard."}, {"time": 3026, "text": "He does, he had a hell of a beard."}, {"time": 3028, "text": "Yeah, a decent portrait."}, {"time": 3029, "text": "I mean, he looks like the kind of guy like, I wouldn't want to meet him in a dark alley, but thankfully I don't think he was much of a fighter."}, {"time": 3035, "text": "But in any case, I mean, not the anarchists or they're more hot for like Max Stirner."}, {"time": 3044, "text": "People like to think that Nietzsche borrowed a lot from Stirner and my argument is one, you don't have any real evidence for that and two, bullshit, you know?"}, {"time": 3054, "text": "I mean, anybody could, the fact that they have some overlapping thoughts doesn't make it lifted."}, {"time": 3063, "text": "Not to mention, go read a lot more philosophy and see how there's so many different things."}, {"time": 3068, "text": "Oh, this guy said it in 1722."}, {"time": 3072, "text": "Well, and then this guy says it again in 1922."}, {"time": 3075, "text": "Does that mean he read the other guy's stuff?"}, {"time": 3077, "text": "I mean, he's working from the same type of human physiological construct as anybody else."}, {"time": 3083, "text": "Like, of course it's possible that this guy could think the same thing."}, {"time": 3086, "text": "We think a lot of the same things, to be perfectly honest."}, {"time": 3089, "text": "I mean, reading the Hagakure, going back to philosophy books, this was really impactful on me as a younger adult because here's a book written in the 19th century about someone who lived through the 19th and 18th century at times as a samurai, now a monk, and his objections to society at the time, the same objections one was having to society as I was reading it."}, {"time": 3113, "text": "Like, the same human behaviors, the same impetus for action that he found a problem, like, well, that's the same shit now."}, {"time": 3127, "text": "Like, we're not, and this was the thing, and then I'm reading more religion, and I go, oh, we're no different than anyone who wrote the Torah or older."}, {"time": 3136, "text": "We are the same thing with the same problems, with the same psychological issues, the same human behaviors."}, {"time": 3142, "text": "Like, these things are not different, and we haven't changed."}, {"time": 3146, "text": "Growing set of tools, though, to kill each other with or to communicate together and all that kind of stuff, but underlying it, there's a human nature."}, {"time": 3153, "text": "Well, we're also trying to understand that human nature."}, {"time": 3155, "text": "I think we've, just like you said, learning how to fish, acquired more and more knowledge about that human nature, but it's been a very slow journey, slower than people realize in terms of understanding human nature."}, {"time": 3169, "text": "Let me ask, in terms of egoism, to be curious, to get your sense about Ayn Rand and her whole idea of virtue of selfishness and her, because you mentioned that everybody has a kernel of truth."}, {"time": 3186, "text": "There's potential for a kernel of truth to be discovered in anything."}, {"time": 3190, "text": "For example, I've been recently reading Mein Kampf."}, {"time": 3196, "text": "You know what, that's the thing."}, {"time": 3198, "text": "Even, there's something in, there's probably things in Mein Kampf that are not the surface level read."}, {"time": 3205, "text": "If you get all hung up on all, probably all his crap about his anger at Jews and this and that, all this crap, it's like, okay, yeah, that's right on the surface."}, {"time": 3217, "text": "Try to get below that."}, {"time": 3218, "text": "Try to see, how is he creating the Jews as a cope somehow?"}, {"time": 3241, "text": "For me, the starting point, similar with Ayn Rand, is that Mein Kampf is not a good place to search, not just because Hitler is evil, but it's just not full of ideas."}, {"time": 3251, "text": "No, it is not."}, {"time": 3253, "text": "It has its significance due to a lot of things."}, {"time": 3256, "text": "Historically speaking."}, {"time": 3257, "text": "The starting point for me with Hitler is to acknowledge that he is human and to at least consider the possibility that any one of us could have been Hitler."}, {"time": 3268, "text": "So like, not to make it."}, {"time": 3269, "text": "Well, that's a Peterson kind of concept."}, {"time": 3271, "text": "Also, Jonathan Haidt has a thing about the difference between hate and disgust mechanisms and things like that, and so he goes into the, looking at Hitler through his diary entries and journals and stuff like that to look and see it more as the disgust mechanism than also trying to see if there's any evolutionary biological attachment to this, whatever."}, {"time": 3296, "text": "I mean, you're right, he is a human being."}, {"time": 3299, "text": "Any of us, we're all human beings."}, {"time": 3302, "text": "It's not that, it's probably jarring for people to think, but we're all, I guess, supposedly potentially capable of just being in, and all these evil people in the world think they're doing it for the sake of good, which makes them the most dangerous."}, {"time": 3322, "text": "And there's some, there's differences in levels of insane."}, {"time": 3326, "text": "I think Hitler was way more insane than Stalin."}, {"time": 3329, "text": "I think Stalin legitimately thought he was doing good."}, {"time": 3333, "text": "I would say that's probably true."}, {"time": 3336, "text": "Stalin was just outright brutal."}, {"time": 3340, "text": "Like he had his five year plan, he had all those other things."}, {"time": 3344, "text": "He just had a much lower value for human life, and so he was willing to take, make decisions about what he actually, as a good executive, which he was, of managing different bureaucracies and so on, he was willing to make decisions that resulted in mass human suffering, where Hitler was, it seems like to me, much moodier."}, {"time": 3369, "text": "So allowed emotions and moods to make decisions."}, {"time": 3372, "text": "I think we also have to consider the different trajectories and how, where, and when they were making their decisions."}, {"time": 3379, "text": "And I mean, not by time specifically, but Hitler engaged into this conflict across multiple continents."}, {"time": 3387, "text": "And then that, everything that comes with basically fighting the whole world, Stalin had his conflict, and then he really mostly compartmentalized the rest of it."}, {"time": 3401, "text": "So he was dealing with his own internal instead of dealing with the internal and the external."}, {"time": 3406, "text": "So if Stalin was put under a World War scenario, I don't know, maybe he would have eventually lost his marbles too."}, {"time": 3411, "text": "Yeah, I'm not sure that that's, you're right."}, {"time": 3414, "text": "The hunger for power was more internalized for Stalin."}, {"time": 3418, "text": "He wanted to control the land that already existed as opposed to wanting to colonize other land."}, {"time": 3422, "text": "He was as nationalistic as Hitler, but, and was as capable and willing for violent conflict as Hitler, for the aims of the state."}, {"time": 3437, "text": "But he centered and internalized prior to then externalizing and moving outwards."}, {"time": 3446, "text": "Whereas even maybe prior to him, there was an interest to continually push communism in an aggressive sense following on the momentum from the 1918 revolution."}, {"time": 3457, "text": "And that, the halting of that through various aspects, I guess in Germany, part of that was the National Socialists."}, {"time": 3467, "text": "Like they came up and then they were the other ones to fight the communists, and so you had the two totalitarians going after it."}, {"time": 3474, "text": "But then in the rest of the world that was not dealing with totalitarian aspects, it was just, it wasn't gonna stick, especially in the West and other places."}, {"time": 3484, "text": "But Stalin, just casually thinking, it seemed like Stalin decided to go, all right, well, we're not gonna go just start launching right into more conflicts here."}, {"time": 3494, "text": "We're gonna, these dudes are going down, so that's cool for us, because they hate us and we hate them."}, {"time": 3502, "text": "But now we're gonna focus internally, and then we're gonna work on growing at a slower rate and picking our battles a bit more specifically."}, {"time": 3510, "text": "And of course there's, you can get to the, even this is after Stalin, but you got the Bezmenov type stuff talking about subversion in cultural aspects."}, {"time": 3520, "text": "Yeah, I mean, there's this fascinating dynamics to propaganda throughout the whole period that's."}, {"time": 3525, "text": "Yeah, it's a whole nother kernel, yeah."}, {"time": 3529, "text": "One of the things that's kind of fascinating to look at is how many nations, both journalists and nations, wanted, almost craved to take Hitler at his word that he wanted peace until it was too late."}, {"time": 3544, "text": "They almost wanted to delude themselves."}, {"time": 3548, "text": "I mean, the same is true with the Stalin, people wanted to take Stalin at his word for."}, {"time": 3553, "text": "Oh, they still delude themselves."}, {"time": 3555, "text": "We will delude ourselves over any number of things until even after the fact where the history just says, hey, fuck face, you know?"}, {"time": 3564, "text": "You cannot supplement your pseudo reality onto actual reality here."}, {"time": 3570, "text": "But yet, we deal with people in pseudo realities constantly."}, {"time": 3574, "text": "I mean, we will always find a way to change reality to suit our needs."}, {"time": 3579, "text": "Well, the nature of truth now, there's now multiple actual truths."}, {"time": 3583, "text": "There's multiple versions of history that people are telling."}, {"time": 3587, "text": "You know, the version of the Great Patriotic War in Russia, the World War II in Russia is very different today under Putin than the version that we're learning in the United States and then different than the version in Europe."}, {"time": 3602, "text": "In the United States, the hero of the war is the United States."}, {"time": 3607, "text": "In Europe, there's a much more sad and solemn story of suffering and so on."}, {"time": 3613, "text": "In Russia, it's the Great."}, {"time": 3615, "text": "Patriotic War."}, {"time": 3617, "text": "It was a unifier of a sense."}, {"time": 3619, "text": "And it, I mean, yeah, I mean, you can't argue that war and conflict that, and or just even reducing that to stressors, agitation, suffering doesn't create human motivation."}, {"time": 3636, "text": "You know, we started this off."}, {"time": 3637, "text": "You brought up a Frankel."}, {"time": 3638, "text": "I'm like, yeah, Frankel's dope."}, {"time": 3640, "text": "Man, it serves for meaning."}, {"time": 3641, "text": "Maslow's great."}, {"time": 3643, "text": "And I talked to you about how I started to think like, man, do the ability for human beings to live and or potentially flourish in the worst environments you can think of is pretty incredible in and of itself."}, {"time": 3659, "text": "And that it's a crazy thought to think that without Frankel and Maslow ending up in concentration camps, do they write some of the most important books on philosophy in the 20th century?"}, {"time": 3676, "text": "And that's insane on a lot of different levels."}, {"time": 3680, "text": "But, yeah, suffering is a creative force."}, {"time": 3682, "text": "I mean, I don't, do you think we'll always have war?"}, {"time": 3685, "text": "Yes, we will always have war in some form or another."}, {"time": 3688, "text": "We need, quote unquote, air quotes, for those just listening, war to survive."}, {"time": 3696, "text": "We need war to flourish."}, {"time": 3697, "text": "We need at least."}, {"time": 3698, "text": "Can you explain the quote, the air quotes around the war?"}, {"time": 3700, "text": "Well, because take, take, take, take the."}, {"time": 3705, "text": "You see wars as violence?"}, {"time": 3706, "text": "No, wars are not violence."}, {"time": 3707, "text": "So like, so when we're talking."}, {"time": 3708, "text": "No, air quotes because while us getting on the mat or just getting on these hardwood floors and wrestling around is not literal war, it's war of a sorts."}, {"time": 3719, "text": "It is a diluted form of war."}, {"time": 3721, "text": "American football is a diluted form of war."}, {"time": 3723, "text": "All this, these are diluted forms of war."}, {"time": 3725, "text": "Tennis is a diluted form of war."}, {"time": 3729, "text": "And I think one of the best explanations I ever got from this, and another person very impactful on my life and outlook and thinking about things, Cormac McCarthy."}, {"time": 3740, "text": "And so in Blood Meridian, there's this fantastic speech about war given by the judge, which there's a ton of fantastic speeches on things given by the judge, yeah."}, {"time": 3751, "text": "All that exists in creation without my knowledge does so without my consent."}, {"time": 3754, "text": "Okay, that's pretty heavy."}, {"time": 3756, "text": "That's, that's hard."}, {"time": 3758, "text": "Go ahead, can you break that up?"}, {"time": 3760, "text": "All things that exist in creation, all things that exist without my knowledge do so without my consent."}, {"time": 3770, "text": "Well, I think from the judge's perspective, it's like, well, I didn't consent to that bird or that dog or this building or all this, like all of this, you know, I didn't create it, so it's done so without my consent."}, {"time": 3783, "text": "And if it's up to my consent, well, I'll design it how I want to."}, {"time": 3788, "text": "There's another similar look into how the judge is in that book is he would study everything everywhere he went."}, {"time": 3797, "text": "And so he's collected this group of nary do wells from all over to go on these hunts against certain tribes in the Southwest and getting paid by the US government, the Mexican government."}, {"time": 3812, "text": "So he's on these Indian hunts and yet they're going to all these different places and they would stay the night in a cave somewhere and he would find cave paintings, he would write them all down, or he would find old pieces."}, {"time": 3827, "text": "There's an example of him, the narrator, explaining how watching the judge and how he drawing, I mean, he's got this notebook just full of things, drawings and writings, and how he found like a piece of armor from a conquistador or something way back in the day, Spanish armor, and he draws it into his book and then crushes it."}, {"time": 3847, "text": "And so the reason we'll always have war in this society is because there's this struggle amongst people that want to be the designers."}, {"time": 3858, "text": "There's that, but I'm just saying that he's got this whole quote on war, like war is play, war is a game, and the difference is is that what's at stake."}, {"time": 3870, "text": "So all things are a game of some sort and you're putting up for it or what you're willing to put up for it determines whether or not you're going to participate or not."}, {"time": 3880, "text": "And all aspects of any game is war and it's just, what is at stake?"}, {"time": 3888, "text": "If it's your life, it's a different story."}, {"time": 3889, "text": "If it's just a coin, it's another thing."}, {"time": 3892, "text": "A nice way to put it is if humans play a game in this kind of pursuit of creating, whatever the hell the reason is that we keep creating cooler and cooler things, it seems to be the result of a game that we naturally play, we naturally crave."}, {"time": 3911, "text": "I don't know, I mean, that's been the struggle of philosophy is to understand what is the underlying force of all that."}, {"time": 3917, "text": "Is it the will to power?"}, {"time": 3919, "text": "I think will to power is a really great way of describing it."}, {"time": 3923, "text": "Do you want to be the winner of the game?"}, {"time": 3925, "text": "No, not just, no, I don't look at will to power as being the winner of the game."}, {"time": 3929, "text": "Well, I mean, if we're going to get philosophical, yes, you want to be the winner of the game."}, {"time": 3933, "text": "What does winning the game define how you win?"}, {"time": 3936, "text": "Everybody's going to define that win differently."}, {"time": 3938, "text": "You could define the win in the most base level like, oh, I got all the things."}, {"time": 3944, "text": "Well, if you got all those things without the needing component of fulfillment, then you're going to be a very unhappy person with a whole lot of things."}, {"time": 3951, "text": "But there's a self referential aspect to where, to me, the winner of the game is defined by the people playing the game."}, {"time": 3958, "text": "So if I'm playing a game, I want to win in the sense that most of the other people who are playing the game will say, yeah, that guy won."}, {"time": 3968, "text": "By our collective definition, if I just come up, listen, I'm sort of, if I come up with my own."}, {"time": 3974, "text": "That's a lot of weight on the external on you."}, {"time": 3977, "text": "Right, but that's how games seem to work."}, {"time": 3981, "text": "Somewhat."}, {"time": 3981, "text": "So I'm already a winner in my life by defining my own definition of success."}, {"time": 3986, "text": "I'm basically the best person in the world at doing me."}, {"time": 3992, "text": "At being Lex."}, {"time": 3992, "text": "Yeah, so like, and I'm really happy with that."}, {"time": 3995, "text": "That's a source of happiness."}, {"time": 3997, "text": "Well, I mean, think about it."}, {"time": 3998, "text": "Games are also iterated, right?"}, {"time": 4000, "text": "So you start off with your game and then your game with your immediates and then the game further than that and the game further than that and then the game today and the game tomorrow and the game next week."}, {"time": 4010, "text": "And so it never ends."}, {"time": 4012, "text": "And if you try to keep thinking about it that way, no wonder people go crazy."}, {"time": 4016, "text": "But we don't want to think about things that way."}, {"time": 4019, "text": "We don't want to think about being towards death."}, {"time": 4021, "text": "We don't want to think about whether or not I'm going anywhere after this other than in the ground or what have you."}, {"time": 4028, "text": "Like, you know."}, {"time": 4029, "text": "All of these games are a sense of some distraction."}, {"time": 4032, "text": "This is where we brought up."}, {"time": 4032, "text": "Kind of, but I mean, it's violence is that we need to let this out."}, {"time": 4038, "text": "And so it is of our, kids need to wrestle and play just like animals need to wrestle and play."}, {"time": 4045, "text": "We need to have forms of competition."}, {"time": 4047, "text": "We need to have ways to test ourselves, to create when, what is it?"}, {"time": 4054, "text": "When at peace a man of war makes war with himself."}, {"time": 4056, "text": "And so we need to be able to competently go at war with ourselves and go at war with our neighbor and go at war with our neighbor's neighbor in a way that is repeatable at the very least."}, {"time": 4067, "text": "So one way of saying that there will always be war, I mean, that's my hopeful view is that most of the war conducted in the future will be, like you said, the man must go to war with himself."}, {"time": 4081, "text": "That's what to me love is, is like focusing on yourself and your own improvement and your own creativity and towards others feeling, sort of emphasizing cooperative behavior and compassion and empathy."}, {"time": 4100, "text": "But I mean, you can have, well, I'll put it to you this way."}, {"time": 4103, "text": "If you have a whole community of Randians and a whole community of Ancoms, and they could all like, I don't know, toast of London on Netflix, and they love Netflix and they love the internet and they love picking apart Mon Comp with you."}, {"time": 4126, "text": "They love like, they like all these things, even the esoteric that they can get on with."}, {"time": 4132, "text": "But at the fundamental root, they cannot help but go to war because they are literally oil and water."}, {"time": 4139, "text": "No, but see, but they would, the very labels they assign to themselves would need to dissipate."}, {"time": 4147, "text": "Well, this is true."}, {"time": 4148, "text": "Well, then you would have to stop being whatever it is that you took on as your ideological or religious point, right?"}, {"time": 4154, "text": "Yeah, I mean, there's some days I'm Ancom, some days I'm Ancaps and whatever the anarchic capital."}, {"time": 4164, "text": "I mean, it depends on the hour, the minute of the day, you constantly changing moods and embracing that flow, the change of opinions, of ideas."}, {"time": 4174, "text": "As there's some days like, I'm actually cognizant of the fact because I've been not getting my sleep."}, {"time": 4179, "text": "And after I get some sleep, I see I'm so much more optimistic about the world."}, {"time": 4184, "text": "The less and less sleep I get, the more sad and cynical I get."}, {"time": 4188, "text": "I can see that."}, {"time": 4188, "text": "There's an up and down constantly."}, {"time": 4190, "text": "I don't even let my, well, okay."}, {"time": 4192, "text": "I try not to let."}, {"time": 4194, "text": "And most days it's never a problem."}, {"time": 4196, "text": "Any sort of like, what the kids call it now, blackpilled way of thinking, be my over, the umbrella which I hang under."}, {"time": 4207, "text": "So we actually, to drag us back, can we talk about Carl Gotch and Cat Tressley?"}, {"time": 4214, "text": "Because I do want to make sure I touch it."}, {"time": 4218, "text": "I mean, what, who were?"}, {"time": 4220, "text": "Carl Gotch is."}, {"time": 4222, "text": "Is he the greatest catch wrestler?"}, {"time": 4223, "text": "I don't know if he was the greatest catch wrestler ever."}, {"time": 4226, "text": "I don't, I mean, he's one of them for a myriad of, Carl Gotch, Billy Robinson."}, {"time": 4235, "text": "Gotch and Robinson's trainer, Billy Riley."}, {"time": 4240, "text": "So who are these figures and what did they bring to you?"}, {"time": 4241, "text": "Joe Maeda, he's one of the greatest catch wrestlers ever because he's responsible for Brazilian Jiu Jitsu."}, {"time": 4247, "text": "Along with Cristal Gracie."}, {"time": 4248, "text": "Okay, there's so much of things I'd like to say here, but one of the things that catch wrestling seemed to espouse as a principle is that of violence."}, {"time": 4257, "text": "I just, the tournaments I competed at, the unfortunate thing, and we'll probably hopefully talk about it a little bit."}, {"time": 4266, "text": "They were disorganized and the level of competition was pretty low where people really sucked."}, {"time": 4271, "text": "Pretty typical."}, {"time": 4272, "text": "Is that typical, okay."}, {"time": 4273, "text": "Well, it's, I mean, think about local run of the mill Jiu Jitsu tournament versus IBJJF created, you know, a vast difference, so."}, {"time": 4284, "text": "So I, you know, but there is, to me as a human being, like intellectually, philosophically, it was more interesting to go to catch wrestling tournament."}, {"time": 4294, "text": "It seemed more real and honest because of the way they communicate about violence and aggression."}, {"time": 4300, "text": "So it is often more honest."}, {"time": 4304, "text": "I think that as."}, {"time": 4304, "text": "Who is that from?"}, {"time": 4305, "text": "Does that originate from, gosh, is that really Rob said?"}, {"time": 4308, "text": "Well, I mean, it originates from all wrestling in that even Wade Chalice, not a classically considered catch wrestler, yet the reason why he has the world record for most amount of world champions pinned or the record for pins in the NCAA is because, well, of course the idea is to put you on your back and pin you, but there's no way you're gonna let me do that."}, {"time": 4335, "text": "So how do I make it so that you want me to pin you?"}, {"time": 4340, "text": "Well, it's by you put them in excruciating pain."}, {"time": 4342, "text": "So at the end of the day, you're both there."}, {"time": 4347, "text": "You both wanna win."}, {"time": 4348, "text": "Neither one wants to allow anything to the other."}, {"time": 4351, "text": "So how do I get you to lose to me?"}, {"time": 4356, "text": "Well, I make it so unbearable for you that you decide losing is better than staying."}, {"time": 4360, "text": "So those two are so fascinating because so coming from Russia, I don't know if that's where I got it or if it's just my own predisposition is I always loved the, there's two ways to get you to want to pin yourself."}, {"time": 4375, "text": "One is to making it so painful not to pin yourself that you pin yourself or whatever."}, {"time": 4380, "text": "And the other is, it's sort of like a Bruce Lee, water flows, make it so easy to pin yourself."}, {"time": 4387, "text": "So it's technique, it's like the elegance, the ease of movement."}, {"time": 4391, "text": "This is the Satya brothers, Vasya, Satya, like the, just the elegance, the efficiency."}, {"time": 4399, "text": "Yeah, they're practically like ballet watching those guys."}, {"time": 4400, "text": "You know, it's incredible."}, {"time": 4401, "text": "Satya brothers are massive."}, {"time": 4403, "text": "And I'll also caveat a little bit that like, if you're approaching this from a Russian perspective, Russians are quite truthful about things, especially when it comes to something like combat."}, {"time": 4418, "text": "They just, this is how it is."}, {"time": 4420, "text": "And this is how it's going to be."}, {"time": 4422, "text": "It's honest."}, {"time": 4423, "text": "And honesty is what I really like about catch wrestling because I find that we, given any opportunity for us to be dishonest for any number of reasons, we're gonna, especially if it's a dishonesty towards a positive, right?"}, {"time": 4437, "text": "Like, oh, well, you know, it's all technique and it's all this and it's the gentle art and blah."}, {"time": 4442, "text": "Bro, I have rolled with ADCC world champions, you know, some of the best you have ever heard of."}, {"time": 4449, "text": "There ain't a lot of gentleness when it comes to like, oh yeah, they wanted to sweep you and you said no."}, {"time": 4455, "text": "And then you did, said no again."}, {"time": 4457, "text": "And then you said no and attacked their leg."}, {"time": 4460, "text": "It ceases to be all that gentle because at the end of the day, these dudes are strong as hell."}, {"time": 4465, "text": "They're flexible."}, {"time": 4465, "text": "They're all, I mean, they're, the difference between the athleticism and the ability to actually win is a pretty wide gap."}, {"time": 4475, "text": "The athleticism shows up, but then there's all that other extra and part of that is meanness and pain and getting what you need out of it."}, {"time": 4485, "text": "But see, there is a philosophical difference in the way it's thought because."}, {"time": 4490, "text": "I think some of it is just, they just in denial."}, {"time": 4493, "text": "Like, oh, people will, they like to, people like to espouse a lot of things as theory and then it's like, okay, let me watch."}, {"time": 4499, "text": "When they're, oh, you're not doing anything about what you said right now."}, {"time": 4502, "text": "In fact, you're doing the opposite."}, {"time": 4503, "text": "You're literally hurting that guy because your shit ain't working in the way that you'd like it to."}, {"time": 4510, "text": "So you're having to use strength."}, {"time": 4512, "text": "You're having to, it's one of my favorites, like, oh, you're using too much strength."}, {"time": 4514, "text": "And it's like, well, hold on."}, {"time": 4516, "text": "Do we want people not to use strength at this point to understand more of mechanics?"}, {"time": 4521, "text": "Or are you trying to tell people if they use strength at all, that they're somehow bad at what they do?"}, {"time": 4526, "text": "Cause you know, it's not my fault."}, {"time": 4528, "text": "You're not stronger than me."}, {"time": 4529, "text": "But see, I'm speaking to something else that's, that's."}, {"time": 4532, "text": "Well, I tend to think what it comes down to is like, strength is fine until you beat me with it."}, {"time": 4537, "text": "Then it sucks."}, {"time": 4538, "text": "Okay, so strength is another thing."}, {"time": 4541, "text": "I'm speaking, I'm thinking about more like anger."}, {"time": 4545, "text": "Okay, so like."}, {"time": 4546, "text": "I've seen a lot of angry guys in jiu jitsu, I know that."}, {"time": 4550, "text": "Okay, okay, good, well, but let's talk about, let's talk about the highest level of competitions."}, {"time": 4555, "text": "There's a book called Wrestling Tough."}, {"time": 4557, "text": "It's a really good book."}, {"time": 4558, "text": "There's, I've encountered in my life a few, especially in wrestling, people who really try to find a way to use anger, to get really angry at their opponent."}, {"time": 4570, "text": "Not like stupid anger, but just like."}, {"time": 4572, "text": "Intense, pointed anger distilled into something that you can use as fuel."}, {"time": 4580, "text": "And like, I remember this story."}, {"time": 4582, "text": "I don't know where I read it."}, {"time": 4583, "text": "Might be Wrestling Tough, where a person was imagining that their opponent just raped their mother, raped their girlfriend or something like that, to create this like method acting thing in their head to be like, to snap them out of this polite interaction of usual like athletic convention and like."}, {"time": 4603, "text": "You know, that's a design of necessity."}, {"time": 4606, "text": "So my anecdote for this was, I was sitting with backstage before a fight, not my fight."}, {"time": 4615, "text": "And I'm working with this guy and this dude is, this is a world champion guy."}, {"time": 4620, "text": "And he's competed at the highest levels."}, {"time": 4623, "text": "And he looks at me and he goes, you know, do you ever get nervous before fights?"}, {"time": 4631, "text": "And I looked at him and I went, no, I don't."}, {"time": 4634, "text": "And he just looks at me and he's like, fuck man, I'm so nervous."}, {"time": 4637, "text": "You know, how do you do it, man?"}, {"time": 4638, "text": "Or, you know, I wish it could be like you."}, {"time": 4639, "text": "And I said, you know what?"}, {"time": 4641, "text": "That doesn't mean that what I'm doing is better."}, {"time": 4644, "text": "It's just what is necessary for me."}, {"time": 4646, "text": "It's the way I am."}, {"time": 4647, "text": "And I told him, so this anecdote goes into another anecdote."}, {"time": 4651, "text": "This is a Family Guy episode, I guess."}, {"time": 4653, "text": "So, where some, another famous high level guy told me about this experience with a world champion boxer in Japan."}, {"time": 4665, "text": "And this guy would get insanely nervous and worked up and anxious before his matches."}, {"time": 4671, "text": "And he hated it and hated it and hated it."}, {"time": 4673, "text": "And so he wanted to get rid of that feeling."}, {"time": 4676, "text": "So he went to a hypnotist for a bunch of sessions and managed to, and he goes in and next fight, he's cool as a cucumber and doesn't perform and loses."}, {"time": 4686, "text": "And so what I said, going back to anecdote one, was, you know, whatever is necessary for you to get yourself in the best state of being right now to compete, whatever that may be, it could be absolute stress and fear, it could be anger, it could be calmness, it could be whatever."}, {"time": 4706, "text": "But there is a, but there is a state at which you need to be in to do your best."}, {"time": 4714, "text": "And you as the individual, you have to find that."}, {"time": 4716, "text": "Can you comment on Tyson, Mike Tyson?"}, {"time": 4720, "text": "Oh, yeah, that thing."}, {"time": 4722, "text": "So first, so he, there's two things I wanna, so he's a, in terms of fear, there's a clip there, I think from a documentary where he talks about he is like fully afraid as he walks up to the ring and as he gets closer and closer and closer, he gets more confident until he gets in and then he's a god or something like that."}, {"time": 4740, "text": "That coupled with his statement on Joe Rogan that he gets aroused at the possibility of true, like of hurting somebody in the ring."}, {"time": 4752, "text": "So like he gets aroused at the violence."}, {"time": 4756, "text": "I like it because it's coupled to your basically statement that we need to own, to find our own unique way of existing at our top level of performance."}, {"time": 4768, "text": "And that perhaps is Mike Tyson."}, {"time": 4770, "text": "But do you think there's something more deeply universal to the Mike Tyson speaking to the fact that he's aroused at the possibility of violence?"}, {"time": 4777, "text": "Yeah, I do actually."}, {"time": 4778, "text": "Although I don't think that it always equates to arousal for people, in fact, I would say in general, it doesn't."}, {"time": 4785, "text": "I can say I've never had a boner in the ring."}, {"time": 4787, "text": "In fact, if anything, old combat cock is like, we're not hanging around, we're leaving, we're going up."}, {"time": 4792, "text": "We're taking off, we don't want anything to do with this."}, {"time": 4795, "text": "You have fun, come back to us when you have something warmer, softer, smells better."}, {"time": 4800, "text": "But the power, the feeling of aliveness, yeah, I could see it."}, {"time": 4807, "text": "Back to even the concept of the Ubermensch, I feel like the states, the highest states of being I've ever been in were in the midst of conflict."}, {"time": 4815, "text": "I felt like that was the times, those are the moments in my life where I felt like I was at the highest level of being as a human in existence."}, {"time": 4825, "text": "But yet, even being in that state was not, it was not something that you could interact with people that weren't in that state with you."}, {"time": 4833, "text": "They wouldn't get it, you would almost seem, and to be that way all the time, either A, might drive you mad, or B, is you're not, you're something that's untenable to the rest of society."}, {"time": 4843, "text": "You can't function with everybody else."}, {"time": 4845, "text": "It will not work."}, {"time": 4846, "text": "It's just like you said with the Ubermensch, it's like it's perhaps that ideal is not something you can hold for long."}, {"time": 4852, "text": "That's the very nature of it is."}, {"time": 4887, "text": "This is, man is a chasm, a tightrope between man and Ubermensch."}, {"time": 4895, "text": "Well, I don't wanna leave your thought about, we'll call those things flourishes to the aspect of Tyson's interpretation or his expression of his feelings in combat, and so I gave this anecdote to the guy, and my first anecdote to that athlete I was working with, and I said, you know, there isn't a superior way in this sense."}, {"time": 4921, "text": "There is the way that works for you."}, {"time": 4922, "text": "That may be something you can implement to other people if you find that person, because we all have different personalities, and to me that's an absolute."}, {"time": 4931, "text": "I don't wanna, don't come at me with all your other fucking social sciences crap."}, {"time": 4936, "text": "No, we have distinct personalities."}, {"time": 4938, "text": "That personality, who you really are, and this, again, Heidegger, Dasein, being authentic."}, {"time": 4945, "text": "If you're authentic with who you are, goods and bads, you will know how to create what that is, and for me, violence and fighting and conflict was something that always felt normal to me, and I don't mean normal in, like I grew up in a war zone or an abusive household or something like that."}, {"time": 4992, "text": "I didn't break it."}, {"time": 4992, "text": "I figured out how to pull it apart."}, {"time": 4994, "text": "Curiosity about the world, and yet, that wasn't in conflict with the idea of violence?"}, {"time": 4998, "text": "No, not at all, and so being a very joyful and nice kid, but kids are kids, and if kids can find that you respond maybe more easily to agitation, they will agitate you, and if you should stand out in some way by being taller or bigger or something, or caring, especially, they will agitate you."}, {"time": 5022, "text": "They don't really fully understand it either, and so I don't hold anything against any of the kids that used to pick on me or whatever, especially at the youngest ages."}, {"time": 5030, "text": "Man, they don't know shit either, so, but once that line was pushed, for me it was, oh, well, I was being cool."}, {"time": 5040, "text": "Now you're being uncool."}, {"time": 5042, "text": "Well, then that gives me license for everything, and so, boom, we would just go at it, or kids that would try to initiate a fight, and I was like, okay, and being in that moment of just going to town with someone else, it just felt like this is, this is."}, {"time": 5058, "text": "I belong here."}, {"time": 5059, "text": "Yeah, it was never a problem for me."}, {"time": 5063, "text": "In fact, if anything, what I had to understand was, well, not only did I learn the hard way, that it doesn't matter, at the end of the day, it doesn't really matter what anybody else does if your response in violence, even to their violence, if you're the winner, is often going to be penalized severely."}, {"time": 5086, "text": "Society, state apparatus, they don't want any of that."}, {"time": 5091, "text": "They wanna be the only arbiter of violence in the world, always."}, {"time": 5125, "text": "So you need to learn what level is necessary, and you need to learn what comes with all, what's the responsibility of, when you enact violence, I mean, you take on something when you have a responsibility for that."}, {"time": 5140, "text": "This is the extension of your actions."}, {"time": 5145, "text": "But as I got older, and especially as I found sports, and then combat sports, now this was a place for me to flourish, and to the point where I was more myself in that space than I was outside of it until time enough where I could learn to get this back together again."}, {"time": 5165, "text": "And I never say that I'll merge the two or anything like that."}, {"time": 5170, "text": "No, all what happened, my journey from adolescence on to manhood, a huge portion of it, besides the normal finding yourself, whatever, whatever, actually what it was was getting back to who I always was."}, {"time": 5193, "text": "Getting back to the kid."}, {"time": 5193, "text": "The curious kid, the kind kid."}, {"time": 5195, "text": "Getting back to the guy that I should have been allowed to become instead of what happened under the pressures of other things."}, {"time": 5204, "text": "And the attempt for society and certain people within managerial positions to compress what that was into something that they found more suitable."}, {"time": 5218, "text": "Yeah, but those pressures allow you to discover this little world, forbidden world, in many ways, of violence that you could explore."}, {"time": 5225, "text": "Through sport, you can explore it, and it's more socially acceptable to explore it through sport."}, {"time": 5232, "text": "But even then, at times, it's socially unacceptable."}, {"time": 5236, "text": "So I beat Sem Schilt."}, {"time": 5241, "text": "He cut my right eyebrow."}, {"time": 5244, "text": "I cut him and busted his nose, and he's bleeding all over me as I have an armbar on top."}, {"time": 5248, "text": "I'm getting, you know, it's raining blood."}, {"time": 5251, "text": "Quote some slayer from a lacerated Sem Schilt, bleeding in his horror, creating my structures."}, {"time": 5258, "text": "Now I shall rain him blood."}, {"time": 5259, "text": "But I win the fight, armbar, nasty one."}, {"time": 5266, "text": "I get on my feet, and the first thing I do is I wipe all the blood off onto my hands, and I lick it, and I do my thing."}, {"time": 5275, "text": "And all the MMA journalists freaked out."}, {"time": 5279, "text": "Dana Wise, like, man, I don't know about that."}, {"time": 5281, "text": "You know, we don't want him doing, everybody had this huge problem."}, {"time": 5284, "text": "And then some folks would even contend, oh, you know, you're trying to do, like, no, no, no, this isn't planned."}, {"time": 5292, "text": "I don't think of these things."}, {"time": 5293, "text": "This is how I really feel."}, {"time": 5294, "text": "This is who I really am."}, {"time": 5296, "text": "And, you know, it was even kind of comical after the fact, you know, and BJ Penn was on the very card with me, watching him at some point in his career all of a sudden win fights and then do this licking the glove thing, and everyone thinks it's the coolest thing ever."}, {"time": 5311, "text": "And I'm like, hey, fuck faces."}, {"time": 5313, "text": "I did this in 2002 or one, 2001, and BJ Penn actually back then was like, dude, you're a badass, you're a killer, you know?"}, {"time": 5325, "text": "Because that seems like a deeply human moment."}, {"time": 5326, "text": "I could say, I could just be, you know, goofy about it and call it orgiastic to align with Titan."}, {"time": 5332, "text": "Are we back to Mike Tyson?"}, {"time": 5333, "text": "Yeah, but Tyson, but no, no, it isn't, it's beyond that."}, {"time": 5340, "text": "Is it a celebration of human nature?"}, {"time": 5341, "text": "I've had some pretty decent orgasms in my life at this point, I'm 43."}, {"time": 5344, "text": "So, but no, none have ever compared to that."}, {"time": 5346, "text": "Like I said, it is a feeling of highest being to me."}, {"time": 5350, "text": "It's your Ubermensch moment."}, {"time": 5351, "text": "This is where I feel like the restrictions of general existence in society are gone."}, {"time": 5360, "text": "And I get to fully live in a state that feels more meaningful, of the most meaning."}, {"time": 5366, "text": "You know, I think of it as life and death."}, {"time": 5368, "text": "And it's just, it is the way I'm built."}, {"time": 5372, "text": "And I don't have, I've never had any problem applying violence."}, {"time": 5376, "text": "Like it doesn't, I don't know where it comes from or how you would define it or whatever, if you want to stick me under in a psychologist chair, but like I don't, there's a part of me that can just like, no, if I'm gonna apply, I can apply violence to any level and be okay with it."}, {"time": 5392, "text": "And it doesn't, I don't lose sleep."}, {"time": 5397, "text": "It was me learning how to fully understand violence, humans, and the broader perspective that allowed me to think about things and like, well, what do I really want to accomplish with my actions in the world just on a whole?"}, {"time": 5415, "text": "You know, not compartmentalizing my sporting career."}, {"time": 5418, "text": "Even when I get in the ring, I don't have any mercy generally."}, {"time": 5424, "text": "And if I do, it's because I make a really deliberate attempt to be in a state where I can have mercy."}, {"time": 5433, "text": "If I just go in there to fight with everything I got, there is zero mercy."}, {"time": 5437, "text": "The natural state of violence."}, {"time": 5438, "text": "There's nothing, there's nothing that will hold me back other than the referee and that's that."}, {"time": 5442, "text": "You know, I know I agreed to be allowed to do and not to do, but within that, no."}, {"time": 5449, "text": "And I expect it to be done to me."}, {"time": 5451, "text": "But in terms of values, in terms of seeing what, to me, violence is just yet another canvas that humans can paint beautifully on."}, {"time": 5464, "text": "Clearly, I mean, we have venerated the violent."}, {"time": 5467, "text": "There are communists that venerate the violent on their behalf."}, {"time": 5472, "text": "There are national socialists that venerate the violent there."}, {"time": 5476, "text": "And then if you remove it from an ideological perspective, we venerate the violent when they're a hero."}, {"time": 5483, "text": "We venerate the violent in our religion."}, {"time": 5486, "text": "Well, I mean, I guess some people venerate the violence of Yahweh and Sodom and Gomorrah, right?"}, {"time": 5492, "text": "So, or do we say Jehovah?"}, {"time": 5495, "text": "Is there, you've already mentioned one, but is there a fight where you've achieved the highest of heights for your own personal being just when you look within yourself that you're the proudest of, or maybe it was your most beautiful creation?"}, {"time": 5511, "text": "Is there something that stands out?"}, {"time": 5512, "text": "Yeah, there are a few, actually."}, {"time": 5514, "text": "Fighting Semishield and a rematch."}, {"time": 5517, "text": "Well, the first one was pretty good, too."}, {"time": 5518, "text": "But the rematch was, I was suffering, I had suffered prior, the week prior, to food poisoning."}, {"time": 5527, "text": "And so while my abs are looking all right, I, in the ring, didn't have the power that I expected to."}, {"time": 5537, "text": "And I was struggling in ways, in some of the grappling with the submission stuff that I hadn't accounted for."}, {"time": 5544, "text": "Just exhaustion or mental exhaustion?"}, {"time": 5546, "text": "No, I mean, just physical, I wasn't back up to 100% in terms of just power output."}, {"time": 5552, "text": "And Semi was, well, he's always seven foot tall."}, {"time": 5556, "text": "But this time he was, the first time I fought him, he was 260, or 257, or 260 something, something like that."}, {"time": 5564, "text": "This time he was like 290."}, {"time": 5566, "text": "And so he was a significantly bigger cat."}, {"time": 5568, "text": "And he's a big dude."}, {"time": 5571, "text": "And I just remember being up against the ropes with him, changing levels, trying to take him down."}, {"time": 5580, "text": "And he's fighting, and he's hippin'."}, {"time": 5581, "text": "And I just thought in my head, there's no fuckin way I'm gonna lose this fight."}, {"time": 5585, "text": "There's no way, you are not going to beat me."}, {"time": 5588, "text": "And I armbarred him, the other arm."}, {"time": 5591, "text": "Even out of the fact he's like, man, I really wanted to get you for that, I wanted to get that match back."}, {"time": 5595, "text": "And then you fuckin got my other arm, dick."}, {"time": 5596, "text": "And I'm like, eh, dude, I still love you though."}, {"time": 5599, "text": "You know, and that."}, {"time": 5600, "text": "But the whole time you're like, so this has to do with the dichotomy of you're feeling your worst."}, {"time": 5607, "text": "And having to overcome."}, {"time": 5608, "text": "You're like literally mentally telling yourself there's no way."}, {"time": 5611, "text": "There's no fuckin way I'm gonna lose this fight."}, {"time": 5612, "text": "And then there's even my last bare knuckle match."}, {"time": 5615, "text": "And getting in the ring and fighting bare knuckle boxing for the first time."}, {"time": 5621, "text": "And just thinking, just being in a great state."}, {"time": 5625, "text": "And just looking so forward to seeing."}, {"time": 5628, "text": "I mean, I called someone."}, {"time": 5631, "text": "I was talking to them the night before."}, {"time": 5632, "text": "And I said, yeah, well, I video called you because this face might not look like this when I see you next."}, {"time": 5639, "text": "And they're just like, ooh, uh, okay."}, {"time": 5643, "text": "That's not just like empty trash talk."}, {"time": 5645, "text": "That's like a clarity of mind and a seriousness about."}, {"time": 5649, "text": "I go, I might die."}, {"time": 5651, "text": "Most, pretty high chance of being deformed some way."}, {"time": 5654, "text": "So, but fuck it."}, {"time": 5656, "text": "Are you, do you think about, are you accepting your own death?"}, {"time": 5661, "text": "Yeah, I, in fact, and that's, in a strange way, that's partially what makes it so elevated in terms of my sense of feeling."}, {"time": 5669, "text": "By being able to have death at my side, it feels good."}, {"time": 5676, "text": "And to be there and to think that this could be the one, like, why not, you know?"}, {"time": 5683, "text": "I'm not a religious person at all, even though I very much have to seem, it seems to bang on the drum about the usefulness or understanding the usefulness of religion for people."}, {"time": 5695, "text": "But, you know, if I gotta do something, then yeah, put me in Valhalla, man."}, {"time": 5699, "text": "I don't wanna be anywhere else."}, {"time": 5700, "text": "Nothing else seems like a good place for me to be."}, {"time": 5702, "text": "I wanna fight all day long and feast all night."}, {"time": 5706, "text": "You know, it sounds great."}, {"time": 5707, "text": "I saw you throw your hat into the ring of Fader Emelianenko."}, {"time": 5713, "text": "He got COVID, I guess."}, {"time": 5714, "text": "I hope he overcomes it and comes out just as good, if not better."}, {"time": 5718, "text": "Epic with that."}, {"time": 5719, "text": "Did I understand correctly that might be his last fight?"}, {"time": 5721, "text": "Yes, that's my understanding."}, {"time": 5724, "text": "And it would be epic as hell."}, {"time": 5725, "text": "And it would be epic as hell because the person that I wanna give my most to is a person that I respect, especially at this long career of mine and getting at this twilight years."}, {"time": 5741, "text": "It's like two warriors."}, {"time": 5742, "text": "And that's the thing about even this going in there with the aspect of being with death and all that is that when that person is in there, they are my brother with me in this."}, {"time": 5752, "text": "And so when you give me your best, even if I win dominant fashion, but if you show up and you're as authentic and being here as I am, then I love you."}, {"time": 5763, "text": "And I'm glad for you to be here."}, {"time": 5764, "text": "And we're in this together."}, {"time": 5765, "text": "And at this point, your loss or my loss or whatever is no less deserving of veneration than the win."}, {"time": 5774, "text": "Like we're here in this."}, {"time": 5790, "text": "It's incredible how the ultimate violence is coupled with love or respect."}, {"time": 5797, "text": "And it's weird how the competition in its violent form is also a veneration of just human connection."}, {"time": 5810, "text": "Human connection."}, {"time": 5811, "text": "It's also the removal."}, {"time": 5812, "text": "I feel like it's the purest, one of the purest ways, purest, most honest places a person can exist."}, {"time": 5819, "text": "That line in Fight Club, you don't know really who you are until you've been in a fight."}, {"time": 5822, "text": "I mean, I believe that."}, {"time": 5823, "text": "And I've seen so many examples of people trying to portray themselves as one thing."}, {"time": 5829, "text": "And then in the ring, you see who they really are."}, {"time": 5832, "text": "Or even when they're trying to portray themselves as one thing and they're winning, the crowd, at times, will see who they really are and still hate them, you know?"}, {"time": 5842, "text": "And it's like, well, I said all the good things."}, {"time": 5845, "text": "Bro, don't work that way."}, {"time": 5856, "text": "You out of the picture."}, {"time": 5858, "text": "As a cop out, to some degree, I feel like we need a little bit more time, you know?"}, {"time": 5863, "text": "So, to see how this unfolds."}, {"time": 5867, "text": "Because you gotta compare a lot of things."}, {"time": 5868, "text": "And I, did I, I think I'm."}, {"time": 5872, "text": "Like centuries?"}, {"time": 5873, "text": "I did an interview."}, {"time": 5874, "text": "I don't know about centuries."}, {"time": 5875, "text": "But that would help if we can keep accurate records and not allow too much bias to fall in."}, {"time": 5881, "text": "Too much propaganda."}, {"time": 5882, "text": "The victor's still there, right?"}, {"time": 5883, "text": "Yeah, but I made an argument."}, {"time": 5888, "text": "I was in, I get a, it was a interview with an MMA outlet of some sort."}, {"time": 5894, "text": "And I can't recall who it was."}, {"time": 5896, "text": "But, oh, it was an argument about will the winner of Cain Velasquez versus Steve Amiocik be the greatest MMA heavyweight of all time?"}, {"time": 5906, "text": "And I said, fucking no way."}, {"time": 5909, "text": "Oh no, it was Cormier Amiocik."}, {"time": 5911, "text": "That's what it was."}, {"time": 5912, "text": "I said, absolutely not."}, {"time": 5913, "text": "Not even close."}, {"time": 5915, "text": "And I said, these guys need a bit more time to see how things go."}, {"time": 5919, "text": "And also how things go for some of their opponents."}, {"time": 5921, "text": "And like, there's more factors than just this one fight."}, {"time": 5924, "text": "And I go, and when you wanna weigh these people, even if let's say, we'll bring Alistair Overeem into the end of the equation."}, {"time": 5932, "text": "Okay, you judge him on what you know now, what he's done for you lately, okay?"}, {"time": 5939, "text": "Which is a very myopic way of doing it."}, {"time": 5943, "text": "What has he done over his career?"}, {"time": 5944, "text": "K1 champion."}, {"time": 5946, "text": "He was a champion in DREAM."}, {"time": 5952, "text": "He, Strike Force, blah, blah, blah."}, {"time": 5953, "text": "His overall record."}, {"time": 5955, "text": "The entirety of all the different opponents he's fought."}, {"time": 5958, "text": "And I just sit back and I go, okay, he's not the UFC champ."}, {"time": 5962, "text": "But his accolades, his merits, in some ways, actually stand up higher than Cormier's and Amiocik's."}, {"time": 5975, "text": "So what about the moments, do you give much value to the special moments, like the highest heights you rise to, not in terms of records or the strikes landed, but just creating a magical moment in a fight?"}, {"time": 5990, "text": "It doesn't have to be even a championship fight, but just, Conor McGregor is an example of somebody who creates a narrative, who creates a story, who creates a drama, and a special magic happens, even if it's like, not with."}, {"time": 6002, "text": "Myth is greater than reality."}, {"time": 6004, "text": "And that is always the case."}, {"time": 6005, "text": "But do you."}, {"time": 6006, "text": "And so I understand that so very much, and it takes an asshole like me to poo poo on your myth."}, {"time": 6012, "text": "They at least get you, at the end of the day, you're not gonna abandon your myth, but perhaps temper it with the facts and logic."}, {"time": 6022, "text": "So you're not a fan of myth?"}, {"time": 6024, "text": "No, I'm an absolute massive fan of myth."}, {"time": 6026, "text": "But you prefer facts and logic."}, {"time": 6028, "text": "It's like when I, no, I mean."}, {"time": 6030, "text": "I like saying facts and logic, because people, I also, I am not a materialist in that sense."}, {"time": 6036, "text": "I don't think that materialism can solve for everything."}, {"time": 6039, "text": "It's not robust enough, I'm sorry."}, {"time": 6041, "text": "If facts and logic and, or reason, as the Enlightenment scholars all thought, including Marx, was enough for people, then we would never, we wouldn't have any religions."}, {"time": 6053, "text": "We wouldn't have any, like there would be no, we wouldn't have narratives and myths and all this kind of stuff."}, {"time": 6058, "text": "It would not, it just, I'm sorry, there is no, there's nothing about history that supports the idea that rationality will overcome all."}, {"time": 6067, "text": "There's something about Ben Shapiro's facts don't care about your feelings, that feels to be miss, feels to be missing something fundamental about human nature."}, {"time": 6076, "text": "It's not clear to me exactly what is missing."}, {"time": 6080, "text": "To give old Ben a fair shake."}, {"time": 6084, "text": "And I don't know Ben Shapiro."}, {"time": 6087, "text": "I don't really listen to Ben Shapiro, not against Ben Shapiro."}, {"time": 6090, "text": "I don't, I'm not here to say anything particularly bad about him."}, {"time": 6095, "text": "Although I will say at one time, Tom Arnold was seemingly trying to pick an actionable fight with Ben Shapiro."}, {"time": 6102, "text": "In the ring."}, {"time": 6103, "text": "Or in the."}, {"time": 6103, "text": "Somewhere, yeah."}, {"time": 6104, "text": "And I just, and I actually responded, I like, and I tried to get him to clarify, I said, hey, are you saying that you want to fight Ben Shapiro, that you're looking to actually, because I was waiting for him to say something and then I can be like, okay, well, it's one thing to want to get into a fight with someone."}, {"time": 6118, "text": "It's another thing to go pick on a little tiny, you know, guy like Ben, who's much smaller than you and doesn't train or whatever, but you know, if it's not me, I can find someone your size and you can go fight him."}, {"time": 6129, "text": "You know, don't be a, basically, don't be a bully piece of shit."}, {"time": 6133, "text": "You know, which by the way, Tom Arnold, you are a mental midget."}, {"time": 6137, "text": "You are never going to be able to compete even with Ben Shapiro in an argument on any level about anything."}, {"time": 6143, "text": "Oh, intellectual argument."}, {"time": 6145, "text": "Yeah, intellectual argument."}, {"time": 6146, "text": "Maybe you can scream louder than him, but whatever."}, {"time": 6149, "text": "But nevertheless, in the discussion of greatness in fighting."}, {"time": 6155, "text": "I think you need to look at some of the numbers."}, {"time": 6157, "text": "You need to look at some of the numbers."}, {"time": 6159, "text": "And there's the magic."}, {"time": 6160, "text": "There is some context also in that, where did Alistair Overeem fight?"}, {"time": 6165, "text": "Oh, he fought in Pride, where you could soccer kick people and stomp their head and this and that."}, {"time": 6168, "text": "And so the game environment is actually different too."}, {"time": 6173, "text": "There's more uncertainty, there's more chaos in Pride, there's more."}, {"time": 6176, "text": "Go back a little further and go like, what about the guys that used to, like Dan Severn fought bare knuckle, head butts, the whole nine."}, {"time": 6184, "text": "You beat Dan Severn, right?"}, {"time": 6185, "text": "I did beat Dan Severn."}, {"time": 6186, "text": "That was killing an idol, so to speak."}, {"time": 6188, "text": "Although I didn't really kill him because I still love him."}, {"time": 6191, "text": "He's still an, I mean, he's still responsible for inspiration along this whole pathway."}, {"time": 6197, "text": "It's meeting your God and then putting a knife in it, I guess."}, {"time": 6202, "text": "Realizing they're human and then bringing them down to your level."}, {"time": 6207, "text": "Exactly, but also there's a huge misconception there and that is that I could bring, maybe I could bring Dan Severn down to my level, but I couldn't bring his mustache down to my level."}, {"time": 6218, "text": "It is of mythic proportions and..."}, {"time": 6221, "text": "Greater than yours."}, {"time": 6222, "text": "Your facial hair is greater than yours."}, {"time": 6224, "text": "My facial hair is creating its own legacy, but it is not Dan Severn mustache level or now Don Fry mustache."}, {"time": 6232, "text": "So Don Fry mustache, Dan Severn mustache."}, {"time": 6235, "text": "Now you have like Shia versus Sunni."}, {"time": 6240, "text": "You think there'll be a Karl Marx painting of Josh Barnett one day with the beard and is that basically what you're trying to say?"}, {"time": 6249, "text": "I will actually comb my hair, unlike Marx, but..."}, {"time": 6253, "text": "Chaos has a charm to it."}, {"time": 6256, "text": "It does, it does."}, {"time": 6257, "text": "I mean, we all thought Doc Brown in Back to the Future was quite charming."}, {"time": 6262, "text": "You have to throw that into the calculation where they fought."}, {"time": 6265, "text": "This is the interesting thing."}, {"time": 6266, "text": "And the rules that they fought under."}, {"time": 6267, "text": "Some guy like Eerov Chanchin won a 32 man tournament or something like that."}, {"time": 6273, "text": "I go, okay."}, {"time": 6276, "text": "Steepa and Daniel Cormier are awesome and they will for sure be revered for their careers."}, {"time": 6288, "text": "Can you say that they're particularly even better overall than Eerov Chanchin?"}, {"time": 6293, "text": "Well, maybe one of them could have beat them."}, {"time": 6295, "text": "Maybe one of them wouldn't have."}, {"time": 6297, "text": "Maybe Eerov would have got them with the knuckles right away."}, {"time": 6301, "text": "Well, maybe if they fought them in pride, they wouldn't have won."}, {"time": 6303, "text": "Maybe if they fought them bare knuckle, they wouldn't won."}, {"time": 6306, "text": "And there's something about the chaos, like do you put Royce Gracie in the top 10?"}, {"time": 6311, "text": "There's something about... Top 10 of all time in terms of competitors is capable."}, {"time": 6319, "text": "I'd have to think about that."}, {"time": 6320, "text": "Maybe not, but I put Royce Gracie as like pyramid level."}, {"time": 6324, "text": "Like, wow, dude, what an amazing man."}, {"time": 6328, "text": "Yeah, he's so important."}, {"time": 6329, "text": "Absolutely, incredibly important."}, {"time": 6332, "text": "But there's something about stepping into, like fighting another human being under all the uncertainty that the early UFCs had."}, {"time": 6340, "text": "I mean, you don't know."}, {"time": 6342, "text": "What is going to happen?"}, {"time": 6343, "text": "And coupled that with not much money."}, {"time": 6349, "text": "So the purity of it too."}, {"time": 6350, "text": "There's something about money."}, {"time": 6351, "text": "I mean, I guess it's shit for that cat post world, but that ruins the purity of the violence."}, {"time": 6357, "text": "Yeah, people given the opportunity for... Yeah, yeah."}, {"time": 6363, "text": "The bigger things get, the more..."}, {"time": 6364, "text": "I love the fact that fighting has opened up to such a degree that the career business side of it, because I absolutely distinctly separate the two."}, {"time": 6376, "text": "The business side of it has opened up to give me far more possibilities, opened way more doors for me than I ever intended it to."}, {"time": 6384, "text": "Whereas the athlete side of things has, if anything, just gotten substantially worse, I would say."}, {"time": 6393, "text": "And some of this is due to the nature of all games will be learned, will be gamed without even the rules being broken."}, {"time": 6407, "text": "And once that's figured out, you need to make an adjustment."}, {"time": 6411, "text": "No adjustments have been made."}, {"time": 6413, "text": "So the game just appears to be the same game over and over and over and over and over again on ESPN+, on whatever, on whatever, on whatever."}, {"time": 6422, "text": "It doesn't really matter which night you watch."}, {"time": 6424, "text": "It's the same game constantly."}, {"time": 6426, "text": "And that's not because the athletes are worse or better."}, {"time": 6432, "text": "It's because they have had that game structure long enough that they figured out what do you do to be the most successful at it?"}, {"time": 6441, "text": "What is the highest percentage way of approaching it, essentially, even if you're not thinking of percentages?"}, {"time": 6446, "text": "What were the..."}, {"time": 6448, "text": "If we take a step back, it's really fascinating to think about the early UFCs."}, {"time": 6451, "text": "Did you fight Dan Severn in the UFC?"}, {"time": 6453, "text": "I fought him in Super Brawl."}, {"time": 6455, "text": "Super Brawl, so that was in the early, early days, your undefeated... 2000."}, {"time": 6461, "text": "What were those early days, let's say, of mixed martial arts like?"}, {"time": 6466, "text": "Let me tell you the day of high adventure."}, {"time": 6469, "text": "Dun, dun, dun, dun, dun, dun, dun, dun, dun, dun."}, {"time": 6475, "text": "It was so much fun."}, {"time": 6476, "text": "And it made you feel absolutely like you were a part of a novel, a comic book."}, {"time": 6484, "text": "I mean, I would love to transcribe my experiences as what I consider a second generation MMA athlete, except I'm way too sensitive to anybody's personal, any things that are not even to..."}, {"time": 6505, "text": "I'm not a gossipy person."}, {"time": 6506, "text": "I really do believe that small people talk about others."}, {"time": 6509, "text": "Big people talk about ideas."}, {"time": 6514, "text": "But there's just some stories that you can't tell without telling the whole story."}, {"time": 6518, "text": "And there are so many amazing stories that could be told."}, {"time": 6523, "text": "People being at their best, people being at their worst."}, {"time": 6525, "text": "Yeah, the whole niche of gossip."}, {"time": 6528, "text": "Is there something you could speak to the chaos of the time?"}, {"time": 6533, "text": "Well, okay, so we at AMC got connected to somebody that was throwing an event in Nampa, Idaho, and we all piled into this."}, {"time": 6542, "text": "And Matt Humes, Subaru Wagon, and we jammed out."}, {"time": 6547, "text": "And we left Kirkland and we headed over to Idaho, only to find out that there was nothing really put in place."}, {"time": 6555, "text": "Nothing really put in place, it was absolute disrepair and chaos."}, {"time": 6563, "text": "They didn't have a rain, they didn't have this."}, {"time": 6566, "text": "It was such a bullshit adventure."}, {"time": 6568, "text": "But we were like, well, there's hardly anywhere to fight."}, {"time": 6574, "text": "It's tough to find these opportunities."}, {"time": 6576, "text": "So, okay, well, how about this?"}, {"time": 6579, "text": "Whoever is here to fight and is willing, all right, well, since there's no venue, there's no this, whatever, we all got gloves, we got mouthpieces, we'll just go to the park, as long as we still get paid."}, {"time": 6591, "text": "And so folks were kind of like, I don't know about that."}, {"time": 6596, "text": "The guy I was gonna fight was, he finally gets information on who I actually am, and I was undefeated at the time."}, {"time": 6605, "text": "I think I had fought Super Brawl 13 and already won that tournament."}, {"time": 6610, "text": "And so he's like, yeah, I had no clue."}, {"time": 6613, "text": "I'm so glad we didn't fight, you would have murdered me."}, {"time": 6616, "text": "What a setup."}, {"time": 6618, "text": "And eventually Matt had to strong arm the guy and get our money that we were supposed to all get and drive back."}, {"time": 6625, "text": "And because his whole position was, well, there ain't no fucking way, we drove all the way out here for free."}, {"time": 6631, "text": "This is on you, you fucked this up, not my problem."}, {"time": 6635, "text": "But what is my problem is the lack of cash in my account."}, {"time": 6638, "text": "So fix it, or me fighting my first organized fight against an AMC guy on 11 days notice through a connection to an old wrestling coach I had."}, {"time": 6654, "text": "And I just gathered up with all my old martial arts instructor that I had worked with and we grappled in his apartment."}, {"time": 6664, "text": "We did tie pads in the park."}, {"time": 6667, "text": "I ran a couple miles every day and then, all right, boom, show it up."}, {"time": 6672, "text": "Won my fight by front choke in two minutes."}, {"time": 6674, "text": "And then Matt goes, okay, well, hey, you did really great."}, {"time": 6679, "text": "We'd like you to come back and fight again in the summer."}, {"time": 6682, "text": "Okay, go back off the university."}, {"time": 6684, "text": "And then I think, hmm, well, that fight didn't go exactly as how I wanted it to."}, {"time": 6689, "text": "So I gotta find a way to get more experience."}, {"time": 6693, "text": "I would literally fight people in the university, like rec center on the old wrestling mats, as they didn't know I had a wrestling team."}, {"time": 6702, "text": "I would find anyone doing martial arts, anyone talking about getting into street fights, anyone, whatever, and just basically go, oh, you ever watch UFC?"}, {"time": 6710, "text": "Yeah, yeah, that stuff's cool."}, {"time": 6712, "text": "Oh, man, I'm super into it, man, it's badass."}, {"time": 6715, "text": "Rad."}, {"time": 6716, "text": "So would you wanna fight?"}, {"time": 6719, "text": "Would you wanna fight?"}, {"time": 6719, "text": "I mean, it was way easier picking fights than it was, you know, getting a girlfriend."}, {"time": 6726, "text": "So I just, you know, path least resistance."}, {"time": 6730, "text": "I think it might be useful for us to get some advice from you."}, {"time": 6735, "text": "Because you've accomplished, for the journey of a martial artist first, if you accomplish some of the greatest accolades there is in the sport, if somebody who's starting out now, or early on in their journey, what advice would you give on how to become a martial artist, catch wrestler, a fighter?"}, {"time": 6758, "text": "Well, I mean, really what it comes down to is do it because you love it."}, {"time": 6763, "text": "Do it for that reason and that reason alone."}, {"time": 6767, "text": "Most people that get into this and attempt to make any sort of professional inroads with it, you are not going to be the world champion."}, {"time": 6775, "text": "You probably will never even fight for a belt and you're probably not going to net make money at this."}, {"time": 6783, "text": "So don't do it for those reasons."}, {"time": 6786, "text": "Do it for the reason of the passion."}, {"time": 6788, "text": "Do it for the reason to be the absolute best that you can be, whatever that ends up being."}, {"time": 6793, "text": "You might at best only be mediocre, but you won't even be mediocre if you don't do it like you really mean it."}, {"time": 6801, "text": "The passion, look, where is the kernel of the passion, would you say, is it in the learning process itself, the improvement?"}, {"time": 6807, "text": "I think it really depends on the person, right?"}, {"time": 6809, "text": "I mean, there's some people that really love the fact of, they feel like they're growing, right?"}, {"time": 6816, "text": "Well to power, you're growing, growing stronger, growing better."}, {"time": 6821, "text": "The idea of eliminating weakness."}, {"time": 6824, "text": "So, to which I'll quickly define weakness as just like things that weaken you, not like being physically weak."}, {"time": 6833, "text": "Sure, you could call that weakness, but maybe you're not meant to be a super strong guy."}, {"time": 6837, "text": "But choosing to be weak is really a different story other than just like, we're all deficient in some way or another."}, {"time": 6847, "text": "So that's neither here nor there."}, {"time": 6850, "text": "It's a matter of what you decide to do with it."}, {"time": 6852, "text": "And that's different from strength and weakness, at least the way I look at it."}, {"time": 6854, "text": "Like strength is choosing, regardless of the difficulty, to make improvements."}, {"time": 6859, "text": "Strength is even choosing to acknowledge that you do lack."}, {"time": 6863, "text": "And accept it and then make a decision what to do with it."}, {"time": 6868, "text": "Yeah, but there's also, there's a bunch of stuff that just like you said, it's what you're drawn to."}, {"time": 6872, "text": "There's an honesty to just grappling that it seems more real than anything else you can do."}, {"time": 6878, "text": "Sure, well and also."}, {"time": 6879, "text": "And that's where the passion and love can come from."}, {"time": 6881, "text": "Yeah, I mean, being in an environment, hopefully, that is as true as possible, would be a starter."}, {"time": 6887, "text": "So, it's hard to be a bullshit person when you're literally trying to tear each other's arms off."}, {"time": 6896, "text": "You know, you really sort of see who somebody is."}, {"time": 6898, "text": "I also feel like you really get to see somebody who, there are a couple instances where you really see who people are on the mats and in the bedroom."}, {"time": 6907, "text": "So, even the aspect of self betterment, growth along a path."}, {"time": 6919, "text": "I mean, hell, that's part of the divisive capture for martial arts as a business."}, {"time": 6926, "text": "Give you a belt, put a stripe on your belt."}, {"time": 6929, "text": "Each of these iterations cost 20 bucks."}, {"time": 6933, "text": "But there's a benefit to that too."}, {"time": 6935, "text": "I really enjoyed the progression of belts."}, {"time": 6939, "text": "You know, a bit of it is OCD or whatever, but you're enjoying the recognition, your growth when you feel, when you're made to feel, when I think genuinely you do earn it."}, {"time": 6951, "text": "It makes complete sense to me."}, {"time": 6952, "text": "It just, it's anything that is, has a goodness in its purity can also have a detriment in its perversion."}, {"time": 6961, "text": "And there's a value to competition."}, {"time": 6964, "text": "I've gotten some shit in the past for saying this."}, {"time": 6966, "text": "I've gotten the most value in giving everything I have to try to win and lose."}, {"time": 6975, "text": "So like, I've gotten, I remember most of the matches I've lost and I think that's what I've gotten the most from the sport is losing."}, {"time": 6986, "text": "I mean, if you really think about it, what makes you wanna actually, in detail, go over what happened?"}, {"time": 6996, "text": "Oh, it's the time when you didn't get what you wanted."}, {"time": 6999, "text": "It's a time when you gave it everything you had and you came up short."}, {"time": 7003, "text": "Or failed miserably."}, {"time": 7006, "text": "Especially if you're embarrassed in some way."}, {"time": 7008, "text": "It's usually the only time people, again, calamity, is the impetus for them to actually turn around and go, who the fuck am I?"}, {"time": 7015, "text": "What am I doing and why am I doing it?"}, {"time": 7017, "text": "Instead of naturally going, hmm, okay, well I won."}, {"time": 7023, "text": "What was it the cause?"}, {"time": 7024, "text": "And so I think part of my success is that when I win, I'm brutal."}, {"time": 7029, "text": "When I lose, I'm brutal."}, {"time": 7031, "text": "And there is no in between."}, {"time": 7033, "text": "So I remember losing the rematch against Noguera."}, {"time": 7042, "text": "And I still feel like it was a bullshit call."}, {"time": 7044, "text": "I feel like I won that fight."}, {"time": 7045, "text": "But my opinion is that, and this even came up, so one of the coaches in the back was like, oh, you did great, don't feel bad, blah, blah, blah, blah."}, {"time": 7055, "text": "And I go, no, fuck that."}, {"time": 7056, "text": "I didn't finish him."}, {"time": 7058, "text": "I allowed the referees to make a judge, a decision that I think is incorrect and bad, but that came because I didn't take him out."}, {"time": 7064, "text": "Fuck that, no, no."}, {"time": 7066, "text": "He won, he's gonna get more money, he's gonna get more recognition, blah, blah, blah, blah, blah, blah, blah."}, {"time": 7071, "text": "I accept all this and it's not okay."}, {"time": 7073, "text": "And I need to, when I get a chance to fight him again, I gotta figure out how to take this guy out."}, {"time": 7080, "text": "I don't wanna say forever."}, {"time": 7081, "text": "I'm not trying to put him six feet underground."}, {"time": 7083, "text": "Well, when I fight, yes I am."}, {"time": 7084, "text": "But the point being, I need to find a way to, this is definitive."}, {"time": 7090, "text": "You don't get to say shit about it because I'm the only one who can stand right now."}, {"time": 7095, "text": "That's the way it's gotta be."}, {"time": 7096, "text": "Anything less than that is not good enough."}, {"time": 7099, "text": "And even if I achieve that, then I gotta figure out, okay, it's not a given."}, {"time": 7105, "text": "How did I get to this point?"}, {"time": 7106, "text": "How did I make that happen?"}, {"time": 7108, "text": "Was it simply because of his own mistakes or was it because of my successful action?"}, {"time": 7116, "text": "So it's always self critical."}, {"time": 7118, "text": "Always, constantly."}, {"time": 7120, "text": "You love movies."}, {"time": 7122, "text": "I read this somewhere."}, {"time": 7124, "text": "You mentioned Blade Runner is a favorite."}, {"time": 7125, "text": "Number one of all time, the final cut."}, {"time": 7127, "text": "That's my go to."}, {"time": 7128, "text": "So you would say Blade Runner is the greatest movie of all time."}, {"time": 7132, "text": "It's one of the greatest movies of all time."}, {"time": 7134, "text": "And it is my number."}, {"time": 7135, "text": "What's in the top?"}, {"time": 7136, "text": "My top five, Blade Runner, final cut."}, {"time": 7141, "text": "This is the original Blade Runner."}, {"time": 7143, "text": "And I used to own, on tape, the original."}, {"time": 7146, "text": "VHS?"}, {"time": 7147, "text": "The original cut, yeah."}, {"time": 7148, "text": "And I had the director's cut on DVD."}, {"time": 7151, "text": "Why Blade Runner, by the way?"}, {"time": 7154, "text": "What connects you to it?"}, {"time": 7155, "text": "As a kid, I just thought it was so cool."}, {"time": 7157, "text": "There was something about it that really spoke to me."}, {"time": 7158, "text": "The whole cyberpunk landscapes and this guy chasing down rogue androids, replicants, and all this."}, {"time": 7167, "text": "Is it just the entire cyberpunk universe or is it just robots as well?"}, {"time": 7173, "text": "No, I mean, the cyberpunk universe is part of it."}, {"time": 7177, "text": "On the surface, I've always tended towards dark subject matter."}, {"time": 7182, "text": "Things that are of the dark, so to speak, are things that I've always been gravitated towards."}, {"time": 7188, "text": "I think maybe part of it is that things that are darker are more accepting and more upfront with death."}, {"time": 7200, "text": "And perhaps, I think, maybe that is what was... Yeah, somehow more honest, perhaps."}, {"time": 7204, "text": "I mean, there's also the aspect of rebelliousness, usually."}, {"time": 7208, "text": "Like, I was never one to wanna just do what somebody told me to do, you know?"}, {"time": 7217, "text": "I'm not sitting around trying to always be such a radical individual that I can't take orders."}, {"time": 7225, "text": "No, in fact, I'm more than willing to take orders from somebody that I feel is competent and has merit and reason behind what they're doing and makes like, okay, yeah, yeah, yeah."}, {"time": 7236, "text": "I'm 100% for it."}, {"time": 7237, "text": "Not only can I take orders, I will help you achieve whatever it is if I think it's worthwhile, even at my own expense."}, {"time": 7245, "text": "But to get to that point is a rarity."}, {"time": 7249, "text": "Like, it's just not a given."}, {"time": 7251, "text": "And so you can even imagine being a grade school teacher and this kid doesn't respect you and he doesn't really think you're that smart."}, {"time": 7257, "text": "They don't really appreciate that."}, {"time": 7260, "text": "So cyberpunk is number one."}, {"time": 7262, "text": "Cyberpunk is kind of number one."}, {"time": 7263, "text": "It's an environment I love, but at the same time, Conan the Barbarian by John Milius is one of my favorite films of all time."}, {"time": 7271, "text": "And you know, that's such a pure film in a way."}, {"time": 7275, "text": "Like, the motivations are pure."}, {"time": 7277, "text": "They're very easy to follow, but not lacking in depth."}, {"time": 7283, "text": "You know, it's not just explosions and teal and orange."}, {"time": 7288, "text": "It's more on the human condition and I love it."}, {"time": 7293, "text": "And it's shot incredibly well."}, {"time": 7296, "text": "It's got an incredible soundtrack."}, {"time": 7298, "text": "Yeah, I fucking love it."}, {"time": 7299, "text": "But with Blade Runner also in a deeper sense, you know, again, the human condition."}, {"time": 7303, "text": "You know, you start seeing like, what is being?"}, {"time": 7305, "text": "What is being human?"}, {"time": 7307, "text": "You know, how does this relate to if you can make it and you can tell it what to do, at what point is it like you should or you shouldn't?"}, {"time": 7316, "text": "You know, why do you get to determine what's alive and what's not?"}, {"time": 7319, "text": "What's a life that should be allowed to live and what isn't?"}, {"time": 7322, "text": "And what would be the strain of being Roy Batty and seeing all these incredible moments that with his passing will no longer exist?"}, {"time": 7337, "text": "Especially if he hasn't had a chance to put that flame into another torch, so to speak."}, {"time": 7342, "text": "If he hasn't written them down, if he hasn't passed them down to somebody else."}, {"time": 7348, "text": "Gone like tears in the rain."}, {"time": 7350, "text": "Like tears in the rain, that scene is incredible."}, {"time": 7353, "text": "But it's funny, because those two universes are very different, Conan and the Barbarian and Cyberpunk."}, {"time": 7358, "text": "Is there, that makes me curious about what else might be in the list at the top."}, {"time": 7363, "text": "Well, let me think."}, {"time": 7364, "text": "It's a pretty."}, {"time": 7365, "text": "Do you like the Godfather type of universe?"}, {"time": 7367, "text": "No, no, I mean, I'm sure the Godfather, I've never actually even watched the whole Godfather."}, {"time": 7371, "text": "No, but also like, was it Casino, Goodfellas?"}, {"time": 7374, "text": "Goodfellas is a good movie, but no, that's not in my top."}, {"time": 7376, "text": "It's a good flick, but it doesn't really do it for me."}, {"time": 7381, "text": "If people really wanna get into this a little more, I did make a list of 100 of my favorite movies on my Facebook fan page."}, {"time": 7390, "text": "Do you remember what like, some of the top."}, {"time": 7392, "text": "Oh yeah, like Blazing Saddles is on there, Rage of the Lost Ark, Valhalla Rising by Nicholas from Winding Refn, Maniac by William Lustig."}, {"time": 7405, "text": "It's a 1980 gnarly video nasty horror movie about a serial killer who murders women and scalps them."}, {"time": 7418, "text": "And it's gnarly as hell and very brutal and very bleak and very, I mean, it's the kind of thing that like a lot of people would have a real hard time watching."}, {"time": 7429, "text": "But one, again, I like things that are dark, but two, I thought the performances were fantastic in this film and they really got out, I think what the underlying thing was, and it was a guy who was basically just like run amok by the overbearing mother, Jungian archetype."}, {"time": 7448, "text": "And it, she was, she imparted her insanity into him."}, {"time": 7453, "text": "And he, but yet there is this aspect you could see of him wanting to try and actually be able to be in the world and have love and have a feminine companionship to go with his masculine aspect."}, {"time": 7471, "text": "But he had no way of understanding how to really make that happen."}, {"time": 7476, "text": "And he had a complete negative connotation to the feminine."}, {"time": 7480, "text": "So his struggle with, and there's a little part in the movie where he somehow comes across this model or something, and they actually, he starts to feel like maybe he might be able to actually have a relationship with somebody and it goes somewhere."}, {"time": 7499, "text": "But yeah, even the Elijah Wood remake I felt was really well done and captured most of the essence of what the movie was about."}, {"time": 7507, "text": "But I still feel like the original by William Lustig is the best."}, {"time": 7512, "text": "What's the greatest love movie of all time?"}, {"time": 7516, "text": "Greatest love movie of all time."}, {"time": 7518, "text": "So like something where love is, I mean, I suppose love underlies most of these movies, and especially like The Dark."}, {"time": 7523, "text": "I mean hell, Takashi Miike's films are all about family of all things, as bonkers as those movies are."}, {"time": 7530, "text": "They, the general theme is family almost entirely in all of his films."}, {"time": 7536, "text": "Yeah, there's very, I mean, even you can argue later on."}, {"time": 7539, "text": "Yeah, it's everywhere."}, {"time": 7541, "text": "Greatest love film of all time."}, {"time": 7545, "text": "That's, I mean, is Excalibur a film about love?"}, {"time": 7549, "text": "What's Excalibur about?"}, {"time": 7551, "text": "King Arthur."}, {"time": 7553, "text": "Excalibur is about Arthur becoming king of the Britains and his love of his country and his love of Guinevere."}, {"time": 7561, "text": "But eventually, yeah, it becomes more of about the necessity for the king to love, to hold Excalibur, to stay, to realize that while, if you're the king, you can love your wife and you can love your best friend, and they may fuck each other behind your back and as they fall in love too."}, {"time": 7587, "text": "But at the end of the day, your responsibility, your love has to be to the country and everyone else first and not your own personal wants, which, you know, made a much more interesting story when you have Carmen Berenna and oh, oh, what is that one?"}, {"time": 7606, "text": "It's a German opera, but you know, and horses and slow mo and sword fights and an epic death scene between Arthur and his son."}, {"time": 7616, "text": "Okay, now I definitely have to watch it and Evan watched it and embarrassed me."}, {"time": 7621, "text": "It is John Boorman's second film in Hollywood, his first one being Point Blank with Lee Marvin, which is also on top, one of the upper echelon movies on my list, derived from a book called The Outfit by, what is his name?"}]}]