[{"title": "Jack Dorsey: Square, Cryptocurrency, and Artificial Intelligence | Lex Fridman Podcast #91", "id": "60KJz1BVTyU", "quotes": [{"time": 355, "text": "Like maybe I'm also a hacker at heart and it's incredible to me that that kind of scale could be achieved."}, {"time": 362, "text": "Is there some insight, some lessons, some interesting tidbits that you can say how to make that scale happen?"}, {"time": 372, "text": "Is it the hardware fundamentally challenge?"}, {"time": 374, "text": "Is it a software challenge?"}, {"time": 379, "text": "Is it a social challenge of building large teams of engineers that work together, that kind of thing?"}, {"time": 385, "text": "Like what's the interesting challenges there?"}, {"time": 388, "text": "By the way, you're the best dressed hacker I've met."}, {"time": 391, "text": "I think the."}, {"time": 394, "text": "If the enumeration you just went through, I don't think there's one."}, {"time": 397, "text": "You have to kind of focus on all and the ability to focus on all that really comes down to how you face problems and whether you can break them down into parts that you can focus on."}, {"time": 413, "text": "Because I think the biggest mistake is trying to solve or address too many at once or not going deep enough with the questions or not being critical of the answers you find or not taking the time to form credible hypotheses that you can actually test and you can see the results of."}, {"time": 439, "text": "So all of those fall in the face of ultimately critical thinking skills, problem solving skills."}, {"time": 447, "text": "And if there's one skill I want to improve every day, it's that that's what contributes to the learning and the only way we can evolve any of these things is learning what it's currently doing and how to take it to the next step."}, {"time": 464, "text": "And questioning assumptions, the first principles kind of thinking, seems like a fundamental to this whole process."}, {"time": 470, "text": "Yeah, but if you get too overextended into, well, this is a hardware issue, you miss all the software solutions."}, {"time": 476, "text": "And vice versa, if you focus too much on the software, there are hardware solutions that can 10X the thing."}, {"time": 486, "text": "So I try to resist the categories of thinking and look for the underlying systems that make all these things work."}, {"time": 498, "text": "But those only emerge when you have a skill around creative thinking, problem solving, and being able to ask critical questions and having the patience to go deep."}, {"time": 516, "text": "So one of the amazing things, if we look at the mission of Square, is to increase people's access to the economy."}, {"time": 525, "text": "Maybe you can correct me if I'm wrong, that's from my perspective."}, {"time": 527, "text": "So from the perspective of merchants, peer to peer payments, even crypto, cryptocurrency, digital cryptocurrency, what do you see as the major ways that our society can increase participation in the economy?"}, {"time": 539, "text": "So if we look at today and the next 10 years, next 20 years, you go into Africa, maybe in Africa and all kinds of other places outside of the North America."}, {"time": 549, "text": "If there was one word that I think represents what we're trying to do at Square, it is that word access."}, {"time": 559, "text": "One of the things we found is that we weren't expecting this at all."}, {"time": 563, "text": "When we started, we thought we were just building a piece of hardware to enable people to plug it into their phone and swipe a credit card."}, {"time": 572, "text": "And then as we talked with people who actually tried to accept credit cards in the past, we found a consistent theme, which many of them weren't even enabled, not enabled, but allowed to process credit cards."}, {"time": 586, "text": "And we dug a little bit deeper, again, asking that question."}, {"time": 590, "text": "And we found that a lot of them would go to banks or these merchant acquirers."}, {"time": 597, "text": "And waiting for them was a credit check and looking at a FICA score."}, {"time": 603, "text": "And many of the businesses that we talked to and many small businesses, they don't have good credit or a credit history."}, {"time": 615, "text": "They're entrepreneurs who are just getting started, taking a lot of personal risk, financial risk."}, {"time": 621, "text": "And it just felt ridiculous to us that for the job of being able to accept money from people, you had to get your credit checked."}, {"time": 633, "text": "And as we dug deeper, we realized that that wasn't the intention of the financial industry, but it's the only tool they had available to them to understand authenticity, intent, predictor of future behavior."}, {"time": 649, "text": "So that's the first thing we actually looked at."}, {"time": 650, "text": "And that's where the, you know, we built the hardware, but the software really came in terms of risk modeling."}, {"time": 657, "text": "And that's when we started down the path that eventually leads to AI."}, {"time": 663, "text": "We started with a very strong data science discipline because we knew that our business was not necessarily about making hardware."}, {"time": 673, "text": "It was more about enabling more people to come into the system."}, {"time": 678, "text": "So the fundamental challenge there is, so to enable more people to come into the system, you have to lower the barrier of checking that that person will be a legitimate vendor."}, {"time": 690, "text": "Is that the fundamental problem?"}, {"time": 691, "text": "Yeah, and a different mindset."}, {"time": 693, "text": "I think a lot of the financial industry had a mindset of kind of distrust and just constantly looking for opportunities to prove why people shouldn't get into the system, whereas we took on a mindset of trust and then verify, verify, verify, verify, verify."}, {"time": 713, "text": "So we moved, you know, when we entered the space, only about 30 to 40% of the people who applied to accept credit cards would actually get through the system."}, {"time": 725, "text": "We took that knowledge, we took it to the next level."}, {"time": 728, "text": "If we applied to accept credit cards, we'd actually get through the system."}, {"time": 733, "text": "We took that number to 99%."}, {"time": 735, "text": "And that's because we reframed the problem, we built credible models, and we had this mindset of, we're going to watch not at the merchant level, but we're gonna watch at the transaction level."}, {"time": 750, "text": "So come in, perform some transactions, and as long as you're doing things with integrity, credible, and don't look suspicious, we'll continue to serve you."}, {"time": 763, "text": "If we see any interestingness in how you use our system, that will be bubbled up to people to review, to figure out if there's something nefarious going on, and that's when we might ask you to leave."}, {"time": 776, "text": "So the change in the mindset led to the technology that we needed to enable more people to get through, and to enable more people to access the system."}, {"time": 788, "text": "What role does machine learning play into that, in that context of, you said, first of all, it's a beautiful shift."}, {"time": 797, "text": "Anytime you shift your viewpoint into seeing that people are fundamentally good, and then you just have to verify and catch the ones who are not, as opposed to assuming everybody's bad, this is a beautiful thing."}, {"time": 811, "text": "So what role does the, to you, throughout the history of the company, has machine learning played in doing that verification?"}, {"time": 820, "text": "It was immediate."}, {"time": 821, "text": "I mean, we weren't calling it machine learning, but it was data science."}, {"time": 825, "text": "And then as the industry evolved, machine learning became more of the nomenclature, and as that evolved, it became more sophisticated with deep learning, and as that continues to evolve, it'll be another thing."}, {"time": 839, "text": "But they're all in the same vein."}, {"time": 842, "text": "But we built that discipline up within the first year of the company, because we also had, we had to partner with a bank, we had to partner with Visa and MasterCard, and we had to show that, by bringing more people into the system, that we could do so in a responsible way, that would not compromise their systems, and that they would trust us."}, {"time": 865, "text": "How do you convince this upstart company with some cool machine learning tricks is able to deliver on this trustworthy set of merchants?"}, {"time": 875, "text": "We staged it out in tiers."}, {"time": 877, "text": "We had a bucket of 500 people using it, and then we showed results, and then 1,000, and then 10,000, then 50,000, and then the constraint was lifted."}, {"time": 889, "text": "So again, it's kind of getting something tangible out there."}, {"time": 894, "text": "I want to show what we can do rather than talk about it."}, {"time": 898, "text": "And that put a lot of pressure on us to do the right things."}, {"time": 902, "text": "And it also created a culture of accountability, of a little bit more transparency, and I think incentivized all of our early folks and the company in the right way."}, {"time": 918, "text": "So what does the future look like in terms of increasing people's access?"}, {"time": 921, "text": "Or if you look at IoT, Internet of Things, there's more and more intelligent devices."}, {"time": 927, "text": "You can see there's some people even talking about our personal data as a thing that we could monetize more explicitly versus implicitly."}, {"time": 935, "text": "Sort of everything can become part of the economy."}, {"time": 938, "text": "Do you see, so what does the future of Square look like in sort of giving people access in all kinds of ways to being part of the economy as merchants and as consumers?"}, {"time": 949, "text": "I believe that the currency we use is a huge part of the answer."}, {"time": 955, "text": "And I believe that the internet deserves and requires a native currency."}, {"time": 961, "text": "And that's why I'm such a huge believer in Bitcoin because it just, our biggest problem as a company right now is we cannot act like an internet company."}, {"time": 976, "text": "Open a new market, we have to have a partnership with a local bank."}, {"time": 980, "text": "We have to pay attention to different regulatory onboarding environments."}, {"time": 985, "text": "And a digital currency like Bitcoin takes a bunch of that away where we can potentially launch a product in every single market around the world because they're all using the same currency."}, {"time": 1001, "text": "And we have consistent understanding of regulation and onboarding and what that means."}, {"time": 1009, "text": "So I think the internet continuing to be accessible to people is number one."}, {"time": 1017, "text": "And then I think currency is number two."}, {"time": 1021, "text": "And it will just allow for a lot more innovation, a lot more speed in terms of what we can build and others can build."}, {"time": 1029, "text": "And it's just really exciting."}, {"time": 1031, "text": "So, I mean, I wanna be able to see that and feel that in my lifetime."}, {"time": 1036, "text": "So in this aspect and in other aspects, you have a deep interest in cryptocurrency and distributed ledger tech in general."}, {"time": 1044, "text": "I talked to Vitalik Buterin yesterday on this podcast."}, {"time": 1047, "text": "He says hi, by the way."}, {"time": 1049, "text": "Hey."}, {"time": 1049, "text": "He's a brilliant, brilliant person."}, {"time": 1053, "text": "Talked a lot about Bitcoin and Ethereum, of course."}, {"time": 1056, "text": "So can you maybe linger on this point?"}, {"time": 1058, "text": "What do you find appealing about Bitcoin, about digital currency?"}, {"time": 1063, "text": "Where do you see it going in the next 10, 20 years?"}, {"time": 1066, "text": "And what are some of the challenges with respect to Square but also just bigger for our globally, for our world, for the way we think about money?"}, {"time": 1079, "text": "I think the most beautiful thing about it is there's no one person setting the direction."}, {"time": 1085, "text": "And there's no one person on the other side that can stop it."}, {"time": 1088, "text": "So we have something that is pretty organic in nature and very principled in its original design."}, {"time": 1099, "text": "And I think the Bitcoin white paper is one of the most seminal works of computer science in the last 20, 30 years."}, {"time": 1110, "text": "I mean, it really is."}, {"time": 1110, "text": "Yeah, it's a pretty cool technology."}, {"time": 1112, "text": "That's not often talked about."}, {"time": 1113, "text": "There's so much hype around digital currency about the financial impacts of it."}, {"time": 1118, "text": "But the actual technology is quite beautiful from a computer science perspective."}, {"time": 1122, "text": "Yeah, and the underlying principles behind it that went into it, even to the point of releasing it under a pseudonym."}, {"time": 1128, "text": "I think that's a very, very powerful statement."}, {"time": 1131, "text": "The timing of when it was released is powerful."}, {"time": 1134, "text": "It was a total activist move."}, {"time": 1138, "text": "I mean, it's moving the world forward in a way that I think is extremely noble and honorable and enables everyone to be part of the story, which is also really cool."}, {"time": 1150, "text": "So you asked a question around 10 years and 20 years."}, {"time": 1153, "text": "I mean, I think the amazing thing is no one knows."}, {"time": 1157, "text": "And it can emerge."}, {"time": 1159, "text": "And every person that comes into the ecosystem, whether they be a developer or someone who uses it, can change its direction in small and large ways."}, {"time": 1171, "text": "And that's what I think it should be, because that's what the internet has shown is possible."}, {"time": 1176, "text": "Now, there's complications with that, of course."}, {"time": 1178, "text": "And there's certainly companies that own large parts of the internet and can direct it more than others."}, {"time": 1184, "text": "And there's not equal access to every single person in the world just yet."}, {"time": 1190, "text": "But all those problems are visible enough to speak about them."}, {"time": 1194, "text": "And to me, that gives confidence that they're solvable in a relatively short timeframe."}, {"time": 1200, "text": "I think the world should be able to do that."}, {"time": 1202, "text": "I think the world changes a lot as we get these satellites projecting the internet down to earth, because it just removes a bunch of the former constraints and really levels the playing field."}, {"time": 1218, "text": "But a global currency, which a native currency for the internet is a proxy for, is a very powerful concept."}, {"time": 1227, "text": "And I don't think any one person on this planet truly understands the ramifications of that."}, {"time": 1231, "text": "I think there's a lot of positives to it."}, {"time": 1234, "text": "There's some negatives as well."}, {"time": 1235, "text": "But... Do you think it's possible, sorry to interrupt, do you think it's possible that this kind of digital currency would redefine the nature of money, so become the main currency of the world, as opposed to being tied to fiat currency of different nations and sort of really push the decentralization of control of money?"}, {"time": 1254, "text": "Definitely, but I think the bigger ramification is how it affects how society works."}, {"time": 1262, "text": "And I think there are many positive ramifications outside of just money."}, {"time": 1267, "text": "Outside of just money."}, {"time": 1268, "text": "Money is a foundational layer that enables so much more."}, {"time": 1272, "text": "I was meeting with an entrepreneur in Ethiopia, and payments is probably the number one problem to solve across the continent, both in terms of moving money across borders between nations on the continent, or the amount of corruption within the current system."}, {"time": 1293, "text": "But the lack of easy ways to pay people makes starting anything really difficult."}, {"time": 1302, "text": "I met an entrepreneur who started the Lyft slash Uber of Ethiopia, and one of the biggest problems she has is that it's not easy for her riders to pay the company, it's not easy for her to pay the drivers."}, {"time": 1317, "text": "And that definitely has stunted her growth and made everything more challenging."}, {"time": 1322, "text": "So the fact that she even has to think about payments instead of thinking about the best rider experience and the best driver experience is pretty telling."}, {"time": 1335, "text": "So I think as we get a more durable, resilient and global standard, we see a lot more innovation everywhere."}, {"time": 1346, "text": "And I think there's no better case study for this than the various countries within Africa and their entrepreneurs who are trying to start things within health or sustainability or transportation or a lot of the companies that we've seen here."}, {"time": 1362, "text": "So the majority of companies I met in November when I spent a month on the continent were payments oriented."}, {"time": 1372, "text": "You mentioned, and this is a small tangent, you mentioned the anonymous launch of Bitcoin is a sort of profound philosophical statement."}, {"time": 1380, "text": "Pseudonymous."}, {"time": 1382, "text": "What's that even mean?"}, {"time": 1383, "text": "There's a pseudonym."}, {"time": 1384, "text": "First of all, let me ask."}, {"time": 1385, "text": "There's an identity tied to it."}, {"time": 1386, "text": "It's not just anonymous, it's Nakamoto."}, {"time": 1390, "text": "So Nakamoto might represent one person or multiple people."}, {"time": 1393, "text": "But let me ask, are you Satoshi Nakamoto?"}, {"time": 1395, "text": "Just checking, catch you off guard."}, {"time": 1397, "text": "And if I were, would I tell you?"}, {"time": 1399, "text": "Maybe you slip."}, {"time": 1401, "text": "A pseudonym is constructed identity."}, {"time": 1405, "text": "Anonymity is just kind of this random, like drop something off and leave."}, {"time": 1412, "text": "There's no intention to build an identity around it."}, {"time": 1414, "text": "And while the identity being built was a short time window, it was meant to stick around, I think, and to be known."}, {"time": 1424, "text": "And it's being honored in how the community thinks about building it, like the concept of Satoshi's, for instance, is one such example."}, {"time": 1436, "text": "But I think it was smart not to do it anonymous, not to do it as a real identity, but to do it as pseudonym, because I think it builds tangibility and a little bit of empathy that this was a human or a set of humans behind it."}, {"time": 1454, "text": "And there's this natural identity that I can imagine."}, {"time": 1459, "text": "But there is also a sacrifice of ego."}, {"time": 1462, "text": "That's a pretty powerful thing from your perspective."}, {"time": 1463, "text": "Yeah, which is beautiful."}, {"time": 1465, "text": "Would you do, sort of philosophically, to ask you the question, would you do all the same things you're doing now if your name wasn't attached to it?"}, {"time": 1475, "text": "Sort of, if you had to sacrifice the ego, put another way, is your ego deeply tied in the decisions you've been making?"}, {"time": 1485, "text": "I mean, I believe I would certainly attempt to do the things without my name having to be attached with it."}, {"time": 1493, "text": "But it's hard to do that in a corporation, legally."}, {"time": 1501, "text": "That's the issue."}, {"time": 1502, "text": "If I were to do more open source things, then absolutely, I don't need my particular identity, my real identity associated with it."}, {"time": 1512, "text": "But I think the appreciation that comes from doing something good and being able to see it and see people use it is pretty overwhelming and powerful, more so than maybe seeing your name in the headlines."}, {"time": 1529, "text": "Let's talk about artificial intelligence a little bit, if we could."}, {"time": 1534, "text": "70 years ago, Alan Turing formulated the Turing test."}, {"time": 1538, "text": "To me, natural language is one of the most interesting spaces of problems that are tackled by artificial intelligence."}, {"time": 1545, "text": "It's the canonical problem of what it means to be intelligent."}, {"time": 1548, "text": "He formulated it as the Turing test."}, {"time": 1550, "text": "Let me ask sort of the broad question, how hard do you think is it to pass the Turing test in the space of language?"}, {"time": 1558, "text": "Just from a very practical standpoint, I think where we are now and for at least years out is one where the artificial intelligence, machine learning, the deep learning models can bubble up interestingness very, very quickly and pair that with human discretion around severity, around depth, around nuance and meaning."}, {"time": 1587, "text": "I think for me, the chasm across for general intelligence is to be able to explain why and the meaning behind something."}, {"time": 1600, "text": "Behind a decision."}, {"time": 1602, "text": "Behind a decision or a set of data."}, {"time": 1605, "text": "So the explainability part is kind of essential to be able to explain the meaning behind something."}, {"time": 1612, "text": "To explain using natural language why the decisions were made, that kind of thing."}, {"time": 1616, "text": "Yeah, I mean I think that's one of our biggest risks in artificial intelligence going forward is we are building a lot of black boxes that can't necessarily explain why they made a decision or what criteria they used to make the decision."}, {"time": 1629, "text": "And we're trusting them more and more from lending decisions to content recommendation to driving to health."}, {"time": 1638, "text": "Like a lot of us have watches that tell us to understand how they're deciding that."}, {"time": 1643, "text": "I mean that one's pretty simple."}, {"time": 1645, "text": "But you can imagine how complex they get."}, {"time": 1648, "text": "And being able to explain the reasoning behind some of those recommendations seems to be an essential part."}, {"time": 1654, "text": "Although it's hard."}, {"time": 1655, "text": "Which is a very hard problem because sometimes even we can't explain why we make decisions."}, {"time": 1660, "text": "That's what I was, I think we're being sometimes a little bit unfair to artificial intelligence systems because we're not very good at some of these things."}, {"time": 1668, "text": "So do you think, apologize for the ridiculous romanticized question, but on that line of thought, do you think we'll ever be able to build a system like in the movie Her that you could fall in love with?"}, {"time": 1683, "text": "So have that kind of deep connection with."}, {"time": 1686, "text": "Hasn't that already happened?"}, {"time": 1687, "text": "Hasn't someone in Japan fallen in love with his AI?"}, {"time": 1693, "text": "There's always going to be somebody that does that kind of thing."}, {"time": 1695, "text": "I mean at a much larger scale of actually building relationships, of being deeper connections."}, {"time": 1701, "text": "It doesn't have to be love, but it's just deeper connections with artificial intelligence systems."}, {"time": 1706, "text": "So you mentioned explainability."}, {"time": 1707, "text": "That's less a function of the artificial intelligence and more a function of the individual and how they find meaning and where they find meaning."}, {"time": 1714, "text": "Do you think we humans can find meaning in technology in this kind of way?"}, {"time": 1718, "text": "Yeah, yeah, yeah, 100%, 100%."}, {"time": 1720, "text": "And I don't necessarily think it's a negative."}, {"time": 1723, "text": "But it's constantly going to evolve."}, {"time": 1730, "text": "So I don't know, but meaning is something that's entirely subjective."}, {"time": 1736, "text": "And I don't think it's going to be a function of finding the magic algorithm that enables everyone to love it."}, {"time": 1747, "text": "But maybe, I don't know."}, {"time": 1749, "text": "That question really gets at the difference between human and machine."}, {"time": 1752, "text": "So you had a little bit of an exchange with Elon Musk."}, {"time": 1757, "text": "Basically, I mean it's a trivial version of that, but I think there's a more fundamental question of is it possible to tell the difference between a bot and a human?"}, {"time": 1767, "text": "And do you think it's, if we look into the future, 10, 20 years out, do you think it would be possible or is it even necessary to tell the difference in the digital space between a human and a robot?"}, {"time": 1780, "text": "Can we have fulfilling relationships with each or do we need to tell the difference between them?"}, {"time": 1786, "text": "I think it's certainly useful in certain problem domains to be able to tell the difference."}, {"time": 1792, "text": "I think in others it might not be as useful."}, {"time": 1796, "text": "Do you think it's possible for us today to tell that difference?"}, {"time": 1800, "text": "Is the reverse the meta of the Turing test?"}, {"time": 1802, "text": "Well, what's interesting is I think the technology to create is moving much faster than the technology to detect, generally."}, {"time": 1814, "text": "So if you look at adversarial machine learning, there's a lot of systems that try to fool machine learning systems."}, {"time": 1821, "text": "And at least for me, the hope is that the technology to defend will always be right there, at least."}, {"time": 1828, "text": "Your sense is that..."}, {"time": 1830, "text": "I don't know if they'll be right there."}, {"time": 1831, "text": "I mean, it's a race, right?"}, {"time": 1834, "text": "So the detection technologies have to be two or 10 steps ahead of the creation technologies."}, {"time": 1842, "text": "This is a problem that I think the financial industry will face more and more because a lot of our risk models, for instance, are built around identity."}, {"time": 1850, "text": "Payments ultimately comes down to identity."}, {"time": 1853, "text": "And you can imagine a world where all this conversation around deep fakes goes towards the direction of a driver's license or passports or state identities."}, {"time": 1866, "text": "And people construct identities in order to get through a system such as ours to start accepting credit cards or into the cash app."}, {"time": 1875, "text": "And those technologies seem to be moving very, very quickly."}, {"time": 1879, "text": "Our ability to detect them, I think, is probably lagging at this point, but certainly with more focus, we can get ahead of it."}, {"time": 1889, "text": "But this is gonna touch everything."}, {"time": 1893, "text": "So I think it's like security."}, {"time": 1898, "text": "We're never going to be able to build a perfect detection system."}, {"time": 1902, "text": "We're only going to be able to... What we should be focused on is the speed of evolving it and being able to take signals that show correctness or errors as quickly as possible and move and to be able to build that into our newer models or the self learning models."}, {"time": 1924, "text": "Do you have other worries?"}, {"time": 1926, "text": "Like some people, like Elon and others, have worries of existential threats of artificial intelligence, of artificial general intelligence?"}, {"time": 1933, "text": "Or if you think more narrowly about threats and concerns about more narrow artificial intelligence, like what are your thoughts in this domain?"}, {"time": 1943, "text": "Do you have concerns or are you more optimistic?"}, {"time": 1946, "text": "I think Yuval in his book, 21 Lessons for the 21st Century, his last chapter is around meditation."}, {"time": 1954, "text": "And you look at the title of the chapter and you're like, oh, it's all meditation."}, {"time": 1959, "text": "But what was interesting about that chapter is he believes that kids being born today, growing up today, Google has a stronger sense of their preferences than they do, which you can easily imagine."}, {"time": 1979, "text": "I can easily imagine today that Google probably knows my preferences more than my mother does."}, {"time": 1988, "text": "Maybe not me per se, but for someone growing up only knowing the internet, only knowing what Google is capable of, or Facebook or Twitter or Square or any of these things, the self awareness is being offloaded to other systems and particularly these algorithms."}, {"time": 2008, "text": "And his concern is that we lose that self awareness because the self awareness is now outside of us and it's doing such a better job at helping us direct our decisions around, should I stand, should I walk today?"}, {"time": 2023, "text": "What doctor should I choose?"}, {"time": 2025, "text": "Who should I date?"}, {"time": 2026, "text": "All these things we're now seeing play out very quickly."}, {"time": 2030, "text": "So he sees meditation as a tool to build that self awareness and to bring the focus back on, why do I make these decisions?"}, {"time": 2038, "text": "Why do I react in this way?"}, {"time": 2040, "text": "Why did I have this thought?"}, {"time": 2042, "text": "Where did that come from?"}, {"time": 2044, "text": "That's a way to regain control."}, {"time": 2047, "text": "Or awareness, maybe not control, but awareness so that you can be aware that yes, I am, I am, I am, I am, I am."}, {"time": 2055, "text": "Yes, I am offloading this decision to this algorithm that I don't fully understand and can't tell me why it's doing the things it's doing because it's so complex."}, {"time": 2066, "text": "That's not to say that the algorithm can't be a good thing."}, {"time": 2069, "text": "And to me recommender systems, the best of what they can do is to help guide you on a journey of learning new ideas of learning period."}, {"time": 2079, "text": "It can be a great thing, but do you know you're doing that?"}, {"time": 2081, "text": "Are you aware that you're inviting it to do that to you?"}, {"time": 2085, "text": "I think that's the risk he identifies, right?"}, {"time": 2090, "text": "That's perfectly okay."}, {"time": 2091, "text": "But are you aware that you have that invitation and it's being acted upon?"}, {"time": 2098, "text": "And so that's a concern you're kind of highlighting that without a lack of awareness, you can just be like floating at sea."}, {"time": 2106, "text": "So awareness is key in the future of these artificial intelligence systems."}, {"time": 2110, "text": "Yeah, the movie WALLY."}, {"time": 2112, "text": "WALLY."}, {"time": 2113, "text": "Which I think is one of Pixar's best movies besides RATATOUILLI."}, {"time": 2119, "text": "RATATOUILLI was incredible."}, {"time": 2120, "text": "You had me until RATATOUILLI, okay."}, {"time": 2126, "text": "All right, we've come to the first point where we disagree, okay."}, {"time": 2129, "text": "It's the entrepreneurial story in the form of a rat."}, {"time": 2135, "text": "I just remember just the soundtrack was really good, so."}, {"time": 2141, "text": "What are your thoughts, sticking on artificial intelligence a little bit, about the displacement of jobs?"}, {"time": 2145, "text": "That's another perspective that candidates like Andrew Yang talk about."}, {"time": 2150, "text": "Yang gang forever."}, {"time": 2153, "text": "Yang gang."}, {"time": 2154, "text": "So he unfortunately, speaking of Yang gang, has recently dropped out."}, {"time": 2157, "text": "I know, it was very disappointing and depressing."}, {"time": 2160, "text": "Yeah, but on the positive side, he's I think launching a podcast, so."}, {"time": 2165, "text": "Really, cool."}, {"time": 2166, "text": "Yeah, he just announced that."}, {"time": 2167, "text": "I'm sure he'll try to talk you into trying to come on to the podcast."}, {"time": 2171, "text": "I will talk to him."}, {"time": 2172, "text": "About RATATOUILLI."}, {"time": 2174, "text": "Yeah, maybe he'll be more welcoming of the RATATOUILLI argument."}, {"time": 2178, "text": "What are your thoughts on his concerns of the displacement of jobs, of automations, of the, of course there's positive impacts that could come from automation and AI, but there could also be negative impacts."}, {"time": 2189, "text": "And within that framework, what are your thoughts about universal basic income?"}, {"time": 2193, "text": "So these interesting new ideas of how we can empower people in the economy."}, {"time": 2200, "text": "I think he was 100% right on almost every dimension."}, {"time": 2206, "text": "We see this in Square's business."}, {"time": 2208, "text": "I mean, he identified truck drivers."}, {"time": 2212, "text": "I'm from Missouri."}, {"time": 2214, "text": "And he certainly pointed to the concern and the issue that people from where I'm from feel every single day that is often invisible and not talked about enough."}, {"time": 2229, "text": "You know, the next big one is cashiers."}, {"time": 2232, "text": "This is where it pertains to Square's business."}, {"time": 2235, "text": "We are seeing more and more of the point of sale move to the individual customer's hand in the form of their phone and apps and preorder and order ahead."}, {"time": 2247, "text": "We're seeing more kiosks."}, {"time": 2249, "text": "We're seeing more things like Amazon Go."}, {"time": 2252, "text": "And the number of workers as a cashier in retail is immense."}, {"time": 2260, "text": "And, you know, there's no real answers on how they transform their skills and work into something else."}, {"time": 2271, "text": "And I think that does lead to a lot of really negative ramifications."}, {"time": 2276, "text": "And the important point that he brought up around universal basic income is given that the shift is going to come and given it is going to take time to set people up with new skills and new careers, they need to have a floor to be able to survive."}, {"time": 2297, "text": "And this $1,000 a month is such a floor."}, {"time": 2302, "text": "It's not going to incentivize you to quit your job because it's not enough, but it will enable you to not have to worry as much about just getting on day to day so that you can focus on what am I going to do now and what am I going to, what skills do I need to acquire?"}, {"time": 2324, "text": "And I think, you know, a lot of people point to the fact that, you know, during the industrial age, we had the same concerns around automation, factory lines and everything worked out okay."}, {"time": 2339, "text": "But the biggest change is just the velocity and the centralization of a lot of the things that make this work, which is the data and the algorithms that work on this data."}, {"time": 2354, "text": "I think that the second biggest scary thing is just how around AI is just who actually owns the data and who can operate on it."}, {"time": 2366, "text": "And are we able to share the insights from the data so that we can also build algorithms that help our needs or help our business or whatnot?"}, {"time": 2379, "text": "So that's where I think regulation could play a strong and positive part."}, {"time": 2386, "text": "First, looking at the primitives of AI and the tools we use to build these services that will ultimately touch every single aspect of the human experience."}, {"time": 2396, "text": "And then where data is owned and how it's shared."}, {"time": 2405, "text": "So those are the answers that as a society, as a world, we need to have better answers around, which we're currently not."}, {"time": 2413, "text": "They're just way too centralized into a few very, very large companies."}, {"time": 2419, "text": "But I think it was spot on with identifying the problem and proposing solutions that would actually work."}, {"time": 2426, "text": "At least that we learned from that you could expand or evolve, but I mean, I think UBI is well past its due."}, {"time": 2438, "text": "I mean, it was certainly trumpeted by Martin Luther King and even before him as well."}, {"time": 2444, "text": "And like you said, the exact $1,000 mark might not be the correct one, but you should take the steps to try to implement these solutions and see what works."}, {"time": 2457, "text": "So I think you and I eat similar diets, and at least I was."}, {"time": 2461, "text": "The first time I've heard this."}, {"time": 2464, "text": "Yeah, so I was doing it before."}, {"time": 2465, "text": "First time anyone has said that to me, in this case anyway."}, {"time": 2468, "text": "Yeah, but it's becoming more and more cool."}, {"time": 2472, "text": "But I was doing it before it was cool."}, {"time": 2473, "text": "So intermittent fasting and fasting in general, I really enjoy, I love food, but I enjoy the, I also love suffering because I'm Russian."}, {"time": 2483, "text": "So fasting kind of makes you appreciate the, makes you appreciate what it is to be human somehow."}, {"time": 2493, "text": "But I have, outside the philosophical stuff, I have a more specific question."}, {"time": 2497, "text": "It also helps me as a programmer and a deep thinker, like from the scientific perspective, to sit there for many hours and focus deeply."}, {"time": 2506, "text": "Maybe you were a hacker before you were CEO."}, {"time": 2510, "text": "What have you learned about diet, lifestyle, mindset that helps you maximize mental performance, to be able to focus for, to think deeply in this world of distractions?"}, {"time": 2523, "text": "I think I just took it for granted for too long."}, {"time": 2528, "text": "Which aspect?"}, {"time": 2529, "text": "Just the social structure of we eat three meals a day and there's snacks in between."}, {"time": 2535, "text": "And I just never really asked the question, why?"}, {"time": 2538, "text": "Oh, by the way, in case people don't know, I think a lot of people know, but you at least, you famously eat once a day."}, {"time": 2546, "text": "You still eat once a day?"}, {"time": 2547, "text": "Yep, I eat dinner."}, {"time": 2549, "text": "By the way, what made you decide to eat once a day?"}, {"time": 2552, "text": "Like, cause to me that was a huge revolution that you don't have to eat breakfast."}, {"time": 2555, "text": "That was like, I felt like I was a rebel."}, {"time": 2557, "text": "Like I abandoned my parents or something and became an anarchist."}, {"time": 2561, "text": "When you first, like the first week you start doing it, it feels that you kind of like have a superpower."}, {"time": 2565, "text": "Then you realize it's not really a superpower."}, {"time": 2567, "text": "But it, I think you realize, at least I realized like it just how much is, how much our mind dictates what we're possible of."}, {"time": 2579, "text": "And sometimes we have structures around us that incentivize like, this three meal a day thing, which was purely social structure versus necessity for our health and for our bodies."}, {"time": 2594, "text": "And I did it just, I started doing it because I played a lot with my diet when I was a kid and I was vegan for two years and just went all over the place just because I, you know, health is the most precious thing we have and none of us really understand it."}, {"time": 2613, "text": "So being able to ask the question through experiments that I can perform on myself and learn about is compelling to me."}, {"time": 2624, "text": "And I heard this one guy on a podcast, Wim Hof, who's famous for doing ice baths and holding his breath and all these things."}, {"time": 2634, "text": "He said he only eats one meal a day."}, {"time": 2636, "text": "I'm like, wow, that sounds super challenging and uncomfortable."}, {"time": 2640, "text": "I'm gonna do it."}, {"time": 2642, "text": "So I just, I learn the most when I make myself, I wouldn't say suffer, but when I make myself feel uncomfortable because everything comes to bear in those moments and you really learn what you're about or what you're not."}, {"time": 2661, "text": "So I've been doing that my whole life."}, {"time": 2663, "text": "Like when I was a kid, I could not, like I was, I could not speak."}, {"time": 2667, "text": "Like I had to go to a speech therapist and it made me extremely shy."}, {"time": 2671, "text": "And then one day I realized I can't keep doing this and I signed up for the speech club."}, {"time": 2679, "text": "And it was the most uncomfortable thing I could imagine doing, getting a topic on a note card, having five minutes to write a speech about whatever that topic is, not being able to use the note card while speaking and speaking for five minutes about that topic."}, {"time": 2699, "text": "So, but it just, it puts so much, it gave me so much perspective around the power of communication, around my own deficiencies and around if I set my mind to do something, I'll do it."}, {"time": 2714, "text": "So it gave me a lot more confidence."}, {"time": 2716, "text": "So I see fasting in the same light."}, {"time": 2718, "text": "This is something that was interesting, challenging, uncomfortable, and has given me so much learning and benefit as a result."}, {"time": 2730, "text": "And it will lead to other things that I'll experiment with and play with, but yeah, it does feel a little bit like a superpower sometimes."}, {"time": 2739, "text": "The most boring superpower one can imagine."}, {"time": 2742, "text": "Now it's quite incredible."}, {"time": 2744, "text": "The clarity of mind is pretty interesting."}, {"time": 2747, "text": "Speaking of suffering, you kind of talk about facing difficult ideas."}, {"time": 2753, "text": "You meditate, you think about the broad context of life, of our societies."}, {"time": 2760, "text": "Let me ask, sort of apologize again for the romanticized question, but do you ponder your own mortality?"}, {"time": 2766, "text": "Do you think about death, about the finiteness of human existence when you meditate, when you think about it?"}, {"time": 2775, "text": "And if you do, what, how do you make sense of it, that this thing ends?"}, {"time": 2782, "text": "Well, I don't try to make sense of it."}, {"time": 2783, "text": "I do think about it every day."}, {"time": 2785, "text": "I mean, it's a daily, multiple times a day."}]}]