[{"title": "Anthony Pompliano: Bitcoin | Lex Fridman Podcast #171", "id": "IHg6ixt3CKc", "quotes": [{"time": 334, "text": "I think America was very, very good at exporting the violence elsewhere for a long time."}, {"time": 338, "text": "And, uh, there was this element of, uh, complacency, but also this element of, uh, um, you know, really just American superiority that doesn't happen here."}, {"time": 348, "text": "And, uh, I think that that woke people up, not only to, uh, you know, to the idea that other places around the world may not like the American ideals, may not like democracy and capitalism and, and that, but also, uh, maybe we aren't as big, tough and secure as we thought we were."}, {"time": 365, "text": "And so obviously I think you see the kind of the over rotation with a lot of the kind of security theater that came after that of almost psychologically, let's make our citizens feel like they're safe, even if the things that we're doing don't necessarily, you know, kind of change that apparatus."}, {"time": 378, "text": "Uh, but on top of that, I think it's, it's, it's, it's, it's, it's, it's, it's I think that it really woke people up to, uh, extremism around the world."}, {"time": 387, "text": "And, uh, I don't know if necessarily there was a change in the extremism as much as it just was an awareness thing, right."}, {"time": 394, "text": "How, how many people, you know, kind of drew a line from, was it 92 or 93 with the world trade center bombing to, you know, deep levels of extremism and hatred of, uh, kind of the American industrial complex, probably not that many, 2001, a lot of people."}, {"time": 410, "text": "And so I think that was, you know, again, as a, as a young kid, you don't understand a lot of this stuff."}, {"time": 414, "text": "You basically just, Hey, somebody came here and tried to kill Americans."}, {"time": 418, "text": "And so, you know, we should go fight back, right."}, {"time": 421, "text": "Was kind of the, uh, the, the response I think that I had."}, {"time": 423, "text": "What role did that have psychologically for you when you then in 2006 join the army, I mean, this is a very different joining the army than in the time when like it's more peaceful here, you're essentially facing, I mean, I don't know if you see it that way, but you know, there is a war on terror."}, {"time": 443, "text": "And I know that people kind of, uh, criticize that whole formulation framework of thinking, but nevertheless, you are going to Iraq."}, {"time": 451, "text": "You are going to Afghanistan, you're going to these places and are fighting these complicated, like, I mean, it's not even clear what you're fighting."}, {"time": 461, "text": "Well, I think that there's a couple of key pieces, right?"}, {"time": 463, "text": "So one, like what the actual most impactful data points, if you were, or kind of stories for me, uh, was the Pat Tillman story."}, {"time": 470, "text": "So I played football, uh, in high school and it was going to go play in college."}, {"time": 474, "text": "Um, and seeing, you know, this NFL player who basically just one day said, Hey, I'm going to go and do this instead, uh, and walk away."}, {"time": 481, "text": "I don't know necessarily if it was a, uh, I want to pursue the same story right now."}, {"time": 486, "text": "So he ended up dying."}, {"time": 487, "text": "And so not exactly the, uh, the end result that you want, but I think it was almost like, uh, he made it okay."}, {"time": 493, "text": "If you were on a certain trajectory in life to go take this detour and, and to go do it."}, {"time": 498, "text": "Um, but the second thing is I was 17."}, {"time": 500, "text": "You're pretty stupid when you're 17, you're pretty naive when you're 17."}, {"time": 503, "text": "And so, uh, I almost, um, kind of backed into the deployment because I signed up, uh, as a, uh, a reserve member."}, {"time": 512, "text": "And so basically the plan was to sign up for the reserves."}, {"time": 514, "text": "I was going to go to basic training, get all the, you know, kind of education and qualification, I was going to go to college and then after college, you know, maybe there's a chance that you will go and serve or do whatever."}, {"time": 525, "text": "For me, I ended up getting deployed when I was a junior in college and we got pulled out of school."}, {"time": 530, "text": "And so at 20 years old, uh, it's not exactly what you thought you were signing up for, right."}, {"time": 534, "text": "Especially to kind of leave school to go do it."}, {"time": 537, "text": "And then on top of that, uh, I probably had an advantage over most people, both on the entry to combat and the exit to, uh, kind of a combat situation, which that was football."}, {"time": 548, "text": "So I always explain that, um, in hindsight, you're in a male dominated testosterone driven kind of combative sport where it's us first them."}, {"time": 557, "text": "And, and, uh, there's training and, and, uh, you know, injuries and just kind of all of the things that go into playing a combat sport like football to now they give you guns, but you still have a uniform on still male dominated."}, {"time": 568, "text": "It's just a little bit, you know, more serious in terms of the injuries and, and, uh, potential deaths and things like that, but also on the exit from that deployment, most guys I was there with, they're going back to being, you know, prison guards, police officers working at the lumber yard, you know, just kind of every day Americans."}, {"time": 588, "text": "And so I had the fortunate ability to go back into, uh, kind of that combative environment, go back to play football."}, {"time": 595, "text": "And so it was almost this like deescalation on the way out, uh, where they take your guns away."}, {"time": 599, "text": "We still got a uniform, still male dominated, uh, still combative."}, {"time": 602, "text": "And then eventually you're just a normal citizen."}, {"time": 604, "text": "And so I think that in some weird way, I was, you know, very fortunate to kind of on the entry and exit, have that experience where other guys did."}, {"time": 611, "text": "So what you were deployed to Iraq, were there any memories, experiences that changed you or in general, like you're probably a different man on the other side of it?"}, {"time": 623, "text": "How did that time change you?"}, {"time": 625, "text": "I think there, there was two main takeaways that I took, right?"}, {"time": 628, "text": "So one was, um, not a specific moment, but on multiple occasions, uh, I remember we were driving down the road and I would look and there would be a 10, 12, 14 year old kid."}, {"time": 638, "text": "And if you've never seen somebody who literally has hate and disdain in their eyes, just not necessarily to you personally, just to the uniform, to what you stand for, it's all this stuff."}, {"time": 649, "text": "When you see it, you see it right."}, {"time": 651, "text": "And I always think of, um, if you've ever, uh, watched the movie, uh, 12 strong and in it, uh, they've got this Afghan, uh, Afghanistan warlord, and he's talking to a bunch of soldiers and he says, you know, you don't have killer eyes."}, {"time": 663, "text": "You do, you do."}, {"time": 664, "text": "And he's just like, he can just tell, right?"}, {"time": 665, "text": "He's, he's seen so many soldiers."}, {"time": 667, "text": "And so I think that that was a, a memory on a number of occasions where I just saw young kids and I just said, they hate us."}, {"time": 676, "text": "And, and it's not you personally, it's what you stand for."}, {"time": 679, "text": "But the really big event was, um, when you first get to these combat zones, a lot of times what will happen is, uh, you basically, your unit teams up with a unit that's leaving and there's a handoff and happens over a couple of weeks."}, {"time": 690, "text": "And so you can imagine almost, you know, 1% of our team goes out with 99% of their team, then five, 95, 10, 90, all the way till it's 50, 50."}, {"time": 698, "text": "And then eventually it rotates."}, {"time": 699, "text": "And then it's majority of our team and a small number of their team."}, {"time": 702, "text": "And so what a lot of people will explain is the two most dangerous times in war are actually the first two or three weeks and the last two or three weeks."}, {"time": 710, "text": "When you first get there, you don't know who the people are."}, {"time": 712, "text": "You don't know the terrain, you don't know, you know, kind of the local cultures and, and, uh, who to look out for, what signs, all that kind of stuff."}, {"time": 718, "text": "And the last two or three weeks is you basically think you survived the deployment, you're looking forward to going home."}, {"time": 723, "text": "So you become complacent, things like that."}, {"time": 725, "text": "And so we made it through that transition period with no issues."}, {"time": 728, "text": "Uh, but the literally the very first mission, uh, that we went out as a team, ourselves, a hundred percent, um, there was two separate incidents."}, {"time": 737, "text": "Uh, one was we were driving in the middle of the night and, uh, what we think was a sniper shot at a truck that I was in, I was standing up outside of it, uh, along with a, uh, another guy."}, {"time": 747, "text": "And that was kind of just a wake up call again of never been shot at before."}, {"time": 752, "text": "And so I'll never forget, uh, you kind of heard this whiz go by and the guy next to me was from a rural Pennsylvania."}, {"time": 758, "text": "And he just said, you know, look, I've never been shot at before either, but I've done a lot of hunting, get the fuck down."}, {"time": 765, "text": "And so, uh, we kept driving that night."}, {"time": 768, "text": "Um, and, uh, later on in the night, uh, an IED went off, a guy ran over an IED, uh, who was at the front of the convoy."}, {"time": 775, "text": "And when that IED went off, uh, again, I had never been in a convoy that had been blown up before, but the training kicks in."}, {"time": 782, "text": "And so immediately every single person starts screaming out IED, IED, and they started looking and trying to figure it out."}, {"time": 787, "text": "And you realize the United States military did a fantastic job training us before we went, because in that moment, nobody thought about anything."}, {"time": 795, "text": "You just did what you had been programmed to do."}, {"time": 797, "text": "Um, and so ultimately kind of through the end of that event, uh, there was a US soldier that ended up dying."}, {"time": 802, "text": "He was, uh, shot in the head."}, {"time": 804, "text": "And, um, when we got back to the base, uh, kind of after that entire event, I think it just hit us."}, {"time": 811, "text": "We are at war."}, {"time": 812, "text": "And if we make mistakes here, that is the cost of, you know, kind of those mistakes."}, {"time": 817, "text": "And this was somebody who I didn't know."}, {"time": 820, "text": "Uh, it was somebody who literally showed up, uh, kind of as secondary support, uh, for our unit and basically, uh, was there to help us."}, {"time": 828, "text": "And so it was one of those weird situations where, uh, you have this emotional connection because it's somebody who, uh, shared an event with you, but you didn't know them."}, {"time": 838, "text": "And you learn their name later and you understand that they have a family and they have young kids and all this stuff."}, {"time": 843, "text": "And so again, as a 20 year old kid, you're kind of processing all this and you just realize like the gun I have in my arm, my hands, it's real for a reason."}, {"time": 851, "text": "And we better take this seriously."}, {"time": 853, "text": "This is not, you know, let's joking around in kind of the barracks and, you know, all the things that you would expect, you know, guys you're doing in the army."}, {"time": 860, "text": "So I think that was like the moment where I said, Hey, I'm going to learn a lot here."}, {"time": 864, "text": "Uh, and I got to make sure I get home."}, {"time": 866, "text": "And you snap it into the training, but nevertheless, I mean, you're somebody who thinks philosophically about this world now, right?"}, {"time": 872, "text": "You're, uh, very intelligent and things deeply about the world."}, {"time": 877, "text": "So looking back, you mentioned hatred in the 14 year old kids eyes, there's death."}, {"time": 882, "text": "So the way you kind of described this whole story is like training kicks in."}, {"time": 887, "text": "This, this shit is serious."}, {"time": 890, "text": "Like this is, uh, you know, there's a reason there's a gun in, in your hand."}, {"time": 894, "text": "So there's a strategic element."}, {"time": 896, "text": "There's like, you have to get the job done."}, {"time": 898, "text": "There's a task at hand, but at the same time, if you zoom out, there's a kid who has hate for you, uh, some of those kids would probably, if they could, would kill you for the thing you stand for in the uniform."}, {"time": 912, "text": "And then there's bullets flying at you."}, {"time": 915, "text": "And then there's people that some of them you might already care for deeply are dying."}, {"time": 922, "text": "What the hell do you make of that?"}, {"time": 927, "text": "Does any of that haunt you?"}, {"time": 929, "text": "How do you think about the world having witnessed that?"}, {"time": 933, "text": "A lot of times when we would talk about it, we were there."}, {"time": 936, "text": "If I was that kid, I would want to kill that person too."}, {"time": 940, "text": "I would have hatred as well."}, {"time": 942, "text": "Imagine if in the United States tomorrow, you and I woke up and there was tanks rolling down the street from another country and they were basically imposing their rules on us, whether they thought it was the right thing to do or not, the soldiers were there and they were doing this, we would probably feel not so great about it, right."}, {"time": 960, "text": "At kind of a minimum and at a maximum, we'd be really, really pissed off."}, {"time": 963, "text": "We would fight back."}, {"time": 964, "text": "And so what you don't understand when you're in the heat of the moment is why does this person feel this way?"}, {"time": 969, "text": "And so what's very weird is, well, what happens if a year ago, US soldiers came through, they got shot at, they returned fire and they killed that kid's uncle."}, {"time": 980, "text": "You'd be pissed off."}, {"time": 982, "text": "And so you just start to understand, like we look at war very black and white."}, {"time": 986, "text": "We look at it very much from a clinical perspective."}, {"time": 989, "text": "We're going to go, we're going to go kind of invade somewhere."}, {"time": 992, "text": "We are the most dominant military in the world."}, {"time": 994, "text": "We're very good at invading."}, {"time": 996, "text": "And we will crush wherever we invade, but when you're actually on the ground, what you understand is the humanity of it all."}, {"time": 1002, "text": "And so what becomes very interesting is pretty much every veteran I know that comes back, they're some of the largest pacifists in the world."}, {"time": 1010, "text": "And I always revert back to Marcus Luttrell, who was a famous Navy SEAL, and there's a movie made about him and his story."}, {"time": 1017, "text": "He gave a speech one time that I saw and he basically said, listen, if you're a politician, your job is to be the diplomat, do everything you possibly can, not to send me and my friends anywhere, because when you send us, we're going to bring hell with us, right."}, {"time": 1032, "text": "And understand that is the business that we are in, but every single other person up until we get sent has a job to do to prevent having to send us."}, {"time": 1040, "text": "And I think that ultimately that's where you see a lot of kind of this generation that has fought in Iraq and Afghanistan that says, listen, maybe we shouldn't be running around the world being the police, maybe we shouldn't be going and invading all these different countries, because when you actually get to see firsthand what happens, it's just something that we should avoid at all costs."}, {"time": 1059, "text": "But if we have to go, or we have to actually send soldiers somewhere, understand what happens when that occurs."}, {"time": 1066, "text": "And you know, the United States is the best in the world at doing it."}, {"time": 1069, "text": "Do you think, I'm thinking about that kid with the hatred."}, {"time": 1073, "text": "Do you think there will always be hatred in the world?"}, {"time": 1075, "text": "Do you think there will always be hatred?"}, {"time": 1077, "text": "In the world, do you think, uh, from another perspective, do you think there'll be war always, is that a fundamental aspect of human nature or is that something we can escape?"}, {"time": 1088, "text": "So war, I think has like very negative connotations in terms of bullets and bombs and death and kind of just very morbid type, um, um, understanding."}, {"time": 1099, "text": "Conflict on the other hand, I think people look at and say, of course there will always be conflict, right."}, {"time": 1103, "text": "You just can't have billions of people all on the same planet without some level of disagreement, whether that's a disagreement of ideas, disagreement over physical, you know, geography, uh, or something else."}, {"time": 1114, "text": "And so I think conflict will always exist."}, {"time": 1117, "text": "The question is what form does war take moving forward?"}, {"time": 1120, "text": "And so in my mind, you know, it's starting to look a lot more clinical, right?"}, {"time": 1125, "text": "A lot more drones, a lot less soldiers on the ground, a lot more use of special forces and kind of these small, highly specialized teams rather than kind of big mechanical armies."}, {"time": 1134, "text": "Um, and then you get into like the information warfare and kind of cyber warfare and you start to understand that we're at war with a lot of people right now, right?"}, {"time": 1142, "text": "Doesn't mean we're necessarily dropping bombs, uh, on their countries."}, {"time": 1145, "text": "Doesn't necessarily mean we're sending soldiers there, but on a daily basis, we are engaged in these kind of, you know, cyber battlefields."}, {"time": 1152, "text": "And so if that's where war starts to play out, um, it, one changes the tools and tactics and techniques that, uh, we need to arm our country and other countries will arm themselves with."}, {"time": 1162, "text": "But it also changes the way that we think about war, right?"}, {"time": 1165, "text": "It seems, it sounds a lot less worrisome if I say, Hey, we're going to go to war with a country, but by the way, there's going to be no death."}, {"time": 1173, "text": "Like that doesn't sound nearly as bad as, Hey, we're going to go send 10,000 soldiers and you know, some percentage of them are going to die on the battlefield."}, {"time": 1179, "text": "And then we're going to, you know, basically pipe back videos and articles saying that American soldiers are dying."}, {"time": 1225, "text": "And, um, it's like the samurai thinking, I'm not sure what's more painful."}, {"time": 1232, "text": "If I take it to myself, like, I'm not sure what I would rather live through being stabbed, like to death, or having my identity stolen, all my money stolen, or maybe reputation destroyed, like with lies or something like that."}, {"time": 1254, "text": "That that's very interesting to think about."}, {"time": 1256, "text": "If you think about quality of life and all those kinds of things, well, one's finite, right?"}, {"time": 1261, "text": "One's the pain ends and the other is kind of a long prolonged, almost torture."}, {"time": 1265, "text": "So it's physical pain versus psychological pain."}, {"time": 1268, "text": "It's really interesting to, it's really interesting to think about."}, {"time": 1272, "text": "And I think another key piece to this, which I don't have answers to, but, but there is an element of emotion and rage in the physical violence versus again, more of that clinical, you know, information warfare."}, {"time": 1312, "text": "And so it's just very, very different."}, {"time": 1314, "text": "I think, uh, in, in the, uh, motion and response that it invokes and people when they hear about it as well."}, {"time": 1319, "text": "Given the conflict, do you think people are fundamentally good?"}, {"time": 1322, "text": "Are we all sort of like blank slates that could be evil given the environment or good given the environment, or can we kind of, is there some base that we can rely on that people, if left to their own devices will be good and trustworthy and honest, I think you have to separate out intention from action."}, {"time": 1345, "text": "So if you talk to some of the most heinous criminals in the world, they've rationalized their actions, and so you've got to ask yourself, what is the level of which they understood what they were doing, that they intended to be malicious, nefarious, um, and kind of do bad things versus the actual actions themselves."}, {"time": 1392, "text": "And you become that monster, that beast, if in the same situation, somebody walks in your house with a knife and you murder them or you kill them, now we put you up on a pedestal as a hero, and those are two very, very different responses."}, {"time": 1406, "text": "They may be just as morbid, they may be just as violent, uh, in terms of the actual actions, the intentions, the way it's perceived is very, very different."}, {"time": 1415, "text": "And so I think that, uh, as a world, we like a very black and white, clean cut, you know, good, bad, uh, I think the world's a lot more messy than that."}, {"time": 1423, "text": "And I think that, uh, a lot of times when you look at intention, it's hard for us to tell what somebody's intention is, but I've looked at a lot of, you know, people who are both considered very good and also a lot of people are considered very bad and they sound very similar in terms of the motivations for their actions."}, {"time": 1441, "text": "And so I think that it's just a really hard problem that probably doesn't have a perfect solution or an answer."}, {"time": 1446, "text": "Do you give much value to the intention or do you think it's better to look at the results of the behavior, uh, as opposed to the, the underlying ideology?"}, {"time": 1457, "text": "Underlying ideology, the underlying intention of, of the behavior."}, {"time": 1462, "text": "I think that intention gets at the question of like, are people inherently good or bad, right?"}, {"time": 1466, "text": "Is I think that they're generally inherently good and the intention is driving towards the thing that they believe is the best outcome or the best thing for them to pursue the action."}, {"time": 1477, "text": "I think is where we spend most of our time focused on."}, {"time": 1480, "text": "Um, and frankly, we actually may be a better society or, uh, kind of kinder as a humanity to each other if we spent more time looking at intention rather than action."}, {"time": 1490, "text": "Um, but again, you know, if somebody walks down the street and murders somebody, uh, it's really hard to have a conversation and it may be inappropriate for us to have a conversation about intention versus, uh, any level of, of action, right?"}, {"time": 1504, "text": "So you're one of the prominent, I would say even the faces of the, the world of cryptocurrency, Bitcoin, that whole entire world was dive straight in and ask, uh, do you think, do you consider yourself a Bitcoin maximalist?"}, {"time": 1523, "text": "I think that the way I really look at it is, uh, I work backwards off of what is the maximalism that I believe in and the world that I believe in is, uh, kind of an automated world that is run on these open decentralized protocols."}, {"time": 1539, "text": "Uh, and what we ultimately do is we return sovereignty and individualism and, and kind of, uh, personal responsibility and liberty, uh, to people over institutions."}, {"time": 1551, "text": "And what we end up doing is we end up, uh, kind of taking what has historically been a very analog or physical world economy and, uh, geographic rule."}, {"time": 1561, "text": "And we then kind of put it in the cloud and this digital economy becomes the prevalent way that we all, uh, conduct commerce, communicate, uh, et cetera."}, {"time": 1571, "text": "And so it's less about any one single technology to me, right?"}, {"time": 1575, "text": "I think that it's pretty stupid for people to, um, almost in a way, uh, put an inanimate object up for, uh, you know, some sort of obsession, uh, to me, it's much more about the ideals, the ethos, uh, and the most rational, uh, and likely path to that kind of end result or that world that I think, you know, is at this point, just a foregone conclusion."}, {"time": 1597, "text": "So the distinction there, and maybe people don't know the terminology, maximalism is basically saying, I really think this is a good idea."}, {"time": 1609, "text": "Like, uh, you know, if you prefer a certain kind of diet, it could be a keto maximalist saying like, this is probably, maybe it's not a hundred percent, but probably the diet that's healthiest for humans kind of thing."}, {"time": 1654, "text": "And you believe that sort of, uh, this moving into the cloud, uh, both the distributed nature of it, but also just the digital nature of it is something that's going to, uh, be a positive step for humanity."}, {"time": 1669, "text": "I would even take maximalism a step further, and it's not just the kind of singular viewpoint of this is the best, it's also, uh, an element of it's anti everything else."}, {"time": 1681, "text": "So, you know, take keto, for example, uh, the keto diet is not only the best diet."}, {"time": 1685, "text": "All the other diets are bad."}, {"time": 1687, "text": "And so it's, it's a very binary view of the world."}, {"time": 1725, "text": "And so what ultimately ends up happening, which is very weird in the investing world, right, it's unlikely that you and I are going to sit down and you're going to like Apple stock is the best stock and there's no other stock."}, {"time": 1734, "text": "That's worth anything."}, {"time": 1736, "text": "And, uh, and then also it's very weird if you said to me, um, you know, this stock is worth zero and that's where everything that I own, I've put on a short on one single company, right?"}, {"time": 1746, "text": "There's diversification."}, {"time": 1747, "text": "There's a much more kind of probabilistic thinking in finance in general."}, {"time": 1750, "text": "Uh, when it comes to this specific world of cryptocurrency and kind of digital assets, if you will, uh, is there's two main groups of people who are trying to build two very, very different things at the onset, but when you unpack it and you start to spend more and more time on it, you rise, they're actually trying to accomplish the same thing in two different ways."}, {"time": 1770, "text": "So Bitcoin is seen, I think, as a, uh, a digital currency, right?"}, {"time": 1773, "text": "Kind of the idea that this is going to ascend to become the next global reserve currency, it's a programmatic kind of digital currency, but it's also a programmatic kind of transparent, um, money."}, {"time": 1783, "text": "And, uh, it's essentially just 180 degrees difference than the inflationary, you know, non transparent, uh, fiat currencies that exist in the world."}, {"time": 1792, "text": "You then look at kind of everything else, right?"}, {"time": 1794, "text": "And you have a lot of smart contract platforms and various things that they're all going after at Ethereum with kind of the world computer approach, and you can kind of go down the line with all their other arguments as to what they're trying to build."}, {"time": 1804, "text": "I think the big difference just comes down to, uh, innovation versus security."}, {"time": 1809, "text": "And when you simplistically look at it via that lens, you actually understand where both people are coming from."}, {"time": 1816, "text": "When you say security, sorry to interrupt, do you mean financial security or do you mean like literally the, the, the security of the, of the particular cryptocurrency?"}, {"time": 1825, "text": "The, the technical security of a blockchain."}, {"time": 1828, "text": "So when you look at, let's say, um, Bitcoin versus Ethereum, right?"}, {"time": 1831, "text": "Bitcoin has decided in that community has decided security is the number one thing that you have to optimize for."}, {"time": 1836, "text": "So decentralization, um, over everything else in terms of transaction speeds, uh, cost, anything that you could come up with, that is, uh, something that would be important for a currency."}, {"time": 1847, "text": "The number one thing to optimize for is security."}, {"time": 1850, "text": "And as we have seen, uh, with a lot of technologies, right?"}, {"time": 1853, "text": "Facebook's, uh, Libra or now what's known as DiEM is a great example."}, {"time": 1856, "text": "Uh, not having decentralization is susceptible to the nation state."}, {"time": 1861, "text": "And so a lot of these other platforms and blockchains, uh, they say security is important, but it's not the most important thing we believe there's a trade off between, you know, a little less security and transaction speed or composability or whatever it is."}, {"time": 1877, "text": "And so take a theorem as kind of the second, uh, largest, uh, community and blockchain by market cap."}, {"time": 1883, "text": "It was created because somebody wanted to, or a group of people wanted to do something on Bitcoin."}, {"time": 1886, "text": "They felt like they couldn't do it."}, {"time": 1887, "text": "And so they said, Hey, we're going to go create something that has the smart contracts that we can then go do here."}, {"time": 1892, "text": "Again, this is technology, right?"}, {"time": 1893, "text": "And so the tribalism of like, you're right, you're wrong to me is a little childish, just in the sense of like the market is going to decide what is most valuable."}, {"time": 1901, "text": "And then when you go inside of that community, like there's a lot of dumb ideas, people are trying to build around Bitcoin, but there's also a lot of really, really great ideas that people are trying to build around Bitcoin, same thing in the Ethereum world."}, {"time": 1910, "text": "And so what you end up getting, I think, is the tribalism really comes out of the idea that there's a ticker price that is attached to all of this, right?"}, {"time": 1919, "text": "If you go back in history of technology, venture capitalists didn't sit around the table and yell and scream at each other in this like religious zealot way, right?"}, {"time": 1928, "text": "Because you bet on one type of cloud computing platform."}, {"time": 1931, "text": "And I bet on another one, right?"}, {"time": 1933, "text": "It's just the market's going to decide, we're both going to work on and try to make our successful, uh, here in the world."}, {"time": 1938, "text": "I think that the sensitivity and mainly it comes out of the Bitcoin community is that a lot of this is being funded, not only by venture capitalists and kind of professional money managers and asset allocators."}, {"time": 1949, "text": "There's also this element of including the retail investor and the public."}, {"time": 1953, "text": "And so it, whether it's through ICOs or some other forms of capital raising, um, there's arguments for it saying, Hey, look, uh, this now gives kind of the little guy, some sort of access and an ability to do it."}, {"time": 1965, "text": "But there's also arguments against it."}, {"time": 1965, "text": "Some people say, Hey, it's easier to dupe them and it's easier to run scams and kind of all this stuff."}, {"time": 1970, "text": "And so ultimately I think that, uh, crypto is this like arena of ideas."}, {"time": 1975, "text": "It is literally the war of attrition and, uh, what will end up happening is 10 years from now, you and I will talk and we're going to say, well, the market said X was valuable and Y wasn't."}, {"time": 1986, "text": "And so all of the tribalism from between, you know, here and there, uh, it's fun."}, {"time": 1991, "text": "It's, you know, engaging."}, {"time": 1992, "text": "Whatever, but ultimately it doesn't really matter because the public is involved."}, {"time": 1995, "text": "There's a lot of personalities."}, {"time": 1996, "text": "And so a lot of times we focus on the extreme personalities that do a lot of maybe, uh, pardon the French shit talking."}, {"time": 2004, "text": "And, and so we kind of focus on that, but that's not necessarily a representative of the communities involved."}, {"time": 2010, "text": "Let's talk about Bitcoin first, and then it'll help us use as a kind of comparison to Ethereum or whatever else."}, {"time": 2016, "text": "So when you think about what is money, right?"}, {"time": 2018, "text": "That's kind of the first question."}, {"time": 2019, "text": "People really kind of go down the rabbit hole on, and ultimately today, it's a belief system, right?"}, {"time": 2024, "text": "And you may believe that one currency has more value over another because it's backed by a certain military or a certain government has a monetary policy that you believe in or don't believe in."}, {"time": 2034, "text": "Um, but ultimately it's a belief system that there's nothing backing this, uh, other than, uh, a government asks you to pay your taxes in it, right?"}, {"time": 2041, "text": "And they can have a monopoly on violence, uh, in terms of they can put you in jail."}, {"time": 2044, "text": "If you don't pay your taxes, uh, they can, uh, they can, uh, they can go to other countries and they can invade and do all this stuff."}, {"time": 2051, "text": "It wasn't always like that, right?"}, {"time": 2053, "text": "It was historically a layer one technology was gold."}, {"time": 2057, "text": "And so gold was a fantastic store of value."}, {"time": 2060, "text": "You knew that if you held gold, it wasn't going to be inflated away."}, {"time": 2063, "text": "It was sound money was outside the system and no one could create more of it."}, {"time": 2067, "text": "And the reason why that's important is because that optimization for store of value served as the bedrock of the entire stack of, uh, money."}, {"time": 2075, "text": "Uh, for 5,000 years."}, {"time": 2075, "text": "And so the problem with that though, again, trade off between store of value is it was really hard to transact with, right?"}, {"time": 2083, "text": "If I came in here and I, and you said, Hey, I want a couple of ounces of gold and I had a whole bar, I'd have to literally shave off the ounces of gold."}, {"time": 2089, "text": "Uh, it's heavy to carry around."}, {"time": 2091, "text": "If you said to me, Hey, you're in one city, mail it to me, really expensive."}, {"time": 2095, "text": "You know, there's all these issues with it."}, {"time": 2097, "text": "And so ultimately what people said was, well, let's create a second layer on top of that gold in order to make it easier to transact with it."}, {"time": 2103, "text": "That gold in order to make it easier to transact."}, {"time": 2106, "text": "And so we created paper claims on the gold."}, {"time": 2108, "text": "So, Hey, don't carry around the gold in your pocket anymore."}, {"time": 2110, "text": "Put it in a vault or a bank."}, {"time": 2111, "text": "They're going to issue a paper claim."}, {"time": 2113, "text": "Now you and I can trade these paper claims around."}, {"time": 2116, "text": "And at any point, if you want the gold, you just show up and you say, Hey, give me three ounces of gold or two bars or whatever."}, {"time": 2121, "text": "And so that actually made the store of value."}, {"time": 2124, "text": "It was allowed that to be the anchor and kind of the most important part, the security of your, of your purchasing power, but now it became easier to transact."}, {"time": 2131, "text": "And then eventually we built layers even on top of that."}, {"time": 2132, "text": "So everything from electronic money, uh, kind of electronic UCIPS, all the way to credit and other systems on top of that gold 1971 comes around and obviously we D peg from that gold, right?"}, {"time": 2142, "text": "And it was a temporary measure at the time."}, {"time": 2144, "text": "We ended up not going back to it."}, {"time": 2145, "text": "And so what you moved or transitioned from was sound money, which was outside the system, no one could create more to now the government had full control."}, {"time": 2152, "text": "They could create as much as they wanted to."}, {"time": 2154, "text": "They tried to be responsible and disciplined, but obviously hard to do."}, {"time": 2157, "text": "Sometimes we've been really good at it."}, {"time": 2158, "text": "Sometimes we've been less good at it."}, {"time": 2159, "text": "And then you go around the world and some countries have absolutely sucked at it and some have been good at it."}, {"time": 2164, "text": "And so when you look into the Bitcoin world, I think that when you look at this optimization for security, similar to gold store value, people hold it."}, {"time": 2172, "text": "Purchasing power has gone up a lot year over year."}, {"time": 2175, "text": "It's like a 200% year over year compound annual growth for over a decade."}, {"time": 2179, "text": "And so you measure this in kind of the us dollar exchange price, et cetera."}, {"time": 2183, "text": "But there's still a lot of people who will yell and scream about it's slow."}, {"time": 2187, "text": "It's costly, right?"}, {"time": 2188, "text": "All the things around those transactions that are obstacles or challenges."}, {"time": 2192, "text": "And so there's basically two schools of thought, and this is where we kind of get into the bifurcation."}, {"time": 2197, "text": "Some people just said, Hey, this technology is antiquated."}, {"time": 2200, "text": "We can't use it."}, {"time": 2202, "text": "Uh, and so what we're going to do is we're going to go build something new."}, {"time": 2205, "text": "And so you go get, you know, kind of all of the various versions there."}, {"time": 2208, "text": "The Bitcoin community says, no, just like gold had paper claims and other things built on top and layer two, three, four, five, we're going to do that here."}, {"time": 2215, "text": "And so they've already started to build kind of this layer two where it's easier to transact."}, {"time": 2219, "text": "It's cheaper, it's faster, et cetera."}, {"time": 2222, "text": "And so I actually think that both of those worlds are going to coexist in the future."}, {"time": 2227, "text": "The big question is just which one has more importance, right?"}, {"time": 2231, "text": "So again, get out of binary."}, {"time": 2233, "text": "It's just probabilistically."}, {"time": 2234, "text": "And so my personal belief is that the security that the store of value component as the bedrock for a monetary system is essential, right?"}, {"time": 2243, "text": "Like that is the most important thing because you can always improve the other components, but you can't go back and fix that kind of core piece."}, {"time": 2252, "text": "So money, money's a, an idea that we all it's like an emergent idea that we believe in."}, {"time": 2259, "text": "You're saying that security is one of the most fundamental catalysts or fuels for that idea to sort of take hold and be stable and sort of take over the world."}, {"time": 2270, "text": "The other stuff is really nice to have, but if you don't have the security, you're not going to, like, it's not going to spread in the viral sense in, in our human brains."}, {"time": 2280, "text": "Well, and especially in light of the kind of the macro economy, right?"}, {"time": 2284, "text": "So like, what's so fascinating about the last 12 months is, um, in investing in general, the best returns, right?"}, {"time": 2292, "text": "I kind of put that in air quotes a little bit is something that is different than everything else and right."}, {"time": 2297, "text": "So being different and wrong just means you're an idiot, right?"}, {"time": 2300, "text": "Being different and right means that that's where kind of the outsize returns are."}, {"time": 2303, "text": "And so if you look around the world at currencies today, they're all the same."}, {"time": 2307, "text": "They're all inflationary, unlimited supply controlled by a government done and decisions made in a very non transparent process."}, {"time": 2315, "text": "And what we've watched is the manipulation of all of those currencies over the last 12 months in direct contrast to that is this thing, Bitcoin, which is outside of the system, has a finite supply, transparent and programmatic monetary policy."}, {"time": 2327, "text": "And so when you see those two systems kind of, um, in comparison to each other in the United States, there's a lot of people who say the dollar works great for me."}, {"time": 2336, "text": "I can go to the ATM, I can get out physical cash."}, {"time": 2340, "text": "If I want to swipe a card, I could do that."}, {"time": 2342, "text": "My money in my bank doesn't lose 50% of its value in a day in terms of purchasing power."}, {"time": 2346, "text": "Like the dollar's pretty good."}, {"time": 2349, "text": "When you go to other countries, that might not be the case."}, {"time": 2351, "text": "And so I do think that there's a kind of a relative analysis that goes on here."}, {"time": 2356, "text": "If you compare Bitcoin to the dollar, there's all kinds of arguments to make that the dollar is better as a medium of exchange today."}, {"time": 2362, "text": "But if I go and I tell you, well, what about in these kind of extreme examples of Venezuela, Zimbabwe, Turkey, et cetera."}, {"time": 2370, "text": "And so I think that that's kind of one perspective to view this through is security versus all of the innovative components of a medium of exchange, et cetera."}, {"time": 2378, "text": "The second thing, though, that I think is really important is around censorship."}, {"time": 2383, "text": "And so when you look at, again, every currency in the world today, every single financial service, they're highly susceptible to censorship."}, {"time": 2391, "text": "And actually, I would argue the United States is in the business of censorship in terms of how many countries around the world do we sanction and cut them off in either a minimal or a very material way from the global financial system."}, {"time": 2404, "text": "So when you define it, when you talk about censorship, do you mean just the censoring your ability to operate freely in the world?"}, {"time": 2413, "text": "Well, look at it a little bit differently, which is that the United States has kind of the American superiority because we have the bombs, the bullets, the soldiers and that military might."}, {"time": 2423, "text": "We basically impose our will around the world."}, {"time": 2427, "text": "And so there's a very strong argument to be made that there are certain countries around the world that are being sanctioned, that the people of those countries did nothing wrong."}, {"time": 2435, "text": "Now, the governments are bad, right?"}, {"time": 2439, "text": "In terms of the way that you and I would look at democratic rule or communism or whatever it is, but the people are being hurt as well."}, {"time": 2448, "text": "So there's a whole group of people who would just argue, listen, we shouldn't hurt anyone at the expense of punishing one person or a group of people."}, {"time": 2455, "text": "There's other people argue against that."}, {"time": 2455, "text": "But I do think that if you really kind of zoom out and you say, I'm going to take myself out of the Western worldview, and I'm simply going to look at this as we're all part of the human race, it's censorship."}, {"time": 2465, "text": "And there might be an argument for censorship, but there also might be an argument against the censorship."}, {"time": 2473, "text": "And so what Bitcoin does, as that specific kind of payment network is it says anyone in the world with an internet connection, I don't care where you were born, what language you speak, what religion you are, your wealth status, your education status, none of it matters."}, {"time": 2487, "text": "If you have an internet connection, you're not going to care."}, {"time": 2490, "text": "If you have an internet connection, you can plug into this monetary system."}, {"time": 2494, "text": "And you can move value around the world to anyone else without asking for permission."}, {"time": 2498, "text": "And in the United States, we basically have that ability in the US dollar kind of traditional banking system, I can pretty much send money to almost anyone I want unless they're a really bad person that's on some list or something."}, {"time": 2511, "text": "Most people in the world don't have that capability."}, {"time": 2511, "text": "And so what you're essentially doing is you're democratizing access to a true store value, and a medium of exchange, right."}, {"time": 2519, "text": "And so what you see in many of these countries is that when their currency starts to fail, the first thing that a government or a group of people in power and influence do is they lock the citizens into the currency with capital controls."}, {"time": 2536, "text": "Because if you let them out, it exasperates the problem."}, {"time": 2542, "text": "And so now what we're seeing is we basically are giving a tool to billions of people around the world that is a peaceful protest."}, {"time": 2550, "text": "You and I had no say at all."}, {"time": 2550, "text": "When not only the Federal Reserve and elected officials here in the United States, but central banks around the world over the last 12 months decided to create trillions of dollars and injected into the monetary system."}, {"time": 2564, "text": "They have arguments, and some of them are very good arguments as to why they should do that."}, {"time": 2567, "text": "They're trying to mitigate short term pain."}, {"time": 2569, "text": "Long term, they'll figure out the other issues, right?"}, {"time": 2571, "text": "They have very kind of elaborate and well articulated kind of viewpoint as to why they're doing it."}, {"time": 2578, "text": "But you and I had no say."}, {"time": 2578, "text": "And so when you start to look at, we have a very small group of people in this world, both in our country and in countries around the world that make these decisions that have very, very far reaching kind of impact."}, {"time": 2592, "text": "And on top of that, in many cases, there's actually not that much kind of accountability."}, {"time": 2596, "text": "Because usually these are not elected officials who are making some of these decisions, these are appointed."}, {"time": 2601, "text": "And you can argue that, hey, we elected somebody who appointed them."}, {"time": 2604, "text": "But at the same time, that accountability isn't quite there."}, {"time": 2608, "text": "And so I think ultimately, when you just back out, you say, you know, what is Bitcoin?"}, {"time": 2611, "text": "Why is it important to the world?"}, {"time": 2613, "text": "It is giving access to anyone in the world with an internet connection to a store of value and a monitoring network that allows them to peacefully protest and to opt out of a system that pretty much is not working for majority of people in the world."}, {"time": 2631, "text": "So it's moving the power from these centralized places, sometimes unelected to the individuals and to the people."}, {"time": 2639, "text": "So the dollar does seem to work for Americans and for many people in the world."}, {"time": 2644, "text": "But you kind of have a vision, you paint a picture of a future where potentially we move to cryptocurrency."}, {"time": 2651, "text": "So what kind of trajectory do you see where Bitcoin can become the main currency in the world, or at least cryptocurrency become the main way of storing value in the world and basically overtake the dollar?"}, {"time": 2665, "text": "Yeah, so I always go first to we don't need to have competition like in terms of like a direct competition between the dollar and Bitcoin, right?"}, {"time": 2673, "text": "If you look at most technologies in the world, the really valuable ones are actually market expanding technologies, rather than simply just market share stealing technologies, right."}, {"time": 2684, "text": "So if you look at Uber, for example, Uber didn't just say, Hey, I'm gonna go take out all the taxis, right?"}, {"time": 2689, "text": "It actually drastically expanded the market for people now there's literally millions of people in the United States who don't have cars because they use Uber, right."}, {"time": 2695, "text": "And so I think that Bitcoin is very similar in that, yes, there is a component of medium of exchange, in terms of the dollar."}, {"time": 2702, "text": "But also there is this component of just store value assets in general."}, {"time": 2706, "text": "And so when you start to look at Bitcoin, specifically, I think that what you're seeing is you're seeing a generational gap, where young people say, I grew up with a phone in my hand, I'm digitally native, the whole idea of going to the bank and sending a wire, or going to an ATM and getting physical cash is an antiquated idea in their mind, right?"}, {"time": 2724, "text": "I one time asked my brother, he's 24 years old."}, {"time": 2727, "text": "And I said, Hey, how do you send money to your friends?"}, {"time": 2730, "text": "And he gave me one answer, which I expected, which was Venmo."}, {"time": 2732, "text": "And the second answer, I didn't expect he said Uber."}, {"time": 2735, "text": "I said, How do you send money via Uber?"}, {"time": 2735, "text": "He said, Well, we get in a car together."}, {"time": 2738, "text": "And at the end, we split the ride."}, {"time": 2740, "text": "And so again, you and I have probably both done that."}, {"time": 2744, "text": "But I never thought of it as a way to send money to each other."}, {"time": 2747, "text": "And so it is a psychological difference between even me, who's only, you know, a decade older than him or so, and his peer group."}, {"time": 2754, "text": "And so I think as we're watching kind of Bitcoin continue this ascent, ultimately, what we're seeing is an entire generation of kids are saying, Listen, if I look at financial assets across the board, I have stocks, I have bonds, I have currencies, and I have commodities, I know that bonds, from a real rate return perspective, is flat to negative, right?"}, {"time": 2776, "text": "I'm gonna make no money on this, because I have a belief that my dollar is being devalued."}, {"time": 2805, "text": "If you do not make that same stock market in gold, the stock market is down since 1971."}, {"time": 2812, "text": "And so is it so much that the stock market is accruing true value?"}, {"time": 2817, "text": "Or is it that the underlying currency in which it is denominated in is being devalued?"}, {"time": 2820, "text": "And I was being devalued in a very disciplined way, right, in terms of it's not like it went 50% devaluation in a short period of time, but it's still being devalued."}, {"time": 2830, "text": "And so I think that people are waking up to this idea that a traditional 6040 type global portfolio doesn't work anymore, right?"}, {"time": 2836, "text": "40% of it in bonds is just not going to get it done."}, {"time": 2841, "text": "And so when you start to look at this, people first look at Bitcoin via two main ways, in my opinion, they look at it one as a store value, should I actually go and put some of my wealth there use it as a savings technology, right?"}, {"time": 2854, "text": "We ask people in the traditional world, if you're a teacher, a fireman, an accounting, you know, mid level manager, we say, hey, go do your job, be best in class as a fireman or as a teacher."}, {"time": 2864, "text": "And then Oh, by the way, you have to be a professional investor as well."}, {"time": 2865, "text": "Because if you just put your dollars in your bank account, you're literally going to have your wealth devalued away over time."}, {"time": 2870, "text": "So you can't just save you have to invest."}, {"time": 2874, "text": "That is a really tall task for people, they have a hard enough time just doing their job, right?"}, {"time": 2878, "text": "Taking care of their family, right?"}, {"time": 2880, "text": "Now they got to go be an investor."}, {"time": 2880, "text": "So I think savings technology for Bitcoin standpoint is, if you buy satoshis or Bitcoin, over time, it will increase from a purchasing power standpoint, because there's a fixed supply and demand continues to rise."}, {"time": 2893, "text": "But then you start to look at well, what other assets do people put in their portfolios, whether it's art, it's real estate, precious metals, or something else."}, {"time": 2903, "text": "Most of those assets are not because people actually think that they're going to go up in value over time, they're using the store of value."}, {"time": 2909, "text": "The reason why somebody buys gold is because the store of value, right historically, that's a narrative driven type asset, though, right?"}, {"time": 2920, "text": "We tell people it's scarce, we tell people that it is a store of value."}, {"time": 2923, "text": "When you look at it, though, we don't know how much gold exists in the world, we have a good estimate, right?"}, {"time": 2928, "text": "But we don't actually we can't prove how much there is."}, {"time": 2931, "text": "We don't know how much is coming out of the ground every day."}, {"time": 2933, "text": "Again, great, fantastic estimate."}, {"time": 2933, "text": "But we can't prove it."}, {"time": 2937, "text": "And we don't know what the total supply and that's what you mean by narrative driven, we can't really prove it, like mathematically, we you I and everyone else in the world has lived in a narrative driven world for the last couple of decades, right?"}, {"time": 2946, "text": "And what the internet and digital technologies have done is it opened up the possibility and the desire from people to have a world now where I can validate things."}, {"time": 2954, "text": "So when I see that headline, I want to see you say whatever happened to the news, if you're the subject of the news, rather than have somebody else tell me the story."}, {"time": 2966, "text": "If I see that you say something is scarce, prove to me that it is scarce."}, {"time": 2969, "text": "And so I think that's kind of a psychological shift, the younger generation is starting to understand because ultimately, you and I probably grew up in a world where parents could tell us the story."}, {"time": 2979, "text": "And we just believed it."}, {"time": 2981, "text": "You know, dad or mom says it must be true."}, {"time": 2981, "text": "If my brother heard a story, what does he do?"}, {"time": 2985, "text": "He goes to Google and he looks it up."}, {"time": 2987, "text": "Randy comes back and usually tells my parents, oh, you got the story wrong, right."}, {"time": 2990, "text": "And so I think that that that provability or that that validation ends up becoming really, really important."}, {"time": 2996, "text": "And so, you know, look at something like gold, I think that people are drastically underestimating the shift that's underway right now."}, {"time": 3003, "text": "Gold is one down in value since April, or I'm sorry, August of 2020."}, {"time": 3008, "text": "And so in a timeframe where central banks have had historic quantitative using literally $6 trillion in the United States, the one asset that historically has been the best store of value and has, you know, in 2008 financial crisis hit an all time high based on the government response has actually suffered for a main part of this financial crisis."}, {"time": 3032, "text": "You then look at central banks around the world who have been very large holders of gold for a long time and net buyers on a monthly basis."}, {"time": 3037, "text": "For multiple months, over the last six months, they've been net sellers of gold."}, {"time": 3041, "text": "And then you start to look at jewelry demand."}, {"time": 3045, "text": "So the actual non monetary value of gold, and that demand for gold jewelry peaked in 2013, and has continued to fall since."}, {"time": 3053, "text": "And so what you start to say to yourself is take just the asset of gold, which about $10 trillion market cap, and you say, Okay, well, jewelry demand continues to fall, even if it's at a slight rate, but it's continues to contract."}, {"time": 3065, "text": "You have central banks that now at some times are net sellers and sometimes net buyers, right?"}, {"time": 3071, "text": "So okay, again, contraction there."}, {"time": 3071, "text": "And then from the investment standpoint, the actual price, the daily price of this continues to fall, which is a signal that there's a contracting demand from an investment perspective."}, {"time": 3081, "text": "That's 93% of all use of gold, only 7% of it's used for actual technology and metal conduction and things like that."}, {"time": 3089, "text": "And so you have a $10 trillion asset that it appears and again, maybe data changes, and I'll change my mind and other people change their mind, but it appears is on the decline."}, {"time": 3098, "text": "And so if that happens, you're going to get the contraction of a $10 trillion asset, where's all that value go."}, {"time": 3103, "text": "And what you're seeing is at the same time that that asset is contracting, you're also seeing a massive influx from not only retail investors, not only kind of the wealthy and the elite, but also from financial institutions, corporations, pension funds, etc."}, {"time": 3118, "text": "into this kind of digital sound money."}, {"time": 3124, "text": "So you're saying that there's a kind of shift from gold to Bitcoin, because they have a lot of the same properties, except one is in the physical space, the other is in the digital space."}, {"time": 3157, "text": "They'll actually agree on the solution that sound money is the solution where they differentiate is the gold communities believes that it's the analog application of sound money, right?"}, {"time": 3167, "text": "The physical gold, that is the solution."}, {"time": 3170, "text": "The Bitcoin community believes the digital application of sound money, Bitcoin, can you define sound money, by the way, someone is just outside the system, and no one can create more of it."}, {"time": 3179, "text": "So nobody controls it."}, {"time": 3179, "text": "This is scarcity is fundamental."}, {"time": 3181, "text": "Exactly why scarcity important in money?"}, {"time": 3186, "text": "I think scarcity just has this very high correlation to value across all assets, not just money, right?"}, {"time": 3189, "text": "Money happens to be the unit of account that we use in terms of daily commerce."}, {"time": 3196, "text": "But whether it is, you know, as we're seeing now, sneakers, or you know, whatever it is, scarcity, ultimately, is that signal of value, I think, and that's just been the way that humans derive value for literally, you know, thousands and thousands of years."}, {"time": 3211, "text": "Yeah, I gotta say, that's my view on life and love in general, is scarcity is what makes it valuable."}, {"time": 3218, "text": "People talk about immortality."}, {"time": 3220, "text": "You know, I would like to be immortal, but it does, it does seem that when you let go of the finiteness of life, I feel like that meals and the experiences you have get devalued significantly, like, the longer you live, the less value there are in infinity, if you live forever, I worry that all the meaning will dissipate."}, {"time": 3245, "text": "And the same thing with love, I think criticism of sort of dating culture and all that kind of stuff."}, {"time": 3251, "text": "Like I haven't had shocking revelation that I've never been on a tinder date or any of those things."}, {"time": 3255, "text": "I believe that scarcity in dating and interaction is like, intensifies the value of when the interactions do happen."}, {"time": 3264, "text": "So, when they like when love does happen."}, {"time": 3268, "text": "And so in that sense, there's something magical about scarcity in the more subjective psychological social world, as well."}, {"time": 3274, "text": "And perhaps money is just another version of that, right?"}, {"time": 3278, "text": "It's just it's all about the stories and ideas we tell ourselves."}, {"time": 3283, "text": "I think they're actually more interconnected than you're giving it credit for, right?"}, {"time": 3286, "text": "Which is, what is money?"}, {"time": 3286, "text": "Money is time, ultimately, right?"}, {"time": 3289, "text": "The pursuit of the acquisition of money, right, of whether it's a currency or true money, is because that should give you more time, right?"}, {"time": 3300, "text": "And that's what would give you more time."}, {"time": 3304, "text": "And so one of my favorite movies ever is, and it's funny, because Justin Timberlake is in it, is this movie in a lot of me, I lose most people at that point, in time, in time."}, {"time": 3314, "text": "And basically, the premise of the movie is that everyone has a clock that is embedded into their arm."}, {"time": 3321, "text": "And so if you go to work, you basically put your arm underneath when you leave, and there's time that's deposited into your clock."}, {"time": 3328, "text": "And if your clock ever hits all the arrows, you're dead, you die on the spot."}, {"time": 3331, "text": "And so there's a number of scenes where people are basically running, you know, to get to you, and I give you a little bit more time so that you can get to work on Monday, and then you work to acquire time."}, {"time": 3343, "text": "And so basically, time becomes this currency."}, {"time": 3343, "text": "But what becomes very fascinating about it is there are sections in society, where literally, there's physical places, if you only have, let's say, 72 hours or less, you're allowed to go to Section One."}, {"time": 3357, "text": "Section Five, though, is because you have years and years and years on your clock."}, {"time": 3360, "text": "And in this movie, everyone at the age of 25 freezes from a biological aging standpoint."}, {"time": 3368, "text": "So everyone stays the same, but you may have lived for 1000 years."}, {"time": 3372, "text": "And so what becomes so fascinating about it is that rich people have time, poor people do not have time."}, {"time": 3381, "text": "And so in it, Justin Timberlake, the main character at one point, essentially acquires a bunch of time, and he's able to go to one of the higher levels."}, {"time": 3387, "text": "And now he's attending all these galas and, you know, poker nights and all this stuff."}, {"time": 3392, "text": "And one of the first things that he learns is that in the lower end of society, everyone is running everywhere at all times in the movie, because time is so finite, and it is so scarce."}, {"time": 3406, "text": "And so therefore, why would I walk down the street, I must run down the street."}, {"time": 3409, "text": "In the highest level of society, no one runs anywhere."}, {"time": 3414, "text": "And in fact, if you run, you are seen as lower class."}, {"time": 3418, "text": "Yeah, because wealth is time."}, {"time": 3418, "text": "And so that movie is, you know, it's got a ton of kind of things that you can pull out of it, but to me is the perfect epitome of money is time."}, {"time": 3425, "text": "And so when you start to think about the acquisition of money, right, it goes to this whole idea of time billionaire."}, {"time": 3434, "text": "And I know that there's probably a lot of people who've heard about this already."}, {"time": 3440, "text": "But if you think of a million seconds, it's about 11 days, a billion seconds is 31 years."}, {"time": 3444, "text": "And so if I said to somebody, you have to switch lives with Warren Buffett, would you do it?"}, {"time": 3454, "text": "Some people would say, Sure, that'd be their initial reaction."}, {"time": 3458, "text": "But you got have to be you know, 92 years old, is the money worth the lack of time?"}, {"time": 3461, "text": "Most people would say no, right?"}, {"time": 3466, "text": "And there's this guy, Graham Duncan, who really articulated this well."}, {"time": 3468, "text": "And ultimately, what ends up happening is you rest time is more valuable than the money."}, {"time": 3475, "text": "But the you acquire the money to gain more time."}, {"time": 3475, "text": "And the reason is valuable is because of the scarcity of time."}, {"time": 3480, "text": "We currently have the by the biology, the physics means that this is not just the narrative we tell ourselves, maybe it is, I don't know, but it feels like pretty sure we're mortal."}, {"time": 3493, "text": "And in that sense, the scarcity there gives value to time, it's fascinating to think about all the thought experiments here of if that could actually be on the economy, if you can actually convert time in a frictionless way to money."}, {"time": 3513, "text": "Well, and if you start to pull on this a little bit and say, okay, a young person today, let's say somebody in their 20s, has about 2 billion seconds left in their life, right, kind of 60 years, give or take, based on life expectancy."}, {"time": 3521, "text": "They usually, until they start to understand this concept, think of wealth in dollar terms."}, {"time": 3531, "text": "But dollars are being devalued."}, {"time": 3531, "text": "And so you know, a million dollars doesn't get you what it used to get, right is kind of an old adage."}, {"time": 3540, "text": "And so what you're doing is you're pursuing something that ends up losing value."}, {"time": 3543, "text": "And so it's the constant rat race, it's how do I constantly try to get more?"}, {"time": 3551, "text": "How do I get more dollars?"}, {"time": 3553, "text": "Because even if I say to myself, you know, I'm going to retire when I get $100,000."}, {"time": 3555, "text": "When I get the $100,000, the $100,000 five years from now doesn't buy me what I thought it did."}, {"time": 3563, "text": "So now I need 500,000 or 200,000 or a million or whatever the number is."}, {"time": 3567, "text": "And so ultimately, what ends up occurring is that the Bitcoin community and many people in kind of this idea of sound money is you want to be able to acquire an asset that not only will hold the value, right, the store of value over time, but it will actually appreciate over time."}, {"time": 3585, "text": "And so when you look at something like Bitcoin against the dollar against other types of assets, all of these assets are down compared to Bitcoin, right?"}, {"time": 3591, "text": "Now, some of that's just in the early days of kind of the pricing of an asset, you go from very small to something much larger."}, {"time": 3598, "text": "But now what you start to look at is well, if you have a finite supply of something, what ends up happening is people begin to value it more."}, {"time": 3605, "text": "And so in a world where dollars are infinite, and other fiat currencies are infinite, Bitcoin becomes very, very interesting, very special, and something that is very aspirational."}, {"time": 3617, "text": "And so I think that's where you're starting to see people say, wait a second, this is something where that finite, secure store of value is essential to wealth generation and preservation over a long period of time."}, {"time": 3633, "text": "And if Sam Harris is right, that free will is an illusion."}, {"time": 3633, "text": "This is really interesting to think about."}, {"time": 3637, "text": "Maybe time is a kind of blockchain, because you can't change anything."}, {"time": 3642, "text": "And then the physical space time of the universe is a ledger."}, {"time": 3646, "text": "So maybe it won't be Bitcoin that replaces gold, maybe it'll be time, once we crack open that, in fact, the universe is fully deterministic."}, {"time": 3663, "text": "So maybe that's what like Eric Weinstein is afraid of, once you figure out the theories of everything of physics, we'll be able to then start trading, create a market out of like the very fabric of reality."}, {"time": 3675, "text": "And that way break it."}, {"time": 3679, "text": "Well, if you look at infinite inflationary type currencies, you can't do that, right?"}, {"time": 3685, "text": "Because it constantly is losing value."}, {"time": 3687, "text": "When you look at a finite asset, again, that has the provability of the actual finite element to it."}, {"time": 3691, "text": "Ultimately, the wealth is that marketplace."}, {"time": 3696, "text": "And so, you know, I always kind of try to highlight for people, the top 55% of Americans understand something that the bottom 45% don't, they invest, right, the bottom 45% consume the top 55% invest."}, {"time": 3711, "text": "And that's why we have a wealth inequality gap."}, {"time": 3716, "text": "And it continues to get wider and wider and wider is because the people who are holding the devaluing assets, and saving are watching their wealth be devalued away."}, {"time": 3726, "text": "And there's arguments and controversy over how fast that's happening, but it's happening."}, {"time": 3731, "text": "The people who are holding the assets that have any level of scarcity, right, real estate may not be finite, but it's scarce, right?"}, {"time": 3738, "text": "Art may not be finite, but it's scarce."}, {"time": 3738, "text": "Gold may not be finite, but it's scarce."}, {"time": 3742, "text": "Those assets continue to appreciate against the devaluing currency."}, {"time": 3746, "text": "And so when you then say, No, I have complete finite supply, with provability, and this transparency around it, where everyone knows how much is there and what where it's going."}, {"time": 3758, "text": "And now all of a sudden, you and I can transact back and forth that value."}, {"time": 3765, "text": "And it is a representation of time."}, {"time": 3765, "text": "Because what I can essentially do is if I gather or acquire more of that wealth, I then can apply leverage to my life."}, {"time": 3771, "text": "I can use machines, humans, or some other resources."}, {"time": 3777, "text": "And basically now free up my time."}, {"time": 3785, "text": "Yeah, and it's not fun about the way you are trading time."}, {"time": 3787, "text": "Maybe it's a little bit indirect, but maybe not."}, {"time": 3787, "text": "So just because I brought up Eric and you're on Twitter, I'd love to hear your opinions."}, {"time": 3795, "text": "I talk to him a lot."}, {"time": 3795, "text": "He seems to have stepped into the beautiful dance of human communication and the social dynamics that is the Bitcoin cryptocurrency community."}, {"time": 3806, "text": "Do you have thoughts on gauge, theoretic concepts, conceptualization of the world, or just Eric in general?"}, {"time": 3813, "text": "He's got a lot of love in his heart, and he's got a grace in the way he communicates."}, {"time": 3820, "text": "But he's also loves to play with ideas and seems to have touched a sensitive point with the Bitcoin community."}, {"time": 3829, "text": "Is there anything you could say that's hopeful, inspiring about that whole dynamic that went down?"}, {"time": 3836, "text": "So I don't know all the details."}, {"time": 3836, "text": "But what I will say is I've listened to a number of his podcasts, and him and there's a whole bunch of people like him."}, {"time": 3843, "text": "I basically put them in the bucket of they're an independent thinker who are courageous enough to speak their truth, whatever that may be."}, {"time": 3850, "text": "They are humble enough to revisit their ideas and say, I got this right, I got this wrong information change, I'll change my mind."}, {"time": 3863, "text": "Obviously, a sign of intelligence to be able to do that type of stuff."}, {"time": 3865, "text": "And I actually think that one of the most scarce things in our society are those independent thinkers who are able to do all this."}, {"time": 3870, "text": "Speaking of scarcity."}, {"time": 3873, "text": "And so to me, I put Eric and the whole host of other people kind of, if you look at like the intellectual dark web is kind of a label that's been used."}, {"time": 3880, "text": "They're actually some of the most important people in our society, because they're the people who are willing to stand up against the mass kind of thought process."}, {"time": 3890, "text": "They're willing to talk about things that others may think are taboo, right?"}, {"time": 3894, "text": "They're willing to change their mind, which all of a sudden has become a bad thing rather than a good thing."}, {"time": 3900, "text": "And so when I see the exploration of ideas in public, I actually think that those are the people who are most open to the kind of VM it blowback as well."}, {"time": 3912, "text": "Because that's part of what they're doing is that they're eliciting, hey, I'm going to throw an idea into the arena."}, {"time": 3918, "text": "If it doesn't get attacked, they actually may be more nervous than if there is some level of, you know, kind of war of attrition, if you will."}, {"time": 3923, "text": "And so what I've seen with a number of the people who have done this, everyone from some of the best, you know, hedge fund managers and kind of money managers in the world, all the way to what I'll consider some of the most intellectual people in the world is they play with these ideas."}, {"time": 3937, "text": "And they play with the ideas and they play with them and they put them and they all arrive at the same conclusion."}, {"time": 3942, "text": "And sometimes it takes a month, sometimes it takes years, but they arrive at this Bitcoin thesis."}, {"time": 3945, "text": "And what's so interesting about it is it highlights something that many people view as a bug."}, {"time": 3952, "text": "But I think people in the Bitcoin community view as a feature, which is that community."}, {"time": 3956, "text": "And so what ends up happening is when you have something that is as ambitious as creating a global reserve currency doesn't mean needs to unseat any of the existing ones, but become the global reserve currency of the internet, right, this digital economy, you need shepherds of it."}, {"time": 3972, "text": "And so just like a technology company wants to find those loyal fans that are willing to go out and market and word of mouth and, and kind of not only promote it, but also protect it."}, {"time": 3982, "text": "This technology that is this decentralized thing, which uses a financial incentive in order to elicit the buy in, not from a financial perspective, but from a mental energy standpoint, has built one of the most rabid, powerful and engaged communities on the internet."}, {"time": 4004, "text": "And what ends up happening is those people have thought more about these ideas, and actually challenged those ideas more than anyone else in the world."}, {"time": 4012, "text": "And so I've got a lot of folks who will just say, there's this guy Marty Bent, who will talk all the time about the Bitcoin critics haven't done their homework in a lot of cases."}, {"time": 4022, "text": "So they show up and sometimes it's super intellectual, lazy arguments, sometimes actually very well thought out arguments, you know, on the counter to the Bitcoin thesis."}, {"time": 4030, "text": "But ultimately, what ends up happening is you're talking to somebody who's an expert, they've been thinking about for five, seven, eight, 10 years, right?"}, {"time": 4038, "text": "They've gone through every simulation you possibly can."}, {"time": 4040, "text": "And they show up with data, examples, and responses."}, {"time": 4045, "text": "Now, they're not always right."}, {"time": 4045, "text": "But they've just done the work."}, {"time": 4047, "text": "And so what I actually like about folks like Eric and others is as they're kind of going through this journey, they're incredibly smart, right?"}, {"time": 4053, "text": "And they provide, or they apply a lot of intellectual rigor to some of these arguments."}, {"time": 4061, "text": "And so what it does is what does it do?"}, {"time": 4061, "text": "It's a marketplace."}, {"time": 4063, "text": "It keeps people honest."}, {"time": 4063, "text": "Let me sort of make a few comments."}, {"time": 4068, "text": "So you're exactly right."}, {"time": 4070, "text": "Maybe the blowback is part of the mechanism that actually develops these ideas and so on."}, {"time": 4074, "text": "I do want to kind of speak to a little bit of the toxicity that I've experienced in the Bitcoin community."}, {"time": 4081, "text": "I kind of see it, the Bitcoin community, I think you paint a really nice picture, which I kind of see it as an immune system that protects against sort of the viruses that are bad ideas."}, {"time": 4090, "text": "That said, the immune system can destroy a body, right?"}, {"time": 4097, "text": "And the thing you mentioned about Eric and maybe about myself, and in general, just people exploring ideas, is there is a Dunning Kruger effect, which is when you first start exploring ideas deeply, you have an overblown level of confidence about like how much you understand."}, {"time": 4119, "text": "And that's actually the process about learning, then you realize you don't understand much."}, {"time": 4122, "text": "What I've noticed with the Bitcoin community is they're not as patient with the basics of the Dunning Kruger effect."}, {"time": 4129, "text": "Like if I step in and make declarative statements about Bitcoin, like I, you know, I read a long time ago, the white paper, like at the cursory level, I felt that I understand the technology, this is basic intuitions."}, {"time": 4148, "text": "You know, I didn't think about the social dynamics."}, {"time": 4151, "text": "I didn't think about any like financial implications and a lot of the deep, actually the ongoing innovations and all that kind of stuff."}, {"time": 4157, "text": "But I thought I understood that technology."}, {"time": 4160, "text": "And so I step in and make declarative statements."}, {"time": 4162, "text": "I think those are the first time you say, okay, what's the role of Bitcoin in the world?"}, {"time": 4165, "text": "You start thinking about it deeply."}, {"time": 4168, "text": "And then you make statements."}, {"time": 4168, "text": "The toxicity that you get in those first few statements is really off putting to me."}, {"time": 4176, "text": "I'm somebody that tries to communicate love and live that with everything I do."}, {"time": 4178, "text": "And there is a level of disrespect that I've experienced, not directly just observing others, people have been mostly kind to me."}, {"time": 4188, "text": "And I appreciate that."}, {"time": 4191, "text": "But if you're going to criticize me about my exploration of ideas in Bitcoin, you have to also acknowledge that I'm a human being that got like a PhD in stuff."}, {"time": 4202, "text": "Like I did some hard shit that it could be in farming or it could be in whatever."}, {"time": 4206, "text": "Like I've lived life and I've really thought deeply and I really care."}, {"time": 4209, "text": "Like I know a lot of shit."}, {"time": 4212, "text": "And it's possible that I actually have a lot of ideas that you can learn from."}, {"time": 4217, "text": "Now, if it's agriculture, fine."}, {"time": 4217, "text": "Or if it's artificial intelligence, fine."}, {"time": 4222, "text": "Like I know what I'm talking about, about certain things."}, {"time": 4225, "text": "And I could be wrong about a lot of things."}, {"time": 4227, "text": "And there's like an exchange of ideas that makes that mechanism that you talked about more efficient."}, {"time": 4235, "text": "Sometimes when the blowback is too strong too early on, the development of ideas is just inefficient."}, {"time": 4238, "text": "And I'm not sure if there's a, you know, the way it was explained to me is that for so long, that community was like bombarded with just like bad ideas, like criticisms."}, {"time": 4253, "text": "They're just overly sensitive now to bullshit."}, {"time": 4258, "text": "They're like triggered by statements."}, {"time": 4263, "text": "They've heard it all before and they're like, oh, there they go again with the same old arguments."}, {"time": 4267, "text": "But that doesn't mean that you have to sort of, I guess, develop patience and so on."}, {"time": 4274, "text": "Especially when you feel like in my case that the person is coming from a good place, right?"}, {"time": 4278, "text": "I don't know if there's something you could say that's positive about the future of this kind of overcoming this toxicity."}, {"time": 4286, "text": "I think there's a couple of trends that are all kind of coalescing here in these types of experiences."}, {"time": 4289, "text": "So one is when you look at a community, there's always a spectrum in terms of there's some people who over index on kindness and stupidity."}, {"time": 4299, "text": "And there's some people who over index on intelligence and basically just being an asshole."}, {"time": 4301, "text": "And then you get everyone in between."}, {"time": 4305, "text": "And so naturally, as we know, the extremist ends of any community end up being the loudest usually."}, {"time": 4312, "text": "The second thing is there is from the outsider view, like at the beginning of the exploration of ideas, it's very much a learning process."}, {"time": 4322, "text": "I don't know if I understand this or not, but here's ideas A, B, and C. From the internal perspective, there's a trillion dollars of value at stake and we must protect it with our lives."}, {"time": 4334, "text": "The truth is probably somewhere in between there."}, {"time": 4338, "text": "And again, the world's not black and white."}, {"time": 4341, "text": "There's this kind of more gray area that I think actually is where most people exist."}, {"time": 4344, "text": "The other thing that's at play here is I think the Bitcoin community understands the internet and internet culture and narratives better than almost anyone."}, {"time": 4395, "text": "Like all this stuff."}, {"time": 4398, "text": "If you instead say, I'm going to meme you to death on the internet and I'm going to control the public narrative."}, {"time": 4406, "text": "You've shifted the power."}, {"time": 4406, "text": "The asymmetry of power is more symmetrical now."}, {"time": 4409, "text": "It's the ultimate insurgency, right?"}, {"time": 4409, "text": "If you bring it back to the the conflict."}, {"time": 4412, "text": "And so when you think about this, you have to lean into the advantage that you have."}, {"time": 4419, "text": "And so what ends up happening is you and I would absolutely lose it if we saw JP Morgan or Goldman Sachs or the Federal Reserve start tweeting memes."}, {"time": 4428, "text": "It it would almost the the validation that would give to the medium and the even playing field that it would provide would pull these establishments down to the level of what is this upstart?"}, {"time": 4446, "text": "But now what you're starting to see is that the Bitcoin community, even though there's some level of toxicity at times, even though there's this visceral reaction, sometimes there's even what I would call bullying or or or kind of outward projection of things, right?"}, {"time": 4461, "text": "Even though it may be a small percentage, it'll happen every once in a while."}, {"time": 4463, "text": "What they do understand, though, is that these establishments are made up of humans."}, {"time": 4470, "text": "And what you can actually do, one of the best ways to pick apart an institution is to recruit from inside of them one by one."}, {"time": 4477, "text": "And so what you're starting to see now is I mean, I get the messages on Twitter and LinkedIn all the time."}, {"time": 4484, "text": "Hey, I'm a banker by trade, but I'm a bitcoiner at heart, right?"}, {"time": 4487, "text": "And so what you're doing is you're essentially infiltrating the organizations, not in in physical, you know, population."}, {"time": 4495, "text": "But with the ideas and with the philosophies, banker in the streets, bitcoiner in the sheets."}, {"time": 4504, "text": "With that said, in terms of shitposting and memes, I gotta say like bring it on because I believe in terms of asymmetry of power, I believe in that love will save the world, not memes."}, {"time": 4522, "text": "Or at least good vibe memes as opposed to shitposting."}, {"time": 4528, "text": "It's an interesting battleground, though."}, {"time": 4531, "text": "It's an interesting battleground to think about."}, {"time": 4534, "text": "The other thing I would say, too, is one of the elements that's always kind of funny to me is how much of the entertainment is love, right?"}, {"time": 4542, "text": "So, when you start to think about how many of the memes that are posted, for example, are for outsiders versus insiders."}, {"time": 4548, "text": "Laser eyes, right?"}, {"time": 4552, "text": "Which seems absolutely ridiculous, elementary, and frankly, beneath anyone in any level of power or influence in the world somehow has congressmen and senators who have done it."}, {"time": 4563, "text": "They're not trying to convince their colleagues in elected positions to become bitcoiners."}, {"time": 4571, "text": "They're speaking directly internally to the Bitcoin community."}, {"time": 4573, "text": "Yeah, there's some sense in which, yes, memes is love."}, {"time": 4577, "text": "Even I keep hearing Bitcoin is love."}, {"time": 4577, "text": "They're trying to convert me."}, {"time": 4581, "text": "The one that you have to laugh at, right?"}, {"time": 4586, "text": "Probably my favorite one out of all of it is I've seen on multiple occasions, you know, Mark Cuban a couple of years ago, Kevin O Leary, whoever, you know, wealthy people, billionaires, etcetera, and you have people on anonymous accounts who who knows who they are telling them have fun staying poor, right?"}, {"time": 4600, "text": "It's just, you know, it's just, again, part of a community and I think it's a feature, not a bug."}, {"time": 4608, "text": "There's bad aspects to it at times but I do think it's a net positive."}, {"time": 4612, "text": "Yeah, just like the immune system."}, {"time": 4612, "text": "It does a lot of crappy stuff but overall, it's a major net positive."}, {"time": 4616, "text": "Maybe this is a bit of a personal question for me."}, {"time": 4621, "text": "It just added my own curiosity but I've talked to Ray Dalio a few times."}, {"time": 4627, "text": "So, Ray Dalio, I think was one of those people that took that journey, the Bitcoin journey."}, {"time": 4630, "text": "Do you have thoughts about him specifically about that whole world and about the journey maybe of others that are going through the same process because Ray is, at least from my perspective, I'm a bit of an outsider."}, {"time": 4646, "text": "He's one of the most insightful and deep thinkers about investment, about finance, about economics in general."}, {"time": 4657, "text": "Actually, about life."}, {"time": 4657, "text": "So, it's interesting to see him go on that journey."}, {"time": 4661, "text": "Do you have something to comment about Ray or just those kinds of people in general?"}, {"time": 4664, "text": "So, if we look at what I'll just consider the legends of Wall Street in general."}, {"time": 4670, "text": "There's no denying that they're incredibly intelligent."}, {"time": 4673, "text": "There's no denying that actually, especially in the hedge fund world, they're some of the most open minded people in terms of they're willing to change their mind when they get new information."}, {"time": 4681, "text": "There's no doubt that they are historians in the sense of having studied financial markets and cycles over time."}, {"time": 4687, "text": "And also, one of the things that I really respect about all those guys is almost all of them are willing to put ideas out via various writings that they do and accept the public criticism, right?"}, {"time": 4701, "text": "Whether it's Howard Marks, Ray or others, they will put this stuff out in public."}, {"time": 4703, "text": "And sure, there's a lot of people who are supportive and kind of are part of a fan base, if you will."}, {"time": 4708, "text": "But there's a lot of people who also think that sometimes they say stupid things."}, {"time": 4713, "text": "And so, putting that out takes kind of courage, right?"}, {"time": 4716, "text": "I think Ray's actually the most fascinating though out of all of these kind of legends of Wall Street in that he understands debt cycles."}, {"time": 4722, "text": "He understands currencies."}, {"time": 4726, "text": "He, for a while now, has been all over and famously said, you know, cash is trash, investible assets, right?"}, {"time": 4735, "text": "He kind of like just knew all of it."}, {"time": 4735, "text": "And for a long time, Bitcoiners have said, Ray, you understand the Bitcoin argument, you're just missing the last part, which is Bitcoin is the solution, right?"}, {"time": 4742, "text": "And so, he was gold and some other ideas."}, {"time": 4745, "text": "But I think that he's a perfect example of when you are part of the establishment, people view you in a very static way as the leader of a part of establishment."}, {"time": 4754, "text": "But whether it's Bill Gates, Ray Dalio, or somebody else, each one of these people were innovators and challengers to a system."}, {"time": 4764, "text": "They were upstarts at one point."}, {"time": 4764, "text": "And so, it's kind of this idea that like if you live long enough, you eventually become the man, right?"}, {"time": 4769, "text": "And so, you know, Gates is a good example, right?"}, {"time": 4773, "text": "Warren Buffett is a good example."}, {"time": 4773, "text": "Ray Dalio is a good example, etc."}, {"time": 4776, "text": "And so, you have to give credit, I think, to Dalio in the sense of he kept an open mind about all of this and more so than many of his peers has continued to do the work and come around to this idea."}, {"time": 4788, "text": "And now, I don't want to know if I wanted to say that he's a Bitcoin proponent as much as he believes it is one of a portion of assets that can be a solution."}, {"time": 4798, "text": "And so, to me, when you start to convince those types of people, when it's Paul Tudor Jones, a Stanley Druckenmiller, Ray Dalio, Howard Marks now even writing about it saying, hey, I was anti Bitcoin and put a ton of intellectual rigor into it."}, {"time": 4814, "text": "But thank God my son bought a bunch for our family, right?"}, {"time": 4817, "text": "And kind of we've had exposure to it."}, {"time": 4817, "text": "I think what it does is more than anything, it's not going to convince somebody to go and take it seriously or go ahead and make an allocation."}, {"time": 4829, "text": "It reduces career risk."}, {"time": 4829, "text": "And so, if all of a sudden when Paul Tudor Jones and Stanley Druckenmiller come out and say, hey, I own Bitcoin and here's why, every other investor on Wall Street now can say to an investment committee, well, it's good enough for Paul Tudor Jones, it's good enough for Stanley Druckenmiller."}, {"time": 4844, "text": "And so, I think that it's very interesting because Ray doesn't just represent Wall Street."}, {"time": 4849, "text": "I think Ray in some weird way represents this like macro economic investor."}, {"time": 4853, "text": "And so, some of those are in hedge funds and some of those people would be like CIOs at organizations."}, {"time": 4860, "text": "Some of them would be at corporations and some of them are just kind of retail investors."}, {"time": 4865, "text": "And so, you can see this kind of inflection point throughout the adoption of Bitcoin, right?"}, {"time": 4869, "text": "There was infrastructure that got built."}, {"time": 4872, "text": "Okay, that kind of led to more adoption."}, {"time": 4875, "text": "There was certain individuals, right?"}, {"time": 4875, "text": "Usually they were kind of technology oriented, entrepreneurial billionaires."}, {"time": 4882, "text": "They would buy it and come out and say it."}, {"time": 4882, "text": "Okay, that led to inflection points."}, {"time": 4885, "text": "You started to have some of these kind of Wall Street legends come out, sort of financial institutions started."}, {"time": 4892, "text": "And now, you're seeing corporations start to do it, right?"}, {"time": 4895, "text": "Eventually, there's going to be a central bank that does it."}, {"time": 4898, "text": "And so, you kind of walk through that line and what you understand is like, it's the same thing every time."}, {"time": 4903, "text": "It's just somebody new, right?"}, {"time": 4903, "text": "That path, right?"}, {"time": 4906, "text": "That Bitcoiners journey, if you will."}, {"time": 4906, "text": "And I think that that is almost the beauty of it is if you short circuit the journey, it's almost like somebody doesn't appreciate it, right?"}, {"time": 4918, "text": "If you take, let's say, somebody who's a young kid and you just give them a bunch of money and they didn't have to work hard for it."}, {"time": 4923, "text": "They don't really appreciate it."}, {"time": 4925, "text": "Well, and Ray actually has a book principles, right?"}, {"time": 4929, "text": "And he talks about the hero's journey."}, {"time": 4929, "text": "So, he's like living it in some sense in terms of, you know, thinking about digital currency in general, like digital finance."}, {"time": 4940, "text": "It's one of the big transitions, transformations of our world in some sense."}, {"time": 4946, "text": "It's not just about money."}, {"time": 4946, "text": "Or you could argue that money is everything."}, {"time": 4951, "text": "I mean, it's like money isn't just the narrow definition of money."}, {"time": 4953, "text": "Money is really everything."}, {"time": 4957, "text": "And so, where you could argue that sort of cryptocurrency is like the base layer of this transformation to the digital space and everything else would just be built on top of it."}, {"time": 4967, "text": "I use a different word that I think is kind of closer to your world, which is it's ultimately automation."}, {"time": 4976, "text": "And what I mean by that is, you know, before 1970 or 1980, all the assets were analog."}, {"time": 4980, "text": "And so, when you have analog assets, physical stock certificates, physical bonds, right, physical deed to a home, you have to physically exchange them."}, {"time": 4991, "text": "When we wanted to increase transactions and increase kind of global finance and access, we took those physical assets and we created electronic QCIP assets."}, {"time": 4999, "text": "So, now we have in centralized databases kind of a file, represents the asset that's sitting somewhere in custody."}, {"time": 5006, "text": "And you and I can transact them a little bit easier, but still centralized."}, {"time": 5012, "text": "There's still some bureaucracy and, you know, maybe it takes two days to transact rather than actually mailing it across the world."}, {"time": 5017, "text": "Now, what we're seeing is a transition from those electronic QCIPs to these digital assets."}, {"time": 5022, "text": "And so, if you look at, again, just let's say money or currency, every currency in the world is going to be digital."}, {"time": 5029, "text": "You're going to have a digital dollar, a digital euro, yen, RMB."}, {"time": 5031, "text": "You're going to have decentralized kind of open source money like Bitcoin."}, {"time": 5039, "text": "You're also going to have private currencies like Facebook's attempt at DiEM and there will be others that will try to do this."}, {"time": 5045, "text": "And so, when you get everything digital, right, and I think that's the kind of the first step that everyone focuses on, the competition at the technology layer essentially goes away."}, {"time": 5053, "text": "You get some level of feature parity and sure, there's bells and whistles on each kind of implementation of a digital currency, but at the end of the day, the technology is relatively the same."}, {"time": 5061, "text": "And ultimately, what it will do is it will facilitate the adoption of digital wallets."}, {"time": 5066, "text": "So, you have to have a digital wallet regardless of what digital currency you have."}, {"time": 5069, "text": "Same with me, same with everybody else in the world."}, {"time": 5071, "text": "But what it does do is when you kind of push away and reduce the friction of competition at the technology layer, it moves the competition to the monetary policy layer."}, {"time": 5081, "text": "And so, when you get to that layer, now it becomes interesting because all of the currencies are the same except for this one right now and maybe there will be others in the future."}, {"time": 5090, "text": "But for sure, Bitcoin today and people may try to replicate in a private manner or something, but Bitcoin is kind of the only finite scarce digital somebody."}, {"time": 5099, "text": "And so, when you then have that pretty big difference in that competition at the monetary policy layer, it's actually not going to matter where you get paid."}, {"time": 5110, "text": "And what I mean by that is like you and I both live in a single currency environment."}, {"time": 5112, "text": "I get paid in dollars."}, {"time": 5112, "text": "I historically have saved in dollars."}, {"time": 5118, "text": "All of the assets in my life are denominated in dollars and I owe my debts in dollars, whether it's taxes or in the private market."}, {"time": 5125, "text": "And I don't have to worry about foreign currencies."}, {"time": 5129, "text": "I don't exchange anything."}, {"time": 5131, "text": "The only time I would ever think about another currency is if I'm going to another country in their single currency environment."}, {"time": 5135, "text": "And in order to change or exchange my currency, I go to the bank or I go get ripped off at the airport."}, {"time": 5143, "text": "Those are my two options."}, {"time": 5146, "text": "So, it's high friction to change between currencies."}, {"time": 5146, "text": "When the competition of technology is kind of innovated away, now I can get paid in dollars, these digital dollars, and with a click of a button, switch into any other currency in the world."}, {"time": 5159, "text": "And so, what ultimately happens is value and liquidity is going to coalesce around the best monetary policy."}, {"time": 5163, "text": "And so, you get in this very weird world where even if the United States says, hey, you're going to get paid in dollars, you have to pay your taxes in dollars."}, {"time": 5171, "text": "You're going to start to see people operate in a multi currency environment where they say, okay, I got paid in my digital dollar, click a button, I save in Bitcoin."}, {"time": 5177, "text": "It stays there or grows my purchasing power."}, {"time": 5181, "text": "Oh, I need to pay my taxes."}, {"time": 5181, "text": "Let me switch back into dollars with click of a button and pay."}, {"time": 5183, "text": "When you go to a multi currency world, it's not just about currency."}, {"time": 5186, "text": "It's now multi asset world."}, {"time": 5190, "text": "Because not only is the currency digitized, but that same technology is used to digitize stocks, bonds, and commodities as well."}, {"time": 5198, "text": "And so, today we live in a very fragmented financial world where basically I have a brokerage account, I have a bank account, I may have an alternative asset account, etc."}, {"time": 5206, "text": "When I can put all those assets in a single digital wallet, and I can then go from asset to asset without having to go back to a single unit of account."}, {"time": 5218, "text": "Like frictionless going from asset to asset."}, {"time": 5218, "text": "So now what you end up doing is you start to open up the possibility for machine to machine transactions."}, {"time": 5223, "text": "So today, if you and I write software code for two machines to transact with each other, they can't transact physical currency."}, {"time": 5233, "text": "And in many cases, they can't actually transact the electronic QCIP currencies or assets either because there's too long of a settlement time."}, {"time": 5239, "text": "So you can't get true automation, right?"}, {"time": 5241, "text": "So the whole idea of the car's going to drive over a strip in the road and it's going to pay the toll, right?"}, {"time": 5246, "text": "Well, that can't happen right now because literally the transaction won't go through, right?"}, {"time": 5251, "text": "And so I always joke that in an automated world, it's like a CD ROM, but we're trying to take cassette tape player assets and put it in the CD ROM."}, {"time": 5258, "text": "It's just incompatible technology."}, {"time": 5260, "text": "Reference is nobody understands at this point."}, {"time": 5264, "text": "By the way, you need to update your reference."}, {"time": 5264, "text": "I probably do."}, {"time": 5266, "text": "It's like taking a CD ROM and trying to put an MP3 player into a streaming."}, {"time": 5268, "text": "But I think that the reason why that becomes really interesting is when you start to create these digital assets, now you open up the world of possibilities."}, {"time": 5277, "text": "So when new technology is created, you can do two things."}, {"time": 5279, "text": "You can either create new things the world's never seen before, or you can use it to improve the old world."}, {"time": 5284, "text": "Most people, because it's the easiest thing to think about, want to improve the old world."}, {"time": 5288, "text": "So an equivalent of this would be when the internet came along, a media company that had newspapers would say, hey, we should take a PDF of the newspaper and we should put it on a website."}, {"time": 5297, "text": "And now anyone in the world can go to this website and they can read the newspaper today."}, {"time": 5301, "text": "That was valuable, but it missed out on the ability to change headlines, to test, to put multimedia, to distribute it differently, to do all kinds of things that today we understand the internet really empowered."}, {"time": 5315, "text": "And so what I think we're about to watch happen is we're going to digitize the assets."}, {"time": 5318, "text": "We're going to put them all into these digital wallets."}, {"time": 5320, "text": "You're going to get automated technologies where machines can now transact with each other."}, {"time": 5326, "text": "And we're going to do simple things like why do we pay people once every two weeks?"}]}]