[{"title": "Paola Arlotta: Brain Development from Stem Cell to Organoid | Lex Fridman Podcast #32", "id": "lVHRs3uTHNI", "quotes": [{"time": 308, "text": "You know, it takes us a long time as human beings after we're born to learn all the things that we have to learn to have the adult brain."}, {"time": 317, "text": "It's actually 20 years, think about it."}, {"time": 320, "text": "From when a baby is born to when a teenager goes through puberty to adults, it's a long time."}, {"time": 327, "text": "Do you think you can maybe talk through the first few months and then on to the first 20 years and then for the rest of their lives?"}, {"time": 337, "text": "What is the development of the human brain look like?"}, {"time": 341, "text": "What are the different stages?"}, {"time": 342, "text": "Yeah, at the beginning, you have to build a brain, right?"}, {"time": 346, "text": "And the brain is made of cells."}, {"time": 348, "text": "What's the very beginning?"}, {"time": 349, "text": "Which beginning are we talking about?"}, {"time": 352, "text": "In the embryo, as the embryo is developing in the womb, in addition to making all of the other tissues of the embryo, the muscle, the heart, the blood, the embryo is also building the brain."}, {"time": 364, "text": "And it builds from a very simple structure called the neural tube, which is basically nothing but a tube of cells that spans sort of the length of the embryo from the head all the way to the tail, let's say, of the embryo."}, {"time": 380, "text": "And then over in human beings, over many months of gestation from that neural tube, which contains stem cell like cells of the brain, you will make many, many other building blocks of the brain."}, {"time": 396, "text": "So all of the other cell types, because there are many, many different types of cells in the brain that will form specific structures of the brain."}, {"time": 406, "text": "So you can think about embryonic development of the brain as just the time in which you are making the building blocks, the cells."}, {"time": 414, "text": "Are the stem cells relatively homogeneous, like uniform, or are they all different types?"}, {"time": 419, "text": "It's a very good question."}, {"time": 420, "text": "It's exactly how it works."}, {"time": 421, "text": "You start with a more homogeneous, perhaps more multipotent type of stem cell."}, {"time": 429, "text": "With multipotent."}, {"time": 430, "text": "With multipotent it means that it has the potential to make many, many different types of other cells."}, {"time": 437, "text": "And then with time, these progenitors become more heterogeneous, which means more diverse."}, {"time": 442, "text": "There are gonna be many different types of the stem cells."}, {"time": 446, "text": "And also they will give rise to progeny to other cells that are not stem cells, that are specific cells of the brain that are very different from the mother stem cell."}, {"time": 455, "text": "And now you think about this process of making cells from the stem cells over many, many months of development for humans."}, {"time": 463, "text": "And what you're doing, you're building the cells that physically make the brain, and then you arrange them in specific structures that are present in the final brain."}, {"time": 475, "text": "So you can think about the embryonic development of the brain as the time where you're building the bricks, you're putting the bricks together to form buildings, structures, regions of the brain."}, {"time": 488, "text": "And where you make the connections between these many different type of cells, especially nerve cells, neurons, right?"}, {"time": 495, "text": "That transmit action potentials and electricity."}, {"time": 499, "text": "I've heard you also say somewhere, I think, correct me if I'm wrong, that the order of the way this builds matters."}, {"time": 506, "text": "If you are an engineer and you think about development, you can think of it as, well, I could also take all the cells and bring them all together into a brain in the end."}, {"time": 518, "text": "But development is much more than that."}, {"time": 520, "text": "So the cells are made in a very specific order that subserve the final product that you need to get."}, {"time": 527, "text": "And so, for example, all of the nerve cells, the neurons are made first, and all of the supportive cells of the neurons, like the glia, is made later."}, {"time": 536, "text": "And there is a reason for that because they have to assemble together in specific ways."}, {"time": 542, "text": "But you also may say, well, why don't we just put them all together in the end?"}, {"time": 545, "text": "It's because as they develop next to each other, they influence their own development."}, {"time": 551, "text": "So it's a different thing for a glia to be made alone in a dish, than a glia cell be made in a developing embryo with all these other cells around it that produce all these other signals."}, {"time": 563, "text": "First of all, that's mind blowing, this development process."}, {"time": 567, "text": "From my perspective in artificial intelligence, you often think of how incredible the final product is, the final product, the brain."}, {"time": 575, "text": "But you're making me realize that the final product is just, the beautiful thing is the actual development process."}, {"time": 584, "text": "Do we know the code that drives that development?"}, {"time": 592, "text": "Do we have any sense?"}, {"time": 593, "text": "First of all, thank you for saying that it's really the formation of the brain."}, {"time": 599, "text": "It's really its development."}, {"time": 600, "text": "It is this incredibly choreographed dance that happens the same way every time each one of us builds the brain, right?"}, {"time": 610, "text": "And that builds an organ that allows us to do what we're doing today, right?"}, {"time": 614, "text": "That is mind blowing."}, {"time": 616, "text": "And this is why developmental neurobiologists never get tired of studying that."}, {"time": 621, "text": "Now you're asking about the code."}, {"time": 623, "text": "What drives this?"}, {"time": 624, "text": "How is this done?"}, {"time": 626, "text": "Well, it's millions of years of evolution of really fine tuning gene expression programs that allow certain cells to be made at a certain time and to become a certain cell type, but also mechanical forces of pressure bending."}, {"time": 647, "text": "This embryo is not just, it will not stay a tube, this brain for very long."}, {"time": 652, "text": "At some point, this tube in the front of the embryo will expand to make the primordium of the brain, right?"}, {"time": 689, "text": "So it's not only chemical, it's also mechanical."}, {"time": 692, "text": "So from my perspective, biology is this incredibly complex mess, gooey mess."}, {"time": 700, "text": "So you're saying mechanical forces."}, {"time": 703, "text": "How different is like a computer or any kind of mechanical machine that we humans build and the biological systems?"}, {"time": 714, "text": "Have you been, because you've worked a lot with biological systems."}, {"time": 717, "text": "Are they as much of a mess as it seems from a perspective of an engineer, a mechanical engineer?"}, {"time": 723, "text": "Yeah, they are much more prone to taking alternative routes, right?"}, {"time": 761, "text": "It was not the environment of the brain."}, {"time": 763, "text": "Therefore, they're gonna be different just by definition."}, {"time": 766, "text": "So if you instead use development to build, let's say a brain organoid, which maybe we will be talking about in a few minutes."}, {"time": 775, "text": "Those things are fascinating."}, {"time": 776, "text": "Yes, so if you use processes of development, then when you watch it, you can see that sometimes things can go wrong in some organoids and by wrong, I mean different one organoid from the next."}, {"time": 790, "text": "While if you think about that embryo, it always goes right."}, {"time": 794, "text": "So this development, it's for as complex as it is."}, {"time": 798, "text": "Every time a baby is born has, with very few exceptions, so the brain is like the next baby, but it's not the same if you develop it in a dish."}, {"time": 811, "text": "And first of all, we don't even develop a brain, you develop something much simpler in the dish, but there are more options for building things differently, which really tells you that evolution has played a really tight game here for how in the end the brain is built in vivo."}, {"time": 833, "text": "So just a quick, maybe dumb question, but it seems like this is not, the building process is not a dictatorship."}, {"time": 841, "text": "It seems like there's not a centralized, like high level mechanism that says, okay, this cell built itself the wrong way, I'm gonna kill it."}, {"time": 851, "text": "It seems like there's a really strong distributed mechanism."}, {"time": 855, "text": "Is that in your sense for what you mean?"}, {"time": 858, "text": "There are a lot of possibilities, right?"}, {"time": 860, "text": "And if you think about, for example, different species building their brain, each brain is a little bit different."}, {"time": 868, "text": "So the brain of a lizard is very different from that of a chicken, from that of one of us and so on and so forth and still is a brain, but it was built differently starting from stem cells that pretty much had the same potential, but in the end, evolution builds different brains in different species because that serves in a way the purpose of that species and the wellbeing of that organism."}, {"time": 896, "text": "And so there are many possibilities, but then there is a way and you were talking about a code."}, {"time": 904, "text": "Nobody knows what the entire code of development is."}, {"time": 907, "text": "Of course we don't."}, {"time": 908, "text": "We know bits and pieces of very specific aspects of development of the brain, what genes are involved to make a certain cell types, how those two cells interact to make the next level structure that we might know, but the entirety of it, how it's so well controlled, it's really mind blowing."}, {"time": 926, "text": "So in the first two months in the embryo or whatever, the first few weeks, months, so yeah, the building blocks are constructed."}, {"time": 937, "text": "The actual, the different regions of the brain, I guess in the nervous system."}, {"time": 942, "text": "Well, this continues way longer than just the first few months."}, {"time": 946, "text": "So over the very first few months, you build a lot of the cells, but then there is continuous building of new cell types all the way through birth."}, {"time": 958, "text": "And then even postnatally, I don't know if you've ever heard of myelin."}, {"time": 963, "text": "Myelin is this sort of insulation that is built around the cables of the neurons so that the electricity can go really fast from."}, {"time": 972, "text": "The axons, I guess they're called."}, {"time": 973, "text": "The axons, they're called axons, exactly."}, {"time": 975, "text": "And so as human beings, we myelinate our cells postnatally."}, {"time": 984, "text": "A kid, a six year old kid has barely started the process of making the mature oligodendrocytes, which are the cells that then eventually will wrap the axons into myelin."}, {"time": 996, "text": "And this will continue, believe it or not, until we are about 25, 30 years old."}, {"time": 1002, "text": "So there is a continuous process of maturation and tweaking and additions, and also in response to what we do."}, {"time": 1011, "text": "I remember taking AP Biology in high school, and in the textbook, it said that, I'm going by memory here, that scientists disagree on the purpose of myelin in the brain."}, {"time": 1024, "text": "Is that totally wrong?"}, {"time": 1026, "text": "So like, I guess it speeds up the, okay, I might be wrong here, but I guess it speeds up the electricity traveling down the axon or something."}, {"time": 1037, "text": "Yeah, so that's the most sort of canonical, and definitely that's the case."}, {"time": 1041, "text": "So you have to imagine an axon, and you can think about it as a cable of some type with electricity going through."}, {"time": 1049, "text": "And what myelin does, by insulating the outside, I should say there are tracts of myelin and pieces of axons that are naked without myelin."}, {"time": 1059, "text": "And so by having the insulation, the electricity, instead of going straight through the cable, it will jump over a piece of myelin, right, to the next naked little piece and jump again."}, {"time": 1069, "text": "And therefore, that's the idea that you go faster."}, {"time": 1072, "text": "And it was always thought that in order to build a big brain, a big nervous system, in order to have a nervous system that can do very complex type of things, then you need a lot of myelin because you wanna go fast with this information from point A to point B."}, {"time": 1092, "text": "Well, a few years ago, maybe five years ago or so, we discovered that some of the most evolved, which means the newest type of neurons that we have as nonhuman primates, as human beings in the top of our cerebral cortex, which should be the neurons that do some of the most complex things that we do, well, those have axons that have very little myelin."}, {"time": 1116, "text": "And they have very interesting ways in which they put this myelin on their axons."}, {"time": 1123, "text": "You know, a little piece here, then a long track with no myelin, another chunk there."}, {"time": 1127, "text": "And some don't have myelin at all."}, {"time": 1129, "text": "So now, you have to explain where we're going with evolution."}, {"time": 1137, "text": "And if you think about it, perhaps as an electrical engineer, when I looked at it, I initially thought, and I'm a developmental neurobiologist, I thought maybe this is what we see now, but if we give evolution another few million years, we'll see a lot of myelin on these neurons too."}, {"time": 1155, "text": "But I actually think now that that's instead the future of the brain."}, {"time": 1160, "text": "Less myelin."}, {"time": 1161, "text": "Less myelin might allow for more flexibility on what you do with your axons, and therefore more complicated and unpredictable type of functions, which is also a bit mind blowing."}, {"time": 1173, "text": "So it seems like it's controlling the timing of the signal."}, {"time": 1177, "text": "So they're in the timing, you can encode a lot of information."}, {"time": 1183, "text": "And so the brain."}, {"time": 1184, "text": "The timing, the chemistry of that little piece of axon, perhaps it's a dynamic process where the myelin can move."}, {"time": 1192, "text": "Now you see how many layers of variability you can add, and that's actually really good if you're trying to come up with a new function or a new capability or something unpredictable in a way."}, {"time": 1206, "text": "So we're gonna jump around a little bit, but the old question of how much is nature and how much is nurture?"}, {"time": 1214, "text": "In terms of this incredible thing after the development is over, we seem to be kind of somewhat smart, intelligent, cognition, consciousness, all of these things are just incredible, ability to reason and so on emerge."}, {"time": 1231, "text": "In your sense, how much is in the hardware, in the nature and how much is in the nurture is learned through with our parents through interacting with the environment and so on."}, {"time": 1242, "text": "It's really both, right?"}, {"time": 1243, "text": "If you think about it."}, {"time": 1245, "text": "So we are born with a brain as babies that has most of its cells and most of its structures."}, {"time": 1253, "text": "And that will take a few years to grow, to add more, to be better."}, {"time": 1260, "text": "But really then we have this 20 years of interacting with the environment around us."}, {"time": 1267, "text": "And so what that brain that was so perfectly built or imperfectly built due to our genetic cues will then be used to incorporate the environment in its further maturation and development."}, {"time": 1282, "text": "And so your experiences do shape your brain."}, {"time": 1286, "text": "I mean, we know that like if you and I may have had a different childhood or a different, we have been going to different schools, we have been learning different things and our brain is a little bit different because of that."}, {"time": 1298, "text": "We behave differently because of that."}, {"time": 1301, "text": "And so especially postnatally experience is extremely important."}, {"time": 1306, "text": "We are born with a plastic brain."}, {"time": 1308, "text": "What that means is a brain that is able to change in response to stimuli that can be sensory."}, {"time": 1316, "text": "So perhaps some of the most illuminating studies that were done were studies in which the sensory organs were not working, right?"}, {"time": 1326, "text": "Like if you are born with eyes that don't work, then your very brain, that piece of the brain that normally would process vision, the visual cortex, develops postnatally differently and it might be used to do something different, right?"}, {"time": 1343, "text": "So that's the most extreme."}, {"time": 1345, "text": "The plasticity of the brain, I guess, is the magic hardware that it, and then it's flexibility in all forms is what enables the learning postnatally."}, {"time": 1356, "text": "Can you talk about organoids?"}, {"time": 1359, "text": "What are they?"}, {"time": 1360, "text": "And how can you use them to help us understand the brain and the development of the brain?"}, {"time": 1365, "text": "This is very, very important."}, {"time": 1367, "text": "So the first thing I'd like to say, please skip this in the video."}, {"time": 1372, "text": "The first thing I'd like to say is that an organoid, a brain organoid is not the same as a brain."}, {"time": 1381, "text": "It's a fundamental distinction."}, {"time": 1383, "text": "It's a system, a cellular system that one can develop in the culture dish, starting from stem cells that will mimic some aspects of the development of the brain, but not all of it."}, {"time": 1401, "text": "They are very small, maximum, they become about four to five millimeters in diameters."}, {"time": 1407, "text": "They are much simpler than our brain, of course, but yet they are the only system where we can literally watch a process of human brain development unfold."}, {"time": 1422, "text": "And by watch, I mean, study it."}, {"time": 1424, "text": "Remember when I told you that we can't understand everything about development in our own brain by studying a mouse?"}, {"time": 1431, "text": "Well, we can't study the actual process of development of the human brain because it all happens in utero."}, {"time": 1435, "text": "So we will never have access to that process ever."}, {"time": 1438, "text": "And therefore, this is our next best thing."}, {"time": 1442, "text": "Like a bunch of stem cells that can be coaxed into starting a process of neural tube formation."}, {"time": 1450, "text": "Remember that tube that is made by the embryo early on."}, {"time": 1453, "text": "And from there, a lot of the cell types that are present within the brain, and you can simply watch it and study, but you can also think about diseases where development of the brain does not proceed normally, right, properly."}, {"time": 1473, "text": "Think about neurodevelopmental diseases."}, {"time": 1474, "text": "There are many, many different types."}, {"time": 1477, "text": "Think about autism spectrum disorders."}, {"time": 1479, "text": "There are also many different types of autism."}, {"time": 1481, "text": "So there you could take a stem cell, which really means either a sample of blood or a sample of skin from the patient, make a stem cell, and then with that stem cell, watch a process of formation of a brain organ or a brain organoid of that person with that genetics, with that genetic code in it."}, {"time": 1502, "text": "And you can ask, what is this genetic code doing to some aspects of development of the brain?"}, {"time": 1508, "text": "And for the first time, you may come to solutions like what cells are involved in autism, right?"}, {"time": 1516, "text": "So many questions around this."}, {"time": 1517, "text": "So if you take this human stem cell for that particular person with that genetic code, how, and you try to build an organoid, how often will it look similar?"}, {"time": 1528, "text": "What's the, yeah, so."}, {"time": 1531, "text": "The reproducibility?"}, {"time": 1533, "text": "Yes, or how much variability is the flip side of that?"}, {"time": 1536, "text": "Yeah, so there is much more variability in building organoids than there is in building brain."}, {"time": 1544, "text": "It's really true that the majority of us, when we are born as babies, our brains look a lot like each other."}, {"time": 1552, "text": "This is the magic that the embryo does, where it builds a brain in the context of a body and there is very little variability there."}, {"time": 1561, "text": "There is disease, of course, but in general, a little variability."}, {"time": 1563, "text": "When you build an organoid, we don't have the full code for how this is done."}, {"time": 1569, "text": "And so in part, the organoid somewhat builds itself because there are some structures of the brain that the cells know how to make."}, {"time": 1578, "text": "And another part comes from the investigator, the scientist adding to the media factors that we know in the mouse, for example, would foster a certain step of development, but it's very limited."}, {"time": 1593, "text": "And so as a result, the kind of product you get in the end is much more reductionist, is much more simple than what you get in vivo."}, {"time": 1602, "text": "It mimics early events of development as of today, and it doesn't build very complex type of anatomy and structure does not as of today, which happens instead in vivo."}, {"time": 1614, "text": "And also the variability that you see, one organ to the next tends to be higher than when you compare an embryo to the next."}, {"time": 1625, "text": "So, okay, then the next question is, how hard and maybe another flip side of that expensive is it to go from one stem cell to an organoid?"}, {"time": 1634, "text": "How many can you build in like, because it sounds very complicated."}, {"time": 1638, "text": "It's work definitely, and it's money definitely, but you can really grow a very high number of these organoids, can go perhaps, I told you the maximum, they become about five millimeters in diameter."}, {"time": 1655, "text": "So this is about the size of a tiny, tiny raisin, or perhaps the seed of an apple."}, {"time": 1663, "text": "And so you can grow 50 to 100 of those inside one big bioreactors, which are these flasks where the media provides nutrients for the organoids."}, {"time": 1675, "text": "So the problem is not to grow more or less of them."}, {"time": 1681, "text": "It's really to figure out how to grow them in a way that they are more and more reproducible, for example, organoid to organoid, so they can be used to study a biological process."}, {"time": 1693, "text": "Because if you have too much variability, then you never know if what you see is just an exception or really the rule."}, {"time": 1699, "text": "So what does an organoid look like?"}, {"time": 1702, "text": "Are there different neurons already emerging?"}, {"time": 1705, "text": "Is there, well, first, can you tell me what kind of neurons are there?"}, {"time": 1710, "text": "Are they sort of all the same?"}, {"time": 1715, "text": "Are they not all the same?"}, {"time": 1718, "text": "How much do we understand?"}, {"time": 1719, "text": "And how much of that variance, if any, can exist in organoids?"}, {"time": 1727, "text": "So you could grow, I told you that the brain has different parts."}, {"time": 1732, "text": "So the cerebral cortex is on the top part of the brain, but there is another region called the striatum that is below the cortex and so on and so forth."}, {"time": 1739, "text": "All of these regions have different types of cells in the actual brain, okay?"}, {"time": 1745, "text": "And so scientists have been able to grow organoids that may mimic some aspects of development of these different regions of the brain."}, {"time": 1753, "text": "And so we are very interested in the cerebral cortex."}, {"time": 1756, "text": "That's the coolest part, right?"}, {"time": 1760, "text": "We wouldn't be here talking if we didn't have a cerebral cortex."}, {"time": 1763, "text": "It's also, I like to think, the part of the brain that really truly makes us human, the most evolved in recent evolution."}, {"time": 1770, "text": "And so in the attempt to make the cerebral cortex and by figuring out a way to have these organoids continue to grow and develop for extended periods of times, much like it happens in the real embryo, months and months in culture, then you can see that many different types of neurons of the cortex appear."}, {"time": 1790, "text": "And at some point, also the astrocytes, so the glia cells of the cerebral cortex also appear."}, {"time": 1797, "text": "What are these astrocytes?"}, {"time": 1800, "text": "The astrocytes are not neurons, so they're not nerve cells, but they play very important roles."}, {"time": 1806, "text": "One important role is to support the neuron."}, {"time": 1808, "text": "But of course, they have much more active type of roles."}, {"time": 1811, "text": "They're very important, for example, to make the synapses, which are the point of contact and communication between two neurons."}, {"time": 1821, "text": "So all that chemistry fun happens in the synapses, happens because of these cells?"}, {"time": 1828, "text": "Are they the medium in which?"}, {"time": 1829, "text": "It happens because of the interactions, happens because you are making the cells and they have certain properties, including the ability to make neurotransmitters, which are the chemicals that are secreted to the synapses, including the ability of making these axons grow with their growth cones and so on and so forth."}, {"time": 1849, "text": "And then you have other cells around it that release chemicals or touch the neurons or interact with them in different ways to really foster this perfect process, in this case of synaptogenesis."}, {"time": 1862, "text": "And this does happen within organoids."}, {"time": 1865, "text": "So the mechanical and the chemical stuff happens."}, {"time": 1869, "text": "The connectivity between neurons, this in a way is not surprising because scientists have been culturing neurons forever."}, {"time": 1878, "text": "And when you take a neuron, even a very young one, and you culture it, eventually finds another cell or another neuron to talk to, it will form a synapse."}, {"time": 1886, "text": "Are we talking about mice neurons?"}, {"time": 1888, "text": "Are we talking about human neurons?"}, {"time": 1889, "text": "It doesn't matter, both."}, {"time": 1890, "text": "So you can culture a neuron, like a single neuron and give it a little friend and it starts interacting?"}, {"time": 1897, "text": "Yes, so neurons are able to, it sounds, it's more simple than what it may sound to you."}, {"time": 1904, "text": "Neurons have molecular properties and structural properties that allow them to really communicate with other cells."}, {"time": 1910, "text": "And so if you put not one neuron, but if you put several neurons together, chances are that they will form synapses with each other."}, {"time": 1921, "text": "So an organoid is not a brain."}, {"time": 1924, "text": "But there's some, it's able to, especially what you're talking about, mimics some properties of the cerebral cortex, for example."}, {"time": 1935, "text": "So what can you understand about the brain by studying an organoid of a cerebral cortex?"}, {"time": 1941, "text": "I can literally study all this incredible diversity of cell type, all these many, many different classes of cells, how are they made?"}, {"time": 1950, "text": "How do they look like?"}, {"time": 1952, "text": "What do they need to be made properly?"}, {"time": 1954, "text": "And what goes wrong if now the genetics of that stem cell that I used to make the organoid came from a patient with a neurodevelopmental disease?"}, {"time": 1964, "text": "Can I actually watch for the very first time what may have gone wrong years before in this kid when its own brain was being made?"}, {"time": 1973, "text": "Think about that loop."}, {"time": 1974, "text": "In a way, it's a little tiny rudimentary window into the past, into the time when that brain in a kid that had this neurodevelopmental disease was being made."}, {"time": 1990, "text": "And I think that's unbelievably powerful because today we have no idea of what cell types, we barely know what brain regions are affected in these diseases."}, {"time": 2000, "text": "Now we have an experimental system that we can study in the lab."}, {"time": 2005, "text": "And we can ask, what are the cells affected?"}, {"time": 2008, "text": "When during development things went wrong?"}, {"time": 2011, "text": "What are the molecules among the many, many different molecules that control brain development?"}, {"time": 2016, "text": "Which ones are the ones that really messed up here and we want perhaps to fix?"}, {"time": 2022, "text": "And what is really the final product?"}, {"time": 2024, "text": "Is it a less strong kind of circuit and brain?"}, {"time": 2028, "text": "Is it a brain that lacks a cell type?"}, {"time": 2032, "text": "Because then we can think about treatment and care for these patients that is informed rather than just based on current diagnostics."}, {"time": 2042, "text": "So how hard is it to detect through the developmental process?"}, {"time": 2046, "text": "It's a super exciting tool to see how different conditions develop."}, {"time": 2055, "text": "How hard is it to detect that, wait a minute, this is abnormal development."}, {"time": 2061, "text": "How much signal is there?"}, {"time": 2064, "text": "How much of it is it a mess?"}, {"time": 2066, "text": "Because things can go wrong at multiple levels, right?"}, {"time": 2069, "text": "You could have a cell that is born and built but then doesn't work properly or a cell that is not even born or a cell that doesn't interact with other cells differently and so on and so forth."}, {"time": 2082, "text": "So today we have technology that we did not have even five years ago that allows us to look for example at the molecular picture of a cell, of a single cell in a sea of cells with high precision."}, {"time": 2096, "text": "And so that molecular information where you compare many, many single cells for the genes that they produce between a control individual and an individual with a neurodevelopmental disease, that may tell you what is different molecularly."}, {"time": 2113, "text": "Or you could see that some cells are not even made, for example, or that the process of maturation of the cells may be wrong."}, {"time": 2122, "text": "There are many different levels here and we can study the cells at the molecular level but also we can use the organoids to ask questions about the properties of the neurons, the functional properties, how they communicate with each other, how they respond to a stimulus and so on and so forth."}, {"time": 2141, "text": "And we may get an abnormalities there, right?"}, {"time": 2146, "text": "Detect those."}, {"time": 2147, "text": "So how early is this work in the, maybe in the history of science?"}, {"time": 2154, "text": "So, I mean like, so if you were to, if you and I time travel a thousand years into the future, organoids seem to be, maybe I'm romanticizing the notion but you're building not a brain but something that has properties of a brain."}, {"time": 2175, "text": "So it feels like you might be getting close to, in the building process, to build this to understand."}, {"time": 2183, "text": "So how far are we in this understanding process of development?"}, {"time": 2191, "text": "A thousand years from now, it's a long time from now."}, {"time": 2194, "text": "So if this planet is still gonna be here a thousand years from now."}, {"time": 2198, "text": "So, I mean, if, you know, like they write a book, obviously there'll be a chapter about you."}, {"time": 2203, "text": "That's right, that science fiction book, today."}, {"time": 2207, "text": "Yeah, today, about, I mean, I guess where we really understood very little about the brain a century ago, I was a big fan in high school of reading Freud and so on, still am of psychiatry."}, {"time": 2219, "text": "I would say we still understand very little about the functional aspect of just, but how in the history of understanding the biology of the brain, the development, how far are we along?"}, {"time": 2232, "text": "And so this is just, of course, my opinion."}, {"time": 2235, "text": "I think that we did not have technology even 10 years ago or certainly not 20 years ago to even think about experimentally investigating the development of the human brain."}, {"time": 2250, "text": "So we've done a lot of work in science to study the brain or many other organisms."}, {"time": 2255, "text": "Now we have some technologies which I'll spell out that allow us to actually look at the real thing and look at the brain, at the human brain."}, {"time": 2265, "text": "So what are these technologies?"}, {"time": 2266, "text": "There has been huge progress in stem cell biology."}, {"time": 2270, "text": "The moment someone figured out how to turn a skin cell into an embryonic stem cell, basically, and that how that embryonic stem cell could begin a process of development again to, for example, make a brain, there was a huge advance, and in fact, there was a Nobel Prize for that."}, {"time": 2288, "text": "That started the field, really, of using stem cells to build organs."}, {"time": 2294, "text": "Now we can build on all the knowledge of development that we build over the many, many, many years to say, how do we make the stem cells now make more and more complex aspects of development of the human brain?"}, {"time": 2305, "text": "So this field is young, the field of brain organoids, but it's moving faster."}, {"time": 2310, "text": "And it's moving fast in a very serious way that is rooted in labs with the right ethical framework and really building on solid science for what reality is and what is not."}, {"time": 2324, "text": "But it will go faster and it will be more and more powerful."}, {"time": 2329, "text": "We also have technology that allows us to basically study the properties of single cells across many, many millions of single cells, which we didn't have perhaps five years ago."}, {"time": 2342, "text": "So now with that, even an organoid that has millions of cells can be profiled in a way, looked at with very, very high resolution, the single cell level to really understand what is going on."}, {"time": 2354, "text": "And you could do it in multiple stages of development and you can build your hypothesis and so on and so forth."}, {"time": 2360, "text": "So it's not gonna be a thousand years."}, {"time": 2362, "text": "It's gonna be a shorter amount of time."}, {"time": 2365, "text": "And I see this as sort of an exponential growth of this field enabled by these technologies that we didn't have before."}, {"time": 2374, "text": "And so we're gonna see something transformative that we didn't see at all in the prior thousand years."}, {"time": 2381, "text": "So I apologize for the crazy sci fi questions, but the developmental process is fascinating to watch and study, but how far are we away from and maybe how difficult is it to build not just an organoid, but a human brain from a stem cell?"}, {"time": 2402, "text": "Yeah, first of all, that's not the goal for the majority of the serious scientists that work on this because you don't have to build the whole human brain to make this model useful for understanding how the brain develops or understanding disease."}, {"time": 2420, "text": "You don't have to build the whole thing."}, {"time": 2422, "text": "So let me just comment on this, fascinating."}, {"time": 2425, "text": "It shows to me the difference between you and I as you're actually trying to understand the beauty of the human brain and to use it to really help thousands or millions of people with disease and so on, right?"}, {"time": 2438, "text": "From an artificial intelligence perspective, we're trying to build systems that we can put in robots and try to create systems that have echoes of the intelligence about reasoning about the world, navigating the world."}, {"time": 2453, "text": "It's different objectives, I think."}, {"time": 2456, "text": "Yeah, that's very much science fiction."}, {"time": 2457, "text": "Science fiction, but we operate in science fiction a little bit."}, {"time": 2460, "text": "So on that point of building a brain, even though that is not the focus or interest, perhaps, of the community, how difficult is it?"}, {"time": 2468, "text": "Is it truly science fiction at this point?"}, {"time": 2471, "text": "I think the field will progress, like I said, and that the system will be more and more complex in a way, right?"}, {"time": 2478, "text": "But there are properties that emerge from the human brain that have to do with the mind, that may have to do with consciousness, that may have to do with intelligence or whatever that we really don't understand even how they can emerge from an actual, real brain."}, {"time": 2495, "text": "And therefore, we can now measure or study in an organoid."}, {"time": 2499, "text": "So I think that this field, many, many years from now, may lead to the building of better neural circuits that really are built out of understanding of how this process really works."}, {"time": 2512, "text": "And it's hard to predict how complex this really will be."}, {"time": 2517, "text": "I really don't think we're so far from, it makes me laugh, really."}, {"time": 2521, "text": "It's really that far from building the human brain."}, {"time": 2525, "text": "But you're gonna be building something that is always a bad version of it, but that may have really powerful properties and might be able to respond to stimuli or be used in certain context."}, {"time": 2541, "text": "And this is why I really think that there is no other way to do this science, but within the right ethical framework, because where you're going with this is also, we can talk about science fiction and write that book, and we could today, but this work happens in a specific ethical framework that we don't decide just as scientists, but also as a society."}, {"time": 2564, "text": "So the ethical framework here is a fascinating one, is a complicated one."}, {"time": 2571, "text": "Do you have a sense, a grasp of how we think about ethically of building organoids from human stem cells to understand the brain?"}, {"time": 2584, "text": "It seems like a tool for helping potentially millions of people cure diseases or at least start the cure by understanding it."}, {"time": 2594, "text": "But is there more, is there gray areas that we have to think about ethically?"}, {"time": 2603, "text": "We must think about that."}, {"time": 2605, "text": "Every discussion about the ethics of this needs to be based on actual data from the models that we have today and from the ones that we will have tomorrow."}, {"time": 2616, "text": "So it's a continuous conversation."}, {"time": 2617, "text": "It's not something that you decide now."}, {"time": 2619, "text": "Today, there is no issue really."}, {"time": 2622, "text": "Very simple models that clearly can help you in many ways without much think about, but tomorrow we need to have another conversation and so on and so forth."}, {"time": 2633, "text": "And so the way we do this is to actually really bring together constantly a group of people that are not only scientists, but also bioethicists, the lawyers, philosophers, psychiatrists and so on, psychologists and so on and so forth to decide as a society really what we should and what we should not do."}, {"time": 2655, "text": "So that's the way to think about the ethics."}, {"time": 2657, "text": "Now, I also think though, that as a scientist, I have a moral responsibility."}, {"time": 2663, "text": "So if you think about how transformative it could be for understanding and curing a neuropsychiatric disease, to be able to actually watch and study and treat with drugs the very brain of the patient that you are trying to study."}, {"time": 2683, "text": "How transformative at this moment in time this could be."}, {"time": 2687, "text": "We couldn't do it five years ago, we could do it now, right?"}, {"time": 2690, "text": "If we didn't do it."}, {"time": 2691, "text": "Taking a stem cell of a particular patient."}, {"time": 2692, "text": "Patient and make an organoid for a simple and different from the human brain, it still is his process of brain development with his or her genetics."}, {"time": 2704, "text": "And we could understand perhaps what is going wrong."}, {"time": 2708, "text": "Perhaps we could use as a platform, as a cellular platform to screen for drugs, to fix a process and so on and so forth, right?"}, {"time": 2715, "text": "So we could do it now, we couldn't do it five years ago."}, {"time": 2718, "text": "Should we not do it?"}, {"time": 2720, "text": "What is the downside of doing it?"}, {"time": 2724, "text": "I don't see a downside at this very moment."}, {"time": 2727, "text": "If we invited a lot of people, I'm sure there would be somebody who would argue against it."}, {"time": 2733, "text": "What would be the devil's advocate argument?"}, {"time": 2739, "text": "So it's exactly perhaps what you alluded at with your question, that you are enabling some process of formation of the brain that could be misused at some point, or that could be showing properties that ethically we don't wanna see in a tissue."}, {"time": 2763, "text": "So today, I repeat, today, this is not an issue."}, {"time": 2767, "text": "And so you just gain dramatically from the science without, because the system is so simple and so different in a way from the actual brain."}, {"time": 2777, "text": "But because it is the brain, we have an obligation to really consider all of this, right?"}, {"time": 2783, "text": "And again, it's a balanced conversation where we should put disease and betterment of humanity also on that plate."}, {"time": 2792, "text": "What do you think, at least historically, there was some politicization, politicization of embryonic stem cells, a stem cell research."}, {"time": 2806, "text": "Do you still see that out there?"}, {"time": 2809, "text": "Is that still a force that we have to think about, especially in this larger discourse that we're having about the role of science in at least American society?"}, {"time": 2820, "text": "Yeah, this is a very good question."}, {"time": 2823, "text": "It's very, very important."}, {"time": 2824, "text": "I see a very central role for scientists to inform decisions about what we should or should not do in society."}, {"time": 2834, "text": "And this is because the scientists have the firsthand look and understanding of really the work that they are doing."}, {"time": 2843, "text": "And again, this varies depending on what we're talking about here."}, {"time": 2847, "text": "So now we're talking about brain organoids."}, {"time": 2851, "text": "I think that the scientists need to be part of that conversation about what is, will be allowed in the future or not allowed in the future to do with the system."}, {"time": 2860, "text": "And I think that is very, very important because they bring the reality of data to the conversation."}, {"time": 2868, "text": "And so they should have a voice."}, {"time": 2871, "text": "So data should have a voice."}, {"time": 2873, "text": "Data needs to have a voice."}, {"time": 2875, "text": "Because in not only data, we should also be good at communicating with non scientists, the data."}, {"time": 2884, "text": "So there has been often time, there is a lot of discussion and, you know, excitement and fights about certain topics just because of the way they are described."}, {"time": 2899, "text": "I'll give you an example."}, {"time": 2900, "text": "If I called the same cellular system we just talked about a brain organoid, or if I called it a human mini brain, your reaction is gonna be very different to this."}, {"time": 2914, "text": "And so the way the systems are described, I mean, we and journalists alike need to be a bit careful that this debate is a real debate and informed by real data."}, {"time": 2926, "text": "That's all I'm asking."}, {"time": 2927, "text": "And yeah, the language matters here."}, {"time": 2929, "text": "So I work on autonomous vehicles and there the use of language could drastically change the interpretation and the way people feel about what is the right way to proceed forward."}, {"time": 2941, "text": "You are, as I've seen from a presentation, you're a parent."}, {"time": 2946, "text": "I saw you show a couple of pictures of your son."}, {"time": 2949, "text": "Is it just the one?"}, {"time": 2951, "text": "Two."}, {"time": 2953, "text": "Son and a daughter."}, {"time": 2954, "text": "So what have you learned from the human brain by raising two of them?"}, {"time": 2960, "text": "More than I could ever learn in the lab."}, {"time": 2964, "text": "What have I learned?"}, {"time": 2965, "text": "I've learned that children really have these amazing plastic minds, right?"}, {"time": 2970, "text": "That we have a responsibility to, you know, foster their growth in good, healthy ways."}, {"time": 2978, "text": "That keep them curious, that keeps them adventurous, that doesn't raise them in fear of things."}, {"time": 2985, "text": "But also respecting who they are, which is in part, you know, coming from the genetics we talked about."}, {"time": 2991, "text": "My children are very different from each other despite the fact that they're the product of the same two parents."}, {"time": 2998, "text": "I also learned that what you do for them comes back to you."}, {"time": 3003, "text": "Like, you know, if you're a good parent, you're gonna, most of the time, have, you know, perhaps a decent kids at the end."}, {"time": 3011, "text": "So what do you think, just a quick comment, what do you think is the source of that difference?"}, {"time": 3016, "text": "That's often the surprising thing for parents."}, {"time": 3020, "text": "Is that they can't believe that our kids, oh, they're so different, yet they came from the same parents."}, {"time": 3028, "text": "Well, they are genetically different."}, {"time": 3029, "text": "Even they came from the same two parents because the mixing of gametes, you know, we know this genetics, creates every time a genetically different individual, which will have a specific mix of genes that is a different mix every time from the two parents."}, {"time": 3046, "text": "And so they're not twins."}, {"time": 3050, "text": "They are genetically different."}, {"time": 3052, "text": "Even just that little bit of variation, because you said really from a biological perspective, the brains look pretty similar."}, {"time": 3060, "text": "Well, so let me clarify that."}, {"time": 3062, "text": "So the genetics you have, the genes that you have, that play that beautiful orchestrated symphony of development, different genes will play it slightly differently."}, {"time": 3073, "text": "It's like playing the same piece of music, but with a different orchestra and a different director."}, {"time": 3080, "text": "The music will not come out."}, {"time": 3081, "text": "It will be still a piece by the same author, but it will come out differently if it's played by the high school orchestra instead of the Scala in Milan."}, {"time": 3094, "text": "And so you are born superficially with the same brain."}, {"time": 3099, "text": "It has the same cell types, similar patterns of connectivity, but the properties of the cells and how the cells will then react to the environment as you experience your world will be also shaped by who genetically you are."}, {"time": 3113, "text": "Speaking just as a parent, this is not something that comes from my work."}, {"time": 3116, "text": "I think you can tell at birth that these kids are different, that they have a different personality in a way, right?"}, {"time": 3125, "text": "So both is needed, the genetics, as well as the nurturing afterwards."}, {"time": 3131, "text": "So you are one human with a brain, sort of living through the whole mess of it, the human condition, full of love, maybe fear, ultimately mortal."}, {"time": 3144, "text": "How has studying the brain changed the way you see yourself?"}, {"time": 3147, "text": "When you look in the mirror, when you think about your life, the fears, the love, when you see your own life, your own mortality."}]}]