[{"title": "Manolis Kellis: Meaning of Life, the Universe, and Everything | Lex Fridman Podcast #142", "id": "bgNzUxyS-kQ", "quotes": [{"time": 344, "text": "And my daughter who's six is like, oh, can I please see the pictures?"}, {"time": 348, "text": "And Jonathan, who's eight, so my daughter Cleo is like, oh, let's look at the pictures."}, {"time": 354, "text": "And my son Jonathan, he's like, but Cleo, if you look at the pictures, it's just an image."}, {"time": 360, "text": "If you just close your eyes and listen, it's a video."}, {"time": 366, "text": "And he's basically showing just how much more the human imagination has besides just a few images that, you know, the book will give you."}, {"time": 374, "text": "And then another one, oh gosh, this one is really like miserable."}, {"time": 377, "text": "It's called Sto Perigiali, To Krifo."}, {"time": 383, "text": "And it's basically describing how vigorously we took on our life and we pushed hard towards a direction that we then realized was the wrong one."}, {"time": 396, "text": "And again, these songs give you so much perspective."}, {"time": 399, "text": "There's no songs like that in English that will basically sort of just smack you in the face about sort of the passion and the force and the drive."}, {"time": 407, "text": "And then it turns out, we just followed the wrong life."}, {"time": 411, "text": "And it's like, wow."}, {"time": 414, "text": "Okay, so that was you."}, {"time": 415, "text": "All right, so that's like before 12."}, {"time": 417, "text": "So growing up in sort of this horrendously miserable sort of view of romanticism, of suffering."}, {"time": 427, "text": "So then my preteen years is like, you know, learning English through songs."}, {"time": 432, "text": "So basically, you know, listening to all the American pop songs and then memorizing them vocally before I even knew what they meant."}, {"time": 439, "text": "So, you know, Madonna and Michael Jackson and all of these sort of really popular songs and, you know, George Michael and just songs that I would just listen to the radio and repeat vocally."}, {"time": 450, "text": "And eventually as I started learning English, I was like, oh wow, this thing I've been repeating, I now understand what it means."}, {"time": 456, "text": "Without relistening it to it, but just with re repeating it, it was like, oh."}, {"time": 461, "text": "Again, Michael Jackson's Man in the Mirror is teaching you that it's your responsibility to just improve yourself."}, {"time": 469, "text": "You know, if you wanna make the world a better place, take a look at yourself and make the change."}, {"time": 472, "text": "This whole concept of, again, I mean, all of these songs, you can listen to them shallowly or you can just listen to them and say, oh, there's deeper meaning here."}, {"time": 480, "text": "And I think there's a certain philosophy of song as a way of touching the psyche."}, {"time": 486, "text": "So if you look at regions of the brain, people have lost their language ability because they have an accident in that region of the brain can actually sing because it's exactly the symmetric region of the brain."}, {"time": 498, "text": "And that again, teaches you so much about language evolution and sort of the duality of musicality and, you know, rhythmic patterns and eventually language."}, {"time": 511, "text": "Do you have a sense of why songs developed?"}, {"time": 514, "text": "You're kind of suggesting that it's possible that there is something important about our connection with song and with music on the level of the importance of language."}, {"time": 527, "text": "It's not just possible."}, {"time": 528, "text": "In my view, language comes after music."}, {"time": 531, "text": "Language comes after song."}, {"time": 533, "text": "Like basically, my view of human cognitive evolution is rituals."}, {"time": 538, "text": "If you look at many early cultures, there's rituals around every stage of life."}, {"time": 544, "text": "There's organized dance performances around mating."}, {"time": 550, "text": "And if you look at mate selection, I mean, that's an evolutionary drive right there."}, {"time": 554, "text": "So basically, if you're not able to string together a complex dance as a bird, you don't get a mate."}, {"time": 559, "text": "And that actually forms this development for many song learning birds."}, {"time": 565, "text": "Not every bird knows how to sing."}, {"time": 567, "text": "And not every bird knows how to learn a complicated song."}, {"time": 571, "text": "So basically, there's birds that simply have the same few tunes that they know how to play."}, {"time": 576, "text": "And a lot of that is inherent and genetically encoded."}, {"time": 579, "text": "And others are birds that learn how to sing."}, {"time": 582, "text": "And if you look at a lot of these exotic birds of paradise and stuff like that, the mating rituals that they have are enormously amazing."}, {"time": 591, "text": "And I think human mating rituals of ancient tribes are not very far off from that."}, {"time": 596, "text": "And in my view, the sequential formation of these movements is a prelude to the cognitive capabilities that ultimately enable language."}, {"time": 608, "text": "It is fascinating to think that that's not just an accidental precursor to intelligence."}, {"time": 613, "text": "Yeah, sexually selected."}, {"time": 616, "text": "Well, it's sexually selected and it's a prerequisite."}, {"time": 620, "text": "It's like, it's required for intelligence."}, {"time": 621, "text": "And even as language has now developed, I think the artistic expression is needed, like badly needed by our brain."}, {"time": 631, "text": "So it's not just that, oh, our brain can kind of, you know, take a break and go do that stuff."}, {"time": 636, "text": "No, I mean, you know, I don't know if you remember that scene from, oh gosh, where's that Jack Nicholson movie in New Hampshire."}, {"time": 644, "text": "All work and no play, make Jack a dull boy."}, {"time": 647, "text": "A dull boy."}, {"time": 651, "text": "So there's this amazing scene where he's constantly trying to concentrate and what's coming out of the typewriter is just gibberish."}, {"time": 658, "text": "And I have that image as well when I'm working."}, {"time": 661, "text": "And I'm like, no, basically all of these crazy, you know, huge number of hobbies that I have, they're not just tolerated by my work."}, {"time": 669, "text": "They're required by my work."}, {"time": 672, "text": "This ability of sort of stretching your brain in all these different directions is connecting your emotional self and your cognitive self."}, {"time": 680, "text": "And that's a prerequisite to being able to be cognitively capable."}, {"time": 684, "text": "At least in my view."}, {"time": 685, "text": "Yeah, I wonder if the world without art and music, you're just making me realize that perhaps that world would be not just devoid of fun things to look at or listen to, but devoid of all the other stuff."}, {"time": 698, "text": "All the bridges and rockets and science."}, {"time": 702, "text": "Creativity is not disconnected from art."}, {"time": 705, "text": "And you know, my kids, I mean, you know, I could be doing the full math treatment to them."}, {"time": 710, "text": "No, they play the piano and they play the violin and they play sports."}, {"time": 714, "text": "I mean, this whole, you know, sort of movement and going through mazes and playing tennis and, you know, playing soccer and avoiding obstacles and all of that, that forms your three dimensional view of the world."}, {"time": 729, "text": "Being able to actually move and run and play in three dimensions is extremely important for math, for, you know, stringing together complicated concepts."}, {"time": 737, "text": "It's the same underlying cognitive machinery that is used for navigating mazes and for navigating theorems and sort of solving equations."}, {"time": 748, "text": "So I can't, you know, I can't have a conversation with my students without, you know, sort of either using my hands or opening the whiteboard in Zoom and just constantly drawing."}, {"time": 761, "text": "Or, you know, back when we had in person meetings, just the whiteboard on my own."}, {"time": 764, "text": "The whiteboard, yeah, that's fascinating to think about."}, {"time": 767, "text": "So that's Michael Jackson, man, Mirror, Careless Whisper with George Michael, which is a song I like."}, {"time": 773, "text": "You can say Careless Whisper."}, {"time": 774, "text": "I mean, I didn't say that."}, {"time": 776, "text": "That's too popular for you."}, {"time": 777, "text": "I had recorded, no, no, no, that it's an amazing song for me."}, {"time": 781, "text": "I had recorded a small part of it as it's played at the tail end of the radio."}, {"time": 785, "text": "And I had a tape where I only had part of that song and I just played it over and over and over again, just so beautiful."}, {"time": 795, "text": "That song is almost Greek."}, {"time": 797, "text": "I know, and George Michael is Greek."}, {"time": 799, "text": "Is he Greek?"}, {"time": 799, "text": "He's Greek, of course."}, {"time": 800, "text": "George Michaelides, I mean, he's Greek."}, {"time": 803, "text": "I did not know this."}, {"time": 804, "text": "Now you know."}, {"time": 805, "text": "I'm so sorry to offend you so deeply not knowing this."}, {"time": 810, "text": "So, okay, so what's..."}, {"time": 811, "text": "So anyway, so we're moving to France when I'm 12 years old."}, {"time": 813, "text": "And now I'm getting into the songs of Gainsbourg."}, {"time": 816, "text": "So Gainsbourg is this incredible French composer."}, {"time": 819, "text": "He is always seen on stage, like not even pretending to try to please, just like with his cigarette, just like rrrr mumbling his songs."}, {"time": 827, "text": "But the lyrics are unbelievable."}, {"time": 829, "text": "Like basically entire sentences will rhyme."}, {"time": 833, "text": "He will say the same thing twice and you're like, whoa."}, {"time": 838, "text": "And in fact, another, speaking of Greek, a French Greek, George Mustaky, this song is just magnificent."}, {"time": 855, "text": "A Greek word, it's a French word for a Greek word."}, {"time": 857, "text": "But met comes from meta, and then ec from Ikea, from ecology, which means home."}, {"time": 866, "text": "So with my face of a migrant, and you'll love this one."}, {"time": 870, "text": "De juif errant, de patre grecque, of a meandering Jew, of Greek pastor."}, {"time": 879, "text": "So again, the Russian Greek, the Jewish Orthodox connection, so."}, {"time": 885, "text": "Aime mes cheveux au quatre vents, with my hair in the four wings."}, {"time": 893, "text": "Avec, with my eyes that are all washed out, who give me the pretense of dreaming, but who don't dream that much anymore."}, {"time": 901, "text": "With my hands of thief, of musician, and who have stolen so many gardens."}, {"time": 908, "text": "With my mouth that has drunk, that has kissed, and that has bitten, without ever pleasing its hunger."}, {"time": 917, "text": "With my skin that has been rubbed in the sun of all the summers, and anything that was wearing a skirt."}, {"time": 929, "text": "With my heart, and then you have to listen to this verse, it's so beautiful."}, {"time": 933, "text": "Avec mon coeur qui a su faire souffrir autant qu il a souffert."}, {"time": 938, "text": "Qui a su faire."}, {"time": 939, "text": "With my heart that knew how to make suffer as much as it suffered, but was able to, that knew how to make, in French it's actually su faire, that knew how to make."}, {"time": 954, "text": "Qui a su faire souffrir autant qu il a souffert."}, {"time": 957, "text": "Verses that span the whole thing."}, {"time": 959, "text": "It's just beautiful."}, {"time": 960, "text": "Do you know, on a small tangent, do you know Jacques Brel?"}, {"time": 967, "text": "And then Ne Me Kite Pas, those songs."}, {"time": 970, "text": "That song gets me every time."}, {"time": 972, "text": "So there's a cover of that song by one of my favorite female artists."}, {"time": 977, "text": "Not Nina Simone."}, {"time": 979, "text": "Modern?"}, {"time": 980, "text": "Carol Emerald."}, {"time": 981, "text": "She's from Amsterdam."}, {"time": 984, "text": "And she has a version of Ne Me Kite Pas where she's actually added some English lyrics."}, {"time": 991, "text": "And it's really beautiful."}, {"time": 993, "text": "But again, Ne Me Kite Pas is just so, I mean it's, you know, the promises, the volcanoes that will restart."}, {"time": 1004, "text": "I love, there's not many songs that show such depth of desperation for another human being."}, {"time": 1012, "text": "That's so powerful."}, {"time": 1021, "text": "And then high school."}, {"time": 1022, "text": "Now I'm starting to learn English."}, {"time": 1023, "text": "So I moved to New York."}, {"time": 1025, "text": "So Sting's Englishman in New York."}, {"time": 1028, "text": "Magnificent song."}, {"time": 1029, "text": "And again, there's if manners maggoth manners someone said then he's the hero of the day."}, {"time": 1036, "text": "It takes a man to suffer ignorance and smile."}, {"time": 1040, "text": "Be yourself no matter what they say."}, {"time": 1043, "text": "And then takes more than combat gear to make a man."}, {"time": 1047, "text": "Takes more than a license for a gun."}, {"time": 1050, "text": "Confront your enemies, avoid them when you can."}, {"time": 1054, "text": "A gentleman will walk but never run."}, {"time": 1057, "text": "It's again, you're talking about songs that teach you how to live."}, {"time": 1061, "text": "I mean, this is one of them."}, {"time": 1062, "text": "Basically says, it's not the combat gear that makes a man."}, {"time": 1066, "text": "Where's the part where he says, there you go."}, {"time": 1069, "text": "Gentleness so brighty are rare in this society."}, {"time": 1073, "text": "At night a candle's brighter than the sun."}, {"time": 1076, "text": "So beautiful."}, {"time": 1077, "text": "He basically says, well, you just might be the only one."}, {"time": 1080, "text": "Modesty propriety can lead to notoriety."}, {"time": 1083, "text": "You could end up as the only one."}, {"time": 1085, "text": "It's, it basically tells you, you don't have to be like the others."}, {"time": 1089, "text": "Be yourself, show kindness, show generosity."}, {"time": 1094, "text": "Don't, you know, don't let that anger get to you."}, {"time": 1098, "text": "You know, the song Fragile."}, {"time": 1099, "text": "How fragile we are, how fragile we are."}, {"time": 1102, "text": "So again, as in Greece, I didn't even know what that meant."}, {"time": 1106, "text": "How fragile we are, but the song was so beautiful."}, {"time": 1108, "text": "And then eventually I learned English and I actually understand the lyrics."}, {"time": 1111, "text": "And the song is actually written after the Contras murdered Ben Linder in 1987."}, {"time": 1119, "text": "And the US eventually turned against supporting these guerrillas."}, {"time": 1124, "text": "And it was just a political song, but so such a realization that you can't win with violence basically."}, {"time": 1131, "text": "And that song starts with the most beautiful poetry."}, {"time": 1135, "text": "So if blood will flow when flesh and steel are one, drying in the color of the evening sun, tomorrow's rain will wash the stains away, but something in our minds will always stain."}, {"time": 1151, "text": "Perhaps this final act was meant to clinch a lifetime's argument that nothing comes through violence and nothing ever could."}, {"time": 1161, "text": "For all those born beneath an angry star, lest we forget how fragile we are."}, {"time": 1168, "text": "Damn, right?"}, {"time": 1171, "text": "I mean, that's poetry."}, {"time": 1175, "text": "And he's using the English language is just such a refined way with deep meanings, but also words that rhyme just so beautifully and evocations of when flesh and steel are one."}, {"time": 1190, "text": "I mean, it's just mind boggling."}, {"time": 1193, "text": "And then of course the refrain that everybody remembers is on and on the rain will fall, et cetera."}, {"time": 1200, "text": "But like this beginning."}, {"time": 1200, "text": "Tears from a star, wow."}, {"time": 1203, "text": "And again, tears from a star, how fragile we are."}, {"time": 1206, "text": "I mean, just these rhymes are just flowing so naturally."}, {"time": 1210, "text": "Something, it seems that more meaning comes when there's a rhythm that, I don't know what that is."}, {"time": 1216, "text": "That probably connects to exactly what you were saying."}, {"time": 1218, "text": "And if you pay close attention, you will notice that the more obvious words sometimes are the second verse and the less obvious are often the first verse because it makes the second verse flow much more naturally because otherwise it feels contrived."}, {"time": 1233, "text": "Oh, you went and found this like unusual word."}, {"time": 1236, "text": "In Dark Moments, the whole album of Pink Floyd and the movie just marked me enormously as a teenager, just the wall."}, {"time": 1245, "text": "And there's one song that never actually made it into the album that's only there in the movie about when the tigers broke free and the tigers are the tanks of the Germans."}, {"time": 1255, "text": "And it just describes, again, this vivid imagery."}, {"time": 1258, "text": "It was just before dawn, one miserable morning in Black 44 when the forward commander was told to sit tight when he asked that his men be withdrawn."}, {"time": 1268, "text": "And the generals gave thanks as the other ranks held back the enemy tanks for a while."}, {"time": 1276, "text": "And the Anzio bridgehead was held for the price of a few hundred ordinary lives."}, {"time": 1284, "text": "So that's a theme that keeps coming back in Pink Floyd with Us Versus Them."}, {"time": 1288, "text": "Us and them, God only knows that's not what we would choose to do."}, {"time": 1296, "text": "For work he cried from the rear and the front rows died from another song."}, {"time": 1303, "text": "It's like this whole concept of Us Versus Them."}, {"time": 1306, "text": "And there's that theme of Us Versus Them again where the child is discovering how his father died when he finds an old and a found it one day in a drawer of old photographs hidden away."}, {"time": 1318, "text": "And my eyes still grow damp to remember his majesty's sign with his own rubber stamp."}, {"time": 1325, "text": "So it's so ironic because it seems the way that he's writing it that he's not crying because his father was lost."}, {"time": 1331, "text": "He's crying because kind old King George took the time to actually write mother a note about the fact that his father died."}, {"time": 1339, "text": "It's so ironic because it basically says we are just ordinary men and of course we're disposable."}, {"time": 1346, "text": "So I don't know if you know the root of the word pioneers but you had a chess board here earlier, a pawn."}, {"time": 1354, "text": "In French, it's a pigeon."}, {"time": 1356, "text": "They are the ones that you send to the front to get murdered, slaughtered."}, {"time": 1360, "text": "This whole concept of pioneers having taken this whole disposable ordinary men to actually be the ones that we're now treating as heroes."}, {"time": 1368, "text": "So anyway, there's this juxtaposition of that."}, {"time": 1370, "text": "And then the part that always just strikes me is the music and the tonality totally changes."}, {"time": 1376, "text": "And now he describes the attack."}, {"time": 1379, "text": "It was dark all around."}, {"time": 1380, "text": "There was frost in the ground."}, {"time": 1382, "text": "When the tigers broke free and no one survived from the Royal Fusiliers company."}, {"time": 1390, "text": "They were all left behind."}, {"time": 1393, "text": "Most of them dead."}, {"time": 1395, "text": "The rest of them dying."}, {"time": 1398, "text": "And that's how the high command took my daddy from me."}, {"time": 1404, "text": "And that song, even though it's not in the album, explains the whole movie."}, {"time": 1409, "text": "Cause it's this movie of misery."}, {"time": 1411, "text": "It's this movie of someone being stuck in their head and not being able to get out of it."}, {"time": 1416, "text": "There's no other movie that I think has captured so well this prison that is someone's own mind."}, {"time": 1424, "text": "And this wall that you're stuck inside and this feeling of loneliness."}, {"time": 1430, "text": "And sort of, is there anybody out there?"}, {"time": 1434, "text": "And you know, sort of, hello, hello."}, {"time": 1436, "text": "Is there anybody in there?"}, {"time": 1438, "text": "Just nod if you can hear me."}, {"time": 1440, "text": "Is there anyone home?"}, {"time": 1444, "text": "Come on, yo."}, {"time": 1446, "text": "I hear you're feeling down."}, {"time": 1448, "text": "Just one minute, I hear you nodding in again."}, {"time": 1456, "text": "Yeah, the prison of your mind."}, {"time": 1458, "text": "So those are the darker moments."}, {"time": 1459, "text": "Exactly, these are the darker moments."}, {"time": 1462, "text": "Yeah, in the darker moments, the mind does feel like you're trapped alone in a room with it."}, {"time": 1470, "text": "Yeah, and there's this scene in the movie which like, where he just breaks out with his guitar and there's this prostitute in the room."}, {"time": 1476, "text": "She starts throwing stuff and then he like, you know breaks the window, he throws the chair outside."}, {"time": 1481, "text": "And then you see him laying in the pool with his own blood, like, you know, everywhere."}, {"time": 1485, "text": "And then there's these endless hours spent fixing every little thing and lining it up."}, {"time": 1491, "text": "And it's this whole sort of mania versus, you know you can spend hours building up something and just destroy it in a few seconds."}, {"time": 1499, "text": "One of my turns is that song."}, {"time": 1501, "text": "And it's like, I feel cold as a tourniquet right as a manor."}, {"time": 1510, "text": "Dry as a funeral drum."}, {"time": 1513, "text": "And then the music also is like, run to the bedroom."}, {"time": 1517, "text": "There's a suitcase on the left."}, {"time": 1519, "text": "There you find my favorite acts."}, {"time": 1523, "text": "Don't look so frightened."}, {"time": 1524, "text": "This is just a passing phase."}, {"time": 1527, "text": "One of my bad days."}, {"time": 1531, "text": "I need to rewatch it."}, {"time": 1532, "text": "That's so, you're making me realize."}, {"time": 1534, "text": "But imagine watching this as a teenager."}, {"time": 1535, "text": "It like ruins your mind."}, {"time": 1537, "text": "It's like so many, it's such harsh imagery."}, {"time": 1542, "text": "And then, you know, anyway, so there's the dark moment."}, {"time": 1546, "text": "And then again, going back to Sting now it's the political songs, Russians."}, {"time": 1551, "text": "And I think that song should be a new national anthem for the US, not for Russians, but for red versus blue."}, {"time": 1558, "text": "Mr. Khrushchev says we will bury you."}, {"time": 1562, "text": "I don't subscribe to this point of view."}, {"time": 1566, "text": "It'd be such an ignorant thing to do if the Russians love their children too."}, {"time": 1575, "text": "It's basically saying the Russians are just as humans as we are."}, {"time": 1581, "text": "There's no way that they're gonna let their children die."}, {"time": 1584, "text": "And then it's just so beautiful."}, {"time": 1586, "text": "How can I save my innocent boy from Oppenheimer's deadly toy?"}, {"time": 1593, "text": "And now that's the new national anthem, are you reading?"}, {"time": 1596, "text": "There is no monopoly of common sense on either side of the political fence."}, {"time": 1603, "text": "We share the same biology regardless of ideology."}, {"time": 1610, "text": "Believe me when I say to you, I hope the Russians love their children too."}, {"time": 1620, "text": "There's no such thing as a winnable war."}, {"time": 1623, "text": "It's a lie we don't believe anymore."}, {"time": 1628, "text": "I mean, it's beautiful, right?"}, {"time": 1630, "text": "And for God's sake, America, wake up."}, {"time": 1633, "text": "These are your fellow Americans."}, {"time": 1635, "text": "They're your fellow biology."}, {"time": 1644, "text": "There's no crisper, simpler way to say Russians love their children too, the common humanity."}, {"time": 1651, "text": "And remember what I was telling you, I think in one of our first podcasts about the daughter who's crying for her brother to come back for more."}, {"time": 1660, "text": "And then the Virgin Mary appears and says, who should I take instead?"}, {"time": 1664, "text": "This Turk, here's his family, here's his children."}, {"time": 1667, "text": "This other one, he just got married, et cetera."}, {"time": 1671, "text": "And that basically says, no."}, {"time": 1673, "text": "I mean, if you look at the Lord of the Rings, the enemies are these monsters, they're not human."}, {"time": 1679, "text": "And that's what we always do."}, {"time": 1680, "text": "We always say, they're not like us, they're different."}, {"time": 1684, "text": "They're not humans, et cetera."}, {"time": 1686, "text": "So there's this dehumanization that has to happen for people to go to war."}, {"time": 1691, "text": "If you realize just how close we are genetically, one with the other, this whole 99.9% identical, you can't bear weapons against someone who's like that."}, {"time": 1702, "text": "And the things that are the most meaningful to us in our lives at every level is the same on all sides, on both sides."}, {"time": 1710, "text": "So it's not just that we're genetically the same."}, {"time": 1712, "text": "Yeah, we're ideologically the same."}, {"time": 1714, "text": "We love our children, we love our country."}, {"time": 1716, "text": "We will fight for our family."}, {"time": 1720, "text": "So, and the last one I mentioned last time we spoke, which is Joni Mitchell's Both Sides Now."}, {"time": 1727, "text": "So she has three rounds, one on clouds, one on love, and one on life."}, {"time": 1785, "text": "But now old friends are acting strange They shake their heads, they say I've changed Well, something's lost and something's gained In living every day So again, that's growing up and realizing that, well, the view that you had as a kid is not necessarily that you have as an adult."}, {"time": 1807, "text": "Remember my poem from when I was 16 years old of this whole, you know, children dance now all in row and then in the end, even though the snow seems bright, without you have lost their light, sun that sang and moon that smiled."}, {"time": 1819, "text": "So this whole concept of, if you have love and if you have passion, you see the exact same thing from a different way."}, {"time": 1826, "text": "You can go out running in the rain or you could just stay in and say, ah, sucks, I won't be able to go outside now."}, {"time": 1833, "text": "Those sides."}, {"time": 1834, "text": "Anyway, and the last one is, last, last one I promise, Leonard Cohen."}, {"time": 1838, "text": "This is amazing by the way."}, {"time": 1839, "text": "I'm so glad we stumbled on how much joy you have in so many avenues of life and music is just one of them."}, {"time": 1850, "text": "But yes, Leonard Cohen."}, {"time": 1852, "text": "Going back to Leonard Cohen, since that's where you started."}, {"time": 1854, "text": "So Leonard Cohen's Dance Me to the End of Love."}, {"time": 1856, "text": "That was our opening song in our wedding with my wife."}, {"time": 1859, "text": "Oh no, that's good."}, {"time": 1860, "text": "As we came out to greet the guests, it was Dance Me to the End of Love."}, {"time": 1863, "text": "And then another one, which is just so passionate always and we always keep referring back to it is I'm Your Man."}, {"time": 1869, "text": "And it goes on and on about sort of, I can be every type of lover for you."}, {"time": 1874, "text": "And what's really beautiful in marriage is that we live that with my wife every day."}, {"time": 1880, "text": "You can have the passion, you can have the anger, you can have the love, you can have the tenderness."}, {"time": 1885, "text": "There's just so many gems in that song."}, {"time": 1888, "text": "If you want a partner, take my hand."}, {"time": 1891, "text": "Or if you want to strike me down in anger, here I stand, I'm your man."}, {"time": 1899, "text": "Then if you want a boxer, I will step into the ring for you."}, {"time": 1903, "text": "If you want a driver, climb inside."}, {"time": 1906, "text": "Or if you want to take me for a ride, you know you can."}, {"time": 1910, "text": "So this whole concept of you want to drive, I'll follow."}, {"time": 1913, "text": "You want me to drive, I'll drive."}, {"time": 1916, "text": "And the difference I would say between like that and Nemaki Tapa is this song, he's got an attitude."}, {"time": 1921, "text": "He's like, he's proud of his ability to basically be any kind of man for as long as opposed to the Jacques Brel like desperation of what do I have to be for you to love me, that kind of desperation."}, {"time": 1937, "text": "But notice there's a parallel here."}, {"time": 1940, "text": "There's a verse that is perhaps not paid attention to as much which says, ah, but a man never got a woman back, not by begging on his knees."}, {"time": 1952, "text": "So it seems that the I'm your man is actually an apology song in the same way that Nemaki Tapa is an apology song."}, {"time": 1960, "text": "Nemaki Tapa basically says I've screwed up."}, {"time": 1964, "text": "I'm sorry, baby."}, {"time": 1965, "text": "And in the same way that the Careless Whisper is I'm screwed up."}, {"time": 1970, "text": "I'm never gonna dance again."}, {"time": 1972, "text": "Guilty feet have got no rhythm."}, {"time": 1977, "text": "So this is an apology song, not by begging on his knees or I'd crawl to you, baby, and I'd fall at your feet and I'd howl at your beauty like a dog in heat and I'd claw at your heart and I'd tear at your sheet."}, {"time": 1991, "text": "I'd say please."}, {"time": 1993, "text": "And then the last one is so beautiful."}, {"time": 1998, "text": "If you want a father for your child or only want to walk with me a while across the sand, I'm your man."}, {"time": 2010, "text": "That's the last verses which basically says you want me for a day?"}, {"time": 2015, "text": "I'll be there."}, {"time": 2016, "text": "Do you want me to just walk?"}, {"time": 2018, "text": "You want me for life?"}, {"time": 2019, "text": "Do you want a father for your child?"}, {"time": 2021, "text": "I'll be there too."}, {"time": 2024, "text": "Remember how I told you I was gonna finish with a lighthearted song?"}, {"time": 2028, "text": "Last one."}, {"time": 2029, "text": "So Alison Krauss and Union Station, country song, believe it or not, the lucky one."}, {"time": 2037, "text": "So I've never identified as much with the lyrics of a song as this one."}, {"time": 2045, "text": "And it's hilarious."}, {"time": 2046, "text": "My friend, Serafim Batoglou, is the guy who got me to genomics in the first place."}, {"time": 2051, "text": "I owe enormously to him."}, {"time": 2053, "text": "And he's another Greek."}, {"time": 2054, "text": "We actually met dancing, believe it or not."}, {"time": 2056, "text": "So we used to perform Greek dances."}, {"time": 2058, "text": "I was the president of the International Students Association."}, {"time": 2060, "text": "So we put on these big performances for 500 people at MIT."}, {"time": 2064, "text": "And there's a picture on the MIT Tech where Serafim, who's like a bodybuilder, was holding me on his shoulder."}, {"time": 2070, "text": "And I was like doing maneuvers in the air, basically."}, {"time": 2074, "text": "So anyway, this guy, Serafim, we were driving back from a conference."}, {"time": 2080, "text": "And there's this Russian girl who was describing how every member of her family had been either killed by the communists or killed by the Germans or killed by the, like, she had just like, you know, misery, like death and, you know, sickness and everything."}, {"time": 2094, "text": "Everyone was decimated in her family."}, {"time": 2096, "text": "She was the last standing member."}, {"time": 2097, "text": "And we stopped at a, Serafim was driving and we stopped at a rest area."}, {"time": 2102, "text": "And he takes me aside and he's like, Manolis, we're gonna crash."}, {"time": 2107, "text": "Get her out of my car."}, {"time": 2110, "text": "And then he basically says, but I'm only reassured because you're here with me."}, {"time": 2114, "text": "And I'm like, what do you mean?"}, {"time": 2115, "text": "He's like, you know, he's like, from your smile, I know you're the luckiest man on the planet."}, {"time": 2122, "text": "So there's this really funny thing where I just feel freaking lucky all the time."}, {"time": 2128, "text": "And it's a question of attitude."}, {"time": 2130, "text": "Of course, I'm not any luckier than any other person, but every time something horrible happens to me, I'm like, and in fact, even in that song, the song about sort of, you know, walking on the beach and this, you know, sort of taking our life the wrong way and then, you know, having to turn around."}, {"time": 2145, "text": "At some point he's like, you know, in the fresh sand, we wrote her name."}, {"time": 2153, "text": "So how nicely that the wind blew and the writing was erased."}, {"time": 2158, "text": "So again, it's this whole sort of, not just saying, oh, bummer, but, oh, great."}, {"time": 2165, "text": "I just lost this."}, {"time": 2166, "text": "This must mean something, right?"}, {"time": 2169, "text": "This horrible thing happened, it must open the door to a beautiful chapter."}, {"time": 2174, "text": "So, so Allison Krauss is talking about the lucky one."}, {"time": 2177, "text": "So I was like, oh my God, she wrote a song for me."}, {"time": 2181, "text": "And she goes, you're the lucky one, I know that now, as free as the wind blowing down the road, loved by many, hated by none, I'd say, you were lucky because you know what you've done, not the care in the world, not the worry inside."}, {"time": 2195, "text": "Everything's going to be all right because you're the lucky one."}, {"time": 2199, "text": "And then she goes, you're the lucky one, always having fun, a jack of all trades, a master of none."}, {"time": 2205, "text": "You look at the world with the smiling eyes and laugh at the devil as his train rolls by."}, {"time": 2210, "text": "I'll give you a song and a one night stand."}, {"time": 2213, "text": "You'll be looking at a happy man because you're the lucky one."}, {"time": 2217, "text": "It basically says, if you just don't worry too much, if you don't try to be a one trick pony, if you just embrace the fact that you might suck at a bunch of things, but you're just gonna try a lot of things."}, {"time": 2232, "text": "And then there's another verse that says, well, you're blessed I guess, but never knowing which road you're choosing, to you the next best thing to playing and winning is playing and losing."}, {"time": 2244, "text": "It's just so beautiful because he basically says, if you try your best, but it's still playing, if you lose, it's okay."}, {"time": 2256, "text": "You had an awesome game."}, {"time": 2258, "text": "And again, superficially, it sounds like a super happy song."}, {"time": 2263, "text": "But then there's the last verse basically says, no matter where you are, that's where you'll be."}, {"time": 2267, "text": "You can bet your luck won't follow me."}, {"time": 2270, "text": "Just give you a song and then one night stand, you'll be looking at a happy man."}, {"time": 2274, "text": "And then in the video of the song, she just walks away or he just walks away or something like that."}, {"time": 2279, "text": "And it basically tells you that freedom comes at a price."}, {"time": 2283, "text": "Freedom comes at the price of non commitment."}, {"time": 2285, "text": "This whole sort of birds who love or birds who cry, you can't really love unless you cry."}, {"time": 2291, "text": "You can't just be the lucky one, the happy boy, la la la, and yet have a long term relationship."}, {"time": 2298, "text": "So it's, on one hand, I identify with the shallowness of this song, of you know, you're the lucky one, jack of all trades, a master or none."}, {"time": 2306, "text": "But at the same time, I identify with a lesson of, well, you can't just be the happy, merry, go lucky all the time."}, {"time": 2313, "text": "Sometimes you have to embrace loss and sometimes you have to embrace suffering."}, {"time": 2317, "text": "And sometimes you have to embrace that."}, {"time": 2320, "text": "If you have a safety net, you're not really committing enough."}, {"time": 2324, "text": "You're not, you know, basically you're allowing yourself to slip."}, {"time": 2329, "text": "But if you just go all in and you just, you know, let go of your reservations, that's when you truly will get somewhere."}, {"time": 2336, "text": "So anyway, that's like the, I managed to narrow it down to what, 15 songs?"}, {"time": 2341, "text": "Thank you for that wonderful journey that you just took us on, the darkest possible places of Greek song to ending on this country song."}, {"time": 2353, "text": "I haven't heard it before, but that's exactly right."}, {"time": 2356, "text": "I feel the same way, depending on the day, is this the luckiest human on earth."}, {"time": 2362, "text": "And there's something to that, but you're right, it needs to be, we need to now return to the muck of life in order to be able to truly enjoy it."}, {"time": 2375, "text": "So it's... What do you mean muck?"}, {"time": 2376, "text": "What's muck?"}, {"time": 2378, "text": "The messiness of life."}, {"time": 2379, "text": "The things that were, things don't turn out the way you expect it to."}, {"time": 2384, "text": "So like, to feel like you're in the right place, to feel lucky, is like focusing on the beautiful consequences."}, {"time": 2392, "text": "But then that feeling of things being different than you expected, that you stumble in all the kinds of ways, that seems to be, needs to be paired with the feeling of luck."}, {"time": 2403, "text": "There's basically one way, the only way not to make mistakes, is to never do anything."}, {"time": 2410, "text": "Basically, you have to embrace the fact that you'll be wrong so many times."}, {"time": 2413, "text": "In so many research meetings, I just go off on a tangent and say, let's think about this for a second."}, {"time": 2418, "text": "And it's just crazy for me, who's a computer scientist, to just tell my biologist friends, what if biology kind of worked this way?"}, {"time": 2426, "text": "And they humor me."}, {"time": 2427, "text": "They just let me talk."}, {"time": 2429, "text": "And rarely has it not gone somewhere good."}, {"time": 2434, "text": "It's not that I'm always right, but it's always something worth exploring further, that if you're an outsider with humility and knowing that I'll be wrong a bunch of times, but I'll challenge your assumptions, and often take us to a better place, is part of this whole sort of messiness of life."}, {"time": 2454, "text": "Like if you don't try and lose and get hurt and suffer and cry and just break your heart and all these feelings of guilt and, wow, I did the wrong thing."}, {"time": 2466, "text": "Of course, that's part of life."}, {"time": 2467, "text": "And that's just something that, if you are a doer, you'll make mistakes."}, {"time": 2472, "text": "If you're a criticizer, yeah, sure, you can sit back and criticize everybody else for the mistakes they make."}, {"time": 2478, "text": "Or instead, you can just be out there making those mistakes."}, {"time": 2481, "text": "And frankly, I'd rather be the criticized one than the criticizer."}, {"time": 2484, "text": "Yeah, brilliantly put."}, {"time": 2485, "text": "Every time somebody steals my bicycle, I say, well, no, my son's like, why do they steal our bicycle, dad?"}, {"time": 2491, "text": "And I'm like, aren't you happy that you have bicycles that people can steal?"}, {"time": 2496, "text": "Aren't you happy that you have bicycles that people can steal?"}, {"time": 2499, "text": "I'd rather be the person stolen from than the stealer."}, {"time": 2501, "text": "Yeah, it's not the critic that counts."}, {"time": 2505, "text": "So that's, we've just talked amazingly about life from the music perspective."}, {"time": 2511, "text": "Let's talk about life from, human life, from perhaps other perspective and its meaning."}, {"time": 2517, "text": "So this is episode 142."}, {"time": 2520, "text": "There is perhaps an absurdly deep meaning to the number 42 that our culture has elevated."}, {"time": 2533, "text": "So this is a perfect time to talk about the meaning of life."}, {"time": 2536, "text": "We've talked about it already, but do you think this question that's so simple and so seemingly absurd has value of what is the meaning of life?"}, {"time": 2549, "text": "Is it something that raising the question and trying to answer it, is that a ridiculous pursuit or is there some value?"}, {"time": 2557, "text": "Is it answerable at all?"}, {"time": 2559, "text": "So first of all, I feel that we owe it to your listeners to say why 42?"}, {"time": 2566, "text": "So of course the Hitchhiker's Guide to the Galaxy came up with 42 as basically a random number."}, {"time": 2572, "text": "Just, you know, the author just pulled it out of a hat and he's admitted so."}, {"time": 2576, "text": "He said, well, 42 just seemed like just random numbers any."}, {"time": 2581, "text": "But in fact, there's many numbers that are linked to 42."}, {"time": 2585, "text": "So 42, again, just to summarize, is the answer that these super mega computer that had computed for a million years with the most powerful computer in the world had come up with."}, {"time": 2598, "text": "At some point, the computer says, I have an answer."}, {"time": 2603, "text": "And they're like, what?"}, {"time": 2605, "text": "It's like, you're not gonna like it."}, {"time": 2607, "text": "Like, what is it?"}, {"time": 2608, "text": "It's 42."}, {"time": 2610, "text": "And then the irony is that they had forgotten, of course, what the question was."}, {"time": 2614, "text": "So now they have to build a bigger computer to figure out what the question is, to which the answer is 42."}, {"time": 2619, "text": "So as I was turning 42, I basically sort of researched why 42 is such a cool number."}, {"time": 2625, "text": "And it turns out that, and I put together this little passage that was explaining to all those guests to my 42nd birthday party why we were talking about the meaning of life."}, {"time": 2634, "text": "And basically talked about how 42 is the angle at which light reflects off of water to create a rainbow."}, {"time": 2645, "text": "And it's so beautiful because the rainbow is basically the combination of sort of, it's been raining, but there's hope because the sun just came out."}, {"time": 2653, "text": "So it's a very beautiful number there."}, {"time": 2654, "text": "So 42 is also the sum of all rows and columns of a magic cube that contains all consecutive integers starting at one."}, {"time": 2662, "text": "So basically, if you take all integers between one and however many vertices there are, the sums is always 42."}, {"time": 2669, "text": "42 is the only number left under 100 for which the equation of X to the cube plus Y to the cube plus Z to the cube is N and was not known to not have a solution."}, {"time": 2682, "text": "And now it's the only one that actually has a solution."}, {"time": 2686, "text": "42 is also one, zero, one, zero, one, zero in binary."}, {"time": 2690, "text": "Again, the yin and the yang, the good and the evil, one and zero, the balance of the force."}, {"time": 2694, "text": "42 is the number of chromosomes for the giant panda."}, {"time": 2698, "text": "And the giant panda, I know it's totally random."}, {"time": 2701, "text": "It's a suspicious symbol of great strength coupled with peace, friendship, gentle temperament, harmony, balance, and friendship whose black and white colors again symbolize yin and yang."}, {"time": 2712, "text": "The reason why it's the symbol for China is exactly the strength, but yet peace and so on and so forth."}, {"time": 2719, "text": "So 42 chromosomes."}, {"time": 2721, "text": "It takes light 10 to the minus 42 seconds to cross the diameter of a proton connecting the two fundamental dimensions of space and time."}, {"time": 2731, "text": "42 is the number of times a piece of paper should be folded to reach beyond the moon, which is what I assume my students mean when they ask that their paper reaches for the stars."}, {"time": 2744, "text": "I just tell them just fold it a bunch of times."}, {"time": 2746, "text": "42 is the number of messier object, 42, which is Orion."}, {"time": 2754, "text": "And that's one of the most famous galaxies."}, {"time": 2758, "text": "It's I think also the place where we can actually see the center of our galaxy."}, {"time": 2763, "text": "42 is the numeric representation of the star symbol in ASCII, which is very useful when searching for the stars."}, {"time": 2770, "text": "And also a reg exp for life, the universe and everything."}, {"time": 2774, "text": "So star, in Egyptian mythology, the goddess Maat which was personifying truth and justice would ask 42 questions to every dying person."}, {"time": 2785, "text": "And those answering successfully would become stars continued to give life and fuel universal growth."}, {"time": 2791, "text": "In Judaic tradition, God ascribe the 42 lettered name and trusted only to the middle age pious meek free from bad temper, sober and not insistent on his rights."}, {"time": 2802, "text": "And in Christian tradition, there's 42 generations from Abraham, Isaac, that we talked about, the story of Isaac, Jacob, eventually Joseph, Mary and Jesus."}, {"time": 2811, "text": "In Kabbalistic tradition, Elocha, which is 42 is the number with which God creates the universe starting with 25, let there be and ending with 70, good."}, {"time": 2822, "text": "So 25 plus, you know, 17, there's a 42 chapter sutra, which is the first Indian religious tradition which is the first Indian religious scripture which was translated to Chinese, thus introducing Buddhism to China from India."}, {"time": 2838, "text": "The 42 line Bible was the first printed book marking the age of printing in the 1450s and the dissemination of knowledge eventually leading to the enlightenment."}, {"time": 2849, "text": "A yeast cell, which is called a single cell eukaryote and the subject of my PhD research has exactly 42 million proteins."}, {"time": 2858, "text": "Anyway, so there's a series of 42."}, {"time": 2860, "text": "You're on fire with this, these are really good."}, {"time": 2862, "text": "So I guess what you're saying is just a random number."}, {"time": 2865, "text": "Yeah, basically."}, {"time": 2867, "text": "So all of these are backronyms."}, {"time": 2869, "text": "So, you know, after you have the number, you figure out why that number."}, {"time": 2872, "text": "So anyway, so now that we've spoken about Y42, why do we search for meaning?"}, {"time": 2878, "text": "And you're asking, you know, will that search ultimately lead to our destruction?"}, {"time": 2882, "text": "And my thinking is exactly the opposite."}, {"time": 2884, "text": "So basically that asking about meaning is something that's so inherent to human nature."}, {"time": 2891, "text": "It's something that makes life beautiful that makes it worth living."}, {"time": 2894, "text": "And that searching for meaning is actually the point."}, {"time": 2898, "text": "It's not the finding it."}, {"time": 2899, "text": "I think when you found it, you're dead."}, {"time": 2902, "text": "Don't ever be satisfied that, you know, I've got it."}, {"time": 2906, "text": "So I like to say that life is lived forward but it only makes sense backward."}, {"time": 2912, "text": "And I don't remember whose quote that is, but the whole search itself is the meaning."}, {"time": 2919, "text": "And what I love about it is that there's a double search going on."}, {"time": 2924, "text": "There's a search in every one of us through our own lives to find meaning."}, {"time": 2930, "text": "And then there's a search which is happening for humanity itself to find our meaning."}, {"time": 2936, "text": "And we as humans like to look at animals and say, of course they have a meaning."}, {"time": 2943, "text": "Like a dog has its meaning."}, {"time": 2944, "text": "It's just a bunch of instincts, you know, running around, loving everything."}, {"time": 2949, "text": "You know, remember our joke with a cat and the dog."}, {"time": 2951, "text": "Yeah, cat has no meaning."}, {"time": 2955, "text": "So, and I'm noticing the yin yang symbol right here with this whole panda, black and white and the 0102."}, {"time": 2963, "text": "You're on fire with that 42."}, {"time": 2964, "text": "Some of those are gold ASCII value for a star symbol."}, {"time": 2970, "text": "So basically in my view, the search for meaning and the act of searching for something more meaningful is life's meaning by itself."}, {"time": 2983, "text": "The fact that we kind of always hope that, yes, maybe for animals that's not the case, but maybe humans have something that we should be doing and something else."}, {"time": 2992, "text": "And it's not just about procreation."}, {"time": 2993, "text": "It's not just about dominance."}, {"time": 2995, "text": "It's not just about strength and feeding, et cetera."}, {"time": 2998, "text": "Like we're the one species that spends such a tiny, little minority of its time feeding that we have this enormous, huge cognitive capability that we can just use for all kinds of other stuff."}, {"time": 3011, "text": "And that's where art comes in."}, {"time": 3012, "text": "That's where the healthy mind comes in with exploring all of these different aspects that are just not directly tied to a purpose."}, {"time": 3023, "text": "That's not directly tied to a function."}, {"time": 3025, "text": "It's really just the playing of life."}, {"time": 3028, "text": "The, you know, not for particular reason."}, {"time": 3032, "text": "Do you think this thing we got, this mind is unique in the universe in terms of how difficult it is to build?"}, {"time": 3043, "text": "Is it possible that we're the most beautiful thing that the universe has constructed?"}, {"time": 3049, "text": "Both the most beautiful and the most ugly, but certainly the most complex."}, {"time": 3052, "text": "So look at evolutionary time."}, {"time": 3055, "text": "The dinosaurs ruled the earth for 135 million years."}, {"time": 3058, "text": "We've been around for a million years."}, {"time": 3062, "text": "So one versus 135."}, {"time": 3065, "text": "So dinosaurs were extinct, you know, about 60 million years ago and mammals that had been happily evolving as tiny little creatures for 30 million years then took over the planet and then, you know, dramatically radiated about 60 million years ago."}, {"time": 3079, "text": "Out of these mammals came the neocortex formation."}, {"time": 3084, "text": "So basically the neocortex, which is sort of the outer layer of our brain compared to our quote unquote reptilian brain, which we share the structure of with all of the dinosaurs."}, {"time": 3093, "text": "They didn't have that and yet they ruled the planet."}, {"time": 3096, "text": "So how many other planets have still, you know, mindless dinosaurs where strength was the only dimension ruling the planet?"}, {"time": 3105, "text": "So there was something weird that annihilated the dinosaurs."}, {"time": 3109, "text": "And again, you could look at biblical things of sort of God coming and wiping out his creatures to make room for the next ones."}, {"time": 3115, "text": "So the mammals basically sort of took over the planet and then grew this cognitive capability of this general purpose machine."}, {"time": 3126, "text": "And primates push that to extreme and humans among primates have just exploded that hardware."}, {"time": 3135, "text": "But that hardware is selected for survival."}, {"time": 3140, "text": "It's selected for procreation."}, {"time": 3143, "text": "It's initially selected with his very simple Darwinian view of the world of random mutation, ruthless selection, and then selection for making more of yourself."}, {"time": 3155, "text": "If you look at human cognition, it's gone down a weird evolutionary path in the sense that we are expanding an enormous amount of energy on this apparatus between our ears that is wasting, what, 15% of our bodily energy, 20%, like some enormous percentage of our calories go to function our brain."}, {"time": 3180, "text": "No other species makes that big of a commitment."}, {"time": 3183, "text": "That has basically taken energetic changes for efficiency on the metabolic side for humanity to basically power that thing."}, {"time": 3193, "text": "And our brain is both enormously more efficient than other brains, but also, despite this efficiency, enormously more energy consuming."}, {"time": 3203, "text": "So, and if you look at just the sheer folds that the human brain has, again, our skull could only grow so much before it could no longer go through the pelvic opening and kill the mother at every birth, so, but yet the folds continued effectively creating just so much more capacity."}, {"time": 3223, "text": "The evolutionary context in which this was made is enormously fascinating, and it has to do with other humans that we have now killed off or that have gone extinct."}, {"time": 3237, "text": "And that has now created this weird place of humans on the planet as the only species that has this enormous hardware."}, {"time": 3245, "text": "So that can basically make us think that there's something very weird and unique that happened in human evolution that perhaps has not been recreated elsewhere."}, {"time": 3251, "text": "Maybe the asteroid didn't hit, you know, sister earth, and dinosaurs are still ruling, and, you know, any kind of proto human is squished and eaten for breakfast basically."}, {"time": 3265, "text": "However, we're not as unique as we like to think because there was this enormous diversity of other human like forms."}, {"time": 3315, "text": "So me being able to sort of create a mental model of how you think may have come before I was able to create a personal mental model of how do I think."}, {"time": 3326, "text": "So this introspection probably came after this sort of projection and this empathy, which basically means, you know, passion, pathos, suffering, but basically sensing."}, {"time": 3339, "text": "So basically empathy means feeling what you're feeling, trying to project your emotional state onto my cognitive apparatus."}, {"time": 3347, "text": "And I think that is what eventually led to this enormous cognitive explosion that happened in humanity."}, {"time": 3356, "text": "So, you know, life itself in my view is inevitable on every planet."}, {"time": 3365, "text": "But the evolution of life to self awareness and cognition and all the incredible things that humans have done, you know, that might not be as inevitable."}, {"time": 3375, "text": "So if you were to sort of estimate and bet some money on it, if we reran Earth a million times, would what we got now be the most special thing and how often would it be?"}, {"time": 3390, "text": "So scientifically speaking, how repeatable is this experiment?"}, {"time": 3396, "text": "So this whole cognitive revolution?"}, {"time": 3402, "text": "Basically, I feel that the longevity of, you know, dinosaurs suggests that it was not quite inevitable that we humans eventually made it."}, {"time": 3416, "text": "What you're also implying one thing here."}, {"time": 3419, "text": "You're saying, you're implying that humans also don't have this longevity."}, {"time": 3423, "text": "This is the interesting question."}, {"time": 3425, "text": "So with the Fermi Paradox, the idea that the basic question is like, if the universe has a lot of alien life forms in it, why haven't we seen them?"}, {"time": 3436, "text": "And one thought is that there's a great filter or multiple great filters that basically would destroy intelligent civilizations."}, {"time": 3444, "text": "Like this thing that we, you know, this multifolding brain that keeps growing may not be such a big feature."}, {"time": 3452, "text": "It might be useful for survival, but it like takes us down a side road that is a very short one with a quick dead end."}, {"time": 3462, "text": "So I think the universe is enormous, not just in space, but also in time."}, {"time": 3470, "text": "And the pretense that, you know, the last blink of an instant that we've been able to send radio waves is when somebody should have been paying attention to our planet is a little ridiculous."}, {"time": 3483, "text": "So my, you know, what I love about Star Wars is a long, long time ago in a galaxy far, far away."}, {"time": 3490, "text": "It's not like some distant future."}, {"time": 3491, "text": "It's a long, long time ago."}, {"time": 3493, "text": "What I love about it is that basically says, you know, evolution and civilization are just so recent in, you know, on earth."}, {"time": 3503, "text": "Like there's countless other planets that have probably all kinds of life forms, multicellular perhaps, and so on and so forth."}, {"time": 3511, "text": "But the fact that humanity has only been listening and emitting for just this tiny little blink means that any of these, you know, alien civilizations would need to be paying attention to every single insignificant planet out there."}, {"time": 3527, "text": "And, you know, again, I mean, the movie Contact and the book is just so beautiful."}, {"time": 3532, "text": "This whole concept of we don't need to travel physically."}, {"time": 3536, "text": "We can travel as light."}, {"time": 3537, "text": "We can send instructions for people to create machines that will allow us to beam down light and recreate ourselves."}, {"time": 3544, "text": "And in the book, you know, the aliens actually take over."}, {"time": 3547, "text": "They're not as friendly."}, {"time": 3549, "text": "But, you know, this concept that we have to eventually go and conquer every planet."}, {"time": 3554, "text": "I mean, I think that, yes, we will become a galactic species."}, {"time": 3558, "text": "So you have a hope, well, you said think, so."}, {"time": 3562, "text": "Oh, of course, of course."}, {"time": 3563, "text": "I mean, now that we've made it so far."}, {"time": 3565, "text": "So you feel like we've made it."}, {"time": 3567, "text": "Oh gosh, I feel that, you know, cognition, the cognition as an evolutionary trait has won over in our planet."}, {"time": 3573, "text": "There's no doubt that we've made it."}, {"time": 3575, "text": "So basically humans have won the battle for, you know, dominance."}, {"time": 3581, "text": "It wasn't necessarily the case with dinosaurs."}, {"time": 3583, "text": "Like, I mean, yes, you know, there's some claims of intelligence."}, {"time": 3590, "text": "And if you look at Jurassic Park, yeah, sure, whatever."}, {"time": 3593, "text": "But, you know, they just don't have the hardware for it."}, {"time": 3598, "text": "And humans have the hardware."}, {"time": 3599, "text": "There's no doubt that mammals have a dramatically improved hardware for cognition over dinosaurs."}, {"time": 3606, "text": "Like basically there's universes where strength won out."}, {"time": 3609, "text": "And in our planet, in our, you know, particular version of whatever happened in this planet, cognition won out."}, {"time": 3616, "text": "And it's kind of cool."}, {"time": 3618, "text": "I mean, it's a privilege, right?"}, {"time": 3620, "text": "It's kind of like living in Boston instead of, I don't know, some middle age place where everybody's like hitting each other with, you know, weapons and sticks."}, {"time": 3631, "text": "You're back to the Lucky Ones song."}, {"time": 3633, "text": "I mean, we are the lucky ones."}, {"time": 3636, "text": "But the flip side of that is that this hardware also allows us to develop weapons and methods of destroying ourselves."}, {"time": 3643, "text": "Again, I want to go back to Pinker and the better angels of our nature."}, {"time": 3649, "text": "The whole concept that civilization and the act of civilizing has dramatically reduced violence, dramatically."}, {"time": 3662, "text": "If you look, you know, at every scale, as soon as organization comes, the state basically owns the right to violence."}, {"time": 3672, "text": "And eventually the state gives that right of governance to the people, but violence has been eliminated by that state."}, {"time": 3683, "text": "So this whole concept of central governance and people agreeing to live together and share responsibilities and duties and, you know, all of that is something that has led so much to less violence, less death, less suffering, less, you know, poverty, less, you know, war."}, {"time": 3708, "text": "I mean, yes, we have the capability to destroy ourselves, but the arc of civilization has led to much, much less destruction, much, much less war and much more peace."}, {"time": 3720, "text": "And of course there's blips back and forth and, you know, there are setbacks, but again, the moral arc of the universe."}, {"time": 3730, "text": "But it seems to just, I probably imagine there were two dinosaurs back in the day having this exact conversation and they look up to the sky and there seems to be something like an asteroid going towards Earth."}, {"time": 3742, "text": "So it's, while it's very true that the arc of our society of human civilization seems to be progressing towards a better, better life for everybody in the many ways that you described, things can change in a moment."}, {"time": 3759, "text": "And it feels like it's not just us humans we're living through a pandemic."}, {"time": 3764, "text": "You could imagine that a pandemic would be more destructive or there could be asteroids that just appear out of the darkness of space, which I recently learned it's not that easy to actually detect them."}, {"time": 3780, "text": "So 48, what happens in 48 years?"}, {"time": 3785, "text": "2068, Apophis."}, {"time": 3787, "text": "There's an asteroid that's coming."}, {"time": 3789, "text": "In 48 years, it has very high chance of actually wiping us out completely."}, {"time": 3795, "text": "So we have 48 years to get our act together."}, {"time": 3798, "text": "It's not like some distant, distant hypothesis."}, {"time": 3801, "text": "Like, yeah, sure, they're hard to detect but this one we know about, it's coming."}, {"time": 3805, "text": "So how do you feel about that?"}, {"time": 3806, "text": "Why are you still so optimistic?"}, {"time": 3807, "text": "Oh gosh, I'm so happy with where we are now."}, {"time": 3809, "text": "This is gonna be great."}, {"time": 3810, "text": "Seriously, if you look at progress, if you look at, again, the speed with which knowledge has been transferred, what has led to humanity making so many advances so fast?"}, {"time": 3824, "text": "So what has led to humanity making so many advances is not just the hardware upgrades, it's also the software upgrades."}, {"time": 3832, "text": "So by hardware upgrades, I basically mean our neocortex and the expansion and these layers and folds of our brain and all of that."}, {"time": 3840, "text": "That's the hardware."}, {"time": 3841, "text": "The software hasn't, you know, the hardware hasn't changed much in the last, what, 70,000 years."}, {"time": 3850, "text": "As I mentioned last time, if you take a person from ancient Egypt and you bring them up now, they're just as equally fit."}, {"time": 3858, "text": "So hardware hasn't changed."}, {"time": 3860, "text": "What has changed is software."}, {"time": 3862, "text": "What has changed is that we are growing up in societies that are much more complex."}, {"time": 3870, "text": "This whole concept of neoteny basically allows our exponential growth."}, {"time": 3875, "text": "The concept that our brain has not fully formed, has not fully stabilized itself until after our teenage years."}, {"time": 3883, "text": "So we basically have a good 16 years, 18 years to sort of infuse it with the latest and greatest in software."}, {"time": 3891, "text": "If you look at what happened in ancient Greece, why did everything explode at once?"}, {"time": 3897, "text": "My take on this is that it was the shift from the Egyptian and hieroglyphic software to the Greek language software."}, {"time": 3906, "text": "This whole concept of creating abstract notions, of creating these layers of cognition and layers of meaning and layers of abstraction for words and ideals and beauty and harmony."}, {"time": 3924, "text": "How do you write harmony in hieroglyphics?"}, {"time": 3926, "text": "There's no such thing as, you know, sort of expressing these ideals of peace and justice and, you know, these concepts of, or even, you know, macabre concepts of doom, et cetera."}, {"time": 3939, "text": "You don't have the language for it."}, {"time": 3942, "text": "Your brain has trouble getting at that concept."}, {"time": 3948, "text": "So what I'm trying to say is that these software upgrades for human language, human culture, human environment, human education have basically led to this enormous explosion of knowledge."}, {"time": 3964, "text": "And eventually after the enlightenment, and as I was mentioning the 42 line Bible and the printed press, the dissemination of knowledge, you basically now have this whole horizontal dispersion of ideas in addition to the vertical inheritance of genes."}, {"time": 3981, "text": "So the hardware improvements happen through vertical inheritance."}, {"time": 3985, "text": "The software improvements happen through horizontal inheritance."}, {"time": 3988, "text": "And the reason why human civilization exploded is not a hardware change anymore, it's really a software change."}, {"time": 3994, "text": "So if you're looking at now where we are today, look at coronavirus."}, {"time": 4000, "text": "Yes, sure, it could have killed us a hundred years ago, it would have, but it didn't."}, {"time": 4006, "text": "Because in January, we published the genome."}, {"time": 4011, "text": "A month later, less than a month later, the first vaccine designs were done."}, {"time": 4014, "text": "And now less than a year later, 10 months later, we already have a working vaccine that's 90% efficient."}, {"time": 4021, "text": "I mean, that is ridiculous by any standards."}, {"time": 4023, "text": "And the reason is sharing."}, {"time": 4026, "text": "So the asteroid, yes, could wipe us out in 48 years, but 48 years?"}, {"time": 4031, "text": "I mean, look at where we were 48 years ago, technologically."}, {"time": 4036, "text": "I mean, how much more we understand the basic foundations of space is enormous."}, {"time": 4043, "text": "The technological revolutions of digitization, the amount of compute power we can put on any nail size hardware is enormous."}, {"time": 4057, "text": "And this is nowhere near ending."}, {"time": 4060, "text": "We all have our little problems going back and forth on the social side and on the political side, on the sort of human side and the societal side, but science has not slowed down."}, {"time": 4074, "text": "Science is moving at a breakneck pace ahead."}, {"time": 4077, "text": "So, you know, Elon is now putting rockets out from the private space."}, {"time": 4081, "text": "I mean, that now democratization of space exploration is, you know, gonna revolutionize everything."}, {"time": 4087, "text": "It's gonna explode, continue."}, {"time": 4089, "text": "In the same way that every technology has exploded, this is the shift to space technology exploding."}, {"time": 4095, "text": "So 48 years is infinity from now in terms of space capabilities."}, {"time": 4101, "text": "So I'm not worried at all."}, {"time": 4102, "text": "Are you excited by the possibility of a human, well, one, a human stepping foot on Mars and two, possible colonization of not necessarily Mars, but other planets and all that kind of stuff for people living in space?"}, {"time": 4118, "text": "Would you do it?"}, {"time": 4119, "text": "Or do you kind of like Earth?"}, {"time": 4121, "text": "You know, how many?"}, {"time": 4122, "text": "How many people will you wait?"}, {"time": 4124, "text": "Will you wait for, I think it was about when the Declaration of Independence was signed, about two to three million people lived here."}, {"time": 4132, "text": "So would you move like before?"}, {"time": 4134, "text": "Would you be like on the first boat?"}, {"time": 4137, "text": "Would you be on the 10th boat?"}, {"time": 4138, "text": "Would you wait until the Declaration of Independence?"}, {"time": 4140, "text": "I don't think I'll be on the short list because I'll be old by then."}, {"time": 4144, "text": "They'll probably get a bunch of younger people."}, {"time": 4146, "text": "But you're, it's the wisdom and the, then again, you are the lucky one."}, {"time": 4152, "text": "But wisdom can be transferred horizontally."}, {"time": 4153, "text": "I gotta tell you, you are the lucky one."}, {"time": 4155, "text": "So you might be on the list."}, {"time": 4157, "text": "I mean, I kind of feel like I would love to see Earth from above, just to watch our planet."}, {"time": 4163, "text": "I mean, just, I mean, you know, you can watch a live feed of the space station."}, {"time": 4169, "text": "Watching Earth is magnificent, like this blue tiny little shield."}, {"time": 4175, "text": "It's so thin, our atmosphere."}, {"time": 4178, "text": "Like if you drive to New York, you're basically in outer space."}, {"time": 4180, "text": "I mean, it's ridiculous."}, {"time": 4181, "text": "It's just so thin."}, {"time": 4182, "text": "And it's just, again, such a privilege to be on this planet, such a privilege."}, {"time": 4187, "text": "But I think our species is in for big, good things."}, {"time": 4194, "text": "I think that, you know, we will overcome our little problems and eventually come together as a species."}, {"time": 4201, "text": "I feel that we're definitely on the path to that."}, {"time": 4204, "text": "And, you know, it's just not permeated through the whole universe yet."}, {"time": 4209, "text": "I mean, through the whole world yet, through the whole Earth yet, but it's definitely permeating."}, {"time": 4215, "text": "So you've talked about humans as special."}, {"time": 4218, "text": "How exactly are we special relative to the dinosaurs?"}, {"time": 4224, "text": "So I mentioned that there's, you know, this dramatic cognitive improvement that we've made, but I think it goes much deeper than that."}, {"time": 4234, "text": "So if you look at a lion attacking a gazelle in the middle of the Serengeti, the lion is smelling the molecules in the environment."}, {"time": 4245, "text": "Its hormones and neuro receptors are sort of getting it ready for impulse."}, {"time": 4254, "text": "The target is constantly looking around and sensing."}, {"time": 4258, "text": "I've actually been in Kenya and I've kind of seen the hunt."}, {"time": 4262, "text": "So I've kind of seen the sort of game of waiting and the mitochondria in the muscles of the lion are basically ready for, you know, jumping."}, {"time": 4278, "text": "They're expensing an enormous amount of energy."}, {"time": 4281, "text": "The grass as it's flowing is constantly transforming solar energy into chloroplasts, you know, through the chloroplast into energy, which eventually feeds the gazelle and eventually feeds the lions."}, {"time": 4297, "text": "So as humans, we experience all of that, but the lion only experiences one layer."}, {"time": 4309, "text": "The mitochondria in its body are only experiencing one layer."}, {"time": 4312, "text": "The chloroplasts are only experiencing one layer."}, {"time": 4315, "text": "The, you know, photoreceptors and the smell receptors and the chemical receptors, like the lion always attacks against the wind so that it's not smelled."}, {"time": 4324, "text": "Like all of these things are one layer at a time."}, {"time": 4331, "text": "And we humans somehow perceive the whole stack."}, {"time": 4334, "text": "So going back to software infrastructure and hardware infrastructure, if you design a computer, you basically have a physical layer that you start with."}, {"time": 4343, "text": "And then on top of that physical layer, you have, you know, the electrical layer."}, {"time": 4347, "text": "And on top of the electrical layer, you have basically gates and logic and an assembly layer."}, {"time": 4352, "text": "And on top of the assembly layer, you have your, you know, higher order, higher level programming."}, {"time": 4357, "text": "And on top of that, you have your deep learning routine, et cetera."}, {"time": 4360, "text": "And on top of that, you eventually build a cognitive system that's smart."}, {"time": 4366, "text": "I want you to now picture this cognitive system becoming not just self aware, but also becoming aware of the hardware that it's made of and the atoms that it's made of and so on and so forth."}, {"time": 4381, "text": "So it's as if your AI system, and there's this beautiful scene in 2001 Odyssey of Space, where Hull, after Dave starts disconnecting him, is starting to sing a song about daisies, et cetera."}, {"time": 4397, "text": "And Hull is basically saying, Dave, I'm losing my mind."}, {"time": 4404, "text": "I can feel I'm losing my mind."}, {"time": 4408, "text": "This concept of self awareness of knowing that the hardware is no longer there is amazing."}, {"time": 4415, "text": "And in the same way humans who have had accidents are aware that they've had accidents."}, {"time": 4422, "text": "So there's this self awareness of AI that is, you know, this beautiful concept about, you know, sort of the eventual cognitive leap to self awareness."}, {"time": 4434, "text": "But imagine now the AI system actually breaking through these layers and saying, wait a minute, I think I can design a slightly better hardware to get me functioning better."}, {"time": 4443, "text": "And that's what basically humans are doing."}, {"time": 4445, "text": "So if you look at our reasoning layer, it's built on top of a cognitive layer."}, {"time": 4451, "text": "And the reasoning layer we share with AI, it's kind of cool."}, {"time": 4454, "text": "Like there is another thing on the planet that can integrate equations and it's manmade, but we share computation with them."}, {"time": 4462, "text": "We share this cognitive layer of playing chess."}, {"time": 4464, "text": "We're not alone anymore."}, {"time": 4466, "text": "We're not the only thing on the planet that plays chess."}, {"time": 4468, "text": "Now we have AI that also plays chess."}, {"time": 4471, "text": "But in some sense that that particular organism, AI as it is now only operates in that layer."}, {"time": 4478, "text": "And then most animals operate in the sort of cognitive layer that we're all experiencing."}, {"time": 4483, "text": "A bat is doing this incredible integration of signals, but it's not aware of it."}, {"time": 4490, "text": "It's basically constantly sending echo location waves and it's receiving them back."}, {"time": 4496, "text": "And multiple bats in the same cave are operating at slightly different frequencies and with slightly different pulses."}, {"time": 4503, "text": "And they're all sensing objects and they're doing motion planning in their cognitive hardware, but they're not even aware of all of that."}, {"time": 4510, "text": "All they know is that they have a 3D view of space around them, just like any gazelle walking through, you know, the desert."}, {"time": 4518, "text": "And any baby looking around is aware of things without doing the math of how am I processing all of these visual information, et cetera."}, {"time": 4528, "text": "You're just aware of the layer that you live in."}, {"time": 4531, "text": "I think if you look at this, at humanity, we've basically managed through our cognitive layer, through our perception layer, through our senses layer, through our multi organ layer, through our genetic layer, through our molecular layer, through our atomic layer, through our quantum layer, through even the very fabric of the space time continuum unite all of that cognitively."}, {"time": 4560, "text": "So as we're watching that scene in the Serengeti, we as scientists, we as educated humans, we as, you know, anyone who's finished high school are aware of all of this beauty of all of these different layers interplaying together."}, {"time": 4574, "text": "And I think that's something very unique in perhaps not just the galaxy, but maybe even the cosmos."}, {"time": 4580, "text": "This species that has managed to in space cross through these layers from the enormous to the infinitely small."}, {"time": 4590, "text": "And that's what I love about particle physics."}, {"time": 4593, "text": "The fact that it actually unites everything."}, {"time": 4595, "text": "The very small and the very big."}, {"time": 4598, "text": "It's only through the very big that the very small gets formed."}, {"time": 4601, "text": "Like basically every atom of gold results from the fusion that happened of increasingly large particles before that explosion that then disperses it through the cosmos."}, {"time": 4613, "text": "And it's only through understanding the very large that we understand the very small and vice versa."}, {"time": 4619, "text": "And that's in space."}, {"time": 4621, "text": "Then there's the time direction."}, {"time": 4624, "text": "As you are watching the Kilimanjaro mountain, you can kind of look back through time to when that volcano was exploding and growing out of the tectonic forces."}, {"time": 4637, "text": "As you drive through Death Valley, you see these mountains on their side and these layers of history exposed."}, {"time": 4648, "text": "We are aware of the eons that have happened on earth and the tectonic movements on earth."}, {"time": 4657, "text": "The same way that we're aware of the Big Bang and the early evolution of the cosmos."}, {"time": 4664, "text": "And we can also see forward in time as to where the universe is heading."}, {"time": 4668, "text": "We can see Apophis in 2068 coming over, looking ahead in time."}, {"time": 4674, "text": "I mean, that would be magician stuff in ancient times."}, {"time": 4678, "text": "So what I love about humanity and its role in the universe is that if there's a God watching, he's like, finally, somebody figured it out."}, {"time": 4688, "text": "I've been building all these beautiful things and somebody can appreciate it."}, {"time": 4691, "text": "And figured me out from God's perspective, meaning become aware of, you know."}, {"time": 4696, "text": "Yeah, so it's kind of interesting to think of the world in this way as layers and us humans are able to convert those layers into ideas that you can then combine, right?"}, {"time": 4709, "text": "So we're doing some kind of conversion."}, {"time": 4713, "text": "And last time you asked me about whether we live in a simulation, for example."}, {"time": 4717, "text": "I mean, realize that we are living in a simulation."}, {"time": 4722, "text": "We are, the reality that we're in without any sort of person programming this is a simulation."}, {"time": 4728, "text": "Like basically what happens inside your skull?"}, {"time": 4731, "text": "There's this integration of sensory inputs which are translated into perceptory signals, which are then translated into a conceptual model of the world around you."}, {"time": 4742, "text": "And that exercise is happening seamlessly."}, {"time": 4746, "text": "And yet, you know, if you think about sort of, again, this whole simulation and Neo analogy, you can think of the reality that we live in as a matrix, as the matrix, but we've actually broken through the matrix."}, {"time": 4762, "text": "We've actually traversed the layers."}, {"time": 4763, "text": "We didn't have to take a pill, like we didn't, you know, Morpheus didn't have to show up to basically give us the blue pill or the red pill."}, {"time": 4771, "text": "We were able to sufficiently evolve cognitively through the hardware explosion and sufficiently evolve scientifically through the software explosion to basically get at breaking through the matrix, realizing that we live in a matrix and realizing that we are this thing in there."}, {"time": 4791, "text": "And yet that thing in there has a consciousness that lives through all these layers."}, {"time": 4797, "text": "And I think we're the only species."}, {"time": 4798, "text": "We're the only thing that we even can think of that has actually done that, that has sort of permeated space and time scales and layers of abstraction plowing through them and realizing what we're really, really made of."}, {"time": 4816, "text": "And the next frontier is of course, cognition."}, {"time": 4820, "text": "So we understand so much of the cosmos, so much of the stuff around us, but the stuff inside here, finding the basis for the soul, finding the basis for the ego, for the self, the self awareness, when does the spark happen that basically sort of makes you you?"}, {"time": 4838, "text": "I mean, that's really the next frontier."}, {"time": 4841, "text": "So in terms of these peeling off layers of complexity, somewhere between the cognitive layer and the reasoning layer or the computational layer, there's still some stuff to be figured out there."}, {"time": 4854, "text": "And I think that's the final frontier of sort of completing our journey through that matrix."}, {"time": 4859, "text": "And maybe duplicating it in other versions of ourselves through AI, which is another very exciting possibility."}, {"time": 4868, "text": "What I love about AI and the way that it operates right now is the fact that it is unpredictable."}, {"time": 4876, "text": "There's emergent behavior in our cognitively capable artificial systems that we can certainly model, but we don't encode directly."}, {"time": 4890, "text": "And that's a key difference."}, {"time": 4892, "text": "So we like to say, oh, of course, this is not really intelligent because we coded it up."}, {"time": 4898, "text": "And we've just put in these little parameters there and there's like six billion parameters and once you've learned them, we kind of understand the layers."}, {"time": 4908, "text": "But that's an oversimplification."}, {"time": 4910, "text": "It's like saying, oh, of course, humans, we understand humans, they're just made out of neurons and layers of cortex and there's a visual area."}, {"time": 4921, "text": "But every human is encoded by a ridiculously small number of genes compared to the complexity of our cognitive apparatus."}, {"time": 4929, "text": "20,000 genes is really not that much out of which a tiny little fraction are in fact encoding all of our cognitive functions."}, {"time": 4936, "text": "The rest is emergent behavior."}, {"time": 4939, "text": "The rest is the cortical layers doing their thing in the same way that when we build these conversational systems or these cognitive systems or these deep learning systems, we put the architecture in place, but then they do their thing."}, {"time": 4957, "text": "And in some ways, that's creating something that has its own identity."}, {"time": 4961, "text": "That's creating something that's not just, oh yeah, it's not the early AI where if you hadn't programmed what happens in the grocery bags when you have both cold and hot and hard and soft, the system wouldn't know what to do."}, {"time": 4974, "text": "No, no, you basically now just program the primitives and then it learns from that."}, {"time": 4979, "text": "So even though the origins are humble, just like it is for our genetic code, for AI, even though the origins are humble, the result of it being deployed into the world is infinitely complex."}, {"time": 4996, "text": "And yet, it's not yet able to be cognizant of all the other layers of its, you know, it's not able to think about space and time."}, {"time": 5013, "text": "It's not able to think about the hardware in which it runs, the electricity in which it runs yet."}, {"time": 5018, "text": "So if you look at humans, we basically have the same cognitive architecture as monkeys, as the great apes."}, {"time": 5025, "text": "It's just a ton more of it."}, {"time": 5028, "text": "If you look at GPT3 versus GPT2, again, it's the same architecture, just more of it."}, {"time": 5035, "text": "And yet it's able to do so much more."}, {"time": 5038, "text": "So if you start thinking about sort of what's the future of that, GPT4 and GPT5, do you really need fundamentally different architectures or do you just need a ton more hardware?"}, {"time": 5047, "text": "And we do have a ton more hardware."}, {"time": 5050, "text": "Like these systems are nowhere near what humans have between our ears."}, {"time": 5055, "text": "So, you know, there's something to be said about stay tuned for emergent behavior."}, {"time": 5062, "text": "We keep thinking that general intelligence might just be forever away, but it could just simply be that we just need a ton more hardware and that humans are just not that different from the great apes, except for just a ton more of it."}, {"time": 5077, "text": "Yeah, it's interesting that in the AI community, maybe there's a human centric fear, but the notion that GPT10 will achieve general intelligence is something that people shy away from, that there has to be something totally different and new added to this."}, {"time": 5096, "text": "And yet it's not seriously considered that this very simple thing, this very simple architecture, when scaled, might be the thing that achieves super intelligence."}, {"time": 5109, "text": "And people think the same way about humanity and human consciousness."}, {"time": 5113, "text": "They're like, oh, consciousness might be quantum, or it might be, you know, some nonphysical thing."}, {"time": 5118, "text": "And it's like, or it could just be a lot more of the same hardware that now is sufficiently capable of self awareness just because it has the neurons to do it."}, {"time": 5129, "text": "So maybe the consciousness that is so elusive is an emergent behavior of you basically string together all these cognitive capabilities that come from running, from seeing, for reacting, from predicting the movement of a fly as you're catching it through the air."}, {"time": 5147, "text": "All of these things are just like great lookup tables encoded in a giant neural network."}, {"time": 5151, "text": "I mean, I'm oversimplifying, of course, the complexity and the diversity of the different types of excitatory and inhibitory neurons, the wave forms that sort of shine through the connections across all these different layers, the amalgamation of signals, et cetera."}, {"time": 5166, "text": "The brain is enormously complex."}, {"time": 5168, "text": "I mean, of course."}, {"time": 5169, "text": "But again, it's a small number of primitives encoded by a tiny number of genes, which are self organized and shaped by their environment."}, {"time": 5181, "text": "Babies that are growing up today are listening to language from conception."}, {"time": 5188, "text": "Basically, as soon as the auditory apparatus forms, it's already getting shaped to the types of signals that are out in the real world today."}, {"time": 5197, "text": "So it's not just like, oh, have an Egyptian be born and then ship them over."}, {"time": 5200, "text": "It's like, no, that Egyptian would be listening in to the complexity of the world and then getting born and sort of seeing just how much more complex the world is."}, {"time": 5209, "text": "So it's a combination of the underlying hardware, which if you think about as a geneticist, in my view, the hardware gives you an upper bound of cognitive capabilities, but it's the environment that makes those capabilities shine and reach their maximum."}, {"time": 5226, "text": "So we're a combination of nature and nurture."}, {"time": 5231, "text": "The nature is our genes and our cognitive apparatus."}, {"time": 5235, "text": "And the nurture is the richness of the environment that makes that cognitive apparatus reach its potential."}, {"time": 5242, "text": "And we are so far from reaching our full potential, so far."}, {"time": 5247, "text": "I think that kids being born a hundred years from now, they'll be looking at us now and saying what primitive educational systems they had."}, {"time": 5256, "text": "I can't believe people were not wired into this virtual reality from birth as we are now, cause like they're clearly inferior and so on and so forth."}, {"time": 5266, "text": "I basically think that our environment will continue exploding and our cognitive capabilities, it's not like, oh, we're only using 10% of our brain."}, {"time": 5276, "text": "Of course, we're using 100% of our brain, but it's still constrained by how complex our environment is."}, {"time": 5282, "text": "So the hardware will remain the same, but the software, in a quickly advancing environment, the software will make a huge difference in the nature of like the human experience, the human condition."}, {"time": 5295, "text": "It's fascinating to think that humans will look very different a hundred years from now, just because the environment changed, even though we're still the same great apes, the descendant of apes."}, {"time": 5305, "text": "At the core of this is kind of a notion of ideas that I don't know if you're, there's a lot of people, including you, eloquently about this topic, but Richard Dawkins talks about the notion of memes and let's say this notion of ideas, multiplying, selecting in the minds of humans."}, {"time": 5329, "text": "Do you ever think about ideas from that perspective, ideas as organisms themselves that are breeding in the minds of humans?"}, {"time": 5337, "text": "I love the concept of memes."}, {"time": 5339, "text": "I love the concept of these horizontal transfer of ideas and sort of permeating through our layer of interconnected neural networks."}, {"time": 5351, "text": "So you can think of sort of the cognitive space that has now connected all of humanity, where we are now one giant information and idea sharing network, well beyond what was thought to be ever capable when the concept of a meme was created by Richard Dawkins."}, {"time": 5372, "text": "So, but I wanna take that concept just into another twist, which is the horizontal transfer of humans with fellowships."}, {"time": 5387, "text": "And the fact that as people apply to MIT from around the world, there's a selection that happens, not just for their ideas, but also for the cognitive hardware that came up with those ideas."}, {"time": 5402, "text": "So we don't just ship ideas around anymore."}, {"time": 5405, "text": "They don't evolve in a vacuum."}, {"time": 5407, "text": "The ideas themselves influence the distribution of cognitive systems, i.e."}, {"time": 5411, "text": "humans and brains around the planet."}, {"time": 5415, "text": "Yeah, we ship them to different locations based on their properties."}, {"time": 5419, "text": "So those cognitive systems that think of physics, for example, might go to CERN and those that think of genomics might go to the Broad Institute."}, {"time": 5430, "text": "And those that think of computer science might go to, I don't know, Stanford or CMU or MIT."}, {"time": 5435, "text": "And you basically have this co evolution now of memes and ideas and the cognitive conversational systems that love these ideas and feed on these ideas and understand these ideas and appreciate these ideas now coming together."}, {"time": 5452, "text": "So you basically have students coming to Boston to study because that's the place where these types of cognitive systems thrive."}, {"time": 5461, "text": "And they're selected based on their cognitive output and their idea output."}, {"time": 5468, "text": "But once they get into that place, the boiling and interbreeding of these memes becomes so much more frequent."}, {"time": 5477, "text": "That what comes out of it is so far beyond if ideas were evolving in a vacuum of an already established hardware, cognitive interconnection system of the planet, where now you basically have the ideas shaping the distribution of these systems."}, {"time": 5495, "text": "And then the genetics kick in as well."}, {"time": 5526, "text": "And you basically have a whole interbreeding now of genetically selected transfer of cognitive systems where the genes and the memes are co evolving the same soup of ever improving knowledge and societal inter fertilization, cross fertilization of these ideas."}, {"time": 5549, "text": "So this beautiful image."}, {"time": 5552, "text": "So this is shipping these actual meat cognitive systems to physical locations."}, {"time": 5557, "text": "They tend to cluster in the biology ones, and the biology ones cluster in a certain building too."}, {"time": 5565, "text": "So like within that there's clusters on top of clusters, top of clusters."}, {"time": 5570, "text": "What about in the online world?"}, {"time": 5572, "text": "Is that, do you also see that kind of, because people now form groups on the internet that they stick together so they can sort of, these cognitive systems can collect themselves and breed together in different layers of spaces."}, {"time": 5594, "text": "It doesn't just have to be physical space."}, {"time": 5597, "text": "So basically there's the physical rearrangement, but there's also the conglomeration of the same cognitive system."}, {"time": 5604, "text": "Doesn't need to be, i.e."}, {"time": 5604, "text": "human."}, {"time": 5606, "text": "Doesn't need to belong to only one community."}, {"time": 5609, "text": "So yes, you might be a member of the computer science department, but you can also hang out in the biology department."}, {"time": 5613, "text": "But you might also go online into, I don't know, poetry department readings and so on and so forth."}, {"time": 5618, "text": "Or you might be part of a group that only has 12 people in the world, but that are connected through their ideas and are now interbreeding these ideas in a whole other way."}, {"time": 5629, "text": "So this coevolution of genes and memes is not just physically instantiated."}, {"time": 5635, "text": "It's also sort of rearranged in this cognitive space as well."}, {"time": 5641, "text": "And sometimes these cognitive systems hold conferences and they all gather around and there's like one of them is like talking and they're all like listening and then they discuss and then they have free lunch and so on."}, {"time": 5653, "text": "No, but then that's where you find students where when I go to a conference, I go through the posters where I'm on a mission."}, {"time": 5660, "text": "Basically my mission is to read and understand what every poster is about."}, {"time": 5665, "text": "And for a few of them, I'll dive deeply and understand everything, but I make it a point to just go poster after poster in order to read all of them."}, {"time": 5671, "text": "And I find some gems and students that I speak to that sometimes eventually join my lab."}, {"time": 5677, "text": "And then sort of you're sort of creating this permeation of the transfer of ideas, of ways of thinking and very often of moral values, of social structures, of just more imperceptible properties of these cognitive systems that simply just cling together."}, {"time": 5702, "text": "Basically, I have the luxury at MIT of not just choosing smart people, but choosing smart people who I get along with, who are generous and friendly and creative and smart and excited and childish in their uninhibited behaviors and so on and so forth."}, {"time": 5726, "text": "So you basically can choose yourself to surround, you can choose to surround yourself with people who are not only cognitively compatible, but also imperceptibly through the meta cognitive systems compatible."}, {"time": 5743, "text": "And again, when I say compatible, not all the same."}, {"time": 5746, "text": "Sometimes, not sometimes, all the time."}, {"time": 5750, "text": "The teams are made out of complimentary components, not just compatible, but very often complimentary."}, {"time": 5756, "text": "So in my own team, I have a diversity of students who come from very different backgrounds."}, {"time": 5761, "text": "There's a whole spectrum of biology to computation, of course, but within biology, there's a lot of realms."}, {"time": 5766, "text": "Within computation, there's a lot of realms."}, {"time": 5768, "text": "And what makes us click so well together is the fact that not only do we have a common mission, a common passion and a common view of the world, but that we're complimentary in our skills, in our angles with which we come at it and so on and so forth."}, {"time": 5788, "text": "And that's sort of what makes it click."}, {"time": 5789, "text": "Yeah, it's fascinating that the stickiness of multiple cognitive systems together includes both the commonality, so you meet because there's some common thing, but you stick together because you're different in all the useful ways."}, {"time": 5807, "text": "And my wife and I, I mean, we adore each other to pieces, but we're also extremely different in many ways."}, {"time": 5814, "text": "Careful."}, {"time": 5815, "text": "She's gonna be listening to this."}, {"time": 5817, "text": "But I love that about us."}, {"time": 5819, "text": "I love the fact that I'm living out there in the world of ideas and I forget what day it is."}, {"time": 5825, "text": "And she's like, well, at 8 a.m., the kids better be to school."}, {"time": 5829, "text": "And I do get yelled at, but I need it."}, {"time": 5835, "text": "Basically, I need her as much as she needs me."}, {"time": 5838, "text": "And she loves interacting with me and talking."}, {"time": 5840, "text": "I mean, last night, we were talking about this and I showed her the questions and we were bouncing ideas off each other."}, {"time": 5846, "text": "And it was just beautiful."}, {"time": 5848, "text": "We basically have these, basically, cognitive, let it all loose kind of dates where we just bring papers and we're bouncing ideas, et cetera."}, {"time": 5861, "text": "So we have extremely different perspectives, but very common goals and interests and anyway."}, {"time": 5869, "text": "What do you make of the communication mechanism that we humans use to share those ideas?"}, {"time": 5874, "text": "Because one essential element of all of this is not just that we're able to have these ideas, but we're also able to share them."}, {"time": 5883, "text": "We tend to, maybe you can correct me, but we seem to use language to share the ideas."}, {"time": 5890, "text": "Maybe we share them in some much deeper way than language, I don't know."}, {"time": 5893, "text": "But what do you make of this whole mechanism that ghaf on the matlid is to the human condition?"}, {"time": 5898, "text": "So some people will tell you that your language dictates your thoughts and your thoughts cannot form outside language."}, {"time": 5906, "text": "I tend to disagree."}, {"time": 5907, "text": "I see thoughts as much more abstract as basically when I dream, I don't dream in words."}, {"time": 5916, "text": "I dream in shapes and forms and three dimensional space with extreme detail."}, {"time": 5922, "text": "I was describing, so when I wake up in the middle of the night, I actually record my dreams."}, {"time": 5927, "text": "Sometimes I write them down in a Dropbox file."}, {"time": 5930, "text": "Other times I'll just dictate them in audio."}, {"time": 5933, "text": "And my wife was giving me a massage the other day cause like my left side was frozen and I started playing the recording."}, {"time": 5942, "text": "And as I was listening to it, I was like, I don't remember any of that."}, {"time": 5946, "text": "And it was like, of course."}, {"time": 5948, "text": "And then the entire thing came back."}, {"time": 5950, "text": "But then there's no way any other person could have recreated that entire sort of three dimensional shape and dream and concept."}, {"time": 5960, "text": "And in the same way, when I'm thinking of ideas, there's so many ideas I can't put to words."}, {"time": 5965, "text": "I mean, I will describe them with a thousand words, but the idea itself is much more precise or much more sort of abstract or much more something difference, either less abstract or more abstract."}, {"time": 5976, "text": "And it's either, basically there's just the projection that happens from the three dimensional ideas into let's say a one dimensional language."}, {"time": 5986, "text": "And the language certainly gives you the apparatus to think about concepts that you didn't realize existed before."}, {"time": 5993, "text": "And with my team, we often create new words."}, {"time": 5996, "text": "I'm like, well, now we're gonna call these the regulatory plexus of a gene."}, {"time": 5999, "text": "And that gives us now the language to sort of build on that as one concept that you then build upon with all kinds of other things."}, {"time": 6007, "text": "So there's this coevolution again of ideas and language, but they're not one to one with each other."}, {"time": 6015, "text": "Now let's talk about language itself, words, sentences."}, {"time": 6020, "text": "This is a very distant construct from where language actually begun."}, {"time": 6026, "text": "So if you look at how we communicate, as I'm speaking, my eyes are shining and my face is changing through all kinds of emotions."}, {"time": 6036, "text": "And my entire body composition posture is reshaped."}, {"time": 6041, "text": "And my intonation, the pauses that I make, the softer and the louder and the this and that are conveying so much more information."}, {"time": 6050, "text": "And if you look at early human language, and if you look at how the great apes communicate with each other, there's a lot of grunting, there's a lot of posturing, there's a lot of emotions, there's a lot of sort of shrieking, et cetera."}, {"time": 6063, "text": "They have a lot of components of our human language, just not the words."}, {"time": 6070, "text": "So I think of human communication as combining the ape component, but also of course the GPT3 component."}, {"time": 6082, "text": "So basically there's the cognitive layer and the reasoning layer that we share with different parts of our relatives."}, {"time": 6090, "text": "There's the AI relatives, but there's also the grunting relatives."}, {"time": 6094, "text": "And what I love about humanity is that we have both."}, {"time": 6097, "text": "We're not just a conversational system."}, {"time": 6100, "text": "We're a grunting, emotionally charged, weirdly interconnected system that also has the ability to reason."}, {"time": 6111, "text": "And when we communicate with each other, there's so much more than just language."}, {"time": 6116, "text": "There's so much more than just words."}, {"time": 6119, "text": "It does seem like we're able to somehow transfer even more than the body language."}, {"time": 6124, "text": "It seems that in the room with us is always a giant knowledge base of shared experiences, different perspectives on those experiences, but I don't know, the knowledge of who the last three, four presidents in the United States was, and just all the 9 11, the tragedies in 9 11, all the beautiful and terrible things that happen in the world."}, {"time": 6148, "text": "They're somehow both in our minds and somehow enrich the ability to transfer information."}, {"time": 6157, "text": "What I love about it is I can talk to you about 2001 Odyssey of Space and mention a very specific scene and that evokes all these feelings that you had when you first watched it."}, {"time": 6165, "text": "We're both visualizing that and maybe in different ways."}, {"time": 6168, "text": "But in that, yeah, and not only that, but the feeling is brought back up, just like you said, with the dreams."}, {"time": 6178, "text": "We both have that feeling arise in some form as you bring up the child facing his own mortality."}, {"time": 6187, "text": "It's fascinating that we're able to do that, but I don't know."}, {"time": 6190, "text": "Now let's talk about Neuralink for a second."}, {"time": 6192, "text": "So what's the concept of Neuralink?"}, {"time": 6194, "text": "The concept of Neuralink is that I'm gonna take whatever knowledge is encoded in my brain directly transfer it into your brain."}, {"time": 6202, "text": "So this is a beautiful, fascinating, and extremely sort of appealing concept, but I see a lot of challenges surrounding that."}, {"time": 6212, "text": "The first one is we have no idea how to even begin to understand how knowledge is encoded in a person's brain."}, {"time": 6220, "text": "I mean, I told you about this paper that we had recently with Li Hui Cai and Asaf Marko that basically was looking at these engrams that are formed with combinations of neurons that cofire when a stimulus happens, where we can go into a mouse and select those neurons that fire by marking them and then see what happens when they first fire."}, {"time": 6238, "text": "And then select the neurons that fire again when the experience is repeated."}, {"time": 6242, "text": "These are the recall neurons, and then there's the memory consolidation neurons."}, {"time": 6247, "text": "So we're starting to understand a little bit of sort of the distributed nature of knowledge encoding and experience encoding in the human brain and in the mouse brain."}, {"time": 6257, "text": "And the concept that we'll understand that sufficiently one day to be able to take a snapshot of what does that scene from Dave losing his mind, of Khal losing his mind and talking to Dave, how is that seen and coded in your mind?"}, {"time": 6279, "text": "Imagine the complexity of that."}, {"time": 6281, "text": "But now imagine, suppose that we solve this problem."}, {"time": 6285, "text": "And the next enormous challenge is how do I go and modify the next person's brain to now create the same exact neural connections?"}, {"time": 6294, "text": "So that's an enormous challenge right there."}, {"time": 6296, "text": "So basically it's not just reading, it's now writing."}, {"time": 6300, "text": "And again, what if something goes wrong?"}, {"time": 6302, "text": "I don't wanna even think about that, that's number two."}, {"time": 6305, "text": "And number three, who says that the way that you encode Dave, I'm losing my mind and I encode Dave, I'm losing my mind is anywhere near each other."}, {"time": 6317, "text": "Basically, maybe the way that I'm encoding it is twisted with my childhood memories of running through the pebbles in Greece, and yours is twisted with your childhood memories growing up in Russia."}, {"time": 6331, "text": "And there's no way that I can take my encoding and put it into your brain, because it'll A, mess things up, and B, be incompatible with your own unique experiences."}, {"time": 6342, "text": "So that's telepathic communication from human to human."}, {"time": 6345, "text": "It's fascinating, you're reminding us that there's two biological systems on both ends of that communication."}, {"time": 6354, "text": "The easier, I guess, maybe half as difficult thing to do in the hope with Neuralink is that we can communicate with an AI system, so where one side of that is a little bit more controllable, but even just that is exceptionally difficult."}, {"time": 6373, "text": "Let's talk about two neuronal systems talking to each other."}, {"time": 6376, "text": "Suppose that GPT4 tells GPT3, hey, give me all your knowledge, right?"}, {"time": 6381, "text": "It's ready, I have 10 times more hardware, I'm ready, just feed me."}, {"time": 6385, "text": "What's GPT3 gonna do?"}, {"time": 6387, "text": "Is it gonna say, oh, here's my 10 billion parameters?"}, {"time": 6392, "text": "The simplest way, and perhaps the fastest way for GPT3 to transfer all its knowledge to its older body that has a lot more hardware is to regenerate every single possible human sentence that it can possibly create."}, {"time": 6406, "text": "Just keep talking."}, {"time": 6408, "text": "Keep talking and just reencode it all together."}, {"time": 6410, "text": "So maybe what language does is exactly that."}, {"time": 6413, "text": "It's taking one generative cognitive model, it's running it forward to emit utterances that kind of make sense in my cognitive frame, and it's reencoding them into yours through the parsing of that same language."}, {"time": 6427, "text": "And I think the conversation might actually be the most efficient way to do it, so not just talking, but interactive, so talking back and forth, asking questions, interrupting."}, {"time": 6438, "text": "So GPT4 will constantly be interrupting."}, {"time": 6440, "text": "Annoying."}, {"time": 6440, "text": "Annoying, yeah."}, {"time": 6445, "text": "But the beauty of that is also that as we're interrupting each other, there's all kinds of misinterpretations that happen, that basically when my students speak, I will often know that I'm misunderstanding what they're saying, and I'll be like, hold that thought for a second."}, {"time": 6463, "text": "Let me tell you what I think I understood, which I know is different from what you said."}, {"time": 6466, "text": "Then I'll say that, and then someone else in the same Zoom meeting will basically say, well, here's another way to think about what you just said."}, {"time": 6517, "text": "And again, going back to this whole concept of these, entire network of all of human cognitive systems connected to each other, and sort of how ideas and memes permeate through that, that's sort of what really creates a whole new level of human experience through this reasoning layer and this computational layer that obviously lives on top of our cognitive layer."}, {"time": 6544, "text": "So you're one of these aforementioned cognitive systems, mortal, but thoughtful, and you're connected to a bunch, like you said, students, your wife, your kids."}, {"time": 6559, "text": "What do you, in your brief time here on Earth, this is a Meaning of Life episode, so what do you hope this world will remember you as?"}, {"time": 6571, "text": "What do you hope your legacy will be?"}, {"time": 6573, "text": "I don't think of legacy as much as maybe most people."}, {"time": 6580, "text": "Oh, it's kind of funny."}, {"time": 6581, "text": "I'm consciously living the present."}, {"time": 6584, "text": "Many students tell me, oh, give us some career advice."}, {"time": 6587, "text": "I'm like, I'm the wrong person."}, {"time": 6588, "text": "I've never made a career plan."}, {"time": 6590, "text": "I still have to make one."}, {"time": 6677, "text": "You can't be upset at people if you truly love them."}, {"time": 6681, "text": "If somebody yells at you and insults you every time you say the slightest thing, and yet when you see them, you just see them with love, it's a beautiful feeling."}, {"time": 6691, "text": "It's like, you know, I'm feeling exactly like when I look at my three year old who's like screaming, even though I love her and I want her good, she's still screaming and saying, no, no, no, no, no."}, {"time": 6702, "text": "And I'm like, I love you, genuinely love you, but I can sort of kind of see that your brain is kind of stuck in that little mode of anger."}, {"time": 6713, "text": "And there's plenty of people out there who don't like me, and I see them with love as a child that is stuck in a cognitive state that they're eventually gonna snap out of, or maybe not, and that's okay."}, {"time": 6728, "text": "So there's that aspect of sort of experiencing life with the best intentions."}, {"time": 6736, "text": "And I love when I'm wrong."}, {"time": 6740, "text": "I had a friend who was like one of the smartest people I've ever met who would basically say, oh, I love it when I'm wrong because it makes me feel human."}, {"time": 6747, "text": "And it's so beautiful."}, {"time": 6751, "text": "I mean, she's really one of the smartest people I've ever met."}, {"time": 6753, "text": "And she was like, oh, it's such a good feeling."}, {"time": 6756, "text": "And I love being wrong, but there's something about self improvement."}, {"time": 6762, "text": "There's something about sort of how do I not make the most mistakes, but attempt the most rights and do the fewest wrongs, but with the full knowledge that this will happen."}, {"time": 6775, "text": "So through this life in the present, what's really funny is, and that's something that I've experienced more and more really thanks to you and through this podcast, is this enormous number of people who will basically comment, wow, I've been following this guy for so many years now, or wow, this guy has inspired so many of us in computation biology and so on and so forth."}, {"time": 6799, "text": "I'm like, I don't know any of that, but I'm only discovering this now through these sort of sharing our emotional states and our cognitive states with a wider audience, where suddenly I'm sort of realizing that, wow, maybe I've had a legacy."}, {"time": 6816, "text": "Like basically I've trained generations of students from MIT and I've put all of my courses freely online since 2001."}, {"time": 6827, "text": "So basically all of my video recordings of my lectures have been online since 2001."}, {"time": 6832, "text": "So countless generations of people from across the world will meet me at a conference and say, like I was at this conference where somebody heard my voice and it's like, I know this voice, I've been listening to your lectures."}, {"time": 6844, "text": "And it's just such a beautiful thing where like we're sharing widely and who knows which students will get where from whatever they catch out of these lectures, even if what they catch is just inspiration and passion and drive."}, {"time": 6860, "text": "So there's this intangible legacy quote unquote that every one of us has through the people we touch."}, {"time": 6869, "text": "One of my friends from undergrad basically told me, oh, my mom remembers you vividly from when she came to campus."}, {"time": 6874, "text": "I'm like, I didn't even meet her."}, {"time": 6876, "text": "She's like, no, but she sort of saw you interacting with people and said, wow, he's exuding this positive energy."}, {"time": 6883, "text": "And there's that aspect of sort of just motivating people with your kindness, with your passion, with your generosity and with your just selflessness of just give, it doesn't matter where it goes."}, {"time": 6898, "text": "I've been to conferences where basically people will, I'll ask them a question and then they'll come back to, or there was a conference where I asked somebody a question and they said, oh, in fact, this entire project was inspired by your question three years ago at the same conference."}, {"time": 6911, "text": "I'm like, wow."}, {"time": 6913, "text": "And then on top of that, there's also the ripple effect."}, {"time": 6915, "text": "So you're speaking to the direct influence of inspiration or education, but there's also the follow on things that happen to that and there's this ripple that from you just this one individual first drop."}, {"time": 6927, "text": "And from every one of us, from everyone, that's what I love about humanity."}, {"time": 6930, "text": "The fact that every one of us shares genes and genetic variants with very recent ancestors with everyone else."}, {"time": 6941, "text": "So even if I die tomorrow, my genes are still shared through my cousins and through my uncles and through my immediate family."}, {"time": 6949, "text": "And of course I'm lucky enough to have my own children, but even if you don't, your genes are still permeating through all of the layers of your family."}, {"time": 6957, "text": "So your genes will have the legacy there, yeah."}, {"time": 6960, "text": "Every one of us."}, {"time": 6962, "text": "Number two, our ideas are constantly intermingling with each other."}, {"time": 6965, "text": "So there's no person living in the planet a hundred years from now who will not be directly impacted by every one of the planet living here today through genetic inheritance and through meme inheritance."}, {"time": 6978, "text": "That's cool to think that your ideas, Manolis Callas, would touch every single person on this planet."}, {"time": 6987, "text": "It's not just mine, Joe Smith, who's looking at this right now, his ideas will also touch everybody."}, {"time": 6993, "text": "So there's this interconnectedness of humanity."}, {"time": 6997, "text": "And then I'm also a professor."}, {"time": 6999, "text": "So my day job is legacy."}, {"time": 7002, "text": "My day job is training, not just the thousands of people who watch my videos on the web, but the people who are actually in my class, who basically come to MIT to learn from a bunch of us."}, {"time": 7015, "text": "The cognitive systems that were shipped to this particular location in space."}, {"time": 7019, "text": "And who will then disperse back into all of their home countries."}, {"time": 7022, "text": "That's what makes America the beacon of the world."}, {"time": 7025, "text": "We don't just export goods."}, {"time": 7029, "text": "We export people."}, {"time": 7030, "text": "Cognitive systems."}, {"time": 7032, "text": "We export people who are born here."}, {"time": 7035, "text": "And we also export training that people born elsewhere will come here to get and will then disseminate, not just whatever knowledge they got, but whatever ideals they learned."}, {"time": 7046, "text": "And I think that's something that's a legacy of the US that you cannot stop with political isolation."}, {"time": 7051, "text": "You cannot stop with economic isolation."}, {"time": 7053, "text": "That's something that will continue to happen through all the people we've touched through our universities."}, {"time": 7058, "text": "So there's the students who took my classes, who are basically now going off and teaching their classes."}, {"time": 7064, "text": "And I've trained generations of computational biologists."}, {"time": 7066, "text": "No one in genomics who's gone through MIT hasn't taken my class."}, {"time": 7070, "text": "So basically there's this impact through, I mean, there's so many people in biotechs who are like, hey, I took your class."}, {"time": 7076, "text": "That's what got me into the field like 15 years ago."}, {"time": 7078, "text": "And it's just so beautiful."}, {"time": 7080, "text": "And then there's the academic family that I have."}, {"time": 7084, "text": "So the students who are actually studying with me, who are my trainees."}, {"time": 7089, "text": "So this sort of mentorship of ancient Greece."}, {"time": 7095, "text": "So I basically have an academic family and we are a family."}, {"time": 7100, "text": "There's this such strong connection, this bond of you're part of the Kelly's family."}, {"time": 7107, "text": "So I have a biological family at home and I have an academic family on campus."}, {"time": 7112, "text": "And that academic family has given me great grandchildren already."}, {"time": 7117, "text": "So I've trained people who are now professors at Stanford, CMU, Harvard, WashU, I mean, everywhere in the world."}, {"time": 7126, "text": "And these people have now trained people who are now having their own faculty jobs."}, {"time": 7133, "text": "So there's basically people who see me as their academic grandfather."}, {"time": 7137, "text": "And it's just so beautiful because you don't have to wait for the 18 years of cognitive hardware development to sort of have amazing conversation with people."}, {"time": 7147, "text": "These are fully grown humans, fully grown adult who are cognitively super ready and who are shaped by, and I see some of these beautiful papers and I'm like, I can see the touch of our lab in those papers."}, {"time": 7162, "text": "Cause you're like, I spent hours with these people teaching them not just how to do a paper, but how to think."}, {"time": 7169, "text": "And this whole concept of, you know, the first paper that we write together is an experience with every one of these students."}, {"time": 7177, "text": "So, you know, I always tell them to write the whole first draft and they know that I will rewrite every word."}, {"time": 7183, "text": "But the act of them writing it and what I do is these like joint editing sessions where I'm like, let's coedit."}, {"time": 7190, "text": "And with this coediting, we basically have... Creative destruction."}, {"time": 7195, "text": "So I share my Zoom screen and I'm just thinking out loud as I'm doing this."}, {"time": 7199, "text": "And they're learning from that process as opposed to like come back two days later and they see a bunch of red on a page."}, {"time": 7205, "text": "I'm sort of, well, that's not how you write this."}, {"time": 7208, "text": "That's not how you think about this."}, {"time": 7209, "text": "That's not, you know, what's the point?"}, {"time": 7210, "text": "Like this morning was having, yes, this morning between six and 8 a.m."}, {"time": 7214, "text": "I had a two hour meeting going through one of these papers and then saying, what's the point here?"}, {"time": 7220, "text": "Why do you even show that?"}, {"time": 7222, "text": "It's just a bunch of points on a graph."}, {"time": 7224, "text": "No, what you have to do is extract the meaning, do the homework for them."}, {"time": 7228, "text": "And there's this nurturing, this mentorship that sort of creates now a legacy, which is infinite because they've now gone off on the, you know, and all of that is just humanity."}, {"time": 7242, "text": "Then of course there's the papers I write because yes, my day job is training students, but it's a research university."}, {"time": 7250, "text": "The way that they learn is through the mens and manus, mind and hand."}, {"time": 7256, "text": "It's the practical training of actually doing research."}, {"time": 7259, "text": "And that research is a beneficial side effect of having these awesome papers that will now tell other people how to think."}, {"time": 7270, "text": "There's this paper we just posted recently on MedArchive and one of the most generous and eloquent comments about it was like, wow, this is a masterclass in scientific writing, in analysis, in biological interpretation, and so forth."}, {"time": 7284, "text": "It's just so fulfilling from a person I've never met or heard about."}, {"time": 7288, "text": "Can you say the title of the paper, Brian Chen?"}, {"time": 7290, "text": "I don't remember the title, but it's single cell dissection of schizophrenia reveals."}, {"time": 7298, "text": "So the two points that we found was this whole transcriptional resilience."}, {"time": 7302, "text": "Like there's some individuals who are schizophrenic, but they have an additional cell type or an additional cell state, which we believe is protective."}, {"time": 7313, "text": "And that cell state when they have it will cause other cells to have normal gene expression patterns."}, {"time": 7320, "text": "And then that cell is connected with some of the PV interneurons that are basically sending these inhibitory brainwaves through the brain."}, {"time": 7330, "text": "And basically there's another component of, there's a set of master regulators that we discovered who are controlling many of the genes that are differentially expressed."}, {"time": 7342, "text": "And these master regulators are themselves genetic targets of schizophrenia."}, {"time": 7347, "text": "And they are themselves involved in both synaptic connectivity and also in early brain development."}, {"time": 7354, "text": "So there's this sort of interconnectedness between synaptic development axis and also this transcriptional resilience."}, {"time": 7361, "text": "So, I mean, we basically made up a title that combines all these concepts."}, {"time": 7364, "text": "You have all these concepts, all these people working together, and ultimately these minds condense it down into a beautifully written little document that lives on forever."}, {"time": 7372, "text": "And that document now has its own life."}, {"time": 7375, "text": "Our work has 120,000 citations."}, {"time": 7379, "text": "I mean, that's not just people who read it."}, {"time": 7382, "text": "These are people who used it to write something based on it."}, {"time": 7385, "text": "I mean, that to me is just so fulfilling to basically say, wow, I've touched people."}, {"time": 7392, "text": "So I don't think of my legacy as I live every day."}, {"time": 7397, "text": "I just think of the beauty of the present and the power of interconnectedness."}, {"time": 7402, "text": "And just, I feel like a kid in a candy shop where I'm just like constantly, where do I, what package do I open first?"}, {"time": 7411, "text": "You're the lucky one."}, {"time": 7413, "text": "A jack of all trades, a master of none."}, {"time": 7417, "text": "I think for a Meaning of Life episode, we would be amiss if we did not have at least a poem or two."}, {"time": 7425, "text": "Do you mind if we end in a couple of poems?"}, {"time": 7429, "text": "Maybe a happy, maybe a sad one."}, {"time": 7431, "text": "I would love that."}, {"time": 7432, "text": "So thank you for the luxury."}, {"time": 7435, "text": "The first one is kind of, I remember when you were talking with Eric Weinstein about this comment of Leonard Cohen that says, but you don't really care for music, do you?"}, {"time": 7451, "text": "In Hallelujah."}, {"time": 7452, "text": "That's basically kind of like mocking its reader."}, {"time": 7456, "text": "So one of my poems is a little like that."}, {"time": 7458, "text": "So I had just broken up with my girlfriend and there's this other friend who was coming to visit me."}, {"time": 7466, "text": "And she said, I will not come unless you write me a poem."}, {"time": 7470, "text": "And I was like, writing a poem on demand."}, {"time": 7477, "text": "So this poem is called Write Me a Poem."}, {"time": 7480, "text": "It goes, write me a poem, she said with a smile."}, {"time": 7484, "text": "Make sure it's pretty, romantic and rhymes."}, {"time": 7487, "text": "Make sure it's worthy of that bold flame, that love uniting us beyond a mere game."}, {"time": 7492, "text": "And she took off without more words, rushed for the bus and traveled the world."}, {"time": 7497, "text": "A poem, I thought, this is sublime."}, {"time": 7500, "text": "What better way for passing the time?"}, {"time": 7503, "text": "What better way to count up the hours before she comes back to my lonely tower?"}, {"time": 7508, "text": "Waiting for joy to fill up my heart, let's write a poem for when we're apart."}, {"time": 7513, "text": "How does a poem start, I inquired."}, {"time": 7516, "text": "Give me a topic, cook up a style."}, {"time": 7518, "text": "Throw in some cute words, oh, here and there."}, {"time": 7520, "text": "Throw in some passion, love and despair."}, {"time": 7523, "text": "Love, three eggs, one pound of flour, three cups of water and bake for an hour."}, {"time": 7529, "text": "Love is no recipe as I understand."}, {"time": 7532, "text": "You can't just cook up a poem on demand."}, {"time": 7534, "text": "And as I was twisting all this in my mind, I looked at the page, by golly, it rhymed."}, {"time": 7540, "text": "Three roses, white chocolate, vanilla powder, some beautiful rhymes and maybe a flower."}, {"time": 7546, "text": "No, be romantic, the young girl insisted."}, {"time": 7549, "text": "Do this, do that, don't be so silly."}, {"time": 7551, "text": "You must believe it straight from your heart."}, {"time": 7553, "text": "If you don't feel it, we're better apart."}, {"time": 7556, "text": "Oh, my sweet thing, what can I say?"}, {"time": 7559, "text": "You bring me the sun all night and all day."}, {"time": 7562, "text": "You're the stars and the moon and the birds way up high."}, {"time": 7566, "text": "You're my evening sweet song, my morning blue sky."}, {"time": 7569, "text": "You are my muse, your spell has me caught."}, {"time": 7572, "text": "You bring me my voice and scatter my thoughts."}, {"time": 7575, "text": "To put that loving writing in vain, I can try."}, {"time": 7579, "text": "But when I'm with you, my wings want to fly."}, {"time": 7582, "text": "So I put down the pen and drop my defenses."}, {"time": 7585, "text": "Give myself to you and fill up my senses."}, {"time": 7591, "text": "The baffled king composing, that was beautiful."}, {"time": 7595, "text": "What I love about it is that I did not bring up a dictionary of rhymes."}, {"time": 7599, "text": "I did not sort of work hard."}, {"time": 7602, "text": "So basically when I write poems, I just type."}, {"time": 7605, "text": "I never go back, I just."}, {"time": 7608, "text": "So when my brain gets into that mode, it actually happens like I wrote it."}, {"time": 7612, "text": "Oh, wow, so the rhymes just kind of."}, {"time": 7614, "text": "The rhymes just kind of come."}, {"time": 7615, "text": "It's an emergent phenomenon."}, {"time": 7617, "text": "I just get into that mode and then it comes up."}, {"time": 7620, "text": "That's a beautiful one."}, {"time": 7622, "text": "And it's basically, you know, as you got it, it's basically saying it's no recipe and then I'm throwing in the recipes and as I'm writing it, I'm like, you know."}, {"time": 7631, "text": "So it's very introspective in this whole concept."}, {"time": 7636, "text": "So anyway, there's another one many years earlier that is, you know, darker."}, {"time": 7643, "text": "It's basically this whole concept of let's be friends."}]}]