[{"title": "Lee Smolin: Quantum Gravity and Einstein's Unfinished Revolution | Lex Fridman Podcast #79", "id": "WgLo4gmEraU", "quotes": [{"time": 290, "text": "But I still believe that behind that experience, that mirror or veil or whatever you wanna call it, there is a real world and I'm curious about it."}, {"time": 302, "text": "Can we truly, how do we get a sense of that real world?"}, {"time": 306, "text": "Is it through the tools of physics, from theory to the experiments?"}, {"time": 311, "text": "Or can we actually grasp it in some intuitive way that's more connected to our ape ancestors?"}, {"time": 321, "text": "Or is it still fundamentally the tools of math and physics that really allow us to grasp it?"}, {"time": 326, "text": "Well, let's talk about what tools they are."}, {"time": 329, "text": "What you say are the tools of math and physics."}, {"time": 332, "text": "I mean, I think we're in the same position as our ancestors in the caves or before the caves or whatever."}, {"time": 340, "text": "We find ourselves in this world and we're curious."}, {"time": 343, "text": "We also, it's important to be able to explain what happens when there are fires, when there are not fires, what animals and plants are good to eat and all that stuff."}, {"time": 356, "text": "But we're also just curious."}, {"time": 357, "text": "We look up in the sky and we see the sun and the moon and the stars and we see some of those move and we're very curious about that."}, {"time": 367, "text": "And I think we're just naturally curious."}, {"time": 370, "text": "So we make, this is my version of how we work."}, {"time": 376, "text": "We make up stories and explanations."}, {"time": 380, "text": "And where there are two things which I think are just true of being human, we make judgments fast because we have to."}, {"time": 391, "text": "Where to survive, is that a tiger or is that not a tiger?"}, {"time": 396, "text": "And we go."}, {"time": 397, "text": "Act."}, {"time": 398, "text": "We have to act fast on incomplete information."}, {"time": 401, "text": "So we judge quickly and we're often wrong or at least sometimes wrong, which is all I need for this."}, {"time": 409, "text": "We're often wrong."}, {"time": 410, "text": "So we fool ourselves and we fool other people readily."}, {"time": 416, "text": "And so there's lots of stories that get told and some of them result in a concrete benefit and some of them don't."}, {"time": 426, "text": "So you said we're often wrong, but what does it mean to be right?"}, {"time": 432, "text": "Right, that's an excellent question."}, {"time": 435, "text": "To be right, well since I believe that there is a real world, I believe that to be, you can challenge me on this if you're not a realist."}, {"time": 447, "text": "A realist is somebody who believes in this real objective world which is independent of our perception."}, {"time": 453, "text": "If I'm a realist, I think that to be right is to come closer."}, {"time": 460, "text": "I think first of all, there's a relative scale."}, {"time": 462, "text": "There's not right and wrong."}, {"time": 463, "text": "There's right or more right and less right."}, {"time": 466, "text": "And you're more right if you come closer to an exact true description of that real world."}, {"time": 473, "text": "Now can we know that for sure?"}, {"time": 476, "text": "And the scientific method is ultimately what allows us to get a sense of how close we're getting to that real world?"}, {"time": 483, "text": "No on two counts."}, {"time": 484, "text": "First of all, I don't believe there's a scientific method."}, {"time": 488, "text": "I was very influenced when I was in graduate school by the writings of Paul Fireman who was an important philosopher of science who argued that there isn't a scientific method."}, {"time": 498, "text": "There is or there is not?"}, {"time": 499, "text": "There is not."}, {"time": 500, "text": "Can you elaborate, I'm sorry if you were going to, but can you elaborate on what does it mean for there not to be a scientific method, this notion that I think a lot of people believe in in this day and age?"}, {"time": 516, "text": "Paul Fireman, he was a student of Popper who taught Karl Popper."}, {"time": 522, "text": "And Fireman argued both by logic and by historical example that you name anything that should be part of the practice of science."}, {"time": 535, "text": "Say you should always make sure that your theories agree with all the data that's already been taken."}, {"time": 541, "text": "And he'll prove to you that there have to be times when science contradicts, when some scientist contradicts that advice for science to progress overall."}, {"time": 556, "text": "So it's not a simple matter."}, {"time": 558, "text": "I think that, I think of science as a community."}, {"time": 565, "text": "Of people."}, {"time": 566, "text": "Of people and as a community of people bound by certain ethical precepts, precepts, whatever that is."}, {"time": 575, "text": "So in that community, a set of ideas they operate under, meaning ethically of kind of the rules of the game they operate under."}, {"time": 585, "text": "Don't lie, report all your results, whether they agree or don't agree with your hypothesis."}, {"time": 592, "text": "Check the training of a scientist."}, {"time": 596, "text": "Mostly consists of methods of checking because again, we make lots of mistakes."}, {"time": 601, "text": "We're very error prone."}, {"time": 603, "text": "But there are tools both on the mathematics side and the experimental side to check and double check and triple check."}, {"time": 611, "text": "And a scientist goes through a training and I think this is part of it."}, {"time": 616, "text": "You can't just walk off the street and say, yo, I'm a scientist."}, {"time": 620, "text": "You have to go through the training and the training, the test that lets you be done with the training is can you form a convincing case for something that your colleagues will not be able to shout down because they'll ask, did you check this?"}, {"time": 642, "text": "And did you check that?"}, {"time": 643, "text": "And did you check this?"}, {"time": 644, "text": "And what about seeming contradiction with this?"}, {"time": 647, "text": "And you've got to have answers to all those things or you don't get taken seriously."}, {"time": 653, "text": "And when you get to the point where you can produce that kind of defense and argument, then they give you a PhD."}, {"time": 662, "text": "And you're kind of licensed."}, {"time": 663, "text": "You're still gonna be questioned and you still may propose or publish mistakes."}, {"time": 670, "text": "But the community is gonna have to waste less time fixing your mistakes."}, {"time": 675, "text": "Yes, but if you can maybe linger on it a little longer, what's the gap between the thing that that community does and the ideal of the scientific method?"}, {"time": 688, "text": "The scientific method is you should be able to repeat and experiment."}, {"time": 696, "text": "There's a lot of elements to what construes the scientific method, but the final result, the hope of it is that you should be able to say with some confidence that a particular thing is close to the truth."}, {"time": 713, "text": "Right, but there's not a simple relationship between experiment and hypothesis or theory."}, {"time": 718, "text": "For example, Galileo did this experiment of dropping a ball from the top of a tower and it falls right at the base of the tower."}, {"time": 727, "text": "And an Aristotelian would say, wow, of course it falls right to the base of the tower."}, {"time": 732, "text": "That shows that the earth isn't moving while the ball is falling."}, {"time": 736, "text": "And Galileo says, no way, there's a principle of inertia and it has an inertia in the direction where the earth isn't moving and the tower and the ball and the earth all move together."}, {"time": 746, "text": "When the principle of inertia tells you it hits the bottom, it does look, therefore my principle of inertia is right."}, {"time": 753, "text": "And Aristotelian says, no, our style of science is right."}, {"time": 757, "text": "The earth is stationary."}, {"time": 759, "text": "And so you gotta get an interconnected bunch of cases and work hard to line up and explain."}, {"time": 769, "text": "It took centuries to make the transition from Aristotelian physics to the new physics."}, {"time": 775, "text": "It wasn't done until Newton in 1680 something, 1687."}, {"time": 782, "text": "So what do you think is the nature of the process that seems to lead to progress?"}, {"time": 787, "text": "If we at least look at the long arc of science, of all the community of scientists, they seem to do a better job of coming up with ideas that engineers can then take on and build rockets with or build computers with or build cool stuff with."}, {"time": 806, "text": "I don't know, a better job than what?"}, {"time": 810, "text": "Than this previous century."}, {"time": 812, "text": "So century by century, we'll talk about string theory and so on and kind of possible, what you might think of as dead ends and so on."}, {"time": 821, "text": "Which is not the way I think of string theory."}, {"time": 822, "text": "We'll straighten out, we'll get all the strings straight."}, {"time": 825, "text": "But there is, nevertheless in science, very often, at least temporary dead ends."}, {"time": 832, "text": "But if you look at the, through centuries, the century before Newton and the century after Newton, it seems like a lot of ideas came closer to the truth that then could be usable by our civilization to build the iPhone, right?"}, {"time": 852, "text": "To build cool things that improve our quality of life."}, {"time": 855, "text": "That's the progress I'm kind of referring to."}, {"time": 859, "text": "Let me, can I say that more precisely?"}, {"time": 861, "text": "Yes, well, it's a low bar."}, {"time": 863, "text": "Because I think it's important to get the time places right."}, {"time": 868, "text": "There was a scientific revolution that partly succeeded between about 1900 or late 1890s and into the 1930s, 1940s and so."}, {"time": 885, "text": "And maybe some, if you stretched it, into the 1970s."}, {"time": 890, "text": "And the technology, this was the discovery of relativity and that included a lot of developments of electromagnetism."}, {"time": 898, "text": "The confirmation, which wasn't really well confirmed into the 20th century, that matter was made of atoms."}, {"time": 906, "text": "And the whole picture of nuclei with electrons going around, this is early 20th century."}, {"time": 912, "text": "And then quantum mechanics was from 1905, took a long time to develop, to the late 1920s."}, {"time": 921, "text": "And then it was basically in final form."}, {"time": 925, "text": "And the basis of this partial revolution, and we can come back to why it's only a partial revolution, is the basis of the technologies that you mentioned."}, {"time": 937, "text": "All of, I mean, electrical technology was being developed slowly with this."}, {"time": 942, "text": "And in fact, there's a close relation between the development of electricity and the electrification of cities in the United States and Europe and so forth."}, {"time": 956, "text": "And the development of the science."}, {"time": 960, "text": "The fundamental physics since the early 1970s doesn't have a story like that so far."}, {"time": 971, "text": "There's not a series of triumphs and progresses and there's not any practical application."}, {"time": 979, "text": "So just to linger briefly on the early 20th century and the revolutions in science that happened there, what was the method by which the scientific community kept each other in check about when you get something right, when you get something wrong?"}, {"time": 1000, "text": "Is experimental validation ultimately the final test?"}, {"time": 1003, "text": "It's absolutely necessary."}, {"time": 1005, "text": "And the key things were all validated."}, {"time": 1007, "text": "The key predictions of quantum mechanics and of the theory of electricity and magnetism."}, {"time": 1014, "text": "So before we talk about Einstein, your new book, before String Theory, Quantum Mechanics, so on, let's take a step back at a higher level question."}, {"time": 1024, "text": "What is that you mentioned?"}, {"time": 1026, "text": "What is realism?"}, {"time": 1028, "text": "What is anti realism?"}, {"time": 1031, "text": "And maybe why do you find realism, as you mentioned, so compelling?"}, {"time": 1035, "text": "Well, realism is the belief in an external world independent of our existence, our perception, our belief, our knowledge."}, {"time": 1050, "text": "A realist as a physicist is somebody who believes that there should be possible some completely objective description of each and every process at the fundamental level, which describes and explains exactly what happens and why it happens."}, {"time": 1072, "text": "That kind of implies that that system, in a realist view, is deterministic, meaning there's no fuzzy magic going on that you can never get to the bottom, or you can get to the bottom of anything and perfectly describe it."}, {"time": 1087, "text": "Some people would say that I'm not that interested in determinism, but I could live with the fundamental world, which had some chance in it."}, {"time": 1098, "text": "So do you, you said you could live with it, but do you think God plays dice in our universe?"}, {"time": 1106, "text": "I think it's probably much worse than that."}, {"time": 1110, "text": "In which direction?"}, {"time": 1112, "text": "I think that theories can change, and theories can change without warning."}, {"time": 1116, "text": "I think the future is open."}, {"time": 1118, "text": "You mean the fundamental laws of physics can change?"}, {"time": 1122, "text": "Oh, okay, we'll get there."}, {"time": 1123, "text": "I thought we would be able to find some solid ground, but apparently the entirety of it, temporarily so, probably."}, {"time": 1135, "text": "Okay, so realism is the idea that while the ground is solid, you can describe it."}, {"time": 1142, "text": "What's the role of the human being, our beautiful, complex human mind in realism?"}, {"time": 1150, "text": "Do we have a, are we just another set of molecules connected together in a clever way, or the observer, does the observer, our human mind, consciousness, have a role in this realism view of the physical universe?"}, {"time": 1167, "text": "There's two ways, there's two questions you could be asking."}, {"time": 1170, "text": "One, does our conscious mind, do our perceptions play a role in making things become, in making things real or things becoming?"}, {"time": 1182, "text": "That's question one."}, {"time": 1183, "text": "Question two is, does this, we can call it a naturalist view of the world that is based on realism, allow a place to understand the existence of and the nature of perceptions and consciousness in mind, and that's question two."}, {"time": 1204, "text": "Question two, I do think a lot about, and my answer, which is not an answer, is I hope so, but it certainly doesn't yet."}, {"time": 1214, "text": "So what kind?"}, {"time": 1214, "text": "Question one, I don't think so."}, {"time": 1217, "text": "But of course, the answer to question one depends on question two."}, {"time": 1221, "text": "So I'm not up to question one yet."}, {"time": 1224, "text": "So question two is the thing that you can kind of struggle with at this time."}, {"time": 1228, "text": "That's, what about the anti realists?"}, {"time": 1232, "text": "So what flavor, what are the different camps of anti realists that you've talked about?"}, {"time": 1238, "text": "I think it would be nice if you can articulate for the people for whom there is not a very concrete real world, or there's divisions, or it's messier than the realist view of the universe, what are the different camps, what are the different views?"}, {"time": 1254, "text": "I'm not sure I'm a good scholar and can talk about the different camps and analyze it, but some, many of the inventors of quantum physics were not realists, were anti realists."}, {"time": 1267, "text": "Their scholars, they lived in a very perilous time between the two world wars."}, {"time": 1273, "text": "And there were a lot of trends in culture which were going that way."}, {"time": 1279, "text": "But in any case, they said things like, the purpose of science is not to give an objective realist description of nature as it would be in our absence."}, {"time": 1290, "text": "This might be saying Niels Bohr."}, {"time": 1293, "text": "The purpose of science is as an extension of our conversations with each other to describe our interactions with nature."}, {"time": 1301, "text": "And we're free to invent and use terms like particle, or wave, or causality, or time, or space."}, {"time": 1308, "text": "If they're useful to us, and they carry some intuitive implication, but we shouldn't believe that they actually have to do with what nature would be like in our absence, which we have nothing to say about."}, {"time": 1325, "text": "Do you find any aspect of that, because you kind of said that we human beings tell stories, do you find aspects of that kind of anti realist view of Niels Bohr compelling?"}, {"time": 1338, "text": "That we fundamentally are storytellers, and then we create tools of space, and time, and causality, and whatever this fun quantum mechanic stuff is to help us tell the story of our world."}, {"time": 1352, "text": "Sure, I just would like to believe that there's an aspiration for the other thing."}, {"time": 1359, "text": "The other thing being what?"}, {"time": 1361, "text": "The realist point of view."}, {"time": 1364, "text": "Do you hope that the stories will eventually lead us to discovering the real world as it is?"}, {"time": 1377, "text": "Is perfection possible, by the way?"}, {"time": 1380, "text": "Well that's, you mean will we ever get there and know that we're there?"}, {"time": 1386, "text": "That's not my, that's for people 5,000 years in the future."}, {"time": 1389, "text": "We're certainly nowhere near there yet."}, {"time": 1394, "text": "Do you think reality that exists outside of our mind, do you think there's a limit to our cognitive abilities?"}, {"time": 1404, "text": "Is, again, descendants of apes, who are just biological systems, is there a limit to our mind's capability to actually understand reality?"}, {"time": 1415, "text": "Sort of, there comes a point, even with the help of the tools of physics, that we just cannot grasp some fundamental aspects of that reality."}, {"time": 1427, "text": "Again, I think that's a question for 5,000 years in the future."}, {"time": 1429, "text": "We're not even close to that limit."}, {"time": 1431, "text": "I think there is a universality."}, {"time": 1434, "text": "Here, I don't agree with David Deutsch about everything, but I admire the way he put things in his last book."}, {"time": 1441, "text": "And he talked about the role of explanation."}, {"time": 1444, "text": "And he talked about the universality of certain languages or the universality of mathematics or of computing and so forth."}, {"time": 1455, "text": "And he believed that universality, which is something real, which somehow comes out of the fact that a symbolic system or a mathematical system can refer to itself and can, I forget what that's called, can reference back to itself and build, in which he argued for a universality of possibility for our understanding, whatever is out there."}, {"time": 1481, "text": "But I admire that argument, but it seems to me we're doing okay so far, but we'll have to see."}, {"time": 1493, "text": "Whether there is a limit or not."}, {"time": 1495, "text": "For now, we've got plenty to play with."}, {"time": 1498, "text": "There are things which are right there in front of us which we miss."}, {"time": 1503, "text": "And I'll quote my friend, Eric Weinstein, in saying, look, Einstein carried his luggage."}, {"time": 1510, "text": "Freud carried his luggage."}, {"time": 1512, "text": "Marx carried his luggage."}, {"time": 1513, "text": "Martha Graham carried her luggage, et cetera."}, {"time": 1517, "text": "Edison carried his luggage."}, {"time": 1519, "text": "All these geniuses carried their luggage."}, {"time": 1522, "text": "And not once before relatively recently did it occur to anybody to put a wheel on luggage and pull it."}, {"time": 1529, "text": "And it was right there waiting to be invented for centuries."}, {"time": 1534, "text": "So this is Eric Weinstein."}, {"time": 1539, "text": "What do the wheels represent?"}, {"time": 1540, "text": "Are you basically saying that there's stuff right in front of our eyes?"}, {"time": 1543, "text": "That once we, it just clicks, we put the wheels on the luggage, a lot of things will fall into place."}, {"time": 1549, "text": "Yes, I do, I do."}, {"time": 1552, "text": "And every day I wake up and think, why can't I be that guy who was walking through the airport?"}, {"time": 1560, "text": "What do you think it takes to be that guy?"}, {"time": 1562, "text": "Because like you said, a lot of really smart people carried their luggage."}, {"time": 1570, "text": "What, just psychologically speaking, so Eric Weinstein is a good example of a person who thinks outside the box."}, {"time": 1576, "text": "Who resists almost conventional thinking."}, {"time": 1581, "text": "You're an example of a person who by habit, by psychology, by upbringing, I don't know, but resists conventional thinking as well, just by nature."}, {"time": 1592, "text": "Thank you, that's a compliment."}, {"time": 1592, "text": "That's a compliment?"}, {"time": 1594, "text": "So what do you think it takes to do that?"}, {"time": 1597, "text": "Is that something you were just born with?"}, {"time": 1600, "text": "I doubt it."}, {"time": 1602, "text": "Well, from my studying some cases, because I'm curious about that, obviously, and just in a more concrete way, when I started out in physics, because I started a long way from physics, so it took me a long, not a long time, but a lot of work to get to study it and get into it, so I did wonder about that."}, {"time": 1627, "text": "And so I read the biographies, and in fact, I started with the autobiography of Einstein and Newton and Galileo and all those people."}, {"time": 1638, "text": "And I think there's a couple of things."}, {"time": 1642, "text": "Some of it is luck, being in the right place at the right time."}, {"time": 1646, "text": "Some of it is stubbornness and arrogance, which can easily go wrong."}, {"time": 1651, "text": "And I know all of these are doorways."}, {"time": 1656, "text": "If you go through them slightly at the wrong speed or in the wrong angle, they're ways to fail."}, {"time": 1665, "text": "But if you somehow have the right luck, the right confidence or arrogance, caring, I think Einstein cared to understand nature with ferocity and a commitment that exceeded other people of his time."}, {"time": 1682, "text": "So he asked more stubborn questions."}, {"time": 1685, "text": "He asked deeper questions."}, {"time": 1689, "text": "I think, and there's a level of ability and whether ability is born in or can be developed to the extent to which it can be developed, like any of these things like musical talent."}, {"time": 1704, "text": "So you mentioned ego."}, {"time": 1707, "text": "What's the role of ego in that process?"}, {"time": 1710, "text": "But in your own life, have you found yourself walking that nice edge of too much or too little, so being overconfident and therefore leaning yourself astray or not sufficiently confident to throw away the conventional thinking of whatever the theory of the day, of theoretical physics?"}, {"time": 1731, "text": "I don't know if I, I mean, I've contributed where I've contributed, whether if I had had more confidence in something, I would have gotten further."}, {"time": 1743, "text": "Certainly, I'm sitting here at this moment with very much my own approach to nearly everything."}, {"time": 1754, "text": "And I'm calm, I'm happy about that."}, {"time": 1758, "text": "But on the other hand, I know people whose self confidence vastly exceeds mine."}, {"time": 1766, "text": "And sometimes I think it's justified and sometimes I think it's not justified."}, {"time": 1773, "text": "Your most recent book titled Einstein's Unfinished Revolution."}, {"time": 1777, "text": "So I have to ask, what is Einstein's unfinished revolution and also how do we finish it?"}, {"time": 1814, "text": "And he was, I mean, people I think don't always associate Einstein with quantum mechanics because I think his connection with it, founding as one of the founders, I would say, of quantum mechanics, he kind of put it in the closet."}, {"time": 1831, "text": "Well, he didn't believe that the quantum mechanics as it was developed in the mid to late 1920s was completely correct."}, {"time": 1839, "text": "At first, he didn't believe it at all."}, {"time": 1842, "text": "Then he was convinced that it's consistent, but incomplete, and that also is my view."}, {"time": 1847, "text": "It needs, for various reasons, I can elucidate, to have additional degrees of freedom, particles, forces, something to reach the stage where it gives a complete description of each phenomenon, as I was saying, realism demands."}, {"time": 1867, "text": "So what aspect of quantum mechanics bothers you and Einstein the most?"}, {"time": 1872, "text": "Is it some aspect of the wave function collapse discussions, the measurement problem?"}, {"time": 1879, "text": "Is it the?"}, {"time": 1883, "text": "The measurement problem."}, {"time": 1884, "text": "I'm not gonna speak for Einstein."}, {"time": 1886, "text": "But the measurement problem, basically, and the fact that."}, {"time": 1891, "text": "What is the measurement problem, sorry?"}, {"time": 1894, "text": "The basic formulation of quantum mechanics gives you two ways to evolve situations in time."}, {"time": 1901, "text": "One of them is explicitly when no observer is observing and no measurement is taking place."}, {"time": 1907, "text": "And the other is when a measurement or an observation is taking place."}, {"time": 1910, "text": "And they basically contradict each other."}, {"time": 1913, "text": "But there's another reason why the revolution was incomplete, which is we don't understand the relationship between these two parts."}, {"time": 1921, "text": "General relativity, which became our best theory of space and time and gravitation and cosmology, and quantum theory."}, {"time": 1931, "text": "So for the most part, general relativity describes big things."}, {"time": 1935, "text": "Quantum theory describes little things."}, {"time": 1938, "text": "And that's the revolution that we found really powerful tools to describe big things and little things."}, {"time": 1944, "text": "And it's unfinished because we have two totally separate things and we need to figure out how to connect them so we can describe everything."}, {"time": 1952, "text": "Right, and we either do that if we believe quantum mechanics as understood now is correct by bringing general relativity or some extension of general relativity that describes gravity and so forth into the quantum domain that's called quantize, the theory of gravity."}, {"time": 1972, "text": "Or if you believe with Einstein that quantum mechanics needs to be completed, and this is my view, then part of the job of finding the right completion or extension of quantum mechanics would be one that incorporated space, time, and gravity."}, {"time": 1992, "text": "So, where do we begin?"}, {"time": 1994, "text": "So first, let me ask, perhaps you can give me a chance, if I could ask you some just really basic questions."}, {"time": 2002, "text": "Well, they're not at all."}, {"time": 2003, "text": "The basic questions are the hardest, but you mentioned space, time."}, {"time": 2006, "text": "What is space, time?"}, {"time": 2008, "text": "Space, time, you talked about a construction."}, {"time": 2012, "text": "So I believe the space, time is an intellectual construction that we make of the events in the universe."}, {"time": 2019, "text": "I believe the events are real, and the relationships between the events, which cause which are real."}, {"time": 2025, "text": "But the idea that there's a four dimensional smooth geometry which has a metric and a connection and satisfies the equations that Einstein wrote, it's a good description to some scale."}, {"time": 2040, "text": "It's a good approximation, it captures some of what's really going on in nature."}, {"time": 2045, "text": "But I don't believe it for a minute is fundamental."}, {"time": 2048, "text": "So, okay, we're gonna allow me to linger on that."}, {"time": 2052, "text": "So the universe has events, events cause other events."}, {"time": 2056, "text": "This is the idea of causality."}, {"time": 2059, "text": "Okay, so that's real."}, {"time": 2062, "text": "That's in my."}, {"time": 2063, "text": "In your view is real."}, {"time": 2065, "text": "Or hypothesis, or the theories that I have been working to develop make that assumption."}, {"time": 2072, "text": "So space, time, you said four dimensional space is kind of the location of things, and time is whatever the heck time is."}, {"time": 2082, "text": "And you're saying that space, time is, both space and time are emergent and not fundamental?"}, {"time": 2092, "text": "Sorry, before you correct me, what does it mean to be fundamental or emergent?"}, {"time": 2098, "text": "Fundamental means it's part of the description as far down as you go."}, {"time": 2103, "text": "We have this notion."}, {"time": 2103, "text": "As real."}, {"time": 2105, "text": "As real as real it could be."}, {"time": 2107, "text": "Yeah, so I think that time is fundamental, and quote goes all the way down, and space does not, and the combination of them we use in general relativity that we call space time also does not."}, {"time": 2120, "text": "But what is time then?"}, {"time": 2124, "text": "I think that time, the activity of time is a continual creation of events from existing events."}, {"time": 2134, "text": "So if there's no events, there's no time."}, {"time": 2137, "text": "Then there's not only no time, there's no nothing."}, {"time": 2141, "text": "So I believe the universe has a history which goes to the past."}, {"time": 2148, "text": "I believe the future does not exist."}, {"time": 2151, "text": "There's a notion of the present and a notion of the past, and the past consists of, is a story about events that took place to our past."}, {"time": 2163, "text": "So you said the future doesn't exist."}, {"time": 2168, "text": "Could you say that again?"}, {"time": 2170, "text": "Can you try to give me a chance to understand that one more time?"}, {"time": 2175, "text": "So events cause other events."}, {"time": 2178, "text": "What is this universe?"}, {"time": 2179, "text": "Cause we'll talk about locality and nonlocality."}, {"time": 2185, "text": "Cause it's a crazy, I mean it's not crazy, it's a beautiful set of ideas that you propose."}, {"time": 2192, "text": "But, and if Kozali is fundamental, I'd just like to understand it better."}, {"time": 2197, "text": "What is the past?"}, {"time": 2198, "text": "What is the future?"}, {"time": 2200, "text": "What is the flow of time?"}, {"time": 2202, "text": "Even the error of time in our universe, in your view."}, {"time": 2206, "text": "And maybe what's an event, right?"}, {"time": 2210, "text": "Oh, an event is where something changes, or where two, it's hard to say because it's a primitive concept."}, {"time": 2222, "text": "An event is a moment of time within space."}, {"time": 2227, "text": "This is the view in general relativity, where two particles intersect in their paths, or something changes in the path of a particle."}, {"time": 2239, "text": "Now, we are postulating that there is, at the fundamental level, a notion, which is an elementary notion, so it doesn't have a definition in terms of other things, but it is something elementary happening."}, {"time": 2254, "text": "And it doesn't have a connection to energy, or matter, or exchange of energy?"}, {"time": 2258, "text": "It does have a connection to energy and matter."}, {"time": 2260, "text": "So it's at that level."}, {"time": 2261, "text": "Yeah, it involves, and that's why the version of a theory of events that I've developed with Marina Cortez, and it's, by the way, I wanna mention my collaborators, because they've been at least as important in this work as I have."}, {"time": 2277, "text": "It's Marina Cortez in all the work since about 2013, 2012, 2013, about causality, causal sets."}, {"time": 2287, "text": "And in the period before that, Roberta Mangibera Unger, who is a philosopher and a professor of law."}, {"time": 2294, "text": "And that's in your efforts, together with your collaborators, to finish the unfinished revolution."}, {"time": 2300, "text": "And focus on causality as a fundamental."}, {"time": 2304, "text": "As fundamental to physics."}, {"time": 2308, "text": "And there's certainly other people we've worked with, but those two people's thinking had a huge influence on my own thinking."}, {"time": 2314, "text": "So in the way you describe causality, that's what you mean of time being fundamental."}, {"time": 2319, "text": "That causality is fundamental."}, {"time": 2323, "text": "And what does it mean for space to not be fundamental, to be emergent?"}, {"time": 2328, "text": "That's very good."}, {"time": 2328, "text": "There's a level of description in which there are events, there are events create other events, but there's no space."}, {"time": 2339, "text": "They don't live in space."}, {"time": 2340, "text": "They have an order in which they caused each other."}, {"time": 2344, "text": "And that is part of the nature of time for us."}, {"time": 2347, "text": "But there is an emergent approximate description."}, {"time": 2353, "text": "And you asked me to define emergent."}, {"time": 2357, "text": "An emergent property is a property that arises at some level of complexity, larger than and more complex than the fundamental level, which requires some property to describe it, which is not directly explicable or derivable is the word I want from the properties of the fundamental things."}, {"time": 2388, "text": "And space is one of those things in a sufficiently complex universe, space, three dimensional position of things emerged."}, {"time": 2398, "text": "Yes, and we have this, we saw how this happens in detail in some models, both computationally and analytically."}, {"time": 2407, "text": "Okay, so connected to space is the idea of locality."}, {"time": 2413, "text": "So we've talked about realism."}, {"time": 2415, "text": "So I live in this world that like sports."}, {"time": 2421, "text": "Locality is a thing that you can affect things close to you and don't have an effect on things that are far away."}, {"time": 2429, "text": "It's the thing that bothers me about gravity in general or action at a distance."}, {"time": 2435, "text": "Same thing that probably bothered Newton, or at least he said a little bit about it."}, {"time": 2443, "text": "Okay, so what do you think about locality?"}, {"time": 2445, "text": "Is it just a construct?"}, {"time": 2448, "text": "Is it us humans just like this idea and are connected to it because we exist in it, we need it for our survival, but it's not fundamental?"}, {"time": 2457, "text": "I mean, it seems crazy for it not to be a fundamental aspect of our reality."}, {"time": 2463, "text": "Can you comfort me on a sort of as a therapist, like how do I?"}, {"time": 2467, "text": "I'm not a good therapist, but I'll do my best."}, {"time": 2473, "text": "There are several different definitions of locality when you come to talk about locality in physics."}, {"time": 2480, "text": "In quantum field theory, which is a mixture of special relativity and quantum mechanics, there is a precise definition of locality."}, {"time": 2493, "text": "Field operators corresponding to events in space time, which are space like separated, commute with each other as operators."}, {"time": 2501, "text": "So in quantum mechanics, you think about the nature of reality as fields and things that are close in a field have an impact on each other more than farther away."}, {"time": 2513, "text": "That's, yes."}, {"time": 2514, "text": "That's very comforting."}, {"time": 2516, "text": "So that's a property of quantum field theory and it's well tested."}, {"time": 2520, "text": "Unfortunately, there's another definition of local, which was expressed by Einstein and expressed more precisely by John Bell, which has been tested experimentally and found to fail."}, {"time": 2535, "text": "And this set up is you take two particles."}, {"time": 2539, "text": "So one thing that's really weird about quantum mechanics is a property called entanglement."}, {"time": 2546, "text": "You can have two particles interact and then share a property without it being a property of either one of the two particles."}, {"time": 2555, "text": "And if you take such a system and then you make a measurement on particle A, which is over here on my right side, and particle B, which is over here."}, {"time": 2568, "text": "Somebody else makes a measurement of particle B."}, {"time": 2570, "text": "You can ask that whatever is the real reality of particle B, it not be affected by the choice the observer at particle A makes about what to measure, not the outcome, just the choice of the different things they might measure."}, {"time": 2589, "text": "And that's a notion of locality because it assumes that these things are very far spaced like separated."}, {"time": 2596, "text": "And it's gonna take a while for any information about the choice made by the people here at A to affect the reality at B."}, {"time": 2604, "text": "But you make that assumption, that's called Bell locality."}, {"time": 2607, "text": "And you derive a certain inequality that some correlations, functions of correlations have to satisfy."}, {"time": 2616, "text": "And then you can test that pretty directly in experiments which create pairs of photons or other particles."}, {"time": 2624, "text": "And it's wrong by many sigma."}, {"time": 2626, "text": "In experiment, it doesn't match."}, {"time": 2631, "text": "That means that that definition of locality I stated is false."}, {"time": 2636, "text": "The one that Einstein was playing with."}, {"time": 2638, "text": "Yeah, and the one that I stated, that is it's not true that whatever is real about particle B is unaffected by the choice that the observer makes as to what to measure in particle A."}, {"time": 2652, "text": "No matter how long they've been propagating at almost the speed of light or the speed of light away from each other, it's no matter."}, {"time": 2659, "text": "So like the distance between them."}, {"time": 2662, "text": "Well, it's been tested, of course, if you want to have hope for quantum mechanics being incomplete or wrong and corrected by something that changes this."}, {"time": 2672, "text": "It's been tested over a number of kilometers."}, {"time": 2675, "text": "I don't remember whether it's 25 kilometers or a hundred and something kilometers, but."}, {"time": 2682, "text": "So in trying to solve the unsolved revolution, in trying to come up with the theory for everything, is causality fundamental and breaking away from locality?"}, {"time": 2699, "text": "A crucial step."}, {"time": 2700, "text": "So in your book, essentially, those are the two things we really need to think about as a community."}, {"time": 2707, "text": "Especially the physics community has to think about this."}, {"time": 2712, "text": "I guess my question is, how do we solve?"}, {"time": 2715, "text": "How do we finish the unfinished revolution?"}, {"time": 2719, "text": "Well, that's, I can only tell you what I'm trying to do and what I've abandoned as not working."}, {"time": 2727, "text": "As one ant, smart ant in an ant colony."}, {"time": 2732, "text": "Or maybe dumb, that's why, who knows?"}, {"time": 2735, "text": "But anyway, my view of the, we've had some nice theories invented."}, {"time": 2745, "text": "There's a bunch of different ones."}, {"time": 2747, "text": "Both relate to quantum mechanics, relate to quantum gravity."}, {"time": 2751, "text": "There's a lot to admire in many of these different approaches."}, {"time": 2756, "text": "But to my understanding, they, none of them completely solve the problems that I care about."}, {"time": 2765, "text": "And so we're in a situation which is either terrifying for a student or full of opportunity for the right student, in which we've got more than a dozen attempts."}, {"time": 2779, "text": "And I never thought, I don't think anybody anticipated it would work out this way."}, {"time": 2783, "text": "Which work partly and then at some point, they have an issue that nobody can figure out how to go around or how to solve."}, {"time": 2791, "text": "And that's the situation we're in."}, {"time": 2796, "text": "My reaction to that is twofold."}, {"time": 2799, "text": "One of them is to try to bring people, we evolved into this unfortunate sociological situation in which there are communities around some of these approaches."}, {"time": 2810, "text": "And to borrow again, a metaphor from Eric, they sit on top of hills in the landscape of theories and throw rocks at each other."}, {"time": 2820, "text": "And as Eric says, we need two things."}, {"time": 2822, "text": "We need people to get off their hills and come down into the valleys and party and talk and become friendly and learn to say, not no but, but yes and yes."}, {"time": 2838, "text": "Your idea goes this far, but maybe if we put it together with my idea, we can go further."}, {"time": 2845, "text": "So in that spirit, I've talked several times with Sean Carroll, who's also written an excellent book recently."}, {"time": 2854, "text": "And he kind of, he plays around, is a big fan of the many worlds interpretation of quantum mechanics."}, {"time": 2860, "text": "So I'm a troublemaker."}, {"time": 2862, "text": "So let me ask, what's your sense of Sean and the idea of many worlds interpretation?"}, {"time": 2870, "text": "I've read many the commentary back and forth."}, {"time": 2872, "text": "You guys are friendly, respect each other, but have a lot of fun debating."}, {"time": 2877, "text": "I love Sean and he, no, I really, he's articulate and he's a great representative or ambassador of science to the public and for different fields of science to each other."}, {"time": 2894, "text": "He also, like I do, takes philosophy seriously."}, {"time": 2899, "text": "And unlike what I do in all cases, he has really done the homework."}, {"time": 2906, "text": "He's read a lot, he knows the people, he talks to them, he exposes his arguments to them."}, {"time": 2914, "text": "And I, there's this mysterious thing that we so often end up on the opposite sides of one of these issues."}, {"time": 2921, "text": "It's fun though."}, {"time": 2923, "text": "It's fun and I'd love to have a conversation about that, but I would want to include him."}, {"time": 2930, "text": "I see, about many worlds, well."}, {"time": 2932, "text": "No, I can tell you what I think about many worlds."}, {"time": 2934, "text": "I'd love to, but actually on that, let me pause."}, {"time": 2936, "text": "Sean has a podcast."}, {"time": 2937, "text": "You should definitely figure out how to talk to Sean."}, {"time": 2940, "text": "I would, I actually told Sean, I would love to hear you guys just going back and forth."}, {"time": 2945, "text": "So I hope you can make that happen eventually, you and Sean."}, {"time": 2948, "text": "I won't tell you what it is, but there's something that Sean said to me in June of 2016 that changed my whole approach to a problem."}, {"time": 2957, "text": "But I'll have to tell him first."}, {"time": 2959, "text": "Yes, and that, that'll be great to tell him on his podcast."}, {"time": 2964, "text": "I can't invite myself to his podcast."}, {"time": 2966, "text": "But I told him, yeah, okay, we'll make it happen."}, {"time": 2968, "text": "So many worlds."}, {"time": 2971, "text": "What's your view?"}, {"time": 2972, "text": "Many worlds, we talk about nonlocality."}, {"time": 2974, "text": "Many worlds is also a very uncomfortable idea or beautiful depending on your perspective."}, {"time": 2983, "text": "It's very nice in terms of, I mean, there's a realist aspect to it."}, {"time": 2990, "text": "I think you called it magical realism."}, {"time": 2993, "text": "It's just a beautiful line."}, {"time": 2995, "text": "But at the same time, it's very difficult to far limited human minds to comprehend."}, {"time": 3001, "text": "So what are your thoughts about it?"}, {"time": 3004, "text": "Let me start with the easy and obvious and then go to the scientific."}, {"time": 3012, "text": "It doesn't appeal to me."}, {"time": 3013, "text": "It doesn't answer the questions that I want answered."}, {"time": 3017, "text": "And it does so to such a strong case that when Roberto Mangueber Anger and I began looking for principles, and I want to come back and talk about the use of principles in science, because that's the other thing I was going to say, and I don't want to lose that."}, {"time": 3032, "text": "When we started looking for principles, we made our first principle, there is just one world and it happens once."}, {"time": 3039, "text": "But so it's not helpful to my personal approach, to my personal agenda, but of course I'm part of a community."}, {"time": 3051, "text": "And my sense of the many worlds interpretation, I have thought a lot about it and struggled a lot with it, is the following."}, {"time": 3065, "text": "First of all, there's Everett himself, there's what's in Everett."}, {"time": 3070, "text": "And there are several issues there connected with the derivation of the Born Rule, which is the rule that gives probabilities to events."}, {"time": 3080, "text": "And the reasons why there is a problem with probability is that I mentioned the two ways that physical systems can evolve."}, {"time": 3091, "text": "The many worlds interpretation cuts off, one, the one having to do with measurement, and just has the other one, the Schrodinger evolution, which is this smooth evolution of the quantum state."}, {"time": 3104, "text": "But the notion of probability is only in the second rule, which we've thrown away."}, {"time": 3110, "text": "So where does probability come from?"}, {"time": 3112, "text": "And you have to answer the question because experimentalists use probabilities to check the theory."}, {"time": 3120, "text": "Now, at first sight, you get very confused because there seems to be a real problem because in the many worlds interpretation, this talk about branches is not quite precise, but I'll use it."}, {"time": 3136, "text": "There's a branch in which everything that might happen does happen with probability one in that branch."}, {"time": 3143, "text": "You might think you could count the number of branches in which things do and don't happen and get numbers that you can define as something like frequentist probabilities."}, {"time": 3155, "text": "And Everett did have an argument in that direction, but the argument gets very subtle when there are an infinite number of possibilities, as is the case in most quantum systems."}, {"time": 3169, "text": "And my understanding, although I'm not as much of an expert as some other people, is that Everett's own proposal failed, did not work."}, {"time": 3180, "text": "There are then, but it doesn't stop there."}, {"time": 3185, "text": "There is an important idea that Everett didn't know about, which is decoherence, and it is a phenomenon that might be very much relevant."}, {"time": 3193, "text": "And so a number of people post Everett have tried to make versions of what you might call many worlds quantum mechanics."}, {"time": 3206, "text": "And this is a big area and it's subtle, and it's not the kind of thing that I do well."}, {"time": 3213, "text": "So I consulted, that's why there's two chapters on this in the book I wrote."}, {"time": 3217, "text": "Chapter 10, which is about Everett's version, chapter 11, there's a very good group of philosophers of physics in Oxford, Simon Saunders, David Wallace, Harvey Brown, and a number of others."}, {"time": 3232, "text": "And of course there's David Deutsch, who is there."}, {"time": 3237, "text": "And those people have developed and put a lot of work into a very sophisticated set of ideas designed to come back and answer that question."}, {"time": 3247, "text": "They have the flavor of there are really no probabilities, we admit that, but imagine if the Everett story was true and you were living in that multiverse, how would you make bets?"}, {"time": 3260, "text": "And so they use decision theory from the theory of probability and gambling and so forth to shape a story of how you would bet if you were inside an Everett in the universe and you knew that."}, {"time": 3277, "text": "And there's a debate among those experts as to whether they or somebody else has really succeeded."}, {"time": 3287, "text": "And when I checked in as I was finishing the book with some of those people, like Simon, who's a good friend of mine, and David Wallace, they told me that they weren't sure that any of them was yet correct."}, {"time": 3302, "text": "So that's what I put in my book."}, {"time": 3304, "text": "Now, to add to that, Sean has his own approach to that problem in what's called self referencing or self locating observers."}, {"time": 3314, "text": "And it doesn't, I tried to read it and it didn't make sense to me, but I didn't study it hard, I didn't communicate with Sean, I didn't do the things that I would do, so I had nothing to say about it in the book."}, {"time": 3330, "text": "I don't know whether it's right or not."}, {"time": 3332, "text": "Let's talk a little bit about science."}, {"time": 3336, "text": "You mentioned the use of principles in science."}, {"time": 3340, "text": "What does it mean to have a principle and why is that important?"}, {"time": 3345, "text": "When I feel very frustrated about quantum gravity, I like to go back and read history."}, {"time": 3351, "text": "And of course, Einstein, his achievements are a huge lesson and hopefully something like a role model."}, {"time": 3360, "text": "And it's very clear that Einstein thought that the first job when you wanna enter a new domain of theoretical physics is to discover and invent principles and then make models of how those principles might be applied in some experimental situation, which is where the mathematics comes in."}, {"time": 3382, "text": "So for Einstein, there was no unified space and time."}, {"time": 3387, "text": "Minkowski invented this idea of space time."}, {"time": 3390, "text": "For Einstein, it was a model of his principles or his postulates."}, {"time": 3396, "text": "And I've taken the view that we don't know the principles of quantum gravity."}, {"time": 3403, "text": "I can think about candidates and I have some papers where I discuss different candidates and I'm happy to discuss them."}, {"time": 3412, "text": "But my belief now is that those partially successful approaches are all models, which might describe indeed some quantum gravity physics in some domain, in some aspect, but ultimately would be important because they model the principles and the first job is to tie down those principles."}, {"time": 3438, "text": "So that's the approach that I'm taking."}, {"time": 3441, "text": "So speaking of principles, in your 2006 book, The Trouble with Physics, you criticized a bit string theory for taking us away from the rigors of the scientific method or whatever you would call it."}, {"time": 3457, "text": "But what's the trouble with physics today and how do we fix it?"}, {"time": 3464, "text": "Can I say how I read that book?"}, {"time": 3468, "text": "Because I, and I'm not, this of course has to be my fault because you can't as an author claim after all the work you put in that you are misread."}, {"time": 3479, "text": "But I will say that many of the reviewers who are not personally involved and even many who were working on string theory or some other approach to quantum gravity told me, communicated with me and told me they thought that I was fair and balance was the word that was usually used."}, {"time": 3500, "text": "So let me tell you what my purpose was in writing that book, which clearly got diverted by, because there was already a rather hot argument going on."}, {"time": 3515, "text": "And this is."}, {"time": 3516, "text": "On which topic?"}, {"time": 3516, "text": "On string theory specifically?"}, {"time": 3518, "text": "Or in general in physics?"}, {"time": 3521, "text": "No, more specifically than string theory."}, {"time": 3524, "text": "So since we're in Cambridge, can I say that?"}, {"time": 3527, "text": "We're doing this in Cambridge."}, {"time": 3528, "text": "Yeah, yeah, of course."}, {"time": 3529, "text": "Cambridge, just to be clear, Massachusetts."}, {"time": 3532, "text": "And on Harvard campus."}, {"time": 3535, "text": "Right, so Andy Straminger is a good friend of mine and has been for many, many years."}, {"time": 3543, "text": "And Andy, so originally there was this beautiful idea that there were five string theories and maybe they would be unified into one."}, {"time": 3554, "text": "And we would discover a way to break that symmetries of one of those string theories and discover the standard model and predict all the properties of standard model particles, like their masses and charges and so forth, coupling constants."}, {"time": 3571, "text": "And then there was a bunch of solutions to string theory found, which led each of them to a different version of particle physics with a different phenomenology."}, {"time": 3582, "text": "These are called the Calabi Yao manifolds, named after Yao, who is also here."}, {"time": 3590, "text": "Not, certainly we've been friends at some time in the past anyway."}, {"time": 3595, "text": "And then there were, nobody was sure, but hundreds of thousands of different versions of string theory."}, {"time": 3601, "text": "And then Andy found there was a way to put a certain kind of mathematical curvature called torsion into the solutions."}, {"time": 3610, "text": "And he wrote a paper, String Theory with Torsion, in which he discovered there was, and not formally uncountable, but he was unable to invent any way to count the number of solutions or classify the diverse solutions."}, {"time": 3627, "text": "And he wrote that this is worrying because doing phenomenology the old fashioned way by solving the theory is not gonna work because there's gonna be loads of solutions for every proposed phenomenology for anything the experiments discovered."}, {"time": 3645, "text": "And it hasn't quite worked out that way."}, {"time": 3647, "text": "But nonetheless, he took that worry to me."}, {"time": 3651, "text": "We spoke at least once, maybe two or three times about that."}, {"time": 3656, "text": "And I got seriously worried about that."}, {"time": 3660, "text": "And this is just a little."}, {"time": 3662, "text": "So it's like an anecdote that inspired your worry about string theory in general?"}, {"time": 3667, "text": "Well, I tried to solve the problem and I tried to solve the problem."}, {"time": 3672, "text": "I was reading at that time, a lot of biology, a lot of evolutionary theory, like Linmar Gullis and Steve Gould and so forth."}, {"time": 3683, "text": "And I could take your time to go through the things, but it occurred to me, maybe physics was like evolutionary biology and maybe the laws evolved."}, {"time": 3696, "text": "And there was, the biologists talk about a landscape, a fitness landscape of DNA sequences or protein sequences or species or something like that."}, {"time": 3708, "text": "And I took their concept and the word landscape from theoretical biology and made a scenario about how the universe as a whole could evolve to discover the parameters of the standard model."}, {"time": 3723, "text": "And I'm happy to discuss, that's called cosmological natural selection."}, {"time": 3727, "text": "Cosmological natural selection."}, {"time": 3730, "text": "Wow, so the parameters of the standard model, so the laws of physics are changing."}, {"time": 3735, "text": "This idea would say that the laws of physics are changing in some way that echoes that of natural selection, or just it adjusts in some way towards some goal."}, {"time": 3750, "text": "And I published that, I wrote the paper in 1888 or 89, the paper was published in 92."}, {"time": 3759, "text": "My first book in 1997, The Life of the Cosmos was explicitly about that."}, {"time": 3765, "text": "And I was very clear that what was important is that because you would develop an ensemble of universes, but they were related by descent to natural selection, almost every universe would share the property that it was, its fitness was maximized to some extent, or at least close to maximum."}, {"time": 3790, "text": "And I could deduce predictions that could be tested from that."}, {"time": 3796, "text": "And I worked all of that out and I compared it to the anthropic principle where you weren't able to make tests or make falsifications."}, {"time": 3804, "text": "All of this was in the late 80s and early 90s."}, {"time": 3808, "text": "That's a really compelling notion, but how does that help you arrive?"}, {"time": 3812, "text": "I'm coming to where the book came from."}, {"time": 3817, "text": "So what got me, I worked on string theory."}, {"time": 3822, "text": "I also worked on loop quantum gravity."}, {"time": 3827, "text": "And I was one of the inventors of loop quantum gravity."}, {"time": 3830, "text": "And because of my strong belief in some other principles, which led to this notion of wanting a quantum theory of gravity to be what we call relational or background independent, I tried very hard to make string theory background independent."}, {"time": 3847, "text": "And it ended up developing a bunch of tools which then could apply directly to general relativity and that became loop quantum gravity."}, {"time": 3855, "text": "So the things were very closely related and have always been very closely related in my mind."}, {"time": 3860, "text": "The idea that there were two communities, one devoted to strings and one devoted to loops is nuts and has always been nuts."}, {"time": 3868, "text": "Okay, so anyway, there's this nuts community of loops and strings that are all beautiful and compelling and mathematically speaking."}, {"time": 3877, "text": "And what's the trouble with all that?"}, {"time": 3878, "text": "Why is that such a problem?"}]}]