[{"title": "Ariel Ekblaw: Space Colonization and Self-Assembling Space Megastructures | Lex Fridman Podcast #271", "id": "KW8Vjs84Fxg", "quotes": [{"time": 363, "text": "And that what led me to self assembly and other models of in space construction."}, {"time": 368, "text": "Okay, every time you speak, I get like a million tangent ideas."}, {"time": 372, "text": "You can cut me off."}, {"time": 373, "text": "No, no, no, no, no, no, please keep talking."}, {"time": 376, "text": "I just, there's like a million of ideas."}, {"time": 379, "text": "So one sort of on the dark side, let me ask, do you think about the threats to human civilization that kind of motivate the scaling of the expansion of humans in space and on other planets?"}, {"time": 392, "text": "Nuclear war, pandemics, super intelligent, artificial intelligence systems, more not existential crises, but ones that have significant, potentially significant detrimental effects on society, like climate change, those kinds of things."}, {"time": 411, "text": "And then there's of course the fun S story coming out from the darkness and hitting all earth."}, {"time": 415, "text": "There's been a few movies on that."}, {"time": 417, "text": "Anyway, is there something that you think about that threatens us in this century?"}, {"time": 423, "text": "I mean, as an ex military family, we used to talk about all of this."}, {"time": 426, "text": "We would say that luck favors the prepared."}, {"time": 428, "text": "And so growing up, we had a plan, actually a family plan for what we would do in a pandemic."}, {"time": 434, "text": "Didn't think we were gonna have to put that and plan into place and here we are."}, {"time": 437, "text": "We do, certainly among my own family and my friends and then our work at MIT, we do think about existential threats and risks to humanity and what role does space exploration and getting humans off world have to play in a resilient future for humanity."}, {"time": 452, "text": "But what I actually find more compelling recently is instead of thinking about a need to ever abandon earth through a path of space exploration or space foraging is to see how we can use space technology to keep earth livable."}, {"time": 467, "text": "The obvious direct ways of doing this would be, satellite technology that's helping us learn more about climate change or emitters or CO2."}, {"time": 476, "text": "But there's also a future for geo engineering that might be space based."}, {"time": 479, "text": "A lot of questions that would have to be answered around that, but these are examples of pivoting our focus away from maybe the Hollywood vision of, oh, an asteroid's gonna come, we're all gonna have to escape earth to let's use our considerable technology prowess and use space technology to save earth and be very much focused on how we can have a worthwhile life for earth citizens."}, {"time": 500, "text": "Even if some of us wanna go out and further venturing."}, {"time": 504, "text": "Right, just the desire to explore the mysterious, yes."}, {"time": 508, "text": "But also it does seem that by placing us in harsh conditions, the harsh conditions of space, the harsh conditions of planets, and the biology, the chemistry, the engineering, the robotics, the materials, all of that, that's just a nice way to come up with cool new things."}, {"time": 523, "text": "Great forcing function, yeah."}, {"time": 525, "text": "Yeah, exactly, it's a forcing function like survival."}, {"time": 528, "text": "You don't get this right, you die."}, {"time": 530, "text": "So, and that you can bring back to earth and it will improve, like figuring out food in space will make you figure out how to eat, live healthier lives here on earth."}, {"time": 544, "text": "So true, I mean, some of the technologies that we're directly looking at right now for space habitats, it's hard to keep humans alive in this really fragile little pocket against the vacuum and all of the dangers that the space environment presents."}, {"time": 559, "text": "Some of the technologies we are gonna have to figure out is energy efficient cooling and air conditioning, air filtration, scrubbing CO2 from the air, being able to have habitats that are themselves resilient to extremes of space weather and radiation."}, {"time": 576, "text": "And some of these are direct translational opportunities for areas turned by natural disasters."}, {"time": 581, "text": "People in California a decade ago would never have had to think about having an airtight house."}, {"time": 585, "text": "But now with wildfires, maybe you do want something close to an airtight house, how do you manage that?"}, {"time": 591, "text": "There's a lot of technologies from the space habitation world that we are hoping we can actually bring back down to benefit life on earth as well in these extreme environment contexts."}, {"time": 601, "text": "Okay, so you mentioned to go back to swarm."}, {"time": 606, "text": "So that was interesting to you, first of all, in your own work, but also I believe you said something that was inspiring from Niel Stevenson as well."}, {"time": 614, "text": "So when you say swarm, are you thinking about architectures or are you thinking about artificial intelligence like robotics or are those kind of intermixed?"}, {"time": 628, "text": "I think the future that we're seeing is that they're going to be intermixed, which is really exciting."}, {"time": 633, "text": "So the future of space habitats are one of intelligent structures, maybe not all the way to Hal and the 2001 Space Odyssey reference that scares people about the habitat having a mind of its own."}, {"time": 645, "text": "But certainly we're building systems now where the habitat has sensing technology that allows it to communicate its basic functions, maintaining life support for the astronauts, but could also communicate in symbiosis with these swarm robots that would be on the outside of the spacecraft, whether it's in a microgravity orbiting environment or on the surface."}, {"time": 669, "text": "And these little robots, they crawl just a la Niel Stevenson in seven eves, they crawl along the outside of the spacecraft looking for micrometeorite punctures or gas leaks or other faults and defects."}, {"time": 681, "text": "And right now we're just working on the diagnosis."}, {"time": 684, "text": "So can the swarm with its collective intelligence act in symbiosis with the spacecraft and detect things?"}, {"time": 690, "text": "But in the future we'd also love for these little micro robots to repair in situ and really be like ants living in a tree altogether connected to the spacecraft."}, {"time": 699, "text": "Do you envision the system to be fully distributed and just like an ant colony, if one of them is damaged or whatever, loses control and all those kinds of things that doesn't affect the performance of the complete system or doesn't need to be centralized?"}, {"time": 718, "text": "This is more like almost like a technical question."}, {"time": 721, "text": "Do you think we can?"}, {"time": 721, "text": "Good architecture question."}, {"time": 723, "text": "Right, from the ground up, it's so scary to go fully distributed."}, {"time": 730, "text": "But it's also exceptionally powerful, right?"}, {"time": 732, "text": "Robust, resilient to the harsh conditions of space."}, {"time": 735, "text": "What do you, if you look into the next 10, 20, 100 years, starting from scratch, do you think we should be doing architecture wise distributed systems?"}, {"time": 748, "text": "For space, yes, because it gives you this redundancy and safety profile that's really critical."}, {"time": 779, "text": "There's another idea out of Neal Stephenson's Seven Eves actually where these arclets, which were decentralized spacecraft that could form and dock little temporary space stations with each other and then separate and go off on their way and have a decentralized approach to living in space."}, {"time": 795, "text": "So the self assembly component of that too, so this is your PhD work and beyond, you explored autonomously self assembling space architecture for future space, tourists, habitats, and space stations in orbit around Earth, Moon, and Mars."}, {"time": 811, "text": "There's few things I personally find sexier than autonomously self assembling space architecture."}, {"time": 820, "text": "In general, it doesn't even need to be space."}, {"time": 822, "text": "The idea of self assembling architectures is really interesting, like building a bridge or something like that through self assembling materials."}, {"time": 831, "text": "It feels like an incredibly efficient way to do it because optimization is built in."}, {"time": 839, "text": "So you can build the most optimal structures given dynamic, uncertain, changing conditions."}, {"time": 849, "text": "So maybe can you talk about your PhD work, about this work, about Tesserae, what is it in general?"}, {"time": 857, "text": "Any cool stuff, because this is super cool."}, {"time": 861, "text": "So Tesserae is my PhD research."}, {"time": 863, "text": "It's this idea that we could take tiles that construct a large structure like a bucky ball."}, {"time": 870, "text": "Yeah, this is exactly what we're looking at here, which is the tiles that are packed flat in a rocket."}, {"time": 874, "text": "They're released to float in microgravity."}, {"time": 878, "text": "Magnets, pretty powerful, electropermanent magnets on their edges draw them together for autonomous docking."}, {"time": 884, "text": "So there's no human in the loop here, and there's no central agent coordinating saying tile one, go to tile two."}, {"time": 890, "text": "It's completely decentralized system."}, {"time": 892, "text": "They find each other on their own."}, {"time": 894, "text": "What we don't show in this video is what happens if there's an error, right?"}, {"time": 898, "text": "So what happens if they bond incorrectly?"}, {"time": 900, "text": "The tiles have sensing, so proximity sensing, magnetometer, other sensors that allow them to detect a good bond versus a bad bond and pulse off and self correct, which anybody who works in the field of self assembly will tell you that error detection and correction, just like error detection in a DNA sequence or protein folding is really important part of the system for that robustness."}, {"time": 923, "text": "And so we've done a lot of work to engineer that ability for the tiles to be self determining."}, {"time": 929, "text": "They know whether they're forming the structure that they're supposed to form or not."}, {"time": 932, "text": "They know if they're in a toxic relationship and they need to get out."}, {"time": 935, "text": "Right, right, if they need to separate, exactly, yeah."}, {"time": 938, "text": "All right, this is like so amazing."}, {"time": 940, "text": "And for people who are just listening to this, yeah, there's, I mean, how large are these tiles?"}, {"time": 945, "text": "So the size that we use in the lab, they can really be any size because we can scale them down to do testing in microgravity."}, {"time": 951, "text": "So we sent tiles that were about three inches wide to the International Space Station a couple years ago to test the code, test the state machine, test the algorithm of self assembly."}, {"time": 962, "text": "But now we're actually building our first ever human scale tiles."}, {"time": 965, "text": "They're me human size."}, {"time": 966, "text": "So a little smaller than maybe your average human, but they're 2.5 feet on edge length."}, {"time": 973, "text": "The larger scale that we would love to build in the future would actually be tiles that are big enough to form a bucky ball, big open spherical volume, spherical approximation volume, that'd be about 10 meters in diameter."}, {"time": 985, "text": "So 30 feet, which is much bigger and grander in terms of open space than any current module on the ISS."}, {"time": 992, "text": "And one of the goals of this project was to say, what's the purpose of next generation space architecture?"}, {"time": 998, "text": "Should it be something that really inspires and delights people when you float into that space?"}, {"time": 1004, "text": "Can you get goosebumps in the way that you do when you walk into a really stunning piece of architecture on earth?"}, {"time": 1010, "text": "And so we think that self assembly, this modular reconfigurable algorithm for constructing space structures in orbit is gonna give us this promise of space architecture that's actually worth living in."}, {"time": 1023, "text": "Living in, oh, I thought you also meant from like outside artistic perspective, when you see the whole thing is just."}, {"time": 1029, "text": "With the aesthetics of it, absolutely."}, {"time": 1031, "text": "You know, when you like go like into Vegas, whenever you go into a city and it like over the hill appears in front of you."}, {"time": 1039, "text": "And I mean, there's something majestic about seeing like, wow, humans created that."}, {"time": 1045, "text": "It gives you like hope about like, if these a bunch of ants were able to figure out how to build skyscrapers that light up."}, {"time": 1051, "text": "And in general, the design of these tiles in the way you envision it are pretty scalable."}, {"time": 1056, "text": "Yes, and they're inspired by exactly what you mentioned a moment ago, which is we have these patterns of self assembly on earth."}, {"time": 1062, "text": "And there's a lot of fantastic MIT research that we're building this concept on."}, {"time": 1066, "text": "So like Daniela Ruse at CSAIL and Pebbles, taking the power of magnets to create units that are themselves interchangeable, this notion of programmable matter."}, {"time": 1078, "text": "And so we're interested in going really big with it to build big scale space structures with programmable tiles."}, {"time": 1085, "text": "But there's also a really fascinating, you know, end of that on the other side of the spectrum, which is how small can you go with matter that's programmable and stacks and builds itself and creates a bridge or something in the future."}, {"time": 1096, "text": "What do you envision the thing would look like?"}, {"time": 1099, "text": "Like when you imagine a thing far into the future where there's, so we're not even thinking about like small space, well, let's not call them small, but our currently sized space stations, but like something gigantic, what do you envision?"}, {"time": 1114, "text": "Is this something with symmetry or is this something we can't even come up with yet?"}, {"time": 1118, "text": "Is there beautiful structures that you imagine in your mind?"}, {"time": 1122, "text": "I've got three candidates that I would love to build."}, {"time": 1125, "text": "If we're talking about monumental space architecture, one is what does a space cathedral look like?"}, {"time": 1131, "text": "It can be a secular cathedral, doesn't necessarily have to be about religion, but that notion of long sight lines, inspiring, stunning architecture when you go in."}, {"time": 1141, "text": "And you can imagine floating instead of, you know, being on the ground and only looking up in space, you could be in a central node and each direction you look at, all the cardinal directions are spires going off in a really large and long way."}, {"time": 1155, "text": "So that's concept number one."}, {"time": 1157, "text": "Number two would be something more organic that's not just geometric."}, {"time": 1189, "text": "So this is the same way that muscles accrete to appear, you can have these nodes that dock together and one shape that I would love to form out of this is something like a nautilus, a seashell, that beautiful, you know, fibonacci spiral sequence that you get in that shape, which I think would be a stunning and fabulous aggregated space station."}, {"time": 1210, "text": "You said so many cool words, plesiohedron."}, {"time": 1214, "text": "Yeah, plesiohedron."}, {"time": 1215, "text": "So that's a space filling."}, {"time": 1218, "text": "Solid, the simplest thing to think of is like a cube."}, {"time": 1220, "text": "Oh, cube."}, {"time": 1220, "text": "A cube, right?"}, {"time": 1221, "text": "So you can stack cubes together and if you had an infinite number of cubes, you'd fill all that space, there's no gaps in between the cubes, they stack and fill space."}, {"time": 1231, "text": "Another plesiohedron is a truncated octahedron and that's actually one of the candidate structures that we think would be great for space stations."}, {"time": 1238, "text": "What's the truncated part?"}, {"time": 1240, "text": "Ah, so you cut off, an octahedron actually has little pointy areas, you truncate certain sections of it and you get surfaces that are on the structure that are cubes and I think hexagons, I have to remind myself exactly what the faces are."}, {"time": 1255, "text": "But overall, a truncated octahedron can be bonded to other truncated octahedrons and just like a cube, it fills all the gaps as you build it out."}, {"time": 1264, "text": "So you can imagine two truncated octahedrons, they come together at an airlock, which is what we space people call doors in space and you dock them on all sides and you've basically created this decentralized network of space nodes that make a big space station and once you have enough of them and you're growing with enough big units, you can do it in any macro shape you want."}, {"time": 1288, "text": "That's where the Nautilus comes in, is could we design an organically inspired shape for a space station?"}, {"time": 1294, "text": "Can I just say how awesome it is to hear you say, we space people."}, {"time": 1298, "text": "I know you meant people that are doing research on space exploration, space technology, but it also made me think of a future."}, {"time": 1305, "text": "There's earth people and there's those space people."}, {"time": 1310, "text": "And then there's the Mars people."}, {"time": 1311, "text": "I'd love to unite those too."}, {"time": 1312, "text": "Yeah, no, no, for sure, for sure."}, {"time": 1314, "text": "But like, it's like New Yorkers and like Texans or something like that."}, {"time": 1320, "text": "Yeah, of course you live for a time in New York and then you go up to Boston but for a time you're the space people."}, {"time": 1327, "text": "Oh, I know those space people."}, {"time": 1329, "text": "They're kind of wild up there."}, {"time": 1331, "text": "We'll see how that dynamic evolves."}, {"time": 1333, "text": "There's that culture, culture forms."}, {"time": 1334, "text": "And I would love to see what kind of culture, once you have sort of more and more civilians."}, {"time": 1341, "text": "I mean, there's a human, I mean, I love psychology and sociology and I'll maybe ask you about that too, which is like the dynamic between humans."}, {"time": 1349, "text": "You have to kind of start considering that and you start spending more and more time up in space and start sending civilians, start sending bigger and bigger groups of people."}, {"time": 1359, "text": "And then of course the beautiful and the ugly emerges from the human nature that we haven't been able to escape up to this point."}, {"time": 1369, "text": "But when you say the plesiohedrons, these kinds of shapes, are they multifunctional?"}, {"time": 1374, "text": "Like is the idea you'd be able to, humans can occupy them safely in some of them and some others have some other purposes?"}, {"time": 1385, "text": "One could be sleeping quarters."}, {"time": 1387, "text": "One could be a greenhouse or an agricultural unit."}, {"time": 1390, "text": "One could be a storage depot."}, {"time": 1393, "text": "Essentially all of the different rooms or functions that you might need in a space station could be subdivided into these nodes and then stacked together."}, {"time": 1402, "text": "And one of the promises of both Tesseray, my original PhD research, which is these shells, and then this follow on node concept, is that right now we build space stations and once they're built, they're done."}, {"time": 1413, "text": "You can't really change them profoundly."}, {"time": 1416, "text": "But the benefit of a modular self assembling system is you can disassemble it."}, {"time": 1420, "text": "You can completely reconfigure it."}, {"time": 1422, "text": "So if your mission changes or the number of people in space that you wanna host, if you have a space conference happening like South by Southwest."}, {"time": 1428, "text": "I was thinking space party, but space conference is good too."}, {"time": 1432, "text": "Then maybe all of a sudden you want to change out what were window tiles yesterday, cupola tiles, and make them into a birthing port so that you can welcome five new spaceships to come and join you in space."}, {"time": 1444, "text": "That's what this promise of reconfigurable space architecture might allow us to explore."}, {"time": 1449, "text": "I've been hanging out with Grimes recently and I just feel like she belongs up in space."}, {"time": 1453, "text": "This is like designed for artists essentially."}, {"time": 1455, "text": "Like imagine, I mean, this is what South by keeps introducing me to is there's like the weird and the beautiful people and like the artists."}, {"time": 1463, "text": "And it feels like there's a lot of opportunities for art and design."}, {"time": 1469, "text": "It's like space is a combination of arts, design, and great engineering."}, {"time": 1476, "text": "It's safety critical with like the highest of stakes."}, {"time": 1479, "text": "So don't, you can't mess it up."}, {"time": 1481, "text": "And is this, is there, first of all, you're talking about tiling."}, {"time": 1484, "text": "So Neil Stephenson is obsessed about tile."}, {"time": 1486, "text": "I don't know if it's related to any of this, but he seems to be obsessed with like, how do you tile a space?"}, {"time": 1491, "text": "That's like a mathematical, geometric notion."}, {"time": 1494, "text": "Like the tessellation."}, {"time": 1495, "text": "And it's, I mean, it's a beautiful idea for architecture that you can self assemble these different shapes and you can have probably some centralized guidance of the kind of thing you want to build."}, {"time": 1509, "text": "But they also kind of figure stuff out themselves in terms of the low level details, in terms of the figuring out when the, when everything fits just right for the OCD people, like what's that subreddit?"}, {"time": 1523, "text": "Pleasantly, it's like really fun."}, {"time": 1525, "text": "Everything, they have like videos of everything is just pleasant when everything just fits perfectly."}, {"time": 1529, "text": "Very pleasing."}, {"time": 1530, "text": "All the tolerances come together well, yeah."}, {"time": 1532, "text": "So they figure that out on themselves and the local robotics problem."}, {"time": 1536, "text": "But by the way, what's the Pebbles Project?"}, {"time": 1539, "text": "The Pebbles Project are little cubes that have EPMs in them, electropermanent magnets, and they can self disassemble."}, {"time": 1546, "text": "So they'll turn off."}, {"time": 1547, "text": "And so you'll have this little structure that all of a sudden can flip the little pebbles over and essentially just disaggregate."}, {"time": 1554, "text": "They have to make some pleasing sounds."}, {"time": 1557, "text": "And that's gonna, so I'm supposed to talk to Danielle, so I'll probably spend an hour just discussing the sounds on the pebbles."}, {"time": 1564, "text": "Okay, what were we talking about?"}, {"time": 1567, "text": "So that's, because you mentioned two, I think."}, {"time": 1570, "text": "Right, my third one."}, {"time": 1572, "text": "Yeah, is there a third one?"}, {"time": 1573, "text": "My third one is The Ringworld, just because every science fiction book ever that's worth anything has A Ringworld in it."}, {"time": 1579, "text": "Is it like a donut?"}, {"time": 1581, "text": "A donut, yeah, it's a really big torus that could encircle a planet or encircle another celestial body, maybe an asteroid or a small moon."}, {"time": 1592, "text": "And the promise here is just the beauty of being able to have that geometry in orbit and all that surface area for solar panels and docking and essentially just all of what that enables to have a ring world at that scale in orbit."}, {"time": 1608, "text": "By the way, for the viewers, we're looking at Figure 11."}, {"time": 1611, "text": "What paper is this from?"}, {"time": 1612, "text": "This is a hexagonal tiling of a torus generated in Mathematica referencing code and approach from two citations."}, {"time": 1621, "text": "So we're looking at a tiled donut, and I'm now hungry."}, {"time": 1624, "text": "So this is the, is this from your thesis or no?"}, {"time": 1626, "text": "This is probably, I mean, this is in my thesis."}, {"time": 1628, "text": "This looks like it was one of my earlier papers."}, {"time": 1630, "text": "This was an approach to say, great, we've come up with this tessellation approach for a buckyball, and we picked the buckyball because it is the most efficient surface area to volume shape and what's expensive in space, the surface area shipping up all that material."}, {"time": 1646, "text": "So we wanted something that would maximize the volume."}, {"time": 1648, "text": "But if we think about ring worlds and other shapes, we wanted to look at how do you tile a torus?"}, {"time": 1654, "text": "And this is one example with hexagons to be able to say, could we take this same tesserae approach of self assembling tiles and create other geometries?"}, {"time": 1662, "text": "This is so freaking cool."}, {"time": 1664, "text": "So you mentioned microgravity, and I saw, I believe that there's a picture of you floating in microgravity."}, {"time": 1672, "text": "When did you get to experience that?"}, {"time": 1674, "text": "Ah, so I've flown nine times on the affectionately known as the Vomit Comet."}, {"time": 1679, "text": "It's the parabolic flight, and essentially, it does what you'd want a plane never to do."}, {"time": 1684, "text": "It pitches really steeply upwards at 45 degrees."}, {"time": 1687, "text": "Oh, that's a picture of you."}, {"time": 1687, "text": "Yeah, yeah, that's tesserae."}, {"time": 1689, "text": "That's super early in my PhD, some of just the passive tiles before we even put electronics in."}, {"time": 1694, "text": "We were just testing the magnet polarity and the, essentially, is it an energy favorable structure to self assemble on its own?"}, {"time": 1702, "text": "So we tweaked a lot of things between."}, {"time": 1703, "text": "Are we looking at a couple of them?"}, {"time": 1705, "text": "Yeah, you're looking at a bunch of them there."}, {"time": 1707, "text": "Oh, oh, I see."}, {"time": 1708, "text": "Almost 32 of them, yeah."}, {"time": 1710, "text": "They're clumping, they're clumping, yeah."}, {"time": 1711, "text": "Can you comment on what's the difference between microgravity and zero gravity?"}, {"time": 1715, "text": "Yes, so there is, is that an important difference?"}, {"time": 1717, "text": "It's an important difference."}, {"time": 1718, "text": "There is no zero gravity."}, {"time": 1721, "text": "There's no nothing, there's, in the universe, there is no such thing as zero gravity."}, {"time": 1726, "text": "So Newton's law of gravity tells us that there's always gravity attraction between any two objects."}, {"time": 1731, "text": "So zero G is a shorthand that some of us fall into using, where it's a little easier to communicate to the public."}, {"time": 1736, "text": "The accurate term is microgravity, where you are essentially floating, you're weightless, but generally in free fall."}, {"time": 1744, "text": "So on the parabolic flights, the vomit comet, you're in free fall at the end of the parabola."}, {"time": 1749, "text": "And in orbit around the Earth when you're floating, you're also in free fall."}, {"time": 1754, "text": "So that's microgravity."}, {"time": 1755, "text": "So affectionately called vomit comet, I'm sure there's a reason why it's called affectionately."}, {"time": 1759, "text": "So what's it like?"}, {"time": 1761, "text": "What's your first time?"}, {"time": 1763, "text": "So both philosophically, spiritually, and biologically, what's it like?"}, {"time": 1768, "text": "It's profound."}, {"time": 1770, "text": "It is unlike anything else you will experience on Earth because it is this true feeling of weightlessness with no drag."}, {"time": 1780, "text": "So the closest experience you can think of would be floating in a pool, but you move slowly when you float in a pool and your motion is restricted."}, {"time": 1786, "text": "When you're floating, it's just you and your body flying, like in a dream."}, {"time": 1792, "text": "It takes the littlest amount of energy, like a finger tap against the wall of the plane to shoot all the way across the fuselage."}, {"time": 1798, "text": "And you can move at full speed."}, {"time": 1801, "text": "You can move your arms."}, {"time": 1803, "text": "So your muscles work."}, {"time": 1804, "text": "There's no resistance."}, {"time": 1806, "text": "They actually tell you to make a memory when you're on the plane because it's such a fleeting experience for your body that even a few days later, you've already forgotten exactly what it felt like."}, {"time": 1817, "text": "It's so foreign to the human experience."}, {"time": 1820, "text": "They kind of suggest that you explicitly try to really form this into a memory and then you can do the replay."}, {"time": 1825, "text": "Is that for training?"}, {"time": 1826, "text": "Cognitively freeze it."}, {"time": 1828, "text": "Cognitively."}, {"time": 1830, "text": "Save."}, {"time": 1831, "text": "When we have Neuralink, we can replay that memory."}, {"time": 1834, "text": "So in terms of how much stress it has on your body, is it biologically stressful?"}, {"time": 1841, "text": "You do feel a 2G pullout, right?"}, {"time": 1843, "text": "So the cost of getting those micro G parabolas is you then have a 2G pullout and that's hard."}, {"time": 1848, "text": "You have to train for it."}, {"time": 1850, "text": "If you move your neck too quickly in that 2G pullout, you can strain muscles."}, {"time": 1854, "text": "But I wouldn't say that it's actually a profound tough thing on the body."}, {"time": 1860, "text": "It's really just an incredibly novel experience."}, {"time": 1862, "text": "And when you're in orbit and you're not having to go through the ups and downs of the parabolic plane, there's a real grace and elegance."}, {"time": 1869, "text": "And you see the astronauts learn to operate in this completely new environment."}, {"time": 1874, "text": "What are some interesting differences between the parabolic plane and when you're actually going up into orbit?"}, {"time": 1880, "text": "Is it that with orbit you can look out and see that blue little planet of ours?"}, {"time": 1886, "text": "You can see the blue marble, the stunning overview effect, which is something I hope to see one day."}, {"time": 1891, "text": "What's also really different is if you're in orbit for any significant period of time, there's gonna be a lot more physiological changes to your body than if you just did an afternoon flight on the Vomit Comet."}, {"time": 1902, "text": "Everything from your bones, your muscles, your eyeballs change shape."}, {"time": 1907, "text": "There's a lot of different things that happen for long duration space flight."}, {"time": 1911, "text": "And we still have to, as scientists, we still have to solve a lot of these interesting challenges to be able to keep humans thriving in microgravity or deep duration space missions."}, {"time": 1921, "text": "Deep duration space missions."}, {"time": 1923, "text": "Okay, let's talk about this."}, {"time": 1925, "text": "I was just gonna ask a bunch of dumb questions."}, {"time": 1928, "text": "So approximately how long does it take to travel to Mars?"}, {"time": 1932, "text": "Asking for a friend, as we all do."}, {"time": 1934, "text": "About three years for a round trip."}, {"time": 1937, "text": "And that's not that it actually takes that long."}, {"time": 1939, "text": "Why the round trip, is that?"}, {"time": 1940, "text": "Well, you're just asking about the one way trip."}, {"time": 1943, "text": "Got it, got it, got it."}, {"time": 1945, "text": "It's okay, cool."}, {"time": 1945, "text": "So for just like literally flying to Mars in a round, it takes three years."}, {"time": 1950, "text": "There's some interstitial time there because you really can only go between Earth and Mars at certain points in their orbits where it's favorable to make that journey."}, {"time": 1959, "text": "And so part of that three years is you take the journey to Mars, a few months, six to nine months."}, {"time": 1965, "text": "You're there for a period of time until the orbits find a favorable alignment again."}, {"time": 1969, "text": "And then you come back another six to nine months."}, {"time": 1971, "text": "So one way travel, six to nine months."}, {"time": 1974, "text": "They hang out there on vacation and come back."}, {"time": 1978, "text": "You come back."}, {"time": 1978, "text": "Well, me who loves working all the time, all vacation is forced vacation."}, {"time": 1984, "text": "So okay, so that gives us a sense of duration."}, {"time": 1987, "text": "And we can maybe also talk about longer and longer and longer duration as well."}, {"time": 1993, "text": "What are the hardest aspects of living in space for many days, for let's say 100 days, 200 days?"}, {"time": 2003, "text": "Maybe there's a threshold when it gets really tough."}, {"time": 2005, "text": "What are some stupid little things or big things that are very difficult for human beings to go through?"}, {"time": 2012, "text": "It's one big thing and one little thing."}, {"time": 2013, "text": "And there are these two classic problems that we're trying to solve in the space industry."}, {"time": 2017, "text": "One is radiation."}, {"time": 2018, "text": "It's not as much of a problem for us right now on the International Space Station because we're still protected by part of Earth's magnetosphere."}, {"time": 2026, "text": "But as soon as you get farther out into space and you don't have that protection once you leave the Van Allen belt area of the Earth and the cocoon around the Earth, we have really serious concerns about radiation and the effect on human health longterm."}, {"time": 2039, "text": "That's the big one."}, {"time": 2041, "text": "The small one, and I say it's small because it seems mundane, but it actually is really big in its own way, is mental health and how to keep people happy and balanced."}, {"time": 2049, "text": "And you were alluding to some of the psychological challenges of having humans together on missions and especially as we try to scale the number of humans in orbit or in space."}, {"time": 2058, "text": "So that's another big challenge is how to keep people happy and balanced and cooperating."}, {"time": 2064, "text": "That's not an issue on Earth at all."}, {"time": 2067, "text": "Okay, so we'll talk about each of those in a bit more detail, but let me continue on the chain of dumb questions."}, {"time": 2075, "text": "What's a good source for food in space?"}, {"time": 2078, "text": "And what are some sort of standard go to meals, menus?"}, {"time": 2082, "text": "Right now your go to menu is gonna be mostly freeze dried."}, {"time": 2086, "text": "Every so often NASA will arrange for a fun stunt or fresh food to get up to station."}, {"time": 2091, "text": "So they did bake DoubleTree cookies with Hilton a couple of years ago, as I recall, I think sometime before the pandemic."}, {"time": 2097, "text": "But there's work actually in our lab at MIT, Maggie Koblans, one of my staff researchers is looking at the future of fermentation."}, {"time": 2104, "text": "Everybody loves beer, right?"}, {"time": 2106, "text": "Beer and wine and kimchi and miso, these foods that have just been really important to human cultures for eons because we love the umami and the better flavor in them."}, {"time": 2116, "text": "But it turns out they also have a good shelf life if done properly."}, {"time": 2119, "text": "And they also have a additional health benefit for the microbiome, for probiotics and prebiotics."}, {"time": 2125, "text": "So we're trying to work with NASA and convince them to be more open minded to fermented food for long duration deep space missions."}, {"time": 2133, "text": "That we think is one of the future elements in addition to in situ growing your own food."}, {"time": 2138, "text": "Okay, this is essential for the space party is the space beer."}, {"time": 2143, "text": "Yes, it's the fermented product, yes."}, {"time": 2146, "text": "In terms of water, what's a good source of drinkable water?"}, {"time": 2149, "text": "Like where do you get water?"}, {"time": 2150, "text": "Do you have to always bring it on board with you?"}, {"time": 2152, "text": "And is there a compressed efficient way of storing it?"}, {"time": 2156, "text": "So to steal a line from Charlie Bolden, who's the former administrator of NASA, this morning's fresh water is yesterday's coffee."}, {"time": 2164, "text": "So if you think about what that means, you drank the coffee yesterday."}, {"time": 2168, "text": "Right, as it travels, it goes fully through the body."}, {"time": 2170, "text": "Fully through the body as the recycling system."}, {"time": 2173, "text": "And then you drink what you peed out as clarified, refined fresh water the next day."}, {"time": 2180, "text": "That is one source of water."}, {"time": 2182, "text": "Another source of water in the near neighborhood of our solar system would be on the moon."}, {"time": 2186, "text": "So water ice deposits, there's also water on Mars."}, {"time": 2189, "text": "This is one of the big things that's bringing people to want to develop infrastructure on the moon is once you've gotten out of the gravity well of Earth, if you can find water on the moon and refine it, you can either make it into propellant or drinkable water for humans."}, {"time": 2203, "text": "And so that's really valuable as a potential gateway out into the rest of the solar system to be able to get propellant without always having to ship it up from Earth."}, {"time": 2212, "text": "So how much water is there on Mars?"}, {"time": 2216, "text": "I do not know."}, {"time": 2216, "text": "We don't know this yet, right?"}, {"time": 2217, "text": "I know there's water at the caps."}, {"time": 2218, "text": "I suspect NASA from all of the satellite studies that they've done at Mars have a decent idea of what the water deposits look like, but I don't know to what degree they have characterized those."}, {"time": 2230, "text": "I really hope there's life or traces of previous life on Mars."}, {"time": 2235, "text": "This is a special spot in my heart because I got to work on SHERLOC, which is the astrobiology experiment that's on Mars right now, searching for what they would say in a very cautious way is signs of past habitability."}, {"time": 2250, "text": "They wanna be careful not to get people overly excited and say we're searching for signs of life."}, {"time": 2254, "text": "They're searching to see if there would have been organics on the surface of Mars or water in certain areas that would have allowed for life to flourish."}, {"time": 2262, "text": "And I really love this prospect."}, {"time": 2264, "text": "I do think within our lifetimes we'll get a better answer about finding life in our solar system if it's there."}, {"time": 2271, "text": "If not on Mars, maybe Europa, one of the icy worlds."}, {"time": 2274, "text": "So you like astrobiology."}, {"time": 2279, "text": "This is part of the, it's not just about human biology."}, {"time": 2282, "text": "It's also other extraterrestrial alien biology."}, {"time": 2285, "text": "Search for life in the universe."}, {"time": 2288, "text": "Does that scare you or excite you?"}, {"time": 2289, "text": "It excites me, profoundly excites me."}, {"time": 2291, "text": "That there's other alien civilizations potentially very different than our own?"}, {"time": 2296, "text": "I think there's gotta be some humility there."}, {"time": 2298, "text": "And certainly from science fiction we have plenty of reasons to fear that outcome as well."}, {"time": 2302, "text": "But I do think as a scientist it would be profoundly exciting if we were to find life especially in the near neighborhood of our solar system."}, {"time": 2309, "text": "Right now we would expect it to be most likely microbial life but we have a real serious challenge in astrobiology which is it may not even be carbon based life."}, {"time": 2317, "text": "And all of our detectors, we only know to look for DNA or RNA."}, {"time": 2322, "text": "How would you even build a detector to look for silicon based life or different molecules than what we know to be the fundamental molecules for life?"}, {"time": 2331, "text": "And then you mentioned offline Sarah Walker."}, {"time": 2333, "text": "I mean she, her, the question that she's obsessed with is even just defining life."}, {"time": 2338, "text": "What is life?"}, {"time": 2339, "text": "To look outside the carbon base."}, {"time": 2342, "text": "I mean to look outside of basically anything we can even imagine chemically."}, {"time": 2346, "text": "To look outside of any kind of notions that we think of as biology."}, {"time": 2350, "text": "Yeah, it's really weird."}, {"time": 2351, "text": "So you now get into this land of like complexity of a measuring of like how many assembly steps it takes to build that thing."}, {"time": 2363, "text": "And maybe dynamic movement or some maintenance of some kind of membrane structures."}, {"time": 2369, "text": "We don't even know like which properties life should have."}, {"time": 2374, "text": "Whether it should be able to reproduce and all those kinds of things or pass information, genetic type of information."}, {"time": 2382, "text": "And it's like, it's so humbling."}, {"time": 2385, "text": "I mean I tend to believe that there could be something like alien life here on Earth and we're just too human, biology obsessed to even recognize it."}, {"time": 2395, "text": "The shadow biosphere, I remember you and Sarah were talking about."}, {"time": 2398, "text": "I mean that's like, speaking of beer, I mean that's something I wanted to make sure in all of science to shake ourselves out of like, remind ourselves constantly how little we know."}, {"time": 2410, "text": "Because it might be right in front of our nose."}, {"time": 2413, "text": "Like I wouldn't be surprised if like trees are like orders of magnitude more intelligent than humans."}, {"time": 2418, "text": "They're just operating at a much slower scale and they're like talking shit about us the whole time."}, {"time": 2423, "text": "Like about silly humans that take everything seriously and we start all kinds of nuclear wars and we quarrel and we tweet about it and then, but the trees are always there just watching us silly humans."}, {"time": 2435, "text": "Like the Ents in Lord of the Rings."}, {"time": 2437, "text": "So I mean, I don't know, I mean, obviously I'm joking on that one, but there could be stuff like that."}, {"time": 2444, "text": "Well, let me ask you the Drake equation, the big question, how many, like obviously nobody knows, but what's your gut, what's your hope as a scientist, as a human, how many alien civilizations are out there?"}, {"time": 2458, "text": "As a ex physicist, I'm now much more on the aerospace engineering side for space architecture, but as an ex physicist, I hope it is prolific."}, {"time": 2468, "text": "I think the challenge is if it's as prolific as we would hope, if there are many, many, many civilizations, then the question is, where are they?"}, {"time": 2476, "text": "Why haven't we heard from them?"}, {"time": 2478, "text": "And the Fermi paradox, is there some great filter that life only gets to some level of sophistication and then kills itself off through war or through famine or through different challenges that filter that society out of existence?"}, {"time": 2493, "text": "And it would be an interesting question to try to understand if the universe was teeming with life, why haven't we found it or heard from it yet, to our knowledge?"}, {"time": 2501, "text": "Yeah, I personally believe that it's teeming with life, and you're right, I think that's a really useful, productive engineering scientific question of what kind of great filter can just be destroying all of that life or preventing it from just constantly talking to us, silly descendants of apes."}, {"time": 2521, "text": "That's a really nice question, like what are the ways civilizations can destroy themselves?"}, {"time": 2529, "text": "There's too many, sadly."}, {"time": 2530, "text": "Well, I don't think we've come up with most of them yet."}, {"time": 2533, "text": "That's also probably true."}, {"time": 2594, "text": "Gets complicated quickly."}, {"time": 2597, "text": "Okay, anyway, back to the dumb questions, because you answered this, there's an interview where you answer a bunch of cool little questions from young students and so on, about like space."}, {"time": 2609, "text": "One of them was playing music in space."}, {"time": 2613, "text": "And you mentioned something about what kind of instruments you could use to play music in space."}, {"time": 2619, "text": "Could you mention about like the Spotify work in space, and if I wanted to do a live performance, what kind of instruments would I need?"}, {"time": 2627, "text": "Yeah, I mean, you referenced culture before, and I think this is one of the most exciting things that we have at our fingertips, which is to define a new culture for space exploration."}, {"time": 2637, "text": "We don't just have to import cultural artifacts from Earth to make life worth living in space, and this musical instrument that you referenced was a design of an object that could only be performed in microgravity."}, {"time": 2650, "text": "So it doesn't sound the same way when it's, it's a percussive instrument when it's rattled or moved in a gravity environment, it is unique."}, {"time": 2657, "text": "Can we look it up?"}, {"time": 2658, "text": "It's called the Telematron."}, {"time": 2659, "text": "Yeah, it's created by."}, {"time": 2660, "text": "Of course it's called the Telematron."}, {"time": 2661, "text": "Telematron."}, {"time": 2662, "text": "That is so awesome."}, {"time": 2663, "text": "Created by Sands Fish and Nicole Boulier, two amazing graduate students and staff researchers on my team."}, {"time": 2670, "text": "It looks steampunk, actually."}, {"time": 2674, "text": "Yeah, it's a pretty cool design."}, {"time": 2675, "text": "It looks like it's a geometric solid that has these interesting artifacts on the inside, and it has a lot of sensors, actually, additionally on the inside, like IMU's inertial measurement sensors that allow it to detect when it's floating and when it's not floating, and provides this really kind of ethereal, they later sonify it."}, {"time": 2693, "text": "So they use electronic music to turn it into a symphony or turn it into a piece."}, {"time": 2697, "text": "And yeah, this is the object, the Telematron."}, {"time": 2699, "text": "How does the human interact with it?"}, {"time": 2701, "text": "By tossing it."}, {"time": 2702, "text": "So it's an interactive musical instrument."}, {"time": 2704, "text": "It actually requires another partner."}, {"time": 2706, "text": "So the idea was that it's something like a dance or just like something like a choreography in space."}, {"time": 2712, "text": "Speaking of which, you also talked about sports, and like ball sports, like playing soccer."}, {"time": 2718, "text": "So you mentioned that, so your muscles can move at full speed, and then if you push off the wall lightly, you fly across, zoom across."}, {"time": 2728, "text": "So how does the physics of that work?"}, {"time": 2731, "text": "Can you still play soccer, for example, in space?"}, {"time": 2734, "text": "You can, but one of the most intuitive things that we all learn as babies, right, is whenever you throw something, if I was gonna toss something to you, I'd toss it up, because I know that it has to compensate for the fact that that Keplerian arc is gonna draw it down, the equations of motion are gonna draw it down."}, {"time": 2750, "text": "I would, in space, I would just shoot something directly towards you, so like straight in line of sight."}, {"time": 2756, "text": "And so that would be very different for any type of ball sport, is to retrain your human mind to have that as your intuitive arc of motion or lack of arc."}, {"time": 2764, "text": "From your experience, from understanding how astronauts get adjusted to this stuff, how long does it take to adjust to the physics of this world, this other world?"}, {"time": 2772, "text": "So even after one or two parabolic flights, you can gain a certain facility with moving in that environment."}, {"time": 2780, "text": "I think most astronauts would say maybe several days on station or a week on station, and their brain flips."}, {"time": 2786, "text": "It's amazing the plasticity of the human brain and how quickly they are able to adapt."}, {"time": 2791, "text": "And so pretty quickly, they become creatures of this new environment."}, {"time": 2796, "text": "Okay, so that's cool."}, {"time": 2796, "text": "It's creating a little bit of an experience."}, {"time": 2798, "text": "What about if you go for more than 100 days for one year, for two years, for three years?"}, {"time": 2806, "text": "What challenges start to emerge in that case?"}, {"time": 2809, "text": "So Scott Kelly wrote this amazing book after he spent a year in space, and he's a twin."}, {"time": 2813, "text": "It's absolutely fantastic that NASA got to do a twin study."}, {"time": 2818, "text": "So he wrote a lot about his experience on the health side of what changed, things like bone density, muscle atrophy, eyesight changing because the shape of your eyeball changes, which changes your lens, which changes how you see."}, {"time": 2832, "text": "If we're then thinking about the challenges between a year and three years, especially if we're doing that three year trip to Mars for your friend who asked earlier, then you have to think about nutrition."}, {"time": 2843, "text": "And so how are you keeping all of these different needs for your body alive?"}, {"time": 2848, "text": "How are you protecting astronauts against radiation?"}, {"time": 2850, "text": "Either having some type of a shell on the spacecraft, which is expensive because it's heavy."}, {"time": 2855, "text": "If it's something like lead, a really effective radiation shell, it's gonna be a lot of mass."}, {"time": 2859, "text": "Or is there a pill that could be taken to try to make you less in danger of some of the radiation effects?"}, {"time": 2869, "text": "A lot of this has not yet been answered, but radiation is a really significant challenge for that three year journey."}, {"time": 2875, "text": "And what are the negative effects of radiation on the human body out in space?"}, {"time": 2879, "text": "A higher likelihood to develop cancer at a younger age."}, {"time": 2883, "text": "So you'd probably be able to get there and get back, but you'd find yourself in the same way of if you were exposed to significant radiation on Earth, you'd find significant bad health effects as you age."}, {"time": 2894, "text": "What do you think about like decades?"}, {"time": 2896, "text": "Do you think about decades?"}, {"time": 2899, "text": "Or is this like an entire?"}, {"time": 2901, "text": "I think about centuries for MySpace."}, {"time": 2903, "text": "But yeah, for decades, I think as soon as we get past the three year mark, we'll absolutely want, somewhere between three years and a decade, we'll want artificial gravity."}, {"time": 2913, "text": "And we know how to do that, actually."}, {"time": 2915, "text": "The engineering questions still need to be tweaked for how we'd really implement it, but the science is there to know how we would spin habitats in orbit and generate that force."}, {"time": 2924, "text": "So even if the entire habitat's not spinning, you at least have a treadmill part of the space station that is spinning, and you can spend some fraction of your day in a near to 1G environment and keep your body healthy."}, {"time": 2936, "text": "Wait, literally from just spinning?"}, {"time": 2938, "text": "From spinning, yes, centripetal force."}, {"time": 2940, "text": "So you generate this force."}, {"time": 2941, "text": "If you've ever been in those carnival rides, the gravitrons that spin you up around the side, that's the concept."}, {"time": 2947, "text": "And this is actually one of the reasons why we are spinning out a new company from my MIT lab."}, {"time": 2952, "text": "Spinning out, ha."}, {"time": 2954, "text": "That was accidental, but well noted space pun."}, {"time": 2958, "text": "It's like impossible to avoid."}, {"time": 2958, "text": "Dad jokes, all right."}, {"time": 2960, "text": "But yeah, we're spinning out a new company to look at next generation space architecture, and how do we actually scale humanity's access to space?"}, {"time": 2970, "text": "And one of the areas that we wanna look at is artificial gravity."}, {"time": 2974, "text": "Is there a name yet?"}, {"time": 2974, "text": "Yep, there's a name."}, {"time": 2974, "text": "We are brand new."}, {"time": 2976, "text": "We are just exiting stealth mode."}, {"time": 2978, "text": "So your podcast listeners will literally be among some of the first to hear about it."}, {"time": 2982, "text": "It's called Aurelia Institute."}, {"time": 2985, "text": "Aurelia is an old English word for chrysalis."}, {"time": 2988, "text": "And the idea with this is that we, humanity collectively, are at this next stage of our metamorphosis, like a chrysalis, into a spacefaring species."}, {"time": 2998, "text": "And so we felt that this was a good time, a necessary time, to think about next generation space architecture, but also Starfleet Academy, if you know that reference from Star Trek."}, {"time": 3012, "text": "Yes, so let me ask a silly sounding, ridiculous sounding, but probably extremely important question."}, {"time": 3019, "text": "Sex and space, including intercourse, conception, procreation, birth, like being a parent, like raising the baby."}, {"time": 3029, "text": "So basically from birth, well, from the before birth part, like the birds and the bees and stuff, and then the whole thing."}, {"time": 3037, "text": "How complicated is that?"}, {"time": 3038, "text": "I remember looking at the, thank you."}, {"time": 3043, "text": "I remember looking at this exact Wikipedia page actually, and I remember being, the Wikipedia page is sex and space, and fascinating how difficult of an engineering problem the whole thing is."}, {"time": 3053, "text": "Is that something you think about too, how to have generations of humans?"}, {"time": 3058, "text": "Self, self replicating organizations."}, {"time": 3063, "text": "Yeah, societies essentially."}, {"time": 3064, "text": "I mean, I guess with micro, like if you solve the gravity problem, you solve a lot of these problems."}, {"time": 3069, "text": "That's the hope, yeah."}, {"time": 3069, "text": "It's like the central challenge of microgravity to human reproduction."}, {"time": 3073, "text": "But we do host a workshop every year at Beyond the Cradle, which is the space event that we run at MIT."}, {"time": 3078, "text": "And we always do one on pregnancy in space, or motherhood, or raising children in space, because there are huge questions."}, {"time": 3086, "text": "There've been a few mammal studies that have looked at reproduction in space, but there are still really major questions about how does it work?"}, {"time": 3093, "text": "How does the fetus evolve in microgravity if you were pregnant in space?"}, {"time": 3097, "text": "And I think the near term answer is just gonna be, we need to be able to give humans a 1G environment for that phase of our development."}, {"time": 3105, "text": "Yeah, so there's some studies on mice in microgravity."}, {"time": 3109, "text": "And it's interesting, I think the mice, like one of them, the mice weren't able to walk, or their understanding of physics, I guess, is off or something like that."}, {"time": 3116, "text": "Yeah, the mental model when you're really young and you're kind of getting your mental model of physics, we do think that that would change kids abilities to if they were born in microgravity, their ability to have that intuition around an Earth based 1G environment might be missing, because a lot of that is really crystallized in early development, early childhood development."}, {"time": 3137, "text": "So that makes sense that they would see that in mice, yeah."}, {"time": 3140, "text": "So what about life when we choose to park our vehicles on another planet, on the moon, but let's go to Mars?"}, {"time": 3150, "text": "First of all, is that excite you, humans going to Mars, like stepping foot on Mars?"}, {"time": 3157, "text": "And when do you think it'll happen?"}, {"time": 3158, "text": "It does excite me."}, {"time": 3159, "text": "I think visionaries like Elon are working to make that happen in terms of building the road to space."}, {"time": 3165, "text": "We are really excited about building out the human lived experience of space once you get there."}, {"time": 3171, "text": "So how are you going to grow your food?"}, {"time": 3173, "text": "What is your habitat going to look like?"}, {"time": 3175, "text": "I think it's profoundly exciting, but I do think that there's a little bit of a misunderstanding of Mars anywhere in the near future being anything like a replacement for Earth."}, {"time": 3184, "text": "So it is good for humanity to have these other pockets of our civilization that can expand out beyond Earth, but Mars is not in its current state, a good home for humanity."}, {"time": 3195, "text": "Too many perchlorates in the soil, you can't use that soil to grow crops."}, {"time": 3199, "text": "Atmosphere is too thin, certainly can't breathe it, but it's also just really thin compared to our atmosphere."}, {"time": 3205, "text": "A lot of different challenges that would have to be fundamentally changed on that planet to make it a good home for a large human civilization."}, {"time": 3213, "text": "How does a large civilization of humans get built on Mars?"}, {"time": 3217, "text": "And where do you think it starts being difficult?"}, {"time": 3222, "text": "So can you have a small base of like 10 people, essentially, kind of like the International Space Station kind of situation, and then can you get it to 100, to 1,000, to a million?"}, {"time": 3233, "text": "Are there some interesting challenges there that worry you, saying that Mars is just not a good backup at this time for Earth?"}, {"time": 3240, "text": "I think small outposts, absolutely, like McMurdo, right?"}, {"time": 3244, "text": "So we have these models of really extreme environments on Earth in Antarctica, for example, where humans have been able to go and make a sustainable settlement."}, {"time": 3253, "text": "McMurdo style life on Mars, probably feasible in the 2030s."}, {"time": 3258, "text": "So we want to send the first human missions to Mars and maybe as early as the end of this decade, more likely early 2030s."}, {"time": 3264, "text": "Moving anywhere beyond that in terms of a place where like an entire human life would be lived, where it's not just you go for a three month deployment and you come back, that is actually the big challenge line, is just saying, is there enough technological sophistication that can be brought that far out into space?"}, {"time": 3284, "text": "If you imagine your electronics break, there's no RadioShack, this dates me a little bit that my mind jumps to RadioShack, but there's no supply chains on Mars that can supply the level of technological sophistication for all the products that we rely on, on day to day life."}, {"time": 3301, "text": "So you'd be going back to actually a very simple existence, more like pioneer life out West, in the story of the US, for example."}, {"time": 3308, "text": "And I think that the future of larger scale gatherings of humans in orbit, or sorry, in space, is actually gonna be in microgravity, floating space cities, not so much trying to establish settlements on the surface."}, {"time": 3325, "text": "So you think sort of a significant engineering investment in terms of our efforts and money should be on large spaceships, that perhaps are doing this kind of self assembly, all these kinds of things, and doing it in orbit, maybe building a giant donut around the planet over time."}, {"time": 3345, "text": "Yeah, that is the goal."}, {"time": 3346, "text": "And I think the current political climate is such that you can't get the trillion dollar investment to start from scratch and build the sci fi megastructure."}, {"time": 3356, "text": "But if you can build it in fits and starts, in little different pieces, which is another advantage of self assembly, it's much more like how nature works."}, {"time": 3364, "text": "So it's biomimicry inspired way for humanity to scale out in space."}, {"time": 3369, "text": "And whether it's out in space or on Mars, the idea that sort of two people fall in love, they have sex, a child is born, and then that couple has to teach that child that they came from Earth."}, {"time": 3387, "text": "I just love the idea that somebody is born on Mars or out in space, and you have to be like, this is not actually like the original home."}, {"time": 3396, "text": "Just them looking at Earth and being like, this is where we came from."}, {"time": 3400, "text": "I don't know, that's really inspiring to me."}, {"time": 3402, "text": "And the child being really confused and then wanting to go back to TikTok, or whatever they do."}, {"time": 3407, "text": "Whatever they do in that area."}, {"time": 3409, "text": "I mean, there's great sci fi, right, about people being born on Mars."}, {"time": 3412, "text": "And because it's a lower gravity environment, they're taller, they're more gangly, if they were actually able to develop there."}, {"time": 3418, "text": "And then they come back to Earth and they're like second class citizens because they can't function here in the same way because the gravity's too strong for them."}, {"time": 3426, "text": "You see this in series like The Expanse with the Belters and these different societies that if we were to succeed in having human societies grow up in different pockets, it's not necessarily going to be easy for them to always come back to Earth as their home."}, {"time": 3440, "text": "Yeah, different cultures form, which is the positive way of phrasing it."}, {"time": 3443, "text": "But it's also, this human history teaches us that we like to form the other."}, {"time": 3449, "text": "So there's this kind of conflict that naturally emerges."}, {"time": 3453, "text": "Let me ask another sort of dark question."}, {"time": 3455, "text": "What do you think about coming from a military family?"}, {"time": 3458, "text": "There's still sadly wars in the world."}, {"time": 3463, "text": "Do you think wars, military conflicts will follow us into space, wars between nations?"}, {"time": 3471, "text": "Like from my perspective currently, it just seems like space is a place for scientists and engineers to explore ideas."}, {"time": 3480, "text": "But the more and more progress you make, does it worry you that nations start to step in and form, that go out and fall out military conflict, whether it's in cyberspace, in space, or actual hot war?"}, {"time": 3498, "text": "I am really concerned about that."}, {"time": 3499, "text": "And I do think for decades, the scientific community in space has hung on to this notion from the 1967 Outer Space Treaty, which is space is the province of all humankind, peaceful uses of outer space only."}, {"time": 3512, "text": "But I do think the rise in tensions and the geopolitical scene that we're seeing, I do harbor a lot of concern about hot wars following humanity out into space."}, {"time": 3524, "text": "And it's worth trying to tie nations together with more collaboration to avoid that happening."}, {"time": 3531, "text": "The International Space Station is a great example."}, {"time": 3533, "text": "I think it's something like 18 countries are party to this treaty."}, {"time": 3537, "text": "It might be less, it might be more."}, {"time": 3539, "text": "And then of course, there's a smaller number of countries that actually send astronauts."}, {"time": 3542, "text": "But even at the fall of the Soviet Union and through some tense times with Russia, the ISS had been a place where the US and Russia were actually able to collaborate between Mir and ISS."}, {"time": 3553, "text": "I think it'd be really important right now in particular to find other platforms where these hegemonic powers in the world and developing world nations can come and collaborate on the future of space and purposefully intertwine our success so that there's a danger to multiple parties if somebody is a bad actor."}, {"time": 3572, "text": "So we're now talking as there's a war in Ukraine and I haven't been sleeping much."}, {"time": 3577, "text": "I have family, friends, colleagues in both countries."}, {"time": 3583, "text": "And I'm just talking to a lot of people, many of whom are crying, refugees."}, {"time": 3588, "text": "And there's a basic human compassion and love for each other that I believe technology can help catalyze and accelerate."}, {"time": 3599, "text": "But there's also science."}, {"time": 3600, "text": "There's something about rockets."}, {"time": 3602, "text": "There's something about, and I mean like space exploration that inspires the world about the positive possibilities of the human species."}, {"time": 3615, "text": "So in terms of Ukraine and Russia and China and India and the United States and Europe and everywhere else, it seems like collaborating on giant space projects is one way to escape these wars, to escape these sort of geopolitical conflicts."}, {"time": 3633, "text": "I mean, there's something, there's so much camaraderie to the whole thing."}, {"time": 3637, "text": "And even in this little period of human history we're living through, it seems like that's essential."}, {"time": 3645, "text": "Even through this pandemic, there's something so inspiring about those like SpaceX rockets going up, for example."}, {"time": 3652, "text": "This reinvigoration of the space exploration efforts by the commercial sector, I don't know."}, {"time": 3659, "text": "That was, as many of us have, sort of some dark times during this pandemic, just like loneliness and sometimes emotion and anger and just hopelessness and politics."}, {"time": 3673, "text": "And then you look at those rockets going up and it just gives you hope."}, {"time": 3677, "text": "So I think that's an understated sort of value of space exploration, is the thing that unites us and gives us hope."}, {"time": 3686, "text": "Obviously also inspires young generations and young minds to also contribute in not necessarily in space exploration but in all of science and literature and poetry."}, {"time": 3695, "text": "There's something about when you look up to the stars that makes you dream."}, {"time": 3700, "text": "And so that's a really good reason to sort of invest in this, whether it's building giant megastructure, which is so freaking cool, but also colonizing Mars."}, {"time": 3712, "text": "Yeah, it's something to look forward to."}, {"time": 3715, "text": "Something that, and not make it a domain of war, but a domain of human collaboration and human compassion, I think."}, {"time": 3726, "text": "You're the founder and director of the MIT Space Exploration Initiative."}, {"time": 3732, "text": "It includes a ton of projects."}, {"time": 3734, "text": "So I just wanted to, they're focused, I guess, on life in space from astrobiology, like we talked about, to habitats."}, {"time": 3742, "text": "Are there some other interesting projects, part of this initiative that pop to mind that you find particularly cool?"}, {"time": 3750, "text": "One is the future of in space manufacturing."}, {"time": 3753, "text": "So if we're gonna build large scale space structures, yes, it's great to ship them up from Earth and self assemble them."}, {"time": 3759, "text": "But what about extrusion in orbit?"}, {"time": 3761, "text": "It's one of the best technologies to leverage in microgravity because you can extrude a particularly long beam that would sag in a normal gravity environment, but might be able to become the basis of a truss or a large scale space structure."}, {"time": 3775, "text": "So we're doing miniature tests of extrusion and are excited to fly this on the International Space Station in a few months."}, {"time": 3781, "text": "We are working on swarm robots."}, {"time": 3784, "text": "We have just announced actually MIT's return to the moon."}, {"time": 3788, "text": "So my organization is leading this mission for MIT, going back to the surface of the moon as early as the end of this year, 2022, maybe early 2023, and trying to take data from our research payloads at this historic South Pole site where NASA is supposed to send the first humans back on the Artemis III mission."}, {"time": 3808, "text": "So our hope is to directly support that human mission with our data."}, {"time": 3812, "text": "How does that connect to the swarm aspects?"}, {"time": 3814, "text": "Does it connect?"}, {"time": 3815, "text": "Yeah, so we're actually gonna fly one of the little astro ants."}, {"time": 3818, "text": "That's the current plan."}, {"time": 3819, "text": "One of the little swarm robots on the top of a rover."}, {"time": 3822, "text": "That's part of the mission."}, {"time": 3824, "text": "Ants riding a rover?"}, {"time": 3825, "text": "Yes, exactly, an ant riding a rover."}, {"time": 3828, "text": "That rover gets packed in a lander."}, {"time": 3829, "text": "That lander gets packed in a SpaceX rocket."}, {"time": 3832, "text": "So it's a whole nesting dolls situation to get to the moon."}, {"time": 3835, "text": "Mother of robot dragons."}, {"time": 3838, "text": "So this one, a swarm of one?"}, {"time": 3841, "text": "Swarm of one, exactly."}, {"time": 3842, "text": "We're testing out."}, {"time": 3843, "text": "It's a tech demonstration mission, not a true swarm."}, {"time": 3846, "text": "Yeah, there they are."}, {"time": 3847, "text": "Those are the astro ants."}, {"time": 3849, "text": "Wow, and this was a distributed system, and in theory, you could have a ton of these."}, {"time": 3854, "text": "Yes, these could also be centralized."}, {"time": 3855, "text": "So they have wireless technology that could also talk to a central base station and will be assessing kind of case by case whether it makes sense to operate them in a decentralized swarm or to command them in a centralized swarm."}, {"time": 3869, "text": "Each robot is equipped with four magnetic wheels which enable the robot to attach to any magnetic surface so you can operate basically in any environment."}, {"time": 3877, "text": "He tested the, we tested the mobility of all robots on different materials in a microgravity environment."}, {"time": 3884, "text": "On the vomit comet prior to going to the moon."}, {"time": 3886, "text": "That must look so cool."}, {"time": 3888, "text": "So they're basically moving along different like metallic surfaces."}, {"time": 3894, "text": "It's interesting when you, just a minute ago talking about the reflection of how space can be so aspirational and so uniting."}, {"time": 3901, "text": "There's a great quote from Bill Anders from the Apollo 8 mission to the moon, which is he, it's the Earthrise photo that was taken where you see the Earth coming up over the horizon of the moon."}, {"time": 3911, "text": "And the quote is something along the lines of we came all the way to discover the moon and what we really discovered was the Earth."}, {"time": 3917, "text": "This really powerful image looking back."}, {"time": 3920, "text": "And so we're also trying to think for our lunar mission we realized we're a very privileged group at MIT to get the opportunity to do this."}, {"time": 3926, "text": "How could we bring humanity along with us?"}, {"time": 3929, "text": "And so one of the things we're still testing out I don't know if we're gonna be able to swing it would be to do something like a Twitch plays Pokemon but with the robot."}, {"time": 3936, "text": "So let a lot of people on earth actually control the robot or at least benefit from the data that we're gathering and try to release the data openly."}, {"time": 3944, "text": "So we're exploring a couple of different ideas for how do we engage more people in this mission."}, {"time": 3948, "text": "That would be surreal to be able to interact in some way with the thing that's out there."}, {"time": 3954, "text": "On another surface."}, {"time": 3959, "text": "I think about artificial intelligence in that same way which is like building robots puts a mirror to us humans."}, {"time": 3967, "text": "It makes us like wonder about like what is intelligence?"}, {"time": 3971, "text": "And what is actually valuable about human beings?"}, {"time": 3974, "text": "When AI system learns to play chess better than humans you start to let go of this idea that humans are special because of intelligence."}, {"time": 3986, "text": "It's maybe the flame of human consciousness."}, {"time": 3989, "text": "It's the capacity to feel deeply to sort of to both suffer and to love all those things."}, {"time": 3996, "text": "And that somehow AI to me sort of puts a mirror to that."}, {"time": 3999, "text": "You mentioned HAL 9000."}, {"time": 4001, "text": "You have to bring it up with these swarm bots crawling on the surface of your cocoon in space."}, {"time": 4010, "text": "I mean, all right."}, {"time": 4012, "text": "Let me steel man the HAL 9000 perspective here."}, {"time": 4018, "text": "The poor guy just wanted to maintain the mission and the astronauts were, I mean, I don't know if people often talk about that but like doctors have to make difficult decisions too."}, {"time": 4030, "text": "When there's limited resources you actually do have to sacrifice human life often because you have to make decisions."}, {"time": 4036, "text": "And I think HAL is probably making that kind of decision about what's more important, the lives of individual astronauts or the mission."}, {"time": 4046, "text": "And I feel like AI and other humans will need to make these decisions."}, {"time": 4053, "text": "And it also feels like AI systems will need to help make those decisions."}, {"time": 4060, "text": "I guess my question is about greater and greater collective intelligence by systems."}, {"time": 4071, "text": "What is the right way to sort of solve this problem keeping a human in the loop?"}, {"time": 4076, "text": "Do you think about this kind of stuff or are they sufficiently dumb now the robots that that's not yet on the horizon to think about?"}, {"time": 4083, "text": "I think it should be on the horizon."}, {"time": 4084, "text": "It's always good to think about these things early because we make a lot of technical design decisions at this phase working with swarm robots that it would be better to have thought about some of these questions early in the life cycle of a project."}, {"time": 4096, "text": "There is a real interest in NASA right now thinking about the future of human robot interaction, HRI, and what is the right synergy in terms of level of control for the human versus level of dependence or control for the robot."}, {"time": 4109, "text": "And we're beginning to test out more of these scenarios."}, {"time": 4113, "text": "For example, the Gateway Space Station, which is meant to be in orbit around the moon as a staging base for the surface operations, is meant to be able to function autonomously with no humans in it for months at a time because they think it's gonna be seasonal."}, {"time": 4127, "text": "They think we might not be constantly staffing it."}, {"time": 4130, "text": "So this will be a really great test of, I don't know that anybody's yet worried about HAL 9000 evolving, but certainly just the robustness of some of these AI systems that might be asked to autonomously maintain the station while the humans are away or detection algorithms that are gonna say, if you had a human pilot, they might see debris in orbit and steer around it."}, {"time": 4149, "text": "There'll be a lot of autonomous navigation that has to happen."}, {"time": 4152, "text": "That'll be one of the early test beds where we'll start to get a little bit closer to that future."}, {"time": 4156, "text": "Well, the HRI component is really interesting to me, especially when the I includes like almost friendship because people don't realize this, I think, that we humans long for connection."}, {"time": 4169, "text": "And when you have even a basic interaction that's just like supposed to be just like serving you or something, you still project, it's still a source of meaning and connection."}, {"time": 4185, "text": "And so you do have to think about that."}, {"time": 4187, "text": "I mean, HAL 9000, the movie maybe doesn't portray it that way, but I'm sure there's a relationship there between the astronauts and the robot, especially when you have greater and greater level of intelligence."}, {"time": 4198, "text": "And maybe that addresses the happiness question too."}, {"time": 4202, "text": "Yeah, I think there's a great book by Kate Darling, who's one of my colleagues at MIT."}, {"time": 4208, "text": "Yeah, she's amazing."}, {"time": 4209, "text": "She's already been on this podcast, but we talk all the time and we're supposed to talk and we've been missing each other and we're gonna make it happen soon."}, {"time": 4218, "text": "Come down to Texas, Kate."}, {"time": 4220, "text": "All right, anyway, yeah, she's amazing."}, {"time": 4222, "text": "She has this book, her whole work is about this."}, {"time": 4225, "text": "Connection with robots, yeah."}, {"time": 4226, "text": "This beautiful connection that we have with robots, but I think it's greater and greater importance when it's out in space, because it could help alleviate some of the loneliness."}, {"time": 4235, "text": "One of the projects in the book that I gave you, which is this catalog of the projects that we've worked on over the last five years, is this social robot that was developed at the Media Lab."}, {"time": 4243, "text": "And we, one of the first years in 2017 that we flew a zero G flight, we took the social robot along and tried to do a little bit of a very scaled down human study to look at these questions, because you do imagine that we would form a bond, a real bond with the social robots that might be not just serving us on a mission, but really be our teammates on a future mission."}, {"time": 4264, "text": "And I do think that that could have a powerful role in the mental health and just the stability of a crew is to have some other robot friends come along."}, {"time": 4270, "text": "What do you, by the way, the book you mentioned is into the Anthropocosmos, a whole space catalog from the space catalog."}, {"time": 4282, "text": "Get that reference."}, {"time": 4282, "text": "Yeah, so call out to Earth catalog, a whole space catalog from the MIT Space Exploration Initiative."}, {"time": 4290, "text": "What about the happiness?"}, {"time": 4291, "text": "You said that that's one of the problems of when you're out in space."}, {"time": 4295, "text": "How do you keep humans happy?"}, {"time": 4297, "text": "Again, asking for a friend."}, {"time": 4298, "text": "Yes, I mean, one of the big challenges is you can't just open a window or walk out a door and blow off steam, right?"}, {"time": 4305, "text": "You can't just go somewhere to clear your head."}, {"time": 4309, "text": "And in that sense, you need to build habitats that are homes that really care for the humans inside them and have, whether it's biophilia and a place where you can go and feel like you're in nature or a VR headset, which for some people is a poor simulacrum but is maybe better than nothing."}, {"time": 4329, "text": "You need to be thinking about these technological interventions that are gonna have to be part of your home and be part of your maybe day to day ritual to keep you steady and balanced and happy or feeling fulfilled."}, {"time": 4342, "text": "What about other humans, relationship with other humans?"}, {"time": 4345, "text": "Do those get weird when you get past a certain number of humans?"}, {"time": 4350, "text": "I'm not an expert in this area but an anecdote that I'll share."}, {"time": 4353, "text": "My understanding is that NASA has still not decided whether it's better to send married couples or single crew members in terms of, you want some level of stability, you don't wanna have the drama of romantic relationships like you're alluding to before, but they can't decide because married couples also fight and have a really tough dynamic."}, {"time": 4372, "text": "And so there's a lot of open questions still to answer about what is the ideal psychological makeup of a crew?"}, {"time": 4377, "text": "And we're starting to test some of these things with the civilian crews that are growing up with Inspiration4, like last fall with SpaceX and Axe One that's gonna fly in a few days here in March."}, {"time": 4387, "text": "As we begin to lengthen the time of those civilian crews, I think we'll start to learn a little bit more about just average everyday human to human dynamics and not the astronauts that are themselves selected to be perfect human specimens, very good to work with, easy to get along with."}, {"time": 4403, "text": "I wish you collected more data about this pandemic because I feel like it's a good rough simulation of what it'd be like out in space."}, {"time": 4410, "text": "A lot of people are locked down, some married couples, I think a lot of marriages broke up, a lot of marriages got closer together."}, {"time": 4418, "text": "So it's like, and then the single people, some of them went off the cliff and some of them discovered their new happiness and meaning and so on."}, {"time": 4426, "text": "It's a beautiful little experiment, a painful one."}, {"time": 4430, "text": "Is there a thorough way to really test that?"}, {"time": 4434, "text": "Because it's such a costly experiment to send humans up there, but I guess you can always return back to Earth if it's not working out."}, {"time": 4442, "text": "That's what we hope, that's what you hope."}, {"time": 4444, "text": "You don't have like a Apollo 13 situation that doesn't quite make it back."}, {"time": 4448, "text": "But yeah, this is also why Mars is such a challenge."}, {"time": 4451, "text": "The moon is only three days away."}, {"time": 4453, "text": "That's a lot quicker to recover from if there's a psychological problem with the crew or any type of maintenance problem, anything."}, {"time": 4459, "text": "Three years is such a challenge compared to these other domains that we've been getting more used to in terms of human spaceflight."}, {"time": 4467, "text": "So this is a question that we will need to have explored more before we start really sending crews to Mars."}, {"time": 4473, "text": "So you're a young scientist, do you think in your lifetime you will go out into orbit, you will go out beyond into deep space and potentially step, you, I don't know if you can call yourself a civilian."}, {"time": 4493, "text": "I don't know if that's what you count as, but you as a curious ant from MIT land step on Mars."}, {"time": 4506, "text": "That's a firm, that's a firm."}, {"time": 4507, "text": "Are you coming back?"}, {"time": 4507, "text": "Firm, yes, yeah, I'm coming back."}, {"time": 4508, "text": "I don't want that one way mission, I want the two way mission."}, {"time": 4512, "text": "But yes, I mean, I think we're already talking about a pretty near term opportunity where I could send graduate students to the International Space Station."}, {"time": 4519, "text": "Yeah, not a sacrifice, but send graduate students."}, {"time": 4525, "text": "For the experience."}, {"time": 4526, "text": "Send graduate students to the ISS to do their research."}, {"time": 4529, "text": "I do think you and I both would have an opportunity to go to a lunar base of some sort within our lifetime."}, {"time": 4535, "text": "And there's a good chance if we really wanted to, we might have to really advocate for it, apply to an astronaut program."}, {"time": 4543, "text": "There will be some avenues for humans in our lifetime to go to Mars."}, {"time": 4546, "text": "What's the bar for like health?"}, {"time": 4551, "text": "Do you think that bar will keep getting lower and lower in terms of how healthy, how athletic, like how the psychological profile, all those kinds of things?"}, {"time": 4559, "text": "Yeah, for one, we're gonna build more robust habitats that don't depend on astronauts being so impeccably well trained."}, {"time": 4565, "text": "So we're gonna make it better for inclusion and just opening access to space."}, {"time": 4570, "text": "But there's a fantastic group called Astro Access that is already helping disabled space flyers do zero G flights and potentially get access to the ISS."}, {"time": 4578, "text": "And some of the things that we think of as disabilities on earth are hyper abilities in space."}, {"time": 4584, "text": "You don't need really powerful legs in space."}, {"time": 4587, "text": "What you'd really benefit from having is a third arm, more ways to kind of move yourself around and grip and interact."}, {"time": 4593, "text": "So we are already seeing a much more open minded approach to who gets to go to space and Astro Access is a wonderful organization doing some of that work."}, {"time": 4603, "text": "I'm hoping introversion will also be a superpower in space."}, {"time": 4607, "text": "Okay, well, first I'd love to get your opinion on commercial space flight, what SpaceX, what Blue Origin are doing."}, {"time": 4614, "text": "And also another question on top of that is, because you've worked with a lot of different kinds of people, culturally, what's the difference between SpaceX or commercial type of efforts NASA and MIT?"}, {"time": 4630, "text": "And academia."}, {"time": 4631, "text": "Academia."}, {"time": 4632, "text": "Yeah, so the first part of your question, I am thrilled by all of the commercial activity in space."}, {"time": 4638, "text": "It has really empowered our program."}, {"time": 4640, "text": "So instead of me waiting for five years to get a grant and get the money from the grant and only then can you send a project to space, I go out and I fundraise a lot like a startup founder and I directly buy access to space on the International Space Station through SpaceX or NanoRacks, same with Blue Origin and their suborbital craft, same with Axiom now."}, {"time": 4658, "text": "Axiom's making plans for their own commercial space station."}, {"time": 4662, "text": "It's not out of the realm of possibility, but in a few years, I will rent lab space in orbit."}, {"time": 4668, "text": "I will rent a module from the Axiom space station or the orbital reef, which is the Blue Origin space station or NanoRacks is thinking about Starlab Oasis."}, {"time": 4676, "text": "There's probably some other companies that I'm not even aware of yet that are doing commercial space habitats."}, {"time": 4680, "text": "So I think that's fabulous and really empowering for our research."}, {"time": 4684, "text": "Is it affordable?"}, {"time": 4686, "text": "So like loosely speaking, does it become affordable for like MIT type of research lab?"}, {"time": 4693, "text": "Does it, or does it need to be a multi university like a gigantic effort, a consortium thing?"}, {"time": 4700, "text": "One of the reasons we're spinning out Aurelia is we actually realized it's cheap enough."}, {"time": 4704, "text": "It doesn't even have to be MIT."}, {"time": 4706, "text": "And we wanted to start democratizing access to these spaceflight opportunities to a much broader swath of humanity."}, {"time": 4713, "text": "Could you take a Khan Academy educational course about, hey, students around the world, this is how you get ready for a zero G flight."}, {"time": 4720, "text": "And by the way, come fly with us next year, which is something we're gonna do with Aurelius."}, {"time": 4724, "text": "We're gonna bring much more just kind of day to day folks on zero G flights and get them access to engaging in the space industry."}, {"time": 4732, "text": "So it's become cheap enough and the prices have dropped enough to consider even that."}, {"time": 4737, "text": "It definitely doesn't have to be a consortium of universities anymore."}, {"time": 4740, "text": "Depends on what you wanna fly."}, {"time": 4742, "text": "If you wanna fly James Webb, a huge telescope that's decades in the making, sure, you need a NASA allocation budget."}, {"time": 4748, "text": "You need billions."}, {"time": 4750, "text": "But for a lot of the stuff in the book and our research portfolio, it's actually becoming far more accessible."}, {"time": 4756, "text": "So that's a commercial."}, {"time": 4757, "text": "What about NASA and MIT academia?"}, {"time": 4761, "text": "Yeah, I think people have been worried about NASA the last few years because in some people's minds, they are ceding ground to these commercial efforts, but that's really not what's happening."}, {"time": 4774, "text": "NASA empowered these commercial efforts because they wanna free themselves up to go to Mars and go to Europa and continue being that really aspirational force for humanity of pushing the boundary, always pushing the boundary."}, {"time": 4788, "text": "And if they were anchored in low earth orbit, maintaining a space station indefinitely, that's so much a part of their budget that it was keeping them from being able to do more."}, {"time": 4797, "text": "So it actually is really fantastic for NASA to have grown this commercial ecosystem and then that frees NASA up to go further."}, {"time": 4803, "text": "And in academia, we like to think that we will be able to do the provocative next generation research that is going to unlock things at that frontier."}, {"time": 4813, "text": "And we can partner with NASA."}, {"time": 4814, "text": "We can go through a program if we wanna send a probe out really far, but we can also partner with SpaceX and see what human life in a SpaceX Mars settlement might look like and how we could design for that."}, {"time": 4824, "text": "Speaking of projects, maybe are there other projects that pop to mind from the Space Exploration Initiative or maybe stuff from the book that you can mention?"}, {"time": 4832, "text": "Something super cool."}, {"time": 4834, "text": "I mean, everything we've been talking about is cool, but just something that pops to mind again."}, {"time": 4837, "text": "Yeah, so we talked about life in space and you might need more arms than legs."}, {"time": 4842, "text": "One of the projects by Valentina Sumini was a air powered robotics tail."}, {"time": 4848, "text": "So it's a soft robotics tail that essentially has a little camera on the back end of it, can do computer vision and knows where to grapple."}, {"time": 4855, "text": "So it's behind you."}, {"time": 4856, "text": "It grapples onto something and holds you in space and then you can actually free up both of your hands to work."}, {"time": 4862, "text": "So we're already starting to think about the design of bionic humans or prosthetics or things that would make you kind of like a cyborg to augment your capabilities when you're in a space environment."}, {"time": 4873, "text": "How would you control something like that?"}, {"time": 4874, "text": "So it's kind of like a, I mean, you can't call it a leg, but whatever, it's a."}, {"time": 4877, "text": "An additional appendage."}, {"time": 4880, "text": "Appendage, so how would you, what are ideas for controlling something like that?"}, {"time": 4883, "text": "Yeah, so right now it's super, yeah, there you go."}, {"time": 4887, "text": "Right now it's super manual."}, {"time": 4889, "text": "It's basically just like a kind of a set pattern of inflating as we're testing it."}, {"time": 4894, "text": "But in the future, if we had a Neuralink, I mean, this is something that you could imagine directly controlling, just thinking thoughts and controlling it."}, {"time": 4901, "text": "That's a ways away."}, {"time": 4902, "text": "Yeah, so we talked about on the biology side, astrobiology, there's probably agriculture stuff."}, {"time": 4908, "text": "Is there other things that kind of feed the ecosystem of out in space for survival or the robotics architectures, the self assembly stuff?"}, {"time": 4916, "text": "So kind of combining something we were talking about, you can form these relationships with objects and anthropomorphize."}, {"time": 4922, "text": "One of the things that we're thinking about for agriculture created by Manwe and Somu, so two students at MIT, was this little, it looks like a planet, but it's inspired by, I think, a Mandala or Nepalese spinning wheel."}, {"time": 4935, "text": "And you plant plants on the inside and the astronaut has to spin it every day to help the plants survive."}, {"time": 4940, "text": "So it's a way to give the astronauts something to care about, something that they are responsible for keeping alive and can really invest themselves in."}, {"time": 4949, "text": "And it's not necessary, right?"}, {"time": 4950, "text": "We have other ways to grow in orbit, hydroponics, liquid medium, trying to keep the liquid around the plant roots is hard because there's no gravity to pull it down in a particular direction."}, {"time": 4960, "text": "But what I loved about this project was they said, sure, we have ways that the plants could grow on their own, but the astronauts might want to care for it in the same way that we have little plants that come to be important to us, little plant friends."}, {"time": 4972, "text": "So there's AgriFuge, that's an early model of this manually spinning plant habitat."}, {"time": 4978, "text": "I guess this is the best of academic research is you can do these kinds of wild ideas."}, {"time": 4983, "text": "Wild ideas, yeah."}, {"time": 4984, "text": "Well, I get to spend quite a bit of time with Mr. Elon Musk and he's very stressed, especially about Starship and all those kinds of engineering efforts."}, {"time": 4997, "text": "What do you think about how damn hard it is to get out of space?"}, {"time": 5003, "text": "Like, are we humans gonna be able to do this?"}, {"time": 5006, "text": "I don't know, I think it feels like it's an engineering problem, it's a scientific problem, but it's also just a motivation problem for the entire human species."}, {"time": 5015, "text": "And you also need to have superstar researchers and engineers working on it."}, {"time": 5020, "text": "So you have to get like the best people in the world, inspire them and starting from a young age and kind of."}, {"time": 5027, "text": "Almost inculcating us into why we do it."}, {"time": 5028, "text": "I mean, I guess that's why it's exciting."}, {"time": 5030, "text": "You don't know if we're gonna be able to pull this off."}, {"time": 5032, "text": "Like, we could like fail miserably."}, {"time": 5036, "text": "And that, I suppose, I mean, that's where the best of engineering is done is like success is not guaranteed."}, {"time": 5042, "text": "And even if it happens, it might be very painful."}, {"time": 5046, "text": "I think that's what's so special about what Elon is doing with SpaceX is he takes these risks and he tests iteratively and he'll, we'll see the spectacular failures on the path to a successful Starship."}, {"time": 5057, "text": "It's something that, you know, people have said, why isn't NASA doing that?"}, {"time": 5059, "text": "Well, that's cause NASA is doing that with taxpayer dollars and we would all revolt if we saw NASA failing at all these different stages."}, {"time": 5066, "text": "But that level of, you know, spiral engineering theory of development isn't super impressive."}, {"time": 5071, "text": "And it's a really interesting approach that SpaceX has taken."}, {"time": 5074, "text": "And I think between people like Elon and Jeff Bezos and Firefly and NASA and ESO, we are gonna get there."}, {"time": 5081, "text": "They're building the road to space."}, {"time": 5083, "text": "These trailblazers are doing it."}, {"time": 5085, "text": "And now part of the challenge is to get the rest of the public to understand that it's happening, right?"}, {"time": 5092, "text": "A lot of people don't know that we're going back to the moon, that we're gonna send the first woman to the moon within a few years."}, {"time": 5097, "text": "A lot of people don't know that there are commercial space stations in orbit, that it's not just NASA that does space stuff."}, {"time": 5103, "text": "So we have a big challenge to get more of humanity excited and educated and involved again, kind of like in the Apollo era where it was a big deal for everybody."}, {"time": 5112, "text": "Well, a lot of that is also one of the big impressive things that Elon does, I think, extremely well is the social media, is the getting people excited."}, {"time": 5121, "text": "And I think that actually, he's helped NASA step their game up in terms of social media."}, {"time": 5126, "text": "There's something about, yeah, the storytelling, but also not like, you know, like authentic and just real and raw engineering."}, {"time": 5136, "text": "There's a lot of excitement for that humor and fun also."}, {"time": 5140, "text": "All of those things you realize, the thing that make up the virality of the meme is beautiful, you have to kind of embrace that."}, {"time": 5148, "text": "And to me, this kind of, I criticize a lot of companies based on this."}, {"time": 5156, "text": "I talked to a bunch of CEOs and so on, and it's just like, there's a caution, like let us do this like press conference thing where when the final product is ready and it's overproduced, as opposed to the raw, the gritty just showed off."}, {"time": 5171, "text": "I mean, something that I think MIT is very good at doing is just showing the raw, by nature, the mess of it."}, {"time": 5177, "text": "And the mess of it is beautiful and people get really excited and failure is really exciting."}, {"time": 5181, "text": "When the thing blows up and you're like, oh shit, that makes it even more exciting when it doesn't blow up."}, {"time": 5187, "text": "And doing all of that on social media and showing also the humans behind it, the individual young researchers or the engineers or the leaders where everything's at stake."}, {"time": 5198, "text": "I don't know, I think I'm really excited about that."}, {"time": 5200, "text": "I do want MIT to do that more for students to show off their stuff and not be pressured to do this kind of generic official presentation, but show their, become a YouTuber also."}, {"time": 5214, "text": "Like show off your raw research as you're working on it in the early days."}, {"time": 5218, "text": "I hope that's the future."}, {"time": 5219, "text": "Things like, I was teasing about TikTok earlier, but these kinds of things I think inspire young people to show off their stuff, to show their true self, the rawness of it, because I think that's where engineering is best."}, {"time": 5233, "text": "And I think that will inspire people about all the cool stuff we could do out in space."}, {"time": 5238, "text": "I should say, I couldn't agree more."}, {"time": 5240, "text": "And I actually think that this is why we need a real life Starfleet Academy right now."}, {"time": 5244, "text": "It was the place where the space cadets got to go to learn about how to engage in a future of life in space."}, {"time": 5251, "text": "And we can do it in a much better way."}, {"time": 5253, "text": "There are a bunch of groups that traditionally haven't thought that they could engage in aerospace, whether it's because you were told you had to be into math and science."}, {"time": 5260, "text": "Now we need space lawyers, we need space artists like Grimes, right?"}, {"time": 5264, "text": "We need really creative, profoundly interesting people to wanna see themselves in that future."}, {"time": 5271, "text": "And I think it's a big challenge to us in the space industry to also do some more diversity, equity and inclusion, and show a broader swath of society that there's a future for them in this space exploration vision."}, {"time": 5281, "text": "Let me push back on one thing."}, {"time": 5283, "text": "We don't need space lawyers."}, {"time": 5285, "text": "Okay, it's a joke."}, {"time": 5286, "text": "We do, we do, we do."}, {"time": 5287, "text": "Okay, we do."}, {"time": 5289, "text": "The lawyers are great, I love them."}, {"time": 5291, "text": "Okay, let me ask a big, ridiculous question."}, {"time": 5293, "text": "What is the most beautiful idea to you about space exploration?"}, {"time": 5299, "text": "Whether it's the engineering, the astrobiology, the science, the inspiration, the human happiness, or aliens, I don't know."}, {"time": 5310, "text": "What do you, like, inspires you every day in terms of its beauty, in terms of its awe?"}, {"time": 5319, "text": "As a ex physicist, what I've always found so profound is just that at really, really small scales, like particle physics, and really, really big scales, like astrophysics, there are similarities in the way that those systems behave and look, and there's a certain beautiful symmetry in the universe that's just kind of waiting for us to tie together the physics and really understand it."}, {"time": 5344, "text": "That is something that just really captivates me, and I would love to, even though I'm now much more on the applied space exploration side, I really try to keep up with what's happening in those physics areas, because I think that will be a huge answer for humanity along the lines of, are we alone in the universe?"}, {"time": 5362, "text": "One of the fascinating things about you is you have a degree in physics, mathematics, and philosophy, and now, I don't know, would you call it aerospace engineering maybe kind of thing?"}, {"time": 5374, "text": "So you have at a foot in all of these worlds, the theoretic, the beauty of that world, and the philosophy somehow is in there, and now the very practical, pragmatic implementation of all these wild ideas, plus your incredible communicator, all of those things."}, {"time": 5393, "text": "What did you pick up from those different disciplines?"}, {"time": 5396, "text": "Or maybe I'm just romanticizing all those different disciplines, but what did you pick up from the variety of that physics, mathematics, philosophy?"}, {"time": 5406, "text": "What I loved about having this chance to do a liberal arts education was trying to understand the human condition, and I think more designers for space exploration should be thinking about that, because there's so much depth of, like we were talking about, issues and opportunities around human connection, human life, meaning in life."}, {"time": 5427, "text": "How do you find fulfillment or happiness?"}, {"time": 5429, "text": "And I think if you approach these questions just purely from the standpoint of an engineer or a scientist, you'll miss some of what makes it a life worth living."}, {"time": 5438, "text": "And so I love being able to combine some of this notion of philosophy and the human condition with my work, but I'm also a pragmatist, and I didn't want to stay just purely in these big picture questions about the universe."}, {"time": 5449, "text": "I wanted to have an impact on society, and I also felt like I had such a wonderful childhood and a really fantastic setup that I owe society some work to really make a positive impact for a broader swath of citizens."}, {"time": 5465, "text": "And so that kind of led me from the physics domain to thinking about engineering and practical questions for life in space."}, {"time": 5471, "text": "In physics, was there a dream?"}, {"time": 5473, "text": "Are you also captivated by this search for the theory of everything that kind of unlocks the deeper and deeper, in the simple, elegant way, the function of our universe?"}, {"time": 5485, "text": "Do you think that'll be useful for us for the actual practical engineering things that you're working on now?"}, {"time": 5492, "text": "I mean, I worked at CERN for two summers in undergrad, and we were looking for supersymmetry, which was one of these alternatives to the standard model."}, {"time": 5500, "text": "And it was sad because my professors were getting sadder and sadder because they weren't finding it."}, {"time": 5504, "text": "They were excluding what we would call this parameter space of finding these supersymmetric particles."}, {"time": 5510, "text": "But the search for what that theory of everything could be, or a grand unified theory that kind of answers some of the holes within the standard model of physics would presumably kind of unlock a better understanding of certain fundamental physical laws that we should be able to build a better understanding of engineering and day to day services from that."}, {"time": 5530, "text": "It might not be an immediately obvious thing."}, {"time": 5533, "text": "When we discovered the Higgs boson, I was there at CERN that day."}, {"time": 5536, "text": "It was July 4th, 2012 that it was announced."}, {"time": 5539, "text": "We all waited like nerds overnight in line to get into the announcement chamber."}, {"time": 5543, "text": "I'd never waited for even like a Harry Potter premiere in my life, but we waited for this announcement of the Higgs boson to get into the chamber overnight."}, {"time": 5550, "text": "But did that immediately translate to technology for engineering?"}, {"time": 5555, "text": "No, but it's still a really important part of our understanding of these fundamental laws of physics."}, {"time": 5561, "text": "And so I don't know that it's always immediate, but I think it is really critical knowledge for humanity to seek."}, {"time": 5566, "text": "It might just shake up understanding of the world."}, {"time": 5570, "text": "What scares me is it might help us create more dangerous weapons."}, {"time": 5574, "text": "So, and then we'll figure out that great filter situation."}, {"time": 5577, "text": "And I still believe that human compassion and love is actually the way to defend against all these greater and greater and more impressive weapons."}, {"time": 5587, "text": "Let me ask a weird question in terms of you disagreeing with others."}, {"time": 5592, "text": "What important idea do you believe is true that many others don't agree with you on?"}, {"time": 5600, "text": "Maybe, it's a tough question."}, {"time": 5602, "text": "You might have to think about that one, but whether it's very specific, like which material to use or something about a particular project, or it could be grand priorities on missions."}, {"time": 5615, "text": "I think one you actually mentioned is interesting is like the thing we should be looking for is like colonization of space versus colonization of planets."}, {"time": 5625, "text": "Meaning like."}, {"time": 5625, "text": "Yes, it's probably my best hot take that people would disagree with me on is life in floating cities as opposed to life on the surface."}, {"time": 5634, "text": "How do you envision that like spread of humans?"}, {"time": 5638, "text": "Cause you said at the beginning of the conversation, something about like scale, increasing the scale of basically humans in space."}, {"time": 5645, "text": "Are they just like in, they're in orbit and then they get a little farther and farther out."}, {"time": 5651, "text": "Like, do you see this kind of floating cities just getting farther and farther from earth?"}, {"time": 5657, "text": "They can always kind of return, but like if you look a few centuries from now, do you just see us, all these like floating cities."}, {"time": 5664, "text": "Like Amoeba."}, {"time": 5665, "text": "And it just kind of envelops the space around us in these like neighborhoods."}, {"time": 5671, "text": "Yeah, in these neighborhoods."}, {"time": 5672, "text": "It's like rural and there's like giant structures and there's small pirate structures and that kind of stuff."}, {"time": 5679, "text": "Pirate structures, yeah."}, {"time": 5680, "text": "I think low earth orbit might come to look like that."}, {"time": 5683, "text": "And it's a really interesting regulatory challenge to make sure that there's some cross purposes."}, {"time": 5689, "text": "So the more cool space cities we have in orbit, the more shiny objects in the night sky, the worse it is for astronomers in a really kind of overly simplified case."}, {"time": 5698, "text": "So there's some pushback to this like Amoebaing where we just grow kind of incongruously or indiscriminately as an Amoeba in low earth orbit."}, {"time": 5708, "text": "Beyond that though, I think we'll grow in pockets where there are resources."}, {"time": 5712, "text": "So we won't just expand around the gravity well of earth."}, {"time": 5715, "text": "We'll do some development around the moon, some development around asteroids, some development around Mars, because there'll always be purposes for which we wanna go down to a physical object and study it or extract something or learn from it."}, {"time": 5728, "text": "But I think we'll grow in fits and starts in pockets."}, {"time": 5732, "text": "Some of the coolest pockets are the gravity balanced pockets like the Lagrange points, which is where we just sent, we not me personally, but NASA just sent James Webb, the big telescope, I think it's at L2."}, {"time": 5744, "text": "What's the nice feature about those pockets?"}, {"time": 5746, "text": "So it's a stable orbit."}, {"time": 5748, "text": "There are several different Lagrange points."}, {"time": 5750, "text": "And so it just requires less energy to stay where you're trying to stay."}, {"time": 5757, "text": "What's also fascinating is the interaction between nations on that regard."}, {"time": 5764, "text": "Like who owns that?"}, {"time": 5766, "text": "Would you say in those floating cities, do you envision independent governments?"}, {"time": 5773, "text": "That was gonna be my next answer to you, which pushed me harder for a more provocative question where I might disagree with other people."}, {"time": 5779, "text": "I don't yet have my own opinions fully formed on this, but we are trying to figure out right now what happens to the moon with all of these first come first served actors just arriving and setting precedents that might really affect future access."}, {"time": 5794, "text": "And one example is property rights."}, {"time": 5797, "text": "We do want companies that have the expertise to go to the moon and mine stuff that will help us develop a human settlement there or a gateway, but companies need to know generally that they have rights to a certain area or that they have some legal right to sell things that they're getting."}, {"time": 5813, "text": "Does that mean we're gonna grant property rights on the moon to companies who has the right to give that right away?"}, {"time": 5820, "text": "So there's a bunch of really kind of gnarly questions that we have to think about, which is why I think we need space lawyers."}, {"time": 5824, "text": "Maybe that's the true provocative answers."}, {"time": 5827, "text": "I think we need space lawyers."}, {"time": 5829, "text": "I mean, yeah, yeah, I mean, but those questions, again, as you said eloquently, will help us answer questions about here on Earth."}, {"time": 5837, "text": "We hope so, yeah."}, {"time": 5838, "text": "It is a little strange."}, {"time": 5840, "text": "I mean, it's obvious, but it's also strange if you look at the big picture of it all that we draw these like borders around geographical areas and we say, this is mine, like, and then we fight wars over what's mine and not, it seems like there's possible alternatives, but also it seems like there needs to be a public ownership of some parts, like, what is it?"}, {"time": 5865, "text": "Central Park in New York."}, {"time": 5867, "text": "Is there something like preserving?"}, {"time": 5872, "text": "Yeah, the commons."}, {"time": 5874, "text": "That's why we titled the book Into the Anthropocosmos."}, {"time": 5877, "text": "We know it's a long and kind of a mouthful, but this notion of the Anthropocene, we have a lot of commons problems in humanity."}, {"time": 5884, "text": "How are we treating the Earth, global climate change?"}, {"time": 5887, "text": "How are we gonna treat and behave in space?"}, {"time": 5889, "text": "How can we be responsible stewards of the space commons?"}, {"time": 5892, "text": "And I would love to see an approach to the moon that is commons based, but it's hard to know who would be the protector or the enforcer of that."}, {"time": 5901, "text": "And if it's, which it will be probably in the early days, a lot of companies sort of working on the moon, working on Mars, working out in space, it feels like there still needs to be a civilian representation of like the greater effort or something like that."}, {"time": 5918, "text": "Like where there should be a president, there should be a democracy of some kind where people can vote."}, {"time": 5923, "text": "Some representative government."}, {"time": 5925, "text": "Those are all, again, the same human questions."}, {"time": 5929, "text": "What advice would you give to a young person today thinking about what they wanna do with their life, career?"}, {"time": 5937, "text": "So somebody in high school, somebody in college, maybe somebody that looks up to the stars and dreams to one day, take a one way ticket to Mars or to contribute something to the effort."}, {"time": 5949, "text": "I'd say you should feel empowered because it's really the first time in human history that we're at this cusp of interplanetary civilization."}, {"time": 5959, "text": "And I don't think we're gonna lapse back from it."}, {"time": 5962, "text": "So the future is incredibly bright for young people that even younger than you and I, who will actually really get a chance to go to Mars for certain."}, {"time": 5970, "text": "The other thing I would say is be open minded about what your own interests are."}, {"time": 5974, "text": "I don't think you anymore have to be shoehorned into a particular career to be welcomed into the future of space exploration."}, {"time": 5981, "text": "If you are an artist and that is your passion, but you would love to do space art or if not space art, use your artistry to communicate a feeling or a message about space."}, {"time": 5991, "text": "That's a role that we desperately need just as much as we need space scientists and space engineers, so."}, {"time": 5997, "text": "Well, when you look at your own life, you're an incredibly accomplished scientist, young scientist, but you know, and you hopped around from physics to aerospace."}, {"time": 6008, "text": "So going from the biggest theoretical ideas to the biggest practical ideas."}, {"time": 6014, "text": "Is there something from your own journey you can give advice to, like how to end up doing incredible research at MIT?"}, {"time": 6022, "text": "Maybe the role of the university and college and education and learning, all that kind of stuff."}, {"time": 6029, "text": "I'd say one piece of advice is find really good teammates because I get to be the one that's talking to you, but there are 50 graduate students, staff and faculty that are part of my organization back at MIT."}, {"time": 6041, "text": "And I'm actually, you guys can't see it on camera, but I'm sitting here with my co founder and COO, Danielle DeLotte, and that is really what makes these large scale challenges for humanity possible is really fantastic teams working together to scale more than what I could do alone."}, {"time": 6057, "text": "So I think that that's an important model that we don't talk about enough in academia."}, {"time": 6060, "text": "There's a big push for this like lone wolf genius figure in academia, but that's certainly not been the case in my life."}, {"time": 6066, "text": "I've had wonderful collaborators and people that I work with along the team."}, {"time": 6070, "text": "Also cross disciplinary."}, {"time": 6073, "text": "Cross disciplinary, interdisciplinary, whatever you wanna call it, but."}, {"time": 6077, "text": "Artists, where do artists come in?"}, {"time": 6079, "text": "Do you work with artists?"}, {"time": 6081, "text": "We have an arts curator on the space exploration initiative side."}, {"time": 6084, "text": "She helps make sure partly around that communication challenge that we talked about, that we're not just doing zero G flights and space missions, but that we take our artifacts of this sci fi space future to museums and galleries and exhibits."}, {"time": 6098, "text": "She pushed me to make sure her name is Shinglu."}, {"time": 6101, "text": "She pushed me for our first ISS mission."}, {"time": 6104, "text": "I was just gathering all the engineering payloads that I wanted to support for the students to fly, including my own work."}, {"time": 6109, "text": "And she said, you know what?"}, {"time": 6110, "text": "We should do an open call internationally for artists to send something to the ISS."}, {"time": 6115, "text": "And we found out it was the first time."}, {"time": 6117, "text": "We were the first ever international open call for art to go to the ISS."}, {"time": 6121, "text": "And that was thanks to Shing, an artist bringing a perspective that I might not have thought about prioritizing, so."}, {"time": 6129, "text": "So when you look out there, it's the flame of human consciousness."}, {"time": 6132, "text": "There does seem to be something quite special about us humans."}, {"time": 6136, "text": "Well, first of all, what do you think it is?"}, {"time": 6141, "text": "What's consciousness?"}, {"time": 6143, "text": "What are we trying to preserve here?"}, {"time": 6147, "text": "What is it about humans that should be preserved or life here on earth?"}, {"time": 6154, "text": "What gives you hope to try to expand it out farther and farther?"}, {"time": 6158, "text": "Like, what makes you sad if it was all gone?"}, {"time": 6163, "text": "I think we're a remarkable species that we are aware of our own thoughts."}, {"time": 6169, "text": "We are meta aware of our own thoughts and of ourselves."}, {"time": 6172, "text": "And we're able to speak on a podcast about our meta awareness, about our own thoughts."}, {"time": 6176, "text": "About our own thoughts, yeah."}]}]