[{"title": "Gustav Soderstrom: Spotify | Lex Fridman Podcast #29", "id": "v-9Mpe7NhkM", "quotes": [{"time": 232, "text": "But I also think you have the opposite of escaping, which is to help you focus on something you are actually doing."}, {"time": 237, "text": "Because I think people use music as a tool to tune the brain to the activities that they are actually doing."}, {"time": 245, "text": "And it's kind of like, in one sense, maybe it's the rawest signal."}, {"time": 250, "text": "If you think about the brain as neural networks, it's maybe the most efficient hack we can do to actually actively tune it into some state that you want to be."}, {"time": 258, "text": "You can do it in other ways."}, {"time": 259, "text": "You can tell stories to put people in a certain mood."}, {"time": 262, "text": "But music is probably very effective to get you to a certain mood very fast, I think."}, {"time": 267, "text": "You know, there's a social component historically to music, where people listen to music together."}, {"time": 272, "text": "I was just thinking about this, that to me, and you mentioned machine learning, but to me personally, music is a really private thing."}, {"time": 283, "text": "I'm speaking for myself, I listen to music, like almost nobody knows the kind of things I have in my library, except people who are really close to me and they really only know a certain percentage."}, {"time": 294, "text": "There's like some weird stuff that I'm almost probably embarrassed by, right?"}, {"time": 298, "text": "It's called the guilty pleasures, right?"}, {"time": 300, "text": "Everyone has the guilty pleasures, yeah."}, {"time": 302, "text": "Hopefully they're not too bad, but for me, it's personal."}, {"time": 306, "text": "Do you think of music as something that's social or as something that's personal?"}, {"time": 312, "text": "Or does it vary?"}, {"time": 314, "text": "So I think it's the same answer that you use it for both."}, {"time": 320, "text": "We've thought a lot about this during these 10 years at Spotify, obviously."}, {"time": 325, "text": "In one sense, as you said, music is incredibly social, you go to concerts and so forth."}, {"time": 330, "text": "On the other hand, it is your escape and everyone has these things that are very personal to them."}, {"time": 338, "text": "So what we've found is that when it comes to, most people claim that they have a friend or two that they are heavily inspired by and that they listen to."}, {"time": 350, "text": "So I actually think music is very social, but in a smaller group setting, it's an intimate form of, it's an intimate relationship."}, {"time": 360, "text": "It's not something that you necessarily share broadly."}, {"time": 363, "text": "Now, at concerts, you can argue you do, but then you've gathered a lot of people that you have something in common with."}, {"time": 368, "text": "I think this broadcast sharing of music is something we tried on social networks and so forth."}, {"time": 376, "text": "But it turns out that people aren't super interested in sharing their music."}, {"time": 383, "text": "They aren't super interested in what their friends listen to."}, {"time": 388, "text": "They're interested in understanding if they have something in common perhaps with a friend, but not just as information."}, {"time": 395, "text": "Right, that's really interesting."}, {"time": 398, "text": "I was just thinking of it this morning, listening to Spotify."}, {"time": 401, "text": "I really have a pretty intimate relationship with Spotify, with my playlists, right?"}, {"time": 408, "text": "I've had them for many years now and they've grown with me together."}, {"time": 413, "text": "There's an intimate relationship you have with a library of music that you've developed."}, {"time": 419, "text": "And we'll talk about different ways we can play with that."}, {"time": 422, "text": "Can you do the impossible task and try to give a history of music listening from your perspective from before the internet and after the internet and just kind of everything leading up to streaming with Spotify and so on?"}, {"time": 438, "text": "I'll try."}, {"time": 439, "text": "It could be a 100 year podcast."}, {"time": 442, "text": "I'll try to do a brief version."}, {"time": 444, "text": "There are some things that I think are very interesting during the history of music, which is that before recorded music, to be able to enjoy music, you actually had to be where the music was produced because you couldn't record it and time shift it, right?"}, {"time": 458, "text": "Creation and consumption had to happen at the same time, basically concerts."}, {"time": 461, "text": "And so you either had to get to the nearest village to listen to music."}, {"time": 466, "text": "And while that was cumbersome and it severely limited the distribution of music, it also had some different qualities, which was that the creator could always interact with the audience."}, {"time": 476, "text": "It was always live."}, {"time": 478, "text": "And also there was no time cap on the music."}, {"time": 480, "text": "So I think it's not a coincidence that these early classical works, they're much longer than the three minutes."}, {"time": 486, "text": "The three minutes came in as a restriction of the first wax disc that could only contain a three minute song on one side, right?"}, {"time": 494, "text": "So actually the recorded music severely limited or put constraints."}, {"time": 500, "text": "I won't say limit."}, {"time": 501, "text": "I mean, constraints are often good, but it put very hard constraints on the music format."}, {"time": 504, "text": "So you kind of said, instead of doing this opus on many tens of minutes or something, now you get three and a half minutes because then you're out of wax on this disc."}, {"time": 514, "text": "But in return, you get an amazing distribution."}, {"time": 517, "text": "Your reach will widen, right?"}, {"time": 519, "text": "Just on that point real quick."}, {"time": 522, "text": "Without the mass scale distribution, there's a scarcity component where you kind of look forward to it."}, {"time": 531, "text": "We had that, it's like the Netflix versus HBO Game of Thrones."}, {"time": 536, "text": "You like wait for the event because you can't really listen to it."}, {"time": 540, "text": "So you like look forward to it and then it's like, you derive perhaps more pleasure because it's more rare for you to listen to a particular piece."}, {"time": 547, "text": "You think there's value to that scarcity?"}, {"time": 550, "text": "Yeah, I think that that is definitely a thing."}, {"time": 552, "text": "And there's always this component of if you have something in infinite amounts, will you value it as much?"}, {"time": 560, "text": "Humanity is always seeking some, it's relative."}, {"time": 564, "text": "So you're always seeking something you didn't have."}, {"time": 565, "text": "And when you have it, you don't appreciate it as much."}, {"time": 567, "text": "So I think that's probably true."}, {"time": 569, "text": "But I think that that's probably true."}, {"time": 571, "text": "But I think that's why concerts exist."}, {"time": 573, "text": "So you can actually have both."}, {"time": 575, "text": "But I think net, if you couldn't listen to music in your car driving, that'd be worse."}, {"time": 582, "text": "That cost will be bigger than the benefit of the anticipation I think that you would have."}, {"time": 587, "text": "So, yeah, it started with live concerts."}, {"time": 590, "text": "Then it's being able to, you know, the phonograph invented, right?"}, {"time": 596, "text": "That you start to be able to record music."}, {"time": 599, "text": "So then you got this massive distribution that made it possible to create two things."}, {"time": 604, "text": "I think, first of all, cultural phenomenons, they probably need distribution to be able to happen."}, {"time": 610, "text": "But it also opened access to, you know, for a new kind of artist."}, {"time": 615, "text": "So you started to have these phenomenons like Beatles and Elvis and so forth."}, {"time": 618, "text": "That would really, a function of distribution, I think, obviously of talent and innovation."}, {"time": 623, "text": "But there was also technical component."}, {"time": 625, "text": "And of course, the next big innovation to come along was radio."}, {"time": 629, "text": "Broadcast radio."}, {"time": 630, "text": "And I think radio is interesting because it started not as a music medium."}, {"time": 636, "text": "It started as an information medium for news."}, {"time": 639, "text": "And then radio needed to find something to fill the time with so that they could honestly play more ads and make more money."}, {"time": 647, "text": "And music was free."}, {"time": 648, "text": "So then you had this massive distribution where you could program to people."}, {"time": 652, "text": "I think those things, that ecosystem, is what created the ability for hits."}, {"time": 659, "text": "But it was also a very broadcast medium."}, {"time": 661, "text": "So you would tend to get these massive, massive hits, but maybe not such a long tail."}, {"time": 667, "text": "In terms of choice of everybody listens to the same stuff."}, {"time": 670, "text": "And as you said, I think there are some social benefits to that."}, {"time": 674, "text": "I think, for example, there's a high statistical chance that if I talk about the latest episode of Game of Thrones, we have something to talk about, just statistically."}, {"time": 683, "text": "In the age of individual choice, maybe some of that goes away."}, {"time": 686, "text": "So I do see the value of shared cultural components, but I also obviously love personalization."}, {"time": 696, "text": "And so let's catch this up to the internet."}, {"time": 699, "text": "So maybe Napster, well, first of all, there's MP3s, tapes, CDs."}, {"time": 704, "text": "There was a digitalization of music with a CD, really."}, {"time": 707, "text": "It was physical distribution, but the music became digital."}, {"time": 711, "text": "And so they were files, but basically boxed software, to use a software analogy."}, {"time": 716, "text": "And then you could start downloading these files."}, {"time": 719, "text": "And I think there are two interesting things that happened."}, {"time": 722, "text": "Back to music used to be longer before it was constrained by the distribution medium."}, {"time": 728, "text": "I don't think that was a coincidence."}, {"time": 729, "text": "And then really the only music genre to have developed mostly after music was a file again on the internet is EDM."}, {"time": 737, "text": "And EDM is often much longer than the traditional music."}, {"time": 740, "text": "I think it's interesting to think about the fact that music is no longer constrained in minutes per song or something."}, {"time": 747, "text": "It's a legacy of an old distribution technology."}, {"time": 751, "text": "And you see some of this new music that breaks the format."}, {"time": 753, "text": "Not so much as I would have expected actually by now, but it still happens."}, {"time": 758, "text": "So first of all, I don't really know what EDM is."}, {"time": 761, "text": "Electronic dance music."}, {"time": 762, "text": "You could say Avicii."}, {"time": 764, "text": "Avicii was one of the biggest in this genre."}, {"time": 766, "text": "So the main constraint is of time."}, {"time": 769, "text": "Something like a three, four, five minute song."}, {"time": 772, "text": "So you could have songs that were eight minutes, 10 minutes and so forth."}, {"time": 776, "text": "Because it started as a digital product that you downloaded."}, {"time": 781, "text": "So you didn't have this constraint anymore."}, {"time": 783, "text": "So I think it's something really interesting that I don't think has fully happened yet."}, {"time": 788, "text": "We're kind of jumping ahead a little bit to where we are, but I think there's tons of format innovation in music that should happen now, that couldn't happen when you needed to really adhere to the distribution constraints."}, {"time": 800, "text": "If you didn't adhere to that, you would get no distribution."}, {"time": 810, "text": "That was very expensive."}, {"time": 813, "text": "Even though the app store has great distribution, she gets nowhere near the distribution versus staying within the three minute format."}, {"time": 819, "text": "So I think now that music is fully digital inside these streaming services, there is the opportunity to change the format again and allow creators to be much more creative without limiting their distribution ability."}, {"time": 832, "text": "That's interesting that you're right."}, {"time": 834, "text": "It's surprising that we don't see that taken advantage more often."}, {"time": 839, "text": "It's almost like the constraints of the distribution from the 50s and 60s have molded the culture to where we want the five, three to five minute song than anything else, not just."}, {"time": 852, "text": "So we want the song as consumers and as artists, because I write a lot of music and I never even thought about writing something longer than 10 minutes."}, {"time": 863, "text": "It's really interesting that those constraints."}, {"time": 866, "text": "Because all your training data has been three and a half minute songs, right?"}, {"time": 870, "text": "Okay, so yes, digitization of data led to then mp3s."}, {"time": 876, "text": "Yeah, so I think you had this file then that was distributed physically, but then you had the components of digital distribution and then the internet happened and there was this vacuum where you had a format that could be digitally shipped, but there was no business model."}, {"time": 891, "text": "And then all these pirate networks happened, Napster and in Pirate Island."}, {"time": 898, "text": "Napster and in Sweden Pirate Bay, which was one of the biggest."}, {"time": 902, "text": "And I think from a consumer point of view, which kind of leads up to the inception of Spotify, from a consumer point of view, consumers for the first time had this access model to music where they could, without kind of any marginal cost, they could try different tracks."}, {"time": 925, "text": "You could use music in new ways."}, {"time": 927, "text": "There was no marginal cost."}, {"time": 928, "text": "And that was a fantastic consumer experience to have access to all the music ever made, I think was fantastic."}, {"time": 934, "text": "But it was also horrible for artists because there was no business model around it."}, {"time": 938, "text": "So they didn't make any money."}, {"time": 939, "text": "So the user need almost drove the user interface before there was a business model."}, {"time": 946, "text": "And then there were these download stores that allowed you to download files, which was a solution, but it didn't solve the access problem."}, {"time": 955, "text": "There was still a marginal cost of 99 cents to try one more track."}, {"time": 958, "text": "And I think that that heavily limits how you listen to music."}, {"time": 961, "text": "The example I always give is, you know, in Spotify, a huge amount of people listen to music while they sleep, while they go to sleep and while they sleep."}, {"time": 971, "text": "If that costed you 99 cents per three minutes, you probably wouldn't do that."}, {"time": 975, "text": "And you would be much less adventurous if there was a real dollar cost to exploring music."}, {"time": 979, "text": "So the access model is interesting in that it changes your music behavior."}, {"time": 982, "text": "You can be, you can take much more risk because there's no marginal cost to it."}, {"time": 987, "text": "Maybe let me linger on piracy for a second, because I find, especially coming from Russia, piracy is something that's very interesting to me."}, {"time": 999, "text": "Not me, of course, ever, but I have friends who have partook in piracy of music, software, TV shows, sporting events."}, {"time": 1012, "text": "And usually to me, what that shows is not that they're, they can actually pay the money and they're not trying to save money."}, {"time": 1020, "text": "They're choosing the best experience."}, {"time": 1023, "text": "So what to me, piracy shows is a business opportunity in all these domains."}, {"time": 1028, "text": "And that's where I think you're right."}, {"time": 1031, "text": "Spotify stepped in is basically piracy was an experience."}, {"time": 1035, "text": "You can explore with fine music you like, and actually the interface of piracy is horrible because it's, I mean, it's bad metadata, long download times, all kinds of stuff."}, {"time": 1049, "text": "And what Spotify does is basically first rewards artists and second makes the experience of exploring music much better."}, {"time": 1058, "text": "I mean, the same is true, I think for movies and so on."}, {"time": 1062, "text": "That piracy reveals in the software space, for example, I'm a huge user and fan of Adobe products and there was much more incentive to pirate Adobe products before they went to a monthly subscription plan."}, {"time": 1077, "text": "And now all of the said friends that used to pirate Adobe products that I know now actually pay gladly for the monthly subscription."}, {"time": 1086, "text": "Yeah, I think you're right."}, {"time": 1088, "text": "I think it's a sign of an opportunity for product development."}, {"time": 1091, "text": "And that sometimes there's a product market fit before there's a business model fit in product development."}, {"time": 1099, "text": "I think that's a sign of it."}, {"time": 1101, "text": "In Sweden, I think it was a bit of both."}, {"time": 1104, "text": "There was a culture where we even had a political party called the Pirate Party."}, {"time": 1110, "text": "And this was during the time when people said that information should be free."}, {"time": 1115, "text": "It was somehow wrong to charge for ones and zeros."}, {"time": 1118, "text": "So I think people felt that artists should probably make some money somehow else and concerts or something."}, {"time": 1124, "text": "So at least in Sweden, it was part really social acceptance, even at the political level."}, {"time": 1129, "text": "But that also forced Spotify to compete with free, which I don't think would actually could have happened anywhere else in the world."}, {"time": 1138, "text": "The music industry needed to be doing bad enough to take that risk."}, {"time": 1143, "text": "And Sweden was like the perfect testing ground."}, {"time": 1144, "text": "It had government funded high bandwidth, low latency broadband, which meant that the product would work."}, {"time": 1151, "text": "And it was also there was no music revenue anyway."}, {"time": 1154, "text": "So they were kind of like, I don't think this is going to work, but why not?"}, {"time": 1158, "text": "So this product is one that I don't think could have happened in America, the world's largest music market, for example."}, {"time": 1163, "text": "So how do you compete with free?"}, {"time": 1165, "text": "Because that's an interesting world of the internet where most people don't like to pay for things."}, {"time": 1171, "text": "So Spotify steps in and tries to, yes, compete with free."}, {"time": 1176, "text": "How do you do it?"}, {"time": 1177, "text": "So I think two things."}, {"time": 1178, "text": "One is people are starting to pay for things on the internet."}, {"time": 1181, "text": "I think one way to think about it was that advertising was the first business model because no one would put a credit card on the internet."}, {"time": 1189, "text": "Transactional with Amazon was the second."}, {"time": 1191, "text": "And maybe subscription is the third."}, {"time": 1192, "text": "And if you look offline, subscription is the biggest of those."}, {"time": 1196, "text": "So that may still happen."}, {"time": 1197, "text": "I think people are starting to pay for things."}, {"time": 1199, "text": "But definitely back then, we needed to compete with free."}, {"time": 1202, "text": "And the first thing you need to do is obviously to lower the price to free and then you need to be better somehow."}, {"time": 1209, "text": "And the way that Spotify was better was on the user experience, on the actual performance, the latency of, you know, even if you had high bandwidth broadband, it would still take you 30 seconds to a minute to download one of these tracks."}, {"time": 1230, "text": "So the Spotify experience of starting within the perceptual limit of immediacy, about 250 milliseconds, meant that the whole trick was it felt as if you had downloaded all of Pirate Bay."}, {"time": 1241, "text": "It was on your hard drive."}, {"time": 1242, "text": "It was that fast, even though it wasn't."}, {"time": 1245, "text": "And it was still free."}, {"time": 1246, "text": "But somehow you were actually still being a legal citizen."}, {"time": 1250, "text": "And that was the trick that Spotify managed to pull off."}, {"time": 1254, "text": "So I've actually heard you say this or write this."}, {"time": 1258, "text": "And I was surprised that I wasn't aware of it because I just took it for granted."}, {"time": 1262, "text": "You know, whenever an awesome thing comes along, you're just like, of course, it has to be this way."}, {"time": 1267, "text": "That's exactly right."}, {"time": 1268, "text": "That it felt like the entire world's libraries at my fingertips because of that latency being reduced."}, {"time": 1275, "text": "What was the technical challenge in reducing the latency?"}, {"time": 1278, "text": "So there was a group of really, really talented engineers, one of them called Ludwig Strigius."}, {"time": 1285, "text": "He wrote the, actually from Gothenburg, he wrote the initial, the uTorrent client, which is kind of an interesting backstory to Spotify, that we have one of the top developers from uTorrent clients as well."}, {"time": 1299, "text": "So he wrote uTorrent, the world's smallest uTorrent client."}, {"time": 1302, "text": "And then he was acquired very early by Daniel and Martin, who founded Spotify, and they actually sold the uTorrent client to BitTorrent, but kept Ludwig."}, {"time": 1313, "text": "So Spotify had a lot of experience within peer to peer networking."}, {"time": 1319, "text": "So the original innovation was a distribution innovation, where Spotify built an end to end media distribution system up until only a few years ago, we actually hosted all the music ourselves."}, {"time": 1329, "text": "So we had both the service side and the client, and that meant that we could do things such as having a peer to peer solution to use local caching on the client side, because back then the world was mostly desktop."}, {"time": 1340, "text": "But we could also do things like hack the TCP protocols, things like Nagel's algorithm for kind of exponential back off, or ramp up and just go full throttle and optimize for latency at the cost of bandwidth."}, {"time": 1353, "text": "And all of this end to end control meant that we could do an experience that felt like a step change."}, {"time": 1360, "text": "These days, we actually are on GCP, we don't host our own stuff, and everyone is really fast these days."}, {"time": 1367, "text": "So that was the initial competitive advantage."}, {"time": 1369, "text": "But then obviously, you have to move on over time."}, {"time": 1371, "text": "And that was over 10 years ago, right?"}, {"time": 1374, "text": "That was in 2008."}, {"time": 1375, "text": "The product was launched in Sweden."}, {"time": 1377, "text": "It was in a beta, I think, 2007."}, {"time": 1379, "text": "And it was on the desktop, right?"}, {"time": 1380, "text": "It was desktop only."}, {"time": 1381, "text": "There's no phone."}, {"time": 1383, "text": "There was no phone."}, {"time": 1384, "text": "The iPhone came out in 2008."}, {"time": 1387, "text": "But the App Store came out one year later, I think."}, {"time": 1390, "text": "So the writing was on the wall, but there was no phone yet."}, {"time": 1394, "text": "You've mentioned that people would use Spotify to discover the songs they like, and then they would torrent those songs to so they can copy it to their phone."}, {"time": 1406, "text": "Not torrent, pirate."}, {"time": 1407, "text": "Seriously, piracy does seem to be like a good guide for business models."}, {"time": 1413, "text": "Video content."}, {"time": 1414, "text": "As far as I know, Spotify doesn't have video content."}, {"time": 1417, "text": "Well, we do have music videos, and we do have videos on the service."}, {"time": 1422, "text": "But the way we think about ourselves is that we're an audio service, and we think that if you look at the amount of time that people spend on audio, it's actually very similar to the amount of time that people spend on music."}, {"time": 1435, "text": "It's very similar to the amount of time that people spend on video."}, {"time": 1438, "text": "So the opportunity should be equally big."}, {"time": 1442, "text": "But today, it's not at all valued."}, {"time": 1443, "text": "Videos value much higher."}, {"time": 1445, "text": "So we think it's basically completely undervalued."}, {"time": 1448, "text": "So we think of ourselves as an audio service."}, {"time": 1450, "text": "But within that audio service, I think video can make a lot of sense."}, {"time": 1454, "text": "I think when you're discovering an artist, you probably do want to see them and understand who they are, to understand their identity."}, {"time": 1461, "text": "You won't see that video every time."}, {"time": 1462, "text": "90% of the time, the phone is going to be in your pocket."}, {"time": 1465, "text": "For podcasters, you use video."}, {"time": 1467, "text": "I think that can make a ton of sense."}, {"time": 1468, "text": "So we do have video, but we're an audio service where, think of it as we call it internally, backgroundable video."}, {"time": 1475, "text": "Video that is helpful, but isn't the driver of the narrative."}, {"time": 1479, "text": "I think also, if we look at YouTube, there's quite a few folks who listen to music on YouTube."}, {"time": 1488, "text": "So in some sense, YouTube is a bit of a competitor to Spotify, which is very strange to me that people use YouTube to listen to music."}, {"time": 1497, "text": "They play essentially the music videos, right?"}, {"time": 1500, "text": "But don't watch the videos and put it in their pocket."}, {"time": 1503, "text": "Well, I think it's similar to what, strangely, maybe it's similar to what we were for the piracy networks, where YouTube, for historical reasons, have a lot of music videos."}, {"time": 1520, "text": "So people use YouTube for a lot of the discovery part of the process, I think."}, {"time": 1525, "text": "But then it's not a really good sort of, quote unquote, MP3 player, because it doesn't even background."}, {"time": 1529, "text": "Then you have to keep the app in the foreground."}, {"time": 1531, "text": "So it's not a good consumption tool, but it's a decently good discovery."}, {"time": 1536, "text": "I mean, I think YouTube is a fantastic product."}, {"time": 1538, "text": "And I use it for all kinds of purposes."}, {"time": 1541, "text": "If I were to admit something, I do use YouTube a little bit to assist in the discovery process of songs."}, {"time": 1547, "text": "And then if I like it, I'll add it to Spotify."}, {"time": 1550, "text": "But that's OK. That's OK with us."}, {"time": 1553, "text": "OK, so sorry, we're jumping around a little bit."}, {"time": 1555, "text": "So it's kind of incredible."}, {"time": 1558, "text": "You look at Napster, you look at the early days of Spotify."}, {"time": 1563, "text": "One fascinating point is how do you grow a user base?"}, {"time": 1566, "text": "So you're there in Sweden."}, {"time": 1568, "text": "You have an idea."}, {"time": 1570, "text": "I saw the initial sketches that look terrible."}, {"time": 1574, "text": "How do you grow a user base from a few folks to millions?"}, {"time": 1579, "text": "I think there are a bunch of tactical answers."}, {"time": 1582, "text": "So first of all, I think you need a great product."}, {"time": 1584, "text": "I don't think you take a bad product and market it to be successful."}, {"time": 1590, "text": "So you need a great product."}, {"time": 1591, "text": "But sorry to interrupt, but it's a totally new way to listen to music, too."}, {"time": 1594, "text": "So it's not just did people realize immediately that Spotify is a great product?"}, {"time": 1598, "text": "No, I think they did."}, {"time": 1600, "text": "So back to the point of piracy, it was a totally new way to listen to music legally."}, {"time": 1605, "text": "But people had been used to the access model in Sweden and the rest of the world for a long time through piracy."}, {"time": 1610, "text": "So one way to think about Spotify, it was just legal and fast piracy."}, {"time": 1614, "text": "And so people have been using it for a long time."}, {"time": 1616, "text": "So they weren't alien to it."}, {"time": 1619, "text": "They didn't really understand how it could be illegal because it seemed too fast and too good to be true, which I think is a great product proposition if you can be too good to be true."}, {"time": 1626, "text": "But what I saw again and again was people showing each other, clicking the song, showing how fast it started and say, can you believe this?"}, {"time": 1633, "text": "So I really think it was about speed."}, {"time": 1636, "text": "Then we also had an invite program that was really meant for scaling because we hosted our own service."}, {"time": 1643, "text": "We needed to control scaling."}, {"time": 1645, "text": "But that built a lot of expectation."}, {"time": 1647, "text": "And I don't want to say hype because hype implies that it wasn't true."}, {"time": 1652, "text": "Excitement around the product."}, {"time": 1652, "text": "And we've replicated that when we launched in the US."}, {"time": 1658, "text": "We also built up an invite only program first."}, {"time": 1661, "text": "There are lots of tactics, but I think you need a great product to solve some problem."}, {"time": 1666, "text": "And basically the key innovation, there was technology, but on a meta level, the innovation was really the access model versus the ownership model."}, {"time": 1675, "text": "And that was tricky."}, {"time": 1676, "text": "A lot of people said that they wanted to be able to do it."}, {"time": 1681, "text": "I mean, they wanted to own their music."}, {"time": 1684, "text": "They would never kind of rent it or borrow it."}, {"time": 1687, "text": "But I think the fact that we had a free tier, which meant that you get to keep this music for life as well, helped quite a lot."}, {"time": 1694, "text": "So this is an interesting psychological point that maybe you can speak to."}, {"time": 1698, "text": "It was a big shift for me."}, {"time": 1702, "text": "It's almost like I had to go to therapy for this."}, {"time": 1706, "text": "I think I would describe my early listening experience, and I think a lot of my friends do, as basically hoarding music."}, {"time": 1713, "text": "As you're like slowly, one song by one song, or maybe albums, gathering a collection of music that you love."}, {"time": 1720, "text": "And you own it."}, {"time": 1722, "text": "It's like often, especially with CDs or tape, you like physically had it."}, {"time": 1726, "text": "And what Spotify, what I had to come to grips with, it was kind of liberating actually, is to throw away all the music."}, {"time": 1735, "text": "I've had this therapy session with lots of people."}, {"time": 1738, "text": "And I think the mental trick is, so actually we've seen the user data."}, {"time": 1742, "text": "When Spotify started, a lot of people did the exact same thing."}, {"time": 1745, "text": "They started hoarding as if the music would disappear."}, {"time": 1749, "text": "Almost the equivalent of downloading."}, {"time": 1750, "text": "And so we had these playlists that had limits of like a few hundred thousand tracks."}, {"time": 1756, "text": "We figured no one will ever."}, {"time": 1757, "text": "Well, they do."}, {"time": 1758, "text": "Nuts and hundreds and hundreds of thousands of tracks."}, {"time": 1760, "text": "And to this day, some people want to actually save, quote unquote, and then play the entire catalog."}, {"time": 1766, "text": "But I think the therapy session goes something like instead of throwing away your music, if you took your files and you stored them in the locker at Google, it'd be a streaming service."}, {"time": 1779, "text": "It's just that in that locker, you have all the world's music now for free."}, {"time": 1782, "text": "So instead of giving away your music, you got all the music."}, {"time": 1786, "text": "You could think of it as having a copy of the world's catalog there forever."}, {"time": 1790, "text": "So you actually got more music instead of less."}, {"time": 1792, "text": "It's just that you just took that hard disk and you sent it to someone who stored it for you."}, {"time": 1798, "text": "And once you go through that mental journey, I'm like, it's still my files."}, {"time": 1801, "text": "They're just over there."}, {"time": 1802, "text": "And I just have 40 million or 50 million or something now."}, {"time": 1805, "text": "Then people are like, OK, that's good."}, {"time": 1807, "text": "The problem is, I think, because you paid us a subscription, if we hadn't had the free tier where you would feel like, even if I don't want to pay anymore, I still get to keep them."}, {"time": 1817, "text": "You keep your playlist forever."}, {"time": 1818, "text": "They don't disappear even though you stop paying."}, {"time": 1820, "text": "I think that was really important."}, {"time": 1821, "text": "If we would have started as, you know, you can put in all this time, but if you stop paying, you lose all your work."}, {"time": 1827, "text": "I think that would have been a big challenge and was the big challenge for a lot of our competitors."}, {"time": 1831, "text": "That's another reason why I think the free tier is really important."}, {"time": 1834, "text": "That people need to feel the security, that the work they put in, it will never disappear, even if they decide not to pay."}, {"time": 1840, "text": "I like how you put the work you put in."}, {"time": 1842, "text": "I actually stopped even thinking of it that way."}, {"time": 1844, "text": "I just actually Spotify taught me to just enjoy music as opposed to."}, {"time": 1850, "text": "As opposed to what I was doing before, which is like in an unhealthy way, hoarding music."}, {"time": 1858, "text": "Which I found that because I was doing that, I was listening to a small selection of songs way too much to where I was getting sick of them."}, {"time": 1867, "text": "Whereas Spotify, the more liberating kind of approach is I was just enjoying."}, {"time": 1871, "text": "Of course, I listened to Stairway to Heaven over and over, but because of the extra variety, I don't get as sick of them."}, {"time": 1878, "text": "There's an interesting statistic I saw."}, {"time": 1881, "text": "So Spotify has, maybe you can correct me, but over 50 million songs, tracks, and over 3 billion playlists."}, {"time": 1891, "text": "So 50 million songs and 3 billion playlists."}, {"time": 1895, "text": "60 times more playlist songs."}, {"time": 1898, "text": "What do you make of that?"}, {"time": 1900, "text": "So the way I think about it is that from a statistician or machine learning point of view, you have all these, if you want to think about reinforcement learning, you have this state space of all the tracks."}, {"time": 1914, "text": "You can take different journeys through this world."}, {"time": 1920, "text": "I think of these as people helping themselves and each other, creating interesting vectors through this space of tracks."}, {"time": 1928, "text": "And then it's not so surprising that across many tens of millions of atomic units, there will be billions of paths that make sense."}, {"time": 1937, "text": "And we're probably pretty quite far away from having found all of them."}, {"time": 1941, "text": "So kind of our job now is users, when Spotify started, it was really a search box that was for the time pretty powerful."}, {"time": 1950, "text": "And then I'd like to refer to it as this programming language called playlisting, where if you, as you probably were pretty good at music, you knew your new releases, you knew your back catalog, you knew your star with the heaven, you could create a soundtrack for yourself using this playlisting tool, this like meta programming language for music to soundtrack your life."}, {"time": 1967, "text": "And people who were good at music, it's back to how do you scale the product."}, {"time": 1970, "text": "For people who are good at music, that wasn't actually enough."}, {"time": 1973, "text": "If you had the catalog and a good search tool, and you can create your own sessions, you could create really good a soundtrack for your entire life."}, {"time": 1981, "text": "Probably perfectly personalized because you did it yourself."}, {"time": 1984, "text": "But the problem was most people, many people aren't that good at music."}, {"time": 1986, "text": "They just can't spend the time."}, {"time": 1988, "text": "Even if you're very good at music, it's going to be hard to keep up."}, {"time": 1990, "text": "So what we did to try to scale this was to essentially try to build, you can think of them as agents that this friend that some people had that helped them navigate this music catalog."}, {"time": 2002, "text": "That's what we're trying to do for you."}, {"time": 2004, "text": "But also there is something like 200 million active users."}, {"time": 2012, "text": "1 million active users on Spotify."}, {"time": 2015, "text": "So there it's okay."}, {"time": 2016, "text": "So from the machine learning perspective, you have these 200 million people plus they're creating."}, {"time": 2025, "text": "It's really interesting to think of a playlist as, I mean, I don't know if you meant it that way, but it's almost like a programming language."}, {"time": 2034, "text": "It's or at least a trace of exploration of those individual agents."}, {"time": 2041, "text": "The listeners and you have all this new tracks coming in."}, {"time": 2046, "text": "So it's a fascinating space that is ripe for machine learning."}, {"time": 2051, "text": "So is there, is it possible, how can playlists be used as data in terms of machine learning and to help Spotify organize the music?"}, {"time": 2064, "text": "So we found in our data, not surprising that people who play listed lots they retain much better."}, {"time": 2070, "text": "They had a great experience."}, {"time": 2072, "text": "And so our first attempt was to playlist for users."}, {"time": 2075, "text": "And so we acquired this company called Tunigo of editors and professional playlisters and kind of leveraged the maximum of human intelligence to help build kind of these vectors through the track space for people."}, {"time": 2092, "text": "And that broadened the product."}, {"time": 2094, "text": "But then the obvious next, and we use statistical means, where they could see when they created a playlist, how did that playlist perform?"}, {"time": 2102, "text": "They could see skips of the songs, they could see how the songs perform, and they manually iterated the playlist to maximize performance for a large group of people."}, {"time": 2110, "text": "But there were never enough editors to playlists for you personally."}, {"time": 2114, "text": "So the promise of machine learning was to go from kind of group personalization using editors and tools and statistics to individualization."}, {"time": 2122, "text": "And then what's so interesting about the 3 billion playlists we have is we ended, the truth is we lucked out."}, {"time": 2129, "text": "This was not a priority strategy, as is often the case."}, {"time": 2132, "text": "It looks really smart in hindsight, but it was dumb luck."}, {"time": 2137, "text": "We looked at these playlists and we had some people in the company, a person named Eric Beranodson."}, {"time": 2143, "text": "He was really good at machine learning already back then in like 2007, 2008."}, {"time": 2148, "text": "Back then it was mostly collaborative filtering and so forth."}, {"time": 2151, "text": "But we realized that what this is, is people are grouping tracks for themselves that have some semantic meaning to them."}, {"time": 2160, "text": "And then they actually label it with a playlist name as well."}, {"time": 2164, "text": "So in a sense, people were grouping tracks along semantic dimensions and labeling them."}, {"time": 2169, "text": "And so could you use that information to find that latent embedding?"}, {"time": 2175, "text": "And so we started playing around with collaborative filtering and we saw tremendous success with it."}, {"time": 2184, "text": "Basically trying to extract some of these dimensions."}, {"time": 2188, "text": "And if you think about it, it's not surprising at all."}, {"time": 2190, "text": "It'd be quite surprising if playlists were actually random, if they had no semantic meaning."}, {"time": 2196, "text": "For most people, they group these tracks for some reason."}, {"time": 2199, "text": "So we just happened across this incredible data set."}, {"time": 2203, "text": "Where people are taking these tens of millions of tracks and group them along different semantic vectors."}, {"time": 2209, "text": "And the semantics being outside the individual users."}, {"time": 2212, "text": "So it's some kind of universal."}, {"time": 2214, "text": "There's a universal embedding that holds across people on this earth."}, {"time": 2219, "text": "Yes, I do think that the embeddings you find are going to be reflective of the people who play listed."}, {"time": 2225, "text": "So if you have a lot of indie lovers who play list, your embedding is going to perform better there."}, {"time": 2234, "text": "But what we found was that yes, there were these latent similarities."}, {"time": 2240, "text": "They were very powerful."}, {"time": 2242, "text": "And it was interesting because I think that the people who play listed the most initially were the so called music aficionados who were really into music."}, {"time": 2252, "text": "And they often had a certain... Their taste was often geared towards a certain type of music."}, {"time": 2258, "text": "And so what surprised us, if you look at the problem from the outside, you might expect that the algorithms would start performing best with mainstreamers first."}, {"time": 2267, "text": "Because it somehow feels like an easier problem to solve mainstream taste than really particular taste."}, {"time": 2273, "text": "It was the complete opposite for us."}, {"time": 2275, "text": "The recommendations performed fantastically for people who saw themselves as having very unique taste."}, {"time": 2280, "text": "That's probably because all of them play listed."}, {"time": 2283, "text": "And they didn't perform so well for mainstreamers."}, {"time": 2285, "text": "They actually thought they were a bit too particular and unorthodox."}, {"time": 2289, "text": "So we had the complete opposite of what we expected."}, {"time": 2292, "text": "Success within the hardest problem first, and then had to try to scale to more mainstream recommendations."}, {"time": 2297, "text": "So you've also acquired Echo Nest that analyzes song data."}, {"time": 2304, "text": "So in your view, maybe you can talk about, so what kind of data is there from a machine learning perspective?"}, {"time": 2311, "text": "From a machine learning perspective, there's a huge amount."}, {"time": 2315, "text": "We're talking about playlisting and just user data of what people are listening to, the playlist they're constructing, and so on."}, {"time": 2324, "text": "And then there's the actual data within a song."}, {"time": 2328, "text": "What makes a song, I don't know, the actual waveforms."}, {"time": 2334, "text": "How do you mix the two?"}, {"time": 2335, "text": "How much value is there in each?"}, {"time": 2337, "text": "To me, it seems like user data is a romantic notion that the song itself would contain useful information."}, {"time": 2345, "text": "But if I were to guess, user data would be much more powerful, like playlists would be much more powerful."}, {"time": 2351, "text": "Yeah, so we use both."}, {"time": 2354, "text": "Our biggest success initially was with playlist data without understanding anything about the structure of the song."}, {"time": 2362, "text": "But when we acquired Echo Nest, they had the inverse problem."}, {"time": 2365, "text": "They actually didn't have any play data."}, {"time": 2367, "text": "They were just, they were a provider of recommendations, but they didn't actually have any play data."}, {"time": 2371, "text": "So they looked at the structure of songs, sonically, and they looked at Wikipedia for cultural references and so forth, right?"}, {"time": 2380, "text": "And did a lot of NLU and so forth."}, {"time": 2381, "text": "So we got that skill into the company and combined kind of our user data with their kind of content based."}, {"time": 2391, "text": "So you can think of it as we were user based and they were content based in their recommendations."}, {"time": 2394, "text": "And we combined those two."}, {"time": 2396, "text": "And for some cases where you have a new song that has no play data, obviously you have to try to go by either who the artist is or the sonic information in the song or what it's similar to."}, {"time": 2409, "text": "So there's definitely a value in both and we do a lot in both, but I would say, yes, the user data captures things that have to do with culture in the greater society that you would never see in the content itself."}, {"time": 2423, "text": "But that said, we have seen, we have a research lab in Paris when we can talk more about that on machine learning on the creator side, what it can do for creators, not just for the consumers, but where we looked at how does the structure of a song actually affect the listening behavior?"}, {"time": 2440, "text": "And it turns out that there is a lot of, we can predict things like skips based on the song itself."}, {"time": 2448, "text": "We could say that maybe you should move that chorus a bit because your skip is going to go up here."}, {"time": 2452, "text": "There is a lot of latent structure in the music, which is not surprising because it is some sort of mind hack."}, {"time": 2458, "text": "So there should be structure."}, {"time": 2458, "text": "That's probably what we respond to."}, {"time": 2460, "text": "You just blew my mind actually from the creator perspective."}, {"time": 2465, "text": "So that's a really interesting topic that probably most creators aren't taking advantage of, right?"}, {"time": 2471, "text": "So I've recently got to interact with a few folks, YouTubers who are like obsessed with this idea of what do I do to make sure people keep watching the video?"}, {"time": 2487, "text": "And they like look at the analytics of which point do people turn it off and so on."}, {"time": 2492, "text": "First of all, I don't think that's healthy, but it's because you can do it a little too much."}, {"time": 2498, "text": "But it is a really powerful tool for helping the creative process."}, {"time": 2502, "text": "You just made me realize you could do the same thing for creation of music."}, {"time": 2507, "text": "And so is that something you've looked into?"}, {"time": 2511, "text": "And can you speak to how much opportunity there is for that kind of thing?"}, {"time": 2514, "text": "Yeah, so I listened to the podcast with Ziraj and I thought it was fantastic and I reacted to the same thing where he said he posted something in the morning, immediately watched the feedback where the drop off was and then responded to that in the afternoon, which is quite different from how people make podcasts, for example."}, {"time": 2532, "text": "I mean, the feedback loop is almost non existent."}, {"time": 2535, "text": "So if we back out one level, I think actually both for music and podcasts, which we also do at Spotify, I think there's a tremendous opportunity just for the creation workflow."}, {"time": 2547, "text": "And I think it's really interesting speaking to you who, because you're a musician, a developer, and a podcaster."}, {"time": 2554, "text": "If you think about those three different roles, if you make the leap as a musician, if you think about it as a software tool chain, really, your DAW with the stems, that's the IDE, right?"}, {"time": 2566, "text": "That's where you work in source code format with what you're creating."}, {"time": 2571, "text": "Then you sit around and you play with that."}, {"time": 2572, "text": "And when you're happy, you compile that thing into some sort of AAC or MP3 or something."}, {"time": 2577, "text": "You do that because you get distribution."}, {"time": 2579, "text": "There are so many runtimes for that MP3 across the world in car stairs and stuff."}, {"time": 2582, "text": "So if you kind of compile this execution, you ship it out in kind of an old fashioned boxed software analogy."}, {"time": 2589, "text": "And then you hope for the best, right?"}, {"time": 2591, "text": "But as a software developer, you would never do that."}, {"time": 2596, "text": "First, you go on GitHub and you collaborate with other creators."}, {"time": 2599, "text": "And then you think it'd be crazy to just ship one version of your software without doing an A B test, without any feedback loop."}, {"time": 2606, "text": "Issue tracking."}, {"time": 2608, "text": "And then you would look at the feedback loop and say, try to optimize that thing, right?"}, {"time": 2614, "text": "So I think if you think of it as a very specific software tool chain, it looks quite arcane, the tools that a music creator has versus what a software developer has."}, {"time": 2625, "text": "So that's kind of how we think about it."}, {"time": 2628, "text": "Why wouldn't a music creator have something like GitHub where you could collaborate much more easily?"}, {"time": 2634, "text": "So we bought this company called Soundtrap, which has a kind of Google Docs for music approach, where you can collaborate with other people on the kind of source code format with Stems."}, {"time": 2645, "text": "And I think introducing things like AI tools there to help you as you're creating music, both in helping you put accompaniment to your music, like drums or something, help you master and mix automatically, help you understand how this track will perform."}, {"time": 2666, "text": "Exactly what you would expect as a software developer."}, {"time": 2669, "text": "I think it makes a lot of sense."}, {"time": 2670, "text": "And I think the same goes for a podcaster."}, {"time": 2673, "text": "I think podcasters will expect to have the same kind of feedback loop that Siraj has, like, why wouldn't you?"}, {"time": 2679, "text": "Maybe it's not healthy, but..."}, {"time": 2681, "text": "Sorry, I wanted to criticize the fact because you can overdo it because a lot of the, and we're in a new era of that."}, {"time": 2689, "text": "So you can become addicted to it and therefore, what people say, you become a slave to the YouTube algorithm or sort of, it's always a danger of a new technology as opposed to say, if you're creating a song, becoming too obsessed about the intro riff to the song that keeps people listening versus actually the entirety of the creation process."}, {"time": 2715, "text": "It's a balance."}, {"time": 2716, "text": "But the fact that there's zero, I mean, you're blowing my mind right now, because you're completely right that there is no signal whatsoever."}, {"time": 2724, "text": "There's no feedback whatsoever on the creation process and music or podcasting, almost at all."}, {"time": 2731, "text": "And are you saying that Spotify is hoping to help create tools to, not tools, but... No, tools actually."}, {"time": 2741, "text": "Actually, tools."}, {"time": 2742, "text": "Tools for creators."}, {"time": 2748, "text": "So we've made some acquisitions the last few years around music creation, this company called Soundtrap, which is a digital audio workstation, but that is browser based."}, {"time": 2759, "text": "And their focus was really the Google Docs approach."}, {"time": 2761, "text": "We can collaborate with people much more easily than you could in previous tools."}, {"time": 2766, "text": "So we have some of these tools that we're working with that we want to make accessible and then we can connect it with our consumption data."}, {"time": 2772, "text": "We can create this feedback loop where we could help you understand, we could help you create and help you understand how you will perform."}, {"time": 2780, "text": "We also acquired this other company within podcasting called Anchor, which is one of the biggest podcasting tools, mobile focused."}, {"time": 2788, "text": "So really focused on simple creation or easy access to creation."}, {"time": 2792, "text": "But that also gives us this feedback loop."}, {"time": 2794, "text": "And even before that, we invested in something called Spotify for Artists and Spotify for Podcasters, which is an app that you can download, you can verify that you are that creator."}, {"time": 2806, "text": "And then you get things that software developers have had for years."}, {"time": 2811, "text": "You can see where, if you look at your podcast, for example, on Spotify or a song that you released, you can see how it's performing, which cities it's performing in, who's listening to it, what's the demographic breakup."}, {"time": 2822, "text": "So similar in the sense that you can understand how you're actually doing on the platform."}, {"time": 2828, "text": "So we definitely want to build tools."}, {"time": 2830, "text": "I think you also interviewed the head of research for Adobe."}, {"time": 2835, "text": "And I think that's an, back to Photoshop that you like, I think that's an interesting analogy as well."}, {"time": 2842, "text": "Photoshop, I think, has been very innovative in helping photographers and artists."}, {"time": 2848, "text": "And I think there should be the same kind of tools for music creators, where you could get AI assistance, for example, as you're creating music, as you can do with Adobe, where you can, I want a sky over here and you can get help creating that sky."}, {"time": 2862, "text": "The really fascinating thing is what Adobe doesn't have is a distribution for the content you create."}, {"time": 2870, "text": "So you don't have the data of if I create, if I, you know, whatever creation I make in Photoshop or Premiere, I can't get like immediate feedback like I can on YouTube, for example, about the way people are responding."}, {"time": 2885, "text": "And if Spotify is creating those tools, that's a really exciting actually world."}, {"time": 2891, "text": "But let's talk a little about podcasts."}, {"time": 2896, "text": "So I have trouble talking to one person."}, {"time": 2900, "text": "So it's a bit terrifying and kind of hard to fathom, but on average, 60 to 100,000 people will listen to this episode."}, {"time": 2910, "text": "Okay, so it's intimidating."}, {"time": 2912, "text": "Yeah, it's intimidating."}, {"time": 2914, "text": "So I hosted on Blueberry."}, {"time": 2916, "text": "I don't know if I'm pronouncing that correctly, actually."}, {"time": 2919, "text": "It looks like most people listen to it on Apple Podcasts, Cast Box and Pocket Casts, and only about a thousand listen on Spotify."}, {"time": 2928, "text": "It's just my podcast, right?"}, {"time": 2933, "text": "So where do you see a time when Spotify will dominate this?"}, {"time": 2940, "text": "So Spotify is relatively new into this podcasting site."}, {"time": 2946, "text": "Yeah, in podcasting."}, {"time": 2947, "text": "What's the deal with podcasting and Spotify?"}, {"time": 2950, "text": "How serious is Spotify about podcasting?"}, {"time": 2953, "text": "Do you see a time where everybody would listen to, you know, probably a huge amount of people, majority perhaps listen to music on Spotify?"}, {"time": 2962, "text": "Do you see a time when the same is true for podcasting?"}, {"time": 2966, "text": "Well, I certainly hope so."}, {"time": 2968, "text": "That is our mission."}, {"time": 2969, "text": "Our mission as a company is actually to enable a million creators to live off of their art, and a billion people be inspired by it."}, {"time": 2975, "text": "And what I think is interesting about that mission is it actually puts the creators first, even though it started as a consumer focused company, and it's just to be able to live off of their art, not just make some money off of their art as well."}, {"time": 2987, "text": "So it's quite an ambitious project."}, {"time": 2991, "text": "So we think about creators of all kinds, and we kind of expanded our mission from being music to being audio a while back."}, {"time": 3001, "text": "And that's not so much because we think we made that decision."}, {"time": 3008, "text": "We think that decision was made for us."}, {"time": 3010, "text": "We think the world made that decision."}, {"time": 3012, "text": "Whether we like it or not, when you put in your headphones, you're going to make a choice between music and a new episode of your podcast or something else."}, {"time": 3025, "text": "We're in that world whether we like it or not."}, {"time": 3026, "text": "And that's how radio works."}, {"time": 3028, "text": "So we decided that we think it's about audio."}, {"time": 3032, "text": "You can see the rise of audiobooks and so forth."}, {"time": 3034, "text": "We think audio is a great opportunity."}, {"time": 3036, "text": "So we decided to enter it."}, {"time": 3037, "text": "And obviously, Apple and Apple Podcasts is absolutely dominating in podcasting, and we didn't have a single podcast only like two years ago."}, {"time": 3049, "text": "What we did though was we looked at this and said, can we bring something to this?"}, {"time": 3056, "text": "We want to do this, but back to the original Spotify, we have to do something that consumers actually value to be able to do this."}, {"time": 3063, "text": "And the reason we've gone from not existing at all to being quite a wide margin, the second largest podcast consumption, still wide gap to iTunes, but we're growing quite fast."}, {"time": 3076, "text": "I think it's because when we looked at the consumer problem, people said surprisingly that they wanted their podcasts and music in the same application."}, {"time": 3086, "text": "So what we did was we took a little bit of a different approach where we said, instead of building a separate podcast app, we thought, is there a consumer problem to solve here?"}, {"time": 3093, "text": "Because the others are very successful already."}, {"time": 3095, "text": "And we thought there was in making a more seamless experience where you can have your podcast and your music in the same application, because we think it's audio to you."}, {"time": 3105, "text": "And that has been successful."}, {"time": 3106, "text": "And that meant that we actually had 200 million people to offer this to instead of starting from zero."}, {"time": 3112, "text": "So I think we have a good chance because we're taking a different approach than the competition."}, {"time": 3116, "text": "And back to the other thing I mentioned about creators, because we're looking at the end to end flow."}, {"time": 3122, "text": "I think there's a tremendous amount of innovation to do around podcast as a format."}, {"time": 3127, "text": "When we have creation tools and consumption, I think we could start improving what podcasting is."}, {"time": 3132, "text": "I mean, podcast is this opaque, big, like one, two hour file that you're streaming, which it really doesn't make that much sense in 2019 that it's not interactive."}, {"time": 3144, "text": "There's no feedback loops, nothing like that."}, {"time": 3146, "text": "So I think if we're going to win, it's going to have to be because we build a better product for creators and for consumers."}, {"time": 3152, "text": "So we'll see, but it's certainly our goal."}, {"time": 3154, "text": "We have a long way to go."}, {"time": 3156, "text": "Well, the creators part is really exciting."}, {"time": 3158, "text": "You already, you got me hooked there."}, {"time": 3160, "text": "Cause the only stats I have, Blueberry just recently added the stats of whether it's listened to the end or not."}, {"time": 3168, "text": "And that's like a huge improvement, but that's still nowhere to where you could possibly go in terms of statistics."}, {"time": 3174, "text": "You just download the Spotify podcasters up and verify."}, {"time": 3177, "text": "And then, then you'll know where people dropped out in this episode."}, {"time": 3181, "text": "The moment I started talking."}, {"time": 3183, "text": "I might be depressed by this, but okay."}, {"time": 3186, "text": "So one, um, one other question is the original Spotify for music."}, {"time": 3194, "text": "And I have a question about podcasting in this line is the idea of podcasting about podcasting in this line is the idea of albums."}, {"time": 3203, "text": "I have, uh, what did you, uh, music aficionados, uh, friends who are really, uh, big fans of music often, uh, really enjoy albums, listening to entire albums of, of an artist."}, {"time": 3216, "text": "Correct me if I'm wrong, but I feel like Spotify has helped replace the idea of an album with playlists."}, {"time": 3224, "text": "So you create your own albums."}, {"time": 3226, "text": "It's, it's kind of the way, at least I've experienced music and I've really enjoyed it that way."}, {"time": 3231, "text": "One of the things that was missing in podcasting for me, I don't know if it's missing."}, {"time": 3236, "text": "It's an open question for me, but the way I listened to podcasts is the way I would listen to albums."}, {"time": 3242, "text": "So I take a Joe Rogan experience and that's an album."}, {"time": 3245, "text": "And I listened, you know, I like, I, I put that on and I listened one episode after the next, then there's a sequence and so on."}, {"time": 3252, "text": "Is there a room for doing what you did for music or doing what Spotify did for music, but, uh, creating playlists, sort of, uh, this kind of playlisting idea of breaking apart from podcasting, uh, from individual podcasts and creating kind of, uh, this interplay or, or have you thought about that space?"}, {"time": 3273, "text": "Uh, it's a great question."}, {"time": 3274, "text": "So I think in, um, in music, you're right."}, {"time": 3278, "text": "Basically you bought an album."}, {"time": 3279, "text": "So it was like, you bought a small catalog of like 10 tracks, right?"}, {"time": 3282, "text": "It was, it was, again, it was actually a lot of, a lot of consumption."}, {"time": 3286, "text": "You think it's about what you like, but it's based on the business model."}, {"time": 3289, "text": "So you paid for this 10 track service and then you listened to that for a while."}, {"time": 3294, "text": "And then when, when everything was flat priced, you tended to listen differently."}, {"time": 3298, "text": "Now, so, so I think the, I think the album is still tremendously important."}, {"time": 3301, "text": "That's why we have it and you can save albums and so forth."}, {"time": 3303, "text": "And you have a huge amount of people who really listen according to albums."}, {"time": 3306, "text": "And I like that because it is a creator format, you can tell a longer story over several tracks."}, {"time": 3312, "text": "And so some people listen to just one track."}, {"time": 3313, "text": "Some people actually want to hear that whole story."}, {"time": 3317, "text": "Now in podcast, I think, I think it's different."}, {"time": 3321, "text": "You can argue that podcasts might be more like shows on Netflix."}, {"time": 3325, "text": "Have like a full season of Narcos and you're probably not going to do like one episode of Narcos and then one of House of Cards, like, like, you know, there's a narrative there."}, {"time": 3334, "text": "And you, you, you love the cast and you love these characters."}, {"time": 3337, "text": "So I think people will, people love shows."}, {"time": 3342, "text": "And I think they will, they will listen to those shows."}, {"time": 3344, "text": "I do think you follow a bunch of shows at the same time."}, {"time": 3346, "text": "So there's certainly an opportunity to bring you the latest episode of, you know, whatever the five, six, 10 things that, that you're into."}, {"time": 3354, "text": "But, but I think, I think people are going to listen to specific hosts and love those hosts for a long time."}, {"time": 3361, "text": "Because I think there's something different with podcasts where, um, this format of the, the, the, the, the, the experience of the, of the audience is actually sitting here right between us."}, {"time": 3373, "text": "Whereas if you look at something on TV, the audio actually would come from, you would sit over there and the audio would come to you from both of us as if you were watching, not as you were part of the conversation."}, {"time": 3382, "text": "So my experience is having listened to podcasts like yours and Joe Rogan is, I feel like I know all of these people."}, {"time": 3388, "text": "They, they have a lot of experience."}, {"time": 3390, "text": "I know all of these people, they have no idea who I am, but I feel like I've listened to so many hours of that."}, {"time": 3395, "text": "It's very different from me watching a, watching like a TV show or an interview."}, {"time": 3399, "text": "So I think you, you kind of, um, fall in love with people and, um, experience in a, in a different way."}, {"time": 3405, "text": "So I think, I think shows and hosts are going to be very, uh, very important."}, {"time": 3409, "text": "I don't think that's going to go away into some sort of thing where, where you don't even know who you're listening to."}, {"time": 3413, "text": "I don't think that's going to happen."}, {"time": 3415, "text": "What I do think is I think there's a tremendous discovery opportunity in podcast because the catalog is growing quite quickly."}, {"time": 3423, "text": "And I think podcast is only a few, like five, 600,000 shows right now."}, {"time": 3431, "text": "If you look back to YouTube as another analogy of creators, no one really knows if you would lift the lid on YouTube, but it's probably billions of episodes."}, {"time": 3441, "text": "And so I think the podcast catalog would probably grow tremendously because the creation tools are getting easier."}, {"time": 3447, "text": "And then you're going to have this discovery opportunity that I think is really big."}, {"time": 3451, "text": "So, so a lot of people tell me that they love their shows, but discovering podcasts kind of suck."}, {"time": 3456, "text": "It's really hard to get into new show."}, {"time": 3458, "text": "They're usually quite long."}, {"time": 3459, "text": "It's a big time investment."}, {"time": 3460, "text": "So I think there's plenty of opportunity in the discovery part."}, {"time": 3465, "text": "Yeah, for sure."}, {"time": 3466, "text": "A hundred percent in, in even the dumbest, there's so many low hanging fruit too."}, {"time": 3471, "text": "Uh, for example, just knowing what episode to listen to first to try out a podcast."}, {"time": 3480, "text": "Uh, because most podcasts don't have an order to them."}, {"time": 3483, "text": "Uh, they, they can be listened to out of order and sorry to say some are better than others episodes."}, {"time": 3492, "text": "So some episodes of Joe Rogan are better than others."}, {"time": 3495, "text": "And it's nice to know, uh, which you should listen to, to try it out."}, {"time": 3500, "text": "And there's, uh, as far as I know, almost no information, uh, in terms of like, uh, upvotes on how good an episode is."}, {"time": 3509, "text": "So I think part of the problem is, uh, you, it's kind of like music."}, {"time": 3513, "text": "There isn't one answer."}, {"time": 3514, "text": "People use music for different things and there's actually many different types of music."}, {"time": 3517, "text": "There's workout music and there's classical piano music and focus music and, and, and, uh, so forth."}, {"time": 3522, "text": "I think the same with podcasts."}, {"time": 3524, "text": "Some podcasts are sequential."}, {"time": 3525, "text": "They're supposed to be listened to in, in order."}, {"time": 3528, "text": "It's actually, it's actually telling a narrative."}, {"time": 3531, "text": "Some podcasts are one topic, uh, kind of like yours, but different guests."}, {"time": 3535, "text": "So you could jump in anywhere."}, {"time": 3537, "text": "Some podcasts actually have completely different topics."}, {"time": 3539, "text": "And for those podcasts, it might be that I want, you know, we should recommend one episode because it's about AI from someone, but then they talk about something that you're not interested in the rest of the episodes."}, {"time": 3550, "text": "So I think our, what we're spending a lot of time on now is just first understanding the domain and creating kind of the knowledge graph of how do these objects relate and how do people consume."}, {"time": 3562, "text": "And I think we'll find that it's going to be, it's going to be different."}, {"time": 3566, "text": "I'm excited because you're the, uh, Spotify is the first people I'm aware of that are trying to do this for podcasting."}, {"time": 3574, "text": "Podcasting has been like a wild west up until now."}, {"time": 3578, "text": "It's been a very, we want to be very careful though, because it's been a very good wild west, I think it's this fragile ecosystem."}, {"time": 3586, "text": "And I, we want to make sure that you don't barge in and say like, Oh, we're going to internetize this thing."}, {"time": 3593, "text": "And you have to think about the creators."}, {"time": 3596, "text": "You have to understand how they get distribution today, who listens to how they make money today, try to, you know, make sure that their business model works, that they understand."}, {"time": 3606, "text": "I think it's back to doing something to improving their products, like feedback loops and distribution."}, {"time": 3611, "text": "So jumping back into terms of this fascinating world of a recommender system and listening to music and using machine learning to analyze things, do you think it's better to what currently, correct me if I'm wrong, but currently Spotify lets people pick what they listen to the most part."}, {"time": 3631, "text": "There's a discovery process, but you kind of organize playlists."}, {"time": 3635, "text": "Is it better to let people pick what they listen to or recommend what they should listen to something like stations by Spotify that I saw that you're playing around with?"}, {"time": 3644, "text": "Maybe you can tell me what's the status of that."}, {"time": 3647, "text": "This is a Pandora style app that just kind of, as opposed to you select the music you listen to, it kind of feeds you the music you listen to."}, {"time": 3658, "text": "What's the status of stations by Spotify?"}, {"time": 3660, "text": "What's its future?"}, {"time": 3661, "text": "The story of Spotify, as we have grown, has been that we made it more accessible to different audiences and stations is another one of those where the question is, some people want to be very specific."}, {"time": 3674, "text": "They actually want to hear Starway to Heaven right now, that needs to be very easy to do."}, {"time": 3679, "text": "And some people, or even the same person, at some point might say, I want to feel upbeat or I want to feel happy or I want songs to sing in the car."}, {"time": 3692, "text": "So they put in the information at a very different level and then we need to translate that into what that means musically."}, {"time": 3700, "text": "So stations is a test to create like a consumption input vector that is much simpler where you can just tune it a little bit and see if that increases the overall reach."}, {"time": 3709, "text": "But we're trying to kind of serve the entire gamut of super advanced so called music aficionados all the way to people who they love listening to music but it's not their number one priority in life."}, {"time": 3723, "text": "They're not going to sit and follow every new release from every new artist."}, {"time": 3726, "text": "They need to be able to influence music at a different level."}, {"time": 3731, "text": "So you can think of it as different products and I think one of the interesting things to answer your question on if it's better to let the user choose or to play, I think the answer is the challenge when machine learning kind of came along, there was a lot of thinking about what does product development mean in a machine learning context."}, {"time": 3753, "text": "People like Andrew Ng, for example, when he went to Baidu, he started doing a lot of practical machine learning, went from academia and he thought a lot about this and he had this notion that a product manager, designer and engineer, they used to work around this wireframe to kind of describe what the product should look like."}, {"time": 3769, "text": "It was something to talk about when you're doing a chatbot or a playlist, what are you going to say?"}, {"time": 3774, "text": "It should be good."}, {"time": 3775, "text": "That's not a good product description."}, {"time": 3777, "text": "So how do you do that?"}, {"time": 3778, "text": "And he came up with this notion that the test set is the new wireframe."}, {"time": 3783, "text": "The job of the product manager is to source a good test set that is representative of what, like if you say I want to play this, that is songs to sing in the car."}, {"time": 3791, "text": "The job of the product manager is to go and source a good test set of what that means."}, {"time": 3795, "text": "So then you can work with engineering to have algorithms to try to produce that."}, {"time": 3800, "text": "So we try to think a lot about how to structure product development for a machine learning age."}, {"time": 3806, "text": "And what we discovered was that a lot of it is actually in the expectation."}, {"time": 3810, "text": "And you can go two ways."}, {"time": 3813, "text": "So let's say that if you set the expectation with the user that this is a discovery product, like Discover Weekly, you're actually setting the expectation that most of what we show you will not be relevant."}, {"time": 3826, "text": "When you're in the discovery process, you're going to accept that actually if you find one gem every Monday that you totally love, you're probably going to be happy."}, {"time": 3835, "text": "Even though the statistical meaning, one out of 10 is terrible or one out of 20 is terrible from a user point of view because the setting was discovery is fine."}, {"time": 3843, "text": "Sorry to interrupt real quick."}, {"time": 3845, "text": "I just actually learned about Discover Weekly, which is a Spotify, I don't know, it's a feature of Spotify that shows you cool songs to listen to."}, {"time": 3856, "text": "Maybe I can do issue tracking."}, {"time": 3858, "text": "I couldn't find it on my Spotify app."}, {"time": 3860, "text": "It's in your library."}, {"time": 3861, "text": "It's in the library."}, {"time": 3862, "text": "It's in the list of library."}, {"time": 3863, "text": "Because I was like, whoa, this is cool."}, {"time": 3865, "text": "I didn't know this existed."}, {"time": 3866, "text": "And I tried to find it."}, {"time": 3868, "text": "I will show it to you and feedback to our product team."}, {"time": 3871, "text": "There you go."}, {"time": 3872, "text": "But yeah, so yeah, sorry."}, {"time": 3874, "text": "Just to mention the expectation there is basically that you're going to discover new songs."}, {"time": 3882, "text": "So then you can be quite adventurous in the recommendations you do."}, {"time": 3887, "text": "But we have another product called Daily Mix, which kind of implies that these are only going to be your favorites."}, {"time": 3894, "text": "So if you have one out of 10 that is good and nine out of 10 that doesn't work for you, you're going to think it's a horrible product."}, {"time": 3899, "text": "So actually a lot of the product development we learned over the years is about setting the right expectations."}, {"time": 3904, "text": "So for Daily Mix, you know, algorithmically, we would pick among things that feel very safe in your taste space."}, {"time": 3911, "text": "Whereas Discover Weekly, we go kind of wild because the expectation is most of this is not going to."}, {"time": 3916, "text": "So a lot of that, a lot of to answer your question there, a lot of should you let the user pick or not?"}, {"time": 3923, "text": "We have some products where the whole point is that the user can click play, put the phone in the pocket, and it should be really good music for like an hour."}, {"time": 3930, "text": "We have other products where you probably need to say like, no, no, save, no, no."}, {"time": 3935, "text": "And it's very interactive."}, {"time": 3937, "text": "That makes sense."}, {"time": 3938, "text": "And then the radio product, the stations product is one of these like click play, put in your pocket for hours."}, {"time": 3944, "text": "So you're thinking of different test sets for different users and trying to create products that sort of optimize for those test sets that represent a specific set of users."}, {"time": 3957, "text": "Yes, I think one thing that I think is interesting is we invested quite heavily in editorial in people creating playlists using statistical data."}, {"time": 3969, "text": "And that was successful for us."}, {"time": 3970, "text": "And then we also invested in machine learning."}, {"time": 3973, "text": "And for the longest time within Spotify and within the rest of the industry, there was always this narrative of humans versus the machine, algo versus editorial."}, {"time": 3983, "text": "And editors would say like, well, if I had that data, if I could see your playlisting history and I made a choice for you, I would have made a better choice."}, {"time": 3991, "text": "And they would have because they're much smarter than these algorithms."}, {"time": 3995, "text": "The human is incredibly smart compared to our algorithms."}, {"time": 3998, "text": "They can take culture into account and so forth."}, {"time": 4001, "text": "The problem is that they can't make 200 million decisions per hour for every user that logs in."}, {"time": 4007, "text": "So the algo may be not as sophisticated, but much more efficient."}, {"time": 4011, "text": "So there was this contradiction."}, {"time": 4014, "text": "But then a few years ago, we started focusing on this kind of human in the loop thinking around machine learning."}, {"time": 4021, "text": "And we actually coined an internal term for it called algotorial, a combination of algorithms and editors, where if we take a concrete example, you think of the editor, this paid expert that we have that's really good at something like soul, hip hop, EDM, something, right?"}, {"time": 4040, "text": "They're a true expert, no one in the industry."}, {"time": 4042, "text": "So they have all the cultural knowledge."}, {"time": 4044, "text": "You think of them as the product manager."}, {"time": 4046, "text": "And you say that, let's say that you want to create a, you think that there's a product need in the world for something like songs to sing in the car or songs to sing in the shower."}, {"time": 4056, "text": "I'm taking that example because it exists."}, {"time": 4058, "text": "People love to scream songs in the car when they drive, right?"}, {"time": 4062, "text": "So you want to create that product and you have this product manager who's a musical expert."}, {"time": 4066, "text": "They create, they come up with a concept, like I think this is a missing thing in humanity, like a playlist called songs to sing in the car."}, {"time": 4073, "text": "They create the framing, the image, the title, and they create a test set of, they create a group of songs, like a few thousand songs out of the catalog that they manually curate that are known songs that are great to sing in the car."}, {"time": 4087, "text": "And they can take like true romance into account."}, {"time": 4089, "text": "They understand things that our algorithms do not at all."}, {"time": 4092, "text": "So they have this huge set of tracks."}, {"time": 4094, "text": "Then when we deliver that to you, we look at your taste vectors and you get the 20 tracks that are songs to sing in the car in your taste."}, {"time": 4102, "text": "So you have personalization and editorial input in the same process, if that makes sense."}, {"time": 4109, "text": "Yeah, it makes total sense."}, {"time": 4110, "text": "And I have several questions around that."}, {"time": 4112, "text": "This is like fascinating."}, {"time": 4116, "text": "So first, it is a little bit surprising to me that the world expert humans are outperforming machines at specifying songs to sing in the car."}, {"time": 4130, "text": "So maybe you could talk to that a little bit."}, {"time": 4133, "text": "I don't know if you can put it into words, but what is it?"}, {"time": 4137, "text": "How difficult is this problem?"}, {"time": 4141, "text": "Do you really, I guess what I'm trying to ask is there, how difficult is it to encode the cultural references, the context of the song, the artists, all those things together?"}, {"time": 4154, "text": "Can machine learning really not do that?"}, {"time": 4157, "text": "I mean, I think machine learning is great at replicating patterns if you have the patterns."}, {"time": 4163, "text": "But if you try to write with me a spec of what song's greatest song to sing in the car definition is, is it loud?"}, {"time": 4170, "text": "Does it have many choruses?"}, {"time": 4171, "text": "Should it have been in movies?"}, {"time": 4172, "text": "It quickly gets incredibly complicated, right?"}, {"time": 4176, "text": "And a lot of it may not be in the structure of the song or the title."}, {"time": 4180, "text": "It could be cultural references because, you know, it was a history."}, {"time": 4184, "text": "So the definition problems quickly get, and I think that was the insight of Andrew Ng when he said the job of the product manager is to understand these things that algorithms don't and then define what that looks like."}, {"time": 4198, "text": "And then you have something to train towards, right?"}, {"time": 4200, "text": "Then you have kind of the test set."}, {"time": 4202, "text": "And then so today the editors create this pool of tracks and then we personalize."}, {"time": 4206, "text": "You could easily imagine that once you have this set, you could have some automatic exploration on the rest of the catalog because then you understand what it is."}, {"time": 4214, "text": "And then the other side of it, when machine learning does help is this taste vector."}, {"time": 4220, "text": "How hard is it to construct a vector that represents the things an individual human likes, this human preference?"}, {"time": 4230, "text": "So you can, you know, music isn't like, it's not like Amazon, like things you usually buy."}, {"time": 4238, "text": "Music seems more amorphous."}, {"time": 4239, "text": "Like it's this thing that's hard to specify."}, {"time": 4242, "text": "Like what is, you know, if you look at my playlist, what is the music that I love?"}, {"time": 4248, "text": "It's harder."}, {"time": 4249, "text": "It seems to be much more difficult to specify concretely."}, {"time": 4254, "text": "So how hard is it to build a taste vector?"}, {"time": 4257, "text": "It is very hard in the sense that you need a lot of data."}, {"time": 4260, "text": "And I think what we found was that, so it's not a stationary problem."}, {"time": 4266, "text": "It changes over time."}, {"time": 4268, "text": "And so we've gone through the journey of, if you've done a lot of computer vision, obviously I've done a bunch of computer vision in my past."}, {"time": 4278, "text": "And we started kind of with the handcrafted heuristics for, you know, this is kind of indie music."}, {"time": 4284, "text": "This is this."}, {"time": 4285, "text": "And if you consume this, you'd probably like this."}, {"time": 4287, "text": "So we have, we started there and we have some of that still."}, {"time": 4291, "text": "Then what was interesting about the playlist data was that you could find these latent things that wouldn't necessarily even make sense to you."}, {"time": 4298, "text": "That could even capture maybe cultural references because they cooccurred."}, {"time": 4302, "text": "Things that wouldn't have appeared kind of mechanistically either in the content or so forth."}, {"time": 4308, "text": "So I think that, I think the core assumption is that there are patterns in almost everything."}, {"time": 4322, "text": "And if there are patterns, these embedding techniques are getting better and better now."}, {"time": 4326, "text": "Now, as everyone else, we're also using kind of deep embeddings where you can encode binary values and so forth."}, {"time": 4334, "text": "And what I think is interesting is this process to try to find things that do not necessarily, you wouldn't actually have guessed."}, {"time": 4343, "text": "So it is very hard in an engineering sense to find the right dimensions."}, {"time": 4348, "text": "It's an incredible scalability problem to do for hundreds of millions of users and to update it every day."}, {"time": 4355, "text": "But in theory, in theory embeddings isn't that complicated."}, {"time": 4362, "text": "The fact that you try to find some principal components or something like that, dimensionality reduction and so forth."}, {"time": 4367, "text": "So the theory, I guess, is easy."}, {"time": 4368, "text": "The practice is very, very hard."}, {"time": 4370, "text": "And it's a huge engineering challenge."}, {"time": 4373, "text": "But fortunately, we have some amazing both research and engineering teams in this space."}, {"time": 4378, "text": "Yeah, I guess the question is all, I mean, it's similar."}, {"time": 4383, "text": "I deal with it with autonomous vehicle spaces."}, {"time": 4385, "text": "The question is how hard is driving?"}, {"time": 4387, "text": "And here is basically the question is of edge cases."}, {"time": 4394, "text": "So embedding probably works, not probably, but I would imagine works well in a lot of cases."}, {"time": 4404, "text": "So there's a bunch of questions that arise then."}, {"time": 4405, "text": "So do song preferences, does your taste vector depend on context, like mood, right?"}, {"time": 4413, "text": "So there's different moods, and so how does that take in it?"}, {"time": 4421, "text": "Is it possible to take that as a consideration?"}, {"time": 4424, "text": "Or do you just leave that as a interface problem that allows the user to just control it?"}, {"time": 4429, "text": "So when I'm looking for workout music, I kind of specify it by choosing certain playlists, doing certain search."}, {"time": 4436, "text": "Yeah, so that's a great point."}, {"time": 4438, "text": "Back to the product development."}, {"time": 4440, "text": "You could try to spend a few years trying to predict which mood you're in automatically when you open Spotify, or you create a tab which is happy and sad, right?"}, {"time": 4448, "text": "And you're going to be right 100% of the time with one click."}, {"time": 4450, "text": "Now, it's probably much better to let the user tell you if they're happy or sad, or if they want to work out."}, {"time": 4455, "text": "On the other hand, if your user interface becomes 2,000 tabs, you're introducing so much friction so no one will use the product."}, {"time": 4462, "text": "So then you have to get better."}, {"time": 4464, "text": "So it's this thing where you have to be able to get better."}, {"time": 4466, "text": "So then you have to get better, so it's this thing where I think maybe it was, I don't remember who coined it, but it's called fault tolerant UIs, right?"}, {"time": 4475, "text": "You build a UI that is tolerant of being wrong, and then you can be much less right in your algorithms."}, {"time": 4483, "text": "So we've had to learn a lot of that."}, {"time": 4485, "text": "Building the right UI that fits where the machine learning is, and a great discovery there, which was by the teams during one of our hack days, was this thing of taking discovery, packaging it into a playlist, and saying that these are new tracks that we think you might like based on this."}, {"time": 4505, "text": "And setting the right expectation made it a great product."}, {"time": 4509, "text": "So I think we have this benefit that, for example, Tesla doesn't have that we can change the expectation."}, {"time": 4516, "text": "We can build a fault tolerant setting."}, {"time": 4518, "text": "It's very hard to be fault tolerant when you're driving at 100 miles per hour or something."}, {"time": 4523, "text": "And we have the luxury of being able to say that of being wrong if we have the right UI, which gives us different abilities to take more risk."}, {"time": 4533, "text": "So I actually think the self driving problem is much harder."}, {"time": 4537, "text": "Oh, yeah, for sure."}, {"time": 4539, "text": "It's much less fun because people die."}, {"time": 4545, "text": "And in Spotify, it's such a more fun problem because failure is beautiful in a way."}, {"time": 4555, "text": "It leads to exploration."}, {"time": 4556, "text": "So it's a really fun reinforcement learning problem."}, {"time": 4558, "text": "The worst case scenario is you get these WTF tweets like, how did I get this?"}, {"time": 4562, "text": "This song, yeah."}, {"time": 4563, "text": "Which is a lot better than the self driving."}, {"time": 4565, "text": "Exactly, so what's the feedback that a user, what's the signal that a user provides into the system?"}, {"time": 4575, "text": "So you mentioned skipping."}, {"time": 4579, "text": "What is like the strongest signal?"}, {"time": 4582, "text": "You didn't mention clicking like."}, {"time": 4584, "text": "So we have a few signals that are important."}, {"time": 4587, "text": "Obviously playing, playing through."}, {"time": 4590, "text": "So one of the benefits of music, actually, even compared to podcasts or movies is the object itself is really only about three minutes."}, {"time": 4599, "text": "So you get a lot of chances to recommend and the feedback loop is every three minutes instead of every two hours or something."}, {"time": 4605, "text": "So you actually get kind of noisy, but quite fast feedback."}, {"time": 4610, "text": "And so you can see if people play through, which is the inverse of skip really."}, {"time": 4615, "text": "That's an important signal."}, {"time": 4616, "text": "On the other hand, much of the consumption happens when your phone is in your pocket."}, {"time": 4620, "text": "Maybe you're running or driving or you're playing on a speaker."}, {"time": 4623, "text": "And so you not skipping doesn't mean that you love that song."}, {"time": 4625, "text": "It may be that it wasn't bad enough that you would walk up and skip."}, {"time": 4628, "text": "So it's a noisy signal."}, {"time": 4630, "text": "Then we have the equivalent of the like, which is you saved it to your library."}, {"time": 4634, "text": "That's a pretty strong signal of affection."}, {"time": 4636, "text": "And then we have the more explicit signal of playlisting."}, {"time": 4641, "text": "Like you took the time to create a playlist, you put it in there."}, {"time": 4643, "text": "There's a very little small chance that if you took all that trouble, this is not a really important track to you."}, {"time": 4650, "text": "And then we understand also what are the tracks it relates to."}, {"time": 4654, "text": "So we have the playlisting, we have the like, and then we have the listening or skip."}, {"time": 4659, "text": "And you have to have very different approaches to all of them because of different levels of noise."}, {"time": 4664, "text": "One is very voluminous, but noisy, and the other is rare, but you can probably trust it."}, {"time": 4669, "text": "Yeah, it's interesting because I think between those signals captures all the information you'd want to capture."}, {"time": 4677, "text": "I mean, there's a feeling, a shallow feeling for me that there's sometimes that I'll hear a song that's like, yes, this is, you know, this was the right song for the moment."}, {"time": 4685, "text": "But there's really no way to express that fact except by listening through it all the way and maybe playing it again at that time or something."}, {"time": 4694, "text": "But there's no need for a button that says this was the best song I could have heard at this moment."}, {"time": 4700, "text": "Well, we're playing around with that, with kind of the thumbs up concept saying like, I really like this."}, {"time": 4705, "text": "Just kind of talking to the algorithm."}, {"time": 4707, "text": "It's unclear if that's the best way for humans to interact."}, {"time": 4710, "text": "Maybe it is."}, {"time": 4711, "text": "Maybe they should think of Spotify as a person, an agent sitting there trying to serve you and you can say like, bad Spotify, good Spotify."}, {"time": 4718, "text": "Right now, the analogy we've had is more, you shouldn't think of us."}, {"time": 4722, "text": "We should be invisible."}, {"time": 4724, "text": "And the feedback is if you save it, it's kind of you work for yourself."}, {"time": 4728, "text": "You do a playlist because you think it's great and we can learn from that."}, {"time": 4730, "text": "It's kind of back to Tesla, how they kind of have this shadow mode."}, {"time": 4735, "text": "They sit in what you drive."}, {"time": 4736, "text": "We kind of took the same analogy."}, {"time": 4738, "text": "We sit in what you playlist and then maybe we can offer you an autopilot where you can take over for a while or something like that."}, {"time": 4744, "text": "And then back off if you say like, that's not good enough."}, {"time": 4748, "text": "But I think it's interesting to figure out what your mental model is."}, {"time": 4751, "text": "If Spotify is an AI that you talk to, which I think might be a bit too abstract for many consumers, or if you still think of it as it's my music app, but it's just more helpful."}, {"time": 4764, "text": "And it depends on the device it's running on, which brings us to smart speakers."}, {"time": 4771, "text": "So I have a lot of the Spotify listening I do is on devices I can talk to, whether it's from Amazon, Google or Apple."}, {"time": 4779, "text": "What's the role of Spotify on those devices?"}, {"time": 4782, "text": "How do you think of it differently than on the phone or on the desktop?"}, {"time": 4787, "text": "There are a few things to say about the first of all, it's incredibly exciting."}, {"time": 4792, "text": "They're growing like crazy, especially here in the US."}, {"time": 4798, "text": "And it's solving a consumer need that I think is, you can think of it as just remote interactivity."}, {"time": 4809, "text": "You can control this thing from across the room."}, {"time": 4811, "text": "And it may feel like a small thing, but it turns out that friction matters to consumers being able to say play, pause and so forth from across the room is very powerful."}, {"time": 4822, "text": "So basically, you made the living room interactive now."}, {"time": 4826, "text": "And what we see in our data is that the number one use case for these speakers is music, music and podcast."}, {"time": 4834, "text": "So fortunately for us, it's been important to these companies to have those use case covered."}, {"time": 4840, "text": "So they want to Spotify on this."}, {"time": 4842, "text": "We have very good relationships with them."}, {"time": 4845, "text": "And we're seeing tremendous success with them."}, {"time": 4851, "text": "What I think is interesting about them is it's already working."}, {"time": 4857, "text": "We kind of had this epiphany many years ago, back when we started using Sonos."}, {"time": 4862, "text": "If you went through all the trouble of setting up your Sonos system, you had this magical experience where you had all the music ever made in your living room."}, {"time": 4870, "text": "And we made this assumption that the home, everyone used to have a CD player at home, but they never managed to get their files working in the home."}, {"time": 4879, "text": "Having this network attached storage was too cumbersome for most consumers."}, {"time": 4882, "text": "So we made the assumption that the home would skip from the CD all the way to streaming books, where you would buy the steering and would have all the music built in."}, {"time": 4891, "text": "That took longer than we thought."}, {"time": 4892, "text": "But with the voice speakers, that was the unlocking that made kind of the connected speaker happen in the home."}, {"time": 4899, "text": "So it really exploded."}, {"time": 4901, "text": "And we saw this engagement that we predicted would happen."}, {"time": 4905, "text": "What I think is interesting, though, is where it's going from now."}, {"time": 4909, "text": "Right now, you think of them as voice speakers."}, {"time": 4911, "text": "But I think if you look at Google I.O., for example, they just added a camera to it, where when the alarm goes off, instead of saying, hey, Google, stop, you can just wave your hand."}, {"time": 4925, "text": "So I think they're going to think more of it as an agent or as an assistant, truly an assistant."}, {"time": 4932, "text": "And an assistant that can see you is going to be much more effective than a blind assistant."}, {"time": 4937, "text": "So I think these things will morph."}, {"time": 4938, "text": "And we won't necessarily think of them as, quote unquote, voice speakers anymore."}, {"time": 4942, "text": "Just as interactive access to the Internet in the home."}, {"time": 4949, "text": "But I still think that the biggest use case for those will be audio."}, {"time": 4954, "text": "So for that reason, we're investing heavily in it."}, {"time": 4956, "text": "And we built our own NLU stack to be able to the challenge here is, how do you innovate in that world?"}, {"time": 4964, "text": "It lowers friction for consumers, but it's also much more constrained."}, {"time": 4968, "text": "You have no pixels to play with in an audio only world."}, {"time": 4971, "text": "It's really the vocabulary that is the interface."}, {"time": 4974, "text": "So we started investing and playing around quite a lot with that, trying to understand what the future will be of you speaking and gesturing and waving at your music."}, {"time": 4983, "text": "And actually, you're actually nudging closer to the autonomous vehicle space because from everything I've seen, the level of frustration people experience upon failure of natural language understanding is much higher than failure in other contexts."}, {"time": 4998, "text": "People get frustrated really fast."}, {"time": 5000, "text": "So if you screw that experience up even just a little bit, they give up really quickly."}, {"time": 5006, "text": "And I think you see that in the data."}, {"time": 5008, "text": "While it's tremendously successful, the most common interactions are play, pause and next."}, {"time": 5016, "text": "The things where if you compare it to taking up your phone, unlocking it, bringing up the app and skipping, clicking skip, it was much lower friction."}, {"time": 5024, "text": "But then for longer, more complicated things like, can you find me that song about the people still bring up the phone and search and then play it on their speaker?"}, {"time": 5031, "text": "So we tried again to build a fault tolerant UI where for the more complicated things, you can still pick up your phone, have powerful full keyboard search and then try to optimize for where there is actually lower friction and try to it's kind of like the test autopilot thing."}, {"time": 5047, "text": "You have to be at the level where you're helpful."}, {"time": 5051, "text": "If you're too smart and just in the way, people are going to get frustrated."}, {"time": 5055, "text": "And first of all, I'm not obsessed with stairway to heaven."}, {"time": 5058, "text": "It's just a good song."}, {"time": 5059, "text": "But let me mention that as a use case because it's an interesting one."}, {"time": 5062, "text": "I've literally told one of I don't want to say the name of the speaker because when people are listening to it, it'll make their speaker go off."}, {"time": 5070, "text": "But I talked to the speaker and I say play stairway to heaven."}, {"time": 5074, "text": "And every time it like not every time, but a large percentage of the time plays the wrong stairway to heaven."}, {"time": 5081, "text": "It plays like some cover of the and that part of the experience."}, {"time": 5088, "text": "I actually wonder from a business perspective, does Spotify control that entire experience or no?"}, {"time": 5096, "text": "It seems like the NLU, the natural language stuff is controlled by the speaker and then Spotify stays at a layer below that."}, {"time": 5104, "text": "It's a good and complicated question."}, {"time": 5107, "text": "Some of which is dependent on the on the partners."}, {"time": 5111, "text": "So it's hard to comment on the on the specifics."}, {"time": 5113, "text": "But the question is the right one."}, {"time": 5115, "text": "The challenge is if you can't use any of the personalization, I mean, we know which stairway to heaven."}, {"time": 5121, "text": "And the truth is maybe for for one person, it is exactly the cover that they want."}, {"time": 5126, "text": "And they would be very frustrated if a place I think we I think we default to the right version."}, {"time": 5131, "text": "But but you actually want to be able to do the cover for the person that just played the cover 50 times."}, {"time": 5136, "text": "Or Spotify is just going to seem stupid."}, {"time": 5138, "text": "So you want to be able to leverage the personalization."}, {"time": 5140, "text": "But you have this stack where you have the the ASR and this thing called the end best list of the best guesses here."}, {"time": 5148, "text": "And then the position comes in at the end."}, {"time": 5150, "text": "You actually want the person to be here when you're guessing about what they actually meant."}, {"time": 5154, "text": "So we're working with these partners and it's a complicated it's a complicated thing where you want to you want to be able."}, {"time": 5162, "text": "So first of all, you want to be very careful with your users data."}, {"time": 5166, "text": "You don't want to share your users data without the permission."}, {"time": 5169, "text": "But you want to share some data so that their experience gets better."}, {"time": 5172, "text": "So that these partners can understand enough, but not too much and so forth."}, {"time": 5176, "text": "So it's really the trick is that it's like a business driven relationship where you're doing product development across companies together, which is which is really complicated."}, {"time": 5186, "text": "But this is exactly why we built our own NLU so that we actually can make personalized guesses, because this is the biggest frustration from a user point of view."}, {"time": 5196, "text": "They don't understand about ASR and best list and and business deals."}, {"time": 5200, "text": "They're like, how hard can it be?"}, {"time": 5201, "text": "I was told this thing 50 times this version and still the place the wrong thing."}, {"time": 5205, "text": "It can't it can't be hard."}, {"time": 5207, "text": "So we try to take the user approach."}, {"time": 5208, "text": "If the user the user is not going to understand the complications of business, we have to solve it."}, {"time": 5213, "text": "So let's talk about sort of a complicated subject that I myself I'm quite torn about the idea sort of of paying artists."}, {"time": 5229, "text": "I saw as of August 31st, 2018, over 11 billion dollars were paid to rights holders."}, {"time": 5237, "text": "So and further distributed to artists from Spotify."}, {"time": 5241, "text": "So a lot of money is being paid to artists."}, {"time": 5243, "text": "First of all, the whole time as a consumer for me, when I look at Spotify, I'm not sure I'm remembering correctly, but I think you said exactly how I feel, which is this is too good to be true."}, {"time": 5256, "text": "Like when I start using Spotify, I assume you guys will go bankrupt in like a month."}, {"time": 5263, "text": "It's like this is too good."}, {"time": 5264, "text": "A lot of people did."}, {"time": 5267, "text": "I was like, this is amazing."}, {"time": 5268, "text": "So one question I have is sort of the bigger question."}, {"time": 5273, "text": "How do you make money in this complicated world?"}, {"time": 5275, "text": "How do you deal with the relationship with record labels who are complicated?"}, {"time": 5284, "text": "These big you're essentially have the task of herding cats, but like rich and powerful powerful cats, and also have the task of paying artists enough and paying those labels enough and still making money in the Internet space where people are not willing to pay hundreds of dollars a month."}, {"time": 5307, "text": "So how do you navigate the space?"}, {"time": 5310, "text": "How do you navigate?"}, {"time": 5311, "text": "That's a beautiful description."}, {"time": 5312, "text": "Herding rich cats."}, {"time": 5314, "text": "That before."}, {"time": 5317, "text": "It is very complicated, and I think certainly actually betting against Spotify has been statistically a very smart thing to do."}, {"time": 5325, "text": "Just looking at the at the line of roadkill in music streaming services, it's it's kind of I think if I understood the complexity when I joined Spotify, unfortunately, fortunately, I didn't know enough about the music industry to understand the complexities, because then I would have made a more rational guess that it wouldn't work."}, {"time": 5346, "text": "So, you know, ignorance is bliss."}, {"time": 5348, "text": "But I think there have been a few distinct challenges."}, {"time": 5353, "text": "I think, as I said, one of the things that made it work at all was that Sweden and the Nordics was a lost market."}, {"time": 5359, "text": "So there was no risk for labels to try this."}, {"time": 5365, "text": "I don't think it would have worked if if the market was healthy."}, {"time": 5369, "text": "So that was the initial condition."}, {"time": 5373, "text": "Then we had this tremendous challenge with the model itself."}, {"time": 5376, "text": "So now most people were pirating."}, {"time": 5379, "text": "But for the people who bought a download or a CD, the artists would get all the revenue for all the future plays then, right?"}, {"time": 5388, "text": "So you got it all up front, whereas the streaming model was like almost nothing day one, almost nothing day two."}, {"time": 5392, "text": "And then at some point, this curve of incremental revenue would intersect with your day one payment."}, {"time": 5399, "text": "And that took a long time to play out before before the music labels, they understood that."}, {"time": 5405, "text": "But on the artist side, it took a lot of time to understand that actually, if I have a big hit that is going to be played for many years, this is a much better model because I get paid based on how much people use the product, not how much they thought they would use it day one or so forth."}, {"time": 5420, "text": "So it was a complicated model to get across."}, {"time": 5422, "text": "But time helped with that."}, {"time": 5424, "text": "And now the revenues to the music industry actually are bigger again than it's gone through this incredible dip and now they're back up."}, {"time": 5432, "text": "And so we're very proud of having been a part of that."}, {"time": 5437, "text": "So there have been distinct problems."}, {"time": 5439, "text": "I think when it comes to the labels, we have taken the painful approach."}, {"time": 5446, "text": "Some of our competition at the time, they kind of looked at other companies and said, if we just ignore the rights, we get really big, really fast."}, {"time": 5456, "text": "We're going to be too big for the labels to kind of, too big to fail."}, {"time": 5460, "text": "They're not going to kill us."}, {"time": 5461, "text": "We didn't take that approach."}, {"time": 5462, "text": "We went legal from day one and we negotiated and negotiated and negotiated."}, {"time": 5466, "text": "It was very slow."}, {"time": 5467, "text": "It was very frustrating."}, {"time": 5468, "text": "We were angry at seeing other companies taking shortcuts and seeming to get away with it."}, {"time": 5472, "text": "It was this game theory thing where over many rounds of playing the game, this would be the right strategy."}, {"time": 5479, "text": "And even though clearly there's a lot of frustrations at times during renegotiations, there is this there is this weird trust where we have been honest and fair."}, {"time": 5491, "text": "We've never screwed them."}, {"time": 5492, "text": "They've never screwed us."}, {"time": 5493, "text": "It's 10 years, but there's this trust and like they know that if music doesn't get really big, if lots of people do not want to listen to music and want to pay for it, Spotify has no business model."}, {"time": 5504, "text": "So we actually are incredibly aligned."}, {"time": 5508, "text": "Other companies, not to be tense, but other companies have other business models where even if they made no money from music, they'd still be profitable companies."}, {"time": 5516, "text": "But Spotify won't."}, {"time": 5517, "text": "So I think the industry sees that we are actually aligned business wise."}, {"time": 5523, "text": "So there is this trust that allows us to do product development, even if it's scary, taking risks."}, {"time": 5532, "text": "The free model itself was an incredible risk for the music industry to take that they should get credit for."}, {"time": 5537, "text": "Now, some of it was that they had nothing to lose in the game."}, {"time": 5540, "text": "Some of it was that they had nothing to lose in Sweden."}, {"time": 5542, "text": "But frankly, a lot of the labels also took risk."}, {"time": 5545, "text": "And so I think we built up that trust with I think herding of cats sounds a bit."}, {"time": 5552, "text": "What's the word?"}, {"time": 5553, "text": "It sounds like dismissive of the cats."}, {"time": 5555, "text": "Dismissive."}, {"time": 5555, "text": "No, every cat matters."}, {"time": 5557, "text": "They're all beautiful and very important."}, {"time": 5559, "text": "They've taken a lot of risks and certainly it's been frustrating."}, {"time": 5564, "text": "So it's really like playing it's game theory."}, {"time": 5567, "text": "If you play the game many times, then you can have the statistical outcome that you bet on."}, {"time": 5574, "text": "And it feels very painful when you're in the middle of that thing."}, {"time": 5577, "text": "I mean, there's risk, there's trust, there's relationships."}, {"time": 5580, "text": "From just having read the biography of Steve Jobs, similar kind of relationships were discussed in iTunes."}, {"time": 5588, "text": "The idea of selling a song for a dollar was very uncomfortable for labels."}, {"time": 5593, "text": "And there was no, it was the same kind of thing."}, {"time": 5596, "text": "It was trust, it was game theory as a lot of relationships that had to be built."}, {"time": 5601, "text": "And it's really a terrifyingly difficult process that Apple could go through a little bit because they could afford for that process to fail."}, {"time": 5612, "text": "For Spotify, it seems terrifying because you can't."}, {"time": 5617, "text": "Initially, I think a lot of it comes down to honestly Daniel and his tenacity in negotiating, which seems like an impossible task because he was completely unknown and so forth."}, {"time": 5630, "text": "But maybe that was also the reason that it worked."}, {"time": 5636, "text": "But I think game theory is probably the best way to think about it."}, {"time": 5643, "text": "You could go straight for this Nash equilibrium that someone is going to defect or you play it many times, you try to actually go for the top left, the corporations sell."}, {"time": 5654, "text": "Is there any magical reason why Spotify seems to have won this?"}, {"time": 5660, "text": "So a lot of people have tried to do what Spotify tried to do and Spotify has come out."}, {"time": 5665, "text": "Well, so the answer is that there's no magical reason because I don't believe in magic."}, {"time": 5670, "text": "But I think there are there are reasons."}, {"time": 5672, "text": "And I think some of them are that people have misunderstood a lot of what we actually do."}, {"time": 5680, "text": "The actual Spotify model is very complicated."}, {"time": 5683, "text": "They've looked at the premium model and said, it seems like you can charge $9.99 for music and people are going to pay, but that's not what happened."}, {"time": 5692, "text": "Actually, when we launched the original mobile product, everyone said they would never pay."}, {"time": 5696, "text": "What happened was they started on the free product and then their engagement grew so much that eventually they said, maybe it is worth $9.99, right?"}, {"time": 5705, "text": "It's your propensity to pay gross with your engagement."}, {"time": 5708, "text": "So we have this super complicated business model."}, {"time": 5711, "text": "We operate two different business models, advertising and premium at the same time."}, {"time": 5715, "text": "And I think that is hard to replicate."}, {"time": 5717, "text": "I struggle to think of other companies that run large scale advertising and subscription products at the same time."}, {"time": 5724, "text": "So I think the business model is actually much more complicated than people think it is."}, {"time": 5728, "text": "And so some people went after just the premium part without the free part and ran into a wall where no one wanted to pay."}, {"time": 5735, "text": "Some people went after just music should be free, just ads, which doesn't give you enough revenue and doesn't work for the music industry."}, {"time": 5742, "text": "So I think that combination is kind of opaque from the outside."}, {"time": 5746, "text": "So maybe I shouldn't say it here and reveal the secret, but that turns out to be hard to replicate than you would think."}, {"time": 5754, "text": "So there's a lot of brilliant business strategies out there."}, {"time": 5757, "text": "Brilliant business strategy here."}, {"time": 5760, "text": "Brilliance or luck?"}, {"time": 5761, "text": "Probably more luck, but it doesn't really matter."}, {"time": 5763, "text": "It looks brilliant in retrospect."}, {"time": 5765, "text": "Let's call it brilliant."}, {"time": 5767, "text": "Yeah, when the books are written, they'll be brilliant."}, {"time": 5770, "text": "You've mentioned that your philosophy is to embrace change."}, {"time": 5776, "text": "So how will the music streaming and music listening world change over the next 10 years, 20 years?"}, {"time": 5784, "text": "You look out into the far future."}, {"time": 5788, "text": "I think that music and for that matter, audio podcasts, audiobooks, I think it's one of the few core human needs."}, {"time": 5797, "text": "I think it there is no good reason to me why it shouldn't be at the scale of something like messaging or social networking."}, {"time": 5804, "text": "I don't think it's a niche thing to listen to music or news or something."}, {"time": 5808, "text": "So I think scale is obviously one of the things that I really hope for."}, {"time": 5810, "text": "I think I hope that it's going to be billions of users."}, {"time": 5814, "text": "I hope eventually everyone in the world gets access to all the world's music ever made."}, {"time": 5818, "text": "So obviously, I think it's going to be a much bigger business."}, {"time": 5821, "text": "Otherwise, we wouldn't be betting this big."}, {"time": 5825, "text": "Now, if you look more at how it is consumed, what I'm hoping is back to this analogy of the software tool chain, where I think I sometimes internally I make this analogy to text messaging."}, {"time": 5842, "text": "Text messaging was also based on standards in the area of mobile carriers."}, {"time": 5848, "text": "You had the SMS, the 140 character, 120 character SMS."}, {"time": 5853, "text": "And it was great because everyone agreed on the standards."}, {"time": 5856, "text": "So as a consumer, you got a lot of distributions and interoperability, but it was a very constrained format."}, {"time": 5861, "text": "And when the industry wanted to add pictures to that format to do the MMS, I looked it up and I think it took from the late 80s to early 2000s."}, {"time": 5868, "text": "This is like a 15, 20 year product cycle to bring pictures into that."}, {"time": 5873, "text": "Now, once that entire value chain of creation and consumption got wrapped in one software stack within something like Snapchat or WhatsApp, the first week they added disappearing messages."}, {"time": 5887, "text": "Then two weeks later, they added stories."}, {"time": 5889, "text": "The pace of innovation when you're on one software stack and you can affect both creation and consumption, I think it's going to be rapid."}, {"time": 5897, "text": "So with these streaming services, we now, for the first time in history, have enough, I hope, people on one of these services."}, {"time": 5905, "text": "Actually, whether it's Spotify or Amazon or Apple or YouTube, and hopefully enough creators that you can actually start working with the format again."}, {"time": 5912, "text": "And that excites me."}, {"time": 5913, "text": "I think being able to change these constraints from 100 years, that could really do something interesting."}, {"time": 5920, "text": "I really hope it's not just going to be the iteration on the same thing for the next 10 to 20 years as well."}, {"time": 5927, "text": "Yeah, changing the creation of music, the creation of audio, the creation of podcasts is a really fascinating possibility."}, {"time": 5934, "text": "I myself don't understand what it is about podcasts that's so intimate."}, {"time": 5939, "text": "It just is."}, {"time": 5940, "text": "I listen to a lot of podcasts."}, {"time": 5941, "text": "I think it touches on a deep human need for connection that people do feel like they're connected to when they listen."}, {"time": 5952, "text": "I don't understand what the psychology of that is, but in this world that's becoming more and more disconnected, it feels like this is fulfilling a certain kind of need."}, {"time": 5964, "text": "And empowering the creator as opposed to just the listener is really interesting."}, {"time": 5972, "text": "I'm really excited that you're working on this."}, {"time": 5974, "text": "Yeah, I think one of the things that is inspiring for our teams to work on podcasts is exactly that, whether you think, like I probably do, that it's something biological about perceiving to be in the middle of the conversation that makes you listen in a different way."}, {"time": 5988, "text": "People seem to perceive it differently."}, {"time": 5990, "text": "And there was this narrative for a long time that if you look at video, everything kind of in the foreground, it got shorter and shorter and shorter because of financial pressures and monetization and so forth."}, {"time": 6001, "text": "And eventually, at the end, there's almost like 20 seconds clip, people just screaming something and I feel really good about the fact that you could have interpreted that as people have no attention span anymore."}, {"time": 6016, "text": "They don't want to listen to things."}, {"time": 6018, "text": "They're not interested in deeper stories."}, {"time": 6022, "text": "People are getting dumber."}, {"time": 6023, "text": "But then podcasts came along and it's almost like, no, no, the need still existed."}, {"time": 6028, "text": "But maybe it was the fact that you're not prepared to look at your phone like this for two hours."}, {"time": 6032, "text": "But if you can drive at the same time, it seems like people really want to dig deeper and they want to hear like the more complicated version."}, {"time": 6038, "text": "So to me, that is very inspiring that that podcast is actually long form."}, {"time": 6042, "text": "It gives me a lot of hope for humanity that people seem really interested in hearing deeper, more complicated conversations."}, {"time": 6049, "text": "This is I don't understand it."}, {"time": 6053, "text": "So the majority for this podcast, listen to the whole thing."}, {"time": 6057, "text": "This whole conversation we've been talking for an hour and 45 minutes."}, {"time": 6062, "text": "And somebody will I mean, most people will be listening to these words I'm speaking right now."}, {"time": 6067, "text": "You wouldn't have thought that 10 years ago with where the world seemed to go."}, {"time": 6070, "text": "That's very positive, I think."}, {"time": 6072, "text": "That's really exciting."}, {"time": 6073, "text": "And empowering the creator there is really exciting."}, {"time": 6078, "text": "You also have a passion for just mobile in general."}, {"time": 6082, "text": "How do you see the smartphone world, the digital space of smartphones and just everything that's on the move, whether it's Internet of Things and so on, changing over the next 10 years and so on?"}, {"time": 6101, "text": "I think that one way to think about it is that computing might be moving out of these multipurpose devices, the computer we had and the phone, into specific purpose devices."}, {"time": 6115, "text": "And it will be ambient that at least in my home, you just shout something at someone and there's always one of these speakers close enough."}, {"time": 6123, "text": "And so you start behaving differently."}, {"time": 6126, "text": "It's as if you have the Internet ambient, ambiently around you and you can ask it things."}, {"time": 6131, "text": "So I think computing will kind of get more integrated and we won't necessarily think of it as connected to a device in the same way that we do today."}, {"time": 6141, "text": "I don't know the path to that."}, {"time": 6142, "text": "Maybe we used to have these desktop computers and then we partially replaced that with the laptops and left the desktop at home when I work."}, {"time": 6152, "text": "And then we got these phones and we started leaving the mobile phones."}, {"time": 6157, "text": "We had the desktop at home when I work and then we got these phones and we started leaving the laptop at home for a while."}]}]