[{"title": "Cumrun Vafa: String Theory | Lex Fridman Podcast #204", "id": "j4_VyRDOmN4", "quotes": [{"time": 341, "text": "And then later, Euler and Lagrange reformulated Newtonian mechanics in a totally different way in the following fashion."}, {"time": 350, "text": "They said, if you take, if you wanna know where a particle at this point and at this time, how does it get to this point at the later time, is the following."}, {"time": 358, "text": "You take all possible paths connecting this particle from going from the initial point to the final point, and you compute the action."}, {"time": 367, "text": "And what is an action?"}, {"time": 368, "text": "Action is the integral over time of the kinetic term of the particle minus its potential."}, {"time": 375, "text": "So you take this integral, and each path will give you some quantity."}, {"time": 379, "text": "And the path it actually takes, the physical path, is the one which minimizes this integral or this action."}, {"time": 386, "text": "Now, this sounded like a backward step from Newton's."}, {"time": 389, "text": "Newton's formula seemed very simple."}, {"time": 392, "text": "F equals to ma, and you can write F is minus the gradient of the potential."}, {"time": 396, "text": "So why would anybody start formulating such a simple thing in terms of this complicated looking principle?"}, {"time": 403, "text": "You have to study the space of all paths and all things and find the minimum, and then you get the same equation."}, {"time": 410, "text": "So Euler and Lagrange's formulation of Newton, which was kind of recasting in this language, is just a consequence of Newton's law."}, {"time": 418, "text": "F equals to ma gives you the same fact that this path is a minimum action."}, {"time": 422, "text": "Now, what we learned later, last century, was that when we deal with quantum mechanics, Newton's law is only an average correct."}, {"time": 432, "text": "And the particle going from one to the other doesn't take exactly one path."}, {"time": 437, "text": "It takes all the paths with the amplitude, which is proportional to the exponential of the action times an imaginary number, i."}, {"time": 446, "text": "And so this fact turned out to be the reformulation of quantum mechanics."}, {"time": 450, "text": "We should start there as the basis of the new law, which is quantum mechanics, and Newton is only an approximation on the average correct."}, {"time": 457, "text": "And when you say amplitude, you mean probability?"}, {"time": 460, "text": "Yes, the amplitude means if you sum up all these paths with exponential i times the action, if you sum this up, you get the number, complex number."}, {"time": 468, "text": "You square the norm of this complex number, gives you a probability to go from one to the other."}, {"time": 472, "text": "Is there ways in which mathematics can lead us astray when we use it as a tool to understand the physical world?"}, {"time": 481, "text": "Yes, I would say that mathematics can lead us astray as much as old physical ideas can lead us astray."}, {"time": 488, "text": "So if you get stuck in something, then you can easily fool yourself that just like the thought process, we have to free ourselves of that."}, {"time": 497, "text": "Sometimes math does that role, like say, oh, this is such a beautiful math."}, {"time": 500, "text": "I definitely want to use it somewhere."}, {"time": 502, "text": "And so you just get carried away and you just get maybe carried too far away."}, {"time": 505, "text": "So that is certainly true, but I wouldn't say it's more dangerous than old physical ideas."}, {"time": 510, "text": "To me, new math ideas is as much potential to lead us astray as old physical ideas, which could be long held principles of physics."}, {"time": 518, "text": "So I'm just saying that we should keep an open mind about the role the math plays, not to be antagonistic towards it and not to over, over welcoming it."}, {"time": 528, "text": "We should just be open to possibilities."}, {"time": 531, "text": "What about looking at a particular characteristics of both physical ideas and mathematical ideas, which is beauty?"}, {"time": 536, "text": "You think beauty leads us astray, meaning, and you offline showed me a really nice puzzle that illustrates this idea a little bit."}, {"time": 546, "text": "Now, maybe you can speak to that or another example where beauty makes it tempting for us to assume that the law and the theory we found is actually one that perfectly describes reality."}, {"time": 559, "text": "I think that beauty does not lead us astray because I feel that beauty is a requirement for principles of physics."}, {"time": 567, "text": "So beauty is a fundamental in the universe?"}, {"time": 569, "text": "I think beauty is fundamental."}, {"time": 570, "text": "At least that's the way many of us view it."}, {"time": 572, "text": "It's not emergent."}, {"time": 575, "text": "I think Hardy is the mathematician who said that there's no permanent place for ugly mathematics."}, {"time": 580, "text": "And so I think the same is true in physics that if we find the principle which looks ugly, we are not going to be, that's not the end stage."}, {"time": 589, "text": "So therefore beauty is going to lead us somewhere."}, {"time": 592, "text": "Now, it doesn't mean beauty is enough."}, {"time": 594, "text": "It doesn't mean if you just have beauty, if I just look at something is beautiful, then I'm fine."}, {"time": 598, "text": "No, that's not the case."}, {"time": 600, "text": "Beauty is certainly a criteria that every good physical theory should pass."}, {"time": 604, "text": "That's at least the view we have."}, {"time": 606, "text": "Why do we have this view?"}, {"time": 609, "text": "It is partly, you could say, based on experience of science over centuries, partly is philosophical view of what reality is or should be."}, {"time": 620, "text": "And in principle, it could have been ugly and we might have had to deal with it, but we have gotten maybe confident through examples in the history of science to look for beauty."}, {"time": 632, "text": "And our sense of beauty seems to incorporate a lot of things that are essential for us to solve some difficult problems like symmetry."}, {"time": 637, "text": "We find symmetry beautiful and the breaking of symmetry beautiful."}, {"time": 641, "text": "Somehow symmetry is a fundamental part of how we conceive of beauty at all layers of reality, which is interesting."}, {"time": 651, "text": "Like in both the visual space, like the way we look at art, we look at each other as human beings, the way we look at creatures in the biological space, the way we look at chemistry, and then into the physics world as the work you do."}, {"time": 665, "text": "It makes you wonder like, which one is the chicken or the egg?"}, {"time": 670, "text": "Is symmetry the chicken and our conception of beauty the egg or the other way around?"}, {"time": 675, "text": "Or somehow the fact that the symmetry is part of reality, it somehow creates a brain that then is able to perceive it."}, {"time": 684, "text": "Or maybe this is just because we, maybe it's so obvious, it's almost trivial, that symmetry, of course, will be part of every kind of universe that's possible."}, {"time": 697, "text": "And then any kind of organism that's able to observe that universe is going to appreciate symmetry."}, {"time": 704, "text": "Well, these are good questions."}, {"time": 706, "text": "We don't have a deep understanding of why we get attracted to symmetry."}, {"time": 709, "text": "Why do laws of nature seem to have symmetries underlying them and the reasoning or the examples of whether, if there wasn't symmetry, we would have understood it or not."}, {"time": 720, "text": "We could have said that, yeah, if there were, you know, things which didn't look that great, we could understand them."}, {"time": 724, "text": "For example, we know that symmetries get broken and we have appreciated nature in the broken symmetry phase as well."}, {"time": 732, "text": "The world we live in has many things which do not look symmetric, but even those have underlying symmetry when you look at it more deeply."}, {"time": 740, "text": "So we have gotten maybe spoiled perhaps by the appearance of symmetry all over the place."}, {"time": 745, "text": "And we look for it."}, {"time": 746, "text": "And I think this is perhaps related to a sense of aesthetics that scientists have."}, {"time": 753, "text": "And we don't usually talk about it among scientists."}, {"time": 756, "text": "In fact, it's kind of a philosophical view of why do we look for simplicity or beauty or so forth."}, {"time": 763, "text": "And I think in a sense, scientists are a lot like philosophers."}, {"time": 768, "text": "Sometimes I think, especially modern science seems to shun philosophers and philosophical views."}, {"time": 774, "text": "And I think at their peril, I think in my view, science owes a lot to philosophy."}, {"time": 781, "text": "And in my view, many scientists, in fact, probably all good scientists are perhaps amateur philosophers."}, {"time": 788, "text": "They may not state that they are philosophers or they may not like to be labeled philosophers, but in many ways what they do is like what is philosophical takes of things."}, {"time": 798, "text": "Looking for simplicity or symmetry is an example of that in my opinion, or seeing patterns."}, {"time": 803, "text": "You see, for example, another example of the symmetry is like how you come up with new ideas in science."}, {"time": 809, "text": "You see, for example, an idea A is connected with an idea B."}, {"time": 813, "text": "Okay, so you study this connection very deeply."}, {"time": 816, "text": "And then you find the cousin of an idea A, let me call it A prime."}, {"time": 821, "text": "And then you immediately look for B prime."}, {"time": 824, "text": "If A is like B and if there's an A prime, then you look for B prime."}, {"time": 828, "text": "Well, it completes the picture."}, {"time": 831, "text": "Well, it's philosophically appealing to have more balance in terms of that."}, {"time": 835, "text": "And then you look for B prime and lo and behold, you find this other phenomenon, which is a physical phenomenon, which you call B prime."}, {"time": 841, "text": "So this kind of thinking motivates asking questions and looking for things."}, {"time": 845, "text": "And it has guided scientists, I think, through many centuries and I think it continues to do so today."}, {"time": 850, "text": "And I think if you look at the long arc of history, I suspect that the things that will be remembered is the philosophical flavor of the ideas of physics and chemistry and computer science and mathematics."}, {"time": 864, "text": "Like, I think the actual details will be shown to be incomplete or maybe wrong, but the philosophical intuitions will carry through much longer."}, {"time": 876, "text": "There's a sense in which, if it's true, that we haven't figured out most of how things work, currently, that it'll all be shown as wrong and silly."}, {"time": 887, "text": "It'd almost be a historical artifact."}, {"time": 889, "text": "But the human spirit, whatever, like the longing to understand, the way we perceive the world, the way we conceive of it, of our place in the world, those ideas will carry on."}, {"time": 903, "text": "In fact, I believe that almost, well, I believe that none of the principles or laws of physics we know today are exactly correct."}, {"time": 911, "text": "All of them are approximations to something."}, {"time": 913, "text": "They are better than the previous versions that we had, but none of them are exactly correct, and none of them are gonna stand forever."}, {"time": 919, "text": "So I agree that that's the process we are heading, we are improving."}, {"time": 924, "text": "And yes, indeed, the thought process and that philosophical take is common."}, {"time": 928, "text": "So when we look at older scientists, or maybe even all the way back to Greek philosophers and the things that the way they thought and so on, almost everything they said about nature was incorrect."}, {"time": 942, "text": "But the way they thought about it and many things that they were thinking is still valid today."}, {"time": 946, "text": "For example, they thought about symmetry breaking."}, {"time": 950, "text": "They were trying to explain the following."}, {"time": 951, "text": "This is a beautiful example, I think."}, {"time": 953, "text": "They had figured out that the Earth is round, and they said, okay, Earth is round."}, {"time": 957, "text": "They have seen the length of the shadow of a meter stick, and they have seen that if you go from the equator upwards north, they find that depending on how far away you are, that the length of the shadow changes."}, {"time": 967, "text": "And from that, they had even measured the radius of the Earth to good accuracy."}, {"time": 972, "text": "That's brilliant, by the way, the fact that they did that."}, {"time": 974, "text": "Very brilliant, very brilliant."}, {"time": 975, "text": "So these Greek philosophers are very smart."}, {"time": 977, "text": "And so they had taken it to the next step."}, {"time": 980, "text": "They asked, okay, so the Earth is round, why doesn't it move?"}, {"time": 985, "text": "They thought it doesn't move."}, {"time": 986, "text": "They were looking around, nothing seemed to move."}, {"time": 988, "text": "So they said, okay, we have to have a good explanation."}, {"time": 991, "text": "It wasn't enough for them to be there."}, {"time": 993, "text": "So they really wanna deeply understand that fact."}, {"time": 996, "text": "And they come up with a symmetry argument."}, {"time": 998, "text": "And the symmetry argument was, oh, if the Earth is a spherical, it must be at the center of the universe for sure."}, {"time": 1005, "text": "So they said the Earth is at the center of the universe."}, {"time": 1008, "text": "And they said, if the Earth is going to move, which direction does it pick?"}, {"time": 1012, "text": "Any direction it picks, it breaks that spherical symmetry because you have to pick a direction."}, {"time": 1017, "text": "And that's not good because it's not symmetrical anymore."}, {"time": 1019, "text": "So therefore, the Earth decides to sit put because it would break the symmetry."}, {"time": 1023, "text": "So they had the incorrect science."}, {"time": 1025, "text": "They thought Earth doesn't move."}, {"time": 1027, "text": "But they had this beautiful idea that symmetry might explain it."}, {"time": 1031, "text": "But they were even smarter than that."}, {"time": 1032, "text": "Aristotle didn't agree with this argument."}, {"time": 1035, "text": "He said, why do you think symmetry prevents it from moving?"}, {"time": 1038, "text": "Because the preferred position?"}, {"time": 1039, "text": "Not so."}, {"time": 1041, "text": "He gave an example."}, {"time": 1042, "text": "He said, suppose you are a person and we put you at the center of a circle and we spread food around you on a circle around you, loaves of bread, let's say."}, {"time": 1055, "text": "And we say, okay, stay at the center of the circle forever."}, {"time": 1059, "text": "Are you going to do that just because it's a symmetric point?"}, {"time": 1063, "text": "No, you are going to get hungry."}, {"time": 1064, "text": "You're going to move towards one of those loaves of bread, despite the fact that it breaks the symmetry."}, {"time": 1069, "text": "So from this way, he tried to argue being at the symmetric point may not be the preferred thing to do."}, {"time": 1075, "text": "And this idea of spontaneous symmetry breaking is something we just use today to describe many physical phenomena."}, {"time": 1081, "text": "So spontaneous symmetry breaking is the feature that we now use."}, {"time": 1084, "text": "But this idea was there thousands of years ago, but applied incorrectly to the physical world, but now we are using it."}, {"time": 1092, "text": "So these ideas are coming back in different forms."}, {"time": 1094, "text": "So I agree very much that the thought process is more important and these ideas are more interesting than the actual applications that people may find today."}, {"time": 1103, "text": "Did they use the language of symmetry and the symmetry breaking and spontaneous symmetry breaking?"}, {"time": 1108, "text": "Because I could see a conception of the universe that kind of tends towards perfect symmetry and is stuck there, not stuck there, but achieves that optimal and stays there."}, {"time": 1122, "text": "The idea that you would spontaneously break out of symmetry, like have these perturbations, like jump out of symmetry and back, that's a really difficult idea to load into your head."}, {"time": 1135, "text": "Like where does that come from?"}, {"time": 1137, "text": "And then the idea that you may not be at the center of the universe."}, {"time": 1142, "text": "That is a really tough idea."}, {"time": 1144, "text": "Right, so symmetry sometimes is an explanation of being at the symmetric point."}, {"time": 1148, "text": "It's sometimes a simple explanation of many things."}, {"time": 1150, "text": "Like if you have a bowl, a circular bowl, then the bottom of it is the lowest point."}, {"time": 1158, "text": "So if you put a pebble or something, it will slide down and go there at the bottom and stays there at the symmetric point because it's the preferred point, the lowest energy point."}, {"time": 1166, "text": "But if that same symmetric circular bowl that you had had a bump on the bottom, the bottom might not be at the center, it might be on a circle on the table, in which case the pebble would not end up at the center, it would be the lower energy point."}, {"time": 1180, "text": "Symmetrical, but it breaks the symmetry once it takes a point on that circle."}, {"time": 1185, "text": "So we can have symmetry reasoning for where things end up or symmetry breakings, like this example would suggest."}, {"time": 1192, "text": "We talked about beauty."}, {"time": 1194, "text": "I find geometry to be beautiful."}, {"time": 1196, "text": "You have a few examples that are geometric in nature in your book."}, {"time": 1204, "text": "How can geometry in ancient times or today be used to understand reality?"}, {"time": 1209, "text": "And maybe how do you think about geometry as a distinct tool in mathematics and physics?"}, {"time": 1217, "text": "Yes, geometry is my favorite part of math as well."}, {"time": 1219, "text": "And Greeks were enamored by geometry."}, {"time": 1222, "text": "They tried to describe physical reality using geometry and principles of geometry and symmetry."}, {"time": 1227, "text": "Platonic solids, the five solids they had discovered had these beautiful solids."}, {"time": 1233, "text": "They thought it must be good for some reality."}, {"time": 1235, "text": "There must be explaining something."}, {"time": 1237, "text": "They attached one to air, one to fire and so forth."}, {"time": 1240, "text": "They tried to give physical reality to symmetric objects."}, {"time": 1245, "text": "These symmetric objects are symmetries of rotation and discrete symmetry groups we call today of rotation group in three dimensions."}, {"time": 1253, "text": "Now, we know now, we kind of laugh at the way they were trying to connect that symmetry to the laws of the realities of physics."}, {"time": 1262, "text": "But actually it turns out in modern days, we use symmetries in not too far away exactly in these kinds of thoughts processes in the following way."}, {"time": 1274, "text": "In the context of string theory, which is the field light study, we have these extra dimensions."}, {"time": 1280, "text": "And these extra dimensions are compact tiny spaces typically but they have different shapes and sizes."}, {"time": 1287, "text": "We have learned that if these extra shapes and sizes have symmetries, which are related to the same rotation symmetries that the Greek we're talking about, if they enjoy those discrete symmetries and if you take that symmetry and caution the space by it, in other words, identify points under these symmetries, you get properties of that space at the singular points which force emanates from them."}, {"time": 1311, "text": "What forces?"}, {"time": 1312, "text": "Forces like the ones we have seen in nature today, like electric forces, like strong forces, like weak forces."}, {"time": 1319, "text": "So these same principles that were driving them to connect geometry and symmetries to nature is driving today's physics, now much more modern ideas, but nevertheless, the symmetries connecting geometry to physics."}, {"time": 1337, "text": "In fact, often sometimes we ask the following question, suppose I want to get this particular physical reality, I wanna have this particles with these forces and so on, what do I do?"}, {"time": 1348, "text": "It turns out that you can geometrically design the space to give you that."}, {"time": 1353, "text": "You say, oh, I put the sphere here, I will do this, I will shrink them."}, {"time": 1356, "text": "So if you have two spheres touching each other and shrinking to zero size, that gives you strong forces."}, {"time": 1363, "text": "If you have one of them, it gives you the weak forces."}, {"time": 1365, "text": "If you have this, you get that."}, {"time": 1366, "text": "And if you want to unify forces, do the other thing."}, {"time": 1369, "text": "So these geometrical translation of physics is one of my favorite things that we have discovered in modern physics and the context of string theory."}, {"time": 1377, "text": "The sad thing is when you go into multiple dimensions and we'll talk about it is we start to lose our capacity to visually intuit the world we're discussing."}, {"time": 1389, "text": "And then we go into the realm of mathematics and we'll lose that."}, {"time": 1392, "text": "Unfortunately, our brains are such that we're limited."}, {"time": 1395, "text": "But before we go into that mysterious, beautiful world, let's take a small step back."}, {"time": 1401, "text": "And you also in your book have this kind of through the space of puzzles, through the space of ideas, have a brief history of physics, of physical ideas."}, {"time": 1412, "text": "Now, we talked about Newtonian mechanics leading all through different Lagrangian, Hamiltonian mechanics."}, {"time": 1418, "text": "Can you describe some of the key ideas in the history of physics?"}, {"time": 1422, "text": "Maybe lingering on each from electromagnetism to relativity to quantum mechanics and to today, as we'll talk about with quantum gravity and string theory."}, {"time": 1432, "text": "Sure, so I mentioned the classical mechanics and the Euler Lagrangian formulation."}, {"time": 1439, "text": "One of the next important milestones for physics were the discoveries of laws of electricity and magnetism."}, {"time": 1447, "text": "So Maxwell put the discoveries all together in the context of what we call the Maxwell's equations."}, {"time": 1453, "text": "And he noticed that when he put these discoveries that Faraday's and others had made about electric and magnetic phenomena in terms of mathematical equations, it didn't quite work."}, {"time": 1465, "text": "There was a mathematical inconsistency."}, {"time": 1467, "text": "Now, one could have had two attitudes."}, {"time": 1471, "text": "One would say, okay, who cares about math?"}, {"time": 1472, "text": "I'm doing nature, electric force, magnetic force, math I don't care about."}, {"time": 1476, "text": "But it bothered him."}, {"time": 1477, "text": "It was inconsistent."}, {"time": 1479, "text": "The equations he were writing, the two equations he had written down did not agree with each other."}, {"time": 1483, "text": "And this bothered him, but he figured out, if you add this jiggle, this equation by adding one little term there, it works."}, {"time": 1490, "text": "At least it's consistent."}, {"time": 1491, "text": "What is the motivation for that term?"}, {"time": 1493, "text": "He said, I don't know."}, {"time": 1494, "text": "Have we seen it in experiments?"}, {"time": 1497, "text": "Why did you add it?"}, {"time": 1498, "text": "Well, because of mathematical consistency."}, {"time": 1499, "text": "So he said, okay, math forced him to do this term."}, {"time": 1504, "text": "He added this term, which we now today call the Maxwell term."}, {"time": 1508, "text": "And once he added that term, his equations were nice, differential equations, mathematically consistent, beautiful, but he also found the new physical phenomena."}, {"time": 1517, "text": "He found that because of that term, he could now get electric and magnetic waves moving through space at a speed that he could calculate."}, {"time": 1527, "text": "So he calculated the speed of the wave and lo and behold, he found it's the same as the speed of light, which puzzled him because he didn't think light had anything to do with electricity and magnetism."}, {"time": 1537, "text": "But then he was courageous enough to say, well, maybe light is nothing but these electric and magnetic fields moving around."}, {"time": 1544, "text": "And he wasn't alive to see the verification of that prediction and indeed it was true."}, {"time": 1550, "text": "So this mathematical inconsistency, which we could say this mathematical beauty drove him to this physical, very important connection between light and electric and magnetic phenomena, which was later confirmed."}, {"time": 1567, "text": "So then physics progresses and it comes to Einstein."}, {"time": 1571, "text": "Einstein looks at Maxwell's equation, says, beautiful, these are nice equation, except we get one speed light."}, {"time": 1578, "text": "Who measures this light speed?"}, {"time": 1580, "text": "And he asked the question, are you moving?"}, {"time": 1583, "text": "Are you not moving?"}, {"time": 1584, "text": "If you move, the speed of light changes, but Maxwell's equation has no hint of different speeds of light."}, {"time": 1589, "text": "It doesn't say, oh, only if you're not moving, you get the speed, it's just you always get the speed."}, {"time": 1593, "text": "So Einstein was very puzzled and he was daring enough to say, well, you know, maybe everybody gets the same speed for light."}, {"time": 1600, "text": "And that motivated his theory of special relativity."}, {"time": 1604, "text": "And this is an interesting example because the idea was motivated from physics, from Maxwell's equations, from the fact that people try to measure the properties of ether, which was supposed to be the medium in which the light travels through."}, {"time": 1620, "text": "And the idea was that only in that medium, the speed of, if you're at risk with respect to the ether, the speed, the speed of light, then if you're moving, the speed changes and people did not discover it."}, {"time": 1631, "text": "Michelson and Morley's experiment showed there's no ether."}, {"time": 1635, "text": "So then Einstein was courageous enough to say, you know, light is the same speed for everybody, regardless of whether you're moving or not."}, {"time": 1642, "text": "And the interesting thing is about special theory of relativity is that the math underpinning it is very simple."}, {"time": 1651, "text": "It's a linear algebra, nothing terribly deep."}, {"time": 1655, "text": "You can teach it at a high school level, if not earlier."}, {"time": 1659, "text": "Okay, does that mean Einstein's special relativity is boring?"}, {"time": 1664, "text": "So this is an example where simple math, you know, linear algebra leads to deep physics."}, {"time": 1670, "text": "Einstein's theory of special relativity."}, {"time": 1673, "text": "Motivated by this inconsistency that Maxwell's equation would suggest for the speed of light, depending on who observes it."}, {"time": 1679, "text": "What's the most daring idea there, that the speed of light could be the same everywhere?"}, {"time": 1683, "text": "That's the basic, that's the guts of it."}, {"time": 1685, "text": "That's the core of Einstein's theory."}, {"time": 1687, "text": "That statement underlies the whole thing."}, {"time": 1689, "text": "Speed of light is the same for everybody."}, {"time": 1691, "text": "It's hard to swallow and it doesn't sound right."}, {"time": 1693, "text": "It sounds completely wrong on the face of it."}, {"time": 1696, "text": "And it took Einstein to make this daring statement."}, {"time": 1699, "text": "It would be laughing in some sense."}, {"time": 1702, "text": "How could anybody make this possibly ridiculous claim?"}, {"time": 1706, "text": "And it turned out to be true."}, {"time": 1708, "text": "Because it still sounds ridiculous."}, {"time": 1711, "text": "It sounds ridiculous until you learn that our intuition is at fault about the way we conceive of space and time."}, {"time": 1717, "text": "The way we think about space and time is wrong because we think about the nature of time as absolute."}, {"time": 1723, "text": "And part of it is because we live in a situation where we don't go with very high speeds."}, {"time": 1729, "text": "There are speeds that are small compared to the speed of light."}, {"time": 1732, "text": "And therefore the phenomena we observe does not distinguish the relativity of time."}, {"time": 1737, "text": "The time also depends on who measures it."}, {"time": 1739, "text": "There's no absolute time."}, {"time": 1740, "text": "When you say it's noon today and now, it depends on who's measuring it."}, {"time": 1744, "text": "And not everybody would agree with that statement."}, {"time": 1747, "text": "And to see that you would have to have fast observer moving speeds close to the speed of light."}, {"time": 1752, "text": "So this shows that our intuition is at fault."}, {"time": 1755, "text": "And a lot of the discoveries in physics precisely is getting rid of the wrong old intuition."}, {"time": 1763, "text": "And it is funny because we get rid of it, but it's always lingers in us in some form."}, {"time": 1768, "text": "Like even when I'm describing it, I feel like a little bit like, isn't it funny?"}, {"time": 1772, "text": "As you're just feeling the same way."}, {"time": 1774, "text": "It is, it is."}, {"time": 1775, "text": "But we kind of replace it by an intuition."}, {"time": 1780, "text": "And actually there's a very beautiful example of this, how physicists do this, try to replace their intuition."}, {"time": 1786, "text": "And I think this is one of my favorite examples about how physicists develop intuition."}, {"time": 1792, "text": "It goes to the work of Galileo."}, {"time": 1794, "text": "So, again, let's go back to Greek philosophers or maybe Aristotle in this case."}, {"time": 1800, "text": "Now, again, let's make a criticism."}, {"time": 1802, "text": "He thought that the heavier objects fall faster than the lighter objects."}, {"time": 1807, "text": "It kind of makes sense."}, {"time": 1808, "text": "And people say about the feather and so on, but that's because of the air resistance."}, {"time": 1812, "text": "But you might think like, if you have a heavy stone and a light pebble, the heavy one will fall first."}, {"time": 1818, "text": "If you don't do any experiments, that's the first gut reaction."}, {"time": 1821, "text": "I would say everybody would say that's the natural thing."}, {"time": 1824, "text": "Galileo did not believe this."}, {"time": 1825, "text": "And he kind of did the experiment."}, {"time": 1829, "text": "Famously it said he went on the top of Pisa Tower and he dropped these heavy and light stones and they fell at the same time when he dropped it at the same time from the same height."}, {"time": 1839, "text": "So he said, I'm done."}, {"time": 1841, "text": "I've showed that the heavy and lighter objects fall at the same time."}, {"time": 1844, "text": "I did the experiment."}, {"time": 1845, "text": "Scientists at that time did not accept it."}, {"time": 1850, "text": "Because at that time, science was not just experimental."}, {"time": 1854, "text": "The experiment was not enough."}, {"time": 1856, "text": "They didn't think that they have to soil their hands in doing experiments to get to the reality."}, {"time": 1861, "text": "They said, why is it the case?"}, {"time": 1864, "text": "So Galileo had to come up with an explanation of why heavier and lighter objects fall at the same rate."}, {"time": 1869, "text": "This is the way he convinced them using symmetry."}, {"time": 1873, "text": "He said, suppose you have three bricks, the same shape, the same size, same mass, everything."}, {"time": 1881, "text": "And we hold these three bricks at the same height and drop them."}, {"time": 1887, "text": "Which one will fall to the ground first?"}, {"time": 1889, "text": "Everybody said, of course, we know it's symmetry tells you they're all the same shape, same size, same height."}, {"time": 1895, "text": "Of course, they fall at the same time."}, {"time": 1896, "text": "Yeah, we know that."}, {"time": 1897, "text": "Next, next."}, {"time": 1898, "text": "It's trivial."}, {"time": 1899, "text": "He said, okay, what if we move these bricks around with the same height?"}, {"time": 1902, "text": "Does it change the time they hit the ground?"}, {"time": 1905, "text": "They said, if it's the same height, again, by the symmetry principle, because the height translation horizontal translates to the symmetry, no, it doesn't matter."}, {"time": 1912, "text": "They all fall at the same rate."}, {"time": 1914, "text": "Does it matter how close I bring them together?"}, {"time": 1916, "text": "Okay, suppose I make the two bricks touch and then let them go."}, {"time": 1919, "text": "Do they fall at the same rate?"}, {"time": 1922, "text": "But then he said, well, the two bricks that touch are twice more mass than this other brick."}, {"time": 1927, "text": "And you just agreed that they fall at the same rate."}, {"time": 1929, "text": "They say, yeah, yeah, we just agreed."}, {"time": 1930, "text": "That's right, that's great."}, {"time": 1933, "text": "So he deconfused them by the symmetry reasoning."}, {"time": 1935, "text": "So this way of repackaging some intuition, a different type of intuition."}, {"time": 1939, "text": "When the intuitions clash, then you side on the, you replace the intuition."}, {"time": 1946, "text": "In some of these more difficult physical ideas, physics ideas in the 20th century and the 21st century, it starts becoming more and more difficult to then replace the intuition."}, {"time": 1958, "text": "What does the world look like for an object traveling close to the speed of light?"}, {"time": 1962, "text": "You start to think about the edges of supermassive black holes, and you start to think like, what's that look like?"}, {"time": 1971, "text": "Or I've been into gravitational waves recently."}, {"time": 1975, "text": "It's like when the fabric of space time is being morphed by gravity, like what's that actually feel like?"}, {"time": 1983, "text": "If I'm riding a gravitational wave, what's that feel like?"}, {"time": 1989, "text": "I mean, I think some of those are more sort of hippy, not useful intuitions to have, but if you're an actual physicist or whatever the particular discipline is, I wonder if it's possible to meditate, to sort of escape through thinking, prolong thinking and meditation on a world, like live in a visualized world that's not like our own in order to understand a phenomenon deeply."}, {"time": 2018, "text": "So like replace the intuition, like through rigorous meditation on the idea in order to conceive of it."}, {"time": 2026, "text": "I mean, if we talk about multiple dimensions, I wonder if there's a way to escape with a three dimensional world in our mind in order to then start to reason about it."}, {"time": 2036, "text": "It's, the more I talk to topologists, the more they seem to not operate at all in the visual space."}, {"time": 2045, "text": "They really trust the mathematics, like which is really annoying to me because topology and differential geometry feels like it has a lot of potential for beautiful pictures."}, {"time": 2057, "text": "Yes, I think they do."}, {"time": 2058, "text": "Actually, I would not be able to do my research if I don't have an intuitive feel about geometry."}, {"time": 2066, "text": "And we'll get to it as you mentioned before that how, for example, in strength theory, you deal with these extra dimensions."}, {"time": 2073, "text": "And I'll be very happy to describe how we do it because without intuition, we will not get anywhere."}, {"time": 2077, "text": "And I don't think you can just rely on formalism."}, {"time": 2081, "text": "I don't think any physicist just relies on formalism."}, {"time": 2084, "text": "That's not physics."}, {"time": 2085, "text": "That's not understanding."}, {"time": 2086, "text": "So we have to intuit it."}, {"time": 2088, "text": "And that's crucial."}, {"time": 2089, "text": "And there are steps of doing it."}, {"time": 2090, "text": "And we learned it might not be trivial, but we learn how to do it."}, {"time": 2093, "text": "Similar to what this Galileo picture I just told you, you have to build these gradually."}, {"time": 2099, "text": "But you have to connect the bricks."}, {"time": 2102, "text": "Exactly, you have to connect the bricks, literally."}, {"time": 2104, "text": "So yeah, so then, so going back to your question about the path of the history of the science."}, {"time": 2110, "text": "So I was saying about the electricity and magnetism and the special relativity where simple idea led to special relativity."}, {"time": 2116, "text": "But then he went further thinking about acceleration in the context of relativity."}, {"time": 2121, "text": "And he came up with general relativity where he talked about the fabric of space time being curved and so forth and matter affecting the curvature of the space and time."}, {"time": 2132, "text": "So this gradually became a connection between geometry and physics."}, {"time": 2138, "text": "Namely, he replaced Newton's gravitational force with a very geometrical, beautiful picture."}, {"time": 2146, "text": "It's much more elegant than Newton's, but much more complicated mathematically."}, {"time": 2149, "text": "So when we say it's simpler, we mean in some form it's simpler, but not in pragmatic terms of equation solving."}, {"time": 2157, "text": "The equations are much harder to solve in Einstein's theory."}, {"time": 2161, "text": "And in fact, so much harder that Einstein himself couldn't solve many of the cases."}, {"time": 2166, "text": "He thought, for example, you couldn't solve the equation for a spherical symmetric matter, like if you had a symmetric sun, he didn't think you can actually solve his equation for that."}, {"time": 2175, "text": "And a year after he said that it was solved by Schwarzschild."}, {"time": 2179, "text": "So it was that hard that he didn't think it's gonna be that easy."}, {"time": 2182, "text": "So yeah, deformism is hard."}, {"time": 2184, "text": "But the contrast between the special relativity and general relativity is very interesting because one of them has almost trivial math and the other one has super complicated math."}, {"time": 2194, "text": "Both are physically amazingly important."}, {"time": 2197, "text": "And so we have learned that, you know, the physics may or may not require complicated math."}, {"time": 2204, "text": "We should not shy from using complicated math like Einstein did."}, {"time": 2208, "text": "Nobody, Einstein wouldn't say, I'm not gonna touch this math because it's too much, you know, tensors or, you know, curvature and I don't like the four dimensional space time because I can't see four dimension."}, {"time": 2217, "text": "He wasn't doing that."}, {"time": 2219, "text": "He was willing to abstract from that because physics drove him in that direction."}, {"time": 2223, "text": "But his motivation was physics."}, {"time": 2225, "text": "Physics pushed him."}, {"time": 2226, "text": "Just like Newton pushed to develop calculus because physics pushed him that he didn't have the tools."}, {"time": 2232, "text": "So he had to develop the tools to answer his physics questions."}, {"time": 2236, "text": "So his motivation was physics again."}, {"time": 2238, "text": "So to me, those are examples which show that math and physics have this symbiotic relationship which kind of reinforce each other."}, {"time": 2246, "text": "Here I'm using, I'm giving you examples of both of them, namely Newton's work led to development of mathematics, calculus."}, {"time": 2254, "text": "And in the case of Einstein, he didn't develop Riemannian geometry, he just used them."}, {"time": 2258, "text": "So it goes both ways and in the context of modern physics, we see that again and again, it goes both ways."}, {"time": 2266, "text": "You know, you talk about your favorite soccer player, the bar, I'll ask the same question about Einstein's ideas which is, which one do you think is the biggest leap of genius?"}, {"time": 2276, "text": "Is it the E equals MC squared?"}, {"time": 2279, "text": "Is it Brownian motion?"}, {"time": 2281, "text": "Is it special relativity, is it general relativity?"}, {"time": 2285, "text": "Which of the famous set of papers he's written in 1905 and in general, his work was the biggest leap of genius?"}, {"time": 2293, "text": "In my opinion, it's special relativity."}, {"time": 2296, "text": "The idea that speed of light is the same for everybody is the beginning of everything he did."}, {"time": 2300, "text": "The beginning is the seed."}, {"time": 2301, "text": "The beginning."}, {"time": 2302, "text": "Once you embrace that weirdness, all the weirdness, all the rest."}, {"time": 2305, "text": "I would say that's, even though he says the most beautiful moment for him, he says that is when he realized that if you fall in an elevator, you don't know if you're falling or whether you're in the falling elevator or whether you're next to the earth, gravitational."}, {"time": 2319, "text": "That to him was his aha moment, which inertial mass and gravitational mass being identical geometrically and so forth as part of the theory, not because of, you know, some funny coincidence."}, {"time": 2332, "text": "That's for him, but I feel from outside at least, it feels like the speed of light being the same is the really aha moment."}, {"time": 2339, "text": "The general relativity to you is not like the conception of space time."}, {"time": 2344, "text": "In a sense, the conception of space time already was part of the special relativity when you talk about length contraction."}, {"time": 2350, "text": "So general relativity takes that to the next step, but beginning of it was already space, length contracts, time dilates."}, {"time": 2357, "text": "So once you talk about those, then yeah, you can dilate more or less different places than its curvature."}, {"time": 2361, "text": "So you don't have a choice."}, {"time": 2362, "text": "So it kind of started just with that same simple thought."}, {"time": 2366, "text": "Speed of light is the same for all."}, {"time": 2368, "text": "Where does quantum mechanics come into view?"}, {"time": 2372, "text": "Exactly, so this is the next step."}, {"time": 2373, "text": "So Einstein's, you know, developed general relativity and he's beginning to develop the foundation of quantum mechanics at the same time, the photoelectric effects and others."}, {"time": 2382, "text": "And so quantum mechanics overtakes, in fact, Einstein in many ways because he doesn't like the probabilistic interpretation of quantum mechanics and the formulas that's emerging, but fits his march on and try to, for example, combine Einstein's theory of relativity with quantum mechanics."}, {"time": 2401, "text": "So Dirac takes special relativity, tries to see how is it compatible with quantum mechanics."}, {"time": 2407, "text": "Can we pause and briefly say what is quantum mechanics?"}, {"time": 2410, "text": "Oh yes, sure."}, {"time": 2411, "text": "So quantum mechanics, so I discussed briefly when I talked about the connection between Newtonian mechanics and the Euler Lagrange reformulation of the Newtonian mechanics and interpretation of this Euler Lagrange formulas in terms of the paths that the particle take."}, {"time": 2428, "text": "So when we say a particle goes from here to here, we usually think it classically follows a specific trajectory, but actually in quantum mechanics, it follows every trajectory with different probabilities."}, {"time": 2442, "text": "And so there's this fuzziness."}, {"time": 2444, "text": "Now, most probable, it's the path that you actually see and deviation from that is very, very unlikely and probabilistically very minuscule."}, {"time": 2453, "text": "So in everyday experiments, we don't see anything deviated from what we expect, but quantum mechanics tells us that the things are more fuzzy."}, {"time": 2461, "text": "Things are not as precise as the line you draw."}, {"time": 2465, "text": "Things are a bit like cloud."}, {"time": 2467, "text": "So if you go to microscopic scales, like atomic scales and lower, these phenomena become more pronounced."}, {"time": 2474, "text": "You can see it much better."}, {"time": 2476, "text": "The electron is not at the point, but the cloud spread out around the nucleus."}, {"time": 2481, "text": "And so this fuzziness, this probabilistic aspect of reality is what quantum mechanics describes."}, {"time": 2488, "text": "Can I briefly pause on that idea?"}, {"time": 2491, "text": "Do you think quantum mechanics is just a really damn good approximation, a tool for predicting reality, or does it actually describe reality?"}, {"time": 2503, "text": "Do you think reality is fuzzy at that level?"}, {"time": 2505, "text": "Well, I think that reality is fuzzy at that level, but I don't think quantum mechanics is necessarily the end of the story."}, {"time": 2511, "text": "So quantum mechanics is certainly an improvement over classical physics."}, {"time": 2517, "text": "That much we know by experiments and so forth."}, {"time": 2520, "text": "Whether I'm happy with quantum mechanics, whether I view quantum mechanics, for example, the thought, the measurement description of quantum mechanics, am I happy with it?"}, {"time": 2529, "text": "Am I thinking that's the end stage or not?"}, {"time": 2532, "text": "I don't think we're at the end of that story."}, {"time": 2534, "text": "And many physicists may or may not view this way."}, {"time": 2537, "text": "Some do, some don't."}, {"time": 2538, "text": "But I think that it's the best we have right now, that's for sure."}, {"time": 2543, "text": "It's the best approximation for reality we know today."}, {"time": 2545, "text": "And so far, we don't know what it is, the next thing that improves it or replaces it and so on."}, {"time": 2550, "text": "But as I mentioned before, I don't believe any of the laws of physics we know today are permanently exactly correct."}, {"time": 2556, "text": "That doesn't bother me."}, {"time": 2558, "text": "I'm not like dogmatic saying, I have figured out this is the law of nature."}, {"time": 2561, "text": "I know everything."}, {"time": 2562, "text": "No, no, that's the beauty about science is that we are not dogmatic."}, {"time": 2567, "text": "And we are willing to, in fact, we are encouraged to be skeptical of what we ourselves do."}, {"time": 2573, "text": "So you were talking about Dirac."}, {"time": 2575, "text": "Yes, I was talking about Dirac, right."}, {"time": 2576, "text": "So Dirac was trying to now combine this Schrodinger's equations, which was described in the context of trying to talk about how these probabilistic waves of electrons move for the atom, which was good for speeds which were not too close to the speed of light, to what happens when you get to the near the speed of light."}, {"time": 2594, "text": "So then you need relativity."}, {"time": 2596, "text": "So then Dirac tried to combine Einstein's relativity with quantum mechanics."}, {"time": 2600, "text": "So he tried to combine them and he wrote this beautiful equation, the Dirac equation, which roughly speaking, take the square root of the Einstein's equation in order to connect it to Schrodinger's time evolution operator, which is first order in time derivative to get rid of the naive thing that Einstein's equation would have given, which is second order."}, {"time": 2621, "text": "So you have to take a square root."}, {"time": 2623, "text": "Now square root usually has a plus or minus sign when you take it."}, {"time": 2627, "text": "And when he did this, he originally didn't notice this plus, didn't pay attention to this plus or minus sign, but later physicists pointed out to Dirac says, look, there's also this minus sign."}, {"time": 2637, "text": "And if you use this minus sign, you get negative energy."}, {"time": 2641, "text": "In fact, it was very, very annoying that, you know, somebody else tells you this obvious mistake you make."}, {"time": 2646, "text": "Pauli famous physicist told Dirac, this is nonsense."}, {"time": 2649, "text": "You're going to get negative energy with your equation, which negative energy without any bottom, you can go all the way down to negative."}, {"time": 2655, "text": "Infinite energy, so it doesn't make any sense."}, {"time": 2658, "text": "Dirac thought about it."}, {"time": 2659, "text": "And then he remembered Pauli's exclusion principle just before him."}, {"time": 2663, "text": "Pauli had said, you know, there's this principle called the exclusion principle that, you know, two electrons cannot be on the same orbit."}, {"time": 2670, "text": "And so Dirac said, okay, you know what?"}, {"time": 2672, "text": "All these negative energy states are filled orbits, occupied."}, {"time": 2678, "text": "So according to you, Mr. Pauli, there's no place to go."}, {"time": 2684, "text": "So therefore they only have to go positive."}, {"time": 2687, "text": "Sounded like a big cheat."}, {"time": 2689, "text": "And then Pauli said, oh, you know what?"}, {"time": 2691, "text": "We can change orbits from one orbit to another."}, {"time": 2693, "text": "What if I take one of these negative energy orbits and put it up there?"}, {"time": 2697, "text": "Then it seems to be a new particle, which has opposite properties to the electron."}, {"time": 2703, "text": "It has positive energy, but it has positive charge."}, {"time": 2709, "text": "Dirac was a bit worried."}, {"time": 2710, "text": "He said, maybe that's proton because proton has plus charge."}, {"time": 2713, "text": "He wasn't sure."}, {"time": 2714, "text": "But then he said, oh, maybe it's proton."}, {"time": 2716, "text": "But then they said, no, no, no, no."}, {"time": 2717, "text": "It has the same mass as the electron."}, {"time": 2719, "text": "It cannot be proton because proton is heavier."}, {"time": 2722, "text": "Dirac was stuck."}, {"time": 2723, "text": "He says, well, then maybe another part we haven't seen."}, {"time": 2727, "text": "By that time, Dirac himself was getting a little bit worried about his own equation and his own crazy interpretation."}, {"time": 2734, "text": "Until a few years later, Anderson, in the photographic place that he had gotten from these cosmic rays, he discovered a particle which goes in the opposite direction that the electron goes when there's a magnetic field, and with the same mass, exactly like what Dirac had predicted."}, {"time": 2755, "text": "And this was what we call now positron."}, {"time": 2757, "text": "And in fact, beginning with the work of Dirac, we know that every particle has an antiparticle."}, {"time": 2763, "text": "And so this idea that there's an antiparticle came from this simple math."}, {"time": 2766, "text": "There's a plus and a minus from the Dirac's quote unquote mistake."}, {"time": 2772, "text": "So again, trying to combine ideas, sometimes the math is smarter than the person who uses it to apply it, and you try to resist it, and then you kind of confront it by criticism, which is the way it should be."}, {"time": 2785, "text": "So physicists comes and said, no, no, that's wrong, and you correct it, and so on."}, {"time": 2787, "text": "So that is a development of the idea there's particle, there's antiparticle, and so on."}, {"time": 2792, "text": "So this is the beginning of development of quantum mechanics and the connection with relativity, but the thing was more challenging because we had to also describe how electric and magnetic fields work with quantum mechanics."}, {"time": 2804, "text": "This was much more complicated because it's not just one point."}, {"time": 2807, "text": "Electric and magnetic fields were everywhere."}, {"time": 2810, "text": "So you had to talk about fluctuating and a fuzziness of electrical fields and magnetic fields everywhere."}, {"time": 2816, "text": "And the math for that was very difficult to deal with."}, {"time": 2820, "text": "And this led to a subject called quantum field theory."}, {"time": 2823, "text": "Fields like electric and magnetic fields had to be quantum, had to be described also in a wavy way."}, {"time": 2829, "text": "Feynman in particular was one of the pioneers along with Schrodingers and others to try to come up with a formalism to deal with fields like electric and magnetic fields, interacting with electrons in a consistent quantum fashion."}, {"time": 2844, "text": "And they developed this beautiful theory, quantum electrodynamics from that."}, {"time": 2847, "text": "And later on that same formalism, quantum field theory led to the discovery of other forces and other particles all consistent with the idea of quantum mechanics."}, {"time": 2857, "text": "So that was how physics progressed."}, {"time": 2860, "text": "And so basically we learned that all particles and all the forces are in some sense related to particle exchanges."}, {"time": 2869, "text": "And so for example, electromagnetic forces are mediated by a particle we call photon and so forth."}, {"time": 2877, "text": "And same for other forces that they discovered, strong forces and the weak forces."}, {"time": 2881, "text": "So we got the sense of what quantum field theory is."}, {"time": 2883, "text": "Is that a big leap of an idea that particles are fluctuations in the field?"}, {"time": 2892, "text": "Like the idea that everything is a field."}, {"time": 2895, "text": "It's the old Einstein, light is a wave, both a particle and a wave kind of idea."}, {"time": 2900, "text": "Is that a huge leap in our understanding of conceiving the universe as fields?"}, {"time": 2906, "text": "I would say so."}, {"time": 2907, "text": "I would say that viewing the particles, this duality that Bohr mentioned between particles and waves, that waves can behave sometimes like particles, sometimes like waves, is one of the biggest leaps of imagination that quantum mechanics made physics do."}, {"time": 2922, "text": "So I agree that that is quite remarkable."}, {"time": 2925, "text": "Is duality fundamental to the universe or is it just because we don't understand it fully?"}, {"time": 2932, "text": "Like will it eventually collapse into a clean explanation that doesn't require duality?"}, {"time": 2937, "text": "Like that a phenomena could be two things at once and both to be true."}, {"time": 2944, "text": "So that seems weird."}, {"time": 2945, "text": "So in fact I was going to get to that when we get to string theory but maybe I can comment on that now."}, {"time": 2951, "text": "Duality turns out to be running the show today and the whole thing that we are doing is string theory."}, {"time": 2955, "text": "Duality is the name of the game."}, {"time": 2957, "text": "So it's the most beautiful subject and I want to talk about it."}, {"time": 2960, "text": "Let's talk about it in the context of string theory then."}, {"time": 2963, "text": "So we do want to take a next step into, because we mentioned general relativity, we mentioned quantum mechanics, is there something to be said about quantum gravity?"}, {"time": 2972, "text": "Yes, that's exactly the right point to talk about."}, {"time": 2974, "text": "So namely we have talked about quantum fields and I talked about electric forces, photon being the particle carrying those forces."}, {"time": 2982, "text": "So for gravity, quantizing gravitational field which is this curvature of space time according to Einstein, you get another particle called graviton."}, {"time": 2992, "text": "So what about gravitons?"}, {"time": 2995, "text": "Should be there, no problem."}, {"time": 2996, "text": "So then you start computing it."}, {"time": 2999, "text": "What do I mean by computing it?"}, {"time": 3000, "text": "Well, you compute scattering of one graviton off another graviton, maybe with graviton with an electron and so on, see what you get."}, {"time": 3007, "text": "Feynman had already mastered this quantum electrodynamics."}, {"time": 3012, "text": "He said, no problem, let me do it."}, {"time": 3014, "text": "Even though these are such weak forces, the gravity is very weak."}, {"time": 3018, "text": "So therefore to see them, these quantum effects of gravitational waves was impossible."}, {"time": 3023, "text": "It's even impossible today."}, {"time": 3025, "text": "So Feynman just did it for fun."}, {"time": 3027, "text": "He usually had this mindset that I want to do something which I will see in experiment, but this one, let's just see what it does."}, {"time": 3034, "text": "And he was surprised because the same techniques he was using for doing the same calculations, quantum electrodynamics, when applied to gravity failed."}, {"time": 3044, "text": "The formulas seem to make sense, but he had to do some integrals and he found that when he does those integrals, he got infinity and it didn't make any sense."}, {"time": 3052, "text": "Now there were similar infinities in the other pieces but he had managed to make sense out of those before."}, {"time": 3056, "text": "This was no way he could make sense out of it."}, {"time": 3059, "text": "He just didn't know what to do."}, {"time": 3061, "text": "He didn't feel it's an urgent issue because nobody could do the experiment."}, {"time": 3065, "text": "So he was kind of said, okay, there's this thing, but okay, we don't know how to exactly do it, but that's the way it is."}, {"time": 3071, "text": "So in some sense, a natural conclusion from what Feynman did could have been like, gravity cannot be consistent with quantum theory, but that cannot be the case because gravity is in our universe, quantum mechanics in our universe, they both together somehow should work."}, {"time": 3085, "text": "So it's not acceptable to say they don't work together."}, {"time": 3088, "text": "So that was a puzzle."}, {"time": 3090, "text": "How does it possibly work?"}, {"time": 3092, "text": "It was left open."}, {"time": 3094, "text": "And then we get to the string theory."}, {"time": 3097, "text": "So this is the puzzle of quantum gravity."}, {"time": 3098, "text": "The particle description of quantum gravity failed."}, {"time": 3101, "text": "So the infinity shows up."}, {"time": 3103, "text": "What do we do with infinity?"}, {"time": 3105, "text": "Let's get to the fun part."}, {"time": 3107, "text": "Let's talk about string theory."}, {"time": 3110, "text": "Let's discuss some technical basics of string theory."}, {"time": 3116, "text": "What is string theory?"}, {"time": 3117, "text": "What is a string?"}, {"time": 3119, "text": "How many dimensions are we talking about?"}, {"time": 3121, "text": "What are the different states?"}, {"time": 3122, "text": "How do we represent the elementary particles and the laws of physics using this new framework?"}, {"time": 3129, "text": "So string theory is the idea that the fundamental entities are not particles, but extended higher dimensional objects like one dimensional strings, like loops."}, {"time": 3142, "text": "These loops could be open like with two ends, like an interval or a circle without any ends."}, {"time": 3149, "text": "And they're vibrating and moving around in space."}, {"time": 3152, "text": "So how big they are?"}, {"time": 3154, "text": "Well, you can of course stretch it and make it big, or you can just let it be whatever it wants."}, {"time": 3159, "text": "It can be as small as a point because the circle can shrink to a point and be very light, or you can stretch it and becomes very massive, or it could oscillate and become massive that way."}, {"time": 3170, "text": "So it depends on which kind of state you have."}, {"time": 3172, "text": "In fact, the string can have infinitely many modes, depending on which kind of oscillation it's doing."}, {"time": 3176, "text": "Like a guitar has different harmonics, string has different harmonics, but for the string, each harmonic is a particle."}, {"time": 3183, "text": "So each particle will give you, ah, this is a more massive harmonic, this is a less massive."}, {"time": 3187, "text": "So the lightest harmonic, so to speak, is no harmonics, which means like the string shrunk to a point, and then it becomes like a massless particles or light particles like photon and graviton and so forth."}, {"time": 3199, "text": "So when you look at tiny strings, which are shrunk to a point, the lightest ones, they look like the particles that we think, they're like particles."}, {"time": 3208, "text": "In other words, from far away, they look like a point."}, {"time": 3211, "text": "But of course, if you zoom in, there's this tiny little circle that's there that's shrunk to almost a point."}, {"time": 3217, "text": "Should we be imagining, this is to the visual intuition, should we be imagining literally strings that are potentially connected as a loop or not?"}, {"time": 3227, "text": "We knew, and when somebody outside of physics is imagining a basic element of string theory, which is a string, should we literally be thinking about a string?"}, {"time": 3238, "text": "Yes, you should literally think about string, but string with zero thickness."}, {"time": 3242, "text": "With zero thickness."}, {"time": 3243, "text": "So notice, it's a loop of energy, so to speak, if you can think of it that way."}, {"time": 3248, "text": "And so there's a tension like a regular string, if you pull it, there's, you know, you have to stretch it."}, {"time": 3254, "text": "But it's not like a thickness, like you're made of something, it's just energy."}, {"time": 3257, "text": "It's not made of atoms or something like that."}, {"time": 3259, "text": "But it is very, very tiny."}, {"time": 3261, "text": "Very tiny."}, {"time": 3262, "text": "Much smaller than elementary particles of physics."}, {"time": 3265, "text": "Much smaller."}, {"time": 3266, "text": "So we think if you let the string to be by itself, the lowest state, there'll be like fuzziness or a size of that tiny little circle, which is like a point, about, could be anything between, we don't know the exact size, but in different models have different sizes, but something of the order of 10 to the minus, let's say 30 centimeters."}, {"time": 3283, "text": "So 10 to the minus 30 centimeters, just to compare it with the size of the atom, which is 10 to the minus eight centimeters, is 22 orders of magnitude smaller."}, {"time": 3294, "text": "Unimaginably small, I would say."}, {"time": 3296, "text": "Very small."}, {"time": 3296, "text": "So we basically think from far away, string is like a point particle."}, {"time": 3300, "text": "And that's why a lot of the things that we learned about point particle physics carries over directly to strings."}, {"time": 3307, "text": "So therefore there's not much of a mystery why particle physics was successful, because a string is like a particle when it's not stretched."}, {"time": 3314, "text": "But it turns out having this size, being able to oscillate, get bigger, turned out to be resolving this puzzles that Feynman was having in calculating his diagrams, and it gets rid of those infinities."}, {"time": 3328, "text": "So when you're trying to do those infinities, the regions that give infinities to Feynman, as soon as you get to those regions, then this string starts to oscillate, and these oscillation structure of the strings resolves those infinities to finite answer at the end."}, {"time": 3343, "text": "So the size of the string, the fact that it's one dimensional, gives a finite answer at the end."}, {"time": 3348, "text": "Resolves this paradox."}, {"time": 3350, "text": "Now, perhaps it's also useful to recount of how string theory came to be."}, {"time": 3356, "text": "Because it wasn't like somebody say, well, let me solve the problem of Einstein's, solve the problem that Feynman had with unifying Einstein's theory with quantum mechanics by replacing the point by a string."}, {"time": 3368, "text": "No, that's not the way the thought process, the thought process was much more random."}, {"time": 3374, "text": "Physicist, then it's John on this case, was trying to describe the interactions they were seeing in colliders, in accelerators."}, {"time": 3382, "text": "And they were seeing that some process, in some process, when two particles came together and joined together and when they were separately, in one way, and the opposite way, they behave the same way."}, {"time": 3394, "text": "In some way, there was a symmetry, a duality, which he didn't understand."}, {"time": 3398, "text": "The particles didn't seem to have that symmetry."}, {"time": 3401, "text": "He said, I don't know what it is, what's the reason that these colliders and experiments we're doing seems to have the symmetry, but let me write the mathematical formula, which exhibits that symmetry."}, {"time": 3411, "text": "He used gamma functions, beta functions and all that, you know, complete math, no physics, other than trying to get symmetry out of his equation."}, {"time": 3419, "text": "He just wrote down a formula as the answer for a process, not a method to compute it."}, {"time": 3424, "text": "Just say, wouldn't it be nice if this was the answer?"}, {"time": 3428, "text": "Physics looked at this one, that's intriguing, it has the symmetry all right, but what is this?"}, {"time": 3433, "text": "Where is this coming from?"}, {"time": 3434, "text": "Which kind of physics gives you this?"}, {"time": 3439, "text": "A few years later, people saw that, oh, the equation that you're writing, the process you're writing in the intermediate channels that particles come together, seems to have all the harmonics."}, {"time": 3450, "text": "Harmonics sounds like a string."}, {"time": 3452, "text": "Let me see if what you're describing has anything to do with the strings."}, {"time": 3454, "text": "And people try to see if what he's doing has anything to do with the strings."}, {"time": 3457, "text": "Oh, yeah, indeed."}, {"time": 3458, "text": "If I study scattering of two strings, I get exactly the formula you wrote down."}, {"time": 3462, "text": "That was the reinterpretation of what he had written in the formula as the strings, but still had nothing to do with gravity."}, {"time": 3471, "text": "It had nothing to do with resolving the problems of gravity with quantum mechanics."}, {"time": 3475, "text": "It was just trying to explain a process that people were seeing in hydronic physics collisions."}, {"time": 3481, "text": "So it took a few more years to get to that point."}, {"time": 3484, "text": "They did notice that, physicists noticed that whenever you try to find the spectrum of strings, you always get a massless particle which has exactly the properties that the graviton is supposed to have."}, {"time": 3496, "text": "And no particle in hydronic physics that had that property."}, {"time": 3500, "text": "You are getting a massless graviton as part of this scattering without looking for it."}, {"time": 3505, "text": "It was forced on you."}, {"time": 3507, "text": "People were not trying to solve quantum gravity."}, {"time": 3509, "text": "Quantum gravity was pushed on them."}, {"time": 3511, "text": "I don't want this graviton."}, {"time": 3513, "text": "Get rid of it."}, {"time": 3514, "text": "They couldn't get rid of it."}, {"time": 3516, "text": "They gave up trying to get rid of it."}, {"time": 3518, "text": "Physicists, Sherk and Schwartz said, you know what, string theory is theory of quantum gravity."}, {"time": 3523, "text": "They've changed their perspective altogether."}, {"time": 3525, "text": "We are not describing the hydronic physics."}, {"time": 3527, "text": "We are describing this theory of quantum gravity."}, {"time": 3529, "text": "And that's when string theory probably got like exciting that this could be the unifying theory."}, {"time": 3536, "text": "Exactly, it got exciting, but at the same time, not so fast."}, {"time": 3539, "text": "Namely, it should have been fast, but it wasn't because particle physics through quantum field theory were so successful at that time."}, {"time": 3547, "text": "This is mid seventies, standard model of physics, electromagnetism and unification of electromagnetic forces with all the other forces were beginning to take place without the gravity part."}, {"time": 3557, "text": "Everything was working beautifully for particle physics."}, {"time": 3560, "text": "And so that was the shining golden age of quantum field theory and all the experiments, standard model, this and that, unification, spontaneous symmetry breaking was taking place."}, {"time": 3569, "text": "All of them was nice."}, {"time": 3571, "text": "This was kind of like a side show and nobody was paying so much attention."}, {"time": 3574, "text": "This exotic string is needed for quantum gravity."}, {"time": 3577, "text": "Maybe there's other ways, maybe we should do something else."}, {"time": 3579, "text": "So, yeah, it wasn't paid much attention to."}, {"time": 3581, "text": "And this took a little bit more effort to try to actually connect it to reality."}, {"time": 3588, "text": "There are a few more steps."}, {"time": 3589, "text": "First of all, there was a puzzle that you were getting extra dimensions."}, {"time": 3593, "text": "String was not working well with three spatial dimension on one time."}, {"time": 3597, "text": "It needed extra dimension."}, {"time": 3599, "text": "Now, there are different versions of strings, but the version that ended up being related to having particles like electron, what we call fermions, needed 10 dimensions, what we call super string."}, {"time": 3612, "text": "Now, why super?"}, {"time": 3613, "text": "Why the word super?"}, {"time": 3613, "text": "It turns out this version of the string, which had fermions, had an extra symmetry, which we call supersymmetry."}, {"time": 3623, "text": "This is a symmetry between a particle and another particle with exactly the same properties, same mass, same charge, et cetera."}, {"time": 3631, "text": "The only difference is that one of them has a little different spin than the other one."}, {"time": 3635, "text": "And one of them is a boson, one of them is a fermion because of that shift of spin."}, {"time": 3641, "text": "Otherwise, they're identical."}, {"time": 3642, "text": "So there was this symmetry."}, {"time": 3643, "text": "String theory had this symmetry."}, {"time": 3645, "text": "In fact, supersymmetry was discovered through string theory, theoretically."}, {"time": 3651, "text": "So theoretically, the first place that this was observed when you were describing these fermionic strings."}, {"time": 3657, "text": "So that was the beginning of the study of supersymmetry was via string theory."}, {"time": 3662, "text": "And then it had remarkable properties that the symmetry meant and so forth that people began studying supersymmetry after that."}, {"time": 3670, "text": "And that was a kind of a tangent direction at the beginning for string theory."}, {"time": 3675, "text": "But people in particle physics started also thinking, oh, supersymmetry is great."}, {"time": 3679, "text": "Let's see if we can have supersymmetry in particle physics and so forth."}, {"time": 3682, "text": "Forget about strings."}, {"time": 3683, "text": "And they developed on a different track as well."}, {"time": 3685, "text": "Supersymmetry in different models became a subject on its own right, understanding supersymmetry and what does this mean?"}, {"time": 3692, "text": "Because it unified bosons and fermion, unified some ideas together."}, {"time": 3696, "text": "So photon is a boson, electron is a fermion."}, {"time": 3699, "text": "Could things like that be somehow related?"}, {"time": 3701, "text": "It was a kind of a natural kind of a question to try to kind of unify because in physics, we love unification."}, {"time": 3708, "text": "Now, gradually, string theory was beginning to show signs of unification."}, {"time": 3711, "text": "It had graviton, but people found that you also have things like photons in them, different excitations of string behave like photons, another one behaves like electron."}, {"time": 3721, "text": "So a single string was unifying all these particles into one object."}, {"time": 3726, "text": "That's remarkable."}, {"time": 3728, "text": "It's in 10 dimensions though."}, {"time": 3730, "text": "It is not our universe because we live in three plus one dimension."}, {"time": 3733, "text": "How could that be possibly true?"}, {"time": 3735, "text": "So this was a conundrum."}, {"time": 3738, "text": "It was elegant, it was beautiful, but it was very specific about which dimension you're getting, which structure you're getting."}, {"time": 3745, "text": "It wasn't saying, oh, you just put D equals to four, you'll get your space time dimension that you want."}, {"time": 3749, "text": "No, it didn't like that."}, {"time": 3750, "text": "It said, I want 10 dimensions and that's the way it is."}, {"time": 3754, "text": "So it was very specific."}, {"time": 3755, "text": "Now, so people try to reconcile this by the idea that, you know, maybe these extra dimensions are tiny."}, {"time": 3761, "text": "So if you take three macroscopic spatial dimensions on one time and six extra tiny spatial dimensions, like tiny spheres or tiny circles, then it avoids contradiction with manifest fact that we haven't seen extra dimensions in experiments today."}, {"time": 3779, "text": "So that was a way to avoid conflict."}, {"time": 3783, "text": "Now, this was a way to avoid conflict, but it was not observed in experiments."}, {"time": 3789, "text": "A string observed in experiments?"}, {"time": 3790, "text": "No, because it's so small."}, {"time": 3792, "text": "So it's beginning to sound a little bit funny."}, {"time": 3796, "text": "Similar feeling to the way perhaps Dirac had felt about this positron plus or minus, you know, it was beginning to sound a little bit like, oh yeah, not only I have to have 10 dimension, but I have to have this, I have to also this."}, {"time": 3808, "text": "And so conservative physicists would say, hmm, you know, I haven't seen these experiments."}, {"time": 3814, "text": "I don't know if they are really there."}, {"time": 3815, "text": "Are you pulling my leg?"}, {"time": 3817, "text": "Do you want me to imagine things that are not there?"}, {"time": 3820, "text": "So this was an attitude of some physicists towards string theory, despite the fact that the puzzle of gravity and quantum mechanics merging together work, but still was this skepticism."}, {"time": 3830, "text": "You're putting all these things that you want me to imagine there, these extra dimensions that I cannot see, aha, aha."}, {"time": 3836, "text": "And you want me to believe that string that you have not even seen the experiments are real, aha, okay, what else do you want me to believe?"}, {"time": 3841, "text": "So this kind of beginning to sound a little funny."}, {"time": 3843, "text": "Now, I will pass forward a little bit further."}, {"time": 3848, "text": "A few decades later, when string theory became the mainstream of efforts to unify the forces and particles together, we learned that these extra dimensions actually solved problems."}, {"time": 3860, "text": "They weren't a nuisance the way they originally appeared."}, {"time": 3864, "text": "First of all, the properties of these extra dimensions reflected the number of particles we got in four dimensions."}, {"time": 3871, "text": "If you took these six dimensions to have like five holes or four holes, change the number of particles that you see in four dimensional space time, you get one electron and one muon if you had this, but if you did the other J shape, you get something else."}, {"time": 3884, "text": "So geometrically, you could get different kinds of physics."}, {"time": 3887, "text": "So it was kind of a mirroring of geometry by physics down in the macroscopic space."}, {"time": 3893, "text": "So these extra dimension were becoming useful."}, {"time": 3896, "text": "Fine, but we didn't need the extra dimension to just write an electron in three dimensions, we did rewrote it, so what?"}, {"time": 3902, "text": "Was there any other puzzle?"}, {"time": 3904, "text": "Yes, there were, Hawking."}, {"time": 3907, "text": "Hawking had been studying black holes in mid 70s following the work of Bekenstein, who had predicted that black holes have entropy."}, {"time": 3917, "text": "So Bekenstein had tried to attach the entropy to the black hole."}, {"time": 3921, "text": "If you throw something into the black hole, the entropy seems to go down because you had something entropy outside the black hole and you throw it, black hole was unique, so the entropy did not have any, black hole had no entropy."}, {"time": 3933, "text": "So the entropy seemed to go down."}, {"time": 3935, "text": "And so that's against the laws of thermodynamics."}, {"time": 3938, "text": "So Bekenstein was trying to say, no, no, therefore black hole must have an entropy."}, {"time": 3942, "text": "So he was trying to understand that he found that if you assign entropy to be proportional to the area of the black hole, it seems to work."}, {"time": 3949, "text": "And then Hawking found not only that's correct, he found the correct proportionality factor of a one quarter of the area and Planck units is the correct amount of entropy."}, {"time": 3959, "text": "And he gave an argument using quantum semi classical arguments, which means basically using a little bit of a quantum mechanics, because he didn't have the full quantum mechanics of string theory, he could do some aspects of approximate quantum arguments."}, {"time": 3972, "text": "So he heuristic quantum arguments led to this entropy formula."}, {"time": 3977, "text": "But then he didn't answer the following question."}, {"time": 3980, "text": "He was getting a big entropy for the black hole, the black hole with the size of the horizon of a black hole is huge, has a huge amount of entropy."}, {"time": 3987, "text": "What are the microstates of this entropy?"}, {"time": 3989, "text": "When you say, for example, the gas is entropy, you count where the atoms are, you count this bucket or that bucket, there's an information about there and so on, you count them."}, {"time": 3998, "text": "For the black hole, the way Hawking was thinking, there was no degree of freedom, you throw them in, and there was just one solution."}, {"time": 4004, "text": "So where are these entropy?"}, {"time": 4006, "text": "What are these microscopic states?"}, {"time": 4010, "text": "They were hidden somewhere."}, {"time": 4011, "text": "So later in string theory, the work that we did with my colleague Strominger, in particular showed that these ingredients in string theory of black hole arise from the extra dimensions."}, {"time": 4026, "text": "So the degrees of freedom are hidden in terms of things like strings, wrapping these extra circles in these hidden dimensions."}, {"time": 4033, "text": "And then we started counting how many ways like the strings can wrap around this circle and the extra dimension or that circle and counted the microscopic degrees of freedom."}, {"time": 4042, "text": "And lo and behold, we got the microscopic degrees of freedom that Hawking was predicting four dimensions."}, {"time": 4047, "text": "So the extra dimensions became useful for resolving a puzzle in four dimensions."}, {"time": 4052, "text": "The puzzle was where are the degrees of freedom of the black hole hidden?"}, {"time": 4056, "text": "The answer, hidden in the extra dimensions."}, {"time": 4059, "text": "The tiny extra dimensions."}, {"time": 4061, "text": "So then by this time, it was beginning to, we see aspects that extra dimensions are useful for many things."}, {"time": 4068, "text": "It wasn't to be kind of, you know, be ashamed of."}, {"time": 4071, "text": "It was actually in the welcome features."}, {"time": 4073, "text": "New feature, nevertheless."}, {"time": 4074, "text": "How do you intuit the 10 dimensional world?"}, {"time": 4079, "text": "So yes, it's a feature for describing certain phenomena like the entropy in black holes, but what you said that to you a theory becomes real or becomes powerful when you can connect it to some deep intuition."}, {"time": 4098, "text": "So how do we intuit 10 dimensions?"}, {"time": 4100, "text": "Yes, so I will explain how some of the analogies work."}, {"time": 4104, "text": "First of all, we do a lot of analogies."}, {"time": 4108, "text": "And by analogies, we build intuition."}, {"time": 4111, "text": "So I will start with this example."}, {"time": 4113, "text": "I will try to explain that if we are in 10 dimensional space, if we have a seven dimensional plane and eight dimensional plane, we ask typically in what space do they intersect each other in what dimension?"}, {"time": 4126, "text": "That might sound like, how do you possibly give an answer to this?"}, {"time": 4130, "text": "So we start with lower dimensions."}, {"time": 4132, "text": "We start with two dimensions."}, {"time": 4133, "text": "We say, if you have one dimension and a point, do they intersect typically on a plane?"}, {"time": 4139, "text": "So a line one dimensional, a point zero dimension on a two dimensional plane, they don't typically meet."}, {"time": 4145, "text": "But if you have a one dimensional line and another line, which is one plus one on a plane, they typically intersect at a point."}, {"time": 4153, "text": "Typically means if you're not parallel, typically they intersect at a point."}, {"time": 4157, "text": "So one plus one is two and in two dimension, they intersect at the zero dimensional point."}, {"time": 4163, "text": "So you see two dimension, one and one, two, two minus two is zero."}, {"time": 4166, "text": "So you get point out of intersection."}, {"time": 4169, "text": "Let's go to three dimension."}, {"time": 4171, "text": "You have a plane, two dimensional plane and a point."}, {"time": 4173, "text": "Do they intersect?"}, {"time": 4174, "text": "No, two and zero."}, {"time": 4177, "text": "How about the plane and a line?"}, {"time": 4179, "text": "A plane is two dimensional and a line is one."}, {"time": 4181, "text": "Two plus one is three."}, {"time": 4182, "text": "In three dimension, a plane and a line meet at points, which is zero dimensional."}, {"time": 4187, "text": "Three minus three is zero."}, {"time": 4189, "text": "Okay, so plane and a line intersect at a point in three dimension."}, {"time": 4194, "text": "How about the plane and a plane in 3D?"}, {"time": 4196, "text": "Well, plane is two and this is two."}, {"time": 4197, "text": "Two plus two is four."}, {"time": 4199, "text": "In 3D, four minus three is one."}, {"time": 4201, "text": "They intersect on a one dimensional line."}, {"time": 4203, "text": "Okay, we're beginning to see the pattern."}, {"time": 4204, "text": "Okay, now come to the question."}, {"time": 4206, "text": "We're in 10 dimension."}, {"time": 4206, "text": "Now we have the intuition."}, {"time": 4208, "text": "We have a seven dimensional plane and eight dimensional plane in 10 dimension."}, {"time": 4211, "text": "They intersect on a plane."}, {"time": 4213, "text": "What's the dimension?"}, {"time": 4214, "text": "Well, seven plus eight is 15 minus 10 is five."}, {"time": 4216, "text": "We draw the same picture as two planes and we write seven dimension, eight dimension, but we have gotten the intuition from the lower dimensional one."}, {"time": 4225, "text": "What to expect?"}, {"time": 4226, "text": "It doesn't scare us anymore."}, {"time": 4228, "text": "So we draw this picture."}, {"time": 4230, "text": "We cannot see all the seven dimensions by looking at this two dimensional visualization of it, but it has all the features we want."}, {"time": 4238, "text": "It has, so we draw this picture."}, {"time": 4239, "text": "It says seven, seven, and they meet at the five dimensional plane."}, {"time": 4243, "text": "It says five."}, {"time": 4244, "text": "So we have built this intuition."}, {"time": 4246, "text": "Now, this is an example of how we come up with intuition."}, {"time": 4251, "text": "Let me give you more examples of it because I think this will show you that people have to come up with intuitions to visualize it."}, {"time": 4257, "text": "Otherwise, we will be a little bit lost."}, {"time": 4260, "text": "So what you just described is kind of in these high dimensional spaces, focus on the meeting place of two planes in high dimensional spaces."}, {"time": 4270, "text": "Exactly, how the planes meet, for example, what's the dimension of their intersection and so on."}, {"time": 4274, "text": "So how do we come up with intuition?"}, {"time": 4276, "text": "We borrow examples from lower dimensions, build up intuition and draw the same pictures as if we are talking about 10 dimensions, but we are drawing the same as a two dimensional plane because we cannot do any better."}, {"time": 4288, "text": "But our words change, but not our pictures."}, {"time": 4292, "text": "So your sense is we can have a deep understanding of reality by looking at its slices, at lower dimensional slices."}, {"time": 4301, "text": "And this brings me to the next example I wanna mention, which is sphere."}, {"time": 4306, "text": "Let's think about how do we think about the sphere?"}, {"time": 4308, "text": "Well, the sphere is a sphere, the round nice thing, but sphere has a circular symmetry."}, {"time": 4313, "text": "Now, I can describe the sphere in the following way."}, {"time": 4317, "text": "I can describe it by an interval, which is thinking about this going from the north of the sphere to the south."}, {"time": 4326, "text": "And at each point, I have a circle attached to it."}, {"time": 4329, "text": "So you can think about the sphere as a line with a circle attached with each point, the circle shrinks to a point at end points of the interval."}, {"time": 4338, "text": "So I can say, oh, one way to think about the sphere is an interval where at each point on that interval, there's another circle I'm not drawing."}, {"time": 4347, "text": "But if you like, you can just draw it."}, {"time": 4349, "text": "Say, okay, I won't draw it."}, {"time": 4350, "text": "So from now on, there's this mnemonic."}, {"time": 4352, "text": "I draw an interval when I wanna talk about the sphere and you remember that the end points of the interval mean a strong circle, that's all."}, {"time": 4359, "text": "And they say, yeah, I see, that's a sphere, good."}, {"time": 4361, "text": "Now, we wanna talk about the product of two spheres."}, {"time": 4364, "text": "That's four dimensional, how can I visualize it?"}, {"time": 4367, "text": "Easy, you just take an interval and another interval, that's just gonna be a square."}, {"time": 4374, "text": "A square is a four dimensional space, yeah, why is that?"}, {"time": 4377, "text": "Well, at each point on the square, there's two circles, one for each of those directions you drew."}, {"time": 4384, "text": "And when you get to the boundaries of each direction, one of the circles shrink on each edge of that square."}, {"time": 4389, "text": "And when you get to the corners of the square, all both circles shrink."}, {"time": 4393, "text": "This is a sphere times a sphere, I have defined interval."}, {"time": 4397, "text": "I just described for you a four dimensional space."}, {"time": 4400, "text": "Do you want a six dimensional space?"}, {"time": 4401, "text": "No problem, take a corner of a room."}, {"time": 4405, "text": "In fact, if you want to have a sphere times a sphere times a sphere times a sphere, take a cube."}, {"time": 4412, "text": "A cube is a rendition of this six dimensional space, two sphere times another sphere times another sphere, where three of the circles I'm not drawing for you."}, {"time": 4421, "text": "For each one of those directions, there's another circle."}, {"time": 4423, "text": "But each time you get to the boundary of the cube, one circle shrinks."}, {"time": 4427, "text": "When the boundaries meet, two circles shrinks."}, {"time": 4428, "text": "When three boundaries meet, all the three circles shrink."}, {"time": 4431, "text": "So I just give you a picture."}, {"time": 4433, "text": "Now, mathematicians come up with amazing things."}, {"time": 4435, "text": "Like, you know what, I want to take a point in space and blow it up."}, {"time": 4439, "text": "You know, these concepts like topology and geometry, complicated, how do you do?"}, {"time": 4443, "text": "In this picture, it's very easy."}, {"time": 4445, "text": "Blow it up in this picture means the following."}, {"time": 4447, "text": "You think about this cube, you go to the corner and you chop off a corner."}, {"time": 4452, "text": "Chopping off the corner replaces the point."}, {"time": 4456, "text": "Replace the point by a triangle."}, {"time": 4458, "text": "So you're blowing up a point and then this triangle is what they call P2, projective two space."}, {"time": 4462, "text": "But these pictures are very physical and you feel it."}, {"time": 4465, "text": "There's nothing amazing."}, {"time": 4466, "text": "I'm not talking about six dimension."}, {"time": 4468, "text": "Four plus six is 10, the dimension of string theory."}, {"time": 4470, "text": "So we can visualize it, no problem."}, {"time": 4472, "text": "Okay, so that's building the intuition to a complicated world of string theory."}, {"time": 4476, "text": "Nevertheless, these objects are really small."}, {"time": 4479, "text": "And just like you said, experimental validation is very difficult because the objects are way smaller than anything that we currently have the tools and accelerators and so on to reveal through experiment."}, {"time": 4493, "text": "So there's a kind of skepticism that's not just about the nature of the theory because of the 10 dimensions, as you've explained, but in that we can't experimentally validate it and it doesn't necessarily, to date, maybe you can correct me, predict something fundamentally new."}, {"time": 4512, "text": "So it's beautiful as an explaining theory, which means that it's very possible that it is a fundamental theory that describes reality and unifies the laws, but there's still a kind of skepticism."}, {"time": 4525, "text": "And me, from sort of an outside observer perspective, have been observing a little bit of a growing cynicism about string theory in the recent few years."}, {"time": 4537, "text": "Can you describe the cynicism about, sort of by cynicism I mean a cynicism about the hope for this theory of pushing theoretical physics forward?"}, {"time": 4550, "text": "Can you do describe why this is cynicism and how do we reverse that trend?"}, {"time": 4556, "text": "Yes, first of all, the criticism for string theory is healthy in a sense that in science we have to have different viewpoints and that's good."}, {"time": 4567, "text": "So I welcome criticism and the reason for criticism and I think that is a valid reason is that there has been zero experimental evidence for string theory."}, {"time": 4577, "text": "That is no experiment has been done to show that there's this loop of energy moving around."}, {"time": 4584, "text": "And so that's a valid objection and valid worry."}, {"time": 4588, "text": "And if I were to say, you know what, string theory can never be verified or experimentally checked, that's the way it is, they would have every right to say what you're talking about is not science."}, {"time": 4597, "text": "Because in science we will have to have experimental consequences and checks."}, {"time": 4602, "text": "The difference between string theory and something which is not scientific is that string theory has predictions."}, {"time": 4607, "text": "The problem is that the predictions we have today of string theory is hard to access by experiments available with the energies we can achieve with the colliders today."}, {"time": 4616, "text": "It doesn't mean there's a problem with string theory, it just means technologically we're not that far ahead."}, {"time": 4621, "text": "Now, we can have two attitudes."}, {"time": 4624, "text": "You say, well, if that's the case, why are you studying this subject?"}, {"time": 4627, "text": "Because you can't do experiment today."}, {"time": 4629, "text": "Now, this is becoming a little bit more like mathematics in that sense."}, {"time": 4633, "text": "You say, well, I want to learn, I want to know how the nature works even though I cannot prove it today that this is it because of experiments."}, {"time": 4641, "text": "That should not prevent my mind not to think about it."}, {"time": 4644, "text": "So that's the attitude many string theorists follow, that it should be like this."}, {"time": 4648, "text": "Now, so that's an answer to the criticism, but there's actually a better answer to the criticism, I would say."}, {"time": 4654, "text": "We don't have experimental evidence for string theory, but we have theoretical evidence for string theory."}, {"time": 4659, "text": "And what do I mean by theoretical evidence for string theory?"}, {"time": 4662, "text": "String theory has connected different parts of physics together."}, {"time": 4667, "text": "It didn't have to."}, {"time": 4669, "text": "It has brought connections between part of physics, although suppose you're just interested in particle physics."}, {"time": 4674, "text": "Suppose you're not even interested in gravity at all."}, {"time": 4677, "text": "It turns out there are properties of certain particle physics models that string theory has been able to solve using gravity, using ideas from string theory, ideas known as holography, which is relating something which has to do with particles to something having to do with gravity."}, {"time": 4695, "text": "Why did it have to be this rich?"}, {"time": 4697, "text": "The subject is very rich."}, {"time": 4700, "text": "It's not something we were smart enough to develop."}, {"time": 4703, "text": "It came at us."}, {"time": 4703, "text": "As I explained to you, the development of string theory came from accidental discovery."}, {"time": 4708, "text": "It wasn't because we were smart enough to come up with the idea, oh yeah, string of course has gravity in it."}, {"time": 4712, "text": "No, it was accidental discovery."}, {"time": 4714, "text": "So some people say it's not fair to say we have no evidence for string theory."}, {"time": 4718, "text": "Graviton, gravity is an evidence for string theory."}, {"time": 4721, "text": "It's predicted by string theory."}, {"time": 4723, "text": "We didn't put it by hand, we got it."}, {"time": 4725, "text": "So there's a qualitative check."}, {"time": 4727, "text": "Okay, gravity is a prediction of string theory."}, {"time": 4731, "text": "It's a postdiction because we know gravity existed."}, {"time": 4733, "text": "But still, logically it is a prediction because really we didn't know it had the graviton that we later learned that, oh, that's the same as gravity."}, {"time": 4742, "text": "So literally that's the way it was discovered."}, {"time": 4744, "text": "It wasn't put in by hand."}, {"time": 4746, "text": "So there are many things like that, that there are different facets of physics, like questions in condensed matter physics, questions of particle physics, questions about this and that have come together to find beautiful answers by using ideas from string theory at the same time as a lot of new math has emerged."}, {"time": 4767, "text": "That's an aspect which I wouldn't emphasize as evidence to physicists necessarily, because they would say, okay, great, you got some math, but what's it do with reality?"}, {"time": 4775, "text": "But as I explained, many of the physical principles we know of have beautiful math underpinning them."}, {"time": 4781, "text": "So it certainly leads further confidence that we may not be going astray, even though that's not the full proof as we know."}, {"time": 4789, "text": "So there are these aspects that give further evidence for string theory, connections between each other, connection with the real world, but then there are other things that come about and I can try to give examples of that."}, {"time": 4801, "text": "So these are further evidences and these are certain predictions of string theory."}, {"time": 4805, "text": "They are not as detailed as we want, but there are still predictions."}, {"time": 4811, "text": "Why is the dimension of space and time three plus one?"}, {"time": 4816, "text": "Say, I don't know, just deal with it, three plus one."}, {"time": 4820, "text": "But in physics, we want to know why."}, {"time": 4823, "text": "Well, take a random dimension from one to infinity."}, {"time": 4826, "text": "What's your random dimension?"}, {"time": 4828, "text": "A random dimension from one to infinity would not be four."}, {"time": 4833, "text": "Eight would most likely be a humongous number, if not infinity."}, {"time": 4836, "text": "I mean, there's no, if you choose any reasonable distribution which goes from one to infinity, three or four would not be your pick."}, {"time": 4844, "text": "The fact that we are in three or four dimension is already strange."}, {"time": 4848, "text": "The fact that strings are sorry, I cannot go beyond 10 or maybe 11 or something."}, {"time": 4852, "text": "The fact that there's this upper bound, the range is not from one to infinity, it's from one to 10 or 11 or whatnot, it already brings a natural prior."}, {"time": 4860, "text": "Oh yeah, three or four is just on the average."}, {"time": 4863, "text": "If you pick some of the compactification, then it could easily be that."}, {"time": 4866, "text": "So in other words, it makes it much more possible that it could be three of our universe."}, {"time": 4871, "text": "So the fact that the dimension already is so small, it should be surprising."}, {"time": 4876, "text": "We don't ask that question."}, {"time": 4877, "text": "We should be surprised because we could have conceived of universes with our pre dimension."}, {"time": 4882, "text": "Why is it that we have such a small dimension?"}, {"time": 4884, "text": "That's number one."}, {"time": 4885, "text": "So good theory of the universe should give you an intuition of the why it's four or three plus one."}, {"time": 4893, "text": "And it's not obvious that it should be."}, {"time": 4896, "text": "That should be explained."}, {"time": 4897, "text": "We take that as an assumption, but that's a thing that should be explained."}, {"time": 4903, "text": "Yeah, so we haven't explained that in string theory."}, {"time": 4905, "text": "Actually, I did write a model within string theory to try to describe why we end up with three plus one space time dimensions, which are big compared to the rest of them."}, {"time": 4914, "text": "And even though this has not been, the technical difficulties to prove it is still not there, but I will explain the idea because the idea connects to some other piece of elegant math, which is the following."}, {"time": 4926, "text": "Consider a universe made of a box, three dimensional box."}, {"time": 4931, "text": "Or in fact, if we start in string theory, nine dimensional box, because we have nine spatial dimension on one time."}, {"time": 4937, "text": "So imagine a nine dimensional box."}, {"time": 4940, "text": "So we should imagine the box of a typical size of the string, which is small."}, {"time": 4945, "text": "So the universe would naturally start with a very tiny nine dimensional box."}, {"time": 4950, "text": "What do strings do?"}, {"time": 4951, "text": "Well, strings go around the box and move around and vibrate and all that, but also they can wrap around one side of the box to the other because I'm imagining a box with periodic boundary conditions."}, {"time": 4962, "text": "So what we call the torus."}, {"time": 4964, "text": "So the string can go from one side to the other."}, {"time": 4966, "text": "This is what we call a winding string."}, {"time": 4968, "text": "The string can wind around the box."}, {"time": 4970, "text": "Now, suppose you have, you've now evolved the universe."}, {"time": 4974, "text": "Because there's energy, the universe starts to expand."}, {"time": 4977, "text": "But it doesn't expand too far."}, {"time": 4980, "text": "Why is it?"}, {"time": 4981, "text": "Well, because there are these strings which are wrapped around from one side of the wall to the other."}, {"time": 4987, "text": "When the universe, the walls of the universe are growing, it is stretching the string and the strings are becoming very, very massive."}, {"time": 4995, "text": "So it becomes difficult to expand."}, {"time": 4996, "text": "It kind of puts a halt on it."}, {"time": 4998, "text": "In order to not put a halt, a string which is going this way and a string which is going that way should intersect each other and disconnect each other and unwind."}, {"time": 5007, "text": "So a string which winds this way and the string which finds the opposite way should find each other to reconnect and this way disappear."}, {"time": 5017, "text": "So if they find each other and they disappear."}, {"time": 5020, "text": "But how can strings find each other?"}, {"time": 5022, "text": "Well, the string moves and another string moves."}, {"time": 5025, "text": "A string is one dimensional, one plus one is two and one plus one is two and two plus two is four."}, {"time": 5032, "text": "In four dimensional space time, they will find each other."}, {"time": 5035, "text": "In a higher dimensional space time, they typically miss each other."}, {"time": 5040, "text": "So if the dimension were too big, they would miss each other, they wouldn't be able to expand."}, {"time": 5044, "text": "So in order to expand, they have to find each other and three of them can find each other and those can expand and the other one will be stuck."}, {"time": 5050, "text": "So that explains why within string theory, these particular dimensions are really big and full of exciting stuff."}, {"time": 5056, "text": "That could be an explanation."}, {"time": 5057, "text": "That's a model we suggested with my colleague Brandenberger."}, {"time": 5061, "text": "But it turns out to be related to a deep piece of math."}, {"time": 5063, "text": "You see, for mathematicians, manifolds of dimension bigger than four are simple."}, {"time": 5071, "text": "Four dimension is the hardest dimension for math, it turns out."}, {"time": 5075, "text": "And it turns out the reason it's difficult is the following."}, {"time": 5078, "text": "It turns out that in higher dimension, you use what's called surgery in mathematical terminology, where you use these two dimensional tubes to maneuver them off of each other."}, {"time": 5090, "text": "So you have two plus two becoming four."}, {"time": 5093, "text": "In higher than four dimension, you can pass them through each other without them intersecting."}, {"time": 5097, "text": "In four dimension, two plus two doesn't allow you to pass them through each other."}, {"time": 5103, "text": "So the same techniques that work in higher dimension don't work in four dimension because two plus two is four."}, {"time": 5108, "text": "The same reasoning I was just telling you about strings finding each other in four ends up to be the reason why four is much more complicated to classify for mathematicians as well."}, {"time": 5118, "text": "So there might be these things."}, {"time": 5120, "text": "So I cannot say that this is the reason that string theory is giving you three plus one, but it could be a model for it."}, {"time": 5126, "text": "And so there are these kinds of ideas that could underlie why we have three extra dimensions which are large and the rest of them are small."}, {"time": 5132, "text": "But absolutely, we have to have a good reason."}, {"time": 5135, "text": "We cannot leave it like that."}, {"time": 5136, "text": "Can I ask a tricky human question?"}, {"time": 5138, "text": "So you are one of the seminal figures in string theory."}, {"time": 5142, "text": "You got the Breakthrough Prize."}, {"time": 5144, "text": "You've worked with Edward Witten."}, {"time": 5145, "text": "There's no Nobel Prize that has been given on string theory."}, {"time": 5151, "text": "Credit assignment is tricky in science."}, {"time": 5154, "text": "It makes you quite sad, especially big, like LIGO, big experimental projects when so many incredible people have been involved and yet the Nobel Prize is annoying in that it's only given to three people."}, {"time": 5166, "text": "Who do you think gets the Nobel Prize for string theory at first?"}, {"time": 5172, "text": "If it turns out that it, if not in full, then in part, is a good model of the way the physics of the universe works."}, {"time": 5184, "text": "Who are the key figures?"}, {"time": 5186, "text": "Maybe let's put Nobel Prize aside."}, {"time": 5189, "text": "Okay, I like the second version of the question."}, {"time": 5191, "text": "Because I think to try to give a prize to one person in string theory doesn't do justice to the diversity of the subject."}, {"time": 5197, "text": "That to me is."}, {"time": 5198, "text": "So there was quite a lot of incredible people in the history of string theory."}, {"time": 5201, "text": "Quite a lot of people."}, {"time": 5203, "text": "I mean, starting with Veneziano, who wasn't talking about strings."}, {"time": 5206, "text": "I mean, he wrote down the beginning of the strings."}, {"time": 5208, "text": "We cannot ignore that for sure."}, {"time": 5210, "text": "And so you start with that and you go on with various other figures and so on."}, {"time": 5214, "text": "So there are different epochs in string theory and different people have been pushing it."}, {"time": 5217, "text": "And so for example, the early epoch, we just told you people like Veneziano, and Nambu, and the Susskind, and others were pushing it."}, {"time": 5225, "text": "Green and Schwarz were pushing it and so forth."}, {"time": 5227, "text": "So this was, or Scherck and so on."}, {"time": 5229, "text": "So these were the initial periods of pioneers, I would say, of string theory."}, {"time": 5234, "text": "And then there were the mid 80s that Edward Witten was the major proponent of string theory."}, {"time": 5240, "text": "And he really changed the landscape of string theory in terms of what people do and how we view it."}, {"time": 5246, "text": "And I think his efforts brought a lot of attention to the community of string theory."}, {"time": 5251, "text": "To the community about high energy community to focus on this effort as the correct theory of unification of forces."}, {"time": 5258, "text": "So he brought a lot of research as well as, of course, the first rate work he himself did to this area."}, {"time": 5264, "text": "So that's in mid 80s and onwards, and also in mid 90s where he was one of the proponents of the duality revolution in string theory."}, {"time": 5271, "text": "And with that came a lot of these other ideas that led to breakthroughs involving, for example, the example I told you about black holes and holography, and the work that was later done by Maldacena about the properties of duality between particle physics and quantum gravity and the deeper connections of holography, and it continues."}, {"time": 5292, "text": "And there are many people within this range, which I haven't even mentioned."}, {"time": 5296, "text": "They have done fantastic important things."}, {"time": 5300, "text": "How it gets recognized, I think, is secondary, in my opinion, than the appreciation that the effort is collective."}, {"time": 5307, "text": "That, in fact, that to me is the more important part of science that gets forgotten."}, {"time": 5312, "text": "For some reason, humanity likes heroes, and science is no exception."}, {"time": 5316, "text": "We like heroes, but I personally try to avoid that trap."}, {"time": 5320, "text": "I feel, in my work, most of my work is with colleagues."}, {"time": 5324, "text": "I have much more collaborations than sole author papers, and I enjoy it, and I think that that's, to me, one of the most satisfying aspects of science is to interact and learn and debate ideas with colleagues because that influx of ideas enriches it, and that's why I find it interesting."}, {"time": 5345, "text": "To me, science, if I was on an island, and if I was developing string theory by myself and had nothing to do with anybody, it would be much less satisfying, in my opinion."}, {"time": 5354, "text": "Even if I could take credit I did it, it won't be as satisfying."}, {"time": 5358, "text": "Sitting alone with a big metal drinking champagne, no."}, {"time": 5362, "text": "I think, to me, the collective work is more exciting, and you mentioned my getting the breakthrough."}, {"time": 5368, "text": "When I was getting it, I made sure to mention that it is because of the joint work that I've done with colleagues."}, {"time": 5373, "text": "At that time, it was around 180 or so collaborators, and I acknowledged them in the webpage for them."}, {"time": 5379, "text": "I write all of their names and the collaborations that led to this."}, {"time": 5382, "text": "So, to me, science is fun when it's collaboration, and yes, there are more important and less important figures, as in any field, and that's true, that's true in string theory as well, but I think that I would like to view this as a collective effort."}, {"time": 5396, "text": "So, setting the heroes aside, the Nobel Prize is a celebration of, what's the right way to put it, that this idea turned out to be right."}, {"time": 5408, "text": "So, like, you look at Einstein didn't believe in black holes, and then black holes got their Nobel Prize."}, {"time": 5417, "text": "Do you think string theory will get its Nobel Prize, Nobel Prizes, if you were to bet money?"}, {"time": 5425, "text": "If this was an investment meeting and we had to bet all our money, do you think he gets the Nobel Prizes?"}, {"time": 5431, "text": "I think it's possible that none of the living physicists will get the Nobel Prize in string theory, but somebody will."}, {"time": 5437, "text": "Because, unfortunately, the technology available today is not very encouraging in terms of seeing directly evidence for string theory."}, {"time": 5446, "text": "Do you think it ultimately boils down to the Nobel Prize will be given when there is some direct or indirect evidence?"}, {"time": 5453, "text": "There would be, but I think that part of this breakthrough prize was precisely the appreciation that when we have sufficient evidence, theoretical as it is, not experiment, because of this technology lag, you appreciate what you think is the correct path."}, {"time": 5468, "text": "So, there are many people who have been recognized precisely because they may not be around when it actually gets experimented, even though they discovered it."}, {"time": 5477, "text": "So, there are many things like that that's going on in science."}, {"time": 5481, "text": "So, I think that I would want to attach less significance to the recognitions of people."}, {"time": 5488, "text": "And I have a second review on this, which is there are people who look at these works that people have done and put them together and make the next big breakthrough."}, {"time": 5499, "text": "And they get identified with, perhaps rightly, with many of these new visions."}, {"time": 5507, "text": "But they are on the shoulders of these little scientists."}, {"time": 5511, "text": "Which don't get any recognition."}, {"time": 5514, "text": "You know, yeah, you did this little work."}, {"time": 5515, "text": "Oh yeah, you did this little work."}, {"time": 5516, "text": "Oh yeah, yeah, five of you."}, {"time": 5517, "text": "Oh yeah, these showed this pattern."}, {"time": 5519, "text": "And then somebody else, it's not fair."}, {"time": 5521, "text": "To me, those little guys, which kind of like, like seem to do the little calculation here, a little thing there, which doesn't rise to the occasion of this grandiose kind of thing, doesn't make it to the New York Times headlines and so on, deserve a lot of recognition."}, {"time": 5537, "text": "And I think they don't get enough."}, {"time": 5538, "text": "I would say that there should be this Nobel prize for, you know, they have these Doctors Without Borders, they're a huge group."}, {"time": 5544, "text": "They should do a similar thing."}, {"time": 5545, "text": "And these String Theors Without Borders kind of, everybody is doing a lot of work."}, {"time": 5549, "text": "And I think that I would like to see that effort recognized."}, {"time": 5552, "text": "I think in the long arc of history, we're all little guys and girls standing on the shoulders of each other."}, {"time": 5560, "text": "I mean, it's all going to look tiny in retrospect."}, {"time": 5564, "text": "If we celebrate, the New York Times, you know, as a newspaper, or the idea of a newspaper in a few centuries from now will be long forgotten."}, {"time": 5576, "text": "Yes, I agree with that."}, {"time": 5577, "text": "Especially in the context of String Theory, we should have a very long term view."}, {"time": 5581, "text": "Just as a tiny tangent, we mentioned Edward Witten."}, {"time": 5585, "text": "And he, in a bunch of walks of life for me as an outsider, comes up as a person who is widely considered as like one of the most brilliant people in the history of physics, just as a powerhouse of a human, like the exceptional places that a human mind can rise to."}, {"time": 5608, "text": "You've gotten the chance to work with him."}, {"time": 5609, "text": "What's he like?"}, {"time": 5610, "text": "Yes, more than that."}, {"time": 5611, "text": "He was my advisor, PhD advisor."}, {"time": 5614, "text": "So I got to know him very well and I benefited from his insights."}, {"time": 5617, "text": "In fact, what you said about him is accurate."}, {"time": 5620, "text": "He is not only brilliant, but he is also multifaceted in terms of the impact he has had in not only physics, but also mathematics."}, {"time": 5629, "text": "He has gotten the Fields Medal because of his work in mathematics."}, {"time": 5632, "text": "And rightly so, he has used his knowledge of physics in a way which impacted deep ideas in modern mathematics."}, {"time": 5641, "text": "And that's an example of the power of these ideas in modern high energy physics and string theory, the applicability of it to modern mathematics."}, {"time": 5651, "text": "So he's quite an exceptional individual."}, {"time": 5656, "text": "We don't come across such people a lot in history."}, {"time": 5659, "text": "So I think, yes, indeed, he's one of the rare figures in this history of subject."}, {"time": 5664, "text": "He has had great impact on a lot of aspects of not just string theory, a lot of different areas in physics, and also, yes, in mathematics as well."}, {"time": 5672, "text": "So I think what you said about him is accurate."}, {"time": 5674, "text": "I had the pleasure of interacting with him as a student and later on as colleagues writing papers together and so on."}, {"time": 5681, "text": "What impact did he have on your life?"}, {"time": 5683, "text": "Like what have you learned from him?"}, {"time": 5686, "text": "If you were to look at the trajectory of your mind of the way you approach science and physics and mathematics, how did he perturb that trajectory in a way?"}, {"time": 5694, "text": "Yes, he did actually."}, {"time": 5695, "text": "So I can explain because when I was a student, I had the biggest impact by him, clearly as a grad student at Princeton."}, {"time": 5702, "text": "So I think that was a time where I was a little bit confused about the relation between math and physics."}, {"time": 5708, "text": "I got a double major in mathematics and physics at MIT because I really enjoyed both."}, {"time": 5714, "text": "And I liked the elegance and the rigor of mathematics."}, {"time": 5718, "text": "And I liked the power of ideas in physics and its applicability to reality and what it teaches about the real world around us."}, {"time": 5726, "text": "But I saw this tension between rigorous thinking in mathematics and lack thereof in physics."}, {"time": 5733, "text": "And this troubled me to no end."}, {"time": 5736, "text": "I was troubled by that."}, {"time": 5738, "text": "So I was at crossroads when I decided to go to graduate school in physics because I did not like some of the lack of rigors I was seeing in physics."}, {"time": 5747, "text": "On the other hand, to me, mathematics, even though it was rigorous, I didn't see the point of it."}, {"time": 5753, "text": "In other words, the math theorem by itself could be beautiful but I really wanted more than that."}, {"time": 5758, "text": "I wanted to say, okay, what does it teach us about something else, something more than just math?"}, {"time": 5762, "text": "So I wasn't that enamored with just math but physics was a little bit bothersome."}, {"time": 5767, "text": "Nevertheless, I decided to go to physics and I decided to go to Princeton and I started working with Edward Witten as my thesis advisor."}, {"time": 5775, "text": "And at that time I was trying to put physics in rigorous mathematical terms."}, {"time": 5782, "text": "I took quantum field theory."}, {"time": 5783, "text": "I tried to make rigorous out of it and so on."}, {"time": 5786, "text": "And no matter how hard I was trying, I was not being able to do that."}, {"time": 5791, "text": "And I was falling behind from my classes."}, {"time": 5793, "text": "I was not learning much physics and I was not making it rigorous."}, {"time": 5797, "text": "And to me, it was this dichotomy between math and physics."}, {"time": 5800, "text": "What am I doing?"}, {"time": 5801, "text": "I like math but this is not exactly this."}, {"time": 5805, "text": "There comes Edward Witten as my advisor and I see him in action thinking about math and physics."}, {"time": 5812, "text": "He was amazing in math."}, {"time": 5813, "text": "He knew all about the math."}, {"time": 5814, "text": "It was no problem with him."}, {"time": 5816, "text": "But he thought about physics in a way which did not find this tension between the two."}, {"time": 5822, "text": "It was much more harmonious."}, {"time": 5824, "text": "For him, he would draw the Feynman diagrams but he wouldn't view it as a formalism."}, {"time": 5828, "text": "He was viewed, oh yeah, the particle goes over there and this is what's going on."}, {"time": 5831, "text": "And so wait, you're thinking really, is this particle, this is really electron going there?"}, {"time": 5836, "text": "It's not the form or the result perturbation."}, {"time": 5839, "text": "You just feel like the electron."}, {"time": 5841, "text": "You're moving with this guy and do that and so on."}, {"time": 5843, "text": "And you're thinking invariantly about physics or the way he thought about relativity."}, {"time": 5847, "text": "Like I was thinking about this momentum system."}, {"time": 5849, "text": "He was thinking invariantly about physics, just like the way you think about invariant concepts and relativity, which don't depend on the frame of reference."}, {"time": 5856, "text": "He was thinking about the physics in invariant ways, the way that doesn't, that gives you a bigger perspective."}, {"time": 5862, "text": "So this gradually helped me appreciate that interconnections between ideas and physics replaces mathematical rigor."}, {"time": 5873, "text": "That the different facets reinforce each other."}, {"time": 5876, "text": "They say, oh, I cannot rigorously define what I mean by this, but this thing connects with this other physics I've seen and this other thing."}, {"time": 5882, "text": "And they together form an elegant story."}, {"time": 5886, "text": "And that replaced for me what I believed as a solidness, which I found in math as a rigor, solid."}, {"time": 5893, "text": "I found that replaced the rigor and solidness in physics."}, {"time": 5896, "text": "So I found, okay, that's the way you can hang onto."}, {"time": 5899, "text": "It is not wishy washy."}, {"time": 5900, "text": "It's not like somebody is just not being able to prove it, just making up a story."}, {"time": 5904, "text": "It was more than that."}, {"time": 5905, "text": "And it was no tension with mathematics."}, {"time": 5908, "text": "In fact, mathematics was helping it, like friends."}, {"time": 5911, "text": "And so much more harmonious and gives insights to physics."}, {"time": 5914, "text": "So that's, I think, one of the main things I learned from interactions with Witten."}, {"time": 5918, "text": "And I think that now perhaps I have taken that to a far extreme."}, {"time": 5923, "text": "Maybe he wouldn't go this far as I have."}, {"time": 5925, "text": "Namely, I use physics to define new mathematics in a way which would be far less rigorous than a physicist might necessarily believe, because I take the physical intuition, perhaps literally in many ways that could teach us about."}, {"time": 5938, "text": "So now I've gained so much confidence in physical intuition that I make bold statements that sometimes takes math friends off guard."}, {"time": 5948, "text": "So an example of it is mirror symmetry."}, {"time": 5950, "text": "So we were studying these compactification of string geometries."}, {"time": 5955, "text": "This is after my PhD now."}, {"time": 5957, "text": "I've, by the time I come to Harvard, we're studying these aspects of string compactification on these complicated manifolds, six dimensional spaces called Kalabial manifolds, very complicated."}, {"time": 5968, "text": "And I noticed with a couple other colleagues that there was a symmetry in physics suggested between different Kalabials."}, {"time": 5976, "text": "It suggested that you couldn't actually compute the Euler characteristic of a Kalabia."}, {"time": 5982, "text": "Euler characteristic is counting the number of points minus the number of edges plus the number of faces minus."}, {"time": 5988, "text": "So you can count the alternating sequence of properties of a space, which is a topological property of a space."}, {"time": 5994, "text": "So Euler characteristics of the Kalabia was a property of the space."}, {"time": 5997, "text": "And so we noticed that from the physics formalism, if string moves in a Kalabia, you cannot distinguish, we cannot compute the Euler characteristic."}, {"time": 6007, "text": "You can only compute the absolute value of it."}, {"time": 6010, "text": "Now this bothered us because how could you not compute the actual sign unless the both sides were the same?"}, {"time": 6018, "text": "So I conjectured maybe for every Kalabia with Euler characteristics positive, there's one with negative."}, {"time": 6023, "text": "I told this to my colleague Yao who's namesake is Kalabia, that I'm making this conjecture."}, {"time": 6031, "text": "Is it possible that for every Kalabia, there's one with the opposite Euler characteristic?"}, {"time": 6036, "text": "Sounds not reasonable."}, {"time": 6037, "text": "I said, why?"}, {"time": 6038, "text": "He said, well, we know more Kalabias with negative Euler characteristics than positive."}, {"time": 6044, "text": "I said, but physics says we cannot distinguish them."}, {"time": 6046, "text": "At least I don't see how."}, {"time": 6047, "text": "So we conjectured that for every Kalabia with one sign, there's the other one, despite the mathematical evidence, despite the mathematical evidence, despite the expert telling us it's not the right idea."}, {"time": 6059, "text": "If a few years later, this symmetry, mirror symmetry between the sign with the opposite sign was later confirmed by mathematicians."}, {"time": 6066, "text": "So this is actually the opposite view."}, {"time": 6069, "text": "That is physics is so sure about it that you're going against the mathematical wisdom, telling them they better look for it."}, {"time": 6075, "text": "So taking the physical intuition literally and then having that drive the mathematics."}, {"time": 6082, "text": "And now we are so confident about many such examples that has affected modern mathematics in ways like this, that we are much more confident about our understanding of what string theory is."}, {"time": 6093, "text": "These are another aspects, other aspects of why we feel string theory is correct."}, {"time": 6097, "text": "It's doing these kinds of things."}, {"time": 6099, "text": "I've been hearing your talk quite a bit about string theory, landscape and the swamp land."}, {"time": 6106, "text": "What the heck are those two concepts?"}, {"time": 6107, "text": "Okay, very good question."}, {"time": 6108, "text": "So let's go back to what I was describing about Feynman."}, {"time": 6111, "text": "Feynman was trying to do these diagrams for graviton and electrons and all that."}, {"time": 6117, "text": "He found that he's getting infinities he cannot resolve."}, {"time": 6121, "text": "Okay, the natural conclusion is that field theories and gravity and quantum theory don't go together and you cannot have it."}, {"time": 6128, "text": "So in other words, field theories and gravity are inconsistent with quantum mechanics, period."}, {"time": 6134, "text": "String theory came up with examples but didn't address the question more broadly that is it true that every field theory can be coupled to gravity in a quantum mechanical way?"}, {"time": 6147, "text": "It turns out that Feynman was essentially right."}, {"time": 6150, "text": "Almost all particle physics theories, no matter what you add to it, when you put gravity in it, doesn't work."}, {"time": 6158, "text": "Only rare exceptions work."}, {"time": 6161, "text": "So string theory are those rare exceptions."}, {"time": 6164, "text": "So therefore the general principle that Feynman found was correct."}, {"time": 6167, "text": "Quantum field theory and gravity and quantum mechanics don't go together except for Joule's exceptional cases."}, {"time": 6174, "text": "There are exceptional cases."}, {"time": 6176, "text": "Okay, the total vastness of quantum field theories that are there we call the set of quantum field theories, possible things."}, {"time": 6185, "text": "Which ones can be consistently coupled to gravity?"}, {"time": 6189, "text": "We call that subspace the landscape."}, {"time": 6193, "text": "The rest of them we call the swampland."}, {"time": 6196, "text": "It doesn't mean they are bad quantum field theories, they are perfectly fine."}, {"time": 6199, "text": "But when you couple them to gravity, they don't make sense, unfortunately."}, {"time": 6204, "text": "And it turns out that the ratio of them, the number of theories which are consistent with gravity to the ones without, the ratio of the area of the landscape to the swampland, in other words, is measure zero."}, {"time": 6217, "text": "So the swampland's infinitely large?"}, {"time": 6220, "text": "The swampland's infinitely large."}, {"time": 6221, "text": "So let me give you one example."}, {"time": 6223, "text": "Take a theory in four dimension with matter with maximum amount of supersymmetry."}, {"time": 6228, "text": "Can you get, it turns out a theory in four dimension with maximum amount of supersymmetry is characterized just with one thing, a group."}, {"time": 6236, "text": "What we call the gauge group."}, {"time": 6238, "text": "Once you pick a group, you have to find the theory."}, {"time": 6241, "text": "Okay, so does every group make sense?"}, {"time": 6245, "text": "As far as quantum field theory, every group makes sense."}, {"time": 6247, "text": "There are infinitely many groups, there are infinitely many quantum field theories."}, {"time": 6250, "text": "But it turns out there are only finite number of them which are consistent with gravity out of that same list."}, {"time": 6256, "text": "So you can take any group but only finite number of them, the ones who's, what we call the rank of the group, the ones whose rank is less than 23."}, {"time": 6266, "text": "Any one bigger than rank 23 belongs to the swampland."}, {"time": 6269, "text": "There are infinitely many of them."}, {"time": 6271, "text": "They're beautiful field theories, but not when you include gravity."}, {"time": 6275, "text": "So then this becomes a hopeful thing."}, {"time": 6277, "text": "So in other words, in our universe, we have gravity."}, {"time": 6281, "text": "Therefore, we are part of that jewel subset."}, {"time": 6284, "text": "Now, is this jewel subset small or large?"}, {"time": 6290, "text": "It turns out that subset is humongous, but we believe still finite."}, {"time": 6297, "text": "The set of possibilities is infinite, but the set of consistent ones, I mean, the set of quantum field theories are infinite, but the consistent ones are finite, but humongous."}, {"time": 6308, "text": "The fact that they're humongous is the problem we are facing in string theory, because we do not know which one of these possibilities the universe we live in."}, {"time": 6318, "text": "If we knew, we could make more specific predictions about our universe."}, {"time": 6322, "text": "And that is one of the challenges when string theory, which point on the landscape, which corner of this landscape do we live in?"}, {"time": 6331, "text": "Well, there are principles that are beginning to emerge."}, {"time": 6335, "text": "So I will give you one example of it."}, {"time": 6338, "text": "You look at the patterns of what you're getting in terms of these good ones, the ones which are in the landscape compared to the ones which are not."}, {"time": 6345, "text": "You find certain patterns."}, {"time": 6346, "text": "I'll give you one pattern."}, {"time": 6349, "text": "You find in all the ones that you get from string theory, gravitational force is always there, but it's always, always the weakest force."}, {"time": 6360, "text": "However, you could easily imagine field theories for which gravity is not the weakest force."}, {"time": 6365, "text": "For example, take our universe."}, {"time": 6368, "text": "If you take mass of the electron, if you increase the mass of electron by a huge factor, the gravitational attraction of the electrons will be bigger than the electric repulsion between two electrons."}, {"time": 6379, "text": "And the gravity will be stronger."}, {"time": 6382, "text": "It happens that it's not the case in our universe because electron is very tiny in mass compared to that."}, {"time": 6388, "text": "Just like our universe, gravity is the weakest force."}, {"time": 6391, "text": "We find in all these other ones, which are part of the good ones, the gravity is the weakest force."}, {"time": 6397, "text": "This is called the weak gravity conjecture."}, {"time": 6400, "text": "We conjecture that all the points in the landscape have this property."}, {"time": 6405, "text": "Our universe being just an example of it."}, {"time": 6407, "text": "So there are these qualitative features that we are beginning to see."}, {"time": 6410, "text": "But how do we argue for this?"}, {"time": 6412, "text": "Just by looking patterns?"}, {"time": 6413, "text": "Just by looking string theory as this?"}, {"time": 6415, "text": "No, that's not enough."}, {"time": 6418, "text": "We need more reason, more better reasoning."}, {"time": 6420, "text": "And it turns out there is."}, {"time": 6421, "text": "The reasoning for this turns out to be studying black holes."}, {"time": 6425, "text": "Ideas of black holes turn out to put certain restrictions of what a good quantum filter should be."}, {"time": 6432, "text": "It turns out using black hole, the fact that the black holes evaporate, the fact that the black holes evaporate gives you a way to check the relation between the mass and the charge of elementary particle."}, {"time": 6445, "text": "Because what you can do, you can take a charged particle and throw it into a charged black hole and wait it to evaporate."}, {"time": 6452, "text": "And by looking at the properties of evaporation, you find that if it cannot evaporate particles whose mass is less than their charge, then it will never evaporate."}, {"time": 6460, "text": "You will be stuck."}, {"time": 6462, "text": "And so the possibility of a black hole evaporation forces you to have particles whose mass is sufficiently small so that the gravity is weaker."}, {"time": 6470, "text": "So you connect this fact to the other fact."}, {"time": 6472, "text": "So we begin to find different facts that reinforce each other."}, {"time": 6476, "text": "So different parts of the physics reinforce each other."}, {"time": 6479, "text": "And once they all kind of come together, you believe that you're getting the principle correct."}, {"time": 6484, "text": "So weak gravity conjecture is one of the principles we believe in as a necessity of these conditions."}, {"time": 6489, "text": "So these are the predictions string theory are making."}, {"time": 6492, "text": "Is that enough?"}, {"time": 6493, "text": "Well, it's qualitative."}, {"time": 6494, "text": "It's a semi quantity."}, {"time": 6496, "text": "It's just the mass of the electron should be less than some number."}, {"time": 6499, "text": "But that number is, if I call that number one, the mass of the electron turns out to be 10 to the minus 20 actually."}, {"time": 6505, "text": "So it's much less than one."}, {"time": 6506, "text": "It's not one."}, {"time": 6508, "text": "But on the other hand, there's a similar reasoning for a big black hole in our universe."}, {"time": 6514, "text": "And if that evaporation should take place, gives you another restriction, tells you the mass of the electron is bigger than 10 to the, now in this case, bigger than something."}, {"time": 6523, "text": "It shows bigger than 10 to the minus 30 in the Planck unit."}, {"time": 6525, "text": "So you find, huh, the mass of the electron should be less than one, but bigger than 10 to the minus 30."}, {"time": 6531, "text": "In our universe, the mass of the electron is 10 to the minus 20."}, {"time": 6534, "text": "Okay, now this kind of you could call postiction, but I would say it follows from principles that we now understand from string theory, first principle."}, {"time": 6541, "text": "So we are making, beginning to make these kinds of predictions, which are very much connected to aspects of particle physics that we didn't think are related to gravity."}, {"time": 6552, "text": "We thought, just take any electron mass you want."}, {"time": 6555, "text": "It has a problem with gravity."}, {"time": 6557, "text": "And so that conjecture has also a happy consequence that it explains that our universe, like why the heck is gravity so weak as a force and that's not only an accident, but almost a necessity if these forces are to coexist effectively?"}, {"time": 6575, "text": "Exactly, so that's the reinforcement of what we know in our universe, but we are finding that as a general principle."}, {"time": 6583, "text": "So we want to know what aspects of our universe is forced on us, like the weak gravity conjecture and other aspects."}, {"time": 6590, "text": "How much of them do we understand?"}, {"time": 6592, "text": "Can we have particles lighter than neutrinos?"}, {"time": 6594, "text": "Or maybe that's not possible."}, {"time": 6596, "text": "You see the neutrino mass, it turns out to be related to dark energy in a mysterious way."}, {"time": 6601, "text": "Naively, there's no relation between dark energy and the mass of a particle."}, {"time": 6606, "text": "We have found arguments from within the swampland kind of ideas, why it has to be related."}, {"time": 6612, "text": "And so there are beginning to be these connections between graph consistency of quantum gravity and aspects of our universe gradually being sharpened."}, {"time": 6622, "text": "But we are still far from a precise quantitative prediction like we have to have such and such, but that's the hope, that we are going in that direction."}, {"time": 6629, "text": "Coming up with the theory of everything that unifies general relativity and quantum field theory is one of the big dreams of human civilization."}, {"time": 6639, "text": "Us descendants of apes wondering about how this world works."}, {"time": 6643, "text": "So a lot of people dream."}, {"time": 6646, "text": "What are your thoughts about sort of other out there ideas, theories of everything or unifying theories?"}, {"time": 6656, "text": "So there's a quantum loop gravity."}, {"time": 6659, "text": "There's also more sort of like a friend of mine, Eric Weinstein beginning to propose something called geometric unity."}, {"time": 6667, "text": "So these kinds of attempts, whether it's through mathematical physics or through other avenues, or with Stephen Wolfram, a more computational view of the universe."}, {"time": 6676, "text": "Again, in his case, it's these hyper graphs that are very tiny objects as well."}, {"time": 6681, "text": "Similarly, a string theory and trying to grapple with this world."}, {"time": 6686, "text": "Is there any of these theories that are compelling to you, that are interesting that may turn out to be true or at least may turn out to contain ideas that are useful?"}, {"time": 6696, "text": "Yes, I think the latter."}, {"time": 6697, "text": "I would say that the containing ideas that are true is my opinion was what some of these ideas might be."}, {"time": 6703, "text": "For example, loop quantum gravity is to me not a complete theory of gravity in any sense, but they have some nuggets of truth in them."}, {"time": 6710, "text": "And typically what I expect to happen, and I have seen examples of this within string theory, aspects which we didn't think are part of string theory come to be part of it."}, {"time": 6718, "text": "For example, I'll give you one example."}, {"time": 6720, "text": "String was believed to be 10 dimensional."}, {"time": 6723, "text": "And then there was this 11 dimensional super gravity."}, {"time": 6725, "text": "Nobody know what the heck is that?"}, {"time": 6728, "text": "Why are we getting 11 dimensional super gravity whereas string is saying it should be 10 dimensional?"}, {"time": 6731, "text": "11 was the maximum dimension you can have a super gravity, but string was saying, sorry, we're 10 dimensional."}, {"time": 6737, "text": "So for a while we thought that theory is wrong because how could it be?"}, {"time": 6741, "text": "Because string theory is definitely a theory of everything."}, {"time": 6743, "text": "We later learned that one of the circles of string theory itself was tiny, that we had not appreciated that fact."}, {"time": 6750, "text": "And we discovered by doing thought experiments of string theory that there's gotta be an extra circle and that circle is connected to an 11 dimensional perspective."}, {"time": 6758, "text": "And that's what later on got called M theory."}, {"time": 6760, "text": "So there are these kinds of things that we do not know what exactly string theory is."}, {"time": 6765, "text": "We're still learning."}, {"time": 6767, "text": "So we do not have a final formulation of string theory."}, {"time": 6770, "text": "It's very well could be the different facets of different ideas come together like loop quantum gravity or whatnot, but I wouldn't put them on par."}, {"time": 6776, "text": "Namely, loop quantum gravity is a scatter of ideas about what happens to space when they get very tiny."}, {"time": 6783, "text": "For example, you replace things by discrete data and try to quantize it and so on."}, {"time": 6788, "text": "And it sounds like a natural idea to quantize space."}, {"time": 6793, "text": "If you were naively trying to do quantum space, you might think about trying to take points and put them together in some discrete fashion in some way that is reminiscent of loop quantum gravity."}, {"time": 6804, "text": "String theory is more subtle than that."}, {"time": 6807, "text": "For example, I will just give you an example."}, {"time": 6809, "text": "And this is the kind of thing that we didn't put in by hand, we got it out."}, {"time": 6812, "text": "And so it's more subtle than, so what happens if you squeeze the space to be smaller and smaller?"}, {"time": 6817, "text": "Well, you think that after a certain distance, the notion of distance should break down."}, {"time": 6823, "text": "You know, when you go smaller than Planck scale, should break down."}, {"time": 6828, "text": "What happens in string theory?"}, {"time": 6830, "text": "We do not know the full answer to that, but we know the following."}, {"time": 6833, "text": "Namely, if you take a space and bring it smaller and smaller, if the box gets smaller than the Planck scale by a factor of 10, it is equivalent by the duality transformation to a space which is 10 times bigger."}, {"time": 6845, "text": "So there's a symmetry called T duality, which takes L to one over L. Well, L is measured in Planck units, or more precisely string units."}, {"time": 6856, "text": "This inversion is a very subtle effect."}, {"time": 6860, "text": "And I would not have been, or any physicist would not have been able to design a theory which has this property, that when you make the space smaller, it is as if you're making it bigger."}, {"time": 6869, "text": "That means there is no experiment you can do to distinguish the size of the space."}, {"time": 6874, "text": "This is remarkable."}, {"time": 6875, "text": "For example, Einstein would have said, of course I can't measure the size of the space."}, {"time": 6880, "text": "Well, I take a flashlight, I send the light around, measure how long it takes for the light to go around the space, and bring back and find the radius or circumference of the universe."}, {"time": 6890, "text": "I said, well, suppose you do that, and you shrink it."}, {"time": 6892, "text": "He said, well, it gets smaller and smaller."}, {"time": 6894, "text": "I said, well, it turns out in string theory, there are two different kinds of photons."}, {"time": 6900, "text": "One photon measures one over L, the other one measures L. And so this duality reformulates."}, {"time": 6907, "text": "And when the space gets smaller, it says, oh no, you better use the bigger perspective because the smaller one is harder to deal with."}, {"time": 6913, "text": "So you do this one."}, {"time": 6913, "text": "So these examples of loop quantum gravity have none of these features."}, {"time": 6917, "text": "These features that I'm telling you about, we have learned from string theory."}, {"time": 6920, "text": "But they nevertheless have some of these ideas like topological gravity aspects are emphasized in the context of loop quantum gravity in some form."}, {"time": 6928, "text": "And so these ideas might be there in some kernel, in some corners of string theory."}, {"time": 6932, "text": "In fact, I wrote a paper about topological string theory and some connections with potentially loop quantum gravity, which could be part of that."}, {"time": 6939, "text": "So there are little facets of connections."}, {"time": 6941, "text": "I wouldn't say they're complete, but I would say most probably what will happen to some of these ideas, the good ones at least, they will be absorbed to string theory, if they are correct."}, {"time": 6951, "text": "Let me ask a crazy out there question."}, {"time": 6954, "text": "Can physics help us understand life?"}, {"time": 6959, "text": "So we spoke so confidently about the laws of physics being able to explain reality."}, {"time": 6967, "text": "But, and we even said words like theory of everything, implying that the word everything is actually describing everything."}, {"time": 6975, "text": "Is it possible that the four laws we've been talking about are actually missing, they are accurate in describing what they're describing, but they're missing the description of a lot of other things, like emergence of life and emergence of perhaps consciousness."}, {"time": 6995, "text": "So is there, do you ever think about this kind of stuff where we would need to understand extra physics to try to explain the emergence of these complex pockets of interesting weird stuff that we call life and consciousness in this big homogeneous universe that's mostly boring and nothing is happening yet?"}, {"time": 7020, "text": "So first of all, we don't claim that string theory is the theory of everything in the sense that we know enough what this theory is."}, {"time": 7027, "text": "We don't know enough about string theory itself, we are learning it."}, {"time": 7030, "text": "So I wouldn't say, okay, give me whatever, I will tell you how it works, no."}, {"time": 7034, "text": "However, I would say by definition, by definition to me physics is checking all reality."}, {"time": 7040, "text": "Any form of reality, I call it physics, that's my definition."}, {"time": 7043, "text": "I mean, I may not know a lot of it, like maybe the origin of life and so on, maybe a piece of that, but I would call that as part of physics."}, {"time": 7050, "text": "To me, reality is what we're after."}, {"time": 7053, "text": "I don't claim I know everything about reality."}, {"time": 7055, "text": "I don't claim string theory necessarily has the tools right now to describe all the reality either, but we are learning what it is."}, {"time": 7062, "text": "So I would say that I would not put a border to say, no, from this point onwards, it's not my territory, it's somebody else's."}, {"time": 7068, "text": "But whether we need new ideas in string theory to describe other reality features, for sure I believe, as I mentioned, I don't believe any of the laws we know today is final."}, {"time": 7078, "text": "So therefore, yes, we will need new ideas."}, {"time": 7080, "text": "This is a very tricky thing for us to understand and be precise about."}, {"time": 7088, "text": "But just because you understand the physics doesn't necessarily mean that you understand the emergence of chemistry, biology, life, intelligence, consciousness."}, {"time": 7103, "text": "So those are built, it's like you might understand the way bricks work, but to understand what it means to have a happy family, you don't get from the bricks."}, {"time": 7117, "text": "So directly, in theory you could, if you ran the universe over again, but just understanding the rules of the universe doesn't necessarily give you a sense of the weird, beautiful things that emerge."}, {"time": 7132, "text": "Right, no, so let me describe what you just said."}, {"time": 7135, "text": "So there are two questions."}, {"time": 7136, "text": "One is whether or not the techniques I use in let's say quantum field theory and so on will describe how the society works."}, {"time": 7143, "text": "Okay, that's far different scales of questions that we're asking here."}, {"time": 7148, "text": "The question is, is there a change of, is there a new law which takes over that cannot be connected to the older laws that we know, or more fundamental laws that we know?"}, {"time": 7158, "text": "Do you need new laws to describe it?"}, {"time": 7160, "text": "I don't think that's necessarily the case in many of these phenomena like chemistry or so on you mentioned."}, {"time": 7165, "text": "So we do expect in principle chemistry can be described by quantum mechanics."}, {"time": 7169, "text": "We don't think there's gonna be a magical thing, but chemistry is complicated."}, {"time": 7172, "text": "Yeah, indeed, there are rules of chemistry that chemists have put down which has not been explained yet using quantum mechanics."}, {"time": 7179, "text": "Do I believe that they will be something described by quantum mechanics?"}, {"time": 7183, "text": "I don't think they are going to be sitting there in this just forever, but maybe it's too complicated and maybe we'll wait for very powerful quantum computers or whatnot to solve those problems."}, {"time": 7192, "text": "But I don't think in that context we have new principles to be added to fix those."}, {"time": 7197, "text": "So I'm perfectly fine in the intermediate situation to have rules of thumb or principles that chemists have found which are working, which are not founded on the basis of quantum mechanical laws, which does the job."}, {"time": 7210, "text": "Similarly, as biologists do not found everything in terms of chemistry, but they think, there's no reason why chemistry cannot."}, {"time": 7216, "text": "They don't think necessarily they're doing something amazingly not possible with chemistry."}, {"time": 7220, "text": "Coming back to your question, does consciousness, for example, bring this new ingredient?"}, {"time": 7226, "text": "If indeed it needs a new ingredient, I will call that new ingredient part of physical law."}, {"time": 7230, "text": "We have to understand it."}, {"time": 7231, "text": "To me that, so I wouldn't put a line to say, okay, from this point onwards, it's disconnected."}, {"time": 7237, "text": "It's fully disconnected from string theory or whatever."}, {"time": 7239, "text": "We have to do something else."}, {"time": 7241, "text": "It's not a line."}, {"time": 7242, "text": "What I'm referring to is can physics of a few centuries from now that doesn't understand consciousness be much bigger than the physics of today, where the textbook grows?"}, {"time": 7253, "text": "It definitely will."}, {"time": 7254, "text": "I would say, it will grow."}, {"time": 7255, "text": "I don't know if it grows because of consciousness being part of it or we have different view of consciousness."}, {"time": 7261, "text": "I do not know where the consciousness will fit."}, {"time": 7263, "text": "It's gonna be hard for me to guess."}, {"time": 7267, "text": "I mean, I can make random guesses now which probably most likely is wrong, but let me just do just for the sake of discussion."}, {"time": 7274, "text": "I could say, brain could be their quantum computer, classical computer."}, {"time": 7279, "text": "Their arguments against this being a quantum thing, so it's probably classical, and if it's classical, it could be like what we are doing in machine learning, slightly more fancy and so on."}, {"time": 7286, "text": "Okay, people can go to this argument to no end and to some whether consciousness exists or not, or life, does it have any meaning?"}, {"time": 7292, "text": "Or is there a phase transition where you can say, does electron have a life or not?"}, {"time": 7296, "text": "At what level does a particle become life?"}, {"time": 7299, "text": "Maybe there's no definite definition of life in that same way that, we cannot say electron, if you, I like this example quite a bit."}, {"time": 7308, "text": "We distinguish between liquid and a gas phase, like water is liquid or vapor is gas, and we say they're different."}, {"time": 7314, "text": "You can distinguish them."}, {"time": 7315, "text": "Actually, that's not true."}, {"time": 7317, "text": "It's not true because we know from physics that you can change temperatures and pressure to go from liquid to the gas without making any phase transition."}, {"time": 7325, "text": "So there is no point that you can say this was a liquid and this was a gas."}, {"time": 7330, "text": "You can continuously change the parameters to go from one to the other."}, {"time": 7333, "text": "So at the end, it's very different looking."}, {"time": 7335, "text": "Like, I know that water is different from vapor, but there's no precise point this happens."}, {"time": 7341, "text": "I feel many of these things that we think, like consciousness, clearly dead person is not conscious and the other one is."}, {"time": 7347, "text": "So there's a difference like water and vapor, but there's no point you could say that this is conscious."}, {"time": 7352, "text": "There's no sharp transition."}, {"time": 7354, "text": "So it could very well be that what we call heuristically in daily life, consciousness is similar, or life is similar to that."}, {"time": 7363, "text": "I don't know if it's like that or not."}, {"time": 7364, "text": "I'm just hypothesizing it's possible."}, {"time": 7366, "text": "Like there's no."}, {"time": 7368, "text": "There's no discrete phases."}, {"time": 7369, "text": "There's no discrete phase transition like that."}, {"time": 7371, "text": "Yeah, yeah, but there might be concepts of temperature and pressure that we need to understand to describe what the head consciousness in life is that we're totally missing."}, {"time": 7384, "text": "I think that's not a useless question."}, {"time": 7387, "text": "Even those questions, they is back to our original discussion of philosophy."}, {"time": 7391, "text": "I would say consciousness and free will, for example, are topics that are very much so in the realm of philosophy currently."}, {"time": 7401, "text": "But I don't think they will always be."}, {"time": 7404, "text": "And I think I'm fine with some topics being part of a different realm than physics today because we don't have the right tools, just like biology was."}, {"time": 7413, "text": "I mean, before we had DNA and all that genetics and all that gradually began to take hold."}, {"time": 7417, "text": "I mean, when people were beginning phase experiments with biology and chemistry and so on, gradually they came together."}, {"time": 7426, "text": "So it wasn't like together."}, {"time": 7427, "text": "So yeah, I'd be perfectly understanding of a situation where we don't have the tools."}, {"time": 7431, "text": "So do these experiments that you think as defines a conscious in different form and gradually we'll build it and connect it."}, {"time": 7437, "text": "And yes, we might discover new principles of nature that we didn't know."}, {"time": 7441, "text": "I don't know, but I would say that if they are, they will be deeply connected with the else."}, {"time": 7444, "text": "We have seen in physics, we don't have things in isolation."}, {"time": 7448, "text": "You cannot compartmentalize, this is gravity, this is electricity, this is that."}, {"time": 7453, "text": "We have learned they all talk to each other."}, {"time": 7455, "text": "There's no way to make them in one corner and don't talk."}, {"time": 7459, "text": "So the same thing with anything, anything which is real."}, {"time": 7461, "text": "So consciousness is real."}, {"time": 7462, "text": "So therefore we have to connect it to everything else."}, {"time": 7465, "text": "So to me, once you connect it, you cannot say it's not reality."}, {"time": 7467, "text": "And once it's reality, it's physics."}, {"time": 7469, "text": "I call it physics."}, {"time": 7470, "text": "It may not be the physics I know today, for sure it's not, but I would be surprised if there's disconnected realities that you cannot imagine them as part of the same soup."}, {"time": 7481, "text": "So I guess God doesn't have a biology or chemistry textbook and mostly, or maybe he or she reads it for fun, biology and chemistry, but when you're trying to get some work done, it'll be going to the physics textbook."}, {"time": 7494, "text": "Okay, what advice, let's put on your wise visionary hat."}, {"time": 7499, "text": "What advice do you have for young people today?"}, {"time": 7503, "text": "You've dedicated your book actually to your kids, to your family."}, {"time": 7509, "text": "What advice would you give to them?"}, {"time": 7511, "text": "What advice would you give to young people today thinking about their career, thinking about life, of how to live successful life, how to live a good life?"}, {"time": 7519, "text": "Yes, yes, I have three sons."}, {"time": 7523, "text": "And in fact, to them, I have tried not to give too much advice."}, {"time": 7528, "text": "So even though I've tried to kind of not give advice, maybe indirectly it has been some impact."}, {"time": 7533, "text": "My oldest one is doing biophysics, for example, and the second one is doing machine learning and the third one is doing theoretical computer science."}, {"time": 7540, "text": "So there are these facets of interest which are not too far from my area, but I have not tried to impact them in that way, but they have followed their own interests."}, {"time": 7549, "text": "And I think that's the advice I would give to any young person, follow your own interests and let that take you wherever it takes you."}, {"time": 7558, "text": "And this I did in my own case that I was planning to study economics and electrical engineering when I started at MIT."}, {"time": 7568, "text": "And I discovered that I'm more passionate about math and physics."}, {"time": 7571, "text": "And at that time I didn't feel math and physics would make a good career."}, {"time": 7575, "text": "And so I was kind of hesitant to go in that direction, but I did because I kind of felt that that's what I'm driven to do."}, {"time": 7582, "text": "So I don't regret it, I'm lucky in the sense that society supports people like me who are doing these abstract stuff, which may or may not be experimentally verified even let alone applied to the technology in our lifetimes."}, {"time": 7596, "text": "I'm lucky I'm doing that."}, {"time": 7597, "text": "And I feel that if people follow their interests, they will find the niche that they're good at."}, {"time": 7603, "text": "And this coincidence of hopefully their interests and abilities are kind of aligned, at least some extent to be able to drive them to something which is successful."}, {"time": 7616, "text": "And not to be driven by things like, this doesn't make a good career, or this doesn't do that, and my parents expect that, or what about this?"}, {"time": 7623, "text": "And I think ultimately you have to live with yourself and you only have one life and it's short, very short."}, {"time": 7628, "text": "I can tell you I'm getting there."}, {"time": 7630, "text": "So I know it's short."}, {"time": 7631, "text": "So you really want not to do things that you don't want to do."}, {"time": 7635, "text": "So I think following an interest is my strongest advice to young people."}, {"time": 7639, "text": "Yeah, it's scary when your interest doesn't directly map to a career of the past or of today."}, {"time": 7646, "text": "So you're almost anticipating future careers that could be created."}, {"time": 7652, "text": "But yeah, there's something to that, especially when the interest and the ability align, that you will pave a path, that will find a way to make money, especially in this society, in a capitalistic United States society."}, {"time": 7666, "text": "It feels like ability and passion paves the way."}, {"time": 7674, "text": "At the very least, you can sell funny T shirts."}, {"time": 7677, "text": "You've mentioned life is short."}, {"time": 7685, "text": "I don't think about my mortality."}, {"time": 7689, "text": "I think that I don't think about my death."}, {"time": 7692, "text": "I don't think about death in general too much."}, {"time": 7694, "text": "First of all, it's something that I can't do much about, and I think it's something that it doesn't drive my everyday action."}, {"time": 7701, "text": "It is natural to expect that it's somewhat like the time reversal situation."}, {"time": 7705, "text": "So we believe that we have this approximate symmetry in nature, time reversal."}, {"time": 7709, "text": "Going forward, we die."}, {"time": 7710, "text": "Going backwards, we get born."}, {"time": 7712, "text": "So what was it to get born?"}, {"time": 7715, "text": "It wasn't such a good or bad feeling."}, {"time": 7717, "text": "I have no feeling of it."}, {"time": 7718, "text": "So who knows what the death will feel like, the moment of death or whatnot."}, {"time": 7724, "text": "It is not known, but in what form do we exist before or after?"}, {"time": 7730, "text": "Again, it's something that it's partly philosophical maybe."}, {"time": 7733, "text": "I like how you draw comfort from symmetry."}, {"time": 7735, "text": "It does seem that there is something asymmetric here, a breaking of symmetry, because there's something to the creative force of the human spirit that goes only one way."}, {"time": 7750, "text": "That it seems the finiteness of life is the thing that drives the creativity."}, {"time": 7755, "text": "And so it does seem that at least the contemplation of the finiteness of life, of mortality, is the thing that helps you get your stuff together."}, {"time": 7767, "text": "Yes, I think that's true, but actually I have a different perspective on that a little bit."}, {"time": 7771, "text": "Namely, suppose I told you you're immortal."}, {"time": 7777, "text": "I think your life will be totally boring after that, because you will not, I think part of the reason we have enjoyment in life is the finiteness of it."}]}]