[{"title": "Brian Armstrong: Coinbase, Cryptocurrency, and Government Regulation | Lex Fridman Podcast #307", "id": "VBPTFlpv31k", "quotes": [{"time": 266, "text": "I could rapidly prototype products and using languages like Ruby."}, {"time": 270, "text": "Do a lot of computer science programs still use like Lisp and Scheme and things like that?"}, {"time": 275, "text": "No, they do for, that's like, that's if you're hardcore."}, {"time": 279, "text": "If you're legit, you're gonna do some of the functional languages."}, {"time": 282, "text": "I think there's a few others that popped up, but Lisp is a distant memory for a lot of people."}, {"time": 288, "text": "That's like somebody has to like, you go to library, you dust off the book, but Scheme a little bit."}, {"time": 295, "text": "I think if you're starting, I mean, there's courses about languages themselves, like programming languages."}, {"time": 301, "text": "Lisp might be one of those, you know how there's languages that nobody uses anymore, like ancient languages?"}, {"time": 306, "text": "You might have to go to school in that same way for programming languages."}, {"time": 310, "text": "Back in the day, we used to use parentheses."}, {"time": 312, "text": "I of course still use Emacs as the editor for most things that I do."}, {"time": 317, "text": "And Emacs is, a lot of the customization you can do is in Lisp and that's the language probably when I first really fell in love with programming is Lisp."}, {"time": 330, "text": "Because for a long time throughout the earlier history of artificial intelligence, Lisp was the primary language, but it still had a life in the 90s and the aughts where some people would use it."}, {"time": 343, "text": "It's such a beautiful functional language, but it just somehow didn't pick up."}, {"time": 351, "text": "That said, I should say sort of push back, PHP, I feel like it's still true that most of the web runs on PHP."}, {"time": 358, "text": "Most of the backend is still PHP."}, {"time": 362, "text": "So if you look at, you know, it's like the stuff that people don't talk about."}, {"time": 365, "text": "It's like what runs most systems in the world?"}, {"time": 368, "text": "What runs the most backend?"}, {"time": 371, "text": "What runs most front end?"}, {"time": 372, "text": "JavaScript, you know, HTML."}, {"time": 375, "text": "The Stack Exchange surveys show JavaScript is the most popular language in the world, I think, right?"}, {"time": 380, "text": "Oh yeah, in terms of programmers and numbers of, I wonder."}, {"time": 385, "text": "By survey of number of programmers on Stack Overflow."}, {"time": 388, "text": "Oh yeah, but that's also the cutting edge, right?"}, {"time": 391, "text": "Those are the people that are just like excitedly writing code."}, {"time": 394, "text": "I wonder if there's people that are just like maintaining gigantic code bases."}, {"time": 400, "text": "Yeah, I feel like the amount of Java out there just running industrial systems has gotta be enormous."}, {"time": 406, "text": "And then of course in the banking industry, finance, it's like even older stuff, Cobalt and whatnot, but."}, {"time": 412, "text": "I've been actually looking for somebody to interview who represents Cobalt and Fortran."}, {"time": 420, "text": "Like who's the figure still there that holds the flag?"}, {"time": 425, "text": "I did, you know, with Java, founder of Java, creator of Java, creator of Python, creator of C++, but nobody wants to hold the flag for Cobalt and Fortran, even though some of the most important systems in the world still run on those."}, {"time": 440, "text": "Like power systems and infrastructure systems, which is fascinating, and ATMs and stuff like that."}, {"time": 447, "text": "Like a lot of stuff that we rely on, it just works, and the reason we don't change it is because it works well."}, {"time": 453, "text": "It was written in languages that people don't use anymore."}, {"time": 456, "text": "Yeah, that'd be a cool series of interviews."}, {"time": 459, "text": "Get the stuff that's like tech that was invented 40, 50 years ago, but still is being used widely."}, {"time": 465, "text": "I mean Emacs is an example of that."}, {"time": 467, "text": "Let me ask the big question of what are cryptocurrency exchanges and what's Coinbase?"}, {"time": 475, "text": "Before, I'll ask even bigger questions, but it's just a nice kind of palate cleansing question of what is Coinbase?"}, {"time": 483, "text": "Coinbase is a cryptocurrency exchange brokerage custodian."}, {"time": 487, "text": "Basically, we're the primary financial account for people in the crypto economy, how they buy crypto, how they store it, how they use it increasingly in different ways."}, {"time": 498, "text": "So yeah, we want to be the way that a billion people hopefully access the open financial system globally."}, {"time": 505, "text": "What's cryptocurrency?"}, {"time": 509, "text": "There's Bitcoin, there's Ethereum."}, {"time": 514, "text": "What does it mean to be an exchange?"}, {"time": 517, "text": "What does it mean to store?"}, {"time": 519, "text": "What does it mean to transact?"}, {"time": 520, "text": "How does it, what does Coinbase actually do?"}, {"time": 523, "text": "Okay, so basically in any given market, there's some people who want to buy, some people who want to sell, and you keep an order book of all those prices."}, {"time": 533, "text": "And then if someone's willing to buy for more than the lowest price someone's willing to sell, then you get a trade to execute."}, {"time": 542, "text": "That's kind of how an exchange works underneath."}, {"time": 544, "text": "And a brokerage is kind of simpler than that even."}, {"time": 546, "text": "You don't have to know, look at the whole order book and everything, but you just go in there and you say, I want to buy a hundred dollars of Bitcoin or whatever cryptocurrency."}, {"time": 554, "text": "You get a quote, and if you like it, you can hit accept."}, {"time": 556, "text": "And the core things that we do to make all that kind of just work, make it seamless, it sounds simple on the surface, is we have to do payment integrations in a variety of places around the world to make it easy for people to get fiat currency into this ecosystem."}, {"time": 571, "text": "We have to do work on cybersecurity a lot."}, {"time": 573, "text": "There's lots of hackers out there trying to break into our systems and steal crypto or to put stolen credit cards and bank accounts and things like that into these systems."}, {"time": 582, "text": "We have to integrate with the blockchains themselves, which are periodically getting updated and having various airdrops and all kinds of things."}, {"time": 591, "text": "So we're integrated with lots of different blockchains."}, {"time": 593, "text": "And then we have to store the crypto that people buy securely as well."}, {"time": 597, "text": "So crypto is kind of like storing, you store the private keys essentially."}, {"time": 600, "text": "And we've invented a lot of cool technology about how to do that securely that helps me sleep at night as one of the largest crypto custodians out there."}, {"time": 610, "text": "So those are some of the pieces that had to come together to get that early simple buy sell experience to work."}, {"time": 616, "text": "And yeah, I mean, Coinbase actually has a lot of different products now."}, {"time": 620, "text": "So we have like an institutional product."}, {"time": 621, "text": "We have Coinbase Commerce, which is like merchant payments, like Stripe for crypto."}, {"time": 626, "text": "We've got a self custodial wallet, which we can talk about."}, {"time": 628, "text": "There's all kinds of cool applications people are building with web3 and they can access it through that."}, {"time": 632, "text": "We just launched an NFT product."}, {"time": 636, "text": "I can go on down the list."}, {"time": 637, "text": "So we're sort of like a portfolio of crypto products now."}, {"time": 639, "text": "We're big enough where we can do multiple things."}, {"time": 642, "text": "But yeah, the core thing we got started with and still the majority of our revenue today is people just wanna come in and buy and sell some crypto."}, {"time": 648, "text": "And we help them do that and make it simple and easy to use."}, {"time": 651, "text": "And I'll ask you about wallet, NFT is about, what is it called?"}, {"time": 654, "text": "The Stripe type?"}, {"time": 658, "text": "I'll ask you about all that."}, {"time": 659, "text": "But order books in exchange, what's the difference between that and stocks, for example, which there's also order books."}, {"time": 666, "text": "Yes, I mean, stocks trade through order books too."}, {"time": 668, "text": "So do commodities."}, {"time": 669, "text": "There's all similar type of situation."}, {"time": 672, "text": "So when I wanna buy one Bitcoin and I see Coinbase, say the price of that Bitcoin is say $40,000 and I press buy, what happens?"}, {"time": 686, "text": "So you've gotten a lot, when you press the button on your keyboard, like an electrical signal goes up the wire on your keyboard."}, {"time": 693, "text": "No, we won't cut out the level."}, {"time": 695, "text": "That's also important, the timing, right?"}, {"time": 696, "text": "Cause it's not price fixed."}, {"time": 699, "text": "It's giving you a quote, right?"}, {"time": 702, "text": "There's a whole concept of like slippage."}, {"time": 704, "text": "And like by the time the quote is executed, if the price has moved too much, like we may reject it."}, {"time": 710, "text": "And there's various things like that."}, {"time": 712, "text": "But how do, I mean, what's the simple version I can give you?"}, {"time": 715, "text": "So we'll basically check the order book, give you a quote."}, {"time": 719, "text": "It's good for some period of time or for some amount of slippage."}, {"time": 722, "text": "And then what's happening is we're initiating a debit to your payment method, whether that's a credit card or a bank account, or you're storing dollars or euros or something on our platform, there's various payment methods."}, {"time": 733, "text": "So we're basically debiting that."}, {"time": 735, "text": "And then we're crediting you the crypto and we're taking a fee for it too."}, {"time": 739, "text": "So that's fundamentally what's happening underneath."}, {"time": 744, "text": "And then there's just some interesting slippage."}, {"time": 746, "text": "How do you calculate how much slippage is allowed?"}, {"time": 750, "text": "Like how do you know these things?"}, {"time": 753, "text": "Cause order books are fascinating."}, {"time": 756, "text": "The dynamics of that is pretty interesting."}, {"time": 759, "text": "The little I know about it."}, {"time": 760, "text": "Yeah, so there's a lot of people like traders who get super into this and like high frequency traders and arbitrage and all kinds of interesting topics."}, {"time": 768, "text": "Flash Boys was like an interesting book on this whole thing."}, {"time": 770, "text": "You want like access to information the fastest, sometimes even putting your thing in the data center right next to the thing."}, {"time": 778, "text": "We don't allow that colo stuff cause we want it to be more democratized."}, {"time": 783, "text": "But basically you give a, let's say we wanted to just keep it math simple."}, {"time": 787, "text": "We want to charge a 1% fee."}, {"time": 788, "text": "So if you're buying $100 of Bitcoin and we'll charge you $101, we've presented you the amount of Bitcoin you're going to get for the $100."}, {"time": 796, "text": "Now let's say 10 seconds later you hit accept."}, {"time": 798, "text": "We go to fill the order."}, {"time": 801, "text": "So it's going to be some error bound around that 1% fee, right?"}, {"time": 805, "text": "And if we think we're actually losing money on the trade, I think we'll often reject it."}, {"time": 809, "text": "So some part of the fee, the slippage is incorporated into that, averaged over a large number of people."}, {"time": 818, "text": "Just, it's fascinating."}, {"time": 819, "text": "Cause like even just like that little detail probably requires a lot of experimentation."}, {"time": 825, "text": "And it's kind of like a giant bug bounty out there because if you get it wrong, there's people who are going to arbitrage that."}, {"time": 830, "text": "And we've had people sort of pen test our systems in a really creative ways where like, they'll just fire like programmatically with APIs, they'll fire off like a million different quotes and look for one of them that's out of bounds and then actually take that money right there."}, {"time": 847, "text": "And we get people doing all kinds of crazy stuff."}, {"time": 850, "text": "So how do you protect against that?"}, {"time": 852, "text": "How do you protect?"}, {"time": 853, "text": "So we'll talk about cybersecurity in interesting ways, but there's a lot of clever people trying to do clever things to earn, not even just to break into the system, but to earn an edge of some kind in the system."}, {"time": 866, "text": "How do you stay one step ahead?"}, {"time": 868, "text": "There's no silver bullet, it's a bunch of lead bullets, right?"}, {"time": 870, "text": "So it's like, you know, one thing we do is we just have good test suites, right?"}, {"time": 876, "text": "So you're testing every piece of code that goes out, that's like just common good best practice, but it's particularly important in financial services."}, {"time": 883, "text": "Another thing we do is we hire third party firms to try to audit this stuff and break in."}, {"time": 888, "text": "Another one we do is we have a bug bounty program."}, {"time": 891, "text": "So we basically pay white hat hackers to find this stuff before the black hats do."}, {"time": 896, "text": "And we've paid out lots of good bug bounties."}, {"time": 899, "text": "So, you know, try all the above."}, {"time": 902, "text": "And occasionally you don't get it right and you lose some money and then you fix it and you keep going, so yeah."}, {"time": 907, "text": "Let's talk about cybersecurity a little bit more."}, {"time": 910, "text": "You mentioned using stolen bank accounts."}, {"time": 913, "text": "So that's another one, that's another interesting one."}, {"time": 915, "text": "How do you protect against that?"}, {"time": 917, "text": "Okay, so fraud prevention, yeah, is a big topic."}, {"time": 920, "text": "So one of the, there's a lot of things people do, but one of the things they do is that you use machine learning, right?"}, {"time": 928, "text": "So you look at hundreds."}, {"time": 929, "text": "To protect or to attack?"}, {"time": 930, "text": "To protect against it."}, {"time": 932, "text": "So what you want to do is kind of build up a labeled data set of all the different people who have turned out to be fraudulent and good actors, and hopefully collect as much data as you can."}, {"time": 944, "text": "And then, you know, you might feed hundreds or thousands of these factors into your machine learning model and it'll come back with a risk score."}, {"time": 951, "text": "So, you know, an example of like the kinds of factors people create or put in there, you know, obviously I don't want to disclose too many of them because it's a cat and mouse game, but just kind of, I don't know, relatively well known stuff might be."}, {"time": 963, "text": "You know, you have device fingerprints, right?"}, {"time": 966, "text": "So like, what kind of device are you on and what fonts do you have installed?"}, {"time": 970, "text": "A lot of people who are farming lots of these accounts, they're using emulators and like virtual machines and stuff."}, {"time": 975, "text": "They're not like, you know, an average person on that device."}, {"time": 979, "text": "And then you'll see sometimes like, one of my favorite metrics we track for this was called like improbable travel velocity."}, {"time": 986, "text": "So we would, we're tracking people's IPS, right?"}, {"time": 988, "text": "And you might see someone who was one day in Austin, Texas and then like an hour later they were in London or something."}, {"time": 996, "text": "It's like, well, that's very improbable."}, {"time": 997, "text": "I mean, sometimes people are using VPNs."}, {"time": 999, "text": "So you gotta be careful with that because like there's legitimate people who use VPNs too."}, {"time": 1002, "text": "But if it's not possible for them to have gotten on a plane and gotten there that quickly, then that's usually they're like spoofing a device or IP."}, {"time": 1010, "text": "Sometimes those are interesting factors."}, {"time": 1012, "text": "But yeah, if you feed enough of these in, you will, oh, another fun one is like, you know, real users will type their credit card like one number at a time."}, {"time": 1023, "text": "Scammers have a list of them and they'll just paste in a whole number."}, {"time": 1028, "text": "So you can look at like the number of milliseconds between keystrokes."}, {"time": 1031, "text": "Like there's all kinds of stuff people have come up with."}, {"time": 1033, "text": "And even for travel velocity, you could probably incorporate VPNs too because there's probably a travel velocity for VPN switching too that's human like."}, {"time": 1044, "text": "Like if you're using legitimately VPN for something else, that might be, there's like legitimate uses too."}, {"time": 1051, "text": "Actually, you know, I feel embarrassed that I don't know this, probably should."}, {"time": 1054, "text": "But the, I'm not a robot."}, {"time": 1060, "text": "So that probably works in the same way."}, {"time": 1062, "text": "Like how do you move your mouse maybe or how the dynamics of the clicking."}, {"time": 1069, "text": "But how does that even work that well then?"}, {"time": 1071, "text": "And why can't it be fake?"}, {"time": 1073, "text": "Cause it's such a trivial capture."}, {"time": 1076, "text": "It feels like it should be very crackable."}, {"time": 1078, "text": "And yet a lot of high security places use that."}, {"time": 1084, "text": "It's another cat and mouse game."}, {"time": 1084, "text": "So I think they've, yeah, but it's using a lot of similar signals like mouse movements, keystrokes."}, {"time": 1090, "text": "And then obviously all the stuff that comes over the wire with your browser."}, {"time": 1094, "text": "So like what operating system, what fonts, what headers are being sent over."}, {"time": 1098, "text": "And there's actually, there's an old website."}, {"time": 1101, "text": "I can't remember what it's called."}, {"time": 1102, "text": "It was kind of like Panoptik Click or Panopticon or something."}, {"time": 1105, "text": "But it basically was like a proof of concept site that they would just show you all the data that was kind of getting sent over with your request."}, {"time": 1113, "text": "And like say that there's only one person in the world who has this exact set of data."}, {"time": 1117, "text": "It's you."}, {"time": 1118, "text": "And so it's almost like a workaround, a clever workaround to track somebody, make identify a unique person, even if like there wasn't a cookie involved or something."}, {"time": 1128, "text": "Yeah, this is a fascinating world where you can't see anybody here in the dark and yet you have a lot of signal and you have to figure out who's a real person, who's not."}, {"time": 1136, "text": "Who's a robot, who's not."}, {"time": 1138, "text": "Let me step back."}, {"time": 1139, "text": "We're gonna jump around all over the place."}, {"time": 1141, "text": "That's why I like your interviews."}, {"time": 1142, "text": "You get into like technical topics."}, {"time": 1145, "text": "So just let's use Bitcoin as a measure of time."}, {"time": 1149, "text": "You started Coinbase when Bitcoin was $10."}, {"time": 1154, "text": "And you just mentioned an incredible system with security, with transactions."}, {"time": 1159, "text": "Everything is thought through."}, {"time": 1160, "text": "There's a lot going on."}, {"time": 1161, "text": "But what was version one back in those early days, the first prototype of Coinbase?"}, {"time": 1166, "text": "What did that look like?"}, {"time": 1168, "text": "Like what did it take to write it, to think through it and make it work enough to at least make you believe that it's gonna work?"}, {"time": 1178, "text": "Well, I definitely didn't know if it was gonna work."}, {"time": 1180, "text": "I mean, it was kind of, I felt like I was just following my gut."}, {"time": 1184, "text": "So, I mean, I was working at Airbnb."}, {"time": 1187, "text": "I was a software engineer there, project manager."}, {"time": 1190, "text": "I was working on some fraud prevention stuff, for instance."}, {"time": 1192, "text": "And I read the Bitcoin white paper in kind of December of 2010."}, {"time": 1197, "text": "I started going to some Bitcoin meetups in the Bay Area, met lots of interesting people there, like crazy people, anarchists, really brilliant people, all the above."}, {"time": 1206, "text": "And so I started nights and weekends trying to put together a prototype."}, {"time": 1211, "text": "And my initial thought was, well, SMTP is a protocol that runs email."}, {"time": 1216, "text": "And Git is a protocol for version control that people made like Gmail and GitHub."}, {"time": 1223, "text": "Most people don't wanna run their own email server or even their own Git server."}, {"time": 1226, "text": "They just wanna like use a hosted thing that will do all the security and backups for them."}, {"time": 1231, "text": "So the thought in my head at that time was Bitcoin's this new protocol."}, {"time": 1234, "text": "There's probably gonna be somebody who makes a hosted service that does all the security and backups for you, makes Bitcoin as a protocol easy to use."}, {"time": 1242, "text": "So maybe I should make like a hosted Bitcoin wallet or something, that was my, it was gonna make Gmail for Bitcoin or something."}, {"time": 1250, "text": "And a bunch of people told me that was a bad idea."}, {"time": 1252, "text": "Like most of my smart friends who I told about it, they were like, well, first of all, I don't really get what you're doing at all."}, {"time": 1259, "text": "Like Bitcoin sounds like a scam or something you've gotten involved in."}, {"time": 1264, "text": "But then other people who understood what Bitcoin was told me they thought it was a dumb idea because they're like, dude, if you store all this Bitcoin, you're just gonna get hacked."}, {"time": 1270, "text": "Like nobody, you know, why would you do that?"}, {"time": 1274, "text": "And so I kind of had this thought like, you know what?"}, {"time": 1278, "text": "I'm not gonna go all in and like make a store everyone's Bitcoin, that would be too much right now."}, {"time": 1282, "text": "I have a job, I have a day job, you know?"}, {"time": 1285, "text": "But let me just make a prototype and I'll tell people this is like a beta thing."}, {"time": 1288, "text": "Like don't put any real money in it and just see if there's interest."}, {"time": 1291, "text": "And if I feel like I'm onto something, maybe I'll go do this as a company."}, {"time": 1293, "text": "Cause I did, I really wanted to be an entrepreneur at that time."}, {"time": 1296, "text": "I was like, I was 29, I was almost turning 30."}, {"time": 1298, "text": "And I was, I always wanted to like start a company, but I was, you know, I wasn't yet."}, {"time": 1303, "text": "I was an employee at a company that was great."}, {"time": 1305, "text": "But so anyway, I had this prototype."}, {"time": 1307, "text": "I was hacking together nights and weekends."}, {"time": 1310, "text": "I actually wrote a whole Bitcoin node in Ruby, which turned out to be a, maybe a weird decision in hindsight, cause Ruby wasn't the most performant language."}, {"time": 1318, "text": "We've subsequently had to rebuild that many times."}, {"time": 1319, "text": "But yeah, I had this hosted Bitcoin wallet and the thing that I didn't have any users for it, by the way, I applied to Y Combinator cause I was like, maybe if somebody there writes me a check, this will like make it feel like a real company."}, {"time": 1332, "text": "And I was trying to find a co founder at that time unsuccessfully."}, {"time": 1336, "text": "So I was basically just wandering in the desert."}, {"time": 1338, "text": "I had a lot of self doubt about this cause I was like, I don't know, all my friends don't think this is kind of dumb and maybe Bitcoin is just gonna get shut down and like, this is all be some stupid thing."}, {"time": 1349, "text": "So there was definitely a feeling of just wandering lost in the desert, lots of self doubt."}, {"time": 1355, "text": "Paul Graham and the Y Combinator group kind of wrote me the first check after I went and interviewed and stuff."}, {"time": 1359, "text": "And they wrote me a check for like 150K."}, {"time": 1362, "text": "And that was the first time somebody who I really looked up to kind of said, this is worth pursuing."}, {"time": 1367, "text": "Like maybe you're onto something, maybe you're not, but like, let's at least try it."}, {"time": 1370, "text": "And so that was kind of what gave me the confidence to quit my job and try it."}, {"time": 1375, "text": "And I'll wrap the story here by saying that like we, I found the right co founder after Y Combinator."}, {"time": 1382, "text": "We still didn't have any customers."}, {"time": 1383, "text": "The thing that, I basically launched the hosted Bitcoin wallet."}, {"time": 1387, "text": "There were people signing up."}, {"time": 1389, "text": "I just posted on Reddit and places like that."}, {"time": 1391, "text": "And maybe like a hundred people would sign up and then nobody would come back."}, {"time": 1394, "text": "And so I was like, I just in Y Combinator, they often tell you like, talk to your customers and improve your product."}, {"time": 1401, "text": "Talk to your customers, improve your product."}, {"time": 1403, "text": "That's all you're supposed to be doing."}, {"time": 1404, "text": "Try to find product market fit."}, {"time": 1405, "text": "So I emailed like five of the users that had signed up and I was like, hey, I worked on this app."}, {"time": 1410, "text": "I saw you signed up."}, {"time": 1411, "text": "Can I get on the phone with you?"}, {"time": 1412, "text": "I get on the phone with like five of these folks."}, {"time": 1414, "text": "And I was like, why didn't you come back?"}, {"time": 1416, "text": "And the guy was like, well, the app was okay for a beta, but like, I don't have any Bitcoins."}, {"time": 1421, "text": "So I didn't really know what to do with it."}, {"time": 1423, "text": "And I remember this light bulb kind of went off in my head."}, {"time": 1425, "text": "I was like, well, if I put a buy Bitcoin button in there, would you have used it?"}, {"time": 1429, "text": "And he was like, yeah, maybe."}, {"time": 1431, "text": "So then I had this, we went about the process."}, {"time": 1434, "text": "My co founder at that time, we like got basically had to get like a bank partnership, payment rails, you know, an exchange, basic exchange functionality, all that stuff I was mentioning earlier in place."}, {"time": 1443, "text": "And the minute we launched that feature where you could just click buy, put in your bank counter credit card, buy Bitcoin, it showed up in your account."}, {"time": 1449, "text": "From that day forward, like the number of users started to go up like this."}, {"time": 1452, "text": "And so we finally had found product market fit after two years of wandering in the desert."}, {"time": 1457, "text": "So you weren't even thinking about to buy the on ramps."}, {"time": 1460, "text": "You would think it would be just the wallet, a place to store Bitcoin that you've already gotten."}, {"time": 1467, "text": "This is, I mean, cause that's such a pain to do, to have to work with others to convert dollars and fiat currency into Bitcoin."}, {"time": 1478, "text": "So did you, I mean, were you overwhelmed by the immensity of the task here or were you just sort of not allowing yourself to think too deeply through this whole thing and just letting the optimism take over here?"}, {"time": 1499, "text": "You know, I was really looking forward to like doing something crazy and like a big challenge."}, {"time": 1503, "text": "And I wanted to, I love kind of crisis moments like that where, you know, I'm very determined, right?"}, {"time": 1512, "text": "And especially when I get like very set on something and I'm just like, you know what?"}, {"time": 1515, "text": "I'm gonna figure out a way to make this fucking thing work, like no matter what."}, {"time": 1519, "text": "And so I reveled in that."}, {"time": 1523, "text": "I was sort of, I had read all these books about startups and like every startup has these like, you know, major setbacks and just like nothing works."}, {"time": 1530, "text": "And so that was a sign that you're doing something right."}, {"time": 1533, "text": "I had no idea if I was doing anything right at all, but I was like, I was kind of loving the experience of it in a weird way."}, {"time": 1539, "text": "It felt, it felt stressful at the time."}, {"time": 1541, "text": "Like, you know, nothing was working and, but I was just, I felt like I was on the right path somehow."}, {"time": 1547, "text": "And so I just kept going, I don't know."}, {"time": 1550, "text": "What was the darkest moment that you've gone to in your mind during that time?"}, {"time": 1556, "text": "What was, what were some of the tougher moments?"}, {"time": 1558, "text": "You said self doubt."}, {"time": 1561, "text": "Have you, yeah, where'd you go?"}, {"time": 1564, "text": "Where'd you go in your mind?"}, {"time": 1566, "text": "Is there a moment where you're just like laying there?"}, {"time": 1570, "text": "This is, this is hopeless."}, {"time": 1573, "text": "Well, there's a couple of moments I'm remembering."}, {"time": 1575, "text": "I mean, so for whatever reason, I had this like big chip on my shoulder at that time."}, {"time": 1580, "text": "And I was like, I really want to do something important in the world."}, {"time": 1583, "text": "Like, you know, I could have a good life and like work for some good companies and write some software."}, {"time": 1589, "text": "And I'm, for some reason, I never wanted that for myself."}, {"time": 1591, "text": "That probably would have been healthier, honestly, just to like, as an expected value outcome, that's probably a better thing in life."}, {"time": 1598, "text": "But I was like, I was like, man, I really want to do something important and have a bigger impact."}, {"time": 1603, "text": "And I was like, I was willing to sacrifice a lot for that."}, {"time": 1606, "text": "I was like sleep and not going out with friends and stuff."}, {"time": 1609, "text": "I remember one of the, just for like years working on this stuff, I remember one of the darker moments was, we probably had like maybe five employees at that time."}, {"time": 1620, "text": "And I remember like a bunch of bad things happened like all at once."}, {"time": 1624, "text": "And it was, so first of all, you have to remember at this time, we were all very sleep deprived, which kind of exacerbates everything."}, {"time": 1631, "text": "If you look at like the Exxon Valdez spill and all these like natural disasters, like sleep deprivation is often involved."}, {"time": 1638, "text": "So, because the reason why we were so sleep deprived is not just because we were working so much, but like the site would go offline in the middle of the night and we'd get, I'd get paged."}, {"time": 1646, "text": "I was like on pager duty."}, {"time": 1647, "text": "So I'd get woken up sometimes like two or three times a night, like have to try to fix something, go back to sleep."}, {"time": 1651, "text": "So in that environment, you can kind of get, you can get discouraged."}, {"time": 1657, "text": "So one bad thing that happened was, we had a bug on the website and there was thousands of people on Reddit and Twitter who were all like pissed at Coinbase because like the balances were showing wrong."}, {"time": 1668, "text": "And they were just like, fuck this company, it's over."}, {"time": 1671, "text": "Like, I hate these guys."}, {"time": 1672, "text": "And so that was, I'd never had this feeling of a thousand people mad at me at the same time."}, {"time": 1677, "text": "You know, I feel like I'm a pretty chill guy."}, {"time": 1678, "text": "Like most of the time people don't get mad at me."}, {"time": 1680, "text": "So that was one."}, {"time": 1682, "text": "Another one was that."}, {"time": 1683, "text": "Can we pause on that?"}, {"time": 1685, "text": "So you were saying like, here's a dream."}, {"time": 1687, "text": "I'm trying to create something."}, {"time": 1688, "text": "And now forever, the reputation of this dream is ruined."}, {"time": 1693, "text": "It will never, it's irrecoverable."}, {"time": 1695, "text": "It's over, that kind of feeling."}, {"time": 1697, "text": "Yeah, well, I didn't, you're right."}, {"time": 1698, "text": "I didn't know at that time."}, {"time": 1699, "text": "I was like, is this, is this the end?"}, {"time": 1701, "text": "Like everybody, we're so, we're so tiny."}, {"time": 1704, "text": "Now everybody hates us."}, {"time": 1705, "text": "So is it over?"}, {"time": 1708, "text": "Nobody told me this before starting a company that like, you're a bunch of people will hate you for this, which is like a very counterintuitive thing."}, {"time": 1715, "text": "Cause you know, most companies I think are doing good things in the world, at least you're trying, right?"}, {"time": 1719, "text": "And so even if someone's like trying, but they're not, they're failing, I'm generally rooting for them."}, {"time": 1723, "text": "At least you're trying, right?"}, {"time": 1725, "text": "But that's not the case at all."}, {"time": 1727, "text": "And most founders I've known have gone through this too, where they're very surprised at the amount of hate that they get."}, {"time": 1734, "text": "And if it's, I think it's actually like a muscle you can build your tolerance to it."}, {"time": 1737, "text": "Like, because you know, you go talk to somebody who's like, for you, it feels terrible cause you're at the center of this storm and like, but if you go, then you go talk to like, you know, your family or some other person like, dude, I didn't even hear about that."}, {"time": 1748, "text": "Like my, they're just busy in their own life."}, {"time": 1751, "text": "And so they, they have no idea that you had all this negative press or like whatever it was."}, {"time": 1756, "text": "Can I put once again, put a link on that?"}, {"time": 1760, "text": "There's an interesting person I'd like to bring up just as an example, Bill Gates."}, {"time": 1767, "text": "So he gets a very large amount of hate on the internet."}, {"time": 1772, "text": "And there's something about him, this is me talking that you, that he seems out of touch about that hate."}, {"time": 1779, "text": "I believe at least in my understanding that with the resources he has, he's trying and is actually doing a lot of good."}, {"time": 1790, "text": "And yet there's a gigantic amount of hate, conspiracy theories and stuff like that."}, {"time": 1795, "text": "And it feels like that's the case because he's somehow out of touch with people."}, {"time": 1802, "text": "So I wonder how you stay in touch with the voice of the people without being destroyed by the outrage."}, {"time": 1808, "text": "Is there any wisdom you have to that or?"}, {"time": 1811, "text": "I don't know about wisdom, but I've thought about this too, because yeah, you wanna always be open to feedback, especially from people who have like your best interests at heart, right?"}, {"time": 1822, "text": "And if you can become isolated from it and just like, you know, surrounded by yes people."}, {"time": 1828, "text": "And I mean, who knows, maybe like she and Putin and people like that are in situations I have no idea."}, {"time": 1836, "text": "But if you listen to too much of it and you just try to please everyone, you'll never get anything done."}, {"time": 1841, "text": "And I mean, most of the best leaders are people who they can act when they believe that they're doing something net positive for the world and humanity."}, {"time": 1851, "text": "And they actually don't really care if they piss off some portion of the people."}, {"time": 1855, "text": "Almost anything you're gonna do of significance in the world today is gonna piss off 5% of people, maybe 49% of people or whatever, maybe 60%, I don't know."}, {"time": 1864, "text": "So you never wanna become so surrounded by people who just work for you and will say yes."}, {"time": 1869, "text": "And then you think like, well, I'm a genius and I'm like, that's how you become a dictator or whatever."}, {"time": 1875, "text": "But you also can't care so much about what people think because then you'll never do anything that's truly authentic to yourself."}, {"time": 1881, "text": "One other thought on that, by the way, I think it's a really good question."}, {"time": 1885, "text": "So I've thought about this a lot."}, {"time": 1886, "text": "Like why, you know, people generally kind of hate on Zuck and they hate on Bill Gates and they hate on, they don't really hate on Elon."}, {"time": 1894, "text": "Well, actually Elon has a lot of haters too, but it's a different thing."}, {"time": 1897, "text": "This is measured, this is measured, I was looking at some surveys, so I think Zuck is the most, so loved and hated, right?"}, {"time": 1906, "text": "Zuckerberg is the most, both loved and hated."}, {"time": 1910, "text": "He's the most hated."}, {"time": 1912, "text": "And then I think it's Bill Gates and Elon is down there."}, {"time": 1915, "text": "I think it's like 40% hate Zuck, people asked."}, {"time": 1919, "text": "And then Elon is in the double digits, but low double digits."}, {"time": 1924, "text": "And so it's interesting, you just look at this data, ask yourself why."}, {"time": 1928, "text": "Right, so I ask myself this sometimes too, because I don't claim to know any of these people well, but like I've met them briefly."}, {"time": 1935, "text": "And my impression is that they're actually all smart people trying to do good things in the world."}, {"time": 1938, "text": "So there's not too much difference there, despite public perception."}, {"time": 1943, "text": "So why is it that some are really hated and some aren't?"}, {"time": 1945, "text": "I mean, it's a complicated question."}, {"time": 1948, "text": "Obviously Zuck in his Facebook got blamed for the whole election thing and all that didn't help."}, {"time": 1954, "text": "Social media has gotten a lot of pressure just from like, hey, why aren't you solving all of society's tough problems?"}, {"time": 1960, "text": "It's like, well, they're just one company."}, {"time": 1962, "text": "But one thing I've noticed is that a lot of these people, they have like Asperger's, right, a little bit."}, {"time": 1969, "text": "And sometimes people with Asperger's don't really emote in the same way."}, {"time": 1974, "text": "And so I think it's almost a form of like bias against their cognitive type or something, which is like that person doesn't emote right."}, {"time": 1987, "text": "I don't trust their intentions."}, {"time": 1991, "text": "And the other thing I've thought about too is that sometimes I think some leaders, like maybe Zuck or Bill Gates, they can come across as like a little bit PR rehearsed."}, {"time": 2002, "text": "Like they're basically, they're giving the PR approved answers where Elon just says whatever he thinks like to a fault."}, {"time": 2009, "text": "So even if people hate what he says or like, at least I believe it's authentic."}, {"time": 2013, "text": "So I've always thought about that too for myself."}, {"time": 2014, "text": "I'm like, how do I, cause you can fuck it up on both sides, right?"}, {"time": 2018, "text": "Like if you just come out and you're like saying whatever stream of consciousness, you'll often end up like pissing off people on your team or like saying tripping over some like regulation that you've, there's all kinds of things about running a public company, you can't say certain stuff."}, {"time": 2033, "text": "But if you're too PR approved and your answer is like, nobody trusts you what you're saying."}, {"time": 2038, "text": "And so anyway, this is something I think about a lot."}, {"time": 2040, "text": "I don't think I have the right answer, but I'm trying to find that balance."}, {"time": 2042, "text": "And more and more with the internet, there's a premium on authenticity, just like you're saying."}, {"time": 2047, "text": "People really, really appreciate that."}, {"time": 2049, "text": "So for leaders, it's a challenge to be, how do I make sure I'm authentic, but also don't say stupid shit."}, {"time": 2059, "text": "And so that's an interesting thing."}, {"time": 2061, "text": "I've noticed that just having interacted with a bunch of leaders that you have to be careful how much you surround yourself with PR folks."}, {"time": 2071, "text": "Because the best, I would say, let me just say a nice thing about marketing and PR folks, the best marketing folks are extremely good."}, {"time": 2080, "text": "So they understand exactly what great marketing is and great PR, it's authenticity."}, {"time": 2086, "text": "It's showing, revealing the beauty."}, {"time": 2088, "text": "As opposed to PR and marketing out of fear."}, {"time": 2091, "text": "Oh, don't say that, don't say this, don't that."}, {"time": 2094, "text": "Because then you start living in this kind of, that pushes you towards a bubble where you can't express the, your beautiful quirks and weirdness and all that kind of stuff."}, {"time": 2103, "text": "And also the cool, the beautiful things about what you're doing."}, {"time": 2107, "text": "I find like, especially with tech things, like even like Coinbase, the way to reveal the beauty of it is not only by showing all the things you could do with it, but showing that there's great engineering going on underneath."}, {"time": 2122, "text": "So letting the nerds shine too."}, {"time": 2123, "text": "It doesn't have to be like these kind of commercials where it's like a happy family using Coinbase to send a transaction about flowers for mom or something like that."}, {"time": 2137, "text": "Like it could be also like gritty stuff and real stuff."}, {"time": 2141, "text": "So that's a general just observation I made."}, {"time": 2145, "text": "But you said you were talking about dark moments and that there's people on the internet that were pissed off that the site was down."}, {"time": 2151, "text": "And you said there might be something else."}, {"time": 2154, "text": "Yeah, so sleep deprived, like a bunch of people on the internet were pissed at me."}, {"time": 2157, "text": "The balances were fucked up."}, {"time": 2159, "text": "Like people were tweeting the company's over, just give the money back, whatever."}, {"time": 2163, "text": "And then, oh yeah, somebody posted."}, {"time": 2167, "text": "So we had all this, we didn't, we started to get all these customer support inquiries and like, we only had like a few people at the company."}, {"time": 2174, "text": "And so we were backed up maybe like 20,000 support requests."}, {"time": 2178, "text": "So people couldn't get ahold of us."}, {"time": 2179, "text": "So somebody posted my cell phone number on Reddit and they were like, they were like, if you need to get ahold of the CEO, whatever, cause everyone's upset about where their money is."}, {"time": 2188, "text": "So I remember we're in the office, it's like late at night."}, {"time": 2191, "text": "We've been working like 12 hours, we're all sleep deprived."}, {"time": 2193, "text": "I'm trying to hack and like get this bug fixed."}, {"time": 2196, "text": "And we all need like food at the office."}, {"time": 2198, "text": "And so my phone has been blowing up all day cause someone posted my phone number on the internet."}, {"time": 2203, "text": "And there's like a guy, there was a guy like trying to deliver food and I needed to answer my phone to like get the food from downstairs."}, {"time": 2210, "text": "So I was like, shit, I gotta just see who, if that's him."}, {"time": 2213, "text": "So I started answering the call and it's like, is this Brian?"}, {"time": 2216, "text": "I'm like, nope, wrong number, click."}, {"time": 2218, "text": "And I pick up the next call."}, {"time": 2220, "text": "It's like every, when I finished the call, another call is like coming in."}, {"time": 2223, "text": "So I was like, I'm a reporter from Japan, like asking about a security, nope, wrong number, click."}, {"time": 2229, "text": "And then I like, finally I get the delivery guy downstairs, bring the food up."}, {"time": 2231, "text": "We were all like surviving to like fix this bug."}, {"time": 2237, "text": "I remember there was just basically a point that night where I was like, fuck, I need to just, I basically just curled up on like a ball on the floor."}, {"time": 2244, "text": "And I just like cried for a little bit."}, {"time": 2248, "text": "I think I let myself just kind of wallow in self pity, kind of took a nap for about five minutes."}, {"time": 2252, "text": "And I was like, let's fucking solve this."}, {"time": 2255, "text": "And I like, you know, stop being like a little whatever and like got back up."}, {"time": 2259, "text": "Sleep deprivation combined with just the stress and the pressure of the site going down and everybody wants the site to be up."}, {"time": 2267, "text": "Just the pressure from people and the number of users is growing and growing and growing."}, {"time": 2271, "text": "So that pressure is just mentally, mentally tough."}, {"time": 2274, "text": "What was your source of strength during that time?"}, {"time": 2278, "text": "Like what, like somebody that patted you on the back and said, we got this."}, {"time": 2284, "text": "Yeah, well, it definitely helped to have a co founder."}, {"time": 2286, "text": "So, you know, there's like that old saying about it's better to be in a great relationship than to be single, but it's better to be single than in a bad relationship."}, {"time": 2294, "text": "So co founders actually blow up a lot of companies too."}, {"time": 2297, "text": "But when you find the right co founder, which I was lucky to find with, with Fred or some, that was very important."}, {"time": 2302, "text": "There was definitely moments where, you know, I was like kind of, you know, at the width end or whatever."}, {"time": 2308, "text": "And he was like, it's like, dude, let's rally."}, {"time": 2311, "text": "Like, and he basically carried the team, you know, a couple of times, like in really key moments."}, {"time": 2315, "text": "What advice would you give to startup founders about this particular stage about surviving it to the five and through the five employees stage where you were?"}, {"time": 2327, "text": "Yeah, well, if your pre product market fit, the best advice that I have from that period is action produces information."}, {"time": 2335, "text": "So just like keep doing stuff, you know, I remember like Paul Graham, Paul Graham had this great line like that."}, {"time": 2345, "text": "I think that's his line."}, {"time": 2346, "text": "And he was like, startups are like sharks."}, {"time": 2348, "text": "If they stop swimming, they die."}, {"time": 2350, "text": "You know, so even if you're like, not sure what to do, like just do anything because when you do it, it'll like, it'll produce some information."}, {"time": 2356, "text": "Like people liked it."}, {"time": 2357, "text": "They didn't, this was very true for me."}, {"time": 2358, "text": "There was times where I just did something instead of debating it endlessly and like, just try it."}, {"time": 2364, "text": "You know, like, all right."}, {"time": 2365, "text": "So we shipped it."}, {"time": 2366, "text": "And like, there was a couple of times where like the minute I shipped it and I was like, I knew, I know we built this wrong, but now I have an idea of what to do next."}, {"time": 2374, "text": "And it wasn't, I only would have had the idea if we'd actually gone through the exercise of going to build it."}, {"time": 2378, "text": "It's like my other favorite analogy for this is that you're like at the base of a mountain that's shrouded in fog and you're looking up at the mountain and you're trying to think like, okay, how do I get up there?"}, {"time": 2389, "text": "But you can only see like three or four steps ahead cause the fog is so thick."}, {"time": 2392, "text": "So you have to just take steps into the unknown."}, {"time": 2395, "text": "And when you take three steps, another three steps will be revealed ahead of you."}, {"time": 2399, "text": "And sometimes you'll end up on some local maximum."}, {"time": 2401, "text": "You'll have to retrace your steps or whatever, but, or come up to a cliff, you know, but most people in life don't take the steps into the fog, into the unknown because it's scary."}, {"time": 2414, "text": "Or they're like, I don't know, what if I fail?"}, {"time": 2415, "text": "Or like, I don't know how that's going to work or I might run out of money or I won't be able to get a job after, or I don't know, whatever reason."}, {"time": 2421, "text": "But that is like one of the things that separates, I think entrepreneurial people with that kind of inclination is that they have sort of a comfort with this risk tolerance but it's actually not really risky if you think about it."}, {"time": 2433, "text": "It's not like, you know, at least in most places, like, you know, if you go to a startup and it fails, like you're going to, you're even more valuable to your next employer, right?"}, {"time": 2444, "text": "Or you can go raise a seed round, pay yourself a salary, try it for like two years or three years."}, {"time": 2449, "text": "If it doesn't work, go get another job."}, {"time": 2450, "text": "It's not like you're, you weren't paying yourself a salary during that time."}, {"time": 2453, "text": "So I think, I think people overestimate the risk of doing a startup and they just never, they never start because it seems crazy and all your friends think it's silly."}, {"time": 2462, "text": "Like that's sort of the default nature of every big startup idea."}, {"time": 2465, "text": "It's just basic fear."}, {"time": 2466, "text": "It's the same kind of fear that if you see a, if you're a guy, see a cute girl at a bar, it's the fear associated with coming up to her, you like her, asking her."}, {"time": 2475, "text": "It's like, what's the actual risk exactly?"}, {"time": 2479, "text": "She'll say, no thanks, I'm not interested."}, {"time": 2480, "text": "No thanks."}, {"time": 2481, "text": "I guess the risk is like, that's going to be mentally difficult to deal with rejection."}, {"time": 2487, "text": "So just like it's mentally difficult to deal with failure."}, {"time": 2491, "text": "If you had a bunch of ideas and you were excited about them and you implement them and you realize they're not good, that could be difficult to keep pushing through that."}, {"time": 2500, "text": "But I suppose that's life."}, {"time": 2501, "text": "You're supposed to, you know, perseverance through the failures and then the risk is low."}, {"time": 2508, "text": "So that's, and then the whole time through the fog up the mountain, you're looking for product market fit."}, {"time": 2513, "text": "So you know, you have it when the usage of your product keeps growing without any marketing dollars or anything like that."}, {"time": 2518, "text": "It's just like more people keep coming back every week or month."}, {"time": 2521, "text": "So you're kind of keep, you're basically watching your stats."}, {"time": 2524, "text": "Nothing is working."}, {"time": 2525, "text": "You see these little wiggles of false hope in your metrics and you basically just keep talking to customers, fixing the, improving the product, talk to customers, improve the product, talk to customers, improve product, you know, and try not to run out of money."}, {"time": 2537, "text": "So be really scrappy."}, {"time": 2539, "text": "And then if you're lucky, you hit some kind of threshold where like, okay, the thing is good enough now, or we hit on some use case and then it'll organically start to grow a bit."}, {"time": 2548, "text": "And then you have a whole different set of problems once you hit product market fit, which is how do we scale this thing?"}, {"time": 2554, "text": "How do we hire people?"}, {"time": 2555, "text": "How do we, you know, hire an executive team or raise more money?"}, {"time": 2559, "text": "And like, so the problems totally change, but yeah."}, {"time": 2562, "text": "Well, you were there through the whole thing."}, {"time": 2565, "text": "So that's the other question that's fascinating."}, {"time": 2568, "text": "Again, back to the girl at the bar, how do you hire people?"}, {"time": 2572, "text": "It's like, how do you find good friends?"}, {"time": 2575, "text": "How do you find good relationships?"}, {"time": 2577, "text": "And in this specific case, how do you hire good people?"}, {"time": 2581, "text": "Engineers, executive, all of it."}, {"time": 2584, "text": "One thing is I've done a lot of reps on hiring at this point."}, {"time": 2587, "text": "So Coinbase has about 5,000 people, probably the first 500 people or something, maybe in that range."}, {"time": 2596, "text": "You know, I interviewed every single one of those, but you have to remember there's probably like, I don't know, on average, maybe 10 people that we went in the process for every one we hired or something."}, {"time": 2605, "text": "So it was like, by the time that we had 500 employees, I had done like 5,000 interviews or something."}, {"time": 2611, "text": "I was like very burned out on interviews."}, {"time": 2612, "text": "I had been doing, some days I did like seven interviews in a day or maybe, you know, you've been doing lots of interviews, maybe you wouldn't get burned out, but different kind of interviews."}, {"time": 2622, "text": "Very different, very different, very different, because you're, so first of all, most of your interviews lead to rejection."}, {"time": 2632, "text": "Which is also exhausting."}, {"time": 2634, "text": "Yeah, and there's a whole part of the interview which is about candidate experience, right?"}, {"time": 2639, "text": "Sometimes you know it's not the right person, but you wanna make sure they have a good experience."}, {"time": 2643, "text": "Like, if you're just exhausted and you're on your sixth interview and you're like, well, thanks for coming in and you wrap and you just, and then like, you're gonna create a detractor."}, {"time": 2649, "text": "Someone who's out there like, fuck that company or Brian was rude to me or whatever."}, {"time": 2652, "text": "So I had to, honestly, I had to work on that a little bit in the early days because I was doing so many interviews."}, {"time": 2656, "text": "Like I needed to make sure that when people came in, I was like, you know, made them feel comfortable, asked them a couple of like warmup questions, just like, oh, how was it getting in the office?"}, {"time": 2667, "text": "Like, did you find it okay?"}, {"time": 2667, "text": "And like, what have you been up to this week?"}, {"time": 2669, "text": "And not just like, you know, like a factory assembly line like boom, boom, boom, like, yeah."}, {"time": 2674, "text": "But also there's a moment, cause I've interviewed a bunch of people for like teams and stuff."}, {"time": 2678, "text": "There's also a moment when you, early on, know it's not gonna be a good fit and you still have to land that plane and all that kind of stuff."}, {"time": 2686, "text": "And that could get really, really, really exhausting."}, {"time": 2689, "text": "So yeah, anyway, sorry."}, {"time": 2691, "text": "Yeah, so basically we tried all, we've tried so many things over the years to make interviews more efficient cause it's a huge time sink for the team."}, {"time": 2698, "text": "So, you know, we basically, we'll usually get them down to like 25 minutes."}, {"time": 2703, "text": "I've seen, if you're trying to hire like a big team, let's say, you know, of people who are like contractors or something, not necessarily full time employees."}, {"time": 2711, "text": "I've seen people actually do 10 minute interviews."}, {"time": 2714, "text": "You can even interview like a thousand people almost like in a week or something."}, {"time": 2717, "text": "I'm not sure if that quite works out, but let me a little less than that."}, {"time": 2720, "text": "But you can basically get six and six done in an hour."}, {"time": 2723, "text": "If you're just, I need to get a team of 30 contractors for whatever purpose."}, {"time": 2726, "text": "But if you're talking about full time employees, I usually do like 25 minute."}, {"time": 2730, "text": "You know, you're oftentimes like, one thing we've done is we'll put like a Google form online and it's like, put some basic hurdles in there."}, {"time": 2739, "text": "Like, you know, ask them to put in an answer, which you can check in a spreadsheet if it was correct or not."}, {"time": 2745, "text": "And like, there was some funny examples in the early days of Coinbase where we'd put in like brain teasers and stuff, but we don't do that anymore."}, {"time": 2750, "text": "We do like normal interviews, we do references."}, {"time": 2752, "text": "The kinds of things I ask in interviews, you know, it's usually like, I like to think about what do we need this person to accomplish in this role, right?"}, {"time": 2763, "text": "And get really specific about that."}, {"time": 2765, "text": "It's like usually something pretty hard."}, {"time": 2767, "text": "And then I'll ask them a question."}, {"time": 2768, "text": "It's like, tell me about a time you did X and, or tell me about the hardest, the hardest kind of problem you've had to solve in Y and what did you do specifically to overcome it, right?"}, {"time": 2780, "text": "So I'm asking to see if they can actually do the stuff we need to get done."}, {"time": 2783, "text": "But then I'm also kind of asking like culture questions if I'm interviewing for that."}, {"time": 2787, "text": "And so I'm trying to see like, are they concise communicators?"}, {"time": 2790, "text": "Can they just give me a clear answer and stop talking?"}, {"time": 2794, "text": "Some people like ramble on for like five, 10 minutes if you ask the first question."}, {"time": 2798, "text": "Some people are, you know, they're interrupters like church of interruption."}, {"time": 2802, "text": "So like they won't stop talking until you interrupt them, which for me, I'm always patient and I wait."}, {"time": 2806, "text": "So that's weird."}, {"time": 2809, "text": "I'm looking to see for humility too."}, {"time": 2810, "text": "Like, you know, I'll tell us people, I'll tell you about a time something went really wrong."}, {"time": 2815, "text": "Like you had conflict with someone on a team or what I'm kind of looking for is, were they part of the solution or are they still holding onto like blame and criticism about that and be like, well, I told them they shouldn't do that way, but they didn't listen to me."}, {"time": 2827, "text": "And you know, these are all like bad signs."}, {"time": 2829, "text": "So I'm looking for, yeah, can they get the job done?"}, {"time": 2831, "text": "Will they work together on a team?"}, {"time": 2833, "text": "Can they communicate effectively?"}, {"time": 2835, "text": "Do they fit into our cultural values and you know, those kinds of things."}, {"time": 2839, "text": "Yeah, I mean, there's a, cause I've even for help with this podcast here, but also at MIT and so on, I've done a bunch of hiring and I was always looking for, you said, brain teasers, all kinds of simple questions that can, they can reveal a lot of information and it's always been challenging."}, {"time": 2856, "text": "I used to, I still ask this question, but do you think it's better to work hard or work smart?"}, {"time": 2865, "text": "And you know, I had this idea that I've, that I think I've matured about, which is I kind of believe that people who say work smart on that question don't actually work smart."}, {"time": 2883, "text": "So the right textbook answer is it's better to work smart."}, {"time": 2887, "text": "But the reality is it's people that haven't actually ever done anything that say work smart."}, {"time": 2894, "text": "They're like, they haven't really struggled because my general belief at the time was in order to discover what it means to work smart, to be efficient, to, you have to work your ass off."}, {"time": 2909, "text": "So you have to really fail a lot and failure feels like hard work."}, {"time": 2913, "text": "And so I was always suspicious of people that would say work smart."}, {"time": 2917, "text": "I would want to interrogate that question."}, {"time": 2921, "text": "But then I also, you know, have learned that there is people that are just exceptionally, exceptionally efficient."}, {"time": 2931, "text": "They really do know what it means to work smart, even at a young age."}, {"time": 2935, "text": "And so like, you can't just disqualify based on that."}, {"time": 2938, "text": "You have to dig in deeper."}, {"time": 2940, "text": "But some of the most interesting people I've ever worked with would say work hard unapologetically."}, {"time": 2945, "text": "And they're usually the ones that know how to be efficient, which is, it's just an interesting thing like that."}, {"time": 2951, "text": "And I've always searched for questions of that nature to see can I get a person to reveal something profound about them in as brief of a question as possible?"}, {"time": 2966, "text": "And I, you know, and then of course, there's basic attention to detail and brain teasers and stuff like that, depending on the role, programming and so on to see can they solve a tricky puzzle and do so, like one that doesn't require a lot of effort, but requires a certain nonlinear way of thinking."}, {"time": 2986, "text": "Is there some, I mean, maybe you don't want to reveal, but is there some questions that you sometimes find yourself leaning on?"}, {"time": 2995, "text": "You said like, how did you solve a hard problem in your past and have them talk through it?"}, {"time": 3002, "text": "You know, we started with brain teasers periodically at Coinbase and we got away from that relatively quickly."}, {"time": 3035, "text": "So yeah, I'm a little skeptical now of the brain teaser thing."}, {"time": 3042, "text": "There is a whole, yeah, there is a whole question about, like a lot of universities are getting rid of, you know, entrance exams."}, {"time": 3048, "text": "So if you're hiring right out of universities, sometimes it's becoming a less reliable indicator of like, are they in that university?"}, {"time": 3056, "text": "And I've heard some companies, we haven't done this yet, but I've heard some companies are actually creating their own like for college grads, like their own basically exams, like standardized testing almost to get people in the door because the degree almost like doesn't mean what it used to, which is the whole topic, but."}, {"time": 3072, "text": "Yeah, that's fascinating because it's fascinating both for that, because it's not just about you trying to hire a great team, it's also to help them find the right place to work at."}, {"time": 3084, "text": "It's like a two way street."}, {"time": 3088, "text": "All right, so once you found the product market fit, how did Coinbase become what it is today?"}, {"time": 3099, "text": "So let me ask an engineering question actually."}, {"time": 3102, "text": "Sort of from the Ruby wallet days, what are some of the interesting challenges there?"}, {"time": 3110, "text": "Or are they not engineering?"}, {"time": 3112, "text": "Just the things that had to be solved, what were they?"}, {"time": 3116, "text": "Engineering, regulation, financial hiring, lawyers, what was it?"}, {"time": 3127, "text": "So post product market fit, yeah, a lot of it's scaling and you got to build out an actual company."}, {"time": 3132, "text": "So I remember I was still writing a lot of code there for a while and we were hiring in, we had like maybe 25 people or something."}, {"time": 3139, "text": "I remember one of our investors came by one day and he was like, Brian, how much of your time are you spending writing code?"}, {"time": 3144, "text": "And I was like, maybe 50% or something."}, {"time": 3147, "text": "And he was like, how much time are you spending hiring people?"}, {"time": 3149, "text": "I was like, probably 20%."}, {"time": 3151, "text": "And he was like, I think you need to flip those numbers."}, {"time": 3155, "text": "Like this company is not going to scale."}, {"time": 3156, "text": "You're the CEO, you don't need to be writing code every day."}, {"time": 3159, "text": "You're going to have to transition that stuff."}, {"time": 3160, "text": "Like even if people can't, all that stuff's locked in your head."}, {"time": 3163, "text": "So maybe they're not going to do it as well as you for the first six months or something."}, {"time": 3166, "text": "But like, if you don't start to transition it, you're never going to build a real company."}, {"time": 3169, "text": "It's just going to be, you're going to be the bottleneck."}, {"time": 3172, "text": "So, you know, like a lot of founders that took me a while to like really internalize that lesson."}, {"time": 3177, "text": "I'd always heard people say that and, you know, but I still was holding on too much to decision making."}, {"time": 3182, "text": "And I probably still am, by the way, like even to this day at Coinbase, where we continually have to push down decision making in the org, like even with 5,000 people, like who are the owners of each of these things?"}, {"time": 3192, "text": "And so the temptation is people to push it up and you become a bottleneck."}, {"time": 3195, "text": "And anyway, so yeah, you basically need to make sure you have enough money where you don't die if there's some kind of a downturn or hit break even profitability."}, {"time": 3204, "text": "We were in a position where we were periodically profitable during up periods, but then crypto would go down and we were unprofitable."}, {"time": 3210, "text": "And so we had to kind of manage our own psychology and the balance sheet to make sure we didn't like die in the downturn, which a lot of crypto companies did."}, {"time": 3218, "text": "We had to basically professionalize a whole bunch of services that had been just very quickly thrown together by like 20 year olds, right?"}, {"time": 3226, "text": "Whether that was cybersecurity, it's like, okay, how do you get like a really senior experienced cybersecurity person, but not someone who's so senior that they can't get their hands dirty and they can come into a company with 25, 50 people."}, {"time": 3236, "text": "How do you get a finance person to come in and do that?"}, {"time": 3238, "text": "Our finances were a mess."}, {"time": 3240, "text": "Like we didn't even really know how much money we had at certain times and stuff."}, {"time": 3243, "text": "I mean, this was, it's embarrassing to say, but it was true."}, {"time": 3245, "text": "Like I remember there was a point where we had raised, I think like our series C or something like that."}, {"time": 3252, "text": "And I think we had our bank accounts."}, {"time": 3254, "text": "I just put like $25 million, like in a different bank account that none of this stuff was touched to the actual operations of business."}, {"time": 3260, "text": "Cause I was like, our operations were so messy and we needed to hire a new finance person."}, {"time": 3265, "text": "And I was like, I'd heard horror stories of actually startups where they thought they had X amount of money."}, {"time": 3271, "text": "And then it turned out they had way less."}, {"time": 3273, "text": "And then the whole thing was insolvent in like three weeks."}, {"time": 3275, "text": "So you wanted to have some padding to at least like, all right, I can at least count on this to save us if we go to like super negative."}, {"time": 3281, "text": "Right, I mean, it was like a cheap hack, but that was like the only I could come up with."}, {"time": 3286, "text": "And until we could hire like a real CFO and finance team who like, okay, now we got our arms around how much cash we have."}, {"time": 3292, "text": "It sounds silly, but we had such high volume of money coming in and out."}, {"time": 3297, "text": "What was the ordering of hiring by the way?"}, {"time": 3299, "text": "Like how many engineers was it early on?"}, {"time": 3303, "text": "You said CFO was not, you didn't even have a CFO for a bit."}, {"time": 3306, "text": "Like what was the landscape of hiring as you building up this company?"}, {"time": 3313, "text": "Was it engineering focused?"}, {"time": 3316, "text": "I mean, so the first person we hired was just like, we need to solve customer support."}, {"time": 3320, "text": "So we brought someone to do that because we were all staying up till midnight every night trying to do customer support."}, {"time": 3323, "text": "And then we got more engineers."}, {"time": 3326, "text": "And then I think maybe the sixth hire or something like that was a recruiter."}, {"time": 3329, "text": "Cause that turned out to be, you need to build, hire the person who can hire more people."}, {"time": 3334, "text": "That turned out to be a great force multiplier."}, {"time": 3337, "text": "And then you're going down the list."}, {"time": 3339, "text": "Eventually you want to hire some more senior people."}, {"time": 3343, "text": "We needed legal and compliance."}, {"time": 3345, "text": "We needed that really badly."}, {"time": 3346, "text": "Cause we, it was all kinds of questions about what the legality of it was."}, {"time": 3350, "text": "Was it hard to find legal people that work with crypto, like serious adults?"}, {"time": 3354, "text": "Cause it's such a cutting edge new world."}, {"time": 3357, "text": "Yeah, I mean, there was nobody who had like more than, nobody had three years of experience with it cause it had only been around a few years."}, {"time": 3364, "text": "So yeah, we were finding people from adjacent fields."}, {"time": 3367, "text": "There's a certain personality type of people who are willing to join early companies because they have no structure."}, {"time": 3372, "text": "You can't really commit to them about you're going to have this team or this boss or whatever."}, {"time": 3376, "text": "Like everything's in chaos and flux."}, {"time": 3378, "text": "So it takes, yeah, hiring is one of the hardest things in the early stage for sure."}, {"time": 3383, "text": "You got to find people crazy enough to join you on this journey."}, {"time": 3386, "text": "So one of the interesting things about Coinbase and you've written, we've talked, we'll talk about it a bit."}, {"time": 3391, "text": "You're very focused on the mission."}, {"time": 3394, "text": "You're very kind of, I think that simplifies things that makes hiring easier, that makes working at Coinbase easier, that makes, I mean, it's similar."}, {"time": 3404, "text": "So Elon has the same thing."}, {"time": 3406, "text": "It's pretty clear."}, {"time": 3407, "text": "It's pretty clear what we're here to do."}, {"time": 3410, "text": "So I suppose what's the mission of Coinbase?"}, {"time": 3415, "text": "Well, it's to increase economic freedom in the world."}, {"time": 3417, "text": "And what is economic freedom?"}, {"time": 3419, "text": "Yeah, so economic freedom is this term kind of like GDP that economists use."}, {"time": 3424, "text": "And it's basically a measure of different countries around the world."}, {"time": 3426, "text": "It looks at things like, are there property rights enforced?"}, {"time": 3429, "text": "Is there free trade?"}, {"time": 3430, "text": "Is the currency stable?"}, {"time": 3432, "text": "Can you start companies that you wanna start?"}, {"time": 3434, "text": "And can you join the ones you wanna join?"}, {"time": 3435, "text": "And is there corruption and bribery prevalent or is it relatively free of that?"}, {"time": 3440, "text": "And so there's several different organizations that basically score countries by economic freedom."}, {"time": 3447, "text": "And the really cool thing about economic freedom is that basically it positively correlates with things that we all want in society, like not only higher growth of the economy, but also things like higher self reported happiness of citizens, better treatment of the environment, better income for the poorest 10% of people."}, {"time": 3464, "text": "And it negatively correlates with things we don't want in society, like corruption and bribery and war, even in things like that."}, {"time": 3470, "text": "And so it's this pretty crazy provocative idea, which is that if you give people good property rights and rule of law and allow them to trade, it basically encourages them to do more good stuff and the whole society benefits."}, {"time": 3485, "text": "Like one of the things, you may have noticed this growing up in various places you did, or I spent a year living in Buenos Aires, Argentina that went through hyperinflation."}, {"time": 3493, "text": "And there's a certain like pessimism that can creep into countries when they don't have economic freedom, which it's basically like everyone has this bit of this vibe, which is like, don't stick your head up, don't try too hard because it could all be gone tomorrow."}, {"time": 3508, "text": "Like the things that really are valuable in life are just family and friends and the past was better than the future will be."}, {"time": 3515, "text": "And so you don't really, people don't try as many, they don't try hard because you're not really sure you can actually keep the upside of your labor if you try hard, so you just don't try as hard."}, {"time": 3524, "text": "Whereas in America, historically, or high economic freedom countries, people basically like they just try more stuff because they're like, if I do good for other people, I'll get to keep part of it for myself and I can improve my lot in life and for my children and my community, whatever."}, {"time": 3540, "text": "So I realized when I read the Bitcoin white paper a long time ago, that at least I had a hunch."}, {"time": 3546, "text": "At the time I was like, this might be a really powerful piece of technology that can inject good financial infrastructure into all these countries around the world that don't have it."}, {"time": 3555, "text": "Basically good economic freedom principles in like property rights and things like that into these countries all over the world, which just as long as you had a smartphone and now crypto got invented, everybody could have economic freedom."}, {"time": 3567, "text": "And it's crypto is kind of really well suited for economic freedom, because if you want property rights, it's based like crypto is, if you can remember a 12 word phrase or have an app on your phone, you can store as much wealth as you want."}, {"time": 3578, "text": "And it can't be taken away from you."}, {"time": 3579, "text": "You can even, there's like refugees who need to flee and they wanna take their wealth with them and they can't do it often in the traditional financial system."}, {"time": 3587, "text": "And so crypto lets them do that, right?"}, {"time": 3589, "text": "Crypto is inherently global."}, {"time": 3591, "text": "So it allows free trade and cross border payments."}, {"time": 3594, "text": "It makes it easy to accept payments from people globally."}, {"time": 3597, "text": "It provides a stable currency to everyone, not only with Bitcoin, which is kind of like this new reserve currency, but also with stable coins, right?"}, {"time": 3605, "text": "Which are new inventions there."}, {"time": 3608, "text": "So yeah, I basically feel like crypto is this secret hiding in plain sight that can create economic freedom for people all over the world and a more fair and free and global economy."}, {"time": 3618, "text": "Well, so the limit, and by the way, I didn't know about Argentina."}, {"time": 3622, "text": "Why'd you end up in Argentina?"}, {"time": 3625, "text": "Okay, so I was basically, I was living in Houston, Texas after college where I went to school."}, {"time": 3631, "text": "And I had never studied abroad."}, {"time": 3634, "text": "I kind of like, I don't know, I felt like I needed some adventure or something in my life."}, {"time": 3638, "text": "And I was like, I was running this other startup that I was trying at the time, a tutoring company, and I could work from anywhere."}, {"time": 3643, "text": "So my plan was, you know what, I'm just gonna go do like a month in every city around South America, just like almost like to force myself out of my comfort zone because I had never traveled by myself to a foreign country or whatever, and where I didn't really speak the language."}, {"time": 3657, "text": "And anyway, I landed in Buenos Aires thinking I'd go all around South America where I had never been there."}, {"time": 3663, "text": "But I basically, once I was set up in Buenos Aires with an apartment and a cell phone and stuff, then I was like, I don't wanna do that all again next month."}, {"time": 3670, "text": "So I just stayed there for most of the time and took some day trips."}, {"time": 3672, "text": "But yeah, it was kind of a formative experience in that regard."}, {"time": 3675, "text": "You got a chance sort of unexpectedly to experience the social effects of hyperinflation, which is interesting."}, {"time": 3682, "text": "But I also, I've never been, I really, really wanna go as a person who likes tangos, a person who likes the Argentinian national team and soccer and steak."}, {"time": 3694, "text": "All right, and all the other things that Argentina is known for."}, {"time": 3698, "text": "Okay, so economic freedom."}, {"time": 3701, "text": "One of the limits on economic freedom comes from government and government regulations and all those kinds of things throughout the world."}, {"time": 3709, "text": "So how does cryptocurrency help resist that?"}, {"time": 3712, "text": "So can you sort of elaborate a little bit further?"}, {"time": 3715, "text": "What are the things that limit economic freedom and how does crypto help ease that?"}, {"time": 3723, "text": "Today the world, like the traditional financial system is basically every country of the world for the most part has their own currency."}, {"time": 3730, "text": "And so there's a group of people or institutions in each of those countries that's controlling that economic policy or that money supply."}, {"time": 3738, "text": "And it can be manipulated, right?"}, {"time": 3742, "text": "So it's not like many of these currencies are not linked to gold standard."}, {"time": 3746, "text": "The U.S. kind of famously came off that in 1970s, for instance, but if you read Ray Dalio and all this stuff like he talks about, there's thousands of fiat currencies that have been in existence over time."}, {"time": 3756, "text": "And basically all of them eventually get disconnected from backing of like hard commodities and then they get overinflated and printed."}, {"time": 3766, "text": "And so in times of stress, with Nixon, I guess it was like in the U.S. it was the Vietnam War or something like that."}, {"time": 3774, "text": "It kind of drove government spending."}, {"time": 3776, "text": "And so under times of stress, they say, hey, it's a temporary measure."}, {"time": 3779, "text": "We need to break the peg."}, {"time": 3780, "text": "Temporary was like famous words that he used and they go print."}, {"time": 3787, "text": "And so the bad thing about that, of course, is that it sort of erodes people's like wealth if they can only hold their assets in cash, which basically like poor people tend to do that."}, {"time": 3796, "text": "If you're wealthy, you can hold stocks or like real estate and things like that."}, {"time": 3800, "text": "But it's really a tax on the poorest people in society, inflation."}, {"time": 3804, "text": "So anyway, crypto in a way is a little bit of like a return to the gold standard in this digital era, right?"}, {"time": 3811, "text": "Bitcoin, there's guaranteed scarcity of it."}, {"time": 3813, "text": "It's deflationary."}, {"time": 3814, "text": "There's never gonna be more than 21 million Bitcoin."}, {"time": 3817, "text": "And so that's a really important principle."}, {"time": 3822, "text": "I also think not just Bitcoin, but like cryptocurrency generally, it's really important in terms of this, you asked about regulation, right?"}, {"time": 3830, "text": "So think about like, if you wanted to make a global borrowing and lending marketplace or a global exchange, you would have to go to all 200 countries in the world, sometimes like maybe 50 states in the US and get lending licenses or an operating exchange or whatever."}, {"time": 3849, "text": "And that's just an incredible amount of work."}, {"time": 3852, "text": "And you can't even do business in many of these countries because like you have to bribe somebody or it's corrupt or whatever."}, {"time": 3858, "text": "And so, but with DeFi, with decentralized finance, people have published like Uniswap as a decentralized exchange."}, {"time": 3866, "text": "Everybody in the world, no matter what country you're in, what jurisdiction can interface with that decentralized exchange and there's no central company operating it."}, {"time": 3875, "text": "It's a smart contract on the Ethereum blockchain, which is globally decentralized."}, {"time": 3880, "text": "So there's no throat to choke."}, {"time": 3881, "text": "There's no one person or a company you can go to to like, hey, shut this thing down."}, {"time": 3885, "text": "Even if everybody who's working on Uniswap today stopped, the Uniswap smart contract would continue to operate on the Ethereum blockchain."}, {"time": 3894, "text": "Similarly for like a borrowing and lending marketplace, like somebody in India wants to borrow from somebody in the US or whatever, there's very difficult to do that in the traditional financial world, but in a smart contract that's decentralized, you can enable anybody to access it."}, {"time": 3910, "text": "So it's really kind of this great democratizing force that is creating a new financial system that is more fair and more free."}, {"time": 3919, "text": "Yeah, and in some ways it's a clever way that's enabling people to do that in a novel way."}, {"time": 3928, "text": "So is Uniswap in some sense a competitive Coinbase?"}, {"time": 3932, "text": "In which way is it and which way is it not?"}, {"time": 3934, "text": "So because for people who don't know, Coinbase is centralized."}, {"time": 3940, "text": "So let me ask, doesn't that go against the spirit of crypto since crypto is decentralized?"}, {"time": 3949, "text": "What are the pros and cons of being centralized as an exchange?"}, {"time": 3953, "text": "So I don't think Coinbase is fully centralized."}, {"time": 3955, "text": "We have many different products."}, {"time": 3957, "text": "And the way that I think about it is that our exchange or our brokerage is a centralized, regulated financial service business."}, {"time": 3966, "text": "And it's actually important for the crypto ecosystem to have that because you wanna allow a lot of the fiat money in the world to flow into the crypto economy."}, {"time": 3973, "text": "So we're very proud of that."}, {"time": 3975, "text": "And I think we've helped a lot of that money flow in."}, {"time": 3978, "text": "Now, once people have money in crypto, they can choose to hold it in a variety of ways."}, {"time": 3982, "text": "And they can choose to hold it in a self custodial wallet, which is more decentralized."}, {"time": 3986, "text": "They can choose to use decentralized exchanges, which we love and Uniswap is not really, I don't think of them as like a direct competitor to us."}, {"time": 3994, "text": "We basically have integrated Uniswap into a number of our products."}, {"time": 3998, "text": "We love DeFi, decentralized exchanges, the whole thing."}, {"time": 4001, "text": "So Coinbase wallet, which is a self custodial wallet, is more decentralized and it allows people to hold their own crypto."}, {"time": 4011, "text": "They don't have to trust us."}, {"time": 4012, "text": "Can you explain what a self custodial wallet is?"}, {"time": 4015, "text": "What is a wallet and what is a self custodial wallet?"}, {"time": 4018, "text": "Yeah, so it's confusing."}, {"time": 4020, "text": "So a custodial wallet means you're trusting Coinbase to store your crypto, the private keys themselves."}, {"time": 4028, "text": "And for some people and institutions and everything, just meeting them where they are today, that's nice because it's simpler."}, {"time": 4037, "text": "They're not afraid of losing their crypto if they make some accidental mistake."}, {"time": 4040, "text": "Or so custodial crypto products are important to help get a bunch of people into the ecosystem."}, {"time": 4047, "text": "But I'm very supportive of self custodial wallets."}, {"time": 4050, "text": "And I think in some ways they are the future because more and more people are gonna want to store their own crypto, not trust a third party institution to do it."}, {"time": 4057, "text": "And in some ways that is much more authentic to the ethos of crypto."}, {"time": 4060, "text": "So Coinbase will help you convert the fiat into crypto."}, {"time": 4063, "text": "And frankly, that's a more centralized thing."}, {"time": 4066, "text": "But once you have crypto, you can then go to the self custodial world, store it yourself."}, {"time": 4070, "text": "And to get into the technical details just for a second, it's basically saying you're gonna store the keys on your own device."}, {"time": 4077, "text": "And so even if Coinbase gets some court order to seize it, we actually can't."}, {"time": 4083, "text": "From an architecture point of view, we can't do it."}, {"time": 4086, "text": "Or if Coinbase gets hacked or something, we can't lose your funds."}, {"time": 4089, "text": "Now the thing is you have to take the responsibility because we're not taking it."}, {"time": 4093, "text": "So the individual person could get hacked."}, {"time": 4095, "text": "And there's a whole bunch of really cool research happening to make self custodial wallets more resilient to accidental loss, hacks, and just user error."}, {"time": 4108, "text": "I don't know how much you've looked at various cryptography things, but basically, you can have multiple signatures from different keys on different devices where you need two of the three or three of the five."}, {"time": 4119, "text": "There's a whole technology called multi party computation or threshold signing signatures, which is really cool."}, {"time": 4126, "text": "But those are the things you would run locally?"}, {"time": 4129, "text": "These are all security measures, cryptography measures to protect you without a centralized component?"}, {"time": 4137, "text": "So a simple example would be, let's say you had a two of three key signature."}, {"time": 4142, "text": "And one key might be stored at Coinbase, but that's not a quorum."}, {"time": 4146, "text": "So we couldn't unilaterally move your funds."}, {"time": 4148, "text": "But another key is on your device, on your phone, let's say."}, {"time": 4152, "text": "So in a normal situation, you have a key on your phone."}, {"time": 4157, "text": "And so two out of three, it can all get signed very quickly for day to day use."}, {"time": 4161, "text": "But let's say you lose your phone or something."}, {"time": 4163, "text": "Now, there has to be a third key."}, {"time": 4165, "text": "And that's where you could store it in a backup somewhere, like in Google Drive or iCloud."}, {"time": 4171, "text": "You could trust a third party that's not Coinbase to also have that one key."}, {"time": 4176, "text": "And they can't do anything unilaterally with that one key."}, {"time": 4179, "text": "So that's a simple example."}, {"time": 4180, "text": "You can get way more complicated."}, {"time": 4182, "text": "Yeah, that's an awesome idea."}, {"time": 4183, "text": "So if your funds get seized, Coinbase can't do anything."}, {"time": 4189, "text": "But you better not lose your phone, maybe, in that case."}, {"time": 4194, "text": "But it provides a, there is, so even if you lose your phone, then there is a recovery mechanism."}, {"time": 4197, "text": "Because you can get the one key from Coinbase, the one from your backup provider, and recover a new one back on your phone."}, {"time": 4203, "text": "I know, yeah."}, {"time": 4204, "text": "But what if Coinbase is no longer, but because of government, because of, say, it's in North Korea, government says you're no longer, like Coinbase is shut down in that country or something like that."}, {"time": 4215, "text": "Then you can get it, even if you have access to those two."}, {"time": 4219, "text": "So again, perhaps a silly question, but isn't a self custodial wallet a competitor as a notion to Coinbase?"}, {"time": 4229, "text": "No, I mean, so we offer a self custodial wallet."}, {"time": 4233, "text": "We've built one, and it's like one."}, {"time": 4234, "text": "But doesn't it bleed the, like I guess I'm asking a sort of a financial question, is like how does Coinbase make money on transactions?"}, {"time": 4243, "text": "So does this not, it does not decrease the number, or does not significantly negatively affect transactions?"}, {"time": 4250, "text": "Or are you more focused on growing the number of the pie of the number of people that are using cryptocurrency?"}, {"time": 4256, "text": "Yeah, like a traditional financial service firm would probably say, well, we should be storing, let's keep more of the custody with us, because that's how we prove to the world that we're valuable or whatever."}, {"time": 4268, "text": "Like I think that actually we kind of want to encourage our users to move to self custody over time for those who are ready and willing."}, {"time": 4275, "text": "And that technology needs to mature."}, {"time": 4276, "text": "I'm not trying to like force anybody to do it who doesn't want to do it."}, {"time": 4279, "text": "But to me, that's like the future of how we get billions of people using crypto."}, {"time": 4283, "text": "But doesn't that mean they can go somewhere else easier?"}, {"time": 4287, "text": "Yeah, that's sort of the point is like, we're all using the same protocol."}, {"time": 4291, "text": "So there's low switching costs, which keeps all the companies accountable, right?"}, {"time": 4294, "text": "Like if you want to access the visa network, there's only one company in the world you can go through to do that, like visa."}, {"time": 4301, "text": "But if you want to access the Bitcoin network, there's dozens or hundreds of companies out there who can do that."}, {"time": 4306, "text": "So it's arguably, you could argue it's worse for us as a company, but I think it's better for, it's what makes Bitcoin interesting and cryptocurrency interesting is that nobody controls it."}, {"time": 4318, "text": "There is low switching costs for customers."}, {"time": 4319, "text": "It's better for customers."}, {"time": 4321, "text": "And that means that all the companies in the space are going to be held to a high standard because the minute you lose someone's trust, they're just going to move their Bitcoin to some other service and that's good for the world."}, {"time": 4330, "text": "Do you think of Coinbase as, so there's these ideas of layer one, layer two, layer three technologies."}, {"time": 4337, "text": "Do you think of Coinbase as layer one, layer two, layer three?"}, {"time": 4341, "text": "Now that said, there's so many products that are under the Coinbase umbrella that it's hard to answer that question, but what do you think?"}, {"time": 4351, "text": "Do you acknowledge the existence of layer three?"}, {"time": 4354, "text": "So, you know, usually when people are using those terms, layer one, layer two, so they're referring to like, layer one would be the blockchain, layer one blockchain itself, like a Bitcoin or Ethereum or something, not like a centralized service like Coinbase or even our decentralized self custodial wallet."}, {"time": 4371, "text": "So yeah, I wouldn't consider us to be like a layer one."}, {"time": 4376, "text": "These are the decentralized protocols that we're integrating, but Coinbase itself is not those."}, {"time": 4381, "text": "Yes, but layer two is the thing that was basically doing transactions without the settlement on the blockchain."}, {"time": 4389, "text": "And so you get to have some of the benefits of faster transactions without the security associated with the blockchain."}, {"time": 4396, "text": "And layer three is, I suppose, sort of apps built on top of that."}, {"time": 4403, "text": "So, you know, at least I think talking to Michael Saylor, he considers Coinbase a layer three technology."}, {"time": 4411, "text": "I'm not really particularly familiar with this kind of distinction of layer three and two."}, {"time": 4417, "text": "I don't see them as fundamentally different."}, {"time": 4420, "text": "But some of the, okay, I mean, one way of asking that, is there some layer two like of magic happening in order to make transactions associated with the blockchain happen instant, so that they're quick?"}, {"time": 4435, "text": "So that."}, {"time": 4436, "text": "On Coinbase?"}, {"time": 4437, "text": "On Coinbase, yeah."}, {"time": 4438, "text": "Is there some magic going on?"}, {"time": 4440, "text": "Because you're, okay, we should say, how many cryptocurrencies are currently on Coinbase?"}, {"time": 4444, "text": "So it's more than two."}, {"time": 4447, "text": "It's a lot more than two."}, {"time": 4449, "text": "So you have to understand, they have to incorporate all these technologies."}, {"time": 4453, "text": "So how do you make that magic of sort of universal transactions happen across all of these different cryptocurrencies?"}, {"time": 4463, "text": "There's our centralized products and decentralized products, right?"}, {"time": 4465, "text": "The centralized products, we are storing that crypto for you."}, {"time": 4471, "text": "And so if you're moving from one of your accounts to another account, like an ETH1 account to ETH2 account, or from my ETH Coinbase centralized account to your ETH centralized."}, {"time": 4480, "text": "So we can do that transaction off chain to make it faster."}, {"time": 4483, "text": "And it saves the customer fees and it just confirms instantly."}, {"time": 4487, "text": "But it's not truly using the decentralized blockchain, right?"}, {"time": 4490, "text": "So you can also send any Bitcoin address or Ethereum address, for instance."}, {"time": 4493, "text": "And that is putting the transaction on chain."}, {"time": 4496, "text": "Now our decentralized products like Coinbase wallet, the self custodial wallet, every transaction is happening on chain with that."}, {"time": 4503, "text": "And so basically it just shows a little bit of the evolution of Coinbase and the blockchains themselves."}, {"time": 4507, "text": "Like in the early days, these networks were not scalable."}, {"time": 4513, "text": "And so there were no L2 solutions, for instance."}, {"time": 4516, "text": "And so we had to do sort of these hacks, like moving the crypto off chain, if you were moving between your own accounts and stuff like that."}, {"time": 4522, "text": "Otherwise the minor fees would have just eaten us alive as a company, right?"}, {"time": 4526, "text": "But now the blockchains are starting to scale."}, {"time": 4529, "text": "There's a whole bunch of more work that needs to be done on that."}, {"time": 4530, "text": "And we're getting L2 solutions."}, {"time": 4532, "text": "So I think more and more of the transactions are going on chain, whether it's L2, L1."}, {"time": 4536, "text": "And ideally we shouldn't be doing that many transactions off chain, just internal Coinbase ledger or something."}, {"time": 4547, "text": "That's not really in the spirit of crypto."}, {"time": 4548, "text": "So when you say on chain, that includes layer two technology that the blockchain proposes."}, {"time": 4559, "text": "I guess I was asking how much fun magic is happening off chain within Coinbase."}, {"time": 4564, "text": "And you're saying in the early days you had to, but you're trying to do less and less."}, {"time": 4569, "text": "So look, there's a bunch of high frequency traders that use the centralized products and even just regular retail people, they don't want to pay the gas fees and stuff."}, {"time": 4577, "text": "And they're trying to, it actually, we back at the envelope, calculated this out at one point and just like, it would be completely infeasible for like high frequency traders to put everything on chain at this point."}, {"time": 4589, "text": "That's basically what DEXs are doing."}, {"time": 4591, "text": "And so both are important."}, {"time": 4593, "text": "I think more and more is going to move decentralized over time, which is great."}, {"time": 4596, "text": "And we're, and we're basically."}, {"time": 4598, "text": "DEXs are decentralized exchanges by the way."}, {"time": 4602, "text": "So anyway, we want to encourage more and more of it to move decentralized over time, but I don't, the centralized things aren't going away for like a long time."}, {"time": 4610, "text": "It's a decade from now, there's going to be some big institution or pension fund or central bank."}, {"time": 4616, "text": "That's like, all right, we got to hold crypto."}, {"time": 4618, "text": "Let's set up the account in a centralized way."}, {"time": 4620, "text": "So that's, that's fine."}, {"time": 4622, "text": "Both, both are important."}, {"time": 4623, "text": "Do you know the number of cryptocurrencies currently on Coinbase?"}, {"time": 4627, "text": "Do you know that number?"}, {"time": 4628, "text": "It's over a hundred, but it depends."}, {"time": 4630, "text": "It depends what jurisdiction you're in."}, {"time": 4632, "text": "And, you know, are you in institution versus retail?"}, {"time": 4636, "text": "There's like, there's so many different categories now."}, {"time": 4639, "text": "But over a hundred."}, {"time": 4641, "text": "So what does it take to become, to, to, to become an asset, to become a cryptocurrency on Coinbase, to add your technology to Coinbase?"}, {"time": 4653, "text": "Well, so we're trying to get away from this idea of being listed on Coinbase as being seen as like an endorsement or something, because I actually think it's very important that we are not considered judge and jury about, you know, like imagine it was the early days of the internet and you were like, what's a good webpage and what's a bad webpage."}, {"time": 4671, "text": "Like you would have been totally wrong or anytime big tech companies try to make these review, review boards of like, you know, Apple famously gets in trouble for this a lot with their app store review process."}, {"time": 4682, "text": "And so something that you think like a committee of people somewhere thinks looks silly may turn out to be the next big thing."}, {"time": 4691, "text": "We basically have a test of legality, right?"}, {"time": 4695, "text": "We check, you know, do we believe this is a security?"}, {"time": 4699, "text": "If so, it can't be listed on Coinbase and there's a very rigorous process we go through for that."}, {"time": 4705, "text": "Just currently the way the laws are in the US, you can't do that."}, {"time": 4707, "text": "And we've been, we acquired a broker duo license from the SEC."}, {"time": 4711, "text": "We're trying to work with them to get that operational and hopefully someday we can trade real crypto securities."}, {"time": 4715, "text": "But today that's not possible in the US at least."}, {"time": 4718, "text": "Then we look at sort of the cybersecurity of the crypto asset."}, {"time": 4722, "text": "Does it, do we see that there's some flaw in the smart contract or, you know, a way that somebody could manipulate it without the customer's permission?"}, {"time": 4732, "text": "We look at some compliance pieces to it as well, like the actors behind it and like, you know, there any kind of criminal history, anything like that."}, {"time": 4740, "text": "But if we believe it meets our listing standards, basically this test of legality and everything for customer protection, then we want to list it because we want the market to at that point decide."}, {"time": 4751, "text": "And it's kind of like Amazon or something like that where, you know, a product might have three stars or it might have five stars, but if it starts to get one star consistently, like it's probably a fraudulent or it's defective or something like maybe Amazon will remove it."}, {"time": 4766, "text": "But otherwise you want to let the market decide what these things are."}, {"time": 4771, "text": "So that's generally how we do it."}, {"time": 4772, "text": "And by the way, more and more of these assets, I think especially like low market cap assets are going to be traded on DEXs through Coinbase."}, {"time": 4780, "text": "It's not that we, we don't need to list every asset on a centralized exchange."}, {"time": 4785, "text": "I think DEXs are really good for the long tail."}, {"time": 4787, "text": "And then it becomes an even, it's even more clear to people, like this is not some endorsement by a Coinbase of like, this asset's good and this one's bad."}, {"time": 4795, "text": "Like, you know, my belief is there's going to be millions of these assets over time."}, {"time": 4799, "text": "And so I hope it doesn't like make news every time we add one in the future, basically."}, {"time": 4803, "text": "Yeah, I wonder how you get there because I, even I look to Coinbase for, for example, you know, people, as you can imagine, sort of tag me on Twitter or something like that and all that, like you should interview our sort of this, the founder of this particular coin, right?"}, {"time": 4823, "text": "And I, it's so hard for me to know what's, first of all, what's interesting technology?"}, {"time": 4830, "text": "What's, who's a scammer or not?"}, {"time": 4834, "text": "Who's actually legitimately representing an ambitious new thing versus a scam?"}, {"time": 4843, "text": "And I, you know, there's very few sources of like a verification signal."}, {"time": 4850, "text": "And unfortunately Coinbase in part has become a little bit of that too."}, {"time": 4855, "text": "And you're trying to get away from that because you're trying to get as many, sort of let the people decide."}, {"time": 4860, "text": "So you're thinking of like Amazon star type system where the people could rate."}, {"time": 4865, "text": "Yeah, so I think we'll actually probably add like user ratings and reviews."}, {"time": 4869, "text": "So, and we'll be very cautious about like, you know, these are real people."}, {"time": 4875, "text": "There's a bunch of stuff we have to do for that already."}, {"time": 4877, "text": "So I think wisdom of the crowds is good in terms of getting feedback on items, but we also, we're gonna do our own review, which I mentioned earlier, right?"}, {"time": 4885, "text": "Which is like, okay, it meets this minimum bar to be listed on our site."}, {"time": 4890, "text": "I think, yeah, both are important."}, {"time": 4892, "text": "How do you know if a coin is a scam or not?"}, {"time": 4896, "text": "Well, you can see a few things."}, {"time": 4899, "text": "So, you know, I hate to use the word scam because a lot of these are judgment calls."}, {"time": 4902, "text": "You gotta, I kind of, a court may or a jury may land either way, but things that would be red flags to look at would be, you know, is a bunch of the asset owned by an insider or insiders with short vesting periods."}, {"time": 4916, "text": "You know, does the background of the founders, like they may have criminal records or if they've perpetrated other frauds in the past, right?"}, {"time": 4928, "text": "There's a difference between something which is just a me too product."}, {"time": 4933, "text": "It's like, it doesn't have anything interesting about it and something that's an actual fraud or outright scam."}, {"time": 4938, "text": "And you have to, a lot of this data, what's cool about it is that it's now available on chain."}, {"time": 4943, "text": "You can look at like the tokenomics behind it and see who owns it."}, {"time": 4946, "text": "And are they selling it, you know, in like inappropriately or are they pumping it on like YouTube and Twitter and making promises about, hey, the value of this thing may be a higher in the future."}, {"time": 4960, "text": "And like, all those are just big, big no, no's that we would, you know, we just don't wanna go there."}, {"time": 4965, "text": "So our whole thing is like, we want to enable innovation in this space, but not allow anybody to curtail the advancement of this industry by like doing some kind of fraudulent thing or get rich quick thing."}, {"time": 4979, "text": "It's a tricky industry because I'm trying to figure out who to, you know, what's interesting to understand, to research."}, {"time": 4987, "text": "And it's hard to know."}, {"time": 4989, "text": "Let me ask you about a tricky one to add to a centralized exchange, which is privacy preserving cryptocurrency."}, {"time": 4996, "text": "So like Monero."}, {"time": 4998, "text": "Is that technically difficult or is that why, why is like Monero, for example, forget that specific one, but like privacy preserving cryptocurrency blockchains, why is that, is that ever possible to add?"}, {"time": 5015, "text": "So the answer is maybe."}, {"time": 5016, "text": "So here's the reason why."}, {"time": 5020, "text": "So because we're a regulated financial service business, we have various licenses to do that."}, {"time": 5026, "text": "We are regulated by various regulators."}, {"time": 5028, "text": "Part of those licenses requires us to have a quote, reasonable program to monitor for suspicious activity, you know, an AML program, anti money laundering, right?"}, {"time": 5039, "text": "And so if it, if a coin is a hundred percent anonymous and we can't really do blockchain analytics to track source of funds and where these things might be going, it makes it harder to have a reasonable program around that that's defensible."}, {"time": 5056, "text": "Now there are privacy preserving coins like Zcash, which have something called a view key."}, {"time": 5061, "text": "And a view key is basically another key which allows you to deanonymize the transactions in specific situations where you want that."}, {"time": 5068, "text": "So for instance, you know, we do support Zcash."}, {"time": 5070, "text": "And one of the ways we got comfortable with that is that when you're buying it on Coinbase, you know, you can basically have a view key."}, {"time": 5078, "text": "The transactions are not anonymous while you're buying it."}, {"time": 5081, "text": "And we can see where it goes afterwards and do our whole standard program."}, {"time": 5085, "text": "Now, if it gets a few hops away down the road, I mean, people could eventually turn on privacy preserving aspects."}, {"time": 5091, "text": "So, you know, these are tough judgment calls, but at least in terms of our interaction with the customer and everything, we feel comfortable at that."}, {"time": 5098, "text": "I think there's a broader point here, which is that I actually think privacy coins are a good thing for the world and they should be allowed."}, {"time": 5132, "text": "And now the whole internet has basically moved to HTTPS with a little lock icon in your browser, which is better."}, {"time": 5137, "text": "Like, and financial information is like the most important information to keep private, right?"}, {"time": 5142, "text": "So there's times where like, let's say you're running a charity or something and you want to have total auditability, transparency for the whole world, who donated and where did the money go?"}, {"time": 5151, "text": "That's great, you want it to be public."}, {"time": 5153, "text": "But if it's like your personal money or something like that, you don't want to be broadcasting that to the whole world."}, {"time": 5158, "text": "And in some ways that's what blockchains are doing, you know, pseudonymously, because like, but it is a public ledger."}, {"time": 5163, "text": "And so if you can know who owns each address, you can basically deanonymize it."}, {"time": 5167, "text": "I, you know, I think basically people should fight for privacy and freedoms of all kinds, but privacy of money is a good thing."}, {"time": 5176, "text": "So I would like to see more of that in the future."}, {"time": 5177, "text": "You chosen with Coinbase to have a seat at the table with the regulators."}, {"time": 5185, "text": "So what kind of conversations are there at that table?"}, {"time": 5191, "text": "What are the regulations like?"}, {"time": 5193, "text": "What is the level of understanding with regulators?"}, {"time": 5196, "text": "What are they worried about?"}, {"time": 5198, "text": "What are they thinking about?"}, {"time": 5199, "text": "What are the positive and what are the negative regulations that you're facing?"}, {"time": 5204, "text": "That you're educating, struggling with, pushing back on, supporting, all that kind of stuff."}, {"time": 5211, "text": "Oh man, there's so many."}, {"time": 5212, "text": "Cause we're, I mean, we're live in like, you know, maybe a hundred countries or more at this point."}, {"time": 5216, "text": "So the conversations are all over the map."}, {"time": 5219, "text": "I'm trying to think what broad strokes I could paint for you."}, {"time": 5222, "text": "So I'd say one trend that's positive is that basically regulators around the world are more and more, over the last five years, I would say, it's more and more common to find a regulator today asking, how can we preserve the innovation potential of this technology while keeping the bad actors out than it was five years ago, where they were saying, this is all bad activity."}, {"time": 5244, "text": "How do we prevent it?"}, {"time": 5245, "text": "And so maybe this is."}, {"time": 5248, "text": "When you say more and more, what fraction?"}, {"time": 5254, "text": "I'll give you like a US specific example, although we operate in many countries."}, {"time": 5258, "text": "So when I go to DC now, I would say, you know, 50, 60% of the people who I meet with are basically, you know, they're in the camp of crypto, has a lot of potential."}, {"time": 5270, "text": "We should regulate it to make sure the bad people don't do something bad with it."}, {"time": 5273, "text": "But this is here to stay and it has a lot of upside."}, {"time": 5276, "text": "We should basically create the awful regulation and celebrate it and actually encourage this innovation to happen in the US."}, {"time": 5283, "text": "That's a huge change from just three years ago where it was probably 30% of people saying that."}, {"time": 5288, "text": "Now it's like 60, it's like almost double."}, {"time": 5290, "text": "It's getting harder to find like true crypto skeptics in DC."}, {"time": 5295, "text": "I'd say that, you know, maybe only like 20 or 30% of people are like willing to say something negative."}, {"time": 5301, "text": "Like they actually think it's net negative."}, {"time": 5303, "text": "It's like, it's really hard to defend that position at this point, because almost like one in five Americans have used or tried crypto at this point."}, {"time": 5310, "text": "So you're kind of condemning 20% of your fellow citizens if you say that at this point, you know, especially with NFTs and all these things, like a huge segment of people who don't even care about investing or whatever came into the space."}, {"time": 5321, "text": "So, and then basically that's that same conversation is happening, but, you know, delayed by a few years in like India and Europe and in some Asian countries."}, {"time": 5333, "text": "And some countries have really embraced crypto and they're like trying to really, they're ahead of where the US is because they're trying to actually attract the best startups and entrepreneurs like, you know, like Dubai and UK and Australia and all are kind of pushing good regulation, El Salvador actually, I guess, adopted it as like Bitcoin as a legal tender."}, {"time": 5353, "text": "There was another country, Central African Republic, I think that is supposedly did that as well."}, {"time": 5358, "text": "But, you know, there's countries like China that are more autocratic that are saying, hey, this is a threat to our power and like, we're gonna try to really curtail it."}, {"time": 5366, "text": "So what kind of regulations are there that you feel the most that are limiting or that are empowering?"}, {"time": 5373, "text": "Like, is there specific examples?"}, {"time": 5376, "text": "So, I mean, basically I think the securities laws in the US need to be clarified about what, crypto is many different things."}, {"time": 5386, "text": "So like some crypto, like Bitcoin, Ethereum and many others are probably more like commodities."}, {"time": 5393, "text": "They're not controlled by any one person, you know, like anyway, there's people who wanna raise money for a company that's sounds more like a security that should be regulated by the SEC."}, {"time": 5402, "text": "Commodities are regulated by the CFTC."}, {"time": 5404, "text": "Then there's some cryptocurrencies which are more like currencies, like stable coins and central bank digital currencies."}, {"time": 5410, "text": "And those are probably, you know, should be regulated by the treasury or someone like that."}, {"time": 5415, "text": "And then there's a whole another category of cryptocurrencies, which are none of those things."}, {"time": 5418, "text": "They're NFTs like artwork or they're metaverse items or decentralized identity and voting."}, {"time": 5423, "text": "And so I think that there's a very unhelpful point of view out there by some folks, which is, hey, this is all, most of this is like bad activity."}, {"time": 5434, "text": "We need to shut it down."}, {"time": 5435, "text": "So we're just gonna pursue enforcement actions or something like that."}, {"time": 5439, "text": "Most people in DC don't feel that way anymore."}, {"time": 5441, "text": "And I think the people of the US don't feel that way anymore because a lot of them are using this stuff."}, {"time": 5445, "text": "And their general view is, there's a lot of upside potential here."}, {"time": 5448, "text": "We can all agree, let's get rid of the fraud and the scams."}, {"time": 5451, "text": "We all wanna get rid of that."}, {"time": 5452, "text": "So let's create a relatively simple test, which says, if it's like nobody controls more than 20% of it or some threshold, it probably is more like a commodity."}, {"time": 5465, "text": "If someone's raising money for, they're selling this thing for a business, then it's probably a security."}, {"time": 5471, "text": "And then if it's more like a medium of exchange, it's a currency."}, {"time": 5475, "text": "And if it's none of those things, maybe it's artwork or whatever, a legal test like that would help clarify who, which regulator is regulating what."}, {"time": 5483, "text": "And then we also wanna have probably like a sandbox for innovation where if you're a startup and you're doing less than, I don't know, some number, less than some amount of payment volume or customer funds you're storing, it's like just let those things get off the ground without a soul crushing amount of legal bills and uncertainty."}, {"time": 5502, "text": "So if the US can get there, that would be great."}, {"time": 5506, "text": "I think a bunch of other countries now are rushing around the world to sort of create that regulation that does attract innovation."}, {"time": 5512, "text": "And so in the international bodies like IMF and G20 and stuff, they're starting to look at proposed regulation."}, {"time": 5520, "text": "I hope that Coinbase and a bunch of other crypto companies can help in that conversation too."}, {"time": 5523, "text": "We have a whole policy effort."}, {"time": 5524, "text": "I think actually crypto policy efforts are like probably one of the biggest things in DC right now."}, {"time": 5529, "text": "So it moves slow at the speed of government, but yeah, and in the meantime, we're just trying to help more and more people use crypto because ultimately that's what, in the democracies, that's what they care about."}, {"time": 5542, "text": "Like they'll do what the people of the country want."}, {"time": 5544, "text": "So you want governments to start understanding differences between, in the crypto space, commodities, securities, currencies, NFTs."}, {"time": 5552, "text": "I still don't understand."}, {"time": 5554, "text": "What are they supposed to make sense of NFTs?"}, {"time": 5557, "text": "What is NFTs exactly from a perspective of a regulator?"}, {"time": 5562, "text": "Is it the other categories?"}, {"time": 5564, "text": "Yeah, most NFTs you could think of as like artwork, although it's, who knows where it's gonna go."}, {"time": 5569, "text": "You mentioned Metaverse, right?"}, {"time": 5570, "text": "You mentioned some kind of unique identity of a thing."}, {"time": 5574, "text": "Yeah, like there's people selling virtual land in NFTs."}, {"time": 5579, "text": "I actually, I bought this NFT that's like, it's like citizenship in this like city, Dow in Wyoming."}, {"time": 5585, "text": "Like I've never been there, but it's almost like a badge or an attestation like to get access to this location."}, {"time": 5594, "text": "There's like people doing like tickets to events."}, {"time": 5597, "text": "Like, you know, they're called a POAPs."}, {"time": 5599, "text": "Like proof of attendance and things like that."}, {"time": 5603, "text": "So it'll be very interesting to see where NFTs go over time."}, {"time": 5607, "text": "It could get, and that's the danger."}, {"time": 5609, "text": "You don't wanna try to like define the regulation if you don't even know where this thing's gonna go, so."}, {"time": 5613, "text": "And so your efforts in the policy arm is education?"}, {"time": 5617, "text": "Yeah, education, advocacy."}, {"time": 5619, "text": "We're just trying to be like a helpful educational resource essentially, and then if they give us feedback and they're like, hey, don't do this or don't, or do this, like we're more than happy to do anything that's requested."}, {"time": 5630, "text": "We generally go get licenses and we've just tried to do the right thing in the absence of clarity, because if it's not clear what the law says, then you should just basically do good things that you think may be required in the future to show good faith effort towards the right thing."}, {"time": 5645, "text": "And that's part of like innovating in a regulated field, which is, you know, a whole topic in itself."}, {"time": 5651, "text": "So if you are at the table, let me, this is less the case in the United States, but can government agencies seize a person's cryptocurrency by forcing Coinbase to hand it over?"}, {"time": 5664, "text": "So when you're centralized, they have a phone number to call."}, {"time": 5668, "text": "Okay, so this is a complicated topic."}, {"time": 5671, "text": "Like if you really wanna be sure that, this is why people wanna store their own crypto, right?"}, {"time": 5676, "text": "Like with self custodial wallets, like with Coinbase wallet embracing decentralization, they wanna avoid that."}, {"time": 5682, "text": "Now in the US, there is rule of law, right?"}, {"time": 5684, "text": "So we have reasonable protections in place around like search and seizure and things like that."}, {"time": 5691, "text": "You know, Coinbase does, we publish transparency reports on this."}, {"time": 5694, "text": "We get subpoenas, court orders, things like that from various countries around the world."}, {"time": 5700, "text": "And there are situations where we have been ordered to freeze accounts, things like that."}, {"time": 5708, "text": "You know, we have to follow the law, is another way to put it."}, {"time": 5711, "text": "We're a regulated financial service business and so."}, {"time": 5713, "text": "If the money is used as part of breaking the law, that's what that, in a particular jurisdiction, in a particular."}, {"time": 5722, "text": "Right, and then the other thing, sometimes we will actually get court orders or subpoenas that are overly broad."}, {"time": 5727, "text": "We've seen, so they need to follow due process, right?"}, {"time": 5730, "text": "And so we've seen some in the past that were like, well, we need you to freeze this huge number of accounts."}, {"time": 5736, "text": "And it's like, well, we'll actually have gone to court and like pushed back on some of these and said like, what is your probable cause?"}, {"time": 5742, "text": "And has the threshold been met?"}, {"time": 5744, "text": "And like, we've won some of those cases on behalf of our customers."}, {"time": 5746, "text": "So yeah, it's actually really, it's kind of unfortunate and frustrating."}, {"time": 5751, "text": "As a large business, you spend a lot of resources basically interacting with inbound requests by all kinds of lawyers and people and requesting things."}, {"time": 5763, "text": "And some of them are silly and ridiculous and you have to push back and say no."}, {"time": 5767, "text": "And so it's kind of a tax on every company at a certain size which ultimately gets passed on to the customer in higher fees."}, {"time": 5775, "text": "So you have to employ armies of lawyers to deal with this stuff."}, {"time": 5778, "text": "Can you educate me on something?"}, {"time": 5779, "text": "How much innovation is there in the legal space?"}, {"time": 5783, "text": "So for lawyers working with Coinbase because it's such a new cutting edge thing."}, {"time": 5790, "text": "So you're, there's a lot of gray area you're supposed to be operating under."}, {"time": 5796, "text": "Like how hard is it being a lawyer at Coinbase?"}, {"time": 5801, "text": "Like how much precedence is there?"}, {"time": 5803, "text": "I guess is what I'm asking."}, {"time": 5804, "text": "I mean, just like you said, three years."}, {"time": 5807, "text": "It's kind of a new space."}, {"time": 5809, "text": "Yeah, well, it's probably very hard to be a lawyer at Coinbase and very fun because whenever you're in a new field that's growing fast, there isn't a lot of case law and just precedent set."}, {"time": 5822, "text": "So that's also an opportunity for you to go create that stuff."}, {"time": 5825, "text": "And that's what a lot of legal careers are made out of is like take a complex situation where you have to balance difficult things."}, {"time": 5831, "text": "Like how do we prevent bad activity but still enable an innovation?"}, {"time": 5834, "text": "That's a hard question."}, {"time": 5835, "text": "And there's, you can go draft legislation and circulate it to policymakers or come up with these policies and how do you operate a business in an environment where the law is just unclear, right?"}, {"time": 5847, "text": "It's like try to do the right thing, but like strike the right balance."}, {"time": 5853, "text": "So yeah, a lot of our lawyers have to come up with that."}, {"time": 5856, "text": "Very creative stuff."}, {"time": 5857, "text": "You mentioned one of the things you're focused on is expanding the number of people, maybe a billion people on Coinbase or using cryptocurrency."}, {"time": 5866, "text": "Where are we at now?"}, {"time": 5867, "text": "How do we get to a billion?"}, {"time": 5869, "text": "As of Q4 last year, we had 89 million verified accounts on Coinbase, but in any given quarter, only maybe like 10 or a little more million of those are like really active."}, {"time": 5882, "text": "So, and then if you look at globally, I think some of the estimates I've seen is maybe there's like 200 million people or something like that who have ever used or tried crypto."}, {"time": 5891, "text": "So we're a long, you know, we're ways from a billion, but it's not like that far off."}, {"time": 5899, "text": "How do you get to a billion?"}, {"time": 5902, "text": "One is the blockchains have got to become way more scalable."}, {"time": 5906, "text": "It's kind of like we're all running dial up modems and we need broadband."}, {"time": 5909, "text": "And so it's just like too expensive, too slow to do all these transactions."}, {"time": 5913, "text": "And I think if we just get L2s working and scalability, you know, we'll see another order of magnitude kind of come out just from that."}, {"time": 5922, "text": "I think the second one would be more clear regulation."}, {"time": 5924, "text": "That would help a lot."}, {"time": 5926, "text": "I do talk to, you know, pension funds and you know, various asset managers, sovereign wealth funds and stuff."}, {"time": 5933, "text": "And a lot of them tell me, we've got 1% of our portfolio in crypto today, but we really would rather have like 20% in there."}, {"time": 5942, "text": "But what we're waiting for is more clear regulation coming out and saying that clear test that I was saying, these assets are commodities regulated by SCPC, these are by SCC, these are by treasury, whatever."}, {"time": 5953, "text": "So that would be a big unlock."}, {"time": 5955, "text": "Do transactions."}, {"time": 5956, "text": "So one of the things that you mentioned, payments, sorry."}, {"time": 5961, "text": "Well, does that unlock a lot of users?"}, {"time": 5966, "text": "I mean, remittance is like a huge thing."}, {"time": 5968, "text": "People sending money home to their families in other countries where the fees are super high."}, {"time": 5972, "text": "So yeah, if we get blockchains to be more scalable and there's more global adoption, like I think we'll see remittance quarters move over to crypto a lot."}, {"time": 5982, "text": "There's also just, the other thing that's driving a lot of crypto adoption is basically the creation of more and more third party apps."}, {"time": 5989, "text": "So, or dApps they're sometimes called decentralized dApps."}, {"time": 5992, "text": "So a lot of startups now, you know, how like you used to use in the early 2000s, they called them.com startups, but now you don't need to say.com cause everybody's using the internet."}, {"time": 6001, "text": "And so now there's like hundreds or thousands of these crypto startups, but I think in the future, you won't need to call them crypto startups cause they'll just be called startups cause everyone's using the internet and crypto and whatever."}, {"time": 6011, "text": "So anyway, the use cases, the utility of crypto is getting better and better with like all these third party apps getting funded and created."}, {"time": 6020, "text": "And do you think there's going to be a killer or a set of killer dApps, like a thing where nobody can live without?"}, {"time": 6027, "text": "Are we still waiting for that?"}, {"time": 6029, "text": "There's going to be a bunch of them."}, {"time": 6030, "text": "It's just like, it's like the internet, like what were the killer web companies, you know, like Uber and Wikipedia and Airbnb and Google."}, {"time": 6037, "text": "And like, so there's going to be some big winners, but there'll be thousands of, this is basically the new, it's like what happened with the.com startups in the early 2000s."}, {"time": 6047, "text": "It's like a lot of the best entrepreneurs are building crypto startups now."}, {"time": 6050, "text": "So tons of venture money flowing into the space."}, {"time": 6054, "text": "A lot of smart young people, so."}, {"time": 6055, "text": "Do you think Bitcoin or some other cryptocurrency will become the reserve currency of the world at some point?"}, {"time": 6061, "text": "Cause this is kind of a controversial idea, but I actually think yes."}, {"time": 6066, "text": "I do think Bitcoin could end up becoming a reserve currency of the world."}, {"time": 6070, "text": "So I've been reading Ray Dalio recently with his new book, like The Changing World Order."}, {"time": 6076, "text": "And I thought it was a really well researched book."}, {"time": 6079, "text": "He talks in there, he looks back at history, right?"}, {"time": 6081, "text": "He looks at like empires and going back to various Chinese empires, the Dutch and Ottomans and everybody, and how did they rise?"}, {"time": 6089, "text": "And they were able to have the reserve currency as they rose and what produced that?"}, {"time": 6094, "text": "Like it came from good education and innovation and better trade and anyway."}, {"time": 6099, "text": "So the US by some measures is kind of looks like it's, maybe it's had a really good run and it's coming down a little bit and China is kind of coming up."}, {"time": 6109, "text": "Who knows how that'll play out, by the way, like the world is very complicated."}, {"time": 6112, "text": "It could, that could switch."}, {"time": 6115, "text": "But I guess if the US dollar is gonna be seeing more inflation in the future, the Chinese Yuan is not like necessarily better, right?"}, {"time": 6125, "text": "I mean, they have a ton of debt as well."}, {"time": 6128, "text": "And it's not like you could really, that the Yuan could be inflated as well, right?"}, {"time": 6135, "text": "It probably will be."}, {"time": 6137, "text": "And so I do think that there's this group of people today which probably most traditional, I don't know, like the people who run big banks and like governments and stuff that they're not, this is not really on their radar today."}, {"time": 6149, "text": "But I think there's basically a group of younger people in that kind of 25, 35 year old range who are tech savvy."}, {"time": 6157, "text": "They're starting to think of crypto as like the primary thing in their financial life."}, {"time": 6162, "text": "It's like, I basically hold my wealth in crypto and I use dollars or euros or whatever."}, {"time": 6167, "text": "If I happen to need something, I convert it to that at the last minute."}, {"time": 6170, "text": "It's like, if I'm traveling, I might convert some local currency in the moment, but that's not where I hold most of my wealth."}, {"time": 6177, "text": "So this segment of the population is not like massive yet from a GDP point of view, but I think it's a leading indicator of where things could be going."}, {"time": 6186, "text": "And this is actually good for the world."}, {"time": 6187, "text": "It's kind of like, especially if China does continue to rise and it has a more authoritarian view, it'll be kind of this very centralized East versus a decentralized West where people are in the West, in the free world, really kind of embracing crypto and a more open, fair, free global financial system, which I think will be enormously beneficial for humanity."}, {"time": 6211, "text": "And I do think basically Bitcoin is the reserve currency, the gold standard of the crypto economy."}, {"time": 6217, "text": "So that's pretty crazy."}, {"time": 6219, "text": "Yeah, the gold standard."}, {"time": 6220, "text": "I mean, it's also like with Ray Dalio, I feel like China will drive a lot of this, either in response or directly."}, {"time": 6229, "text": "I mean, I think the ruble, I'm not paying as close attention to the financial systems, but I think they're trying to tie it to gold once again."}, {"time": 6239, "text": "So that's an interesting, maybe it'll be one of the more authoritarian regime that will switch to Bitcoin standard first."}, {"time": 6247, "text": "And then it's the West that will, out of that pressure will catch up versus the other way around."}, {"time": 6257, "text": "It's fascinating to think of what is the forcing function, what kind of perturbation is required to switch, to change anything, honestly, about the financial system."}, {"time": 6268, "text": "But it could be, as you're saying, just waiting for the people that are young now that are embracing crypto to enter the positions of power, essentially."}, {"time": 6281, "text": "But I hope that's not the case, because if for any innovation we have to wait, sorry to say, for the older folk to pass away, that's not an efficient way to make change."}, {"time": 6294, "text": "Yeah, that's a super interesting topic of how people's minds become less plastic as they age."}, {"time": 6302, "text": "I guess it's a feature."}, {"time": 6305, "text": "It's called wisdom, but then we also need the wild ones to explore, exploration versus exploitation."}, {"time": 6312, "text": "You wrote a blog post that's really interesting in September 2020 titled Coinbase is a Mission Focused Company, like what we're talking about."}, {"time": 6320, "text": "So one interesting thing you said in that blog post is that we're not going to be distracted by activism within the company that's not related to the mission of the company."}, {"time": 6335, "text": "Now, that's a rare thing for a company to state, for a company CEO to state, especially in this climate."}, {"time": 6344, "text": "Can you, first of all, describe in a little more detail what you meant?"}, {"time": 6350, "text": "Did you receive blowback for this?"}, {"time": 6352, "text": "I definitely received some blowback, but yeah, I'll describe what I meant."}, {"time": 6355, "text": "And if you want to talk about how it came to that too, we can talk about that."}, {"time": 6358, "text": "But what I meant is that there's a lot of companies right now, including tech companies, but not exclusively, where I think like great companies, they have an important mission."}, {"time": 6372, "text": "They're trying to do something really good for the world."}, {"time": 6375, "text": "And unfortunately, they're getting a little distracted from that at times because of employee activism that is causing the company to basically jump into whatever the current thing is and try to help is like the positive interpretation."}, {"time": 6390, "text": "The negative interpretation would be to virtue signal."}, {"time": 6393, "text": "And my view is that this is actually kind of destructive to, this is largely an American company phenomenon, by the way."}, {"time": 6401, "text": "I do worry that this is making America less competitive, even though I think of myself as kind of internationally minded, but I am a US citizen, had my whole life here."}, {"time": 6410, "text": "So when we put out this statement, we had employees that were not in the US who were confused by it."}, {"time": 6417, "text": "They were like, why did Brian need to say that?"}, {"time": 6419, "text": "It was just saying you're going to focus on work at work."}, {"time": 6422, "text": "That's what we were doing already."}, {"time": 6455, "text": "And for me, it was a very uncomfortable situation for me as a CEO."}, {"time": 6460, "text": "I'd never quite been in this situation where most of the time when employees in the past were kind of asking me questions, they would be asking about like, how do we make this product better?"}, {"time": 6470, "text": "Like, what do we do with this competitor?"}, {"time": 6472, "text": "What about this regulator?"}, {"time": 6474, "text": "And it got to a place around that time where most of the questions we were receiving were I think even about things not related to the company they were about broader societal issues."}, {"time": 6483, "text": "Like Brian, what's your stance on XYZ controversial thing?"}, {"time": 6486, "text": "And it was, I often like didn't have an opinion on these really hard questions, right?"}, {"time": 6492, "text": "And I didn't really, I felt like it was distracting the company."}, {"time": 6495, "text": "People internally were getting into fights a lot too, like disagreeing with each other."}, {"time": 6499, "text": "There was a thing where like the social slack internally was turning into a social media almost with people putting in flame wars."}, {"time": 6506, "text": "So, and this culminated by the way with a walkout that happened in the company."}, {"time": 6511, "text": "We had received like some demands from employee groups about various things."}, {"time": 6515, "text": "And there was like basically an antagonistic thing with management and employee."}, {"time": 6518, "text": "And I was like, we're all on the same team here."}, {"time": 6521, "text": "If you wanna be antagonistic, let's do it with somebody else outside the company, that we're trying to improve the world in that dimension."}, {"time": 6528, "text": "So yeah, eventually I was like, okay, the company is not aligned on this."}, {"time": 6533, "text": "I just don't feel, I don't like the job as CEO, frankly."}, {"time": 6536, "text": "Like if the job is to come in here every day and like have to squirm in front of like the most difficult societal questions, I don't think I wanna do that job."}, {"time": 6545, "text": "So like either they're gonna have to go or I'm gonna have to go."}, {"time": 6548, "text": "And I founded this company and I really believe in the mission."}, {"time": 6550, "text": "So they're gonna have to go."}, {"time": 6551, "text": "And what I realized was that, so I basically, I made an exit package available to anybody who wasn't on board with this direction."}, {"time": 6559, "text": "5% of employees took it."}, {"time": 6561, "text": "I got the company realigned towards this mission."}, {"time": 6563, "text": "We're all here to do work."}, {"time": 6565, "text": "By the way, people can, they can go do anything like political or social activism outside of work."}, {"time": 6570, "text": "Like we all, everybody has stuff like that in their personal life."}, {"time": 6574, "text": "But while at work, we can also disagree at work, by the way, on the work."}, {"time": 6577, "text": "You know, this is not like a no disagreement culture."}, {"time": 6579, "text": "Like we should, let's try to get the truth."}, {"time": 6582, "text": "But don't bring stuff into work that's just gonna create division."}, {"time": 6586, "text": "Make the workplace a refuge from division about all these crazy things."}, {"time": 6589, "text": "And like, we're all aligned here to work on the mission."}, {"time": 6591, "text": "Let's do that."}, {"time": 6592, "text": "Yeah, that was really, really, really refreshing to hear."}, {"time": 6597, "text": "So this is me speaking, but there's a sense when companies take on these issues publicly from a CEO position or anywhere else, that it does seem to optimize for virtue signaling versus solving a particular problem."}, {"time": 6613, "text": "Because to solve a particular problem, you really have to really put in a huge, you have to hire a huge number of, you basically have to create a company with a company to take on a particular thing."}, {"time": 6625, "text": "But if you allow yourself to internally care about a particular issue, you're basically pacifying some number of employee, like making sure Slack doesn't get out of hand."}, {"time": 6637, "text": "And then you're doing this kind of, from my perspective, especially on issues that care about fake virtue signaling, basically trying to understand what will make me look the best, what would make the company look the best in this particular aspect."}, {"time": 6650, "text": "And it just seems very shallow."}, {"time": 6652, "text": "And it's optimizing for the wrong thing, not for the solving of the problems, but for the making yourself look like the good guy and trying to then leverage that to say, I'm the good guy in all situations."}, {"time": 6667, "text": "And it just, it's the wrong thing."}, {"time": 6669, "text": "And perhaps from your perspective as a CEO, as a leader, it's also creating division, unnecessary division within people."}, {"time": 6679, "text": "Like they get, yeah, there's something about us who gets extremely argumentative about certain topics."}, {"time": 6685, "text": "They really bring out the emotion."}, {"time": 6688, "text": "And I think that probably, as you were saying, that emotion is even probably okay, maybe productive when that emotion has to do with the mission of the company."}, {"time": 6697, "text": "Like you really care about those disagreements versus like something that has nothing to do with increasing economic freedom using crypto."}, {"time": 6712, "text": "But it was so refreshing because it's rare."}, {"time": 6715, "text": "Why do you think that's a rare?"}, {"time": 6717, "text": "So the city you're mentioning, I mean, there's a bunch of cities, but San Francisco is one such city when that culture."}, {"time": 6727, "text": "And it's sad because San Francisco is also, the Bay Area is also the hub historically of some of the greatest innovation in human history."}, {"time": 6740, "text": "So there's that tension."}, {"time": 6742, "text": "How did that culture emerge there?"}, {"time": 6744, "text": "Where like the innovation was done by people that are very mission driven."}, {"time": 6749, "text": "You get a bunch of smart people together to solve a difficult problem."}, {"time": 6752, "text": "They get maybe sometimes too much blinders on, but they try to balance that."}, {"time": 6757, "text": "Because it requires that focus to solve an actual problem."}, {"time": 6761, "text": "And yet that's also the place where this culture emerged."}, {"time": 6764, "text": "It's a fascinating human dynamic."}, {"time": 6768, "text": "Somebody will one day tell the history of Silicon Valley, not just the innovation, but the social dynamics that occurred there."}, {"time": 6776, "text": "Anyway, why do you think that's so rare?"}, {"time": 6779, "text": "Well, because people don't wanna get attacked."}, {"time": 6781, "text": "It's like super, you don't wanna get canceled, right?"}, {"time": 6784, "text": "It's super uncomfortable."}, {"time": 6787, "text": "Nobody wants to be called a racist or whatever people wanna say on Twitter."}, {"time": 6793, "text": "Did you get attacked?"}, {"time": 6794, "text": "Yeah, yeah, I definitely got attacked."}, {"time": 6796, "text": "I mean, and I knew it would be controversial."}, {"time": 6797, "text": "The only reason I did it, frankly, was that I was kind of at my wit's end."}, {"time": 6802, "text": "I was like, well, like I said earlier, like the job, the CEO job sucks."}, {"time": 6806, "text": "Like either I don't wanna do it or they have to go and I'm gonna make the company into something that I want."}, {"time": 6811, "text": "And I'd spent eight or 90 years of my life at that point kind of building this thing."}, {"time": 6817, "text": "I was like, well, I could go start another company, but it takes a long time to get momentum with these things."}, {"time": 6821, "text": "And Coinbase is a very rare thing that happened in the world."}, {"time": 6824, "text": "I feel very passionate about it."}, {"time": 6826, "text": "So yeah, I'm not gonna go."}, {"time": 6828, "text": "Like I need to make this the company that I wanna work at."}, {"time": 6831, "text": "And what was really interesting was that there was such a huge outpouring of support."}, {"time": 6836, "text": "So I knew that it would be controversial and I would get attacked."}, {"time": 6839, "text": "And predictably, there was some journalists and New York Times and all these people who kind of like went and started writing hit pieces on the company shortly thereafter."}, {"time": 6849, "text": "And they basically just call people who've left the company and can get quotes on whatever they want and then they'll write a story."}, {"time": 6856, "text": "So mainstream media, I lost a lot of trust in mainstream media, frankly, after that."}, {"time": 6860, "text": "And of course, it's kind of become obvious since then that most mainstream media is like hyper politicized at this point."}, {"time": 6866, "text": "It's basically either super left or super right."}, {"time": 6868, "text": "And it's not really that focused on truth."}, {"time": 6873, "text": "So that's kind of unfortunate because I think journalism is actually like really important in society."}, {"time": 6878, "text": "So that whole thing got eroded in the US."}, {"time": 6880, "text": "Luckily, there's sort of new media, people like you and a whole bunch of people."}, {"time": 6884, "text": "Did that blog post help that statement, the 95 people that remained, is this still something you struggle with?"}, {"time": 6892, "text": "Because it's also a culture of the broader tech space."}, {"time": 6896, "text": "Okay, so that was an interesting thing, which was that, so the 95% of people stayed."}, {"time": 6900, "text": "I got a huge outpouring of support from people who said, thank God you finally spoke up and said something because frankly, it was making it not a very fun place to work either."}, {"time": 6912, "text": "And I realized that there is, I think there was, I think Nassim Taleb has this blog post about the tyranny of the 1% or something like that."}, {"time": 6922, "text": "But there's basically a relatively small group, one in 5% or something like that, that is really upset about something."}, {"time": 6928, "text": "It's not the majority of the company, it's like 5%."}, {"time": 6930, "text": "There's another 15% or something that are sympathetic to the cause."}, {"time": 6934, "text": "They're actually somewhat suggestible."}, {"time": 6935, "text": "They will go along with whatever, because it sounds reasonable."}, {"time": 6938, "text": "These are like real issues they're talking about."}, {"time": 6940, "text": "It's not to say that it's not real."}, {"time": 6942, "text": "And they'll kind of get swept up in it."}, {"time": 6944, "text": "But there's an 80% of the company that basically doesn't agree or just wants to get their work done without all this drama or distraction."}, {"time": 6952, "text": "And they're afraid to speak up because if they speak up, they're afraid of being, again, called a racist, like fired, ostracized amongst their peers."}, {"time": 6961, "text": "And so it did require it to get to a bad enough place for me to finally say, you know what?"}, {"time": 6967, "text": "I just, I feel like I have to do this."}, {"time": 6970, "text": "Live through the short term attacks of the press, which ultimately was very freeing for me because now I don't really care."}, {"time": 6976, "text": "And now I can actually just build the company that I want to build without caring about that."}, {"time": 6981, "text": "And then what was cool was a lot of really great people reached out to the Coinbase too after that."}, {"time": 6985, "text": "And were like, I'm an early engineer at Google or wherever."}, {"time": 6989, "text": "And this culture has gotten kind of messed up and I want to work at a company that's willing to stand for that."}, {"time": 6995, "text": "And so we've gotten a lot of good people come over."}, {"time": 6997, "text": "Basically what I realized, and by the way, our diversity numbers and all that stuff, people told me when I was drafting this poster, don't post this, people, underrepresented groups will never want to work at this company again."}, {"time": 7007, "text": "And I was like, I don't think that's true."}, {"time": 7009, "text": "I talked to our ERG groups and they're not telling me they care about this stuff that much."}, {"time": 7014, "text": "They're telling me they just want to be respected at work and do good work and contribute."}, {"time": 7018, "text": "So my gut was telling me that that advice was wrong."}, {"time": 7021, "text": "And I can tell you a year after doing it, our diversity numbers are basically either the same or better in every category."}, {"time": 7028, "text": "So that turned out to be false."}, {"time": 7032, "text": "Look, I hate to be polarizing on either dimension here."}, {"time": 7037, "text": "I just want to get good work done and build good stuff with technology."}, {"time": 7040, "text": "So I think companies should just have reasonable policies."}, {"time": 7045, "text": "You want to get rid of bias in hiring."}, {"time": 7047, "text": "You want to attract great people from all different backgrounds."}, {"time": 7051, "text": "We have pledge 1%."}, {"time": 7052, "text": "We put 1% of the company equity into a foundation."}, {"time": 7055, "text": "I hope we're able to do good stuff with that."}, {"time": 7056, "text": "Let's give back in some way."}, {"time": 7059, "text": "But the main message I guess for me is the core mission, the core work that we're doing on economic freedom and just all of our products, that is the main value that we're contributing in the world."}, {"time": 7072, "text": "Let's just do that more."}, {"time": 7073, "text": "And hopefully we can get from 89 million verified users to a billion or whatever."}, {"time": 7078, "text": "And then I just think that's how we'll have the biggest impact."}, {"time": 7082, "text": "It's tempting though."}, {"time": 7083, "text": "It's so interesting how companies get tempted to help."}, {"time": 7087, "text": "And you step in and it's almost like a drug and then you can't, you forget."}, {"time": 7091, "text": "I mean, like all of us in life just have to be companies."}, {"time": 7094, "text": "You get distracted and maintaining focus."}, {"time": 7099, "text": "The way for Coinbase to add value to the world is to maximize the mission that it's on, not other stuff."}, {"time": 7107, "text": "And when you get wealthier and more successful, it becomes more and more tempting to just help out in some other shallow ways."}, {"time": 7116, "text": "And you just kind of brought that to light."}, {"time": 7117, "text": "So it was very refreshing."}, {"time": 7118, "text": "And it shouldn't be controversial to sort of focus on just getting stuff done."}, {"time": 7123, "text": "Well, let me ask you, I mean, do you think that this, it's all these things tie together."}, {"time": 7127, "text": "There's like a general trend of like more censorship."}, {"time": 7130, "text": "There's like more cancel culture."}, {"time": 7132, "text": "There's some of these like freedom values are kind of, even like freezing people's accounts, like the trucker thing that happened."}, {"time": 7142, "text": "And this seems like there's a general trend of more authoritarian policies there."}, {"time": 7150, "text": "But do you feel like the tide is turning on that?"}, {"time": 7153, "text": "Like there's counter examples to it we've seen recently."}, {"time": 7157, "text": "I think it's the last gasp of old way of doing things."}, {"time": 7160, "text": "And so there's desperation and so on."}, {"time": 7162, "text": "Because to be fair, it's kind of the internet, which is where's the source of a lot of this, where people have a voice, is making the power centers of the world really nervous."}, {"time": 7174, "text": "And so that's where that's coming from, I think."}, {"time": 7176, "text": "And the internet is tricky."}, {"time": 7179, "text": "It's full of bots."}, {"time": 7181, "text": "It's full of like misinformation of all kinds, full of large groups with conspiracy theories and so on."}, {"time": 7189, "text": "And I mean misinformation broadly."}, {"time": 7191, "text": "People are misusing the word misinformation."}, {"time": 7193, "text": "They're just, governments are just labeling random things with misinformation just to censor them."}, {"time": 7199, "text": "But I just think it's just like a new world where the internet is really finally taking hold, where there's billions of devices and everybody has a voice."}, {"time": 7209, "text": "It's almost, basically governments and powerful people are slightly losing hold of power."}, {"time": 7218, "text": "And they're starting to freak out a little bit."}, {"time": 7221, "text": "And once you have young people that are coming up now, gain power, I think we'll rebalance everything."}, {"time": 7228, "text": "And then there's, like you said, promising signs that it's obvious that the majority of people want freedom."}, {"time": 7238, "text": "And that means a lot of things."}, {"time": 7239, "text": "That means economic freedom."}, {"time": 7240, "text": "That means freedom to have a voice, freedom to move around, freedom to act in the way they, without reasonable sort of limitations by people that don't have their best interests."}, {"time": 7255, "text": "And I gain more hope from just regular people that are fighting and like demanding being able to have freedom of speech, or more specifically sort of resisting crude overreach of government in the acts of censorship, at least in the United States."}, {"time": 7279, "text": "And hopefully that percolates out to the rest of the world that's struggling on a much more basic level where people are being put in prison for the words they say, not just banned from Twitter."}, {"time": 7290, "text": "Right, it could be worse."}, {"time": 7291, "text": "What are some lessons from your failures and your successes about what it takes to run a company?"}, {"time": 7300, "text": "I think one of the things that I learned about leadership is that I never really thought of myself as a very natural leader, to be honest."}, {"time": 7308, "text": "I don't think I was a natural leader."}, {"time": 7311, "text": "But so I always envisioned good leaders as like these military generals, like they seem so confident and they're just like bark orders, charge that hill and do this."}, {"time": 7320, "text": "And I was actually like more introverted and kind of, I wasn't really confident in the way I communicated."}, {"time": 7329, "text": "And so what I realized is that there's lots of different kinds of leaders."}, {"time": 7333, "text": "You can be any kind of CEO you want, right?"}, {"time": 7335, "text": "I was kind of more of like a product, technical focus CEO."}, {"time": 7338, "text": "And I preferred to sort of hear everyone's opinion."}, {"time": 7341, "text": "And it wasn't just gonna like render a decision in the room in some like kind of heated moment and like piss off half the people."}, {"time": 7346, "text": "I would do like, all right, I'm gonna go think about it and I'll send you my decision later today or tomorrow or whatever."}, {"time": 7352, "text": "And so I found ways to kind of make it work for me where I could basically, I always tried to avoid like, when people getting like super emotional about something and like, I think they're thinking, their judgment goes down, right?"}, {"time": 7366, "text": "And just like never make a decision when you're angry, right?"}, {"time": 7368, "text": "And so I would always sort of try to get a sense of, are these people like trying to be right or are they trying to seek the truth?"}, {"time": 7374, "text": "And you can do these little tricks like, okay, you argue that person's position and you argue the other one and like see if you can genuinely represent it."}, {"time": 7382, "text": "Now I know you're listening and these kinds of things."}, {"time": 7386, "text": "But I guess, sorry, getting back to your question about leadership, I think I basically just kept doing things that were a little outside my comfort zone."}, {"time": 7395, "text": "And then my comfort zone kept getting bigger and bigger."}, {"time": 7398, "text": "And so I think that's how you build confidence is you do the thing that's scary and it's like a little outside."}, {"time": 7406, "text": "And like when I first started Coinbase, I had never managed anybody."}, {"time": 7410, "text": "I would have been scared to death to have put out like a very controversial opinion like that and sort of, all right, 5% of people will go, we didn't know what percent it was gonna be by the way."}, {"time": 7419, "text": "It could have been 1%, it could have been 50%."}, {"time": 7421, "text": "Like, but we went into it scary because it was a scary thing."}, {"time": 7425, "text": "I was like, I don't know, I think this is right."}, {"time": 7427, "text": "I'm just gonna do it."}, {"time": 7429, "text": "So if you do enough scary things, like you'll build the confidence."}, {"time": 7432, "text": "And I feel like I'm still on that journey."}, {"time": 7434, "text": "Every year or two at Coinbase, there's some big thing that comes out as like, oh my God, like I didn't sleep well for a week and like, this is the next level, right?"}, {"time": 7443, "text": "But that's how you learn and grow."}, {"time": 7445, "text": "So you're still going up that mountain through the fog one step at a time."}, {"time": 7450, "text": "Can I just quickly ask you about a couple of other efforts that are super interesting that you're involved with?"}, {"time": 7455, "text": "So first of all, a little bit more old school, fascinating effort of research hub."}, {"time": 7462, "text": "So what's that about the GitHub for open science?"}, {"time": 7466, "text": "Yeah, okay, so basically I've had a chance to try to help a couple other companies get off the ground too, cause I wanna see various efforts out there succeed."}, {"time": 7474, "text": "And one of them I've always thought about like why is scientific research not more like open source software or why couldn't it be much faster, right?"}, {"time": 7482, "text": "And there's, you've probably have seen this like in an academic setting, right?"}, {"time": 7512, "text": "So, and the preprint servers like bioarchive and archive.org have really helped this but those websites are, they look like they're kind of from like 15 years ago or something."}, {"time": 7520, "text": "Yeah, it's like Craigslist or something."}, {"time": 7521, "text": "Yeah, so anyway, one of the things I, once Coinbase went public last year, I had a little bit of liquidity and I was like, all right, let me fund a small team and let's see if we can, if they can like go off and make something better here."}, {"time": 7532, "text": "So we have a prototype out there, it's at researchhub.com, people can check it out."}, {"time": 7537, "text": "And it's basically, you know, the first version is kind of like Reddit for science."}, {"time": 7541, "text": "There's like various hubs, which are like journals, but you know, you can publish papers there, you can use an electronic lab notebook to sort of have a modern day paper, which is not just a PDF that's static, but it's a living document."}, {"time": 7553, "text": "Ideally in the future, you know, you can get comments and feedback from people in there, you can update it over time."}, {"time": 7557, "text": "We want people to be able to share the code and the data sets associated with their paper, research paper is not just a PDF."}, {"time": 7565, "text": "And in the future, we want to make it even where like, you know, people can get funding for science through that site and even license out innovations that they've made."}, {"time": 7574, "text": "Because the other thing I've noticed in life is that there's kind of like, there's a bunch of people working on science and there's a bunch of people building companies and they very rarely intersect, but when they do, you get the best things like SpaceX and Genentech and even Google and like even Coinbase was based on a research paper, the Bitcoin white paper."}, {"time": 7592, "text": "And so most business people are like creating companies that don't have any scientific innovation, they're just like marketing based on, you know, whatever."}, {"time": 7600, "text": "And then a lot of scientists are making things which never actually benefit humanity because they're not commercialized and turned into products."}, {"time": 7607, "text": "And so if we can somehow create a translation layer between those two groups and help them, you know, helps align the market forces, align scientific research to market forces so that they're more incentivized."}, {"time": 7619, "text": "Like if you discover CRISPR or something like that, like you should be a billionaire, you know, and like all the downstream implications of that, not going through some antiquated tech transfer office or whatever."}, {"time": 7628, "text": "And if you're an entrepreneur, you should be looking to commercialize the latest scientific innovations."}, {"time": 7634, "text": "And so that's kind of like the longterm vision for that site."}, {"time": 7638, "text": "I think it's just an early step today, but we've got like a really passionate community on there that are jumping into like, you know, computer science or longevity or various bio hubs or whatever and like beginning to source the best innovations, but also discuss them, improve them and publish through the site."}, {"time": 7656, "text": "So I have a question about incentives, but first let me say for people listening who are outside of academia might not be familiar with an absurd situation."}, {"time": 7664, "text": "So there's journals, like you mentioned, and scientists publishing those journals and the journals provide very little value except matching you with reviewers that are unpaid."}, {"time": 7680, "text": "And so in the digital world, they're providing basically almost no value except hosting your paper."}, {"time": 7690, "text": "And they put up a paywall and charge people to access that."}, {"time": 7695, "text": "And that charge is not like even Netflix fees, you're talking about a lot of money."}, {"time": 7700, "text": "So they're basically blocking your research that should be wide open from the world and creating a paywall."}, {"time": 7708, "text": "It's a fascinating like scam that's actually holding back."}, {"time": 7712, "text": "I don't, it's a shitty scam because you're not making that much money."}, {"time": 7717, "text": "I feel like a definition of a scam, you should at least be making money."}, {"time": 7720, "text": "So like significant amount of money, you're basically making shady money and holding back all of human knowledge, okay."}, {"time": 7726, "text": "So that put aside and people get a little confused because the journals aren't the ones paying the scientists."}, {"time": 7733, "text": "People think like the journals are somehow funding the scientists, therefore they have the right to put up a paywall."}, {"time": 7741, "text": "No, no, no, the funding is coming from elsewhere."}, {"time": 7743, "text": "Journals are the middleman that nobody asks for, especially in the digital world."}, {"time": 7748, "text": "Anyway, that said, there is a interesting kind of incentives for scientists, which is prestige and so on."}, {"time": 7756, "text": "So there's a thing with journals, if there's a prestigious journal and you pass the review process, you get into that journal or a prestigious conference in computer science, then that's seen as a good thing in your resume."}, {"time": 7773, "text": "And, oh, not just your resume, within your community, that's a respected thing."}, {"time": 7777, "text": "Is there some way to achieve that same kind of incentive in the open setting of research hub?"}, {"time": 7784, "text": "So like where I could say, I got X, Y and Z, like, look, I'm impressive because this happened on research hub."}, {"time": 7793, "text": "Like the whole academia, like progress track is about like where you got published and how many citations."}, {"time": 7799, "text": "And it's kind of like a false economy of reputation because like, there's not real money backing it."}, {"time": 7806, "text": "And so I think we've thought about this a little bit."}, {"time": 7810, "text": "And I think the research hub team has an opportunity to do something here that basically says like, okay, I had the top paper for 2022 in biology on in here."}, {"time": 7821, "text": "And you basically publish a list, a leaderboards of these like top for the month, the year in all these different categories."}, {"time": 7829, "text": "Then actually, we should probably give out grants and awards in addition to that, fund those people almost like fellows or even give out like, you know how like the Nobel prize, there should be like a research hub prize or something and like ship people, maybe even ship like a print version of a journal that is the top papers in each category in each month or whatever."}, {"time": 7851, "text": "And then like people want to put that in their wall and in the lab."}, {"time": 7853, "text": "And like, so I do think we need to sort of change, I don't know, like the traditional folks in academia or science would probably think this is like crazy idea."}, {"time": 7862, "text": "But I think we need to change the culture to not celebrate getting published in paywall journals, almost like friends don't let friends publish in like paywall journals."}, {"time": 7874, "text": "Like, cause that's, it's just not helping humanity."}, {"time": 7876, "text": "So like, you know, it should be more prestigious to publish in an open science way and get the top spot."}, {"time": 7883, "text": "That should be celebrated above being published in whatever, I don't even want to name one of them, you know?"}, {"time": 7888, "text": "Well, there's currently, the culture has already shifted to where almost everybody publishes on archive and by archive and so on."}, {"time": 7896, "text": "But, so that the culture is there on that scene, friends don't let friends not publish open, but then the prestige thing is missing, which is like anyone can publish an archive."}, {"time": 7908, "text": "So how do you know it's actually a strong paper?"}, {"time": 7910, "text": "Now, funny enough, even with the crappy systems we have now, word of mouth is powerful."}, {"time": 7916, "text": "Like you have a, like citation system is pretty powerful."}, {"time": 7920, "text": "So like you say, okay, this is a strong paper."}, {"time": 7922, "text": "We don't need reviewers, our human eyes are the reviewers, like the community is the reviewers."}, {"time": 7928, "text": "So it's already, like that part is there, but it would be nice to have like, you know, nature level, like this is respect, this is a respectful accomplishment."}, {"time": 7941, "text": "And something like a leaderboard, but a stable kind of system."}, {"time": 7946, "text": "And I should mention too, so there's a crypto angle to this too, which is, so research hub has a coin associated with research coin."}, {"time": 7952, "text": "And it's basically, if people, you know, upvote your paper or like support it, you'll accumulate more research coin, which is basically like rep or like a reward token."}, {"time": 7962, "text": "And so that is a way to, I guess, measure the community's collective view of that paper, a form of peer review."}, {"time": 7971, "text": "And it can even be weighted by like the reputation of the people voting on it and that sort of thing over time."}, {"time": 7977, "text": "Yeah, I think the last thing I'll just say is that, so I think from a rep, like a prestige point of view, it won't start off that way."}, {"time": 7985, "text": "It'll probably start off like being a little more quirky, like, you know, like remember when YouTube first started, it was like people posting weird cat videos and stuff."}, {"time": 7993, "text": "And, but now like, you know, if you have a million subscribers on YouTube, that's probably better than getting like a TV show on NBC or whoever the traditional gatekeeper was."}, {"time": 8001, "text": "So my hope, it might take 10 years, 20 years, whatever, but I'm hoping that this can sort of be the new prestigious way that young people publish in science and it'll come to be viewed as more prestigious."}, {"time": 8012, "text": "The journals, the traditional journals will be viewed as old fashioned."}, {"time": 8016, "text": "Well, it's definitely a system that could do a lot better."}, {"time": 8021, "text": "And there's a lot of incredible, brilliant people doing science, they deserve better, the better platforms."}, {"time": 8027, "text": "So another thing you're taking on and helping out with is this new limit, which is looking at longevity."}, {"time": 8035, "text": "Yeah, okay, so as you can see, I'm excited about science."}, {"time": 8038, "text": "Like I think, you know, science is sort of the, basically if you get scientific innovation, then you get better products and you get better economic growth and then you get all kinds of like surplus in society that can go to arts and philosophy and like all kinds of stuff."}, {"time": 8053, "text": "But with new limits, so yeah, I kind of got, I started hosting some dinners with scientists last year and I was learning about all kinds of the latest stuff happening in bio and there's a lot of really cool stuff happening with like CAR T cells and CRISPR and all these things."}, {"time": 8069, "text": "And anyway, one of the topics I started to learn more about was something called cell reprogramming."}, {"time": 8075, "text": "And, you know, people maybe have heard of this induced pluripotent stem cells where you could take like a skin cell and turn it back into a stem cell."}, {"time": 8083, "text": "And Shinya Yamanaka won the Nobel prize for this work that was done in 2006."}, {"time": 8089, "text": "And, you know, it's kind of a crazy thing."}, {"time": 8091, "text": "You can turn one cell into another type of cell."}, {"time": 8094, "text": "Well, people recently have been experimenting with different types of transcription factors that would either not, you don't want the cell to go all the way back to being a stem cell."}, {"time": 8105, "text": "You can end up getting like cancerous cells and things like that."}, {"time": 8108, "text": "But you want it basically the cell to revert a little bit earlier in its, you know, it would call it the Waddington landscape, but it's basically like go, become act, start to act like a bit of a younger cell, but not to de differentiate and become more like a stem cell."}, {"time": 8123, "text": "And so I decided this might be an interesting area to go fund."}, {"time": 8127, "text": "I think that that team has come together."}, {"time": 8128, "text": "There's like some really talented people who've come together to help get that off the ground."}, {"time": 8132, "text": "And they're basically building a platform that can test a lot of different transcription factors on different cell types and hopefully find ways to rejuvenate different types of cells and tissues to extend human health span."}, {"time": 8170, "text": "To me, this is just, I always think about, you know, it's actually a little inspired by Elon, right?"}, {"time": 8175, "text": "Is like, what are some of the biggest things in the world like that are probably high technology risk, but if they did work, maybe they're kind of low chance of working, but if they did work would have enormous impact."}, {"time": 8218, "text": "Yeah, so he's also doing bio with Neuralink and I feel like bio is tough because it's messy."}, {"time": 8227, "text": "We don't understand it as well."}, {"time": 8229, "text": "The risk is higher in terms of, not the risk is higher, but like you have to deal with the actual sort of, to get to human, to get to stuff where it could be therapies for actual human bodies is tricky because you have to prove that it's safe, it's effective, all those kinds of things with FDA."}, {"time": 8253, "text": "I mean, it's just, it's tricky."}, {"time": 8259, "text": "If I can give a quick plug."}, {"time": 8261, "text": "So yeah, I'm on the board at New Limit."}, {"time": 8263, "text": "We're hiring talented scientists that are interested in the cellular programming space."}, {"time": 8267, "text": "They don't necessarily have to be coming from like an aging background or anything like that."}, {"time": 8270, "text": "There's sort of a small group of people doing even."}, {"time": 8273, "text": "So this is a new thing?"}, {"time": 8274, "text": "This is a, is New Limit relatively new?"}, {"time": 8276, "text": "Yeah, it's very new."}, {"time": 8277, "text": "There's a small team today, just a handful of people."}, {"time": 8280, "text": "And so we're hiring more there."}, {"time": 8283, "text": "If people are excited about that space, reach out."}, {"time": 8285, "text": "And same thing for Research Hub."}, {"time": 8287, "text": "There's a small team there that's really awesome."}, {"time": 8290, "text": "That's doing more like software engineering, design, product, that kind of stuff."}, {"time": 8296, "text": "If you put on your old, wise, sage hat, what advice would you give to young people today?"}, {"time": 8304, "text": "High school, maybe undergrad and college about life."}, {"time": 8309, "text": "So like career, having a career they can be proud of, or maybe a life they can be proud of."}, {"time": 8317, "text": "So people can do whatever they want to be happy, right?"}, {"time": 8320, "text": "So there's not one way to do it."}, {"time": 8322, "text": "I do think that some people, a particular type of people out there, a lot of people actually, they want to have an impact on the world."}, {"time": 8328, "text": "That's how they get a sense of fulfillment, right?"}, {"time": 8330, "text": "So I mean, you need to have like health, physical health."}, {"time": 8333, "text": "You need to have good relationships, like there's lots of things."}, {"time": 8336, "text": "But most people want to do something important."}, {"time": 8338, "text": "They want to have fulfilling work, a way that they can feel like they're contributing."}, {"time": 8342, "text": "I think a lot of people, young people today are thinking like I should be an activist or something like that."}, {"time": 8349, "text": "And there's people in the world who have power and a lot of people who don't, I don't have power."}, {"time": 8353, "text": "And so the way to change the world is to speak truth to power or like criticize power and try to pressure them to change."}, {"time": 8365, "text": "To me, I don't think that's the right way to actually have an impact on the world because everybody has probably, I think people have more power than they realize."}, {"time": 8376, "text": "And by the way, it's easy to be a critic."}, {"time": 8379, "text": "It's hard to actually change these things and fix it."}, {"time": 8382, "text": "And so you'll get a lot of accolades from friends and things like that if you kind of go around criticizing, it's easy to do."}, {"time": 8388, "text": "Like everything is broken and could be better, including stuff I'm working on."}, {"time": 8393, "text": "I find like so frustrating."}, {"time": 8396, "text": "There's a million things I want to be better about like what we're doing in Coinbase."}, {"time": 8401, "text": "So be the person in the arena, like that Theodore Roosevelt quote, I think he said it right."}, {"time": 8406, "text": "Like go chew glass and stare into the abyss."}, {"time": 8410, "text": "Like if you really want to have an impact, either join a company that has a mission that is trying to fix the thing you're passionate about or start that company if it doesn't exist or start a charity if it's not suitable to be a company or whatever it is, but go try to be a part of the solution."}, {"time": 8425, "text": "Don't just criticize or be a part of the problem."}, {"time": 8430, "text": "My hope is that more people can realize that they actually can have a meaningful impact that way."}, {"time": 8439, "text": "And I think that to me, technology is actually one of the most important ways to improve the world."}, {"time": 8445, "text": "Like if you look at climate change, like a lot of the best ideas like carbon sequestration, all these things, it's a technology thing, right?"}, {"time": 8453, "text": "If you want to try to fix education, it's like look at like Khan Academy and all this stuff going online, right?"}, {"time": 8459, "text": "If you want to fix, you know, whatever transportation and like the financial system and global freedom and like equality of all these things, like there's typically the way to get something changed in the world today is with technology."}, {"time": 8473, "text": "And so I do think people, it's very bizarre to me that there's this kind of like anti tech thing going on."}, {"time": 8479, "text": "Look, nothing is perfect."}, {"time": 8480, "text": "Like if you create something new and like tens of millions of people use it or billions of people use it, it's like there's going to be some bad people who use it too, okay?"}, {"time": 8487, "text": "And there's, you know, society is complicated, but like I think most of these things have been net positive because most people in the world are good is at least my view."}, {"time": 8496, "text": "So yes, we can mitigate like the 1% of bad people trying to abuse something, but 99% of people in the world are good."}, {"time": 8502, "text": "And the way you can improve the world is with technology, joining companies, starting companies that are working on the right stuff."}, {"time": 8508, "text": "So I hope more young people do that."}, {"time": 8510, "text": "And just, if you're not sure what to do, like just get started with anything."}, {"time": 8515, "text": "And basically have the optimism that you have the power to do the change."}, {"time": 8520, "text": "So it's easy to distract yourself by being the critic."}, {"time": 8526, "text": "That's almost like acknowledging to yourself that that's all you can be, but basically everybody has the power to be the fixer."}, {"time": 8536, "text": "I like, chew glass and look into the abyss."}, {"time": 8541, "text": "That's much more fun than it sounds."}, {"time": 8549, "text": "Life."}, {"time": 8549, "text": "Yep, what's the meaning of life?"}, {"time": 8551, "text": "What's this existence we got?"}, {"time": 8554, "text": "You're trying to increase the amount of economic freedom on this planet or trying to alleviate some of the suffering."}, {"time": 8561, "text": "I don't really think there is any point to life."}, {"time": 8566, "text": "You know, somebody once told me, you know, if you go into these like, kind of really big existential questions, it can get a little scary because like you stare off the cliff and there's like, there's nothing there."}, {"time": 8579, "text": "You know, this one person told me one time they were like, you know, Brian, you should probably snorkel, don't scuba."}, {"time": 8588, "text": "I guess, and I think they were trying to say like, I, some of my friends have done this, right?"}, {"time": 8593, "text": "They'll go to like, you know, epic meditation retreats and like, they'll kind of come back with all this existential dread of like, what's the meaning of it all."}, {"time": 8602, "text": "And then like, as far as I can tell, we are just some organic molecules in the ocean started like dividing and replicating and the selfish gene and all this stuff, like basically ended up here."}, {"time": 8614, "text": "And our only, it's some kind of like really naive algorithm that's just kind of trying to get us to survive and replicate."}, {"time": 8620, "text": "And we have DNA just like every other animal."}, {"time": 8623, "text": "And so we happened to develop these like really cool neocortexes."}, {"time": 8626, "text": "And so now we're sort of self aware and we have all these big questions and maybe we'll create another, you know, as computers get better, we'll create the simulation inside our thing."}, {"time": 8637, "text": "And I think it's cool."}, {"time": 8638, "text": "Like we should basically, I just want to keep watching the movie, you know, unfold."}, {"time": 8642, "text": "That's part of why I want to work on, like New Limit is really cool."}, {"time": 8645, "text": "Cause it's helped, if people can live longer, whether that's uploading their brain to the cloud or, you know, basically through we get biology to work or the strong AI to work or whatever."}, {"time": 8657, "text": "One of those two hopefully works out."}, {"time": 8658, "text": "And then we get to keep watching the movie and see how it all unfolds."}, {"time": 8662, "text": "I think that's fun."}, {"time": 8663, "text": "And so I don't know if that's like an answer, but I guess I don't think there's any real purpose."}, {"time": 8667, "text": "So just try to have fun."}, {"time": 8668, "text": "Well, the cool thing is that we get to write the movie as we watch it."}, {"time": 8676, "text": "I mean, that's like the Steve Jobs quote and all that, where he's like, everything around you was invented by somebody who just was like, this was a crazy idea they thought up."}, {"time": 8683, "text": "So once you realize you can kind of do anything you want, then that's what you start to go, you start to go try crazier stuff."}, {"time": 8695, "text": "I mean, this is another one of those areas where, not to get too out there, but like, you know, when you're, I think you can build your comfort zone around like people being upset with you."}, {"time": 8703, "text": "You can also build your range of what you think is possible, right?"}, {"time": 8708, "text": "Like when I was in my 20s, I was like reading all these books about like self improvement and goal, how to write down your goals and stuff."}, {"time": 8715, "text": "And my goals were like, someday I wanna make $100,000 a year or something like, and that was, and you know, and it seemed like a little outlandish or what, I wrote down these goals, like I wanna own rental property or something anyway."}, {"time": 8731, "text": "And then I slowly started to get some of these things done over a couple of years."}, {"time": 8735, "text": "And so I started to think a little bigger."}]}]