[{"title": "Erik Brynjolfsson: Economics of AI, Social Networks, and Technology | Lex Fridman Podcast #141", "id": "NOReE-3EBhI", "quotes": [{"time": 297, "text": "Our world is becoming more and more exponential, mainly because of digital technologies."}, {"time": 303, "text": "So more and more often our intuitions are out of whack and that can be good in the case of things creating wonders, but it can be dangerous in the case of viruses and other things."}, {"time": 314, "text": "Do you think it generally applies, like is there spaces where it does apply and where it doesn't?"}, {"time": 319, "text": "How are we supposed to build an intuition about in which aspects of our society does exponential growth apply?"}, {"time": 327, "text": "Well, you can learn the math, but the truth is our brains, I think, tend to learn more from experiences."}, {"time": 335, "text": "So we just start seeing it more and more often."}, {"time": 337, "text": "So hanging around Silicon Valley, hanging around AI and computer researchers, I see this kind of exponential growth a lot more frequently and I'm getting used to it, but I still make mistakes."}, {"time": 346, "text": "I still underestimate some of the progress in just talking to someone about GPT3 and how rapidly natural language has improved."}, {"time": 354, "text": "But I think that as the world becomes more exponential, we'll all start experiencing it more frequently."}, {"time": 361, "text": "The danger is that we may make some mistakes in the meantime using our old kind of caveman intuitions about how the world works."}, {"time": 369, "text": "Well, the weird thing is it always kind of looks linear in the moment."}, {"time": 372, "text": "Like it's hard to feel, it's hard to like introspect and really acknowledge how much has changed in just a couple of years or five years or 10 years with the internet."}, {"time": 387, "text": "If we just look at advancements of AI or even just social media, all the various technologies that go into the digital umbrella, it feels pretty calm and normal and gradual."}, {"time": 399, "text": "Well, a lot of stuff, I think there are parts of the world, most of the world that is not exponential."}, {"time": 405, "text": "The way humans learn, the way organizations change, the way our whole institutions adapt and evolve, those don't improve at exponential paces."}, {"time": 414, "text": "And that leads to a mismatch oftentimes between these exponentially improving technologies or let's say changing technologies because some of them are exponentially more dangerous and our intuitions and our human skills and our institutions that just don't change very fast at all."}, {"time": 431, "text": "And that mismatch I think is at the root of a lot of the problems in our society, the growing inequality and other dysfunctions in our political and economic systems."}, {"time": 444, "text": "So one guy that talks about exponential functions a lot is Elon Musk."}, {"time": 449, "text": "He seems to internalize this kind of way of exponential thinking."}, {"time": 454, "text": "He calls it first principles thinking, sort of the kind of going to the basics, asking the question, like what were the assumptions of the past?"}, {"time": 463, "text": "How can we throw them out the window?"}, {"time": 466, "text": "How can we do this 10X much more efficiently and constantly practicing that process?"}, {"time": 471, "text": "And also using that kind of thinking to estimate sort of when, you know, create deadlines and estimate when you'll be able to deliver on some of these technologies."}, {"time": 486, "text": "Now, it often gets him in trouble because he overestimates, like he doesn't meet the initial estimates of the deadlines, but he seems to deliver late but deliver."}, {"time": 502, "text": "And which is kind of interesting."}, {"time": 505, "text": "Like, what are your thoughts about this whole thing?"}, {"time": 506, "text": "I think we can all learn from Elon."}, {"time": 508, "text": "I think going to first principles, I talked about two ways of getting more of a grip on the exponential function."}, {"time": 514, "text": "And one of them just comes from first principles."}, {"time": 516, "text": "You know, if you understand the math of it, you can see what's gonna happen."}, {"time": 519, "text": "And even if it seems counterintuitive that a couple of dozen of COVID cases can become thousands or tens or hundreds of thousands of them in a month, it makes sense once you just do the math."}, {"time": 531, "text": "And I think Elon tries to do that a lot."}, {"time": 533, "text": "You know, in fairness, I think he also benefits from hanging out in Silicon Valley and he's experienced it in a lot of different applications."}, {"time": 540, "text": "So, you know, it's not as much of a shock to him anymore, but that's something we can all learn from."}, {"time": 547, "text": "In my own life, I remember one of my first experiences really seeing it was when I was a grad student and my advisor asked me to plot the growth of computer power in the US economy in different industries."}, {"time": 560, "text": "And there are all these, you know, exponentially growing curves."}, {"time": 563, "text": "And I was like, holy shit, look at this."}, {"time": 564, "text": "In each industry, it was just taking off."}, {"time": 566, "text": "And, you know, you didn't have to be a rocket scientist to extend that and say, wow, this means that this was in the late 80s and early 90s that, you know, if it goes anything like that, we're gonna have orders of magnitude more computer power than we did at that time."}, {"time": 579, "text": "And of course we do."}, {"time": 581, "text": "So, you know, when people look at Moore's law, they often talk about it as just, so the exponential function is actually a stack of S curves."}, {"time": 591, "text": "So basically it's you milk or whatever, take the most advantage of a particular little revolution and then you search for another revolution."}, {"time": 603, "text": "And it's basically revolutions stack on top of revolutions."}, {"time": 606, "text": "Do you have any intuition about how the head humans keep finding ways to revolutionize things?"}, {"time": 612, "text": "Well, first, let me just unpack that first point that I talked about exponential curves, but no exponential curve continues forever."}, {"time": 621, "text": "It's been said that if anything can't go on forever, eventually it will stop."}, {"time": 626, "text": "And, and it's very profound, but it's, it seems that a lot of people don't appreciate that half of it as well either."}, {"time": 633, "text": "And that's why all exponential functions eventually turn into some kind of S curve or stop in some other way, maybe catastrophically."}, {"time": 641, "text": "And that's a cap with COVID as well."}, {"time": 642, "text": "I mean, it was, it went up and then it sort of, you know, at some point it starts saturating the pool of people to be infected."}, {"time": 649, "text": "There's a standard epidemiological model that's based on that."}, {"time": 652, "text": "And it's beginning to happen with Moore's law or different generations of computer power."}, {"time": 656, "text": "It happens with all exponential curves."}, {"time": 659, "text": "The remarkable thing is you elude, the second part of your question is that we've been able to come up with a new S curve on top of the previous one and do that generation after generation with new materials, new processes, and just extend it further and further."}, {"time": 675, "text": "I don't think anyone has a really good theory about why we've been so successful in doing that."}, {"time": 681, "text": "It's great that we have been, and I hope it continues for some time, but it's, you know, one beginning of a theory is that there's huge incentives when other parts of the system are going on that clock speed of doubling every two to three years."}, {"time": 699, "text": "If there's one component of it that's not keeping up, then the economic incentives become really large to improve that one part."}, {"time": 706, "text": "It becomes a bottleneck and anyone who can do improvements in that part can reap huge returns so that the resources automatically get focused on whatever part of the system isn't keeping up."}, {"time": 716, "text": "Do you think some version of the Moore's law will continue?"}, {"time": 719, "text": "Some version, yes, it is."}, {"time": 721, "text": "I mean, one version that has become more important is something I call Coomey's law, which is named after John Coomey, who I should mention was also my college roommate, but he identified the fact that energy consumption has been declining by a factor of two."}, {"time": 737, "text": "And for most of us, that's more important."}, {"time": 738, "text": "The new iPhones came out today as we're recording this."}, {"time": 741, "text": "I'm not sure when you're gonna make it available."}, {"time": 743, "text": "Very soon after this, yeah."}, {"time": 744, "text": "And for most of us, having the iPhone be twice as fast, it's nice, but having the battery lifelonger, that would be much more valuable."}, {"time": 755, "text": "And the fact that a lot of the progress in chips now is reducing energy consumption is probably more important for many applications than just the raw speed."}, {"time": 766, "text": "Other dimensions of Moore's law are in AI and machine learning."}, {"time": 771, "text": "Those tend to be very parallelizable functions, especially deep neural nets."}, {"time": 778, "text": "And so instead of having one chip, you can have multiple chips or you can have a GPU, graphic processing unit that goes faster."}, {"time": 787, "text": "Now, special chips designed for machine learning like tensor processing units, each time you switch, there's another 10X or 100X improvement above and beyond Moore's law."}, {"time": 796, "text": "So I think that the raw silicon isn't improving as much as it used to, but these other dimensions are becoming important, more important, and we're seeing progress in them."}, {"time": 806, "text": "I don't know if you've seen the work by OpenAI where they show the exponential improvement of the training of neural networks just literally in the techniques used."}, {"time": 816, "text": "So that's almost like the algorithm."}, {"time": 820, "text": "It's fascinating to think like, can I actually continue?"}, {"time": 823, "text": "I was figuring out more and more tricks on how to train networks faster and faster."}, {"time": 827, "text": "The progress has been staggering."}, {"time": 829, "text": "If you look at image recognition, as you mentioned, I think it's a function of at least three things that are coming together."}, {"time": 834, "text": "One, we just talked about faster chips, not just Moore's law, but GPUs, TPUs and other technologies."}, {"time": 840, "text": "The second is just a lot more data."}, {"time": 842, "text": "I mean, we are awash in digital data today in a way we weren't 20 years ago."}, {"time": 848, "text": "Photography, I'm old enough to remember, it used to be chemical, and now everything is digital."}, {"time": 852, "text": "I took probably 50 digital photos yesterday."}, {"time": 856, "text": "I wouldn't have done that if it was chemical."}, {"time": 857, "text": "And we have the internet of things and all sorts of other types of data."}, {"time": 862, "text": "When we walk around with our phone, it's just broadcasting a huge amounts of digital data that can be used as training sets."}, {"time": 869, "text": "And then last but not least, as they mentioned at OpenAI, there've been significant improvements in the techniques."}, {"time": 877, "text": "The core idea of deep neural nets has been around for a few decades, but the advances in making it work more efficiently have also improved a couple of orders of magnitude or more."}, {"time": 888, "text": "So you multiply together, a hundred fold improvement in computer power, a hundred fold or more improvement in data, a hundred fold improvement in techniques of software and algorithms, and soon you're getting into a million fold improvements."}, {"time": 903, "text": "So somebody brought this up, this idea with GPT3 that, so it's trained in a self supervised way on basically internet data."}, {"time": 915, "text": "And that's one of the, I've seen arguments made and they seem to be pretty convincing that the bottleneck there is going to be how much data there is on the internet, which is a fascinating idea that it literally will just run out of human generated data to train on."}, {"time": 933, "text": "Right, I know we make it to the point where it's consumed basically all of human knowledge or all digitized human knowledge, yeah."}, {"time": 939, "text": "And that will be the bottleneck."}, {"time": 940, "text": "But the interesting thing with bottlenecks is people often use bottlenecks as a way to argue against exponential growth."}, {"time": 949, "text": "They say, well, there's no way you can overcome this bottleneck, but we seem to somehow keep coming up in new ways to like overcome whatever bottlenecks the critics come up with, which is fascinating."}, {"time": 961, "text": "I don't know how you overcome the data bottleneck, but probably more efficient training algorithms."}, {"time": 967, "text": "Yeah, well, you already mentioned that, that these training algorithms are getting much better at using smaller amounts of data."}, {"time": 972, "text": "We also are just capturing a lot more data than we used to, especially in China, but all around us."}, {"time": 978, "text": "So those are both important."}, {"time": 980, "text": "In some applications, you can simulate the data, video games, some of the self driving car systems are simulating driving, and of course, that has some risks and weaknesses, but you can also, if you want to exhaust all the different ways you could beat a video game, you could just simulate all the options."}, {"time": 1002, "text": "Can we take a step in that direction of autonomous vehicles?"}, {"time": 1004, "text": "Next, you're talking to the CTO of Waymo tomorrow."}, {"time": 1008, "text": "And obviously, I'm talking to Elon again in a couple of weeks."}, {"time": 1013, "text": "What's your thoughts on autonomous vehicles?"}, {"time": 1017, "text": "Like where do we stand as a problem that has the potential of revolutionizing the world?"}, {"time": 1024, "text": "Well, I'm really excited about that, but it's become much clearer that the original way that I thought about it, most people thought about like, you know, will we have a self driving car or not is way too simple."}, {"time": 1035, "text": "The better way to think about it is that there's a whole continuum of how much driving and assisting the car can do."}, {"time": 1042, "text": "I noticed that you're right next door to the Toyota Research Institute."}, {"time": 1045, "text": "That is a total accident."}, {"time": 1047, "text": "I love the TRI folks, but yeah."}, {"time": 1049, "text": "Have you talked to Gil Pratt?"}, {"time": 1050, "text": "Yeah, we're supposed to talk."}, {"time": 1054, "text": "It's kind of hilarious."}, {"time": 1054, "text": "So there's kind of the, I think it's a good counterpart to say what Elon is doing."}, {"time": 1058, "text": "And hopefully they can be frank in what they think about each other, because I've heard both of them talk about it."}, {"time": 1063, "text": "But they're much more, you know, this is an assistive, a guardian angel that watches over you as opposed to try to do everything."}, {"time": 1070, "text": "I think there's some things like driving on a highway, you know, from LA to Phoenix, where it's mostly good weather, straight roads."}, {"time": 1078, "text": "That's close to a solved problem, let's face it."}, {"time": 1081, "text": "In other situations, you know, driving through the snow in Boston where the roads are kind of crazy."}, {"time": 1086, "text": "And most importantly, you have to make a lot of judgments about what the other driver is gonna do at these intersections that aren't really right angles and aren't very well described."}, {"time": 1093, "text": "It's more like game theory."}, {"time": 1095, "text": "That's a much harder problem and requires understanding human motivations."}, {"time": 1102, "text": "So there's a continuum there of some places where the cars will work very well and others where it could probably take decades."}, {"time": 1110, "text": "What do you think about the Waymo?"}, {"time": 1113, "text": "So you mentioned two companies that actually have cars on the road."}, {"time": 1118, "text": "There's the Waymo approach that it's more like we're not going to release anything until it's perfect and we're gonna be very strict about the streets that we travel on, but it better be perfect."}, {"time": 1130, "text": "Well, I'm smart enough to be humble and not try to get between."}, {"time": 1135, "text": "I know there's very bright people on both sides of the argument."}, {"time": 1137, "text": "I've talked to them and they make convincing arguments to me about how careful they need to be and the social acceptance."}, {"time": 1144, "text": "Some people thought that when the first few people died from self driving cars, that would shut down the industry, but it was more of a blip actually."}, {"time": 1151, "text": "And, you know, so that was interesting."}, {"time": 1154, "text": "Of course, there's still a concern that if there could be setbacks, if we do this wrong, you know, your listeners may be familiar with the different levels of self driving, you know, level one, two, three, four, five."}, {"time": 1166, "text": "I think Andrew Ng has convinced me that this idea of really focusing on level four, where you only go in areas that are well mapped rather than just going out in the wild is the way things are gonna evolve."}, {"time": 1179, "text": "But you can just keep expanding those areas where you've mapped things really well, where you really understand them and eventually all become kind of interconnected."}, {"time": 1187, "text": "And that could be a kind of another way of progressing to make it more feasible over time."}, {"time": 1195, "text": "I mean, that's kind of like the Waymo approach, which is they just now released, I think just like a day or two ago, a public, like anyone from the public in the Phoenix, Arizona to, you know, you can get a ride in a Waymo car with no person, no driver."}, {"time": 1216, "text": "Oh, they've taken away the safety driver?"}, {"time": 1217, "text": "Oh yeah, for a while now there's been no safety driver."}, {"time": 1221, "text": "Okay, because I mean, I've been following that one in particular, but I thought it was kind of funny about a year ago when they had the safety driver and then they added a second safety driver because the first safety driver would fall asleep."}, {"time": 1230, "text": "It's like, I'm not sure they're going in the right direction with that."}, {"time": 1233, "text": "No, they've Waymo in particular done a really good job of that."}, {"time": 1239, "text": "They actually have a very interesting infrastructure of remote like observation."}, {"time": 1247, "text": "So they're not controlling the vehicles remotely, but they're able to, it's like a customer service."}, {"time": 1252, "text": "They can anytime tune into the car."}, {"time": 1255, "text": "I bet they can probably remotely control it as well, but that's officially not the function that they use."}, {"time": 1260, "text": "Yeah, I can see that being really, because I think the thing that's proven harder than maybe some of the early people expected was there's a long tail of weird exceptions."}, {"time": 1270, "text": "So you can deal with 90, 99, 99.99% of the cases, but then there's something that just never been seen before in the training data."}, {"time": 1278, "text": "And humans more or less can work around that."}, {"time": 1281, "text": "Although let me be clear and note, there are about 30,000 human fatalities just in the United States and maybe a million worldwide."}, {"time": 1288, "text": "So they're far from perfect."}, {"time": 1290, "text": "But I think people have higher expectations of machines."}, {"time": 1293, "text": "They wouldn't tolerate that level of death and damage from a machine."}, {"time": 1300, "text": "And so we have to do a lot better at dealing with those edge cases."}, {"time": 1303, "text": "And also the tricky thing that if I have a criticism for the Waymo folks, there's such a huge focus on safety where people don't talk enough about creating products that people, that customers love, that human beings love using."}, {"time": 1320, "text": "It's very easy to create a thing that's safe at the extremes, but then nobody wants to get into it."}, {"time": 1326, "text": "Yeah, well, back to Elon, I think one of, part of his genius was with the electric cars."}, {"time": 1331, "text": "Before he came along, electric cars were all kind of underpowered, really light, and there were sort of wimpy cars that weren't fun."}, {"time": 1340, "text": "And the first thing he did was he made a roadster that went zero to 60 faster than just about any other car and went the other end."}, {"time": 1348, "text": "And I think that was a really wise marketing move as well as a wise technology move."}, {"time": 1353, "text": "Yeah, it's difficult to figure out what the right marketing move is for AI systems."}, {"time": 1357, "text": "That's always been, I think it requires guts and risk taking which is what Elon practices."}, {"time": 1366, "text": "I mean, to the chagrin of perhaps investors or whatever, but it also requires rethinking what you're doing."}, {"time": 1374, "text": "I think way too many people are unimaginative, intellectually lazy, and when they take AI, they basically say, what are we doing now?"}, {"time": 1381, "text": "How can we make a machine do the same thing?"}, {"time": 1384, "text": "Maybe we'll save some costs, we'll have less labor."}, {"time": 1386, "text": "And yeah, it's not necessarily the worst thing in the world to do, but it's really not leading to a quantum change in the way you do things."}, {"time": 1392, "text": "When Jeff Bezos said, hey, we're gonna use the internet to change how bookstores work and we're gonna use technology, he didn't go and say, okay, let's put a robot cashier where the human cashier is and leave everything else alone."}, {"time": 1405, "text": "That would have been a very lame way to automate a bookstore."}, {"time": 1408, "text": "He's like went from soup to nuts and let's just rethink it."}, {"time": 1411, "text": "We get rid of the physical bookstore."}, {"time": 1413, "text": "We have a warehouse, we have delivery, we have people order on a screen and everything was reinvented."}, {"time": 1418, "text": "And that's been the story of these general purpose technologies all through history."}, {"time": 1423, "text": "And in my books, I write about like electricity and how for 30 years, there was almost no productivity gain from the electrification of factories a century ago."}, {"time": 1433, "text": "Now it's not because electricity is a wimpy useless technology."}, {"time": 1435, "text": "We all know how awesome electricity is."}, {"time": 1437, "text": "It's cause at first, they really didn't rethink the factories."}, {"time": 1440, "text": "It was only after they reinvented them and we describe how in the book, then you suddenly got a doubling and tripling of productivity growth."}, {"time": 1447, "text": "But it's the combination of the technology with the new business models, new business organization."}, {"time": 1452, "text": "That just takes a long time and it takes more creativity than most people have."}, {"time": 1456, "text": "Can you maybe linger on electricity?"}, {"time": 1459, "text": "Cause that's a fun one."}, {"time": 1460, "text": "Yeah, well, sure, I'll tell you what happened."}, {"time": 1462, "text": "Before electricity, there were basically steam engines or sometimes water wheels and to power the machinery, you had to have pulleys and crankshafts and you really can't make them too long cause they'll break the torsion."}, {"time": 1474, "text": "So all the equipment was kind of clustered around this one giant steam engine."}, {"time": 1477, "text": "You can't make small steam engines either cause of thermodynamics."}, {"time": 1480, "text": "So you have one giant steam engine, all the equipment clustered around it, multi story."}, {"time": 1484, "text": "They have it vertical to minimize the distance as well as horizontal."}, {"time": 1487, "text": "And then when they did electricity, they took out the steam engine."}, {"time": 1490, "text": "They got the biggest electric motor they could buy from General Electric or someone like that."}, {"time": 1494, "text": "And nothing much else changed."}, {"time": 1497, "text": "It took until a generation of managers retired or died three years later, that people started thinking, wait, we don't have to do it that way."}, {"time": 1505, "text": "You can make electric motors, big, small, medium."}, {"time": 1509, "text": "You can put one with each piece of equipment."}, {"time": 1511, "text": "There's this big debate if you read the management literature between what they call a group drive versus unit drive where every machine would have its own motor."}, {"time": 1518, "text": "Well, once they did that, once they went to unit drive, those guys won the debate."}, {"time": 1523, "text": "Then you started having a new kind of factory which is sometimes spread out over acres, single story and each piece of equipment has its own motor."}, {"time": 1531, "text": "And most importantly, they weren't laid out based on who needed the most power."}, {"time": 1535, "text": "They were laid out based on what is the workflow of materials?"}, {"time": 1540, "text": "Assembly line, let's have it go from this machine to that machine, to that machine."}, {"time": 1543, "text": "Once they rethought the factory that way, huge increases in productivity."}, {"time": 1547, "text": "It was just staggering."}, {"time": 1548, "text": "People like Paul David have documented this in their research papers."}, {"time": 1551, "text": "And I think that that is a lesson you see over and over."}, {"time": 1555, "text": "It happened when the steam engine changed manual production."}, {"time": 1558, "text": "It's happened with the computerization."}, {"time": 1560, "text": "People like Michael Hammer said, don't automate, obliterate."}, {"time": 1563, "text": "In each case, the big gains only came once smart entrepreneurs and managers basically reinvented their industries."}, {"time": 1573, "text": "I mean, one other interesting point about all that is that during that reinvention period, you often actually not only don't see productivity growth, you can actually see a slipping back."}, {"time": 1584, "text": "Measured productivity actually falls."}, {"time": 1586, "text": "I just wrote a paper with Chad Severson and Daniel Rock called the productivity J curve, which basically shows that in a lot of these cases, you have a downward dip before it goes up."}, {"time": 1596, "text": "And that downward dip is when everyone's trying to like reinvent things."}, {"time": 1600, "text": "And you could say that they're creating knowledge and intangible assets, but that doesn't show up on anyone's balance sheet."}, {"time": 1606, "text": "It doesn't show up in GDP."}, {"time": 1608, "text": "So it's as if they're doing nothing."}, {"time": 1610, "text": "Like take self driving cars, we were just talking about it."}, {"time": 1612, "text": "There have been hundreds of billions of dollars spent developing self driving cars."}, {"time": 1617, "text": "And basically no chauffeur has lost his job, no taxi driver."}, {"time": 1622, "text": "I guess I got to check out the ones that."}, {"time": 1623, "text": "It's a big J curve."}, {"time": 1624, "text": "Yeah, so there's a bunch of spending and no real consumer benefit."}, {"time": 1628, "text": "Now they're doing that in the belief, I think the justified belief that they will get the upward part of the J curve and there will be some big returns, but in the short run, you're not seeing it."}, {"time": 1639, "text": "That's happening with a lot of other AI technologies, just as it happened with earlier general purpose technologies."}, {"time": 1645, "text": "And it's one of the reasons we're having relatively low productivity growth lately."}, {"time": 1649, "text": "As an economist, one of the things that disappoints me is that as eye popping as these technologies are, you and I are both excited about some of the things they can do."}, {"time": 1656, "text": "The economic productivity statistics are kind of dismal."}, {"time": 1660, "text": "We actually, believe it or not, have had lower productivity growth in the past about 15 years than we did in the previous 15 years, in the 90s and early 2000s."}, {"time": 1671, "text": "And so that's not what you would have expected if these technologies were that much better."}, {"time": 1675, "text": "But I think we're in kind of a long J curve there."}, {"time": 1679, "text": "Personally, I'm optimistic."}, {"time": 1680, "text": "We'll start seeing the upward tick, maybe as soon as next year."}, {"time": 1684, "text": "But the past decade has been a bit disappointing if you thought there's a one to one relationship between cool technology and higher productivity."}, {"time": 1692, "text": "Well, what would you place your biggest hope for productivity increases on?"}, {"time": 1697, "text": "Because you kind of said at a high level AI, but if I were to think about what has been so revolutionary in the last 10 years, I would 15 years and thinking about the internet, I would say things like, hopefully I'm not saying anything ridiculous, but everything from Wikipedia to Twitter."}, {"time": 1721, "text": "So like these kind of websites, not so much AI, but like I would expect to see some kind of big productivity increases from just the connectivity between people and the access to more information."}, {"time": 1738, "text": "Yeah, well, so that's another area I've done quite a bit of research on actually, is these free goods like Wikipedia, Facebook, Twitter, Zoom."}, {"time": 1746, "text": "We're actually doing this in person, but almost everything else I do these days is online."}, {"time": 1752, "text": "The interesting thing about all those is most of them have a price of zero."}, {"time": 1758, "text": "What do you pay for Wikipedia?"}, {"time": 1759, "text": "Maybe like a little bit for the electrons to come to your house."}, {"time": 1762, "text": "Basically zero, right?"}, {"time": 1765, "text": "Take a small pause and say, I donate to Wikipedia."}, {"time": 1768, "text": "Often you should too."}, {"time": 1768, "text": "It's good for you, yeah."}, {"time": 1770, "text": "So, but what does that do mean for GDP?"}, {"time": 1772, "text": "GDP is based on the price and quantity of all the goods, things bought and sold."}, {"time": 1777, "text": "If something has zero price, you know how much it contributes to GDP?"}, {"time": 1782, "text": "To a first approximation, zero."}, {"time": 1784, "text": "So these digital goods that we're getting more and more of, we're spending more and more hours a day consuming stuff off of screens, little screens, big screens, that doesn't get priced into GDP."}, {"time": 1796, "text": "It's like they don't exist."}, {"time": 1798, "text": "That doesn't mean they don't create value."}, {"time": 1800, "text": "I get a lot of value from watching cat videos and reading Wikipedia articles and listening to podcasts, even if I don't pay for them."}, {"time": 1808, "text": "So we've got a mismatch there."}, {"time": 1810, "text": "Now, in fairness, economists, since Simon Kuznets invented GDP and productivity, all those statistics back in the 1930s, he recognized, he in fact said, this is not a measure of wellbeing."}, {"time": 1821, "text": "This is not a measure of welfare."}, {"time": 1823, "text": "It's a measure of production."}, {"time": 1825, "text": "But almost everybody has kind of forgotten that he said that and they just use it."}, {"time": 1831, "text": "It's like, how well off are we?"}, {"time": 1832, "text": "What was GDP last year?"}, {"time": 1833, "text": "It was 2.3% growth or whatever."}, {"time": 1835, "text": "That is how much physical production, but it's not the value we're getting."}, {"time": 1842, "text": "We need a new set of statistics and I'm working with some colleagues."}, {"time": 1845, "text": "Avi Collis and others to develop something we call GDP dash B. GDP B measures the benefits you get, not the cost."}, {"time": 1855, "text": "If you get benefit from Zoom or Wikipedia or Facebook, then that gets counted in GDP B, even if you pay zero for it."}, {"time": 1864, "text": "So, you know, back to your original point, I think there is a lot of gain over the past decade in these digital goods that doesn't show up in GDP, doesn't show up in productivity."}, {"time": 1876, "text": "By the way, productivity is just defined as GDP divided by hours worked."}, {"time": 1880, "text": "So if you mismeasure GDP, you mismeasure productivity by the exact same amount."}, {"time": 1885, "text": "That's something we need to fix."}, {"time": 1886, "text": "I'm working with the statistical agencies to come up with a new set of metrics."}, {"time": 1890, "text": "And, you know, over the coming years, I think we'll see, we're not gonna do away with GDP."}, {"time": 1894, "text": "It's very useful, but we'll see a parallel set of accounts that measure the benefits."}, {"time": 1898, "text": "How difficult is it to get that B in the GDP B?"}, {"time": 1901, "text": "It's pretty hard."}, {"time": 1901, "text": "I mean, one of the reasons it hasn't been done before is that, you know, you can measure it, the cash register, what people pay for stuff, but how do you measure what they would have paid, like what the value is?"}, {"time": 1912, "text": "That's a lot harder, you know?"}, {"time": 1914, "text": "How much is Wikipedia worth to you?"}, {"time": 1916, "text": "That's what we have to answer."}, {"time": 1917, "text": "And to do that, what we do is we can use online experiments."}, {"time": 1920, "text": "We do massive online choice experiments."}, {"time": 1923, "text": "We ask hundreds of thousands, now millions of people to do lots of sort of A, B tests."}, {"time": 1927, "text": "How much would I have to pay you to give up Wikipedia for a month?"}, {"time": 1930, "text": "How much would I have to pay you to stop using your phone?"}, {"time": 1934, "text": "And in some cases, it's hypothetical."}, {"time": 1935, "text": "In other cases, we actually enforce it, which is kind of expensive."}, {"time": 1938, "text": "Like we pay somebody $30 to stop using Facebook and we see if they'll do it."}, {"time": 1943, "text": "And some people will give it up for $10."}, {"time": 1946, "text": "Some people won't give it up even if you give them $100."}, {"time": 1948, "text": "And then you get a whole demand curve."}, {"time": 1951, "text": "You get to see what all the different prices are and how much value different people get."}, {"time": 1956, "text": "And not surprisingly, different people have different values."}, {"time": 1958, "text": "We find that women tend to value Facebook more than men."}, {"time": 1961, "text": "Old people tend to value it a little bit more than young people."}, {"time": 1964, "text": "That was interesting."}, {"time": 1964, "text": "I think young people maybe know about other networks that I don't know the name of that are better than Facebook."}, {"time": 1970, "text": "And so you get to see these patterns, but every person's individual."}, {"time": 1975, "text": "And then if you add up all those numbers, you start getting an estimate of the value."}, {"time": 1980, "text": "Okay, first of all, that's brilliant."}, {"time": 1981, "text": "Is this a work that will soon eventually be published?"}, {"time": 1985, "text": "Yeah, well, there's a version of it in the Proceedings of the National Academy of Sciences about I think we call it massive online choice experiments."}, {"time": 1991, "text": "I should remember the title, but it's on my website."}, {"time": 1994, "text": "So yeah, we have some more papers coming out on it, but the first one is already out."}, {"time": 2000, "text": "You know, it's kind of a fascinating mystery that Twitter, Facebook, like all these social networks are free."}, {"time": 2006, "text": "And it seems like almost none of them except for YouTube have experimented with removing ads for money."}, {"time": 2015, "text": "Can you like, do you understand that from both economics and the product perspective?"}, {"time": 2019, "text": "Yeah, it's something that, you know, so I teach a course on digital business models."}, {"time": 2023, "text": "So I used to at MIT, at Stanford, I'm not quite sure."}, {"time": 2025, "text": "I'm not teaching until next spring."}, {"time": 2027, "text": "I'm still thinking what my course is gonna be."}, {"time": 2030, "text": "But there are a lot of different business models."}, {"time": 2032, "text": "And when you have something that has zero marginal cost, there's a lot of forces, especially if there's any kind of competition that push prices down to zero."}, {"time": 2039, "text": "But you can have ad supported systems, you can bundle things together."}, {"time": 2045, "text": "You can have volunteer, you mentioned Wikipedia, there's donations."}, {"time": 2048, "text": "And I think economists underestimate the power of volunteerism and donations."}, {"time": 2054, "text": "Your national public radio."}, {"time": 2056, "text": "Actually, how do you, this podcast, how is this, what's the revenue model?"}, {"time": 2059, "text": "There's sponsors at the beginning."}, {"time": 2062, "text": "And then, and people, the funny thing is, I tell people they can, it's very, I tell them the timestamp."}, {"time": 2067, "text": "So if you wanna skip the sponsors, you're free."}, {"time": 2070, "text": "But it's funny that a bunch of people, so I read the advertisement and then a bunch of people enjoy reading it."}, {"time": 2079, "text": "Well, they may learn something from it."}, {"time": 2080, "text": "And also from the advertiser's perspective, those are people who are actually interested."}, {"time": 2085, "text": "I mean, the example I sometimes get is like, I bought a car recently and all of a sudden, all the car ads were like interesting to me."}, {"time": 2093, "text": "And then like, now that I have the car, like I sort of zone out on, but that's fine."}, {"time": 2096, "text": "The car companies, they don't really wanna be advertising to me if I'm not gonna buy their product."}, {"time": 2101, "text": "So there are a lot of these different revenue models and it's a little complicated, but the economic theory has to do with what the shape of the demand curve is, when it's better to monetize it with charging people versus when you're better off doing advertising."}, {"time": 2115, "text": "I mean, in short, when the demand curve is relatively flat and wide, like generic news and things like that, then you tend to do better with advertising."}, {"time": 2125, "text": "If it's a good that's only useful to a small number of people, but they're willing to pay a lot, they have a very high value for it, then advertising isn't gonna work as well and you're better off charging for it."}, {"time": 2136, "text": "Both of them have some inefficiencies."}, {"time": 2138, "text": "And then when you get into targeting and you get into these other revenue models, it gets more complicated, but there's some economic theory on it."}, {"time": 2145, "text": "I also think to be frank, there's just a lot of experimentation that's needed because sometimes things are a little counterintuitive, especially when you get into what are called two sided networks or platform effects, where you may grow the market on one side and harvest the revenue on the other side."}, {"time": 2164, "text": "Facebook tries to get more and more users and then they harvest the revenue from advertising."}, {"time": 2168, "text": "So that's another way of kind of thinking about it."}, {"time": 2172, "text": "Is it strange to you that they haven't experimented?"}, {"time": 2174, "text": "Well, they are experimenting."}, {"time": 2175, "text": "So they are doing some experiments about what the willingness is for people to pay."}, {"time": 2182, "text": "I think that when they do the math, it's gonna work out that they still are better off with an advertising driven model, but... What about a mix?"}, {"time": 2190, "text": "Like this is what YouTube is, right?"}, {"time": 2192, "text": "It's you allow the person to decide, the customer to decide exactly which model they prefer."}, {"time": 2199, "text": "No, that can work really well."}, {"time": 2200, "text": "And newspapers, of course, have known this for a long time."}, {"time": 2202, "text": "The Wall Street Journal, the New York Times, they have subscription revenue."}, {"time": 2205, "text": "They also have advertising revenue."}, {"time": 2208, "text": "And that can definitely work."}, {"time": 2212, "text": "Online, it's a lot easier to have a dial that's much more personalized and everybody can kind of roll their own mix."}, {"time": 2217, "text": "And I could imagine having a little slider about how much advertising you want or are willing to take."}, {"time": 2225, "text": "And if it's done right and it's incentive compatible, it could be a win win where both the content provider and the consumer are better off than they would have been before."}, {"time": 2234, "text": "Yeah, the done right part is a really good point."}, {"time": 2237, "text": "Like with the Jeff Bezos and the single click purchase on Amazon, the frictionless effort there, if I could just rant for a second about the Wall Street Journal, all the newspapers you mentioned, is I have to click so many times to subscribe to them that I literally don't subscribe just because of the number of times I have to click."}, {"time": 2259, "text": "I'm totally with you."}, {"time": 2260, "text": "I don't understand why so many companies make it so hard."}, {"time": 2264, "text": "I mean, another example is when you buy a new iPhone or a new computer, whatever, I feel like, okay, I'm gonna lose an afternoon just like loading up and getting all my stuff back."}, {"time": 2273, "text": "And for a lot of us, that's more of a deterrent than the price."}, {"time": 2278, "text": "And if they could make it painless, we'd give them a lot more money."}, {"time": 2283, "text": "So I'm hoping somebody listening is working on making it more painless for us to buy your products."}, {"time": 2290, "text": "If we could just like linger a little bit on the social network thing, because there's this Netflix social dilemma."}, {"time": 2298, "text": "Yeah, no, I saw that."}, {"time": 2299, "text": "And Tristan Harris and company, yeah."}, {"time": 2304, "text": "And people's data, it's really sensitive and social networks are at the core arguably of many of societal like tension and some of the most important things happening in society."}, {"time": 2319, "text": "So it feels like it's important to get this right, both from a business model perspective and just like a trust perspective."}, {"time": 2326, "text": "I still gotta, I mean, it just still feels like, I know there's experimentation going on."}, {"time": 2332, "text": "It still feels like everyone is afraid to try different business models, like really try."}, {"time": 2337, "text": "Well, I'm worried that people are afraid to try different business models."}, {"time": 2341, "text": "I'm also worried that some of the business models may lead them to bad choices."}, {"time": 2346, "text": "And Danny Kahneman talks about system one and system two, sort of like a reptilian brain that reacts quickly to what we see, see something interesting, we click on it, we retweet it versus our system two, our frontal cortex that's supposed to be more careful and rational that really doesn't make as many decisions as it should."}, {"time": 2368, "text": "I think there's a tendency for a lot of these social networks to really exploit system one, our quick instant reaction, make it so we just click on stuff and pass it on and not really think carefully about it."}, {"time": 2382, "text": "And that system, it tends to be driven by sex, violence, disgust, anger, fear, these relatively primitive kinds of emotions."}, {"time": 2393, "text": "Maybe they're important for a lot of purposes, but they're not a great way to organize a society."}, {"time": 2398, "text": "And most importantly, when you think about this huge, amazing information infrastructure we've had that's connected billions of brains across the globe, not just so we can all access information, but we can all contribute to it and share it."}, {"time": 2412, "text": "Arguably the most important thing that that network should do is favor truth over falsehoods."}, {"time": 2419, "text": "And the way it's been designed, not necessarily intentionally, is exactly the opposite."}, {"time": 2424, "text": "My MIT colleagues are all, and Deb Roy and others at MIT, did a terrific paper in the cover of Science."}, {"time": 2431, "text": "And they documented what we all feared, which is that lies spread faster than truth on social networks."}, {"time": 2439, "text": "They looked at a bunch of tweets and retweets, and they found that false information was more likely to spread further, faster, to more people."}, {"time": 2448, "text": "And why was that?"}, {"time": 2449, "text": "It's not because people like lies."}, {"time": 2453, "text": "It's because people like things that are shocking, amazing, can you believe this?"}, {"time": 2457, "text": "Something that is not mundane, not something that everybody else already knew."}, {"time": 2462, "text": "And what are the most unbelievable things?"}, {"time": 2465, "text": "Well, lies."}, {"time": 2467, "text": "And so if you wanna find something unbelievable, it's a lot easier to do that if you're not constrained by the truth."}, {"time": 2472, "text": "So they found that the emotional valence of false information was just much higher."}, {"time": 2477, "text": "It was more likely to be shocking, and therefore more likely to be spread."}, {"time": 2482, "text": "Another interesting thing was that that wasn't necessarily driven by the algorithms."}, {"time": 2487, "text": "I know that there is some evidence, Zeynep Tufekci and others have pointed out on YouTube, some of the algorithms unintentionally were tuned to amplify more extremist content."}, {"time": 2497, "text": "But in the study of Twitter that Sinan and Deb and others did, they found that even if you took out all the bots and all the automated tweets, you still had lies spreading significantly faster."}, {"time": 2510, "text": "It's just the problems with ourselves that we just can't resist passing on the salacious content."}, {"time": 2518, "text": "But I also blame the platforms because there's different ways you can design a platform."}, {"time": 2523, "text": "You can design a platform in a way that makes it easy to spread lies and to retweet and spread things on, or you can kind of put some friction on that and try to favor truth."}, {"time": 2533, "text": "I had dinner with Jimmy Wales once, the guy who helped found Wikipedia."}, {"time": 2539, "text": "And he convinced me that, look, you can make some design choices, whether it's at Facebook, at Twitter, at Wikipedia, or Reddit, whatever, and depending on how you make those choices, you're more likely or less likely to have false news."}, {"time": 2555, "text": "Create a little bit of friction, like you said."}, {"time": 2558, "text": "You know, that's the, and so if I'm..."}, {"time": 2559, "text": "It could be friction, it could be speeding the truth, either way, but, and I don't totally understand..."}, {"time": 2564, "text": "Speeding the truth, I love it."}, {"time": 2567, "text": "Amplifying it and giving it more credit."}, {"time": 2568, "text": "And in academia, which is far, far from perfect, but when someone has an important discovery, it tends to get more cited and people kind of look to it more and sort of, it tends to get amplified a little bit."}, {"time": 2580, "text": "So you could try to do that too."}, {"time": 2583, "text": "I don't know what the silver bullet is, but the meta point is that if we spend time thinking about it, we can amplify truth over falsehoods."}, {"time": 2590, "text": "And I'm disappointed in the heads of these social networks that they haven't been as successful or maybe haven't tried as hard to amplify truth."}, {"time": 2599, "text": "And part of it, going back to what we said earlier, is these revenue models may push them more towards growing fast, spreading information rapidly, getting lots of users, which isn't the same thing as finding truth."}, {"time": 2614, "text": "Yeah, I mean, implicit in what you're saying now is a hopeful message that with platforms, we can take a step towards a greater and greater popularity of truth."}, {"time": 2631, "text": "But the more cynical view is that what the last few years have revealed is that there's a lot of money to be made in dismantling even the idea of truth, that nothing is true."}, {"time": 2645, "text": "And as a thought experiment, I've been thinking about if it's possible that our future will have, like the idea of truth is something we won't even have."}, {"time": 2654, "text": "Do you think it's possible in the future that everything is on the table in terms of truth, and we're just swimming in this kind of digital economy where ideas are just little toys that are not at all connected to reality?"}, {"time": 2673, "text": "Yeah, I think that's definitely possible."}, {"time": 2675, "text": "I'm not a technological determinist, so I don't think that's inevitable."}, {"time": 2680, "text": "I don't think it's inevitable that it doesn't happen."}, {"time": 2682, "text": "I mean, the thing that I've come away with every time I do these studies, and I emphasize it in my books and elsewhere, is that technology doesn't shape our destiny, we shape our destiny."}, {"time": 2691, "text": "So just by us having this conversation, I hope that your audience is gonna take it upon themselves as they design their products, and they think about, they use products, as they manage companies, how can they make conscious decisions to favor truth over falsehoods, favor the better kinds of societies, and not abdicate and say, well, we just build the tools."}, {"time": 2713, "text": "I think there was a saying that, was it the German scientist when they were working on the missiles in late World War II?"}, {"time": 2723, "text": "They said, well, our job is to make the missiles go up."}, {"time": 2725, "text": "Where they come down, that's someone else's department."}, {"time": 2728, "text": "And that's obviously not the, I think it's obvious, that's not the right attitude that technologists should have, that engineers should have."}, {"time": 2735, "text": "They should be very conscious about what the implications are."}, {"time": 2738, "text": "And if we think carefully about it, we can avoid the kind of world that you just described, where truth is all relative."}, {"time": 2745, "text": "There are going to be people who benefit from a world of where people don't check facts, and where truth is relative, and popularity or fame or money is orthogonal to truth."}, {"time": 2759, "text": "But one of the reasons I suspect that we've had so much progress over the past few hundred years is the invention of the scientific method, which is a really powerful tool or meta tool for finding truth and favoring things that are true versus things that are false."}, {"time": 2776, "text": "If they don't pass the scientific method, they're less likely to be true."}, {"time": 2780, "text": "And that has, the societies and the people and the organizations that embrace that have done a lot better than the ones who haven't."}, {"time": 2790, "text": "And so I'm hoping that people keep that in mind and continue to try to embrace not just the truth, but methods that lead to the truth."}, {"time": 2797, "text": "So maybe on a more personal question, if one were to try to build a competitor to Twitter, what would you advise?"}, {"time": 2807, "text": "Is there, I mean, the bigger, the meta question, is that the right way to improve systems?"}, {"time": 2815, "text": "Yeah, no, I think that the underlying premise behind Twitter and all these networks is amazing, that we can communicate with each other."}, {"time": 2822, "text": "And I use it a lot."}, {"time": 2824, "text": "There's a subpart of Twitter called Econ Twitter, where we economists tweet to each other and talk about new papers."}, {"time": 2830, "text": "Something came out in the NBER, the National Bureau of Economic Research, and we share about it."}, {"time": 2834, "text": "People critique it."}, {"time": 2835, "text": "I think it's been a godsend because it's really sped up the scientific process, if you can call economic scientific."}, {"time": 2841, "text": "Does it get divisive in that little?"}, {"time": 2843, "text": "Sometimes, yeah, sure."}, {"time": 2844, "text": "Sometimes it does."}, {"time": 2845, "text": "It can also be done in nasty ways and there's the bad parts."}, {"time": 2848, "text": "But the good parts are great because you just speed up that clock speed of learning about things."}, {"time": 2853, "text": "Instead of like in the old, old days, waiting to read it in a journal, or the not so old days when you'd see it posted on a website and you'd read it."}, {"time": 2861, "text": "Now on Twitter, people will distill it down and it's a real art to getting to the essence of things."}, {"time": 2867, "text": "So that's been great."}, {"time": 2869, "text": "But it certainly, we all know that Twitter can be a cesspool of misinformation."}, {"time": 2875, "text": "And like I just said, unfortunately misinformation tends to spread faster on Twitter than truth."}, {"time": 2882, "text": "And there are a lot of people who are very vulnerable to it."}, {"time": 2884, "text": "I'm sure I've been fooled at times."}, {"time": 2886, "text": "There are agents, whether from Russia or from political groups or others that explicitly create efforts at misinformation and efforts at getting people to hate each other."}, {"time": 2897, "text": "Or even more important lately I've discovered is nut picking."}, {"time": 2901, "text": "You know the idea of nut picking?"}, {"time": 2902, "text": "No, what's that?"}, {"time": 2903, "text": "It's a good term."}, {"time": 2904, "text": "Nut picking is when you find like an extreme nut case on the other side and then you amplify them and make it seem like that's typical of the other side."}, {"time": 2914, "text": "So you're not literally lying."}, {"time": 2915, "text": "You're taking some idiot, you know, renting on the subway or just, you know, whether they're in the KKK or Antifa or whatever, they're just, and you, normally nobody would pay attention to this guy."}, {"time": 2926, "text": "Like 12 people would see him and it'd be the end."}, {"time": 2928, "text": "Instead with video or whatever, you get tens of millions of people say it."}, {"time": 2934, "text": "And I've seen this, you know, I look at it, I'm like, I get angry."}, {"time": 2937, "text": "I'm like, I can't believe that person did something so terrible."}, {"time": 2939, "text": "Let me tell all my friends about this terrible person."}, {"time": 2942, "text": "And it's a great way to generate division."}, {"time": 2946, "text": "I talked to a friend who studied Russian misinformation campaigns, and they're very clever about literally being on both sides of some of these debates."}, {"time": 2955, "text": "They would have some people pretend to be part of BLM."}, {"time": 2958, "text": "Some people pretend to be white nationalists and they would be throwing epithets at each other, saying crazy things at each other."}, {"time": 2965, "text": "And they're literally playing both sides of it, but their goal wasn't for one or the other to win."}, {"time": 2968, "text": "It was for everybody to get behaving and distrusting everyone else."}, {"time": 2972, "text": "So these tools can definitely be used for that."}, {"time": 2974, "text": "And they are being used for that."}, {"time": 2976, "text": "It's been super destructive for our democracy and our society."}, {"time": 2981, "text": "And the people who run these platforms, I think have a social responsibility, a moral and ethical, personal responsibility to do a better job and to shut that stuff down."}, {"time": 2991, "text": "Well, I don't know if you can shut it down, but to design them in a way that, you know, as I said earlier, favors truth over falsehoods and favors positive types of communication versus destructive ones."}, {"time": 3006, "text": "And just like you said, it's also on us."}, {"time": 3009, "text": "I try to be all about love and compassion, empathy on Twitter."}, {"time": 3013, "text": "I mean, one of the things, nut picking is a fascinating term."}, {"time": 3016, "text": "One of the things that people do, that's I think even more dangerous is nut picking applied to individual statements of good people."}, {"time": 3028, "text": "So basically worst case analysis in computer science is taking sometimes out of context, but sometimes in context, a statement, one statement by a person, like I've been, because I've been reading The Rise and Fall of the Third Reich, I often talk about Hitler on this podcast with folks and it is so easy."}, {"time": 3050, "text": "That's really dangerous."}, {"time": 3052, "text": "But I'm all leaning in, I'm 100%."}, {"time": 3054, "text": "Because, well, it's actually a safer place than people realize because it's history and history in long form is actually very fascinating to think about and it's, but I could see how that could be taken totally out of context and it's very worrying."}, {"time": 3071, "text": "You know, these digital infrastructures, not just they disseminate things, but they're sort of permanent."}, {"time": 3074, "text": "So anything you say at some point, someone can go back and find something you said three years ago, perhaps jokingly, perhaps not, maybe you're just wrong and you made them, you know, and like that becomes, they can use that to define you if they have ill intent."}, {"time": 3086, "text": "And we all need to be a little more forgiving."}, {"time": 3089, "text": "I mean, somewhere in my 20s, I told myself, I was going through all my different friends and I was like, you know, every one of them has at least like one nutty opinion."}, {"time": 3099, "text": "And I was like, there's like nobody who's like completely, except me, of course, but I'm sure they thought that about me too."}, {"time": 3105, "text": "And so you just kind of like learned to be a little bit tolerant that like, okay, there's just, you know."}, {"time": 3111, "text": "Yeah, I wonder who the responsibility lays on there."}, {"time": 3115, "text": "Like, I think ultimately it's about leadership."}, {"time": 3119, "text": "Like the previous president, Barack Obama, has been, I think, quite eloquent at walking this very difficult line of talking about cancel culture, but it's a difficult, it takes skill."}, {"time": 3132, "text": "Because you say the wrong thing and you piss off a lot of people."}, {"time": 3135, "text": "And so you have to do it well."}, {"time": 3137, "text": "But then also the platform of the technology is, should slow down, create friction, and spreading this kind of nut picking in all its forms."}, {"time": 3147, "text": "No, and your point that we have to like learn over time, how to manage it."}, {"time": 3150, "text": "I mean, we can't put it all on the platform and say, you guys design it."}, {"time": 3153, "text": "Because if we're idiots about using it, nobody can design a platform that withstands that."}, {"time": 3158, "text": "And every new technology people learn its dangers."}, {"time": 3161, "text": "You know, when someone invented fire, it's great cooking and everything, but then somebody burned themself."}, {"time": 3166, "text": "And then you had to like learn how to like avoid, maybe somebody invented a fire extinguisher later."}, {"time": 3170, "text": "So you kind of like figure out ways of working around these technologies."}, {"time": 3174, "text": "Someone invented seat belts, et cetera."}, {"time": 3177, "text": "And that's certainly true with all the new digital technologies that we have to figure out, not just technologies that protect us, but ways of using them that emphasize that are more likely to be successful than dangerous."}, {"time": 3191, "text": "So you've written quite a bit about how artificial intelligence might change our world."}, {"time": 3199, "text": "How do you think if we look forward, again, it's impossible to predict the future, but if we look at trends from the past and we tried to predict what's gonna happen in the rest of the 21st century, how do you think AI will change our world?"}, {"time": 3214, "text": "You know, I'm mostly a techno optimist."}, {"time": 3217, "text": "I'm not at the extreme, you know, the singularity is near end of the spectrum, but I do think that we're likely in for some significantly improved living standards, some really important progress, even just the technologies that are already kind of like in the can that haven't diffused."}, {"time": 3233, "text": "You know, when I talked earlier about the J curve, it could take 10, 20, 30 years for an existing technology to have the kind of profound effects."}, {"time": 3240, "text": "And when I look at whether it's, you know, vision systems, voice recognition, problem solving systems, even if nothing new got invented, we would have a few decades of progress."}, {"time": 3251, "text": "So I'm excited about that."}, {"time": 3253, "text": "And I think that's gonna lead to us being wealthier, healthier, I mean, the healthcare is probably one of the applications that I'm most excited about."}, {"time": 3262, "text": "So that's good news."}, {"time": 3263, "text": "I don't think we're gonna have the end of work anytime soon."}, {"time": 3266, "text": "There's just too many things that machines still can't do."}, {"time": 3270, "text": "When I look around the world and think of whether it's childcare or healthcare, cleaning the environment, interacting with people, scientific work, artistic creativity, these are things that for now, machines aren't able to do nearly as well as humans, even just something as mundane as, you know, folding laundry or whatever."}, {"time": 3288, "text": "And many of these, I think are gonna be years or decades before machines catch up."}, {"time": 3294, "text": "You know, I may be surprised on some of them, but overall, I think there's plenty of work for humans to do."}, {"time": 3299, "text": "There's plenty of problems in society that need the human touch."}, {"time": 3302, "text": "So we'll have to repurpose."}, {"time": 3304, "text": "We'll have to, as machines are able to do some tasks, people are gonna have to reskill and move into other areas."}, {"time": 3311, "text": "And that's probably what's gonna be going on for the next, you know, 10, 20, 30 years or more, kind of big restructuring of society."}, {"time": 3318, "text": "We'll get wealthier and people will have to do new skills."}, {"time": 3322, "text": "Now, if you turn the dial further, I don't know, 50 or a hundred years into the future, then, you know, maybe all bets are off."}, {"time": 3329, "text": "Then it's possible that machines will be able to do most of what people do."}, {"time": 3334, "text": "You know, say one or 200 years, I think it's even likely."}, {"time": 3337, "text": "And at that point, then we're more in the sort of abundance economy."}, {"time": 3341, "text": "Then we're in a world where there's really little for the humans can do economically better than machines, other than be human."}, {"time": 3349, "text": "And, you know, that will take a transition as well, kind of more of a transition of how we get meaning in life and what our values are."}, {"time": 3358, "text": "But shame on us if we screw that up."}, {"time": 3360, "text": "I mean, that should be like great, great news."}, {"time": 3362, "text": "And it kind of saddens me that some people see that as like a big problem."}, {"time": 3365, "text": "I think that would be, should be wonderful if people have all the health and material things that they need and can focus on loving each other and discussing philosophy and playing and doing all the other things that don't require work."}, {"time": 3379, "text": "Do you think you'd be surprised to see what the 20, if we were to travel in time, 100 years into the future, do you think you'll be able to, like if I gave you a month to like talk to people, no, like let's say a week, would you be able to understand what the hell's going on?"}, {"time": 3397, "text": "You mean if I was there for a week?"}, {"time": 3399, "text": "Yeah, if you were there for a week."}, {"time": 3400, "text": "A hundred years in the future?"}, {"time": 3403, "text": "So like, so I'll give you one thought experiment is like, isn't it possible that we're all living in virtual reality by then?"}, {"time": 3410, "text": "Yeah, no, I think that's very possible."}, {"time": 3412, "text": "I've played around with some of those VR headsets and they're not great, but I mean the average person spends many waking hours staring at screens right now."}, {"time": 3423, "text": "They're kind of low res compared to what they could be in 30 or 50 years, but certainly games and why not any other interactions could be done with VR?"}, {"time": 3435, "text": "And that would be a pretty different world and we'd all, in some ways be as rich as we wanted."}, {"time": 3439, "text": "We could have castles and we could be traveling anywhere we want and it could obviously be multisensory."}, {"time": 3445, "text": "So that would be possible and of course there's people, you've had Elon Musk on and others, there are people, Nick Bostrom makes the simulation argument that maybe we're already there."}, {"time": 3456, "text": "We're already there."}, {"time": 3457, "text": "So, but in general, or do you not even think about in this kind of way, you're self critically thinking, how good are you as an economist at predicting what the future looks like?"}, {"time": 3470, "text": "Do you have a?"}, {"time": 3471, "text": "Well, it starts getting, I mean, I feel reasonably comfortable the next five, 10, 20 years in terms of that path."}, {"time": 3478, "text": "When you start getting truly superhuman artificial intelligence, kind of by definition, be able to think of a lot of things that I couldn't have thought of and create a world that I couldn't even imagine."}, {"time": 3490, "text": "And so I'm not sure I can predict what that world is going to be like."}, {"time": 3496, "text": "One thing that AI researchers, AI safety researchers worry about is what's called the alignment problem."}, {"time": 3502, "text": "When an AI is that powerful, then they can do all sorts of things."}, {"time": 3507, "text": "And you really hope that their values are aligned with our values."}, {"time": 3512, "text": "And it's even tricky to finding what our values are."}, {"time": 3514, "text": "I mean, first off, we all have different values."}, {"time": 3517, "text": "And secondly, maybe if we were smarter, we would have better values."}, {"time": 3521, "text": "Like, I like to think that we have better values than we did in 1860 and, or in the year 200 BC on a lot of dimensions, things that we consider barbaric today."}, {"time": 3533, "text": "And it may be that if I thought about it more deeply, I would also be morally evolved."}, {"time": 3537, "text": "Maybe I'd be a vegetarian or do other things that right now, whether my future self would consider kind of immoral."}, {"time": 3545, "text": "So that's a tricky problem, getting the AI to do what we want, assuming it's even a friendly AI."}, {"time": 3552, "text": "I mean, I should probably mention there's a nontrivial other branch where we destroy ourselves, right?"}, {"time": 3558, "text": "I mean, there's a lot of exponentially improving technologies that could be ferociously destructive, whether it's in nanotechnology or biotech and weaponized viruses, AI and other things that."}, {"time": 3574, "text": "nuclear weapons."}, {"time": 3575, "text": "Nuclear weapons, of course."}, {"time": 3576, "text": "The old school technology."}, {"time": 3577, "text": "Yeah, good old nuclear weapons that could be devastating or even existential and new things yet to be invented."}, {"time": 3585, "text": "So that's a branch that I think is pretty significant."}, {"time": 3592, "text": "And there are those who think that one of the reasons we haven't been contacted by other civilizations, right?"}, {"time": 3597, "text": "Is that once you get to a certain level of complexity in technology, there's just too many ways to go wrong."}, {"time": 3604, "text": "There's a lot of ways to blow yourself up."}, {"time": 3606, "text": "And people, or I should say species, end up falling into one of those traps."}, {"time": 3612, "text": "The great filter."}, {"time": 3614, "text": "I mean, there's an optimistic view of that."}, {"time": 3616, "text": "If there is literally no intelligent life out there in the universe, or at least in our galaxy, that means that we've passed at least one of the great filters or some of the great filters that we survived."}, {"time": 3630, "text": "Yeah, no, I think Robin Hansen has a good way of, maybe others have a good way of thinking about this, that if there are no other intelligence creatures out there that we've been able to detect, one possibility is that there's a filter ahead of us."}, {"time": 3643, "text": "And when you get a little more advanced, maybe in a hundred or a thousand or 10,000 years, things just get destroyed for some reason."}, {"time": 3650, "text": "The other one is the great filters behind us."}, {"time": 3653, "text": "That'll be good, is that most planets don't even evolve life or if they don't evolve life, they don't evolve intelligent life."}, {"time": 3660, "text": "Maybe we've gotten past that."}, {"time": 3662, "text": "And so now maybe we're on the good side of the great filter."}, {"time": 3665, "text": "So if we sort of rewind back and look at the thing where we could say something a little bit more comfortably at five years and 10 years out, you've written about jobs and the impact on sort of our economy and the jobs in terms of artificial intelligence that it might have."}, {"time": 3688, "text": "It's a fascinating question of what kind of jobs are safe, what kind of jobs are not."}, {"time": 3692, "text": "Can you maybe speak to your intuition about how we should think about AI changing the landscape of work?"}, {"time": 3700, "text": "Well, this is a really important question because I think we're very far from artificial general intelligence, which is AI that can just do the full breadth of what humans can do."}, {"time": 3709, "text": "But we do have human level or superhuman level narrow intelligence, narrow artificial intelligence."}, {"time": 3716, "text": "And obviously my calculator can do math a lot better than I can."}, {"time": 3720, "text": "And there's a lot of other things that machines can do better than I can."}, {"time": 3723, "text": "So which is which?"}, {"time": 3724, "text": "We actually set out to address that question with Tom Mitchell."}, {"time": 3728, "text": "I wrote a paper called what can machine learning do that was in science."}, {"time": 3733, "text": "And we went and interviewed a whole bunch of AI experts and kind of synthesized what they thought machine learning was good at and wasn't good at."}, {"time": 3742, "text": "And we came up with what we called a rubric, basically a set of questions you can ask about any task that will tell you whether it's likely to score high or low on suitability for machine learning."}, {"time": 3753, "text": "And then we've applied that to a bunch of tasks in the economy."}, {"time": 3756, "text": "In fact, there's a data set of all the tasks in the US economy, believe it or not, it's called ONET."}, {"time": 3761, "text": "The US government put it together, part of the Bureau of Labor Statistics."}, {"time": 3765, "text": "They divide the economy into about 970 occupations like bus driver, economist, primary school teacher, radiologist, and then for each one of them, they describe which tasks need to be done."}, {"time": 3777, "text": "Like for radiologists, there are 27 distinct tasks."}, {"time": 3780, "text": "So we went through all those tasks to see whether or not a machine could do them."}, {"time": 3784, "text": "And what we found interestingly was..."}, {"time": 3786, "text": "Brilliant study by the way, that's so awesome."}, {"time": 3788, "text": "Yeah, thank you."}, {"time": 3790, "text": "So what we found was that there was no occupation in our data set where machine learning just ran the table and did everything."}, {"time": 3797, "text": "And there was almost no occupation where machine learning didn't have like a significant ability to do things."}, {"time": 3802, "text": "Like take radiology, a lot of people I hear saying, you know, it's the end of radiology."}, {"time": 3806, "text": "And one of the 27 tasks is read medical images."}, {"time": 3809, "text": "Really important one, like it's kind of a core job."}, {"time": 3811, "text": "And machines have basically gotten as good or better than radiologists."}, {"time": 3815, "text": "There was just an article in Nature last week, but they've been publishing them for the past few years showing that machine learning can do as well as humans on many kinds of diagnostic imaging tasks."}, {"time": 3829, "text": "But other things that radiologists do, they sometimes administer conscious sedation."}, {"time": 3834, "text": "They sometimes do physical exams."}, {"time": 3835, "text": "They have to synthesize the results and explain it to the other doctors or to the patients."}, {"time": 3841, "text": "In all those categories, machine learning isn't really up to snuff yet."}, {"time": 3845, "text": "So that job, we're gonna see a lot of restructuring."}, {"time": 3849, "text": "Parts of the job, they'll hand over to machines."}, {"time": 3851, "text": "Others, humans will do more of."}, {"time": 3853, "text": "That's been more or less the pattern all of them."}, {"time": 3855, "text": "So, you know, to oversimplify a bit, we're gonna see a lot of restructuring, reorganization of work."}, {"time": 3860, "text": "And it's real gonna be a great time."}, {"time": 3862, "text": "It is a great time for smart entrepreneurs and managers to do that reinvention of work."}, {"time": 3867, "text": "I'm not gonna see mass unemployment."}, {"time": 3870, "text": "To get more specifically to your question, the kinds of tasks that machines tend to be good at are a lot of routine problem solving, mapping inputs X into outputs Y."}, {"time": 3882, "text": "If you have a lot of data on the Xs and the Ys, the inputs and the outputs, you can do that kind of mapping and find the relationships."}, {"time": 3888, "text": "They tend to not be very good at, even now, fine motor control and dexterity."}, {"time": 3893, "text": "Emotional intelligence and human interactions and thinking outside the box, creative work."}, {"time": 3901, "text": "If you give it a well structured task, machines can be very good at it."}, {"time": 3905, "text": "But even asking the right questions, that's hard."}, {"time": 3908, "text": "There's a quote that Andrew McAfee and I use in our book, Second Machine Age."}, {"time": 3912, "text": "Apparently Pablo Picasso was shown an early computer and he came away kind of unimpressed."}, {"time": 3918, "text": "He goes, well, I don't see all the fusses."}, {"time": 3920, "text": "All that does is answer questions."}, {"time": 3923, "text": "And to him, the interesting thing was asking the questions."}, {"time": 3926, "text": "Yeah, try to replace me, GPT3, I dare you."}, {"time": 3931, "text": "Although some people think I'm a robot."}, {"time": 3933, "text": "You have this cool plot that shows, I just remember where economists land, where I think the X axis is the income."}, {"time": 3943, "text": "And then the Y axis is, I guess, aggregating the information of how replaceable the job is."}, {"time": 3949, "text": "Or I think there's an index."}, {"time": 3950, "text": "There's a suitability for machine learning index."}, {"time": 3952, "text": "So we have all 970 occupations on that chart."}, {"time": 3955, "text": "It's a cool plot."}, {"time": 3956, "text": "And there's scatters in all four corners have some occupations."}, {"time": 3961, "text": "But there is a definite pattern, which is the lower wage occupations tend to have more tasks that are suitable for machine learning, like cashiers."}, {"time": 3967, "text": "I mean, anyone who's gone to a supermarket or CVS knows that they not only read barcodes, but they can recognize an apple and an orange and a lot of things cashiers, humans used to be needed for."}, {"time": 3979, "text": "At the other end of the spectrum, there are some jobs like airline pilot that are among the highest paid in our economy, but also a lot of them are suitable for machine learning."}, {"time": 3988, "text": "A lot of those tasks are."}, {"time": 3990, "text": "And then, yeah, you mentioned economists."}, {"time": 3992, "text": "I couldn't help peeking at those and they're paid a fair amount, maybe not as much as some of us think they should be."}, {"time": 3999, "text": "But they have some tasks that are suitable for machine learning, but for now at least, most of the tasks of economists didn't end up being in that category."}, {"time": 4008, "text": "And I should say, I didn't like create that data."}, {"time": 4010, "text": "We just took the analysis and that's what came out of it."}, {"time": 4014, "text": "And over time, that scatter plot will be updated as the technology improves."}, {"time": 4019, "text": "But it was just interesting to see the pattern there."}, {"time": 4022, "text": "And it is a little troubling in so far as if you just take the technology as it is today, it's likely to worsen income inequality on a lot of dimensions."}, {"time": 4032, "text": "So on this topic of the effect of AI on our landscape of work, one of the people that have been speaking about it in the public domain, public discourse is the presidential candidate, Andrew Yang."}, {"time": 4049, "text": "What are your thoughts about Andrew?"}, {"time": 4051, "text": "What are your thoughts about UBI, that universal basic income that he made one of the core ideas, by the way, he has like hundreds of ideas about like everything, it's kind of interesting."}, {"time": 4064, "text": "But what are your thoughts about him and what are your thoughts about UBI?"}, {"time": 4066, "text": "Let me answer the question about his broader approach first."}, {"time": 4072, "text": "I mean, I just love that."}, {"time": 4072, "text": "He's really thoughtful, analytical."}, {"time": 4076, "text": "I agree with his values."}, {"time": 4078, "text": "So that's awesome."}, {"time": 4079, "text": "And he read my book and mentions it sometimes, so it makes me even more excited."}, {"time": 4084, "text": "And the thing that he really made the centerpiece of his campaign was UBI."}, {"time": 4089, "text": "And I was originally kind of a fan of it."}, {"time": 4093, "text": "And then as I studied it more, I became less of a fan, although I'm beginning to come back a little bit."}, {"time": 4097, "text": "So let me tell you a little bit of my evolution."}, {"time": 4099, "text": "As an economist, we have, by looking at the problem of people not having enough income and the simplest thing is, well, why don't we write them a check?"}, {"time": 4108, "text": "But then I talked to my sociologist friends and they really convinced me that just writing a check doesn't really get at the core values."}, {"time": 4116, "text": "Voltaire once said that work solves three great ills, boredom, vice, and need."}, {"time": 4123, "text": "And you can deal with the need thing by writing a check, but people need a sense of meaning, they need something to do."}, {"time": 4130, "text": "And when, say, steel workers or coal miners lost their jobs and were just given checks, alcoholism, depression, divorce, all those social indicators, drug use, all went way up."}, {"time": 4146, "text": "People just weren't happy just sitting around collecting a check."}, {"time": 4151, "text": "Maybe it's part of the way they were raised."}, {"time": 4153, "text": "Maybe it's something innate in people that they need to feel wanted and needed."}, {"time": 4157, "text": "So it's not as simple as just writing people a check."}, {"time": 4159, "text": "You need to also give them a way to have a sense of purpose."}, {"time": 4163, "text": "And that was important to me."}, {"time": 4165, "text": "And the second thing is that, as I mentioned earlier, we are far from the end of work."}, {"time": 4171, "text": "I don't buy the idea that there's just like not enough work to be done."}, {"time": 4174, "text": "I see like our cities need to be cleaned up."}, {"time": 4177, "text": "And robots can't do most of that."}, {"time": 4179, "text": "We need to have better childcare."}, {"time": 4180, "text": "We need better healthcare."}, {"time": 4181, "text": "We need to take care of people who are mentally ill or older."}, {"time": 4184, "text": "We need to repair our roads."}, {"time": 4186, "text": "There's so much work that require at least partly, maybe entirely a human component."}, {"time": 4192, "text": "So rather than like write all these people off, let's find a way to repurpose them and keep them engaged."}, {"time": 4198, "text": "Now that said, I would like to see more buying power from people who are sort of at the bottom end of the spectrum."}, {"time": 4207, "text": "The economy has been designed and evolved in a way that's I think very unfair to a lot of hardworking people."}, {"time": 4215, "text": "I see super hardworking people who aren't really seeing their wages grow over the past 20, 30 years, while some other people who have been super smart and or super lucky have made billions or hundreds of billions."}, {"time": 4230, "text": "And I don't think they need those hundreds of billions to have the right incentives to invent things."}, {"time": 4235, "text": "I think if you talk to almost any of them as I have, they don't think that they need an extra $10 billion to do what they're doing."}, {"time": 4243, "text": "Most of them probably would love to do it for only a billion or maybe for nothing."}, {"time": 4249, "text": "For nothing, many of them, yeah."}, {"time": 4250, "text": "I mean, an interesting point to make is, do we think that Bill Gates would have founded Microsoft if tax rates were 70%?"}, {"time": 4258, "text": "Well, we know he would have because they were tax rates of 70% when he founded it."}, {"time": 4263, "text": "So I don't think that's as big a deterrent and we could provide more buying power to people."}, {"time": 4269, "text": "My own favorite tool is the Earned Income Tax Credit, which is basically a way of supplementing income of people who have jobs and giving employers an incentive to hire even more people."}, {"time": 4280, "text": "The minimum wage can discourage employment, but the Earned Income Tax Credit encourages employment by supplementing people's wages."}, {"time": 4287, "text": "If the employer can only afford to pay them $10 for a task, the rest of us kick in another five or $10 and bring their wages up to 15 or 20 total."}, {"time": 4297, "text": "And then they have more buying power."}, {"time": 4299, "text": "Then entrepreneurs are thinking, how can we cater to them?"}, {"time": 4302, "text": "How can we make products for them?"}, {"time": 4304, "text": "And it becomes a self reinforcing system where people are better off."}, {"time": 4309, "text": "Ian Drang and I had a good discussion where he suggested instead of a universal basic income, he suggested, or instead of an unconditional basic income, how about a conditional basic income where the condition is you learn some new skills, we need to reskill our workforce."}, {"time": 4325, "text": "So let's make it easier for people to find ways to get those skills and get rewarded for doing them."}, {"time": 4331, "text": "And that's kind of a neat idea as well."}, {"time": 4333, "text": "So, I mean, one of the questions, one of the dreams of UBI is that you provide some little safety net while you retrain, while you learn a new skill."}, {"time": 4346, "text": "But like, I think, I guess you're speaking to the intuition that that doesn't always, like there needs to be some incentive to reskill, to train, to learn a new thing."}, {"time": 4356, "text": "I mean, there are lots of self motivated people, but there are also people that maybe need a little guidance or help and I think it's a really hard question for someone who is losing a job in one area to know what is the new area I should be learning skills in."}, {"time": 4370, "text": "And we could provide a much better set of tools and platforms that maps it."}, {"time": 4374, "text": "Okay, here's a set of skills you already have."}, {"time": 4376, "text": "Here's something that's in demand."}, {"time": 4378, "text": "Let's create a path for you to go from where you are to where you need to be."}, {"time": 4383, "text": "So I'm a total, how do I put it nicely about myself?"}, {"time": 4387, "text": "I'm totally clueless about the economy."}, {"time": 4389, "text": "It's not totally true, but pretty good approximation."}, {"time": 4392, "text": "If you were to try to fix our tax system and, or maybe from another side, if there's fundamental problems in taxation or some fundamental problems about our economy, what would you try to fix?"}, {"time": 4411, "text": "What would you try to speak to?"}, {"time": 4413, "text": "You know, I definitely think our whole tax system, our political and economic system has gotten more and more screwed up over the past 20, 30 years."}, {"time": 4423, "text": "I don't think it's that hard to make headway in improving it."}, {"time": 4427, "text": "I don't think we need to totally reinvent stuff."}, {"time": 4429, "text": "A lot of it is what I've been elsewhere with Andy and others called economics 101."}, {"time": 4434, "text": "You know, there's just some basic principles that have worked really well in the 20th century that we sort of forgot, you know, in terms of investing in education, investing in infrastructure, welcoming immigrants, having a tax system that was more progressive and fair."}, {"time": 4453, "text": "At one point, tax rates were on top incomes were significantly higher."}, {"time": 4458, "text": "And they've come down a lot to the point where in many cases they're lower now than they are for poorer people."}, {"time": 4464, "text": "So, and we could do things like earned income tax credit to get a little more wonky."}, {"time": 4469, "text": "I'd like to see more Pigouvian taxes."}, {"time": 4471, "text": "What that means is you tax things that are bad instead of things that are good."}, {"time": 4476, "text": "So right now we tax labor, we tax capital and which is unfortunate because one of the basic principles of economics if you tax something, you tend to get less of it."}, {"time": 4486, "text": "So, you know, right now there's still work to be done and still capital to be invested in."}, {"time": 4491, "text": "But instead we should be taxing things like pollution and congestion."}, {"time": 4497, "text": "And if we did that, we would have less pollution."}, {"time": 4500, "text": "So a carbon tax is, you know, almost every economist would say it's a no brainer whether they're Republican or Democrat, Greg Mankiw who is head of George Bush's Council of Economic Advisers or Dick Schmollensie who is another Republican economist agree."}, {"time": 4516, "text": "And of course a lot of Democratic economists agree as well."}, {"time": 4521, "text": "If we taxed carbon, we could raise hundreds of billions of dollars."}, {"time": 4526, "text": "We could take that money and redistribute it through an earned income tax credit or other things so that overall our tax system would become more progressive."}, {"time": 4535, "text": "We could tax congestion."}, {"time": 4536, "text": "One of the things that kills me as an economist is every time I sit in a traffic jam, I know that it's completely unnecessary."}, {"time": 4543, "text": "This is complete wasted time."}, {"time": 4544, "text": "You just visualize the cost and productivity."}, {"time": 4547, "text": "Exactly, because they are taking costs for me and all the people around me."}, {"time": 4552, "text": "And if they charged a congestion tax, they would take that same amount of money and people would, it would streamline the roads."}, {"time": 4559, "text": "Like when you're in Singapore, the traffic just flows because they have a congestion tax."}, {"time": 4562, "text": "They listened to economists."}, {"time": 4563, "text": "They invited me and others to go talk to them."}, {"time": 4566, "text": "And then I'd still be paying, I'd be paying a congestion tax instead of paying in my time, but that money would now be available for healthcare, be available for infrastructure, or be available just to give to people so they could buy food or whatever."}, {"time": 4578, "text": "So it's just, it saddens me when you sit, when you're sitting in a traffic jam, it's like taxing me and then taking that money and dumping it in the ocean, just like destroying it."}, {"time": 4587, "text": "So there are a lot of things like that that economists, and I'm not, I'm not like doing anything radical here."}, {"time": 4593, "text": "Most, you know, good economists would, I probably agree with me point by point on these things."}, {"time": 4599, "text": "And we could do those things and our whole economy would become much more efficient."}, {"time": 4603, "text": "It'd become fairer, invest in R&D and research, which is close to a free lunch is what we have."}, {"time": 4610, "text": "My erstwhile MIT colleague, Bob Solla, got the Nobel Prize, not yesterday, but 30 years ago, for describing that most improvements in living standards come from tech progress."}, {"time": 4622, "text": "And Paul Romer later got a Nobel Prize for noting that investments in R&D and human capital can speed the rate of tech progress."}, {"time": 4631, "text": "So if we do that, then we'll be healthier and wealthier."}, {"time": 4634, "text": "Yeah, from an economics perspective, I remember taking an undergrad econ, you mentioned econ 101."}, {"time": 4640, "text": "It seemed from all the plots I saw that R&D is an obvious, as close to free lunch as we have, it seemed like obvious that we should do more research."}, {"time": 4653, "text": "Like what, what, like, there's no."}, {"time": 4656, "text": "Well, we should do basic research."}, {"time": 4658, "text": "I mean, so let me just be clear."}, {"time": 4659, "text": "It'd be great if everybody did more research and I would make this issue between applied development versus basic research."}, {"time": 4666, "text": "So applied development, like, you know, how do we get this self driving car, you know, feature to work better in the Tesla?"}, {"time": 4673, "text": "That's great for private companies because they can capture the value from that."}, {"time": 4677, "text": "If they make a better self driving car system, they can sell cars that are more valuable and then make money."}, {"time": 4683, "text": "So there's an incentive that there's not a big problem there and smart companies, Amazon, Tesla, and others are investing in it."}, {"time": 4689, "text": "The problem is with basic research, like coming up with core basic ideas, whether it's in nuclear fusion or artificial intelligence or biotech."}, {"time": 4699, "text": "There, if someone invents something, it's very hard for them to capture the benefits from it."}, {"time": 4703, "text": "It's shared by everybody, which is great in a way, but it means that they're not gonna have the incentives to put as much effort into it."}, {"time": 4710, "text": "There you need, it's a classic public good."}, {"time": 4712, "text": "There you need the government to be involved in it."}, {"time": 4715, "text": "And the US government used to be investing much more in R&D, but we have slashed that part of the government really foolishly and we're all poorer, significantly poorer as a result."}, {"time": 4728, "text": "Growth rates are down."}, {"time": 4730, "text": "We're not having the kind of scientific progress we used to have."}, {"time": 4733, "text": "It's been sort of a short term eating the seed corn, whatever metaphor you wanna use where people grab some money, put it in their pockets today, but five, 10, 20 years later, they're a lot poorer than they otherwise would have been."}, {"time": 4750, "text": "So we're living through a pandemic right now, globally in the United States."}, {"time": 4756, "text": "From an economics perspective, how do you think this pandemic will change the world?"}, {"time": 4763, "text": "It's been remarkable."}, {"time": 4764, "text": "And it's horrible how many people have suffered, the amount of death, the economic destruction."}, {"time": 4771, "text": "It's also striking just the amount of change in work that I've seen."}, {"time": 4775, "text": "In the last 20 weeks, I've seen more change than there were in the previous 20 years."}, {"time": 4781, "text": "There's been nothing like it since probably the World War II mobilization in terms of reorganizing our economy."}, {"time": 4787, "text": "The most obvious one is the shift to remote work."}, {"time": 4790, "text": "And I and many other people stopped going into the office and teaching my students in person."}, {"time": 4796, "text": "I did a study on this with a bunch of colleagues at MIT and elsewhere."}, {"time": 4799, "text": "And what we found was that before the pandemic, in the beginning of 2020, about one in six, a little over 15% of Americans were working remotely."}, {"time": 4809, "text": "When the pandemic hit, that grew steadily and hit 50%, roughly half of Americans working at home."}, {"time": 4816, "text": "So a complete transformation."}, {"time": 4817, "text": "And of course, it wasn't even, it wasn't like everybody did it."}, {"time": 4820, "text": "If you're an information worker, professional, if you work mainly with data, then you're much more likely to work at home."}, {"time": 4826, "text": "If you're a manufacturing worker, working with other people or physical things, then it wasn't so easy to work at home."}, {"time": 4834, "text": "And instead, those people were much more likely to become laid off or unemployed."}, {"time": 4839, "text": "So it's been something that's had very disparate effects on different parts of the workforce."}, {"time": 4844, "text": "Do you think it's gonna be sticky in a sense that after vaccine comes out and the economy reopens, do you think remote work will continue?"}, {"time": 4857, "text": "My hypothesis is yes, a lot of it will."}, {"time": 4859, "text": "Of course, some of it will go back, but a surprising amount of it will stay."}, {"time": 4863, "text": "I personally, for instance, I moved my seminars, my academic seminars to Zoom, and I was surprised how well it worked."}, {"time": 4870, "text": "So it works?"}, {"time": 4871, "text": "Yeah, I mean, obviously we were able to reach a much broader audience."}, {"time": 4874, "text": "So we have people tuning in from Europe and other countries, just all over the United States for that matter."}, {"time": 4880, "text": "I also actually found that it would, in many ways, is more egalitarian."}, {"time": 4883, "text": "We use the chat feature and other tools, and grad students and others who might've been a little shy about speaking up, we now kind of have more of ability for lots of voices."}, {"time": 4892, "text": "And they're answering each other's questions, so you kind of get parallel."}, {"time": 4895, "text": "Like if someone had some question about some of the data or a reference or whatever, then someone else in the chat would answer it."}, {"time": 4902, "text": "And the whole thing just became like a higher bandwidth, higher quality thing."}, {"time": 4906, "text": "So I thought that was kind of interesting."}, {"time": 4908, "text": "I think a lot of people are discovering that these tools that thanks to technologists have been developed over the past decade, they're a lot more powerful than we thought."}, {"time": 4917, "text": "I mean, all the terrible things we've seen with COVID and the real failure of many of our institutions that I thought would work better."}, {"time": 4924, "text": "One area that's been a bright spot is our technologies."}, {"time": 4929, "text": "Bandwidth has held up pretty well, and all of our email and other tools have just scaled up kind of gracefully."}, {"time": 4938, "text": "So that's been a plus."}, {"time": 4940, "text": "Economists call this question of whether it'll go back a hysteresis."}, {"time": 4943, "text": "The question is like when you boil an egg after it gets cold again, it stays hard."}, {"time": 4949, "text": "And I think that we're gonna have a fair amount of hysteresis in the economy."}, {"time": 4952, "text": "We're gonna move to this new, we have moved to a new remote work system, and it's not gonna snap all the way back to where it was before."}, {"time": 4958, "text": "One of the things that worries me is that the people with lots of followers on Twitter and people with voices, people that can, voices that can be magnified by reporters and all that kind of stuff are the people that fall into this category that we were referring to just now where they can still function and be successful with remote work."}, {"time": 4986, "text": "And then there is a kind of quiet suffering of what feels like millions of people whose jobs are disturbed profoundly by this pandemic, but they don't have many followers on Twitter."}, {"time": 5006, "text": "What do we, and again, I apologize, but I've been reading the rise and fall of the Third Reich and there's a connection to the depression on the American side."}, {"time": 5019, "text": "There's a deep, complicated connection to how suffering can turn into forces that potentially change the world in destructive ways."}, {"time": 5031, "text": "So like it's something I worry about is like, what is this suffering going to materialize itself in five, 10 years?"}, {"time": 5038, "text": "Is that something you worry about, think about?"}, {"time": 5041, "text": "It's like the center of what I worry about."}, {"time": 5043, "text": "And let me break it down to two parts."}, {"time": 5045, "text": "There's a moral and ethical aspect to it."}, {"time": 5047, "text": "We need to relieve this suffering."}, {"time": 5049, "text": "I mean, I'm sure the values of, I think most Americans, we like to see shared prosperity or most people on the planet."}, {"time": 5056, "text": "And we would like to see people not falling behind and they have fallen behind, not just due to COVID, but in the previous couple of decades, median income has barely moved, depending on how you measure it."}, {"time": 5069, "text": "And the incomes of the top 1% have skyrocketed."}, {"time": 5073, "text": "And part of that is due to the ways technology has been used."}, {"time": 5076, "text": "Part of this been due to, frankly, our political system has continually shifted more wealth into those people who have the powerful interest."}, {"time": 5085, "text": "So there's just, I think, a moral imperative to do a better job."}, {"time": 5089, "text": "And ultimately, we're all gonna be wealthier if more people can contribute, more people have the wherewithal."}, {"time": 5095, "text": "But the second thing is that there's a real political risk."}, {"time": 5098, "text": "I'm not a political scientist, but you don't have to be one, I think, to see how a lot of people are really upset with they're getting a raw deal and they want to smash the system in different ways, in 2016 and 2018."}, {"time": 5115, "text": "And now I think there are a lot of people who are looking at the political system and they feel like it's not working for them and they just wanna do something radical."}, {"time": 5124, "text": "Unfortunately, demagogues have harnessed that in a way that is pretty destructive to the country."}, {"time": 5133, "text": "And an analogy I see is what happened with trade."}, {"time": 5137, "text": "Almost every economist thinks that free trade is a good thing, that when two people voluntarily exchange almost by definition, they're both better off if it's voluntary."}, {"time": 5147, "text": "And so generally, trade is a good thing."}, {"time": 5149, "text": "But they also recognize that trade can lead to uneven effects, that there can be winners and losers in some of the people who didn't have the skills to compete with somebody else or didn't have other assets."}, {"time": 5162, "text": "And so trade can shift prices in ways that are averse to some people."}, {"time": 5168, "text": "So there's a formula that economists have, which is that you have free trade, but then you compensate the people who are hurt and free trade makes the pie bigger."}, {"time": 5178, "text": "And since the pie is bigger, it's possible for everyone to be better off."}, {"time": 5181, "text": "You can make the winners better off, but you can also compensate those who don't win."}, {"time": 5185, "text": "And so they end up being better off as well."}, {"time": 5188, "text": "What happened was that we didn't fulfill that promise."}, {"time": 5193, "text": "We did have some more increased free trade in the 80s and 90s, but we didn't compensate the people who were hurt."}, {"time": 5200, "text": "And so they felt like the people in power reneged on the bargain, and I think they did."}, {"time": 5205, "text": "And so then there's a backlash against trade."}, {"time": 5208, "text": "And now both political parties, but especially Trump and company, have really pushed back against free trade."}, {"time": 5218, "text": "Ultimately, that's bad for the country."}, {"time": 5220, "text": "Ultimately, that's bad for living standards."}, {"time": 5222, "text": "But in a way I can understand that people felt they were betrayed."}, {"time": 5227, "text": "Technology has a lot of similar characteristics."}, {"time": 5230, "text": "Technology can make us all better off."}, {"time": 5234, "text": "It makes the pie bigger."}, {"time": 5236, "text": "It creates wealth and health, but it can also be uneven."}, {"time": 5238, "text": "Not everyone automatically benefits."}, {"time": 5241, "text": "It's possible for some people, even a majority of people to get left behind while a small group benefits."}, {"time": 5248, "text": "What most economists would say, well, let's make the pie bigger, but let's make sure we adjust the system so we compensate the people who are hurt."}, {"time": 5255, "text": "And since the pie is bigger, we can make the rich richer, we can make the middle class richer, we can make the poor richer."}, {"time": 5260, "text": "Mathematically, everyone could be better off."}, {"time": 5263, "text": "But again, we're not doing that."}, {"time": 5265, "text": "And again, people are saying this isn't working for us."}, {"time": 5268, "text": "And again, instead of fixing the distribution, a lot of people are beginning to say, hey, technology sucks, we've got to stop it."}, {"time": 5277, "text": "Let's throw rocks at the Google bus."}, {"time": 5279, "text": "Let's blow it up."}, {"time": 5281, "text": "And there were the Luddites almost exactly 200 years ago who smashed the looms and the spinning machines because they felt like those machines weren't helping them."}, {"time": 5291, "text": "We have a real imperative, not just to do the morally right thing, but to do the thing that is gonna save the country, which is make sure that we create not just prosperity, but shared prosperity."}, {"time": 5302, "text": "So you've been at MIT for over 30 years, I think."}, {"time": 5307, "text": "Don't tell anyone how old I am."}, {"time": 5308, "text": "Yeah, no, that's true, that's true."}, {"time": 5310, "text": "And you're now moved to Stanford."}, {"time": 5314, "text": "I'm gonna try not to say anything about how great MIT is."}, {"time": 5319, "text": "What's that move been like?"}, {"time": 5321, "text": "What, it's East Coast to West Coast?"}, {"time": 5324, "text": "Well, MIT is great."}, {"time": 5326, "text": "MIT has been very good to me."}, {"time": 5328, "text": "It continues to be very good to me."}, {"time": 5329, "text": "It's an amazing place."}, {"time": 5331, "text": "I continue to have so many amazing friends and colleagues there."}, {"time": 5334, "text": "I'm very fortunate to have been able to spend a lot of time at MIT."}, {"time": 5338, "text": "Stanford's also amazing."}, {"time": 5340, "text": "And part of what attracted me out here was not just the weather, but also Silicon Valley, let's face it, is really more of the epicenter of the technological revolution."}, {"time": 5349, "text": "And I wanna be close to the people who are inventing AI and elsewhere."}, {"time": 5352, "text": "A lot of it is being invested at MIT for that matter in Europe and China and elsewhere, in Nia."}, {"time": 5358, "text": "But being a little closer to some of the key technologists was something that was important to me."}, {"time": 5365, "text": "And it may be shallow, but I also do enjoy the good weather."}, {"time": 5370, "text": "And I felt a little ripped off when I came here a couple of months ago."}, {"time": 5375, "text": "And immediately there are the fires and my eyes were burning, the sky was orange and there's the heat waves."}, {"time": 5381, "text": "And so it wasn't exactly what I've been promised, but fingers crossed it'll get back to better."}, {"time": 5387, "text": "But maybe on a brief aside, there's been some criticism of academia and universities and different avenues."}, {"time": 5395, "text": "And I, as a person who's gotten to enjoy universities from the pure playground of ideas that it can be, always kind of try to find the words to tell people that these are magical places."}, {"time": 5413, "text": "Is there something that you can speak to that is beautiful or powerful about universities?"}, {"time": 5423, "text": "I mean, first off, I mean, economists have this concept called revealed preference."}, {"time": 5426, "text": "You can ask people what they say or you can watch what they do."}, {"time": 5429, "text": "And so obviously by reveal preferences, I love academia."}, {"time": 5433, "text": "I could be doing lots of other things, but it's something I enjoy a lot."}, {"time": 5437, "text": "And I think the word magical is exactly right."}, {"time": 5439, "text": "At least it is for me."}, {"time": 5441, "text": "I do what I love, you know, hopefully my Dean won't be listening, but I would do this for free."}, {"time": 5445, "text": "You know, it's just what I like to do."}, {"time": 5449, "text": "I like to do research."}, {"time": 5450, "text": "I love to have conversations like this with you and with my students, with my fellow colleagues."}, {"time": 5453, "text": "I love being around the smartest people I can find and learning something from them and having them challenge me."}, {"time": 5458, "text": "And that just gives me joy."}, {"time": 5462, "text": "And every day I find something new and exciting to work on."}, {"time": 5465, "text": "And a university environment is really filled with other people who feel that way."}, {"time": 5469, "text": "And so I feel very fortunate to be part of it."}, {"time": 5472, "text": "And I'm lucky that I'm in a society where I can actually get paid for it and put food on the table while doing the stuff that I really love."}, {"time": 5479, "text": "And I hope someday everybody can have jobs that are like that."}, {"time": 5482, "text": "And I appreciate that it's not necessarily easy for everybody to have a job that they both love and also they get paid for."}, {"time": 5490, "text": "So there are things that don't go well in academia, but by and large, I think it's a kind of, you know, kinder, gentler version of a lot of the world."}, {"time": 5497, "text": "You know, we sort of cut each other a little slack on things like, you know, on just a lot of things."}, {"time": 5505, "text": "You know, of course there's harsh debates and discussions about things and some petty politics here and there."}, {"time": 5512, "text": "I personally, I try to stay away from most of that sort of politics."}, {"time": 5515, "text": "It's not my thing."}, {"time": 5516, "text": "And so it doesn't affect me most of the time, sometimes a little bit, maybe."}, {"time": 5520, "text": "But, you know, being able to pull together something, we have the digital economy lab."}, {"time": 5524, "text": "We've got all these brilliant grad students and undergraduates and postdocs that are just doing stuff that I learned from."}, {"time": 5532, "text": "And every one of them has some aspect of what they're doing that's just, I couldn't even understand."}, {"time": 5537, "text": "It's like way, way more brilliant."}, {"time": 5539, "text": "And that's really, to me, actually I really enjoy that, being in a room with lots of other smart people."}, {"time": 5545, "text": "And Stanford has made it very easy to attract, you know, those people."}, {"time": 5551, "text": "I just, you know, say I'm gonna do a seminar, whatever, and the people come, they come and wanna work with me."}, {"time": 5556, "text": "We get funding, we get data sets, and it's come together real nicely."}, {"time": 5561, "text": "And the rest is just fun."}, {"time": 5564, "text": "It's fun, yeah."}, {"time": 5565, "text": "And we feel like we're working on important problems, you know, and we're doing things that, you know, I think are first order in terms of what's important in the world, and that's very satisfying to me."}, {"time": 5576, "text": "Maybe a bit of a fun question."}, {"time": 5578, "text": "What three books, technical, fiction, philosophical, you've enjoyed, had a big, big impact in your life?"}, {"time": 5587, "text": "Well, I guess I go back to like my teen years, and, you know, I read Sid Arthur, which is a philosophical book, and kind of helps keep me centered."}, {"time": 5595, "text": "By Herman Hesse."}, {"time": 5596, "text": "Yeah, by Herman Hesse, exactly."}, {"time": 5597, "text": "Don't get too wrapped up in material things or other things, and just sort of, you know, try to find peace on things."}, {"time": 5604, "text": "A book that actually influenced me a lot in terms of my career was called The Worldly Philosophers by Robert Halbrenner."}, {"time": 5610, "text": "It's actually about economists."}, {"time": 5633, "text": "So would you recommend it as a good whirlwind overview of the history of economics?"}, {"time": 5637, "text": "Yeah, yeah, I think that's exactly right."}, {"time": 5639, "text": "It kind of takes you through the different things, and so you can understand how they reach, thinking some of the strengths and weaknesses."}, {"time": 5646, "text": "I mean, it probably is a little out of date now."}, {"time": 5647, "text": "It needs to be updated a bit, but you could at least look through the first couple hundred years of economics, which is not a bad place to start."}, {"time": 5655, "text": "More recently, I mean, a book I really enjoyed is by my friend and colleague, Max Tegmark, called Life 3.0."}, {"time": 5661, "text": "You should have him on your podcast if you haven't already."}, {"time": 5663, "text": "He was episode number one."}, {"time": 5666, "text": "And he's back, he'll be back, he'll be back soon."}, {"time": 5670, "text": "Yeah, no, he's terrific."}, {"time": 5671, "text": "I love the way his brain works, and he makes you think about profound things."}, {"time": 5675, "text": "He's got such a joyful approach to life, and so that's been a great book, and I learn a lot from it, I think everybody, but he explains it in a way, even though he's so brilliant, that everyone can understand, that I can understand."}, {"time": 5690, "text": "That's three, but let me mention maybe one or two others."}, {"time": 5692, "text": "I mean, I recently read More From Less by my sometimes coauthor, Andrew McAfee."}, {"time": 5698, "text": "It made me optimistic about how we can continue to have rising living standards while living more lightly on the planet."}, {"time": 5706, "text": "In fact, because of higher living standards, because of technology, because of digitization that I mentioned, we don't have to have as big an impact on the planet, and that's a great story to tell, and he documents it very carefully."}, {"time": 5719, "text": "You know, a personal kind of self help book that I found kind of useful, People, is Atomic Habits."}, {"time": 5724, "text": "I think it's, what's his name, James Clear."}, {"time": 5726, "text": "Yeah, James Clear."}, {"time": 5727, "text": "He's just, yeah, it's a good name, because he writes very clearly, and you know, most of the sentences I read in that book, I was like, yeah, I know that, but it just really helps to have somebody like remind you and tell you and kind of just reinforce it, and it's helpful."}]}]