[{"title": "Russ Tedrake: Underactuated Robotics, Control, Dynamics and Touch | Lex Fridman Podcast #114", "id": "A22Ej6kb2wo", "quotes": [{"time": 283, "text": "The ones in particular that Steve Collins built with Andy Ruina at Cornell, a 3D walking machine."}, {"time": 290, "text": "So it was not confined to a boom or a plane that you put it on top of a small ramp, give it a little push, it's powered only by gravity."}, {"time": 300, "text": "No controllers, no batteries whatsoever."}, {"time": 304, "text": "It just falls down the ramp."}, {"time": 306, "text": "And at the time it looked more natural, more graceful, more human like than any robot we'd seen to date powered only by gravity."}, {"time": 315, "text": "How does it work?"}, {"time": 317, "text": "Well, okay, the simplest model, it's kind of like a slinky."}, {"time": 319, "text": "It's like an elaborate slinky."}, {"time": 321, "text": "One of the simplest models we used to think about it is actually a rimless wheel."}, {"time": 325, "text": "So imagine taking a bicycle wheel, but take the rim off."}, {"time": 330, "text": "So it's now just got a bunch of spokes."}, {"time": 332, "text": "If you give that a push, it still wants to roll down the ramp, but every time its foot, its spoke comes around and hits the ground, it loses a little energy."}, {"time": 341, "text": "Every time it takes a step forward, it gains a little energy."}, {"time": 345, "text": "Those things can come into perfect balance."}, {"time": 348, "text": "And actually they want to, it's a stable phenomenon."}, {"time": 351, "text": "If it's going too slow, it'll speed up."}, {"time": 353, "text": "If it's going too fast, it'll slow down and it comes into a stable periodic motion."}, {"time": 359, "text": "Now you can take that rimless wheel, which doesn't look very much like a human walking, take all the extra spokes away, put a hinge in the middle."}, {"time": 368, "text": "Now it's two legs."}, {"time": 369, "text": "That's called our compass gait walker."}, {"time": 371, "text": "That can still, you give it a little push, it starts falling down a ramp."}, {"time": 375, "text": "It looks a little bit more like walking."}, {"time": 377, "text": "At least it's a biped."}, {"time": 379, "text": "But what Steve and Andy, and Tad McGeer started the whole exercise, but what Steve and Andy did was they took it to this beautiful conclusion where they built something that had knees, arms, a torso."}, {"time": 392, "text": "The arms swung naturally, give it a little push."}, {"time": 396, "text": "And that looked like a stroll through the park."}, {"time": 398, "text": "How do you design something like that?"}, {"time": 400, "text": "I mean, is that art or science?"}, {"time": 402, "text": "It's on the boundary."}, {"time": 403, "text": "I think there's a science to getting close to the solution."}, {"time": 407, "text": "I think there's certainly art in the way that they made a beautiful robot."}, {"time": 412, "text": "But then the finesse, because they were working with a system that wasn't perfectly modeled, wasn't perfectly controlled, there's all these little tricks that you have to tune the suction cups at the knees, for instance, so that they stick, but then they release at just the right time."}, {"time": 429, "text": "Or there's all these little tricks of the trade, which really are art, but it was a point."}, {"time": 434, "text": "I mean, it made the point."}, {"time": 436, "text": "We were, at that time, the walking robot, the best walking robot in the world was Honda's Asmo."}, {"time": 441, "text": "Absolutely marvel of modern engineering."}, {"time": 444, "text": "Is this 90s?"}, {"time": 445, "text": "This was in 97 when they first released."}, {"time": 447, "text": "It sort of announced P2, and then it went through."}, {"time": 449, "text": "It was Asmo by then in 2004."}, {"time": 452, "text": "And it looks like this very cautious walking, like you're walking on hot coals or something like that."}, {"time": 461, "text": "I think it gets a bad rap."}, {"time": 463, "text": "Asmo is a beautiful machine."}, {"time": 465, "text": "It does walk with its knees bent."}, {"time": 467, "text": "Our Atlas walking had its knees bent."}, {"time": 469, "text": "But actually, Asmo was pretty fantastic."}, {"time": 472, "text": "But it wasn't energy efficient."}, {"time": 474, "text": "Neither was Atlas when we worked on Atlas."}, {"time": 478, "text": "None of our robots that have been that complicated have been very energy efficient."}, {"time": 484, "text": "But there's a thing that happens when you do control, when you try to control a system of that complexity."}, {"time": 492, "text": "You try to use your motors to basically counteract gravity."}, {"time": 497, "text": "Take whatever the world's doing to you and push back, erase the dynamics of the world, and impose the dynamics you want because you can make them simple and analyzable, mathematically simple."}, {"time": 510, "text": "And this was a very sort of beautiful example that you don't have to do that."}, {"time": 516, "text": "You can just let go."}, {"time": 517, "text": "Let physics do most of the work, right?"}, {"time": 520, "text": "And you just have to give it a little bit of energy."}, {"time": 522, "text": "This one only walked down a ramp."}, {"time": 523, "text": "It would never walk on the flat."}, {"time": 525, "text": "To walk on the flat, you have to give a little energy at some point."}, {"time": 528, "text": "But maybe instead of trying to take the forces imparted to you by the world and replacing them, what we should be doing is letting the world push us around and we go with the flow."}, {"time": 539, "text": "Very zen, very zen robot."}, {"time": 541, "text": "Yeah, but okay, so that sounds very zen, but I can also imagine how many like failed versions they had to go through."}, {"time": 551, "text": "Like how many, like, I would say it's probably, would you say it's in the thousands that they've had to have the system fall down before they figured out how to get it?"}, {"time": 559, "text": "I don't know if it's thousands, but it's a lot."}, {"time": 562, "text": "It takes some patience."}, {"time": 565, "text": "So in that sense, control might help a little bit."}, {"time": 568, "text": "Oh, I think everybody, even at the time, said that the answer is to do with that with control."}, {"time": 575, "text": "But it was just pointing out that maybe the way we're doing control right now isn't the way we should."}, {"time": 581, "text": "So what about on the animal side, the ones that figured out how to move efficiently?"}, {"time": 586, "text": "Is there anything you find inspiring or beautiful in the movement of any particular animal?"}, {"time": 591, "text": "I do have a favorite example."}, {"time": 592, "text": "So it sort of goes with the passive walking idea."}, {"time": 597, "text": "So is there, you know, how energy efficient are animals?"}, {"time": 601, "text": "Okay, there's a great series of experiments by George Lauder at Harvard and Mike Tranofilo at MIT."}, {"time": 607, "text": "They were studying fish swimming in a water tunnel."}, {"time": 611, "text": "And one of these, the type of fish they were studying were these rainbow trout, because there was a phenomenon well understood that rainbow trout, when they're swimming upstream in mating season, they kind of hang out behind the rocks."}, {"time": 625, "text": "And it looks like, I mean, that's tiring work swimming upstream."}, {"time": 628, "text": "They're hanging out behind the rocks."}, {"time": 629, "text": "Maybe there's something energetically interesting there."}, {"time": 631, "text": "So they tried to recreate that."}, {"time": 633, "text": "They put in this water tunnel, a rock basically, a cylinder that had the same sort of vortex street, the eddies coming off the back of the rock that you would see in a stream."}, {"time": 644, "text": "And they put a real fish behind this and watched how it swims."}, {"time": 648, "text": "And the amazing thing is that if you watch from above what the fish swims when it's not behind a rock, it has a particular gate."}, {"time": 656, "text": "You can identify the fish the same way you look at a human walking down the street."}, {"time": 659, "text": "You sort of have a sense of how a human walks."}, {"time": 662, "text": "The fish has a characteristic gate."}, {"time": 665, "text": "You put that fish behind the rock, its gate changes."}, {"time": 669, "text": "And what they saw was that it was actually resonating and kind of surfing between the vortices."}, {"time": 676, "text": "Now, here was the experiment that really was the clincher."}, {"time": 680, "text": "Because there was still, it wasn't clear how much of that was mechanics of the fish, how much of that is control, the brain."}, {"time": 686, "text": "So the clincher experiment, and maybe one of my favorites to date, although there are many good experiments."}, {"time": 693, "text": "They took, this was now a dead fish."}, {"time": 698, "text": "They took a dead fish."}, {"time": 700, "text": "They put a string that went, that tied the mouth of the fish to the rock so it couldn't go back and get caught in the grates."}, {"time": 707, "text": "And then they asked what would that dead fish do when it was hanging out behind the rock?"}, {"time": 711, "text": "And so what you'd expect, it sort of flopped around like a dead fish in the vortex wake until something sort of amazing happens."}, {"time": 717, "text": "And this video is worth putting in, right?"}, {"time": 724, "text": "The dead fish basically starts swimming upstream, right?"}, {"time": 727, "text": "It's completely dead, no brain, no motors, no control."}, {"time": 732, "text": "But it's somehow the mechanics of the fish resonate with the vortex street and it starts swimming upstream."}, {"time": 738, "text": "It's one of the best examples ever."}, {"time": 740, "text": "Who do you give credit for that to?"}, {"time": 743, "text": "Is that just evolution constantly just figuring out by killing a lot of generations of animals, like the most efficient motion?"}, {"time": 753, "text": "Is that, or maybe the physics of our world completely like, is like if evolution applied not only to animals, but just the entirety of it somehow drives to efficiency, like nature likes efficiency?"}, {"time": 767, "text": "I don't know if that question even makes any sense."}, {"time": 769, "text": "I understand the question."}, {"time": 771, "text": "That's reasonable."}, {"time": 771, "text": "I mean, do they co evolve?"}, {"time": 774, "text": "Yeah, somehow co, yeah."}, {"time": 775, "text": "Like I don't know if an environment can evolve, but."}, {"time": 780, "text": "I mean, there are experiments that people do, careful experiments that show that animals can adapt to unusual situations and recover efficiency."}, {"time": 788, "text": "So there seems like at least in one direction, I think there is reason to believe that the animal's motor system and probably its mechanics adapt in order to be more efficient."}, {"time": 800, "text": "But efficiency isn't the only goal, of course."}, {"time": 803, "text": "Sometimes it's too easy to think about only efficiency, but we have to do a lot of other things first, not get eaten."}, {"time": 810, "text": "And then all other things being equal, try to save energy."}, {"time": 814, "text": "By the way, let's draw a distinction between control and mechanics."}, {"time": 818, "text": "Like how would you define each?"}, {"time": 821, "text": "I mean, I think part of the point is that we shouldn't draw a line as clearly as we tend to."}, {"time": 827, "text": "But on a robot, we have motors and we have the links of the robot, let's say."}, {"time": 834, "text": "If the motors are turned off, the robot has some passive dynamics, okay?"}, {"time": 839, "text": "Gravity does the work."}, {"time": 841, "text": "You can put springs, I would call that mechanics, right?"}, {"time": 843, "text": "If we have springs and dampers, which our muscles are springs and dampers and tendons."}, {"time": 848, "text": "But then you have something that's doing active work, putting energy in, which are your motors on the robot."}, {"time": 853, "text": "The controller's job is to send commands to the motor that add new energy into the system, right?"}, {"time": 859, "text": "So the mechanics and control interplay somewhere, the divide is around, you know, did you decide to send some commands to your motor or did you just leave the motors off, let them do their work?"}, {"time": 870, "text": "Would you say is most of nature on the dynamic side or the control side?"}, {"time": 879, "text": "So like, if you look at biological systems, we're living in a pandemic now, like, do you think a virus is a, do you think it's a dynamic system or is there a lot of control, intelligence?"}, {"time": 894, "text": "I think it's both, but I think we maybe have underestimated how important the dynamics are, right?"}, {"time": 902, "text": "I mean, even our bodies, the mechanics of our bodies, certainly with exercise, they evolve."}, {"time": 906, "text": "But so I actually, I lost a finger in early 2000s and it's my fifth metacarpal."}, {"time": 914, "text": "And it turns out you use that a lot in ways you don't expect when you're opening jars, even when I'm just walking around, if I bump it on something, there's a bone there that was used to taking contact."}, {"time": 926, "text": "My fourth metacarpal wasn't used to taking contact, it used to hurt, it still does a little bit."}, {"time": 931, "text": "But actually my bone has remodeled, right?"}, {"time": 934, "text": "Over a couple of years, the geometry, the mechanics of that bone changed to address the new circumstances."}, {"time": 944, "text": "So the idea that somehow it's only our brain that's adapting or evolving is not right."}, {"time": 950, "text": "Maybe sticking on evolution for a bit, because it's tended to create some interesting things."}, {"time": 956, "text": "Bipedal walking, why the heck did evolution give us, I think we're, are we the only mammals that walk on two feet?"}, {"time": 965, "text": "No, I mean, there's a bunch of animals that do it a bit."}, {"time": 969, "text": "I think we are the most successful bipeds."}, {"time": 972, "text": "I think I read somewhere that the reason the evolution made us walk on two feet is because there's an advantage to being able to carry food back to the tribe or something like that."}, {"time": 988, "text": "So like you can carry, it's kind of this communal, cooperative thing, so like to carry stuff back to a place of shelter and so on to share with others."}, {"time": 1000, "text": "Do you understand at all the value of walking on two feet from both a robotics and a human perspective?"}, {"time": 1008, "text": "Yeah, there are some great books written about evolution of, walking evolution of the human body."}, {"time": 1014, "text": "I think it's easy though to make bad evolutionary arguments."}, {"time": 1020, "text": "Sure, most of them are probably bad, but what else can we do?"}, {"time": 1026, "text": "I mean, I think a lot of what dominated our evolution probably was not the things that worked well sort of in the steady state, you know, when things are good, but for instance, people talk about what we should eat now because our ancestors were meat eaters or whatever."}, {"time": 1048, "text": "Oh yeah, I love that, yeah."}, {"time": 1050, "text": "But probably, you know, the reason that one pre Homo sapiens species versus another survived was not because of whether they ate well when there was lots of food."}, {"time": 1065, "text": "But when the ice age came, you know, probably one of them happened to be in the wrong place."}, {"time": 1070, "text": "One of them happened to forage a food that was okay even when the glaciers came or something like that, I mean."}, {"time": 1078, "text": "There's a million variables that contributed and we can't, and our, actually the amount of information we're working with and telling these stories, these evolutionary stories is very little."}, {"time": 1090, "text": "So yeah, just like you said, it seems like, if you study history, it seems like history turns on like these little events that otherwise would seem meaningless, but in a grant, like when you, in retrospect, were turning points."}, {"time": 1142, "text": "There's probably an even larger community of people, including my mom, who says it's deeply unhealthy, it's wrong, but I just feel good doing it."}, {"time": 1150, "text": "But you're right, these evolutionary arguments can be flawed, but is there anything interesting to pull out for?"}, {"time": 1157, "text": "There's a great book, by the way, well, a series of books by Nicholas Taleb about Fooled by Randomness and Black Swan."}, {"time": 1164, "text": "Highly recommend them, but yeah, they make the point nicely that probably it was a few random events that, yes, maybe it was someone getting hit by a rock, as you say."}, {"time": 1179, "text": "That said, do you think, I don't know how to ask this question or how to talk about this, but there's something elegant and beautiful about moving on two feet, obviously biased because I'm human, but from a robotics perspective, too, you work with robots on two feet, is it all useful to build robots that are on two feet as opposed to four?"}, {"time": 1201, "text": "Is there something useful about it?"}, {"time": 1202, "text": "I think the most, I mean, the reason I spent a long time working on bipedal walking was because it was hard and it challenged control theory in ways that I thought were important."}, {"time": 1213, "text": "I wouldn't have ever tried to convince you that you should start a company around bipeds or something like this."}, {"time": 1224, "text": "There are people that make pretty compelling arguments."}, {"time": 1226, "text": "I think the most compelling one is that the world is built for the human form, and if you want a robot to work in the world we have today, then having a human form is a pretty good way to go."}, {"time": 1239, "text": "There are places that a biped can go that would be hard for other form factors to go, even natural places, but at some point in the long run, we'll be building our environments for our robots, probably, and so maybe that argument falls aside."}, {"time": 1256, "text": "So you famously run barefoot."}, {"time": 1260, "text": "Do you still run barefoot?"}, {"time": 1262, "text": "I still run barefoot."}, {"time": 1263, "text": "That's so awesome."}, {"time": 1264, "text": "Much to my wife's chagrin."}, {"time": 1267, "text": "Do you want to make an evolutionary argument for why running barefoot is advantageous?"}, {"time": 1272, "text": "What have you learned about human and robot movement in general from running barefoot?"}, {"time": 1281, "text": "Human or robot and or?"}, {"time": 1283, "text": "Well, you know, it happened the other way, right?"}, {"time": 1285, "text": "So I was studying walking robots, and there's a great conference called the Dynamic Walking Conference where it brings together both the biomechanics community and the walking robots community."}, {"time": 1299, "text": "And so I had been going to this for years and hearing talks by people who study barefoot running and other, the mechanics of running."}, {"time": 1308, "text": "So I did eventually read Born to Run."}, {"time": 1310, "text": "Most people read Born to Run in the first, right?"}, {"time": 1314, "text": "The other thing I had going for me is actually that I wasn't a runner before, and I learned to run after I had learned about barefoot running, or I mean, started running longer distances."}, {"time": 1325, "text": "So I didn't have to unlearn."}, {"time": 1327, "text": "And I'm definitely, I'm a big fan of it for me, but I'm not going to, I tend to not try to convince other people."}, {"time": 1334, "text": "There's people who run beautifully with shoes on, and that's good."}, {"time": 1340, "text": "But here's why it makes sense for me."}, {"time": 1344, "text": "It's all about the longterm game, right?"}, {"time": 1346, "text": "So I think it's just too easy to run 10 miles, feel pretty good, and then you get home at night and you realize my knees hurt."}, {"time": 1353, "text": "I did something wrong, right?"}, {"time": 1357, "text": "If you take your shoes off, then if you hit hard with your foot at all, then it hurts."}, {"time": 1365, "text": "You don't like run 10 miles and then realize you've done some damage."}, {"time": 1370, "text": "You have immediate feedback telling you that you've done something that's maybe suboptimal, and you change your gait."}, {"time": 1376, "text": "I mean, it's even subconscious."}, {"time": 1377, "text": "If I, right now, having run many miles barefoot, if I put a shoe on, my gait changes in a way that I think is not as good."}, {"time": 1385, "text": "So it makes me land softer."}, {"time": 1389, "text": "And I think my goals for running are to do it for as long as I can into old age, not to win any races."}, {"time": 1399, "text": "And so for me, this is a way to protect myself."}, {"time": 1403, "text": "Yeah, I think, first of all, I've tried running barefoot many years ago, probably the other way, just reading Born to Run."}, {"time": 1413, "text": "But just to understand, because I felt like I couldn't put in the miles that I wanted to."}, {"time": 1420, "text": "And it feels like running for me, and I think for a lot of people, was one of those activities that we do often and we never really try to learn to do correctly."}, {"time": 1433, "text": "Like, it's funny, there's so many activities we do every day, like brushing our teeth, right?"}, {"time": 1440, "text": "I think a lot of us, at least me, probably have never deeply studied how to properly brush my teeth, right?"}, {"time": 1447, "text": "Or wash, as now with the pandemic, or how to properly wash our hands."}, {"time": 1450, "text": "We do it every day, but we haven't really studied, like, am I doing this correctly?"}, {"time": 1455, "text": "But running felt like one of those things, it was absurd not to study how to do correctly, because it's the source of so much pain and suffering."}, {"time": 1463, "text": "Like, I hate running, but I do it."}, {"time": 1465, "text": "I do it because I hate it, but I feel good afterwards."}, {"time": 1468, "text": "But I think it feels like you need to learn how to do it properly."}, {"time": 1471, "text": "So that's where barefoot running came in, and then I quickly realized that my gait was completely wrong."}, {"time": 1478, "text": "I was taking huge steps, and landing hard on the heel, all those elements."}, {"time": 1485, "text": "And so, yeah, from that I actually learned to take really small steps, look."}, {"time": 1490, "text": "I already forgot the number, but I feel like it was 180 a minute or something like that."}, {"time": 1495, "text": "And I remember I actually just took songs that are 180 beats per minute, and then like tried to run at that beat, and just to teach myself."}, {"time": 1507, "text": "It took a long time, and I feel like after a while, you learn to run, you adjust properly, without going all the way to barefoot."}, {"time": 1515, "text": "But I feel like barefoot is the legit way to do it."}, {"time": 1519, "text": "I mean, I think a lot of people would be really curious about it."}, {"time": 1523, "text": "Can you, if they're interested in trying, what would you, how would you recommend they start, or try, or explore?"}, {"time": 1531, "text": "That's the biggest thing people do, is they are excellent runners, and they're used to running long distances, or running fast, and they take their shoes off, and they hurt themselves instantly trying to do something that they were used to doing."}, {"time": 1544, "text": "I think I lucked out in the sense that I couldn't run very far when I first started trying."}, {"time": 1550, "text": "And I run with minimal shoes too."}, {"time": 1551, "text": "I mean, I will bring along a pair of, actually, like aqua socks or something like this, I can just slip on, or running sandals, I've tried all of them."}, {"time": 1560, "text": "What's the difference between a minimal shoe and nothing at all?"}, {"time": 1563, "text": "What's, like, feeling wise, what does it feel like?"}, {"time": 1567, "text": "There is a, I mean, I notice my gait changing, right?"}, {"time": 1570, "text": "So, I mean, your foot has as many muscles and sensors as your hand does, right?"}, {"time": 1577, "text": "Sensors, ooh, okay."}, {"time": 1579, "text": "And we do amazing things with our hands."}, {"time": 1583, "text": "And we stick our foot in a big, solid shoe, right?"}, {"time": 1586, "text": "So there's, I think, you know, when you're barefoot, you're just giving yourself more proprioception."}, {"time": 1593, "text": "And that's why you're more aware of some of the gait flaws and stuff like this."}, {"time": 1597, "text": "Now, you have less protection too, so."}, {"time": 1600, "text": "Rocks and stuff."}, {"time": 1602, "text": "I mean, yeah, so I think people who are afraid of barefoot running are worried about getting cuts or stepping on rocks."}, {"time": 1609, "text": "First of all, even if that was a concern, I think those are all, like, very short term."}, {"time": 1614, "text": "You know, if I get a scratch or something, it'll heal in a week."}, {"time": 1616, "text": "If I blow out my knees, I'm done running forever."}, {"time": 1618, "text": "So I will trade the short term for the long term anytime."}, {"time": 1621, "text": "But even then, you know, and this, again, to my wife's chagrin, your feet get tough, right?"}, {"time": 1627, "text": "And, yeah, I can run over almost anything now."}, {"time": 1633, "text": "I mean, what, can you talk about, is there, like, is there tips or tricks that you have, suggestions about, like, if I wanted to try it?"}, {"time": 1646, "text": "You know, there is a good book, actually."}, {"time": 1649, "text": "There's probably more good books since I read them."}, {"time": 1652, "text": "But Ken Bob, Barefoot Ken Bob Saxton."}, {"time": 1657, "text": "He's an interesting guy."}, {"time": 1658, "text": "But I think his book captures the right way to describe running, barefoot running, to somebody better than any other I've seen."}, {"time": 1668, "text": "So you run pretty good distances, and you bike, and is there, you know, if we talk about bucket list items, is there something crazy on your bucket list, athletically, that you hope to do one day?"}, {"time": 1684, "text": "I mean, my commute is already a little crazy."}, {"time": 1687, "text": "What are we talking about here?"}, {"time": 1689, "text": "What distance are we talking about?"}, {"time": 1691, "text": "Well, I live about 12 miles from MIT, but you can find lots of different ways to get there."}, {"time": 1696, "text": "So, I mean, I've run there for many years, I've biked there."}, {"time": 1700, "text": "Old ways?"}, {"time": 1701, "text": "Yeah, but normally I would try to run in and then bike home, bike in, run home."}, {"time": 1705, "text": "But you have run there and back before?"}, {"time": 1708, "text": "Barefoot?"}, {"time": 1709, "text": "Yeah, or with minimal shoes or whatever that."}, {"time": 1712, "text": "12, 12 times two?"}, {"time": 1716, "text": "It became kind of a game of how can I get to work?"}, {"time": 1718, "text": "I've rollerbladed, I've done all kinds of weird stuff, but my favorite one these days, I've been taking the Charles River to work."}, {"time": 1725, "text": "So, I can put in the rowboat not so far from my house, but the Charles River takes a long way to get to MIT, so I can spend a long time getting there."}, {"time": 1736, "text": "And it's not about, I don't know, it's just about, I've had people ask me, how can you justify taking that time?"}, {"time": 1745, "text": "But for me, it's just a magical time to think, to compress, decompress."}, {"time": 1753, "text": "Especially, I'll wake up, do a lot of work in the morning, and then I kind of have to just let that settle before I'm ready for all my meetings."}, {"time": 1760, "text": "And then on the way home, it's a great time to sort of let that settle."}, {"time": 1764, "text": "You lead a large group of people."}, {"time": 1771, "text": "Is there days where you're like, oh shit, I gotta get to work in an hour?"}, {"time": 1776, "text": "Like, I mean, is there a tension there?"}, {"time": 1785, "text": "And like, if we look at the grand scheme of things, just like you said, long term, that meeting probably doesn't matter."}, {"time": 1791, "text": "Like, you can always say, I'll just, I'll run and let the meeting happen, how it happens."}, {"time": 1797, "text": "Like, what, how do you, that zen, how do you, what do you do with that tension between the real world saying urgently, you need to be there, this is important, everything is melting down, how are we gonna fix this robot?"}, {"time": 1811, "text": "There's this critical meeting, and then there's this, the zen beauty of just running, the simplicity of it, you along with nature."}, {"time": 1821, "text": "What do you do with that?"}, {"time": 1822, "text": "I would say I'm not a fast runner, particularly."}, {"time": 1825, "text": "Probably my fastest splits ever was when I had to get to daycare on time because they were gonna charge me, you know, some dollar per minute that I was late."}, {"time": 1833, "text": "I've run some fast splits to daycare."}, {"time": 1836, "text": "But those times are past now."}, {"time": 1841, "text": "I think work, you can find a work life balance in that way."}, {"time": 1844, "text": "I think you just have to."}, {"time": 1847, "text": "I think I am better at work because I take time to think on the way in."}, {"time": 1852, "text": "So I plan my day around it, and I rarely feel that those are really at odds."}, {"time": 1860, "text": "So what, the bucket list item."}, {"time": 1863, "text": "If we're talking 12 times two, or approaching a marathon, what, have you run an ultra marathon before?"}, {"time": 1875, "text": "Do you do races?"}, {"time": 1876, "text": "Is there, what's a... Not to win."}, {"time": 1881, "text": "I'm not gonna like take a dinghy across the Atlantic or something if that's what you want."}, {"time": 1884, "text": "But if someone does and wants to write a book, I would totally read it because I'm a sucker for that kind of thing."}, {"time": 1891, "text": "No, I do have some fun things that I will try."}, {"time": 1893, "text": "You know, I like to, when I travel, I almost always bike to Logan Airport and fold up a little folding bike and then take it with me and bike to wherever I'm going."}, {"time": 1901, "text": "And it's taken me, or I'll take a stand up paddle board these days on the airplane, and then I'll try to paddle around where I'm going or whatever."}, {"time": 1907, "text": "And I've done some crazy things, but..."}, {"time": 1910, "text": "But not for the, you know, I now talk, I don't know if you know who David Goggins is by any chance."}, {"time": 1917, "text": "Not well, but yeah."}, {"time": 1918, "text": "But I talk to him now every day."}, {"time": 1920, "text": "So he's the person who made me do this stupid challenge."}, {"time": 1925, "text": "So he's insane and he does things for the purpose in the best kind of way."}, {"time": 1931, "text": "He does things like for the explicit purpose of suffering."}, {"time": 1936, "text": "Like he picks the thing that, like whatever he thinks he can do, he does more."}, {"time": 1942, "text": "So is that, do you have that thing in you or are you..."}, {"time": 1947, "text": "I think it's become the opposite."}, {"time": 1950, "text": "So you're like that dynamical system that the walker, the efficient... Yeah, it's leave no pain, right?"}, {"time": 1958, "text": "You should end feeling better than you started."}, {"time": 1961, "text": "But it's mostly, I think, and COVID has tested this because I've lost my commute."}, {"time": 1967, "text": "I think I'm perfectly happy walking around town with my wife and kids if they could get them to go."}, {"time": 1975, "text": "And it's more about just getting outside and getting away from the keyboard for some time just to let things compress."}, {"time": 1982, "text": "Let's go into robotics a little bit."}, {"time": 1984, "text": "What to use the most beautiful idea in robotics?"}, {"time": 1987, "text": "Whether we're talking about control or whether we're talking about optimization and the math side of things or the engineering side of things or the philosophical side of things."}, {"time": 2000, "text": "I think I've been lucky to experience something that not so many roboticists have experienced, which is to hang out with some really amazing control theorists."}, {"time": 2014, "text": "And the clarity of thought that some of the more mathematical control theory can bring to even very complex, messy looking problems is really, it really had a big impact on me and I had a day even just a couple of weeks ago where I had spent the day on a Zoom robotics conference having great conversations with lots of people."}, {"time": 2044, "text": "Felt really good about the ideas that were flowing and the like."}, {"time": 2049, "text": "And then I had a late afternoon meeting with one of my favorite control theorists and we went from these abstract discussions about maybes and what ifs and what a great idea to these super precise statements about systems that aren't that much more simple or abstract than the ones I care about deeply."}, {"time": 2078, "text": "And the contrast of that is, I don't know, it really gets me."}, {"time": 2083, "text": "I think people underestimate maybe the power of clear thinking."}, {"time": 2091, "text": "And so for instance, deep learning is amazing."}, {"time": 2098, "text": "I use it heavily in our work."}, {"time": 2100, "text": "I think it's changed the world, unquestionable."}, {"time": 2104, "text": "It makes it easy to get things to work without thinking as critically about it."}, {"time": 2108, "text": "So I think one of the challenges as an educator is to think about how do we make sure people get a taste of the more rigorous thinking that I think goes along with some different approaches."}, {"time": 2122, "text": "Yeah, so that's really interesting."}, {"time": 2124, "text": "So understanding like the fundamentals, the first principles of the problem, where in this case it's mechanics, like how a thing moves, how a thing behaves, like all the forces involved, like really getting a deep understanding of that."}, {"time": 2142, "text": "I mean, from physics, the first principle thing come from physics, and here it's literally physics."}, {"time": 2150, "text": "Yeah, and this applies, in deep learning, this applies to not just, I mean, it applies so cleanly in robotics, but it also applies to just in any data set."}, {"time": 2161, "text": "I find this true, I mean, driving as well."}, {"time": 2165, "text": "There's a lot of folks in that work on autonomous vehicles that work on autonomous vehicles that don't study driving, like deeply."}, {"time": 2180, "text": "I might be coming a little bit from the psychology side, but I remember I spent a ridiculous number of hours at lunch, at this like lawn chair, and I would sit somewhere in MIT's campus, there's a few interesting intersections, and we'd just watch people cross."}, {"time": 2199, "text": "So we were studying pedestrian behavior, and I felt like, as we record a lot of video, to try, and then there's the computer vision extracts their movement, how they move their head, and so on, but like every time, I felt like I didn't understand enough."}, {"time": 2215, "text": "I just, I felt like I wasn't understanding what, how are people signaling to each other, what are they thinking, how cognizant are they of their fear of death?"}, {"time": 2227, "text": "Like, what's the underlying game theory here?"}, {"time": 2231, "text": "What are the incentives?"}, {"time": 2234, "text": "And then I finally found a live stream of an intersection that's like high def that I just, I would watch so I wouldn't have to sit out there."}, {"time": 2241, "text": "But it's interesting, so like, I feel."}, {"time": 2243, "text": "But that's tough, that's a tough example, because I mean, the learning."}, {"time": 2247, "text": "Humans are involved."}, {"time": 2248, "text": "Not just because human, but I think the learning mantra is that basically the statistics of the data will tell me things I need to know, right?"}, {"time": 2257, "text": "And, you know, for the example you gave of all the nuances of, you know, eye contact, or hand gestures, or whatever that are happening for these subtle interactions between pedestrians and traffic, right?"}, {"time": 2271, "text": "Maybe the data will tell that story."}, {"time": 2274, "text": "I maybe even, one level more meta than what you're saying."}, {"time": 2281, "text": "For a particular problem, I think it might be the case that data should tell us the story."}, {"time": 2287, "text": "But I think there's a rigorous thinking that is just an essential skill for a mathematician or an engineer that I just don't wanna lose it."}, {"time": 2298, "text": "There are certainly super rigorous control, or sorry, machine learning people."}, {"time": 2304, "text": "I just think deep learning makes it so easy to do some things that our next generation, are not immediately rewarded for going through some of the more rigorous approaches."}, {"time": 2318, "text": "And then I wonder where that takes us."}, {"time": 2320, "text": "Well, I'm actually optimistic about it."}, {"time": 2322, "text": "I just want to do my part to try to steer that rigorous thinking."}, {"time": 2328, "text": "So there's like two questions I wanna ask."}, {"time": 2330, "text": "Do you have sort of a good example of rigorous thinking where it's easy to get lazy and not do the rigorous thinking?"}, {"time": 2340, "text": "And the other question I have is like, do you have advice of how to practice rigorous thinking in all the computer science disciplines that we've mentioned?"}, {"time": 2356, "text": "Yeah, I mean, there are times where problems that can be solved with well known mature methods could also be solved with a deep learning approach."}, {"time": 2370, "text": "And there's an argument that you must use learning even for the parts we already think we know, because if the human has touched it, then you've biased the system and you've suddenly put a bottleneck in there that is your own mental model."}, {"time": 2386, "text": "But something like converting a matrix, I think we know how to do that pretty well, even if it's a pretty big matrix, and we understand that pretty well."}, {"time": 2393, "text": "And you could train a deep network to do it, but you shouldn't probably."}, {"time": 2397, "text": "So in that sense, rigorous thinking is understanding the scope and the limitations of the methods that we have, like how to use the tools of mathematics properly."}, {"time": 2410, "text": "Yeah, I think taking a class on analysis is all I'm sort of arguing is to take a chance to stop and force yourself to think rigorously about even the rational numbers or something."}, {"time": 2425, "text": "It doesn't have to be the end all problem."}, {"time": 2427, "text": "But that exercise of clear thinking, I think goes a long way, and I just wanna make sure we keep preaching it."}, {"time": 2435, "text": "We don't lose it."}, {"time": 2436, "text": "But do you think when you're doing rigorous thinking or maybe trying to write down equations or sort of explicitly formally describe a system, do you think we naturally simplify things too much?"}, {"time": 2451, "text": "Is that a danger you run into?"}, {"time": 2453, "text": "Like in order to be able to understand something about the system mathematically, we make it too much of a toy example."}, {"time": 2461, "text": "But I think that's the good stuff, right?"}, {"time": 2464, "text": "That's how you understand the fundamentals?"}, {"time": 2467, "text": "I think maybe even that's a key to intelligence or something, but I mean, okay, what if Newton and Galileo had deep learning?"}, {"time": 2475, "text": "And they had done a bunch of experiments and they told the world, here's your weights of your neural network."}, {"time": 2482, "text": "We've solved the problem."}, {"time": 2484, "text": "Where would we be today?"}, {"time": 2485, "text": "I don't think we'd be as far as we are."}, {"time": 2488, "text": "There's something to be said about having the simplest explanation for a phenomenon."}, {"time": 2492, "text": "So I don't doubt that we can train neural networks to predict even physical F equals MA type equations."}, {"time": 2506, "text": "But I maybe, I want another Newton to come along because I think there's more to do in terms of coming up with the simple models for more complicated tasks."}, {"time": 2519, "text": "Yeah, let's not offend AI systems from 50 years from now that are listening to this that are probably better at, might be better coming up with F equals MA equations themselves."}, {"time": 2533, "text": "So sorry, I actually think learning is probably a route to achieving this, but the representation matters, right?"}, {"time": 2541, "text": "And I think having a function that takes my inputs to outputs that is arbitrarily complex may not be the end goal."}, {"time": 2550, "text": "I think there's still the most simple or parsimonious explanation for the data."}, {"time": 2557, "text": "Simple doesn't mean low dimensional."}, {"time": 2559, "text": "That's one thing I think that we've, a lesson that we've learned."}, {"time": 2561, "text": "So a standard way to do model reduction or system identification and controls is the typical formulation is that you try to find the minimal state dimension realization of a system that hits some error bounds or something like that."}, {"time": 2577, "text": "And that's maybe not, I think we're learning that state dimension is not the right metric."}, {"time": 2587, "text": "But for me, I think a lot about contact, the mechanics of contact, if a robot hand is picking up an object or something."}, {"time": 2594, "text": "And when I write down the equations of motion for that, they look incredibly complex, not because, actually not so much because of the dynamics of the hand when it's moving, but it's just the interactions and when they turn on and off, right?"}, {"time": 2610, "text": "So having a high dimensional, but simple description of what's happening out here is fine."}, {"time": 2616, "text": "But if when I actually start touching, if I write down a different dynamical system for every polygon on my robot hand and every polygon on the object, whether it's in contact or not, with all the combinatorics that explodes there, then that's too complex."}, {"time": 2634, "text": "So I need to somehow summarize that with a more intuitive physics way of thinking."}, {"time": 2641, "text": "And yeah, I'm very optimistic that machine learning will get us there."}, {"time": 2645, "text": "First of all, I mean, I'll probably do it in the introduction, but you're one of the great robotics people at MIT."}, {"time": 2652, "text": "You're a professor at MIT."}, {"time": 2654, "text": "You've teach him a lot of amazing courses."}, {"time": 2656, "text": "You run a large group and you have a important history for MIT, I think, as being a part of the DARPA Robotics Challenge."}, {"time": 2666, "text": "Can you maybe first say, what is the DARPA Robotics Challenge and then tell your story around it, your journey with it?"}, {"time": 2679, "text": "So the DARPA Robotics Challenge, it came on the tails of the DARPA Grand Challenge and DARPA Urban Challenge, which were the challenges that brought us, put a spotlight on self driving cars."}, {"time": 2695, "text": "Gil Pratt was at DARPA and pitched a new challenge that involved disaster response."}, {"time": 2704, "text": "It didn't explicitly require humanoids, although humanoids came into the picture."}, {"time": 2710, "text": "This happened shortly after the Fukushima disaster in Japan and our challenge was motivated roughly by that because that was a case where if we had had robots that were ready to be sent in, there's a chance that we could have averted disaster."}, {"time": 2726, "text": "And certainly after the, in the disaster response, there were times we would have loved to have sent robots in."}, {"time": 2734, "text": "So in practice, what we ended up with was a grand challenge, a DARPA Robotics Challenge, where Boston Dynamics was to make humanoid robots."}, {"time": 2748, "text": "People like me and the amazing team at MIT were competing first in a simulation challenge to try to be one of the ones that wins the right to work on one of the Boston Dynamics humanoids in order to compete in the final challenge, which was a physical challenge."}, {"time": 2768, "text": "And at that point, it was already, so it was decided as humanoid robots early on."}, {"time": 2773, "text": "There were two tracks."}, {"time": 2775, "text": "You could enter as a hardware team where you brought your own robot, or you could enter through the virtual robotics challenge as a software team that would try to win the right to use one of the Boston Dynamics robots."}, {"time": 2785, "text": "Sure, called Atlas."}, {"time": 2787, "text": "Atlas."}, {"time": 2788, "text": "Humanoid robots."}, {"time": 2789, "text": "Yeah, it was a 400 pound Marvel, but a pretty big, scary looking robot."}, {"time": 2795, "text": "Expensive too."}, {"time": 2796, "text": "Expensive, yeah."}, {"time": 2798, "text": "Okay, so I mean, how did you feel at the prospect of this kind of challenge?"}, {"time": 2804, "text": "I mean, it seems autonomous vehicles, yeah, I guess that sounds hard, but not really from a robotics perspective."}, {"time": 2813, "text": "It's like, didn't they do it in the 80s is the kind of feeling I would have, like when you first look at the problem, it's on wheels, but like humanoid robots, that sounds really hard."}, {"time": 2827, "text": "So what are your, psychologically speaking, what were you feeling, excited, scared?"}, {"time": 2835, "text": "Why the heck did you get yourself involved in this kind of messy challenge?"}, {"time": 2868, "text": "The challenge could have really highlighted perception and autonomous planning, or it ended up that locomoting over complex terrain played a pretty big role in the competition."}, {"time": 2883, "text": "So... And the degree of autonomy wasn't clear."}, {"time": 2888, "text": "The degree of autonomy was always a central part of the discussion."}, {"time": 2891, "text": "So what wasn't clear was how we would be able, how far we'd be able to get with it."}, {"time": 2897, "text": "So the idea was always that you want semi autonomy, that you want the robot to have enough compute that you can have a degraded network link to a human."}, {"time": 2907, "text": "And so the same way we had degraded networks at many natural disasters, you'd send your robot in, you'd be able to get a few bits back and forth, but you don't get to have enough potentially to fully operate the robot in every joint of the robot."}, {"time": 2924, "text": "So, and then the question was, and the gamesmanship of the organizers was to figure out what we're capable of, push us as far as we could, so that it would differentiate the teams that put more autonomy on the robot and had a few clicks and just said, go there, do this, go there, do this, versus someone who's picking every footstep or something like that."}, {"time": 2945, "text": "So what were some memories, painful, triumphant from the experience?"}, {"time": 2953, "text": "Like what was that journey?"}, {"time": 2955, "text": "Maybe if you can dig in a little deeper, maybe even on the technical side, on the team side, that whole process of, from the early idea stages to actually competing."}, {"time": 2968, "text": "I mean, this was a defining experience for me."}, {"time": 2971, "text": "It came at the right time for me in my career."}, {"time": 2973, "text": "I had gotten tenure before I was due a sabbatical, and most people do something relaxing and restorative for a sabbatical."}, {"time": 2981, "text": "So you got tenure before this?"}, {"time": 2986, "text": "It was a good time for me."}, {"time": 2988, "text": "We had a bunch of algorithms that we were very happy with."}, {"time": 2990, "text": "We wanted to see how far we could push them, and this was a chance to really test our mettle to do more proper software engineering."}, {"time": 2996, "text": "So the team, we all just worked our butts off."}, {"time": 3001, "text": "We were in that lab almost all the time."}, {"time": 3007, "text": "Okay, so there were some, of course, high highs and low lows throughout that."}, {"time": 3012, "text": "Anytime you're not sleeping and devoting your life to a 400 pound humanoid."}, {"time": 3018, "text": "I remember actually one funny moment where we're all super tired, and so Atlas had to walk across cinder blocks."}, {"time": 3024, "text": "That was one of the obstacles."}, {"time": 3026, "text": "And I remember Atlas was powered down and hanging limp on its harness, and the humans were there picking up and laying the brick down so that the robot could walk over it."}, {"time": 3036, "text": "And I thought, what is wrong with this?"}, {"time": 3038, "text": "We've got a robot just watching us do all the manual labor so that it can take its little stroll across the train."}, {"time": 3047, "text": "But I mean, even the virtual robotics challenge was super nerve wracking and dramatic."}, {"time": 3054, "text": "I remember, so we were using Gazebo as a simulator on the cloud, and there was all these interesting challenges."}, {"time": 3063, "text": "I think the investment that OSR FC, whatever they were called at that time, Brian Gerkey's team at Open Source Robotics, they were pushing on the capabilities of Gazebo in order to scale it to the complexity of these challenges."}, {"time": 3080, "text": "So, you know, up to the virtual competition."}, {"time": 3083, "text": "So the virtual competition was, you will sign on at a certain time and we'll have a network connection to another machine on the cloud that is running the simulator of your robot."}, {"time": 3094, "text": "And your controller will run on this computer and the physics will run on the other and you have to connect."}, {"time": 3103, "text": "Now, the physics, they wanted it to run at real time rates because there was an element of human interaction."}, {"time": 3110, "text": "And humans, if you do want to teleop, it works way better if it's at frame rate."}, {"time": 3117, "text": "But it was very hard to simulate these complex scenes at real time rate."}, {"time": 3123, "text": "So right up to like days before the competition, the simulator wasn't quite at real time rate."}, {"time": 3131, "text": "And that was great for me because my controller was solving a pretty big optimization problem and it wasn't quite at real time rate."}, {"time": 3137, "text": "So I was fine."}, {"time": 3138, "text": "I was keeping up with the simulator."}, {"time": 3140, "text": "We were both running at about 0.7."}, {"time": 3142, "text": "And I remember getting this email."}, {"time": 3144, "text": "And by the way, the perception folks on our team hated that they knew that if my controller was too slow, the robot was gonna fall down."}, {"time": 3152, "text": "And no matter how good their perception system was, if I can't make my controller fast."}, {"time": 3156, "text": "Anyways, we get this email like three days before the virtual competition."}, {"time": 3160, "text": "It's for all the marbles."}, {"time": 3161, "text": "We're gonna either get a humanoid robot or we're not."}, {"time": 3164, "text": "And we get an email saying, good news, we made the robot, the simulator faster."}, {"time": 3168, "text": "It's now at one point."}, {"time": 3170, "text": "And I was just like, oh man, what are we gonna do here?"}, {"time": 3174, "text": "So that came in late at night for me."}, {"time": 3179, "text": "A few days ahead."}, {"time": 3181, "text": "I went over, it happened at Frank Permenter, who's a very, very sharp."}, {"time": 3186, "text": "He was a student at the time working on optimization."}, {"time": 3191, "text": "He was still in lab."}, {"time": 3193, "text": "Frank, we need to make the quadratic programming solver faster, not like a little faster."}, {"time": 3198, "text": "It's actually, you know, and we wrote a new solver for that QP together that night."}, {"time": 3208, "text": "It was terrifying."}, {"time": 3209, "text": "So there's a really hard optimization problem that you're constantly solving."}, {"time": 3214, "text": "You didn't make the optimization problem simpler?"}, {"time": 3216, "text": "You wrote a new solver?"}, {"time": 3218, "text": "So, I mean, your observation is almost spot on."}, {"time": 3222, "text": "What we did was what everybody, I mean, people know how to do this, but we had not yet done this idea of warm starting."}, {"time": 3229, "text": "So we are solving a big optimization problem at every time step."}, {"time": 3232, "text": "But if you're running fast enough, the optimization problem you're solving on the last time step is pretty similar to the optimization you're gonna solve with the next."}, {"time": 3240, "text": "We had course had told our commercial solver to use warm starting, but even the interface to that commercial solver was causing us these delays."}, {"time": 3249, "text": "So what we did was we basically wrote, we called it fast QP at the time."}, {"time": 3255, "text": "We wrote a very lightweight, very fast layer, which would basically check if nearby solutions to the quadratic program were, which were very easily checked, could stabilize the robot."}, {"time": 3268, "text": "And if they couldn't, we would fall back to the solver."}, {"time": 3270, "text": "You couldn't really test this well, right?"}, {"time": 3273, "text": "I mean, so we always knew that if we fell back to, if we, it got to the point where if for some reason things slowed down and we fell back to the original solver, the robot would actually literally fall down."}, {"time": 3286, "text": "So it was a harrowing sort of edge we were, ledge we were sort of on."}, {"time": 3291, "text": "But I mean, it actually, like the 400 pound human could come crashing to the ground if your solver's not fast enough."}, {"time": 3298, "text": "But you know, we had lots of good experiences."}, {"time": 3301, "text": "So can I ask you a weird question I get about idea of hard work?"}, {"time": 3309, "text": "So actually people, like students of yours that I've interacted with and just, and robotics people in general, but they have moments, at moments have worked harder than most people I know in terms of, if you look at different disciplines of how hard people work."}, {"time": 3332, "text": "But they're also like the happiest."}, {"time": 3334, "text": "Like, just like, I don't know."}, {"time": 3337, "text": "It's the same thing with like running."}, {"time": 3339, "text": "People that push themselves to like the limit, they also seem to be like the most like full of life somehow."}, {"time": 3346, "text": "And I get often criticized like, you're not getting enough sleep."}, {"time": 3350, "text": "What are you doing to your body?"}, {"time": 3352, "text": "Blah, blah, blah, like this kind of stuff."}, {"time": 3354, "text": "And I usually just kind of respond like, I'm doing what I love."}, {"time": 3359, "text": "I'm passionate about it."}, {"time": 3361, "text": "I feel like it's, it's invigorating."}, {"time": 3364, "text": "I actually think, I don't think the lack of sleep is what hurts you."}, {"time": 3368, "text": "I think what hurts you is stress and lack of doing things that you're passionate about."}, {"time": 3373, "text": "But in this world, yeah, I mean, can you comment about why the heck robotics people are willing to push themselves to that degree?"}, {"time": 3386, "text": "Is there value in that?"}, {"time": 3387, "text": "And why are they so happy?"}, {"time": 3390, "text": "I think, I think you got it right."}, {"time": 3391, "text": "I mean, I think the causality is not that we work hard."}, {"time": 3396, "text": "And I think other disciplines work very hard too, but it's, I don't think it's that we work hard and therefore we are happy."}, {"time": 3403, "text": "I think we found something that we're truly passionate about."}, {"time": 3408, "text": "It makes us very happy."}, {"time": 3409, "text": "And then we get a little involved with it and spend a lot of time on it."}, {"time": 3414, "text": "What a luxury to have something that you wanna spend all your time on, right?"}, {"time": 3419, "text": "We could talk about this for many hours, but maybe if we could pick, is there something on the technical side on the approach that you took that's interesting that turned out to be a terrible failure or a success that you carry into your work today about all the different ideas that were involved in making, whether in the simulation or in the real world, making this semi autonomous system work?"}, {"time": 3445, "text": "I mean, it really did teach me something fundamental about what it's gonna take to get robustness out of a system of this complexity."}, {"time": 3455, "text": "I would say the DARPA challenge really was foundational in my thinking."}, {"time": 3461, "text": "I think the autonomous driving community thinks about this."}, {"time": 3463, "text": "I think lots of people thinking about safety critical systems that might have machine learning in the loop are thinking about these questions."}, {"time": 3470, "text": "For me, the DARPA challenge was the moment where I realized we've spent every waking minute running this robot."}, {"time": 3478, "text": "And again, for the physical competition, days before the competition, we saw the robot fall down in a way it had never fallen down before."}, {"time": 3485, "text": "I thought, how could we have found that?"}, {"time": 3490, "text": "We only have one robot, it's running almost all the time."}, {"time": 3493, "text": "We just didn't have enough hours in the day to test that robot."}, {"time": 3497, "text": "Something has to change, right?"}, {"time": 3499, "text": "And then I think that, I mean, I would say that the team that won was, from KAIST, was the team that had two robots and was able to do not only incredible engineering, just absolutely top rate engineering, but also they were able to test at a rate and discipline that we didn't keep up with."}, {"time": 3519, "text": "What does testing look like?"}, {"time": 3522, "text": "Like, what's a loop of tests?"}, {"time": 3525, "text": "Like from start to finish, what is a loop of testing?"}, {"time": 3528, "text": "Yeah, I mean, I think there's a whole philosophy to testing."}, {"time": 3531, "text": "There's the unit tests, and you can do that on a hardware, you can do that in a small piece of code."}, {"time": 3536, "text": "You write one function, you should write a test that checks that function's input and outputs."}, {"time": 3540, "text": "You should also write an integration test at the other extreme of running the whole system together, where they try to turn on all of the different functions that you think are correct."}, {"time": 3551, "text": "It's much harder to write the specifications for a system level test, especially if that system is as complicated as a humanoid robot."}, {"time": 3558, "text": "But the philosophy is sort of the same."}, {"time": 3561, "text": "On the real robot, it's no different, but on a real robot, it's impossible to run the same experiment twice."}, {"time": 3568, "text": "So if you see a failure, you hope you caught something in the logs that tell you what happened, but you'd probably never be able to run exactly that experiment again."}, {"time": 3579, "text": "And right now, I think our philosophy is just, basically Monte Carlo estimation, is just run as many experiments as we can, maybe try to set up the environment to make the things we are worried about happen as often as possible."}, {"time": 3599, "text": "But really we're relying on somewhat random search in order to test."}, {"time": 3604, "text": "Maybe that's all we'll ever be able to, but I think, you know, cause there's an argument that the things that'll get you are the things that are really nuanced in the world."}, {"time": 3614, "text": "And there'd be very hard to, for instance, put back in a simulation."}, {"time": 3616, "text": "Yeah, I guess the edge cases."}, {"time": 3619, "text": "What was the hardest thing?"}, {"time": 3621, "text": "Like, so you said walking over rough terrain, like just taking footsteps."}, {"time": 3627, "text": "I mean, people, it's so dramatic and painful in a certain kind of way to watch these videos from the DRC of robots falling."}, {"time": 3638, "text": "It's just so heartbreaking."}, {"time": 3640, "text": "Maybe it's because for me at least, we anthropomorphize the robot."}, {"time": 3645, "text": "Of course, it's also funny for some reason, like humans falling is funny for, I don't, it's some dark reason."}, {"time": 3653, "text": "I'm not sure why it is so, but it's also like tragic and painful."}, {"time": 3657, "text": "And so speaking of which, I mean, what made the robots fall and fail in your view?"}, {"time": 3665, "text": "So I can tell you exactly what happened on our, we, I contributed one of those."}, {"time": 3668, "text": "Our team contributed one of those spectacular falls."}, {"time": 3670, "text": "Every one of those falls has a complicated story."}, {"time": 3675, "text": "I mean, at one time, the power effectively went out on the robot because it had been sitting at the door waiting for a green light to be able to proceed and its batteries, you know, and therefore it just fell backwards and smashed its head against the ground."}, {"time": 3689, "text": "And it was hilarious, but it wasn't because of bad software, right?"}, {"time": 3694, "text": "But for ours, so the hardest part of the challenge, the hardest task in my view was getting out of the Polaris."}, {"time": 3700, "text": "It was actually relatively easy to drive the Polaris."}, {"time": 3703, "text": "Can you tell the story?"}, {"time": 3705, "text": "The story of the car."}, {"time": 3710, "text": "People should watch this video."}, {"time": 3711, "text": "I mean, the thing you've come up with is just brilliant, but anyway, sorry, what's... Yeah, we kind of joke."}, {"time": 3716, "text": "We call it the big robot, little car problem because somehow the race organizers decided to give us a 400 pound humanoid."}, {"time": 3725, "text": "And then they also provided the vehicle, which was a little Polaris."}, {"time": 3728, "text": "And the robot didn't really fit in the car."}, {"time": 3731, "text": "So you couldn't drive the car with your feet under the steering column."}, {"time": 3735, "text": "We actually had to straddle the main column of the, and have basically one foot in the passenger seat, one foot in the driver's seat, and then drive with our left hand."}, {"time": 3748, "text": "But the hard part was we had to then park the car, get out of the car."}, {"time": 3753, "text": "It didn't have a door, that was okay."}, {"time": 3754, "text": "But it's just getting up from crouched, from sitting, when you're in this very constrained environment."}, {"time": 3761, "text": "First of all, I remember after watching those videos, I was much more cognizant of how hard it is for me to get in and out of the car, and out of the car, especially."}, {"time": 3771, "text": "It's actually a really difficult control problem."}, {"time": 3775, "text": "I'm very cognizant of it when I'm like injured for whatever reason."}, {"time": 3779, "text": "Oh, that's really hard."}, {"time": 3781, "text": "So how did you approach this problem?"}, {"time": 3783, "text": "So we had, you think of NASA's operations, and they have these checklists, prelaunched checklists and the like."}, {"time": 3791, "text": "We weren't far off from that."}, {"time": 3792, "text": "We had this big checklist."}, {"time": 3793, "text": "And on the first day of the competition, we were running down our checklist."}, {"time": 3797, "text": "And one of the things we had to do, we had to turn off the controller, the piece of software that was running that would drive the left foot of the robot in order to accelerate on the gas."}, {"time": 3808, "text": "And then we turned on our balancing controller."}, {"time": 3810, "text": "And the nerves, jitters of the first day of the competition, someone forgot to check that box and turn that controller off."}, {"time": 3817, "text": "So we used a lot of motion planning to figure out a sort of configuration of the robot that we could get up and over."}, {"time": 3827, "text": "We relied heavily on our balancing controller."}, {"time": 3830, "text": "And basically, when the robot was in one of its most precarious sort of configurations, trying to sneak its big leg out of the side, the other controller that thought it was still driving told its left foot to go like this."}, {"time": 3846, "text": "And that wasn't good."}, {"time": 3851, "text": "But it turned disastrous for us because what happened was a little bit of push here."}, {"time": 3856, "text": "Actually, we have videos of us running into the robot with a 10 foot pole and it kind of will recover."}, {"time": 3864, "text": "But this is a case where there's no space to recover."}, {"time": 3867, "text": "So a lot of our secondary balancing mechanisms about like take a step to recover, they were all disabled because we were in the car and there was no place to step."}, {"time": 3875, "text": "So we were relying on our just lowest level reflexes."}, {"time": 3878, "text": "And even then, I think just hitting the foot on the seat, on the floor, we probably could have recovered from it."}, {"time": 3884, "text": "But the thing that was bad that happened is when we did that and we jostled a little bit, the tailbone of our robot was only a little off the seat, it hit the seat."}, {"time": 3895, "text": "And the other foot came off the ground just a little bit."}, {"time": 3898, "text": "And nothing in our plans had ever told us what to do if your butt's on the seat and your feet are in the air."}, {"time": 3905, "text": "Feet in the air."}, {"time": 3906, "text": "And then the thing is once you get off the script, things can go very wrong because even our state estimation, our system that was trying to collect all the data from the sensors and understand what's happening with the robot, it didn't know about this situation."}, {"time": 3920, "text": "So it was predicting things that were just wrong."}, {"time": 3922, "text": "And then we did a violent shake and fell off in our face first out of the robot."}, {"time": 3929, "text": "But like into the destination."}, {"time": 3932, "text": "That's true, we fell in, we got our point for egress."}, {"time": 3936, "text": "But so is there any hope for, that's interesting, is there any hope for Atlas to be able to do something when it's just on its butt and feet in the air?"}, {"time": 3947, "text": "So you can, what do you?"}, {"time": 3948, "text": "No, so that is one of the big challenges."}, {"time": 3950, "text": "And I think it's still true, you know, Boston Dynamics and Antimal and there's this incredible work on legged robots happening around the world."}, {"time": 3964, "text": "Most of them still are very good at the case where you're making contact with the world at your feet."}, {"time": 3970, "text": "And they have typically point feet relatively, they have balls on their feet, for instance."}, {"time": 3974, "text": "If those robots get in a situation where the elbow hits the wall or something like this, that's a pretty different situation."}, {"time": 3981, "text": "Now they have layers of mechanisms that will make, I think the more mature solutions have ways in which the controller won't do stupid things."}, {"time": 3991, "text": "But a human, for instance, is able to leverage incidental contact in order to accomplish a goal."}, {"time": 3996, "text": "In fact, I might, if you push me, I might actually put my hand out and make a new brand new contact."}, {"time": 4002, "text": "The feet of the robot are doing this on quadrupeds, but we mostly in robotics are afraid of contact on the rest of our body, which is crazy."}, {"time": 4013, "text": "There's this whole field of motion planning, collision free motion planning."}, {"time": 4018, "text": "And we write very complex algorithms so that the robot can dance around and make sure it doesn't touch the world."}, {"time": 4025, "text": "So people are just afraid of contact because contact the scene is a difficult."}, {"time": 4029, "text": "It's still a difficult control problem and sensing problem."}, {"time": 4033, "text": "Now you're a serious person, I'm a little bit of an idiot and I'm going to ask you some dumb questions."}, {"time": 4044, "text": "So I do martial arts."}, {"time": 4047, "text": "So like jiu jitsu, I wrestled my whole life."}, {"time": 4050, "text": "So let me ask the question, like whenever people learn that I do any kind of AI or like I mentioned robots and things like that, they say, when are we going to have robots that can win in a wrestling match or in a fight against a human?"}, {"time": 4069, "text": "So we just mentioned sitting on your butt, if you're in the air, that's a common position."}, {"time": 4073, "text": "Jiu jitsu, when you're on the ground, you're a down opponent."}, {"time": 4079, "text": "Like how difficult do you think is the problem?"}, {"time": 4083, "text": "And when will we have a robot that can defeat a human in a wrestling match?"}, {"time": 4088, "text": "And we're talking about a lot, like, I don't know if you're familiar with wrestling, but essentially."}, {"time": 4095, "text": "Not very."}, {"time": 4096, "text": "It's basically the art of contact."}, {"time": 4099, "text": "It's like, it's because you're picking contact points and then using like leverage like to off balance to trick people, like you make them feel like you're doing one thing and then they change their balance and then you switch what you're doing and then results in a throw or whatever."}, {"time": 4124, "text": "So like, it's basically the art of multiple contacts."}, {"time": 4129, "text": "Awesome, that's a nice description of it."}, {"time": 4130, "text": "So there's also an opponent in there, right?"}, {"time": 4133, "text": "So if."}, {"time": 4134, "text": "Very dynamic."}, {"time": 4135, "text": "Right, if you are wrestling a human and are in a game theoretic situation with a human, that's still hard, but just to speak to the, you know, quickly reasoning about contact part of it, for instance."}, {"time": 4151, "text": "Yeah, maybe even throwing the game theory out of it, almost like, yeah, almost like a non dynamic opponent."}, {"time": 4157, "text": "Right, there's reasons to be optimistic, but I think our best understanding of those problems are still pretty hard."}, {"time": 4164, "text": "I have been increasingly focused on manipulation, partly where that's a case where the contact has to be much more rich."}, {"time": 4175, "text": "And there are some really impressive examples of deep learning policies, controllers that can appear to do good things through contact."}, {"time": 4187, "text": "We've even got new examples of, you know, deep learning models of predicting what's gonna happen to objects as they go through contact."}, {"time": 4196, "text": "But I think the challenge you just offered there still eludes us, right?"}, {"time": 4201, "text": "The ability to make a decision based on those models quickly."}, {"time": 4207, "text": "You know, I have to think though, it's hard for humans too, when you get that complicated."}, {"time": 4211, "text": "I think probably you had maybe a slow motion version of where you learned the basic skills and you've probably gotten better at it and there's much more subtle to you."}, {"time": 4224, "text": "But it might still be hard to actually, you know, really on the fly take a, you know, model of your humanoid and figure out how to plan the optimal sequence."}, {"time": 4235, "text": "That might be a problem we never solve."}, {"time": 4236, "text": "Well, the, I mean, one of the most amazing things to me about the, we can talk about martial arts."}, {"time": 4243, "text": "We could also talk about dancing."}, {"time": 4245, "text": "Doesn't really matter."}, {"time": 4246, "text": "Too human, I think it's the most interesting study of contact."}, {"time": 4251, "text": "It's not even the dynamic element of it."}, {"time": 4253, "text": "It's the, like when you get good at it, it's so effortless."}, {"time": 4258, "text": "Like I can just, I'm very cognizant of the entirety of the learning process being essentially like learning how to move my body in a way that I could throw very large weights around effortlessly, like, and I can feel the learning."}, {"time": 4278, "text": "Like I'm a huge believer in drilling of techniques and you can just like feel your, I don't, you're not feeling, you're feeling, sorry, you're learning it intellectually a little bit, but a lot of it is the body learning it somehow, like instinctually and whatever that learning is, that's really, I'm not even sure if that's equivalent to like a deep learning, learning a controller."}, {"time": 4304, "text": "I think it's something more, it feels like there's a lot of distributed learning going on."}, {"time": 4310, "text": "Yeah, I think there's hierarchy and composition probably in the systems that we don't capture very well yet."}, {"time": 4320, "text": "You have layers of control systems."}, {"time": 4322, "text": "You have reflexes at the bottom layer and you have a system that's capable of planning a vacation to some distant country, which is probably, you probably don't have a controller, a policy for every possible destination you'll ever pick."}, {"time": 4340, "text": "But there's something magical in the in between and how do you go from these low level feedback loops to something that feels like a pretty complex set of outcomes."}, {"time": 4352, "text": "You know, my guess is, I think there's evidence that you can plan at some of these levels, right?"}, {"time": 4357, "text": "So Josh Tenenbaum just showed it in his talk the other day."}, {"time": 4361, "text": "He's got a game he likes to talk about."}, {"time": 4363, "text": "I think he calls it the pick three game or something, where he puts a bunch of clutter down in front of a person and he says, okay, pick three objects."}, {"time": 4372, "text": "And it might be a telephone or a shoe or a Kleenex box or whatever."}, {"time": 4379, "text": "And apparently you pick three items and then you pick, he says, okay, pick the first one up with your right hand, the second one up with your left hand."}, {"time": 4386, "text": "Now using those objects, now as tools, pick up the third object."}, {"time": 4391, "text": "Right, so that's down at the level of physics and mechanics and contact mechanics that I think we do learning or we do have policies for, we do control for, almost feedback, but somehow we're able to still, I mean, I've never picked up a telephone with a shoe and a water bottle before."}, {"time": 4410, "text": "And somehow, and it takes me a little longer to do that the first time, but most of the time we can sort of figure that out."}, {"time": 4417, "text": "So yeah, I think the amazing thing is this ability to be flexible with our models, plan when we need to use our well oiled controllers when we don't, when we're in familiar territory."}, {"time": 4433, "text": "Having models, I think the other thing you just said was something about, I think your awareness of what's happening is even changing as you improve your expertise, right?"}, {"time": 4442, "text": "So maybe you have a very approximate model of the mechanics to begin with."}, {"time": 4446, "text": "And as you gain expertise, you get a more refined version of that model."}, {"time": 4451, "text": "You're aware of muscles or balance components that you just weren't even aware of before."}, {"time": 4459, "text": "So how do you scaffold that?"}, {"time": 4461, "text": "Yeah, plus the fear of injury, the ambition of goals, of excelling, and fear of mortality."}, {"time": 4472, "text": "Let's see, what else is in there?"}, {"time": 4473, "text": "As the motivations, overinflated ego in the beginning, and then a crash of confidence in the middle."}, {"time": 4482, "text": "All of those seem to be essential for the learning process."}, {"time": 4486, "text": "And if all that's good, then you're probably optimizing energy efficiency."}, {"time": 4490, "text": "Yeah, right, so we have to get that right."}, {"time": 4493, "text": "So there was this idea that you would have robots play soccer better than human players by 2050."}, {"time": 4503, "text": "That was the goal."}, {"time": 4505, "text": "Basically, it was the goal to beat world champion team, to become a world cup, beat like a world cup level team."}, {"time": 4513, "text": "So are we gonna see that first?"}, {"time": 4515, "text": "Or a robot, if you're familiar, there's an organization called UFC for mixed martial arts."}, {"time": 4523, "text": "Are we gonna see a world cup championship soccer team that have robots, or a UFC champion mixed martial artist as a robot?"}, {"time": 4533, "text": "I mean, it's very hard to say one thing is harder, some problem is harder than the other."}, {"time": 4538, "text": "What probably matters is who started the organization that, I mean, I think RoboCup has a pretty serious following, and there is a history now of people playing that game, learning about that game, building robots to play that game, building increasingly more human robots."}, {"time": 4555, "text": "It's got momentum."}, {"time": 4557, "text": "So if you want to have mixed martial arts compete, you better start your organization now, right?"}, {"time": 4565, "text": "I think almost independent of which problem is technically harder, because they're both hard and they're both different."}, {"time": 4572, "text": "I mean, those videos are just hilarious, like especially the humanoid robots trying to play soccer."}, {"time": 4581, "text": "I mean, they're kind of terrible right now."}, {"time": 4583, "text": "I mean, I guess there is robo sumo wrestling."}, {"time": 4586, "text": "There's like the robo one competitions, where they do have these robots that go on the table and basically fight."}, {"time": 4592, "text": "So maybe I'm wrong, maybe."}, {"time": 4593, "text": "First of all, do you have a year in mind for RoboCup, just from a robotics perspective?"}, {"time": 4599, "text": "Seems like a super exciting possibility that like in the physical space, this is what's interesting."}, {"time": 4607, "text": "I think the world is captivated."}, {"time": 4610, "text": "I think it's really exciting."}, {"time": 4612, "text": "It inspires just a huge number of people when a machine beats a human at a game that humans are really damn good at."}, {"time": 4623, "text": "So you're talking about chess and go, but that's in the world of digital."}, {"time": 4629, "text": "I don't think machines have beat humans at a game in the physical space yet, but that would be just."}, {"time": 4637, "text": "You have to make the rules very carefully, right?"}, {"time": 4640, "text": "I mean, if Atlas kicked me in the shins, I'm down and game over."}, {"time": 4645, "text": "So it's very subtle on what's fair."}, {"time": 4651, "text": "I think the fighting one is a weird one."}, {"time": 4653, "text": "Yeah, because you're talking about a machine that's much stronger than you."}, {"time": 4656, "text": "But yeah, in terms of soccer, basketball, all those kinds."}, {"time": 4659, "text": "Even soccer, right?"}, {"time": 4660, "text": "I mean, as soon as there's contact or whatever, and there are some things that the robot will do better."}, {"time": 4666, "text": "I think if you really set yourself up to try to see could robots win the game of soccer as the rules were written, the right thing for the robot to do is to play very differently than a human would play."}, {"time": 4679, "text": "You're not gonna get the perfect soccer player robot."}, {"time": 4684, "text": "You're gonna get something that exploits the rules, exploits its super actuators, its super low bandwidth feedback loops or whatever, and it's gonna play the game differently than you want it to play."}, {"time": 4697, "text": "And I bet there's ways, I bet there's loopholes, right?"}, {"time": 4701, "text": "We saw that in the DARPA challenge that it's very hard to write a set of rules that someone can't find a way to exploit."}, {"time": 4712, "text": "Let me ask another ridiculous question."}, {"time": 4715, "text": "I think this might be the last ridiculous question, but I doubt it."}, {"time": 4719, "text": "I aspire to ask as many ridiculous questions of a brilliant MIT professor."}, {"time": 4728, "text": "Okay, I don't know if you've seen the black mirror."}, {"time": 4733, "text": "It's funny, I never watched the episode."}, {"time": 4736, "text": "I know when it happened though, because I gave a talk to some MIT faculty one day on a unassuming Monday or whatever I was telling him about the state of robotics."}, {"time": 4748, "text": "And I showed some video from Boston Dynamics of the quadruped spot at the time."}, {"time": 4753, "text": "It was the early version of spot."}, {"time": 4755, "text": "And there was a look of horror that went across the room."}, {"time": 4759, "text": "And I said, I've shown videos like this a lot of times, what happened?"}, {"time": 4764, "text": "And it turns out that this video had gone, this black mirror episode had changed the way people watched the videos I was putting out."}, {"time": 4773, "text": "The way they see these kinds of robots."}, {"time": 4774, "text": "So I talked to so many people who are just terrified because of that episode probably of these kinds of robots."}, {"time": 4781, "text": "I almost wanna say that they almost enjoy being terrified."}, {"time": 4784, "text": "I don't even know what it is about human psychology that kind of imagine doomsday, the destruction of the universe or our society and kind of like enjoy being afraid."}, {"time": 4797, "text": "I don't wanna simplify it, but it feels like they talk about it so often."}, {"time": 4801, "text": "It almost, there does seem to be an addictive quality to it."}, {"time": 4806, "text": "I talked to a guy, a guy named Joe Rogan, who's kind of the flag bearer for being terrified at these robots."}, {"time": 4814, "text": "Do you have two questions?"}, {"time": 4817, "text": "One, do you have an understanding of why people are afraid of robots?"}, {"time": 4821, "text": "And the second question is in black mirror, just to tell you the episode, I don't even remember it that much anymore, but these robots, I think they can shoot like a pellet or something."}, {"time": 4832, "text": "They basically have, it's basically a spot with a gun."}, {"time": 4836, "text": "And how far are we away from having robots that go rogue like that?"}, {"time": 4844, "text": "Basically spot that goes rogue for some reason and somehow finds a gun."}, {"time": 4851, "text": "Right, so, I mean, I'm not a psychologist."}, {"time": 4856, "text": "I think, I don't know exactly why people react the way they do."}, {"time": 4861, "text": "I think we have to be careful about the way robots influence our society and the like."}, {"time": 4867, "text": "I think that's something, that's a responsibility that roboticists need to embrace."}, {"time": 4873, "text": "I don't think robots are gonna come after me with a kitchen knife or a pellet gun right away."}, {"time": 4878, "text": "And I mean, if they were programmed in such a way, but I used to joke with Atlas that all I had to do was run for five minutes and its battery would run out."}, {"time": 4888, "text": "But actually they've got to be careful and actually they've got a very big battery in there by the end."}, {"time": 4893, "text": "So it was over an hour."}, {"time": 4897, "text": "I think the fear is a bit cultural though."}, {"time": 4899, "text": "Cause I mean, you notice that, like, I think in my age, in the US, we grew up watching Terminator, right?"}, {"time": 4908, "text": "If I had grown up at the same time in Japan, I probably would have been watching Astro Boy."}, {"time": 4912, "text": "And there's a very different reaction to robots in different countries, right?"}, {"time": 4917, "text": "So I don't know if it's a human innate fear of metal marvels or if it's something that we've done to ourselves with our sci fi."}, {"time": 4929, "text": "Yeah, the stories we tell ourselves through movies, through just through popular media."}, {"time": 4936, "text": "But if I were to tell, you know, if you were my therapist and I said, I'm really terrified that we're going to have these robots very soon that will hurt us."}, {"time": 4950, "text": "Like, how do you approach making me feel better?"}, {"time": 4956, "text": "Like, why shouldn't people be afraid?"}, {"time": 4959, "text": "There's a, I think there's a video that went viral recently."}, {"time": 4964, "text": "Everything, everything was spot in Boston, which goes viral in general."}, {"time": 4968, "text": "But usually it's like really cool stuff."}, {"time": 4970, "text": "Like they're doing flips and stuff or like sad stuff, the Atlas being hit with a broomstick or something like that."}, {"time": 4977, "text": "But there's a video where I think one of the new productions bought robots, which are awesome."}, {"time": 4984, "text": "It was like patrolling somewhere in like in some country."}, {"time": 4988, "text": "And like people immediately were like saying like, this is like the dystopian future, like the surveillance state."}, {"time": 4996, "text": "For some reason, like you can just have a camera, like something about spot being able to walk on four feet with like really terrified people."}, {"time": 5005, "text": "So like, what do you say to those people?"}, {"time": 5011, "text": "I think there is a legitimate fear there because so much of our future is uncertain."}, {"time": 5017, "text": "But at the same time, technically speaking, it seems like we're not there yet."}, {"time": 5021, "text": "So what do you say?"}, {"time": 5022, "text": "I mean, I think technology is complicated."}, {"time": 5028, "text": "It can be used in many ways."}, {"time": 5029, "text": "I think there are purely software attacks that somebody could use to do great damage."}, {"time": 5039, "text": "Maybe they have already, you know, I think wheeled robots could be used in bad ways too."}, {"time": 5048, "text": "Drones."}, {"time": 5049, "text": "Drones, right, I don't think that, let's see."}, {"time": 5056, "text": "I don't want to be building technology just because I'm compelled to build technology and I don't think about it."}, {"time": 5063, "text": "But I would consider myself a technological optimist, I guess, in the sense that I think we should continue to create and evolve and our world will change."}, {"time": 5077, "text": "And if we will introduce new challenges, we'll screw something up maybe, but I think also we'll invent ourselves out of those challenges and life will go on."}, {"time": 5089, "text": "So it's interesting because you didn't mention like this is technically too hard."}, {"time": 5094, "text": "I don't think robots are, I think people attribute a robot that looks like an animal as maybe having a level of self awareness or consciousness or something that they don't have yet."}, {"time": 5105, "text": "Right, so it's not, I think our ability to anthropomorphize those robots is probably, we're assuming that they have a level of intelligence that they don't yet have."}, {"time": 5117, "text": "And that might be part of the fear."}, {"time": 5120, "text": "So in that sense, it's too hard."}, {"time": 5122, "text": "But, you know, there are many scary things in the world."}, {"time": 5125, "text": "Right, so I think we're right to ask those questions."}, {"time": 5129, "text": "We're right to think about the implications of our work."}, {"time": 5133, "text": "Right, in the short term as we're working on it for sure, is there something long term that scares you about our future with AI and robots?"}, {"time": 5147, "text": "A lot of folks from Elon Musk to Sam Harris to a lot of folks talk about the existential threats about artificial intelligence."}, {"time": 5158, "text": "Oftentimes, robots kind of inspire that the most because of the anthropomorphism."}, {"time": 5165, "text": "Do you have any fears?"}, {"time": 5167, "text": "It's an important question."}, {"time": 5172, "text": "I actually, I think I like Rod Brooks answer maybe the best on this, I think."}, {"time": 5177, "text": "And it's not the only answer he's given over the years, but maybe one of my favorites is he says, it's not gonna be, he's got a book, Flesh and Machines, I believe, it's not gonna be the robots versus the people, we're all gonna be robot people."}, {"time": 5194, "text": "Because, you know, we already have smartphones, some of us have serious technology implanted in our bodies already, whether we have a hearing aid or a pacemaker or anything like this, people with amputations might have prosthetics."}, {"time": 5210, "text": "And that's a trend I think that is likely to continue."}, {"time": 5217, "text": "I mean, this is now wild speculation."}, {"time": 5221, "text": "But I mean, when do we get to cognitive implants and the like, and."}, {"time": 5226, "text": "Yeah, with neural link, brain computer interfaces, that's interesting."}, {"time": 5230, "text": "So there's a dance between humans and robots that's going to be, it's going to be impossible to be scared of the other out there, the robot, because the robot will be part of us, essentially."}, {"time": 5246, "text": "It'd be so intricately sort of part of our society that."}, {"time": 5250, "text": "Yeah, and it might not even be implanted part of us, but just, it's so much a part of our, yeah, our society."}, {"time": 5257, "text": "So in that sense, the smartphone is already the robot we should be afraid of, yeah."}, {"time": 5261, "text": "I mean, yeah, and all the usual fears arise of the misinformation, the manipulation, all those kinds of things that, the problems are all the same."}, {"time": 5277, "text": "They're human problems, essentially, it feels like."}, {"time": 5280, "text": "Yeah, I mean, I think the way we interact with each other online is changing the value we put on, you know, personal interaction."}, {"time": 5288, "text": "And that's a crazy big change that's going to happen and rip through our, has already been ripping through our society, right?"}, {"time": 5294, "text": "And that has implications that are massive."}, {"time": 5298, "text": "I don't know if they should be scared of it or go with the flow, but I don't see, you know, some battle lines between humans and robots being the first thing to worry about."}, {"time": 5309, "text": "I mean, I do want to just, as a kind of comment, maybe you can comment about your just feelings about Boston Dynamics in general, but you know, I love science, I love engineering, I think there's so many beautiful ideas in it."}, {"time": 5322, "text": "And when I look at Boston Dynamics or legged robots in general, I think they inspire people, curiosity and feelings in general, excitement about engineering more than almost anything else in popular culture."}, {"time": 5340, "text": "And I think that's such an exciting, like responsibility and possibility for robotics."}, {"time": 5346, "text": "And Boston Dynamics is riding that wave pretty damn well."}, {"time": 5350, "text": "Like they found it, they've discovered that hunger and curiosity in the people and they're doing magic with it."}, {"time": 5357, "text": "I don't care if the, I mean, I guess is that their company, they have to make money, right?"}, {"time": 5361, "text": "But they're already doing incredible work and inspiring the world about technology."}, {"time": 5366, "text": "I mean, do you have thoughts about Boston Dynamics and maybe others, your own work in robotics and inspiring the world in that way?"}, {"time": 5376, "text": "I completely agree, I think Boston Dynamics is absolutely awesome."}, {"time": 5382, "text": "I think I show my kids those videos, you know, and the best thing that happens is sometimes they've already seen them, you know, right?"}, {"time": 5390, "text": "I think, I just think it's a pinnacle of success in robotics that is just one of the best things that's happened, absolutely completely agree."}, {"time": 5401, "text": "One of the heartbreaking things to me is how many robotics companies fail, how hard it is to make money with a robotics company."}, {"time": 5413, "text": "Like iRobot like went through hell just to arrive at a Roomba to figure out one product."}, {"time": 5419, "text": "And then there's so many home robotics companies like Jibo and Anki, Anki, the cutest toy that's a great robot I thought went down, I'm forgetting a bunch of them, but a bunch of robotics companies fail, Rod's company, Rethink Robotics."}, {"time": 5442, "text": "Like, do you have anything hopeful to say about the possibility of making money with robots?"}, {"time": 5450, "text": "Oh, I think you can't just look at the failures."}, {"time": 5454, "text": "I mean, Boston Dynamics is a success."}, {"time": 5455, "text": "There's lots of companies that are still doing amazingly good work in robotics."}, {"time": 5461, "text": "I mean, this is the capitalist ecology or something, right?"}, {"time": 5465, "text": "I think you have many companies, you have many startups and they push each other forward and many of them fail and some of them get through and that's sort of the natural way of those things."}, {"time": 5477, "text": "I don't know that is robotics really that much worse."}, {"time": 5480, "text": "I feel the pain that you feel too."}, {"time": 5482, "text": "Every time I read one of these, sometimes it's friends and I definitely wish it went better or went differently."}, {"time": 5493, "text": "But I think it's healthy and good to have bursts of ideas, bursts of activities, ideas, if they are really aggressive, they should fail sometimes."}, {"time": 5505, "text": "Certainly that's the research mantra, right?"}, {"time": 5506, "text": "If you're succeeding at every problem you attempt, then you're not choosing aggressively enough."}, {"time": 5513, "text": "Is it exciting to you, the new spot?"}, {"time": 5515, "text": "Oh, it's so good."}, {"time": 5517, "text": "When are you getting them as a pet or it?"}, {"time": 5520, "text": "Yeah, I mean, I have to dig up 75K right now."}, {"time": 5523, "text": "I mean, it's so cool that there's a price tag, you can go and then actually buy it."}, {"time": 5528, "text": "I have a Skydio R1, love it."}, {"time": 5531, "text": "So no, I would absolutely be a customer."}, {"time": 5538, "text": "I wonder what your kids would think about it."}, {"time": 5540, "text": "I actually, Zach from Boston Dynamics would let my kid drive in one of their demos one time."}, {"time": 5547, "text": "And that was just so good, so good."}, {"time": 5551, "text": "And again, I'll forever be grateful for that."}, {"time": 5554, "text": "And there's something magical about the anthropomorphization of that arm, it adds another level of human connection."}, {"time": 5562, "text": "I'm not sure we understand from a control aspect, the value of anthropomorphization."}, {"time": 5571, "text": "I think that's an understudied and under understood engineering problem."}, {"time": 5577, "text": "There's been a, like psychologists have been studying it."}, {"time": 5580, "text": "I think it's part like manipulating our mind to believe things is a valuable engineering."}, {"time": 5586, "text": "Like this is another degree of freedom that can be controlled."}, {"time": 5589, "text": "I like that, yeah, I think that's right."}, {"time": 5591, "text": "I think there's something that humans seem to do or maybe my dangerous introspection is, I think we are able to make very simple models that assume a lot about the world very quickly."}, {"time": 5607, "text": "And then it takes us a lot more time, like you're wrestling."}, {"time": 5611, "text": "You probably thought you knew what you were doing with wrestling and you were fairly functional as a complete wrestler."}, {"time": 5616, "text": "And then you slowly got more expertise."}, {"time": 5619, "text": "So maybe it's natural that our first level of defense against seeing a new robot is to think of it in our existing models of how humans and animals behave."}, {"time": 5632, "text": "And it's just, as you spend more time with it, then you'll develop more sophisticated models that will appreciate the differences."}, {"time": 5641, "text": "Can you say what does it take to control a robot?"}, {"time": 5645, "text": "Like what is the control problem of a robot?"}, {"time": 5648, "text": "And in general, what is a robot in your view?"}, {"time": 5650, "text": "Like how do you think of this system?"}, {"time": 5655, "text": "What is a robot?"}, {"time": 5657, "text": "I think robotics."}, {"time": 5658, "text": "I told you ridiculous questions."}, {"time": 5660, "text": "No, no, it's good."}, {"time": 5661, "text": "I mean, there's standard definitions of combining computation with some ability to do mechanical work."}, {"time": 5669, "text": "I think that gets us pretty close."}, {"time": 5670, "text": "But I think robotics has this problem that once things really work, we don't call them robots anymore."}, {"time": 5678, "text": "Like my dishwasher at home is pretty sophisticated, beautiful mechanisms."}, {"time": 5685, "text": "There's actually a pretty good computer, probably a couple of chips in there doing amazing things."}, {"time": 5689, "text": "We don't think of that as a robot anymore, which isn't fair."}, {"time": 5692, "text": "Because then what roughly it means that robotics always has to solve the next problem and doesn't get to celebrate its past successes."}, {"time": 5700, "text": "I mean, even factory room floor robots are super successful."}, {"time": 5708, "text": "But that's not the ones, I mean, people think of them as robots, but they don't, if you ask what are the successes of robotics, somehow it doesn't come to your mind immediately."}, {"time": 5717, "text": "So the definition of robot is a system with some level of automation that fails frequently."}, {"time": 5723, "text": "Something like, it's the computation plus mechanical work and an unsolved problem."}, {"time": 5730, "text": "It's an unsolved problem, yeah."}, {"time": 5732, "text": "So from a perspective of control and mechanics, dynamics, what is a robot?"}, {"time": 5740, "text": "So there are many different types of robots."}, {"time": 5742, "text": "The control that you need for a Jibo robot, you know, some robot that's sitting on your countertop and interacting with you, but not touching you, for instance, is very different than what you need for an autonomous car or an autonomous drone."}, {"time": 5759, "text": "It's very different than what you need for a robot that's gonna walk or pick things up with its hands, right?"}, {"time": 5764, "text": "My passion has always been for the places where you're interacting more, you're doing more dynamic interactions with the world."}, {"time": 5773, "text": "So walking, now manipulation."}, {"time": 5778, "text": "And the control problems there are beautiful."}, {"time": 5781, "text": "I think contact is one thing that differentiates them from many of the control problems we've solved classically, right, like modern control grew up stabilizing fighter jets that were passively unstable, and there's like amazing success stories from control all over the place."}, {"time": 5799, "text": "Power grid, I mean, there's all kinds of, it's everywhere that we don't even realize, just like AI is now."}, {"time": 5807, "text": "So you mentioned contact, like what's contact?"}, {"time": 5811, "text": "So an airplane is an extremely complex system or a spacecraft landing or whatever, but at least it has the luxury of things change relatively continuously."}, {"time": 5823, "text": "That's an oversimplification."}, {"time": 5824, "text": "But if I make a small change in the command I send to my actuator, then the path that the robot will take tends to change only by a small amount."}, {"time": 5836, "text": "And there's a feedback mechanism here."}, {"time": 5838, "text": "That's what we're talking about."}, {"time": 5839, "text": "And there's a feedback mechanism."}, {"time": 5840, "text": "And thinking about this as locally, like a linear system, for instance, I can use more linear algebra tools to study systems like that, generalizations of linear algebra to these smooth systems."}, {"time": 5856, "text": "What is contact?"}, {"time": 5857, "text": "The robot has something very discontinuous that happens when it makes or breaks, when it starts touching the world."}, {"time": 5865, "text": "And even the way it touches or the order of contacts can change the outcome in potentially unpredictable ways."}, {"time": 5873, "text": "Not unpredictable, but complex ways."}, {"time": 5876, "text": "I do think there's a little bit of, a lot of people will say that contact is hard in robotics, even to simulate."}, {"time": 5886, "text": "And I think there's a little bit of a, there's truth to that, but maybe a misunderstanding around that."}, {"time": 5893, "text": "So what is limiting is that when we think about our robots and we write our simulators, we often make an assumption that objects are rigid."}, {"time": 5906, "text": "And when it comes down, that their mass moves all, stays in a constant position relative to each other itself."}, {"time": 5917, "text": "And that leads to some paradoxes when you go to try to talk about rigid body mechanics and contact."}, {"time": 5923, "text": "And so for instance, if I have a three legged stool with just imagine it comes to a point at the leg."}, {"time": 5931, "text": "So it's only touching the world at a point."}, {"time": 5934, "text": "If I draw my physics, my high school physics diagram of the system, then there's a couple of things that I'm given by elementary physics."}, {"time": 5943, "text": "I know if the system, if the table is at rest, if it's not moving, zero velocities, that means that the normal force, all the forces are in balance."}, {"time": 5953, "text": "So the force of gravity is being countered by the forces that the ground is pushing on my table legs."}, {"time": 5961, "text": "I also know since it's not rotating that the moments have to balance."}, {"time": 5965, "text": "And since it's a three dimensional table, it could fall in any direction."}, {"time": 5971, "text": "It actually tells me uniquely what those three normal forces have to be."}, {"time": 5977, "text": "If I have four legs on my table, four legged table and they were perfectly machined to be exactly the right same height and they're set down and the table's not moving, then the basic conservation laws don't tell me, there are many solutions for the forces that the ground could be putting on my legs that would still result in the table not moving."}, {"time": 6000, "text": "Now, the reason that seems fine, I could just pick one."}, {"time": 6003, "text": "But it gets funny now because if you think about friction, what we think about with friction is our standard model says the amount of force that the table will push back if I were to now try to push my table sideways, I guess I have a table here, is proportional to the normal force."}, {"time": 6024, "text": "So if I'm barely touching and I push, I'll slide, but if I'm pushing more and I push, I'll slide less."}, {"time": 6030, "text": "It's called coulomb friction is our standard model."}, {"time": 6033, "text": "Now, if you don't know what the normal force is on the four legs and you push the table, then you don't know what the friction forces are gonna be."}, {"time": 6043, "text": "And so you can't actually tell, the laws just aren't explicit yet about which way the table's gonna go."}, {"time": 6049, "text": "It could veer off to the left, it could veer off to the right, it could go straight."}, {"time": 6054, "text": "So the rigid body assumption of contact leaves us with some paradoxes, which are annoying for writing simulators and for writing controllers."}, {"time": 6064, "text": "We still do that sometimes because soft contact is potentially harder numerically or whatever, and the best simulators do both or do some combination of the two."}, {"time": 6075, "text": "But anyways, because of these kinds of paradoxes, there's all kinds of paradoxes in contact, mostly due to these rigid body assumptions."}, {"time": 6083, "text": "It becomes very hard to write the same kind of control laws that we've been able to be successful with for fighter jets."}, {"time": 6092, "text": "Like fighter jets, we haven't been as successful writing those controllers for manipulation."}, {"time": 6097, "text": "And so you don't know what's going to happen at the point of contact, at the moment of contact."}, {"time": 6101, "text": "There are situations absolutely where our laws don't tell us."}, {"time": 6105, "text": "So the standard approach, that's okay."}, {"time": 6107, "text": "I mean, instead of having a differential equation, you end up with a differential inclusion, it's called."}, {"time": 6113, "text": "It's a set valued equation."}, {"time": 6116, "text": "It says that I'm in this configuration, I have these forces applied on me."}, {"time": 6120, "text": "And there's a set of things that could happen, right?"}, {"time": 6123, "text": "And you can... And those aren't continuous, I mean, what..."}, {"time": 6127, "text": "So when you're saying like non smooth, they're not only not smooth, but this is discontinuous?"}, {"time": 6134, "text": "The non smooth comes in when I make or break a new contact first, or when I transition from stick to slip."}, {"time": 6141, "text": "So you typically have static friction, and then you'll start sliding, and that'll be a discontinuous change in philosophy."}, {"time": 6148, "text": "In philosophy, for instance, especially if you come to rest or... That's so fascinating."}, {"time": 6154, "text": "Okay, so what do you do?"}, {"time": 6157, "text": "Sorry, I interrupted you."}, {"time": 6161, "text": "What's the hope under so much uncertainty about what's going to happen?"}, {"time": 6166, "text": "I mean, control has an answer for this."}, {"time": 6168, "text": "Robust control is one approach, but roughly you can write controllers which try to still perform the right task despite all the things that could possibly happen."}, {"time": 6178, "text": "The world might want the table to go this way and this way, but if I write a controller that pushes a little bit more and pushes a little bit, I can certainly make the table go in the direction I want."}, {"time": 6188, "text": "It just puts a little bit more of a burden on the control system, right?"}, {"time": 6192, "text": "And this discontinuities do change the control system because the way we write it down right now, every different control configuration, including sticking or sliding or parts of my body that are in contact or not, looks like a different system."}, {"time": 6210, "text": "And I think of them, I reason about them separately or differently and the combinatorics of that blow up, right?"}, {"time": 6218, "text": "So I just don't have enough time to compute all the possible contact configurations of my humanoid."}, {"time": 6225, "text": "Interestingly, I mean, I'm a humanoid."}, {"time": 6229, "text": "I have lots of degrees of freedom, lots of joints."}, {"time": 6232, "text": "I've only been around for a handful of years."}, {"time": 6234, "text": "It's getting up there, but I haven't had time in my life to visit all of the states in my system, certainly all the contact configurations."}, {"time": 6245, "text": "So if step one is to consider every possible contact configuration that I'll ever be in, that's probably not a problem I need to solve, right?"}, {"time": 6257, "text": "Just as a small tangent, what's a contact configuration?"}, {"time": 6260, "text": "What like, just so we can enumerate what are we talking about?"}, {"time": 6266, "text": "How many are there?"}, {"time": 6267, "text": "The simplest example maybe would be, imagine a robot with a flat foot."}, {"time": 6272, "text": "And we think about the phases of gait where the heel strikes and then the front toe strikes, and then you can heel up, toe off."}, {"time": 6283, "text": "Those are each different contact configurations."}, {"time": 6286, "text": "I only had two different contacts, but I ended up with four different contact configurations."}, {"time": 6291, "text": "Now, of course, my robot might actually have bumps on it or other things, so it could be much more subtle than that, right?"}, {"time": 6300, "text": "But it's just even with one sort of box interacting with the ground already in the plane has that many, right?"}, {"time": 6307, "text": "And if I was just even a 3D foot, then it probably my left toe might touch just before my right toe and things get subtle."}, {"time": 6314, "text": "Now, if I'm a dexterous hand and I go to talk about just grabbing a water bottle, if I have to enumerate every possible order that my hand came into contact with the bottle, then I'm dead in the water."}, {"time": 6332, "text": "Any approach that we were able to get away with that in walking because we mostly touched the ground within a small number of points, for instance, and we haven't been able to get dexterous hands that way."}, {"time": 6343, "text": "So you've mentioned that people think that contact is really hard and that that's the reason that robotic manipulation is problem is really hard."}, {"time": 6360, "text": "Is there any flaws in that thinking?"}, {"time": 6366, "text": "So I think simulating contact is one aspect."}, {"time": 6370, "text": "I know people often say that we don't, that one of the reasons that we have a limit in robotics is because we do not simulate contact accurately in our simulators."}, {"time": 6380, "text": "And I think that is the extent to which that's true is partly because our simulators, we haven't got mature enough simulators."}, {"time": 6391, "text": "There are some things that are still hard, difficult, that we should change, but we actually, we know what the governing equations are."}, {"time": 6401, "text": "They have some foibles like this indeterminacy, but we should be able to simulate them accurately."}, {"time": 6408, "text": "We have incredible open source community in robotics, but it actually just takes a professional engineering team a lot of work to write a very good simulator like that."}, {"time": 6419, "text": "Now, where does, I believe you've written, Drake."}, {"time": 6423, "text": "There's a team of people."}, {"time": 6424, "text": "I certainly spent a lot of hours on it myself."}, {"time": 6427, "text": "But what is Drake and what does it take to create a simulation environment for the kind of difficult control problems we're talking about?"}, {"time": 6440, "text": "Right, so Drake is the simulator that I've been working on."}, {"time": 6444, "text": "There are other good simulators out there."}, {"time": 6446, "text": "I don't like to think of Drake as just a simulator because we write our controllers in Drake, we write our perception systems a little bit in Drake, but we write all of our low level control and even planning and optimization."}, {"time": 6460, "text": "So it has optimization capabilities as well?"}, {"time": 6463, "text": "I mean, Drake is three things roughly."}, {"time": 6466, "text": "It's an optimization library, which is sits on, it provides a layer of abstraction in C++ and Python for commercial solvers."}, {"time": 6475, "text": "You can write linear programs, quadratic programs, semi definite programs, sums of squares programs, the ones we've used, mixed integer programs, and it will do the work to curate those and send them to whatever the right solver is for instance, and it provides a level of abstraction."}, {"time": 6523, "text": "If you have any state, for instance, in the system, any variables that are gonna persist, you have to declare them."}, {"time": 6529, "text": "Parameters can be declared and the like, but the advantage of doing that is that you can, if you like, run things all on one process, but you can also do control design against it."}, {"time": 6540, "text": "You can do, I mean, simple things like rewinding and playing back your simulations, for instance, these things, you get some rewards for spending a little bit more upfront cost in describing each system."}, {"time": 6553, "text": "And I was inspired to do that because I think the complexity of Atlas, for instance, is just so great."}, {"time": 6562, "text": "And I think, although, I mean, ROS has been an incredible, absolutely huge fan of what it's done for the robotics community, but the ability to rapidly put different pieces together and have a functioning thing is very good."}, {"time": 6578, "text": "But I do think that it's hard to think clearly about a bag of disparate parts, Mr."}, {"time": 6585, "text": "Potato Head kind of software stack."}, {"time": 6588, "text": "And if you can ask a little bit more out of each of those parts, then you can understand the way they work better."}, {"time": 6596, "text": "You can try to verify them and the like, or you can do learning against them."}, {"time": 6602, "text": "And then one of those systems, the last thing, I said the first two things that Drake is, but the last thing is that there is a set of multi body equations, rigid body equations, that is trying to provide a system that simulates physics."}, {"time": 6616, "text": "And we also have renderers and other things, but I think the physics component of Drake is special in the sense that we have done excessive amount of engineering to make sure that we've written the equations correctly."}, {"time": 6631, "text": "Every possible tumbling satellite or spinning top or anything that we could possibly write as a test is tested."}, {"time": 6638, "text": "We are making some, I think, fundamental improvements on the way you simulate contact."}, {"time": 6644, "text": "Just what does it take to simulate contact?"}, {"time": 6647, "text": "I mean, it just seems, I mean, there's something just beautiful to the way you were like explaining contact and you were like tapping your fingers on the table while you're doing it, just."}, {"time": 6660, "text": "Easily, right?"}, {"time": 6661, "text": "Easily, just like, just not even like, it was like helping you think, I guess."}, {"time": 6670, "text": "So you have this like awesome demo of loading or unloading a dishwasher, just picking up a plate, or grasping it like for the first time."}, {"time": 6686, "text": "That's just seems like so difficult."}, {"time": 6689, "text": "What, how do you simulate any of that?"}, {"time": 6693, "text": "So it was really interesting that what happened was that we started getting more professional about our software development during the DARPA Robotics Challenge."}, {"time": 6703, "text": "I learned the value of software engineering and how these, how to bridle complexity."}, {"time": 6708, "text": "I guess that's what I want to somehow fight against and bring some of the clear thinking of controls into these complex systems we're building for robots."}, {"time": 6720, "text": "Shortly after the DARPA Robotics Challenge, Toyota opened a research institute, TRI, Toyota Research Institute."}, {"time": 6728, "text": "They put one of their, there's three locations."}, {"time": 6730, "text": "One of them is just down the street from MIT."}, {"time": 6733, "text": "And I helped ramp that up right up as a part of my, the end of my sabbatical, I guess."}, {"time": 6743, "text": "So TRI has given me, the TRI robotics effort has made this investment in simulation in Drake."}, {"time": 6752, "text": "And Michael Sherman leads a team there of just absolutely top notch dynamics experts that are trying to write those simulators that can pick up the dishes."}, {"time": 6761, "text": "And there's also a team working on manipulation there that is taking problems like loading the dishwasher."}, {"time": 6768, "text": "And we're using that to study these really hard corner cases kind of problems in manipulation."}, {"time": 6775, "text": "So for me, this, you know, simulating the dishes, we could actually write a controller."}, {"time": 6781, "text": "If we just cared about picking up dishes in the sink once, we could write a controller without any simulation whatsoever, and we could call it done."}, {"time": 6790, "text": "But we want to understand like, what is the path you take to actually get to a robot that could perform that for any dish in anybody's kitchen with enough confidence that it could be a commercial product, right?"}, {"time": 6806, "text": "And it has deep learning perception in the loop."}, {"time": 6809, "text": "It has complex dynamics in the loop."}, {"time": 6811, "text": "It has controller, it has a planner."}, {"time": 6813, "text": "And how do you take all of that complexity and put it through this engineering discipline and verification and validation process to actually get enough confidence to deploy?"}, {"time": 6826, "text": "I mean, the DARPA challenge made me realize that that's not something you throw over the fence and hope that somebody will harden it for you, that there are really fundamental challenges in closing that last gap."}, {"time": 6839, "text": "They're doing the validation and the testing."}, {"time": 6843, "text": "I think it might even change the way we have to think about the way we write systems."}, {"time": 6849, "text": "What happens if you have the robot running lots of tests and it screws up, it breaks a dish, right?"}, {"time": 6859, "text": "How do you capture that?"}, {"time": 6859, "text": "I said, you can't run the same simulation or the same experiment twice on a real robot."}, {"time": 6867, "text": "Do we have to be able to bring that one off failure back into simulation in order to change our controllers, study it, make sure it won't happen again?"}, {"time": 6877, "text": "Do we, is it enough to just try to add that to our distribution and understand that on average, we're gonna cover that situation again?"}, {"time": 6885, "text": "There's like really subtle questions at the corner cases that I think we don't yet have satisfying answers for."}, {"time": 6893, "text": "Like how do you find the corner cases?"}, {"time": 6895, "text": "That's one kind of, is there, do you think that's possible to create a systematized way of discovering corner cases efficiently?"}, {"time": 6905, "text": "In whatever the problem is?"}, {"time": 6907, "text": "Yes, I mean, I think we have to get better at that."}, {"time": 6910, "text": "I mean, control theory has for decades talked about active experiment design."}, {"time": 6919, "text": "So people call it curiosity these days."}, {"time": 6922, "text": "It's roughly this idea of trying to exploration or exploitation, but in the active experiment design is even, is more specific."}, {"time": 6929, "text": "You could try to understand the uncertainty in your system, design the experiment that will provide the maximum information to reduce that uncertainty."}, {"time": 6940, "text": "If there's a parameter you wanna learn about, what is the optimal trajectory I could execute to learn about that parameter, for instance."}, {"time": 6949, "text": "Scaling that up to something that has a deep network in the loop and a planning in the loop is tough."}, {"time": 6955, "text": "We've done some work on, you know, with Matt Okely and Aman Sinha, we've worked on some falsification algorithms that are trying to do rare event simulation that try to just hammer on your simulator."}, {"time": 6968, "text": "And if your simulator is good enough, you can spend a lot of time, or you can write good algorithms that try to spend most of their time in the corner cases."}, {"time": 6979, "text": "So you basically imagine you're building an autonomous car and you wanna put it in, I don't know, downtown New Delhi all the time, right?"}, {"time": 6989, "text": "And accelerated testing."}, {"time": 6991, "text": "If you can write sampling strategies, which figure out where your controller's performing badly in simulation and start generating lots of examples around that."}, {"time": 7000, "text": "You know, it's just the space of possible places where that can be, where things can go wrong is very big."}, {"time": 7008, "text": "So it's hard to write those algorithms."}, {"time": 7009, "text": "Yeah, rare event simulation is just a really compelling notion, if it's possible."}, {"time": 7015, "text": "We joked and we call it the black swan generator."}, {"time": 7018, "text": "It's a black swan."}, {"time": 7020, "text": "Because you don't just want the rare events, you want the ones that are highly impactful."}, {"time": 7024, "text": "I mean, that's the most, those are the most sort of profound questions we ask of our world."}, {"time": 7030, "text": "Like, what's the worst that can happen?"}, {"time": 7036, "text": "But what we're really asking isn't some kind of like computer science, worst case analysis."}, {"time": 7042, "text": "We're asking like, what are the millions of ways this can go wrong?"}, {"time": 7047, "text": "And that's like our curiosity."}, {"time": 7049, "text": "And we humans, I think are pretty bad at, we just like run into it."}, {"time": 7056, "text": "And I think there's a distributed sense because there's now like 7.5 billion of us."}, {"time": 7061, "text": "And so there's a lot of them."}, {"time": 7062, "text": "And then a lot of them write blog posts about the stupid thing they've done."}, {"time": 7066, "text": "So we learn in a distributed way."}, {"time": 7070, "text": "I think that's gonna be important for robots too."}, {"time": 7073, "text": "I mean, that's another massive theme at Toyota Research for Robotics is this fleet learning concept is the idea that I, as a human, I don't have enough time to visit all of my states, right?"}, {"time": 7087, "text": "There's just a, it's very hard for one robot to experience all the things."}, {"time": 7092, "text": "But that's not actually the problem we have to solve, right?"}, {"time": 7096, "text": "We're gonna have fleets of robots that can have very similar appendages."}, {"time": 7100, "text": "And at some point, maybe collectively, they have enough data that their computational processes should be set up differently than ours, right?"}, {"time": 7111, "text": "It's this vision of just, I mean, all these dishwasher unloading robots."}, {"time": 7118, "text": "I mean, that robot dropping a plate and a human looking at the robot probably pissed off."}, {"time": 7127, "text": "But that's a special moment to record."}, {"time": 7131, "text": "I think one thing in terms of fleet learning, and I've seen that because I've talked to a lot of folks, just like Tesla users or Tesla drivers, they're another company that's using this kind of fleet learning idea."}, {"time": 7145, "text": "One hopeful thing I have about humans is they really enjoy when a system improves, learns."}, {"time": 7153, "text": "So they enjoy fleet learning."}, {"time": 7154, "text": "And the reason it's hopeful for me is they're willing to put up with something that's kind of dumb right now."}, {"time": 7162, "text": "And they're like, if it's improving, they almost like enjoy being part of the, like teaching it."}, {"time": 7169, "text": "Almost like if you have kids, like you're teaching them something, right?"}, {"time": 7173, "text": "I think that's a beautiful thing because that gives me hope that we can put dumb robots out there."}, {"time": 7180, "text": "I mean, the problem on the Tesla side with cars, cars can kill you."}, {"time": 7185, "text": "That makes the problem so much harder."}, {"time": 7187, "text": "Dishwasher unloading is a little safe."}, {"time": 7190, "text": "That's why home robotics is really exciting."}, {"time": 7194, "text": "And just to clarify, I mean, for people who might not know, I mean, TRI, Toyota Research Institute."}, {"time": 7200, "text": "So they're, I mean, they're pretty well known for like autonomous vehicle research, but they're also interested in home robotics."}, {"time": 7210, "text": "Yep, there's a big group working on, multiple groups working on home robotics."}, {"time": 7214, "text": "It's a major part of the portfolio."}, {"time": 7217, "text": "There's also a couple other projects in advanced materials discovery, using AI and machine learning to discover new materials for car batteries and the like, for instance, yeah."}, {"time": 7228, "text": "And that's been actually an incredibly successful team."}, {"time": 7231, "text": "There's new projects starting up too, so."}, {"time": 7233, "text": "Do you see a future of where like robots are in our home and like robots that have like actuators that look like arms in our home or like, you know, more like humanoid type robots?"}, {"time": 7249, "text": "Or is this, are we gonna do the same thing that you just mentioned that, you know, the dishwasher is no longer a robot."}, {"time": 7255, "text": "We're going to just not even see them as robots."}, {"time": 7258, "text": "But I mean, what's your vision of the home of the future 10, 20 years from now, 50 years, if you get crazy?"}, {"time": 7266, "text": "Yeah, I think we already have Roombas cruising around."}, {"time": 7270, "text": "We have, you know, Alexis or Google Homes on our kitchen counter."}, {"time": 7276, "text": "It's only a matter of time until they spring arms and start doing something useful like that."}, {"time": 7281, "text": "So I do think it's coming."}, {"time": 7283, "text": "I think lots of people have lots of motivations for doing it."}, {"time": 7289, "text": "It's been super interesting actually learning about Toyota's vision for it, which is about helping people age in place."}, {"time": 7298, "text": "Cause I think that's not necessarily the first entry, the most lucrative entry point, but it's the problem maybe that we really need to solve no matter what."}, {"time": 7310, "text": "And so I think there's a real opportunity."}, {"time": 7313, "text": "It's a delicate problem."}, {"time": 7315, "text": "How do you work with people, help people, keep them active, engaged, you know, but improve their quality of life and help them age in place, for instance."}, {"time": 7328, "text": "It's interesting because older folks are also, I mean, there's a contrast there because they're not always the folks who are the most comfortable with technology, for example."}, {"time": 7340, "text": "So there's a division that's interesting."}, {"time": 7344, "text": "You can do so much good with a robot for older folks, but there's a gap to fill of understanding."}, {"time": 7356, "text": "I mean, it's actually kind of beautiful."}, {"time": 7359, "text": "Robot is learning about the human and the human is kind of learning about this new robot thing."}, {"time": 7364, "text": "And it's also with, at least with, like when I talked to my parents about robots, there's a little bit of a blank slate there too."}, {"time": 7374, "text": "Like you can, I mean, they don't know anything about robotics, so it's completely like wide open."}, {"time": 7382, "text": "They don't have, they haven't, my parents haven't seen Black Mirror."}, {"time": 7386, "text": "So like they, it's a blank slate."}, {"time": 7389, "text": "Here's a cool thing, like what can it do for me?"}, {"time": 7391, "text": "Yeah, so it's an exciting space."}, {"time": 7394, "text": "I think it's a really important space."}, {"time": 7396, "text": "I do feel like a few years ago, drones were successful enough in academia."}, {"time": 7402, "text": "They kind of broke out and started an industry and autonomous cars have been happening."}, {"time": 7409, "text": "It does feel like manipulation in logistics, of course, first, but in the home shortly after, seems like one of the next big things that's gonna really pop."}, {"time": 7420, "text": "So I don't think we talked about it, but what's soft robotics?"}, {"time": 7424, "text": "So we talked about like rigid bodies."}, {"time": 7429, "text": "Like if we can just linger on this whole touch thing."}, {"time": 7432, "text": "Yeah, so what's soft robotics?"}, {"time": 7434, "text": "So I told you that I really dislike the fact that robots are afraid of touching the world all over their body."}, {"time": 7444, "text": "So there's a couple reasons for that."}, {"time": 7446, "text": "If you look carefully at all the places that robots actually do touch the world, they're almost always soft."}, {"time": 7452, "text": "They have some sort of pad on their fingers or a rubber sole on their foot."}, {"time": 7457, "text": "But if you look up and down the arm, we're just pure aluminum or something."}, {"time": 7465, "text": "So that makes it hard actually."}, {"time": 7466, "text": "In fact, hitting the table with your rigid arm or nearly rigid arm has some of the problems that we talked about in terms of simulation."}, {"time": 7477, "text": "I think it fundamentally changes the mechanics of contact when you're soft, right?"}, {"time": 7481, "text": "You turn point contacts into patch contacts, which can have torsional friction."}, {"time": 7487, "text": "You can have distributed load."}, {"time": 7489, "text": "If I wanna pick up an egg, right?"}, {"time": 7492, "text": "If I pick it up with two points, then in order to put enough force to sustain the weight of the egg, I might have to put a lot of force to break the egg."}, {"time": 7499, "text": "If I envelop it with contact all around, then I can distribute my force across the shell of the egg and have a better chance of not breaking it."}, {"time": 7510, "text": "So soft robotics is for me a lot about changing the mechanics of contact."}, {"time": 7515, "text": "Does it make the problem a lot harder?"}, {"time": 7519, "text": "Quite the opposite."}, {"time": 7524, "text": "It changes the computational problem."}, {"time": 7526, "text": "I think because of the, I think our world and our mathematics has biased us towards rigid."}, {"time": 7535, "text": "But it really should make things better in some ways, right?"}, {"time": 7540, "text": "I think the future is unwritten there."}, {"time": 7544, "text": "But the other thing it can do."}, {"time": 7545, "text": "I think ultimately, sorry to interrupt, but I think ultimately it will make things simpler if we embrace the softness of the world."}, {"time": 7551, "text": "It makes things smoother, right?"}, {"time": 7555, "text": "So the result of small actions is less discontinuous, but it also means potentially less instantaneously bad."}, {"time": 7565, "text": "For instance, I won't necessarily contact something and send it flying off."}, {"time": 7572, "text": "The other aspect of it that just happens to dovetail really well is that soft robotics tends to be a place where we can embed a lot of sensors too."}, {"time": 7579, "text": "So if you change your hardware and make it more soft, then you can potentially have a tactile sensor, which is measuring the deformation."}, {"time": 7587, "text": "So there's a team at TRI that's working on soft hands and you get so much more information."}, {"time": 7595, "text": "You can put a camera behind the skin roughly and get fantastic tactile information, which is, it's super important."}, {"time": 7627, "text": "So in all the part that really matters, all of your off board sensors are occluded."}, {"time": 7633, "text": "And really, if you don't have tactile information, then you're blind in an important way."}, {"time": 7639, "text": "So it happens that soft robotics and tactile sensing tend to go hand in hand."}, {"time": 7645, "text": "I think we've kind of talked about it, but you taught a course on underactuated robotics."}, {"time": 7651, "text": "I believe that was the name of it, actually."}, {"time": 7654, "text": "Can you talk about it in that context?"}, {"time": 7657, "text": "What is underactuated robotics?"}, {"time": 7660, "text": "Right, so underactuated robotics is my graduate course."}, {"time": 7663, "text": "It's online mostly now, in the sense that the lectures."}, {"time": 7667, "text": "Several versions of it, I think."}, {"time": 7669, "text": "Right, the YouTube."}, {"time": 7669, "text": "It's really great, I recommend it highly."}, {"time": 7672, "text": "Look on YouTube for the 2020 versions."}, {"time": 7675, "text": "Until March, and then you have to go back to 2019, thanks to COVID."}, {"time": 7680, "text": "No, I've poured my heart into that class."}, {"time": 7684, "text": "And lecture one is basically explaining what the word underactuated means."}, {"time": 7687, "text": "So people are very kind to show up and then maybe have to learn what the title of the course means over the course of the first lecture."}, {"time": 7695, "text": "That first lecture is really good."}, {"time": 7697, "text": "You should watch it."}, {"time": 7699, "text": "It's a strange name, but I thought it captured the essence of what control was good at doing and what control was bad at doing."}, {"time": 7709, "text": "So what do I mean by underactuated?"}, {"time": 7711, "text": "So a mechanical system has many degrees of freedom, for instance."}, {"time": 7719, "text": "I think of a joint as a degree of freedom."}, {"time": 7721, "text": "And it has some number of actuators, motors."}, {"time": 7726, "text": "So if you have a robot that's bolted to the table that has five degrees of freedom and five motors, then you have a fully actuated robot."}, {"time": 7737, "text": "If you take away one of those motors, then you have an underactuated robot."}, {"time": 7743, "text": "Now, why on earth?"}, {"time": 7744, "text": "I have a good friend who likes to tease me."}, {"time": 7747, "text": "He said, Ross, if you had more research funding, would you work on fully actuated robots?"}, {"time": 7755, "text": "The world gives us underactuated robots, whether we like it or not."}, {"time": 7758, "text": "I'm a human."}, {"time": 7759, "text": "I'm an underactuated robot, even though I have more muscles than my big degrees of freedom, because I have in some places multiple muscles attached to the same joint."}, {"time": 7770, "text": "But still, there's a really important degree of freedom that I have, which is the location of my center of mass in space, for instance."}, {"time": 7779, "text": "All right, I can jump into the air, and there's no motor that connects my center of mass to the ground in that case."}, {"time": 7787, "text": "So I have to think about the implications of not having control over everything."}, {"time": 7792, "text": "The passive dynamic walkers are the extreme view of that, where you've taken away all the motors, and you have to let physics do the work."}, {"time": 7799, "text": "But it shows up in all of the walking robots, where you have to use some of the actuators to push and pull even the degrees of freedom that you don't have an actuator on."}, {"time": 7809, "text": "That's referring to walking if you're falling forward."}, {"time": 7813, "text": "Is there a way to walk that's fully actuated?"}, {"time": 7816, "text": "So it's a subtle point."}, {"time": 7818, "text": "When you're in contact and you have your feet on the ground, there are still limits to what you can do, right?"}, {"time": 7826, "text": "Unless I have suction cups on my feet, I cannot accelerate my center of mass towards the ground faster than gravity, because I can't get a force pushing me down, right?"}, {"time": 7837, "text": "But I can still do most of the things that I want to."}, {"time": 7839, "text": "So you can get away with basically thinking of the system as fully actuated, unless you suddenly needed to accelerate down super fast."}, {"time": 7847, "text": "But as soon as I take a step, I get into the more nuanced territory, and to get to really dynamic robots, or airplanes or other things, I think you have to embrace the underactuated dynamics."}, {"time": 7862, "text": "Manipulation, people think, is manipulation underactuated?"}, {"time": 7866, "text": "Even if my arm is fully actuated, I have a motor, if my goal is to control the position and orientation of this cup, then I don't have an actuator for that directly."}, {"time": 7879, "text": "So I have to use my actuators over here to control this thing."}, {"time": 7883, "text": "Now it gets even worse, like what if I have to button my shirt, okay?"}, {"time": 7889, "text": "What are the degrees of freedom of my shirt, right?"}, {"time": 7891, "text": "I suddenly, that's a hard question to think about."}, {"time": 7894, "text": "It kind of makes me queasy thinking about my state space control ideas."}, {"time": 7900, "text": "But actually those are the problems that make me so excited about manipulation right now, is that it breaks some of the, it breaks a lot of the foundational control stuff that I've been thinking about."}, {"time": 7911, "text": "Is there, what are some interesting insights you could say about trying to solve an underactuated, a control in an underactuated system?"}, {"time": 7922, "text": "So I think the philosophy there is let physics do more of the work."}, {"time": 7928, "text": "The technical approach has been optimization."}, {"time": 7932, "text": "So you typically formulate your decision making for control as an optimization problem."}, {"time": 7937, "text": "And you use the language of optimal control and sometimes often numerical optimal control in order to make those decisions and balance, these complicated equations of, and in order to control, you don't have to use optimal control to do underactuated systems, but that has been the technical approach that has borne the most fruit in our, at least in our line of work."}, {"time": 7960, "text": "And there's some, so in underactuated systems, when you say let physics do some of the work, so there's a kind of feedback loop that observes the state that the physics brought you to."}, {"time": 7974, "text": "So like you've, there's a perception there, there's a feedback somehow."}, {"time": 7980, "text": "Do you ever loop in like complicated perception systems into this whole picture?"}, {"time": 7986, "text": "Right, right around the time of the DARPA challenge, we had a complicated perception system in the DARPA challenge."}, {"time": 7992, "text": "We also started to embrace perception for our flying vehicles at the time."}, {"time": 7997, "text": "We had a really good project on trying to make airplanes fly at high speeds through forests."}, {"time": 8004, "text": "Sirtash Karaman was on that project and we had, it was a really fun team to work on."}, {"time": 8010, "text": "He's carried it farther, much farther forward since then."}, {"time": 8014, "text": "And that's using cameras for perception?"}, {"time": 8015, "text": "So that was using cameras."}, {"time": 8017, "text": "That was, at the time we felt like LIDAR was too heavy and too power heavy to be carried on a light UAV, and we were using cameras."}, {"time": 8029, "text": "And that was a big part of it was just how do you do even stereo matching at a fast enough rate with a small camera, small onboard compute."}, {"time": 8038, "text": "Since then we have now, so the deep learning revolution unquestionably changed what we can do with perception for robotics and control."}, {"time": 8049, "text": "So in manipulation, we can address, we can use perception in I think a much deeper way."}, {"time": 8054, "text": "And we get into not only, I think the first use of it naturally would be to ask your deep learning system to look at the cameras and produce the state, which is like the pose of my thing, for instance."}, {"time": 8068, "text": "But I think we've quickly found out that that's not always the right thing to do."}, {"time": 8075, "text": "Because what's the state of my shirt?"}, {"time": 8078, "text": "Imagine, I've always, Very noisy, you mean, or?"}, {"time": 8081, "text": "It's, if the first step of me trying to button my shirt is estimate the full state of my shirt, including like what's happening in the back here, whatever, whatever."}, {"time": 8091, "text": "That's just not the right specification."}, {"time": 8095, "text": "There are aspects of the state that are very important to the task."}, {"time": 8100, "text": "There are many that are unobservable and not important to the task."}, {"time": 8105, "text": "So you really need, it begs new questions about state representation."}, {"time": 8111, "text": "Another example that we've been playing with in lab has been just the idea of chopping onions, okay?"}, {"time": 8117, "text": "Or carrots, turns out to be better."}, {"time": 8120, "text": "So onions stink up the lab."}, {"time": 8122, "text": "And they're hard to see in a camera."}, {"time": 8126, "text": "But so, Details matter, yeah."}, {"time": 8128, "text": "Details matter, you know?"}, {"time": 8130, "text": "So if I'm moving around a particular object, right?"}, {"time": 8135, "text": "Then I think about, oh, it's got a position or an orientation in space."}, {"time": 8138, "text": "That's the description I want."}, {"time": 8139, "text": "Now, when I'm chopping an onion, okay?"}, {"time": 8142, "text": "Like the first chop comes down."}, {"time": 8144, "text": "I have now a hundred pieces of onion."}, {"time": 8148, "text": "Does my control system really need to understand the position and orientation and even the shape of the hundred pieces of onion in order to make a decision?"}, {"time": 8156, "text": "Probably not, you know?"}, {"time": 8156, "text": "And if I keep going, I'm just getting, more and more is my state space getting bigger as I cut?"}, {"time": 8164, "text": "It's not right."}, {"time": 8166, "text": "So somehow there's a, I think there's a richer idea of state."}, {"time": 8173, "text": "It's not the state that is given to us by Lagrangian mechanics."}, {"time": 8177, "text": "There is a proper Lagrangian state of the system, but the relevant state for this is some latent state is what we call it in machine learning."}, {"time": 8188, "text": "But, you know, there's some different state representation."}, {"time": 8192, "text": "Some compressed representation, some."}, {"time": 8195, "text": "And that's what I worry about saying compressed because it doesn't, I don't mind that it's low dimensional or not, but it has to be something that's easier to think about."}, {"time": 8206, "text": "By us humans."}, {"time": 8208, "text": "Or my algorithms."}, {"time": 8209, "text": "Or the algorithms being like control, optimal."}, {"time": 8213, "text": "So for instance, if the contact mechanics of all of those onion pieces and all the permutations of possible touches between those onion pieces, you know, you can give me a high dimensional state representation, I'm okay if it's linear."}, {"time": 8226, "text": "But if I have to think about all the possible shattering combinatorics of that, then my robot's gonna sit there thinking and the soup's gonna get cold or something."}, {"time": 8237, "text": "So since you taught the course, it kind of entered my mind, the idea of underactuated as really compelling to see the world in this kind of way."}, {"time": 8249, "text": "Do you ever, you know, if we talk about onions or you talk about the world with people in it in general, do you see the world as basically an underactuated system?"}, {"time": 8259, "text": "Do you like often look at the world in this way?"}, {"time": 8262, "text": "Or is this overreach?"}, {"time": 8267, "text": "Underactuated is a way of life, man."}, {"time": 8269, "text": "Exactly, I guess that's what I'm asking."}, {"time": 8273, "text": "I do think it's everywhere."}, {"time": 8274, "text": "I think in some places, we already have natural tools to deal with it."}, {"time": 8281, "text": "You know, it rears its head."}, {"time": 8282, "text": "I mean, in linear systems, it's not a problem."}, {"time": 8284, "text": "We just, like an underactuated linear system is really not sufficiently distinct from a fully actuated linear system."}, {"time": 8290, "text": "It's a subtle point about when that becomes a bottleneck in what we know how to do with control."}, {"time": 8297, "text": "It happens to be a bottleneck, although we've gotten incredibly good solutions now, but for a long time that I felt that that was the key bottleneck in legged robots."}, {"time": 8307, "text": "And roughly now the underactuated course is me trying to tell people everything I can about how to make Atlas do a backflip, right?"}, {"time": 8318, "text": "I have a second course now that I teach in the other semesters, which is on manipulation."}, {"time": 8323, "text": "And that's where we get into now more of the, that's a newer class."}, {"time": 8327, "text": "I'm hoping to put it online this fall completely."}, {"time": 8331, "text": "And that's gonna have much more aspects about these perception problems and the state representation questions, and then how do you do control."}, {"time": 8339, "text": "And the thing that's a little bit sad is that, for me at least, is there's a lot of manipulation tasks that people wanna do and should wanna do."}, {"time": 8349, "text": "They could start a company with it and be very successful that don't actually require you to think that much about underact, or dynamics at all even, but certainly underactuated dynamics."}, {"time": 8360, "text": "Once I have, if I reach out and grab something, if I can sort of assume it's rigidly attached to my hand, then I can do a lot of interesting, meaningful things with it without really ever thinking about the dynamics of that object."}, {"time": 8372, "text": "So we've built systems that kind of reduce the need for that."}, {"time": 8377, "text": "Enveloping grasps and the like."}, {"time": 8380, "text": "But I think the really good problems in manipulation."}, {"time": 8383, "text": "So manipulation, by the way, is more than just pick and place."}, {"time": 8388, "text": "That's like a lot of people think of that, just grasping."}, {"time": 8391, "text": "I don't mean that."}, {"time": 8392, "text": "I mean buttoning my shirt, I mean tying shoelaces."}, {"time": 8396, "text": "How do you program a robot to tie shoelaces?"}, {"time": 8399, "text": "And not just one shoe, but every shoe, right?"}, {"time": 8402, "text": "That's a really good problem."}, {"time": 8405, "text": "It's tempting to write down like the infinite dimensional state of the laces, that's probably not needed to write a good controller."}, {"time": 8415, "text": "I know we could hand design a controller that would do it, but I don't want that."}, {"time": 8419, "text": "I want to understand the principles that would allow me to solve another problem that's kind of like that."}, {"time": 8425, "text": "But I think if we can stay pure in our approach, then the challenge of tying anybody's shoes is a great challenge."}, {"time": 8436, "text": "That's a great challenge."}, {"time": 8437, "text": "I mean, and the soft touch comes into play there."}, {"time": 8443, "text": "Let me ask another ridiculous question on this topic."}, {"time": 8447, "text": "How important is touch?"}, {"time": 8449, "text": "We haven't talked much about humans, but I have this argument with my dad where like I think you can fall in love with a robot based on language alone."}, {"time": 8462, "text": "And he believes that touch is essential."}, {"time": 8466, "text": "Touch and smell, he says."}, {"time": 8467, "text": "But so in terms of robots, connecting with humans, we can go philosophical in terms of like a deep, meaningful connection, like love, but even just like collaborating in an interesting way, how important is touch like from an engineering perspective and a philosophical one?"}, {"time": 8492, "text": "I think it's super important."}, {"time": 8495, "text": "Even just in a practical sense, if we forget about the emotional part of it."}, {"time": 8500, "text": "But for robots to interact safely while they're doing meaningful mechanical work in the close contact with or vicinity of people that need help, I think we have to have them, we have to build them differently."}, {"time": 8517, "text": "They have to be afraid, not afraid of touching the world."}, {"time": 8519, "text": "So I think Baymax is just awesome."}, {"time": 8522, "text": "That's just like the movie of Big Hero 6 and the concept of Baymax, that's just awesome."}, {"time": 8528, "text": "I think we should, and we have some folks at Toyota that are trying to, Toyota Research that are trying to build Baymax roughly."}, {"time": 8536, "text": "And I think it's just a fantastically good project."}, {"time": 8541, "text": "I think it will change the way people physically interact."}, {"time": 8545, "text": "The same way, I mean, you gave a couple examples earlier, but if the robot that was walking around my home looked more like a teddy bear and a little less like the Terminator, that could change completely the way people perceive it and interact with it."}, {"time": 8559, "text": "And maybe they'll even wanna teach it, like you said, right?"}, {"time": 8564, "text": "You could not quite gamify it, but somehow instead of people judging it and looking at it as if it's not doing as well as a human, they're gonna try to help out the cute teddy bear, right?"}, {"time": 8577, "text": "Who knows, but I think we're building robots wrong and being more soft and more contact is important, right?"}, {"time": 8587, "text": "Yeah, I mean, like all the magical moments I can remember with robots, well, first of all, just visiting your lab and seeing Atlas, but also Spotmini, when I first saw Spotmini in person and hung out with him, her, it, I don't have trouble engendering robots."}, {"time": 8608, "text": "I feel the robotics people really say, oh, is it it?"}, {"time": 8611, "text": "I kinda like the idea that it's a her or a him."}, {"time": 8615, "text": "There's a magical moment, but there's no touching."}, {"time": 8618, "text": "I guess the question I have, have you ever been, like, have you had a human robot experience where a robot touched you?"}, {"time": 8629, "text": "And like, it was like, wait, like, was there a moment that you've forgotten that a robot is a robot and like, the anthropomorphization stepped in and for a second you forgot that it's not human?"}, {"time": 8644, "text": "I mean, I think when you're in on the details, then we, of course, anthropomorphized our work with Atlas, but in verbal communication and the like, I think we were pretty aware of it as a machine that needed to be respected."}, {"time": 8661, "text": "And I actually, I worry more about the smaller robots that could still move quickly if programmed wrong and we have to be careful actually about safety and the like right now."}, {"time": 8673, "text": "And that, if we build our robots correctly, I think then those, a lot of those concerns could go away."}, {"time": 8680, "text": "And we're seeing that trend."}, {"time": 8681, "text": "We're seeing the lower cost, lighter weight arms now that could be fundamentally safe."}, {"time": 8686, "text": "I mean, I do think touch is so fundamental."}, {"time": 8689, "text": "Ted Adelson is great."}, {"time": 8691, "text": "He's a perceptual scientist at MIT and he studied vision most of his life."}, {"time": 8698, "text": "And he said, when I had kids, I expected to be fascinated by their perceptual development."}, {"time": 8706, "text": "But what really, what he noticed was, felt more impressive, more dominant was the way that they would touch everything and lick everything."}, {"time": 8713, "text": "And pick things up, stick it on their tongue and whatever."}, {"time": 8716, "text": "And he said, watching his daughter convinced him that actually he needed to study tactile sensing more."}, {"time": 8725, "text": "So there's something very important."}, {"time": 8730, "text": "I think it's a little bit also of the passive versus active part of the world, right?"}, {"time": 8735, "text": "You can passively perceive the world."}, {"time": 8738, "text": "But it's fundamentally different if you can do an experiment and if you can change the world and you can learn a lot more than a passive observer."}, {"time": 8747, "text": "So you can in dialogue, that was your initial example, you could have an active experiment exchange."}, {"time": 8754, "text": "But I think if you're just a camera watching YouTube, I think that's a very different problem than if you're a robot that can apply force."}, {"time": 8763, "text": "And I think that's a very different problem than if you're a robot that can apply force and touch."}, {"time": 8775, "text": "Yeah, I think it's just an exciting area of research."}, {"time": 8778, "text": "I think you're probably right that this hasn't been under researched."}, {"time": 8783, "text": "To me as a person who's captivated by the idea of human robot interaction, it feels like such a rich opportunity to explore touch."}, {"time": 8794, "text": "Not even from a safety perspective, but like you said, the emotional too."}, {"time": 8798, "text": "I mean, safety comes first, but the next step is like a real human connection."}, {"time": 8808, "text": "Even in the industrial setting, it just feels like it's nice for the robot."}, {"time": 8815, "text": "I don't know, you might disagree with this, but because I think it's important to see robots as tools often, but I don't know, I think they're just always going to be more effective once you humanize them."}, {"time": 8831, "text": "Like it's convenient now to think of them as tools because we want to focus on the safety, but I think ultimately to create like a good experience for the worker, for the person, there has to be a human element."}, {"time": 8847, "text": "I don't know, for me, it feels like an industrial robotic arm would be better if it has a human element."}, {"time": 8854, "text": "I think like Rethink Robotics had that idea with the Baxter and having eyes and so on, having, I don't know, I'm a big believer in that."}, {"time": 8865, "text": "It's not my area, but I am also a big believer."}, {"time": 8869, "text": "Do you have an emotional connection to Atlas?"}, {"time": 8871, "text": "Like do you miss him?"}, {"time": 8874, "text": "I mean, yes, I don't know if I more so than if I had a different science project that I'd worked on super hard, right?"}, {"time": 8883, "text": "But yeah, I mean, the robot, we basically had to do heart surgery on the robot in the final competition because we melted the core."}, {"time": 8898, "text": "Yeah, there was something about watching that robot hanging there."}, {"time": 8900, "text": "We know we had to compete with it in an hour and it was getting its guts ripped out."}, {"time": 8905, "text": "Those are all historic moments."}, {"time": 8907, "text": "I think if you look back like a hundred years from now, yeah, I think those are important moments in robotics."}, {"time": 8915, "text": "I mean, these are the early days."}, {"time": 8916, "text": "You look at like the early days of a lot of scientific disciplines."}, {"time": 8919, "text": "They look ridiculous, they're full of failure, but it feels like robotics will be important in the coming a hundred years."}, {"time": 8928, "text": "And these are the early days."}, {"time": 8930, "text": "So I think a lot of people are, look at a brilliant person such as yourself and are curious about the intellectual journey they've took."}, {"time": 8941, "text": "Is there maybe three books, technical, fiction, philosophical that had a big impact on your life that you would recommend perhaps others reading?"}, {"time": 8955, "text": "Yeah, so I actually didn't read that much as a kid, but I read fairly voraciously now."}, {"time": 8961, "text": "There are some recent books that if you're interested in this kind of topic, like AI Superpowers by Kai Fu Lee is just a fantastic read."}, {"time": 8971, "text": "You must read that."}, {"time": 8975, "text": "Yuval Harari is just, I think that can open your mind."}, {"time": 8980, "text": "Sapiens."}, {"time": 8981, "text": "Sapiens is the first one, Homo Deus is the second, yeah."}, {"time": 8986, "text": "We mentioned it in the book, Homo Deus is the second, yeah."}, {"time": 8991, "text": "We mentioned The Black Swan by Taleb."}, {"time": 8993, "text": "I think that's a good sort of mind opener."}, {"time": 8997, "text": "I actually, so there's maybe a more controversial recommendation I could give."}, {"time": 9006, "text": "Great, we love controversy."}, {"time": 9008, "text": "In some sense, it's so classical it might surprise you, but I actually recently read Mortimer Adler's How to Read a Book, not so long, it was a while ago, but some people hate that book."}, {"time": 9023, "text": "I loved it."}, {"time": 9024, "text": "I think we're in this time right now where, boy, we're just inundated with research papers that you could read on archive with limited peer review and just this wealth of information."}, {"time": 9071, "text": "I think that was really, I read it at the right time where I was just feeling just overwhelmed with really low quality stuff, I guess."}, {"time": 9083, "text": "And similarly, I'm just giving more than three now, I'm sorry if I've exceeded my quota."}, {"time": 9091, "text": "But on that topic just real quick is, so basically finding a few companions to keep for the rest of your life in terms of papers and books and so on and those are the ones, like not doing, what is it, FOMO, fear of missing out, constantly trying to update yourself, but really deeply making a life journey of studying a particular paper, essentially, set of papers."}, {"time": 9148, "text": "But Adler says, no, no, a really good book is a dialogue between you and the author and it crosses time and space and I don't know, I think it's a very romantic, there's a bunch of like specific advice, which you can just gloss over, but the romantic view of how to read and really appreciate it is so good."}, {"time": 9172, "text": "And similarly, teaching, yeah, I thought a lot about teaching and so Isaac Asimov, great science fiction writer, has also actually spent a lot of his career writing nonfiction, right?"}, {"time": 9187, "text": "His memoir is fantastic."}, {"time": 9189, "text": "He was passionate about explaining things, right?"}, {"time": 9192, "text": "He wrote all kinds of books on all kinds of topics in science."}, {"time": 9196, "text": "He was known as the great explainer and I do really resonate with his style and just his way of talking about, by communicating and explaining to something is really the way that you learn something."}, {"time": 9212, "text": "I think about problems very differently because of the way I've been given the opportunity to teach them at MIT."}, {"time": 9222, "text": "We have questions asked, the fear of the lecture, the experience of the lecture and the questions I get and the interactions just forces me to be rock solid on these ideas in a way that if I didn't have that, I don't know, I would be in a different intellectual space."}, {"time": 9238, "text": "Also, video, does that scare you that your lectures are online and people like me in sweatpants can sit sipping coffee and watch you give lectures?"}, {"time": 9248, "text": "I think it's great."}, {"time": 9249, "text": "I do think that something's changed right now, which is, right now we're giving lectures over Zoom."}, {"time": 9256, "text": "I mean, giving seminars over Zoom and everything."}, {"time": 9261, "text": "I'm trying to figure out, I think it's a new medium."}, {"time": 9264, "text": "I'm trying to figure out how to exploit it."}, {"time": 9268, "text": "Yeah, I've been quite cynical about human to human connection over that medium, but I think that's because it hasn't been explored fully and teaching is a different thing."}, {"time": 9285, "text": "Every lecture is a, I'm sorry, every seminar even, I think every talk I give is an opportunity to give that differently."}, {"time": 9294, "text": "I can deliver content directly into your browser."}, {"time": 9297, "text": "You have a WebGL engine right there."}, {"time": 9300, "text": "I can throw 3D content into your browser while you're listening to me, right?"}, {"time": 9306, "text": "And I can assume that you have at least a powerful enough laptop or something to watch Zoom while I'm doing that, while I'm giving a lecture."}, {"time": 9315, "text": "That's a new communication tool that I didn't have last year, right?"}, {"time": 9319, "text": "And I think robotics can potentially benefit a lot from teaching that way."}, {"time": 9326, "text": "We'll see, it's gonna be an experiment this fall."}, {"time": 9329, "text": "I'm thinking a lot about it."}, {"time": 9330, "text": "Yeah, and also like the length of lectures or the length of like, there's something, so like I guarantee you, it's like 80% of people who started listening to our conversation are still listening to now, which is crazy to me."}, {"time": 9348, "text": "But so there's a patience and interest in long form content, but at the same time, there's a magic to forcing yourself to condense an idea to as short as possible."}, {"time": 9362, "text": "As short as possible, like clip, it can be a part of a longer thing, but like just like really beautifully condense an idea."}, {"time": 9369, "text": "There's a lot of opportunity there that's easier to do in remote with, I don't know, with editing too."}, {"time": 9379, "text": "Editing is an interesting thing."}, {"time": 9380, "text": "Like what, you know, most professors don't get, when they give a lecture, they don't get to go back and edit out parts, like crisp it up a little bit."}, {"time": 9391, "text": "That's also, it can do magic."}, {"time": 9394, "text": "Like if you remove like five to 10 minutes from an hour lecture, it can actually, it can make something special of a lecture."}, {"time": 9403, "text": "I've seen that in myself and in others too, because I edit other people's lectures to extract clips."}, {"time": 9410, "text": "It's like, there's certain tangents that are like, that lose, they're not interesting."}, {"time": 9414, "text": "They're mumbling, they're just not, they're not clarifying, they're not helpful at all."}, {"time": 9419, "text": "And once you remove them, it's just, I don't know."}, {"time": 9422, "text": "Editing can be magic."}, {"time": 9424, "text": "It takes a lot of time."}, {"time": 9425, "text": "Yeah, it takes, it depends like what is teaching, you have to ask."}, {"time": 9433, "text": "Cause I find the editing process is also beneficial as for teaching, but also for your own learning."}, {"time": 9441, "text": "I don't know if, have you watched yourself?"}, {"time": 9444, "text": "Have you watched those videos?"}, {"time": 9446, "text": "I mean, not all of them."}, {"time": 9447, "text": "It could be painful to see like how to improve."}, {"time": 9453, "text": "So do you find that, I know you segment your podcast."}, {"time": 9457, "text": "Do you think that helps people with the, the attention span aspect of it?"}, {"time": 9462, "text": "Or is it the segment like sections like, yeah, we're talking about this topic, whatever."}, {"time": 9466, "text": "Nope, nope, that just helps me."}, {"time": 9468, "text": "It's actually bad."}, {"time": 9469, "text": "So, and you've been incredible."}, {"time": 9473, "text": "So I'm learning, like I'm afraid of conversation."}, {"time": 9476, "text": "This is even today, I'm terrified of talking to you."}, {"time": 9479, "text": "I mean, it's something I'm trying to remove for myself."}, {"time": 9484, "text": "There's a guy, I mean, I've learned from a lot of people, but really there's been a few people who's been inspirational to me in terms of conversation."}, {"time": 9494, "text": "Whatever people think of him, Joe Rogan has been inspirational to me because comedians have been too."}, {"time": 9500, "text": "Being able to just have fun and enjoy themselves and lose themselves in conversation that requires you to be a great storyteller, to be able to pull a lot of different pieces of information together."}, {"time": 9512, "text": "But mostly just to enjoy yourself in conversations."}, {"time": 9516, "text": "And I'm trying to learn that."}, {"time": 9518, "text": "These notes are, you see me looking down."}, {"time": 9521, "text": "That's like a safety blanket that I'm trying to let go of more and more."}, {"time": 9526, "text": "So that's, people love just regular conversation."}, {"time": 9529, "text": "That's what they, the structure is like, whatever."}, {"time": 9532, "text": "I would say, I would say maybe like 10 to like, so there's a bunch of, you know, there's probably a couple of thousand PhD students listening to this right now, right?"}, {"time": 9546, "text": "And they might know what we're talking about."}, {"time": 9549, "text": "But there is somebody, I guarantee you right now, in Russia, some kid who's just like, who's just smoked some weed, is sitting back and just enjoying the hell out of this conversation."}, {"time": 9562, "text": "Not really understanding."}, {"time": 9563, "text": "He kind of watched some Boston Dynamics videos."}, {"time": 9565, "text": "He's just enjoying it."}, {"time": 9567, "text": "And I salute you, sir."}, {"time": 9569, "text": "No, but just like, there's so much variety of people that just have curiosity about engineering, about sciences, about mathematics."}, {"time": 9577, "text": "And also like, I should, I mean, enjoying it is one thing, but also often notice it inspires people to, there's a lot of people who are like in their undergraduate studies trying to figure out what, trying to figure out what to pursue."}, {"time": 9596, "text": "And these conversations can really spark the direction of their life."}, {"time": 9601, "text": "And in terms of robotics, I hope it does, because I'm excited about the possibilities of what robotics brings."}, {"time": 9607, "text": "On that topic, do you have advice?"}, {"time": 9612, "text": "Like what advice would you give to a young person about life?"}, {"time": 9618, "text": "A young person about life or a young person about life in robotics?"}, {"time": 9623, "text": "It could be in robotics."}, {"time": 9624, "text": "Robotics, it could be in life in general."}, {"time": 9626, "text": "It could be career."}, {"time": 9628, "text": "It could be a relationship advice."}, {"time": 9631, "text": "It could be running advice."}, {"time": 9632, "text": "Just like they're, that's one of the things I see, like we talked to like 20 year olds."}, {"time": 9638, "text": "They're like, how do I do this thing?"}, {"time": 9642, "text": "What do I do?"}, {"time": 9645, "text": "If they come up to you, what would you tell them?"}, {"time": 9648, "text": "I think it's an interesting time to be a kid these days."}, {"time": 9653, "text": "Everything points to this being sort of a winner, take all economy and the like."}, {"time": 9659, "text": "I think the people that will really excel in my opinion are going to be the ones that can think deeply about problems."}, {"time": 9671, "text": "You have to be able to ask questions agilely and use the internet for everything it's good for and stuff like this."}, {"time": 9676, "text": "And I think a lot of people will develop those skills."}, {"time": 9679, "text": "I think the leaders, thought leaders, robotics leaders, whatever, are gonna be the ones that can do more and they can think very deeply and critically."}, {"time": 9692, "text": "And that's a harder thing to learn."}, {"time": 9695, "text": "I think one path to learning that is through mathematics, through engineering."}, {"time": 9701, "text": "I would encourage people to start math early."}, {"time": 9704, "text": "I mean, I didn't really start."}, {"time": 9706, "text": "I mean, I was always in the better math classes that I could take, but I wasn't pursuing super advanced mathematics or anything like that until I got to MIT."}, {"time": 9716, "text": "I think MIT lit me up and really started the life that I'm living now."}, {"time": 9725, "text": "But yeah, I really want kids to dig deep, really understand things, building things too."}, {"time": 9732, "text": "I mean, pull things apart, put them back together."}, {"time": 9735, "text": "Like that's just such a good way to really understand things and expect it to be a long journey, right?"}, {"time": 9743, "text": "It's, you don't have to know everything."}, {"time": 9747, "text": "You're never gonna know everything."}, {"time": 9749, "text": "So think deeply and stick with it."}, {"time": 9752, "text": "Enjoy the ride, but just make sure you're not, yeah, just make sure you're stopping to think about why things work."}, {"time": 9763, "text": "And it's true, it's easy to lose yourself in the distractions of the world."}, {"time": 9771, "text": "We're overwhelmed with content right now, but you have to stop and pick some of it and really understand it."}, {"time": 9778, "text": "Yeah, on the book point, I've read Animal Farm by George Orwell a ridiculous number of times."}, {"time": 9786, "text": "So for me, like that book, I don't know if it's a good book in general, but for me it connects deeply somehow."}, {"time": 9793, "text": "It somehow connects, so I was born in the Soviet Union."}, {"time": 9798, "text": "So it connects to me into the entirety of the history of the Soviet Union and to World War II and to the love and hatred and suffering that went on there and the corrupting nature of power and greed and just somehow I just, that book has taught me more about life than like anything else."}, {"time": 9819, "text": "Even though it's just like a silly childlike book about pigs, I don't know why, it just connects and inspires."}, {"time": 9829, "text": "The same, there's a few technical books too and algorithms that just, yeah, you return to often."}, {"time": 9841, "text": "Yeah, there's, and I've been losing that because of the internet."}, {"time": 9845, "text": "I've been like going on, I've been going on archive and blog posts and GitHub and the new thing and you lose your ability to really master an idea."}]}]