[{"title": "Oriol Vinyals: DeepMind AlphaStar, StarCraft, and Language | Lex Fridman Podcast #20", "id": "Kedt2or9xlo", "quotes": [{"time": 318, "text": "And people that train for this really play this game at an amazing skill level."}, {"time": 323, "text": "I've seen many times these and if you can witness this life, it's really, really impressive."}, {"time": 329, "text": "So in a way, it's kind of a chess where you don't see the other side of the board, you're building your own pieces and you also need to gather resources to basically get some money to build other buildings, pieces, technology and so on."}, {"time": 342, "text": "From the perspective of a human player, the difference between that and chess or maybe that and a game like turn based strategy like Heroes of Might and Magic is that there's an anxiety because you have to make these decisions really quickly."}, {"time": 358, "text": "And if you are not actually aware of what decisions work, it's a very stressful balance."}, {"time": 366, "text": "Everything you describe is actually quite stressful, difficult to balance for an amateur human player."}, {"time": 371, "text": "I don't know if it gets easier at the professional level, like if they're fully aware of what they have to do, but at the amateur level, there's this anxiety."}, {"time": 379, "text": "Oh crap, I'm being attacked."}, {"time": 380, "text": "Oh crap, I have to build up resource."}, {"time": 382, "text": "Oh, I have to probably expand."}, {"time": 384, "text": "And all these, the time, the real time strategy aspect is really stressful and computationally I'm sure difficult."}, {"time": 391, "text": "We'll get into it."}, {"time": 392, "text": "But for me, Battle.net, so StarCraft was released in 98, 20 years ago, which is hard to believe."}, {"time": 404, "text": "And Blizzard Battle.net with Diablo in 96 came out."}, {"time": 410, "text": "And to me, it might be a narrow perspective, but it changed online gaming and perhaps society forever."}, {"time": 417, "text": "But I may have made way too narrow viewpoint, but from your perspective, can you talk about the history of gaming over the past 20 years?"}, {"time": 426, "text": "Is this, how transformational, how important is this line of games?"}, {"time": 432, "text": "Right, so I think I kind of was an active gamer whilst this was developing, the internet, online gaming."}, {"time": 440, "text": "So for me, the way it came was I played other games, strategy related, I played a bit of Common and Conquer, and then I played Warcraft II, which is from Blizzard."}, {"time": 451, "text": "But at the time, I didn't know, I didn't understand about what Blizzard was or anything."}, {"time": 455, "text": "Warcraft II was just a game, which was actually very similar to StarCraft in many ways."}, {"time": 459, "text": "It's also real time strategy game where there's orcs and humans, so there's only two races."}, {"time": 464, "text": "But it was offline."}, {"time": 466, "text": "And it was offline, right?"}, {"time": 467, "text": "So I remember a friend of mine came to school, say, oh, there's this new cool game called StarCraft."}, {"time": 473, "text": "And I just said, oh, this sounds like just a copy of Warcraft II, until I kind of installed it."}, {"time": 479, "text": "And at the time, I am from Spain, so we didn't have very good internet, right?"}, {"time": 484, "text": "So there was, for us, StarCraft became first kind of an offline experience where you kind of start to play these missions, right?"}, {"time": 492, "text": "You play against some sort of scripted things to develop the story of the characters in the game."}, {"time": 498, "text": "And then later on, I start playing against the built in AI, and I thought it was impossible to defeat it."}, {"time": 505, "text": "Then eventually you defeat one and you can actually play against seven built in AIs at the same time, which also felt impossible."}, {"time": 512, "text": "But actually, it's not that hard to beat seven built in AIs at once."}, {"time": 516, "text": "So once we achieved that, also we discovered that we could play, as I said, internet wasn't that great, but we could play with the LAN, right?"}, {"time": 525, "text": "Like basically against each other if we were in the same place because you could just connect machines with like cables, right?"}, {"time": 533, "text": "So we started playing in LAN mode and as a group of friends, and it was really, really like much more entertaining than playing against AIs."}, {"time": 542, "text": "And later on, as internet was starting to develop and being a bit faster and more reliable, then it's when I started experiencing Battle.net, which is this amazing universe, not only because of the fact that you can play the game against anyone in the world, but you can also get to know more people."}, {"time": 560, "text": "You just get exposed to now like this vast variety of, it's kind of a bit when the chats came about, right?"}, {"time": 565, "text": "There was a chat system."}, {"time": 567, "text": "You could play against people, but you could also chat with people, not only about Stalker, but about anything."}, {"time": 572, "text": "And that became a way of life for kind of two years."}, {"time": 576, "text": "And obviously then it became like kind of, it exploded in me in that I started to play more seriously, going to tournaments and so on and so forth."}, {"time": 584, "text": "Do you have a sense on a societal, sociological level, what's this whole part of society that many of us are not aware of and it's a huge part of society, which is gamers."}, {"time": 596, "text": "I mean, every time I come across that in YouTube or streaming sites, I mean, this is the huge number of people play games religiously."}, {"time": 607, "text": "Do you have a sense of those folks, especially now that you've returned to that realm a little bit on the AI side?"}, {"time": 612, "text": "Yeah, so in fact, even after Stalker, I actually played World of Warcraft, which is maybe the main sort of online worlds or in presence that you get to interact with lots of people."}, {"time": 624, "text": "So I played that for a little bit."}, {"time": 626, "text": "It was to me, it was a bit less stressful than StarCraft because winning was kind of a given."}, {"time": 630, "text": "You just put in this world and you can always complete missions."}, {"time": 634, "text": "But I think it was actually the social aspect of especially StarCraft first and then games like World of Warcraft really shaped me in a very interesting ways because what you get to experience is just people you wouldn't usually interact with, right?"}, {"time": 651, "text": "So even nowadays, I still have many Facebook friends from the area where I played online and their ways of thinking is even political."}, {"time": 660, "text": "They just, we don't live in, like we don't interact in the real world, but we were connected by basically fiber."}, {"time": 666, "text": "And that way I actually get to understand a bit better that we live in a diverse world."}, {"time": 672, "text": "And these were just connections that were made by, because, you know, I happened to go in a city in a virtual city as a priest and I met this warrior and we became friends and then we start like playing together, right?"}, {"time": 685, "text": "So I think it's transformative and more and more and more people are more aware of it."}, {"time": 691, "text": "I mean, it's becoming quite mainstream, but back in the day, as you were saying in 2000, 2005, even it was very, still very strange thing to do, especially in Europe."}, {"time": 704, "text": "I think there were exceptions like Korea, for instance, it was amazing that everything happened so early in terms of cybercafes, like if you go to Seoul, it's a city that back in the day, StarCraft was kind of, you could be a celebrity by playing StarCraft, but this was like 99, 2000, right?"}, {"time": 723, "text": "It's not like recently."}, {"time": 724, "text": "So yeah, it's quite interesting to look back and yeah, I think it's changing society."}, {"time": 730, "text": "The same way, of course, like technology and social networks and so on are also transforming things."}, {"time": 736, "text": "And a quick tangent, let me ask, you're also one of the most productive people in your particular chosen passion and path in life."}, {"time": 746, "text": "And yet you're also appreciate and enjoy video games."}, {"time": 749, "text": "Do you think it's possible to do, to enjoy video games in moderation?"}, {"time": 755, "text": "Someone told me that you could choose two out of three."}, {"time": 759, "text": "When I was playing video games, you could choose having a girlfriend, playing video games or studying."}, {"time": 766, "text": "And I think for the most part, it was relatively true."}, {"time": 770, "text": "These things do take time."}, {"time": 772, "text": "Games like StarCraft, if you take the game pretty seriously and you wanna study it, then you obviously will dedicate more time to it."}, {"time": 779, "text": "And I definitely took gaming and obviously studying very seriously."}, {"time": 783, "text": "I love learning science and et cetera."}, {"time": 788, "text": "So to me, especially when I started university undergrad, I kind of step off StarCraft."}, {"time": 794, "text": "I actually fully stopped playing."}, {"time": 796, "text": "And then World of Warcraft was a bit more casual."}, {"time": 799, "text": "You could just connect online."}, {"time": 800, "text": "And I mean, it was fun."}, {"time": 802, "text": "But as I said, that was not as much time investment as it was for me in StarCraft."}, {"time": 809, "text": "Okay, so let's get into AlphaStar."}, {"time": 811, "text": "What are the, you're behind the team."}, {"time": 815, "text": "So DeepMind has been working on StarCraft and released a bunch of cool open source agents and so on the past few years."}, {"time": 821, "text": "But AlphaStar really is the moment where the first time you beat a world class player."}, {"time": 829, "text": "So what are the parameters of the challenge in the way that AlphaStar took it on and how did you and David and the rest of the DeepMind team get into it?"}, {"time": 838, "text": "Consider that you can even beat the best in the world or top players."}, {"time": 842, "text": "I think it all started back in 2015."}, {"time": 848, "text": "Actually, I'm lying."}, {"time": 848, "text": "I think it was 2014 when DeepMind was acquired by Google."}, {"time": 854, "text": "And I at the time was at Google Brain, which was in California, is still in California."}, {"time": 858, "text": "We had this summit where we got together, the two groups."}, {"time": 861, "text": "So Google Brain and Google DeepMind got together and we gave a series of talks."}, {"time": 866, "text": "And given that they were doing deep reinforcement learning for games, I decided to bring up part of my past, which I had developed at Berkeley, like this thing which we call Berkeley OverMind, which is really just a StarCraft one bot, right?"}, {"time": 880, "text": "So I talked about that."}, {"time": 882, "text": "And I remember Demis just came to me and said, well, maybe not now, it's perhaps a bit too early, but you should just come to DeepMind and do this again with deep reinforcement learning, right?"}, {"time": 893, "text": "And at the time it sounded very science fiction for several reasons."}, {"time": 898, "text": "But then in 2016, when I actually moved to London and joined DeepMind transferring from Brain, it became apparent that because of the AlphaGo moment and kind of Blizzard reaching out to us to say, wait, like, do you want the next challenge?"}, {"time": 913, "text": "And also me being full time at DeepMind, so sort of kind of all these came together."}, {"time": 917, "text": "And then I went to Irvine in California, to the Blizzard headquarters to just chat with them and try to explain how would it all work before you do anything."}, {"time": 927, "text": "And the approach has always been about the learning perspective, right?"}, {"time": 933, "text": "So in Berkeley, we did a lot of rule based conditioning and if you have more than three units, then go attack."}, {"time": 942, "text": "And if the other has more units than me, I retreat and so on and so forth."}, {"time": 946, "text": "And of course, the point of deep reinforcement learning, deep learning, machine learning in general is that all these should be learned behavior."}, {"time": 953, "text": "So that kind of was the DNA of the project since its inception in 2016, where we just didn't even have an environment to work with."}, {"time": 962, "text": "And so that's how it all started really."}, {"time": 965, "text": "So if you go back to that conversation with Demis or even in your own head, how far away did you, because we're talking about Atari games, we're talking about Go, which is kind of, if you're honest about it, really far away from StarCraft."}, {"time": 980, "text": "In, well, now that you've beaten it, maybe you could say it's close, but it's much, it seems like StarCraft is way harder than Go philosophically and mathematically speaking."}, {"time": 990, "text": "So how far away did you think you were?"}, {"time": 994, "text": "Do you think it's 2019 and 18 you could be doing as well as you have?"}, {"time": 997, "text": "Yeah, when I kind of thought about, okay, I'm gonna dedicate a lot of my time and focus on this."}, {"time": 1004, "text": "And obviously I do a lot of different research in deep learning."}, {"time": 1008, "text": "So spending time on it, I mean, I really had to kind of think there's gonna be something good happening out of this."}, {"time": 1015, "text": "So really I thought, well, this sounds impossible."}, {"time": 1018, "text": "And it probably is impossible to do the full thing, like the full game where you play one versus one and it's only a neural network playing and so on."}, {"time": 1029, "text": "So it really felt like, I just didn't even think it was possible."}, {"time": 1033, "text": "But on the other hand, I could see some stepping stones towards that goal."}, {"time": 1038, "text": "Clearly you could define sub problems in StarCraft and sort of dissect it a bit and say, okay, here is a part of the game, here's another part."}, {"time": 1046, "text": "And also obviously the fact, so this was really also critical to me, the fact that we could access human replays, right?"}, {"time": 1054, "text": "So Blizzard was very kind."}, {"time": 1055, "text": "And in fact, they open source these for the whole community where you can just go and it's not every single StarCraft game ever played, but it's a lot of them you can just go and download."}, {"time": 1065, "text": "And every day they will, you can just query a data set and say, well, give me all the games that were played today."}, {"time": 1071, "text": "And given my kind of experience with language and sequences and supervised learning, I thought, well, that's definitely gonna be very helpful and something quite unique now, because ever before we had such a large data set of replays, of people playing the game at this scale of such a complex video game, right?"}, {"time": 1092, "text": "So that to me was a precious resource."}, {"time": 1095, "text": "And as soon as I knew that Blizzard was able to kind of give this to the community, I started to feel positive about something non trivial happening."}, {"time": 1104, "text": "But I also thought the full thing, like really no rules, no single line of code that tries to say, well, I mean, if you see this unit, build a detector, all these, not having any of these specializations seemed really, really, really difficult to me."}, {"time": 1118, "text": "Intuitively."}, {"time": 1119, "text": "I do also like that Blizzard was teasing or even trolling you, sort of almost, yeah, pulling you in into this really difficult challenge."}, {"time": 1130, "text": "Do they have any awareness?"}, {"time": 1131, "text": "What's the interest from the perspective of Blizzard, except just curiosity?"}, {"time": 1137, "text": "Yeah, I think Blizzard has really understood and really bring forward this competitiveness of esports in games."}, {"time": 1144, "text": "The StarCraft really kind of sparked a lot of, like something that almost was never seen, especially as I was saying, back in Korea."}, {"time": 1153, "text": "So they just probably thought, well, this is such a pure one versus one setup that it would be great to see if something that can play Atari or Go and then later on chess could even tackle these kind of complex real time strategy game, right?"}, {"time": 1170, "text": "So for them, they wanted to see first, obviously whether it was possible, if the game they created was in a way solvable to some extent."}, {"time": 1180, "text": "And I think on the other hand, they also are a pretty modern company that innovates a lot."}, {"time": 1185, "text": "So just starting to understand AI for them to how to bring AI into games is not AI for games, but games for AI, right?"}, {"time": 1194, "text": "I mean, both ways I think can work."}, {"time": 1196, "text": "And we obviously at DeepMind use games for AI, right?"}, {"time": 1200, "text": "To drive AI progress, but Blizzard might actually be able to do and many other companies to start to understand and do the opposite."}, {"time": 1206, "text": "So I think that is also something they can get out of these."}, {"time": 1209, "text": "And they definitely, we have brainstormed a lot about these, right?"}, {"time": 1213, "text": "But one of the interesting things to me about StarCraft and Diablo and these games that Blizzard has created is the task of balancing classes, for example."}, {"time": 1223, "text": "Sort of making the game fair from the starting point and then let skill determine the outcome."}, {"time": 1230, "text": "Is there, I mean, can you first comment, there's three races, Zerg, Protoss and Terran."}, {"time": 1236, "text": "I don't know if I've ever said that out loud."}, {"time": 1238, "text": "Is that how you pronounce it?"}, {"time": 1240, "text": "Terran?"}, {"time": 1240, "text": "Yeah, Terran."}, {"time": 1244, "text": "Yeah, I don't think I've ever in person interacted with anybody about StarCraft, that's funny."}, {"time": 1249, "text": "So they seem to be pretty balanced."}, {"time": 1251, "text": "I wonder if the AI, the work that you're doing with AlphaStar would help balance them even further."}, {"time": 1259, "text": "Is that something you think about?"}, {"time": 1260, "text": "Is that something that Blizzard is thinking about?"}, {"time": 1263, "text": "Right, so balancing when you add a new unit or a new spell type is obviously possible given that you can always train or pre train at scale some agent that might start using that in unintended ways."}, {"time": 1276, "text": "But I think actually, if you understand how StarCraft has kind of co evolved with players, in a way, I think it's actually very cool the ways that many of the things and strategies that people came up with, right?"}, {"time": 1288, "text": "So I think we've seen it over and over in StarCraft that Blizzard comes up with maybe a new unit and then some players get creative and do something kind of unintentional or something that Blizzard designers that just simply didn't test or think about."}, {"time": 1303, "text": "And then after that becomes kind of mainstream in the community, Blizzard patches the game and then they kind of maybe weaken that strategy or make it actually more interesting but a bit more balanced."}, {"time": 1315, "text": "So these kind of continual talk between players and Blizzard is kind of what has defined them actually in actually most games in StarCraft but also in World of Warcraft, they would do that."}, {"time": 1326, "text": "There are several classes and it would be not good that everyone plays absolutely the same race and so on, right?"}, {"time": 1333, "text": "So I think they do care about balancing of course and they do a fair amount of testing but it's also beautiful to also see how players get creative anyways."}, {"time": 1344, "text": "And I mean, whether AI can be more creative at this point, I don't think so, right?"}, {"time": 1348, "text": "I mean, it's just sometimes something so amazing happens."}, {"time": 1351, "text": "Like I remember back in the days, like you have these drop ships that could drop the rivers and that was actually not thought about that you could drop this unit that has this what's called splash damage that would basically eliminate all the enemies workers at once."}, {"time": 1367, "text": "No one thought that you could actually put them in really early game, do that kind of damage and then things change in the game."}, {"time": 1375, "text": "But I don't know, I think it's quite an amazing exploration process from both sides, players and Blizzard alike."}, {"time": 1381, "text": "Well, it's almost like a reinforcement learning exploration but the scale of humans that play Blizzard games is almost on the scale of a large scale deep mind RL experiment."}, {"time": 1395, "text": "I mean, if you look at the numbers, I mean, you're talking about, I don't know how many games but hundreds of thousands of games probably a month."}, {"time": 1402, "text": "I mean, so it's almost the same as running RL agents."}, {"time": 1408, "text": "What aspect of the problem of Starcraft do you think is the hardest?"}, {"time": 1412, "text": "Is it the, like you said, the imperfect information?"}, {"time": 1415, "text": "Is it the fact they have to do longterm planning?"}, {"time": 1418, "text": "Is it the real time aspects?"}, {"time": 1420, "text": "We have to do stuff really quickly."}, {"time": 1422, "text": "Is it the fact that a large action space so you can do so many possible things?"}, {"time": 1427, "text": "Or is it, you know, in the game theoretic sense there is no Nash equilibrium or at least you don't know what the optimal strategy is because there's way too many options."}, {"time": 1437, "text": "Is there something that stands out as just like the hardest the most annoying thing?"}, {"time": 1441, "text": "So when we sort of looked at the problem and start to define like the parameters of it, right?"}, {"time": 1447, "text": "What are the observations?"}, {"time": 1448, "text": "What are the actions?"}, {"time": 1450, "text": "It became very apparent that, you know, the very first barrier that one would hit in Starcraft would be because of the action space being so large and as not being able to search like you could in chess or go even though the search space is vast."}, {"time": 1468, "text": "The main problem that we identified was that of exploration, right?"}, {"time": 1472, "text": "So without any sort of human knowledge or human prior, if you think about Starcraft and you know how deep reinforcement learnings algorithm work which is essentially by issuing random actions and hoping that they will get some wins sometimes so they could learn."}, {"time": 1489, "text": "So if you think of the action space in Starcraft almost anything you can do in the early game is bad because any action involves taking workers which are mining minerals for free."}, {"time": 1501, "text": "That's something that the game does automatically sends them to mine."}, {"time": 1504, "text": "And you would immediately just take them out of mining and send them around."}, {"time": 1509, "text": "So just thinking how is it gonna be possible to get to understand these concepts but even more like expanding, right?"}, {"time": 1519, "text": "There's these buildings you can place in other locations in the map to gather more resources but the location of the building is important and you have to select a worker, send it walking to that location, build the building, wait for the building to be built and then put extra workers there so they start mining."}, {"time": 1537, "text": "That feels like impossible if you just randomly click to produce that state, desirable state that then you could hope to learn from because eventually that may yield to an extra win, right?"}, {"time": 1549, "text": "So for me, the exploration problem and due to the action space and the fact that there's not really turns, there's so many turns because the game essentially takes that 22 times per second."}, {"time": 1562, "text": "I mean, that's how they could discretize sort of time."}, {"time": 1565, "text": "Obviously you always have to discretize time but there's no such thing as real time but it's really a lot of time steps of things that could go wrong."}, {"time": 1574, "text": "And that definitely felt a priori like the hardest."}, {"time": 1577, "text": "You mentioned many good ones."}, {"time": 1579, "text": "I think partial observability and the fact that there is no perfect strategy because of the partial observability."}, {"time": 1585, "text": "Those are very interesting problems."}, {"time": 1586, "text": "We start seeing more and more now in terms of as we solve the previous ones but the core problem to me was exploration and solving it has been basically kind of the focus and how we saw the first breakthroughs."}, {"time": 1599, "text": "So exploration in a multi hierarchical way."}, {"time": 1603, "text": "So like 22 times a second exploration has a very different meaning than it does in terms of should I gather resources early or should I wait or so on."}, {"time": 1613, "text": "So how do you solve the longterm?"}, {"time": 1616, "text": "Let's talk about the internals of AlphaStar."}, {"time": 1618, "text": "So first of all, how do you represent the state of the game as an input?"}, {"time": 1625, "text": "How do you then do the longterm sequence modeling?"}, {"time": 1628, "text": "How do you build a policy?"}, {"time": 1630, "text": "What's the architecture like?"}, {"time": 1632, "text": "So AlphaStar has obviously several components but everything passes through what we call the policy which is a neural network."}, {"time": 1642, "text": "And that's kind of the beauty of it."}, {"time": 1644, "text": "There is, I could just now give you a neural network and some weights."}, {"time": 1648, "text": "And if you fed the right observations and you understood the actions the same way we do you would have basically the agent playing the game."}, {"time": 1655, "text": "There's absolutely nothing else needed other than those weights that were trained."}, {"time": 1660, "text": "Now, the first step is observing the game and we've experimented with a few alternatives."}, {"time": 1666, "text": "The one that we currently use mixes both spatial sort of images that you would process from the game that is the zoomed out version of the map and also a zoomed in version of the camera or the screen as we call it."}, {"time": 1680, "text": "But also we give to the agent the list of units that it sees more of as a set of objects that it can operate on."}, {"time": 1691, "text": "That is not necessarily required to use it."}, {"time": 1694, "text": "And we have versions of the game that play well without this set vision that is a bit not like how humans perceive the game."}, {"time": 1701, "text": "But it certainly helps a lot because it's a very natural way to encode the game is by just looking at all the units that there are."}, {"time": 1709, "text": "They have properties like health, position, type of unit whether it's my unit or the enemies."}, {"time": 1716, "text": "And that sort of is kind of the summary of the state of the game, that list of units or set of units that you see all the time."}, {"time": 1727, "text": "But that's pretty close to the way humans see the game."}, {"time": 1729, "text": "Why do you say it's not, isn't that, you're saying the exactness of it is not similar to humans?"}, {"time": 1735, "text": "The exactness of it is perhaps not the problem."}, {"time": 1737, "text": "I guess maybe the problem if you look at it from how actually humans play the game is that they play with a mouse and a keyboard and a screen and they don't see sort of a structured object with all the units."}, {"time": 1749, "text": "What they see is what they see on the screen, right?"}, {"time": 1753, "text": "Remember that there's a, sorry to interrupt, there's a plot that you showed with camera base where you do exactly that, right?"}, {"time": 1758, "text": "You move around and that seems to converge to similar performance."}, {"time": 1762, "text": "Yeah, I think that's what I, we're kind of experimenting with what's necessary or not, but using the set."}, {"time": 1768, "text": "So, actually, if you look at research in computer vision, where it makes a lot of sense to treat images as two dimensional arrays, there's actually a very nice paper from Facebook."}, {"time": 1780, "text": "I think, I forgot who the authors are, but I think it's part of Caming's group."}, {"time": 1786, "text": "And what they do is they take an image, which is this two dimensional signal, and they actually take pixel by pixel and scramble the image as if it was just a list of pixels."}, {"time": 1799, "text": "Crucially, they encode the position of the pixels with the X, Y coordinates."}, {"time": 1803, "text": "And this is just kind of a new architecture, which we incidentally also use in StarCraft called the Transformer, which is a very popular paper from last year, which yielded very nice result in machine translation."}, {"time": 1815, "text": "And if you actually believe in this kind of, oh, it's actually a set of pixels, as long as you encode X, Y, it's okay, then you could argue that the list of units that we see is precisely that, because we have each unit as a kind of pixel, if you will, and then their X, Y coordinates."}, {"time": 1833, "text": "So in that perspective, we, without knowing it, we use the same architecture that was shown to work very well on Pascal and ImageNet and so on."}, {"time": 1841, "text": "So the interesting thing here is putting it in that way it starts to move it towards the way you usually work with language."}, {"time": 1849, "text": "So what, and especially with your expertise and work in language, it seems like there's echoes of a lot of the way you would work with natural language in the way you've approached AlphaStar."}, {"time": 1863, "text": "What's, does that help with the longterm sequence modeling there somehow?"}, {"time": 1868, "text": "Exactly, so now that we understand what an observation for a given time step is, we need to move on to say, well, there's going to be a sequence of such observations and an agent will need to, given all that it's seen, not only the current time step, but all that it's seen, why?"}, {"time": 1884, "text": "Because there is partial observability."}, {"time": 1885, "text": "We must remember whether we saw a worker going somewhere, for instance, right?"}, {"time": 1890, "text": "Because then there might be an expansion on the top right of the map."}, {"time": 1893, "text": "So given that, what you must then think about is there is the problem of given all the observations, you have to predict the next action."}, {"time": 1902, "text": "And not only given all the observations, but given all the observations and given all the actions you've taken, predict the next action."}, {"time": 1909, "text": "And that sounds exactly like machine translation where, and that's exactly how kind of I saw the problem, especially when you are given supervised data or replays from humans, because the problem is exactly the same."}, {"time": 1923, "text": "You're translating essentially a prefix of observations and actions onto what's going to happen next, which is exactly how you would train a model to translate or to generate language as well, right?"}, {"time": 1934, "text": "Do you have a certain prefix?"}, {"time": 1936, "text": "You must remember everything that comes in the past because otherwise you might start having noncoherent text."}, {"time": 1942, "text": "And the same architectures we're using LSTMs and transformers to operate on across time to kind of integrate all that's happened in the past."}, {"time": 1953, "text": "Those architectures that work so well in translation or language modeling are exactly the same than what the agent is using to issue actions in the game."}, {"time": 1962, "text": "And the way we train it, moreover, for imitation, which is step one of AlphaStar is, take all the human experience and try to imitate it, much like you try to imitate translators that translated many pairs of sentences from French to English say, that sort of principle applies exactly the same."}, {"time": 1980, "text": "It's almost the same code, except that instead of words, you have a slightly more complicated objects, which are the observations and the actions are also a bit more complicated than a word."}, {"time": 1991, "text": "Is there a self play component then too?"}, {"time": 1993, "text": "So once you run out of imitation?"}, {"time": 1996, "text": "Right, so indeed you can bootstrap from human replays, but then the agents you get are actually not as good as the humans you imitated, right?"}, {"time": 2008, "text": "So how do we imitate?"}, {"time": 2010, "text": "Well, we take humans from 3000 MMR and higher."}, {"time": 2014, "text": "3000 MMR is just a metric of human skill and 3000 MMR might be like 50% percentile, right?"}, {"time": 2021, "text": "So it's just average human."}, {"time": 2024, "text": "So maybe quick pause, MMR is a ranking scale, the matchmaking rating for players."}, {"time": 2030, "text": "So it's 3000, I remember there's like a master and a grand master, what's 3000?"}, {"time": 2034, "text": "So 3000 is pretty bad."}, {"time": 2036, "text": "I think it's kind of goals level."}, {"time": 2038, "text": "It just sounds really good relative to chess, I think."}, {"time": 2040, "text": "Oh yeah, yeah, no, the ratings, the best in the world are at 7,000 MMR."}, {"time": 2045, "text": "So 3000, it's a bit like Elo indeed, right?"}, {"time": 2047, "text": "So 3,500 just allows us to not filter a lot of the data."}, {"time": 2053, "text": "So we like to have a lot of data in deep learning as you probably know."}, {"time": 2057, "text": "So we take these kind of 3,500 and above, but then we do a very interesting trick, which is we tell the neural network what level they are imitating."}, {"time": 2067, "text": "So we say, this replay you're gonna try to imitate to predict the next action for all the actions that you're gonna see is a 4,000 MMR replay."}, {"time": 2076, "text": "This one is a 6,000 MMR replay."}, {"time": 2078, "text": "And what's cool about this is then we take this policy that is being trained from human, and then we can ask it to play like a 3000 MMR player by setting a beat saying, well, okay, play like a 3000 MMR player or play like a 6,000 MMR player."}, {"time": 2093, "text": "And you actually see how the policy behaves differently."}, {"time": 2097, "text": "It gets worse economy if you play like a goal level player, it does less actions per minute, which is the number of clicks or number of actions that you will issue in a whole minute."}, {"time": 2107, "text": "And it's very interesting to see that it kind of imitates the skill level quite well."}, {"time": 2112, "text": "But if we ask it to play like a 6,000 MMR player, we tested, of course, these policies to see how well they do."}, {"time": 2118, "text": "They actually beat all the built in AIs that Blizzard put in the game, but they're nowhere near 6,000 MMR players, right?"}, {"time": 2125, "text": "They might be maybe around goal level, platinum, perhaps."}, {"time": 2129, "text": "So there's still a lot of work to be done for the policy to truly understand what it means to win."}, {"time": 2135, "text": "So far, we only asked them, okay, here is the screen."}, {"time": 2138, "text": "And that's what's happened on the game until this point."}, {"time": 2141, "text": "What would the next action be if we ask a pro to now say, oh, you're gonna click here or here or there."}, {"time": 2149, "text": "And the point is experiencing wins and losses is very important to then start to refine."}, {"time": 2156, "text": "Otherwise the policy can get loose, can just go off policy as we call it."}, {"time": 2160, "text": "That's so interesting that you can at least hope eventually to be able to control a policy approximately to be at some MMR level."}, {"time": 2170, "text": "That's so interesting, especially given that you have ground truth for a lot of these cases."}, {"time": 2175, "text": "Can I ask you a personal question?"}, {"time": 2177, "text": "What's your MMR?"}, {"time": 2179, "text": "Well, I haven't played StarCraft II, so I am unranked, which is the kind of lowest league."}, {"time": 2186, "text": "So I used to play StarCraft, the first one."}, {"time": 2189, "text": "But you haven't seriously played StarCraft II."}, {"time": 2192, "text": "So the best player we have at DeepMind is about 5,000 MMR, which is high masters."}, {"time": 2199, "text": "It's not at grand master level."}, {"time": 2202, "text": "Grand master level will be the top 200 players in a certain region like Europe or America or Asia."}, {"time": 2209, "text": "But for me, it would be hard to say."}, {"time": 2211, "text": "I am very bad at the game."}, {"time": 2213, "text": "I actually played AlphaStar a bit too late and it beat me."}, {"time": 2216, "text": "I remember the whole team was, oh, Oreo, you should play."}, {"time": 2219, "text": "And I was, oh, it looks like it's not so good yet."}, {"time": 2222, "text": "And then I remember I kind of got busy and waited an extra week and I played and it really beat me very badly."}, {"time": 2229, "text": "Was that, I mean, how did that feel?"}, {"time": 2231, "text": "Isn't that an amazing feeling?"}, {"time": 2232, "text": "That's amazing, yeah."}, {"time": 2233, "text": "I mean, obviously I tried my best and I tried to also impress my, because I actually played the first game."}, {"time": 2239, "text": "So I'm still pretty good at micromanagement."}, {"time": 2243, "text": "The problem is I just don't understand StarCraft II."}, {"time": 2245, "text": "I understand StarCraft."}, {"time": 2247, "text": "And when I played StarCraft, I probably was consistently like for a couple of years, top 32 in Europe."}, {"time": 2254, "text": "So I was decent, but at the time we didn't have this kind of MMR system as well established."}, {"time": 2260, "text": "So it would be hard to know what it was back then."}, {"time": 2263, "text": "So what's the difference in interface between AlphaStar and StarCraft and a human player in StarCraft?"}, {"time": 2269, "text": "Is there any significant differences between the way they both see the game?"}, {"time": 2274, "text": "I would say the way they see the game, there's a few things that are just very hard to simulate."}, {"time": 2281, "text": "The main one perhaps, which is obvious in hindsight is what's called cloaked units, which are invisible units."}, {"time": 2290, "text": "So in StarCraft, you can make some units that you need to have a particular kind of unit to detect it."}, {"time": 2298, "text": "So these units are invisible."}, {"time": 2300, "text": "If you cannot detect them, you cannot target them."}, {"time": 2302, "text": "So they would just destroy your buildings or kill your workers."}, {"time": 2307, "text": "But despite the fact you cannot target the unit, there's a shimmer that as a human you observe."}, {"time": 2314, "text": "I mean, you need to train a little bit, you need to pay attention, but you would see this kind of space time distortion and you would know, okay, there are, yeah."}, {"time": 2324, "text": "Yeah, there's like a wave thing."}, {"time": 2326, "text": "Yeah, it's called shimmer."}, {"time": 2327, "text": "Space time distortion, I like it."}, {"time": 2329, "text": "That's really like, the Blizzard term is shimmer."}, {"time": 2331, "text": "Shimmer, okay."}, {"time": 2332, "text": "And so these shimmer professional players actually can see it immediately."}, {"time": 2337, "text": "They understand it very well, but it's still something that requires certain amount of attention and it's kind of a bit annoying to deal with."}, {"time": 2345, "text": "Whereas for AlphaStar, in terms of vision, it's very hard for us to simulate sort of, oh, are you looking at this pixel in the screen and so on?"}, {"time": 2354, "text": "So the only thing we can do is, there is a unit that's invisible over there."}, {"time": 2359, "text": "So AlphaStar would know that immediately."}, {"time": 2362, "text": "Obviously still obeys the rules."}, {"time": 2364, "text": "You cannot attack the unit."}, {"time": 2365, "text": "You must have a detector and so on, but it's kind of one of the main things that it just doesn't feel there's a very proper way."}, {"time": 2372, "text": "I mean, you could imagine, oh, you don't have hypers."}, {"time": 2375, "text": "Maybe you don't know exactly where it is, or sometimes you see it, sometimes you don't, but it's just really, really complicated to get it so that everyone would agree, oh, that's the best way to simulate this, right?"}, {"time": 2387, "text": "It seems like a perception problem."}, {"time": 2389, "text": "It is a perception problem."}, {"time": 2390, "text": "So the only problem is people, you ask, oh, what's the difference between how humans perceive the game?"}, {"time": 2396, "text": "I would say they wouldn't be able to tell a shimmer immediately as it appears on the screen, whereas AlphaStar in principle sees it very sharply, right?"}, {"time": 2405, "text": "It sees that the bit turned from zero to one, meaning there's now a unit there, although you don't know the unit, or you know that you cannot attack it and so on."}, {"time": 2415, "text": "So that from a vision standpoint, that probably is the one that is kind of the most obvious one."}, {"time": 2422, "text": "Then there are things humans cannot do perfectly, even professionals, which is they might miss a detail, or they might have not seen a unit."}, {"time": 2430, "text": "And obviously as a computer, if there's a corner of the screen that turns green because a unit enters the field of view, that can go into the memory of the agent, the LSTM, and persist there for a while, and for however long is relevant, right?"}, {"time": 2445, "text": "And in terms of action, it seems like the rate of action from AlphaStar is comparative, if not slower than professional players, but it's more precise is what I read."}, {"time": 2457, "text": "So that's really probably the one that is causing us more issues for a couple of reasons, right?"}, {"time": 2465, "text": "The first one is StarCraft has been an AI environment for quite a few years."}, {"time": 2469, "text": "In fact, I mean, I was participating in the very first competition back in 2010."}, {"time": 2475, "text": "And there's really not been a kind of a very clear set of rules how the actions per minute, the rate of actions that you can issue is."}, {"time": 2484, "text": "And as a result, these agents or bots that people build in a kind of almost very cool way, they do like 20,000, 40,000 actions per minute."}, {"time": 2495, "text": "Now, to put this in perspective, a very good professional human might do 300 to 800 actions per minute."}, {"time": 2504, "text": "They might not be as precise."}, {"time": 2505, "text": "That's why the range is a bit tricky to identify exactly."}, {"time": 2509, "text": "I mean, 300 actions per minute precisely is probably realistic."}, {"time": 2513, "text": "800 is probably not, but you see humans doing a lot of actions because they warm up and they kind of select things and spam and so on just so that when they need, they have the accuracy."}, {"time": 2524, "text": "So we came into this by not having kind of a standard way to say, well, how do we measure whether an agent is at human level or not?"}, {"time": 2535, "text": "On the other hand, we had a huge advantage, which is because we do imitation learning, agents turned out to act like humans in terms of rate of actions, even precisions and imprecisions of actions in the supervised policy."}, {"time": 2550, "text": "You could see all these."}, {"time": 2551, "text": "You could see how agents like to spam click, to move here."}, {"time": 2554, "text": "If you played especially Diablo, you wouldn't know what I mean."}, {"time": 2557, "text": "I mean, you just like spam, oh, move here, move here, move here."}, {"time": 2560, "text": "You're doing literally like maybe five actions in two seconds, but these actions are not very meaningful."}, {"time": 2566, "text": "One would have sufficed."}, {"time": 2568, "text": "So on the one hand, we start from this imitation policy that is at the ballpark of the actions per minutes of humans because it's actually statistically trying to imitate humans."}, {"time": 2578, "text": "So we see these very nicely in the curves that we showed in the blog post."}, {"time": 2582, "text": "There's these actions per minute, and the distribution looks very human like."}, {"time": 2587, "text": "But then, of course, as self play kicks in, and that's the part we haven't talked too much yet, but of course, the agent must play against itself to improve, then there's almost no guarantees that these actions will not become more precise or even the rate of actions is going to increase over time."}, {"time": 2606, "text": "So what we did, and this is probably the first attempt that we thought was reasonable, is we looked at the distribution of actions for humans for certain windows of time."}, {"time": 2616, "text": "And just to give a perspective, because I guess I mentioned that some of these agents that are programmatic, let's call them."}, {"time": 2622, "text": "They do 40,000 actions per minute."}, {"time": 2624, "text": "Professionals, as I said, do 300 to 800."}, {"time": 2627, "text": "So what we looked is we look at the distribution over professional gamers, and we took reasonably high actions per minute, but we kind of identify certain cutoffs after which, even if the agent wanted to act, these actions would be dropped."}, {"time": 2642, "text": "But the problem is this cutoff is probably set a bit too high."}, {"time": 2647, "text": "And what ends up happening, even though the games, and when we ask the professionals and the gamers, by and large, they feel like it's playing humanlike, there are some agents that developed maybe slightly too high APMs, which is actions per minute, combined with the precision, which made people start discussing a very interesting issue, which is, should we have limited these?"}, {"time": 2672, "text": "Should we just let it lose and see what cool things it can come up with?"}, {"time": 2678, "text": "So this is in itself an extremely interesting question, but the same way that modeling the shimmer would be so difficult, modeling absolutely all the details about muscles and precision and tiredness of humans would be quite difficult."}, {"time": 2692, "text": "So we're really here kind of innovating in this sense of, OK, what could be maybe the next iteration of putting more rules that makes the agents more humanlike in terms of restrictions?"}, {"time": 2706, "text": "Yeah, putting constraints that."}, {"time": 2708, "text": "More constraints, yeah."}, {"time": 2710, "text": "That's really innovative."}, {"time": 2711, "text": "So one of the constraints you put on yourself, or at least focused in, is on the Protoss race, as far as I understand."}, {"time": 2719, "text": "Can you tell me about the different races and how they, so Protoss, Terran, and Zerg, how do they compare?"}, {"time": 2727, "text": "How do they interact?"}, {"time": 2728, "text": "Why did you choose Protoss?"}, {"time": 2730, "text": "Yeah, in the dynamics of the game seen from a strategic perspective."}, {"time": 2735, "text": "So Protoss, so in StarCraft there are three races."}, {"time": 2739, "text": "Indeed, in the demonstration, we saw only the Protoss race."}, {"time": 2743, "text": "So maybe let's start with that one."}, {"time": 2745, "text": "Protoss is kind of the most technologically advanced race."}, {"time": 2749, "text": "It has units that are expensive but powerful."}, {"time": 2753, "text": "So in general, you want to kind of conserve your units as you go attack."}, {"time": 2759, "text": "And then you want to utilize these tactical advantages of very fancy spells and so on and so forth."}, {"time": 2767, "text": "And at the same time, they're kind of, people say they're a bit easier to play perhaps."}, {"time": 2775, "text": "But that I actually didn't know."}, {"time": 2777, "text": "I mean, I just talked now a lot to the players that we work with, TLO and Mana, and they said, oh yeah, Protoss is actually, people think, is actually one of the easiest races."}, {"time": 2786, "text": "So perhaps the easier, that doesn't mean that it's obviously professional players excel at the three races."}, {"time": 2794, "text": "And there's never a race that dominates for a very long time anyway."}, {"time": 2798, "text": "So if you look at the top, I don't know, 100 in the world, is there one race that dominates that list?"}, {"time": 2804, "text": "It would be hard to know because it depends on the regions."}, {"time": 2806, "text": "I think it's pretty equal in terms of distribution."}, {"time": 2810, "text": "And Blizzard wants it to be equal."}, {"time": 2813, "text": "They wouldn't want one race like Protoss to not be representative in the top place."}, {"time": 2819, "text": "So definitely, they tried it to be balanced."}, {"time": 2823, "text": "So then maybe the opposite race of Protoss is Zerg."}, {"time": 2827, "text": "Zerg is a race where you just kind of expand and take over as many resources as you can, and they have a very high capacity to regenerate their units."}, {"time": 2837, "text": "So if you have an army, it's not that valuable in terms of losing the whole army is not a big deal as Zerg because you can then rebuild it."}, {"time": 2845, "text": "And given that you generally accumulate a huge bank of resources, Zergs typically play by applying a lot of pressure, maybe losing their whole army, but then rebuilding it quickly."}, {"time": 2857, "text": "So although, of course, every race, I mean, there's never, I mean, they're pretty diverse."}, {"time": 2863, "text": "I mean, there are some units in Zerg that are technologically advanced, and they do some very interesting spells."}, {"time": 2868, "text": "And there's some units in Protoss that are less valuable, and you could lose a lot of them and rebuild them, and it wouldn't be a big deal."}, {"time": 2875, "text": "All right, so maybe I'm missing out."}, {"time": 2877, "text": "Maybe I'm going to say some dumb stuff, but summary of strategy."}, {"time": 2882, "text": "So first, there's collection of a lot of resources."}, {"time": 2885, "text": "That's one option."}, {"time": 2886, "text": "The other one is expanding, so building other bases."}, {"time": 2891, "text": "Then the other is obviously building units and attacking with those units."}, {"time": 2897, "text": "And then I don't know what else there is."}, {"time": 2900, "text": "Maybe there's the different timing of attacks, like do I attack early, attack late?"}, {"time": 2906, "text": "What are the different strategies that emerged that you've learned about?"}, {"time": 2909, "text": "I've read that a bunch of people are super happy that you guys have apparently, that Alpha Star apparently has discovered that it's really good to, what is it, saturate?"}, {"time": 2918, "text": "Oh yeah, the mineral line."}, {"time": 2919, "text": "Yeah, the mineral line."}, {"time": 2922, "text": "And that's for greedy amateur players like myself."}, {"time": 2925, "text": "That's always been a good strategy."}, {"time": 2927, "text": "You just build up a lot of money, and it just feels good to just accumulate and accumulate."}, {"time": 2933, "text": "So thank you for discovering that and validating all of us."}, {"time": 2936, "text": "But is there other strategies that you discovered that are interesting, unique to this game?"}, {"time": 2941, "text": "Yeah, so if you look at the kind of, not being a StarCraft II player, but of course StarCraft and StarCraft II and real time strategy games in general are very similar."}, {"time": 2952, "text": "I would classify perhaps the openings of the game."}, {"time": 2957, "text": "They're very important."}, {"time": 2958, "text": "And generally I would say there's two kinds of openings."}, {"time": 2961, "text": "One that's a standard opening."}, {"time": 2963, "text": "That's generally how players find sort of a balance between risk and economy and building some units early on so that they could defend, but they're not too exposed basically, but also expanding quite quickly."}, {"time": 2978, "text": "So this would be kind of a standard opening."}, {"time": 2981, "text": "And within a standard opening, then what you do choose generally is what technology are you aiming towards?"}, {"time": 2987, "text": "So there's a bit of rock, paper, scissors of you could go for spaceships or you could go for invisible units or you could go for, I don't know, like massive units that attack against certain kinds of units, but they're weak against others."}, {"time": 3001, "text": "So standard openings themselves have some choices like rock, paper, scissors style."}, {"time": 3006, "text": "Of course, if you scout and you're good at guessing what the opponent is doing, then you can play as an advantage because if you know you're gonna play rock, I mean, I'm gonna play paper obviously."}, {"time": 3015, "text": "So you can imagine that normal standard games in StarCraft looks like a continuous rock, paper, scissors game where you guess what the distribution of rock, paper, and scissors is from the enemy and reacting accordingly to try to beat it or put the paper out before he kind of changes his mind from rock to scissors, and then you would be in a weak position."}, {"time": 3039, "text": "So, sorry to pause on that."}, {"time": 3041, "text": "I didn't realize this element because I know it's true with poker."}, {"time": 3044, "text": "I know I looked at Labratus."}, {"time": 3048, "text": "So you're also estimating trying to guess the distribution, trying to better and better estimate the distribution of what the opponent is likely to be doing."}, {"time": 3055, "text": "Yeah, I mean, as a player, you definitely wanna have a belief state over what's up on the other side of the map."}, {"time": 3062, "text": "And when your belief state becomes inaccurate, when you start having that serious doubts, whether he's gonna play something that you must know, that's when you scout."}, {"time": 3071, "text": "You wanna then gather information, right?"}, {"time": 3074, "text": "Is improving the accuracy of the belief or improving the belief state part of the loss that you're trying to optimize?"}, {"time": 3080, "text": "Or is it just a side effect?"}, {"time": 3082, "text": "It's implicit, but you could explicitly model it, and it would be quite good at probably predicting what's on the other side of the map."}, {"time": 3090, "text": "But so far, it's all implicit."}, {"time": 3092, "text": "There's no additional reward for predicting the enemy."}, {"time": 3096, "text": "So there's these standard openings, and then there's what people call cheese, which is very interesting."}, {"time": 3102, "text": "And AlphaStar sometimes really likes this kind of cheese."}, {"time": 3106, "text": "These cheeses, what they are is kind of an all in strategy."}, {"time": 3110, "text": "You're gonna do something sneaky."}, {"time": 3113, "text": "You're gonna hide your own buildings close to the enemy base, or you're gonna go for hiding your technological buildings so that you do invisible units and the enemy just cannot react to detect it and thus lose the game."}, {"time": 3127, "text": "And there's quite a few of these cheeses and variants of them."}, {"time": 3131, "text": "And there it's where actually the belief state becomes even more important."}, {"time": 3136, "text": "Because if I scout your base and I see no buildings at all, any human player knows something's up."}, {"time": 3142, "text": "They might know, well, you're hiding something close to my base."}, {"time": 3145, "text": "Should I build suddenly a lot of units to defend?"}, {"time": 3148, "text": "Should I actually block my ramp with workers so that you cannot come and destroy my base?"}, {"time": 3153, "text": "So there's all this is happening and defending against cheeses is extremely important."}, {"time": 3159, "text": "And in the AlphaStar League, many agents actually develop some cheesy strategies."}, {"time": 3165, "text": "And in the games we saw against TLO and Mana, two out of the 10 agents were actually doing these kind of strategies which are cheesy strategies."}, {"time": 3173, "text": "And then there's a variant of cheesy strategy which is called all in."}, {"time": 3177, "text": "So an all in strategy is not perhaps as drastic as, oh, I'm gonna build cannons on your base and then bring all my workers and try to just disrupt your base and game over, or GG as we say in StarCraft."}, {"time": 3189, "text": "There's these kind of very cool things that you can align precisely at a certain time mark."}, {"time": 3194, "text": "So for instance, you can generate exactly 10 unit composition that is perfect, like five of this type, five of this other type, and align the upgrade so that at four minutes and a half, let's say, you have these 10 units and the upgrade just finished."}, {"time": 3210, "text": "And at that point, that army is really scary."}, {"time": 3213, "text": "And unless the enemy really knows what's going on, if you push, you might then have an advantage because maybe the enemy is doing something more standard, it expanded too much, it developed too much economy, and it trade off badly against having defenses, and the enemy will lose."}, {"time": 3231, "text": "But it's called all in because if you don't win, then you're gonna lose."}, {"time": 3235, "text": "So you see players that do these kinds of strategies, if they don't succeed, game is not over."}, {"time": 3240, "text": "I mean, they still have a base and they still gathering minerals, but they will just GG out of the game because they know, well, game is over."}, {"time": 3246, "text": "I gambled and I failed."}, {"time": 3248, "text": "So if we start entering the game theoretic aspects of the game, it's really rich and it's really, that's why it also makes it quite entertaining to watch."}, {"time": 3257, "text": "Even if I don't play, I still enjoy watching the game."}, {"time": 3261, "text": "But the agents are trying to do this mostly implicitly."}, {"time": 3266, "text": "But one element that we improved in self play is creating the Alpha Star League."}, {"time": 3271, "text": "And the Alpha Star League is not pure self play."}, {"time": 3274, "text": "It's trying to create a different personalities of agents so that some of them will become cheesy agents."}, {"time": 3281, "text": "Some of them might become very economical, very greedy, like getting all the resources, but then being maybe early on, they're gonna be weak, but later on, they're gonna be very strong."}, {"time": 3291, "text": "And by creating this personality of agents, which sometimes it just happens naturally that you can see kind of an evolution of agents that given the previous generation, they train against all of them and then they generate kind of the perfect counter to that distribution."}, {"time": 3305, "text": "But these agents, you must have them in the populations because if you don't have them, you're not covered against these things."}, {"time": 3313, "text": "You wanna create all sorts of the opponents that you will find in the wild."}, {"time": 3318, "text": "So you can be exposed to these cheeses, early aggression, later aggression, more expansions, dropping units in your base from the side, all these things."}, {"time": 3329, "text": "And pure self play is getting a bit stuck at finding some subset of these, but not all of these."}, {"time": 3336, "text": "So the Alpha Star League is a way to kind of do an ensemble of agents that they're all playing in a league, much like people play on Battle.net, right?"}, {"time": 3345, "text": "They play, you play against someone who does a new cool strategy and you immediately, oh my God, I wanna try it, I wanna play again."}, {"time": 3353, "text": "And this to me was another critical part of the problem, which was, can we create a Battle.net for agents?"}, {"time": 3361, "text": "And that's kind of what the Alpha Star League really is."}, {"time": 3364, "text": "And where they stick to their different strategies."}, {"time": 3366, "text": "Yeah, wow, that's really, really interesting."}, {"time": 3369, "text": "But that said, you were fortunate enough or just skilled enough to win five, zero."}, {"time": 3377, "text": "And so how hard is it to win?"}, {"time": 3379, "text": "I mean, that's not the goal."}, {"time": 3380, "text": "I guess, I don't know what the goal is."}, {"time": 3381, "text": "The goal should be to win majority, not five, zero, but how hard is it in general to win all matchups on a one V one?"}, {"time": 3391, "text": "So that's a very interesting question because once you see Alpha Star and superficially you think, well, okay, it won."}, {"time": 3400, "text": "Let's, if you sum all the games like 10 to one, right?"}, {"time": 3402, "text": "It lost the game that it played with the camera interface."}, {"time": 3406, "text": "You might think, well, that's done, right?"}, {"time": 3408, "text": "It's superhuman at the game."}, {"time": 3410, "text": "And that's not really the claim we really can make actually."}, {"time": 3415, "text": "The claim is we beat a professional gamer for the first time."}, {"time": 3420, "text": "StarCraft has really been a thing that has been going on for a few years, but a moment like this had not occurred before yet."}, {"time": 3429, "text": "But are these agents impossible to beat?"}, {"time": 3432, "text": "Absolutely not, right?"}, {"time": 3433, "text": "So that's a bit what's kind of the difference is the agents play at grandmaster level."}, {"time": 3439, "text": "They definitely understand the game enough to play extremely well, but are they unbeatable?"}, {"time": 3444, "text": "Do they play perfect?"}, {"time": 3446, "text": "No, and actually in StarCraft, because of these sneaky strategies, it's always possible that you might take a huge risk sometimes, but you might get wins, right?"}, {"time": 3456, "text": "Out of this."}, {"time": 3458, "text": "So I think that as a domain, it still has a lot of opportunities, not only because of course we wanna learn with less experience, we would like to, I mean, if I learned to play Protoss, I can play Terran and learn it much quicker than Alpha Star can, right?"}, {"time": 3473, "text": "So there are obvious interesting research challenges as well, but even as the raw performance goes, really the claim here can be we are at pro level or at high grandmaster level, but obviously the players also did not know what to expect, right?"}, {"time": 3494, "text": "Their prior distribution was a bit off because they played this kind of new like alien brain as they like to say it, right?"}, {"time": 3501, "text": "And that's what makes it exciting for them."}, {"time": 3504, "text": "But also I think if you look at the games closely, you see there were weaknesses in some points, maybe Alpha Star did not scout, or if it had invisible units going against at certain points, it wouldn't have known and it would have been bad."}, {"time": 3518, "text": "So there's still quite a lot of work to do, but it's really a very exciting moment for us to be seeing, wow, a single neural net on a GPU is actually playing against these guys who are amazing."}, {"time": 3531, "text": "I mean, you have to see them play in life."}, {"time": 3532, "text": "They're really, really amazing players."}, {"time": 3535, "text": "Yeah, I'm sure there must be a guy in Poland somewhere right now training his butt off to make sure that this never happens again with Alpha Star."}, {"time": 3545, "text": "So that's really exciting in terms of Alpha Star having some holes to exploit, which is great."}, {"time": 3551, "text": "And then we build on top of each other and it feels like StarCraft on let go, even if you win, it's still not, there's so many different dimensions in which you can explore."}, {"time": 3564, "text": "So that's really, really interesting."}, {"time": 3565, "text": "Do you think there's a ceiling to Alpha Star?"}, {"time": 3568, "text": "You've said that it hasn't reached, you know, this is a big, wait, let me actually just pause for a second."}, {"time": 3575, "text": "How did it feel to come here to this point, to beat a top professional player?"}, {"time": 3582, "text": "Like that night, I mean, you know, Olympic athletes have their gold medal, right?"}, {"time": 3587, "text": "This is your gold medal in a sense."}, {"time": 3588, "text": "Sure, you're cited a lot, you've published a lot of prestigious papers, whatever, but this is like a win."}, {"time": 3595, "text": "How did it feel?"}, {"time": 3596, "text": "I mean, it was, for me, it was unbelievable because first the win itself, I mean, it was so exciting."}, {"time": 3605, "text": "I mean, so looking back to those last days of 2018 really, that's when the games were played."}, {"time": 3613, "text": "I'm sure I look back at that moment, I'll say, oh my God, I want to be in a project like that."}, {"time": 3618, "text": "It's like, I already feel the nostalgia of like, yeah, that was huge in terms of the energy and the team effort that went into it."}, {"time": 3626, "text": "And so in that sense, as soon as it happened, I already knew it was kind of, I was losing it a little bit."}, {"time": 3633, "text": "So it is almost like sad that it happened and oh my God, but on the other hand, it also verifies the approach."}, {"time": 3641, "text": "But to me also, there's so many challenges and interesting aspects of intelligence that even though we can train a neural network to play at the level of the best humans, there's still so many challenges."}, {"time": 3654, "text": "So for me, it's also like, well, this is really an amazing achievement, but I already was also thinking about next steps."}, {"time": 3659, "text": "I mean, as I said, these Asians play Protoss versus Protoss, but they should be able to play a different race much quicker, right?"}, {"time": 3668, "text": "So that would be an amazing achievement."}, {"time": 3670, "text": "Some people call this meta reinforcement learning, meta learning and so on, right?"}, {"time": 3675, "text": "So there's so many possibilities after that moment, but the moment itself, it really felt great."}, {"time": 3683, "text": "We had this bet, so I'm kind of a pessimist in general."}, {"time": 3687, "text": "So I kind of send an email to the team."}, {"time": 3689, "text": "I said, okay, let's against TLO first, right?"}, {"time": 3693, "text": "Like what's gonna be the result?"}, {"time": 3695, "text": "And I really thought we would lose like five zero, right?"}, {"time": 3698, "text": "We had some calibration made against the 5,000 MMR player."}, {"time": 3704, "text": "TLO was much stronger than that player, even if he played Protoss, which is his off race."}, {"time": 3711, "text": "But yeah, I was not imagining we would win."}, {"time": 3713, "text": "So for me, that was just kind of a test run or something."}, {"time": 3715, "text": "And then it really kind of, he was really surprised."}, {"time": 3719, "text": "And unbelievably, we went to this bar to celebrate and Dave tells me, well, why don't we invite someone who is a thousand MMR stronger in Protoss, like actual Protoss player, like that it turned up being Mana, right?"}, {"time": 3736, "text": "And we had some drinks and I said, sure, why not?"}, {"time": 3739, "text": "But then I thought, well, that's really gonna be impossible to beat."}, {"time": 3742, "text": "I mean, even because it's so much ahead, a thousand MMR is really like 99% probability that Mana would beat TLO as Protoss versus Protoss, right?"}, {"time": 3753, "text": "So we did that."}, {"time": 3754, "text": "And to me, the second game was much more important, even though a lot of uncertainty kind of disappeared after we kind of beat TLO."}, {"time": 3763, "text": "I mean, he is a professional player."}, {"time": 3765, "text": "So that was kind of, oh, but that's really a very nice achievement."}, {"time": 3769, "text": "But Mana really was at the top and you could see he played much better, but our agents got much better too."}, {"time": 3775, "text": "So it's like, ah, and then after the first game, I said, if we take a single game, at least we can say we beat a game."}, {"time": 3782, "text": "I mean, even if we don't beat the series, for me, that was a huge relief."}, {"time": 3786, "text": "And I mean, I remember the hugging demis."}, {"time": 3789, "text": "And I mean, it was really like, this moment for me will resonate forever as a researcher."}, {"time": 3794, "text": "And I mean, as a person, and yeah, it's a really like great accomplishment."}, {"time": 3798, "text": "And it was great also to be there with the team in the room."}, {"time": 3801, "text": "I don't know if you saw like this."}, {"time": 3803, "text": "So it was really like."}, {"time": 3804, "text": "I mean, from my perspective, the other interesting thing is just like watching Kasparov, watching Mana was also interesting because he didn't, he has kind of a loss of words."}, {"time": 3816, "text": "I mean, whenever you lose, I've done a lot of sports."}, {"time": 3818, "text": "You sometimes say excuses, you look for reasons."}, {"time": 3823, "text": "And he couldn't really come up with reasons."}, {"time": 3826, "text": "I mean, so with the off race for Protoss, you could say, well, it felt awkward, it wasn't, but here it was just beaten."}, {"time": 3835, "text": "And it was beautiful to look at a human being being superseded by an AI system."}, {"time": 3840, "text": "I mean, it's a beautiful moment for researchers, so."}, {"time": 3844, "text": "Yeah, for sure it was."}, {"time": 3845, "text": "I mean, probably the highlight of my career so far because of its uniqueness and coolness."}, {"time": 3851, "text": "And I don't know, I mean, it's obviously, as you said, you can look at papers, citations and so on, but these really is like a testament of the whole machine learning approach and using games to advance technology."}, {"time": 3864, "text": "I mean, it really was, everything came together at that moment."}, {"time": 3868, "text": "That's really the summary."}, {"time": 3869, "text": "Also on the other side, it's a popularization of AI too, because it's just like traveling to the moon and so on."}, {"time": 3878, "text": "I mean, this is where a very large community of people that don't really know AI, they get to really interact with it."}, {"time": 3885, "text": "Which is very important."}, {"time": 3886, "text": "I mean, we must, you know, writing papers helps our peers, researchers, to understand what we're doing."}, {"time": 3892, "text": "But I think AI is becoming mature enough that we must sort of try to explain what it is."}, {"time": 3899, "text": "And perhaps through games is an obvious way because these games always had built in AI."}, {"time": 3903, "text": "So it may be everyone experience an AI playing a video game, even if they don't know, because there's always some scripted element and some people might even call that AI already, right?"}, {"time": 3913, "text": "So what are other applications of the approaches underlying AlphaStar that you see happening?"}, {"time": 3920, "text": "There's a lot of echoes of, you said, transformer of language modeling and so on."}, {"time": 3925, "text": "Have you already started thinking where the breakthroughs in AlphaStar get expanded to other applications?"}, {"time": 3932, "text": "Right, so I thought about a few things for like kind of next month, next years."}, {"time": 3938, "text": "The main thing I'm thinking about actually is what's next as a kind of a grand challenge."}, {"time": 3943, "text": "Because for me, like we've seen Atari and then there's like the sort of three dimensional walls that we've seen also like pretty good performance from these capture the flag agents that also some people at DeepMind and elsewhere are working on."}, {"time": 3957, "text": "We've also seen some amazing results on like, for instance, Dota 2, which is also a very complicated game."}, {"time": 3963, "text": "So for me, like the main thing I'm thinking about is what's next in terms of challenge."}, {"time": 3967, "text": "So as a researcher, I see sort of two tensions between research and then applications or areas or domains where you apply them."}, {"time": 3978, "text": "So on the one hand, we've done, thanks to the application of StarCraft is very hard."}, {"time": 3983, "text": "We developed some techniques, some new research that now we could look at elsewhere."}, {"time": 3987, "text": "Like are there other applications where we can apply these?"}, {"time": 3990, "text": "And the obvious ones, absolutely."}, {"time": 3992, "text": "You can think of feeding back to sort of the community we took from, which was mostly sequence modeling or natural language processing."}, {"time": 4001, "text": "So we've developed and extended things from the transformer and we use pointer networks."}, {"time": 4008, "text": "We combine LSTM and transformers in interesting ways."}, {"time": 4011, "text": "So that's perhaps the kind of lowest hanging fruit of feeding back to now a different field of machine learning that's not playing video games."}, {"time": 4020, "text": "Let me go old school and jump to Mr. Alan Turing."}, {"time": 4025, "text": "So the Turing test is a natural language test, a conversational test."}, {"time": 4031, "text": "What's your thought of it as a test for intelligence?"}, {"time": 4035, "text": "Do you think it is a grand challenge that's worthy of undertaking?"}, {"time": 4038, "text": "Maybe if it is, would you reformulate it or phrase it somehow differently?"}, {"time": 4043, "text": "Right, so I really love the Turing test because I also like sequences and language understanding."}, {"time": 4049, "text": "And in fact, some of the early work we did in machine translation, we tried to apply to kind of a neural chatbot, which obviously would never pass the Turing test because it was very limited."}, {"time": 4062, "text": "But it is a very fascinating idea that you could really have an AI that would be indistinguishable from humans in terms of asking or conversing with it."}, {"time": 4076, "text": "So I think the test itself seems very nice."}, {"time": 4080, "text": "And it's kind of well defined, actually, like the passing it or not."}, {"time": 4084, "text": "I think there's quite a few rules that feel pretty simple."}, {"time": 4089, "text": "And I think they have these competitions every year."}, {"time": 4094, "text": "Yes, there's the Lebner Prize."}, {"time": 4095, "text": "But I don't know if you've seen the kind of bots that emerge from that competition."}, {"time": 4104, "text": "They're not quite as what you would."}, {"time": 4107, "text": "So it feels like that there's weaknesses with the way Turing formulated it."}, {"time": 4111, "text": "It needs to be that the definition of a genuine, rich, fulfilling human conversation, it needs to be something else."}, {"time": 4121, "text": "Like the Alexa Prize, which I'm not as well familiar with, has tried to define that more, I think, by saying you have to continue keeping a conversation for 30 minutes, something like that."}, {"time": 4132, "text": "So basically forcing the agent not to just fool, but to have an engaging conversation kind of thing."}, {"time": 4142, "text": "Have you thought about this problem richly?"}, {"time": 4146, "text": "And if you have in general, how far away are we from?"}, {"time": 4150, "text": "You worked a lot on language understanding, language generation, but the full dialogue, the conversation, just sitting at the bar having a couple of beers for an hour, that kind of conversation."}, {"time": 4162, "text": "Have you thought about it?"}, {"time": 4163, "text": "Yeah, so I think you touched here on the critical point, which is feasibility."}, {"time": 4168, "text": "So there's a great essay by Hamming, which describes sort of grand challenges of physics."}, {"time": 4177, "text": "And he argues that, well, OK, for instance, teleportation or time travel are great grand challenges of physics, but there's no attacks."}, {"time": 4186, "text": "We really don't know or cannot kind of make any progress."}, {"time": 4190, "text": "So that's why most physicists and so on, they don't work on these in their PhDs and as part of their careers."}, {"time": 4197, "text": "So I see the Turing test, in the full Turing test, as a bit still too early."}, {"time": 4202, "text": "Like I think we're, especially with the current trend of deep learning language models, we've seen some amazing examples."}, {"time": 4211, "text": "I think GPT2 being the most recent one, which is very impressive."}, {"time": 4215, "text": "But to understand to fully solve passing or fooling a human to think that there's a human on the other side, I think we're quite far."}, {"time": 4224, "text": "So as a result, I don't see myself and I probably would not recommend people doing a PhD on solving the Turing test because it just feels it's kind of too early or too hard of a problem."}, {"time": 4235, "text": "Yeah, but that said, you said the exact same thing about StarCraft about a few years ago."}, {"time": 4241, "text": "To Demis."}, {"time": 4241, "text": "So you'll probably also be the person who passes the Turing test in three years."}, {"time": 4248, "text": "I mean, I think that, yeah."}, {"time": 4250, "text": "So we have this on record."}, {"time": 4252, "text": "This is nice."}, {"time": 4253, "text": "I mean, it's true that progress sometimes is a bit unpredictable."}, {"time": 4257, "text": "I really wouldn't have not."}, {"time": 4259, "text": "Even six months ago, I would not have predicted the level that we see that these agents can deliver at grandmaster level."}, {"time": 4267, "text": "But I have worked on language enough."}, {"time": 4270, "text": "And basically, my concern is not that something could happen, a breakthrough could happen that would bring us to solving or passing the Turing test, is that I just think the statistical approach to it is not going to cut it."}, {"time": 4284, "text": "So we need a breakthrough, which is great for the community."}, {"time": 4288, "text": "But given that, I think there's quite more uncertainty."}, {"time": 4291, "text": "Whereas for StarCraft, I knew what the steps would be to get us there."}, {"time": 4298, "text": "I think it was clear that using the imitation learning part and then using this battle net for agents were going to be key."}, {"time": 4305, "text": "And it turned out that this was the case."}, {"time": 4308, "text": "And a little more was needed, but not much more."}, {"time": 4311, "text": "For Turing test, I just don't know what the plan or execution plan would look like."}, {"time": 4316, "text": "So that's why I myself working on it as a grand challenge is hard."}, {"time": 4321, "text": "But there are quite a few sub challenges that are related that you could say, well, I mean, what if you create a great assistant like Google already has, like the Google Assistant."}, {"time": 4331, "text": "So can we make it better?"}, {"time": 4333, "text": "And can we make it fully neural and so on?"}, {"time": 4335, "text": "That I start to believe maybe we're reaching a point where we should attempt these challenges."}, {"time": 4340, "text": "I like this conversation so much because it echoes very much the StarCraft conversation."}, {"time": 4344, "text": "It's exactly how you approach StarCraft."}, {"time": 4346, "text": "Let's break it down into small pieces and solve those."}, {"time": 4349, "text": "And you end up solving the whole game."}, {"time": 4351, "text": "But that said, you're behind some of the biggest pieces of work in deep learning in the last several years."}, {"time": 4360, "text": "So you mentioned some limits."}, {"time": 4362, "text": "What do you think of the current limits of deep learning?"}, {"time": 4364, "text": "And how do we overcome those limits?"}, {"time": 4367, "text": "So if I had to actually use a single word to define the main challenge in deep learning, it's a challenge that probably has been the challenge for many years."}, {"time": 4376, "text": "And it's that of generalization."}, {"time": 4379, "text": "So what that means is that all that we're doing is fitting functions to data."}, {"time": 4386, "text": "And when the data we see is not from the same distribution, or even if there are some times that it is very close to distribution, but because of the way we train it with limited samples, we then get to this stage where we just don't see generalization as much as we can generalize."}, {"time": 4407, "text": "And I think adversarial examples are a clear example of this."}, {"time": 4411, "text": "But if you study machine learning and literature, and the reason why SVMs came very popular were because they were dealing and they had some guarantees about generalization, which is unseen data or out of distribution, or even within distribution where you take an image adding a bit of noise, these models fail."}, {"time": 4431, "text": "So I think, really, I don't see a lot of progress on generalization in the strong generalization sense of the word."}, {"time": 4441, "text": "I think our neural networks, you can always find design examples that will make their outputs arbitrary, which is not good because we humans would never be fooled by these kind of images or manipulation of the image."}, {"time": 4459, "text": "And if you look at the mathematics, you kind of understand this is a bunch of matrices multiplied together."}, {"time": 4466, "text": "There's probably numerics and instability that you can just find corner cases."}, {"time": 4470, "text": "So I think that's really the underlying topic many times we see when even at the grand stage of Turing test generalization, if you start passing the Turing test, should it be in English or should it be in any language?"}, {"time": 4488, "text": "As a human, if you ask something in a different language, you actually will go and do some research and try to translate it and so on."}, {"time": 4497, "text": "Should the Turing test include that?"}, {"time": 4501, "text": "And it's really a difficult problem and very fascinating and very mysterious, actually."}, {"time": 4506, "text": "But do you think if you were to try to solve it, can you not grow the size of data intelligently in such a way that the distribution of your training set does include the entirety of the testing set?"}, {"time": 4520, "text": "Is that one path?"}, {"time": 4521, "text": "The other path is totally a new methodology."}, {"time": 4523, "text": "It's not statistical."}, {"time": 4524, "text": "So a path that has worked well, and it worked well in StarCraft and in machine translation and in languages, scaling up the data and the model."}, {"time": 4532, "text": "And that's kind of been maybe the only single formula that still delivers today in deep learning, right?"}, {"time": 4540, "text": "It's that data scale and model scale really do more and more of the things that we thought, oh, there's no way it can generalize to these, or there's no way it can generalize to that."}, {"time": 4551, "text": "But I don't think fundamentally it will be solved with this."}, {"time": 4554, "text": "And for instance, I'm really liking some style or approach that would not only have neural networks, but it would have programs or some discrete decision making, because there is where I feel there's a bit more."}, {"time": 4570, "text": "I mean, the best example, I think, for understanding this is I also worked a bit on, oh, we can learn an algorithm with a neural network, right?"}, {"time": 4578, "text": "So you give it many examples, and it's going to sort the input numbers or something like that."}, {"time": 4584, "text": "But really strong generalization is you give me some numbers or you ask me to create an algorithm that sorts numbers."}, {"time": 4592, "text": "And instead of creating a neural net, which will be fragile because it's going to go out of range at some point, you're going to give it numbers that are too large, too small, and whatnot, if you just create a piece of code that sorts the numbers, then you can prove that that will generalize to absolutely all the possible input you could give."}, {"time": 4611, "text": "So I think the problem comes with some exciting prospects."}, {"time": 4615, "text": "I mean, scale is a bit more boring, but it really works."}, {"time": 4619, "text": "And then maybe programs and discrete abstractions are a bit less developed."}, {"time": 4624, "text": "But clearly, I think they're quite exciting in terms of future for the field."}, {"time": 4629, "text": "Do you draw any insight wisdom from the 80s and expert systems and symbolic systems, symbolic computing?"}, {"time": 4636, "text": "Do you ever go back to those reasoning, that kind of logic?"}, {"time": 4640, "text": "Do you think that might make a comeback?"}, {"time": 4643, "text": "You'll have to dust off those books?"}, {"time": 4644, "text": "Yeah, I actually love actually adding more inductive biases."}, {"time": 4651, "text": "To me, the problem really is, what are you trying to solve?"}, {"time": 4654, "text": "If what you're trying to solve is so important that try to solve it no matter what, then absolutely use rules, use domain knowledge, and then use a bit of the magic of machine learning to empower to make the system as the best system that will detect cancer or detect weather patterns, right?"}, {"time": 4676, "text": "Or in terms of StarCraft, it also was a very big challenge."}, {"time": 4679, "text": "So I was definitely happy that if we had to cut a corner here and there, it could have been interesting to do."}, {"time": 4687, "text": "And in fact, in StarCraft, we start thinking about expert systems because it's a very, you know, you can define."}, {"time": 4692, "text": "I mean, people actually build StarCraft bots by thinking about those principles, like state machines and rule based."}, {"time": 4700, "text": "And then you could think of combining a bit of a rule based system, but that has also neural networks incorporated to make it generalize a bit better."}, {"time": 4709, "text": "So absolutely, I mean, we should definitely go back to those ideas."}, {"time": 4712, "text": "And anything that makes the problem simpler, as long as your problem is important, that's OK. And that's research driving a very important problem."}, {"time": 4721, "text": "And on the other hand, if you want to really focus on the limits of reinforcement learning, then of course, you must try not to look at imitation data or to look for some rules of the domain that would help a lot or even feature engineering, right?"}, {"time": 4736, "text": "So this is a tension that depending on what you do, I think both ways are definitely fine."}, {"time": 4743, "text": "And I would never not do one or the other as long as what you're doing is important and needs to be solved, right?"}, {"time": 4750, "text": "Right, so there's a bunch of different ideas that you developed that I really enjoy."}, {"time": 4756, "text": "But one is translating from image captioning, translating from image to text, just another beautiful idea, I think, that resonates throughout your work, actually."}, {"time": 4773, "text": "So the underlying nature of reality being language always, somehow."}, {"time": 4778, "text": "So what's the connection between images and text, or rather the visual world and the world of language in your view?"}, {"time": 4786, "text": "Right, so I think a piece of research that's been central to, I would say, even extending into StarGraph is this idea of sequence to sequence learning, which what we really meant by that is that you can now really input anything to a neural network as the input x."}, {"time": 4806, "text": "And then the neural network will learn a function f that will take x as an input and produce any output y."}, {"time": 4812, "text": "And these x and y's don't need to be static or features, like fixed vectors or anything like that."}, {"time": 4822, "text": "It could be really sequences and now beyond data structures."}, {"time": 4826, "text": "So that paradigm was tested in a very interesting way when we moved from translating French to English to translating an image to its caption."}, {"time": 4837, "text": "But the beauty of it is that, really, and that's actually how it happened."}, {"time": 4843, "text": "I changed a line of code in this thing that was doing machine translation."}, {"time": 4847, "text": "And I came the next day, and I saw how it was producing captions that seemed like, oh my god, this is really, really working."}, {"time": 4855, "text": "And the principle is the same."}, {"time": 4857, "text": "So I think I don't see text, vision, speech, waveforms as something different as long as you basically learn a function that will vectorize these into."}, {"time": 4874, "text": "And then after we vectorize it, we can then use transformers, LSTMs, whatever the flavor of the month of the model is."}, {"time": 4882, "text": "And then as long as we have enough supervised data, really, this formula will work and will keep working, I believe, to some extent."}, {"time": 4891, "text": "Modulo these generalization issues that I mentioned before."}, {"time": 4895, "text": "But the task there is to vectorize, so to form a representation that's meaningful."}, {"time": 4899, "text": "And your intuition now, having worked with all this media, is that once you are able to form that representation, you could basically take any things, any sequence."}, {"time": 4911, "text": "Going back to StarCraft, is there limits on the length so that we didn't really touch on the long term aspect?"}, {"time": 4919, "text": "How did you overcome the whole really long term aspect of things here?"}, {"time": 4923, "text": "Is there some tricks?"}, {"time": 4925, "text": "So the main trick, so StarCraft, if you look at absolutely every frame, you might think it's quite a long game."}, {"time": 4932, "text": "So we would have to multiply 22 times 60 seconds per minute times maybe at least 10 minutes per game on average."}, {"time": 4941, "text": "So there are quite a few frames."}, {"time": 4945, "text": "But the trick really was to only observe, in fact, which might be seen as a limitation, but it is also a computational advantage."}, {"time": 4955, "text": "Only observe when you act."}, {"time": 4957, "text": "And then what the neural network decides is what is the gap going to be until the next action."}, {"time": 4964, "text": "And if you look at most StarCraft games that we have in the data set that Blizzard provided, it turns out that most games are actually only, I mean, it is still a long sequence, but it's maybe like 1,000 to 1,500 actions, which if you start looking at LSTMs, large LSTMs, transformers, it's not that difficult, especially if you have supervised learning."}, {"time": 4994, "text": "If you had to do it with reinforcement learning, the credit assignment problem, what is it in this game that made you win?"}, {"time": 4999, "text": "That would be really difficult."}, {"time": 5001, "text": "But thankfully, because of imitation learning, we didn't have to deal with these directly."}, {"time": 5007, "text": "Although if we had to, we tried it."}, {"time": 5009, "text": "And what happened is you just take all your workers and attack with them."}, {"time": 5013, "text": "And that is kind of obvious in retrospect because you start trying random actions."}, {"time": 5018, "text": "One of the actions will be a worker that goes to the enemy base."}, {"time": 5021, "text": "And because it's self play, it's not going to know how to defend because it basically doesn't know almost anything."}, {"time": 5027, "text": "And eventually, what you develop is this take all workers and attack because the credit assignment issue in a rally is really, really hard."}, {"time": 5035, "text": "I do believe we could do better."}, {"time": 5037, "text": "And that's maybe a research challenge for the future."}, {"time": 5041, "text": "But yeah, even in StarCraft, the sequences are maybe 1,000, which I believe is within the realm of what transformers can do."}, {"time": 5050, "text": "Yeah, I guess the difference between StarCraft and Go is in Go and Chess, stuff starts happening right away."}, {"time": 5058, "text": "So there's not, yeah, it's pretty easy to self play."}, {"time": 5062, "text": "Not easy, but to self play, it's possible to develop reasonable strategies quickly as opposed to StarCraft."}, {"time": 5067, "text": "I mean, in Go, there's only 400 actions."}, {"time": 5070, "text": "But one action is what people would call the God action."}, {"time": 5074, "text": "That would be if you had expanded the whole search tree, that's the best action if you did minimax or whatever algorithm you would do if you had the computational capacity."}, {"time": 5084, "text": "But in StarCraft, 400 is minuscule."}, {"time": 5088, "text": "Like in 400, you couldn't even click on the pixels around a unit."}, {"time": 5093, "text": "So I think the problem there is in terms of action space size is way harder."}, {"time": 5101, "text": "And that search is impossible."}, {"time": 5103, "text": "So there's quite a few challenges indeed that make this kind of a step up in terms of machine learning."}, {"time": 5110, "text": "For humans, maybe playing StarCraft seems more intuitive because it looks real."}, {"time": 5116, "text": "I mean, the graphics and everything moves smoothly, whereas I don't know how to."}, {"time": 5120, "text": "I mean, Go is a game that I would really need to study."}, {"time": 5122, "text": "It feels quite complicated."}, {"time": 5123, "text": "But for machines, kind of maybe it's the reverse, yes."}, {"time": 5127, "text": "Which shows you the gap actually between deep learning and however the heck our brains work."}, {"time": 5134, "text": "So you developed a lot of really interesting ideas."}, {"time": 5136, "text": "It's interesting to just ask, what's your process of developing new ideas?"}, {"time": 5141, "text": "Do you like brainstorming with others?"}, {"time": 5142, "text": "Do you like thinking alone?"}, {"time": 5144, "text": "Do you like, what was it, Ian Goodfellow said he came up with GANs after a few beers."}, {"time": 5152, "text": "He thinks beers are essential for coming up with new ideas."}, {"time": 5155, "text": "We had beers to decide to play another game of StarCraft after a week."}, {"time": 5159, "text": "So it's really similar to that story."}, {"time": 5162, "text": "Actually, I explained this in a DeepMind retreat."}, {"time": 5165, "text": "And I said, this is the same as the GAN story."}, {"time": 5168, "text": "I mean, we were in a bar."}, {"time": 5169, "text": "And we decided, let's play a GAN next week."}, {"time": 5170, "text": "And that's what happened."}, {"time": 5171, "text": "I feel like we're giving the wrong message to young undergrads."}, {"time": 5175, "text": "Yeah, I know."}, {"time": 5175, "text": "But in general, do you like brainstorming?"}, {"time": 5178, "text": "Do you like thinking alone, working stuff out?"}, {"time": 5180, "text": "So I think throughout the years, also, things changed."}, {"time": 5183, "text": "So initially, I was very fortunate to be with great minds like Jeff Hinton, Jeff Dean, Ilya Sutskever."}, {"time": 5194, "text": "I was really fortunate to join Brain at a very good time."}, {"time": 5197, "text": "So at that point, ideas, I was just brainstorming with my colleagues and learned a lot."}, {"time": 5204, "text": "And keep learning is actually something you should never stop doing."}, {"time": 5208, "text": "So learning implies reading papers and also discussing ideas with others."}, {"time": 5213, "text": "It's very hard at some point to not communicate that being reading a paper from someone or actually discussing."}, {"time": 5220, "text": "So definitely, that communication aspect needs to be there, whether it's written or oral."}, {"time": 5228, "text": "Nowadays, I'm also trying to be a bit more strategic about what research to do."}, {"time": 5235, "text": "So I was describing a little bit this tension between research for the sake of research, and then you have, on the other hand, applications that can drive the research."}, {"time": 5245, "text": "And honestly, the formula that has worked best for me is just find a hard problem and then try to see how research fits into it, how it doesn't fit into it, and then you must innovate."}, {"time": 5257, "text": "So I think machine translation drove sequence to sequence."}, {"time": 5263, "text": "Then maybe learning algorithms that had to, combinatorial algorithms led to pointer networks."}, {"time": 5270, "text": "StarCraft led to really scaling up imitation learning and the AlphaStarLeague."}, {"time": 5275, "text": "So that's been a formula that I personally like."}, {"time": 5278, "text": "But the other one is also valid."}, {"time": 5280, "text": "And I've seen it succeed a lot of the times where you just want to investigate model based RL as a research topic."}, {"time": 5288, "text": "And then you must then start to think, well, how are the tests?"}, {"time": 5292, "text": "How are you going to test these ideas?"}, {"time": 5294, "text": "You need a minimal environment to try things."}, {"time": 5297, "text": "You need to read a lot of papers and so on."}, {"time": 5299, "text": "And that's also very fun to do and something I've also done quite a few times, both at Brain, at DeepMind, and obviously as a PhD."}, {"time": 5308, "text": "So I think besides the ideas and discussions, I think it's important also because you start sort of guiding not only your own goals, but other people's goals to the next breakthrough."}, {"time": 5324, "text": "So you must really kind of understand this feasibility also, as we were discussing before, whether this domain is ready to be tackled or not."}, {"time": 5333, "text": "And you don't want to be too early."}, {"time": 5335, "text": "You obviously don't want to be too late."}, {"time": 5337, "text": "So it's really interesting, this strategic component of research, which I think as a grad student, I just had no idea."}, {"time": 5345, "text": "I just read papers and discussed ideas."}, {"time": 5347, "text": "And I think this has been maybe the major change."}, {"time": 5349, "text": "And I recommend people kind of feed forward to success how it looks like and try to backtrack, other than just kind of looking, oh, this looks cool."}, {"time": 5358, "text": "This looks cool."}, {"time": 5359, "text": "And then you do a bit of random work, which sometimes you stumble upon some interesting things."}, {"time": 5363, "text": "But in general, it's also good to plan a bit."}, {"time": 5367, "text": "Yeah, I like it."}, {"time": 5368, "text": "Especially like your approach of taking a really hard problem, stepping right in, and then being super skeptical about being able to solve the problem."}, {"time": 5377, "text": "I mean, there's a balance of both, right?"}, {"time": 5380, "text": "There's a silly optimism and a critical sort of skepticism that's good to balance, which is why it's good to have a team of people that balance that."}, {"time": 5392, "text": "You don't do that on your own."}, {"time": 5393, "text": "You have both mentors that have seen, or you obviously want to chat and discuss whether it's the right time."}, {"time": 5400, "text": "I mean, Demis came in 2014."}, {"time": 5403, "text": "And he said, maybe in a bit we'll do StarCraft."}, {"time": 5406, "text": "And maybe he knew."}, {"time": 5408, "text": "And I'm just following his lead, which is great, because he's brilliant, right?"}, {"time": 5412, "text": "So these things are obviously quite important, that you want to be surrounded by people who are diverse."}, {"time": 5422, "text": "They have their knowledge."}, {"time": 5423, "text": "There's also important to, I mean, I've learned a lot from people who actually have an idea that I might not think it's good."}, {"time": 5432, "text": "But if I give them the space to try it, I've been proven wrong many, many times as well."}, {"time": 5437, "text": "So that's great."}, {"time": 5438, "text": "I think your colleagues are more important than yourself, I think."}, {"time": 5444, "text": "Now let's real quick talk about another impossible problem, AGI."}, {"time": 5450, "text": "What do you think it takes to build a system that's human level intelligence?"}, {"time": 5454, "text": "We talked a little bit about the Turing test, StarCraft."}, {"time": 5456, "text": "All of these have echoes of general intelligence."}, {"time": 5458, "text": "But if you think about just something that you would sit back and say, wow, this is really something that resembles human level intelligence."}, {"time": 5467, "text": "What do you think it takes to build that?"}, {"time": 5469, "text": "So I find that AGI oftentimes is maybe not very well defined."}, {"time": 5477, "text": "So what I'm trying to then come up with for myself is what would be a result look like that you would start to believe that you would have agents or neural nets that no longer overfeed to a single task, but actually learn the skill of learning, so to speak."}, {"time": 5497, "text": "And that actually is a field that I am fascinated by, which is the learning to learn, or meta learning, which is about no longer learning about a single domain."}, {"time": 5508, "text": "So you can think about the learning algorithm itself is general."}, {"time": 5512, "text": "So the same formula we applied for AlphaStar or StarCraft, we can now apply to almost any video game, or you could apply to many other problems and domains."}, {"time": 5523, "text": "But the algorithm is what's generalizing."}, {"time": 5527, "text": "But the neural network, those weights are useless even to play another race."}, {"time": 5532, "text": "I train a network to play very well at Protos versus Protos."}, {"time": 5535, "text": "I need to throw away those weights."}, {"time": 5537, "text": "If I want to play now Terran versus Terran, I would need to retrain a network from scratch with the same algorithm."}, {"time": 5546, "text": "But the network itself will not be useful."}, {"time": 5548, "text": "So I think if I see an approach that can absorb or start solving new problems without the need to kind of restart the process, I think that, to me, would be a nice way to define some form of AGI."}, {"time": 5565, "text": "Again, I don't know the grandiose like age."}, {"time": 5568, "text": "I mean, should Turing tests be solved before AGI?"}, {"time": 5570, "text": "I mean, I don't know."}, {"time": 5571, "text": "I think concretely, I would like to see clearly that meta learning happen, meaning that there is an architecture or a network that as it sees new problem or new data, it solves it."}, {"time": 5584, "text": "And to make it kind of a benchmark, it should solve it at the same speed that we do solve new problems."}, {"time": 5591, "text": "When I define you a new object and you have to recognize it, when you start playing a new game, you played all the Atari games."}, {"time": 5597, "text": "But now you play a new Atari game."}, {"time": 5599, "text": "Well, you're going to be pretty quickly pretty good at the game."}, {"time": 5602, "text": "So that's perhaps what's the domain and what's the exact benchmark is a bit difficult."}, {"time": 5608, "text": "I think as a community, we might need to do some work to define it."}, {"time": 5612, "text": "But I think this first step, I could see it happen relatively soon."}, {"time": 5616, "text": "But then the whole what AGI means and so on, I am a bit more confused about what I think people mean different things."}, {"time": 5624, "text": "There's an emotional, psychological level that like even the Turing test, passing the Turing test is something that we just pass judgment on as human beings what it means to be as a dog in AGI system."}, {"time": 5644, "text": "What level, what does it mean, what does it mean?"}, {"time": 5647, "text": "But I like the generalization."}, {"time": 5648, "text": "And maybe as a community, we converge towards a group of domains that are sufficiently far away."}, {"time": 5654, "text": "That would be really damn impressive if it was able to generalize."}, {"time": 5658, "text": "So perhaps not as close as Protoss and Zerg, but like Wikipedia."}, {"time": 5662, "text": "That would be a step."}, {"time": 5663, "text": "Yeah, that would be a good step and then a really good step."}, {"time": 5666, "text": "But then like from StarCraft to Wikipedia and back."}, {"time": 5670, "text": "Yeah, that kind of thing."}, {"time": 5671, "text": "And that feels also quite hard and far."}, {"time": 5674, "text": "But I think as long as you put the benchmark out, as we discovered, for instance, with ImageNet, then tremendous progress can be had."}, {"time": 5683, "text": "So I think maybe there's a lack of benchmark, but I'm sure we'll find one and the community will then work towards that."}, {"time": 5692, "text": "And then beyond what AGI might mean or would imply, I really am hopeful to see basically machine learning or AI just scaling up and helping people that might not have the resources to hire an assistant or that they might not even know what the weather is like."}, {"time": 5713, "text": "So I think in terms of the positive impact of AI, I think that's maybe what we should also not lose focus."}, {"time": 5722, "text": "The research community building AGI, I mean, that's a real nice goal."}, {"time": 5725, "text": "But I think the way that DeepMind puts it is, and then use it to solve everything else."}, {"time": 5730, "text": "So I think we should paralyze."}, {"time": 5733, "text": "Yeah, we shouldn't forget about all the positive things that are actually coming out of AI already and are going to be coming out."}, {"time": 5741, "text": "But on that note, let me ask relative to popular perception, do you have any worry about the existential threat of artificial intelligence in the near or far future that some people have?"}, {"time": 5755, "text": "I think in the near future, I'm skeptical."}, {"time": 5758, "text": "So I hope I'm not wrong."}, {"time": 5759, "text": "But I'm not concerned, but I appreciate efforts, ongoing efforts, and even like whole research field on AI safety emerging and in conferences and so on."}, {"time": 5770, "text": "I think that's great."}, {"time": 5772, "text": "In the long term, I really hope we just can simply have the benefits outweigh the potential dangers."}, {"time": 5780, "text": "I am hopeful for that."}, {"time": 5783, "text": "But also, we must remain vigilant to monitor and assess whether the tradeoffs are there and we have enough also lead time to prevent or to redirect our efforts if need be."}, {"time": 5797, "text": "But I'm quite optimistic about the technology and definitely more fearful of other threats in terms of planetary level at this point."}, {"time": 5808, "text": "But obviously, that's the one I have more power on."}, {"time": 5812, "text": "So clearly, I do start thinking more and more about this."}, {"time": 5816, "text": "And it's grown in me actually to start reading more about AI safety, which is a field that so far I have not really contributed to."}, {"time": 5825, "text": "But maybe there's something to be done there as well."}, {"time": 5827, "text": "I think it's really important."}, {"time": 5829, "text": "I talk about this with a few folks."}, {"time": 5831, "text": "But it's important to ask you and shove it in your head because you're at the leading edge of actually what people are excited about in AI."}, {"time": 5839, "text": "The work with AlphaStar, it's arguably at the very cutting edge of the kind of thing that people are afraid of."}, {"time": 5847, "text": "And so you speaking to that fact and that we're actually quite far away to the kind of thing that people might be afraid of."}, {"time": 5855, "text": "But it's still worthwhile to think about."}, {"time": 5858, "text": "And it's also good that you're not as worried and you're also open to thinking about it."}, {"time": 5865, "text": "There's two aspects."}, {"time": 5866, "text": "I mean, me not being worried."}, {"time": 5867, "text": "But obviously, we should prepare for things that could go wrong, misuse of the technologies as with any technologies."}, {"time": 5878, "text": "So I think there's always trade offs."}, {"time": 5882, "text": "And as a society, we've kind of solved this to some extent in the past."}, {"time": 5887, "text": "So I'm hoping that by having the researchers and the whole community brainstorm and come up with interesting solutions to the new things that will happen in the future, that we can still also push the research to the avenue that I think is kind of the greatest avenue, which is to understand intelligence."}, {"time": 5907, "text": "How are we doing what we're doing?"}, {"time": 5909, "text": "And obviously, from a scientific standpoint, that is kind of my personal drive of all the time that I spend doing what I'm doing, really."}, {"time": 5920, "text": "Where do you see the deep learning as a field heading?"}, {"time": 5922, "text": "Where do you think the next big breakthrough might be?"}, {"time": 5926, "text": "So I think deep learning, I discussed a little of this before."}, {"time": 5930, "text": "Deep learning has to be combined with some form of discretization, program synthesis."}, {"time": 5936, "text": "I think that's kind of as a research in itself is an interesting topic to expand and start doing more research."}, {"time": 5944, "text": "And then as kind of what will deep learning enable to do in the future?"}, {"time": 5948, "text": "I don't think that's going to be what's going to happen this year."}, {"time": 5951, "text": "But also this idea of starting not to throw away all the weights, that this idea of learning to learn and really having these agents not having to restart their weights."}, {"time": 5964, "text": "And you can have an agent that is kind of solving or classifying images on ImageNet, but also generating speech if you ask it to generate some speech."}, {"time": 5974, "text": "And it should really be kind of almost the same network, but it might not be a neural network."}, {"time": 5981, "text": "It might be a neural network with an optimization algorithm attached to it."}, {"time": 5985, "text": "But I think this idea of generalization to new task is something that we first must define good benchmarks."}, {"time": 5992, "text": "But then I think that's going to be exciting."}, {"time": 5994, "text": "And I'm not sure how close we are."}, {"time": 5996, "text": "But I think if you have a very limited domain, I think we can start doing some progress."}, {"time": 6002, "text": "And much like how we did a lot of programs in computer vision, we should start thinking."}, {"time": 6009, "text": "I really like a talk that Leon Buto gave at ICML a few years ago, which is this train test paradigm should be broken."}, {"time": 6017, "text": "We should stop thinking about a training set and a test set."}, {"time": 6023, "text": "And these are closed things that are untouchable."}, {"time": 6026, "text": "I think we should go beyond these."}, {"time": 6028, "text": "And in meta learning, we call these the meta training set and the meta test set, which is really thinking about, if I know about ImageNet, why would that network not work on MNIST, which is a much simpler problem?"}, {"time": 6041, "text": "But right now, it really doesn't."}, {"time": 6044, "text": "But it just feels wrong."}]}]