[{"title": "Sara Walker: The Origin of Life on Earth and Alien Worlds | Lex Fridman Podcast #198", "id": "-tDQ74I3Ovs", "quotes": [{"time": 269, "text": "Was there heat sources, energy sources?"}, {"time": 271, "text": "So if we talk about the metabolism view of the origin of life, like where was the source of energy?"}, {"time": 278, "text": "Probably the most popular view for where the origin of life happened on Earth is hydrothermal vents because they had sufficient energy."}, {"time": 285, "text": "And so we don't really know a lot about early Earth."}, {"time": 290, "text": "We have some ideas about when oceans first formed and things like that, but the time of the origin of life is kind of not well understood or pinned down and the conditions on Earth at that time are not well known."}, {"time": 302, "text": "But a lot of people do think that there was probably hydrothermal vents which are really hot, chemically active regions, say on the seafloor in modern times, which also would have been present on early Earth."}, {"time": 314, "text": "And they would have provided energy and organics and basically all of the right conditions for the origins of life, which is one of the reasons that we look for these hydrothermal systems when we're talking about life elsewhere too."}, {"time": 327, "text": "Okay, and for the genetic code, the idea is that the RNA is the first, like why would RNA be the first moment you can say it's life?"}, {"time": 337, "text": "I guess the idea is it could both have persistent information and then it can also do some of the work of like what, creating a self sustaining organism?"}, {"time": 349, "text": "Yeah, that's the basic idea."}, {"time": 350, "text": "So the idea is you have, in an RNA molecule, you have a sequence of characters, say, so you can treat it like a string in a computer and it can be copied."}, {"time": 360, "text": "So information can be propagated, which is important for evolution because evolution happens by having inheritance of information."}, {"time": 369, "text": "So for example, like my eyes are brown because my mother's eyes were brown."}, {"time": 373, "text": "So you need that copying of information, but then you also have the ability to perform catalysis, which means that that RNA molecule is not inert in that environment, but it actually interacts with something and could potentially mediate, say, a metabolism that could then fuel the actual reproduction of that molecule."}, {"time": 395, "text": "So in some ways, people think that RNA gives you the most bang for your buck in a single molecule and therefore, it gives you all the features that you might think are life."}, {"time": 409, "text": "And so this is sort of where this RNA world conjecture came from is because of those two properties."}, {"time": 414, "text": "Isn't it amazing that RNA came to be in general?"}, {"time": 419, "text": "Yes, that is amazing."}, {"time": 421, "text": "Okay, so we're not talking down about RNA."}, {"time": 423, "text": "No, no, I love RNA."}, {"time": 424, "text": "It's one of my favorite molecules."}, {"time": 426, "text": "I think it's beautiful."}, {"time": 426, "text": "It's just not step one."}, {"time": 428, "text": "Yeah, I think the issue, it's not even the RNA world is a problem and actually, if you really dig into it, the RNA world is not one hypothesis."}, {"time": 439, "text": "It is a set of hypothesis, hypotheses, sorry."}, {"time": 442, "text": "And they range from a molecule of RNA spontaneously emerged on the early Earth and started evolving, which is kind of like the hardest RNA world scenario, which is the one I cited and I get a little animated about because it seems so blatantly wrong to me, but that's a separate story."}, {"time": 460, "text": "And then the other one is actually something I agree with, which is that you can say there was an RNA world because RNA was the first genetic material for life on Earth."}, {"time": 470, "text": "So an RNA world could just be the earliest organisms that had genetics in a modern sense, didn't have DNA evolved yet, they had RNA, right?"}, {"time": 481, "text": "And so that's sort of a softer RNA world scenario in the sense that it doesn't mean it was the first thing that happened, but it was a thing that definitely was part of the lineage of events that led to us."}, {"time": 492, "text": "So if a life was like a best of album, it would be on the, it'd be one of the songs on there."}, {"time": 498, "text": "One of the early songs."}, {"time": 500, "text": "It's on the greatest hits."}, {"time": 501, "text": "Greatest hits, that's the word I was looking for."}, {"time": 504, "text": "Did life, do you think, originate once, twice, three times on Earth, multiple times?"}, {"time": 511, "text": "I think that's a really difficult question."}, {"time": 513, "text": "Is it an important question?"}, {"time": 515, "text": "It's a super important question."}, {"time": 516, "text": "No, it's a really important question."}, {"time": 519, "text": "And so there's a lot of questions in that question."}, {"time": 525, "text": "So one of the first ones that I think needs to be addressed is is the origin of life a continuous process on our planet?"}, {"time": 532, "text": "So we think about the origin of life as something that happened on Earth, say almost 4 billion years ago, because we have evidence of life emerging very early on our planet."}, {"time": 542, "text": "And then an origin of life event, quote unquote, a singular event, whatever that was, happened."}, {"time": 548, "text": "And then all life on Earth that we know is a descendant of that particular event in our universe, right?"}, {"time": 554, "text": "And so, but we don't have any idea one way or the other if the origin of life is happening repeatedly, and maybe it's just not taking off because life is already established."}, {"time": 567, "text": "That's a argument that people will make, or maybe there are alternative forms of life on Earth that we don't even recognize."}, {"time": 575, "text": "So this is the idea of a shadow biosphere that there actually might just be completely other life on Earth, but it's so alien that we don't even know what it is."}, {"time": 582, "text": "I'm gonna have to talk to you about the shadow biosphere."}, {"time": 585, "text": "Yeah, that's a fun one."}, {"time": 586, "text": "In a second, but first, let me ask for the other alternative, which is panspermia."}, {"time": 592, "text": "So that's the idea, the hypothesis that life exists elsewhere in the universe and got to us through like an asteroid or a planetoid or some, according to Wikipedia, space dust, whatever the heck that is."}, {"time": 605, "text": "It sounds fun."}, {"time": 606, "text": "But basically, it rode along whatever kind of rock and got to us."}, {"time": 611, "text": "Do you think that's at all a possibility?"}, {"time": 615, "text": "So I think the reason that most original life scientists are interested in the original life on Earth and say not the original life on Mars and then panspermia, the exchange of life between planets being the explanation is once you start removing the original life from Earth, you know even less about it than you do if you study it on Earth."}, {"time": 636, "text": "Although, I think there are ways of reformulating the problem."}, {"time": 638, "text": "This is why I said earlier, oh, you mean the historical original life problem."}, {"time": 642, "text": "You don't mean the problem of how does life arise in the universe and what the universal principles are because there's this historic problem, how did it happen on early Earth?"}, {"time": 650, "text": "And there's a more tractable general problem of how does it happen?"}, {"time": 655, "text": "And how does it happen is something we can actually ask in the lab."}, {"time": 658, "text": "How did it happen on early Earth is a much more detailed and nuanced question and requires detailed knowledge of what was happening on early Earth that we don't have."}, {"time": 668, "text": "And I'm personally more interested in general mechanisms."}, {"time": 671, "text": "So to me, it doesn't matter if it happened on Earth or it happened on Mars."}, {"time": 675, "text": "It just matters that it happened."}, {"time": 676, "text": "We have evidence it happened."}, {"time": 678, "text": "The question is, did it happen more than once in our universe?"}, {"time": 681, "text": "And so the reason I don't find panspermia as a particularly, I think it's a fascinating hypothesis."}, {"time": 688, "text": "I definitely think it's possible."}, {"time": 690, "text": "And I in particular think it's possible once you get to the stage of life where you have technology because then you obviously can spread out into the cosmos."}, {"time": 700, "text": "But it's also possible for microbes because we know that certain microorganisms can survive the journey in space."}, {"time": 707, "text": "And they can live in a rock and go between Mars and Earth."}, {"time": 710, "text": "Like people have done experiments to try to prove that could work."}, {"time": 714, "text": "So in that scenario, it's super cool because then you get planetary exchange, but say we go look for life on Mars and it ends up being exactly the same life we have on Earth, biochemically speaking, then we haven't really discovered something new about the universe."}, {"time": 726, "text": "What kind of aliens are possible were there other origin of life events?"}, {"time": 730, "text": "If we find, if all the life we ever find is the same origin of life event in the universe, it doesn't help me solve my problem."}, {"time": 736, "text": "But it's possible that that would be a sign that you could separate the environment from the basic ingredients."}, {"time": 745, "text": "So you can have like a life gun that you shoot throughout the universe."}, {"time": 750, "text": "And then like once you shoot it, it's like the Simpsons with a makeup gun."}, {"time": 754, "text": "That was a great episode."}, {"time": 756, "text": "When you shoot this life gun, it'll find the Earth's, it'll like get sticky."}, {"time": 762, "text": "It'll stick to the Earth's."}, {"time": 764, "text": "And that kind of reduces the barrier of like the time it takes, the luck it takes to actually, from nothing, from the basic chemistry, from the basic physics of the universe for the life to spring up."}, {"time": 778, "text": "Yeah, I think this is actually super important to just think about, like does life getting seated on a planet have to be geochemically compatible with that planet?"}, {"time": 788, "text": "So you're suggesting like we could just shoot guns in space and like life could go to Mars and then it would just live there and be happy there."}, {"time": 796, "text": "But that's actually an open question."}, {"time": 798, "text": "So one of the things I was gonna say in response to your question about whether the origin of life happened once or multiple times, is for me personally right now in my thinking, although this changes on a weekly basis, but is that I think of life more as a planetary phenomenon."}, {"time": 811, "text": "So I think the origin of life because life is so intimately tied to planetary cycles and planetary processes, and this goes all the way back through the history of our planet, that the origin of life itself grew out of geochemistry and became coupled and controlled geochemistry."}, {"time": 826, "text": "And when we start to talk about life existing on the planet is when we have evidence of life actually influencing properties of the planet."}, {"time": 835, "text": "And so if life is a planetary property, then going to Mars is not a trivial thing because you basically have to make Mars more Earth like."}, {"time": 845, "text": "And so in some sense, like when I think about sort of longterm vision of humans in space, for example, really what you're talking about when you're saying, let's send our civilization to Mars is you're not saying let's send our civilization to Mars, you're saying let's reproduce our planet on Mars."}, {"time": 861, "text": "Like the information from our planet actually has to go to Mars and make Mars more Earth like, which means that you're now having a reproduction process, like a cell reproduces itself to propagate information in the future."}, {"time": 872, "text": "Planets have to figure out how to reproduce their conditions, including geochemical conditions on other planets in order to actually reproduce life in the universe, which is kind of a little bit radical, but I think for longterm sustainability of life on a planet, that's absolutely essential."}, {"time": 887, "text": "Okay, so if we were to think about life as a planetary phenomena, and so life on Mars would be best if it's way different than life on Earth, we have to ask the very basic question of what is life?"}, {"time": 903, "text": "I actually don't think that's the right question to ask."}, {"time": 906, "text": "It took me a long time to get there, right?"}, {"time": 907, "text": "So I... Cross it out."}, {"time": 908, "text": "Yeah, cross it off your list, it's wrong."}, {"time": 913, "text": "No, no, no, I mean, I think it has an answer, but I think the part of the problem is, you know, most of the places in science where we get really stuck is because we don't know what questions to ask."}, {"time": 922, "text": "And so you can't answer a question if you're asking the wrong question."}, {"time": 925, "text": "And I think the way I think about it is obviously I'm interested in what life is."}, {"time": 931, "text": "So I'm being a little cheeky when I say that's the wrong question to ask."}, {"time": 933, "text": "That's exactly like the question that's like the core of my existence."}, {"time": 936, "text": "But I think the way of framing that is what is it about our universe that allows features that we associate life to be there?"}, {"time": 947, "text": "And so really what I guess when I'm asking that question, what I'm after is an explanatory framework for what life is, right?"}, {"time": 954, "text": "And so most people, they try to go in and define life and they say, well, life is say, a self reproducing chemical system capable of Darwinian evolution."}, {"time": 962, "text": "That's a very popular definition for life."}, {"time": 965, "text": "Or life is something that metabolizes and eats."}, {"time": 968, "text": "That is not how I think about life."}, {"time": 970, "text": "What I think about life is there are principles and laws that govern our universe that we don't understand yet, that have something to do with how information interacts with the physical world."}, {"time": 983, "text": "I don't know exactly what I mean even when I say that, because we don't know these rules, but it's a little bit like, I like to use analogies."}, {"time": 992, "text": "You give me time to be like a little long winded for a second, even in as I, but sort of like if you look at the history of physics, for example, this is like, so we are in the period of the development of thought on our planet where we don't understand what we are yet."}, {"time": 1009, "text": "There was a period of thought in the history of our planet where we didn't understand what gravity was."}, {"time": 1013, "text": "And we didn't understand, for example, that planets in the heavens were actually planets or that they operated by the same laws that we did."}, {"time": 1022, "text": "And so there has been this sort of progression of getting a deeper understanding of explaining basic phenomena."}, {"time": 1029, "text": "Like, I'm not gonna drop the cup."}, {"time": 1030, "text": "I'll drop the water bottle."}, {"time": 1032, "text": "Okay, that fell, right?"}, {"time": 1033, "text": "But why did that fall?"}, {"time": 1036, "text": "This is why I'm a theorist, not an experimentalist."}, {"time": 1039, "text": "That could have gone wrong in so many ways."}, {"time": 1040, "text": "I know, it could have, especially if I did the cup and it smashed."}, {"time": 1043, "text": "So if you take this view that there's sort of some missing principles, I associate them to information."}, {"time": 1053, "text": "And what the sort of feeling there is, there's some missing explanatory framework for how our universe works."}, {"time": 1060, "text": "And if we understood that physics, it would explain what we are."}, {"time": 1064, "text": "It might also explain a lot of other features we don't associate to life."}, {"time": 1068, "text": "And so it's a little like people accept the fact that gravity is a universal phenomena."}, {"time": 1074, "text": "But when we wanna study gravity, we study things like large scale, galactic structures or black holes or planets."}, {"time": 1082, "text": "If we wanna understand information and how it operates in the physical world, we study intelligent systems or living systems because they are the manifestation of that physics."}, {"time": 1090, "text": "And the fact that we can't see that clearly yet, or we don't have that explanatory framework, I think it's just because we haven't been thinking about the problem deeply enough."}, {"time": 1098, "text": "But I feel like if you're explaining something, you're deriving it from some more fundamental property."}, {"time": 1104, "text": "And of course, I have to say I'm wearing my physicist hat."}, {"time": 1108, "text": "So I have a huge bias of liking simple, elegant explanations of the universe that really are compelling."}, {"time": 1117, "text": "But I think one of the things that I've sort of maybe in some ways rejected my training as a physicist is that most of the elegant explanations that we have so far don't include us in the universe."}, {"time": 1127, "text": "And I can't help but think there's something really special about what we are."}, {"time": 1130, "text": "And there have to be some deep principles at play there."}, {"time": 1134, "text": "And so that's sort of my perspective on it."}, {"time": 1137, "text": "Now, when you ask me what life is, I have some ideas of what I think it is, but I think that we haven't gotten there yet because we haven't been able to see that structure."}, {"time": 1147, "text": "And just to go back to the gravity example, it's a little like in ancient times, they didn't know, I was talking about stars and heavens and things."}, {"time": 1154, "text": "They didn't know those were governed by the same principles as that darned experiment."}, {"time": 1159, "text": "Here's where I was going with it."}, {"time": 1160, "text": "Once you realize, like Newton did, that heavenly motions and earthly motions are governed by the same principles and you unify terrestrial and celestial motion, you get these more powerful ideas."}, {"time": 1171, "text": "And I think where life is is somehow unifying these abstract ideas of computation and information with the physical world, with matter, and realizing that there's some explanatory framework that's not physics and it's not computation, but it's something that's deeper."}, {"time": 1189, "text": "So answering the question of what is life requires deeply understanding something about the universe as information processing, the universe is computation."}, {"time": 1199, "text": "It's something about, like would, once you come up with an answer to what is life, will the words information and computation be in the paragraph that answer?"}, {"time": 1209, "text": "Oh, damn it, okay."}, {"time": 1210, "text": "I know, it doesn't help, does it?"}, {"time": 1211, "text": "I know, I hate, actually I hate this about what I do because it's so hard to communicate, right, with words."}, {"time": 1216, "text": "Like when you have words that are ideas that have historically described one thing and you're trying to describe something people haven't seen yet, and the words just don't fit."}, {"time": 1227, "text": "So what's wrong, is it too ambiguous, the word information?"}, {"time": 1231, "text": "We could switch to binary if you want."}, {"time": 1233, "text": "Yeah, no, I don't think it's binary either."}, {"time": 1235, "text": "I think information's just loaded."}, {"time": 1236, "text": "I use it, so the other way I might talk about it is the physics of causation, but I think that's worse because causation is even more loaded word than information."}, {"time": 1246, "text": "So causation is fundamental, you think?"}, {"time": 1248, "text": "I do, yeah, and in some sense, I think the physics, so this is the really radical part, some sense, like when I really think about it sort of most deeply, what I think life is is actually the physics of existence, what gets to exist and why."}, {"time": 1262, "text": "And for simple elementary particles, that's not very complicated because the interactions are simple, but for things like you and me and human civilizations, what comes next in the universe is really dependent on what came before, and there's a huge space of possibilities of things that can exist."}, {"time": 1278, "text": "And when I say information and causation, what I mean is why is it that cups evolved in the universe and not some other object that could deliver water and not spill it?"}, {"time": 1289, "text": "I don't know what you would call it."}, {"time": 1291, "text": "Maybe it wouldn't be a cup, but it's a huge, people talk about the space of things that could exist as being actually infinitely large, right?"}, {"time": 1300, "text": "I don't know if I believe in infinity, but I do think that there is something very interesting about the problem of what exists in its relationship to life."}, {"time": 1313, "text": "So do you think the set of things that could exist is finite?"}, {"time": 1318, "text": "It's very large, but if we were to think about the physics of existence, how many shapes of mugs can there be?"}, {"time": 1328, "text": "In the initial programming."}, {"time": 1330, "text": "I should go to the math department for that."}, {"time": 1333, "text": "So that's not a topology question."}, {"time": 1334, "text": "I just mean, maybe another way to ask is what do you think is fundamental to the universe and what is emergent?"}, {"time": 1341, "text": "So if existence, are we supposed to think of that as somehow fundamental, you think?"}, {"time": 1346, "text": "So there's a couple of problems in physics that I think this is related to."}, {"time": 1349, "text": "One is why does mathematics work at describing reality so well?"}, {"time": 1353, "text": "And then there is this problem of we don't understand why the laws of physics are the way they are, or why certain things get to exist, or what put in place the initial condition of our universe."}, {"time": 1364, "text": "There's all of these sort of really deep and big problems, and they all indirectly are related, I think, to the same kind of thing that, our physics is really good if you specify the initial condition at specifying a certain sequence of events, but it doesn't deal with the fact that other things could have happened, which is kind of an informational property, like a counterfactual property."}, {"time": 1388, "text": "And it's not good at explaining this conversation right now."}, {"time": 1395, "text": "There are certain things that are outside the explanatory reach of current physics, and I think they require looking at it from a completely different direction."}, {"time": 1405, "text": "And so I don't wanna have to fine tune the initial condition of the universe to specify precisely all the information in this conversation."}, {"time": 1411, "text": "I think that's a ridiculous assertion."}, {"time": 1413, "text": "But that's sort of like how people wanna frame it when they talk about the standard model is sufficient if we had computing power to basically explain all of life in our existence."}, {"time": 1424, "text": "An interesting thing you said is the way we think about information computation is by observing a particular kind of systems on Earth that exhibit something we think of as intelligence."}, {"time": 1436, "text": "But that's like looking at, I guess, the tip of an iceberg, and we should be really looking at the fundamentals of the iceberg, like what makes water and ice and the chemistry from which intelligence emerges, essentially."}, {"time": 1454, "text": "We can't just couple the information from the physics, and I think that's what we've gotten really good at doing, especially with sort of the modern age where software is so abstracted from hardware."}, {"time": 1469, "text": "But the entire process of biological evolution has basically been built, like been building layers of increasing abstraction."}, {"time": 1476, "text": "And so it's really hard to see that physics in us, but it's much clearer to see it in molecules."}, {"time": 1482, "text": "Yeah, but I guess I'm trying to figure out what do you think are the best tools to look at it?"}, {"time": 1490, "text": "An open mind?"}, {"time": 1491, "text": "Is that a tool?"}, {"time": 1493, "text": "What's the physics of an open mind?"}, {"time": 1496, "text": "I think if we solve that, we'll solve everything."}, {"time": 1498, "text": "I'm saying an open mind because I think the biggest stumbling block to understanding sort of the things I've been trying to articulate, and when I talk also with colleagues that are thinking deeply about these same issues, is none of it is inconsistent with what we know."}, {"time": 1515, "text": "It's just such a radically different perception of the way we understand things now that it's hard for people to get there."}, {"time": 1521, "text": "And in some ways you have to almost forget what you've learned in order to learn something new, right?"}, {"time": 1525, "text": "So I feel like most of my career trying to understand the problem of life has been variously forgetting and then relearning things that I learned in physics."}, {"time": 1535, "text": "And I think you have to have a capacity to learn things, but then accept that things that you learned might not be true or might need refinement or reframing."}, {"time": 1551, "text": "And the best way I can say that is just like with a physics education, there are just certain things you're told in undergrad that are like facts about the world."}, {"time": 1558, "text": "And your physics professors never tell you that those facts actually emerge from a human mind, right?"}, {"time": 1564, "text": "So we're taught to think about, say the laws of physics, for example, as this like autonomous thing that exists outside of our universe and tells our universe how it works."}, {"time": 1573, "text": "But the laws of physics were invented by human minds to describe things that are regularities in our everyday experience."}, {"time": 1579, "text": "They don't exist autonomous to the universe."}, {"time": 1581, "text": "Right, so it's like turtles on top of turtles, but eventually it gets to the human mind, and then you have to explain the human mind with the turtles."}, {"time": 1589, "text": "So you have to, it comes from humans, this understanding, this simplification of the universe, these models."}, {"time": 1596, "text": "There's a guy named Stephen Wolfram."}, {"time": 1598, "text": "There's a concept called cellular automata."}, {"time": 1602, "text": "So there's some mysteries in these systems that are computational in nature that have maybe echoes of the kind of mysteries we should need to solve to understand what is life."}, {"time": 1619, "text": "So if we could talk, take a computational view of things, do you think there's something compelling to reducing everything down to computation, like the universe is computation, and then trying to understand life?"}, {"time": 1635, "text": "So throw away the biology, throw away the chemistry, throw away even the physics that you learn undergrad and graduate school, and more look at these simple little systems, whether it's cellular automata or whatever the heck kind of computational systems that operate on simple local rules and then create complexity as they evolve."}, {"time": 1656, "text": "Is it at all, do you think, productive to focus on those kinds of systems to get an inkling of what is life?"}, {"time": 1664, "text": "And if it is, do you think it's possible to come up with some kind of laws and principles about what makes life in those computational systems?"}, {"time": 1676, "text": "So I like cellular automata."}, {"time": 1677, "text": "I think they're good toy models, but mostly where I've thought about them and used them is to actually, let's say, poke at sort of the current conceptual framework that we have and see where the flaws are."}, {"time": 1693, "text": "So I think the part that you're talking about that people find intriguing is that if you have a fairly simple rule and you specify some initial condition and you run that rule on that initial condition, you could get really complex patterns emerging."}, {"time": 1706, "text": "And ooh, doesn't that look lifelike?"}, {"time": 1711, "text": "Well, it's like really surprising, isn't it really surprising?"}, {"time": 1713, "text": "It is really surprising, and they're beautiful."}, {"time": 1715, "text": "And I think they have a lot of nice features associated to them."}, {"time": 1719, "text": "I think the things that I find, yeah, so I do think as a proof of principle that you can get complex things emerging from simple rules."}, {"time": 1730, "text": "As a sort of proof of principle about some of the ways that we might think of computation as being sort of a fundamental principle for dynamical systems and maybe the evolution of the universe as a whole, they're a great model system."}, {"time": 1745, "text": "As an explanatory framework for life, I think they're a bit problematic for the same reason that the laws of physics are a bit problematic."}, {"time": 1756, "text": "And the clearest way I can articulate that is like cellular automata are actually cast in sort of a conceptual framework for how the universe should be described that goes all the way back to Newton, in fact, with this idea that we can have a fixed law of motion, which exists sort of, it's given to you."}, {"time": 1777, "text": "The great programmer in the sky gave you this equation or this rule, and then you just run with it."}, {"time": 1783, "text": "And the rule doesn't have, so a good feature of the rule is it doesn't have specified in the rule information about the patterns it generates."}, {"time": 1791, "text": "So you wouldn't want, for example, my cup or my water bottle or me sitting here to be specified in the laws of physics."}, {"time": 1798, "text": "That would be ridiculous because it wouldn't be a very simple explanation of all the things happening."}, {"time": 1801, "text": "It'd have to explain everything."}, {"time": 1803, "text": "So, and cellular automata have that feature and the laws of physics have that feature."}, {"time": 1809, "text": "But you also need to specify the initial condition."}, {"time": 1813, "text": "And it also, it basically means that everything that happens is sort of a consequence of that initial condition."}, {"time": 1819, "text": "And I think this kind of framework is just not the right one for biology."}, {"time": 1825, "text": "And part of the way that it's easiest to see this is a lot of people talk about self reference being important in life."}, {"time": 1833, "text": "The fact that, you know, like the genome has information encoded in it, that information gets read out."}, {"time": 1841, "text": "It specifies something about the architecture of a cell."}, {"time": 1845, "text": "The architecture of the cell includes the genome."}, {"time": 1847, "text": "So the genome has basically self referential information."}, {"time": 1859, "text": "So there's a lot of parallels there and people have talked about that at depth."}, {"time": 1865, "text": "But the other way of kind of thinking about it in terms of like a more physicsy way of talking about it is that what it looks like in biology is that the rules or the laws depend on the state."}, {"time": 1875, "text": "This is typical in computer science."}, {"time": 1877, "text": "This is obvious to you."}, {"time": 1878, "text": "You know, the update rule depends on the state of the machine, right?"}, {"time": 1880, "text": "But, you know, you don't think about, you know, that being sort of the dynamic in physics."}, {"time": 1887, "text": "It's, you know, the rules given to you and then it's a very special subclass say of computations if, you know, you don't ever change the update."}, {"time": 1896, "text": "But in biology, it seems to be that the state and the law change together as a function of time and we don't have that as a paradigm in physics."}, {"time": 1903, "text": "And so a lot of people talk about this as being kind of a perplexing feature that maybe there are certain scenarios where the laws of physics or the laws that govern a particular system actually change as a function of the state of that system."}, {"time": 1918, "text": "So yeah, the hope of physics, it's a hope, I guess, but often stated as a underlying assumption is that the law is static."}, {"time": 1930, "text": "And even having laws that vary in time and not even as a function of the state is very radical."}, {"time": 1936, "text": "When you..."}, {"time": 1937, "text": "The time in general, like you wanna remove time from the equation as much as possible."}, {"time": 1944, "text": "There's some interesting things in this like when we think sort of more deeply about the actual physics that we're trying to propose governs life with me with collaborators and then also other people that think about similar things that time might actually be fundamental and there really is an ordering to time."}, {"time": 1958, "text": "And that events in the universe are unique because they have a particular, they happen, like an object in the universe requires a certain history of events in order to exist, which therefore suggests that time really does have an ordering."}, {"time": 1970, "text": "I'm not talking about the flow of time and our perception of time, just the ordering of events."}, {"time": 1973, "text": "Causation of things."}, {"time": 1974, "text": "Yes, causation, there's that word again."}, {"time": 1976, "text": "So causation, that's when you say time, you mean causation."}, {"time": 1980, "text": "In your proposed model of the physics of life, the fundamental thing would be causation."}, {"time": 1988, "text": "If you were to bet your money on one particular horse or whatever."}, {"time": 1993, "text": "And then space is emergent."}, {"time": 1996, "text": "So everything's emergent except time."}, {"time": 1999, "text": "Kind of, yeah, or causation."}, {"time": 2001, "text": "And laws change all the time."}, {"time": 2002, "text": "Why does it look like laws are the same?"}, {"time": 2004, "text": "Laws, well, because, well, one way, and I actually, this idea comes from Lee Cronin because I work with him very closely on these things, is that the laws of physics look the way they do because they're low memory laws."}, {"time": 2015, "text": "So they don't require a lot of information to specify them."}, {"time": 2017, "text": "They're very easy for the universe to implement."}, {"time": 2019, "text": "But if you get something like me, for example, I require 4 billion year history to exist in the universe."}, {"time": 2024, "text": "I come with a lot of historical baggage."}, {"time": 2027, "text": "And that's part of what I am as a set of causes that exist in the universe."}, {"time": 2032, "text": "So I have local rules that apply to me that are associated with sort of the information in my history that aren't universal to every object in the universe."}, {"time": 2041, "text": "And there are some things that are very easy to implement low memory rules that apply to everything in the universe."}, {"time": 2048, "text": "So there's no shortcuts to you."}, {"time": 2050, "text": "No, so yeah, I don't believe in things like Boltzmann brains or fluctuations out of the vacuum that can produce things like your desk ornaments."}, {"time": 2061, "text": "I actually think they require a particular causal chain of events to exist."}, {"time": 2066, "text": "Well, I appreciate the togetherness of that, but so how does that, if we have to simulate the entire universe to create the ornaments in the two of us, how are we supposed to create engineer life in the lab?"}, {"time": 2082, "text": "This goes back to sort of the critique of the RNA world."}, {"time": 2085, "text": "I think one of the problems, and I'll get to answer your question, but I think this is kind of relevant here."}, {"time": 2090, "text": "One of the problems with the RNA world, when we test it in the laboratory, is how much information we're putting into the experiment."}, {"time": 2097, "text": "We specify the flasks, we make pure reagents, we mix them, we take them out, we put them in the next flask, we change the pH, we change the UV light, and then we get a molecule, and it's not even an RNA molecule necessarily, it might just be a base, right?"}, {"time": 2111, "text": "And so people don't usually think about the fact that we're agents in the universe making that experiment, and therefore we put a little bit of life into that experiment, because it's part of our biological lineage, in the same sense that I am a part of the biological lineage."}, {"time": 2126, "text": "The experiment is."}, {"time": 2127, "text": "I mean, our ideas are injecting life."}, {"time": 2131, "text": "And the constraints that we put on the experiments, because those conditions wouldn't exist in the universe on planet Earth at that time without us as the boundary condition, right?"}, {"time": 2141, "text": "Even though we're not actually adding any actual chemistry or biology that could be identified as life, are the constraints we're adding to the experiment, the design of the experiment."}, {"time": 2151, "text": "Yeah, you can think of the design experiment as a program."}, {"time": 2153, "text": "You put information in."}, {"time": 2154, "text": "It's an algorithmic procedure that you design the experiment."}, {"time": 2157, "text": "And so the origin of life problem becomes one of minimizing the information we put into physics to actually watch the spontaneous origin of life."}, {"time": 2167, "text": "Can we have, so can, is it possible in the lab to have an information vacuum then?"}, {"time": 2173, "text": "If we could, we would, that would be amazing."}, {"time": 2175, "text": "That's a good question for, more for Lee."}, {"time": 2177, "text": "Yeah, you guys, by the way, for people who don't know, Lee Cronin is, you guys are colleagues."}, {"time": 2183, "text": "I've gotten the chance to listen to the two of you talking."}, {"time": 2186, "text": "There's great sort of chemistry and you're brilliant brainstorming together."}, {"time": 2190, "text": "And there's a really exciting community here of brilliant people from different disciplines working on the problem of life, of complexity, of, I don't know, whatever."}, {"time": 2202, "text": "The words fail us to describe the exact problem we're trying to actually understand here."}, {"time": 2207, "text": "Intelligence, all those kinds of things."}, {"time": 2209, "text": "Okay, so what, from a lab perspective, so Lee, I guess, would you call him a chemist?"}, {"time": 2218, "text": "I think by training he's a chemist, but I think most of the people that work in the field, we do have lost their discipline."}, {"time": 2222, "text": "That's why I couldn't answer your question earlier."}, {"time": 2227, "text": "I don't know what you call him."}, {"time": 2228, "text": "I don't know what I call myself."}, {"time": 2229, "text": "I don't know what I call any of my friends."}, {"time": 2231, "text": "So why is it so hard to create, and it's an interesting question, to create biological life in the lab."}, {"time": 2239, "text": "Like from your perspective, is that an important problem to work on to try to recreate the historical origin of life on Earth or echoes of the historical origin?"}, {"time": 2251, "text": "I think echoes is more appropriate."}, {"time": 2252, "text": "I don't think asking the question of what was the exact historical sequence of events and engineering every step in the process to make exactly the chemistry of life on Earth as we know it is a meaningful way of asking the question."}, {"time": 2266, "text": "And it's a little bit like, since you're in computer science, like if you know the answer to a problem, it's easier to find a program to specify the output, right?"}, {"time": 2276, "text": "But if you don't know the answer a priori, finding an algorithm for it, like say finding a prime or something, it's easy to verify it's a prime number."}, {"time": 2284, "text": "It's hard to find the next prime."}, {"time": 2287, "text": "And the way the origin of life is structured right now in the historical problem is you know the answer and you're trying to retrodict it by breaking it down into the set of procedures where you're putting a lot of information in."}, {"time": 2299, "text": "And what we need to do is ask the question of how is it that the rules of how our universe is structured permit things like life to exist and what is the phenomena of life?"}, {"time": 2309, "text": "And those questions are obviously essentially the same question."}, {"time": 2313, "text": "And so you're looking essentially for this missing physics, this missing explanation for what we are, and you need to set up proper experiments that are gonna allow you to probe the vast complexity of chemistry in an unconstrained way with as little information put in as possible to see when things, when does information actually emerge?"}, {"time": 2333, "text": "How does it emerge?"}, {"time": 2337, "text": "And part of the sort of conjecture we have is that this physics only becomes relevant or at least this is my personal conjecture and it's sort of validated by this kind of theory experiment collaboration that we have working in this area that this, you know, sort of, I made the point about like gravity existing everywhere, right?"}, {"time": 2358, "text": "But when you study an atomic nucleus, you don't care about gravity."}, {"time": 2362, "text": "It's not relevant physics there, right?"}, {"time": 2363, "text": "It's weak, it doesn't matter."}, {"time": 2366, "text": "And so this idea that there's kind of a physics associated with information, for me, it's very evident that that physics doesn't become relevant until you need information to specify the existence of a particular object."}, {"time": 2381, "text": "And the scale of reality where that happens is in chemistry because of the combinatorial diversity of chemical objects that can exist far out, exceeds the amount of resources in our universe."}, {"time": 2393, "text": "So if you want it, you can't make every possible protein of length, you know, 200 amino acids, there's not enough resources."}, {"time": 2400, "text": "So in order for this particular protein to exist and this protein to exist in high abundance means that you have to have a system that has knowledge of the existence of that protein and can build it."}, {"time": 2412, "text": "So existence comes to be at the chemical level."}, {"time": 2415, "text": "So existence is most, is best understood at the chemical level."}, {"time": 2420, "text": "It's most evident."}, {"time": 2422, "text": "It's a little bit like, nobody argues that gravity doesn't exist in an atomic nucleus."}, {"time": 2425, "text": "It's just not relevant physics there, right?"}, {"time": 2427, "text": "So the physics of information."}, {"time": 2429, "text": "Is everywhere."}, {"time": 2430, "text": "It exists at every combinatorial scale, but it becomes more and more relevant the more set of possibilities that could exist because you have to specify more and more about why this thing exists and not the infinite."}, {"time": 2441, "text": "It's not an infinite set, but you know, the set of undefined set of other things that could exist."}, {"time": 2446, "text": "So can I ask a weird question, which is, so let's look into the future."}, {"time": 2453, "text": "I try that every day."}, {"time": 2454, "text": "It never works."}, {"time": 2456, "text": "So say a Nobel prize is given in physics, maybe chemistry for discovering the origin of life."}, {"time": 2466, "text": "No, but not the historical origin."}, {"time": 2469, "text": "Some kind of thing that we're talking about."}, {"time": 2472, "text": "What exactly would, what do you think that, like, what do you think that person, maybe you did to get that Nobel prize?"}, {"time": 2484, "text": "Like what would they have to have done?"}, {"time": 2486, "text": "Cause you can do a bunch of experiments that go like within the aha moment."}, {"time": 2490, "text": "Like you rarely get the Nobel prize for like, you've solved everything, we're done."}, {"time": 2497, "text": "It's like some inkling of some deep truth."}, {"time": 2500, "text": "Like what do you think that would actually look like?"}, {"time": 2503, "text": "Would it be an experimental result?"}, {"time": 2506, "text": "I mean, it will have to have some kind of experimental, maybe validation component."}, {"time": 2510, "text": "So what would that look like?"}, {"time": 2512, "text": "This is an excellent question."}, {"time": 2514, "text": "I want to, sorry, I'm going to make a quick point, which is just a slight tangent."}, {"time": 2518, "text": "But you know, like when people ask about the origin of mass, and like looking for the Higgs mechanism and things, they never are like, we need to find the historical origins of life in the early unit."}, {"time": 2527, "text": "Although those things are related, right?"}, {"time": 2528, "text": "So this problem of origins of life in the lab, I think is really important."}, {"time": 2532, "text": "But the Higgs is a good example because you had theory to guide it."}, {"time": 2535, "text": "So somehow you need to have an explanatory framework that can say that we should be looking for these features and explain why they might be there and then be able to do the experiment and demonstrate that it matches with the theory."}, {"time": 2550, "text": "But it has to be something that is outside sort of the paradigm of what we might expect based on what we know, right?"}, {"time": 2556, "text": "So this is a really sort of tall order."}, {"time": 2559, "text": "And I think, I mean, I guess the way people would think about it is like, you know, if you had a bacteria that climbed out of your test tube or something, and it was like, you know, moving around on the surface, that would be ultimate validation."}, {"time": 2572, "text": "You saw the origin of life in an experiment, but I don't think that's quite what we're looking for."}, {"time": 2576, "text": "I think what we're looking for is evidence of when information that originated within the bounds of your experiment and you can demonstrably prove emerged spontaneously in your experiment, wasn't put in by you, actually started to govern the future dynamics of that system and specify it."}, {"time": 2599, "text": "And you could somehow relate those two features directly."}, {"time": 2603, "text": "So you know that the program specifying what's happening in that system is actually internal to that system."}, {"time": 2609, "text": "Like say you have a chemical thing in a box."}, {"time": 2612, "text": "Well, so that's one Nobel Prize winning experiment, which is like information in some fundamental way originated within the constraints of the system without you injecting anything."}, {"time": 2624, "text": "But another experiment is you injected something."}, {"time": 2630, "text": "And got out information."}, {"time": 2632, "text": "So like you injected, I don't know, like some sugar and like something that doesn't necessarily feel like it should be information."}, {"time": 2643, "text": "Yeah, so I actually know, I mean, sugar is information, right?"}, {"time": 2647, "text": "So part of the argument here is that every physical object is, well, it's information, but it's a set of causal histories and also a set of possible futures."}, {"time": 2656, "text": "So there is an experiment that I've talked a lot about with Lee Cronin, but also with Michael Lockman and Chris Kempis who are at Santa Fe about this idea that sometimes we talk about as like seeding assembly, which is you take a high complexity, like an object that exists in the universe because of a long causal history, and you seed it into a system of lower causal history."}, {"time": 2678, "text": "And then suddenly you see all of this complexity being generated."}, {"time": 2681, "text": "So I think another validation of the physics would be, say you engineer an organism by purposefully introducing something where you understand the relationship between the causal history of the organism and the say very complex chemical set of ingredients you're adding to it."}, {"time": 2698, "text": "And then you can predict the future evolution of that system to some statistical set of constraints and possibilities for what it will look like in the future."}, {"time": 2711, "text": "I'm a physical structure, obviously, like I'm composed of atoms, the configuration of them and the fact that they happen to be me is because I'm not actually my atoms, I am a informational pattern that keeps re patterning those atoms into Sarah."}, {"time": 2728, "text": "And I have also associated to me like a space of possible things that could exist that I can help mediate come into existence because of the information in my history."}, {"time": 2741, "text": "And so when you understand sort of that time is a real thing embedded in a physical object, then it becomes possible to talk about how histories when they interact and a history is not a unique thing, it's a set of possibilities."}, {"time": 2759, "text": "When they interact, how do they specify what's coming next?"}, {"time": 2763, "text": "And then where does the novelty come from in that structure?"}, {"time": 2765, "text": "Cause some of it is kind of things that haven't existed in the past can exist in the future."}, {"time": 2769, "text": "Let me ask about this entity that you call Sarah."}, {"time": 2774, "text": "I talk to myself about myself in third person sometimes."}, {"time": 2779, "text": "So maybe this is a good time to bring up consciousness."}, {"time": 2784, "text": "It's been here all along."}, {"time": 2786, "text": "Well, has it?"}, {"time": 2788, "text": "So, I mean that's."}, {"time": 2789, "text": "At least in this conversation, I think I've been conscious most of it, but maybe I haven't."}, {"time": 2793, "text": "So speak for yourself."}, {"time": 2794, "text": "You're projecting your consciousness onto me."}, {"time": 2797, "text": "You don't know if I'm conscious or not."}, {"time": 2801, "text": "Is that, you talked about the physics of existence, you talked about the emergence of causality, sorry, you talked about causality and time being fundamental to the universe."}, {"time": 2815, "text": "Where does consciousness fit into all of this?"}, {"time": 2818, "text": "Like, do you draw any kind of inspiration or value with the idea of panpsychism that maybe one of the things that we ought to understand is the physics of consciousness?"}, {"time": 2832, "text": "Like one of the missing pieces in the physics view of the world is understanding the physics of consciousness."}, {"time": 2840, "text": "Or like that word has so many concepts underneath it, but let's put consciousness as a label on a black box of mystery that we don't understand."}, {"time": 2852, "text": "Do you think that black box holds the key to finally answering the question of the physics of life?"}, {"time": 2860, "text": "The problems are absolutely related."}, {"time": 2862, "text": "I think most, and I'm interested in both because I'm just interested in what we are."}, {"time": 2866, "text": "And to me, the most interesting feature of what we are is our minds and the way they interact with our minds."}, {"time": 2871, "text": "Like minds are the most beautiful thing that exists in the universe."}, {"time": 2873, "text": "So how do they come to be?"}, {"time": 2876, "text": "So when you say we, you mean humans."}, {"time": 2878, "text": "I mean humans right now, but that's because I'm a human."}, {"time": 2881, "text": "Or at least I think I am."}, {"time": 2882, "text": "But you think there's something special to this particular?"}, {"time": 2886, "text": "No, I'm not a human centric thinker."}, {"time": 2891, "text": "But are you one entity?"}, {"time": 2892, "text": "You said a bunch of stuff came together to make a Sarah."}, {"time": 2895, "text": "Like do you think of yourself as one entity or are you just a bunch of different components?"}, {"time": 2900, "text": "Like is there any value to understand the physics of Sarah?"}, {"time": 2904, "text": "Or are you just a bunch of different things that are like a nice little temporary side effect?"}, {"time": 2910, "text": "Yeah, you could think of me as a bundle of information that just became temporarily aggregated into your individual, yeah."}, {"time": 2917, "text": "I agree with that view."}, {"time": 2918, "text": "I'll take that as a compliment actually."}, {"time": 2922, "text": "But nevertheless, that bundle of information has become conscious."}, {"time": 2927, "text": "Or at least keeps calling herself conscious."}, {"time": 2931, "text": "Yeah, I think I'm conscious right now, but I might not be, but that's okay."}, {"time": 2935, "text": "Or you wouldn't know."}, {"time": 2936, "text": "So yeah, so this is the problem."}, {"time": 2937, "text": "So yeah, usually people when they're talking about consciousness are worried about the subjective experience."}, {"time": 2942, "text": "And so I think that's why you're saying, I don't know if you're conscious because I don't know if you're experiencing this conversation right now."}, {"time": 2949, "text": "And nor do you know if I'm experiencing the conversation right now."}, {"time": 2952, "text": "And so this is why this is called the hard problem of consciousness because it seems impenetrable from the outside to know if something's having a conscious experience."}, {"time": 2961, "text": "And I really like the idea of also like the hard problem of matter, which is related to the hard problem of consciousness, which is you don't know the intrinsic properties of an electron not interacting, say for example, with anything else in the universe."}, {"time": 2975, "text": "All the properties of anything that exists in the universe are defined by its interaction because you have to interact with it in order to be able to observe it."}, {"time": 2982, "text": "So we can only actually know the things that are observable from the outside."}, {"time": 2986, "text": "And so this is one of the reasons that consciousness is hard for science because you're asking questions about something that's subjective and supposed to be intrinsic to what that thing is as it exists and how it feels about existing."}, {"time": 2999, "text": "And so I have thought a lot about this problem and its relationship to the problem of life."}, {"time": 3005, "text": "And the only thing I can come up with to try to make that problem scientifically tractable and also relate it to how I think about the physics of life is to ask the question, are there things that can only happen in the universe because there are physical systems that have subjective experience?"}, {"time": 3028, "text": "So does subjective experience have different causes that things that it can cause to occur that would happen in the absence of that?"}, {"time": 3038, "text": "I don't know the answer to that question, but I think that's a meaningful way of asking the question of consciousness."}, {"time": 3043, "text": "I can't ask if you're having experience right now, but I can ask if you having experience right now changes something about you and the way you interact with the world."}, {"time": 3053, "text": "So does stuff happen?"}, {"time": 3056, "text": "It's a good question to ask, does stuff happen if consciousness is?"}, {"time": 3061, "text": "Then it's a real physical thing, right?"}, {"time": 3063, "text": "It has physical consequences."}, {"time": 3064, "text": "I'm a physicist, I'm biased, so I can't get rid of that bias."}, {"time": 3068, "text": "It's really deeply ingrained."}, {"time": 3070, "text": "I've tried, but it's hard."}, {"time": 3072, "text": "But I mean, you're saying information is physical too."}, {"time": 3074, "text": "So like virtual reality, simulation, all that program is physical too in the sense of."}, {"time": 3078, "text": "Yes, everything's physical."}, {"time": 3079, "text": "It's just not physical the way it's represented in our minds."}, {"time": 3082, "text": "Right, so you, I love your Twitter."}, {"time": 3085, "text": "So you tweet these like deep thoughts, deep thoughts."}, {"time": 3089, "text": "That's what a theorist does when she's trying to experiment."}, {"time": 3093, "text": "Is tweet?"}, {"time": 3095, "text": "It's just like sitting there."}, {"time": 3096, "text": "I mean, I could just imagine you sitting there for like hours and all of a sudden just like this thought comes out and you get a little like inkling into the thought process."}, {"time": 3106, "text": "Yeah, usually it's like when I'm running between things and not so much when I've had deep thoughts."}, {"time": 3110, "text": "Well, yeah, so you."}, {"time": 3112, "text": "Deep thoughts are hard to articulate."}, {"time": 3113, "text": "One of the things you tweeted is, ideologically, there are many parallels between the search for neural correlates of consciousness and for chemical correlates of life."}, {"time": 3124, "text": "How the neuroscience and astrobiology communities treat those correlates is entirely different."}, {"time": 3130, "text": "Can you elaborate against this kind of the parallels?"}, {"time": 3134, "text": "It has to do a little bit with the consciousness and the matter thing you're talking about."}, {"time": 3140, "text": "And I can't remember what state of mind I was when I was actually thinking about that."}, {"time": 3144, "text": "But I think part of it is."}, {"time": 3147, "text": "I bet you never thought you were gonna have to analyze your own tweets."}, {"time": 3151, "text": "It's an interesting historical juxtaposition of thinking."}, {"time": 3155, "text": "So the tweet is a historical."}, {"time": 3158, "text": "You're doing an assembly experiment right now because you're bringing a thought from the past into the present and trying to actually."}, {"time": 3163, "text": "In a lab."}, {"time": 3165, "text": "This is experimental science right here on the podcast live."}, {"time": 3171, "text": "So go, let's see how the consciousness evolves on this one."}, {"time": 3173, "text": "Yeah, so in neuroscience, it's kind of accepted that we can't get at the subjective aspect of consciousness."}, {"time": 3181, "text": "So people are very interested in what would be a correlate of consciousness."}, {"time": 3188, "text": "What's a correlate?"}, {"time": 3189, "text": "A correlate is a feature that relates to conscious activity."}, {"time": 3194, "text": "So for example, a verbal report is a correlate of consciousness because I can tell you when I'm conscious."}, {"time": 3202, "text": "And then when I'm sleeping, for example, I can't tell you I'm conscious."}, {"time": 3206, "text": "So we have this assumption that you're not conscious when you're sleeping and you're conscious when you're awake."}, {"time": 3211, "text": "And so that's sort of like a very obvious example, but neuroscientists, which I'm no neuroscientist and I'm not an expert in this field."}, {"time": 3220, "text": "So, but they have very sophisticated ways of measuring activity in our brain and trying to relate that to verbal report and other proxies for whether someone is experiencing something."}, {"time": 3231, "text": "And that's what is meant by neural correlates."}, {"time": 3234, "text": "And then, so when people are trying to think about studying consciousness or developing theories for consciousness, they often are trying to build an experimental bridge to these neural correlates, recognizing the fact that a neural correlate may or may not correspond to consciousness because that problem's hard and there's all these associated issues to it."}, {"time": 3259, "text": "So that's, from a neuroscience perspective, it's like fake it till you make it."}, {"time": 3263, "text": "So you."}, {"time": 3263, "text": "Pretty much, yeah."}, {"time": 3264, "text": "You fake whatever the correlates are and hopefully that's going to summon the thing that is consciousness."}, {"time": 3273, "text": "And so the same thing on the chemical correlates of life."}, {"time": 3277, "text": "That sounds like, that's an awesome concept."}, {"time": 3279, "text": "Is that something that people?"}, {"time": 3281, "text": "No, I just made that up."}, {"time": 3283, "text": "That was original to that tweet."}, {"time": 3283, "text": "You can cite the tweet."}, {"time": 3285, "text": "Maybe I'll write it in a paper someday."}, {"time": 3288, "text": "Chemical correlates of life, that's a good title."}, {"time": 3290, "text": "I mean, first of all, your paper is true that people should check out, have great titles."}, {"time": 3296, "text": "Or papers you're involved with."}, {"time": 3298, "text": "So your tweets and titles are stellar and also your ideas, but the tweets and titles are much more important."}, {"time": 3306, "text": "Ideas will live longer."}, {"time": 3310, "text": "They're much more diffused though."}, {"time": 3312, "text": "Well, it's, yeah, it's the Trojan, the tweet is the Trojan horse of the idea that sticks on for a long time."}, {"time": 3318, "text": "Okay, so is there anything to say about the chemical correlates of life?"}, {"time": 3320, "text": "You're saying they're similar kind of ways of thinking about it, but you mentioned about the communities."}, {"time": 3330, "text": "Yeah, so I think in astrobiology, it's not, there's no concept of chemical correlates of life."}, {"time": 3337, "text": "We don't think about it that way."}, {"time": 3338, "text": "We think if we find molecules that are involved in biology, we found life."}, {"time": 3344, "text": "So I think one of my motivations there was just to separate the fact that life has abstract properties associated to it."}, {"time": 3353, "text": "They become imprinted in material substrates and those substrates are correlates for that thing, but they are not necessarily the thing we're actually looking for."}, {"time": 3362, "text": "The thing that we're looking for is the physics that's organizing that system to begin with, not the particular molecules."}, {"time": 3368, "text": "In the same sense that, you know, your consciousness is not your brain."}, {"time": 3373, "text": "It's instantiated in your brain."}, {"time": 3376, "text": "You know, it has to have a physical substrate, but it's not, the matter is not the thing that you're looking at."}, {"time": 3382, "text": "It's some other, at least not in the way that we have come to look at matter, you know, with traditional physics and things."}, {"time": 3388, "text": "There's something else there and it might be this feature of history I was talking about, our time being actually, you know, physically represented there."}, {"time": 3395, "text": "Do you think consciousness can be engineered?"}, {"time": 3400, "text": "In the same way that life can be engineered?"}, {"time": 3401, "text": "Well, that was a fast answer."}, {"time": 3404, "text": "You don't have a free will."}, {"time": 3405, "text": "That was predestined."}, {"time": 3406, "text": "No, I do have free will, but it's interesting, because I mean, you know, Now you're backtracking."}, {"time": 3412, "text": "And that was predestined."}, {"time": 3413, "text": "Yeah, no, no."}, {"time": 3415, "text": "No, I do believe in free will, but I also think that there's kind of an interesting, you know, like what you're speaking about consciousness."}, {"time": 3423, "text": "What are you consciously aware of versus like what is your subconscious brain actually processing and doing?"}, {"time": 3428, "text": "And sometimes there's conflict between your consciousness and your subconsciousness or your consciousness is a little slower than your subconscious."}, {"time": 3436, "text": "And intuition is a really important feature of that."}, {"time": 3438, "text": "And so a lot of the ways I do my science is guided by intuition."}, {"time": 3442, "text": "So when I give fast answers like that, I think it's usually because I haven't really thought about them and therefore that's probably telling me something."}, {"time": 3449, "text": "Let's continue the deep analysis of your tweets."}, {"time": 3453, "text": "You said that determinism in a tweet, determinism and randomness play important roles in understanding what life is."}, {"time": 3460, "text": "So let me ask on this topic of free will, what is determinism, what is randomness and why the heck do they have anything to do with understanding life?"}, {"time": 3470, "text": "Yeah, and you threw free will in there, just throwing all the stuff in the bag."}, {"time": 3475, "text": "Are they not related, determinism and randomness?"}, {"time": 3476, "text": "No, no, they are related."}, {"time": 3478, "text": "No, no, that's all right."}, {"time": 3479, "text": "I was being unfair."}, {"time": 3480, "text": "You didn't even capitalize the tweet, by the way."}, {"time": 3482, "text": "It was all lowercase."}, {"time": 3483, "text": "I must've been angry."}, {"time": 3485, "text": "Oh, that was saying, can you analyze the emotion behind that?"}, {"time": 3488, "text": "No, I actually did."}, {"time": 3489, "text": "Is it frustration or is it hope?"}, {"time": 3490, "text": "So I already argued that I don't think that can happen without that whole causal history."}, {"time": 3496, "text": "And so I guess in some sense, the determinism for me arises because of the causal history."}, {"time": 3503, "text": "And I'm not really sure actually about whether the universe is random or deterministic."}, {"time": 3509, "text": "I just had this sort of intuition for a long time."}, {"time": 3512, "text": "I'm not sure if I agree with it anymore, but it's still kind of lingering and I don't know what to do with this question."}, {"time": 3517, "text": "But it seems to me, you know, so you asked the question, what is life?"}, {"time": 3521, "text": "But you could also, why life?"}, {"time": 3522, "text": "Why does life exist?"}, {"time": 3523, "text": "What does the universe need life for?"}, {"time": 3525, "text": "Not that the universe has needs, but you know, we have to anthropocentrize things sometimes to talk about them."}, {"time": 3530, "text": "And I had this feeling that if it was possible for a cup or a desk ornament or a phone on Mars to spontaneously fluctuate into existence, the universe didn't need life to create those objects."}, {"time": 3541, "text": "It wasn't necessary for their existence."}, {"time": 3543, "text": "It was just a random fluke event."}, {"time": 3545, "text": "And so somehow to me, it seems that it can't be that those things formed by random processes, they actually have to have a set of causes that accrue and form those things and they have to have that history."}, {"time": 3558, "text": "And so it seems to me that that life was somehow deeply related to the question of whether the underlying rules of our universe had randomness in them or they were fully deterministic."}, {"time": 3569, "text": "And in some ways you can think about life as being the most deterministic part of physics because it's where the causes are precise in some sense."}, {"time": 3579, "text": "Or most stable."}, {"time": 3580, "text": "So like I'm trying..."}, {"time": 3581, "text": "Most stable, yes, most reliable."}, {"time": 3582, "text": "Most reliable for the tools of physics."}, {"time": 3587, "text": "But where's the randomness come from then?"}, {"time": 3590, "text": "Okay, so you were speaking with..."}, {"time": 3594, "text": "I've gone in a tangent, so I'm not sure where we are in the... Yeah."}, {"time": 3598, "text": "All of the universe is a kind of tangent."}, {"time": 3600, "text": "So we're embracing the tangent."}, {"time": 3603, "text": "So free will, you believe at this current time that you have free will."}, {"time": 3609, "text": "I believe my whole life I have free will."}, {"time": 3611, "text": "What is illusion?"}, {"time": 3611, "text": "No, just kidding."}, {"time": 3612, "text": "I still believe it."}, {"time": 3614, "text": "You still believe it."}, {"time": 3615, "text": "So at the same time you think that in your conception of the universe, causality seems to be pretty fundamental."}, {"time": 3624, "text": "Which kind of wants the universe to be deterministic."}, {"time": 3627, "text": "So how the heck do you think you have a free will and yet you value causality?"}, {"time": 3635, "text": "Because I depart from the conception of physics that you can write down an initial condition and a fixed law of motion and that will describe everything."}, {"time": 3645, "text": "There's no incompatibility if you are willing to reject that assertion."}, {"time": 3649, "text": "So where's the randomness?"}, {"time": 3651, "text": "Where's the magic that gives birth to the free will?"}, {"time": 3654, "text": "Is it the randomness of the laws of physics?"}, {"time": 3656, "text": "No, in my mind what free will is, is the fact that I as a physical system have causal control over certain things."}, {"time": 3665, "text": "I don't have causal control over everything, but I have a certain set of things."}, {"time": 3669, "text": "And I'm also, as I described, sort of a nexus of a particular set of histories that exist in the universe and a particular set of futures that might exist."}, {"time": 3678, "text": "And those futures that might exist are in part specified by my physical configuration as me."}, {"time": 3685, "text": "And therefore, it may not be free will in the traditional sense."}, {"time": 3690, "text": "I don't even know what people mean when they're talking about free will, honestly."}, {"time": 3693, "text": "It's like the whole discussion's really muddled."}, {"time": 3695, "text": "But in the sense that I am a causal agent, if you wanna call it that, that exists in the universe, and there are certain things that happen because I exist as me, then yes, I have free will."}, {"time": 3705, "text": "No, but do you, Sarah, have a choice about what's going to happen next?"}, {"time": 3713, "text": "If the universe, could I have, if I run this universe."}, {"time": 3718, "text": "Where does the choice come from?"}, {"time": 3720, "text": "I think that's related to the physics of consciousness."}, {"time": 3722, "text": "So one of the things I didn't say about that, I don't know, maybe this is me just being hopeful because maybe I just wanna have free will, but I don't think that we can rule out the possibility because I don't think that we understand enough about any of these problems."}, {"time": 3734, "text": "But I think one of the things that's interesting for me about the sort of inversion of the question of consciousness that I proposed is one of the features that we do is we have imagination, right?"}, {"time": 3747, "text": "And people don't think about imagination as a physical thing, but it is a physical thing."}, {"time": 3750, "text": "It exists in the universe, right?"}, {"time": 3752, "text": "And so I'm like really intrigued by the fact that say, humans for, another physical system could do this too, it's not special to humans, but for centuries imagined flying machines and rockets, and then we finally built them, right?"}, {"time": 3765, "text": "So they were represented in our minds and on the pages of things that we drew for hundreds of years before we could build those physical objects in the universe."}, {"time": 3774, "text": "But certainly the existence of rockets is in part causally, caused by the fact that we could imagine them."}, {"time": 3783, "text": "And so there seems to be this property that some things don't exist, they've never physically existed in the universe, but we can imagine the possibility of them existing and then cause them to exist, maybe individually or collectively."}, {"time": 3798, "text": "And I think that property is related to what I would say about having choice or free will, because that set of possibilities, those set of things that you can imagine is not constrained to your local physical environment and history."}, {"time": 3842, "text": "It's trippy physics, but it exists, so there you go."}, {"time": 3845, "text": "I mean, in some sense, if you look at like general relativity and gravity morphing space time in that same way, maybe whatever the physics of consciousness might be, it might be morphing, that's like what free will is."}, {"time": 3858, "text": "It's morphing like the space, just like ideas make rockets come to life."}, {"time": 3865, "text": "It's somehow changing the space of possible realizations of like whatever's, yeah, okay, but that's."}, {"time": 3873, "text": "Life is kind of basically, if you wanna think about it, like life is sort of changing the probability distributions over what can exist."}, {"time": 3879, "text": "That's the physics of what life is."}, {"time": 3880, "text": "And then consciousness is this sort of layered property or imagination on top of it that kind of scrambles that a little bit more and like has access to, I don't know."}, {"time": 3890, "text": "It's kind of, we don't know how to describe it, right?"}, {"time": 3893, "text": "Like that's why it's interesting, but."}, {"time": 3894, "text": "But it's probabilistic."}, {"time": 3895, "text": "So you do think like God plays dice."}, {"time": 3897, "text": "So let me."}, {"time": 3898, "text": "No, I think the description is probabilistic."}, {"time": 3900, "text": "I don't necessarily think the underlying physics is probabilistic."}, {"time": 3906, "text": "I think the way that we can describe this physics is going to be probabilistic and statistical, but the under, like when we take measurements in the lab, but the underlying physics itself might still be deterministic."}, {"time": 3918, "text": "Maybe I'm, it's hard to know what concepts to hold on to."}, {"time": 3922, "text": "So I find myself constantly rejecting concepts, but then I have to grab another one and try to hold onto something from intellectual history."}, {"time": 3929, "text": "Well, it's possible that our mind is not able to hold the correct concepts in mind at all."}, {"time": 3933, "text": "Like we're not able to even conceive of them correctly."}, {"time": 3936, "text": "Maybe the word's deterministic or random or not the right even words, concepts to be holding."}, {"time": 3942, "text": "But maybe you can talk to the theory of everything, this attempt in the current set of physical laws to try to unify them."}, {"time": 3950, "text": "Is there any hope that once a theory of everything is developed, and by theory of everything, I mean in a narrow sense of unifying quantum field theory and general relativity, do you think that will contain some, like in order to do that unification, you would have to get something that would then give hints about the physics of life, physics of existence, physics of consciousness."}, {"time": 3975, "text": "Yeah, I used to not, but I actually, I have become increasingly convinced that it probably will."}, {"time": 3983, "text": "And part of the reason is, I think I've talked a little bit already about these holes in physics, like the theories we have in physics, they have problems, they have lots of problems and they're very deep problems and we don't know how to patch them."}, {"time": 3999, "text": "And some of those problems become very evident when you try to patch quantum mechanics and general relativity together."}, {"time": 4005, "text": "So there is this kind of interesting feature that some of the ways of patching that might actually closely resemble the physics of life."}, {"time": 4014, "text": "And so the place where that actually comes up most, and actually we just had a workshop in the Beyond Center where I work at Arizona State University, and Lee Smolin made this point that he thinks that the theory of quantum gravity when we solve it is gonna be the same theory that gives rise to life."}, {"time": 4028, "text": "And I think that I agree with him on some levels because there's something very interesting where, if you look at these sort of causal set theories of gravity where they're looking for space as being emergent."}, {"time": 4041, "text": "And so space time is an emergent concept from a causal set, which is also sort of related, I think, to what Wolfram's doing with his physics project."}, {"time": 4049, "text": "It's the same kind of underlying math that we have in this theory that we've been developing related to life called assembly theory, which is basically trying to look at complex objects like molecules and bacteria and living things as basically being assembled from a set of component parts and that they actually encode all the possible histories that they could have in that physical object."}, {"time": 4076, "text": "So mathematically, all these ideas I think are related."}, {"time": 4079, "text": "I think a lot of people are thinking about this from different perspectives."}, {"time": 4082, "text": "And then constructor theory that David Deutsch and Chiara Marletto have been developing is a totally different angle on it, but I think getting at some similar ideas."}, {"time": 4089, "text": "So it's a really interesting time right now, I think, for the frontiers of physics and how it's relating to maybe deeper principles about what life is."}, {"time": 4095, "text": "So short answer, yes."}, {"time": 4097, "text": "Long winded answer, rewind."}, {"time": 4100, "text": "Can we talk about aliens?"}, {"time": 4102, "text": "Anytime."}, {"time": 4105, "text": "So one, I think one interesting way to sneak up on the question of what is life is to ask what should we look for in alien life?"}, {"time": 4117, "text": "If we were to look out into our galaxy and into the universe and come up with a framework of how to detect alien life, what should we be looking for?"}, {"time": 4129, "text": "Is there like set of rules, like it's both the tools and the tools that are service sensors for certain kind of properties of life."}, {"time": 4141, "text": "So what should we look for in alien life?"}, {"time": 4145, "text": "Yeah, so we have a paper actually coming out on Monday, which is collaboration."}, {"time": 4149, "text": "It's actually really Lee Cronin's lab, but my group worked with him on it and we're working on the theory, which is this idea that we should look for life as high assembly objects."}, {"time": 4160, "text": "What we mean by that is, which is actually observationally measurable."}, {"time": 4164, "text": "And this is one of the reasons that I started working with Lee on these ideas is because being a theorist, it's easy to work in a vacuum."}, {"time": 4169, "text": "It's very hard to connect abstract ideas about the nature of life to anything that's experimentally tractable."}, {"time": 4176, "text": "But what his lab has been able to do is develop this method where they look at a molecule and they break it apart into all its component parts."}, {"time": 4186, "text": "And so you say you used to have some elementary building blocks and you can build up all the ways of putting those together to make the original object."}, {"time": 4192, "text": "And then you look for the shortest path in that space."}, {"time": 4195, "text": "And you say that's sort of the assembly number associated to that object."}, {"time": 4200, "text": "And if that number is higher, it assumes that a longer causal history is necessary to produce that object or more information is necessary to specify the creation of that object in the universe."}, {"time": 4211, "text": "Now, that kind of idea at a superficial level has existed for a long time."}, {"time": 4215, "text": "That kind of idea as a physical observable of molecules is completely novel."}, {"time": 4220, "text": "And what his lab has been able to show is that if you look at a bunch of samples of nonbiological things and biological things, there's this kind of threshold of assembly where as far as the experimental evidence is and also your intuitive intuition would suggest that nonbiological systems don't produce things with high assembly number."}, {"time": 4243, "text": "So this goes back to the idea like a protein is not gonna spontaneously fluctuate into existence on the surface of Mars."}, {"time": 4248, "text": "It requires an evolutionary process and a biological architecture to produce a protein."}, {"time": 4252, "text": "You generalize that argument, a complex molecule or a cup or a desk ornament in this sort of abstract idea of assembly spaces as being the causal history of objects."}, {"time": 4264, "text": "And you can talk about the shortest path from elementary objects to an object given an elementary set of operations."}, {"time": 4270, "text": "And you can experimentally measure that with mass spec."}, {"time": 4274, "text": "And that's basically the sort of the idea."}, {"time": 4277, "text": "I can't get out of my head."}, {"time": 4279, "text": "I'd start imagining Legos and all the Legos I've ever built and how many steps, what is the shortest path to the final little Lego castles?"}, {"time": 4288, "text": "So then like asking about going to look for alien life, the idea is most of the instruments that NASA builds, for example, or any of the space agencies looking for life in the universe are looking for chemical correlates of life, right?"}, {"time": 4301, "text": "But here we have something that is based on properties of molecules."}, {"time": 4306, "text": "It's not a chemical correlate, it's agnostic."}, {"time": 4309, "text": "It doesn't care about the molecule."}, {"time": 4310, "text": "It cares about what is the history necessary to produce this molecule?"}, {"time": 4316, "text": "How complex is it in terms of how much time is needing, how much information is required to produce it?"}, {"time": 4320, "text": "So when you observe a thing on another planet, you're essentially, the process looks like a reverse engineering, trying to figure out what is the shortest path to create that thing."}, {"time": 4331, "text": "Yeah, so most, yeah, and I would say most, like most examples of biology or technology don't take the shortest path, right?"}, {"time": 4338, "text": "But the shortest path is a bound on how hard it is for the universe to make that."}, {"time": 4341, "text": "Yeah, and I guess what you and Lee are saying that there's a heuristic, that's a good metric for like better perhaps than chemical correlates."}, {"time": 4351, "text": "Yes, because it doesn't, it's not contingent on looking for the chemistry of life on earth, on other planets."}, {"time": 4358, "text": "And it also has a deeper explanatory framework associated to it, as far as the kind of theory that we're trying to develop associated to what life is."}, {"time": 4367, "text": "And I think this is one of the problems I have in my field personally in astrobiology is people observe something on earth, say oxygen in the atmosphere or an amino acid in a cell, and then they say, let's go look for that on another planet."}, {"time": 4382, "text": "Let's look for oxygen on exoplanets or let's look for amino acids on Mars."}, {"time": 4386, "text": "And then they assume that's a way of looking for life or even phosphine on Venus."}, {"time": 4393, "text": "But you know, like there's all these examples of let's look for one molecule."}, {"time": 4397, "text": "A molecule is not life."}, {"time": 4398, "text": "Life is a system that patterns particular structures into matter."}, {"time": 4402, "text": "That's like, that's what it is."}, {"time": 4404, "text": "And it doesn't care what molecules are there."}, {"time": 4406, "text": "It's something about the patterns and that structure and that history."}, {"time": 4411, "text": "And if you're looking for a molecule, you're not testing any hypotheses about the nature of what life is."}, {"time": 4416, "text": "It doesn't tell me anything."}, {"time": 4417, "text": "If we discover oxygen on an exoplanet about what kind of life is there, just oxygen on an exoplanet."}, {"time": 4422, "text": "It's not, there's, I guess I think like, when you think about the question, are we alone in the universe?"}, {"time": 4427, "text": "That's a pretty fricking deep question."}, {"time": 4429, "text": "It should have a fricking deep answer."}, {"time": 4431, "text": "It shouldn't just be, there's a molecule on an exoplanet."}, {"time": 4433, "text": "Wow, we solved the problem."}, {"time": 4434, "text": "It should tell us something meaningful about our existence."}, {"time": 4436, "text": "And I feel like we've fallen short on how we're searching for life in terms of actually searching for things like us in this kind of deeper way."}, {"time": 4448, "text": "But how do you do that initial kind of, say I'm walking down the street and I'm looking for that double take test of like, like what the hell is that?"}, {"time": 4457, "text": "Like that initial, like how do we look for the possibility of weirdness or the possibility of high assembly number?"}, {"time": 4467, "text": "Like what would aliens look like if they don't have two eyes and are green?"}, {"time": 4472, "text": "If I knew, I wouldn't probably already solve the problem."}, {"time": 4475, "text": "Right, there's another Nobel Prize in there somewhere."}, {"time": 4477, "text": "Yeah, somewhere in there."}, {"time": 4479, "text": "Well, I think it's kind of, so there is a bias here, right?"}, {"time": 4483, "text": "So we've evolved to recognize life on earth, right?"}, {"time": 4485, "text": "Like I, you know, children at a very early age can tell the difference between a puppy and a plant and then the plant and a chair, for example."}, {"time": 4493, "text": "You know, like it just, it seems innate."}, {"time": 4495, "text": "And so I think, and also because we're life, you know, I think like there's this implicit bias that we should know it when we see it and it should be completely obvious to us."}, {"time": 4506, "text": "But there are a lot of features of our universe that are not completely obvious to us."}, {"time": 4510, "text": "Like the fact that this table is made of atoms and that I'm sitting in a gravitational potential well right now."}, {"time": 4516, "text": "And I guess my point with this is, I think life is much less obvious than we think it is."}, {"time": 4523, "text": "And so it could be in many more forms than we think it is."}, {"time": 4527, "text": "And I guess this goes back to the point about being open minded that we may not know what alien life looks like."}, {"time": 4533, "text": "It might not even be possible to interact with alien life because maybe something about, you know, our informational lineage, it makes it impossible for information from an alien to be copied to us."}, {"time": 4543, "text": "Therefore there's no, you know, so to speak communication channel."}, {"time": 4547, "text": "And I don't mean, you know, verbal communication, just it's not in our observational space."}, {"time": 4552, "text": "Like, you know, there's fundamental questions about why we observe the universe in position rather than momentum, but we also, you know, observe it in terms of certain informational patterns and things like that's what our brain constructs and maybe aliens just interact with a different part of reality than we do."}, {"time": 4568, "text": "That's wildly speculative, but I think, I think."}, {"time": 4572, "text": "But it's possible."}, {"time": 4572, "text": "It's possible and I think it's consistent with the physics."}, {"time": 4575, "text": "So I think the best ways we can ask questions are about life and chemistry and asking questions about if information is a real physical thing, what would its signatures be in matter and how do we recognize those?"}, {"time": 4588, "text": "And I think the ones that are most obvious are the ones I've already articulated."}, {"time": 4593, "text": "You have these objects that seem completely improbable for the universe to produce because the universe doesn't have the design of that object in the laws."}, {"time": 4600, "text": "So therefore an object had to evolve."}, {"time": 4604, "text": "We talk, we call it evolution, but it had to be produced by the universe that then had all of the possible tasks to make that object specified."}, {"time": 4614, "text": "I mean, there's some, like there's an engineering question here of, are there sensors we can create that can give us, can help us discover certain pockets of high assemblies aliens?"}, {"time": 4628, "text": "Like, I mean, there is a hope setting dogs and chairs aside, there's a hope that visually we could detect, like, because our universe, I mean, at least the way we look at it now, like this three dimensional like space time, we can visually comprehend it."}, {"time": 4649, "text": "It's interesting to think like, if we got to hang out, if there's an alien in this room, like would we be able to detect it with our current sensors?"}, {"time": 4659, "text": "Not the fancy kinds, but like web cam."}, {"time": 4661, "text": "Like say standing over there."}, {"time": 4663, "text": "Yeah, standing over there or maybe like in this carpet, see there's all these kinds of patterns, right?"}, {"time": 4668, "text": "I don't know if this carpet is an alien."}, {"time": 4672, "text": "Well, so I see what you're saying."}, {"time": 4676, "text": "So assembly theory is pretty general."}, {"time": 4677, "text": "Like, I mean, we've been applying it to molecules because it makes sense to apply it to molecules, but it's supposed to explain life, like the physics of life."}, {"time": 4687, "text": "So it should explain the things in this room in addition to molecules."}, {"time": 4691, "text": "So I guess, and you can apply it to images and things."}, {"time": 4694, "text": "So I guess the idea you could explore is just looking at everything on planet earth in terms of its assembly structure and then looking for things that aren't part of our biological lineage."}, {"time": 4707, "text": "If they have high assembly, they might be aliens on earth."}, {"time": 4709, "text": "I mean, that is a very kind of rigorous computer vision question."}, {"time": 4712, "text": "Can we visually, is there a strong correlation between certain kind of high assembly objects when they get to the scale where they're visually observable and some, like when it's say projected onto a 2D plane, can we figure out something?"}, {"time": 4729, "text": "I'm glad you brought up the computer vision point because for a while I had this kind of thought in my mind that we can't even see ourselves clearly."}, {"time": 4735, "text": "So one of the things, people are worried about artificial intelligence for a lot of reasons, but I think it's really fascinating because it's like the first time in history that we're building a system that can help us understand ourselves."}, {"time": 4746, "text": "So like, people talk about AI physics, but like, when I look at another person, I don't see them as a 4 billion year lineage, but that's what they are."}, {"time": 4756, "text": "And so is everything here, right?"}, {"time": 4758, "text": "So imagine that we built artificial systems that could actually see that feature of us, what else would they see?"}, {"time": 4766, "text": "And I think that's what you're asking."}, {"time": 4768, "text": "And I think that would be so cool."}, {"time": 4771, "text": "I want that to happen, but I think we're a little ways off from it, but yeah."}, {"time": 4778, "text": "We're going there, I hope."}, {"time": 4780, "text": "Okay, let me ask you, I apologize ahead of time, but let me ask you the internet question."}, {"time": 4785, "text": "So you're a physicist, you ask rigorous questions about the physics of existence and these models of high assembly objects."}, {"time": 4792, "text": "Now, when the internet would see an alien, they would ask two questions."}, {"time": 4796, "text": "One, can I eat it?"}, {"time": 4798, "text": "And two, can I have sex with it?"}, {"time": 4800, "text": "So, the internet is."}, {"time": 4802, "text": "All the existential questions, those are very important ones."}, {"time": 4805, "text": "The internet is very sophisticated."}, {"time": 4807, "text": "It really is, it's gotten our basal cognition pretty good."}, {"time": 4810, "text": "So you kind of mentioned that it's very difficult."}, {"time": 4812, "text": "It's possible that we may not be even able to communicate with it."}, {"time": 4816, "text": "Right, I think the internet has more hope than we do."}, {"time": 4818, "text": "Yeah, it's a hopeful place, yes."}, {"time": 4821, "text": "Do you think in terms of interacting on this very primal level of sharing resources, like what would aliens eat?"}, {"time": 4828, "text": "What would we eat?"}, {"time": 4829, "text": "Would we eat the same thing?"}, {"time": 4831, "text": "Could we potentially eat each other?"}, {"time": 4833, "text": "One person eats the other, or the aliens eat us."}, {"time": 4837, "text": "And the same thing with not sex in general, or reproduction, but genetically mixing stuff."}, {"time": 4842, "text": "Like, would we be able to mix genetic information?"}, {"time": 4846, "text": "Maybe not genetic, but maybe information, right?"}, {"time": 4848, "text": "And I think part of your question is like, so if you think of life as like this history of events that happen in the universe, like there's this question of like, how divergent are those histories, right?"}, {"time": 4859, "text": "So when we get to the scale of technology, it's possible to imagine, although we can't even do it."}, {"time": 4864, "text": "Like imagine all the possible technologies that could exist in the universe."}, {"time": 4866, "text": "But if you think about all the possible chemistries, somehow that seems like a lower dimensional space and a lower set of possibilities."}, {"time": 4872, "text": "So it might be that like when we interact with aliens, we do have to go back to those more basal levels to figure out sort of what the map is, right?"}, {"time": 4882, "text": "Like the sort of where we have a common history."}, {"time": 4885, "text": "We must have a common history somewhere in the universe, but in order to be able to actually interact in a meaningful way, you have to have some shared history."}, {"time": 4893, "text": "I mean, the reason we can exchange genetic information in each other's food or eat each other as food is because we have a shared history."}, {"time": 4900, "text": "So we have to find that shared history."}, {"time": 4902, "text": "We have to find the common ancestor in this causality map, the causality tree."}, {"time": 4907, "text": "Yes, and we have a last universal common ancestor for all life on earth, which I think is sort of the nexus of that causality map for life on earth."}, {"time": 4914, "text": "But the question is where would other aliens diverge on that map?"}, {"time": 4919, "text": "And I mean, so say there's a lot of aliens out there in the universe, each set of organisms will probably have like a number, you know, like Erdos number of like how far, like how far our common ancestor is."}, {"time": 4935, "text": "And so the closer the common ancestor, like it is on earth, the more likely we are to be able to have sexual reproduction."}, {"time": 4944, "text": "Well, it's like sort of like humans having common culture and languages, right?"}, {"time": 4947, "text": "Yeah, it might take a lot of work though with an alien cause you really have to get over a language barrier."}, {"time": 4956, "text": "So it's communication, it's resources."}, {"time": 4960, "text": "I mean, it's all the whole, and I think tied into that is the questions of like who's going to harm who."}, {"time": 4969, "text": "And actually definitions of harm."}, {"time": 4969, "text": "And whether your parents approve, you know, all those kind of questions."}, {"time": 4972, "text": "Whether the common ancestor approves."}, {"time": 4974, "text": "Yeah, that's just very true."}, {"time": 4978, "text": "How many alien civilizations do you think are out there?"}, {"time": 4981, "text": "I don't have intuition for that, which I have always thought was deeply intriguing."}, {"time": 4987, "text": "So, and part of this, I mean, I say it specifically as I don't have intuition for that because it's like one of those questions that you feel around for a while and you really just, you can't see it even though it might be right there."}, {"time": 5000, "text": "And in that sense, it's a little like the quantum to classical can transition."}, {"time": 5005, "text": "You're like really talking about two different kinds of physics."}, {"time": 5008, "text": "And I think that's kind of part of the problem."}, {"time": 5009, "text": "Once we understand the physics, that question might become more meaningful."}, {"time": 5013, "text": "But there's also this other issue, and this was really instilled on me by my mentor, Paul Davies, when I was a postdoc, because he always talks about how, you know, whether aliens are common or rare is kind of just, you know, it like, you know, it follows a wave of popularity and it just depends on like the mood of, you know, what the culture is at the time."}, {"time": 5033, "text": "And I always thought that was kind of an intriguing observation, but also there's this, you know, set of points about if you go by the observational evidence, which we're supposed to do as scientists, right?"}, {"time": 5043, "text": "You know, we have evidence of us and one origin of life event from which we emerged."}, {"time": 5051, "text": "And people wanna make arguments that because that event was rapid or because there's other planets that have properties similar to ours, that that event should be common."}, {"time": 5060, "text": "But you actually can't reason on that because our existence observing that event is contingent on that event happening, which means it could have been completely improbable or very common."}, {"time": 5069, "text": "And Brandon Carter, like clearly articulated that in terms of anthropic arguments a few decades ago."}, {"time": 5075, "text": "So there is this kind of issue that we have to contend with dealing with life that's closer to home than we have to deal with with any other problems in physics, which we're talking about the physics of ourselves."}, {"time": 5085, "text": "And when you're asking about the origin of life event, that event happening in the universe, at least as like our existence is contingent on it."}, {"time": 5092, "text": "And so you can think about sort of fine tuning arguments that way too."}, {"time": 5096, "text": "So, but the sort of otter part of it is like, when I think about how likely it is, I think it's because we don't understand this mechanism yet about how information can be generated spontaneously that I like, cause I can't see that physics clearly yet, even though I have a lot of, you know, like some things around the space of it in my mind, I can't articulate how likely that process is."}, {"time": 5122, "text": "So my honest answer is, I don't know."}, {"time": 5124, "text": "And sometimes that feels like a cop out, but I feel like that's a more honest answer and a more meaningful way of making progress than what a lot of people wanna do, which is say, oh, well, we have a one in 10 chance of having on an exoplanet with Earth like properties because there's lots of Earth like planets out there and life happened fast on Earth."}, {"time": 5140, "text": "Well, so I have kind of a follow up question, but as a side comment, what I really am enjoying about the way you're talking about human beings is you always say, and not to make yourself conscious about it, cause I really, really enjoy it."}, {"time": 5153, "text": "You say we, you don't say humans."}, {"time": 5157, "text": "You say, cause oftentimes like, you know, I don't know, evolutionary biologists will kind of put yourself out as an observer, but it's kind of fascinating to think that you as a human are struggling about your own origins."}, {"time": 5171, "text": "Yes, that's the problem."}, {"time": 5172, "text": "And yeah, and I think, I don't do that deliberately, but I do think that way."}, {"time": 5178, "text": "And this is sort of the inversion from the logic of physics because physics as it's always been constructed has treated us as external observers of the universe."}, {"time": 5186, "text": "And we are not part of the universe."}, {"time": 5187, "text": "And this is why the problem of life, I think demands completely new thinking because we have to think about ourselves as minds that exist in the universe and are at this particular moment in history and looking out at the things around us and trying to understand what we are inside the system, not outside the system."}, {"time": 5203, "text": "We don't have descriptions at a fundamental level that describe us as inside the system."}, {"time": 5208, "text": "And this was my problem with cellular automata also."}, {"time": 5211, "text": "You're always an external observer for a cellular automata."}, {"time": 5214, "text": "You're not in the system."}, {"time": 5215, "text": "What does the cellular automata look like from the inside?"}, {"time": 5218, "text": "I think you just broke my brain with that question."}, {"time": 5221, "text": "But that's the fundamental."}, {"time": 5222, "text": "I thought about that for a long time, but."}, {"time": 5223, "text": "I'm gonna, yeah, that's a really clean formulation of a very fundamental question, because you can only, to understand cellular automata, you have to be inside of it."}, {"time": 5236, "text": "But as a human, sort of a poetic, romantic question, does it make you sad?"}, {"time": 5242, "text": "Does it make you hopeful whether we're alone or not?"}, {"time": 5247, "text": "Like in the different possible versions of that, if we're the highest assembly object in the entire universe, does that give you?"}, {"time": 5257, "text": "At this moment in time, maybe."}, {"time": 5258, "text": "At this moment in the causal."}, {"time": 5259, "text": "Cause we may, I assume we have a future."}, {"time": 5261, "text": "Well, we definitely have a future."}, {"time": 5263, "text": "The question is where that future decreases the assembly."}, {"time": 5267, "text": "Like it could be where at the peak, or we could be just."}, {"time": 5272, "text": "That would be inconsistent with the physics in my mind."}, {"time": 5275, "text": "But so I should give a caveat."}, {"time": 5279, "text": "I've given the caveat that I'm biased as a physicist, but I'm also biased as an eternal optimist."}, {"time": 5283, "text": "So pretty much all of my modes of operation for building theories about the world are not like an Occam's razor, what's the simplest explanation, but what's the most optimistic explanation."}, {"time": 5294, "text": "And part of the reason for that is if you really think explanations have causal power, in the sense that our, like the fact that we have theories about the world has enabled technologies and physically transform the world around us."}, {"time": 5307, "text": "I think I have to take seriously that as a part of the physics I wanna describe and try to build theories of reality that are optimistic about what's coming next because the theories are in part the causes of what comes next."}, {"time": 5322, "text": "So there could be a physics of hope or physics of optimism in there too."}, {"time": 5328, "text": "Is that seems like also, I mean, optimism does seem to be a kind of engine that results in innovation."}, {"time": 5337, "text": "So this is like, why the hell are we trying to come up with new stuff?"}, {"time": 5342, "text": "Oh, so I made this point about thinking life is the physics of existence."}, {"time": 5346, "text": "And it's not just the physics of existence, it's the physics of more things existing."}, {"time": 5351, "text": "So I think one of these drives of like."}, {"time": 5352, "text": "Creativity."}, {"time": 5353, "text": "Yeah, creativity, like optimism."}, {"time": 5356, "text": "So if you like, people like entropy."}, {"time": 5358, "text": "I don't like entropy as it was formulated in the 1800s."}, {"time": 5361, "text": "I think it's an antiquated concept, but this idea of maximizing over the possible number of states that could exist."}, {"time": 5368, "text": "Imagine the universe is actually trying to maximize over the number of things that could physically exist."}, {"time": 5373, "text": "What would be the best way to do that?"}, {"time": 5374, "text": "The best way to do that would be evolve intelligent technological things that could explore that space."}, {"time": 5381, "text": "So, okay, that's talking about alien life out there in the universe, but you've also earlier in the conversation mentioned the shadow biosphere."}, {"time": 5390, "text": "So is it possible that we have weird life here on earth that we're just not, like even in a high assembly formulation of life, that we're just not paying attention to?"}, {"time": 5405, "text": "We're blind to."}, {"time": 5407, "text": "Like life we're potentially able to detect, but we're blind to."}, {"time": 5410, "text": "And maybe you could say, what is the shadow biosphere?"}, {"time": 5413, "text": "Yeah, the shadow biosphere is this idea that there might've been other original life events that happened on earth that were independent from the original life event that led to us and all of the life that we know on earth."}, {"time": 5426, "text": "And therefore there could be aliens in the sense they have a different origin event."}, {"time": 5432, "text": "Living among us."}, {"time": 5434, "text": "And it was proposed by a number of people, but one of them was Paul Davies that I mentioned earlier is my mentor."}, {"time": 5441, "text": "And he has a really cute way of saying that aliens could be right under our noses or even in our noses."}, {"time": 5448, "text": "With a British accent, it sounds better."}, {"time": 5450, "text": "But anyway, so the idea is like, it could literally be anywhere around us."}, {"time": 5456, "text": "And if you think actually about the discovery of like viruses and bacteria, for a long time they were kind of a shadow biosphere."}, {"time": 5462, "text": "It was life that was around us, but invisible."}, {"time": 5468, "text": "But this takes it a little bit further and saying that all of those examples, viruses, bacteria and everything that we've discovered so far has this common ancestry and the last universal common ancestor of life on earth."}, {"time": 5478, "text": "So maybe there was a different origin event and that life is weirder still and might be among us and we could find it."}, {"time": 5486, "text": "We don't have to go out and the stars look for aliens just here on earth."}, {"time": 5489, "text": "Do you think that's a serious possibility that we should explore with the tools of science?"}, {"time": 5495, "text": "Like this should be a serious effort."}, {"time": 5496, "text": "I think yes and no."}, {"time": 5499, "text": "And I mean, yes, because I think it's a serious hypothesis and I think it's worth exploring."}, {"time": 5506, "text": "And it is certainly more economical to look for signs of alien life on earth than it is to go and build spacecraft and send robots to other planets."}, {"time": 5516, "text": "And that was one of the reasons it was proposed is, well, if we do find an example of another original life on earth, it's hugely informative because it means the origin of life is not a rare event."}, {"time": 5525, "text": "If it happened twice on the same planet, that means it's probably pretty probable given conditions are right."}, {"time": 5531, "text": "So it has huge potential scientific impact, not to mention the fact that you might have like biochemistry and stuff that's informative for like medicine and stuff like that."}, {"time": 5539, "text": "But I think the thing for me that's challenging about it and this really comes from my own work, like thinking about life as a planetary scale process and also trying to understand sometimes what I call like the statistical mechanics of biochemistry, but large scale statistical patterns in the chemistry that life uses on earth."}, {"time": 5558, "text": "There are a lot of regularities there and life does seem to have planetary scale organization that's consistent even with some of the patterns that we see at the individual scale."}, {"time": 5569, "text": "So if you think life is a planetary scale phenomenon and the chemistry of life has to be sort of not just, it's not, an individual is not necessarily the fundamental unit of life, right?"}, {"time": 5580, "text": "The fundamental unit of life is these informational lineages and they're kind of, they intersect over spatial scales."}, {"time": 5588, "text": "So everything on earth is kind of related by the common causal history."}, {"time": 5592, "text": "So it's hard for me based on the way I think about the physics and also some of the stuff that my group has done to really think that there could be evidence or there could be a second sample of life on earth."}, {"time": 5605, "text": "But I think there are ways that we need to be more concrete about that."}, {"time": 5608, "text": "And I have thought a little bit about like, like you can represent the chemistry in an individual cell as a network."}, {"time": 5615, "text": "And then those networks, something my group has shown actually scale with the same property."}, {"time": 5622, "text": "So ecosystems have the same properties as individuals as planetary scale."}, {"time": 5626, "text": "And then you could imagine if you had alien chemistry intermixed in there, that scaling would be broken."}, {"time": 5630, "text": "So if there's some robustness property or something associated to it, and you get alien chemistry in there, it just breaks everything."}, {"time": 5637, "text": "And you don't have a planetary ecosystem functioning and individuals functioning across all these scales."}, {"time": 5644, "text": "So I guess what I'm arguing is life is not a scale dependent phenomenon."}, {"time": 5648, "text": "It's not just cellular life."}, {"time": 5650, "text": "So if you have a shadow biosphere, it has to be integrated with all of these other scales."}, {"time": 5653, "text": "And that would lose the meaning of the word shadow biosphere, I guess."}, {"time": 5658, "text": "So it's an open question, right?"}, {"time": 5661, "text": "And I think it would tell us a lot."}, {"time": 5663, "text": "So there has been very minimal effort of people to look for a shadow biosphere."}, {"time": 5668, "text": "But then the question, it could be possible that there's like sufficiently distinct planets within one planet, meaning like environments within one planet."}, {"time": 5682, "text": "I've been looking recently because of having a chat with Catherine Duclair about Io, the moon of Jupiter, that's like all volcanoes and volcanoes are bad ass."}, {"time": 5691, "text": "But like, imagining life inside volcanoes, right?"}, {"time": 5698, "text": "It seems like sufficiently chemically different like to be living in the darkness where there's a lot of heat and maybe you could have different Earths on a planet."}, {"time": 5710, "text": "Or like if you go deep enough in the crust, maybe there's like a layer where there's no life."}, {"time": 5714, "text": "And then there's suddenly life again."}, {"time": 5715, "text": "And maybe those, you know, lizard men or whatever they are that people dream about are really down there."}, {"time": 5722, "text": "I know that's a little flippant, but really like there could be like chemical cycles deep in the Earth's crust that might be alive and are completely distinct in chemical origin to surface life."}, {"time": 5733, "text": "Right, that they wouldn't be interacting with each other."}, {"time": 5735, "text": "Yeah, and that's one of the proposals for the shadow biosphere is like, sometimes people talk about it as being geologically or geographically distinct that it might be, you know, you have no life for this region and then a different example."}, {"time": 5746, "text": "And then sometimes people talk about it being chemically distinct, that the chemistry is sufficiently different, that it's completely orthogonal or non interacting with our chemistry."}, {"time": 5754, "text": "It seems to me at least the chemistry is a more powerful boundary than geographic."}, {"time": 5762, "text": "It just seems like life finds a way literally to travel."}, {"time": 5768, "text": "What do you think about all these UFO sightings?"}, {"time": 5771, "text": "So to me, it's really inspiring."}, {"time": 5774, "text": "It's yet another localized way to dream about the mysterious that is out there."}, {"time": 5781, "text": "Yeah, so I've actually been more intrigued by the cultural phenomena UFOs than the phenomena UFOs themselves, because I think it's intriguing about how we are preparing ourselves mentally for understanding others and how we have thought about that historically and what the sort of modern incarnations of that are."}, {"time": 5804, "text": "It's more like, I want an explanation for us."}, {"time": 5807, "text": "That's my motivation."}, {"time": 5808, "text": "And having some, you know, streaks across the sky or something and saying that's aliens, it doesn't tell you anything."}, {"time": 5815, "text": "So unless you have a deeper explanation and you have, you know, more lines of, you know, where is this gonna take us in the future?"}, {"time": 5822, "text": "It's just not as interesting to me as the problem of understanding life itself and aliens as a more general phenomenon."}, {"time": 5828, "text": "I do think it's, just as you said, a good way to psychologically and sociologically prepare ourselves to sort of like, what would that look like?"}, {"time": 5837, "text": "And very importantly, which is what a lot of people talk about politically, sort of there's this idea from the, so I came from the Soviet Union of like the Cold War and we have to hide secrets."}, {"time": 5850, "text": "There's some way in us searching for life on other planets or our searching for life in general, the way we've done government in the past, we tend to think of all new things as potential military secrets, so we want to hide them."}, {"time": 5866, "text": "And one of the ways that people kind of look at UFO sightings is like, like maybe we shouldn't hide this stuff."}, {"time": 5873, "text": "Like what is the government hiding?"}, {"time": 5875, "text": "I think that's a really, you know, in one sense it's a conspiratorial question, but I think in another, it's an inspiration to change the way we do government to where secrets don't, maybe there are times when you want to keep secrets as military secrets, but maybe we need to release a lot more stuff and see us as a human species as together in this whole search."}, {"time": 5900, "text": "Yeah, the public engagement part there is really interesting."}, {"time": 5903, "text": "And it's almost like a challenge to the way we've done stuff in the past in terms of keeping secrets when they're not, so like the first step, if you don't know how something works, if there's a mysterious thing, the first instinct should not be like, let's hide it."}, {"time": 5922, "text": "Let's put it in the closet."}, {"time": 5924, "text": "So that the Chinese or the Russian government or whatever government doesn't find it."}, {"time": 5928, "text": "Maybe the first instinct should be, let's understand it."}, {"time": 5933, "text": "Perhaps let's understand it together."}, {"time": 5935, "text": "No, I think that's good."}, {"time": 5962, "text": "So there's this really interesting sort of dialogue there and making it open to the public that they actually have to think critically about it and they see the evidence for themselves, I think is really important for that process."}, {"time": 5973, "text": "Yeah, that aliens might be way weirder than we can imagine."}, {"time": 5979, "text": "Yes, I'm pretty sure they're probably weirder than we can imagine."}, {"time": 5984, "text": "Okay, we've in 2020 and still living through a pandemic, setting the political and all those kinds of things aside, I've always found viruses fascinating as dynamical systems, I was gonna say living systems, but I've always kind of thought of them as living, but that's a whole nother kind of discussion."}, {"time": 6009, "text": "Maybe it'd be great to put that on the table."}, {"time": 6013, "text": "One, do you find viruses beautiful slash terrifying?"}, {"time": 6017, "text": "And two, do you think they're living things or there's some aspect to them per our discussion of life that makes them living?"}, {"time": 6027, "text": "I mean, living in a pandemic saying viruses are beautiful is probably a hard thing, but I do find them beautiful to a degree."}, {"time": 6034, "text": "I think even in the sense of mediating a global pandemic, there's something like deeply intriguing there because these are tiny, tiny little things, right?"}, {"time": 6046, "text": "And yet they can essentially cause a seizure or handicap an entire civilization at a global scale."}, {"time": 6055, "text": "So just that intersection between our perceived invincibility and our susceptibility to things and also the interaction across scales of those things is just a really amazing feature of our world."}, {"time": 6069, "text": "Most technology, whether it's viruses or AI that can scale in an exponential way, like kind of run as opposed to like, one thing makes another thing makes another thing, it's one thing makes two things and those two things make four things."}, {"time": 6088, "text": "Like that kind of process also seems to be fundamental to life."}, {"time": 6095, "text": "And it's terrifying because in a matter of, in a very short time scale, it can, if it's good at being life, whatever that is, it can quickly overtake the other competing forms of life."}, {"time": 6113, "text": "And that's scary both for AI and for viruses."}, {"time": 6117, "text": "And it seems like understanding these processes that are underlying viruses."}, {"time": 6122, "text": "And I don't mean like on the virology or biology side, but on some kind of more computational physics perspective as we've been talking about, seems to be really important to figure out how humans can survive."}, {"time": 6140, "text": "Along with this kind of life and perhaps becoming a multi planetary species is a part of that."}, {"time": 6148, "text": "Like there's no, maybe like we'll figure out from a physics perspective is like, there's no way any living system can be stable for prolonged period of time and survive unless it expands exponentially throughout."}, {"time": 6163, "text": "Like we have to multiply."}, {"time": 6166, "text": "Otherwise anything that doesn't multiply exponentially will die eventually."}, {"time": 6170, "text": "Maybe that's a fundamental law."}, {"time": 6174, "text": "Maybe, I don't know."}, {"time": 6176, "text": "I always get really bothered by these Darwinian narratives that are like the fittest replicator wins and things."}, {"time": 6181, "text": "And I don't, I just don't feel like that's exactly what's going on."}, {"time": 6184, "text": "I think like the copying of information is sort of ancillary to this other process of creativity."}, {"time": 6190, "text": "Right, so like the drive is actually, the drive is creativity, but if you wanna keep the creativity that's existed in the past, it has to be copied into the future."}, {"time": 6199, "text": "So replication, like if you, so that for me is, so I had this set of arguments with Michael Lockman and Lee Cronin about the like life being about persistence."}, {"time": 6209, "text": "They thought it was about persistence and like survival of the fittest kind of thing."}, {"time": 6212, "text": "And I'm like, no, it's about existence."}, {"time": 6213, "text": "It's like, cause when you're talking about that, it's easy to say that in retrospect, you can post select on the things that survived and then say why they survived, but you can't do that going forward."}, {"time": 6226, "text": "That's really profound that survival is just a nice little side effect feature of maximizing creativity, but it doesn't need to be there."}, {"time": 6236, "text": "Yeah, I like that."}, {"time": 6236, "text": "That's really beautiful."}, {"time": 6238, "text": "Yeah, I know, like I said, I like optimistic theories."}, {"time": 6241, "text": "Well, I don't know if that's optimistic."}, {"time": 6243, "text": "That could be terrifying to people because, because a system that maximizes creativity may very quickly get rid of humans for some reason, if it comes up with some other creative, I mean, forms of existence, right?"}, {"time": 6260, "text": "This is the AI thing is like the moment you have an AI system that can flourish in the space of ideas or in some other space much more effectively than humans."}, {"time": 6273, "text": "And it's sufficiently integrated into the physical space to be able to modify the environment."}, {"time": 6279, "text": "I think we'll just be like the core genetic architecture or something."}, {"time": 6282, "text": "We'll be like the DNA for AI, right?"}, {"time": 6284, "text": "It's like, we haven't lost the past informational architectures on this planet."}, {"time": 6287, "text": "They're still there."}, {"time": 6289, "text": "Yeah, so the AI will use our brains in some part to like ride, like accelerate the exchange of ideas."}, {"time": 6298, "text": "That's the neural language dream is that, well, the humans will be still around because you're saying architecture."}, {"time": 6305, "text": "Yeah, but I don't even think they necessarily need to tap into our brains."}, {"time": 6308, "text": "I mean, just collectively, we do interesting things."}, {"time": 6310, "text": "What if they were just using like the patterns in our communication or something?"}, {"time": 6314, "text": "Oh, without controlling it, just observing?"}, {"time": 6319, "text": "In what sense do you control the chemistry happening in your body?"}, {"time": 6325, "text": "I mean, obviously I don't know."}, {"time": 6327, "text": "I'm just, like the way I look at, like people look at AI and then they look at this thing that's bigger than us and is coming in the future and is smarter than us."}, {"time": 6336, "text": "And I think though that looking at the past history of life on the planet and what information has been doing for the last 4 billion years is probably very informative to asking questions about what's coming next."}, {"time": 6347, "text": "And I don't, one is planetary scale transitions are really important for new phases."}, {"time": 6354, "text": "So the global internet and sort of global integration of our technology, I think is an important thing."}, {"time": 6358, "text": "So that's again, life is a planetary scale phenomenon but we're an integrated component of that phenomenon."}, {"time": 6363, "text": "I don't really see that the technology is gonna replace us in that way."}, {"time": 6367, "text": "It's just gonna keep scaffolding and building."}, {"time": 6369, "text": "And I also don't have an idea that we're gonna build AI in a box."}, {"time": 6372, "text": "I think AI is gonna emerge."}, {"time": 6374, "text": "AGI to me is a planetary scale phenomena that's gonna emerge from our technology."}, {"time": 6379, "text": "Planetary scale phenomena."}, {"time": 6382, "text": "But do you think an AGI is not distinct from humans?"}, {"time": 6386, "text": "The whole package."}, {"time": 6387, "text": "The whole package, yeah."}, {"time": 6388, "text": "Comes as a planetary scale phenomena."}, {"time": 6390, "text": "And that goes back to the fact that like, you were asking questions about you as an individual."}, {"time": 6394, "text": "Like, what are you as an individual?"}, {"time": 6396, "text": "You're like a packet of information that exists in the particular physical thing that is you."}, {"time": 6401, "text": "We're all just packets of information."}, {"time": 6403, "text": "And some of us are aggregates in certain ways but it's all just kind of exchanging and propagating, right?"}, {"time": 6408, "text": "And processing."}, {"time": 6409, "text": "Is your packet of information that you've continually referred to as Sarah afraid of the dissipation of the death of that packet?"}, {"time": 6423, "text": "Do you ponder death?"}, {"time": 6424, "text": "Does death have meaning in this process of creativity?"}, {"time": 6429, "text": "I think I have the natural biological urge that everyone has to fear death."}, {"time": 6435, "text": "I think the thing that I think is interesting is if I think about it rationally, I'm not necessarily afraid of death for me because I won't be aware of being dead."}, {"time": 6445, "text": "But I am afraid like for my kids because it matters to them if I die."}, {"time": 6449, "text": "So again, like I think death becomes more significant as a collective property, not as an individual one."}, {"time": 6457, "text": "Yeah, but isn't there something to fear about the fact that the way, like the creative, the complexity of information that's been like created in you."}, {"time": 6472, "text": "The fact that it kind of breaks apart and disappears."}, {"time": 6477, "text": "It doesn't, but I don't think it disappears."}, {"time": 6479, "text": "It's just not me anymore."}, {"time": 6480, "text": "Right, but that process of it being not you anymore, that doesn't scare you?"}, {"time": 6488, "text": "The mystery of it."}, {"time": 6489, "text": "I mean, the... Yeah, but I guess I'm heartened by the fact that there will be some imprints of the fact that I existed still in the universe after I leave it."}, {"time": 6496, "text": "Yeah, but there'll be a..."}, {"time": 6498, "text": "Okay, but... And also that has to do with my perception of time, right?"}, {"time": 6501, "text": "So, I perceive time as flowing, but that might not be the case."}, {"time": 6506, "text": "I mean, this is standard physicist comfort is, every moment exists and there's no... And the flow of time is just our perception of us changing."}, {"time": 6521, "text": "So, you can travel back in time and that's comforting?"}, {"time": 6523, "text": "Like from a physicist's concept?"}, {"time": 6525, "text": "I'm not talking about traveling back in time."}, {"time": 6526, "text": "I'm just saying that the moments in the past still exist."}, {"time": 6530, "text": "Now, whether the moments in the future exist or not is a different question."}, {"time": 6533, "text": "That's not comforting to me in terms of death."}, {"time": 6537, "text": "The flow of time is not..."}, {"time": 6538, "text": "I think there's no comfort in the face of death for what we are because we like existing."}, {"time": 6547, "text": "And I think it's especially true if you love life and you love what life is."}, {"time": 6553, "text": "Do you think there's a certain sense in which the fear of death or the fear of nonexistence, maybe fear is not the right word, is the actual very phenomena that gives birth to existence?"}, {"time": 6566, "text": "Like, death is fundamental."}, {"time": 6568, "text": "It just feels like freaking out, oh shit, this ride ends is actually like the... That's the thing that gives birth to this whole thing."}, {"time": 6581, "text": "That like, it's constantly..."}, {"time": 6585, "text": "It's matter constantly freaking out about the fact that it's gonna be the most."}, {"time": 6588, "text": "No, I think things like to exist."}, {"time": 6591, "text": "I think they wanna exist."}, {"time": 6591, "text": "Yeah, there's a desire, whatever, to exist."}, {"time": 6596, "text": "There's a drive to exist and there's a drive for more things to exist."}, {"time": 6600, "text": "I guess, yeah, I like existing."}, {"time": 6603, "text": "I like it a lot and I don't know it any other way."}, {"time": 6609, "text": "See, I don't even know if I like existing."}, {"time": 6611, "text": "I think I really don't like not existing."}, {"time": 6617, "text": "Yeah, maybe it's that."}, {"time": 6619, "text": "Some days I might like existing less than others."}, {"time": 6623, "text": "Yes, but like, I think those are like surface feelings."}, {"time": 6628, "text": "It seems like there's something fundamental about wanting to exist."}, {"time": 6631, "text": "No, I think that's right."}, {"time": 6632, "text": "But I think to your point that that might go back to the more fundamental idea that, you know, if life is the physics of existence and maximizing existence, individual organisms, of course, wanna maximize their existence and everything, you know, like wants to exist."}, {"time": 6648, "text": "But I guess for me, the small comfort is my existence matters to future existence."}, {"time": 6654, "text": "Speaking of future existence, is there advice you can give to future pockets of existences, AKA young people, about life?"}, {"time": 6664, "text": "You've had, you've worn many hats."}, {"time": 6667, "text": "You've taken on some of the biggest problems in the universe."}, {"time": 6670, "text": "Is there advice you can give to young people about life, about career, about existing?"}, {"time": 6677, "text": "Yeah, maybe not about the last one."}, {"time": 6680, "text": "You know, a lot of people ask me this question about like working on such hard problems, like how can you make a successful career out of that?"}, {"time": 6688, "text": "But I think for me, it couldn't be otherwise."}, {"time": 6691, "text": "Like I have to, to be fulfilled, you have to work on things you care about."}, {"time": 6695, "text": "And that's always kind of driven me."}, {"time": 6696, "text": "And that's been discipline, department, and sort of superficial level problem independent because I started at community college actually, and I was taking a physics class and I learned about magnetic monopoles and we didn't know if they existed in the universe, but we could predict them and we could go look for them."}, {"time": 6717, "text": "And I was so deeply intrigued by this idea that we had this mathematical formula to go look for things."}, {"time": 6722, "text": "And then I wanted to become a theoretical physicist because of that."}, {"time": 6725, "text": "But that actually wasn't my driving question."}, {"time": 6727, "text": "I realized my driving question is the nature of the correspondence between our minds and physical reality and what we are."}, {"time": 6734, "text": "And that question is very deep, so you can work across a lot of fields doing that."}, {"time": 6738, "text": "But I think without that driving question, I never would have been able to do all the things that I've done."}, {"time": 6743, "text": "It's really the passion that drives it."}, {"time": 6745, "text": "And usually when students ask me these kinds of questions, I tell them like, you have to find something you really care about working on because if you don't really care about it, A, you're not gonna be your best at it, and B, it's not gonna be worth your time."}, {"time": 6759, "text": "Why would you spend your time working on something you're not interested in?"}, {"time": 6763, "text": "So find the driving questions."}, {"time": 6764, "text": "Yeah, find the driving question."}, {"time": 6766, "text": "Find your passion."}, {"time": 6767, "text": "I mean, I think passion makes a huge difference in terms of creativity, talent, and potential, and also being able to tolerate all the hard things that come with any career or life."}, {"time": 6777, "text": "Yeah, I've had a bunch of moments in my life where I've just been captivated by some beautiful phenomena."}, {"time": 6783, "text": "And I guess being rigorous about it and asking what is the question underlying this phenomena, like robots bring a smile to my face and forming a question of like, why the hell is this so fascinating?"}, {"time": 6799, "text": "Why is this, specifically the human robot interaction question that something beautiful is brought to life when humans and robots interact, understanding that deeply."}, {"time": 6813, "text": "It's like, okay, so this is gonna be my life work then."}, {"time": 6816, "text": "I don't know what the hell it is, but that's what I wanna do."}, {"time": 6820, "text": "And doing that for whatever the hell gives you that kind of feeling, I guess, is the point."}, {"time": 6826, "text": "Am I allowed to ask you a question?"}, {"time": 6829, "text": "On that point, because I had this colleague that suggested the idea that consciousness might be contagious."}, {"time": 6836, "text": "And so interacting with things, it's an interesting idea, right?"}, {"time": 6841, "text": "So I'm wondering sort of the motivation there."}, {"time": 6844, "text": "Is it the motivation that you want more of the universe to appreciate things the way we do and appreciate those interactions?"}, {"time": 6852, "text": "Or is it really more the enjoyment of the human in those interactions?"}, {"time": 6856, "text": "Like, is it, do you know what I'm asking?"}, {"time": 6861, "text": "See, I think consciousness is created in the interaction between things."}, {"time": 6868, "text": "So the joy is in the creation of consciousness."}, {"time": 6872, "text": "I really like the idea that it doesn't just have to be two humans creating consciousness together."}, {"time": 6880, "text": "It could be humans and other entities."}, {"time": 6883, "text": "We talked offline about dogs and other pets and so on."}, {"time": 6886, "text": "There's a magic, I mean, I've been calling it love."}, {"time": 6889, "text": "It's this beauty of the human experience that's created."}, {"time": 6894, "text": "And it just feels like fascinating that you could do that with a robotic system."}, {"time": 6901, "text": "And there's something really powerful, at least to me, about engineering systems that allow you to create some of the magic of the human experience."}, {"time": 6912, "text": "Cause then you get to understand what it takes, at least get inklings of what it takes to create consciousness."}, {"time": 6921, "text": "And I don't get this, you know, philosophers get really upset about this idea that sort of the illusion of consciousness is consciousness."}, {"time": 6929, "text": "But I really liked the idea of engineering systems that fool you into thinking they're conscious."}, {"time": 6938, "text": "Because that's sufficient to create the magical experience."}, {"time": 6941, "text": "Right, because it's the interaction, yeah."}, {"time": 6943, "text": "It's the interaction, yeah."}, {"time": 6945, "text": "And this is the Russian hat I wear, which is like, I think there's an ocean of loneliness in the world."}, {"time": 6951, "text": "I think we're deeply lonely."}, {"time": 6953, "text": "We're not even allowing ourselves to acknowledge that."}, {"time": 6957, "text": "And I kind of think that's what love is between romantic love and friendship is two people kind of getting a little bit like alleviating for brief moment."}, {"time": 6971, "text": "That loneliness."}, {"time": 6972, "text": "That loneliness, but not, but we're not there."}, {"time": 6975, "text": "It's not the full aspect of that loneliness."}, {"time": 6977, "text": "Like we're desperately alone."}, {"time": 6979, "text": "We're desperately afraid of nonexisting."}, {"time": 6983, "text": "I have that kind of sense."}, {"time": 6984, "text": "And I just want to explore that ocean of loneliness more."}]}]