[{"title": "John Clarke: The Art of Fighting and the Pursuit of Excellence | Lex Fridman Podcast #143", "id": "RvhpncC5jZ8", "quotes": [{"time": 315, "text": "That's the way of life."}, {"time": 317, "text": "Somebody's waiting for you in St. Louis, and all of a sudden, you fell in love with a biker in New York."}, {"time": 324, "text": "I don't know what you're up to."}, {"time": 325, "text": "I can appreciate that, but on a trip like that, I feel like a trip with deadlines is for a different point in your life, and at this point in my life, I don't want any of the deadlines because it's not about meeting someone and disappointing them in St. Louis."}, {"time": 341, "text": "It's about me not disappointing myself."}, {"time": 345, "text": "You wanna have enough time in what you're doing to make sure that you get the full breadth of every experience that you encounter."}, {"time": 352, "text": "How would you fully experience a place?"}, {"time": 355, "text": "How would you?"}, {"time": 356, "text": "I don't think I've actually fully experienced Boston."}, {"time": 359, "text": "If you were showing up to a city for a week on this road trip, what would you do?"}, {"time": 364, "text": "So I'm gonna answer that in two parts."}, {"time": 366, "text": "A few years ago, I had an opportunity to move out of Boston, and the thing that kept me here, no question about it, was the fact that I felt like I had a contract with my students, and I did not."}, {"time": 378, "text": "I felt like a great many of them took a leap of faith by joining my gym and asking me to teach them what I know, and when I had an opportunity to leave Boston, I thought of those people, and I thought, I wanna fulfill my obligation to them."}, {"time": 393, "text": "So because I made a decision to stay here, I then that summer made a decision to endear myself to the city of Boston, and I tried to find lots and lots of different things to do."}, {"time": 402, "text": "I can tell you that the coolest thing that I found to do in this city is the MFA, where they have on Friday nights, they'll have different exhibits and stuff, and they'll have little beer carts and food tents, and you can go do a painting class off on the side."}, {"time": 419, "text": "Very cool night of things to do."}, {"time": 421, "text": "But in general, whenever I'm in a new city, I try not to pay attention to Google, and I try not to do anything that I find on a travel site."}, {"time": 430, "text": "The best thing to do is to walk out of your hotel or wherever it is you're staying and find the most normal looking bar, have a drink, and talk to a bartender."}, {"time": 439, "text": "So the people, the people."}, {"time": 441, "text": "The people, and then you can experience that town the way that they experience it."}, {"time": 445, "text": "Even in a city where there are tons of tourist attractions, locals probably visit the same tourist attractions when they have visitors come from out of town, you wanna see how they view those places and how they visit them."}, {"time": 458, "text": "And you wanna go to eat where they're going to eat."}, {"time": 460, "text": "Like, you're gonna, for the most part, the North End is not a place where I would take someone and say, hey, this is Boston's, the pinnacle of Boston dining, because it's very touristy."}, {"time": 472, "text": "There are a handful of really good restaurants there, but I wanna know where the, I wanna go to Bogie's Place."}, {"time": 477, "text": "I wanna know the down low spots where."}, {"time": 480, "text": "The hell's Bogie's Place?"}, {"time": 481, "text": "It's like a little steakhouse in the back of J.M."}, {"time": 481, "text": "Curly's."}, {"time": 484, "text": "It's like a shitty bar?"}, {"time": 486, "text": "J.M."}, {"time": 486, "text": "Curly's?"}, {"time": 486, "text": "No, it's just a bar with like bar food."}, {"time": 489, "text": "But I think that like."}, {"time": 491, "text": "In South Boston?"}, {"time": 492, "text": "It is in Boston, yeah."}, {"time": 493, "text": "It's not South Boston?"}, {"time": 494, "text": "No, it's in, it's in the downtown area."}, {"time": 498, "text": "Like, I don't know what the neighborhoods are called here, honestly, because they have an area called Downtown Boston, and I don't even know what the hell that means."}, {"time": 507, "text": "And they used to have the Financial District."}, {"time": 508, "text": "Where's Southie?"}, {"time": 509, "text": "Cause I've heard about the Southie."}, {"time": 511, "text": "Southie is South Boston."}, {"time": 513, "text": "But is there a difference between South Boston and Southie?"}, {"time": 516, "text": "No, it's the same thing."}, {"time": 517, "text": "No, but like, you know, the mythical Southie."}, {"time": 519, "text": "I think the mythical Southie is something that's long gone now."}, {"time": 524, "text": "And the term now actually is Sobo."}, {"time": 530, "text": "It's changed, what, who took over what?"}, {"time": 532, "text": "What's the, you know, the good will hunting personality."}, {"time": 535, "text": "That's Southie, isn't it?"}, {"time": 536, "text": "Strong accent, those bad ass dudes."}, {"time": 538, "text": "I came here right at the end of like, what was South Boston."}, {"time": 542, "text": "So when I got, and my gym is in South Boston, the neighborhood was just starting to change."}, {"time": 547, "text": "So I think, as gentrification happened and they started building more luxury condominiums, they were buying all these old businesses out, all the mom and pop businesses."}, {"time": 559, "text": "And I think that kind of changed the makeup of the community."}, {"time": 565, "text": "And it wasn't only because there was an influx of new young people with disposable income, it's because there's an exodus of the older people who kind of grew up and raised their families there because they were being offered humongous sums of money for their homes that they had bought like in the late 70s and early 80s so that they could develop those areas."}, {"time": 583, "text": "So you have a combination of the influx of new people and the exodus of the old, and now you just got this totally new neighborhood in its place."}, {"time": 592, "text": "What do you love about Boston?"}, {"time": 593, "text": "Is there a love still for Boston?"}, {"time": 598, "text": "You certainly have the love of the thing that's gone as well."}, {"time": 601, "text": "Yeah, I think, I don't wanna pinpoint pin this on Boston because it's happening in all great cities."}, {"time": 608, "text": "As these areas become gentrified, what's happening is the personality and the character of the neighborhood is just being run out."}, {"time": 614, "text": "And I have nothing against people coming in and making money and things like that."}, {"time": 618, "text": "But when you do it at the expense of the culture, the character and the personality of the neighborhood, I mean, you're kind of standing on the shoulders of giants."}, {"time": 627, "text": "These are the people that came here and built these areas up."}, {"time": 630, "text": "It happens here in Boston, it happens in all over New York, happens on the West Coast."}, {"time": 636, "text": "So what I love about Boston is not nearly as romantic as what it might've been 15 years ago and what I used to love about New York."}, {"time": 645, "text": "What I love about Boston is that it's walkable."}, {"time": 651, "text": "The food scene is on the rise here."}, {"time": 655, "text": "But I think you're hard pressed to find the charm that people think of when they think of old Boston and old New England city."}, {"time": 664, "text": "So yeah, I see it differently."}, {"time": 665, "text": "People sometimes criticize like MIT like for the thing that it is now."}, {"time": 671, "text": "But I think it is always like that."}, {"time": 673, "text": "I tend to prefer to carry the flame of the greatness, the greatest moments of its history and like sort of enjoy the echoes of that in the halls of MIT."}, {"time": 687, "text": "In the same way in Boston, you think about the history and that history lives on in the few individuals."}, {"time": 693, "text": "Like you can't just look around what Boston is now and be like, what has Boston become?"}, {"time": 698, "text": "I think it was always carried by a minority of individuals."}, {"time": 703, "text": "I think we kind of look back in history and think like times were greater in a certain kind of dimension back then."}, {"time": 710, "text": "But that's because we remember, this is a ridiculous non data driven assertion of mine, is to remember just the brightest stars of that history."}, {"time": 722, "text": "And so we romanticize it."}, {"time": 724, "text": "But I think if you look around now, those special people are still living in Boston for which Boston will be remembered as a great city in like 50 years."}, {"time": 731, "text": "I think you're probably right, but isn't there some sort of theory about the point that there's like a certain age in your life where things resonate differently to you?"}, {"time": 742, "text": "Like, I think they've done studies where most people stop searching for new music after age 19."}, {"time": 748, "text": "Most dads you see like wearing super old clothes, like that's the style of the time period of the last great part of their life."}, {"time": 755, "text": "So like there's an evolution in people and it could also be the memories of where they live."}, {"time": 761, "text": "And when I was 17, of course my neighborhood was the best then because I was having the most fun."}, {"time": 766, "text": "And we always kind of look at things through that tint, I think, and you're right."}, {"time": 771, "text": "And I don't think there's anything wrong with the way cities are evolving now."}, {"time": 775, "text": "It's just not, I prefer the time of like a mom and pop store, not a fabricated like gastropub that could just be like on a four lane super highway on your way out of Epcot Center."}, {"time": 790, "text": "And it's actually owned by like some conglomerate."}, {"time": 793, "text": "But there's still the special places."}, {"time": 795, "text": "Like I, this takes us back to the road trip is maybe I tend to romanticize the experiences of like the diners in the middle of nowhere."}, {"time": 805, "text": "What would you say makes for like, it feels like life is made up of these experiences that maybe on paper seem mundane, but are actually somehow give you a chance to pause and reflect on life with like a certain kind of people, whether like really close friends or complete strangers, maybe alcohol is involved in the middle of nowhere."}, {"time": 830, "text": "It seems like a road trip facilitates that if you allow it to."}, {"time": 834, "text": "Like what do you think makes for those kinds of experience?"}, {"time": 836, "text": "Have you had any?"}, {"time": 837, "text": "I think in the context of a road trip, I think it's like hyper localization."}, {"time": 842, "text": "And I think it is those experiences along the way with people and the people that you're with will color the experiences differently depending on the person."}, {"time": 857, "text": "The road trip you took was with somebody else or alone?"}, {"time": 860, "text": "So I've driven up and down the East Coast several times."}, {"time": 863, "text": "When I drove from LA to New York, my friend was on the run from the cops."}, {"time": 870, "text": "So we were trying to get out of."}, {"time": 872, "text": "Traffic tickets?"}, {"time": 873, "text": "Yeah, traffic tickets."}, {"time": 874, "text": "Yeah, allegedly."}, {"time": 875, "text": "We were trying to get out of LA because he was going to have to go away for a little while."}, {"time": 880, "text": "So we drove from LA and we just, we were young kids, we had no idea what we were doing, and we drove East."}, {"time": 886, "text": "And then we had an unbelievable trip, mostly because we didn't really have a destination, we didn't really have a timeframe, thank goodness, because he got arrested again in Pennsylvania."}, {"time": 897, "text": "So we got kind of stuck there."}, {"time": 899, "text": "And then we drove back to LA when he got out in Pennsylvania."}, {"time": 905, "text": "But all the stops along the way were kind of like weird things, like you have no money, right?"}, {"time": 911, "text": "So you're finding that like a little diamond in the rough place to eat, the diner you talk about, like that place."}, {"time": 918, "text": "I once was in, where was I?"}, {"time": 920, "text": "I think I was in Buenos Aires."}, {"time": 922, "text": "And the guy that I was with, he said, I know this quaint little spot around the corner."}, {"time": 926, "text": "And I was young, I was like 25."}, {"time": 928, "text": "And I thought the coolest thing in the world would be to be such a citizen of the world that you know these quaint little spots around the corner in like all these great cities."}, {"time": 938, "text": "Like I know where to get this great chicken sandwich in Argentina."}, {"time": 941, "text": "I know where to get this great meal in Costa Rica."}, {"time": 944, "text": "I know where to get this super local egg in another country."}, {"time": 948, "text": "And I just thought that that was really cool, the ability to do that anywhere in the world."}, {"time": 952, "text": "Did you get closer with that guy through the trip?"}, {"time": 955, "text": "I found that like, so I took a trip across the United States with a guy friend of mine."}, {"time": 961, "text": "We had different goals."}, {"time": 962, "text": "I was searching for meaning in life and he was searching for, what's the politically correct way of phrasing it, but just basically trying to sleep with every kind of woman that this world has to offer."}, {"time": 977, "text": "Well, I guess he was searching for the different kinds of meanings."}, {"time": 980, "text": "Yeah, I mean, I still think that you can't find meaning between a woman's legs, I suppose."}, {"time": 988, "text": "Have you tried all of them?"}, {"time": 991, "text": "But there was a tension there."}, {"time": 994, "text": "We grew closer with those experiences, but we've gotten in fights."}, {"time": 999, "text": "There was a lot of like literal almost fights and then we were close and there was like silences, but then we were like brothers and this whole weird journey of friendship that we went on."}, {"time": 1009, "text": "I think anytime you spend that much time in like a small space with another person, you're gonna have the different parts of the relationship will manifest themselves."}, {"time": 1019, "text": "You'll have the periods of closeness."}, {"time": 1020, "text": "You'll have the periods of vulnerability where it's like maybe you're driving through Denver and it's three in the morning and you talk about something you might not have otherwise talked about."}, {"time": 1028, "text": "You'll have the periods where you don't wanna see that motherfucker ever again."}, {"time": 1032, "text": "He didn't, and depending could be because of anything."}, {"time": 1036, "text": "But the guy that I drove twice with, we're still in contact, we're still buddies."}, {"time": 1044, "text": "We have very different goals also, but at that point in our lives, we never even contemplated the meaning of life."}, {"time": 1051, "text": "We were about probably more to the point of the friend that you drove with."}, {"time": 1055, "text": "We were more about racking up experiences, whatever they were."}, {"time": 1060, "text": "I wanna be able to retell this."}, {"time": 1062, "text": "Stories."}, {"time": 1063, "text": "Yeah, I wanna be able to retell this and it's gotta sound cool."}, {"time": 1067, "text": "Like I don't wanna retell a story about, yeah and then we drove through Alabama and they've got a lovely library and I checked out this book and I'm not interested in retelling that."}, {"time": 1074, "text": "Do you remember any, this is a kid's show, do you remember any stories that the kids would enjoy from those times that were profound in some kind of way?"}, {"time": 1085, "text": "There were some impactful moments on the beginning of our road trip where we had no money and as a couple of kids who knew nothing, we literally had to, we stopped in Vegas and we went to Circus Circus."}, {"time": 1097, "text": "At the time they had $3 blackjack and we had like 12 bucks and my buddy was a kind of a degenerate gambler so he knew what was up."}, {"time": 1103, "text": "I was just like kind of stuffing chips in my pockets, making sure we could pay for the gas."}, {"time": 1108, "text": "And just being at a point which is like a starting line and like we drove from LA to Vegas, which is only about four hours and being at the starting line and realizing like, we may not even like get off the starting line here."}, {"time": 1121, "text": "And if we don't, what are we doing?"}, {"time": 1122, "text": "We're gonna be two guys stuck in Vegas."}, {"time": 1124, "text": "We have no money."}, {"time": 1125, "text": "We can't go West because you're gonna get pinched."}, {"time": 1127, "text": "We have no money to go East."}, {"time": 1128, "text": "What the hell are we gonna do?"}, {"time": 1129, "text": "Are we gonna wind up in Vegas?"}, {"time": 1131, "text": "So, you know, that was kind of a profound thing where you just, it's a turning, it potentially could have been a turning point in our lives had we not made enough money to continue going East."}, {"time": 1143, "text": "That's the beautiful thing about road trips when you're broke is like, in retrospect, everything turned out fine, but you're facing the complete darkness, the uncertainty of the possibilities laid before you."}, {"time": 1156, "text": "And like, I don't know if you were confident at that time, but like, I was really full of self doubt."}, {"time": 1163, "text": "Like just, all I could see is all the trajectories where you just screw up your life."}, {"time": 1168, "text": "Like, what am I doing with my life?"}, {"time": 1169, "text": "I'm a failure, like all these dreams I've had, I've never realized I'm a complete piece of shit."}, {"time": 1175, "text": "I had no concept of consequence."}, {"time": 1178, "text": "I probably had toxoplasmosis."}, {"time": 1182, "text": "I had literally no concept of consequence."}, {"time": 1185, "text": "Immediate gratification was all I cared about."}, {"time": 1187, "text": "Oh, so existentialist."}, {"time": 1188, "text": "Yeah, it did not even enter my mind in my like early 20s that anything that I was doing at that point could reverberate for the rest of my life."}, {"time": 1199, "text": "I think part of me didn't even think I'd make it this far."}, {"time": 1202, "text": "And so I was not interested in like the long play."}, {"time": 1205, "text": "I remember thinking like, why should I be acting now in a way that might impact a point in my life I never reach?"}, {"time": 1212, "text": "And yet now you are a man who searches for meaning in life, at least I would say to put another way, you think deeply about this world and in a philosophical context while also appreciating the violence of hurting other friends of yours, right?"}, {"time": 1235, "text": "On a regular basis."}, {"time": 1236, "text": "So why do you think, I mean, maybe there's a broader question there, but it calls a personal question."}, {"time": 1242, "text": "It seems that people who fight for prolonged periods of time, like Jiu Jitsu people and mixed martial arts people, even military folks become over time philosophers."}, {"time": 1258, "text": "Is that, is there a parallel between fighting and violence and the philosophical depth with which you now have arrived from the starting point of being the full existentialist of like just living in the moment to like being introspective human now?"}, {"time": 1274, "text": "I would say to that being a soldier or a warrior hundreds of years ago is probably what started the marriage between martial arts and philosophy."}, {"time": 1288, "text": "If you're constantly under someone else's charge and you're told to go out and walk in a line and overtake some Germanic tribe somewhere and that happens all the time, your job is being a soldier."}, {"time": 1303, "text": "On any given day, you might not come home."}, {"time": 1306, "text": "So I think that you have to start your day by thinking deeply about how you've lived to that point and the people that are living in and around you and how you've treated them."}, {"time": 1315, "text": "And I think that probably is what started the marriage of being kind of like a philosophical martial artist."}, {"time": 1322, "text": "You've got to really like on a daily basis, take stock of what's going on around you and inside you because we all suffer with this kind of idea."}, {"time": 1333, "text": "If today's my last day, did I do it right?"}, {"time": 1336, "text": "And we don't really do it so much nowadays because we're so comfortable, but if we were being marched out to war every day, I think you'd see people live a little bit differently."}, {"time": 1346, "text": "And you treat the people around you a little bit differently."}, {"time": 1349, "text": "Do you think there's echoes of that in just even the sport of like grappling and Jiu Jitsu where you're facing your own mortality?"}, {"time": 1357, "text": "We don't really think of it that way, but."}, {"time": 1359, "text": "To be honest, I think that a lot of people that train in a martial art in contemporary society, I don't consider them all martial artists."}, {"time": 1368, "text": "I think just because you train in martial art does not mean you're a martial artist."}, {"time": 1371, "text": "There are so many people that use martial arts as a form of exercise and like this little piece of self concept."}, {"time": 1380, "text": "They use martial arts as a tagline in their Instagram bio."}, {"time": 1384, "text": "And it's really a form of exercise."}, {"time": 1386, "text": "It's something they do, it's not something they are."}, {"time": 1389, "text": "And I think there's a big difference there."}, {"time": 1391, "text": "There's a bunch of stuff mixed up in there because the Instagram thing is something you do for, it's also, it could be something you are for display versus who you are in the private moments of searching and thinking and struggling and all that kind of stuff."}, {"time": 1407, "text": "Instagram is a surface layer that much of modern society operates in, which is really problematic because there's that gap between the person you show to the world and the person you are in private life."}, {"time": 1422, "text": "And if you make majority of your project of the human project of your sort of few years on this earth, the optimization of the public Instagram profile, then you never develop this private person."}, {"time": 1436, "text": "But it does seem that if you do jiu jitsu long enough, it's very difficult not to fall into like, this has become a personal journey, an intellectual journey."}, {"time": 1446, "text": "Because like, if you get your ass kicked thousands of times, there's a certain point to where that, maybe it's like a defense mechanism, but that turns into some kind of deeply profound introspective experience versus like exercise."}, {"time": 1460, "text": "It's not yoga."}, {"time": 1461, "text": "Yeah, so let me go back first and address the Instagram point, which I think there's a difference between people whose Instagram is intrinsically tied to their profession and they have to put a specific profile out there."}, {"time": 1475, "text": "And I think in general, people who truthfully their business is tied to their Instagram profile, I wanna exclude them."}, {"time": 1485, "text": "I think that most people, Instagram is how they want to be seen."}, {"time": 1490, "text": "And that's not always congruent with who you are, but I think there is a level of dishonesty there."}, {"time": 1498, "text": "Like this is how I want people to see me."}, {"time": 1500, "text": "I'm gonna put all this stuff in my Instagram bio, but that's really not me."}, {"time": 1505, "text": "And when you do that, I think it's a little disingenuous and you're right."}, {"time": 1511, "text": "There's not, you're never really gonna marry those two things together and it gets tough."}, {"time": 1515, "text": "Let me, sorry to interrupt, let me push back on something."}, {"time": 1518, "text": "This is a good time to address the many flaws of the great and powerful John Clark."}, {"time": 1525, "text": "Okay, let's go there."}, {"time": 1529, "text": "Cause it's interesting."}, {"time": 1531, "text": "You strive so hard for excellence in your life and for extreme competence that you are visibly and physically off put by people who have not achieved competence."}, {"time": 1546, "text": "Do you think we should be nicer to the people who are, like you mentioned, a person who first picks up an art, picks up, becomes vegan, starts doing CrossFit, start doing Jiu Jitsu for the first time and create that as their, they're struggling through this like, who am I?"}, {"time": 1567, "text": "And they're really overly proud and it's kind of ridiculous."}, {"time": 1571, "text": "And you and your wise chair have seen many battles."}, {"time": 1575, "text": "Yeah, that you see the ridiculousness of that."}, {"time": 1579, "text": "I tend to, I'm learning to give those folks, not to mock them and to sort of give them a chance to do their ridiculousness because I think I was that too."}, {"time": 1592, "text": "Let me first clarify."}, {"time": 1594, "text": "I wanna be clear about what you mean when you say a level of competence."}, {"time": 1598, "text": "Now I've never won a world championship."}, {"time": 1601, "text": "I've never, you know, there are plenty of things in my life where I've not achieved what most people would consider to be the penultimate level of success."}, {"time": 1614, "text": "That's accomplishments."}, {"time": 1616, "text": "It's accomplishments, it's ribbons, it's things like that."}, {"time": 1618, "text": "And it's not that those things don't mean anything to me."}, {"time": 1620, "text": "And the fact that I haven't in some arenas is something that I wanna change, which is, we can talk about that in a second."}, {"time": 1629, "text": "But I think that there's a difference between the very eager noob of whatever it is they're doing who does the thing so that they can signal they do the thing."}, {"time": 1644, "text": "That's a person I have less respect for."}, {"time": 1646, "text": "So we know each other primarily through jujitsu."}, {"time": 1649, "text": "Look at a jujitsu tournament."}, {"time": 1652, "text": "There's this idea that people espouse online."}, {"time": 1657, "text": "I respect anyone with the guts to get on the mat and put it on the line and sign up for a tournament."}, {"time": 1663, "text": "That is the biggest load of shit I have ever heard."}, {"time": 1668, "text": "Do you know how easy it is for you to put your name on something and pay the registration fee and walk in there?"}, {"time": 1674, "text": "That's not the hard part."}, {"time": 1675, "text": "That's the easiest part."}, {"time": 1677, "text": "I don't care if you lose your first match, but I respect the person who signs up for the tournament, registers for the tournament, goes on a diet, loses weight the right way, trains their ass off, and does the things properly and then goes on the mat."}, {"time": 1690, "text": "The person who simply signs their name on the registration form and jumps on the mat, if they haven't done these other things, they actually have nothing to lose."}, {"time": 1699, "text": "Because what they've done is they've stepped onto the mat, in the ring, in the cage with a bucket full of excuses."}, {"time": 1705, "text": "Sure you signed up, but you're not really vulnerable because you didn't run, you didn't do this, you didn't do all the things you're supposed to do."}, {"time": 1713, "text": "The person who eliminates every possible excuse and then steps on the mat and gets their ass kicked in the first round, I have so much more respect for that person than the person who does nothing and maybe on natural ability wins a couple of matches and then writes on Facebook on how I lost to the eventual champion."}, {"time": 1734, "text": "That's worth zero, that's worth zero."}, {"time": 1736, "text": "And in that process, what did you learn about yourself?"}, {"time": 1738, "text": "You learned about yourself that you've got a natural level of aptitude for whatever this activity is that you're doing, but you didn't actually learn how to maximize it through training and through dedication and through all these other things."}, {"time": 1752, "text": "I'm an incredibly interested, novice musician."}, {"time": 1757, "text": "I like to play bass, but I don't put that on anything."}, {"time": 1760, "text": "And I stink at it."}, {"time": 1762, "text": "I would really love to be sick at it."}, {"time": 1764, "text": "I'm currently not, but I'm not running around, talking about entering, any of those other things."}, {"time": 1771, "text": "I do it, it's for myself and I wanna reach a level of competence in that."}, {"time": 1777, "text": "So the person that you have respect for is a person who takes it fully seriously, takes the effort fully seriously."}, {"time": 1787, "text": "So for bass, that would be that you agree with yourself that you're going to perform live and just in your own private moments, your private thoughts, you're not going to give yourself an excuse out, like, I'm just gonna have fun."}, {"time": 1799, "text": "This is a nice experience."}, {"time": 1800, "text": "You're going to think I'm going to try to be the best possible bass player given everything that's going on in my life, but I'm going to do my, like actually, and put it all on the line."}, {"time": 1811, "text": "And if I fail, that's not because I didn't try, it's because I'm a failure."}, {"time": 1819, "text": "And then sit in that sick feeling of like, I'm a failure."}, {"time": 1824, "text": "But isn't that an important thing to know?"}, {"time": 1827, "text": "But there's a, that's like the best thing it could be, but sometimes it's fun to lose yourself in the bragging, in the lesser ways of life."}, {"time": 1842, "text": "And I think I'm careful not to, because too many people in my life, when I brought them with like a little candle of a fire of a dream, they would just go like, they would just blow that fire out, that they would dismiss me."}, {"time": 1860, "text": "Cause they see like, I would say, I've said a lot of ridiculous stuff, but I've always dreamed about like putting, I always dreamed of having this world full of robots."}, {"time": 1875, "text": "And every time I would bring these ideas up, they'll be shut down by the different people, by my parents, by, then you need to first get an education."}, {"time": 1888, "text": "You need to succeed in these dimensions."}, {"time": 1890, "text": "In order to do all these things, you have to get good grades."}, {"time": 1893, "text": "You have to blah, blah, blah, blah, blah."}, {"time": 1894, "text": "Like there's all this stuff that it's indirect or direct ways of blowing out that little ridiculous dream that you present."}, {"time": 1903, "text": "And it's like, I remember sort of bringing up, I don't know, things like becoming a state champion in wrestling, right?"}, {"time": 1916, "text": "It's a weird dance because of course the coaches will tell, they'll kind of dismiss that."}, {"time": 1922, "text": "It's like, okay, okay."}, {"time": 1924, "text": "But at the same time, it feels like in those early days, you have to preserve that little fire."}, {"time": 1930, "text": "Johnny Ive, I don't know if you know who that is, is a designer at Apple."}, {"time": 1933, "text": "He was a chief designer."}, {"time": 1934, "text": "He's behind most of the iPhone, all that stuff."}, {"time": 1937, "text": "And he always talked about that he wouldn't bring his ideas to Steve Jobs until they were matured because he would always shit on them."}, {"time": 1945, "text": "He wanted them to as little babies live for a little bit before they get completely shut down."}, {"time": 1951, "text": "And I always think about that when I see a beginner sort of bragging on Instagram, you have to be careful."}, {"time": 1957, "text": "Let them play with that little dream."}, {"time": 1960, "text": "Are you playing with a little dream that you're nurturing and you're trying to take that little flame and you're trying to create a roaring blaze with it?"}, {"time": 1968, "text": "Or are you playing with the idea of it and behind that there's no substance?"}, {"time": 1974, "text": "It's hard to know the difference."}, {"time": 1975, "text": "That's what I struggle with."}, {"time": 1976, "text": "I don't think it necessarily is."}, {"time": 1978, "text": "Certainly you're wrong."}, {"time": 1979, "text": "And when I say Instagram, I don't wanna impugn a bunch of strangers, but I have a gym with a lot of members."}, {"time": 1985, "text": "And I can tell you that the number of years I've been in the gym, when someone comes to me and says, this is my goal, I don't tell them yes or no in general, but I know."}, {"time": 1995, "text": "I can tell by the way they say it to me, I can thin slice it."}, {"time": 1998, "text": "I've seen the look on people's faces."}, {"time": 2000, "text": "And when people start to say they wanna do X, Y, and Z, I know right off the bat, this person's either gonna put an effort in or they're not going to put an effort in."}, {"time": 2009, "text": "So to me, it's about the effort behind that."}, {"time": 2013, "text": "If you're busting your ass and you're a new at something and you're brand new, but you're working really hard and you have a series of like moderate successes in that, like that's the guy I wanna champion because that persistence and that grit over time, those successes will no longer be moderate."}, {"time": 2029, "text": "They'll be huge."}, {"time": 2031, "text": "But the person who's having moderate success by doing nothing, chances are they'll never learn to put that work in and the successes will never grow."}, {"time": 2038, "text": "You have an admiration for Mike Tyson."}, {"time": 2041, "text": "I love him."}, {"time": 2043, "text": "I'm just gonna let that sit for a brief moment."}, {"time": 2049, "text": "I think there's a combination of factors."}, {"time": 2050, "text": "One is like the timeliness of his career and like the age I was when he like came to prominence, the raw, brutal violence and the raw, brutal honesty when he speaks."}, {"time": 2066, "text": "I think it's easy for people to hear him or see his life and cast him aside as some simianesque, like just cretin scourge on society."}, {"time": 2076, "text": "But when you hear him speak, like this is not a guy who's unintelligent."}, {"time": 2080, "text": "This is a guy who knows himself better than probably most of us know ourselves."}, {"time": 2084, "text": "It's disarming and that's a humongous part of my admiration for him."}, {"time": 2092, "text": "Who is Mike Tyson?"}, {"time": 2094, "text": "Because it feels like there's similarities between him and you."}, {"time": 2099, "text": "It feels like there's a violent person in there, but also a really kind person."}, {"time": 2104, "text": "And they're all like living together in a little house."}, {"time": 2107, "text": "And you're the same."}, {"time": 2108, "text": "There's a thoughtful person, but there's also a scary, violent person."}, {"time": 2112, "text": "And they're like having a picnic."}, {"time": 2114, "text": "They're having a picnic."}, {"time": 2116, "text": "I think there are dialectical tensions in everyone, these like opposing forces that are constantly pulling at you and at different points in your life, like it's sliding scale."}, {"time": 2126, "text": "And I think that certainly when I was a younger person, that there was a lot more manifestation of the violence and a lot less of the kindness."}, {"time": 2138, "text": "People who were not as close to me probably saw more of the violent side and only the very close people to me saw like what would pass for the kind side."}, {"time": 2146, "text": "And now that's sliding in the other direction."}, {"time": 2149, "text": "And I worry actually sometimes that there could be a situation where I need that old version of me and he's getting further and further away and I can't call him up if I need him."}, {"time": 2161, "text": "And that concerns me to a certain degree."}, {"time": 2167, "text": "The sad aging warrior seeing his greater self fade away."}, {"time": 2172, "text": "But you still compete."}, {"time": 2173, "text": "Does that person return?"}, {"time": 2175, "text": "It seems like for Mike Tyson, that person returned at the prospect of competition."}, {"time": 2180, "text": "It returns, but I've learned better how to manifest it in competition in terms of like the effects that that type of emotion has on you physically in the middle of a competition."}, {"time": 2191, "text": "So I've better learned how to utilize that energy."}, {"time": 2194, "text": "But I think another side effect of this is like having a gym where you're a bigger guy and you're the head instructor, you can't be as mean and violent as you once were because you're also not trying to run a business."}, {"time": 2206, "text": "And you spend so many years trying not to be mean and to soften your technique a little bit that that all of a sudden just becomes who you are."}, {"time": 2216, "text": "And I don't necessarily like that."}, {"time": 2218, "text": "So I've been trying to reclaim that a little bit on the mat, but I think in competition, there has to be an athlete really wants to score the points."}, {"time": 2235, "text": "A fighter really wants to incapacitate you and put you in a position where they can do their own bidding."}, {"time": 2241, "text": "And the result in a jujitsu match might just still be two points, but the motivations are very, very different."}, {"time": 2248, "text": "What do you make of Tyson on Joe Rogan saying that he was aroused by violence?"}, {"time": 2252, "text": "Do you think that's insane?"}, {"time": 2254, "text": "Do you think that's deeply honest for him?"}, {"time": 2256, "text": "And do you think that rings true for many of us, others who practices in different degrees?"}, {"time": 2263, "text": "I can't speak for a lot of people."}, {"time": 2265, "text": "And I think that it was a brutally honest statement by him."}, {"time": 2268, "text": "And I think it's something that even if a lot of people feel it, they're not that comfortable admitting it or saying it."}, {"time": 2275, "text": "But I think there's great joy in landing a flush right hand on someone's jaw and then watching them crumble."}, {"time": 2287, "text": "You don't even feel it."}, {"time": 2288, "text": "You ever played baseball as a kid?"}, {"time": 2290, "text": "You can hit a base hit off the end of the bat and it will sting your hands because of the way that you hit it."}, {"time": 2295, "text": "You can hit a home run and you won't feel anything."}, {"time": 2298, "text": "It just feels so good in your hands."}, {"time": 2299, "text": "And that's, I think, one of the joys of physical contact."}, {"time": 2305, "text": "When you do it the right way, and that goes for all physical contact."}, {"time": 2309, "text": "When you do it the right way, the physical pleasure you can derive from it and the mental pleasure, it's unparalleled."}, {"time": 2318, "text": "See, but that's different."}, {"time": 2319, "text": "Let me draw a distinction."}, {"time": 2320, "text": "I'm not, I've had the fortune of being a wrestler."}, {"time": 2327, "text": "And I would draw a distinction between a very well executed in competition, double leg, single leg take down or a pin."}, {"time": 2337, "text": "There's some, as an OCD person, there's something so comforting about a well executed pin because it's like two seconds and it's just like everything is flush and nice."}, {"time": 2347, "text": "And like, it's all clean."}, {"time": 2349, "text": "I mean, okay, this OCD person who likes to align show, it's just beautiful."}, {"time": 2354, "text": "Okay, that's good technique."}, {"time": 2356, "text": "And wrestling also provides you, maybe more than other sports, the feeling of dominating another human."}, {"time": 2366, "text": "Of breaking, no, not just of them being very cocky and very powerful, you feel this power of another human being and then you breaking them."}, {"time": 2377, "text": "And like, I'm not as honest as Mike Tyson."}, {"time": 2382, "text": "But that, I don't think I've ever sort of looked in the mirror and said like, that that was, I enjoyed that aspect of it."}, {"time": 2393, "text": "But it certainly seems like you chase that."}, {"time": 2396, "text": "So when I was a wrestler in high school, I lost so many matches because of over aggressiveness."}, {"time": 2405, "text": "Like, I would pick the top position and let you stand just so that I could do a mat return."}, {"time": 2410, "text": "And I wasn't trying to return you to the mat."}, {"time": 2412, "text": "I was actually trying to like drive you through the mat and through the ground."}, {"time": 2416, "text": "Like I took, like, it gave me joy to do that."}, {"time": 2420, "text": "Like, it wasn't like I was trying to, you know, just return you to the mat so that I could pin you."}, {"time": 2425, "text": "That what you just talked about, like the dominating another person, I used to look at that as you've got someone who in theory is equally trained and equally skilled as you are."}, {"time": 2434, "text": "And you're absolutely out there totally dominating them."}, {"time": 2438, "text": "There's joy in that."}, {"time": 2439, "text": "You could get in an MMA fight and you could take someone down and you could mount them."}, {"time": 2444, "text": "And all that feels great."}, {"time": 2447, "text": "But when you start raining down the punches on their face from mount and like dropping elbows and stuff, like there's another level of satisfaction there."}, {"time": 2455, "text": "And it's tough to describe."}, {"time": 2457, "text": "And I don't think that everyone is made for it."}, {"time": 2461, "text": "When I was, I think when I was a senior in high school, my wrestling coach said, look, you've got to stop with all this crazy aggressive wrestling."}, {"time": 2469, "text": "Like they tried to turn me into a technician and it did work to a degree."}, {"time": 2475, "text": "And it was a humongous shift for me in terms of success, but it wasn't the same level of enjoyment out of it."}, {"time": 2483, "text": "Like, I mean, I got disqualified from New England because my coach said cross face and I cross face and he said harder."}, {"time": 2489, "text": "And I basically wound up and blasted a kid in the face and his nose got busted everywhere."}, {"time": 2493, "text": "But I didn't think not to do it because that felt good."}, {"time": 2497, "text": "It felt good to cross face him like that."}, {"time": 2499, "text": "I was a lot of like."}, {"time": 2502, "text": "That's a weird American warrior ethos that I've picked up, but I also have in me the Russian, the Setyaev brothers that don't see it, don't see it as that."}, {"time": 2513, "text": "They don't get draw, they think that there is a tension between the art of the martial art and the violence of the martial art."}, {"time": 2525, "text": "It's a poetic way I could put it, but they're not so fascinated with this Dan Gable dominating another human."}, {"time": 2532, "text": "They think of the effortlessness of the technique and your mastery of the art is exhibited in its effortlessness, how much you lose yourself in the moment and the timing, that just the beauty of a timing."}, {"time": 2547, "text": "Like there's much more, like one example in judo, but also in wrestling, you can look at the foot sweep."}, {"time": 2553, "text": "Wrestlers in America and even judo players in America and much of the world don't admire the beauty of the foot sweep, but a well timed foot sweep, which is a way to sort of off balance to find the right timing to just effortlessly change the table, turn the tables of, I mean, dominate your opponent is seen as the highest form of mastery in Russian wrestling."}, {"time": 2580, "text": "In the case of judo, it's in Japanese judo."}, {"time": 2586, "text": "I'm not sure what that tension is about."}, {"time": 2588, "text": "I think it actually takes me back to, I don't know if you listened to Dan Carlin, Hardcore History and Genghis Khan, if you've ever."}, {"time": 2597, "text": "I've read a great, great book."}, {"time": 2599, "text": "On Genghis Khan?"}, {"time": 2601, "text": "I'm still trying to adjust."}, {"time": 2603, "text": "Most of my life said Genghis Khan, but the right pronunciation is actually Genghis Khan."}, {"time": 2611, "text": "There's a tension there."}, {"time": 2612, "text": "We kind of think, I don't know we, I kind of thought as Genghis Khan is a ultra violent, a leader of ultra violent men, but another view, another way to see them is the people who warriors that valued extreme competence and mastery of the art of fighting with weapons, with bows, with the horse riding, all that kind of stuff."}, {"time": 2643, "text": "And I'm not sure exactly where to place them on my sort of thinking about violence in our human history."}, {"time": 2652, "text": "I think in the context of like combat sports, I think there's a difference between an athlete winning a contest under a certain set of rules and a fighter winning a fight under those exact same rules."}, {"time": 2666, "text": "There's a different approach to it."}, {"time": 2668, "text": "And I don't think one is any better than the other."}, {"time": 2672, "text": "Like in MMA, I think a great example would be George St. Pierre."}, {"time": 2677, "text": "George St. Pierre is a tremendous athlete and he considers himself to be a martial artist first."}, {"time": 2683, "text": "He's trying to win an athletic competition."}, {"time": 2685, "text": "Like Nick Diaz is trying to bust your ass, right?"}, {"time": 2691, "text": "And yes, they've had different results at the highest level of competition, but it's difficult to attribute the difference in results just to their approach to the sport because they're different human beings with different abilities and different physical attributes."}, {"time": 2706, "text": "The PsyTF brothers have that luxury of being able to talk about the beauty of a perfectly timed slide by."}, {"time": 2714, "text": "There are other wrestlers that will never be able to pull that off and therefore they have to pursue other ways to defeat someone."}, {"time": 2720, "text": "And maybe it is the Dan Gable breaking a man's spirit by outworking him type thing, which is beautiful in its own way."}, {"time": 2728, "text": "But we tend to self select the ways in which we're able to be successful and then kind of take a deep dive into that."}, {"time": 2737, "text": "What do you think is more beautiful?"}, {"time": 2739, "text": "Brute force or effortless execution of a technique that dominates another human?"}, {"time": 2749, "text": "I think it's a subjective thing based on what skills you perceive yourself to have."}, {"time": 2755, "text": "I'm never, I've never been a slick, super athletic, dexterous competitor in anything."}, {"time": 2762, "text": "And I've always been more of an, I've gotta outwork you, I've gotta out grind you, I gotta out mean you."}, {"time": 2767, "text": "And so because I've lived that, I tend to see the beauty in that more because I have a perceptual awareness that I don't have for the people who have the luxury of being very slick and athletic and using beautiful technique."}, {"time": 2780, "text": "Now that said, there's a phenomenal little video the other day I sent to a friend of a compilation of foot sweeps by Leota Machida in MMA."}, {"time": 2792, "text": "And they're so beautiful and they're so awesome."}, {"time": 2794, "text": "And it's not that I don't have an appreciation for those, but I can't emulate those because I lack the physical ability to do that."}, {"time": 2802, "text": "Whereas I at least have a chance to emulate some of the people who do it through grit and through outworking people."}, {"time": 2811, "text": "But I would love to return to Genghis Khan and get your thoughts about, like I have so many mixed feelings about whether he is evil or not, whether the violence that he brought to the world had ultimately, the fact that it had maybe kind of like Dan Carlin describes, cleanse the landscape."}, {"time": 2839, "text": "It's like a reset for the world through violence had ultimately a progressive effect on human civilization, even though in the short term it led to massive, you could say suffering."}, {"time": 2856, "text": "I don't know what to make of that, man."}, {"time": 2858, "text": "What are your thoughts on Genghis Khan?"}, {"time": 2860, "text": "I think it's always difficult to look at a historical figure and their actions of their time through a modern day lens because it's easy for us to kind of impugn their achievements and the things that they did and say, oh, well, what he did was wrong."}, {"time": 2880, "text": "Well, of course that can be true, but a lot of times we don't actually have any real good context or concept of the times they were living in and what really was deemed wrong and what really wasn't."}, {"time": 2891, "text": "We're looking at it through a very cushy modern lens."}, {"time": 2894, "text": "That being said, from what I've read about Genghis Khan, yeah, he was a violent dude, but also he gave you an option."}, {"time": 2902, "text": "When he got to a village, he said, look, you have a choice, you can come with us or you can run."}, {"time": 2911, "text": "And he gave them an option to join his legion of fighters who he took very good care of."}, {"time": 2918, "text": "He was the first military leader to pay his soldiers families when they died."}, {"time": 2925, "text": "And he did that based on the booty that they got when they raided a village."}, {"time": 2930, "text": "He took that money, he took his share and they divided that up amongst the soldiers and then the soldiers families."}, {"time": 2935, "text": "I think he also is credited with first horseback mail routes or something like that, right?"}, {"time": 2943, "text": "Isn't he the godfather of the modern postal system?"}, {"time": 2946, "text": "There's something like that."}, {"time": 2948, "text": "Yeah, he's the Bernie Sanders of the Mongol Empire."}, {"time": 2954, "text": "I do think the offering of surrender is an interesting one because it's interesting as a thought experiment, whether you would sacrifice your way of, like the pride of nations or the nationalism, pride of your country, whether you're willing to give that up to survive."}, {"time": 2978, "text": "It depends on who depends on you."}, {"time": 2980, "text": "If you have a family and young kids and stuff like that, I think your obligation is primarily to them and therefore surrender has to be something that you consider in that moment in time so that you can take care of those people."}, {"time": 2995, "text": "If you're a man alone and you've got all these principles and all this other stuff and you're not down with what Genghis Khan is doing and what he's selling, yeah, try and escape, do your thing and just know what waits on the other side of that for you potentially."}, {"time": 3008, "text": "But I think if there's someone else out there that depends on you, your obligation should be to them."}, {"time": 3013, "text": "It feels like historically people valued principles more than life in this weight of like, what do I value more?"}, {"time": 3023, "text": "The principles I hold versus survival."}, {"time": 3026, "text": "It seems that now we don't value principles as much."}, {"time": 3030, "text": "Principles could be also religion, it could be your values, whatever."}, {"time": 3033, "text": "We're okay sort of sacrificing those for to preserve our survival."}, {"time": 3038, "text": "And that applies in all forms like actual survival or like on social media, like preserving your reputation, all those kinds of things."}, {"time": 3048, "text": "It seems like we, especially in America, value individual life, that death is somehow a really bad thing."}, {"time": 3060, "text": "As opposed to saying sacrificing your principles is a very bad thing and everybody dies and it's okay to die."}, {"time": 3068, "text": "What's horrible is to sacrifice your principles of who you are just to live another day."}, {"time": 3075, "text": "I think a big problem is people don't really even know what their principles are anymore."}, {"time": 3079, "text": "People, social media and just the way that we live nowadays where we're separated from the human contact like this, like you're not contacting people in a community anymore."}, {"time": 3093, "text": "You're not, whether you're religious or not, like you're not congregating at a church, you're not part of a parish like you would be like in down South, you're not part of that community anymore."}, {"time": 3104, "text": "And so it's difficult to figure out what your principles and values are because you're constantly jumping from one bucket to the next online."}, {"time": 3115, "text": "And you don't get a lot of like direct, like reasonable feedback from people."}, {"time": 3121, "text": "You just get dipshit feedback."}, {"time": 3122, "text": "Like, oh, you don't believe this?"}, {"time": 3123, "text": "Well, you're a jerk."}, {"time": 3124, "text": "I think the hard thing currently is having the integrity and character to stick by principles one under."}, {"time": 3131, "text": "I don't want to equate murder in the Genghis Khan times to social media cancel culture, but it certainly doesn't feel good when people are attacking on social media."}, {"time": 3142, "text": "And it does take a lot of integrity to, without anger, without emotion, without mocking others or attacking others unfairly, standing by the ideas you hold, or in another way, standing by your friends, standing by this little group, like loyalty of the people that you know are good people."}, {"time": 3171, "text": "I find that in cancel culture, one of the sad things is whenever somebody gets quote unquote canceled, everybody just gets all their friends become really quiet and don't defend them or worse."}, {"time": 3186, "text": "I mean, quiet is at least understandable."}, {"time": 3188, "text": "They kind of signal that they throw them out of the bus, I guess is one way to put it."}, {"time": 3194, "text": "And that's something I think about a lot because from coming from me, it's like, I hold an ethic."}, {"time": 3203, "text": "I don't know if others hold this ethic."}, {"time": 3205, "text": "Maybe it's this like Russian mobster ethic of like, you should help your friends bury the body."}, {"time": 3214, "text": "You shouldn't criticize your friends for committing the murder."}, {"time": 3217, "text": "Like there are certain levels of like, yeah, you have that discussion after you buried the body that like maybe you shouldn't have done that murder thing."}, {"time": 3227, "text": "I don't know, I understand that that's a problematic, what's the terminology?"}, {"time": 3234, "text": "That's a problematic ethical framework within which to operate."}, {"time": 3238, "text": "But at the same time, it feels like what else do we have in this world except the brotherhood, the sisterhood, the love we have for a very small community."}, {"time": 3246, "text": "But perhaps that's the wrong way of thinking."}, {"time": 3248, "text": "Perhaps the 21st century would be defined by the dissipation of this community, of this loyalty concept."}, {"time": 3254, "text": "No, we're all just individuals."}, {"time": 3257, "text": "And I think you have to have some sort of core framework of principles and beliefs that you operate on."}, {"time": 3262, "text": "And I think what I was referencing is a little bit different."}, {"time": 3266, "text": "But to speak to your point, you need a framework of core principles on which you can then base a lot of your other decisions."}, {"time": 3278, "text": "Like I believe these three things to be true, whatever they are, and that will help inform other decisions you make in your life."}, {"time": 3285, "text": "As far as how you treat your friends, I've got probably three friends that, if they called me right now and said, let's bury the body, sorry, Lex, I gotta go."}, {"time": 3296, "text": "There are other people in my life that if they said, hey, we've got to go bury the body, I would say, who is this?"}, {"time": 3306, "text": "So I think it depends on the relationship."}, {"time": 3309, "text": "I wonder if that's a good, that's a really good measure."}, {"time": 3312, "text": "I would love to have, I would love that to be in your profile."}, {"time": 3315, "text": "People put like pronouns."}, {"time": 3317, "text": "I would love to put like, honestly, like objectively, not self report, but objective, how many people in your life, if they committed murder, you would not ask any questions and you would help them hide the body."}, {"time": 3331, "text": "Like, I would love to know that number for people."}, {"time": 3333, "text": "Yeah, and I think it's a weird thing too, because you think right away, like, okay, it must be the group of people that are the closest to you."}, {"time": 3339, "text": "That's who you're first thinking of, right?"}, {"time": 3341, "text": "But obviously for like my best friend, I would do it, no question about it."}, {"time": 3345, "text": "But I've got other people that are close to me that are close to me in other ways."}, {"time": 3350, "text": "And I probably wouldn't do that only because I don't think they'd do it for me."}, {"time": 3355, "text": "And that is a consideration."}, {"time": 3357, "text": "So I guess, is the principle there then that you do for your friends what you think they would do for you?"}, {"time": 3363, "text": "Is that the underlying principle?"}, {"time": 3365, "text": "Or do you just have a blind loyalty to people in your life for different reasons?"}, {"time": 3370, "text": "I got people that are not on my inner circle that I probably wouldn't help change a tire at two in the morning if they're on the highway."}, {"time": 3377, "text": "But if they called me and said, hey, we gotta bury the body, I might show up for that."}, {"time": 3380, "text": "It's just these weird different connections you have."}, {"time": 3383, "text": "Yeah, I have close friends that like, I'd probably be, exactly, the tire is a good example."}, {"time": 3388, "text": "I'd be like, can't you find somebody else to do this?"}, {"time": 3391, "text": "I think part of that is just this leap of faith into like giving yourself to the other person that creates a deep connection that makes life fulfilling, like meaningful that doesn't exist if you don't take that leap."}, {"time": 3411, "text": "I mean, it's not about the murder."}, {"time": 3412, "text": "We're sort of focusing."}, {"time": 3413, "text": "I think that's a, I think you have to, what is it, cross that bridge when you get there."}, {"time": 3420, "text": "This is just a thought experiment."}, {"time": 3421, "text": "But it's, I think about that a lot, especially these COVID times."}, {"time": 3426, "text": "And as like people become more and more isolated and separated from each other, like how important is it to have those deep connections to other humans?"}, {"time": 3436, "text": "I think especially like what you're talking about there."}, {"time": 3438, "text": "Have you ever seen the movie, The Town?"}, {"time": 3440, "text": "There's a great line in the movie where one of the main characters walks into his friend's house and he says, I need your help."}, {"time": 3448, "text": "We're gonna go hurt some people and you can never ask me about it again."}, {"time": 3451, "text": "And the friend looks up and he says, whose car are we taking?"}, {"time": 3455, "text": "Like that is the type of person you need in your life."}, {"time": 3458, "text": "And the people, like there are people that will walk through that door and say that to you and you drop everything you're doing."}, {"time": 3463, "text": "And then there's the people that walk through your door and you're like, you know what?"}, {"time": 3465, "text": "I got a hot pocket in the microwave."}, {"time": 3469, "text": "I'm a little bit tied up right now, but I'd love to help you out."}, {"time": 3472, "text": "But you know, I don't wanna do that."}, {"time": 3474, "text": "And you don't have that deep connection with those people."}, {"time": 3477, "text": "You mentioned some principles that you've changed your mind on."}, {"time": 3482, "text": "Is there, do you wanna go there?"}, {"time": 3484, "text": "Is there some interesting principles and the process of changing that is useful to talk about?"}, {"time": 3491, "text": "I can't really cite a specific thing, except that understanding that the principles that you have at different points in your life can change and it's okay to change them without being a total pussy and being bullied by other people into thinking what you thought was wrong."}, {"time": 3507, "text": "If you come to these conclusions of your own volition and you decide to change them, that's great."}, {"time": 3512, "text": "And it can be really, it can be really liberating."}, {"time": 3516, "text": "It's really liberating to have an idea that you hold so true to your core belief system and then to actually have someone change your mind for you and be okay with it, as opposed to being like, no, I gotta die with this."}, {"time": 3532, "text": "I gotta die with this."}, {"time": 3533, "text": "It's really liberating."}, {"time": 3534, "text": "There are definitely are ideas you wanna die on that hill and no one's ever gonna change your mind."}, {"time": 3538, "text": "But it's really liberating to be confident enough to say, change my mind."}, {"time": 3543, "text": "I'm lucky enough to have some smart motherfuckers around me who can tell me, listen, you're being a total dipshit."}, {"time": 3550, "text": "Like let's rethink this."}, {"time": 3552, "text": "Or like I have one friend who does the five whys all the time and he loves backing me into a corner."}, {"time": 3558, "text": "What's the five whys?"}, {"time": 3559, "text": "You just, like when someone makes a statement about something, to really get to the core issue, they say, if you ask why five times, make a statement, well, why is that?"}, {"time": 3569, "text": "And you answer that, well, why?"}, {"time": 3570, "text": "And you phrase the whys differently, obviously, but then you get to the core."}, {"time": 3573, "text": "They say five times, you can get to the core of the issue."}, {"time": 3576, "text": "And that's a challenging thing."}, {"time": 3578, "text": "But I find later in life, it's so liberating for me to be confident enough to be like, man, was I fucking way off the mark on this and have my mind changed."}, {"time": 3588, "text": "And be able to say that to others that I was wrong."}, {"time": 3591, "text": "That ability, and I never used to have that."}, {"time": 3594, "text": "And it feels real good."}, {"time": 3598, "text": "And there's a hunger for that too."}, {"time": 3600, "text": "Yeah, you're so right, actually, on a personal level, it feels very good."}, {"time": 3605, "text": "Exactly as you said, it's liberating because you're free to then think as opposed to."}, {"time": 3610, "text": "Defend."}, {"time": 3611, "text": "Yeah, without thinking."}, {"time": 3614, "text": "Yeah, you get so sick of defending the same thing over and over and over."}, {"time": 3618, "text": "And you start to think about it and it's like, well, I would really like to evolve my thought process here."}, {"time": 3625, "text": "And when you're constantly defending one point, it's difficult to let other ideas in."}, {"time": 3631, "text": "You discount the possibility that you can have your mind changed when you're constantly on the defense."}, {"time": 3637, "text": "You have to have a crack in the front line in order to let a new idea come in and possibly flourish."}, {"time": 3643, "text": "And maybe the new idea doesn't even prove your current belief system to be wrong, but maybe it's like the water to a seed and it grows and now it's something even bigger and better."}, {"time": 3654, "text": "And you can start to work with that instead."}, {"time": 3657, "text": "And it's a tough thing because I'm a stubborn fuck and it's very difficult for me, it was historically, to say I was wrong about this one, or I messed this one up, or I wish I could have that one back."}, {"time": 3669, "text": "There's a public figure for me thing too, which there's a difference between changing your mind with a small circle of friends and changing your mind publicly about something, but it has equal, one echoes the other."}, {"time": 3683, "text": "It is equally liberating, but people will not make that change easy, but it doesn't matter."}, {"time": 3692, "text": "That's the point."}, {"time": 3695, "text": "I think it's ultimately liberating as a human being, public figure or not to just think deeply about this world and to keep changing, which is like, I think there's a deep hunger for that in like political discourse, that people are so tribal currently about politics that they want to see somebody who says, you know what, I changed my mind on this."}, {"time": 3720, "text": "And then keep changing their mind and keep asking questions, keep showing that they're open minded, all that kind of stuff."}, {"time": 3726, "text": "But when you want someone in a position of political power to change their mind because they realize that there might be a better way, not because they realize that by changing their mind, they're gonna get a new demographic to vote for them."}, {"time": 3738, "text": "Like that's transparent as shit."}, {"time": 3739, "text": "Nobody wants to see that."}, {"time": 3741, "text": "Like that's a person who can't separate their position from their people they're supposed to be helping."}, {"time": 3747, "text": "Yeah, and you can usually smell that."}, {"time": 3749, "text": "That's, we're just talking offline about, there's something about Hillary Clinton where she talked about changing her mind on gay marriage that it felt like this is a political calculation versus like really deeply thinking about like, what things do we do in this world that violate basic human rights?"}, {"time": 3775, "text": "Like really thinking about deeply."}, {"time": 3776, "text": "And of course politicians are calculating this, but you can see it."}, {"time": 3782, "text": "That's why I like on the human level, there's like political policies, but there's also humans."}, {"time": 3788, "text": "And I've always liked Bernie Sanders, for example."}, {"time": 3791, "text": "I don't know, not the later perhaps Bernie Sanders, but I used to listen to him back in the day."}, {"time": 3795, "text": "And it felt that people might disagree with me, but it felt like there was a real human struggling with ideas, whatever, agree with him or not, it felt like he wasn't doing political calculation."}, {"time": 3807, "text": "He was just a human."}, {"time": 3808, "text": "He couldn't be further away from my political ideals, but also like, there's an obvious authenticity to his passion for what he's saying that is not present in other candidates."}, {"time": 3820, "text": "And you could see it, all these people that have been in politics forever, like from all the way back when Hillary was a lawyer in the 70s."}, {"time": 3827, "text": "There's a couple of shots of her in a courtroom in the 70s though, she's looking all right."}, {"time": 3832, "text": "She's got those big glasses on."}, {"time": 3833, "text": "She's kind of a little bit of a nerdy babe back in the day."}, {"time": 3837, "text": "Oh, you mean like."}, {"time": 3839, "text": "Well, John Clark says Hillary Clinton was a babe back in the day."}, {"time": 3844, "text": "73 Clinton, yeah."}, {"time": 3845, "text": "That's an interesting question about authenticity in politicians."}, {"time": 3852, "text": "Do you think like Hillary Clinton, just the Clintons in general are a good example that why do you think they become over time so inauthentic?"}, {"time": 3861, "text": "Is it the system that changes them?"}, {"time": 3863, "text": "Is it their own hunger for power?"}, {"time": 3865, "text": "Is it, what is it, or are they always inauthentic?"}, {"time": 3869, "text": "Well, first I'd like to say that, I don't know if you know this, but I come from a bit of a political dynasty myself."}, {"time": 3876, "text": "I was on the student government several times in high school and my dad won the runoff in a special election in Bradenton Beach, Florida."}, {"time": 3885, "text": "I think there's like 700 people there."}, {"time": 3888, "text": "So your dad got you the job?"}, {"time": 3889, "text": "Yeah, we're basically, a lot of people compare us to the Kennedys."}, {"time": 3894, "text": "My guess with the politicians is that, and you can see it now as we're becoming more cognizant as people to the political process, I think the process corrupts people."}, {"time": 3904, "text": "And I think that, I don't know the ins and outs of it."}, {"time": 3906, "text": "I've listened to people who are far more educated on it than me and I'm unprepared to cite any of their points."}, {"time": 3914, "text": "I think you can see it a little bit in Dan Crenshaw."}, {"time": 3916, "text": "Can I say this?"}, {"time": 3917, "text": "Yeah, I like him."}, {"time": 3919, "text": "I really liked Dan, especially like a year, year and a half ago."}, {"time": 3923, "text": "He seemed very level headed."}, {"time": 3925, "text": "It's clear to me now that as he panders more and more to the right, it's because he's setting himself for a presidential run."}, {"time": 3933, "text": "It's clear that that's happening."}, {"time": 3935, "text": "And he just doesn't seem like the same authentic ideals oriented guy that he did a year and a half ago."}, {"time": 3942, "text": "Now I could be wrong on that."}, {"time": 3943, "text": "It could be way off."}, {"time": 3944, "text": "But I think that you can take someone as honest as you want to."}, {"time": 3949, "text": "When you start them on that path to the presidency, you become so unbelievably beholden to so many people and entities along the way that by the time you get to the final destination, the Oval Office, all you're doing is paying back the favors that got you there."}, {"time": 3966, "text": "And you never get to serve the people you're supposed to serve."}, {"time": 3969, "text": "Your primary focus is on your office and not on the people that you're supposed to be helping."}, {"time": 3975, "text": "And I think that that's a humongous problem."}, {"time": 3977, "text": "And like we could talk all about campaign finance reform and the two party system."}, {"time": 3980, "text": "But at the end of the day, the people who are running for political posts, they're working to keep a job."}, {"time": 3989, "text": "They're not working to improve the lives of the constituents, which is different."}, {"time": 3993, "text": "A long, long time ago, like a lot of politicians, those were like part time jobs."}, {"time": 3998, "text": "And they held other posts out West."}, {"time": 4000, "text": "They were ranchers by day and sheriff by night, whatever the case might be."}, {"time": 4004, "text": "But now, such a cushy path for the rest of your life that the goal is to just be a politician, not do the things that you think a politician is supposed to do."}, {"time": 4015, "text": "By the way, I'll talk to Dan on this."}, {"time": 4018, "text": "It's funny, I like the version of him from a year ago and I haven't been really paying attention."}, {"time": 4023, "text": "So I'll be, I'll actually pay more attention now and ask him that exact question."}, {"time": 4028, "text": "Like, how do you prevent yourself from changing, becoming what the Clintons became?"}, {"time": 4034, "text": "I tend to believe like there's conspiratorial stuff about Clintons and all these politicians."}, {"time": 4037, "text": "I tend to believe that they were actually good, thoughtful people back in the day."}, {"time": 4041, "text": "And the system changes them."}, {"time": 4045, "text": "It's not even the system."}, {"time": 4047, "text": "There's something about just the process of campaigning."}, {"time": 4050, "text": "I just think it wears you down to where if you look at the percentage of time you spend on the kinds of conversations you have, it's like one, you do these speeches, which you repeat the same thing over and over and over."}, {"time": 4063, "text": "It beats the process of thinking."}, {"time": 4067, "text": "You just exhaust your brain to where you're not thinking anymore, you're just repeating."}, {"time": 4071, "text": "It's very, it's exceptionally difficult to keep making speech after speech after speech, saying the same thing over and over and over again, and at the same time thinking deeply and changing your mind and learning."}, {"time": 4084, "text": "And then also the pandering to financial, like having phone calls, like fundraising, all those kinds of things."}, {"time": 4091, "text": "That's what they do now."}, {"time": 4092, "text": "They spend most of their time fundraising."}, {"time": 4093, "text": "They're not worried about anything."}, {"time": 4095, "text": "Sorry to interrupt you, but I was gonna say that you can see there's a fuel."}, {"time": 4099, "text": "Like the more attention and the higher regard you're held in in your community, and the more sycophants like continue to blow smoke up your ass, the more it changes the way you present yourself."}, {"time": 4112, "text": "And you can see it in every walk of life."}, {"time": 4115, "text": "I mean, jiu jitsu is a tiny, tiny little section of the world, but you see it in the jiu jitsu community."}, {"time": 4120, "text": "When someone all of a sudden starts a social media page or whatever, and they get a bunch of people, like basically like cyber fellating them on their Instagram page, they change."}, {"time": 4131, "text": "Fellating, is that a word?"}, {"time": 4133, "text": "So giving fellatio?"}, {"time": 4135, "text": "So fellating."}, {"time": 4137, "text": "Jamie, look it up."}, {"time": 4139, "text": "I think, but in those people, it changes their character."}, {"time": 4144, "text": "It changes who they are because they become emboldened and now they've got this like mythical cyber mob behind them."}, {"time": 4151, "text": "There's a sign at the entrance to your gym that reads, for every moment of triumph, it's a quote by Hunter S. Thompson."}, {"time": 4159, "text": "It reads, for every moment of triumph, for every instance of beauty, many souls must be trampled."}, {"time": 4167, "text": "What does this quote mean to you?"}, {"time": 4169, "text": "That quote to me is about, mostly about sacrifice."}, {"time": 4174, "text": "And it's about to achieve anything great or anything beautiful or to triumph, you have to have sacrificed so many things to get there, unless you're the most unbelievably genetically gifted person in the world and greatness is just, you know, falls upon you, it's just raining from the sky."}, {"time": 4193, "text": "I think on your path to greatness, on your path to success and triumph, you leave a lot of carnage in your wake, personal relationships, other goals, things that you didn't pursue, you know, other unfulfilled dreams."}, {"time": 4210, "text": "And you kind of have to sell a lot of that out in order to be really at the peak of your field or what you want to be."}, {"time": 4222, "text": "I know that that's happened in my life."}, {"time": 4223, "text": "I mean, there's tons and tons of relationships that, you know, couldn't survive the way that I was living my life, because when I was trying to be a big time fighter or like when I was just training all the time, tons of relationships dissolve themselves naturally, some not so naturally."}, {"time": 4243, "text": "Some people get it, some people don't get it, some people hate you, you miss tons of other opportunities."}, {"time": 4249, "text": "And I think that's kind of what that quote means to me."}, {"time": 4251, "text": "It's about sacrifice."}, {"time": 4252, "text": "It's about you're giving up what you want now for what you want more."}, {"time": 4261, "text": "And it's the trampling of souls, it's messy too, because it's not clear what the right path is."}, {"time": 4270, "text": "Like that sacrifice is not obvious that those are the right sacrifices to make."}, {"time": 4276, "text": "You might be ruining your own life, but the fact that you're willing to take that risk and sort of go all in on whether it's stupid or not, go all in on something, that the possibility of creating something beautiful is there."}, {"time": 4296, "text": "Who says it's stupid?"}, {"time": 4297, "text": "If you're going all in on it, you don't think it's stupid."}, {"time": 4300, "text": "Someone else might think it's stupid, but I mean, who really cares?"}, {"time": 4304, "text": "Well, I'm of many minds on many things, so I feel like there's certain minds, certain moves of the day where you think it's stupid."}, {"time": 4312, "text": "Like relationships is a beautiful one, which is, you've seen the movie Whiplash, by any chance?"}, {"time": 4319, "text": "It seems like in a man's life, or it could be a woman's, but I don't identify as a woman, so I know the man, the lived experience."}, {"time": 4328, "text": "It's 2020, bro."}, {"time": 4330, "text": "But my lived experience for now is that of a man."}, {"time": 4333, "text": "We'll see about tomorrow."}, {"time": 4335, "text": "And there is, in the pursuit of excellence, there's often a choice of, some of the souls that must be trampled are personal relationships with humans in your life that you might deeply care about."}, {"time": 4350, "text": "It could be family, it could be friends, it could be loved ones of all different forms."}, {"time": 4356, "text": "It could be the people that, your colleagues that are dependent on you, people who will lose jobs because of the decisions you make, all this kind of stuff."}, {"time": 4365, "text": "It seems that that moment happens, and I'm not sure that sacrifice is always the correct one."}, {"time": 4372, "text": "Like, to me, the movie Whiplash, for people who haven't seen, spoiler alert, maybe?"}, {"time": 4376, "text": "I don't even know if that movie has any spoilers, but there is a relationship with a female."}, {"time": 4382, "text": "There's a student, there's a drummer that's pursuing excellence of this particular art form of drumming, and he has a brief, fleeting relationship with a female, and he also has an instructor that's pushing him to his limits in what appears to be awfully a lot like a toxic relationship."}, {"time": 4402, "text": "And he chooses, not chooses, he naturally makes the decision to sacrifice the romantic relationship with the woman in further pursuit of this chaos of, this chaotic pursuit of excellence."}, {"time": 4421, "text": "And that doesn't feel like a deliberate decision."}, {"time": 4425, "text": "It feels like a giant mess of like an emotional mess where you're just like, kind of like a fish swimming against stream, just like, fuck it."}, {"time": 4437, "text": "You let go of all the things that convention says you should appreciate."}, {"time": 4442, "text": "You throw away the possibility of a stable life, of a comfortable life, of what society says is a meaningful life, and just pursue this crazy thing full of seeming toxicity with crazy people surrounding you."}, {"time": 4457, "text": "So I don't know what the right decision is."}, {"time": 4459, "text": "Part of my brain says, you should stay with the girl."}, {"time": 4462, "text": "Fuck that instructor that's making you, that's pushing you to places where it's like, that are destructive, potentially destructive, like could lead to suicide, could lead you to completely fail or fail on your pursuit of excellence or destroy the dream, the passionate pursuit of the thing that you've always dreamed for, in that case is drumming."}, {"time": 4492, "text": "There's so many minds there."}, {"time": 4493, "text": "Like what is the right thing to do?"}, {"time": 4494, "text": "So my first two thoughts are, number one, fuck convention."}, {"time": 4498, "text": "What is convention?"}, {"time": 4499, "text": "It's like some laid out path, some linear progression of the way your life is supposed to go, like that someone can draw a picture of at the end."}, {"time": 4507, "text": "That shit's, first of all, it's just boring and whatever."}, {"time": 4511, "text": "And it's, I don't wanna say that it's cowardly because it isn't cowardly, but for someone who's not conventional to not be nonconventional is cowardly, to get sucked into the convention."}, {"time": 4522, "text": "That's first."}, {"time": 4523, "text": "Second of all, I believe that scene in the diner in that movie where he tells her you're in my way because I'm gonna want to be with you, or you're going to want me to be going out to dinner with you and I know I should be practicing, or I know I should be training."}, {"time": 4539, "text": "And ultimately I'm gonna make, I'm either gonna feel bad about not being with you by training, or I'm gonna skip the training to be with you and neither one is right."}, {"time": 4547, "text": "The whole thing that they don't mention in that is that that's the wrong girl."}, {"time": 4551, "text": "That's the wrong girl."}, {"time": 4553, "text": "The right girl is a gangster."}, {"time": 4555, "text": "The right girl says, oh, you've practiced tonight?"}, {"time": 4559, "text": "I'll leave you a sandwich and some milk so that you can, outside the door, let me know when you're done, or you have some free time."}, {"time": 4567, "text": "The right girl compliments that."}, {"time": 4569, "text": "She's not an impediment in any way."}, {"time": 4571, "text": "Even if what you wanna do is be with her so much that you're putting the drums down, or you're putting the bass down, or you're picking up the pizza, or you're not going to training, that girl, without even telling you why she's making decisions, is making decisions to help you achieve your goal."}, {"time": 4589, "text": "Now that might sound like some sort of chauvinistic king of the castle type shit where everyone should cater to you, but the fact of the matter is that person is a compliment to your life in helping you do your thing, and in your own way you're helping them to achieve whatever their goals are also."}, {"time": 4608, "text": "It's uncommon that you have two people under the same roof striving to be unbelievably excellent in one small area."}, {"time": 4616, "text": "It's not impossible, but it's uncommon."}, {"time": 4619, "text": "Relationships have to be like binary systems, like two stars."}, {"time": 4623, "text": "The gravitational pull is what keeps you together and circling around one another, right?"}, {"time": 4628, "text": "And one is bigger than the other, and they'll fluctuate, and the stars will get bigger, and they'll get smaller, and they'll contract based on positioning and composition."}, {"time": 4639, "text": "That's the way a relationship should be, not an asteroid coming in to disrupt the surface of your planet."}, {"time": 4647, "text": "It's a binary system, it's a compliment."}, {"time": 4648, "text": "That girl was the wrong girl for him."}, {"time": 4650, "text": "So you shouldn't, like the big unconventional dreams should not be adjusted to fit into this world."}, {"time": 4661, "text": "Because I mean, there is a part of me that's like full of self thought, well, maybe you're just a dick."}, {"time": 4666, "text": "Yeah, who cares?"}, {"time": 4668, "text": "Lex, so first of all, who cares?"}, {"time": 4672, "text": "This is, by the way, somebody who's, you have recently gotten, well, in the span of the history of the universe is recently you've gotten to a relationship, but you haven't always, you have not felt the need to be in the relationship just because you're supposed to by society's kind of momentum."}, {"time": 4693, "text": "If you, I think that if you really want anything, you've got to be prepared fully to be the exact opposite."}, {"time": 4700, "text": "If you're a person who's looking for a relationship, the only way you're going to get in an awesome relationship is by being comfortable being alone, because that's the risk."}, {"time": 4707, "text": "If you're a person who's driven by money, you've got to be comfortable being totally poor because that's the risk, right?"}, {"time": 4713, "text": "And when you're constantly hedging your bets, you're never all in."}, {"time": 4718, "text": "You're never all in on the thing you're trying to do."}, {"time": 4721, "text": "So a relationship has to compliment your life."}, {"time": 4725, "text": "You can't say, it's okay to want to be in a relationship, but you can't want to be in a relationship so bad that you take someone in who fits the suit."}, {"time": 4736, "text": "And it's like, oh, our schedules kind of work out."}, {"time": 4738, "text": "You live near me and this and that and the other thing, because the logistics of a relationship are not always perfect."}, {"time": 4744, "text": "It's what matters is when the two people are together."}, {"time": 4747, "text": "That's the perfect part of it."}, {"time": 4748, "text": "And it's great to want to meet people and say, if we meet and some sort of a relationship develops, I'm willing to run with it, but I'm not meeting you hoping a relationship develops."}, {"time": 4763, "text": "I think you kind of put the cart before the horse in a lot of those situations."}, {"time": 4767, "text": "It's like when guys meet."}, {"time": 4768, "text": "No guy goes out and is like, I'm looking for a bro, right?"}, {"time": 4772, "text": "Nobody does that."}, {"time": 4773, "text": "You go to the gym and you run into a bunch of dudes and the next thing you know, someone's cool and they want to talk about fighting and you're fucking shotgun and beers."}, {"time": 4779, "text": "And all of a sudden you got a bro and that's how it works."}, {"time": 4781, "text": "It works the same way with women."}, {"time": 4783, "text": "What's a shotgun and beers?"}, {"time": 4785, "text": "I'll show you after this."}, {"time": 4785, "text": "You poke a hole in the bottom and you open the top."}, {"time": 4789, "text": "Yeah, this is the problem with America."}, {"time": 4792, "text": "Drink vodka like a man."}, {"time": 4794, "text": "Okay, now don't poke holes in beers."}, {"time": 4797, "text": "This is the problem with the frat culture."}, {"time": 4799, "text": "They don't really know how to drink."}, {"time": 4800, "text": "They think they know how to drink."}, {"time": 4801, "text": "They don't know how to drink."}, {"time": 4802, "text": "What do you think makes a successful relationship if we can linger on that a little longer?"}, {"time": 4809, "text": "Like, let me ask John Clark about love."}, {"time": 4817, "text": "I didn't ask a question, but let me just say love."}, {"time": 4822, "text": "About love."}, {"time": 4826, "text": "Are you one of those people who never says I love you?"}, {"time": 4831, "text": "No, no, I'm an extreme person."}, {"time": 4834, "text": "And like my emotions are also extreme."}, {"time": 4837, "text": "And one of the things I concern myself with, maybe this is philosophical and martial arts warrior soldier type related stuff is like, I don't want anyone."}, {"time": 4850, "text": "If I die tonight on the drive home, hopefully that doesn't happen."}, {"time": 4854, "text": "I hope that no one is left questioning how I felt about them."}, {"time": 4857, "text": "And people I don't like probably are not questioning that."}, {"time": 4862, "text": "And so the thing that I've had to learn how to do later in life is to tell the people that you care about, that you care about them."}, {"time": 4870, "text": "And each thing can be equally off putting to the receiver of the message."}, {"time": 4878, "text": "Each thing can be equally off putting to the receiver of the message."}, {"time": 4880, "text": "When you're letting someone know how much you dislike them, that can be off putting to the person receiving that message."}, {"time": 4885, "text": "And when you tell someone how much you care about them, it can also be off putting to the person, depending on how they view their relationship with you."}, {"time": 4892, "text": "But it's still important to get it out there."}, {"time": 4894, "text": "Like you shouldn't hold those things in because you're worried about how they'll be received or if they'll come back at you."}, {"time": 4901, "text": "So you're okay going all in on these?"}, {"time": 4906, "text": "Not afraid of commitment?"}, {"time": 4907, "text": "No, I'm not afraid of commitment."}, {"time": 4908, "text": "Anyone who says they're afraid of commitment is full of shit."}, {"time": 4910, "text": "You know what they're afraid of?"}, {"time": 4911, "text": "They're afraid of commitment with that person."}, {"time": 4914, "text": "That's what they're afraid of."}, {"time": 4916, "text": "Like when someone knocks you on your ass and they come into your life and you're flush with all these emotions, you're not worried about, oh, I don't really like commitment."}, {"time": 4927, "text": "No, because they've knocked you on your ass."}, {"time": 4928, "text": "You want to be with them."}, {"time": 4930, "text": "You want those things."}, {"time": 4931, "text": "The two most alive points in your life, I think people feel is the euphoria of a new relationship and then the loss when that love is gone."}, {"time": 4941, "text": "You'll never feel more, I don't think, than in those moments in your life."}, {"time": 4946, "text": "See, the nice thing about the loss is it lasts longer."}, {"time": 4953, "text": "That's a Louis C.K."}, {"time": 4953, "text": "point that he makes, which is like that, like in his show, I think, is a conversation with an older gentleman that says like that's his favorite part of the relationship is that period between the loss of the relationship and the real death, which is forgetting the person."}, {"time": 4976, "text": "But that period lasts the longest and that's like the most fulfilling, like missing the other person is as fulfilling as the actual love, the early infatuation, which is interesting."}, {"time": 4989, "text": "I also think of the Bukowski."}, {"time": 4991, "text": "I return to that."}, {"time": 4993, "text": "There's a little clip of him in an interview saying that love is a fog that dissipates with the first light of reality or something like that."}, {"time": 5006, "text": "So basically emphasizing that it's this very, very, very fleeting thing, that it's a moments thing and then it just fades and everything else is something else."}, {"time": 5018, "text": "So love is only a temporary thing, which is interesting."}, {"time": 5021, "text": "I think some people say that's cynical."}, {"time": 5026, "text": "I think it's important to understand that everything is fleeting when you don't put effort into it."}, {"time": 5034, "text": "Almost everything will be fleeting."}, {"time": 5035, "text": "If you don't put effort into it, most people will get fat and lazy."}, {"time": 5038, "text": "If you don't put effort into something, you're gonna not be good at playing guitar or playing bass."}, {"time": 5043, "text": "You've got to put effort into it."}, {"time": 5044, "text": "The same thing goes for a relationship."}, {"time": 5047, "text": "That the awesome part of it, that like love part, that dies soon and early on in a relationship because it's so good that we think we don't have to work at it, but you do."}, {"time": 5060, "text": "You have to keep doing the things and you gotta keep things new and crisp and fresh."}, {"time": 5064, "text": "And different people probably feel differently about this, but I don't know, you walk around your girl and you start like farting and stuff, like that's when it all dies."}, {"time": 5077, "text": "That's when it dies."}, {"time": 5079, "text": "We're all human beings."}, {"time": 5080, "text": "We're all here and our bodies work in the same way, but you start to chip away at this beautiful thing when you buck conventional courtesy and things like that."}, {"time": 5096, "text": "Well, take it for granted, basically."}, {"time": 5098, "text": "You take it for granted, yeah."}, {"time": 5099, "text": "I mean, that's the same thing with life."}, {"time": 5103, "text": "I'm a big fan of meditating on death that you could die today."}, {"time": 5108, "text": "In the same way you should meditate on this relationship could end today, this connection with another human could be."}, {"time": 5113, "text": "This is the last time you could be interacting."}, {"time": 5117, "text": "And your chances of that increase when you take it for granted and you shit on people."}, {"time": 5121, "text": "But when you work at it, the chances of that decrease."}, {"time": 5124, "text": "It's never gonna be zero, but it decreases."}, {"time": 5127, "text": "And when you do that, when you're the person and you're trying to maintain and you're trying to work at the relationship, you gotta make sure that both people are working at it."}, {"time": 5137, "text": "Otherwise, you're just a fucking chump."}, {"time": 5139, "text": "Okay, let's return back to mixed martial arts."}, {"time": 5143, "text": "Let me ask the ridiculous question of who do you think are the top three, maybe top five greatest fighters of all time?"}, {"time": 5151, "text": "It's so hard to compare fighters across generations."}, {"time": 5157, "text": "And maybe one way to say it is which metrics would you put on the table as to measure what a great fighter is?"}, {"time": 5165, "text": "There was a guy named Dioxapus."}, {"time": 5168, "text": "And in the fourth century, and he was such a badass that in the Olympics in 336 BC, no one even showed up to fight him in the Pancration event."}, {"time": 5182, "text": "Nobody even showed up because he was fucking everybody up."}, {"time": 5184, "text": "Years later, he was retired."}, {"time": 5186, "text": "And this crazy Macedonian dude came there at some dinner for Alexander the Great, everyone's chilling, drinking, whatever they were drinking out of their chalices."}, {"time": 5196, "text": "And this Macedonian dude threatened him and challenged him."}, {"time": 5200, "text": "So Dioxapus said, yeah, man, we'll throw down."}, {"time": 5203, "text": "And they set the time and the place."}, {"time": 5205, "text": "Macedonian dude comes out like body armor, spear, shield, all this other shit."}, {"time": 5212, "text": "Dioxapus came out absolutely naked with a wooden club and took on this much younger guy, beat the living crap out of him and then put his foot on his throat and then didn't even kill him in the show of ultimate power for the time."}, {"time": 5229, "text": "There's something about the guy being naked too is just extra demeaning."}, {"time": 5233, "text": "Extra demeaning, yeah."}, {"time": 5234, "text": "Okay, can we rephrase the question then?"}, {"time": 5238, "text": "Because those are clearly going to be some probably forgotten warriors in history."}, {"time": 5243, "text": "Well, let's take it to like modern day mixed martial arts in the UFC, perhaps."}, {"time": 5247, "text": "Well, just mixed martial arts there."}, {"time": 5250, "text": "Who do you think are the top fighters of all time?"}, {"time": 5252, "text": "What metrics would you consider in trying to answer this perhaps unanswerable question?"}, {"time": 5258, "text": "I think one of the things you want to think about is strength of opponent at the time you fought them."}, {"time": 5264, "text": "So for example, fighting BJ Penn in his prime and beating him is far different than beating BJ Penn last year, right?"}, {"time": 5272, "text": "So to say you have a victory over BJ Penn is not the same given the timeframe of when it happened."}, {"time": 5279, "text": "Not to take anything away from anyone who's beaten BJ Penn."}, {"time": 5282, "text": "Just use that as an example of someone whose career went into a different direction."}, {"time": 5287, "text": "I would say the guy who I think is probably the best that people are the least familiar with would be Marillo Bustamante."}, {"time": 5299, "text": "And I think he was a guy who was one of the guys with the first really good physical build for MMA, which I think is narrow from the chest to the back and long shoulder to shoulder and kind of sinewy made out of steel cable."}, {"time": 5314, "text": "That was a guy who could box, that was a guy who could wrestle, and that was a guy who had great jujitsu."}, {"time": 5319, "text": "He wasn't a great kickboxer, but at the time he didn't need it."}, {"time": 5323, "text": "Fought everybody and gave everybody a run."}, {"time": 5326, "text": "I think he's probably one of those guys who's gotta be considered."}, {"time": 5332, "text": "Yeah, there's a few killers that never, because why is he not in the discussion?"}, {"time": 5337, "text": "Because I think greatness requires both the skill and the opportunity to meet each other."}, {"time": 5346, "text": "And when you talk about a fighter, the other thing that really a good fighter needs to become great is a foil."}, {"time": 5352, "text": "And so many fighters don't have a foil."}, {"time": 5355, "text": "That's one of the biggest detractions, I think, of early Mike Tyson's career."}, {"time": 5359, "text": "He didn't have a foil."}, {"time": 5360, "text": "He had no one driving him."}, {"time": 5362, "text": "And by the time he did, by the time he had a foil in Holyfield, his career was in a different place."}, {"time": 5366, "text": "But he's one of the greats of all time, and he never really had a foil, so his greatness was in unparalleled destruction of like nobody as well, of lesser opponents."}, {"time": 5382, "text": "Right, and so when people debate the level of greatness of Mike Tyson, that's one of the things they say, like he didn't fight a lot of killers in their prime."}, {"time": 5391, "text": "I think you've obviously got to say in that conversation, I have a really difficult time keeping George St. Pierre out of the conversation, only because he was able to beat you with anything."}, {"time": 5406, "text": "He could out jab you, he could out wrestle you, and he could submit you."}, {"time": 5411, "text": "The problem I have with Fedor is his career also took a drastic turn towards the end."}, {"time": 5418, "text": "And when he was fighting in Pride, he was doing a lot more grappling, and then he just started casting that overhand right at people."}, {"time": 5426, "text": "And his game kind of changed at that point."}, {"time": 5429, "text": "You can't take anything away from his greatness, but at that time, the great heavyweights were not really fighting in Pride, and they didn't really exist yet."}, {"time": 5438, "text": "And by the time he fought a really good one, Fabricio Verdun, he did get submitted there."}, {"time": 5442, "text": "Does his later performance color your and our perception of his greatness in general about fighters?"}, {"time": 5451, "text": "Not mine, but I'm someone who's intimately involved in the sport, but it colors everyone else's."}, {"time": 5457, "text": "Same with Anderson Silva."}, {"time": 5458, "text": "I don't think Anderson Silva doesn't want to fight in like seven years or something, or he's like one."}, {"time": 5463, "text": "That's a guy who in his prime was one of the best fighters."}, {"time": 5466, "text": "Is he in the top five for you?"}, {"time": 5468, "text": "I think he's probably in the top five, yeah."}, {"time": 5470, "text": "Greater striker of all time or no?"}, {"time": 5471, "text": "In MMA?"}, {"time": 5472, "text": "In mixed martial arts."}, {"time": 5473, "text": "In mixed martial arts?"}, {"time": 5475, "text": "In mixed martial arts, that's a tough question."}, {"time": 5479, "text": "The greatest MMA striker of all time."}, {"time": 5482, "text": "Because like the timing, we're talking about foot sweeps, right?"}, {"time": 5487, "text": "Who makes it look easier than Anderson Silva?"}, {"time": 5491, "text": "I think in an incredibly short sample of his prime, it's gotta be Anderson Silva, and I think you have to consider discussing Leota Machida for his unbelievable manipulation of distance, which is something that people don't really talk too much about in terms of fighting, unless you're someone in the sport."}, {"time": 5510, "text": "That his use of distance and the ability to like, what we call pop out, like make you miss by one inch so that he could follow your fist back in as you retract it and it hit you over the top, that that's a thing of beauty."}, {"time": 5526, "text": "Anderson Silva, when he became a counter striker, when he got to his prime in the UFC, that was a thing of beauty."}, {"time": 5531, "text": "That was a thing of beauty."}, {"time": 5533, "text": "So I think definitely those two guys and Murilo Bustamante's gotta be the third guy."}, {"time": 5538, "text": "There's just so many good guys now."}, {"time": 5540, "text": "So where do you put, in terms of metrics, you mentioned GSP and Anderson Silva, I think they have a large number of defenses of a title."}, {"time": 5548, "text": "Is that important to you?"}, {"time": 5550, "text": "Like this kind of consistent domination?"}, {"time": 5552, "text": "No, because it's easily manipulated by the people making money off the fights."}, {"time": 5558, "text": "So there was a great quote one time when the UFC was coming to prominence and Vince McMahon from the WWE, he said, you know, the difference between what we do and what UFC does is that when we have a superstar, I can make sure he stays on top until he's no longer a superstar because we have predetermined results."}, {"time": 5578, "text": "UFC can't do that because they're actually having fights."}, {"time": 5581, "text": "Well, it's true and false."}, {"time": 5582, "text": "You can't do that, but you can give your superstars the most favorable matchups to keep them on top for the longest."}, {"time": 5589, "text": "So people always talk about title defenses as if the guy they're fighting, the challenger, is always the person most deserving of the shot."}, {"time": 5596, "text": "And it's just not true."}, {"time": 5597, "text": "So I don't put that much stock in it."}, {"time": 5599, "text": "Is it possible to put a guy in consideration as one of the greats if all they had is one or two amazing fights?"}, {"time": 5610, "text": "I'll tell you, like an amazing could be a lot of different definitions."}, {"time": 5615, "text": "It could be just the war."}, {"time": 5617, "text": "Like they never really reached the highest of excellences of domination, but they've, like this, we had this discussion about Kyle Bokniak, right?"}, {"time": 5629, "text": "To me, that's a perfect example."}, {"time": 5630, "text": "He had this famous fight against Zabit Magomed Sharapov, where on one side you have an Anderson Silva type of fighter and Zabit, like just a very good striker."}, {"time": 5647, "text": "Like, and then there's like the warrior on the Kyle side."}, {"time": 5653, "text": "And just the fight, they created something special together."}, {"time": 5656, "text": "It was fight at night, whatever."}, {"time": 5657, "text": "But the, you know, that fight was special on that night because the two dance partners."}, {"time": 5665, "text": "You can have a great performance without being a great fighter."}, {"time": 5668, "text": "Not saying neither of those guys is a great fighter, but to answer your first question, I think that having one or two great performances does not necessarily mean that you are great."}, {"time": 5678, "text": "I need a larger sample size."}, {"time": 5679, "text": "I have no idea what that is."}, {"time": 5681, "text": "I don't have any idea what that is."}, {"time": 5682, "text": "And also, where, how much weight does toughness have when you're thinking about the criteria when you define a great fighter?"}, {"time": 5698, "text": "And I don't have the answer to it."}, {"time": 5700, "text": "I admire the underdog that rises to the occasion through brute force."}, {"time": 5704, "text": "They didn't have, they didn't bring the skillset to the table that perhaps some of the greats have, but they rose to the occasion."}, {"time": 5712, "text": "I mean, there's something about that."}, {"time": 5713, "text": "There's something about that."}, {"time": 5714, "text": "And so now we're more talking about like the internal attributes as opposed to the external physical attributes."}, {"time": 5721, "text": "And those are the things I think that you cannot teach."}, {"time": 5725, "text": "Those things, you come in the door and you either have that or you don't."}, {"time": 5728, "text": "I think, and we talk about this all the time, and this is one of the things where my mind changes regularly."}, {"time": 5734, "text": "Like on what makes a fighter, is it born or is it bred?"}, {"time": 5737, "text": "And this week I'm of the opinion that it's in you."}, {"time": 5742, "text": "And maybe it's in you and you suppress it and people can tease it out of you, but I don't think you can make someone who doesn't have that seed in there."}, {"time": 5749, "text": "I don't think you can turn them into that great warrior with that level of grit and mental toughness."}, {"time": 5756, "text": "Now, when that fight, when Kyle fights Zabit, it's a unique situation for both guys."}, {"time": 5762, "text": "It was kind of a later replacement fight for Kyle."}, {"time": 5766, "text": "Zabit's star was on the rise."}, {"time": 5768, "text": "And Kyle put the blueprint out there on how to beat Zabit."}, {"time": 5773, "text": "Which is pressure him and try and drag him into the late rounds."}, {"time": 5776, "text": "You notice that later on when Calvin Kader fought him, they wouldn't give him five rounds."}, {"time": 5781, "text": "They wanted five rounds."}, {"time": 5782, "text": "And Zabit's camp, from what I understand, would not agree to the five round fight."}, {"time": 5786, "text": "Well, he didn't look."}, {"time": 5788, "text": "Right, so with Kyle, it was a three round fight."}, {"time": 5790, "text": "Three round fight."}, {"time": 5791, "text": "And did it went to decision?"}, {"time": 5793, "text": "It went to decision."}, {"time": 5794, "text": "Well, Zabit won the decision, clearly."}, {"time": 5796, "text": "Did Kyle have a shot at winning the third round?"}, {"time": 5799, "text": "I don't remember the exact score, but Kyle could have won the third round had he done a couple things differently."}, {"time": 5806, "text": "But I do believe in the fourth round, I think Kyle wouldn't have won a fourth round."}, {"time": 5810, "text": "And I think maybe even won the fight if there would have been a fifth round."}, {"time": 5813, "text": "And he was pressing forward, perhaps in a funny way that you could tell me I'm wrong, but it felt like he wasn't emphasizing head movement at that point."}, {"time": 5824, "text": "He went full Mike Tyson."}, {"time": 5825, "text": "There was a point at which, so it's funny that you say that."}, {"time": 5829, "text": "Which is a contradiction, actually, because."}, {"time": 5831, "text": "Mike Tyson had great head movement."}, {"time": 5832, "text": "I actually don't know exactly what I mean because he was in the pocket."}, {"time": 5837, "text": "I think he was trying to do the movement."}, {"time": 5839, "text": "He was just in the pocket and pressing forward."}, {"time": 5841, "text": "And the fuck you attitude of just not pressing down."}, {"time": 5843, "text": "That was a little bit later when Zabit's back was towards the cage."}, {"time": 5846, "text": "Towards the end of the round."}, {"time": 5848, "text": "We get that fight."}, {"time": 5850, "text": "And I said to Kyle, I was like, look, this kid has been training martial arts since he was three years old."}, {"time": 5856, "text": "There's not an area where you're gonna out technique him."}, {"time": 5859, "text": "And so we've gotta now channel some of that grit that we know you have."}, {"time": 5862, "text": "This is an opportunity to showcase it."}, {"time": 5864, "text": "And I don't know how long I did it for, because Kyle's much shorter than Zabit."}, {"time": 5869, "text": "So for a good long while, while we were training for Zabit, I didn't even say anything."}, {"time": 5873, "text": "And I just had clips of Mike Tyson training on the TV in the gym and the head movement."}, {"time": 5878, "text": "And I didn't even mention it."}, {"time": 5879, "text": "And then we started to like get into it and talk about getting inside the length of the longer fighter and things like that."}, {"time": 5886, "text": "And we kind of, which when some people train MMA, they say, okay, this guy's a really good wrestler."}, {"time": 5892, "text": "Let's think about avoiding the wrestling or being a better wrestler."}, {"time": 5896, "text": "And I think that when the difference in skill is so great, those are both the wrong answer."}, {"time": 5904, "text": "If a guy who's a really good wrestler wants to take you down and you don't have a lot of wrestling experience, he's probably gonna get you down if he's got a good coach, right?"}, {"time": 5910, "text": "So you have to deal with that."}, {"time": 5912, "text": "To then say, I'm gonna then learn in eight weeks how to wrestle better than a guy who's been wrestling since he was eight years old is also a bad idea."}, {"time": 5919, "text": "So what we concentrated on for that camp and it worked beautifully was not getting caught in chain wrestling."}, {"time": 5925, "text": "These are the takedowns you're gonna get caught with."}, {"time": 5928, "text": "This is how to not get caught with the next step while you're defending takedown one."}, {"time": 5932, "text": "Cause it's the chain of techniques that are gonna get fucked, right?"}, {"time": 5936, "text": "So we talked, we did a ton of work on get ups and breaking the hands from the various takedowns."}, {"time": 5941, "text": "Like it was a while ago now."}, {"time": 5942, "text": "So I don't remember exactly the techniques we worked on, but we concentrated on defend the first takedown and stay out of the chain."}, {"time": 5950, "text": "Don't get chained into a bunch of wrestling techniques cause you will be out wrestled."}, {"time": 5954, "text": "And that was really successful."}, {"time": 5956, "text": "And then in the third round, Zabit was tired."}, {"time": 5959, "text": "He was tired."}, {"time": 5960, "text": "He's Zabit got tired."}, {"time": 5961, "text": "He cuts a tremendous amount of weight."}, {"time": 5963, "text": "Like I can't see him staying at 145 forever when they start giving him five round fights."}, {"time": 5968, "text": "I don't even know if he's had a five round fight and he may have, but I can't see him staying down there."}, {"time": 5972, "text": "He's, the guy's like six one."}, {"time": 5975, "text": "Guys, he's a giant of a guy."}, {"time": 5976, "text": "So Kyle pressed forward there and he said, he felt that there was no power left in Zabit's hands."}, {"time": 5983, "text": "And so he felt fine."}, {"time": 5984, "text": "And I think part of it was he fed off the crowd as he moved forward and, you know, saw that he wasn't taking a lot of damage."}, {"time": 5994, "text": "Like the punches weren't staying him."}, {"time": 5996, "text": "He started walking right through him."}, {"time": 5998, "text": "It goes to your question of what makes a fighter."}, {"time": 6001, "text": "Was the, him walking forward like that, something that you're born with or is that something you were training?"}, {"time": 6009, "text": "Is that the Mike Tyson on TV?"}, {"time": 6011, "text": "He's born with that."}, {"time": 6012, "text": "Kyle is born with that."}, {"time": 6014, "text": "And the crowd, I've been in a lot."}, {"time": 6016, "text": "Was he in Boston?"}, {"time": 6017, "text": "No, he was in New York."}, {"time": 6018, "text": "He was in Brooklyn."}, {"time": 6019, "text": "I've been in a lot of arenas for a lot of different sporting events."}, {"time": 6021, "text": "That's one of the loudest things I've ever heard when he did that."}, {"time": 6024, "text": "I was going crazy."}, {"time": 6026, "text": "And you ask about that being like taught or not."}, {"time": 6029, "text": "Kyle is so much like that, that I have to try and tease some of that out of him, pull it back."}, {"time": 6034, "text": "Because he's also so very technical when he wants to be that the emotion and the fun of it gets in the way of his technique."}, {"time": 6043, "text": "And probably has cost him a couple of wins."}, {"time": 6047, "text": "And so that's one of the things we work on with him right now."}, {"time": 6049, "text": "It's like staying within yourself, being a professional, taking your time to download the information in round one and then starting your fight in round two."}, {"time": 6056, "text": "But the tension between those two things, what makes, what on that day created one of the, in my opinion, one of the greatest fights I've ever seen."}, {"time": 6066, "text": "Joe Rogan agrees."}, {"time": 6067, "text": "Yeah, it's one of the greatest fights I've certainly ever seen."}, {"time": 6070, "text": "So like, it's funny that you as a coach, I can see the frustration of like, like throwing away some of the strategy kind of thing."}, {"time": 6080, "text": "Like you seeing like being not happy that there could be things that he could have done to win the fight."}, {"time": 6086, "text": "It's in retrospect."}, {"time": 6086, "text": "I think that at that time, we were playing with incredible house money."}, {"time": 6090, "text": "Like Kyle was a gigantic underdog in that fight."}, {"time": 6093, "text": "Zabit was unstoppable."}, {"time": 6094, "text": "I think people were probably picking him to finish the fight in round one."}, {"time": 6097, "text": "I think at that point, no one had ever gone the distance with Zabit."}, {"time": 6100, "text": "And no one certainly had, you know, put that kind of performance together."}, {"time": 6103, "text": "And I think Kyle put the blueprint out there."}, {"time": 6107, "text": "And in retrospect, when I look at the last round, yeah, there were things that could have been done differently, but we're playing with house money at that point."}, {"time": 6115, "text": "Like, I mean, let it fly."}, {"time": 6117, "text": "You get to a point where you've got it, you're down three rounds and there's 20 seconds left."}, {"time": 6121, "text": "You got to move all your chips to the center of the table and, you know, see what happens."}, {"time": 6125, "text": "Do you remember what Joe Rogan said about it?"}, {"time": 6127, "text": "I remember like he got won over."}, {"time": 6129, "text": "I think I have trouble remembering because offline we talked about that fight and he's exceptionally impressed by, I mean, Joe's from Boston, so it's like, I mean, there's a story there."}, {"time": 6140, "text": "Okay, it sucks not, you naturally want to romanticize, like there's a Rocky versus like, there's a Rocky IV, a Draga."}, {"time": 6150, "text": "I mean, similar, I suppose, kind of chemistry."}, {"time": 6155, "text": "Kyle's style represents the American."}, {"time": 6159, "text": "Ideal, right?"}, {"time": 6160, "text": "The spirit."}, {"time": 6161, "text": "Yeah, I mean, he's from Gloucester."}, {"time": 6162, "text": "It's like, you could have dragged him off the docks three hours before the fight and said, hey, you want to go fight?"}, {"time": 6168, "text": "And he would have said yes."}, {"time": 6170, "text": "Oh man, that was a special fight."}, {"time": 6171, "text": "But that's, as per a discussion of like greatest fighters of all time, I tend to believe that that fight is more special than the championship belt defenses by George St. Pierre."}, {"time": 6184, "text": "Like, you know, there's something to that."}, {"time": 6186, "text": "It's like Rocky, Rocky I is more special than like Rocky III, right?"}, {"time": 6195, "text": "So like, it's the underdog or it's whatever, like the dance partner is like going to war and like that moment, I mean, it's bigger."}, {"time": 6204, "text": "It's bigger than any individual fighter."}, {"time": 6206, "text": "They create that and that, I know it's not perhaps good for a career."}, {"time": 6212, "text": "It's not good for like in terms of money, in terms of longevity, in terms of all those kinds of things, but that's a special moment in the history of fighting that you both created."}, {"time": 6220, "text": "I can remember like right after, like there was so much excitement in the air during the third round."}, {"time": 6226, "text": "And I remember being in the corner and like, I was so excited at the end of it that I had forgotten what happened in the other two rounds."}, {"time": 6233, "text": "I didn't even know."}, {"time": 6233, "text": "And I looked to Sean, one of the other corner men, and I think I said to him, did we win?"}, {"time": 6238, "text": "When you rewatch the fight, clearly we didn't win the fight."}, {"time": 6241, "text": "I mean, we lost the other rounds, but I got so caught up in that moment and I just remember like, I was so in awe of his performance that like I forgot what was going on."}, {"time": 6252, "text": "And it's so hard to not be a fan at that moment and to stay within yourself and try and like coach, but then what the fuck you even coaching at that point?"}, {"time": 6260, "text": "It's like, we're rumbling."}, {"time": 6261, "text": "We got 30 seconds."}, {"time": 6262, "text": "We're trying to win here."}, {"time": 6263, "text": "And I remember like the performance itself, I'm not a fan of moral victories, but if ever there was gonna be one, that was one."}, {"time": 6270, "text": "And when the fight was over and I grabbed Kyle, like they hadn't even been to the center of the cage yet."}, {"time": 6275, "text": "And I just hugged him and I said, you're my fucking hero."}, {"time": 6278, "text": "And I remember being very emotional about that, that I was able to be a part of that."}, {"time": 6283, "text": "It feels wrong to say, but I was, I kind of avoided saying it, but I think if I'm being honest with my feelings, this is a safe space for feelings."}, {"time": 6292, "text": "Is I think it was the greatest mixed martial arts fight I've ever seen."}, {"time": 6299, "text": "And I don't think I'm being biased."}, {"time": 6300, "text": "I was honestly thinking like, am I being biased?"}, {"time": 6302, "text": "I honestly don't think so."}, {"time": 6305, "text": "I think that was the greatest fight."}, {"time": 6306, "text": "Like if you wanna rank fights I've ever seen, I think to me that was the greatest fight I've ever seen."}, {"time": 6310, "text": "It certainly was one of the greatest displays of like just dogged effort from an underdog who was out experienced and probably outsized."}, {"time": 6322, "text": "But I mean, like you just, Kyle's one of those kids, you're never gonna tell him he's out of a fight."}, {"time": 6327, "text": "He has something you can't teach."}, {"time": 6329, "text": "And I've seen tons of people with more physical attributes and they're just mental midgets and they got a million dollar body and a 50 cent heart."}, {"time": 6339, "text": "And Kyle is not that."}, {"time": 6342, "text": "And you can't teach it no matter what you do."}, {"time": 6344, "text": "But that was, I would say like my career in combat sports, which spans, if you wanna go all the way back to like wrestling, like that was one of probably the greatest experiences I've been a part of."}, {"time": 6357, "text": "It's a bittersweet sport."}, {"time": 6358, "text": "She's a fickle mistress."}, {"time": 6361, "text": "Yeah, I mean, the tragic aspect of that is like, I guess Kyle lost, right?"}, {"time": 6370, "text": "So like if you look at the record and all the kind of things, perhaps like you look at the career, maybe like as a financial, from a financial perspective that perhaps is not the greatest thing for Kyle's career or that or in the history of the UFC, perhaps it's not like maybe many people didn't even watch that fight, but it was a special moment that stands in the history."}, {"time": 6400, "text": "There's not many of these in the history of fighting."}, {"time": 6404, "text": "But at the end of the day, when you look at someone's career in the UFC, like financially, there's a handful of people that make real money."}, {"time": 6414, "text": "Everybody else makes nothing."}, {"time": 6416, "text": "There's a handful of people that make real money."}, {"time": 6418, "text": "So did that loss cost him in the near term?"}, {"time": 6422, "text": "Sure, but when you look back on your life, you're not gonna look back on that loss as something that derailed my life financially and I never recovered from it."}, {"time": 6428, "text": "That's not gonna happen."}, {"time": 6430, "text": "Like the sad thing is, is unless you were a champion and most people are gonna be forgotten right after they're gone."}, {"time": 6436, "text": "Most people will be forgotten."}, {"time": 6438, "text": "And if you're not forgotten, certainly your accolades are gonna be misrepresented."}, {"time": 6442, "text": "Either they're gonna be inflated or diminished one way or the other."}, {"time": 6445, "text": "So looking back on it, it's just so hard to quantify that."}, {"time": 6451, "text": "But it's an experience."}, {"time": 6452, "text": "And when you're in that moment and you're one of the people intimately involved in it, the value of that experience supersedes any financial gain."}, {"time": 6464, "text": "Where would you put Khabib in the discussion of the greatest of all time?"}, {"time": 6468, "text": "So you recently, we worked together, we watched the fight of him and Justin Gaethje and Khabib retired."}, {"time": 6478, "text": "Would you put him up there as one of the greatest or did he never truly find his foil, like the great warrior that challenged him?"}, {"time": 6488, "text": "And maybe do you think he's fully retired now?"}, {"time": 6493, "text": "To answer the question about being fully retired, I don't have any idea."}, {"time": 6496, "text": "I can't for a second pretend to think that I understand the way that people from that part of the world think and respect their family and things like that."}, {"time": 6506, "text": "To an American who says, oh, I promised my mom I wouldn't do it."}, {"time": 6509, "text": "I mean, I promised my mom I wouldn't do a lot of things."}, {"time": 6511, "text": "I went right out the fucking back door and did them."}, {"time": 6513, "text": "But I think that that means something different to people in different parts of the world."}, {"time": 6517, "text": "So I have no idea what kind of weight that carries."}, {"time": 6521, "text": "So I can't answer that."}, {"time": 6522, "text": "I can say a lot of times when people think about great fighters, they think about the aspects that make up MMA."}, {"time": 6530, "text": "Like they think of MMA as a pie and they're all these different pieces that make up the pie."}, {"time": 6536, "text": "And how good is this piece?"}, {"time": 6539, "text": "When the fact of the matter is is you only need one really, really, really good piece."}, {"time": 6545, "text": "And the other pieces are complimentary pieces to get you to where you're the strongest."}, {"time": 6550, "text": "And if you want to tell me that Khabib's not the greatest MMA fighter because he doesn't have really slick striking, you can make that argument."}, {"time": 6559, "text": "But what I can tell you is Khabib has good enough striking to get him to his grappling where he is clearly the best guy at 155 they've ever seen."}, {"time": 6567, "text": "So does that make him the greatest fighter in that division or not?"}, {"time": 6571, "text": "To your point about the foil, they wanted Connor to be his foil and he just manhandled them."}, {"time": 6577, "text": "I mean, they wanted that to happen."}, {"time": 6579, "text": "Did not happen."}, {"time": 6580, "text": "Well, there's a kind of argument to be made which we kind of, now you get haters in this argument and you're going to be one of the haters because I know your, how should I put it?"}, {"time": 6593, "text": "Lack of admiration for Connor McGregor."}, {"time": 6599, "text": "But, what is it?"}, {"time": 6601, "text": "Football is a game of inches?"}, {"time": 6603, "text": "There's a sense where that Connor, there's an argument to be made that Connor wasn't exactly dominated, that he ended up being dominant, meaning, let me phrase it differently, is there's a lot of points in the fight that a different trajectory could have happened."}, {"time": 6624, "text": "So he wasn't so far from having a chance at winning that fight."}, {"time": 6628, "text": "It's just the end."}, {"time": 6630, "text": "You can focus."}, {"time": 6631, "text": "Those are the most important moments at the end."}, {"time": 6634, "text": "You've lost the most important moments."}, {"time": 6635, "text": "Right, but the road less taken."}, {"time": 6637, "text": "It could have been, if he didn't lose those very important moments, he had a chance."}, {"time": 6643, "text": "I'm saying out of all the people that Khabib fought, it's arguable that Connor was up there of the people that had a chance."}, {"time": 6651, "text": "Let me say this first."}, {"time": 6654, "text": "I love."}, {"time": 6655, "text": "I'm going to get so much heat for this."}, {"time": 6656, "text": "I do love Khabib."}, {"time": 6657, "text": "I'm a huge Khabib fan because I'm a grappler first and foremost."}, {"time": 6661, "text": "Me too, because I'm also Russian."}, {"time": 6663, "text": "I love Khabib, calm down."}, {"time": 6666, "text": "When Connor came on the scene, I loved Connor because I'm an Irish American and I want to support him and things like that."}, {"time": 6672, "text": "And he was good fun."}, {"time": 6674, "text": "He got to be, for my personal taste, he got to be too much."}, {"time": 6680, "text": "Of all the people Khabib has fought, I would never fight Connor again if I were him."}, {"time": 6686, "text": "And I said this about the Diaz fight."}, {"time": 6689, "text": "Nate Diaz, who was one of my favorite fighters, has fought the exact same fight for 12 years."}, {"time": 6694, "text": "Connor will switch something up to give himself an edge."}, {"time": 6698, "text": "And I believe that Connor would figure something out in fight number two, I think, but I also thought that Gagey would give Khabib problems where it wouldn't be a matter of I'm going to out wrestle Khabib or become better at defending his wrestling takedowns."}, {"time": 6714, "text": "Connor would have figured out a way to not get wrestled."}, {"time": 6716, "text": "I feel like he's constantly changing."}, {"time": 6718, "text": "He's constantly evolving."}, {"time": 6720, "text": "And whether or not people realize it or not, I think Connor's one of the better overall athletes in MMA just from looking at his body and his movement and the way he's shaped."}, {"time": 6728, "text": "He's got a very tiny waist."}, {"time": 6730, "text": "He's got really pronounced glutes and shoulders."}, {"time": 6733, "text": "And I think he's a for real athlete."}, {"time": 6735, "text": "Whereas a lot of guys in MMA are not for real athletes."}, {"time": 6737, "text": "They're just good at one of the things that makes up MMA."}, {"time": 6741, "text": "I understand what you're saying about if this happened, if that happened, but I mean, you could say that about every single combat sports event ever."}, {"time": 6749, "text": "If Spinks's hook landed on Tyson, maybe that fight didn't end the way that it did, but you know what?"}, {"time": 6755, "text": "It didn't."}, {"time": 6756, "text": "You're absolutely right."}, {"time": 6757, "text": "But if we could talk about just Connor McGregor for a second, I can't wait to get your fan mail or hate mail."}, {"time": 6767, "text": "Speak to the innovation of Connor."}, {"time": 6770, "text": "I don't hear very many people making this argument, but is it possible to make an argument that Connor McGregor is one of the greatest fighters of all time?"}, {"time": 6780, "text": "It's an interesting argument."}, {"time": 6781, "text": "And the problem, the only problem with the argument is there's so much emotion on either side."}, {"time": 6786, "text": "Yeah, I had a conversation, sorry to interrupt, with Yaron Brook, who is a philosopher, objectivist, which is the philosophy of Ayn Rand."}, {"time": 6798, "text": "And the amount of emotion around that particular human is fascinating to me."}, {"time": 6803, "text": "It's similar to the amount of emotion around Donald Trump."}, {"time": 6807, "text": "You can think of different personalities, maybe Elon Musk."}, {"time": 6810, "text": "Those are the people that aren't willing to have their mind changed."}, {"time": 6812, "text": "They're too emotionally attached to the argument."}, {"time": 6814, "text": "Yeah, but it's weird that why do we, why some people inspire so much emotion and others don't?"}, {"time": 6822, "text": "But Connor McGregor, I feel like nobody's able to have a calm fight analysis of the guy."}, {"time": 6832, "text": "Look, to me, as just a fan of martial arts, like I studied judo, I love watching just hours of Olympic judo and appreciating the art form."}, {"time": 6844, "text": "Like I forget the humans involved."}, {"time": 6846, "text": "Teddy Renner, who's a heavyweight, the most probably the most dominant heavyweight in the history of judo, just studying his gripping, just the art of it."}, {"time": 6856, "text": "And who cares if there's shit talking?"}, {"time": 6858, "text": "Like to me, I put all of that aside and just look at the art."}, {"time": 6863, "text": "And like what I really appreciate about Connor McGregor is his innovation, like of movement, of maybe it's romanticized, maybe you can correct me."}, {"time": 6876, "text": "I'm just a Cheeto eating fan of mixed martial arts, but like I seem to detect more innovation than almost any other fighter that I've paid attention to in Connor McGregor."}, {"time": 6891, "text": "I think first, I'll answer in two parts."}, {"time": 6894, "text": "I think, well, I'm not gonna answer the first part."}, {"time": 6896, "text": "It's just a comment, because you didn't ask the question."}, {"time": 6898, "text": "What was the question?"}, {"time": 6899, "text": "I don't even remember."}, {"time": 6900, "text": "It's about how Connor McGregor fans are very emotional and Connor McGregor detractors are very emotional."}, {"time": 6907, "text": "I think fans become very emotional."}, {"time": 6909, "text": "They become cheerleaders of someone like Connor McGregor or Donald Trump, because they see that person exhibiting the qualities that they themselves lack."}, {"time": 6916, "text": "And so they become cheerleaders for that, right?"}, {"time": 6918, "text": "And I think that for the most part, people who are detractors of Connor McGregors, they're not really Connor McGregor detractors."}, {"time": 6925, "text": "They're detractors of Connor supporters."}, {"time": 6928, "text": "There's a beef that they have with the people in that bucket, right?"}, {"time": 6931, "text": "Like, it's not really a problem."}, {"time": 6933, "text": "And that applies probably in our current political climate, Donald Trump with the left and the right."}, {"time": 6939, "text": "It's more about like, they actually don't like on the other, the caricature, the most extreme versions of what they see in the supporters of the other side."}, {"time": 6951, "text": "But I think the more interesting thing is the fighter himself."}, {"time": 6953, "text": "So let's put the supporters aside."}, {"time": 6955, "text": "I would say that, you know, what some people know and some people don't know is that Connor's base is in karate and the karate style of Connor McGregor, Steven Thompson, of Lyoto Machida, that type of distance management, a lot of times we think as martial artists, we think that the sport version of the art we've chosen to pursue somehow taints the authenticity and the effectiveness of it."}, {"time": 6984, "text": "But point karate is what led to that in and out distance management style of Connor, of Lyoto and of Steven Thompson."}, {"time": 6991, "text": "They all kind of use it a little bit differently, but they use it very effectively, all three of them."}, {"time": 6996, "text": "And that comes from a world of trying to kind of like step in, land contact on you from my point and then get back out before you can counterstrike me, right?"}, {"time": 7007, "text": "And that's where that comes from."}, {"time": 7009, "text": "Connor is blessed to have a longer arms than someone his height probably normally has."}, {"time": 7014, "text": "And his movement is just so fluid."}, {"time": 7017, "text": "He's so athletic with the hinges of his body, the knees and the hips and the swivel of his body, which is also the hips and the shoulders."}, {"time": 7027, "text": "His movement, his distance, and the way he sets people up for the straight left hand while you're circling away from it and he can still land it, which is what he did to Chad Mendes."}, {"time": 7037, "text": "Hit him with a straight left while he was circling away from it."}, {"time": 7040, "text": "That is something that is very beautiful to watch."}, {"time": 7044, "text": "And sometimes people see the kicks and they see all the flashy snap kicks and the sidekicks."}, {"time": 7050, "text": "All that stuff is doing is setting people up for the left hand."}, {"time": 7054, "text": "It's all it's doing."}, {"time": 7054, "text": "It's you're corralling people, you're funneling people, or you're leading the dance and you're bringing them to a spot where you know you can land that left hand."}, {"time": 7061, "text": "And his ability to do that is masterful."}, {"time": 7065, "text": "People constantly shit on his ability to grapple because a couple of his losses have been to jujitsu guys or grapplers, but they've been to really good guys."}, {"time": 7075, "text": "Anyone who's gonna sit here and tell me Conor McGregor's not a good grappler, go grapple him."}, {"time": 7080, "text": "Let me see you grapple him."}, {"time": 7082, "text": "To that point, I'll also say a lot of people will use Conor McGregor's X guard sweep on Nate Diaz as evidence to his high level grappling in that fight, to which I would also counter, Nate Diaz didn't fight that off because he knew he was so much better at jujitsu off the bottom that he didn't even care if he got swept."}, {"time": 7099, "text": "So is Conor McGregor innovative?"}, {"time": 7103, "text": "Is he one of the best fighters ever?"}, {"time": 7105, "text": "It's tough to say because he's such a cash cow that he was fed people."}, {"time": 7108, "text": "I firmly believe no one who put that Conor McGregor Khabib fight together thought Khabib would win."}, {"time": 7118, "text": "I remember, so at that time it was not completely clear."}, {"time": 7122, "text": "There was a myth of the great Khabib."}, {"time": 7125, "text": "It wasn't completely clear how good is he really."}, {"time": 7129, "text": "And it was unclear how good is Conor also."}, {"time": 7135, "text": "Because I think to me, maybe part of my admiration of Conor McGregor is rooted in the fact that I thought there was no way he beats Jose Aldo and I thought there's definitely no way he beats Eddie Alvarez."}, {"time": 7149, "text": "And so like when he did, I was like, my brain was like, there's something broken."}, {"time": 7158, "text": "It was like shut down, like on windows, like froze."}, {"time": 7160, "text": "We have to rethink this."}, {"time": 7161, "text": "Like this is a special human."}, {"time": 7163, "text": "Now people who argue he's not even in the running of like top 20 is, if you look at the number of defenses, for example, of his belt that he had very, very little."}, {"time": 7172, "text": "But like to me, I'm one of those people is back to our discussion of like, do moments make great fighters?"}, {"time": 7178, "text": "That I think just being able to beat Jose Aldo and I would argue in his prime, some people might disagree in this, in a way where he like figures out the puzzle, gets in his head the entirety of the picture."}, {"time": 7193, "text": "And then to be, I mean, Eddie Alvarez, would he be considered a really strong wrestler?"}, {"time": 7200, "text": "Like, or not strong wrestler, strong striker and wrestler, the whole combination of it."}, {"time": 7206, "text": "And also what's the other wrestler he fought?"}, {"time": 7210, "text": "So let me comment on all those if I may."}, {"time": 7213, "text": "So I was at the Chad Mendes fight live."}, {"time": 7215, "text": "And there was a jujitsu tournament, we're out in Vegas."}, {"time": 7218, "text": "And so me and my best friend came out and we got some tickets."}, {"time": 7221, "text": "That night was supposed to be the first Aldo fight."}, {"time": 7224, "text": "Aldo got hurt, like right after I bought the tickets."}, {"time": 7227, "text": "They pulled Chad Mendes in."}, {"time": 7228, "text": "He was a little bit out of shape, whatever."}, {"time": 7230, "text": "You still got to fight the fight."}, {"time": 7232, "text": "But I don't want to use that fight as evidence to Conor's greatness because they pulled Chad Mendes in."}, {"time": 7239, "text": "He was like hunting and drinking beers in the woods and was a little out of shape."}, {"time": 7243, "text": "But if you want to talk about greatness, like that surpasses your in ring accomplishments."}, {"time": 7250, "text": "I was in the stands that night and the people that came from Ireland to see Conor fight that night, single handedly set the market for hotel room prices and airline tickets to Vegas that weekend."}, {"time": 7265, "text": "These motherfuckers were all dressed like Conor in the stands."}, {"time": 7269, "text": "They had wool suits on and big beards and the whole thing."}, {"time": 7272, "text": "I mean, they probably weren't pocket watches."}, {"time": 7274, "text": "I never saw more people trying to be someone else."}, {"time": 7279, "text": "Never saw more people try to be someone else."}, {"time": 7281, "text": "I mean, there's a level of, is there a level of greatness in that?"}, {"time": 7284, "text": "I mean, I don't know how to parse all that out."}, {"time": 7286, "text": "You're somebody who doesn't admire that."}, {"time": 7288, "text": "I love that in the sense, the following sense, I think."}, {"time": 7291, "text": "And people don't seem to hold this belief at all, but to me, fighting is not just, this isn't like a quiet street fight that nobody watches."}, {"time": 7302, "text": "This is also a spectacle."}, {"time": 7303, "text": "This is also a story."}, {"time": 7305, "text": "There's like, there's a professional wrestling element to this."}, {"time": 7309, "text": "This is not, like you think it's just about fighting."}, {"time": 7311, "text": "If it was just about fighting, you wouldn't, I mean, there's a story to it, I guess, is what I'm trying to get to."}, {"time": 7318, "text": "And greatness has to incorporate that."}, {"time": 7321, "text": "People that criticize, again, I might be wrong on this, but I honestly think that Conor McGregor, not nearly as much as Khabib, but he's a true martial artist."}, {"time": 7333, "text": "I think he respects his opponents despite the talk."}, {"time": 7337, "text": "Maybe I'm misreading it, but it feels like he is a storyteller, like Chael Sonnen type of like, he's constructed this image to play the story, like just the way he acts after the fight, the honor he shows to his opponents."}, {"time": 7353, "text": "There's a real martial artist in there, and to dismiss the fact that the story of the fight is part of it, because he doesn't just shit talk."}, {"time": 7364, "text": "This is what people don't seem to understand."}, {"time": 7366, "text": "He's good at shit talking."}, {"time": 7368, "text": "Very good, and I'm with you on basically everything you said."}, {"time": 7373, "text": "I think that there's greatness to that, and I think that he understands how to sell a fight, and I think what he did to Jose Aldo by getting in his head helped him win that fight."}, {"time": 7388, "text": "He insulted Jose Aldo and his country so much that he knew Aldo was gonna come forward right into that left hook."}, {"time": 7395, "text": "Was that fight in Brazil, by the way?"}, {"time": 7397, "text": "Do you remember?"}, {"time": 7398, "text": "I don't recall."}, {"time": 7399, "text": "Because I know he insulted all of Brazil, but I'm not sure if it was in Brazil."}, {"time": 7402, "text": "But when he tried to do that to Khabib, you could tell that he just was not gonna get in Khabib's head."}, {"time": 7406, "text": "Khabib was unflappable."}, {"time": 7407, "text": "But there is definitely something great about how he moves people."}, {"time": 7413, "text": "The Irish are like, I mean, Conor's walkout music, for people from Ireland of Irish descent, that shit is like very deep."}, {"time": 7423, "text": "You know, it's a very emotional song."}, {"time": 7427, "text": "I was, to be honest, a little bit upset with Khabib, that he didn't rise."}, {"time": 7434, "text": "I admire that entire culture."}, {"time": 7436, "text": "But there's an aspect to where he could have risen to the occasion of there's the same kind of depth of love of country that Russia has."}, {"time": 7450, "text": "Is there in Dagestan?"}, {"time": 7451, "text": "Dagestan is a little weird in terms of like, but he could have, especially with Putin's support, wear for a bit the full Russian hat of like this is the great nation."}, {"time": 7463, "text": "Like rise above the culture of Dagestan, which is a small town boy with the small town values of family and all those kinds of things."}, {"time": 7473, "text": "There's a moment where you inspire entire nations."}, {"time": 7476, "text": "Like the step up and be the foil to the great Conor McGregor where also Khabib becomes the foil to, like both of them are the foil to each other and become like, that fight was already a great fight, right?"}, {"time": 7494, "text": "But it could have been something historic."}, {"time": 7497, "text": "Ali versus Fred, I mean, it could have been really historic."}, {"time": 7500, "text": "And I would argue, I guess the biggest disappointment I have, and I understand it and I also honor it as a martial artist, but to, I'm disappointed that Khabib doesn't seem to even consider the possibility of doing in Moscow fight number two, and because that could be narrative wise if they do it right, that's one of the, could be one of the greatest fights in history."}, {"time": 7529, "text": "Yeah, I think in terms of Khabib and inspiring a country, is it possible that by staying true to the values that he had his entire career and getting to the zenith of his art form and still doing it in that humble way, isn't it possible that that inspires?"}, {"time": 7550, "text": "Yeah, 100%, so I should clarify that I think they're just hearing from people, from my fellow comrades, no, is they love that."}, {"time": 7561, "text": "They love that, but they."}, {"time": 7566, "text": "There's also a brash, beer chugging, shit talking thing that people really like about Connor, and I do love that."}, {"time": 7572, "text": "But the beautiful narrative would have been the clash, the real clash of those cultures."}, {"time": 7577, "text": "So Khabib chooses to live the culture by walking away."}, {"time": 7583, "text": "There's also like a clash of them sort of walking, not walking away from the fire, but walking into the fire of this brashness."}, {"time": 7593, "text": "It's the sort of the cool collected calmness of the Dagestan people."}, {"time": 7601, "text": "It's like you were talking about the Saitya brothers."}, {"time": 7603, "text": "So they just view it totally differently."}, {"time": 7606, "text": "And there are stereotypes about the Irish where they're maybe potentially a louder, more boisterous culture."}, {"time": 7615, "text": "Haven't heard of that, yeah."}, {"time": 7617, "text": "And I mean, I thought they each played their part perfectly."}, {"time": 7621, "text": "And all those things that you're describing could have happened."}, {"time": 7625, "text": "Maybe Khabib steps up and he carries the proverbial flag, so to speak, for a nation of people and they go to battle."}, {"time": 7630, "text": "But the fight, if it plays out the same way, is still the fight."}, {"time": 7633, "text": "And it was an okay fight."}, {"time": 7636, "text": "It wasn't a great fight."}, {"time": 7637, "text": "It was, you know, the fight was okay."}, {"time": 7641, "text": "And I think that, again, I don't have any idea what Khabib's obligations to his family are."}, {"time": 7648, "text": "I don't think either of those guys want for more money."}, {"time": 7654, "text": "To do another fight is just a legacy thing."}, {"time": 7658, "text": "It's just about fulfilling some part of a legacy."}, {"time": 7664, "text": "And I just, I admire the possibility of a great legacy that is bigger than either of the fighters."}, {"time": 7671, "text": "I think with Khabib, he kind of, he's not as concerned about legacy, I think."}, {"time": 7678, "text": "There's a..."}, {"time": 7679, "text": "Your promoter's dream, because you want the rematch, and the only thing that makes more money than the rematch is the trilogy."}, {"time": 7685, "text": "You gotta split the rematch, you hope Conor wins, and then you have the trilogy fight."}, {"time": 7690, "text": "And now you're all in."}, {"time": 7693, "text": "Yeah, I can't get into Khabib's head, but I know Putin, just the game, the entirety of it, especially at the time, especially if it was Trump as president, if he was as president at the time, and Putin, and in Russia, and just knowing how masterful Conor is at, because Conor would be a different Conor."}, {"time": 7717, "text": "I think he would be a calmer Conor."}, {"time": 7719, "text": "There would be a different, because you don't wanna be over the top Conor with the Russian people."}, {"time": 7724, "text": "Right, no, that's..."}, {"time": 7726, "text": "It's like, ah, this is dangerous ground."}, {"time": 7728, "text": "See, that was the episode in the hotel in Brooklyn when some of the Russian guys confronted Artem, and then Conor came over."}, {"time": 7740, "text": "It's not, but the danger of that."}, {"time": 7742, "text": "I mean, there is the element of just like real danger, and the real, it was almost of war."}, {"time": 7748, "text": "It's, I don't know, it's..."}, {"time": 7751, "text": "It was like when Chael Sonnen was talking so much smack, maybe it was against Vanderlei Silva."}, {"time": 7757, "text": "I don't know, and it was one of those fights where they just didn't think he was gonna make it out of Brazil."}, {"time": 7762, "text": "Americans don't get it."}, {"time": 7765, "text": "People take some of that shit in different parts of the world very, very seriously."}, {"time": 7768, "text": "Yeah, but that's what makes it beautiful."}, {"time": 7770, "text": "That's what makes a great story, and I think fighting is very much about the stories, not just about the particular outcomes of a fight, or the skillset matching, or the chess of the fight."}, {"time": 7783, "text": "It's also about the story of the greater, like context of societies, of warring."}, {"time": 7791, "text": "We're like warring cultures, but we're still, we're still good, we're no longer can have great, big, hot wars between nations because of nuclear weapons."}, {"time": 7803, "text": "This is our wars that we can have, and in some sense, I feel robbed of the great war that could have happened."}, {"time": 7811, "text": "It doesn't mean there aren't lots of wars going on, but yeah, the big one is not gonna happen."}, {"time": 7816, "text": "There's too much of a balance of power with nuclear weapons and technology and stuff, but it's not the end of war."}, {"time": 7824, "text": "Do you think there's always gonna be war?"}, {"time": 7827, "text": "I think there'll always be war, especially in underdeveloped parts of the world."}, {"time": 7831, "text": "Isn't there always underdeveloped, relatively, parts of the world?"}, {"time": 7835, "text": "Yeah, I mean, at some point, though, you'd think, I mean, the way that technology's expanding and we're bringing technology to weird parts of the world that you wouldn't think of as technologically advanced, the way that the Chinese are inhabiting certain areas for mining purposes and things like that, I think underdeveloped parts of the world will get developed quickly."}, {"time": 7859, "text": "I just wonder what the nature of that war might be."}, {"time": 7862, "text": "It could be cyber, it could be all those kinds of things."}, {"time": 7864, "text": "I think in developed nations, it's gonna be cyber."}, {"time": 7866, "text": "I think that's probably the next phase of war, but I mean, I think you talk about parts of the world like the Middle East, and it's just still gonna be warring tribal factions."}, {"time": 7873, "text": "We can't even begin to understand what those people are fighting about over there."}, {"time": 7877, "text": "Yet, everyone sitting in America on their couch has an opinion."}, {"time": 7882, "text": "You can't even begin to understand it."}, {"time": 7884, "text": "I sure can't."}, {"time": 7885, "text": "Yeah, it's back to the principle discussion, when what's violated is much deeper than just kind of anything we can even, in a middle class existence, can even comprehend."}, {"time": 7898, "text": "A lot of times, American soldiers will go to war because that's what they're told to do, and maybe they disagree with the orders, and maybe they agree with the orders, but I get a sense that people in the Middle East fighting all believe in what they're fighting for."}, {"time": 7909, "text": "It's not a thing where they're told to go do it."}, {"time": 7913, "text": "I believe they really believe that what they're doing is the right thing, and they're defending some sort of principle."}, {"time": 7919, "text": "Are you generally optimistic about the future, speaking of war, of human civilization?"}, {"time": 7925, "text": "Do you think we'll, people talk about the Fermi Paradox and asking why haven't aliens visited us, if you believe they haven't visited us."}, {"time": 7941, "text": "One of the thoughts is that there's kind of a great filter that intelligent civilization reach a point where it destroys itself naturally, so that's why we haven't seen them."}, {"time": 7952, "text": "They don't last very long."}, {"time": 7954, "text": "There does seem to be a kind of, we seem to be advancing faster and faster and faster."}, {"time": 7959, "text": "We keep developing more and more powerful ways of destroying ourselves in all kinds of ways, not even, just even to say nuclear weapons alone, but there's all kinds of new ways, engineer pandemics, nanotechnology, AGI, all those kinds of things."}, {"time": 7978, "text": "It seems to be that the argument that we are going to destroy ourselves in some kind of creative way very shortly is not too crazy of an argument to make."}, {"time": 7993, "text": "Are you more optimistic or pessimistic about the prospects of human civilization in maybe the 22nd century?"}, {"time": 8001, "text": "Like, is it possible that your generation is the last generation to be alive on Earth?"}, {"time": 8006, "text": "No, but I wouldn't say that five generations from now that could be true."}, {"time": 8012, "text": "I guess I think of it really selfishly."}, {"time": 8014, "text": "I'm a big believer that when your time here on Earth is over, the overwhelmingly vast majority of people will be forgotten within 12 calendar months."}, {"time": 8024, "text": "People with no family will be forgotten sooner, and so I don't give a lot of thought to what will happen to Earth or mankind when I'm gone."}, {"time": 8032, "text": "I give more thought to maximizing my time here now, and I wanna do it in a way where I don't, I'm not overtly hindering the future of civilization or humankind, but I'm definitely taking a me first approach to how I live on Earth."}, {"time": 8050, "text": "Do you have a philosophy behind why you have or don't have kids on this topic?"}, {"time": 8056, "text": "Because for many people, when they have kids, there's a sense, it's almost like a genetic sense or something like that, where all of a sudden, you do start caring about what happens five generations from now."}, {"time": 8070, "text": "I mean, I think I'm just too selfish."}, {"time": 8074, "text": "I mean, I think that's the easy answer."}, {"time": 8077, "text": "Like, I know that your whole life has to change."}, {"time": 8080, "text": "You know, your focus, everything shifts, and just don't wanna do that."}, {"time": 8085, "text": "And also, I think that there's a level of, I guess if I have to really unpack it, there's probably a level of lack of hope in the future."}, {"time": 8096, "text": "Like, I don't think it's, I don't think the world and humanity is going in the right direction."}, {"time": 8102, "text": "What does the right direction look like?"}, {"time": 8104, "text": "I think the right direction looks like people coming back together in a more impactful human way, in person, touching, feeling, talking face to face."}, {"time": 8120, "text": "So all the things you're describing is what we had, as you mentioned before, when you were like a teenager."}, {"time": 8125, "text": "So the state of the world."}, {"time": 8127, "text": "But that's because your mind was formed then."}, {"time": 8129, "text": "It very well could be."}, {"time": 8132, "text": "It's very possible that the virtual reality worlds that we'll create will be actually a much higher level of existence."}, {"time": 8137, "text": "In fact, like now we're getting, we're moving slowly away from tribalism, perhaps you could argue the ideas of nations, and we're going, we're moving into the realm of ideas and it could be a higher form of existence where we're sort of moving past the constraints of our meat vehicles into the space of our minds."}, {"time": 8159, "text": "It depends what you value."}, {"time": 8160, "text": "Cause when you sit here and you talk about it, and you're talking about these things in these humongous levels, on these macro levels."}, {"time": 8167, "text": "And I don't think a lot of people view it that way."}, {"time": 8169, "text": "I think a lot of people view it as like, what kind of pizza am I getting tonight?"}, {"time": 8172, "text": "Like it's a much different outlook."}, {"time": 8174, "text": "And sure, the virtual world that's on the horizon, I'm sure it's got benefits and will help people, but is it gonna help the things that you find valuable?"}, {"time": 8185, "text": "Like, was it gonna help commerce?"}, {"time": 8187, "text": "Is that the thing you find the most valuable?"}, {"time": 8189, "text": "Is it gonna help communication?"}, {"time": 8191, "text": "Well, it'll help disseminating information."}, {"time": 8193, "text": "Is it gonna help explain the information you're disseminating?"}, {"time": 8197, "text": "Is it gonna hinder interpersonal communication?"}, {"time": 8200, "text": "And those are things I find valuable."}, {"time": 8202, "text": "Interpersonal communication, talking to people."}, {"time": 8204, "text": "Like it saddens me when I go into a restaurant and there's five year old kids who like, slamming away on an iPad and can't make eye contact with anybody or teenagers who don't say please and thank you when they order from the waitress."}, {"time": 8217, "text": "Like that to me is wrong."}, {"time": 8219, "text": "That shit's wrong."}, {"time": 8220, "text": "And I don't know this for a fact, but I do attribute that to using technology as a crutch when we're raising raising kids."}, {"time": 8228, "text": "So, you know, I think those are things that I find valuable."}, {"time": 8233, "text": "I tried to empathize."}, {"time": 8234, "text": "I mean, I agree with you as a person who grew up in a certain age, but like prior to the internet, I suppose."}, {"time": 8241, "text": "But, or at least solidified the early philosophies of the way I see the world prior to the internet."}, {"time": 8249, "text": "During the time of AOL, let's put it this way."}, {"time": 8253, "text": "Brr."}, {"time": 8253, "text": "Uh, what was your AIMS screen name?"}, {"time": 8256, "text": "I never had one."}, {"time": 8258, "text": "I was the last person I knew to get a cell phone."}, {"time": 8260, "text": "I was so anti all that stuff because I just felt like I didn't want to be a part of it."}, {"time": 8266, "text": "I did not want to be a part of it."}, {"time": 8267, "text": "I joined the underground forum about MMA in 2000 or 2001 when I first started training."}, {"time": 8274, "text": "I think right at the tail end, I got a MySpace, but I didn't have any of that stuff and I didn't want any of it."}, {"time": 8280, "text": "It just was, I was not into it."}, {"time": 8283, "text": "I felt like, like what are the good things that are going to come out of it?"}, {"time": 8287, "text": "Oh, I'm going to get my package in two days instead of four days?"}, {"time": 8291, "text": "Does that make my life better?"}, {"time": 8292, "text": "I try to, I try to deeply empathize with a lot of experiences of other people."}, {"time": 8297, "text": "And like one of the things I love, like the smell of paper books and books in general."}, {"time": 8302, "text": "And early on, this is like five years ago, I just gave away all my books."}, {"time": 8307, "text": "And I said, you know, I'm really going to try to fall in love with the books in the same way I did before, but now with a Kindle or not a Kindle, like paper, white, whatever, the ebook reader."}, {"time": 8320, "text": "And I'm still not there, but I've been kind of trying to fall in love with that experience."}, {"time": 8326, "text": "And the same way I try to think like, teenagers are really into TikTok now, like making these short videos."}, {"time": 8333, "text": "I try to consider the possibility that their existence will be a much happier one than I've had because of this kind of interaction."}, {"time": 8341, "text": "From my sort of skeptical perspective, it's like the attention span is so short, they don't really deeply think or deeply experience things."}, {"time": 8348, "text": "They construct a social layer that they present to the world and they work on creating this social layer, like the presentation to the world much more than really sitting alone with their thoughts and the sadnesses and their hopes and dreams and fears."}, {"time": 8363, "text": "And like working on the project that is their own, like actual person that exists in this physical world, as opposed to working on the project of a particular social platform that they show."}, {"time": 8375, "text": "But like, perhaps that project, like who cares who you are in the physical space?"}, {"time": 8382, "text": "Maybe what you are is what your Instagram shows."}, {"time": 8386, "text": "That's the more important project to work on."}, {"time": 8388, "text": "Well, what's reality?"}, {"time": 8389, "text": "Yeah, what's reality?"}, {"time": 8390, "text": "Perception is reality, right?"}, {"time": 8391, "text": "So how other people perceive this constructed thing, that's their reality of you."}, {"time": 8396, "text": "But is it your reality?"}, {"time": 8397, "text": "Like that, I mean, like we said earlier, it's how you want people to see you is very rarely in line with how you really are or how you see yourself."}, {"time": 8408, "text": "And I mean, I can remember being like a 13 year old kid and like when you go through a bunch of weird 13 year old kid shit, like sitting in my room, like turning a red light on and listening to like a sad record and like trying to figure out what's going on inside."}, {"time": 8423, "text": "Sometimes you like it, sometimes you don't like it."}, {"time": 8425, "text": "But I feel like those experiences are lost on kids constantly connected to a phone."}, {"time": 8429, "text": "And like, you know, I don't know what the remedy for those situations is nowadays."}, {"time": 8433, "text": "Like, I don't know, do they make a TikTok video?"}, {"time": 8435, "text": "Do they blog about it?"}, {"time": 8437, "text": "Do they, you know, make a video or a... Nobody blogs anymore, bro."}, {"time": 8440, "text": "Whatever, man."}, {"time": 8441, "text": "Or a video, a story about, oh, this is what happened to me and blah, blah, blah, blah, blah."}, {"time": 8448, "text": "Does that actually help them work it out?"}, {"time": 8450, "text": "Or does it just create more noise and more static on how to get to the root of the problem and learn about themselves?"}, {"time": 8455, "text": "I don't know what future social networks are exactly."}, {"time": 8458, "text": "I do know on a shallow level, it does feel good when somebody clicks like on something."}, {"time": 8463, "text": "I think that is more of a drug than an actual deep long lasting fulfilling happiness."}, {"time": 8469, "text": "But perhaps there's a way to make a social network that does lead to long lasting happiness that's somehow detached from the physical meat space."}, {"time": 8478, "text": "I don't know, but it feels like you want to give that a chance."}, {"time": 8481, "text": "Do you think when people are liking things on social media, do you think there's just a group of people, an overwhelming majority of people that are gonna like whatever you put out there, they're clicking like, and then there's another section of people that just constantly scroll and like, scroll and like, and scroll and like."}, {"time": 8497, "text": "Like, do you think when you get a like on content you put out, that that like perhaps came from someone who normally doesn't like your content, but like you've just changed their mind on something, you've turned them around on it."}, {"time": 8512, "text": "I tend to think that when I get likes on social media, those are just the people that like all my shit no matter what I say."}, {"time": 8517, "text": "Like they probably don't even read it."}, {"time": 8519, "text": "Like I could put the most preposterous thing up there and you're still gonna get a handful of the same exact likes."}, {"time": 8525, "text": "But I tend to, the way I see likes, you're kind of, you said multiple things."}, {"time": 8530, "text": "I think in one sense you see social media as like a battleground of ideas and like is a kind of indicated, like the best possible like is an indicator of like, of you winning over somebody on an idea and they really appreciate that idea."}, {"time": 8546, "text": "That's the best possible like."}, {"time": 8547, "text": "To me, a like is just two strangers smiling at each other."}, {"time": 8551, "text": "Like a moment of like, like."}, {"time": 8555, "text": "I got you, bro."}, {"time": 8556, "text": "Yeah, I got you, bro."}, {"time": 8558, "text": "Yeah, like fist bump."}, {"time": 8559, "text": "Like, yeah, we're in this fucking thing together."}, {"time": 8562, "text": "This whole thing doesn't make any sense, but we're in this together."}, {"time": 8564, "text": "And yeah, it's possible for likes to be that."}, {"time": 8568, "text": "I don't think the actual clicking of a like, I think social media at its best might be that where it's like, I got you, bro."}, {"time": 8576, "text": "And it's a large scale as opposed to kind of this weird, like crazy pool of dopamine where everyone's just obsessed with this likes and likes and then the division drives like more of this like weird, anxious engagement."}, {"time": 8596, "text": "I think that's just the dark version of it in the early days of social media."}, {"time": 8599, "text": "I think you called it a battleground of ideas, but I think social media is nothing but a battleground of fragile egos."}, {"time": 8607, "text": "Well, but humans are fragile egos."}, {"time": 8609, "text": "I mean, maybe, but I think the people, I think particularly on social media, they're the most fragile."}, {"time": 8617, "text": "Like, would you be doing all the things you're doing?"}, {"time": 8621, "text": "What would you be doing if you weren't, if you weren't podcasting and posting the things you do on social media, what would you be doing?"}, {"time": 8632, "text": "You'd probably be much the same guy, right?"}, {"time": 8635, "text": "But I think that on social media, the fragile ego people, what you see on social media is not what they'd be doing without social media."}, {"time": 8643, "text": "Does that make any sense?"}, {"time": 8644, "text": "Like you're probably, your mission is probably somewhat congruent, your path."}, {"time": 8649, "text": "You're just utilizing social media."}, {"time": 8650, "text": "But I think a lot of people, social media has changed their path and now they're doing something totally foreign to them."}, {"time": 8660, "text": "And they're only able to do it maybe because of social media."}, {"time": 8663, "text": "I think you're focusing on a particular moment in time of people in their less great moments, like in their less great version of themselves."}, {"time": 8674, "text": "I think you're just focusing on the masses struggling to become the best version of themselves."}, {"time": 8679, "text": "And then you, yeah, sure."}, {"time": 8681, "text": "For stretches of time, whether it's days, weeks, and months, you could be a shady person on the internet."}, {"time": 8687, "text": "I think you're focusing on that."}, {"time": 8691, "text": "And unfortunately, social media platforms emphasize they love it when you're like that, when you're not doing great in your own life because it increases anxiety, increases engagement, makes you more susceptible to an argument, and then really get pulled into like conspiracy theories, all that kind of stuff."}, {"time": 8711, "text": "But the other side works too."}, {"time": 8712, "text": "I think there's also the people who are on social media fronting like they're these positive figures and going to the gym, whatever it is, the positivity that they spew out."}, {"time": 8723, "text": "But in real life, they're the most negative fucks you've ever met in your life."}, {"time": 8726, "text": "And they're just so full of crap."}, {"time": 8727, "text": "And it's just people playing to an audience."}, {"time": 8730, "text": "It's like you said, it's like a politician sometimes."}, {"time": 8734, "text": "A politician wakes up one day and they decide, who's the group I can pander to the best to get the most likes equals votes?"}, {"time": 8740, "text": "And it's the same thing on social media."}, {"time": 8742, "text": "People wake up and whether it's conscious or not, what's the group I can pander to the best to get the most likes?"}, {"time": 8748, "text": "Is it the positivity motivated crowd?"}, {"time": 8750, "text": "Is it the woe is me crowd?"}, {"time": 8752, "text": "Like what is it?"}, {"time": 8753, "text": "Who's gonna give me the most likes?"}, {"time": 8754, "text": "That's what I'll do."}, {"time": 8757, "text": "I don't know how to argue against that."}, {"time": 8758, "text": "I guess it rings true what you're saying, but I just kind of refuse to believe it."}, {"time": 8765, "text": "I guess I'm pandering to the optimistic crowd."}, {"time": 8768, "text": "Like I met with my marketing team and I just feel that love has the best, what do you call it?"}, {"time": 8778, "text": "There's a lot of people that accuse me of being like exactly that, which is like, why are you always being positive?"}, {"time": 8782, "text": "It's like, well, cause I'd like to be that."}, {"time": 8786, "text": "Yeah, but I wouldn't consider you someone who panders."}, {"time": 8790, "text": "No, but I guess what I'm saying is like, it's easy to say that everyone is pandering, but like maybe they're just trying."}, {"time": 8802, "text": "I do believe that social media platforms could encourage people when they're trying to be the best version of themselves, whatever that is."}, {"time": 8808, "text": "It could be like Conor McGregor talking shit."}, {"time": 8810, "text": "It could be just being positive."}, {"time": 8812, "text": "It could be actually creating cool things in this world, putting out instructional videos for Jiu Jitsu or like inspiring students to competition."}, {"time": 8820, "text": "All those kinds of things, educational content."}, {"time": 8823, "text": "I think that people are trying."}, {"time": 8825, "text": "Like I tend to believe that people want to be good."}, {"time": 8829, "text": "Like they want to be successful in whatever that definition of success is."}, {"time": 8834, "text": "And they're kind of struggling to do that."}, {"time": 8835, "text": "And they're just awkward at it at first."}, {"time": 8838, "text": "And like, it's easy to focus on the awkwardness and the stumbling around as people have that."}, {"time": 8844, "text": "And they start shitting on each other."}, {"time": 8845, "text": "It's easy to kind of focus in on that."}, {"time": 8847, "text": "But I think that's just like people, you know, white belts."}, {"time": 8850, "text": "There's more white belts in the world than there are black belts."}, {"time": 8852, "text": "But you gotta give them a chance to kind of grow."}, {"time": 8854, "text": "I think on social media, if you put your stuff out there, whatever your stuff is, your content, your views or whatever, you let the chips fall where they may."}, {"time": 8861, "text": "Like that's a different thing than being like, I'm gonna tweak what I normally might say and put it up this way because I want these people to like it."}, {"time": 8870, "text": "And in terms, I also think I have a different viewpoint than you do on people wanting to be successful."}, {"time": 8876, "text": "I actually don't think that many people want to be successful."}, {"time": 8879, "text": "I think people want to have the appearance of wanting to be successful."}, {"time": 8884, "text": "But to be successful takes a shitload of work."}, {"time": 8886, "text": "And most people don't want to put that work in."}, {"time": 8888, "text": "So they craft this persona of a person who's trying really hard, but just can't catch the break or, you know, these motherfuckers with getting back on my grind."}, {"time": 8898, "text": "You've never been on a grind."}, {"time": 8899, "text": "You've been on the couch."}, {"time": 8900, "text": "I so disagree with you."}, {"time": 8904, "text": "That's your foil."}, {"time": 8905, "text": "You enjoyed that guy on the couch with the cheetah."}, {"time": 8907, "text": "That's your motivation."}, {"time": 8909, "text": "But just own it."}, {"time": 8910, "text": "Don't be like back on the ground, back on the couch."}, {"time": 8914, "text": "Well, you're like David Goggins, who was like talking shit to the one guy with the eating Cheetos."}, {"time": 8919, "text": "And so doing inspires millions to actually pursue their success."}, {"time": 8925, "text": "But I just think that most people really do want to be successful and are trying to work hard and they keep failing."}, {"time": 8934, "text": "But why is it continue?"}, {"time": 8935, "text": "I'm sorry to interrupt you."}, {"time": 8937, "text": "But like, let's take a person who's overweight."}, {"time": 8939, "text": "Do you not think that person wants to be skinny?"}, {"time": 8941, "text": "Of course they want to be skinny."}, {"time": 8942, "text": "They just don't want it enough to put the pizza or the pie down and go to the gym."}, {"time": 8947, "text": "They want it, but they want it to be easy."}, {"time": 8951, "text": "Well, everyone wants it to be easy."}, {"time": 8953, "text": "And of course people want to be successful, but do they want it enough to do the work?"}, {"time": 8959, "text": "I think the easy thing to do is to create an outward facing persona of the person who really wants it."}, {"time": 8968, "text": "And you get the same reward from a lot of people as the person who actually is successful."}, {"time": 8975, "text": "Very few people differentiate from the person who's found success and the person who's showing you how they're trying to get success on social media."}, {"time": 8983, "text": "People see that as the same."}, {"time": 8984, "text": "I see you're going after the marketing dollar that represents the people that want to work hard."}, {"time": 8994, "text": "You started a podcast recently."}, {"time": 8997, "text": "Hell yeah."}, {"time": 8998, "text": "It's called, which people probably from this conversation can, I guess we didn't really talk about politics much or the fact that you're a business owner or the fact that you're a red blooded American and love this country, America."}, {"time": 9012, "text": "We didn't really talk about that, but from the name of the podcast, they can probably infer it."}, {"time": 9016, "text": "And the name is Please Allow Me."}, {"time": 9024, "text": "What have you learned from doing this podcast?"}, {"time": 9027, "text": "What's your hope of doing this podcast?"}, {"time": 9030, "text": "People should definitely listen to it."}, {"time": 9031, "text": "You have a few episodes out."}, {"time": 9032, "text": "You're damn good at it, which is very interesting."}, {"time": 9036, "text": "I'm sure you'll evolve and change."}, {"time": 9038, "text": "So this is like the early days."}, {"time": 9040, "text": "I'm curious to see where it goes, but what's your thinking around it as an intellectual putting your thoughts out into the world?"}, {"time": 9048, "text": "I think that one of the things that COVID did when we're all kind of in lockdown was as a business owner, made me take stock of what's the future of brick and mortar businesses."}, {"time": 9059, "text": "And I've always been reluctant to be an online presence in any way, just because it's not my thing, because I believe that I'm a force of nature and people need to experience me, right?"}, {"time": 9070, "text": "And the few characters that Twitter has are phasing."}, {"time": 9073, "text": "It's not enough to experience."}, {"time": 9074, "text": "It's not enough."}, {"time": 9075, "text": "The force of nature, there's John Clark."}, {"time": 9077, "text": "I want you to feel physically uncomfortable around me."}, {"time": 9079, "text": "This has been three hours of me being physically uncomfortable."}, {"time": 9083, "text": "I'm scared for my life."}, {"time": 9085, "text": "And so I thought that that would be one of the ways in which I could increase."}, {"time": 9089, "text": "I came to the conclusion that with the lockdown and potential future lockdowns, in order to pay my mortgage and my bar tab and my Grubhub's out of control, that I would need to find ancillary ways to..."}, {"time": 9105, "text": "Door dash slash Lex."}, {"time": 9107, "text": "You don't want to use Grubhub, Grubhub sucks."}, {"time": 9110, "text": "They actually do."}, {"time": 9113, "text": "You can go back to your local fooder."}, {"time": 9115, "text": "711."}, {"time": 9116, "text": "Yeah, and get the food."}, {"time": 9117, "text": "You can order 711 from Door Dash."}, {"time": 9119, "text": "Or from Postmates."}, {"time": 9120, "text": "Code Lex."}, {"time": 9122, "text": "Okay, I'm sorry, go."}, {"time": 9124, "text": "But anyway, I thought it was like, oh, I should probably increase a little bit my online presence and what would be a way to do that that would be fun for me and entertaining."}, {"time": 9134, "text": "And I thought, well, a lot of people, yourself included, that I know have done some podcasts and I find that inspiring and I'm fortunate enough to know a bunch of cool motherfuckers that I can talk to about a wide range of topics."}, {"time": 9151, "text": "Then they're starting to drop in."}, {"time": 9152, "text": "There's an aspect to which podcasting does capture the force of nature better."}, {"time": 9156, "text": "In the digital form, podcasting captures the force of nature of a human being better than other mediums, perhaps."}, {"time": 9162, "text": "Yeah, definitely, there's that."}, {"time": 9163, "text": "I just felt like, you know when it's midnight and you're in the bar and you get the sense that the bar's gonna close in 90 minutes and you think, you know, not enough people have seen me yet and maybe we should go to another bar so more people can see me."}, {"time": 9180, "text": "I feel like podcasting is like that for me."}, {"time": 9183, "text": "Not enough people have heard my thoughts and I feel like, my mom raised me to be a giver."}, {"time": 9188, "text": "She didn't want me to be selfish."}, {"time": 9190, "text": "And I have these thoughts that I think."}, {"time": 9195, "text": "It'd be a waste if you didn't give it to the world."}, {"time": 9197, "text": "People seem to really enjoy them."}, {"time": 9198, "text": "Yeah, no, I enjoy them."}, {"time": 9200, "text": "While I've probably been on my best behavior today on this episode of the podcast."}, {"time": 9205, "text": "So if you want the uncensored, unfiltered, the full spectrum of the force of nature, there's John Clark, you go to the podcast."}, {"time": 9215, "text": "Funny enough, I think you're drinking throughout most of the podcast."}, {"time": 9220, "text": "Tequila, so they only last like an hour because you seem to like, I'm guessing that you just lose it one hour."}, {"time": 9227, "text": "Like it's like Cinderella turns into a frog or whatever."}, {"time": 9230, "text": "One of the things I'm learning is sometimes you have great conversations when you're drunk and sometimes you don't."}, {"time": 9238, "text": "Like I went into it with the write drunk, edit sober mentality."}, {"time": 9243, "text": "Yes, Hemingway."}, {"time": 9245, "text": "Hemingway, yes."}, {"time": 9246, "text": "But turns out that sometimes you don't have that much to edit when you're super shit faced."}, {"time": 9253, "text": "And so I've been scaling that back a little bit."}, {"time": 9257, "text": "What do you mean exactly by that?"}, {"time": 9258, "text": "Like, where does it go wrong when you're drunk?"}, {"time": 9260, "text": "I'm curious about that, because."}, {"time": 9262, "text": "It gets, especially when you have a personal relationship with the person that you're talking to, rather than trying to put some ideas on display for other people to hear and maybe talk about, you wind up just having like a conversation with your bro about inside jokes and things like that."}, {"time": 9276, "text": "And it's like, it's not that interesting."}, {"time": 9277, "text": "No one wants to like watch, you know, go to a bar and watch two people at the, sitting there getting drunk and talking to each other is different than listening to like strong discourse."}, {"time": 9289, "text": "One interesting thing as a fan of Joe Rogan, I'm a fan, I've been a fan of Joe Rogan for a long time and he has his friends over a lot, right?"}, {"time": 9296, "text": "And there's a aspect to those three, four, five hour conversations that I really enjoy."}, {"time": 9300, "text": "There's a magic to those."}, {"time": 9302, "text": "I think he taught the world that those kinds of long form conversations can work."}, {"time": 9306, "text": "The, what you forget is Joe Rogan is a comedian."}, {"time": 9310, "text": "His friends are also celebrities."}, {"time": 9312, "text": "Like they know what it's like to be on the mic."}, {"time": 9314, "text": "They know there is a challenge to actually having your friends on a microphone."}, {"time": 9321, "text": "Like they've never, this is the first time they've been on a microphone."}, {"time": 9324, "text": "And that's actually what you've been doing, which is a very interesting experiment."}, {"time": 9328, "text": "And you find that some are more awkward than others."}, {"time": 9331, "text": "Like they're trying to find like, what do I do with this kind of thing?"}, {"time": 9335, "text": "Why do you not talk to strangers?"}, {"time": 9337, "text": "Why did you go with people that you're actually know?"}, {"time": 9341, "text": "So the simple answer is the people that I selected are both interesting and I thought would be good at talking."}, {"time": 9346, "text": "But then I noticed the thing you just mentioned."}, {"time": 9348, "text": "My buddy Paul did the first one and Paul's a wild man."}, {"time": 9351, "text": "And if you went out with Paul, he can talk about a bazillion topics to a certain, to a significant level of depth, right?"}, {"time": 9360, "text": "And he's got a good understanding and he's got a unique perspective on a lot of things."}, {"time": 9363, "text": "And I think he was the first guy invited on my podcast and it was almost like he was on a little bit less than natural about it."}, {"time": 9376, "text": "And then by the time he loosened up with some drinks, he was, it just, we were all shitfaced."}, {"time": 9382, "text": "There's a face shift though."}, {"time": 9384, "text": "Totally, totally."}, {"time": 9385, "text": "And so he's gonna come back on and he'll be more comfortable with it."}, {"time": 9389, "text": "And it'll probably be awesome because he's a great person to talk to."}, {"time": 9393, "text": "I had my friend Dave on who's a restaurateur and a musician, that one will be released pretty soon."}, {"time": 9399, "text": "But yesterday I had a guy on who you might really enjoy listening to who's a friend of mine, his name's Mark Clem."}, {"time": 9404, "text": "He's an endurance athlete and he's been compared, he's been called the white Dave Goggins."}, {"time": 9411, "text": "And he talks about like those comparisons and what he hates about it and the various events and stuff."}, {"time": 9416, "text": "And he's just a guy who's just always kind of like natural and like, I knew he'd be great to get on the podcast."}, {"time": 9421, "text": "And so I started with friends who I thought could handle it and who also are just really interesting people."}, {"time": 9430, "text": "And I did it so that I could also establish a level of comfort because it was a new thing for me."}, {"time": 9436, "text": "And I knew that they wouldn't really give a shit what I was doing and be like, hey, this is cool."}, {"time": 9440, "text": "I'm going over to JC's house."}, {"time": 9441, "text": "We're gonna drink some tequila and talk shit."}, {"time": 9442, "text": "There's just gonna be a microphone there this time."}, {"time": 9444, "text": "I mean, it's amazing what you're doing, the freedom of it."}, {"time": 9446, "text": "I mean, you're not currently doing any advertisements or any of that kind of stuff."}, {"time": 9449, "text": "You're just exploring your voice."}, {"time": 9450, "text": "This is one of the mediums that you're just trying it out."}, {"time": 9452, "text": "My 11 subscribers know what I'm about."}, {"time": 9454, "text": "Your 11 subscribers, it's in the double digits."}, {"time": 9460, "text": "For both you and I, do you have advice for me as a podcaster and for yourself as a podcast?"}, {"time": 9466, "text": "Like if you were to think like you're gonna do say, I mean, who knows, but say you do a thousand more episodes."}, {"time": 9473, "text": "Like imagine a world where your life continues in that direction, that this is like a little parallel."}, {"time": 9481, "text": "Like for me, this thing is like a little side hobby, but it's also one that's deeply fulfilling."}, {"time": 9487, "text": "So not just from a business perspective, which is not the way I think about it."}, {"time": 9490, "text": "I just think from a life human perspective, it's I probably wouldn't have this kind of conversation with you off mic, like this long, this deep, this attentive."}, {"time": 9500, "text": "There's something really fulfilling about these conversations."}, {"time": 9503, "text": "So what advice would you have for me?"}, {"time": 9506, "text": "What advice do you have for yourself?"}, {"time": 9508, "text": "Oh, have you not introspected this that deeply?"}, {"time": 9511, "text": "Oh, I have advice."}, {"time": 9512, "text": "I think the first advice I would give to you is I think you should have me on more often."}, {"time": 9519, "text": "That's first and foremost."}, {"time": 9521, "text": "And second is go on your podcast and have a conversation."}, {"time": 9523, "text": "Well, I would say you come on my podcast when you're ready."}, {"time": 9529, "text": "When you feel like the product that I'm putting out would benefit from your presence and vice versa, not as a favor to a bro, but at the right time."}, {"time": 9541, "text": "I do sense, actually, it's an interesting, there's a dance to it, which is like Joe Rogan, I recently did, like Joe Rogan had a conversation with me on this podcast."}, {"time": 9553, "text": "There's a very specific kind of thing where you're helping each other out."}, {"time": 9560, "text": "But the timing on that has to be right."}, {"time": 9563, "text": "You know, like if that makes any sense, you're like supporting each other."}, {"time": 9567, "text": "It doesn't make a difference, you would think."}, {"time": 9571, "text": "Because it's just people talking, it doesn't matter what microphones, but it changes things."}, {"time": 9575, "text": "It does, and there's an order to the guests that I've had on."}, {"time": 9578, "text": "And the next guest that I'll have on will be a friend we have in common, and we'll be talking about teaching and how to teach different styles of teaching and what you're teaching and all these other things."}, {"time": 9587, "text": "Your mind's saying who?"}, {"time": 9588, "text": "Oh, Sean Fisher."}, {"time": 9589, "text": "And I think there's an order to, it's not scientific, but it's based on my gut."}, {"time": 9596, "text": "Is it astrologically based?"}, {"time": 9600, "text": "What do you mean it's not scientific?"}, {"time": 9602, "text": "Your gut, so you have a sense, like Joe Rogan, for example, tries to do left, right."}, {"time": 9609, "text": "He tries to alternate like this gut feeling of like these bins of people, and he tries to alternate worldviews."}, {"time": 9618, "text": "Like he kind of, so that he doesn't feel like it, like it constantly shakes him."}, {"time": 9625, "text": "It's more about him, like constantly pulls him in multiple directions about like how he sees the world, and that keeps him balanced."}, {"time": 9632, "text": "That keeps the conversation kind of exciting."}, {"time": 9635, "text": "I did it in a way where I knew Paul was gonna be wild and we might get a little out of control and like have some technical hiccups along the way."}, {"time": 9643, "text": "And then my friend Jake, who's a CEO of a pharmaceutical company, that was very timely because he was able to speak to vaccines."}, {"time": 9650, "text": "And that was kind of scientific flavored."}, {"time": 9653, "text": "And what I learned listening back on that is like I learned for myself about, I wasn't asking the next level questions to really draw out great answers."}, {"time": 9664, "text": "And part of it is you're simultaneously hanging out with a bro, but also I was trying to learn something and I didn't learn what I wanted to learn."}, {"time": 9672, "text": "And that's my fault because I didn't ask the questions."}, {"time": 9675, "text": "He's an expert in that field."}, {"time": 9677, "text": "He doesn't know that I'm an absolute dipshit when it comes to that stuff."}, {"time": 9680, "text": "And so I didn't do a good job."}, {"time": 9682, "text": "And if I don't know it, that means the thing I was trying to tease out of him, no one who was gonna listen is gonna learn that either."}, {"time": 9687, "text": "So I learned that."}, {"time": 9690, "text": "Then I had the one with soap on, which I thought was pretty good."}, {"time": 9694, "text": "He's a wrestler, he's also a farmer."}, {"time": 9696, "text": "Right, and a social worker."}, {"time": 9698, "text": "And kind of humble and thoughtful."}, {"time": 9700, "text": "Yeah, thoughtful."}, {"time": 9701, "text": "Thoughtful guy."}, {"time": 9702, "text": "Like slower, he's not a wild man, that kind of thing."}, {"time": 9705, "text": "Not a wild man in the sense that I'm wild, but he does preach this philosophy of being more wild."}, {"time": 9711, "text": "Like being in touch with nature."}, {"time": 9712, "text": "Nature, that kind of wild."}, {"time": 9715, "text": "And then my buddy Dave, he came on because I love music."}, {"time": 9721, "text": "And I wanted to talk a lot about music."}, {"time": 9723, "text": "And he's one of the most knowledgeable people about music that I know."}, {"time": 9726, "text": "And he's got a restaurant coming up."}, {"time": 9727, "text": "And I thought my buddy Mark Clem, being an endurance athlete, like when you hear some of the things, I didn't even know these things existed that this fucking kid did."}, {"time": 9736, "text": "He's out of his mind."}, {"time": 9737, "text": "And I think Sean and I will have probably the most intellectual conversation that I'll have had on my podcast to date."}, {"time": 9744, "text": "And so there's a little bit of alternating there, but I did it that way so that."}, {"time": 9752, "text": "There's a gut feeling behind, oh, so that what?"}, {"time": 9754, "text": "Is there, where are you going?"}, {"time": 9756, "text": "Do you know where you're going?"}, {"time": 9759, "text": "I don't have a destination, but I want to, I want to see it to its end, whether that's, it gets somewhere of its own volition or it takes on a new life at some point."}, {"time": 9773, "text": "And then I know how to drive it where it needs to go."}, {"time": 9777, "text": "I think the advice I have for both of us is, I think I need to, no, I don't think so."}, {"time": 9789, "text": "I think for you, I see an inner turmoil."}, {"time": 9792, "text": "I see a storm that bruising you because I feel like there's a concern for what you're saying."}, {"time": 9798, "text": "And is it gonna lead to negative feelings towards you or the thing that you're doing?"}, {"time": 9809, "text": "And I feel like we're different people and I have such an easier time saying fuck off to everybody."}, {"time": 9817, "text": "And that's a liberating thing, but it also can keep me from achieving the thing that I want to achieve, because I'm so flippant with opinions that I don't listen to them and let them direct me when they should."}, {"time": 9834, "text": "Please do."}, {"time": 9835, "text": "I think you believe that about yourself and nevertheless, your social media presence indicates otherwise."}, {"time": 9841, "text": "If I were to be very harsh, you're like one of the mentally strongest character wise people I know."}, {"time": 9847, "text": "And yet on social media, you don't put your face to the world."}, {"time": 9851, "text": "So one of the reasons you sense the fear in me, which exists, I of course want to let go of it, is because I put my face and my name on things."}, {"time": 9863, "text": "And so when I say something stupid, it hurts when people say like, look, that guy said something stupid."}, {"time": 9872, "text": "And so there's a fear of saying something stupid in all of his different forms, like of being my lesser self."}, {"time": 9878, "text": "It's the same feeling I have in competition of losing, not just losing."}, {"time": 9882, "text": "Losing doesn't matter."}, {"time": 9883, "text": "It's embarrassing myself."}, {"time": 9885, "text": "I like losing, being the lesser version of myself."}, {"time": 9888, "text": "And when you put yourself out there in a full way, I think you, I would venture to say you're also, because you said you wouldn't give yourself that advice."}, {"time": 9898, "text": "I feel like you're also afraid of standing behind some of the ideas, because right now you're doing guerrilla warfare."}, {"time": 9903, "text": "You're free to be, to say things, to speak your mind from the sidelines."}, {"time": 9911, "text": "But the moment you're standing, and when people can throw shit at you, I feel like you haven't faced that fire yet."}, {"time": 9919, "text": "You've been avoiding that fire."}, {"time": 9920, "text": "I'm not sure, maybe I'm projecting."}, {"time": 9922, "text": "No, to a degree you're right."}, {"time": 9924, "text": "I think a big thing for me was putting ads on for our Jiu Jitsu online curriculum."}, {"time": 9932, "text": "That was a big thing for me, because for several reasons, like in the climate of everyone under the sun having a Jiu Jitsu tutorial online and social media, not social media necessarily, but forums specifically that critique and shit the bed."}, {"time": 9949, "text": "One thing I have not done that I've thought about doing, and probably you're right in your analysis of it, is I've not gone the way that I do see you on things like Reddit and say, hey, Reddit, I'm doing this."}, {"time": 9960, "text": "Like I could easily go to Reddit and say, hey, Reddit, I got this website up."}, {"time": 9964, "text": "Here's a sample video, whatever the fuck people do on there."}, {"time": 9967, "text": "But yeah, you're right, I haven't done that."}, {"time": 9968, "text": "And part of it might be because I know also, if I get suckered in for one second into the negativity, I'm gonna become an online warrior, and I don't wanna be that person."}, {"time": 9982, "text": "So yeah, you're probably right."}, {"time": 9983, "text": "So you're self aware about that."}, {"time": 9985, "text": "I mean, one of the things I've early on decided is like, I'm just gonna be, I've always really enjoyed being positive."}, {"time": 9992, "text": "So I'm going to make sure I stay that way."}, {"time": 9995, "text": "And when there's negativity, it's like, I'm not just ignoring it."}, {"time": 10000, "text": "I'm literally just returning it with positivity."}, {"time": 10003, "text": "I probably am the same way as you, most people are with egos."}, {"time": 10009, "text": "You wanna become the warrior against the negativity."}, {"time": 10011, "text": "And like many wars, there's no winning."}, {"time": 10016, "text": "There's no winning that war."}, {"time": 10017, "text": "Especially online."}, {"time": 10018, "text": "Especially on the internet."}, {"time": 10019, "text": "And so in that sense, that's been a journey to try to face the fire of the negativity."}, {"time": 10027, "text": "And it's not actually that bad."}, {"time": 10028, "text": "It sounds like very dramatic."}, {"time": 10029, "text": "There's not many people that are negative, but it's like when you put advertisements, so you put your face on an instructional or something like that."}, {"time": 10037, "text": "It just, there's an aspect to it which you're being a salesman, you're being a gimmicky thing."}, {"time": 10043, "text": "It just feels wrong."}, {"time": 10044, "text": "And people will point out, look, that guy is a fraud, like it's fake."}, {"time": 10048, "text": "Look, he's trying, but those people are going to be out there."}, {"time": 10051, "text": "And if you're like trying to do your best, trying to be authentic and not trying to like be a snake oil salesman and being like the shady kind of salesman, I think they keep you honest."}, {"time": 10066, "text": "They keep you honestly being the most authentic self."}, {"time": 10069, "text": "And podcasting is like the best medium because you're being real."}, {"time": 10073, "text": "Those one hour plus that you put out there, that's like real John."}, {"time": 10078, "text": "That's not a, like people fall in love with that."}, {"time": 10084, "text": "And that's the beautiful aspect of podcasting is there's no, long form doesn't give any possibility for you not to be authentic."}, {"time": 10094, "text": "And that's why it's a magical medium."}, {"time": 10097, "text": "The tough thing is you're not, popularity takes time, not popularity."}, {"time": 10105, "text": "And so like you shouldn't be doing it for that reason."}, {"time": 10107, "text": "And I don't, it's not the thing that really drives me."}, {"time": 10114, "text": "Is there three books, technical fiction philosophical that had an impact on you?"}, {"time": 10118, "text": "Like, is there books that you kind of return to that you enjoy and that you find profound in some way?"}, {"time": 10124, "text": "I would say like probably the thing I read is in one of Emerson's essays that I read at a point in my life where I needed that type of thing."}, {"time": 10132, "text": "And I read self reliance and, he's got a ton of good essays, but I thought self reliance was probably the most impactful to me."}, {"time": 10141, "text": "I've read later in life, like a handful of existential authors and they're all great, but at the time a lot of it has to do with timing."}, {"time": 10152, "text": "And when I read self reliance and it was about the individual that was really good and made it was impactful."}, {"time": 10159, "text": "There's also a book called Jonathan Livingston Seagull by Richard Bach, I think."}]}]