[{"title": "Daniel Negreanu: Poker | Lex Fridman Podcast #324", "id": "rKnoNfajUgM", "quotes": [{"time": 224, "text": "There's those people that always, well, of course I lost, I always lose with this hand."}, {"time": 227, "text": "And those types of people you can manipulate because when a card comes, that you don't have them beat, right?"}, {"time": 234, "text": "But you can pretend because they'll believe it."}, {"time": 236, "text": "Like, of course you beat me."}, {"time": 237, "text": "So you bet all your chips against them, knowing that you can scare them because they already feel like they're gonna lose."}, {"time": 243, "text": "The inherent, like the cynicism."}, {"time": 246, "text": "Cynicism is easier to play against because you can convince them that their cards suck."}, {"time": 250, "text": "Yeah, when somebody believes that they're a loser or they're unlucky, right?"}, {"time": 254, "text": "And that bad things happen to them always and they never catch a break."}, {"time": 257, "text": "Well, you know, you can just help them make it true."}, {"time": 261, "text": "What do you think about the rounders Teddy KGB when he does the Oreo tell?"}, {"time": 266, "text": "Do players at the high level communicate that kind of stuff?"}, {"time": 270, "text": "Do you think it's realistic to be able to have a tell like this that's partially subconscious?"}, {"time": 274, "text": "So first of all, I love Brian Koppelman who made the film."}, {"time": 277, "text": "And I think what they were going for is something obvious to the general public, right?"}, {"time": 281, "text": "Like, okay, it's very clear, you know, he eats the cookie, he doesn't eat the cookie and it means one or the other."}, {"time": 286, "text": "At the highest levels, something that, you know, blatant, you're not gonna find."}, {"time": 291, "text": "You're gonna find a lot more subtle things, maybe with posture or timing or, you know, different things like that."}, {"time": 296, "text": "But at the lower levels, you know, you might see some, you might see, you know, with a lot of people when they're in a hand and they've bet, whether they drink water in the hand is going to tell you something generally speaking."}, {"time": 308, "text": "It's such an intimate part of the human experience that I feel like if you have food, you're gonna reveal something about yourself through the way you eat."}, {"time": 314, "text": "I feel like that's a dangerous thing to have at the table."}, {"time": 316, "text": "Well, the thing is, generally speaking, people don't eat food in the middle of a hand."}, {"time": 320, "text": "Like they're not gonna bet and then just like grab a burger."}, {"time": 323, "text": "What they will do though is, you know, they bet and it's up to you and then they're, whether they're, you know, uncomfortable or they do it unconsciously, they just want to do something to make themselves look relaxed or whatever."}, {"time": 332, "text": "And then, you know, they grab a water where they don't really need it in that moment, but they're trying to take your mind off of the situation."}, {"time": 339, "text": "So they, in the movie, wanted to show a simplistic version of something that does happen, something that's visually sort of clear."}, {"time": 348, "text": "Yeah, because I think one of the things Rounders got right is that it's a poker movie, right?"}, {"time": 352, "text": "But you don't have to be great at poker or really understand poker to enjoy the movie."}, {"time": 356, "text": "And that, you know, Oreo cookie tale, like everyone gets that."}, {"time": 359, "text": "They're like, okay, that's simple."}, {"time": 361, "text": "If he would have went with something more subtle, you know, like licking your lips or looking to the right, or I think it might've been lost on the audience."}, {"time": 369, "text": "And they didn't actually explicitly say that that was a tell, I don't think."}, {"time": 374, "text": "I thought they did everything to let you know, right?"}, {"time": 377, "text": "With the music and slow motion and he's staring at it and he's like, aha."}, {"time": 382, "text": "Yeah, but they didn't actually say, you know, this is an obvious tell, like Matt Damon's character didn't talk."}, {"time": 388, "text": "At the very end of it, you know, after he says, how the fuck did you lay that down?"}, {"time": 393, "text": "The monster, right?"}, {"time": 394, "text": "And he's like, he's like, you're not hungry?"}, {"time": 397, "text": "Not hungry, KGB?"}, {"time": 398, "text": "He's like, I keep on, but you, you know, so he sort of references it and then he takes the cookies."}, {"time": 402, "text": "He notices, he's like, ah, he got me."}, {"time": 404, "text": "And he breaks the, you know, the rack of cookies."}, {"time": 406, "text": "Well, probably if you had that kind of tell on him, you wouldn't, and Matt Damon's character would not reveal."}, {"time": 411, "text": "Well, he says in the movie, he says, normally I wouldn't reveal a tell, but I don't have that much time."}, {"time": 416, "text": "Like I've got to rattle him some way."}, {"time": 418, "text": "So that was one way to do that."}, {"time": 420, "text": "How hard is it to do that to, in a KGB accent, to lay down a monster in those situations?"}, {"time": 428, "text": "In general, how hard is it to lay down a really strong hand, just psychologically?"}, {"time": 433, "text": "Yeah, no, I mean, I think it's incredibly difficult for the vast majority of people."}, {"time": 436, "text": "You know, part of what makes professionals really, really good is recognizing a situation that's very, very dangerous and they need to, you know, jump ship."}, {"time": 443, "text": "Like what happens to a lot of players is you get married to a hand."}, {"time": 446, "text": "Let's say you have pocket aces, which is the best possible hand, right?"}, {"time": 449, "text": "But the board runs out where it's seven, eight, nine, and then there's a jack and then there's a six."}, {"time": 454, "text": "It's like, you have a great hand to start, but you don't anymore."}, {"time": 457, "text": "So one of the difficult things for the average player is, you know, once they've put money in, cutting their losses and saying, okay, let's move on to the next hand."}, {"time": 466, "text": "It's a very, very difficult thing for a lot of people."}, {"time": 468, "text": "At every stage of like pre flop all the way through, be able to just make a decision at that moment."}, {"time": 475, "text": "So yeah, essentially not being attached."}, {"time": 477, "text": "Okay, I've already put in $40,000 in this pot and this guy's bet another 20."}, {"time": 482, "text": "Well, I mean, I gotta get my 40 back, right?"}, {"time": 484, "text": "Except, you know, in some cases you have to reassess individually this situation and realize, all right, well, this is a bad investment."}, {"time": 491, "text": "So I got to cut my losses."}, {"time": 492, "text": "By the way, I should mention that you have, you have an incredible YouTube channel where you explain a lot of stuff."}, {"time": 498, "text": "You do a podcast, you do a lot of really awesome stuff."}, {"time": 501, "text": "My probably favorite thing that you've done is your masterclass that people should definitely check out, masterclass.com slash Lux."}, {"time": 511, "text": "No, but it really is one of my favorite masterclass courses, but also just a great introduction overview of poker."}, {"time": 518, "text": "It's great for people like me who are beginners essentially, but it's probably really good for intermediate people too."}, {"time": 524, "text": "I mean, there's a lot of really good detail there."}, {"time": 526, "text": "Anyway, what are hand ranges and how do you begin to estimate the range of hands that your opponents have?"}, {"time": 532, "text": "Yeah, so I actually did, speaking to YouTube, I did a video on specifically this."}, {"time": 536, "text": "Getting familiar with Rangers and essentially, you know, back in my day, the old days, we didn't talk about poker that way."}, {"time": 540, "text": "We're like, I think he's got this or I think he's got that, right?"}, {"time": 543, "text": "Nobody thought of like the range of hands a player can have."}, {"time": 546, "text": "So I guess the best example is, imagine like all the potential hands as being a part of a grid, right?"}, {"time": 551, "text": "So the first player to act, they could have any one of those hands, right?"}, {"time": 556, "text": "Anyone randomly dealt, right?"}, {"time": 558, "text": "But let's say now that that player raised to $3,000."}, {"time": 562, "text": "Okay, well you can eliminate now from this grid, a whole bunch of hands that this player can no longer have because if they had a two and a three, they wouldn't do that."}, {"time": 569, "text": "So you can say, okay, he probably has a big pair."}, {"time": 572, "text": "He has ace king."}, {"time": 573, "text": "You know, you've narrowed the range of hands down, right?"}, {"time": 576, "text": "Now through every action on the flop, on the turn and on the river, based on the decisions they make, you narrow it down even further."}, {"time": 583, "text": "So the range of hands is the whole, the entirety of all the possibilities that this player you believe could have."}, {"time": 590, "text": "And sometimes they fool you or they have a hand that you don't expect them to have in their range."}, {"time": 594, "text": "And you know, maybe a little bit unorthodox doing some things you don't expect to throw you off, but a range is essentially all the possibilities and it narrows as by the time, before the flop it's endless, player raises, okay, it's minimized."}, {"time": 607, "text": "You know, a player bets the flop, okay, it's minimized further."}, {"time": 609, "text": "And then by the river, you know, you can narrow down the entire range to, you know, just maybe even a few hands."}, {"time": 615, "text": "Is it always shrinking or is there sort of, as you get surprised?"}, {"time": 619, "text": "I mean, it's always just an estimate."}, {"time": 621, "text": "So does it ever expand based on sort of chaotic, unpredicted surprising behavior of the players?"}, {"time": 629, "text": "It really should never expand."}, {"time": 630, "text": "The range of hands should always get smaller, right?"}, {"time": 632, "text": "Like again, we start with the full scope and then you should factor in like, okay, these are all the possible hands you can have on the flop now, right?"}, {"time": 639, "text": "We can't have new hands on the turn."}, {"time": 641, "text": "And if you get to that point where you think, oh, well, maybe he has this hand, then you sort of misjudged his range prior."}, {"time": 649, "text": "So you're not thinking clearly."}, {"time": 650, "text": "It should always shrink from the full scope to, you know, hopefully just a couple."}, {"time": 655, "text": "Well, in that video, you also talk about, it used to be that you would play your hand, but now you're playing a range that you're representing a range."}, {"time": 663, "text": "You're not even just playing your hand."}, {"time": 665, "text": "So what does it mean to represent a certain range?"}, {"time": 668, "text": "Yeah, so that's another big thing that's different about poker from, you know, my day to today is that back in our day, we would like put people on one hand."}, {"time": 675, "text": "I'm like, you probably have king nine or you have jacks or something like that."}, {"time": 679, "text": "Now people are cognizant of the idea that you could have an entire range of hands."}, {"time": 683, "text": "So then you ask yourself in situations, all right, I know what I have, but what I could have in his mind or my opponent's mind is any one of these hands."}, {"time": 691, "text": "What would I do with the entirety of these hands?"}, {"time": 694, "text": "And so a lot of people that are trying to play optimally, you know, game theory optimal, they think in terms of what their range of hands would do rather than their very specific hand."}, {"time": 703, "text": "So is bluffing in that context essentially misrepresenting the range of hands that you have?"}, {"time": 709, "text": "Is that how you think about it?"}, {"time": 711, "text": "Not exactly, because so an optimal range, like if I bet the river, if I'm playing game theory optimal, a portion of my range is going to be, I have it."}, {"time": 719, "text": "I got the best hand."}, {"time": 720, "text": "And a portion of my range is going to be bluffs and they'll be balanced."}, {"time": 723, "text": "So in theory, no matter what you do, no matter what you do, if you call or you fold, in theory, it's just, you're printing a zero, as we say, you're not gaining or losing any EV, if you were to do it that way."}, {"time": 735, "text": "What's EV?"}, {"time": 736, "text": "EV is expected value, right?"}, {"time": 738, "text": "So every play that you make, you know, it either is going to in the long run, you know, make you some money, or it's just a losing play."}, {"time": 744, "text": "And as a professional, you try to make the fewest amount of minus EV plays you can."}, {"time": 749, "text": "And the only reason you would make these minus EV plays is potentially if you were trying to set up your opponent for something later, right?"}, {"time": 755, "text": "So I might make some minus EV plays, right?"}, {"time": 758, "text": "So that I can exploit you later, right?"}, {"time": 760, "text": "So you're building up an image, a player profile that's false in some way."}, {"time": 765, "text": "Something that I'm going to, I'm going to plant seeds in your mind so that I can exploit them later."}, {"time": 769, "text": "So for example, why would players like show a big bluff?"}, {"time": 773, "text": "Like what would be the reason for that?"}, {"time": 774, "text": "They show a big bluff so that you know that they're capable of it."}, {"time": 777, "text": "But maybe in their mind, you're never going to do that again."}, {"time": 779, "text": "But now they think, you know, he bluffed me last time."}, {"time": 782, "text": "Maybe he's doing it again."}, {"time": 783, "text": "But that's a, what we call like a level, a leveling war."}, {"time": 786, "text": "Because it, you know, you can go back and forth with whether or not, okay, this guy might know that."}, {"time": 791, "text": "Like he showed a bluff because he's never going to bluff me again."}, {"time": 794, "text": "So that that's where it gets a little."}, {"time": 795, "text": "So that's a little bit different."}, {"time": 797, "text": "The, when we're talking about hand rangers, that's different than building up a mental model of what your opponents, what your opponents think of you and what your opponents think that you think of them and so on and so forth."}, {"time": 812, "text": "Are you trying to construct those kinds of mental models?"}, {"time": 815, "text": "And is that separate from the hand rangers?"}, {"time": 817, "text": "They go hand in hand, right?"}, {"time": 819, "text": "So if any given, in a given situation, right?"}, {"time": 821, "text": "My range has this many value hands and this many bluffs."}, {"time": 826, "text": "So in theory, if I want to be balanced, you know, this is my range and this is what it looks like."}, {"time": 829, "text": "I'll bet this 50% of the time, bet this 50% of the time."}, {"time": 832, "text": "However, if I know that you think that I bluff too much, right, then I'm not going to bluff as much."}, {"time": 839, "text": "I'm going to start, instead of betting these hands that I would 50, 50, now what I'll do is I'll do like 70, 30, where I'm basically value betting most of the time against you, you know, or vice versa."}, {"time": 848, "text": "If I know you always fold because you think I have it, I'm going to veer the other way."}, {"time": 852, "text": "And instead of bluffing 50%, I'll bluff 70, 80% of the time to take advantage of your perception of me."}, {"time": 857, "text": "So to be successful, do you have to construct a solid model of all the players in the game or can you ignore them?"}, {"time": 867, "text": "Like when I play, I have in my phone, I have a player profile of everyone that I play with."}, {"time": 872, "text": "Whenever I pick up, whether it's physical tells or tendencies they like to, you know, that they have."}, {"time": 878, "text": "And overall, that's just going to, you know, that's going to allow you to exploit more, right?"}, {"time": 883, "text": "So like if I played with somebody I've never played before, I'm probably just going to play optimally or at least as optimal as I know how until I start to, you know, gain some information on that player so that I can start to exploit them."}, {"time": 895, "text": "So what's the, when you say optimally, what does optimally mean versus, so game theory optimal versus exploitative?"}, {"time": 904, "text": "Yeah, so that's like sort of the big debate in poker."}, {"time": 906, "text": "We call it for short, GTO game theory optimal versus exploitative play."}, {"time": 911, "text": "So GTO game theory optimal is the idea that no, like I'm going to set up my play so that no matter what you do, you cannot exploit me."}, {"time": 920, "text": "So essentially that's playing rock, paper, scissors, right?"}, {"time": 923, "text": "And throwing 33% of each every time, right?"}, {"time": 927, "text": "Nothing you do can beat that, nothing."}, {"time": 929, "text": "You'll never be able to beat that, right?"}, {"time": 931, "text": "Exploitative play is starting to notice that, okay, well, you know what?"}, {"time": 935, "text": "This guy loves rock."}, {"time": 936, "text": "He loves playing rock."}, {"time": 937, "text": "So I'm going to go paper a little more."}, {"time": 939, "text": "So I'm going to take advantage of them."}, {"time": 940, "text": "So I won't be through, but now all of a sudden, when I do that, I'm no longer playing optimal because if you knew that I was making that adjustment, now you can exploit me."}, {"time": 947, "text": "So that's where the sort of what we call the leveling war happens, where people veer from, you know, the optimal line of, okay, 33% each for each one."}, {"time": 956, "text": "You can't beat that, but you also can't win with that either."}, {"time": 960, "text": "So you're always trying to be at the cutting, at the leading edge of suboptimal play."}, {"time": 966, "text": "Yeah, you're going back and forth."}, {"time": 967, "text": "And listen, at the highest levels, like online that these guys play, like they're trying to play pretty close to like game theory optimal because it's very difficult to do first of all."}, {"time": 976, "text": "No human being will ever be able to compute at the level that computers can."}, {"time": 981, "text": "It's just never going to happen."}, {"time": 983, "text": "So that's where like the human mind has to come into play and say, all right, well, you know, if I was playing against the robot, I would do X, but I'm not, I'm playing against you."}, {"time": 991, "text": "So I have to adjust."}, {"time": 992, "text": "So does game theory optimal only look at the betting and the hands in the current hand or does it look at the history?"}, {"time": 1002, "text": "So if you were to play optimally, optimally, would you need to look at the history of the individual players or just every hand is taken afresh?"}, {"time": 1009, "text": "See, that's why I love playing exploitatively for the most part, because with GTO, anything that's happened in the past has no bearing on this situation."}, {"time": 1018, "text": "It's simply based on what is the optimal play in a vacuum in this spot."}, {"time": 1022, "text": "Whereas exploitatively, okay, this guy bluffs way too much in these spots."}, {"time": 1026, "text": "So now I can make an adjustment and call more, you know, based on past information."}, {"time": 1031, "text": "GTO doesn't take into account history at all."}, {"time": 1034, "text": "So like in a tournament, how quickly can you construct a player profile that you've never played before?"}, {"time": 1039, "text": "Depends on the level of the buy in really, right?"}, {"time": 1042, "text": "So the higher the buy in, generally speaking, you can assume if they're professionals, that they're gonna have pretty similar profiles because you know, everyone's playing, you know, if you're playing this game well, it looks similar, right?"}, {"time": 1054, "text": "At the lower levels, you know, playing say in $1,000 or $1,500 buy in or less, you know, within a half an hour or an hour, I have an idea of all right, just by seeing how some players played a few hands that, you know, so here's the thing with poker, it's like, I can see one clue of what he did."}, {"time": 1070, "text": "And it tells me so much about what he'll do in a vast number of scenarios."}, {"time": 1073, "text": "And you're saying at the high level, people don't give too many clues."}, {"time": 1076, "text": "I mean, then."}, {"time": 1077, "text": "Well, at the highest level is, people are so much more similar in terms of their style of play."}, {"time": 1082, "text": "They try to find some kind of balance between the GTO."}, {"time": 1084, "text": "And now with all that we've seen on TV, right?"}, {"time": 1087, "text": "Like people get to watch streams and whatever."}, {"time": 1088, "text": "So you get to watch all the top players play."}, {"time": 1090, "text": "So if you wanna learn how to play better, guess what you do?"}, {"time": 1092, "text": "You copy what they're doing, essentially."}, {"time": 1094, "text": "Like, oh, he's only raising this much."}, {"time": 1096, "text": "I'm gonna do the same."}, {"time": 1097, "text": "They're betting this much."}, {"time": 1099, "text": "So as a result, what you end up having is sort of, you know, everyone deciding."}, {"time": 1106, "text": "Like, I guess it's similar in chess with openings, right?"}, {"time": 1108, "text": "People figure out, okay, this is an opening."}, {"time": 1109, "text": "This is what you do."}, {"time": 1111, "text": "And then everyone's similar to that."}, {"time": 1113, "text": "And then you have, of course, the outliers who try to do things a little differently and confuse people."}, {"time": 1118, "text": "It seems like the outliers, like we talked offline that Magnus, in order to win Magnus Carlsen, has to play suboptimally in the openings to take his opponents out of the comfort zone so he can play what he calls pure chess as quickly as possible, which is just both short and deep calculations."}, {"time": 1136, "text": "Purely, you're looking at the board versus memorized openings and memorized lines."}, {"time": 1141, "text": "Is it the case that the best poker players are the ones that are able to, at the right time, play really suboptimally or really unorthodox?"}, {"time": 1155, "text": "Yeah, specifically there's one guy who last year sort of took the poker world by storm, and his name was Michael Adamo."}, {"time": 1161, "text": "And he was doing things, like I said, you know, most of the top pros play very similarly with the way that they construct ranges and their bet sizing and all these kinds of things."}, {"time": 1168, "text": "He was doing some crazy things that nobody else was doing."}, {"time": 1172, "text": "So he studied sort of a different form of poker and it was unorthodox."}, {"time": 1178, "text": "And it, you know, it throws people off because he's in his comfort zone with these bet sizes and different things, whereas everyone else, they're not well studied in those spots."}, {"time": 1186, "text": "So as a result of him being unorthodox, he became like a monster and very difficult to play against because he really knew what he was doing with it."}, {"time": 1193, "text": "In tournament or cash games?"}, {"time": 1194, "text": "It was tournaments, yeah."}, {"time": 1195, "text": "He was crushing tournaments."}, {"time": 1196, "text": "He was going against the norm in terms of what is like, you know, this is what you should do as a poker player in this spot."}, {"time": 1204, "text": "He was doing what he thought was best and he was doing things outside the norm that again, in a vacuum, you could look at that and you go, that's incorrect."}, {"time": 1210, "text": "That he should not do."}, {"time": 1211, "text": "That is a clear cut mistake."}, {"time": 1213, "text": "Even, you know, the solvers or the computers or game theory would say, this is wrong what he's doing."}, {"time": 1218, "text": "But it's not wrong if he's doing it in a way that he's exploiting other players tendencies."}, {"time": 1224, "text": "So for example, with him, say he's playing far too aggressively, okay?"}, {"time": 1228, "text": "That's not good unless your opponents are playing way too passively."}, {"time": 1233, "text": "So if your opponents are playing passively, the answer is to be more aggressive with them."}, {"time": 1236, "text": "And that's, I think one of the, you know, biggest advantages he had was he was willing to do that."}, {"time": 1240, "text": "So bet huge, big, big pots bluffing."}, {"time": 1244, "text": "Huge."}, {"time": 1245, "text": "So in a spot where somebody would make it a thousand, he's making it 22,000."}, {"time": 1251, "text": "This makes no sense."}, {"time": 1252, "text": "And then people kind of know he has nothing, but they're too afraid to call him on it."}, {"time": 1256, "text": "Well, and then sometimes what happens is this is where the leveling comes in."}, {"time": 1259, "text": "You're like, man, this guy's crazy."}, {"time": 1260, "text": "He's bluffing like nuts."}, {"time": 1261, "text": "Then he bets the 22,000 and you say, ah, I'm taking my stand."}, {"time": 1265, "text": "I call, and then he shows you like, you know, four of a kind or something like that."}, {"time": 1269, "text": "So he gets people out of their comfort zone."}, {"time": 1271, "text": "And I really enjoy watching him play."}, {"time": 1272, "text": "He's probably my favorite player to watch today."}, {"time": 1275, "text": "Watching a guy like that, what aspect of his play have you been able to incorporate into your own?"}, {"time": 1280, "text": "Like, what do you learn from that?"}, {"time": 1282, "text": "Cause you're constantly learning, you're constantly adjusting."}, {"time": 1284, "text": "Well, no, and I love it."}, {"time": 1285, "text": "And as I said, so I think a lot of players sort of come to the same conclusions about this is how you play the spot, but he doesn't."}, {"time": 1290, "text": "And I love watching and thinking in terms of like, why he's doing this."}, {"time": 1293, "text": "And one specific thing, for example, is he's willing to really go for it."}, {"time": 1298, "text": "So in a spot where let's say he bets 2000, he knows he'll get you to call 2000, right?"}, {"time": 1303, "text": "But he wants it all."}, {"time": 1305, "text": "He wants it all."}, {"time": 1306, "text": "So he says, you know what?"}, {"time": 1307, "text": "I'll give up the 2000 that's guaranteed and I'll bet 50,000."}, {"time": 1312, "text": "And maybe if you call that now, you know, so listen, you lose the 2007, eight times, but if I get called for the 50 just once, you know, I'm profiting from that."}, {"time": 1321, "text": "And it also sets the, you know, the template for you to really sort of be a player that people are afraid to play against."}, {"time": 1328, "text": "He knocked me out in a tournament very early on in a huge event."}, {"time": 1332, "text": "And he had, he was so far ahead."}, {"time": 1334, "text": "He was one step ahead of my thought process in hand."}, {"time": 1337, "text": "And he did something that makes no sense whatsoever."}, {"time": 1339, "text": "I looked it up on the computer."}, {"time": 1341, "text": "Huge mistake, if you will, but not a mistake because he was taking advantage of my tendency."}, {"time": 1345, "text": "Do you remember the cars?"}, {"time": 1346, "text": "Is there an example?"}, {"time": 1347, "text": "I remember the whole thing."}, {"time": 1349, "text": "I remember it like it was yesterday."}, {"time": 1350, "text": "Can you take it like through an example hand that really demonstrates it?"}, {"time": 1354, "text": "So I'll explain the hand here."}, {"time": 1356, "text": "So I'm on the button and I have ace king, which is a very good hand."}, {"time": 1360, "text": "And I raise and he calls from the big blind."}, {"time": 1363, "text": "The flop is nine, seven, five."}, {"time": 1365, "text": "So I have nothing really here."}, {"time": 1367, "text": "He checks, I check behind."}, {"time": 1369, "text": "The turn card's an ace."}, {"time": 1371, "text": "He checks, I bet half the pot."}, {"time": 1373, "text": "There were 6,000 there, I bet 3,000, okay?"}, {"time": 1376, "text": "Now this is not a typical thing you see people do, but he raised me to 36,000."}, {"time": 1381, "text": "Massive raise, bigger than the size of the pot."}, {"time": 1384, "text": "What was the flop again?"}, {"time": 1385, "text": "Nine, seven, five, turn an ace."}, {"time": 1388, "text": "What is he representing exactly?"}, {"time": 1390, "text": "Well, he could have a straight, he could have three, three of a kind."}, {"time": 1392, "text": "He could have, you know, aces up."}, {"time": 1393, "text": "He could have a whole bunch of hands."}, {"time": 1394, "text": "So he check raises me big to 36,000."}, {"time": 1396, "text": "I call the bet."}, {"time": 1398, "text": "So now there's something like 75,000."}, {"time": 1400, "text": "The river is a five."}, {"time": 1403, "text": "So the board pairs, okay?"}, {"time": 1406, "text": "He thinks for a while and he bets all of it, which is three times the pot."}, {"time": 1410, "text": "He bets 225,000."}, {"time": 1412, "text": "There's only 75,000 out there, right?"}, {"time": 1414, "text": "And in theory, he should never ever have a hand that can do that, right?"}, {"time": 1418, "text": "So it confused me."}, {"time": 1419, "text": "And I was like, okay, well, this guy's aggressive."}, {"time": 1421, "text": "He likes to bluff and all this kind of stuff."}, {"time": 1423, "text": "So I made the call with the ace king and he turned over six, eight."}, {"time": 1427, "text": "So we had a straight, but here's the thing."}, {"time": 1429, "text": "In theory, that river card is bad for him."}, {"time": 1432, "text": "When I call the turn, I have a lot of the time, three of a kind, two pair that just made a full house."}, {"time": 1438, "text": "So he was risking that."}, {"time": 1439, "text": "And the reason he did it was because he thought I would perceive him to be bluffing a lot."}, {"time": 1445, "text": "So he just went for it and it worked."}, {"time": 1447, "text": "He was able to double up right away and knock me out of the tournament like an hour in."}, {"time": 1451, "text": "Do you think he thought you might fold?"}, {"time": 1453, "text": "I think specific, I think it was, it came down to this."}, {"time": 1455, "text": "It's as simple as this."}, {"time": 1457, "text": "He was cognizant of his image as being a wild, aggressive bluffer, right?"}, {"time": 1461, "text": "And he was fully taking advantage of me, knowing that my tendency in these spots is to be curious."}, {"time": 1467, "text": "And I want to call and I want to see it."}, {"time": 1469, "text": "So he was fully taking advantage of the fact that he thought I would call too often."}, {"time": 1473, "text": "Because otherwise his play makes no sense."}, {"time": 1475, "text": "A small bet, a medium sized bet, those make sense."}, {"time": 1479, "text": "But the bet that he made in theory is indefensible."}, {"time": 1482, "text": "It's just like clearly a mistake."}, {"time": 1485, "text": "But that's why poker is so fascinating because he makes this play and it wasn't a mistake."}, {"time": 1488, "text": "It was above the rim, is what it was."}, {"time": 1490, "text": "Do you think he put you on ace something?"}, {"time": 1493, "text": "I think exactly what he thought I had, was ace king or something like that."}, {"time": 1498, "text": "That is so fun."}, {"time": 1498, "text": "That is so fun that the two players at such a high level were able to mess with each other's mind."}, {"time": 1503, "text": "How old is he?"}, {"time": 1504, "text": "Is he young?"}, {"time": 1505, "text": "He's in his 20s, yeah."}, {"time": 1506, "text": "I feel like that takes a lot of guts to take risks like that."}, {"time": 1510, "text": "Well, that's what's great about him."}, {"time": 1511, "text": "He's certainly never accused of not having the guts to put it in."}, {"time": 1513, "text": "And that's scary to play against, right?"}, {"time": 1515, "text": "The easiest opponent to play against is one who's just straightforward, passive, you know, not wild and crazy."}, {"time": 1521, "text": "Playing against him, he's going to put you in the blender, as we say."}, {"time": 1525, "text": "Yeah, how can you control what you're perceived as representing?"}, {"time": 1531, "text": "What hand you're perceived of as representing?"}, {"time": 1534, "text": "So if we're, if the game of modern poker is, others are representing certain hands through the information they convey, and you're representing a certain hand range, sorry, through your play, how can you control that?"}, {"time": 1547, "text": "Or is that not, is that the wrong way to think about it?"}, {"time": 1550, "text": "But isn't bluffing and bet sizing and all of that kind of stuff essentially controlling what others perceive as the hand range you have?"}, {"time": 1561, "text": "Ultimately, in terms of like controlling people's perception of you, you can't fully control it, but you can do things to sway it, right?"}, {"time": 1570, "text": "As I said earlier, showing bluffs and things like that, you know, leads your opponent to think maybe you do this more often than you're supposed to or whatever the case may be."}, {"time": 1577, "text": "But in terms of like controlling, you know, what your opponent can think about your hands in certain spots, I don't really think it equates that way."}, {"time": 1586, "text": "It doesn't really, you know, I think what people do when they're playing a hand is they think in terms of, all right, what does my range look like here?"}, {"time": 1593, "text": "Okay, so my range has value."}, {"time": 1595, "text": "So you look at, you know, the actual hand you have secondarily."}, {"time": 1598, "text": "So you say, okay, well, I could have this, I could have this, I actually have this, right?"}, {"time": 1603, "text": "But I could have all these hands."}, {"time": 1604, "text": "So my opponent, if he's thinking on a high level, he knows I could have all these hands and I have this one."}, {"time": 1609, "text": "So what do I do with this one, right, in the bigger scope of things?"}, {"time": 1612, "text": "I guess I'm trying to understand if your betting isn't a bet, preflop, your bet, doesn't that narrow the hand ranges?"}, {"time": 1621, "text": "Doesn't matter what you have, it narrows the end."}, {"time": 1625, "text": "And if you bet big combined with the perception of you at the table, doesn't that represent the hand range?"}, {"time": 1634, "text": "Uh huh, absolutely."}, {"time": 1636, "text": "So like you can, with betting essentially control what people estimate you to have."}, {"time": 1640, "text": "Sure, so that makes it, so yeah, so that's true."}, {"time": 1643, "text": "So for example, one of the most extreme examples is, we have, there's spots where there's a bet that's considered polarizing, right?"}, {"time": 1651, "text": "So let's say there's a thousand in the pot and you bet 10,000, which is crazy big, right?"}, {"time": 1657, "text": "That's saying one of two things."}, {"time": 1658, "text": "I either have the absolute best possible hand or absolutely nothing, because any of the hands in the middle, I wouldn't do that with."}, {"time": 1665, "text": "So I'm essentially telling you when I bet that, I'm like, I either got it or I got, I don't have a mediocre hand, like just a pair of nines or a pair of tens."}, {"time": 1674, "text": "I have a royal flush or have nine high."}, {"time": 1677, "text": "So with my bet sizing, I can control how my opponent is perceiving what my range is gonna be."}, {"time": 1683, "text": "So for example, similarly, if I bet small, right?"}, {"time": 1687, "text": "Well, that could be a lot of hands, right?"}, {"time": 1689, "text": "That could represent a big part of my range."}, {"time": 1692, "text": "The bigger the bet, the more, the narrower the range."}, {"time": 1694, "text": "Apparently the more polarized it is."}, {"time": 1696, "text": "Yeah, how far could you get without looking at your cards?"}, {"time": 1700, "text": "Do you think how well could you do?"}, {"time": 1702, "text": "It depends on who I'm playing with, right?"}, {"time": 1704, "text": "So if I was playing in a tournament with mediocre or weak players, I think I could probably do pretty well."}, {"time": 1710, "text": "But even like world class."}, {"time": 1712, "text": "World class, I don't think you'd have much of a chance, really, I mean."}, {"time": 1715, "text": "The question is trying to get at like, how important is it that the actual hands you have versus the hands you're representing?"}, {"time": 1721, "text": "Right, so that's the question of essentially, if you're not looking at your hand preflop, you're basically giving up a fundamental advantage, right?"}, {"time": 1728, "text": "Where you're gonna be playing way suboptimally in terms of your hand selection, right?"}, {"time": 1732, "text": "Cause if you don't look at your hand, you might have a two and a three."}, {"time": 1734, "text": "That's not good, but now you're playing it."}, {"time": 1736, "text": "So you've invested whatever, two, 3000 bucks with absolute garbage, and it's very difficult to climb that hill, right?"}, {"time": 1743, "text": "So it's much better to actually look at your cards and go, okay, I'll throw away the two and three and I'll play the ace king."}, {"time": 1748, "text": "Speaking of garbage, you've said that 10, seven is your favorite poker hand to play."}, {"time": 1753, "text": "Is that still the case and what aspect of it is that you enjoy?"}, {"time": 1758, "text": "Yeah, so it's one of those viewer discretion is advised."}, {"time": 1761, "text": "Like 10, seven, I've just noticed throughout my life, you know, it's a tendency thing that I've been lucky with it."}, {"time": 1767, "text": "So that's just sort of, but it's not like I'm gonna look at 10, seven and go, oh, wow, you know, I'm gonna call it all in or anything like that."}, {"time": 1773, "text": "I'll play it in situations where it makes sense, but you know, it's rare cause it's not a very good hand."}, {"time": 1778, "text": "But is there some aspect of belief in the magic of this hand manifests quality of play?"}, {"time": 1787, "text": "Or is that a little?"}, {"time": 1787, "text": "There should be."}, {"time": 1788, "text": "So here's the thing, it's, you know, poker players, some have said it's unlucky to be superstitious, but we're all a little bit superstitious, a little bit."}, {"time": 1795, "text": "You know, and so I don't know, maybe it is a case where when I have 10, seven, I feel somehow energetically that, you know, I'm more likely to catch something, which may actually make me more apt to be aggressive and confident in the hand."}, {"time": 1807, "text": "But you really shouldn't let yourself do that."}, {"time": 1810, "text": "Like you're not supposed to fall in love with any specific hands."}, {"time": 1812, "text": "Yeah, but you know, uncertainty is ruthless."}, {"time": 1818, "text": "It's, you know, the fact that it's a game of statistics, it can be too painful for the human psychology."}, {"time": 1826, "text": "So maybe you have to hold on to certain superstitions."}, {"time": 1830, "text": "Because, you know, I mean, there's a cold absurdity to the fact that you can play extremely well and still lose."}, {"time": 1838, "text": "I mean, actually this year you've played the, what is it, 50 days of World Series of Poker."}, {"time": 1847, "text": "And it seems like, at least from the perspective of me looking at it through the internet, it seems like there's a lot of hands that you were like 70, 30, 80, 20, all in hands that you just did not, were not going your way."}, {"time": 1862, "text": "That can sort of break you mentally."}, {"time": 1865, "text": "Yeah, one of the hardest things, especially about playing, because cash games and tournaments are different."}, {"time": 1869, "text": "One of the most difficult things about, you know, being a tournament player is resilience."}, {"time": 1873, "text": "Because more often than not, like, so if there's a tournament with a thousand people, to win the tournament, you have to get all of the chips."}, {"time": 1879, "text": "That means there's one winner and 999 losers."}, {"time": 1882, "text": "So it's very rare that you actually like win all the chips."}, {"time": 1885, "text": "So you're essentially at some point in every tournament you play, gonna deal with like really bad luck and disappointment."}, {"time": 1891, "text": "And sometimes those streaks can have you question yourself and be introspective about, okay, so I think I'm 47 now."}, {"time": 1898, "text": "I think I've gotten better as time went on between distinguishing, okay, am I losing right now because of bad luck?"}, {"time": 1904, "text": "Or is it fundamentally decisions I'm making are not very good, right?"}, {"time": 1908, "text": "And that's one of the hardest things for anyone who plays poker to get to, right?"}, {"time": 1913, "text": "Why am I losing?"}, {"time": 1914, "text": "Am I losing because of my opponents being better?"}, {"time": 1917, "text": "I'm not playing well, or am I losing just because of luck?"}, {"time": 1919, "text": "And because there's so much variance in poker, a lot of players can be confused on both sides of the coin."}, {"time": 1926, "text": "One guy's winning and he thinks he's great."}, {"time": 1927, "text": "He's really not, wait till the cards break even as we say."}, {"time": 1931, "text": "I think there's a lot of parallels to life as well."}, {"time": 1933, "text": "If you get screwed over, over and over, it's hard to know if you're doing something wrong or if it's just bad luck."}, {"time": 1939, "text": "I think they did a study."}, {"time": 1940, "text": "I remember there was like a study that was mostly related to gambling, but it was mice and they put them in a little maze and they go down these three tubes and they go down this one tube and there'd be cheese, right?"}, {"time": 1950, "text": "And then they go down again, cheese."}, {"time": 1952, "text": "Three times in a row there was cheese there, right?"}, {"time": 1954, "text": "The next time there was an electric shock there, not cheese."}, {"time": 1959, "text": "The rat went, you know, the mouse went to get zapped."}, {"time": 1962, "text": "He got zapped, okay, came back."}, {"time": 1964, "text": "He kept going back to get zapped until he died."}, {"time": 1967, "text": "Like he kept going because he found cheese there."}, {"time": 1970, "text": "He has one there."}, {"time": 1972, "text": "So he continued to go chase that win despite it being, you know, now all of a sudden not worthwhile till he died."}, {"time": 1979, "text": "And essentially what they said was that is essentially how they compared it to like, you know, the gambling brain and how people think about gambling."}, {"time": 1986, "text": "You're chasing the wins."}, {"time": 1988, "text": "You learn too much."}, {"time": 1989, "text": "You sort of overgeneralize the lessons learned from the times you've won."}, {"time": 1993, "text": "So yeah, like beginner's luck can be detrimental."}, {"time": 1995, "text": "If you have some early luck and you believe that this is just the way it's supposed to be forever, you know, it can put you in a delusional state where, you know, you feel like I'm just great, but no, you're not."}, {"time": 2007, "text": "You were just lucky in the beginning."}, {"time": 2008, "text": "I actually played poker once in Vegas."}, {"time": 2011, "text": "It was a, it wasn't a tournament, but it was a kind of tournament like style."}, {"time": 2017, "text": "I already forgot what it was."}, {"time": 2019, "text": "But what I do remember is that I had four of a kind."}, {"time": 2022, "text": "So the last hand I've ever played in poker was, I got a four of a kind and there was a couple of others with really strong hands."}, {"time": 2031, "text": "So everybody went all in."}, {"time": 2033, "text": "And I think you get some kind of bonus for getting four of a kind."}, {"time": 2035, "text": "Bad beat jackpot you were playing in."}, {"time": 2036, "text": "Yeah, so something like this."}, {"time": 2038, "text": "I apologize if I don't know the details, but I just remember winning a lot of money and I walked away from the table."}, {"time": 2044, "text": "I said, I'm not playing poker again."}, {"time": 2046, "text": "I'm gonna hit it up top."}, {"time": 2047, "text": "Cause I started to feel like this is your, I started to think, even though I haven't really played poker at all, that I'm good."}, {"time": 2053, "text": "And that was a really dangerous feeling."}, {"time": 2055, "text": "And everybody was really mad for walking away from the table."}, {"time": 2058, "text": "One of the other things that I think is interesting about poker too is good is relative, right?"}, {"time": 2061, "text": "So you could be the seventh best player in the whole world, like literally seventh best player."}, {"time": 2066, "text": "But if you're playing with the other six, you're the sucker."}, {"time": 2070, "text": "You are like the worst player in the game, right?"}, {"time": 2073, "text": "So like there's a lot of players, for example, like the Dan Blazarians of the world, right?"}, {"time": 2078, "text": "He's not a top level player, like these guys you see on TV, but he probably makes more money than they do because he plays with people that are far below his skill level."}, {"time": 2087, "text": "So part of the skill of being a poker player is finding situations where you're profitable, regardless of your skill level."}, {"time": 2095, "text": "Another connection to life."}, {"time": 2097, "text": "Do you think Dan Blazarian is telling the truth about having made, what is it, $50, $100 million?"}, {"time": 2104, "text": "Just a huge amount of money playing poker."}, {"time": 2129, "text": "I don't see any reason why."}, {"time": 2130, "text": "Listen, where he got his money initially, that's up to interpretation from his father or whatever, but has he made a bunch of money playing poker?"}, {"time": 2138, "text": "Absolutely, no question."}, {"time": 2140, "text": "Do you feel, as somebody who loves the game, do you think there's something almost ethically wrong in playing people much worse than you?"}, {"time": 2148, "text": "So yeah, that's a good question because part of the reason I played poker and wanted to become professional was I wanted to make my mother proud, right?"}, {"time": 2157, "text": "And I don't think she would be proud of me taking Grandma Betty's last $5 and down the street, sending her broke and taking her pension check."}, {"time": 2165, "text": "So I play at the high stakes against people who can afford it."}, {"time": 2167, "text": "They know who I am."}, {"time": 2168, "text": "I'm not a hustler."}, {"time": 2169, "text": "I'm not pretending I'm bad at poker to squeeze in."}, {"time": 2172, "text": "I was thinking about this just yesterday because I played in a game that if I played that sort of role where a lot of guys do pros that sort of play down their skill level, pretend they're just one of the guys, these guys can make $20, $30 million in a year, legitimately."}, {"time": 2187, "text": "Like I believe that like, if I did that, if I just said, you know what, I'm gonna go down that path, get into these games in LA, you know, and travel and do all this kind of stuff, I can make 20 million a year."}, {"time": 2195, "text": "But it feels a little greasy, right?"}, {"time": 2198, "text": "I don't like to kiss anyone's ass."}, {"time": 2199, "text": "I don't like to ask anyone for a favor or things like that."}, {"time": 2203, "text": "So, but yeah, like I feel, listen, a rich guy who wants to sit down with a million bucks and get drunk and lose it, I have no empathy for that."}, {"time": 2213, "text": "I'm like, I don't have any moral qualms with that."}, {"time": 2215, "text": "So if a grandma Betty is a billionaire."}, {"time": 2219, "text": "Send it, send it, right?"}, {"time": 2221, "text": "You know, absolutely, why not?"}, {"time": 2224, "text": "Well, let me ask you about a tough period of your recent life."}, {"time": 2228, "text": "You had a rough, like we mentioned, the World Series of Poker losing $1.1 million over 48 days."}, {"time": 2235, "text": "What were you going through mentally during that?"}, {"time": 2238, "text": "So here's the thing, you know, I do, like you said, I do a YouTube vlog every day."}, {"time": 2241, "text": "So I kind of share my thoughts and listen, I can edit that thing and keep out the bad stuff, but I think it's more authentic and genuine to show people the actual struggles and the pain that I go through, you know, without it."}, {"time": 2252, "text": "And I'd say the one thing I'm most proud of throughout the entire thing is the resilience because there are moments you see me where I'm broken."}, {"time": 2259, "text": "I'm just like, I can't take it."}, {"time": 2259, "text": "I broke a selfie stick this year."}, {"time": 2261, "text": "Like I was filming it."}, {"time": 2262, "text": "Cause you know, I do for my vlog, I smashed the stick through it in the corner, right?"}, {"time": 2266, "text": "It's just, that was my like hit rock bottom moment."}, {"time": 2269, "text": "And then I put the camera on me and I was like, all right, I'll let people see it."}, {"time": 2272, "text": "But mentally it was very difficult because there was a feeling of hopelessness where I was making good decisions."}, {"time": 2280, "text": "Like I genuinely felt like I'm playing really, really well."}, {"time": 2282, "text": "But every time my money went in and my opponent's money went in and say, I was 60%, 70%, 80% for about a two week stretch, I lost every one of those."}, {"time": 2291, "text": "And you start to wonder, you're like, I can't win if I never win, you know, in these spots."}, {"time": 2296, "text": "So it was difficult."}, {"time": 2298, "text": "Luckily I have, you know, 20 odd years of experience on how to deal with it."}, {"time": 2301, "text": "And so, as I said, I wake up the next day, ready to go."}, {"time": 2306, "text": "So as if nothing happened."}, {"time": 2307, "text": "To a certain degree."}, {"time": 2308, "text": "Obviously, you know, the more, the more it happens in the higher vines, like the one where I broke the selfie stick, I lost 500,000 in that tournament, right?"}, {"time": 2317, "text": "And it was like the last card, it was painful."}, {"time": 2318, "text": "I think you lost."}, {"time": 2320, "text": "Yeah, that was great, that video."}, {"time": 2323, "text": "I think he lost."}, {"time": 2325, "text": "What led up to the selfie stick gate?"}, {"time": 2327, "text": "Like what, you just lost your shit for a, like a hundred milliseconds."}, {"time": 2333, "text": "Like it was very brief."}, {"time": 2335, "text": "You're just like, what, the world wasn't making any sense."}, {"time": 2338, "text": "Like, how do I keep losing kind of thing?"}, {"time": 2340, "text": "How did you, why did you lose your shit?"}, {"time": 2342, "text": "You should never really think like this, but part of me felt like I deserved to win this, right?"}, {"time": 2346, "text": "So part of me was like, listen, I've lost so many in the last two weeks, all right."}, {"time": 2350, "text": "Let, you know, the poker gods be kind to me right now."}, {"time": 2352, "text": "Let me win this."}, {"time": 2353, "text": "And it looked good."}, {"time": 2354, "text": "I was in a great situation on the flop, great situation on the turn."}, {"time": 2358, "text": "I'm about to be a competitor."}, {"time": 2360, "text": "I'm going to be a contender in this tournament to win a big prize pool and turn the whole thing around."}, {"time": 2364, "text": "It's all there for the taking."}, {"time": 2366, "text": "And then boom, the last card, it just, you know, it was a couple of weeks of frustration in the moment of filming that I just had, you know, sort of a visceral reaction, you know, and I smacked the, smacked the selfie stick."}, {"time": 2377, "text": "And then like, I, it was, I see a corner, it's safe."}, {"time": 2380, "text": "I threw the selfie stick on the ground."}, {"time": 2381, "text": "And of course, social media blows up about how, you know, it was a violent act, you know?"}, {"time": 2387, "text": "I mean, it's like, have you never watched sports?"}, {"time": 2389, "text": "Have you never seen a guy on the golf course smack his club or throw their helmet?"}, {"time": 2393, "text": "Like, you know, there was the, there's a guy, Justin Bonomo is a poker player."}, {"time": 2397, "text": "And he's a super, how to, for lack of a better word, offended by everything."}, {"time": 2402, "text": "And he was equating my throwing a stick on the ground to violence against women, domestic abuse, and the idea that like, this makes women feel unsafe to play poker."}, {"time": 2412, "text": "And so that was kind of a running joke for the last two weeks where every time I sat at a table, the guys would be like, oh, I feel unsafe, I feel unsafe."}, {"time": 2420, "text": "Can you take me through the hand?"}, {"time": 2421, "text": "Do you remember what the hand was?"}, {"time": 2421, "text": "Like, what was the... Yeah, so it was a, you know, a player on the button raised."}, {"time": 2425, "text": "David Peters, very aggressive player."}, {"time": 2427, "text": "He went all in from the blind and I had a pair of pocket tens."}, {"time": 2431, "text": "So I went with my tens and he had queen 10 of spades."}, {"time": 2434, "text": "So I was good."}, {"time": 2435, "text": "I have way the best hand."}, {"time": 2437, "text": "And the flop was like king nine, three, one spade."}, {"time": 2440, "text": "Turn was like the eight of spades."}, {"time": 2442, "text": "So now he has a flush draw and the river was another spade."}, {"time": 2445, "text": "So he caught spade, spade, and he made a flush."}, {"time": 2447, "text": "Wow, but statistically you were winning the whole time."}, {"time": 2450, "text": "Yeah, I was winning it up until the last card."}, {"time": 2452, "text": "What did he go all in on?"}, {"time": 2453, "text": "Was it a bluff?"}, {"time": 2454, "text": "He made what's considered like a pretty standard play in modern poker where, you know, a guy raised and he was just trying to pick up, you know, what was there."}, {"time": 2461, "text": "And he ran into a hand in the big blind and you know, he got lucky."}, {"time": 2464, "text": "So what was the throughout the strategy of preparation, the strategy of play?"}, {"time": 2469, "text": "So you're playing so many days."}, {"time": 2472, "text": "Are you trying to ignore the results and stick to a particular strategy?"}, {"time": 2476, "text": "Yes, for the most part, you know, what I'm trying to do is like, I formulate a strategy for the whole seven weeks cause there's a varying degree of buy ins too."}, {"time": 2485, "text": "Like you have small ones, like 1500, then you've got like $250,000 buy in."}, {"time": 2490, "text": "So I map out the seven weeks and right, I'll give a little bit of mental energy to the 1500, which means I'll be on my phone."}, {"time": 2497, "text": "I'm not gonna, I don't care as much about this one, but the 250K fully engaged, fully focused, you know, up against obviously the higher the buy in, you know, super top competition."}, {"time": 2508, "text": "And you know, as far as strategy goes, focusing on each day, playing the best I can, not the result."}, {"time": 2515, "text": "Like, cause if you focus on the result, you're focusing in the wrong place."}, {"time": 2518, "text": "Your focus should be on the decisions you actually make."}, {"time": 2522, "text": "Right, and if you're making good decisions consistently, you have to continue to do that."}, {"time": 2525, "text": "The frustrating part is this, with poker, unlike chess or other things, making the best possible decision doesn't mean you win."}, {"time": 2532, "text": "Often you lose, you don't, chess."}, {"time": 2535, "text": "Well, Magnus Carlsen has also talked about that."}, {"time": 2540, "text": "There's some non deterministic thing about chess too, given the limited cognitive capacity of the human mind."}, {"time": 2550, "text": "So he says that the world championship should have 20, 30, 40, 50 games, not the few that they have."}, {"time": 2556, "text": "It's too low of a sample."}, {"time": 2558, "text": "So in that sense, the high stakes poker tournaments are very too low sample."}, {"time": 2565, "text": "Well, when you think of the world series of poker, so as you said, I lost about 1 million, right?"}, {"time": 2569, "text": "In one tournament, that was 500,000."}, {"time": 2572, "text": "So then, you know, like a few others here of high buying tournaments."}, {"time": 2574, "text": "So the sample or the amount was, you know, 40, 50 total tournaments with, you know, high variance."}, {"time": 2580, "text": "And if you don't run well or do well in the highest buy ins, you know, you're gonna have a losing summer."}, {"time": 2586, "text": "So you did a podcast on the mental game a few years ago, but then that's just something you really care about."}, {"time": 2590, "text": "So what aspects of the mental game in poker is most difficult to master?"}, {"time": 2595, "text": "I think the most difficult thing for people is self awareness, right?"}, {"time": 2598, "text": "And resilience, self awareness to know, okay, so, you know, again, is it, am I not doing as well as I could be because of luck or is there things that I can learn?"}, {"time": 2608, "text": "And I always look to mistakes as opportunities."}, {"time": 2611, "text": "When I make a mistake in a poker hand, right?"}, {"time": 2614, "text": "Call it a breakdown or whatever, that's where breakthroughs happen."}, {"time": 2618, "text": "And I'm like, oh, you know what I could have done here?"}, {"time": 2620, "text": "I could have done this and that would have been really good and I'm gonna do that going forward."}, {"time": 2624, "text": "So I think like with anything, you know, when you start out playing golf, like your goal is to just hit the ball, right?"}, {"time": 2632, "text": "Then you try to hit it in the air, then you're trying to hit it straight, then you're trying to hit it on the green, then you're trying to hit it closer to the green to the point where the pros get where, you know, they're so finite, they're trying to hit it 63 yards and spin it back three yards."}, {"time": 2648, "text": "Like they don't hit the perfect shot because the perfect shot for them is it goes in, but they try and make the mistakes smaller and smaller and smaller."}, {"time": 2655, "text": "Poker is the same."}, {"time": 2657, "text": "We all make mistakes consistently."}, {"time": 2659, "text": "The goal is to minimize, especially the big ones."}, {"time": 2663, "text": "What was the lowest point for you psychologically in poker in general, actually?"}, {"time": 2668, "text": "Maybe it was this year, maybe it was in general."}, {"time": 2671, "text": "Do you remember there was times in your life, speaking of resilience, that were extremely difficult to you mentally?"}, {"time": 2677, "text": "Yeah, so early on, you know, as basically as a teenager, I was playing in Toronto and then in my early 20s, I'm like, I'm going to Vegas, right?"}, {"time": 2684, "text": "And I thought I was the best."}, {"time": 2686, "text": "I'm like 21 years old, I'm like, check me out, right?"}, {"time": 2689, "text": "Show up with $3,000, 24 hours later, you know, money's gone."}, {"time": 2694, "text": "And I remember the moment vividly."}, {"time": 2698, "text": "It was at the Binion's Horse, it was about three in the morning."}, {"time": 2700, "text": "I was playing with seven other people."}, {"time": 2702, "text": "You know, I lost my last chips."}, {"time": 2704, "text": "I went to the bathroom, washed up, got out."}, {"time": 2709, "text": "And it was like a moment where I realized like, okay, in Toronto, I was the big fish."}, {"time": 2712, "text": "But here, they were playing because of me."}, {"time": 2715, "text": "I was the sucker."}, {"time": 2716, "text": "I remembered every one of their faces."}, {"time": 2717, "text": "And then I remember not having enough money to get back to budget suites where I was staying."}, {"time": 2722, "text": "So I walked, you know, I walked."}, {"time": 2724, "text": "And in that moment I was thinking about like, is this something that I'll be able to do?"}, {"time": 2728, "text": "Am I good enough?"}, {"time": 2729, "text": "You know, what am I going to do now?"}, {"time": 2730, "text": "I'm in Vegas, I don't know anybody and I have no money, right?"}, {"time": 2734, "text": "So that was certainly like what felt like a low point, walking back behind Paradise and Twain, which is not a great part of town."}, {"time": 2743, "text": "Where did you find the strength to answer yes to that question that you can still do good?"}, {"time": 2748, "text": "I think this has been sort of a pattern in my life where like in the evening after it happens, like I don't have it."}, {"time": 2754, "text": "You know, I don't have that feeling of hope or, you know, resilience, if you will."}, {"time": 2759, "text": "I'm allowing myself to experience despair, which is exactly where I'm at."}, {"time": 2764, "text": "But then a good night's sleep, wake up the next morning and just within me, I have that inner confidence to say, you know what?"}, {"time": 2770, "text": "Fuck it, get back on the hobby horse, find a way, make it work, right?"}, {"time": 2775, "text": "But I do believe it's really therapeutic and worthwhile to allow yourself to feel and vent."}, {"time": 2781, "text": "So many people today, the Instagram culture world, I call it, it's like they want to act like they're perfect."}, {"time": 2786, "text": "Nothing bothers them, bullshit, right?"}, {"time": 2788, "text": "You're pissed off, it's okay to show it."}, {"time": 2790, "text": "Emotion's fine, we all have it."}, {"time": 2792, "text": "There's no reason you have to suppress it."}, {"time": 2794, "text": "Obviously, you don't want to have guys throwing selfie sticks around the room every time they lose a pot, right?"}, {"time": 2799, "text": "But, you know, a little bit of... You're gonna make everybody feel unsafe."}, {"time": 2803, "text": "That happens."}, {"time": 2804, "text": "So you're saying, there is a culture of saying, you know, stay positive, all this kind of stuff, but you know, when you feel despair, don't resist it, ride it out."}, {"time": 2812, "text": "Because it doesn't go away, right?"}, {"time": 2814, "text": "That feeling, you know, you think you put it away in the pit of your stomach and you think, you know, it's gone, it's not, it's still there."}, {"time": 2819, "text": "Let yourself go, fuck!"}, {"time": 2821, "text": "It's all right."}, {"time": 2822, "text": "You know, there's nothing wrong with being a little bit emotional, because once you've experienced it, you let it out, now you can move past it."}, {"time": 2830, "text": "Yeah, and I feel like, as long as your brain chemistry can support it, you can usually learn a good lesson from it, like you become stronger, you become more resilient through it."}, {"time": 2841, "text": "And a good night's sleep can really help."}, {"time": 2844, "text": "So through 2022, and in general, what is a perfect day in the life of Daniel Negrano look like when you're, like on a day when you have to play a big game, big tournament game and so on?"}, {"time": 2857, "text": "So like, what time do you wake up?"}, {"time": 2859, "text": "What do you eat for breakfast?"}, {"time": 2861, "text": "So my life is twofold."}, {"time": 2863, "text": "Like one, when I'm playing hardcore, and one when I'm not."}, {"time": 2867, "text": "And they look very different, right?"}, {"time": 2869, "text": "So I'll give you a quick glimpse of like when I'm not, up at 10, you know, breakfast, in the gym at noon, you know, post workout, meal, coffee, walk, like, you know, I try to get, that's what I do for cardio, you know, and just very like home bodied."}, {"time": 2887, "text": "I don't leave the house."}, {"time": 2888, "text": "It's very like boring and mundane, right?"}, {"time": 2890, "text": "Long distance walks."}, {"time": 2891, "text": "So like, what do you do when you're walking?"}, {"time": 2893, "text": "You're thinking about stuff?"}, {"time": 2894, "text": "Well, no, honestly, I just walk on the treadmill."}, {"time": 2895, "text": "I try to get 15,000 steps a day."}, {"time": 2897, "text": "And I just walk for basically like an hour while I watch a show or I'm on the computer or something like that, you know, I'm on the treadmill."}, {"time": 2903, "text": "Why walk and not running?"}, {"time": 2905, "text": "Well, I mean, I think walking, I mean, I do a little bit of running, but hardly any."}, {"time": 2909, "text": "I don't enjoy it."}, {"time": 2910, "text": "Like, I just like walking."}, {"time": 2911, "text": "And frankly, for fat loss, when it's usually what I'm doing after big poker tournaments is getting back in shape, that walking's ideal for it, right?"}, {"time": 2920, "text": "So essentially it's like the tale of two."}, {"time": 2921, "text": "During the World Series of Poker, all my sort of structured life thrown out the window."}, {"time": 2927, "text": "There's no walking."}, {"time": 2928, "text": "There's very little walking."}, {"time": 2930, "text": "There's very little working out."}, {"time": 2931, "text": "There's very little anything."}, {"time": 2932, "text": "I go into the World Series, you know, like this year I went in around 157 and I expected to gain about 10 pounds during the World Series."}, {"time": 2940, "text": "Not good pounds, it wasn't muscle, but that's about what I did, 165."}, {"time": 2943, "text": "And then I spend the next month trying to, you know, lose it."}, {"time": 2946, "text": "But during the World Series, when I'm playing, the most important thing without question that I have to focus on, and this is why I stopped focusing on working on all this stuff is sleep."}, {"time": 2956, "text": "If I'm not rested, I'm useless."}, {"time": 2958, "text": "If I only get five, six hours and I have to go back the next day and play 14 hours, the chances of me being at my best, very, very slim."}, {"time": 2966, "text": "So sleep is a priority."}, {"time": 2967, "text": "What's the perfect amount of sleep for you on those days?"}, {"time": 2970, "text": "Eight, seven?"}, {"time": 2970, "text": "So eight hours is my go to every night."}, {"time": 2973, "text": "During the World Series of Poker, it's just not possible because of the way that it's structured."}, {"time": 2977, "text": "Sometimes the tournaments end at 2.15 a.m."}, {"time": 2980, "text": "I get home about three o clock."}, {"time": 2984, "text": "Takes me 30 minutes, 40 minutes to get to sleep."}, {"time": 2986, "text": "So now let's say I'm in bed by four."}, {"time": 2988, "text": "Well, the tournament's at, you know, two."}, {"time": 2991, "text": "So I have to get up and whatever."}, {"time": 2993, "text": "So it's very difficult to get exactly eight a lot of the time."}, {"time": 2996, "text": "You know, and also get back there in time."}, {"time": 2997, "text": "Is there any hacks to quiet the mind?"}, {"time": 3001, "text": "Because you're going on a pretty intense rollercoaster mentally when you're playing."}, {"time": 3007, "text": "Is there any tricks to getting to sleep given the rollercoaster?"}, {"time": 3010, "text": "I've been very lucky."}, {"time": 3012, "text": "Like I'm blessed."}, {"time": 3012, "text": "I don't know if it's because of diet or what, but I've always been a very good sleeper."}, {"time": 3016, "text": "You just shut off."}, {"time": 3017, "text": "I get to sleep and I sleep like a baby, you know?"}, {"time": 3019, "text": "And I also nap really well."}, {"time": 3021, "text": "Like during the World Series, sometimes what will happen is let's say I get knocked out of one event at 4 p.m. And there's another one that I can jump in."}, {"time": 3028, "text": "Instead of jumping right into it, I'll go into like a private room and take 45 minute nap."}, {"time": 3034, "text": "And you know, and give me enough energy to continue and sort of reset my mind."}, {"time": 3038, "text": "Yeah, and it solves a lot of problems with the nap too."}, {"time": 3041, "text": "Yeah, I feel like the nap is a magical trick in life."}, {"time": 3046, "text": "What else, diet wise?"}, {"time": 3047, "text": "What do you, your mind is going, you know, pretty intensely all day."}, {"time": 3053, "text": "Yeah, so during like, like I said, when I'm not playing, I'm super regimented."}, {"time": 3058, "text": "You know, I have, I literally measure everything."}, {"time": 3061, "text": "You know, I count calories, I count macros, I follow it to a T. Pretty balanced diet or any?"}, {"time": 3067, "text": "I'm a vegan."}, {"time": 3068, "text": "Vegan, yeah."}, {"time": 3069, "text": "So it's, you know, a vegan diet, like."}, {"time": 3070, "text": "But balanced in terms of carbs and protein."}, {"time": 3072, "text": "Yeah, yeah, no, I mean, I eat a healthy amount."}, {"time": 3073, "text": "I'm doing probably 150 grams of protein, like 60 grams of fat, 50, and then about."}, {"time": 3080, "text": "And try to measure it all out."}, {"time": 3081, "text": "I do, yeah, I basically, I created a meal plan."}, {"time": 3083, "text": "So what I did for myself is, cause I'm really anal and I made a spreadsheet with like a day's food and I have six different ones."}, {"time": 3089, "text": "So I just follow it."}, {"time": 3090, "text": "Like I don't, it actually makes my life so much easier when I don't have to think about what I'm going to eat for lunch or what I'm going to eat for dinner."}, {"time": 3097, "text": "I already know what I'm going to eat."}, {"time": 3098, "text": "I already wrote it down and it doesn't get boring because I'm switching it up every day, you know, every six days and occasionally I'll, you know, splurge or do something different."}, {"time": 3106, "text": "During the World Series of Poker, I eat whatever the fuck I want to eat."}, {"time": 3110, "text": "Like it's at 2 a.m."}, {"time": 3110, "text": "I don't crave like a broccoli carrot salad."}, {"time": 3114, "text": "Like I want chocolate, candy and chips."}, {"time": 3118, "text": "So I'll just do it."}, {"time": 3119, "text": "So you listen to the cravings."}, {"time": 3121, "text": "Yeah, I realized like."}, {"time": 3122, "text": "It's surprising because like, you're so regimented outside of that."}, {"time": 3127, "text": "Like I've done it before where I played the World Series of Poker and I made it a point to work out every day."}, {"time": 3133, "text": "But what that did was it sacrificed sleep."}, {"time": 3135, "text": "So then I found like at 1 a.m."}, {"time": 3135, "text": "I would be more tired, you know, because I've expended more energy than I would otherwise."}, {"time": 3141, "text": "So I essentially like look at the World Series is six, seven weeks where my body's just gonna take a beating, not like UFC fighter, but like a different kind of beating."}, {"time": 3149, "text": "And that's okay because I have so much confidence that within six weeks of just like eating right and working out, I can get back to where I was."}, {"time": 3156, "text": "But it's just hilarious to me that you'd be eating chocolate."}, {"time": 3159, "text": "What eating chocolate in bed as you're trying to get to sleep is this."}, {"time": 3162, "text": "Like literally a bag of like chips or chocolate, like on my way home and before bed, you know, just whatever."}, {"time": 3169, "text": "This is what the professional athlete does at the highest, most difficult event of his career."}, {"time": 3174, "text": "Okay, so what else is there in terms of mental preparation and focus and meditation, those kinds of things leading up to the games?"}, {"time": 3183, "text": "Is there anything you like to, like any rituals you like to follow?"}, {"time": 3187, "text": "So yeah, I have dabbled in the past with like meditation and different things like that."}, {"time": 3191, "text": "And I know that there's health benefits to it."}, {"time": 3193, "text": "And I understand that a lot of people get a lot from it and I've done it for a good amount of time, like long periods of time."}, {"time": 3200, "text": "I found that for me, I think it was predominantly placebo."}, {"time": 3203, "text": "Like it really wasn't doing anything for me that I felt like it was, it felt like I was doing something, but I really, I didn't see any specific results from it."}, {"time": 3211, "text": "So I don't really do that too much."}, {"time": 3213, "text": "One thing that I will do for me is leading up is there's so much footage now that I'll make it a point to like watch my opponents and then with like my phone, I'll take notes and I'll keep track of different things that I'm seeing."}, {"time": 3227, "text": "And that sort of, and then what I'll do is I'll formulate a game plan."}, {"time": 3230, "text": "Like I'm playing the Poker Masters coming up in about a week."}, {"time": 3234, "text": "And I'll look to see the tendencies of what my opponents are doing."}, {"time": 3236, "text": "And then I'll come up with like some things that I'm gonna do, some tricks of the trade, if you will."}, {"time": 3240, "text": "Not game theory optimal stuff, stuff that I think, oh, they're making a mistake here that I can exploit."}, {"time": 3245, "text": "And then I look to do that in different ways and always look to throw curve balls."}, {"time": 3251, "text": "How hard is that process?"}, {"time": 3254, "text": "Do you enjoy it or is it like really hard work to analyze the players to try to understand what are the different holes?"}, {"time": 3260, "text": "What are the different mistakes?"}, {"time": 3261, "text": "What are the strengths to avoid and that kind of stuff?"}, {"time": 3263, "text": "I think the only thing that makes it harder is when you're young, right?"}, {"time": 3267, "text": "And you're in your twenties and you're trying to make your nest egg."}, {"time": 3269, "text": "You're like, you're trying to make your retirement money."}, {"time": 3271, "text": "You're hungry, right?"}, {"time": 3272, "text": "You're like clubber Lang and you know the gym, you're hungry."}, {"time": 3275, "text": "Whereas, you know, Rocky's in there taking pictures and smiling and doing commercials and stuff like that."}, {"time": 3279, "text": "So I am 47, I'm financially okay."}, {"time": 3282, "text": "I don't need to win."}, {"time": 3284, "text": "I don't need to compete at the highest levels."}, {"time": 3286, "text": "So I think it was a boxer."}, {"time": 3287, "text": "I don't remember which one."}, {"time": 3288, "text": "When asked this, he was asked the question, how do you get up in the morning still and do those morning runs?"}, {"time": 3294, "text": "And he says, you know what?"}, {"time": 3295, "text": "I'll be honest with you."}, {"time": 3296, "text": "It's a lot more difficult doing the 4 a.m. run in silk pajamas, right?"}, {"time": 3300, "text": "It just is, right?"}, {"time": 3302, "text": "But I've always been self motivated and I've always found a way."}, {"time": 3307, "text": "So it's harder in the sense of like, it's not a need."}, {"time": 3310, "text": "I can still get by without it."}, {"time": 3312, "text": "But so in that regard, it does feel like a little bit of work where like, oh my God, that's a lot of footage I gotta get through."}, {"time": 3318, "text": "And I don't know that I have the time or I don't know that I wanna spend 10 hours of my day doing that when I could be doing other things."}, {"time": 3325, "text": "I mean, what do you still love about poker?"}, {"time": 3328, "text": "When you said, when you enter, like the times you catch yourself just being able to sort of take in the awe of it."}, {"time": 3337, "text": "What aspects do you love?"}, {"time": 3339, "text": "I think that like for me, I've always been really competitive, but I was never gonna be a professional athlete or a professional snooker player."}, {"time": 3345, "text": "I wasn't good enough at any of that stuff."}, {"time": 3346, "text": "I didn't have the body type, whatever."}, {"time": 3349, "text": "But poker, it sort of levels the playing field, right?"}, {"time": 3351, "text": "You're six, five, 240, big deal."}, {"time": 3354, "text": "We're not fighting here."}, {"time": 3355, "text": "We're fighting a different type of war."}, {"time": 3357, "text": "So the competitive aspect, I also have always been fueled throughout my career by doubters."}, {"time": 3364, "text": "So this is probably unhealthy, but every time people say like, you're done, you're washed up, you can't win anymore, it just makes me wanna prove them wrong, right?"}, {"time": 3373, "text": "So I have a little bit of that in me, which again, you're reading the comments and all these kinds of, like I've been told many times throughout my career for the last 15 that I'm done."}, {"time": 3381, "text": "I can't compete anymore."}, {"time": 3382, "text": "And I enjoy proving them wrong."}, {"time": 3387, "text": "Yeah, the game has changed so much."}, {"time": 3391, "text": "The greats of the past surely cannot be the greats of the present."}, {"time": 3395, "text": "That kind of commentary will continue for every sport."}, {"time": 3398, "text": "And certainly for poker, because poker really changed a lot over the past couple of decades."}, {"time": 3403, "text": "Can you speak to how much it has changed?"}, {"time": 3406, "text": "Because you've been at the top for so long."}, {"time": 3407, "text": "Yeah, so complacency is a big issue for people who make it, if you will, right?"}, {"time": 3411, "text": "So in my era of the poker boom, around the early 2000s, there was a group of players who were the big names, the stars of the game."}, {"time": 3417, "text": "Well, a lot of them had their egos out of whack where they just felt like, okay, I'm the best, that's it."}, {"time": 3423, "text": "Like, no, there's young guys learning, there's new software, there's solvers, there's all these kinds of things."}, {"time": 3428, "text": "And if you're not keeping up, then you'll get surpassed."}, {"time": 3431, "text": "And I remember myself at a very early age saying, I never want to be that guy."}, {"time": 3435, "text": "And it was one of my first events in the late 90s."}, {"time": 3437, "text": "I was the young buck playing with the Tom McAvoy's and Brad Doughty, the guys of the era, right?"}, {"time": 3443, "text": "And I was doing things more aggressively and they were scoffing at all these young kids with their aggressive three and all this stuff."}, {"time": 3449, "text": "And they were sort of mocking it, you know?"}, {"time": 3451, "text": "And I thought, never be that guy."}, {"time": 3453, "text": "Always have the humility to be introspective and always have the respect for your opponents that while you think you've got it all figured out, they're learning new things and you can learn from them."}, {"time": 3463, "text": "So I've always been willing to sort of swallow my pride and get coached by younger players who I might even be better than, but they see blind spots that I have that I might not."}, {"time": 3473, "text": "And they, you know, they helped me improve my game."}, {"time": 3475, "text": "I've always been willing to sort of look every six months or a year and say, is what I'm doing working?"}, {"time": 3479, "text": "And if not, how do I get better?"}, {"time": 3481, "text": "But most people from my generation, they go the other way."}, {"time": 3486, "text": "I don't know, they just have this idea that they figured it all out."}, {"time": 3488, "text": "Once you feel like you've mastered it, there's nothing left to learn."}, {"time": 3490, "text": "That's the moment where everyone else starts to surpass you."}, {"time": 3494, "text": "That's the moment where you lose the mastery because it's always evolving."}, {"time": 3498, "text": "How has the game changed?"}, {"time": 3500, "text": "So the game has changed in terms of the way people learn it, right?"}, {"time": 3503, "text": "When I started out, the only way to learn how to play poker was to sit your ass on the chair and play."}, {"time": 3508, "text": "In person?"}, {"time": 3509, "text": "Yes, in person, play."}, {"time": 3511, "text": "Maybe you jot down hands on a notepad."}, {"time": 3512, "text": "We didn't even have cell phones back then, right?"}, {"time": 3514, "text": "So I would write notes."}, {"time": 3516, "text": "I actually brought a notepad."}, {"time": 3517, "text": "And then you don't analyze it and sort of try to figure it out that way and think about maybe talking to friends and different players."}, {"time": 3525, "text": "Like when I grew up, there was John Jawanda, Alan Cunningham and Phil Ivey."}, {"time": 3528, "text": "And we would sort of create like a little bit of a mastermind."}, {"time": 3532, "text": "Well, how would you play this hand?"}, {"time": 3533, "text": "What would you do here?"}, {"time": 3534, "text": "That was the extent of it, right?"}, {"time": 3536, "text": "We never had the correct answers."}, {"time": 3537, "text": "We always had theories about what might be right."}, {"time": 3540, "text": "Not until about five, six years ago where everything changed."}, {"time": 3544, "text": "Where artificial intelligence created solvers that will specifically say, okay, this is the optimal play."}, {"time": 3551, "text": "This is the game theory optimal play."}, {"time": 3552, "text": "So now it introduced poker to a whole new group of like personality types."}, {"time": 3558, "text": "In my day, it was people that were dregs of society that didn't fit in, not college goers with a degree."}, {"time": 3564, "text": "These are people who were street hustlers playing pool."}, {"time": 3566, "text": "They found poker and they had these unique lives, right?"}, {"time": 3569, "text": "But now because poker can be studied, much like you study university or college, you had, for example, the German contingent who was literally analyzing data and coming up with strategies based on this."}, {"time": 3581, "text": "And it's like, what?"}, {"time": 3582, "text": "And the old guy, got to play by feel or whatever."}, {"time": 3585, "text": "And they're like, they're learning."}, {"time": 3587, "text": "So I guess the way that you describe it is like in the old days, it required skill and talent, a card sense, right?"}, {"time": 3593, "text": "That was the only way to become good."}, {"time": 3595, "text": "And today that's not the case."}, {"time": 3596, "text": "Good study habits, a good work ethic in that regard can make you like a really good player."}, {"time": 3601, "text": "Even if you aren't all that talented or gifted, having a good work ethic is a talent, right?"}, {"time": 3607, "text": "Not necessarily card sense, but if you're able to put in the work and study from these solvers, you essentially have the perfect study tool now that we didn't have in my day."}, {"time": 3617, "text": "So what do the solvers give you?"}, {"time": 3619, "text": "Do you start to memorize the optimal play for every single hand?"}, {"time": 3624, "text": "You try your best."}, {"time": 3625, "text": "So again, solvers are imperfect as well, in terms of the way the humans utilize them, right?"}, {"time": 3632, "text": "Because you can give solvers a certain number of inputs in terms of what you want it to solve, but a solver can think on many, many levels."}, {"time": 3640, "text": "So for example, the way that a typical player would do a solve is to say, okay, what does a solver think is the best play here?"}, {"time": 3647, "text": "Bet one third pot, bet two thirds pot, or bet one and a half times pot, okay?"}, {"time": 3652, "text": "You give it three parameters, it comes out with an output and it tells you what you should do with all the different hands you have."}, {"time": 3659, "text": "However, that's a simplified version of what a solver would really do, because a solver might decide that seven times the pot is best, 10% of the pot."}, {"time": 3668, "text": "But when you're putting in a solve, you can only put in specific parameters."}, {"time": 3672, "text": "So that's why, frankly, that's typically the number, one third, two third, and one and a half times pot is what people often do."}, {"time": 3678, "text": "So they sort of have a vague idea of what a solver wants."}, {"time": 3681, "text": "But again, imperfect in terms of the implementation of it."}, {"time": 3686, "text": "And memorizing all the variables, like that King Jack offsuit with the King of Diamonds is 13%, no human brain can do that."}, {"time": 3695, "text": "So what you do is you bucket it."}, {"time": 3697, "text": "Like you bucket it into say, instead of 10,000 variables, you have 10 buckets and you say, okay, with these hands, we do roughly this, and we do roughly this."}, {"time": 3705, "text": "And you try your best to stay within those lines."}, {"time": 3708, "text": "But again, what I love about live poker partly is that nobody will ever be able to master game theory, and mimic a solver."}, {"time": 3717, "text": "But you also have to incorporate your position, where you are, and obviously what cards you have, but also the size of your stack, how much money you have, and also whether you have the ability or desire to buy in, all those kinds of things."}, {"time": 3735, "text": "So you have to calculate all of that, right?"}, {"time": 3737, "text": "So the solver will do that, right?"}, {"time": 3740, "text": "And essentially, you don't input your hand."}, {"time": 3743, "text": "It tells you, you'll look at the grade, and be like, all right, this is my hand, and it tells you what it is."}, {"time": 3748, "text": "But it tells you what you would do with any hand, right?"}, {"time": 3750, "text": "It gives you the full output."}, {"time": 3752, "text": "And that actually gives you a better idea, because you're ultimately, like you said, playing a range of hands, not a hand."}, {"time": 3759, "text": "And the solvers do things that are really interesting."}, {"time": 3761, "text": "You've seen AlphaGo, I would imagine."}, {"time": 3763, "text": "Brilliant film, right, I thought."}, {"time": 3764, "text": "And I thought what was interesting is there was, you know, accepted theory from all the top Go players, this is what you do."}, {"time": 3771, "text": "But the AI was doing things way different, and they're like, this has to be wrong, but really it wasn't."}, {"time": 3776, "text": "So for example, a solver may say this, right?"}, {"time": 3780, "text": "Let's say you bet on the end, and you bet a lot, and a solver may say, you should fold here with a pair of kings and a queen kicker, which is, you know, a pair of kings, but call with a pair of fours and an ace kicker."}, {"time": 3795, "text": "So it's essentially telling you that you should fold this hand that is much better than this."}, {"time": 3800, "text": "So it begs the question, why?"}, {"time": 3803, "text": "Because what the solvers do is they use the information of your own cards to formulate all the possible hands your opponent can have."}, {"time": 3812, "text": "So if your opponent is, so basically if you had the king, queen, you know, it may say, for lack of a better nerdy term, it blocks potential bluffing hands that your opponent can have."}, {"time": 3824, "text": "So let's say if your opponent would bluff with queen, jack, but you have a queen."}, {"time": 3829, "text": "So there are less combinations of queen, jack."}, {"time": 3831, "text": "So it will find a better bluff catcher, if you will."}, {"time": 3834, "text": "So that's what's really not intuitive to poker players."}, {"time": 3836, "text": "Poker players usually think like, well, this, my hand is pretty good, so I got a call, but that's not how a solver would think."}, {"time": 3842, "text": "Solver uses, you know, common matrix and, you know."}, {"time": 3846, "text": "And sometimes it's tough to get the good why answers you just did for why a solver thinks something is better, or maybe in poker it's a little bit easier, but in the case of go and chess, it's not always obvious why, because it's not gonna explain stuff to you."}, {"time": 3860, "text": "I think one of the best ways to learn poker is when you see a solver output and it tells you one of these things, try to figure out why."}, {"time": 3868, "text": "Why does this solver do this?"}, {"time": 3870, "text": "Why does it want you to call with this and fold this?"}, {"time": 3872, "text": "And try to think about it on a deeper level."}, {"time": 3874, "text": "And you go, aha, probably because this card that I have here, you know, changes the range of my opponent's, you know, potential."}, {"time": 3882, "text": "I'd love to get your opinion on your relationship with solvers."}, {"time": 3885, "text": "Because for example, Magnus doesn't use them."}, {"time": 3887, "text": "His team uses them."}, {"time": 3889, "text": "Cause he feels like he's going to rely on it too much."}, {"time": 3894, "text": "And you can't use it when you're playing."}, {"time": 3897, "text": "What you really want is to build up an extremely strong intuition without the help of a solver."}, {"time": 3902, "text": "Is there some aspect of that that rings true to you?"}, {"time": 3905, "text": "I totally can relate to what Magnus is saying."}, {"time": 3907, "text": "First and foremost, because when solvers was first introduced, I didn't come from that world."}, {"time": 3911, "text": "I was so intimidated because I didn't know how to use it."}, {"time": 3913, "text": "I don't know how to do an input."}, {"time": 3915, "text": "So I had two guys, one guy's a data scientist and, you know, another guy's like a poker savant, if you will, and they coached me and they did it."}, {"time": 3922, "text": "So today, if I was in a tough spot, you know, and I'm like, I don't know, what would a solver do?"}, {"time": 3927, "text": "I will send them the hand and they'll run the solve for me."}, {"time": 3930, "text": "And then sort of give me the parameters of what to do."}, {"time": 3933, "text": "When I was playing, you know, regularly using solvers with them, we were spending six to eight hours a day going over all these solves."}, {"time": 3940, "text": "So intuitively I started to think and learn about what the solver would want, but I sort of understand where Magnus is coming from in that you don't want to become a slave to the sim, as I say, right?"}, {"time": 3949, "text": "There's one kid I know, I joked with him, his name is Landon Tice."}, {"time": 3953, "text": "And, you know, he made a play that the sim, you know, would say, this is a good play."}, {"time": 3957, "text": "But I'm like, it's a good play, you know, in a simulated world against the robot."}, {"time": 3961, "text": "It's not in practice against the human, right?"}, {"time": 3965, "text": "You don't need to be doing that."}, {"time": 3966, "text": "So if you become a slave to the sim and always do what the sim says, you're handcuffed to a certain degree."}, {"time": 3973, "text": "Is there some, at the highest level plays, there's still a role for feel and intuition?"}, {"time": 3980, "text": "If you're not doing that, cause here's the thing, right?"}, {"time": 3982, "text": "No human being plays perfectly balanced in game three optimal like a robot would."}, {"time": 3987, "text": "They're not, right?"}, {"time": 3989, "text": "So there are opportunities there to take advantage of the things that they do that are slightly too aggressive or less aggressive."}, {"time": 3995, "text": "You know, for example, say most human beings don't bluff enough in a certain spot."}, {"time": 4001, "text": "So you don't have to call with the correct range of hands."}, {"time": 4004, "text": "You don't have to, because they're not bluffing at the optimal frequency."}, {"time": 4008, "text": "So you don't have to call at the optimal frequency."}, {"time": 4010, "text": "You'd be making this mistake, frankly, if you did."}, {"time": 4013, "text": "What's the difference between in person and online play, given that context?"}, {"time": 4019, "text": "Yeah, well, online poker and live poker, it's the same game, right?"}, {"time": 4023, "text": "Same, it's poker, but it's different in so many levels, right?"}, {"time": 4027, "text": "I think playing online, you have to focus far more on fundamentals."}, {"time": 4031, "text": "You know, on game theory, you don't have the added bonus of looking across the table and getting any sense of whether your opponent is strong or weak, they're bluffing, whatever, you know."}, {"time": 4040, "text": "And also because online poker, those that play it, you play far more hands."}, {"time": 4046, "text": "Like some of these guys are playing 10, 20 tables at the same time, right?"}, {"time": 4050, "text": "So you're just, you're hitting the long run really quickly and you're creating a database on your opponents, right?"}, {"time": 4055, "text": "So let's say, you know, online, I can see your data."}, {"time": 4057, "text": "I'm like, well, this guy, he's playing 40% of hands."}, {"time": 4060, "text": "He's betting the river 80% of the time."}, {"time": 4063, "text": "So now I can use that data and, you know, exploit you that way."}, {"time": 4066, "text": "When you play live, you don't have that."}, {"time": 4069, "text": "Do you enjoy playing online?"}, {"time": 4071, "text": "I enjoy, so with online poker, I enjoy the convenience of it because, you know, you can be on your couch in your underwear, not leave your house."}, {"time": 4077, "text": "Do you also play multiple games at the same time or do you try to play one game?"}, {"time": 4081, "text": "I typically like to play one or two, but I can play up to four."}, {"time": 4085, "text": "I find that past four, it's hard for me to keep up and keep track of what's actually happening."}, {"time": 4091, "text": "You know, it's a different mindset required."}, {"time": 4093, "text": "Like a lot of these young guys, they're accustomed to 20 tables at a time."}, {"time": 4097, "text": "It feels like the purity of the game is gone."}, {"time": 4100, "text": "It's much more robotic, right?"}, {"time": 4102, "text": "So if you're playing 20 tables, you're just making decisions based on like what, you know, you're not thinking about the depth of the situation and what just happened 15 minutes ago."}, {"time": 4111, "text": "You don't even know what happened because you can't pay attention to all that at once."}, {"time": 4115, "text": "And some of the magic of poker is the low sample."}, {"time": 4118, "text": "For example, and sorry to be bringing up Magnus so much, but there's so much parallel between the two of you and the poker and the chess world."}, {"time": 4125, "text": "He hates Olympics and world championships and all that kind of stuff because it's so low sample."}, {"time": 4131, "text": "But to me, that's part of the magic of it."}, {"time": 4133, "text": "There's the World Series of Poker, the main event."}, {"time": 4136, "text": "There's a magic to it."}, {"time": 4139, "text": "And I don't know what that is exactly because so much of the stake is so rare, so much drama and heartbreak leading up to it that all somehow, yeah, it accumulates to that magical moment when somebody wins."}, {"time": 4155, "text": "Especially that event, the World Series of Poker main event historically, like that's it, you know, that's the pinnacle."}, {"time": 4160, "text": "That's where like mainstream watches, that's where people are tuning in and the gravity of the moment, you know, it's so much bigger than people, like everyone gets the opportunity to play armchair quarterback too, right?"}, {"time": 4170, "text": "Oh, he should do this."}, {"time": 4171, "text": "You're not there."}, {"time": 4172, "text": "You're not under the lights."}, {"time": 4173, "text": "You're not under the pressure."}, {"time": 4174, "text": "You know, it might seem easy for you at home to be like, well, yeah, but you can see the whole cards."}, {"time": 4179, "text": "You know, they can't."}, {"time": 4180, "text": "Certainly the idea of the small sample with tournaments, I like the idea that you don't have to worry about, oh, well, if I do this now, then in the future, you know, I won't be balanced."}, {"time": 4193, "text": "I have to be balanced here or anything like that."}, {"time": 4195, "text": "That's like really boring and lame, right?"}, {"time": 4197, "text": "Again, that is kind of the way the younger generation learns how to play the game, being balanced in every spot and then randomizing, you know, like, oh, I'm supposed to do this 50% of the time."}, {"time": 4209, "text": "Okay, so if my left card is red, I'll do it."}, {"time": 4212, "text": "And if it's black, I don't."}, {"time": 4213, "text": "So you're not even making, you're no longer making actual decisions for yourself."}, {"time": 4217, "text": "You're just randomizing."}, {"time": 4218, "text": "And that's way less fun for me than tailoring it to the situation."}, {"time": 4223, "text": "And the final table at the main event, there's none of that."}, {"time": 4225, "text": "You have to, I mean, it's all or nothing."}, {"time": 4228, "text": "Well, you shouldn't be, but there are like, again, I think a lot of the young guys, they are thinking in that regard, like, oh, randomization."}, {"time": 4234, "text": "Maybe at that table, the final table at the main event, what's a hand that stands out to you that was especially gutsy and powerful or memorable for that you've seen in the history of poker?"}, {"time": 4246, "text": "Well, for me, the one that stands out and probably because I was so young and it was my first year, like one of my wife, won a bracelet that year, was I was friends with Scotty Wynn, the Prince of Poker."}, {"time": 4256, "text": "And he was heads up against the guy named Kevin McBride."}, {"time": 4258, "text": "And I was on the rail, you know, I'm like, wow, he's gonna, you know, he's heads up."}, {"time": 4262, "text": "And he was so cool."}, {"time": 4263, "text": "Like he had a mullet, but it's perfect, right?"}, {"time": 4265, "text": "He had the white shirt, the black thing."}, {"time": 4267, "text": "He's drinking a Michelob, smoking a cigarette, whatever, you know, all chill."}, {"time": 4272, "text": "He bets it all on the river."}, {"time": 4273, "text": "And the guy's thinking, and he psychologically owned him."}, {"time": 4277, "text": "And he said, he goes with his beer, he goes, you call gonna be all over baby."}, {"time": 4281, "text": "Ha ha ha, that's right."}, {"time": 4283, "text": "Okay, so this guy who was an amateur heard that and was like, there's so much pressure in this moment right now."}, {"time": 4290, "text": "I can't handle this pressure."}, {"time": 4291, "text": "But Scotty just told me, if I call here, the pressure's gone."}, {"time": 4294, "text": "I don't have to be under it anymore."}, {"time": 4296, "text": "So he sort of hypnotized them into making the call, you know, and Scotty had it."}, {"time": 4301, "text": "Scotty had, you know, the full house and it was over for the guy."}, {"time": 4304, "text": "You call gonna be all over baby."}, {"time": 4305, "text": "It was, I just, I love that aspect, sort of the table talk dynamic, which isn't as prevalent today as it was back then, but that one sticks out."}, {"time": 4315, "text": "And it probably, because it was one of my first."}, {"time": 4317, "text": "So the few words you say at the table can completely affect a hand like that."}, {"time": 4325, "text": "That's almost, that's scary."}, {"time": 4327, "text": "It was just so cool to me, you know, like just how he was so calm."}, {"time": 4331, "text": "And I think that too, added more pressure to the amateur."}, {"time": 4334, "text": "And I think like, again, part of it is, even back then it was 1998, there's still a big rail of people and there's lights and they're, you know, they're filming and all this kind of stuff."}, {"time": 4343, "text": "And it's a lot of pressure for a guy who's never been in this environment."}, {"time": 4346, "text": "And now I'm telling you, it can all be over soon."}, {"time": 4351, "text": "It will all be over soon."}, {"time": 4353, "text": "Just call, it's finished."}, {"time": 4356, "text": "Something about that accent too."}, {"time": 4359, "text": "Now you're a master at table talk as well."}, {"time": 4361, "text": "Do you have, do you just kind of go with your gut, you flow with it?"}, {"time": 4366, "text": "Or is there a deliberate strategy with this sometimes?"}, {"time": 4369, "text": "There's usually some sort of strategy that I think about in terms of what I want to say and whatnot."}, {"time": 4373, "text": "But a lot of the time I just go, I go with it, you know, the more you talk, the more information you get."}, {"time": 4379, "text": "Yeah, but in some cases against really good players, you're just giving away information, right?"}, {"time": 4384, "text": "Like if I'm playing against Phil Ivey, I'm not engaging in anything."}, {"time": 4388, "text": "Cause he can read through it."}, {"time": 4388, "text": "He can sense based on what I'm saying, you know, the clues and where I'm trying to take him."}, {"time": 4393, "text": "And he reads through, he sees the tree through the forest or whatever you want to call it, the forest through the trees."}, {"time": 4398, "text": "And you know, so then I would just be like allowing myself to be exploitable."}, {"time": 4404, "text": "Is some of it just for fun?"}, {"time": 4406, "text": "Because at the end of the day, if you're having fun, you might be at the top of your game."}, {"time": 4411, "text": "I've been thinking about this a lot lately actually."}, {"time": 4413, "text": "It's funny you bring this up because I've been thinking about when I'm at my best."}, {"time": 4416, "text": "And I think I'm at my best when I am comfortable like that."}, {"time": 4420, "text": "Where I'm not so stiff and worried about, you know, checking properly and worried about reading people."}, {"time": 4424, "text": "I'm like, no, I'm me."}, {"time": 4426, "text": "All right, I'm going to play some poker."}, {"time": 4428, "text": "Do you want to call me?"}, {"time": 4428, "text": "Call, go ahead, do what you want."}, {"time": 4430, "text": "Cause then I realized, you know, ultimately it was like, I'm comfortable in that."}, {"time": 4433, "text": "My opponents aren't as comfortable in that."}, {"time": 4434, "text": "They're comfortable with this, you know, the robot thing."}, {"time": 4437, "text": "But I thought more about that and how, especially with some tournaments coming up, I plan on really kind of sort of getting back to my roots in that regard."}, {"time": 4448, "text": "From a spectator perspective, I love it."}, {"time": 4450, "text": "But it's also interesting whenever you see a Daniel on the ground of quiet."}, {"time": 4455, "text": "That's an interesting, like it feels like a calm before a storm of sorts."}, {"time": 4460, "text": "So I'm sure that's also part of it."}, {"time": 4462, "text": "Yeah, like I've gone, I've ebbed and flowed."}, {"time": 4464, "text": "And like I said, you know, I took on some coaches and that was really learning game theory."}, {"time": 4467, "text": "Cause I felt like it was important to always stick, you know, keep up with what's going on."}, {"time": 4471, "text": "And then I do feel like to some degree, it sort of took away a little bit of my own instinctual ideas in terms of what I should be doing."}, {"time": 4480, "text": "So I think like the most dangerous version of myself is a deep understanding of the game theory with my wisdom of many years of, and comfort of just sort of like being myself at the table."}, {"time": 4493, "text": "And being relaxed."}, {"time": 4494, "text": "Relaxed."}, {"time": 4495, "text": "Letting your mind flow."}, {"time": 4496, "text": "Let me ask you the greatest, the goat question, greatest of all time."}, {"time": 4500, "text": "Can you make the case for a few folks?"}, {"time": 4503, "text": "So first you tweeted referring to Phil Ivey as the goat, saying the goat doing goat things."}, {"time": 4509, "text": "That's a recent tweet."}, {"time": 4510, "text": "So can you make the case for Phil Ivey, or maybe who is the greatest poker player of all time?"}, {"time": 4517, "text": "Would you put Phil?"}, {"time": 4519, "text": "For me, until someone knocks him off the podium, the king of poker and the goat is Phil Ivey."}, {"time": 4525, "text": "So, and the reason I say that is, I think of poker as more than just one game."}, {"time": 4529, "text": "There's different variants."}, {"time": 4529, "text": "You know, there's Holdem, Omaha, Stud, Triple Draw, all these different types of games."}, {"time": 4533, "text": "And Phil in every arena has been dominant."}, {"time": 4537, "text": "Whether it was tournament poker, dominated it."}, {"time": 4540, "text": "Mixed game, high stakes poker in Bobby's room, dominated."}, {"time": 4543, "text": "Online poker against all the wizards, dominated."}, {"time": 4546, "text": "Made millions in every arena."}, {"time": 4548, "text": "And, you know, he sort of took a few years away from poker with his legal troubles and things like that, but he's back."}, {"time": 4553, "text": "You know, he's been playing in the high roller series again."}, {"time": 4556, "text": "And, you know, he comes from, he's cut from a different cloth, but he has a tenacity and a focus that's unparalleled, I think."}, {"time": 4564, "text": "When he's in the zone, I mean, for lack, and this has nothing to do with race."}, {"time": 4568, "text": "It really has to do with mannerism, but he does remind me of like a combination of Michael Jordan and Tiger Woods in the way that he approaches it."}, {"time": 4575, "text": "He's very intense."}, {"time": 4576, "text": "And he outworks everybody, you know?"}, {"time": 4579, "text": "And I think, frankly, a lot of his mannerisms do come from them because he's young watching these guys on TV."}, {"time": 4585, "text": "And a lot of his ways of being, you know, his learned behavior, I think probably from people like that."}, {"time": 4589, "text": "People at the top of their sport and people that are Tiger Woods and Michael Jordan aren't just at the top of their sport, but they kind of dominate the sport to some kind of aura that."}, {"time": 4598, "text": "There's a uniqueness to them."}, {"time": 4599, "text": "They're not built like us."}, {"time": 4601, "text": "They're not, you know, they're not."}, {"time": 4602, "text": "Like I wish, I wish I could have the kind of focus that Phil Ivey has, you know, and see everything that he's saying."}, {"time": 4607, "text": "I just, that's not me, you know?"}, {"time": 4610, "text": "And he does, he has that gene, whatever it is."}, {"time": 4613, "text": "But they also look like they're not having that much fun."}, {"time": 4615, "text": "They're more focused on the perfection, like a dogged pursuit of perfection."}, {"time": 4620, "text": "And you know, that might even be true."}, {"time": 4621, "text": "It might not be as fun."}, {"time": 4623, "text": "Like I have fun at the table."}, {"time": 4625, "text": "When you look outwardly, you look at someone, like maybe he is having a blast."}, {"time": 4628, "text": "Maybe that's just the way that he likes, you know?"}, {"time": 4631, "text": "Like is Tiger Woods having fun when he's like on 17 about to win a major?"}, {"time": 4634, "text": "It doesn't look like it, theoretically."}, {"time": 4636, "text": "Well, if you look at Michael Jordan, I don't know about Tiger Woods, but I think they're more focused on every single mistake they make."}, {"time": 4645, "text": "I think they're more obsessed about not making a mistake and hating every time they make a mistake."}, {"time": 4650, "text": "That's probably like 99% of their mental energy."}, {"time": 4654, "text": "I think that's part of what makes them great, right?"}, {"time": 4657, "text": "They don't look past the mistake and just let it, it's whatever."}, {"time": 4660, "text": "They're like, they want to correct it."}, {"time": 4661, "text": "And yeah, there's a tension, almost like a trade off."}, {"time": 4664, "text": "I wonder if that's always the case between sort of greatness and happiness."}, {"time": 4669, "text": "I remember Huck Seed, who, you know, when I was a kid growing up, he was like the poker idol."}, {"time": 4673, "text": "He won the world championship in 1996."}, {"time": 4675, "text": "And I was lucky enough to hang out with him a little bit."}, {"time": 4677, "text": "And he would go through these streaks where he had an A game and he had an F game."}, {"time": 4682, "text": "His A game was unparalleled."}, {"time": 4683, "text": "Nobody could beat him, right?"}, {"time": 4685, "text": "But his F game was so terrible that he was just a fish."}, {"time": 4689, "text": "You know, he was playing terribly."}, {"time": 4690, "text": "And I remember him saying, and it was exactly what you're saying."}, {"time": 4693, "text": "He'd make like one little mistake, right?"}, {"time": 4696, "text": "And then he would go off."}, {"time": 4697, "text": "And I was like, Huck, why do you do that?"}, {"time": 4699, "text": "Like, you know, your B game would be just fine."}, {"time": 4700, "text": "He's like, well, if I'm gonna make a mistake, what's the point?"}, {"time": 4703, "text": "What's the point, right?"}, {"time": 4705, "text": "I'm trying."}, {"time": 4706, "text": "Like, if you can't play perfect, there's no point in playing at all."}, {"time": 4708, "text": "So he was extreme in that regard, in the way that he viewed it."}, {"time": 4712, "text": "And depending on the sport, those folks, like in chess, certainly the case, that kind of mindset can destroy you."}, {"time": 4719, "text": "No, I totally see that."}, {"time": 4720, "text": "Because of a sequence of mistakes."}, {"time": 4722, "text": "Like the kind of year you had with the well scissor poker can completely destroy a human being."}, {"time": 4728, "text": "If you're not able to see the bigger picture of it."}, {"time": 4732, "text": "You said that Phil Ivey is the hardest, your toughest opponent, the toughest person to play against."}, {"time": 4739, "text": "And how do you beat him?"}, {"time": 4740, "text": "Because Phil Ivey's just, he's seeing things that nobody else has seen really."}, {"time": 4744, "text": "Like subtle things, where I'm putting my hands, where I'm looking, you know, my pulse, like stuff that I don't even know I'm giving off."}, {"time": 4750, "text": "He's so engaged and so focused and has such a, just a, he's fearless, right?"}, {"time": 4757, "text": "A lot of people, you know, they'll play poker and be like, you know what?"}, {"time": 4760, "text": "I don't think this guy has it."}, {"time": 4761, "text": "But do they have the guts?"}, {"time": 4762, "text": "Do they have the cojones, if you will, to actually do anything about it?"}, {"time": 4767, "text": "And stand up to this person?"}, {"time": 4769, "text": "I forgot the hand that you tweeted about the goat doing goat things."}, {"time": 4773, "text": "That wasn't even that big of a goat hand."}, {"time": 4774, "text": "But like, there's hands where like, there was a famous one in Australia where the flop was like jack, jack at nine and Phil check raised the flop with six, seven, nothing."}, {"time": 4786, "text": "Just absolutely nothing."}, {"time": 4787, "text": "And the guy re raised him, right?"}, {"time": 4790, "text": "And Phil just knew."}, {"time": 4792, "text": "He went all in with nothing."}, {"time": 4793, "text": "If the guy calls, he's done, he's cooked."}, {"time": 4795, "text": "But he was so tuned in that this guy's not strong, that he just, you know, he did things like that."}, {"time": 4801, "text": "And it's tough to play against a guy like that."}, {"time": 4803, "text": "So he gets great reads and is able to execute on them, has the guts to execute on them."}, {"time": 4809, "text": "He's got experience, he's got work ethic."}, {"time": 4812, "text": "He also, I think one thing I'm underselling too, is his strategic mind, right?"}, {"time": 4818, "text": "Like I believe that, you know, like I said, the new age player, they learn how to play through a very systematic approach."}, {"time": 4825, "text": "Okay, let's look at the data."}, {"time": 4827, "text": "Make up a game right now."}, {"time": 4829, "text": "Three cards, we each get three cards."}, {"time": 4831, "text": "Jacks are wild, sixes are, you know, six of hearts is wild, right?"}, {"time": 4835, "text": "Just make up that game."}, {"time": 4836, "text": "Phil will figure it out intuitively, very, very quickly, right?"}, {"time": 4841, "text": "Without having the answers for him, right?"}, {"time": 4843, "text": "So that's like the difference between the players of my generation."}, {"time": 4846, "text": "We had to figure this stuff out on our own."}, {"time": 4848, "text": "Today, well, I wanna know the answer, I go ask the computer and the computer tells me."}, {"time": 4853, "text": "So I really believe like if you created a game from scratch that Phil Ivey would be my horse that I wanna play in it."}, {"time": 4859, "text": "So he's in some sense in tune with some deeper thing."}, {"time": 4863, "text": "He has what we used to call card sense."}, {"time": 4866, "text": "Card sense."}, {"time": 4867, "text": "Can you try to make the case for some others like Doyle Brunson, Phil Hellmuth, Daniel Negrano, and maybe one of the modern guys like Justin Bonomo or somebody like that?"}, {"time": 4877, "text": "Sure, oh, so let's start with Doyle, okay?"}, {"time": 4880, "text": "Like what Doyle has going for him above all, above and beyond is twofold, really."}, {"time": 4884, "text": "Longevity, I mean, he's in his late 80s."}, {"time": 4886, "text": "And last time I played with him, I was like, how is he getting better?"}, {"time": 4890, "text": "Like I really felt like he was playing better than he had, you know, in the previous years."}, {"time": 4894, "text": "But also with Doyle, like Doyle had to figure, you know, we talked about my generation having to figure it on their own."}, {"time": 4900, "text": "I mean, they really had to figure it out on their own."}, {"time": 4903, "text": "Like they didn't have any computer simulation to tell you if Ace King was a favorite over pocket sixes."}, {"time": 4908, "text": "So we know what he did."}, {"time": 4909, "text": "He would take a deck of cards and they would deal out, and they were with a notepad, right?"}, {"time": 4913, "text": "Okay, Ace King won."}, {"time": 4914, "text": "And then they would do like a hundred of them and be like, all right, Ace King won like 53."}, {"time": 4917, "text": "So it must be a favorite."}, {"time": 4918, "text": "And he did it manually, you know?"}, {"time": 4920, "text": "And he did it in a time when it was very, very difficult."}, {"time": 4923, "text": "And he's seen poker evolve and change throughout the years."}, {"time": 4926, "text": "Now, listen, is he gonna be able to compete against the top players in the world today?"}, {"time": 4929, "text": "Absolutely not, you know?"}, {"time": 4930, "text": "But how many people, he's the best 88 year old player in the world by a mile, okay?"}, {"time": 4936, "text": "That's not even close."}, {"time": 4937, "text": "And Doyle, again, he's another guy who plays all the games."}, {"time": 4940, "text": "He's played high stakes cash, tournaments, you name it."}, {"time": 4942, "text": "He's iconic, you know, he's the godfather."}, {"time": 4944, "text": "So, but there's also an element to that."}, {"time": 4946, "text": "So the iconic element, like your personality in poker."}, {"time": 4950, "text": "I mean, not to romanticize this thing too much, but poker is also a game of personalities."}, {"time": 4958, "text": "I mean, it's part of the greatness is like the uniqueness of the human being."}, {"time": 4963, "text": "Yeah, I think also, yeah."}, {"time": 4964, "text": "I mean, if you'd like looking at it from that perspective in terms of like Goat, like Goat in terms of what you represent, like the cowboy, the godfather, you know, he's been around, you know, we played in the sixties and stuff like that."}, {"time": 4974, "text": "It's just something like incredibly cool."}, {"time": 4976, "text": "Like I often think about if I could go back in time and like visit, you know, an era, I'd love to go like to Vegas in the seventies and just like, I'm proud."}, {"time": 4985, "text": "I already, like, I can think of what it would smell like, probably not ideal, cigarettes and, you know, the leather jackets and just the vibe of what it must've been like with the mobsters and things like that."}, {"time": 4994, "text": "You know, he's lived through all that, all the cool movies we've seen."}, {"time": 4996, "text": "Like Doyle talks about some of those films."}, {"time": 4998, "text": "He's like, yeah, that guy, he said he was gonna stab me in my stomach."}, {"time": 5002, "text": "You know, he knows these people."}, {"time": 5003, "text": "It was, he's like a source of history, really."}, {"time": 5007, "text": "Yeah, when poker was a game for the mob and the degenerates and all that kind of stuff before it transitioned into professional sport."}, {"time": 5018, "text": "Professional game."}, {"time": 5019, "text": "Yeah, so he was there through the whole thing."}, {"time": 5020, "text": "He's been there through the whole transition."}, {"time": 5022, "text": "He's seen it all, yeah."}, {"time": 5023, "text": "Yeah, and then to the online world."}, {"time": 5025, "text": "So what about, I can't even say without smiling, Phil Hellmuth."}, {"time": 5031, "text": "Okay, so Phil, here's the thing with Phil."}, {"time": 5033, "text": "He takes it very personal when I say this and he doesn't hear the compliment."}, {"time": 5038, "text": "He only hears the negativity."}, {"time": 5039, "text": "Because Phil wants to be considered the greatest of all time."}, {"time": 5041, "text": "Hashtag positive."}, {"time": 5042, "text": "He wants to be the greatest of all time."}, {"time": 5044, "text": "But I'm like, Phil, here's the facts."}, {"time": 5047, "text": "You have the best, absolute greatest resume at the World Series of Poker of anyone in the world."}, {"time": 5052, "text": "Is that not enough, right?"}, {"time": 5053, "text": "That's what you have."}, {"time": 5054, "text": "You have that, right?"}, {"time": 5056, "text": "Now, do I think you're the best no limit holding player in the world today?"}, {"time": 5060, "text": "Do I think that, you know, you can play high stakes mixed games with the best players in the world today and win?"}, {"time": 5065, "text": "So he wouldn't get as much flack on this topic if he wasn't so boastful and like, you know, demanding."}, {"time": 5071, "text": "Like you never hear Phil Ivey say, I'm the best in the world."}, {"time": 5073, "text": "Like his peers do, right?"}, {"time": 5075, "text": "But Phil wants to make the claim."}, {"time": 5077, "text": "And I simply say, I beg to differ, right?"}, {"time": 5080, "text": "I beg to differ."}, {"time": 5081, "text": "Like, I don't think you are the best player in the world."}, {"time": 5085, "text": "If we can linger on the compliment so he can hear it, what makes him so good?"}, {"time": 5090, "text": "Because it seems like a lot of times his play is not optimal."}, {"time": 5094, "text": "Yeah, he definitely has his own brand and style of play, right?"}, {"time": 5098, "text": "He does not adhere to, he's never used a solver in his life."}, {"time": 5100, "text": "He doesn't know, he's not in that world, right?"}, {"time": 5103, "text": "Phil has a lot of faith and a lot of confidence in what he does and that it will be successful."}, {"time": 5107, "text": "And I think there's something to be said about that, right?"}, {"time": 5109, "text": "He doesn't ever lack in belief that he can win and he finds a way to do it his way."}, {"time": 5115, "text": "And frankly, a lot of what he does is very effective against specific types of players who are intimidated by him, but whether it's his resume or his demeanor or his attitude sometimes, right?"}, {"time": 5127, "text": "Like if you're an average player and then you beat Phil in a hand, you're gonna hear it."}, {"time": 5131, "text": "This idiot from Northern Europe and beat me in this pot."}, {"time": 5134, "text": "And for some people, they don't like that."}, {"time": 5137, "text": "So he can use that against them."}, {"time": 5139, "text": "But I also think too, like he cares so much, right?"}, {"time": 5146, "text": "And that leads to trying really, really hard."}, {"time": 5148, "text": "Like he sees these moments and he doesn't phone them in."}, {"time": 5150, "text": "Like whatever brand of poker he plays, he tries his best at all times to succeed and to win."}, {"time": 5157, "text": "And there's some, even though like he's fundamentally flawed in a lot of things that he does compared to some of the bigger players, his effort and will and like his determination to stick around is, you know, is up there."}, {"time": 5168, "text": "And he is somebody who seems to really hate losing."}, {"time": 5172, "text": "Yes, yeah, he feels like he deserves to win, right?"}, {"time": 5177, "text": "In all cases."}, {"time": 5178, "text": "And if he loses, it's, you know, it's not just."}, {"time": 5182, "text": "As you joked around that you and him might do an anger management course."}, {"time": 5186, "text": "Yeah, I did say that in one video."}, {"time": 5190, "text": "Now this is tough because you're a humble guy, but objectively speaking, can you say what your strengths are?"}, {"time": 5197, "text": "You're often listed as one of, if not the greatest player of all time."}, {"time": 5201, "text": "So what are the things that make you stand out?"}, {"time": 5204, "text": "So for me, when I grew up, I admired the big cash game players, because that's what I was."}, {"time": 5209, "text": "I love tournaments, but I wanted to be well rounded."}, {"time": 5211, "text": "Like in my day, you couldn't make the poker hall of fame if you just played one game."}, {"time": 5215, "text": "You had to jump in to the high stakes games in Bobby's room, as they say, right?"}, {"time": 5219, "text": "And I was able to do that."}, {"time": 5220, "text": "When I was in my early, in my mid twenties, I was playing 4,000, 8,000 limits."}, {"time": 5226, "text": "You know, you could win or lose a million dollars in a day."}, {"time": 5228, "text": "So I grinded it out."}, {"time": 5229, "text": "Like a lot of people think, oh, you know, he's lucky."}, {"time": 5231, "text": "He's had sponsorship."}, {"time": 5232, "text": "Otherwise he'd be broke."}, {"time": 5233, "text": "It's like, I built multi million dollar bankrolls before any of that stuff existed."}, {"time": 5238, "text": "And I did it the good old fashioned way by sitting my butt on the table."}, {"time": 5241, "text": "I think probably one of my biggest strengths is self awareness."}, {"time": 5245, "text": "And in that regard, a level of humility that always allows me to say, okay, well, you know what?"}, {"time": 5251, "text": "In this case with these players, they're better than me."}, {"time": 5254, "text": "So what am I going to learn from them, right?"}, {"time": 5256, "text": "Rather than have this need to say, I'm the best because of history."}, {"time": 5260, "text": "I'm always looking to guys and go, wow, he does this really well."}, {"time": 5262, "text": "Whether it's the Adamos or the Ivies or whoever it may be."}, {"time": 5266, "text": "So my willingness to adapt, I think, and stay relevant by learning what the young guys are learning is something I've always done."}, {"time": 5274, "text": "And I also pride myself on, again, being well rounded, like playing all the games."}, {"time": 5279, "text": "Like I don't feel intimidated in any game, you know, whatever the format is."}, {"time": 5284, "text": "So always being a scholar of the game as the game evolves, as the different games evolve, the different players evolve, the culture evolves, always adjusting by being a scholar, having the humility to be a scholar."}, {"time": 5294, "text": "A healthy respect for, a healthy respect for the younger generation, how they learn, what they learn and what they can teach me, rather than poo poo it and say, oh, these kids today."}, {"time": 5305, "text": "Cause that's what a lot of people, like the Mike Matisos and the Phil Hellmuth, my generation, they just poo poo it because they don't understand it."}, {"time": 5312, "text": "On a level of one to 10, their level of understanding of this is like a one, maybe."}, {"time": 5316, "text": "If I'm being generous by calling it a one, they really don't understand it."}, {"time": 5319, "text": "So they poo poo it, right?"}, {"time": 5321, "text": "It's easy to do that."}, {"time": 5322, "text": "Like, oh, that's not how I do it."}, {"time": 5324, "text": "So that's wrong or that's stupid or whatever."}, {"time": 5326, "text": "I don't take that approach."}, {"time": 5327, "text": "I go, well, let me learn."}, {"time": 5328, "text": "Let me see what there is to this."}, {"time": 5330, "text": "But that said, the crankiness that Matisos and Phil Hellmuth have is great to watch, especially when they're on a table with you."}, {"time": 5337, "text": "Oh, I love it."}, {"time": 5338, "text": "Yeah, it's a blast."}, {"time": 5340, "text": "You're masterful at being able to get under their skin."}, {"time": 5343, "text": "What about somebody from the new school, like Justin Bonomo, who's leading in terms of cash wins."}, {"time": 5351, "text": "Is there somebody like that, that stands out to you as a potential GOAT status person?"}, {"time": 5357, "text": "Yeah, so there's two different ones, but one is very..."}, {"time": 5360, "text": "So they're both just no limit, right?"}, {"time": 5363, "text": "So again, when I think of poker, I think of a variety of games, but there's so many of the young guys that specialize."}, {"time": 5369, "text": "Michael Adamo is one that I've mentioned several times and I love the way that he approaches the game."}, {"time": 5372, "text": "Another one that's highly respected because of his online prowess and his... People have looked and how close he is to game theory and they say he's about as perfect as you get."}, {"time": 5381, "text": "And I got a kid named Linus."}, {"time": 5383, "text": "Linus love online, Linus Linger."}, {"time": 5386, "text": "So he just came second recently, I believe in the Triton, huge Triton event."}, {"time": 5391, "text": "So he's primarily an online player."}, {"time": 5392, "text": "Yeah, he's an online cash player for the most part, but he plays some live."}, {"time": 5395, "text": "And he's, again, and I respect the peers that I play with who say, yeah, he's tough as nails."}, {"time": 5400, "text": "There's another kid too, Russian kid named Timofey Kuznetsov and he plays all the games and he's well respected in that regard."}, {"time": 5410, "text": "And same with a guy like a Jungleman, Dan Cates, who's a unique personality."}, {"time": 5414, "text": "I mean, this guy showed up, won the poker players championship back to back years in a Randy Macho Man Savage costume."}, {"time": 5420, "text": "And he was doing Macho Man the entire time."}, {"time": 5423, "text": "Oh yeah, I'm gonna take all the chips like I did last year."}, {"time": 5427, "text": "Bust them all."}, {"time": 5428, "text": "And he was in character for the entirety of the tournament."}, {"time": 5431, "text": "Just unique."}, {"time": 5432, "text": "But yeah, I respect for a lot of those guys."}, {"time": 5435, "text": "Is it gonna take time to figure out who stands the test of time?"}, {"time": 5441, "text": "So a lot of these kids, like there was a guy who beat me heads up in the million dollar one drop."}, {"time": 5446, "text": "I got 8.7, he won $15 million, kid named Dan Coleman."}, {"time": 5449, "text": "He was seen as like the next big thing in poker, right?"}, {"time": 5453, "text": "He made his money, just wasn't for him."}, {"time": 5456, "text": "So he's moved on to doing what he's doing, skiing in the Alps, whatever."}, {"time": 5460, "text": "We have nobody seen him from like five, six years."}, {"time": 5462, "text": "So that can happen, right?"}, {"time": 5464, "text": "Because there is a lot of burnout."}, {"time": 5466, "text": "I think it was actually a Gotham Chess who mentioned something about how difficult it is to like, I think it's true in poker."}, {"time": 5473, "text": "When you get really, really good at something, to get this much better takes so much work."}, {"time": 5478, "text": "And a lot of people don't necessarily wanna put in that kind of work in order to do that."}, {"time": 5483, "text": "That's just even staying at the same level takes a huge amount of work."}, {"time": 5487, "text": "Like, so if you wanna get better at chess, you're already like really, really good."}, {"time": 5489, "text": "And you're trying to get like one little bit better."}, {"time": 5491, "text": "You have to study like in a ridiculous amount, you know?"}, {"time": 5494, "text": "And again, that's once you've already had, I think the toughest thing for anybody, once you've tasted success and you've already achieved it, staying hungry, staying on the top, reaching the top is much easier than it is to stay there."}, {"time": 5509, "text": "Over years, what's your training regimen in poker in terms of how you keep improving?"}, {"time": 5518, "text": "So you said you study games, but that's mostly leading up to a particular tournament."}, {"time": 5523, "text": "But is there kind of a behind the scenes daily activity you try to do that kind of over time keeps you sharp?"}, {"time": 5531, "text": "So for me, now that I'm 47, and I feel like the predominant aspect of my poker game is going to be in terms of my success is gonna be my mental state, right?"}, {"time": 5541, "text": "So I find it's really, really important for me now at this age to have balance."}, {"time": 5546, "text": "So when I'm not playing poker and I'm out of it, poker is not even on my radar."}, {"time": 5552, "text": "You're able to remove it from your mind."}, {"time": 5554, "text": "Doing my fantasy hockey, play a little chess, you know, play some golf, watch some hockey, whatever the case may be, outside of the game."}, {"time": 5562, "text": "And then I start to get the itch."}, {"time": 5563, "text": "Like after the World Series of Poker, the poker door was closed."}, {"time": 5567, "text": "Yeah, you took some time off."}, {"time": 5569, "text": "All of August, I didn't play any poker at all until just recently, you know."}, {"time": 5573, "text": "I started to get the itch again."}, {"time": 5574, "text": "Because that's what's important for me, is if I don't have the itch and I don't want to play poker, then I'm not gonna be at my best."}, {"time": 5579, "text": "Once I start getting the itch, that's when I start to say, okay, let's start watching some of these streams."}, {"time": 5584, "text": "Let's see what my opponents are up to lately."}, {"time": 5586, "text": "And, you know, let's look at some solvers and different things like that."}, {"time": 5590, "text": "And you're doing pretty good."}, {"time": 5592, "text": "You came back and doing pretty good."}, {"time": 5595, "text": "Yeah, so far."}, {"time": 5597, "text": "Do you like being in front of the camera through the hell of the World Series of Poker this year?"}, {"time": 5601, "text": "You filmed every single day."}, {"time": 5603, "text": "You did a vlog."}, {"time": 5604, "text": "Does that energize you?"}, {"time": 5606, "text": "Because it's really beneficial to a huge amount of people."}, {"time": 5608, "text": "It energizes the poker community."}, {"time": 5610, "text": "But do you see it as a service or do you purely just love it?"}, {"time": 5614, "text": "I've been comfortable on camera since I was a kid."}, {"time": 5617, "text": "When I was a kid, I wanted to be an actor."}, {"time": 5619, "text": "Like really, really young."}, {"time": 5620, "text": "And I was always comfortable in that environment."}, {"time": 5622, "text": "I think like that gives me a little bit of an advantage sometimes too, with these film events."}, {"time": 5627, "text": "Cause I'm comfortable with the mic on and on camera with the lights."}, {"time": 5630, "text": "And I think a lot of people maybe aren't with the knowledge that other people are gonna see what they're doing every day."}, {"time": 5635, "text": "So it's been so comfortable and easy for me."}, {"time": 5637, "text": "As far as the World Series goes and the vlogs and all the shooting, it's kind of therapeutic for me."}, {"time": 5642, "text": "It is essentially my version of journaling, right?"}, {"time": 5646, "text": "So there's a lot of value, I think, in like at the end of a day doing a brain dump where you just write out and journal."}, {"time": 5651, "text": "But doing it on camera has this similar effect."}, {"time": 5655, "text": "And it also, when you make a mistake on your own, you're held accountable to you."}, {"time": 5660, "text": "But when I have to explain it to others, like here's what I did."}, {"time": 5664, "text": "And this is the mistake I made or whatever the case may be."}, {"time": 5668, "text": "It actually, I think that helps me."}, {"time": 5671, "text": "Yeah, so you're held responsible by a larger audience."}, {"time": 5674, "text": "I think it's like, so like I said, listen, I'm 47, my life is good."}, {"time": 5678, "text": "I don't have to be in this tournament."}, {"time": 5679, "text": "If I'm over it, I can just dump my chips off and go home."}, {"time": 5682, "text": "But I can't when I'm doing the vlog, like I have to actually answer to that."}, {"time": 5689, "text": "And it keeps me in line."}, {"time": 5691, "text": "How hard is it to win the main event of the World Series of Poker?"}, {"time": 5696, "text": "So the main event of the World Series of Poker is the hardest event to win simply because of the sheer size of it."}, {"time": 5701, "text": "You're talking seven, 8,000 players, right?"}, {"time": 5704, "text": "And a lot of landmines."}, {"time": 5705, "text": "And frankly, there are so many players that you've not played with before too."}, {"time": 5710, "text": "You play these high roller events, like the super ones, you get 30, 40 people, you know everybody, right?"}, {"time": 5715, "text": "So you have an idea."}, {"time": 5716, "text": "You sit at the main event, you don't have any idea."}, {"time": 5719, "text": "This guy wearing a Philadelphia Eagles jersey and sunglasses, and he just raised you big."}, {"time": 5723, "text": "I don't know this guy, I don't know what he's about."}, {"time": 5726, "text": "So there's a lot of like, it's grueling too."}, {"time": 5729, "text": "You're seven, eight days where you're in the blender as you might say, so."}, {"time": 5735, "text": "So what's the structure?"}, {"time": 5736, "text": "So it's $10,000 buy in or something like that."}, {"time": 5738, "text": "And there's a bunch of tables and you just keep playing."}, {"time": 5741, "text": "Like when is it over for a single table?"}, {"time": 5744, "text": "Does it go?"}, {"time": 5745, "text": "So the way that it works is this."}, {"time": 5746, "text": "So there's, let's say 8,000 players."}, {"time": 5747, "text": "And the way the main event works, unique to others, is there's various day ones you can play, right?"}, {"time": 5753, "text": "So a day one, you're gonna play from noon till like midnight, right?"}, {"time": 5757, "text": "If you're still in, you bag up your chips and you'll come back for day two, okay?"}, {"time": 5762, "text": "There's four different day ones, right?"}, {"time": 5764, "text": "Now they'll all combine essentially to play on a day two."}, {"time": 5767, "text": "And at the end of the night, they redraw the tables."}, {"time": 5769, "text": "So you don't just win your table."}, {"time": 5771, "text": "If players get knocked out, tables break, they continue to be replaced."}, {"time": 5775, "text": "So you start with 8,000, then after day one, you've got 6,000, then you do the same."}, {"time": 5780, "text": "You play like a 12 hour day and you slowly whittle down."}, {"time": 5785, "text": "Day four, day three, day four, you're in the money."}, {"time": 5788, "text": "And then you continue to progress."}, {"time": 5789, "text": "And then what they do now with the final table is they, because they were trying to do this for TV, these final tables can take, you know, 12 hours to play."}, {"time": 5798, "text": "And what we were finding was, you know, you start the thing at 5 p.m. and it goes till 8 a.m. And like nobody's watching anymore."}, {"time": 5805, "text": "So they separate into three days now."}, {"time": 5809, "text": "And so you're talking now, it's like six, seven days to get to the final table and another three days to play it."}, {"time": 5814, "text": "So you're grinding for, you know, a week and a half."}, {"time": 5818, "text": "But most of the time you're playing against people you've never played against before."}, {"time": 5823, "text": "Especially early on, yeah."}, {"time": 5824, "text": "And then by the end, like, who knows?"}, {"time": 5826, "text": "You know, rarely do you see, you see in the last hundred, you usually see some notable names."}, {"time": 5831, "text": "Then in the last 27, you might see one, maybe two."}, {"time": 5833, "text": "Final table, maybe one."}, {"time": 5835, "text": "But often it's gonna be, you know, some players you've never heard of before."}, {"time": 5840, "text": "Is there strategies that maximize your likelihood of having a chance?"}, {"time": 5846, "text": "Like I think the World Series of Poker main event is a unique animal in that, you know, like we talk about game theory and all that kind of stuff."}, {"time": 5852, "text": "If you're focused on that when you're playing, you're really not playing well, right?"}, {"time": 5856, "text": "You need to just exploit because you're gonna have a lot of people who see this as a bucket list item."}, {"time": 5861, "text": "You know, they just wanna play the main event in the World Series."}, {"time": 5863, "text": "And they might be scared, they might be nervous or whatever."}, {"time": 5865, "text": "You don't have to worry about being balanced, right?"}, {"time": 5868, "text": "Oh, you know, I have to make sure that I'm, no you don't."}, {"time": 5871, "text": "You might not, you're playing with this guy now for three hours, you might never see him again."}, {"time": 5874, "text": "So just make the play that makes sense for you, right?"}, {"time": 5877, "text": "So yeah, you're gonna, I approach that event very differently than I would like playing against the high roller players that I play with today."}, {"time": 5885, "text": "Does that mean more aggressive essentially?"}, {"time": 5887, "text": "Less actually."}, {"time": 5888, "text": "So when you play against really good players, you have to take small plus EV scenarios where you push the envelope and you're playing really aggressive."}, {"time": 5898, "text": "You're bluffing off your stack."}, {"time": 5899, "text": "You gotta do this."}, {"time": 5900, "text": "You gotta focus a little bit more on being balanced because otherwise, you know, you're not gonna beat these guys."}, {"time": 5905, "text": "Whereas if you're playing with amateurs and you're playing with regular players, for the most part, risking all your chips on a bluff, probably don't need to do that."}, {"time": 5914, "text": "You don't need to do that nearly as much."}, {"time": 5915, "text": "You can probably slowly but surely build your stack without taking, you know, those high risk, high variance situations because you'll find better situations."}, {"time": 5924, "text": "What mistakes do amateurs usually make in tournaments like that?"}, {"time": 5928, "text": "Are they over bluffing?"}, {"time": 5930, "text": "Well, I think amateurs generally, the biggest mistake they make is they think that pros are bluffing more than they are."}, {"time": 5936, "text": "So like a pro will bet all his chips on the end and they're like, ah, I don't know."}, {"time": 5938, "text": "Maybe, you know, it's Phil Ivey."}, {"time": 5940, "text": "Maybe he's doing some crazy stuff."}, {"time": 5941, "text": "He's like, probably not."}, {"time": 5942, "text": "He's probably just got it, you know?"}, {"time": 5945, "text": "And then they lose all their money by calling or going all in as well."}, {"time": 5952, "text": "And so the right thing is to be more patient."}, {"time": 5955, "text": "So amateur is too impatient or just bad reads?"}, {"time": 5959, "text": "So all the amateurs are built different."}, {"time": 5961, "text": "Some of the amateurs are just too weak and passive."}, {"time": 5963, "text": "They're just waiting for the nuts, you know?"}, {"time": 5965, "text": "And then, you know, the pros, everyone notices that."}, {"time": 5967, "text": "And then when they make their big hand, they don't get paid anyway."}, {"time": 5970, "text": "So in order to win the main event, I mean, you have to have some components of your game that are aggressive."}, {"time": 5976, "text": "It's very unlikely to expect to just get the cards the whole way and just always have the best hand."}, {"time": 5982, "text": "You're gonna have to find ways to win pots that, you know, where you don't have the best hand."}, {"time": 5987, "text": "How do you win the final table?"}, {"time": 5989, "text": "The final table is unique now, especially because you're talking about the way that poker works in tournaments is that if there's seven people left and you have just, you know, you're very short on chips."}, {"time": 5999, "text": "But if one other player goes out, you just make like $300,000 for folding, like just for sitting out, right?"}, {"time": 6006, "text": "The term for that that, you know, show kids uses ICM, independent, you know, chip model, right, where it talks about the value of each chip."}, {"time": 6015, "text": "Where what happens, what we see now is, let's say one guy has a big chip lead and there's another guy who's second in chips and there's a couple that are short."}, {"time": 6022, "text": "These guys in the middle, they just play super tight and they wait for the little guys to go while the big stack is just pounding them because he can afford to, right?"}, {"time": 6033, "text": "He knows that people are handcuffed."}, {"time": 6035, "text": "So let's say I had 10 million in chips and you have 9 million in chips."}, {"time": 6038, "text": "And these guys have little chips."}, {"time": 6039, "text": "If I go all in on you, are you gonna call me and risk like, you know, guaranteed pay jumps of like moving up a few spots?"}, {"time": 6046, "text": "So really the question comes down to like, are you the type of guy who just wants to inch up or are you gonna go for it?"}, {"time": 6052, "text": "And you're gonna go for the win."}, {"time": 6054, "text": "I think ultimately there's some value in being the guy who says, you know, I don't care if I come seventh."}, {"time": 6058, "text": "I'm not worried about going from seventh to fifth."}, {"time": 6061, "text": "I'm here to win."}, {"time": 6062, "text": "And so you're saying like the guys that win will often be the ones that call there."}, {"time": 6067, "text": "So like, they're not just bullying the small stacks, they're."}, {"time": 6070, "text": "Well, they're the ones, no, they're the ones that are willing to risk it, right?"}, {"time": 6074, "text": "So there are some people who, you know, if there's five left, you know, and they're third in chips and there's two guys very short and you, you know, they'll have ace king and someone moves, they'll just fold."}, {"time": 6086, "text": "They fold the hand because they wanna wait for those two other players to get broke."}, {"time": 6090, "text": "And that way they let you know, they make actual money."}, {"time": 6092, "text": "So you, I guess the thought process between winning first place and winning the most amount of money are different."}, {"time": 6097, "text": "They're conflicting, right?"}, {"time": 6099, "text": "Because in order to like win, if you're just, if your focus is only on winning the tournament, you will make mistakes financially where you had guaranteed income for just folding, right?"}, {"time": 6107, "text": "Let's say a guy has one chip left, you know, one chip and me and you have good chips and I go all in with you and I lose."}, {"time": 6115, "text": "Now that guy, you know, got the guaranteed, you know, he got the pay jump that I wouldn't have got."}, {"time": 6119, "text": "So there's some extremely stupid mistakes you can make from a financial perspective, but it's often at odds with, you know, giving yourself the best chance to actually come first."}, {"time": 6128, "text": "And in a tournament, especially the main event, especially the final table, it's all about coming in first."}, {"time": 6135, "text": "Well, I know because most of the people who make it, so like, you know, when you play these high rollers, these guys are accustomed to playing for a hundred thousand, they're, they're accustomed to this kind of money."}, {"time": 6143, "text": "So they're going to play, right?"}, {"time": 6144, "text": "For the most, but you're talking about guys who bought into a $10,000 tournament, maybe never had a hundred K cash in their life."}, {"time": 6149, "text": "And now they're sitting there and it's like 1 million for fifth and 2 million for fourth."}, {"time": 6155, "text": "So like, they don't want to be fifth, they're just going to sit there and go, ah, I don't want."}, {"time": 6159, "text": "So they'll, they'll be under more financial pressure because they're not like your typical high roller type player."}, {"time": 6165, "text": "Are you still able to find the guts to take big risks?"}, {"time": 6168, "text": "Yeah, see, I'm trying to win."}, {"time": 6170, "text": "Like, I think that gives me an advantage, frankly, where I might make decisions that are financially suboptimal because I'm trying to win, but there's also an inherent advantage to that."}, {"time": 6181, "text": "Like that again, something I watched and learned from a guy like Michael Adamo, where he takes advantage of these people playing so passively in these spots where he's like, I don't, I'm not trying to come, I'm going to win."}, {"time": 6191, "text": "I'm just going to bull bulldoze you."}, {"time": 6194, "text": "Cause I'm not worried about, you know, the small financial mistake of, you know, a pay jump."}, {"time": 6201, "text": "What advice could you give to, to beginning poker players?"}, {"time": 6205, "text": "Actually at every level, how to get better, how to improve, how to improve their game."}, {"time": 6210, "text": "Obviously, as you said, it's easiest to get better in the beginning, but what advice would you give how to get better?"}, {"time": 6217, "text": "So one of the ways, I mean, I think way back to the how I started, right?"}, {"time": 6220, "text": "And there's so many resources and tools available right now to analyze hands, but when you play, right?"}, {"time": 6225, "text": "And you find yourself in a situation or a hand that you're not really sure about, not because you had aces and went all in and you lost, like that's not interesting, but an interesting situation where you're not sure what you did, jot the hand down, write it out."}, {"time": 6239, "text": "And then either A, you know, use some of the tools, whether it's the solvers, if you're advanced enough, or ask your group, you know, like have a couple of friends at your level and talk through the different decisions and start to learn that way, right?"}, {"time": 6252, "text": "Cause those mistakes that you make or those tough, those tough hands, that's where the real learning comes from."}, {"time": 6257, "text": "Like, so that next, so basically if you're, cause you're gonna be in similar scenarios."}, {"time": 6261, "text": "In poker, you're rarely gonna have the identical situation, but you'll have situations that are similar."}, {"time": 6266, "text": "You know, you raise with ace king, someone three bet, another guy goes all in."}, {"time": 6269, "text": "Okay, well, what do I do in that spot?"}, {"time": 6271, "text": "You know, it's, you're gonna have similar situations in the future as well."}, {"time": 6275, "text": "So figuring that out, the more you can do that, you chop away at, you know, different strategical mistakes, you know, you used to make that you no longer make."}, {"time": 6284, "text": "Are there resources like your masterclasses really is great?"}, {"time": 6288, "text": "Are there books?"}, {"time": 6289, "text": "So there was a guy named Michael Acevedo."}, {"time": 6291, "text": "This is my, again, for a little bit more advanced players, but it's a book called a modern poker theory, I think it's called, which sort of explains game theory, right?"}, {"time": 6301, "text": "To the novice, right?"}, {"time": 6302, "text": "So it's a little bit, I think if you're new to poker, it's probably above the rim for you."}, {"time": 6308, "text": "But once you start to get a little better and you wanna understand how to do it, it's probably a good resource for as far as books."}, {"time": 6313, "text": "And there's also like tons of people who stream poker, professional players."}, {"time": 6317, "text": "And then you can get in there and you get in on the chat and you start talking, you ask them, you see people, you know, explaining their thought process and things like that."}, {"time": 6323, "text": "There's so many free resources."}, {"time": 6325, "text": "And of course my masterclass, I think does a good job of sort of compartmentalizing, like, you know, how to attack it on a deeper level."}, {"time": 6332, "text": "And we, you know, we get it, I try to get into, what's funny when I did the masterclass, I asked them, I was like, well, you know, how high end do you want this in terms of poker?"}, {"time": 6341, "text": "And they're like, we want really, really high end."}, {"time": 6342, "text": "And I was like, okay, sure."}, {"time": 6344, "text": "Then I started to explain really, really high end."}, {"time": 6346, "text": "I'm like, okay, well, maybe the one below that, right?"}, {"time": 6350, "text": "So I try to explain really complex, you know, theory in a more palatable way, in English, if you will."}, {"time": 6358, "text": "Cause some of these kids, you hear them talk and you'd be like, huh?"}, {"time": 6362, "text": "But you also, which is really nice, give example hands that really illustrate the point, which is really nice."}, {"time": 6370, "text": "You also wrote a book, I think 10 years ago, Power Holding Strategy."}, {"time": 6376, "text": "It's interesting to think how much of the stuff in that book still applies, how much doesn't."}, {"time": 6381, "text": "Listen, I still think the book holds up to a certain degree."}, {"time": 6383, "text": "Obviously like, you know, it isn't optimal because there's like a more advanced strategies."}, {"time": 6388, "text": "And if you played that way, people will figure out a way to exploit you."}, {"time": 6390, "text": "But if you're like an average player playing an average buy ins, like that's sort of what I coined, like small ball approach, absolutely will work."}, {"time": 6398, "text": "You know, at the highest level, you have to add much more, a lot more bluffing."}, {"time": 6402, "text": "But overall, I think it's still, you know, for the most part, there's a lot of really, especially with tournaments, there's a lot of really good principles in the book."}, {"time": 6408, "text": "What's the difference in the dynamics, if you could just comment on between a heads up poker and when multiple people are in one hand, what are interesting aspects to everything we've been talking about from game theory to exploitative strategies, all that kind of stuff."}, {"time": 6424, "text": "So the biggest difference when you play, let's say nine handed, you know, against eight other players and you know, heads up is, first of all, just the type of hands and the number of hands you're gonna have to play."}, {"time": 6435, "text": "So the way that it works is if there's nine people, two out of the nine hands, you have to put in money."}, {"time": 6440, "text": "And the other seven, you could just fold for nothing, okay?"}, {"time": 6442, "text": "When you're heads up, you're forced to put money in every single hand, okay?"}, {"time": 6447, "text": "And there's only one other hand in front of you, which means the ranges of hands that you play is way wider, right?"}, {"time": 6453, "text": "So if you're nine handed, right?"}, {"time": 6455, "text": "And you're in first position, you're like, all right, what do I need to play?"}, {"time": 6457, "text": "Like a good pair, you know, two high cards suited, a big ace, you know, stuff like that, that's it, right?"}, {"time": 6464, "text": "That's what you're gonna play, right?"}, {"time": 6466, "text": "And you're gonna fold all the rest."}, {"time": 6467, "text": "When you're heads up, you look at a king and a two and you're like, well, I gotta play this."}, {"time": 6472, "text": "You know, you're gonna, you're gonna, you're forced to play a lot more hands in a lot more complex situations when you're playing heads up, because you're gonna be playing much far weaker hands."}, {"time": 6482, "text": "Queen five, Jack three, all these types of hands."}, {"time": 6485, "text": "And you're gonna see flops where you're, you're not gonna have the luxury of being like, I'm in there with a premium hand, queens, kings, aces."}, {"time": 6491, "text": "Those are easier to play, right?"}, {"time": 6493, "text": "Very, very strong holdings."}, {"time": 6494, "text": "Heads up, you're forced to dance and fight a lot more."}, {"time": 6499, "text": "You know, you can't sit in the weeds and wait."}, {"time": 6501, "text": "What do you enjoy more?"}, {"time": 6504, "text": "Heads up is very intense."}, {"time": 6505, "text": "I like heads up, but I think if you had to play heads up eight, 10 hours, it's so mentally draining because your face with so many constant decisions each and every spot."}, {"time": 6515, "text": "Like you play nine handed, you look at a nine and a three, you throw it away, you hang out for a bit, relax, you go, you get a little break and then play hand."}, {"time": 6522, "text": "Heads up, you're like, it's like, boom, boom."}, {"time": 6524, "text": "It's like you're in the ring, you know, you're in the octagon and you're facing like haymakers nonstop."}, {"time": 6530, "text": "Since we talked about online a bit, is it possible to cheat in poker, especially online?"}, {"time": 6536, "text": "So we offline also talked about the cheating controversy that's going on in the chess world."}, {"time": 6542, "text": "Is it possible to use, what is it?"}, {"time": 6546, "text": "Remotely connected anal beads to somehow cheat?"}, {"time": 6550, "text": "No, is that a concern of cheating online?"}, {"time": 6555, "text": "So here's the thing, it's kind of like romanticized from the old days, like, you know, in the Western stuff, like people trying to cheat."}, {"time": 6562, "text": "And have you ever killed a man because he cheated?"}, {"time": 6564, "text": "No, I have not."}, {"time": 6565, "text": "But when I started out as a teenager, I played in a game with a bunch of Italians and I knew they cheated and I didn't care because they were so bad that I could win anyway."}, {"time": 6573, "text": "I was like, I knew they would cheat, but I knew how they were cheating."}, {"time": 6575, "text": "So I was like, all right, you guys suck."}, {"time": 6577, "text": "But so here's the thing, anytime you're talking about large sums of money, there will be people looking to take advantage, whether that's live or online, right?"}, {"time": 6585, "text": "And so it's like the job essentially of the, you know, the online operators or the, you know, live event staff to police it the best they can."}, {"time": 6594, "text": "And the players themselves being on the lookout for it."}, {"time": 6596, "text": "You know, like a guy like Dole Brunson is a great resource because he's seen it all and he's seen all the tricks, you know, and so live, you know, he probably could spot a few things."}, {"time": 6604, "text": "But online, there's various ways people can try to cheat, but there's also really good security measures in place to catch them, you know?"}, {"time": 6614, "text": "And we've caught, you know, like about two years ago, there was a huge undertaking of like 500 accounts that were banned for doing different things."}, {"time": 6622, "text": "And, you know, there's, and again, you can't go in, they can't go into detail in terms of how they're doing it."}, {"time": 6627, "text": "Cause otherwise, you know, then you're sort of giving the cheats the playbook in terms of how to take advantage."}, {"time": 6632, "text": "But it's always gonna be a concern for poker wherever you play, right?"}, {"time": 6637, "text": "But it's not something I'm worried about personally."}, {"time": 6640, "text": "So at the highest in person, and by the way, online there's really interesting algorithms that do some of the work in an automated way to detect, to flag things that are weird."}, {"time": 6650, "text": "But in person, it's just not something at the highest level that you're super concerned about."}, {"time": 6654, "text": "So it's not, it didn't quite infiltrate the poker world to a degree where it's a huge concern."}, {"time": 6660, "text": "Yeah, like, so here's the thing."}, {"time": 6661, "text": "I don't play in private games and whatever, right?"}, {"time": 6664, "text": "But in private games, theoretically, you know, you could be in, if you don't trust the people you're playing with, like I've heard stories of people where, you know, they have an earpiece in that you can't see, right?"}, {"time": 6673, "text": "And they have, you know, like RFID on the cards or something like that, and they have a phone reading it."}, {"time": 6679, "text": "So they have somebody in a truck telling them, you're gonna win this hand, you're gonna lose this hand."}, {"time": 6683, "text": "Like that happened in a private game."}, {"time": 6684, "text": "You know, and the guy, what's often funny about some of these people who cheat is they're so greedy and blatantly obvious that they get caught."}, {"time": 6692, "text": "Where if they use this tool in a more subtle way, they could probably continue to get away with it."}, {"time": 6697, "text": "But again, that's not something I worry about in a casino environment, you know, in these tournaments and things like that."}, {"time": 6703, "text": "But if I was playing in private games, like if I came down to Texas and some guy, I got cheated in a game by a guy named Blackie Blackburn and Tex, I was at the Chimo Hotel, I was a teenager and they saw me playing, you know, I was making good money as a teenager."}, {"time": 6718, "text": "I had like a $13,000 bankroll, you know, and I went and played in this game with them in a private hotel room and found out later that the guy was a card mechanic, you know, he was dealing and he could, you know, deal you the hands and he knew what you had and stuff like that."}, {"time": 6730, "text": "So yeah, I remember, you know, I lost a big number in that game and it was a good learning lesson in terms of, you know, being wary of who you trust."}, {"time": 6738, "text": "Yeah, so if the dealer is in on it, that's one way you could cheat."}, {"time": 6745, "text": "That's part of the reason that they cut."}, {"time": 6747, "text": "So like, you'll see like, there's a burn card because what would happen in, you know, maybe in the old days is like, if you're sitting in the one seat, I could lift the card and you could see it, the next card coming, right?"}, {"time": 6758, "text": "So what they do is they have a card on top of it that you burn that isn't the card and then the next card is the one that comes face up."}, {"time": 6764, "text": "I just learned about the edge sorting thing that Phil Ivey and maybe others were involved with."}, {"time": 6772, "text": "I just, reading it at first was super interesting to me that you can exploit the imperfections in the printing of cards."}, {"time": 6781, "text": "That was almost cool to me."}, {"time": 6782, "text": "That's almost not cheating because it's like."}, {"time": 6785, "text": "That needs to be a movie."}, {"time": 6787, "text": "That needs to be a movie, yes."}, {"time": 6788, "text": "Yeah, what happened with Phil Ivey in that whole case is it's a catastrophe, really."}, {"time": 6792, "text": "It is such a horrible precedent."}, {"time": 6794, "text": "Cause here's what he did."}, {"time": 6795, "text": "Phil Ivey shows up at the casino says, I want to play this game."}, {"time": 6798, "text": "They say, okay, all right, I want to play with those decks."}, {"time": 6800, "text": "They say, okay, they agree to everything that he says."}, {"time": 6804, "text": "He never touches the cards."}, {"time": 6805, "text": "He doesn't do anything outside of the fact that your cards that you supplied have imperfections on them and he can see them."}, {"time": 6813, "text": "Okay, so that increases his chances of winning."}, {"time": 6815, "text": "He could still lose theoretically, right?"}, {"time": 6818, "text": "Probably not, but he can lose."}, {"time": 6819, "text": "In theory, it just gives him a little bit of an edge and it's all stuff based on what you provided."}, {"time": 6825, "text": "So the idea that you offered a game, I accepted, I beat you and now you want to free roll me?"}, {"time": 6830, "text": "That's disgusting."}, {"time": 6831, "text": "So for people who don't know, maybe you can elaborate and it's just fascinating to me, but you're exploiting the imperfections in the card patterns on the back and then they look different if you rotate it."}, {"time": 6841, "text": "And the fascinating thing too, when you shuffle, usually you don't rotate the cards so that you can see the sort of detect which cards are the strong cards by marking them by through rotating them."}, {"time": 6857, "text": "And the way you know they're rotated is because of the pattern imperfections."}, {"time": 6861, "text": "Yeah, so some of the cards, like you said, like they had that pattern on it and some of them, this was faulty cards on there, were not cut properly."}, {"time": 6869, "text": "So like the eights and nines had the card cut differently and those are important cards in this game, the eights and nines or whatever."}, {"time": 6876, "text": "So you could essentially, from looking at the back of the card, discern what it's gonna be."}, {"time": 6881, "text": "You do nothing in terms of like cheating yourself."}, {"time": 6885, "text": "You're not rigging the game."}, {"time": 6885, "text": "All you're doing is taking advantage of the fact that you're playing, you've offered me cards that are faulty."}, {"time": 6891, "text": "Can I just say that, of course, it would be Phil Ivey, who's the goat at the normal game who will figure out this particular thing."}, {"time": 6898, "text": "I mean, that's what, if you're into soccer, this Diego Maradona has that famous hand of God in the World Cup where he scores a goal with his hand."}, {"time": 6907, "text": "And so, of course, the referee didn't see it."}, {"time": 6910, "text": "They thought it was a header."}, {"time": 6911, "text": "So, I mean, part of the magic of the genius of the people at the top of the game is they're able to exploit all the flaws that are there."}, {"time": 6920, "text": "That's a beautiful thing to see."}, {"time": 6921, "text": "Well, see, Phil had, in his heyday, he had, he exploited weaknesses in casinos, systems all over the country."}, {"time": 6931, "text": "Like in one night, I don't know if you know this story."}, {"time": 6933, "text": "In one night, he would take a plane, a private plane, and fly to 30 different casinos all over the country."}, {"time": 6938, "text": "Cause he would have these deals where they're like, all right, we've got this big rich sucker who's gonna come here and play craps and he's gonna lose all our money."}, {"time": 6944, "text": "So he'd have this deal with one of the casinos where they'd be like, all right, you get 20% back up to half a million, right?"}, {"time": 6950, "text": "So if you lose half a million, we'll give you back 100K."}, {"time": 6953, "text": "So he'd go to one casino in Tunica, he'd play half a million, win, win or lose, he would leave."}, {"time": 6960, "text": "They think they're gonna get him to stay, they get him a big room or whatever."}, {"time": 6964, "text": "So let's say he goes to Tunica, he loses half a million."}, {"time": 6966, "text": "Now he goes, he flies to Atlantic city, he wins half a million."}, {"time": 6970, "text": "He lost half a million and won half a million, but he got 100,000 back."}, {"time": 6974, "text": "So he's actually plus 100,000."}, {"time": 6976, "text": "Do that at 10 casinos a night, you're making a million dollars in free equity."}, {"time": 6979, "text": "And they would give him promotional chips and all these kinds of things and free flights and stuff like that."}, {"time": 6984, "text": "So he took advantage of the image that they're trying to exploit."}, {"time": 6987, "text": "So this is why I don't have any empathy for these casinos."}, {"time": 6989, "text": "Cause they're giving you free drinks, they're giving you, why do you think they're doing that?"}, {"time": 6993, "text": "The kindness of their heart."}, {"time": 6994, "text": "They're trying to exploit you."}, {"time": 6996, "text": "So guess what?"}, {"time": 6997, "text": "You lost at your own game, pay the piper."}, {"time": 6999, "text": "And I think it was crazy."}, {"time": 7000, "text": "Cause the judges in his case said, he did not cheat, but yeah, it's probably not right."}, {"time": 7008, "text": "You just said he didn't cheat."}, {"time": 7010, "text": "That should be the end of the case."}, {"time": 7012, "text": "And then the casinos do the funny thing."}, {"time": 7014, "text": "I mentioned to you, I was just at the UFC and Dana White is a huge gambler."}, {"time": 7019, "text": "She's a blackjack gambler."}, {"time": 7021, "text": "And there's that famous situation where you got kicked out of a casino and the casinos do that kind of thing when you win too much."}, {"time": 7028, "text": "So he won some ridiculous amount of money."}, {"time": 7030, "text": "He bets like, I mean, he plays like millions of dollars on hands of blackjack, it's insane."}, {"time": 7036, "text": "And so he won really big and he got kicked out."}, {"time": 7039, "text": "Was he counting?"}, {"time": 7040, "text": "No, no, he wasn't counting."}, {"time": 7041, "text": "So counting in blackjack here in Las Vegas is like the only game where they actually can ask you not to play."}, {"time": 7046, "text": "So like basically if you're counting cards, right?"}, {"time": 7048, "text": "You could potentially have an edge in blackjack and there are some professionals who do that, but they get caught pretty quickly."}, {"time": 7053, "text": "And then they say, you can play craps, you can play whatever you want, but you can't play blackjack here anymore."}, {"time": 7056, "text": "No, I think, I don't think Dana White is counting."}, {"time": 7058, "text": "I think he was winning a lot."}, {"time": 7060, "text": "I guess they can claim that they believe you're counting because how do you really know if you're counting?"}, {"time": 7065, "text": "Well, they easily, they figure it out."}, {"time": 7067, "text": "So basically they have an eye in the sky and they can see, so if you're varying your bet size, right?"}, {"time": 7071, "text": "So there are certain spots where based on the cards that are out, let's say for example, a lot of the twos, threes and fours and fives have been coming out."}, {"time": 7078, "text": "So the deck is rich in face cards."}, {"time": 7081, "text": "That's very good for the player, right?"}, {"time": 7083, "text": "So imagine you were betting 500 bucks and then all of a sudden you up your bet to 2000 or 5,000 when the deck is rich."}, {"time": 7091, "text": "They know when the deck is rich in high cards because they keep a counter themselves."}, {"time": 7094, "text": "So if they notice a player increasing their bet sizes when the deck is good for them, it's a telltale sign."}, {"time": 7100, "text": "Interesting, I don't think Dana White would be counting."}, {"time": 7102, "text": "And so casinos don't kick you out if you don't often kick you out."}, {"time": 7106, "text": "Do they ever kick you out if you make too much money?"}, {"time": 7108, "text": "Because you're playing millions of dollars that they."}, {"time": 7110, "text": "Unless they, they would never kick you out for making too much money, unless they suspect cheating."}, {"time": 7114, "text": "Because why would they?"}, {"time": 7115, "text": "They have an advantage, they want the money back."}, {"time": 7117, "text": "It's not like you go in there, win 10 million, you're like, oh no, that's enough for us."}, {"time": 7120, "text": "What about if he was talking shit the whole time?"}, {"time": 7122, "text": "I don't think that would matter."}, {"time": 7124, "text": "Because in the long run, they'll get the money back."}, {"time": 7131, "text": "You tweeted, if you watched Jersey Shore, Family Vacation, we would probably get along really well."}, {"time": 7137, "text": "What is it about, because I lived in Jersey for a while, what is it about Jersey Shore characters that you love?"}, {"time": 7143, "text": "I just love that they're sort of, I love the debauchery."}, {"time": 7146, "text": "I think Pauly D's a fun guy, you know, and just like, it's just something like, it's just, it's what do you call it?"}, {"time": 7153, "text": "It's trash TV, it's a guilty pleasure."}, {"time": 7155, "text": "But you can just watch the Snooki get drunk and fallen all over herself or whatever."}, {"time": 7160, "text": "Is that part, do you love that part of Vegas as well?"}, {"time": 7163, "text": "Not really, I don't go out and stuff, but I just like the characters."}, {"time": 7167, "text": "I like that they have unique personalities."}, {"time": 7170, "text": "And I think we live in a world now where people are more and more careful of what they say and afraid of backlash and all that stuff."}, {"time": 7178, "text": "And it's kind of like an old school version of just like, say what you feel, it's okay, as long as your intent is good."}, {"time": 7184, "text": "And they haven't been canceled, if you will, which is good, but I feel like their type of behavior slowly but surely, like, cause they got a lot of flack originally for misrepresenting like Italian Americans or something like that."}, {"time": 7200, "text": "Like there was a lot of backlash about this and how Italian Americans really are and blah, blah, blah."}, {"time": 7204, "text": "So they sort of were representing that group of people and, you know, they received some backlash back in the day."}, {"time": 7213, "text": "I'm a huge supporter of diversity in all the beautiful forms that the human species is able to generate."}, {"time": 7220, "text": "And that's certainly one dimension."}, {"time": 7222, "text": "What's the greatest Vegas movie, would you say?"}, {"time": 7225, "text": "I don't know if that's a difficult question, but Fear of Loathing in Las Vegas, Leaving Las Vegas, Casino."}, {"time": 7230, "text": "I watch, cause anytime Casino's on randomly, I always watch it."}, {"time": 7233, "text": "Such a great movie."}, {"time": 7235, "text": "It could be one of the Sharon Stone."}, {"time": 7238, "text": "Sharon, frankly, Sharon Stone reminded me, every time I would watch the movie, it reminded me of my wife, Amanda, like totally."}, {"time": 7245, "text": "I would see like the character and I was like, I'm the Robert De Niro character in the film."}, {"time": 7249, "text": "It was, I used to watch it through that lens, you know."}, {"time": 7252, "text": "From like the depth of love that you have."}, {"time": 7257, "text": "Just kind of, she was, I remember that she was like, she was like, she lit up every room."}, {"time": 7261, "text": "She does light up every room."}, {"time": 7263, "text": "She goes there, everybody's attracted and drawn to her."}, {"time": 7265, "text": "And she was kind of, when she was younger, she was a little wild and crazy and whatnot."}, {"time": 7269, "text": "So she reminded me of the Sharon Stone character."}, {"time": 7271, "text": "And then the Robert De Niro character is trying to like have a stable life, you know, and be that."}, {"time": 7276, "text": "And that was me."}, {"time": 7277, "text": "Who was the Joe Pesci in your life?"}, {"time": 7279, "text": "Well, there was a guy named, there was a James Woods for sure, who was the Lester."}, {"time": 7282, "text": "We called him, we actually called him Lester."}, {"time": 7284, "text": "A few of my friends call him Lester."}, {"time": 7287, "text": "The greasy guy who tried to get back in and all that."}, {"time": 7292, "text": "Yeah, one of my favorite scenes is when they meet out in the desert and it's like a 50, 50 odds if you're gonna make it out alive in that."}, {"time": 7298, "text": "I mean, yeah, there's an epicness to that portrayal of Vegas."}, {"time": 7303, "text": "I love, I mean, it's just totally, I mean, it's obviously more corporate now and it's different, but I love those movies."}, {"time": 7309, "text": "I love all those movies, just seeing that life."}, {"time": 7311, "text": "And like I said, if there was a period in time that I could go back to and just experience it, it would be that, you know, right around then."}, {"time": 7316, "text": "There'll be that, playing with a mob and not."}, {"time": 7320, "text": "I think of like these crime shows today, like they're so unrealistic now because if they're in an era that is now, like none of this stuff can happen because there's cameras everywhere."}, {"time": 7329, "text": "You can't like get away with these, like killing somebody and jumping in a car and you're gonna get caught, you know?"}, {"time": 7335, "text": "But in the 70s, you know, that stuff happened."}, {"time": 7338, "text": "Across the line, you die."}, {"time": 7339, "text": "Yeah, Lake Mead is recently like losing water and like every couple of days they're finding more and more bodies from that era."}, {"time": 7349, "text": "You're close with your mom."}, {"time": 7350, "text": "What did you learn about life from your mom?"}, {"time": 7353, "text": "My mother was very generous."}, {"time": 7355, "text": "My mother, she experienced joy through giving people food."}, {"time": 7359, "text": "For the most part, my dad would get them drinks and that was how she felt fulfilled, right?"}, {"time": 7365, "text": "She felt good when she like would cook for you."}, {"time": 7367, "text": "And like, she'd be that person you'd come over and she'd be like, are you hungry?"}, {"time": 7370, "text": "And you say, no, no, no, I'm okay."}, {"time": 7371, "text": "She's gonna put 15 things in front of you and you'll eat."}, {"time": 7374, "text": "You know, you're gonna eat."}, {"time": 7375, "text": "Cause everyone does that to be polite."}, {"time": 7376, "text": "No, no, I'm good."}, {"time": 7377, "text": "But you know, they will start to eat."}, {"time": 7379, "text": "And just her hospitality in that regard and just being generous and like being a good host to people and things like that, like."}, {"time": 7387, "text": "How did that define, like help define who you are as a person, that generosity?"}, {"time": 7393, "text": "Did it rub off on you?"}, {"time": 7394, "text": "It made me think about in my life when it comes to like any sort of business deals or things like that, I don't wanna get the best of it in such a way where I screw the other person."}, {"time": 7405, "text": "I genuinely don't."}, {"time": 7406, "text": "I'd much rather you owe me than me owe you."}, {"time": 7409, "text": "So if I hire people, they get paid more than they're supposed to."}, {"time": 7413, "text": "And I'd rather them do that and work towards it rather than feel underpaid."}, {"time": 7417, "text": "Cause if they're underpaid, they'll likely under deliver."}, {"time": 7419, "text": "Whereas if they feel overpaid, then if I need them to do something special, they're not gonna be like, hey, I don't get paid for that."}, {"time": 7425, "text": "Like, yeah, you do."}, {"time": 7426, "text": "You really do."}, {"time": 7427, "text": "So that's certainly like played out in my life where I set it up in such a way where I don't owe, you know, I'm owed, but that's okay."}, {"time": 7436, "text": "Cause I can handle taking the worst of it in spots."}, {"time": 7438, "text": "I don't like being the person to, you know, feel like I'm indebted to others."}, {"time": 7444, "text": "Yeah, in some way, the karma of that tends to pay dividends in the longterm."}, {"time": 7449, "text": "Somehow there's somebody up there that's keeping track in some kind of way."}, {"time": 7457, "text": "What advice would you give to young people today in high school and college?"}, {"time": 7462, "text": "How to have a career they can be proud of or maybe how to have a life in general they can be proud of?"}, {"time": 7468, "text": "I would say like your 20s is a good opportunity to set yourself up for the rest of your life, right?"}, {"time": 7474, "text": "So while the 20s are a period where you wanna have fun and you wanna experience youth, it's also a good opportunity to start thinking about what do you want your life to look like in your 30s and your 40s, right?"}, {"time": 7486, "text": "So I feel like it's the best time to really put yourself out there and take risks and try to hit it, you know, whatever, you know, like to work really, really hard to set yourself up."}, {"time": 7496, "text": "Because, and I said this at an event I was speaking at, when you're like with poker, when your bankroll is very, very small, it's replenishable, right?"}, {"time": 7505, "text": "You don't need to protect it as much as you do once you've got something, right?"}, {"time": 7509, "text": "Once you have a brand or you have money, you have something like that, that's when you wanna start protecting you."}, {"time": 7514, "text": "But in your 20s is an opportunity to just really sort of get, you know, to work really, really hard to set yourself up, you know, for the future."}, {"time": 7522, "text": "I am concerned a little bit, like every time I talk to kids today, I'm like, what do you wanna be?"}, {"time": 7526, "text": "They all wanna be YouTubers or Instagram stars or rappers, right?"}, {"time": 7531, "text": "Like, okay, I was like, that's cool, but like, there's only so many of those, you know, that there can be."}, {"time": 7535, "text": "So it might be worthwhile having a little bit of a backup plan."}, {"time": 7538, "text": "I think it's easier to be successful on Instagram and social media if you do something else."}, {"time": 7543, "text": "And I would say this too."}, {"time": 7544, "text": "One other thing I would say is, don't choose a profession or an idea because you think it'll make you rich, right?"}, {"time": 7554, "text": "Pursue something that you actually love."}, {"time": 7556, "text": "Because if you love it, you're way more likely to become rich."}, {"time": 7559, "text": "If you don't, you do something that you don't actually enjoy."}, {"time": 7562, "text": "Now you're spending a lot of your life unhappy, doing something you don't want, and if you're not passionate about it, you're probably not, the chances of you being successful are much lower."}, {"time": 7572, "text": "And also becoming rich, and I've talked to a lot of rich people, hang out with a lot of rich people, is not going to be as fulfilling as you imagine."}, {"time": 7581, "text": "If you arrive there by not doing the thing that you love doing."}, {"time": 7585, "text": "Ultimately, the thing that you love doing is like, that's what makes life worth it."}, {"time": 7590, "text": "There's another quote, I can't remember who it was, otherwise I would quote them, but it says something to the effect of like, if we believe in the lie that more is always better, then we can never truly arrive."}, {"time": 7601, "text": "Because wherever we are, more is better, right?"}, {"time": 7604, "text": "I've never understood, and I've been around rich people, like you said, you know, the bill, I never got, I can't, I don't get it."}, {"time": 7610, "text": "Like, if you have a billion dollars, why do you give a shit about money at all?"}, {"time": 7614, "text": "Like, and they're still like, oh, we made this deal, and I'm like, you know, we picked up 300, who cares?"}, {"time": 7619, "text": "Like, your life is set."}, {"time": 7620, "text": "Like, there is that bell curve, right?"}, {"time": 7623, "text": "Where obviously being in poverty, you know, there's obviously a high rate of unhappiness, but there's a certain amount of money where you reach, you know, where you reach a level of happiness, and then too much, you find the people that are searching for money to fulfill these holes, it starts to go back down again."}, {"time": 7637, "text": "Well, the getting more money could become a game, like a sport, that's fun to play, as long as you directly or indirectly acknowledge that what you love is the game of it, versus the actual attainment of money."}, {"time": 7651, "text": "And I think that's what it is, right?"}, {"time": 7652, "text": "For me, I've never cared about money that much."}, {"time": 7654, "text": "I just never did, otherwise I would have a lot more of it."}, {"time": 7657, "text": "But it's always, like, it's always been strange to me how people that have that kind of money, like, are cheap in any way, you know?"}, {"time": 7665, "text": "Like, they wouldn't donate 5,000 to a worthwhile charity, because it's like, buddy, this, like, when it changes your life, not, I don't even like, like, small things, like taxes."}, {"time": 7675, "text": "Like, okay, you have $20 billion, and you're worried about paying 33%, 30% to 31."}, {"time": 7680, "text": "I get it, I get the point of it all, but like, it literally has no effect on your life whatsoever."}, {"time": 7686, "text": "Your life is unchanged, whether it's 31 or 33."}, {"time": 7690, "text": "Yeah, that's the negative of a lot of money, is if it corrupts the way you see the world, you start to be protective and so on."}, {"time": 7696, "text": "I mean, part of the challenge of when you get a lot of money is people start to treat you differently, and so navigating that correctly is very challenging."}, {"time": 7704, "text": "So don't change, remain the same person you always were, because if you change, you start to, I mean, that's why power corrupts, is you get a lot of power, you get a lot of fame, you get a lot of money, you start to distrust people, and you start to push away people that are actually really close to you with trusting."}, {"time": 7751, "text": "And a lot of poker people have that, and listen, I'm probably guilty in some ways too, thinking because you can figure out poker and be great at that, that you could figure out anything."}, {"time": 7760, "text": "So it's true, right?"}, {"time": 7761, "text": "I mean, we sort of, we genuinely feel like people that reach the highest levels of poker feel like they are intelligent."}, {"time": 7767, "text": "So they will look at problem solving and think that they have answers."}, {"time": 7770, "text": "Well, you have to remind yourself that you're not."}, {"time": 7772, "text": "It's best to see the world as you did just get lucky, or at least from my perspective, that you're not better than anybody."}, {"time": 7778, "text": "I don't think there's anything wrong with, like, acknowledging that you worked hard to get where you were."}, {"time": 7782, "text": "Like, there isn't, but at the same time, like, it's not available to everybody in the same way."}, {"time": 7786, "text": "You know, right time, right place."}, {"time": 7787, "text": "Like, for me, my poker career could have gone very differently, you know?"}, {"time": 7790, "text": "If things didn't work out, you know, if I had some bad luck in the wrong times, like, who knows where I'd be?"}, {"time": 7796, "text": "So you said your brain crawl is pretty small in your 20s."}, {"time": 7799, "text": "I'm sure you've been around a lot of people you care a lot about who've lost everything in poker."}, {"time": 7805, "text": "What's those low points of losing everything?"}, {"time": 7809, "text": "I think because I've been there, I have more empathy than I probably should for those people."}, {"time": 7815, "text": "I really feel for them."}, {"time": 7816, "text": "Cause I remember being in Vegas and being totally broke and like a guy loaning me $400 and me like turning that 400 into 20,000, 400 bucks."}, {"time": 7824, "text": "And it was like eternally grateful to that."}, {"time": 7827, "text": "So when I have friends who go through that, like I always try to consult them, obviously what they really need is money for the most part."}, {"time": 7834, "text": "But I remember saying no to one friend because he didn't have a plan."}, {"time": 7837, "text": "So I like to try to help them in that regard."}, {"time": 7839, "text": "Like my buddy's like, can you stake me in this game?"}, {"time": 7842, "text": "And I was like, all right, well, how much do you, then I was like, let's break down the math, bro."}, {"time": 7845, "text": "You want me to stake you?"}, {"time": 7846, "text": "So you get 50% of the profit, right?"}, {"time": 7848, "text": "So I said, how much do you think you can make in this game?"}, {"time": 7850, "text": "How much does the biggest winners make?"}, {"time": 7852, "text": "It's like, well, I can probably, you know, I probably do like 20,000 a month in this game."}, {"time": 7857, "text": "So you get half of that cause I get 10, right?"}, {"time": 7858, "text": "What is your monthly nut?"}, {"time": 7859, "text": "How much are you spending?"}, {"time": 7860, "text": "It's like, well, I'm renting this thing for 8,000."}, {"time": 7863, "text": "You're spending 17,000 a month."}, {"time": 7865, "text": "So like, no matter what you're set up to fail."}, {"time": 7869, "text": "Like this isn't going to work."}, {"time": 7870, "text": "So I actually didn't give him the money."}, {"time": 7872, "text": "And I was like, what you need to do to earn more money is lower your monthly nut because it's too high."}, {"time": 7876, "text": "It just, you know, it just doesn't mathematically add up."}, {"time": 7879, "text": "So trying to set them right in that regard is something that like I feel obliged to do, especially if they're friends."}, {"time": 7885, "text": "But what about the mental aspect of the struggle they're going through, the struggle you were going through?"}, {"time": 7890, "text": "Just, I mean, it's really rough to have no money."}, {"time": 7894, "text": "It's not for everybody."}, {"time": 7895, "text": "This really isn't."}, {"time": 7896, "text": "Like a lot of people might, you know, listen to this and think like, oh, I want to play poker."}, {"time": 7898, "text": "It's like, most people fail."}, {"time": 7901, "text": "Most people who want to play in the NFL, they spend their college years, like most of them are not going to make it."}, {"time": 7908, "text": "Most of you who try to play poker professionally are going to fail and you're going to experience despair."}, {"time": 7913, "text": "There are those like in anything that have the passion, have the knowhow, have the luck and all that sort of stuff."}, {"time": 7918, "text": "And it all pans out, but you know, they're the minority."}, {"time": 7923, "text": "And so for the low points, if you remember, what does it take to sort of overcome that, overcome the mental struggle?"}, {"time": 7932, "text": "I mean, you're making it sound like certain people are just genetically able to in certain."}, {"time": 7935, "text": "I do think some people are more apt to being able to deal with like adversity and having resilience and some people just can't hack it."}, {"time": 7941, "text": "But like I generally, what I would advise, you know, people that are, let's say a guy's playing, you know, really high stakes or whatever, doing badly is step number one is take, take a little bit of a break here."}, {"time": 7950, "text": "Let's recalibrate and let's start small again."}, {"time": 7953, "text": "Let's, you know, let's restart and let's play smaller stakes and let's get our confidence back because in poker, without confidence, you cannot be successful."}, {"time": 7961, "text": "It is incredibly important to have almost an inflated level of confidence in yourself because you're up against it, right?"}, {"time": 7968, "text": "As I said, the majority of people fail."}, {"time": 7970, "text": "So why are you special?"}, {"time": 7971, "text": "Why are you different?"}, {"time": 7972, "text": "You have to be pretty confident about your, you know, yourself to think that you are one of the chosen ones."}, {"time": 7977, "text": "And then don't resist the despair and take a nap."}, {"time": 7981, "text": "Definitely take a nap."}, {"time": 7983, "text": "Listen, it's okay to experience it."}, {"time": 7985, "text": "Like I said, yeah, you're going to experience despair."}, {"time": 7986, "text": "What else would you, what should you be feeling?"}, {"time": 7989, "text": "You know, if things are going poorly and you've just lost all your money, excited?"}, {"time": 7992, "text": "Maybe like, okay, have your moment of grief, allow yourself to experience it so that you can, you know, reassemble."}, {"time": 8000, "text": "There's a fundamental way in which you haven't really lived life if you haven't experienced periods of despair."}, {"time": 8007, "text": "You have a jaded view of the world, right?"}, {"time": 8010, "text": "Weird thing about the human condition that both the highs and the lows are important."}, {"time": 8016, "text": "What role does love play in the human condition, Daniel Negrano?"}, {"time": 8027, "text": "It's, yeah, that's, you know, you sort of talked about the ups and downs of the human condition and love has been that for me, right?"}, {"time": 8038, "text": "Like I'm in a good place now, but you know, even with my now wife years ago, you know, she was young, she was, you know, new to poker and she wasn't ready to settle down."}, {"time": 8049, "text": "I was like, when I met her, I think I was 31, she was 21."}, {"time": 8052, "text": "And I was ready to like lock her up, if you will, you know, let's do this."}, {"time": 8056, "text": "And I bought a ring way back when she was like, not about that."}, {"time": 8059, "text": "She was living the Hollywood life."}, {"time": 8060, "text": "She was living, you know, partying in LA, doing that kind of stuff and wasn't ready."}, {"time": 8063, "text": "And we split and that one hit me hard."}, {"time": 8067, "text": "So I didn't realize how much of a hit that had on my confidence in my, in everything really, in poker, with other women."}, {"time": 8076, "text": "It had me a little jaded about women too, you know, resentful, you know, and it took a lot of like self, I did like a lot of personal growth work and workshops and things like that."}, {"time": 8087, "text": "And then didn't see her for years."}, {"time": 8089, "text": "And she came back to town, I was a much different person."}, {"time": 8091, "text": "It was just, you know, four years ago or something like that."}, {"time": 8094, "text": "And she was too, went to dinner."}, {"time": 8096, "text": "A few months later, we were married."}, {"time": 8098, "text": "It worked out so different because we both had to grow, you know, and become different people."}, {"time": 8103, "text": "And that love was still there somehow."}, {"time": 8105, "text": "Yeah, like she went through her relationships."}, {"time": 8107, "text": "I went through mine, you know, we experienced life and I was married once before too, you know, called my starter marriage, if you will, which yeah, you know, we just, you don't know."}, {"time": 8119, "text": "I think like until you do it, until you get married and you know, experience like the sacrifice, not necessarily the sacrifices, but your value systems, if they don't align identically, which they're not going to, someone like me, probably one of my strengths in poker, but my weaknesses in relationship is judgment, right?"}, {"time": 8136, "text": "When I play poker, I need to judge you."}, {"time": 8137, "text": "That's essentially what I'm doing."}, {"time": 8139, "text": "I'm gauging who you are and what you're good at and what you're bad at."}, {"time": 8143, "text": "And that can have repercussions because it leads, that's how I view, that's the lens I look at everyone with based on how you live your life."}, {"time": 8149, "text": "I'm judging you, this guy's this, this guy's that, this guy's that, and that's not healthy."}, {"time": 8153, "text": "So you have to shut that off."}, {"time": 8154, "text": "You have to learn to like, and the thing, I finally realized what love is, frankly for me, with her is no judgment, right?"}, {"time": 8162, "text": "She's so like, yeah, so I have my way of being, right?"}, {"time": 8164, "text": "If she wants to have cereal for dinner, babe, that's the best decision for her."}, {"time": 8168, "text": "I was living in a framework of better and worse."}, {"time": 8171, "text": "The way that I do things is better and yours is worse, do things more like I do."}, {"time": 8175, "text": "That's a recipe for disaster."}, {"time": 8177, "text": "True acceptance and true love is accepting someone like exactly as they are."}, {"time": 8181, "text": "You know, if she wants to do something different, I'm going to support her, whatever it is."}, {"time": 8185, "text": "Even if I disagree with it personally, and like the way that I would do things, learning to just realize that she's had a different journey and a different walk towards where she's at than I have."}, {"time": 8194, "text": "So I can't pass my judgments on other people like that."}, {"time": 8197, "text": "I believe it is ethically wrong and probably illegal to eat cereal for dinner."}, {"time": 8203, "text": "Listen, if she wants it, she wants it."}, {"time": 8205, "text": "Acceptance."}, {"time": 8206, "text": "Like when she goes to bed, like all these little things, but my regimented life, she's not."}, {"time": 8210, "text": "Like our motto at our wedding was like, you keep me wild, I'll keep you safe, you keep me wild."}, {"time": 8216, "text": "I keep her safe, she keeps me wild."}, {"time": 8219, "text": "She's like not organized and anal and all those kind of things, I am."}, {"time": 8222, "text": "She helps me like let loose."}, {"time": 8226, "text": "You know, oh no, I'm eating this, this."}, {"time": 8227, "text": "She's like, have some popcorn."}, {"time": 8229, "text": "Like, all right, let's do it, you know?"}, {"time": 8230, "text": "She keeps me freed."}, {"time": 8232, "text": "And accepting that, embracing that, the difference is the chaos of it."}, {"time": 8238, "text": "That's what makes it."}, {"time": 8239, "text": "Like I literally do think about with her, how important it is and how much I try to like just come from neutral and like compassion and never judge."}, {"time": 8248, "text": "Cause she's got other things that she deals with, right?"}, {"time": 8250, "text": "That I don't, she's bipolar, right?"}, {"time": 8252, "text": "So with that, I've studied and I've learned a lot about, you know, sort of mental health and what that means and ways in which a lot of characteristics about somebody is completely out of their control when they're bipolar, right?"}, {"time": 8267, "text": "And there's swings, like there's no cocktail for bipolar that solves the issue, right?"}, {"time": 8273, "text": "So there's medications that work to, you know, level you out for periods of time, but then they start to fade and they don't work as well."}, {"time": 8279, "text": "So they constantly need readjustment."}, {"time": 8281, "text": "It's an unsolved mystery to a certain degree."}, {"time": 8284, "text": "So in some sense, you know, her diagnosis made our relationship easier because I don't take anything personal, right?"}, {"time": 8293, "text": "I realized that sometimes she's gonna be in a mood."}, {"time": 8296, "text": "I mean, she's so good about communicating it though."}, {"time": 8299, "text": "She tells me some morning she'll be like bad mood trying to get out of it, babe."}, {"time": 8302, "text": "I'm like, okay, I leave her alone."}, {"time": 8304, "text": "Well, that's great."}, {"time": 8305, "text": "That means she's grown to be able to communicate, to understand, to self reflect, to understand where she is."}, {"time": 8309, "text": "I have people in my life who I love who are bipolar."}, {"time": 8312, "text": "It's a beautiful ride."}, {"time": 8314, "text": "It is, right?"}]}]