[{"title": "Andrew Huberman: Focus, Stress, Relationships, and Friendship | Lex Fridman Podcast #277", "id": "lvh3g7eszVQ", "quotes": [{"time": 264, "text": "You're just repulsed by food."}, {"time": 265, "text": "The only modification I made was the next day, I would fast completely, just to avoid the gastric distress of eating anything."}, {"time": 272, "text": "And so I would do them on Sundays and then Mondays I'd fast all day."}, {"time": 275, "text": "And then by Tuesday, I felt pretty good again, but Sunday and Monday, or you just feel like you're sliding down the slope of just blood sugar disaster."}, {"time": 284, "text": "Terrible idea or a good idea?"}, {"time": 286, "text": "You know, at the time I enjoyed it."}, {"time": 288, "text": "I love donuts, croissants, all that kind of stuff."}, {"time": 290, "text": "What's interesting is after stopping that whole protocol, now I just try and eat well each day."}, {"time": 294, "text": "Protocol."}, {"time": 295, "text": "It's really a protocol."}, {"time": 296, "text": "Now I basically, I do a pseudo intermittent fasting."}, {"time": 299, "text": "I'm not really strict, but I'll start at eating around 11, eat my first meal around 11, I usually train in the morning, eat my last bite of food somewhere around eight or nine, and I'm not super strict."}, {"time": 307, "text": "I might have some berries or something late at night."}, {"time": 309, "text": "Three meals, two meals?"}, {"time": 311, "text": "Two meals."}, {"time": 312, "text": "And then maybe a little bit of snacking on some nuts or something in the middle."}, {"time": 316, "text": "Ever fast, 24 hour?"}, {"time": 317, "text": "Never done a long fast, except when I was doing the cheat days."}, {"time": 320, "text": "And then, and actually there are a couple different ways to do cheat days that were fun."}, {"time": 325, "text": "Like if you were in a new city, you could try all the restaurants that you wanted."}, {"time": 330, "text": "Yeah, and I think Tim and our mutual friend, John Romanello did a, I think it was like a cheat day marathon where they did, you know, marathon's 26.3 miles."}, {"time": 338, "text": "They went to 26.3 different locations in New York."}, {"time": 341, "text": "They put it on a map and I never took it to that extreme, but."}, {"time": 346, "text": "Over how many days?"}, {"time": 347, "text": "One day."}, {"time": 348, "text": "That was their cheat day."}, {"time": 350, "text": "Just cause they were, you know."}, {"time": 350, "text": "Just a little bit of something at each place."}, {"time": 354, "text": "I mean, there are things that guys do in their thirties that you just shouldn't do in your forties."}, {"time": 358, "text": "I can say that cause I'm in my forties."}, {"time": 359, "text": "And now I just try and eat well most days."}, {"time": 361, "text": "And what's interesting is about 12 to 14 months ago, I completely lost all appetite for sweets."}, {"time": 368, "text": "I don't know what happened."}, {"time": 368, "text": "I still love savory food."}, {"time": 370, "text": "So meat and butter and cheese, and I love vegetables too."}, {"time": 374, "text": "I love fruit also, but lost all appetite."}, {"time": 376, "text": "So if you put a donut in front of me or ice cream or something like that, I just, it's almost aversive to me and I don't know what happened."}, {"time": 383, "text": "I don't know what changed."}, {"time": 384, "text": "It's probably a scientific explanation."}, {"time": 386, "text": "It has to do maybe with habit."}, {"time": 387, "text": "Neuron loss, dementia."}, {"time": 389, "text": "The sugar, the desire for that rush maybe is gone from your soul."}, {"time": 397, "text": "So what was the most delicious things, croissant donuts?"}, {"time": 400, "text": "Is there a thing that?"}, {"time": 402, "text": "There's a place in Portland."}, {"time": 404, "text": "I don't know if it's still open called Little T's Bakery."}, {"time": 407, "text": "And they have croissants that easily rival the croissants in Paris."}, {"time": 412, "text": "People make a lot of the pastry in Paris, but it's really the bread in Paris that's amazing."}, {"time": 417, "text": "We lived there when I was a kid and we did a sabbatical there and you know, there they do the baguette, morning bake and afternoon bake."}, {"time": 422, "text": "And there's nothing like the bread in Paris or the people, you know, and, but if you're in the Pacific Northwest, you know, you can find amazing croissants there."}, {"time": 433, "text": "What do you do with the croissant?"}, {"time": 434, "text": "What do you do with the bread?"}, {"time": 435, "text": "Butter or is it just?"}, {"time": 436, "text": "I actually used to, I don't eat them anymore."}, {"time": 438, "text": "I don't have much of an appetite for them, even though they're not a sweet food, but I'm always putting butter on the croissant."}, {"time": 444, "text": "Butter on the butter croissant."}, {"time": 445, "text": "No jam."}, {"time": 446, "text": "I would never adulterate my croissant."}, {"time": 448, "text": "I have to actually be honest about this because people talk about steak and they talk about bread with the butter."}, {"time": 454, "text": "I feel like butter is cheating."}, {"time": 455, "text": "I feel like you're disrespecting the fundamental food by adding butter."}, {"time": 461, "text": "Cause butter, it's like, it's like, it's like a elite version of ketchup."}, {"time": 467, "text": "You're."}, {"time": 468, "text": "Well there we diverge because for me, bread is just a vehicle for butter."}, {"time": 472, "text": "A cracker is just a vehicle for cheese."}, {"time": 476, "text": "Oh, so that's just the, the cracker and the bread is just texture."}, {"time": 479, "text": "It's just that people look at you funny if you, if you just eat the butter straight, which occasionally I do."}, {"time": 485, "text": "So I put a little piece of bread underneath it, not because I'm low carb, strictly low carb, but just because otherwise you get some funny looks."}, {"time": 493, "text": "That's like pasta is a vehicle for pasta sauce."}, {"time": 497, "text": "It's interesting, but like Indian non bread, you have, you have the bread."}, {"time": 503, "text": "I've had a lot of soul searching on which part of Indian is, brings me so much joy."}, {"time": 508, "text": "Is it the bread or is it all the sauces that come with the bread?"}, {"time": 511, "text": "Well, there we diverge again, because for whatever reason, no disrespect to anyone, but Indian food doesn't appeal to me."}, {"time": 519, "text": "Well, you're a lucky man because the number of calories in that food, it sneaks like non bread."}, {"time": 524, "text": "I don't know how non bread is made, but I think it's just soaked in oil and it just very intensely, like the density of calories is very, very high."}, {"time": 536, "text": "For me, barbecue, I would say is probably the, that's good."}, {"time": 539, "text": "Anytime I'm in Austin, I start thinking about barbecue."}, {"time": 542, "text": "I do love, you know, I do love meat."}, {"time": 544, "text": "My dad's Argentine."}, {"time": 545, "text": "I mean, I love steak."}, {"time": 546, "text": "I love meat."}, {"time": 547, "text": "I mean, Argentina chorizo sausage is an appetizer before you have steak."}, {"time": 552, "text": "It's meat on top of meat."}, {"time": 553, "text": "And it's not just, you know, it's not just the men, right?"}, {"time": 556, "text": "You see women, sometimes very petite women eating steaks that are bigger than their skull size."}, {"time": 562, "text": "You know, slowly, they eat very slowly there."}, {"time": 564, "text": "And they all eat dessert too, which is interesting."}, {"time": 566, "text": "And they generally do the sort of one meal per day and do that kind of real flexibly."}, {"time": 571, "text": "Cause I often eat one meal a day, especially when I'm traveling."}, {"time": 574, "text": "It feels like a cheap meal because it allows, it gives you a bit of more freedom to just lose yourself in the quantity of the food."}, {"time": 582, "text": "I did the three day fast and I ate chicken breast, like literally chicken breast with nothing else, just grilled."}, {"time": 588, "text": "And it was the most delicious piece of meat I've ever eaten."}, {"time": 591, "text": "And that, and that gives you, the problem is when you fast the three days, you really can't pig out."}, {"time": 596, "text": "You really shouldn't."}, {"time": 597, "text": "Your stomach will shrink in size already."}, {"time": 599, "text": "Your gut microbiome is almost completely depleted by fasting."}, {"time": 602, "text": "A lot of people think, oh, cleanses and fasts are great for the microbiome."}, {"time": 605, "text": "They quash your microbiome."}, {"time": 607, "text": "However, when you start eating again, the microbiome comes back better than it was before your fast."}, {"time": 613, "text": "For people who don't know, Sergey and Todd are on the call."}, {"time": 615, "text": "They're kind of pulling stuff up."}, {"time": 616, "text": "They just pulled up Phelps with the, I forget how many calories he was eating, 10,000."}, {"time": 622, "text": "There's some, some cool physiology around this."}, {"time": 624, "text": "The reason he needed to eat so much is not that he was burning that many calories in pure movement."}, {"time": 631, "text": "It's that when you do exercise in water, even if it's warm water, the heat transfer in water is greater."}, {"time": 636, "text": "So you burn far more calories."}, {"time": 638, "text": "And again, here, I'm admittedly lifting that from knowledge that was passed on to me by Tim Ferriss."}, {"time": 643, "text": "I didn't, so, but I checked it out and it's absolutely true."}, {"time": 646, "text": "So if you exercise in water, even if it's not really cold water, your caloric needs go way up, which is why you get out of the pool and you're often really hungry."}, {"time": 653, "text": "And for fans of the Human Lab podcast, and if you're not a fan, what are you doing with your life?"}, {"time": 660, "text": "You would probably chuckle at the fact that Andrew just cited his sources, even on that statement, because you're so good at, I don't know how your memory works, but the only person whose memory is better than Joe Rogan is yours."}, {"time": 674, "text": "But my colleagues joke, you know, PubMed sort of scrolls through my mind."}, {"time": 680, "text": "Also in science, as you know, attribution is so baked into what we do."}, {"time": 685, "text": "And I think that it's interesting because now spending a lot of time on social media, attribution is not as common."}, {"time": 691, "text": "And, but in academia, you learn really early on that if you give a talk about your data and you cite all these amazing sources, all it does is make you look better, right?"}, {"time": 702, "text": "Whereas in social media and elsewhere in the business sector, it's almost like citing other people, people feel as if it's going to take away some of the credit."}, {"time": 709, "text": "All it does is place you in the company of people that do really nice work."}, {"time": 712, "text": "So I have tremendous, and I have genuine and tremendous respect for Tim."}, {"time": 715, "text": "He's been about 10 years ahead on a huge number of health related things and other things and extremely kind person, very thoughtful person."}, {"time": 722, "text": "So it's also just a pleasure to shine light on other people."}, {"time": 725, "text": "Yeah, well, I actually, to push back, I know there's a culture of if you write a paper, standing on the shoulders of giants is a powerful thing, but there's also a culture of not giving credit to the strongest idea in your paper."}, {"time": 741, "text": "And instead say it's kind of, or imply that it's original."}, {"time": 744, "text": "There is a culture of kind of not celebrating others."}, {"time": 748, "text": "I think people get most competitive in all walks of life, but especially in science when they're, the closer they get in the exact thing they work on."}, {"time": 759, "text": "And so there's this dance, you know, there's a few researchers in each of the individual little things that you work on."}, {"time": 766, "text": "If you're studying a particular kind of ant, you know that other asshole that also is studying that particular ant, and then you're not going to often give credit for the brilliant ideas that that other researcher is doing."}, {"time": 779, "text": "And I think one of the things you've discovered and just as part of your nature, which is why it's really great that you have an audience and you inspire others to do the same, is you celebrate that other ant studier."}, {"time": 792, "text": "It's great and everybody wins, it raises all boats."}, {"time": 796, "text": "But that initial instinct to be like, what is it in Borat?"}, {"time": 801, "text": "Like my neighbor gets a toaster, I get a bigger toaster."}, {"time": 807, "text": "Yeah, that mindset to, you know, it's not that I'm not competitive in certain domains, but yeah, I get great pleasure from sharing things that I find."}, {"time": 817, "text": "And I think that, you know, at the end of the day, you're as strong as your community and you can build a wonderful community just by pointing out things that you love."}, {"time": 828, "text": "Like these are all just loves."}, {"time": 829, "text": "I see a paper and I love it."}, {"time": 831, "text": "Only rarely do I think, oh, I wish we had done that."}, {"time": 834, "text": "I usually think, fantastic, now I can just focus on something else because they checked off that box."}, {"time": 839, "text": "And by the way, you mentioned PubMed and barbecue."}, {"time": 842, "text": "I should mention that I got a chance to hang out with Rick Rubin, thanks to you."}, {"time": 846, "text": "He's a friend of yours and you made the connection."}, {"time": 847, "text": "That was a huge gift to my spirit, I guess."}, {"time": 851, "text": "He's a truly, truly special human being."}, {"time": 853, "text": "And there's a lot I could say about why he's a special human being."}, {"time": 857, "text": "I'd love to learn how you met him, but I should also just mention on the PubMed thing, it was so interesting talking to him about music and both on the podcast and privately and just listening to music together."}, {"time": 872, "text": "Because when you mention a song, he does this thing where he like closes his eyes and he finds that song in the album that we're talking about and he steps through the album."}, {"time": 885, "text": "You could see the brain like stepping through individual songs to find that song in the album."}, {"time": 891, "text": "And there's that kind of lookup process."}, {"time": 893, "text": "And then he puts himself mentally in that space of like, okay, this is, you know, whatever the album is."}, {"time": 899, "text": "And not just the ones he produced, but all of these in the encyclopedia of music."}, {"time": 906, "text": "It also, the thing I really love about him is something like a calmness that radiates from him."}, {"time": 913, "text": "That it's okay to close your eyes and place yourself in the place where that album was recorded, in the feeling of that album and like that silence."}, {"time": 924, "text": "Let's go there, let's go there together."}, {"time": 926, "text": "It's like Alice in Wonderland and we'll go there together."}, {"time": 928, "text": "You do a good Rick Rubin, minus the beard."}, {"time": 931, "text": "Minus the beard."}, {"time": 932, "text": "His beard is epic, right?"}, {"time": 933, "text": "You can't fake a beard like that, you know."}, {"time": 935, "text": "How'd you guys meet?"}, {"time": 937, "text": "Yeah, well, Rick, I'm very blessed to consider a close friend."}, {"time": 942, "text": "Rick and I got introduced through a common friend during the pandemic."}, {"time": 947, "text": "And we started doing some FaceTime together and just talking about things related to science and health."}, {"time": 952, "text": "And I'm not a musician, I have no musical ability or talent."}, {"time": 956, "text": "I have a good ability to memorize lyrics and I love lyrics and I love poetry."}, {"time": 960, "text": "So I asked him a lot of questions about musicians that I happen to love that he's worked with and knows."}, {"time": 965, "text": "And so he would give me stories about musicians and I would talk to him about health."}, {"time": 970, "text": "And then eventually we formed a friendship where we would talk about any number of different topics in life."}, {"time": 975, "text": "And then we started spending time together in person when he was in town or nearby."}, {"time": 981, "text": "And as you now know, you know, Rick, in addition to all his incredible accomplishments, has an incredible understanding of how to get the brain and body into state, right?"}, {"time": 996, "text": "And as you pointed out, he's willing to do the things that allow him to help these incredible artists get into the best state to do their craft."}, {"time": 1006, "text": "And so if he needs to sit there and be quiet with his eyes closed for a minute or two or more, he'll do that."}, {"time": 1014, "text": "He has routines to allow himself to get into state."}, {"time": 1017, "text": "And it's really inspired me to think about states of mind as something that, you know, we'd all love to just flip the switch and say, we're focused or we're creative, but to actually ratchet through the challenging steps in order to do that and to figure out what one needs to do on a regular basis to get into a proper state."}, {"time": 1036, "text": "It's not just gonna come from a cup of coffee, you know, a lamp of a particular wavelength or something."}, {"time": 1042, "text": "It's gonna be those things, but it's also going to be really teaching oneself how to get into proper state."}, {"time": 1048, "text": "Yeah, you did an episode on hypnosis."}, {"time": 1050, "text": "Do you think it's a kind of self hypnosis?"}, {"time": 1053, "text": "Because hypnosis is a, you limit the context, you're very alert and you're very calm."}, {"time": 1061, "text": "And he has a number of these different practices."}, {"time": 1064, "text": "And so we would talk about those."}, {"time": 1065, "text": "And then we also have enjoyed a lot of discussions about deep neuroscience."}, {"time": 1070, "text": "In fact, I introduced Rick to a friend of mine who's a neurosurgeon and neuroscientist and they've become friendly."}, {"time": 1076, "text": "You know, Rick is one of these people that he sort of defies definition, incredibly kind, incredibly private person too."}, {"time": 1082, "text": "So, you know, I'm being respectful of that."}, {"time": 1084, "text": "But, and then of course he's a fan of your podcast."}, {"time": 1087, "text": "And so when I learned that, I just made natural sense to introduce you."}, {"time": 1091, "text": "And I know he really enjoyed meeting you."}, {"time": 1093, "text": "And we talk about you a lot."}, {"time": 1095, "text": "And of course, in a positive light, you know, I think his dedication to getting into these states of mind and his willingness to do that has completely transformed my routines around life."}, {"time": 1106, "text": "Like for instance, before doing a very long podcast recording, the solo ones, which often take me several hours or more, six hours to record, sometimes more, sometimes less."}, {"time": 1115, "text": "I realized that there's a certain brain state associated with that."}, {"time": 1118, "text": "So I have to really limit the kind of interactions I have for the two hours before."}, {"time": 1122, "text": "I actually walk and talk out loud through my neighborhood."}, {"time": 1125, "text": "People think I'm crazy, but I live in a neighborhood where there are a lot of crazy creatives anyway."}, {"time": 1131, "text": "Are you saying you're not crazy?"}, {"time": 1132, "text": "Well, at least not institutionally defined as crazy yet."}, {"time": 1137, "text": "But, you know, getting into state of mind is something that we'd all just imagine we flip the switch, but Rick really convinced me, you have to do the work to do the work."}, {"time": 1146, "text": "Can you maybe linger on that, elucidate a little bit more of your process of how you get in that space?"}, {"time": 1154, "text": "Cause I have to admit, I do everything last minute before a podcast."}, {"time": 1161, "text": "Like there's a lot of anxiety because like whatever, if I have to pack, if I have to set up stuff, you were luckily a few minutes, you showed up a few minutes later."}, {"time": 1170, "text": "Which for an academic is right on time."}, {"time": 1172, "text": "Right on time."}, {"time": 1173, "text": "But the stress is immense."}, {"time": 1176, "text": "And on top of that, you look at like a situation with Rick Rubin, is I had to set up microphones in front of him and just that stress, the anxiety."}, {"time": 1187, "text": "He knows a lot about microphones."}, {"time": 1189, "text": "Which I really loved."}, {"time": 1190, "text": "He's like, how close do you like the microphone to be?"}, {"time": 1196, "text": "That's a very Rick Rubin kind of thing, right?"}, {"time": 1199, "text": "That the details really matter."}, {"time": 1201, "text": "The details really matter, right down to your relationship to the microphone, right?"}, {"time": 1207, "text": "Distance and whether or not it brings out the timbre in your voice."}, {"time": 1210, "text": "But of course that's what he does."}, {"time": 1211, "text": "He produces music."}, {"time": 1212, "text": "But he also said like, you know, he is the professional."}, {"time": 1215, "text": "He said, how close do you like it to be?"}, {"time": 1220, "text": "And he said it with a gentleness where I had like an existential crisis."}, {"time": 1224, "text": "Where I don't, I don't know."}, {"time": 1227, "text": "He gave me so much like, wow."}, {"time": 1230, "text": "Like he made me feel like an artist."}, {"time": 1231, "text": "Like that the microphone distance is a decision you're supposed to make."}, {"time": 1237, "text": "Well, I have to say, and this has actually come up in some of our conversations about you."}, {"time": 1241, "text": "I mean, you are, you are an artist."}, {"time": 1242, "text": "And actually Joe Rogan, once I heard him talking about podcasting and the fact that he's always trying to get better at it, you know, and he described podcasting at one moment as an art, right?"}, {"time": 1252, "text": "And it is, it's a certain medium of communication and there's a cadence and a rhythm that when it's working, it really can facilitate the transfer of information."}, {"time": 1261, "text": "When it's not, it doesn't."}, {"time": 1263, "text": "I mean, obviously Joe just being himself has tapped into that cadence that allows and it's made so many people excited to hear him talk."}, {"time": 1271, "text": "Well, in his case and in general, I think part of the art is refusing the world as you get a bigger audience, change who you are."}, {"time": 1281, "text": "There's one quote that I've seen out there where he says, you know, I'm like the, talking about himself, he says, you know, I'm like the fish that got through the net."}, {"time": 1287, "text": "There's no stage version of me, right?"}, {"time": 1289, "text": "How he is in person is how he is, you know, out in the world."}, {"time": 1294, "text": "And of course there's nuance to his life, right?"}, {"time": 1296, "text": "And his different relationships, of course, but it's true."}, {"time": 1300, "text": "I mean, we've had the, you know, the great fortune of spending time with him out away from the microphones, so to speak."}, {"time": 1306, "text": "Joe is Joe."}, {"time": 1308, "text": "So can you speak to your, that process you mentioned, the walking and the talking to yourself?"}, {"time": 1312, "text": "Cause that's fascinating."}, {"time": 1313, "text": "Yeah, I try and do a couple of things."}, {"time": 1317, "text": "First of all, when I was a kid, I had a little bit of a grunting tick."}, {"time": 1321, "text": "When I was five or six, I would feel this buildup of tension in my throat and I would do this grunting tick."}, {"time": 1327, "text": "If I get very tired, I start to do it still."}, {"time": 1330, "text": "We actually know that this is related to these basal ganglia circuits for go, no go."}, {"time": 1334, "text": "You've got an accelerator and a brake basically in your neural circuitry and kids with Tourette's and OCD, the brake doesn't work quite as well."}, {"time": 1343, "text": "And so one thing that happens is if I wake up in the morning and especially if I'm well rested, well, if I'm not well rested, I do a hypnosis or yoga nidra in order to recover my sleep."}, {"time": 1353, "text": "But then once I'm into the process of preparing the podcast, I've already gone through my notes."}, {"time": 1357, "text": "I know what I want to say more or less in a kind of general contour."}, {"time": 1360, "text": "And then I take a walk and I try to, so no phone with me."}, {"time": 1365, "text": "And I try to assess whether or not my energy is too high or too low for podcasting."}, {"time": 1372, "text": "Because when you podcast, as you know, you have to punch out a lot of material, but then there's times when you really need to slow down and emphasize and articulate."}, {"time": 1379, "text": "And so what I do, I've never revealed this."}, {"time": 1384, "text": "What I do actually is I will recite the lyrics of songs for about 10 minutes, songs I love while I walk out loud."}, {"time": 1392, "text": "It calms you and focuses you, what does it do for you?"}, {"time": 1394, "text": "I think it gets my vocal cords warmed up and it also."}, {"time": 1399, "text": "Do you sing or speak them?"}, {"time": 1401, "text": "I often sing them and fortunately nobody hears."}, {"time": 1405, "text": "And as I do this, I start to evaluate whether or not I'm straining to get the words out or whether or not I'm straining to make them slow enough so that I can articulate them."}, {"time": 1417, "text": "So there are days when I have so much energy that I'm trying to speak faster than I should in order to articulate properly."}, {"time": 1426, "text": "There are other days when I'm tired and I can't sort of keep up with my thoughts."}, {"time": 1429, "text": "And so what I try and do is assess that and then adjust the transmission, the RPM, so to speak."}, {"time": 1435, "text": "For instance, I can speak very quickly and then I can slow down."}, {"time": 1437, "text": "So I can change the cadence of my voice."}, {"time": 1439, "text": "And when you teach in the classroom, you learn as you know, cause you're an excellent teacher, I've watched your lectures in the classroom."}, {"time": 1445, "text": "As you teach in the classroom, when you want to slow down, every teacher knows you turn to the whiteboard or chalkboard and you start writing, right?"}, {"time": 1453, "text": "It gives you a break."}, {"time": 1454, "text": "And then you turn around and you fire back the kind of machine gun fire of information."}, {"time": 1459, "text": "And then you slow down or you underline something."}, {"time": 1460, "text": "When you podcast, you don't have that opportunity, right?"}, {"time": 1464, "text": "There are no visuals in my podcast."}, {"time": 1466, "text": "So what I try and do is always get my voice warmed up and make sure that I'm thinking and speaking at approximately the same rate."}, {"time": 1476, "text": "And then I also do this thing of as I put my vision into panoramic vision when I walk, which is very calming."}, {"time": 1482, "text": "And then I actually start to remind myself of the purpose of podcasting."}, {"time": 1487, "text": "This sounds very mission statementy, but you asked what I do."}, {"time": 1491, "text": "I remind myself first and foremost that what I want to communicate, what I want to come through is the beauty and utility of biology."}, {"time": 1500, "text": "And I only feel comfortable saying the word beauty publicly now about science things thanks to you, because I think."}, {"time": 1507, "text": "Love and beauty."}, {"time": 1509, "text": "Yeah, love and beauty."}, {"time": 1510, "text": "Dr. Andrew Huberman."}, {"time": 1511, "text": "Love and beauty, but also darkness and hatred."}, {"time": 1514, "text": "And if you're talking about the Lex Friedman podcast, you have to adjust, you have to address the shadow also, the shadow side."}, {"time": 1521, "text": "But I think about the, I want to communicate the beauty and utility of biology."}, {"time": 1526, "text": "And then I check my emotional state."}, {"time": 1529, "text": "I want to make sure that I'm not angry about anything."}, {"time": 1533, "text": "And certainly if I am that I'm going to set it aside for the podcast, because that's not a place for my, whatever I might be dealing with."}, {"time": 1540, "text": "I also really start to feel into the parts of the research and the papers I found that I really love, because that's the part of me that I like the most frankly."}, {"time": 1552, "text": "And on the podcast, if there's a paper, like for instance, we have a paper, excuse me, a podcast coming out soon about heat as a tool, sauna, but some other things."}, {"time": 1562, "text": "And in researching this, I learned so much about these heat shock proteins and the use of sauna in Finland for increasing growth hormone, but also for the treatment of mental illness."}, {"time": 1572, "text": "And I realized I fell in love with this literature."}, {"time": 1575, "text": "It's just a beautiful literature."}, {"time": 1577, "text": "These people are true pioneers for doing this work."}, {"time": 1579, "text": "Now everyone's in the sauna, but this was 20 years ago."}, {"time": 1581, "text": "The way the experiments were done were amazing with all these Finnish people with thermocouples up there, rectum to measure temperature, swimming in pools."}, {"time": 1589, "text": "It's hilarious and great."}, {"time": 1590, "text": "And so I start to think about, and I think, I just start to really access my love of the work."}, {"time": 1596, "text": "And then when we finally sit down, meaning my producer Rob and I and record, I just sort of want to just bask in sharing it."}, {"time": 1606, "text": "Just like the little version of me when I was six or seven, I used to spend all weekend reading the encyclopedia, Guinness Book of World Records, making my mother drive me places to introduce me to, I had this obsession with trapping animals when I was a kid, meet these people."}, {"time": 1618, "text": "And then on Monday, I would insist on giving a lecture in class, which as a little kid."}, {"time": 1624, "text": "I just try and access that childlike energy."}, {"time": 1627, "text": "And so I want to be clear."}, {"time": 1629, "text": "The goal is always to make the information interesting, clear and actionable."}, {"time": 1635, "text": "And if it's also surprising, then that's a bonus."}, {"time": 1638, "text": "But that's basically the process."}, {"time": 1639, "text": "But yeah, I'm singing and talking and getting into state."}, {"time": 1644, "text": "And I used to feel very sheepish about sharing any of this."}, {"time": 1647, "text": "This is the first time I've ever shared it out loud, but Rick was the one who encouraged me to find a process that works and continue to develop that process and not let anything get near that process."}, {"time": 1659, "text": "People in my personal life know this."}, {"time": 1661, "text": "And when it's time, it's like, I don't care what else is going on, I'm moving into that brain state."}, {"time": 1667, "text": "And there's probably a process like that for anything that you do in life that you take seriously."}, {"time": 1671, "text": "So the people that have perfected this is athletes."}, {"time": 1675, "text": "Like if Olympic level athletes, they have to have a process like this."}, {"time": 1678, "text": "You know what, I think Tiger Woods actually was taught self hypnosis quite young and use self hypnosis often during his tournaments, sometimes to great success and other times less so."}, {"time": 1691, "text": "Is there other places in life that you use kind of a protocol, like a mental protocol to get ready?"}, {"time": 1700, "text": "Many of the best areas of life are their own form of hypnosis, right?"}, {"time": 1706, "text": "You know that you're in hypnosis, if for instance, you're in a movie and something happens and you feel the emotional lift without being self conscious about it."}, {"time": 1712, "text": "Yes, I think that one thing that we've tried to do in our house is around meal times to try and set a state that food isn't just something that we just throw down our throats."}, {"time": 1726, "text": "And I'm fortunate that my partner cooks really well."}, {"time": 1729, "text": "And so I try and give her the space to do that."}, {"time": 1732, "text": "And that's the whole thing of her getting into state."}, {"time": 1736, "text": "For the cooking."}, {"time": 1737, "text": "The preparation of all the."}, {"time": 1738, "text": "I can just see it."}, {"time": 1739, "text": "I just see the way she approaches the whole thing and the pleasure in serving it."}, {"time": 1743, "text": "And I'm an eater, not a cooker."}, {"time": 1746, "text": "Both are important roles."}, {"time": 1748, "text": "You could be a very good eater."}, {"time": 1749, "text": "Like there's something about, is there anything better in this world than that feeling?"}, {"time": 1754, "text": "Especially if it's a family, getting around a table."}, {"time": 1758, "text": "Just the warmth of that."}, {"time": 1761, "text": "It's like the cold outside of the cruel world cannot touch you in this place that you've returned to."}, {"time": 1769, "text": "And if."}, {"time": 1772, "text": "Did you grow up eating meals as a family?"}, {"time": 1776, "text": "No television?"}, {"time": 1778, "text": "I didn't really have television period outside of meals."}, {"time": 1784, "text": "So most of my time was spent, you know, like a stray cat outdoors, just running around, playing soccer."}, {"time": 1793, "text": "I imagine you in this like dirt or concrete lot between two very high rise buildings playing soccer in like athletic gear that you only see in Eastern Europe."}, {"time": 1804, "text": "You know how like you come to the States and people wear their athletic gear."}, {"time": 1807, "text": "You go to Europe and you see, maybe it's the soccer culture, but you see athletic gear that you just don't see anywhere else."}, {"time": 1815, "text": "I mean, I grew up pretty poor."}, {"time": 1817, "text": "So first of all, I was always wearing my brother's, who's an older brother, brother's clothes."}, {"time": 1823, "text": "And they were like old, like my favorite things were American things that I didn't understand."}, {"time": 1831, "text": "It would be like a Pepsi shirt or something."}, {"time": 1834, "text": "And it was just, that was the gear."}, {"time": 1836, "text": "And it was like too large for me, but I thought I was the coolest person ever just wearing this fancy like Kanye like type of fashion."}, {"time": 1844, "text": "Yeah, there's something about, I feel like in Eastern Europe, they wear athletic gear where like the guys like zip up."}, {"time": 1850, "text": "Yeah, no, that's like fancy stuff."}, {"time": 1852, "text": "That's if you like, those are the cool kids."}, {"time": 1855, "text": "Like the cool soccer players, football players that like they were in a league of some kind."}, {"time": 1862, "text": "So they would get uniforms or like, or they somehow, I always thought anyone who had anything nice had to do something really bad to get it."}, {"time": 1873, "text": "That was my way, view of the world."}, {"time": 1875, "text": "Because like, I guess I didn't understand how it's possible to be rich."}, {"time": 1882, "text": "Cause most of us were surrounded by people who are poor and that life is beautiful and simple."}, {"time": 1886, "text": "And it's like, why do you escape that life?"}, {"time": 1888, "text": "But you still admire the cool, like when we got McDonald's, it was like, what kind of world does this place come from?"}, {"time": 1899, "text": "Like who invented this?"}, {"time": 1902, "text": "This is a fascinating view from a child's perspective of like, of capitalism essentially."}, {"time": 1907, "text": "Yeah, but the fact that you ate dinner together is really interesting."}, {"time": 1911, "text": "My parents divorced when I was an adolescent."}, {"time": 1913, "text": "So then there was a total fracture of any family structure."}, {"time": 1916, "text": "But prior to that, we ate dinner together every night."}, {"time": 1918, "text": "I was expected to know how to use my knife and fork."}, {"time": 1920, "text": "And it was like a very structured thing."}, {"time": 1925, "text": "I don't know if kids do that now."}, {"time": 1929, "text": "If I ever have kids, they're gonna do that."}, {"time": 1931, "text": "And certainly, actually on the way over here, I was thinking, I was like, I really want a lot of kids."}, {"time": 1936, "text": "I want like a whole litter."}, {"time": 1938, "text": "And I was thinking, if Lex has kids and I have kids, then we can like pit them against each other with jujitsu."}, {"time": 1945, "text": "This is my chance at redemption."}, {"time": 1948, "text": "It's the law game."}, {"time": 1950, "text": "They'll all wanna be engineers or physicists."}, {"time": 1953, "text": "They won't wanna be biologists."}, {"time": 1955, "text": "But in all seriousness, I look forward to the day that our kids play together."}, {"time": 1961, "text": "Yeah, I think there's something, so the family dinner, the ritual of the family dinner, but also the special occasion dinners, like where there's a little bit more preparation, a little bit more cooking, whether it's on the weekend or for some holiday."}, {"time": 1977, "text": "In Russia, it was a thing that actually I find completely missing for the most part."}, {"time": 1982, "text": "In America is there was neighbors."}, {"time": 1984, "text": "There was a, you broke the walls between families much more commonly."}, {"time": 1991, "text": "Like there would be kinda regular characters, like a sitcom almost."}, {"time": 1995, "text": "If you watch the sitcom, it's never just the family."}, {"time": 1997, "text": "There's always like other characters that."}, {"time": 1999, "text": "Just bursting in the door."}, {"time": 2000, "text": "Bursting in the door."}, {"time": 2000, "text": "I'm gonna start doing that here, just to make you feel at home."}, {"time": 2002, "text": "Just start showing up at your studio."}, {"time": 2004, "text": "I know where you live."}, {"time": 2005, "text": "I think people wanna respect, like Michael Malice lives next door to me."}, {"time": 2010, "text": "And I think people wanna respect each other's privacy or something like that."}, {"time": 2014, "text": "And I think we all get super busy."}, {"time": 2017, "text": "And it's kind of work to do this dinner together."}, {"time": 2026, "text": "Or if you see it as a thing that needs to be scheduled, it's work."}, {"time": 2030, "text": "We get busy."}, {"time": 2031, "text": "There's a lot of stuff going on."}, {"time": 2032, "text": "But if it's part of a ritual, a part of the culture, all of those walls get broken down."}, {"time": 2038, "text": "And then you realize like that's, like later looking back, those are the things you miss."}, {"time": 2043, "text": "Like that's what life is about."}, {"time": 2044, "text": "Like all the stupid stuff you're doing in terms of career or whatever, all the busy things, those don't matter."}, {"time": 2050, "text": "What matters is the people."}, {"time": 2052, "text": "In academia, this changed in the last few years, of course."}, {"time": 2057, "text": "But one of the great joys was professors will stop by your office or your lab."}, {"time": 2061, "text": "Nobody set up an appointment."}, {"time": 2063, "text": "There was a guy when I was a professor in San Diego, a guy named Harvey Cartney, he's a member of the National Academies, truly the world's expert in the evolution of vision and evolution of brains generally."}, {"time": 2073, "text": "And he would show up in my lab and he would just start talking to the students in postdocs."}, {"time": 2077, "text": "And I mean, a pure encyclopedia."}, {"time": 2082, "text": "And then at some point you'd say, hey, Harvey, I gotta go."}, {"time": 2085, "text": "And you'd have, you'd kick him out, right?"}, {"time": 2086, "text": "Or this guy, he's a physicist, David Klinefield, who's, same way."}, {"time": 2090, "text": "Actually, David Klinefield is an interesting one."}, {"time": 2093, "text": "A student of his went on to create the Beavis and Butthead cartoon."}, {"time": 2097, "text": "And one of them is David, he's a physics professor."}, {"time": 2099, "text": "Now people can look him up."}, {"time": 2101, "text": "And David's one of those guys who just walk into your office and you just sit down and you just start talking to you."}, {"time": 2105, "text": "And so there's a kind of a family field."}, {"time": 2107, "text": "It's like Cheers or Seinfeld or one of those shows where somebody just walks in."}, {"time": 2110, "text": "And yeah, I think you and I both share a love of the community around things."}, {"time": 2114, "text": "And podcasting is a little bit more isolated."}, {"time": 2117, "text": "I should say for the guest episodes, the preparation is completely different because it's more conversational."}, {"time": 2122, "text": "And so there, I don't do any of this business of putting myself into state."}, {"time": 2126, "text": "I just try and make sure that the guest is taken care of."}, {"time": 2130, "text": "And I do list out the questions I'm gonna ask before, but those actually really like the interview episodes far more than I like doing the solo ones."}, {"time": 2137, "text": "Just psychologically I mean."}, {"time": 2139, "text": "I just like learning from someone directly because you asking an expert about something, like sitting here with you when we recorded the podcast where you were a guest on the Huberman Lab podcast."}, {"time": 2148, "text": "And for the first time, and finally, someone was explaining to me the difference between machine learning, artificial intelligence and all these other things."}, {"time": 2156, "text": "You know, and I've finally forgiven you for making me cry about Costello on camera, because it helped me move through it."}, {"time": 2163, "text": "But in all seriousness, the interview ones are a sheer pleasure."}, {"time": 2168, "text": "The solo ones I really enjoy, but they're work."}, {"time": 2172, "text": "Sometimes I think like I'm gonna sweat a little blood prepping for them."}, {"time": 2176, "text": "Well, it's interesting because I do think prepping for interviews, having a similar process might be also very valuable."}, {"time": 2183, "text": "Like I have to think about that because I think when you do a conversation for several hours, especially when it's a high stakes one."}, {"time": 2195, "text": "So it's not like you and I know, it's more like it's just chatting and so on."}, {"time": 2198, "text": "The world order isn't gonna shift according to it."}, {"time": 2200, "text": "Although you never know, knowing you will probably be into some pretty controversial topics in a few minutes."}, {"time": 2206, "text": "You like to ride the edge more than I do."}, {"time": 2208, "text": "There are a number of topics that I just completely avoid."}, {"time": 2210, "text": "And my response to those is always that I have a lot of opinions about that, but not a lot to say, you know."}, {"time": 2215, "text": "But whereas you've become far braver in terms of the topics you'll encounter and some of your guests have been a bit controversial."}, {"time": 2226, "text": "Some of them are people that a lot of people don't like."}, {"time": 2231, "text": "And you've been willing to just sit down and maybe it's the jujitsu thing."}, {"time": 2236, "text": "I don't know, it is tricky."}, {"time": 2238, "text": "One of my goals for this year is to talk to people that a lot of people really don't like."}, {"time": 2244, "text": "Are you gonna share with us?"}, {"time": 2246, "text": "And here I am."}, {"time": 2247, "text": "People that are in prison, major political leaders have been thinking a lot about how to talk to really difficult, controversial figures, but find together something with them that's deeply honest about their nature, about the ideas they have about the world."}, {"time": 2274, "text": "Reveal something real."}, {"time": 2276, "text": "And some people, you have to be very careful, some people are very good at hiding the real inside them, even from themselves."}, {"time": 2285, "text": "That's something I think about a lot."}, {"time": 2286, "text": "I think about dictators of the past and I put myself in the mindset, well, how do you reveal something real about this person to themselves?"}, {"time": 2294, "text": "I think that to me, and you kind of spoke to that, but a great conversation is one where both of you discover something new."}, {"time": 2308, "text": "So I love that too, that's my favorite thing what you mentioned, which is allowing your curiosity and ask all kinds of questions and get excited and to learn from an expert."}, {"time": 2317, "text": "But also to push them to discover something about themselves, about their ideas together."}, {"time": 2324, "text": "And then that discovery, and sometimes it's like, we don't see it in the moment, but the audience hears it."}, {"time": 2335, "text": "It's weird to say, I would compare it to when you're a musician and you're playing with other musicians, you lose yourself in the moment."}, {"time": 2342, "text": "Yeah, it's all, it's like, it's working right."}, {"time": 2344, "text": "It's working, but you don't really see the big picture impact of what it's working right actually feels like."}, {"time": 2353, "text": "And that's where the audience could see that."}, {"time": 2357, "text": "If you talk to somebody evil, for me as an interviewer, I have to empathize with that person."}, {"time": 2367, "text": "If I want to understand, I have to put myself in that mind space, and to put yourself in that mindset, you really have to understand the evil inside of you."}, {"time": 2378, "text": "Like you can't just think if somebody's in power and has used that power to abuse others, you can't just be a, I personally, a person who seeks to understand."}, {"time": 2389, "text": "You can't just be a journalist asking generic questions."}, {"time": 2392, "text": "You have to put yourself in a place where you're somebody who's given a lot of power and slowly you start to abuse that power."}, {"time": 2401, "text": "And what does that person become?"}, {"time": 2403, "text": "Who are you?"}, {"time": 2404, "text": "I have to plug myself into those moments in my life in the past where I've been angry at something and where I've been cruel because I was angry."}, {"time": 2414, "text": "In little ways, but then you magnify them at scale and I have to go there and that's very human."}, {"time": 2421, "text": "And then I have to look at another person from across the table for me and understand, well, you're there too."}, {"time": 2426, "text": "And then you had more opportunity to do truly cruel things."}, {"time": 2431, "text": "And then where, like I have to plug myself into places where I've been, I can imagine I can go, where I was cruel to others and was unaware of it."}, {"time": 2443, "text": "So I was in a mind space where I was thinking that I'm doing good and I was doing not good."}, {"time": 2448, "text": "Again, I've never gotten the opportunity to do any of those things at large scale, but all of us have done it at a small scale."}, {"time": 2454, "text": "And I plug myself into that and then we're here, we're to, if it's somebody who's in prison, if it's somebody who's a dictator, we're in that space where evil is, all of us have the capacity to do that evil and I have to imagine myself being able to do that evil."}, {"time": 2473, "text": "And then we're here together in that dark, dark place."}, {"time": 2477, "text": "And then if it's just right, something real can actually come, something from that person's childhood, maybe awakening to a realization that I thought it was a good person and I'm not."}, {"time": 2490, "text": "And that only happens when you truly empathize."}, {"time": 2494, "text": "Those moments of discovery are beautiful, but they also happen in science."}, {"time": 2498, "text": "When you just have a conversation and you realize, I feel like talking to Stephen Wolfram, I feel like we constantly realize beautiful things together."}, {"time": 2508, "text": "On this element of evil and sociopathy, that Jung had this notion that we have all things inside us and that we all have the capacity to be good or evil, et cetera, but I have the good fortune of working with somebody who has deep understanding of psychiatry, but also psychoanalysis and Jungian theory."}, {"time": 2531, "text": "And he said to me recently, he said, whether or not all people have all things inside them is still debated in the psychology community and in the neuroscience community."}, {"time": 2542, "text": "And as a matter of philosophy, but there are certain people, not many, but there are certain people for whom they've actually lived out many versions of their possible selves in the first person."}, {"time": 2557, "text": "And so those are unique individuals."}, {"time": 2558, "text": "Then even if they tapped into these things, as you mentioned, at a more minor level, as opposed to impacting people negatively at scale."}, {"time": 2569, "text": "So being able to access those different parts of oneself is key and you've been willing to step into that."}, {"time": 2574, "text": "My podcast is not one in which we get down to those matters."}, {"time": 2577, "text": "Yet, yet."}, {"time": 2579, "text": "You never know, we might do an episode on narcissism and sociopathy."}, {"time": 2582, "text": "The other thing that I took away from a conversation with a friend, he was a lot of years in special operations in the intelligence community."}, {"time": 2589, "text": "He said, if you look at somebody's past, at some point you will come to understand some pretty good reasons as to why they became who they are, but you have to draw the, his words, the red line someplace."}, {"time": 2603, "text": "And what he was referring to was the fact that certain people, at least in the eyes of certain communities deserve to be eliminated as a consequence of their actions, right?"}, {"time": 2613, "text": "Regardless of what drove them to those actions."}, {"time": 2615, "text": "So it gets right down to the line between nature, nurture, neuroscience, and the law and justice."}, {"time": 2623, "text": "Complicated, complicated themes."}, {"time": 2625, "text": "I can think of a number of people that I would love to hear you interview."}, {"time": 2629, "text": "And here I'm not revealing the reasons why, but except for the fact that I think you would be uniquely suited to bring out the important components of the conversation that other people have not been able to do, which for instance, Liz Holmes, this is one of the most mysterious and yet disliked people on the planet."}, {"time": 2653, "text": "She's sort of synonymous with deception."}, {"time": 2657, "text": "I don't know if there've been any real interviews of her since the whole thing."}, {"time": 2662, "text": "I haven't followed that case."}, {"time": 2663, "text": "I listened to the book and I followed it a little bit because it was happening in my hometown, right?"}, {"time": 2669, "text": "Theranos was right up the road."}, {"time": 2671, "text": "The building's still there."}, {"time": 2673, "text": "It's some of the most premier real estate in Silicon Valley, but nobody wants it."}, {"time": 2676, "text": "It's sort of like, it's very hard to sell a home where somebody committed suicide or committed a murder, even if it's a beautiful home."}, {"time": 2682, "text": "It sort of feel like the Theranos building is that building."}, {"time": 2686, "text": "So that would be a really interesting interview."}, {"time": 2688, "text": "I would love to hear that interview."}, {"time": 2690, "text": "One of the most interesting dark human beings in science."}, {"time": 2695, "text": "Yeah, and then there'll even be people that say, was it even science, right?"}, {"time": 2699, "text": "It might've all been deception."}, {"time": 2701, "text": "It might've been one part deception, one part goal setting mixed in with, clearly that there were so many factors impacting what happened."}, {"time": 2710, "text": "I think the big difference between Theranos and that story and some of the other stories about Silicon Valley where people promised a lot more than they could deliver is they were promising things that were directly related to health and healthcare."}, {"time": 2723, "text": "People were taking blood tests with the understanding that the data they were getting was important, information about sexually transmitted diseases and other diseases and making real world decisions on the basis of that."}, {"time": 2734, "text": "Whereas if you remember when the iPhone first came out and Steve Jobs was still alive and the phones were dropping calls if you held it in a particular way."}, {"time": 2741, "text": "And his response was a little flip."}, {"time": 2743, "text": "He said, hey folks, it's a phone as if like don't get so worked up."}, {"time": 2747, "text": "But people held them understandably to a very high standard."}, {"time": 2751, "text": "She sort of, it seemed, and I don't know, cause I certainly wasn't there, seemed like she sort of adopted this idea that you could get it wrong a bunch of times before you get it right."}, {"time": 2760, "text": "Except if the allegations are true."}, {"time": 2762, "text": "And I think she was found guilty, I believe, on a number of counts."}, {"time": 2767, "text": "That a number of the things that they were doing were impacting real world decision making."}, {"time": 2771, "text": "So Steve's point about the phone, it's just a phone."}, {"time": 2774, "text": "Well, it depends on the call."}, {"time": 2775, "text": "If you're calling 911, then it's not just a phone, right?"}, {"time": 2779, "text": "But in the case of blood tests and disease, that's serious."}, {"time": 2783, "text": "I think that the Theranos case was super interesting to me because of the number of people from major universities and from government that both trusted her and the number of people who did not trust her and yet either didn't speak up or no one listened to them."}, {"time": 2797, "text": "It was only in the forensic version of it that everyone said, oh yeah, I knew that she was lying, et cetera, et cetera."}, {"time": 2803, "text": "They were lying to multiple people involved in those lies apparently."}, {"time": 2806, "text": "But I have a deep interest in the neuroscience of narcissism, sociopathy, and some of the darker aspects of the mind."}, {"time": 2814, "text": "So yeah, maybe someday."}, {"time": 2815, "text": "Maybe we'll do a podcast together."}, {"time": 2817, "text": "I mean, like in the kind of early 90s version of talk shows where we darken the lights and we do it together, you can use your voice because your voice is much more sinister sounding than mine."}, {"time": 2826, "text": "Good cop, bad cop."}, {"time": 2828, "text": "Well, it'd be interesting from a scientific perspective of somebody who is a sociopath or a psychopath, how to reveal something real about them."}, {"time": 2840, "text": "I think that requires not just, well, I don't know what that requires."}, {"time": 2846, "text": "That requires the same skill that it takes to be a good therapist."}, {"time": 2851, "text": "Right, and some therapists won't work with sociopaths because they don't feel any progress can be made."}, {"time": 2858, "text": "Some therapists will work with sociopaths because for the wealthy ones, they often, they want their money."}, {"time": 2864, "text": "I think most therapists are good and benevolent, but there's some that will do it just the same way lawyers will work with criminals knowing they're criminals, right?"}, {"time": 2873, "text": "Oftentimes because they're criminals."}, {"time": 2875, "text": "There are certain domains of psychiatry that are more tractable than others, right?"}, {"time": 2879, "text": "Borderlines are interesting."}, {"time": 2880, "text": "I should just mention because they have this phenomenon of splitting."}, {"time": 2883, "text": "So in the world of psychology, the idea is that being neurotic is actually the goal."}, {"time": 2889, "text": "The idea that you could be, you know, feel something and then work a lot to overcome it or have some sort of defense mechanism in place, but that's not destructive."}, {"time": 2900, "text": "That's actually a pretty healthy state to be in."}, {"time": 2902, "text": "It's provided it's not destructive."}, {"time": 2905, "text": "Psychotic is truly delusional thinking about reality."}, {"time": 2909, "text": "And the idea is that borderlines split, intermittently split between psychotic and neurotic."}, {"time": 2917, "text": "That's why it was called, there's beautiful work by Melanie Klein that describes this, which I'm just now kind of delving into."}, {"time": 2922, "text": "But, you know, so the borderline is the person who is like, I love you, I love you, I love you, and then truly feels as if they hate you and you become the bad object."}, {"time": 2931, "text": "So borderlines are challenging for psychologists because of the splitting, right?"}, {"time": 2937, "text": "Schizophrenics are challenging because of the detachment from reality."}, {"time": 2942, "text": "And narcissists are challenging because they're often so charming that even the therapists are charmed."}, {"time": 2950, "text": "I believe you mentioned Karl Deisseroth."}, {"time": 2952, "text": "We'll talk about him."}, {"time": 2953, "text": "He was definitely not a narcissist."}, {"time": 2954, "text": "He's one of the more humble people, but he is brilliant."}, {"time": 2956, "text": "Thanks again to you."}, {"time": 2957, "text": "You've connected us."}, {"time": 2959, "text": "I had the pleasure of having a conversation with him."}, {"time": 2962, "text": "You had a conversation with him."}, {"time": 2963, "text": "I really enjoyed it on the podcast."}, {"time": 2965, "text": "You guys come from the same science, from the same place, maybe different journeys, fascinating."}, {"time": 2971, "text": "And levels."}, {"time": 2972, "text": "We were postdocs together."}, {"time": 2973, "text": "Karl is truly the Michael Jordan, the Wayne Gretzky, five children, amazing marriage to it."}, {"time": 2980, "text": "Also an amazing scientist."}, {"time": 2981, "text": "His wife, Michelle Monge, is in our neurology department at Stanford."}, {"time": 2984, "text": "An incredible thinker, writer, very kind person, humble."}, {"time": 2991, "text": "Speaking of getting into state, sorry, Karl, I'm gonna out you on this, but Karl, despite being at the highest levels of science and engineering and a practicing psychiatrist, his office is literally a coat closet with a small table lamp."}, {"time": 3007, "text": "When you meet with Karl, if you manage to meet with him, because he's very hard to get to, you walk in, you sit down as if you're going through some interrogation and some spy novel."}, {"time": 3018, "text": "And he'll ask you, what are you most excited about lately?"}, {"time": 3022, "text": "And I've got 11 minutes or something."}, {"time": 3023, "text": "And that's a meeting with Karl, because he's that busy."}, {"time": 3027, "text": "But he doesn't have the office with the pictures of the kids and the thing and all that."}, {"time": 3030, "text": "All that is kept elsewhere."}, {"time": 3032, "text": "So in order to get, I asked him why he work in this office, right?"}, {"time": 3036, "text": "You work on light and channels of light, things related to light of all things."}, {"time": 3039, "text": "Here you are in this dark room."}, {"time": 3040, "text": "And he said, well, this is what gets me into the state of mind to be able to do what I want to do."}, {"time": 3044, "text": "Very Rick Rubin ish, not at all the same person, but very similar in that he's figured out the physical space he needs in order to get into the optimal state to do the work he needs to do in this lifetime."}, {"time": 3055, "text": "And it's very unusual, right?"}, {"time": 3057, "text": "If I don't have a window, I kind of freak out."}, {"time": 3059, "text": "I can do it here for a while."}, {"time": 3060, "text": "We're in this black cube here, floating in space, of course."}, {"time": 3065, "text": "But I find that amazing that these people that are operating in this super high level are willing to actually deprive themselves of a lot of conditions."}, {"time": 3074, "text": "They're not sitting there with the secretary coming in offering them espresso every five minutes and things that, no, no, no, that's New York Neuroscience."}, {"time": 3081, "text": "The New York Neuroscience Mafia is kind of famous for having all the tickets to the opera and this and that."}, {"time": 3088, "text": "And they enjoy lifestyle a lot."}, {"time": 3090, "text": "The New York Neuroscience Mafia."}, {"time": 3091, "text": "Oh, there is one, there definitely is one."}, {"time": 3095, "text": "People don't know, Andrew Huberman is from the West Coast and now he's just starting wars with the Neuroscience Mafia."}, {"time": 3101, "text": "Well, they do amazing science."}, {"time": 3102, "text": "They think, they love their lifestyle and that's wonderful, but the culture is very different."}, {"time": 3108, "text": "Carl and I think Silicon Valley in general kind of prides itself on this kind of monk like assesism, right?"}, {"time": 3116, "text": "But at the individual scale, be deliberate about controlling the environment."}, {"time": 3119, "text": "I think about that with the conversations too."}, {"time": 3121, "text": "I haven't been deliberate about that either in terms of controlling the space you're in."}, {"time": 3127, "text": "Visually, yes, black curtains, all those kinds of things."}, {"time": 3130, "text": "There is nothing like the Lex Friedman podcast studio."}, {"time": 3134, "text": "First of all, when you do them remotely, I always feel like I'm in a witness relocation program."}, {"time": 3140, "text": "You only get the coordinates at the last moment and you always get the sense that there are people behind the walls that are recording things."}, {"time": 3150, "text": "Well, there's something about creating a feeling."}, {"time": 3152, "text": "I have a sense that there's a robot over there."}, {"time": 3154, "text": "There's several throughout this place."}, {"time": 3156, "text": "And I think part of that, part of creating a feeling would be having the robots constantly moving around and having a mind of their own because that would most closely put guests and other humans that I interact with into a place that's closest to my mind because it's such an engineering mind and one where when things come to life, it's a beautiful place to be."}, {"time": 3188, "text": "And whatever that is, that could be like art, but to me, robots are art."}, {"time": 3192, "text": "And so I'm thinking about that both for me and for guests."}, {"time": 3197, "text": "And I'm also thinking about the difficult guests just to return to, you said, Elizabeth Holmes."}, {"time": 3202, "text": "One person, maybe a couple of things I want to say."}, {"time": 3206, "text": "One person I think I would like to talk to is Ghislaine Maxwell."}, {"time": 3214, "text": "I always get afraid right before you reveal these kinds of things."}, {"time": 3217, "text": "And now I know why I get afraid."}, {"time": 3219, "text": "Yeah, I mean, again, assuming that she did the things that people claim she did, they're despicable, right?"}, {"time": 3225, "text": "I mean, these were underage children, right?"}, {"time": 3228, "text": "There's just no version of the story where she did the things she was accused of doing and is still a quote unquote good person."}, {"time": 3236, "text": "There's just, in my mind, right?"}, {"time": 3239, "text": "And yet I think there is tremendous interest in understanding like what led her to do all that."}, {"time": 3245, "text": "So at least for some people."}, {"time": 3247, "text": "Let me say a couple of things."}, {"time": 3248, "text": "So one is at a high level, let me say that she believes or her current story is that she's the victim."}, {"time": 3258, "text": "Of who?"}, {"time": 3260, "text": "Jeffrey Epstein."}, {"time": 3263, "text": "I think I'll just leave that there as is."}, {"time": 3266, "text": "So these are ideas that you're facing."}, {"time": 3271, "text": "The nature of truth and the nature of the human mind is what it is and this is, imagine folks, if you went into a room with a person that says that, what do you do next?"}, {"time": 3285, "text": "Let me also say that I never or rarely, let me say not say never, I rarely mention names that I'm interested in talking to without having made significant progress in already securing that interview."}, {"time": 3303, "text": "So people sometimes ask me about Vladimir Zelensky and Vladimir Putin."}, {"time": 3309, "text": "I do not bring them up lightly in terms of their being a path to an actual conversation."}, {"time": 3317, "text": "That said, something I regret but I'm not sure I know what to do with it."}, {"time": 3323, "text": "But in the case of all the people I just mentioned, I haven't been preparing for those conversations."}, {"time": 3330, "text": "I only start really preparing seriously when it's confirmed because it's such a heavy burden."}, {"time": 3340, "text": "And one of the things I regret in having mentioned a conversation with Vladimir Putin before the war in Ukraine broke out in the past few years is that I would mention it very loosely, very casually."}, {"time": 3355, "text": "And without having really deeply put myself into a place that I'm ready to talk to him."}, {"time": 3362, "text": "And that's a tricky thing because then the internet, the audience in general, and just me, when I listen back to my dumb self, think, well, why are you speaking so lightly about these topics?"}, {"time": 3377, "text": "Well, I know you've had a longstanding interest in talking to him."}, {"time": 3381, "text": "I think now, well, I don't understand how I would sit down and have a conversation with somebody like that, but that's not in the range of my skill sets."}, {"time": 3396, "text": "Or like maybe not in the range of things that you're drawn to somehow."}, {"time": 3401, "text": "Not so much."}, {"time": 3402, "text": "I mean, I would watch that episode with great interest."}, {"time": 3407, "text": "Well, you did an episode recently with this guy who was a former cyber criminal turned state side, right?"}, {"time": 3413, "text": "I think he works for the government now."}, {"time": 3415, "text": "And there was a segment in there."}, {"time": 3417, "text": "Remind me his name?"}, {"time": 3419, "text": "There was a segment in there where he talked about stealing a lifetime's worth of collected coins from some elderly woman."}, {"time": 3428, "text": "And this was everything she had."}, {"time": 3430, "text": "And then he openly admitted that he felt no remorse, which is the way he described is purely sociopathic."}, {"time": 3438, "text": "And then of course we learned that he grew up in a family where criminal behavior was very common."}, {"time": 3443, "text": "It was kind of embedded into his notions of what typical behaviors were."}, {"time": 3447, "text": "And I found myself somewhat conflicted, but also hung up on this idea that, I mean, he had behaved as a sociopath or in a sociopathic way."}, {"time": 3459, "text": "And it created an internal conflict because he's quite charming guest and his stories are terrific."}, {"time": 3465, "text": "Especially I really enjoyed his discussions about how he would go out and do all these things out of a desire to please his girlfriend."}, {"time": 3476, "text": "So he was in service to other people, despite being sociopathic, he could say he was in service to them as a way to extract."}, {"time": 3481, "text": "Gets very complicated."}, {"time": 3483, "text": "I think is the reason I went into science is that at some level, it's more about facts than it is opinions and judgments."}, {"time": 3490, "text": "And I don't know that I have the ability to suspend judgment away from the kind of top level contours of my initial reaction to like, if it's true, like the Ghislaine Maxwell's and the Liz Holmes and the other sociopaths is one of just kind of revulsion and repulsion."}, {"time": 3508, "text": "But that could also reflect the fact that I'm not as neurologically sophisticated as somebody that can spin all the plates of empathy, forgiveness, but also holding people accountable at the same time."}, {"time": 3525, "text": "That takes, if you think about it, that's three four brain circuits having to work in parallel."}, {"time": 3530, "text": "That's the difference between chess or a game of go and a game of checkers."}, {"time": 3533, "text": "I guess I'm playing checkers and you're playing chess."}, {"time": 3536, "text": "No, so one is actually holding in your mind and two is the raw skill of conversation."}, {"time": 3541, "text": "You're very, just having listened to your interviews, you're very good at conversation, but the skill of conversation is really tricky."}, {"time": 3548, "text": "I'm not being self deprecating."}, {"time": 3550, "text": "I'm being just objective."}, {"time": 3552, "text": "I'm not good at conversation."}, {"time": 3555, "text": "I'm working very hard, getting better at it."}, {"time": 3558, "text": "I'm speaking not about just podcasting."}, {"time": 3562, "text": "I'm speaking just normal life."}, {"time": 3565, "text": "I have anxiety from social interaction."}, {"time": 3570, "text": "I... Do you really?"}, {"time": 3571, "text": "A huge amount, yeah, yeah."}, {"time": 3573, "text": "So this is interesting because I never detect that in you."}, {"time": 3578, "text": "And I think there are people that we both know that have said to me that they too feel anxious and yet your voice is steady."}, {"time": 3589, "text": "I don't see any perspiration."}, {"time": 3592, "text": "You appear incredibly calm."}, {"time": 3594, "text": "I'm scared shitless."}, {"time": 3595, "text": "I was scared shitless with Rick Rubin."}, {"time": 3597, "text": "Rick Rubin is, when you first meet him, is intimidatingly calm."}, {"time": 3603, "text": "But as you get to know him a bit, you realize that the kindness and the generosity that you sense is real."}, {"time": 3611, "text": "But yeah, I would never in a million years have guessed that you get anxious in conversation."}, {"time": 3616, "text": "Can I just make another quick comment?"}, {"time": 3619, "text": "This may come off entertaining to you, Andrew."}, {"time": 3622, "text": "Maybe you've already gotten the same."}, {"time": 3624, "text": "But having mentioned Vladimir Putin, Vladimir Zelensky, Ghislaine Maxwell, there is a natural question."}, {"time": 3637, "text": "How does Lex have access to these people?"}, {"time": 3643, "text": "Who does he work for?"}, {"time": 3645, "text": "Like how does he... Or who works for him."}, {"time": 3649, "text": "Who works for him."}, {"time": 3651, "text": "What does he have on others?"}, {"time": 3652, "text": "This, I'm actually, I ask myself, when I look in the mirror, just somebody who kind of enjoys conspiracy theories, I want to ask the same question."}, {"time": 3663, "text": "Like, well, I usually ask in the following way, like, how the fuck am I so lucky?"}, {"time": 3667, "text": "Like, who am I being, am I a robot being controlled by somebody else?"}, {"time": 3672, "text": "Or like, how is this my life right now?"}, {"time": 3676, "text": "What is happening?"}, {"time": 3677, "text": "It really does feel like a simulation."}, {"time": 3678, "text": "So let me just speak to several things."}, {"time": 3682, "text": "First of all, I have no boss."}, {"time": 3685, "text": "I know of nor am I controlled by any intelligence agencies of any nation."}, {"time": 3692, "text": "We're going to get you a dog, Lex."}, {"time": 3694, "text": "So that I could talk to."}, {"time": 3697, "text": "I'm scared of getting a dog because I would fall in love so deeply, I think."}, {"time": 3701, "text": "Next time I'm bringing a puppy."}, {"time": 3703, "text": "I'm just going to bring a puppy and I'm going to leave it here."}, {"time": 3706, "text": "And then you'll never see me again."}, {"time": 3708, "text": "I mean, I love dogs so much."}, {"time": 3710, "text": "But I was also surprised and maybe, I have never talked to an intelligence agency, which is very interesting to me."}, {"time": 3722, "text": "Like, I haven't."}, {"time": 3723, "text": "That you're aware of."}, {"time": 3725, "text": "Cause they're very good at communicating."}, {"time": 3728, "text": "But I've been very suspicious on this exact point."}, {"time": 3730, "text": "That's the downside of kind of being an introvert, having anxiety about social interaction, but then having so much love thrown your way because we connect over podcasts."}, {"time": 3741, "text": "Podcasts have a powerful way of connecting people."}, {"time": 3744, "text": "So people come with you with love that I really love."}, {"time": 3748, "text": "I appreciate, but I wonder like exactly this question, like why is this person with a Russian accent talking to me and showing me so much love?"}, {"time": 3759, "text": "Well, because, sorry to interrupt you again, but it's what we do."}, {"time": 3764, "text": "And it's a sign of interest, by the way, too."}, {"time": 3767, "text": "Yeah, I have a colleague at Stanford and she said, you know, interruption 75% of the time is a sign of real interest in what the person is saying, if nothing else."}, {"time": 3777, "text": "Well, you're very lovable."}, {"time": 3780, "text": "Well, that, that, but, I mean, I learned about a hedgehog in the fog from you."}, {"time": 3785, "text": "You know, when I learned, you know, you're very lovable."}, {"time": 3787, "text": "People love you because you're lovable."}, {"time": 3789, "text": "I love, love."}, {"time": 3790, "text": "So 100%."}, {"time": 3792, "text": "And it's, I mean, especially here in Austin, Texas, people are so, so amazing."}, {"time": 3797, "text": "I go just hugs and just, ah, I love people."}, {"time": 3799, "text": "Do you want a family?"}, {"time": 3800, "text": "Or are you eventually?"}, {"time": 3802, "text": "I mean, you're, I take what you said as a challenge in terms of having a family with kids and they do jiu jitsu and obviously defeat you and make you miserable for your failures as a father because you couldn't."}, {"time": 3819, "text": "But you're gonna be a great dad."}, {"time": 3820, "text": "Build up an army of good jiu jitsu people."}, {"time": 3823, "text": "But yes, I would love a family."}, {"time": 3824, "text": "I would love to have children."}, {"time": 3827, "text": "But I just want to finish that point because I'm nervous about it."}, {"time": 3830, "text": "I'm nervous about the way people perceive."}, {"time": 3832, "text": "What you're seeing is a Forrest Gump type character."}, {"time": 3834, "text": "Like what, who I am, I seem to be, and this is how like the world seems to work, is you just try, you try to be yourself."}, {"time": 3843, "text": "Like you try to find yourself."}, {"time": 3845, "text": "That's maybe the better way to say it."}, {"time": 3847, "text": "And just be that."}, {"time": 3850, "text": "Be kind to people."}, {"time": 3852, "text": "Work your ass off."}, {"time": 3854, "text": "And say F you to anybody that wants to control you or to tell you what to do."}, {"time": 3861, "text": "Just be free."}, {"time": 3862, "text": "And then put love out there in the world."}, {"time": 3864, "text": "And doors open."}, {"time": 3865, "text": "This karma thing seems to work."}, {"time": 3868, "text": "Like how the hell, my friends as you know, how the hell did I get a chance to eat barbecue with Rick Rubin, right?"}, {"time": 3877, "text": "Like doors."}, {"time": 3878, "text": "You guys had a barbecue?"}, {"time": 3879, "text": "Yeah, I had barbecue."}, {"time": 3880, "text": "He, right, of course I did."}, {"time": 3882, "text": "He's from New York."}, {"time": 3883, "text": "Any New Yorker that I know has very high standards for food because bad restaurants don't last long in New York."}, {"time": 3889, "text": "And barbecue counts as?"}, {"time": 3891, "text": "Oh yeah, Texas barbecue."}, {"time": 3892, "text": "Well, you know, I would also add that you, whether or not you realize it or not, you took tremendous risk."}, {"time": 3899, "text": "I mean, we come from the same original community, which is academic science, right?"}, {"time": 3903, "text": "And to be at MIT and to start posting lectures online is risky, right?"}, {"time": 3909, "text": "To, you know, I was third or fourth man in in terms of podcasting as an academic."}, {"time": 3914, "text": "Cause you had gone on Rogan many times, David Sinclair had gone on there."}, {"time": 3918, "text": "You know, especially before the pandemic, you just didn't see many academics and scientists talking in a public facing way."}, {"time": 3926, "text": "So you took tremendous risk, right?"}, {"time": 3929, "text": "You took tremendous risk always wearing that jacket and tie, right?"}, {"time": 3933, "text": "The only time I haven't seen you in that truly is when we rolled jujitsu, which is, and I hear I'm being generous to myself saying I rolled jujitsu when basically you choked me out in front of hundreds of people."}, {"time": 3941, "text": "It was, it was great fun."}, {"time": 3946, "text": "To have a beginner's mind is a beautiful thing."}, {"time": 3948, "text": "I have admittedly, I have not been taking the classes, but I'm going to, I truly am."}, {"time": 3954, "text": "Especially there's a small chance I might find myself in Austin a bit more often in the near future."}, {"time": 3959, "text": "But the... Well, if you're out in San Francisco, you should train with Mark Zuckerberg."}, {"time": 3962, "text": "He just started, so there you go."}, {"time": 3965, "text": "You guys can..."}, {"time": 3969, "text": "I mean, he's actually, I mean, people listen to an episode, perhaps he's a fascinating human being too."}, {"time": 3974, "text": "I listened to it, it was great."}, {"time": 3975, "text": "You took tremendous risk as an academic to do what you did."}, {"time": 3979, "text": "So I do believe that when one takes intelligent risk, because you can die or can crash your career, you can do all sorts of self destructive or destructive things when taking risks."}, {"time": 3991, "text": "You took risks and they paid off, right?"}, {"time": 3993, "text": "And you take different risks at different stages, but I don't throw around the word admiration lightly."}, {"time": 3998, "text": "I mean, I admire that you were in this classroom at MIT."}, {"time": 4001, "text": "You're like, I'm gonna film this and put it online."}, {"time": 4004, "text": "One of your early interviews is with Ido Portal, who's very hard to get to."}, {"time": 4009, "text": "I've communicated with Ido a few times."}, {"time": 4010, "text": "You should definitely talk to him."}, {"time": 4011, "text": "I can't wait to talk to him."}, {"time": 4013, "text": "I'm dying to talk to him."}, {"time": 4014, "text": "I was supposed to do some course teaching with him right before the pandemic hit, and then it got canceled because he couldn't travel, but getting to him is exceedingly challenging."}, {"time": 4022, "text": "So you do have this incredible ability to get to people and for them to trust you and know you."}, {"time": 4029, "text": "And I think it's through your authenticity."}, {"time": 4032, "text": "And I think it's the fact that you're willing to go places where people haven't been before."}, {"time": 4036, "text": "You know, this is, what's the saying about pioneers?"}, {"time": 4039, "text": "How do you spot the pioneers?"}, {"time": 4040, "text": "They're the people with the arrows in their backs."}, {"time": 4043, "text": "You know, so that's the, you know, yeah."}, {"time": 4046, "text": "And that's actually a quote that I lifted from Terry Siknowski, who's a, you know."}, {"time": 4050, "text": "You should talk to Terry."}, {"time": 4054, "text": "He's a computational neuroscientist down at the Salk Institute, Howard Hughes investigator, et cetera."}, {"time": 4060, "text": "But so, you know, taking risks that other people have not taken is, that's a real thing."}, {"time": 4068, "text": "And to do it with integrity and rigor, that's a real thing."}, {"time": 4073, "text": "And so, yeah, I'm complimenting you and I hope it lands and lands deeply."}, {"time": 4077, "text": "But I also hope that people will hear that and understand that it's one thing to do what other people are already doing boldly."}, {"time": 4086, "text": "It's a whole other thing to launch an entire art form or venue and you did that."}, {"time": 4092, "text": "And you didn't write a book, hopefully you will someday, but you didn't go write a book."}, {"time": 4096, "text": "A lot of academics have written books."}, {"time": 4098, "text": "You went online."}, {"time": 4099, "text": "Jordan Peterson, another controversial character."}, {"time": 4102, "text": "He did it too, all those lectures that he filmed."}, {"time": 4104, "text": "And then it's led to this other thing."}, {"time": 4106, "text": "So, you know, there's karma."}, {"time": 4110, "text": "And then there's also having the spine to just put it all on the line and do something for which there is no prior example to hold onto while you go through those headwinds."}, {"time": 4123, "text": "The really fascinating thing, and actually a lot of people tell me about you, Andrew Huberman, like the reach of a podcast is really fascinating."}, {"time": 4133, "text": "It's not the numbers of people listen."}, {"time": 4136, "text": "I don't know if that's important at all."}, {"time": 4139, "text": "Is what's important is like the depth of connection you have with certain people."}, {"time": 4144, "text": "It really moves them."}, {"time": 4145, "text": "Like a great, and like they really get you."}, {"time": 4148, "text": "So there's a lot of big Andrew Huberman fans that really get you."}, {"time": 4152, "text": "It's not just the science."}, {"time": 4153, "text": "It's the stuff between the lines."}, {"time": 4155, "text": "It's Costello."}, {"time": 4156, "text": "It's the whole picture of a scientist that finds beauty in biology and reveals it."}, {"time": 4162, "text": "And they love you for it."}, {"time": 4163, "text": "You know, because it was on television at the time, I followed that Amanda Knox story pretty carefully."}, {"time": 4171, "text": "And I don't watch television, but whenever I would travel, if there was a TV on the airplane, I would find myself getting wrapped into things like locked up abroad, you know, like, and these things where they would make you terrified to travel anywhere, let alone commit a crime overseas."}, {"time": 4187, "text": "You know, the scenes of some of these prisons are so dramatic."}, {"time": 4190, "text": "And, you know, I mean, her case got a ton of interest."}, {"time": 4192, "text": "And then I, you know, she went and then was a student at the University of Washington and has talked quite openly about, you know, how she was treated and how people assume guilt and, you know, and eventually, you know, she was exonerated and, you know, we can only go by what we know what the law determined, but, you know, these are people that the world is fascinated by."}, {"time": 4213, "text": "I would, I'm guessing about a third of people have already decided this person is despicable."}, {"time": 4218, "text": "Why would you ever give them an audience?"}, {"time": 4220, "text": "About a third of people I think are open to, or at least interested in learning more about them."}, {"time": 4227, "text": "And then I think the remaining third, kind of the third that the category that I put myself in, which is what can I learn about people and myself, even in my revulsion, right?"}, {"time": 4241, "text": "What can I learn?"}, {"time": 4242, "text": "Yeah, what can I learn about myself from listening to this conversation with somebody that I like to think, I'm not talking about Amanda here, I'm talking about the other people that you're talking about that I don't, I can't relate to, right?"}, {"time": 4254, "text": "Hearing conversations with and about people that you cannot relate to is informative."}, {"time": 4259, "text": "Otherwise, your whole mind literally becomes insular."}, {"time": 4294, "text": "What are you willing to die for?"}, {"time": 4296, "text": "Yeah, what are you willing to die for?"}, {"time": 4297, "text": "It sounds very dramatic, but whenever risk goes up, I mean, I don't know, you asked that if you wanna take a trip out to space on a commercial space flight, you have to, are you willing to die for this journey?"}, {"time": 4316, "text": "Now, the odds, they're really small."}, {"time": 4318, "text": "I just watched Apollo 13 again."}, {"time": 4320, "text": "Great movie."}, {"time": 4321, "text": "I'm not going to space."}, {"time": 4325, "text": "Afraid of heights?"}, {"time": 4326, "text": "No, I'm not afraid of heights."}, {"time": 4328, "text": "I just, it feels like a terrible place to die."}, {"time": 4333, "text": "Well, first of all, death anywhere is not great."}, {"time": 4337, "text": "Yeah, although, I have a song teed up in my phone."}, {"time": 4341, "text": "If the plane starts to go down, I'm gonna spend the last few."}, {"time": 4345, "text": "It's a rare song."}, {"time": 4346, "text": "Nobody knows it."}, {"time": 4347, "text": "It's a song off a B track of my favorite band, which is Rancid."}, {"time": 4350, "text": "It's a song called The Sentence."}, {"time": 4352, "text": "And nobody, and I love it."}, {"time": 4354, "text": "And I listen to it almost every day."}, {"time": 4356, "text": "Rancid, The Sentence, it's called The Sentence?"}, {"time": 4358, "text": "The band is called Rancid, famous band, relatively."}, {"time": 4361, "text": "Love those guys, love their music."}, {"time": 4363, "text": "And the song is The Sentence."}, {"time": 4364, "text": "You can only find it on like a B side or outtake."}, {"time": 4366, "text": "And it's, if you don't know how to decipher Tim Armstrong's voice, then you probably won't understand the lyrics."}, {"time": 4372, "text": "But because it's sung very, very fast."}, {"time": 4375, "text": "But if the plane ever goes, anytime there's turbulence, I put that thing in, I put the headphones in."}, {"time": 4379, "text": "I'm like, well, you know, if it's time, it's time."}, {"time": 4381, "text": "I'm gonna go out like this."}, {"time": 4382, "text": "I don't wanna drift off into the galaxy, just slowly asphyxiating and freezing to death."}, {"time": 4386, "text": "That sounds horrible."}, {"time": 4388, "text": "Just like I wouldn't wanna drown or burn."}, {"time": 4389, "text": "But on a plane is okay?"}, {"time": 4390, "text": "Well, on a plane, I mean, like, if the thing starts going down and there's truly nothing you can do, you might as well at least listen to your favorite song."}, {"time": 4397, "text": "Yeah, true, true."}, {"time": 4398, "text": "I'll probably go with The Pixies, Where's My Mind, like from Fight Club."}, {"time": 4401, "text": "And just the calmness, just sit back, like the musicians playing at the Titanic."}, {"time": 4406, "text": "I didn't know you were a Pixies fan."}, {"time": 4407, "text": "I'm gonna have to."}, {"time": 4408, "text": "Not so much a Pixies fan."}, {"time": 4409, "text": "Actually, I should say that I just, that was the, Where's My Mind was the chosen song for Fight Club at the end when the buildings are coming down or something like that."}, {"time": 4421, "text": "So that there's certain songs that just fit just right for the collapse of human civilization and you're calmly appreciating, like, that that's just it."}, {"time": 4435, "text": "This is how absurd this life is at any moment it can end."}, {"time": 4438, "text": "And this is it."}, {"time": 4441, "text": "I love how we both have death and demise soundtracks."}, {"time": 4445, "text": "It's just a question when you're an academic, doesn't come up often."}, {"time": 4450, "text": "Right, well."}, {"time": 4451, "text": "Yeah, there are some academics that are bold and brave."}, {"time": 4455, "text": "It's not a phenotype."}, {"time": 4457, "text": "Being bold and brave in the physical world is not a common phenotype of academics."}, {"time": 4462, "text": "I mean, the great neurologist, one of my, I don't have many heroes, but Oliver Sacks is a true hero."}, {"time": 4467, "text": "I mean, people think of him as a writer, but he was foremost a neurologist and he took tremendous pushback from the neurology community for doing his books and his articles."}, {"time": 4479, "text": "He has a great biography called On the Move."}, {"time": 4480, "text": "There's a wonderful documentary that just came out about him."}, {"time": 4482, "text": "He died in 2015."}, {"time": 4484, "text": "I'm actually kind of a collector of his things, but he, tremendous, but he was accused of horrible things until the movie Awakenings came out with De Niro and Robin Williams."}, {"time": 4498, "text": "Amazing movie, by the way, people don't, they seem to not say great things about the movie."}, {"time": 4504, "text": "And it was only once he became famous from that movie that his more academic work started to receive any kind of attention and he was invited back to Columbia and NYU."}, {"time": 4515, "text": "You know, the New York Neuroscience Mafia is a real thing."}, {"time": 4518, "text": "And yes, you know who you are."}, {"time": 4520, "text": "And some of them are actually coming on the broadcast."}, {"time": 4522, "text": "They are..."}, {"time": 4525, "text": "I think we talked offline about this."}, {"time": 4526, "text": "We should start a mafia to fight off whatever's going on in the East Coast."}, {"time": 4531, "text": "Although I'm still at MIT, so I don't know how that works, but Boston is different than New York."}, {"time": 4536, "text": "Yeah, so I have tremendous respect for science done in New York."}, {"time": 4539, "text": "They are excellent scientists."}, {"time": 4541, "text": "It's just a very different culture than on the West Coast."}, {"time": 4544, "text": "And the personalities, the personalities..."}, {"time": 4546, "text": "Tremendous respect for the mob."}, {"time": 4548, "text": "Well, and the personalities are a bit more grandiose."}, {"time": 4553, "text": "However, because of some of the shift in science culture in the last few years, things around scandals and things of that sort, they've been forced to tamp down some of their personality or at least their outspoken personality."}, {"time": 4569, "text": "And I actually think it's revealed something really important and useful in science, which is it used to be the case you could really inject your personality into what you do."}, {"time": 4579, "text": "Richard Feynman is a good example."}, {"time": 4581, "text": "If he did today what he did then, bongo drumming on the roof of Caltech naked, working out theorems in strip clubs and things of that, he would have lost his job in moments."}, {"time": 4595, "text": "So that kind of behavior isn't celebrated anymore."}, {"time": 4597, "text": "It's actually punished."}, {"time": 4599, "text": "And I'm only half kidding about this New York neuroscience mafia, but because I now exist in multiple realms, I can say these sorts of things."}, {"time": 4605, "text": "And I, again, admiration and respect, but I will say that I think it's important that people in science and kids that are curious about science understand that you can have any personality provided that you're ethical and respectful in science and do well, right?"}, {"time": 4623, "text": "There are true bench scientists that just want to be at the bench."}, {"time": 4627, "text": "There are people that just want to be in their office."}, {"time": 4628, "text": "There are people that really enjoy public speaking."}, {"time": 4631, "text": "And there are people that love meetings and there are people that hate crowds."}, {"time": 4634, "text": "And so there's a place for everybody, truly a place for everybody in science."}, {"time": 4639, "text": "I would like to be able to shine light on the fact that there are, you can have a shy personality, an outgoing personality, and you can, all of those can be, have excellent careers in science, but you have to find the community in place that's right for you."}, {"time": 4654, "text": "One reason I like Stanford is that Stanford is very much about the future."}, {"time": 4659, "text": "We have Nobel prize winners, we have field medal winners and all that stuff, and their names are on walls and we acknowledge their great works."}, {"time": 4666, "text": "But most of what you hear about in the halls of Stanford is about what's happening now and what could happen next."}, {"time": 4672, "text": "It's really about the future."}, {"time": 4673, "text": "Whereas when I've spent time at other institutions not to be named, you hear that, but there's a lot of kind of recycling and regurgitation of how wonderful people are based on things they did previously."}, {"time": 4685, "text": "And the students at Stanford, because of Silicon Valley, sure, they have respect for Nobel prizes, they're delighted to be learning from and surrounded by all these great minds, but they're mostly interested in what they are gonna create."}, {"time": 4697, "text": "And so I kind of, not kind of, I really like the shift toward possibility as opposed to things that are steeped in tradition."}, {"time": 4706, "text": "You know, I've never been to high table dinner at Oxford, I'm sure it's a wonderful experience."}, {"time": 4710, "text": "I'm also not sure what purpose it serves for the world, but I've never been, and so I don't know what the conversations are, and so maybe I'm, you know, speaking out of line here."}, {"time": 4720, "text": "And then now I'm definitely not getting invited."}, {"time": 4723, "text": "No, you're definitely getting invited."}, {"time": 4724, "text": "But yeah, I'm with you, the culture's picked the right ones for you."}, {"time": 4728, "text": "That's why I like MIT, the spirit of it."}, {"time": 4731, "text": "To me, it's not about the past or the future, it's about just tinkering and having fun, building cool stuff."}, {"time": 4739, "text": "Like the big ambitious projects, it's there."}, {"time": 4743, "text": "I mean, it may be more in the biology and the health side, but like the engineering side, it doesn't matter if this has any impact, let us build the coolest thing the world has ever built."}, {"time": 4753, "text": "Well, whenever I'm in Kendall Square, I've seen, they have those buildings there that actually tilt toward the ground."}, {"time": 4760, "text": "These are these, the architecture of MIT is also really impressive."}, {"time": 4764, "text": "Yeah, this, he pulled up, Sergei just pulled up Yilmaz tweet."}, {"time": 4767, "text": "I'm inspired by curiosity."}, {"time": 4768, "text": "That is what drives me."}, {"time": 4770, "text": "So let us expand the scope and scale of consciousness so that we may aspire to understand the universe."}, {"time": 4775, "text": "Those are like three tweets in one, but curiosity, yeah, yeah, curiosity for its own sake."}, {"time": 4783, "text": "I think Dorothy Parker said, the cure for boredom is curiosity."}, {"time": 4788, "text": "There is no cure for curiosity."}, {"time": 4791, "text": "And you need to celebrate."}, {"time": 4792, "text": "So let me just briefly mention to my lovely friends at MIT to celebrate different weirdness, to celebrate the weird characters."}, {"time": 4806, "text": "I've, I sometimes get loving pressure from my lovely friends at MIT to tone down the weirdness a bit."}, {"time": 4819, "text": "Even from MIT?"}, {"time": 4820, "text": "I'm very fortunate to have a lot of leverage to where I have completely resist the pressure, but I'm very sure that there's young faculty that with that subtle pressure would... Dissolve them into a puddle of tears."}, {"time": 4839, "text": "Not, no, no."}, {"time": 4840, "text": "Oh, they're from Boston, excuse me."}, {"time": 4841, "text": "From Boston, that's right."}, {"time": 4842, "text": "They're tougher than that."}, {"time": 4843, "text": "That's right, but it's a slight nudging towards conformity that I think ultimately destroys, or at least lessens the power of the kind of science that you can do when you encourage diversity."}, {"time": 4860, "text": "Diversity in all of its forms, including the weirdness of ideas, the out of the box thinkers, including the flamboyant behavior online, how you choose to educate, how you choose to inspire."}, {"time": 4873, "text": "People talk about freedom of speech, but it's not just freedom of speech to say controversial things."}, {"time": 4880, "text": "It's also freedom of speech to be weird."}, {"time": 4883, "text": "If you're, for some reason, fascinated in... You look at Elon Musk."}, {"time": 4888, "text": "He talks about sex a lot."}, {"time": 4889, "text": "Let the guy put sex memes up."}, {"time": 4893, "text": "I mean, I feel like Elon can do basically whatever he wants."}, {"time": 4896, "text": "Right, there's no pressure, but there's a bunch of Elons in the academic world."}, {"time": 4900, "text": "There's a bunch of Elons."}, {"time": 4902, "text": "No, actually, sorry."}, {"time": 4903, "text": "Let me backtrack, because the man deserves props."}, {"time": 4907, "text": "Right, he's unparalleled."}, {"time": 4908, "text": "He's a CEO of major companies."}, {"time": 4910, "text": "You better believe there's pressure to behave more like a CEO, as opposed to a giggling schoolboy who's posting memes throughout the night."}, {"time": 4920, "text": "But that is him."}, {"time": 4922, "text": "And that freedom, that's what freedom looks like."}, {"time": 4926, "text": "I talk to a lot of CEOs, and a lot of them feel like caged birds who have long ago forgotten how to sing, quite honestly."}, {"time": 4937, "text": "Like, there's like shareholders, and they come up with excuses for themselves."}, {"time": 4942, "text": "Here's why I have to be this way, you have to understand."}, {"time": 4945, "text": "So on, there's PR, there's marketing people, there's lawyers, there's all that kind of stuff."}, {"time": 4950, "text": "But the final result is the authenticity is suffocated."}, {"time": 4955, "text": "The beautiful weirdness of a CEO, of a leader, of a creator, of a scientist, all that, that's all gone."}, {"time": 4965, "text": "Well, Steve Jobs wouldn't have kept his job in acting the way he did in his 20s and 30s in today's climate."}, {"time": 4973, "text": "But he probably would have updated his protocols, so to speak."}, {"time": 4977, "text": "A little bit, but maybe."}, {"time": 4979, "text": "You know, you're screaming at employees."}, {"time": 4981, "text": "I mean, these are anecdotes, right?"}, {"time": 4982, "text": "I call them anecdata, because people treat them as data, but they're really just anecdotes."}, {"time": 4987, "text": "We don't know, I wasn't there."}, {"time": 4989, "text": "But, you know, I like the idea of authenticity without oversharing, right?"}, {"time": 4996, "text": "You're very authentic, but there are aspects to your life that I'm aware of that your audiences will never be aware of, and there are aspects of your life that I'll never be aware of."}, {"time": 5004, "text": "And so you're still authentic, but."}, {"time": 5006, "text": "Yeah, wait, which ones are you aware of?"}, {"time": 5009, "text": "People are gonna wonder, like, what is, is he up in sex dungeon?"}, {"time": 5015, "text": "But interesting choice of examples."}, {"time": 5019, "text": "No, but I think that, you know, people lose the careers on the basis of the movement of their thumbs, right?"}, {"time": 5027, "text": "I mean, the chair of psychiatry at Columbia recently lost his position based on a response to a tweet."}, {"time": 5035, "text": "People can look that up."}, {"time": 5036, "text": "This is one of the most famous psychiatry departments in the world."}, {"time": 5039, "text": "And he put something out there that was very insensitive, frankly."}, {"time": 5043, "text": "And everyone that I talked to about it was like, gosh, that was very, very insensitive, not thoughtful at all."}, {"time": 5050, "text": "And he lost his job, right?"}, {"time": 5051, "text": "Or at least had to step down."}, {"time": 5054, "text": "So, you know, I think I read someplace that more than half of the job loss due to online behavior is because people were trying to be funny, right?"}, {"time": 5065, "text": "I mean, not everyone can pull off what Tim Dillon."}, {"time": 5069, "text": "Oh, and by the way, congratulations."}, {"time": 5070, "text": "I heard that you and Tim just got married."}, {"time": 5072, "text": "Yeah, I saw that too."}, {"time": 5073, "text": "No, no, we didn't just get married."}, {"time": 5074, "text": "Engaged."}, {"time": 5075, "text": "He proposed."}, {"time": 5075, "text": "Yeah, got it, got it, got it."}, {"time": 5078, "text": "So some people can get away."}, {"time": 5082, "text": "Thank you, Sergey."}, {"time": 5082, "text": "Has that ready to go."}, {"time": 5083, "text": "See those 13.3 thousand likes?"}, {"time": 5086, "text": "One of those is mine."}, {"time": 5088, "text": "So for people who are not aware, one of the days in April tweeted that Tim Dillon asked me to get married and I said, yes."}, {"time": 5095, "text": "I think Tim said, the wedding will be on 6th Street in Austin, bring all of your weapons, which of course is totally inappropriate."}, {"time": 5103, "text": "This is, I was like PG funny, and he's goes rated R funny right away."}, {"time": 5112, "text": "But that said, I mean, if there's anyone I would like to get married with, it's that guy and we would do it in Austin and it would be epic."}, {"time": 5124, "text": "It would be like the wedding from November rain, one of the, Mr. and Mrs. Oh, wow."}, {"time": 5133, "text": "Oh, Mr. and Mr., I apologize."}, {"time": 5134, "text": "Wow, yeah, and you broke tradition with the jacket color."}, {"time": 5138, "text": "So it sounds to me that you are a free speech absolutist."}, {"time": 5142, "text": "I think freedom is really important and that includes letting people who are hateful, letting people who are controversial have a voice on platforms."}, {"time": 5153, "text": "But it becomes, I'm not sure what exactly to think because I also treasure the quiet voices in the back of the room."}, {"time": 5165, "text": "And sometimes the assholes silence those voices, meaning by being loud and obnoxious and so on, it pushes away the thoughtful people."}, {"time": 5176, "text": "So I'm also a fan of creating communities."}, {"time": 5179, "text": "Like you should be able to let people kind of build a community that's positive, that's loving, or that's constantly trolling, or that's super hateful."}, {"time": 5193, "text": "All those communities should have a place in the world."}, {"time": 5197, "text": "But like the thing I've noticed is that hate can destroy, a community full of hate can destroy a community full of love easier than a community full of love can overtake one with hate."}, {"time": 5211, "text": "And so you have to kind of, I don't know exactly how, but create digital mechanisms that discourage the collision of these communities."}, {"time": 5220, "text": "They should all have a platform and ability to speak to a large audience, but you have to be careful to protect that like little flame of connection that people have."}, {"time": 5232, "text": "Yeah, that's good, the goodness, it sounds like, I mean, yeah, I think in any great city like New York, which I love, by the way, you wanna have a symphony in an opera house and you want some punk rock shows happening on the Lower East Side, you want all of that."}, {"time": 5249, "text": "You just don't necessarily want them to overlap."}, {"time": 5252, "text": "In terms of social media and then podcasts and engagement, one thing that I decided very early on is was to encourage comments and feedback, et cetera."}, {"time": 5261, "text": "But I have in my mind what I call classroom rules."}, {"time": 5264, "text": "You've taught in the university and then you teach in the university and you establish a certain etiquette within the classroom of the kinds of questions that you'll tolerate, right?"}, {"time": 5274, "text": "So there's always the student that's gonna ask a question, which is basically a 10 minute monologue about their experience that really isn't a question that pertains to a lot of people."}, {"time": 5281, "text": "So you politely discourage that kind of question and you encourage the kinds of questions that are likely to be in the minds of many other students."}, {"time": 5288, "text": "It's just more efficient that way."}, {"time": 5289, "text": "Or not politely, which is more, you know, I try and respond to comments and I try and respond, but also, you know, there's this, also this really interesting question."}, {"time": 5297, "text": "Now, if you block people or restrict people, people think that you're somehow afraid of the information that they're posting, but that's often not the case."}, {"time": 5305, "text": "I'm not in the habit of blocking or restricting too many people."}, {"time": 5307, "text": "Occasionally we've had to do it only because of how other people are being treated in the comment section."}, {"time": 5312, "text": "What I can take and what I think other people deserve to take are two completely different things."}, {"time": 5317, "text": "David Goggins, right, who we both know well, I don't know if he still does this, but a few years ago, he posted something like, if people ask him, when do you sleep?"}, {"time": 5325, "text": "He would just block them."}, {"time": 5328, "text": "Because it wasn't consistent with what he was trying to say."}, {"time": 5329, "text": "Of course he sleeps, but it's, you know, he's trying to get a particular message out."}, {"time": 5333, "text": "I think people should just understand that everybody's page is their own to moderate, right?"}, {"time": 5339, "text": "Just like in a classroom, there are certain rules, of course, of institution, but then you establish the etiquette within the context of the kind of class."}, {"time": 5346, "text": "You know, a class about personality psychology or the psychology of love, you're gonna have a very different range of conversations than, you know, a class on, you know, memory and physiology."}, {"time": 5360, "text": "So I think social media is a great place for conversation, but it's not necessarily a great place for every kind of conversation."}, {"time": 5368, "text": "Yeah, and I also just say that people that do get blocked, I never, this is something I do very deliberately, blocked or ignored."}, {"time": 5377, "text": "I never think poorly of them."}, {"time": 5378, "text": "I actually explicitly think, if there's somebody that's like saying hateful things about me or whatever, I always think positive thoughts."}, {"time": 5387, "text": "It's not some kind of weird guru thing, but just actually found that as a hack."}, {"time": 5392, "text": "I think well of them, and that allows me to never think of them again."}, {"time": 5396, "text": "Like I send them my love, and like I think this is a like fascinating human being with a fascinating story."}, {"time": 5402, "text": "I would love to have time to actually learn about their story, but there's not enough time in the world."}, {"time": 5407, "text": "And I just think well of them and then I move on and enjoy a delicious meal with people that are close to me and I love and so on and just, and move on."}, {"time": 5416, "text": "And then never adding to the negativity of like, just even in the privacy of my own mind, thinking a hateful thought towards them, it serves no purpose whatsoever."}, {"time": 5425, "text": "Yeah, I love that about you."}, {"time": 5427, "text": "And I know that what you just said to be true, one of the, I think more toxic things in life is what's called, you know, a vacuative projection."}, {"time": 5437, "text": "When people feel something and they try and evacuate it and project it onto somebody else."}, {"time": 5441, "text": "Projection is fascinating, right?"}, {"time": 5443, "text": "What you essentially just said is that you don't accept projections."}, {"time": 5446, "text": "And in fact, you transmute them to put it in the language of the Buddhist, you know, you transmute it into positivity."}, {"time": 5453, "text": "And in that way, you truly neutralize it and transmute it."}, {"time": 5458, "text": "I think that if people were better understood when they were experiencing or observing a vacuative projection, the world would be a much healthier and happier place."}, {"time": 5471, "text": "But it requires a certain stable internal rudder."}, {"time": 5474, "text": "And, you know, when we're tired or sick or angry, you know, we're hungry, excessively hungry."}, {"time": 5481, "text": "All of us are less good at it."}, {"time": 5483, "text": "I've been positively struck by the nature of most of the interactions, not just feedback, but my favorite thing as an educator in the classroom, but also on social media."}, {"time": 5493, "text": "My absolute favorite thing is when the comments about other people's comments are positively reinforcing."}, {"time": 5499, "text": "So you see people having conversations within the comments and you realize this is like, if you, as an educator, again, you know, it's fun to teach and it's fun to talk to the students, but the real pleasure is in walking by a small group of students on campus and hearing them talking about the material, that just fills me with joy."}, {"time": 5518, "text": "And because what it means is that the ideas are reverberating in their nervous systems and will eventually wick out to others."}, {"time": 5526, "text": "So it's not just about feedback, it's about a venue for parsing information."}, {"time": 5531, "text": "So you actually posted that we're gonna talk on Instagram and I collected a bunch of the questions, which reminds me of, I have to mention Mike Jones and a question he asked, but also a gift he gave quite a while ago, if it's okay."}, {"time": 5546, "text": "But first, a quick bathroom break."}, {"time": 5550, "text": "We're looking at an Instagram page of Mike Jones, Knife and Tool, you should check it out."}, {"time": 5555, "text": "He, Andrew gave me a gift from him, that is a badass butcher knife."}, {"time": 5564, "text": "Yours is the earth, da, da, da, is from If by Richard Kipling."}, {"time": 5568, "text": "Yeah, the story of this knife is kind of interesting, perhaps, to people where it was, I was coming out here to Austin to meet with Lex and it was his birthday."}, {"time": 5577, "text": "I wanna get him a gift, but I didn't know what to get him."}, {"time": 5580, "text": "And I contacted this guy, Mike Jones, that I learned about through Joe Rogan."}, {"time": 5584, "text": "Cause the first, remember in the old days of Joe Rogan, when you go on the episode afterwards, you take a picture with an object."}, {"time": 5591, "text": "So it was like Elon with a flamethrower or people would have the ax."}, {"time": 5594, "text": "I picked up this Bushwhacker hatchet thing."}, {"time": 5598, "text": "And I was like, I love this thing."}, {"time": 5601, "text": "And Joe said, oh yeah, you should check out Mike Jones's work, he does these beautiful knives."}, {"time": 5605, "text": "And so then I heard your episode with Joe and you recited a poem at the end."}, {"time": 5611, "text": "It was right after your grandmother died."}, {"time": 5613, "text": "And there's a line in that poem from If that Mike engraved on that knife for you."}, {"time": 5619, "text": "So he makes these by hand."}, {"time": 5621, "text": "I love, the old days, before the podcast and all that."}, {"time": 5627, "text": "That's the first appearance."}, {"time": 5628, "text": "That was the first time on there."}, {"time": 5630, "text": "And it was a lot of fun in the old studio in Los Angeles."}, {"time": 5635, "text": "And yeah, Mike makes these beautiful knives."}, {"time": 5639, "text": "And I have this, I just have a great admiration for crafts people."}, {"time": 5644, "text": "So, do you use it?"}, {"time": 5646, "text": "Do you cut your one meal a day steaks with it?"}, {"time": 5650, "text": "Are you taking it with you on your travels?"}, {"time": 5652, "text": "I actually used to keep it on the table, but I thought it really intimidates guests."}, {"time": 5660, "text": "You can put it on their side."}, {"time": 5661, "text": "It's like, oops."}, {"time": 5662, "text": "It's trust, right?"}, {"time": 5667, "text": "But it's, cause it's not, it's quite bad ass if I may say."}, {"time": 5673, "text": "So the craftsmanship is obvious, but also it is a knife."}, {"time": 5677, "text": "It's got some like Dexter like qualities to it."}, {"time": 5680, "text": "It looks like it's designed to cleave through a limb."}, {"time": 5683, "text": "If I had like a family or something where people, there's nothing about this place that softens your kind of sense that this person might not murder me."}, {"time": 5694, "text": "Let's put it differently."}, {"time": 5696, "text": "This place could use a woman's touch."}, {"time": 5698, "text": "That's one way to put it."}, {"time": 5700, "text": "If it's okay, let me, because it is a poem I go to often actually."}, {"time": 5709, "text": "You mentioned reciting some lyrics and I'm actually gonna go back to that at some point to get a few songs that touch you."}, {"time": 5717, "text": "But this is one of the things I go to often."}, {"time": 5721, "text": "I'll read it to remind myself."}, {"time": 5723, "text": "It's advice from a father to son."}, {"time": 5727, "text": "And it's a kind of mantra that it's just nice to live by."}, {"time": 5731, "text": "So if it's okay with me, just use this opportunity one more time."}, {"time": 5734, "text": "Read If by Roger Kipling."}, {"time": 5736, "text": "If you can keep your head when all about you are losing theirs and blaming it on you, if you can trust yourself when all men doubt you but make allowance for their doubting too, if you can wait to not be tired by waiting or being lied about don't deal in lies or being hated don't give way to hating and yet don't look too good nor talk too wise."}, {"time": 5809, "text": "If you can talk with crowds and keep your virtue, I like this one, and walk with kings nor lose the common touch, if neither foes nor loving friends can hurt you, if all men count with you but none too much, if you can fill the unforgiving minute with 60 seconds worth of distance run, yours is the earth and everything that's in it and which is more, you'll be a man, my son."}, {"time": 5839, "text": "Thank you, Andrew, thank you, thank you, Mike, for the knife, it's a, I don't know."}, {"time": 5843, "text": "It's an important poem."}, {"time": 5844, "text": "And engraved in it, yeah, it's yours."}, {"time": 5848, "text": "Yours is the earth and everything that's in it."}, {"time": 5851, "text": "We toiled over what to engrave, and then finally I just said, Mike, just pick something that speaks to you, you're the craftsman, and so he selected that."}, {"time": 5861, "text": "There's certain ways to pull yourself in that book."}, {"time": 5862, "text": "Actually, Karl Deisseroth, he wrote the book Projections."}, {"time": 5867, "text": "One of my favorite, first of all, just as you said, incredible writer."}, {"time": 5873, "text": "Just, I mean, if you wrote fiction, if you wrote those kinds of things, I'm curious to see where he goes with his writing."}, {"time": 5882, "text": "I think that book took him 10 years to write, which is vindication for me and for you because we're both supposed to write books and we haven't done it."}, {"time": 5890, "text": "Yeah, I mean, in some sense, your first book will have decades in it, right?"}, {"time": 5900, "text": "Even if you just take a half a year to write it."}, {"time": 5904, "text": "It's like the first book, like the first album for a musician, I mean, it's a journey."}, {"time": 5910, "text": "But he uses poems and quotes in there really well."}, {"time": 5915, "text": "It's a beautiful book."}, {"time": 5916, "text": "It's a dreamy book."}, {"time": 5916, "text": "I think when people hear that it's a book about neuroscience, they think they're gonna get a textbook or a protocols book or something, it's nothing like that."}, {"time": 5924, "text": "But it really is a deep dive into the mind of the psychiatrist and the researcher and so much feeling and compassion."}, {"time": 5930, "text": "I love that you love poetry."}, {"time": 5931, "text": "I mean, I didn't know that until I saw you on Rogan Read If and I'm not a very rabid consumer of poetry but I'm a big Wendell Berry fan."}, {"time": 5945, "text": "And I try and read a poem once every few days."}, {"time": 5950, "text": "Also, I think if is a tough act to follow."}, {"time": 5954, "text": "I mean, that's the richness and the, I mean, you said every third line in there is something that you would consider your life well lived if you said that, right?"}, {"time": 5967, "text": "What about the preparation for the solo podcast?"}, {"time": 5971, "text": "You said you listen to certain songs, you sing or recite the lyrics to certain songs."}, {"time": 5977, "text": "Is there ones that kind of come to mind that are interesting?"}, {"time": 5980, "text": "Um, yeah, I've always been very lyrics driven and I don't understand music."}, {"time": 5985, "text": "I've talked to Rick about this."}, {"time": 5986, "text": "I think I've talked to you about this a little bit."}, {"time": 5987, "text": "I don't really understand, I mean, I can hear music and like it, but I don't really understand the structure of it."}, {"time": 5996, "text": "But lyrics make a lot of sense to me."}, {"time": 5997, "text": "But does it touch your soul, music, or is it the lyrics?"}, {"time": 6000, "text": "It's the lyrics, it's not the instrumentals."}, {"time": 6002, "text": "So I'm a huge Joe Strummer fan and I'm gonna lose punk points for saying this but I'm not a Clash fan."}, {"time": 6008, "text": "So he obviously is best known for the Clash."}, {"time": 6010, "text": "Most Clash songs start off great and then after about 30 seconds, at least in my mind, just kind of disintegrate into a bunch of mush."}, {"time": 6017, "text": "Whereas Joe Strummer and the Mescaleros, which is what he did as an adult, as a later and some of his solo work, he actually, Rick produced some work that he did with Johnny Cash."}, {"time": 6030, "text": "Rick pulled Johnny Cash out of, essentially out of retirement and had him do his albums before he died."}, {"time": 6035, "text": "And so anything that Strummer did, there's a favorite song of mine by Strummer, it's called Burning Lights."}, {"time": 6043, "text": "You can find it, there is an album now where you can find it or Tennessee Rain or some of these things that he did, which are a little bit more folky, so not really punk."}, {"time": 6049, "text": "So I love that song."}, {"time": 6052, "text": "Bunch of songs by Rancid that I love."}, {"time": 6054, "text": "Yeah, Rancid is great."}, {"time": 6055, "text": "And then if I listen to instrumentals, I do, I'll listen to classical piano."}, {"time": 6061, "text": "Some dreams are made for children."}, {"time": 6064, "text": "But it's not gonna sound good as a poem."}, {"time": 6066, "text": "They can play the, people can play the song."}, {"time": 6067, "text": "Play the song, okay."}, {"time": 6068, "text": "Yeah, so I'll, I mean, cause it has to be something, Joe's voice is what makes the song."}, {"time": 6075, "text": "Joe's voice is what makes the song."}, {"time": 6077, "text": "But yeah, that song Burning Lights from I Hired a Contract Killer."}, {"time": 6081, "text": "I don't know, the licks are pretty good."}, {"time": 6083, "text": "They're pretty good."}, {"time": 6083, "text": "I mean, Joe is an amazing writer, right?"}, {"time": 6085, "text": "I'm also a big Bob Dylan fan."}, {"time": 6087, "text": "Glenn Gould for classical piano."}, {"time": 6090, "text": "He was at Asperger's, and actually I think you can hear him grunting, he had a Tourette's like tick."}, {"time": 6096, "text": "And I learned about Glenn Gould from Oliver Sacks."}, {"time": 6100, "text": "So I'll listen to any number of things."}, {"time": 6102, "text": "It depends on my mood."}, {"time": 6103, "text": "If I'm feeling a little more tired and I need to be amped up, I'll listen to something that's a little louder and faster."}, {"time": 6108, "text": "If I'm feeling kind of keyed up and I need to bring the cadence down a little bit, then I'll listen to something a little mellower, poppier."}, {"time": 6115, "text": "I love bands like, yeah, I'm a big fan of this British pop band called James."}, {"time": 6122, "text": "There's like 20 bands named James."}, {"time": 6124, "text": "But this one, you know, and again, I lose punk points for saying that, but they're amazing."}, {"time": 6129, "text": "And best luck."}, {"time": 6130, "text": "I think you've accumulated enough points where you can afford to lose a few."}, {"time": 6135, "text": "But in any case, yeah, music and poetry are, they're the subconscious, right?"}, {"time": 6141, "text": "I mean, if you think about a Bob Dylan song or a really good Strummer song or a poem that the words don't mean anything when read linearly, but they make you feel something, they're tapping into the subconscious."}, {"time": 6152, "text": "That's really what they're doing."}, {"time": 6154, "text": "They're pulling on neural threads of emotion based on either timbre or cadence or something that's independent of the word structure."}, {"time": 6165, "text": "And that to me is the beauty of music and poetry."}, {"time": 6168, "text": "I often say Johnny Cash's version, Hurt, that I say would be my favorite song ever."}, {"time": 6175, "text": "Well, he did a Nine Inch Nails song."}, {"time": 6176, "text": "He did, he covered."}, {"time": 6177, "text": "I think Rick produced that."}, {"time": 6178, "text": "Pretty sure he produced that."}, {"time": 6179, "text": "He produced it."}, {"time": 6181, "text": "I mean, he did, like Rick produced the, he pulled Johnny Cash out from a dark place to produce something that, I mean, when you look back as one of the great things ever in music, which are these like haunting covers of certain songs and originals."}, {"time": 6201, "text": "Johnny Cash and Joe Strummer did a version of Redemption song together that Rick produced, which is on loop in my house sometimes, for hours and hours."}, {"time": 6215, "text": "That song is fascinating."}, {"time": 6217, "text": "Bob Marley's song."}, {"time": 6218, "text": "Song by Johnny Cash and Joe Strummer."}, {"time": 6221, "text": "You know, sometimes I think what it would be to be a fly on the wall when these guys were doing this."}, {"time": 6226, "text": "These songs of freedom."}, {"time": 6228, "text": "There's certain songs where you're like, it elicits an emotion that's unlike anything else."}, {"time": 6238, "text": "I mean, I was trying to figure that out with Rick, too."}, {"time": 6241, "text": "Like, there's certain songs that make you wanna pull out over to the side of the road and just weep or just get inspired to just get shit done or all of those kinds of things."}, {"time": 6253, "text": "Remember your family, the people you've lost, all that kind of stuff."}, {"time": 6257, "text": "When you hurt, I hurt myself today to see if I still feel."}, {"time": 6262, "text": "There's certain songs that I've loved so much that I actually won't play them during a relationship until the relationship passes a certain duration because if you start sharing in those experiences with somebody and it starts to become associated with the relationship, you braiding it in with the dopamine of love and that relationship ends, the song is forever tainted."}, {"time": 6285, "text": "There are certain songs that I will never play in the company of anybody else."}, {"time": 6289, "text": "They're mine."}, {"time": 6290, "text": "I just, it's too risky to give those up."}, {"time": 6294, "text": "And you know, and I think that."}, {"time": 6298, "text": "And there's like levels."}, {"time": 6300, "text": "There are levels, right, exactly."}, {"time": 6304, "text": "We'll leave it at that."}, {"time": 6305, "text": "Yeah, and the interesting thing about this kind of preparing for the solo episode, just interacting with Rick about that process of preparation and because you mentioned with interviews."}, {"time": 6323, "text": "By the way, are you do solo, solo?"}, {"time": 6325, "text": "Are you the only one in the room or?"}, {"time": 6326, "text": "No, well, it used to be Rob, my producer, who I should say, you know, he's really the person behind the podcast."}, {"time": 6335, "text": "I mean, first of all, we're equal partners."}, {"time": 6337, "text": "You're just a pretty face."}, {"time": 6340, "text": "We're just, and I'm aging, man."}, {"time": 6341, "text": "Not to say I love him."}, {"time": 6343, "text": "I actually really, I like aging."}, {"time": 6346, "text": "I'm like friends with David Sinclair and it's all about not aging."}, {"time": 6349, "text": "I don't wanna live past 90, 95."}, {"time": 6352, "text": "I'm just trying to get as much done as I can in this short life and do it right and with integrity and heart and accuracy, you know."}, {"time": 6360, "text": "And you like the stages."}, {"time": 6362, "text": "Oh yeah, if you read Erickson's stages of development, you realize that every stage of life is a set of neural circuits trying to resolve a problem."}, {"time": 6372, "text": "And if you're gonna try and avoid that progression sure, you might live longer, but you know, it's sort of like saying like, do you wanna go win the high school jujitsu championship?"}, {"time": 6385, "text": "No, you graduated high school a long time ago, right?"}, {"time": 6388, "text": "So I actually look forward to the future, even if it means that I'm starting to shift."}, {"time": 6394, "text": "I think that my biology will shift."}, {"time": 6397, "text": "Oh, you know, I'll fight that."}, {"time": 6397, "text": "I try and take good care of myself, but I don't wanna get sick."}, {"time": 6401, "text": "I don't wanna suffer, who does?"}, {"time": 6403, "text": "But I'm embracing this whole developmental arc."}, {"time": 6406, "text": "I mean, we're not children and then adults."}, {"time": 6409, "text": "Our entire life is one long developmental arc."}, {"time": 6412, "text": "And if you fail to embrace that, you fail to extract the richness of what it is to be a human being."}, {"time": 6418, "text": "So in any event, I record Rob is in the room."}, {"time": 6425, "text": "I'll sometimes stop and ask him for feedback if I feel like something's not landing right."}, {"time": 6429, "text": "So he gives, if it's clear, he'll let me know."}, {"time": 6431, "text": "If it's not clear, he'll let me know."}, {"time": 6433, "text": "And then, you know, Costello used to be in the room."}, {"time": 6435, "text": "The early days of the podcast, which weren't that long ago, he's snoring at my feet and farting and smelling up the room."}, {"time": 6443, "text": "And we're all just kind of like gasping for air."}, {"time": 6444, "text": "He's a bulldog."}, {"time": 6446, "text": "With him gone, it changed."}, {"time": 6448, "text": "You know, the whole thing changed."}, {"time": 6450, "text": "There will be another dog soon."}, {"time": 6452, "text": "And as you know, I've been moving through that grief process, but having him there gave me a levity that I miss."}, {"time": 6461, "text": "But in my mind, he's still there."}, {"time": 6463, "text": "Yeah, he's still there."}, {"time": 6464, "text": "So, and you know, in time there'll be another dog and who knows, you know, maybe there'll be a dog and a couple of infants running around, but that would be more distracting."}, {"time": 6472, "text": "So, but it's, there's no podcast that exists just because of the podcaster."}, {"time": 6479, "text": "This is true for Joe, this is true for your podcast, for me, that there's, it's not just a staff of people to post stuff."}, {"time": 6485, "text": "That's just the top level contour."}, {"time": 6487, "text": "There's the constant feedback and iteration of what you want it to become and trying to hold on to something that's essential along the way."}, {"time": 6496, "text": "Cause everything has to evolve, but you can't lose the essence of something."}, {"time": 6500, "text": "Anytime a company or brand or a course or a scientist has done that, it just ends up terrible."}, {"time": 6507, "text": "It just is a, you know, it becomes like a Senator version of itself."}, {"time": 6511, "text": "So to Rick is very, the power of the people in the room is great to inspire and to destroy."}, {"time": 6519, "text": "So you have to be extremely careful with the selection of people that are in the room."}, {"time": 6524, "text": "To me, I never really thought of it that way."}, {"time": 6526, "text": "I thought only positive things can happen."}, {"time": 6530, "text": "Oh, by adding people in the room?"}, {"time": 6531, "text": "By adding people in the room."}, {"time": 6532, "text": "Oh, I think if there were an audience in the room for, well, you know what, someday I'd love to do a live podcast with you."}, {"time": 6539, "text": "I saw you doing like a couple of live things, which is great that you're paving the way there to try."}, {"time": 6544, "text": "Well, we did one, I went up to University of British Columbia and did a lecture on a college campus."}, {"time": 6551, "text": "And one of the more gratifying things that happened is this kid, he's in his early twenties, I think, stood up and said, you know, I've never been on a college campus."}, {"time": 6559, "text": "I didn't think I could go onto a college campus."}, {"time": 6562, "text": "And that still rings in my mind."}, {"time": 6563, "text": "Whoever you are out there, that meant so much to me."}, {"time": 6565, "text": "Cause I was like, yes, there was something about that to me."}, {"time": 6567, "text": "I was like, okay, this, it made sense to come all the way up here and do this in person."}, {"time": 6571, "text": "Cause you can get out to a lot more people online."}, {"time": 6574, "text": "Public speaking events, it's not like it's that lucrative or anything."}, {"time": 6577, "text": "I mean, unless you're whatever, you're a famous celebrity or politician or something, I'm sure there are people that do well with it, but that's not what it's about for us."}, {"time": 6584, "text": "It's really about being able to connect with people in a different venue and for interactions like that."}, {"time": 6590, "text": "I don't know how many of them we will do, but I'm curious to see how it goes, but I'd love to do a podcast with you."}, {"time": 6597, "text": "Is it energizing?"}, {"time": 6597, "text": "My fear is the fear of the introvert is that I don't know if I can handle so much love and fascinating people all around."}, {"time": 6614, "text": "Well, we'll invite a few haters too."}, {"time": 6616, "text": "Well, yes, but I love the haters too, but I don't know."}, {"time": 6619, "text": "It makes me nervous."}, {"time": 6620, "text": "Cause Jordan Peterson is currently on tour."}, {"time": 6623, "text": "I got a chance to hang out with him."}, {"time": 6624, "text": "Oh right, he does a lot of live speaking."}, {"time": 6628, "text": "Yeah, he's now on tour where he does like every other day."}, {"time": 6633, "text": "But he doesn't have any small kids at home anymore."}, {"time": 6636, "text": "So yeah, you should do it before you have a fan."}, {"time": 6638, "text": "It's also exhausting."}, {"time": 6639, "text": "I mean, I'm just speaking from an athlete perspective, like if you're Mick Jagger with the Rolling Stones, it's just physically, I mean, you have to speak potentially for two hours, then off stage, like hanging out with people."}, {"time": 6656, "text": "It's a lot of hours."}, {"time": 6658, "text": "It's a lot of hours to stay focused, to keep finding your place of like calmness and excitement."}, {"time": 6664, "text": "Well, and you're staying in hotels, your circadian rhythm is disrupted."}, {"time": 6667, "text": "You're not getting your like cold and sauna and your workout every day."}, {"time": 6670, "text": "Your food isn't optimal."}, {"time": 6672, "text": "I think done in patches, I could enjoy it because it's fun to meet people from different places."}, {"time": 6677, "text": "I'm doing a public lecture in Copenhagen for the Lundbeck Foundation in June, June 3rd."}, {"time": 6682, "text": "And that one is particularly gratifying for me because the Lundbeck Foundation is an academic foundation."}, {"time": 6687, "text": "So the fact that, and then so when they invited, I asked, do you want me to talk about what my lab does or do you want me to talk about the stuff on the podcast?"}, {"time": 6693, "text": "They're like, no, no, not your lab."}, {"time": 6695, "text": "We want to hear about this, like health stuff and the stuff that we cover on the podcast."}, {"time": 6699, "text": "So that was amusing to me and tells me that things are changing now."}, {"time": 6704, "text": "I think 2020 and 2021 revealed a lot of things about people to ourselves."}, {"time": 6710, "text": "But one thing that it made very clear is that there's an enormous appetite for tools for mental and physical health, but also understanding about science and how science is done."}, {"time": 6719, "text": "So thanks to you, again, I'm not saying this to flatter you."}, {"time": 6722, "text": "It's true gratitude."}, {"time": 6723, "text": "There's now a runway for scientists to talk to people."}, {"time": 6727, "text": "I mean, you had the, I always forget this guy's name, the virus guy from Columbia."}, {"time": 6730, "text": "It's a wrecking yellow."}, {"time": 6732, "text": "Yeah, amazing, right?"}, {"time": 6733, "text": "I mean, forgetting the controversy around all the stuff of 2020, 21."}, {"time": 6737, "text": "I mean, he is an encyclopedia of all things virology."}, {"time": 6741, "text": "Yeah, people should listen to his podcast this week in virology."}, {"time": 6745, "text": "He's also an incredible lecturer and educator."}, {"time": 6750, "text": "It's fascinating when people take again that leap of putting all that education online."}, {"time": 6756, "text": "That's non controversial at all."}, {"time": 6759, "text": "It's like everybody there, people should go listen to him for the most part in terms of, at his best, at least."}, {"time": 6767, "text": "There's no politics in it."}, {"time": 6768, "text": "There's none of that."}, {"time": 6770, "text": "No, he's a virus jockey."}, {"time": 6771, "text": "He likes playing around with bacteria and viruses and."}, {"time": 6775, "text": "But that said, molecular biology."}, {"time": 6777, "text": "We all say stuff carelessly all the time."}, {"time": 6780, "text": "So he gets in a bit of trouble on some of the things you've said about like dismissing lab leak theory."}, {"time": 6786, "text": "Like, there's no way."}, {"time": 6787, "text": "He dismisses that."}, {"time": 6788, "text": "Yeah, but not, he's not making, like folks, there's a difference when you say stuff like off the cuff and when you say stuff that's like courts your principles and you've thought about it for a very long time."}, {"time": 6805, "text": "You talking for hours, for hundreds of hours and you can just say stuff."}, {"time": 6809, "text": "You could just say your opinions."}, {"time": 6812, "text": "Will Smith slapped."}, {"time": 6814, "text": "I was wondering, okay, wait, how long have we been recording?"}, {"time": 6817, "text": "I was wondering how long it was gonna take us before someone talked about Ukraine."}, {"time": 6820, "text": "No, no, Will Smith."}, {"time": 6821, "text": "I was wondering whether or not we'd make it the end."}, {"time": 6823, "text": "I had it planned."}, {"time": 6825, "text": "I was literally in the back of my mind."}, {"time": 6826, "text": "I had it planned that at the end, if we didn't talk about the Will Smith, Chris Rock thing, that I was gonna say, it's amazing."}, {"time": 6832, "text": "This is the first conversation to happen in a long time where it wasn't mentioned."}, {"time": 6839, "text": "No, do not pull it up."}, {"time": 6841, "text": "We don't need to see it."}, {"time": 6843, "text": "It revealed some interesting things about human beings, impulse control and lack thereof."}, {"time": 6848, "text": "But, you know, oh my goodness."}, {"time": 6851, "text": "Chris Rock has a material for the rest of his career."}, {"time": 6853, "text": "Yeah, I think he's not short on material."}, {"time": 6856, "text": "But I do, see, if I knew what I wanted to tweet, if I knew you a lot to just slap comedians, my conversation with Tim Dillon would have gone very differently."}, {"time": 6867, "text": "People just being humans."}, {"time": 6869, "text": "There's so much fascinating human nature on display there."}, {"time": 6873, "text": "It's also, in terms of it becoming a topic that a lot of people are talking about versus the war in Ukraine, for example, is also fascinating to watch, like just these kind of news cycles moving through."}, {"time": 6886, "text": "I think, if I may, I'm sorry to interrupt, but, you know, anytime we observe something very limbic, very emotional, you know, we generally can empathize somewhat, right?"}, {"time": 6899, "text": "We all know what it's like to feel angry."}, {"time": 6900, "text": "We all know what it's like to feel ashamed."}, {"time": 6902, "text": "We all know what it's like to feel shocked."}, {"time": 6904, "text": "Images of war are, for most people, very hard to relate to."}, {"time": 6909, "text": "We see it, it's, you know, there are these images and they're very traumatic and challenging to look at at times, and yet most people have no idea what it feels like to be shot at or what it feels like to have your home destroyed or what it feels like to be an aggressor in that way."}, {"time": 6926, "text": "So it's very, so I think that people naturally orient towards things that feel familiar to them, even though the circumstances are different."}, {"time": 6933, "text": "And people also forget, they look at these celebrities, that's just like looking at criticism of Will Smith, you forget that they're human too."}, {"time": 6943, "text": "That's one of the most surprising things for me, having done this podcast and met celebrities and stuff like that."}, {"time": 6950, "text": "They're human, they're all human."}, {"time": 6952, "text": "And that's inspiring to me, like some of these great folks that have won Nobel Prizes and built some cool things, they're just human, like the rest of us."}, {"time": 6959, "text": "Well, and if you look at actors and actresses, I mean, there's some amazing ones, right?"}, {"time": 6963, "text": "And who also do well in the outside life, but their careers were built on the business of pretending to be other people."}, {"time": 6972, "text": "And that's got to distort maybe positively, but also just let's be honest, what it is that the neuroplasticity there, the changes in the areas of the brain that represent personality have to be quite different for somebody who pretends to be lots of different personalities and gets paid for it."}, {"time": 6988, "text": "You're working the reward system into the system of self identity."}, {"time": 6993, "text": "And you have to imagine that that can really contort somebody's neurology in ways that maybe they are not as, maybe they are not in touch with reality in the same way that we are."}, {"time": 7007, "text": "Remember earlier we were talking about neurotic versus psychotic."}, {"time": 7010, "text": "They may be more borderline in their kind of ground state than we think."}, {"time": 7016, "text": "And so I'm actually impressed anytime there's a celebrity who doesn't have a messed up life."}, {"time": 7020, "text": "I'm like, oh wow, finally somebody who's managed to maintain some semblance, at least from the outside, of normalcy."}, {"time": 7028, "text": "So first of all, I can empathize with the actions that Will Smith did, right?"}, {"time": 7034, "text": "They're not, I think they're kind of, not kind of, they're just shitty."}, {"time": 7038, "text": "You should probably talk privately, man to man, not, because otherwise it's like a dramatic display."}, {"time": 7044, "text": "It's almost like you are a fake, you're acting."}, {"time": 7047, "text": "Well, there are all these questions, right?"}, {"time": 7049, "text": "I mean, obviously it was aggressive at some level."}, {"time": 7053, "text": "There's this question of whether or not it was impulsive."}, {"time": 7056, "text": "I think most people feel yes."}, {"time": 7057, "text": "There's a question, there was the protective nature of it because he was doing it to, you know, apparently in defense."}, {"time": 7063, "text": "But then there's also the context, he lost touch with the context, right?"}, {"time": 7070, "text": "Whereas Chris Rock basically gets, there's the possible critique that he went too far."}, {"time": 7076, "text": "That's gonna be in the eye of the beholder."}, {"time": 7079, "text": "But then, and depending on how you view comedy and jokes, but then there's also the fact that he took that slap and then just snapped right back, so much so that people thought maybe it was fake."}, {"time": 7087, "text": "He also waited with his hands behind his back."}, {"time": 7090, "text": "That's just natural, he likes to stand like that."}, {"time": 7092, "text": "I mean, I got to a little bit of a story here to connect to what Chris Rock did."}, {"time": 7102, "text": "Like I wish, what Chris Rock did in terms of just taking the slap and keep going, first of all, just props for somebody that's able to maintain cool in that situation for the most part."}, {"time": 7115, "text": "I think I like watched it once."}, {"time": 7116, "text": "You only have to be alive on this planet to see it, you can't avoid seeing it."}, {"time": 7122, "text": "I wish at that afterwards, he would sort of say something loving and kind to Will Smith and his wife and then hit him real hard, lean into the joke."}, {"time": 7136, "text": "But I think in hockey, they call it taking a number."}, {"time": 7140, "text": "I have a friend who plays hockey and there's this idea that if someone checks you really badly in one game, you don't go and check them again, you don't get into a fight."}, {"time": 7147, "text": "But three games later, you blade them in the shin."}, {"time": 7154, "text": "The ability to defer and to handle it in whatever fashion one feels is appropriate."}, {"time": 7160, "text": "They're probably also friends and all those kinds of things that they respect each other, so he probably didn't, but there's a comedian instinct."}, {"time": 7167, "text": "I saw this, I was at an open mic here in Texas."}, {"time": 7173, "text": "I won't say where, there's many open mics."}, {"time": 7175, "text": "Have you gone to a few of these?"}, {"time": 7176, "text": "These are pretty good."}, {"time": 7177, "text": "No, so there is more sort of rougher kind of."}, {"time": 7184, "text": "Yeah, you've been hanging out in West Texas lately."}, {"time": 7187, "text": "Austin's too tame for Lex, so he's headed to West Texas."}, {"time": 7190, "text": "Exactly, I put on a cowboy hat and instantly I became a cowboy."}, {"time": 7194, "text": "I've been talking like a cowboy."}, {"time": 7196, "text": "I mean, I belong out there in the desert."}, {"time": 7198, "text": "He's gone from eating meat and athletic greens to rattlesnakes, rattlesnake jerky."}, {"time": 7204, "text": "No, there was a, open mic is late at night and I was one of the only people in the audience."}, {"time": 7211, "text": "There's a couple of drunk folks, a few drunk folks."}, {"time": 7215, "text": "One of them was a couple, like bikers with helmets and so on, a guy and a girl."}, {"time": 7223, "text": "And then the comedian, the open mic comedian, did a joke about people who wear helmets."}, {"time": 7231, "text": "I don't know if it was on purpose or not, but he did the joke."}, {"time": 7234, "text": "And then the guy about women who wear helmets."}, {"time": 7238, "text": "And the guy, it's this exact same situation."}, {"time": 7241, "text": "The guy stood up, walked up to him."}, {"time": 7244, "text": "There was no slap."}, {"time": 7245, "text": "It's so interesting, because this happened before the Will Smith thing."}, {"time": 7247, "text": "So he walked up to the comedian and said, I think he pointed his finger down and told him to stop or something like that."}, {"time": 7261, "text": "And then sat down."}, {"time": 7262, "text": "This is an audience of like six people."}, {"time": 7265, "text": "And at midnight around then, there's nobody, no security, nothing."}, {"time": 7272, "text": "Which implies."}, {"time": 7272, "text": "And then this guy was the energy drunk, but also a biker and what he felt his lady was now attacked by the comedian, right?"}, {"time": 7285, "text": "With his words."}, {"time": 7287, "text": "And the comedian was a kind of out of shape, small guy."}, {"time": 7292, "text": "So he's not threatening at all and probably in trouble."}, {"time": 7297, "text": "And the comedian, after he sat down, he looked a little bit scared."}, {"time": 7301, "text": "He paced back and forth."}, {"time": 7303, "text": "And then he did the joke again."}, {"time": 7308, "text": "And I was sitting and I started, I leaned back and I just did this like, because that is comedy."}, {"time": 7316, "text": "And the guy was getting angrier and angrier."}, {"time": 7320, "text": "And he just sat there."}, {"time": 7322, "text": "And the comedian went on for a couple more minutes and then did another bad joke, but another joke about him."}, {"time": 7330, "text": "It's just like, he leaned into it."}, {"time": 7332, "text": "If you go to a small comedy club, open mic or otherwise, you're in the shooting gallery."}, {"time": 7337, "text": "Like you're basically there teed up as a pin to get it."}, {"time": 7341, "text": "We went and saw Andrew Scholls in San Francisco."}, {"time": 7344, "text": "In San Francisco?"}, {"time": 7345, "text": "Yeah, it was hilarious."}, {"time": 7347, "text": "I mean, he's just masterful in his ability to command an audience."}, {"time": 7352, "text": "But I felt for the people up front, but no sympathy either because you buy tickets to sit up front at a Scholls show, you're gonna get it."}, {"time": 7361, "text": "But he was very loving."}, {"time": 7363, "text": "Yeah, and funny."}, {"time": 7364, "text": "First of all, funny."}, {"time": 7366, "text": "The funniness really helps you."}, {"time": 7368, "text": "But the ethic of the comedian is like that fearlessness."}, {"time": 7372, "text": "What I really liked is like the danger, there's risk to comedy and there's also consequences."}, {"time": 7380, "text": "Have you watched that show?"}, {"time": 7383, "text": "The Marvelous Miss Maisel show?"}, {"time": 7385, "text": "I watched a few of them."}, {"time": 7387, "text": "Guilty pleasure there."}, {"time": 7389, "text": "She plays a comic in the, I think it's mid 1960s in New York."}, {"time": 7394, "text": "And there's a character that somewhat resembles Lenny Bruce."}, {"time": 7398, "text": "It's sort of meant to be Lenny Bruce."}, {"time": 7401, "text": "And they're always getting arrested and this kind of thing."}, {"time": 7404, "text": "I think I learned about it from Joe."}, {"time": 7405, "text": "Anyway, the writing is great."}, {"time": 7407, "text": "It's very funny."}, {"time": 7409, "text": "But yeah, comedy is designed to push boundaries, right?"}, {"time": 7412, "text": "And to say the thing that other people aren't, feel they can't say."}, {"time": 7418, "text": "Not something in science, right?"}, {"time": 7419, "text": "Science you're supposed to, etiquette is a big part of how you communicate ideas."}, {"time": 7423, "text": "It's about constraining communication."}, {"time": 7426, "text": "This is something, I mean, I confess on the podcast, in the goals of making it clear, interesting, surprising and actionable, you have to constrain the amount and the style of information."}, {"time": 7438, "text": "Otherwise it becomes something else altogether, right?"}, {"time": 7442, "text": "I saw Sandra Perchay, Google CEO, said that he likes the thing you mentioned, not the yoga nidra, but the NSDR, non sleep deep rest podcast over meditation."}, {"time": 7455, "text": "I don't know if you saw that."}, {"time": 7456, "text": "Yeah, I saw that, yeah."}, {"time": 7461, "text": "What do you think the difference is?"}, {"time": 7462, "text": "Yeah, so non sleep deep rest, NSDR is an acronym that I coined because it encompasses a lot of practices that are not meditation per se, but that bring the brain and body into a state of relaxation and focus."}, {"time": 7474, "text": "So hypnosis is one variant of NSDR."}, {"time": 7477, "text": "There are other variants of NSDR."}, {"time": 7478, "text": "You can just look these up and you'll find them."}, {"time": 7480, "text": "And I think that they've caught on and that the CEO of Google is an avid practitioner of NSDR because it has this amazing ability to reset your energy levels and focus."}, {"time": 7493, "text": "Whereas with meditation, many people find meditation hard."}, {"time": 7497, "text": "And part of the reason they find it hard is that it requires focus."}, {"time": 7500, "text": "NSDR is a state which is very calm and relaxing."}, {"time": 7504, "text": "You don't have to work too hard."}, {"time": 7505, "text": "You're just listening to a script, whereas most forms of meditation, not all, but most forms of meditation involve cranking up the activity in your prefrontal cortex and trying to see your thoughts as opposed to thinking your thoughts or focus on your breath, but then third personing yourself in some respect and that's work."}, {"time": 7524, "text": "And so many people who meditate quite intensely feel more exhausted."}, {"time": 7528, "text": "Now that doesn't mean that meditation doesn't have any utility, but it's distinctly different than NSDR."}, {"time": 7533, "text": "And I think that people are working, certainly the CEO of Google I have to imagine is working very hard and using his forebrain."}, {"time": 7539, "text": "If he's going to have 20 or 30 minutes to take a break, he should, and I think this is what he's doing, he should go out for a jog and not listen to anything and just kind of let his mind wander or sit there in a chair and just zone out or do NSDR."}, {"time": 7552, "text": "The problem is people are not that good at shifting states."}, {"time": 7557, "text": "We are all actually pretty good at, even people with severe ADHD, we had an episode about this, can become hyper focused on things that they actually enjoy because dope and most of the drugs designed to treat ADHD are drugs that increase the levels of dopamine."}, {"time": 7572, "text": "So when you like something, there's dopamine release and you can focus."}, {"time": 7575, "text": "It's when you don't like something that's hard to focus, shifting states is hard."}, {"time": 7578, "text": "I'm sure you've experienced this."}, {"time": 7579, "text": "If you've ever been in deep research or podcasting, podcasting, and then all of a sudden you go for a run, you probably spend the first third of that run thinking."}, {"time": 7587, "text": "And then in the middle third, you're kind of that thinking is fractured a bit."}, {"time": 7590, "text": "And then in the final third is where you finally get to relax because the brain doesn't shift states very quickly."}, {"time": 7597, "text": "We can go from sleep to wakefulness quickly."}, {"time": 7599, "text": "We can go from wakefulness to sleep quickly, but we don't shift between different states of consciousness like a step function, except in rare cases, right?"}, {"time": 7609, "text": "Fear is one."}, {"time": 7610, "text": "All of a sudden we hear an explosion right now, it's a step function."}, {"time": 7612, "text": "We're in fear or we're in alertness, right?"}, {"time": 7616, "text": "A heightened state of alertness."}, {"time": 7617, "text": "But NSDR is terrific at allowing people to learn to shift their state."}, {"time": 7623, "text": "And I actually would venture to argue that part of the value of meditation and exercise is the actual state that you get into in deep meditation or exercise, but just as valuable is the transition that you have to take yourself through from one state of mind to the other and then back again."}, {"time": 7640, "text": "When I look, David Goggins, he always seems to come up because he represents so many important things, drive, determination, override of emotional state, going from being a 300 pound plus person to a fit person through, he's never revealed anything substantial about what he ate or what he didn't eat."}, {"time": 7656, "text": "He basically says like, listen, run a lot, eat less, right?"}, {"time": 7660, "text": "But what's remarkable is so much of what he says is about those transitions, about taking oneself from a state of I don't want to to scruffing oneself and like you're gonna do it anyway."}, {"time": 7672, "text": "And then being able to carry that into regular life, so to speak."}, {"time": 7676, "text": "So I think that NSDR is immensely powerful."}, {"time": 7680, "text": "It's zero cost."}, {"time": 7681, "text": "And one of the reasons I'm such a fan of people doing it is that most people don't stick to a meditation practice."}, {"time": 7688, "text": "There are also been a few cases you might find this interesting."}, {"time": 7690, "text": "There's a book by Scott Carney."}, {"time": 7693, "text": "I think it's called the transcendence trap or something."}, {"time": 7695, "text": "I'm gonna have that title wrong, but there have been a fair number of cases of people that go and do very extensive meditation, silent meditation retreats, who then return to normal life and end up killing themselves."}, {"time": 7708, "text": "There are states of mind inside of extended meditations or silent meditations that are very beneficial."}, {"time": 7714, "text": "And I'm certainly not suggesting people don't meditate, but I know at least one person who came back from one of these long extended meditation retreats and wasn't able to shift their state back into one that was functional in regular life."}, {"time": 7725, "text": "And that book includes a very dramatic story."}, {"time": 7727, "text": "I don't wanna give it away in case people check out the book, but Scott told the story to me directly once, where someone feels they've reached enlightenment and then commit suicide."}, {"time": 7740, "text": "So these very unusual brain states are potentially hazardous if people can't return from them."}, {"time": 7747, "text": "So it's nice to focus not on those brain states, but instead on the shifting."}, {"time": 7752, "text": "Right, this morning I woke up a little bit earlier than I would have liked."}, {"time": 7756, "text": "I use this reverie app that's research backed, REVRI.com."}, {"time": 7760, "text": "There's a free version of it or you can try it for free."}, {"time": 7763, "text": "So I feel comfortable."}, {"time": 7764, "text": "That's for hypnosis?"}, {"time": 7765, "text": "For hypnosis."}, {"time": 7765, "text": "And I do a self hypnosis to put me back into sleep."}, {"time": 7769, "text": "And if I can't sleep, you just put me into a state of deep relaxation."}, {"time": 7771, "text": "I would put hypnosis under the category of NSDR, yoga nidra under the category of NSDR."}, {"time": 7777, "text": "There are now some NSDR scripts online if you just go to YouTube that you can just listen to."}, {"time": 7782, "text": "Do you like those?"}, {"time": 7783, "text": "I think the one from made for is quite good."}, {"time": 7785, "text": "I have an affiliation with them, but it's free."}, {"time": 7786, "text": "So I feel comfortable mentioning it."}, {"time": 7788, "text": "I do, I really like the reverie app."}, {"time": 7790, "text": "I can vary."}, {"time": 7792, "text": "And as you, the more you do them, the more quickly you can shift your brain into a state of deep relaxation."}, {"time": 7796, "text": "I will sometimes stop mid podcast."}, {"time": 7799, "text": "If it's, sometimes our recordings go seven, eight hours and I'll stop and I'll do a one minute hypnosis."}, {"time": 7804, "text": "They have one minute hypnosis inside reverie."}, {"time": 7806, "text": "You're only going to, you're only going to find that one minute hypnosis is effective if you are routinely doing 10 and 15 minute hypnosis in addition to that."}, {"time": 7816, "text": "Meaning I do it every other day or so at 10 or 15."}, {"time": 7819, "text": "So there's a, is there a YouTube one minute hypnosis or is this for the reverie?"}, {"time": 7823, "text": "There are, but inside of reverie as well."}, {"time": 7825, "text": "You can find them online."}, {"time": 7826, "text": "A really good."}, {"time": 7827, "text": "Pull it up so I can see."}, {"time": 7828, "text": "Yeah, so reverie is good."}, {"time": 7829, "text": "And then Michael Sealy, S E A L E Y."}, {"time": 7832, "text": "He has some long hypnosis scripts, but again, these are all free and you know, there's a lot of good research now on the neural networks and it shifts your so called default network, the default mode network."}, {"time": 7843, "text": "It shifts how much of your forebrain you're using."}, {"time": 7846, "text": "And it also is very, very good."}, {"time": 7848, "text": "If I get so many questions about, hey, I'm really upset."}, {"time": 7853, "text": "I found out about my girlfriend's sexual past or, hey, I'm so upset."}, {"time": 7857, "text": "I found out that my boyfriend was cheating or, oh, so and so died."}, {"time": 7859, "text": "How do I get over these emotions?"}, {"time": 7861, "text": "How do I deal with them?"}, {"time": 7862, "text": "And hypnosis has shown to be very useful for people to learn to bring themselves into a state of deep relaxation, to literally project in their mind's eye these very intense things that they don't like."}, {"time": 7875, "text": "And then for people to associate with other emotions in their body to learn to be calm while feeling your feelings, to dissociate the mind body communication to some extent."}, {"time": 7886, "text": "Just observe the feelings."}, {"time": 7888, "text": "Observe them and start to associate them with positive experiences."}, {"time": 7891, "text": "You're an Android guy, so soon it should be available on Android."}, {"time": 7895, "text": "Then it doesn't exist for me."}, {"time": 7897, "text": "It's only, you know, I don't get it."}, {"time": 7898, "text": "Android is the device of the people, all you elitist people with your iPhones."}, {"time": 7903, "text": "Tell me this about Android."}, {"time": 7904, "text": "Now you want to, this is the one thing that gets me."}, {"time": 7908, "text": "Cause I'm very close to someone who uses an Android phone."}, {"time": 7910, "text": "I feel like that."}, {"time": 7911, "text": "So you have great people in your life."}, {"time": 7914, "text": "No, their messages always look green to me, but I answer yours, not despite that."}, {"time": 7920, "text": "But they, I feel like the Android phones are very trigger happy."}, {"time": 7923, "text": "Like anything I touch does something."}, {"time": 7925, "text": "Whereas the Apple phone is kind of built for like a macaque monkey to be able to operate, which is great for me because I'm more of a macaque monkey and you're a more sophisticated ape."}, {"time": 7936, "text": "I think like you have to be."}, {"time": 7937, "text": "They're more sensitive."}, {"time": 7938, "text": "Yeah, you have to have, you know, I mean, I've got fat fingers, you know, I've got clumsy fingers."}, {"time": 7942, "text": "The Android is too, well, maybe you need to soften your touch."}, {"time": 7946, "text": "What I would do is go into the most, sort by most popular, because there's some older ones that I really like and it generally scales with that."}, {"time": 7953, "text": "So I'll do the, this one, the hypnosis for clearing subconscious negativity."}, {"time": 7958, "text": "That's an hour long one."}, {"time": 7960, "text": "The sleep and anxiety one, 40 minutes, but those you listen to as you fall asleep."}, {"time": 7964, "text": "As you fall asleep."}, {"time": 7964, "text": "Oh, we're going to do this now?"}, {"time": 7965, "text": "Yeah, yeah, let's listen to it."}, {"time": 7968, "text": "And I have created this hypnosis recording for you to help you."}, {"time": 7973, "text": "And this is the voice."}, {"time": 7973, "text": "How often does the voice pop up?"}, {"time": 7975, "text": "And at the same time."}, {"time": 7977, "text": "You don't watch it."}, {"time": 7978, "text": "You just listen to it."}, {"time": 7979, "text": "Your anxiety."}, {"time": 7983, "text": "Now, one of the most important things."}, {"time": 7985, "text": "It's a great voice."}, {"time": 7986, "text": "At the outset of any self hypnosis experience is to know and understand."}, {"time": 7992, "text": "So people really should know that stage hypnosis is about the hypnotist getting you to do things you wouldn't normally do."}, {"time": 8001, "text": "Self hypnosis, which is what we're talking about here, reverie in this is about you getting your brain into the state that you want."}, {"time": 8008, "text": "And again, I mean, there's a ton of neuroimaging data and work on trauma and pain relief."}, {"time": 8014, "text": "And our labs are working on this with David Spiegel's lab."}, {"time": 8016, "text": "I really encourage people to explore NSDR."}, {"time": 8019, "text": "And if this feels a little too wacky and out there, then I would just put in NSDR into YouTube and there's some good NSDR scripts."}, {"time": 8026, "text": "Yeah, by the way, Sondar is a fan of your podcast."}, {"time": 8029, "text": "No, it's okay, we don't need to play it."}, {"time": 8030, "text": "Yeah, so I don't know him."}, {"time": 8033, "text": "But I get a lot of media outlets picked up on his love of NSDR."}, {"time": 8038, "text": "And I have to imagine running Google involves a lot of, juggling a lot of."}, {"time": 8042, "text": "He's one of the great CEOs because everybody loves him."}, {"time": 8045, "text": "Everybody loves him."}, {"time": 8046, "text": "Have you interviewed him?"}, {"time": 8047, "text": "No, but we'll do the interview eventually."}, {"time": 8050, "text": "So it's this annoying thing about me being a stickler for three hours, CEOs don't seem to understand."}, {"time": 8057, "text": "Like, not understand, but it's scheduling."}, {"time": 8060, "text": "So what happens is Sondar said, yes, definitely, let's do it."}, {"time": 8063, "text": "I'm a fan of podcasts, is a fan of yours."}, {"time": 8066, "text": "And then he goes to his executive assistant like, oh, let's find a slot."}, {"time": 8072, "text": "And then they immediately think, all right, well, one hour is good."}, {"time": 8075, "text": "45 minutes."}, {"time": 8076, "text": "90 minutes."}, {"time": 8077, "text": "By Zoom."}, {"time": 8078, "text": "90 minutes, yeah, right."}, {"time": 8079, "text": "Well, no, they know in person that I'm a stickler on that."}, {"time": 8082, "text": "But like, it's like, no, we need more."}, {"time": 8085, "text": "And it's so hard to."}, {"time": 8087, "text": "Do you still travel to do your podcast or generally?"}, {"time": 8089, "text": "No, most people come down here."}, {"time": 8090, "text": "Most people, but for certain situations, obviously, like if you're in prison."}, {"time": 8099, "text": "Or you're ahead of."}, {"time": 8100, "text": "Imagine if you get out on work for a lot of people that have anklets so that they can go to an Alex Friedman podcast, it'll probably happen."}, {"time": 8105, "text": "Have you ever been in a prison?"}, {"time": 8107, "text": "No, you know, either a visitation or on the inside."}, {"time": 8113, "text": "From my hike, I can see San Quentin."}, {"time": 8115, "text": "It's really weird that San Quentin and Alcatraz, you know, Bay Area, beautiful, everyone thinks like, you know, like there's the Bay and there's Alcatraz and San Quentin sitting right there."}, {"time": 8122, "text": "Does that make you feel?"}, {"time": 8124, "text": "You know, it's amazing how easy it is to overlook that they're there and forget that they're there."}, {"time": 8128, "text": "But when I drive by San Quentin, I think about it."}, {"time": 8131, "text": "I also think about the people who are in there who might be innocent."}, {"time": 8134, "text": "I've seen some of those episodes on Rogan and elsewhere."}, {"time": 8137, "text": "And Amanda Knox talks a lot about this, right?"}, {"time": 8140, "text": "Whether or not you believe her story or not, I happen to believe her story, personally, based on what I know, what, you know, I'm sure there are people disagree with me."}, {"time": 8148, "text": "I think to myself, what it must be like to be in a cell and know in your heart's heart, you didn't do it, you know?"}, {"time": 8157, "text": "I mean, I can't think of many things worse."}, {"time": 8161, "text": "I can't think of many things worse."}, {"time": 8162, "text": "That's so clearly unjust, but life is full of unjust things like this, cruel things happen all the time."}, {"time": 8172, "text": "You lose a loved one for no good reason."}, {"time": 8176, "text": "You lose your job."}, {"time": 8180, "text": "You lose your home."}, {"time": 8182, "text": "Yeah, I've been talking to a lot of refugees now, and the war in Ukraine has really focused my mind to how much suffering there is in the world."}, {"time": 8189, "text": "And so just cruel things happen all the time."}, {"time": 8192, "text": "And people kind of, there's this suffering, and you kind of go on."}, {"time": 8198, "text": "You stick to the people really close to you."}, {"time": 8201, "text": "There's still love all around you."}, {"time": 8204, "text": "Traumatic events kind of focus your mind on the, like, very practical, like, okay, how do we solve the problem?"}, {"time": 8211, "text": "How do we escape?"}, {"time": 8212, "text": "Let's solve, like, survival, food, shelter, focus."}, {"time": 8216, "text": "Remember that book, \"'All's Quiet on the Western Front,\" by World War I?"}, {"time": 8221, "text": "There's this line in there."}, {"time": 8221, "text": "I forget what it is, about how war is like the smell of a skunk."}, {"time": 8226, "text": "Like a little bit is actually a little bit is slightly, there's something slightly delicious of it, is what it says in the book."}, {"time": 8234, "text": "I happen to like the smell of ferrets and skunks and things."}, {"time": 8237, "text": "I had a pet ferret when I was a kid, and I like that musky scent."}, {"time": 8241, "text": "Most people, just it's repulsive to them."}, {"time": 8243, "text": "It's actually a gene, believe it or not."}, {"time": 8245, "text": "Some people have the gene that makes the musky scent repulsive."}, {"time": 8249, "text": "Some people love it."}, {"time": 8252, "text": "There's another gene, this is a fun one."}, {"time": 8254, "text": "Microwave popcorn, smells good, neutral, or disgusting to you?"}, {"time": 8258, "text": "Good, very good."}, {"time": 8259, "text": "There are people who have a gene that leads them to the perception that the smell of microwave popcorn that you find is good, it smells like putrid vomit to them."}, {"time": 8268, "text": "It's a particular gene variant, and they can smell certain elements within the microwave popcorn."}, {"time": 8275, "text": "It's pretty, it's prominent in France."}, {"time": 8278, "text": "This gene, and so in laboratories where you have a lot of French people, it's often said like you're not allowed to make microwave popcorn."}, {"time": 8286, "text": "It smells putrid, disgusting, you know?"}, {"time": 8289, "text": "So a lot of it's in the perception of the beholder, right?"}, {"time": 8294, "text": "But okay, before I leave the NSDR, focus in general, as you said, it's for shifting mind states."}, {"time": 8303, "text": "Is there advice you have for how to achieve focus on a task?"}, {"time": 8311, "text": "First of all, we have to distinguish between modulators and mediators, and I'll do this very briefly."}, {"time": 8316, "text": "There are a lot of things that will modulate your state of focus, but they don't directly mediate your sense of focus."}, {"time": 8322, "text": "So for instance, if right now a fire alarm went off in this building, it would modulate our attention."}, {"time": 8328, "text": "We would get up and leave."}, {"time": 8329, "text": "It would be very hard to do what we're doing with that banging in the background, at least at first."}, {"time": 8333, "text": "So it's modulating focus, but it's not really involved in the mechanisms of focus, right?"}, {"time": 8341, "text": "In the same way, being well rested when you sleep, your autonomic nervous system that adjusts states of alertness and focus and calm works better than when you're sleep deprived."}, {"time": 8350, "text": "So if you're sleeping better, you're gonna focus better."}, {"time": 8352, "text": "So I always answer this way to a question like this, because the best thing that anyone can do for their mental health, physical health, and performance in athletic or cognitive endeavors or creative endeavors is to make sure that you're getting enough quality sleep, enough of the time for you."}, {"time": 8368, "text": "And that's gonna differ."}, {"time": 8369, "text": "We could talk about what that means."}, {"time": 8370, "text": "Now, in terms of things that mediate focus without getting into the description of mechanisms, cause we have podcasts about that."}, {"time": 8377, "text": "It's very clear that mental focus follows visual focus, provided that you're a sighted person."}, {"time": 8385, "text": "Much of the training that's being done now in China to teach kids to focus better, literally has them stare at a target, blinking every so often, but really training themselves to breathe calmly and maintain a tight visual aperture."}, {"time": 8400, "text": "When you read, you have to maintain a tight visual aperture."}, {"time": 8403, "text": "You're literally scrolling like a highlighter in your mind's eye, right?"}, {"time": 8406, "text": "It's kind of obvious once you hear it."}, {"time": 8408, "text": "So for people that have problems focusing sleep well, learn to dilate and contract your visual field consciously."}, {"time": 8417, "text": "This can be done if you practice it a little bit."}, {"time": 8419, "text": "And then as I said before, it is very hard to get into a state of focus, like a step function immediately, like snapping your fingers."}, {"time": 8426, "text": "What you can do is you can pick any object, but ideally an object at roughly the same distance, placed at roughly the same distance to which you're going to do that work and stare at it."}, {"time": 8435, "text": "You're allowed to blink."}, {"time": 8436, "text": "And as your mind starts to drift every once in a while to understand that's normal, but try and narrow your visual aperture and bring that into your visual field so that that's the most prominent thing, kind of like portrait mode in your phone."}, {"time": 8449, "text": "This would look very different in portrait mode than it would in just a standard photograph mode."}, {"time": 8453, "text": "And then after doing that for 30 to 60 seconds, moving into the work that you're about to do and really encourage yourself to do that."}, {"time": 8461, "text": "If you're somebody who's low vision or no vision, you're going to use your ears to do this."}, {"time": 8465, "text": "Braille readers have trouble focusing sometimes because they feel other stuff and they hear other stuff."}, {"time": 8471, "text": "So you learn to adjust that aperture consciously."}, {"time": 8475, "text": "And then of course the pharmacologic tools, just enough caffeine, but not too much, right?"}, {"time": 8480, "text": "We talked about white noise, brown noise, music or no music, really varies, but it's very clear that binaural beats of 40 Hertz can shift the brain into a heightened state of focus and cognition."}, {"time": 8492, "text": "So if you're going to use binaural beats, which should definitely be used with headphones, and there are a number of free apps out there and sources, 40 Hertz seems to be the frequency that best supports the brain shifting into a particular mode of focus."}, {"time": 8506, "text": "Sorry, can you give us some binaural beats?"}, {"time": 8509, "text": "Yeah, so you're going to look for, you'd want to find an app that offers 40 Hertz."}, {"time": 8514, "text": "I think Brainwave allows you to slide bar up to the particular frequency that you want."}, {"time": 8522, "text": "And I should say that there are other frequencies that are interesting, but 40 Hertz binaural beats seems to be the one that there's the most quality research on."}, {"time": 8531, "text": "So it's like a beat, but you're saying there's a lot of mixed science on the white noise and brown noise."}, {"time": 8539, "text": "You really should be doing this with headphones because binaural beats are best accomplished by feeding two different frequencies to the two ears."}, {"time": 8546, "text": "And then you have what's called this brainstem area that reads out what are called interaural time differences."}, {"time": 8550, "text": "And then it extracts the delta essentially."}, {"time": 8553, "text": "Turn it up."}, {"time": 8553, "text": "And then in other things that can enhance focus."}, {"time": 8561, "text": "So, you know, the pharmacology around this is pretty interesting."}, {"time": 8564, "text": "Things that tickle the dopamine pathway and the acetylcholine pathway, they work."}, {"time": 8568, "text": "There's your Ritalin, your Adderals, your Modafinils, which are prescription."}, {"time": 8571, "text": "And there's a lot of non prescription use of those prescription drugs."}, {"time": 8575, "text": "Not so much in my generation, but in people 35 and younger, you know, I hear all the time from day traders and programmers and stuff and kids that play video games, a lot of Ritalin Adderall use."}, {"time": 8587, "text": "I think that unless it's prescribed by a doctor for a specific purpose of ADHD, I don't think people should go that route, frankly."}, {"time": 8592, "text": "Hits the dopamine system way too hard."}, {"time": 8595, "text": "Also has a number of negative effects on sexual side effects, all sorts of things that you just wouldn't want."}, {"time": 8601, "text": "There are a few compounds like alpha GPC, 300 milligrams to 600 milligrams of alpha GPC with a cup of espresso."}, {"time": 8608, "text": "If you're well rested, you're like a laser for 90 minutes, maybe two hours, but then it's going to taper off and you have to just recognize that."}, {"time": 8617, "text": "And then there's this whole world of nootropics now and people trying to figure out the racetams, paracetams and phenol ethylamine combined with this."}, {"time": 8625, "text": "And, you know, it's not quite in the place where you'd like it to be."}, {"time": 8628, "text": "There are a few companies that are doing this better than others."}, {"time": 8630, "text": "We talk about some of these on the podcast, but I would always start with behavioral tools and then consider pharmacology."}, {"time": 8637, "text": "And then I suppose the other thing for focus is there are these, this is a little more esoteric, but we cover this in an episode on workplace optimization."}, {"time": 8647, "text": "Where you place your screen is important."}, {"time": 8649, "text": "Staring down at a screen is not going to be as effective as placing it at eye level or above you."}, {"time": 8655, "text": "When the eyes are up, literally when your eyes are directed forward or up, the brainstem centers for alertness are activated."}, {"time": 8661, "text": "When your eyes are down, it's actually you're sort of, it's like being pulled under water a little bit in the autonomic arousal sense."}, {"time": 8667, "text": "It's your closing your eyes is one, it reflects the brainstem centers that are active becoming less, or for alertness, excuse me, becoming less active."}, {"time": 8705, "text": "Whereas there's something called the cathedral effect, which is when you work in an outdoor environment or a high ceiling environment, it lends itself to kind of pun intended, kind of loftier ideas and more creativity."}, {"time": 8717, "text": "And that probably has to do with the fact that there's a natural tendency, a reflex to expand your visual field in these high ceiling environments."}, {"time": 8725, "text": "Expansion of the visual field changes the way the brain works in the time domain."}, {"time": 8731, "text": "Your engineering and biology oriented listeners will understand this and music."}, {"time": 8737, "text": "For those that don't, the best way to think about it is when you have a narrow focus portrait mode on your phone or you're very alert, you are fine slicing life in time."}, {"time": 8747, "text": "It's like a, think of it as a high frame rate, like you're shooting in slow motion."}, {"time": 8752, "text": "When you have a, when you dilate your view, you're taking bigger time bins."}, {"time": 8758, "text": "And that one way to just let this hopefully land home is that if you've ever had a really exciting day or podcast interview or experience of any kind, your system is flooded with dopamine and norepinephrine, alertness and motivation, all this excitement."}, {"time": 8773, "text": "It seems like it goes by very, very fast."}, {"time": 8775, "text": "And yet when you think back to that, it seems like a lot happened."}, {"time": 8779, "text": "This happened and that happened."}, {"time": 8780, "text": "Now think about waiting in the doctor's office in a blank waiting room with no interesting art on the walls."}, {"time": 8786, "text": "It feels like it goes by very, very slow."}, {"time": 8789, "text": "Dopamine and norepinephrine are at all time low."}, {"time": 8791, "text": "And yet when you think back on that experience, it's as if nothing happened because you were parsing time differently."}, {"time": 8799, "text": "So those are the roughly the tools and the neurochemicals around time perception and the time domain."}, {"time": 8804, "text": "There's a wonderful book, I'm forgetting the title, so wonderful I forget the title, by Dean Bodo Mano from UCLA, but I think it's called The Brain is a Time Machine that talks about this expansion and contraction of the time domain and what you can do to leverage it for work and creativity focus and so on."}, {"time": 8821, "text": "Yeah, it's fascinating that I think one way to define focus for me is the experience, the feeling of focus is losing track of time, is getting to a place where you're no longer operating in time."}, {"time": 8837, "text": "Well, and you mentioned being kind of cramming for something where you'll release a lot of adrenaline."}, {"time": 8844, "text": "And it is true, you can get a lot done under pressure because of the way that you're slicing time."}, {"time": 8849, "text": "You don't actually have more time."}, {"time": 8852, "text": "It's that you're finally in a brain state that lends itself well to parsing information really quickly."}, {"time": 8857, "text": "Now, if we ramp up your level of stress enough, it's definitely, it's a more or less normal distribution."}, {"time": 8864, "text": "We get you stressed enough, it's hard to remember anything, you're not parsing time well."}, {"time": 8867, "text": "But in that middle range, almost every study shows that the higher levels of autonomic arousal, meaning norepinephrine, adrenaline in your system, the more effective you are at things."}, {"time": 8877, "text": "And we always hear stress and adrenaline, it's just bad, bad, bad."}, {"time": 8880, "text": "But my colleague, Ali Krom at Stanford has done these beautiful studies where if you just educate people on how adrenaline makes them sharper thinkers, they become sharper thinkers."}, {"time": 8891, "text": "If you educate them on the fact that stress makes your cognition worse, their cognition gets worse."}, {"time": 8896, "text": "This is why I don't wear a sleep tracker."}, {"time": 8898, "text": "If you tell people they slept poorly, your recovery score sucks, they naturally perform less well the next day than if you tell them your recovery score is high."}, {"time": 8906, "text": "And so I don't have anything against those companies, but in fact, we use some of their technology, can be very useful in certain contexts, but you want to determine your mindset around these things."}, {"time": 8917, "text": "And if you tell yourself, hey, deadlines make me sharp, pressure makes me sharp, you will perform better."}, {"time": 8923, "text": "So stress and anxiety, what is that?"}, {"time": 8928, "text": "And can it be leveraged for good?"}, {"time": 8931, "text": "Absolutely, look, whether or not you get into a cold ice bath or a hot sauna so hot you want to get out, or you get hit square in the face with something over text that you really didn't want to hear or see, it's adrenaline."}, {"time": 8946, "text": "It's just adrenaline."}, {"time": 8947, "text": "And so your subjective readout of that and what it means is really important."}, {"time": 8951, "text": "And you can just channel that."}, {"time": 8953, "text": "Well, you can, if you agree with the following statement, which I do, and many people do because the data support it, which is Allie Crum's statement, not mine, which is she directs the mind body lab at Stanford."}, {"time": 8964, "text": "She's brilliant, by the way, brilliant Harvard trained, Yale trained, trained licensed clinical psychologist, also a tenured professor at Stanford."}, {"time": 8971, "text": "She's a Olympian, no, excuse me, a division one athlete in gymnastics and martial arts."}, {"time": 8979, "text": "And her dad is a long time martial arts trainer, who's done work with special forces and he's an amazing human being and very humble, very kind, lovely woman and professor scientist."}, {"time": 8990, "text": "She says, anything that you do and experience, but especially stress is the consequence of that thing and what you believe about that thing."}, {"time": 9001, "text": "And so if you consume a lot of information about the powers of stressful states to bring out your best, you will perform better."}, {"time": 9009, "text": "If you consume a lot of information about the power of stress to cripple you, you will perform worse."}, {"time": 9015, "text": "There's absolutely no question, the data are striking."}, {"time": 9018, "text": "And this is not growth mindset."}, {"time": 9020, "text": "This is just simply what do you believe about stress based on the dominant knowledge that you're consuming about it."}, {"time": 9028, "text": "So that's why it's fun to watch David Goggins, here we go again, David or Jocko or Joe or someone put, or Cam Haynes put out this information about, or Ryan Hall who ran for Stanford and then now is like into the power lifting thing and running."}, {"time": 9043, "text": "And there are others too, of course."}, {"time": 9045, "text": "When you start to consume a lot of that information, it's not just inspiring, it actually changes your perception of what your own stressful states mean."}, {"time": 9054, "text": "You can actually get better from stress if you're in the ocean of knowledge that stress grows you."}, {"time": 9060, "text": "If you're living in the ocean of knowledge, I was seeing like a pool in the summer, you got the kiddie pool, the kids all peeing in it, presumably."}, {"time": 9068, "text": "And you got the diving thing, you got the high dive and all that."}, {"time": 9070, "text": "If you believe that the experience of belly flopping off the high dive is gonna make you a better diver, in some sense, at least in this analogy, it will."}, {"time": 9080, "text": "Whereas if you feel that it's just the most embarrassing thing ever, and it's gonna cripple your ability to get out in the dive in front of anybody ever again, well, you're right about that too."}, {"time": 9091, "text": "Yeah, we actually talked with Carl about depression, all those kinds of things that there could be these, what are commonly seen as negative journeys, they could be, when reframed, can be used."}, {"time": 9106, "text": "You know, one of the reasons I enjoy our friendship so much is that you bring this Russian thing, which I don't really understand it at a deep level, how could I, I'm not Russian, but this mindset like that there's pain in life."}, {"time": 9118, "text": "When I watched that Hedgehog in the Fog cartoon, I thought, no wonder Russians call it the way they do."}, {"time": 9125, "text": "This is the most, it's so sad, it's beautiful in Sabbath, it's so sad."}, {"time": 9128, "text": "Whereas out here, it's like Sesame Street, and my mother would not let me watch Sesame Street when I was a kid."}, {"time": 9135, "text": "She thought it was too chaotic."}, {"time": 9138, "text": "She was like, it's too chaotic."}, {"time": 9139, "text": "Too many things going on."}, {"time": 9140, "text": "Captain Kangaroo, we were allowed, and then Mr. Rogers, we were allowed."}, {"time": 9144, "text": "I never really liked shows, I liked doing things outside in the yard."}, {"time": 9149, "text": "I was trying to trap all the animals, I didn't wanna watch stuff on TV."}, {"time": 9152, "text": "But Hedgehog in the Fog is enough to turn any kid into a thinker and a philosopher and a poet."}, {"time": 9160, "text": "I fell in love with this when you showed, look, it even walks with its arms behind its back."}, {"time": 9164, "text": "So for people who don't know, and we're watching little clips here to get into, and it's a hedgehog that is wandering about in this fog at night, and."}, {"time": 9177, "text": "Can't even see a lamp."}, {"time": 9179, "text": "The fog is so dense."}, {"time": 9180, "text": "There's a feeling of searching."}, {"time": 9183, "text": "And then there's a horse that speaks from a distance."}, {"time": 9188, "text": "Words of wisdom."}, {"time": 9189, "text": "Some people actually told me that they believe that's God."}, {"time": 9192, "text": "That's supposed to represent God."}, {"time": 9195, "text": "I always thought it was a motherly voice, or a voice."}, {"time": 9198, "text": "A voice of conformity that wants you to return to safety."}, {"time": 9203, "text": "And here's the hedgehog is searching for something that's in him for the unknown, to explore the unknown."}, {"time": 9212, "text": "And ultimately, as it, as the cartoon unrolls, it's, he discovers a friend in a bear."}, {"time": 9223, "text": "And he also discovers a lifetime passion for looking up at the stars, and the curiosity of exploring what is up there."}, {"time": 9230, "text": "And I see that as science, as exploring the mystery."}, {"time": 9235, "text": "And also I see that as brave to explore the mystery given all the uncertainty all around you."}, {"time": 9241, "text": "But there is a melancholy, the whole sound of it, the feel of it, the look of it."}, {"time": 9246, "text": "It was, it just captures both the melancholy and the wonder of childhood."}, {"time": 9254, "text": "Which is like, there's a loneliness to it."}, {"time": 9257, "text": "Like, nobody understands me."}, {"time": 9261, "text": "That's there, that children can feel."}, {"time": 9265, "text": "Because you're trying to figure out."}, {"time": 9267, "text": "That's my favorite character right there."}, {"time": 9268, "text": "I love the owl."}, {"time": 9270, "text": "The owl shows up every once in a while."}, {"time": 9276, "text": "There's non sequitur."}, {"time": 9277, "text": "It means you're interested 70% of the time."}, {"time": 9279, "text": "The other 30%, you're just an asshole."}, {"time": 9281, "text": "So you have to figure out which."}, {"time": 9283, "text": "So I'm told."}, {"time": 9285, "text": "There's non sequitur parts in this cartoon."}, {"time": 9287, "text": "It's voted as one of the greatest cartoons of all time."}, {"time": 9289, "text": "Short, short little films, documentary filmmakers."}, {"time": 9292, "text": "So it is, you know, in the Soviet Union, in a lot of sort of authoritarian regimes, there's channels to communicate difficult ideas to people."}, {"time": 9307, "text": "And you figure out those channels."}, {"time": 9308, "text": "And in the Soviet Union, one of those channels was children's cartoons."}, {"time": 9313, "text": "So you're actually, they're very much for adults."}, {"time": 9345, "text": "But they have an intelligence."}, {"time": 9348, "text": "And I think that you treat them like morons and they're gonna behave like morons."}, {"time": 9353, "text": "You treat them as, you know, people who can consume information and make sense of it in their own way."}, {"time": 9360, "text": "And that's what they're gonna do."}, {"time": 9362, "text": "They have a seriousness of looking at the world."}, {"time": 9365, "text": "I love people that talk with children like they're adults."}, {"time": 9370, "text": "Well, like, here's if you're talking to a mini Einstein, because you're like really, they're asking some big questions."}, {"time": 9377, "text": "And I think, I mean, people sometimes speak of me in this way."}, {"time": 9383, "text": "Like, how dumb is this childlike person?"}, {"time": 9386, "text": "But like, no, there's intelligence in these dumb, simple questions that a child asks."}, {"time": 9392, "text": "And I always love those questions, the simplicity, but also the depth of those questions."}, {"time": 9400, "text": "The reason I started watching your podcast was you did an episode early on with Ray Dalio."}, {"time": 9405, "text": "And the first, maybe the first, but a question that you definitely asked him was you just said, what is money?"}, {"time": 9413, "text": "And his answer was fantastic."}, {"time": 9415, "text": "It's a superb question and he gave a superb answer."}, {"time": 9418, "text": "And I never would have thought to ask that question."}, {"time": 9422, "text": "And it's the question."}, {"time": 9424, "text": "And it was the question to tee things off with."}, {"time": 9427, "text": "So simple questions that get right to the heart of the matter, you know, and kids aren't often putting the same cultural filters and you know, kids generally aren't concerned about getting canceled either."}, {"time": 9443, "text": "So they'll ask the question that no one else is willing to ask."}, {"time": 9446, "text": "And they're not concerned about how dumb the question sounds."}, {"time": 9450, "text": "I find the most fascinating questions are just really, really simple."}, {"time": 9453, "text": "And it is a bit embarrassing to ask those simple questions of like, what is anything?"}, {"time": 9460, "text": "You're asking them for all of us, so please ask them."}, {"time": 9463, "text": "I think that question, what is money, is crucial."}, {"time": 9466, "text": "And I think the simple questions are the most, obviously the most interesting."}, {"time": 9471, "text": "I'm gonna ask you about, you had awesome podcasts."}, {"time": 9473, "text": "I mean, I can ask you questions about basically all your podcasts."}, {"time": 9476, "text": "People should definitely listen to the Huberman Lab, but with Andy Gap and the conversation, you talked about strength and muscle building and all that kind of stuff."}, {"time": 9483, "text": "He's an encyclopedia."}, {"time": 9485, "text": "And he also works with a lot of UFC fighters and he works with, he has a lab that includes a gym."}, {"time": 9491, "text": "And so he works on endurance and powerlifting and also hypertrophy training, et cetera."}, {"time": 9496, "text": "But he also does muscle biopsy."}, {"time": 9499, "text": "So he runs the full spectrum and he's a full tenured professor and he does all this stuff."}, {"time": 9505, "text": "So he's a really unique person in this whole fitness landscape because there are a lot of PTs out there."}, {"time": 9513, "text": "There are a lot of kinesiologists."}, {"time": 9514, "text": "There are a lot of people studying nutrition and sports training."}, {"time": 9517, "text": "But I think he has the, among the people out there, he's at least in the top five, probably within the top three of people that really have their arms around the full extent of what's possible with training."}, {"time": 9530, "text": "And he works with the UFC Performance Center."}, {"time": 9533, "text": "Well, I mean, he just said a very systematic way of describing things that was really nice."}, {"time": 9538, "text": "You know, skill, speed, power, strength, hypertrophy, so muscle mass, right?"}, {"time": 9545, "text": "Endurance, all kinds of, and then the philosophical of like adaptation, how to overload stuff, all that very, is there stuff, I'll ask you about ice bath and sauna, which was surprising to me there."}, {"time": 9556, "text": "Is there stuff you took away from that conversation, like principles about how to get strong, how to build muscle mass, that like broadened and deepened your understanding of that task?"}, {"time": 9573, "text": "And I'll do these in bullet points because if people want the logic behind them and the mechanism, they can listen to that episode."}, {"time": 9578, "text": "It's a really good episode."}, {"time": 9579, "text": "I'll start with heat and cold really quickly and just say that avoid cold immersion."}, {"time": 9584, "text": "So ice baths and being in cold water up to the neck, uncomfortably cold within the four hours after a training session that's designed to evoke an adaptation, either endurance, hypertrophy, or strength, because the inflammation that you experienced from a hard endurance workout or from a hard strength or a hard hypertrophy workout is the stimulus that you're going to adapt to."}, {"time": 9607, "text": "The cold water immersion reduces inflammation and can short circuit some of that."}, {"time": 9612, "text": "After four hours, you're probably okay, but if you can do it a different day or you can do it before those sessions, that's better."}, {"time": 9618, "text": "Heat, however, can be done immediately after training and it's probably beneficial because of the way that it dilates the vascular system and perfuses the muscles and ligaments, et cetera, with more nutrients."}, {"time": 9629, "text": "And I should just mention that was a crucial piece of information."}, {"time": 9633, "text": "It's a little bit surprising."}, {"time": 9634, "text": "Was it surprising to you?"}, {"time": 9636, "text": "Because I actually, the way I posed the question to him about cold was I hear that getting into an ice bath or a cold water immersion after training can reduce hypertrophy, but I'm guessing it's not that big of a deal."}, {"time": 9645, "text": "And he said, no, it is a big deal."}, {"time": 9647, "text": "It will short circuit your progress."}, {"time": 9648, "text": "Now, for people that are only interested in performance, who are doing a lot of workouts and trying to recover, but not trying to grow muscle, get stronger, or build endurance, then it makes sense to do cold."}, {"time": 9657, "text": "Like skill development or something."}, {"time": 9658, "text": "Skill development, or you're an athlete in season."}, {"time": 9661, "text": "So you have to, what's so great about Andy is he really points out the specific ways to train given your specific goals."}, {"time": 9668, "text": "So if we're getting swole, stay out of the ice bath after a workout, there you go."}, {"time": 9672, "text": "Lex is always making fun of the meatheads."}, {"time": 9675, "text": "I put myself in the meathead category only because I don't do a real sport now."}, {"time": 9679, "text": "I work out and I run, which is working out."}, {"time": 9681, "text": "I'm an aspiring meathead, okay, so."}, {"time": 9684, "text": "One of these days I'm going to get back to Jiu Jitsu, or I'm going to get to Jiu Jitsu."}, {"time": 9687, "text": "Now, in terms of training, he has this beautiful three by five concept for strength."}, {"time": 9691, "text": "Pick three exercises, compound exercises, multi joint movements, do them for, do three to five exercises for three to five repetitions per set, rest three to five minutes, and do that three to five times per week."}, {"time": 9709, "text": "And for details, you can, again, look to the episode."}, {"time": 9711, "text": "It's timestamped."}, {"time": 9711, "text": "But what's interesting about this is three to five times a week is a lot for a muscle group."}, {"time": 9715, "text": "Squatting five times a week for five reps, meaning you're working pretty heavy, meaning you're close to failure, but not failure for strength generally."}, {"time": 9723, "text": "What Andy taught me is that people who are training mostly for strength can do these low rep type regimens frequently because most of the adaptation is neural."}, {"time": 9736, "text": "And because you're not pushing to failure, in most cases, you don't get that sore."}, {"time": 9741, "text": "And so it's the motor neurons getting the muscle fibers to contract more intensely or with more efficiency in other ways that's leading to these strength gains."}, {"time": 9752, "text": "And this is why power lifters can train every day or five days a week or four days a week."}, {"time": 9757, "text": "For hypertrophy, I learned from Andy that the repetition range can be pretty broad."}, {"time": 9764, "text": "You're thinking anywhere from six to 30 repetitions."}, {"time": 9768, "text": "You should do 10 sets per muscle group per week, maybe even a bit more."}, {"time": 9773, "text": "So high volume."}, {"time": 9774, "text": "High volume, but you have to go to failure or beyond in order to stimulate growth."}, {"time": 9781, "text": "Why does it work at such a great range of repetitions?"}, {"time": 9783, "text": "Well, there apparently are three ways that you stimulate hypertrophy and maybe more."}, {"time": 9788, "text": "One is tissue micro damage to the tissue."}, {"time": 9791, "text": "The other is through some sort of tension based changes in the molecular gene programs of cells that lead to protein synthesis that are distinct from damage."}, {"time": 9801, "text": "And the other are metabolic effects of like high repetition work of super fusion of the muscle with blood."}, {"time": 9806, "text": "We know that third category exists because people are now doing this blood restriction training where they cuff off a muscle and they'll use a really lightweight."}, {"time": 9812, "text": "I've done these before."}, {"time": 9813, "text": "You can use a five pound weight and do curls with this and you are in pain and the muscles are swelling up with blood."}, {"time": 9819, "text": "It does lead to hypertrophy, but in general, you're not sore."}, {"time": 9822, "text": "You're not doing tissue damage."}, {"time": 9824, "text": "And by the way, don't just turn to get off a muscle cause you have to use the proper cuffs because you need the blood still to flow in one direction."}, {"time": 9830, "text": "You can't just cinch it off or you'll potentially kill yourself if you get a clot or you do it wrong."}, {"time": 9836, "text": "So get the appropriate cuffs, they're out there."}, {"time": 9839, "text": "And then for endurance, I learned something really cool."}, {"time": 9841, "text": "So I work out basically, I go to the gym every other day on average, three or four days a week I do that, but generally not two days in a row to work out."}, {"time": 9849, "text": "Next day I'll do cardio next day."}, {"time": 9851, "text": "And the cardio for me is always a 30 to 45 minute jog kind of zone two cardio."}, {"time": 9856, "text": "Andy informed me that to build endurance while building strength and maintaining some muscle size or even building muscle size, I would be wise to take one day a week and add to that all out max heart rate work for 90 seconds at least."}, {"time": 9874, "text": "So do 90 seconds then rest and then maybe do another 90 second all out sprint."}, {"time": 9878, "text": "I almost missed my flight going from Los Angeles to Austin."}, {"time": 9881, "text": "I did that all out sprint in the airport yesterday."}, {"time": 9884, "text": "So I actually can think it's done for me."}, {"time": 9887, "text": "So there was a sprinting Dr. Huberman throughout."}, {"time": 9891, "text": "With three bags."}, {"time": 9893, "text": "Cause I travel, generally I'll travel with too much stuff."}, {"time": 9897, "text": "I love how you were probably running late for a flight and use that as an opportunity to explore."}, {"time": 9902, "text": "Well, I was doing it."}, {"time": 9902, "text": "I was thinking to myself, okay, Andy, that's a 90 second sprint."}, {"time": 9905, "text": "Cause I got to the security line."}, {"time": 9907, "text": "I finally got TSC."}, {"time": 9908, "text": "But that's for better, that's for extending endurance?"}, {"time": 9911, "text": "That's for, yeah."}, {"time": 9912, "text": "It actually has some carry over effects on endurance if you're doing the other stuff."}, {"time": 9916, "text": "And then he also said one day a week to do this workout and I haven't done it yet."}, {"time": 9919, "text": "Maybe we do it tomorrow."}, {"time": 9920, "text": "Which is you run a mile, you ask yourself, how long did that take?"}, {"time": 9926, "text": "Let's say it took eight minutes."}, {"time": 9928, "text": "Then you walk or rest for eight minutes."}, {"time": 9930, "text": "Then you run another mile as fast as you can."}, {"time": 9933, "text": "And then you rest for the equivalent period."}, {"time": 9934, "text": "And you do that one to three times once per week."}, {"time": 9938, "text": "So you do."}, {"time": 9938, "text": "And so as an all around fitness program, it make, you could collapse this into something where you say, okay, you're gonna work out with the weights for about an hour every other day."}, {"time": 9948, "text": "Maybe take two days off every once in a while."}, {"time": 9950, "text": "You're going to do six to 15 repetitions."}, {"time": 9953, "text": "You're gonna push to failure on some of those, not all, because some of those are designed to build more strength."}, {"time": 9958, "text": "You're not going to failure in heavier."}, {"time": 9960, "text": "Some are designed for hypertrophy, higher rep and going to failure."}, {"time": 9963, "text": "And then on off days, you're gonna jog for 30 to 45 minutes."}, {"time": 9967, "text": "But for two days a week, you're either at the end of your jog or whatever, you're gonna do some all out sprints for 90 seconds and then rest and repeat."}, {"time": 9977, "text": "And for another day, you're going to do these mile repeats."}, {"time": 9982, "text": "That's a pretty large chunk of exercise movement."}, {"time": 9987, "text": "But if you kind of thread through the middle of all that, what you end up with is some decent strength, building protocols, some decent hypertrophy, some cardiovascular training that establishes the so called A base or a so called base."}, {"time": 10000, "text": "So you're not gonna get really good at anything."}, {"time": 10002, "text": "You're not gonna become a marathoner this way, an optimizing marathon."}, {"time": 10005, "text": "You're not gonna optimize powerlifting."}, {"time": 10007, "text": "You're not gonna optimize hypertrophy."}, {"time": 10008, "text": "But for the typical person, 75% of people, 75% of the time, they want some muscle, they want some strength, they want some endurance, and they want the capacity to sprint to the security gate without leaving a lung in the terminal."}, {"time": 10021, "text": "So it's like functional stuff, like your life going up the stairs is easier, moving about, all that kind of just regular life."}, {"time": 10028, "text": "And I should mention that cold showers after training don't seem to short circuit the training effect to the same extent that immersion in cold water does."}, {"time": 10039, "text": "And that really speaks to the fact that cold showers, even though they can provide some of the adrenaline for the mental effects of like, oh, I have a lot of adrenaline in my system from a cold shower and I can remain calm."}, {"time": 10048, "text": "There's utility to that."}, {"time": 10050, "text": "It's not going to have the same metabolic effects or other positive effects that cold water exposure has been shown to have."}, {"time": 10056, "text": "And that's unfortunate because most people have access to cold showers, not everyone has access to a cold dunker."}, {"time": 10061, "text": "Or an ice dunk."}, {"time": 10062, "text": "But here in Austin, you have this place, and no, they don't pay me to say this, but I always like going to this place whenever I'm in town, this place, Kuya."}, {"time": 10070, "text": "And they've got a sauna and a couple ice baths."}, {"time": 10072, "text": "And they even have those salt tanks that you can float on the surface."}, {"time": 10074, "text": "Do they have ice baths there?"}, {"time": 10075, "text": "They have cold water immersion, it's pretty cold."}, {"time": 10079, "text": "Still haven't done an ice bath."}, {"time": 10080, "text": "I need to, yeah, I need to."}, {"time": 10082, "text": "You're Russian, you'll probably get in and you won't even know."}, {"time": 10084, "text": "Yeah, what is this?"}, {"time": 10085, "text": "What's the big deal here?"}, {"time": 10086, "text": "Exactly, or people pay for this."}, {"time": 10088, "text": "I did a post, right, of you as a baby."}, {"time": 10091, "text": "You know, I had to go deep to get that photo of Lex in a bassinet, in the snow."}, {"time": 10097, "text": "Because in Russia, they actually did this for a long time."}, {"time": 10100, "text": "They thought that it would, and indeed it does build the immune system to expose babies to the cold."}, {"time": 10105, "text": "I still don't know where you got that photo."}, {"time": 10107, "text": "I didn't know you were able to find exactly the right, it was great."}, {"time": 10111, "text": "It was great research."}, {"time": 10112, "text": "You didn't have a tie on, but you had all the look and seriousness that you do now."}, {"time": 10116, "text": "So it's clearly nature nurture, clearly you were born with that."}, {"time": 10119, "text": "What about sauna?"}, {"time": 10120, "text": "He does say that it's good to do heat."}, {"time": 10122, "text": "So there are three ways you can do sauna that I can just toss out as like briefings."}, {"time": 10126, "text": "If you want to get a really big growth hormone release for sake of metabolism, fat loss, you're training really, really hard in jujitsu and you want to recover, you don't want to sauna too often because the study that identified this massive 16 fold increase in growth hormone, they had people do this, it's crazy."}, {"time": 10144, "text": "They got into, okay, temperatures are 80 to 100 degrees centigrade."}, {"time": 10149, "text": "So that's 176 degrees Fahrenheit to 212 degrees Fahrenheit for five to 30 minutes is the typical ranges that people work in in these research studies."}, {"time": 10160, "text": "For maximum growth hormone release, don't do sauna more than once a week, but get into the sauna for 30 minutes, as hot as you can safely tolerate."}, {"time": 10169, "text": "So probably for you, that'll be 210 because I suspect you'll be on the high end of things."}, {"time": 10174, "text": "Then get out for five to 10 minutes, no cold exposure, get back in the sauna for 30 minutes."}, {"time": 10180, "text": "Then they had them do it again, out for five minutes, back for 30 minutes, out for five minutes, back for three minutes."}, {"time": 10185, "text": "They had them do two hours of sauna exposure to get that growth hormone release."}, {"time": 10191, "text": "Now for the reduction in likelihood of dying of a cardiovascular event stroke or otherwise, the more often you do sauna, the better."}, {"time": 10199, "text": "So if you look at all cause mortality or death due to cardiovascular events, and you look at sauna use frequencies using the same parameters, 80 to 100 degrees centigrade, one to seven times per week, basically the more often you get into the sauna for 30 minutes across the week, so 30 minutes a day is better than four times a week."}, {"time": 10217, "text": "Four times a week is better than two times a week and two times a week is better than one."}, {"time": 10221, "text": "And the reductions in mortality are really impressive."}, {"time": 10225, "text": "27, if you get into the sauna the way I just described, not the two hours a day, but 30 minutes twice a week or three times per week, you reduce the likelihood of dying of a cardiovascular event by 27%."}, {"time": 10238, "text": "If you do it four or more times per week, you reduce the probability of dying by 50% of a cardiovascular event."}, {"time": 10246, "text": "And in these studies, they rule out other things that people are doing, smoking."}, {"time": 10250, "text": "They even ask them, do you live in an apartment?"}, {"time": 10252, "text": "Are you in a happy relationship?"}, {"time": 10253, "text": "Like they evaluate other potentially confounding variables."}, {"time": 10257, "text": "Now for people that don't have access to a sauna, a hot water bath or hot tub is gonna be your next best bet."}, {"time": 10263, "text": "And if you don't have access to that, do like the wrestlers do, which is put on two sets of sweats and a hoodie and a stocking cap and wrap yourself in plastics underneath all that and go for a run, but please nobody die of hyperthermia."}, {"time": 10276, "text": "I mean, you can die of warming up too much."}, {"time": 10278, "text": "Is this experience pleasant or stressful in the way, so is it as stressful as an ice bath, for example?"}, {"time": 10288, "text": "People always ask how cold to make the ice bath or the cold water or the shower."}, {"time": 10293, "text": "You want it to be uncomfortably cold, meaning you want to feel like I really wanna get out, but you can safely stay in."}, {"time": 10299, "text": "And that's gonna vary by person and experience with it."}, {"time": 10302, "text": "Experience, yeah."}, {"time": 10303, "text": "With the sauna, it's the same thing."}, {"time": 10306, "text": "How hot to make it?"}, {"time": 10307, "text": "Well, don't kill yourself, obviously be smart."}, {"time": 10310, "text": "If you're pregnant, you shouldn't be doing this anyway, but it's very clear that what you need is the release of something called dinorphin."}, {"time": 10318, "text": "We have endorphin, which makes us feel good."}, {"time": 10320, "text": "It binds to these mu opioid receptors in the body."}, {"time": 10324, "text": "You have dinorphin, which is the terrible feeling that you get when you're in really hot temperatures."}, {"time": 10329, "text": "It's also the terrible effect that alcoholics feel when they are in withdrawal."}, {"time": 10334, "text": "You feel agitated, you wanna get out, it's really unpleasant."}, {"time": 10336, "text": "It's dinorphin binding to the so called kappa opioid receptor, that's what you're trying to trigger."}, {"time": 10342, "text": "When you do that, a number of things happen."}, {"time": 10344, "text": "You set off heat shock proteins that go repair broken proteins and misfolded proteins."}, {"time": 10349, "text": "It also makes it so that later endorphin binds its receptor more strongly."}, {"time": 10354, "text": "So when you have this uncomfortable experience in the heat, you literally feel better in real life when pleasurable events come on, when you experience them."}, {"time": 10364, "text": "In the same way, I like to say this, that when you get into a cold ice bath or cold shower, the increase in epinephrine and dopamine is two to 300%."}, {"time": 10374, "text": "These are huge increases and they last many hours."}, {"time": 10377, "text": "This is shown, because lately I've gotten a little bit of pushback on Twitter, which is interesting place."}, {"time": 10386, "text": "People say, well, that's just in mice."}, {"time": 10387, "text": "No, all the studies I just referred to are all done in humans, men and women, fairly broad age ranges."}, {"time": 10392, "text": "So you want to be uncomfortable in the cold."}, {"time": 10395, "text": "You wanna be uncomfortable in the heat."}, {"time": 10397, "text": "This is why I'm not a big fan of infrared saunas because they only go up to about 160, 170 degrees."}, {"time": 10402, "text": "Infrared light and far red light of all kinds has been shown to be beneficial for wound healing, acne, skin, eyes."}, {"time": 10409, "text": "There are even guys now putting on their testicles because it can increase testosterone and sperm production."}, {"time": 10414, "text": "Yeah, hormone release."}, {"time": 10416, "text": "Hormone release."}, {"time": 10417, "text": "But in terms of the sauna, you want that strong heat stimulus."}, {"time": 10421, "text": "Yeah, and that's when you crawl up to the 200 mark and so on."}, {"time": 10425, "text": "Whenever I'm in New York, and there's also one in San Francisco, although the one in San Francisco is clothing optional, just to warn people, there's a place called Archimedes Banya."}, {"time": 10432, "text": "Is there any scientific evidence that being naked is beneficial in the sauna?"}, {"time": 10437, "text": "Well, in certain contexts, it leads to childbirth."}, {"time": 10441, "text": "Okay, well, I'll have to read up on that."}, {"time": 10443, "text": "I read that somewhere."}, {"time": 10444, "text": "I suppose it's not required for childbirth, but in all seriousness, in New York, I'll go to a place called Spa 88, and actually, Khabib's picture is on the wall."}, {"time": 10454, "text": "He goes there."}, {"time": 10455, "text": "And that one, it's clothing."}, {"time": 10458, "text": "They require clothing."}, {"time": 10459, "text": "I only just say that because it can be a little bit of a shock to people sometimes if they kind of walk in there, a bunch of naked people, the one in San Francisco."}, {"time": 10465, "text": "If I go, I'm clothed, mostly because I run into coworkers or things like that."}, {"time": 10469, "text": "You know, I'm sort of more old fashioned in that way, I suppose."}, {"time": 10473, "text": "But... Do you like to wear clothes around coworkers?"}, {"time": 10477, "text": "Yeah, in general."}, {"time": 10477, "text": "Very old fashioned."}, {"time": 10478, "text": "Yeah, I mean, to me, it just seems like, you know, just be aware."}, {"time": 10481, "text": "But nonetheless, the Banyas have very hot saunas because they're Russian owned."}, {"time": 10486, "text": "And in New York, there's one on the Lower East Side, but the Spa 88 place, they have some saunas that the moment I get into those, I have a hard time catching a full breath."}, {"time": 10495, "text": "It burns."}, {"time": 10496, "text": "They've got a cold dunk that's like a shock."}, {"time": 10499, "text": "And then they've got a sauna, a wet sauna steam room that's a little mellower."}, {"time": 10502, "text": "So the nice thing about a Banya is you can kind of find your place."}, {"time": 10505, "text": "And then they do the plaza where they take the eucalyptus leaves and you can pay someone."}, {"time": 10510, "text": "And you basically, you cover your groin and then they beat you with the leaves."}, {"time": 10515, "text": "And it's supposed to bring the vasculature to the surface."}, {"time": 10517, "text": "I've only done it once."}, {"time": 10518, "text": "And frankly, I found it to be a little bit unnerving."}, {"time": 10522, "text": "I didn't really like the experience, but I'll try and get into a sauna as often as I possibly can, which is once or three times per week."}, {"time": 10530, "text": "And I try and do the cold exposure shower or immersion, but early in the day, cause it really wakes you up."}, {"time": 10537, "text": "One of my favorite things I've listened to, I wish there was a video, is listening to a bunch of stuff with Rick Rubin."}, {"time": 10545, "text": "And he did a thing with Tim Ferriss, like the Tim Ferriss podcast."}, {"time": 10549, "text": "I don't know if you've ever heard it, but he forced them to do, they did the podcast in a sauna."}, {"time": 10556, "text": "And I don't think at the time Tim Ferriss was adapted."}, {"time": 10561, "text": "If you're not heat adapted, it can be pretty stressful."}, {"time": 10563, "text": "And I mean, obviously the whole experience is stressful as somebody with microphones, like what is happening?"}, {"time": 10569, "text": "But I just love that Tim was vulnerable enough to kind of give themself over to whatever the hell this experience is."}, {"time": 10577, "text": "And I am just so happy that Rick like pushed that kind of idea and just let's do it."}, {"time": 10585, "text": "That's a very Rick Rubin kind of thing to do."}, {"time": 10587, "text": "And we must, like we must do this, this has to be done."}, {"time": 10591, "text": "A podcast that was done from a sauna continuously would be really interesting."}, {"time": 10595, "text": "Like you could call it like the pressure cooker or something."}, {"time": 10598, "text": "Oh, I mean like a regular podcast."}, {"time": 10598, "text": "Yeah, like you have to sit with your guests in the sauna or they have to sit in the sauna."}, {"time": 10603, "text": "That was one of the interesting things is it was a sad thing because I believe there's no video of that podcast, but you could tell there was a kind of, there was suffering and especially on Tim's part."}, {"time": 10616, "text": "It was like a degradation."}, {"time": 10618, "text": "He started over time not being able to put words together correctly, which he's very eloquent."}, {"time": 10625, "text": "And so you could see there's like, there's a struggle."}, {"time": 10630, "text": "Heat and cold pull you down from the inside."}, {"time": 10632, "text": "You have to, I mean, there's a reason why the screening process for, they call it SEAL training, but it's really screening and training involves cold waters."}, {"time": 10641, "text": "Cause if you're in the heat too long, you'll die or damage tissue."}, {"time": 10645, "text": "In cold, you can do it quite extensively before you die or damage tissue, but it is stressful."}, {"time": 10650, "text": "I was going to say one thing that I sometimes enjoy seeing these social media posts where people will get into the ice bath and they'll look really stoic."}, {"time": 10657, "text": "Like they're really tough, but actually that's the wimpy way to go through it."}, {"time": 10663, "text": "When you get into cold water, if you stay very still, you develop a thermal sheath around you that you're warming yourself."}, {"time": 10673, "text": "The really bold way is to get in and continue to sift your arms and legs."}, {"time": 10677, "text": "And it ends up feeling miserably colder."}, {"time": 10680, "text": "And then there's no sheath cause you're breaking up that thermal layer."}, {"time": 10684, "text": "And then when you get out, you'll notice a lot of people huddle or they'll put, or they'll grab the towel."}, {"time": 10689, "text": "In general, that's me."}, {"time": 10690, "text": "I'll get back, I'll get into the sauna."}, {"time": 10692, "text": "But if you really want to stimulate the big increases in metabolism, you stand out there and you dry off with arms extended in open air."}, {"time": 10700, "text": "And as that water evaporates off you, it is really cold, but your body is forced to activate a number of the warming programs related to metabolism."}, {"time": 10708, "text": "This is the beautiful work of a woman named Susanna Soberg, who's Scandinavian."}, {"time": 10712, "text": "She published this paper last year in Cell Reports Medicine."}, {"time": 10714, "text": "And so I call this the Soberg principle, which is if you're doing ice and heat for whatever reason, it doesn't matter if you end on heat or cold, but if you're using cold specifically to stimulate an increase in metabolism, end with cold."}, {"time": 10727, "text": "That's the Soberg principle."}, {"time": 10729, "text": "And with cold, if you're alternating, and then if you want to do it the tough way, you let the shivering, so you just stand out and let the water evaporate."}, {"time": 10739, "text": "Yeah, I mean, if you ever waded into a cold ocean, everybody's kind of like holding themselves in, if you really just, if you let yourself extend your limbs and move them around a bit so you break up that thermal layer, that's the tough way to do it."}, {"time": 10752, "text": "So when I see people on social media getting in and they're like really tough and trying to look hard."}, {"time": 10756, "text": "Yeah, you want to be moving around."}, {"time": 10757, "text": "Yeah, smiling, talking, moving around is way, way colder."}, {"time": 10762, "text": "Are you able to talk?"}, {"time": 10763, "text": "Can you do, so you suggest the podcast in the sauna."}, {"time": 10767, "text": "How about this?"}, {"time": 10768, "text": "I proposed this since I got choked."}, {"time": 10769, "text": "You want to do the next podcast?"}, {"time": 10771, "text": "I'll get to, so the folks from The Plunge, maybe you could bring Lex a plunge."}, {"time": 10775, "text": "He certainly deserves one."}, {"time": 10777, "text": "And we can go side by side coffin style, or we can face one another when we're doing it."}, {"time": 10782, "text": "Well, we said we should do each other's podcast."}, {"time": 10784, "text": "I mean, it'd be next."}, {"time": 10784, "text": "Well, I can't wait to have you back on."}, {"time": 10786, "text": "I mean, we only scratched the surface."}, {"time": 10787, "text": "Well, let's do at least part of the next Human Lab podcast either in the."}, {"time": 10791, "text": "I have a sauna and a cold plunge, so we could do it."}, {"time": 10793, "text": "Yeah, we could do."}, {"time": 10795, "text": "We do a sauna and a cold plunge version."}, {"time": 10797, "text": "I wonder how the recording works, if the recording."}, {"time": 10799, "text": "A bit of an echo in the sauna, but I'm sure we can take out the reverb."}, {"time": 10804, "text": "So Sergey wants to ask you about sex performance."}, {"time": 10809, "text": "Very journalistic, very hardcore hitting questions that we have here on the."}, {"time": 10813, "text": "Generally, or a specific."}, {"time": 10815, "text": "No, he has a certain problem he needs help with, no."}, {"time": 10818, "text": "Generally, you haven't done an episode on sex."}, {"time": 10821, "text": "Well, we did an episode early on, on sexual development."}, {"time": 10825, "text": "We've done them on optimizing testosterone and estrogen."}, {"time": 10827, "text": "And we touched a little bit on the, on libido and somewhat on sex performance, but not much."}, {"time": 10834, "text": "We did an episode on relationships, love and desire, where we touched on libido specifically."}, {"time": 10840, "text": "So just as a quick mention of something, a lot of people take SSRIs or antidepressants that can disrupt sexual function."}, {"time": 10847, "text": "There are a few compounds like maca root and punga ali and things like that, that at least in a few studies in humans have been shown to offset some of the sexual side effects."}, {"time": 10857, "text": "Now, in terms of sexual, and then the, sorry, the episode on sexual development was about how the brain and body become organized in certain ways, how the brain becomes organized if you have X chromosomes or Y chromosomes or et cetera."}, {"time": 10871, "text": "So early, early development."}, {"time": 10872, "text": "Early development mainly."}, {"time": 10873, "text": "And the effects of hormones later on that template."}, {"time": 10876, "text": "We will be doing a, I'm actually putting together a series on sexual health, everything from the menstrual cycle, which both men and women should understand, of course, understanding arousal, understanding, for instance, a lot of people don't realize this, but that orgasm is actually the consequence of activity in the sympathetic, meaning the stress arm of the autonomic nervous system."}, {"time": 10902, "text": "Whereas arousal is the consequence of the activity of the parasympathetic, the calming aspect of the autonomic nervous system."}, {"time": 10911, "text": "That's counterintuitive, right?"}, {"time": 10912, "text": "It's counterintuitive and it kind of works like a seesaw."}, {"time": 10915, "text": "I mean, there's arousal, then there's relaxation, then there's arousal, and then immediately after orgasm and in males ejaculation, what ends up happening is there's a rebounding of the parasympathetic nervous system which it leads to oftentimes people feeling very relaxed or falling asleep."}, {"time": 10931, "text": "So I'm going to do a short series on sexual health that will include stuff about sexual performance, but also some, I'm working on getting an expert guest who can talk about some of the neurologic changes that happen as a consequence of sexual activity."}, {"time": 10950, "text": "And we did an episode with a guy from UT Austin here, David Buss, who's an evolutionary psychologist, talking about, it went pretty deep into some of the typical and unusual dynamics of mating relation, whether or not people have kids or not and what impacts that, but we're going to do an episode on menopause, andropause."}, {"time": 10969, "text": "What's very surprising is I get a lot of questions about sexual health from the young male audience, which tells me that, well, here's what I think it reflects."}, {"time": 10980, "text": "I think that women, because of their menstrual cycles, early on start to talk to one another about changes in physiology and psychology as a function of this 28 day cycle that they all experience sooner or later."}, {"time": 10991, "text": "Males, there's less of a conversation and it usually arrives in code."}, {"time": 10995, "text": "People will say, hey, what should I take to increase my testosterone?"}, {"time": 10998, "text": "And I'll say, well, maybe nothing."}, {"time": 11000, "text": "You know, what are you specifically concerned about?"}, {"time": 11003, "text": "And then over time, if you pull on those threads a little bit, you know, you get your answer."}, {"time": 11008, "text": "Sometimes I'll just get a direct question."}, {"time": 11010, "text": "But I think that the psychology of all this and in terms of jealousy and the terms of notions of roles and relationships is very dynamic right now."}, {"time": 11020, "text": "And I'm fascinated by this."}, {"time": 11021, "text": "So we're going to do a four episode series."}, {"time": 11023, "text": "What about sexual fantasy?"}, {"time": 11026, "text": "What, to get Freudian for a second, what role does sexual fantasy have in the human condition?"}, {"time": 11032, "text": "There's a book called The Erotic Imagination."}, {"time": 11036, "text": "It's a very psychoanalytic book written by a psychoanalyst that talks about how, well, here's the uncomfortable reality."}, {"time": 11043, "text": "Freud was at least right about one thing, which is that the brain circuitry that you used to develop attachments to your caregivers, mother and father or other caregivers, do not disappear when you hit puberty."}, {"time": 11056, "text": "They are repurposed for romantic and sexual relations."}, {"time": 11060, "text": "And so this is why the whole notion of anxious attached and secure attached, you know, stems from childhood attachment patterns, but it carries over to romantic relationships."}, {"time": 11069, "text": "So that the relationship with your mother has."}, {"time": 11072, "text": "And father."}, {"time": 11073, "text": "And father has a, and probably other close people to you in your young age has a secondary, tertiary, some kind of ripple effect on how your sexuality developed."}, {"time": 11084, "text": "Like what fantasies you might have, all that."}, {"time": 11086, "text": "No, without question."}, {"time": 11087, "text": "And of course, early experiences too, and traumatic or positive or neutral."}, {"time": 11091, "text": "The thing that's really important to remember though, in this transfer of circuitry from one role to another is that, and it's certainly consistent with psychoanalysis that gender is interchangeable, sex is interchangeable."}, {"time": 11104, "text": "So for instance, let's say you had a wonderful relationship."}, {"time": 11107, "text": "Let's say this, let's take a hypothetical person, okay?"}, {"time": 11110, "text": "I'm truly not referring to myself."}, {"time": 11112, "text": "Let's take a young woman who has a wonderful relationship with her father and a just absolutely terrible abusive relationship to her mother."}, {"time": 11120, "text": "Just for sake of example."}, {"time": 11122, "text": "She then goes into adulthood and she is drawn to very abusive men."}, {"time": 11128, "text": "Not always, but let's just use in this example."}, {"time": 11132, "text": "And the dynamic is exactly the same as the dynamic she had with her mother."}, {"time": 11136, "text": "That's actually a common occurrence."}, {"time": 11137, "text": "Even though in this context, she's heterosexual, she's romantically attracted to men."}, {"time": 11141, "text": "What is seen over and over again is that the dynamic with one parent can be transferred onto a romantic dynamic, but it doesn't have to be, you know, that if it was with the mother, then it only has to do with relationships to women."}, {"time": 11153, "text": "So gender is interchangeable because these circuitries are presexual."}, {"time": 11158, "text": "They're laid down in our brain before the brain has any concept of sexual interactions."}, {"time": 11164, "text": "It's preverbal, excuse me."}, {"time": 11166, "text": "And so there are a lot of interesting examples and data to support this."}, {"time": 11171, "text": "The book Attached is a pretty interesting book by two psychologists."}, {"time": 11176, "text": "One I think is at Columbia University that talks about how childhood dynamics carry over to adult romantic attachment."}, {"time": 11185, "text": "So as you can tell, I get pretty alert in response to these questions."}, {"time": 11189, "text": "I get a lot of them relate in this domain."}, {"time": 11192, "text": "They have a lot of impact on people and they're wondering about, they wanna learn."}, {"time": 11195, "text": "And no one knows what other people are doing or what's normal."}, {"time": 11197, "text": "We kind of know deviancy."}, {"time": 11199, "text": "We know perversion."}, {"time": 11200, "text": "We know the extremes."}, {"time": 11202, "text": "We know the rules."}, {"time": 11203, "text": "Hopefully people know the rules, but let's just be, there are a lot of people in the academic community, in particular at certain East Coast schools not to be named that are in open relationships."}, {"time": 11217, "text": "This is more common now."}, {"time": 11219, "text": "It's not very common, but it's more common."}, {"time": 11223, "text": "And obviously that's a way of bypassing some of these more primitive emotions about jealousy, et cetera, and leveraging them towards maybe even ongoing relationships."}, {"time": 11233, "text": "I'm not passing judgment one way or the other."}, {"time": 11236, "text": "I always say four conditions have to be met for any discussion about sex and sexuality or sexual health."}, {"time": 11241, "text": "Age appropriate, context appropriate, consensual and species appropriate."}, {"time": 11248, "text": "Well, that's weird because the thing I'm trying to figure out is why my sexual fantasy is to go to furry orgies and have sex with others dressed as squirrels and me, the other animals."}, {"time": 11263, "text": "So that could be, I'll see a therapist about that one."}, {"time": 11268, "text": "Can I ask you?"}, {"time": 11268, "text": "I'm not gonna respond to that except to say that as long as those four conditions are met."}, {"time": 11275, "text": "Consensual, age appropriate, context appropriate, species appropriate."}, {"time": 11277, "text": "So there's a bunch of questions on Instagram."}, {"time": 11280, "text": "One of them on this topic, on relationships, somebody suggested to do a part three of why Lex is single."}, {"time": 11288, "text": "There's a running joke about this."}, {"time": 11292, "text": "But I can answer it in part, right?"}, {"time": 11294, "text": "Because, well, partially because you're very busy, partially because you've decided that until it's time, you're gonna wait until it's time, it's time, right?"}, {"time": 11306, "text": "I mean, until it's time, you're waiting."}, {"time": 11308, "text": "And then, I mean, not saving yourself for marriage, I don't think, but in some sense, yeah, your future wife is out there."}, {"time": 11318, "text": "She's being programmed."}, {"time": 11319, "text": "No, I mean, I definitely believe that."}, {"time": 11323, "text": "I mean, first of all, I just love people and I fall in love very easily with people, with objects, with things, with life, with every moment."}, {"time": 11330, "text": "And that way you're like Oliver Sacks, he would fall in love with minerals and concepts and things like that."}, {"time": 11336, "text": "And so like to me, this kind of, so relationship is more like a commitment to one particular kind of object of your love."}, {"time": 11350, "text": "Like it's almost like a, it's like a journey that you take on together because also the interesting thing about humans is they're moment by moment a different person, day by day, week by week, month by month, they change, they evolve."}, {"time": 11364, "text": "There's an ups and downs and stuff like that."}, {"time": 11425, "text": "You know the dynamics, right?"}, {"time": 11427, "text": "I mean, you're merging two nervous systems."}, {"time": 11429, "text": "This was once described to me very well by an ex girlfriend who's truly brilliant, she's really brilliant."}, {"time": 11436, "text": "She said, you know, there's four arrows."}, {"time": 11439, "text": "This is maybe to an engineer or like a, so it makes sense."}, {"time": 11442, "text": "There's how you feel towards the other person."}, {"time": 11445, "text": "There's how they feel towards you, but then there's an arrow that comes back to you, which is how you feel about how they feel."}, {"time": 11454, "text": "And then they have an arrow of how they feel about how you feel, right?"}, {"time": 11457, "text": "This is why if someone else is moody or somebody else is upset, there's one version of ourselves where we respond to that or they respond to us, but there's another version where we respond to that, but it's also, there's a processing of what it means for us that they're behaving that way or feeling that way."}, {"time": 11475, "text": "And this again leads us back to that early attachment circuitry because if a parent was stressed, the child's role is not to soothe the parent."}, {"time": 11485, "text": "In fact, healthy models of parenting say that children shouldn't actually know how their parents feel for like the first eight years of their life."}, {"time": 11492, "text": "They're not supposed to be in that mindset of empathizing for the parent."}, {"time": 11495, "text": "This is often not the case, but maybe the cutoff isn't exactly eight, but you get the idea."}, {"time": 11501, "text": "So the dynamics of relationship are where the learning is because we learn how we react to other people reacting."}, {"time": 11506, "text": "It's not just a two arrow system."}, {"time": 11509, "text": "It's at least this four arrow thing."}, {"time": 11512, "text": "But there's also the element of nurturing, right?"}, {"time": 11514, "text": "I mean, I think that going through life with somebody is so much better than going through it alone."}, {"time": 11520, "text": "And I'd never thought I'd make that statement."}, {"time": 11524, "text": "So it wasn't always obvious to you?"}, {"time": 11525, "text": "No, it wasn't always obvious to me."}, {"time": 11527, "text": "I mean, I've really enjoyed wonderful relationships and some have been hard and there's certainly been a lot of growth."}, {"time": 11534, "text": "I'm on good terms with almost all my former girlfriends and close with some enough that I know their spouses and I'm close with their families."}, {"time": 11544, "text": "But no, it wasn't."}, {"time": 11545, "text": "And I think that when people say relationship is hard, the only really hard part of a good relationship is just dealing with oneself and making sure that you're staying in that mode of caretaking."}, {"time": 11558, "text": "Because I do believe that if one is mainly focused on taking good care of the other person, provided they're also focused on taking good care of you, to some extent, and we're good at taking care of ourselves, everybody flourishes, everything gets better."}, {"time": 11571, "text": "But no, I don't think I experienced that until fairly recently."}, {"time": 11574, "text": "What do you think is the secret to a successful relationship?"}, {"time": 11582, "text": "There isn't just one, but at least in the top five is master or at least be good at autonomic self regulation."}, {"time": 11592, "text": "Be good at autonomic self regulation."}, {"time": 11596, "text": "Know how to calm yourself down."}, {"time": 11598, "text": "Don't expect the, like looking to anything external to soothe yourself is it puts you in a terrible position to be a caretaker of yourself and other people, right?"}, {"time": 11607, "text": "So learn how to self soothe, right?"}, {"time": 11609, "text": "Learn how to calm your mind, steady your actions, steady your voice."}, {"time": 11613, "text": "There are tools to do that."}, {"time": 11614, "text": "We talk about on the podcast, but elsewhere, have that in place."}, {"time": 11616, "text": "I also think that if your main focus is on, you want to have a good boundaries, et cetera, but on tending to the relationship, doing a little bit more than you think you ought to do, if everyone does that, it goes great."}, {"time": 11630, "text": "I mean, I'm sometimes so positively struck by how supported I feel because for many years, I was just kind of doing everything on my own."}, {"time": 11639, "text": "So any little thing, I'm like, oh my goodness, this feels huge."}, {"time": 11642, "text": "And also I think the dynamics have to be right."}, {"time": 11644, "text": "Let's be really honest."}, {"time": 11645, "text": "This is a little bit of a tricky topic, but there is a power dynamic in relationships."}, {"time": 11653, "text": "Sometimes, not all, but in some relationships, it works much better if one person leads and the other person follows."}, {"time": 11661, "text": "In other relationships, it's more mutuality, works best."}, {"time": 11664, "text": "People need to know what they need."}, {"time": 11666, "text": "And so knowing what you need and what you crave is really important."}, {"time": 11670, "text": "And then once you do that, you can create the relationship you want."}, {"time": 11673, "text": "I've seen that over and over again."}, {"time": 11674, "text": "And people are different."}, {"time": 11676, "text": "But I think that ultimately, I mean, right, there's the dopamine phase of a relationship."}, {"time": 11684, "text": "And then there's the serotonin phase, the kind of more mutuality, coziness and sweetness."}, {"time": 11689, "text": "There's a great book about how to make sure that the dopamine component and the serotonin component, so to speak, go on forever."}, {"time": 11698, "text": "And it has to do with, you know, when you first meet someone and you're attracted to them, you're essentially objectifying them, meaning not in the way people might think, you are not dependent on them for emotional stability or survival."}, {"time": 11711, "text": "As you get close to somebody, you really come to depend on them and then you tend to objectify them less."}, {"time": 11716, "text": "And so this book, the name is kind of corny, but it's written by an analyst again, it's called Can Love Last?"}, {"time": 11721, "text": "And it's a book about how really good, strong relationships are the consequence of people constantly moving through this dependency objectification dynamic."}, {"time": 11733, "text": "And I use those words in the psychological sense, not in the way they're typically thrown around nowadays."}, {"time": 11739, "text": "So in some cultures, men and women will only touch for two weeks out of the month."}, {"time": 11746, "text": "And then for the other two weeks, the excitement and the sensuality and all, and the sexuality is very heightened."}, {"time": 11754, "text": "And then they go back to this kind of distancing."}, {"time": 11756, "text": "Now, I don't think that's feasible for most people, but if you look statistically, those relationships tend to last a very long time with at least reported mutual feelings of intense attraction for many, many, many decades."}, {"time": 11770, "text": "So human beings need to learn how to at least understand and control these dynamics."}, {"time": 11776, "text": "And there's a lot of divorce, there's a lot of cheating, there's a lot of stuff out there."}, {"time": 11778, "text": "It'd be great if people could resolve some of this stuff inside of the relationship, in my opinion."}, {"time": 11784, "text": "Yeah, and this kind of intense attraction, there's actually one of the poems that Karl Deisseroth introduced me to."}, {"time": 11796, "text": "I think it's Two English Poems is the name."}, {"time": 11798, "text": "But one of the things I find myself for prolonged periods being attracted to is you notice some kind of magic and you keep wanting to dig to the depths of that magic."}, {"time": 11815, "text": "You need to really know that person."}, {"time": 11817, "text": "To really know a person deeply, yeah."}, {"time": 11820, "text": "You notice something early on."}, {"time": 11823, "text": "I don't know what that is, but you just notice something special and you want to keep pulling at that thread and you never really do."}, {"time": 11830, "text": "Well, you also have to be careful."}, {"time": 11832, "text": "I get a lot of questions from guys."}, {"time": 11833, "text": "You have to be careful the questions you ask in a relationship too."}, {"time": 11836, "text": "You have to make sure you really want that information."}, {"time": 11838, "text": "And it's not just about people's past, right?"}, {"time": 11840, "text": "If you ask somebody how they really feel about something about you and they tell you, that may be soothing."}, {"time": 11845, "text": "It may be intensely stressful."}, {"time": 11847, "text": "You have to be, here's one thing I know for sure."}, {"time": 11851, "text": "For a relationship to work, you have to be brave."}, {"time": 11854, "text": "You can't go in there fully protected."}, {"time": 11857, "text": "And yet you also can't go in there with no boundaries because you'll end up beat up."}, {"time": 11862, "text": "What's that quote?"}, {"time": 11863, "text": "If you want to be a warrior, prepare to get hurt."}, {"time": 11865, "text": "If you want to be an explorer, prepare to get lost."}, {"time": 11867, "text": "And if you want to be both, you know, if you become a lover, prepare to be both or something."}, {"time": 11872, "text": "I forget, this is one of these Instagram type things that you see passing by and you go, oh, that's pretty true."}, {"time": 11876, "text": "Love is scary because it takes us back to that primitive circuitry that is as primitive and basic as hunger, thirst, the desire for heat when we're cold, the desire for cold when we're overly warm."}, {"time": 11890, "text": "It's a, it's Dynorphin."}, {"time": 11891, "text": "I mean, when somebody leaves, like the, you know, when somebody you are attached to leaves by death or by decision or you're forced apart, the Dynorphin release is massive."}, {"time": 11903, "text": "It is true discomfort."}, {"time": 11904, "text": "People feel anxiety and discomfort."}, {"time": 11907, "text": "And moving through that is a hell of a process."}, {"time": 11910, "text": "I mean, if I knew how to best break up at a neurological level, or if you could just plug yourself into a wall and reset, I mean, I'd do that episode tomorrow, but we don't have that knowledge."}, {"time": 11921, "text": "Come on, I think we've covered this before and it's even been memeified."}, {"time": 11925, "text": "I think losing love is part of the magic of love."}, {"time": 11929, "text": "It means you've felt something."}, {"time": 11931, "text": "I agree, but at some point, like if you've done it enough times, you know, life is finite, you know."}, {"time": 11937, "text": "It is beautiful to see these couples that seem very much in love despite many years, despite having been together many years."}, {"time": 11946, "text": "Yeah, the way they look at each other."}, {"time": 11948, "text": "Yeah, they'll say."}, {"time": 11949, "text": "They still see the magic."}, {"time": 11950, "text": "Yeah, and they'll say, we got lucky or it was, it's been hard or this and that."}, {"time": 11954, "text": "I think external conditions being a little tougher is helpful for a couple."}, {"time": 11960, "text": "Hardship."}, {"time": 11961, "text": "I do, I do, because I think that you rally, you know, and you bond with people, you know, obviously you want to survive those conditions, but yeah, I do."}, {"time": 11971, "text": "I think that it helps."}, {"time": 11972, "text": "Bonnie and Clyde."}, {"time": 11973, "text": "So any."}, {"time": 11974, "text": "Well, they were a little."}, {"time": 11975, "text": "Oh, a little too much."}, {"time": 11977, "text": "Well, a little too much."}, {"time": 11978, "text": "They were sociopaths, but the, well, when two sociopaths find one."}, {"time": 11982, "text": "Love can make you do crazy things."}, {"time": 11984, "text": "Normally, it's interesting, normally sociopaths don't team up because they manipulate each other."}, {"time": 11990, "text": "Sociopaths sadly are usually only interested in manipulating the highly pliable or unsuspecting, but when romantic attraction is woven in, then it gets really diabolical."}, {"time": 12005, "text": "Any advice on finding the love of your life, of my life?"}, {"time": 12009, "text": "This is, why Lexus single response?"}, {"time": 12012, "text": "Why, any advice?"}, {"time": 12015, "text": "Yeah, actually this comes from a friend of mine who's in a really excellent marriage with great kids and family and high demand life."}, {"time": 12024, "text": "It's a decision."}, {"time": 12025, "text": "Like at some point you just prioritize it as, okay, I'm going to make this happen one way or another."}, {"time": 12033, "text": "And you don't force the discovery of that person."}, {"time": 12036, "text": "But I mean, I've occasionally said, hey, I think you should meet this person or that person."}, {"time": 12041, "text": "And well, it wasn't, maybe my judgment might've been off, but the timing wasn't right or something."}, {"time": 12047, "text": "But I think that, yeah, it's a decision."}, {"time": 12049, "text": "And it also has to do with life structure."}, {"time": 12052, "text": "I mean, there were years."}, {"time": 12053, "text": "So when I was in graduate school, I didn't want a girlfriend."}, {"time": 12056, "text": "I just wanted to be in lab."}, {"time": 12057, "text": "And I, sure I had romantic dating interests, but I wasn't going to meet them through a committed, live together situation."}, {"time": 12064, "text": "It wasn't where I was at."}, {"time": 12065, "text": "And as a postdoc, things were a little different, et cetera, et cetera."}, {"time": 12068, "text": "So, but at some point it's sort of like, what do I want my daily routine to look like?"}, {"time": 12072, "text": "Because ultimately a relationship, however one structures, is going to be part of your daily routine."}, {"time": 12078, "text": "So at the point where you're like, I'd really love to wake up next to somebody and do blank and blank together."}, {"time": 12083, "text": "And then I'd love to work and then we meet for dinner."}]}]