[{"title": "Ilya Sutskever: Deep Learning | Lex Fridman Podcast #94", "id": "13CZPWmke6A", "quotes": [{"time": 307, "text": "Backpropagation I thought would work."}, {"time": 309, "text": "The thing which wasn't clear was whether there would be enough compute to get a very convincing result."}, {"time": 314, "text": "And then at some point, Alex Kerchevsky wrote these insanely fast CUDA kernels for training convolutional neural nets."}, {"time": 319, "text": "Net was bam, let's do this."}, {"time": 320, "text": "Let's get image in it and it's gonna be the greatest thing."}, {"time": 323, "text": "Was your intuition, most of your intuition from empirical results by you and by others?"}, {"time": 329, "text": "So like just actually demonstrating that a piece of program can train a 10 layer neural network?"}, {"time": 334, "text": "Or was there some pen and paper or marker and whiteboard thinking intuition?"}, {"time": 341, "text": "Like, cause you just connected a 10 layer large neural network to the brain."}, {"time": 345, "text": "So you just mentioned the brain."}, {"time": 346, "text": "So in your intuition about neural networks does the human brain come into play as a intuition builder?"}, {"time": 354, "text": "I mean, you gotta be precise with these analogies between artificial neural networks and the brain."}, {"time": 360, "text": "But there is no question that the brain is a huge source of intuition and inspiration for deep learning researchers since all the way from Rosenblatt in the 60s."}, {"time": 370, "text": "Like if you look at the whole idea of a neural network is directly inspired by the brain."}, {"time": 375, "text": "You had people like McCallum and Pitts who were saying, hey, you got these neurons in the brain."}, {"time": 382, "text": "And hey, we recently learned about the computer and automata."}, {"time": 384, "text": "Can we use some ideas from the computer and automata to design some kind of computational object that's going to be simple, computational and kind of like the brain and they invented the neuron."}, {"time": 394, "text": "So they were inspired by it back then."}, {"time": 395, "text": "Then you had the convolutional neural network from Fukushima and then later Yann LeCun who said, hey, if you limit the receptive fields of a neural network, it's going to be especially suitable for images as it turned out to be true."}, {"time": 406, "text": "So there was a very small number of examples where analogies to the brain were successful."}, {"time": 412, "text": "And I thought, well, probably an artificial neuron is not that different from the brain if it's cleaned hard enough."}, {"time": 417, "text": "So let's just assume it is and roll with it."}, {"time": 420, "text": "So now we're not at a time where deep learning is very successful."}, {"time": 423, "text": "So let us squint less and say, let's open our eyes and say, what do you use an interesting difference between the human brain?"}, {"time": 433, "text": "Now, I know you're probably not an expert neither in your scientists and your biologists, but loosely speaking, what's the difference between the human brain and artificial neural networks?"}, {"time": 442, "text": "That's interesting to you for the next decade or two."}, {"time": 446, "text": "That's a good question to ask."}, {"time": 447, "text": "What is an interesting difference between the neurons between the brain and our artificial neural networks?"}, {"time": 452, "text": "So I feel like today, artificial neural networks, so we all agree that there are certain dimensions in which the human brain vastly outperforms our models."}, {"time": 463, "text": "But I also think that there are some ways in which our artificial neural networks have a number of very important advantages over the brain."}, {"time": 470, "text": "Looking at the advantages versus disadvantages is a good way to figure out what is the important difference."}, {"time": 475, "text": "So the brain uses spikes, which may or may not be important."}, {"time": 480, "text": "Yeah, it's a really interesting question."}, {"time": 481, "text": "Do you think it's important or not?"}, {"time": 483, "text": "That's one big architectural difference between artificial neural networks."}, {"time": 488, "text": "It's hard to tell, but my prior is not very high and I can say why."}, {"time": 493, "text": "There are people who are interested in spiking neural networks."}, {"time": 495, "text": "And basically what they figured out is that they need to simulate the non spiking neural networks in spikes."}, {"time": 502, "text": "And that's how they're gonna make them work."}, {"time": 504, "text": "If you don't simulate the non spiking neural networks in spikes, it's not going to work because the question is why should it work?"}, {"time": 509, "text": "And that connects to questions around back propagation and questions around deep learning."}, {"time": 514, "text": "You've got this giant neural network."}, {"time": 516, "text": "Why should it work at all?"}, {"time": 518, "text": "Why should the learning rule work at all?"}, {"time": 523, "text": "It's not a self evident question, especially if you, let's say if you were just starting in the field and you read the very early papers, you can say, hey, people are saying, let's build neural networks."}, {"time": 533, "text": "That's a great idea because the brain is a neural network."}, {"time": 535, "text": "So it would be useful to build neural networks."}, {"time": 538, "text": "Now let's figure out how to train them."}, {"time": 540, "text": "It should be possible to train them probably, but how?"}, {"time": 543, "text": "And so the big idea is the cost function."}, {"time": 547, "text": "That's the big idea."}, {"time": 548, "text": "The cost function is a way of measuring the performance of the system according to some measure."}, {"time": 554, "text": "By the way, that is a big, actually let me think, is that one, a difficult idea to arrive at and how big of an idea is that?"}, {"time": 562, "text": "That there's a single cost function."}, {"time": 567, "text": "Sorry, let me take a pause."}, {"time": 568, "text": "Is supervised learning a difficult concept to come to?"}, {"time": 574, "text": "All concepts are very easy in retrospect."}, {"time": 576, "text": "Yeah, that's what it seems trivial now, but I, because the reason I asked that, and we'll talk about it, is there other things?"}, {"time": 583, "text": "Is there things that don't necessarily have a cost function, maybe have many cost functions or maybe have dynamic cost functions or maybe a totally different kind of architectures?"}, {"time": 594, "text": "Because we have to think like that in order to arrive at something new, right?"}, {"time": 597, "text": "So the only, so the good examples of things which don't have clear cost functions are GANs."}, {"time": 603, "text": "And a GAN, you have a game."}, {"time": 605, "text": "So instead of thinking of a cost function, where you wanna optimize, where you know that you have an algorithm gradient descent, which will optimize the cost function, and then you can reason about the behavior of your system in terms of what it optimizes."}, {"time": 618, "text": "With a GAN, you say, I have a game and I'll reason about the behavior of the system in terms of the equilibrium of the game."}, {"time": 624, "text": "But it's all about coming up with these mathematical objects that help us reason about the behavior of our system."}, {"time": 631, "text": "Yeah, so GAN is the only one, it's kind of a, the cost function is emergent from the comparison."}, {"time": 636, "text": "It's, I don't know if it has a cost function."}, {"time": 638, "text": "I don't know if it's meaningful to talk about the cost function of a GAN."}, {"time": 641, "text": "It's kind of like the cost function of biological evolution or the cost function of the economy."}, {"time": 645, "text": "It's, you can talk about regions to which it will go towards, but I don't think, I don't think the cost function analogy is the most useful."}, {"time": 657, "text": "So if evolution doesn't, that's really interesting."}, {"time": 660, "text": "So if evolution doesn't really have a cost function, like a cost function based on its, something akin to our mathematical conception of a cost function, then do you think cost functions in deep learning are holding us back?"}, {"time": 675, "text": "Yeah, so you just kind of mentioned that cost function is a nice first profound idea."}, {"time": 681, "text": "Do you think that's a good idea?"}, {"time": 683, "text": "Do you think it's an idea we'll go past?"}, {"time": 686, "text": "So self play starts to touch on that a little bit in reinforcement learning systems."}, {"time": 692, "text": "Self play and also ideas around exploration where you're trying to take action that surprise a predictor."}, {"time": 699, "text": "I'm a big fan of cost functions."}, {"time": 700, "text": "I think cost functions are great and they serve us really well."}, {"time": 702, "text": "And I think that whenever we can do things with cost functions, we should."}, {"time": 705, "text": "And you know, maybe there is a chance that we will come up with some, yet another profound way of looking at things that will involve cost functions in a less central way."}, {"time": 714, "text": "But I don't know, I think cost functions are, I mean, I would not bet against cost functions."}, {"time": 721, "text": "Is there other things about the brain that pop into your mind that might be different and interesting for us to consider in designing artificial neural networks?"}, {"time": 732, "text": "So we talked about spiking a little bit."}, {"time": 734, "text": "I mean, one thing which may potentially be useful, I think people, neuroscientists have figured out something about the learning rule of the brain or I'm talking about spike time independent plasticity and it would be nice if some people would just study that in simulation."}, {"time": 746, "text": "Wait, sorry, spike time independent plasticity?"}, {"time": 750, "text": "STD."}, {"time": 751, "text": "It's a particular learning rule that uses spike timing to figure out how to determine how to update the synapses."}, {"time": 757, "text": "So it's kind of like if a synapse fires into the neuron before the neuron fires, then it strengthens the synapse, and if the synapse fires into the neurons shortly after the neuron fired, then it weakens the synapse."}, {"time": 769, "text": "Something along this line."}, {"time": 770, "text": "I'm 90% sure it's right, so if I said something wrong here, don't get too angry."}, {"time": 777, "text": "But you sounded brilliant while saying it."}, {"time": 779, "text": "But the timing, that's one thing that's missing."}, {"time": 782, "text": "The temporal dynamics is not captured."}, {"time": 785, "text": "I think that's like a fundamental property of the brain is the timing of the timing of the timing of the signals."}, {"time": 793, "text": "Well, you have recurrent neural networks."}, {"time": 795, "text": "But you think of that as this, I mean, that's a very crude, simplified, what's that called?"}, {"time": 803, "text": "There's a clock, I guess, to recurrent neural networks."}, {"time": 807, "text": "It's, this seems like the brain is the general, the continuous version of that, the generalization where all possible timings are possible, and then within those timings is contained some information."}, {"time": 819, "text": "You think recurrent neural networks, the recurrence in recurrent neural networks can capture the same kind of phenomena as the timing that seems to be important for the brain, in the firing of neurons in the brain?"}, {"time": 836, "text": "I mean, I think recurrent neural networks are amazing, and they can do, I think they can do anything we'd want them to, we'd want a system to do."}, {"time": 847, "text": "Right now, recurrent neural networks have been superseded by transformers, but maybe one day they'll make a comeback, maybe they'll be back, we'll see."}, {"time": 855, "text": "Let me, on a small tangent, say, do you think they'll be back?"}, {"time": 859, "text": "So, so much of the breakthroughs recently that we'll talk about on natural language processing and language modeling has been with transformers that don't emphasize recurrence."}, {"time": 870, "text": "Do you think recurrence will make a comeback?"}, {"time": 873, "text": "Well, some kind of recurrence, I think very likely."}, {"time": 877, "text": "Recurrent neural networks, as they're typically thought of for processing sequences, I think it's also possible."}, {"time": 884, "text": "What is, to you, a recurrent neural network?"}, {"time": 887, "text": "In generally speaking, I guess, what is a recurrent neural network?"}, {"time": 890, "text": "You have a neural network which maintains a high dimensional hidden state, and then when an observation arrives, it updates its high dimensional hidden state through its connections in some way."}, {"time": 903, "text": "So do you think, that's what expert systems did, right?"}, {"time": 908, "text": "Symbolic AI, the knowledge based, growing a knowledge base is maintaining a hidden state, which is its knowledge base, and is growing it by sequential processing."}, {"time": 920, "text": "Do you think of it more generally in that way, or is it simply, is it the more constrained form of a hidden state with certain kind of gating units that we think of as today with LSTMs and that?"}, {"time": 934, "text": "I mean, the hidden state is technically what you described there, the hidden state that goes inside the LSTM or the RNN or something like this."}, {"time": 941, "text": "But then what should be contained, if you want to make the expert system analogy, I'm not, I mean, you could say that the knowledge is stored in the connections, and then the short term processing is done in the hidden state."}, {"time": 956, "text": "Yes, could you say that?"}, {"time": 958, "text": "So sort of, do you think there's a future of building large scale knowledge bases within the neural networks?"}, {"time": 969, "text": "So we're gonna pause on that confidence, because I want to explore that."}, {"time": 972, "text": "Well, let me zoom back out and ask, back to the history of ImageNet."}, {"time": 979, "text": "Neural networks have been around for many decades, as you mentioned."}, {"time": 982, "text": "What do you think were the key ideas that led to their success, that ImageNet moment and beyond, the success in the past 10 years?"}, {"time": 992, "text": "Okay, so the question is, to make sure I didn't miss anything, the key ideas that led to the success of deep learning over the past 10 years."}, {"time": 999, "text": "Exactly, even though the fundamental thing behind deep learning has been around for much longer."}, {"time": 1005, "text": "So the key idea about deep learning, or rather the key fact about deep learning before deep learning started to be successful, is that it was underestimated."}, {"time": 1021, "text": "People who worked in machine learning simply didn't think that neural networks could do much."}, {"time": 1026, "text": "People didn't believe that large neural networks could be trained."}, {"time": 1030, "text": "People thought that, well, there was lots of, there was a lot of debate going on in machine learning about what are the right methods and so on."}, {"time": 1037, "text": "And people were arguing because there were no, there was no way to get hard facts."}, {"time": 1043, "text": "And by that, I mean, there were no benchmarks which were truly hard that if you do really well on them, then you can say, look, here's my system."}, {"time": 1052, "text": "That's when you switch from, that's when this field becomes a little bit more of an engineering field."}, {"time": 1058, "text": "So in terms of deep learning, to answer the question directly, the ideas were all there."}, {"time": 1063, "text": "The thing that was missing was a lot of supervised data and a lot of compute."}, {"time": 1069, "text": "Once you have a lot of supervised data and a lot of compute, then there is a third thing which is needed as well."}, {"time": 1074, "text": "And that is conviction."}, {"time": 1076, "text": "Conviction that if you take the right stuff, which already exists, and apply and mix it with a lot of data and a lot of compute, that it will in fact work."}, {"time": 1085, "text": "And so that was the missing piece."}, {"time": 1087, "text": "It was, you had the, you needed the data, you needed the compute, which showed up in terms of GPUs, and you needed the conviction to realize that you need to mix them together."}, {"time": 1099, "text": "So I guess the presence of compute and the presence of supervised data allowed the empirical evidence to do the convincing of the majority of the computer science community."}, {"time": 1112, "text": "So I guess there's a key moment with Jitendra Malik and Alex Alyosha Efros who were very skeptical, right?"}, {"time": 1122, "text": "And then there's a Jeffrey Hinton that was the opposite of skeptical."}, {"time": 1126, "text": "And there was a convincing moment."}, {"time": 1128, "text": "And I think ImageNet had served as that moment."}, {"time": 1131, "text": "And they represented this kind of, were the big pillars of computer vision community, kind of the wizards got together, and then all of a sudden there was a shift."}, {"time": 1141, "text": "And it's not enough for the ideas to all be there and the compute to be there, it's for it to convince the cynicism that existed."}, {"time": 1151, "text": "It's interesting that people just didn't believe for a couple of decades."}, {"time": 1155, "text": "Yeah, well, but it's more than that."}, {"time": 1158, "text": "It's kind of, when put this way, it sounds like, well, those silly people who didn't believe, what were they missing?"}, {"time": 1165, "text": "But in reality, things were confusing because neural networks really did not work on anything."}, {"time": 1170, "text": "And they were not the best method on pretty much anything as well."}, {"time": 1173, "text": "And it was pretty rational to say, yeah, this stuff doesn't have any traction."}, {"time": 1179, "text": "And that's why you need to have these very hard tasks which produce undeniable evidence."}, {"time": 1184, "text": "And that's how we make progress."}, {"time": 1186, "text": "And that's why the field is making progress today because we have these hard benchmarks which represent true progress."}, {"time": 1192, "text": "And so, and this is why we are able to avoid endless debate."}, {"time": 1198, "text": "So incredibly you've contributed some of the biggest recent ideas in AI in computer vision, language, natural language processing, reinforcement learning, sort of everything in between, maybe not GANs."}, {"time": 1212, "text": "But there may not be a topic you haven't touched."}, {"time": 1216, "text": "And of course, the fundamental science of deep learning."}, {"time": 1219, "text": "What is the difference to you between vision, language, and as in reinforcement learning, action, as learning problems?"}, {"time": 1228, "text": "And what are the commonalities?"}, {"time": 1229, "text": "Do you see them as all interconnected?"}, {"time": 1231, "text": "Are they fundamentally different domains that require different approaches?"}, {"time": 1238, "text": "Okay, that's a good question."}, {"time": 1239, "text": "Machine learning is a field with a lot of unity, a huge amount of unity."}, {"time": 1244, "text": "In fact."}, {"time": 1244, "text": "What do you mean by unity?"}, {"time": 1245, "text": "Like overlap of ideas?"}, {"time": 1248, "text": "Overlap of ideas, overlap of principles."}, {"time": 1250, "text": "In fact, there's only one or two or three principles which are very, very simple."}, {"time": 1254, "text": "And then they apply in almost the same way, in almost the same way to the different modalities, to the different problems."}, {"time": 1261, "text": "And that's why today, when someone writes a paper on improving optimization of deep learning and vision, it improves the different NLP applications and it improves the different reinforcement learning applications."}, {"time": 1272, "text": "Reinforcement learning."}, {"time": 1273, "text": "So I would say that computer vision and NLP are very similar to each other."}, {"time": 1278, "text": "Today they differ in that they have slightly different architectures."}, {"time": 1282, "text": "We use transformers in NLP and we use convolutional neural networks in vision."}, {"time": 1286, "text": "But it's also possible that one day this will change and everything will be unified with a single architecture."}, {"time": 1291, "text": "Because if you go back a few years ago in natural language processing, there were a huge number of architectures for every different tiny problem had its own architecture."}, {"time": 1303, "text": "Today, there's just one transformer for all those different tasks."}, {"time": 1307, "text": "And if you go back in time even more, you had even more and more fragmentation and every little problem in AI had its own little subspecialization and sub, you know, little set of collection of skills, people who would know how to engineer the features."}, {"time": 1320, "text": "Now it's all been subsumed by deep learning."}, {"time": 1322, "text": "We have this unification."}, {"time": 1324, "text": "And so I expect vision to become unified with natural language as well."}, {"time": 1328, "text": "Or rather, I shouldn't say expect, I think it's possible."}, {"time": 1330, "text": "I don't wanna be too sure because I think on the convolutional neural net is very computationally efficient."}, {"time": 1335, "text": "RL is different."}, {"time": 1336, "text": "RL does require slightly different techniques because you really do need to take action."}, {"time": 1340, "text": "You really need to do something about exploration."}, {"time": 1343, "text": "Your variance is much higher."}, {"time": 1346, "text": "But I think there is a lot of unity even there."}, {"time": 1348, "text": "And I would expect, for example, that at some point there will be some broader unification between RL and supervised learning where somehow the RL will be making decisions to make the supervised learning go better."}, {"time": 1358, "text": "And it will be, I imagine, one big black box and you just throw, you know, you shovel things into it and it just figures out what to do with whatever you shovel at it."}, {"time": 1368, "text": "I mean, reinforcement learning has some aspects of language and vision combined almost."}, {"time": 1375, "text": "There's elements of a long term memory that you should be utilizing and there's elements of a really rich sensory space."}, {"time": 1383, "text": "So it seems like the union of the two or something like that."}, {"time": 1388, "text": "I'd say something slightly differently."}, {"time": 1390, "text": "I'd say that reinforcement learning is neither, but it naturally interfaces and integrates with the two of them."}, {"time": 1397, "text": "Do you think action is fundamentally different?"}, {"time": 1399, "text": "So yeah, what is interesting about, what is unique about policy of learning to act?"}, {"time": 1406, "text": "Well, so one example, for instance, is that when you learn to act, you are fundamentally in a non stationary world because as your actions change, the things you see start changing."}, {"time": 1418, "text": "You experience the world in a different way."}, {"time": 1421, "text": "And this is not the case for the more traditional static problem where you have some distribution and you just apply a model to that distribution."}, {"time": 1429, "text": "You think it's a fundamentally different problem or is it just a more difficult generalization of the problem of understanding?"}, {"time": 1437, "text": "I mean, it's a question of definitions almost."}, {"time": 1439, "text": "There is a huge amount of commonality for sure."}, {"time": 1442, "text": "You take gradients, you try, you take gradients."}, {"time": 1444, "text": "We try to approximate gradients in both cases."}, {"time": 1446, "text": "In the case of reinforcement learning, you have some tools to reduce the variance of the gradients."}, {"time": 1451, "text": "You do that."}, {"time": 1453, "text": "There's lots of commonality."}, {"time": 1453, "text": "Use the same neural net in both cases."}, {"time": 1456, "text": "You compute the gradient, you apply Adam in both cases."}, {"time": 1460, "text": "So, I mean, there's lots in common for sure, but there are some small differences which are not completely insignificant."}, {"time": 1468, "text": "It's really just a matter of your point of view, what frame of reference, how much do you wanna zoom in or out as you look at these problems?"}, {"time": 1477, "text": "Which problem do you think is harder?"}, {"time": 1479, "text": "So people like Noam Chomsky believe that language is fundamental to everything."}, {"time": 1483, "text": "So it underlies everything."}, {"time": 1485, "text": "Do you think language understanding is harder than visual scene understanding or vice versa?"}, {"time": 1492, "text": "I think that asking if a problem is hard is slightly wrong."}, {"time": 1496, "text": "I think the question is a little bit wrong and I wanna explain why."}, {"time": 1499, "text": "So what does it mean for a problem to be hard?"}, {"time": 1504, "text": "Okay, the non interesting dumb answer to that is there's a benchmark and there's a human level performance on that benchmark and how is the effort required to reach the human level benchmark."}, {"time": 1519, "text": "So from the perspective of how much until we get to human level on a very good benchmark."}, {"time": 1525, "text": "Yeah, I understand what you mean by that."}, {"time": 1528, "text": "So what I was going to say that a lot of it depends on, once you solve a problem, it stops being hard and that's always true."}, {"time": 1535, "text": "And so whether something is hard or not depends on what our tools can do today."}, {"time": 1539, "text": "So you say today through human level, language understanding and visual perception are hard in the sense that there is no way of solving the problem completely in the next three months."}, {"time": 1552, "text": "So I agree with that statement."}, {"time": 1553, "text": "Beyond that, my guess would be as good as yours, I don't know."}, {"time": 1557, "text": "Oh, okay, so you don't have a fundamental intuition about how hard language understanding is."}, {"time": 1562, "text": "I think, I know I changed my mind."}, {"time": 1564, "text": "I'd say language is probably going to be harder."}, {"time": 1566, "text": "I mean, it depends on how you define it."}, {"time": 1569, "text": "Like if you mean absolute top notch, 100% language understanding, I'll go with language."}, {"time": 1576, "text": "But then if I show you a piece of paper with letters on it, is that, you see what I mean?"}, {"time": 1581, "text": "You have a vision system, you say it's the best human level vision system."}, {"time": 1585, "text": "I show you, I open a book and I show you letters."}, {"time": 1588, "text": "Will it understand how these letters form into word and sentences and meaning?"}, {"time": 1592, "text": "Is this part of the vision problem?"}, {"time": 1593, "text": "Where does vision end and language begin?"}, {"time": 1596, "text": "Yeah, so Chomsky would say it starts at language."}, {"time": 1598, "text": "So vision is just a little example of the kind of a structure and fundamental hierarchy of ideas that's already represented in our brains somehow that's represented through language."}, {"time": 1611, "text": "But where does vision stop and language begin?"}, {"time": 1627, "text": "So one possibility is that it's impossible to achieve really deep understanding in either images or language without basically using the same kind of system."}, {"time": 1638, "text": "So you're going to get the other for free."}, {"time": 1641, "text": "I think it's pretty likely that yes, if we can get one, our machine learning is probably that good that we can get the other."}, {"time": 1647, "text": "But I'm not 100% sure."}, {"time": 1650, "text": "And also, I think a lot of it really does depend on your definitions."}, {"time": 1656, "text": "Definitions of?"}, {"time": 1657, "text": "Of like perfect vision."}, {"time": 1660, "text": "Because reading is vision, but should it count?"}, {"time": 1664, "text": "Yeah, to me, so my definition is if a system looked at an image and then a system looked at a piece of text and then told me something about that and I was really impressed."}, {"time": 1678, "text": "That's relative."}, {"time": 1679, "text": "You'll be impressed for half an hour and then you're gonna say, well, I mean, all the systems do that, but here's the thing they don't do."}, {"time": 1685, "text": "Yeah, but I don't have that with humans."}, {"time": 1687, "text": "Humans continue to impress me."}, {"time": 1690, "text": "Well, the ones, okay, so I'm a fan of monogamy."}, {"time": 1694, "text": "So I like the idea of marrying somebody, being with them for several decades."}, {"time": 1698, "text": "So I believe in the fact that yes, it's possible to have somebody continuously giving you pleasurable, interesting, witty new ideas, friends."}, {"time": 1709, "text": "They continue to surprise you."}, {"time": 1712, "text": "The surprise, it's that injection of randomness."}, {"time": 1717, "text": "It seems to be a nice source of, yeah, continued inspiration, like the wit, the humor."}, {"time": 1728, "text": "I think, yeah, that would be, it's a very subjective test, but I think if you have enough humans in the room."}, {"time": 1738, "text": "Yeah, I understand what you mean."}, {"time": 1740, "text": "Yeah, I feel like I misunderstood what you meant by impressing you."}, {"time": 1742, "text": "I thought you meant to impress you with its intelligence, with how well it understands an image."}, {"time": 1750, "text": "I thought you meant something like, I'm gonna show it a really complicated image and it's gonna get it right."}, {"time": 1754, "text": "And you're gonna say, wow, that's really cool."}, {"time": 1755, "text": "Our systems of January 2020 have not been doing that."}, {"time": 1759, "text": "Yeah, no, I think it all boils down to like the reason people click like on stuff on the internet, which is like, it makes them laugh."}, {"time": 1768, "text": "So it's like humor or wit or insight."}, {"time": 1772, "text": "I'm sure we'll get that as well."}, {"time": 1775, "text": "So forgive the romanticized question, but looking back to you, what is the most beautiful or surprising idea in deep learning or AI in general you've come across?"}, {"time": 1786, "text": "So I think the most beautiful thing about deep learning is that it actually works."}, {"time": 1791, "text": "And I mean it, because you got these ideas, you got the little neural network, you got the back propagation algorithm."}, {"time": 1798, "text": "And then you've got some theories as to, this is kind of like the brain."}, {"time": 1802, "text": "So maybe if you make it large, if you make the neural network large and you train it on a lot of data, then it will do the same function that the brain does."}, {"time": 1809, "text": "And it turns out to be true, that's crazy."}, {"time": 1812, "text": "And now we just train these neural networks and you make them larger and they keep getting better."}, {"time": 1816, "text": "And I find it unbelievable."}, {"time": 1817, "text": "I find it unbelievable that this whole AI stuff with neural networks works."}, {"time": 1822, "text": "Have you built up an intuition of why?"}, {"time": 1824, "text": "Are there a lot of bits and pieces of intuitions, of insights of why this whole thing works?"}, {"time": 1831, "text": "I mean, some, definitely."}, {"time": 1833, "text": "While we know that optimization, we now have good, we've had lots of empirical, huge amounts of empirical reasons to believe that optimization should work on most problems we care about."}, {"time": 1847, "text": "Do you have insights of why?"}, {"time": 1848, "text": "So you just said empirical evidence."}, {"time": 1850, "text": "Is most of your sort of empirical evidence kind of convinces you?"}, {"time": 1858, "text": "It's like evolution is empirical."}, {"time": 1860, "text": "It shows you that, look, this evolutionary process seems to be a good way to design organisms that survive in their environment, but it doesn't really get you to the insights of how the whole thing works."}, {"time": 1873, "text": "I think a good analogy is physics."}, {"time": 1876, "text": "You know how you say, hey, let's do some physics calculation and come up with some new physics theory and make some prediction."}, {"time": 1881, "text": "But then you got around the experiment."}, {"time": 1883, "text": "You know, you got around the experiment, it's important."}, {"time": 1886, "text": "So it's a bit the same here, except that maybe sometimes the experiment came before the theory."}, {"time": 1891, "text": "But it still is the case."}, {"time": 1892, "text": "You know, you have some data and you come up with some prediction."}, {"time": 1895, "text": "You say, yeah, let's make a big neural network."}, {"time": 1896, "text": "Let's train it."}, {"time": 1897, "text": "And it's going to work much better than anything before it."}, {"time": 1899, "text": "And it will in fact continue to get better as you make it larger."}, {"time": 1902, "text": "And it turns out to be true."}, {"time": 1903, "text": "That's amazing when a theory is validated like this."}, {"time": 1907, "text": "It's not a mathematical theory."}, {"time": 1908, "text": "It's more of a biological theory almost."}, {"time": 1911, "text": "So I think there are not terrible analogies between deep learning and biology."}, {"time": 1915, "text": "I would say it's like the geometric mean of biology and physics."}, {"time": 1918, "text": "That's deep learning."}, {"time": 1920, "text": "The geometric mean of biology and physics."}, {"time": 1923, "text": "I think I'm going to need a few hours to wrap my head around that."}, {"time": 1927, "text": "Because just to find the geometric, just to find the set of what biology represents."}, {"time": 1936, "text": "Well, in biology, things are really complicated."}, {"time": 1939, "text": "Theories are really, really, it's really hard to have good predictive theory."}, {"time": 1942, "text": "And in physics, the theories are too good."}, {"time": 1945, "text": "In physics, people make these super precise theories which make these amazing predictions."}, {"time": 1949, "text": "And in machine learning, we're kind of in between."}, {"time": 1951, "text": "Kind of in between, but it'd be nice if machine learning somehow helped us discover the unification of the two as opposed to sort of the in between."}, {"time": 1961, "text": "That's, you're kind of trying to juggle both."}, {"time": 1964, "text": "So do you think there are still beautiful and mysterious properties in neural networks that are yet to be discovered?"}, {"time": 1971, "text": "I think that we are still massively underestimating deep learning."}, {"time": 1975, "text": "What do you think it will look like?"}, {"time": 1976, "text": "Like what, if I knew, I would have done it, you know?"}, {"time": 1981, "text": "So, but if you look at all the progress from the past 10 years, I would say most of it, I would say there've been a few cases where some were things that felt like really new ideas showed up, but by and large it was every year we thought, okay, deep learning goes this far."}, {"time": 1997, "text": "Nope, it actually goes further."}, {"time": 1999, "text": "And then the next year, okay, now this is peak deep learning."}, {"time": 2002, "text": "We are really done."}, {"time": 2003, "text": "Nope, it goes further."}, {"time": 2004, "text": "It just keeps going further each year."}, {"time": 2006, "text": "So that means that we keep underestimating, we keep not understanding it."}, {"time": 2009, "text": "It has surprising properties all the time."}, {"time": 2011, "text": "Do you think it's getting harder and harder?"}, {"time": 2013, "text": "To make progress?"}, {"time": 2014, "text": "Need to make progress?"}, {"time": 2016, "text": "It depends on what you mean."}, {"time": 2016, "text": "I think the field will continue to make very robust progress for quite a while."}, {"time": 2021, "text": "I think for individual researchers, especially people who are doing research, it can be harder because there is a very large number of researchers right now."}, {"time": 2030, "text": "I think that if you have a lot of compute, then you can make a lot of very interesting discoveries, but then you have to deal with the challenge of managing a huge compute cluster to run your experiments."}, {"time": 2042, "text": "It's a little bit harder."}, {"time": 2043, "text": "So I'm asking all these questions that nobody knows the answer to, but you're one of the smartest people I know, so I'm gonna keep asking."}, {"time": 2050, "text": "So let's imagine all the breakthroughs that happen in the next 30 years in deep learning."}, {"time": 2055, "text": "Do you think most of those breakthroughs can be done by one person with one computer?"}, {"time": 2062, "text": "Sort of in the space of breakthroughs, do you think compute will be, compute and large efforts will be necessary?"}, {"time": 2072, "text": "I mean, I can't be sure."}, {"time": 2074, "text": "When you say one computer, you mean how large?"}, {"time": 2076, "text": "You're clever."}, {"time": 2080, "text": "I mean, one GPU."}, {"time": 2083, "text": "I think it's pretty unlikely."}, {"time": 2088, "text": "I think that there are many, the stack of deep learning is starting to be quite deep."}, {"time": 2094, "text": "If you look at it, you've got all the way from the ideas, the systems to build the data sets, the distributed programming, the building the actual cluster, the GPU programming, putting it all together."}, {"time": 2109, "text": "So now the stack is getting really deep and I think it becomes, it can be quite hard for a single person to become, to be world class in every single layer of the stack."}, {"time": 2117, "text": "What about the, what like Vlad and Ravapnik really insist on is taking MNIST and trying to learn from very few examples."}, {"time": 2126, "text": "So being able to learn more efficiently."}, {"time": 2129, "text": "Do you think that's, there'll be breakthroughs in that space that would, may not need the huge compute?"}, {"time": 2134, "text": "I think there will be a large number of breakthroughs in general that will not need a huge amount of compute."}, {"time": 2140, "text": "So maybe I should clarify that."}, {"time": 2142, "text": "I think that some breakthroughs will require a lot of compute and I think building systems which actually do things will require a huge amount of compute."}, {"time": 2150, "text": "That one is pretty obvious."}, {"time": 2151, "text": "If you want to do X and X requires a huge neural net, you gotta get a huge neural net."}, {"time": 2156, "text": "But I think there will be lots of, I think there is lots of room for very important work being done by small groups and individuals."}, {"time": 2165, "text": "Can you maybe sort of on the topic of the science of deep learning, talk about one of the recent papers that you released, the Deep Double Descent, where bigger models and more data hurt."}, {"time": 2178, "text": "I think it's a really interesting paper."}, {"time": 2179, "text": "Can you describe the main idea?"}, {"time": 2183, "text": "So what happened is that some, over the years, some small number of researchers noticed that it is kind of weird that when you make the neural network larger, it works better and it seems to go in contradiction with statistical ideas."}, {"time": 2194, "text": "And then some people made an analysis showing that actually you got this double descent bump."}, {"time": 2198, "text": "And what we've done was to show that double descent occurs for pretty much all practical deep learning systems."}, {"time": 2206, "text": "And that it'll be also, so can you step back?"}, {"time": 2211, "text": "What's the X axis and the Y axis of a double descent plot?"}, {"time": 2217, "text": "So you can look, you can do things like, you can take your neural network and you can start increasing its size slowly while keeping your data set fixed."}, {"time": 2230, "text": "So if you increase the size of the neural network slowly, and if you don't do early stopping, that's a pretty important detail, then when the neural network is really small, you make it larger, you get a very rapid increase in performance."}, {"time": 2246, "text": "Then you continue to make it larger."}, {"time": 2247, "text": "And at some point performance will get worse."}, {"time": 2250, "text": "And it gets the worst exactly at the point at which it achieves zero training error, precisely zero training loss."}, {"time": 2258, "text": "And then as you make it larger, it starts to get better again."}, {"time": 2261, "text": "And it's kind of counterintuitive because you'd expect deep learning phenomena to be monotonic."}, {"time": 2266, "text": "And it's hard to be sure what it means, but it also occurs in the case of linear classifiers."}, {"time": 2273, "text": "And the intuition basically boils down to the following."}, {"time": 2277, "text": "When you have a large data set and a small model, then small, tiny random, so basically what is overfitting?"}, {"time": 2287, "text": "Overfitting is when your model is somehow very sensitive to the small random unimportant stuff in your data set."}, {"time": 2296, "text": "In the training data."}, {"time": 2297, "text": "In the training data set, precisely."}, {"time": 2299, "text": "So if you have a small model and you have a big data set, and there may be some random thing, some training cases are randomly in the data set and others may not be there, but the small model is kind of insensitive to this randomness because it's the same, there is pretty much no uncertainty about the model when the data set is large."}, {"time": 2319, "text": "So at the very basic level to me, it is the most surprising thing that neural networks don't overfit every time very quickly before ever being able to learn anything."}, {"time": 2334, "text": "The huge number of parameters."}, {"time": 2336, "text": "So here is, so there is one way, okay."}, {"time": 2337, "text": "So maybe, so let me try to give the explanation and maybe that will be, that will work."}, {"time": 2342, "text": "So you've got a huge neural network."}, {"time": 2343, "text": "Let's suppose you've got, you have a huge neural network, you have a huge number of parameters."}, {"time": 2349, "text": "And now let's pretend everything is linear, which is not, let's just pretend."}, {"time": 2353, "text": "Then there is this big subspace where your neural network achieves zero error."}, {"time": 2358, "text": "And SGD is going to find approximately the point."}, {"time": 2362, "text": "Approximately the point with the smallest norm in that subspace."}, {"time": 2367, "text": "And that can also be proven to be insensitive to the small randomness in the data when the dimensionality is high."}, {"time": 2375, "text": "But when the dimensionality of the data is equal to the dimensionality of the model, then there is a one to one correspondence between all the data sets and the models."}, {"time": 2384, "text": "So small changes in the data set actually lead to large changes in the model."}, {"time": 2387, "text": "And that's why performance gets worse."}, {"time": 2388, "text": "So this is the best explanation more or less."}, {"time": 2392, "text": "So then it would be good for the model to have more parameters, so to be bigger than the data."}, {"time": 2399, "text": "But only if you don't early stop."}, {"time": 2400, "text": "If you introduce early stop in your regularization, you can make the double descent bump almost completely disappear."}, {"time": 2406, "text": "What is early stop?"}, {"time": 2407, "text": "Early stopping is when you train your model and you monitor your validation performance."}, {"time": 2413, "text": "And then if at some point validation performance starts to get worse, you say, okay, let's stop training."}, {"time": 2417, "text": "We are good enough."}, {"time": 2420, "text": "So the magic happens after that moment."}, {"time": 2423, "text": "So you don't want to do the early stopping."}, {"time": 2425, "text": "Well, if you don't do the early stopping, you get the very pronounced double descent."}, {"time": 2429, "text": "Do you have any intuition why this happens?"}, {"time": 2431, "text": "Double descent?"}, {"time": 2432, "text": "Oh, sorry, early stopping?"}, {"time": 2433, "text": "No, the double descent."}, {"time": 2434, "text": "So the... Well, yeah, so I try... Let's see."}, {"time": 2437, "text": "The intuition is basically is this, that when the data set has as many degrees of freedom as the model, then there is a one to one correspondence between them."}, {"time": 2448, "text": "And so small changes to the data set lead to noticeable changes in the model."}, {"time": 2453, "text": "So your model is very sensitive to all the randomness."}, {"time": 2455, "text": "It is unable to discard it."}, {"time": 2457, "text": "Whereas it turns out that when you have a lot more data than parameters or a lot more parameters than data, the resulting solution will be insensitive to small changes in the data set."}, {"time": 2469, "text": "Oh, so it's able to, let's nicely put, discard the small changes, the randomness."}, {"time": 2474, "text": "The randomness, exactly."}, {"time": 2475, "text": "The spurious correlation which you don't want."}, {"time": 2479, "text": "Jeff Hinton suggested we need to throw back propagation."}, {"time": 2482, "text": "We already kind of talked about this a little bit, but he suggested that we need to throw away back propagation and start over."}, {"time": 2488, "text": "I mean, of course some of that is a little bit wit and humor, but what do you think?"}, {"time": 2494, "text": "What could be an alternative method of training neural networks?"}, {"time": 2497, "text": "Well, the thing that he said precisely is that to the extent that you can't find back propagation in the brain, it's worth seeing if we can learn something from how the brain learns."}, {"time": 2507, "text": "But back propagation is very useful and we should keep using it."}, {"time": 2510, "text": "Oh, you're saying that once we discover the mechanism of learning in the brain, or any aspects of that mechanism, we should also try to implement that in neural networks?"}, {"time": 2519, "text": "If it turns out that we can't find back propagation in the brain."}, {"time": 2521, "text": "If we can't find back propagation in the brain."}, {"time": 2526, "text": "Well, so I guess your answer to that is back propagation is pretty damn useful."}, {"time": 2532, "text": "So why are we complaining?"}, {"time": 2534, "text": "I mean, I personally am a big fan of back propagation."}, {"time": 2536, "text": "I think it's a great algorithm because it solves an extremely fundamental problem, which is finding a neural circuit subject to some constraints."}, {"time": 2547, "text": "And I don't see that problem going away."}, {"time": 2548, "text": "So that's why I really, I think it's pretty unlikely that we'll have anything which is going to be dramatically different."}, {"time": 2557, "text": "It could happen, but I wouldn't bet on it right now."}, {"time": 2561, "text": "So let me ask a sort of big picture question."}, {"time": 2572, "text": "Well, if you look, for example, at AlphaGo or AlphaZero, the neural network of AlphaZero plays Go, which we all agree is a game that requires reasoning, better than 99.9% of all humans."}, {"time": 2587, "text": "Just the neural network, without the search, just the neural network itself."}, {"time": 2591, "text": "Doesn't that give us an existence proof that neural networks can reason?"}, {"time": 2595, "text": "To push back and disagree a little bit, we all agree that Go is reasoning."}, {"time": 2600, "text": "I think I agree, I don't think it's a trivial, so obviously reasoning like intelligence is a loose gray area term a little bit."}, {"time": 2611, "text": "Maybe you disagree with that."}, {"time": 2612, "text": "But yes, I think it has some of the same elements of reasoning."}, {"time": 2617, "text": "Reasoning is almost like akin to search, right?"}, {"time": 2621, "text": "There's a sequential element of reasoning of stepwise consideration of possibilities and sort of building on top of those possibilities in a sequential manner until you arrive at some insight."}, {"time": 2637, "text": "So yeah, I guess playing Go is kind of like that."}, {"time": 2640, "text": "And when you have a single neural network doing that without search, it's kind of like that."}, {"time": 2644, "text": "So there's an existence proof in a particular constrained environment that a process akin to what many people call reasoning exists, but more general kind of reasoning."}, {"time": 2657, "text": "So off the board."}, {"time": 2658, "text": "There is one other existence proof."}, {"time": 2660, "text": "Oh boy, which one?"}, {"time": 2662, "text": "Us humans?"}, {"time": 2663, "text": "Okay, all right, so do you think the architecture that will allow neural networks to reason will look similar to the neural network architectures we have today?"}, {"time": 2678, "text": "I think it will."}, {"time": 2679, "text": "I think, well, I don't wanna make two overly definitive statements."}, {"time": 2684, "text": "I think it's definitely possible that the neural networks that will produce the reasoning breakthroughs of the future will be very similar to the architectures that exist today."}, {"time": 2693, "text": "Maybe a little bit more recurrent, maybe a little bit deeper."}, {"time": 2697, "text": "But these neural nets are so insanely powerful."}, {"time": 2702, "text": "Why wouldn't they be able to learn to reason?"}, {"time": 2705, "text": "Humans can reason."}, {"time": 2707, "text": "So why can't neural networks?"}, {"time": 2709, "text": "So do you think the kind of stuff we've seen neural networks do is a kind of just weak reasoning?"}, {"time": 2714, "text": "So it's not a fundamentally different process."}, {"time": 2716, "text": "Again, this is stuff nobody knows the answer to."}, {"time": 2719, "text": "So when it comes to our neural networks, the thing which I would say is that neural networks are capable of reasoning."}, {"time": 2728, "text": "But if you train a neural network on a task which doesn't require reasoning, it's not going to reason."}, {"time": 2734, "text": "This is a well known effect where the neural network will solve the problem that you pose in front of it in the easiest way possible."}, {"time": 2744, "text": "Right, that takes us to one of the brilliant sort of ways you've described neural networks, which is you've referred to neural networks as the search for small circuits and maybe general intelligence as the search for small programs, which I found as a metaphor very compelling."}, {"time": 2766, "text": "Can you elaborate on that difference?"}, {"time": 2769, "text": "Yeah, so the thing which I said precisely was that if you can find the shortest program that outputs the data at your disposal, then you will be able to use it to make the best prediction possible."}, {"time": 2785, "text": "And that's a theoretical statement which can be proved mathematically."}, {"time": 2789, "text": "Now, you can also prove mathematically that finding the shortest program which generates some data is not a computable operation."}, {"time": 2798, "text": "No finite amount of compute can do this."}, {"time": 2802, "text": "So then with neural networks, neural networks are the next best thing that actually works in practice."}, {"time": 2810, "text": "We are not able to find the best, the shortest program which generates our data, but we are able to find a small, but now that statement should be amended, even a large circuit which fits our data in some way."}, {"time": 2825, "text": "Well, I think what you meant by the small circuit is the smallest needed circuit."}, {"time": 2830, "text": "Well, the thing which I would change now, back then I really haven't fully internalized the overparameterized results."}, {"time": 2837, "text": "The things we know about overparameterized neural nets, now I would phrase it as a large circuit whose weights contain a small amount of information, which I think is what's going on."}, {"time": 2849, "text": "If you imagine the training process of a neural network as you slowly transmit entropy from the dataset to the parameters, then somehow the amount of information in the weights ends up being not very large, which would explain why they generalize so well."}, {"time": 2865, "text": "So the large circuit might be one that's helpful for the generalization."}, {"time": 2871, "text": "Yeah, something like this."}, {"time": 2874, "text": "But do you see it important to be able to try to learn something like programs?"}, {"time": 2882, "text": "I mean, if we can, definitely."}, {"time": 2884, "text": "I think it's kind of, the answer is kind of yes, if we can do it, we should do things that we can do it."}, {"time": 2891, "text": "It's the reason we are pushing on deep learning, the fundamental reason, the root cause is that we are able to train them."}, {"time": 2901, "text": "So in other words, training comes first."}, {"time": 2903, "text": "We've got our pillar, which is the training pillar."}, {"time": 2907, "text": "And now we're trying to contort our neural networks around the training pillar."}, {"time": 2910, "text": "We gotta stay trainable."}, {"time": 2911, "text": "This is an invariant we cannot violate."}, {"time": 2916, "text": "And so being trainable means starting from scratch, knowing nothing, you can actually pretty quickly converge towards knowing a lot."}, {"time": 2924, "text": "Or even slowly."}, {"time": 2925, "text": "But it means that given the resources at your disposal, you can train the neural net and get it to achieve useful performance."}, {"time": 2935, "text": "Yeah, that's a pillar we can't move away from."}, {"time": 2938, "text": "Because if you say, hey, let's find the shortest program, well, we can't do that."}, {"time": 2942, "text": "So it doesn't matter how useful that would be."}, {"time": 2946, "text": "We can't do it."}, {"time": 2947, "text": "So we won't."}, {"time": 2948, "text": "So do you think, you kind of mentioned that the neural networks are good at finding small circuits or large circuits."}, {"time": 2954, "text": "Do you think then the matter of finding small programs is just the data?"}, {"time": 2960, "text": "So the, sorry, not the size or the type of data."}, {"time": 2965, "text": "Sort of ask, giving it programs."}, {"time": 2968, "text": "Well, I think the thing is that right now, finding, there are no good precedents of people successfully finding programs really well."}, {"time": 2978, "text": "And so the way you'd find programs is you'd train a deep neural network to do it basically."}, {"time": 2985, "text": "Which is the right way to go about it."}, {"time": 2988, "text": "But there's not good illustrations of that."}, {"time": 2990, "text": "It hasn't been done yet."}, {"time": 2991, "text": "But in principle, it should be possible."}, {"time": 2996, "text": "Can you elaborate a little bit, what's your answer in principle?"}, {"time": 3000, "text": "Put another way, you don't see why it's not possible."}, {"time": 3004, "text": "Well, it's kind of like more, it's more a statement of, I think that it's, I think that it's unwise to bet against deep learning."}, {"time": 3013, "text": "And if it's a cognitive function that humans seem to be able to do, then it doesn't take too long for some deep neural net to pop up that can do it too."}, {"time": 3025, "text": "Yeah, I'm there with you."}, {"time": 3027, "text": "I've stopped betting against neural networks at this point because they continue to surprise us."}, {"time": 3035, "text": "What about long term memory?"}, {"time": 3037, "text": "Can neural networks have long term memory?"}, {"time": 3039, "text": "Something like knowledge bases."}, {"time": 3042, "text": "So being able to aggregate important information over long periods of time that would then serve as useful sort of representations of state that you can make decisions by, so have a long term context based on which you're making the decision."}, {"time": 3061, "text": "So in some sense, the parameters already do that."}, {"time": 3066, "text": "The parameters are an aggregation of the neural, of the entirety of the neural nets experience, and so they count as long term knowledge."}, {"time": 3075, "text": "And people have trained various neural nets to act as knowledge bases and, you know, investigated with, people have investigated language models as knowledge bases."}, {"time": 3083, "text": "So there is work there."}, {"time": 3087, "text": "Yeah, but in some sense, do you think in every sense, do you think there's a, it's all just a matter of coming up with a better mechanism of forgetting the useless stuff and remembering the useful stuff?"}, {"time": 3100, "text": "Because right now, I mean, there's not been mechanisms that do remember really long term information."}, {"time": 3106, "text": "What do you mean by that precisely?"}, {"time": 3108, "text": "Precisely, I like the word precisely."}, {"time": 3111, "text": "So I'm thinking of the kind of compression of information the knowledge bases represent."}, {"time": 3120, "text": "Sort of creating a, now I apologize for my sort of human centric thinking about what knowledge is, because neural networks aren't interpretable necessarily with the kind of knowledge they have discovered."}, {"time": 3135, "text": "But a good example for me is knowledge bases, being able to build up over time something like the knowledge that Wikipedia represents."}, {"time": 3144, "text": "It's a really compressed, structured knowledge base."}, {"time": 3150, "text": "Obviously not the actual Wikipedia or the language, but like a semantic web, the dream that semantic web represented, so it's a really nice compressed knowledge base or something akin to that in the noninterpretable sense as neural networks would have."}, {"time": 3166, "text": "Well, the neural networks would be noninterpretable if you look at their weights, but their outputs should be very interpretable."}, {"time": 3172, "text": "Okay, so yeah, how do you make very smart neural networks like language models interpretable?"}, {"time": 3178, "text": "Well, you ask them to generate some text and the text will generally be interpretable."}, {"time": 3182, "text": "Do you find that the epitome of interpretability, like can you do better?"}, {"time": 3186, "text": "Like can you add, because you can't, okay, I'd like to know what does it know and what doesn't it know?"}, {"time": 3192, "text": "I would like the neural network to come up with examples where it's completely dumb and examples where it's completely brilliant."}, {"time": 3200, "text": "And the only way I know how to do that now is to generate a lot of examples and use my human judgment."}, {"time": 3206, "text": "But it would be nice if a neural network had some self awareness about it."}, {"time": 3211, "text": "Yeah, 100%, I'm a big believer in self awareness and I think that, I think neural net self awareness will allow for things like the capabilities, like the ones you described, like for them to know what they know and what they don't know and for them to know where to invest to increase their skills most optimally."}, {"time": 3230, "text": "And to your question of interpretability, there are actually two answers to that question."}, {"time": 3234, "text": "One answer is, you know, we have the neural net so we can analyze the neurons and we can try to understand what the different neurons and different layers mean."}, {"time": 3242, "text": "And you can actually do that and OpenAI has done some work on that."}, {"time": 3245, "text": "But there is a different answer, which is that, I would say that's the human centric answer where you say, you know, you look at a human being, you can't read, how do you know what a human being is thinking?"}, {"time": 3258, "text": "You ask them, you say, hey, what do you think about this?"}, {"time": 3262, "text": "And you get some answers."}, {"time": 3264, "text": "The answers you get are sticky in the sense you already have a mental model."}, {"time": 3268, "text": "You already have a mental model of that human being."}, {"time": 3272, "text": "You already have an understanding of like a big conception of that human being, how they think, what they know, how they see the world and then everything you ask, you're adding onto that."}, {"time": 3285, "text": "And that stickiness seems to be, that's one of the really interesting qualities of the human being is that information is sticky."}, {"time": 3295, "text": "You don't, you seem to remember the useful stuff, aggregate it well and forget most of the information that's not useful, that process."}, {"time": 3302, "text": "But that's also pretty similar to the process that neural networks do."}, {"time": 3306, "text": "It's just that neural networks are much crappier at this time."}, {"time": 3310, "text": "It doesn't seem to be fundamentally that different."}, {"time": 3313, "text": "But just to stick on reasoning for a little longer, you said, why not?"}, {"time": 3318, "text": "Why can't I reason?"}, {"time": 3319, "text": "What's a good impressive feat, benchmark to you of reasoning that you'll be impressed by if neural networks were able to do?"}, {"time": 3330, "text": "Is that something you already have in mind?"}, {"time": 3332, "text": "Well, I think writing really good code, I think proving really hard theorems, solving open ended problems with out of the box solutions."}, {"time": 3345, "text": "And sort of theorem type, mathematical problems."}, {"time": 3349, "text": "Yeah, I think those ones are a very natural example as well."}, {"time": 3352, "text": "If you can prove an unproven theorem, then it's hard to argue you don't reason."}, {"time": 3357, "text": "And so by the way, and this comes back to the point about the hard results, if you have machine learning, deep learning as a field is very fortunate because we have the ability to sometimes produce these unambiguous results."}, {"time": 3370, "text": "And when they happen, the debate changes, the conversation changes."}, {"time": 3374, "text": "It's a converse, we have the ability to produce conversation changing results."}, {"time": 3379, "text": "Conversation, and then of course, just like you said, people kind of take that for granted and say that wasn't actually a hard problem."}, {"time": 3385, "text": "Well, I mean, at some point we'll probably run out of hard problems."}, {"time": 3389, "text": "Yeah, that whole mortality thing is kind of a sticky problem that we haven't quite figured out."}, {"time": 3395, "text": "Maybe we'll solve that one."}, {"time": 3397, "text": "I think one of the fascinating things in your entire body of work, but also the work at OpenAI recently, one of the conversation changes has been in the world of language models."}, {"time": 3407, "text": "Can you briefly kind of try to describe the recent history of using neural networks in the domain of language and text?"}, {"time": 3414, "text": "Well, there's been lots of history."}, {"time": 3416, "text": "I think the Elman network was a small, tiny recurrent neural network applied to language back in the 80s."}, {"time": 3423, "text": "So the history is really, you know, fairly long at least."}, {"time": 3428, "text": "And the thing that started, the thing that changed the trajectory of neural networks and language is the thing that changed the trajectory of all deep learning and that's data and compute."}, {"time": 3439, "text": "So suddenly you move from small language models, which learn a little bit, and with language models in particular, there's a very clear explanation for why they need to be large to be good, because they're trying to predict the next word."}, {"time": 3454, "text": "So when you don't know anything, you'll notice very, very broad strokes, surface level patterns, like sometimes there are characters and there is a space between those characters."}, {"time": 3466, "text": "You'll notice this pattern."}, {"time": 3467, "text": "And you'll notice that sometimes there is a comma and then the next character is a capital letter."}, {"time": 3471, "text": "You'll notice that pattern."}, {"time": 3473, "text": "Eventually you may start to notice that there are certain words occur often."}, {"time": 3477, "text": "You may notice that spellings are a thing."}, {"time": 3479, "text": "You may notice syntax."}, {"time": 3480, "text": "And when you get really good at all these, you start to notice the semantics."}, {"time": 3485, "text": "You start to notice the facts."}, {"time": 3487, "text": "But for that to happen, the language model needs to be larger."}, {"time": 3491, "text": "So that's, let's linger on that, because that's where you and Noam Chomsky disagree."}, {"time": 3498, "text": "So you think we're actually taking incremental steps, a sort of larger network, larger compute will be able to get to the semantics, to be able to understand language without what Noam likes to sort of think of as a fundamental understandings of the structure of language, like imposing your theory of language onto the learning mechanism."}, {"time": 3525, "text": "So you're saying the learning, you can learn from raw data, the mechanism that underlies language."}, {"time": 3533, "text": "Well, I think it's pretty likely, but I also want to say that I don't really know precisely what Chomsky means when he talks about him."}, {"time": 3545, "text": "You said something about imposing your structural language."}, {"time": 3548, "text": "I'm not 100% sure what he means, but empirically it seems that when you inspect those larger language models, they exhibit signs of understanding the semantics whereas the smaller language models do not."}, {"time": 3558, "text": "We've seen that a few years ago when we did work on the sentiment neuron."}, {"time": 3561, "text": "We trained a small, you know, smallish LSTM to predict the next character in Amazon reviews."}, {"time": 3568, "text": "And we noticed that when you increase the size of the LSTM from 500 LSTM cells to 4,000 LSTM cells, then one of the neurons starts to represent the sentiment of the article, sorry, of the review."}, {"time": 3582, "text": "Sentiment is a pretty semantic attribute."}, {"time": 3585, "text": "It's not a syntactic attribute."}, {"time": 3586, "text": "And for people who might not know, I don't know if that's a standard term, but sentiment is whether it's a positive or a negative review."}, {"time": 3592, "text": "Is the person happy with something or is the person unhappy with something?"}, {"time": 3595, "text": "And so here we had very clear evidence that a small neural net does not capture sentiment while a large neural net does."}, {"time": 3603, "text": "And why is that?"}, {"time": 3604, "text": "Well, our theory is that at some point you run out of syntax to models, you start to gotta focus on something else."}, {"time": 3611, "text": "And with size, you quickly run out of syntax to model and then you really start to focus on the semantics would be the idea."}, {"time": 3620, "text": "And so I don't wanna imply that our models have complete semantic understanding because that's not true, but they definitely are showing signs of semantic understanding, partial semantic understanding, but the smaller models do not show those signs."}, {"time": 3634, "text": "Can you take a step back and say, what is GPT2, which is one of the big language models that was the conversation changer in the past couple of years?"}, {"time": 3643, "text": "Yeah, so GPT2 is a transformer with one and a half billion parameters that was trained on about 40 billion tokens of text which were obtained from web pages that were linked to from Reddit articles with more than three outputs."}, {"time": 3662, "text": "And what's a transformer?"}, {"time": 3663, "text": "The transformer, it's the most important advance in neural network architectures in recent history."}, {"time": 3669, "text": "What is attention maybe too?"}, {"time": 3671, "text": "Cause I think that's an interesting idea, not necessarily sort of technically speaking, but the idea of attention versus maybe what recurrent neural networks represent."}, {"time": 3681, "text": "Yeah, so the thing is the transformer is a combination of multiple ideas simultaneously of which attention is one."}, {"time": 3688, "text": "Do you think attention is the key?"}, {"time": 3689, "text": "No, it's a key, but it's not the key."}, {"time": 3692, "text": "The transformer is successful because it is the simultaneous combination of multiple ideas."}, {"time": 3697, "text": "And if you were to remove either idea, it would be much less successful."}, {"time": 3701, "text": "So the transformer uses a lot of attention, but attention existed for a few years."}, {"time": 3705, "text": "So that can't be the main innovation."}, {"time": 3708, "text": "The transformer is designed in such a way that it runs really fast on the GPU."}, {"time": 3716, "text": "And that makes a huge amount of difference."}, {"time": 3718, "text": "This is one thing."}, {"time": 3719, "text": "The second thing is that transformer is not recurrent."}, {"time": 3722, "text": "And that is really important too, because it is more shallow and therefore much easier to optimize."}, {"time": 3728, "text": "So in other words, users attention, it is a really great fit to the GPU and it is not recurrent, so therefore less deep and easier to optimize."}, {"time": 3737, "text": "And the combination of those factors make it successful."}, {"time": 3740, "text": "So now it makes great use of your GPU."}, {"time": 3744, "text": "It allows you to achieve better results for the same amount of compute."}, {"time": 3748, "text": "And that's why it's successful."}, {"time": 3751, "text": "Were you surprised how well transformers worked and GPT2 worked?"}, {"time": 3756, "text": "So you worked on language."}, {"time": 3757, "text": "You've had a lot of great ideas before transformers came about in language."}, {"time": 3762, "text": "So you got to see the whole set of revolutions before and after."}, {"time": 3766, "text": "Were you surprised?"}, {"time": 3767, "text": "Yeah, a little."}, {"time": 3768, "text": "A little?"}, {"time": 3770, "text": "I mean, it's hard to remember because you adapt really quickly, but it definitely was surprising."}, {"time": 3775, "text": "It definitely was."}, {"time": 3776, "text": "In fact, you know what?"}, {"time": 3779, "text": "I'll retract my statement."}, {"time": 3780, "text": "It was pretty amazing."}, {"time": 3782, "text": "It was just amazing to see generate this text of this."}, {"time": 3786, "text": "And you know, you gotta keep in mind that at that time we've seen all this progress in GANs in improving the samples produced by GANs were just amazing."}, {"time": 3794, "text": "You have these realistic faces, but text hasn't really moved that much."}, {"time": 3797, "text": "And suddenly we moved from, you know, whatever GANs were in 2015 to the best, most amazing GANs in one step."}, {"time": 3806, "text": "And that was really stunning."}, {"time": 3807, "text": "Even though theory predicted, yeah, you train a big language model, of course you should get this, but then to see it with your own eyes, it's something else."}, {"time": 3814, "text": "And yet we adapt really quickly."}, {"time": 3817, "text": "And now there's sort of some cognitive scientists write articles saying that GPT2 models don't truly understand language."}, {"time": 3829, "text": "So we adapt quickly to how amazing the fact that they're able to model the language so well is."}, {"time": 3835, "text": "So what do you think is the bar?"}, {"time": 3839, "text": "For impressing us that it..."}, {"time": 3843, "text": "Do you think that bar will continuously be moved?"}, {"time": 3846, "text": "I think when you start to see really dramatic economic impact, that's when I think that's in some sense the next barrier."}, {"time": 3853, "text": "Because right now, if you think about the work in AI, it's really confusing."}, {"time": 3858, "text": "It's really hard to know what to make of all these advances."}, {"time": 3862, "text": "It's kind of like, okay, you got an advance and now you can do more things and you've got another improvement and you've got another cool demo."}, {"time": 3870, "text": "At some point, I think people who are outside of AI, they can no longer distinguish this progress anymore."}, {"time": 3878, "text": "So we were talking offline about translating Russian to English and how there's a lot of brilliant work in Russian that the rest of the world doesn't know about."}, {"time": 3886, "text": "That's true for Chinese, it's true for a lot of scientists and just artistic work in general."}, {"time": 3892, "text": "Do you think translation is the place where we're going to see sort of economic big impact?"}, {"time": 3897, "text": "I think there is a huge number of..."}, {"time": 3900, "text": "I mean, first of all, I wanna point out that translation already today is huge."}, {"time": 3905, "text": "I think billions of people interact with big chunks of the internet primarily through translation."}, {"time": 3911, "text": "So translation is already huge and it's hugely positive too."}, {"time": 3916, "text": "I think self driving is going to be hugely impactful and that's, it's unknown exactly when it happens, but again, I would not bet against deep learning, so I..."}, {"time": 3927, "text": "So there's deep learning in general, but you think this..."}, {"time": 3930, "text": "Deep learning for self driving."}, {"time": 3931, "text": "Yes, deep learning for self driving."}, {"time": 3933, "text": "But I was talking about sort of language models."}, {"time": 3936, "text": "Just to check."}, {"time": 3936, "text": "Beard off a little bit."}, {"time": 3938, "text": "Just to check, you're not seeing a connection between driving and language."}, {"time": 3942, "text": "Or rather both use neural nets."}, {"time": 3944, "text": "That'd be a poetic connection."}, {"time": 3945, "text": "I think there might be some, like you said, there might be some kind of unification towards a kind of multitask transformers that can take on both language and vision tasks."}, {"time": 3958, "text": "That'd be an interesting unification."}, {"time": 3961, "text": "Now let's see, what can I ask about GPT two more?"}, {"time": 3965, "text": "There's not much to ask."}, {"time": 3966, "text": "It's, you take a transform, you make it bigger, you give it more data, and suddenly it does all those amazing things."}, {"time": 3972, "text": "Yeah, one of the beautiful things is that GPT, the transformers are fundamentally simple to explain, to train."}, {"time": 3980, "text": "Do you think bigger will continue to show better results in language?"}, {"time": 3988, "text": "Sort of like what are the next steps with GPT two, do you think?"}, {"time": 3991, "text": "I mean, I think for sure seeing what larger versions can do is one direction."}, {"time": 3997, "text": "Also, I mean, there are many questions."}, {"time": 4001, "text": "There's one question which I'm curious about and that's the following."}, {"time": 4003, "text": "So right now GPT two, so we feed it all this data from the internet, which means that it needs to memorize all those random facts about everything in the internet."}, {"time": 4011, "text": "And it would be nice if the model could somehow use its own intelligence to decide what data it wants to accept and what data it wants to reject."}, {"time": 4023, "text": "Just like people."}, {"time": 4024, "text": "People don't learn all data indiscriminately."}, {"time": 4027, "text": "We are super selective about what we learn."}, {"time": 4029, "text": "And I think this kind of active learning, I think would be very nice to have."}, {"time": 4034, "text": "Yeah, listen, I love active learning."}, {"time": 4036, "text": "So let me ask, does the selection of data, can you just elaborate that a little bit more?"}, {"time": 4043, "text": "Do you think the selection of data is, like I have this kind of sense that the optimization of how you select data, so the active learning process is going to be a place for a lot of breakthroughs, even in the near future?"}, {"time": 4062, "text": "Because there hasn't been many breakthroughs there that are public."}, {"time": 4065, "text": "I feel like there might be private breakthroughs that companies keep to themselves because the fundamental problem has to be solved if you want to solve self driving, if you want to solve a particular task."}, {"time": 4075, "text": "What do you think about the space in general?"}, {"time": 4077, "text": "Yeah, so I think that for something like active learning, or in fact, for any kind of capability, like active learning, the thing that it really needs is a problem."}, {"time": 4085, "text": "It needs a problem that requires it."}, {"time": 4089, "text": "It's very hard to do research about the capability if you don't have a task, because then what's going to happen is that you will come up with an artificial task, get good results, but not really convince anyone."}, {"time": 4100, "text": "Right, like we're now past the stage where getting a result on MNIST, some clever formulation of MNIST will convince people."}, {"time": 4110, "text": "That's right, in fact, you could quite easily come up with a simple active learning scheme on MNIST and get a 10x speed up, but then, so what?"}, {"time": 4119, "text": "And I think that with active learning, the need, active learning will naturally arise as problems that require it pop up."}, {"time": 4129, "text": "That's how I would, that's my take on it."}, {"time": 4131, "text": "There's another interesting thing that OpenAI has brought up with GPT2, which is when you create a powerful artificial intelligence system, and it was unclear what kind of detrimental, once you release GPT2, what kind of detrimental effect it will have."}, {"time": 4149, "text": "Because if you have a model that can generate a pretty realistic text, you can start to imagine that it would be used by bots in some way that we can't even imagine."}, {"time": 4161, "text": "So there's this nervousness about what is possible to do."}, {"time": 4164, "text": "So you did a really kind of brave and I think profound thing, which is start a conversation about this."}, {"time": 4170, "text": "How do we release powerful artificial intelligence models to the public?"}, {"time": 4176, "text": "If we do it all, how do we privately discuss with other, even competitors, about how we manage the use of the systems and so on?"}, {"time": 4186, "text": "So from this whole experience, you released a report on it, but in general, are there any insights that you've gathered from just thinking about this, about how you release models like this?"}, {"time": 4197, "text": "I mean, I think that my take on this is that the field of AI has been in a state of childhood."}, {"time": 4205, "text": "And now it's exiting that state and it's entering a state of maturity."}, {"time": 4209, "text": "What that means is that AI is very successful and also very impactful."}, {"time": 4214, "text": "And its impact is not only large, but it's also growing."}, {"time": 4216, "text": "And so for that reason, it seems wise to start thinking about the impact of our systems before releasing them, maybe a little bit too soon, rather than a little bit too late."}, {"time": 4228, "text": "And with the case of GPT2, like I mentioned earlier, the results really were stunning."}, {"time": 4234, "text": "And it seemed plausible, it didn't seem certain, it seemed plausible that something like GPT2 could easily use to reduce the cost of this information."}, {"time": 4244, "text": "And so there was a question of what's the best way to release it, and a staged release seemed logical."}, {"time": 4249, "text": "A small model was released, and there was time to see the, many people use these models in lots of cool ways."}, {"time": 4257, "text": "There've been lots of really cool applications."}, {"time": 4259, "text": "There haven't been any negative application to be known of."}, {"time": 4263, "text": "And so eventually it was released, but also other people replicated similar models."}, {"time": 4267, "text": "That's an interesting question though that we know of."}, {"time": 4270, "text": "So in your view, staged release, is at least part of the answer to the question of how do we, what do we do once we create a system like this?"}, {"time": 4282, "text": "It's part of the answer, yes."}, {"time": 4284, "text": "Is there any other insights?"}, {"time": 4286, "text": "Like say you don't wanna release the model at all, because it's useful to you for whatever the business is."}, {"time": 4292, "text": "Well, plenty of people don't release models already."}, {"time": 4296, "text": "Right, of course, but is there some moral, ethical responsibility when you have a very powerful model to sort of communicate?"}, {"time": 4304, "text": "Like, just as you said, when you had GPT2, it was unclear how much it could be used for misinformation."}, {"time": 4311, "text": "It's an open question, and getting an answer to that might require that you talk to other really smart people that are outside of your particular group."}, {"time": 4320, "text": "Have you, please tell me there's some optimistic pathway for people to be able to use this model for people across the world to collaborate on these kinds of cases?"}, {"time": 4334, "text": "Or is it still really difficult from one company to talk to another company?"}, {"time": 4339, "text": "So it's definitely possible."}, {"time": 4341, "text": "It's definitely possible to discuss these kind of models with colleagues elsewhere, and to get their take on what to do."}, {"time": 4352, "text": "How hard is it though?"}, {"time": 4356, "text": "Do you see that happening?"}, {"time": 4358, "text": "I think that's a place where it's important to gradually build trust between companies."}, {"time": 4363, "text": "Because ultimately, all the AI developers are building technology which is going to be increasingly more powerful."}, {"time": 4370, "text": "And so it's, the way to think about it is that ultimately we're all in it together."}, {"time": 4378, "text": "Yeah, I tend to believe in the better angels of our nature, but I do hope that when you build a really powerful AI system in a particular domain, that you also think about the potential negative consequences of, yeah."}, {"time": 4401, "text": "It's an interesting and scary possibility that there will be a race for AI development that would push people to close that development, and not share ideas with others."}, {"time": 4411, "text": "I don't love this."}, {"time": 4412, "text": "I've been a pure academic for 10 years."}, {"time": 4414, "text": "I really like sharing ideas and it's fun, it's exciting."}, {"time": 4419, "text": "What do you think it takes to, let's talk about AGI a little bit."}, {"time": 4425, "text": "We talked about reasoning, we talked about long term memory, but in general, what does it take, do you think?"}, {"time": 4431, "text": "Well, I can't be sure."}, {"time": 4435, "text": "But I think the deep learning, plus maybe another, plus maybe another small idea."}, {"time": 4443, "text": "Do you think self play will be involved?"}, {"time": 4445, "text": "So you've spoken about the powerful mechanism of self play where systems learn by sort of exploring the world in a competitive setting against other entities that are similarly skilled as them, and so incrementally improve in this way."}, {"time": 4463, "text": "Do you think self play will be a component of building an AGI system?"}, {"time": 4466, "text": "Yeah, so what I would say, to build AGI, I think it's going to be deep learning plus some ideas."}, {"time": 4474, "text": "And I think self play will be one of those ideas."}, {"time": 4477, "text": "I think that that is a very, self play has this amazing property that it can surprise us in truly novel ways."}, {"time": 4488, "text": "For example, like we, I mean, pretty much every self play system, both are Dota bot."}, {"time": 4498, "text": "I don't know if, OpenAI had a release about multi agent where you had two little agents who were playing hide and seek."}, {"time": 4506, "text": "And of course, also alpha zero."}, {"time": 4508, "text": "They were all produced surprising behaviors."}, {"time": 4511, "text": "They all produce behaviors that we didn't expect."}, {"time": 4513, "text": "They are creative solutions to problems."}, {"time": 4515, "text": "And that seems like an important part of AGI that our systems don't exhibit routinely right now."}, {"time": 4522, "text": "And so that's why I like this area."}, {"time": 4524, "text": "I like this direction because of its ability to surprise us."}, {"time": 4527, "text": "To surprise us."}, {"time": 4528, "text": "And an AGI system would surprise us fundamentally."}, {"time": 4532, "text": "And to be precise, not just a random surprise, but to find the surprising solution to a problem that's also useful."}, {"time": 4539, "text": "Now, a lot of the self play mechanisms have been used in the game context or at least in the simulation context."}, {"time": 4548, "text": "How far along the path to AGI do you think will be done in simulation?"}, {"time": 4556, "text": "How much faith, promise do you have in simulation versus having to have a system that operates in the real world?"}, {"time": 4565, "text": "Whether it's the real world of digital real world data or real world like actual physical world of robotics."}, {"time": 4573, "text": "I don't think it's an easy or."}, {"time": 4575, "text": "I think simulation is a tool and it helps."}, {"time": 4577, "text": "It has certain strengths and certain weaknesses and we should use it."}, {"time": 4581, "text": "Yeah, but okay, I understand that."}, {"time": 4584, "text": "That's true, but one of the criticisms of self play, one of the criticisms of reinforcement learning is one of the, its current power, its current results, while amazing, have been demonstrated in a simulated environments or very constrained physical environments."}, {"time": 4606, "text": "Do you think it's possible to escape them, escape the simulator environments and be able to learn in non simulator environments?"}, {"time": 4613, "text": "Or do you think it's possible to also just simulate in a photo realistic and physics realistic way, the real world in a way that we can solve real problems with self play in simulation?"}, {"time": 4626, "text": "So I think that transfer from simulation to the real world is definitely possible and has been exhibited many times by many different groups."}, {"time": 4636, "text": "It's been especially successful in vision."}, {"time": 4638, "text": "Also open AI in the summer has demonstrated a robot hand which was trained entirely in simulation in a certain way that allowed for seem to real transfer to occur."}, {"time": 4649, "text": "Is this for the Rubik's cube?"}, {"time": 4652, "text": "I wasn't aware that was trained in simulation."}, {"time": 4654, "text": "It was trained in simulation entirely."}, {"time": 4657, "text": "Really, so it wasn't in the physical, the hand wasn't trained?"}, {"time": 4660, "text": "No, 100% of the training was done in simulation and the policy that was learned in simulation was trained to be very adaptive."}, {"time": 4668, "text": "So adaptive that when you transfer it, it could very quickly adapt to the physical world."}, {"time": 4673, "text": "So the kind of perturbations with the giraffe or whatever the heck it was, those weren't, were those part of the simulation?"}, {"time": 4681, "text": "Well, the simulation was generally, so the simulation was trained to be robust to many different things, but not the kind of perturbations we've had in the video."}, {"time": 4690, "text": "So it's never been trained with a glove."}, {"time": 4692, "text": "It's never been trained with a stuffed giraffe."}, {"time": 4697, "text": "So in theory, these are novel perturbations."}, {"time": 4699, "text": "Correct, it's not in theory, in practice."}, {"time": 4702, "text": "Those are novel perturbations?"}, {"time": 4703, "text": "Well, that's okay."}, {"time": 4706, "text": "That's a clean, small scale, but clean example of a transfer from the simulated world to the physical world."}, {"time": 4712, "text": "Yeah, and I will also say that I expect the transfer capabilities of deep learning to increase in general."}, {"time": 4718, "text": "And the better the transfer capabilities are, the more useful simulation will become."}, {"time": 4723, "text": "Because then you could take, you could experience something in simulation and then learn a moral of the story, which you could then carry with you to the real world."}, {"time": 4733, "text": "As humans do all the time when they play computer games."}, {"time": 4736, "text": "So let me ask sort of a embodied question, staying on AGI for a sec."}, {"time": 4744, "text": "Do you think AGI system would need to have a body?"}, {"time": 4747, "text": "We need to have some of those human elements of self awareness, consciousness, sort of fear of mortality, sort of self preservation in the physical space, which comes with having a body."}, {"time": 4760, "text": "I think having a body will be useful."}, {"time": 4762, "text": "I don't think it's necessary, but I think it's very useful to have a body for sure, because you can learn a whole new, you can learn things which cannot be learned without a body."}, {"time": 4772, "text": "But at the same time, I think that if you don't have a body, you could compensate for it and still succeed."}, {"time": 4780, "text": "Well, there is evidence for this."}, {"time": 4781, "text": "For example, there are many people who were born deaf and blind and they were able to compensate for the lack of modalities."}, {"time": 4788, "text": "I'm thinking about Helen Keller specifically."}, {"time": 4791, "text": "So even if you're not able to physically interact with the world, and if you're not able to, I mean, I actually was getting at, maybe let me ask on the more particular, I'm not sure if it's connected to having a body or not, but the idea of consciousness and a more constrained version of that is self awareness."}, {"time": 4811, "text": "Do you think an AGI system should have consciousness?"}, {"time": 4816, "text": "We can't define, whatever the heck you think consciousness is."}, {"time": 4819, "text": "Yeah, hard question to answer, given how hard it is to define it."}, {"time": 4824, "text": "Do you think it's useful to think about?"}, {"time": 4826, "text": "I mean, it's definitely interesting."}, {"time": 4829, "text": "I think it's definitely possible that our systems will be conscious."}, {"time": 4833, "text": "Do you think that's an emergent thing that just comes from, do you think consciousness could emerge from the representation that's stored within neural networks?"}, {"time": 4840, "text": "So like that it naturally just emerges when you become more and more, you're able to represent more and more of the world?"}, {"time": 4847, "text": "Well, I'd say I'd make the following argument, which is humans are conscious."}, {"time": 4853, "text": "And if you believe that artificial neural nets are sufficiently similar to the brain, then there should at least exist artificial neural nets you should be conscious too."}, {"time": 4864, "text": "You're leaning on that existence proof pretty heavily."}, {"time": 4866, "text": "Okay, so that's the best answer I can give."}, {"time": 4872, "text": "No, I know, I know, I know."}, {"time": 4875, "text": "There's still an open question if there's not some magic in the brain that we're not, I mean, I don't mean a non materialistic magic, but that the brain might be a lot more complicated and interesting than we give it credit for."}, {"time": 4889, "text": "If that's the case, then it should show up."}, {"time": 4892, "text": "And at some point we will find out that we can't continue to make progress."}, {"time": 4896, "text": "But I think it's unlikely."}, {"time": 4898, "text": "So we talk about consciousness, but let me talk about another poorly defined concept of intelligence."}, {"time": 4904, "text": "Again, we've talked about reasoning, we've talked about memory."}, {"time": 4908, "text": "What do you think is a good test of intelligence for you?"}, {"time": 4911, "text": "Are you impressed by the test that Alan Turing formulated with the imitation game with natural language?"}, {"time": 4918, "text": "Is there something in your mind that you will be deeply impressed by if a system was able to do?"}, {"time": 4926, "text": "I mean, lots of things."}, {"time": 4927, "text": "There's a certain frontier of capabilities today."}, {"time": 4933, "text": "And there exist things outside of that frontier."}, {"time": 4936, "text": "And I would be impressed by any such thing."}, {"time": 4938, "text": "For example, I would be impressed by a deep learning system which solves a very pedestrian task, like machine translation or computer vision task or something which never makes mistake a human wouldn't make under any circumstances."}, {"time": 4957, "text": "I think that is something which have not yet been demonstrated and I would find it very impressive."}, {"time": 4962, "text": "Yeah, so right now they make mistakes in different, they might be more accurate than human beings, but they still, they make a different set of mistakes."}, {"time": 4969, "text": "So my, I would guess that a lot of the skepticism that some people have about deep learning is when they look at their mistakes and they say, well, those mistakes, they make no sense."}, {"time": 4980, "text": "Like if you understood the concept, you wouldn't make that mistake."}, {"time": 4984, "text": "And I think that changing that would be, that would inspire me."}, {"time": 4989, "text": "That would be, yes, this is progress."}, {"time": 4992, "text": "Yeah, that's a really nice way to put it."}, {"time": 4995, "text": "But I also just don't like that human instinct to criticize a model is not intelligent."}, {"time": 5001, "text": "That's the same instinct as we do when we criticize any group of creatures as the other."}, {"time": 5008, "text": "Because it's very possible that GPT2 is much smarter than human beings at many things."}, {"time": 5016, "text": "That's definitely true."}, {"time": 5017, "text": "It has a lot more breadth of knowledge."}, {"time": 5019, "text": "Yes, breadth of knowledge and even perhaps depth on certain topics."}, {"time": 5026, "text": "It's kind of hard to judge what depth means, but there's definitely a sense in which humans don't make mistakes that these models do."}, {"time": 5034, "text": "The same is applied to autonomous vehicles."}, {"time": 5037, "text": "The same is probably gonna continue being applied to a lot of artificial intelligence systems."}, {"time": 5041, "text": "We find, this is the annoying thing."}, {"time": 5044, "text": "This is the process of, in the 21st century, the process of analyzing the progress of AI is the search for one case where the system fails in a big way where humans would not."}, {"time": 5057, "text": "And then many people writing articles about it."}, {"time": 5060, "text": "And then broadly, the public generally gets convinced that the system is not intelligent."}, {"time": 5066, "text": "And we pacify ourselves by thinking it's not intelligent because of this one anecdotal case."}, {"time": 5071, "text": "And this seems to continue happening."}, {"time": 5074, "text": "Yeah, I mean, there is truth to that."}, {"time": 5076, "text": "Although I'm sure that plenty of people are also extremely impressed by the system that exists today."}, {"time": 5080, "text": "But I think this connects to the earlier point we discussed that it's just confusing to judge progress in AI."}, {"time": 5087, "text": "And you have a new robot demonstrating something."}, {"time": 5090, "text": "How impressed should you be?"}, {"time": 5092, "text": "And I think that people will start to be impressed once AI starts to really move the needle on the GDP."}, {"time": 5100, "text": "So you're one of the people that might be able to create an AGI system here."}, {"time": 5103, "text": "Not you, but you and OpenAI."}, {"time": 5106, "text": "If you do create an AGI system and you get to spend sort of the evening with it, him, her, what would you talk about, do you think?"}, {"time": 5117, "text": "The very first time?"}, {"time": 5119, "text": "Well, the first time I would just ask all kinds of questions and try to get it to make a mistake."}, {"time": 5125, "text": "And I would be amazed that it doesn't make mistakes and just keep asking broad questions."}, {"time": 5133, "text": "What kind of questions do you think?"}, {"time": 5134, "text": "Would they be factual or would they be personal, emotional, psychological?"}, {"time": 5146, "text": "Would you ask for advice?"}, {"time": 5149, "text": "I mean, why would I limit myself talking to a system like this?"}, {"time": 5153, "text": "Now, again, let me emphasize the fact that you truly are one of the people that might be in the room where this happens."}, {"time": 5161, "text": "So let me ask sort of a profound question about, I've just talked to a Stalin historian."}, {"time": 5168, "text": "I've been talking to a lot of people who are studying power."}, {"time": 5173, "text": "Abraham Lincoln said, \"'Nearly all men can stand adversity, \"'but if you want to test a man's character, give him power.'\""}, {"time": 5181, "text": "I would say the power of the 21st century, maybe the 22nd, but hopefully the 21st, would be the creation of an AGI system and the people who have control, direct possession and control of the AGI system."}, {"time": 5196, "text": "So what do you think, after spending that evening having a discussion with the AGI system, what do you think you would do?"}, {"time": 5205, "text": "Well, the ideal world I'd like to imagine is one where humanity, I like, the board members of a company where the AGI is the CEO."}, {"time": 5219, "text": "So it would be, I would like, the picture which I would imagine is you have some kind of different entities, different countries or cities, and the people that leave their vote for what the AGI that represents them should do, and the AGI that represents them goes and does it."}, {"time": 5238, "text": "I think a picture like that, I find very appealing."}, {"time": 5243, "text": "You could have multiple AGI, you would have an AGI for a city, for a country, and there would be multiple AGI's, for a city, for a country, and there would be, it would be trying to, in effect, take the democratic process to the next level."}, {"time": 5256, "text": "And the board can always fire the CEO."}, {"time": 5258, "text": "Essentially, press the reset button, say."}, {"time": 5260, "text": "Press the reset button."}, {"time": 5261, "text": "Rerandomize the parameters."}, {"time": 5262, "text": "But let me sort of, that's actually, okay, that's a beautiful vision, I think, as long as it's possible to press the reset button."}, {"time": 5273, "text": "Do you think it will always be possible to press the reset button?"}, {"time": 5276, "text": "So I think that it definitely will be possible to build."}, {"time": 5282, "text": "So you're talking, so the question that I really understand from you is, will humans or humans people have control over the AI systems that they build?"}, {"time": 5295, "text": "And my answer is, it's definitely possible to build AI systems which will want to be controlled by their humans."}, {"time": 5301, "text": "Wow, that's part of their, so it's not that just they can't help but be controlled, but that's the, they exist, the one of the objectives of their existence is to be controlled."}, {"time": 5314, "text": "In the same way that human parents generally want to help their children, they want their children to succeed."}, {"time": 5324, "text": "It's not a burden for them."}, {"time": 5326, "text": "They are excited to help children and to feed them and to dress them and to take care of them."}, {"time": 5332, "text": "And I believe with high conviction that the same will be possible for an AGI."}, {"time": 5338, "text": "It will be possible to program an AGI, to design it in such a way that it will have a similar deep drive that it will be delighted to fulfill."}, {"time": 5347, "text": "And the drive will be to help humans flourish."}, {"time": 5351, "text": "But let me take a step back to that moment where you create the AGI system."}, {"time": 5355, "text": "I think this is a really crucial moment."}, {"time": 5357, "text": "And between that moment and the Democratic board members with the AGI at the head, there has to be a relinquishing of power."}, {"time": 5371, "text": "So as George Washington, despite all the bad things he did, one of the big things he did is he relinquished power."}, {"time": 5379, "text": "He, first of all, didn't want to be president."}, {"time": 5382, "text": "And even when he became president, he gave, he didn't keep just serving as most dictators do for indefinitely."}, {"time": 5389, "text": "Do you see yourself being able to relinquish control over an AGI system, given how much power you can have over the world, at first financial, just make a lot of money, right?"}, {"time": 5402, "text": "And then control by having possession as AGI system."}, {"time": 5407, "text": "I'd find it trivial to do that."}, {"time": 5409, "text": "I'd find it trivial to relinquish this kind of power."}, {"time": 5411, "text": "I mean, the kind of scenario you are describing sounds terrifying to me."}, {"time": 5419, "text": "I would absolutely not want to be in that position."}, {"time": 5422, "text": "Do you think you represent the majority or the minority of people in the AI community?"}, {"time": 5429, "text": "Well, I mean."}, {"time": 5430, "text": "Say open question, an important one."}, {"time": 5433, "text": "Are most people good is another way to ask it."}, {"time": 5436, "text": "So I don't know if most people are good, but I think that when it really counts, people can be better than we think."}, {"time": 5447, "text": "That's beautifully put, yeah."}, {"time": 5449, "text": "Are there specific mechanism you can think of of aligning AI values to human values?"}, {"time": 5454, "text": "Is that, do you think about these problems of continued alignment as we develop the AI systems?"}, {"time": 5462, "text": "In some sense, the kind of question which you are asking is, so if I were to translate the question to today's terms, it would be a question about how to get an RL agent that's optimizing a value function which itself is learned."}, {"time": 5481, "text": "And if you look at humans, humans are like that because the reward function, the value function of humans is not external, it is internal."}, {"time": 5490, "text": "And there are definite ideas of how to train a value function."}]}]