[{"title": "Garry Kasparov: Chess, Deep Blue, AI, and Putin | Lex Fridman Podcast #46", "id": "8RVa0THWUWw", "quotes": [{"time": 337, "text": "Now, just let's go back to these crucial chess moments where I had to make big decisions."}, {"time": 344, "text": "As I said, it was all about my belief from very early days that I can make all the difference by playing well or by making mistakes."}, {"time": 353, "text": "So yes, I always had an opponent across the chess board, opposite me."}, {"time": 360, "text": "But no matter how strong the opponent was, whether it just was ordinary player or another world champion like Anatoly Karpov, having all respect for my opponent, I still believe that it's up to me to make the difference."}, {"time": 374, "text": "And I knew I was not invincible."}, {"time": 381, "text": "I made mistakes."}, {"time": 382, "text": "I made some blunders."}, {"time": 383, "text": "And with age, I made more blunders."}, {"time": 388, "text": "So I knew it."}, {"time": 390, "text": "But it's still, it's very much for me to be decisive factor in the game."}, {"time": 397, "text": "I mean, even now, look, I just, my latest chess experience was horrible."}, {"time": 400, "text": "I mean, I played Caruana, Fabi Caruana, this number two, number two, number three player in the world these days."}, {"time": 407, "text": "We played this 960 with the Fischer, so called Fischer random chess, reshuffling pieces."}, {"time": 412, "text": "Yeah, I lost very badly, but it's because I made mistakes."}, {"time": 416, "text": "I mean, I had so many winning positions."}, {"time": 417, "text": "I mean, 15 years ago, I would have crushed him."}, {"time": 420, "text": "So, and it's, you know, while I lost, I was not so much upset."}, {"time": 425, "text": "I mean, I know, as I said in the interview, I can fight any opponent, but not my biological clock."}, {"time": 430, "text": "So it's fighting time is always a losing proposition."}, {"time": 436, "text": "But even today at age 56, you know, I knew that, you know, I could play great game."}, {"time": 442, "text": "I couldn't finish it because I didn't have enough energy or just, you know, I couldn't have the same level of concentration."}, {"time": 447, "text": "But, you know, in number of games where I completely outplayed one of the top players in the world, I mean, gave me a certain amount of pleasure."}, {"time": 455, "text": "That is, even today, I haven't lost my touch."}, {"time": 458, "text": "Not the same, you know."}, {"time": 460, "text": "Okay, the jaws are not as strong and the teeth are not as sharp, but I could get to him just, you know, almost, you know, on the ropes."}, {"time": 469, "text": "Still got it."}, {"time": 470, "text": "And it's, you know, and it's, I think it's, my wife said it well."}, {"time": 474, "text": "I mean, she said, look, Gary, it's somehow, it's not just fighting your biological clock."}, {"time": 479, "text": "It's just, you know, maybe it's a signal because, you know, the goddess of chess, since you spoke great about demons."}, {"time": 485, "text": "The goddess of chess, Keisha, maybe she didn't want you to win because, you know, if you could beat number two, number three player in the world, I mean, that's one of the top players who just recently played World Championship match."}, {"time": 499, "text": "If you could beat him, that would be really bad for the game of chess."}, {"time": 503, "text": "But just, what people will say, oh, look, the game of chess, you know, it's not making any progress."}, {"time": 508, "text": "The game is just, you know, it's totally devalued because, look, the guy coming out of retirement, you know, just, you know, winning games, maybe that was good for chess, not good for you."}, {"time": 517, "text": "But it's, look, I've been following your logic."}, {"time": 521, "text": "We should always look for, you know, demons, you know, superior forces and other things that could, you know, if not dominate our lives, but somehow, you know, play a significant role in the outcome."}, {"time": 535, "text": "Yeah, so the goddess of chess had to send a message."}, {"time": 538, "text": "Yeah, that's okay."}, {"time": 539, "text": "So Gary, you should do something else."}, {"time": 544, "text": "Now for a question that you have heard before, but give me a chance."}, {"time": 549, "text": "You've dominated the chess world for 20 years, even still got it."}, {"time": 554, "text": "Is there a moment, you said, you always look to create something new."}, {"time": 557, "text": "Is there games or moments where you're especially proud of in terms of your brilliance of a new creative move?"}, {"time": 567, "text": "You've talked about Mikhail Tal as somebody who was aggressive and creative chess player in your own game."}, {"time": 573, "text": "Look, you mentioned Mikhail Tal."}, {"time": 575, "text": "It's very aggressive, very sharp player, famous for his combinations and sacrifices, even called magician from Riga, so for his very unique style."}, {"time": 587, "text": "But any world champion, you know, it's, yeah, was a creator."}, {"time": 593, "text": "Some of them were so flamboyant and flash like Tal."}, {"time": 597, "text": "Some of them were no just, you know, less discerned at the chess board like Tigran Petrosian, but every world champion, every top player brought something into the game of chess."}, {"time": 609, "text": "And each contribution was priceless because it's not just about sacrifices."}, {"time": 613, "text": "Of course, amateurs, they enjoy, you know, the brilliant games where pieces being sacrificed."}, {"time": 618, "text": "It's all just, you know, it's all piece of hanging."}, {"time": 621, "text": "And it's all of a sudden, you know, being material down, a rook down, or just, you know, queen down."}, {"time": 628, "text": "The weaker side delivers the final blow on just, you know, mating opponent's king."}, {"time": 636, "text": "But there are other kinds of beauty."}, {"time": 638, "text": "I mean, it's a slow positional maneuvering, you know, looking for weaknesses and just, and gradually, you know, strangling your opponent and eventually delivering sort of a positional masterpiece."}, {"time": 651, "text": "So I think I made more difference in the game of chess than I could have imagined when I started playing."}, {"time": 658, "text": "And the reason I thought it was time for me to leave was just, I mean, I knew that I was not, I was not, no longer the position to bring the same kind of contribution, the same kind of new knowledge into the game."}, {"time": 678, "text": "So, and going back, I could immediately look at my games against Anatoly Karpov."}, {"time": 685, "text": "It's not just I won the match in 1985 and became a world champion at age 22, but there were at least two games in that match."}, {"time": 694, "text": "Of course, the last one, game 24, that was decisive game of the match, I won and became world champion."}, {"time": 700, "text": "But also the way I won, it was a very sharp game and I found a unique maneuver that was absolutely new and it became some sort of just a typical now, though just when the move was made, was made on the board and put on display, a lot of people thought it was ugly."}, {"time": 721, "text": "And another game, game 16 in the match where I just also managed to outplay Karpov completely with black pieces, just paralyzing his entire army in its own camp."}, {"time": 733, "text": "Technically or psychologically, or was that a mix of both in game 16?"}, {"time": 737, "text": "Yeah, I think it was a big blow to Karpov."}, {"time": 739, "text": "I think it was a big psychological victory for a number of reasons."}, {"time": 742, "text": "One, the score was equal at the time and the world champion by the rules could retain his title in case of a tie."}, {"time": 750, "text": "So we still have, before game 16, we have nine games to go."}, {"time": 755, "text": "And also it was some sort of a bluff because neither me nor Karpov saw the refutation of this opening idea."}, {"time": 762, "text": "And I think it says for Karpov, it was double blow because not that he lost the game, I should triple blow."}, {"time": 768, "text": "He lost the game, it was a brilliant game and I played impeccably after just this opening bluff."}, {"time": 775, "text": "And then they discovered that it was a bluff."}, {"time": 777, "text": "So it's the, again, I didn't know, I was not bluffing."}, {"time": 780, "text": "So that's why it happens very often."}, {"time": 783, "text": "Some ideas could be refuted."}, {"time": 784, "text": "And it's just, what I found out, and this is again, going back to your spiritual theme is that you could spend a lot of time working."}, {"time": 793, "text": "And when I say you could, it's in the 80s, in the 90s."}, {"time": 796, "text": "It doesn't happen these days because everybody has a computer."}, {"time": 798, "text": "You could immediately see if it works or it doesn't work."}, {"time": 801, "text": "Machine shows your refutation in a split of a second."}, {"time": 804, "text": "But many of the analysis in the 80s or in the 90s, they were not perfect simply because we're humans and just you analyze the game, you look for some fresh ideas."}, {"time": 816, "text": "And then just it happens that there was something that you missed because the level of the concentration at the chess board is different from when you analyze the game, just moving the pieces around."}, {"time": 827, "text": "And, but somehow if you spend a lot of time at the chess board preparing, so in your studies with your coaches, hours and hours and hours, and nothing of what you found could, had materialized on the chess board."}, {"time": 848, "text": "Somehow these hours help, I don't know why, always helped you."}, {"time": 854, "text": "It's as if the amount of work you did could be transformed into some sort of spiritual energy that helped you to come up with other great ideas during the board."}, {"time": 867, "text": "Again, even if there was no direct connection between your preparation and your victory in the game, there was always some sort of invisible connection between the amount of work you did, your dedication to actually, and your passion to discover new ideas, and your ability during the game at the chess board, when the clock was ticking, we still had ticking clock, not digital clock at the time."}, {"time": 892, "text": "So to come up with some brilliance."}, {"time": 895, "text": "And I also can mention many games from the 90s."}, {"time": 899, "text": "So it's the, obviously all amateurs would pick up my game against Veselin Topalov in 1999 and V. Konzai."}, {"time": 907, "text": "Again, because it was a brilliant game, the Black King traveled from its own camp to into White's camp across the entire board."}, {"time": 917, "text": "It doesn't happen often, trust me, as you know, in the games with professional players, top professional players."}, {"time": 924, "text": "So that's why visually it was one of the most impressive victories."}, {"time": 928, "text": "But I could bring to your attention many other games that were not so impressive for amateurs, not so beautiful, just because it's sacrifice is always beautiful, you sacrifice pieces."}, {"time": 944, "text": "And then eventually you have very few resources left and you use them just to crush your opponent basically."}, {"time": 954, "text": "You have to make the king because you have almost nothing left at your disposal."}, {"time": 961, "text": "But up to the very end, again, less and less, but still up to the very end, I always had games with some sort of interesting ideas and games that gave me great satisfaction."}, {"time": 974, "text": "But I think it's what happened from 2005 up to these days was also a very big accomplishment since I had to find myself to sort of relocate myself."}, {"time": 988, "text": "Yeah, rechannel the creative energies."}, {"time": 990, "text": "Exactly, and to find something where I feel comfortable, even confident that my participation still makes the difference."}, {"time": 1002, "text": "So let me ask perhaps a silly question, but sticking on chest for just a little longer."}, {"time": 1008, "text": "Where do you put Magnus Carlsen, the current world champion in the list of all time greats?"}, {"time": 1014, "text": "In terms of style, moments of brilliance, consistency."}, {"time": 1017, "text": "It's a tricky question."}, {"time": 1019, "text": "The moment you start ranking world champions."}, {"time": 1022, "text": "Yeah, you lose something?"}, {"time": 1024, "text": "I think it's not fair because any new generation knows much more about the game than the previous one."}, {"time": 1035, "text": "So when people say, oh, Gary was the greatest, Fischer was the greatest, Magnus was the greatest, it disregard the fact that the great players of the past, whether it was Alaskia, Capoplank, Alokian, I mean, they knew so little about chess by today's standards."}, {"time": 1049, "text": "I mean, today, just any kid that spent a few years with his or her chess computer knows much more about the game simply just because you have access to this information."}, {"time": 1060, "text": "And it has been discovered generation after generation."}, {"time": 1063, "text": "We added more and more knowledge to the game of chess."}, {"time": 1066, "text": "It's about the gap between the world champion and the rest of the field."}, {"time": 1071, "text": "So it's the, now, if you look at the gap, then probably Fischer could be on top, but very short period of time."}, {"time": 1079, "text": "Then you should also add a time factor."}, {"time": 1081, "text": "I was on top, not as big as Fischer, but much longer."}, {"time": 1085, "text": "So, and also, unlike Fischer, I succeeded in beating next generation."}, {"time": 1091, "text": "Here's the question."}, {"time": 1093, "text": "Let's see if you still got the fire, speaking of the next generation, because you did succeed beating the next generation."}, {"time": 1099, "text": "It's close."}, {"time": 1099, "text": "Okay, Anand, Short, Anand, the sheer of, Kramnik is already 12 years younger."}, {"time": 1104, "text": "So that's the next."}, {"time": 1105, "text": "But still yet, I competed with them and I just, I beat most of them."}, {"time": 1110, "text": "And I was still dominant when I left at age of 41."}, {"time": 1114, "text": "So back to Magnus."}, {"time": 1116, "text": "Magnus, I mean, consistency is phenomenal."}, {"time": 1120, "text": "The reason Magnus is on top, and it seems unbeatable today, Magnus is a lethal combination of Fischer and Karpov, which is very, it's very unusual because Fischer's style was very dynamic, just fighting to the last point, just using every resource available."}, {"time": 1139, "text": "Karpov was very different."}, {"time": 1141, "text": "It's just an unparalleled ability to use every piece with a maximum effect."}, {"time": 1147, "text": "Just its minimal resources always produce maximum effect."}, {"time": 1152, "text": "So now imagine that you merge these two styles."}, {"time": 1155, "text": "So it's like, you know, it's squeezing every stone for a drop of water, but doing it, you know, just, you know, for 50, 60, 70, 80 moves."}, {"time": 1165, "text": "I mean, Magnus could go on as long as Fischer with all his passion and energy."}, {"time": 1168, "text": "And at the same time being as meticulous and deadly as Karpov by just, you know, using every little advantage."}, {"time": 1176, "text": "So, and he has good, you know, very good health."}, {"time": 1181, "text": "I mean, physical conditions are, by the way, very important."}, {"time": 1183, "text": "So a lot of people don't recognize it."}, {"time": 1184, "text": "Their latest study shows that chess players burn thousands of calories during the game."}, {"time": 1190, "text": "So that puts him on the top of this field of the world champions."}, {"time": 1196, "text": "But again, it's the discussion that is, I saw recently on the internet, whether Garry Kasparov of his peak, let's say late eighties, could beat Magnus Carlsen today."}, {"time": 1206, "text": "I mean, it's certainly irrelevant because Garry Kasparov in 1989, okay, has played great chess, but still I knew very little about chess compared to Magnus Carlsen in 2019, who by the way, learned from me as well."}, {"time": 1218, "text": "So that's why, yeah."}, {"time": 1220, "text": "I'm extremely cautious in making any judgment that involves, you know, time gaps."}, {"time": 1226, "text": "You ask, you know, soccer fans."}, {"time": 1228, "text": "So who is your favorite?"}, {"time": 1230, "text": "Pele, Maradona, or Messi?"}, {"time": 1232, "text": "Yeah, who's your favorite?"}, {"time": 1236, "text": "Because?"}, {"time": 1237, "text": "Maybe Maradona, maybe."}, {"time": 1238, "text": "Not because you're younger, but that's simple."}, {"time": 1240, "text": "Your instinctive answer is correct because you saw, you didn't see Maradona in action."}, {"time": 1244, "text": "I saw all of them in action."}, {"time": 1245, "text": "So that's why, but since, you know, when I was, you know, just following it, you know, just Pele and Maradona, they were just, you know, they were big stars and it's, Messi's already just, I was gradually losing interest in just other things."}, {"time": 1258, "text": "So I remember Pele in 1970, the final match Brazil Italy."}, {"time": 1262, "text": "So that's the first World Cup soccer I watched."}, {"time": 1265, "text": "So that's the, and actually my answer when I just, when I just, you know, because I was asked this question as well."}, {"time": 1272, "text": "So I say that it's just, while it's impossible to make a choice, I would still probably go with Maradona for simple reason."}, {"time": 1278, "text": "The Brazilian team in 1970 could have won without Pele."}, {"time": 1281, "text": "It was absolutely great."}, {"time": 1283, "text": "Still could have won, maybe, but it is, Argentinian team in 1986 without Maradona would not be in the final."}, {"time": 1289, "text": "So this is, and Messi, he still hasn't won a title."}, {"time": 1293, "text": "You could argue for that for an hour, but you could say, if you ask Maradona, if you look in his eyes, especially, let's say Gary Kasparov in 1989, he would have said, I was sure as hell would beat Magnus Carlsen."}, {"time": 1308, "text": "Just simply because."}, {"time": 1308, "text": "The confidence, the fire."}, {"time": 1310, "text": "Simply because, again, they saw me in action."}, {"time": 1314, "text": "So this, again, it's the age factor that's important."}, {"time": 1316, "text": "Definitely with the passion and energy and being equipped with all modern ideas."}, {"time": 1321, "text": "But again, then you make, you know, a very just important assumption that you could empower Gary Kasparov in 1989 with all ideas that have been accumulated over 30 years."}, {"time": 1331, "text": "That would not be Gary Kasparov."}, {"time": 1332, "text": "That would be someone else."}, {"time": 1334, "text": "Because again, I belong to 1989."}, {"time": 1336, "text": "I was way ahead of the field."}, {"time": 1338, "text": "And I beat Karpov several times in the World Championship matches."}, {"time": 1343, "text": "And I crossed 2800, which, by the way, if you look at the, in the rating, which is just, even today, so this is the rating that I retire."}, {"time": 1353, "text": "So it's still, you know, it's just, it's a top two, three."}, {"time": 1357, "text": "So that's Caruana and Ding."}, {"time": 1358, "text": "It's about the same rating now."}, {"time": 1360, "text": "And I crossed 2800 in 1990."}, {"time": 1363, "text": "Well, just you look at the inflation."}, {"time": 1365, "text": "When I crossed 2800 in 1990, there was only one player in 2700 category, and not only Karpov."}, {"time": 1370, "text": "Now we had more than 50."}, {"time": 1372, "text": "So just, when you see this, so if you add inflation, so I think my 2851, it could probably, could be more valuable as Magnus 2882, which was his highest rating."}, {"time": 1384, "text": "But anyway, again, too many hypotheticals."}, {"time": 1387, "text": "You're lost to IBM Deep Blue in 1997."}, {"time": 1390, "text": "In my eyes, that is one of the most seminal moments in the history."}, {"time": 1395, "text": "Again, I apologize for being romanticizing the notion, but in the history of our civilization, because humans, as the civilizations, for centuries saw chess as, you know, the peak of what man can accomplish of intellectual mastery, right?"}, {"time": 1411, "text": "And that moment when a machine could beat a human being was inspiring to just an entire, anyone who cares about science, innovation, an entire generation of AI researchers."}, {"time": 1426, "text": "And yet, to you that loss, at least if reading your face, was, seemed like a tragedy, extremely painful."}, {"time": 1433, "text": "Like you said, physically painful."}, {"time": 1436, "text": "When you look back at your psychology of that loss, why was it so painful?"}, {"time": 1441, "text": "Were you not able to see the seminal nature of that moment?"}, {"time": 1447, "text": "Or was that exactly why it was that painful?"}, {"time": 1450, "text": "As I already said, losing was painful, physically painful."}, {"time": 1457, "text": "And the match I lost in 1997 was not the first match I lost to a machine."}, {"time": 1462, "text": "It was the first match I lost, period."}, {"time": 1464, "text": "That's... Oh, wow."}, {"time": 1468, "text": "So... Oh, wow."}, {"time": 1472, "text": "Yeah, that makes all the difference to me."}, {"time": 1476, "text": "First time I lost, it's just... Now, I lost, and the reason I was so angry that I just, you know, I had suspicions that my loss was not just a result of my bad play."}, {"time": 1490, "text": "So though I played quite poorly, you know, just when you started looking at the games today, I made tons of mistakes."}, {"time": 1494, "text": "But, you know, I had all reasons to believe that, you know, there were other factors that had nothing to do with the game of chess."}, {"time": 1501, "text": "And that's why I was angry."}, {"time": 1502, "text": "But look, it was 22 years ago."}, {"time": 1505, "text": "It's water under the bridge."}, {"time": 1507, "text": "We can analyze this match, and this is with everything you said."}, {"time": 1510, "text": "I agree with probably one exception, is that considering chess, you know, as the sort of, as a pinnacle of intellectual activities, was our mistake."}, {"time": 1521, "text": "Because, you know, we just thought, oh, it's a game of the highest intellect, and it's just, you know, you have to be so, you know, intelligent, and you could see things that, you know, the ordinary mortals could not see."}, {"time": 1534, "text": "It's a game, and all machines had to do with this game is just to make fewer mistakes, not to solve the game."}, {"time": 1543, "text": "Because the game cannot be solved."}, {"time": 1544, "text": "I mean, according to Kovalevich Shannon, the number of legal moves is 10 to the 46th power."}, {"time": 1549, "text": "Too many zeros, so just for any computer to finish the job, you know, in next few billion years."}, {"time": 1557, "text": "But it doesn't have to."}, {"time": 1559, "text": "It's all about making fewer mistakes."}, {"time": 1561, "text": "And I think that's the, this match, this match actually, and what's happened afterwards with other games, with Go, with Shoggy, with video games."}, {"time": 1572, "text": "It's a demonstration that machines will always be humans in what I call closed systems."}, {"time": 1579, "text": "The moment you build a closed system, no matter how the system's called, chess, Go, Shoggy, Dota, machines will prevail simply because they will bring down a number of mistakes."}, {"time": 1594, "text": "Machines don't have to solve it, they just have to, the way they outplay us, it's not by just being more intelligent, it's just by doing something else, but eventually it's just, it's capitalizing on our mistakes."}, {"time": 1608, "text": "When you look at the chess machines ratings today, and compare this to Magnus Carlsen, it's the same as comparing Ferrari to Usain Bolt."}, {"time": 1617, "text": "It's the, the gap is, I mean, by chess standards, is insane, 34, 3500 to 2800, 2850 on Magnus."}, {"time": 1626, "text": "It's like difference between Magnus and an ordinary player from an open international tournament."}, {"time": 1633, "text": "It's not because machine understanding is better than Magnus Carlsen, but simply because it's steady."}, {"time": 1639, "text": "Machine has steady hand."}, {"time": 1641, "text": "And I think that is what we, we, we, we have to learn from 1997 experience, and from further encounters with computers, and sort of the current state of affairs with AlphaZero, beating other machines."}, {"time": 1658, "text": "The idea that we can compete with computers in so called intellectual fields, it was wrong from the very beginning."}, {"time": 1667, "text": "It's just, it's, by the way, the 1997 match was not the first victory of machines over AlphaZero."}, {"time": 1677, "text": "No, actually it's, I played against first decent chess computers from late, from late 80s."}, {"time": 1684, "text": "So I played with the prototype of Deep Blue called Deep Thought in 1989, two rapid chess games in New York, I won handily to both games."}, {"time": 1693, "text": "We played against new chess engines like Fritz, and other programs."}, {"time": 1698, "text": "And then it's the, it was Israeli program Junior that appeared in 1995."}, {"time": 1703, "text": "Yeah, so there were, there were several programs."}, {"time": 1705, "text": "I, you know, I lost few games in Blitz."}, {"time": 1708, "text": "I lost one match against the computer chess engine 1994 rapid chess."}, {"time": 1713, "text": "So I lost one game to Deep Blue in 1996 match, the man, the match I won."}, {"time": 1718, "text": "Some people, you know, tend to forget about it that I won the first match."}, {"time": 1722, "text": "But it's, it's, we, we made a very important psychological mistake thinking that the reason we lost Blitz matches, five, five minutes games."}, {"time": 1732, "text": "The reason we lost some of the rapid chess matches, 25 minutes chess."}, {"time": 1736, "text": "Because we didn't have enough time."}, {"time": 1738, "text": "If you play a longer match, we will not make the same mistakes."}, {"time": 1742, "text": "Nonsense."}, {"time": 1742, "text": "So this, yeah, we had more time, but we still make mistakes."}, {"time": 1746, "text": "And machine also has more time."}, {"time": 1747, "text": "And machines, machine will always, you know, will always be steady and consistent compared to humans instabilities and inconsistencies."}, {"time": 1758, "text": "And today we are at the point where yes, nobody talks about, you know, humans playing as machines."}, {"time": 1764, "text": "Now machines can offer handicap to top players and still, you know, will, will, will be favored."}, {"time": 1771, "text": "I think we're just learning that it's, it's, it's no longer human versus machines."}, {"time": 1775, "text": "It's about human working with machines."}, {"time": 1777, "text": "That's what I recognized in 1998, just after leaking my wounds and spending one year in just, you know, ruminating so the, so what's happened in this match."}, {"time": 1788, "text": "And I knew that though we still could play against the machines."}, {"time": 1791, "text": "I had two more matches in, in 2003, playing both Deep Fritz and Deep Junior."}, {"time": 1796, "text": "Both matches ended as a tie."}, {"time": 1799, "text": "Though these machines were not weaker, at least actually probably stronger than Deep Blue."}, {"time": 1805, "text": "And by the way, today chess app on your mobile phone is probably stronger than Deep Blue."}, {"time": 1810, "text": "I'm not speaking about chess engines that are so much superior."}, {"time": 1813, "text": "And by the way, when you analyze games we played against Deep Blue in 1997 on your chess engine, they'll be laughing."}, {"time": 1820, "text": "So this is, and it's also shows that's how chess changed because chess commentators, they look at some of our games like game four, game five, brilliant idea."}, {"time": 1829, "text": "Now you ask Stockfish, you ask Houdini, you ask Commodore, all the leading chess engines."}, {"time": 1837, "text": "Within 30 seconds, they will show you how many mistakes both Gary and Deep Blue made in the game that was trumpeted as the, as a great chess match in 1997."}, {"time": 1851, "text": "So you've made an interesting, if you can untangle that comment."}, {"time": 1856, "text": "So now in retrospect, it was a mistake to see chess as the peak of human intellect."}, {"time": 1863, "text": "Nevertheless, that was done for centuries."}, {"time": 1866, "text": "So by the way, in Europe, because you know, you move to the far East, they will go, they had show games."}, {"time": 1874, "text": "But games, games."}, {"time": 1875, "text": "Again, some of the games like, you know, board games."}, {"time": 1880, "text": "Yeah, I agree."}, {"time": 1882, "text": "So if I push back a little bit, so now you say that, okay, but it was a mistake to see chess as the epitome and now, and then now there's other things maybe like language, that conversation, like some of the things that in your view is still way out of reach of computers, but inside humans."}, {"time": 1900, "text": "Do you think, can you talk about what those things might be?"}, {"time": 1904, "text": "And do you think just like chess, they might fall?"}, {"time": 1908, "text": "Soon with the same set of approaches, if you look at AlphaZero, the same kind of learning approaches as the machines grow in size."}, {"time": 1917, "text": "No, no, it's not about growing in size."}, {"time": 1919, "text": "It's about, again, it's about understanding the difference between closed system and open ended system."}, {"time": 1925, "text": "So you think that key difference, so the board games are closed in terms of the rule set, the actions, the state space, everything is just constrained."}, {"time": 1935, "text": "You think once you open it, the machines are lost?"}, {"time": 1939, "text": "Not lost, but again, the effectiveness is very different because machine does not understand the moment it's reaching territory of diminishing returns."}, {"time": 1948, "text": "It's the, to put it in a different way, machine doesn't know how to ask right questions."}, {"time": 1955, "text": "It can ask questions, but it will never tell you which questions are relevant."}, {"time": 1959, "text": "So there's the, it's like about the, it's the, it's a direction."}, {"time": 1962, "text": "So these, it's, I think it's in human machine relations, we have to consider, so our role and people, many people feel uncomfortable that this, the territory that belongs to us is shrinking."}, {"time": 1975, "text": "I'm saying, so what, you know, this is, eventually we'll belong to the last few decimal points, but it's like having, so a very powerful gun, that's, and all you can do there is slightly, you know, alter direction of the bullet."}, {"time": 1991, "text": "Maybe, you know, 0.1 degree of this angle, but that means a mile away, 10 meters of target."}, {"time": 2001, "text": "So that's, we have to recognize that is a certain unique human qualities that machines in a foreseeable future will not be able to reproduce."}, {"time": 2013, "text": "And the effectiveness of this cooperation, collaboration depends on our understanding what exactly we can bring into the game."}, {"time": 2020, "text": "So the greatest danger is when we try to interfere with machine superior knowledge."}, {"time": 2025, "text": "So that's why I always say that sometimes you'd rather have, by reading these pictures in radiology, you may probably prefer an experienced nurse than rather than having top professor, because she will not try to interfere with machines understanding."}, {"time": 2042, "text": "So it's very important to know that if machines knows how to do better things in 95%, 96% of territory, we should not touch it because it's happened."}, {"time": 2051, "text": "It's like in chess, recognize they do it better."}, {"time": 2055, "text": "See where we can make the difference."}, {"time": 2057, "text": "You mentioned AlphaZero, I mean, AlphaZero is, it's actually a first step into what you may call AI, because everything that's being called AI today, it's just, it's one or another variation of what Claude Shannon characterized as a brute force."}, {"time": 2074, "text": "It's a type A machine, whether it's Deep Blue, whether it's Watson, and all these modern technologies that are being trumpeted as AI, it's still brute force."}, {"time": 2085, "text": "It's the, all they do, it's they do optimization."}, {"time": 2088, "text": "It's this, they are, you know, they keep, you know, improving the way to process human generated data."}, {"time": 2096, "text": "Now, AlphaZero is the first step towards, you know, machine produced knowledge."}, {"time": 2104, "text": "Which is, by the way, it's quite ironic that the first company that championed that was IBM."}, {"time": 2112, "text": "Oh, it's in backgammon."}, {"time": 2113, "text": "Interesting, in backgammon."}, {"time": 2115, "text": "Yes, you should look at IBM, it's a newer gammon."}, {"time": 2119, "text": "It's the scientist called Cesaro."}, {"time": 2122, "text": "He's still working at IBM."}, {"time": 2123, "text": "They had it in the early 90s."}, {"time": 2125, "text": "It's the program that played, you know, the AlphaZero type, so just trying to come up with own strategies."}, {"time": 2131, "text": "But because of success of Deep Blue, this project had been not abandoned, but just, you know, it was put on hold."}, {"time": 2140, "text": "And now we just, you know, it's, you know, everybody talks about this, the machines generated knowledge, so as revolutionary."}, {"time": 2148, "text": "And it is, but there's still, you know, many open ended questions."}, {"time": 2154, "text": "Yes, AlphaZero generates its own data."}, {"time": 2158, "text": "Many ideas that AlphaZero generated in chess were quite intriguing."}, {"time": 2197, "text": "Almost something that feels like intuition."}, {"time": 2199, "text": "Exactly, but there's one problem."}, {"time": 2202, "text": "Now, the simple question, if AlphaZero faces superior point, let's say another powerful computer accompanied by a human who could help just to discover certain problems, because I already, I look at many AlphaZero games."}, {"time": 2218, "text": "I visited their lab, you know, spoke to Demis Hassabis and his team, and I know there's certain weaknesses there."}, {"time": 2224, "text": "Now, if these weaknesses are exposed, the question is how many games will it take for AlphaZero to correct it?"}, {"time": 2229, "text": "The answer is hundreds of thousands."}, {"time": 2231, "text": "Even if it keeps losing, it can, it's just because the whole system is based."}, {"time": 2236, "text": "So it's now, imagine so this is, you can have a human by just making a few tweaks."}, {"time": 2241, "text": "So humans are still more flexible."}, {"time": 2244, "text": "And as long as we recognize what is our role, where we can play sort of, so the most valuable part in this collaboration."}, {"time": 2254, "text": "So it's, it will help us to understand what are the next steps in human machine collaboration."}, {"time": 2261, "text": "So let's talk about the thing that machines certainly don't know how to do yet, which is morality."}, {"time": 2266, "text": "Machines and morality."}, {"time": 2267, "text": "It's another question that, you know, just it's being asked all the time these days."}, {"time": 2271, "text": "And I think it's another phantom that is haunting a general public because it's just being fed with this, you know, illusions is that how can we avoid machines, you know, having bias, being prejudiced?"}, {"time": 2287, "text": "You cannot, because it's like looking in the mirror and complaining about what you see."}, {"time": 2292, "text": "If you have certain bias in the society, machine will just follow it."}, {"time": 2297, "text": "It's just, it's, you know, you look at the mirror, you don't like what you see there."}, {"time": 2300, "text": "You can, you know, you can break it."}, {"time": 2303, "text": "You can try to distort it."}, {"time": 2305, "text": "Or you can try to actually change something."}, {"time": 2307, "text": "Just by yourself."}, {"time": 2309, "text": "By yourself, yes."}, {"time": 2310, "text": "So it's very important to understand is that you cannot expect machines to improve the ills of our society."}, {"time": 2317, "text": "And moreover machines will simply, you know, just, you know, amplify it."}, {"time": 2322, "text": "But the thing is people are more comfortable with other people doing injustice, with being biased."}, {"time": 2330, "text": "We're not comfortable with machines having the same kind of bias."}, {"time": 2334, "text": "So that's an interesting standard that we place on machines."}, {"time": 2339, "text": "With autonomous vehicles, they have to be much safer."}, {"time": 2341, "text": "With automated systems."}, {"time": 2344, "text": "Of course they're much safer."}, {"time": 2345, "text": "Statistically, they're much safer than."}, {"time": 2347, "text": "It's not of course."}, {"time": 2348, "text": "Why would, it's not of course."}, {"time": 2350, "text": "It's not given."}, {"time": 2353, "text": "Autonomous vehicles, you have to work really hard to make them safer."}, {"time": 2361, "text": "I think it just, it goes without saying is the outcome of this, I would call it competition with comparison is very clear."}, {"time": 2369, "text": "But the problem is not about being, you know, safer."}, {"time": 2372, "text": "It's the 40,000 people or so every year died in car accidents in the United States."}, {"time": 2378, "text": "And it's statistics."}, {"time": 2380, "text": "One accident with autonomous vehicle and it's front page of a newspaper."}, {"time": 2384, "text": "So it's, again, it's about psychology."}, {"time": 2387, "text": "So it's while people, you know, kill each other in car accidents because they make mistakes, they make more mistakes."}, {"time": 2392, "text": "For me, it's not a question."}, {"time": 2394, "text": "Of course we make more mistakes because we're human."}, {"time": 2397, "text": "Yes, machines are old."}, {"time": 2398, "text": "And by the way, no machine will ever reach 100% perfection."}, {"time": 2401, "text": "That's another important fake story that is being fed to the public."}, {"time": 2405, "text": "If machine doesn't reach 100% performance, it's not safe."}, {"time": 2409, "text": "No, all you can ask any computer, whether it's, you know, playing chess or doing the stock market calculations or driving your autonomous vehicle, it's to make fewer mistakes."}, {"time": 2421, "text": "And yes, I know it's not, you know, it's not easy for us to accept because ah, if, you know, if you have two humans, you know, colliding in their cars, okay, it's like, if one of these cars is autonomous vehicle, and by the way, even if it's humans fault, terrible."}, {"time": 2437, "text": "How could you allow a machine to run without a driver at the wheel?"}, {"time": 2442, "text": "So, you know, let's linger that for a second, that double standard, the way you felt with your first loss against Deep Blue, were you treating the machine differently than you would have a human?"}, {"time": 2456, "text": "Or, so what do you think about that difference between the way we see machines and humans?"}, {"time": 2462, "text": "No, it's the, at that time, you know, for me it was a match."}, {"time": 2464, "text": "And that's why I was angry because I believed that the match was not, you know, fairly organized."}, {"time": 2468, "text": "So it's, definitely there were unfair advantages for IBM and I wanted to play another match, like a rubber match."}, {"time": 2476, "text": "So your anger or displeasure was aimed more like at the humans behind IBM versus the actual pure algorithm."}, {"time": 2484, "text": "Absolutely, look, I knew at the time, and by the way, I was, objectively speaking, I was stronger at that time."}, {"time": 2490, "text": "So that probably added to my anger because I knew I could beat the machine."}, {"time": 2494, "text": "Yeah, so that's, and that's the, and as I lost, and I knew I was not well prepared."}, {"time": 2498, "text": "So because they, I have to give them credit."}, {"time": 2499, "text": "They did some good work from 1996 and I, but I still could beat the machine."}, {"time": 2505, "text": "So I made too many mistakes."}, {"time": 2507, "text": "Also, this is the whole, it's this, the publicity around the match."}, {"time": 2509, "text": "So I underestimated the effect, you know, just it's, and being called the, you know, the brain's last stand, you know, okay, no pressure."}, {"time": 2522, "text": "Okay, well, let me ask."}, {"time": 2524, "text": "So I was born also in the Soviet Union."}, {"time": 2526, "text": "What lessons do you draw from the rise and fall of the Soviet Union in the 20th century?"}, {"time": 2531, "text": "When you just look at this nation that is now pushing forward into what Russia is, if you look at the long arc of history of the 20th century, what do we take away?"}, {"time": 2547, "text": "What do we take away from that?"}, {"time": 2548, "text": "I think the lesson of history is clear."}, {"time": 2555, "text": "Undemocratic systems, totalitarian regimes, systems that are based on controlling their citizens and just every aspect of their life, not offering opportunities to, for private initiative, central planning systems, they're doomed."}, {"time": 2575, "text": "They just, you know, they cannot be driving force for innovation, so they, in the history timeline, I mean, they could cause certain, you know, distortion of the concept of progress."}, {"time": 2591, "text": "They, by the way, they may call themselves progressive, but we know that the damage that they caused to humanity is just, it's yet to be measured."}, {"time": 2599, "text": "But at the end of the day, they fail."}, {"time": 2602, "text": "They fail, and the end of the Cold War was a great triumph of the free world."}, {"time": 2608, "text": "It's not that the free world is perfect."}, {"time": 2610, "text": "It's very important to recognize the fact that, I always like to mention, you know, one of my favorite books, The Lord of the Rings, that there's no absolute good, but there is an absolute evil."}, {"time": 2622, "text": "Good, you know, comes in many forms, but we all, you know, it's being humans or being even, you know, humans from fairy tales or just some sort of mythical creatures."}, {"time": 2632, "text": "It's the, you can always find spots on the songs."}, {"time": 2637, "text": "So this is conducting war and just, and fighting for justice."}, {"time": 2643, "text": "There are always things that, you know, can be easily criticized."}, {"time": 2646, "text": "And human history is the, is a never ending quest for perfection."}, {"time": 2651, "text": "But we know that there is absolute evil."}, {"time": 2653, "text": "We know it's, for me, it's no clear, it's, I mean, nobody argues about Hitler being absolute evil, but I think it's very important to recognize Stalin was absolute evil."}, {"time": 2661, "text": "Communism caused more damage than any other ideology in the 20th century."}, {"time": 2666, "text": "And unfortunately, while we all know that fascism was condemned, but there was no Nuremberg for communism."}, {"time": 2672, "text": "And that's why we could see, you know, still the successors of Stalin are feeling far more comfortable."}, {"time": 2679, "text": "And Putin is one of them."}, {"time": 2680, "text": "You highlight a few interesting connections actually between Stalin and Hitler."}, {"time": 2685, "text": "I mean, in terms of the adjusting or clarifying the history of World War II, which is very interesting."}, {"time": 2694, "text": "Of course, we don't have time."}, {"time": 2695, "text": "So let me ask."}, {"time": 2696, "text": "You can ask, you know, I just recently delivered a speech in Toronto at 80th anniversary of Molotov Ribbentrop Pact."}, {"time": 2702, "text": "It's something that I believe, you know, just, you know, has, must be taught in the schools that the World War II had been started by two dictators by signing these criminal treaty, collusion of two tyrants in August 1939 that led to the beginning of the World War II."}, {"time": 2721, "text": "And the fact is that eventually Stalin had no choice but to join allies because Hitler attacked him."}, {"time": 2727, "text": "So it just doesn't, you know, eliminate the fact that Stalin helped Hitler to start World War II."}, {"time": 2734, "text": "And he was one of the beneficiaries at early stage by annexing a part of Eastern Europe."}, {"time": 2740, "text": "And as a result of the World War II, he annexed almost entire Eastern Europe."}, {"time": 2744, "text": "And for many Eastern European nations, the end of the World War II was the beginning of communist occupation."}, {"time": 2750, "text": "So Putin, you've talked about as a man who stands between Russia and democracy, essentially today."}, {"time": 2760, "text": "You've been a strong opponent and critic of Putin."}, {"time": 2764, "text": "Let me ask again, how much does fear enter your mind and heart?"}, {"time": 2769, "text": "So in 2007, there's this interesting comment from Oleg Kalugin, KGB general."}, {"time": 2777, "text": "He said that I do not talk details."}, {"time": 2779, "text": "People who knew them are all dead now because they were vocal."}, {"time": 2783, "text": "I'm quiet."}, {"time": 2785, "text": "There's only one man who's vocal and he may be in trouble."}, {"time": 2788, "text": "World Chess champion Kasparov."}, {"time": 2790, "text": "He has been very outspoken in his attacks on Putin."}, {"time": 2793, "text": "And I believe he's probably next on the list."}, {"time": 2796, "text": "So clearly your life has been and perhaps continues to be in danger."}, {"time": 2800, "text": "How do you think about having the views you have, the ideas you have, being in opposition as you are in this kind of context when your life could be in danger?"}, {"time": 2815, "text": "That's the reason I live in New York."}, {"time": 2818, "text": "So it was not my first choice, but I knew I had to leave Russia at one point."}, {"time": 2821, "text": "And among other places, New York is the safest."}, {"time": 2825, "text": "Is it safe?"}, {"time": 2827, "text": "It's the, I know what happened, what is happening with many of Putin's enemies."}, {"time": 2834, "text": "But at the end of the day, I mean, what can I do?"}, {"time": 2838, "text": "I could be very proactive by trying to change things I can influence."}, {"time": 2844, "text": "But here are a few facts."}, {"time": 2846, "text": "I cannot stop doing what I've been doing for a long time."}, {"time": 2850, "text": "It's the right thing to do."}, {"time": 2852, "text": "I grew up with my family teaching me sort of the wisdom of Soviet dissidents, do what you must and so be."}, {"time": 2861, "text": "I could try to be cautious by not traveling to certain places where my security could be at risk."}, {"time": 2869, "text": "There are so many invitations to speak at different locations in the world."}, {"time": 2872, "text": "And I have to say that many countries are just now are not destinations that I can afford to travel."}, {"time": 2881, "text": "My mother still lives in Moscow."}, {"time": 2882, "text": "I meet her a few times a year."}, {"time": 2884, "text": "She was devastated when I had to leave Russia because since my father died in 1971, so she was 33 and she dedicated her entire life to her only son."}, {"time": 2895, "text": "But she recognized in just a year or so since I left Russia that it was the only chance for me to continue my normal life."}, {"time": 2905, "text": "So just to, I mean, to be relatively safe and to do what she taught me to do to make the difference."}, {"time": 2915, "text": "Do you think you will ever return to Russia or let me ask a different way?"}, {"time": 2920, "text": "Even sooner than many people think because I think Putin's regime is facing unsurmountable difficulties."}, {"time": 2926, "text": "And again, I read enough historical books to know that dictatorships, they end suddenly."}, {"time": 2934, "text": "It's just on Sunday, dictator feels comfortable."}, {"time": 2941, "text": "He believes he's popular on Monday morning, he's bust."}, {"time": 2945, "text": "The good news and bad news."}, {"time": 2947, "text": "I mean, the bad news is that I don't know when and how Putin rule ends."}, {"time": 2953, "text": "The good news, he also doesn't know."}, {"time": 2954, "text": "Okay, well put."}, {"time": 2959, "text": "Let me ask a question that seems to preoccupy the American mind from the perspective of Russia."}, {"time": 2968, "text": "One, did Russia interfere in the 2016 U.S. election, government sanction and future?"}, {"time": 2977, "text": "Two, will Russia interfere in the 2020 U.S. election?"}, {"time": 2982, "text": "And what does that interference look like?"}, {"time": 2985, "text": "It's very old."}, {"time": 2986, "text": "We had such an intelligent conversation."}, {"time": 2988, "text": "And you are ruining everything by asking such a stupid question."}]}]