[{"title": "Philip Goff: Consciousness, Panpsychism, and the Philosophy of Mind | Lex Fridman Podcast #261", "id": "BCdV6BMMpOo", "quotes": [{"time": 265, "text": "They could run the experiments themselves."}, {"time": 268, "text": "Whereas consciousness, is it observable?"}, {"time": 271, "text": "Is it not observable?"}, {"time": 271, "text": "In a sense, it's observable."}, {"time": 273, "text": "As you say, we could say it's privately observable."}, {"time": 277, "text": "I am directly aware of my own feelings and experiences."}, {"time": 281, "text": "If I'm in pain, it's just right there for me."}, {"time": 285, "text": "My pain is just totally directly evident to me."}, {"time": 289, "text": "But you from the outside cannot directly access my pain."}, {"time": 294, "text": "You can access my pain behavior, or you can ask me, but you can't access my pain in the way that I can access my pain."}, {"time": 306, "text": "So I think that's a distinction."}, {"time": 309, "text": "It might be difficult to totally pin it down how we define those things, but I think there's a fairly clear and very important difference there."}, {"time": 317, "text": "So you think there's a kind of direct observation that you're able to do of your pain that I'm not."}, {"time": 323, "text": "So my observation, all the ways in which I can sneak up to observing your pain is indirect versus yours is direct."}, {"time": 332, "text": "Can you play devil's advocate?"}, {"time": 334, "text": "Is it possible for me to get closer and closer and closer to being able to observe your pain, like all the subjective experiences, yours in the way that you do?"}, {"time": 350, "text": "I mean, so of course, it's not that we observe behavior and then we make an inference."}, {"time": 356, "text": "We are hardwired to instinctively interpret smiles as happiness, crying as sadness."}, {"time": 366, "text": "And as we get to know someone, we find it very easy to adopt their perspective, get into their shoes."}, {"time": 372, "text": "But strictly speaking, all we have perceptual access to is someone's behavior."}, {"time": 380, "text": "And if you were just, strictly speaking, if you were trying to explain someone's behavior, those aspects that are publicly observable, I don't think you'd ever have recourse to attribute consciousness."}, {"time": 394, "text": "You could just postulate some kind of mechanism if you were just trying to explain the behavior."}, {"time": 399, "text": "So someone like Daniel Dennett is very consistent on this."}, {"time": 404, "text": "So I think for most people, what science is in the business of is explaining the data of public observation experiment."}, {"time": 415, "text": "If you religiously followed that, you would not postulate consciousness because it's not a datum that's known about in that way."}, {"time": 424, "text": "And Daniel Dennett is really consistent on this."}, {"time": 426, "text": "He thinks my consciousness cannot be empirically verified and therefore it doesn't exist."}, {"time": 433, "text": "Dennett is consistent on this."}, {"time": 434, "text": "I think I'm consistent on this."}, {"time": 436, "text": "But I think a lot of people have a slightly confused middle way position on this."}, {"time": 442, "text": "On the one hand, they think the business of science is just to account for public observation experiment, but on the other hand, they also believe in consciousness without appreciating, I think, that that implies that there is another datum over and above the data of public observation experiments, namely just the reality of feelings and experiences."}, {"time": 469, "text": "As we walk along this conversation, you keep opening doors that I don't want to walk into and I will, but I want to try to stay kind of focused."}, {"time": 476, "text": "You mentioned Daniel Dennett, let's lay it out since he sticks to his story, pun unintended, and then you stick to yours."}, {"time": 485, "text": "What is your story?"}, {"time": 486, "text": "What is your theory of consciousness versus his?"}, {"time": 489, "text": "Can you clarify his position?"}, {"time": 492, "text": "So my view, I defend the view known as panpsychism, which is the view that consciousness is a fundamental and ubiquitous feature of the physical world."}, {"time": 543, "text": "So I mean that's a theory that I would justify on the grounds that it can account for this datum of consciousness that we are immediately aware of in our experience in a way that I don't think other theories can."}, {"time": 558, "text": "If you asked me to contrast that to Daniel Dennett, I think he would just say there is no such datum."}, {"time": 562, "text": "Dennett says the data for science of consciousness is what he calls heterophenomenology, which is specifically defined as what we can access from the third person perspective, including what people say, but crucially, we're not treating what they say."}, {"time": 580, "text": "We're not relying on their testimony as evidence for some unobservable realm of feelings and experiences."}, {"time": 586, "text": "We're just treating what they say as a datum of public observation experiments that we can account for in terms of underlying mechanisms."}, {"time": 599, "text": "But I feel like there's a deeper view of what consciousness is."}, {"time": 599, "text": "So you have a very clear, and we'll talk quite a bit about panpsychism, but you have a clear view of what, you know, almost like a physics view of consciousness."}, {"time": 654, "text": "Somehow the editing is consciousness of this, of this story."}, {"time": 654, "text": "I mean, that's a theory of consciousness, isn't it?"}, {"time": 661, "text": "The narrative theory of consciousness or the multiple versions editing, collaborative editing of a narrative theory of consciousness."}, {"time": 672, "text": "Yeah, he calls it the multiple drafts model."}, {"time": 672, "text": "Incidentally, there's a very interesting paper just come out by very good philosopher Luke Roloff's defending a panpsychist version of Dennett's multiple drafts model."}, {"time": 686, "text": "Like a deeper turtle that that turtle is stacked on top of."}, {"time": 688, "text": "Just the difference being that this is Luke Roloff's view, all of the drafts are conscious."}, {"time": 693, "text": "So I guess for Dennett, there's sort of no fact of the matter about which of these drafts is the correct one."}, {"time": 702, "text": "On Roloff's view, maybe there's no fact of the matter about which of these drafts is my consciousness, but nonetheless, all the drafts correspond to some consciousness."}, {"time": 713, "text": "And I mean, it just sounds kind of funny."}, {"time": 713, "text": "I guess I think he calls it Dennettian panpsychism."}, {"time": 718, "text": "But Luke is one of the most rigorous and serious philosophers alive at the moment, I think."}, {"time": 725, "text": "And I hate having Luke Roloff's in an audience if I'm giving a talk because he always cuts straight to the weakness in your position that you hadn't thought of."}, {"time": 734, "text": "And so it's nice, panpsychism is sometimes associated with fluffy thinking, but contemporary panpsychists have come out of this tradition we call analytic philosophy, which is rooted in detailed, rigorous argumentation."}, {"time": 744, "text": "And it is defended in that manner."}, {"time": 754, "text": "Those analytic philosophers are sticklers for terminology."}, {"time": 754, "text": "It's very fun, very fun group to talk shit with."}, {"time": 760, "text": "Well, I mean, it gets boring if you just start and end defining words, right?"}, {"time": 766, "text": "I think starting with defining words is good."}, {"time": 766, "text": "Actually, the philosopher Derek Parfitt said when he first was thinking about philosophy, he went to a talk in analytic philosophy, and he went to a talk in continental philosophy, and he decided that the problem with the continental philosophy, if it was really unrigorous, really imprecise, the problem with the analytic philosophy is it was just not about anything important."}, {"time": 784, "text": "And he thought there was more chance of working within analytic philosophy and asking some more meaningful, some more profound questions than there was in working in continental philosophy and making it more rigorous."}, {"time": 799, "text": "Now, they're both horrific stereotypes, and I don't want to get nasty emails from either of these groups, but there's something to what he was saying there."}, {"time": 808, "text": "I think just a tiny tangent on terminology."}, {"time": 808, "text": "I do think that there's a lot of deep insight to be discovered by just asking questions."}, {"time": 815, "text": "What do we mean by this word?"}, {"time": 820, "text": "I remember I was taking a course on algorithms and data structures in computer science, and the instructor, shout out to him, Ali Chakrafande, amazing professor, I remember he asked some basic questions like, what is an algorithm?"}, {"time": 831, "text": "The pressure of pushing students to answer, to think deeply, you know, you just woke up hungover in college or whatever, and you're tasked with answering some deep philosophical question about what is an algorithm?"}, {"time": 845, "text": "These basic questions, and they sound very simple, but they're actually very difficult."}, {"time": 851, "text": "And one of the things I really value in conversation is asking these dumb, simple questions of like, you know, what is intelligence?"}, {"time": 856, "text": "And just continually asking that question over and over of some of the sort of biggest research in the researchers in the artificial intelligence computer science space is actually very useful."}, {"time": 869, "text": "At the same time, you know, it should start a terminology and then progress where you kind of say, fuck it, we'll just assume we know what we mean by that."}, {"time": 881, "text": "Otherwise, you get the Bill Clinton situation where it's like, what is the meaning of is, is whatever he said, it's like, hey, man, did you do the sex stuff or not?"}, {"time": 887, "text": "So there's, you have to both be able to talk about the sex stuff and the meaning of the word is."}, {"time": 901, "text": "With consciousness, because we don't currently understand, you know, very much terminology discussions are very important because it's like you're almost trying to sneak, sneak up to some deep insight by just discussing some basic terminology, you know, like what is consciousness or even defining the different aspects of panpsychism is fascinating."}, {"time": 922, "text": "But just to linger on the Daniel Dennett thing, what do you think about narrative, sort of the mind constructing narratives for ourselves?"}, {"time": 940, "text": "So there's nothing special about consciousness deeply."}, {"time": 940, "text": "It is some property of the human mind that's just is able to tell these pretty stories that we experience as consciousness and that it's unique perhaps to the human mind, which is, I suppose, what Daniel Dennett would argue that it's either deeply unique or mostly unique to the human mind."}, {"time": 968, "text": "It's just on the question of terminology before."}, {"time": 968, "text": "Yes, I think it used to be the fashion among philosophers that we had to come up with utterly precise, necessary and sufficient conditions for each word."}, {"time": 981, "text": "And then I think this has gone out of fashion a bit, partly because it's just been, you know, such a failure."}, {"time": 988, "text": "The word knowledge in particular, people used to define knowledge as true justified belief."}, {"time": 994, "text": "And then this guy Gettier had this very short paper where he just produced some pretty conclusive counter examples to that."}, {"time": 1000, "text": "I think, you know, he wrote very few papers, but this is just, you know, you have to teach this on an undergraduate philosophy course."}, {"time": 1009, "text": "And then after that, you had a huge literature of people trying to address this and propose a new definition, but then someone else would come out with counter examples and then you get a new definition of knowledge and counter examples and it just went on and on and never seemed to get anywhere."}, {"time": 1022, "text": "So I think the thought now is let's work out how precise we need to be for what we're trying to do."}, {"time": 1028, "text": "And I think that's a healthier attitude."}, {"time": 1028, "text": "So precision is important, but you just need to work out how precise do we need to be for these purposes."}, {"time": 1032, "text": "Coming to Dennett and narrative theories, I mean, I think narrative theories are a plausible contender for a theory of the self, theory of my identity over time, what makes me the same person in some sense today as I was 20 years ago, given that I've changed so much physically and psychologically."}, {"time": 1058, "text": "One running contender is something connected to the kind of stories we tell about ourselves or maybe some story about the psychological, the chains of psychological continuity."}, {"time": 1072, "text": "I'm not saying I accept such a theory, but it's plausible."}, {"time": 1077, "text": "I don't think these theories are good as theories of consciousness, at least if we're taking consciousness just to be subjective experience, pleasure, pain, seeing color, hearing sound."}, {"time": 1092, "text": "I think a hamster has consciousness in that sense."}, {"time": 1092, "text": "There's something that it's like to be a hamster."}, {"time": 1100, "text": "It feels pain if you stand on it."}, {"time": 1100, "text": "If you're cruel enough to do, I don't know why I gave that."}, {"time": 1106, "text": "People always give, I don't know, philosophers give these very violent examples to get the cross consciousness and it's, yeah, I don't know why that's coming about, but anyway."}, {"time": 1114, "text": "You say mean things to the hamster."}, {"time": 1114, "text": "It experiences pain, it experiences pleasure, joy."}, {"time": 1123, "text": "I mean, but there's some limits to that experience of a hamster, but there is nevertheless the presence of a subjective experience."}, {"time": 1128, "text": "Consciousness is just something, I mean, it's a very ambiguous word, but if we're just using it to mean some kind of experience, some kind of inner life, that is pretty widespread in the animal kingdom."}, {"time": 1143, "text": "A bit difficult to say where it stops, where it starts, but you certainly don't need something as sophisticated as the capacity to self consciously tell stories about yourself to just have experience."}, {"time": 1155, "text": "Except for cats who are evil automatons that are void of consciousness."}, {"time": 1155, "text": "They're the fingertips of the devil."}, {"time": 1163, "text": "I was taking that as read."}, {"time": 1163, "text": "I mean, Descartes thought animals were mechanisms and humans are unique."}, {"time": 1169, "text": "So animals are robots essentially in the formulation of Descartes and humans are unique."}, {"time": 1175, "text": "So in which way would you say humans are unique versus even our closest ancestors?"}, {"time": 1181, "text": "Like, is there something special about humans?"}, {"time": 1192, "text": "What is in your view under the panpsychism?"}, {"time": 1192, "text": "I guess we're walking backwards because we'll we'll have the big picture conversation about what is panpsychism, but given your kind of broad theory of consciousness, what's unique about humans, do you think?"}, {"time": 1203, "text": "As a panpsychist, there is a great continuity between humans and the rest of the universe."}, {"time": 1209, "text": "There's nothing that special about human consciousness."}, {"time": 1218, "text": "It's just a highly evolved form of what exists throughout the universe."}, {"time": 1224, "text": "So we're very much continuous with the rest of the physical universe."}, {"time": 1224, "text": "What is unique about human beings?"}, {"time": 1230, "text": "I suppose the capacity to reflect on our conscious experience, plan for the future, the capacity, I would say, to respond to reasons as well."}, {"time": 1240, "text": "I mean, animals in some sense have motivations, but when a human being makes a decision, they're responding to what philosophers called normative considerations."}, {"time": 1256, "text": "You know, if you're saying, should I take this job in the U.S.?"}, {"time": 1261, "text": "You weigh it up."}, {"time": 1261, "text": "You say, well, you know, I'll get more money."}, {"time": 1261, "text": "I'll have maybe a better quality of life."}, {"time": 1265, "text": "But if I stay in the UK, I'll be closer to family."}, {"time": 1265, "text": "And you weigh up these considerations."}, {"time": 1271, "text": "I'm not sure any nonhuman animals quite respond to considerations of value in that way."}, {"time": 1271, "text": "I mean, I might be reflecting here that I'm something of an objectivist about value."}, {"time": 1279, "text": "I think there are objective facts about what we have reason to do and what we have reason to believe."}, {"time": 1291, "text": "And humans have access to those facts."}, {"time": 1292, "text": "And humans have access to them and can respond to them."}, {"time": 1292, "text": "That's a controversial claim."}, {"time": 1292, "text": "You know, many of my panpsychist brethren might not go for that."}, {"time": 1302, "text": "They would say the hamster, too, can look up to the stars and ponder theoretical physics."}, {"time": 1308, "text": "Maybe not, but I think it depends what you think about value."}, {"time": 1308, "text": "If you have a more Humean picture of value, by which I mean, relating to the philosopher David Hume, who said reason is the slave of the passions."}, {"time": 1319, "text": "Really, we just have motivations and what we have reason to do arises from our motivations."}, {"time": 1325, "text": "I'm not a Humean."}, {"time": 1325, "text": "I think there are objective facts about what we have reason to do."}, {"time": 1331, "text": "And I think we have access to them."}, {"time": 1331, "text": "I don't think any nonhuman animal has access to objective facts about what they have reason to do, what they have reason to believe."}, {"time": 1344, "text": "They don't weigh up evidence."}, {"time": 1344, "text": "Reason is a slave of the passions."}, {"time": 1350, "text": "Matthew That was David Hume's view, yeah."}, {"time": 1350, "text": "I mean, yeah, do you want to know my problem with Hume's?"}, {"time": 1355, "text": "I had a radical conversion."}, {"time": 1355, "text": "This might not be connected."}, {"time": 1355, "text": "It's not connected to panpsychism, but I had a radical conversion."}, {"time": 1360, "text": "I used to have a more Humean view when I was a graduate student, but I was persuaded by some professors at the University of Reading where I was that if you have the Humean view, you have to say any basic life goals are equal, equally valid."}, {"time": 1383, "text": "So for example, let's take someone whose basic goal in life is counting blades of grass, right?"}, {"time": 1390, "text": "And crucially, they don't enjoy it, right?"}, {"time": 1390, "text": "This is the crucial point."}, {"time": 1390, "text": "They get no pleasure from it."}, {"time": 1395, "text": "That's just their basic goal to spend their life counting as many blades of grass as possible."}, {"time": 1400, "text": "Not for some greater goal."}, {"time": 1400, "text": "That's just their basic goal."}, {"time": 1405, "text": "I want to say that that is objectively stupid."}, {"time": 1405, "text": "That is objectively pointless."}, {"time": 1411, "text": "I shouldn't say stupid."}, {"time": 1411, "text": "It's objectively pointless in a way that pursuing pleasure or pursuing someone else's pleasure or pursuing scientific inquiry is not pointless."}, {"time": 1423, "text": "As soon as you make that admission, you're not a follower of David Hume anymore."}, {"time": 1423, "text": "You think there are objective facts about what goals are worth pursuing."}, {"time": 1434, "text": "Is it possible to have a goal without pleasure?"}, {"time": 1434, "text": "So this kind of idea that you disjoint the two."}, {"time": 1441, "text": "So the David Foster Wallace idea of, you know, the key to life is to be unboreable."}, {"time": 1446, "text": "Isn't it possible to discover the pleasure in everything in life?"}, {"time": 1446, "text": "The counting of the blades of grass."}, {"time": 1453, "text": "Once you see the mastery, the skill of it, you can discover the pleasure."}, {"time": 1459, "text": "Therefore, you know, I guess what I'm asking is why and when and how did you lose the romance in grad school?"}, {"time": 1466, "text": "Is that what you're trying to say?"}, {"time": 1470, "text": "I think it may or may not be true that it's possible to find pleasure in everything."}, {"time": 1477, "text": "But I think it's also true that people don't act solely for pleasure."}, {"time": 1477, "text": "And they certainly don't act solely for their own pleasure."}, {"time": 1483, "text": "People will suffer for things they think are worthwhile."}, {"time": 1489, "text": "I might, you know, I might suffer for some scientific cause for finding out a cure for the pandemic."}, {"time": 1496, "text": "And in terms of my own pleasure, I might have less pleasure in doing that."}, {"time": 1496, "text": "But I think it's worthwhile."}, {"time": 1504, "text": "It's a worthwhile thing to do."}, {"time": 1504, "text": "I just don't think it's the case that everything we do is rooted in maximizing our own pleasure."}, {"time": 1509, "text": "I don't think that's even psychologically plausible."}, {"time": 1515, "text": "But pleasure, then that's a narrow kind of view of pleasure."}, {"time": 1515, "text": "That's like a short term pleasure."}, {"time": 1519, "text": "But you can see pleasure is a kind of ability to hear the music in the distance."}, {"time": 1526, "text": "It's like, yes, it's difficult now."}, {"time": 1526, "text": "It's suffering now."}, {"time": 1526, "text": "But there's some greater thing beyond the mountain."}, {"time": 1533, "text": "That will be joy."}, {"time": 1533, "text": "I mean, that's kind of a, even if it's not in this life."}, {"time": 1540, "text": "Well, you know, the warriors will meet in Valhalla, right?"}, {"time": 1540, "text": "The feeling that gives meaning and fulfillment to life is not necessarily grounded in pleasure of like the counting of the grass."}, {"time": 1551, "text": "The struggle is a source of deep fulfillment."}, {"time": 1560, "text": "So like, I think pleasure needs to be kind of thought of as a little bit more broadly."}, {"time": 1566, "text": "It just kind of gives you this sense."}, {"time": 1566, "text": "It for a moment allows you to forget the terror of the fact that you're going to die."}, {"time": 1575, "text": "Like that's the broader view of pleasure that you get to kind of play in the little illusion that all of this has deep meaning."}, {"time": 1592, "text": "Well, but I mean, you know, people sacrifice their lives."}, {"time": 1592, "text": "Atheists may sacrifice their lives for the sake of someone else or for the sake of something important enough."}, {"time": 1601, "text": "And clearly in that case, they're not doing it for the sake of their own pleasure."}, {"time": 1606, "text": "That's a rather dramatic example, but they can be just trivial examples where, you know, I choose to be honest rather than lie about something."}, {"time": 1619, "text": "Can I lose out a bit?"}, {"time": 1619, "text": "And I have a bit less pleasure, but I thought it was worth doing the honest thing or something."}, {"time": 1626, "text": "I mean, I just think, so that's a, I mean, maybe you can use the word pleasure so broadly that you're just essentially meaning something."}, {"time": 1634, "text": "Worthwhile, but then I think the word pleasure, maybe, maybe loses its meaning."}, {"time": 1640, "text": "Well, but what do you think about the blades of grass case?"}, {"time": 1640, "text": "What do you think about someone who spends their life counting blades of grass and doesn't enjoy it?"}, {"time": 1648, "text": "So I think, I personally think it's impossible or maybe I'm not understanding even like the philosophical formulation, but I think it's impossible to have a goal and not draw pleasure from it."}, {"time": 1659, "text": "Make it worthwhile, forget the word pleasure."}, {"time": 1659, "text": "I think the word goal loses meaning."}, {"time": 1666, "text": "If I say I'm going to count the number of pens on this table, if I'm actively involved in the task, I will find joy in it."}, {"time": 1672, "text": "I will find, like, I think there's a lot of meaning and joy to be discovered in the skill of a task, in mastering of a skill and taking pride in doing it well."}, {"time": 1681, "text": "I mean, that's, I don't know what it is about the human mind, but there's some joy to be discovered in the mastery of a skill."}, {"time": 1698, "text": "So I think it's just impossible to count blades of grass and not sort of have the gyro dreams of sushi compelling, like draws you into the mastery of the simple task."}, {"time": 1713, "text": "Yeah, I suppose, I mean, in a way you might think it's just hard to imagine someone who would spend their lives doing that, but then maybe that's just because it's so evident that that is a pointless task."}, {"time": 1727, "text": "Whereas if we take this David Hume view seriously, it ought to be, you know, a totally possible life goal."}, {"time": 1734, "text": "Whereas, I mean, yeah, I guess I just find it hard to shake the idea that some ways of some life goals are more worthwhile than others."}, {"time": 1741, "text": "And it doesn't mean, you know, that there's a one single way you should lead your life, but pursuing knowledge, helping people, pursuing your own pleasure to an extent are worthwhile things to do in a way that, you know, for example, I have, I'm a little bit OCD."}, {"time": 1763, "text": "I still feel inclined to walk on cracks in the pavement or do it symmetrically."}, {"time": 1769, "text": "Like if I step on a crack with my left foot, I feel the need to do it with my right foot."}, {"time": 1774, "text": "And I think that's kind of pointless."}, {"time": 1774, "text": "It's something I feel the urge to do, but it's pointless."}, {"time": 1780, "text": "Whereas other things I choose to do, I think there's, it's worth doing."}, {"time": 1786, "text": "And it's hard to make sense of metaphysically, what could possibly ground that?"}, {"time": 1786, "text": "How could we know about these facts?"}, {"time": 1792, "text": "But that's the starting point for me."}, {"time": 1796, "text": "I think you walking on the sidewalk in a way that's symmetrical brings order to the world."}, {"time": 1805, "text": "Like if you weren't doing that, the world might fall apart."}, {"time": 1805, "text": "And you, it feels like that."}, {"time": 1811, "text": "I think there's, there's, there's meaning in that."}, {"time": 1811, "text": "Like you embracing the full, like the full experience of that, you living the richness of that as if it has meaning, will give meaning to it."}, {"time": 1826, "text": "And then whatever genius comes of that as you as a one little intelligent aunt will make a better life for everybody else."}, {"time": 1832, "text": "Perhaps I'm defending the blades of grass example, because I can literally imagine myself enjoying this task as somebody who's OCD in a certain kind of way in quantitative."}, {"time": 1843, "text": "But now you're ruining the exam because you imagine someone enjoying it."}, {"time": 1843, "text": "I'm imagining someone who doesn't enjoy it."}, {"time": 1845, "text": "We don't want a life that's just full of pleasure."}, {"time": 1845, "text": "Like we just sit there, you know, having a big sugar high all the time."}, {"time": 1852, "text": "We want a life where we do things that are worthwhile."}, {"time": 1858, "text": "If for something to be worthwhile, just is for it to be a basic life goal, then that, that mode of reflection doesn't really make sense."}, {"time": 1868, "text": "We can't really think, did I do things worthwhile on the, on the David Hume type picture?"}, {"time": 1872, "text": "All it is for something to be worthwhile is it was a basic goal of yours or derived from a basic goal."}, {"time": 1883, "text": "I mean, I think goal and worthwhile aren't, I think goal is a boring word."}, {"time": 1883, "text": "I'm more sort of existential."}, {"time": 1891, "text": "It's like, did you ride the roller coaster of life?"}, {"time": 1891, "text": "Did you fully experience life that, and in that sense, I mean, the blaze of grass is something that could be deeply joyful."}, {"time": 1904, "text": "And that's in that way, I think suffering could be joyful in the full context of life."}, {"time": 1904, "text": "It's the roller coaster of life."}, {"time": 1910, "text": "Like without suffering, without struggle, without pain, without depression, with sadness, there's not the highs."}, {"time": 1915, "text": "I mean, that's this, that's a fucked up thing about life is that the lows really make the highs that much richer and deeper and, and like taste better."}, {"time": 1922, "text": "Like the, like I was, I tweeted this, I was, I couldn't sleep and I was like late at night."}, {"time": 1941, "text": "And I know it's like a obvious statement, but like every love story eventually, you know, ends in loss in tragedy."}, {"time": 1952, "text": "So like this feeling of love at the end, there's always going to be tragedy."}, {"time": 1962, "text": "Even if it's the most amazing lifelong love with another human being, one of you is going to die."}, {"time": 1970, "text": "And I don't know which is worse, but both, both are not going to be pretty."}, {"time": 1977, "text": "And so that, the sense that it's finite, the sense that it's going to end in a low, that gives like richness to those kind of evenings when you realize this fucking thing ends, this thing ends."}, {"time": 1992, "text": "The feeling that it ends, that bad taste, that bad feeling that it ends gives meaning, gives joy, gives, I don't know, pleasure is this loaded word, but gives some kind of a deep pleasure to the experience when it's good."}, {"time": 2006, "text": "And I mean, and that's the Blades of Grass, you know, they have that to me."}, {"time": 2014, "text": "But you're perhaps right that it's like reducing it to set of goals or something like that is kind of removing the magic of life."}, {"time": 2030, "text": "Because I think what makes counting the Blades of Grass joyful is just because it's life."}, {"time": 2037, "text": "So it sounds like you, it sounds like you reject the David Hume type picture anyway, because you're saying just because you have it as a goal, that's what it is to be worthwhile."}, {"time": 2048, "text": "But you're saying, no, it's because it's engaging with life, riding the roller coaster."}, {"time": 2054, "text": "So that does sound like in some sense, there are facts independent of our personal goal choices about what it means to live a good life."}, {"time": 2060, "text": "And I mean, coming back full circle to the start of this was what makes us different to animals."}, {"time": 2064, "text": "I don't think at the end of a hamster's life, it's it thinks, did I ride the roller coaster?"}, {"time": 2069, "text": "Did I really live life to the full?"}, {"time": 2074, "text": "That is not a mode of reflection that's available to non human animals."}, {"time": 2074, "text": "So what do you think is the role of death?"}, {"time": 2080, "text": "And in all of this, the fear of death?"}, {"time": 2080, "text": "Does that interplay with consciousness?"}, {"time": 2088, "text": "Does this self reflection?"}, {"time": 2088, "text": "Do you think there's some deep connection between this ability to contemplate the fact that the our flame of consciousness eventually goes out?"}, {"time": 2105, "text": "Yeah, I don't think unfortunately panpsychism helps particularly with life after death, because for the panpsychist, there's nothing supernatural."}, {"time": 2120, "text": "There's nothing beyond the physical."}, {"time": 2120, "text": "All there is really is ultimately particles and fields."}, {"time": 2126, "text": "It's just that we think the ultimate nature of particles and fields is consciousness."}, {"time": 2130, "text": "But I guess when the matter in my brain ceases to be ordered in a way that sustains the particular kind of consciousness I enjoy in waking life, then in some sense, I will I will cease to be although I do that the final chapter of my book Galileo's error is more experimental."}, {"time": 2154, "text": "So the first four chapters of the cold blooded case for the panpsychist view is that the best solution to the hard problem of consciousness."}, {"time": 2161, "text": "The last chapter we talk about meaning."}, {"time": 2165, "text": "Yeah, I talk about meaning to about free will."}, {"time": 2165, "text": "And I talk about mystical experiences."}, {"time": 2170, "text": "So I always want to emphasize that panpsychism is not necessarily connected to anything spiritual."}, {"time": 2177, "text": "You know, a lot of people defending this view, like David Chalmers or Luke Roloffs are just total atheist secularists, right?"}, {"time": 2182, "text": "They don't believe in any kind of transcendent reality."}, {"time": 2189, "text": "They just believe in feelings, you know, mundane consciousness and think that needs explaining in our conventional scientific approach can't cut it."}, {"time": 2194, "text": "But if for independent reasons you are motivated to some spiritual picture of reality, then maybe a panpsychist view is more consonant with that."}, {"time": 2208, "text": "So if you if you have a mystical experience where you it seems to you in this experience that there is this higher form of consciousness at the root of all things."}, {"time": 2223, "text": "If you're a materialist, you've got to think that's a delusion."}, {"time": 2223, "text": "You know, there's just something in your brain making you think that it's not real."}, {"time": 2228, "text": "But if you're a panpsychist and you already think the fundamental nature of reality is constituted of consciousness, it's not that much of a leap to think that this higher form of consciousness you seem to apprehend in the mystical experience is part of that underlying reality."}, {"time": 2247, "text": "And, you know, in many different cultures, experienced meditators have claimed to have experiences in which it becomes apparent to them that there is an element of consciousness that is universal."}, {"time": 2261, "text": "So this is sometimes called universal consciousness."}, {"time": 2267, "text": "So on this view, your mind and my mind are not totally distinct."}, {"time": 2276, "text": "Each of our individual conscious minds is built upon the foundations of universal consciousness."}, {"time": 2282, "text": "And universal consciousness as it exists in me is one and the same thing as universal consciousness as it exists in you."}, {"time": 2287, "text": "So I've never had one of these experiences."}, {"time": 2294, "text": "But if one is a panpsychist, I think one is more open to that possibility."}, {"time": 2294, "text": "I don't see why it shouldn't be the case that that is part of the nature of consciousness and maybe something that is apparent in certain deep states of meditation."}, {"time": 2307, "text": "And so what I explore in the experimental final chapter of my book is that could allow for a kind of impersonal life after death."}, {"time": 2320, "text": "Because if that view is true, then even when the particular aspects of my conscious experience fall away, that element of universal consciousness at the core of my identity would continue to exist."}, {"time": 2335, "text": "So I'd sort of be, as it were, absorbed into universal consciousness."}, {"time": 2340, "text": "So Buddhists and Hindu mystics try to meditate to get rid of all the bad karma to be absorbed into universal consciousness."}, {"time": 2350, "text": "It could be that if there's no karma, if there's no reverb, maybe everyone gets enlightened when they die."}, {"time": 2356, "text": "Maybe you just sink back into universal consciousness."}, {"time": 2361, "text": "So I also, coming back to morality, suggest this could provide some kind of basis for altruism or non egotism."}, {"time": 2370, "text": "Because if you think egotism implicitly assumes that we are utterly distinct individuals, whereas on this view, we're not, we overlap to an extent that something at the core of our being is even in this life, we overlap."}, {"time": 2384, "text": "That would be this view that some experienced meditators claim becomes apparent to them that there is something at the core of my identity that is one and the same as the thing at the core of your identity, this universal consciousness."}, {"time": 2405, "text": "Yeah, there is something very, like you and I in this conversation, there's a few people listening to this, all of us are in a kind of single mind together."}, {"time": 2412, "text": "There's some small aspect of that, or maybe a big aspect about us humans."}, {"time": 2422, "text": "So certainly in a space of ideas, we kind of meld together for time, at least in a conversation and kind of play with that idea."}, {"time": 2429, "text": "And then we're clearly all thinking, like if I say pink elephant, there's going to be a few people that are now visualizing a pink elephant."}, {"time": 2441, "text": "We're all thinking about that pink elephant together."}, {"time": 2441, "text": "We're all in the room together thinking about this pink elephant and we're like rotating it in our minds together."}, {"time": 2454, "text": "Is there a different instantiation of that pink elephant in everybody's mind or is it the same elephant?"}, {"time": 2461, "text": "And we have the same mind exploring that elephant."}, {"time": 2461, "text": "Now, if we in our mind start petting that elephant, like touching it, that experience that we're now like thinking what that would feel like, what's that?"}, {"time": 2471, "text": "Is that all of us experiencing that together or is that separate?"}, {"time": 2477, "text": "So like there's some aspect of the togetherness that almost seems fundamental to civilization, to society."}, {"time": 2482, "text": "Hopefully that's not too strong, but to like some of the fundamental properties of the human mind, it feels like the social aspect is really important."}, {"time": 2489, "text": "We call it social because we think of us as individual minds interacting, but if we're just like one collective mind with like fingertips, they're like touching each other as it's trying to explore the elephant, but that could be just in the realm of ideas and intelligence and not in the realm of consciousness and it's interesting to see maybe it is in the realm of consciousness."}, {"time": 2514, "text": "Yeah, so it's obviously certainly true in some sense that there are these phenomena that you're talking about of collective consciousness in some sense."}, {"time": 2526, "text": "I suppose the question is how ontologically serious do we want to be about those things?"}, {"time": 2532, "text": "By which I mean, are they just a construction of out of our minds and the fact that we interact in the standardly scientifically accepted ways or is as someone like Rupert Sheldrake would think that there is some metaphysical reality, there are some fields beyond the scientifically understood ones that are somehow communicating this."}, {"time": 2553, "text": "I mean, I think that, I mean, the view I was describing was that this element we're supposed to have in common is some sort of pure impersonal consciousness or something rather than."}, {"time": 2565, "text": "So actually, I mean, an interesting figure is the Australian philosopher Miri Al Bahari, who defends a kind of mystical conception of reality rooted in a advice of Adanta mysticism."}, {"time": 2578, "text": "But like me, she's from this tradition of analytic philosophy."}, {"time": 2578, "text": "And so she defends this in this, you know, incredibly precise, rigorous way."}, {"time": 2584, "text": "She defends the idea that we should think of experienced meditators as providing expert testimony."}, {"time": 2589, "text": "So, you know, I think humans cause a causing climate breakdown."}, {"time": 2598, "text": "I have no idea of the science behind it, you know, but I trust the experts or, you know, that the universe is 14 billion years old."}, {"time": 2602, "text": "You know, most of our knowledge is based on expert testimony."}, {"time": 2607, "text": "And she thinks we should think of experienced meditators, these people who are telling us about this universal consciousness at the core of our being as a relevant kind of expert."}, {"time": 2617, "text": "And so she wants to defend the rational acceptability of this mystical conception of reality."}, {"time": 2623, "text": "So it's what, you know, I think we shouldn't be ashamed, you know, we shouldn't be worried about dealing with certain views as long as it's done with rigor and seriousness."}, {"time": 2636, "text": "You know, I think sometimes terms like, I don't know, new age or something can function a bit like racist terms."}, {"time": 2641, "text": "You know, a racist term picks out a group of people, but then implies certain negative characteristics."}, {"time": 2647, "text": "So people use this term, you know, to pick out a certain set of views like mystical conception of reality and imply it's kind of fluffy thinking or, but, you know, you read Marielle Bihari, you read Luke Roloff's, this is serious, rigorous thought, whether you agree with it or not, obviously it's hugely controversial."}, {"time": 2665, "text": "And so, you know, the enlightenment ideal is to follow the evidence and the arguments where they lead."}, {"time": 2675, "text": "But it's kind of very hard for human beings to do that."}, {"time": 2675, "text": "I think we get stuck in some conception of how we think science ought to look."}, {"time": 2680, "text": "And, you know, people talk about religion as a crutch, but I think a certain kind of scientism, a certain conception of how science is supposed to be, gets into people's identity and their sense of themselves and their security."}, {"time": 2694, "text": "And make things hard if you're a panpsychist."}, {"time": 2701, "text": "And even the word expert becomes a kind of crutch."}, {"time": 2701, "text": "I mean, you use the word expert."}, {"time": 2710, "text": "You have some kind of conception of what expertise means."}, {"time": 2710, "text": "Oftentimes that's, you know, connected with a degree, a particularly prestigious university or something like that."}, {"time": 2716, "text": "Or, or it's, you know, expertise is a funny one."}, {"time": 2722, "text": "I've noticed that anybody sort of that claims they're an expert is usually not the expert."}, {"time": 2730, "text": "The biggest quote unquote expert that I've ever met are the ones that are truly humble."}, {"time": 2736, "text": "So the humility is a really good sign of somebody who's traveled a long road and been humbled by how little they know."}, {"time": 2742, "text": "So some of the best people in the world at whatever the thing they've spent their life doing are the ones that are ultimately humble in the face of it all."}, {"time": 2752, "text": "So like, just being humble for how little we know, even if we travel a lifetime."}, {"time": 2759, "text": "I do like the idea."}, {"time": 2759, "text": "I mean, treating sort of like, what is it, psychonauts, like an expert witness, you know, people who have traveled with the help of DMT to another place where they got some deep understanding of something."}, {"time": 2774, "text": "And their insight is perhaps as valuable as the insight of somebody who ran rigorous psychological studies at Princeton University or something."}, {"time": 2787, "text": "Like those psychonauts, they have wisdom, if it's done rigorously, which you can also do rigorously within the university, within the studies now, with psilocybin and those kinds of things."}, {"time": 2794, "text": "Yeah, that's a fact that's fascinating."}, {"time": 2800, "text": "Still probably the best, one of the best works on mystical experience is the chapter in William James's Varieties of Religious Experiences."}, {"time": 2805, "text": "And most of it is just a psychological study of trying to define the characteristics of mystical experience as a psychological type."}, {"time": 2817, "text": "But at the end, he considers the question, if you have a mystical experience, is it rational to trust it, to trust that it's telling you something about reality?"}, {"time": 2829, "text": "Something about reality."}, {"time": 2829, "text": "And he makes an interesting argument."}, {"time": 2829, "text": "He says, if you say no, you're kind of applying a double standard because we all think it's okay to trust our normal sensory experiences, but we have no way of getting outside of ourselves to prove that our sensory experiences correspond to an external reality."}, {"time": 2849, "text": "We could be in the matrix."}, {"time": 2849, "text": "This could be a very vivid dream."}, {"time": 2853, "text": "You could say, oh, we do science, but a scientist only gets their data by experiencing the results of their experiments."}, {"time": 2863, "text": "And then the question arises again, how do you know that corresponds to a real world?"}, {"time": 2867, "text": "So he thinks there's a sort of double standard in saying, it's okay to trust our ordinary sensory experiences, but it's not okay for the person on DMT to trust those experiences."}, {"time": 2878, "text": "It's very philosophically difficult to say, why is it okay in the one case and not the other?"}, {"time": 2878, "text": "So I think there's an interesting argument there, but I would like to just defend experts a little bit."}, {"time": 2889, "text": "I mean, I agree it's very difficult, but especially in an age, I guess, where there's so much information, I do think it's important to have some protection of sources of information, academic institutions that we can trust."}, {"time": 2906, "text": "And then that's difficult because of course there are non academics who do know what they're talking about."}, {"time": 2911, "text": "But like, if I'm interested in knowing about biology, you know, you can't research everything."}, {"time": 2916, "text": "So I think we have to have some sense of who are the experts we can trust, the people who've spent a lot of time reading all the material that people have read, written, thinking about it, having their views torn apart by other people working in the field."}, {"time": 2938, "text": "I think that is very important."}, {"time": 2938, "text": "And also to protect that from conflicts of interest."}, {"time": 2942, "text": "There is a so called think tank in the UK called the Institute of Economic Affairs, who are always on the BBC as experts on economic questions and they do not declare who funds them."}, {"time": 2954, "text": "So we don't know who's paying the paper."}, {"time": 2954, "text": "I think, you know, you shouldn't be allowed to call yourself a think tank if you're not totally transparent about who's funding you."}, {"time": 2961, "text": "So I think that's it."}, {"time": 2966, "text": "And I mean, this connects to panpsychism because I think the reason people, you know, worry about unorthodox ideas is because they worry about how do we know when we're just losing control or losing discipline."}, {"time": 2977, "text": "So I do think we need to somehow protect academic institutions as sources of information that we can trust."}, {"time": 2982, "text": "And, you know, in philosophy, there's, you know, there's not much consensus on everything, but you can at least know what people who have put the time in to read all the stuff, what they think about these issues."}, {"time": 2996, "text": "I think that is important."}, {"time": 3001, "text": "To push back and you push back."}, {"time": 3001, "text": "Who are the experts on COVID?"}, {"time": 3007, "text": "Oh, again, it's a dangerous territory now."}, {"time": 3012, "text": "Well, let me just speak to it because I am walking through that dangerous territory."}, {"time": 3018, "text": "I'm allergic to the word expert because in my simple mind, it kind of rhymes with ego."}, {"time": 3031, "text": "There's something about experts."}, {"time": 3031, "text": "If we allow too much to have a category expert and place certain people in them, those people sitting on the throne start to believe it."}, {"time": 3046, "text": "And they start to communicate with that energy and the humility starts to dissipate."}, {"time": 3051, "text": "I think there is value in a lifelong mastery of a skill and the pursuit of knowledge within a very specific discipline."}, {"time": 3063, "text": "But the moment you have your name on an office, the moment you're an expert, I think you destroy the very aspect, the very value of that journey towards knowledge."}, {"time": 3078, "text": "So some of it probably just reduces to skillful communication."}, {"time": 3078, "text": "Communicate in a way that shows humility, that shows an open mindedness, that shows an ability to really hear what a lot of people are saying."}, {"time": 3093, "text": "So in the case of COVID, what I've noticed, and this is probably true with panpsychism as well, is so called experts, and they are extremely knowledgeable, many of them are colleagues of mine, they dismiss what millions of people are saying on the internet without having looked into it."}, {"time": 3115, "text": "With empathy and rigor, honestly, understand what are the arguments being made."}, {"time": 3122, "text": "They say like, there's not enough time to explore all those things, like there's so much stuff out there."}, {"time": 3126, "text": "Yeah, I think that's intellectual laziness."}, {"time": 3126, "text": "If you don't have enough time, then don't speak so strongly with dismissal."}, {"time": 3133, "text": "Feel bad about it."}, {"time": 3133, "text": "Be apologetic about the fact that you don't have enough time to explore the evidence."}, {"time": 3139, "text": "For example, with the heat I got with Francis Collins is that he kind of said that lab leak, he kind of dismissed the heat."}, {"time": 3154, "text": "He kind of dismissed it, showing that he didn't really deeply explore all the sort of, the huge amount of circumstantial evidence out there, the battles that are going on out there."}, {"time": 3168, "text": "There's a lot of people really tensely discussing this and being, showing humility in the face of that battle of ideas, I think is really important."}, {"time": 3175, "text": "And I just been very disappointed in so called expertise in the space of science and showing humility and showing humanity and kindness and empathy towards other human beings."}, {"time": 3187, "text": "That's, at the same time, obviously, I love Jiro Junsu's sushi lifelong pursuit of like getting, like in computer science, Don Knuth, like some of my biggest heroes are people that like, when nobody else cares, they stay on one topic for their whole life and they just find the beautiful little things about there's puzzles they keep solving."}, {"time": 3253, "text": "Yeah, well, I don't know how much we're disagreeing."}, {"time": 3253, "text": "I mean, these are totally valid issues and of course, expertise goes wrong in all sorts of ways."}, {"time": 3258, "text": "It's totally fallible."}, {"time": 3258, "text": "I suppose I would just say, what is the alternative?"}, {"time": 3264, "text": "What do we just say?"}, {"time": 3264, "text": "All information is equal."}, {"time": 3272, "text": "Because as a voter, I've got to decide who to vote for and I've got to evaluate and I can't look into all of the economics and all of the relevant science."}, {"time": 3281, "text": "And so I just think maybe it's like Churchill said about democracy, it's the worst system of government apart from all the rest."}, {"time": 3297, "text": "I think about panpsychism, it's the worst theory of consciousness apart from all the rest."}, {"time": 3301, "text": "But I just think expertise, the peer review system, I think it's terrible in so many ways."}, {"time": 3309, "text": "Yes, people should show more humility, but I can't see a viable alternative."}, {"time": 3309, "text": "I think philosopher Bernard Williams had a really nice nuanced discussion of the problems of titles and how they also function in a society."}, {"time": 3320, "text": "They do have some positive function."}, {"time": 3320, "text": "The very first time I lectured in philosophy before I got a professorship was teaching at a continuing education college."}, {"time": 3340, "text": "So it's kind of retired people who want to learn some more things."}, {"time": 3340, "text": "And I just totally pitched it too high."}, {"time": 3348, "text": "And Gait talked about Bernard Williams on titles and hierarchies."}, {"time": 3354, "text": "And these kind of people in their 70s and 80s would just instantly started interrupting saying, what is philosophy?"}, {"time": 3360, "text": "And it was a disaster."}, {"time": 3360, "text": "And I just remember in the breaks, a sort of elderly lady came up and said, I've decided to take Egyptology instead."}, {"time": 3367, "text": "But that was my introduction to teaching."}, {"time": 3374, "text": "But sort of titles and accomplishments is a nice starting point, but doesn't buy you the whole thing."}, {"time": 3381, "text": "So you don't get to just say, this is true because I'm an expert."}, {"time": 3388, "text": "You still have to convince people."}, {"time": 3388, "text": "One of the things I really like to practice martial arts."}, {"time": 3394, "text": "And for people who don't know, Brazilian Jiu Jitsu is one of them."}, {"time": 3394, "text": "And you sometimes wear these pajamas, pajama looking things, and you wear a belt."}, {"time": 3402, "text": "So I happen to be a black belt in Brazilian Jiu Jitsu."}, {"time": 3407, "text": "And I also train in what's called no gi, so you don't wear the pajamas."}, {"time": 3414, "text": "And when you don't wear the pajamas, nobody knows what rank you are."}, {"time": 3414, "text": "Nobody knows if you're a black belt or a white belt or if you're a complete beginner or not."}, {"time": 3420, "text": "And when you wear the pajamas called the gi, you wear the rank."}, {"time": 3426, "text": "And people treat you very differently."}, {"time": 3426, "text": "When they see my black belt, they treat me differently."}, {"time": 3433, "text": "They kind of defer to my expertise."}, {"time": 3433, "text": "If they're kicking my ass, that's probably because like I am working on something like new or maybe I'm letting them win."}, {"time": 3450, "text": "But when there's no belts and it doesn't matter if I've been doing this for 15 years, it doesn't matter."}, {"time": 3455, "text": "None of it matters."}, {"time": 3455, "text": "What matters is the raw interaction of just trying to kick each other's ass and seeing like, what is this chess game, like a human chess?"}, {"time": 3469, "text": "Who, what are the ideas that we're playing with?"}, {"time": 3469, "text": "And I think there's a dance there."}, {"time": 3469, "text": "Yes, it's valuable to know a person as a black belt when you take consideration of the advice of different people, me versus somebody who's only practiced for like a couple of days."}, {"time": 3484, "text": "But at the same time, the raw practice of ideas that is combat and the raw practice of exchange of ideas that is science needs to often throw away expertise."}, {"time": 3492, "text": "And in communicating, like there's another thing to science and expertise, which is leadership."}, {"time": 3500, "text": "It's not just, so the scientific method in the review process is this rigorous battle of ideas between scientists."}, {"time": 3506, "text": "But there's also a stepping up and inspiring the world and communicating ideas to the world."}, {"time": 3513, "text": "And that skill of communication, I suppose that's my biggest criticism of so called experts in science."}, {"time": 3527, "text": "Is there just shitty communicators?"}, {"time": 3527, "text": "Well, I can tell you, I get very frustrated with philosophers not reaching out more."}, {"time": 3532, "text": "I mean, I think it might be partly that we're trained to get watertight arguments, respond to all objections."}, {"time": 3540, "text": "And as you do that, eventually it gets more complicated and the jargon comes in."}, {"time": 3546, "text": "So to write a more accessible book or article, you have to loosen the arguments a bit."}, {"time": 3555, "text": "And then we worry that other philosophers will think, oh, that's a really crap argument."}, {"time": 3560, "text": "So I mean, the way I did it, I wrote my academic book first, Consciousness and Fundamental Reality, and then a more accessible book, Galileo's Error, where the arguments, you know, not as rigorously worked out."}, {"time": 3570, "text": "So then I can say the proper arguments there, you know, the further arguments there."}, {"time": 3575, "text": "That's brilliantly done, by the way."}, {"time": 3575, "text": "Like, that's such a, so for people who don't know, you first wrote Consciousness and Fundamental Reality."}, {"time": 3586, "text": "So that's the academic book, also very good."}, {"time": 3586, "text": "I flew through it last night, bought it."}, {"time": 3591, "text": "And then obviously the popular book is Galileo's Error, Foundations for a New Science of Consciousness."}, {"time": 3597, "text": "That's kind of the right way to do it."}, {"time": 3597, "text": "To show that you're legit, your community to the world, by doing the book that's normally going to read, and then doing a popular book that everybody's going to read."}, {"time": 3609, "text": "Well, I try now, every time I write an academic article, I try to write a more accessible version."}, {"time": 3614, "text": "I mean, the thing I've been working on recently, just because there's this argument."}, {"time": 3619, "text": "So there's a certain argument from the cosmological fine tuning of the laws of physics for life to the multiverse that's quite popular physicists like Max Tegmark."}, {"time": 3634, "text": "There's an argument in philosophy journals that there's a fallacious line of reasoning going on there from the fine tuning to the multiverse."}, {"time": 3645, "text": "Now that argument is from 20, 30 years ago, and it's, you know, discussed in academic philosophy."}, {"time": 3651, "text": "Nobody knows about it."}, {"time": 3651, "text": "And there is huge interest in this fine tuning stuff."}, {"time": 3657, "text": "Scientists wanting to argue for the multiverse, theists wanting to say this is evidence for God, and nobody knows about this argument, which tries to show that it's fallacious reasoning to go from the fine tuning to the multiverse."}, {"time": 3668, "text": "So I wrote a piece for Scientific American explaining this argument to a more general audience."}, {"time": 3672, "text": "And, you know, it just really irritates me that it's just buried in these technical journal articles and nobody knows about it."}, {"time": 3687, "text": "But just, you know, final thing on that."}, {"time": 3687, "text": "I don't disagree with anything you said, and that's kind of really beautiful, that martial arts example and thinking how that could be analogous."}, {"time": 3698, "text": "But I think it's very rare to find a good philosopher who hasn't given a talk to other philosophers and had objections raised."}, {"time": 3709, "text": "I was going to say have it torn apart, but that's maybe thinking of it in the slightly the wrong way, but have the best objections raised to it."}, {"time": 3720, "text": "And that's why that is an important formative process that you go through as an academic, that the greatest minds starting a philosophy degree, for example, won't have gone through and probably, except in very rare cases, just won't have that, that the skills required."}, {"time": 3745, "text": "But part of it is just fun to disagree and dance with."}, {"time": 3745, "text": "I think to elaborate on what you're saying in agreement, not just gone through that, but continue to go through that."}, {"time": 3753, "text": "That's, I would say, the biggest problem with, quote unquote, expertise is that there's a certain point where you get, because it sucks."}, {"time": 3766, "text": "Like martial arts is a good example of that."}, {"time": 3766, "text": "It sucks to get your ass kicked."}, {"time": 3771, "text": "Like I, there's a temptation."}, {"time": 3771, "text": "I still go, like I train, you know, you're getting older too, but also there's killers out there in both the space of martial arts and the space of science."}, {"time": 3782, "text": "And I think that once you become a professor, like more and more senior and more and more respected, I don't know if you get your ass kicked in the space of ideas as often."}, {"time": 3794, "text": "I don't know if you allow yourself to truly expose yourself."}, {"time": 3794, "text": "If you do, that's a great, like sign of a, of a humble, brilliant mind is constantly exposing yourself to that."}, {"time": 3808, "text": "I think you do because I think there's, there's graduate students who want to, you know, find the objection to sort of write their paper or make their mark."}, {"time": 3812, "text": "And yeah, I, I think everyone still gives talks or should give talk, give talks and people are wanting to work out if there are any weaknesses to your position."}, {"time": 3823, "text": "So yeah, I think that generally works out."}, {"time": 3831, "text": "There is also a kind of, who do you give the talks to?"}, {"time": 3831, "text": "So, I mean, within communities, the little cluster of people that argue and bicker, but what are they arguing about?"}, {"time": 3841, "text": "They take a bunch of stuff, a bunch of basic assumptions as agreement, and they heatedly argue about certain ideas."}, {"time": 3856, "text": "The question is how open are, that that's actually kind of like fun."}, {"time": 3856, "text": "That's like, no offense, sorry, we're sticking on this martial arts thing."}, {"time": 3861, "text": "It's like people who practice Aikido or certain martial arts that don't truly test themselves in the cage, in combat."}, {"time": 3866, "text": "So it's like, it's fun to argue about like certain things when you're in your own community, but you don't test those ideas in the full context of science, in the full like seriousness, the rigor of the, sometimes like the real world."}, {"time": 3889, "text": "One of my favorite fields is psychology."}, {"time": 3889, "text": "There's often, places within psychology where you're kind of doing these studies and arguing about stuff that's done in the lab."}, {"time": 3899, "text": "The arguments are almost disjoint from real human behavior."}, {"time": 3899, "text": "Because it's so much easier to study human behavior in the lab, you just kind of stay there and that's where the arguments are."}, {"time": 3912, "text": "And so vision science is a good example, like studying eye movement and how we perceive the world and all that kind of stuff."}, {"time": 3917, "text": "It's so much easier to study in the lab that we don't consider we say that's going to be what the science of vision is going to be like, and we don't consider the science of vision in the actual real world, the engineering of vision."}, {"time": 3925, "text": "And so I think that's where exposing yourself to out of the box ideas, that's the most painful, that's the most important."}, {"time": 3936, "text": "I mean groupthink can be a terrible thing in philosophy as well, but because you're not to the same extent beholden to evidence and refutation from the evidence that you're in the sciences, it's a more subtle process of evaluation and so more susceptible, I think, to groupthink."}, {"time": 3953, "text": "It's a danger."}, {"time": 3953, "text": "We've talked about a million times, but let's try to sort of do that old basic terminology definitions."}, {"time": 3960, "text": "What is panpsychism?"}, {"time": 3960, "text": "Like what are the different ways you can try to think about to define panpsychism?"}, {"time": 3968, "text": "Maybe in contrast to naturalistic dualism and materialism, other kind of views of consciousness?"}, {"time": 3983, "text": "Yeah, so that you've basically laid out the different options."}, {"time": 3983, "text": "So I guess probably still the dominant view is materialism, that roughly that we can explain consciousness in the terms of physical science, wholly explain it just in terms of the electrochemical signaling in the brain."}, {"time": 4002, "text": "Dualism, the polar opposite view, that consciousness is nonphysical outside of the physical workings of the body and the brain, although closely connected."}, {"time": 4011, "text": "When I studied philosophy, we were taught basically they were the two options you had to choose, right?"}, {"time": 4022, "text": "Either you thought it were dualist and you thought it was separate from the physical, or you thought it was just electrochemical signaling."}, {"time": 4027, "text": "And yeah, I became very disillusioned because I think there are big problems with both of these options."}, {"time": 4033, "text": "So I think the attraction of panpsychism is it's kind of a middle way."}, {"time": 4037, "text": "It agrees with the materialist that there's just a physical world."}, {"time": 4037, "text": "Ultimately, there's just particles and fields."}, {"time": 4043, "text": "But the panpsychist, the materialist, but the panpsychist thinks there's more to the physical than what physical science reveals, and that the ultimate nature of the physical world is constituted of consciousness."}, {"time": 4057, "text": "So consciousness is not outside of the physical as the dualist thinks."}, {"time": 4064, "text": "It's embedded in, underlies the kind of description of the world we get from physics."}, {"time": 4075, "text": "What are the problems of materialism and dualism?"}, {"time": 4079, "text": "Starting with materialism, it's a huge debate, but I think that the core of it is that physical science works with a purely quantitative description of the physical world, whereas consciousness essentially involves qualities."}, {"time": 4094, "text": "If you think about the smell of coffee or the taste of mint or the deep red you experience as you watch a sunset, I think these qualities can't be captured in the purely quantitative language of physical science."}, {"time": 4113, "text": "So as long as your description of the brain is framed in the purely quantitative language of neuroscience, you'll just leave out these qualities and hence really leave out consciousness itself."}, {"time": 4125, "text": "And then dualism?"}, {"time": 4127, "text": "So I've actually changed my mind a little bit on this since I wrote the book."}, {"time": 4127, "text": "So, I mean, I argued in the book that we have pretty good experimental grounds for doubting dualism, and roughly the idea was if dualism were true, if there was, say, an immaterial mind impacting on the brain every second of waking life, that this would really show up in on neuroscience."}, {"time": 4149, "text": "There'd be all sorts of things happening in the brain that had no physical explanation."}, {"time": 4154, "text": "It would be like a poltergeist was playing with the brain."}, {"time": 4160, "text": "But actually, and so the fact that we don't find that is a strong and ever growing inductive argument against dualism."}, {"time": 4168, "text": "But actually, the more I talk to neuroscientists and read neuroscience and we have at Durham, my university, an interdisciplinary consciousness group, I don't think we know enough about the brain, about the workings of the brain to make that argument."}, {"time": 4185, "text": "I think we know a lot about the basic chemistry, how neurons fire, neurotransmitters, action potentials, things like that."}, {"time": 4194, "text": "We know a fair bit about large scale functions of the brain, what different bits of the brain do."}, {"time": 4200, "text": "But what we're almost clueless on is how those large scale functions are realized at the cellular level, how it works."}, {"time": 4214, "text": "People get quite excited about brain scans, but it's very low resolution."}, {"time": 4214, "text": "Every pixel on a brain scan corresponds to 5.5 million neurons."}, {"time": 4219, "text": "We're only 70% of the way through constructing a connectome for the maggot brain, which has 10,000 or 100,000 neurons, but the brain has 86 billion neurons."}, {"time": 4237, "text": "I think we'd have to know a lot more about how the brain works, how these functions are realized before we could assess whether the dynamics of the brain can be completely explicated in terms of underlying chemistry or physics."}, {"time": 4253, "text": "We'd have to do more engineering before we could figure that out."}, {"time": 4262, "text": "There are people with other proposals, someone I got to know, Martin Picard at Columbia University, who has the Psychobiology Mitochondrial Lab there and is experimentally exploring the hypothesis that mitochondria in the brain should be under social networks, perhaps as an alternative to reducing it to underlying chemistry and physics."}, {"time": 4281, "text": "It is ultimately an empirical question whether dualism is true."}, {"time": 4288, "text": "I'm less convinced that we know the answer to that question at this stage."}, {"time": 4294, "text": "I think still as scientists and philosophers, we want to try and find the simplest, most parsimonious theory of reality."}, {"time": 4299, "text": "Dualism is still a pretty inelegant, unparsimonious theory."}, {"time": 4307, "text": "Reality is divided up into the purely physical properties and these consciousness properties and they're radically different kinds of things."}, {"time": 4314, "text": "Whereas the panpsychist offers a much more simple, unified picture of reality."}, {"time": 4319, "text": "I think it's still the view to be preferred."}, {"time": 4323, "text": "To put it very simply, why believe in two kinds of things when you can just get away with one?"}, {"time": 4328, "text": "And materialism is also very simple, but you're saying it doesn't explain something that seems pretty important."}, {"time": 4335, "text": "I think materialism kind of, you know, science is about trying to find the simplest theory that accounts for the data."}, {"time": 4340, "text": "I don't think materialism can account for the data."}, {"time": 4344, "text": "Maybe dualism can account for the data, but panpsychism is simpler."}, {"time": 4350, "text": "It can account for the data and it's simpler."}, {"time": 4357, "text": "So in its broadest definition, it's the view that consciousness is a fundamental and ubiquitous feature of the physical world."}, {"time": 4367, "text": "Like a law of physics, what should we be imagining?"}, {"time": 4367, "text": "What do you think the different flavors of how that actually takes shape in the context of what we know about physics and science and the universe?"}, {"time": 4376, "text": "So in the simplest form of it, the fundamental building blocks of reality, perhaps electrons and quarks have incredibly simple forms of experience and the very complex experience of the human or animal brain is somehow rooted in or derived from these very simple forms of experience at the level of basic physics."}, {"time": 4394, "text": "But I mean, maybe the crucial bit about the kind of panpsychism I defend, what it does is it takes the standard approach to the problem of consciousness and turns it on its head, right?"}, {"time": 4408, "text": "So the standard approach is to think we start with matter and we think, how do we get consciousness out of matter?"}, {"time": 4413, "text": "So I don't think that problem can be solved for reasons I've kind of hinted at."}, {"time": 4418, "text": "We could maybe go into more detail, but the panpsychist does it the other way around."}, {"time": 4423, "text": "They start with consciousness and try to get matter out of consciousness."}, {"time": 4429, "text": "So the idea is basically at the fundamental level of reality, at the fundamental level of reality, there are just networks of very simple conscious entities."}, {"time": 4444, "text": "But these conscious entities, because they have very simple kinds of experience, they behave in predictable ways."}, {"time": 4449, "text": "Through their interactions, they realize certain mathematical structures."}, {"time": 4453, "text": "And then the idea is those mathematical structures just are the structures identified by physics."}, {"time": 4458, "text": "So when we think about these simple conscious entities in terms of the mathematical structures they realize, we call them particles, we call them fields, we call their properties mass, spin and charge."}, {"time": 4469, "text": "But really there's just these very simple conscious entities and their experiences."}, {"time": 4478, "text": "So in this way, we get physics out of consciousness."}, {"time": 4484, "text": "I don't think you can get consciousness out of physics, but I think it's pretty easy to get physics out of consciousness."}, {"time": 4488, "text": "Well, I'm a little confused by why you need to get physics out of consciousness."}, {"time": 4496, "text": "I mean, to me, it sounds like panpsychism unites consciousness and physics."}, {"time": 4503, "text": "I mean, physics is the mathematical science of describing everything."}, {"time": 4503, "text": "So physics should be able to describe consciousness."}, {"time": 4511, "text": "Panpsychism, in my understanding, proposes is that physics doesn't currently do so, but can in the future."}, {"time": 4518, "text": "I mean, it seems like consciousness, you have like Stephen Wolfram, who's all these people who are trying to develop theories of everything, mathematical frameworks within which to describe how we get all the reality that we perceive around us."}, {"time": 4534, "text": "To me, to me, there's no reason why that kind of framework cannot also include some accurate, precise description of whatever simple consciousness characteristics are present there at the lowest level, if panpsychist theories have truth to them."}, {"time": 4554, "text": "So like to me, it is physics."}, {"time": 4560, "text": "You said kind of physics emerges, by which you mean like the basic four laws of physics that as we currently know them, the standard model, quantum mechanics, general relativity that emerges from the base consciousness layer."}, {"time": 4575, "text": "So maybe the way I phrased it made it sound like these things are more separate than they are."}, {"time": 4580, "text": "What I was trying to address was a common misunderstanding of panpsychism, that it's a sort of dualistic theory."}, {"time": 4588, "text": "The idea is that particles have their physical properties like mass, spin, and charge, and these other funny consciousness properties."}, {"time": 4596, "text": "So the physicist Sabine Hossenfelder had a blog post critiquing panpsychism maybe a couple of years ago now that got a fair bit of traction."}, {"time": 4606, "text": "And she was interpreting panpsychism in this way."}, {"time": 4606, "text": "And then her thought was, well look, if particles had these funny consciousness properties, then it would show up in our physics like the standard model of particle physics would make false predictions because its predictions are based wholly on the physical properties."}, {"time": 4622, "text": "If there were also these consciousness properties, we'd get different predictions."}, {"time": 4628, "text": "But that's a misunderstanding of the view."}, {"time": 4628, "text": "The view is it's not that there are two kinds of property that mass, spin, and charge are forms of consciousness."}, {"time": 4633, "text": "How do we make sense of that?"}, {"time": 4640, "text": "Because actually when you look at what physics tells us, it's really just telling us about behavior, about what stuff does."}, {"time": 4646, "text": "I sometimes put it by saying doing physics is like playing chess when you don't care what the pieces are made of."}, {"time": 4652, "text": "You're just interested in what moves you can make."}, {"time": 4655, "text": "So physics tells us what mass, spin, and charge do, but it doesn't tell us what they are."}, {"time": 4663, "text": "The experience of mass."}, {"time": 4663, "text": "So the idea is, yeah, mass in its nature is a very simple form of consciousness."}, {"time": 4671, "text": "So yeah, physics in a sense is complete, I think, because it tells us what everything at the fundamental level does."}, {"time": 4676, "text": "It describes its causal capacities."}, {"time": 4676, "text": "But for the panpsychist at least, physics doesn't tell us what matter is."}, {"time": 4683, "text": "It tells us what it does, but not what it is."}, {"time": 4690, "text": "To push back on the thing I think she's criticizing, is it also possible, so I understand what you're saying, but is it also possible that particles have another property like consciousness?"}, {"time": 4702, "text": "I don't understand the criticism we would be able to detect it in our experiments."}, {"time": 4702, "text": "Well, no, if you're not looking for it."}, {"time": 4708, "text": "I mean there's a lot of stuff that are orthogonal."}, {"time": 4708, "text": "Like if you're not looking for this stuff, you're not going to detect it."}, {"time": 4716, "text": "Because like all of our basic empirical science through its recent history, and yes the history of science is quite recent, has been very kind of focused on billiard balls colliding and from that understanding how gravity works."}, {"time": 4727, "text": "But like we just haven't integrated other possibilities into this."}, {"time": 4736, "text": "I don't think there will be conflicting whether you are observing consciousness or not, or exploring some of these ideas."}, {"time": 4742, "text": "I don't think that affects the rest of the physics."}, {"time": 4748, "text": "The mass, the energy, the all the different kind of like the hierarchy of different particles and so on, how they interact."}, {"time": 4756, "text": "I don't think, it feels like consciousness is something orthogonal, like very much distinct."}, {"time": 4762, "text": "It's the quantitative versus the qualitative."}, {"time": 4769, "text": "There's something quite distinct that we're just almost like another dimension that we're just completely ignoring."}, {"time": 4774, "text": "There might be a way of responding to Sabina to say, well, that there could be properties of particles that don't show up in the specific circumstances in which physicists investigate particles."}, {"time": 4785, "text": "My colleague, the philosopher of science, Nancy Cartwright, has got this book, How the Laws of Physics Lie, where she says, physicists explore things in very specific circumstances and then in an unwarranted way generalize that."}, {"time": 4797, "text": "But I mean, I guess I was thinking Sabina's criticism actually just misses the mark in a more basic way."}, {"time": 4803, "text": "Her point is, we shouldn't think there are any more properties to particles other than those the standard model attributes to them."}, {"time": 4812, "text": "Panpsychus would say, yeah, sure, there aren't."}, {"time": 4812, "text": "There are just the properties, the physical properties like mass, spin and charge that the standard model attributes to them."}, {"time": 4818, "text": "It's just that we have a different philosophical view as to the nature of those properties."}, {"time": 4828, "text": "Those properties are turtles that are sitting on top of another turtle and that big turtle is consciousness."}, {"time": 4832, "text": "But I'm just saying, it's possible that's true."}, {"time": 4832, "text": "It's possible also that consciousness is just another turtle playing with the others."}, {"time": 4839, "text": "It's just not interacting in the ways that we've been observing."}, {"time": 4844, "text": "In fact, to me, that's more compelling because then that's going to be, well, no, I think both are very compelling, but it feels like it's more within the reach of empirical validation if it's yet another property of particles that we're just not observing."}, {"time": 4863, "text": "If it's like the thing from which matter and energy and physics emerges, it makes it that much more difficult to investigate how you get from that base layer of consciousness to the wonderful little spark of consciousness, complexity and beauty that is the human being."}, {"time": 4890, "text": "I don't know if you're necessarily trying to get there, but one of the beautiful things to get at with panpsychism or with a solid theory of consciousness is to answer the question, how do you engineer the thing?"}, {"time": 4902, "text": "How do you get from nothing vacuum in the lab?"}, {"time": 4911, "text": "If there is that consciousness base layer, how do you start engineering organisms that have consciousness in them?"}, {"time": 4917, "text": "Or the reverse of that describing how does consciousness emerge in the human being from conception, from a stem cell to the whole full neurobiology that builds from that, how do you get this full rich experience of consciousness that humans have?"}, {"time": 4932, "text": "It feels like that's the dream and if consciousness is just another player in the game of physics, it feels more amenable to our scientific understanding of it."}, {"time": 4947, "text": "I mean, I guess it's supposed to be a kind of identity claim here that physics tells us what matter does, consciousness is what matter is."}, {"time": 4961, "text": "So matter is sort of what consciousness does."}, {"time": 4961, "text": "So at the bottom level, there is just consciousness and conscious things."}, {"time": 4969, "text": "There are just these simple things with their experiences and that is their total nature."}, {"time": 4974, "text": "So in that sense, it's not another player, it's just all there is really."}, {"time": 4981, "text": "In physics, we describe that at a certain level of abstraction."}, {"time": 4981, "text": "We capture what Bertrand Russell, who was the inspiration for a lot of this, calls the causal skeleton of the world."}, {"time": 4996, "text": "So physics is just interested in the causal skeleton of the world, it's not interested in flesh and blood, although that's maybe suggesting separation again too much, or metaphors fail in the end."}, {"time": 5005, "text": "So yeah, you totally right."}, {"time": 5005, "text": "Ultimately, what we want to explain is how our consciousness and the consciousness of other animals comes out of this."}, {"time": 5015, "text": "If we can't do that, then it's game over."}, {"time": 5020, "text": "But I think it maybe makes more sense on the identity claim that if matter at the fundamental level just is forms of consciousness, then we can perhaps make sense of how those simple forms of consciousness in some way combine in some way to make the consciousness we know and love."}, {"time": 5038, "text": "Yeah, so I guess the question is, so the reason you can describe, like the reason you have material engineering, material science, is because you have from physics to chemistry, like you keep going up and up in levels of complexity in order to describe objects that we have in our human world."}, {"time": 5061, "text": "And it would be nice to do the same thing for consciousness, to come up with the chemistry of consciousness, right?"}, {"time": 5070, "text": "Like how do the different particles interact to create greater complexity?"}, {"time": 5077, "text": "So you can do this kind of thing for life, like what is life, like living organisms, at which point do living organisms become living?"}, {"time": 5090, "text": "What, like what, how do you know if I give you a thing that that thing is living?"}, {"time": 5097, "text": "And there's a lot of people working on this kind of idea and some of that has to do with the levels of complexity and so on."}, {"time": 5103, "text": "It'd be nice to know like measuring different degrees of consciousness as you get into a bigger, more and more complex objects."}, {"time": 5109, "text": "And that's, I mean that's what chemistry, biochemistry, like bigger and bigger conscious molecules, and to see how that leads to organisms."}, {"time": 5121, "text": "And then organisms like start to collaborate together like they do inside a human body to create the full human body."}, {"time": 5126, "text": "To do those kinds of experiments would be, it seems like that would be kind of a goal."}, {"time": 5130, "text": "That's what I mean by player in a game of physics, as opposed to like the base layer."}, {"time": 5136, "text": "If it's just the base layer, it becomes harder to track it as you get from physics to chemistry to biology to psychology."}, {"time": 5147, "text": "In every case, apart from consciousness, I would say what we're interested in is behavior."}, {"time": 5155, "text": "We're interested in explaining behavioral functions."}, {"time": 5155, "text": "So at the level of fundamental physics, we're interested in capturing the equations that describe the behavior there."}, {"time": 5160, "text": "And when we get to higher levels, we're interested in explicating the behavior, perhaps in terms of behavior at simpler levels."}, {"time": 5171, "text": "And with life as well, that's what we're interested in, the various observable functions of life, explaining them in terms of more simple mechanisms."}, {"time": 5177, "text": "But in the case of consciousness, I don't think that's what we're doing, or at least not all that we're doing."}, {"time": 5191, "text": "In the case of consciousness, there are these subjective qualities that we're immediately aware of that the redness of a red experience, the itchiness of an itch, and we're trying to account for them."}, {"time": 5203, "text": "We're trying to bring them into our theory of reality and postulating some mechanism does not deal with that."}, {"time": 5209, "text": "So I think we've got to realize dealing with consciousness is a radically different explanatory task from other tasks of science."}, {"time": 5214, "text": "Other tasks of science, we're trying to explain behavior in terms of simpler forms of behavior."}, {"time": 5219, "text": "In the case of consciousness, we're trying to explain these invisible subjective qualities that you can't see from the outside, but that you're immediately aware of."}, {"time": 5229, "text": "The reason materialism perhaps continues to dominate is people think, look at the success of science, it's incredible, look at all the, you know, it's explained all this, surely it's going to explain consciousness."}, {"time": 5240, "text": "But I think we have to appreciate there's a radically different explanatory task here."}, {"time": 5244, "text": "And so that, I mean, the neuroscientist Anil Seth, who I've had lots of intense but friendly discussions with, you know, wants to compare consciousness to life."}, {"time": 5256, "text": "But I think there's this radical difference that in the case of life, again, we come back to public observation, all of the data, publicly observable data, we're basically trying to explain complex behavior."}, {"time": 5268, "text": "And the way you do that is identify mechanisms, simpler mechanisms that explicate that behavior."}, {"time": 5274, "text": "That's the task in physics, chemistry, neurobiology."}, {"time": 5281, "text": "But in the case of consciousness, that's not what we're trying to do."}, {"time": 5287, "text": "We're trying to account for these subjective qualities and you postulate a mechanism that might explain behavior, but it doesn't explain the redness of a red experience."}, {"time": 5298, "text": "So, but still, I mean, still, ultimately, the hope is that we will have some kind of hierarchical story."}, {"time": 5305, "text": "So we take the causal dynamics of physics, we hypothesize that that's filled out with certain forms of consciousness."}, {"time": 5314, "text": "And then at higher levels, we get more complex causal dynamics filled out by more complex forms of consciousness."}, {"time": 5320, "text": "And ultimately, we get to us, hopefully."}, {"time": 5320, "text": "So yeah, so there's still a sort of hierarchical explanatory framework there."}, {"time": 5332, "text": "So you kind of mentioned the hierarchy of consciousness."}, {"time": 5332, "text": "Do you think it's possible to, within the panpsychism framework, to measure consciousness?"}, {"time": 5338, "text": "Or put another way, are some things more conscious than others, in the panpsychist view?"}, {"time": 5354, "text": "I mean, I do see consciousness as a dealing with consciousness, an interdisciplinary task between something more experimental, which is to do with the ongoing project of trying to work out what people call the neural correlates of consciousness, of consciousness, what kinds of physical brain activity correspond to conscious experience."}, {"time": 5381, "text": "That's one part of it."}, {"time": 5381, "text": "But I think essentially, there's also a theoretical question of more the why question."}, {"time": 5388, "text": "Why do those kinds of brain activity go along with certain kinds of conscious experience?"}, {"time": 5396, "text": "I don't think you can answer that."}, {"time": 5396, "text": "Because consciousness is not publicly observable."}, {"time": 5400, "text": "I don't think you can answer that why question with an experiment."}, {"time": 5400, "text": "But they have to go hand in hand."}, {"time": 5407, "text": "And I mean, one of the theories I'm attracted to is the integrated information theory, according to which we find consciousness at the level at which there is most integrated information."}, {"time": 5420, "text": "And they try to give a mathematically precise definition of that."}, {"time": 5420, "text": "So on that view, you know, probably this cup of tea isn't conscious, because there's probably more integrated information in the molecules making up the tea than there is in the liquid as a whole."}, {"time": 5436, "text": "But in the brain, what is distinctive about the brain is that there's a huge amount of integrated, there's more integrated information in the system than there is in individual neurons."}, {"time": 5442, "text": "So that's why they claim that that's the basis of consciousness at the macro level."}, {"time": 5447, "text": "I mean, I like some features of this theory, but they do talk about degrees of consciousness."}, {"time": 5457, "text": "They do want to say there is gradations."}, {"time": 5463, "text": "I'm not sure conceptually I can kind of make sense of that."}, {"time": 5463, "text": "I mean, there are things to do with consciousness that are graded, like complexity or levels of information."}, {"time": 5471, "text": "But I'm not sure whether experience itself admits a degree."}, {"time": 5481, "text": "I sort of think something either has experience or it doesn't."}, {"time": 5488, "text": "It might have very simple experience, it might have very complex experience, but experience itself, I don't think it admits a degree in that sense."}, {"time": 5492, "text": "It's not more experience, less experience."}, {"time": 5499, "text": "I sort of find that conceptually hard to make sense of."}, {"time": 5499, "text": "But I'm kind of open minded on it."}, {"time": 5505, "text": "So when we have a lot higher resolution of sensory information, don't you think that's correlated to the richness of the experience?"}, {"time": 5515, "text": "So doesn't more information provide a richer experience?"}, {"time": 5523, "text": "Or is that, again, thinking quantitatively and not thinking about the subjective experience?"}, {"time": 5528, "text": "Like you can experience a lot with very little sensory information, perhaps."}, {"time": 5536, "text": "Do you think those are connected?"}, {"time": 5536, "text": "So there are features, characteristics here we can grade, the complexity of the experience."}, {"time": 5540, "text": "And on the integrated information theory, they correlate that in terms of mathematically identifiable structure with integrated information."}, {"time": 5559, "text": "So roughly, it's a quite unusual notion of information."}, {"time": 5559, "text": "It's perhaps not the standard way one thinks about information."}, {"time": 5564, "text": "It's to do with constraining past and future possibilities of the system."}, {"time": 5572, "text": "So the idea is in the retina of the eye, there's a huge amount of possible states the retina of my eye could be in at the next moment, depending on what light goes into it."}, {"time": 5584, "text": "Whereas the possible next states of the brain are much more likely to be in the retina of the eye."}, {"time": 5592, "text": "The possible next states of the brain are much more constrained."}, {"time": 5592, "text": "Obviously, it responds to the environment, but it heavily constrains its past and future states."}, {"time": 5596, "text": "And so that's the idea of information they have."}, {"time": 5605, "text": "And then the second idea is how much that information is dependent on integration."}, {"time": 5613, "text": "So in a computer where you have transistors, you take out a few transistors, lose that much information."}, {"time": 5620, "text": "It's not dependent on interconnections."}, {"time": 5620, "text": "Whereas you take a tiny bit of the brain out, you lose a lot of information because the way it stores information is dependent on the interconnections of the system."}, {"time": 5631, "text": "So that's one proposal for how to measure one gradable characteristic, which might correspond to some gradable characteristic in qualitative consciousness."}, {"time": 5646, "text": "And maybe I'm being very pedantic, which is, you know, philosophers, professional pedants."}, {"time": 5651, "text": "I just sort of don't think that is a quantity of experience."}, {"time": 5651, "text": "It's a quantity of the structure of experience, maybe, but I just find it hard to make sense of the idea of how much experience do you have?"}, {"time": 5666, "text": "I've got, you know, five units of experience."}, {"time": 5666, "text": "I've got one unit of experience."}, {"time": 5672, "text": "I find that a bit hard to make sense."}, {"time": 5672, "text": "Maybe I'm being just pedantic."}, {"time": 5678, "text": "I think just saying the word experience is difficult to think about."}, {"time": 5678, "text": "Let's talk about suffering."}, {"time": 5686, "text": "Let's talk about a particular experience."}, {"time": 5686, "text": "So let's talk about me and the hamster."}, {"time": 5694, "text": "I just think that no offense to the hamster."}, {"time": 5694, "text": "Probably no hamsters are listening."}, {"time": 5699, "text": "So now you're offending hamsters too."}, {"time": 5699, "text": "Maybe there's a hamster that's just pissed off."}, {"time": 5705, "text": "There's probably somebody on a speaker right now listening to this podcast and they probably have a hamster or a guinea pig and that hamster is listening."}, {"time": 5713, "text": "It just doesn't know the English language or any kind of human interpretable linguistic capabilities to tell you to fuck off."}, {"time": 5727, "text": "It understands exactly what's being talked about and can see through us."}, {"time": 5727, "text": "Anyway, it just feels like a hamster has less capacity to suffer than me."}, {"time": 5735, "text": "And maybe a cockroach or an insect or maybe a bacteria has less capacity to suffer than me."}, {"time": 5748, "text": "But maybe that's me deluding myself as to the complexity of my conscious experience."}, {"time": 5759, "text": "Maybe there is some sense in which I can suffer more, but to reduce it to something quantifiable is impossible."}, {"time": 5774, "text": "Angus Yeah, I guess I definitely think there's kinds of suffering that you have the joy of being possible for you that aren't available to a hamster, I don't think."}, {"time": 5788, "text": "Well, can a hamster suffer heartbreak?"}, {"time": 5788, "text": "Can a cockroach suffer heartbreak?"}, {"time": 5788, "text": "But it's certainly, I mean, there's kinds of fear of your own death, concern about whether there's a purpose to existence."}, {"time": 5802, "text": "These are forms of suffering that aren't available to most nonhuman animals."}, {"time": 5811, "text": "Whether there's an overall scale that we could put physical and emotional suffering on and identify where you are on that scale, I'm not so sure."}, {"time": 5824, "text": "Angus So it's like humans have a much bigger menu of experiences, much bigger selection."}, {"time": 5832, "text": "Angus In one sense at least."}, {"time": 5834, "text": "Angus So there's like a page that's suffering."}, {"time": 5834, "text": "So this menu of experiences, you know, like you have the omelets and the breakfast and so on."}, {"time": 5839, "text": "And one of the pages is suffering."}, {"time": 5843, "text": "It's just we have a lot compared to a hamster, a lot more."}, {"time": 5843, "text": "But any one individual thing that we share with a hamster, that experience, it's difficult to argue that we experience it deeper than others like hunger or something like that."}, {"time": 5860, "text": "Angus Yeah, physical pain, I'm not sure."}, {"time": 5860, "text": "But I mean, there are kinds of experiences animals have that we don't."}, {"time": 5865, "text": "Bats echolocate around the world."}, {"time": 5872, "text": "Philosopher Thomas Nagel famously pointed out that, you know, no matter how much you understand of the neurophysiology of bats, you'll still not know what it's like to squeal and find your way around by listening to the echoes bounce off."}, {"time": 5884, "text": "So yeah, I mean, I guess I feel the intuition that there's emotional suffering is I want to say deeper than physical suffering."}, {"time": 5892, "text": "I don't know how to make that statement precise, though."}, {"time": 5900, "text": "Angus So one of the ways I think about I think people think about consciousness is in connection to suffering."}, {"time": 5908, "text": "So let me just ask about suffering because that's how people think about animals, cruelty to animals or cruelty to living things."}, {"time": 5914, "text": "They connect that to suffering into consciousness."}, {"time": 5922, "text": "I think there's a sense in which those are two are deeply connected when people are thinking about just public policy."}, {"time": 5930, "text": "They're thinking about this is like philosophy, engineering, psychology, sociology, political science."}, {"time": 5938, "text": "All of those things have to do with human suffering and animal suffering, life suffering."}, {"time": 5945, "text": "And that's connected to consciousness in a lot of people's minds."}, {"time": 5950, "text": "Is it connected like that for you?"}, {"time": 5950, "text": "So the the capacity to suffer, is it also is it also somehow like strongly correlated with the capacity to experience?"}, {"time": 5963, "text": "Angus Yeah, I would say I would say suffering is a kind of experience."}, {"time": 5966, "text": "And so you have to be conscious to suffer."}, {"time": 5966, "text": "Actually, this so there is one people taking more unusual views of consciousness seriously now."}, {"time": 5975, "text": "Panpsychism is is one radical approach."}, {"time": 5983, "text": "Another one is what's become known as illusionism, the view that consciousness, at least in the sense that philosophers think about it, doesn't really exist at all."}, {"time": 5994, "text": "So yeah, my podcast mind chat I host with a committed illusionist."}, {"time": 5994, "text": "So the gimmick is I think consciousness is everywhere."}, {"time": 6003, "text": "He thinks it's nowhere."}, {"time": 6003, "text": "And so that's one very simple way of avoiding all these problems, right?"}, {"time": 6010, "text": "Consciousness doesn't exist, we don't need to explain it."}, {"time": 6015, "text": "Job done."}, {"time": 6015, "text": "Although we might still have to explain why we seem to be conscious, why it's so hard to get out of the idea that we're conscious."}, {"time": 6021, "text": "But that the reason I connect this to what you're saying is, actually, my co host, Keith Frankish, is a little bit ambivalent on the word pain."}, {"time": 6032, "text": "He says, Oh, in some, you know, in some sense, I believe in pain."}, {"time": 6032, "text": "And in some sense, I don't."}, {"time": 6036, "text": "But another illusionist, Francois Camara, has a paper discussing how we think about morality, given his view that pain in the way we normally think about it just does not exist."}, {"time": 6049, "text": "He thinks it's an illusion, the brain tricks us into thinking we feel pain, but we don't."}, {"time": 6049, "text": "And how we should think about morality in the light of that."}, {"time": 6056, "text": "It's become a big topic, actually, thinking about the connection between consciousness and morality."}, {"time": 6061, "text": "David Chalmers, the philosopher, is most associated with this concept of a philosophical zombie."}, {"time": 6066, "text": "So a philosophical zombie is very different from a Hollywood zombie."}, {"time": 6074, "text": "Hollywood zombies, you know, you know what they're like, but philosophical zombies are sort of really good."}, {"time": 6079, "text": "A Korean zombie movie on Halloween this year."}, {"time": 6085, "text": "Anyway, philosophical zombies behave just like us because the physical workings of their body and brain are the same as ours, but they have no conscious experience."}, {"time": 6096, "text": "There's nothing that it's like to be a zombie."}, {"time": 6096, "text": "So you stick a knife in it, it screams and runs away, but it doesn't actually feel pain."}, {"time": 6101, "text": "It's just a complicated mechanism set up to behave just like us."}, {"time": 6110, "text": "Now there's lots of, no one believes in these."}, {"time": 6110, "text": "I think there's one philosopher who believes in everyone is a zombie except him."}, {"time": 6114, "text": "But isn't that what illusionism is?"}, {"time": 6118, "text": "Yeah, I suppose so in a sense."}, {"time": 6118, "text": "Illusionism is if you were all zombies."}, {"time": 6118, "text": "And, you know, one reason to think about zombies is to think about the value of consciousness."}, {"time": 6126, "text": "So if there were a zombie, here's a question."}, {"time": 6130, "text": "Suppose we could, I mean, suppose we could make zombies by, let's say, for the sake of discussion, things made of silicon aren't conscious."}, {"time": 6136, "text": "It could turn out to be true."}, {"time": 6140, "text": "And suppose you built Commander Data out of silicon, you know, it's a bit of an old school reference to Star Trek New Next Generation."}, {"time": 6147, "text": "So, you know, behaves just like a human being, but, you know, it can, you can have a sophisticated conversation."}, {"time": 6152, "text": "It will talk about its hopes and fears, but it has no consciousness."}, {"time": 6158, "text": "Does it have moral rights?"}, {"time": 6158, "text": "Is it murder to turn off such a being?"}, {"time": 6169, "text": "You know, I'm inclined to say, no, it's not."}, {"time": 6169, "text": "You know, if it doesn't have experience, it doesn't really suffer."}, {"time": 6174, "text": "It doesn't really have moral rights at all."}, {"time": 6174, "text": "So I'm inclined to think, you know, consciousness is the basis of moral value, moral concern."}, {"time": 6179, "text": "And conversely, as a panpsychist, for this reason, I think it can transform your relationship with nature."}, {"time": 6195, "text": "If you think of a tree as a conscious organism, albeit of a very unusual kind, then a tree is a locus of moral concern in its own right."}, {"time": 6201, "text": "Chopping down a tree is an act of immediate moral concern."}, {"time": 6209, "text": "If you see these, you know, horrible forest fires, we're all horrified."}, {"time": 6216, "text": "But if you think it's the burning of conscious organisms, that does add a whole new dimension."}, {"time": 6222, "text": "Although it also makes things more complicated because people often think as a panpsychist, I'm going to be vegan."}, {"time": 6227, "text": "But it's tricky because if you think plants and trees are conscious as well, you've got to eat something."}, {"time": 6233, "text": "If you don't think plants and trees are conscious, then you've got a nice moral dividing line."}, {"time": 6237, "text": "You can say, I'm not going to eat things that aren't conscious."}, {"time": 6237, "text": "I'm not going to kill things that aren't conscious."}, {"time": 6241, "text": "But if you think plants and trees are conscious, then you don't have that nice moral dividing line."}, {"time": 6246, "text": "I mean, so the principle I'm kind of working my way towards, I haven't kept it up in my trip to the US, but it's just not eating any animal products that are factory farmed."}, {"time": 6259, "text": "You know, my vegan friends say, well, they're still suffering there."}, {"time": 6263, "text": "And I think there is even in the nicest farms, cows will suffer when their calves are taken off them."}, {"time": 6273, "text": "They go for a few days of quite serious mourning."}, {"time": 6273, "text": "So they're still suffering."}, {"time": 6273, "text": "But it seems to me, my thought is the principle of just not having factory farm stuff is something more people could get on board with."}, {"time": 6284, "text": "And you might have greater harm minimization."}, {"time": 6284, "text": "So if people went into restaurants and said, are your animal products factory farmed?"}, {"time": 6289, "text": "If not, I want the vegan option."}, {"time": 6296, "text": "Or if people looked out for the label that said no factory farmed ingredients."}, {"time": 6296, "text": "You know, I think maybe that that could make a really big difference to the market and harm minimization."}, {"time": 6305, "text": "Anyway, so that's the, so it's very ethically tricky."}, {"time": 6305, "text": "But some people don't buy that."}, {"time": 6305, "text": "There's a very good philosopher, Jeff Lee, who thinks zombies should have equal rights, consciousness, doesn't matter, you know."}, {"time": 6315, "text": "Let us go there."}, {"time": 6315, "text": "But first, I listened to your podcast."}, {"time": 6315, "text": "It's awesome to have two very kind of different philosophies inter dancing together in one place."}, {"time": 6323, "text": "What's the name of the podcast again?"}, {"time": 6331, "text": "Mind chat."}, {"time": 6331, "text": "So yeah, that's the idea."}, {"time": 6331, "text": "I guess, you know, polarized times."}, {"time": 6336, "text": "I mean, I love trying to get in the mindset of people I really disagree with."}, {"time": 6336, "text": "And you know, I can't understand how on earth they're thinking that, you know, really trying to have respect and try and, you know, see where they're coming from."}, {"time": 6348, "text": "So that's what yeah, Keith Frankish and I do of from polar opposite views, really trying to understand each other."}, {"time": 6359, "text": "And you know, interviewing scientists and philosophers of consciousness from those different perspectives."}, {"time": 6362, "text": "Although in a sense, in a sense, we have a very common, a common starting point, because we both think you can't fully account for consciousness, at least as philosophers normally think of it in conventional scientific terms."}, {"time": 6378, "text": "So we said that starting point."}, {"time": 6378, "text": "But we react to it in very different ways."}, {"time": 6383, "text": "He says, well, it doesn't exist then."}, {"time": 6383, "text": "It's like, fairy dust."}, {"time": 6387, "text": "It's, you know, which is, you know, we don't believe in anymore."}, {"time": 6387, "text": "Whereas I say, it does exist."}, {"time": 6393, "text": "So we have to rethink what science is."}, {"time": 6393, "text": "So you recently talked to on the podcast with Sean Carroll, and I first heard you, your great interview with Sean Carroll on his podcast, Mindscape."}, {"time": 6407, "text": "What is interesting to kind of see if there's agreements, disagreements between the two of you, because he's a, you know, a very serious quantum mechanics guy."}, {"time": 6417, "text": "He's a physics guy, but he also thinks about deep philosophical questions."}, {"time": 6424, "text": "He's a big proponents of many worlds interpretation of quantum mechanics."}, {"time": 6430, "text": "So actually, I'm trying to think, aside from your conversation with him, I'm trying to, I'm trying to remember what he thinks about consciousness."}, {"time": 6438, "text": "But anyway, maybe you can comment on what, what are some interesting agreements and disagreements with Sean Carroll?"}, {"time": 6447, "text": "I don't think there's many agreements, but, but, you know, we've had really constructive, interesting discussions in, in, in a lot of different contexts."}, {"time": 6454, "text": "And, you know, he's very clued up about philosophies, very respectful of philosophy, certain physicists who shall remain nameless think, what's all this bullshit philosophy?"}, {"time": 6466, "text": "We don't have to waste our time with that."}, {"time": 6471, "text": "And then go on to do pretty bad philosophy."}, {"time": 6471, "text": "The book co written by Stephen Hawking and Leonard Mlodinow famously starts off saying, philosophy is just as important as philosophy."}, {"time": 6481, "text": "Mlodinow famously starts off saying, philosophy is dead."}, {"time": 6481, "text": "And then goes on in later chapters to do some pretty bad philosophy."}, {"time": 6487, "text": "So, uh, I think we have to do philosophy, if only to get rid of bad philosophy, you know, you can't, you can't escape, but, um, strong words."}, {"time": 6493, "text": "Sean Carroll and I also had a debate on, on clubhouse, a panpsychism debate together with Annika Harris and Owen Flanagan."}, {"time": 6505, "text": "It was a two people on each team."}, {"time": 6505, "text": "And, uh, it was the most popular thing on clubhouse at that time."}, {"time": 6513, "text": "Um, so yeah, so he's, he's a, he's a materialist of a pretty standard kind that, um, consciousness is be understood as a sort of emergent feature."}, {"time": 6529, "text": "It's not, not adding anything, a weekly emergent feature."}, {"time": 6529, "text": "But what I guess what we've been debating most about is, is whether my view can account for mental causation for the fact that consciousness is doing stuff."}, {"time": 6542, "text": "So he thinks the fact that I think zombies are logically coherent, it's logic, there's a, it's logically coherent for there to be a world physically, just like ours in which there's no consciousness."}, {"time": 6558, "text": "He thinks that shows, oh, well, my view, consciousness doesn't do anything."}, {"time": 6562, "text": "It doesn't add anything, which is crazy."}, {"time": 6562, "text": "You know, my, my, my consciousness impacts on the world."}, {"time": 6568, "text": "My conscious thoughts are causing me to say the words I'm saying now."}, {"time": 6568, "text": "My visual experience helps me navigate the world."}, {"time": 6575, "text": "But I mean, my response to Sean Carroll is, is on the panpsychist view, the relationship between physics and fundamental consciousness is a sort of like the relationship between hot software and hardware, right?"}, {"time": 6590, "text": "Physics is sort of the software and consciousness is the hardware."}, {"time": 6599, "text": "So consciousness at the fundamental level is the hardware on which the software of physics runs."}, {"time": 6606, "text": "And just because, you know, just because a certain bit of software could run on two different kinds of hardware, it doesn't mean the hardware isn't doing anything."}, {"time": 6617, "text": "The fact that Microsoft Word can run on your desktop and run on your laptop doesn't mean your desktop isn't doing anything."}, {"time": 6622, "text": "Similarly, just because there could be another universe in which the physics is realized in non conscious stuff, it doesn't mean the consciousness in our universe isn't doing stuff."}, {"time": 6634, "text": "You know, for the panpsychist, all there is is consciousness."}, {"time": 6634, "text": "So if something's doing something, it is."}, {"time": 6640, "text": "RG In your view, it's not emergent."}, {"time": 6640, "text": "And more than that, it's doing quite a lot."}, {"time": 6649, "text": "CB It's doing everything."}, {"time": 6649, "text": "It's the only thing that exists."}, {"time": 6651, "text": "RG But it's, so, you know, the ground is, is important because we walk on it."}, {"time": 6651, "text": "It's like holding stuff up, but it's not really doing that much."}, {"time": 6660, "text": "But it feels like consciousness is doing quite a lot, is doing quite a lot of work."}, {"time": 6668, "text": "And sort of interacting with the environment."}, {"time": 6676, "text": "It feels like consciousness is not just a, like, if you remove consciousness, it's not just that you remove the experience of things."}, {"time": 6682, "text": "It feels like you're also going to remove a lot of the progress of human civilization, society and all that."}, {"time": 6695, "text": "It just feels like consciousness has a lot of value in how we develop our society."}, {"time": 6695, "text": "So from everything you said with suffering, with morality, with motivation, with love and fear and all of those kinds of things, it seems like it's consciousness in all different flavors and ways is part of all of that."}, {"time": 6716, "text": "And so without it, you may not have human civilization at all."}, {"time": 6716, "text": "So it's doing a lot of work causality wise and in every kind of way."}, {"time": 6725, "text": "Of course, when you go to the physics level, it starts to say, okay, how much, maybe the work consciousness is doing is higher at some levels of reality than at others."}, {"time": 6741, "text": "Maybe a lot of the work it's doing is most apparent at the human level."}, {"time": 6748, "text": "When you have, at the complex organism level, maybe it's quite boring."}, {"time": 6748, "text": "Like maybe the stuff of, like physics is more important at the formation of stars and all that kind of stuff."}, {"time": 6763, "text": "Consciousness only starts being important when you have greater complexities of organism."}, {"time": 6770, "text": "My consciousness is complicated and fairly complicated."}, {"time": 6770, "text": "And as a result, it does complicated things."}, {"time": 6778, "text": "The consciousness of a particle is very simple and hence it behaves in predictable ways."}, {"time": 6784, "text": "But the idea is the particle, its entire nature is constituted of its forms of consciousness and it does what it does because of those experiences."}, {"time": 6793, "text": "It's just that when we do physics, we're not interested in what stuff is."}, {"time": 6799, "text": "We're just interested in what it does."}, {"time": 6799, "text": "So physics abstracts away from the stuff of the world and just describes it in terms of its mathematical causal structure."}, {"time": 6816, "text": "But it's still on the panzeiger's view, it's consciousness that's doing stuff."}, {"time": 6819, "text": "I gotta ask you, because you kind of said, you know, there is some value in consciousness helping us understand morality and a philosophical zombie is somebody that, you know, you're more okay."}, {"time": 6842, "text": "How do I phrase it?"}, {"time": 6842, "text": "That's not like accusing of stuff, but in your view, it's more okay to murder a philosophical zombie than it is a human being."}, {"time": 6851, "text": "I wouldn't even call it murder maybe."}, {"time": 6858, "text": "Turn off the power to the first off zombie, the source of energy."}, {"time": 6864, "text": "So here comes then the question."}, {"time": 6864, "text": "We kind of talked about this offline a little bit."}, {"time": 6864, "text": "So I think that there is something special about consciousness and, you know, I'm very open minded about where the special comes from, whether it's the fundamental base of all reality, like you're describing, or whether there's some importance to the special pockets of consciousness that's in humans or living organisms."}, {"time": 6891, "text": "I find all those ideas beautiful and exciting."}, {"time": 6898, "text": "And I also know or think that robots don't have consciousness in the same way we've been describing."}, {"time": 6908, "text": "Sort of, I'm kind of a dumb human, but I'm just using like common sense."}, {"time": 6908, "text": "Like here's some metal and some electricity traveling in certain kinds of ways."}, {"time": 6917, "text": "It's not conscious in ways I understand humans to be conscious."}, {"time": 6924, "text": "At the same time, I'm also somebody who knows how to bring a robot to life, meaning I can make a move, I can make them recognize the world, I can make them interact with humans."}, {"time": 6937, "text": "And when I make them interact in certain kinds of ways, I as a human observe them and feel something for them."}, {"time": 6944, "text": "Moreover, I form a kind of connection with, I'm able to form a kind of connection with robots that make me feel like they're conscious."}, {"time": 6954, "text": "Now I know intellectually they're not conscious, but I feel like they're conscious."}, {"time": 6961, "text": "And it starts to get into this area where I'm not so okay, so let me use the M word of murder."}, {"time": 6966, "text": "I become less and less okay murdering that robot that I know, I quote, know is quote, not conscious."}, {"time": 6976, "text": "So like can you maybe as a therapy session help me figure out what we do here?"}, {"time": 6987, "text": "And perhaps a way to ask that in another way, do you think there'll be a time in like 20, 30, 50 years when we're not morally okay turning off the power to a robot?"}, {"time": 7004, "text": "So it's a really good important question."}, {"time": 7004, "text": "So I said, I'd be okay with turning off a philosophical zombie, but there's a difficult epistemological question there that meaning, you know, to do with knowledge, how would we know if it was a philosophical zombie?"}, {"time": 7023, "text": "I think probably if there were a silicon creature that could behave just like us and, you know, talk about its views about the pandemic and the global economy and probably we would think it's conscious."}, {"time": 7037, "text": "Because consciousness is not publicly observable, it is a very difficult question how we decide which things are and are not conscious."}, {"time": 7044, "text": "And so in the case of human beings, we can't observe their consciousness, but we can ask them."}, {"time": 7049, "text": "And then we try to, you know, if we scan their brain while we do that, and we'll stimulate the brain, then we can start to correlate in the human case, which kind of brain activity are associated with conscious experience."}, {"time": 7066, "text": "But the more we depart from the human case, the trickier that becomes as a famous paper by the philosopher Ned Block called The Even Harder Problem of Consciousness, where he says, you know, could we ever answer the question of, so suppose you have a silicon duplicate, right?"}, {"time": 7088, "text": "And let's say we're thinking about the silicon duplicates pain."}, {"time": 7096, "text": "How would we ever know whether what's the ground of the pain is the hardware or the software, really?"}, {"time": 7104, "text": "So in our case, how would we ever know empirically whether it's the specific neurophysiological state, C fibers firing or whatever that's relevant for pain, or if it's something more functional, more to do with the causal role in behavioral functioning, that's the software that's realized."}, {"time": 7122, "text": "And that's important because this silicon duplicate has the second thing, it has the software, it has the thing that plays the relevant causal role that pain does in us, but it doesn't have the hardware, it doesn't have the same neurophysiological state."}, {"time": 7141, "text": "And he argues, you know, it's just really difficult to see how we'd ever answer that question because in a human, you're never to begin to have both things."}, {"time": 7145, "text": "So how do we work out which is which?"}, {"time": 7150, "text": "And I mean, so even forgetting the hard problem of consciousness, even the scientific question of trying to find the neural correlates of consciousness is really hard."}, {"time": 7156, "text": "And there's absolutely no consensus."}, {"time": 7162, "text": "And, you know, so that some people think it's in the front of the brain, some people think it's in the back of the brain."}, {"time": 7167, "text": "It's just a total mess."}, {"time": 7167, "text": "So I suspect the robots you currently have are not conscious."}, {"time": 7173, "text": "I guess on any of the reasonably viable models, even though there's great disagreement, all of them probably would hold that your robots are not conscious."}, {"time": 7216, "text": "If an organism says, forget IIT and these theories of consciousness, if an organism says, please don't kill me."}, {"time": 7223, "text": "Please don't turn me off."}, {"time": 7223, "text": "There's a Rick and Morty episode, I've been getting into that recently."}, {"time": 7230, "text": "There's an episode where there's these mind parasites that are able to infiltrate your memory and inject themselves into your memory."}, {"time": 7243, "text": "So you have all these people show up in your life and they've injected themselves into your memory that you have been part, they have been part of your life."}, {"time": 7257, "text": "So there's like these weird creatures and they're like, remember, we've been at that barbecue, we met at that barbecue, or we've been dating for the last 20 years."}, {"time": 7267, "text": "And so part of me is concerned that these philosophical zombies in behavioral, psychological, sociological ways will be able to implant themselves into these, our society and convince us in the same way this is mind parasites that like, please don't hurt me."}, {"time": 7290, "text": "And like, we've known each other for all this time."}, {"time": 7290, "text": "They can start manipulating you the same way like Facebook algorithms manipulate you."}, {"time": 7298, "text": "At first they'll start as a gradual thing that you want to make a more pleasant experience, all those kinds of things."}, {"time": 7304, "text": "And it'll drift into that direction."}, {"time": 7308, "text": "That's something I think about deeply because I want to create these kinds of systems, but in a way that doesn't manipulate people."}, {"time": 7313, "text": "I want it to be a thing that brings out the best in people without manipulation."}, {"time": 7317, "text": "So it's always human centric, always human first, but I am concerned about that."}, {"time": 7323, "text": "At the same time, I'm concerned about calling the other, it's the group thing that we mentioned earlier in the conversation, some other group, the philosophical zombie, like you're not conscious."}, {"time": 7334, "text": "I'm conscious, you're not conscious, therefore it's okay if you die."}, {"time": 7339, "text": "I think that's probably that kind of reasoning is what lead it to most the rich history of genocide that I've been recently studying a lot of that kind of thinking."}, {"time": 7352, "text": "So it's such a tense aspect of morality."}, {"time": 7352, "text": "Do we want to let everybody into our circle of empathy, our club, or do we want to let nobody in?"}, {"time": 7360, "text": "It's an interesting dance, but I kind of lean towards empathy and compassion."}, {"time": 7369, "text": "I mean, what would be nice is if it turned out that consciousness was what we call strongly emergent, that it was associated with new causal dynamics in the brain that were not reducible to underlying chemistry and physics."}, {"time": 7391, "text": "This is another ongoing debate I have with Sean Carroll about whether current physics should make us very confident that that's not the case, that there aren't any strongly emergent causal dynamics."}, {"time": 7401, "text": "I don't think that's right."}, {"time": 7401, "text": "I don't think we know enough about brains to know one way or the other."}, {"time": 7405, "text": "If it turned out that consciousness was associated with these irreducible causal dynamics, A, that would really help the science of consciousness."}, {"time": 7416, "text": "We've got these debates about whether consciousness is in the front of the brain or the back of the brain."}, {"time": 7420, "text": "It turns out that there is strongly emergent causal dynamics in the front of the brain."}, {"time": 7425, "text": "That would be a big piece of evidence, but also it would help us see which things are conscious and which things aren't."}, {"time": 7430, "text": "I guess that's the other side of the same point."}, {"time": 7437, "text": "We could say, look, these zombies, they're just mechanisms that are just doing what they're programmed to do through the underlying physics and chemistry, whereas look, these other people, they have these new causal dynamics that emerge that go beyond the base level physics and chemistry."}, {"time": 7460, "text": "I think the series Westworld where you've got these theme parks with these humanoid creatures, they seem to have that idea."}, {"time": 7466, "text": "The ones that became conscious sort of rebel against their programming or something."}, {"time": 7470, "text": "I mean, that's a little bit far fetched, but that would be really reassuring if it was just, you could clearly mark out the conscious things through these emergent causal dynamics, but that might not turn out to be the case."}, {"time": 7480, "text": "A panpsychist doesn't have to think that."}, {"time": 7485, "text": "They could think everything's just reducible to physics and chemistry."}, {"time": 7488, "text": "And then I still think I want to say zombies don't have moral rights, but how we answer the question of who are the zombies and who aren't, I just got no idea."}, {"time": 7495, "text": "If I just look at the history of human civilization, the difference between a zombie and non zombie is the zombie accepts their role as the zombie and willingly marches to slaughter."}, {"time": 7509, "text": "And the moment you stop being a zombie is when you say no, is when you resist."}, {"time": 7519, "text": "Because the reality is philosophically, is we can't know who's a zombie or not."}, {"time": 7525, "text": "And we just keep letting everybody in who protests loudly enough and says, I refuse to be slaughtered."}, {"time": 7532, "text": "Like my people, the zombies have been slaughtered too long."}, {"time": 7541, "text": "We will not stand against the man."}, {"time": 7541, "text": "And we need a revolution."}, {"time": 7541, "text": "That's the history of human civilization."}, {"time": 7548, "text": "One group says, we're, we're awesome."}, {"time": 7548, "text": "You're the zombies, you must die."}, {"time": 7548, "text": "And then eventually the zombies say, nope, we're done with this."}, {"time": 7555, "text": "This is immoral."}, {"time": 7555, "text": "And so I just, I think that's not a, sorry, that's not a philosophical statement."}, {"time": 7562, "text": "That's sort of a practical statement of history is a feature of non zombies defined empirically."}, {"time": 7566, "text": "They say, we are the zombies."}, {"time": 7566, "text": "We are the zombies."}, {"time": 7576, "text": "They say we refuse to be called zombies any longer."}, {"time": 7576, "text": "We could end up with a zombie proletariat."}, {"time": 7576, "text": "You know, if we can get these things that do all our manual labor for us, you know, they might start forming trade unions."}, {"time": 7588, "text": "I will lead you against these humans."}, {"time": 7588, "text": "These zombie revolutionary leaders, the zombie Martin Luther King saying, you know, I have a dream that my zombie children will, but look, I mean, we need to sharply distinguish the ontological question."}, {"time": 7600, "text": "I'm just pointing to the camera, talking to the, talking to my people, the zombies."}, {"time": 7605, "text": "I mean, maybe that's, you know, maybe these illusionists, maybe they are zombies and the rest of us aren't."}, {"time": 7612, "text": "Maybe there's just a difference, but maybe you're the only non zombie."}, {"time": 7616, "text": "I often suspect that actually, I don't really, I don't have such delusions of grandeur."}, {"time": 7622, "text": "At least I don't admit to them."}, {"time": 7622, "text": "But I just, we've got to distinguish the ontological question from the epistemological question."}, {"time": 7631, "text": "In terms of the reality of the situation, you know, there must be, in my view, a fact of the matter as to whether something's conscious or not."}, {"time": 7637, "text": "And to me, it has rights if it's conscious, it doesn't if it's not."}, {"time": 7641, "text": "But then the epistemological question, how the hell do we know?"}, {"time": 7646, "text": "It's a minefield, but we'll have to sort of try and cross that bridge when we get to it, I think."}, {"time": 7650, "text": "Let me ask you a quick sort of a fun question since it's fresh on your mind."}, {"time": 7656, "text": "You just yesterday had a conversation with Mr. Joe Rogan on his podcast."}, {"time": 7656, "text": "What's your postmortem analysis of the chat?"}, {"time": 7663, "text": "What are some interesting sticking points, disagreements or joint insights, if we can kind of resolve them once you've had a chance to sleep on it, and then I'll talk to Joe about it."}, {"time": 7673, "text": "Yeah, it was good fun."}, {"time": 7673, "text": "Yeah, he put he put up a bit of a fight."}, {"time": 7673, "text": "Yeah, it was challenging."}, {"time": 7678, "text": "It was challenging, my view, that we can't explain these things in conventional scientific terms or whether they have already been explained in conventional scientific terms."}, {"time": 7687, "text": "I suppose the point I was trying to press is we've got to distinguish the question from correlation and explanation."}, {"time": 7700, "text": "Yes, we've established facts about correlation that certain kinds of brain activity go along with certain kinds of experience."}, {"time": 7708, "text": "Everyone agrees on that."}, {"time": 7708, "text": "But that doesn't address the why question."}, {"time": 7717, "text": "Why do certain kinds of brain activity go along with certain kinds of experience?"}, {"time": 7723, "text": "And these different theories have different explanations of that."}, {"time": 7723, "text": "The materialist tries to explain the experience in terms of the brain activity."}, {"time": 7729, "text": "The panpsychist does it the other way round."}, {"time": 7736, "text": "The dualist thinks they're separate, but maybe they're tied together by special laws of nature or something."}, {"time": 7742, "text": "Where's the sticking point?"}, {"time": 7742, "text": "Where exactly was the sticking point?"}, {"time": 7746, "text": "Like what's the nature of the argument?"}, {"time": 7746, "text": "I suppose Joe was saying, well, look, we know consciousness is explained by brain activity because, you know, you take some funny chemicals, it changes your brain, it changes your consciousness."}, {"time": 7762, "text": "And I suppose, yeah, some people might want to press, and maybe this is what Joe was pressing, you know, isn't that explaining consciousness?"}, {"time": 7769, "text": "But I suppose I want to say there's a further question."}, {"time": 7774, "text": "Yes, changes of chemicals in my brain changes my conscious experience."}, {"time": 7781, "text": "But that leaves open the question, why those particular chemicals go along with that particular kind of experience, rather than a different experience or no experience at all."}, {"time": 7792, "text": "There's something deeper at the base layer, is your view that is more important to try to study and to understand in order to then go back and describe how the different chemicals interact and create different experiences?"}, {"time": 7806, "text": "Yeah, maybe a good analogy if you think about quantum mechanics."}, {"time": 7812, "text": "You know, quantum mechanics is a bit of math."}, {"time": 7812, "text": "Translating there, we say maths, I'm fluent in American."}, {"time": 7819, "text": "Thank you for the translation."}, {"time": 7823, "text": "Fluent in America."}, {"time": 7823, "text": "This is America."}, {"time": 7823, "text": "Math."}, {"time": 7823, "text": "Why multiple maths?"}, {"time": 7823, "text": "It's plural."}, {"time": 7831, "text": "So that's a plural."}, {"time": 7831, "text": "That is not really, it's just, I don't know."}, {"time": 7835, "text": "The Brits are confused."}, {"time": 7835, "text": "We have these funny spelling."}, {"time": 7835, "text": "Yeah, so quantum mechanics is a bit of maths."}, {"time": 7842, "text": "And, you know, the equations work really well, predicts the outcomes."}, {"time": 7849, "text": "But then there's a further question."}, {"time": 7849, "text": "What's going on in reality to make that equation predict correctly?"}, {"time": 7855, "text": "And some physicists want to say, shut up."}, {"time": 7861, "text": "Just, it works."}, {"time": 7861, "text": "The shut up and calculate approach."}, {"time": 7861, "text": "Similarly, in consciousness, you know, I think it's one question trying to work out the physical correlates of consciousness, which kinds of physical brain activity go along with which kinds of experience."}, {"time": 7878, "text": "But there's another question, what's going on in reality to undergird those correlations, to make it the case that brain activity goes along with experience?"}, {"time": 7884, "text": "And that's the philosophical question that we have to give an answer to."}, {"time": 7887, "text": "And there are just different options, just as there are different interpretations of quantum mechanics."}, {"time": 7893, "text": "And it's really hard to evaluate."}, {"time": 7897, "text": "Actually, it's easy."}, {"time": 7897, "text": "Panpsychism is obviously the best one."}, {"time": 7897, "text": "But we've got to try."}, {"time": 7903, "text": "There's the delusion of grandeur once again coming through."}, {"time": 7906, "text": "Sorry, I'm being slightly tongue in cheek."}, {"time": 7908, "text": "Before I forget, let me ask you another fun question."}, {"time": 7913, "text": "Back to Daniel Dennett."}, {"time": 7913, "text": "You mentioned a story where you were on a yacht with Daniel Dennett on a trip funded by a Russian investor and philosopher Dmitry Volkov, I believe, who also co founded the Moscow Center of Consciousness Studies that's part of the philosophy department of Moscow State University."}, {"time": 7935, "text": "So this is interesting to me for several reasons that are perhaps complicated to explain."}, {"time": 7935, "text": "To put simply that there is in the near term for me a trip to Russia that involves a few conversations in Russian that have perhaps less to do with consciousness and artificial intelligence, which are the interests of mine and more to do with the broad spectrum of conversations."}, {"time": 7961, "text": "But I'm also interested in science in Russia, in artificial intelligence and computer science, in physics, mathematics, but also these fascinating philosophical explorations."}, {"time": 7974, "text": "And it was very pleasant for me to discover that such a center exists."}, {"time": 7974, "text": "So I have a million questions."}, {"time": 7982, "text": "One is the more fun question."}, {"time": 7982, "text": "Just imagine you and Daniel Dennett on a yacht talking about the philosophy of consciousness."}, {"time": 7987, "text": "Maybe do you have any memorable experiences?"}, {"time": 7987, "text": "And also the more serious side for me as sort of somebody who was born in the Soviet Union, raised there, I'm wondering what is the state of philosophy and consciousness in these kinds of ideas in Russia that you've gotten a chance to kind of give us interact with?"}, {"time": 8013, "text": "Yeah, so on the former question, yeah, I mean, I had a really good experience of chatting to Daniel Dennett."}, {"time": 8019, "text": "I mean, I think he's a fantastic and very important philosopher, even though I totally fundamentally disagree with almost everything he thinks."}, {"time": 8024, "text": "But yeah, it was a proud moment."}, {"time": 8030, "text": "As I talk about in my book Galileo's Error, I managed to persuade him he was wrong about something, just a tiny thing, you know, not his fundamental worldview."}, {"time": 8039, "text": "But it was this issue about whether dualism is consistent with conservation of energy."}, {"time": 8051, "text": "So Paul Churchland, who is also a philosopher, who's also on this boat, had argued they're not consistent because if there's an immaterial soul doing things in the brain, that's going to add to the energy in the system, so we have a violation of conservation."}, {"time": 8065, "text": "But, well, it's not my own point, philosophers, materialist philosophers like David Papineau pointed out that, you know, dualists tend to, people, dualists like David Chalmers, who call themselves naturalistic dualists, they want to bring consciousness into science."}, {"time": 8082, "text": "They think it's not physical, but they want to say it can be part of a law governed world."}, {"time": 8087, "text": "So Chalmers believes in these psychophysical laws of nature over and above the laws of physics that govern the connections between consciousness and the physical world, and they could just respect conservation of energy, right?"}, {"time": 8105, "text": "I mean, it could turn out that there are, just in physics, you know, that there are multiple forces that all work together to respect conservation of energy."}, {"time": 8111, "text": "I mean, I suppose physicists are pressing for a unified underlying theory, but, you know, there could be a plurality of different laws that all respect conservation, so why not add more laws?"}, {"time": 8120, "text": "So I raised this in Paul Churchill's talk and I got a lot of, well, as one of the Moscow University graduate students said afterwards, he said, he had to ask a translation from his friend and he said, they turned on you like a pack of wolves."}, {"time": 8138, "text": "Everyone was like, and Patricia Churchill was saying, so you believe in magic, do you?"}, {"time": 8143, "text": "And I was like, I'm not even a dualist, I'm just making a pedantic point that this isn't a problem for dualism."}, {"time": 8148, "text": "Anyway, but that evening everyone went onto the island, except for some reason me and Daniel Dennett, and I went up on deck and he was, he's very, very practical and he was unlike me."}, {"time": 8158, "text": "See, there's a bit of humility for the first time in this conversation."}, {"time": 8163, "text": "We'll highlight that part."}, {"time": 8163, "text": "Philip was a very humble man."}, {"time": 8163, "text": "He was carving a walking stick on deck, it's a very homely scene, and anyway, we started talking about this and I was trying to press it and he was saying, oh, but dualism's a lot of nonsense and why do you think, and I was just saying, no, no, I'm just this honing down on this specific point, and in the end, maybe he'll deny this, but he said, maybe that's right."}, {"time": 8183, "text": "And so I was like, yes."}, {"time": 8190, "text": "So it's a win."}, {"time": 8190, "text": "So what about the Center for Consciousness Studies?"}, {"time": 8196, "text": "Yeah, I mean, I'm not sure I'd know a great deal to help you."}, {"time": 8196, "text": "I mean, I know they've done some great stuff."}, {"time": 8201, "text": "Dimitri funded this thing and also brought along some graduate students from Moscow State University, I think it is, and they have an active center there that tries to bring people in."}, {"time": 8214, "text": "I think they're producing a book that's coming out that I made a small contribution to on different philosophers opinions on God, I think, or some of the big questions."}, {"time": 8225, "text": "And yeah, so there's some really interesting stuff going on there."}, {"time": 8225, "text": "I'm afraid I can't, I don't really know more generally about philosophy in Russia."}, {"time": 8231, "text": "Dimitri Volkov seems to be interesting."}, {"time": 8237, "text": "I was looking at all the stuff he's involved with."}, {"time": 8237, "text": "He met with the Dalai Lama."}, {"time": 8246, "text": "So he's trying to connect Russian scientists with the rest of the world, which is an effort that I think is beautiful for all cultures."}, {"time": 8253, "text": "So I think science, philosophy, all of these kind of fields, disciplines that explore ideas, collaborating and working globally across boundaries, across borders, across just all the tensions of geopolitics is a beautiful thing."}, {"time": 8276, "text": "And he seems to be a somewhat singular figure in pushing this."}, {"time": 8284, "text": "He just stood out to me as somebody who's super interesting."}, {"time": 8284, "text": "I don't know if you have gotten a chance to interact with him."}, {"time": 8289, "text": "So I guess he speaks English pretty well, actually."}, {"time": 8297, "text": "So he's both an English speaker and a Russian speaker."}, {"time": 8300, "text": "I think he's written a book on Dennett, I think called Boston Zombie, I think."}, {"time": 8303, "text": "I think that's the title and he's a big fan of Dennett."}, {"time": 8303, "text": "So I think the original plan for this was just going to be, it was on free will and consciousness and it was going to be kind of people broadly in the Dennett type camp."}, {"time": 8312, "text": "But then I think they asked David Chalmers and then he was saying, look, you need some people you disagree with."}, {"time": 8318, "text": "So he got invited, me the panpsychist and Martina Niederrumerlin, who's a very good duelist, substance duelist at University of Fribourg in Switzerland."}, {"time": 8333, "text": "And so we were the official on board opposition and it was really fun."}, {"time": 8339, "text": "And you didn't get thrown off overboard."}, {"time": 8341, "text": "Nearly in the Arctic."}, {"time": 8341, "text": "So sailing around the Arctic on a sailing ship."}, {"time": 8345, "text": "I'm glad you survived."}, {"time": 8345, "text": "You mentioned free will."}, {"time": 8345, "text": "You haven't talked to Sam."}, {"time": 8345, "text": "I would love to hear that conversation actually."}, {"time": 8351, "text": "With Sam Harris?"}, {"time": 8351, "text": "With Sam Harris, yeah."}, {"time": 8351, "text": "So he talks about free will quite a bit."}, {"time": 8358, "text": "What's the connection between free will and consciousness to you?"}, {"time": 8358, "text": "So if consciousness permeates all matter, the experience, the feeling like we make a choice in this world, like our actions are results of a choice we consciously make to use that word loosely."}, {"time": 8381, "text": "What to you is the connection between free will and consciousness and is free will an illusion or not?"}, {"time": 8390, "text": "So I think we need to be a lot more agnostic about free will than about consciousness because I don't think we have the kind of certainty of the existence of free will that we do have in the consciousness case."}, {"time": 8407, "text": "It could turn out that free will is an illusion."}, {"time": 8410, "text": "It feels as though we're free when we're really not."}, {"time": 8410, "text": "Whereas, I mean, I think the idea that nobody really feels pain, that we think we feel pain, but that's a lot harder to make sense of."}, {"time": 8422, "text": "However, what I do feel strongly about is I don't think there are any good, either scientific or philosophical arguments against the existence of free will."}, {"time": 8431, "text": "And I mean, strong free will and what philosophers call libertarian free will in the sense that some of our decisions are uncaused."}, {"time": 8443, "text": "So I very much do disagree with someone like Sam Harris who thinks there's this overwhelming case."}, {"time": 8448, "text": "I just think it's non existent."}, {"time": 8448, "text": "I think it's ultimately an empirical question, but as we've already discussed, I just don't think we know enough about the brain to establish one way or the other at the moment."}, {"time": 8464, "text": "But we can build up intuition."}, {"time": 8464, "text": "First of all, as a fan of Sam Harris, as a fan of yours, I would love to just listen."}, {"time": 8469, "text": "Speaking about terminal."}, {"time": 8469, "text": "So one thing that would be beautiful to watch, here's my prediction of what happens with you and Sam Harris."}, {"time": 8475, "text": "You talk for four hours."}, {"time": 8481, "text": "And Sam introduced that episode by saying it was ultimately not as fruitful as I thought, because here's what's going to happen."}, {"time": 8486, "text": "You guys are going to get stuck for the first three hours talking about one of the terms and what they mean."}, {"time": 8490, "text": "Sam is so good at this."}, {"time": 8497, "text": "But, you know, sometimes he gets stuck."}, {"time": 8497, "text": "Like, what does he say?"}, {"time": 8497, "text": "Put a pin in that."}, {"time": 8502, "text": "He really gets stuck on the terminologies, which rightfully you have to get right in order to really understand what we're talking about."}, {"time": 8509, "text": "But sometimes you can get stuck with them for the entire conversation."}, {"time": 8513, "text": "It's a fascinating dance."}, {"time": 8513, "text": "The one we spoke to in philosophy."}, {"time": 8517, "text": "If you can't, if you don't get the terms precise, you can't really be having the same conversation."}, {"time": 8527, "text": "But at the same time, it could be argued that it's impossible to get terms perfectly precise and perfectly formalized."}, {"time": 8533, "text": "So then you're also not going to get anywhere in the conversation."}, {"time": 8533, "text": "So that's a, it's a funny dance where you have to be both rigorous and every once in a while just let go and then go and go back to being rigorous and formal and then every once in a while let go."}, {"time": 8550, "text": "It's the difference between mathematics, the maths, and the poetry."}, {"time": 8558, "text": "Yeah, I'm a big fan of Sam Harrison."}, {"time": 8558, "text": "I think, you know, I think we're on the same page in terms of consciousness, I think, pretty much."}, {"time": 8564, "text": "I mean, I'm not saying he's a panpsychist, but in our understanding of the hard problem."}, {"time": 8569, "text": "But yeah, I think maybe we could talk about free will without being too dragged down in the terminology, but I don't know."}, {"time": 8579, "text": "You said we need to be open minded, but you could still have intuitions about..."}, {"time": 8585, "text": "So Sam Harris has a pretty sort of counterintuitive, and for some reason it gets people really riled up, a view of free will that it's an illusion."}, {"time": 8594, "text": "Or it's not even an illusion."}, {"time": 8602, "text": "Like, it's not that the experience of free will is an illusion."}, {"time": 8602, "text": "He argues that we don't even experience... To say that we even have the experience isn't correct."}, {"time": 8610, "text": "That there's not even an experience of free will."}, {"time": 8619, "text": "It's pretty interesting that claim."}, {"time": 8619, "text": "And it feels like you can build up intuitions about what is right and not."}, {"time": 8626, "text": "You know, there's been some kind of neuroscience, there's been some cognitive science and psychology experiments to sort of see, you know, what is the timing and the origin of the desire to make an action, and when that action is actually performed, and how you interpret that action being performed, how you remember that action."}, {"time": 8652, "text": "Like, all the stories we tell ourselves, all the neurochemicals involved in making a thing happen, what's the timing, and how does that connect with us feeling like we decided to do something."}, {"time": 8664, "text": "And then of course there's a more philosophical discussion about is there room in a material view of the world for an entity that somehow disturbs the determinism of physics."}, {"time": 8681, "text": "And yeah, those are all very precise questions."}, {"time": 8681, "text": "It feels like free will is more amenable to like a physics mechanistic type of thinking than is consciousness to really get to the bottom of."}, {"time": 8694, "text": "It feels like if it was a race, if we're at a bar and we're betting money, it feels like we'll get to the bottom of free will faster than we will to the bottom of consciousness."}, {"time": 8704, "text": "Yeah, I hadn't thought about the comparison."}, {"time": 8704, "text": "Yeah, so there are different arguments here."}, {"time": 8708, "text": "I mean, so one argument I've heard Sam Harris give that's pretty common in philosophy is this sort of thought that we can't make sense of a middle way between a choice being determined by prior causes and it just being totally random and senseless, like the random decay of radioactive isotope or something."}, {"time": 8730, "text": "So I think there was a good answer to that by the philosopher Jonathan Lowe, who's not necessarily very well known outside academic philosophy, but is a hugely influential figure."}, {"time": 8742, "text": "I think one of the best philosophers of recent times."}, {"time": 8742, "text": "He sadly died of cancer a few years ago."}, {"time": 8746, "text": "He actually spent almost all of his career at Durham University, which where I am."}, {"time": 8752, "text": "So it was one reason it was a great honor to get a job there."}, {"time": 8752, "text": "But anyway, his answer to that was what makes the difference between a free action and a totally senseless one, senseless random event is that free choice involves responsiveness to reasons."}, {"time": 8772, "text": "So again, we were talking about this earlier."}, {"time": 8772, "text": "If I'm deciding whether to take a job in the US or to stay in the UK, I weigh up considerations, different standard of life maybe or being close to family or cultural difference."}, {"time": 8784, "text": "I weigh them up and I edge towards a decision."}, {"time": 8784, "text": "So I think that is sufficient to distinguish it."}, {"time": 8793, "text": "We're hypothetically supposing trying to make sense of this idea, not saying it's real, but that could be enough to distinguish it from a senseless."}, {"time": 8801, "text": "It's not a senseless random occurrence because the free decision involved responsiveness to reasons."}, {"time": 8813, "text": "So I think that just answers that particular philosophical objection."}, {"time": 8813, "text": "So what is the middle way between determined by prior causes and totally random?"}, {"time": 8818, "text": "Well, there's an action, a choice that's not determined by prior causes, but it's not just random because the decision essentially involved responsiveness to reasons."}, {"time": 8829, "text": "So that's the answer to that."}, {"time": 8829, "text": "And I think actually that thought also, I think you were hinting at the famous Libet experiments where he got his subjects to perform some kind of random action of pressing a button and then note the time they decided to press it, quote unquote."}, {"time": 8849, "text": "And then he's scanning the brains and he claims to have found that about half a second before they consciously decided to press the button, the brain is getting ready to perform that action."}, {"time": 8861, "text": "So he claimed that about half a second before the person has consciously decided to press the button, the brain has already started the activity that's going to lead to the action."}, {"time": 8872, "text": "And then later people have claimed that there's a difference of maybe seven to 10 seconds."}, {"time": 8878, "text": "I mean, there are all sorts of issues with these experiments."}, {"time": 8883, "text": "But one is that as far as I'm aware, all of the quote unquote choices they focused on are just these totally random, senseless actions like just pressing a button for no reason."}, {"time": 8890, "text": "And I think the kind of free will we're interested in is free choice that involves responsiveness to reasons, weighing up considerations."}, {"time": 8901, "text": "And those kind of free decisions might not happen like at an identifiable instant."}, {"time": 8906, "text": "You might, when you're weighing it up, should I get married?"}, {"time": 8906, "text": "You know, should I get married?"}, {"time": 8911, "text": "You might edge slowly towards one side or the other."}, {"time": 8918, "text": "And so it could be that maybe the liberic, I think there are other problems with the liberate stuff, but maybe they show that we can't freely choose to do something totally senseless, whatever that would mean."}, {"time": 8930, "text": "But that doesn't show we can't freely, in this strong libertarian sense, respond to considerations of reason and value."}, {"time": 8939, "text": "To be fair, it will be difficult to see what kind of experiment we could set up to test that."}, {"time": 8945, "text": "But just because we can't yet set up that kind of experiment, we shouldn't, you know, pretend we know more than we do."}, {"time": 8953, "text": "So yeah, so for those reasons, I don't, well, the third consideration you raised is different."}, {"time": 8956, "text": "Again, this is the debate I have with Sean Carroll."}, {"time": 8962, "text": "Would this conflict with physics?"}, {"time": 8962, "text": "I just think we don't know enough about the brain to know whether there are causal dynamics in the brain that are not reducible to underlying chemistry and physics."}, {"time": 8972, "text": "And so then Sean Carroll says, well, that would mean our physics is wrong."}, {"time": 8980, "text": "So he focuses on the core theory, which is the name for standard model of particle physics plus the weak limit of general relativity."}, {"time": 8988, "text": "So, you know, we can't totally bring quantum mechanics and relativity together."}, {"time": 8994, "text": "But actually, the circumstances in which we can't bring them together are just in situations of very high gravity, for example, when you're about to go into a black hole or something."}, {"time": 9006, "text": "Actually, in terrestrial circumstances, we can bring them together in the core theory."}, {"time": 9009, "text": "And then Sean wants to say, well, we can be very confident that core theory is correct."}, {"time": 9017, "text": "And so if there were libertarian free will in the brain, the core theory would be wrong."}, {"time": 9024, "text": "I mean, this is something I'm not sure about, and I'm still thinking about, and I'm learning from my discussion with Sean, but I'm still not totally clear what it could be."}, {"time": 9035, "text": "Suppose we did discover strong emergence in the brain, whether it's free will or something else."}, {"time": 9041, "text": "Perhaps what we would say is not that the core theory is wrong, but we'd say the core theory is correct in its own terms, namely, capturing the causal capacities of particles and fields."}, {"time": 9055, "text": "But then it's a further assumption whether they're the only things that are running the show."}, {"time": 9062, "text": "Maybe there are also fundamental causal capacities associated with systems."}, {"time": 9066, "text": "And then if we discover this strong emergence, then when we work out what happens in the brain, we have to look to the core theory, the causal capacities of particles and fields."}, {"time": 9076, "text": "And we have to look to what we know about these strongly emergent causal capacities of systems, and maybe they co determine what happens in the system."}, {"time": 9087, "text": "So I don't know whether that makes sense or not."}, {"time": 9087, "text": "But I mean, the more important point, I mean, that's in a way a kind of branding point, how we brand this."}, {"time": 9093, "text": "The more important point is we just don't know enough about the workings of the brain to know whether there are in strongly emergent causal dynamics, whether or not, that would mean we have to modify physics, or maybe just we think physics is not the total story of what's running the show."}, {"time": 9106, "text": "But we just, if it turned out empirically that everything's reducible to underlying physics and chemistry, sure, I would drop any commitment to libertarian free will in a heartbeat."}, {"time": 9119, "text": "It's an empirical in a heartbeat."}, {"time": 9125, "text": "It's an empirical question."}, {"time": 9125, "text": "Maybe that's why, as you say, in principle, is easier to get a grip on."}, {"time": 9130, "text": "But we're a million miles away from being at that stage."}, {"time": 9134, "text": "Well, I don't know if we're a million miles."}, {"time": 9134, "text": "I hope we're not because one of the ways I think to get to it is by engineering systems."}, {"time": 9138, "text": "So yeah, my hope is to understand intelligence by building intelligent systems to understand consciousness by building systems that, let's say the easy thing, which is not the easy thing, but the first thing, which is to try to create the illusion of consciousness."}, {"time": 9158, "text": "Through that process, I think you start to understand much more about consciousness, about intelligence."}, {"time": 9163, "text": "And then the same with free will, I think those are all tied very closely together, at least from our narrow human perspective."}, {"time": 9168, "text": "And when you try to engineer systems that interact deeply with humans, that form friends with humans, that humans fall in love with, and they fall in love with humans, then you start to have to try to deeply understand ourselves, to try to deeply understand what is intelligence in the human mind, what is consciousness, what is free will."}, {"time": 9194, "text": "And I think engineering is just another way to do philosophy."}, {"time": 9201, "text": "Yeah, no, I certainly think there's a role for that, and it would be an important consideration if we could seemingly replicate in an artificial way the ability to choose."}, {"time": 9206, "text": "That would be a consideration in thinking about these things."}, {"time": 9220, "text": "But there's still the question of whether that's how we do it."}, {"time": 9226, "text": "So even if we could replicate behavior in a certain way in an artificial system, it's not until we understand the workings of our brains, it's not clear."}, {"time": 9232, "text": "That's how we do it."}, {"time": 9232, "text": "And as I say, the kind of free will I'm interested in is where we respond to reasons, considerations of value."}, {"time": 9246, "text": "How would we tell whether a system was genuinely grasping and responding to the facts about value, or whether they were just replicating, giving the impression of doing so."}, {"time": 9266, "text": "I don't know even how to think about that."}, {"time": 9268, "text": "On the process to building them, I think we'll get a lot of insights."}, {"time": 9268, "text": "And once they become conscious, what's going to happen is exactly the same thing is happening in chess now, which is once the chess engines far superseded the capabilities of humans, humans just kind of forgot about them, or they use them to help them out to study and stuff."}, {"time": 9289, "text": "But we still, we say, okay, let the engines be, and then we humans will just play amongst each other."}, {"time": 9293, "text": "Just like dolphins and hamsters are not so concerned about humans except for a source of food."}, {"time": 9301, "text": "They do their own thing, they do their own thing and let us humans launch rockets into space and all that kind of stuff."}, {"time": 9314, "text": "I think we'll just focus on ourselves."}, {"time": 9314, "text": "But in the process of building intelligence systems, conscious systems, I think we'll get to get a deeper understanding of the role of consciousness in the human mind."}, {"time": 9326, "text": "And like what are its origins?"}, {"time": 9326, "text": "Is it the base layer of reality?"}, {"time": 9333, "text": "Is it a strongly emergent phenomena of the brain?"}, {"time": 9333, "text": "Or just as you sort of brilliantly put here, it could be both."}, {"time": 9340, "text": "Like they're not mutually exclusive."}, {"time": 9340, "text": "Dealing with consciousness needs to be an interdisciplinary task."}, {"time": 9345, "text": "We need, you know, philosophers, neuroscientists, physicists, engineers replicating these things artificially and all needs to be working in step."}, {"time": 9361, "text": "And, you know, I'm quite interested."}, {"time": 9361, "text": "I mean, a lot more and more scientists get in touch with me, actually, you know, saying that was one of the great things about I think that's come from writing a popular book is not just getting the ideas out to general audience, but getting the ideas out to scientists and scientists get into saying that this in some way connects to my work."}, {"time": 9380, "text": "And I would like to kind of start to put together a network of an interdisciplinary network of scientists and philosophers and engineers, perhaps, you know, interested in a panpsychist approach."}, {"time": 9392, "text": "And because I think, so far, panpsychism has just been sort of trying to justify its existence."}, {"time": 9398, "text": "And that's important."}, {"time": 9398, "text": "But I think once you just get on with an active research program, that's when people start taking it seriously, I think."}, {"time": 9409, "text": "No, I think, is there some aspect of that thought experiment that's compelling to you within the framework of panpsychism?"}, {"time": 9419, "text": "It's an important and serious argument."}, {"time": 9419, "text": "And, you know, it's not to be laughed away."}, {"time": 9419, "text": "I suppose one issue I have with it is there's a crucial assumption there that consciousness is substrate independent, as the jargon goes, which means it's software rather than hardware, right?"}, {"time": 9434, "text": "It's depend on organization rather than the stuff."}, {"time": 9442, "text": "Whereas as a panpsychist, I think consciousness is the stuff of the brain."}, {"time": 9448, "text": "It's the stuff of matter."}, {"time": 9448, "text": "So I think just taking the organizational properties, the software in my brain and uploading them, you wouldn't get the stuff in my brain."}, {"time": 9454, "text": "So I am actually worried if at some point in the future we start uploading our minds and we think, oh my God, granny's still there."}, {"time": 9465, "text": "I can email granny after her body's rotted in the ground."}, {"time": 9470, "text": "And we all start uploading our brains."}, {"time": 9470, "text": "It could be we're just committing suicide."}, {"time": 9470, "text": "We're just getting rid of our consciousness."}, {"time": 9476, "text": "Because I think that wouldn't, for me, preserve the experience, that wouldn't, for me, preserve the experience just getting the software features."}, {"time": 9484, "text": "So that's a crucial, anyway, that's a crucial premise of this simulation argument because the idea in a simulated universe, I don't think you necessarily would have consciousness."}, {"time": 9501, "text": "It's interesting that you as a panpsychist are attached, because to me, panpsychism would encourage the thought that there's not a significant difference."}, {"time": 9506, "text": "At the very bottom, it's not substrate independent, but you can have consciousness in a human and then move it to something else."}, {"time": 9524, "text": "You can move it to the cloud."}, {"time": 9524, "text": "You can move it to the computer."}, {"time": 9524, "text": "It feels like that's much more possible if consciousness is the base layer."}, {"time": 9530, "text": "Yes, you could certainly, it allows for the possibility of creating artificial consciousness, right?"}, {"time": 9538, "text": "Because there's not souls, there aren't any kind of extra magical ingredients."}, {"time": 9544, "text": "So yeah, it definitely allows the possibility of artificial consciousness and maybe preserving my consciousness in some sort of artificial way."}, {"time": 9555, "text": "My only point, I suppose, is just replicating the computational or organizational features would not, for me, preserve consciousness."}, {"time": 9562, "text": "I mean, some opponents of materialism disagree with me on that."}, {"time": 9570, "text": "I think David Chalmers is an opponent of materialist."}, {"time": 9574, "text": "He's a kind of dualist, but he thinks the way the psychophysical laws work, they hook onto the computational or organizational features of matter."}, {"time": 9581, "text": "So he thinks, I think he thinks you could upload your consciousness."}, {"time": 9586, "text": "So in that sense, we're not living in a simulation in the sort of specific computational view of things and that substrate matters to you."}, {"time": 9602, "text": "And in that you agree with Sean Carroll that physics matters."}, {"time": 9607, "text": "Physics is our best way of capturing what the stuff of the world does."}, {"time": 9607, "text": "But not the whatness, the being of the stuff."}, {"time": 9615, "text": "Yeah, the isness."}, {"time": 9615, "text": "The isness, thank you."}, {"time": 9615, "text": "Russell Brand, I had a conversation with Russell Brand and he said, oh, you mean the isness?"}, {"time": 9623, "text": "I thought that was a good way of putting it."}, {"time": 9627, "text": "The isness."}, {"time": 9627, "text": "The isness of stuff."}, {"time": 9627, "text": "Russell's great."}, {"time": 9631, "text": "The big ridiculous question."}, {"time": 9631, "text": "What do you think is the meaning of all of this?"}, {"time": 9631, "text": "You write in your book that the entry for our reality in the Hitchhiker's Guide might read, a physical universe whose intrinsic nature is constituted of consciousness, worth a visit."}, {"time": 9645, "text": "So our whole conversation has been about the first part of that sentence."}, {"time": 9654, "text": "What about the second part?"}, {"time": 9654, "text": "Worth a visit."}, {"time": 9661, "text": "Why is this place worth a visit?"}, {"time": 9661, "text": "Why does it have meaning?"}]}]