[{"title": "Yoshua Bengio: Deep Learning | Lex Fridman Podcast #4", "id": "azOmzumh0vQ", "quotes": [{"time": 477, "text": "Yeah, I've heard you mention in several contexts, the idea of sort of the way children learn, they interact with objects in the world."}, {"time": 484, "text": "And it seems fascinating because in some sense, except with some cases in reinforcement learning, that idea is not part of the learning process in artificial neural networks."}, {"time": 495, "text": "So it's almost like, do you envision something like an objective function saying, you know what, if you poke this object in this kind of way, it would be really helpful for me to further learn."}, {"time": 517, "text": "Sort of almost guiding some aspect of the learning."}, {"time": 520, "text": "Right, right, right."}, {"time": 520, "text": "So I was talking to Rebecca Sacks just a few minutes ago, and she was talking about lots and lots of evidence from infants seem to clearly pick what interests them in a directed way."}, {"time": 532, "text": "And so they're not passive learners, they focus their attention on aspects of the world, which are most interesting, surprising in a non trivial way."}, {"time": 550, "text": "That makes them change their theories of the world."}, {"time": 556, "text": "So that's a fascinating view of the future progress."}, {"time": 556, "text": "But on a more maybe boring question, do you think going deeper and larger, so do you think just increasing the size of the things that have been increasing a lot in the past few years, is going to be a big thing?"}, {"time": 578, "text": "I think increasing the size of the things that have been increasing a lot in the past few years will also make significant progress."}, {"time": 584, "text": "So some of the representational issues that you mentioned, they're kind of shallow, in some sense."}, {"time": 594, "text": "Oh, shallow in the sense of abstraction."}, {"time": 598, "text": "In the sense of abstraction, they're not getting some..."}, {"time": 600, "text": "I don't think that having more depth in the network in the sense of instead of 100 layers, you're going to have more layers."}, {"time": 606, "text": "I don't think so."}, {"time": 606, "text": "Is that obvious to you?"}, {"time": 611, "text": "What is clear to me is that engineers and companies and labs and grad students will continue to tune architectures and explore all kinds of tweaks to make the current state of the art slightly ever slightly better."}, {"time": 625, "text": "But I don't think that's going to be nearly enough."}, {"time": 625, "text": "I think we need changes in the way that we're considering learning to achieve the goal that these learners actually understand in a deep way the environment in which they are, you know, observing and acting."}, {"time": 646, "text": "But I guess I was trying to ask a question that's more interesting than just more layers."}, {"time": 653, "text": "It's basically, once you figure out a way to learn through interacting, how many parameters it takes to store that information."}, {"time": 660, "text": "So I think our brain is quite bigger than most neural networks."}, {"time": 667, "text": "Oh, I see what you mean."}, {"time": 667, "text": "Oh, I'm with you there."}, {"time": 667, "text": "So I agree that in order to build neural nets with the kind of broad knowledge of the world that typical adult humans have, probably the kind of computing power we have now is going to be insufficient."}, {"time": 685, "text": "So the good news is there are hardware companies building neural net chips."}, {"time": 685, "text": "And so it's going to get better."}, {"time": 690, "text": "However, the good news in a way, which is also a bad news, is that even our state of the art, deep learning methods fail to learn models that understand even very simple environments, like some grid worlds that we have built."}, {"time": 712, "text": "Even these fairly simple environments, I mean, of course, if you train them with enough examples, eventually they get it."}, {"time": 716, "text": "But it's just like, instead of what humans might need just dozens of examples, these things will need millions for very, very, very simple tasks."}, {"time": 730, "text": "And so I think there's an opportunity for academics who don't have the kind of computing power that, say, Google has to do really important and exciting research to advance the state of the art in training frameworks, learning models, agent learning in even simple environments that are synthetic, that seem trivial, but yet current machine learning fails on."}, {"time": 758, "text": "We talked about priors and common sense knowledge."}, {"time": 758, "text": "It seems like we humans take a lot of knowledge for granted."}, {"time": 763, "text": "So what's your view of these priors of forming this broad view of the world, this accumulation of information and how we can teach neural networks or learning systems to pick that knowledge up?"}, {"time": 778, "text": "So knowledge, for a while, the artificial intelligence was maybe in the 80s, like there's a time where knowledge representation, knowledge, acquisition, expert systems, I mean, the symbolic AI was a view, was an interesting problem set to solve and it was kind of put on hold a little bit, it seems like."}, {"time": 802, "text": "Because it doesn't work."}, {"time": 807, "text": "It doesn't work."}, {"time": 807, "text": "But that's right."}, {"time": 807, "text": "But the goals of that remain important."}, {"time": 814, "text": "Remain important."}, {"time": 814, "text": "And how do you think those goals can be addressed?"}, {"time": 819, "text": "So first of all, I believe that one reason why the classical expert systems approach failed is because a lot of the knowledge we have, so you talked about common sense intuition, there's a lot of knowledge like this, which is not consciously accessible."}, {"time": 841, "text": "There are lots of decisions we're taking that we can't really explain, even if sometimes we make up a story."}, {"time": 845, "text": "And that knowledge is also necessary for machines to take good decisions."}, {"time": 845, "text": "And that knowledge is hard to codify in expert systems, rule based systems and classical AI formalism."}, {"time": 862, "text": "And there are other issues, of course, with the old AI, like not really good ways of handling uncertainty, I would say something more subtle, which we understand better now, but I think still isn't enough in the minds of people."}, {"time": 877, "text": "There's something really powerful that comes from distributed representations, the thing that really makes neural nets work so well."}, {"time": 889, "text": "And it's hard to replicate that kind of power in a symbolic world."}, {"time": 889, "text": "The knowledge in expert systems and so on is nicely decomposed into like a bunch of rules."}, {"time": 898, "text": "Whereas if you think about a neural net, it's the opposite."}, {"time": 904, "text": "You have this big blob of parameters which work intensely together to represent everything the network knows."}, {"time": 910, "text": "And it's not sufficiently factorized."}, {"time": 910, "text": "It's not sufficiently factorized."}, {"time": 916, "text": "And so I think this is one of the weaknesses of current neural nets, that we have to take lessons from classical AI in order to bring in another kind of compositionality, which is common in language, for example, and in these rules, but that isn't so native to neural nets."}, {"time": 938, "text": "And on that line of thinking, disentangled representations."}, {"time": 938, "text": "So let me connect with disentangled representations, if you might, if you don't mind."}, {"time": 948, "text": "So for many years, I've thought, and I still believe that it's really important that we come up with learning algorithms, either unsupervised or supervised, but reinforcement, whatever, that build representations in which the important factors, hopefully causal factors are nicely separated and easy to pick up from the representation."}, {"time": 973, "text": "So that's the idea of disentangled representations."}, {"time": 973, "text": "It says transform the data into a space where everything becomes easy."}, {"time": 978, "text": "We can maybe just learn with linear models about the things we care about."}, {"time": 985, "text": "And I still think this is important, but I think this is missing out on a very important ingredient, which classical AI systems can remind us of."}, {"time": 998, "text": "So let's say we have these disentangled representations."}, {"time": 998, "text": "You still need to learn about the relationships between the variables, those high level semantic variables."}, {"time": 1003, "text": "They're not going to be independent."}, {"time": 1007, "text": "I mean, this is like too much of an assumption."}, {"time": 1007, "text": "They're going to have some interesting relationships that allow to predict things in the future, to explain what happened in the past."}, {"time": 1016, "text": "The kind of knowledge about those relationships in a classical AI system is encoded in the rules."}, {"time": 1021, "text": "Like a rule is just like a little piece of knowledge that says, oh, I have these two, three, four variables that are linked in this interesting way, then I can say something about one or two of them given a couple of others, right?"}, {"time": 1034, "text": "In addition to disentangling the elements of the representation, which are like the variables in a rule based system, you also need to disentangle the mechanisms that relate those variables to each other."}, {"time": 1051, "text": "So like the rules."}, {"time": 1051, "text": "So the rules are neatly separated."}, {"time": 1051, "text": "Like each rule is, you know, living on its own."}, {"time": 1057, "text": "And when I change a rule because I'm learning, it doesn't need to break other rules."}, {"time": 1063, "text": "Whereas current neural nets, for example, are very sensitive to what's called catastrophic forgetting, where after I've learned some things and then I learn new things, they can destroy the old things that I had learned, right?"}, {"time": 1074, "text": "If the knowledge was better factorized and separated, disentangled, then you would avoid a lot of that."}, {"time": 1086, "text": "Now, you can't do this in the sensory domain."}, {"time": 1090, "text": "What do you mean by sensory domain?"}, {"time": 1093, "text": "Like in pixel space."}, {"time": 1093, "text": "But my idea is that when you project the data in the right semantic space, it becomes possible to now represent this extra knowledge beyond the transformation from inputs to representations, which is how representations act on each other and predict the future and so on in a way that can be neatly disentangled."}, {"time": 1111, "text": "So now it's the rules that are disentangled from each other and not just the variables that are disentangled from each other."}, {"time": 1120, "text": "And you draw a distinction between semantic space and pixel, like does there need to be an architectural difference?"}, {"time": 1126, "text": "So there's the sensory space like pixels, which where everything is entangled."}, {"time": 1132, "text": "The information, like the variables are completely interdependent in very complicated ways."}, {"time": 1138, "text": "And also computation, like it's not just the variables, it's also how they are related to each other is all intertwined."}, {"time": 1143, "text": "But I'm hypothesizing that in the right high level representation space, both the variables and how they relate to each other can be disentangled."}, {"time": 1156, "text": "And that will provide a lot of generalization power."}, {"time": 1160, "text": "Generalization power."}, {"time": 1162, "text": "Distribution of the test set is assumed to be the same as the distribution of the training set."}, {"time": 1169, "text": "This is where current machine learning is too weak."}, {"time": 1169, "text": "It doesn't tell us anything, is not able to tell us anything about how our neural nets, say, are going to generalize to a new distribution."}, {"time": 1180, "text": "And, you know, people may think, well, but there's nothing we can say if we don't know what the new distribution will be."}, {"time": 1185, "text": "The truth is humans are able to generalize to new distributions."}, {"time": 1192, "text": "How are we able to do that?"}, {"time": 1194, "text": "Because there is something, these new distributions, even though they could look very different from the training distributions, they have things in common."}, {"time": 1197, "text": "So let me give you a concrete example."}, {"time": 1202, "text": "You read a science fiction novel."}, {"time": 1202, "text": "The science fiction novel, maybe, you know, brings you in some other planet where things look very different on the surface, but it's still the same laws of physics."}, {"time": 1215, "text": "And so you can read the book and you understand what's going on."}, {"time": 1220, "text": "So the distribution is very different."}, {"time": 1220, "text": "But because you can transport a lot of the knowledge you had from Earth about the underlying cause and effect relationships and physical mechanisms and all that, and maybe even social interactions, you can now make sense of what is going on on this planet where, like, visually, for example, things are totally different."}, {"time": 1245, "text": "Taking that analogy further and distorting it, let's enter a science fiction world of, say, Space Odyssey, 2001, with Hal."}, {"time": 1250, "text": "Or maybe, which is probably one of my favorite AI movies."}, {"time": 1260, "text": "And then there's another one that a lot of people love that may be a little bit outside of the AI community is Ex Machina."}, {"time": 1265, "text": "I don't know if you've seen it."}, {"time": 1271, "text": "By the way, what are your views on that movie?"}, {"time": 1271, "text": "Are you able to enjoy it?"}, {"time": 1276, "text": "Are there things I like and things I hate?"}, {"time": 1281, "text": "So you could talk about that in the context of a question I want to ask, which is, there's quite a large community of people from different backgrounds, often outside of AI, who are concerned about existential threat of artificial intelligence."}, {"time": 1292, "text": "You've seen this community develop over time."}, {"time": 1297, "text": "You've seen you have a perspective."}, {"time": 1297, "text": "So what do you think is the best way to talk about AI safety, to think about it, to have discourse about it within AI community and outside and grounded in the fact that Ex Machina is one of the main sources of information for the general public about AI?"}, {"time": 1316, "text": "So I think you're putting it right."}, {"time": 1316, "text": "There's a big difference between the sort of discussion we ought to have within the AI community and the sort of discussion that really matter in the general public."}, {"time": 1327, "text": "So I think the picture of Terminator and AI loose and killing people and super intelligence that's going to destroy us, whatever we try, isn't really so useful for the public discussion."}, {"time": 1378, "text": "Just to clarify, when you said killer robots, you mean autonomous weapon, weapon systems."}, {"time": 1384, "text": "Yes, I don't mean that's right."}, {"time": 1386, "text": "So I think these short and medium term concerns should be important parts of the public debate."}, {"time": 1393, "text": "Now, existential risk, for me is a very unlikely consideration, but still worth academic investigation in the same way that you could say, should we study what could happen if meteorite, you know, came to earth and destroyed it."}, {"time": 1410, "text": "So I think it's very unlikely that this is going to happen in or happen in a reasonable future."}, {"time": 1413, "text": "The sort of scenario of an AI getting loose goes against my understanding of at least current machine learning and current neural nets and so on."}, {"time": 1426, "text": "It's not plausible to me."}, {"time": 1426, "text": "But of course, I don't have a crystal ball and who knows what AI will be in 50 years from now."}, {"time": 1431, "text": "So I think it is worth that scientists study those problems."}, {"time": 1435, "text": "It's just not a pressing question as far as I'm concerned."}, {"time": 1439, "text": "So before I continue down that line, I have a few questions there."}, {"time": 1439, "text": "But what do you like and not like about Ex Machina as a movie?"}, {"time": 1445, "text": "Because I actually watched it for the second time and enjoyed it."}, {"time": 1449, "text": "I hated it the first time, and I enjoyed it quite a bit more the second time when I sort of learned to accept certain pieces of it, see it as a concept movie."}, {"time": 1463, "text": "What was your experience?"}, {"time": 1463, "text": "What were your thoughts?"}, {"time": 1466, "text": "So the negative is the picture it paints of science is totally wrong."}, {"time": 1466, "text": "Science in general and AI in particular."}, {"time": 1476, "text": "Science is not happening in some hidden place by some, you know, really smart guy, one person."}, {"time": 1484, "text": "This is totally unrealistic."}, {"time": 1484, "text": "This is not how it happens."}, {"time": 1484, "text": "Even a team of people in some isolated place will not make it."}, {"time": 1492, "text": "Science moves by small steps, thanks to the collaboration and community of a large number of people interacting."}, {"time": 1499, "text": "And all the scientists who are expert in their field kind of know what is going on, even in the industrial labs."}, {"time": 1514, "text": "It's information flows and leaks and so on."}, {"time": 1514, "text": "And the spirit of it is very different from the way science is painted in this movie."}, {"time": 1525, "text": "Yeah, let me ask on that point."}, {"time": 1525, "text": "It's been the case to this point that kind of even if the research happens inside Google or Facebook, inside companies, it still kind of comes out, ideas come out."}, {"time": 1536, "text": "Do you think that will always be the case with AI?"}, {"time": 1536, "text": "Is it possible to bottle ideas to the point where there's a set of breakthroughs that go completely undiscovered by the general research community?"}, {"time": 1547, "text": "Do you think that's even possible?"}, {"time": 1552, "text": "It's possible, but it's unlikely."}, {"time": 1552, "text": "It's not how it is done now."}, {"time": 1552, "text": "It's not how I can foresee it in the foreseeable future."}, {"time": 1559, "text": "But of course, I don't have a crystal ball and science is a crystal ball."}, {"time": 1569, "text": "And so who knows?"}, {"time": 1569, "text": "This is science fiction after all."}, {"time": 1574, "text": "I think it's ominous that the lights went off during that discussion."}, {"time": 1581, "text": "So the problem, again, there's one thing is the movie and you could imagine all kinds of science fiction."}, {"time": 1585, "text": "The problem for me, maybe similar to the question about existential risk, is that this kind of movie paints such a wrong picture of what is the actual science and how it's going on that it can have unfortunate effects on people's understanding of current science."}, {"time": 1605, "text": "And so that's kind of sad."}, {"time": 1610, "text": "There's an important principle in research, which is diversity."}, {"time": 1610, "text": "So in other words, research is exploration."}, {"time": 1618, "text": "Research is exploration in the space of ideas."}, {"time": 1618, "text": "And different people will focus on different directions."}, {"time": 1623, "text": "And this is not just good, it's essential."}, {"time": 1623, "text": "So I'm totally fine with people exploring directions that are contrary to mine or look orthogonal to mine."}, {"time": 1636, "text": "I am more than fine."}, {"time": 1636, "text": "I think it's important."}, {"time": 1636, "text": "I and my friends don't claim we have universal truth about what will, especially about what will happen in the future."}, {"time": 1644, "text": "Now that being said, we have our intuitions and then we act accordingly according to where we think we can be most useful and where society has the most to gain or to lose."}, {"time": 1656, "text": "We should have those debates and not end up in a society where there's only one voice and one way of thinking and research money is spread out."}, {"time": 1673, "text": "So disagreement is a sign of good research, good science."}, {"time": 1680, "text": "The idea of bias in the human sense of bias."}, {"time": 1680, "text": "How do you think about instilling in machine learning something that's aligned with human values in terms of bias?"}, {"time": 1688, "text": "We intuitively as human beings have a concept of what bias means, of what fundamental respect for other human beings means."}, {"time": 1701, "text": "But how do we instill that into machine learning systems, do you think?"}, {"time": 1706, "text": "So I think there are short term things that are already happening and then there are long term things that we need to do."}, {"time": 1712, "text": "In the short term, there are techniques that have been proposed and I think will continue to be improved and maybe alternatives will come up to take data sets in which we know there is bias, we can measure it."}, {"time": 1724, "text": "Pretty much any data set where humans are being observed taking decisions will have some sort of bias, discrimination against particular groups and so on."}, {"time": 1739, "text": "And we can use machine learning techniques to try to build predictors, classifiers that are going to be less biased."}, {"time": 1744, "text": "We can do it, for example, using adversarial methods to make our systems less sensitive to these variables we should not be sensitive to."}, {"time": 1758, "text": "So these are clear, well defined ways of trying to address the problem."}, {"time": 1758, "text": "Maybe they have weaknesses and more research is needed and so on."}, {"time": 1763, "text": "But I think in fact they are sufficiently mature that governments should start regulating companies where it matters, say like insurance companies, so that they use those techniques."}, {"time": 1775, "text": "Because those techniques will probably reduce the bias but at a cost."}, {"time": 1780, "text": "For example, maybe their predictions will be less accurate and so companies will not do it until you force them."}, {"time": 1788, "text": "All right, so this is short term."}, {"time": 1788, "text": "Long term, I'm really interested in thinking how we can instill moral values into computers."}, {"time": 1796, "text": "Obviously, this is not something we'll achieve in the next five or 10 years."}, {"time": 1801, "text": "How can we, you know, there's already work in detecting emotions, for example, in images, in sounds, in texts, and also studying how different agents interacting in different ways may correspond to patterns of, say, injustice, which could trigger anger."}, {"time": 1828, "text": "So these are things we can do in the medium term and eventually train computers to model, for example, how humans react emotionally."}, {"time": 1837, "text": "I would say the simplest thing is unfair situations which trigger anger."}, {"time": 1846, "text": "This is one of the most basic emotions that we share with other animals."}, {"time": 1852, "text": "I think it's quite feasible within the next few years that we can build systems that can detect these kinds of things to the extent, unfortunately, that they understand enough about the world around us, which is a long time away."}, {"time": 1861, "text": "But maybe we can initially do this in virtual environments."}, {"time": 1868, "text": "So you can imagine a video game where agents interact in some ways and then some situations trigger an emotion."}, {"time": 1874, "text": "I think we could train machines to detect those situations and predict that the particular emotion will likely be felt if a human was playing one of the characters."}, {"time": 1889, "text": "You have shown excitement and done a lot of excellent work with unsupervised learning."}, {"time": 1895, "text": "But there's been a lot of success on the supervised learning side."}, {"time": 1900, "text": "And one of the things I'm really passionate about is how humans and robots work together."}, {"time": 1906, "text": "And in the context of supervised learning, that means the process of annotation."}, {"time": 1906, "text": "Do you think about the problem of annotation put in a more interesting way as humans teaching machines?"}, {"time": 1922, "text": "Is there?"}, {"time": 1923, "text": "I think it's an important subject."}, {"time": 1923, "text": "Reducing it to annotation may be useful for somebody building a system tomorrow."}, {"time": 1929, "text": "But longer term, the process of teaching, I think, is something that deserves a lot more attention from the machine learning community."}, {"time": 1936, "text": "So there are people who have coined the term machine teaching."}, {"time": 1939, "text": "So what are good strategies for teaching a learning agent?"}, {"time": 1944, "text": "And can we design and train a system that is going to be a good teacher?"}, {"time": 1953, "text": "So in my group, we have a project called BBI or BBI game, where there is a game or scenario where there's a learning agent and a teaching agent."}, {"time": 1962, "text": "Presumably, the teaching agent would eventually be a human."}, {"time": 1968, "text": "But we're not there yet."}, {"time": 1968, "text": "And the role of the teacher is to use its knowledge of the environment, which it can acquire using whatever way brute force to help the learner learn as quickly as possible."}, {"time": 1984, "text": "So the learner is going to try to learn by itself, maybe using some exploration and whatever."}, {"time": 1990, "text": "But the teacher can choose, can have an influence on the interaction with the learner, so as to guide the learner, maybe teach it the things that the learner has most trouble with, or just add the boundary between what it knows and doesn't know, and so on."}, {"time": 2010, "text": "So there's a tradition of these kind of ideas from other fields and like tutorial systems, for example, and AI."}, {"time": 2016, "text": "And of course, people in the humanities have been thinking about these questions."}, {"time": 2025, "text": "But I think it's time that machine learning people look at this, because in the future, we'll have more and more human machine interaction with the human in the loop."}, {"time": 2035, "text": "And I think understanding how to make this work better, all the problems around that are very interesting and not sufficiently addressed."}, {"time": 2041, "text": "You've done a lot of work with language, too."}, {"time": 2046, "text": "What aspect of the traditionally formulated Turing test, a test of natural language understanding and generation in your eyes is the most difficult of conversation?"}, {"time": 2059, "text": "What in your eyes is the hardest part of conversation to solve for machines?"}, {"time": 2059, "text": "So I would say it's everything having to do with the non linguistic knowledge, which implicitly you need in order to make sense of sentences, things like the Winograd schema."}, {"time": 2072, "text": "So these sentences that are semantically ambiguous."}, {"time": 2077, "text": "In other words, you need to understand enough about the world in order to really interpret properly those sentences."}, {"time": 2083, "text": "I think these are interesting challenges for machine learning, because they point in the direction of building systems that both understand how the world works and this causal relationships in the world and associate that knowledge with how to express it in language, either for reading or writing."}, {"time": 2112, "text": "You speak French?"}, {"time": 2113, "text": "Yes, it's my mother tongue."}, {"time": 2114, "text": "It's one of the romance languages."}, {"time": 2114, "text": "Do you think passing the Turing test and all the underlying challenges we just mentioned depend on language?"}, {"time": 2120, "text": "Do you think it might be easier in French than it is in English, or is independent of language?"}, {"time": 2128, "text": "I think it's independent of language."}, {"time": 2128, "text": "I would like to build systems that can use the same principles, the same learning mechanisms to learn from human agents, whatever their language."}, {"time": 2146, "text": "Well, certainly us humans can talk more beautifully and smoothly in poetry, some Russian originally."}, {"time": 2153, "text": "I know poetry in Russian is maybe easier to convey complex ideas than it is in English."}, {"time": 2162, "text": "But maybe I'm showing my bias and some people could say that about French."}, {"time": 2162, "text": "But of course, the goal ultimately is our human brain is able to utilize any kind of those languages to use them as tools to convey meaning."}, {"time": 2178, "text": "Yeah, of course, there are differences between languages, and maybe some are slightly better at some things, but in the grand scheme of things, where we're trying to understand how the brain works and language and so on, I think these differences are minute."}, {"time": 2192, "text": "So you've lived perhaps through an AI winter of sorts?"}, {"time": 2199, "text": "How did you stay warm and continue your research?"}, {"time": 2204, "text": "Stay warm with friends."}, {"time": 2205, "text": "With friends."}]}]