[{"title": "Dmitry Korkin: Computational Biology of Coronavirus | Lex Fridman Podcast #90", "id": "CwyOUS8TSl0", "quotes": [{"time": 418, "text": "We keep seeing new strains of coronaviruses emerging."}, {"time": 424, "text": "This is a natural process and I think this is why it's so powerful."}, {"time": 434, "text": "You know, if you ask me, you know, I've read papers about scientists trying to study the capacity of the modern, you know, biotechnology to alter the viruses."}, {"time": 453, "text": "But I hope that, you know, it won't be our main concern in the nearest future."}, {"time": 463, "text": "What do you mean by hope?"}, {"time": 466, "text": "Well, you know, if you look back and look at the history of the most dangerous viruses, right?"}, {"time": 475, "text": "So the first thing that comes into mind is a smallpox."}, {"time": 482, "text": "So right now there is perhaps a handful of places where there is a smallpox."}, {"time": 491, "text": "There is perhaps a handful of places where this, you know, the strains of this virus are stored, right?"}, {"time": 502, "text": "So this is essentially the effort of the whole society to limit the access to those viruses."}, {"time": 512, "text": "You mean in a lab in a controlled environment in order to study?"}, {"time": 516, "text": "And then smallpox is one of the viruses that should be stated there's a vaccine is developed."}, {"time": 524, "text": "And that's, you know, it's until 70s, I mean, in my opinion, it was perhaps the most dangerous thing that was there."}, {"time": 536, "text": "Is that a very different virus than the influenza and the coronaviruses?"}, {"time": 543, "text": "It is, it is different in several aspects."}, {"time": 548, "text": "Biologically, it's a so called double stranded DNA virus, but also in the way that it is much more contagious."}, {"time": 564, "text": "So the R naught for, so this is the... What's R naught?"}, {"time": 570, "text": "R naught is essentially an average number as person infected by the virus can spread to other people."}, {"time": 582, "text": "So then the average number of people that he or she can, you know, spread it to."}, {"time": 590, "text": "And, you know, there is still some, you know, discussion about the estimates of the current virus, you know, the estimations vary between, you know, 1.5 and 3."}, {"time": 606, "text": "In case of smallpox, it was 5 to 7."}, {"time": 613, "text": "And we're talking about the exponential growth, right?"}, {"time": 617, "text": "So that's a very big difference."}, {"time": 623, "text": "It's not the most contagious one."}, {"time": 625, "text": "Measles, for example, it's, I think, 15 and up."}, {"time": 630, "text": "So it's, you know, but it's definitely more contagious that the seasonal flu than the current coronavirus or SARS for that matter."}, {"time": 648, "text": "What makes a virus more contagious?"}, {"time": 652, "text": "I'm sure there's a lot of variables that come into play, but is it that whole discussion of aerosol and like the size of droplets if it's airborne, or is there some other stuff that's more biology centered?"}, {"time": 664, "text": "I mean, there are a lot of components and there are biological components that there are also, you know, social components."}, {"time": 674, "text": "The ability of the virus to, you know, so the ways in which the virus is spread is definitely one."}, {"time": 681, "text": "The ability of the virus to stay on the surfaces, to survive."}, {"time": 687, "text": "The ability of the virus to replicate fast or so, you know."}, {"time": 693, "text": "Or once it's in the cell or whatever."}, {"time": 695, "text": "Once it's inside the host."}, {"time": 698, "text": "And interestingly enough, something that I think we didn't pay that much attention to is the incubation period."}, {"time": 709, "text": "The, where, you know, hosts are symptomatic."}, {"time": 712, "text": "And now it turns out that another thing that we, one really needs to take into account, the percentage of the symptomatic population."}, {"time": 724, "text": "Because those people still shed this virus and still are, you know, they still are contagious."}, {"time": 732, "text": "So there's an, the Iceland study, which I think is probably the most impressive size wise, shows 50% asymptomatic for this virus."}, {"time": 742, "text": "I also recently learned the swine flu is, like the, just the number of people who got infected was in the billions."}, {"time": 755, "text": "It was some crazy number."}, {"time": 757, "text": "It was like, it was like, like 20% of the pop, 30% of the population, something crazy like that."}, {"time": 764, "text": "So the lucky thing there is the fatality rate is low, but the fact that a virus can just take over an entire population so quickly, it's terrifying."}, {"time": 776, "text": "I think, I mean, this is, you know, that's perhaps my favorite example of a butterfly effect because it's really, I mean, it's even tinier than a butterfly and look at, you know, and with, you know, if you think about it, right."}, {"time": 793, "text": "It used to be in those bat species."}, {"time": 799, "text": "And perhaps because of, you know, a couple of small changes in the viral genome, it first had, you know, become capable of jumping from bats to human, and then it became capable of jumping from human to human, right."}, {"time": 819, "text": "So this is, I mean, it's not even the size of a virus."}, {"time": 822, "text": "It's the size of several, you know, several atoms or a few atoms."}, {"time": 830, "text": "And all of a sudden this change has such a major impact."}, {"time": 837, "text": "So is that a mutation like on a single virus?"}, {"time": 841, "text": "Is that like, so if we talk about those, the flap of a butterfly wing, like what's the first flap?"}, {"time": 848, "text": "Well, I think this is the mutations that make, that made this virus capable of jumping from bat species to human."}, {"time": 860, "text": "Of course there's, you know, the scientists are still trying to find, I mean, they're still even trying to find who was the first infected, right, the patient zero."}, {"time": 870, "text": "The first human."}, {"time": 871, "text": "The first human infected, right."}, {"time": 874, "text": "I mean, the fact that there are coronaviruses, different strains of coronaviruses in various bat species, I mean, we know that."}, {"time": 883, "text": "So we, you know, virologists observe them."}, {"time": 887, "text": "They study them."}, {"time": 888, "text": "They look at their genomic sequences."}, {"time": 891, "text": "They're trying, of course, to understand what make these viruses to jump from bats to human."}, {"time": 901, "text": "Because, you know, similar to that in influenza, there was, I think a few years ago, there was this, you know, interesting story where several groups of scientists studying influenza virus essentially, you know, made experiments to show that this virus can jump from one species to another, you know, by changing, I think, just a couple of residues."}, {"time": 934, "text": "And, of course, it was very controversial."}, {"time": 938, "text": "I think there was a moratorium on this study for a while."}, {"time": 943, "text": "But then the study was released."}, {"time": 945, "text": "It was published."}, {"time": 947, "text": "So that, why was there a moratorium?"}, {"time": 949, "text": "Because it shows through engineering it, through modifying it, you can make it jump."}, {"time": 957, "text": "I personally think it is important to study this."}, {"time": 962, "text": "I mean, we should be informed."}, {"time": 965, "text": "We should try to understand as much as possible in order to prevent it."}, {"time": 970, "text": "But so then the engineering aspect there is, can't you then just start searching because there's so many strands of viruses out there."}, {"time": 980, "text": "Can't you just search for the ones in bats that are the deadliest from the virologist perspective and then just try to engineer, try to see how to."}, {"time": 993, "text": "But see, there's a nice aspect to it."}, {"time": 997, "text": "The really nice thing about engineering viruses, it has the same problem as nuclear weapons."}, {"time": 1004, "text": "It's hard for it to not lead to mutual self destruction."}, {"time": 1009, "text": "So you can't control a virus."}, {"time": 1011, "text": "It can't be used as a weapon, right?"}, {"time": 1013, "text": "Yeah, that's why in the beginning I said, I'm hopeful because there are definitely regulations needed to be introduced."}, {"time": 1025, "text": "And I mean, as the scientific society is, we are in charge of making the right actions, making the right decisions."}, {"time": 1039, "text": "But I think we will benefit tremendously by understanding the mechanisms by which the virus can jump, by which the virus can become more dangerous to humans because all these answers would eventually lead to designing better vaccines, hopefully universal vaccines, right?"}, {"time": 1070, "text": "And that would be a triumph of science."}, {"time": 1076, "text": "So what's the universal vaccine?"}, {"time": 1078, "text": "So is that something that, how universal is universal?"}, {"time": 1082, "text": "Well, I mean, you know, so what's the dream, I guess, because you kind of mentioned the dream of this."}, {"time": 1086, "text": "I would be extremely happy if we designed the vaccine that is able, I mean, I'll give you an example."}, {"time": 1096, "text": "So every year we do a seasonal flu shot."}, {"time": 1101, "text": "The reason we do it is because, you know, we are in the arms race, you know, our vaccines are in the arms race with constantly changing virus, right?"}, {"time": 1112, "text": "Now, if the next pandemic, influenza pandemic will occur, most likely this vaccine would not save us, right?"}, {"time": 1123, "text": "Although it's, you know, it's the same virus, might be different strain."}, {"time": 1132, "text": "So if we're able to essentially design a vaccine against, you know, influenza A virus, no matter what's the strain, no matter which species did it jump from, that would be, I think that would be a huge, huge progress and advancement."}, {"time": 1153, "text": "You mentioned the smallpox until the 70s, might've been something that you would be worried the most about."}, {"time": 1160, "text": "What about these days?"}, {"time": 1162, "text": "Well, we're sitting here in the middle of a COVID 19 pandemic, but these days, nevertheless, what is your biggest worry virus wise?"}, {"time": 1173, "text": "What are you keeping your eye out on?"}, {"time": 1177, "text": "It looks like, you know, based on the past several years of the new viruses emerging, I think we're still dealing with different types of influence."}, {"time": 1195, "text": "I mean, so the H7N9 avian flu that emerged, I think a couple of years ago in China, I think the mortality rate was incredible."}, {"time": 1213, "text": "I mean, it was, you know, I think about 30%, you know, so this is, this is huge."}, {"time": 1220, "text": "I mean, luckily for us, this strain was not pandemic, right?"}, {"time": 1226, "text": "So it was jumping from birds to human, but I don't think it was actually transmittable between the humans."}, {"time": 1234, "text": "And, you know, this is actually a very interesting question, which scientists try to understand, right?"}, {"time": 1242, "text": "So the balance, the delicate balance between the virus being very contagious, right, so efficient in spreading and virus to be very pathogenic, you know, causing, you know, harms, you know, and that's to the horse."}, {"time": 1264, "text": "So it looks like that the more pathogenic the virus is, the less contagious it is."}, {"time": 1273, "text": "Is that a property of biology or what is it?"}, {"time": 1277, "text": "I don't have an answer to that."}, {"time": 1279, "text": "And I think this is still an open question."}, {"time": 1282, "text": "But, you know, if you look at, you know, with the coronavirus, for example, if you look at, you know, the deadlier relative MERS, MERS was never a pandemic virus."}, {"time": 1300, "text": "But, you know, again, the mortality rate from MERS is far above, you know, I think 20 or 30%, so."}, {"time": 1312, "text": "So whatever is making this all happen doesn't want us dead because it's balancing out nicely."}, {"time": 1319, "text": "I mean, how do you explain that we're not dead yet?"}, {"time": 1325, "text": "Like, because there's so many viruses and they're so good at what they do."}, {"time": 1331, "text": "Why do they keep us alive?"}, {"time": 1334, "text": "I mean, we also have, you know, a lot of protection."}, {"time": 1339, "text": "So we do the immune system."}, {"time": 1341, "text": "And so, I mean, we do have, you know, ways to fight against those viruses."}, {"time": 1351, "text": "And I think with the now we're much better equipped."}, {"time": 1356, "text": "So with the discoveries of vaccines and, you know, there are vaccines against the viruses that maybe 200 years ago would wipe us out completely."}, {"time": 1370, "text": "But because of these vaccines, we are actually, we are capable of eradicating pretty much fully as is the case with smallpox."}, {"time": 1378, "text": "So if we could, can we go to the basics a little bit of the biology of the virus?"}, {"time": 1384, "text": "How does a virus infect the body?"}, {"time": 1387, "text": "So I think there are some key steps that the virus needs to perform."}, {"time": 1393, "text": "And of course, the first one, the viral particle needs to get attached to the host cell."}, {"time": 1401, "text": "In the case of coronavirus, there is a lot of evidence that it actually interacts in the same way as the SARS coronavirus."}, {"time": 1413, "text": "So it gets attached to AC2 human receptor."}, {"time": 1418, "text": "And so there is, I mean, as we speak, there is a growing number of papers suggesting it."}, {"time": 1425, "text": "Moreover, most recent, I think most recent results suggest that this virus attaches more efficiently to this human receptor than SARS."}, {"time": 1439, "text": "So just to sort of back off, so there is a family of viruses that are coronaviruses and SARS, whatever the heck for that, whatever that stands for."}, {"time": 1451, "text": "So SARS actually stands for the disease that you get is the syndrome of acute respiratory syndrome."}, {"time": 1460, "text": "So SARS is the first strand and then there's MERS."}, {"time": 1464, "text": "And there is, yes, scientists actually know more than three strands."}, {"time": 1472, "text": "I mean, so there is the MHV strain, which is considered to be a canonical disease model in mice."}, {"time": 1486, "text": "And so there is a lot of work done on this virus because it's..."}, {"time": 1492, "text": "But it hasn't jumped to humans yet?"}, {"time": 1497, "text": "And then you mentioned AC2."}, {"time": 1500, "text": "So when you say attach, proteins are involved on both sides."}, {"time": 1507, "text": "So we have this infamous spike protein on the surface of the virion particle, and it does look like a spike."}, {"time": 1516, "text": "And I mean, that's essentially because of this protein, we call the coronavirus coronavirus."}, {"time": 1522, "text": "So that's what makes corona on top of the surface."}, {"time": 1527, "text": "So this protein, it actually it acts, so it doesn't act alone."}, {"time": 1535, "text": "It actually it makes three copies and it makes so called trimer."}, {"time": 1542, "text": "So this trimer is essentially a functional unit, a single functional unit that starts interacting with the AC2 receptor."}, {"time": 1554, "text": "So this is, again, another protein that now sits on the surface of a human cell or host cell, I would say."}, {"time": 1563, "text": "And that's essentially in that way the virus anchors itself to the host cell."}, {"time": 1574, "text": "Because then it needs to actually it needs to get inside."}, {"time": 1578, "text": "You know, it fuses its membrane with the host membrane."}, {"time": 1583, "text": "It releases the key components."}, {"time": 1587, "text": "It releases its, you know, RNA and then essentially hijacks the machinery of the cell because none of the viruses that we know of have ribosome, the machinery that allows us to print out proteins."}, {"time": 1610, "text": "So in order to print out proteins that are necessary for functioning of this virus, it actually needs to hijack the host ribosomes."}, {"time": 1619, "text": "So a virus is an RNA wrapped in a bunch of proteins, one of which is this functional mechanism of a spike protein that does the attachment."}, {"time": 1629, "text": "Yeah, so if you look at this virus, there are several basic components."}, {"time": 1635, "text": "So we start with the spike protein."}, {"time": 1638, "text": "This is not the only surface protein, the protein that lives on the surface of the viral particle."}, {"time": 1644, "text": "There is also perhaps the protein with the highest number of copies is the membrane protein."}, {"time": 1653, "text": "So it's essentially it forms the envelope of the protein of the viral particle and essentially, you know, helps to maintain a certain curvature, helps to make a certain curvature."}, {"time": 1674, "text": "Then there is another protein called envelope protein or E protein, and it actually occurs in far less quantities."}, {"time": 1685, "text": "And still there is ongoing research what exactly does this protein do?"}, {"time": 1693, "text": "So these are sort of the three major surface proteins that, you know, make the viral envelope."}, {"time": 1701, "text": "And when we go inside, then we have another structural protein called nuclear protein."}, {"time": 1709, "text": "And the purpose of this protein is to protect the viral RNA."}, {"time": 1714, "text": "It actually binds to the viral RNA, creates a capsid."}, {"time": 1719, "text": "And so the rest of the virus viral information is inside of this RNA."}, {"time": 1726, "text": "And, you know, if you compare the amount of the genes or proteins that are made of these genes, it's significantly higher than of influenza virus, for example."}, {"time": 1744, "text": "Influenza virus has, I think, around eight or nine proteins where this one has at least 29."}, {"time": 1752, "text": "That has to do with the length of the RNA strand?"}, {"time": 1757, "text": "So it affects the length of the RNA strand."}, {"time": 1761, "text": "So because you essentially need to have sort of the minimum amount of information to encode those genes."}, {"time": 1769, "text": "How many proteins did you say?"}, {"time": 1771, "text": "29."}, {"time": 1772, "text": "29 proteins."}, {"time": 1774, "text": "So this is, you know, something definitely interesting because, you know, believe it or not, we've been studying, you know, coronaviruses for over two decades."}, {"time": 1787, "text": "We've yet to uncover all functionalities of these proteins."}, {"time": 1792, "text": "Could we maybe take a small attention and can you say how one would try to figure out what a function of a particular protein is?"}, {"time": 1803, "text": "So you've mentioned people are still trying to figure out what the function of the envelope protein might be or what's the process?"}, {"time": 1811, "text": "So this is where the research that computational scientists do might be of help because, you know, in the past several decades, we actually have collected a pretty decent amount of knowledge about different proteins in different viruses."}, {"time": 1834, "text": "So what we can actually try to do, and this is sort of could be sort of our first lead to a possible function is to see whether those, you know, say we have this genome of the coronavirus, of the novel coronavirus, and we identify the potential proteins."}, {"time": 1856, "text": "Then in order to infer the function, what we can do, we can actually see whether those proteins are similar to those ones that we already know."}, {"time": 1867, "text": "OK, in such a way, we can, you know, for example, clearly identify, you know, some critical components that RNA polymerase or different types of proteases."}, {"time": 1879, "text": "These are the proteins that essentially clip the protein sequences."}, {"time": 1887, "text": "And so this works in many cases."}, {"time": 1887, "text": "However, in some cases you have truly novel proteins."}, {"time": 1896, "text": "And this is a much more difficult task."}, {"time": 1900, "text": "Now, as a small pause, when you say similar, like what if some parts are different and some parts are similar?"}, {"time": 1908, "text": "Like, how do you disentangle that?"}, {"time": 1911, "text": "You know, it's a big question."}, {"time": 1911, "text": "Of course, you know, what bioinformatics does, it does predictions, right?"}, {"time": 1919, "text": "So those predictions, they have to be validated by experiments."}, {"time": 1925, "text": "Functional or structural predictions?"}, {"time": 1927, "text": "I mean, we do structural predictions, we do functional predictions, we do interactions predictions."}, {"time": 1934, "text": "Oh, so this is interesting."}, {"time": 1934, "text": "So you just generate a lot of predictions, like reasonable predictions based on structural function, interaction, like you said."}, {"time": 1943, "text": "And then here you go."}, {"time": 1943, "text": "That's the power of bioinformatics is data grounded, good predictions of what should happen."}, {"time": 1952, "text": "So, you know, in a way I see it, we're helping experimental scientists to streamline the discovery process."}, {"time": 1962, "text": "And the experimental scientists, is that what a virologist is?"}, {"time": 1967, "text": "So yeah, virology is one of the experimental sciences that, you know, focus on viruses."}, {"time": 1974, "text": "They often work with other experimental scientists, for example, the molecular imaging scientists, right?"}, {"time": 1982, "text": "So the viruses often can be viewed and reconstructed through electron microscopy techniques."}, {"time": 1991, "text": "So but these are, you know, specialists that are not necessarily virologists."}, {"time": 1996, "text": "They work with small particles, whether it's viruses or it's an organelle of a human cell, whether it's a complex molecular machinery."}, {"time": 2013, "text": "So the techniques that are used are very similar in sort of in their essence."}, {"time": 2021, "text": "And so, yeah, so typically we see it now, the research on, you know, that is emerging and that is needed often involves the collaborations between virologists, you know, biochemists, people from pharmaceutical sciences, computational sciences."}, {"time": 2055, "text": "So we have to work together."}, {"time": 2058, "text": "So from my perspective, just to step back, sometimes I look at this stuff, just how much we understand about RNA and DNA, how much we understand about protein, like your work, the amount of proteins that you're exploring, is it surprising to you that we were able, we descendants of apes, were able to figure all of this out?"}, {"time": 2081, "text": "Like how?"}, {"time": 2081, "text": "So you're a computer scientist."}, {"time": 2086, "text": "So for me, from a computer science perspective, I know how to write a Python program, things are clear."}, {"time": 2091, "text": "But biology is a giant mess, it feels like to me from an outsider's perspective."}, {"time": 2098, "text": "How surprising is it, amazing is it that we were able to figure this stuff out?"}, {"time": 2104, "text": "You know, if you look at the, you know, how computational science and computer science was evolving, right?"}, {"time": 2112, "text": "I think it was just a matter of time that we would approach biology."}, {"time": 2116, "text": "So we started from, you know, applications to much more fundamental systems, physics, you know, and now we are, or, you know, small chemical compounds."}, {"time": 2132, "text": "So now we are approaching the more complex biological systems, and I think it's a natural evolution of, you know, of the computer science, of mathematics."}, {"time": 2148, "text": "So sure, that's the computer science side, I just meant even in higher level."}, {"time": 2152, "text": "So that to me is surprising that computer science can offer help in this messy world."}, {"time": 2157, "text": "But I just mean, it's incredible that the biologists and the chemists can figure all this out."}, {"time": 2162, "text": "Or does that just sound ridiculous to you, that of course they would."}, {"time": 2167, "text": "It just seems like a very complicated set of problems, like the variety of the kinds of things that could be produced in the body."}, {"time": 2175, "text": "Just like you said, 29 protein, I mean, just getting a hang of it so quickly, it just seems impossible to me."}, {"time": 2186, "text": "I mean, it's, and I have to say we are, you know, in the very, very beginning of this journey."}, {"time": 2194, "text": "I mean, we've yet to, I mean, we've yet to comprehend, not even try to understand and figure out all the details, but we've yet to comprehend the complexity of the cell."}, {"time": 2211, "text": "We know that neuroscience is not even at the beginning of understanding the human mind."}, {"time": 2219, "text": "So where's biology sit in terms of understanding the function, deeply understanding the function of viruses and cells?"}, {"time": 2229, "text": "So there, sometimes it's easy to say when you talk about function, what you really refer to is perhaps not a deep understanding, but more of a understanding sufficient to be able to mess with it using a antivirus, like mess with it chemically to prevent some of its function."}, {"time": 2249, "text": "Or do you understand the function?"}, {"time": 2251, "text": "Well, I think, I think we are much farther in terms of understanding of the complex genetic disorder, such as cancer, where you have layers of complexity."}, {"time": 2262, "text": "And we, you know, as in my laboratory, we're trying to contribute to that research, but we're also, you know, we're overwhelmed with how many different layers of complexity, different layers of mechanisms that can be hijacked by cancer simultaneously."}, {"time": 2280, "text": "And so, you know, I think biology in the past 20 years, again, from the perspective of the outsider, because I'm not a biologist, but I think it has advanced tremendously."}, {"time": 2298, "text": "And one thing that where computational scientists and data scientists are now becoming very, very helpful is in the fact, it's coming from the fact that we are now able to generate a lot of information about the cell."}, {"time": 2323, "text": "Whether it's next generation sequencing or transcriptomics, whether it's life imaging information, where it is, you know, complex interactions between proteins or between proteins and small molecules such as drugs."}, {"time": 2341, "text": "We are becoming very efficient in generating this information."}, {"time": 2341, "text": "And now the next step is to become equally efficient in processing this information and extracting the key knowledge from that."}, {"time": 2360, "text": "That could then be validated with experiment."}, {"time": 2364, "text": "So maybe then going all the way back, we were talking, you said the first step is seeing if we can match the new proteins you found in the virus against something we've seen before to figure out its function."}, {"time": 2377, "text": "And then you also mentioned that, but there could be cases where it's a totally new protein."}, {"time": 2377, "text": "Is there something bioinformatics can offer when it's a totally new protein?"}, {"time": 2387, "text": "This is where many of the methods and you probably are aware of, you know, the case of machine learning, many of these methods rely on the previous knowledge."}, {"time": 2400, "text": "So things that where we try to do from scratch are incredibly difficult."}, {"time": 2407, "text": "You know, something that we call ab initio."}, {"time": 2407, "text": "And this is, I mean, it's not just the function."}, {"time": 2407, "text": "I mean, you know, we've yet to have a robust method to predict the structures of these proteins in ab initio, you know, by not using any templates of other related proteins."}, {"time": 2431, "text": "So protein is a chain of amino acids."}, {"time": 2435, "text": "It's residues."}, {"time": 2436, "text": "Residues."}, {"time": 2436, "text": "And then somehow magically, maybe you can tell me, they seem to fold in incredibly weird and complicated 3D shapes."}, {"time": 2449, "text": "So, and that's where actually the idea of protein folding or just not the idea, but the problem of figuring out how the concept, how they fold into those weird shapes comes in."}, {"time": 2464, "text": "So that's another side of computational work."}, {"time": 2464, "text": "So can you describe what protein folding from the computational side is and maybe your thoughts on the folding at home efforts that a lot of people know that you can use your machine to do protein folding?"}, {"time": 2482, "text": "So yeah, protein folding is, you know, one of those $1 million price challenges, right?"}, {"time": 2490, "text": "So the reason for that is we've yet to understand precisely how the protein gets folded so efficiently to the point that in many cases where you, you know, where you try to unfold it due to the high temperature, it actually folds back into its original state."}, {"time": 2513, "text": "So we know a lot about the mechanisms, right?"}, {"time": 2513, "text": "But putting those mechanisms together and making sense, it's a computationally very expensive task."}, {"time": 2530, "text": "In general, do proteins fold, can they fold in arbitrary large number of ways or do they usually fold in a very small number of ways?"}, {"time": 2539, "text": "It's typically, I mean, we tend to think that, you know, there is a one sort of canonical fold for a protein, although there are many cases where the proteins, you know, upon destabilization, it can be folded into a different confirmation."}, {"time": 2556, "text": "And this is especially true when you look at sort of proteins that include more than one structural unit."}, {"time": 2556, "text": "So those structural units, we call them protein domains."}, {"time": 2568, "text": "Essentially, protein domain is a single unit that typically is evolutionary preserved, that typically carries out a single function and typically has a very distinct fold, right?"}, {"time": 2584, "text": "The structure, 3D structure organization."}, {"time": 2584, "text": "But turns out that if you look at human, an average protein in a human cell would have a bit of two or three such subunits and how they are trying to fold into the sort of, you know, next level fold, right?"}, {"time": 2610, "text": "So within subunit there's folding and then they fold into the larger 3D structure, right?"}, {"time": 2618, "text": "And all of that, there's some understanding of the basic mechanisms, but not to put together to be able to fold it."}, {"time": 2624, "text": "We're still, I mean, we're still struggling."}, {"time": 2624, "text": "I mean, we're getting pretty good about folding relatively small proteins up to 100 residues."}, {"time": 2624, "text": "I mean, but we're still far away from folding, you know, larger proteins."}, {"time": 2642, "text": "And some of them are notoriously difficult."}, {"time": 2642, "text": "For example, transmembrane proteins, proteins that sit in the membranes of the cell, they're incredibly important, but they are incredibly difficult to solve."}, {"time": 2659, "text": "And so basically there's a lot of degrees of freedom, how it folds."}, {"time": 2659, "text": "And so it's a combinatorial problem where it just explodes."}, {"time": 2659, "text": "There's so many dimensions."}, {"time": 2668, "text": "Well, it is a combinatorial problem, but it doesn't mean that we cannot approach it from the, not from the brute force approach."}, {"time": 2668, "text": "And so the machine learning approaches, you know, have been emerged that try to tackle it."}, {"time": 2687, "text": "So folding at home, I don't know how familiar you are with it, but is that using machine learning or is it more brute force?"}, {"time": 2695, "text": "So folding at home, it was originally, and I remember I was, I mean, it was a long time ago."}, {"time": 2695, "text": "I was a postdoc and we learned about this, you know, this game because it was originally designed as the game."}, {"time": 2710, "text": "And we, you know, I took a look at it and it's interesting because it's really, you know, it's very transparent, very intuitive."}, {"time": 2710, "text": "So, and from what I heard, I've yet to introduce it to my son, but you know, kids are actually getting very good at folding the proteins."}, {"time": 2732, "text": "And it was, you know, it came to me as the, not as a surprise, but actually as the sort of manifest of, you know, our capacity to do this kind of, to solve this kind of problems."}, {"time": 2752, "text": "When a paper was published in one of these top journals with the coauthors being the actual players of this game."}, {"time": 2767, "text": "So, and what happened was that they managed to get better structures than the scientists themselves."}, {"time": 2778, "text": "So that, you know, that was very, I mean, it was kind of profound, you know, revelation that problems that are so challenging for a computational science, maybe not that challenging for a human brain."}, {"time": 2798, "text": "That's a really good, that's a hopeful message always when there's a, the proof of existence, the existence proof that it's possible."}, {"time": 2798, "text": "That's really interesting, but it seems, what are the best ways to do protein folding now?"}, {"time": 2818, "text": "So if you look at what DeepMind does with AlphaFold, so they kind of, that's a learning approach."}, {"time": 2818, "text": "I mean, your background is in machine learning, but is this a learnable problem?"}, {"time": 2818, "text": "Is this still a brute force?"}, {"time": 2834, "text": "Are we in the Gary Kasparov deep blue days or are we in the AlphaGo playing the game of Go days of folding?"}, {"time": 2844, "text": "Well, I think we are, we are advancing towards this direction."}, {"time": 2844, "text": "I mean, if you look, so there is a sort of Olympic game for protein folders called CASP, and it's essentially, it's, you know, it's a competition where different teams are given exactly the same protein sequences and they try to predict their structures, right?"}, {"time": 2865, "text": "And of course there are different sort of sub tasks, but in the recent competition, AlphaFold was among the top performing teams, if not the top performing team."}, {"time": 2884, "text": "So there is definitely a benefit from the data that have been generated, you know, in the past several decades, the structural data."}, {"time": 2884, "text": "And certainly, you know, we are now at the capacity to summarize this data, to generalize this data and to use those principles, you know, in order to predict protein structures."}, {"time": 2913, "text": "That's one of the really cool things here is there's, maybe you can comment on it."}, {"time": 2913, "text": "There seems to be these open data sets of protein."}, {"time": 2913, "text": "How did that?"}, {"time": 2923, "text": "Protein Data Bank?"}, {"time": 2925, "text": "Yeah, Protein Data Bank."}, {"time": 2925, "text": "I mean, that's crazy."}, {"time": 2925, "text": "Is this a recent thing for just the coronavirus?"}, {"time": 2932, "text": "It's been for many, many years."}, {"time": 2932, "text": "I believe the first Protein Data Bank was designed on flashcards."}, {"time": 2932, "text": "So, yes, this is a great example of the community efforts of everyone contributing because every time you solve a protein or a protein complex, this is where you submit it."}, {"time": 2961, "text": "And, you know, the scientists get access to it, scientists get to test it."}, {"time": 2961, "text": "And we, bioinformaticians, use this information to, you know, to make predictions."}, {"time": 2981, "text": "So, there's no culture of like hoarding discoveries here."}, {"time": 2981, "text": "So, I mean, you've released a few or a bunch of proteins that were matching, whatever."}, {"time": 2981, "text": "We'll talk about details a little bit, but it's kind of amazing how open the culture here is."}, {"time": 3006, "text": "And I think this pandemic actually demonstrated the ability of scientific community to, you know, to solve this challenge collaboratively."}, {"time": 3006, "text": "And this is, I think, if anything, it actually moved us to a brand new level of collaborations of the efficiency in which people establish new collaborations, in which people offer their help to each other, scientists offer their help to each other."}, {"time": 3044, "text": "And publish results too."}, {"time": 3044, "text": "We're now trying to figure out, there's a few journals that are trying to sort of do the very accelerated review cycle, but so many preprints."}, {"time": 3044, "text": "So, just posting a paper going out, I think it's fundamentally changing the way we think about papers."}, {"time": 3063, "text": "I mean, the way we think about knowledge, I would say, yes."}, {"time": 3063, "text": "Because, yes, I completely agree."}, {"time": 3063, "text": "I think now the knowledge is becoming sort of the core value, not the paper or the journal where this knowledge is published."}, {"time": 3086, "text": "And I think this is, again, we are living in the times where it becomes really crystallized, the idea that the most important value is in the knowledge."}, {"time": 3103, "text": "So, maybe you can comment, like, what do you think the future of that knowledge sharing looks like?"}, {"time": 3103, "text": "So, you have this paper that I hope we get a chance to talk about a little bit, but it has, like, a really nice abstract and introduction related, like, it has all the usual, I mean, probably took a long time to put together."}, {"time": 3120, "text": "So, but is that going to remain, like, you could have communicated a lot of fundamental ideas here in much shorter amount that's less traditionally acceptable by the journal context."}, {"time": 3135, "text": "So, well, you know, so the first version that we posted, not even on the bioarchive, because bioarchive back then, it was essentially, you know, overwhelmed with the number of submissions."}, {"time": 3153, "text": "So, our submission, I think it took five or six days to just for it to be screened and put online."}, {"time": 3153, "text": "So, we, you know, essentially we put the first preprint on our website, and, you know, it started getting access right away."}, {"time": 3175, "text": "So, and, you know, so this original preprint was in a much rougher shape than this paper."}, {"time": 3185, "text": "And, but we tried, I mean, we honestly tried to be as compact as possible with, you know, introducing the information that is necessary to explain our, you know, our results."}, {"time": 3206, "text": "So, maybe you can dive right in if it's okay."}, {"time": 3206, "text": "So, this is a paper called Structural Genomics of SARS Co, how do you even pronounce?"}, {"time": 3206, "text": "SARS CoV2."}, {"time": 3206, "text": "CoV2?"}, {"time": 3218, "text": "By the way, CoVid is such a terrible name, but it stuck."}, {"time": 3218, "text": "Anyway, SARS CoV2 indicates evolutionary conserved functional regions of viral proteins."}, {"time": 3229, "text": "So, this is looking at all kinds of proteins that are part of this novel coronavirus and how they match up against the previous other kinds of coronaviruses."}, {"time": 3241, "text": "I mean, there's a lot of beautiful figures."}, {"time": 3241, "text": "I was wondering if you could, I mean, there's so many questions I could ask here, but maybe at the, how do you get started doing this paper?"}, {"time": 3251, "text": "So, how do you start to figure out the 3D structure of a novel virus?"}, {"time": 3255, "text": "So, there is actually a little story behind it."}, {"time": 3255, "text": "And so, the story actually dated back in September of 2019."}, {"time": 3267, "text": "And you probably remember that back then, we had another dangerous virus, triple E virus."}, {"time": 3267, "text": "It's a queen encephalitis virus."}, {"time": 3279, "text": "Can you maybe linger on it?"}, {"time": 3279, "text": "I have to admit, I was sadly completely unaware."}, {"time": 3285, "text": "So, that was actually a virus outbreak that happened in New England only."}, {"time": 3285, "text": "The danger in this virus was that it actually targeted your brain."}, {"time": 3297, "text": "So, the word death from this virus, it was transferred, the main vector was mosquitoes."}, {"time": 3311, "text": "And obviously, fall time is the time where you have a lot of them in New England."}, {"time": 3318, "text": "And on one hand, people realize this is actually a very dangerous thing."}, {"time": 3318, "text": "So, it had an impact on the local economy."}, {"time": 3331, "text": "The schools were closed past six o clock, no activities outside for the kids because the kids were suffering quite tremendously when infected from this virus."}, {"time": 3347, "text": "How do I not know about this?"}, {"time": 3347, "text": "Was universities impacted?"}, {"time": 3351, "text": "It was in the news."}, {"time": 3351, "text": "I mean, it was not impacted to a high degree in Boston necessarily, but in the Metro West area and actually spread around, I think, all the way to New Hampshire, Connecticut."}, {"time": 3368, "text": "And you mentioned affecting the brain."}, {"time": 3368, "text": "That's one other comment we should make."}, {"time": 3373, "text": "So, you mentioned AC2 for the coronavirus."}, {"time": 3373, "text": "So, these viruses kind of attached to something in the body."}, {"time": 3383, "text": "So, it essentially attaches to these proteins in those cells in the body where those proteins are expressed, where they actually have them in abundance."}, {"time": 3395, "text": "So, sometimes that could be in the lungs, that could be in the brain, that could be in something."}, {"time": 3399, "text": "So, I think right now, from what I read, they have the epithelial cells inside."}, {"time": 3410, "text": "So, the cells that are covering the surface, so inside the nasal surfaces, the throat, the lung cells, and I believe liver as a couple of other organs where they are actually expressed in abundance."}, {"time": 3433, "text": "That's for the AC2 you said?"}, {"time": 3434, "text": "For the AC2 receptors."}, {"time": 3436, "text": "So, back to the story, the outbreak in the fall."}, {"time": 3440, "text": "So, now the impact of this virus is significant."}, {"time": 3449, "text": "However, it's a prelocal problem to the point that this is something that we would call a neglected disease because it's not big enough to make the drug design companies to design a new antiviral or a new vaccine."}, {"time": 3472, "text": "It's not big enough to generate a lot of grants from the national funding agencies."}, {"time": 3483, "text": "So, it doesn't mean we cannot do anything about it."}, {"time": 3488, "text": "And so, what I did is I taught a bioinformatics class in Worcester Polytechnic Institute, and we are very much a problem learning institution."}, {"time": 3505, "text": "So, I thought that that would be a perfect project for the class."}, {"time": 3511, "text": "It's an ongoing case study."}, {"time": 3514, "text": "So, we essentially designed a study where we tried to use bioinformatics to understand as much as possible about this virus."}, {"time": 3527, "text": "And a very substantial portion of the study was to understand the structures of the proteins, to understand how they interact with each other and with the host proteins, try to understand the evolution of this virus."}, {"time": 3548, "text": "So, obviously, a very important question, where it will evolve further, how it happened here."}, {"time": 3561, "text": "So, we did all these projects, and now I'm trying to put them into a paper where all these undergraduate students will be coauthors."}, {"time": 3572, "text": "But essentially, the projects were finished right about mid December."}, {"time": 3579, "text": "And a couple of weeks later, I heard about this mysterious new virus that was discovered and was reported in Wuhan province."}, {"time": 3590, "text": "And immediately I thought that, well, we just did that, can't we do the same thing with this virus?"}, {"time": 3600, "text": "And so, we started waiting for the genome to be released, because that's essentially the first piece of information that is critical."}, {"time": 3608, "text": "Once you have the genome sequence, you can start doing a lot using bioinformatics."}, {"time": 3613, "text": "When you say genome sequence, that's referring to the sequence of letters that make up the RNA?"}, {"time": 3620, "text": "Well, the sequence that make up the entire information encoded in the protein, right?"}, {"time": 3628, "text": "So, that includes all 29 genes."}, {"time": 3634, "text": "What are genes?"}, {"time": 3634, "text": "What's the encoding of information?"}, {"time": 3638, "text": "So, genes is essentially a basic functional unit that we can consider."}, {"time": 3646, "text": "So, each gene in the virus would correspond to a protein."}, {"time": 3653, "text": "So, gene by itself doesn't do its function."}, {"time": 3656, "text": "It needs to be converted or translated into the protein that will become the actual functional unit."}, {"time": 3666, "text": "Yeah, like you said, the printer."}, {"time": 3669, "text": "So, we need the printer for that."}, {"time": 3671, "text": "We need the printer, okay."}, {"time": 3672, "text": "So, the first step is to figure out the genome, the sequence of things that could be then used for printing the protein."}, {"time": 3682, "text": "So, then the next step, so once we have this and so we use the existing information about SARS because the SARS genomics has been done in abundance."}, {"time": 3697, "text": "So, we have different strains of SARS and actually other related coronaviruses, MERS, the bat coronavirus."}, {"time": 3708, "text": "And we started by identifying the potential genes because right now it's just a sequence, right?"}, {"time": 3716, "text": "So, it's a sequence that is roughly, it's less than 30,000 nucleotide long."}, {"time": 3724, "text": "Just a raw sequence."}, {"time": 3726, "text": "It's a raw sequence."}, {"time": 3727, "text": "No other information really."}, {"time": 3728, "text": "And we now need to define the boundaries of the genes that would then be used to identify the protein and protein structures."}, {"time": 3743, "text": "It's not, I mean, it's pretty straightforward."}, {"time": 3747, "text": "So, you know, so because we use the existing information about SARS proteins and SARS genes."}, {"time": 3755, "text": "So, once again, you kind of, we are relying on the, yes."}, {"time": 3760, "text": "So, and then once we get there, this is where sort of the first more traditional bioinformatics step begins."}, {"time": 3774, "text": "We're trying to use this protein sequences and get the 3D information about those proteins."}, {"time": 3783, "text": "So, this is where we are relying heavily on the structure information specifically from the protein databank that we're talking about."}, {"time": 3795, "text": "And here you're looking for similar proteins."}, {"time": 3799, "text": "So, the concept that we are operating when we do this kind of modeling, it's called homology or template based modeling."}, {"time": 3807, "text": "So, essentially using the concept that if you have two sequences that are similar in terms of the letters, the structures of the sequences are expected to be similar as well."}, {"time": 3823, "text": "And this is at the micro, at the very local scale?"}, {"time": 3828, "text": "At the scale of the whole protein."}, {"time": 3830, "text": "At the whole protein."}, {"time": 3831, "text": "So, actually, so, you know, so, of course the devil is in the details."}, {"time": 3837, "text": "And this is why we need actually pre sophisticated modeling tools to do so."}, {"time": 3851, "text": "Once we get the structures of the individual proteins, we try to see whether or not these proteins act alone or they have to be forming protein complexes in order to perform this function."}, {"time": 3871, "text": "And again, so, this is sort of the next level of the modeling because now you need to understand how proteins interact and it could be the case that the protein interacts with itself and makes sort of a multimeric complex."}, {"time": 3891, "text": "The same protein just repeated multiple times and we have quite a few such proteins in SARS CoV2, specifically spike protein needs three copies to function, envelope protein needs five copies to function."}, {"time": 3914, "text": "And there are some other multimeric complexes."}, {"time": 3918, "text": "That's what you mean by attracted with itself and you see multiple copies."}, {"time": 3918, "text": "So, how do you, how do you make a good guess whether something's going to interact?"}, {"time": 3927, "text": "Well, again, so there are two approaches, right?"}, {"time": 3927, "text": "So one is look at the previously solved complexes."}, {"time": 3927, "text": "Now we're looking not at the individual structures but the structures of the whole complex."}, {"time": 3941, "text": "Complex is a bunch of multiple proteins."}, {"time": 3943, "text": "Yeah, so it's a bunch of proteins essentially glued together."}, {"time": 3947, "text": "And when you say glued, that's the interaction."}, {"time": 3949, "text": "That's the interaction."}, {"time": 3949, "text": "So there are different forces, different sort of physical forces behind this."}, {"time": 3957, "text": "Sorry to keep asking dumb questions, but is the interaction fundamentally structural or is it functional?"}, {"time": 3957, "text": "Like in the way you're thinking about it?"}, {"time": 3970, "text": "That's actually a very good way to ask this question because it turns out that the interaction is structural, but in the way it forms the structure, it actually also carries out the function."}, {"time": 3987, "text": "So interaction is often needed to carry out very specific function of a protein."}, {"time": 3995, "text": "But in terms of on the other side, figuring out you're really starting at the structure before you figure out the function."}, {"time": 4003, "text": "So there's a beautiful figure too in the paper of all the different proteins that make up, able to figure out that make up the novel coronavirus."}, {"time": 4018, "text": "What are we looking at?"}, {"time": 4018, "text": "So these are like, that's through the step two that you mentioned, when you try to guess at the possible proteins, that's what you're going to get is these blue cyan blobs."}, {"time": 4036, "text": "So those are the individual proteins for which we have at least some information from the previous studies."}, {"time": 4048, "text": "So there is advantage and disadvantage of using previous studies."}, {"time": 4048, "text": "The biggest, well, the disadvantage is that we may not necessarily have the coverage of all 29 proteins."}, {"time": 4060, "text": "However, the biggest advantage is that the accuracy in which we can model these proteins is very high, much higher compared to ab initio methods that do not use any template information."}, {"time": 4076, "text": "So, but nevertheless, this figure also has, it's such a beautiful and I love these pictures so much."}, {"time": 4076, "text": "It has like the pink parts, which are the parts that are different."}, {"time": 4090, "text": "So you're highlighting, so the difference you find is on the 2D sequence."}, {"time": 4090, "text": "And then you try to infer what that will look like on the 3D."}, {"time": 4098, "text": "So the difference actually is on the 1D sequence."}, {"time": 4103, "text": "1D, sorry, 2D, right."}, {"time": 4106, "text": "So this is one of these first questions that we try to answer is that, well, if you take this new virus and you take the closest relatives, which are SARS and a couple of bad coronavirus strains, they are already the closest relatives that we are aware of."}, {"time": 4131, "text": "Now, what are the difference between this virus and its close relatives, right?"}, {"time": 4131, "text": "And if you look, typically when you take a sequence, those differences could be quite far away from each other."}, {"time": 4147, "text": "So what make, what 3D structure makes those difference to do, very often they tend to cluster together."}, {"time": 4159, "text": "And then all of a sudden the differences that may look completely unrelated actually relate to each other."}, {"time": 4159, "text": "And sometimes they are there because they correspond, they attack the functional site, right?"}, {"time": 4176, "text": "So they are there because this is the functional site that is highly mutated."}, {"time": 4183, "text": "So that's a computational approach to figuring something out."}, {"time": 4183, "text": "And when it comes together like that, that's kind of a nice clean indication that there's something, this could be actually indicative of what's happening."}, {"time": 4198, "text": "I mean, so we need this information and the 3D structure gives us just a very intuitive way to look at this information and then start to ask, start asking questions such as, so this place of this protein that is highly mutated, does it, is it the functional part of the protein?"}, {"time": 4223, "text": "So does this part of the protein interact with some other proteins or maybe with some other ligands, small molecules, right?"}, {"time": 4242, "text": "So we will try now to functionally inform this 3D structure."}, {"time": 4250, "text": "So you have a bunch of these mutated parts, if like, I don't know, how many are there in the novel coronavirus when you compare to SARS?"}, {"time": 4250, "text": "We're talking about hundreds, thousands, like these pink regions."}, {"time": 4268, "text": "No, no, much less than that."}, {"time": 4268, "text": "And it's very interesting that if you look at that, you know, so the first thing that you start seeing, right, you know, you look at patterns, right?"}, {"time": 4268, "text": "And the first pattern that becomes obvious is that some of the proteins in the new coronavirus are pretty much intact."}, {"time": 4291, "text": "So they're pretty much exactly the same as SARS, as the bat coronavirus, whereas some others are heavily mutated."}, {"time": 4302, "text": "So it looks like that the, you know, the evolution is not occurring, you know, uniformly across the entire, you know, viral genome, but actually target very specific proteins."}, {"time": 4321, "text": "And what do you do with that?"}, {"time": 4321, "text": "Like from the Sherlock Holmes perspective?"}, {"time": 4325, "text": "Well, you know, so one of the most interesting findings we had was the fact that the viral, so the binding sites on the viral surfaces that get targeted by the known small molecules, they were pretty much not affected at all."}, {"time": 4354, "text": "And so that means that the same small drugs or small drug like compounds can be efficient for the new coronavirus."}, {"time": 4370, "text": "Ah, so this all actually maps to the drug compounds too."}, {"time": 4370, "text": "So you're actually mapping out what old stuff is going to work on this thing and then possibilities for new stuff to work by mapping out the things that have mutated."}, {"time": 4387, "text": "So we essentially know which parts behave differently and which parts are likely to behave similar."}, {"time": 4387, "text": "And again, you know, of course, all our predictions need to be validated by experiments."}, {"time": 4405, "text": "But hopefully that sort of helps us to delineate the regions of this virus that, you know, can be promising in terms of the drug discovery."}, {"time": 4418, "text": "You kind of, you kind of mentioned this already, but maybe you can elaborate."}, {"time": 4418, "text": "So how different from the structural and functional perspective does the new coronavirus appear to be relative to SARS?"}, {"time": 4431, "text": "We now are trying to understand the overall structural characteristics of this virus because I mean, that's our next step, trying to model the viral particle of single viral particle of this virus."}, {"time": 4448, "text": "So that means you have the individual proteins, like you said, you have to figure out what their interaction is."}, {"time": 4448, "text": "So you have this, is that where this graph kind of interactome?"}, {"time": 4459, "text": "So the interactome is essentially our prediction on the potential interactions, some of them that we already deciphered from the structural knowledge, but some of them that are essentially are deciphered from the knowledge of the existing interactions that people previously obtained for SARS, for MERS or other related viruses."}, {"time": 4488, "text": "Is there kind of interactomes, am I pronouncing that correctly by the way?"}, {"time": 4488, "text": "Are those already converged towards for SARS?"}, {"time": 4501, "text": "So I think there are a couple of papers that now investigate the sort of the large scale set of interactions between the new SARS and its host."}, {"time": 4501, "text": "And so I think that's an ongoing study."}, {"time": 4525, "text": "And the success of that, the result would be an interactome."}, {"time": 4525, "text": "And so when you say not trying to figure out the entire, the particle, the entire thing."}, {"time": 4537, "text": "So if you look, you know, so structure, right?"}, {"time": 4537, "text": "So what this viral particle looks like, right?"}, {"time": 4537, "text": "So as I said, it's, you know, the surface of it is an envelope, which is essentially a so called lipid bilayer with proteins integrated into the surface."}, {"time": 4558, "text": "So how, so an average particle is around 80 nanometers, right?"}, {"time": 4558, "text": "So this particle can have about 50 to 100 spike proteins."}, {"time": 4580, "text": "So at least we suspect it and, you know, based on the micrographs images, it's very comparable to MHV virus in mice and SARS virus."}, {"time": 4592, "text": "Micrographs are actual pictures of the actual virus."}, {"time": 4592, "text": "So these are models."}, {"time": 4592, "text": "This is the actual images, right?"}, {"time": 4600, "text": "What do they, sorry for the tangents, but what are these things?"}, {"time": 4600, "text": "So when you look on the internet, the models and the pictures are kind of, and the models you have here are just gorgeous and beautiful."}, {"time": 4611, "text": "When you actually take pictures of them with a micrograph, like what, what do we look?"}, {"time": 4615, "text": "Well, they typically are not perfect."}, {"time": 4615, "text": "So, so the, most of the images that you see now is the, is the sphere with those spikes."}, {"time": 4628, "text": "You actually see the spikes?"}, {"time": 4628, "text": "Yes, you do see the spikes."}, {"time": 4628, "text": "And now, you know, the, our collaborators for Texas A&M University, Benjamin Newman, he actually in the recent paper about SARS he proposed, and there's some actually evidence behind it, that the particle is not a sphere, but is actually as elongated ellipsoid like particles."}, {"time": 4651, "text": "So, so that's what we are trying to incorporate into our model."}, {"time": 4669, "text": "And the, I mean, you know, if you look at the actual micrographs, you see that those particles are, you know, are not symmetric."}, {"time": 4682, "text": "So the, the, the, some of them, and of course, you know, it could be due to the treatment of the, of the material."}, {"time": 4682, "text": "It could be due to the, some noise in the imaging."}, {"time": 4694, "text": "So there's a lot of uncertainty in all this."}, {"time": 4694, "text": "So structurally figuring out the entire part."}, {"time": 4694, "text": "By the way, again, sorry for the tangents, but why the term particle?"}, {"time": 4694, "text": "Or is it just something that's stuck?"}, {"time": 4707, "text": "It's a, it's a, it's a single, you know, so we call, you know, we call it the virion."}, {"time": 4707, "text": "So virion particle, it's essentially a single virus."}, {"time": 4715, "text": "But it just feels like, because particle to me, from the physics perspective, feels like this, the most basic unit, because there seems to be so much going on inside the virus."}, {"time": 4729, "text": "It doesn't feel like a particle to me."}, {"time": 4730, "text": "Yeah, well, yeah, it's probably, I think it's the, you know, virion is a good way to call it."}, {"time": 4737, "text": "So, okay, so trying to figure out, trying to figure out the entirety of the system."}, {"time": 4745, "text": "So, you know, so, you know, so this is, so the virion has 5200 spikes, trimer spikes."}, {"time": 4745, "text": "It has roughly 200 to 400 membrane protein dimers."}, {"time": 4745, "text": "And those are arranged in the very nice lattice."}, {"time": 4768, "text": "So you can actually see sort of the, it's like a carpet of... On the surface again."}, {"time": 4776, "text": "Exactly, on the surface."}, {"time": 4776, "text": "And occasionally you also see this envelope protein inside."}, {"time": 4783, "text": "Is that the one we don't know what it does?"}, {"time": 4786, "text": "The one that forms the pentamer, this very nice pentameric ring."}, {"time": 4786, "text": "And so, you know, so this is what we're trying to, you know, we're trying to put now all our knowledge together and see whether we can actually generate this overall virion model."}, {"time": 4808, "text": "With an idea to understand, you know, well, first of all, to understand how it looks like, how far it is from those images that were generated."}, {"time": 4808, "text": "But I mean, the implications are, you know, there is a potential for the, you know, nanoparticle design that will mimic this virion particle."}, {"time": 4835, "text": "Is the process of nanoparticle design meaning artificially designing something that looks similar?"}, {"time": 4841, "text": "And also the one that can potentially compete with the actual virion particles and therefore reduce the effect of the infection."}, {"time": 4854, "text": "So is this the idea of, like, what is a vaccine?"}, {"time": 4858, "text": "So vaccine, so there are two ways of essentially treating and in the case of vaccine is preventing the infection."}, {"time": 4869, "text": "So vaccine is, you know, a way to train our immune system."}, {"time": 4878, "text": "So our immune system becomes aware of this new danger and therefore is capable of generating the antibodies then will essentially bind to the spike proteins because that's the main target for the, you know, for the vaccine's design and block its functioning."}, {"time": 4907, "text": "If you have the spike with the antibody on top, it can no longer interact with AC2 receptor."}, {"time": 4916, "text": "So the process of designing a vaccine then is you have to understand enough about the structure of the virus itself to be able to create an artificial, an artificial particle?"}, {"time": 4929, "text": "Well, I mean, so the nanoparticle is a very exciting and new research."}, {"time": 4929, "text": "So there are already established ways to, you know, to make vaccines and there are several different ones, right?"}, {"time": 4945, "text": "So there is one where essentially the virus gets through the cell culture multiple times, so it becomes essentially adjusted to the specific embryonic cell and as a result becomes less, you know, compatible with the host human cells."}, {"time": 4972, "text": "So therefore it's sort of the idea of the live vaccine where the particles are there, but they are not so efficient, you know, so they cannot replicate, you know, as rapidly as, you know, before the vaccine."}, {"time": 4992, "text": "They can be introduced to the immune system, the immune system will learn and the person who gets this vaccine won't get, you know, sick or, you know, will have mild, you know, mild symptoms."}, {"time": 5009, "text": "So then there is sort of different types of the way to introduce the nonfunctional parts of this virus or the virus where some of the information is stripped down."}, {"time": 5025, "text": "For example, the virus with no genetic material, so with no RNA genome, exactly."}, {"time": 5025, "text": "So it cannot replicate, it cannot essentially perform most of its functions."}, {"time": 5039, "text": "What is the biggest hurdle to design one of these, to arrive at one of these?"}, {"time": 5039, "text": "Is it the work that you're doing in the fundamental understanding of this new virus or is it in the, from our perspective, well, complicated world of experimental validation and sort of showing that this, like going through the whole process of showing this is actually going to work with FDA approval, all that kind of stuff?"}, {"time": 5064, "text": "I think it's both."}, {"time": 5064, "text": "I mean, you know, our understanding of the molecular mechanisms will allow us to, you know, to design, to have more efficient designs of the vaccines."}, {"time": 5064, "text": "However, once you design a vaccine, it needs to be tested."}, {"time": 5082, "text": "But when you look at the 18 months and the different projections, it seems like an exceptionally, historically speaking, maybe you can correct me, but it's even 18 months seems like a very accelerated timeline."}, {"time": 5094, "text": "I mean, I remember reading about, you know, in the book about some previous vaccines that it could take up to 10 years to design and, you know, properly test a vaccine before its mass production."}, {"time": 5114, "text": "So yeah, we, you know, everything is accelerated these days."}, {"time": 5114, "text": "I mean, for better, for worse, but, but, you know, we definitely need that."}, {"time": 5123, "text": "Well, especially with the coronavirus, I mean, the scientific community is really stepping up and working together."}, {"time": 5123, "text": "The collaborative aspect is really interesting."}, {"time": 5123, "text": "You mentioned, so the vaccine is one and then there's antivirals, antiviral drugs."}, {"time": 5135, "text": "So antiviral drugs."}, {"time": 5135, "text": "So where, you know, vaccines are typically needed to prevent the infection."}, {"time": 5135, "text": "But once you have an infection, one, you know, so what we try to do, we try to stop it."}, {"time": 5147, "text": "So we try to stop virus from functioning."}, {"time": 5147, "text": "And so the antiviral drugs are designed to block some critical functioning of the proteins from the virus."}, {"time": 5166, "text": "So there are a number of interesting candidates."}, {"time": 5166, "text": "And I think, you know, if you ask me, I, you know, I think Remdesivir is perhaps the most promising."}, {"time": 5185, "text": "It's, it has been shown to be, you know, an efficient and effective antiviral for SARS."}, {"time": 5198, "text": "Originally, it was the antiviral drug developed for a completely different virus, I think, for Ebola and Marburg."}, {"time": 5209, "text": "At high levels, you know how it works?"}, {"time": 5211, "text": "So it tries to mimic one of the nucleotides in RNA and essentially that stops the replication."}, {"time": 5224, "text": "So messes, I guess that's what, so antiviral drugs mess with some aspect of this process."}, {"time": 5231, "text": "So, you know, so essentially we try to stop certain functions of the virus."}, {"time": 5231, "text": "There are some other ones, you know, that are designed to inhibit the protease, the thing that clips protein sequences."}, {"time": 5251, "text": "There is one that was originally designed for malaria, which is a bacterial, you know, bacterial disease."}, {"time": 5262, "text": "So, but that's exactly where your work steps in is you're figuring out the functional and the structure of these different, so like providing candidates for where drugs can plug in."}, {"time": 5274, "text": "Well, yes, because, you know, one thing that we don't know is whether or not, so let's say we have a perfect drug candidate that is efficient against SARS and against MERS."}, {"time": 5288, "text": "Now, is it going to be efficient against new SARS COVID 2?"}, {"time": 5294, "text": "We don't know that."}, {"time": 5294, "text": "And there are multiple aspects that can affect this efficiency."}, {"time": 5302, "text": "So, for instance, if the binding site, so the part of the protein where this ligand gets attached, if this site is mutated, then the ligand may not be attachable to this part any longer."}, {"time": 5320, "text": "And, you know, our work and the work of other bioinformatics groups, you know, essentially are trying to understand whether or not that will be the case."}, {"time": 5334, "text": "And it looks like for the ligands that we looked at, the ligand binding sites are pretty much intact, which is very promising."}, {"time": 5347, "text": "So, if we can just like zoom out for a second."}, {"time": 5355, "text": "So, there's two, well, there's three possible ends to the coronavirus pandemic."}, {"time": 5361, "text": "So, one is drugs or vaccines get figured out very quickly, probably drugs first."}, {"time": 5370, "text": "The other is the pandemic runs its course for this wave, at least."}, {"time": 5377, "text": "And then the third is, you know, things go much worse in some dark, bad, very bad direction."}, {"time": 5386, "text": "Do you see, let's focus on the first two."}, {"time": 5390, "text": "Do you see the anti drugs or the work you're doing being relevant for us right now in stopping the pandemic?"}, {"time": 5403, "text": "Or do you hope that the pandemic will run its course?"}, {"time": 5406, "text": "So, the social distancing, things like wearing masks, all those discussions that we're having will be the method with which we fight coronavirus in the short term."}, {"time": 5420, "text": "Or do you think that it will have to be antiviral drugs?"}, {"time": 5425, "text": "I think antivirals would be, I would view that as at least the short term solution."}, {"time": 5436, "text": "I see more and more cases in the news of those new drug candidates being administered in hospitals."}, {"time": 5448, "text": "And I mean, this is right now the best what we have."}, {"time": 5455, "text": "But do we need it in order to reopen the economy?"}, {"time": 5458, "text": "I mean, we definitely need it."}, {"time": 5461, "text": "I cannot sort of speculate on how that will affect reopening of the economy because we are, you know, we are kind of deep into the pandemic."}, {"time": 5476, "text": "And it's not just the states."}, {"time": 5476, "text": "It's also, you know, worldwide, you know."}, {"time": 5483, "text": "Of course, you know, there is also the possibility of the second wave, as we, you know, as you mentioned."}, {"time": 5494, "text": "And this is why, you know, we need to be super careful."}, {"time": 5501, "text": "We need to follow all the precautions that the doctors tell us to do."}, {"time": 5510, "text": "Are you worried about the mutation of the virus?"}, {"time": 5514, "text": "It's, of course, a real possibility."}, {"time": 5518, "text": "Now, how, to what extent this virus can mutate, it's an open question."}, {"time": 5526, "text": "I mean, we know that it is able to mutate, to jump from one species to another and to become transmittable between humans."}, {"time": 5539, "text": "So will it, you know, so let's imagine that we have the new antiviral."}, {"time": 5546, "text": "Will this virus become eventually resistant to this antiviral?"}, {"time": 5553, "text": "I mean, this is what needs to be studied."}, {"time": 5556, "text": "This is such a beautiful and terrifying process that a virus, some viruses may be able to mutate to respond to the, to mutate around the thing we've put before it."}, {"time": 5571, "text": "Can you explain that process?"}, {"time": 5571, "text": "Like, how does that happen?"}, {"time": 5571, "text": "Is that just the way of evolution?"}, {"time": 5577, "text": "I would say so, yes."}, {"time": 5577, "text": "I mean, it's the evolutionary mechanisms."}, {"time": 5582, "text": "There is nothing imprinted into this virus that makes it, you know, it just the way it evolves."}, {"time": 5592, "text": "And actually, it's the way it core evolves with its host."}, {"time": 5598, "text": "It's just amazing, especially the evolution mechanisms, especially amazing given how simple the virus is."}, {"time": 5607, "text": "It's incredible that it's, I mean, it's beautiful."}, {"time": 5612, "text": "It's beautiful because it's one of the cleanest examples of evolution working."}, {"time": 5618, "text": "Well, I think, I mean, one of the sort of the reasons for its simplicity is because it does not require all the necessary functions to be stored."}, {"time": 5633, "text": "So it actually can hijack the majority of the necessary functions from the host cell."}, {"time": 5640, "text": "So the ability to do so, in my view, reduces the complexity of this machine drastically."}, {"time": 5651, "text": "Although if you look at the, you know, most recent discoveries."}, {"time": 5655, "text": "So the scientists discovered viruses that are as large as bacteria."}, {"time": 5661, "text": "So this MIMI viruses and MAMA viruses."}, {"time": 5666, "text": "It actually, those discoveries made scientists to reconsider the origins of the virus."}, {"time": 5676, "text": "You know, and what are the mechanisms and how, you know, what are the mechanisms, the evolution mechanisms that leads to the appearance of the viruses."}, {"time": 5686, "text": "By the way, I mean, you did mention that viruses are, I think you mentioned that they're not living."}, {"time": 5692, "text": "Yes, they're not living organisms."}, {"time": 5694, "text": "So let me ask that question again."}, {"time": 5697, "text": "Why do you think they're not living organisms?"}, {"time": 5700, "text": "Well, because they are dependent."}, {"time": 5704, "text": "The majority of the functions of the virus are dependent on the host."}, {"time": 5712, "text": "So let me do the devil's advocate, let me be the philosophical devil's advocate here and say, well, humans, which we would say are living, need our host planet to survive."}, {"time": 5727, "text": "So you can basically take every living organism that we think of as definitively living."}, {"time": 5734, "text": "It's always going to have some aspects of its host that it needs, of its environment."}, {"time": 5742, "text": "So is that really the key aspect of why a virus is that dependence?"}, {"time": 5749, "text": "Because it seems to be very good at doing so many things that we consider to be intelligent."}, {"time": 5757, "text": "It's just that dependence part."}, {"time": 5760, "text": "Well, I mean, it's difficult to answer in this way."}, {"time": 5770, "text": "I mean, the way I think about the virus is, you know, in order for it to function, it needs to have the critical component, the critical tools that it doesn't have."}, {"time": 5791, "text": "So, I mean, in my way, it's not autonomous."}, {"time": 5802, "text": "That's how I separate the idea of the living organism on a very high level between the living organism and... And you have some, we have, I mean, these are just terms and perhaps they don't mean much, but we have some kind of sense of what autonomous means and that humans are autonomous."}, {"time": 5825, "text": "You've also done excellent work in the epidemiological modeling, the simulation of these things."}, {"time": 5835, "text": "So the zooming out outside of the body, doing the agent based simulation."}, {"time": 5839, "text": "So that's where you actually simulate individual human beings and then the spread of viruses from one to the other."}, {"time": 5848, "text": "How does at a high level agent based simulation work?"}, {"time": 5854, "text": "So it's also one of this irony of timing."}, {"time": 5860, "text": "Because, I mean, we've worked on this project for the past five years and the New Year's Eve, I got an email from my PhD student that the last experiments were completed."}, {"time": 5877, "text": "And three weeks after that, we get this Diamond Princess story and emailing each other with the same news saying like..."}, {"time": 5889, "text": "So the Diamond Princess is a cruise ship."}, {"time": 5893, "text": "And what was the project that you worked on for five years?"}, {"time": 5895, "text": "The project, I mean, the code name, it started with a bunch of undergraduates."}, {"time": 5903, "text": "The code name was Zombies on a Cruise Ship."}, {"time": 5907, "text": "So they wanted to essentially model the zombie apocalypse on a cruise ship."}, {"time": 5915, "text": "And after having some fun, we then thought about the fact that if you look at the cruise ships, the infectious outbreak has been one of the biggest threats to the cruise ship economy."}, {"time": 5933, "text": "So perhaps the most frequently occurring is the Norwalk virus."}, {"time": 5941, "text": "And this is essentially one of these stomach flus that you have."}, {"time": 5947, "text": "And it can be quite devastating."}, {"time": 5952, "text": "So occasionally there are cruise ships, they get canceled, they get returned back to the origin."}, {"time": 5964, "text": "And so we wanted to study, and this is very different from the traditional epidemiological studies where the scale is much larger."}, {"time": 5973, "text": "So we wanted to study this in a confined environment, which is a cruise ship, it could be a school, it could be other places such as this large company where people are in interaction."}, {"time": 5993, "text": "And the benefit of this model is we can actually track that in the real time."}, {"time": 6001, "text": "So we can actually see the whole course of the evolution, the whole course of the interaction between the infected host and the host and the pathogen, et cetera."}, {"time": 6021, "text": "So agent based system or multi agent system to be precisely is a good way to approach this problem because we can introduce the behavior of the passengers, of the crews."}, {"time": 6047, "text": "And what we did for the first time, that's where we introduced some novelty is we introduced a pathogen agent explicitly."}, {"time": 6059, "text": "So that allowed us to essentially model the behavior on the host side as well on the pathogen side."}, {"time": 6071, "text": "And all of a sudden we can have a flexible model that allows us to integrate all the key parameters about the infections."}, {"time": 6083, "text": "So for example, the virus, right?"}, {"time": 6089, "text": "So the ways of transmitting the virus between the host."}, {"time": 6096, "text": "How long does virus survive on the surface, the fomite?"}, {"time": 6104, "text": "What is, you know, how much of the viral particles does a host shed when he or she is asymptomatic versus symptomatic?"}, {"time": 6122, "text": "And you can encode all of that into this pathogen."}, {"time": 6122, "text": "It's just for people who don't know."}, {"time": 6126, "text": "So agent based simulation, usually the agent represents a single human being."}, {"time": 6131, "text": "And then there's some graphs, like contact graphs that represent the interaction between those human beings."}, {"time": 6138, "text": "So, yes."}, {"time": 6138, "text": "So we, so essentially, you know, so agents are, you know, individual programs that are run in parallel."}, {"time": 6150, "text": "And we can provide instructions for these agents how to interact with each other, how to exchange information, in this case, exchange the infection."}, {"time": 6165, "text": "But in this case, in your case, you've added a pathogen as an agent."}, {"time": 6165, "text": "I mean, that's kind of fascinating."}, {"time": 6171, "text": "It's kind of a brilliant way to condense the parameters, to aggregate, to bring the parameters together that represent the pathogen, the virus."}, {"time": 6184, "text": "That's fascinating, actually."}, {"time": 6186, "text": "So, yeah, it was, you know, we realized that, you know, by bringing in the virus, we can actually start modeling."}, {"time": 6195, "text": "I mean, we are no longer bounded by very specific sort of aspects of the specific virus."}, {"time": 6204, "text": "So we end up, we started with, you know, Norwalk virus and of course, zombies."}, {"time": 6210, "text": "But we continued to modeling Ebola virus outbreak, flu, SARS, and because I felt that we need to add a little bit more sort of excitement for our undergraduate students."}, {"time": 6231, "text": "So we actually modeled the virus from the Contagion movie."}, {"time": 6236, "text": "So MEV1 and, you know, unfortunately, that virus and we tried to extract as much information."}, {"time": 6246, "text": "Luckily, the this movie was the scientific consultant was Ian Lipkin, a virologist from Columbia University, who is actually who provided."}, {"time": 6260, "text": "I think he designed this virus for this movie based on Nipah virus."}, {"time": 6266, "text": "And I think with some ideas behind SARS or flu like airborne viruses and, you know, the movie surprisingly contained enough details for us to extract and to model it."}, {"time": 6283, "text": "I was hoping you would like publish a paper of how this virus works."}, {"time": 6287, "text": "Yeah, we are planning to publish."}, {"time": 6289, "text": "I would love it if you did, but it would be nice if the, you know, if the the the origin of the virus."}, {"time": 6297, "text": "But you're now actually being a scientist and studying the virus from that perspective."}, {"time": 6301, "text": "But the origin of the virus, you know, you know, the first time I actually saw this movie is assignment number one in my bioinformatics class that they give."}, {"time": 6313, "text": "Because it it also tell it tells you that, you know, bioinformatics can be of use because if if I don't know you watched it."}, {"time": 6322, "text": "Have you watched it a long time ago?"}, {"time": 6324, "text": "So so there is, you know, approximately a week from the virus detection."}, {"time": 6331, "text": "We see a screenshot of scientists looking at the structure of the surface protein."}, {"time": 6339, "text": "And this is where I tell my students that, you know, if you ask an experimental biologist, they will tell you that it's impossible because it takes months, maybe years to get the crystal structure of this, you know, the structure that is represented."}, {"time": 6355, "text": "If you ask a bioinformatician, they tell you, sure, why not just get it modeled."}, {"time": 6363, "text": "And and yes, but but it was very interesting to to see that there is actually, you know, and if you do it, do screenshots, you actually see the filogenetic tree, the evolutionary tree that relate this virus with other viruses."}, {"time": 6383, "text": "So it was a lot of scientific thought put into the movie."}, {"time": 6387, "text": "And one thing that I was actually, you know, it was interesting to learn is that the origin of this virus was there were two animals that led to the, you know, the the, you know, the zoonotic origin of this virus were fruit bat and a pig."}, {"time": 6411, "text": "So, you know, so this is this is this doesn't feel like we're this."}, {"time": 6417, "text": "This definitely feels like we're living in a simulation."}, {"time": 6420, "text": "OK, but maybe a big picture."}, {"time": 6425, "text": "Ageing based simulation now, larger scale, sort of not focused on inclusion, but larger scale are used now to drive some policy."}, {"time": 6434, "text": "So politicians use them to tell stories and narratives and try to figure out how how to move forward under so much, so much uncertainty."}, {"time": 6443, "text": "But in your sense, are ageing based simulation useful for actually predicting the future?"}, {"time": 6451, "text": "Or are they useful mostly for comparing relative comparison of different intervention methods?"}, {"time": 6457, "text": "Well, I think both because, you know, in the case of new coronavirus, we we essentially learning that the current intervention methods may not be efficient enough."}, {"time": 6473, "text": "One thing that one important aspect that I find to be so critical and yet something that was overlooked, you know, during the past pandemics is the effect of the asymptomatic period."}, {"time": 6498, "text": "This virus is different because it has such a long symptomatic period."}, {"time": 6505, "text": "And all of a sudden, that creates a completely new game when trying to contain this virus."}, {"time": 6513, "text": "In terms of the dynamics of the infection."}, {"time": 6517, "text": "Do you also I don't know how close you're tracking this, but do you also think that there's a different rate of infection for when you're asymptomatic like that?"}, {"time": 6532, "text": "That aspect or does a virus not care?"}, {"time": 6535, "text": "So there were a couple of works."}, {"time": 6539, "text": "So one important parameter that tells us how contagious the the person was asymptomatic versus asymptomatic is looking at the number of viral particles this person sheds."}, {"time": 6558, "text": "You know, as a function of time."}, {"time": 6562, "text": "So, so far, what I saw is the study that tells us that the, you know, the person during the asymptomatic period is already contagious and it sheds the person sheds enough viruses to infect another host."}, {"time": 6587, "text": "And I think there's so many excellent papers coming out, but I think I just saw some maybe a nature paper that said the first week is when you're symptomatic or asymptomatic, you're the most contagious."}, {"time": 6600, "text": "So the highest level of the like the plot sort of in the 14 day period that collected a bunch of subjects."}, {"time": 6608, "text": "And I think the first week is when it's the most."}, {"time": 6611, "text": "Yeah, I think, I mean, I'm waiting, I'm waiting to see sort of more, more populated studies with higher numbers."}, {"time": 6624, "text": "My one of my favorite studies was, again, very recent one where scientists determined that tears are not contagious."}, {"time": 6635, "text": "So, so there is, you know, so there is no viral shedding done through, through tears."}, {"time": 6646, "text": "So they found one moist thing that's not contagious."}, {"time": 6646, "text": "And I mean, there's a lot of, I've personally been, because I'm on a survey paper, somehow that's looking at masks."}, {"time": 6661, "text": "And there's been so much interesting debates on the efficacy of masks."}, {"time": 6665, "text": "And there's a lot of work and there's a lot of interesting work on whether this virus is airborne."}, {"time": 6673, "text": "I mean, it's a totally open question."}, {"time": 6673, "text": "It's leaning one way right now, but it's a totally open question whether it can travel in aerosols long distances."}, {"time": 6682, "text": "I mean, do you have a, do you think about this stuff?"}, {"time": 6682, "text": "Do you track this stuff?"}, {"time": 6682, "text": "Are you focused on the, the bioinformatics of it?"}, {"time": 6688, "text": "I mean, this is, this is a very important aspect for our epidemiology study."}, {"time": 6696, "text": "I think the, I mean, and it's sort of a very simple sort of idea, but I agree with people who say that the mask, the masks work in both ways."}, {"time": 6715, "text": "So it not only protects you from the, you know, incoming viral particles, but also, you know, it, it, you know, makes the potentially contagious person not to spread the viral particles."}, {"time": 6731, "text": "Who is, when they're asymptomatic may not even know that they're, in fact, it seems to be, there's evidence that they don't, surgical and certainly homemade masks, which is what's needed now actually, because there's a huge shortage of, they don't work as to protect you that well."}, {"time": 6749, "text": "They work much better to protect others."}, {"time": 6749, "text": "So it's, it's, it's a motivation for us to all wear one."}, {"time": 6756, "text": "Cause I mean, you know, you don't know where, you know, about 30%, as far as I remember, at least 30% of the asymptomatic cases are completely asymptomatic."}, {"time": 6770, "text": "So you don't really cough."}, {"time": 6770, "text": "You don't, I mean, you don't have any symptoms, yet you shed viruses."}, {"time": 6778, "text": "Do you think it's possible that we'll all wear masks?"}, {"time": 6778, "text": "I wore a mask at a grocery store and you just, you get looks."}, {"time": 6785, "text": "I mean, this was like a week ago."}, {"time": 6785, "text": "Maybe it's already changed because I think CDC or somebody, I think the CDC has said that we should be wearing masks, like LA, they starting to happen."}, {"time": 6797, "text": "But do you, it just seems like something that this country will really struggle doing or no?"}, {"time": 6804, "text": "I hope not."}, {"time": 6804, "text": "I mean, you know, it, it was interesting."}, {"time": 6804, "text": "I was looking through the, through the old pictures during the Spanish flu and you could see that the, you know, pretty much everyone was wearing masks with some exceptions and they were like, you know, sort of iconic photograph of the, I think it was San Francisco, this tram who was refusing to let in a, you know, someone without the mask."}, {"time": 6838, "text": "So I think, well, you know, it's also, you know, it's related to the fact of how much we are scared."}, {"time": 6838, "text": "So how much do we treat this problem seriously?"}, {"time": 6856, "text": "And, you know, my take on it is we should, because it is very serious."}, {"time": 6868, "text": "Yeah, I, from a psychology perspective, just worry about the entirety, the entire big mess of a psychology experiment that this is, whether mask will help it or hurt it."}, {"time": 6868, "text": "You know, masks have a way of distancing us from others by removing the emotional expression and all that kind of stuff."}, {"time": 6891, "text": "But at the same time, mask also signal that I care about your wellbeing."}, {"time": 6891, "text": "So it's a really interesting trade off."}, {"time": 6891, "text": "That's just, yeah, it's, it's interesting, right?"}, {"time": 6891, "text": "About distancing."}, {"time": 6891, "text": "Aren't we distanced enough?"}, {"time": 6907, "text": "And when we try to come closer together, when they do reopen the economy, that's going to be a long road of rebuilding trust and not all being huge germaphobes."}, {"time": 6924, "text": "Let me ask sort of, you have a bit of a Russian accent, Russian or no Russian accent?"}, {"time": 6924, "text": "Were you born in Russia?"}, {"time": 6924, "text": "And you're too kind."}, {"time": 6924, "text": "I have a pretty thick Russian accent."}, {"time": 6941, "text": "What are your favorite memories of Russia?"}, {"time": 6944, "text": "So I moved first to Canada and then to the United States back in 99."}, {"time": 6944, "text": "So by that time I was 22."}, {"time": 6944, "text": "So, you know, whatever Russian accent I got back then, you know, it stuck with me for the rest of my life."}, {"time": 6967, "text": "You know, it's, yeah, so I, you know, by the time the Soviet Union collapsed, I was, you know, I was a kid, but sort of, you know, old enough to realize that there are changes."}, {"time": 6988, "text": "Did you want to be a scientist back then?"}, {"time": 6990, "text": "I mean, my first, the first sort of 10 years of my sort of, you know, juvenile life, I wanted to be a pilot of a passenger jet plane."}, {"time": 7011, "text": "So yes, it was like, you know, I was getting ready, you know, to go to a college to get the degree, but I've been always fascinated by science."}, {"time": 7026, "text": "And, you know, so not just by math, of course, math was one of my favorite subjects, but, you know, biology, chemistry, physics, somehow I, you know, I liked those four subjects together."}, {"time": 7042, "text": "And yes, so essentially after a certain period of time, I wanted to actually, back then it was a very popular sort of area of science called cybernetics."}, {"time": 7062, "text": "So it's sort of, it's not really computer science, but it was like, you know, computational robotics in this sense."}, {"time": 7070, "text": "And so I really wanted to do that."}, {"time": 7070, "text": "And but then, you know, I, you know, I realized that, you know, my biggest passion was in mathematics."}, {"time": 7086, "text": "And later I, you know, when, you know, studying in Moscow State University, I also realized that I really want to apply the knowledge."}, {"time": 7100, "text": "So I really wanted to mix, you know, the mathematical knowledge that I get with real life problems."}, {"time": 7111, "text": "And that could be, you mentioned chemistry and now biology."}, {"time": 7111, "text": "And I sort of, does it make you sad?"}, {"time": 7121, "text": "Maybe I'm wrong on this, but it seems like it's difficult to be in collaboration, to do open, big science in Russia."}, {"time": 7134, "text": "From my distant perspective in computer science, I don't, I'm not, I can go to conferences in Russia."}, {"time": 7141, "text": "I sadly don't have many collaborators in Russia."}, {"time": 7141, "text": "I don't know many people doing great AI work in Russia."}, {"time": 7149, "text": "Does it make, does that make you sad?"}, {"time": 7149, "text": "Am I wrong in seeing it this way?"}, {"time": 7154, "text": "Well, I mean, I am, I have to tell you, I am privileged to have collaborators in bioinformatics in Russia."}, {"time": 7154, "text": "And I think this is the bioinformatics school in Russia is very strong."}, {"time": 7169, "text": "In Moscow?"}, {"time": 7170, "text": "In Moscow, in Novosibirsk, in St. Petersburg, have great collaborators in Kazan."}, {"time": 7170, "text": "And so at least, you know, in terms of, you know, my area of research."}, {"time": 7191, "text": "There's strong people there."}, {"time": 7193, "text": "Yeah, strong people, a lot of great ideas, very open to collaborations."}, {"time": 7193, "text": "So I, perhaps, you know, it's my luck, but, you know, I haven't experienced, you know, any difficulties in establishing collaborations."}, {"time": 7213, "text": "That's bioinformatics though."}, {"time": 7214, "text": "It could be bioinformatics too."}, {"time": 7214, "text": "And it could, yeah, it could be person by person related, but I just don't feel the warmth and love that I would, you know, you talk about the Seminole people who are French in artificial intelligence."}, {"time": 7229, "text": "France welcomes them with open arms in so many ways."}, {"time": 7229, "text": "I just don't feel the love from Russia."}, {"time": 7229, "text": "I do on the human beings, like people in general, like friends and just cool, interesting people."}, {"time": 7229, "text": "But from the scientific community, no conferences, no big conferences."}, {"time": 7249, "text": "Yeah, it's actually, you know, I'm trying to think."}, {"time": 7249, "text": "Yeah, I cannot recall any big AI conferences in Russia."}, {"time": 7260, "text": "It has an effect on, for me, I haven't sadly been back to Russia."}, {"time": 7260, "text": "But my problem is it's very difficult."}, {"time": 7260, "text": "So now I have to renounce the citizenship."}, {"time": 7274, "text": "I mean, I'm a citizen in the United States and it makes it very difficult."}, {"time": 7274, "text": "There's a mess now, right?"}, {"time": 7274, "text": "So, I want to be able to travel like, you know, legitimately."}, {"time": 7286, "text": "And it's not an obvious process that will make it super easy."}, {"time": 7286, "text": "I mean, that's part of that, like, you know, it should be super easy for me to travel there."}, {"time": 7294, "text": "Well, you know, hopefully this unfortunate circumstances that we're in will actually promote the remote collaborations."}, {"time": 7308, "text": "And I think what we are experiencing right now is that you still can do science, you know, being quarantined in your own homes, especially when it comes."}, {"time": 7308, "text": "I mean, you know, I certainly understand there is a very challenging time for experimental scientists."}, {"time": 7326, "text": "I mean, I have many collaborators who are, you know, who are affected by that."}, {"time": 7326, "text": "But for computational scientists."}, {"time": 7333, "text": "Yeah, we're really leaning into the remote communication."}, {"time": 7333, "text": "Nevertheless, I had to force you to talk to you in person because there's something that you just can't do in terms of conversation like this."}, {"time": 7345, "text": "I don't know why, but in person is very much needed."}, {"time": 7345, "text": "So I really appreciate you doing it."}, {"time": 7351, "text": "You have a collection of science bobbleheads."}, {"time": 7355, "text": "Which look amazing."}, {"time": 7355, "text": "Which bobblehead is your favorite and which real world version, which scientist is your favorite?"}]}]