[{"title": "Jay Bhattacharya: The Case Against Lockdowns | Lex Fridman Podcast #254", "id": "oIOGUYOPAsA", "quotes": [{"time": 352, "text": "Maybe you can comment on different sources of data, different kinds of data."}, {"time": 355, "text": "The death one, that seems like a really important one."}, {"time": 359, "text": "Can we trust the reported deaths associated with COVID, or is it just a giant, messy thing that mixed up?"}, {"time": 366, "text": "And then there's this kind of stories about hospitals being incentivized to report a death as COVID death."}, {"time": 374, "text": "So there's some truth in some of that."}, {"time": 376, "text": "Let me just talk about the incentives."}, {"time": 379, "text": "So in the United States, we passed this CARES Act that was aimed at making sure hospital systems didn't go bankrupt in the early days of the pandemic."}, {"time": 389, "text": "The couple of things they did, one was they provided incentives to treat COVID patients, tens of thousands of dollars extra per COVID patient."}, {"time": 398, "text": "And the other thing they did is they gave a 20% bump to Medicare payments for elderly patients who are treated with COVID."}, {"time": 404, "text": "The idea is that there's more expensive to treat them at the early days."}, {"time": 408, "text": "So that did provide an incentive to sort of have a lot of COVID patients in the hospital, because your financial success of the hospital, or at least not lack of financial ruin depended on having many COVID patients."}, {"time": 420, "text": "The other thing on the death certificates is that reporting of deaths is a separate issue."}, {"time": 424, "text": "I don't know that there's a financial incentive there, but there is this sort of like complicated, you know, when you fill out a death certificate for a patient with a lot of conditions, like let's say a patient has diabetes, a patient that, well, that diabetes could lead to heart failure."}, {"time": 440, "text": "You know, you have a heart attack, heart failure, your lungs fill up, then you get COVID and you die."}, {"time": 446, "text": "So what do you write on the death certificate?"}, {"time": 448, "text": "Was it COVID that killed you?"}, {"time": 449, "text": "Was it the lungs filling up?"}, {"time": 451, "text": "Was it the heart failure?"}, {"time": 452, "text": "Was it the diabetes?"}, {"time": 454, "text": "It's really difficult to like disentangle."}, {"time": 457, "text": "And I think a lot of times what's happened is that people have like erred on the side of signing it as COVID."}, {"time": 464, "text": "Now, what's the evidence of this?"}, {"time": 466, "text": "There's been a couple of audits of death certificates in places like Santa Clara County, where I live, in Alameda County, California, where they carefully went through the death certificate and said, okay, is this reasonable to say this was actually COVID or it was COVID incidental?"}, {"time": 480, "text": "And they found that about 25%, 20, 25% of the deaths were more likely incidental than directly due to COVID."}, {"time": 488, "text": "I personally don't get too excited about this."}, {"time": 490, "text": "I mean, it's a philosophical question, right?"}, {"time": 492, "text": "Like ultimately, what kills you?"}, {"time": 496, "text": "Which is an odd thing to say if you're not in medicine, but like really, it's almost always multifactorial."}, {"time": 503, "text": "It's not always just the bus hits you."}, {"time": 505, "text": "The bus hits you, you get a brain bleed."}, {"time": 507, "text": "Was it the brain bleed that killed you?"}, {"time": 508, "text": "Would it have burst anyway?"}, {"time": 509, "text": "I mean, you know, the bus hits you, killed you, right?"}, {"time": 512, "text": "The way you die is a philosophical question, but it's also a sociological and psychological question because it seems like every single person who has passed away over the past couple of years, kind of the first question that comes to mind."}, {"time": 524, "text": "Was it COVID?"}, {"time": 526, "text": "Not just because you're trying to be political, but just in your mind."}, {"time": 529, "text": "No, I think there's a psychological reason for this, right?"}, {"time": 531, "text": "So, you know, we spent the better part of at least a half century in the United States not worried too much about infectious diseases."}, {"time": 541, "text": "The notion was we essentially conquered them."}, {"time": 543, "text": "It was something that happens in far away places to other people."}, {"time": 547, "text": "And that's true for much of the developed world."}, {"time": 550, "text": "Life expectancy were going up for decades and decades."}, {"time": 553, "text": "And for the first time in living memory, we have a disease that can kill us."}, {"time": 558, "text": "I mean, I think we're effectively evolved to fear that, like the panic centers of our brain, the lizard part of our brain takes over."}, {"time": 566, "text": "And our central focus has been avoiding this one risk."}, {"time": 569, "text": "And so it's not surprising that people, when they're filling out death certificates or thinking about what led to the death, this most salient thing that's in the front of everyone's brain would jump to the top."}, {"time": 581, "text": "And we can't ignore this very deep psychological thing when we consider what people say on the internet, what people say to each other, what people write in scientific papers, everything."}, {"time": 595, "text": "It feels like when COVID has been brought onto this world, everything changed in the way people feel about each other, just the way they communicate with each other."}, {"time": 611, "text": "I think the level of emotion involved, I think in many people, it brought out the worst in them."}, {"time": 620, "text": "For sometimes short periods of time and sometimes it was always therapeutic, like you were waiting to get out like the darkest parts of you, just to say, if you're angry at something in this world, I'm going to say it now."}, {"time": 631, "text": "And I think that's probably talking to some deep primal thing that fear we have for formalities of all different kinds."}, {"time": 641, "text": "And then when that fear is aroused in all the deepest emotions, it's like a Freudian psychotherapy session, but across the world."}, {"time": 651, "text": "It's something that psychologists are going to have a field day with for a generation trying to understand."}, {"time": 656, "text": "I mean, I think what you say is right, but piled on top of that is also this sort of, this impetus to empathy, the empathized compassion toward others, essentially militarized, right?"}, {"time": 671, "text": "So I'm protecting you by some actions and those actions, if I don't do them, if you don't do them, well, that must mean you hate me."}, {"time": 684, "text": "It's created this like social tension that I've never seen before."}, {"time": 687, "text": "And we looked at each other as if we were just simply sources of germs rather than people to get to know, people to enjoy, people to get to learn from."}, {"time": 701, "text": "It colored basically almost every human interaction for every human on the planet."}, {"time": 707, "text": "Yeah, the basic common humanity."}, {"time": 709, "text": "It's like you can wear a mask, you can stand far away, but the love you have for each other when you're looking into each other's eyes, that was dissipating by region too."}, {"time": 719, "text": "I've experienced having traveled quite a bit throughout this time."}, {"time": 723, "text": "It was really sad, even people that are really close together, just the way they stood, the way they looked at each other."}, {"time": 731, "text": "And it made me feel for a moment that the fabric that connects all of us is more fragile than I thought."}, {"time": 740, "text": "I mean, if you walk down the street, or if you ever, if you did this during COVID, I'm sure you had this experience where you walk down the street, if you're not wearing a mask, or even if you are, people will jump off the sidewalk that you walked past them, as if you're poison, even though the data are that COVID spreads indifferently outdoors, or if at all, really, outdoors."}, {"time": 761, "text": "But it's not simply a biological or infectious disease phenomenon, or epidemiological phenomenon."}, {"time": 766, "text": "It is a change in the way humans treated each other, I hope temporary."}, {"time": 772, "text": "I do wanna say on the flip side of that, so I was mostly in Boston, Massachusetts when the pandemic broke out."}, {"time": 779, "text": "I think that's where I was, yeah."}, {"time": 781, "text": "And then I came here to Austin, Texas to visit my now good friend, Joe Rogan, and he was the first person without pause, this wasn't a political statement, this was anything, just walked toward me and gave me a big hug and say, it's great to see you."}, {"time": 798, "text": "And I can't tell you how great it felt because I, in that moment, realized the absence of that connection back in Boston over just a couple of months."}, {"time": 806, "text": "And it's, we'll talk about it more, but it's tragic to think about that distancing, that dissolution of common humanity at scale, what kind of impact it has on society."}, {"time": 819, "text": "Just across the board, political division, and just in the quiet of your own mind, in the privacy of your own home, the depression, the sadness, the loneliness that leads to suicide."}, {"time": 831, "text": "And forget suicide, just low key suffering."}, {"time": 835, "text": "Yeah, no, I think that's the suffering, that isolation, we're not meant to live alone, we're not meant to live apart from one another."}, {"time": 842, "text": "I mean, that's, of course, the ideology of lockdown is to make people live apart, alone, isolated, so that we don't spread diseases to each other, right?"}, {"time": 850, "text": "But we're not actually designed as a species to live that way."}, {"time": 854, "text": "And that, what you're describing, I think, if everyone's honest with themselves, have felt, especially in places where lockdowns have been sort of very militantly enforced, has felt deep into their core."}, {"time": 866, "text": "Well, if I could just return to the question of deaths."}, {"time": 870, "text": "You said that the data isn't perfect, because we need these kind of seroprevalence surveys to understand how many cases there were to determine the rate of deaths."}, {"time": 879, "text": "And we need to have a strong footing in the number of deaths."}, {"time": 882, "text": "But if we assume that the number of deaths is approximately correct, like what's your sense, what kind of statements can we say about the deadliness of COVID across different demographics?"}, {"time": 895, "text": "Maybe not in a political way or in the current way, but when history looks back at this moment of time, 50 years from now, 100 years from now, the way we look at the pandemic 100 years ago, what will they say about the deadliness of COVID?"}, {"time": 912, "text": "I mean, I think the deadliness of COVID depends on not just the virus itself, but who it infects."}, {"time": 918, "text": "So probably the most important thing about it, about the deadliness of COVID, is this steep age gradient in the mortality rate."}, {"time": 926, "text": "So according to these seroprevalence studies that have been done, now hundreds of them, mostly from before vaccination, because vaccination also reduces the mortality risk of COVID, the seroprevalence studies suggest that the risk of death, if you're, say, over the age of 70, is very high."}, {"time": 947, "text": "You know, 5% if you get COVID."}, {"time": 950, "text": "If you're under the age of 70, it's lower, 0.05."}, {"time": 954, "text": "But there's not a single sharp cutoff."}, {"time": 956, "text": "It's more like, I have a rule of thumb that I use."}, {"time": 959, "text": "So if you're 50, say, the infection fatality rate from COVID is 0.2%, according to the seroprevalence data."}, {"time": 967, "text": "That means 99.8% survival if you're 50."}, {"time": 971, "text": "And for every seven years of age above that, double it."}, {"time": 974, "text": "Every seven years of age below that, halve it."}, {"time": 977, "text": "So a 57 year old would have a 0.4%."}, {"time": 980, "text": "Mortality, a 64 year old would have a 0.8% and so on."}, {"time": 984, "text": "And if you have a severe chronic disease, like diabetes or if you're morbidly obese, it's like adding seven years to your life."}, {"time": 992, "text": "And this is for unvaccinated folks?"}, {"time": 995, "text": "This is unvaccinated before Delta also."}, {"time": 998, "text": "Are there a lot of people that would be listening to this with PhDs at the end of their name that would disagree with the 99.8, would you say?"}, {"time": 1007, "text": "So I think there's some disagreement over this."}, {"time": 1009, "text": "And the disagreement is about the quality of the seroprevalence studies that were conducted."}, {"time": 1016, "text": "So as I said earlier, I was the senior investigator in three different seroprevalence studies very early in the epidemic."}, {"time": 1023, "text": "I view them as very high quality studies."}, {"time": 1027, "text": "In Santa Clara County, what we did is we used a test kit that we obtained from someone who works in major league baseball, actually."}, {"time": 1038, "text": "He had ordered these test kits very early in March, 2020, that measures, very accurately measures antibody levels, antibodies in the bloodstream."}, {"time": 1048, "text": "These test kits were eventually were approved by the, had an EUA by the emergency use authorization by the FDA, sort of shortly after we did this."}, {"time": 1057, "text": "And it had a very low false positive rate, false positive means if you don't have these COVID antibodies in your bloodstream, the kit shows up positive anyways."}, {"time": 1068, "text": "That turns out to happen about 0.5% of the time."}, {"time": 1072, "text": "And based on studies, a very large number of studies looking at blood from 2018, you try it against this kit, and 0.5% of the time, 2018, there shouldn't be antibodies there to COVID."}, {"time": 1085, "text": "So if it turns positive to false positives, 0.5% of the time."}, {"time": 1088, "text": "And then like a false negative rate, about 10%, 12%, something like that, I don't remember the exact number, but the false positive rate is the important thing there."}, {"time": 1098, "text": "So you have a population in March, 2020 or April, 2020, with very low fraction of patients having been exposed to COVID, you don't know how much, but low, even a small false positive rate could end up biasing your study quite a bit."}, {"time": 1114, "text": "But there's a formula to adjust for that."}, {"time": 1116, "text": "You can adjust for the false positive rate, false negative rate."}, {"time": 1118, "text": "We did that adjustment, and those studies found in a community population, so leaving aside people in nursing homes who have a higher death rate from COVID, the death rate was 0.2% in Santa Clara County and in LA County."}, {"time": 1133, "text": "Across all age groups in a community, community meaning just like regular folks."}, {"time": 1138, "text": "Yeah, so that's actually a real important question too."}, {"time": 1140, "text": "So the Santa Clara study, we did this Facebook sampling scheme, which is, I mean, not the ideal thing, but it was very difficult to get a random sample and during lockdown, where we put out an ad on Facebook soliciting people to volunteer for the study, randomly selected set of people."}, {"time": 1162, "text": "We were hoping to get a random selection of people from Santa Clara County, but it tended to, the people who tend to volunteer were from the richer parts of the county."}, {"time": 1168, "text": "Like I had Stanford professors writing, begging to be in the study because they wanted to know their antibody levels."}, {"time": 1174, "text": "So we did some adjustment for that."}, {"time": 1176, "text": "In LA County, we hired a firm that had a preexisting representative sample of LA County."}, {"time": 1184, "text": "But it didn't include nursing homes, it didn't include people in jail, things like that, didn't include the homeless populations."}, {"time": 1189, "text": "So it's representative of a community dwelling population, both of those."}, {"time": 1194, "text": "And there we found that both in LA County and Santa Clara County in April, 2020, something like 40 to 50 times more infections than cases in both places."}, {"time": 1206, "text": "So for every case that had been reported to the public health authorities, we found 40 or 50 other infections, people with antibodies in their blood that suggested that they'd had COVID and recovered."}, {"time": 1220, "text": "So people were not reporting, or severe, at least in those days, underreporting."}, {"time": 1225, "text": "Yeah, I mean, there was testing problem."}, {"time": 1226, "text": "I mean, there weren't so many tests available."}, {"time": 1229, "text": "People didn't know."}, {"time": 1230, "text": "A lot of them, we asked a set of questions about the symptoms they'd faced, and most of them said they'd faced no symptoms, or at the most, 30, 40% of them said they'd faced no symptoms."}, {"time": 1240, "text": "And I mean, even these days, how many people report that they get COVID when they get COVID?"}, {"time": 1245, "text": "Okay, have those numbers, that 0.2%, has that approximately held up over time?"}, {"time": 1251, "text": "That is, so Professor John Ioannidis, who's a colleague of mine at Stanford, is a world expert in meta now, so probably the most cited scientist on Earth, I think, at least living."}, {"time": 1261, "text": "He did a meta analysis of now 100 or more of these seroprevalence studies."}, {"time": 1268, "text": "And what he found was that that 0.2% is roughly the worldwide number."}, {"time": 1273, "text": "In fact, I think he cites this lower number, 0.15%, as the median infection fatality rate worldwide."}, {"time": 1280, "text": "So we did these studies, and it generated an enormous amount of blowback by people who thought that the infection fatality rate is much higher."}, {"time": 1288, "text": "And there's some controversy over the quality of some of the other studies that are done."}, {"time": 1292, "text": "And so there are some people who look at this same literature and say, well, the lower quality studies tend to have lower IFRs."}, {"time": 1299, "text": "The higher quality studies."}, {"time": 1300, "text": "IFR?"}, {"time": 1301, "text": "Oh, infection fatality rate, I apologize."}, {"time": 1303, "text": "I do this in lectures, too, I apologize."}, {"time": 1305, "text": "And I'm going to rudely interrupt you and ask for the basics sometimes, if it's okay."}, {"time": 1312, "text": "So these higher quality studies, they say, tend to produce higher IFR."}, {"time": 1316, "text": "But the problem is that if you want a global infection fatality rate, you need to get seroprevalence studies from everywhere, even in places that don't necessarily have the infrastructure set up to produce very, very high quality studies."}, {"time": 1329, "text": "And in poor places in the world, places like Africa, the infection fatality rate is incredibly low."}, {"time": 1340, "text": "And in some richer places, like New York City, the infection fatality rate is much higher."}, {"time": 1345, "text": "There's a range of IFRs, not a single number."}, {"time": 1350, "text": "This sometimes surprises people, because they think, well, it's a virus, it should have the same properties no matter where it goes."}, {"time": 1356, "text": "But the virus kills or infects or hurts in interaction with the host."}, {"time": 1364, "text": "And the properties of both the host and the virus combine to produce the outcome."}, {"time": 1370, "text": "But you also mentioned the environment, too?"}, {"time": 1373, "text": "Well, I'm thinking mainly just about the person."}, {"time": 1375, "text": "Like if I'm gonna think about it, the most simplest way to think about it is age."}, {"time": 1378, "text": "Age is the single most important risk factor."}, {"time": 1381, "text": "So older places are going to have a higher IFR than younger places."}, {"time": 1387, "text": "Africa, 3% of Africa is over 65."}, {"time": 1390, "text": "So in some sense, it's not surprising that they have a low infection fatality rate."}, {"time": 1395, "text": "So that's one way you would explain the difference between Africa and New York City in terms of the fatality rate, is the age, the average age?"}, {"time": 1402, "text": "Yeah, and especially in the early days of the epidemic in New York City, the older populations living in nursing homes were differentially infected based on, because of policies that were adopted, to send COVID infected patients back to nursing homes to keep hospitals empty."}, {"time": 1420, "text": "What do you mean by differentially infected?"}, {"time": 1422, "text": "The policy that you adopt determines who is most exposed."}, {"time": 1428, "text": "So that's what I mean by different."}, {"time": 1429, "text": "The policy, it's the person that matters."}, {"time": 1432, "text": "I mean, it's not like the virus just kind of doesn't care."}, {"time": 1436, "text": "I mean, the policy determines the nature of the interaction."}, {"time": 1439, "text": "And there's also, I mean, there is some contribution from the environment, different regions have different proximity maybe of people interacting or the dynamics of the way they interact."}, {"time": 1450, "text": "Yeah, like if you have situations where there's lots of intergenerational interactions, then you have a very different risk profile than if you have societies that are where generations are more separate from one another."}, {"time": 1465, "text": "Okay, so let me just finish real fast about this."}, {"time": 1467, "text": "So you have in New York, you have a population that was infected in the early days that was very likely going to die, had a much higher likelihood of dying if infected."}, {"time": 1480, "text": "And so New York City had a higher IFR, especially in the early days than like Africa has had."}, {"time": 1489, "text": "The other thing is treatment, right?"}, {"time": 1490, "text": "So the treatments that we adopted in the early days of the epidemic, I think actually may have exacerbated the risk of death."}, {"time": 1498, "text": "Which treatments?"}, {"time": 1500, "text": "Using ventilators, like the over reliance on ventilators is what I'm primarily thinking of, but I can think of other things."}, {"time": 1506, "text": "But that also we've learned over time how better to manage patients with the disease."}, {"time": 1512, "text": "So you have all those things combined."}, {"time": 1514, "text": "So that's where the controversy over this number is."}, {"time": 1518, "text": "I mean, New York City also is a central hub for those who tweet and those who write powerful stories and narratives in article form."}, {"time": 1531, "text": "And I remember those quite dramatic stories about sort of doctors in the hospitals and these kinds of things."}, {"time": 1537, "text": "I mean, there's very serious, very dramatic, very tragic deaths going on always in hospitals."}, {"time": 1544, "text": "Those stories, loved ones losing each other on a deathbed, that's always tragic."}, {"time": 1552, "text": "And you can always write a hell of a good story about that."}, {"time": 1555, "text": "And you should, about the loss of loved ones."}, {"time": 1558, "text": "But they were doing it pretty well, I would say, over this kind of dramatic deaths."}, {"time": 1564, "text": "And so in response to that, it's very unpleasant to hear, even to consider the possibility that the death rate is not as high as you might feel."}, {"time": 1577, "text": "Yeah, I was surprised by the reaction, both by regular people and also the scientific community in response to those studies, those early studies in April of 2020."}, {"time": 1589, "text": "To me, they were studies."}, {"time": 1591, "text": "I mean, they're the kinds of, not exactly the kinds of work I've worked on all my life, but kind of like the kind of, you write a paper and you get responses from your fellow scientists and you change the paper to improve it, you hopefully learn something from it."}, {"time": 1607, "text": "Well, but to push back, it's just a study."}, {"time": 1610, "text": "But there's some studies, and this is kind of interesting, because I've received similar pushback on other topics."}, {"time": 1619, "text": "There's some studies that, if wrong, might have wide ranging detrimental effects on society."}, {"time": 1629, "text": "So that's the way they would perceive the studies."}, {"time": 1632, "text": "If you say the death rate is lower, and you end up, as you often do in science, realizing that, nope, that was a flaw in the way the study was conducted, or we're just not representative of a broader population, and then you realize the death rate is much higher, that might be very damaging in people's view."}, {"time": 1649, "text": "So that's probably where the scientific community sort of just steel man the kind of response, is that's where they felt like, there's some findings where you better be damn sure before you kind of report them."}, {"time": 1665, "text": "Yeah, I mean, we were pretty sure we were right, and it turns out we were right."}, {"time": 1668, "text": "So we released the Santa Clara study via this open science process and this server called MedArchive."}, {"time": 1679, "text": "It's designed for releasing studies that have not yet been peer reviewed in order to garner comment from the scientists before peer review."}, {"time": 1688, "text": "The LA County study, we went through this traditional peer review process and got it published in the Journal of American Medical Association sometime in like July, I think, I forget the date, of 2020."}, {"time": 1699, "text": "The Santa Clara study released in April of 2020 in this sort of working paper archive."}, {"time": 1705, "text": "The reason was that we felt we had an obligation, we had a result that we thought was quite important, and we wanted to tell the scientific community about it and also tell the world about it."}, {"time": 1716, "text": "And we wanted to get feedback."}, {"time": 1718, "text": "I mean, that's part of the purpose of sending it to these kinds of places."}, {"time": 1722, "text": "I think a lot of the problem is that when people think about published science, they think of it as automatically true."}, {"time": 1730, "text": "And if it goes through peer review, it's automatically true."}, {"time": 1732, "text": "If it hasn't gone through peer review, it's not automatically true."}, {"time": 1734, "text": "And especially in medicine, when we're not used to having this access to pre peer reviewed work."}, {"time": 1743, "text": "I mean, in economics, actually, that's quite normal."}, {"time": 1745, "text": "You takes years to get something published."}, {"time": 1747, "text": "So there's a very active debate over or discussion about papers before they're peer reviewed in this sort of working paper way, much less normal or much newer in medicine."}, {"time": 1760, "text": "And so I think part of that, the perception about what process happens in open science when you release a study, that got people confused."}, {"time": 1769, "text": "And you're right, it was a very important result because we had just locked the world down in middle of March with, I think, catastrophic results."}, {"time": 1778, "text": "And if that study was right, if our study was right, that meant we'd made a mistake."}, {"time": 1784, "text": "And not because the death rate was low, that's actually not the key thing there."}, {"time": 1787, "text": "The key thing is that we had adopted these policies, these test and trace policies, these policies, these lockdown policies aimed at suppressing the virus level to close to zero."}, {"time": 1800, "text": "That was essentially the idea."}, {"time": 1801, "text": "If we can just get the virus to go away, we won't have to ever worry about it again."}, {"time": 1807, "text": "The main problem with our result as far as that strategy was concerned wasn't the death rate, it was the 40 to 50 times more infections than cases."}, {"time": 1814, "text": "It was the 2.5% or 3% or 4% prevalence rate that we identified of the antibodies in the population."}, {"time": 1823, "text": "If that number is right, it's too late."}, {"time": 1825, "text": "The virus is not going to go to zero."}, {"time": 1828, "text": "And no matter how much we test and trace and isolate, we're not going to get the viral level down to zero."}, {"time": 1834, "text": "So we're gonna have to let the virus go through the entire population in some way or some other?"}, {"time": 1839, "text": "We can talk about that in a bit."}, {"time": 1841, "text": "That's the Great Barrington Declaration."}, {"time": 1842, "text": "You don't have to let the virus go through the population."}, {"time": 1844, "text": "You can shield preferentially."}, {"time": 1846, "text": "The policy we chose was to shield preferentially the laptop class, the set of people who could work from home without losing their job."}, {"time": 1856, "text": "And we did a very good job at protecting them."}, {"time": 1859, "text": "Well, let me take a small tangent."}, {"time": 1864, "text": "We're gonna jump around in time, which I think will be the best way to tell the story."}, {"time": 1869, "text": "So that was the beginning."}, {"time": 1870, "text": "Yeah, okay, actually, can I go back one more thing for that?"}, {"time": 1873, "text": "Because that's really important and I should have started with this."}, {"time": 1877, "text": "What led me to do those studies was a paper that I had remembered seeing from the H1N1 flu epidemic in 2009."}, {"time": 1886, "text": "This is where I've been much less active in writing about that."}, {"time": 1889, "text": "I had written like a paper or two about that in 2009."}, {"time": 1894, "text": "There was actually the same debate over the mortality rate, except it unfolded over the course of three years, two or three years."}, {"time": 1903, "text": "The early studies of the mortality rate in H1N1 counted the number of cases in the denominator, counted the number of deaths in the numerator, cases meaning people identified as having H1N1, showing up the doctor, tested to have it."}, {"time": 1920, "text": "And the earliest estimates of the H1N1 mortality were like 4%, 3%, really, really high."}, {"time": 1928, "text": "Over the course of a couple of more years, a whole bunch of seroprevalence studies, seroprevalence studies of H1N1 flu came out."}, {"time": 1935, "text": "And it turned out that there were 100 or more times people infected per case."}, {"time": 1943, "text": "And so the mortality rate was actually something like 0.02% for H1N1, not the three, like 100 fold difference."}, {"time": 1952, "text": "So this made you think, okay, it took us a couple of two or three years to discover the truth behind the actual infections for H1N1, and then what's the truth here and can we get there faster?"}, {"time": 1965, "text": "Yeah, and it spreads in a similar way as the H1N1 flu did."}, {"time": 1969, "text": "I mean, it spreads via solization, via person to person breathing, kind of contact up."}, {"time": 1975, "text": "It may be some by fomites, but it seems less likely now."}, {"time": 1979, "text": "In any case, it seemed really important to me to speed up the process of having those seroprevalence studies so that we can better understand who was at risk and what the right strategy ought to be."}, {"time": 1992, "text": "This might be a good place to kind of compare influenza, the flu, and COVID in the context of the discussion we just had, which is how deadly is COVID?"}, {"time": 2004, "text": "So you mentioned COVID is a very particular kind of steepness, where the X axis is age."}, {"time": 2012, "text": "So in that context, could you maybe compare influenza and COVID, because a lot of people outside the folks who suggest that the lizards who run the world have completely fabricated and invented COVID, outside of those folks, kind of the natural process by which you dismiss the threat of COVID is, say, well, it's just like the flu."}, {"time": 2035, "text": "The flu is a very serious thing, actually."}, {"time": 2038, "text": "So in that comparison, where does COVID stand?"}, {"time": 2043, "text": "Yeah, the flu is a very serious thing."}, {"time": 2044, "text": "It kills 50, 60,000 people a year, something I found out, depending on the particular strain that goes around, that's in the United States."}, {"time": 2052, "text": "The primary difference to me, there's lots of differences, but one of the most salient differences is the age gradient and mortality risk for the flu."}, {"time": 2061, "text": "So the flu is more deadly to children than COVID is."}, {"time": 2066, "text": "There's no controversy about that."}, {"time": 2069, "text": "Children, thank God, have much less severe reactions to COVID infection than they do to flu infections."}, {"time": 2079, "text": "And rate of fatalities and stuff like that."}, {"time": 2081, "text": "Rate of fatality, all of that."}, {"time": 2082, "text": "I think you mentioned, I mean, it's interesting to maybe also comment on, I think in another conversation you mentioned there's a U shape to the flu curve, so meaning there's actually quite a large number of kids that die from flu."}, {"time": 2099, "text": "Yeah, I mean, the 1918 flu, the H1N1 flu, the Spanish flu in the US killed millions of younger people."}, {"time": 2109, "text": "And that is not the case with COVID."}, {"time": 2113, "text": "More than, I'm gonna get the number wrong, but something like 70, 80% of the deaths are people over the age of 60."}, {"time": 2121, "text": "Well, we've talked about the fear the whole time, really."}, {"time": 2124, "text": "But my interaction with folks, now I wanna have a family, I wanna have kids, but I don't have that real firsthand experience, but my interaction with folks is at the core of fear that folks had is for their children."}, {"time": 2139, "text": "Like that somehow I don't wanna get infected because of the kids."}, {"time": 2147, "text": "Because God forbid something happens to the kids."}, {"time": 2150, "text": "And I think that obviously that makes a lot of sense this kind of the kids come first no matter what, that's number one priority."}, {"time": 2158, "text": "But for this particular virus, that reasoning was not grounded in data, it seems like, or that emotion and feeling was not grounded in data."}, {"time": 2169, "text": "But at the same time, this is way more deadly than the flu just overall, and especially to older people."}, {"time": 2177, "text": "The numbers, when the story is all said and done, COVID would take many more lives."}, {"time": 2184, "text": "Yeah, so, I mean, 0.2 sounds like a small number, but it's not a small number worldwide."}, {"time": 2189, "text": "What do you think that number will be by the, you know, that's not like me, but would we cross, I think it's in the United States, it's the way the deaths are currently reported, it's like 800,000, something like that."}, {"time": 2202, "text": "Do you think we'll cross a million?"}, {"time": 2204, "text": "Seems likely, yeah."}, {"time": 2206, "text": "Do you think it's something that might continue with different variants, what?"}, {"time": 2210, "text": "Well, I think, so we can talk about the end state of COVID."}, {"time": 2213, "text": "The end state of COVID is it's here forever."}, {"time": 2216, "text": "I think that there is good evidence of immunity after infection, such that you're protected both against reinfection and also against severe disease upon reinfection."}, {"time": 2231, "text": "So the second time you get it, it's not true for everyone, but for many people, the second time you get it will be milder, much milder than the first time you get it."}, {"time": 2238, "text": "With the long tail, like that lasts for a long time."}, {"time": 2242, "text": "Yeah, so just, there are studies that follow, of course, people who are infected for a year, and the reinfection rate is something like somewhere between 0.3 and 1%."}, {"time": 2253, "text": "And like a pretty fantastic study out in Italy has found that, there's one in Sweden, I think, there's a few studies that have found similar things."}, {"time": 2261, "text": "And the reinfections tend to produce much milder disease, much less likely to end up in the hospital, much less likely to die."}, {"time": 2270, "text": "So what the end state of COVID is, it's circulating the population forever and you get it multiple times."}, {"time": 2276, "text": "Yeah, and then there's, I think, studies and discussions like the best protection would be to get it and then also to get vaccinated."}, {"time": 2286, "text": "And then a lot of people push back against that for the obvious reasons from both sides, because somehow the discourse has become less scientific and more political."}, {"time": 2294, "text": "Well, I think you wanna, the first time you meet it is gonna be the most deadly for you."}, {"time": 2300, "text": "And so the first time you meet it, it's just wise to be vaccinated."}, {"time": 2302, "text": "The vaccine reduces severe disease."}, {"time": 2305, "text": "Yeah, we'll talk about the vaccine, because I wanna make sure I address it carefully and properly and in full context."}, {"time": 2315, "text": "But yes, sort of to add to the context, a lot of the fascinating discussions we're having is in the early days of COVID and now for people who are unvaccinated."}, {"time": 2326, "text": "That's where the interesting story is."}, {"time": 2329, "text": "The policy story, the sociological story and so on."}, {"time": 2332, "text": "But let me go to something really fascinating just because of the people involved, the human beings involved, and because of how deeply I care about science and also kindness, respect and love and human things."}, {"time": 2347, "text": "Francis Collins wrote a letter in October 2020 to Anthony Fauci and I think somebody else."}, {"time": 2355, "text": "I have the letter, oh, it's not a letter, email, I apologize."}, {"time": 2360, "text": "Hi, Tony and Cliff, cgbdeclaration.org."}, {"time": 2369, "text": "This proposal, this is the Great Barrington Declaration that you're a coauthor on."}, {"time": 2374, "text": "This proposal from the three fringe epidemiologists who met with the secretary seem to be getting a lot of attention and even a co signature from Nobel Prize winner, Mike Levitt at Stanford."}, {"time": 2388, "text": "There needs to be a quick and devastating published take down of its premises."}, {"time": 2394, "text": "I don't see anything like that online yet."}, {"time": 2397, "text": "Is it underway, question mark, Francis."}, {"time": 2400, "text": "Francis Collins, director of the NIH, somebody I talked to on this podcast recently."}, {"time": 2406, "text": "Okay, a million questions I wanna ask."}, {"time": 2409, "text": "But first, how did that make you feel when you first saw this email come to light, when did it come to light?"}, {"time": 2420, "text": "This week, actually, I think, or last week."}, {"time": 2422, "text": "Okay, so this is because of freedom of information."}, {"time": 2426, "text": "Which, by the way, sort of maybe, because I do wanna add positive stuff on the side of Francis here."}, {"time": 2436, "text": "Boy, when I see stuff like that, I wonder if all my emails leaked, how much embarrassing stuff."}, {"time": 2443, "text": "Like, I think I'm a good person, but I haven't read my old emails."}, {"time": 2449, "text": "Maybe, I'm pretty sure sometimes I could be an asshole."}, {"time": 2453, "text": "Well, I mean, look, he's a Christian, and I'm a Christian, I'm supposed to forgive, right?"}, {"time": 2457, "text": "I mean, I think he was looking at this Great Barrington Declaration as a political problem to be solved, as opposed to a serious alternative approach to the epidemic."}, {"time": 2469, "text": "So maybe we'll talk about it in more detail, but just in case people are not familiar, Great Barrington Declaration was a document that you coauthored that basically argues against this idea of lockdown as a solution to COVID, and you propose another solution that we'll talk about."}, {"time": 2489, "text": "But the point is, it's not that dramatic of a document, it is just a document that criticizes one policy solution that was proposed."}, {"time": 2498, "text": "But it was the policy solution that had been put forward by Dr. Collins and by Tony Fauci, and a few other science, I mean, I think a relatively small number of scientists and epidemiologists in charge of the advice given to governments worldwide."}, {"time": 2516, "text": "And it was a challenge to that policy that said that, look, there is an alternate path, that the path we've chosen, this path of lockdown with the aim to suppress the virus to zero effectively, I mean, that was unstated."}, {"time": 2531, "text": "Cannot work and is causing catastrophic harm to large numbers of poor and vulnerable people worldwide."}, {"time": 2539, "text": "We put this out in October 4th, I think, of 2020, and it went viral."}, {"time": 2545, "text": "I mean, I've never actually been involved with anything like this, where I just put the document on the web, and tens of thousands of doctors signed on, hundreds of thousands of regular people signed on."}, {"time": 2557, "text": "It really struck a chord of people, because I think even by October of 2020, people had this sense that there was something really wrong with the COVID policy that we've been following."}, {"time": 2568, "text": "And they were looking for reasonable people to give an alternative."}, {"time": 2572, "text": "I mean, we're not arguing that COVID isn't a serious thing."}, {"time": 2576, "text": "I mean, it is a very serious thing."}, {"time": 2577, "text": "This is why we had a policy that aimed at addressing it."}, {"time": 2583, "text": "But we were saying that the policy we're following is not the right one."}, {"time": 2586, "text": "So how does a democratic government deal with that challenge?"}, {"time": 2592, "text": "So to me, that, you asked me how I felt."}, {"time": 2594, "text": "I was actually, frankly, just, I suspected there'd been some email exchanges like that, not necessarily from Francis Collins, around the government around this time."}, {"time": 2604, "text": "I mean, I felt the full brunt of a propaganda campaign almost immediately after we published it, where newspapers mischaracterized it in the same way over and over and over again, and sought to characterize me as sort of a marginal fringe figure or whatnot."}, {"time": 2625, "text": "Sunetra Gupta, Martin Kulldorff, or the tens of thousands of other people that signed it."}, {"time": 2630, "text": "I felt the brunt of that all year long."}, {"time": 2633, "text": "So to see this in black and white, in the handwriting, essentially, I mean, the metaphorical handwriting of Francis Collins was actually, frankly, a disappointment, because I've looked up to him for years."}, {"time": 2645, "text": "Yeah, I've looked up to him as well."}, {"time": 2647, "text": "I mean, I look for the best in people, and I still look up to him."}, {"time": 2655, "text": "What troubles me is several things."}, {"time": 2659, "text": "The reason I said about the asshole emails I send late at night is I can understand this email."}, {"time": 2668, "text": "It's fear, it's panic, not being sure."}, {"time": 2674, "text": "The fringe, three fringe epidemiologists."}, {"time": 2677, "text": "Plus Mike Leavitt, who won a Nobel Prize, I mean."}, {"time": 2680, "text": "But using fringe, maybe in my private thoughts, I have said things like that about others, like a little bit too unkind."}, {"time": 2690, "text": "Like, you don't really mean it."}, {"time": 2692, "text": "Now, add to that, he recently, this week, whatever, doubled down on the fringe."}, {"time": 2700, "text": "This is really troubling to me, that I can excuse this email, but the arrogance there, Francis, honestly, I mean, broke my heart a little bit there."}, {"time": 2712, "text": "This was an opportunity to, especially at this stage, to say, just like I told him, to say I was wrong to use those words in that email."}, {"time": 2723, "text": "I was wrong to not be open to ideas."}, {"time": 2727, "text": "I still believe that this is not, like, say, like, actually argue with the proposal, with the policy, the proposed solution."}, {"time": 2736, "text": "Also, the devastating published, devastating takedown, devastating takedown."}, {"time": 2745, "text": "As you say, somebody who's sitting on billions of dollars that they're giving to scientists, some of whom are often not their best human beings because they're fighting with each other over money, not being cognizant of the fact that you're challenging the integrity, you're corrupting the integrity of scientists by allocating them money, you're now playing with that by saying devastating takedown."}, {"time": 2775, "text": "Where do you think the published takedown will come from?"}, {"time": 2779, "text": "It will come from those scientists to whom you're giving money."}, {"time": 2783, "text": "What kind of example would they give to the academic community that thrives on freedom?"}, {"time": 2788, "text": "Like, this is, I believe Francis Collins is a great man."}, {"time": 2794, "text": "One of the things I was troubled by is the negative response to him from people that don't understand the positive impact that NIH has had on society, how many people it's helped."}, {"time": 2805, "text": "But this is exactly the, so he's not just a scientist."}, {"time": 2810, "text": "He's not just a bureaucrat who distributes money."}, {"time": 2813, "text": "He's also a scientific leader that in difficult times we live in, is supposed to inspire us with trust, with love, with the freedom of thought."}, {"time": 2824, "text": "He's supposed to, you know those fringe epidemiologists?"}, {"time": 2828, "text": "Those are the heroes of science."}, {"time": 2830, "text": "When you look at the long arc of history, we love those people."}, {"time": 2835, "text": "We love ideas, even when they get proven wrong."}, {"time": 2838, "text": "That's what always attracted me to science."}, {"time": 2840, "text": "Like somebody, the lone voice saying, oh no, the moon of Jupiter does move."}, {"time": 2849, "text": "But the funny thing is, Galileo was saying something truly revolutionary."}, {"time": 2852, "text": "We were saying that what we proposed in the Great Barbarian Declaration was actually just the old pandemic plan."}, {"time": 2858, "text": "It wasn't anything really fundamentally novel."}, {"time": 2862, "text": "In fact, there were plans like this that lockdown scientists had written in late February, early March of 2020."}, {"time": 2872, "text": "So we were not saying anything radical."}, {"time": 2874, "text": "We were just calling for a debate effectively over the existing lockdown policy."}, {"time": 2880, "text": "And this is a disappointment, a really, truly a big disappointment because by doing this, you were absolutely right, Lex."}, {"time": 2888, "text": "He sent a signal to so many other scientists to just stay silent, even if you had reservations."}, {"time": 2895, "text": "Yeah, devastating take down that people, you know how many people wrote to me privately, like Stanford, MIT, how amazing the conversation with Francis Collins was?"}, {"time": 2908, "text": "There's a kind of admiration because, okay, how do I put it?"}, {"time": 2913, "text": "A lot of people get into science because they wanna help the world."}, {"time": 2920, "text": "They get excited by the ideas and they really are working hard to help in whatever the discipline is."}, {"time": 2927, "text": "And then there is sources of funding which help you do help at a larger scale."}, {"time": 2933, "text": "So you admire the people that are distributing the money because they're often, at least on the surface, are really also good people."}, {"time": 2942, "text": "Oftentimes they're great scientists."}, {"time": 2944, "text": "So like, it's amazing."}, {"time": 2946, "text": "That's why I'm sort of, like sometimes people from outside think academia is broken some kind of way."}, {"time": 2954, "text": "No, it's a beautiful thing."}, {"time": 2956, "text": "It really is a beautiful thing."}, {"time": 2957, "text": "And that's why it's so deeply heartbreaking where this person is, I don't think this is malevolence."}, {"time": 2966, "text": "I think he's just incompetence of communication twice."}, {"time": 2971, "text": "I think there's also arrogance at the bottom of it too."}, {"time": 2974, "text": "But all of us have arrogance at the bottom."}, {"time": 2976, "text": "There's a particular kind of arrogance."}, {"time": 2978, "text": "So here it's of the same kind of arrogance that you see when Tony Fauci gets on TV and says that if you criticize me, you're not simply criticizing a man, you're criticizing science itself."}, {"time": 2991, "text": "That is at the heart also of this email."}, {"time": 2995, "text": "The certainty that the policies that they were recommending, Collins and Fauci were recommending to the president of the United States were right."}, {"time": 3003, "text": "Not just right, but right so far right that any challenge whatsoever to it is dangerous."}, {"time": 3011, "text": "And I think that is really the heart of that email."}, {"time": 3013, "text": "It's this idea that my position is unchallengeable."}, {"time": 3019, "text": "Now to be completely, to be as charitable as I can be to this, I believe they thought that."}, {"time": 3025, "text": "I believe some of them still think that, that there was only one true policy possible in response to COVID."}, {"time": 3032, "text": "Every other policy was immoral."}, {"time": 3036, "text": "And if you come from that position, then you write an email like that."}, {"time": 3039, "text": "You go on TV, you say effectively la science est moi, right?"}, {"time": 3042, "text": "I mean, that is what happens when you have this sort of unchallengeable arrogance that the policy you're following is correct."}, {"time": 3050, "text": "I mean, when we wrote the Great Bank Declaration, what I was hoping for was a discussion about how to protect the vulnerable."}, {"time": 3057, "text": "I mean, that was the key idea to me in the whole thing was better protection of the older population who were really at really serious risk if infected with COVID."}, {"time": 3066, "text": "And we had been doing a very poor job, I thought, to date in many places in protecting the vulnerable."}, {"time": 3072, "text": "And what I wanted was a discussion by local public health about better methods, better policies to protect the vulnerable."}, {"time": 3080, "text": "So when we were met with instead a series of essentially propagandist lies about it."}, {"time": 3087, "text": "So for instance, I kept hearing from reporters in those days, why do you want to let the virus rip?"}, {"time": 3093, "text": "Let it rip, let it rip."}, {"time": 3094, "text": "The words let it rip does not appear in the Great Bank Declaration."}, {"time": 3100, "text": "The goal isn't to let the virus rip."}, {"time": 3102, "text": "The goal is to protect the vulnerable, to let society go open schools and do other things that function as best it can in the midst of a terrible pandemic, yes, but not let the virus rip where the most vulnerable aren't protected."}, {"time": 3118, "text": "The goal was to protect the vulnerable."}, {"time": 3120, "text": "So why let it rip?"}, {"time": 3121, "text": "Because it was a propaganda term to hit the fear centers of people's brains."}, {"time": 3126, "text": "Oh, these people are immoral."}, {"time": 3128, "text": "They just want to let the virus go through society and hurt everybody."}, {"time": 3131, "text": "That was the idea."}, {"time": 3132, "text": "It was a way to preclude a discussion and preclude a debate about the existing policy."}, {"time": 3139, "text": "So this is an app called Clubhouse."}, {"time": 3143, "text": "I've gone back on it recently to practice Russian, unrelated for a few big Russian conversations coming up."}, {"time": 3152, "text": "Anyway, it's a great way to talk to regular people in Russian."}, {"time": 3155, "text": "But I also, I was nervous."}, {"time": 3157, "text": "I was preparing for a Pfizer CEO conversation and there was a vaccine room and so I joined it."}, {"time": 3163, "text": "And it was a pro science room."}, {"time": 3169, "text": "These are like scientists that were calling each other pro science."}, {"time": 3172, "text": "The whole thing was like theater to me."}, {"time": 3175, "text": "I mean, I haven't thoroughly researched, but looking at the resume, they were like pretty solid researchers and doctors."}, {"time": 3184, "text": "And they were mocking everybody who was at all, I mean, it doesn't matter what they stood for, but they were just mocking people and the arrogance was overwhelming."}, {"time": 3195, "text": "I had to shut off because I couldn't handle that human beings can be like this to each other."}, {"time": 3201, "text": "And then I went back just to double check, is this really happening?"}, {"time": 3205, "text": "How many people are here?"}, {"time": 3206, "text": "Is this theater?"}, {"time": 3208, "text": "And then I asked to come on stage on Clubhouse to make a couple of comments."}, {"time": 3212, "text": "And then as I opened my mouth, I said, thank you so much."}, {"time": 3216, "text": "This is a great room, sort of the usual civil politeness, all that kind of stuff."}, {"time": 3221, "text": "And I said, I'm worried that the kind of arrogance with which things are being discussed here will further divide us, not unite us."}, {"time": 3235, "text": "And before I said even the unite us, further divide us, I was thrown off stage."}, {"time": 3242, "text": "Now, this isn't why I mentioned platform, but like I am like Lex Friedman, MIT, also, which is something those people seem to sometimes care about, followers and stuff like that."}, {"time": 3255, "text": "Like, did you just do that?"}, {"time": 3258, "text": "And then they said, enough of that nonsense."}, {"time": 3261, "text": "Enough of that nonsense."}, {"time": 3262, "text": "They said to me, enough of that nonsense."}, {"time": 3267, "text": "Somebody who is obviously interviewed, Francis Collins, is the Pfizer CEO."}, {"time": 3275, "text": "To bring you on, French epidemiologist also, so just."}, {"time": 3278, "text": "But this broke my heart, the arrogance."}, {"time": 3280, "text": "And this is, echoes of that arrogance is something you see in this email."}, {"time": 3284, "text": "And I really would love to have a million things to talk about to try to figure out how can we find a path forward?"}, {"time": 3290, "text": "I think a lot of the problems we've seen in the discussion over COVID, and especially in the scientific community, there's two ways to look at science, I think, that have been competing with each other for a while now."}, {"time": 3305, "text": "One way, and this is the way that I view science and why I've always found it so attractive, is an invitation to a structured discussion where the discussion is tempered by evidence, by data, by reasoning and logic, right?"}, {"time": 3322, "text": "So it's a dialectical process where if I believe A and you believe B, well, we talk about it."}, {"time": 3329, "text": "We come up with an experiment that distinguishes between the two."}, {"time": 3332, "text": "And while B turns out to be right, I'm all frustrated, but I buy you dinner and I say, no, no, no, no, C. And then we go on from there, right?"}, {"time": 3340, "text": "That's what science is at its best."}, {"time": 3343, "text": "It's this process of using data in discussion."}, {"time": 3346, "text": "It's a human activity, right?"}, {"time": 3348, "text": "To learn, to have the truth unfold itself before us."}, {"time": 3354, "text": "On the other hand, there's another way that people have used science or thought about science as truth in and of itself, right?"}, {"time": 3363, "text": "Like if it's science, therefore it's true automatically."}, {"time": 3367, "text": "And what does the science say to do?"}, {"time": 3370, "text": "Well, the science never says to do anything."}, {"time": 3372, "text": "The science says, here's what's true."}, {"time": 3373, "text": "And then we have to apply our human values to say, okay, well, if we do this, then this is likely to happen."}, {"time": 3381, "text": "That's what the science says."}, {"time": 3383, "text": "If we do that, then that is likely to happen."}, {"time": 3385, "text": "Well, we'd rather have this than that, right?"}, {"time": 3387, "text": "But science doesn't tell us that we'd rather have this than that."}, {"time": 3390, "text": "It's our human values that tell us that we'd rather have this than that."}, {"time": 3392, "text": "Science plays a role, but it's not the only thing."}, {"time": 3396, "text": "It's not the only role."}, {"time": 3396, "text": "It's like, it helps understand the constraints we face, but it doesn't tell us what to do in face of those constraints."}, {"time": 3403, "text": "But underneath it, at the individual level, at the institutional level, it seems like arrogance is really destructive."}, {"time": 3412, "text": "So the flip side of that, the productive thing is humility."}, {"time": 3415, "text": "So sort of always not being sure that you're right."}, {"time": 3423, "text": "This is actually kind of, Stuart Russell talks about this for AI research."}, {"time": 3427, "text": "How do you make sure that AI, super intelligent AI doesn't destroy us?"}, {"time": 3431, "text": "You built in a sort of module within it that it always doubts its actions."}, {"time": 3438, "text": "Like, it's not sure."}, {"time": 3440, "text": "Like, I know it says I'm supposed to destroy all humans, but maybe I'm wrong."}, {"time": 3444, "text": "And that maybe I'm wrong is essential for progress, for actually doing in the long arc of history better, not the perfect thing, but better and better and better and better."}, {"time": 3453, "text": "I mean, the question I have here for you is this, this email so clearly captures some maybe echo, but maybe a core to the problem."}, {"time": 3464, "text": "Do you put responsibility of this email, of the shortcomings and failures on individuals or institutions?"}, {"time": 3472, "text": "Is this Francis Collins, Anthony?"}, {"time": 3473, "text": "No, this is an institutional failure, right?"}, {"time": 3475, "text": "So the NIH, so I've had two decades of NIH funding."}, {"time": 3479, "text": "I've sat on NIH review panels."}, {"time": 3481, "text": "The purpose of the NIH is what you said earlier, Lex."}, {"time": 3483, "text": "The purpose of the NIH is to support the work of scientists."}, {"time": 3488, "text": "To some extent, it's also to help scientists, to direct scientists to work on things that are very important for public health or for the health of the public."}, {"time": 3497, "text": "So, and the way you do that is you say, okay, we're gonna put $50 million on the research in Alzheimer's disease this year or $70 million on HIV or whatever it is, right?"}, {"time": 3507, "text": "And that pot of money then scientists compete with each other for the best ideas to use it to address that problem."}, {"time": 3516, "text": "So it's essentially an endeavor to support the work of scientists."}, {"time": 3520, "text": "It is not in and of itself a policy organ."}, {"time": 3525, "text": "It doesn't say what public health policy should be."}, {"time": 3528, "text": "For that, you have the CDC and what happened during the pandemic is that people in the NIH were called upon to contribute to public health policymaking."}, {"time": 3544, "text": "And that created the conflict of interest you see in that email, right?"}, {"time": 3549, "text": "So now you have the head of the NIH in effect saying to all scientists, you must agree with me in the policy that I've recommended or else you're a fringe."}, {"time": 3563, "text": "That is a deep conflict of interest."}, {"time": 3565, "text": "It's deep because first he's conflicted."}, {"time": 3567, "text": "He has this dual role as the head of the NIH, supporter of scientific funding and then also inappropriately called to set or help set pandemic policy."}, {"time": 3579, "text": "That should never have happened."}, {"time": 3580, "text": "There should be a bright line between those two roles."}, {"time": 3584, "text": "Let me ask you about just Francis Collins."}, {"time": 3587, "text": "I had a chance to talk to him on a podcast."}, {"time": 3589, "text": "I don't know if you maybe by chance gotten a chance to hear a few words."}, {"time": 3592, "text": "I heard some of it, yeah."}, {"time": 3594, "text": "Well, I have kind of a question to that because a lot of people wrote to me quite negative things about Francis Collins and like I said, I still believe he's a great man and a great scientist."}, {"time": 3609, "text": "One of the things when I talked to him off mic about the vaccine, the excitement he had about when we were recollecting when they first gotten an inkling that it's actually going to be possible to get a vaccine, just he wasn't messaging, just in the private or of our own conversation, he was really excited and why was he excited?"}, {"time": 3634, "text": "Because he gets to help a lot of people."}, {"time": 3636, "text": "This is a man that really wants to help people and there could be some institutional self delusion, the arrogance, all those kinds of things that lead to this kind of email."}, {"time": 3647, "text": "But ultimately the goal is this, I don't think people quite realize this."}, {"time": 3682, "text": "And that's a lot of burden to walk with."}, {"time": 3684, "text": "Yeah, no, I think that's right."}, {"time": 3685, "text": "I don't think that he has bad intentions."}, {"time": 3689, "text": "I think that he was basically put, was put or maybe put himself in a position where this kind of conflict of interest was going to create this kind of reaction, right?"}, {"time": 3702, "text": "The kind of humility that you're calling for is almost impossible when you have that dual role that you shouldn't have as funder of science and also setter of scientific policy."}, {"time": 3713, "text": "I agree with everything you just said, except the last part."}, {"time": 3715, "text": "The humility is almost impossible."}, {"time": 3720, "text": "Humility is always difficult."}, {"time": 3721, "text": "I think there's a huge incentive for humility in that position."}, {"time": 3726, "text": "Now look at history."}, {"time": 3728, "text": "Great leaders that have humility are popular as hell."}, {"time": 3734, "text": "So if you like being popular, if you like having impact, legacy, these descendants of ape seem to care about legacy, especially as they get older in these high positions."}, {"time": 3745, "text": "I think the incentive for humility is pretty high."}, {"time": 3748, "text": "Well, the thing is there's a lot that he has to be proud of in his career."}, {"time": 3752, "text": "I mean, the Human Genome Project wouldn't have happened without him."}, {"time": 3756, "text": "And he is a great man and a great scientist."}, {"time": 3759, "text": "So it is tragic to me that his career has ended in this particular way."}, {"time": 3764, "text": "Can I ask you a question about my podcast conversation with him?"}, {"time": 3770, "text": "By way of advice or maybe criticism, there's a lot of people that wrote to me kind words of support and a lot of people that wrote to me respectful, constructive criticism."}, {"time": 3783, "text": "How would you suggest to have conversations with folks like that?"}, {"time": 3787, "text": "And maybe, I mean, because I have other conversations like this, including I was debating whether to talk to Anthony Fauci."}, {"time": 3797, "text": "He wanted to talk."}, {"time": 3799, "text": "And so what kind of conversation do you have?"}, {"time": 3802, "text": "And sorry to take us on a tangent, but almost from an interview perspective of how to inspire humility and inspire trust in science or maybe give hope that we know what the heck we're doing and we're gonna figure this out?"}, {"time": 3815, "text": "I mean, I think you're, I've had been now interviewed by many people."}, {"time": 3821, "text": "I think the style you have really works well, Lex."}, {"time": 3824, "text": "You have to, because I don't think you're gonna be ever an attack dog trying to go after somebody and force them to like, sort of admit that they were wrong or whatever about, I mean, I also actually find that form of journalism and podcasting really off putting."}, {"time": 3840, "text": "It's hard to watch."}, {"time": 3842, "text": "Also, it's a whole other tangent."}, {"time": 3844, "text": "Is that actually effective?"}, {"time": 3846, "text": "Do you wanna ask Hitler, and I think about this a lot, actually interviewing Hitler."}, {"time": 3851, "text": "I've been studying a lot about the rise and fall of the Third Reich."}, {"time": 3855, "text": "I think about interviewing Stalin."}, {"time": 3856, "text": "Like I put myself in that mindset, like how do you have conversations with people to understand who they are so that, not so you can sit there and yell at them, but to understand who they are so that you can inspire a very large number of people to be the best version of themselves and to avoid the mistakes of the past."}, {"time": 3876, "text": "I believe that everyone that's involved in this debate has good intentions."}, {"time": 3881, "text": "They're coming at it from their points of view."}, {"time": 3884, "text": "They have their weaknesses."}, {"time": 3888, "text": "And if you can paint a picture in your questioning by sympathetic questioning of those strengths and weaknesses and their point of view, you've done a service."}, {"time": 3897, "text": "That's really all I personally like to see in those kinds of interviews."}, {"time": 3902, "text": "I don't think a gotcha moment is really the key thing there."}, {"time": 3906, "text": "The key thing is understanding where they're coming from, understanding their thinking, understanding the constraints they faced and how did they manage them."}, {"time": 3914, "text": "That's gonna provide a much, I mean, to me, that's what I look for when I listen to podcasts like yours, is an understanding of that person and the moment and how they dealt with it."}, {"time": 3926, "text": "I mean, I guess the hope is to discover in a sympathetic way a flaw in a person's thinking together."}, {"time": 3933, "text": "Like as opposed to discovering the positive thing together, you discover the thing, well, I didn't really think about that."}, {"time": 3940, "text": "Yeah, I mean, that's how science is, right?"}, {"time": 3942, "text": "That's why we find it so attractive is this, I like it when a student shows me I'm thinking incorrectly."}, {"time": 3951, "text": "Right, I'm really grateful to that student because now I have an opportunity to change my mind about it and then start thinking even more correctly."}, {"time": 3958, "text": "I mean, and there are moments when, I mean, like this is probably a good time to say like what I think I got wrong during the pandemic, right?"}, {"time": 3967, "text": "So like for instance, you said Francis Collins had a moment when he learned that there was quite possible to get a vaccine going."}, {"time": 3976, "text": "He must've learned that quite early."}, {"time": 3979, "text": "And I didn't learn that early."}, {"time": 3981, "text": "I mean, I didn't know, in March of 2020, in my experience with vaccine development, it would've take, I thought it would take a decade or more to get a vaccine."}, {"time": 3993, "text": "That was wrong, right?"}, {"time": 3994, "text": "I didn't, and I was so happy when I started to see the preliminary numbers in the Pfizer trial that strongly suggested it was going to work."}, {"time": 4006, "text": "And I was, I mean, like very few times in my life I'm so happy to be wrong."}, {"time": 4010, "text": "And it changes kind of, I think I've heard you mention that a lockdown is still a bad idea unless the vaccine comes out in like tomorrow."}, {"time": 4021, "text": "There's still like suffering and economic pain, all kinds of pain can still happen in even just a scale of weeks versus months."}, {"time": 4034, "text": "Well, let's talk about the vaccine."}, {"time": 4036, "text": "What are your thoughts on the safety and efficacy of COVID vaccines at the individual and the societal level?"}, {"time": 4042, "text": "So for the vaccine safety data, it's actually challenging to convey to the public how this is normally done."}, {"time": 4051, "text": "Like normally you would do this in the context of the trial, you'd have a long trial with large numbers, relatively large numbers of people, you'd follow them over a long time and the trial will give you some indication of the safety of the vaccine."}, {"time": 4063, "text": "And it did, I mean, but the trial, the way it was constructed, when it came out that it was protective against COVID, it was no longer ethical to have a placebo arm."}, {"time": 4076, "text": "And so that placebo arm was vaccinated, large part of it."}, {"time": 4080, "text": "And so that meant that from the trial, you were not going to be able to get data on the longterm safety profiles of the vaccine."}, {"time": 4112, "text": "So I wasn't surprised when people were a little bit skeptical when the trial was done about the safety profile, just the way the nature of the thing was gonna make it so that it was gonna be hard to get a complete picture from the trials itself."}, {"time": 4125, "text": "And the trial showed they were pretty safe and quite effective at preventing both you from getting COVID, like I said, I think the main endpoint of the trial itself was a symptomatic COVID, right?"}, {"time": 4137, "text": "So that was like, that was, I mean, it was really to me, like it was about as amazing achievement as anything, organizing a trial of that scale and running it so quickly."}, {"time": 4150, "text": "And the final results being so surprisingly high."}, {"time": 4154, "text": "So good, right?"}, {"time": 4156, "text": "And so, but the problem then was, normally it would take a long time, the FDA would tell Pfizer to go back and try it in this subgroup, they'd work more on dosing, they do all these kinds of things that kind of didn't, we really didn't have time for in the middle of the pandemic, right?"}, {"time": 4174, "text": "So you have a basis for approval that it's less full than normally you would have for a population scale vaccine."}, {"time": 4184, "text": "But the results were good, the results looked really good."}, {"time": 4187, "text": "And actually, I should say for the most part, that's been born out when we've given the vaccine at scale in terms of protection against severe disease, right?"}, {"time": 4196, "text": "So people who have got the vaccine for a very long time after they've had for the full vaccination have had great protection against being hospitalized and dying if they get COVID."}, {"time": 4208, "text": "Let's separate, because this seems to be, there's critics of both categories, but different."}, {"time": 4216, "text": "Kids and kids, not older people, like let's say five years old and above or something, or 13 years old and above."}, {"time": 4226, "text": "So for those, it seems like the reduction of the rate of fatalities and serious illness seems to be something like 10X."}, {"time": 4238, "text": "I mean, for older people, it is a godsend, this vaccine."}, {"time": 4242, "text": "It transforms the problem of focus protection from something that's quite challenging, possible, I believe, but quite challenging to something that's much, much more manageable."}, {"time": 4253, "text": "Because the vaccine in and of itself when deployed in older populations is a form of focus protection."}, {"time": 4260, "text": "Yes, by the way, we'll talk about the focus protection in one segment, because it's such a brilliant idea for this pandemic or for future pandemics."}, {"time": 4268, "text": "I thought the sociological, psychological discussion about the letter from Francis Collins is, because it was so recent, it has been so troubling to me, so I'm glad we talked about that first."}, {"time": 4280, "text": "But so there seems to be, the vaccines work to reduce deaths, and that has especially the most transformative effects for the older folks."}, {"time": 4293, "text": "I've told you one thing that I got wrong in the pandemic."}, {"time": 4295, "text": "Let me tell you the second thing I got wrong, for sure, in the pandemic."}, {"time": 4298, "text": "In January of this year, 2021, I thought that the vaccines would stop infection."}, {"time": 4308, "text": "Right, it would make it so that you were much less likely to be infected at all, because the antibodies that were produced by the vaccines looked like they were neutralizing antibodies that would essentially block you from being infected at all."}, {"time": 4321, "text": "That turned out to be wrong, right?"}, {"time": 4326, "text": "So I think, and it became clear as data came out from Israel, which vaccinated very early, that they were seeing surges of infection, even in a very highly vaccinated population, that the vaccine does not stop infection."}, {"time": 4341, "text": "So you're a used car salesman, and you were selling the vaccine, and the features you thought a vaccine would have, I mean, I have a similar kind of sense when the vaccine came out."}, {"time": 4351, "text": "Vaccine would reduce, if you somehow were able to get it, it would reduce rate of death and all those kinds of things, but it would also reduce the chance of you getting it, and if you do get it, the chance of you transmitting it to somebody else."}, {"time": 4368, "text": "And it turns out that those latter two things are not as definitive, or in fact, I mean, I don't know to which degree they're not there at all."}, {"time": 4377, "text": "I think it's a little complicated, because I think the first two or three months after you're fully vaccinated, after the second dose, you have 60, 70% efficacy peak against infection."}, {"time": 4390, "text": "So that, which is pretty good, I mean, right?"}, {"time": 4392, "text": "But by six, seven, eight months, that drops to 20%."}, {"time": 4396, "text": "Some places, some studies, like there's a study out of Sweden that suggests it might even drop to zero."}, {"time": 4401, "text": "But, and then you're also infectious for some period of time, if you do get it, even though you're vaccinated."}, {"time": 4407, "text": "It seems to be lucidated that the period of time your infectious is shorter."}, {"time": 4411, "text": "Is shorter, but the infectivity per day is about as high."}, {"time": 4416, "text": "So you still, the point is that the vaccine might reduce some risk of infecting others, but it's not a categorical difference."}, {"time": 4424, "text": "So, it's not safe to be in the presence of just vaccinated people."}, {"time": 4431, "text": "You can still get infected."}, {"time": 4433, "text": "Right, so, I mean, there's a million things I wanna ask here, but is there in some sense because the vaccine really helps on the worst part of this pandemic, which is killing people."}, {"time": 4449, "text": "Doesn't that mean, where does the vaccine hesitancy come from in terms of, it seems like, obviously a vaccine is a powerful solution to let us open this thing up."}, {"time": 4462, "text": "Yeah, so I wrote a Wall Street Journal op ed with Sunetra Gupta in December of last year."}, {"time": 4467, "text": "A very night with a very naive title, which says we can end the lockdowns in a month."}, {"time": 4472, "text": "And the idea is very simple."}, {"time": 4473, "text": "Vaccinate all vulnerable people and then open up."}, {"time": 4480, "text": "Open up."}, {"time": 4481, "text": "Right, and the idea was that the lockdown harms, this is directly related to the Great Barrington Declaration."}, {"time": 4487, "text": "Great Barrington Declaration said the lockdown harms are devastating to the population at large."}, {"time": 4493, "text": "There's this considerable segment of people that are vulnerable, protect them."}, {"time": 4498, "text": "Well, with the vaccine, we have a perfect tool to protect the vulnerable, which is, I still believe, I mean, it's true, right?"}, {"time": 4504, "text": "You vaccinate the vulnerable, the older population, and as you said, there's a tenfold decrease in the mortality risk from getting infected, which is, I mean, amazing."}, {"time": 4514, "text": "So that was the strategy we outlined."}, {"time": 4517, "text": "What happened is that the vaccine debate got transformed."}, {"time": 4520, "text": "So first there's, so you're asking about vaccine hesitancy."}, {"time": 4522, "text": "I think first there's the inherent limitations of how to measure vaccine safety, right?"}, {"time": 4529, "text": "So we talked about a little bit about the trial, but also after the trial, there's a mechanism, and this is the work I've been involved with before COVID, on tracking and identifying and checking whether the vaccines actually are safe."}, {"time": 4543, "text": "And the central challenge is one of causality."}, {"time": 4547, "text": "So you no longer have the randomized trial, but you wanna know is the vaccine, when it's deployed at scale, causing adverse events."}, {"time": 4557, "text": "Well, you can't just look at people who are vaccinated and see what adverse events happen, because you don't know what would have happened if the person had not been vaccinated."}, {"time": 4566, "text": "So you have to have some control group."}, {"time": 4569, "text": "Now, what happened is there's several systems to check this that the CDC uses."}, {"time": 4574, "text": "One very commonly known one now is called VAERS, the Vaccine Adverse Event Reporting System."}, {"time": 4580, "text": "There, anyone who has an adverse event, either a regular person or a doctor can just go report, look, I had the vaccine and two days later I had a headache or whatever it is, the person died a day after I had the vaccine, right?"}, {"time": 4594, "text": "Now, the vaccine was rolled out to older people first, and older people die sometimes with or without the vaccine."}, {"time": 4602, "text": "So sometimes you'll see someone's vaccinated and a few days later they die."}, {"time": 4606, "text": "Did the vaccine cause it or something else cause it?"}, {"time": 4608, "text": "Really difficult to tell."}, {"time": 4610, "text": "In order to tell, you need a control group."}, {"time": 4613, "text": "For that, there are other systems the FDA and CDC have, like there's one called VSD, Vaccine Safety Datalink."}, {"time": 4622, "text": "There's another system called BEST, I forget what the acronym is, to essentially to track cohorts of people, vaccinated versus unvaccinated, with as careful of matching as you can do."}, {"time": 4635, "text": "It's not randomized, and then see if you have safety signals that pop up in the vaccinated relative to the control group unvaccinated."}, {"time": 4647, "text": "And so that's, for instance, how the myocarditis risk was picked up in especially young men."}, {"time": 4654, "text": "It's also how the higher risk of blood clots in middle age and older women with the J&J vaccine was picked up."}, {"time": 4663, "text": "There, what you have are situations where the baseline risk of these outcomes are so low that if you see them in the vaccinated arm at all, that it's not hard to understand that the vaccine did this."}, {"time": 4677, "text": "Young men should not be having myocarditis."}, {"time": 4680, "text": "Middle age women should not be having huge blood clots in the brain."}, {"time": 4684, "text": "So when you see that, you can say it's linked."}, {"time": 4685, "text": "Now, the rates are low."}, {"time": 4687, "text": "So young men, maybe one in 5,000, one in 10,000 of the vaccine, vaccine related myocarditis, pericarditis."}, {"time": 4694, "text": "Young women, middle age women, I don't know."}, {"time": 4697, "text": "I'm not sure what the right number might be, but like I'd say, it's like one in hundreds of thousands, something like that."}, {"time": 4706, "text": "So these are rare outcomes, but they are vaccine linked outcomes."}, {"time": 4710, "text": "How do you deal with that as a messaging thing?"}, {"time": 4713, "text": "I think you just tell people."}, {"time": 4715, "text": "You tell people here are the risks."}, {"time": 4716, "text": "You transparently tell them."}, {"time": 4717, "text": "And just, you're not, so they're not getting into something that they don't know."}, {"time": 4721, "text": "And don't treat people like they're children and need to be told lies because they won't understand the full complexity of the truth."}, {"time": 4730, "text": "People, I think, are pretty good at, or actually, people with time are good at understanding data, but better than anything."}, {"time": 4741, "text": "They're better at, they're extremely good at detecting arrogance and bullshit."}, {"time": 4748, "text": "And you give them either one of those."}, {"time": 4750, "text": "I mean, I'll give you one that's where I think it's greatly undermined vaccine, greatly undermined the demand for the vaccine, is this weird denial that if you recover from COVID, you have extremely good immunity, both against infection and access to disease."}, {"time": 4767, "text": "And that denial leads to people distrusting the message given by like the CDC director, for instance, in favor of the vaccine, right?"}, {"time": 4775, "text": "Why would you deny a thing that's such an obvious fact?"}, {"time": 4779, "text": "Like you can look at the data and it just, I mean, it just pops out at you that people that are COVID recovered are not getting infected again at very high rates, much lower rates."}, {"time": 4790, "text": "After these kinds of conversations, I'm sure after this very conversation, I often get a number of messages from Joe, Joe Rogan, and from Sam Harris, who to me are people I admire, I think are really intelligent, thoughtful human beings."}, {"time": 4806, "text": "They also have a platform."}, {"time": 4808, "text": "And I believe, at least in my mind, about this COVID set of topics, they represent a group of people."}, {"time": 4819, "text": "Each group has smart, thoughtful, well intentioned human beings."}, {"time": 4827, "text": "And I don't know who is right, but I do know that they're kind of tribal a little bit, those groups."}, {"time": 4837, "text": "And so the question I wanna ask is like, what do you think about these two groups and this kind of tension over the vaccine that sometimes it just keeps finding different topics on which to focus on, like whether kids should get vaccinated or not, whether there should be vaccine mandates or not, which seem to be often very kind of specific policy kinds of questions that miss the bigger picture."}, {"time": 4866, "text": "I think it's a symptom of the distrust that people have in public health."}, {"time": 4870, "text": "I think this kind of schism over the vaccine does not happen in places where the public health authorities have been much more trustworthy, right?"}, {"time": 4878, "text": "So you don't see this vaccine hasn't seen Sweden, for instance."}, {"time": 4883, "text": "What's happened in the United States is that the vaccine has become first because of politics, but then also because of the scientific arrogance, this sort of touchstone issue, and people line up on both sides of it, and the different language you're hearing is structured around that."}, {"time": 4900, "text": "So before the election, for instance, I did a testimony in the House on measurement of vaccine safety."}, {"time": 4909, "text": "And I was invited by the Republicans."}, {"time": 4912, "text": "There were, I think, four other experts invited by the Democrats, or three other experts invited by Democrats, each of whom had a lot of experience in measuring vaccine safety."}, {"time": 4920, "text": "I was really surprised to hear them each doubt whether the FDA would do a reasonable job in assessing vaccine safety, including by people who have long records of working with the FDA."}, {"time": 4932, "text": "I mean, these are professionals, great scientists, whose main sort of goal in life is to make sure that unsafe vaccines don't get released into the world."}, {"time": 4944, "text": "And if they are, they get pulled."}, {"time": 4946, "text": "And they're casting down on the vaccine the ability to track vaccine safety before the election."}, {"time": 4952, "text": "And then after the election, the rhetoric switched on a dime, right?"}, {"time": 4958, "text": "All of a sudden, it's Republicans that are cast as if they're vaccine hesitant."}, {"time": 4962, "text": "That kind of political shift, the public notices."}, {"time": 4966, "text": "If all it takes is an election to change how people talk about the safety of the vaccine, well, we're not talking science anymore, many people think, right?"}, {"time": 4974, "text": "I think that created its hesitancy."}, {"time": 4978, "text": "The other thing I think, I think the hesitancy, some politicians viewed it as a political, as sort of like a political opportunity to sort of demonize people who are hesitant."}, {"time": 4994, "text": "And that itself fueled hesitancy, right?"}, {"time": 4996, "text": "Like if you're telling me I'm a rube that just doesn't want the vaccine because I want everyone to die, well, I'm gonna react really negatively."}, {"time": 5005, "text": "And if you're talking down to me about my legitimate sort of concerns about whether this vaccine is safe to take, I mean, I've heard from women who were thinking about getting pregnant, should I take the vaccine?"}, {"time": 5019, "text": "I mean, there are all kinds of questions, legitimate questions that I think should have good data to answer that we don't necessarily have good data to answer."}, {"time": 5027, "text": "So what do you do in the face of that?"}, {"time": 5030, "text": "Well, one reaction is to pretend like we know for a fact that it's safe when we don't have the data to know for a fact in that particular group with that particular set of clinical circumstances you know."}, {"time": 5041, "text": "And that I think breeds hesitancy."}, {"time": 5043, "text": "People can detect that bullshit."}, {"time": 5046, "text": "Whereas if you just tell people, you know, I don't know."}, {"time": 5049, "text": "Yeah, leave with humility."}, {"time": 5050, "text": "Yeah, you will end up with a better result."}, {"time": 5054, "text": "Let me ask you about, I've recently had a conversation with the Pfizer CEO."}, {"time": 5059, "text": "This is part therapy session, part advice, because again, I really want us to get through this together and it feels like the division is a thing that prevents us from getting through this together."}, {"time": 5075, "text": "And once again, just like with Francis Collins, a lot of people wrote to me words of support and a lot of people wrote to me words of criticism."}, {"time": 5088, "text": "I'm trying to understand the nature of the criticism."}, {"time": 5093, "text": "So some of the criticism had to do with against the vaccine and those kinds of things."}, {"time": 5098, "text": "That I have a better understanding of."}, {"time": 5102, "text": "But some kind of deep distrust of Pfizer."}, {"time": 5107, "text": "So actually looking at Big Pharma broadly, I'm trying to understand am I so naive that I just don't see it?"}, {"time": 5121, "text": "Because yes, there's corrupt people and they're greedy, they're flawed in all walks of life."}, {"time": 5129, "text": "But companies do quite an incredible job of taking a good idea at the scale and making some money with that idea."}, {"time": 5139, "text": "But they are the ones that achieve scale on a good idea."}, {"time": 5143, "text": "I don't know, it's not obvious to me."}, {"time": 5146, "text": "I don't see where the manipulation is."}, {"time": 5149, "text": "So the fear that people have and I talked to Joe about this quite a bit."}, {"time": 5155, "text": "I think this is a legitimate fear and a fear you should often have that money has influenced, this proportional influence, especially in politics."}, {"time": 5164, "text": "So the fear is that the policy of the vaccine was connected to the fact that lots of money could be made by manufacturing the vaccine."}, {"time": 5179, "text": "And it's actually quite a heck of a difficult task to alleviate that concern."}, {"time": 5184, "text": "Like you really have to be a great man or woman or a leader to convince people that you're not full of shit, that you're not just playing a game on them."}, {"time": 5192, "text": "I don't know, it's a difficult task."}, {"time": 5195, "text": "But at the same time, I really don't like the natural distrust every billionaire, distrust everybody who's trying to make money because it feels like under a capitalistic system at least, the way to do a lot of good, like to do good at scale in the world is by being at least in part motivated by profit."}, {"time": 5217, "text": "I mean, I share your ambivalence, right?"}, {"time": 5219, "text": "So on the one hand, you have a fantastic achievement."}, {"time": 5222, "text": "The discovery of the vaccine and then the manufacturing at scale so that billions of people can take the vaccine in a relatively short time."}, {"time": 5234, "text": "That is a remarkable achievement that could not have happened without companies like Pfizer."}, {"time": 5240, "text": "And on the other hand, there is this sort of corrupting influence of that money."}, {"time": 5245, "text": "Just to give you one example, there's an enormous controversy over whether relatively inexpensive repurposed drugs can be used to treat the disease."}, {"time": 5258, "text": "None of, no company like Pfizer has any interest whatsoever in evaluating it."}, {"time": 5263, "text": "Even Merck, I think it was Merck, that had the patent on ivermectin now expired, has no interest at all in checking to see if it works."}, {"time": 5274, "text": "Not only do they not have interest, they have a way of talking about people who might have a little bit of interest that's again."}, {"time": 5286, "text": "Fringe."}, {"time": 5287, "text": "Full of arrogance."}, {"time": 5290, "text": "And that is what troubles me."}, {"time": 5292, "text": "Is there not a, it's back to the play of science."}, {"time": 5295, "text": "It's not, they're not a bit of curiosity."}, {"time": 5297, "text": "One, okay, one, the natural curiosity of a human being that should always be there and an open mind is."}, {"time": 5303, "text": "And second, in the case of ivermectin and other things like that, you have to acknowledge that there's a very large number of people who care about this topic."}, {"time": 5313, "text": "And this is a way to inspire them to also play in the space of science, to inspire them with science."}, {"time": 5319, "text": "You can't just like dismiss everybody that you can't just dismiss people, period."}, {"time": 5326, "text": "Well, I mean, I think here, take ivermectin, right?"}, {"time": 5328, "text": "There's actually a study funded by the NIH, by Tony Fauci's NIAID and the NIH called ACTIV6 that's a randomized trial of ivermectin."}, {"time": 5342, "text": "It's due to be completed in March, 2023."}, {"time": 5347, "text": "So normally when you have private actors like these big drug companies that have no interest in conducting some kind of scientific experiment that would have some public benefit, it's the job of the government, and in this case, the NIH to fund that kind of work."}, {"time": 5364, "text": "The NIH has been incredibly slow in its evaluations of these repurposed drugs."}, {"time": 5372, "text": "And it's been left to lots of other private activities of uneven quality."}, {"time": 5379, "text": "And hence, that's why you have these big fights."}, {"time": 5382, "text": "Because the data are not solid, you're gonna have these big fights."}, {"time": 5385, "text": "Yeah, but also, okay, forget the process of science here, the studies, not enough effort being put into the studies, just the way it's being communicated about."}, {"time": 5395, "text": "Yeah, no, like to horse paste, I mean, come on."}, {"time": 5397, "text": "The FDA put a tweet out telling people who are like, they're taking ivermectin because they've heard good things about it and they're sick and they're desperate."}, {"time": 5406, "text": "And to call it horse paste, that was terrible."}, {"time": 5409, "text": "That was deeply irresponsible."}, {"time": 5410, "text": "My hope is grounded in the fact that young people see the bullshit of this, young PhD students, graduate students, young students in college, they see the less than stellar way that our scientific leaders and our political leaders are behaving, and then the new generation will not repeat the mistakes of the past."}, {"time": 5433, "text": "That is my hope, because that's the cool thing I see about young people is they're good at detecting bullshit and they don't want to be part of that."}, {"time": 5443, "text": "That's my hope in the space of science."}, {"time": 5446, "text": "Let me return to this idea of the Great Barrington Declaration, return to the beginning."}, {"time": 5452, "text": "So what are the basics?"}, {"time": 5454, "text": "Can you describe what the Great Barrington Declaration is?"}, {"time": 5457, "text": "What are some of the ideas in it?"}, {"time": 5458, "text": "You mentioned focused protection."}, {"time": 5461, "text": "What are your concerns about lockdowns?"}, {"time": 5464, "text": "Just paint the picture of this early proposal."}, {"time": 5467, "text": "Sure, so the Great Barrington Declaration, first, why is it called Great Barrington Declaration?"}, {"time": 5471, "text": "It's such a great name."}, {"time": 5474, "text": "I mean, it's such an epic name, but the reason why it's called that is way less than epic."}, {"time": 5480, "text": "It was because the conference, which is organized by Martin Kulldorff, who was a professor at Harvard University, by a statistician, he actually designed the safety system, the statistical system that the FDA uses for tracking vaccine safety."}, {"time": 5498, "text": "He and I had met previously just the summer before, that summer, and he invited me to come to this small conference where he was inviting me and Sunetra Gupta, who is a professor of theoretical epidemiology at Harvard, sorry, at Oxford University."}, {"time": 5514, "text": "And I mean, I jumped at the chance because I knew that Martin and Sunetra were both smarter than me, and it would be fun to talk about what the right strategy would be."}, {"time": 5527, "text": "On the drive in, I didn't know what the name of the town was and I asked, they said it was Great Barrington, and I had it in the back of my head."}, {"time": 5536, "text": "Martin and I arrived a little early and we were writing an op ed about some of the ideas, I hope we'll get to talk about very soon, about focused protection and the right strategy."}, {"time": 5545, "text": "And when Sunetra arrived, we realized we'd actually come basically to the same place about the right way to deal with the epidemic."}, {"time": 5554, "text": "And I thought, well, why don't we write something like the Port Huron Statement, is what I had in the back of my head."}, {"time": 5561, "text": "And I'm like, well, what's the name of this town again?"}, {"time": 5563, "text": "It was Great Barrington."}, {"time": 5564, "text": "Yeah, so it's not Barrington, it's Great Barrington."}, {"time": 5567, "text": "Which is fantastic, right?"}, {"time": 5570, "text": "It's so over the top that it's perfect."}, {"time": 5573, "text": "It's literally like the Big Bang."}, {"time": 5575, "text": "There's something about these over the top fun titles that just really delivered the power."}, {"time": 5581, "text": "That's my main contribution was the title, the name Great Barrington Decorate."}, {"time": 5585, "text": "But yeah, so it was kind of a, so the idea is actually, well, the title is great."}, {"time": 5592, "text": "And I think that it was written in a very stylish way."}, {"time": 5594, "text": "It's less than a page, you can go look online and read it."}, {"time": 5598, "text": "It's written for, not for scientists, but for the general public so that people can understand the ideas really simply."}, {"time": 5606, "text": "But it is not actually a radical set of ideas."}, {"time": 5609, "text": "It actually represents the old pandemic plans that we've used for a century dealing with other similar pandemics."}, {"time": 5618, "text": "And it's twofold."}, {"time": 5621, "text": "First, let me talk about the science it rests on, and then I'll talk about the plan."}, {"time": 5625, "text": "The science actually, some of it we already talked about."}, {"time": 5627, "text": "There's this massive age gradient in the risk of COVID infection."}, {"time": 5631, "text": "Older people face much higher risk than younger people."}, {"time": 5635, "text": "The second bit of science is all, that's not controversial, right?"}, {"time": 5638, "text": "Even if you think the IFR is 0.7 or 0.2, no matter what, everyone thinks, everyone agrees on this age gradient."}, {"time": 5646, "text": "The second bit of science is also not controversial."}, {"time": 5649, "text": "The lockdown focused policies that we've followed have absolutely devastating consequences on the health of the population."}, {"time": 5660, "text": "Let me just give you some examples."}, {"time": 5661, "text": "And this was known in October of 2020 when we wrote it."}, {"time": 5664, "text": "So the UN was sounding alarms that there would be tens of millions of people who would starve as a consequence of the economic dislocation caused by the lockdowns."}, {"time": 5677, "text": "And that's come to pass."}, {"time": 5678, "text": "Hundreds of thousands of children in places like South Asia dead from starvation as a consequence of lockdowns."}, {"time": 5687, "text": "The priorities like the treatment of patients with tuberculosis in poor countries stopped because of lockdowns."}, {"time": 5700, "text": "Childhood vaccinations of measles, mumps, rubella, DPT, diphtheria, so on, pertussis, tetanus, all those standard vaccination campaigns stopped."}, {"time": 5711, "text": "Tens of millions of children skipping these doses for diseases that are actually deadly for them."}, {"time": 5719, "text": "Is there, just on a small tangent, is it well understood to you what are the mechanisms that stop all those things because of lockdowns?"}, {"time": 5728, "text": "Is it some aspect of supply chain?"}, {"time": 5730, "text": "Is it just literally because hospital doors are closed?"}, {"time": 5734, "text": "Is it because there's a disincentive to go outside by people even when they deeply need help?"}, {"time": 5742, "text": "But a lot of those efforts, especially those vaccination efforts are funded and run by Western efforts."}, {"time": 5749, "text": "Like Gavi is a, I think it's a Gates funded thing actually that provides vaccines for millions of kids worldwide."}, {"time": 5757, "text": "And those efforts were scaled back."}, {"time": 5760, "text": "Malaria prevention efforts."}, {"time": 5762, "text": "So in the developing world, it was a devastating effect, these lockdowns."}, {"time": 5767, "text": "There was also direct effects."}, {"time": 5768, "text": "Like in India, the lockdowns, when they first instituted, there was an order that 10 million migrant workers who live in big cities and they live hand to mouth, they buy coconuts, they sell the coconuts with the money, they buy food for themselves and coconuts for the next day to sell, walk back to their villages or go back to their villages overnight."}, {"time": 5793, "text": "So 10 million people walking back to their villages or taking a train back, 1,000 died on route."}, {"time": 5799, "text": "Overcrowded trains dying essentially on the side of the road."}, {"time": 5802, "text": "I mean, it was absolutely inhumane policy."}, {"time": 5806, "text": "And the lockdowns there, it's kind of like what's happened in the West as well, but it was so severe."}, {"time": 5815, "text": "There was a seroprevalence study done in Mumbai by a friend of mine at the University of Chicago."}, {"time": 5820, "text": "What he found was that in the slums of Mumbai, there were 70% seroprevalence in July or August of 2020, whereas in the rest of Mumbai, it was 20%, right?"}, {"time": 5832, "text": "So it was incredibly unequal."}, {"time": 5834, "text": "The lockdowns protected the relatively well off and spread the disease among the poor."}, {"time": 5842, "text": "So that's in the developing world."}, {"time": 5845, "text": "In the developed world, the health effects of lockdowns were also quite bad, right?"}, {"time": 5851, "text": "So we've talked already about isolation and depression."}, {"time": 5854, "text": "There was a study done in July of 2020 that found that one in four young adults seriously considered suicide."}, {"time": 5863, "text": "Now, suicide rates haven't spiked up so much, but the depths of despair that would lead somebody to seriously consider suicide itself should be a source of great concern in public health."}, {"time": 5877, "text": "Yeah, this is one of the troubling things about measuring well being is we're okay at measuring death and suicide."}, {"time": 5886, "text": "We're not so good at measuring suffering."}, {"time": 5888, "text": "It's like people talk about maybe even Holodomor under Stalin or the concentration camps with Hitler."}, {"time": 5899, "text": "We talk about deaths, but we don't talk about the suffering over periods of years by people living in fear, by people starving, psychological trauma that lasts a lifetime, all of those things."}, {"time": 5913, "text": "I mean, and just to get back to that point, we closed schools, especially in blue states, we closed schools."}, {"time": 5920, "text": "Now, richer parents could send their kids to private schools, many of which stayed open even in the blue states."}, {"time": 5925, "text": "They could get pods, they could get tutors, but that's not true for poor and middle class parents."}, {"time": 5931, "text": "And as a result, what we did is we took away life opportunities for kids."}, {"time": 5936, "text": "We tried to teach five year olds to read via Zoom in kindergarten, right?"}, {"time": 5942, "text": "And the consequence actually, you think, okay, we can just make it up, but it's really difficult to make that up."}, {"time": 5948, "text": "There's a literature in health economics that shows that even relatively small disruptions in schooling can have lifelong consequences, negative consequences for kids, right?"}, {"time": 5962, "text": "So they end up growing up poorer, they lead shorter lives and less healthy lives as a consequence."}, {"time": 5970, "text": "And that's what the literature now shows is likely to happen with the interruptions of schooling that we had in the United States."}, {"time": 5976, "text": "Many European countries actually managed to avoid this."}, {"time": 5979, "text": "There were in the early days of the epidemic great indications that children first were not very severely at risk from COVID itself, nor are they super spreaders."}, {"time": 5989, "text": "Schools were not the source of community spread, communities spread the disease to schools, not the other way around."}, {"time": 5997, "text": "And we can talk about the scientific base of that if you'd like, but that was pretty well known even in October."}, {"time": 6004, "text": "We closed hospitals in order to keep them available to COVID patients, but as a result, women skipped breast cancer screening."}, {"time": 6014, "text": "As a result, they are showing up with late stage breast cancer that should have been picked up last year."}, {"time": 6019, "text": "Men and women skipped colon cancer screening, again, with later stage disease that should have been picked up last year with earlier stage."}, {"time": 6026, "text": "For patients with diabetes, it's very important to have regular screening for blood sugar levels and sort of counseling for lifestyle improvement."}, {"time": 6036, "text": "And we skipped that."}, {"time": 6038, "text": "People stayed home with heart attacks and died at home with heart attacks."}, {"time": 6043, "text": "So you had this like sort of wide range of medical and psychological harms that were being utterly ignored as a result of the lockdowns."}, {"time": 6053, "text": "Plus there's the economic pain."}, {"time": 6057, "text": "So like you said, whatever is a good term for the non laptop class, people would lose their jobs."}, {"time": 6065, "text": "Yes, there might be in the Western world support for them financially, but the big loss there that is perhaps correlated with depression and suicide is loss of meaning, loss of hope for the future, loss of kind of a sense of stability, all the pride you have in being able to make money that allows you to pave your own way in the world."}, {"time": 6092, "text": "And yes, just having less money than you're used to so your family, your kids are suffering, all those kinds of things."}, {"time": 6098, "text": "And there's, again, an economics literature on this, on deaths of despair it was called."}, {"time": 6103, "text": "2009, there was the great recession."}, {"time": 6105, "text": "It led to an enormous uptake in overdose from drugs, suicidality, depression, as a result of the job losses that happened during the great recession."}, {"time": 6117, "text": "Well, that's happening again, like an enormous increase in drug overdoses."}, {"time": 6123, "text": "That's not an accident, that's a lockdown harm, right?"}, {"time": 6127, "text": "Same thing with the job losses."}, {"time": 6130, "text": "The job losses, by the way, are like, it's so interesting because the states that stayed open have had much, much lower unemployment than the states that stayed closed."}, {"time": 6140, "text": "The labor force participation rates declined by 3%."}, {"time": 6143, "text": "It's women that separated because they stayed home with their kids."}, {"time": 6148, "text": "We've reversed a generation of women, improving women's participation in the labor force."}, {"time": 6157, "text": "Do you think it has to do with the institutions that we mentioned that there was so much priority given or so much power given to maybe NIH versus other civilian leaders?"}, {"time": 6171, "text": "Or do people just not care about the economic pain?"}, {"time": 6174, "text": "The leaders, I mean, because to me it was obvious."}, {"time": 6179, "text": "I mean, probably it's just studying history."}, {"time": 6183, "text": "Whenever I listen to people on Twitter or on mainstream news or just anything, I realize that's the very kind of top."}, {"time": 6194, "text": "The people that have a voice represent a tiny selection of people."}, {"time": 6199, "text": "And so whenever there's hard times, I always kind of think about the quiet, the voiceless, the quiet suffering of the tens of millions, of the hundreds of millions."}, {"time": 6213, "text": "Do the political leaders not just give a damn?"}, {"time": 6216, "text": "I mean, I think it was actually a very odd ethical thing at the beginning of the pandemic where if you brought up economic harms at all, you were seen as callous."}, {"time": 6227, "text": "So I had a reporter call me up almost at the very beginning of the epidemic asking me about a very particular phenomenon."}, {"time": 6236, "text": "So he was anticipating a rise in child abuse because children were gonna be staying at home."}, {"time": 6242, "text": "Child abuse is generally picked up at school."}, {"time": 6244, "text": "And that actually happened."}, {"time": 6246, "text": "So the reported child abuse dropped, but actual child abuse increased because normally you pick up the child abuse at school and that you have the intervention, right?"}, {"time": 6256, "text": "So yeah, so I was talking about like, well, there's gonna be some economic harms and they're gonna have health consequences, but the economic harms matter."}, {"time": 6261, "text": "But he counseled me."}, {"time": 6264, "text": "And I think he had my best interest at heart."}, {"time": 6267, "text": "Like if you were to put that in the story, I would be, I'd essentially be canceled."}, {"time": 6271, "text": "Because what the narrative that arose in March of 2020 is if you care about money at all, you're evil and crass, you must only care about lives."}, {"time": 6283, "text": "The problem with that narrative is that that money, which we're talking about, is actually lives of poor people, right?"}, {"time": 6291, "text": "When you throw 100 million people around the world into poverty, you're going to see enormous harm to their health, enormous increases in their mortality."}, {"time": 6301, "text": "It is not immoral to think about that and worry about that in the context of this pandemic response."}, {"time": 6307, "text": "Our mind focused so much on COVID that it forgot that there are so many other public health priorities as well that need our attention desperately."}, {"time": 6316, "text": "And this is the thing I sensed about San Francisco when I visited, I was thinking of moving there for a startup."}, {"time": 6324, "text": "This is the thing I'm really afraid of, especially if I have any effect on the world through a startup, is losing touch in this kind of way."}, {"time": 6334, "text": "That you mentioned the laptop class, living in this world where you're only concerned about this particular class of people."}, {"time": 6344, "text": "And also, perhaps early on in the pandemic, amongst the laptop class, there was a legitimate concern for health, like you're not sure how deadly this virus is."}, {"time": 6355, "text": "You're not sure who to listen to, so there's a real concern."}, {"time": 6358, "text": "And then at a certain point when the data starts coming in, you start becoming more and more detached from the data."}, {"time": 6394, "text": "I'm so terrified of that."}, {"time": 6396, "text": "Well, actually, I think the antidote to that is just to remember."}, {"time": 6399, "text": "You remember."}, {"time": 6401, "text": "I don't think, you know, remember where you came from and remember who you're doing this for."}, {"time": 6406, "text": "At the back of your head should always be, what's the purpose?"}, {"time": 6409, "text": "Like, why am I here?"}, {"time": 6410, "text": "What's the purpose of this?"}, {"time": 6411, "text": "And if the purpose is simply self aggrandizement, then you should rethink, because it'll just end up being a hollow life."}, {"time": 6421, "text": "All of us will be forgotten in the end."}, {"time": 6424, "text": "Focused protection, the idea, the policy, what is focused protection?"}, {"time": 6429, "text": "Right, so I was saying that there's two scientific bases, right, so one is this steep age gradient, and the second is the existence of locked arms."}, {"time": 6437, "text": "Again, I think there's very little disagreement in the scientific community on both of those facts."}, {"time": 6442, "text": "If you put those facts together, the obvious policy is to protect the people who are at the most severe risk from the disease itself."}, {"time": 6451, "text": "And that's the idea of focused protection."}, {"time": 6453, "text": "That's the general principle of it."}, {"time": 6455, "text": "The actual implementation of it depends on the living circumstances of the people that are at risk, the resources that are available in the community, the technology that's available to do this."}, {"time": 6469, "text": "And so it's almost always going to be, in fact, it'll always be a local thing, because it'll depend on all of those things which are all local in nature."}, {"time": 6480, "text": "Right, so one very, very obvious thing, in a country like ours, where so many older people live in institutionalized settings and nursing home settings, and that's where older, really vulnerable, chronically ill patients often live, and you know this disease affects that group, most commonly, it is absolutely vital to protect that group."}, {"time": 6503, "text": "We should have known that in February 2020, just from the Chinese data."}, {"time": 6510, "text": "And we should have thought about that group as the key constraint in our policymaking."}, {"time": 6518, "text": "Instead, we thought about, in February and March 2020, as hospital beds as the key constraint."}, {"time": 6524, "text": "Hospital beds and ventilator shortages, and so we ran around trying to address that constraint, like a linear programming problem, you figure out which constraint's binding and you address that one thing and then you go on to the next one, right?"}, {"time": 6538, "text": "If that one constraint, we said, okay, the constraint is hospital beds."}, {"time": 6544, "text": "That led to the decision in many of the Northeast states to send COVID infected patients who were on the verge or looked like they were about to recover back to nursing homes, who then spread the disease all through there, because they wanted to preserve the hospital beds."}, {"time": 6561, "text": "Well, for somebody who loves numerical optimization, I love the way you frame this."}, {"time": 6567, "text": "But those are kind of connected, right?"}, {"time": 6570, "text": "If you actually focus on protecting the vulnerable, you will also have the effect of not hitting the ceiling of the available hospital beds."}, {"time": 6580, "text": "That's the irony."}, {"time": 6581, "text": "If we protected the vulnerable, the vulnerable are the most likely to be hospitalized, and so by protecting the hospital, by protecting the vulnerable, we will also have addressed the shortage of hospital beds more effectively."}, {"time": 6593, "text": "So that little shift in priority would have had a big impact."}, {"time": 6597, "text": "Okay, but specifically, the idea is to, and we could talk about different ideas of how to actually do this, but you basically do a lockdown or something like that on a very small set of people."}, {"time": 6612, "text": "You may have to do that if community spread is very high, but generally, I think it would depend on, again, the living circumstances and the, so for instance, if you are in a, if you have a, here's a very simple idea that doesn't require a lockdown forced on them."}, {"time": 6628, "text": "I don't actually generally, I'm not in favor of that kind of forced lockdown because you just won't get cooperation."}, {"time": 6633, "text": "But what you could do is provide resources to that group of people."}, {"time": 6638, "text": "So imagine you live next door to somebody, an older couple, and there's high community spread."}, {"time": 6646, "text": "Well, they have to go grocery shopping."}, {"time": 6648, "text": "We did like, some communities did these like senior only grocery hour, right?"}, {"time": 6653, "text": "But they have to still have to go out and they might get exposed when they're shopping amongst other seniors."}, {"time": 6659, "text": "Well, why not organized home delivery of groceries to them?"}, {"time": 6663, "text": "We did that for the laptop class, right?"}, {"time": 6666, "text": "Or you can even just use a volunteer effort."}, {"time": 6669, "text": "The older people living next door, just call them up and say, can I help you go out and go shopping for you?"}, {"time": 6673, "text": "And so you would have potentially federal support of that kind of thing."}, {"time": 6677, "text": "So these kinds of efforts."}, {"time": 6679, "text": "Identify where the vulnerable people live."}, {"time": 6682, "text": "It's really challenging in multigenerational homes."}, {"time": 6684, "text": "In LA County, for instance, there's a lot of older people living together with younger people in relatively crowded, there it's really quite a challenge."}, {"time": 6694, "text": "But there again, you can use resources."}, {"time": 6695, "text": "So if grandma is worried that grandson has come home, but is potentially been exposed, grandson calls grandma says, I mean, I might've been at a party where COVID was."}, {"time": 6707, "text": "Grandma calls public health, public health, and says, okay, you can have this hotel room for a couple of days until you check to turn negative."}, {"time": 6714, "text": "In case it wasn't clear, the idea of focused protection is the people that are vulnerable, protect them."}, {"time": 6723, "text": "And everybody else goes on with their lives, open up the economy, just do as it was before."}, {"time": 6729, "text": "There was still fear abroad."}, {"time": 6730, "text": "So there still would be some restrictions that people would pose on themselves."}, {"time": 6734, "text": "They probably would go to parties less."}, {"time": 6735, "text": "The grandsons probably wouldn't go so many parties, right?"}, {"time": 6739, "text": "There would be less participation in big gatherings."}, {"time": 6743, "text": "And you may even say like big gatherings in order to restrict community spread again."}, {"time": 6747, "text": "I'm not against any of that, but you shouldn't be closing businesses."}, {"time": 6751, "text": "You shouldn't be closing churches and synagogues."}, {"time": 6754, "text": "You shouldn't be forcing people to not go to school."}, {"time": 6758, "text": "You should not be shuttering businesses."}, {"time": 6761, "text": "You should just allow society to go on."}, {"time": 6764, "text": "Some disease will spread, but as we've seen, the lockdown didn't stop the disease from spreading anyways."}, {"time": 6770, "text": "So what do you make of the criticism that this idea, like all good ideas cannot actually be implemented in a heterogeneous society where there's a lot of people intermixing?"}, {"time": 6783, "text": "And once you open it up, people like the younger people will just forget that this is even existing."}, {"time": 6791, "text": "And they'll stop caring about the older people and mess up the whole thing."}, {"time": 6794, "text": "And the government will not want to fund any kind of the great efforts you're talking about about food delivery and then the food delivery services be like, why the heck am I helping out on this anyway?"}, {"time": 6804, "text": "Because like, it's not making me much money."}, {"time": 6806, "text": "And so therefore like all good ideas, it will collapse."}, {"time": 6810, "text": "That might be true."}, {"time": 6811, "text": "I mean, I think it's always a risk with policy thing, but I think if you think back to the moment, but we actually felt like we were in this together to some extent."}, {"time": 6820, "text": "Right, I think that that empathy that we had that was used to like tell people to stay in and like happily, not go in happily, but like stay in to like wear a mask or to do all these things that we thought would help other people could have been redirected to actually helping the people who most needed to be helped."}, {"time": 6842, "text": "Especially, I do remember March."}, {"time": 6848, "text": "So this is even way before Barrington, all that kind of stuff."}, {"time": 6852, "text": "March, April, May, there was a feeling like if we all just work together, we'll solve this."}, {"time": 6860, "text": "And that maybe started to, when did that start breaking down?"}, {"time": 6864, "text": "I mean, unfortunately the election is mixed into this."}, {"time": 6868, "text": "That it became politicized."}, {"time": 6870, "text": "But I think it lasted quite a long time."}, {"time": 6872, "text": "I think into the summer, I think there was some of that sense."}, {"time": 6876, "text": "I don't know, it obviously varied among different people."}, {"time": 6879, "text": "But I think that it's true it would have been challenging."}, {"time": 6882, "text": "It's also true that it's heterogeneous, exactly the way you said."}, {"time": 6886, "text": "But what that means is you need a local response, a response, so like my vision of a public health officer is someone that understands their community, not necessarily the nation at large, but their community, and then works within their community to figure out how to deploy the resources that they have available to do the kind of protection policies we're talking about."}, {"time": 6908, "text": "That's what should have happened."}, {"time": 6910, "text": "Instead, they spent a huge amount of efforts closing, making sure businesses stayed closed."}, {"time": 6915, "text": "Businesses that, I mean, they're like hardware stores that closed."}, {"time": 6920, "text": "What good did closing a hardware store do for the spread of COVID?"}, {"time": 6924, "text": "If it had an effect on COVID spread, I mean, it's gonna be March."}, {"time": 6928, "text": "Checking to make sure that plexiglass was put up everywhere, which now in retrospect turns out to have probably made the disease worse."}, {"time": 6937, "text": "Masking enforcement, so shaming around masks, I mean, a huge amount of effort on things that were only tangentially related to focus protection."}, {"time": 6947, "text": "What if we turned our energy, that enormous energy put into that, instead into focus protection of the vulnerable?"}, {"time": 6954, "text": "That's essentially the conversation I was calling for."}, {"time": 6957, "text": "And it wasn't, I mean, I didn't think of it as we had every single idea."}, {"time": 6961, "text": "I mean, we gave some concrete proposals, but the criticism we got was that those concrete proposals weren't enough."}, {"time": 6968, "text": "And the answer to that is that's true."}, {"time": 6970, "text": "They weren't enough."}, {"time": 6971, "text": "I wasn't thinking of them as enough."}, {"time": 6972, "text": "I was thinking that I wanted to involve an enormous number of people in local public health to help think about how to do focus protection in their communities."}, {"time": 6982, "text": "The question that's interesting here is about the future too."}, {"time": 6989, "text": "So COVID has very specific characteristics, like you mentioned, about the curve of the death rate based on the, like it seems like with COVID, it's a little bit easier to actually identify a group of people that you need to protect."}, {"time": 7005, "text": "So other viruses may not be this way."}, {"time": 7007, "text": "So might lockdown be a good idea, like hardcore lockdown for a future virus that's 10 times deadlier, but spreads at the same rate as COVID?"}, {"time": 7019, "text": "Or maybe another way to ask that is imagine a virus that's 10 times deadlier, what's the right response?"}, {"time": 7026, "text": "I mean, I think it's always gonna be focus protection, but the group that needs the focus protection may change depending on the biology of the virus, right?"}, {"time": 7034, "text": "So the polio epidemic in the 40s and 50s in the US, the great, the people at most risk were children."}, {"time": 7043, "text": "We didn't know really at the beginning there was this fecal oral spread."}, {"time": 7047, "text": "And so we did all kinds of crazy things, including like spraying DDT in communities, which somehow was supposed to get rid of polio."}, {"time": 7057, "text": "But the focus was on whenever there was an outbreak, they would close the school down."}, {"time": 7062, "text": "And that was the right thing to do because that group that needed protection was children."}, {"time": 7068, "text": "And the disease was spread, we thought in schools."}, {"time": 7073, "text": "I don't think there's a single formula that works, but there's a single principle that works, right?"}, {"time": 7079, "text": "No matter, it's hard to imagine a disease that's uniformly deadly across every group in every single person."}, {"time": 7087, "text": "There's always gonna be some group that's differentially harmed."}, {"time": 7093, "text": "There's always gonna be some group that's differentially protected."}, {"time": 7096, "text": "And that may change over time, right?"}, {"time": 7097, "text": "So like in this disease, in this epidemic, as people got infected and recovered, we now had a class of people that were pretty well protected against the disease."}, {"time": 7110, "text": "They should be, like instead of ostracizing them because they don't want a vaccine, we should be allowing them to work."}, {"time": 7117, "text": "I mean, we're having staffing shortages in hospitals now because we forgot that principle."}, {"time": 7123, "text": "Is quite a bit of this a technology problem?"}, {"time": 7126, "text": "So being able to, how much of it is a sociological problem?"}, {"time": 7133, "text": "How much of it is a technology problem?"}, {"time": 7136, "text": "Like where do you put the blame sort of on why this didn't go so great and how it can go great in the beginning?"}, {"time": 7144, "text": "I mean, think about lockdowns."}, {"time": 7145, "text": "Like if we didn't have Zoom, we wouldn't have lockdowns."}, {"time": 7148, "text": "There's a reason in 2009 we didn't lock down."}, {"time": 7151, "text": "I mean, we didn't have the technology to replace work with this remote technology."}, {"time": 7157, "text": "So we had good lockdown technology in Zoom."}, {"time": 7161, "text": "We didn't have good focus protection technology."}, {"time": 7165, "text": "Yeah, I mean, focus protection is always gonna be complicated, especially for something like this that spreads so easily, it's gonna be complicated."}, {"time": 7170, "text": "And I'm the last person to say it would have been perfect."}, {"time": 7174, "text": "There would have been people that would have gotten sick, but they got sick anyways."}, {"time": 7179, "text": "The hope was that if we suppress community spread low enough, we can protect the vulnerable."}, {"time": 7184, "text": "That was the hope by lockdown."}, {"time": 7187, "text": "The reality was that only a certain class of people were able to benefit from lockdown."}, {"time": 7191, "text": "The rest of society, we call them essential workers, had to keep working and they got sick."}, {"time": 7196, "text": "And the disease kept spreading."}, {"time": 7198, "text": "It didn't actually have a substantial effect on community spread in non laptop class populations."}, {"time": 7205, "text": "And also we should probably expand the class of people we call vulnerable to those who would suffer, who have the capacity to suffer, given the policies you're weighing."}, {"time": 7219, "text": "It's very disingenuous to call the vulnerable just the people, obviously we had the very specific meaning, but broadly speaking, vulnerable should include anybody who can suffer based on the policies you take in response to a virus."}, {"time": 7236, "text": "That principle you just said is completely agree with is something I think has been lost."}, {"time": 7242, "text": "And unfortunately lost, right?"}, {"time": 7244, "text": "So the policies themselves, if they have harm, those are real and we shouldn't pretend like they're not."}, {"time": 7253, "text": "And essentially demonize the people that suffer them."}, {"time": 7258, "text": "Or pretend, I mean like a lot of times like the depression that we've been talking about, that's thought of as like not so important, but it is important."}, {"time": 7268, "text": "And especially the harm to the people in poor countries, it's like been out of sight, out of mind in much of the rich parts of the world."}, {"time": 7276, "text": "Once again, I've hoped that we seeing this, learning lessons of history with the communication tools who have now will learn this."}, {"time": 7284, "text": "It's like going to another country and bombing targeted terrorist locations, and there's going to be some civilians who die, pretending that the child who watches their dad die is not going to grow up, first of all, traumatized, but second of all, potentially bring more hate to the world than the hate that you were allegedly fighting in the first place."}, {"time": 7307, "text": "That's another sort of considering only one kind of harm and not the full range of harms that are being caused by your policies."}, {"time": 7315, "text": "You know, like the good return to focus protection, we still should be following the policy now for COVID and we're not, right?"}, {"time": 7323, "text": "So the vaccines, there's a great shortage of vaccines."}, {"time": 7326, "text": "You wouldn't know it in the United States and the rich parts of the world, but there's a great shortage of vaccines."}, {"time": 7331, "text": "We're not going to be able to vaccinate the most of the, like the entire set of elderly at least, and or larger groups until late 2022."}, {"time": 7340, "text": "Huge numbers of older people around the world in poor countries that have not COVID recovered yet, so they're still quite vulnerable, have not had the vaccine."}, {"time": 7350, "text": "And yet we're talking about vaccinating five year olds who benefit, if at all, from the vaccines of just a very little bit because they face such a low risk of harm from COVID."}, {"time": 7363, "text": "Well, something that's a little bit near and dear to our specific, the two of our hearts."}, {"time": 7369, "text": "So you're at Stanford."}, {"time": 7371, "text": "So Stanford recently announced that they're going back to virtual, at least for some period of time in response to the, maybe you can clarify, but I think it's in response to the escalated, how would they phrase it?"}, {"time": 7385, "text": "It's related to Omicron."}, {"time": 7387, "text": "And a few other universities are kind of like considering back and forth."}, {"time": 7393, "text": "In my perspective, as somebody who loves in person lectures, who sees the value of that to students, to young minds, also looking at the data, seems the risk aversion in university policies around this, given how healthy the student population is, seems not well calibrated."}, {"time": 7424, "text": "Also, pathological is one way to put it."}, {"time": 7428, "text": "Given that, I believe, depending on the university, but I think many universities require that the student body is vaccinated at this point."}, {"time": 7437, "text": "So I think it's a big mistake by Stanford to do this."}, {"time": 7441, "text": "And I'd like to say that because I just hope MIT doesn't."}, {"time": 7447, "text": "But what are your thoughts about Stanford?"}, {"time": 7449, "text": "Is there a student?"}, {"time": 7451, "text": "I think we have failed in our mission to educate our students by this decision."}, {"time": 7458, "text": "And I think, frankly, just more broadly, I think we failed generally over the course of the last year and a half in living up to our educational mission."}, {"time": 7467, "text": "In person teaching is vital."}, {"time": 7471, "text": "Now, I can understand, if you have older faculty, the principle of focus protection says, provide some alternative teaching arrangements for them."}, {"time": 7482, "text": "From the kid's point of view, they're more harmed by not getting the education we promised them than by COVID."}, {"time": 7491, "text": "So applying this principle of this focus protection, let young professors teach in person."}, {"time": 7498, "text": "This is before the vaccine."}, {"time": 7499, "text": "After the vaccine, let everyone teach in person."}, {"time": 7501, "text": "Yeah, this is the part, I don't understand the discussion we're even having because, okay, let's leave focus protection aside here because that's a brilliant policy for, perhaps for the future when there's no vaccine."}, {"time": 7515, "text": "Now with the vaccine, I'm misunderstanding something here because we're now in a space that's psychological."}, {"time": 7524, "text": "It's no longer about biology because with the booster shots, which I believe MIT is now requiring before January, with the booster shots, the data shows, no matter how old you are, the risks are very low for ending up in a hospital relative to all the other risks you face when you're older."}, {"time": 7551, "text": "Can you explain the policy around closing a university but also just a policy about just being so scared still in the university setting?"}, {"time": 7566, "text": "I think the great universities have done great harm by modeling this kind of behavior."}, {"time": 7572, "text": "Yes, to me, sorry to keep interrupting, but to me, the university should be the beacon of great behavior, not the beacon of scared, conservative, let's not mess up."}, {"time": 7586, "text": "Pathological."}, {"time": 7587, "text": "Let's not make it pathological."}, {"time": 7587, "text": "Let's not make anybody angry."}, {"time": 7591, "text": "It should be a place to play in the space of ideas."}, {"time": 7593, "text": "Yes, so I think the central problem is, actually related to the central problem of COVID policy more generally, the goal seems to be to stop the disease from spreading rather than to reduce the harm from the disease."}, {"time": 7611, "text": "If the goal is to stop the disease from spreading, the sad fact is we have no technology to accomplish that."}, {"time": 7619, "text": "At this point."}, {"time": 7621, "text": "Like it's already deeply integrated into human civilization."}, {"time": 7625, "text": "Well, I mean, it's here forever, right?"}, {"time": 7627, "text": "There's a zero survey of white tail deer in the US."}, {"time": 7631, "text": "It turns out 80% of white tail deer in the US have COVID antibodies."}, {"time": 7635, "text": "Dogs get it, cats get it."}, {"time": 7638, "text": "There's almost certainly human animal transmission of it."}, {"time": 7642, "text": "I mean, presumably, I mean, I've heard bats get it, apparently, so you have a situation where you have this disease that's here to stay."}, {"time": 7651, "text": "And the vaccines don't stop the spread of it, the lockdowns don't stop the spread of it."}, {"time": 7654, "text": "We have no technology to stop the spread of it."}, {"time": 7658, "text": "And so we're burning the earth trying to stop, do something that's impossible rather than working on what's possible."}, {"time": 7667, "text": "And so like letting regular college happen, that's a great good."}, {"time": 7673, "text": "Universities are a wonderful invention and it's contributed so much to society."}, {"time": 7678, "text": "Just decide to shut it down."}, {"time": 7680, "text": "The universities should be fighting tooth and nail to not be shut down, not the other way around."}, {"time": 7687, "text": "Whatever the mechanisms that results in the universities doing that, that's probably, this is me talking, it probably has to do with certain incentives for the administration, probably has to do with lawyers and legal kinds of things to avoid legal trouble."}, {"time": 7701, "text": "But once again, it's when the administration has too much power and too much definition of what the policy is for the university, that's when you get into trouble."}, {"time": 7710, "text": "The beauty, the power of the university should be about the faculty and the students."}, {"time": 7716, "text": "Administration just gets in the way, get out of the way."}, {"time": 7721, "text": "I mean, they can help organize things."}, {"time": 7723, "text": "They play some important role, but they certainly do."}, {"time": 7725, "text": "But they need to remember what the mission is."}, {"time": 7727, "text": "The mission is not safety."}, {"time": 7730, "text": "The mission, actually, universities should be dangerous places for ideas and whatnot."}, {"time": 7735, "text": "What is the role of fear in a pandemic?"}, {"time": 7739, "text": "We've been dancing around it."}, {"time": 7740, "text": "Is it useful?"}, {"time": 7741, "text": "Is it destructive?"}, {"time": 7743, "text": "Or is there sort of a complicated story here?"}, {"time": 7745, "text": "Because they're taking us back into January 2020."}, {"time": 7750, "text": "There was so much uncertainty."}, {"time": 7751, "text": "This could have been a pandemic that is Black Death, the bubonic plague."}, {"time": 7757, "text": "It could have killed hundreds of millions of people."}, {"time": 7762, "text": "We're very new to this."}, {"time": 7765, "text": "We're rusty."}, {"time": 7766, "text": "So there is some value to fear so that you don't do the stupid thing."}, {"time": 7771, "text": "You don't just go on living."}, {"time": 7773, "text": "I guess where I come from, I think it's almost entirely counterproductive."}, {"time": 7776, "text": "I think fear should never be used as a tactic to manipulate human behavior by public health."}, {"time": 7784, "text": "So the fear on the individual level, that feeling of fear, you should be very hesitant about that feeling because it could be easily manipulated by the powerful."}, {"time": 7794, "text": "I think that fear is natural."}, {"time": 7797, "text": "And it's not something that you have to stoke to get when the facts on the ground suggest it, right?"}, {"time": 7807, "text": "In fact, the tendency for humans in the face of threats from infectious disease is to exaggerate the fear in their own minds of being contaminated by the environment and by others."}, {"time": 7819, "text": "That's just natural to humans."}, {"time": 7821, "text": "And the role of public health is not necessarily to eradicate the fear, but obviously technological advances can help eradicate the fear, but it's really to help manage that fear and help people put the sort of incentives that come out of that to useful things as opposed to harmful things."}, {"time": 7843, "text": "What's happened in this pandemic is that there's been a deliberate policy to stoke the fear, to help make people think that the disease is worse than it actually is."}, {"time": 7853, "text": "In survey after survey, you see this."}, {"time": 7856, "text": "And that's been incredibly damaging."}, {"time": 7858, "text": "So young people have readily given away their willingness to participate in regular life because A, they fear COVID more than they ought, and B, they fear that they're gonna harm the vulnerable in their lives."}, {"time": 7874, "text": "You put those two together and you get this powerful demand for lockdowns."}, {"time": 7878, "text": "You see this all over the world."}, {"time": 7880, "text": "Broadly speaking, you have a powerful demand for irrational policies, irrational policies, because I would like to mention the flip side of that."}, {"time": 7889, "text": "I've been saddened to see how much money there is to be made by the martyrs, the people, the conspiracy theorists that tell you you should be afraid of the government."}, {"time": 7906, "text": "You should be afraid of the man."}, {"time": 7909, "text": "It feels like fear is the problem."}, {"time": 7911, "text": "I think there's some guy that once said something about we should fear fear itself."}, {"time": 7918, "text": "He was a president or something."}, {"time": 7919, "text": "I vaguely remember that."}, {"time": 7921, "text": "So I'm worried about both sides here, that."}, {"time": 7926, "text": "Well, I think the general principle is that should not be a tool of public policy, right?"}, {"time": 7931, "text": "The public policy should attempt, and public health policy in particular, should attempt to address that fear."}, {"time": 7936, "text": "It's not that you should tell people lies, of course not."}, {"time": 7942, "text": "Tell people accurately what the risk is."}, {"time": 7946, "text": "Give people tools that have evidence that they can address their risk with and level with people when we don't know."}, {"time": 7956, "text": "I think that is the right adult way to deal with this pandemic from a public health point of view."}, {"time": 7961, "text": "And that is not the policy we have followed."}, {"time": 7964, "text": "Instead, public health is intentionally stoked the fear in order to gain compliance with its edicts."}, {"time": 7970, "text": "And I think the consequence of that is people distrust public health."}, {"time": 7976, "text": "What you're talking about, the distrust of government, I think is partly a consequence of that."}, {"time": 7980, "text": "That movement, which is much smaller once upon a time, is much larger now because of essentially people look at what public health has done and said they've lied to me a whole bunch of times and a whole bunch of things is the general sense."}, {"time": 7995, "text": "And there are consequences to that."}, {"time": 7997, "text": "We're gonna have to work in public health for a long time to try to regain the trust of the public."}, {"time": 8002, "text": "Throughout all of this, you've been inspiring to me, to a lot of people."}, {"time": 8007, "text": "So you've been fearless, bold, in these kind of challenging the policies and not in a martyr kind of way because you're walking the line gracefully and beautifully, I would say."}, {"time": 8024, "text": "And looking at that, I think you're an inspiration to a lot of young people."}, {"time": 8030, "text": "So I have to ask, what advice would you give them if they're thinking of going into science, if they're thinking of having an impact in the world, what advice would you give them about their career and maybe about their life?"}, {"time": 8045, "text": "Thinking about somebody in high school, maybe in undergraduate college."}, {"time": 8049, "text": "I'd say a few things."}, {"time": 8050, "text": "One is, this is a wonderful profession."}, {"time": 8053, "text": "You have an opportunity to improve the lives of so many and do it by having fun, the kind of play we're talking about."}, {"time": 8060, "text": "It's an absolute privilege to be able to work in this kind of area."}, {"time": 8067, "text": "And to young people looking to say, that have some gifts or desire for this area, I say, please, go for it."}, {"time": 8075, "text": "So this area of science broadly."}, {"time": 8077, "text": "Yeah, I mean, it could be, I mean, I don't have any gifts in AI, but like, it could be your buddy, or in health or in medicine or whatever, whatever your gifts lie, develop them, work hard and develop them, because it's worth it."}, {"time": 8090, "text": "It's worth it, not just because you get some status, but because the journey is fun."}, {"time": 8096, "text": "And the result is improvements in the lives of so many."}, {"time": 8100, "text": "So I think that is the encouragement I give."}, {"time": 8103, "text": "I'd also say, if you're looking at this ugliness of this debate that's happened over the pandemic, I'd say to young people, we need you to come in and help transform it."}, {"time": 8113, "text": "Many of the people you see in this debate that behave poorly, I ask you forgive them."}, {"time": 8118, "text": "I've done my best to try, because many of them are acting out of their own sense that they need to do good, but the mistake they've made is in this arrogance and this power."}, {"time": 8132, "text": "So when you come in, remember that example as a negative example."}, {"time": 8135, "text": "And so that when you join the debate, you'll join it in a spirit of humility and a spirit of trying to learn while keeping that love that led you to enter the field in the first place."}, {"time": 8148, "text": "And yeah, choose forgiveness versus like derision."}, {"time": 8154, "text": "Like the people that you know have messed up, like give them a pass, because it feels like that's how improvement starts."}, {"time": 8163, "text": "Funny, I've been thinking this is like, I told you I'm Christian, right?"}, {"time": 8166, "text": "So like God has given me many opportunities to forgive people, learned to practice how to do that."}, {"time": 8172, "text": "Gave you a gift."}, {"time": 8173, "text": "It's a very humbling thing, I guess."}, {"time": 8175, "text": "Is there a memory from when you were young that was very formative to you?"}, {"time": 8182, "text": "So you just gave advice to some young people."}, {"time": 8184, "text": "Is there something that stands out to you that a decision you made, an event that happened that made you the man you are today?"}, {"time": 8195, "text": "I actually grew up in a relatively poor environment."}, {"time": 8198, "text": "Like I was born in India and we moved when I was four."}, {"time": 8202, "text": "My dad had eight brothers and sisters and my mom had four brothers and sisters."}, {"time": 8208, "text": "She grew up in the slum in Calcutta."}, {"time": 8212, "text": "My dad, his dad died when he was young and he supported his family, his brothers and sisters with university scholarship money."}, {"time": 8219, "text": "Came to the US and my dad worked in a McDonald's, even though he's an electrical engineer, couldn't find a job in 1971."}, {"time": 8226, "text": "And so he worked at McDonald's."}, {"time": 8229, "text": "We lived in a, like this, basically the housing port like development in Cambridge, this like this middle building on the 17th floor, this like housing development."}, {"time": 8240, "text": "I mean, I think that was transformative for me."}, {"time": 8245, "text": "Like I didn't realize so much at the time how that experience of being essentially like poor, lower middle class, what effect it had on my outlook."}, {"time": 8256, "text": "You mentioned to me offline that you listened to the conversation that I had with my dad."}, {"time": 8260, "text": "What impact did your dad have on your life?"}, {"time": 8262, "text": "What memories do you have about him?"}, {"time": 8264, "text": "He was a rocket scientist actually."}, {"time": 8266, "text": "He helped design rocket guidance systems."}, {"time": 8271, "text": "He died when I was 20 and I still miss him to this day."}]}]