[{"title": "Avi Loeb: Aliens, Black Holes, and the Mystery of the Oumuamua | Lex Fridman Podcast #154", "id": "plcc6E-E1uU", "quotes": [{"time": 396, "text": "If you are inferior, there is a risk if you speak too loudly, something bad may happen to you."}, {"time": 403, "text": "You mentioned, we should be humble also in the sense, with the analogy to ants, that they might be better than us."}, {"time": 410, "text": "So there's a kind of scale that we're talking about."}, {"time": 418, "text": "And in the question, you mentioned the word sentient."}, {"time": 418, "text": "So sentience, or maybe the more basic formulation is consciousness."}, {"time": 423, "text": "Do you think that this thing within us humans in terms of the typical life form of consciousness is the essential element that permeates other, if there's other alien civilizations out there, that they have something like consciousness as well?"}, {"time": 445, "text": "Or is this, I guess I'm asking, can you try to untangle the word sentient?"}, {"time": 451, "text": "I think what is most abundant, depending on how long it survives."}, {"time": 458, "text": "So if you look at us, as an example, we are now, we do have consciousness and we do have technology."}, {"time": 466, "text": "But the technologies that we are developing are also means for our own destruction, as we can tell."}, {"time": 473, "text": "You know, we can change the climate if we are not careful enough."}, {"time": 478, "text": "We can go into nuclear wars."}, {"time": 478, "text": "So we are developing means for our own destruction through self inflicted wounds."}, {"time": 485, "text": "And it might well be that creatures like us are not long lived, that crocodiles on other planets live for billions of years."}, {"time": 493, "text": "They don't destroy themselves, they live naturally."}, {"time": 500, "text": "And so if you look around, the most common thing would be dumb animals that live for long times, you know, not those that have conscious."}, {"time": 506, "text": "But in terms of changing the environment, I think since, I mean, humans develop tools, they develop the ability to construct technologies that would lift us from this planet that we were born in."}, {"time": 524, "text": "And that's something animals without a conscious, consciousness cannot really do."}, {"time": 528, "text": "And so I, you know, in terms of looking for things that are new, that went beyond the circumstances they were born into, I would think that even if they're short lived, these are the creatures that made the biggest difference to their environment."}, {"time": 550, "text": "And we can search for them, you know, even if they're short lived, and most of the civilizations are dead by now."}, {"time": 555, "text": "Even if that's the case."}, {"time": 555, "text": "That's sad to think about, by the way."}, {"time": 559, "text": "Well, but if you look on Earth, that, you know, there are lots of cultures that existed throughout time, and they're dead by now."}, {"time": 564, "text": "The Mayan culture was very sophisticated, died."}, {"time": 564, "text": "But we can find evidence for it and learn about it just by archaeology, digging into the ground, looking."}, {"time": 575, "text": "And so we can do the same thing in space, look for dead civilizations."}, {"time": 575, "text": "And perhaps we can learn a lesson why they died and behave better so that we will not share the same fate."}, {"time": 581, "text": "So I think, you know, there is a lesson to be learned from the sky."}, {"time": 588, "text": "And by the way, I should also say, if we find a technology that we have not dreamed of, that we can import to Earth, that may be a better strategy for making a fortune than going to Silicon Valley or going to Wall Street."}, {"time": 601, "text": "Because you make a jump start into something of the future."}, {"time": 607, "text": "So that's one way to do the leap is actually to find, to literally discover versus come up with the idea in our own limited human capacity, like a cognitive capacity."}, {"time": 620, "text": "It would look like, it would feel like cheating in an exam where you look over the shoulder of a student next to you."}, {"time": 625, "text": "But it's not good on an exam, but it is good when you're coming up with technology that could change the fabric of human civilization."}, {"time": 635, "text": "But there is, you know, in my neck of the woods of artificial intelligence, there's a lot of trajectories one can imagine of creating very powerful beings, the technology that's essentially, you know, you can call super intelligence that could achieve space exploration, all those kinds of things without consciousness, without something that to us humans looks like consciousness."}, {"time": 661, "text": "And there, you know, there is a sad feeling I have that consciousness too, in terms of us being humble, is a thing we humans take too seriously."}, {"time": 669, "text": "That it's, we think it's special just because we have it."}, {"time": 677, "text": "But it could be a thing that's actually holding us back in some kind of way."}, {"time": 681, "text": "It may well be."}, {"time": 681, "text": "I should say something about AI, because I do think it offers a very important step into the future."}, {"time": 686, "text": "If you look at the Old Testament, the Bible, there is this story about Noah's Ark that you might know about."}, {"time": 693, "text": "Noah knew about a great flood that is about to endanger all life on earth."}, {"time": 701, "text": "So he decided to build an ark."}, {"time": 709, "text": "And the Bible actually talks about specifically what the size of this ark was, what the dimensions were."}, {"time": 715, "text": "Turns out it was quite similar to Oumuamua that we will discuss in a few minutes."}, {"time": 715, "text": "But at any event, he built this ark and he put animals on it so that they were saved from the great flood."}, {"time": 728, "text": "Now, you can think about doing the same on earth, because there are risks for future catastrophes."}, {"time": 736, "text": "You know, we could have the self inflicted wounds that we were talking about, like nuclear war, changing the climate."}, {"time": 740, "text": "Or there could be an asteroid impacting us, just like the dinosaurs died."}, {"time": 746, "text": "The dinosaurs didn't have science, astronomy."}, {"time": 746, "text": "They couldn't have a warning system."}, {"time": 752, "text": "But there was this big stone, big rock that approached them."}, {"time": 752, "text": "It must have been a beautiful sight."}, {"time": 757, "text": "Just when it was approaching, it got very big and then smashed them and killed them."}, {"time": 757, "text": "So you could have a catastrophe like that."}, {"time": 764, "text": "Or in a billion years, the sun will basically boil off all the oceans on earth."}, {"time": 768, "text": "And currently all our eggs are in one basket, but we can spread them."}, {"time": 777, "text": "It's sort of like the printing press, if you think about it."}, {"time": 777, "text": "The revolution that Gutenberg brought is there were very few copies of the Bible at the time, and each of them was precious because it was handwritten."}, {"time": 787, "text": "But once the printing press produced multiple copies, you know, if something bad happened to one of the copies, it wasn't a catastrophe."}, {"time": 793, "text": "You know, it wasn't disaster because you had many more copies."}, {"time": 797, "text": "And so if we have copies of life here on earth elsewhere, then we avoid the risk of it being eliminated by a single point breakdown, catastrophe."}, {"time": 812, "text": "So the question is, can we build NOx spaceship that will carry life as we know it?"}, {"time": 812, "text": "Now, you might think we have to put elephants and whales and birds on a big spaceship, but that's not true because all you need to know is the DNA making, the genetic making of these animals, put it on a computer system that has AI plus a 3D printer so that this CubeSat, which is rather small, can go with this information to another planet and use the raw materials there to produce synthetic life."}, {"time": 849, "text": "And that would be a way of producing copies, just like the Gutenberg printing press."}, {"time": 856, "text": "Yeah, and it doesn't have to be exact copies of the humans, it could just contain some basic elements of life and then have enough life on board that it could reproduce the process of evolution on another place."}, {"time": 869, "text": "So I mean, that also makes you sad, of course, because you confront the mortality of your own little precious consciousness and all your own memories and knowledge and all that stuff."}, {"time": 878, "text": "I care about mine, right?"}, {"time": 878, "text": "And you care about yours."}, {"time": 884, "text": "No, no, I actually don't."}, {"time": 884, "text": "If you're an astronomer, one thing that you learn from the universe is to be modest because you're not so significant."}, {"time": 890, "text": "I mean, think about it, all these emperors and kings that conquered a piece of land on Earth and were extremely proud."}, {"time": 896, "text": "You see these images of kings and emperors that usually are alpha males and they stand strong and they're very proud of themselves."}, {"time": 910, "text": "But if you think about it, there are 10 to the power 20 planets like the Earth in the observable volume of the universe."}, {"time": 915, "text": "And this view of conquering a piece of land and even conquering all of Earth is just like an ant hugging a single grain of sand on the landscape of a huge beach."}, {"time": 929, "text": "That's not very impressive."}, {"time": 929, "text": "So you can't be arrogant."}, {"time": 929, "text": "If you see the big picture, you have to be humble."}, {"time": 935, "text": "Also, we are short lived."}, {"time": 935, "text": "Within 100 years, that's it."}, {"time": 935, "text": "So what does it teach you?"}, {"time": 944, "text": "First to be humble, modest."}, {"time": 944, "text": "You never have significant powers relative to the big scheme of things."}, {"time": 949, "text": "And second, you should appreciate every day that you live and learn about the world."}, {"time": 956, "text": "Humble and still grateful."}, {"time": 956, "text": "Well, let's talk about probably the most interesting object I've heard about and also the most fun to pronounce."}, {"time": 967, "text": "Oumuamua."}, {"time": 967, "text": "Can you tell me the story of this object and why it may be an important event in human history?"}, {"time": 973, "text": "And is it possibly a piece of alien technology?"}, {"time": 981, "text": "So this is the first object that was spotted close to Earth from outside the solar system."}, {"time": 989, "text": "And it was found on October 19th, 2017."}, {"time": 989, "text": "And at that time, it was receding away from us."}, {"time": 998, "text": "And at first, astronomers thought it must be a piece of rock, you know, just like all the asteroids and comets that we have seen from within the solar system."}, {"time": 1009, "text": "And it just came from another star."}, {"time": 1009, "text": "I should say that the actual discovery of this object was surprising to me because a decade earlier, I wrote the first paper together with Ed Turner and Amaya Moro Martin that tried to predict whether the same telescope that was surveying the sky, PanSTARRS from Hawaii, would find anything from interstellar space, given what we know about the solar system."}, {"time": 1032, "text": "So if you assume that other planetary systems have similar abundance of rocks and you just calculate how many should be ejected into interstellar space, the conclusion is no, we shouldn't find anything with PanSTARRS."}, {"time": 1043, "text": "To me, I apologize for probably revealing my stupidity, but it was surprising to me that so few interstellar objects from outside this whole system have ever been detected."}, {"time": 1056, "text": "None has been."}, {"time": 1056, "text": "You do maybe talk about it that there has been one or two rocks since then."}, {"time": 1064, "text": "Well, since then, there was one called the Borisov."}, {"time": 1070, "text": "It was discovered by an amateur Russian astronomer, Gennady Borisov."}, {"time": 1070, "text": "And that one looked like a comet."}, {"time": 1078, "text": "And just like a comet from within the solar system."}, {"time": 1078, "text": "But this is a really important point."}, {"time": 1085, "text": "Sorry to interrupt it."}, {"time": 1085, "text": "You showed that it's unlikely that a rock from another solar system would arrive to ours."}, {"time": 1090, "text": "And so the actual detection of this one was surprising by itself to me."}, {"time": 1096, "text": "But then, so at first they thought maybe it's a comet or an asteroid, but then it didn't look like anything we've seen before."}, {"time": 1104, "text": "Borisov did look like a comet."}, {"time": 1104, "text": "So people asked me afterwards and said, you know, doesn't it convince you if Borisov looks like a comet, doesn't it convince you that Oumuamua is also natural?"}, {"time": 1118, "text": "And I said, you know, when I went on the first date with my wife, she looked special to me."}, {"time": 1124, "text": "And since then I met many women."}, {"time": 1124, "text": "That didn't change my opinion of my wife."}, {"time": 1130, "text": "So, you know, that's not an argument."}, {"time": 1130, "text": "Anyway, so why did the Oumuamua look weird?"}, {"time": 1139, "text": "Let me explain."}, {"time": 1139, "text": "So first of all, astronomers monitored the amount of light, sunlight that it reflects."}, {"time": 1145, "text": "And it was tumbling, spinning every eight hours."}, {"time": 1145, "text": "And as it was spinning, the brightness that we saw from that direction, we couldn't resolve it because it's tiny."}, {"time": 1153, "text": "It's about a hundred meters, a few hundred feet, size of a football field."}, {"time": 1158, "text": "And we cannot, from Earth, with existing telescopes, we cannot resolve it."}, {"time": 1164, "text": "The only way to actually get a photograph of it is to send a camera close to it."}, {"time": 1169, "text": "And that was not possible at the time that Oumuamua was discovered because it was already moving away from us faster than any rocket we can send."}, {"time": 1178, "text": "It's sort of like a guest that appeared for dinner."}, {"time": 1183, "text": "And then by the time we realized that it's weird, the guest is already out the front door into the dark street."}, {"time": 1189, "text": "What we would like to find is an object like it approaching us, because then you can send the camera irrespective of how fast it moves."}, {"time": 1196, "text": "And if we were to find it in July 2017, that would have been possible because it was approaching us at that time."}, {"time": 1207, "text": "Actually, I was visiting Mount Haleakala in Maui, Hawaii with my family for vacation at that time in July 2017, but nobody knew at the observatory that the Oumuamua is very close."}, {"time": 1223, "text": "That's sad to think about that we had the opportunity at that time to send up a camera."}, {"time": 1228, "text": "But don't worry."}, {"time": 1228, "text": "I mean, there will be more."}, {"time": 1228, "text": "There will be more because I operate by the Copernican principle, which says we don't live at a special place and we don't live at a special time."}, {"time": 1235, "text": "And that means if we surveyed the sky for a few years and we had sensitivity to this region between us and the sun, and we found this object with PanStars, there should be many more that we will find in the future with surveys that might be even better."}, {"time": 1255, "text": "And actually, in three years timescale, there would be the so called LSST."}, {"time": 1261, "text": "That's a survey of the Vera Rubin Observatory that would be much more sensitive and could potentially find an Oumuamua like object every month."}, {"time": 1274, "text": "OK, so I'm just waiting for that."}, {"time": 1274, "text": "And the main reason for me to alert everyone to the unusual properties of Oumuamua is with the hope that next time around, when we see something as unusual, we would take a photograph or we would get as much evidence as possible because science is based on evidence, not on prejudice."}, {"time": 1292, "text": "And we will get back to that theme."}, {"time": 1297, "text": "So anyway, let me let me point out some of the properties, actually, the elongated nature, all those kinds of things."}, {"time": 1302, "text": "So the light curve, the amount of light, sunlight that was reflected from it was changing over eight hours by a factor of 10, meaning that the area of this object, even though we can't resolve it, the area on the sky that reflects sunlight was bigger by a factor of 10 in some phases as it was tumbling around than in other phases."}, {"time": 1329, "text": "So even if you take a piece of paper that is razor thin, you know, there is a very small likelihood that it's exactly edge on and getting a factor of 10 change in the area that you see on the sky is huge."}, {"time": 1340, "text": "It's much more than any."}, {"time": 1340, "text": "It means that the object has an unusual geometry."}, {"time": 1347, "text": "It's at least a factor of a few more than any of the comets or asteroids that we have seen before."}, {"time": 1352, "text": "You mentioned reflectivity."}, {"time": 1352, "text": "So it's not just the geometry, but the properties of the surface of that thing."}, {"time": 1355, "text": "Well, if you assume the reflectivity is the same, then it's just geometry."}, {"time": 1362, "text": "If you assume the reflectivity may change, then it could be a combination of the area that you see and the reflectivity because different directions may reflect differently."}, {"time": 1372, "text": "But the point is that it's very extreme."}, {"time": 1372, "text": "And actually the best fit to the light curve that we saw was of a flat object."}, {"time": 1380, "text": "Unlike all the cartoons that you have seen of a cigar shape, a flat object at the 90% confidence gives a better model for the way that the light varied."}, {"time": 1393, "text": "So like flat meaning like a pancake."}, {"time": 1397, "text": "Like a pancake."}, {"time": 1397, "text": "And so that's, you know, the very first unusual property."}, {"time": 1397, "text": "But to me, it was not unusual enough to think that it might be artificial."}, {"time": 1405, "text": "It was not significant enough."}, {"time": 1412, "text": "Then there was no cometary tail, you know, no dust, no gas around this object."}, {"time": 1412, "text": "And the Spitzer Space Telescope really searched very deeply for carbon based molecules."}, {"time": 1418, "text": "There was nothing."}, {"time": 1425, "text": "So it's definitely not a comet the way people expected it to be."}, {"time": 1429, "text": "Can you maybe briefly mention what properties a comet that you're referring to usually has?"}, {"time": 1435, "text": "So a comet is a rock that has some water ice on the surface."}, {"time": 1435, "text": "So you can think of it as an icy rock."}, {"time": 1442, "text": "Actually comets were discovered a long time ago, but the first model that was developed for them was by Fred Whipple, who was at Harvard."}, {"time": 1452, "text": "And I think the legend goes that he got the idea from walking through Harvard Square and seeing during a winter day and seeing these icy rocks, you know."}, {"time": 1466, "text": "So a comet is icy and an asteroid is not."}, {"time": 1470, "text": "It's just a rock."}, {"time": 1472, "text": "So when you have ice on the surface, when the rock gets close to the sun, the sunlight warms it up and the ice sublimates, evaporates."}, {"time": 1478, "text": "Because the one thing about ice, water ice, is it doesn't become liquid if you warm it up in vacuum, you know, without an external pressure."}, {"time": 1493, "text": "It just goes straight into gas."}, {"time": 1493, "text": "And that's what you see as the tail of a comet."}, {"time": 1499, "text": "The only way to get liquid water is to have an atmosphere like on Earth that has an external pressure."}, {"time": 1507, "text": "Only then you get liquid."}, {"time": 1507, "text": "And that's why it's essential to have an atmosphere to a planet in order to have liquid water and the chemistry of life."}, {"time": 1513, "text": "So if you look at Mars, Mars lost its atmosphere and therefore no liquid water on the surface anymore."}, {"time": 1519, "text": "I mean, there may have been early and that's what the Perseverance survey, you know, the Perseverance mission will try to find out whether it had liquid water, whether there was life perhaps on it at the time, but at some point it lost its atmosphere and then the liquid water was gone."}, {"time": 1537, "text": "So the only reason that we can live on Earth is because of the atmosphere."}, {"time": 1544, "text": "But a comet is in vacuum pretty much."}, {"time": 1544, "text": "And then when it gets warmed up on the surface, the water becomes, the water ice becomes gas and then you see this cometary tail behind it."}, {"time": 1558, "text": "In addition to water, there are all kinds of carbon based molecules or dust that comes off the surface."}, {"time": 1565, "text": "And those are detectable."}, {"time": 1565, "text": "Yeah, it's easy to detect."}, {"time": 1565, "text": "It's very prominent."}, {"time": 1571, "text": "You see these cometary tails that look very prominent because they reflect sunlight and you can see them."}, {"time": 1576, "text": "In fact, it's sometimes difficult to see the nucleus of the comet because it's surrounded and shrouded with, and in this case, there was no trace of anything."}, {"time": 1586, "text": "Now you might say, okay, it's not a comet."}, {"time": 1586, "text": "So that's what the community said."}, {"time": 1590, "text": "Okay, it's not a, no problem."}, {"time": 1590, "text": "It's still a rock, you know, it's not a comet, but it's just a rock, bare rock."}, {"time": 1594, "text": "You know, okay, no problem."}, {"time": 1594, "text": "Then, and that's the thing that convinced me to write about it."}, {"time": 1600, "text": "And then in June 2018, you know, significantly later, there was a report that in fact the object exhibited an excess push in addition to the force of gravity."}, {"time": 1615, "text": "So the sun acts on it by gravity, but then there was an extra push on this object that was figured out from the orbit that you can trace."}, {"time": 1620, "text": "And the question was, what is this excess push?"}, {"time": 1626, "text": "So for comets, you get the rocket effect."}, {"time": 1626, "text": "When you evaporate gas, you know, just like a jet engine on an airplane, you throw, a jet engine is very simple."}, {"time": 1632, "text": "You throw the gas back and it pushes the airplane forward."}, {"time": 1638, "text": "That's how the jet."}, {"time": 1638, "text": "So in a case of a comet, you throw gas in the direction of the sun because it, and then you get a push."}, {"time": 1649, "text": "So in the case of comets, you can get a push, but there was no cometary tail."}, {"time": 1649, "text": "So then people say, oh, wait a second."}, {"time": 1654, "text": "Is it an asteroid?"}, {"time": 1654, "text": "No, but it behaves like a comet, but it doesn't look like a comet."}, {"time": 1660, "text": "So what, well, forget about it."}, {"time": 1660, "text": "Business as usual."}, {"time": 1660, "text": "So that's what they mean by a non gravitation acceleration."}, {"time": 1665, "text": "So like the primary force acting on something like just a rock, like an asteroid would be like, you can predict the trajectory based on the gravity, based on gravity."}, {"time": 1677, "text": "And so here there's detected movement that's not, cannot be accounted purely by the gravity of the sun."}, {"time": 1682, "text": "And if it was a comet, you would need about a 10th of the mass of this comet, the weight of this comet to be evaporated in order to give it."}, {"time": 1694, "text": "And there was no sign of that."}, {"time": 1694, "text": "No sign."}, {"time": 1694, "text": "10% of the mass evaporating."}, {"time": 1699, "text": "A hundred meter size object losing 10% of its mass."}, {"time": 1699, "text": "You can't miss that."}, {"time": 1705, "text": "So that's super weird."}, {"time": 1707, "text": "It's super weird."}, {"time": 1708, "text": "Is there a good explanation, is there in your mind a possible explanation for this?"}, {"time": 1712, "text": "So I operated just like Sherlock Holmes in a way."}, {"time": 1712, "text": "I said, okay, what are the possibilities?"}, {"time": 1712, "text": "And the only thing I could think, so I ruled out everything else."}, {"time": 1717, "text": "And I said, it must be the sunlight reflected off it."}, {"time": 1722, "text": "So the sunlight reflects off the surface and gives it a push, just like you get a push on a sail on a boat, you know, from the wind reflecting off it."}, {"time": 1736, "text": "Now, in order for this to be effective, it turns out the object needs to be extremely thin."}, {"time": 1743, "text": "It turns out it needs to be less than a millimeter thick."}, {"time": 1743, "text": "Nature does not produce such things."}, {"time": 1748, "text": "But we produce it because it's called the technology of a light sail."}, {"time": 1748, "text": "So we are, for space exploration, we are exploring this technology because it has the benefit of not needing to carry the fuel with the spacecraft."}, {"time": 1761, "text": "So you don't have the fuel, you just have a sail and it's being pushed either by sunlight or by a laser beam or whatever."}, {"time": 1768, "text": "So perhaps this is the light sail."}, {"time": 1777, "text": "So this is actually the same technology with the Starshot project."}, {"time": 1782, "text": "So people afterwards say, okay, you work on this project, you imagine."}, {"time": 1782, "text": "No, that's a pretty good explanation, right?"}, {"time": 1789, "text": "Obviously, my imagination is limited by what I know."}, {"time": 1789, "text": "So I would not deny that working on light sails expanded my ability to imagine this possibility."}, {"time": 1797, "text": "But let me offer another interesting anecdote."}, {"time": 1803, "text": "In September this year, 2020, there was another object found, and it was given the name 2020SO by the Minor Planet Center."}, {"time": 1813, "text": "This is an organization actually in Cambridge, Massachusetts, that gives names to astronomical objects found in the solar system."}, {"time": 1828, "text": "And they gave it that name 2020SO because, you know, it looked like an object in the solar system and it moved in an orbit that is similar to the orbit of the Earth, but not the same exactly."}, {"time": 1842, "text": "And therefore it was bound to the Sun, but it also exhibited a deviation from what you expect based on gravity."}, {"time": 1849, "text": "So the astronomers that found it extrapolated back in time and found that in 1966, it intercepted the Earth."}, {"time": 1855, "text": "And then they went to the history books and they realized, oh, there was a mission called Lunar Lander Surveyor 2 that had a rocket booster."}, {"time": 1863, "text": "It was a failed mission, but there was a rocket booster that was kicked into space."}, {"time": 1872, "text": "And presumably this is the rocket booster that we're seeing."}, {"time": 1878, "text": "Now, this rocket booster was sufficiently hollow and thin for us to recognize that it's pushed by sunlight."}, {"time": 1883, "text": "So here is my point."}, {"time": 1883, "text": "We can tell from the orbit of an object, obviously this object didn't have any cometary tail."}, {"time": 1890, "text": "It was artificially made."}, {"time": 1890, "text": "We know that it was made by us and it did deviate from an orbit of a rock."}, {"time": 1896, "text": "So just by seeing something that doesn't have cometary tail and deviates from an orbit shaped by gravity, we can tell that it's artificial."}, {"time": 1909, "text": "In the case of Oumuamua, it couldn't have been sent by humans because it just passed near us for a few months."}, {"time": 1915, "text": "We know exactly what we were doing at that time."}, {"time": 1921, "text": "And also it was moving faster than any object that we can launch."}, {"time": 1921, "text": "And so obviously it came from outside the solar system."}, {"time": 1926, "text": "And the question is who produced it?"}, {"time": 1926, "text": "Now, I should say that when I walk on vacation on the beach, I often see natural objects like seashells that are beautiful and I look at them."}, {"time": 1941, "text": "And every now and then I stumble on a plastic bottle that was artificially produced."}, {"time": 1949, "text": "And my point is that maybe Oumuamua was a message in a bottle."}, {"time": 1949, "text": "And this is simply another window into searching for artifacts from other civilizations."}, {"time": 1957, "text": "Where do you think it could have come from?"}, {"time": 1963, "text": "And if it's so, okay, from a scientific perspective, the narrow minded view, as we'll probably talk about throughout, is, you know, you kind of want to stick to the things that, to naturally originating objects like asteroids and comets."}, {"time": 1980, "text": "Okay, that's the space of possible hypotheses."}, {"time": 1986, "text": "And then if we expand beyond that, you start to think, okay, these are artificially constructed."}, {"time": 1992, "text": "Like you just said, it could be by humans."}, {"time": 1992, "text": "It could be by whatever that means, by some kind of extraterrestrial alien civilizations."}, {"time": 1999, "text": "If it's the alien civilization variety, what is this object then?"}, {"time": 2006, "text": "And let me lay out, I mean, we don't have enough evidence to tell."}, {"time": 2014, "text": "If we had a photograph, perhaps we would have more information."}, {"time": 2018, "text": "But there is one other peculiar fact about Oumuamua."}, {"time": 2018, "text": "Well, other than it was very shiny, that I didn't mention, you know, we didn't detect any heat from it."}, {"time": 2027, "text": "And that implies that it's rather small and shiny."}, {"time": 2033, "text": "But the other peculiar fact is that it came from a very special frame of reference."}, {"time": 2040, "text": "So it's sort of like finding a car in a parking lot, in a public parking lot, that, you know, you can't really tell where it came from."}, {"time": 2048, "text": "So there is this frame of reference where you average over the motions of all the stars in the neighborhood of the Sun."}, {"time": 2053, "text": "So you find the so called local standard of rest of the galaxy."}, {"time": 2060, "text": "And that's a frame of reference that is obtained by averaging the random motions of all the stars."}, {"time": 2068, "text": "And the Sun is moving relative to that frame at some speed."}, {"time": 2074, "text": "But this object was at rest in that frame."}, {"time": 2074, "text": "And only one in 500 stars is so much at rest in that frame."}, {"time": 2081, "text": "And that's why I was saying it's like a parking lot."}, {"time": 2081, "text": "It was parked there, and we bumped into it."}, {"time": 2086, "text": "So the relative speed between the solar system and this object is just because we are moving."}, {"time": 2092, "text": "It was sitting still."}, {"time": 2092, "text": "Now you ask yourself, why is it so unusual in that context?"}, {"time": 2099, "text": "Because if it was expelled from another planetary system, most likely it will carry the speed of the host star that it came from."}, {"time": 2106, "text": "Because it was, you know, the most loosely bound objects are in the periphery of the planetary system, and they move very slowly relative to the star."}, {"time": 2119, "text": "And so they carry the, when they are ripped apart from the planetary system, most of the objects will have the residual motion of the star roughly relative to the local star."}, {"time": 2124, "text": "But this one was at rest in the local star."}, {"time": 2130, "text": "Now, one thing I can think of, if there is a grid of road posts, you know, like for navigation system, so that you can find your way in the local frame, then that would be one possibility."}, {"time": 2144, "text": "These are like little sensors of, that's fascinating to think about."}, {"time": 2144, "text": "So there could be, I mean, not necessarily literally a grid, but just evenly, in some definition of evenly spread out set of objects like these that are just out there."}, {"time": 2155, "text": "A lot of them."}, {"time": 2155, "text": "Another possibility is that these are relay stations, you know, for communication."}, {"time": 2161, "text": "You might think, in order to communicate, you need a huge beacon, a very powerful beacon."}, {"time": 2166, "text": "But it's not true."}, {"time": 2166, "text": "Because even on Earth, you know, we have these relay stations."}, {"time": 2172, "text": "So you have a not so powerful beacon."}, {"time": 2177, "text": "So it can be heard only out to a limited distance, but then you relay the message."}, {"time": 2182, "text": "And it could be one of those."}, {"time": 2182, "text": "Now, after it collided with the solar system, of course, it got a kick."}, {"time": 2188, "text": "So it's just like a billiard ball, you know, we gave it a kick by colliding with, but most of them are not colliding with stars."}, {"time": 2193, "text": "And so that's one possibility."}, {"time": 2193, "text": "And there should be numerous, lots of them, if that's the case."}, {"time": 2198, "text": "The other possibility is that it's a probe, you know, that was sent in the direction of the habitable region around the Sun to find out if there is life."}, {"time": 2214, "text": "Now, it takes tens of thousands of years for such a probe to traverse the solar system from the outer edge of the Oort cloud, all the way to where we are."}, {"time": 2220, "text": "And, you know, it's a long journey."}, {"time": 2226, "text": "So when it started the journey from the edge of the solar system to get to us now, you know, we were rather primitive back then, you know, we still didn't have any technology, there was no reason to visit, you know, there was grass around and so forth."}, {"time": 2235, "text": "But, you know, maybe it is a probe."}, {"time": 2240, "text": "So you said 10,000 years, that's faster."}, {"time": 2240, "text": "So it takes that long."}, {"time": 2245, "text": "Tens of thousands, yes."}, {"time": 2245, "text": "Tens of thousands of years."}, {"time": 2245, "text": "And the other thing I should say is, you know, it could be just an outer layer of something else, like, you know, something that was ripped apart, like a surface of an instrument."}, {"time": 2258, "text": "And you can have lots of these pieces, you know, if something breaks, lots of these pieces spread out, like space junk."}, {"time": 2265, "text": "And, you know, that..."}, {"time": 2271, "text": "It could be just space junk from an alien civilization."}, {"time": 2276, "text": "So it's kind of..."}, {"time": 2279, "text": "I should tell you about space junk."}, {"time": 2281, "text": "What do you mean by space junk?"}, {"time": 2283, "text": "So, I think, you know, you might ask, why aren't they looking for us?"}, {"time": 2283, "text": "One possibility is that we are not interesting, like we were talking about ants."}, {"time": 2289, "text": "Another possibility, you know, if there are millions or billions of years into their technological development, they created their own habitat, their own cocoon, where they feel comfortable, they have everything they need."}, {"time": 2308, "text": "And it's risky for them to establish communication with other..."}, {"time": 2308, "text": "So they have their own cocoon and they close off."}, {"time": 2316, "text": "They don't care about anything else."}, {"time": 2316, "text": "Now, in that case, you might say, oh, so how can we find about them if they are closed off?"}, {"time": 2321, "text": "The answer is they still have to deposit trash, right?"}, {"time": 2327, "text": "That is something from the law of thermodynamics."}, {"time": 2327, "text": "There must be some production of trash."}, {"time": 2333, "text": "And, you know, we can still find about them just like investigative journalists going through the trash cans of celebrities in Hollywood, you know."}, {"time": 2340, "text": "You can learn about the private lives of those celebrities by looking at the trash."}, {"time": 2349, "text": "It's fascinating to think, you know, if we are the ants in this picture, if this thing is a water bottle, or if it's like a smartphone, like where on the spectrum of possible objects of space, because there's a lot of interesting trash."}, {"time": 2361, "text": "How interesting is this trash?"}, {"time": 2368, "text": "But imagine a caveman seeing a cell phone."}, {"time": 2368, "text": "The caveman would think, since the caveman played with rocks all of his life, he would say, it's a rock, just like my fellow astronomers said."}, {"time": 2379, "text": "Actually, as a scientist, do you hope it's a water bottle or a smartphone?"}, {"time": 2386, "text": "Because I hope it's even more than a smartphone."}, {"time": 2386, "text": "I hope that it's something that is really sophisticated."}, {"time": 2392, "text": "See, I'm the opposite."}, {"time": 2392, "text": "I feel like I hope it's a water bottle because at least we have a hope with our current set of skills to understand it."}, {"time": 2397, "text": "A caveman has no way of understanding the smartphone."}, {"time": 2403, "text": "It's like, it will be like, I feel like a caveman has more to learn from the plastic water bottle than they do from the smartphone."}, {"time": 2411, "text": "But suppose we figure it out."}, {"time": 2411, "text": "If we, for example, come close to it and learn what it's made of."}, {"time": 2417, "text": "And I guess a smartphone is full of like thousands of different technologies that we could probably pick at."}, {"time": 2422, "text": "Do you have a sense of where a hypothesis of where is the cocoon that it might have come from?"}, {"time": 2433, "text": "No, because, okay, so first of all, you know, the solar system, the outermost edge of the solar system is called the Oort cloud."}, {"time": 2440, "text": "It's a cloud of icy rocks of different sizes that were left over from the formation of the solar system."}, {"time": 2449, "text": "And it's thought to be roughly a ball or a sphere."}, {"time": 2457, "text": "And it's halfway, the extent of it is roughly halfway to the nearest star."}, {"time": 2457, "text": "Okay, so you can imagine each planetary system basically touching the Oort clouds of those stars that are near us are touching each other."}, {"time": 2474, "text": "Space is full of these billiard balls that are very densely packed."}, {"time": 2482, "text": "And what that means is any object that you see, irrespective of whether it came from the local standard."}, {"time": 2488, "text": "So we said that this object is special because it came from a local standard of rest."}, {"time": 2492, "text": "But even if it didn't, you would never be able to trace where it came from because all these Oort clouds overlap."}, {"time": 2498, "text": "So if you take some direction in the sky, you will cross as many stars as you have in that direction."}, {"time": 2506, "text": "Like, there is no way to tell which Oort cloud it came from."}, {"time": 2512, "text": "So yes, I didn't realize how densely packed everything was from the perspective of the Oort cloud."}, {"time": 2517, "text": "So yeah, it could be nearby, it could be very far away."}, {"time": 2521, "text": "Yeah, we have no clue."}, {"time": 2523, "text": "You said cocoon."}, {"time": 2523, "text": "And you kind of paint, I think in the book, I've read a lot of your articles too on the Scientific American, which are brilliant."}, {"time": 2533, "text": "So I'm kind of mixing things up in my head a little bit."}, {"time": 2536, "text": "But what does that cocoon look like?"}, {"time": 2536, "text": "What does a civilization that's able to harness the power of multiple suns, for example, look like?"}, {"time": 2544, "text": "When you imagine possible civilizations that are a million years more advanced than us, what do you think that actually looks like?"}, {"time": 2556, "text": "I think it's very different than we can imagine."}, {"time": 2556, "text": "By the way, I should start from the point that even biological life, just without technology getting into the game, could look like something we have never seen before."}, {"time": 2570, "text": "Take, for example, the nearest star, which is Proxima Centauri."}, {"time": 2575, "text": "It's four and a quarter light years away."}, {"time": 2575, "text": "So they will know about the results of the 2016 elections only next month, in February 2021."}, {"time": 2583, "text": "It's very far away."}, {"time": 2583, "text": "But if you think about it, this star is a dwarf star, and it's twice as cold as the sun."}, {"time": 2596, "text": "And it emits mostly infrared radiation."}, {"time": 2596, "text": "So if there are any creatures on the planet close to it that is habitable, which is called Proxima B, there is a planet in the habitable zone, in the zone just at the right distance where, in principle, liquid water can be on the surface."}, {"time": 2619, "text": "If there are any animals there, they have infrared eyes because our eyes were designed to be sensitive to where most of the sunlight is in the visible range."}, {"time": 2631, "text": "But Proxima Centauri emits mostly infrared."}, {"time": 2631, "text": "So in the nearest star system, these animals would be quite strange."}, {"time": 2640, "text": "They would have eyes that are detectors of infrared, very different from ours."}, {"time": 2646, "text": "Moreover, this planet, Proxima B, faces the star always with the same side."}, {"time": 2646, "text": "So it has a permanent day side and a permanent night side."}, {"time": 2652, "text": "And obviously the creatures that would evolve on the permanent day side, which is much warmer, would be quite different than those on the permanent night side."}, {"time": 2664, "text": "Between them, there would be a permanent sunset strip."}, {"time": 2664, "text": "And my daughters said that that's the best opportunity for high value real estate because you will see the sunset throughout your life, right?"}, {"time": 2677, "text": "The sun never sets on this trip."}, {"time": 2677, "text": "So these worlds are out of our imagination."}, {"time": 2686, "text": "Just even the individual creatures, the sensor suite that they're operating with might be very different."}, {"time": 2690, "text": "Very different."}, {"time": 2690, "text": "So I think when we see something like that, we would be shocked not to speak about seeing technology."}, {"time": 2693, "text": "So I don't even dare to imagine."}, {"time": 2701, "text": "And I think obviously we can bury our head in the sand and say, it's never aliens, like many of my colleagues say."}, {"time": 2707, "text": "And it's a self fulfilling prophecy."}, {"time": 2707, "text": "If you never look, you will never find."}, {"time": 2713, "text": "If you're not ready to find wonderful things, you will never discover them."}, {"time": 2719, "text": "And the other thing I would like to say is reality doesn't care whether you ignore it or not."}, {"time": 2725, "text": "You can ignore reality, but it's still there."}, {"time": 2725, "text": "So we can all agree, based on Twitter, that aliens don't exist."}, {"time": 2732, "text": "That Umuamua was a rock."}, {"time": 2732, "text": "We can all agree."}, {"time": 2732, "text": "And you will get a lot of likes, we will have a big crowd of supporters, and everyone will be happy and give each other awards and honors and so forth."}, {"time": 2744, "text": "But Umuamua might still be an alien artifact."}, {"time": 2744, "text": "Who cares what humans agree on?"}, {"time": 2751, "text": "There is a reality out there."}, {"time": 2751, "text": "And we have to be modest enough to recognize that we should make our statements based on evidence."}, {"time": 2759, "text": "Science is not about ourselves."}, {"time": 2759, "text": "It's not about glorifying our image."}, {"time": 2766, "text": "It's not about getting honors, prizes."}, {"time": 2766, "text": "A lot of the academic activity is geared towards creating your echo chamber where you have students, postdocs, repeating your mantras so that your voice is heard loudly so that you can get more honors, prizes, recognition."}, {"time": 2785, "text": "That's not the purpose of science."}, {"time": 2785, "text": "The purpose is to figure out what nature is."}, {"time": 2791, "text": "And in the process of doing that, it's a learning experience."}, {"time": 2791, "text": "Einstein made three mistakes at the end of his career."}, {"time": 2797, "text": "He argued that in the 1930s, he argued that black holes don't exist, gravitational waves don't exist, and quantum mechanics doesn't have spooky action at a distance."}, {"time": 2812, "text": "And all three turned out to be wrong."}, {"time": 2812, "text": "So the point is that if you work at the frontier, then you make mistakes."}, {"time": 2818, "text": "It's inevitable because you can't tell what is true or not."}, {"time": 2824, "text": "And avoiding making mistakes in order to preserve your image makes you extremely boring."}, {"time": 2824, "text": "You will get a prize, but you will be a boring scientist because you will keep repeating things we already know."}, {"time": 2836, "text": "If you want to make progress, if you want to innovate, you have to take risks and you have to look at the evidence."}, {"time": 2842, "text": "It's a dialogue with nature."}, {"time": 2842, "text": "You don't know the truth in advance."}, {"time": 2842, "text": "You let nature tell you, educate you, and then you realize that what you thought before is incorrect."}, {"time": 2855, "text": "And a lot of my colleagues prefer to be in a state where they have a monologue."}, {"time": 2855, "text": "You know, if you look at these people that work on string theory, they have a monologue."}, {"time": 2860, "text": "They know what, and in fact, their monologue is centered on anti de Sitter space, which we don't live in now."}, {"time": 2873, "text": "To me, it's just like the Olympics."}, {"time": 2873, "text": "You define a hundred meters and you say, whoever runs these hundred meters is the best athlete, the fastest."}, {"time": 2877, "text": "And it's completely arbitrary."}, {"time": 2883, "text": "You could have decided it would be 50 meters or 20 meters."}, {"time": 2883, "text": "You just measure the ability of people this way."}, {"time": 2889, "text": "So you define anti de Sitter space as a space where you do your mathematical gymnastics, and then you find who can do it the best."}, {"time": 2894, "text": "And you give jobs based on that."}, {"time": 2899, "text": "You give prizes."}, {"time": 2899, "text": "But as we said before, you know, nature doesn't care about, you know, the prizes that you give to each other."}, {"time": 2905, "text": "It cares, you know, it has its own reality and we should figure it out."}, {"time": 2912, "text": "And it's not about us."}, {"time": 2912, "text": "The scientific activity is about figuring out nature."}, {"time": 2912, "text": "And sometimes we may be wrong."}, {"time": 2917, "text": "Our image will not be preserved."}, {"time": 2917, "text": "But that's the fun, you know."}, {"time": 2917, "text": "Kids explore the world out of curiosity."}, {"time": 2926, "text": "And I always want to maintain my childhood curiosity."}, {"time": 2926, "text": "And I don't care about the labels that I have."}, {"time": 2932, "text": "In fact, having tenure is exactly the opportunity to behave like a child because you can make mistakes."}, {"time": 2939, "text": "And I was asked by the Harvard Gazette, you know, the Pravda of Harvard, what is the one thing that you would like to change about the world?"}, {"time": 2954, "text": "And I said, I would like my colleagues to behave more like kids."}, {"time": 2954, "text": "That's the one thing I would like them to do."}, {"time": 2961, "text": "Because something bad happens to these kids when they become tenured professors."}, {"time": 2967, "text": "They start to worry about their ego and about themselves more than about the purpose of science, which is, you know, curiosity driven, figuring out from evidence."}, {"time": 2973, "text": "Evidence is the key."}, {"time": 2973, "text": "So when an object shows anomalies like Oumuamua, what's the problem discussing, you know, whether it's artificial or not?"}, {"time": 2984, "text": "You know, so there was, I should tell you, there was a mainstream paper in Nature published saying it must be natural."}, {"time": 2989, "text": "It's unusual, but it must be natural, period."}, {"time": 2996, "text": "And then at the same time, some other mainstream scientists tried to explain the properties."}, {"time": 3004, "text": "And they came up with interpretations like it's a dust bunny, you know, the kind that you find in a household, a collection of dust particles pushed by sunlight, something we have never seen before."}, {"time": 3016, "text": "Or it's a hydrogen iceberg."}, {"time": 3016, "text": "It actually evaporates like a comet, but hydrogen is transparent."}, {"time": 3021, "text": "And that's why we don't see the cometary tail."}, {"time": 3026, "text": "Again, we have never seen something like that."}, {"time": 3026, "text": "In both cases, the objects would not survive the long journey."}, {"time": 3031, "text": "We discussed it in a paper that I wrote afterwards."}, {"time": 3031, "text": "But my point is, those that tried to explain the unusual properties went into great length at discussing things that we have never seen before."}, {"time": 3044, "text": "So even when you think about a natural origin, you have to come up with scenarios of things that were never seen before."}, {"time": 3050, "text": "And by the way, they look less plausible to me personally."}, {"time": 3057, "text": "But my point is, if we discuss things that were never seen before, why not discuss, why not contemplate an artificial origin?"}, {"time": 3063, "text": "What's the problem?"}, {"time": 3067, "text": "Why do people have this pushback?"}, {"time": 3067, "text": "You know, I worked on dark matter, and we don't know what most of the matter in the universe is."}, {"time": 3076, "text": "It's called dark matter."}, {"time": 3076, "text": "It's just an acronym because we have no clue."}, {"time": 3082, "text": "We simply don't know."}, {"time": 3082, "text": "So it could be all kinds of particles."}, {"time": 3082, "text": "And over the years, people suggested weakly interacting massive particles, axions, all kinds of particles."}, {"time": 3086, "text": "And experiments were made."}, {"time": 3092, "text": "They cost hundreds of millions of dollars."}, {"time": 3092, "text": "They put upper limits, constraints that ruled out many of the possibilities that were proposed as natural initially."}, {"time": 3098, "text": "The mainstream community regarded it as a mainstream activity to search the nature of the dark matter."}, {"time": 3110, "text": "And nobody complained that it's speculative to consider weakly interacting massive particles."}, {"time": 3116, "text": "Now, I ask you, why is it speculative to consider extraterrestrial technologies?"}, {"time": 3116, "text": "We have a proof that it exists here on Earth."}, {"time": 3124, "text": "We also know that the conditions of Earth are reproduced in billions of systems throughout the Milky Way galaxy."}, {"time": 3130, "text": "So what's more conservative than to say, if you arrange for similar conditions, you get the same outcome."}, {"time": 3136, "text": "How can you imagine this to be speculative?"}, {"time": 3142, "text": "It's not speculative at all."}, {"time": 3142, "text": "And nevertheless, it's regarded the periphery."}, {"time": 3142, "text": "And at the same time, you have physicists, theoretical physicists, working on extra dimensions, super symmetry, super string theory, the multiverse."}, {"time": 3152, "text": "Maybe we live in a simulation."}, {"time": 3152, "text": "All of these ideas that have no grounding in reality, some of which sound to me like, you know, just like what someone would say."}, {"time": 3167, "text": "Science fiction, basically."}, {"time": 3167, "text": "Because you have no way to test it, you know, through experiments."}, {"time": 3174, "text": "And experiments really are key."}, {"time": 3174, "text": "It's not just the nuance."}, {"time": 3174, "text": "You say, okay, forget about experiments."}, {"time": 3179, "text": "As some philosophers try to say, you know, if there is a consensus, what's the problem?"}, {"time": 3184, "text": "The point is, it's key."}, {"time": 3184, "text": "Then that's what Galileo found."}, {"time": 3184, "text": "It's key to have feedback from reality."}, {"time": 3190, "text": "You know, you can think that you have a billion dollars or that you are more rich than, you know, Elon Musk."}, {"time": 3196, "text": "You can feel very happy about it."}, {"time": 3196, "text": "You can talk about it with your friends and all of you will be happy and think about what you can do with the money."}, {"time": 3202, "text": "Then you go to an ATM machine and you make an experiment."}, {"time": 3206, "text": "You check how much money you have in your checking account."}, {"time": 3211, "text": "And if it turns out that, you know, you don't have much, you can't materialize your dreams."}, {"time": 3219, "text": "So you realize, you have a reality check."}, {"time": 3219, "text": "And my point is, without experiments giving you a reality check, without the ATM machine showing you whether your ideas are bankrupt or not, without putting skin in the game."}, {"time": 3229, "text": "And by skin in the game, I mean, don't just talk about theoretical ideas."}, {"time": 3235, "text": "Make them testable."}, {"time": 3235, "text": "If you don't make them testable, they're worthless."}, {"time": 3241, "text": "They're just like theology that is not testable."}, {"time": 3241, "text": "By the way, theology has some tests."}, {"time": 3241, "text": "Let me give you three examples."}, {"time": 3249, "text": "It turns out that my book already inspired a PhD student at Harvard in the English department to pursue a PhD in that direction."}, {"time": 3257, "text": "And she invited me to the PhD exam a couple of months ago."}, {"time": 3265, "text": "And in the exam, one of the examiners, a professor, asked her, do you know why Giordano Bruno was burnt at the stake?"}, {"time": 3274, "text": "And she said, no, I think it's because he was an obnoxious guy and irritated a lot of people, which is true."}, {"time": 3282, "text": "But the professor said, no, it's because Giordano Bruno said that other stars are just like the sun, and they could have a planet like the Earth around them that could host life."}, {"time": 3296, "text": "And that was offensive to the church."}, {"time": 3303, "text": "Why was it offensive?"}, {"time": 3303, "text": "Because there is the possibility that this life sinned."}, {"time": 3309, "text": "And if that life sinned on planets around other stars, it should have been saved by Christ."}, {"time": 3318, "text": "And then you need multiple copies of Christ."}, {"time": 3318, "text": "And that's unacceptable."}, {"time": 3318, "text": "How can you have duplicates of Christ?"}, {"time": 3325, "text": "And so they burned the guy."}, {"time": 3325, "text": "I'm just like loading this all in because that's kind of brilliant."}, {"time": 3334, "text": "So he was actually already, it's not just about the stars, it's anticipating that there could be other life forms."}, {"time": 3339, "text": "Like why, if this star, if there's other stars, why would it be special?"}, {"time": 3346, "text": "Why would our star be special?"}, {"time": 3346, "text": "He was making the right argument."}, {"time": 3346, "text": "And he would just follow that all along to say like, there should be other Earth like places, there should be other life forms."}, {"time": 3356, "text": "And then there needs to be copies of Christ."}, {"time": 3356, "text": "Yeah, so that was offensive."}, {"time": 3356, "text": "So I said to that professor, I said, great, I wanted to introduce some scientific tone to the discussion."}, {"time": 3362, "text": "And I said, this is great because now you basically laid the foundation for an experimental test of this theology."}, {"time": 3373, "text": "What is the test?"}, {"time": 3373, "text": "We now know that other stars are like the sun and we know they have planets like the Earth around them."}, {"time": 3380, "text": "So suppose we find life there and we figure out that they sinned, then we ask them, did you witness Christ?"}, {"time": 3386, "text": "And if they say no, it means that this theology is ruled out."}, {"time": 3393, "text": "So there is an experimental test."}, {"time": 3393, "text": "So this is experimental test number one."}, {"time": 3398, "text": "Another experimental test, in the Bible, in the Old Testament, Abraham was heard the voice, the voice of God to sacrifice his son, right?"}, {"time": 3406, "text": "Only son."}, {"time": 3406, "text": "And that's what the story says."}, {"time": 3416, "text": "Now, suppose Abraham, my name, by the way, had a voice memo up on his cell phone."}, {"time": 3416, "text": "He could have pressed this up and recorded the voice of God."}, {"time": 3424, "text": "And that would have been experimental evidence that God exists, right?"}, {"time": 3430, "text": "Fortunately, he didn't, but it's an experimental test, right?"}, {"time": 3438, "text": "There is a third example I should tell, and that is Elie Wiesel attributed this story to Martin Buber, but it's not clear whether it's true or not."}, {"time": 3444, "text": "At any event, the story goes that Martin Buber, you know, he was a philosopher and he said, you know, the Christians, you know, the Messiah arrived already and will come back again in the future."}, {"time": 3456, "text": "The Jews argue the Messiah never came and will arrive in the future."}, {"time": 3464, "text": "So he said, why argue?"}, {"time": 3464, "text": "Both sides agree that the Messiah will arrive in the future."}, {"time": 3474, "text": "When the Messiah arrives, we can ask whether he or she will arrive in the future."}, {"time": 3481, "text": "When the Messiah arrives, we can ask whether he or she came before, you know, like visited us and then figure it out."}, {"time": 3489, "text": "And one side."}, {"time": 3489, "text": "So again, experimental test of a theology."}, {"time": 3489, "text": "So even theology, if it puts a skin in the game, you know, if it makes a prediction, could be tested, right?"}, {"time": 3502, "text": "So why can't string theories test themselves?"}, {"time": 3502, "text": "Or why can't, you know, even cosmic inflation?"}, {"time": 3502, "text": "That's a model that, you know, one of the inventors from MIT, Alan Guth, argues that it's not falsifiable."}, {"time": 3515, "text": "My point is a theory that cannot be falsified is not helpful because it means that you can't make progress."}, {"time": 3521, "text": "You cannot improve your understanding of nature."}, {"time": 3521, "text": "The only way for us to learn about nature is by making hypotheses that are testable, doing the experiments and learning whether we are correct or not."}, {"time": 3533, "text": "So B, and coupled that with a curiosity and open mindedness that allows us to explore all kinds of possible hypotheses, but always the pursuit of those, the scientific rigor around those hypotheses is ultimately get evidence."}, {"time": 3546, "text": "Knowledge of what nature is should be a dialogue with nature."}, {"time": 3555, "text": "Rather than a monologue."}, {"time": 3555, "text": "Monologue, beautifully put."}, {"time": 3560, "text": "Can we talk a little bit about the Drake equation?"}, {"time": 3560, "text": "Another framework from which to have this kind of discussion about possible civilizations out there."}, {"time": 3565, "text": "So let me ask, within the context of the Drake equation or maybe bigger, how many alien civilizations do you think are out there?"}, {"time": 3577, "text": "Well, it's hard to tell because the Drake equation is again quantifying our ignorance."}, {"time": 3577, "text": "It's just a set of factors."}, {"time": 3582, "text": "The only one that we know, or actually two that we know quite well is the rate of star formation in the Milky Way galaxy, which we measured by now, and the frequency of planets like the Earth around stars and at the right distance to have life."}, {"time": 3596, "text": "But other than that, there are lots of implicit assumptions about all the other factors that will enable us to detect the signal."}, {"time": 3608, "text": "Now, I should say the Drake equation has a very limited validity just for signals from civilizations that are transmitting at the time that you're observing them."}, {"time": 3615, "text": "However, we can do much better than that."}, {"time": 3622, "text": "We can look for artifacts that they left behind."}, {"time": 3622, "text": "Even if they are dead, you can look for industrial pollution in the atmosphere of planets."}, {"time": 3629, "text": "Why do I bring this up?"}, {"time": 3635, "text": "Again, to show you the conservatism of the mainstream in astronomy."}, {"time": 3640, "text": "And by the way, I have leadership positions."}, {"time": 3640, "text": "I was chair of the astronomy department for nine years, the longest serving chair at Harvard."}, {"time": 3645, "text": "And I'm the chair of the board on physics and astronomy of the National Academies."}, {"time": 3651, "text": "It's a primary board."}, {"time": 3651, "text": "And I'm director of two centers at Harvard and so forth."}, {"time": 3659, "text": "So I do represent the community in various ways."}, {"time": 3659, "text": "But at the same time, I'm a little bit disappointed by the conservatism that people have."}, {"time": 3666, "text": "And so let me give you an illustration of that."}, {"time": 3671, "text": "So the astronomy community actually is going right now through the process of defining its goals for the next decade."}, {"time": 3678, "text": "And there are proposals for telescopes that would cost billions of dollars and whose goal is to find evidence for oxygen in the atmosphere of planets around other stars, with the idea that this would be a marker, a signature of life."}, {"time": 3693, "text": "Now, the problem with that is Earth didn't have much oxygen in its atmosphere for the first two billion years."}, {"time": 3700, "text": "Roughly half of its life, it didn't have much oxygen."}, {"time": 3707, "text": "But it had life."}, {"time": 3707, "text": "It had microbial life."}, {"time": 3707, "text": "It's not it's not clear yet as of yet what the origin is for the rise in the oxygen level after two billion years, about 2.4 billion years ago."}, {"time": 3721, "text": "But we know that a planet can have life without oxygen in the atmosphere because Earth did it."}, {"time": 3730, "text": "The second problem with this approach is that you can have oxygen from natural processes."}, {"time": 3736, "text": "You can break water molecules and make oxygen."}, {"time": 3736, "text": "So even if you find it, it will never tell you that for sure life exists there."}, {"time": 3743, "text": "And so even with these billions of dollars, the mainstream community will never be confident whether there is life."}, {"time": 3750, "text": "Now, how can it be confident?"}, {"time": 3757, "text": "There is actually a way."}, {"time": 3757, "text": "If instead of looking with the same instruments, if you look for molecules that indicate industrial pollution, for example, CFCs that are produced by refrigerating systems or industries here on Earth, that they do the ozone layer, you can search for that."}, {"time": 3770, "text": "And I wrote a paper five years ago suggesting that."}, {"time": 3775, "text": "Now, what's the problem?"}, {"time": 3775, "text": "You can just tell NASA, I want to build this telescope to search for oxygen, but also for industrial pollution."}, {"time": 3788, "text": "Nobody would say that because it sounds like on the periphery of the field."}, {"time": 3788, "text": "And I ask you, why would?"}, {"time": 3796, "text": "Hilarious."}, {"time": 3796, "text": "Because that's exactly, I mean, that would be saying is quite brilliant."}, {"time": 3796, "text": "I mean, because it's a really strong signal."}, {"time": 3802, "text": "And if life, if there's alien civilizations out there, then they're probably going to be many of them."}, {"time": 3809, "text": "And they're probably going to be more advanced than us."}, {"time": 3814, "text": "And they're probably going to have something like industrial pollution, which would be a much stronger signal than some basic gas, which could have a lot of different explanations."}, {"time": 3824, "text": "So like something like oxygen or, I mean, we could talk about signs of life on Venus and so on."}, {"time": 3832, "text": "But if you want a strong signal, it would be pollution."}, {"time": 3832, "text": "I love how garbage is."}, {"time": 3838, "text": "No, but the pollution, you have to understand, we think of pollution as a problem, but on a planet that was too cold, for example, to have a comfortable life on it, you can imagine terraforming it and putting a blanket of polluting gases such that it will be warmer."}, {"time": 3849, "text": "And that would be a positive change."}, {"time": 3856, "text": "So if an industrial or a technological civilization wants to terraform a planet that otherwise is too cold for them, they will do it."}, {"time": 3865, "text": "So what's the problem of defining it as a search goal using the same technologies?"}, {"time": 3871, "text": "The problem is that there is a taboo."}, {"time": 3871, "text": "We're not supposed to discuss extraterrestrial intelligence."}, {"time": 3879, "text": "There is no funding for this subject, not much, very little."}, {"time": 3885, "text": "And young people, because of the bullying on Twitter, you know, all the social media and elsewhere, young people with talent that are curious about these questions do not enter this field of study."}, {"time": 3898, "text": "And obviously, if you step on the grass, it will never grow, right?"}, {"time": 3898, "text": "So if you don't give funding, obviously, you know, the mainstream community says, look, nothing was discovered so far."}, {"time": 3910, "text": "Obviously, nothing would be discovered."}, {"time": 3910, "text": "If talented people go to other districts, you never search for it well enough, you will never find anything."}, {"time": 3915, "text": "I mean, look at gravitational wave astrophysics."}, {"time": 3921, "text": "It's a completely new window into the universe, pioneered by Ray Weiss at MIT."}, {"time": 3926, "text": "And at first, it was ridiculed."}, {"time": 3926, "text": "And thanks to some administrators at the National Science Foundation, it received funding, despite the fact that the mainstream of the astronomy community was very resistant to it."}, {"time": 3939, "text": "And now it's considered a frontier."}, {"time": 3939, "text": "So all these people that I remember as a young postdoc, these people that bashed this field and said bad things about people, you know, said nothing will come out of it."}, {"time": 3951, "text": "Now they say, oh, yeah, of course, you know, the Nobel Prize was given to the LIGO collaboration."}, {"time": 3957, "text": "Of course, now they are supportive of it."}, {"time": 3966, "text": "But my point is, if you suppress innovation early on, there are lots of missed opportunities."}, {"time": 3975, "text": "The discovery of exoplanets is one example."}, {"time": 3975, "text": "You know, in 1952, there was an astronomer called the name Otto Struve."}, {"time": 3981, "text": "And he wrote a paper saying, why don't we search for Jupiter like planets close to their host star?"}, {"time": 3991, "text": "Because if they're close enough, they would move the star back and forth, and we can detect the signal."}, {"time": 3996, "text": "And so astronomers on time allocation committees of telescopes for 40 years argued, this is not possible because we know why Jupiter resides so far from the Sun."}, {"time": 4013, "text": "You cannot have Jupiter so close because there is this region where ice forms far from the Sun."}, {"time": 4019, "text": "And beyond that region is where Jupiter like planets can form."}, {"time": 4019, "text": "There was a theory behind it which ended up being wrong by today's standards."}, {"time": 4023, "text": "But anyway, they did not give time on telescopes to search for such systems until the first system was discovered four decades after Otto Struve's paper."}, {"time": 4034, "text": "And the Nobel Prize was awarded to that just a couple of years ago."}, {"time": 4040, "text": "And then you ask yourself, okay, so science still made progress."}, {"time": 4046, "text": "The problem is that this baby came out barely, and there was a delay of four decades."}, {"time": 4053, "text": "So the progress was delayed."}, {"time": 4053, "text": "And I wonder how many babies were not born because of this resistance."}, {"time": 4059, "text": "So there must be ideas that are as good as this one that were suppressed because they were bullied, because people ridiculed them, that were actually good ideas."}, {"time": 4064, "text": "And these are missed opportunities, babies that were never born."}, {"time": 4071, "text": "And I'm willing to push this frontier of the search for technologies or technological signatures of other civilizations."}, {"time": 4078, "text": "Because when I was young, I was in the military in Israel."}, {"time": 4084, "text": "It's obligatory to serve."}, {"time": 4084, "text": "And there was this saying that one of the soldiers sometimes has to put his body on the barbed wire so that others can go through."}, {"time": 4098, "text": "And I'm willing to suffer the pain so that younger people in the future will be able to speak freely about the possibility that some of the anomalies we find in the sky are due to technological signatures."}, {"time": 4110, "text": "And it's quite obvious."}, {"time": 4110, "text": "This is why I like the folks in artificial intelligence space, Elon Musk and a few others speak about this."}, {"time": 4115, "text": "And they look at the long arc."}, {"time": 4115, "text": "They say like, what, you know, this kind of, you know, you can call it like first principles thinking, or you can call it anything really is like, if we just zoom out from our current bickering and our current, like discussions in the what science is doing, look at the long arc of the trajectory we're headed at."}, {"time": 4139, "text": "Which questions are obviously fundamental to science?"}, {"time": 4139, "text": "And it should be asked, and which is the space of hypothesis we should be exploring?"}, {"time": 4147, "text": "And like exoplanets is a really good example of one that was like an obvious one."}, {"time": 4152, "text": "I recently talked to Sarah Seager, and it was very taboo when she was starting out to work on an exoplanet."}, {"time": 4158, "text": "And that was even in the 90s."}, {"time": 4158, "text": "And like it's obvious should not be a taboo subject."}, {"time": 4164, "text": "And to me, I mean, I'm probably ignorant, but to me, exoplanets seems like it's ridiculous that that would ever be a taboo subject to not fund, to not explore."}, {"time": 4176, "text": "That's very, but even for her, it's now taboo to say, like what, you know, to look for industrial pollution, right?"}, {"time": 4186, "text": "And I find that ridiculous."}, {"time": 4186, "text": "I'll tell you why."}, {"time": 4186, "text": "She can't take the next step."}, {"time": 4191, "text": "It's ridiculous for another reason."}, {"time": 4191, "text": "Not because of just the scientific benefits that we might have by exploring it, but because the public cares about these questions."}, {"time": 4196, "text": "And the public funds science."}, {"time": 4203, "text": "So how dare the scientists shy away from addressing these questions, if they have the technology to do it."}, {"time": 4209, "text": "It's like saying, I don't want to look through Galileo's telescope."}, {"time": 4214, "text": "It's exactly the same."}, {"time": 4214, "text": "You have the technology to explore this question, to find the evidence and you shy away from it."}, {"time": 4219, "text": "You might ask, why do people shy away from it?"}, {"time": 4225, "text": "And perhaps it's because of the fact that there is science fiction."}, {"time": 4225, "text": "I'm not a fan of science fiction, because it has an element to it that violates the laws of physics in many of the books and the films."}, {"time": 4236, "text": "And I cannot enjoy these things when I see the laws of physics violated."}, {"time": 4236, "text": "But who cares that the, you know, the fact that there is science fiction."}, {"time": 4243, "text": "I mean, if you have the scientific methodology to address the same subject, I don't care that other people, you know, spoke nonsense about this subject or said things that make no sense."}, {"time": 4253, "text": "You do your scientific work, just like you explore the dark matter."}, {"time": 4259, "text": "You explore the possibility that umuamua is an artifact."}, {"time": 4265, "text": "You just look for evidence and try to deduce what it means."}, {"time": 4265, "text": "And I have no problem with doing that."}, {"time": 4273, "text": "To me, it sounds like any other scientific question that we have."}, {"time": 4273, "text": "And given the public's interest, we have an obligation to do that."}, {"time": 4278, "text": "By the way, science to me is not an occupation of the elite."}, {"time": 4284, "text": "It doesn't allow me to feel superior to other humans that are unable to understand the math."}, {"time": 4289, "text": "To me, it's a way of life."}, {"time": 4289, "text": "You know, if there is a problem in the faucet or in the pipe at home, I try to figure out what the problem is."}, {"time": 4295, "text": "And with a plumber, we figure it out and we look at the clues."}, {"time": 4301, "text": "And the same thing in science."}, {"time": 4301, "text": "You look at the evidence, you try to figure out what it means."}, {"time": 4307, "text": "It's common sense in a way."}, {"time": 4307, "text": "And it shouldn't be regarded as something removed from the public."}, {"time": 4314, "text": "It should be a reflection of the public's interest."}, {"time": 4314, "text": "And I think it's actually a crime to resist the public."}, {"time": 4319, "text": "If the public says, I care about this, and you say, no, no, no, that's not sophisticated enough for me."}, {"time": 4325, "text": "I want to do intellectual gymnastics on anti the sitter space."}, {"time": 4329, "text": "To me, that's a crime."}, {"time": 4329, "text": "Yes, I 100% agree."}, {"time": 4329, "text": "So it's hilarious that the very, not hilarious, it's sad, that people who are trained in the scientific community to have the tools to explore this world, to be children, to be the most effective at being children, are the ones that resist being children the most."}, {"time": 4351, "text": "But there is a large number of people that embrace the childlike wonder about the world and may not necessarily have the tools to do it."}, {"time": 4364, "text": "That's the more general public."}, {"time": 4364, "text": "And so, I wonder if I could ask you and talk to you a little bit about UFO sightings."}, {"time": 4371, "text": "That there's people, quote unquote believers, there's hundreds of thousands of UFO sightings."}, {"time": 4380, "text": "And I've consumed some of the things that people have said about it."}, {"time": 4380, "text": "And one thing I really like about it is how excited they are by the possibility."}, {"time": 4392, "text": "It's almost like this childlike wonder about the world out there."}, {"time": 4401, "text": "It's not a fear, it's an excitement."}, {"time": 4401, "text": "Do you think, because we're talking about this possibly extraterrestrial object that visited, that flew by Earth, do you think it's possible that out of those hundreds of thousands of UFO sightings, one is an actual, one or some number is an actual sighting of a nonhuman, some alien technology."}, {"time": 4432, "text": "And that we're not, we did not, we're too close minded to look and to see."}, {"time": 4444, "text": "I think to answer this question, we need better evidence."}, {"time": 4444, "text": "My starting point, as I said, out of modesty is that we are not particularly interesting."}, {"time": 4451, "text": "And therefore I would be hard pressed to imagine that someone wants to really spy on us."}, {"time": 4457, "text": "So I would think, as a starting point, that we don't deserve attention and we shouldn't expect someone, but who knows."}, {"time": 4470, "text": "Now, the problem that I have with UFO sighting reports is that 50 years ago, there were some reports of fuzzy images, saucer like things."}, {"time": 4477, "text": "By now, our technologies are much better."}, {"time": 4477, "text": "Our cameras are much more sensitive."}, {"time": 4485, "text": "These fuzzy images should have turned into crisp, clear images of things that we are confident about."}, {"time": 4492, "text": "And they haven't turned that way."}, {"time": 4492, "text": "It's always on the border line of believability."}, {"time": 4498, "text": "And because of that, I believe that it might be most likely artifacts of our instruments or some natural phenomena that we are unable to understand."}, {"time": 4504, "text": "Now, of course, the reason you must examine those, if, for example, pilots report about them or the military finds evidence for them, is because it may pose a national security threat."}, {"time": 4517, "text": "If another country has technologies that we don't know about and they're spying on us, we need to know about it."}, {"time": 4528, "text": "And therefore we should examine everything that looks unusual."}, {"time": 4528, "text": "But to associate it with an alien life is a little too far for me until we have evidence that stands up to the level of scientific credence, that we are 100% sure that from multiple detectors and through a scientific process."}, {"time": 4553, "text": "Now, again, if the scientific community shies away from these reports, we will never have that."}, {"time": 4558, "text": "It's like saying, I don't want to take photographs of something because I know what it is, then you will never know what it is."}, {"time": 4564, "text": "But I think if some scientist, if grants, let's put it this way, if funding will be given to scientists to follow on some of these reports and use scientific instruments that are capable of detecting those sightings with much better resolution, with much better information, that would be great because it will clarify the matter."}, {"time": 4584, "text": "These are not, as you said, hundreds of thousands, these are not once in a lifetime events."}, {"time": 4589, "text": "So it's possible to take scientific instrumentation and explore, go to the ocean where someone reported that there are frequent events that are unusual and check it out, do a scientific experiment."}, {"time": 4602, "text": "Why only do experiments deep into the ocean and look at the oceanography or do other things."}, {"time": 4610, "text": "We can do scientific investigation of these sightings and figure out what they mean."}, {"time": 4617, "text": "I'm very much in favor of that, but until we have the evidence, I would be doubtful as to what they actually mean."}, {"time": 4629, "text": "Yeah, we'll have to be humble and acknowledge that we're not that interesting."}, {"time": 4669, "text": "This is exactly what you're talking about."}, {"time": 4669, "text": "It's like the scientific community is afraid of a topic that inspires millions of people."}, {"time": 4675, "text": "But if you put blinders on your eyes, you don't see it."}, {"time": 4681, "text": "I should say that we do have meteors that we see."}, {"time": 4681, "text": "These are rocks that by chance happen to collide with the earth and they, if they're small, they burn up in the atmosphere."}, {"time": 4694, "text": "But if they're big enough, tens of meters or more, hundreds of meters, the outer layer burns up, but then the core of the object makes it through."}, {"time": 4701, "text": "And this is our chance of putting our hands around an object if this meteor came from interstellar space."}, {"time": 4709, "text": "So one path of discovery is to search for interstellar meteors."}, {"time": 4717, "text": "And with a student of mine, we actually looked through the record and we thought that we found one example of a meteor that was reported that might have come from interstellar space."}, {"time": 4730, "text": "And then another approach is, for example, to look at the moon."}, {"time": 4730, "text": "The moon is different from the earth in the sense that it doesn't have an atmosphere."}, {"time": 4737, "text": "So objects do not burn up on their way to it."}, {"time": 4742, "text": "It's sort of like a museum."}, {"time": 4742, "text": "It collects everything."}, {"time": 4742, "text": "Of rocks from out there in deep space."}, {"time": 4747, "text": "And there is no geological activity on the moon."}, {"time": 4747, "text": "So on earth, every hundred million years, you know, we could have had computer terminals on earth that could have been a civilization like ours with electronic equipment."}, {"time": 4757, "text": "More than a hundred million years ago."}, {"time": 4763, "text": "And it's completely lost."}, {"time": 4763, "text": "You cannot excavate and find it, evidence for it, because in archaeological digs, because the earth is being mixed on these timescales."}, {"time": 4769, "text": "And everything that was on the surface more than a hundred million years ago is buried deep inside the earth right now because of geological activity."}, {"time": 4779, "text": "Fascinating to think about, by the way."}, {"time": 4779, "text": "But on the moon, this doesn't happen."}, {"time": 4784, "text": "The only thing that happens on the moon is you have objects impacting the moon and they go 10 meters deep."}, {"time": 4789, "text": "So they produce some dust, but the moon keeps everything."}, {"time": 4789, "text": "It's like a museum."}, {"time": 4795, "text": "It keeps everything on the surface."}, {"time": 4795, "text": "So if we go to the moon, I would highly recommend regarding it as an archaeological site."}, {"time": 4801, "text": "And looking for objects that are strange."}, {"time": 4801, "text": "Maybe it collected some trash, you know, from interstellar space."}, {"time": 4807, "text": "If we could just linger on the Drake equation for a little bit."}, {"time": 4813, "text": "We kind of talked about there's a lot of uncertainty in the parameters and the Drake equation itself is very limited."}, {"time": 4818, "text": "But I think the parameters are interesting in themselves, even if it's limited, because I think each one is within the reach of science, right?"}, {"time": 4831, "text": "Did you get the evidence for it?"}, {"time": 4831, "text": "I mean, a few I find really interesting, could be interesting to get your comment on."}, {"time": 4836, "text": "So the one with the most variance, I would say, from my perspective, is the length that civilizations last."}, {"time": 4843, "text": "However you define it."}, {"time": 4843, "text": "In the Drake equation, it's the length of how long you're communicating."}, {"time": 4848, "text": "Yeah, transmitting."}, {"time": 4852, "text": "Transmitting."}, {"time": 4852, "text": "Just like you said, that's a wrong way to think about it, because we can be detecting some other outputs of the civilizations, etc."}, {"time": 4859, "text": "But if we just define broadly how long those civilizations last, do you have a sense of how long they might last?"}, {"time": 4864, "text": "Like what are the great filters that might destroy civilizations that we should be thinking about?"}, {"time": 4872, "text": "And how can science give us more hints on this topic?"}, {"time": 4879, "text": "So I, as I mentioned before, operate by the Copernican principle, meaning that we are not special."}, {"time": 4885, "text": "We don't live in a special place and not in a special time."}, {"time": 4891, "text": "And by the way, it's just modesty encapsulated in scientific terms, right?"}, {"time": 4898, "text": "You're saying, I'm not special, you know, I find conditions here, they exist everywhere."}, {"time": 4903, "text": "So if you adopt the Copernican principle, you basically say, our civilization transmitted radio signals for a hundred years, roughly, so probably it would last another hundred or a few hundred and that's it."}, {"time": 4917, "text": "Because we don't live at a special time."}, {"time": 4922, "text": "So that's, you know, well, of course, if we get our act together and we somehow start to cooperate rather than fighting each other, killing each other, you know, wasting a lot of resources on things that would destroy our planet, maybe we can lengthen that period if we get smarter."}, {"time": 4943, "text": "But the most natural assumption is to say that we will live into the future as much as we lived from the time that we start to develop the means for our own destruction, the technologies we have, which is quite pessimistic, I must say."}, {"time": 4955, "text": "So several centuries, that's what I would give, unless we get our act, unless we become more intelligent than the newspapers report every day."}, {"time": 4965, "text": "Point number one."}, {"time": 4965, "text": "Second, and by the way, this is relevant, I should say, because there was a report about perhaps a radio signal detected from Proxima Centauri."}, {"time": 4978, "text": "What do you make of that signal?"}, {"time": 4978, "text": "Oh, I think it's some Australian guy with a cell phone next to the observatory or something like that, because it was the Parkes Telescope in Australia."}, {"time": 4989, "text": "So it's human created noise."}, {"time": 4989, "text": "Which is always the worry because actually the same observatory, the Parkes Observatory, detected a couple of years ago some signal and then they realized that it comes back at lunchtime."}, {"time": 5002, "text": "And they said, okay, what could it be?"}, {"time": 5009, "text": "And then they figured out that it must be the microwave oven in the observatory because someone was opening it before it finished and it was creating this radio signal that they detected with a telescope every lunchtime."}, {"time": 5020, "text": "So just a cautionary remark."}, {"time": 5020, "text": "But the reason I think it's human made, without getting to the technical details, is because of this very short window by which we were transmitting radio signals out of the lifetime of the Earth."}, {"time": 5034, "text": "As I said, 100 years out of four and a half billion years that the Earth existed."}, {"time": 5038, "text": "So what's the chance that another civilization, a twin civilization of ours, is transmitting radio signals exactly at the time that we are looking with our radio telescopes?"}, {"time": 5050, "text": "10 to the minus 7."}, {"time": 5050, "text": "And the other argument I have is that they detected it in a very narrow band of frequencies and that makes it cannot be through natural processes, very narrow band, just like some radio transmissions that we produce."}, {"time": 5074, "text": "But if it were to come from the habitable zone, from a transmitter on the surface of Proxima b, this is the planet that orbits Proxima Centauri, then I calculated that the frequency would drift through the Doppler effect."}, {"time": 5088, "text": "Just like when you hear a siren on the street, when the car approaches you, it has a different pitch than when it recedes away from you, that's the Doppler effect."}, {"time": 5102, "text": "And when the planet orbits the star, Proxima Centauri, you would see or detect a different frequency when the planet approaches us as compared to when it recedes."}, {"time": 5110, "text": "So there should be a frequency drift just because of the motion of the planet."}, {"time": 5114, "text": "And I calculated that it must be much bigger than observed."}, {"time": 5122, "text": "So it cannot just be a transmitter sitting on the planet and sending in our direction a radio signal unless they want to cancel the Doppler effect."}, {"time": 5129, "text": "But then they need to know about us because in a different direction, it will not be cancelled."}, {"time": 5136, "text": "Only in our direction, they can cancel it perfectly."}, {"time": 5140, "text": "So there is this direction of Proxima Centauri, but I have a problem imagining a transmitter on the surface of a planet in the habitable zone emitting it."}, {"time": 5153, "text": "But my main issue is really with the likelihood, given what we know about ourselves."}, {"time": 5161, "text": "In terms of the duration of the civilization."}, {"time": 5163, "text": "The Copernican principle."}, {"time": 5166, "text": "So nevertheless, this particular signal is likely to be a human interference, perhaps."}, {"time": 5166, "text": "But do you find Proxima be interesting?"}, {"time": 5172, "text": "Or the more general question is, do you think we humans will venture out into outside our solar system and potentially colonize other habitable planets?"}, {"time": 5190, "text": "Actually, I am involved in a project whose goal is to develop the technology that would allow us to leave the solar system and visit the nearest stars."}, {"time": 5195, "text": "And that is called the Star Shot."}, {"time": 5195, "text": "In 2015, May 2015, an entrepreneur from Silicon Valley, Yuri Milner, came to my office at Harvard and said, would you be interested in leading a project that would do that in our lifetime?"}, {"time": 5211, "text": "Because as we discussed before, to traverse those distances with existing rockets would take tens of thousands of years."}, {"time": 5225, "text": "And that's too long."}, {"time": 5225, "text": "For example, to get to Proxima Centauri with the kind of spacecrafts that we already sent, like New Horizons or Voyager 1, Voyager 2, you needed to send them when the first humans left Africa, so that they would arrive there now."}, {"time": 5242, "text": "And that's a long time to wait."}, {"time": 5249, "text": "So Yuri wanted to do it within a lifetime, 10, 20 years, meaning it has to move at a fraction of the speed of light."}, {"time": 5256, "text": "So can we send a spacecraft that would be moving at the fraction of the speed of light?"}, {"time": 5262, "text": "And I said, let me look into that for six months."}, {"time": 5262, "text": "And with my students and postdocs, we arrived to the conclusion that the only technology that can do that is the light sail technology, where you basically produce a very powerful laser beam on Earth."}, {"time": 5272, "text": "So you can collect sunlight with photovoltaic cells or whatever and then convert it into stored energy and then produce a very powerful laser beam that is 100 gigawatts and focus it on a sail in space that is roughly the size of a person, a couple of meters or a few meters, that weighs only a gram or a few grams, very thin."}, {"time": 5310, "text": "And through the math, you can show that you can propel such a sail, if you shine on it for a few minutes, it will traverse the distance that is five times the distance to the moon, and it will get to a fifth of the speed of light."}, {"time": 5323, "text": "Sounds crazy."}, {"time": 5323, "text": "But I've talked to a bunch of people and they're like, I know it sounds crazy, but it's actually, it will work."}, {"time": 5334, "text": "This is one of those, it's beautiful."}, {"time": 5334, "text": "I mean, this is science."}, {"time": 5339, "text": "And the point is, people didn't get excited about space since the Apollo era."}, {"time": 5339, "text": "And it's about time, you know, for us to go into space."}, {"time": 5348, "text": "A couple of months ago, I was asked to participate in a debate organized by IBM and Bloomberg News."}, {"time": 5355, "text": "And the discussion centered on the question, is the space race between the US and China good for humanity?"}, {"time": 5362, "text": "And all the other debaters were worried about the military threats."}, {"time": 5368, "text": "And I just couldn't understand what they're talking about, because military threats come from hovering above the surface of the Earth, right?"}, {"time": 5381, "text": "And we live on a two dimensional surface, we live on the surface of the Earth."}, {"time": 5381, "text": "But space is all about the third dimension, getting far from Earth."}, {"time": 5387, "text": "So if you go to Mars, or you go to a star, another star, there is no military threat."}, {"time": 5392, "text": "Space is all about, you know, feeling that, you know, we are one civilization, in fact, not fighting each other, just going far, and having aspirations for something that goes beyond military threats."}, {"time": 5410, "text": "So why would we be worried that the space race will lead?"}, {"time": 5414, "text": "That's actually brilliant."}, {"time": 5414, "text": "I didn't, you know, there's something in our discourse about it, the space race is sometimes made synonymous with like the Cold War or something like that."}, {"time": 5424, "text": "Or with wars."}, {"time": 5424, "text": "But really, yeah, there was a lot of ego tied up in that."}, {"time": 5424, "text": "I remember, I mean, it's still to this day, there's a lot of pride that Russians, Soviet Union was the first to space."}, {"time": 5432, "text": "And there's a lot of pride in the American side that was the first on the moon."}, {"time": 5436, "text": "But yeah, you're exactly right."}, {"time": 5436, "text": "Like, there's no aggression, there's no wars."}, {"time": 5442, "text": "And beyond that, if you think about the global economy, right now, there is a commercial interest."}, {"time": 5447, "text": "That's why Jeff Bezos and Elon Musk are interested about, you know, Mars and so on."}, {"time": 5452, "text": "There is a commercial interest, which is international."}, {"time": 5452, "text": "It's driven by money, not by pride."}, {"time": 5457, "text": "And, you know, nations can sign treaties."}, {"time": 5457, "text": "First of all, there are lots of treaties that were signed even before the First World War and the Second World War and the World War took place."}, {"time": 5468, "text": "So who cares, you know, like humans, treaties do not safeguard anything, you know."}, {"time": 5475, "text": "But beyond that, even if nations sign treaties about space exploration, you might still find commercial entities that will find a way to get their launches."}, {"time": 5481, "text": "And, you know, so I think we should rethink space."}, {"time": 5487, "text": "It has nothing to do with national pride."}, {"time": 5487, "text": "Once again, nothing to do with our egos."}, {"time": 5493, "text": "It's about exploration."}, {"time": 5493, "text": "And the biggest problem, I think, in human history is that humans tend to think about egos and about their own personal image rather than, look at the big picture, you know."}, {"time": 5513, "text": "We will not be around for long."}, {"time": 5513, "text": "We are just occupying a small space right now."}, {"time": 5518, "text": "Now, let's move out of this, you know, the way that Oscar Wilde said, I think is the best."}, {"time": 5518, "text": "He said, all of us are in the gutters, but some of us are looking at the stars."}, {"time": 5531, "text": "Yeah, and the more of us are looking at the stars, the likelier we are to, for this thing, this little experiment we have going on to last a while as opposed to end too quickly."}, {"time": 5538, "text": "I mean, it's not just about science of being humble."}, {"time": 5545, "text": "It's about the survival of the human species as being humble."}, {"time": 5549, "text": "To me, it's incredibly inspiring, the Starshot project of, I mean, there's something magical about being able to go to another habitable planet and take a picture even."}, {"time": 5561, "text": "I mean, within our lifetime, I mean, that, with crazy technology too, which is..."}, {"time": 5569, "text": "I should tell you how it was conceived."}, {"time": 5569, "text": "So, I was at the time, so after six months passed, after the visit of Yuri Miller, I was, usually I go in December during the winter break, I go to Israel."}, {"time": 5582, "text": "I used to go to see my family and I get a phone call just before the weekend started."}, {"time": 5591, "text": "I get a phone call, Yuri would like you to present your concept in two weeks at his home."}, {"time": 5599, "text": "And I said, well, thank you for letting me know because I'm actually out of the door of the hotel to go to a goat farm in the Negev, in the southern part of Israel, because my wife wanted to have to go to a place that is removed from civilization, so to speak."}, {"time": 5619, "text": "So, we went to that goat farm and I need to make the presentation and there was no internet connectivity except in the office of the goat farm."}, {"time": 5627, "text": "So, the following morning at 6am, I sit with my back to the office of that goat farm, looking at goats that were newly born and typing into my laptop, the presentation, the PowerPoint presentation about our ambitions for visiting the nearest star."}, {"time": 5646, "text": "And that was very surreal to me."}, {"time": 5646, "text": "Like our origins in many ways, this very primitive origins and our dreams of looking out that is brilliant."}, {"time": 5656, "text": "So that is incredibly inspiring to me, but it's also inspiring of putting humans onto other moons or planets."}, {"time": 5672, "text": "I still find going to the moon really exciting."}, {"time": 5672, "text": "I don't know, maybe I'm just a sucker for it, but it's really exciting."}, {"time": 5678, "text": "And Mars, which is a new place, a new planet, another planet that might have life."}, {"time": 5684, "text": "I mean, there's something magical to that or some traces of previous life."}, {"time": 5689, "text": "You might think that humans cannot really survive and there are risks by going there."}, {"time": 5689, "text": "But my point is, we started from Africa and we got to apartment buildings in Manhattan, right?"}, {"time": 5695, "text": "It's a very different environment from the jungles to live in an apartment building in a small cubicle."}, {"time": 5709, "text": "And it took tens of thousands of years, but humans adapted, right?"}, {"time": 5713, "text": "So why couldn't humans also make the leap and adapt to a habitat in space?"}, {"time": 5720, "text": "Now you can build a platform that would look like an apartment building in the Bronx or somewhere, but have inside of it everything that humans need."}, {"time": 5726, "text": "And just like the space station, but bigger."}, {"time": 5734, "text": "And it will be a platform in space."}, {"time": 5734, "text": "And the advantage of that is if something bad happens on Earth, you have that complex where humans live."}, {"time": 5740, "text": "And you can also move it back and forth depending on how bright the sun gets."}, {"time": 5747, "text": "Because within a billion years, the sun would be too hot and it will boil off all the oceans on Earth."}, {"time": 5756, "text": "So we cannot stay here for more than a billion years."}, {"time": 5761, "text": "So that's a billion years from now."}, {"time": 5761, "text": "I prefer shorter term deadlines."}, {"time": 5767, "text": "And so there's a lot of threats that we're facing currently."}, {"time": 5767, "text": "Do you find it exciting the possibility of landing on Mars and starting little like building a Manhattan style apartment building on Mars and humans occupying it?"}, {"time": 5782, "text": "Do you think from a scientific or an engineering perspective, that's a worthy pursuit?"}, {"time": 5787, "text": "I think it's worthy."}, {"time": 5787, "text": "But the real issue that is often underplayed is the risk to the human body from cosmic rays."}, {"time": 5795, "text": "These are energetic particles and we are protected from them by the magnetic field around the Earth that blocks them."}, {"time": 5803, "text": "But if you go to Mars, where there is no such magnetic field to block them, then, you know, a significant fraction of the brain cells in your head will be damaged within a year."}, {"time": 5817, "text": "And the consequences of that are not clear."}, {"time": 5824, "text": "I mean, it's quite possible that humans cannot really survive on the surface."}, {"time": 5832, "text": "Now, it may mean that we need to dig tunnels, go underground or create some protection."}, {"time": 5839, "text": "This is something that can be engineered."}, {"time": 5839, "text": "And, you know, we can start from the Moon and then move to Mars."}, {"time": 5843, "text": "That would be a natural progression."}, {"time": 5843, "text": "But it's a big issue that needs to be dealt with."}, {"time": 5849, "text": "I don't think, you know, it's a showstopper."}, {"time": 5849, "text": "I think we can overcome it."}, {"time": 5855, "text": "But, you know, just like anything in science and technology, you have to work on it for a while, figure out solutions."}, {"time": 5860, "text": "But it's not as rosy as Elon Musk talks about."}, {"time": 5860, "text": "I mean, Elon Musk can obviously be optimistic."}, {"time": 5867, "text": "I think eventually it will boil down to figuring out how to cope with this risk, the health risk."}, {"time": 5873, "text": "Yeah, I mean, in defense of optimism, I find that there's at least a correlation, if not their best friends, is optimism and open mindedness."}, {"time": 5879, "text": "It's a necessary precondition to try crazy things."}, {"time": 5890, "text": "And in that sense, the sense I have about going to Mars, if we use today's logic of what kind of benefits we'll get from that, we're never going to go."}, {"time": 5908, "text": "And like most decisions we make in life, most decisions we've made as a human species are irrational if you look at just today."}, {"time": 5914, "text": "But if you look at the long arc and the possibilities that it might bring, just like humans, Europe and destroyed everybody."}, {"time": 5931, "text": "But it was a commercial interest that drove that for trade."}, {"time": 5931, "text": "And, you know, it might happen again, in this context, you have people like Jeff Bezos and Elon Musk that are commercially driven to go to space."}, {"time": 5942, "text": "But it doesn't mean that what we will ultimately find is not new worlds that have nothing, you know, have much more to offer than just commercial interest."}, {"time": 5950, "text": "And as a side effect, almost."}, {"time": 5956, "text": "And then that's why I think, you know, we should be open minded and explore."}, {"time": 5962, "text": "And, however, at the same time, because of the reasons you pointed out, I'm not optimistic that we will survive more than a few centuries into the future, because people do not think long term."}, {"time": 5974, "text": "And that means that we will only survive for the short term."}, {"time": 5974, "text": "I don't know if you have thoughts about this, but what are the things that worry you the most about, from the great perspective of the universe, which is the great filters that destroys intelligent civilizations, but for our own species here?"}, {"time": 5989, "text": "Like, what are the things that worry you the most?"}, {"time": 5995, "text": "Yeah, the thing that worries me the most is that people pay attention to how many likes they have on Twitter."}, {"time": 5999, "text": "And rather than, you know, basketball coaches tell the team players, keep your eyes on the ball, not on the audience."}, {"time": 6010, "text": "The problem is we keep our eyes on the audience most of the time."}, {"time": 6017, "text": "Let's keep our eyes on the ball."}, {"time": 6017, "text": "First of all, in the context of science, it means pay attention to the evidence."}, {"time": 6021, "text": "When the evidence looks strange, then we should figure it out."}, {"time": 6026, "text": "You know, I went to a seminar about Umuamua at Harvard, and a colleague of mine that is mainstream, conservative, would never say anything that would deviate from what everyone else is thinking, said to me after the seminar, I wish this object never existed."}, {"time": 6048, "text": "Now, to me, I mean, I just couldn't hear that."}, {"time": 6048, "text": "What do you mean, nature is whatever it is, you have to pay attention to it."}, {"time": 6056, "text": "You cannot say, you know, you cannot bury your head in this."}, {"time": 6056, "text": "I mean, you should bless nature for giving you clues about things that you haven't expected."}, {"time": 6066, "text": "And I think that's the biggest fault that we are looking for confirmations of things we already know, so that we can maintain our pride that we already knew it, and maintain our image, not make mistakes, because we already knew it, therefore we expected the right thing."}, {"time": 6085, "text": "But science is a learning experience, and sometimes you're wrong."}, {"time": 6085, "text": "And let's learn from those mistakes."}, {"time": 6090, "text": "And what's the problem about that?"}, {"time": 6090, "text": "Why do we have to get, you know, prizes, and why do we get to be honored and maintain our image, when the actual objective of science is learning about nature?"}, {"time": 6103, "text": "And like you've talked about, anomalies in this case are actually are not things that are unfortunate and to be ignored are, in fact, gifts and should be the focus of science."}, {"time": 6114, "text": "Exactly, because that's the way for us to improve our understanding."}, {"time": 6114, "text": "If you look at quantum mechanics, nobody dreamed about it."}, {"time": 6119, "text": "And it was revolutionary, and we still don't fully understand it."}, {"time": 6125, "text": "It's a pain for us to figure out."}, {"time": 6127, "text": "So I understand from the perspective that's holding our science back, why do you have a sense that that's also something that might be a problem for us in terms of the survival of human civilization?"}, {"time": 6142, "text": "Because when you look at society, it operates by the same principles."}, {"time": 6142, "text": "People look for affirmation by groups, and they, you know, people segregate into herds that think like them, especially these days when social media is so strong, you can find your support group."}, {"time": 6159, "text": "And if you don't look for evidence for what you're saying, you can say crazy things as long as there are enough people supporting what you say."}, {"time": 6169, "text": "You can even have your newspapers, you can have everything to support your view, and then, you know, bad things will happen to society."}, {"time": 6179, "text": "Because we're detaching ourselves from reality."}, {"time": 6179, "text": "And if we detach ourselves from reality, all the destructive things that naturally can occur in the real world, whether from nuclear weapons, all the kinds of threats that we're facing, even we're living through a pandemic, the supposed, you know, a much, much worse pandemic could happen."}, {"time": 6193, "text": "And then we could sadly, like we did this one, politicize it in some kind of way and have bickering in the space of Twitter and politics, as opposed to there's an actual thing that can destroy the human species."}, {"time": 6212, "text": "So the only way for us to maintain, to stay modest and learn about what really happens is by looking for evidence."}, {"time": 6217, "text": "Again, I'm saying, it's not about ourself, you know, it's about figuring out what's around us."}, {"time": 6224, "text": "And if you close yourself by surrounding yourself with people that are like minded, that refuse to look at the evidence, you can do bad things."}, {"time": 6237, "text": "And throughout human history, that's the origin of all the bad things that happen."}, {"time": 6243, "text": "And I think it's a key."}, {"time": 6243, "text": "It's a key to be modest and to look at evidence."}, {"time": 6243, "text": "And it's not a nuance."}, {"time": 6247, "text": "Now, you might say, Oh, okay, the uneducated person might operate."}, {"time": 6247, "text": "No, it's the scientific community operates this way."}, {"time": 6255, "text": "My problem is not with people that don't have an academic pedigree."}, {"time": 6261, "text": "It's included everywhere in society."}, {"time": 6264, "text": "On the topic of the discovery of evidence of alien civilizations, which is something you touch on in your book, what that idea would do to societies, to the human psyche and in general, do you think, and you talk about the, I still have trouble pronouncing, but a Muamua wager, right?"}, {"time": 6286, "text": "What do you think is, can you explain it?"}, {"time": 6286, "text": "And what do you think in general is the effect that such knowledge might have on human civilization?"}, {"time": 6298, "text": "So Pascal had this wager about God."}, {"time": 6298, "text": "And by the way, there are interesting connections between theology and the search for extraterrestrial life."}, {"time": 6304, "text": "It's possible that we were planted on this planet by another civilization."}, {"time": 6311, "text": "We attribute to God powers that belong really to the technological civilization."}, {"time": 6319, "text": "But putting that aside, Pascal basically said, there are two possibilities, there are two possibilities, either God exists or not."}, {"time": 6326, "text": "And if God exists, the consequences are quite significant."}, {"time": 6334, "text": "And therefore, we should consider that possibility differently than equal weight to both possibilities."}, {"time": 6342, "text": "And I suggest that we do the same with Muamua or other technological signatures, that we keep in mind the consequences and therefore pay more attention to that possibility."}, {"time": 6358, "text": "Now, some people say extraordinary claims require extraordinary evidence."}, {"time": 6365, "text": "My point is that the term extraordinary is really subjective."}, {"time": 6365, "text": "For one person, a black hole is extraordinary."}, {"time": 6374, "text": "For another, it's just a consequence of Einstein's theory of gravity."}, {"time": 6374, "text": "It's nothing extraordinary."}, {"time": 6380, "text": "The same about the type of dark matter, anything."}, {"time": 6380, "text": "So we should leave the extraordinary part of that sentence."}, {"time": 6387, "text": "Just keep evidence, okay?"}, {"time": 6387, "text": "So let's be guided by evidence."}, {"time": 6395, "text": "And even if we have extraordinary claims, let's not dismiss them because the evidence is not extraordinary enough."}, {"time": 6402, "text": "Because if we have an image of something and it looks really strange and we say, oh, the image is not sufficiently sharp, therefore, we should not even pay attention to this image or not even consider."}, {"time": 6411, "text": "I think that's a mistake."}, {"time": 6411, "text": "What we should do is say, look, there is some evidence for something unusual."}, {"time": 6417, "text": "Let's try and build instruments that will give us a better image."}, {"time": 6422, "text": "And if you just dismiss extraordinary claims, because you consider them extraordinary, you avoid discovering things that you haven't expected."}, {"time": 6429, "text": "And so I believe that along the history of astronomy, there are many missed opportunities."}, {"time": 6437, "text": "And I speak about astronomy, but I'm sure in other fields, it's also true."}, {"time": 6441, "text": "I mean, this is my expertise."}, {"time": 6441, "text": "For example, you know, the Astrophysical Journal, which is the main primary publication in astrophysics."}, {"time": 6447, "text": "If you go before the 1980s, there are images that were posted in the Astrophysical Journal of giant arcs, you know, arcs of light surrounding clusters of galaxies."}, {"time": 6461, "text": "And, you know, you can find it in printed versions of the Astrophysical Journal."}, {"time": 6469, "text": "People just ignore it."}, {"time": 6469, "text": "They put the image, they see the arc, they say, who knows what it is and just ignore it."}, {"time": 6474, "text": "And then in the 1980s, the subject of gravitational lensing became popular."}, {"time": 6480, "text": "And the idea is that you can deflect light by the force of gravity."}, {"time": 6480, "text": "And then you can put a source behind the cluster of galaxies, and then you will get these arcs."}, {"time": 6491, "text": "And actually, Einstein predicted it in 1940."}, {"time": 6496, "text": "And, you know, so these things were expected, but people just had them in the images, didn't pay attention."}, {"time": 6503, "text": "So I'm sure there are lost opportunities sometimes."}, {"time": 6508, "text": "Even in existing data, you have things that are unusual and exceptional and are not being addressed."}, {"time": 6516, "text": "Yeah, you actually, I think you have an article, the data is not enough from quite a few years ago, where you talk, you know, we can go back to the 70s and 80s, but we can go also to the Mayan civilization."}, {"time": 6528, "text": "Right, the Mayan civilization basically believed in astrology that you can forecast the outcome of a war based on the position of the planets."}, {"time": 6533, "text": "And they had, you know, astronomers in their culture had the highest social status."}, {"time": 6540, "text": "They were priests, they were elevated."}, {"time": 6548, "text": "And the reason was that they helped politicians decide when to go to war, because they would tell the politicians, you know, the planets would be in this configuration, it's a better chance for you to win the war, go to war."}, {"time": 6558, "text": "And in retrospect, they collected wonderful data, but misinterpreted it, because we now know that the position of Venus or Jupiter or whatever has nothing to do with the outcome of World War I, World War II, you know, has nothing to do."}, {"time": 6573, "text": "And so we can have a prejudice and collect data without actually doing the right thing with it."}, {"time": 6580, "text": "That's such a Pisces thing to say."}, {"time": 6587, "text": "I looked up what your astrological sign is."}, {"time": 6592, "text": "Well, so you mentioned Einstein predicted that black holes don't exist, or just didn't, or thought."}, {"time": 6598, "text": "Don't exist in nature."}, {"time": 6600, "text": "When Einstein came up with his theory of gravity in 1915, November 1915, a few months later, another physicist, Karl Schwarzschild, he was the director of the Potsdam Observatory, but he was a patriot, a German patriot."}, {"time": 6613, "text": "So he went into the First World War fighting for Germany."}, {"time": 6618, "text": "But while he was at the front, he sent a postcard to Einstein saying, you know, a few months after the theory was developed, saying, actually, I found a solution to your equations."}, {"time": 6627, "text": "And that was a black hole solution."}, {"time": 6627, "text": "And then he died a few months later."}, {"time": 6627, "text": "And Einstein was a pacifist, and he survived."}, {"time": 6634, "text": "So the lesson from this story is that if you want to work out the consequences of a theory, you better be a pacifist."}, {"time": 6640, "text": "But the point is that this solution was known shortly after Einstein came up with his theory."}, {"time": 6647, "text": "But in 1939, Einstein wrote a paper in the Annals of Mathematics saying, even though the solution exists, I don't think it's realized in nature."}, {"time": 6660, "text": "And his argument was, if you imagine a star collapsing, stars often spin, and the spin will prevent them from making a black hole, collapsing to a point."}, {"time": 6671, "text": "So, I mean, can you maybe, one of the many things you have worked on, you're an expert in, is black holes."}, {"time": 6680, "text": "Can you first say, what are black holes?"}, {"time": 6680, "text": "And second, how do we know that they exist?"}, {"time": 6686, "text": "So black holes are the ultimate prison."}, {"time": 6686, "text": "You know, you can check in, but you can never check out."}, {"time": 6693, "text": "You can never check out."}, {"time": 6693, "text": "Even light cannot escape from them."}, {"time": 6693, "text": "So there are extreme structures of space and time."}, {"time": 6700, "text": "And there is this so called Schwarzschild radius or the event horizon of a black hole."}, {"time": 6708, "text": "Once you enter into it with a spaceship, you would never be able to tweet back to your friends and tell them, by the way, I asked the students in my class, freshman seminar at Harvard, I said, let me give you two possible journeys that you can take."}, {"time": 6719, "text": "I said, suppose aliens come to Earth and suggest that you would board their spaceship, would you do it?"}, {"time": 6726, "text": "And the second is, suppose you could board a spaceship that will take you into a black hole, would you do it?"}, {"time": 6740, "text": "So all of them said to the first question, yes, under one condition, that I'll be able to maintain my social media contacts and report back, share the experience with them."}, {"time": 6748, "text": "Personally, I have no footprint on social media."}, {"time": 6756, "text": "Yeah, which is as a matter of principle."}, {"time": 6759, "text": "Yeah, my wife asked me when we got married, and I honor that."}, {"time": 6764, "text": "And I told you offline, I need to get married to such a woman."}, {"time": 6764, "text": "She truly is a special agent."}, {"time": 6769, "text": "Well, she was wise enough to recognize the risk."}, {"time": 6769, "text": "But it saves me time."}, {"time": 6769, "text": "And it also keeps me away from crowds."}, {"time": 6776, "text": "I don't have the notion of what a lot of other people think, so I can think independently."}, {"time": 6784, "text": "Crowd think, exactly."}, {"time": 6784, "text": "So I was surprised to hear that for students, it's extremely important to share experiences."}, {"time": 6791, "text": "Even if they go on a spaceship with aliens, they still want to brag about it rather than look around and see what's going on."}, {"time": 6799, "text": "This is not an option when you go to the black hole, is exactly the point."}, {"time": 6802, "text": "So for the black hole, they said no, because obviously you can find your death after you get into it, you crash into singularity."}, {"time": 6809, "text": "There is this singularity in the center."}, {"time": 6809, "text": "So inside the event horizon, we know that all the matter collects at a point."}, {"time": 6815, "text": "Now, we can't really predict what happens at the singularity because Einstein's theory breaks down."}, {"time": 6824, "text": "And we know why it breaks down, because it doesn't have quantum mechanics that talks about small distances."}, {"time": 6829, "text": "We don't have a theory that unifies quantum mechanics and gravity so that it will predict what happens near a singularity."}, {"time": 6842, "text": "And in fact, a couple of years ago, I had a flood in my basement."}, {"time": 6842, "text": "And I invited a plumber to come over and figure out and we found that the sewer was clogged because of tree roots that got into it."}, {"time": 6860, "text": "And we solved the problem."}, {"time": 6860, "text": "But then I thought to myself, well, isn't that what happens at the singularity of a black hole?"}, {"time": 6868, "text": "Because the question is, where does the matter go?"}, {"time": 6873, "text": "In the case of a home, I never thought about it, but the water, all the water that we use, goes in through the sewer to some reservoir somewhere."}, {"time": 6879, "text": "And the question is, what happens inside a black hole?"}, {"time": 6886, "text": "And one possibility is that there is an object in the middle, just like a star, and everything collects there."}, {"time": 6891, "text": "And the object has the maximum density that we can imagine, like Planck density."}, {"time": 6896, "text": "It's the ultimate density that you can have, where gravity is as strong as all the other forces."}, {"time": 6903, "text": "So you can imagine this object, very dense object at the center that collects all the matter."}, {"time": 6911, "text": "Another possibility is that there is some tunnel just like the sewer."}, {"time": 6915, "text": "It takes the matter into another place."}, {"time": 6915, "text": "And we don't know the answer."}, {"time": 6915, "text": "But I wrote a Scientific American essay about it, admitting our ignorance."}, {"time": 6922, "text": "What happens to the matter that goes into a black hole?"}, {"time": 6928, "text": "I actually recommend it to some of my colleagues that work on string theory."}, {"time": 6932, "text": "At the closing of a conference, I'm the founding director of the Black Hole Initiative at Harvard, which brings together astronomers, physicists, philosophers, and mathematicians."}, {"time": 6942, "text": "And we have a conference once a year."}, {"time": 6942, "text": "And at the end of one of them, since I'm the director, I had to summarize."}, {"time": 6949, "text": "And I said that I wish we could go on a field trip to a black hole nearby."}, {"time": 6956, "text": "And I highly recommend to my colleagues that work on string theory to enter into that black hole, because then they can test their theory when they get inside."}, {"time": 6963, "text": "But one of the string theorists in the audience, Nimar Khani Hamad, immediately raised his voice and said, you have an ulterior motive for sending us into a black hole, which I didn't deny, but at any event."}, {"time": 6981, "text": "Can you say why we know that black holes exist?"}, {"time": 6992, "text": "So it's an interesting question because black holes were considered a theoretical construct."}, {"time": 6998, "text": "And Einstein even denied their existence in 1939."}, {"time": 6998, "text": "But then in the mid 1960s, quasars were discovered."}, {"time": 7011, "text": "These are very bright sources of light, 100 times brighter than their host galaxy, which are point like at the center of galaxies."}, {"time": 7019, "text": "And it was immediately suggested by Ed Salpeter in the West and by Yakov Zeldovich in the East, that these are black holes that accrete gas, collect gas from their host galaxy that are being fed with gas."}, {"time": 7036, "text": "And they shine very brightly because as the gas falls towards the black holes, just like water running down the sink, the gas swirls and then rubs against itself and heats up and shines very brightly because it's very hot close to the black hole."}, {"time": 7061, "text": "By viscosity, it heats up."}, {"time": 7061, "text": "And in the case of black holes, it's the turbulence, the turbulent viscosity that causes it to heat up."}, {"time": 7069, "text": "So we get these very bright sources of light just from black holes that are supposed to be dark, nothing but black holes."}, {"time": 7081, "text": "You know, nothing escapes from them, but they create a violent environment where gas moves close to the speed of light and therefore shines very brightly, much more than any other source in the sky."}, {"time": 7092, "text": "And we can see these quasars all the way to the edge of the universe."}, {"time": 7097, "text": "So we have evidence now that when the universe was, you know, about 7% of its present age, you know, infant, already back then you had black holes of a billion times the mass of the sun, which is quite remarkable."}, {"time": 7110, "text": "It's like finding giant babies in a nursery, you know, like how can these black holes grow so fast?"}, {"time": 7118, "text": "You know, less than a billion years after the Big Bang, you already have a billion times the mass of the sun in these black holes."}, {"time": 7123, "text": "And the answer is presumably there are very quick processes that build them up."}, {"time": 7128, "text": "They build quickly."}, {"time": 7128, "text": "And so we see those black holes, and that was found in the mid 1960s."}, {"time": 7138, "text": "But in 2015, exactly 100 years after Einstein came up with his theory of gravity, the LIGO observatory detected gravitational waves."}, {"time": 7148, "text": "And these are just ripples in space and time."}, {"time": 7156, "text": "So according to Einstein's theory, the innovation, the ingenuity of Einstein's theory of gravity that was formulated in November 1915 was to say that space and time are not rigid."}, {"time": 7170, "text": "You know, they respond to matter."}, {"time": 7170, "text": "So, for example, if you have two black holes and they collide, it's just like a stone being thrown on the surface of a pond."}, {"time": 7180, "text": "They generate waves, disturbances in space and time that propagate out at the speed of light."}, {"time": 7188, "text": "These are gravitational waves."}, {"time": 7193, "text": "They create a space time storm around them, and then the waves go all the way through the universe and reach us."}, {"time": 7199, "text": "And if you have a sensitive enough detector like LIGO, you can detect these waves."}, {"time": 7205, "text": "And so it was not just the message that we received for the first time, gravitational waves, but it was the messenger."}, {"time": 7211, "text": "So there are two aspects to it."}, {"time": 7211, "text": "One is the messenger which is gravitational wave for the first time were detected directly."}, {"time": 7216, "text": "And the second was the message, which was a collision of two black holes, because we could see the pattern of the ripples in space and time."}, {"time": 7227, "text": "And it was fully consistent with the prediction that Schwarzschild made for how the space time around the black hole is, because when two black holes collide, you can sort of map from the message that you get, you can reconstruct what really happened and it's fully consistent."}, {"time": 7249, "text": "And in 2017 and 2020, there's two Nobel prizes."}, {"time": 7249, "text": "That had to do with the black holes."}, {"time": 7260, "text": "Can you maybe describe in the same masterful way that you've already been doing what the 2017 was given for the LIGO collaboration for discovering gravitation waves from collisions of black holes?"}, {"time": 7273, "text": "And the 2020 Nobel prize in physics was given for two things."}, {"time": 7273, "text": "One was theoretical work that was done by Roger Penrose in the 1960s, demonstrating that black holes are inevitable when stars collapse."}, {"time": 7292, "text": "And it was mostly mathematical work."}, {"time": 7292, "text": "And actually, Stephen Hawking also contributed significantly to that frontier."}, {"time": 7301, "text": "And unfortunately, he is not alive, so he could not be honored."}, {"time": 7308, "text": "So Penrose received it on his own."}, {"time": 7308, "text": "And then two other astronomers received it as well, Andrea Ghez and Reinhard Genzel, and they provided conclusive evidence that there is a black hole at the center of the Milky Way galaxy that weighs about 4 million times the mass of the sun."}, {"time": 7323, "text": "And they found the evidence from the motion of stars very close to the black hole."}, {"time": 7330, "text": "Just like we see the planets moving around the sun, there are stars close to the center of the galaxy and they are orbiting at very high speeds of other thousands of kilometers per second or thousands of miles per second per second."}, {"time": 7347, "text": "Which can only be induced at those distances if there is a 4 million solar mass object that is extremely compact."}, {"time": 7357, "text": "And the only thing that is compatible with the constraints is a black hole."}, {"time": 7366, "text": "And they actually made a movie of the motion of these stars around the center."}, {"time": 7374, "text": "One of them moves around the center over a decade, over timescales that we can monitor."}, {"time": 7380, "text": "And it was a breakthrough in a way."}, {"time": 7380, "text": "So combining LIGO with the detection of a black hole at the center of the Milky Way and in many other galaxies like quasars, now I would say black hole research is vogue."}, {"time": 7400, "text": "It's very much in fashion."}, {"time": 7400, "text": "We saw it back in 2016 when we established the black hole initiative."}, {"time": 7408, "text": "You kind of saw that there's this excitement about in breakthroughs and discoveries around black holes which are probably one of the most fascinating objects in the universe."}, {"time": 7422, "text": "It's up there."}, {"time": 7422, "text": "They're both terrifying and beautiful and they capture the entirety of the physics that we know about this universe."}, {"time": 7429, "text": "I should say the question is where is the nearest black hole?"}, {"time": 7433, "text": "Can we visit it?"}, {"time": 7433, "text": "And I wrote a paper with my undergraduate student, Amir Siraj, suggesting that perhaps if there is one in the solar system, we can detect it."}, {"time": 7449, "text": "I don't know if you heard, but there is a claim that maybe there is a planet nine in the solar system because we see some anomalies at the outer parts of the solar system."}, {"time": 7460, "text": "So some people suggested maybe there is a planet out there that was not yet detected."}, {"time": 7460, "text": "So people searched for it, didn't find it."}, {"time": 7466, "text": "It weighs roughly five times the mass of the earth."}, {"time": 7466, "text": "And we said, okay, maybe you can't find it because it's a black hole that was formed early in the universe."}, {"time": 7479, "text": "Where do you stand on that?"}, {"time": 7480, "text": "It could be that the dark matter is made of black holes of this mass."}, {"time": 7480, "text": "We don't know what the dark matter is made of."}, {"time": 7484, "text": "It could be the black holes."}, {"time": 7484, "text": "So we said, but there is an experimental way to test it."}, {"time": 7490, "text": "And the way to do it is because there is the Oort cloud of icy rocks in the outer solar system."}, {"time": 7499, "text": "And if you imagine a black hole there, every now and then a rock will pass close enough to the black hole to be disrupted by the very strong gravity close to the black hole."}, {"time": 7506, "text": "And that would produce a flare that you can observe."}, {"time": 7512, "text": "And we calculated how frequently these flares should occur."}, {"time": 7517, "text": "And with LSST on the Vera Rubin Observatory, we found that you can actually test this hypothesis."}, {"time": 7523, "text": "And if you don't see flares, then you can put limits on the existence of a black hole in the solar system."}, {"time": 7529, "text": "It would be extremely exciting if there was a black hole, if planet nine was a black hole, because we could visit it and we can examine it."}, {"time": 7533, "text": "And it will not be a matter of an object that is very removed from us."}, {"time": 7541, "text": "Another thing I should say is it's possible that the black hole affected life on Earth."}, {"time": 7547, "text": "The black hole at the center of the Milky Way."}, {"time": 7553, "text": "That black hole right now is dormant."}, {"time": 7553, "text": "It's very faint."}, {"time": 7553, "text": "But we know that it flares."}, {"time": 7564, "text": "When a star like the sun comes close to it, the star will be spaghettified, basically become a stream of gas, like a spaghetti."}, {"time": 7570, "text": "And then the gas would fall into the black hole and there would be a flare."}, {"time": 7576, "text": "And this process happens once every 10,000 years or so."}, {"time": 7576, "text": "So we expect that these flares to occur every 10,000 years."}, {"time": 7582, "text": "But we also see evidence for the possibility that gas clouds were disrupted by the black hole, because the stars that are close to the black hole are residing in a single or two planes."}, {"time": 7596, "text": "And the only way you can get that is if they formed out of a disk of gas, just like the planets in the solar system formed."}, {"time": 7602, "text": "So there is evidence that gas fell into the black hole and powered possibly a flare."}, {"time": 7608, "text": "And these flares produce x rays and ultraviolet radiation that could damage life if the Earth was close enough to the center of the galaxy."}, {"time": 7622, "text": "Where we are right now, it's not very risky for us."}, {"time": 7622, "text": "But there is a theoretical argument that says the solar system, the sun, was closer to the galactic center early on, and then it migrated outwards."}, {"time": 7637, "text": "So maybe in the early stage of the solar system, the conditions were affected, shaped by these flares of the black hole at the center of the galaxy."}, {"time": 7647, "text": "And that's why for the first two billion years, there wasn't any oxygen in the atmosphere, who knows."}, {"time": 7651, "text": "But it's just interesting to think that from a theoretical concept that Einstein resisted in 1939, it may well be that black holes have influence on our life."}, {"time": 7664, "text": "And that it's just like discovering that some stranger affected your family and in a way your life."}, {"time": 7671, "text": "And if that happens to be the case, a second Nobel Prize should be given, not for just the discovery of this black hole at the center of the galaxy, but perhaps for the Nobel Prize in chemistry, for the effect that it had."}, {"time": 7695, "text": "For the effect for the interplay that resulted in some kind of, yeah, the chemical effect, biology, I mean, all those kinds of things in terms of the emergence of life and the creation of a habitable environment."}, {"time": 7710, "text": "And of course, like you said, dark matter, like black holes have some..."}, {"time": 7715, "text": "They could be the dark matter in principle, yes."}, {"time": 7715, "text": "We don't know what the dark matter is at the moment."}, {"time": 7721, "text": "Does it make you sad?"}, {"time": 7721, "text": "So you've had an interaction and perhaps a bit of a friendship with Stephen Hawking."}, {"time": 7726, "text": "Does it make you sad that he didn't win the Nobel?"}, {"time": 7732, "text": "Well, all together, I don't assign great importance to prizes because, you know, Jean Paul Sartre, who I admired as a teenager, because I was interested in philosophy."}, {"time": 7738, "text": "When I grew up on a farm in Israel, I used to collect eggs every afternoon and I would drive the tractor to the hills of our village and just think about philosophy, read philosophy books."}, {"time": 7751, "text": "And Jean Paul Sartre was one of my favorites."}, {"time": 7756, "text": "And he was honored with a Nobel Prize in literature."}, {"time": 7756, "text": "He was a philosopher primarily, existentialist."}, {"time": 7762, "text": "And he said, the hell with it."}, {"time": 7762, "text": "Why should I give special attention to this committee of people that get their self importance from awarding me the prize?"}, {"time": 7776, "text": "Why does that merit my attention?"}, {"time": 7776, "text": "So he gave up on the Nobel Prize."}, {"time": 7776, "text": "And you know, there are two benefits to that."}, {"time": 7784, "text": "One, that you're not working your entire life in the direction that would satisfy the will of other people."}, {"time": 7792, "text": "You work independently, you're not after these honors."}, {"time": 7797, "text": "Just for the same reason that if you're not living your life for making a profit or money, you can live a more fulfilling life because you're not being swayed by the wind, you know, of how to make money and so forth."}, {"time": 7850, "text": "And that's the natural way that science is, you know, it's a learning experience."}, {"time": 7854, "text": "So if you give the public an image by which scientists are always right, you know, and you know, some of my colleagues say we must do that, because otherwise the public will never believe us that global warming is really taking place."}, {"time": 7870, "text": "But that's not true, because the public would really believe you if you show the evidence."}, {"time": 7870, "text": "So the point is, you should be sincere."}, {"time": 7875, "text": "When the evidence is not absolutely clear, or where there are disputes about the interpretation of the evidence, we should show ourselves."}, {"time": 7879, "text": "You know, the king is naked, okay?"}, {"time": 7883, "text": "There is no point in pretending that the king is dressed, saying that scientists are always right."}, {"time": 7890, "text": "Scientists are wrong, frequently."}, {"time": 7890, "text": "And the only way to make progress is by evidence, giving us the support that we need to make airtight arguments."}, {"time": 7896, "text": "So when you say global warming is taking place, if the evidence is fully supportive, there are no holes in the argument, then people will be convinced, because you're not trying to fool them."}, {"time": 7909, "text": "When the evidence was not complete, you also show them that the evidence is not complete."}, {"time": 7918, "text": "And when there's holes, you show that there's holes, and here's the methodology we're using to try to close those holes."}, {"time": 7922, "text": "Let's be sincere."}, {"time": 7922, "text": "Why pretend?"}, {"time": 7922, "text": "So if there were no, in a world where there were no prizes, no honours, we would act like kids, as I said before."}, {"time": 7933, "text": "We would really be focusing on the ball and not on the audience."}, {"time": 7933, "text": "Yeah, the prizes get in the way, and it's so powerful."}, {"time": 7939, "text": "Do you think, in some sense, the few people that have turned down the prize made a much more powerful statement?"}, {"time": 7946, "text": "I don't know if you're familiar in the space of mathematics with the Fields Medal and Google Perlman turned down the prize."}, {"time": 7951, "text": "One of the reasons I started this podcast is I'm going to definitely talk to Putin, I'm definitely talking to Perlman, and people keep telling me it's impossible."}, {"time": 7966, "text": "I love hearing that, because I'll talk to both."}, {"time": 7972, "text": "Anyway, but do you have a sense of why he turned down the prize, and is that a powerful statement to you?"}, {"time": 7980, "text": "Well, what I read is that he was disappointed by the response of the community, the mainstream community, the mathematicians, to his earlier work, where they dismissed it, they didn't attend to the details, and didn't treat him with proper respect, because he was not considered one of them."}, {"time": 8004, "text": "And I think that speaks volumes about the current scientific culture, which is based on groupthink and on social interaction, rather than on the merit of the argument, and on the evidence in the context of physics."}, {"time": 8022, "text": "So in mathematics there is no empirical basis, you're exploring ideas that are logically consistent, but nevertheless there is this groupthink."}, {"time": 8034, "text": "And I think he was so frustrated with his past experience that he didn't even bother to publish his papers, he just posted them on the archive, and in a way saying, you know, I know what the answer is, go look at it."}, {"time": 8049, "text": "And then again, in the long arc of history, his work on archive will be remembered, and all the prizes, most of the prizes will be forgotten, that's what people don't kind of think about."}, {"time": 8063, "text": "When you look at Roger Penrose, for example, is another fascinating figure, you know, it's possible, and forgive me if this, I'm sure, my ignorance, but he's also did some work on consciousness."}, {"time": 8075, "text": "He's been one of the only people who spoke about consciousness, which for the longest time, and is still arguably outside the realm of the sciences."}, {"time": 8087, "text": "It's still seen as a taboo subject, and he was brave enough to explore it from a physics perspective, from just a philosophical perspective, but like with the rigor, like proposing different kind of hypotheses of how consciousness might be able to emerge in the brain, and it's possible that that is the thing he's remembered for if you look 100 years from now, right?"}, {"time": 8111, "text": "As opposed to the work in the black holes, which fits into what the current scientific community allows to be the space of what is and isn't science."}, {"time": 8122, "text": "Yeah, it's really interesting to look at people that are innovators, where in some phases of their career, their ideas fit into the social structure that is around them, but in other phases, it doesn't."}, {"time": 8137, "text": "And when you look at them, they just operated the same way throughout, and it says more about their environment than about them."}, {"time": 8151, "text": "Well, yeah, and I don't know if you know who Max Tegmark is, I just recently talked to him."}, {"time": 8155, "text": "He's a friend of mine."}, {"time": 8156, "text": "I just recently talked to him again, and he, I mean, he was a little bit more explicit about saying, you know, being aware, which is something I also recommend, is like being aware where the scientific community stands, and doing enough to get, like move along into your career, in your career."}, {"time": 8171, "text": "And it's the necessary evil, I suppose, if you are one of those out of the box thinkers that just naturally have this childlike curiosity, which Max definitely is one of them, is sometimes you have to do some stuff that fits in, you publish and you get tenure and all those kinds of things."}, {"time": 8187, "text": "But the tenure is a great privilege because it allows you to, in principle, explore things that are not accepted by others."}, {"time": 8192, "text": "And unfortunately, it's not being taken advantage of by most people, and it's a waste of a very precious resource."}, {"time": 8203, "text": "The space that you kind of touched on that's full of theories and is perhaps detached from appreciation of empirical evidence, or longing for empirical evidence, or grounding in empirical evidence, is the theoretical physics community and the interest in unifying the laws of physics and with the theory of everything."}, {"time": 8227, "text": "I'm not sure from which direction to approach this question, but how far away are we from arriving at a theory of everything, do you think?"}, {"time": 8235, "text": "And how would we, how important is it to try to arrive at it, at this kind of goal of this beautiful simple theory that unlocks the very, you know, fundamental basis of our nature as we know it?"}, {"time": 8253, "text": "And, you know, and how, what are the kinds of approaches we need to take to get there?"}, {"time": 8270, "text": "Yeah, so in physics, the biggest challenge is to unify quantum mechanics with gravity."}, {"time": 8276, "text": "And I believe that once we have experimental evidence for how this happens in nature, in systems that have quantum mechanical effects, but also gravity is important, then the theory will fall into our lap, okay?"}, {"time": 8289, "text": "But the mistake that is made by the community right now is to come up with the right theory from scratch."}, {"time": 8297, "text": "And, you know, Einstein gave the illusion that you can just sit in your office and understand nature, you know, when he came up with his general theory of relativity."}, {"time": 8310, "text": "But, you know, first of all, perhaps he was lucky, but it's not a rule."}, {"time": 8318, "text": "The rule is that you need evidence to guide you, especially when dealing with quantum mechanics, which is really not intuitive."}, {"time": 8322, "text": "And so there are two places where the two theories meet."}, {"time": 8332, "text": "One is black holes, and there is a puzzle there."}, {"time": 8332, "text": "It's called the information paradox."}, {"time": 8338, "text": "In principle, you can throw the Encyclopedia Britannica into a black hole."}, {"time": 8338, "text": "It's a lot of information."}, {"time": 8342, "text": "And then it will be gone because a black hole carries only three properties or qualities, the mass, the charge, and the spin, according to Einstein."}, {"time": 8352, "text": "But then when Hawking tried to bring in quantum mechanics to the game, he realized that black holes have a temperature and they radiate."}, {"time": 8366, "text": "This is called Hawking radiation."}, {"time": 8366, "text": "It was sort of anticipated by Jacob Bekenstein before him, and Hawking wanted to prove Bekenstein wrong and then figure this out."}, {"time": 8382, "text": "And so what it means is black holes eventually evaporate."}, {"time": 8382, "text": "And they evaporate into radiation that doesn't carry this information, according to Hawking's calculation."}, {"time": 8388, "text": "And then the question is, according to quantum mechanics, information must be preserved."}, {"time": 8393, "text": "So where did the information go if a black hole is gone?"}, {"time": 8400, "text": "And where is the information that was encoded in the Encyclopedia when it went into the black hole?"}, {"time": 8406, "text": "And to that question, we don't have an answer yet."}, {"time": 8406, "text": "It's one of those puzzles about black holes."}, {"time": 8412, "text": "And it touches on the interplay between quantum mechanics and gravity."}, {"time": 8417, "text": "Another important question is what happened at the beginning of the universe?"}, {"time": 8424, "text": "What happened before the Big Bang?"}, {"time": 8424, "text": "And by the way, on that, I should say, you know, there are some conjectures."}, {"time": 8431, "text": "In principle, if we figure it out, if we have a theory of quantum gravity, it's possible to imagine that we will figure out how to create a universe in the laboratory."}, {"time": 8443, "text": "And by irritating the vacuum, you might create a baby universe."}, {"time": 8443, "text": "And if we do that, it will offer a solution to what happened before the Big Bang."}, {"time": 8450, "text": "Perhaps the Big Bang emerged from the laboratory of another civilization."}, {"time": 8455, "text": "So it's like baby universes are being born out of laboratories."}, {"time": 8461, "text": "And inside the baby universe, you have a civilization that brings to existence a new baby universe."}, {"time": 8467, "text": "So just like humans, right?"}, {"time": 8467, "text": "We have babies and they make babies."}, {"time": 8467, "text": "So in principle, that would solve the problem of why there was a Big Bang and also what happened before the Big Bang."}, {"time": 8479, "text": "So we came, our umbilical cord is connected to a laboratory of a civilization that produced our universe once it figured out quantum gravity, you know."}, {"time": 8486, "text": "It's baby Big Bangs all the way down."}, {"time": 8496, "text": "So if we collect data about how the universe started, we could potentially test theories of, or it can educate us about how to unify quantum mechanics and gravity."}, {"time": 8505, "text": "If we get any information about what happens near the singularity of a black hole, you know, if we get a sense of, you know, somehow we learn what happens at the same, that would educate."}, {"time": 8516, "text": "So there are places where we can search for evidence, but it's very challenging, I should say."}, {"time": 8523, "text": "And my point is, you know, the string theorists, they decided that they know how to approach the problem, that they don't have a single theory."}, {"time": 8528, "text": "There is a multitude of theories and it's not tightly constrained and they cannot make predictions about black holes or about the beginning of the universe."}, {"time": 8541, "text": "So at the moment I say we're at a loss."}, {"time": 8541, "text": "And the way I feel about this concept of the theory of everything, we should wait until we get enough evidence to guide us."}, {"time": 8552, "text": "And until then, you know, there are many important problems that we can address, you know."}, {"time": 8556, "text": "Why bang our head against the wall on a problem for which we have no guidance?"}, {"time": 8563, "text": "We don't have a good dance partner in terms of evidence."}, {"time": 8563, "text": "There's not."}, {"time": 8567, "text": "I mean, it'd be interesting, just like you said, I mean, the lab is one place to create universes or black holes, but it'd be fascinating if there is indeed a black hole in our solar system that you can interact with."}, {"time": 8578, "text": "So the problem with the origin of the universe is all you can do is collect data about it, right?"}, {"time": 8583, "text": "You can't interact with it."}, {"time": 8587, "text": "Well, you can, for example, detect gravitational waves that emerged from that."}, {"time": 8587, "text": "And, you know, there is an effort to do that and that could potentially tell us something."}, {"time": 8593, "text": "But yeah, it's a challenge and that's why we're stuck."}, {"time": 8598, "text": "So I should say, despite what physicists portray, that, you know, we live through an exceptional growth in our understanding of the universe, we're actually pretty much stuck, I would say, because we don't know the nature of the dark matter."}, {"time": 8616, "text": "Most of the matter in the universe, we don't know what it is."}, {"time": 8616, "text": "And we don't know how the universe started."}, {"time": 8620, "text": "We don't know what happens in the interior of a black hole."}, {"time": 8625, "text": "Because you've thought quite a bit about dark matter as well."}, {"time": 8625, "text": "Do you have any kind of hypothesis, interesting hypothesis?"}, {"time": 8630, "text": "We already mentioned a few about what is dark matter and what are the possible paths that we could take to unlock the mystery of dark?"}, {"time": 8635, "text": "What is dark matter?"}, {"time": 8641, "text": "So what we need is some anomalies that would hint what the nature of the dark matter is, or to detect it in the laboratory."}, {"time": 8647, "text": "There are lots of laboratory experiments searching, but it's like searching for a needle in a haystack, because there are so many possibilities for the type of particle that it may be."}, {"time": 8655, "text": "But maybe at some point, you know, we'll find either a particle or black holes as the dark matter, or something else."}, {"time": 8661, "text": "But at the moment... Can you also maybe, sorry to interrupt, comment about what is dark matter?"}, {"time": 8670, "text": "Like what, it's just a name we assign to what?"}, {"time": 8673, "text": "So most of the community believes that it's a particle that we haven't yet detected."}, {"time": 8673, "text": "It doesn't interact with light, so it's dark."}, {"time": 8680, "text": "But the question is, what does it interact with, and how can we find it?"}, {"time": 8686, "text": "And for many years, physicists were guided by the idea that it's some extension of the standard model of particle physics."}, {"time": 8692, "text": "But then they said, oh, we will find some clues from the Large Hadron Collider about its nature."}, {"time": 8697, "text": "Or maybe it's related to supersymmetry, which is a new symmetry that we haven't found any evidence for."}, {"time": 8707, "text": "In both cases, the Large Hadron Collider did not give us any clues."}, {"time": 8707, "text": "And other people search for specific types of particles in the laboratory and didn't find any."}, {"time": 8713, "text": "A couple of years ago, actually, around the time that I worked on Oumuamua, I also worked on the possibility that the dark matter particles may have a small electric charge, which is a speculation, but nobody complained about it."}, {"time": 8732, "text": "And, you know, it was published and I regarded it more as of a speculation than the artificial origin of Oumuamua."}, {"time": 8738, "text": "And to me, I apply, you know, as far as I'm concerned, I apply the same scientific tools in both cases."}, {"time": 8744, "text": "There is an anomaly that led me to that discussion, which has to do with hydrogen being cold in the early universe more than we expected."}, {"time": 8755, "text": "So we suggested maybe the dark matter particles have some small charge."}, {"time": 8759, "text": "But then you deal with anomalies by exploring possibilities."}, {"time": 8759, "text": "That's the only way to do it, and then collecting more data to check those."}, {"time": 8765, "text": "And searching for technological signatures is the same as any other part of our scientific endeavor."}, {"time": 8774, "text": "We make hypotheses and we collect data, and I don't see any reason for having a taboo on this subject."}, {"time": 8787, "text": "In your childlike, open minded excitement and approach to science, you're, I think, to anyone listening to this, truly inspiring."}, {"time": 8793, "text": "I mean, the question I think is useful to ask is by way of advice for young people."}, {"time": 8798, "text": "A lot of young people listen to this, whether from all over the world, and teenagers, undergraduate students, even graduate students, even young faculty, even older faculty, they're all young at heart."}, {"time": 8813, "text": "Like there's many of them young at heart."}, {"time": 8818, "text": "Do you have advice for, but let's focus on the traditionally defined sort of young folks that kind of graduate."}, {"time": 8824, "text": "Do you have advice to give to young people like that today about life, maybe in general, maybe a life of curiosity in the sciences?"}, {"time": 8834, "text": "Well, first, I should confess that I enjoy working with young people much more than with senior people."}, {"time": 8840, "text": "And the reason is they don't carry a baggage of prejudice."}, {"time": 8840, "text": "They're not so self centered."}, {"time": 8846, "text": "They're open to exploration."}, {"time": 8846, "text": "My advice, I mean, one of the lessons that took me a while to learn, and I should say I lost important opportunities as a result of that."}, {"time": 8854, "text": "So I would regard it as a mistake on my behalf, was to believe experts."}, {"time": 8860, "text": "So, quote unquote."}, {"time": 8860, "text": "So on a on a number of occasions, I would come up with an original idea and then suggest it to an expert, someone that works in the same field for a while."}, {"time": 8877, "text": "And the expert would dismiss it most of the time because it's new and was not explored, not because of the merit."}, {"time": 8884, "text": "And then what happened to me several times is that someone else would listen to the conversation or would hear me suggesting it."}, {"time": 8897, "text": "And I would give up because the expert said no."}, {"time": 8897, "text": "And then that someone else would develop it so that it becomes the hottest thing in this field."}, {"time": 8905, "text": "And once it happened to me multiple times, I then realized the hell with the experts."}, {"time": 8911, "text": "They don't know what they're doing."}, {"time": 8911, "text": "They're just repeating them."}, {"time": 8916, "text": "They don't think creatively."}, {"time": 8916, "text": "They are being threatened by innovation."}, {"time": 8916, "text": "And it's the natural reaction of someone that cares about their ego more than about the matter that we are discussing."}, {"time": 8932, "text": "And so I said, I don't care how many likes I have on Twitter."}, {"time": 8932, "text": "I don't care whether the experts say one thing or another."}, {"time": 8937, "text": "I will basically exercise my judgment and do the best I can."}, {"time": 8943, "text": "Turns out that I'm wrong."}, {"time": 8943, "text": "I made a mistake."}, {"time": 8943, "text": "That's part of the scientific endeavor."}, {"time": 8950, "text": "And it took me a while to recognize that."}, {"time": 8950, "text": "And it was a lot of wasted opportunities."}, {"time": 8950, "text": "So to the young people, I would recommend don't listen to experts."}, {"time": 8956, "text": "Carve your own path."}, {"time": 8956, "text": "Now, of course, you will be wrong."}, {"time": 8964, "text": "You should learn from experience, just like kids do."}, {"time": 8964, "text": "But do it yourself."}, {"time": 8970, "text": "Your father died in 2017."}, {"time": 8970, "text": "Your mother died in 2019."}, {"time": 8970, "text": "Do you miss them?"}, {"time": 8982, "text": "Is there a memory, that fond memory that stands out?"}, {"time": 8982, "text": "Or maybe what have you learned from them?"}, {"time": 8990, "text": "From my mother, I mean, she was very much my inspiration for pursuing intellectual work, because she studied at the university."}, {"time": 9000, "text": "And then because of the Second World War, after the Second World War, she was born in Bulgaria."}, {"time": 9008, "text": "They immigrated to Israel."}, {"time": 9008, "text": "And she and she left university to work on a farm."}, {"time": 9015, "text": "And later in life, when all the kids left home, she went back to the university and finished the PhD."}, {"time": 9024, "text": "But she planted in me the intellectual curiosity and valuing learning or acquiring knowledge as a very important element in life."}, {"time": 9041, "text": "And my love with philosophy came from attending classes that she took at the university."}, {"time": 9050, "text": "When I was a teenager, I was fortunate to go to some of these and they inspired me later on."}, {"time": 9050, "text": "And I'm very different than my colleagues, as you can tell, because my upbringing was quite different."}, {"time": 9063, "text": "And the only reason I'm doing physics or astrophysics is because of circumstances."}, {"time": 9068, "text": "At age 18, I was asked to serve in the military."}, {"time": 9068, "text": "And the only way for me to pursue intellectual work was to work on physics, because that was the closest to philosophy."}, {"time": 9077, "text": "And I was good at physics."}, {"time": 9085, "text": "So they admitted me to an elite program called LPO that allowed me to finish my PhD at age 24 and to actually propose the first international project that was funded by the Star Wars initiative of Ronald Reagan."}, {"time": 9098, "text": "And that brought me to the US to visit Washington, DC, where we were funded from."}, {"time": 9105, "text": "And then on one of the visits, I went to the Institute for Advanced Study at Princeton and met John Bacall that later offered me a five year fellowship there."}, {"time": 9111, "text": "Under the under the condition that I'll switch to astrophysics."}, {"time": 9119, "text": "At which point, you know, I said, OK, I cannot give up on this opportunity."}, {"time": 9123, "text": "I'll do it."}, {"time": 9123, "text": "Switch to astrophysics."}, {"time": 9123, "text": "It felt like a forced marriage, kind of arranged marriage."}, {"time": 9130, "text": "And then I was offered the position at Harvard because nobody wanted that."}, {"time": 9135, "text": "They first selected someone else."}, {"time": 9135, "text": "And that someone said, I don't want to become a junior faculty at the Harvard Astronomy Department because the chance for being promoted are very small."}, {"time": 9147, "text": "So he took another job."}, {"time": 9147, "text": "And then I was second in line."}, {"time": 9147, "text": "They gave it to me."}, {"time": 9147, "text": "I didn't care much because I could go back to the farm any day, you know."}, {"time": 9153, "text": "And after three years, I was tenured."}, {"time": 9159, "text": "And eventually, a decade later, became the chair of this department and served for nine years as the chair of the astronomy department at Harvard."}, {"time": 9166, "text": "But at that point, it became clear to me that I'm actually married to the love of my life, even though it was an arranged marriage."}, {"time": 9176, "text": "There are many philosophical questions in astrophysics that we can address."}, {"time": 9176, "text": "But I'm still very different than my colleagues, you know, that were focusing on technical skills in getting to this job."}, {"time": 9187, "text": "So my mother was really extremely instrumental in planting the seeds of thinking about the big picture in me."}, {"time": 9197, "text": "Then my father, he was, you know, he was working in the farm."}, {"time": 9204, "text": "And we didn't speak much because we sort of understood each other without speaking."}, {"time": 9210, "text": "But what he gave me is a sense of, you know, that it's more important to do things than to talk about them."}, {"time": 9219, "text": "I love the, I mean, my apologies, but MIT mind and hand."}, {"time": 9219, "text": "I love that there's that the root of philosophy that you gain from your mom and the hand, that action is all that ultimately in the end matters from your dad."}, {"time": 9234, "text": "That's really powerful."}, {"time": 9234, "text": "If we could take a small detour into philosophy, is there by chance any books, authors, whether philosophical or not, you mentioned Sartre, that stand out to you that were formative in some small or big way, that perhaps you would recommend to others, maybe when you were very young or maybe later on in life?"}, {"time": 9260, "text": "Well, actually, yeah, I, you know, I read the number of existentialists that appealed to me because they were authentic."}, {"time": 9267, "text": "You know, Sartre, you know, he declined the Nobel Prize, as we discussed, but he also was mocking people that pretend to be something better than they are."}, {"time": 9279, "text": "You know, he was living an authentic life that is sincere."}, {"time": 9279, "text": "And that's what appealed to me."}, {"time": 9285, "text": "And Albert Camus was another French philosopher that advocated existentialism."}, {"time": 9285, "text": "You know, that really appealed to me."}, {"time": 9293, "text": "That's probably my favorite existentialist, Camus."}, {"time": 9293, "text": "And he died at a young age in an accident, unfortunately."}, {"time": 9298, "text": "And then, you know, people like Nietzsche that, you know, broke conventions."}, {"time": 9307, "text": "And I noticed that Nietzsche is still extremely popular."}, {"time": 9307, "text": "You know, that's quite surprising."}, {"time": 9316, "text": "He appeals to the young people of today."}, {"time": 9316, "text": "It's the childlike wonder about the world."}, {"time": 9325, "text": "And he was unapologetic."}, {"time": 9325, "text": "You know, it's like most philosophers have a very strict adherence to terminology and to the practices, academic philosophers."}, {"time": 9330, "text": "And Nietzsche was full of contradictions."}, {"time": 9336, "text": "And he just, I mean, he was just this big kid with opinions and thought deeply about this world."}, {"time": 9344, "text": "And people are really attracted to that."}, {"time": 9344, "text": "And surprisingly, there's not enough people like that throughout history of philosophy."}, {"time": 9349, "text": "And that's why I think he's still drawn to them."}, {"time": 9355, "text": "To me, what stands out is his statement that the best way to corrupt the mind of young people is to tell them that they should agree with the common view, you know."}, {"time": 9363, "text": "And, you know, it goes back to the thread that went throughout discussion."}, {"time": 9371, "text": "You've kind of suggested that we ought to be humble about our very own existence and that our existence lasts only a short time."}, {"time": 9378, "text": "We talked about you losing your father and your mother."}, {"time": 9394, "text": "I'm not afraid."}, {"time": 9394, "text": "You know what, Epicurus, actually Epicurus was a very wise person."}, {"time": 9401, "text": "According to Lucretius, Epicurus didn't leave anything in writing."}, {"time": 9401, "text": "But he said that he's never afraid of death because as long as he's around, death is not around."}, {"time": 9408, "text": "And when death will be around, he will not be around."}, {"time": 9416, "text": "So he will never meet death."}, {"time": 9416, "text": "So why should you be worried about something you will never meet?"}, {"time": 9421, "text": "You know, and it's an interesting philosophy of life."}, {"time": 9421, "text": "You know, you shouldn't be afraid of something that you will never encounter, right?"}, {"time": 9429, "text": "But there's a finiteness to this experience."}, {"time": 9429, "text": "We live every day."}, {"time": 9433, "text": "I mean, I think if we're being honest, we live every day as if it's going to last forever."}, {"time": 9440, "text": "We often kind of don't contemplate the fact that it ends."}, {"time": 9440, "text": "You kind of have plans and goals and you have these possibilities."}, {"time": 9446, "text": "You have a kind of lingering thought, especially as you get older and older and older, that this is, especially when you lose friends, then you start to realize, you know, it does end."}, {"time": 9458, "text": "But I don't know if you really are cognizant of that."}, {"time": 9458, "text": "I mean, because..."}, {"time": 9463, "text": "But you have to be careful not to be depressed by it, because otherwise you lose the vitality, right?"}, {"time": 9468, "text": "So I think the most important thing to draw from knowing that you are short lived is a sense of appreciation that you're alive."}, {"time": 9476, "text": "But more importantly, a sense of modesty, because how can anyone be arrogant if they kept at the same time this notion that they are short lived?"}, {"time": 9489, "text": "I mean, you cannot be arrogant, because anything that you advocate for, you know, you will not be around to do that in a hundred years."}, {"time": 9494, "text": "So people will just forget and move on, you know."}, {"time": 9499, "text": "And if you keep that in mind, you know, the Caesars in ancient Rome, they had a person next to them telling them, don't forget that you are mortal."}, {"time": 9506, "text": "You know, there was a person with that duty because the Caesars thought that they are all powerful, you know."}, {"time": 9517, "text": "And they had, for a good reason, someone they hired to whisper in their ear, don't forget that you are mortal."}, {"time": 9527, "text": "Well, you're somebody, one of the most respected, famous scientists in the world, sitting on a farm, gazing up at the stars."}, {"time": 9535, "text": "So you seem like an appropriate person to ask the completely inappropriate question of, what do you think is the meaning of it all?"}, {"time": 9545, "text": "And if we ever find an alien that we can converse with, I would like to answer this."}, {"time": 9551, "text": "I would like to ask for an answer to this question because... Would they have a different opinion, you think?"}, {"time": 9556, "text": "Well, they might be wiser because they lived around for a while, but I'm afraid they will be silent."}]}]