[{"title": "Matthew Johnson: Psychedelics | Lex Fridman Podcast #145", "id": "ICj8p5jPd3Y", "quotes": [{"time": 420, "text": "Which one is mescaline?"}, {"time": 421, "text": "Mescaline is in the different cacti."}, {"time": 424, "text": "So the one most people will know is peyote, but it also shows up in San Pedro or Peruvian torch."}, {"time": 430, "text": "And all of these classic psychedelics, they have, at the right dose, and typically they have very strong effects on one sense of reality and one sense of self."}, {"time": 445, "text": "Some of the things that makes them different than other more broadly speaking psychedelics, like MDMA and others, is that they're, at least the major examples, there's some exotic ones that differ, but the ones I've talked about are extremely safe at the physiological level."}, {"time": 462, "text": "Like LSD and psilocybin, there's no known lethal overdose, unless you have like really severe heart disease, because it modestly raises your blood pressure."}, {"time": 472, "text": "So same person that might be hurt traveling snow or going up the stairs, that could have a cardiac event because they've taken one of these drugs."}, {"time": 483, "text": "But for most people, someone could take a thousand times what the effective dose is, and it's not gonna cause any organ damage, affect the brainstem, make them stop breathing."}, {"time": 491, "text": "So in that sense, they're freakishly safe at the physiolo..."}, {"time": 496, "text": "I would never call any compounds safe, because there's always a risk."}, {"time": 499, "text": "They're freakishly safe at the physiological level."}, {"time": 502, "text": "I mean, you can hardly find anything over the counter like that, I mean, aspirin's not like that."}, {"time": 506, "text": "Caffeine is not like that."}, {"time": 508, "text": "Most drugs, you take five, 10, 20, maybe it takes 100, but you get to some times the effective dose, and it's gonna kill you or cause some serious damage."}, {"time": 518, "text": "And so that's something that's remarkable about most of these classic psychedelics."}, {"time": 523, "text": "That's incredible, by the way, that you can go on a hell of a journey in the mind, like probably transformative, potentially in a deeply transformative way, and yet there's no dose that in most people would have a lethal effect."}, {"time": 542, "text": "That's kind of fascinating."}, {"time": 543, "text": "There's this duality between the mind and the body."}, {"time": 546, "text": "It's like, it's the..."}, {"time": 549, "text": "Okay, sorry if I bring them up way too much, but David Goggins is like, the kind of things you go on in the long run, like the hell you might go through in your mind."}, {"time": 559, "text": "Your mind can take a lot, and you can go through a lot with the mind, and the body will just be its own thing."}, {"time": 565, "text": "You can go through hell, but after a good night's sleep, be back to normal, and the body's always there."}, {"time": 571, "text": "So bringing it back to Goggins, it's like you can do that without even destroying your knee or whatever, or coming close and riding that line."}, {"time": 578, "text": "So the unfortunate thing about the running, which he uses running to test the mind, so the aspect of running that is negative, in order to test the mind, you really have to push the body, take the body through a journey."}, {"time": 593, "text": "I wish there was another way of doing that in the physical exercise space."}, {"time": 597, "text": "I think there are exercises that are easier on the body than others, but running sure is a hell of an effective way to do it."}, {"time": 604, "text": "And one of the ways that where it differs is that you're unlike exercise, you're essentially, most exercise, to really get to those intense levels, you really need to be persistent about it."}, {"time": 617, "text": "I mean, it'll be intense if you're really out of shape, just jogging for five minutes, but to really get to those intense levels, you need to have the dedication."}, {"time": 625, "text": "And so some of the other ways of altering subjective effects or states of consciousness, take that type of dedication."}, {"time": 635, "text": "Psychedelics though, I mean, someone takes the right dose."}, {"time": 639, "text": "They're strapped into the rollercoaster and something interesting is gonna happen."}, {"time": 644, "text": "And I really like what you said about that distinction between the mind or the contrast between the mind effects and the body effects, because I think of this, I do research with all the drugs, caffeine, alcohol, methamphetamine, cocaine, alcohol, legal, illegal."}, {"time": 666, "text": "Most of these drugs, thinking about say cocaine and methamphetamine, you can't give to a regular user, you can't safely give a dose where the regular cocaine user is gonna say, oh man, that's like, that's the strongest coke I've ever had, you know, because you get it past the ethics committee and you need approval."}, {"time": 692, "text": "And I wouldn't wanna give someone something that's dangerous."}, {"time": 694, "text": "So to go to those levels where they would say that, you would have to give something that's physiologically riskier, you know."}, {"time": 703, "text": "Psilocybin or LSD, you can give a dose at the physiological level that is like very good chance it's gonna be the most intense psychological experience of that person's life and have zero chance for most people if you screen them of killing them."}, {"time": 718, "text": "The big risk is behavioral toxicity, which is a fancy way of saying doing something stupid."}, {"time": 723, "text": "I mean, you're really intoxicated, like if you wander into traffic or you fall from a height, just like plenty of people do on high doses of alcohol."}, {"time": 761, "text": "And that's just extreme, so unheard of with psychedelics."}, {"time": 788, "text": "So that's the classic psychedelics."}, {"time": 791, "text": "What are the, what's a good term, modern psychedelics or more maybe psychedelics that are created in the lab?"}, {"time": 799, "text": "Right, so MDMA is the big one."}, {"time": 801, "text": "And I should say that with the classic psychedelics, that LSD is sort of, you can call it a semi synthetic because there's natural from both ergot and in certain seeds, morning glory seeds as one example, there's a very close, there are some very close chemical relatives of LSD."}, {"time": 820, "text": "So LSD is close to what occurs in nature, but not quite."}, {"time": 824, "text": "But then when we get into the other non classic psychedelics, probably the most prominent one is MDMA, people call it ecstasy, people call it Molly."}, {"time": 835, "text": "And it is, it differs from classic psychedelics in a number of ways, it can be addictive, but not so."}, {"time": 844, "text": "It's like, you can have cocaine on this end of the continuum and classic psychedelics here."}, {"time": 850, "text": "Continuum of addiction."}, {"time": 851, "text": "Continuum of addiction, you know, so it's certainly no cocaine."}, {"time": 855, "text": "It's pretty rare for people to get into daily use patterns, but it's possible and they can get into more like, you know, using once a week pattern where they can find it hard to stop, but it's somewhere in between mostly towards the, to the classic psychedelic side in terms of like relatively little addiction potential."}, {"time": 876, "text": "But it's also more physiologically dangerous."}, {"time": 879, "text": "I think that the, certainly the therapeutic use, it's showing really promising effects for treating PTSD and the models that are used, I think those are extremely acceptable when it comes to the risk benefit ratio that you see all throughout medicine."}, {"time": 894, "text": "But nonetheless, we do know that at a certain dose and a certain frequency that MDMA can cause longterm damage to the serotonin system in the brain."}, {"time": 905, "text": "So it doesn't have that level of kind of freakish bodily safety that the classic psychedelics do."}, {"time": 913, "text": "And it has more of a heart load, a cardiovascular, I don't mean kind of emotion, I mean, in this sense, although it is very emotional and that's something unique about its subjective effects, subjective effects, but it's more of a oppressor."}, {"time": 925, "text": "And the terminology you use instead of like a freakish capacities, allowing you from a researcher perspective, but a personal perspective too, of taking a journey with some of these psychedelics that is the heroic dose, as they say."}, {"time": 940, "text": "So like these are tools that allow you to take a serious mental journey, whatever that is."}, {"time": 945, "text": "That's what you mean."}, {"time": 946, "text": "And with MDMA, there's a little bit, it starts entering this territory where you gotta be careful about the risks to the body potentially."}, {"time": 955, "text": "So yes, that in the sense that you can't kind of push the dose up as high as you safely as one can, if they're in the right setting, like in our research as they can with the classic psychedelics."}, {"time": 967, "text": "But probably more importantly, just the nature of the effects with MDMA aren't the full on psychedelic."}, {"time": 974, "text": "It's not the full journey."}, {"time": 976, "text": "So it's sort of a psychedelic with rose colored glasses on."}, {"time": 981, "text": "A psychedelic that's more of, it's been called more of a heart trip than a head trip."}, {"time": 985, "text": "The nature of reality doesn't unravel as frequently as it does with classic psychedelics."}, {"time": 992, "text": "But you're able to more directly sense your environment."}, {"time": 995, "text": "So your perception system still works."}, {"time": 997, "text": "It's not completely detached from reality with MDMA."}, {"time": 1000, "text": "That's true, relatively speaking."}, {"time": 1001, "text": "That said at most doses of classic psychedelics, you still have a tether to reality."}, {"time": 1008, "text": "Changes a little bit when you're talking about smoking DMT or smoking 5 methoxy DMT, which are some interesting examples we could talk more about."}, {"time": 1017, "text": "But with MDMA, for example, it's very rare to have what's called an ego loss experience or a sense of transcendental unity, where one really seemingly loses the psychological construct of the self."}, {"time": 1039, "text": "But MDMA, it's very common for people to have this, they still are perceiving themselves as a self, but it's common for them to have this warmth, this empathy for humanity and for their friends and loved ones."}, {"time": 1054, "text": "So it's more, and you see those effects under the classic psychedelics, but that's a subset of what the classic psychedelics do."}, {"time": 1061, "text": "So I see MDMA in terms of its subjective effects is if you think about Venn diagrams, it's sort of MDMA is all within the classic psychedelics."}, {"time": 1070, "text": "So everything that you see on a particular MDMA session, sometimes a psilocybin session looks just like that, but then sometimes it's completely different with psilocybin."}, {"time": 1080, "text": "It's a little more narrowed in terms of the variability with MDMA."}, {"time": 1085, "text": "Is there something general to say about what the psychedelics do to the human mind?"}, {"time": 1091, "text": "You mentioned kind of an ego loss experience in the space of Venn diagrams."}, {"time": 1096, "text": "If we're to like draw a big circle, what can we say about that big circle?"}, {"time": 1103, "text": "In terms of people's report of subjective experience, probably one of the most general things we can say is that it expands that range."}, {"time": 1115, "text": "So many people come out of these sessions saying that they didn't know it was possible to have an experience like that."}, {"time": 1124, "text": "So there's an emphasis on the subjective experience that is there words that people put to it that capture that experience or is it something that just has to be experienced?"}, {"time": 1140, "text": "Yeah, people like... As a researcher, that's an interesting question because you have to kind of measure the effects of this and how do you convert that into numbers?"}, {"time": 1154, "text": "That's the ultimate challenge."}, {"time": 1155, "text": "So is that possible to one, convert it into words and the second, convert the words into numbers somehow?"}, {"time": 1162, "text": "So we do a lot of that with questionnaires, some of which are very psychometrically validated."}, {"time": 1168, "text": "So lots of numbers have been crunched on them."}, {"time": 1170, "text": "And there's always a limitation with questionnaires."}, {"time": 1173, "text": "I mean, subjective effects are subjective effects."}, {"time": 1175, "text": "Ultimately, it's what the person is reporting and that doesn't necessarily point towards a ground truth."}, {"time": 1185, "text": "So for example, if someone says that they felt like they touched another dimension or they felt like they sensed the reality of God or if they, I mean, just you name it, people's ontological views can sometimes shift."}, {"time": 1201, "text": "I think that's more about where they're coming from and I don't think it's the quintessential way in which they work."}, {"time": 1205, "text": "There's plenty of people that hold onto a completely naturalistic viewpoint and have profound and helpful experiences with these compounds."}, {"time": 1216, "text": "But the subjective effects can be so broad that for some people, it shifts their philosophical viewpoint more towards idealism, more towards thinking that the nature of reality might be more about consciousness than about material."}, {"time": 1238, "text": "That's a domain I'm very interested in."}, {"time": 1240, "text": "Right now, we have essentially zero to say about that in terms of validating those types of claims, but it's even interesting just to see what people say along those lines."}, {"time": 1249, "text": "So you're interested in saying like, can we more rigorously study this process of expansion?"}, {"time": 1254, "text": "Like, what do we mean by this expansion of your sense of what is possible in the experiences in this world?"}, {"time": 1262, "text": "Right, as much as what we can say about that through naturalistic psychology, especially as much as we can root it to solid psychological constructs and solid neuroscientific constructs."}, {"time": 1276, "text": "And I wonder what the impact is of the language that you bring to the table."}, {"time": 1280, "text": "So you mentioned about God or speaking of God, a lot of people are really into sort of theoretical physics these days at a very surface level and you can bring the language of physics, right?"}, {"time": 1322, "text": "And so that has to do with the language."}, {"time": 1324, "text": "Like if you read a Sean Carroll book or something recently, it seems like it has a huge influence on the way you might experience, might perceive the world and might experience the alteration that psychedelics brings to your perception system."}, {"time": 1343, "text": "So I wonder like the language you bring to the table, how that affects the journey you go on with the psychedelics."}, {"time": 1350, "text": "I think very much so."}, {"time": 1352, "text": "And I think there's, I'm a little concerned some of the science is going a little too far in the direction of around the edges, speaking about it changing beliefs in this sense or that sense about particular, in particular domains."}, {"time": 1368, "text": "And I think what really what a lot of what's going on is what you just discussed."}, {"time": 1373, "text": "It's the priors coming into it."}, {"time": 1376, "text": "So if you've been reading a lot of physics, then you might bring up like space time and interpret the experience in that sense."}, {"time": 1388, "text": "I mean, it's not uncommon for people come out talking about visions of the, it's not the most typical thing, but it's come up in sessions I've guided, the Big Bang and this sort of nature of reality."}, {"time": 1401, "text": "I think probably that the best way to think about these experiences is that, and the best evidence, even though we're in our infancy and understanding it, they really tap into more general psychological mechanisms."}, {"time": 1414, "text": "I think one of the best arguments is they reduce the influence of our priors, of what we bring into all of the assumptions that we all that we're essentially, especially as adults, we're riding on top of heuristic after heuristic to get through life."}, {"time": 1431, "text": "And you need to do that."}, {"time": 1433, "text": "And that's a good thing."}, {"time": 1434, "text": "And that's extremely efficient and evolution has shaped that, but that comes at an expense."}, {"time": 1439, "text": "And it seems that these experiences will allow someone greater mental flexibility and openness."}, {"time": 1452, "text": "And so one can be both less influenced by their prior assumptions, but still nonetheless the nature of the experience can be influenced by what they've been exposed to in the world."}, {"time": 1465, "text": "And sometimes they can get it in a deeper way."}, {"time": 1468, "text": "Like maybe they've read, I mean, I had a philosophy professor one time as a participant in a high dose psilocybin study."}, {"time": 1474, "text": "And I remember him saying, my God, it's like Hegel's opposites defining each other."}, {"time": 1480, "text": "Like, I get it."}, {"time": 1481, "text": "I've taught this thing for years and years and years."}, {"time": 1484, "text": "Like, I get it now."}, {"time": 1486, "text": "And so like that, you know, and even at the psychological, emotional level, like the cancer patients we worked with, you know, they told themselves a million times over this people trying to quit smoking, I need to quit smoking."}, {"time": 1498, "text": "Oh, I'm ruining my life with this cancer."}, {"time": 1500, "text": "I'm still healthy."}, {"time": 1501, "text": "I should be getting out."}, {"time": 1502, "text": "I'm letting this thing defeat me."}, {"time": 1503, "text": "It's like, yeah, you told yourself that in your head, but sometimes they had these experiences and they kind of feel it in their heart."}, {"time": 1510, "text": "Like they really get it."}, {"time": 1511, "text": "So in some sense that you bring some prize to the table, but psychedelics allow you to acknowledge them and then throw them away."}, {"time": 1523, "text": "So like one popular terminology around this in the engineering space is first principles thinking that Elon Musk, for example, espouses a lot."}, {"time": 1533, "text": "Let me ask a fun question before we return to a more serious discussion."}, {"time": 1538, "text": "With Elon Musk as an example, but it could be just engineers in general, do you think there's a use for psychedelics to take a journey of rigorous first principles thinking?"}, {"time": 1554, "text": "So like throwing away, we're not talking about throwing away assumptions about the nature of reality in terms of like our philosophy of the way we live day to day life, but we're talking about like how to build a better rocket or how to build a better car or how to build a better social network or all those kinds of things, engineering questions."}, {"time": 1575, "text": "I absolutely think there's huge potential there."}, {"time": 1577, "text": "And there was some research in the late 60s, early 70s that were, it was very early and not very rigorous in terms of methodology, but it was consistent with the, I mean, there's just countless anecdotes of folks."}, {"time": 1594, "text": "I mean, people have argued that just, Silicon Valley was largely influenced by psychedelic experience."}, {"time": 1601, "text": "I remember the, I think the person that came up with the concept of freeware or shareware, it's like it kind of was generated out of or influenced by psychedelic experience."}, {"time": 1613, "text": "So to this, I think there's incredible potential there and we know really next, there's no rigorous research on that, but."}, {"time": 1623, "text": "Is there anecdotal stuff like with Steve Jobs?"}, {"time": 1625, "text": "I think there's stories, right?"}, {"time": 1627, "text": "In your exploration of that, is there something a little bit more than just stories?"}, {"time": 1632, "text": "Is there like a little bit more of a solid data points, even if they're just experiential like anecdotes?"}, {"time": 1640, "text": "Is there something that you draw inspiration from like in your intuition?"}, {"time": 1644, "text": "Because we'll talk about, you're trying to construct studies that are more rigorous around these questions."}, {"time": 1649, "text": "But is there something you draw inspiration from, from the past, from the 80s and the 90s and Silicon Valley, that kind of space?"}, {"time": 1657, "text": "Or is it just like you have a sense based on everything you've learned and these kind of loose stories that there's something worth digging at?"}, {"time": 1667, "text": "I am influenced by the, gosh, the just incredible number of anecdotes surrounding these."}, {"time": 1675, "text": "I mean, Carey Mullis, he invented PCR."}, {"time": 1682, "text": "I mean, absolutely revolutionized biological sciences."}, {"time": 1685, "text": "He says he wouldn't have won the Nobel Prize for him."}, {"time": 1688, "text": "He said he wouldn't have come up with that had he not had psychedelic experiences."}, {"time": 1694, "text": "Now, he's an interesting character."}, {"time": 1695, "text": "People should read his autobiography because you could point to other things he was into."}, {"time": 1699, "text": "But I think that speaks to the casting your nets wide and this mental flex, more of these general mechanisms where sometimes if you cast your nets really wide and it's gonna depend on the person and their influences, but sometimes you come up with false positives."}, {"time": 1718, "text": "You connect the dots where maybe you shouldn't have connected those dots, but I think that can be constrained."}, {"time": 1724, "text": "And so much of our, not only our personal psychological suffering, but our limitations academically and in terms of technology are because of the self imposed limitations and heuristics, these entrenched ways of thinking."}, {"time": 1743, "text": "Like those examples throughout the history of science where someone has come up with the paradigm, Kuhn's paradigm shifts."}, {"time": 1751, "text": "It's like, here's something completely different."}, {"time": 1754, "text": "This doesn't make sense by any of the previous models."}, {"time": 1757, "text": "And like, we need more of those."}, {"time": 1760, "text": "And then you need the right balance between that because so many of the novel crazy ideas are just bunk and that's what science is about separating them from the valid paradigm shifting ideas."}, {"time": 1773, "text": "But we need more paradigm shifting ideas like in a big way."}, {"time": 1778, "text": "And I think we could, I think you could argue that we've, because of the structure of academia and science in modern times, it heavily biases against those."}, {"time": 1789, "text": "Right, there's all kinds of mechanisms in our human nature that resist paradigm shift quite sort of obviously."}, {"time": 1796, "text": "So, and psychedelics, there could be a lot of other tools but it seems like psychedelics could be one set of tools that encourage paradigm shifting thinking."}, {"time": 1808, "text": "So like the first principles kind of thinking."}, {"time": 1811, "text": "So it's a kind of, you're at the forefront of research here."}, {"time": 1816, "text": "There's just kind of anecdotal stories."}, {"time": 1818, "text": "There's early studies."}, {"time": 1821, "text": "There's a sense that we don't understand very much but there's a lot of depth here."}, {"time": 1826, "text": "How do we get from there to where Elon and I can regularly, like I wake up every morning, I have deep work sessions where it's well understood like what dose to take."}, {"time": 1841, "text": "Like if I want to explore something where it's all legal, where it's all understood and safe, all that kind of stuff."}, {"time": 1849, "text": "How do we get from where we are today to there?"}, {"time": 1853, "text": "Not speaking in terms of legality in the sense like policy making all that like laws and stuff, meaning like how do we scientifically understand this stuff well enough to get to a place where I can just take it safely in order to expand my thinking, like this kind of first principles thinking, which I'm in my personal life currently doing."}, {"time": 1874, "text": "Like how do I revolutionize particular several things?"}, {"time": 1878, "text": "Like it seems like the only tools I have right now is just, just, but my mind going, doing the first principles like, wait, wait, wait, okay."}, {"time": 1890, "text": "Why has this been done this way?"}, {"time": 1891, "text": "Can we do it completely differently?"}, {"time": 1893, "text": "It seems like I'm still tethered to the priors that I bring to the table and I keep trying to untether myself."}, {"time": 1900, "text": "Maybe there's tools that can systematically help me untether."}, {"time": 1904, "text": "Yeah, well, we need experiments and that's tied to kind of the policy level stuff."}, {"time": 1911, "text": "And I should be clear, I would never encourage anyone to do anything illicitly."}, {"time": 1917, "text": "But yeah, in the future, we could see these compounds used for technical and scientific innovation."}, {"time": 1928, "text": "What we need are studies that are digging into that."}, {"time": 1931, "text": "Right now, most of what the funding, which is largely from philanthropy, not from the government, largely what it's for is treatment of mental disorders like addiction and depression, et cetera."}, {"time": 1947, "text": "But we need studies."}, {"time": 1948, "text": "One of the early initial stabs on this question decades ago was they took some architects and engineers and said, what problems have you been working on?"}, {"time": 1960, "text": "Where have you been stuck for months like working on this damn thing and you're not getting anywhere, like your head's butting up against the wall."}, {"time": 1967, "text": "It's like, come in here, take, and I think it was 100 micrograms of LSD."}, {"time": 1971, "text": "So not a big session."}, {"time": 1972, "text": "And a little bit different model where they were actually working."}, {"time": 1975, "text": "It was a moderate enough dose where they could work on the problem during the session."}, {"time": 1980, "text": "I think probably, I'm an empiricist, so I'd like to see all the studies done."}, {"time": 1986, "text": "But the first thing I would do is like a really high dose session where you're not necessarily in front of your computer, which you can't really do on a really high dose."}, {"time": 1996, "text": "And then the work has been talked about, like you take a really high dose, you take a journey, and then the breakthroughs come from when you return from the journey and like integrate, quote unquote, that experience."}, {"time": 2009, "text": "I think that's where all the, again, we're babies at this point, but my gut tells me that it's the so called integration, the aftermath."}, {"time": 2018, "text": "We know that there's some different forms of neuroplasticity that are unfolding in the days following a psychedelics, at least in animals, probably going on humans."}, {"time": 2025, "text": "We don't know if that's related to the therapeutic effects."}, {"time": 2028, "text": "My gut tells me it is, although it's only part of the story, but we need big studies where we compare people, like let's get a hundred people like that, scientists that are working on a problem, and then randomize them too."}, {"time": 2042, "text": "And then I think you need even more credible, active controls or active placebo conditions to kind of tease this out."}, {"time": 2053, "text": "And then also in conjunction with that, and you can do this in the same study, you wanna combine that with more rigorous sort of experimental models where we actually give there a problem solving tasks that we know, for example, that you tend to do better on after you've gotten a good night's sleep versus not."}, {"time": 2070, "text": "And my sense is there's a relationship there."}, {"time": 2073, "text": "People go back to first principles, questioning those first principles they're operating under and getting away from their priors in terms of creative problem solving."}, {"time": 2085, "text": "And so I think wrap those things and you could speak a little more rigorously about those because ultimately, if everyone's bringing their own problem, that's more in the face valid side, but you can't dig in as much and get as much experimental power and speak to the mechanisms as you can with having everyone do the same sort of canned problem solving task."}, {"time": 2108, "text": "So we've been speaking about psychedelics generally."}, {"time": 2110, "text": "Is there one you find from the scientific perspective or maybe even philosophical perspective most fascinating to study?"}, {"time": 2118, "text": "Therapeutically, I'm most interested in psilocybin and LSD and I think we need to do a lot more with LSD because it's mainly been psilocybin in the modern era."}, {"time": 2127, "text": "I've recently gotten a grant from the Heftar Research Institute to do an LSD study."}, {"time": 2132, "text": "So I haven't started it yet, but I'm going through the paperwork and everything."}, {"time": 2136, "text": "Therapeutic meaning there's some issue and you're trying to treat that issue."}, {"time": 2171, "text": "This is like when people, this is what, I don't know if you're familiar with Terrence McKenna, he would talk a lot about smoking DMT, Joe Rogan has talked a lot about that."}, {"time": 2179, "text": "People will say that, and there's a close relative called 5 methoxy DMT."}, {"time": 2183, "text": "Most people who know the terrain will say that's an order of magnitude or orders of magnitude beyond, I mean, anything one could get from even a high dose of psilocybin or LSD."}, {"time": 2196, "text": "I think it's a question about whether, you know, how therapeutic, I think there is a therapeutic potential there, but it's probably not as sure of a bet because one goes so far out, it's almost like they're not contemplating their relationship and their direction in life."}, {"time": 2211, "text": "They are like reality is ripping apart at the seams and the very nature of the self and of the sense of reality."}, {"time": 2260, "text": "Like one can go as far, so far out while still being aware of the experience and remembering the experience."}, {"time": 2272, "text": "Interesting, so being able to carry something back."}, {"time": 2276, "text": "Can you dig in a little deeper, like what is DMT, how long is the trip usually, like how much do we understand about it?"}, {"time": 2286, "text": "Is there something interesting to say about just the nature of the experience and what we understand about it?"}, {"time": 2295, "text": "One of the common methods for people to use it is to smoke it or vaporize it."}, {"time": 2299, "text": "And it usually takes, this is a pretty good kind of description of what it might feel like on the ground."}, {"time": 2306, "text": "The caveat is it's a completely insufficient description that someone's gonna be listening to."}, {"time": 2313, "text": "It's like nothing you could say is gonna come close."}, {"time": 2316, "text": "But it'll take about three big hits, inhalations, in order to have what people call a breakthrough dose."}, {"time": 2325, "text": "And there's no great definition of that, but basically meaning moving away from, not just having the typical psilocybin or LSD experience where like things are radically different, but you're still basically a person in this reality to go in somewhere else."}, {"time": 2344, "text": "And so that'll typically take like three hits."}, {"time": 2347, "text": "And this stuff comes on like a freight train."}, {"time": 2350, "text": "So one takes a hit and around the time of the first exhalation, so we're talking about a few seconds in, or maybe just sometime between the first and the second hit, like it'll start to come on."}, {"time": 2363, "text": "And they're already up to, let's say, what they might get from a 30 milligram or 300 microgram LSD trip, a big trip."}, {"time": 2374, "text": "They're already there at the second hit, but their consciousness is geared, this is like acceleration, not speed, to speak of physics."}, {"time": 2383, "text": "It's like those receptors are getting filled like that and they're going from zero to 60 in like Tesla time."}, {"time": 2390, "text": "And at the second hit, again, they're at maybe the strongest psychedelic experience they've ever had."}, {"time": 2398, "text": "And then if they can take that third hit, and some people can't, they're propelled into this other reality."}, {"time": 2410, "text": "And the nature of that other reality will differ depending on who you ask, but folks will often talk about it."}, {"time": 2418, "text": "And we've done some survey research on this."}, {"time": 2421, "text": "Entities of different types, elves tend to pop up."}, {"time": 2427, "text": "The caveat is that I strongly presume all of this is culturally influenced, but thinking more about the psychology and the neuroscience, there is probably something fundamental, like for someone that might be colored as elves, others that might be colored as, Terrence McKenna called them self dribbling basketballs."}, {"time": 2446, "text": "For someone else, it might be little animals or someone else, it might be aliens."}, {"time": 2452, "text": "I think that probably is dependent on who they are and what they've been exposed to."}, {"time": 2456, "text": "But just the fact that one has this sense that they're surrounded by autonomous entities."}, {"time": 2462, "text": "Right, intelligent autonomous entities."}, {"time": 2464, "text": "Right, and people come back with stories that are just astonishing."}, {"time": 2469, "text": "Like there's communication between these, communication between these entities and often they're telling them things that the person says are self validating, but it seems like it's impossible."}, {"time": 2485, "text": "Like it really seems like, and again, this is what people say oftentimes, that it really is like downloading some intelligence from a higher dimension or some whatever metaphor you wanna use."}, {"time": 2499, "text": "Sometimes these things come up in dreams like someone is exposed to something that, I've had this in a dream, where it seems like what they are being exposed to is physically impossible, but yet at the same time self validating, it seems true."}, {"time": 2516, "text": "Like they really are figuring something out."}, {"time": 2517, "text": "Of course, the challenge is to say something in concrete terms after the experience where you could verify that in any way."}, {"time": 2527, "text": "And I'm not familiar of any examples of that."}, {"time": 2530, "text": "Well, there's a sense in which I suppose the experience is like you're a limited cognitive creature that knows very little about the world and here's a chance to communicate with much wiser entities that in a way that you can't possibly understand are trying to give you hints of deeper truths."}, {"time": 2558, "text": "And so there's that kind of sense that you can take something back, but you can't where our cognition is not capable to fully grasp the truth."}, {"time": 2568, "text": "We'll just get a kind of sense of it and somehow that process is mind expanding that there's a greater truth out there."}, {"time": 2576, "text": "That seems like what from the people I've heard talk about that seems to be what it is."}, {"time": 2584, "text": "And that's so fascinating that there's fundamentally to this whole thing is a communication between an entity that is other than yourself, entities."}, {"time": 2595, "text": "So it's not just like a visual experience like you're like floating through the world is there's other beings there, which is kind of, I don't know."}, {"time": 2606, "text": "I don't know what to sort of, from a person who likes Freud and Carl Jung, I don't know what to think about that."}, {"time": 2612, "text": "That being of course from one perspective is just you looking in the mirror."}, {"time": 2616, "text": "But it could also be from another perspective like actually talking to other beings."}, {"time": 2621, "text": "Yeah, you mentioned Jung and I think he's particularly interesting and it kind of points to something I was thinking about saying is that, I think what might be going on from a naturalistic perspective."}, {"time": 2635, "text": "So regardless, whether or not there are, it doesn't depend on autonomous entities out there."}, {"time": 2641, "text": "What might be happening is that just the associative net, the level of learning, the comprehension might be so beyond what someone is used to that the only way for the nervous system, for the aware sense of self to orient towards it is all by metaphor."}, {"time": 2667, "text": "And so I do think, when we get into these realms as a strong empiricist, I think we always gotta be careful and be as grounded as possible, but I'm also willing to speculate and sort of cast the nets wide with caveat."}, {"time": 2682, "text": "But I think of things like archetypes and it's plausible that there are certain stories, there are certain, we've gone through millions of years of evolution."}, {"time": 2692, "text": "It may be that we have certain characters and stories that our central nervous system is sort of wired to tend to."}, {"time": 2705, "text": "Yeah, those stories, we carry those stories in us."}, {"time": 2708, "text": "And this unlocks them in a certain kind of way."}, {"time": 2710, "text": "And we think about stories."}, {"time": 2711, "text": "Like our sense of self is basically, narrative self is a story."}, {"time": 2715, "text": "And we think about the world of stories."}, {"time": 2718, "text": "This is why metaphors are always more powerful than sort of laying out all the details all the time, speaking in parables."}, {"time": 2726, "text": "It's like, if you really get some, this is why, as much as I hate it, if you're presenting to Congress or something and you have all the best data in the world, it's not as powerful as that one anecdote as the mom dying of cancer that had the psilocybin session and it transformed her life."}, {"time": 2746, "text": "That's a story, that's meaningful."}, {"time": 2748, "text": "And so when this kind of unimaginable kind of change and experience happens with a DMT ingestion, these stories of entities, they might be that, stories that are constructed that is the closest, which is not to say the stories aren't real."}, {"time": 2769, "text": "I mean, I think we're getting to layers where it doesn't really, right."}, {"time": 2774, "text": "Yeah, but it's the closest we can come to making sense out of it."}, {"time": 2779, "text": "Because what we do know about these psychedelics, one of the levels beyond the receptor is that the brain is communicating it with itself in a massively different way."}, {"time": 2788, "text": "There's massive communication with areas that don't normally communicate."}, {"time": 2792, "text": "And so I think that comes with both, it's casting the nets wide."}, {"time": 2798, "text": "I think that comes with the insights and helpful novel ways of thinking."}, {"time": 2802, "text": "I do think it comes with false positives, that could be some of the delusion."}, {"time": 2808, "text": "And so when you're so far out there, like with the DMT experience, like maybe alien is the best way that the mind can wrap some arms around that."}, {"time": 2822, "text": "So I don't know how much you're familiar with Joe Rogan, but he does bring up DMT quite a bit."}, {"time": 2828, "text": "It's almost a meme, it is a meme."}, {"time": 2831, "text": "Have you ever, what is it, have you ever tried DMT?"}, {"time": 2836, "text": "I mean, I think he talks about this experience of having met other entities and they were mocking him, I think, if I remember the experience correctly, like laughing at him and saying F you, F you, or something like that."}, {"time": 2852, "text": "I may be misremembering this, but there's a general mockery."}, {"time": 2857, "text": "And what he learned from that experience is that he shouldn't take himself too seriously."}, {"time": 2862, "text": "So it's the dissolution of the ego and so on."}, {"time": 2865, "text": "Like what do you think about that experience?"}, {"time": 2868, "text": "And maybe if you have more general things about Joe's infatuation with DMT and if DMT has that important role to play in popular culture in general."}, {"time": 2881, "text": "I'm definitely familiar with it."}, {"time": 2883, "text": "I remember telling you offline that when I first, the first time I learned who Joe Rogan was, it was probably 15 years ago."}, {"time": 2891, "text": "And I came upon a clip and I realized there's another person in the world who's into both DMT and Brazilian Jiu Jitsu."}, {"time": 2899, "text": "And I think both those worlds have grown dramatically since and it's probably not such a special club these days."}, {"time": 2904, "text": "So he definitely got onto my radar screen quickly."}, {"time": 2909, "text": "You were into both before it was cool."}, {"time": 2911, "text": "Right, I mean, this is all relative because there's people that were before the late 90s and early 2000s who were into it to say you're a Johnny come lately."}, {"time": 2919, "text": "But yeah, compared to where we're at now."}, {"time": 2922, "text": "But yet one of the things I always found fascinating by Joe's telling of his experiences I think is that they resemble very much Terrence McKenna's experiences with DMT and Joe has talked very much about Terrence McKenna and his experiences."}, {"time": 2943, "text": "If I had to guess, I would guess that probably just having heard Terrence McKenna talk about his experiences that that influenced the coloring of Joe's experience."}, {"time": 2955, "text": "It's funny how that works because I mean, that's why McKenna hasn't, I mean, poets and great orators give us the words to then like start to describe our experiences because our words are limited, our language is limited."}, {"time": 2970, "text": "And it's always nice to get some kind of nice poetry into the mix to allow us to put words to it."}, {"time": 2976, "text": "Right, but I also see some elements that seem to relate to Joe's psychology just from what I've seen from hours of watching him on his podcast is that he's a self critical guy."}, {"time": 2992, "text": "And I think with always his positive been, I'm always struck being a behavioral pharmacologist and no one else really says it about cannabis."}, {"time": 2999, "text": "I'll get back to the DMT thing about he likes the kind of the paranoid side of things."}, {"time": 3003, "text": "He's like, that's you radically examining yourself."}, {"time": 3005, "text": "It's like, that's not just a bad thing."}, {"time": 3007, "text": "That's you need to like look hard at yourself and something's making you uncomfortable, like dig into that."}, {"time": 3013, "text": "And like, that's his, it's sort of along the lines of Goggins with exercise."}, {"time": 3016, "text": "And it's like, yeah, like things, learning experiences aren't supposed to be easy."}, {"time": 3021, "text": "Like take advantage of these uncomfortable experience."}, {"time": 3024, "text": "It's why we call in our research in a safe context with psychedelics, they're not bad trips, they're challenging experiences."}, {"time": 3032, "text": "Yes, yeah, that's fascinating."}, {"time": 3033, "text": "Just that's the tiny tangent."}, {"time": 3035, "text": "It's always cool for me to hear him talk about marijuana, like weed as the paranoia, the anxiety or whatever that you experience as actually the fuel for the experience."}, {"time": 3050, "text": "Like I think he talks about smoking weed when he's writing."}, {"time": 3054, "text": "That's inspiring to me because then you can't possibly have a bad experience."}, {"time": 3059, "text": "I'm a huge fan of that."}, {"time": 3060, "text": "Like every experience is good."}, {"time": 3063, "text": "Right, which is very Goggins."}, {"time": 3064, "text": "Yeah, yeah, is it bad?"}, {"time": 3066, "text": "Okay, all right, great, you know."}, {"time": 3068, "text": "Well, see Goggins is one side of that."}, {"time": 3069, "text": "He wants it bad."}, {"time": 3071, "text": "Like he wants the experience to be challenging always."}, {"time": 3074, "text": "But I mean like both are good."}, {"time": 3077, "text": "Like the few times of taking mushrooms, the experience was like everything was beautiful."}, {"time": 3086, "text": "There's zero challenging aspect to it."}, {"time": 3089, "text": "It was just like the world is beautiful and it gave me this deep appreciation of the world."}, {"time": 3095, "text": "I would say, so like that's amazing, but also ones that challenge you are also amazing."}, {"time": 3101, "text": "Like all the times I drink vodka, but that's another, let's not."}, {"time": 3105, "text": "So back to DMT."}, {"time": 3108, "text": "Yeah, Joe's treating cannabis as a psychedelic, which is something that I'd say like a lot of people treat it more like Xanax or like beer or vodka."}, {"time": 3119, "text": "But he's really trying to delve into those minor, it's been called a minor psychedelic."}, {"time": 3125, "text": "So with DMT, as you brought up, it's like the entity's mocking him."}, {"time": 3130, "text": "And it's like, you're not, I mean, this reminds me of him, him describing his, like writing his, or just his entire method of comedy."}, {"time": 3140, "text": "It's like, watch the tape of yourself."}, {"time": 3143, "text": "Don't just ignore it."}, {"time": 3144, "text": "Like that's where I screwed up."}, {"time": 3146, "text": "That's where I need to do better."}, {"time": 3148, "text": "This like sort of radical self examination, which I think our society is kind of getting away from because like, all the children win trophies type of thing."}, {"time": 3156, "text": "And it's like, no, no, don't go overboard, but like recognize when you've messed up."}, {"time": 3161, "text": "And so that's a big part of the psychedelic experience."}, {"time": 3165, "text": "Like people come out sometimes saying, my God, I need to say sorry to my mom."}, {"time": 3172, "text": "It's so obvious, or whatever interpersonal issue or like, my God, I'm not pulling enough weight around the house and helping my wife."}, {"time": 3182, "text": "And these things that are just obvious to them, the self criticism that can be a very positive thing if you act on it."}, {"time": 3192, "text": "You've mentioned addiction."}, {"time": 3193, "text": "Maybe we could take a little bit detour into a darker aspect of things, or not even darker, it's just an important aspect of things."}, {"time": 3202, "text": "What's the nature of addiction?"}, {"time": 3204, "text": "You've mentioned some things within the big umbrella of psychedelics may be usually not addictive, but maybe MDMA, I think you said might have some addictive properties, but the point is stuff outside of the psychedelics umbrella can often be highly addictive."}, {"time": 3223, "text": "So you've studied addiction from several angles, one of which is behavioral economics."}, {"time": 3229, "text": "What have you understood about addiction?"}, {"time": 3233, "text": "What is addiction from the biological physiological level to the psychological to whatever is the interesting way to talk about addiction?"}, {"time": 3242, "text": "Yeah, and the lenses that I view addiction through very much are behavioral economic, but I also think they converge on, I think it's beautiful at the other end of the spectrum, sort of just a completely humanistic psychology perspective."}, {"time": 3260, "text": "It converges on what people come out of, 12 step meetings talking about."}, {"time": 3264, "text": "Can you say what is behavioral economics and what is humanistic psychology?"}, {"time": 3270, "text": "Like, what do you mean by that?"}, {"time": 3271, "text": "And more importantly, behavioral economics lens, what is that?"}, {"time": 3274, "text": "Yeah, so behavioral economics, my definition of it is the application of economic principles, mostly microeconomic principles."}, {"time": 3281, "text": "So understanding the behavior of individual agents surrounding commodities in the marketplace, applying microeconomic types of analyses to non economic behavior."}, {"time": 3299, "text": "So basically at one point, like psychologists figured out that there's this whole other discipline that's been studying behavior, it just happened to be all focused on monetary behavior, spending and saving money, et cetera."}, {"time": 3312, "text": "But it comes with all of these like principles that can be wildly and fruitfully applied to understanding behavior."}, {"time": 3318, "text": "So for example, I've studied things like demand curve analysis of drug consumption."}, {"time": 3325, "text": "So I look at, for example, tobacco, cigarettes and nicotine products through the lens of demand curves."}, {"time": 3335, "text": "And in other words, at different prices, if there's different work requirements for being able to smoke cigarettes, sort of modeling price."}, {"time": 3345, "text": "Within that price data, there is some indication of addiction, how much the habits that you form around these particular drugs."}, {"time": 3354, "text": "It's one important dimension."}, {"time": 3356, "text": "So I think a particularly important one there is elasticity or inelasticity, two ends of the spectrum."}, {"time": 3362, "text": "So that's the price sensitivity."}, {"time": 3365, "text": "So for example, you could have something that's pretty price inelastic, like gasoline."}, {"time": 3374, "text": "So the price of gas at times can keep going up and Americans are just gonna pretty much buy the same amount of gas."}, {"time": 3381, "text": "Or maybe the price of gas doubles, but their consumption only decreases by 10%."}, {"time": 3386, "text": "So it's a sub proportional reduction."}, {"time": 3388, "text": "So that's an inelastic."}, {"time": 3390, "text": "And that changes, like you push the price up high enough."}, {"time": 3393, "text": "I mean, if it was $100 a gallon, it would eventually turn, the curve would turn and go downward more drastically and it would be elastic."}, {"time": 3401, "text": "But you can apply that to someone who, a regular cigarette smoker who was working for cigarette puffs, who's gone six hours without smoking."}, {"time": 3412, "text": "And you're asking questions like, how many times are they willing to pull this knob in the lab during this three hour session?"}, {"time": 3419, "text": "I do a lot of work like this in order to earn a cigarette."}, {"time": 3422, "text": "How does the content of nicotine in that affect?"}, {"time": 3425, "text": "It has the availability of nicotine replacement products like nicotine gum or eCigarettes affect those decisions."}, {"time": 3432, "text": "So it's a certain lens of, it's sort of a way to take the kind of the classic behavioral psychology definition of reinforcement, which is just basically reward."}, {"time": 3444, "text": "How much is this a good thing?"}, {"time": 3445, "text": "And it kind of breaks that apart into a multi dimensional space."}, {"time": 3451, "text": "So it's not just the ideas reward or reinforcement is not unit dimensional."}, {"time": 3456, "text": "So for example, you can unpack that with demand curves."}, {"time": 3459, "text": "At a cheap price, you might prefer one good to another."}, {"time": 3464, "text": "So the classic example is luxury versus necessity."}, {"time": 3467, "text": "So diamonds versus toilet paper."}, {"time": 3469, "text": "So at those cheap prices, you can look at something called intensity of demand."}, {"time": 3474, "text": "If it was basically as cheap as possible, or essentially zero, how much would you buy of this good?"}, {"time": 3479, "text": "But then you keep jacking up the price and you'll see, so diamonds will look like the better reward at that low price sort of intensity of demand side of things."}, {"time": 3489, "text": "But as you keep jacking up the price, you gotta have some toilet paper."}, {"time": 3493, "text": "And again, we can get into the whole bidet thing, but forget that, I know Joe's been pushing that too."}, {"time": 3501, "text": "You're gonna hang on and keep buying the toilet paper to a greater degree than you will the diamonds."}, {"time": 3506, "text": "So you'll see a crossing of demand curves."}, {"time": 3508, "text": "So what's the better reinforcer?"}, {"time": 3510, "text": "What's the better reward?"}, {"time": 3511, "text": "Depends on your price."}, {"time": 3513, "text": "And so that's an example of one way to look at addiction."}, {"time": 3519, "text": "So specifically drug consumption, which isn't all of addiction, but it's like in order for something to be addictive, it has to be a reward."}, {"time": 3528, "text": "And it has to compete with other rewards in your life."}, {"time": 3534, "text": "And one of the two main aspects of addiction in my view, and this doesn't map onto how the DSM, the psychiatry Bible defines addiction, which I think is largely bunk, but there's some value to have some common description, but it's how rewarding is it from this multi dimensional lens?"}, {"time": 3555, "text": "And specifically, how does that rewarding value compete with other rewards, other consequences in your life?"}, {"time": 3565, "text": "So it's not a problem if the use of that substance is rewarding."}, {"time": 3572, "text": "Okay, yeah, you like to have a couple of beers every once in a while, and it's like not a problem."}, {"time": 3578, "text": "But then you have the alcoholic who is drinking so much that it tanks their career, it ruins their marriage."}, {"time": 3587, "text": "It's in competition with these pro social aspects to their life."}, {"time": 3592, "text": "It's all about comparing to the other choices you're making, the other activities in your life."}, {"time": 3597, "text": "And if you evaluate it as a much higher reward than anything else, that becomes an addiction."}, {"time": 3606, "text": "And so it's not just the rewarding value, but it's the relative rewarding value."}, {"time": 3610, "text": "And the other major aspect, again, from behavioral economics, that the thing that makes addiction is something called delayed discounting."}, {"time": 3620, "text": "So in economics, sometimes it's called time preference."}, {"time": 3623, "text": "It's what compound interest rates are based upon."}, {"time": 3626, "text": "It's the idea that delaying a good access to a good or a reward comes with a certain decrement to its value."}, {"time": 3635, "text": "So we'd all rather have things now than later."}, {"time": 3639, "text": "And we can study this at the individual level of, would you rather have $9 today or $10 tomorrow?"}, {"time": 3648, "text": "And when you do that, you get huge differences between addicted populations and non addicted, not just heroin and cocaine, but like just cigarette smokers, like normal everyday cigarette smokers."}, {"time": 3662, "text": "And even when you look at something like monetary rewards."}, {"time": 3666, "text": "And so you can go into the rabbit hole with this delayed discounting model."}, {"time": 3670, "text": "So it's not only those huge differences that seem to have a face valid aspect to it."}, {"time": 3675, "text": "Like the cigarette smoker is choosing this thing that's rewarding today, but I know it comes with increased risk of having these horrible consequences down the line."}, {"time": 3684, "text": "So it's this competition between what's good for me now and what's good for me later."}, {"time": 3688, "text": "And the other aspect about delayed discounting is that if you quantitatively map out that discounting curve over time, so you don't just do that $10 tomorrow, how much is it worth to you today?"}, {"time": 3705, "text": "So you can say, what about nine?"}, {"time": 3706, "text": "What about eight?"}, {"time": 3707, "text": "What about $7?"}, {"time": 3708, "text": "And you can titrate it to find that indifference point."}, {"time": 3711, "text": "And so we can say, aha, $10 tomorrow is worth $6 today."}, {"time": 3717, "text": "So it's by the one day it's decreased by 40%."}, {"time": 3720, "text": "We can do that also at one week and one month and one year and 10 years and map out that curve, get a shape of that curve."}, {"time": 3729, "text": "And one of the fascinating things about this is that whether you're talking about pigeons, making these types of choices between a little bit of food now or a little bit of food a minute from now or rats, or like dozens of species of animals tested, including humans, the tendency is pretty consistently that we discount hyperbolically rather than exponentially."}, {"time": 3751, "text": "And what exponentially means is that every unit of time is associated with the same proportional reduction."}, {"time": 3757, "text": "Every unit of delay is associated with the same, causes the same proportional reduction in value."}, {"time": 3762, "text": "And that's the way the compound interest rate works."}, {"time": 3767, "text": "Every day you get this sort of out of whatever values in there at the beginning of that day, you get this, we'll give you this amount of extra money to compensate you for that delay."}, {"time": 3781, "text": "But then the way that all animals tend to function is of this very different way where the reductions, the initial, that initial delay, so like one day's worth of delay, you see a much stronger discounting rate or reduction in value than you do over those."}, {"time": 3800, "text": "So you see the super proportional, then it changes to these lesser rates."}, {"time": 3806, "text": "And so the implication of that, I know I've gone like really into the weeds quantitatively, but what that means is that there's these preference reversals."}, {"time": 3814, "text": "When you have curves of that nature, the decay that's hyperbolic, it maps onto this phenomenon we see both in terms of how people deal with future rewards, but also how perception works."}, {"time": 3832, "text": "When two things are far away, whether it's physical distance or whether in terms of perception or whether it's in terms of time, when you're really far away, the value, the subjective value for that further, that delayed reward is larger."}, {"time": 3848, "text": "So for example, like, let's say we're talking about 360, 364 days from now, you can get $9 or 365 days a year."}, {"time": 3861, "text": "Now you get $10 and you're like, dude, it's like, it's a year, like no difference."}, {"time": 3865, "text": "Like I'll take, why not get one more dollar?"}, {"time": 3869, "text": "You bring that same exact set of choices closer."}, {"time": 3871, "text": "Nothing's changed other than the time to both rewards."}, {"time": 3874, "text": "And it's like, would you rather have $9 today or $10 tomorrow and plenty of people would say, eh, just about the same, let's go ahead and take it today."}, {"time": 3883, "text": "So you see this preference reversal."}, {"time": 3885, "text": "And so that's a model of addiction in the sense that consistently with true addiction, I would argue, you see this competition between molar and molecular utility."}, {"time": 3901, "text": "It's like interpersonal, like within the person competing agents."}, {"time": 3907, "text": "Someone sometimes has control of the bus that wants to do what's good for you in the short term."}, {"time": 3914, "text": "And someone at other times is in control of driving the bus and they want to do what's good for you in the long term."}, {"time": 3922, "text": "So you tell the, you're trying to quit and you see a doctor, you see your 12 step therapist and say, God, I know this stuff is killing me."}, {"time": 3930, "text": "Like, I'm really, I'm on the path, like I'm done."}, {"time": 3935, "text": "And that's when you're kind of in their office or wherever you're not, it's not around you."}, {"time": 3939, "text": "And then later on that day, your buddy says that, hey man, I just scored."}, {"time": 3942, "text": "I got it right here."}, {"time": 3943, "text": "Do you want it?"}, {"time": 3944, "text": "And that reward is right in front of you."}, {"time": 3945, "text": "That's like bringing those two choices right in front of you."}, {"time": 3948, "text": "And it's like, hell yeah, I want to use."}, {"time": 3950, "text": "And then you can go through that cycle for like years of the person telling themselves, I want to quit."}, {"time": 3956, "text": "But then other times that same person is saying, I don't want to, you know, functionally, they're saying, I don't want to, because they're saying, yeah, like, yeah, give me some."}, {"time": 3964, "text": "So in the moment, it's very difficult to quit."}, {"time": 3967, "text": "And this isn't just something, this is something that has huge clinical ramifications with addiction, but it's like all humans do it."}, {"time": 3973, "text": "Anyone who's hit the snooze alarm in the morning, like the night before they realize, oh, I got to get up extra early tomorrow."}, {"time": 3979, "text": "That's what's ultimately better for me."}, {"time": 3981, "text": "So I'm going to set the alarm for, you know, 5 a.m. And it goes off at 5 a.m., you know, and then, so now those two consequences have come sooner and it's like, what the hell?"}, {"time": 3995, "text": "And they hit the snooze alarm."}, {"time": 3997, "text": "And sometimes not just once, but then five minutes later and five minutes later, you know, and so, and it's why it's easier to exercise self control at the grocery store compared to in your fridge."}, {"time": 4008, "text": "Like if that snack is like 30 seconds away in your fridge, you're going to more likely yield to temptation than if it is further away."}, {"time": 4021, "text": "So then just take a step back to something you brought up earlier, the inelasticity of pricing."}, {"time": 4028, "text": "Is it from a perspective of the dealers, whether we're talking about cigarettes or maybe venturing slightly into the illegal realm, you know, of people who sell drugs illegally, they also have an economics to them that they set prices and all those kinds of things."}, {"time": 4049, "text": "Does addiction allow you to mess with the nature of pricing?"}, {"time": 4055, "text": "Like, so I kind of assume that you meant that there's a correlation between things you're addicted to and the inelasticity of the price."}, {"time": 4064, "text": "So you can jack up the price."}, {"time": 4066, "text": "Is there something interesting to be said both for legal drugs and illegal drugs about the kind of price games you can play because the consumers of the product are addicted?"}, {"time": 4083, "text": "Right, I mean, I think you just described it."}, {"time": 4086, "text": "Yeah, you can jack up the price and you know, some people are going to drop off, but the people, you know, and it's not dichotomous because you could just consume less, but some people are going to consume less and the people that are most addicted are going to keep, you know, I mean, you see this, they're going to keep purchasing."}, {"time": 4103, "text": "So you see this with cigarettes."}, {"time": 4104, "text": "And so it's interesting when you interface this with policy, like in one respect, heavily taxing cigarettes is a good thing."}, {"time": 4112, "text": "We know it keeps adolescents particularly price sensitive."}, {"time": 4116, "text": "So you definitely, people smoke less and especially kids smoke less when you keep cigarette prices high and you tax the hell out of them."}, {"time": 4124, "text": "But one of the downsides you've got to balance and keep in mind is that you disproportionately have working class, poor people."}, {"time": 4132, "text": "And then you get into a point where someone's spending, you know, a quarter of their paycheck on cigarettes."}, {"time": 4136, "text": "So they're going to smoke no matter what."}, {"time": 4138, "text": "And basically because they're addicted, they're going to smoke no matter what."}, {"time": 4142, "text": "And you're just, yeah, you're taxing their existence."}, {"time": 4146, "text": "Right, so you're making it worse for them."}, {"time": 4148, "text": "If they don't, if they are completely inelastic, you're actually making that person's life worse."}, {"time": 4152, "text": "Because we know that by interfering with the amount of money they have, you're interfering with the other pro social, the potential competitors to smoking, you know."}, {"time": 4163, "text": "And we know that when someone's in more impoverished environments and they have less sort of non drug alternatives, you know, the more likely they're going to stay addicted."}, {"time": 4175, "text": "Is there data, this is interesting, from a scientific perspective of those same kind of games in illegal drugs?"}, {"time": 4185, "text": "Sort of, because that's where most drug, I was, I mean, I don't know, maybe you can correct me, but it seems like most drugs are currently illegal."}, {"time": 4196, "text": "And so, but there's still an economics to them, obviously."}, {"time": 4200, "text": "That's the drug war and so on."}, {"time": 4201, "text": "Is there data on the setting of prices or like how good are the business people running the selling of drugs that are illegal?"}, {"time": 4211, "text": "Are they all the same kind of rules apply from a behavioral economics perspective?"}, {"time": 4216, "text": "I mean, they're basically, whether they're crunching the numbers or not, they're basically sensitive to that demand curve and they're doing the same thing that businesses do in a legal market."}, {"time": 4227, "text": "And, you know, you want to sell as much of a product to get as much money."}, {"time": 4232, "text": "You're looking more at the total income."}, {"time": 4233, "text": "So if you jack the price a little bit, you're going to get some reduction in consumption, but it may be that the total amount of money that you rake in is going to be more than, it's going to overcompensate for that."}, {"time": 4246, "text": "So you're willing to take, okay, I'm going to lose 10% of my customers, but I'm getting more than enough to compensate from that, from the extra money from the people who still are buying."}, {"time": 4255, "text": "So I think they're more, you know, and especially when we get to the lower, I wouldn't be surprised if people are crunching those numbers and looking at demand curves, maybe at the, you know, at the really high levels of the, you know, up the chain with the cartels and whatnot."}, {"time": 4267, "text": "I don't know, that wouldn't surprise me at all, but I think it's probably more implicit at the lower levels where something, you brought up drug policy."}, {"time": 4277, "text": "I will say that for years now, it's been this kind of unquestioned goal by, for example, the drug czar's office in the US to make the price of illegal drugs as high as possible without this kind of nuanced approach that, yeah, if you make, you know, for some people, if you make the price so high, you're actually making things worse."}, {"time": 4303, "text": "I mean, I'm all about reducing the problems associated with drugs and drug addictions."}, {"time": 4308, "text": "And part of that is the, are more direct consequences of those drugs themselves, but a whole lot is what you get from indirectly and, you know, sort of the, both for the individual and for society."}, {"time": 4322, "text": "So like making a poor person who doesn't have enough money for their kids, making them even poorer."}, {"time": 4326, "text": "So now you've made their children's future worse because they're growing up in deeper poverty because you've essentially levied a tax onto this person who's heavily addicted."}, {"time": 4338, "text": "But then at the societal level, you know, so everything we know about the drug war in terms of the heavy criminalization and filling up prisons and reducing employment and educational opportunities, which in the big picture, we know are the things that in a free market compete against some of the worst problems of addiction is actually having educational and employment opportunities."}, {"time": 4362, "text": "But when you give someone a felony, for example, you're pretty much guaranteeing they're never gonna go very high on the economic ladder."}, {"time": 4370, "text": "And so you're making drugs a better reward for that person's future."}, {"time": 4376, "text": "So this is a quick step into the policy realm."}, {"time": 4380, "text": "And I think for both you and I, I'm not sure you can correct me, but I'm more comfortable into studying the effects of drugs on the human behavior and human psychology versus like policy."}, {"time": 4393, "text": "It seems like a whole giant mess, but yeah, there's some libertarian candidates for president and just libertarian thinkers that had a nice thought experiment of possibly legalizing, I've spoken about possibly legalizing basically all drugs."}, {"time": 4412, "text": "In your intuition, do you think a world where all drugs are legal is a safer world or a less safe world for the users of those drugs?"}, {"time": 4425, "text": "It really depends on what we mean by legalization."}, {"time": 4427, "text": "So this is one of my beefs with this, how these things are talked about."}, {"time": 4432, "text": "I mean, we have very few completely laissez faire, you know, legal drugs."}, {"time": 4439, "text": "So even caffeine is one of the few examples."}, {"time": 4442, "text": "So for example, caffeine and tea and coffee is in that realm."}, {"time": 4445, "text": "Like there's no limits, no one's testing, there's no laws, regulation at any level of how much caffeine you're allowed to buy or how much is in the product."}, {"time": 4452, "text": "But even like with this Starbucks, like nitro, there are rules with soda and with canned products, you can only put so much."}, {"time": 4459, "text": "In there, yeah."}, {"time": 4460, "text": "So this is FDA regulated."}, {"time": 4462, "text": "And it's kind of weird because there's a limit to sodas that's not there for energy drinks and other things."}, {"time": 4467, "text": "But, you know, so even caffeine, it depends on what product we're talking about."}, {"time": 4471, "text": "Like if you're like no dose and other caffeine products over the counter, like you can't just put 800 milligrams in there."}, {"time": 4476, "text": "The pills are like one or 200 milligrams."}, {"time": 4479, "text": "And so it's FDA regulated as an over counter drug."}, {"time": 4481, "text": "Some of the most dangerous drugs in society, I would say arguably one of the most dangerous classes of drugs is the volatile anesthetics, huffing."}, {"time": 4489, "text": "People huffing gasoline and, you know, airplane glue, toluene, whatnot, severely damaging to the nervous system."}, {"time": 4498, "text": "Pretty much legal, but there's some regulation in the sense that there's a warning label, like it's illegal to do it for, not that they're busting people for this, but, you know, it's against federal law to use this in a way other than intended type of, basically saying like, yeah, don't huff this, you know, your paint thinner or whatnot."}, {"time": 4519, "text": "It at least keeps people from selling it for that."}, {"time": 4522, "text": "Like, no, because they're gonna go after that person."}, {"time": 4524, "text": "They're not gonna be able to find the 12 year old who's huffing."}, {"time": 4527, "text": "So anyway, just as some extreme examples at the end."}, {"time": 4530, "text": "And then, you know, even the so called illegal, like schedule one drugs, psilocybin, we do plenty in terms of schedule two, which is ironically less restrictive than psilocybin, but methamphetamine and cocaine, I've done human research with."}, {"time": 4545, "text": "My research has been legal."}, {"time": 4547, "text": "So they're scheduled compounds, but they're not completely illegal."}, {"time": 4549, "text": "Like you can do research with them with the appropriate licenses and approval."}, {"time": 4555, "text": "So there really is no such thing."}, {"time": 4557, "text": "And like alcohol, well, it's illegal if you're 12 years old or 18 years old or 20 years old."}, {"time": 4563, "text": "And for anyone, it's illegal to be drinking it while you're driving."}, {"time": 4566, "text": "So there's always a nuance."}, {"time": 4569, "text": "It's not dichotomy."}, {"time": 4571, "text": "And I actually should admit, it's been on my to do list for a while to buy in Massachusetts, some like edible, or buy weed legally."}, {"time": 4581, "text": "Yeah, haven't done that in Massachusetts, let's put it this way."}, {"time": 4584, "text": "And I wonder what that experience is like, because I think it's fully legal in Massachusetts."}, {"time": 4591, "text": "And so I wonder what legal drugs look like to me."}, {"time": 4595, "text": "You know, I grew up with even weed being like, you know, it's like this forbidden thing, you know, not forbidden, but it's illegal."}, {"time": 4603, "text": "You know, most people, of course, I never partook, but most people I knew would attain it illegally."}, {"time": 4610, "text": "And so that big switch that's been happening across the country, there's like federal stuff going on to make marijuana legal federally."}, {"time": 4620, "text": "I'm half paying attention."}, {"time": 4621, "text": "There's some movement there."}, {"time": 4622, "text": "I mean, the House passed a bill that's not gonna be passed by the Senate, but yeah, it's progress."}, {"time": 4628, "text": "There's clearly a change."}, {"time": 4629, "text": "Right, it's moving in a trend."}, {"time": 4631, "text": "So that's the example of a drug that used to be illegal is now becoming more and more and more legal."}, {"time": 4637, "text": "So like, I wonder what like cocaine being legal looks like, what a society with cocaine being legal looks like, the rules around it, you know, the processes in which you can consume it in a safer way and be more educated about its consequences, be able to control dose and like purity much better, be able to get help for overdose."}, {"time": 4664, "text": "I don't know, all those kinds of things."}, {"time": 4666, "text": "It does in a utopian sense feel like legalizing drugs at least should be talked about and considered versus keeping them in the dark."}, {"time": 4680, "text": "But yeah, so that in your sense, it's possible that in 50 years we legalize all drugs and it makes for a better world."}, {"time": 4693, "text": "The way I like to talk about it is that I would say that it's possible and it would probably be a good thing if we regulate all drugs."}, {"time": 4700, "text": "How would you regulate like cocaine, for example?"}, {"time": 4703, "text": "Is there ideas there?"}, {"time": 4705, "text": "So yeah, and you were already, you know, going, you know, where I was going with that kind of first I described how there's always a new ones."}, {"time": 4712, "text": "And even like the cannabis in Massachusetts, federally illegal."}, {"time": 4715, "text": "So for example, if I was like, and I, you know, colleagues that do cannabis research where they get people high in the lab, like you're a federal funded researcher with NIH funds, you can't get that stuff from the dispensary because you're breaking a federal law."}, {"time": 4728, "text": "Even though the feds don't have the resources to go after, they don't want the controversy at this point to go after the individual users or even the sellers in those legal states."}, {"time": 4736, "text": "So there's always this nuance, but it's about the right regulation."}, {"time": 4739, "text": "So I think we already know enough that, for example, like I think safe injection sites for hard drugs makes a lot of sense."}, {"time": 4747, "text": "Like I wouldn't want heroin and cocaine at the convenience stores."}, {"time": 4753, "text": "And I don't think, maybe there's some extreme libertarians that want that."}, {"time": 4756, "text": "I think even the folks that identify as libertarians, probably most of them don't, well, I don't know."}, {"time": 4761, "text": "Like not all of them want that, you know?"}, {"time": 4765, "text": "I think, you know, that as a form of regulation, like, look, if you're using these hard drugs on a regular basis, you're putting yourself at risk for lethal overdose."}, {"time": 4774, "text": "You're putting yourself at risk for catching HIV and hepatitis."}, {"time": 4781, "text": "If you're gonna do it, if you're doing it anyway, come to this place where at least you're not like, you know, like pulling the water out of like, you know, the puddle on the side of the street."}, {"time": 4792, "text": "Yeah, so it's done by professionals and those professionals are able to educate you also."}, {"time": 4797, "text": "So like a 711 clerk may not be both capable of helping you to inject the drug properly, but also won't be equipped to educate you at the negative consequences, all those kinds of things."}, {"time": 4810, "text": "That's a huge part of it, the education."}, {"time": 4811, "text": "But then I think with the opioids, like the big part of it is just like with naloxone, which is an antagonist, it goes into the receptor, it's called Narcan, that's the trade name, but it's what they revive people on an opioid overdose."}, {"time": 4826, "text": "That's almost completely effective."}, {"time": 4829, "text": "Like if there's a medical professional there and someone's ODing on an opioid, they're virtually guaranteed to live."}, {"time": 4835, "text": "Like that's remarkable that if 100% at the opioid crisis, you know, if all of those people right now that are dying were doing that in the presence of a medical professional, like even like a nurse with Narcan, there'd be basically almost no deaths."}, {"time": 4850, "text": "There's always some exceptions, but you know, almost no deaths, like that's staggering to me."}, {"time": 4854, "text": "So the idea that people are doing this, that we could have that level of positive effect without encouraging the drug."}, {"time": 4862, "text": "And this is where like you get into this like terrain of like sending the wrong message."}, {"time": 4866, "text": "And it's like, no, you can do that."}, {"time": 4869, "text": "You can say like, we're not encouraging this."}, {"time": 4872, "text": "In fact, probably one of the greatest advertisements for not getting hooked on heroin is like visiting a methadone clinic, visiting a safe injection site."}, {"time": 4879, "text": "Like this is not like an advertisement for getting hooked on this drug, but knowing that we can save people."}, {"time": 4911, "text": "You know, so you could, the level that's been more explored in Switzerland is in some places is you actually provide the drug itself and you supervise the injection."}, {"time": 4923, "text": "So I don't see."}, {"time": 4924, "text": "Do you like that idea?"}, {"time": 4925, "text": "Yeah, the public health data are completely on the side of, there's really no credible evidence to this."}, {"time": 4931, "text": "If we allow that, we're sending the wrong message and everyone's gonna, I mean, I'm not showing up."}, {"time": 4935, "text": "Like, you know, and it's different by drug."}, {"time": 4937, "text": "Like, yeah, you legalize, you set up cannabis shops and some people are gonna say, so you go, I'm gonna go there."}, {"time": 4941, "text": "I don't think a whole lot of people are gonna go to one of these places and say, I'm gonna shoot up heroin for the first time."}, {"time": 4948, "text": "And even if like, you know, it's a country of 300 million people, like even if someone does that, you have to compare this to the every day people are dying from opioid overdoses."}, {"time": 4959, "text": "Like people's kids, people's uncles, people's like, these are real lives that are being shattered."}, {"time": 4963, "text": "So you just look at that."}, {"time": 4965, "text": "And then the other thing, and I know this from having done residential, even like non treatment research, where we just have a cocaine user or something, stay on our inpatient ward for a month and you really get to know them."}, {"time": 4975, "text": "And sometimes you see like, oftentimes that's the first time this person has had a discussion with a medical professional, any type of professional in their entire life around their drug use."}, {"time": 4985, "text": "Even if they're not looking to quit."}, {"time": 4987, "text": "And it's like, you know, you could imagine that in the safe injection settings where it's like, it might be a year into treatment and they're like, you know, doc, I know you're not the cops."}, {"time": 4997, "text": "Like you really care for me."}, {"time": 4998, "text": "Like, I think I'm ready to try that methadone thing."}, {"time": 5001, "text": "I think I'm really, I think I wanna be done."}, {"time": 5003, "text": "I'm really patient about it, yeah."}, {"time": 5004, "text": "Yeah, they get to trust the people and realize that they're there cause they truly like, they have a compassion, a love for this community, like as human beings, and they don't want people to die."}, {"time": 5016, "text": "And you get real human connections and that, and again, like those are the conditions where people are gonna ultimately seek treatment and not everyone always will, but you're gonna get that."}, {"time": 5026, "text": "And then, you know, you're gonna get people like looking into treatment options sometimes, you know, maybe it's years into the treatment."}, {"time": 5033, "text": "So it's like, they're just all of these indirect benefits that I think at that level, I don't know if you'd call that legalizing, you know, I think again, at least well regulated."}, {"time": 5042, "text": "Right, whatever that word is."}, {"time": 5044, "text": "Yeah, well regulated, but out in the open."}, {"time": 5048, "text": "Right, minimizing as many harms as we can while not encouraging."}, {"time": 5053, "text": "I mean, we don't encourage people to drink all the, I mean, people die every year from caffeine overdose."}, {"time": 5057, "text": "Like, you know, there's different ways to like, you know, just by allowing something doesn't mean we're sending the message that, you know, by saying we're not gonna give you a felony, which is actually often the penalty for psychedelics."}, {"time": 5072, "text": "I just actually testified for the Judiciary Committee of the Senate, the Assembly in New Jersey."}, {"time": 5078, "text": "And just to move psilocybin from a felony to misdemeanor, they use different language in New Jersey, it's weird, but like the equivalent of felony and misdemeanor."}, {"time": 5087, "text": "And that was like, two people didn't vote for that on this committee because it was might, one of them said it might be sending the wrong message."}, {"time": 5095, "text": "And it's like, a felony, I mean, there's real harms."}, {"time": 5099, "text": "Like, that's the scarlet letter the rest of your life."}, {"time": 5101, "text": "You're stuck at the lower ends of the employment ladder."}, {"time": 5104, "text": "You're not gonna get, you know, loans for education, all of this, maybe because of a stupid mistake you made once as a 19 year old."}, {"time": 5111, "text": "Doing something that like, you know, a presidential candidate could have done and admitted to and had no problem, you know?"}, {"time": 5116, "text": "Yeah, what drug is the most addictive, the most dangerous in your view?"}, {"time": 5125, "text": "Not maybe, like not technically, like specifically which drug, but more like in our society today, what is a highly problematic drug?"}, {"time": 5135, "text": "We talked about psychedelics not being that addictive on the other flip side of that."}, {"time": 5141, "text": "You mentioned cocaine, is that the top one?"}, {"time": 5146, "text": "That's a concern to you?"}, {"time": 5148, "text": "It depends, and you've already alluded to this nuance."}, {"time": 5150, "text": "It depends on how you define it."}, {"time": 5151, "text": "If we're talking about on the ground today, in, you know, a modern society, I'd say nicotine, tobacco."}, {"time": 5160, "text": "I mean, in terms of mortality, it kills far more than any other drug known to humankind."}, {"time": 5169, "text": "Four times more than alcohol, like a half million deaths in the US every year and about five to six million worldwide due to tobacco."}, {"time": 5178, "text": "That's four times more in the US than alcohol."}, {"time": 5207, "text": "That's one of those uncomfortable truths that I don't know what to do with."}, {"time": 5212, "text": "It's like where everybody's freaking out about coronavirus, right?"}, {"time": 5219, "text": "And nobody's..."}, {"time": 5219, "text": "The relative."}, {"time": 5221, "text": "If you look at the relative thing, it's like, well, why aren't we freaking out about cigarettes, which we are increasingly so over the, historically speaking, right?"}, {"time": 5232, "text": "It's like terrorism versus swimming pools."}, {"time": 5234, "text": "I remember that being back in the, after the war on terror started."}, {"time": 5238, "text": "It's like, yeah, there's not even comparison."}, {"time": 5241, "text": "So, you know, that's a little sobering truth there."}, {"time": 5245, "text": "Cause I was thinking like cocaine, I was thinking about all of these hard drugs, but the reality is relatively nicotine is the big one."}, {"time": 5253, "text": "And you didn't ask about mortality or deaths."}, {"time": 5255, "text": "You asked about addiction, but that really is hard to evaluate."}, {"time": 5260, "text": "It gets into those nuances I spoke of before about there's not a unidimensional way to measure reinforcement."}, {"time": 5266, "text": "It kind of depends on the situation and what measure we're looking at."}, {"time": 5270, "text": "But you know, more people have access to tobacco and I'm not advocating that we make it an illegal drug."}, {"time": 5278, "text": "I think that would be a horrible mistake."}, {"time": 5280, "text": "Although there is a very credible push to mandate the reduction of nicotine in cigarettes, which I have most scientists that study it are for it."}, {"time": 5290, "text": "I think there's some real dangers there cause I see that in the broader history of drug use."}, {"time": 5296, "text": "It's like when has drug prohibition worked broadly speaking?"}, {"time": 5300, "text": "And it's to me that path would only make sense in very good conjunction with eCigarettes, which once they're fully regulated can be a safer, not safe, but much safer alternative."}, {"time": 5314, "text": "And if we tax the hell out of eCigarettes and ban every attractive feature like flavors and everything, then that's gonna push people to a black market if they can't get the real thing from real cigarette."}, {"time": 5327, "text": "Like some people will just quit straight out."}, {"time": 5329, "text": "But I think with the regulators and what a lot of scientists that study tobacco, like myself, it's a big part still of what I study."}, {"time": 5338, "text": "They're not used to thinking about the like tobacco really as a drug largely speaking in terms of, for example, the history of prohibition."}, {"time": 5347, "text": "And I think of like, we already know there's an illicit market, a black market for tobacco to get around taxes."}, {"time": 5354, "text": "I mean, and for selling even loose cigarettes, that's what initially caused in Staten Island the police to approach Eric Garland who was selling loose cigarettes and he got choked out."}, {"time": 5363, "text": "I mean, the thing that caused that police contact was he was selling, well, I think reported to sell individual cigarettes for like, he gets home for court, it happens in Baltimore."}, {"time": 5372, "text": "And it's like, that's technically illegal."}, {"time": 5374, "text": "But are you not gonna have massive boats of supplies coming over from China and elsewhere of real deal cigarettes if you ban the sale of nicotine?"}, {"time": 5387, "text": "Like it's obviously gonna happen."}, {"time": 5389, "text": "And you have to weigh that against, you're gonna create a black market to one size or another."}, {"time": 5395, "text": "And your intuition that really hasn't worked throughout the history when we've tried it."}, {"time": 5399, "text": "Right, but I see a potential path forward, but only if it's well, if it's not in conjunction with eCigarettes."}, {"time": 5406, "text": "If there's a clear alternative, that's a positive alternative that it kind of stares the population towards an alternative."}, {"time": 5414, "text": "The difference here, the unique thing that could be taken advantage of here is nicotine is by and large, not what causes the harm."}, {"time": 5420, "text": "It's the aromatic hydrocarbons, it's the carcinogens and tobacco, it's burning tobacco smoke, it's not the nicotine."}, {"time": 5429, "text": "So it's not like alcohol prohibition where like you couldn't create the O'Douls, the near beer is not gonna have the alcohol."}, {"time": 5468, "text": "So I feel like there is a potential path forward, but I don't have a lot of confidence that that's gonna be done in a thoughtful analytical way."}, {"time": 5477, "text": "And I'm afraid that it could decrease the increase of black market calls all of the harms."}, {"time": 5483, "text": "Like every other drug we're moving away from the prohibition model slowly, but the big barge ship is like making a very slow turn."}, {"time": 5492, "text": "And like, okay, we really had to step back and question if we went with nicotine, tobacco, are we moving into that direction?"}, {"time": 5501, "text": "Like big picture."}, {"time": 5503, "text": "It doesn't quite make sense."}, {"time": 5505, "text": "You've done a study on cocaine and sexual decision making."}, {"time": 5513, "text": "Can you explain the findings?"}, {"time": 5516, "text": "I mean, in a broad sense, how do you do a study that involves cocaine and the other, how do you do a study involving sexual decision making?"}, {"time": 5533, "text": "And then how do you do a study that combines both?"}, {"time": 5536, "text": "Yeah, sex and drugs too."}, {"time": 5538, "text": "I'm just missing the rock and roll."}, {"time": 5539, "text": "It's like the two controversial, rock and roll isn't very controversial anymore."}, {"time": 5543, "text": "Yeah, so the cocaine, lots of hoops to jump through."}, {"time": 5546, "text": "You gotta have a lot of medical support."}, {"time": 5548, "text": "You gotta be at a basically an institution, a research unit like I'm at that has a long history and the ability to do that and get ethics approval, get FDA approval, but it's possible."}, {"time": 5561, "text": "And whenever you're dealing with something like cocaine, you would never wanna give that to someone who hasn't already used cocaine."}, {"time": 5569, "text": "And you wanna make sure you're not giving it to someone who is an active user who wants to quit."}, {"time": 5573, "text": "So the idea is like, okay, if you're using this type of drug anyway, and we're really sure you're not looking to quit, hey, use a couple of times in the lab with us so we can at least learn something."}, {"time": 5586, "text": "And part of what we learn is maybe to help people not use and it'll reduce the harms of cocaine."}, {"time": 5592, "text": "So there's hoops to jump through."}, {"time": 5594, "text": "With the sexual decision making, I looked at the main thing I looked at was this model of I applied delayed discounting to what we talked about earlier, the now versus later, that kind of decision making that goes along with addiction."}, {"time": 5607, "text": "I applied that to condom use decisions."}, {"time": 5610, "text": "And I've done probably published about 20 or so papers with this and different drugs."}, {"time": 5616, "text": "So the primary metric is whether you do or don't use a condom?"}, {"time": 5620, "text": "Right, and so this is using hypothetical decision making, but I've published some studies looking at, showing a tight correspondence to self report it in correlational studies to self reported behavior."}, {"time": 5634, "text": "So this is like, so like how do you, did you do a questionnaire kind of thing?"}, {"time": 5639, "text": "Right, so it's not quite a questionnaire, but it's a behavioral task requiring them to respond to."}, {"time": 5648, "text": "So you show pictures of a bunch of individuals and it's kind of like one of these fun behavioral, like a lot of them you get like numbers are boring, but it's like, okay, hot or not, like which of these 60 people would you have a one night stand with?"}, {"time": 5660, "text": "Men, women, so pick whatever you like, a little bit of this, a little bit of that, whatever you're into, it's all variety there."}, {"time": 5666, "text": "Out of that group, you pick some subsets of people."}, {"time": 5669, "text": "Who do you think is the one you most want to have sex with the least, he thinks most likely to have an STI or least likely a sexually transmitted disease by STI."}, {"time": 5677, "text": "And then you could do certain decision making questions."}, {"time": 5681, "text": "So what I've done is asked, say this person you read a vignette, this person wants to have sex with you now you've met them, you get along casual sex scenario, like a one night stand with a condoms available, just rate your likelihood from one to 100 on this kind of scale, would you use it?"}, {"time": 5697, "text": "But then you can change your scenario to say, okay, now imagine you have to wait five minutes to use a condom."}, {"time": 5702, "text": "So the choice is now instead of using condom versus not in terms of your likelihood scale, it now what ranges from have sex now without a condom versus on the other end of the scale is wait five minutes to have sex with a condom."}, {"time": 5716, "text": "So you rate your likelihood of where your behavior would be along that continuum."}, {"time": 5720, "text": "And then you could say, okay, well, what about an hour?"}, {"time": 5722, "text": "What about three hours?"}, {"time": 5723, "text": "What about 24 hours?"}, {"time": 5725, "text": "Misunderstanding, now without a condom or five minutes later with a condom?"}, {"time": 5733, "text": "So what's supposed to be the preference for the person?"}, {"time": 5741, "text": "There's a lot of factors coming into play, right?"}, {"time": 5744, "text": "There's like pleasure, a personal preference and then there's also the safety."}, {"time": 5751, "text": "Those are two like, are those competing objectives?"}, {"time": 5755, "text": "Right, and so we do get at that through some individual measures and this task is more of a face valid task where there's a lot underneath the hood."}, {"time": 5762, "text": "So for most people, sex with the condom is the better reward but underneath the hood of that is just at the purely physical level, they'd rather have sex without the condom."}, {"time": 5773, "text": "It's gonna feel better."}, {"time": 5774, "text": "What do you mean by reward?"}, {"time": 5775, "text": "Like when they calculate their trajectory through life and try to optimize it, then sex with the condom is a good idea?"}, {"time": 5784, "text": "Well, it's really based on, I mean, yeah, yeah."}, {"time": 5787, "text": "Presumably that's the case that there's, but it's measured by like what would you, really that first question where there is no delay."}, {"time": 5795, "text": "Most people say they would be at the higher end scale a lot of times 100% they would say they would definitely use a condom."}, {"time": 5801, "text": "Not everybody and that we know that's the case."}, {"time": 5803, "text": "See, it's like that some people don't like condoms, some people say, yeah, I wanna use a condom but quarter of the time ended up not because I just getting lost in the passion of the moment."}, {"time": 5813, "text": "So for the people, I mean, the only reason that people, so behaviorally speaking, at least for a large number of people in many circumstances condom use as a reinforcer just because people do it."}, {"time": 5823, "text": "Like, why are they doing it?"}, {"time": 5827, "text": "They're not because it makes the sex feel better but because it makes that it allows for at least the same general reward."}, {"time": 5835, "text": "Even if actually, even if it feels a little bit not as good with the condom, nonetheless, they get most of the benefit without the concurrent, oh my gosh, there's this risk of either unwanted pregnancy or getting HIV or way more likely than HIV, herpes in general awards, et cetera, all the lovely ones."}, {"time": 5857, "text": "And we've actually done research saying like where we gauge the probability of these individual different SDIs."}, {"time": 5862, "text": "And it's like, what's the heavy hitter in terms of what people are using to judge and to evaluate whether they're gonna use a condom."}, {"time": 5869, "text": "So that's why the condom use is the delayed thing, five minutes or more."}, {"time": 5874, "text": "And then, yeah, because that's the prefer."}, {"time": 5876, "text": "Which would normally be the larger later reward like the $10 versus the nine, it's like the $10, which is counterintuitive if you just think about the physical pleasure."}, {"time": 5884, "text": "So that's a good thing to measure."}, {"time": 5887, "text": "So condom use is a really good concrete, quantifiable thing that you can use in a study."}, {"time": 5893, "text": "And then you can add a lot of different elements like the presence of cocaine and so on."}, {"time": 5898, "text": "Yeah, you can get people loaded on like any number of drugs like cocaine, alcohol and methamphetamine are the three that I've done and published on."}, {"time": 5904, "text": "And it's interesting that."}, {"time": 5906, "text": "These are fun studies, man."}, {"time": 5908, "text": "Right, I love to get people loaded in a safe context and like, but to really, it started, like there was some early research with alcohol."}, {"time": 5916, "text": "I mean, the psychedelics are the most interesting, but it's like all of these drugs are fascinating."}, {"time": 5920, "text": "The fact that all of these are keys that unlock a certain like psychological experience in the head."}, {"time": 5926, "text": "And so there was this work with alcohol that showed that it didn't affect those monetary delay discounting decisions, $9 now versus $10 later."}, {"time": 5934, "text": "And I'm like getting people drunk."}, {"time": 5937, "text": "And I thought to myself, are you telling me that getting someone, that people being drunk does not cause people at least sometimes to make, to choose what's good for them in the short term at the expense of what's good for them in the long term."}, {"time": 5953, "text": "It's like, bullshit, like we see like, but in what context does that happen?"}, {"time": 5959, "text": "So that's something that inspired me to go in this direction of like, aha, risky sexual decisions is something they do when they're drunk."}, {"time": 5967, "text": "They don't necessarily go home."}, {"time": 5968, "text": "And even though some people have gambling problems and alcohol interacts with that, the most typical thing is not for people to go home, log on and change their allocation in their retirement account or something like that."}, {"time": 5980, "text": "But they're more likely, risky sexual decisions, they're more likely to not wait the five minutes for the condom and instead go no condom now."}, {"time": 5988, "text": "Right, that's a big effect."}, {"time": 5989, "text": "And we see that."}, {"time": 5990, "text": "And interestingly, we do not see, with those different drugs, we don't see an effect if we just look at that zero delay condition."}, {"time": 5997, "text": "In other words, the condoms right there waiting to be used, how likely are to use it?"}, {"time": 6000, "text": "You don't see it."}, {"time": 6001, "text": "I mean, people are by and large gonna use the condom."}, {"time": 6005, "text": "So, and that's the way most of this research outside of behavioral economics that just looked at condom use decisions, very little of which has ever actually administered the drugs, which is another unique aspect."}, {"time": 6017, "text": "But they usually just look at like assuming the condom is there."}, {"time": 6020, "text": "But this is more using behavioral economics to delve in and model something that, and I've done survey research on this, modeling what actually happens."}, {"time": 6028, "text": "Like you meet someone at a laundromat, like you weren't planning on like, and it's like one thing leads to another, they live around the corner, these things."}, {"time": 6037, "text": "And like we did one survey with men who have sex with men and found that 25% of them, 24%, about a quarter, reported in the last six months that they had unprotected anal intercourse, which is the most risky in terms of sexually transmitted infection."}, {"time": 6058, "text": "In the last six months, in a situation where they would have used a condom, but they simply didn't use one just because they didn't have one on them."}, {"time": 6064, "text": "So this to me, it's like, if unless we delve into this and understand this, these suboptimal conditions, we're not gonna fully address the problem."}, {"time": 6074, "text": "There's plenty of people that say, yep, condom use is good."}, {"time": 6077, "text": "I use it a lot of the time."}, {"time": 6079, "text": "It's like, where is that failing?"}, {"time": 6081, "text": "And it's under these suboptimal conditions, which in Frank, if you think about it, it's like most of the case."}, {"time": 6086, "text": "Action is unfolding, things are getting hot and heavy."}, {"time": 6088, "text": "Someone's like, do you got a condom?"}, {"time": 6091, "text": "Eh, no."}, {"time": 6092, "text": "It's like, do they break the action and take 10 minutes to go to the convenience store or whatever?"}, {"time": 6098, "text": "Maybe everything's closed."}, {"time": 6099, "text": "Maybe they gotta wait till tomorrow."}, {"time": 6102, "text": "And there's something to be studied there on the, that just seems like an unfortunate set of circumstances."}, {"time": 6109, "text": "Like, what's the solution to that is, I mean, what's the psychology that needs to be taken apart there?"}, {"time": 6120, "text": "Because it just seems like that's the way of life."}, {"time": 6122, "text": "We don't expect the things to happen."}, {"time": 6125, "text": "Are we supposed to expect them better to be self aware enough about our calculations?"}, {"time": 6131, "text": "Or you see the 10 minute detour to a convenience store as a kind of thing that we need to understand how we humans evaluate the cost of that."}, {"time": 6146, "text": "I think in terms of like how we use this to help people, it's mostly on the environment side, rather than on the individual side."}, {"time": 6154, "text": "Yeah, although those interact."}, {"time": 6156, "text": "So it's like, in one sense, if you're, especially if you're gonna be drinking or using another substance that is associated with a stimulant, alcohol and stimulants go along with risky sex."}, {"time": 6167, "text": "Good to be aware that you might make decisions just to tell yourself you might make a decision that you wouldn't have made in your sober state."}, {"time": 6174, "text": "And so, hey, throwing a condom in the purse, in the pocket, might be a good idea."}, {"time": 6180, "text": "I think at the environmental level, just more condom, I mean, it highlights what we know about just making condoms widely available."}, {"time": 6187, "text": "Something that I'd like to do is like reinforcing condom use."}, {"time": 6192, "text": "So just getting people used to carrying a condom everywhere they go."}, {"time": 6198, "text": "Because once it's in someone's habit, if they are, say, like a young, single person, and they occasionally have unprotected sex, like training those people, like what if you got a text message once every few days saying, ah, if you send back a photo of a condom, within a minute you get a reward of $5."}, {"time": 6217, "text": "You could shape that up like that."}, {"time": 6219, "text": "It's a process called contingency management."}, {"time": 6220, "text": "It's basically just straight up operant reinforcement."}, {"time": 6223, "text": "You could shape that up with no problem."}, {"time": 6225, "text": "And I mean, those procedures of contingency management, giving people systematic rewards is like, for example, the most powerful way to reduce cocaine use in addicted people."}, {"time": 6237, "text": "And by saying, if you show me a negative urine for cocaine, I'm gonna give you a monetary reward."}, {"time": 6245, "text": "And like that has huge effects in terms of decreasing cocaine use."}, {"time": 6249, "text": "If that can be that powerful for something like stopping cocaine use, how powerful could that be for shaping up just carrying a condom?"}, {"time": 6256, "text": "Because the primary, unlike cocaine use, here, we're not saying you can't have the main reward, like you could still have sex, and you can even have sex in the way that you tell yourself you'd rather do it if the condom is available."}, {"time": 6275, "text": "Relatively speaking, it's way easier than like not using cocaine if you like using cocaine."}, {"time": 6279, "text": "It's just basically getting in the habit of carrying a condom."}, {"time": 6283, "text": "So that's just one idea of like why."}, {"time": 6285, "text": "There could be also the capitalistic solutions of like, there could be a business opportunity for like a door dash for condoms."}, {"time": 6292, "text": "Like delivery."}, {"time": 6293, "text": "I thought about this."}, {"time": 6295, "text": "Within five minute delivery of a condom at any location, like Uber for condoms."}, {"time": 6299, "text": "I've thought about it, not with condoms, but a very similar line of thinking, a line that you're going into in terms of Uber and people getting drunk when they enter the bar playing to have one or two, they ended up having five or six, and it's like, okay, yeah, you can take the cab home, the Uber home, but you've left your car there."}, {"time": 6317, "text": "It might get towed."}, {"time": 6318, "text": "You might like, there's also the hassle of just, you wanna wake up tomorrow with your hangover and forget about it and move on."}, {"time": 6324, "text": "And I think a lot of people in their situation, they're like, screw it."}, {"time": 6327, "text": "I'm gonna take the risk, just get it."}, {"time": 6329, "text": "What if you had an Uber service where two, you have a car come out with two drivers and one of them, two sober drivers, obviously, and the person, the one driver drops off the other that then drives you home in their car, in your car, so that you can, I mean, I think a lot of people would pay 50 bucks."}, {"time": 6359, "text": "It's gonna be more than a regular Uber, but it's like, it's gonna be done."}, {"time": 6362, "text": "I got the money."}, {"time": 6363, "text": "I already spent 60 bucks at the bar tonight."}, {"time": 6366, "text": "Like, just get the damn thing done tomorrow."}, {"time": 6369, "text": "I'm done with it."}, {"time": 6370, "text": "I wake up, my car's in front of my house."}, {"time": 6372, "text": "I think that would be, I think someone could, I'm not gonna open that business, so if anyone hears this and wants to take off with that, I think it could help a lot of people."}, {"time": 6381, "text": "And Uber itself, I would say, helped a huge amount of people, just making it easy to make the decision of going home, not driving yourself."}, {"time": 6391, "text": "I read about in Austin where they, I don't know where it's at now, where they outlawed Uber for a while."}, {"time": 6396, "text": "You know, because of the whole taxicab union type thing and how just, yeah, there were like hordes of drunk people that were used to Uber that now didn't have a cheap alternative."}, {"time": 6407, "text": "So just, we didn't exactly mention, you've done a lot of studies in sexual decision making with different drugs."}, {"time": 6415, "text": "Is there some interesting insights or findings on the difference between the different drugs?"}, {"time": 6423, "text": "So I think you said meth as well."}, {"time": 6426, "text": "So cocaine, is there some interesting characteristics about decision making that these drugs alter versus like alcohol, all those kinds of things?"}, {"time": 6434, "text": "I think, and there's much more to study with this, but I think the biggie there is that the stimulants, they create risky sex by really increasing the rewarding value of sex."}, {"time": 6446, "text": "Like if you talk to people that are really, especially that are hooked on stimulants, one of the biggies is like sex on coke or meth is like so much better than sex without."}, {"time": 6455, "text": "And that's a big part of why they have trouble quitting because it's so tied to their sex life."}, {"time": 6461, "text": "So it's not that your decision making is broken, it's just that you, well, you allocate."}, {"time": 6466, "text": "It's a different aspect of their decision."}, {"time": 6468, "text": "Yeah, on the reward side."}, {"time": 6469, "text": "I think on the alcohol, it works more through disinhibition."}, {"time": 6472, "text": "It's like, alcohol is really good at reducing the ability of a delayed punisher to have an effect on current behavior."}, {"time": 6480, "text": "In other words, there's this bad thing that's gonna happen tomorrow or a week from now or 20 years from now."}, {"time": 6487, "text": "Being drunk is a really good way, and you see this in like rats making decisions."}, {"time": 6492, "text": "A high dose of alcohol makes someone less sensitive to those consequences."}, {"time": 6496, "text": "So I think that's the lever that's being hit with alcohol and it's the more, just the increasing the rewarding value of sex by the psycho stimulants on that side."}, {"time": 6506, "text": "We actually found that it, and it was amazing because like hundreds of millions of dollars have been spent by NIH to study the connection between cocaine and HIV."}, {"time": 6515, "text": "Like we ran the first study on my grant that like actually just gave people cocaine under double blind conditions and showed that like, yeah, when people are on coke, like their ratings of sexual desire, even though they're not in a sexual situation, yeah, you've shown them some pictures, but they're just saying they're horny."}, {"time": 6533, "text": "Like you get subjective ratings of like how much sexual desire are you feeling right now."}, {"time": 6537, "text": "People get horny when they're on stimulants."}, {"time": 6540, "text": "And a lot of people say, duh, if they really know these drugs."}, {"time": 6544, "text": "But that's a rigorous study that's in the lab that shows like there's a plot."}, {"time": 6549, "text": "Right, the dose effects of that, the time course of that."}, {"time": 6552, "text": "Yeah, it's not just."}, {"time": 6553, "text": "Can you please tell me there's a paper with a plot that shows dose versus evaluation of like horniness."}, {"time": 6561, "text": "Yeah, we didn't say horniness."}, {"time": 6562, "text": "We said sexual arousal, yeah, basically, yeah."}, {"time": 6564, "text": "There's a plot, I'm gonna find this plot."}, {"time": 6566, "text": "Right, I'll send it to you."}, {"time": 6567, "text": "There was one headline from some publicity on the work that said, horny cocaine users don't use condoms or something like that."}, {"time": 6578, "text": "You gotta love journalism."}, {"time": 6579, "text": "I wouldn't have put it that way, but like, yeah, that's right."}, {"time": 6581, "text": "I guess that's what it finds."}, {"time": 6583, "text": "So you've published a bunch of studies on psychedelics."}, {"time": 6587, "text": "Is there some especially favorite insightful findings from some of these that you could talk about?"}, {"time": 6595, "text": "So maybe favorite studies or just something that pops to mind in terms of both the goals and like the major insights gained and maybe the side little curiosities that you discovered along the way."}, {"time": 6609, "text": "Yeah, I think of the work with like using psilocybin to help people quit smoking."}, {"time": 6614, "text": "And we've talked about smoking being such a serious addiction and so that what inspired me to get into that was just kind of having like behavioral psychology as my primary lens, sort of this sort of like, you know, kind of radical empirical basis of, I'm really interested in the mystical experience and all of these reports, very interested."}, {"time": 6644, "text": "And, but at the same time, I'm like, okay, let's get down to some behavior change and something that we can record, like quantitatively verify biologically."}, {"time": 6655, "text": "So find all kinds of negative behaviors that people practice and see if we can turn those into positive or change their behavior."}, {"time": 6662, "text": "Right, like really change it, not just people saying, which again is interesting, I'm not dismissing it, but folks that say my life has turned around, I feel this has completely changed me."}, {"time": 6671, "text": "It's like, yep, that's good."}, {"time": 6673, "text": "All right, let's see if we can harness that and test that."}, {"time": 6676, "text": "And just something that's real behavior change."}, {"time": 6681, "text": "It's quantifiable."}, {"time": 6682, "text": "It's like, okay, you've been smoking for 30 years, you know, like that's a real thing."}, {"time": 6686, "text": "And you've tried a dozen times, like seriously to quit and you haven't been able to long term, like, okay."}, {"time": 6692, "text": "And if you quit, like we'll ask you and I'll believe you, but I don't trust everyone reading the paper to believe you."}, {"time": 6698, "text": "So we're gonna have you pee in a cup and we'll test that."}, {"time": 6700, "text": "And we'll have you blow into this little machine that measures carbon monoxide and we'll test that."}, {"time": 6704, "text": "So multiple levels of biological verification."}, {"time": 6708, "text": "Like now we're getting like, to me that's where the rubber meets the road in terms of like therapeutics."}, {"time": 6713, "text": "It's like, can we really shift behavior?"}, {"time": 6715, "text": "And since, and so much as we've talked about my other scientific work outside of psychedelics is about understanding addiction and drug use."}, {"time": 6722, "text": "So it's like, you know, looking at addiction, it's a no brainer and smoking is just a great example."}, {"time": 6727, "text": "And so back to your question, like we've had really high success rates."}, {"time": 6731, "text": "I mean, it really, it rivals anything that's been published in the scientific literature."}, {"time": 6736, "text": "The caveat is that, you know, that's based on our initial trial of only 15 people, but extremely high longterm success rates, 80% at six months per smoke free."}, {"time": 6747, "text": "So can we discuss the details of this?"}, {"time": 6749, "text": "So first of all, which psychedelic are we talking about?"}, {"time": 6751, "text": "And maybe can you talk about the 15 people and how the study ran and what you found?"}, {"time": 6758, "text": "So the drug we're using is psilocybin and we're using moderately high and high doses of psilocybin."}, {"time": 6765, "text": "And I should say this about most of our work, these are not kind of museum level doses."}, {"time": 6770, "text": "In other words, nothing, even big fans of psychedelics wanna take and go to a concert or go to the museum."}, {"time": 6777, "text": "If someone's at Burning Man on this type of dose, like they're probably gonna wanna find their way back to their tent and zip up and hunker down for, you know, not be around strangers."}, {"time": 6787, "text": "By the way, the delivery method, so psilocybin is mushrooms, I guess."}, {"time": 6796, "text": "What's the usual, is it edible?"}, {"time": 6799, "text": "Is there some other way?"}, {"time": 6800, "text": "Like, how is people supposed to think about the correct dosing of these things?"}, {"time": 6805, "text": "Cause I've heard that it's hard to dose correctly."}, {"time": 6810, "text": "So in our studies, we use the pure compound psilocybin."}, {"time": 6813, "text": "So it's a single molecule, you know, a bunch of molecules."}, {"time": 6816, "text": "And we give them a capsule with that in it."}, {"time": 6821, "text": "And so it's just, you know, a little capsule, they swallow."}, {"time": 6824, "text": "What people, when psilocybin is used outside of research, it's always in the context of mushrooms cause they're so easy to grow."}, {"time": 6834, "text": "There's no market for synthetic psilocybin."}, {"time": 6836, "text": "There's no reason for that to pop up."}, {"time": 6838, "text": "The high dose that we use in research is 30 milligrams, body weight adjusted."}, {"time": 6850, "text": "So if you're a heavier person, it might be like 40 or even 50 milligrams."}, {"time": 6856, "text": "We have some data that, based on that data, we're actually moving into like getting away from the body weight adjusting of the dose and just giving an absolute dose."}, {"time": 6863, "text": "It seems like there's no justification for the body weight based dosing, but I digress."}, {"time": 6869, "text": "Generally 30, 40 milligrams, it's a high dose."}, {"time": 6872, "text": "And based on average, even though, as you alluded to, there's variability, which gets people into some trouble in terms of mushrooms, like psilocybe cubensis, which is the most common species in the illicit market in the US."}, {"time": 6884, "text": "This is about equivalent to five dried grams, which is right at about where McKenna and others, they call it a heroic dose."}, {"time": 6895, "text": "This is not hanging out with your friends, going to the concert again."}, {"time": 6899, "text": "So this is a real deal dose, even to people that really, just even to psychonauts."}, {"time": 6905, "text": "And we've even had a number of studies."}, {"time": 6906, "text": "Psychonauts?"}, {"time": 6907, "text": "Yeah, people that, yeah, astronaut or cosmonaut, like for psychedelics."}, {"time": 6914, "text": "Yeah, going as far out as possible."}, {"time": 6916, "text": "But even for them, even for those who've flown to space before."}, {"time": 6921, "text": "Right, right, they're like, holy shit, I didn't know the orbit would be that far out."}, {"time": 6925, "text": "Or I escaped the orbit, I was in interplanetary space there."}, {"time": 6931, "text": "So these folks, the 15 folks in the study, there's not a question of dose being too low to truly have an impact."}, {"time": 6940, "text": "Right, right, out of hundreds of volunteers over the years, we've only seen a couple of people where there was a mild effect of the 30 milligrams."}, {"time": 6948, "text": "And who knows, that person's, their serotonins, they might have lesser density of serotonin 2A receptors or something, we don't know."}, {"time": 6956, "text": "But it's extremely rare."}, {"time": 6957, "text": "For most people, this is like something interesting is gonna happen, put it that way."}, {"time": 6961, "text": "Speaking of Joe Rogan, I think that Jamie, his producer, is immune to psychedelics."}, {"time": 6969, "text": "So maybe he's a good recruit for the study to test."}, {"time": 6973, "text": "Now I'm not, the caveat is I'm not encouraging anything illicit, but just theoretically, my first question as a behavioral pharmacologist is like, you know, increase the dose."}, {"time": 6983, "text": "You know, like really, let's see the full dose."}, {"time": 6986, "text": "I'm not telling him, Jamie, to do that, but like, okay, like, you know, you're taking the same amount that friends might be taking, but yeah."}, {"time": 6993, "text": "But he was also referring to the psychedelic effects of edible marijuana, which is, is there rules on dosage for like marijuana?"}, {"time": 7006, "text": "Is there limits?"}, {"time": 7007, "text": "Like what place where it's, this is, this all goes, it probably is state by state, right?"}, {"time": 7012, "text": "It is, but most, they've gone that direction in states that didn't initially have these rules have now have them."}, {"time": 7040, "text": "And it's like, unless you're a daily cannabis user, if you take, you know, a hundred milligrams, it's like, that's what could lead to a bad trip for someone."}, {"time": 7050, "text": "And it's like, you know, a lot of these people, it's like, oh, you used to smoke a little weed in college, they might say they're visiting Denver for a business trip and they're like, why not?"}, {"time": 7059, "text": "Let's give it a shot, you know?"}, {"time": 7060, "text": "And they're like, oh, I don't want to smoke something because it's going to, so I'm going to be safer with this edible, they might consume this massive, you know, but there's huge tolerance."}, {"time": 7068, "text": "So a regular, like for someone who's smoking weed every day, they might take five milligrams and kind of hardly feel anything."}, {"time": 7075, "text": "And they may really need something like 30, 40, 50 milligrams to have a strong effect."}, {"time": 7082, "text": "But yeah, so they've evolved in terms of the rules about like, okay, what constitutes a dose, you know?"}, {"time": 7091, "text": "Which is why you see less big candy bars and more, or if it is a whole candy bar, you're only getting a smaller dose like 10 milligrams or, yeah, because that's where people get in trouble more often with edibles."}, {"time": 7102, "text": "Yeah, except Joey Diaz, which I've heard."}, {"time": 7105, "text": "That's definitely somebody I want to talk to out of the crazy comedians I want to talk to as well."}, {"time": 7110, "text": "Anyway, so yeah, the study of the 15 and the dose not being a question."}, {"time": 7116, "text": "So like, what was the recruitment based on?"}, {"time": 7119, "text": "What was the, like, how did the study get conducted?"}, {"time": 7124, "text": "Yeah, so the recruitment, and I really liked this fact, it wasn't people that, you know, largely were, you know, we were honest about what we were studying, but for most people, it was, they were in the category of like, you know, not particularly interested in psychedelics, but more of like, they want to quit smoking."}, {"time": 7140, "text": "They've tried everything but the kitchen sink."}, {"time": 7143, "text": "And this sounds like the kitchen sink."}, {"time": 7145, "text": "You know, and it's like, well, it's Hopkins."}, {"time": 7148, "text": "So, you know, thinking that sounds like it's safe enough."}, {"time": 7151, "text": "So like, what the hell, let's give it a shot."}, {"time": 7153, "text": "Like most of them were in that category, which I really, you know, I appreciate because it's more of a test, you know, of, yeah, just like a better model of what, if these are approved as medicines, like what you're going to have the average participant, you know, be like."}, {"time": 7201, "text": "Oh, it could be scary in this sense, but here's how to handle it, trust, let go, be open."}, {"time": 7205, "text": "And also during that preparation time, preparing them to quit smoking, using really standard bread and butter techniques that can all fall under the label typically of the cognitive behavioral therapy, just stuff like before you quit, we assign a target quit date ahead of time, you're not just quitting on the fly."}, {"time": 7224, "text": "And that happens to be the target quit date in our study was the day where they got the first psilocybin dose, but doing things like keeping a smoking diary, like, okay, during the three weeks until you quit, every time you smoke a cigarette, just like jot down what you're doing, what you're feeling, what situation, that type of thing."}, {"time": 7239, "text": "And then having some discussion around that and then going over the pluses and minuses in their life that smoking kind of comes with and being honest about the, this is what it does for me, this is why I like it, this is why I don't like it."}, {"time": 7250, "text": "Preparing for like, what if you do slip, how to handle it, like don't dwell on guilt because that leads to more full on relapse, just kind of treat it as a learning experience, that type of thing."}, {"time": 7260, "text": "Then you have the session day where they come in, five minutes of questionnaires, but pretty much they jump into the, we touch base with them and we give them the capsule."}, {"time": 7273, "text": "It's a serious setting, but a comfortable one."}, {"time": 7277, "text": "They're in a room that looks more like a living room than like a research lab."}, {"time": 7281, "text": "We measure their blood pressure, their experience, but kind of minimal kind of medical vibe to it."}, {"time": 7285, "text": "And they lay down on a couch and it's a purposefully an introspective experience."}, {"time": 7292, "text": "So they're laying on a couch during most of the five to six hour experience and they're wearing eye shades, which is a better connotation as a name than blindfold."}, {"time": 7300, "text": "But like, yeah, so they're wearing eye shades, but that's, and they're wearing headphones through which music is played, mostly classical, although we've done some variation of that."}, {"time": 7310, "text": "I have a paper that was recently accepted kind of comparing it to more like gongs and harmonic bowls and that type of thing, kind of like sound, you know, kind of."}, {"time": 7320, "text": "You've also added this to the science and have a paper on the musical accompaniment to the psychedelic experience, that's fascinating."}, {"time": 7329, "text": "Right, and we found basically that about the same effect, even by a trend, not significant, but a little bit better of an effect, both in terms of subjective experience and longterm, whether it helped people quit smoking, just a little tiny non significant trend even favoring the novel playlist with the Tibetan singing bowls and the gongs and didgeridoo and all of that."}, {"time": 7350, "text": "And so anyway, just saying, okay, we can deviate a little bit from this, like what goes back to the 1950s of this method of using classical music as part of this psychedelic therapy, but they're listening to the music and they're not playing DJ in real time."}, {"time": 7364, "text": "You know, it's like, you know, they're just, be the baby, you're not the decision maker for today, go inward, trust, let go, be open."}, {"time": 7371, "text": "And pretty much the only interaction, like that we're there for is to deal with any anxiety that comes up."}, {"time": 7377, "text": "So guide is kind of a misnomer in a sense."}, {"time": 7380, "text": "It's, we're more of a safety net."}, {"time": 7382, "text": "And so like, tell us if you feel some butterflies that we can provide reassurance, a hold of their hand can be very powerful."}, {"time": 7389, "text": "I've had people tell me that that was like the thing that really just grounded them."}, {"time": 7392, "text": "Can you break apart trust, let go, be open?"}, {"time": 7397, "text": "What, so in a sense, how would you describe the experience, the intellectual and the emotional approach that people are supposed to take to really let go into the experience?"}, {"time": 7415, "text": "Yeah, so trust is, trust the context, you know, trust the guides, trust the overall institutional context."}, {"time": 7425, "text": "I see it as layers of like safety, even though it's everything I told you about the relative bodily safety of psilocybin."}, {"time": 7431, "text": "Nonetheless, we're still getting blood pressure throughout the session, just in case."}, {"time": 7434, "text": "We have a physician on hand who can respond just in case."}, {"time": 7437, "text": "We're literally across the street from the emergency department, just in case."}, {"time": 7441, "text": "You know, all of that, you know."}, {"time": 7442, "text": "Privacy is another thing you've talked about is just trusting that you're, and whatever happens is just between you and the people in the study."}, {"time": 7450, "text": "Right, and hopefully they've really gotten that by that point deep into the study that like they realize where do we take that seriously and everything else, you know."}, {"time": 7458, "text": "And so it's really kind of like a very special role that you're playing as a researcher or a guide and hopefully they have your trust."}, {"time": 7465, "text": "And so, you know, and trust that they could be as emotional, everything from laughter to tears, like that's gonna be welcomed."}, {"time": 7470, "text": "We're not judging them."}, {"time": 7471, "text": "It's like, it's a therapeutic relationship where, you know, this is a safe container."}, {"time": 7476, "text": "It's a safe space."}, {"time": 7477, "text": "It's a lot of baggage to that term, but it truly is, it's a safe space for that, for this type of experience and to let go."}, {"time": 7485, "text": "So trust, let's see, let go."}, {"time": 7488, "text": "So that relates to the emotional, like, you feel like crying, cry."}, {"time": 7492, "text": "You feel like laughing your ass off, laugh your ass off."}, {"time": 7495, "text": "You know, it's like all the things actually that sometimes it's more challenging with someone has a large recreational use, sometimes it's harder for them because people in that context, and understandably so, it's more about holding your shit."}, {"time": 7509, "text": "Someone's had a bunch of mushrooms at a party."}, {"time": 7512, "text": "Maybe they don't wanna go into the back room and start crying about these thoughts about the relationship with their mother."}, {"time": 7519, "text": "And they don't wanna be the drama queen or king that bring their friends down because their friends are having an experience too."}, {"time": 7526, "text": "And so they wanna like compose, you know."}, {"time": 7529, "text": "And also just the appearance in social settings versus the, so like prioritizing how you appear to others versus the prioritizing the depth of the experience."}, {"time": 7539, "text": "And here in the study, you can prioritize the experience."}, {"time": 7542, "text": "Right, and it's all about, like you're the astronaut and there's only one astronaut."}, {"time": 7546, "text": "We're ground control."}, {"time": 7548, "text": "And I use this often with, I have a photo of the space shuttle on a plaque in my office and I kind of often use that as an example."}, {"time": 7556, "text": "And it's like, we're here for you."}, {"time": 7558, "text": "Like we're a team, but we have different roles."}, {"time": 7560, "text": "It's just like, you don't have to like compose yourself."}, {"time": 7564, "text": "Like you don't have to like be concerned about our safety."}, {"time": 7567, "text": "Like we're playing these roles today."}, {"time": 7569, "text": "And like, yeah, your job is to go as deep as possible or as far out, whatever your analogy is, like as possible."}, {"time": 7576, "text": "And we're keeping you safe."}, {"time": 7578, "text": "And so, yeah, and the emotional side is a hard one because you really want people to, like if they go into realms of subjectively of despair and sorrow, like, yeah, like cry, it's okay."}, {"time": 7594, "text": "And especially if someone's more macho and you want this to be the place where they can let go."}, {"time": 7601, "text": "And again, something that they wouldn't or shouldn't do if someone were to theoretically use it in a social setting."}, {"time": 7609, "text": "And like, and also these other things, like even that you get in those social settings of like, yeah, you don't have to like worry about your wallet for being taken advantage or especially for a woman sexually assaulted by some creep at a concert or something."}, {"time": 7622, "text": "Cause they're, you know, they're laying down, being far out."}, {"time": 7626, "text": "There's like a million sources of anxiety that are external versus internal."}, {"time": 7631, "text": "So you can just focus on your own, like the beautiful thing that's going on in your mind."}, {"time": 7636, "text": "And even the cops at that layer, even though it's extremely unlikely for most people that cops would come in and bust them right when, like even at that theoretical, like that one in a billion chance, like that might be a real thing psychologically."}, {"time": 7649, "text": "In this context, we even got that covered."}, {"time": 7651, "text": "This is, we've got DEA approval."}, {"time": 7653, "text": "Like you are, this is okay by every level of society that counts, you know, that has the authority."}, {"time": 7659, "text": "So it's, so go deep, trust the, you know, trust the setting, trust yourself, you know, let go and be open."}, {"time": 7668, "text": "So in the experience, and this is all subjective and by analogy, but like, if there's a door, open it, go into it."}, {"time": 7674, "text": "If there's a stairwell, go down it or a stairway, go up it."}, {"time": 7679, "text": "If there's a monster in the mind's eye, you know, don't run, approach it, look in the eye and say, you know, let's talk."}, {"time": 7688, "text": "Yeah, what's up, what are you doing here?"}, {"time": 7690, "text": "Let's talk Turkey, you know?"}, {"time": 7692, "text": "And I thought."}, {"time": 7693, "text": "Dave Goggins entered the chat, okay."}, {"time": 7694, "text": "Right, right, it really is that, that really is a heart of it, this radical courage."}, {"time": 7699, "text": "Like it."}, {"time": 7700, "text": "People are often struck by that coming out."}, {"time": 7702, "text": "Like this is heavy lifting, this is a hard work."}, {"time": 7705, "text": "People come out of this exhausted and it can be extremely, some people say it's the most difficult thing they've done in their life."}, {"time": 7713, "text": "Like choosing to let go on a moment, a microsecond by microsecond basis."}, {"time": 7719, "text": "Everything in their inclination is to say stop, sometimes stop this, I don't like this, I didn't know it was gonna be like this, this is too much."}, {"time": 7728, "text": "And Terrence McKenna put it this way, it's like comparing to meditation and other techniques, it's like spending years trying to press the accelerator to make something happen."}, {"time": 7737, "text": "High dose psychedelics is like you're speeding down the mountain in a fully loaded semi truck and you're charged with not slamming the brake."}, {"time": 7746, "text": "It's like, let it happen."}, {"time": 7749, "text": "So it's very difficult and to engage, always go further into it and take that radical, radical courage throughout."}, {"time": 7759, "text": "What do they say in self report?"}, {"time": 7762, "text": "If you can put general words to it, what is their experience like?"}, {"time": 7766, "text": "What do they say it's like?"}, {"time": 7767, "text": "Because these are many people, like you said, that haven't probably read much about psychedelics or they don't have like with Joe Rogan, like language or stories to put on it."}, {"time": 7779, "text": "So this is very raw self report of experiences."}, {"time": 7783, "text": "What do they say the experience is like?"}, {"time": 7785, "text": "Yeah, and some more so than others, cause everyone has been exposed at some level or another, but some it is pretty superficial as you're saying."}, {"time": 7795, "text": "One of the hallmarks of psychedelics is just their variability."}, {"time": 7798, "text": "So I'm more stressed, it's like not the mean, but the standard deviation is so wide that it's like, it could be like hellish experiences and just absolutely beautiful and loving experiences, everything in between and both of those, like those could be two minutes apart from each other."}, {"time": 7820, "text": "And sometimes kind of at the same time concurrently."}, {"time": 7824, "text": "So let's see, there's different ways to, there were some Jungian psychologists back in the 60s, masters in Houston that wrote a really good book, The Varieties of Psychedelic Experience, which is a play on varieties of religious experience by William James, that they described this, a perceptual level."}, {"time": 7844, "text": "So most people have that when, whether they're looking at the room without the eyeshades on or inside their mind's eye with the eyeshades on, colors, sounds like this, it's a much richer sensorium, which can be very interesting."}, {"time": 7862, "text": "And then at another level, a master's in Houston called it the psychodynamic level."}, {"time": 7868, "text": "And I think you could think about it more broadly than, that's kind of Jungian, but just the personal psychological levels, how I think of it, like this is about your life."}, {"time": 7877, "text": "There's a whole life review."}, {"time": 7877, "text": "Oftentimes people have thoughts about their childhood, about their relationships, their spouse or partner, their children, their parents, their family of origin, their current family, that stuff comes up a lot, including people just pouring with tears about how much, it hits them so hard how much they love people."}, {"time": 7901, "text": "Like in a way, for people that they'd love their family, but it just hits them so hard that how important this is and the magnitude of that love and what that means in their life."}, {"time": 7914, "text": "So those are some of the most moving experiences to be present for is where people like it hits home, like what really matters in their life."}, {"time": 7922, "text": "And then you have this sort of what masters in Houston called the archetypal realm, which again is sort of Jungian with the focus on archetypes, which is interesting, but I think of that more generally as like symbolic level."}, {"time": 7935, "text": "So just really deep experiences where you have, you do have experiences that seem symbolic of, very much in like what we know about dreaming and what most people think about dreaming, like there's this randomness of things, but sometimes it's pretty clear in retrospect, oh, like this came up because this thing has been on my mind recently."}, {"time": 7956, "text": "So it seems to be, there seems to be this symbolic level."}, {"time": 7960, "text": "And then they have this, the last level that they describe is the mystical integral level, which this is where there's lots of terms for it, but transcendental experiences, experiences of unity, mystical type effects we often measure."}, {"time": 7976, "text": "Europeans use a scale that will refer to oceanic boundlessness."}, {"time": 7980, "text": "This is all pretty much the same thing."}, {"time": 7982, "text": "This is like at some sense, the deepest level of the very sense of self seems to be dissolved, minimize, or expanded, such that the boundaries of the self go into in here."}, {"time": 7996, "text": "I think some of this is just semantics, but whether the self is expanding such that there's no boundary between the self and the rest of the universe, or whether there's no sense of self, again, might be just semantics, but this radical shift or sense of loss of sense of self or self boundaries."}, {"time": 8013, "text": "And that's like the most, typically when people have that experience, they'll often report that as being the most remarkable thing."}, {"time": 8020, "text": "And this is what you don't typically get with MDMA, these deepest levels of the nature of reality itself, the subjectivity and objectivity, just like the seer and the seen become one, and it's a process, and yeah."}, {"time": 8038, "text": "And they're able to bring that experience back and be able to describe it?"}, {"time": 8046, "text": "Yeah, but one of the, to a degree, but one of the hallmarks going back to William James of describing a mystical experience is the ineffability."}, {"time": 8055, "text": "And so even though it's ineffable, people try as far as they can to describe it, but when you get the real deal, they'll say, and even though they say a lot of helpful things to help you describe the landscape, they'll say, no matter what I say, I'm still not even coming anywhere close to what this was."}, {"time": 8071, "text": "Like the language is completely failing."}, {"time": 8074, "text": "And I like to joke that even though it's ineffable, and we're researchers, so we try to eff it up by asking them to describe the experience."}, {"time": 8081, "text": "I love it, it's a good one."}, {"time": 8084, "text": "But to bring it back a little bit, so for that particular study on tobacco, what was the results, what was the conclusions in terms of the impact of psilocybin on their addiction?"}, {"time": 8099, "text": "So in that pilot study, it was very small and it wasn't a randomized study, so it was limited."}, {"time": 8104, "text": "The only question we could really answer was, is this worthy enough of followup?"}, {"time": 8108, "text": "And the answer to that was absolutely, because the success rates were so high, 80% biologically confirmed successful at six months, that held up to 60% biologically confirmed abstinent at an average of two and a half years, a very long fall."}, {"time": 8122, "text": "Yeah, and so, I mean, the best that's been reported in the literature for smoking cessation is in the upper 50%, and that's with not one, but two medications for a couple of months, followed by regular cognitive behavioral therapy, where you're coming in once a week or once every few weeks for an entire year."}, {"time": 8141, "text": "And so it was very heavy."}, {"time": 8144, "text": "This is just like a few uses of psilocybin?"}, {"time": 8148, "text": "So this was three doses of psilocybin over a total course, including preparation, everything, a 15 week period, where there's mainly like, for most part, one meeting a week, and then the three sessions are within that."}, {"time": 8160, "text": "And so it's, and we scaled that back in the more, the study we're doing right now, which I can tell you about, which is a randomized controlled trial."}, {"time": 8169, "text": "But it's, yeah, the original pilot study was these 15 people."}, {"time": 8180, "text": "So given the positive signal from the first study telling us that it was a worthy pursuit, we hustled up some money to actually be able to afford a larger trial."}, {"time": 8188, "text": "So it's randomizing 80 people to get either one psilocybin session, we've scaled that down from three to one, mainly because we're doing fMRI neuroimaging before and after, and it made it more experimentally complex to have multiple sessions."}, {"time": 8205, "text": "But one psilocybin session versus the nicotine patch using the FDA approved label, like standard use of the nicotine patch."}, {"time": 8213, "text": "So it's randomized, 40 people get randomized to psilocybin, one session, 40 people get nicotine patch."}, {"time": 8220, "text": "And they all get the same cognitive behavioral therapy sort of the standard talk therapy."}, {"time": 8223, "text": "And we've scaled it down somewhat, so there's less weekly meetings, but it's within the same ballpark."}, {"time": 8229, "text": "And right now we're still, the study's still ongoing."}, {"time": 8236, "text": "And in fact, we just recently started recruiting again, we paused for COVID."}, {"time": 8239, "text": "Now we're starting back up with some protections like masks and whatnot."}, {"time": 8243, "text": "But right now for the 44 people who have gotten through the one year followup, and so that includes 22 from each of the two groups, the success rates are extremely high."}, {"time": 8256, "text": "For the psilocybin group, it's 59% have been biologically confirmed as smoke free at one year after their quit date."}, {"time": 8263, "text": "And that compares to 27% for the nicotine patch, which by the way is extremely good for the nicotine patch compared to previous research."}, {"time": 8273, "text": "So the results could change because it's ongoing, but we're mostly done and it's still looking extremely positive."}, {"time": 8281, "text": "So if anyone's interested, they have to be sort of be in commuting distance to the Baltimore area, but you know."}, {"time": 8286, "text": "To participate."}, {"time": 8287, "text": "Right, right, to participate."}, {"time": 8289, "text": "This is a good moment to bring up something."}, {"time": 8293, "text": "I think a lot of what you talked about is super interesting."}, {"time": 8297, "text": "And I think a lot of people listening to this, so now it's anywhere from 300 to 600,000 people for just a regular podcast."}, {"time": 8307, "text": "I know a lot of them will be very interested in what you're saying and they're going to look you up."}, {"time": 8312, "text": "They're going to find your email and they're going to write you a long email about some of the interesting things they've found in any of your papers."}, {"time": 8323, "text": "How should people contact you?"}, {"time": 8325, "text": "What is the best way for that?"}, {"time": 8327, "text": "Would you recommend?"}, {"time": 8329, "text": "You're a super busy guy."}, {"time": 8330, "text": "You have a million things going on."}, {"time": 8334, "text": "How should people communicate with you?"}, {"time": 8336, "text": "Thanks for bringing this up."}, {"time": 8337, "text": "This is a, I'm glad to get the opportunity to address this."}, {"time": 8341, "text": "If someone's interested in participating in a study, the best thing to do is go to the website."}, {"time": 8348, "text": "Of the study or of like, yeah, which website?"}, {"time": 8353, "text": "So we have all of our psilocybin studies."}, {"time": 8355, "text": "So everything we have is up on one website and then we link to the different study websites, but hopkinspsychedelic.org."}, {"time": 8364, "text": "So everything we do, or if you don't remember that, just go to your favorite search engine and look up Johns Hopkins Psychedelic and you're going to find one of the first hits is going to be our, is this website."}, {"time": 8375, "text": "And there's going to be links to the smoking study and all of our other studies."}, {"time": 8379, "text": "If there's no link to it there, we don't have a study on it now."}, {"time": 8382, "text": "And if you're interested in psychedelic research more broadly, you can look up, like at another university that might be closer to you."}, {"time": 8389, "text": "And there's a handful of them now across the country."}, {"time": 8392, "text": "And there's some in Europe that have studies going on, but you can, at least in the US, you can look at clinicaltrials.gov and look up the term psilocybin."}, {"time": 8402, "text": "And in fact, optionally people even in Europe can register their trial on there."}, {"time": 8406, "text": "So that's a good way to find studies."}, {"time": 8407, "text": "But for our research, rather than emailing me, like a more efficient way is to go straight and you can do that first, the first phase of screening."}, {"time": 8417, "text": "There's some questions online and then someone will get back in touch with you."}, {"time": 8421, "text": "But I do already, you know, and I expect it's like going to increase, but I'm already at the level where my simple limited mind and limited capacity is already, I sometimes fail to get back to emails."}, {"time": 8437, "text": "I mean, I'm trying to respond to my colleagues, my mentees, all these things, my responsibilities."}, {"time": 8443, "text": "And as many of the people just inquiring about I wanna go to graduate school, I'm interested in this, I had this, I have a daughter that took a psychedelic and she's having trouble."}, {"time": 8451, "text": "And it's like, I try to respond to those, but sometimes I just simply can't get to all of it already."}, {"time": 8458, "text": "To be honest, like from my perspective, it's been quite heartbreaking because I basically don't respond to any emails anymore."}, {"time": 8467, "text": "And especially as you mentioned mentees and so on, like outside of that circle, it's heartbreaking to me how many brilliant people there are, thoughtful people, like loving people."}, {"time": 8479, "text": "And they write long emails that are really, by the way, I do read them very often."}, {"time": 8486, "text": "It's just that I don't, the response is then you're starting a conversation."}, {"time": 8491, "text": "And the heartbreaking aspect is you only have so many hours in the day to have deep, meaningful conversations with human beings on this earth."}, {"time": 8500, "text": "And so you have to select who they are."}, {"time": 8502, "text": "And usually it's your family, it's people like you're directly working with."}, {"time": 8506, "text": "And even I guarantee you with this conversation, people will write you long, really thoughtful emails."}, {"time": 8514, "text": "Like there'll be brilliant people, faculty from all over, PhD students from all over."}, {"time": 8519, "text": "And it's heartbreaking because you can't really get back to them."}, {"time": 8521, "text": "But you're saying like many of them, if you do respond, it's more like here, go to this website when you're interested into the study, just it makes sense to directly go to the site if there's applications open, just apply for the study."}, {"time": 8536, "text": "Right, right, right, as either a volunteer or if we're looking for somebody, we're gonna be posting, including on the Hopkins University website, we're gonna be posting if we're looking for a position."}, {"time": 8550, "text": "I am right now actually looking through and it's mainly been through email and contacts, but should I say it?"}, {"time": 8557, "text": "I think I'd rather cast my nets wide, but I'm looking for a postdoc right now."}, {"time": 8561, "text": "So I've mentored postdocs for, I don't know, like a dozen years or so."}, {"time": 8566, "text": "And more and more of their time is being spent on psychedelics."}, {"time": 8570, "text": "So someone's free to contact me."}, {"time": 8572, "text": "That's more of a, that's sort of so close to home."}, {"time": 8574, "text": "That's a personal, you know, that like emailing me about that."}, {"time": 8578, "text": "But I come to appreciate more the advice that folks like Tim Ferriss have of like, I think it's him, like five cents emails, you know, like a subject that gets to the point that tells you what it's about so that like you break through the signal to the noise."}, {"time": 8594, "text": "But I really appreciate what you're saying because part of the equation for me is like, I have a three year old, and like my time on the ground, on the floor, playing blocks or cars with him is part of that equation."}, {"time": 8605, "text": "And even if the day is ending and I know some of those emails are slipping by and I'll never get back to them."}, {"time": 8610, "text": "And I have, I'm struggling with it already."}, {"time": 8612, "text": "And I get what you're saying is like, I haven't seen anything yet if with the type of exposure that like your podcast gets."}, {"time": 8619, "text": "This will bring in exposure."}, {"time": 8620, "text": "And then I think in terms of postdocs, this is a really good podcast in the sense that there's a lot of brilliant PhD students out there that are looking for a poster from all over, from MIT, probably from Hopkins, it's just all over the place."}, {"time": 8633, "text": "So this is, and I, we have different preferences, but my preference would also be to have like a form that they could fill out for posts."}, {"time": 8641, "text": "Because, you know, it's very difficult through email to tell who's really going to be a strong collaborator for you, like a strong postdoc, strong student, because you want a bunch of details, but at the same time, you don't want a million pages worth of email."}, {"time": 8659, "text": "So you want a little bit of application process."}, {"time": 8661, "text": "So usually you set up a form that helps me indicate how passionate the person is, how willing they are to do hard work."}, {"time": 8673, "text": "Like I often ask a question, people of what do you think is more important to work hard or to work smart?"}, {"time": 8681, "text": "And I use that, those types of questions to indicate who I would like to work with."}, {"time": 8689, "text": "Because it's counterintuitive."}, {"time": 8691, "text": "But anyway, I'll leave that question unanswered for people to figure out themselves."}, {"time": 8697, "text": "But maybe if you know my love for David Goggins, you will understand."}, {"time": 8702, "text": "Those are good thoughts about the forms and everything."}, {"time": 8705, "text": "And that's something that evolves."}, {"time": 8707, "text": "Email is such a messy thing."}, {"time": 8709, "text": "There's, speaking of Baltimore, Cal Newport, if you know who that is, he wrote a book called Deep Work."}, {"time": 8719, "text": "He's a computer science professor and he's currently working on a book about email, about all the ways that email is broken."}, {"time": 8725, "text": "So this is gonna be a fascinating read."}, {"time": 8728, "text": "This is a little bit of a general question, but almost a bigger picture question that we touched on a little bit, but let's just touch it in a full way, which is what have all the psychedelic studies you've conducted taught you about the human mind, about the human brain and the human mind?"}, {"time": 8752, "text": "Is there something, if you look at the human scientists you were before this work and the scientists you are now, how has your understanding of the human mind changed?"}, {"time": 8763, "text": "I'm thinking of that in two categories."}, {"time": 8768, "text": "One kind of more scientific, and they're both scientific, but one more about the brain and behavior and the mind, so to speak."}, {"time": 8782, "text": "And as a behaviorist, all we see sort of the mind as a metaphor for behaviors, but anyway, that gets philosophical."}, {"time": 8790, "text": "But it's really increasing the, so the one category is increasing the appreciation for the magnitude of depth."}, {"time": 8803, "text": "I mean, so these are all metaphors of human experience."}, {"time": 8807, "text": "That might be a good way to, because you use certain words like consciousness and it's like we're using constructs that aren't well defined unless we kind of dig in, but human experience like that, the experiences on these compounds can be so far out there or so deep."}, {"time": 8828, "text": "And they're doing that by tinkering with the same machinery that's going on up there."}, {"time": 8833, "text": "I mean, my assumption, and I think it's a good assumption is that all experiences, there's a biological side to all phenomenal experience."}, {"time": 8845, "text": "So there is not, the divide between biology and experience or psychology is, it's not one or the other."}, {"time": 8858, "text": "These are just two sides of the same coin."}, {"time": 8863, "text": "I mean, you're avoiding the use of the word consciousness, for example, but the experience is referring to the subjective experience."}, {"time": 8870, "text": "So it's the actual technical use of the word consciousness of subjective experience."}, {"time": 8905, "text": "And that's why it's hard because like it's hard to imagine anything."}, {"time": 8909, "text": "But I think what I was getting is that psychedelics have done this by, the reason I was getting into the biology versus mind, psychology divide is that just to kind of set up the fact that I think all of our experience is related to these biological events."}, {"time": 8953, "text": "Okay, so that's always another side of the coin."}, {"time": 8955, "text": "So another way to put that is all of our subjective experience outside of drugs, it's all a controlled hallucination in a sense."}, {"time": 8967, "text": "Like this is completely constructed."}, {"time": 8968, "text": "Our experience of reality is completely a simulation."}, {"time": 8973, "text": "So I think we're on solid ground to say that that's our best guess and that's a pretty reasonable thing to say scientifically."}, {"time": 8981, "text": "Like all the rich complexity of the world emerges from just some biology and some chemicals."}, {"time": 8986, "text": "So in that definition implied a causation, it comes from."}, {"time": 8989, "text": "And so we know at least there's a solid correlation there."}, {"time": 8993, "text": "And so then we delve deep into the philosophy of like idealism or materialism and things like this, which I'm not an expert in, but I know we're getting into that territory."}, {"time": 9003, "text": "You don't even necessarily have to go there."}, {"time": 9006, "text": "Like you at least go to the level of like, okay, we know there seems to be this one on one correspondence and that seems pretty solid."}, {"time": 9014, "text": "Like you can't prove a negative and you can't prove, you know, it's in that category of like, you could come up with an experience that maybe doesn't have a biological correlate, but then you're talking about, there's also the limits of the science."}, {"time": 9025, "text": "Is it a false negative?"}, {"time": 9026, "text": "But I think our best guess and a very decent assumption is that every psychological event has a biological correlate."}, {"time": 9033, "text": "So with that said, you know, the idea that you can throw, alter that biology in a pretty trivial manner."}, {"time": 9077, "text": "Like that's the thing about psychedelics that just floors me and it never fails."}, {"time": 9114, "text": "Whether it's like therapeutically or just to understand the mind and you're like, and you're still floored, like how is that possible?"}, {"time": 9125, "text": "How did we slightly alter serotonergic neurotransmission and say, and this person is now saying that they're making fundamental differences in the priorities of their life after 60 years."}, {"time": 9139, "text": "It also just fills you with awe of the possibility of experiences we're yet to have uncovered."}, {"time": 9148, "text": "If just a few chemicals can change so much, it's like, man, what if this could be up?"}, {"time": 9156, "text": "I mean, like how, cause we're just like took a little, it's like lighting a match or something in the darkness and you could see there's a lot more there, but you don't know how much more."}, {"time": 9167, "text": "And that's."}, {"time": 9169, "text": "And then like, where's that gonna go with like, I mean, I'm always like aware of the fact that like we always as humans and as scientists think that we figured out 99% and we're working on that first 1%."}, {"time": 9179, "text": "And we gotta keep reminding ourselves, it's hard to do."}, {"time": 9181, "text": "Like we figured out like not even 1%, like we know nothing."}, {"time": 9233, "text": "And it becomes easy to combine within virtual reality where the virtual reality is gonna move from being something out here to being more in there."}, {"time": 9241, "text": "And then we're getting, like we talked about before, we're already in a virtual reality in terms of human perception and cognition models of the universe being all representations and sort of color not existing and just our representations of EM wavelengths, et cetera, sound, being vibrations and all of this."}, {"time": 9263, "text": "And so as the external VR and the internal VR come closer to each other, like this is what I think about in terms of the future of drugs."}, {"time": 9273, "text": "Like all of this stuff sort of combines and like where that goes is just, it's unthinkable."}, {"time": 9282, "text": "Like we were probably gonna, you know, again, I might sound like a fool and this may not happen, but I think it's possible, you know, to go completely offline, like where most of people's experiences maybe going into these internal worlds."}, {"time": 9298, "text": "And I mean, maybe you through some, through a combination of these techniques, you create experiences where someone could live a thousand years in terms of maybe they're living a regular lifespan, but in over the next two seconds, you're living a thousand years worth of experience."}, {"time": 9313, "text": "Inside your mind."}, {"time": 9315, "text": "Yeah, through this manipulation of them."}, {"time": 9316, "text": "Like, is that possible?"}, {"time": 9319, "text": "Like just based on like first principles and like."}, {"time": 9323, "text": "Yeah, first principles, yes."}, {"time": 9326, "text": "Like give us another 50, 100, 500, like who knows, but like how could it not go there?"}, {"time": 9333, "text": "In a small tangent, what are your thoughts in this broader definition of drugs, of psychedelics, of mind altering things?"}, {"time": 9342, "text": "What are your thoughts about Neuralink and brain computer interfaces, sort of being able to electrically stimulate and read neuronal activity in the brain and then connect that to the computer, which is another way from a computational perspective for me is kind of appealing, but it's another way of altering subtly the behavior of the brain."}, {"time": 9373, "text": "That's kind of, if you zoom out, reminiscent of the way psychedelics do as well."}, {"time": 9380, "text": "So what do you have?"}, {"time": 9382, "text": "Like what are your thoughts about Neuralink?"}, {"time": 9385, "text": "What are your hopes as a researcher of mind altering devices, systems, chemicals?"}, {"time": 9393, "text": "I guess broadly speaking, I'm all for it."}, {"time": 9396, "text": "I mean, for the same reason I am with psychedelics, but it comes with all the caveats."}, {"time": 9400, "text": "You know, you're going into a brave new world where it's like all of a sudden there's going to be a dark side."}, {"time": 9406, "text": "There's going to be serious ethical considerations, but that should not stop us from moving there."}, {"time": 9414, "text": "I mean, particularly the stuff from, and I'm no expert, but on the short list in the short term, it's like, yeah, can we help these serious neurological disorders?"}, {"time": 9422, "text": "Like, hell yeah."}, {"time": 9455, "text": "I forget what the example was, but something like, something that came off to some of my neuroscientific colleagues as an oversimplification, or at least the way they said it."}, {"time": 9464, "text": "Oh, from a Neuralink perspective."}, {"time": 9510, "text": "So I'm extremely sympathetic, and I'm a big fan of like what that, you know, what Elon Musk does, like tunnels through the ground, and SpaceX, and all this, just like, hell yeah, like this guy has some, he has some great ideas."}, {"time": 9523, "text": "And there's something to be said, it's not just the communication to the public."}, {"time": 9527, "text": "I think his first principles thinking, it's like, because I get this in the artificial intelligence world, it's probably similar to neuroscience world, where Elon will say something like, or I worked at MIT, I worked on autonomous vehicles."}, {"time": 9540, "text": "And he's sort of, I could sense how much he pisses off like every roboticist at MIT, and everybody who works on like the human factor side of safety of autonomous vehicles, and saying like, nah, we don't need to consider human beings in the car, like the car will drive itself, it's obvious that neural networks is all you need."}, {"time": 9562, "text": "Like it's obvious that like we should be able to systems that should be able to learn constantly."}, {"time": 9570, "text": "And they don't really need LIDAR, they just need cameras, because we humans just use our eyes, and that's the same as cameras."}, {"time": 9578, "text": "So like it doesn't, why would we need anything else?"}, {"time": 9581, "text": "You just have to make a system that learns faster, and faster, and faster, and neural networks can do that."}, {"time": 9586, "text": "And so that's pissing off every single community."}, {"time": 9588, "text": "It's pissing off human factors community, saying you don't need to consider the human driver in the picture, you can just focus on the robotics problem."}, {"time": 9596, "text": "It's pissing off every robotics person for saying LIDAR can be just ignored, it can be camera."}, {"time": 9602, "text": "Every robotics person knows that camera is really noisy, that it's really difficult to deal with."}, {"time": 9608, "text": "But he's, and then every AI person who says, who hears neural networks, and says like, neural networks can learn everything, like almost presuming that it's kind of going to achieve general intelligence."}, {"time": 9622, "text": "The problem with all those haters in the three communities is that they're looking one year ahead, five years ahead."}, {"time": 9631, "text": "The hilarious thing about the, quote unquote, ridiculous things that Elon Musk is saying, is they have a pretty good shot at being true in 20 years."}, {"time": 9640, "text": "And so like, when you just look at the, you know, when you look at the progression of these kinds of predictions, and sometimes first principles thinking can allow you to do that, is you see that it's kind of obvious that things are going to progress this way."}, {"time": 9658, "text": "And if you just remove the prejudice you hold about the particular battles of the current academic environment, and just look at the big picture, the progression of the technology, you can usually see the world in the same kind of way."}, {"time": 9675, "text": "And so in that same way, looking at psychedelics, you can see like, there is so many exciting possibilities here if we fully engage in the research."}, {"time": 9684, "text": "Same thing with Neuralink."}, {"time": 9686, "text": "If we fully engage, so we go from a thousand channels of communication to the brain, to billions of channels of communication to the brain, and we figure out many of the details of how to do that safely with neurosurgery and so on, that the world would just change completely in the same kind of way that Elon is."}, {"time": 9707, "text": "It's so ridiculous to hear him talk about a symbiotic relationship between AI and the human brain."}, {"time": 9715, "text": "But it's like, is it though?"}, {"time": 9721, "text": "Because I can see in 50 years, that's going to be an obvious, like everyone will have, like obviously you have, like why are we typing stuff in the computer?"}, {"time": 9731, "text": "It doesn't make any sense."}, {"time": 9733, "text": "People used to type on a keyboard with a mouse?"}, {"time": 9737, "text": "And it seems pretty clear, like we're going to be there."}, {"time": 9739, "text": "Like, and the only question is like, what's the timeframe?"}, {"time": 9741, "text": "Is that going to be 20 or is it 50 or a hundred?"}, {"time": 9743, "text": "Like, how could we not?"}, {"time": 9745, "text": "And the thing that I guess upsets with Elon and others is the timeline he tends to do."}, {"time": 9751, "text": "I think a lot of people tend to do that kind of thing."}, {"time": 9753, "text": "I definitely do it, which is like, it'll be done this year versus like, it'll be done in 10 years."}, {"time": 9759, "text": "The timeline is a little bit too rushed, but from our leadership perspective, it inspires the engineers to do the best work of their life to really kind of believe, because to do the impossible, you have to first believe it, which is a really important aspect of innovation."}, {"time": 9775, "text": "And there's the delay discounting aspect I talked about before."}, {"time": 9778, "text": "It's like saying, oh, this is going to be a thing 20, 50 years from now."}, {"time": 9781, "text": "It's like, what motivates anybody?"}, {"time": 9784, "text": "And even if you're fudging it or like wishful thinking a little bit, or let's just say airing on one side of the probability distribution, like there's value in saying like, yeah, like there's a chance we could get this done in a year."}, {"time": 9798, "text": "And if you set a goal for a year and you're not successful, hey, you might get it done in three years."}, {"time": 9803, "text": "Whereas if you had aimed at 20 years, well, you either would have never done it at all, or you would have aimed at 20 years and then it would have taken you 10."}, {"time": 9809, "text": "So the other thing I think about this, like in terms of his work and I guess we've seen with psychedelics, it's like there's a lack of appreciation for like sort of the variability you need a natural selection, sort of extrapolating from biological, from evolution like, hey, maybe he's wrong about focusing only on the cameras and not these other things."}, {"time": 9832, "text": "Be empirically driven."}, {"time": 9833, "text": "It's like, yeah, you need to like when he's, when you need to get the regulation, is it safe enough to get this thing on the road?"}, {"time": 9839, "text": "Those are real questions and be empirically driven."}, {"time": 9841, "text": "And if he can meet the whatever standard is relevant, that's the standard and be driven by that."}, {"time": 9846, "text": "So don't let it affect your ethics."}, {"time": 9847, "text": "But if he's on the wrong path, how wonderful someone's exploring that wrong path."}, {"time": 9852, "text": "He's gonna figure out it's a wrong path."}, {"time": 9853, "text": "And like other people, he's, damn it, he's doing something."}, {"time": 9857, "text": "Like he's, and appreciating that variability, that like it's valuable even if he's not on, I mean, this is all over the place in science."}, {"time": 9869, "text": "It's like a good theory."}, {"time": 9870, "text": "One standard definition is that it generates testable hypotheses."}, {"time": 9875, "text": "And like the ultimate model is never gonna be the same as reality."}, {"time": 9879, "text": "Some models are gonna work better than others."}, {"time": 9882, "text": "Newtonian physics got us a long ways, even if there was a better model like waiting."}, {"time": 9889, "text": "And some models weren't as good as, were never that successful, but just even like putting them out there and test it."}, {"time": 9896, "text": "We wouldn't know something is a bad model until someone puts it out anyway, so."}, {"time": 9900, "text": "Yeah, diversity of ideas is essential for progress, yeah."}, {"time": 9905, "text": "So we brought up consciousness a few times."}, {"time": 9907, "text": "There's several things I wanna kind of disentangle there."}, {"time": 9911, "text": "So one, you've recently wrote a paper titled Consciousness, Religion, and Gurus, Pitfalls of Psychedelic Medicine."}, {"time": 9919, "text": "So that's one side of it."}, {"time": 9920, "text": "You've kind of already mentioned that these terms can be a little bit misused or used in a variety of ways that they can be confusing."}, {"time": 9932, "text": "But in a specific way, as much as we can be specific about these things, about the actual heart problem of consciousness or understanding what is consciousness, this weird thing that it feels like, it feels like something to experience things."}, {"time": 9950, "text": "Have psychedelics given you some kind of insight on what is consciousness?"}, {"time": 9958, "text": "You've mentioned that it feels like psychedelics allows you to kind of dismantle your sense of self, like step outside of yourself."}, {"time": 9970, "text": "So that feels like somehow playing with this mechanism of consciousness."}, {"time": 9975, "text": "And if it is in fact playing with the mechanism of consciousness using just a few chemicals, it feels like we're very much in the neighborhood of being able to maybe understand the actual biological mechanisms of how consciousness can emerge from the brain."}, {"time": 9992, "text": "So yeah, there's a bunch there."}, {"time": 9994, "text": "I think my preface is that I certainly have opinions that I can say, here are my best speculations as just a person and an armchair philosopher."}, {"time": 10007, "text": "And that philosophy is certainly not my training and my expertise."}, {"time": 10012, "text": "So I have thoughts there, but that I recognize are completely in the realm of speculation that are like things that I would love to wrap empirical science around, but that there's no data and getting to the hard problem, like no conceivable way, even though I'm very open, like I'm hoping that that problem can be cracked."}, {"time": 10034, "text": "And as an armchair philosopher, I do think that is a problem."}, {"time": 10038, "text": "I don't think it can be dismissed as some people argue it's not even really a problem."}, {"time": 10042, "text": "It strikes me that explaining just the existence of phenomenal consciousness is a problem."}, {"time": 10047, "text": "So anyway, I very much keep that divide in mind when I talk about these things, what we can really say about what we've learned through science, including by psychedelics versus like what I can speculate on in terms of the nature of reality and consciousness."}, {"time": 10062, "text": "But in terms of, by and large, skeptically, I have to say psychedelics have not really taught us anything about the nature of consciousness."}, {"time": 10075, "text": "I'm hopeful that they will."}, {"time": 10077, "text": "They have been used around certain, I don't even know if features is the right term, but things that are called consciousness."}, {"time": 10084, "text": "So consciousness can refer to not only just phenomenal consciousness, which is like the source of the hard problem and what it is to be like Nagel's description, but the sense of self, which can be sort of like the experiential self moment to moment, or it can be like the narrative self, the stringing together of stories."}, {"time": 10105, "text": "So those are things that I think can be, and a little bit's been done with psychedelics regarding that, but I think there's far more potential."}, {"time": 10155, "text": "And so an interesting story emerged when it was found that when psilocybin is on board in the person's system, that there's less communication amongst these areas."}, {"time": 10169, "text": "So with resting state fMRI imaging, that there's less synchronization or presumably communication between these areas."}, {"time": 10178, "text": "And so I think it has been overstated in terms of, ah, we see this is like, this is the dissolving of the ego."}, {"time": 10186, "text": "The story made a whole lot of sense, but there's several, I think that story is really being challenged."}, {"time": 10193, "text": "Like one, we see increasing number of drugs that decouple that network, including ones like that aren't psychedelic."}, {"time": 10202, "text": "So this may just be a property, frankly, of being like, you know, screwed up, you know, like, you know, being out of your head, being like, like, you know."}, {"time": 10210, "text": "Anytime you mess with the perception system, maybe it screws up some, just our ability to just function in the holistically like we do in order, yeah, for the brain to perceive stuff, to be able to map it to memory, to connect things together, the whole recur mechanism that that could just be messed with."}, {"time": 10231, "text": "And it could, and I'm speculating, it could be tied to more if you had to download into the language, everyday language, like not feeling like yourself."}, {"time": 10237, "text": "Like, so whether that be like really drunk or really hopped up on amphetamine or, you know, like we found it like decoupling of the default mode network on salvinorin A, which is a smokable psychedelic, which is a non classic psychedelic, but another one where like DMT, where people are often talking to entities and that type of thing."}, {"time": 10255, "text": "That was a really fun study to run."}, {"time": 10257, "text": "But nonetheless, most people say it's not a classic psychedelic and doesn't have some of those phenomenal features that people report from classic psychedelics and not sort of the clear sort of ego loss type, at least not in the way that people report it with classic psychedelics."}, {"time": 10273, "text": "So you get it with all these different drugs."}, {"time": 10275, "text": "And so, and then you also see just broad, broad changes in network activity with other networks."}, {"time": 10281, "text": "And so I think that story took off a little too soon, although, so I think, and the story that the DMN, the default mode network relating to the self, and I know some neuroscientists, it drives them crazy if you say that it's the ego and that just like, but self referential processing, if you go that far, like that was already known before psychedelics."}, {"time": 10305, "text": "Psychedelics didn't really contribute to that."}, {"time": 10308, "text": "The idea that this type of brain network activity was related to a sense of self."}, {"time": 10316, "text": "But it is absolutely striking that psychedelics that people report with pretty high reliability, these unity experiences that where people subjectively, like they report losing or again, like the boundaries, however you wanna say it, like these unity experiences, I think we can do a lot with that in terms of figuring out the nature of the sense of self."}, {"time": 10339, "text": "Now, I don't think that's the same as the hard problem or the existence of phenomenal consciousness, because you can build an AI system, and you correct me if I'm wrong, that will pass a Turing test in terms of demonstrating the qualities of like a sense of self."}, {"time": 10357, "text": "It will talk as if there's a self and there's probably a certain like algorithm or whatever, like computational, like scaling up of computations that results in somehow, and I think this is the argument with humans, but some have speculated this, why do we have this illusion of the self that's evolved?"}, {"time": 10377, "text": "And we might find this with AI that like it works, having a sense of self, and that's stated incorrectly, like acting as if there is an agent at play and behaviorally acting like there is a self, that might kind of work."}, {"time": 10398, "text": "And so you can program a computer or a robot to basically demonstrate, have an algorithm like that and demonstrate that type of behavior."}, {"time": 10408, "text": "And I think that's completely silent on whether there's an actual experience inside there."}, {"time": 10413, "text": "I've been struggling to find the right words in how I feel about that whole thing, but because I've said it poorly before, I've before said that there's no difference between the appearance and the actual existence of consciousness or intelligence or any of that."}, {"time": 10431, "text": "What I really mean is the more the appearance starts to look like the thing, the more there's this area where it's like, I don't think, our whole idea of what is real and what is just an illusion is not the right way to think about it."}, {"time": 10456, "text": "So the whole idea is like, if you create a system that looks like it's having fun, the more it's realistically able to portray itself as having fun, like there's a certain gray area which the system is having fun."}, {"time": 10474, "text": "And same with intelligence, same with consciousness."}, {"time": 10476, "text": "And we humans wanna simplify, like it feels like the way we simplify the existence and the illusion of something is missing the whole truth of the nature of reality, which we're not yet able to understand."}, {"time": 10492, "text": "Like it's the 1%, we only understand 1% currently."}, {"time": 10495, "text": "So we don't have the right physics to talk about things, we don't have the right science to talk about things."}, {"time": 10500, "text": "But to me, like the faking it and actually it being true is the difference is much smaller than what humans would like to imagine."}, {"time": 10515, "text": "That's my intuition, but the philosophers hate that because, and guess what?"}, {"time": 10521, "text": "It's philosophers, what have you actually built?"}, {"time": 10523, "text": "So like to me is that's the difference in philosophy and engineering."}, {"time": 10528, "text": "It feels like if we push the creation, the engineering, like fake it until you make it all the way, which is like fake consciousness until you realize, holy crap, this thing is conscious."}, {"time": 10541, "text": "Fake intelligence until you realize, holy crap, this is intelligence."}, {"time": 10544, "text": "And from my curiosity with psychedelics and just neurobiology and neuroscience is like it feels, I love the armchair."}, {"time": 10555, "text": "I love sitting in that armchair because it feels like at a certain point you're going to think about this problem and there's going to be an aha moment."}, {"time": 10565, "text": "Like that's what the armchair does."}, {"time": 10566, "text": "Sometimes science prevents you from really thinking, wait, like it's really simple."}, {"time": 10574, "text": "There's something really simple."}, {"time": 10575, "text": "Like there's some, there could be some dance of chemicals that we're totally unaware of, not from aspects of like which chemicals to combine with which biological architectures, but more like we were thinking of it completely wrong that just out of the blue, like maybe the human mind is just like a radio that tunes into some other medium where consciousness actually exists."}, {"time": 10606, "text": "Like those weird sort of hypothetically, like maybe we're just thinking about the human mind totally wrong."}, {"time": 10613, "text": "Maybe there's no such thing as individual intelligence."}, {"time": 10616, "text": "Maybe it is all collective intelligence between humans."}, {"time": 10620, "text": "Like maybe the intelligence is possessed in the communication of language between minds."}, {"time": 10625, "text": "And then in fact, consciousness is a property of that language versus a property of the individual minds."}, {"time": 10633, "text": "And somehow the neurotransmitters will be able to connect to that."}, {"time": 10636, "text": "So then AI systems can join that common collective intelligence, that common language, like just thinking completely outside of the box."}, {"time": 10645, "text": "I just said a bunch of crazy things."}, {"time": 10646, "text": "I don't know, but thinking outside the box and there's something about subtle manipulation of the chemicals of the brain, which feels like the best or one of the great chances of the scientific process leading us to an actual understanding of the hard problem."}, {"time": 10666, "text": "So I am very hopeful that, and so I mean, I'm a radical empiricist, which I'm very strong with that."}, {"time": 10674, "text": "Like that's what, you know, so, you know, science isn't about ultimately being a materialist."}, {"time": 10679, "text": "It's like, it's about being an empiricist in my view."}, {"time": 10682, "text": "And so, for example, I'm very fascinated by the so called Psi phenomenon, you know, like stuff that people just kind of reject out of hand."}, {"time": 10690, "text": "You know, I kind of orient towards that stuff with an idea of, you know, hey, look, you know, what we consider, like anything exists as natural."}, {"time": 10699, "text": "And so, but the boundary of what we observe in nature, like what we recognize as in nature moves, like what we do today and what we know today would only be described as magic 500 years ago, or even a hundred years ago, some of it."}, {"time": 10733, "text": "And what you're saying about the moving together of the model and the real thing of conscious, like, I'm very sympathetic to that."}, {"time": 10740, "text": "So that's that part of like, on the armchair side, where I want to be clear, I can't say this as a scientist, but just in terms of speculating, I find myself attracted to these, more of the sort of the panpsychism ideas."}, {"time": 10755, "text": "And that kind of makes sense to me."}, {"time": 10757, "text": "I don't know if that's what you meant there, but it seemed like related, the sense that ultimately if you were completely modeling, like it's like, if you completely modeling, unless you dismiss like the idea that there is a phenomenal consciousness, which I think is hard, given that we all, I seem like I have one, that's really all I know."}, {"time": 10777, "text": "But if that's so compelling, I can't just dismiss that."}, {"time": 10781, "text": "Like if you take that as a given, then the only way for the model and the real thing to merge is if there is something baked into the nature of reality, sort of like in the history of like, there are certain just like fundamental forces or fundamental, like, and that's been useful for us."}, {"time": 10803, "text": "And sometimes we find out that that's pointing towards something else, or sometimes it's still, seems like it's a fundamental, and sometimes it's a placeholder for someone to figure out, but there's something like, this is just a given."}, {"time": 10813, "text": "This is just, and sometimes something like gravity seems like a very good placeholder, and then there's something better that comes to replace it."}, {"time": 10820, "text": "So, I kind of think about like consciousness and I didn't, I kind of had this inclination before I knew there was a term for it, Rosalian monism, the idea that, which is a form of, again, I'm an armchair philosopher, not a very good one."}, {"time": 10835, "text": "Broadly panpsychism, by the way, is the idea that sort of consciousness permeates all matter and, or it's a fundamental part of physics of the universe kind of thing."}, {"time": 10845, "text": "So, and there's a lot of different flavors of it as you're alluding to."}, {"time": 10851, "text": "And something that struck me as like consistent with some just, you know, inclinations of mine, just total speculation is this idea of everything we know in science and with most of the stuff we think of physics, you know, really describes, it's all interactions."}, {"time": 10871, "text": "It's not the thing itself."}, {"time": 10920, "text": "This is what it is like to exist as a particle."}, {"time": 10926, "text": "And maybe it's not even particles."}, {"time": 10927, "text": "Maybe it's like space time itself."}, {"time": 10929, "text": "I mean, again, totally in the speculation area."}, {"time": 10931, "text": "And something else based on, so it's funny because we don't have this, neither the science nor the proper language to talk about it."}, {"time": 10938, "text": "All we have is kind of a little intuitions about there might be something in that direction of the darkness to pursue."}, {"time": 10946, "text": "And in that sense, I find panpsychism interesting in that like, it does feel like there's something fundamental here, that consciousness is, it's not just like, okay, so the flip side, consciousness could be just a very basic and trivial symptom, like a little hack of nature that's useful for like survival of an organism."}, {"time": 10973, "text": "It's not something fundamental."}, {"time": 10975, "text": "It's just this very basic, boring chemical thing that somehow has convinced us humans, because we're very human centric, we're very self centric, that this is somehow really important, but it's actually pretty obvious."}, {"time": 10990, "text": "But, or it could be something really fundamental to the nature of the universe."}, {"time": 10995, "text": "So both of those are to me pretty compelling."}, {"time": 10998, "text": "And I think eventually scientifically testable."}, {"time": 11001, "text": "It is so frustrating that it's hard to design a scientific experiment currently, but I think that's how Nobel Prizes are won, is nobody did it until they do it."}, {"time": 11051, "text": "But the reason I would bet on panpsychism is to me, Occam's razor, in terms of truly the hard problem, at some point you have an inside looking out."}, {"time": 11062, "text": "And even looking refers to vision and it doesn't, that's just an example, but just, there's an inside experiencing something."}, {"time": 11071, "text": "At some point of complexity, all of a sudden, you start from this objective universe and all we know about is interactions between things and things happen."}, {"time": 11079, "text": "And at this certain level of complexity, magically there's an inside."}, {"time": 11085, "text": "That to me doesn't pass Occam's razor as easily as maybe there is a fundamental property of the universe."}, {"time": 11093, "text": "There's both subjective and objective."}, {"time": 11096, "text": "There is both interactions amongst things and there is the thing itself."}, {"time": 11104, "text": "So I'm of two minds."}, {"time": 11105, "text": "I agree with you totally on half my mind."}, {"time": 11108, "text": "And the other half is I've seen, looking at cellular automata a lot, which is, it sure does seem that we don't understand anything about complexity."}, {"time": 11118, "text": "Like the emergence, just the property."}, {"time": 11121, "text": "In fact, that could be a fundamental property of reality is something within the emergence from simple things interacting, somehow miraculous things happen."}, {"time": 11133, "text": "And like that, I don't understand that."}, {"time": 11136, "text": "That could be fundamental."}, {"time": 11138, "text": "That like something about the layers of abstraction, like layers of reality, like really small things interacting and then on another layer emerges actual complicated behavior even on the underlying thing is super simple."}, {"time": 11157, "text": "Like that process, we don't really don't understand either."}, {"time": 11160, "text": "And that could be bigger than any of the things we're talking about."}, {"time": 11164, "text": "That's the basic force behind everything that's happening in the universe is from simple things, complex phenomena can happen."}, {"time": 11174, "text": "Phenomena can happen."}, {"time": 11176, "text": "And the thing that gives me pause is that I'm concerned about a threshold there."}, {"time": 11184, "text": "Like how is it likely that, now there may be, and there may be some qualitative shift that in the realm of like, we don't even understand complexity yet, like you're saying."}, {"time": 11193, "text": "Like, so maybe there is, but I do think like if it is a result of the complexity, well, just having helium versus hydrogen is a form of complexity."}, {"time": 11203, "text": "Having the existence of stars versus clouds of gas is a complexity."}, {"time": 11206, "text": "The entire universe has been this increasing complexity."}, {"time": 11210, "text": "And so that kind of brings me back to then the other of like, okay, if there's, if it's about complexity, then we should, then it exists at a certain level in these simple systems like a star or a more complex atom."}, {"time": 11225, "text": "Hence the panpsychism, that's right."}, {"time": 11226, "text": "But we humans, the qualitative shift, we might have evolved to appreciate certain kinds of thresholds."}, {"time": 11271, "text": "Let me ask the craziest question."}, {"time": 11273, "text": "Indulge me for a second."}, {"time": 11274, "text": "I'll, this is a joke."}, {"time": 11277, "text": "Compared to what we've been talking about?"}, {"time": 11279, "text": "No, all of this is assigned, all of that, despite the caveats about armchair, I think is within the reach of science."}, {"time": 11288, "text": "Let me ask one that's kind of, also within the reach of science, but as Joe likes to say, it's entirely possible, right?"}, {"time": 11297, "text": "Is it possible that with these DMT trips, when you meet entities, is it possible that these entities are extraterrestrial life forms?"}, {"time": 11310, "text": "Like our understanding of little green men with aliens that show up is totally off."}, {"time": 11316, "text": "I often think about this, like what would actual extraterrestrial intelligence look like?"}, {"time": 11323, "text": "And my sense is it will look like very different from anything we can even begin to comprehend."}, {"time": 11331, "text": "And how would it communicate?"}, {"time": 11333, "text": "Would it be necessarily spaceships within your civil travel or?"}, {"time": 11337, "text": "Could it be communicating through chemicals, through if there's the panpsychism situation, if there's something, not if."}, {"time": 11345, "text": "I almost for sure know we don't understand a lot about the function of our mind in connection to the fabric of the physics in the universe."}, {"time": 11356, "text": "A lot of people seem to think we have theoretical physics pretty figured out."}, {"time": 11360, "text": "I have my doubts because I'm pretty sure it always feels like we have everything figured out until we don't."}, {"time": 11365, "text": "Right, I mean, there's no grand unifying theory yet, right?"}, {"time": 11368, "text": "But even then, we could be missing out, like the concept of the universe just can be completely off."}, {"time": 11376, "text": "Like how many other universes are there?"}, {"time": 11380, "text": "I mean, just the basic nature of information, the time, time, all of those things."}, {"time": 11388, "text": "Yeah, whether that's just like a thing we assign value to or whether it's fundamental or not, that's whole, I could talk to Shankar forever about whether time is emergent or fundamental to the reality."}, {"time": 11401, "text": "But is it possible that the entities we meet are actual alien life forms?"}, {"time": 11406, "text": "Do you ever think about that?"}, {"time": 11408, "text": "Yeah, yeah, yeah, yeah, I do."}, {"time": 11410, "text": "And I've, to some degree, laid my cards out by identifying as a radical empiricist, you know?"}, {"time": 11416, "text": "And it's like, so the answer, is it possible?"}, {"time": 11418, "text": "And I think, you know, ultimately, if you're a good scientist, you gotta say, now that's at the extremes, it's a like, yes."}, {"time": 11426, "text": "It might get more interesting when you're asked to guess about the probability of that."}, {"time": 11431, "text": "Is that a one in a million, one in a trillion, one in more than the number of atoms in the universe probability?"}, {"time": 11441, "text": "And as an empiricist, it's like, what is a good testable?"}, {"time": 11444, "text": "Like, how would you know the answer to that question?"}, {"time": 11447, "text": "Or how would you be able to validate?"}, {"time": 11450, "text": "Well, can you get some information that's verifiable, like information about some other planet or some aspect?"}, {"time": 11461, "text": "And gosh, it would be an interesting range, but what range of discovery that we can anticipate we're gonna know within, you know, whatever, a few years, next five, 10, 20 years, and seeing if you can get that information now, and then over time, it might be verified."}, {"time": 11480, "text": "You know, the type of thing like, you know, part of Einstein's work was ultimately verified, not until decades and decades later, at least certain aspects through empirical observations."}, {"time": 11491, "text": "But it's also possible that the alien beings have a very different value system and perception of the world, where all of this little capitalistic improvements that we're all after, like predicting, the concept of predicting the future too, is like totally useless to other life forms that perhaps think in a much different way, maybe a more transcendent way, I don't know, but."}, {"time": 11518, "text": "So they wouldn't even sign the consent form to be a participant in our experiment?"}, {"time": 11523, "text": "They would not, they would not."}, {"time": 11525, "text": "And they wouldn't even understand the nature of these experiments."}, {"time": 11528, "text": "I mean, maybe it's purely in the realm of the consciousness thing that we talked about."}, {"time": 11536, "text": "So communicating in a way that is totally different than the kinds of communication that we think of as on Earth."}, {"time": 11544, "text": "Like what's the purpose of communication for us?"}, {"time": 11547, "text": "For us humans, the purpose of communication is sharing ideas, it feels like."}, {"time": 11552, "text": "Like converging, like it's the Dawkins like memes."}, {"time": 11557, "text": "It's like we're sharing ideas in order to figure out how to collaborate together, to get food into our systems and procreate and then like murder everybody in the neighboring tribe because they'll steal our food."}, {"time": 11572, "text": "Like we are all about sharing ideas."}, {"time": 11574, "text": "Maybe it's possible to have another alien life form that's more about sharing experiences."}, {"time": 11583, "text": "Like it's less about ideas, I don't know."}, {"time": 11585, "text": "And maybe that'll be us in a few years."}, {"time": 11587, "text": "How could it not?"}, {"time": 11588, "text": "Like instead of explaining something laboriously to you, like having people describe the ineffable psychedelic experience, like if we could record that and then get the neural link of 50 years from now, like, oh, just plug this into your... Just transferring the experiences."}, {"time": 11602, "text": "Yeah, it's like, oh, now you feel what it's like."}, {"time": 11604, "text": "And like, in one sense, like how could we not go there?"}, {"time": 11607, "text": "And then you get into the realm, especially when you throw time into it, are the aliens us in the future?"}, {"time": 11612, "text": "Or even like a transcendental, temporal, like the us beyond time."}, {"time": 11617, "text": "Like, I don't know, like you get into this realm and there's a lot of possibilities, yeah."}, {"time": 11622, "text": "But I think, you know, there's one psychedelic researcher that's who did high dose DMT research in the 90s who speculated that, that there was a lot of alien encounter experiences."}, {"time": 11634, "text": "Like maybe these are like entities from some other dimension or..."}, {"time": 11639, "text": "He labeled it as speculation, but you know."}, {"time": 11642, "text": "Do you remember the name?"}, {"time": 11643, "text": "Oh, Rick Strassman."}, {"time": 11645, "text": "Yeah, yeah, the DMT work."}, {"time": 11772, "text": "But you have to be the good scientist most of the time."}, {"time": 11775, "text": "And that's consistent with what I think the great scientists of history, like in most of the history, the greats, the Newtons and Einsteins, I mean, they were, there was less of, and this change I think is time marched on, but less of a separation between those realms."}, {"time": 11820, "text": "I mean, Newton, and you go back in time, and it's like that obviously connects to then religion, especially if that is the predominant world, where Newton, like how much time did he spend trying to decode the Bible and whatnot?"}, {"time": 11832, "text": "Maybe that was a dead end."}, {"time": 11834, "text": "But it's like, if you really believe in that, in that particular religion, and you're this mastermind, and you're trying to figure things out, it's not like, oh, this is what my job description is and this is what the grant wants."}, {"time": 11845, "text": "It's like, no, I've got this limited time on the planet, I'm gonna figure out as much stuff as possible."}, {"time": 11850, "text": "Nothing is off the table and you're just putting it all together."}, {"time": 11854, "text": "So this is kind of this trajectory is really related to this, the siloing in science."}, {"time": 11858, "text": "Like, again, related to my like, oh, I'm not a philosopher, whether you consider that a science or not, not empirical science, but like going to these different disciplines, like the greats didn't observe the boundaries, the boundaries didn't exist, they didn't observe them."}, {"time": 11876, "text": "So speaking of the finiteness of our existence in this world, so on the front of psychedelics and teaching you lessons as a researcher, as a human being, what have you learned about death, about mortality, about the finiteness of our existence?"}, {"time": 11901, "text": "And how has your view, do you ponder it?"}, {"time": 11905, "text": "And has your view of your mortality changed with the research you've done?"}, {"time": 11910, "text": "Yeah, yeah, so I do ponder it and... Are you afraid of death?"}, {"time": 11915, "text": "Probably on a daily basis, I ponder it."}, {"time": 11917, "text": "I'd have to pick it apart more and say, yeah, I am afraid of dying, like the process of dying."}, {"time": 11926, "text": "I'm not afraid of being dead."}, {"time": 11928, "text": "I mean, I'm not afraid of, I think it was Penn Jillette that said, and he may have gotten it from someone else, but I'm not afraid of the year 1862 before I existed."}, {"time": 11938, "text": "I'm not afraid of the year 2262 after I'm gone."}, {"time": 11942, "text": "It's gonna be fine."}, {"time": 11943, "text": "But yeah, dying, I'd be lying if I said I wasn't afraid of dying."}, {"time": 11951, "text": "And so there's both the process of dying, yeah, it's usually not good."}, {"time": 11955, "text": "It'd be nice if it was after many, many years and just sort of, I'd rather not die in my sleep."}, {"time": 11963, "text": "I'd rather kind of be conscious, but sort of just die, fade out with old age maybe."}, {"time": 11966, "text": "But just being in an accident and horrible diseases, I've seen enough loved ones."}, {"time": 11973, "text": "It's like, yeah, this is not good."}, {"time": 11974, "text": "This is enough to be, I'd like to say that I'm peaceful and sort of balanced enough that I'm not concerned at all, but no, like, yeah, I'm afraid of dying."}, {"time": 11984, "text": "But I'm also concerned about, I think about family."}, {"time": 11988, "text": "I'm really, I'm afraid or at least concerned about like not being there, like with a three year old, not being there, not being there for him and my wife and my mom the rest of her life."}, {"time": 12003, "text": "I'm concerned about not, I'm concerned more about like the harm that it would cause if I left prematurely."}, {"time": 12010, "text": "And then kind of even bigger along the lines of some of the stuff that forward thinking we've been talking about."}, {"time": 12014, "text": "I think maybe way too much about just like, and I'll never know the answer."}, {"time": 12019, "text": "So even if I lived to 120, but like, I wanna know as much as I can, but like, how is this gonna work out like as humans?"}, {"time": 12028, "text": "Are we, and a big one, I think is are we gonna, and I don't think unfortunately I'm gonna learn it in my lifetime, even if I live to a ripe old age, but well, I don't know."}, {"time": 12038, "text": "Is this gonna work out?"}, {"time": 12039, "text": "Like, are we gonna escape the planet?"}, {"time": 12041, "text": "I think that's one of the biggies."}, {"time": 12042, "text": "Like, are we gonna, like the survival of the speed, like I think the next, like the time we're in now, it's like with the nuclear weapons, with pandemics and with, I mean, we're gonna get to the point where anyone can build a hydrogen bomb."}, {"time": 12057, "text": "Like, you know, it's like, you just like the, or engineer like the, you know, something that's a million times worse than COVID and then just spread it."}, {"time": 12064, "text": "It's like, we're getting to this period of, and then not to mention climate change, you know, it's like, although I think that's not, there's probably gonna be surviving humans with that regard, you know, but it could be really bad."}, {"time": 12118, "text": "It's like, and we're, I don't know, in terms of the planet, 4 billion years into this."}, {"time": 12124, "text": "And depending on how you count our species, you know, we're, you know, we're millions of years into this."}, {"time": 12128, "text": "And it's like, this is like the point of the relay race where we can really screw up."}, {"time": 12133, "text": "So that would make you feel pretty good when you're on your deathbed at 120 years old and there's something hopeful about, there's a colony starting up on Mars and it's like."}, {"time": 12144, "text": "Yeah, Titan, like whatever, you know, like, yeah, like that we have these colonies out there that would tell me like, yeah, then at least we'd be good until like the, you know, hopefully, probably until the sun goes red giant, you know what I mean?"}, {"time": 12160, "text": "Rather than, oh, like 20 years from now when there's someone with their finger on the nuclear button that just, you know, misperceives, you know, the radar, you know, like the signal they think Russia's attacking, they're really not or China."}, {"time": 12176, "text": "And like, that's probably how a nuclear accident, war is gonna start rather than, you know, or the, like I said, these other horrible things."}, {"time": 12183, "text": "Does it not make you sad that you won't be there if we are successful at proliferating throughout the observable universe that you won't be there to experience any of it?"}, {"time": 12197, "text": "Just the ego death, right?"}, {"time": 12199, "text": "It's the death, because you're still gonna die and it's still gonna be over."}, {"time": 12203, "text": "That's, you know, Ernest Becker and those folks really emphasize the terror of death that if we're honest, we'll discover if we search within ourselves, which is like, this thing is gonna be over."}, {"time": 12218, "text": "Most of our existence is based on the illusion that it's gonna go forever."}, {"time": 12227, "text": "And when you sort of realize it's actually gonna be over, like today, like I might murder you at the end of this conversation."}, {"time": 12234, "text": "And it might be over today, or like on going home, this might be your last day on this earth."}, {"time": 12242, "text": "And it's, I mean, like pondering that, I suppose one thing to be me, I, if I were to push back, it's interesting, is you actually, I think you see comfort in the sadness of how unfortunate it will be for your family to not have you, because the really, even the deeper, yes, but that's the simple fear."}, {"time": 12274, "text": "Even the deeper terror is like this thing doesn't last forever."}, {"time": 12281, "text": "Like I think, I don't know, like it's hard to put the right words to it, but it feels like that's not truly acknowledged by us, by each of us."}, {"time": 12294, "text": "Yeah, I think this is the, I mean, getting back to the psychedelics in terms of the people and our work with cancer patients who, we had psilocybin sessions to help them, and it did substantially help them, the vast majority, in terms of dealing with these existential issues."}, {"time": 12310, "text": "And I think, you know, it's something we, I could say that I really feel that I've come along in that both like being with folks who have died that are close to me, and then also that work, I think are the two biggies in sort of, you know, I think I've come along in that, that sort of acceptance of this, like it's not gonna last."}, {"time": 12331, "text": "And whether at the personal level or even at the species level, like at some point, all the stars are gonna fade out, and it's gonna be the realm of, which is gonna be the vast majority, unless there's a big crunch, which apparently doesn't seem likely."}, {"time": 12343, "text": "Like most of the universe, there's this blink of an eye that's happening right now that life is even possible, like the era of stars."}, {"time": 12349, "text": "So it's like, we're gonna fade out at some point."}, {"time": 12352, "text": "Like, you know, and you know, then we get at this level of consciousness and like, okay, maybe there is life after death."}, {"time": 12360, "text": "Maybe there's, maybe time's an illusion."}, {"time": 12362, "text": "Like that part I'm ready for."}, {"time": 12364, "text": "Like, I'm like, you know, like that, that would be really great."}, {"time": 12368, "text": "And I'm looking, I'm not afraid of that at all."}, {"time": 12392, "text": "That's a true scientist way of thinking."}, {"time": 12394, "text": "If there's a door, you're excited about opening it and going in."}, {"time": 12399, "text": "When I am attracted to this idea, like, you know, and I recognize it's easier said than done to say I'm okay with not existing."}, {"time": 12407, "text": "It's like the real test is like, okay, check me on my deathbed."}, {"time": 12410, "text": "You know, it's like, oh, I'll be all right."}, {"time": 12412, "text": "It's a beautiful thing and the humility of surrendering."}, {"time": 12415, "text": "And I really hope, and I think I'd probably be more likely to be in that realm right now than I would, or check me when I get a terminal cancer diagnosis, and I really hope I'm more in that realm."}, {"time": 12427, "text": "But I know enough about human nature to know that, like, I can't really speak to that because I haven't been in that situation."}, {"time": 12434, "text": "And I think there can be a beauty to that and the transcendence of like, yeah, and, you know, it was beautiful, not just despite all that, but because of that, because ultimately there's going to be nothing and because we came from nothing and we dealt with all this shit, the fact that there was still beauty and truth and connection, like, that, you know, like it just, it's a beautiful thing."}, {"time": 12458, "text": "But I hope I'm in that."}, {"time": 12460, "text": "It's easy to say that now."}, {"time": 12464, "text": "Do you think there's a meaning to this thing we got going on, life, existence on earth to us individuals from a psychedelics researcher perspective or from just a human perspective?"}, {"time": 12480, "text": "Those merged together for me, like, because it's just hard."}, {"time": 12512, "text": "Sometimes like people like, you know, and it's just like, you have to have a, and you just feel lucky to be part of that process that people trust you to let their guards down like that."}, {"time": 12526, "text": "Like, I don't know, the meaning, I think the meaning of life is to find meaning."}, {"time": 12532, "text": "And I think, actually, I think I just described it a minute ago."}, {"time": 12535, "text": "It's like that transcendence of everything."}, {"time": 12537, "text": "Like, it's the beauty despite the absolute ugliness."}, {"time": 12542, "text": "It's the, and as a species, and I think more about this, like, I think about this a lot."}, {"time": 12548, "text": "It's the fact that we are, I mean, we come from filth."}, {"time": 12555, "text": "I mean, we're, you know, we're animals."}, {"time": 12558, "text": "We come from, like, we're all descendant from murderers and rapists."}, {"time": 12563, "text": "Like, we, despite that background, we are capable of the self sacrifice and the connection and figuring things out, you know, science and other forms of truth, you know, seeking, and an artwork, just the beauty of music and other forms of art."}, {"time": 12585, "text": "It's like the fact that that's possible is the meaning of life."}, {"time": 12591, "text": "I mean... And ultimately, that feels to be creating more and richer experiences."}, {"time": 12597, "text": "The, from a Russian perspective, both the dark, you mentioned the cancer diagnosis or losing a child to suicide or all those dark things is still rich experiences."}, {"time": 12614, "text": "And also the beautiful creations, the art, the music, the science, that's also rich experience."}, {"time": 12620, "text": "So somehow we're figuring out from just like psychedelics expand our mind to the possibility of experiences."}, {"time": 12626, "text": "Somehow we're able to figure out different ways as a society to expand the realm of experiences."}, {"time": 12633, "text": "And from that we gain meaning somehow."}, {"time": 12635, "text": "And that's part of like this, we're going across different levels here, but like the idea that so called bad trips or challenging experiences are so common in psychedelic experiences, it's like, that's a part of that."}, {"time": 12646, "text": "Like, yeah, it's tough."}, {"time": 12647, "text": "And most of the important things in life are really, really tough and scary."}, {"time": 12651, "text": "And most of the things like the death of a loved one, like the greatest learning experiences and things that make you who you are are the horrors."}, {"time": 12661, "text": "And it's like, yeah, we try to minimize them."}]}]