[{"title": "Lee Cronin: Origin of Life, Aliens, Complexity, and Consciousness | Lex Fridman Podcast #269", "id": "ZecQ64l-gKM", "quotes": [{"time": 325, "text": "And the laws of physics and the way, well, there are no laws of physics."}, {"time": 328, "text": "It's just memory free stuff, right?"}, {"time": 332, "text": "So there's only a finite number of ways you can arrange the fundamental particles to do things."}, {"time": 338, "text": "Life is the universe developing a memory."}, {"time": 343, "text": "So it's like sewing a piece of art slowly, and then you can look back at it."}, {"time": 350, "text": "So, so there's a stickiness to life."}, {"time": 356, "text": "It's like universe doing stuff."}, {"time": 358, "text": "And when you say memory, it's like there's a stickiness to a bunch of the stuff that's building together."}, {"time": 364, "text": "So like you can, in a stable way, like trace back the complexity and that tells a coherent story."}, {"time": 373, "text": "Yeah, and I think, yeah."}, {"time": 374, "text": "Okay, that's, by the way, very poetic and beautiful."}, {"time": 384, "text": "Okay, and then there's autonomy, you said complexity we'll talk about, but it's a really interesting idea that selection preceded biology."}, {"time": 395, "text": "So first of all, what is chemistry?"}, {"time": 398, "text": "Like does sand still count as chemistry?"}, {"time": 401, "text": "Sure, I mean, as a chemist, a card carrying chemist, if I'm allowed a card, I don't know."}, {"time": 405, "text": "Don't know what I am most days, actually."}, {"time": 406, "text": "What is a card made of?"}, {"time": 408, "text": "That's what I'm thinking."}, {"time": 409, "text": "What's the chemical composition of the card?"}, {"time": 412, "text": "So what is chemistry?"}, {"time": 413, "text": "Well, chemistry is the thing that happens when you bring electrons together and you form bonds."}, {"time": 418, "text": "So bonds, well, I say to people when they talk about life elsewhere, and I just say, well, there's bonds, there's hope, because bonds allow you to get heterogeneity."}, {"time": 427, "text": "They allow you to record those memories, or at least on Earth."}, {"time": 431, "text": "You could imagine a Stanislav Lemtri world where you might have life emerging or intelligence emerging before life."}, {"time": 439, "text": "That may be something like Solaris or something, but to get to selection, if you can form, if atoms can combine and form bonds, those bonds, those atoms can bond to different elements and those molecules will have different identities and interact with each other differently, and then you can start to have some degree of causation or interaction and then selection and then existence."}, {"time": 465, "text": "And then you go up the kind of the path of complexity."}, {"time": 469, "text": "And so at least on Earth, as we know it, there is a sufficient pool of available chemicals to start searching that combinatorial space of bonds."}, {"time": 481, "text": "So, okay, this is a really interesting question."}, {"time": 483, "text": "Let's lay it out."}, {"time": 484, "text": "So bonds, almost like cards."}, {"time": 487, "text": "We say there's bonds, there is life, there's intelligence, there's consciousness."}, {"time": 494, "text": "And what you just made me realize is that those can emerge, let's put bonds aside, those can emerge in any order."}, {"time": 508, "text": "So intelligence can come before life."}, {"time": 512, "text": "It's like panpsychists believe that consciousness, I guess, comes before life and before intelligence."}, {"time": 521, "text": "So consciousness permeates all matter, it's some kind of fabric of reality."}, {"time": 526, "text": "Okay, so like within this framework, you can kind of arrange everything, but you need to have the bonds that precedes everything else."}, {"time": 535, "text": "Oh, and the other thing is selection."}, {"time": 537, "text": "So like the mechanism of selection, that could proceed."}, {"time": 542, "text": "See, couldn't that proceed bonds too?"}, {"time": 544, "text": "Whatever the hell selection is."}, {"time": 545, "text": "So I would say that there is an elegant order to it."}, {"time": 549, "text": "Bonds allow selection, allows the emergence of life, allows the emergence of multicellularity and then more information processing, building state machines all the way up."}, {"time": 559, "text": "However, you could imagine a situation if you had, I don't know, a neutron star or a sun or what a ferromagnetic loops interacting with one another and these oscillators building state machines and these state machines reading something out in the environment."}, {"time": 574, "text": "Over time, these state machines would be able to literally record what happened in the past and sense what's going on in the present and imagine the future."}, {"time": 583, "text": "However, I don't think it's ever gonna be within a human comprehension, that type of life."}, {"time": 589, "text": "I wouldn't count it out because whenever you say, I know in science, whenever I say something's impossible, I then wake up the next day and say, no, that's actually wrong."}, {"time": 597, "text": "I mean, there are some limits, of course."}, {"time": 600, "text": "I don't see myself traveling fast and light anytime soon, but... Eric Weinstein says that's possible, so he will say you're wrong."}, {"time": 606, "text": "Sure, but I'm an experimentalist as well, so one of my, I have two superpowers."}, {"time": 611, "text": "My stupidity, and I don't mean that as a, I'm like absolutely completely witless, but I mean my ability to kind of just start again and ask the question and then do it with an experiment."}, {"time": 622, "text": "I always wanted to be a theoretician growing up, but I just didn't have the intellectual capability, but I was able to think of experiments in my head I could then do in my lab or when I was a child outside and then those experiments in my head and then outside reinforced one another."}, {"time": 640, "text": "So I think that's a very good way of kind of grounding the science, right?"}, {"time": 644, "text": "Well, that's a nice way to think about theoreticians is they're just people who run experiments in their head."}, {"time": 649, "text": "I mean, that's exactly what Einstein did, right?"}, {"time": 651, "text": "But you were also capable of doing that in the head, in your head, inside your head and in the real world and the connection between the two is when you first discovered your superpower stupidity."}, {"time": 663, "text": "Yes, there you go."}, {"time": 664, "text": "What's the second superpower?"}, {"time": 665, "text": "Your accent or is that?"}, {"time": 669, "text": "I am genuinely curious."}, {"time": 671, "text": "So I have, like everybody, ego problems, but my curiosity is bigger than my ego."}, {"time": 676, "text": "So as long as that happens, I can cope."}, {"time": 682, "text": "You're just dropping some powerful lines."}, {"time": 683, "text": "So curiosity is bigger than ego."}, {"time": 686, "text": "That's something I have to think about because you always struggle about the role of ego in life and that's so nice to think about, don't think about the size of ego, the absolute size of ego."}, {"time": 698, "text": "Think about the relative size of ego to the other horses pulling at you."}, {"time": 704, "text": "If the curiosity one is bigger, then ego will do just fine and make you fun to talk to."}, {"time": 711, "text": "Anyway, so those are the two superpowers."}, {"time": 713, "text": "How do those connect to natural selection or selection and bonds and, I forgot already, life and consciousness?"}, {"time": 719, "text": "So we're going back to selection in the universe and origin of life on Earth."}, {"time": 723, "text": "I mean, selection, I'm convinced that selection is a force in the universe."}, {"time": 729, "text": "Not a fundamental force, but it is a directing force because existence, although existence appears to be the default, the existence of what, why does, and we can get to this later, I think, but it's amazing that discrete things exist and you see this cup."}, {"time": 751, "text": "It's not the sexiest cup in the world, but it's pretty functional."}, {"time": 755, "text": "This cup, the complexity of this cup isn't just in the object."}, {"time": 759, "text": "It is literally the lineage of people making cups and recognizing that, seeing that in their head, making an abstraction of a cup, and then making a different one."}, {"time": 767, "text": "So I wonder how many billions of cups have come before this one, and that's the process of selection and existence, and the only reason the cup is still used is quite useful."}, {"time": 777, "text": "I like the handle."}, {"time": 778, "text": "It's convenient, so I don't die."}, {"time": 779, "text": "I keep hydration, and so I think we are missing something fundamental in the universe about selection, and I think what biology is is a selection amplifier, and that this is where autonomy comes in, and actually I think that how humanity is gonna, humans and autonomous robots, or whatever we're gonna call them in the future, will supercharge that even further."}, {"time": 804, "text": "So selection is happening in the universe, but if you look in the asteroid belt, selection, if objects are being kicked in and out of the asteroid belt, those trajectories are quite complex."}, {"time": 815, "text": "You don't really look at that as productive selection because it's not doing anything to improve its function, but is it?"}, {"time": 820, "text": "The asteroid belt has existed for some time, so there is some selection going on, but the functionality is somewhat limited."}, {"time": 829, "text": "On Earth, at the formation of Earth, interaction of chemicals and molecules in the environment gave selection, and then things could happen, because you could think about, in chemistry, we could have an infinite number of reactions happen, but all the reactions that are allowed to happen don't happen, why?"}, {"time": 847, "text": "Because there are energy barriers."}, {"time": 848, "text": "So there must be some things called catalysts out there, or there are bits of minerals that, when two molecules get together in that mineral, it lowers the energy barrier for the reaction, and so the reaction is promoted."}, {"time": 861, "text": "So suddenly you get one reaction over another series of possibilities occurring that makes a particular molecule, and this keeps happening in steps, and before you know it, almost these waves as discrete reactions work together, and you start to build a machinery that is run by existence."}, {"time": 951, "text": "So John von Neumann is a real hero, actually, not just me, but many people, I think, computer science and physics."}, {"time": 958, "text": "He was an incredible intellect who probably solved a lot of the problems that we're working on today and just forgot to write them down."}, {"time": 966, "text": "And I'm not sure if it's John von Neumann or Johnny, as I think his friends called him, but I think he was Hungarian, a mathematician, came to the US, and basically was involved in the Manhattan Project in developing computation and came up with all sorts of ideas, and I think he was one of the first people to come up with cellular automata."}, {"time": 987, "text": "And, but he... Oh, really?"}, {"time": 989, "text": "I didn't know this little fact."}, {"time": 991, "text": "And I think... Well, anyway, if he didn't come up with it, he probably did come up with it and didn't write it down."}, {"time": 997, "text": "There was a couple of people who did at the same time, and then Conway obviously took it on, and then Wolfram loves CAs."}, {"time": 1002, "text": "There is his fabric of the universe."}, {"time": 1004, "text": "And what I think he imagined was that he wasn't satisfied, and this may be incorrect recollection, but a lot of what I say is gonna be kind of just way out of my... You're, Lee, you're just part of the universe creating its memory, designing..."}, {"time": 1022, "text": "Exactly, yeah, rewriting history."}, {"time": 1024, "text": "Rewriting history."}, {"time": 1025, "text": "Exactly, imperfectly."}, {"time": 1026, "text": "So, but what I mean is I think he liked this idea of thinking about how could a Turing machine literally build itself without a Turing machine, right?"}, {"time": 1036, "text": "It's like literally how did state machines emerge?"}, {"time": 1039, "text": "And I think that von Neumann constructors, he wanted to conceive of a minimal thing, autonomous, that could build itself."}, {"time": 1048, "text": "And what would those rules look like in the world?"}, {"time": 1050, "text": "And that's what a von Neumann kind of constructor looked like, like it's a minimal hypothetical object that could build itself, self replicate."}, {"time": 1057, "text": "And I'm really fascinated by that because I think that although it's probably not exactly what happened, it's a nice model because as chemists, if we could go back to the origin of life and think about what is a minimal machine that can get structured randomly?"}, {"time": 1075, "text": "So like with no prime mover, with no architect, it assembles through just existence."}, {"time": 1083, "text": "So random stuff bumping in together and you make this first molecule."}, {"time": 1087, "text": "So you have molecule A and molecule A interacts with another random molecule B and they get together and they realize by working together they can make more of themselves, but then they realize they can mutate so they can make AB prime."}, {"time": 1101, "text": "So AB prime is different to AB and then AB prime can then act back where A and B are being created and slightly nudge that causal chain and make AB prime more evolvable or learn more."}, {"time": 1118, "text": "So that's the closing the loop part."}, {"time": 1120, "text": "Closing the loop part, got it."}, {"time": 1122, "text": "It feels like the mutation part is not that difficult."}, {"time": 1126, "text": "It feels like the difficult part is just creating a copy of yourself as step one."}, {"time": 1130, "text": "That seems like one of the greatest inventions in the history of the universe is the first molecule that figured out, holy shit, I can create a copy of myself."}, {"time": 1146, "text": "I think it's really, really easy."}, {"time": 1149, "text": "Okay, I did not expect that."}, {"time": 1152, "text": "Well, let's take a step back."}, {"time": 1155, "text": "I think replicating molecules are rare, but if you say, I think I was saying on, I probably got into trouble on Twitter the other day, so I was trying to work this."}, {"time": 1164, "text": "There's about more than 18 mils of water in there."}, {"time": 1167, "text": "So one mole of water, 6.022 times 10 to the 23 molecules."}, {"time": 1171, "text": "That's about the number of stars in universe, I think, of the order."}, {"time": 1174, "text": "So there's three universe worth, but between one and."}, {"time": 1177, "text": "Somebody corrected you on Twitter?"}, {"time": 1178, "text": "Yeah, as if, I'm always being corrected."}, {"time": 1180, "text": "It's a great, but there's a lot of molecules in the water."}, {"time": 1184, "text": "And so there's a lot of, so although it's for you and me, really hard to conceive of, if existence is not the default for a long period of time, because what happens is the molecules get degraded."}, {"time": 1197, "text": "So much of the possibilities in the universe are just broken back into atoms."}, {"time": 1201, "text": "So you have this kind of destruction of the molecules for our chemical reactions."}, {"time": 1207, "text": "So you only need one or two molecules to become good at copying themselves for them suddenly to then take resources in the pool and start to grow."}, {"time": 1216, "text": "And so then replication actually over time, when you have bonds, I think is much simpler, much easier."}, {"time": 1223, "text": "And I even found this in my lab years ago."}, {"time": 1225, "text": "I had one of the reasons I started doing inorganic chemistry and making rust, making a bit of rust based on a thing called molybdenum, molybdenum oxide is this molybdenum oxide, very simple."}, {"time": 1238, "text": "But when you add acid to it and some electrons, they make these molecules you just cannot possibly imagine would be constructed big, gigantic wheels of 154 molybdenum atoms in a wheel or I cost a dodecahedron 132 molybdenum atoms all in the same pot."}, {"time": 1255, "text": "And I realized when I, and I just finished experiments two years ago, I've just published a couple of papers on this, that they're actually, there is a random small molecule with 12 atoms in it that can form randomly, but it happens to template its own production."}, {"time": 1270, "text": "And then by chance, it templates the ring, just an accident, just like just an absolute accident."}, {"time": 1277, "text": "And that ring also helps make the small 12 mer."}, {"time": 1281, "text": "And so you have what's called an autocatalytic set where A makes B and B helps make A and vice versa."}, {"time": 1292, "text": "And you then make this loop."}, {"time": 1294, "text": "So it's a bit like these, they all work in synergy to make this chain of events that grow."}, {"time": 1303, "text": "And it doesn't take a very sophisticated model to show that if you have these objects are competing and then collaborating to help one another build, they just grow out of the mess."}, {"time": 1315, "text": "And although they seem improbable, they are improbable, in fact, impossible in one step."}, {"time": 1321, "text": "There's multiple steps."}, {"time": 1322, "text": "This is when the blind people look at the blind watchmaker argument and you talk about how could a watch spontaneously emerge?"}, {"time": 1330, "text": "Well, it doesn't."}, {"time": 1331, "text": "It's a lineage of watches and cruder devices that are bootstrapped onto one another."}, {"time": 1339, "text": "Right, so it's very improbable, but once you get that little discovery like with the wheel and fire, it just explodes because it's so successful, it explodes."}, {"time": 1354, "text": "It explodes, it's basically selection."}, {"time": 1357, "text": "So this templating mechanism that allows you to have a little like blueprint for yourself, how you go through different procedures is to build copies of yourself."}, {"time": 1369, "text": "So in chemistry somehow it's possible to imagine that that kind of thing is easy to spring up."}, {"time": 1377, "text": "In more complex organisms, it feels like a different thing and much more complicated."}, {"time": 1380, "text": "Like we're having like multiple abstractions of the birds and the bees conversation here, but with human, I'm sorry, with complex organisms, it feels like difficult to have reproduction to, that's gonna get clipped out."}, {"time": 1397, "text": "I'm gonna make fun of that."}, {"time": 1398, "text": "It's difficult to develop this idea of making copies of yourself or no."}, {"time": 1406, "text": "Because that seems like a magical idea for life to, but wow, that feels like very necessary for what selection is, for what evolution is."}, {"time": 1417, "text": "But then if selection precedes all of this, then maybe these are just like echoes of the selecting mechanism at different scales."}, {"time": 1427, "text": "Yeah, that's exactly it."}, {"time": 1428, "text": "So selection is the default in the universe if you want to."}, {"time": 1432, "text": "And what happens is that life, the solution that life has got on earth, life on earth, biology on earth is unique to earth."}, {"time": 1443, "text": "And that was really hard fought for, but that is a solution that works on earth, the ribosome, the fundamental machine that is responsible for every cell on earth of whatever, wherever it is in the kingdom of life."}, {"time": 1458, "text": "That is an incredibly complex object, but it was evolved over time and it wasn't involved in a vacuum."}, {"time": 1464, "text": "And I think that once we understand that selection can occur without the ribosome, but what the ribosome does, it's a phase transition in replication."}, {"time": 1477, "text": "And I think that that, and also technology that is probably much easier to get to than we think."}, {"time": 1485, "text": "Why do you put the ribosome as a central part of living organisms on earth?"}, {"time": 1492, "text": "It basically is a combination of two different polymer systems, so RNA and peptides."}, {"time": 1497, "text": "So the RNA world, if you like, gets transmitted and builds proteins and the proteins are responsible for all the catalysis."}, {"time": 1505, "text": "The majority of the catalysis goes on in the cell."}, {"time": 1507, "text": "No ribosome, no proteins, no decoding, no evolution."}, {"time": 1511, "text": "So ribosome is looking at the action."}, {"time": 1514, "text": "You don't put like the RNA itself as the critical thing, like information, you put action as the most important thing."}, {"time": 1520, "text": "I think the actual molecules that we have in biology right now are entirely contingent on the history of life on earth."}, {"time": 1527, "text": "There are so many possible solutions."}, {"time": 1529, "text": "And this is where chemistry got itself into, origin of life chemistry gets itself into a bit of a trap."}, {"time": 1533, "text": "Yeah, let me interrupt you there."}, {"time": 1535, "text": "You've tweeted, you're gonna get, I'm gonna cite your tweets like it's Shakespeare, okay?"}, {"time": 1540, "text": "It's surprising you haven't gotten canceled on Twitter yet."}, {"time": 1543, "text": "Your brilliance once again saves you."}, {"time": 1549, "text": "You like to have a little bit of fun on Twitter."}, {"time": 1551, "text": "You've tweeted that quote, origin of life research is a scam."}, {"time": 1556, "text": "So if this is Shakespeare, can we analyze this word?"}, {"time": 1560, "text": "Why is the origin of life research a scam?"}, {"time": 1562, "text": "Aren't you kind of doing origin of life research?"}, {"time": 1566, "text": "Okay, it was tongue in cheek, but yeah, I think, and I meant it as tongue in cheek."}, {"time": 1572, "text": "I'm not doing the origin of life research."}, {"time": 1574, "text": "I'm trying to make artificial life."}, {"time": 1576, "text": "And I also want to bound the likelihood of the origin of life on earth, but more importantly to find origin of life elsewhere."}, {"time": 1583, "text": "But let me directly address the tweet."}, {"time": 1586, "text": "There are many, many good chemists out there doing origin of life research, but I want to nudge them."}, {"time": 1591, "text": "And I think they're brilliant."}, {"time": 1592, "text": "Like there's no question the chemistry they are doing, the motivation is great."}, {"time": 1598, "text": "So what I meant by that tweet is saying that maybe they're making assumptions about saying, if only I could make this particular type of molecule, say this RNA molecule or this phosphodiester or this other molecule, it's gonna somehow unlock the origin of life."}, {"time": 1617, "text": "And I think that origin of life has been looking at this for a very long time."}, {"time": 1621, "text": "And whilst I think it's brilliant to work out how you can get to those molecules, I think that chemistry and chemists doing origin of life could be nudged into doing something even more profound."}, {"time": 1635, "text": "And so the argument I'm making, it's a bit like right now, let's say, I don't know, the first Tesla that makes its way to, I don't know, into a new country in the world."}, {"time": 1647, "text": "Let's say there's a country X that has never had a Tesla before and they get the Tesla."}, {"time": 1652, "text": "And they take the Tesla, and what they do is they take the Tesla apart and say, we want to find the origin of cars in the universe and say, okay, how did this form and how did this form?"}, {"time": 1661, "text": "And they just randomly keep making till they make the door, they make the wheel, they make the steering column and all this stuff."}, {"time": 1666, "text": "And they say, well, that's the route."}, {"time": 1668, "text": "That's the way cars emerged on earth."}, {"time": 1670, "text": "But actually we know that there's a causal chain of cars going right back to Henry Ford and the horse and carriage."}, {"time": 1676, "text": "And before that, maybe, you know, where people were using wheels."}, {"time": 1680, "text": "And I think that obsession with the identities that we see in biology right now are giving us a false sense of security about what we're looking for."}, {"time": 1690, "text": "And I think that origin of life chemistry is in danger of not making the progress that it deserves because the chemists are doing this."}, {"time": 1702, "text": "The field is exploding right now."}, {"time": 1704, "text": "There's amazing people out there, young and old doing this."}, {"time": 1707, "text": "And there's deservedly so more money going in."}, {"time": 1710, "text": "You know, I used to complain there's more money being spent searching for the Higgs boson that we know exists than the origin of life."}, {"time": 1716, "text": "You know, why is that?"}, {"time": 1717, "text": "The origin, we understand the origin of life."}, {"time": 1719, "text": "We're gonna actually work out what life is."}, {"time": 1722, "text": "And we're gonna be at a bound, the likelihood of finding life elsewhere in the universe."}, {"time": 1725, "text": "And most important for us, we are gonna know or have a good idea of what the future of humanity looks like."}, {"time": 1731, "text": "You know, we need to understand that although we're precious, we're not the only life forms in the universe."}, {"time": 1737, "text": "Or that's my very strong impression."}, {"time": 1738, "text": "I have no data for that."}, {"time": 1740, "text": "It's just right now a belief."}, {"time": 1742, "text": "And I want to turn that belief into a more than a belief by experimentation."}, {"time": 1747, "text": "But coming back to the scam, the scam is if we just make this RNA, we've got this fluke event, we know how that's simple."}, {"time": 1757, "text": "Let's make this phosphodiester, or let's make ATP or ADP."}, {"time": 1761, "text": "We've got that part nailed."}, {"time": 1762, "text": "Let's now make this other molecule, another molecule."}, {"time": 1764, "text": "And how many molecules are gonna be enough?"}, {"time": 1766, "text": "And then the reason I say this is when you go back to Craig Venter, when he invented his life form, Cyndia, this micro, this minimal plasmid, it's a myoplasma, something, I don't know the name of it, but he made this wonderful cell and said, I've invented life."}, {"time": 1789, "text": "He facsimileed the genome from this entity and made it in the lab, all the DNA, but he didn't make the cell."}, {"time": 1796, "text": "He had to take an existing cell that has a causal chain going all the way back to Luca."}, {"time": 1802, "text": "And he showed when he took out the gene, the genes and put in his genes, synthesized, the cell could boot up."}, {"time": 1809, "text": "But it's remarkable that he could not make a cell from scratch."}, {"time": 1812, "text": "And even now today, synthetic biologists cannot make a cell from scratch because there's some contingent information embodied outside the genome in the cell."}, {"time": 1823, "text": "And that is just incredible."}, {"time": 1826, "text": "So there's lots of layers to the scam."}, {"time": 1829, "text": "Well, let me then ask the question, how can we create life in the lab from scratch?"}, {"time": 1837, "text": "What have been the most promising attempts at creating life in the lab from scratch?"}, {"time": 1841, "text": "Has anyone actually been able to do it?"}, {"time": 1844, "text": "Do you think anyone will be able to do it in the near future if they haven't already?"}, {"time": 1850, "text": "Yeah, I think that nobody has made life in the lab from scratch."}, {"time": 1854, "text": "Lots of people would argue that they have made progress."}, {"time": 1857, "text": "So Craig Venter, I think the synthesis of a synthetic genome milestone in human achievement."}, {"time": 1864, "text": "Yeah, can we just walk back and say, what would you say from your perspective, one of the world experts in exactly this area, what does it mean to create life from scratch where if you sit back, whether you do it or somebody else does it, it's like, damn, this is, we just created life."}, {"time": 1884, "text": "Well, I can tell you what I would expect, I would like to be able to do, is to go from sand to cells in my lab and... Can you explain what sand is?"}, {"time": 1899, "text": "Yeah, just inorganic stuff, like basically just, so sand is just silicon oxide with some other ions in it, maybe some inorganic carbon, some carbonates, just basically clearly dead stuff that you could just grind rocks into sand."}, {"time": 1915, "text": "And it would be what, in a kind of vacuum so they could remove anything else that could possibly be like a shadow of life that can assist in the chemical."}, {"time": 1926, "text": "You could do that, you could insist and say, look, I'm gonna take, and not just inorganic, I want some more, I wanna cheat and have some organic, but I want inorganic organic, and I'll explain the play on words in a moment."}, {"time": 1936, "text": "So I would like to basically put into a world, let's say a completely synthetic world, if you like, a closed world, put some inorganic materials and just literally add some energy in some form, be it lightning or heat, UV light, and run this thing in cycles over time and let it solve the search problem."}, {"time": 1958, "text": "So I see the origin of life as a search problem in chemical space."}, {"time": 1962, "text": "And then I would wait, literally wait for a life form to crawl out of the test tube."}, {"time": 1966, "text": "That's a joke I tell my group."}, {"time": 1968, "text": "Literally wait for a very, don't worry, it's gonna be very feeble, it's not gonna take over the world."}, {"time": 1974, "text": "There's ways of ethically containing it."}, {"time": 1976, "text": "Famous last words."}, {"time": 1978, "text": "Indeed, indeed, indeed, but I."}, {"time": 1981, "text": "You know this is being recorded, right?"}, {"time": 1983, "text": "It'll make you, it will not make you look good once it crawls out of the lab and destroys all of human civilization, but yes."}, {"time": 1989, "text": "But there is very good, there is a very good things you can do to prevent that."}, {"time": 1993, "text": "For instance, if you put stuff in your world, which isn't earth abundant, so let's say we make life based on molybdenum and it escapes, it would die immediately because there's not enough molybdenum in the environment."}, {"time": 2003, "text": "So we can put in, we can do responsible life."}, {"time": 2006, "text": "Or as I fantasize with my research group on our away day that would go in, it's, you know, I think it's actually morally if we don't find, until humanity finds life in the universe, this is going on a tangent, it's our moral obligation to make origin of life bombs, identify dead planets and bomb them with our origin of life machines and make them alive."}, {"time": 2026, "text": "I think it is our moral obligation to do that."}, {"time": 2030, "text": "Some people might argue with me about that, but I think that we need more life in the universe."}, {"time": 2034, "text": "And then we kind of forget we did it and then come back and then."}, {"time": 2040, "text": "So where did you come from?"}, {"time": 2042, "text": "But coming back to the, what I'd expect."}, {"time": 2044, "text": "So I just say."}, {"time": 2044, "text": "Father, are you back?"}, {"time": 2046, "text": "I think this is once again, a Rick and Morty episode."}, {"time": 2049, "text": "It's definitely all Rick and Morty all the way down."}, {"time": 2051, "text": "So we, I imagine we have this pristine experiment and everything is, you know, sanitized and we put in inorganic materials and we have cycles with them, day, night cycles, up, down, whatever."}, {"time": 2064, "text": "And we look for evidence of replication and evolution over time."}, {"time": 2068, "text": "And that's what the experiment should be."}, {"time": 2070, "text": "Now, are there people doing this in the world right now?"}, {"time": 2072, "text": "There are a couple of, there's some really good groups doing this."}, {"time": 2075, "text": "There's some really interesting scientists doing this around the world."}, {"time": 2078, "text": "They're kind of perhaps too much associated with the scam."}, {"time": 2084, "text": "So, and so they're using molecules that are already, were already invented by biology."}, {"time": 2090, "text": "So there's a bit of replication built in, but I still think the work that is doing, they're doing is amazing."}, {"time": 2097, "text": "But I would like people to be a bit freer and say, let's just basically shake a load of sand in a box and wait for life to come out because that's what happened on earth."}, {"time": 2106, "text": "And so that we have to understand that."}, {"time": 2108, "text": "Now, how would I know I've been successful?"}, {"time": 2110, "text": "Well, because I'm not obsessing with what molecules are in life now, I would wager a vast quantity of money."}, {"time": 2119, "text": "I'm not very rich, so just be a few dollars, but for me, the solution space will be different."}, {"time": 2127, "text": "So the genetic material will be not RNA."}, {"time": 2131, "text": "The proteins will not be what we think."}, {"time": 2133, "text": "The solutions will be just completely different."}, {"time": 2136, "text": "And it might be, and it will be very feeble because that's the other thing we should be able to show fairly robustly that even if I did make or someone did make a new life form in the lab, it would be so poor that it's not gonna leap out."}, {"time": 2150, "text": "It is the fear about making a lethal life form in the lab from scratch is similar to us imagining that we're gonna make the terminator at Boston Dynamics tomorrow."}, {"time": 2164, "text": "Simply not, and the problem is we don't communicate that properly."}, {"time": 2168, "text": "I know you yourself very, you explain this very well."}, {"time": 2172, "text": "There is not the AI catastrophe coming."}, {"time": 2175, "text": "We're very far away from that."}, {"time": 2176, "text": "That doesn't mean we should ignore it."}, {"time": 2178, "text": "Same with the origin of life catastrophe."}, {"time": 2179, "text": "It's not coming anytime soon."}, {"time": 2181, "text": "We shouldn't ignore it, but we shouldn't let that fear stop us from doing those experiments."}, {"time": 2186, "text": "But this is a much, much longer discussion because there's a lot of details there."}, {"time": 2189, "text": "I would say there is potential for catastrophic events to happen in much dumber ways."}, {"time": 2196, "text": "In AI space, there's a lot of ways to create, like social networks are creating a kind of accelerated set of events that we might not be able to control."}, {"time": 2208, "text": "The social network virality in the digital space can create mass movements of ideas that can then, if times are tough, create military conflict and all those kinds of things."}, {"time": 2222, "text": "But that's not super intelligent AI."}, {"time": 2225, "text": "That's an interesting at scale application of AI."}, {"time": 2229, "text": "If you look at viruses, viruses are pretty dumb, but at scale, their application is pretty detrimental."}, {"time": 2236, "text": "And so origin of life, much like all the kind of virology, the very contentious word of gain of function research and virology, sort of like research on viruses, messing with them genetically, that can create a lot of problems if not done well."}, {"time": 2258, "text": "So we have to be very cautious."}, {"time": 2261, "text": "So there's a kind of, whenever you're ultra cautious about stuff in AI or in virology and biology, it borders on cynicism, I would say, where it's like everything we do is going to turn out to be destructive and terrible."}, {"time": 2278, "text": "So I'm just going to sit here and do nothing."}, {"time": 2280, "text": "Okay, that's a possible solution except for the fact that somebody is going to do it."}, {"time": 2286, "text": "It's science and technology progresses."}, {"time": 2290, "text": "So we have to do it in an ethical way, in a good way, considering in a transparent way, in an open way, considering all the possible positive trajectories that could be taken and making sure as much as possible that we walk those trajectories."}, {"time": 2308, "text": "So yeah, I don't think Terminator is coming, but a totally unexpected version of Terminator may be around the corner."}, {"time": 2316, "text": "Might be here already."}, {"time": 2317, "text": "Yeah, so I agree with that."}, {"time": 2318, "text": "And so going back to the origin of life discussion, I think that in synthetic biology right now, we have to be very careful about how we edit genomes and edit synthetic biology to do things."}, {"time": 2331, "text": "So that's kind of, that's where things might go wrong in the same way as Twitter turning ourselves into kind of strange scale effects."}, {"time": 2339, "text": "I would love origin of life research or artificial life research to get to the point where we have those worries, because that's why I think we're just so far away from that."}, {"time": 2348, "text": "We are just, you know, right now, I think there are two really important angles."}, {"time": 2353, "text": "There is the origin of life people, researchers who are faithfully working on this and trying to make those molecules, the scan molecules I talked about."}, {"time": 2362, "text": "And then there are people on the creationist side who are saying, look, the fact you can't make these molecules and you can't make a cell means that evolution isn't true and all this other stuff."}, {"time": 2371, "text": "Yeah, and so, and I find that really frustrating because actually the origin of life research is all working in good faith, right?"}, {"time": 2378, "text": "And so what I'm trying to do is give origin of life research a little bit more of an open context."}, {"time": 2387, "text": "And one of the things I think is important, I really want to make a new life form in my lifetime."}, {"time": 2392, "text": "I really want to prove that life is a general phenomena, a bit like gravity in the universe, because I think that's gonna be really important for humanity's global psychological state, meaning going forward."}, {"time": 2409, "text": "So one, it will help us understand ourselves."}, {"time": 2412, "text": "So that's useful for science, but two, it gives us a kind of hope, if not an awe at all the huge amounts of alien civilizations that are out there."}, {"time": 2426, "text": "If you can build life and understand just how easy it is to build life, then that's just as good, if not much better, than discovering life on another planet."}, {"time": 2439, "text": "It's, I mean, it's cheaper."}, {"time": 2441, "text": "It's much cheaper and much easier and probably much more conclusive because once you're able to create life, like you said, it's a search problem that there's probably a lot of different ways to do it."}, {"time": 2455, "text": "Once you create the, once you find the first solution, you probably have all the right methodology for finding all kinds of other solutions."}, {"time": 2462, "text": "Yeah, and wouldn't it be great if we could find a solution?"}, {"time": 2486, "text": "It's almost like an add on that we can, with a time dependent add on, you could give to say cyanobacteria in the ocean or to maybe to wheat and say, right, we're just gonna, we're gonna fix a bit more CO2, and we're gonna work out how much we need to fix to basically save the climate, and we're gonna use evolutionary principles to basically get there."}, {"time": 2509, "text": "What worries me is that biology has had a few billion years to find a solution for CO2 fixation, hasn't really done, it's not, the solution isn't brilliant for our needs, but biology wasn't thinking about our needs."}, {"time": 2520, "text": "Biology was thinking about biology's needs, but I think if we can do, as you say, make life in the lab, then suddenly we don't need to go to everywhere and conclusively prove it."}, {"time": 2530, "text": "I think we make life in the lab."}, {"time": 2532, "text": "We look at the extent of life in the solar system."}, {"time": 2534, "text": "How far did Earth life get?"}, {"time": 2536, "text": "Probably we're all Martians."}, {"time": 2537, "text": "Probably life got going on Mars."}, {"time": 2539, "text": "The chemistry on Mars seeded Earth."}, {"time": 2541, "text": "That might have been a legitimate way to kind of truncate the surface."}, {"time": 2545, "text": "But in the outer solar system, we might have completely different life forms on Enceladus, on Europa, and Titan."}, {"time": 2552, "text": "And that would be a cool thing, because."}, {"time": 2553, "text": "Okay, wait a minute, wait a minute, wait a minute."}, {"time": 2556, "text": "Did you just say that you think, in terms of likelihood, life started on Mars, like statistically speaking, life started on Mars and seeded Earth?"}, {"time": 2565, "text": "It could be possible, because life was, so Mars was habitable for the type of life that we have right now, type of chemistry before Earth."}, {"time": 2573, "text": "So it seems to me that Mars got searching, doing chemistry, like, and."}, {"time": 2579, "text": "It started way before."}, {"time": 2580, "text": "Yeah, and so they had a few more replicators and some other stuff."}, {"time": 2584, "text": "And if those replicators got ejected from Mars and landed on Earth, and Earth was like, I don't need to start again."}, {"time": 2592, "text": "And then it just carried on."}, {"time": 2593, "text": "So I'm not going, I think we will find evidence of life on Mars, either life we put there by mistake, contamination, or actually life, the earliest remnants of life."}, {"time": 2604, "text": "And that would be really exciting."}, {"time": 2606, "text": "It's a really good reason to go there."}, {"time": 2608, "text": "But I think it's more unlikely, because the gravitational situation in the solar system, if we find life in the outer solar system."}, {"time": 2613, "text": "Titan and all that, that would be its own thing."}, {"time": 2616, "text": "Wow, that would be so cool."}, {"time": 2617, "text": "If we go to Mars and we find life that looks a hell of a lot similar to Earth life, and then we go to Titan and all those weird moons with the ices and the volcanoes and all that kind of stuff, and then we find there something that looks, I don't know, way weirder."}, {"time": 2635, "text": "Some other, some non RNA type of situation."}, {"time": 2637, "text": "But we might find almost life, like in the prebiotic chemical space."}, {"time": 2641, "text": "And I think there are four types of exoplanets we need to look for, right?"}, {"time": 2644, "text": "Because when JWST goes up and touch wood, it goes up and everything's fine."}, {"time": 2649, "text": "When we look at a star, well, we know statistically, most stars have planets around them."}, {"time": 2653, "text": "What type of planet are they?"}, {"time": 2654, "text": "Are they going to be dead?"}, {"time": 2656, "text": "Are they going to be just a prebiotic origin of life coming?"}, {"time": 2660, "text": "So are they going to be technological?"}, {"time": 2663, "text": "So with intelligence on them, and will they have died?"}, {"time": 2667, "text": "So, you know, had life on them, but gone."}, {"time": 2670, "text": "Those are the four states of the boat."}, {"time": 2672, "text": "And suddenly, it's a bit like I want to classify planets the way we classify stars."}, {"time": 2677, "text": "And I think that, in terms of their, rather than having this, oh, we've found methane, there's evidence of life."}, {"time": 2683, "text": "We found oxygen, that's the evidence of life."}, {"time": 2685, "text": "We found whatever molecule marker."}, {"time": 2687, "text": "And start to then frame things a little bit more."}, {"time": 2691, "text": "As those four states."}, {"time": 2693, "text": "Which, by the way, you're just saying four, but there could be, before the dead, there could be other states that we humans can even conceive of."}, {"time": 2701, "text": "Yeah, yeah, just prebiotic, almost alive, got the possibility to come alive."}, {"time": 2707, "text": "But there could be a post technological."}, {"time": 2708, "text": "Like, whatever we think of as technology, that could be a, like, pre conscious, like, where we all meld into one super intelligent conscious, or some weird thing that naturally happens over time."}, {"time": 2724, "text": "I mean, I think that all bets are on that."}, {"time": 2726, "text": "The metaverse."}, {"time": 2728, "text": "Yeah, we are."}, {"time": 2729, "text": "We join into a virtual metaverse and start creating, which is kind of an interesting idea, almost arbitrary number of copies of each other, much more quickly, so we can mess with different ideas."}, {"time": 2741, "text": "Like, I can create a thousand copies of Lex, like, every possible version of Lex, and then just see, like, and then I just have them, like, argue with each other, and, like, until, like, in the space of ideas and see who wins out."}, {"time": 2756, "text": "How could that possibly go wrong?"}, {"time": 2758, "text": "But anyway, there's, especially in this digital space where you could start exploring with AIs mixed in, you could start engineering arbitrary intelligences, you can start playing in the space of ideas, which might move us into a world that looks very different than a biological world."}, {"time": 2775, "text": "Like, our current world, the technology, is still very much tied to our biology."}, {"time": 2780, "text": "It's, we might move past that completely."}, {"time": 2783, "text": "Oh, definitely, we definitely will."}, {"time": 2785, "text": "We definitely, but that could be another phase then."}, {"time": 2788, "text": "Because then you, yeah."}, {"time": 2789, "text": "But I did say technological, so I think I agree with you."}, {"time": 2790, "text": "I think, so you can have, let's get this right."}, {"time": 2792, "text": "So, dead world, no prospect of alive."}, {"time": 2796, "text": "Prebiotic world, life emerging."}, {"time": 2798, "text": "Living and technological."}, {"time": 2800, "text": "And you probably, and the dead one, you probably won't be able to tell between the dead never being alive and the dead one, maybe you've got some artifacts and maybe there's five."}, {"time": 2808, "text": "There's probably not more than five."}, {"time": 2810, "text": "And I think the technological one could allow, could have life on it still, but it might just have exceeded."}, {"time": 2816, "text": "Because, you know, one way that life might survive on Earth is if we can work out how to deal with the coming, the real climate change that comes when the sun expands."}, {"time": 2825, "text": "It might be a way to survive that, you know, but yeah."}, {"time": 2830, "text": "I think that we need to start thinking statistically when it comes to looking for life in the universe."}, {"time": 2835, "text": "Let me ask you then, sort of statistically, how many alien civilizations are out there in those four phases that you're talking about?"}, {"time": 2846, "text": "When you look up to the stars and you're sipping on some wine and talking to other people with British accents about something intelligent and intellectual, I'm sure."}, {"time": 2859, "text": "Do you think there's a lot of alien civilizations looking back at us and wondering the same?"}, {"time": 2865, "text": "My romantic view of the universe is really taking loans from my logical self."}, {"time": 2872, "text": "So what I'm saying is I have no doubt, I have no idea."}, {"time": 2875, "text": "But having said that, there is no reason to suppose that life is as hard as we first thought it was."}, {"time": 2884, "text": "And so if we just take Earth as a marker, and if I think that life is a much more general phenomena than just our biology, then I think the universe is full of life."}, {"time": 2896, "text": "And the reason for the Fermi paradox is not that they're not out there, it's just that we can't interact with the other life forms because they're so different."}, {"time": 2907, "text": "And I'm not saying that they're necessarily like hasn't depicted in Arrival or other, you know, I'm just saying that perhaps there are very few universal facts in the universe and maybe our technologies are quite divergent."}, {"time": 2927, "text": "And so I think that it's very hard to know how we're gonna interact with alien life."}, {"time": 2931, "text": "You think there's a lot of kinds of life that's possible."}, {"time": 2934, "text": "I guess that was the intuition you provided that the way biology itself, but even this particular kinds of biology that we have on Earth is something that is just one sample of nearly infinite number of other possible, complex, autonomous, self replicating type of things that could be possible."}, {"time": 2960, "text": "And so we're almost unable to see the alternative versions of us, huh?"}, {"time": 2968, "text": "I mean, we'll still be able to detect them, we'll still be able to interact with them, we'll still be able to like which, what's exactly is lost in translation?"}, {"time": 2979, "text": "Why can't we see them?"}, {"time": 2981, "text": "Why can't we talk to them?"}, {"time": 2982, "text": "Because I too have a sense, you put it way more poetically, but it seems both statistically and sort of romantically, it feels like the universe should be teeming with life, like super intelligent life."}, {"time": 3004, "text": "And I just, I sit there and the Fermi paradox is very, it's felt very distinctly by me when I look up at the stars because it's like, it's the same way I feel when I'm driving through New Jersey and listening to Bruce Springsteen and feel quite sad."}, {"time": 3023, "text": "It's like Lucy Kay talks about pulling off to the side of the road and just weeping a little bit."}, {"time": 3027, "text": "I'm almost like wondering like, hey, why aren't you talking to us?"}, {"time": 3033, "text": "It feels lonely, it feels lonely because it feels like they're out there."}, {"time": 3038, "text": "I think that there are a number of answers to that."}, {"time": 3040, "text": "I think the Fermi paradox is perhaps based on the assumption that if life did emerge in the universe, it would be similar to our life and there's only one solution."}, {"time": 3050, "text": "And I think that what we've got to start to do is go out and look for selection detection rather than an evolution detection, rather than life detection."}, {"time": 3061, "text": "And I think that once we start to do that, we might start to see really interesting things."}, {"time": 3067, "text": "And we haven't been doing this for very long and we are living in an expanding universe and that makes the problem a little bit harder."}, {"time": 3075, "text": "Everybody's always leaving distance wise."}, {"time": 3079, "text": "I'm very optimistic that we will, well, I don't know, there are two movies that came out within six months of one another, Ad Astra and Cosmos."}, {"time": 3090, "text": "Ad Astra, the very expensive blockbuster with Brad Pitt in it and saying there is no life and it's all, we've got to, life on Earth has more pressures than Cosmos, which is a UK production, which basically aliens came and visited Earth one day and they were discovered in the UK, right?"}, {"time": 3105, "text": "It was quite, it's a fun film."}, {"time": 3108, "text": "But I really loved those two films."}, {"time": 3110, "text": "And at the same time, those films, at the time those films were coming out, I was working on a paper, a life detection paper, and I found it was so hard to publish this paper and it was almost as depressed, I got so depressed trying to get this science out there that I felt the depression of the film in Ad Astra, like life, there's no life elsewhere in the universe."}, {"time": 3134, "text": "And, but I'm incredibly optimistic that I think we will find life in the universe, firm evidence of life, and it will have to start on Earth, making life on Earth and surprising us."}, {"time": 3144, "text": "We have to surprise ourselves and make non biological life on Earth."}, {"time": 3148, "text": "And then people say, well, you made this life on Earth, therefore it's, you're part of the causal chain of that."}, {"time": 3154, "text": "And that might be true, but if I can show how I'm able to do it with very little cheating or very little information inputs, just creating like a model planet."}, {"time": 3164, "text": "Some description and watching it, watching life emerge, then I think that we will be even to persuade even the hardest critic that it's possible."}, {"time": 3175, "text": "Now, with regards to the Fermi paradox, I think that we might crush that with the JWST."}, {"time": 3181, "text": "It's basically, if I recall correctly, the mirror is about 10 times the size of the Hubble that we're gonna be able to do spectroscopy, look at colors of exoplanets, I think, not brilliantly, but we'll be able to start to classify them."}, {"time": 3195, "text": "And we'll start to get a real feel for what's going on in the universe on these exoplanets."}, {"time": 3201, "text": "Cause it's only in the last few decades, I think, maybe even last decade that we even came to recognize that exoplanets even are common."}, {"time": 3213, "text": "And I think that that gives us a lot of optimism that life is gonna be out there."}, {"time": 3218, "text": "But I think we have to start framing, we have to start preparing the fact that biology is only one solution."}, {"time": 3226, "text": "I can tell you with confidence that biology on Earth does not exist anywhere else in the universe."}, {"time": 3232, "text": "We are absolutely unique."}, {"time": 3234, "text": "Well, okay, I love the confidence, but where does that confidence come from?"}, {"time": 3242, "text": "Chemistry, like how many options does chemistry really have?"}, {"time": 3247, "text": "Many, that's the point."}, {"time": 3248, "text": "And the thing is, this is where the origin of life scam comes in, is that people don't quite count, they don't count the numbers."}, {"time": 3256, "text": "So if biology as you find on Earth is common everywhere, then there's something really weird going on that basically written in the quantum mechanics, there's some kind of these bonds must form over these bonds and this catalyst must form over this catalyst when they're all quite equal."}, {"time": 3270, "text": "Life is contingent."}, {"time": 3271, "text": "The origin of life on Earth was contingent upon the chemistry available at the origin of life on Earth."}, {"time": 3278, "text": "So that means if we want to find other Earth like worlds, we look for the same kind of rocky world."}, {"time": 3285, "text": "We might look in the same zone as Earth and we might expect reasonably to find biological like stuff going on."}, {"time": 3293, "text": "That would be a reasonable hypothesis, but it won't be the same, it can't be."}, {"time": 3297, "text": "It's like saying, I don't believe in magic."}, {"time": 3300, "text": "That's why I'm sure."}, {"time": 3302, "text": "I just don't believe in magic."}, {"time": 3303, "text": "I believe in statistics and I can do experiments."}, {"time": 3306, "text": "And so I won't get the same, exactly the same sequence of events, I'll get something different."}, {"time": 3311, "text": "And so there is TikTok elsewhere in the universe, but it's not the same as our TikTok, right?"}, {"time": 3317, "text": "Which aspect of it is not the same?"}, {"time": 3320, "text": "Well, I just think, so what is TikTok?"}, {"time": 3323, "text": "TikTok is a social media where people upload videos, right?"}, {"time": 3327, "text": "Of silly videos."}, {"time": 3328, "text": "So I guess there might be."}, {"time": 3329, "text": "Well, there's humor, there's attention, there's the ability to process, there's ability for intelligent organisms to collaborate on ideas and find human ideas and play with those ideas, make them viral, memes."}, {"time": 3343, "text": "Humor seems to be kind of fundamental to the human experience."}, {"time": 3346, "text": "And I think that that's a really interesting question we can ask, is humor a fundamental thing in the universe?"}, {"time": 3352, "text": "I think maybe it will be, right?"}, {"time": 3353, "text": "In terms of, you think about in a game theoretic sense, humor, the emergence of humor serves a role in our game engine."}, {"time": 3361, "text": "And so if selection is fundamental in the universe, so is humor."}, {"time": 3366, "text": "Well, I actually don't know exactly what role humor serves."}, {"time": 3372, "text": "Maybe it's like, from a chemical perspective, it's like a catalyst for, I guess it's for several purposes."}, {"time": 3381, "text": "One is the catalyst for spreading ideas on the internet."}, {"time": 3383, "text": "That's modern humor."}, {"time": 3385, "text": "But humor is also a good way to deal with the difficulty of life."}, {"time": 3390, "text": "It's a kind of valve, release valve for suffering."}, {"time": 3395, "text": "Throughout human history, life has been really hard."}, {"time": 3399, "text": "And for the people that I've known in my life who've lived through some really difficult things, humor is part of how they deal with that."}, {"time": 3407, "text": "It's usually dark humor."}, {"time": 3409, "text": "But yeah, it's interesting."}, {"time": 3411, "text": "I don't know exactly what's the more mathematically general way to formulate what the hell is humor."}, {"time": 3418, "text": "What humor does it serve?"}, {"time": 3421, "text": "But I still, we're kind of joking here, but it's a counterintuitive idea to me to think that life elsewhere in the universe is very different than life on Earth."}, {"time": 3437, "text": "And also, like all of each instantiation of life is likely very different from each other."}, {"time": 3446, "text": "Yeah, like maybe there's a few clusters of similar life, but it's much more likely is what you're saying."}, {"time": 3454, "text": "To me, it's a kind of novel thought."}, {"time": 3456, "text": "I'm not sure what to do with it."}, {"time": 3457, "text": "But you're saying that it's more common to be a weird outcast in the full spectrum of life than it is to be in some usual cluster."}, {"time": 3468, "text": "So every instantiation of a kind of chemistry that results in complexity that's autonomous and self replicating however the hell you define life, that is going to be very different every time."}, {"time": 3481, "text": "It feels like a selection is a fundamental kind of directed force in the universe."}, {"time": 3487, "text": "Won't selection result in a few pockets of interesting complexities?"}, {"time": 3493, "text": "I mean, yeah, if we ran Earth over again, over and over and over, you're saying it's going to come up with, there's not going to be elephants every time?"}, {"time": 3506, "text": "Yeah, I don't think so."}, {"time": 3507, "text": "I think that there will be similarities."}, {"time": 3510, "text": "And I think we don't know enough about how selection globally works."}, {"time": 3517, "text": "But it might be that the emergence of elephants was wired into the history of Earth in some way, like the gravitational force, how evolution was going, Cambrian explosions, blah, blah, blah, the emergence of mammals."}, {"time": 3530, "text": "But I just don't know enough about the contingency, the variability."}, {"time": 3534, "text": "All I do know is you count the number of bits of information required to make an elephant and think about the causal chain that provide the lineage of elephants going all the way back to Luca, there's a huge scope for divergence."}, {"time": 3550, "text": "Yeah, but just like you said, with chemistry and selection, the things that result in self replicating chemistry and self replicating organisms, those are extremely unlikely, as you're saying."}, {"time": 3570, "text": "But once they're successful, they multiply."}, {"time": 3573, "text": "So it might be a tiny subset of all things that are possible in the universe, chemically speaking, it might be a very tiny subset is actually successful at creating elephants."}, {"time": 3584, "text": "Or elephant like or slash human like creatures."}, {"time": 3588, "text": "Well, there's two different questions here."}, {"time": 3588, "text": "The first one, if we were to reset Earth and to start again."}, {"time": 3592, "text": "The different phases, sorry to keep interrupting."}, {"time": 3594, "text": "Yeah, no, if we restart Earth and start again, say we could go back to the beginning and do the experiment or have a number of Earths, how similar would biology be?"}, {"time": 3602, "text": "I would say that there would be broad similarities, but the emergence of mammals is not a given unless we're gonna throw an asteroid at each planet at each time and try and faithfully reproduce what happened."}, {"time": 3615, "text": "Then there's the other thing about when you go to another Earth like planet elsewhere, maybe there's a different ratio, particular elements, maybe the bombardment at the beginning of the planet was quicker or longer than Earth."}, {"time": 3630, "text": "And I just don't have enough information there."}, {"time": 3632, "text": "What I do know is that the complexity of the story of life on Earth gives us lots of scope for variation."}, {"time": 3642, "text": "And I just don't think it's a reasonable mathematical assumption to think that life on Earth that happened again would be same as what we have now."}, {"time": 3651, "text": "Okay, but you've also extended that to say that we might, as an explanation for the Fermi paradox, that that means we're not able to interact with them."}, {"time": 3662, "text": "Or that's an explanation for why we haven't at scale heard from aliens is they're different than us."}, {"time": 3670, "text": "We've only been looking for, say, 70, 80 years."}, {"time": 3673, "text": "So I think that the reason we have not found aliens yet is that we haven't worked out what life is."}, {"time": 3680, "text": "No, but the aliens have worked that out, surely."}, {"time": 3685, "text": "Statistically speaking, there must be a large number of aliens that are way ahead of us on this whole life question."}, {"time": 3693, "text": "Unless there's something about this stage of intellectual evolution that often quickly results in nuclear war and destroys itself."}, {"time": 3702, "text": "Like there's something in this process that eventually, I don't know, crystallizes the complexity and it stops, either dies or stops developing."}, {"time": 3715, "text": "But most likely, they already figured it out."}, {"time": 3718, "text": "And why aren't they contacting us?"}, {"time": 3719, "text": "Is it some grad student somewhere?"}, {"time": 3723, "text": "Wants to study a new green planet?"}, {"time": 3726, "text": "Maybe they have."}, {"time": 3727, "text": "I mean, I don't have a coherent answer to your question, other than to say that if there are other aliens out there and they're far more advanced, they might be in contact with each other."}, {"time": 3739, "text": "And they might also, we might be at a point where what I'm saying quite critically is it takes two to talk, right?"}, {"time": 3746, "text": "So the aliens might be there."}, {"time": 3748, "text": "But if we don't have the ability to recognize them and talk to them, then the aliens aren't going to want to talk to us."}, {"time": 3756, "text": "And I think that's a critical point that probably if that's a filter, there needs to be an ability for one to communicate with the other."}, {"time": 3765, "text": "And we need to know what life is before we do that."}, {"time": 3768, "text": "So we haven't qualified to even join the club to have a talk."}, {"time": 3771, "text": "Well, I think they still wanna teach us how to talk, right?"}, {"time": 3774, "text": "But my worry is that, or I think they would wanna teach us how to talk like you do when you meet it."}, {"time": 3784, "text": "Like when you even meet, I was gonna say child, but that's a human species."}, {"time": 3789, "text": "I mean like ant."}, {"time": 3792, "text": "You want to try to communicate with them through whatever devices you can, given what an ant is like."}, {"time": 3799, "text": "I just, I worry mostly about that humans are just too close minded or don't have the right tools."}, {"time": 3805, "text": "No, I'm gonna push back on this quite significantly."}, {"time": 3807, "text": "I would say, because we don't understand what life is and because we don't understand how life emerged in the universe, we don't understand the physics that gave rise to life yet."}, {"time": 3818, "text": "That means our fundamental description, I'm way out of my pay grade, even further out."}, {"time": 3823, "text": "But I'll say it anyway, because I think it's a fun."}, {"time": 3824, "text": "You don't get paid much anyway, as you said earlier."}, {"time": 3827, "text": "So I would say that we, because we don't understand the universe yet, we do not understand how the universe spat out life."}, {"time": 3836, "text": "And we don't know what life is."}, {"time": 3837, "text": "And I think that until we understand that, it is gonna limit our ability to even, we don't qualify to talk to the aliens."}, {"time": 3845, "text": "So I'm gonna say that they might be there, but we just, I'm not gonna say that I believe in interdimensional aliens being present in this room."}, {"time": 3852, "text": "Yeah, but I think you're just being self critical, like we don't qualify."}, {"time": 3855, "text": "I think the fact that we don't qualify qualifies us."}, {"time": 3859, "text": "We're interesting in our innocence."}, {"time": 3862, "text": "No, I'm saying that because we don't understand causal chains and the way that information is propagated in the universe."}, {"time": 3869, "text": "And we don't understand what replication is yet."}, {"time": 3871, "text": "And we don't understand how life emerged."}, {"time": 3875, "text": "I think that we would not recognize aliens."}, {"time": 3878, "text": "And if someone doesn't recognize you, you wouldn't go and talk to it."}, {"time": 3884, "text": "You don't go and talk to ants."}, {"time": 3886, "text": "You don't go and talk to birds or maybe some birds you do, right?"}, {"time": 3889, "text": "Cause you can, there's just enough cognition."}, {"time": 3892, "text": "So I'm saying because we don't have enough, our cognitive abilities are not yet where they need to be."}, {"time": 3898, "text": "We probably haven't been communicating with them."}, {"time": 3900, "text": "So you don't agree with the dating strategy of playing hard to get?"}, {"time": 3904, "text": "Cause us humans, that seems to attract us."}, {"time": 3907, "text": "Within a species, that's fine."}, {"time": 3909, "text": "But I think we don't actually have abstraction."}, {"time": 3911, "text": "No, actually I think in this talk, in this conversation, you've helped me crystallize something that I think has been troubling me for a long time with the thermi paradox."}, {"time": 3920, "text": "I'm pretty sure that a reasonable avenue is to say that you would not go and talk to your cat about calculus, right?"}, {"time": 3931, "text": "But I would still pet it."}, {"time": 3932, "text": "Sure, but I'm not talking about petting a cat."}, {"time": 3934, "text": "The analogy is that the aliens are not going to talk to us because we, and I'm using calculus as analogy for abstraction because we lack the layer, the fundamental layer of understanding what life is and what the universe is in our reality that it would be so counterproductive interacting with intelligent alien species that it would cause more angst for human race."}, {"time": 3960, "text": "Okay, they gotta be self interested."}, {"time": 3963, "text": "So they'll probably, they more care about is it interesting for them?"}, {"time": 3966, "text": "Maybe they, I mean, surely there's a way to pet the cat in this analogy because even if we lack complete understanding, it must be a very frustrating experience for other kinds of intelligence to communicate with us."}, {"time": 3986, "text": "Still, there must be a way to interact with us."}, {"time": 3990, "text": "Like perturb the system in interesting ways to see what these creatures do."}, {"time": 3995, "text": "We might actually find the answer."}, {"time": 3997, "text": "I mean, again, out of my pay grade, in a simulation of the Earth, let's say a simulation where we allow an intelligent AI to emerge, right?"}, {"time": 4007, "text": "And that AI, we then give it the objective is to be curious, interact with other intelligence in its universe."}, {"time": 4016, "text": "And then we might find the parameters required for that AI to walk with."}, {"time": 4022, "text": "And I think you'll find if the AI will not talk to other AIs that don't share the ability to abstract at the level of the AI because it's just a cat and are you gonna travel 20 light years to go and pet a cat?"}, {"time": 4035, "text": "So not because of the inability to do so, but because of like boredom."}, {"time": 4040, "text": "It's more interested, it will start talking to, it will spend most, it will spend a majority of its time talking to other AI systems that can at least somewhat understand and it's much more fun."}, {"time": 4053, "text": "It's a bit like, do we know that plants are conscious?"}, {"time": 4054, "text": "Well, plants are unconscious in the way we typically think, but we don't talk to them."}, {"time": 4057, "text": "They could be, right?"}, {"time": 4058, "text": "Yeah, but there's a lot of people on Earth who like gardening."}, {"time": 4061, "text": "There's always going to be a weird."}, {"time": 4062, "text": "They're not talking, they're just gardening."}, {"time": 4064, "text": "Okay, well, you're not romantic enough to see gardening as a way of communication between humans and plants."}, {"time": 4068, "text": "Oh, okay, you've got me there."}, {"time": 4070, "text": "But there's ways, there's always going to be the people who are curious."}, {"time": 4075, "text": "Jane Goodall who lives with the chimps, right?"}, {"time": 4078, "text": "There's always going to be curious intelligent species that visit the weird Earth planet and try to interact."}, {"time": 4086, "text": "I mean, it's a, yeah, I think it's a super cool idea that you're expressing."}, {"time": 4091, "text": "I just kind of have a sense."}, {"time": 4093, "text": "Maybe it's a hope that there's always going to be a desire to interact even with those that can't possibly understand the depth of what you understand."}, {"time": 4102, "text": "So I'm with you, so I want to be as positive as you that aliens do exist and we will interact with them."}, {"time": 4109, "text": "What I'm trying to do is to give you a reasonable hypothesis why we haven't yet."}, {"time": 4115, "text": "And also something to strive for to be able to do that."}, {"time": 4118, "text": "I mean, you know, there is the other view that the universe is just too big and life is just too rare."}, {"time": 4126, "text": "But I want to come up with an alternative explanation which I think is reasonable and not being philosophically and scientifically thought out, which is this, if you can't actually communicate with the object, the thing competently, you don't even know it's there, then there's no point yet."}, {"time": 4145, "text": "See, I disagree with that, but I'm totally aligned with your hopeful vision, which is like, we need to understand the origin of life."}, {"time": 4151, "text": "It will help us engineer life."}, {"time": 4153, "text": "It will help us engineer intelligent life through perhaps on the computer side through simulation and explore all the ways that life emerges."}, {"time": 4160, "text": "And that will allow us to, I think the fundamental reason we don't see overwhelming amounts of life is I actually believe aliens, of course, these are all just kind of open minded beliefs."}, {"time": 4175, "text": "It's difficult to know for sure about any of this, but I think there's a lot of alien civilizations which are actively communicating with us and we're too dumb."}, {"time": 4185, "text": "We don't have the right tools to see it."}, {"time": 4188, "text": "No, but maybe I misinterpreted you, but I interpreted you to say they kind of tried a few times and they're like, oh God."}, {"time": 4197, "text": "No, no, no, what I'm saying is we, so this goes two ways."}, {"time": 4201, "text": "There could be information out there, but just put in such a way that we just don't understand it yet."}, {"time": 4207, "text": "So sorry if I didn't make that clear."}, {"time": 4209, "text": "I mean, it's not just, I don't think we, I think we qualify as soon as we can decode their signal."}, {"time": 4215, "text": "Right, so when you say qualify, got it, got it."}, {"time": 4217, "text": "So you mean, we're just not smart enough, the word qualify was throwing me off."}, {"time": 4221, "text": "So we're not smart enough to do, it's like we just need to get smarter."}, {"time": 4225, "text": "And there's a lot of people who believe, let me get your opinion on this, about UFO sightings."}, {"time": 4231, "text": "So sightings of weird phenomena that, you know, what does UFO mean?"}, {"time": 4241, "text": "It means it's a flying object and it's not identified clearly at the time of sighting."}, {"time": 4250, "text": "That's what UFO means."}, {"time": 4251, "text": "So it could be a physics phenomena, it could be ball lightning, it could be all kinds of fascinating."}, {"time": 4256, "text": "I was always fascinated with ball lightning as a, like the fact that there could be physical phenomena in this world that are observable by the human eye."}, {"time": 4266, "text": "Of course, all physical phenomena generally are fascinating that really smart people can't explain."}, {"time": 4275, "text": "Cause it's like, wait a minute, especially if you can replicate it, it's like, wait a minute, how does this happen?"}, {"time": 4280, "text": "That's like the precursor to giant discoveries in chemistry and biology and physics and so on."}, {"time": 4285, "text": "But it sucks when those events are super rare, right?"}, {"time": 4289, "text": "Physically, like ball lightning."}, {"time": 4292, "text": "So that's out there."}, {"time": 4294, "text": "And then of course that phenomena could have other interpretations that don't have to do with the physics of chemistry, the biology of earth."}, {"time": 4302, "text": "It could have to do with more extraterrestrial explanations that in large part, thanks to Hollywood and movies and all those kinds of things, captivates the imaginations of millions of people."}, {"time": 4316, "text": "But just because it's science fiction that captivates the imagination of people, it doesn't mean that some of those sightings, all it takes is one."}, {"time": 4325, "text": "One of those sightings is actually a sign that it's extraterrestrial intelligence, that it's object that's not of this particular world."}, {"time": 4337, "text": "Do you think there's a chance that that's the case?"}, {"time": 4338, "text": "What do you make, especially the pilot sightings, what do you make of those?"}, {"time": 4343, "text": "So I agree with there's a chance."}, {"time": 4346, "text": "There's always a chance."}, {"time": 4346, "text": "Any good scientist would have to, or observationist would have to, I want to see if aliens exist come to earth."}, {"time": 4356, "text": "What I know about the universe is I think it's unlikely right now that there are aliens visiting us, but not impossible."}, {"time": 4364, "text": "I think the releases, the dramatization that's been happening politically saying we're gonna release all this information, this classified information."}, {"time": 4374, "text": "I was kind of disappointed because it was just very poor material."}, {"time": 4382, "text": "And right now, the ability to capture high resolution video, everybody is carrying around with them an incredible video device now."}, {"time": 4392, "text": "And we haven't got more compelling data."}, {"time": 4398, "text": "And so that we've just seeing grainy pictures, a lot of hearsay, instrument kind of malfunctions and whatnot."}, {"time": 4407, "text": "And so I think on balance, I think it's extremely unlikely, but I think something really interesting is happening."}, {"time": 4414, "text": "And then also during the pandemic, right?"}, {"time": 4416, "text": "We've all been locked down."}, {"time": 4417, "text": "We all want to have, we want to, our imaginations are running riot."}, {"time": 4422, "text": "And I think that the, I don't think that the information out there has convinced me there are any, anything interesting on the UFO side."}, {"time": 4429, "text": "But what it has made me very interested about is how humanity is opening up its mind to ponder aliens and the mystery of our universe."}, {"time": 4440, "text": "And so I don't want to dissuade people from having those thoughts and say, you're stupid and look at that, it's clearly incorrect."}, {"time": 4446, "text": "That's not right."}, {"time": 4447, "text": "What I would say is that I lack sufficient data, replicated observations to make me go, oh, I'm gonna take this seriously, but I'm really interested by the fact that there is this great deal of interest."}, {"time": 4461, "text": "And I think that it drives me to maybe want to make an artificial life form even more and to help NASA and the Air Force and whoever go and look for things even more, because I think humanity wants to know what's out there."}, {"time": 4476, "text": "There's this yearning, isn't there?"}, {"time": 4478, "text": "Yeah, but I see, I almost, depending on the day, I sometimes agree with you, but with the thing you just said, but one of the disappointing things to me about the sightings, I still hold the belief that a nonzero number of them is an indication of something very interesting."}, {"time": 4506, "text": "So I don't side with the people who say everything can be explained with sensor artifacts kind of thing."}, {"time": 4514, "text": "I didn't say that either."}, {"time": 4515, "text": "I would say I just don't have enough data."}, {"time": 4517, "text": "But the thing I want to push back on is the statement that everybody has a high definition camera."}, {"time": 4523, "text": "One of the disappointing things to me about the report that the government released, but in general, just having worked with government, having worked with people all over is how incompetent we are."}, {"time": 4536, "text": "Like if you look at the response to the pandemic, how incompetent we are in the face of great challenges without great leadership."}, {"time": 4546, "text": "How incompetent we are in the face of the great mysteries before us without great leadership."}, {"time": 4551, "text": "And I just think it's actually, the fact that there's a lot of high definition cameras is not enough to capture the full richness of weird, of the mysterious phenomena out there of which extraterrestrial intelligence visiting Earth could be one."}, {"time": 4568, "text": "I don't think we have, I don't think everybody having a smartphone in their pocket is enough."}, {"time": 4574, "text": "I think that allows for TikTok videos."}, {"time": 4577, "text": "I don't think it allows for the capture of even interesting, relatively rare human events."}, {"time": 4583, "text": "That's not that common."}, {"time": 4585, "text": "It's rare to have been the right moment in the right time to be able to capture the thing."}, {"time": 4590, "text": "I agree, I agree."}, {"time": 4591, "text": "Let me rephrase what I think on this."}, {"time": 4593, "text": "I haven't seen enough information."}, {"time": 4595, "text": "I haven't really actively sorted out."}, {"time": 4597, "text": "I must admit, but I'm with you and I love the idea of anomaly detection in chemistry in particular, right?"}, {"time": 4604, "text": "I want to make anomalies, sorry, or not necessarily make anomalies."}, {"time": 4607, "text": "I want to understand an anomaly."}, {"time": 4610, "text": "Let me give you two from chemistry, which are really quite interesting."}, {"time": 4616, "text": "Phlogiston, going way back, where people said there's this thing called phlogiston."}, {"time": 4622, "text": "And for ages, the alchemists got really this kind of, that fire is the thing."}, {"time": 4629, "text": "And then we determined that phlogiston wasn't what we thought it is."}, {"time": 4633, "text": "Let's go to physics, the ether."}, {"time": 4635, "text": "The ether's a hard one because I think actually the ether might exist."}, {"time": 4638, "text": "And I'll tell you what I think the ether is later."}, {"time": 4644, "text": "Can you explain the ether?"}, {"time": 4645, "text": "So as the vacuum, so the light traveling through the ether in the vacuum, there is some thing that we call the ether that basically mediates the movement of light, say."}, {"time": 4654, "text": "And I think that... And then the other one is cold fusion, which is more of a..."}, {"time": 4659, "text": "So a few years ago, people observed that when they did some electrochemistry, when they were splitting water into hydrogen and oxygen, that you got more energy out than you put in."}, {"time": 4670, "text": "And people got excited and they thought that this was a nuclear reaction."}, {"time": 4674, "text": "And in the end, it was kind of discredited because you didn't detect neutrons and all this stuff."}, {"time": 4679, "text": "But I'm pretty sure..."}, {"time": 4682, "text": "I'm a chemist."}, {"time": 4683, "text": "I'm telling you this on your podcast, but why not?"}, {"time": 4686, "text": "I'm pretty sure there's interesting electrochemical phenomena that's not completely bottomed out yet, that there is something there."}, {"time": 4691, "text": "However, we lack the technology and the experimental design."}, {"time": 4695, "text": "So all I'm saying in your response about aliens is we lack the experimental design to really capture these anomalies."}, {"time": 4702, "text": "And we are encircling the planet with many more detection systems."}, {"time": 4707, "text": "We've got satellites everywhere."}, {"time": 4708, "text": "So there is, I do hope that we are gonna discover more anomalies."}, {"time": 4712, "text": "And remember that the solar system isn't just static in space, it's moving through the universe."}, {"time": 4719, "text": "So there's just more and more chance."}, {"time": 4720, "text": "I'm not what with Avi Loeb."}, {"time": 4722, "text": "He's generating all sorts of kind of a cult, I would say, with this, but I'm not against him."}, {"time": 4730, "text": "I think there is a finite chance if there are aliens in the universe that we're gonna happen upon them because we're moving through the universe."}, {"time": 4736, "text": "What's the nature of the following that Avi Loeb has?"}, {"time": 4739, "text": "He's doubling down more and more and more and say there are aliens, interdimensional aliens and everything else, right?"}, {"time": 4744, "text": "He's gone from space junk accelerating out of to interdimensional stuff in a very short space of time."}, {"time": 4752, "text": "He's obviously bored."}, {"time": 4755, "text": "Or he wants to tap into the psyche and understand."}, {"time": 4758, "text": "And he's playfully kind of trying to interact with society and his peers to say, stop saying it's not possible."}, {"time": 4766, "text": "Which I agree with, we shouldn't do that."}, {"time": 4768, "text": "But we should frame it statistically in the same way we should frame everything as good scientists, statistically."}, {"time": 4774, "text": "Yeah, good scientists."}, {"time": 4780, "text": "Recently, the idea of good scientists is, I take quite skeptically."}, {"time": 4787, "text": "I've been listening to a lot of scientists tell me about what is good science."}, {"time": 4793, "text": "Because you've been interviewing what I would consider a lot of really good scientists."}, {"time": 4797, "text": "A lot of great thinkers."}, {"time": 4799, "text": "And most of the people I talk to are incredible human beings."}, {"time": 4803, "text": "But there's a humility that's required."}, {"time": 4805, "text": "Science is not, science cannot be dogmatism."}, {"time": 4810, "text": "Sure, I agree."}, {"time": 4811, "text": "I mean, authority, like a PhD does not give you authority."}, {"time": 4817, "text": "A lifelong pursuit of a particular task does not give you authority."}, {"time": 4821, "text": "You're just as lost in clues as everybody else."}, {"time": 4824, "text": "But you're more curious and more stubborn."}, {"time": 4827, "text": "So that's a nice quality to have."}, {"time": 4829, "text": "But overall, just using the word science and statistics can often, as you know, kind of become a catalyst for dismissing new ideas, out of the box ideas, wild ideas, all that kind of stuff."}, {"time": 4852, "text": "I think that, so I like to, some people find me extremely annoying in science because I'm basically, I'm quite rude and disruptive."}, {"time": 4864, "text": "Not in a rude, you know, some up to people and say they're ugly or stupid or anything like that."}, {"time": 4868, "text": "I just say, you know, you're wrong."}, {"time": 4872, "text": "Or why do you think this?"}, {"time": 4873, "text": "And something, a gift I got given by society when I was very young, because I was in the learning difficulties class at school is I was told I was stupid."}, {"time": 4882, "text": "And so I know I'm stupid, but I always wanted to be smart, right?"}, {"time": 4886, "text": "I remember going to school going, maybe today they're going to tell me I'm not as stupid as I was yesterday."}, {"time": 4892, "text": "And I was always disappointed, always."}, {"time": 4894, "text": "And so when I went into academia and everyone says, you're wrong, I was like, join the queue."}, {"time": 4900, "text": "Because it allowed me to walk through the wall."}, {"time": 4903, "text": "So I think that people like to always imagine science as a bit like living in a Japanese house, the paper walls, and everyone sits in their room."}, {"time": 4912, "text": "And I annoy people because I walk straight through the wall."}, {"time": 4914, "text": "Not because, why should I be a chemist and not a mathematician?"}, {"time": 4918, "text": "Why should I be a mathematician and not a computer scientist?"}, {"time": 4920, "text": "Because if the problem requires us to walk through those walls, but I like walking through the walls."}, {"time": 4928, "text": "But as long, then I have to put up, you know, I have to do good science."}, {"time": 4932, "text": "I have to win the people in those rooms across by good science, by taking their criticisms and addressing them head on."}, {"time": 4941, "text": "And I think we must do that."}, {"time": 4942, "text": "And I think that I try and do that in my own way."}, {"time": 4945, "text": "And I kind of love walking through the walls."}, {"time": 4949, "text": "And it gives me, it's difficult for me personally."}, {"time": 4953, "text": "It's quite painful, but it always leads to a deeper understanding of the people I'm with."}, {"time": 4959, "text": "In particular, you know, the arguments I have with all sorts of interesting minds, because I want to solve the problem, or I want to understand more about why I exist."}, {"time": 4969, "text": "You know, that's it really."}, {"time": 4972, "text": "And I think we have to not dismiss science on that basis."}, {"time": 4975, "text": "I think we can work with science."}, {"time": 4978, "text": "No, science is beautiful, but humans with egos and all those kinds of things can sometimes misuse good things, like social justice, like all ideas we're all aspire to misuse these beautiful ideas to manipulate people, to all those kinds of things."}, {"time": 5000, "text": "And that's, there's assholes in every space and walk of life, including science."}, {"time": 5006, "text": "Yeah, yeah, yeah, of course."}, {"time": 5007, "text": "And those are no good."}, {"time": 5009, "text": "The scientific method has proven to be quite useful."}, {"time": 5014, "text": "That said, for difficult questions, for difficult explanations for rare phenomena, you have to walk cautiously."}, {"time": 5027, "text": "Because the scientific method, when you totally don't understand something, and it's rare, and you can't replicate it, doesn't quite apply."}, {"time": 5037, "text": "Yeah, yeah, yeah, that's it."}, {"time": 5039, "text": "The challenge is to not dismiss the anomaly because you can't replicate it."}, {"time": 5043, "text": "I mean, we can talk about this."}, {"time": 5045, "text": "This is something I realized when we were developing assembly theory."}, {"time": 5050, "text": "People thinking that the track they're on is so dogmatic, but there is this thing that they see, but they don't see."}, {"time": 5059, "text": "And it takes a bit of time and you just have to keep reframing it."}, {"time": 5061, "text": "And my approach is to say, well, why can't this be right?"}, {"time": 5065, "text": "Why must we accept that RNA is the only way into life?"}, {"time": 5069, "text": "I mean, who said?"}, {"time": 5070, "text": "Does RNA have a special class of information that's encoded in the universe?"}, {"time": 5077, "text": "No, of course it doesn't, right?"}, {"time": 5078, "text": "RNA is not a special molecule in the space of all the other molecules."}, {"time": 5082, "text": "But it's so elegant and simple and it works so well for the evolutionary process that we kind of use that as an intuition to explain that that must be the only way to have life."}, {"time": 5093, "text": "But you mentioned assembly theory."}, {"time": 5095, "text": "Well, first let me pause, bathroom break, needed?"}, {"time": 5097, "text": "Yeah, let's take two minutes."}, {"time": 5099, "text": "We took a quick break and offline, you mentioned to me that you have a lab in your home."}, {"time": 5108, "text": "And then I said that you're basically Rick from Rick and Morty, which is something I've been thinking this whole conversation."}, {"time": 5115, "text": "And then you say that there's a glowing pickle that you used something involving cold plasma, I believe."}, {"time": 5123, "text": "I don't know, but can you explain the glowing pickle situation?"}, {"time": 5131, "text": "And is there many, arbitrarily many versions of you in alternate dimensions that you're aware of?"}, {"time": 5137, "text": "I tried to make an electrochemical memory at home using a pickle and the only way I could get any traction with it was actually by plugging it into a very high voltage alternating current and then putting in a couple of electrodes."}, {"time": 5153, "text": "But my kids weren't impressed."}, {"time": 5154, "text": "They're not impressed with anything I do, any experiments I do at home."}, {"time": 5157, "text": "I think it's quite funny."}, {"time": 5158, "text": "But you connected a pickle to some electrode."}, {"time": 5161, "text": "240 volts, yeah, AC."}, {"time": 5163, "text": "And then had a couple of electrodes on it."}, {"time": 5164, "text": "So what happens is a pickle, this is a classic thing you do."}, {"time": 5169, "text": "I mean, I shouldn't, pranks you do, you put a pickle into the mains and just leave it, run away and leave it."}, {"time": 5175, "text": "And what happens is it starts to decompose."}, {"time": 5177, "text": "It heats up and then explodes because the water turns to steam and it just violently explodes."}, {"time": 5182, "text": "But I wondered if I could cause the iron, sodium, potassium ions in the pickle to migrate."}, {"time": 5187, "text": "It'd been in a jar, right?"}, {"time": 5188, "text": "So it'd been in a brine."}, {"time": 5191, "text": "That was, yeah, that was not my best experiment."}, {"time": 5194, "text": "So I've done far better experiments in my lab at home."}, {"time": 5196, "text": "At that time it was a failed experiment, but you never know, it could, every experiment is a successful experiment if you stick with it long enough."}, {"time": 5206, "text": "Well, I mean, I get, I got kicked out of my own lab by my research team many years ago and for good reason."}, {"time": 5210, "text": "I mean, my team is brilliant and I used to go and just break things."}, {"time": 5213, "text": "So what I do do at home is I have a kind of electronics workshop and I prototype experiments there."}, {"time": 5221, "text": "Then I try and then I try and suggest to my team sometimes, maybe we can try this thing."}, {"time": 5227, "text": "And they would just say, oh, wow, that's not gonna work because of this."}, {"time": 5230, "text": "And I'll say, aha, but actually I've tried and here's some code and here's some hardware."}, {"time": 5234, "text": "Can we have a go?"}, {"time": 5235, "text": "So I'm doing that less and less now as I get even more busy, but that's quite fun because they feel that we're in the experiment together."}, {"time": 5244, "text": "You do, in fact, brilliantly, just like Rick from Rick and Morty, connect up chemistry with computation."}, {"time": 5258, "text": "And when we say chemistry, we don't mean the simulation of chemistry, a modeling of chemistry."}, {"time": 5266, "text": "We mean chemistry in the physical space as well as in the digital space, which is fascinating."}, {"time": 5274, "text": "But first you mentioned assembly theory."}, {"time": 5276, "text": "So we'll stick on theory in these big ideas."}, {"time": 5280, "text": "I would say revolutionary ideas, this intersection between mathematics and philosophy."}, {"time": 5287, "text": "What is assembly theory?"}, {"time": 5289, "text": "And generally speaking, how would we recognize life if we saw it?"}, {"time": 5295, "text": "So assembly theory is a theory, goes back a few years now in my struggle for maybe almost 10 years when I was going to origin of life conferences and artificial life conferences, where I thought that everybody was dancing around the problem of what life is and what it does."}, {"time": 5312, "text": "But I'll tell you about what assembly theory is because I think it's easier."}, {"time": 5315, "text": "So assembly theory literally says if you take an object, any given object, and you are able to break the object into parts very gently."}, {"time": 5323, "text": "So just maybe let's say take a piece of very intricate Chinese porcelain and you tap it just with a hammer or the nail at some point, and it will fragment into many parts."}, {"time": 5334, "text": "And if that object is able to fragment into many, and you count those parts, the different parts, so they're unsymmetrical, assembly theory says the larger the number of parts, unsymmetrical parts that object has, the more likely it is that object has been created by an evolutionary or information process, especially if that object is not one off, you've got an abundance of them."}, {"time": 5363, "text": "So because what I'm literally saying about the abundance, if you have a one off object and you break it into parts and it has lots of parts, you'd say, well, that could be incredibly intricate and complex, but it could be just random."}, {"time": 5379, "text": "And I was troubled with this for years because I saw in reality that assembly theory works."}, {"time": 5384, "text": "But when I talked to very good computational complexity computation lists, algorithmic complexity people, they said, you haven't really done this properly."}, {"time": 5394, "text": "It's like, this is the random problem."}, {"time": 5397, "text": "And so I kept working this up because I invented an assembly theory in chemistry, first of all, with molecules."}, {"time": 5405, "text": "And so the thought experiment was, how complex does a molecule need to be when I find it that it couldn't possibly have risen by chance, probabilistically."}, {"time": 5415, "text": "And if I found this molecule, able to detect it enough quantities in the same object, like a machine, like a mass spectrometer."}, {"time": 5420, "text": "So typically in a mass spectrometer, you weigh the molecules in electric field."}, {"time": 5424, "text": "You probably have to have all the order of 10,000 identical molecules to get a signal."}, {"time": 5428, "text": "So 10,000 identical molecules that are complex."}, {"time": 5432, "text": "What is the chance of them occurring by chance?"}, {"time": 5436, "text": "Well, we can do the math."}, {"time": 5437, "text": "Let's take a molecule like strychnine or, yeah, so strychnine is a good molecule actually to take or Viagra is a good molecule."}, {"time": 5446, "text": "I made jokes about Viagra because it's a complex molecule."}, {"time": 5449, "text": "And one of my friends said, yeah, if we find Viagra on Mars in detectable quantities, we know something is up."}, {"time": 5454, "text": "And yeah, but anyway, it's a complex molecule."}, {"time": 5460, "text": "So what you do is you take this molecule in the mass spectrometer and you hit it with some electrons or in electric field and it breaks apart."}, {"time": 5466, "text": "And if the larger the number of different parts, you know when it starts to get refreshed, my idea was that that molecule could not be created by chance, probabilistically."}, {"time": 5477, "text": "So that was where assembly theory was born in an experiment, in a mass spec experiment."}, {"time": 5482, "text": "And I was thinking about this because NASA is sending mass spectrometers to Mars, to Titan, it's gonna send them to Europa."}, {"time": 5489, "text": "There's gonna be a nuclear powered mass spectrometer going to Titan."}, {"time": 5493, "text": "I mean, this is the coolest experiment ever."}, {"time": 5495, "text": "They're not only sending a drone that's gonna fly around Titan, it's gonna be powered by a nuclear slug, a nuclear battery, and it's gonna have a mass spectrometer on it."}, {"time": 5505, "text": "Is this already launched?"}, {"time": 5507, "text": "No, it's Dragonfly and it's gonna be launched in a few years."}, {"time": 5510, "text": "I think it got pushed a year because of the pandemic."}, {"time": 5513, "text": "So I think it's three or four years."}, {"time": 5515, "text": "Dragonfly, nuclear Dragonfly is going to fly to Titan and collect data about the composition of the various chemicals on Titan."}, {"time": 5529, "text": "Yeah, I'm trying to convince NASA."}, {"time": 5531, "text": "I don't know if I'll be able to convince the Dragonfly team that they should apply this approach, but they will get data."}, {"time": 5538, "text": "And depending on how good their mass spectrometer is."}, {"time": 5540, "text": "But I had this thought experiment anyway, and I did this thought experiment."}, {"time": 5544, "text": "And for me, it seemed to work."}, {"time": 5546, "text": "I turned the thought experiment into an algorithm in assembly theory."}, {"time": 5550, "text": "And I basically, assembly theory, if I take, let's just make it generic."}, {"time": 5553, "text": "And so let's just take the word abracadabra."}, {"time": 5556, "text": "Say, can I, if you find the word, so if you have a book with lots of words in it and you find abracadabra one off, and it's a rap book that's been written by, in a random way, set of monkeys in a room."}, {"time": 5568, "text": "And you're on typewriters."}, {"time": 5570, "text": "And you find one off abracadabra, no big deal."}, {"time": 5572, "text": "But if you find lots of recurrences of abracadabra, well, that means something weird is going on."}, {"time": 5577, "text": "But let's think about the assembly number of abracadabra."}, {"time": 5580, "text": "So abracadabra has a number of letters in it."}, {"time": 5584, "text": "You can break it down."}, {"time": 5585, "text": "So you just cut the letters up."}, {"time": 5587, "text": "But when you actually reassemble abracadabra, the minimum number of ways of organizing those letters."}, {"time": 5592, "text": "So you'd have an A, a B, and keep going up."}, {"time": 5598, "text": "When you cut abracadabra up into parts, you can put it together again in seven steps."}, {"time": 5604, "text": "That means if you basically don't, you're allowed to reuse things you make in a chain at the beginning."}, {"time": 5610, "text": "That's the memory of the universe, the process that makes abracadabra."}, {"time": 5615, "text": "And because of that causal chain, you can then get to abracadabra quicker than the number of letters for having to specify only in seven."}, {"time": 5623, "text": "So if you take that to a molecule and you cut the molecule up into parts, and you can, on the causal chain, and you basically start with the atoms and then bonds, and then you randomly add on those parts to make the A, make the B, and keep going all the way up, I found that literally, assembly theory allows me to say how compressed a molecule is."}, {"time": 5644, "text": "So when there's some information in there."}, {"time": 5647, "text": "And I realized assembly theory isn't just confined to molecular space."}, {"time": 5653, "text": "It can apply to anything."}, {"time": 5654, "text": "But let me finish the molecular argument."}, {"time": 5656, "text": "So what I did is I had this theory."}, {"time": 5658, "text": "I, with one of my students, we wrote an algorithm."}, {"time": 5662, "text": "We basically took the 20 million molecules from a database and we just calculate their assembly number."}, {"time": 5668, "text": "And that's the index."}, {"time": 5669, "text": "Like basically, if I take a molecule and I cut it up into bonds, what is the minimum number of steps I need to take to reform that molecule from atoms?"}, {"time": 5679, "text": "So reusability of previously formed things is somehow a fundamental part of what it is."}, {"time": 5683, "text": "Exactly, it's like a memory in the universe, right?"}, {"time": 5686, "text": "I'm making lots of leaps here."}, {"time": 5687, "text": "Like, it's kind of weird."}, {"time": 5688, "text": "I'm saying, right, there's a process that can form the A and the B and the C, let's say."}, {"time": 5693, "text": "And then because we've formed A and B before, we can use A and B again with no extra cost except one unit."}, {"time": 5700, "text": "So that's the kind of what the chain of events."}, {"time": 5702, "text": "And that's how you think about memory here when you say the universe, when you talk about the universe or life is the universe creating memory."}, {"time": 5712, "text": "So we went through chemical space and we looked at the assembly numbers."}, {"time": 5716, "text": "We were able to classify it."}, {"time": 5718, "text": "So, okay, let's test it."}, {"time": 5721, "text": "So we're able to take a whole bunch of molecules and assign an assembly index to them, okay?"}, {"time": 5727, "text": "And it's just a function of the number of bonds in the molecule and how much symmetry."}, {"time": 5732, "text": "So literally assembly theory is a measure of how little symmetry a molecule has."}, {"time": 5737, "text": "And so the more asymmetry, the more information, the more weird it is, like a Jackson Pollock of some description."}, {"time": 5744, "text": "So I then went and did a load of experiments."}, {"time": 5747, "text": "And I basically took those molecules, I cut them up in the mass spec and measured the number of peaks without any knowledge of the molecule."}, {"time": 5755, "text": "And we found the assembly number, there was almost not quite a one to one correlation, but almost because not all bonds are equal."}, {"time": 5762, "text": "They have different energies."}, {"time": 5763, "text": "I then did this using two other spectroscopic techniques, NMR, nuclear magnetic resonance, which uses radio frequency to basically jangle the molecules and get a signature out."}, {"time": 5773, "text": "And I also used infrared."}, {"time": 5775, "text": "And infrared and NMR almost gave us a one to one correlation."}, {"time": 5778, "text": "So what am I saying?"}, {"time": 5779, "text": "Saying by taking a molecule and doing either infrared or NMR or mass spec, I can work out how many parts there are in that molecule and then put it on a scale."}, {"time": 5792, "text": "And what we did in the next part of the work is we took molecules randomly from the environment, from outer space, from all around earth, from the sea, from Antarctica, and from fossils and so on."}, {"time": 5807, "text": "And even NASA, because they didn't believe us, blinded some samples."}, {"time": 5811, "text": "And we found that all these samples that came from biology produced molecules that had a very high assembly number above a threshold of about 15."}, {"time": 5822, "text": "So basically all the stuff that came from an ebiotic origin was low."}, {"time": 5828, "text": "There was no complexity there."}, {"time": 5830, "text": "So we suddenly realized that on earth at least, there is a cutoff that natural phenomena cannot produce molecules that need more than 15 steps to make them."}, {"time": 5841, "text": "So I realized that this is a way to make a scale of life, a scale of technology as well."}, {"time": 5847, "text": "And literally you could just go sniffing for molecules off earth, on Titan, on Mars."}, {"time": 5853, "text": "And when you find a molecule in the mass spectrometer that gives you more than 15 parts, you'll know pretty much for sure that it had to be produced by evolution."}, {"time": 5863, "text": "And this allowed me to come up with a general definition of life based on assembly theory, to say that if I find an object that has a large number of parts, say an iPhone or Boeing 747, or any complex object and I can find it in abundance and cut it up, I can tell you whether that has been produced by an informational process or not."}, {"time": 5884, "text": "And that's what assembly theory kind of does."}, {"time": 5887, "text": "But it goes a bit further."}, {"time": 5889, "text": "I then realized that this isn't just about life, it's about causation."}, {"time": 5894, "text": "So actually it tells you about whether it's a causal structure."}, {"time": 5897, "text": "So now I can look at objects in the universe, say that again, this cup and say, right, I'm gonna look at how many independent parts it has."}, {"time": 5903, "text": "So that's the assembly number."}, {"time": 5905, "text": "I'll then look at the abundance, how many cups?"}, {"time": 5908, "text": "There are two on this table, maybe there's a few more you got stashed away."}, {"time": 5911, "text": "So assembly is a function of the complexity of the object times the number of copy numbers of that object or a function of the copy number normalized."}, {"time": 5921, "text": "So I realized there's a new quantity in the universe."}, {"time": 5925, "text": "You have energy, entropy, and assembly."}, {"time": 5929, "text": "So assembly, the way we should think about that is how much reusability there is."}, {"time": 5935, "text": "Because reusability is like, can you play devil's advocate to this?"}, {"time": 5939, "text": "So could this just be a nice tertiary signal for living organisms?"}, {"time": 5950, "text": "Like some kind of distant signal that's, yeah, this is a nice property, but it's not capturing something fundamental."}, {"time": 5957, "text": "Or do you think reusability is something fundamental to life and complex organisms?"}, {"time": 5962, "text": "I think reusability is fundamental in the universe, not just for life and complex organisms."}, {"time": 5967, "text": "It's about causation."}, {"time": 5969, "text": "So I think assembly tells you if you find objects, cause you can do this with trajectories as well."}, {"time": 5975, "text": "You think about it, that the fact there are objects in the universe on earth is weird."}, {"time": 5983, "text": "You think about it, we should just have a combinatorial explosion of stuff."}, {"time": 5987, "text": "The fact that not everything exists is really weird."}, {"time": 5993, "text": "Now then."}, {"time": 5994, "text": "And then as I'm looking at two mugs and two water bottles and the things that exist kind of are similar and multiply in copies of each other."}, {"time": 6008, "text": "So I would say that assembly allows you to do something that statistical mechanics and people looking at entropy have got stuck with for a while."}, {"time": 6016, "text": "So I'm making, it's pretty bold."}, {"time": 6018, "text": "I mean, I'm writing a paper with Sarah Walker on this at the moment."}, {"time": 6021, "text": "And we're realizing, we don't want to get ahead of ourselves because I think that there's lots of ways where this is, you know, it's a really interesting idea."}, {"time": 6030, "text": "It works for molecules and it appears to work for any objects produced by causation."}, {"time": 6035, "text": "Cause you can take a motor car, you can look at the assembly of the motor car, look at a book, look at the assembly of the book."}, {"time": 6039, "text": "Assembly theory tells you there's a way of compressing and reusing."}, {"time": 6043, "text": "And so when people, I talk to information theorists, they say, oh, this is just logical depth."}, {"time": 6048, "text": "I say, it is like logical depth, but it's experimentally measurable."}, {"time": 6053, "text": "They say, oh, it's a bit like Komogolov complexity."}, {"time": 6055, "text": "And so, but it's computable."}, {"time": 6059, "text": "And now, okay, it's not infinitely computable, gets MP hard very quickly, right?"}, {"time": 6062, "text": "It's very hard problem when you could get, but it's a computable enough, you could tractable enough to be able to tell the difference between a molecule that's been formed by the random background and by causation."}, {"time": 6073, "text": "And I think that that's really interesting because until now there's no way of measuring complexity objectively."}, {"time": 6081, "text": "Complexity has required algorithmic comparisons and programs and human beings to label things."}, {"time": 6090, "text": "Assembly is label free."}, {"time": 6092, "text": "Well, not entirely."}, {"time": 6094, "text": "We can talk about what that means in a minute."}, {"time": 6097, "text": "Okay, my brain has been broken a couple of times here."}, {"time": 6102, "text": "I'm sorry I explained it really badly."}, {"time": 6103, "text": "No, it was very well explained."}, {"time": 6105, "text": "It was just fascinating."}, {"time": 6105, "text": "And it's, my brain is broken into pieces and I'm trying to assemble it."}, {"time": 6113, "text": "So MP hard."}, {"time": 6115, "text": "So when you have a molecule, you're trying to figure out, okay, if we were to reuse parts of this molecule, which parts can we reuse as an optimization problem, and be hard to figure out the minimum amount of reused components that will create this molecule."}, {"time": 6138, "text": "And it becomes difficult when you start to look at a huge, huge molecules, arbitrarily large."}, {"time": 6143, "text": "Cause I'm also like mapping this."}, {"time": 6145, "text": "Can I think about this in complexity generally, like looking at a cellular automata system and saying like, what's the, can this be used as a measure of complexity for like a arbitrarily complicated system?"}, {"time": 6158, "text": "Yeah, I think it can."}, {"time": 6161, "text": "And I think that the question is, and what's the benefit?"}, {"time": 6163, "text": "Cause there's plenty of, I mean, in computer science and mathematics and in physics, people have been really seriously studying complexity for a long time."}, {"time": 6173, "text": "And I think there's a really interesting problems of where we course grade and we lose information."}, {"time": 6178, "text": "And all assembly theory does really, assembly theory just explains weak emergence."}, {"time": 6183, "text": "And so what assembly theory says, look, going from the atoms that interact, those first replicators that build one another, assembly at the minimal level just tells you evidence that there's been replication and selection."}, {"time": 6197, "text": "And I think the more selected something is, the higher the assembly."}, {"time": 6202, "text": "And so we were able to start to know how to look for selection in the universe."}, {"time": 6207, "text": "If you go to the moon, there's nothing a very high assembly on the moon except the human artifacts we've left there."}, {"time": 6212, "text": "So again, let's go back to the sandbox."}, {"time": 6216, "text": "In assembly theory says, if all the sand grains could stick together, that's the infinite combinatorial explosion in the universe, that should be the default."}, {"time": 6224, "text": "We don't have that."}, {"time": 6225, "text": "Now let's assemble sand grains together and do them in every possible way."}, {"time": 6231, "text": "So we have a series of minimal operations that can move the sand together."}, {"time": 6236, "text": "But all that doesn't exist either."}, {"time": 6237, "text": "Now, because we have specific memory where we say, well, we're gonna put three sand grains in line or four and make a cross or a triangle or something unsymmetrical."}, {"time": 6245, "text": "And once we've made the triangle and the unsymmetrical thing, we remember that, we can use it again, cause on that causal chain."}, {"time": 6250, "text": "So what assembly theory allows you to do is go to the actual object that you exist, you find in space."}, {"time": 6256, "text": "And actually the way you get there is by disassembling."}, {"time": 6258, "text": "It's disassembly theory works by disassembling objects you have and understanding the steps to create them."}, {"time": 6267, "text": "And it works for molecules beautifully cause you just break bonds."}, {"time": 6271, "text": "But like you said, it's very difficult."}, {"time": 6273, "text": "It's a difficult problem to figure out how to break them apart."}, {"time": 6276, "text": "For molecules, it's easy."}, {"time": 6277, "text": "If you just keep low enough in molecular weight space, it's good enough."}, {"time": 6281, "text": "So it's a complete theory."}, {"time": 6283, "text": "When we start to think about objects, we can start to assign, we can start to think about things at different levels, different atoms, what you assign as your atom."}, {"time": 6291, "text": "So in a molecule, the atom, this is really confusing cause the word atom, I mean smallest breakable part."}, {"time": 6297, "text": "So in a molecule, the atom is the bond cause you break bonds, not atoms, right?"}, {"time": 6302, "text": "So in a car, the atom might be, I don't know, a small amount of iron or the smallest reusable part, a rivet, a piece of plastic or something."}, {"time": 6313, "text": "So you gotta be really careful."}, {"time": 6314, "text": "In a microprocessor, the atoms might be transistors."}, {"time": 6318, "text": "And so the amount of assembly that something has is a function, you have to look at the atom level."}, {"time": 6326, "text": "What are your parts?"}, {"time": 6328, "text": "What are you counting?"}, {"time": 6329, "text": "That's one of the things you get to choose."}, {"time": 6330, "text": "What is, at what scale is the atom?"}, {"time": 6332, "text": "What is the minimal thing?"}, {"time": 6334, "text": "I mean, there's a huge amounts of trade offs in when you approach a system and try to analyze."}, {"time": 6339, "text": "Like if you approach Earth, you're an alien civilization trying to study Earth, what is the atom for trying to measure the complexity of life?"}, {"time": 6348, "text": "Is it, are humans the atoms?"}, {"time": 6350, "text": "I would say to start with, you just use molecules."}, {"time": 6353, "text": "I can say for sure, if there are molecules of sufficient complexity on Earth, then I know that life has made them."}, {"time": 6359, "text": "And then go further and show technology."}, {"time": 6361, "text": "There are molecules that exist on Earth that are not possible even by biology."}, {"time": 6366, "text": "You needed technology and you needed microprocessors to get there."}, {"time": 6369, "text": "So that's really cool."}, {"time": 6371, "text": "And that there's a correlation between that, between the coolness of that and assembly number, whatever the measure."}, {"time": 6379, "text": "What's the, what would you call the measure?"}, {"time": 6381, "text": "Assembly index."}, {"time": 6382, "text": "Yeah, assembly index."}, {"time": 6383, "text": "So there are three kind of fundamental kind of labels we have."}, {"time": 6386, "text": "So there's the quantity of assembly and the assembly, so if you have a box, let's just have a box of molecules."}, {"time": 6392, "text": "So I'm gonna have my box."}, {"time": 6394, "text": "We count the number of identical molecules and then we chop each molecule up in an individual molecule class and calculate the assembly number."}, {"time": 6402, "text": "So basically you then have a function that sums over all the molecules for each assembly and then you divide through."}, {"time": 6410, "text": "So you make it divide through by the number of molecules."}, {"time": 6414, "text": "So that's the assembly index for the box?"}, {"time": 6416, "text": "So that will tell you the amount of assembly in the box."}, {"time": 6418, "text": "So basically the assembly equation we come up with is like basically the sum of e to the power of the assembly index for molecule i times the number of copies of the molecule i and then you normalize."}, {"time": 6431, "text": "So you sum them all up and then normalize."}, {"time": 6433, "text": "So some boxes are gonna be more assembled than others."}, {"time": 6436, "text": "Yeah, that's what they tell me."}, {"time": 6437, "text": "So if you were to look at me as a box, so say I'm a box, am I assembling my parts?"}, {"time": 6443, "text": "In terms of like, how do you know, what's my assembly index?"}, {"time": 6447, "text": "So I've been gentle."}, {"time": 6448, "text": "So let's just, we'll talk about the molecules in you."}, {"time": 6450, "text": "So let's just take a pile of sand the same way as you and I would take you and just cut up all the molecules."}, {"time": 6460, "text": "I mean, and look at the number of copies and assembly number."}, {"time": 6463, "text": "So in sand, let's say there's probably gonna be nothing more than assembly number of two or three, but there might be trillions and trillions of sand grains."}, {"time": 6471, "text": "In your body, there might be, the assembly number is gonna be higher, but there might not be as quite as many copies because the molecular weight is higher."}, {"time": 6481, "text": "So you do wanna average it out."}, {"time": 6483, "text": "You can average, you do average it."}, {"time": 6484, "text": "I'm not defined by the most impressive molecules."}, {"time": 6487, "text": "No, no, you're an average in your volume."}, {"time": 6488, "text": "Well, I mean, we're just working this out, but what's really cool is you're gonna have a really high assembly."}, {"time": 6495, "text": "The sand will have a very low assembly."}, {"time": 6496, "text": "Your causal power is much higher."}, {"time": 6499, "text": "You get to make decisions, you're alive, you're aspiring."}, {"time": 6502, "text": "Assembly says something about causal power in the universe."}, {"time": 6506, "text": "And that's not supposed to exist because physicists don't accept that causation exists at the bottom."}, {"time": 6513, "text": "So I understand at the chemical level why the assembly causes causation."}, {"time": 6517, "text": "Why is it causation?"}, {"time": 6518, "text": "Because it's capturing the memory."}, {"time": 6521, "text": "Capturing memory, but there's not an action to it."}, {"time": 6525, "text": "So I'm trying to see how it leads to life."}, {"time": 6531, "text": "Well, it's what life does."}, {"time": 6532, "text": "So I think it's, we don't know."}, {"time": 6537, "text": "What is life versus what does life do?"}, {"time": 6540, "text": "Yeah, so that's, this is the definition of life."}, {"time": 6542, "text": "The only definition we need, right?"}, {"time": 6544, "text": "The assembly index."}, {"time": 6545, "text": "It's basically that life is able to create objects in abundance that are so complex, the assembly number is so high, they can't possibly be formed in an environment where there's just random interactions."}, {"time": 6561, "text": "So suddenly you can put life on a scale."}, {"time": 6564, "text": "And then life doesn't exist actually in that camp."}, {"time": 6567, "text": "It's just how evolved you are."}, {"time": 6570, "text": "And you as an object, because you have incredible causal power, you could go and, you can go and, you know, launch rockets or build cars or create drugs, or, you know, you can do so many things."}, {"time": 6586, "text": "You can build stuff, build more artifacts that show that you have had causal power."}, {"time": 6592, "text": "And that causal power was this kind of a lineage."}, {"time": 6595, "text": "And I think that over time, I've been realizing that physics as a discipline has a number of problems associated with it."}, {"time": 6604, "text": "Me as a chemist, it's kind of interesting that assembly theory, and I'm really, you know, I want to maintain some credibility in the physicists eyes, but I have to push them because they, physics is a really good discipline."}, {"time": 6617, "text": "It's reduced the number, physics is about reducing the belief system, but they're down to some things in their belief system, which is kind of really makes me kind of grumpy."}, {"time": 6627, "text": "Number one is requiring order at the beginning of the universe magically."}, {"time": 6631, "text": "We don't need that."}, {"time": 6632, "text": "The second is the second law."}, {"time": 6634, "text": "Well, we don't actually need that."}, {"time": 6637, "text": "This is blasphemous."}, {"time": 6639, "text": "Well, in a minute, I'll recover my career in a second."}, {"time": 6642, "text": "Although I think the good, the only good thing about being the regis chair means I think there has to be an act of parliament to fire me."}, {"time": 6652, "text": "But you can always go to Lee's Twitter and protest."}, {"time": 6656, "text": "And I think the third thing is that, so we've got, you know, we've got the order at the beginning."}, {"time": 6662, "text": "Second law."}, {"time": 6663, "text": "The second law and the fact that causation is emergent, right?"}, {"time": 6667, "text": "And that time is emergent."}, {"time": 6669, "text": "John Carroll just turned off this program."}, {"time": 6672, "text": "I think he believes that it's emergent."}, {"time": 6673, "text": "So causation is not... That's clearly incorrect because we wouldn't exist otherwise."}, {"time": 6679, "text": "So physicists have kind of got confused about time."}, {"time": 6683, "text": "Time is a real thing."}, {"time": 6685, "text": "Well, I mean, so look, I'm very happy with the current description of the universe as physics give me, because I can do a lot of stuff, right?"}, {"time": 6693, "text": "I can go to the moon with Newtonian physics, I think, and I can understand the orbit of Mercury with relativity."}, {"time": 6701, "text": "And so, and I can build transistors with quantum mechanics, right?"}, {"time": 6703, "text": "And I can do all this stuff."}, {"time": 6705, "text": "So I'm not saying the physics is wrong."}, {"time": 6707, "text": "I'm just saying, if we say that time is fundamental, i.e."}, {"time": 6710, "text": "time is nonnegotiable, there's a global clock, I don't need to require that there's order been magically made in the past because that asymmetry is built into the way the universe is."}, {"time": 6725, "text": "So if time is fundamental, I mean, you've been referring to this kind of an interesting formulation of that is memory."}, {"time": 6734, "text": "So time is hard to like put a finger on, like what the hell are we talking about?"}, {"time": 6740, "text": "Well, it's just the direction, but memory is a construction, especially when you have like, think about these local pockets of complexity, these nonzero assembly index entities that's being constructed and they remember."}, {"time": 6757, "text": "Never forget molecules."}, {"time": 6759, "text": "But remember, the thing is I invented assembly theory."}, {"time": 6762, "text": "I'll tell you how I invented it."}, {"time": 6764, "text": "When I was a kid, I mean, the thing is, I keep making fun of myself to my research group."}, {"time": 6768, "text": "I've only ever had one idea."}, {"time": 6769, "text": "I keep exploring that idea over the 40 years or so since I had the idea."}, {"time": 6773, "text": "I used to be a... Well, aren't you the idea that the universe had?"}, {"time": 6776, "text": "So it's very kind of hierarchical."}, {"time": 6780, "text": "That's very poetic."}, {"time": 6782, "text": "So I think I came up with assembly theory with the following idea."}, {"time": 6786, "text": "When I was a kid, I was obsessed about survival kits."}, {"time": 6789, "text": "What is the minimum stuff I would need to basically replicate my reality?"}, {"time": 6794, "text": "And I love computers and I love technology or what technology is gonna become."}, {"time": 6798, "text": "So I imagined that I would have basically this really big truck full of stuff."}, {"time": 6802, "text": "And I thought, well, can I delete some of that stuff out?"}, {"time": 6805, "text": "Can I have a blueprint?"}, {"time": 6806, "text": "And then in the end, I kept making this smaller."}, {"time": 6809, "text": "I got to maybe a half a truck and then to a suitcase."}, {"time": 6812, "text": "And then I went, okay, well, screw it."}, {"time": 6813, "text": "I wanna carry my entire technology in my pocket."}, {"time": 6818, "text": "And I'm not gonna launch into Steve Jobs and iPlayer."}, {"time": 6823, "text": "I came up with a matchbox survival kit."}, {"time": 6825, "text": "In that matchbox survival kit, I would have the minimum stuff that would allow me to interact the environment, to build my shelter, to build a fishing rod, to build a water purification system."}, {"time": 6837, "text": "And it's kind of like, so what did I use in my box to assemble in the environment, to assemble, to assemble, to assemble?"}, {"time": 6844, "text": "And I realized I could make a causal chain in my survival kit."}, {"time": 6848, "text": "So I guess that's probably why I've been obsessed with assembly theory for so long."}, {"time": 6851, "text": "And I was just pre configured to find it somewhere."}, {"time": 6857, "text": "And when I saw it in molecules, I realized that the causal structure that we say emerges and the physics kind of gets really stuck because they're saying that time, you can go backwards in time."}, {"time": 6869, "text": "I mean, how do we let physicists get away with the notion that we can go back in time and meet ourselves?"}, {"time": 6875, "text": "I mean, that's clearly a very hard thing to allow, physicists would not let other sciences get away with that kind of heresy, right?"}, {"time": 6889, "text": "So why are physicists allowed to get away with it?"}, {"time": 6890, "text": "Let's, let's."}, {"time": 6891, "text": "So first of all, to push back, to play devil's advocate, you are clearly married to the idea of memory."}, {"time": 6898, "text": "You see in this, again, from Rick and Morty way, you see, you have these deep dreams of the universe that is writing the story through its memories, through its chemical compounds that are just building at top of each other."}, {"time": 6912, "text": "And then they find useful components they can reuse."}, {"time": 6916, "text": "And then the reused components create systems that themselves are then reused and all in this way, construct things."}, {"time": 6924, "text": "But when you think of that as memory, it seems like quite sad that you can walk that back."}, {"time": 6931, "text": "But at the same time, it feels like that memory, you can walk in both directions on that memory in terms of time."}, {"time": 6938, "text": "You could walk in both directions, but I don't think that that makes any sense because the problem that I have with time being reversible is that, I mean, I'm just a, you know, I'm a dumb experimental chemist, right?"}, {"time": 6955, "text": "So I love burning stuff, burning stuff and building stuff."}, {"time": 6958, "text": "But when I think of reversible phenomena, I imagine in my head, I have to actually manufacture some time."}, {"time": 6965, "text": "I have to borrow time from the universe to do that."}, {"time": 6968, "text": "I can't, when anyone says, let's imagine that we can go back in time or reversibility, you can't do that."}, {"time": 6974, "text": "You can't step out of time."}, {"time": 6975, "text": "Time is nonnegotiable, it's happening."}, {"time": 6977, "text": "No, but see, you're assuming that time is fundamental, which most of us do when we go day to day, but it takes a leap of wild imagination to think that time is emergent."}, {"time": 6989, "text": "No, time is not emergent."}, {"time": 6990, "text": "Yeah, I mean, this is an argument we can have, but I believe I can come up with an experiment."}, {"time": 6995, "text": "An experiment that proves that time cannot possibly be emergent."}, {"time": 6998, "text": "An experiment that shows how assembly theory kind of is the way that the universe produces selection and that selection gives rise to life."}, {"time": 7010, "text": "And also to say, well, hang on, we could allow ourselves to have a theory that requires us to have these statements to be possible."}, {"time": 7019, "text": "Like we need to have order in the past, or we can use the past hypothesis, which is order in the past, but as well, okay."}, {"time": 7030, "text": "And we have to have an arrow of time."}, {"time": 7032, "text": "We have to require that entropy increases."}, {"time": 7036, "text": "And we have to say, and then we can say, look, the universe is completely closed and there's no novelty or that novelty is predetermined."}, {"time": 7043, "text": "What I'm saying is very, very important that time is fundamental, which means, if you think about it, the universe becomes more and more novel each step."}, {"time": 7052, "text": "It generates there's more states in the next step than it was before."}, {"time": 7055, "text": "So that means bigger search."}, {"time": 7057, "text": "So what I'm saying is that the universe wasn't capable of consciousness at day one, actually, because it didn't have enough states."}, {"time": 7065, "text": "But today the universe is, so it's like how?"}, {"time": 7068, "text": "All right, all right, hold on a second."}, {"time": 7071, "text": "Now we've pissed off the panpsychist too, okay."}, {"time": 7075, "text": "No, this is brilliant, sorry."}, {"time": 7077, "text": "Part of me is just joking, having fun with this thing, but because you're saying a lot of brilliant stuff and I'm trying to slow it down before my brain explodes."}, {"time": 7085, "text": "So, because I want to break apart some of the fascinating things you're saying."}, {"time": 7090, "text": "So novelty, novelty is increasing in the universe because the number of states is increasing."}, {"time": 7096, "text": "What do you mean by states?"}, {"time": 7098, "text": "So I think the physicists almost got everything right."}, {"time": 7100, "text": "I can't fault them at all."}, {"time": 7102, "text": "I just think there's a little bit of dogma."}, {"time": 7104, "text": "I'm just trying to play devil's advocate."}, {"time": 7105, "text": "I'm very happy to be entirely wrong on this, right?"}, {"time": 7108, "text": "I'm not right on many things at all, but if I can make less assumptions about the universe with this, then potentially that's a more powerful way of looking at things."}, {"time": 7119, "text": "If you think of time as fundamental, you can make less assumptions overall."}, {"time": 7123, "text": "Exactly, if time is fundamental, I don't need to add on a magical second law because the second law comes out of the fact the universe is actually, there's more states available."}, {"time": 7132, "text": "I mean, we might even be able to do weird things like dark energy in the universe might actually just be time, right?"}, {"time": 7138, "text": "Yeah, but then you have to still have to explain why time is fundamental, because I can give you one explanation that's simpler than time and say God."}, {"time": 7147, "text": "You know, like just because it's simple doesn't mean it's, okay, you still have to explain God and you still have to explain time."}, {"time": 7154, "text": "Like why is it fundamental?"}, {"time": 7155, "text": "So let's just say existence is default, which means time is the default."}, {"time": 7159, "text": "So how did you go from the existence of the time to the default?"}, {"time": 7162, "text": "Well, we exist, right?"}, {"time": 7164, "text": "So let's just be very."}, {"time": 7166, "text": "We're yet to talk about what exist means."}, {"time": 7168, "text": "All right, let's go all the way back."}, {"time": 7170, "text": "Yeah, yeah, yeah, okay."}, {"time": 7171, "text": "I think it's very poetic and beautiful what you're weaving into this."}, {"time": 7174, "text": "I don't think this conversation is even about the assembly, which is fascinating and we'll keep mentioning it in the index on this idea, that I don't think is necessarily connected to time."}, {"time": 7186, "text": "Oh, I think it is deeply connected."}, {"time": 7189, "text": "I can't explain it yet."}, {"time": 7190, "text": "So you don't think everything you've said about assembly theory and assembly index can still be correct even if time is emergent?"}, {"time": 7198, "text": "So yeah, right now, assembly theory appears to work."}, {"time": 7201, "text": "I appear to be able to measure objects of high assembly in a mass spectrometer and look at their abundance and you know, all that's fine, right?"}, {"time": 7208, "text": "It's a nice, if nothing else, it's a nice way of looking at how molecules can compress things."}, {"time": 7214, "text": "Now, am I saying that a time has to be fundamental, not emergent for assembly theory to work?"}, {"time": 7218, "text": "No, I think I'm saying that the universe, it appears that the universe has many different ways of using time."}, {"time": 7226, "text": "You could have three different types of time."}, {"time": 7228, "text": "You could just have time that's, the way I would think of it, if you want to hold onto emergent time, I think that's fine, let's do that for a second."}, {"time": 7235, "text": "Hold onto emergent time and the universe is just doing its thing."}, {"time": 7239, "text": "Then assembly time only exists when the universe starts to write memories through bonds."}, {"time": 7243, "text": "So let's just say there's rocks running around, you know, when the bond happens and selection starts, suddenly there are, the universe is remembering cause in the past and those structures will have effects in the future."}, {"time": 7257, "text": "So suddenly a new type of time emerges at that point, which has a direction."}, {"time": 7262, "text": "And I think Sean Carroll at this point might even turn the podcast back on and go, okay, I can deal with that, that's fine."}, {"time": 7268, "text": "But I'm just basically trying to condense the conversation, say, hey, let's just have time fundamental and see how that screws with people's minds."}, {"time": 7275, "text": "You're triggering people by saying fundamental."}, {"time": 7278, "text": "Well, you just say, like, let's say."}, {"time": 7279, "text": "Why am I, look, I'm walking through the wall."}, {"time": 7281, "text": "Why should I grow up in a world where time, I don't go back in time."}, {"time": 7288, "text": "I don't meet myself in the past."}, {"time": 7290, "text": "There are no one, there are no aliens coming from the future, right?"}, {"time": 7294, "text": "You know, it's just like."}, {"time": 7295, "text": "No, no, no, but that's not, no, no, no, hold on a second."}, {"time": 7298, "text": "That's like saying we're talking about biology or like evolutionary psychology and you're saying, okay, let's just assume that clothing is fundamental."}, {"time": 7308, "text": "People wearing clothes is fundamental."}, {"time": 7310, "text": "It's like, no, no, no, wait a minute."}, {"time": 7312, "text": "You can't, like, I think you're gonna get in a lot of trouble if you assume time is fundamental."}, {"time": 7318, "text": "Give me one reason why I'm getting into trouble with time being fundamental."}, {"time": 7321, "text": "Because you might not understand the origins of this memory that might be deeper."}, {"time": 7328, "text": "Like this memory, that could be a thing that's explaining the construction of these higher complexities better than just saying it's a search, it's chemicals doing a search for reusable structures that they can like then use as bricks to build a house."}, {"time": 7352, "text": "Okay, so I accept that."}, {"time": 7354, "text": "So let's go back a second because it's a kind of, I wanted to drop the time bomb at this part because I think we can carry on discussing it for many, many, many, many, many days, many months."}, {"time": 7366, "text": "But I'm happy to accept that it might be wrong."}, {"time": 7370, "text": "But what I would like to do is imagine a universe where time is fundamental and time is emergent and ask, let's just then talk about causation because physicists require that causation."}, {"time": 7382, "text": "So this is where I'm gonna go."}, {"time": 7384, "text": "Causation emerges and it doesn't exist at the micro scale."}, {"time": 7388, "text": "Well, that clearly is wrong because if causation has to emerge at the macro scale, life cannot emerge."}, {"time": 7393, "text": "So how does life emerge?"}, {"time": 7395, "text": "Life requires molecules to bump into each other, produce replicators, those replicators need to produce polymers."}, {"time": 7401, "text": "There needs to be cause and effect at the molecular level."}, {"time": 7404, "text": "There needs to be an agardic, non agardic to an agardic transition at some point."}, {"time": 7409, "text": "And those replicators have consequence, material consequence in the universe."}, {"time": 7417, "text": "Physicists just say, oh, you know what?"}, {"time": 7419, "text": "I'm gonna have a bunch of particles in a box."}, {"time": 7422, "text": "I'm gonna think about it in a Newtonian way and a quantum way and I'll add on an arrow of time so I can label things and causation will happen magically later."}, {"time": 7431, "text": "Well, how?"}, {"time": 7432, "text": "Explain causation and they can't."}, {"time": 7435, "text": "The only way I can reconcile causation is having a fundamental time because this allows me to have a deterministic universe that creates novelty."}, {"time": 7445, "text": "And there's so many things to unpack here but let's go back to the point."}, {"time": 7449, "text": "You said, can assembly theory work with emergent time?"}, {"time": 7452, "text": "Sure it can, but it doesn't give me a deep satisfaction about how causation and assembly gives rise to these objects that move through time and space."}, {"time": 7464, "text": "And again, what am I saying to bring it back?"}, {"time": 7467, "text": "I can say without fear, take this water bottle and look at this water bottle and look at the features on it."}, {"time": 7472, "text": "There's writing, you've got a load of them."}, {"time": 7475, "text": "I know that causal structures gave rise to this."}, {"time": 7478, "text": "In fact, I'm not looking at just one water bottle here."}, {"time": 7480, "text": "I'm looking at every water bottle that's ever been conceived of by humanity."}, {"time": 7484, "text": "This here is a special object."}, {"time": 7486, "text": "In fact, Leibniz knew this."}, {"time": 7488, "text": "Leibniz who was at the same time of Newton, he kind of got stuck."}, {"time": 7493, "text": "I think Leibniz actually invented assembly theory."}, {"time": 7496, "text": "He gave soul, the soul that you see in objects wasn't the mystical soul, it is assembly."}, {"time": 7501, "text": "It is the fact there's been a history of objects related and without the object in the past, this object wouldn't exist."}, {"time": 7508, "text": "There is a lineage and there is conserved structures, causal structures have given rise to those."}, {"time": 7517, "text": "And you're saying it's just a simpler view if time is fundamental."}, {"time": 7523, "text": "And it shakes the physicist's cage a bit, right?"}, {"time": 7525, "text": "Because I'm gonna say, but I think that."}, {"time": 7529, "text": "I just enjoy the fact that physicists are in cages."}, {"time": 7532, "text": "I think that, I mean, I would say that, you know, Lee Smolin, I don't want to speak for Lee."}, {"time": 7537, "text": "I mean, I'm talking to Lee about this."}, {"time": 7539, "text": "I think Lee also is an agreement that time has to be fundamental, but I think he goes further."}, {"time": 7545, "text": "You know, even in space, I don't think you can go back to the same place in space."}, {"time": 7549, "text": "I've been to Austin a few times now."}, {"time": 7551, "text": "This is my, I think third time I've been to Austin."}, {"time": 7554, "text": "Is Austin in the same place?"}, {"time": 7555, "text": "No, the solar system is moving through space."}, {"time": 7559, "text": "I'm not back in the same space."}, {"time": 7561, "text": "Locally I am."}, {"time": 7563, "text": "Every event in the universe is unique."}, {"time": 7570, "text": "Doesn't mean we can't go back though."}, {"time": 7573, "text": "I mean, you know, let's just, you know, rest this conversation, which was beautiful, with a quote from the Rolling Stones that you can't always get what you want, which is you want time to be fundamental, but if you try, you'll get what you need, which is assembly theory."}, {"time": 7592, "text": "Okay, let me ask you about, continue talking about complexity, and to clarify with this beautiful theory of yours that you're developing, and I'm sure we'll continue developing both in the lab and in theory."}, {"time": 7609, "text": "Yeah, it can't be said enough, just the ideas you're playing with in your head are just, and we've been talking about are just beautiful."}, {"time": 7618, "text": "So if we talk about complexity a little bit more generally, maybe in an admiring romantic way, how does complexity emerge from simple rules?"}, {"time": 7629, "text": "The why, the how."}, {"time": 7631, "text": "Okay, the nice algorithm of assembly is there."}, {"time": 7634, "text": "I would say that the problem I have right now is, I mean, you're right, we can, about time as well."}, {"time": 7640, "text": "The problem is I have this hammer called assembly, and everything I see is a nail."}, {"time": 7644, "text": "So now let's just apply it to all sorts of things."}, {"time": 7647, "text": "We take the Bernard instability."}, {"time": 7648, "text": "The Bernard instability is you have oil, if you heat up oil, let's say on a frying pan, when you get convection, you get honeycomb patterns."}, {"time": 7657, "text": "Take the formation of snowflakes, right?"}, {"time": 7660, "text": "Take the emergence of a tropical storm, or the storm on Jupiter."}, {"time": 7667, "text": "When people say, let's talk about complexity in general, what they're saying is, let's take this collection of objects that are correlated in some way, and try and work out how many moving parts there are, how this got, how this exists."}, {"time": 7682, "text": "So what people have been doing for a very long time is taking complexity and counting what they've lost, calculating the entropy."}, {"time": 7691, "text": "And the reason why I'm pushing very hard on assembly is entropy tells you how much you've lost."}, {"time": 7696, "text": "It doesn't tell you the microstates are gone."}, {"time": 7698, "text": "But if you embrace the bottom up with assembly, those states, and you then understand the causal chain that gives rise to the emergence."}, {"time": 7708, "text": "So what I think assembly will help us do is understand weak emergence at the very least, and maybe allow us to crack open complexity in a new way."}, {"time": 7719, "text": "And I've been fascinated with complexity theory for many years."}, {"time": 7723, "text": "I mean, as soon as I could, I learned of the Mandelbrot set, and I could just type it up in my computer and run it, and just show it and see it kind of unfold."}, {"time": 7735, "text": "It was just this kind of, this mathematical reality that existed in front of me, I just found incredible."}, {"time": 7743, "text": "But then I realized that actually we were cheating."}, {"time": 7747, "text": "We're putting in the boundary conditions all the time."}, {"time": 7749, "text": "We're putting in information."}, {"time": 7751, "text": "And so when people talk to me about the complexity of things, I say, but relative what, how do you measure them?"}, {"time": 7758, "text": "So my attempt, my small attempt, naive attempt, because there's many greater minds than mine on the planet right now thinking about this properly."}, {"time": 7767, "text": "And you've had some of them on the podcast, right?"}, {"time": 7769, "text": "Just absolutely fantastic."}, {"time": 7773, "text": "But I'm wondering if we might be able to reformat the way we would explore algorithmic complexity using assembly."}, {"time": 7781, "text": "What's the minimum number of constraints we need in our system for this to unfold?"}, {"time": 7787, "text": "So whether it's like, if you take some particles and put them in a box, at a certain box size, you get quasi crystallinity coming out, right?"}, {"time": 7797, "text": "But that quite, that emergence, it's not magic."}, {"time": 7800, "text": "It must come from the boundary conditions you put in."}, {"time": 7803, "text": "So all I'm saying is a lot of the complexity that we see is a direct read of the constraints we put in, but we just don't understand."}, {"time": 7811, "text": "So as I said earlier to the poor origin of life chemists, you know, origin of life is a scam."}, {"time": 7817, "text": "I would say lots of the complexity calculation theory is a bit of a scam because we put the constraints in, but we don't count them correctly."}, {"time": 7825, "text": "And I'm wondering if... Oh, you're thinking and starting to drop as assembly theory, assembly index is a way to count to the constraints."}, {"time": 7835, "text": "So assembly theory doesn't do, doesn't lower any of the importance of complexity theory, but it allows us to go across domains and start to compare things, compare the complexity of a molecule, of a microprocessor, of the text you've writing, of the music you may compose."}, {"time": 7853, "text": "You've tweeted, quote, \"'Assembly theory explains why Nietzsche understood we had limited freedom rather than radical freedom.'"}, {"time": 7861, "text": "So we've applied assembly theory to cellular automata in life and chemistry."}, {"time": 7867, "text": "What does Nietzsche have to do with assembly theory?"}, {"time": 7869, "text": "Oh, that gets me into free will and everything."}, {"time": 7873, "text": "So let me say that again."}, {"time": 7874, "text": "Assembly theory explains why Nietzsche understood we had limited freedom rather than radical freedom."}, {"time": 7880, "text": "Limited freedom, I suppose, is referring to the fact that there's constraints or what is radical freedom?"}, {"time": 7888, "text": "What is freedom?"}, {"time": 7890, "text": "So Sartre was like believed in absolute freedom and that he could do whatever he wanted in his imagination."}, {"time": 7898, "text": "And Nietzsche understood that his freedom was somewhat more limited."}, {"time": 7904, "text": "And it kind of takes me back to this computer game that I played when I was 10."}, {"time": 7907, "text": "So I think it's called Dragon's Lair."}, {"time": 7911, "text": "Do you know Dragon's Lair?"}, {"time": 7912, "text": "I think I know Dragon's Lair, yeah."}, {"time": 7914, "text": "Dragon's Lair, I knew I was being conned, right?"}, {"time": 7916, "text": "Dragon's Lair, when you play the game, you're lucky that you grew up in a basically procedurally generated world."}, {"time": 7921, "text": "That was RPG a little bit."}, {"time": 7923, "text": "No, it's like, is it turn based play?"}, {"time": 7925, "text": "Was it?"}, {"time": 7927, "text": "It was a role playing game."}, {"time": 7928, "text": "Role playing."}, {"time": 7929, "text": "But really good graphics and one of the first laser disks."}, {"time": 7931, "text": "And when you actually flick the stick, you took, it's like it was like a graphical adventure game with animation."}, {"time": 7938, "text": "And when I played this game, I really, you know, you could get through the game in 12 minutes if you knew what you were doing without making mistakes, just play the disk, play the disk, play a disk."}, {"time": 7945, "text": "So it was just about timing."}, {"time": 7947, "text": "And actually it was a complete fraud because all the animation has been prerecorded on the disk."}, {"time": 7953, "text": "It's like the Black Mirror, the first interactive where they had all the, you know, several million kind of permutations of the movie that you could select on Netflix."}, {"time": 7962, "text": "I've forgotten the name of it."}, {"time": 7964, "text": "So this was exactly that in the laser disk."}, {"time": 7967, "text": "So you basically go left, go right, fight the yoga, slay the dragon."}, {"time": 7972, "text": "And when you flick the joystick at the right time, it just goes to the next animation to play."}, {"time": 7976, "text": "It's not really generating it."}, {"time": 7978, "text": "And I played that game and I knew I was being had."}, {"time": 7983, "text": "So to you, Dragon Lair is the first time you realized that free will is an illusion."}, {"time": 7990, "text": "And why does assembly theory give you hints about free will, whether it's an illusion or not?"}, {"time": 7997, "text": "Yeah, so no, so not tightly."}, {"time": 7998, "text": "If I do think I have some will and I think I am an agent and I think I can interact and I can play around with the model I have of the world and the cost functions, right?"}, {"time": 8008, "text": "And I can hack my own cost functions, which means I have a little bit of free will."}, {"time": 8012, "text": "But as much as I want to do stuff in the universe, I don't think I could suddenly say, I mean, actually this is ridiculous."}, {"time": 8018, "text": "Cause now I say I could try and do it, right?"}, {"time": 8019, "text": "Like I'm suddenly give up everything and become a rapper tomorrow, right?"}, {"time": 8024, "text": "Maybe I could try that, but I don't have sufficient agency to make that necessarily happen."}, {"time": 8030, "text": "I'm on a trajectory."}, {"time": 8031, "text": "So when in Dragon's Lair, I know that I have some trajectories that I can play with where Sartre realized he thought that he had no assembly, no memory."}, {"time": 8040, "text": "He could just leap across and do everything."}, {"time": 8043, "text": "And Nietzsche said, okay, I realize I don't have full freedom, but I have some freedom."}, {"time": 8049, "text": "And the assembly theory basically says that, it says, if you have these constraints in your past, they limit what you were able to do in the future, but you can use them to do amazing things."}, {"time": 8059, "text": "Let's say I'm a poppy plant and I'm creating some opiates."}, {"time": 8063, "text": "Opiates are really interesting molecules."}, {"time": 8065, "text": "I mean, they're obviously great for medicine, cause great problems in society."}, {"time": 8069, "text": "But let's imagine we fast forward a billion years, what will the opioids look like in a billion years?"}, {"time": 8077, "text": "Well, we can guess because we can see how those proteins will evolve and we can see how the secondary metabolites will change."}, {"time": 8084, "text": "But they can't go radical."}, {"time": 8086, "text": "They can't suddenly become, I don't know, like a molecule that you find in an OLED in a display."}, {"time": 8092, "text": "They will have some, they will be limited by the causal chain that produced them."}, {"time": 8096, "text": "And that's what I'm getting at, saying we are unpredictably predictable or predictably unpredictable within a constraint on the trajectory we're on."}, {"time": 8108, "text": "Yeah, so the predictably part is the constraints of the trajectory and the unpredictable part is the part that you still haven't really clarified the origin of the little bit of freedom."}, {"time": 8120, "text": "So you're just arguing, you're basically saying that radical freedom is impossible."}, {"time": 8126, "text": "You're really operating in a world of constraints that are constrained by the memory of the trajectory of the chemistry that led to who you are."}, {"time": 8133, "text": "Okay, but even just a tiny bit of freedom, even if everything, if everywhere you are in cages, if you can move around in that cage a little bit, you're free."}, {"time": 8151, "text": "And so the question is in assembly theory, if we're thinking about free will, where does the little bit of freedom come from?"}, {"time": 8159, "text": "What is the eye that can decide to be a rapper?"}, {"time": 8163, "text": "What, why, what is that?"}, {"time": 8166, "text": "That's a cute little trick we've convinced each other of so we can do fun tricks at parties or is there something fundamental that allows us to feel free, to be free?"}, {"time": 8178, "text": "I think that that's the question that I wanna answer."}, {"time": 8181, "text": "I know you wanna answer it and I think it's so profound."}, {"time": 8185, "text": "Let me have a go at it."}, {"time": 8187, "text": "I would say that I don't take the stance of Sam Harris because I think Sam Harris, when he said, the way he says it is almost, it's really interesting."}, {"time": 8194, "text": "I'd love to talk to him about it."}, {"time": 8195, "text": "Sam Harris almost thinks himself out of existence, right?"}, {"time": 8197, "text": "Because, do you know what I mean?"}, {"time": 8200, "text": "Yeah, well, I mean, he has different views on consciousness versus free will."}, {"time": 8205, "text": "I think he saves himself with consciousness."}, {"time": 8207, "text": "He thinks himself out of existence with free will."}, {"time": 8210, "text": "So I mean, there's no point, right?"}, {"time": 8214, "text": "He's a leaf floating on a river."}, {"time": 8215, "text": "Yeah, I think that he, I don't know, I'd love to ask him whether he really believes that and then we could play some games."}, {"time": 8225, "text": "No, no, I then would say, I'll get him to play a game of cards with me and I'll work out the conditions on which he says no, and then I'll get him to the conditions he says yes, and then I'll trap him in his logical inconsistency with that argument."}, {"time": 8237, "text": "Because at some point when he loses enough money or the prospect of losing enough money, there's a way of basically mapping out a series of..."}, {"time": 8246, "text": "So what will is about, let's not call it free will, but what will is about is to have a series of decisions equally weighted in front of you."}, {"time": 8256, "text": "And those decisions aren't necessarily energy minimization."}, {"time": 8259, "text": "Those decisions are a function of the model you've made in your mind, you're in your simulation."}, {"time": 8265, "text": "And the way you've interacted in reality and also other interactions you're having with other individuals and happenstance."}, {"time": 8275, "text": "And I think that there's a little bit of delay in time."}, {"time": 8280, "text": "So I think what you're able to do is say, well, I'm gonna do the counterfactual."}, {"time": 8286, "text": "I've done all of them."}, {"time": 8288, "text": "And I'm gonna go this way."}, {"time": 8290, "text": "And you probably don't know why."}, {"time": 8292, "text": "I think free will is actually very complex interaction between your unconscious and your conscious brain."}, {"time": 8298, "text": "And I think the reason why we're arguing about it is so interesting in that we just, some people outsource their free will to their unconscious brain."}, {"time": 8308, "text": "And some people try and overthink the free will and the conscious brain."}, {"time": 8313, "text": "I would say that Sam Harris has realized his conscious brain doesn't have free will, but his unconscious brain does."}, {"time": 8318, "text": "That's my guess, right?"}, {"time": 8319, "text": "And that he can't have access to the unconscious brain."}, {"time": 8322, "text": "Yeah, and that's kind of annoying."}, {"time": 8323, "text": "And so he's just, he's going to, through meditation, come to acceptance with that fact."}, {"time": 8328, "text": "Yeah, it's just maybe okay."}, {"time": 8330, "text": "But I do think that I have the ability to make decisions and I like my decisions."}, {"time": 8336, "text": "In fact, I mean, this is an argument I have with some people that some days I feel I have no free will and it's just an illusion."}, {"time": 8344, "text": "And this is one, and it makes me more radical, if you like, you know, that I get to explore more of the state space."}, {"time": 8351, "text": "And I'm like, I'm going to try and affect the world now."}, {"time": 8353, "text": "I'm really going to ask the question that maybe I dare not ask or do the thing I dare not do."}, {"time": 8359, "text": "And that allows me to kind of explore more."}, {"time": 8361, "text": "It's funny that if you truly accept that there's no free will, that is a kind of radical freedom."}, {"time": 8371, "text": "It's funny, but you're, because the little bit of the illusion under that framework that you have that you can make choices, if choice is just an illusion of psychology, you can do whatever the hell you want."}, {"time": 8386, "text": "That's the."}, {"time": 8387, "text": "But we don't, do we?"}, {"time": 8389, "text": "But because you don't truly accept that you think that there's like, you think there's a choice which is why you don't just do whatever the hell you want."}, {"time": 8400, "text": "Like you feel like there's some responsibility for making the wrong choice, which is why you don't do it."}, {"time": 8405, "text": "But if you truly accept that the choice has already been made, then you can go, I don't know what is the most radical thing."}, {"time": 8416, "text": "I mean, but yeah, I don't, I wonder what, what am I preventing myself from doing that I would really want to do?"}, {"time": 8424, "text": "Probably like humor stuff."}, {"time": 8426, "text": "Like I would love to, if I could like save a game, do the thing and then reload it later, like do undo, it probably would be humor."}, {"time": 8437, "text": "Just to do something like super hilarious."}, {"time": 8442, "text": "That's super embarrassing."}, {"time": 8443, "text": "And then just go, I mean, it's basically just fun."}, {"time": 8446, "text": "I would add more fun to the world."}, {"time": 8447, "text": "I mean, I sometimes do that as I've, you know, I sometimes I try and mess up my reality in unusual ways by just doing things because I'm bored, but not bored."}, {"time": 8459, "text": "I'm not expressing this very well."}, {"time": 8460, "text": "I think that this is a really interesting problem that perhaps the hard sciences don't really understand that they are responsible for because the question about how life emerged and how intelligence emerges and consciousness and free will they're all ultimately boiling down to some of the same mechanics."}, {"time": 8475, "text": "I think, my feeling is that they are the same problem again and again and again."}, {"time": 8480, "text": "The transition from a, you know, a boring world or a world in which there is no selection."}, {"time": 8486, "text": "So I wonder if free will has something to do with selection and models."}, {"time": 8489, "text": "And also the models you're generating in the brain and also your, the amount of memory, your working memory have available at any one time to generate counterfactuals."}, {"time": 8498, "text": "So like the decision making process is a kind of selection and that could be just another, yet another manifestation of the selection mechanism that's pervasive throughout the universe."}, {"time": 8510, "text": "Okay, that's fascinating to think about."}, {"time": 8514, "text": "Yeah, there's not some kind of fundamental, it's own thing or something like that."}, {"time": 8519, "text": "That is just yet another example of selection."}, {"time": 8521, "text": "Yeah, and in the universe that's intrinsically open, you want to do that because you generate novelty."}, {"time": 8528, "text": "You mentioned something about, do cellular automata exist outside the human mind in our little offline conversation?"}, {"time": 8537, "text": "Why is that an interesting question?"}, {"time": 8538, "text": "So cellular automata, complexity, what's the relationship between complexity and the human mind and trees falling in the forest?"}, {"time": 8548, "text": "Infrastructure, so the CA, so when John von Neumann and Conway and Feynman were doing CA, it was doing on paper."}, {"time": 8555, "text": "CA is cellular automata."}, {"time": 8557, "text": "Just drawing them on paper."}, {"time": 8558, "text": "How awesome is that, that they were doing cellular automata on paper and then they were doing it on a computer that takes like forever to print out anything and program."}, {"time": 8569, "text": "People are now with the TikTok, kids these days with the TikTok don't understand how amazing it is to just play with cellular automata, arbitrarily changing the rules as you want, the initial conditions, and see the beautiful patterns emerge, sing with fractals, all of that."}, {"time": 8586, "text": "You've just given me a brilliant idea."}, {"time": 8587, "text": "I wonder if there's a TikTok account that's just dedicated to putting out CA rules and if there isn't, we should make one."}, {"time": 8592, "text": "100% and that will get."}, {"time": 8594, "text": "So we have millions of views."}, {"time": 8596, "text": "Millions, yes."}, {"time": 8597, "text": "No, it'll get dozens."}, {"time": 8600, "text": "We'll just have it running."}, {"time": 8601, "text": "So look, I kind of, I love CAs."}, {"time": 8610, "text": "We just have to make one."}, {"time": 8612, "text": "I actually, a few years ago, I made some robots that talk to each other, chemical robots that played the game of Hex, invented by John Nash, by doing chemistry."}, {"time": 8622, "text": "And they communicated via Twitter, which were experiments they were doing."}, {"time": 8626, "text": "And they had a lookup table of experiments and robot one said, I'm doing experiment 10."}, {"time": 8631, "text": "And the other robot, okay, I'll do experiment one then."}, {"time": 8633, "text": "And they communicated via Twitter."}, {"time": 8635, "text": "Publicly or DMs?"}, {"time": 8638, "text": "Can you maybe quickly explain what the game of Hex is?"}, {"time": 8641, "text": "Yes, so it's basically a hexagonal board and you try and basically you color each element on the board of each hexagon and you try and get from one side to the other and the other one tries to block you."}, {"time": 8652, "text": "How are they connected?"}, {"time": 8653, "text": "So what are the robots?"}, {"time": 8654, "text": "So it's a chemical."}, {"time": 8656, "text": "Yeah, let's go back."}, {"time": 8657, "text": "So there are two robots."}, {"time": 8658, "text": "Each robot was doing dye chemistry."}, {"time": 8660, "text": "So making RGB, red, green, blue, red, green, blue, red, green, blue."}, {"time": 8664, "text": "And they could just choose from experiments to do red, green, blue."}, {"time": 8668, "text": "Initially I said to my group, we need to make two chemical robots that play chess."}, {"time": 8671, "text": "And my group were like, that's too hard."}, {"time": 8673, "text": "No, go away."}, {"time": 8675, "text": "But anyway, so we had the robot."}, {"time": 8676, "text": "By the way, people listening to this should probably know that Lee Cronin is an amazing group of brilliant people."}, {"time": 8686, "text": "He's exceptionally well published."}, {"time": 8688, "text": "He's written a huge number of amazing papers."}, {"time": 8692, "text": "Whenever he calls himself stupid and is a sign of humility, and I deeply respect that and appreciate it."}, {"time": 8700, "text": "So people listening to this should know this is a world class scientist who doesn't take himself seriously, which I really appreciate and love."}, {"time": 8707, "text": "Anywho, talking about serious science, we're back to your group rejecting your idea of chemical robots playing chess via dyes."}, {"time": 8722, "text": "So you went to a simpler game of Hex."}, {"time": 8724, "text": "Okay, so what else?"}, {"time": 8726, "text": "The team that did it were brilliant."}, {"time": 8727, "text": "I think they still have PTSD from doing it."}, {"time": 8731, "text": "Cause I said, this is a workshop."}, {"time": 8732, "text": "What I'd often do is I have about 60 people on my team."}, {"time": 8736, "text": "And occasionally before lockdown, I would say, I'm a bit bored."}, {"time": 8740, "text": "We're gonna have a workshop on something."}, {"time": 8741, "text": "Who wants to come?"}, {"time": 8742, "text": "And then basically about 20 people turn up to my office and I say, we're gonna do this mad thing."}, {"time": 8746, "text": "And then it would just self organize."}, {"time": 8749, "text": "And some of them would be like, no, I'm not doing this."}, {"time": 8751, "text": "And then you get left with the happy dozen."}, {"time": 8754, "text": "And what we did is we built this robot and doing dye chemistry is really easy."}, {"time": 8757, "text": "You can just take two molecules, react them together and change color."}, {"time": 8760, "text": "And what I wanted to do is have a palette of different molecules."}, {"time": 8764, "text": "You can react combinatorially and get different colors."}, {"time": 8767, "text": "So you've got two robots."}, {"time": 8768, "text": "And I went, wouldn't it be cool if the robots basically shared the same list of reactions to do."}, {"time": 8774, "text": "And they said, oh, and because of, then you could do a kind of multi core chemistry."}, {"time": 8778, "text": "Like they weren't, so you'd have two chemical reactions going on at once and they could basically outsource the problem."}, {"time": 8783, "text": "But they're sharing the same tape."}, {"time": 8786, "text": "So robot one would say, I'm gonna do, I'm gonna do experiment one."}, {"time": 8788, "text": "And the other robot says, I'll do experiment 100."}, {"time": 8790, "text": "And then they could cross it off."}, {"time": 8792, "text": "But I wanted to make it."}, {"time": 8794, "text": "I wanted to make."}, {"time": 8795, "text": "That is genius."}, {"time": 8797, "text": "Well, I wanted to make it groovier."}, {"time": 8798, "text": "And I said, look, let's have them competing to make, so they're playing a game of hex."}, {"time": 8803, "text": "And so when the robot does an experiment and the more blue the dye, the more it gets the higher chance it gets to make the move it wants on the hex board."}, {"time": 8813, "text": "So if it gets a red color is like, it gets down weighted in the other robot."}, {"time": 8817, "text": "And so what the robots could do is they play, each player move."}, {"time": 8821, "text": "And cause the fitness function or the optimization function was to make the color blue, they started to invent reactions we didn't, weren't on the list."}, {"time": 8831, "text": "And they did this by not cleaning because we made cleaning optional."}, {"time": 8834, "text": "So when one robot realized if it didn't clean its pipes, it could get blue more quickly."}, {"time": 8839, "text": "And the other robot realized that."}, {"time": 8840, "text": "So it was like getting dirty as well."}, {"time": 8841, "text": "And they, they."}, {"time": 8842, "text": "Unintended consequences of super intelligence."}, {"time": 8848, "text": "That was the game."}, {"time": 8849, "text": "Communicating through Twitter though."}, {"time": 8850, "text": "They were, they were doing it through Twitter and Twitter bland them a couple of times."}, {"time": 8853, "text": "I said, come on, you've got a couple of robots doing chemistry."}, {"time": 8856, "text": "Stop banning them."}, {"time": 8858, "text": "But in the end they had, we had to take them off Twitter and they just communicated via a server."}, {"time": 8861, "text": "Cause it was just, there were people saying, you can still find it."}, {"time": 8863, "text": "Cronin lab one and Cronin lab two on Twitter."}, {"time": 8866, "text": "And it was like, make move, wait, you know, mix A and B, wait 10 seconds."}, {"time": 8872, "text": "Answer blue, you know."}, {"time": 8873, "text": "I really find it super compelling that you would have a chemical entity that's communicating with the world."}, {"time": 8883, "text": "That was one of the things I want to do with my origin of life reaction, right?"}, {"time": 8885, "text": "Is basically have a, have a reactor."}, {"time": 8890, "text": "That's basically just randomly enumerating for chemical space and have some kind of cycle and then read out what the molecules reading out using a mass spectrometer and then convert that to text and publish it on Twitter and then wait until it says I'm alive."}, {"time": 8904, "text": "I reckon that would get, I reckon that, that Twitter account would get a lot of followers."}, {"time": 8909, "text": "And I'm still trying to convince my group that we should just make an origin of life Twitter account."}, {"time": 8912, "text": "Where it's going blue and it's like, hello, testing."}, {"time": 8917, "text": "Well, I'll share it."}, {"time": 8919, "text": "I particularly enjoy this idea of a non human entity communicating with the world via human designed social network."}, {"time": 8928, "text": "It's quite a, quite a beautiful idea."}, {"time": 8935, "text": "How we were talking about CA's existing outside the human mind."}, {"time": 8941, "text": "So I really admire Stephen Wolfram."}, {"time": 8942, "text": "I think he's a genius, clearly a genius and trapped in is actually, it's like a problem with being so smart is you get trapped in your own mind, right?"}, {"time": 8951, "text": "And I've, I tried to actually, I tried to convince Stephen that assembly theory wasn't nonsense."}, {"time": 8956, "text": "He was like, no, it's just nonsense."}, {"time": 8957, "text": "I was a little bit sad by that."}, {"time": 8958, "text": "So nonsense applied, even if it applied to the simplest construct of a one dimensional cellular automata, for example."}, {"time": 8965, "text": "Well, I mean, actually, maybe I'm doing myself a bit too down."}, {"time": 8968, "text": "It was just as a theory was coming through and I didn't really know how to explain it, but we are going to use assembly theory and CA's in cellular automata, but I wanted to, what I was really curious about is why people marvel."}, {"time": 8982, "text": "I mean, you marvel CA's and their complexity."}, {"time": 8984, "text": "And I said, well, hang on that complexity is baked in because if you play the game of life in a CA, you have to run it on a computer."}, {"time": 8992, "text": "You have to have a, you have to do a number of operations, put in the boundary conditions."}, {"time": 8997, "text": "So is it surprising that you get this structure out?"}, {"time": 8999, "text": "Is it manufactured by the boundary conditions?"}, {"time": 9002, "text": "And it is interesting because I think a cellular automata running them is teaching me something about what real numbers are and aren't."}, {"time": 9014, "text": "I haven't quite got there yet."}, {"time": 9015, "text": "I was playing on the airplane coming over."}, {"time": 9016, "text": "I'm just realized, I have no idea what real numbers are really."}, {"time": 9020, "text": "And I was like, well, I do actually have some notion of what real numbers are."}, {"time": 9024, "text": "And I think thinking about real numbers as functions rather than numbers is more appropriate."}, {"time": 9030, "text": "And then if you then apply that to CA's, then you're saying, well, actually, why am I seeing this complexity in this rule?"}, {"time": 9039, "text": "Is it, you know, is it, you've got this deterministic system and yet you get this incredible structure coming out."}, {"time": 9048, "text": "Well, isn't that what you'd get with any real number as you apply it as a function and you're trying to read it out to an arbitrary position?"}, {"time": 9058, "text": "And I wonder if CA's are just helping me, well, my misunderstanding of CA's might be helping me understand them in terms of real numbers."}, {"time": 9064, "text": "I don't know what you think."}, {"time": 9065, "text": "Yeah, well, the functions, but the devil's in the function."}, {"time": 9071, "text": "It's like, which is the function that's generating your real number."}, {"time": 9076, "text": "Like that, it seems like it's very important the specific algorithm of that function because some lead to something super trivial, some lead to something that's all chaotic and some lead to things that are just walked that fine line of complexity and structure."}, {"time": 9095, "text": "I think we agree."}, {"time": 9096, "text": "So let's take it back a second."}, {"time": 9097, "text": "So take the logistic map or something, logistic equation, where you have this equation, which is you don't know what's gonna happen at n plus one, but once you've done n plus one, you know full time, you can't predict it."}, {"time": 9110, "text": "For me, CA's and logistic equation feel similar."}, {"time": 9113, "text": "And I think what's incredibly interesting and I share your kind of wonder at running a CA, but also I'm saying, well, what is it about the boundary conditions and the way I'm running that calculation?"}, {"time": 9128, "text": "So in my group, with my team, we actually made a chemical CA."}, {"time": 9132, "text": "We made Game of Life."}, {"time": 9133, "text": "We actually made a physical grid."}, {"time": 9135, "text": "I haven't been able to publish this paper."}, {"time": 9136, "text": "It's been trapped in purgatory for a long time, but it might be about."}, {"time": 9140, "text": "You wrote it up as a paper, how to do a chemical formulation of the Game of Life, which is played."}, {"time": 9143, "text": "We made a chemical computer and little cells."}, {"time": 9145, "text": "And I was playing Game of Life."}, {"time": 9146, "text": "With the BZ reactions, each cell would pulse on and off, on and off, on and off."}, {"time": 9151, "text": "We have little stirrer bars and we have little gates."}, {"time": 9154, "text": "And we actually played Conway's Game of Life in there."}, {"time": 9157, "text": "And we got structures in that."}, {"time": 9158, "text": "We got structures in that game from the chemistry that you wouldn't expect from the actual CA."}, {"time": 9164, "text": "So that was kind of cool in that."}, {"time": 9166, "text": "Cause they're interacting outside of the cells more."}, {"time": 9170, "text": "So what's happening is you're getting noise."}, {"time": 9172, "text": "So the thing is that you've got this BZ reaction that gives on off, on off, on off, but there's also a wake and those wakes constructively interfere or in such a non trivial way that's non deterministic."}, {"time": 9187, "text": "And the non determinism in the system gives very rich dynamics."}, {"time": 9192, "text": "And I was wondering if I could physically make a chemical computer with this CA that gives me something different."}, {"time": 9200, "text": "I can't get in a silicon representation of a CA where all the states are clean."}, {"time": 9207, "text": "Cause you don't have the noise trailing into the next round."}, {"time": 9210, "text": "You just have the state."}, {"time": 9212, "text": "So the paper in particular, so that's just a beautiful idea to use a chemical computer to construct the cellular automaton, the famous one of game of life."}, {"time": 9221, "text": "But it's also interesting."}, {"time": 9222, "text": "And it's a really interesting scientific question of whether some kind of random perturbations or some source of randomness can have a significant constructive effect on the complexity of the system."}, {"time": 9240, "text": "And indeed, I mean, whether it's random or just non deterministic and can we bake in that non determinism at the beginning?"}, {"time": 9248, "text": "I wonder what is the, I'm trying to think of what is the encoding space."}, {"time": 9252, "text": "The encoding space is pretty big."}, {"time": 9254, "text": "We have 49 stirrups of 49 cells, 49 chem bits all connected to one another and like an analog computer, but being read out discreetly as the BZ reaction."}, {"time": 9267, "text": "So just to say the BZ reaction is a chemical oscillator."}, {"time": 9270, "text": "And what happened in each cell is it goes between red and blue."}, {"time": 9273, "text": "So two Russians discovered it, Belouzov and Sapkinsky."}, {"time": 9276, "text": "I think Belouzov first proposed it and everyone said, you're crazy."}, {"time": 9279, "text": "It breaks the second law."}, {"time": 9280, "text": "And Sapkinsky said, no, it doesn't break the second law."}, {"time": 9282, "text": "It's consuming a fuel."}, {"time": 9285, "text": "And so, and then, and it's like, there's a lot of chemistry hidden in the Russian literature actually, because Russians just wrote it in Russian."}, {"time": 9294, "text": "They didn't publish it in English speaking journals."}, {"time": 9296, "text": "It's heartbreaking actually."}, {"time": 9297, "text": "Well, it's sad and it's great that it's there, right?"}, {"time": 9301, "text": "It's not lost."}, {"time": 9302, "text": "I'm sure we will find a way of translating it properly."}, {"time": 9305, "text": "Well, the silver lining slash greater sadness of all of this is there's probably ideas in English speaking."}, {"time": 9312, "text": "Like there's ideas in certain disciplines that if discovered by other disciplines would crack open some of the biggest mysteries in those disciplines."}, {"time": 9323, "text": "Like computer science, for example, is trying to solve problems like nobody else has ever tried to solve problems."}, {"time": 9332, "text": "As if it's not already been all addressed in cognitive science and psychology, in mathematics, in physics, in just whatever you want to, economics even."}, {"time": 9342, "text": "But if you look into that literature, you might be able to discover some beautiful ideas."}, {"time": 9347, "text": "Obviously Russian is an interesting case of that."}, {"time": 9351, "text": "It's because there's a loss in translation, but you said there's a source of fuel, a source of energy."}, {"time": 9358, "text": "So the BZ reaction, you have an acid in there called malonic acid."}, {"time": 9362, "text": "And what happens is it's basically like a battery that powers it and it loses CO2."}, {"time": 9369, "text": "So decarboxylates, it's just a chemical reaction."}, {"time": 9372, "text": "What that means we have to do is continuously feed or we just keep the BZ reaction going in a long enough time."}, {"time": 9378, "text": "So it's like it's reversible in time."}, {"time": 9382, "text": "But only like, yeah."}, {"time": 9383, "text": "But only like, but it's fascinating."}, {"time": 9386, "text": "I mean, the team that did it, I'm really proud of their persistence."}, {"time": 9389, "text": "We made a chemical computer and it can solve little problems."}, {"time": 9394, "text": "It can solve traveling salesman problems actually."}, {"time": 9397, "text": "But like I say, it's."}, {"time": 9398, "text": "But not any faster than a regular computer."}, {"time": 9401, "text": "Is there something you can do?"}, {"time": 9403, "text": "Maybe, I'm not sure."}, {"time": 9406, "text": "I think we can come up with a way of solving problems, also really complex, hard ones, because it's an analog computer and we can, it can energy minimize really quickly."}, {"time": 9419, "text": "It doesn't have to basically go through every element in the matrix, like flip it, it just reads out."}, {"time": 9425, "text": "So we could actually do Monte Carlo by just shaking the box."}, {"time": 9430, "text": "It's literally a box shaker."}, {"time": 9432, "text": "You don't actually have to encode the shaking of the box in a silicon memory and then just shuffle everything around."}, {"time": 9437, "text": "Yeah, and you can."}, {"time": 9438, "text": "It's analog, it's natural."}, {"time": 9439, "text": "So it's an organic computer."}, {"time": 9444, "text": "So I was playing around with this and I was kind of annoying some of my colleagues and wondering if we could get to chemical supremacy like quantum supremacy."}, {"time": 9451, "text": "And I kind of calculated how big the grid has to be so we can actually start to solve problems faster than a silicon computer."}, {"time": 9460, "text": "But I'm not willing to state how that is yet because I'm probably wrong."}, {"time": 9464, "text": "It's not that it's any top secret thing is I want, I think I can make a chemical computer that can solve optimization problems faster than the silicon computer."}, {"time": 9475, "text": "But then you're unsure how big that has to be."}, {"time": 9477, "text": "Yeah, I think, I mean."}, {"time": 9478, "text": "It might be a big box, hard to shake."}, {"time": 9480, "text": "It might be exactly a big box, hard to shake and basically a bit sloppy."}, {"time": 9485, "text": "Did we answer the question about do cellular atomic exists outside the mind?"}, {"time": 9491, "text": "We didn't, but I would posit that they don't."}, {"time": 9494, "text": "And I, but I think minds can, well."}, {"time": 9497, "text": "So the mind is fundamental."}, {"time": 9499, "text": "What's the, why?"}, {"time": 9501, "text": "Well, I mean, sorry, let's go back."}, {"time": 9503, "text": "So as a physical phenomena, do CAs exist in physical reality, right?"}, {"time": 9508, "text": "I would say they probably don't exist outside the human mind, but now we've constructed them."}, {"time": 9513, "text": "They exist in computer memories."}, {"time": 9514, "text": "They exist in my lab."}, {"time": 9515, "text": "They exist on paper."}, {"time": 9517, "text": "So they are, they emerge from the human mind."}, {"time": 9520, "text": "I'm just interested in, because Stephen Wolfram likes CAs, a lot of people like CAs and likes to think of them as minimal computational elements."}, {"time": 9529, "text": "I'm just saying, well, do they exist in reality or are they a representation of a simple machine that's just very elegant to implement?"}, {"time": 9537, "text": "So it's a platonic question, I guess."}, {"time": 9539, "text": "I mean, it's, there's initial conditions."}, {"time": 9543, "text": "There's a memory in the system."}, {"time": 9545, "text": "There are simple rules that dictate the evolution of the system."}, {"time": 9549, "text": "So what exists?"}, {"time": 9550, "text": "The idea, the rules, the."}, {"time": 9552, "text": "Yeah, people are using CAs as models for things in reality to say, hey, look, you can do this thing in a CA."}, {"time": 9561, "text": "And my, when I see this, I'm saying, oh, that's cool."}, {"time": 9564, "text": "But what does that tell me about reality?"}, {"time": 9566, "text": "Where's the CA in space?"}, {"time": 9569, "text": "It's a mathematical object."}, {"time": 9570, "text": "So for people who don't know cellular automata, there's usually a grid, whether it's one dimensional, two dimensional, or three dimensional."}, {"time": 9576, "text": "And it evolves by simple local rules, like you die or are born if the neighbors are alive or dead."}, {"time": 9584, "text": "And it turns out if you have, with certain kinds of initial conditions and with certain kinds of very simple rules, you can create like arbitrarily complex and beautiful systems."}, {"time": 9597, "text": "And to me, whether drugs are involved or not, I can sit back for hours and enjoy the mystery of it, how such complexity can emerge as it gives me almost like, you know, people talk about religious experiences."}, {"time": 9617, "text": "It gives me a sense that you get to have a glimpse at the origin of this whole thing."}, {"time": 9626, "text": "Whatever is creating this complexity from such simplicity is the very thing that brought my mind to life, this me, the human, our human civilization."}, {"time": 9642, "text": "And yes, those constructs are pretty trivial."}, {"time": 9649, "text": "I mean, that's part of their magic is even in this trivial framework, you could see the emergence, or especially in this trivial framework, you could see the emergence of complexity from simplicity."}, {"time": 9661, "text": "I guess what Lee, you're saying is that this is not, you know, this is highly unlike systems we see in the physical world, even though they probably carry some of the same magic, like mechanistically, that's all."}, {"time": 9679, "text": "I mean, I'm saying that the operating system that a CA has to exist on is quite complex."}, {"time": 9686, "text": "And so I wonder if you're getting the complexity out of the CA from the boundary conditions of the operating system, the underlying digital computer."}, {"time": 9693, "text": "Oh, wow, those are some strong words against CAs then."}, {"time": 9696, "text": "I didn't realize."}, {"time": 9696, "text": "Not against."}, {"time": 9697, "text": "I mean, I'm in love with CAs as well."}, {"time": 9700, "text": "I'm just saying they aren't as trivial as people think."}, {"time": 9704, "text": "They are incredible."}, {"time": 9705, "text": "To get to that richness, you have to iterate billions of times, and you need a display, and you need a math coprocessor, and you need a von Neumann machine based on a Turing machine of digital error correction and states."}, {"time": 9721, "text": "Wow, to think that for the simplicity of a grid, you're basically saying a grid is not simple."}, {"time": 9729, "text": "It requires incredible complexity to bring a grid to life."}, {"time": 9736, "text": "Well, then what is simple?"}, {"time": 9737, "text": "That's all I wanted to say."}, {"time": 9738, "text": "I agree with you with the wonder of CAs, I just think."}, {"time": 9740, "text": "But remember, we take so much for granted what the CA is resting on."}, {"time": 9744, "text": "Because von Neumann and Feynman weren't showing, weren't seeing these elaborate structures."}, {"time": 9750, "text": "They could not get that far."}, {"time": 9753, "text": "Yeah, but that's the limitation of their mind."}, {"time": 9755, "text": "The limitation of their pencil."}, {"time": 9757, "text": "But I think the question is whether the essential elements of the cellular automata is present without all the complexities required to build a computer."}, {"time": 9772, "text": "And my intuition, the reason I find it incredible is that, yeah, my intuition is yes."}, {"time": 9778, "text": "It might look different."}, {"time": 9780, "text": "There might not be a grid like structure, but local interactions operating under simple rules and resulting in multi hierarchical complex structures feels like a thing that doesn't require a computer."}, {"time": 9797, "text": "I agree, but coming back to von Neumann and Feynman and Wolfram, their minds, the non trivial minds to create those architectures and do it and to put on those state transitions."}, {"time": 9810, "text": "And I think that's something that's really incredibly interesting that is understanding how the human mind builds those state transition machines."}, {"time": 9821, "text": "I could see how deeply in love with the idea of memory you are."}, {"time": 9825, "text": "So it's like how much of E equals MC squared is more than an equation."}, {"time": 9833, "text": "It has Albert Einstein in it."}, {"time": 9837, "text": "You're saying you can't just say this is a, like the equations of physics are a really good simple capture of a physical phenomenon."}, {"time": 9850, "text": "It is also, that equation has the memory of the humans."}, {"time": 9855, "text": "Absolutely, absolutely, yeah."}, {"time": 9858, "text": "But I don't, I don't know if you're implying this."}, {"time": 9861, "text": "I don't, that's a beautiful idea, but I don't know if I'm comfortable with that sort of diminishing the power of that equation."}, {"time": 9871, "text": "No, no, it enhances it."}, {"time": 9871, "text": "Because it's built on the shoulders, it enhances it."}, {"time": 9873, "text": "I think it enhances it, it's not, that equation is a minimal compressed representation of reality, right?"}, {"time": 9879, "text": "We can use machine learning or Max Tegmark's AI Feynman to find lots of solutions for gravity, but isn't it wonderful that the laws that we do find are the maximally compressed representations?"}, {"time": 9890, "text": "Yeah, but that representation, you can now give it as, I guess the universe has the memory of Einstein with that representation."}, {"time": 9898, "text": "But then you can now give it as a gift for free."}, {"time": 9900, "text": "Yeah, yeah, it's low memory."}, {"time": 9901, "text": "To other alien civilizations."}, {"time": 9902, "text": "Einstein had to go through a lot of pain to get there, but it's low memory."}, {"time": 9904, "text": "So, I say that physics and chemistry and biology are the same discipline."}, {"time": 9908, "text": "They're just physics, laws in physics."}, {"time": 9911, "text": "There's no such thing as a law in physics."}, {"time": 9913, "text": "It's just low memory stuff."}, {"time": 9915, "text": "Because you've got low memory stuff, you can, things reoccur quickly."}, {"time": 9919, "text": "As you can get, build in more memory, you get to chemistry, so things become more contingent."}, {"time": 9924, "text": "When you get to biology, more contingent still, and then technology."}, {"time": 9927, "text": "So, the more memory you need, the more your laws are local."}, {"time": 9932, "text": "And the less memory, the more the laws are universal, because they're not laws."}, {"time": 9936, "text": "They are just low memory states."}, {"time": 9940, "text": "We have to talk about a thing you've kind of mentioned already a bunch of times, but doing computation through chemistry, chemical based computation."}, {"time": 9951, "text": "I've seen you refer to it as in a sexy title of Kemputation, Kemputation."}, {"time": 9960, "text": "So, what is computation?"}, {"time": 9962, "text": "What is chemical based computation?"}, {"time": 9966, "text": "Okay, so Kemputation is a name I gave to the process of building a state machine to make any molecule physically in the lab."}, {"time": 9975, "text": "And so, as a chemist, chemists make molecules by hand."}, {"time": 9979, "text": "And they're quite hard."}, {"time": 9982, "text": "The chemists have a lot of tacit knowledge, a lot of ambiguity."}, {"time": 9986, "text": "It's not possible to go uniformly to the literature and read a recipe to make a molecule, and then go and make it in the lab every time."}, {"time": 9995, "text": "Some recipes are better than others, but they all assume some knowledge."}, {"time": 10003, "text": "And it's not universal what that is."}, {"time": 10004, "text": "Like, so it's carried from human to human."}, {"time": 10009, "text": "Some of that implicit knowledge."}, {"time": 10011, "text": "And you're saying, can we remove the human from the patient?"}, {"time": 10013, "text": "Can we like a program?"}, {"time": 10015, "text": "Okay, well, by the way, what is a state machine?"}, {"time": 10018, "text": "So a state machine is a, I suppose, a object either abstract or mechanical where you can do a unit operation on it and flick it from one state to another."}, {"time": 10032, "text": "So a turnstile would be a good example of a state machine."}, {"time": 10035, "text": "There's some kinds of states and some kind of transitions between states."}, {"time": 10039, "text": "And it's very formal in nature in terms of like it's precise, how you're doing those transitions."}, {"time": 10045, "text": "Yes, you can mathematically precisely describe a state machine."}, {"time": 10049, "text": "So, I mean, a very simple Boolean gates are a very good way of building kind of logic based state machines."}, {"time": 10058, "text": "Obviously a Turing machine, the concept of a Turing machine where you have a tape and a read head and a series of rules in a table and you would basically look at what's on the tape."}, {"time": 10069, "text": "And if you're shifting the tape from left to right, and if you see a zero or one, you look in your lookup table and say, right, I've seen a zero and a one."}, {"time": 10077, "text": "I then do, I then respond to that."}, {"time": 10081, "text": "So in the turnstile would be, is there a human being pushing the turnstile in direction clockwise?"}, {"time": 10089, "text": "If yes, I will open, let them go."}, {"time": 10091, "text": "If it's anticlockwise, no."}, {"time": 10092, "text": "So yeah, so a state machine has some labels and a transition diagram."}, {"time": 10097, "text": "So you're looking to come up with a chemical computer to form state machines to create molecules, or what's the chicken and the egg?"}, {"time": 10109, "text": "So computation is not a chemical computer because we talked a few moments about actually doing computations with chemicals."}, {"time": 10115, "text": "What I'm now saying is I want to use state machines to transform chemicals."}, {"time": 10119, "text": "And so build chemicals programmatically."}, {"time": 10122, "text": "Yeah, I mean, I get in trouble saying this."}, {"time": 10124, "text": "I said to my group, oh, I shouldn't say it because it's, but I said, look, we should make the crack bot."}, {"time": 10129, "text": "Is it in the crack robot?"}, {"time": 10131, "text": "The robot that makes crack."}, {"time": 10132, "text": "The crack bot?"}, {"time": 10132, "text": "Oh, oh, oh, oh, crack bot."}, {"time": 10135, "text": "The robot that makes crack, but maybe we should scrub this from, but."}, {"time": 10140, "text": "Or, well, so maybe you can educate me on breaking bad with like math, right?"}, {"time": 10146, "text": "Yeah, so in breaking bad."}, {"time": 10147, "text": "You want to make basically some kind of mix of ex machina and breaking bad."}, {"time": 10157, "text": "For the record, I don't, but I said."}, {"time": 10158, "text": "I said, that's what I'm going to do once you release the papers."}, {"time": 10163, "text": "I shaved my head and I'm going to live a life of crime."}, {"time": 10170, "text": "So yeah, let's get back to, so indeed, it is about making drugs, but importantly, making important drugs, so let's."}, {"time": 10178, "text": "All drugs matter."}, {"time": 10179, "text": "Yeah, but let's go back."}, {"time": 10181, "text": "So the basic thesis is chemistry is very analog."}, {"time": 10186, "text": "There is no state machine."}, {"time": 10188, "text": "And I wandered into the, through the paper walls in the Japanese house a few years ago and said, okay, hey, organic chemist, why are you doing this analog?"}, {"time": 10198, "text": "They said, well, chemistry is really hard."}, {"time": 10200, "text": "You can't automate it, it's impossible."}, {"time": 10203, "text": "I said, but is it impossible?"}, {"time": 10205, "text": "They said, yeah."}, {"time": 10206, "text": "And they said, you know, I got the impression they were saying it's magic."}, {"time": 10209, "text": "And so when people tell me things are magic, it's like, no, no, they can't be magic."}, {"time": 10214, "text": "Right, so let's break this down."}, {"time": 10215, "text": "And so what I did is I went to my group one day about eight years ago and said, hey guys, I've written this new programming language for you."}, {"time": 10224, "text": "And so everything is clear."}, {"time": 10226, "text": "And you know, you have to, you're not allowed to just wander around the lab willy nilly."}, {"time": 10230, "text": "You have to pick up things in order, go to the balance of the right time and all this stuff."}, {"time": 10234, "text": "And they looked at me as if I was insane and basically kicked me out of the lab and said, no, don't do that, we're not doing that."}, {"time": 10240, "text": "So I went back the next day and said, I'm gonna find some money so we can make cool robots do chemical reactions."}, {"time": 10246, "text": "And everyone went, that's cool."}, {"time": 10248, "text": "And so in that process."}, {"time": 10251, "text": "The first we tried to convert the humans to become robots and next you agree you might as well just create the robots."}, {"time": 10257, "text": "Yes, but so in that, the formalization process."}, {"time": 10260, "text": "Yeah, so what I did is I said, look, chemical, to make a molecule, you need to do four things abstractly."}, {"time": 10264, "text": "I want to make a chemical Turing machine."}, {"time": 10267, "text": "Cause a Turing machine, you think about this, imagine a Turing machine."}, {"time": 10270, "text": "Turing machine is the ultimate abstraction of a computation because it's been shown by Turing and others that basically a universal Turing machine should be able to do all computations that you can imagine."}, {"time": 10283, "text": "It's like, wow, why don't I think of a Turing machine for chemistry?"}, {"time": 10286, "text": "Let's think of a magic robot that can make any molecule."}, {"time": 10289, "text": "Let's think about that for a second."}, {"time": 10292, "text": "How do we then implement it?"}, {"time": 10293, "text": "And I think it's right."}, {"time": 10294, "text": "So what is the abstraction?"}, {"time": 10295, "text": "So to make any molecule, you have to do a reaction."}, {"time": 10299, "text": "So you have to put reagents together, do a reaction in a flask typically."}, {"time": 10303, "text": "Then you're after the reaction, you have to stop the reactions."}, {"time": 10305, "text": "You do what's called a workup."}, {"time": 10307, "text": "So whatever, cool it down, add some liquid to it, extract."}, {"time": 10311, "text": "So then after you do the workup, you separate."}, {"time": 10313, "text": "So you then remove the molecules, separate them all out."}, {"time": 10315, "text": "And then the final step is purification."}, {"time": 10318, "text": "So reaction, workup, separate, purify."}, {"time": 10321, "text": "So this is basically exactly like a Turing machine where you have your tape, you have your tape head, you have some rules, and then you run it."}, {"time": 10330, "text": "So I thought, cool."}, {"time": 10331, "text": "I went to all the chemists and said, look, chemistry isn't that hard."}, {"time": 10335, "text": "Reaction, workup, separation, purification."}, {"time": 10338, "text": "Do that in cycles, forever, for any molecule, all the chemistry, done."}, {"time": 10343, "text": "And they said, chemistry is that hard."}, {"time": 10346, "text": "I said, but just in principle."}, {"time": 10348, "text": "And I got a few very enlightened people to say, yeah, okay, in principle, but it ain't gonna work."}, {"time": 10353, "text": "And this was in about 2013, 2014."}, {"time": 10356, "text": "And I found myself going to an architecture conference almost by accident."}, {"time": 10360, "text": "It's like, why am I at this random conference on architecture?"}, {"time": 10364, "text": "And that was because I published a paper on inorganic architecture."}, {"time": 10367, "text": "And they said, come to architecture conference."}, {"time": 10369, "text": "But the inorganic architecture is nano architecture."}, {"time": 10371, "text": "It's not, and I went, okay."}, {"time": 10373, "text": "And then I found these guys at the conference, 3D printing ping pong balls and shapes."}, {"time": 10377, "text": "And this is through it."}, {"time": 10378, "text": "3D printing was cool."}, {"time": 10379, "text": "And I was like, this is ridiculous."}, {"time": 10380, "text": "Why are you 3D printing ping pong balls?"}, {"time": 10381, "text": "And I gave them a whole load of abuse like I normally do when I first meet people, how to win friends and influence people."}, {"time": 10387, "text": "And then I was like, oh my God, you guys are geniuses."}, {"time": 10390, "text": "And so I got from, they were a bit confused because I was calling them idiots and then call them geniuses."}, {"time": 10394, "text": "It's like, will you come to my lab and we're gonna build a robot to do chemistry with a 3D printer."}, {"time": 10399, "text": "And I said, oh, that's cool, all right."}, {"time": 10400, "text": "So I had them come to the lab and we started to 3D print test tubes."}, {"time": 10404, "text": "So you imagine, you know, 3D print a bottle and then use the same gantry to basically, rather than to squirt out a plastic out of a nozzle, have a little syringe and jet chemicals in."}, {"time": 10416, "text": "So we had the 3D printer that could simultaneously print the test tube and then put chemicals into the test tube."}, {"time": 10422, "text": "Wow, so it's really end to end."}, {"time": 10424, "text": "Yeah, I was like, that would be cool because they've got G code to do it all."}, {"time": 10427, "text": "And I was like, that's cool."}, {"time": 10428, "text": "So I got my group doing this and I developed it a bit and I realized that we could take those unit operations."}, {"time": 10434, "text": "And we built a whole bunch of pumps and valves."}, {"time": 10437, "text": "And I realized that I could basically take the literature and I made the first version of the computer in 2016, 17."}, {"time": 10445, "text": "I made some architectural decisions."}, {"time": 10447, "text": "So I designed the pumps and valves in my group."}, {"time": 10449, "text": "I did all the electronics in my group."}, {"time": 10450, "text": "They were brilliant."}, {"time": 10452, "text": "I cannot pay tribute to my group enough in doing this."}, {"time": 10455, "text": "They were just brilliant."}, {"time": 10456, "text": "And there were some poor souls there that said, Lee, why are you making us design electronics?"}, {"time": 10461, "text": "I'm like, well, because I don't understand it."}, {"time": 10464, "text": "They're like, so you're making us design stuff because you don't understand."}, {"time": 10466, "text": "It's like, yeah, it's like, but can we not just buy some?"}, {"time": 10469, "text": "I said, well, we can, but then I don't understand how to, you know, what bus they're gonna use and there's serial ports and all this stuff."}, {"time": 10476, "text": "I just wanted, and I made, I came up with a decision to design a bunch of pumps and valves and use power of the ethernet."}, {"time": 10482, "text": "So they've got one cable for power and data, plug them all in, plug them all into a router and then I made the state machine."}, {"time": 10491, "text": "And there was a couple of cool things I did."}, {"time": 10493, "text": "Oh, they did actually."}, {"time": 10495, "text": "We got the abstraction."}, {"time": 10497, "text": "So reaction, workup, separation, purification."}, {"time": 10502, "text": "And then I made the decision to do it in batch."}, {"time": 10506, "text": "Now it's in batch."}, {"time": 10507, "text": "All chemistry had been digitized before apparently, and once it's been done, but everyone been doing it in flow and flow is continuous and there are infinities everywhere and you have to just, and I realized that I could actually make a state machine where I basically put stuff in the reactor, turn it up from one state to another state, stop it and just read it out."}, {"time": 10528, "text": "And okay, and I was kind of bitching at electrical engineers saying, you have it easy."}, {"time": 10532, "text": "You don't have to clean out the electrons, you know."}, {"time": 10534, "text": "Electrons don't leave a big mess."}, {"time": 10536, "text": "They leave some EM waste."}, {"time": 10537, "text": "But in my state machine I built in cleaning."}, {"time": 10539, "text": "So it's like, we do all the operation and then it cleans the backbone and then can do it again."}, {"time": 10543, "text": "So there's no, so what we managed to do over a couple of years is develop the hardware, develop the state machine."}, {"time": 10550, "text": "And we encoded three molecules."}, {"time": 10552, "text": "We did three, the first three, we did nitole, a sleeping drug, rafinamide, antiseizure and Viagra."}, {"time": 10557, "text": "You know, and I could make jokes on the paper."}, {"time": 10559, "text": "It's a hard problem, blah, blah, blah, blah."}, {"time": 10564, "text": "And then in the next one, what we did is said, okay, my poor organic chemist said, look, Lee, we've worked with you this long."}, {"time": 10571, "text": "We've made a robot that looks like it's gonna take our jobs away."}, {"time": 10574, "text": "And not just take our jobs away, what we love in the lab, but now we have to become programmers."}, {"time": 10580, "text": "But we're not even good programmers."}, {"time": 10582, "text": "We just have to spend ages writing lines of code that are boring and it's not as elegant."}, {"time": 10587, "text": "I went, you're right."}, {"time": 10588, "text": "So then, but I knew because I had this abstraction and I knew that there was language, I could suddenly develop a state machine that would interpret the language, which was lossy and ambiguous and populate my abstraction."}, {"time": 10602, "text": "So I built a chemical programming language that is actually gonna be recursively enumerable."}, {"time": 10606, "text": "It's gonna be a Turing complete language actually, which is kind of cool, which means it's formally verifiable."}, {"time": 10611, "text": "So where we are now is we can now read the literature using a bit of natural language processing."}, {"time": 10616, "text": "It's not the best."}, {"time": 10617, "text": "There are many other groups have done a better job, but we can use that language reading to populate the state machine and basically add, subtract."}, {"time": 10625, "text": "We got about a number of primitives that we, basically program loops that we dovetail together and we can make any molecule with it."}, {"time": 10635, "text": "Okay, so that's the kind of program synthesis."}, {"time": 10638, "text": "So you start at like literally, you're talking about like a paper, like a scientific paper that's being read."}, {"time": 10646, "text": "So natural language processing, extracting some kind of details about chemical reactions and the chemical molecules and compounds involved."}, {"time": 10658, "text": "And then that, in GPT terms, serves as a prompt for the program synthesis that's kind of trivial right now."}, {"time": 10669, "text": "There you have a bunch of different like for loops and so on that creates a program in this chemical language that can then be interpreted by the chemical computer, the computer."}, {"time": 10681, "text": "Yeah, computer, that's the word."}, {"time": 10683, "text": "Computer, yeah."}, {"time": 10685, "text": "Everything sounds better in your British accent, but it's, I love it."}, {"time": 10689, "text": "So the, into the computer and that's able to then basically be a 3D printer for these, for molecules."}, {"time": 10697, "text": "Yeah, I wouldn't call it a 3D printer."}, {"time": 10698, "text": "I would call it a universal chemical reaction system because 3D printing gives the wrong impression, but yeah."}, {"time": 10703, "text": "And it purifies."}, {"time": 10705, "text": "And the nice thing is that that code now that we call it, the KyDL code is really interesting because now, so computation, what is computation?"}, {"time": 10716, "text": "Computation is what computing is to mathematics, I think."}, {"time": 10721, "text": "Computation is the process of taking chemical code and some input reagents and making the same molecule, making the molecule reproducibly every time without fail."}, {"time": 10733, "text": "It's the process of using a program to take some input conditions and give you an output same every time, right, reliably."}, {"time": 10742, "text": "So the problem is, now maybe you can push back and correct me on this."}, {"time": 10747, "text": "So I know biology is messy."}, {"time": 10749, "text": "My question is how messy is chemistry?"}, {"time": 10752, "text": "So the, if we use the analogy of a computer, it's easier to make computation in a computer very precise, that it's repeatable and makes errors almost never."}, {"time": 10766, "text": "If it does the exact same way over and over and over and over."}, {"time": 10769, "text": "What about chemistry?"}, {"time": 10770, "text": "Is there messiness in the whole thing?"}, {"time": 10772, "text": "Can that be somehow leveraged?"}, {"time": 10773, "text": "Can that be controlled?"}, {"time": 10774, "text": "Can it be that removed, do we wanna remove it from the system?"}, {"time": 10778, "text": "Oh, yes and no, right."}, {"time": 10779, "text": "Is there messiness?"}, {"time": 10782, "text": "There is messiness because chemistry is like, you're doing reactions on billions of molecules and they don't always work, but you've got purification there."}, {"time": 10792, "text": "And so what we found is at the beginning, everyone said it can't work."}, {"time": 10795, "text": "It's gonna be too messy."}, {"time": 10796, "text": "It will just fail."}, {"time": 10798, "text": "And I said, but you managed to get chemistry to work in the lab."}, {"time": 10800, "text": "Are you magic?"}, {"time": 10801, "text": "Are you doing something?"}, {"time": 10802, "text": "So I would say, now go back to the first ever computer or the ENIAC, 5 million soldered joints, 400,000 valves that are exploding all the time."}, {"time": 10812, "text": "Was that, would you have gone, okay, that's messy."}, {"time": 10816, "text": "So we've got the, have we got the equivalent of the ENIAC in my lab?"}, {"time": 10821, "text": "We've got 15 computers in the lab now."}, {"time": 10823, "text": "And they, are they unreliable?"}, {"time": 10824, "text": "Yeah, they fall apart here and there, but are they getting better really quickly?"}, {"time": 10830, "text": "Are they now able to reliably make more, are we at the point in the lab where there are some molecules we would rather make on the computer than have a human being make?"}, {"time": 10838, "text": "Yeah, we've just done, we've just made a anti influenza molecule and some antivirals, six steps on the computer that would take a human being about one week to make Arbidol of continuous labor."}, {"time": 10854, "text": "And all they do now is load up the reagents, press go button and just go away and drink coffee."}, {"time": 10858, "text": "Wow, so this, I mean, and this is, you're saying this computer is just the early days."}, {"time": 10864, "text": "And so like some of the criticism just have to do with the early days."}, {"time": 10868, "text": "And yes, I would say this, something like this is quite impossible."}, {"time": 10875, "text": "So the fact that you're doing this is incredible."}, {"time": 10878, "text": "Not impossible, of course, but extremely difficult."}, {"time": 10880, "text": "It did seem really difficult."}, {"time": 10882, "text": "And I do keep pinching myself when I go in the lab."}, {"time": 10885, "text": "I was like, is it working?"}, {"time": 10885, "text": "Like, yep."}, {"time": 10886, "text": "And it's not, you know, it does clog, it does stop."}, {"time": 10890, "text": "You got to clean, this is great."}, {"time": 10892, "text": "It's, you know, but it's getting more reliable because I made some, we just made design decisions and said, we are not going to abandon the abstraction."}, {"time": 10901, "text": "If the von Neumann implementation was abandoned, I mean, think about what we do to semiconductors to really constrain them to what we do to silicon in a fab lab, we take computation for granted."}, {"time": 10915, "text": "Silicon is not in its natural state."}, {"time": 10917, "text": "We are doping the hell out of it."}, {"time": 10919, "text": "It's incredible what they're able to accomplish and achieve that reliability at the scale they do."}, {"time": 10923, "text": "Like you said, that's after Moore's law, what we have now."}, {"time": 10927, "text": "And where we, you know, how it started, you know, now we're here."}, {"time": 10934, "text": "We started at the bottom, now we're here."}, {"time": 10935, "text": "We have only have 20 million molecules."}, {"time": 10937, "text": "Well, say 20 million molecules in one database, maybe a few hundred million in all the pharmaceutical companies."}, {"time": 10943, "text": "And those few hundred million molecules are responsible for all the drugs that we've had in humanity, except, you know, biologics for the last 50 years."}, {"time": 10952, "text": "Now imagine what happens when a drug goes out of print, goes out of print because there's only a finite number of manufacturing facilities in the world that make these drugs."}, {"time": 10959, "text": "It goes out of print."}, {"time": 10961, "text": "Isn't that computer?"}, {"time": 10962, "text": "This is a printing press, but for chemistry."}, {"time": 10965, "text": "And not only that, we can protect the KyDL so we can stop bad actors doing it."}, {"time": 10969, "text": "We can encrypt them and we can give people license."}, {"time": 10971, "text": "KyDL, that's the name, sorry to interrupt, is the name of the programming language?"}, {"time": 10974, "text": "Yeah, the KyDL is the name of the programming language and the code we give the chemicals."}, {"time": 10978, "text": "So Ky, as in, you know, just for, it's actually like an XML format, but I've now taken it from script to a fully expressible programming language so we can do dynamics and there's for loops in there and conditional statements."}, {"time": 10993, "text": "Right, but the structure, it started out as like an XML type of thing."}, {"time": 11000, "text": "And also, the chemist doesn't need to program in KyDL."}, {"time": 11002, "text": "They can just go to the software and type in add A to B, reflux, do what they would normally do, and it just converts it to KyDL and they have a linter to check it and error correct."}, {"time": 11010, "text": "So how do you, you know, not with ASCII, but because it's a Greek letter, how do you go with, how do you spell it just using the English alphabet?"}, {"time": 11022, "text": "We just, XDL?"}, {"time": 11023, "text": "XDL, but all we use, we put in Ky. And it was named by one of my students and one of my postdocs many years ago and I quite liked it."}, {"time": 11030, "text": "It's like, it's important, I think, when the team are contributing to such big ideas, cause there's their ideas as well."}, {"time": 11037, "text": "I try not to just rename, I didn't call it Cronon or anything that, cause they keep saying, you know, is the chemistry, when they're putting stuff in the computer, one of my students said, we're asking now, is it Cronon complete?"}, {"time": 11050, "text": "And I was like, what does that mean?"}, {"time": 11051, "text": "I said, well, can we make it on the damn machine?"}, {"time": 11053, "text": "And I was like, oh, is that a compliment or a majority?"}, {"time": 11058, "text": "But they're like, well, it might be both."}, {"time": 11061, "text": "Yeah, so you tweeted, quote, why does chemistry need a universal programming language, question mark?"}, {"time": 11069, "text": "For all the reasons you can think of."}, {"time": 11071, "text": "Reliability, interoperability, collaboration, remove ambiguity, lower cost, increase safety, open up discovery, molecular customization, and publication of executable chemical code."}, {"time": 11086, "text": "Which is fascinating, by the way."}, {"time": 11089, "text": "Just publish code."}, {"time": 11091, "text": "And can you maybe elaborate a little bit more about this CHI DL, what does the universal language of chemistry look like?"}, {"time": 11101, "text": "A Cronon complete language."}, {"time": 11104, "text": "It's a Turing complete language, really."}, {"time": 11107, "text": "But, so what it has, it has a series of operators in it, like add, heat, stir."}, {"time": 11114, "text": "So there's a bunch of unit operations."}, {"time": 11117, "text": "And all it is, really, is just, it's with chemical engineers, when I talked about this, that you've just rediscovered chemical engineering."}, {"time": 11126, "text": "And I said, well, yeah, I know."}, {"time": 11127, "text": "I said, well, that's trivial."}, {"time": 11130, "text": "I said, well, not really."}, {"time": 11131, "text": "Well, yes, it is trivial, and that's why it's good, because not only have we rediscovered chemical engineering, we've made it implementable on the universal hardware that doesn't cost very much money."}, {"time": 11140, "text": "And so the CHI DL has a series of statements."}, {"time": 11143, "text": "Like define the reactor."}, {"time": 11146, "text": "So defines the reagents."}, {"time": 11149, "text": "So they're all labels, so you assign them."}, {"time": 11152, "text": "And what I also implemented at the beginning is, because I give all the hardware IP address, you put it on a graph."}, {"time": 11159, "text": "And so what it does is like the graph is equivalent to the processor firmware, the processor code."}, {"time": 11166, "text": "So when you take your CHI DL, and you go to run it on your computer, you can run it on any compatible hardware in any configuration, it says, what does your graph look like?"}, {"time": 11174, "text": "As long as I can solve the problem on the graph with these unit operations, and you have the resources available, it can compile."}, {"time": 11180, "text": "Chem piles."}, {"time": 11181, "text": "Ah ha."}, {"time": 11185, "text": "All right, we can carry on for years."}, {"time": 11187, "text": "But it is really, it's chempilation."}, {"time": 11189, "text": "Chempilation, yeah."}, {"time": 11189, "text": "And what it now does is it says, okay, the problem we have before is it was possible to do robotics for chemistry, but the robots were really expensive."}, {"time": 11199, "text": "They were unique."}, {"time": 11200, "text": "They were vendor locked."}, {"time": 11202, "text": "And what I want to do is to make sure that every chemist in the world can get access to machinery like this at virtually no cost, because it makes it safer."}, {"time": 11211, "text": "It makes it more reliable."}, {"time": 11213, "text": "And then if you go to the literature and you find a molecule that could potentially cure cancer, and let's say the molecule that could potentially cure cancer takes you three years to repeat, and maybe a student finishes their PhD in the time and they never get it back."}, {"time": 11227, "text": "So that it's really hard to kind of get all the way to that molecule, and it limits the ability of humanity to build on it."}, {"time": 11236, "text": "If they just download the code and can execute it, it turns, I would say the electronic laboratory notebook in chemistry is a data cemetery, because no one will ever reproduce it."}, {"time": 11248, "text": "For now, the data cemetery is a Jupiter notebook and you can just execute it."}, {"time": 11251, "text": "A notebook and people can play with it, the access to it."}, {"time": 11254, "text": "Reversion it."}, {"time": 11255, "text": "Orders of magnitude is increased."}, {"time": 11257, "text": "We'll talk about the, so as with all technologies, I think there's way more exciting possibilities, but there are also terrifying possibilities, and we'll talk about all of them."}, {"time": 11267, "text": "But let me just kind of linger on the machine learning side of this."}, {"time": 11271, "text": "So you're describing programming, but it's a language, I don't know if you've heard about OpenAI Codex, which is."}, {"time": 11279, "text": "Yeah, I'm playing with it."}, {"time": 11280, "text": "You're playing, of course you are."}, {"time": 11282, "text": "Yeah, you really are Rick from Rick and Morty."}, {"time": 11288, "text": "Okay, except philosophically deep."}, {"time": 11292, "text": "I mean, he is, I guess, kind of philosophically deep too."}, {"time": 11294, "text": "So for people who don't know, GPT, GPT3, that's a language model that can do natural language generation, so you can give it a prompt and it can complete the rest of it."}, {"time": 11306, "text": "But it turns out that that kind of prompt, it's not just completes the rest of it, it's generating like novel sounding text, and then you can apply that to generation of other kinds of stuff."}, {"time": 11320, "text": "So these kinds of transformer based language models are really good at forming deep representations of a particular space, like a medium, like language."}, {"time": 11334, "text": "So you can then apply it to specific subset of language like programming, so you can have it learn the representation of the Python programming language and use it to then generate syntactically and semantically correct programs."}, {"time": 11350, "text": "So you can start to make progress on one of the hardest problems in computer science, which is program synthesis."}, {"time": 11356, "text": "How do you write programs that accomplish different tasks?"}, {"time": 11359, "text": "So what OpenAI Codex does is it to generate those programs based on a prompt of some kind."}, {"time": 11368, "text": "Usually you can do a natural language prompt, so basically as you do when you program, you write some comment which serves the basic documentation of the inputs and the outputs and the function of the particular set of code and it's able to generate that."}, {"time": 11383, "text": "Point being is you can generate programs using machine learning, using neural networks."}, {"time": 11389, "text": "Those programs operate on the boring old computer."}, {"time": 11396, "text": "Can you generate programs that operate, this gotta be a clever version of programs for this, but can you write programs that operate on a computer?"}, {"time": 11406, "text": "Yep, there's actually software out there right now you can go and do it."}, {"time": 11411, "text": "Yeah, yeah, it's a heuristic, it's rule based, but we have, what we've done, inspired by Codex actually, is over the summer I ran a little workshop."}, {"time": 11423, "text": "Some of my groups got this inspired idea that we should get a load of students and ask them to manually collect data, to label chemical procedures into Kydy L. And we have a cool synth reader."}, {"time": 11438, "text": "So there's a bunch of people doing this right now, but they're doing it without abstraction."}, {"time": 11446, "text": "And because we have an abstraction that's implementable in the hardware, we've developed basically a chemical analog of Codex."}, {"time": 11454, "text": "When you say, sorry to interrupt, when you say abstraction in the hardware, what do you mean?"}, {"time": 11459, "text": "So right now, a lot of people doing machine learning and reading chemistry and saying, oh, you've got all these operations, add, shake, whatever, heat."}, {"time": 11467, "text": "But because they don't have a uniform, I mean, it's a couple of groups doing it, competitors actually, and they're good, very good."}, {"time": 11475, "text": "But they can't run that code automatically."}, {"time": 11480, "text": "They are losing meaning."}, {"time": 11484, "text": "And the really important thing that you have to do is generate context."}, {"time": 11489, "text": "And so what we've learned to do with our abstraction is make sure we can pull the context out of the text."}, {"time": 11496, "text": "And so can we take a chemical procedure and read it and generate our executable code?"}, {"time": 11503, "text": "What's the hardest part about that whole pipeline from the initial text, interpreting the initial text of a paper, extracting the meaningful context and the meaningful chemical information to then generating the program to then running that program in the hardware?"}, {"time": 11520, "text": "What's the hardest part about that pipeline as we look towards a universal Turing computer?"}, {"time": 11525, "text": "So the hardest thing with the pipeline is that the software, the model gets confused between some meanings, right?"}, {"time": 11538, "text": "So if, you know, chemists are very good at inventing words that aren't broken down."}, {"time": 11542, "text": "So I would, the classic word that you would use for boiling something is called reflux."}, {"time": 11548, "text": "So reflux is, you would have a solvent in a round bottom flask, at reflux it would be boiling, going up the reflux condenser and coming down."}, {"time": 11555, "text": "But that term reflux to reflux could be changed, you know, to people often make up words, new words, and then the software can fall over."}, {"time": 11567, "text": "But what we've been able to do is a bit like in Python or any programming language is identify when things aren't matched."}, {"time": 11575, "text": "So you present the code and you say, this isn't matched."}, {"time": 11577, "text": "You may want to think about this."}, {"time": 11578, "text": "And then the user goes and says, oh, I mean reflux and just ticks a box and collects it."}, {"time": 11582, "text": "So what the Codex or the Chemex does in this case is it just, it suggests the first go and then the chemist goes in and corrects it."}, {"time": 11594, "text": "And I really want the chemist to correct it because it's not safe, I believe, for it to allow AI to just read literature and generate code at this stage."}, {"time": 11605, "text": "Because now you're having actual, by the way, Chemex, nice, nice name, so you are unlike, which is fascinating."}, {"time": 11618, "text": "It's that we live in a fascinating moment in human history."}, {"time": 11622, "text": "But yes, you're literally connecting AI to some physical and like it's building something in the physical realm, especially in the space of chemistry that operates sort of invisibly."}, {"time": 11642, "text": "Yeah, yeah, I would say that's right."}, {"time": 11645, "text": "And it's really important to understand those labeling schemes, right?"}, {"time": 11649, "text": "And one of the things I was never, I was always worried about the beginning that the abstraction was gonna fall over."}, {"time": 11655, "text": "And the way we did it was just by brute force to start with."}, {"time": 11658, "text": "We just kept reading the literature and saying, is there anything new?"}, {"time": 11660, "text": "Can we add a new rule in?"}, {"time": 11661, "text": "And actually our KyDL language expanded, exploded."}, {"time": 11665, "text": "There was so many extra things we had to keep adding."}, {"time": 11668, "text": "And then I realized the primitives still were maintained and I could break them down again."}, {"time": 11672, "text": "So it's pretty good."}, {"time": 11675, "text": "I mean, there are problems."}, {"time": 11676, "text": "There are problems of interpreting any big sentence and turning it into an actionable code."}, {"time": 11680, "text": "And in Codex, it's not without its problems."}, {"time": 11682, "text": "You can crash it quite easily, right?"}, {"time": 11684, "text": "You can generate nonsense."}, {"time": 11685, "text": "But boy, it's interesting."}, {"time": 11687, "text": "I would love to learn to program now using Codex, right?"}, {"time": 11692, "text": "Just hacking around, right?"}, {"time": 11694, "text": "And I wonder if chemists in the future will learn to do chemistry by just hacking around with the system and writing different things."}, {"time": 11702, "text": "Because the key thing that we're doing with the chemistry is that where a lot of mathematical chemistry went wrong is people, and I think Wolfram does this in Mathematica, he assumes that chemistry is a reaction where atom A or molecule A reacts with molecule B to give molecule C. That's not what chemistry is."}, {"time": 11720, "text": "Chemistry is take some molecule, take a liquid or a solid, mix it up and heat it and then extract it."}, {"time": 11729, "text": "So the programming language is actually with respect to the process operations."}, {"time": 11735, "text": "And if you flick in process space, not in chemical graph space, you unlock everything because there's only a finite number of processes you need to do in chemistry."}, {"time": 11745, "text": "And that's reassuring."}, {"time": 11747, "text": "And so we're in the middle of it, it's really exciting."}, {"time": 11751, "text": "It's not the be all and the end all."}, {"time": 11753, "text": "And there is like I say, errors that can creep in."}, {"time": 11755, "text": "One day we might be able to do it without human interaction and you simulate it."}, {"time": 11759, "text": "And you'll know enough about the simulation that the lab won't catch fire."}, {"time": 11765, "text": "But there are so many safety issues right now that we've got to really be very careful, protecting the user, protecting the environment, protecting misuse."}, {"time": 11773, "text": "I mean, there's lots to discuss if you want to go down that route because it's very, very interesting."}, {"time": 11777, "text": "You don't want Novichoks being made or explosives being made or recreational drugs being made."}, {"time": 11786, "text": "But how do you stop a molecular biologist making a drug that's gonna be important for them looking at their particular assay on a bad actor trying to make methamphetamine?"}, {"time": 11798, "text": "I saw how you looked at me when you said bad actor, but that's exactly what I'm gonna do."}, {"time": 11802, "text": "I'm trying to get the details of this so I can be first."}, {"time": 11805, "text": "Don't worry, we can protect you from yourself."}, {"time": 11810, "text": "I'm not sure that's true, but that statement gives me hope."}, {"time": 11814, "text": "Does this ultimately excite you about the future or does it terrify you?"}, {"time": 11821, "text": "So let's, we mentioned that time is fundamental."}, {"time": 11827, "text": "It seems like you're at the cutting edge of progress that will have to happen, that will happen, that there's no stopping it."}, {"time": 11838, "text": "And I, as we've been talking about, I see obviously a huge number of exciting possibilities."}, {"time": 11844, "text": "So whenever you automate these kinds of things, just the world opens up."}, {"time": 11851, "text": "It's like programming itself and the computer, regular computer, has created innumerable applications."}, {"time": 11859, "text": "It made the world better in so many dimensions."}, {"time": 11863, "text": "And it created, of course, a lot of negative things that we, for some reason, like to focus on using that very technology to tweet about it."}, {"time": 11872, "text": "But I think it made a much better world, but it created a lot of new dangers."}, {"time": 11877, "text": "So maybe you can speak to when you have, when you kind of stand at the end of the road for building a really solid, reliable, universal computer."}, {"time": 11894, "text": "What are the possibilities that are positive?"}, {"time": 11896, "text": "What are the possibilities that are negative?"}, {"time": 11898, "text": "How can we minimize the chance of the negative?"}, {"time": 11902, "text": "So there's so many positive things, from drug discovery, from supply chain stress, for basically enabling chemists to basically build more productive in the lab, right?"}, {"time": 11912, "text": "Where this is, the computer's not gonna replace the chemist."}, {"time": 11915, "text": "There's gonna be a Moore's law of molecules, right?"}, {"time": 11917, "text": "There's gonna be so many more molecules we can design, so many more diseases we can cure."}, {"time": 11921, "text": "So chemists in the lab as researchers, that's better for science."}, {"time": 11924, "text": "So they can build a bunch of, like they could do science at a much more accelerated pace."}, {"time": 11930, "text": "So it's not just the development of drugs, it's actually like doing the basic understanding and the science of drugs."}, {"time": 11960, "text": "That's a really positive idea."}, {"time": 11962, "text": "The other thing is when drugs, so right now I think it's absolutely outrageous that not all of humanity has access to medicine."}, {"time": 11973, "text": "And I think the computer might be able to change that fundamentally because it will disrupt the way things are manufactured."}, {"time": 11978, "text": "So let's stop thinking about manufacturing in different factories."}, {"time": 11981, "text": "Let's say that computers, clinical grade computers or drug grade computers will be in facilities all around the world, and they can make things on demand as a function of the cost."}, {"time": 11994, "text": "Maybe people won't be able to afford the latest and greatest patent, but maybe they'll be able to get the next best thing and will basically democratize, make available drugs to everybody that they need."}, {"time": 12006, "text": "And there's lots of really interesting things there."}, {"time": 12010, "text": "So I think that's gonna happen."}, {"time": 12012, "text": "I think that now let's take the negative."}, {"time": 12016, "text": "Before we do that, let's imagine what happened, go back to a really tragic accident a few years ago, well not accident, an act of murder by that pilot on the, I think it was Eurowings or Swisswings."}, {"time": 12028, "text": "But what he did is plane took off, he waited till his pilot went to the toilet, he was a co pilot, he locked the door and then set the autopilot above the Alps, he set the altimeter or the descend height to zero."}, {"time": 12044, "text": "So the computer just took the plane into the Alps."}, {"time": 12048, "text": "Now, I mean, that was such a tragedy that obviously the guy was mentally ill, but it wasn't just a tragedy for him, it was for all the people on board."}, {"time": 12057, "text": "But what if, and I was inspired by this and my thinking, what can I do to anticipate problems like this in the computer?"}, {"time": 12065, "text": "Had the software, and I'm sure Boeing and Airbus will be thinking, oh, maybe I can give the computer a bit more situational awareness."}, {"time": 12072, "text": "So whenever one tries to drop the height of the plane and it knows it's above the Alps, we'll just say, oh no, computer says no, we're not letting you do that."}, {"time": 12080, "text": "Of course, he would have been able to find another way, maybe fly it until it runs out of fuel or something, but you know."}, {"time": 12085, "text": "Keep anticipating all the large number of trajectories that can go negative, all those kinds of running into the Alps and try to at least make it easy for the engineers to build systems that are protecting us."}, {"time": 12098, "text": "Yeah, and let's just think, what in the computer world right now with Kydeals, let's just not think about what I'm doing right now."}, {"time": 12105, "text": "What I'm doing right now is it's completely open, right?"}, {"time": 12107, "text": "Everyone's gonna know Kydeals and be playing with them, making them more easier and easier and easier."}, {"time": 12111, "text": "But what we're gonna start to do, it makes sense to encrypt the Kydeals in such a way, let's say you work for a pharmaceutical company and you have a license to make given molecule, well, you get issued with a license by the FDA or your local authority and they'll say, right, your license to do it, here it is, it's encrypted and the Kydeal gets run."}, {"time": 12132, "text": "So you have a license for that instance of use, easy to do."}, {"time": 12135, "text": "Computer science has already solved the problem."}, {"time": 12137, "text": "So the fact that we all trust online banking, right, the right now, then we can secure it."}, {"time": 12143, "text": "I'm 100% sure we can secure the computer."}, {"time": 12146, "text": "And because of the way we have a many, it's like the same mapping problem that you, to actually reverse engineer a Kydeal will be as hard as reverse engineering the encryption key, brute force, it will be cheaper to just actually buy the regulated medicine."}, {"time": 12164, "text": "And actually people aren't gonna want to then make their own fake pharmaceuticals because it'll be so cheap to do it."}, {"time": 12171, "text": "We'll drop the cost of access to drugs."}, {"time": 12173, "text": "Now what will happen?"}, {"time": 12174, "text": "Recreational drugs."}, {"time": 12176, "text": "People will start saying, well, I want access to recreational drugs."}, {"time": 12179, "text": "Well, it's gonna be up to, it's gonna accelerate that social discussion that's happening in the US and Canada and UK, everywhere, right?"}, {"time": 12187, "text": "Because cost goes down, access goes up."}, {"time": 12190, "text": "Giving cannabis THC to some people who've got epilepsy isn't literally, forgive the term, a no brainer because these poor people go from seizures like every day to maybe seizures just once every few months."}, {"time": 12202, "text": "That's an interesting idea to try to minimize the chance that it can get into like the hands of individuals like terrorists or people that want to do harm."}, {"time": 12212, "text": "Now with that kind of thing, you're putting a lot of power in the hands of governments, in the hands of institutions."}, {"time": 12220, "text": "And so then emerge the kind of natural criticism you might have of governments that can sometimes use these for ill, use them as weapons of war, not tools of betterment."}, {"time": 12234, "text": "So, and sometimes not just war against other nations, but war against its own people as it has been done throughout history."}, {"time": 12244, "text": "Well, I'm thinking, so there's another way of doing it, a decentralized peer to peer version where, and what you have to do, I'm not saying you should adopt a blockchain, but there is a way of maybe taking Kydeals and put them in blockchain."}, {"time": 12256, "text": "Here's an idea, let's just say, the way we're doing it in my lab right now is we go to the literature, we take a recipe to make a molecule, convert that to Kydeal and diligently make it in the robot and validate it."}, {"time": 12268, "text": "We, that, so we, I would call mining proof of work, proof of synthesis, right?"}, {"time": 12274, "text": "Proof of the synthesis."}, {"time": 12275, "text": "Yeah, yeah, but this is cool because suddenly when you actually synthesize it, you can get the analytical data, but there's also a fingerprint in there of the impurities that get carried across because you can never make one, something 100% pure."}, {"time": 12286, "text": "That fingerprint will allow you to secure your Kydeal."}, {"time": 12289, "text": "So what you do is encrypt those two things."}, {"time": 12291, "text": "So suddenly you can have people out there mining and what you could do perhaps is do the type of thing, we need to basically look at the way that contact tracing should have been done in COVID where people are given the information."}, {"time": 12305, "text": "So you have just been in contact with someone COVID, you choose, I'm not telling you to stay at home, you choose, right?"}, {"time": 12312, "text": "So now if we could imagine a similar thing, like, you know, you have got access to these chemicals, they will have these effects, you choose and publicize it, or maybe it's out somewhere, I don't know."}, {"time": 12322, "text": "I'm not a policymaker on this."}, {"time": 12325, "text": "And what my job here is to not just make the technology possible, but to have as open as a discussion as possible with people to say, hey, can we stop childhood mortality with this technology?"}, {"time": 12336, "text": "And do those benefits outweigh the one off where people might use it for terrorism or people might use it for recreational drugs?"}, {"time": 12345, "text": "Chemify, which is the name of the entity that will make this happen, I think we have some social responsibilities as an entity to make sure that we're not enabling people to manufacture personal drugs, weapons at will."}, {"time": 12356, "text": "And what we have to do is have a discussion with society, with the people that invest in this, with people that are gonna pay for this, to say, well, do you wanna live longer?"}, {"time": 12365, "text": "And do you wanna be healthier?"}, {"time": 12367, "text": "And are you willing to accept some of the risks?"}, {"time": 12369, "text": "And I think that's a discussion to have."}, {"time": 12371, "text": "So by the way, when you say personal drugs, do you mean the illegal ones?"}, {"time": 12376, "text": "Or do you have a concern of just putting the manufacturer of any kind of illegal drugs in the hands of regular people?"}, {"time": 12385, "text": "Cause they might, like dose matters."}, {"time": 12388, "text": "They might take way too much."}, {"time": 12389, "text": "I mean, I would say, to be honest, the chances of computers being, well, shouldn't always never."}, {"time": 12395, "text": "So the fact I can now say this means it's totally gonna come true, right?"}, {"time": 12399, "text": "And I'm going to do it."}, {"time": 12400, "text": "I cannot imagine that computers will be in people's houses anytime soon, but they might be at the local pharmacy, right?"}, {"time": 12408, "text": "And if you've got a drug manufacturing facility in every town, then you just go and they give you a prescription."}, {"time": 12414, "text": "They do it in such a way, they format it so that you don't have to take 10 pills every day."}, {"time": 12419, "text": "You get one manufactured for you that has all the materials you need and the right distribution."}, {"time": 12425, "text": "But you mentioned recreational drugs."}, {"time": 12427, "text": "And the reason I mention it, cause I know people are going to speak up on this."}, {"time": 12432, "text": "If the drug is legal, there's to me, no reason why you can't manufacture it for recreation."}, {"time": 12438, "text": "I mean, you can do it right now."}, {"time": 12439, "text": "What do you have against fun, Lee?"}, {"time": 12442, "text": "I have, so I mean, I'm a chemistry professor in a university who's an entrepreneur as well."}, {"time": 12449, "text": "I just think I need to be as responsible as I can in the discussion."}, {"time": 12453, "text": "Sure, no, sure, sure."}, {"time": 12455, "text": "But I know, so let me be the one that says like there's nothing, cause you have said recreational drugs and like terrorism in the same sentence."}, {"time": 12464, "text": "I think let's make sure we draw a line that there's real dangers to the world of terrorists of bio warfare."}, {"time": 12473, "text": "And then there's a little bit of weed."}, {"time": 12475, "text": "So I haven't, I mean, I think it's up to the society to tell his governments what it wants, what's acceptable, right?"}, {"time": 12484, "text": "And if it becomes, let's say that THCs become heavily acceptable and that you can modify them."}, {"time": 12492, "text": "So let's say there's, let's say it's like blood type."}, {"time": 12495, "text": "There's a particular type of THC that you tolerate better than I do."}, {"time": 12500, "text": "Then why not have a machine that makes the one you like?"}, {"time": 12503, "text": "And then, and why not?"}, {"time": 12504, "text": "It's the perfect brownie."}, {"time": 12506, "text": "Yeah, and I think that that's fine."}, {"time": 12509, "text": "But I'm, we're so far away from that."}, {"time": 12512, "text": "I can barely get the thing to work in the lab, right?"}, {"time": 12514, "text": "And I mean, it's reliability and all this other stuff, but what I think is gonna happen in the short term, it's gonna turbocharge molecular discovery reliability and that will change the world."}, {"time": 12525, "text": "That's super exciting."}, {"time": 12526, "text": "You have a draft of a paper titled Autonomous Intelligent Exploration, Discovery and Optimization of Nanomaterials."}, {"time": 12533, "text": "So we are talking about automating engineering of nanomaterials."}, {"time": 12541, "text": "And as we continue down this thread of the positives and the worrisome, what are the things we should be excited about?"}, {"time": 12549, "text": "And what are the things we should be terrified about?"}, {"time": 12552, "text": "And how do we minimize the chance of the terrifying consequences?"}, {"time": 12558, "text": "So in this robot, the robot does all the heavy lifting."}, {"time": 12561, "text": "So the robot basically is an embodied AI."}, {"time": 12564, "text": "I really like AI in a domain specific way."}, {"time": 12569, "text": "One of the, as you should say at this point, there was an attempt in the 60s, Joshua Leidenberg and some really important people did this that made an AI to try and guess if organic molecules and the mass spectrometer were alien or not."}, {"time": 12584, "text": "And they failed because they didn't have assembly theory."}, {"time": 12588, "text": "And when I, and I, and that."}, {"time": 12589, "text": "Wait, what does assembly theory give you about alien versus human life?"}, {"time": 12593, "text": "Well, no, it just, it tells you about unknown, the degree of unknowns."}, {"time": 12596, "text": "You can fingerprint stuff."}, {"time": 12597, "text": "They weren't looking at, they were trying to basically just look at the corpus of complex organic molecules."}, {"time": 12604, "text": "So when I was a bit down about assembly theory, cause I couldn't convince referees and couldn't convince computational people interested in computational complexity, I was really quite depressed about it."}, {"time": 12616, "text": "And I mean, I've been working with Sarah Walker's team and I think she, you know, I think she also invented an assembly theory somewhere."}, {"time": 12623, "text": "We can talk about it later."}, {"time": 12625, "text": "When I found the AI not working for the dendrial project, I suddenly realized I wasn't totally insane."}, {"time": 12634, "text": "Coming back to this nano robot."}, {"time": 12637, "text": "So what it does is it basically, like a computer, but now what it does is it squirts a liquid with gold in it in a test tube and it adds some reducing agents, so some electrons to make the gold turn into a nanoparticle."}, {"time": 12653, "text": "Now, when gold becomes a nanoparticle, it gets a characteristic color, a plasmon."}, {"time": 12656, "text": "So it's a bit like if you look at the sheen on the gold wedding ring or gold bar or something, those are the ways that conducting electrons basically reflect light."}, {"time": 12665, "text": "What we did is we randomly squirt the gold, the gold particle and the reducing agent and then we measure the UV, we measure the color."}, {"time": 12673, "text": "And so what we do is we've got, the robot has a mind."}, {"time": 12676, "text": "So it has a mind where in a simulation, it randomly generates nanoparticles and the plasmon, the color that comes out, randomly imagines in its head."}, {"time": 12687, "text": "It then with the others, that's the imaginary side of the robot."}, {"time": 12689, "text": "In the physical side of the robot, it squirts in the chemicals and looks at the color and it uses a genetic algorithm and a map elite actually on it."}, {"time": 12698, "text": "And it goes around in cycles and refines the color to the objective."}, {"time": 12705, "text": "Now we use two different points."}, {"time": 12706, "text": "We have an exploration and an optimization."}, {"time": 12710, "text": "They're two different."}, {"time": 12711, "text": "So the exploration just says, just do random stuff and see how many different things you can get."}, {"time": 12715, "text": "And when you get different things, try and optimize and make the peak sharper, sharper, sharper."}, {"time": 12720, "text": "And what it does after a number of cycles is it physically takes a sample of the optimized nanomaterial, resets all of the round bottom flasks, cleans them and puts the seed, physical seed back in."}, {"time": 12734, "text": "And then what this robot is able to do is search a space of 10 to the 23 possible reactions in just a thousand experiments in three days."}, {"time": 12744, "text": "And it makes five generations of nanoparticles which get nicer and nicer in terms of shape and color and definition."}, {"time": 12750, "text": "And then at the end, it outputs a Kydl code."}, {"time": 12753, "text": "That could then be."}, {"time": 12754, "text": "Wow, it's doing the search for programs in the physical space."}, {"time": 12759, "text": "So it's doing a kind of reinforcement learning."}, {"time": 12762, "text": "Yeah, yeah, in the physical space."}, {"time": 12764, "text": "With the exploration and the optimization."}, {"time": 12766, "text": "And that Kydl will work on any computer or any qualified hardware."}, {"time": 12769, "text": "So now that's it."}, {"time": 12770, "text": "That's now that's a general piece of code that can replicate somewhat maybe perfectly what it created."}, {"time": 12780, "text": "But the nanoparticles themselves are done."}, {"time": 12782, "text": "The robot has all the thinking."}, {"time": 12783, "text": "So we don't try and imply any self replication or try and get the particles to make themselves."}, {"time": 12789, "text": "Although it would be cool to try."}, {"time": 12791, "text": "So, well, there you go."}, {"time": 12793, "text": "That's, those are famous last words for the end of human civilization."}, {"time": 12796, "text": "Would be cool to try."}, {"time": 12797, "text": "So is it possible to create molecules that start approaching this question that we started this conversation, which is the origin of life."}, {"time": 12809, "text": "To start to create molecules that have lifelike qualities."}, {"time": 12813, "text": "So have the replication, have like complex, start to create complex organisms."}, {"time": 12820, "text": "So we have done this with the oxides."}, {"time": 12822, "text": "I talked about earlier with the moxides and the rings and the bulls."}, {"time": 12825, "text": "And the problem is that, well, they do, they auto catalytically enhance one another."}, {"time": 12832, "text": "So they would, I guess you would call it self replication."}, {"time": 12835, "text": "But because there's limited function and mutation, they're pretty dumb."}, {"time": 12842, "text": "So they don't do very much."}, {"time": 12844, "text": "So I think the prospect of us being able to engineer a nano material life form in the short term, like I said earlier, my aim is to do this, of course."}, {"time": 12856, "text": "I mean, on one hand, I'm saying it's impossible."}, {"time": 12858, "text": "On the other hand, I'm saying I'm doing it."}, {"time": 12859, "text": "So which is it, Lee?"}, {"time": 12860, "text": "It's like, well, I think we can do it, but only in the robot."}, {"time": 12864, "text": "So the causal chain that's gonna allow it is in the robot."}, {"time": 12867, "text": "These particles, if they do start to self replicate, the system's gonna be so fragile that I don't think anything dangerous will come out."}, {"time": 12875, "text": "It doesn't mean we shouldn't treat them as potentially, I mean, I don't want to scare people like gain of function."}, {"time": 12883, "text": "We're gonna produce stuff that comes out."}, {"time": 12885, "text": "Our number one kill switch is that we always try to search a space of objects that don't exist in the environment."}, {"time": 12895, "text": "So even if something got out, it just would die immediately."}, {"time": 12898, "text": "It's like making a silicon life form or something."}, {"time": 12902, "text": "Which is the opposite of oftentimes gain of function research is focused on how do you get a dangerous thing to be closer to something that works with humans?"}, {"time": 12912, "text": "To have it jump to humans."}, {"time": 12913, "text": "So that's the one good mode to operate on is always try to operate on chemical entities that are very different than the kind of chemical environment that humans operate in."}, {"time": 12926, "text": "Yeah, and also, I mean, I'll say something dramatic, which may not be true."}, {"time": 12933, "text": "So I should be careful."}, {"time": 12935, "text": "If let's say we did discover a new living system but it was made out of a shadow biosphere and we just released it in the environment, who cares?"}, {"time": 12945, "text": "It's gonna use different stuff."}, {"time": 12948, "text": "Yeah, it'll just live."}, {"time": 12950, "text": "Just live, yeah."}, {"time": 12951, "text": "I found one of my biggest fantasies is actually is like a planet that's basically half in the sun, it doesn't rotate, right?"}, {"time": 12959, "text": "And you have two different origins of life on that planet and they don't share the same chemistry."}, {"time": 12965, "text": "And then the only way time they recognize each other is when they become intelligent, they go, well, what's that moving?"}, {"time": 12972, "text": "So they co evolve and that's fascinating."}, {"time": 12974, "text": "I mean, so one fascinating thing to do is exactly what you were saying, which is a life bomb, which is like try to focus on atmospheres or chemical conditions of other planets and try within this kind of exploration optimization system try to discover life forms that can work in those conditions and then you send those life forms over there and see what kind of stuff they build up."}, {"time": 13004, "text": "Like you can do like a large scale, it's kind of a safe physical environment to do large scale experiments, it's another planet."}, {"time": 13013, "text": "Yeah, so look, I'm gonna say something quite contentious."}, {"time": 13015, "text": "I mean, Elon wants to go to Mars, I think it's brilliant wants to go to Mars, but I would counter that and say, is Elon just obsessed with getting humanity?"}, {"time": 13023, "text": "Or Earth, or what about just technology?"}, {"time": 13026, "text": "So if we do technology, so Elon either needs to take a computer to Mars because he needs to manufacture drugs on demand, because zero cost payload and all that stuff is just code."}, {"time": 13036, "text": "Or what we do is we actually say, hang on, it's quite hard for humans to survive on Mars."}, {"time": 13041, "text": "Why don't we write a series of origin of life algorithms where we embed our culture in it?"}, {"time": 13046, "text": "It's a very Ridley spot Prometheus, which is a terrible film by the way, but anyway."}, {"time": 13051, "text": "And dump it on Mars and just terraform Mars."}, {"time": 13057, "text": "And what we do is we evolve life on Mars that is suited to life on Mars, rather than brute forcing human life on Mars."}, {"time": 13064, "text": "So one of the questions is, what is human culture?"}, {"time": 13068, "text": "What are the things you encode?"}, {"time": 13070, "text": "Some of it is knowledge, some of it is information."}, {"time": 13072, "text": "But the thing that Elon talks about, the thing I think about, I think you think about as well is some of the more unique aspects of what makes us human, which is our particular kind of consciousness."}, {"time": 13089, "text": "So he talks about the flame of human consciousness."}, {"time": 13093, "text": "That's one of the questions is, can we instill consciousness into other beings?"}, {"time": 13102, "text": "Because that's a sad thought that whatever this thing inside our minds, that hopes and dreams and fears and loves can all die."}, {"time": 13113, "text": "Yeah, but I think you already know the answer to that question."}, {"time": 13117, "text": "I have a robot lawnmower at home."}, {"time": 13120, "text": "My kids call it CC, cool car."}, {"time": 13122, "text": "It's a robo mower."}, {"time": 13124, "text": "And the way it works, it has an electric field around the perimeter and it just tell it the area."}, {"time": 13129, "text": "And it goes out and goes from its base station, just mows a bit."}, {"time": 13134, "text": "Gets to the perimeter, detects perimeter, then chooses a random angle, rotates around and goes on."}, {"time": 13140, "text": "My kids call it cool cutter."}, {"time": 13142, "text": "It's a she."}, {"time": 13142, "text": "I don't know why it's a she."}, {"time": 13143, "text": "They just, when they were like quite young, they called it, I don't want to be sexist there."}, {"time": 13148, "text": "It could be a he, but they liked."}, {"time": 13151, "text": "They gendered the lawnmower?"}, {"time": 13153, "text": "They gendered the lawnmower."}, {"time": 13155, "text": "But I was thinking this lawnmower, if you apply integrated information theory to lawnmower, the lawnmower is conscious."}, {"time": 13162, "text": "Now, integrated information theory is, people say it's a flawed way of measuring consciousness, but I don't think it is."}, {"time": 13169, "text": "I think assembly theory actually measures consciousness in the same way."}, {"time": 13173, "text": "Consciousness is something that is generated over a population of objects, of humans."}, {"time": 13178, "text": "Consciousness didn't suddenly spring in."}, {"time": 13180, "text": "Our consciousness has evolved together, right?"}, {"time": 13183, "text": "The fact we're here and the robots we leave behind, they will have some of that."}, {"time": 13187, "text": "So we won't lose it all."}, {"time": 13189, "text": "Sure, consciousness requires that we have many models being generated."}, {"time": 13192, "text": "It's not just one domain specific AI, right?"}, {"time": 13195, "text": "I think the way to create consciousness, I'm going to say unashamedly, the best way to make a consciousness is in a chemical system because you just have access to many more states."}, {"time": 13205, "text": "And the problem right now, we're making silicon consciousness because you just don't have enough states."}, {"time": 13210, "text": "So there are more possible states, or sorry, there are more possible configurations possible in your brain than there are atoms in the universe."}, {"time": 13217, "text": "And you can switch between them."}, {"time": 13220, "text": "You can't do that on a core I10."}, {"time": 13222, "text": "It's got 10 billion, 12 billion, 14 billion transistors, but you can't reconfigure them as dynamically."}, {"time": 13228, "text": "Well, you've shared this intuition a few times already that the larger number of states somehow correlates to greater possibility of life, but it's also possible the constraints are essential here."}, {"time": 13243, "text": "I mean, but coming back to the, you worry that something's lost."}, {"time": 13246, "text": "I agree, but I think that we will get to an AGI, but I wonder if it's not, it can't be separate from human, it can't be separate from human consciousness because the causal chain that produced it came from humans."}, {"time": 13263, "text": "So what I kind of try and suggest heavily to people worry about the existential threat of AI saying, I mean, you put it much more elegantly earlier, like we should worry about algorithms on, dumb algorithms written by human beings on Twitter driving us insane, right?"}, {"time": 13281, "text": "And doing acting in odd ways."}, {"time": 13283, "text": "Yeah, I think intelligence, this is what I have been in eloquent in trying to describe it partially because I try not to think too deeply through this stuff because then you become a philosopher."}, {"time": 13296, "text": "I still aspire to actually building a bunch of stuff."}, {"time": 13300, "text": "But my sense is super intelligence leads to deep integration to human society."}, {"time": 13308, "text": "So like intelligence is strongly correlated."}, {"time": 13311, "text": "Like intelligence, the way we conceive of intelligence materializes as a thing that becomes a fun entity to have at a party and with humans."}, {"time": 13326, "text": "So like it's a mix of wit, intelligence, humor, like intelligence, like knowledge, ability to do reasoning and so on, but also humor, emotional intelligence, ability to love, to dream, to share those dreams, to play the game of human civilization, the push and pull, the whole dance of it, the whole dance of life."}, {"time": 13351, "text": "And I think that kind of super intelligent being is not the thing that worries me."}, {"time": 13358, "text": "I think that ultimately will enrich life."}, {"time": 13361, "text": "It's again, the dumb algorithms, the dumb algorithms that scale in the hands of people that are too, don't study history, that don't study human psychology and human nature, just applying too broadly for selfish near term interests."}, {"time": 13377, "text": "That's the biggest danger."}, {"time": 13378, "text": "Yeah, I think it's not a new danger, right?"}, {"time": 13381, "text": "I now know how I should use Twitter and how I shouldn't use Twitter, right?"}, {"time": 13387, "text": "I like to provoke people into thinking."}, {"time": 13389, "text": "I don't want to provoke people into outrage."}, {"time": 13391, "text": "It's not fun."}, {"time": 13392, "text": "It's not a good thing for humans to do, right?"}, {"time": 13394, "text": "And I think that when you get people into outrage, they take sides and taking sides is really bad."}, {"time": 13400, "text": "But I think that we're all beginning to see this."}, {"time": 13402, "text": "And I think that actually I'm very optimistic about how things will evolve because, you know, I wonder how much productivity has Twitter and social media taken out of humanity?"}, {"time": 13413, "text": "Because how many now, I mean, so the good thing about Twitter is it gives power, so it gives voice to minorities, right?"}, {"time": 13421, "text": "And that's good to some degree."}, {"time": 13424, "text": "But I wonder how much voice does it give to all sorts of other problems that don't need this emerge?"}, {"time": 13434, "text": "By the way, when you say minorities, I think, or at least if I were to agree with you, what I would say is minorities broadly defined in these small groups of people that it magnifies the concerns of the small versus the big."}, {"time": 13452, "text": "That is good to some degree."}, {"time": 13455, "text": "But I think, I mean, I have to be careful because I think I have a very, I mean, I think that the world isn't that broken, right?"}, {"time": 13463, "text": "I think the world is pretty cool place."}, {"time": 13465, "text": "I think academia is really great."}, {"time": 13466, "text": "I think climate change presents a really interesting problem for humanity that we will solve."}, {"time": 13473, "text": "I like how you said it."}, {"time": 13474, "text": "It's a pretty cool problem for civilization."}, {"time": 13477, "text": "It's a big one."}, {"time": 13478, "text": "Well, it's a bunch of it."}, {"time": 13479, "text": "There's a bunch of really, really big problems that if solved can significantly improve the quality of life or learn."}, {"time": 13487, "text": "That ultimately is what we're trying to do, improve how awesome life is for the maximum number of people."}, {"time": 13493, "text": "Yeah, and I think that the coming back to consciousness, I don't think the universe is doomed to heat death, right?"}, {"time": 13500, "text": "It's one of the optimists."}, {"time": 13501, "text": "That's why I want to kind of nudge you into thinking that time is fundamental because if time is fundamental, then suddenly you don't have to give it back."}, {"time": 13509, "text": "The universe just constructs stuff."}, {"time": 13511, "text": "And what we see around us in our construction, I know everyone's worried about how fragile civilization is."}, {"time": 13516, "text": "And I mean, look at the fundamentals."}, {"time": 13517, "text": "We're good until the sun expands, right?"}, {"time": 13522, "text": "We've got quite a lot of resource on earth."}, {"time": 13523, "text": "We're trying to be quite cooperative."}, {"time": 13525, "text": "Humans are nice to each other when they're not under enormous stress."}, {"time": 13531, "text": "But coming back to the consciousness thing, are we going to send human beings to Mars or conscious robots to Mars?"}, {"time": 13538, "text": "Or are we gonna send some hybrid?"}, {"time": 13540, "text": "And I don't know the answer to that question right now."}, {"time": 13543, "text": "I guess, you know, Elon is gonna have a pretty good go at getting there."}, {"time": 13546, "text": "I'm not sure whether, I have my doubts, but I'm not qualified."}, {"time": 13552, "text": "I'm sure people have their doubts that computation works, but I've got it working."}, {"time": 13558, "text": "And I, you know."}, {"time": 13559, "text": "And most of the cool technologies we have today and take for granted, like the airplane, a aforementioned airplane, were things that people doubted."}, {"time": 13571, "text": "Like majority of people doubted before they came to life and they come to life."}, {"time": 13576, "text": "And speaking of hybrid AI and humans, it's fascinating to think about all the different ways that hybridization, that merger can happen."}, {"time": 13585, "text": "I mean, we have, currently have the smartphone, so there's already a hybrid, but there's all kinds of ways that hybrid happens."}, {"time": 13591, "text": "How we and other technology play together, like a computer, how that changes the fabric of human civilization is like wide open."}, {"time": 13602, "text": "If you remove, if you remove cancer, if you remove major diseases from humanity, there's going to be a bunch of consequences we're not anticipating."}, {"time": 13617, "text": "Many of them positive, but many of them negative."}, {"time": 13621, "text": "Many of them, most of them, at least I hope, are weird and wonderful and fun in ways that are totally unexpected."}, {"time": 13628, "text": "And we sitting on a porch with a bottle of Jack Daniels and a rocker will say, kids these days don't appreciate how hard we had it back in the day."}, {"time": 13637, "text": "I gotta ask you, speaking of nudging, you and Joscha Bach nudge each other on Twitter quite a bit in wonderful intellectual debates."}, {"time": 13649, "text": "And of course, for people who don't know Joscha Bach, he's this brilliant guy."}, {"time": 13652, "text": "He's been on the podcast a couple times."}, {"time": 13655, "text": "You tweeted, or he tweeted, Joscha Bach, everyone should follow him as well."}, {"time": 13661, "text": "You should definitely follow Mr. Lee Cronin, Dr. Lee Cronin."}, {"time": 13664, "text": "He tweeted, dinner with Lee Cronin."}, {"time": 13668, "text": "We discussed that while we can translate every working model of existence into a Turing machine, the structure of the universe might be given by weeks of nonexistence in a pattern generated by all possible automata, which exist by default."}, {"time": 13685, "text": "And then he followed on saying face to face is the best."}, {"time": 13689, "text": "So the dinner was face to face."}, {"time": 13692, "text": "What is Joscha talking about in weeks, quote, weeks of nonexistence in a pattern generated by all possible automata, which exist by default."}, {"time": 13705, "text": "So automata exist by default, apparently."}, {"time": 13709, "text": "And then there's weeks of nonexistence."}, {"time": 13711, "text": "What the hell is nonexistence in the universe?"}, {"time": 13714, "text": "That's, and also in another conversation, you tweeted it's state machines all the way down, which presumably is the origin story of this discussion."}, {"time": 13727, "text": "And then Joscha said, again, nudging, nudging, nudging slash trolling, Joscha said, you've seen the light, welcome friend."}, {"time": 13739, "text": "Many foundational physicists effectively believe in some form of hyper computation."}, {"time": 13744, "text": "Lee is coming around to this idea."}, {"time": 13747, "text": "And then you said, I think there are notable differences."}, {"time": 13750, "text": "First, I think the universe does not have to be a computer."}, {"time": 13753, "text": "Second, I want to understand how the universe emerges, constructors that build computers."}, {"time": 13758, "text": "And third is that there is something below church touring."}, {"time": 13764, "text": "Okay, what the heck is this dinner conversation about?"}, {"time": 13770, "text": "Maybe put another way, maybe zooming out a little bit."}, {"time": 13774, "text": "Are there interesting agreements or disagreements between you and Joscha Bach that can elucidate some of the other topics we've been talking about?"}, {"time": 13784, "text": "Yeah, so Jascha has an incredible mind and he has, he's so well read and uses language really elegantly."}, {"time": 13793, "text": "It bamboozles me at times."}, {"time": 13794, "text": "So I'm, so often I'm using, I'm describing concepts in a way that I built from the ground up."}, {"time": 13803, "text": "And so we misunderstand each other a lot."}, {"time": 13805, "text": "And he's floating in the clouds, is that what you're saying?"}, {"time": 13808, "text": "Something like, not quite, but I think, so this concept of a Turing machine."}, {"time": 13811, "text": "So a Turing machine, Turing machines, I would argue, and I think this is not, the Turing machine, the universe is not a Turing machine."}, {"time": 13821, "text": "Biology is not even a Turing machine, right?"}, {"time": 13823, "text": "And because Turing machines don't evolve, right?"}, {"time": 13825, "text": "There is this problem that people see Turing machines everywhere, but isn't it interesting the universe gave rise to biology that gave rise to intelligence, that gave rise to Alan Turing, who invented the abstraction of the Turing machine and allowed us to digitize."}, {"time": 13839, "text": "And so I've been looking for the mystery at the origin of life, the origin of intelligence and the origin of this."}, {"time": 13846, "text": "And I, when I discussed with Yasha, I think Yasha, he was saying, well, the universe, of course the universe is a Turing machine."}, {"time": 13853, "text": "Of course there's a hyper computer there."}, {"time": 13856, "text": "And I think we got kind of trapped in our words and terms because of course it's possible for a Turing machine or computers to exist in the universe."}, {"time": 13864, "text": "We have them."}, {"time": 13865, "text": "But what I'm trying to understand is where did the transition of continuous discrete occur?"}, {"time": 13871, "text": "And I've been, and this is because of my general foolishness of understanding the continuous."}, {"time": 13879, "text": "But I guess what I'm trying to say is there were constructors before there were abstractors because how did the universe abstract itself into existence?"}, {"time": 13891, "text": "And it goes back to earlier saying, could the universe of intelligence have come first?"}, {"time": 13895, "text": "What's a constructor, what's an abstractor?"}, {"time": 13910, "text": "And then from those labels to come up with a set of axioms with those labels and to basically understand the universe mathematically and say, okay, I can label things."}, {"time": 13921, "text": "Where did the labeler come from?"}, {"time": 13923, "text": "Where is the prime labeler?"}, {"time": 13924, "text": "Even if the universe is not a Turing computer, does that negate the possibility that a Turing computer can simulate the universe?"}, {"time": 13936, "text": "Just because the abstraction was formed at a later time, does that mean that abstraction, this is to our cellular automata conversation."}, {"time": 13945, "text": "You were taking away some of the magic from the cellular automata because very intelligent biological systems came up with that cellular automata."}, {"time": 13952, "text": "Well, this is where the existence is the default, right?"}, {"time": 13954, "text": "Is it, does the fact that we exist and we can come up with a Turing machine, does that mean the universe has to be a Turing machine as well?"}, {"time": 13961, "text": "But can it be a Turing machine though?"}, {"time": 13964, "text": "That's a, so the has to be and the can it be."}, {"time": 13966, "text": "Can it be?"}, {"time": 13970, "text": "I don't know, I don't understand if it has to be or not, can it be?"}, {"time": 13974, "text": "But can the universe have Turing machines in it?"}, {"time": 13977, "text": "Sure, they exist now."}, {"time": 13981, "text": "I'm wondering though, maybe, and this is where things get really hairy, is I think the universe maybe in the past did not have the computational power that it has now."}, {"time": 13997, "text": "This is almost like a law of physics kind of, so the computational power is not, you can get some free lunch."}, {"time": 14008, "text": "Yeah, I mean, the fact that we now, we sit here in this period in time and we can imagine all these robots and all these machines and we built them."}, {"time": 14016, "text": "And so we can easily imagine going back in time that the universe was capable of having them, but I don't think it can."}, {"time": 14021, "text": "So the universe may have been a lot dumber computationally."}, {"time": 14025, "text": "And I think that's why, I don't want to go back to the time discussion, but I think it has some relationship with it."}, {"time": 14030, "text": "The universe is basically smarter now than it used to be and it's going to continue getting smarter over time because of novelty, generation, and the ability to create objects within objects within objects."}, {"time": 14042, "text": "You know, there's a, perhaps it's grounded in physics, there's this intuition of conservation."}, {"time": 14047, "text": "That stuff is conserved."}, {"time": 14049, "text": "Like you're not, you've always had all, everything, you're just rearranging books on the bookshelf through time."}, {"time": 14058, "text": "But you're saying like new books are being written."}, {"time": 14061, "text": "Which laws do you want to break?"}, {"time": 14062, "text": "At the origin of the big bang, you had to break the second law because we got order for free."}, {"time": 14069, "text": "Well, what I'm telling you now is that the energy isn't conserved in the universe."}, {"time": 14073, "text": "Oh, it's the second law."}, {"time": 14075, "text": "So because, but not in a mad way."}, {"time": 14078, "text": "So computation potentially is not conserved, which is a fascinating idea."}, {"time": 14086, "text": "Intelligence is not conserved."}, {"time": 14089, "text": "Complexity is not conserved."}, {"time": 14094, "text": "I suppose that's deeply connected to time being fundamental."}, {"time": 14101, "text": "The natural consequence of that is if time is fundamental and the universe is inflating in time, if you like, then there are one or two conservation laws that we need to have a look at."}, {"time": 14114, "text": "And I wonder if that means the total energy of the universe is actually increasing over time."}, {"time": 14118, "text": "And this may be completely ludicrous, but we do have all this dark energy."}, {"time": 14125, "text": "We have some anomalies, let's say, dark matter and dark energy."}, {"time": 14129, "text": "If we don't add them in, galaxies, so dark matter, I think doesn't hold."}, {"time": 14135, "text": "You need to hold the galaxies together and there's some other observational issues."}, {"time": 14138, "text": "Could dark energy just be time?"}, {"time": 14142, "text": "So figuring out what dark energy is might give us some deep clues about this, not just time, but the consequences of time."}, {"time": 14153, "text": "So it could be that, I mean, I'm not saying there's perpetual motions allowed and it's free lunch, but I'm saying if the universe is intrinsically asymmetric and it appears to be, and it's generating novelty and it appears to, couldn't that just be mechanistically how reality works?"}, {"time": 14173, "text": "And therefore I don't really like this idea that the, so I want to live in a deterministic universe that is undetermined, right?"}, {"time": 14185, "text": "The only way I can do that is if time is fundamental."}, {"time": 14188, "text": "Because otherwise it's all the rest of us, it's just sleight of hand because the physicists will say, yes, everything's deterministic."}, {"time": 14195, "text": "Newtonian mechanics is deterministic."}, {"time": 14198, "text": "Quantum mechanics is deterministic."}, {"time": 14200, "text": "Let's take the Everettian view."}, {"time": 14202, "text": "And then basically we can just draw out this massive universe branching, but it closes again and we get it all back."}, {"time": 14208, "text": "And don't worry, your feeling of free will is effective."}, {"time": 14211, "text": "But what the physicists are actually saying is the entire future is mapped out."}, {"time": 14215, "text": "And that is clearly problematical."}, {"time": 14220, "text": "And clearly."}, {"time": 14223, "text": "That's not so clear."}, {"time": 14225, "text": "It's just problematic."}, {"time": 14227, "text": "Well, yeah, yeah, so it's."}, {"time": 14230, "text": "Because that maybe is just the way it is."}, {"time": 14232, "text": "It's problematic to you, a particular creature along this timeline."}, {"time": 14235, "text": "I want to reduce the number of beliefs I need to understand the universe."}, {"time": 14238, "text": "So if time is fundamental, I don't need to have magic order at the beginning, and I don't need a second law."}, {"time": 14245, "text": "But you do need the magical belief that time is fundamental."}, {"time": 14248, "text": "Well, I need the observation that I'm seeing to be just how it is all the way down."}, {"time": 14254, "text": "But the Earth also looks flat if you agree with your observation."}, {"time": 14260, "text": "So we can't necessarily trust our observation."}, {"time": 14263, "text": "I know the Earth isn't flat because I can send a satellite into space."}, {"time": 14266, "text": "No, but now you see, now you're using the tools of science and the technology of science."}, {"time": 14271, "text": "But I'm saying I'm going to do experiments that start to show."}, {"time": 14275, "text": "I mean, I think that it's worth."}, {"time": 14277, "text": "So if you can't, so if I cannot do an experiment or a thought experiment that will test this assumption, then the assumption is without merit really in the end."}, {"time": 14290, "text": "That's a beautiful ideal you hold yourself to."}, {"time": 14292, "text": "That's given that you think deeply in a philosophical way, you think about some of these really important issues and you have theoretical frameworks like assembly theory."}, {"time": 14307, "text": "It's really nice that you're always grounded with experiment."}, {"time": 14311, "text": "That's all I have."}, {"time": 14312, "text": "That's so refreshing."}, {"time": 14313, "text": "That's so beautifully refreshing."}, {"time": 14315, "text": "Now that we're holding you to the grounded in an experiment to the harsh truth of reality, let me ask the big ridiculous question."}, {"time": 14325, "text": "What is the meaning of this whole thing?"}, {"time": 14329, "text": "This time is fundamental."}, {"time": 14332, "text": "It's marching forward."}, {"time": 14334, "text": "And along this long timeline come along a bunch of descendants of apes that have come up with cellular automata and computers and now computers."}, {"time": 14349, "text": "I have so many different answers to this question."}, {"time": 14351, "text": "It depends on what day."}, {"time": 14353, "text": "I would say that given the way of the conversation we had today, I'd say the meaning, well, we make our own meaning."}, {"time": 14359, "text": "I think that's fine."}, {"time": 14360, "text": "But I think the universe wants to explore every possible configuration that it's allowed us to explore."}, {"time": 14368, "text": "And this goes back to the kind of question that you were asking about Yasha and the existence and non existence of things, right?"}, {"time": 14375, "text": "So if the universe is a Turing machine is churning through a lot of states and you think about combinatorial theory before assembly theory, so everything is possible."}, {"time": 14385, "text": "What Yasha and I were saying is, well, not everything is possible."}, {"time": 14389, "text": "We don't see the combinatorial explosion."}, {"time": 14392, "text": "We see something else."}, {"time": 14393, "text": "And what we see is evidence of memory."}, {"time": 14397, "text": "So there clearly seems to be some interference between the combinatorial explosion of things and what the universe allows."}, {"time": 14406, "text": "And it's like this kind of constructive, destructive interference."}, {"time": 14410, "text": "So maybe the universe is not just about, it is assembling objects in space and time."}, {"time": 14418, "text": "And those objects are able to search more space and time."}, {"time": 14422, "text": "And the universe is just infinitely creative."}, {"time": 14424, "text": "And I guess I'm searching for why the universe is infinitely creative."}, {"time": 14428, "text": "It is infinitely creative."}, {"time": 14429, "text": "And maybe the meaning is just simply to make as many objects, create as many things as possible."}, {"time": 14434, "text": "And I see a future of the universe that doesn't result in the heat death of the universe."}, {"time": 14438, "text": "The universe is gonna extract every ounce of creativity it can out of it, because that's what we see on Earth, right?"}, {"time": 14445, "text": "And if you think that almost like intelligence is not conserved, that maybe creativity isn't either."}, {"time": 14452, "text": "Maybe like it's an infinite well."}, {"time": 14456, "text": "So like creativity is ultimately tied to novelty."}, {"time": 14460, "text": "You're coming up with cool new configurations of things, and maybe that just can continue indefinitely."}, {"time": 14466, "text": "And this human species that was created along the way is probably just one method, like that's able to ask the universe about itself."}]}]