[{"title": "Judea Pearl: Causal Reasoning, Counterfactuals, and the Path to AGI | Lex Fridman Podcast #56", "id": "pEBI0vF45ic", "quotes": [{"time": 318, "text": "And to pass a tangent to a circle, you know, you have the basic theorems, and you can do it with algebra."}, {"time": 327, "text": "So but the transition from one to another was really, I thought that Descartes was the greatest mathematician of all times."}, {"time": 335, "text": "So you have been at the, if you think of engineering and mathematics as a spectrum."}, {"time": 344, "text": "You have been, you have walked casually along this spectrum throughout your life."}, {"time": 351, "text": "You know, a little bit of engineering, and then, you know, you've done a little bit of mathematics here and there."}, {"time": 358, "text": "Not a little bit."}, {"time": 359, "text": "I mean, we got a very solid background in mathematics, because our teachers were geniuses."}, {"time": 367, "text": "Our teachers came from Germany in the 1930s, running away from Hitler."}, {"time": 371, "text": "They left their careers in Heidelberg and Berlin, and came to teach high school in Israel."}, {"time": 377, "text": "And we were the beneficiary of that experiment."}, {"time": 381, "text": "So I, and they taught us math the good way."}, {"time": 385, "text": "What's the good way to teach math?"}, {"time": 386, "text": "Chronologically."}, {"time": 389, "text": "The people."}, {"time": 389, "text": "The people behind the theorems, yeah."}, {"time": 393, "text": "Their cousins, and their nieces, and their faces."}, {"time": 399, "text": "And how they jumped from the bathtub when they scream, Eureka!"}, {"time": 403, "text": "And ran naked in town."}, {"time": 406, "text": "So you're almost educated as a historian of math."}, {"time": 409, "text": "No, we just got a glimpse of that history together with a theorem, so every exercise in math was connected with a person."}, {"time": 419, "text": "And the time of the person."}, {"time": 421, "text": "The period."}, {"time": 423, "text": "The period, also mathematically speaking."}, {"time": 425, "text": "Mathematically speaking, yes."}, {"time": 426, "text": "Not the politics, no."}, {"time": 429, "text": "So, and then in university, you have gone on to do engineering."}, {"time": 437, "text": "I get a B.S."}, {"time": 437, "text": "in engineering and a technical, right?"}, {"time": 440, "text": "And then I moved here for graduate work, and I got, I did engineering in addition to physics in Rutgers, and it combined very nicely with my thesis, which I did in RCA Laboratories in superconductivity."}, {"time": 460, "text": "And then somehow thought to switch to almost computer science, software, even, not switch, but long to become, to get into software engineering a little bit."}, {"time": 473, "text": "And programming, if you can call it that in the 70s."}, {"time": 476, "text": "So there's all these disciplines."}, {"time": 478, "text": "So to pick a favorite, in terms of engineering and mathematics, which path do you think has more beauty?"}, {"time": 487, "text": "Which path has more power?"}, {"time": 488, "text": "It's hard to choose, no."}, {"time": 490, "text": "I enjoy doing physics, and even have a vortex named on my name."}, {"time": 496, "text": "So I have investment in immortality."}, {"time": 503, "text": "So what is a vortex?"}, {"time": 505, "text": "Vortex is in superconductivity."}, {"time": 507, "text": "In the superconductivity, yeah."}, {"time": 507, "text": "You have permanent current swirling around."}, {"time": 510, "text": "One way or the other, you can have a store one or zero for a computer."}, {"time": 515, "text": "That's what we worked on in the 1960 in RCA."}, {"time": 519, "text": "And I discovered a few nice phenomena with the vortices."}, {"time": 524, "text": "You push current and they move."}, {"time": 524, "text": "So that's a pearl vortex."}, {"time": 526, "text": "Pearl vortex, right, you can Google it, right?"}, {"time": 530, "text": "I didn't know about it, but the physicists, they picked up on my thesis, on my PhD thesis, and it becomes popular when thin film superconductors became important for high temperature superconductors."}, {"time": 546, "text": "So they called it pearl vortex without my knowledge."}, {"time": 550, "text": "I discovered it only about 15 years ago."}, {"time": 554, "text": "You have footprints in all of the sciences."}, {"time": 557, "text": "So let's talk about the universe a little bit."}, {"time": 560, "text": "Is the universe at the lowest level deterministic or stochastic in your amateur philosophy view?"}, {"time": 567, "text": "Put another way, does God play dice?"}, {"time": 570, "text": "We know it is stochastic, right?"}, {"time": 573, "text": "Today, today we think it is stochastic."}, {"time": 577, "text": "We think because we have the Heisenberg uncertainty principle and we have some experiments to confirm that."}, {"time": 585, "text": "All we have is experiments to confirm it."}, {"time": 587, "text": "We don't understand why."}, {"time": 590, "text": "Why is already?"}, {"time": 591, "text": "You wrote a book about why."}, {"time": 592, "text": "Yeah, it's a puzzle."}, {"time": 597, "text": "It's a puzzle that you have the dice flipping machine, oh God, and the result of the flipping propagate with the speed faster than the speed of light."}, {"time": 612, "text": "We can't explain it, okay?"}, {"time": 614, "text": "So, but it only governs microscopic phenomena."}, {"time": 619, "text": "Microscopic phenomena."}, {"time": 621, "text": "So you don't think of quantum mechanics as useful for understanding the nature of reality?"}, {"time": 628, "text": "No, diversionary."}, {"time": 630, "text": "So in your thinking, the world might as well be deterministic."}, {"time": 636, "text": "The world is deterministic, and as far as the neuron firing is concerned, it is deterministic to first approximation."}, {"time": 647, "text": "What about free will?"}, {"time": 648, "text": "Free will is also a nice exercise."}, {"time": 652, "text": "Free will is an illusion that we AI people are gonna solve."}, {"time": 659, "text": "So what do you think once we solve it, that solution will look like?"}, {"time": 663, "text": "Once we put it in the page."}, {"time": 664, "text": "The solution will look like, first of all, it will look like a machine."}, {"time": 668, "text": "A machine that act as though it has free will."}, {"time": 672, "text": "It communicates with other machines as though they have free will, and you wouldn't be able to tell the difference between a machine that does and a machine that doesn't have free will, okay?"}, {"time": 684, "text": "So the illusion, it propagates the illusion of free will amongst the other machines."}, {"time": 688, "text": "And faking it is having it, okay?"}, {"time": 693, "text": "That's what Turing test is all about."}, {"time": 695, "text": "Faking intelligence is intelligent because it's not easy to fake."}, {"time": 701, "text": "It's very hard to fake, and you can only fake if you have it."}, {"time": 705, "text": "So that's such a beautiful statement."}, {"time": 714, "text": "Yeah, you can't fake it if you don't have it, yeah."}, {"time": 719, "text": "So let's begin at the beginning with probability, both philosophically and mathematically."}, {"time": 729, "text": "What does it mean to say the probability of something happening is 50%?"}, {"time": 735, "text": "What is probability?"}, {"time": 736, "text": "It's a degree of uncertainty that an agent has about the world."}, {"time": 742, "text": "You're still expressing some knowledge in that statement."}, {"time": 746, "text": "If the probability is 90%, it's absolutely a different kind of knowledge than if it is 10%."}, {"time": 752, "text": "But it's still not solid knowledge, it's..."}, {"time": 756, "text": "It is solid knowledge, but hey, if you tell me that 90% assurance smoking will give you lung cancer in five years versus 10%, it's a piece of useful knowledge."}, {"time": 772, "text": "So the statistical view of the universe, why is it useful?"}, {"time": 777, "text": "So we're swimming in complete uncertainty, most of everything around us."}, {"time": 781, "text": "It allows you to predict things with a certain probability, and computing those probabilities are very useful."}, {"time": 789, "text": "That's the whole idea of prediction."}, {"time": 795, "text": "And you need prediction to be able to survive."}, {"time": 798, "text": "If you can't predict the future, then you're just crossing the street, will be extremely fearful."}, {"time": 806, "text": "And so you've done a lot of work in causation, and so let's think about correlation."}, {"time": 812, "text": "I started with probability."}, {"time": 814, "text": "You started with probability."}, {"time": 815, "text": "You've invented the Bayesian networks."}, {"time": 819, "text": "And so we'll dance back and forth between these levels of uncertainty."}, {"time": 827, "text": "But what is correlation?"}, {"time": 830, "text": "So probability of something happening is something, but then there's a bunch of things happening."}, {"time": 836, "text": "And sometimes they happen together, sometimes not, they're independent or not."}, {"time": 840, "text": "So how do you think about correlation of things?"}, {"time": 843, "text": "Correlation occurs when two things vary together over a very long time is one way of measuring it."}, {"time": 849, "text": "Or when you have a bunch of variables that they all vary cohesively, then because we have a correlation here."}, {"time": 858, "text": "And usually when we think about correlation, we really think causally."}, {"time": 864, "text": "Things cannot be correlated unless there is a reason for them to vary together."}, {"time": 870, "text": "Why should they vary together?"}, {"time": 872, "text": "If they don't see each other, why should they vary together?"}, {"time": 875, "text": "So underlying it somewhere is causation."}, {"time": 879, "text": "Hidden in our intuition, there is a notion of causation because we cannot grasp any other logic except causation."}, {"time": 888, "text": "And how does conditional probability differ from causation?"}, {"time": 895, "text": "So what is conditional probability?"}, {"time": 897, "text": "Conditional probability, how things vary when one of them stays the same."}, {"time": 905, "text": "Now staying the same means that I have chosen to look only at those incidents where the guy has the same value as previous one."}, {"time": 916, "text": "It's my choice as an experimenter."}, {"time": 919, "text": "So things that are not correlated before could become correlated."}, {"time": 924, "text": "Like for instance, if I have two coins which are uncorrelated, okay, and I choose only those flippings, experiments in which a bell rings, and the bell rings when at least one of them is a tail, okay, then suddenly I see correlation between the two coins because I only look at the cases where the bell rang."}, {"time": 949, "text": "You see, it's my design, with my ignorance essentially, with my audacity to ignore certain incidents, I suddenly create a correlation where it doesn't exist physically."}, {"time": 967, "text": "Right, so that's, you just outlined one of the flaws of observing the world and trying to infer something from the math about the world from looking at the correlation."}, {"time": 977, "text": "I don't look at it as a flaw, the world works like that."}, {"time": 980, "text": "But the flaws comes if we try to impose causal logic on correlation, it doesn't work too well."}, {"time": 994, "text": "I mean, but that's exactly what we do."}, {"time": 996, "text": "That's what, that has been the majority of science."}, {"time": 1000, "text": "The majority of naive science, the decisions know it."}, {"time": 1005, "text": "The decisions know that if you condition on a third variable, then you can destroy or create correlations among two other variables."}, {"time": 1015, "text": "They know it, it's in their data."}, {"time": 1018, "text": "It's nothing surprising, that's why they all dismiss the Simpson Paradox, ah, we know it."}, {"time": 1024, "text": "They don't know anything about it."}, {"time": 1027, "text": "Well, there's disciplines like psychology where all the variables are hard to account for."}, {"time": 1032, "text": "And so oftentimes there's a leap between correlation to causation."}, {"time": 1037, "text": "You're imposing."}, {"time": 1038, "text": "You're implying a leap."}, {"time": 1041, "text": "Who is trying to get causation from correlation?"}, {"time": 1046, "text": "You're not proving causation, but you're sort of discussing it, implying, sort of hypothesizing with our ability to prove."}, {"time": 1055, "text": "Which discipline you have in mind?"}, {"time": 1057, "text": "I'll tell you if they are obsolete, or if they are outdated, or they are about to get outdated."}, {"time": 1065, "text": "Tell me which one you have in mind."}, {"time": 1066, "text": "Oh, psychology, you know."}, {"time": 1068, "text": "Psychology, what, is it SEM, structural equation?"}, {"time": 1070, "text": "No, no, I was thinking of applied psychology studying."}, {"time": 1074, "text": "For example, we work with human behavior in semi autonomous vehicles, how people behave."}, {"time": 1080, "text": "And you have to conduct these studies of people driving cars."}, {"time": 1083, "text": "Everything starts with the question."}, {"time": 1085, "text": "What is the research question?"}, {"time": 1090, "text": "The research question, do people fall asleep when the car is driving itself?"}, {"time": 1098, "text": "Do they fall asleep, or do they tend to fall asleep more frequently?"}, {"time": 1103, "text": "More frequently."}, {"time": 1104, "text": "Than the car not driving itself."}, {"time": 1105, "text": "Not driving itself."}, {"time": 1106, "text": "That's a good question, okay."}, {"time": 1108, "text": "And so you measure, you put people in the car because it's real world."}, {"time": 1113, "text": "You can't conduct an experiment where you control everything."}, {"time": 1116, "text": "Why can't you control?"}, {"time": 1118, "text": "Why can't you control the automatic module on and off?"}, {"time": 1124, "text": "Because it's on road, public."}, {"time": 1127, "text": "I mean, there's aspects to it that's unethical."}, {"time": 1132, "text": "Because it's testing on public roads."}, {"time": 1134, "text": "So you can only use vehicle."}, {"time": 1136, "text": "They have to, the people, the drivers themselves have to make that choice themselves."}, {"time": 1142, "text": "And so they regulate that."}, {"time": 1145, "text": "And so you just observe when they drive autonomously and when they don't."}, {"time": 1151, "text": "But maybe they turn it off when they were very tired."}, {"time": 1154, "text": "But you don't know those variables."}, {"time": 1156, "text": "Okay, so that you have now uncontrolled experiment."}, {"time": 1159, "text": "Uncontrolled experiment."}, {"time": 1160, "text": "We call it observational study."}, {"time": 1163, "text": "And we form the correlation detected."}, {"time": 1167, "text": "We have to infer causal relationship."}, {"time": 1170, "text": "Whether it was the automatic piece has caused them to fall asleep, or."}, {"time": 1175, "text": "So that is an issue that is about 120 years old."}, {"time": 1185, "text": "I should only go 100 years old, okay."}, {"time": 1191, "text": "Well, maybe it's not."}, {"time": 1192, "text": "Actually I should say it's 2,000 years old."}, {"time": 1195, "text": "Because we have this experiment by Daniel."}, {"time": 1198, "text": "But the Babylonian king that wanted the exiled, the people from Israel that were taken in exile to Babylon to serve the king."}, {"time": 1214, "text": "He wanted to serve them king's food, which was meat."}, {"time": 1218, "text": "And Daniel as a good Jew couldn't eat non kosher food."}, {"time": 1222, "text": "So he asked them to eat vegetarian food."}, {"time": 1226, "text": "But the king overseer says, I'm sorry, but if the king sees that your performance falls below that of other kids, he's going to kill me."}, {"time": 1239, "text": "Daniel said, let's make an experiment."}, {"time": 1241, "text": "Let's take four of us from Jerusalem, okay."}, {"time": 1244, "text": "Give us vegetarian food."}, {"time": 1246, "text": "Let's take the other guys to eat the king's food."}, {"time": 1250, "text": "And in about a week's time, we'll test our performance."}, {"time": 1254, "text": "And you know the answer."}, {"time": 1255, "text": "Of course he did the experiment."}, {"time": 1257, "text": "And they were so much better than the others."}, {"time": 1262, "text": "And the kings nominated them to super position in his king."}, {"time": 1268, "text": "So it was a first experiment, yes."}, {"time": 1270, "text": "So there was a very simple, it's also the same research questions."}, {"time": 1275, "text": "We want to know if vegetarian food assist or obstruct your mental ability."}, {"time": 1283, "text": "And okay, so the question is very old one."}, {"time": 1290, "text": "Even Democritus said, if I could discover one cause of things, I would rather discover one cause and be a king of Persia, okay."}, {"time": 1303, "text": "The task of discovering causes was in the mind of ancient people from many, many years ago."}, {"time": 1313, "text": "But the mathematics of doing that was only developed in the 1920s."}, {"time": 1320, "text": "So science has left us orphan, okay."}, {"time": 1325, "text": "Science has not provided us with the mathematics to capture the idea of X causes Y and Y does not cause X."}, {"time": 1334, "text": "Because all the question of physics are symmetrical, algebraic, the equality sign goes both ways."}, {"time": 1341, "text": "Okay, let's look at machine learning."}, {"time": 1343, "text": "Machine learning today, if you look at deep neural networks, you can think of it as kind of conditional probability estimators."}, {"time": 1353, "text": "Correct, beautiful."}, {"time": 1355, "text": "So where did you say that?"}, {"time": 1359, "text": "Conditional probability estimators."}, {"time": 1361, "text": "None of the machine learning people clevered you?"}, {"time": 1365, "text": "Attacked you?"}, {"time": 1366, "text": "Listen, most people, and this is why today's conversation I think is interesting, is most people would agree with you."}, {"time": 1375, "text": "There's certain aspects that are just effective today, but we're going to hit a wall and there's a lot of ideas."}, {"time": 1382, "text": "I think you're very right that we're gonna have to return to about causality and it would be, let's try to explore it."}, {"time": 1391, "text": "Let's even take a step back."}, {"time": 1393, "text": "You've invented Bayesian networks that look awfully a lot like they express something like causation, but they don't, not necessarily."}, {"time": 1405, "text": "So how do we turn Bayesian networks into expressing causation?"}, {"time": 1410, "text": "How do we build causal networks?"}, {"time": 1413, "text": "This A causes B, B causes C, how do we start to infer that kind of thing?"}, {"time": 1418, "text": "We start asking ourselves question, what are the factors that would determine the value of X?"}, {"time": 1426, "text": "X could be blood pressure, death, hunger."}, {"time": 1433, "text": "But these are hypotheses that we propose for ourselves."}, {"time": 1436, "text": "Hypothesis, everything which has to do with causality comes from a theory."}, {"time": 1443, "text": "The difference is only how you interrogate the theory that you have in your mind."}, {"time": 1449, "text": "So it still needs the human expert to propose."}, {"time": 1454, "text": "You need the human expert to specify the initial model."}, {"time": 1460, "text": "Initial model could be very qualitative."}, {"time": 1464, "text": "Just who listens to whom?"}, {"time": 1467, "text": "By whom listen to, I mean one variable listen to the other."}, {"time": 1471, "text": "So I say, okay, the tide is listening to the moon."}, {"time": 1474, "text": "And not to the rooster crow."}, {"time": 1482, "text": "And so forth."}, {"time": 1483, "text": "This is our understanding of the world in which we live."}, {"time": 1486, "text": "Scientific understanding of reality."}, {"time": 1491, "text": "We have to start there."}, {"time": 1493, "text": "Because if we don't know how to handle cause and effect relationship, when we do have a model, and we certainly do not know how to handle it when we don't have a model."}, {"time": 1505, "text": "So let's start first."}, {"time": 1507, "text": "In AI, slogan is representation first, discovery second."}, {"time": 1513, "text": "But if I give you all the information that you need, can you do anything useful with it?"}, {"time": 1519, "text": "That is the first, representation."}, {"time": 1521, "text": "How do you represent it?"}, {"time": 1522, "text": "I give you all the knowledge in the world."}, {"time": 1526, "text": "When you represent it, I ask you, can you infer X or Y or Z?"}, {"time": 1533, "text": "Can you answer certain queries?"}, {"time": 1535, "text": "Is it complex?"}, {"time": 1536, "text": "Is it polynomial?"}, {"time": 1539, "text": "All the computer science exercises we do, once you give me a representation for my knowledge, then you can ask me, now I understand how to represent things."}, {"time": 1551, "text": "How do I discover them?"}, {"time": 1552, "text": "It's a secondary thing."}, {"time": 1554, "text": "So first of all, I should echo the statement that mathematics and the current, much of the machine learning world has not considered causation that A causes B, just in anything."}, {"time": 1567, "text": "So that seems like a non obvious thing that you think we would have really acknowledged it, but we haven't."}, {"time": 1579, "text": "So we have to put that on the table."}, {"time": 1581, "text": "So knowledge, how hard is it to create a knowledge from which to work?"}, {"time": 1588, "text": "In certain area, it's easy, because we have only four or five major variables, and an epidemiologist or an economist can put them down, what, minimum wage, unemployment, policy, X, Y, Z, and start collecting data, and quantify the parameters that were left unquantified with the initial knowledge."}, {"time": 1621, "text": "That's the routine work that you find in experimental psychology, in economics, everywhere."}, {"time": 1633, "text": "In the health science, that's a routine thing."}, {"time": 1636, "text": "But I should emphasize, you should start with the research question."}, {"time": 1641, "text": "What do you want to estimate?"}, {"time": 1644, "text": "Once you have that, you have to have a language of expressing what you want to estimate."}, {"time": 1650, "text": "You think it's easy?"}, {"time": 1652, "text": "So we can talk about two things, I think."}, {"time": 1655, "text": "One is how the science of causation is very useful for answering certain questions."}, {"time": 1667, "text": "And then the other is, how do we create intelligent systems that need to reason with causation?"}, {"time": 1673, "text": "So if my research question is, how do I pick up this water bottle from the table?"}, {"time": 1680, "text": "All of the knowledge that is required to be able to do that, how do we construct that knowledge base?"}, {"time": 1687, "text": "Do we return back to the problem that we didn't solve in the 80s with expert systems?"}, {"time": 1693, "text": "Do we have to solve that problem of automated construction of knowledge?"}, {"time": 1699, "text": "You're talking about the task of eliciting knowledge from an expert."}, {"time": 1706, "text": "Task of eliciting knowledge from an expert, or the self discovery of more knowledge, more and more knowledge."}, {"time": 1714, "text": "So automating the building of knowledge as much as possible."}, {"time": 1718, "text": "It's a different game in the causal domain, because it's essentially the same thing."}, {"time": 1726, "text": "You have to start with some knowledge, and you're trying to enrich it."}, {"time": 1731, "text": "But you don't enrich it by asking for more rules."}, {"time": 1736, "text": "You enrich it by asking for the data, to look at the data and quantifying, and ask queries that you couldn't answer when you started."}, {"time": 1746, "text": "You couldn't because the question is quite complex, and it's not within the capability of ordinary cognition, of ordinary person, or ordinary expert even, to answer."}, {"time": 1763, "text": "So what kind of questions do you think we can start to answer?"}, {"time": 1766, "text": "Even a simple one."}, {"time": 1767, "text": "Suppose, yeah, I'll start with easy one."}, {"time": 1772, "text": "Okay, what's the effect of a drug on recovery?"}, {"time": 1777, "text": "What is the aspirin that caused my headache to be cured, or what did the television program, or the good news I received?"}, {"time": 1787, "text": "This is already, you see, it's a difficult question, because it's find the cause from effect."}, {"time": 1793, "text": "The easy one is find the effect from cause."}, {"time": 1797, "text": "So first you construct a model, saying that this is an important research question."}, {"time": 1801, "text": "This is an important question."}, {"time": 1802, "text": "Then you do."}, {"time": 1804, "text": "I didn't construct a model yet."}, {"time": 1805, "text": "I just said it's an important question."}, {"time": 1807, "text": "And the first exercise is express it mathematically."}, {"time": 1812, "text": "What do you want to do?"}, {"time": 1813, "text": "Like, if I tell you what will be the effect of taking this drug, you have to say that in mathematics."}, {"time": 1821, "text": "How do you say that?"}, {"time": 1823, "text": "Can you write down the question, not the answer?"}, {"time": 1827, "text": "I want to find the effect of the drug on my headache."}, {"time": 1833, "text": "Write down, write it down."}, {"time": 1834, "text": "That's where the do calculus comes in."}, {"time": 1836, "text": "The do operator, what is the do operator?"}, {"time": 1838, "text": "Do operator, yeah."}, {"time": 1840, "text": "Which is nice."}, {"time": 1840, "text": "It's the difference in association and intervention."}, {"time": 1843, "text": "Very beautifully sort of constructed."}, {"time": 1845, "text": "Yeah, so we have a do operator."}, {"time": 1848, "text": "So the do calculus connected on the do operator itself connects the operation of doing to something that we can see."}, {"time": 1858, "text": "So as opposed to the purely observing, you're making the choice to change a variable."}, {"time": 1865, "text": "That's what it expresses."}, {"time": 1868, "text": "And then the way that we interpret it, the mechanism by which we take your query and we translate it into something that we can work with is by giving it semantics, saying that you have a model of the world and you cut off all the incoming error into X and you're looking now in the modified mutilated model, you ask for the probability of Y."}, {"time": 1893, "text": "That is interpretation of doing X because by doing things, you've liberated them from all influences that acted upon them earlier and you subject them to the tyranny of your muscles."}, {"time": 1910, "text": "So you remove all the questions about causality by doing them."}, {"time": 1915, "text": "So you're now."}, {"time": 1916, "text": "There's one level of questions."}, {"time": 1919, "text": "Answer questions about what will happen if you do things."}, {"time": 1921, "text": "If you do, if you drink the coffee, if you take the aspirin."}, {"time": 1925, "text": "So how do we get the doing data?"}, {"time": 1931, "text": "Now the question is, if we cannot run experiments, then we have to rely on observational study."}, {"time": 1940, "text": "So first we could, sorry to interrupt, we could run an experiment where we do something, where we drink the coffee and this, the do operator allows you to sort of be systematic about expressing."}, {"time": 1951, "text": "So imagine how the experiment will look like even though we cannot physically and technologically conduct it."}, {"time": 1960, "text": "What is the effect of blood pressure on mortality?"}, {"time": 1964, "text": "I cannot go down into your vein and change your blood pressure, but I can ask the question, which means I can even have a model of your body."}, {"time": 1975, "text": "I can imagine the effect of your, how the blood pressure change will affect your mortality."}, {"time": 1985, "text": "I go into the model and I conduct this surgery about the blood pressure, even though physically I can do, I cannot do it."}, {"time": 1997, "text": "Let me ask the quantum mechanics question."}, {"time": 1999, "text": "Does the doing change the observation?"}, {"time": 2003, "text": "Meaning the surgery of changing the blood pressure is, I mean."}, {"time": 2009, "text": "No, the surgery is, I call the very delicate."}, {"time": 2015, "text": "It's very delicate, infinitely delicate."}, {"time": 2017, "text": "Incisive and delicate, which means, do means, do X means, I'm gonna touch only X."}, {"time": 2026, "text": "Only X."}, {"time": 2027, "text": "Directly into X."}, {"time": 2030, "text": "So that means that I change only things which depends on X by virtue of X changing, but I don't depend things which are not depend on X."}, {"time": 2040, "text": "Like I wouldn't change your sex or your age, I just change your blood pressure."}, {"time": 2046, "text": "So in the case of blood pressure, it may be difficult or impossible to construct such an experiment."}, {"time": 2052, "text": "No, physically yes, but hypothetically no."}, {"time": 2056, "text": "Hypothetically no."}, {"time": 2057, "text": "If we have a model, that is what the model is for."}, {"time": 2060, "text": "So you conduct surgeries on a model, you take it apart, put it back, that's the idea of a model."}, {"time": 2068, "text": "It's the idea of thinking counterfactually, imagining, and that's the idea of creativity."}, {"time": 2075, "text": "So by constructing that model, you can start to infer if the higher the blood pressure leads to mortality, which increases or decreases by."}, {"time": 2087, "text": "I construct the model, I still cannot answer it."}, {"time": 2090, "text": "I have to see if I have enough information in the model that would allow me to find out the effects of intervention from a noninterventional study, hence of study."}, {"time": 2104, "text": "So what's needed?"}, {"time": 2106, "text": "You need to have assumptions about who affects whom."}, {"time": 2113, "text": "If the graph had a certain property, the answer is yes, you can get it from observational study."}, {"time": 2120, "text": "If the graph is too mushy, bushy, bushy, the answer is no, you cannot."}, {"time": 2125, "text": "Then you need to find either different kind of observation that you haven't considered, or one experiment."}, {"time": 2135, "text": "So basically, that puts a lot of pressure on you to encode wisdom into that graph."}, {"time": 2142, "text": "But you don't have to encode more than what you know."}, {"time": 2147, "text": "God forbid, if you put the, like economists are doing this, they call identifying assumption."}, {"time": 2152, "text": "They put assumptions, even if they don't prevail in the world, they put assumptions so they can identify things."}, {"time": 2159, "text": "But the problem is, yes, beautifully put, but the problem is you don't know what you don't know."}, {"time": 2165, "text": "You know what you don't know."}, {"time": 2167, "text": "Because if you don't know, you say it's possible."}, {"time": 2170, "text": "It's possible that X affect the traffic tomorrow."}, {"time": 2178, "text": "You put down an arrow which says it's possible."}, {"time": 2180, "text": "Every arrow in the graph says it's possible."}, {"time": 2183, "text": "So there's not a significant cost to adding arrows that."}, {"time": 2188, "text": "The more arrow you add, the less likely you are to identify things from purely observational data."}, {"time": 2197, "text": "So if the whole world is bushy, and everybody affect everybody else, the answer is, you can answer it ahead of time."}, {"time": 2209, "text": "I cannot answer my query from observational data."}, {"time": 2214, "text": "I have to go to experiments."}, {"time": 2216, "text": "So you talk about machine learning is essentially learning by association, or reasoning by association, and this do calculus is allowing for intervention."}, {"time": 2227, "text": "I like that word."}, {"time": 2229, "text": "So you also talk about counterfactuals."}, {"time": 2233, "text": "And trying to sort of understand the difference between counterfactuals and intervention."}, {"time": 2239, "text": "First of all, what is counterfactuals, and why are they useful?"}, {"time": 2246, "text": "Why are they especially useful, as opposed to just reasoning what effect actions have?"}, {"time": 2254, "text": "Well, counterfactual contains what we normally call explanations."}, {"time": 2260, "text": "Can you give an example of a counterfactual?"}, {"time": 2261, "text": "If I tell you that acting one way affects something else, I didn't explain anything yet."}, {"time": 2267, "text": "But if I ask you, was it the aspirin that cured my headache?"}, {"time": 2275, "text": "I'm asking for explanation, what cured my headache?"}, {"time": 2278, "text": "And putting a finger on aspirin provide an explanation."}, {"time": 2284, "text": "It was aspirin that was responsible for your headache going away."}, {"time": 2291, "text": "If you didn't take the aspirin, you would still have a headache."}, {"time": 2296, "text": "So by saying if I didn't take aspirin, I would have a headache, you're thereby saying that aspirin is the thing that removes the headache."}, {"time": 2306, "text": "But you have to have another important information."}, {"time": 2310, "text": "I took the aspirin, and my headache is gone."}, {"time": 2314, "text": "It's very important information."}, {"time": 2316, "text": "Now I'm reasoning backward, and I said, was it the aspirin?"}, {"time": 2322, "text": "By considering what would have happened if everything else is the same, but I didn't take aspirin."}, {"time": 2327, "text": "So you know that things took place."}, {"time": 2331, "text": "Joe killed Schmoe, and Schmoe would be alive had John not used his gun."}, {"time": 2339, "text": "Okay, so that is the counterfactual."}, {"time": 2342, "text": "It had the conflict here, or clash, between observed fact, but he did shoot, okay?"}, {"time": 2353, "text": "And the hypothetical predicate, which says had he not shot, you have a logical clash."}, {"time": 2361, "text": "They cannot exist together."}, {"time": 2363, "text": "That's the counterfactual."}, {"time": 2364, "text": "And that is the source of our explanation of the idea of responsibility, regret, and free will."}, {"time": 2374, "text": "Yeah, so it certainly seems that's the highest level of reasoning, right?"}, {"time": 2379, "text": "Yeah, and physicists do it all the time."}, {"time": 2381, "text": "Who does it all the time?"}, {"time": 2384, "text": "In every equation of physics, let's say you have a Hooke's law, and you put one kilogram on the spring, and the spring is one meter, and you say, had this weight been two kilogram, the spring would have been twice as long."}, {"time": 2402, "text": "It's no problem for physicists to say that, except that mathematics is only in the form of equation, okay, equating the weight, proportionality constant, and the length of the string."}, {"time": 2418, "text": "So you don't have the asymmetry in the equation of physics, although every physicist thinks counterfactually."}, {"time": 2426, "text": "Ask the high school kids, had the weight been three kilograms, what would be the length of the spring?"}, {"time": 2433, "text": "They can answer it immediately, because they do the counterfactual processing in their mind, and then they put it into equation, algebraic equation, and they solve it, okay?"}, {"time": 2444, "text": "But a robot cannot do that."}, {"time": 2446, "text": "How do you make a robot learn these relationships?"}, {"time": 2451, "text": "Well, why you would learn?"}, {"time": 2453, "text": "Suppose you tell him, can you do it?"}, {"time": 2455, "text": "So before you go learning, you have to ask yourself, suppose I give you all the information, okay?"}, {"time": 2461, "text": "Can the robot perform the task that I ask him to perform?"}, {"time": 2467, "text": "Can he reason and say, no, it wasn't the aspirin."}, {"time": 2470, "text": "It was the good news you received on the phone."}, {"time": 2475, "text": "Right, because, well, unless the robot had a model, a causal model of the world."}, {"time": 2484, "text": "I'm sorry I have to linger on this."}, {"time": 2486, "text": "But now we have to linger and we have to say, how do we do it?"}, {"time": 2489, "text": "How do we build it?"}, {"time": 2490, "text": "How do we build a causal model without a team of human experts running around?"}, {"time": 2497, "text": "Why don't you go to learning right away?"}, {"time": 2499, "text": "You're too much involved with learning."}, {"time": 2501, "text": "Because I like babies."}, {"time": 2502, "text": "Babies learn fast."}, {"time": 2503, "text": "I'm trying to figure out how they do it."}, {"time": 2505, "text": "So that's another question."}, {"time": 2507, "text": "How do the babies come out with a counterfactual model of the world?"}, {"time": 2511, "text": "And babies do that."}, {"time": 2513, "text": "They know how to play in the crib."}, {"time": 2516, "text": "They know which balls hit another one."}, {"time": 2519, "text": "And they learn it by playful manipulation of the world."}, {"time": 2527, "text": "The simple world involves only toys and balls and chimes."}, {"time": 2533, "text": "But if you think about it, it's a complex world."}, {"time": 2537, "text": "We take for granted how complicated."}, {"time": 2540, "text": "And kids do it by playful manipulation plus parents guidance, peer wisdom, and hearsay."}, {"time": 2550, "text": "They meet each other and they say, you shouldn't have taken my toy."}, {"time": 2560, "text": "And these multiple sources of information, they're able to integrate."}, {"time": 2565, "text": "So the challenge is about how to integrate, how to form these causal relationships from different sources of data."}, {"time": 2575, "text": "So how much information is it to play, how much causal information is required to be able to play in the crib with different objects?"}, {"time": 2588, "text": "I haven't experimented with the crib."}, {"time": 2591, "text": "Okay, not a crib."}, {"time": 2592, "text": "Picking up, manipulating physical objects on this very, opening the pages of a book, all the tasks, the physical manipulation tasks."}, {"time": 2603, "text": "Do you have a sense?"}, {"time": 2605, "text": "Because my sense is the world is extremely complicated."}, {"time": 2607, "text": "It's extremely complicated."}, {"time": 2609, "text": "I agree, and I don't know how to organize it because I've been spoiled by easy problems such as cancer and death, okay?"}, {"time": 2617, "text": "And I'm a, but she's a."}, {"time": 2619, "text": "First we have to start trying to."}, {"time": 2621, "text": "No, but it's easy."}, {"time": 2622, "text": "There is in a sense that you have only 20 variables."}, {"time": 2626, "text": "And they are just variables and not mechanics."}, {"time": 2631, "text": "Okay, it's easy."}, {"time": 2632, "text": "You just put them on the graph and they speak to you."}, {"time": 2637, "text": "Yeah, and you're providing a methodology for letting them speak."}, {"time": 2643, "text": "I'm working only in the abstract."}, {"time": 2645, "text": "The abstract was knowledge in, knowledge out, data in between."}, {"time": 2651, "text": "Now, can we take a leap to trying to learn in this very, when it's not 20 variables, but 20 million variables, trying to learn causation in this world?"}, {"time": 2664, "text": "Not learn, but somehow construct models."}, {"time": 2667, "text": "I mean, it seems like you would only have to be able to learn because constructing it manually would be too difficult."}, {"time": 2675, "text": "Do you have ideas of?"}, {"time": 2677, "text": "I think it's a matter of combining simple models from many, many sources, from many, many disciplines, and many metaphors."}, {"time": 2688, "text": "Metaphors are the basics of human intelligence, basis."}, {"time": 2691, "text": "Yeah, so how do you think of about a metaphor in terms of its use in human intelligence?"}, {"time": 2696, "text": "Metaphors is an expert system."}, {"time": 2701, "text": "An expert, it's mapping problem from a problem with which you are not familiar to a problem with which you are familiar."}, {"time": 2713, "text": "Like, I'll give you a good example."}, {"time": 2715, "text": "The Greek believed that the sky is an opaque shell."}, {"time": 2722, "text": "It's not really infinite space."}, {"time": 2725, "text": "It's an opaque shell, and the stars are holes poked in the shells through which you see the eternal light."}, {"time": 2734, "text": "That was a metaphor."}, {"time": 2736, "text": "Because they understand how you poke holes in the shells."}, {"time": 2742, "text": "They were not familiar with infinite space."}, {"time": 2747, "text": "And we are walking on a shell of a turtle, and if you get too close to the edge, you're gonna fall down to Hades or wherever."}, {"time": 2758, "text": "That's a metaphor."}, {"time": 2760, "text": "It's not true."}, {"time": 2762, "text": "But this kind of metaphor enabled Aristoteles to measure the radius of the Earth, because he said, Kamal, if we are walking on a turtle shell, then the ray of light coming to this place will be a different angle than coming to this place."}, {"time": 2783, "text": "I know the distance, I'll measure the two angles, and then I have the radius of the shell of the turtle."}, {"time": 2793, "text": "And he did, and he found his measurement very close to the measurements we have today, through the, what, 6,700 kilometers of the Earth."}, {"time": 2812, "text": "That's something that would not occur to Babylonian astronomer, even though the Babylonian experiment were the machine learning people of the time."}, {"time": 2824, "text": "They fit curves, and they could predict the eclipse of the moon much more accurately than the Greek, because they fit curve."}, {"time": 2837, "text": "That's a different metaphor."}, {"time": 2839, "text": "Something that you're familiar with, a game, a turtle shell."}, {"time": 2844, "text": "What does it mean if you are familiar?"}, {"time": 2847, "text": "Familiar means that answers to certain questions are explicit."}, {"time": 2853, "text": "You don't have to derive them."}, {"time": 2855, "text": "And they were made explicit because somewhere in the past you've constructed a model of that."}, {"time": 2863, "text": "Yeah, you're familiar with, so the child is familiar with billiard balls."}, {"time": 2868, "text": "So the child could predict that if you let loose of one ball, the other one will bounce off."}, {"time": 2875, "text": "You obtain that by familiarity."}, {"time": 2880, "text": "Familiarity is answering questions, and you store the answer explicitly."}, {"time": 2888, "text": "So this is the idea of a metaphor."}, {"time": 2889, "text": "All our life, all our intelligence is built around metaphors, mapping from the unfamiliar to the familiar."}, {"time": 2896, "text": "But the marriage between the two is a tough thing, which we haven't yet been able to algorithmatize."}, {"time": 2904, "text": "So you think of that process of using metaphor to leap from one place to another, we can call it reasoning?"}, {"time": 2914, "text": "Is it a kind of reasoning?"}, {"time": 2915, "text": "It is reasoning by metaphor, metaphorical reasoning."}, {"time": 2919, "text": "Do you think of that as learning?"}, {"time": 2924, "text": "So learning is a popular terminology today in a narrow sense."}, {"time": 2927, "text": "It is, it is, it is definitely a form."}, {"time": 2929, "text": "So you may not, okay, right."}, {"time": 2931, "text": "It's one of the most important learnings, taking something which theoretically is derivable and store it in accessible format."}, {"time": 2941, "text": "I'll give you an example, chess, okay?"}, {"time": 2947, "text": "Finding the winning starting move in chess is hard."}, {"time": 2952, "text": "It is hard, but there is an answer."}, {"time": 2961, "text": "Either there is a winning move for white or there isn't, or there is a draw, okay?"}, {"time": 2966, "text": "So it is, the answer to that is available through the rule of the games."}, {"time": 2973, "text": "But we don't know the answer."}, {"time": 2975, "text": "So what does a chess master have that we don't have?"}, {"time": 2978, "text": "He has stored explicitly an evaluation of certain complex pattern of the board."}, {"time": 2985, "text": "We don't have it."}, {"time": 2986, "text": "Ordinary people like me, I don't know about you, I'm not a chess master."}, {"time": 2992, "text": "So for me, I have to derive things that for him is explicit."}, {"time": 2998, "text": "He has seen it before, or he has seen the pattern before, or similar pattern, you see metaphor, yeah?"}, {"time": 3005, "text": "And he generalize and said, don't move, it's a dangerous move."}, {"time": 3013, "text": "It's just that not in the game of chess, but in the game of billiard balls, we humans are able to initially derive very effectively and then reason by metaphor very effectively and make it look so easy that it makes one wonder how hard is it to build it in a machine."}, {"time": 3031, "text": "So in your sense, how far away are we to be able to construct?"}, {"time": 3040, "text": "I don't know, I'm not a futurist."}, {"time": 3042, "text": "All I can tell you is that we are making tremendous progress in the causal reasoning domain."}, {"time": 3052, "text": "Something that I even dare to call it revolution, the code of revolution, because what we have achieved in the past three decades is something that dwarf everything that was derived in the entire history."}, {"time": 3073, "text": "So there's an excitement about current machine learning methodologies, and there's really important good work you're doing in causal inference."}, {"time": 3084, "text": "Where does the future, where do these worlds collide and what does that look like?"}, {"time": 3095, "text": "First, they're gonna work without collision."}, {"time": 3097, "text": "It's gonna work in harmony."}, {"time": 3100, "text": "Harmony, it's not collision."}, {"time": 3101, "text": "The human is going to jumpstart the exercise by providing qualitative, noncommitting models of how the universe works, how in reality the domain of discourse works."}, {"time": 3123, "text": "The machine is gonna take over from that point of view and derive whatever the calculus says can be derived."}, {"time": 3131, "text": "Namely, quantitative answer to our questions."}, {"time": 3135, "text": "Now, these are complex questions."}, {"time": 3138, "text": "I'll give you some example of complex questions that will bug your mind if you think about it."}, {"time": 3147, "text": "You take result of studies in diverse population under diverse condition, and you infer the cause effect of a new population which doesn't even resemble any of the ones studied, and you do that by do calculus."}, {"time": 3168, "text": "You do that by generalizing from one study to another."}, {"time": 3172, "text": "See, what's common with Berto?"}, {"time": 3174, "text": "What is different?"}, {"time": 3177, "text": "Let's ignore the differences and pull out the commonality, and you do it over maybe 100 hospitals around the world."}, {"time": 3186, "text": "From that, you can get really mileage from big data."}, {"time": 3191, "text": "It's not only that you have many samples, you have many sources of data."}, {"time": 3198, "text": "So that's a really powerful thing, I think, especially for medical applications."}, {"time": 3203, "text": "I mean, cure cancer, right?"}, {"time": 3205, "text": "That's how from data you can cure cancer."}, {"time": 3208, "text": "So we're talking about causation, which is the temporal relationships between things."}, {"time": 3215, "text": "Not only temporal, it's both structural and temporal."}, {"time": 3218, "text": "Temporal enough, temporal precedence by itself cannot replace causation."}, {"time": 3226, "text": "Is temporal precedence the arrow of time in physics?"}, {"time": 3230, "text": "It's important, necessary."}, {"time": 3233, "text": "It's efficient, yes."}, {"time": 3235, "text": "Yes, I never seen cause propagate backward."}, {"time": 3240, "text": "But if we use the word cause, but there's relationships that are timeless."}, {"time": 3247, "text": "I suppose that's still forward in the arrow of time."}, {"time": 3250, "text": "But are there relationships, logical relationships, that fit into the structure?"}, {"time": 3258, "text": "Sure, the whole do calculus is logical relationship."}, {"time": 3261, "text": "That doesn't require a temporal."}, {"time": 3263, "text": "It has just the condition that you're not traveling back in time."}, {"time": 3271, "text": "So it's really a generalization of, a powerful generalization of what?"}, {"time": 3279, "text": "Of Boolean logic."}, {"time": 3280, "text": "Yeah, Boolean logic."}, {"time": 3283, "text": "That is sort of simply put, and allows us to reason about the order of events, the source, the."}, {"time": 3294, "text": "Not about, between, we're not deriving the order of events."}, {"time": 3298, "text": "We are given cause effects relationship, okay?"}, {"time": 3301, "text": "They ought to be obeying the time presidents relationship."}, {"time": 3308, "text": "We are given it."}, {"time": 3309, "text": "And now that we ask questions about other causes of relationship, that could be derived from the initial ones, but were not given to us explicitly."}, {"time": 3320, "text": "Like the case of the firing squad I gave you in the first chapter."}, {"time": 3328, "text": "And I ask, what if rifleman A declined to shoot?"}, {"time": 3333, "text": "Would the prisoner still be dead?"}, {"time": 3337, "text": "To decline to shoot, it means that he disobey order."}, {"time": 3342, "text": "And the rule of the games were that he is a obedient marksman, okay?"}, {"time": 3351, "text": "That's how you start."}, {"time": 3352, "text": "That's the initial order."}, {"time": 3353, "text": "But now you ask question about breaking the rules."}, {"time": 3356, "text": "What if he decided not to pull the trigger?"}, {"time": 3360, "text": "He just became a pacifist."}, {"time": 3363, "text": "And you and I can answer that."}, {"time": 3366, "text": "The other rifleman would have killed him, okay?"}, {"time": 3369, "text": "I want the machine to do that."}, {"time": 3372, "text": "Is it so hard to ask a machine to do that?"}, {"time": 3375, "text": "It's such a simple task."}, {"time": 3376, "text": "You have to have a calculus for that."}, {"time": 3381, "text": "But the curiosity, the natural curiosity for me is that yes, you're absolutely correct and important."}, {"time": 3387, "text": "And it's hard to believe that we haven't done this seriously extensively already a long time ago."}, {"time": 3395, "text": "So this is really important work."}, {"time": 3397, "text": "But I also wanna know, maybe you can philosophize about how hard is it to learn."}, {"time": 3403, "text": "Okay, let's assume we're learning."}, {"time": 3404, "text": "We wanna learn it, okay?"}, {"time": 3405, "text": "We wanna learn."}, {"time": 3406, "text": "So what do we do?"}, {"time": 3407, "text": "We put a learning machine that watches execution trials in many countries and many locations, okay?"}, {"time": 3417, "text": "All the machine can learn is to see shut or not shut."}, {"time": 3421, "text": "Dead, not dead."}, {"time": 3422, "text": "A court issued an order or didn't, okay?"}, {"time": 3425, "text": "Just the facts."}, {"time": 3427, "text": "For the fact you don't know who listens to whom."}, {"time": 3430, "text": "You don't know that the condemned person listened to the bullets, that the bullets are listening to the captain, okay?"}, {"time": 3439, "text": "All we hear is one command, two shots, dead, okay?"}, {"time": 3444, "text": "A triple of variable."}, {"time": 3447, "text": "Yes, no, yes, no."}, {"time": 3449, "text": "Okay, that you can learn who listens to whom and you can answer the question, no."}, {"time": 3453, "text": "Definitively no."}, {"time": 3455, "text": "But don't you think you can start proposing ideas for humans to review?"}, {"time": 3461, "text": "You want machine to learn, you want a robot."}, {"time": 3464, "text": "So robot is watching trials like that, 200 trials, and then he has to answer the question, what if rifleman A refrain from shooting?"}, {"time": 3480, "text": "That's exactly my point."}, {"time": 3483, "text": "It's looking at the facts, don't give you the strings behind the facts."}, {"time": 3487, "text": "Absolutely, but do you think of machine learning as it's currently defined as only something that looks at the facts and tries to do?"}, {"time": 3497, "text": "Right now, they only look at the facts, yeah."}, {"time": 3499, "text": "So is there a way to modify, in your sense?"}, {"time": 3506, "text": "Yes, once in a while."}, {"time": 3506, "text": "Doing the interventionist kind of thing, intervention."}, {"time": 3509, "text": "But it could be at random."}, {"time": 3511, "text": "For instance, the rifleman is sick that day or he just vomits or whatever."}, {"time": 3517, "text": "So machine can observe this unexpected event which introduce noise."}, {"time": 3523, "text": "The noise still have to be random to be able to relate it to randomized experiment."}, {"time": 3531, "text": "And then you have observational studies from which to infer the strings behind the facts."}, {"time": 3539, "text": "It's doable to a certain extent."}, {"time": 3542, "text": "But now that we are expert in what you can do once you have a model, we can reason back and say, what kind of data you need to build a model."}, {"time": 3553, "text": "Got it, so I know you're not a futurist, but are you excited?"}, {"time": 3559, "text": "Have you, when you look back at your life, longed for the idea of creating a human level intelligence system?"}, {"time": 3565, "text": "Yeah, I'm driven by that."}, {"time": 3568, "text": "All my life, I'm driven just by one thing."}, {"time": 3573, "text": "But I go slowly."}, {"time": 3574, "text": "I go from what I know to the next step incrementally."}, {"time": 3579, "text": "So without imagining what the end goal looks like."}, {"time": 3582, "text": "Do you imagine what an eight?"}, {"time": 3584, "text": "The end goal is gonna be a machine that can answer sophisticated questions, counterfactuals of regret, compassion, responsibility, and free will."}, {"time": 3599, "text": "So what is a good test?"}, {"time": 3601, "text": "Is a Turing test a reasonable test?"}, {"time": 3604, "text": "A test of free will doesn't exist yet."}, {"time": 3608, "text": "How would you test free will?"}, {"time": 3610, "text": "So far, we know only one thing."}, {"time": 3614, "text": "If robots can communicate with reward and punishment among themselves and hitting each other on the wrist and say, you shouldn't have done that, okay?"}, {"time": 3627, "text": "Playing better soccer because they can do that."}, {"time": 3633, "text": "What do you mean, because they can do that?"}, {"time": 3635, "text": "Because they can communicate among themselves."}, {"time": 3638, "text": "Because of the communication they can do."}, {"time": 3640, "text": "Because they communicate like us."}, {"time": 3642, "text": "Reward and punishment, yes."}, {"time": 3644, "text": "You didn't pass the ball at the right time, and so therefore you're gonna sit on the bench for the next two."}, {"time": 3651, "text": "If they start communicating like that, the question is, will they play better soccer?"}, {"time": 3656, "text": "As opposed to what?"}, {"time": 3657, "text": "As opposed to what they do now?"}, {"time": 3659, "text": "Without this ability to reason about reward and punishment."}, {"time": 3664, "text": "Responsibility."}, {"time": 3666, "text": "And?"}, {"time": 3667, "text": "Artifactions."}, {"time": 3668, "text": "So far, I can only think about communication."}, {"time": 3671, "text": "Communication is, and not necessarily natural language, but just communication."}, {"time": 3676, "text": "Just communication."}, {"time": 3677, "text": "And that's important to have a quick and effective means of communicating knowledge."}, {"time": 3684, "text": "If the coach tells you you should have passed the ball, pink, he conveys so much knowledge to you as opposed to what?"}, {"time": 3690, "text": "Go down and change your software."}, {"time": 3693, "text": "That's the alternative."}, {"time": 3695, "text": "But the coach doesn't know your software."}, {"time": 3697, "text": "So how can the coach tell you you should have passed the ball?"}, {"time": 3701, "text": "But our language is very effective."}, {"time": 3704, "text": "You should have passed the ball."}, {"time": 3705, "text": "You know your software."}, {"time": 3707, "text": "You tweak the right module, and next time you don't do it."}, {"time": 3712, "text": "Now that's for playing soccer, the rules are well defined."}, {"time": 3715, "text": "No, no, no, no, they're not well defined."}, {"time": 3717, "text": "When you should pass the ball."}, {"time": 3718, "text": "Is not well defined."}, {"time": 3720, "text": "No, it's very soft, very noisy."}, {"time": 3724, "text": "Yes, you have to do it under pressure."}, {"time": 3726, "text": "It's art."}, {"time": 3727, "text": "But in terms of aligning values between computers and humans, do you think this cause and effect type of thinking is important to align the values, values, morals, ethics under which the machines make decisions, is the cause effect where the two can come together?"}, {"time": 3752, "text": "Cause and effect is necessary component to build an ethical machine."}, {"time": 3758, "text": "Because the machine has to empathize to understand what's good for you, to build a model of you as a recipient, which should be very much, what is compassion?"}, {"time": 3770, "text": "They imagine that you suffer pain as much as me."}, {"time": 3776, "text": "As much as me."}, {"time": 3777, "text": "I do have already a model of myself, right?"}, {"time": 3780, "text": "So it's very easy for me to map you to mine."}, {"time": 3782, "text": "I don't have to rebuild the model."}, {"time": 3784, "text": "It's much easier to say, oh, you're like me."}, {"time": 3786, "text": "Okay, therefore I would not hate you."}, {"time": 3789, "text": "And the machine has to imagine, has to try to fake to be human essentially so you can imagine that you're like me, right?"}, {"time": 3799, "text": "And moreover, who is me?"}, {"time": 3801, "text": "That's the first, that's consciousness."}, {"time": 3804, "text": "They have a model of yourself."}, {"time": 3806, "text": "Where do you get this model?"}, {"time": 3808, "text": "You look at yourself as if you are a part of the environment."}, {"time": 3812, "text": "If you build a model of yourself versus the environment, then you can say, I need to have a model of myself."}, {"time": 3818, "text": "I have abilities, I have desires and so forth, okay?"}, {"time": 3821, "text": "I have a blueprint of myself though."}, {"time": 3824, "text": "Not the full detail because I cannot get the whole thing problem."}, {"time": 3829, "text": "But I have a blueprint."}, {"time": 3830, "text": "So on that level of a blueprint, I can modify things."}, {"time": 3834, "text": "I can look at myself in the mirror and say, hmm, if I change this model, tweak this model, I'm gonna perform differently."}, {"time": 3842, "text": "That is what we mean by free will."}, {"time": 3848, "text": "What do you think is consciousness?"}, {"time": 3850, "text": "Is it simply self awareness?"}, {"time": 3851, "text": "So including yourself into the model of the world?"}, {"time": 3855, "text": "Some people tell me, no, this is only part of consciousness."}, {"time": 3859, "text": "And then they start telling me what they really mean by consciousness, and I lose them."}, {"time": 3864, "text": "For me, consciousness is having a blueprint of your software."}, {"time": 3871, "text": "Do you have concerns about the future of AI?"}, {"time": 3877, "text": "All the different trajectories of all of our research?"}, {"time": 3880, "text": "Where's your hope, where the movement has, where are your concerns?"}, {"time": 3884, "text": "I'm concerned, because I know we are building a new species that has a capability of exceeding our, exceeding us, exceeding our capabilities, and can breed itself and take over the world."}, {"time": 3903, "text": "It's a new species that is uncontrolled."}, {"time": 3907, "text": "We don't know the degree to which we control it."}, {"time": 3910, "text": "We don't even understand what it means to be able to control this new species."}, {"time": 3916, "text": "So I'm concerned."}, {"time": 3918, "text": "I don't have anything to add to that, because it's such a gray area, it's unknown."}, {"time": 3926, "text": "It never happened in history."}, {"time": 3929, "text": "The only time it happened in history was evolution with human beings."}, {"time": 3937, "text": "It wasn't very successful, was it?"}, {"time": 3939, "text": "Some people say it was a great success."}, {"time": 3942, "text": "For us it was, but a few people along the way, a few creatures along the way would not agree."}, {"time": 3949, "text": "So it's just because it's such a gray area, there's nothing else to say."}, {"time": 3954, "text": "We have a sample of one."}, {"time": 3956, "text": "Sample of one."}, {"time": 3958, "text": "It's us."}, {"time": 3959, "text": "But some people would look at you and say, yeah, but we were looking to you to help us make sure that the sample two works out okay."}, {"time": 3973, "text": "We have more than a sample of one."}, {"time": 3974, "text": "We have theories, and that's a good."}, {"time": 3978, "text": "We don't need to be statisticians."}, {"time": 3980, "text": "So sample of one doesn't mean poverty of knowledge."}, {"time": 3986, "text": "Sample of one plus theory, conjectural theory, of what could happen."}, {"time": 3992, "text": "That we do have."}, {"time": 3994, "text": "But I really feel helpless in contributing to this argument, because I know so little, and my imagination is limited, and I know how much I don't know, and I, but I'm concerned."}, {"time": 4015, "text": "You were born and raised in Israel."}, {"time": 4017, "text": "Born and raised in Israel, yes."}, {"time": 4019, "text": "And later served in Israel military, defense forces."}, {"time": 4025, "text": "In the Israel Defense Force."}, {"time": 4033, "text": "From this experience?"}, {"time": 4036, "text": "There's a kibbutz in there as well."}, {"time": 4038, "text": "Yes, because I was in the nachal, which is a combination of agricultural work and military service."}, {"time": 4048, "text": "We were supposed, I was really idealist."}, {"time": 4051, "text": "I wanted to be a member of the kibbutz throughout my life, and to live a communal life, and so I prepared myself for that."}, {"time": 4066, "text": "Slowly, slowly, I wanted a greater challenge."}, {"time": 4071, "text": "So that's a far world away, both."}, {"time": 4075, "text": "What I learned from that, what I can add, it was a miracle."}, {"time": 4081, "text": "It was a miracle that I served in the 1950s."}, {"time": 4087, "text": "I don't know how we survived."}, {"time": 4091, "text": "The country was under austerity."}, {"time": 4095, "text": "It tripled its population from 600,000 to a million point eight when I finished college."}, {"time": 4103, "text": "No one went hungry."}, {"time": 4104, "text": "And austerity, yes."}, {"time": 4109, "text": "When you wanted to make an omelet in a restaurant, you had to bring your own egg."}, {"time": 4118, "text": "And they imprisoned people from bringing the food from farming here, from the villages, to the city."}, {"time": 4129, "text": "But no one went hungry."}, {"time": 4130, "text": "And I always add to it, and higher education did not suffer any budget cut."}, {"time": 4140, "text": "They still invested in me, in my wife, in our generation to get the best education that they could, okay?"}, {"time": 4149, "text": "So I'm really grateful for the opportunity, and I'm trying to pay back now, okay?"}, {"time": 4158, "text": "It's a miracle that we survived the war of 1948."}, {"time": 4162, "text": "We were so close to a second genocide."}, {"time": 4167, "text": "It was all planned."}, {"time": 4170, "text": "But we survived it by miracle, and then the second miracle that not many people talk about, the next phase."}, {"time": 4177, "text": "How no one went hungry, and the country managed to triple its population."}, {"time": 4183, "text": "You know what it means to triple?"}, {"time": 4185, "text": "Imagine United States going from what, 350 million to a trillion, unbelievable."}, {"time": 4193, "text": "So it's a really tense part of the world."}, {"time": 4197, "text": "It's a complicated part of the world, Israel and all around."}, {"time": 4201, "text": "Religion is at the core of that complexity."}, {"time": 4208, "text": "One of the components."}, {"time": 4209, "text": "Religion is a strong motivating cause to many, many people in the Middle East, yes."}, {"time": 4216, "text": "In your view, looking back, is religion good for society?"}, {"time": 4223, "text": "That's a good question for robotic, you know?"}, {"time": 4226, "text": "There's echoes of that question."}, {"time": 4228, "text": "Equip robot with religious belief."}, {"time": 4232, "text": "Suppose we find out, or we agree that religion is good to you, to keep you in line, okay?"}, {"time": 4237, "text": "Should we give the robot the metaphor of a god?"}, {"time": 4243, "text": "As a matter of fact, the robot will get it without us also."}, {"time": 4248, "text": "The robot will reason by metaphor."}, {"time": 4251, "text": "And what is the most primitive metaphor a child grows with?"}, {"time": 4258, "text": "Mother smile, father teaching, father image and mother image, that's god."}, {"time": 4265, "text": "So, whether you want it or not, the robot will, well, assuming that the robot is gonna have a mother and a father, it may only have a programmer, which doesn't supply warmth and discipline."}, {"time": 4280, "text": "Well, discipline it does."}, {"time": 4282, "text": "So the robot will have a model of the trainer, and everything that happens in the world, cosmology and so on, is going to be mapped into the programmer, it's god."}, {"time": 4296, "text": "Man, the thing that represents the origin of everything for that robot."}, {"time": 4303, "text": "It's the most primitive relationship."}, {"time": 4306, "text": "So it's gonna arrive there by metaphor."}, {"time": 4308, "text": "And so the question is if overall that metaphor has served us well as humans."}, {"time": 4318, "text": "I think it did, but as long as you keep in mind it's only a metaphor."}, {"time": 4325, "text": "So, if you think we can, can we talk about your son?"}, {"time": 4333, "text": "Can you tell his story?"}, {"time": 4335, "text": "His story?"}, {"time": 4337, "text": "Daniel?"}, {"time": 4338, "text": "His story is known, he was abducted in Pakistan by Al Qaeda driven sect, and under various pretenses."}, {"time": 4352, "text": "I don't even pay attention to what the pretence was."}, {"time": 4355, "text": "Originally they wanted to have the United States deliver some promised airplanes."}, {"time": 4367, "text": "It was all made up, and all these demands were bogus."}, {"time": 4371, "text": "Bogus, I don't know really, but eventually he was executed in front of a camera."}, {"time": 4383, "text": "At the core of that is hate and intolerance."}, {"time": 4387, "text": "At the core, yes, absolutely, yes."}, {"time": 4390, "text": "We don't really appreciate the depth of the hate at which billions of peoples are educated."}, {"time": 4406, "text": "We don't understand it."}, {"time": 4407, "text": "I just listened recently to what they teach you in Mogadishu."}, {"time": 4412, "text": "Okay, okay, when the water stopped in the tap, we knew exactly who did it, the Jews."}, {"time": 4429, "text": "The Jews."}, {"time": 4430, "text": "We didn't know how, but we knew who did it."}, {"time": 4435, "text": "We don't appreciate what it means to us."}, {"time": 4438, "text": "The depth is unbelievable."}, {"time": 4440, "text": "Do you think all of us are capable of evil?"}, {"time": 4446, "text": "And the education, the indoctrination is really what creates evil."}, {"time": 4450, "text": "Absolutely we are capable of evil."}, {"time": 4452, "text": "If you're indoctrinated sufficiently long and in depth, you're capable of ISIS, you're capable of Nazism."}, {"time": 4464, "text": "Yes, we are, but the question is whether we, after we have gone through some Western education and we learn that everything is really relative."}, {"time": 4475, "text": "It is not absolute God."}, {"time": 4477, "text": "It's only a belief in God."}, {"time": 4480, "text": "Whether we are capable now of being transformed under certain circumstances to become brutal."}, {"time": 4491, "text": "I'm worried about it because some people say yes, given the right circumstances, given bad economical crisis, you are capable of doing it too."}, {"time": 4506, "text": "That worries me."}, {"time": 4508, "text": "I want to believe it, I'm not capable."}, {"time": 4512, "text": "So seven years after Daniel's death, you wrote an article at the Wall Street Journal titled Daniel Pearl and the Normalization of Evil."}, {"time": 4520, "text": "What was your message back then and how did it change today over the years?"}, {"time": 4527, "text": "I lost."}, {"time": 4530, "text": "What was the message?"}, {"time": 4531, "text": "The message was that we are not treating terrorism as a taboo."}, {"time": 4541, "text": "We are treating it as a bargaining device that is accepted."}, {"time": 4546, "text": "People have grievance and they go and bomb restaurants."}, {"time": 4554, "text": "It's normal."}, {"time": 4555, "text": "Look, you're even not surprised when I tell you that."}, {"time": 4559, "text": "20 years ago you say, what?"}, {"time": 4561, "text": "For grievance you go and blow a restaurant?"}, {"time": 4565, "text": "Today it's becoming normalized."}, {"time": 4567, "text": "The banalization of evil."}, {"time": 4571, "text": "And we have created that to ourselves by normalizing, by making it part of political life."}, {"time": 4583, "text": "It's a political debate."}, {"time": 4587, "text": "Every terrorist yesterday becomes a freedom fighter today and tomorrow it becomes terrorist again."}, {"time": 4596, "text": "It's switchable."}, {"time": 4598, "text": "Right, and so we should call out evil when there's evil."}, {"time": 4602, "text": "If we don't want to be part of it."}, {"time": 4606, "text": "Becoming."}, {"time": 4609, "text": "Yeah, if we want to separate good from evil, that's one of the first things that, what was it, in the Garden of Eden, remember the first thing that God told him was, hey, you want some knowledge, here's a tree of good and evil."}, {"time": 4627, "text": "Yeah, so this evil touched your life personally."}, {"time": 4632, "text": "Does your heart have anger, sadness, or is it hope?"}, {"time": 4640, "text": "Look, I see some beautiful people coming from Pakistan."}, {"time": 4646, "text": "I see beautiful people everywhere."}, {"time": 4649, "text": "But I see horrible propagation of evil in this country too."}, {"time": 4658, "text": "It shows you how populistic slogans can catch the mind of the best intellectuals."}, {"time": 4668, "text": "Today is Father's Day."}, {"time": 4670, "text": "I didn't know that."}, {"time": 4671, "text": "Yeah, what's a fond memory you have of Daniel?"}, {"time": 4676, "text": "What's a fond memory you have of Daniel?"}, {"time": 4678, "text": "Oh, very good memories, immense."}, {"time": 4682, "text": "He was my mentor."}, {"time": 4686, "text": "He had a sense of balance that I didn't have."}, {"time": 4695, "text": "He saw the beauty in every person."}, {"time": 4699, "text": "He was not as emotional as I am, the more looking things in perspective."}, {"time": 4706, "text": "He really liked every person."}, {"time": 4709, "text": "He really grew up with the idea that a foreigner is a reason for curiosity, not for fear."}, {"time": 4722, "text": "That one time we went in Berkeley, and a homeless came out from some dark alley, and said, hey, man, can you spare a dime?"}]}]