[{"title": "Ben Goertzel: Artificial General Intelligence | Lex Fridman Podcast #103", "id": "OpSmCKe27WE", "quotes": [{"time": 382, "text": "So those two science fiction writers had a huge impact on me."}, {"time": 386, "text": "Then a little older than that, I got into Dostoevsky and Friedrich Nietzsche and Rimbaud and a bunch of more literary type writing."}, {"time": 396, "text": "Can we talk about some of those things?"}, {"time": 398, "text": "So on the Solaris side, Stanislaw Lem, this kind of idea of there being intelligences out there that are different than our own, do you think there are intelligences maybe all around us that we're not able to even detect?"}, {"time": 416, "text": "So this kind of idea of, maybe you can comment also on Stephen Wolfram thinking that there's computations all around us and we're just not smart enough to kind of detect their intelligence or appreciate their intelligence."}, {"time": 430, "text": "Yeah, so my friend Hugo de Gares, who I've been talking to about these things for many decades, since the early 90s, he had an idea he called SIPI, the Search for Intraparticulate Intelligence."}, {"time": 445, "text": "So the concept there was as AIs get smarter and smarter and smarter, assuming the laws of physics as we know them now are still what these super intelligences perceived to hold and are bound by, as they get smarter and smarter, they're gonna shrink themselves littler and littler because special relativity makes it so they can communicate between two spatially distant points."}, {"time": 469, "text": "So they're gonna get smaller and smaller, but then ultimately, what does that mean?"}, {"time": 473, "text": "The minds of the super, super, super intelligences, they're gonna be packed into the interaction of elementary particles or quarks or the partons inside quarks or whatever it is."}, {"time": 484, "text": "So what we perceive as random fluctuations on the quantum or sub quantum level may actually be the thoughts of the micro, micro, micro miniaturized super intelligences because there's no way we can tell random from structured but within algorithmic information more complex than our brains, right?"}, {"time": 503, "text": "We can't tell the difference."}, {"time": 504, "text": "So what we think is random could be the thought processes of some really tiny super minds."}, {"time": 509, "text": "And if so, there is not a damn thing we can do about it, except try to upgrade our intelligences and expand our minds so that we can perceive more of what's around us."}, {"time": 521, "text": "But if those random fluctuations, like even if we go to like quantum mechanics, if that's actually super intelligent systems, aren't we then part of the super of super intelligence?"}, {"time": 534, "text": "Aren't we just like a finger of the entirety of the body of the super intelligent system?"}, {"time": 541, "text": "It could be, I mean, a finger is a strange metaphor."}, {"time": 545, "text": "I mean, we... A finger is dumb is what I mean."}, {"time": 550, "text": "But the finger is also useful and is controlled with intent by the brain whereas we may be much less than that, right?"}, {"time": 556, "text": "I mean, yeah, we may be just some random epiphenomenon that they don't care about too much."}, {"time": 563, "text": "Like think about the shape of the crowd emanating from a sports stadium or something, right?"}, {"time": 568, "text": "There's some emergent shape to the crowd, it's there."}, {"time": 571, "text": "You could take a picture of it, it's kind of cool."}, {"time": 573, "text": "It's irrelevant to the main point of the sports event or where the people are going or what's on the minds of the people making that shape in the crowd, right?"}, {"time": 581, "text": "So we may just be some semi arbitrary higher level pattern popping out of a lower level hyper intelligent self organization."}, {"time": 592, "text": "And I mean, so be it, right?"}, {"time": 595, "text": "I mean, that's one thing that... Yeah, I mean, the older I've gotten, the more respect I've achieved for our fundamental ignorance."}, {"time": 604, "text": "I mean, mine and everybody else's."}, {"time": 606, "text": "I mean, I look at my two dogs, two beautiful little toy poodles and they watch me sitting at the computer typing."}, {"time": 614, "text": "They just think I'm sitting there wiggling my fingers to exercise them maybe or guarding the monitor on the desk that they have no idea that I'm communicating with other people halfway around the world, let alone creating complex algorithms running in RAM on some computer server in St. Petersburg or something, right?"}, {"time": 632, "text": "Although they're right there in the room with me."}, {"time": 635, "text": "So what things are there right around us that we're just too stupid or close minded to comprehend?"}, {"time": 640, "text": "Probably quite a lot."}, {"time": 642, "text": "Your very poodle could also be communicating across multiple dimensions with other beings and you're too unintelligent to understand the kind of communication mechanism they're going through."}, {"time": 655, "text": "There have been various TV shows and science fiction novels, poisoning cats, dolphins, mice and whatnot are actually super intelligences here to observe that."}, {"time": 667, "text": "I would guess as one or the other quantum physics founders said, those theories are not crazy enough to be true."}, {"time": 675, "text": "The reality is probably crazier than that."}, {"time": 678, "text": "So on the human side, with Philip K. Dick and in general, where do you fall on this idea that love and just the basic spirit of human nature persists throughout these multiple realities?"}, {"time": 694, "text": "Are you on the side, like the thing that inspires you about artificial intelligence, is it the human side of somehow persisting through all of the different systems we engineer or is AI inspire you to create something that's greater than human, that's beyond human, that's almost nonhuman?"}, {"time": 719, "text": "I would say my motivation to create AGI comes from both of those directions actually."}, {"time": 725, "text": "So when I first became passionate about AGI when I was, it would have been two or three years old after watching robots on Star Trek."}, {"time": 734, "text": "I mean, then it was really a combination of intellectual curiosity, like can a machine really think, how would you do that?"}, {"time": 742, "text": "And yeah, just ambition to create something much better than all the clearly limited and fundamentally defective humans I saw around me."}, {"time": 751, "text": "Then as I got older and got more enmeshed in the human world and got married, had children, saw my parents begin to age, I started to realize, well, not only will AGI let you go far beyond the limitations of the human, but it could also stop us from dying and suffering and feeling pain and tormenting ourselves mentally."}, {"time": 774, "text": "So you can see AGI has amazing capability to do good for humans, as humans, alongside with its capability to go far, far beyond the human level."}, {"time": 786, "text": "So I mean, both aspects are there, which makes it even more exciting and important."}, {"time": 793, "text": "So you mentioned Dostoevsky and Nietzsche."}, {"time": 795, "text": "Where did you pick up from those guys?"}, {"time": 798, "text": "That would probably go beyond the scope of a brief interview, certainly."}, {"time": 804, "text": "I mean, both of those are amazing thinkers who one, will necessarily have a complex relationship with, right?"}, {"time": 812, "text": "So, I mean, Dostoevsky on the minus side, he's kind of a religious fanatic and he sort of helped squash the Russian nihilist movement, which was very interesting."}, {"time": 823, "text": "Because what nihilism meant originally in that period of the mid, late 1800s in Russia was not taking anything fully 100% for granted."}, {"time": 832, "text": "It was really more like what we'd call Bayesianism now, where you don't wanna adopt anything as a dogmatic certitude and always leave your mind open."}, {"time": 841, "text": "And how Dostoevsky parodied nihilism was a bit different, right?"}, {"time": 846, "text": "He parodied as people who believe absolutely nothing."}, {"time": 850, "text": "So they must assign an equal probability weight to every proposition, which doesn't really work."}, {"time": 857, "text": "So on the one hand, I didn't really agree with Dostoevsky on his sort of religious point of view."}, {"time": 866, "text": "On the other hand, if you look at his understanding of human nature and sort of the human mind and heart and soul, it's really unparalleled."}, {"time": 877, "text": "He had an amazing view of how human beings construct a world for themselves based on their own understanding and their own mental predisposition."}, {"time": 887, "text": "And I think if you look in the brothers Karamazov in particular, the Russian literary theorist Mikhail Bakhtin wrote about this as a polyphonic mode of fiction, which means it's not third person, but it's not first person from any one person really."}, {"time": 905, "text": "There are many different characters in the novel and each of them is sort of telling part of the story from their own point of view."}, {"time": 911, "text": "So the reality of the whole story is an intersection like synergetically of the many different characters world views."}, {"time": 919, "text": "And that really, it's a beautiful metaphor and even a reflection I think of how all of us socially create our reality."}, {"time": 927, "text": "Like each of us sees the world in a certain way."}, {"time": 931, "text": "Each of us in a sense is making the world as we see it based on our own minds and understanding, but it's polyphony like in music where multiple instruments are coming together to create the sound."}, {"time": 944, "text": "The ultimate reality that's created comes out of each of our subjective understandings, intersecting with each other."}, {"time": 951, "text": "And that was one of the many beautiful things in Dostoevsky."}, {"time": 955, "text": "So maybe a little bit to mention, you have a connection to Russia and the Soviet culture."}, {"time": 962, "text": "I mean, I'm not sure exactly what the nature of the connection is, but at least the spirit of your thinking is in there."}, {"time": 967, "text": "Well, my ancestry is three quarters Eastern European Jewish."}, {"time": 972, "text": "So I mean, my three of my great grandparents emigrated to New York from Lithuania and sort of border regions of Poland, which are in and out of Poland in around the time of World War I."}, {"time": 988, "text": "And they were socialists and communists as well as Jews, mostly Menshevik, not Bolshevik."}, {"time": 995, "text": "And they sort of, they fled at just the right time to the US for their own personal reasons."}, {"time": 1001, "text": "And then almost all, or maybe all of my extended family that remained in Eastern Europe was killed either by Hitlands or Stalin's minions at some point."}, {"time": 1010, "text": "So the branch of the family that emigrated to the US was pretty much the only one."}, {"time": 1016, "text": "So how much of the spirit of the people is in your blood still?"}, {"time": 1019, "text": "Like, when you look in the mirror, do you see, what do you see?"}, {"time": 1024, "text": "Meat, I see a bag of meat that I want to transcend by uploading into some sort of superior reality."}, {"time": 1032, "text": "But very, I mean, yeah, very clearly, I mean, I'm not religious in a traditional sense, but clearly the Eastern European Jewish tradition was what I was raised in."}, {"time": 1048, "text": "I mean, there was, my grandfather, Leo Zwell, was a physical chemist who worked with Linus Pauling and a bunch of the other early greats in quantum mechanics."}, {"time": 1058, "text": "I mean, he was into X ray diffraction."}, {"time": 1061, "text": "He was on the material science side, an experimentalist rather than a theorist."}, {"time": 1065, "text": "His sister was also a physicist."}, {"time": 1067, "text": "And my father's father, Victor Gertzel, was a PhD in psychology who had the unenviable job of giving Soka therapy to the Japanese in internment camps in the US in World War II, like to counsel them why they shouldn't kill themselves, even though they'd had all their stuff taken away and been imprisoned for no good reason."}, {"time": 1090, "text": "So, I mean, yeah, there's a lot of Eastern European Jewishness in my background."}, {"time": 1098, "text": "One of my great uncles was, I guess, conductor of San Francisco Orchestra."}, {"time": 1102, "text": "So there's a lot of Mickey Salkind, bunch of music in there also."}, {"time": 1107, "text": "And clearly this culture was all about learning and understanding the world, and also not quite taking yourself too seriously while you do it, right?"}, {"time": 1119, "text": "There's a lot of Yiddish humor in there."}, {"time": 1122, "text": "So I do appreciate that culture, although the whole idea that like the Jews are the chosen people of God never resonated with me too much."}, {"time": 1131, "text": "The graph of the Gertzel family, I mean, just the people I've encountered just doing some research and just knowing your work through the decades, it's kind of fascinating."}, {"time": 1143, "text": "Just the number of PhDs."}, {"time": 1146, "text": "Yeah, yeah, I mean, my dad is a sociology professor who recently retired from Rutgers University, but clearly that gave me a head start in life."}, {"time": 1158, "text": "I mean, my grandfather gave me all those quantum mechanics books when I was like seven or eight years old."}, {"time": 1164, "text": "I remember going through them, and it was all the old quantum mechanics like Rutherford Adams and stuff."}, {"time": 1170, "text": "So I got to the part of wave functions, which I didn't understand, although I was very bright kid."}, {"time": 1176, "text": "And I realized he didn't quite understand it either, but at least like he pointed me to some professor he knew at UPenn nearby who understood these things, right?"}, {"time": 1185, "text": "So that's an unusual opportunity for a kid to have, right?"}, {"time": 1189, "text": "My dad, he was programming Fortran when I was 10 or 11 years old on like HP 3000 mainframes at Rutgers University."}, {"time": 1197, "text": "So I got to do linear regression in Fortran on punch cards when I was in middle school, right?"}, {"time": 1204, "text": "Because he was doing, I guess, analysis of demographic and sociology data."}, {"time": 1209, "text": "So yes, certainly that gave me a head start and a push towards science beyond what would have been the case with many, many different situations."}, {"time": 1219, "text": "When did you first fall in love with AI?"}, {"time": 1222, "text": "Is it the programming side of Fortran?"}, {"time": 1224, "text": "Is it maybe the sociology psychology that you picked up from your dad?"}, {"time": 1228, "text": "Or is it the quantum mechanics?"}, {"time": 1229, "text": "I fell in love with AI when I was probably three years old when I saw a robot on Star Trek."}, {"time": 1232, "text": "It was turning around in a circle going, error, error, error, error, because Spock and Kirk had tricked it into a mechanical breakdown by presenting it with a logical paradox."}, {"time": 1242, "text": "And I was just like, well, this makes no sense."}, {"time": 1245, "text": "This AI is very, very smart."}, {"time": 1247, "text": "It's been traveling all around the universe, but these people could trick it with a simple logical paradox."}, {"time": 1252, "text": "Like why, if the human brain can get beyond that paradox, why can't this AI?"}, {"time": 1259, "text": "So I felt the screenwriters of Star Trek had misunderstood the nature of intelligence."}, {"time": 1266, "text": "And I complained to my dad about it, and he wasn't gonna say anything one way or the other."}, {"time": 1272, "text": "But before I was born, when my dad was at Antioch College in the middle of the US, he led a protest movement called SLAM, Student League Against Mortality."}, {"time": 1287, "text": "They were protesting against death, wandering across the campus."}, {"time": 1291, "text": "So he was into some futuristic things even back then, but whether AI could confront logical paradoxes or not, he didn't know."}, {"time": 1301, "text": "But when I, 10 years after that or something, I discovered Douglas Hofstadter's book, Gordalesh or Bach, and that was sort of to the same point of AI and paradox and logic, right?"}, {"time": 1312, "text": "Because he was over and over with Gordal's incompleteness theorem, and can an AI really fully model itself reflexively or does that lead you into some paradox?"}, {"time": 1322, "text": "Can the human mind truly model itself reflexively or does that lead you into some paradox?"}, {"time": 1327, "text": "So I think that book, Gordalesh or Bach, which I think I read when it first came out, I would have been 12 years old or something."}, {"time": 1334, "text": "I remember it was like 16 hour day."}, {"time": 1337, "text": "I read it cover to cover and then reread it."}, {"time": 1339, "text": "I reread it after that, because there was a lot of weird things with little formal systems in there that were hard for me at the time."}, {"time": 1345, "text": "But that was the first book I read that gave me a feeling for AI as like a practical academic or engineering discipline that people were working in."}, {"time": 1357, "text": "Because before I read Gordalesh or Bach, I was into AI from the point of view of a science fiction fan."}, {"time": 1363, "text": "And I had the idea, well, it may be a long time before we can achieve immortality in superhuman AGI."}, {"time": 1370, "text": "So I should figure out how to build a spacecraft traveling close to the speed of light, go far away, then come back to the earth in a million years when technology is more advanced and we can build these things."}, {"time": 1381, "text": "Reading Gordalesh or Bach, while it didn't all ring true to me, a lot of it did, but I could see like there are smart people right now at various universities around me who are actually trying to work on building what I would now call AGI, although Hofstadter didn't call it that."}, {"time": 1399, "text": "So really it was when I read that book, which would have been probably middle school, that then I started to think, well, this is something that I could practically work on."}, {"time": 1409, "text": "Yeah, as opposed to flying away and waiting it out, you can actually be one of the people that actually builds the system."}, {"time": 1415, "text": "And if you think about, I mean, I was interested in what we'd now call nanotechnology and in the human immortality and time travel, all the same cool things as every other, like science fiction loving kid."}, {"time": 1429, "text": "But AI seemed like if Hofstadter was right, you just figure out the right program, sit there and type it."}, {"time": 1435, "text": "Like you don't need to spin stars into weird configurations or get government approval to cut people up and fiddle with their DNA or something, right?"}, {"time": 1445, "text": "It's just programming."}, {"time": 1446, "text": "And then of course that can achieve anything else."}, {"time": 1450, "text": "There's another book from back then, which was by Gerald Feinbaum, who was a physicist at Princeton."}, {"time": 1461, "text": "And that was the Prometheus Project."}, {"time": 1464, "text": "And this book was written in the late 1960s, though I encountered it in the mid 70s."}, {"time": 1468, "text": "But what this book said is in the next few decades, humanity is gonna create superhuman thinking machines, molecular nanotechnology and human immortality."}, {"time": 1477, "text": "And then the challenge we'll have is what to do with it."}, {"time": 1481, "text": "Do we use it to expand human consciousness in a positive direction?"}, {"time": 1484, "text": "Or do we use it just to further vapid consumerism?"}, {"time": 1489, "text": "And what he proposed was that the UN should do a survey on this."}, {"time": 1493, "text": "And the UN should send people out to every little village in remotest Africa or South America and explain to everyone what technology was gonna bring the next few decades and the choice that we had about how to use it."}, {"time": 1505, "text": "And let everyone on the whole planet vote about whether we should develop super AI nanotechnology and immortality for expanded consciousness or for rampant consumerism."}, {"time": 1518, "text": "And needless to say, that didn't quite happen."}, {"time": 1522, "text": "And I think this guy died in the mid 80s, so we didn't even see his ideas start to become more mainstream."}, {"time": 1528, "text": "But it's interesting, many of the themes I'm engaged with now from AGI and immortality, even to trying to democratize technology as I've been pushing forward with Singularity, my work in the blockchain world, many of these themes were there in Feinbaum's book in the late 60s even."}, {"time": 1547, "text": "And of course, Valentin Turchin, a Russian writer and a great Russian physicist who I got to know when we both lived in New York in the late 90s and early aughts."}, {"time": 1559, "text": "I mean, he had a book in the late 60s in Russia, which was the phenomenon of science, which laid out all these same things as well."}, {"time": 1570, "text": "And Val died in, I don't remember, 2004 or five or something of Parkinson'sism."}, {"time": 1575, "text": "So yeah, it's easy for people to lose track now of the fact that the futurist and Singularitarian advanced technology ideas that are now almost mainstream are on TV all the time."}, {"time": 1590, "text": "I mean, these are not that new, right?"}, {"time": 1594, "text": "They're sort of new in the history of the human species, but I mean, these were all around in fairly mature form in the middle of the last century, were written about quite articulately by fairly mainstream people who were professors at top universities."}, {"time": 1610, "text": "It's just until the enabling technologies got to a certain point, then you couldn't make it real."}, {"time": 1617, "text": "And even in the 70s, I was sort of seeing that and living through it, right?"}, {"time": 1624, "text": "From Star Trek to Douglas Hofstadter, things were getting very, very practical from the late 60s to the late 70s."}, {"time": 1631, "text": "And the first computer I bought, you could only program with hexadecimal machine code and you had to solder it together."}, {"time": 1639, "text": "And then like a few years later, there's punch cards."}, {"time": 1643, "text": "And a few years later, you could get like Atari 400 and Commodore VIC 20, and you could type on the keyboard and program in higher level languages alongside the assembly language."}, {"time": 1654, "text": "So these ideas have been building up a while."}, {"time": 1658, "text": "And I guess my generation got to feel them build up, which is different than people coming into the field now for whom these things have just been part of the ambience of culture for their whole career or even their whole life."}, {"time": 1674, "text": "Well, it's fascinating to think about there being all of these ideas kind of swimming, almost with the noise all around the world, all the different generations, and then some kind of nonlinear thing happens where they percolate up and capture the imagination of the mainstream."}, {"time": 1692, "text": "And that seems to be what's happening with AI now."}, {"time": 1694, "text": "I mean, Nietzsche, who you mentioned had the idea of the Superman, right?"}, {"time": 1698, "text": "But he didn't understand enough about technology to think you could physically engineer a Superman by piecing together molecules in a certain way."}, {"time": 1708, "text": "He was a bit vague about how the Superman would appear, but he was quite deep at thinking about what the state of consciousness and the mode of cognition of a Superman would be."}, {"time": 1722, "text": "He was a very astute analyst of how the human mind constructs the illusion of a self, how it constructs the illusion of free will, how it constructs values like good and evil out of its own desire to maintain and advance its own organism."}, {"time": 1741, "text": "He understood a lot about how human minds work."}, {"time": 1744, "text": "Then he understood a lot about how post human minds would work."}, {"time": 1747, "text": "I mean, the Superman was supposed to be a mind that would basically have complete root access to its own brain and consciousness and be able to architect its own value system and inspect and fine tune all of its own biases."}, {"time": 1764, "text": "So that's a lot of powerful thinking there, which then fed in and sort of seeded all of postmodern continental philosophy and all sorts of things have been very valuable in development of culture and indirectly even of technology."}, {"time": 1779, "text": "But of course, without the technology there, it was all some quite abstract thinking."}, {"time": 1784, "text": "So now we're at a time in history when a lot of these ideas can be made real, which is amazing and scary, right?"}, {"time": 1794, "text": "It's kind of interesting to think, what do you think Nietzsche would do if he was born a century later or transported through time?"}, {"time": 1800, "text": "What do you think he would say about AI?"}, {"time": 1802, "text": "Well, those are quite different."}, {"time": 1804, "text": "If he's born a century later or transported through time."}, {"time": 1807, "text": "Well, he'd be on like TikTok and Instagram and he would never write the great works he's written."}, {"time": 1811, "text": "So let's transport him through time."}, {"time": 1813, "text": "Maybe also Sprach Zarathustra would be a music video, right?"}, {"time": 1816, "text": "I mean, who knows?"}, {"time": 1819, "text": "Yeah, but if he was transported through time, do you think, that'd be interesting actually to go back."}, {"time": 1826, "text": "You just made me realize that it's possible to go back and read Nietzsche with an eye of, is there some thinking about artificial beings?"}, {"time": 1834, "text": "I'm sure there he had inklings."}, {"time": 1837, "text": "I mean, with Frankenstein before him, I'm sure he had inklings of artificial beings somewhere in the text."}, {"time": 1844, "text": "It'd be interesting to try to read his work to see if Superman was actually an AGI system."}, {"time": 1855, "text": "Like if he had inklings of that kind of thinking."}, {"time": 1859, "text": "No, I would say not."}, {"time": 1861, "text": "I mean, he had a lot of inklings of modern cognitive science, which are very interesting."}, {"time": 1867, "text": "If you look in like the third part of the collection that's been titled The Will to Power."}, {"time": 1873, "text": "I mean, in book three there, there's very deep analysis of thinking processes, but he wasn't so much of a physical tinkerer type guy, right?"}, {"time": 1887, "text": "He was very abstract."}, {"time": 1889, "text": "Do you think, what do you think about the will to power?"}, {"time": 1892, "text": "Do you think human, what do you think drives humans?"}, {"time": 1897, "text": "Oh, an unholy mix of things."}, {"time": 1899, "text": "I don't think there's one pure, simple, and elegant objective function driving humans by any means."}, {"time": 1907, "text": "What do you think, if we look at, I know it's hard to look at humans in an aggregate, but do you think overall humans are good?"}, {"time": 1917, "text": "Or do we have both good and evil within us that depending on the circumstances, depending on whatever can percolate to the top?"}, {"time": 1928, "text": "Good and evil are very ambiguous, complicated and in some ways silly concepts."}, {"time": 1935, "text": "But if we could dig into your question from a couple of directions."}, {"time": 1939, "text": "So I think if you look in evolution, humanity is shaped both by individual selection and what biologists would call group selection, like tribe level selection, right?"}, {"time": 1952, "text": "So individual selection has driven us in a selfish DNA sort of way."}, {"time": 1958, "text": "So that each of us does to a certain approximation what will help us propagate our DNA to future generations."}, {"time": 1967, "text": "I mean, that's why I've got four kids so far and probably that's not the last one."}, {"time": 1973, "text": "On the other hand."}, {"time": 1975, "text": "I like the ambition."}, {"time": 1976, "text": "Tribal, like group selection means humans in a way will do what will advocate for the persistence of the DNA of their whole tribe or their social group."}, {"time": 1988, "text": "And in biology, you have both of these, right?"}, {"time": 1991, "text": "And you can see, say an ant colony or a beehive, there's a lot of group selection in the evolution of those social animals."}, {"time": 1998, "text": "On the other hand, say a big cat or some very solitary animal, it's a lot more biased toward individual selection."}, {"time": 2006, "text": "Humans are an interesting balance."}, {"time": 2008, "text": "And I think this reflects itself in what we would view as selfishness versus altruism to some extent."}, {"time": 2016, "text": "So we just have both of those objective functions contributing to the makeup of our brains."}, {"time": 2023, "text": "And then as Nietzsche analyzed in his own way and others have analyzed in different ways, I mean, we abstract this as well, we have both good and evil within us, right?"}, {"time": 2035, "text": "Because a lot of what we view as evil is really just selfishness."}, {"time": 2040, "text": "A lot of what we view as good is altruism, which means doing what's good for the tribe."}, {"time": 2047, "text": "And on that level, we have both of those just baked into us and that's how it is."}, {"time": 2053, "text": "Of course, there are psychopaths and sociopaths and people who get gratified by the suffering of others."}, {"time": 2061, "text": "And that's a different thing."}, {"time": 2065, "text": "Yeah, those are exceptions on the whole."}, {"time": 2067, "text": "But I think at core, we're not purely selfish, we're not purely altruistic, we are a mix and that's the nature of it."}, {"time": 2078, "text": "And we also have a complex constellation of values that are just very specific to our evolutionary history."}, {"time": 2089, "text": "Like we love waterways and mountains and the ideal place to put a house is in a mountain overlooking the water, right?"}, {"time": 2096, "text": "And we care a lot about our kids and we care a little less about our cousins and even less about our fifth cousins."}, {"time": 2104, "text": "I mean, there are many particularities to human values, which whether they're good or evil depends on your perspective."}, {"time": 2115, "text": "Say, I spent a lot of time in Ethiopia in Addis Ababa where we have one of our AI development offices for my SingularityNet project."}, {"time": 2124, "text": "And when I walk through the streets in Addis, you know, there's people lying by the side of the road, like just living there by the side of the road, dying probably of curable diseases without enough food or medicine."}, {"time": 2137, "text": "And when I walk by them, you know, I feel terrible, I give them money."}, {"time": 2141, "text": "When I come back home to the developed world, they're not on my mind that much."}, {"time": 2146, "text": "I do donate some, but I mean, I also spend some of the limited money I have enjoying myself in frivolous ways rather than donating it to those people who are right now, like starving, dying and suffering on the roadside."}, {"time": 2161, "text": "So does that make me evil?"}, {"time": 2163, "text": "I mean, it makes me somewhat selfish and somewhat altruistic."}, {"time": 2166, "text": "And we each balance that in our own way, right?"}, {"time": 2170, "text": "So whether that will be true of all possible AGI's is a subtler question."}, {"time": 2179, "text": "So that's how humans are."}, {"time": 2181, "text": "So you have a sense, you kind of mentioned that there's a selfish, I'm not gonna bring up the whole Ayn Rand idea of selfishness being the core virtue."}, {"time": 2191, "text": "That's a whole interesting kind of tangent that I think we'll just distract ourselves on."}, {"time": 2196, "text": "I have to make one amusing comment."}, {"time": 2199, "text": "A comment that has amused me anyway."}, {"time": 2201, "text": "So the, yeah, I have extraordinary negative respect for Ayn Rand."}, {"time": 2207, "text": "Negative, what's a negative respect?"}, {"time": 2210, "text": "But when I worked with a company called Genescient, which was evolving flies to have extraordinary long lives in Southern California."}, {"time": 2221, "text": "So we had flies that were evolved by artificial selection to have five times the lifespan of normal fruit flies."}, {"time": 2227, "text": "But the population of super long lived flies was physically sitting in a spare room at an Ayn Rand elementary school in Southern California."}, {"time": 2238, "text": "So that was just like, well, if I saw this in a movie, I wouldn't believe it."}, {"time": 2243, "text": "Well, yeah, the universe has a sense of humor in that kind of way."}, {"time": 2246, "text": "That fits in, humor fits in somehow into this whole absurd existence."}, {"time": 2250, "text": "But you mentioned the balance between selfishness and altruism as kind of being innate."}, {"time": 2257, "text": "Do you think it's possible that's kind of an emergent phenomena, those peculiarities of our value system?"}, {"time": 2265, "text": "How much of it is innate?"}, {"time": 2267, "text": "How much of it is something we collectively kind of like a Dostoevsky novel bring to life together as a civilization?"}, {"time": 2274, "text": "I mean, the answer to nature versus nurture is usually both."}, {"time": 2278, "text": "And of course it's nature versus nurture versus self organization, as you mentioned."}, {"time": 2284, "text": "So clearly there are evolutionary roots to individual and group selection leading to a mix of selfishness and altruism."}, {"time": 2293, "text": "On the other hand, different cultures manifest that in different ways."}, {"time": 2299, "text": "Well, we all have basically the same biology."}, {"time": 2302, "text": "And if you look at sort of precivilized cultures, you have tribes like the Yanomamo in Venezuela, which their culture is focused on killing other tribes."}, {"time": 2315, "text": "And you have other Stone Age tribes that are mostly peaceful and have big taboos against violence."}, {"time": 2321, "text": "So you can certainly have a big difference in how culture manifests these innate biological characteristics, but still, there's probably limits that are given by our biology."}, {"time": 2336, "text": "I used to argue this with my great grandparents who were Marxists actually, because they believed in the withering away of the state."}, {"time": 2344, "text": "Like they believe that, as you move from capitalism to socialism to communism, people would just become more social minded so that a state would be unnecessary and everyone would give everyone else what they needed."}, {"time": 2360, "text": "Now, setting aside that that's not what the various Marxist experiments on the planet seem to be heading toward in practice."}, {"time": 2369, "text": "Just as a theoretical point, I was very dubious that human nature could go there."}, {"time": 2377, "text": "Like at that time when my great grandparents are alive, I was just like, you know, I'm a cynical teenager."}, {"time": 2383, "text": "I think humans are just jerks."}, {"time": 2385, "text": "The state is not gonna wither away."}, {"time": 2388, "text": "If you don't have some structure keeping people from screwing each other over, they're gonna do it."}, {"time": 2392, "text": "So now I actually don't quite see things that way."}, {"time": 2396, "text": "I mean, I think my feeling now subjectively is the culture aspect is more significant than I thought it was when I was a teenager."}, {"time": 2404, "text": "And I think you could have a human society that was dialed dramatically further toward, you know, self awareness, other awareness, compassion and sharing than our current society."}, {"time": 2416, "text": "And of course, greater material abundance helps, but to some extent material abundance is a subjective perception also because many Stone Age cultures perceive themselves as living in great material abundance that they had all the food and water they wanted, they lived in a beautiful place, that they had sex lives, that they had children."}, {"time": 2437, "text": "I mean, they had abundance without any factories, right?"}, {"time": 2442, "text": "So I think humanity probably would be capable of fundamentally more positive and joy filled mode of social existence than what we have now."}, {"time": 2457, "text": "Clearly Marx didn't quite have the right idea about how to get there."}, {"time": 2461, "text": "I mean, he missed a number of key aspects of human society and its evolution."}, {"time": 2469, "text": "And if we look at where we are in society now, how to get there is a quite different question because there are very powerful forces pushing people in different directions than a positive, joyous, compassionate existence, right?"}, {"time": 2486, "text": "So if we were tried to, you know, Elon Musk is dreams of colonizing Mars at the moment, so we maybe will have a chance to start a new civilization with a new governmental system."}, {"time": 2498, "text": "And certainly there's quite a bit of chaos."}, {"time": 2501, "text": "We're sitting now, I don't know what the date is, but this is June."}, {"time": 2506, "text": "There's quite a bit of chaos in all different forms going on in the United States and all over the world."}, {"time": 2512, "text": "So there's a hunger for new types of governments, new types of leadership, new types of systems."}, {"time": 2519, "text": "And so what are the forces at play and how do we move forward?"}, {"time": 2524, "text": "Yeah, I mean, colonizing Mars, first of all, it's a super cool thing to do."}, {"time": 2528, "text": "We should be doing it."}, {"time": 2530, "text": "So you love the idea."}, {"time": 2531, "text": "Yeah, I mean, it's more important than making chocolatey or chocolates and sexier lingerie and many of the things that we spend a lot more resources on as a species, right?"}, {"time": 2544, "text": "So I mean, we certainly should do it."}, {"time": 2546, "text": "I think the possible futures in which a Mars colony makes a critical difference for humanity are very few."}, {"time": 2558, "text": "I mean, I think, I mean, assuming we make a Mars colony and people go live there in a couple of decades, I mean, their supplies are gonna come from Earth."}, {"time": 2566, "text": "The money to make the colony came from Earth and whatever powers are supplying the goods there from Earth are gonna, in effect, be in control of that Mars colony."}, {"time": 2578, "text": "Of course, there are outlier situations where Earth gets nuked into oblivion and somehow Mars has been made self sustaining by that point and then Mars is what allows humanity to persist."}, {"time": 2594, "text": "But I think that those are very, very, very unlikely."}, {"time": 2599, "text": "You don't think it could be a first step on a long journey?"}, {"time": 2603, "text": "Of course it's a first step on a long journey, which is awesome."}, {"time": 2607, "text": "I'm guessing the colonization of the rest of the physical universe will probably be done by AGI's that are better designed to live in space than by the meat machines that we are."}, {"time": 2621, "text": "But I mean, who knows?"}, {"time": 2623, "text": "We may cryopreserve ourselves in some superior way to what we know now and like shoot ourselves out to Alpha Centauri and beyond."}, {"time": 2630, "text": "I mean, that's all cool."}, {"time": 2632, "text": "It's very interesting and it's much more valuable than most things that humanity is spending its resources on."}, {"time": 2638, "text": "On the other hand, with AGI, we can get to a singularity before the Mars colony becomes sustaining for sure, possibly before it's even operational."}, {"time": 2650, "text": "So your intuition is that that's the problem if we really invest resources and we can get to faster than a legitimate full self sustaining colonization of Mars."}, {"time": 2659, "text": "Yeah, and it's very clear that we will to me because there's so much economic value in getting from narrow AI toward AGI, whereas the Mars colony, there's less economic value until you get quite far out into the future."}, {"time": 2677, "text": "So I think that's very interesting."}, {"time": 2680, "text": "I just think it's somewhat off to the side."}, {"time": 2684, "text": "I mean, just as I think, say, art and music are very, very interesting and I wanna see resources go into amazing art and music being created."}, {"time": 2695, "text": "And I'd rather see that than a lot of the garbage that the society spends their money on."}, {"time": 2701, "text": "On the other hand, I don't think Mars colonization or inventing amazing new genres of music is not one of the things that is most likely to make a critical difference in the evolution of human or nonhuman life in this part of the universe over the next decade."}, {"time": 2719, "text": "Do you think AGI is really?"}, {"time": 2721, "text": "AGI is by far the most important thing that's on the horizon."}, {"time": 2727, "text": "And then technologies that have direct ability to enable AGI or to accelerate AGI are also very important."}, {"time": 2737, "text": "For example, say, quantum computing."}, {"time": 2740, "text": "I don't think that's critical to achieve AGI, but certainly you could see how the right quantum computing architecture could massively accelerate AGI, similar other types of nanotechnology."}, {"time": 2752, "text": "Right now, the quest to cure aging and end disease while not in the big picture as important as AGI, of course, it's important to all of us as individual humans."}, {"time": 2767, "text": "And if someone made a super longevity pill and distributed it tomorrow, I mean, that would be huge and a much larger impact than a Mars colony is gonna have for quite some time."}, {"time": 2780, "text": "But perhaps not as much as an AGI system."}, {"time": 2783, "text": "No, because if you can make a benevolent AGI, then all the other problems are solved."}, {"time": 2788, "text": "I mean, if then the AGI can be, once it's as generally intelligent as humans, it can rapidly become massively more generally intelligent than humans."}, {"time": 2798, "text": "And then that AGI should be able to solve science and engineering problems much better than human beings, as long as it is in fact motivated to do so."}, {"time": 2809, "text": "That's why I said a benevolent AGI."}, {"time": 2812, "text": "There could be other kinds."}, {"time": 2814, "text": "Maybe it's good to step back a little bit."}, {"time": 2816, "text": "I mean, we've been using the term AGI."}, {"time": 2818, "text": "People often cite you as the creator, or at least the popularizer of the term AGI, artificial general intelligence."}, {"time": 2825, "text": "Can you tell the origin story of the term maybe?"}, {"time": 2829, "text": "So yeah, I would say I launched the term AGI upon the world for what it's worth without ever fully being in love with the term."}, {"time": 2841, "text": "What happened is I was editing a book, and this process started around 2001 or two."}, {"time": 2847, "text": "I think the book came out 2005, finally."}, {"time": 2850, "text": "I was editing a book which I provisionally was titling Real AI."}, {"time": 2855, "text": "And I mean, the goal was to gather together fairly serious academicish papers on the topic of making thinking machines that could really think in the sense like people can, or even more broadly than people can, right?"}, {"time": 2900, "text": "He was one of the cofounders of Google DeepMind."}, {"time": 2902, "text": "But at that time, Shane was, I think he may have just started doing his PhD with Marcus Hooter, who at that time hadn't yet published his book, Universal AI, which sort of gives a mathematical foundation for artificial general intelligence."}, {"time": 2923, "text": "So I reached out to Shane and Marcus and Peter Vos and Pei Wang, who was another former employee of mine who had been Douglas Hofstadter's PhD student who had his own approach to AGI, and a bunch of some Russian folks reached out to these guys and they contributed papers for the book."}, {"time": 2941, "text": "But that was my provisional title, but I never loved it because in the end, I was doing some, what we would now call narrow AI as well, like applying machine learning to genomics data or chat data for sentiment analysis."}, {"time": 2957, "text": "I mean, that work is real."}, {"time": 2959, "text": "And in a sense, it's really AI."}, {"time": 2962, "text": "It's just a different kind of AI."}, {"time": 2966, "text": "Ray Kurzweil wrote about narrow AI versus strong AI, but that seemed weird to me because first of all, narrow and strong are not antennas."}, {"time": 2978, "text": "But secondly, strong AI was used in the cognitive science literature to mean the hypothesis that digital computer AIs could have true consciousness like human beings."}, {"time": 2990, "text": "So there was already a meaning to strong AI, which was complexly different, but related, right?"}, {"time": 2996, "text": "So we were tossing around on an email list whether what title it should be."}, {"time": 3003, "text": "And so we talked about narrow AI, broad AI, wide AI, narrow AI, general AI."}, {"time": 3009, "text": "And I think it was either Shane Legge or Peter Vos on the private email discussion we had."}, {"time": 3018, "text": "He said, but why don't we go with AGI, artificial general intelligence?"}, {"time": 3021, "text": "And Pei Wang wanted to do GAI, general artificial intelligence, because in Chinese it goes in that order."}, {"time": 3027, "text": "But we figured gay wouldn't work in US culture at that time, right?"}, {"time": 3033, "text": "So we went with the AGI."}, {"time": 3037, "text": "We used it for the title of that book."}, {"time": 3039, "text": "And part of Peter and Shane's reasoning was you have the G factor in psychology, which is IQ, general intelligence, right?"}, {"time": 3047, "text": "So you have a meaning of GI, general intelligence, in psychology, so then you're looking like artificial GI."}, {"time": 3055, "text": "So then we use that for the title of the book."}, {"time": 3060, "text": "And so I think maybe both Shane and Peter think they invented the term, but then later after the book was published, this guy, Mark Guberd, came up to me and he's like, well, I published an essay with the term AGI in like 1997 or something."}, {"time": 3077, "text": "And so I'm just waiting for some Russian to come out and say they published that in 1953, right?"}, {"time": 3083, "text": "I mean, that term is not dramatically innovative or anything."}, {"time": 3088, "text": "It's one of these obvious in hindsight things, which is also annoying in a way, because Joshua Bach, who you interviewed, is a close friend of mine."}, {"time": 3100, "text": "He likes the term synthetic intelligence, which I like much better, but it hasn't actually caught on, right?"}, {"time": 3107, "text": "Because I mean, artificial is a bit off to me because artifice is like a tool or something, but not all AGI's are gonna be tools."}, {"time": 3117, "text": "I mean, they may be now, but we're aiming toward making them agents rather than tools."}, {"time": 3122, "text": "And in a way, I don't like the distinction between artificial and natural, because I mean, we're part of nature also and machines are part of nature."}, {"time": 3132, "text": "I mean, you can look at evolved versus engineered, but that's a different distinction."}, {"time": 3137, "text": "Then it should be engineered general intelligence, right?"}, {"time": 3140, "text": "And then general, well, if you look at Marcus Hooter's book, universally, what he argues there is, within the domain of computation theory, which is limited, but interesting."}, {"time": 3151, "text": "So if you assume computable environments or computable reward functions, then he articulates what would be a truly general intelligence, a system called AIXI, which is quite beautiful."}, {"time": 3163, "text": "AIXI, and that's the middle name of my latest child, actually, is it?"}, {"time": 3169, "text": "What's the first name?"}, {"time": 3170, "text": "First name is QORXI, Q O R X I, which my wife came up with, but that's an acronym for quantum organized rational expanding intelligence, and his middle name is Xiphonies, actually, which means the former principal underlying AIXI."}, {"time": 3188, "text": "But in any case."}, {"time": 3189, "text": "You're giving Elon Musk's new child a run for his money."}, {"time": 3192, "text": "Well, I did it first."}, {"time": 3193, "text": "He copied me with this new freakish name, but now if I have another baby, I'm gonna have to outdo him."}, {"time": 3200, "text": "It's becoming an arms race of weird, geeky baby names."}, {"time": 3204, "text": "We'll see what the babies think about it, right?"}, {"time": 3206, "text": "But I mean, my oldest son, Zarathustra, loves his name, and my daughter, Sharazad, loves her name."}, {"time": 3213, "text": "So far, basically, if you give your kids weird names."}, {"time": 3216, "text": "They live up to it."}, {"time": 3217, "text": "Well, you're obliged to make the kids weird enough that they like the names, right?"}, {"time": 3222, "text": "It directs their upbringing in a certain way."}, {"time": 3223, "text": "But yeah, anyway, I mean, what Marcus showed in that book is that a truly general intelligence theoretically is possible, but would take infinite computing power."}, {"time": 3233, "text": "So then the artificial is a little off."}, {"time": 3236, "text": "The general is not really achievable within physics as we know it."}, {"time": 3241, "text": "And I mean, physics as we know it may be limited, but that's what we have to work with now."}, {"time": 3246, "text": "Infinitely general, you mean, like information processing perspective, yeah."}, {"time": 3250, "text": "Yeah, intelligence is not very well defined either, right?"}, {"time": 3254, "text": "I mean, what does it mean?"}, {"time": 3256, "text": "I mean, in AI now, it's fashionable to look at it as maximizing an expected reward over the future."}, {"time": 3263, "text": "But that sort of definition is pathological in various ways."}, {"time": 3267, "text": "And my friend David Weinbaum, AKA Weaver, he had a beautiful PhD thesis on open ended intelligence, trying to conceive intelligence in a..."}, {"time": 3276, "text": "Without a reward."}, {"time": 3278, "text": "Yeah, he's just looking at it differently."}, {"time": 3280, "text": "He's looking at complex self organizing systems and looking at an intelligent system as being one that revises and grows and improves itself in conjunction with its environment without necessarily there being one objective function it's trying to maximize."}, {"time": 3296, "text": "Although over certain intervals of time, it may act as if it's optimizing a certain objective function."}, {"time": 3301, "text": "Very much Solaris from Stanislav Lem's novels, right?"}, {"time": 3304, "text": "So yeah, the point is artificial, general and intelligence."}, {"time": 3307, "text": "Don't work."}, {"time": 3308, "text": "They're all bad."}, {"time": 3309, "text": "On the other hand, everyone knows what AI is."}, {"time": 3312, "text": "And AGI seems immediately comprehensible to people with a technical background."}, {"time": 3317, "text": "So I think that the term has served as sociological function."}, {"time": 3320, "text": "And now it's out there everywhere, which baffles me."}, {"time": 3324, "text": "It's like KFC."}, {"time": 3325, "text": "I mean, that's it."}, {"time": 3327, "text": "We're stuck with AGI probably for a very long time until AGI systems take over and rename themselves."}, {"time": 3334, "text": "And then we'll be biological."}, {"time": 3336, "text": "We're stuck with GPUs too, which mostly have nothing to do with graphics."}, {"time": 3339, "text": "Any more, right?"}, {"time": 3340, "text": "I wonder what the AGI system will call us humans."}, {"time": 3343, "text": "That was maybe."}, {"time": 3344, "text": "Grandpa."}, {"time": 3346, "text": "GPs."}, {"time": 3348, "text": "Grandpa processing unit, yeah."}, {"time": 3350, "text": "Biological grandpa processing units."}, {"time": 3354, "text": "Okay, so maybe also just a comment on AGI representing before even the term existed, representing a kind of community."}, {"time": 3364, "text": "You've talked about this in the past, sort of AI is coming in waves, but there's always been this community of people who dream about creating general human level super intelligence systems."}, {"time": 3379, "text": "Can you maybe give your sense of the history of this community as it exists today, as it existed before this deep learning revolution all throughout the winters and the summers of AI?"}, {"time": 3390, "text": "First, I would say as a side point, the winters and summers of AI are greatly exaggerated by Americans and in that, if you look at the publication record of the artificial intelligence community since say the 1950s, you would find a pretty steady growth in advance of ideas and papers."}, {"time": 3413, "text": "And what's thought of as an AI winter or summer was sort of how much money is the US military pumping into AI, which was meaningful."}, {"time": 3424, "text": "On the other hand, there was AI going on in Germany, UK and in Japan and in Russia, all over the place, while US military got more and less enthused about AI."}, {"time": 3436, "text": "So, I mean."}, {"time": 3437, "text": "That happened to be, just for people who don't know, the US military happened to be the main source of funding for AI research."}, {"time": 3444, "text": "So another way to phrase that is it's up and down of funding for artificial intelligence research."}, {"time": 3451, "text": "And I would say the correlation between funding and intellectual advance was not 100%, right?"}, {"time": 3458, "text": "Because I mean, in Russia, as an example, or in Germany, there was less dollar funding than in the US, but many foundational ideas were laid out, but it was more theory than implementation, right?"}, {"time": 3470, "text": "And US really excelled at sort of breaking through from theoretical papers to working implementations, which did go up and down somewhat with US military funding, but still, I mean, you can look in the 1980s, Dietrich Derner in Germany had self driving cars on the Autobahn, right?"}, {"time": 3491, "text": "And I mean, it was a little early with regard to the car industry, so it didn't catch on such as has happened now."}, {"time": 3500, "text": "But I mean, that whole advancement of self driving car technology in Germany was pretty much independent of AI military summers and winters in the US."}, {"time": 3511, "text": "So there's been more going on in AI globally than not only most people on the planet realize, but then most new AI PhDs realize because they've come up within a certain sub field of AI and haven't had to look so much beyond that."}, {"time": 3527, "text": "But I would say when I got my PhD in 1989 in mathematics, I was interested in AI already."}, {"time": 3536, "text": "In Philadelphia."}, {"time": 3536, "text": "Yeah, I started at NYU, then I transferred to Philadelphia to Temple University, good old North Philly."}, {"time": 3543, "text": "North Philly."}, {"time": 3544, "text": "Yeah, yeah, yeah, the pearl of the US."}, {"time": 3549, "text": "You never stopped at a red light then because you were afraid if you stopped at a red light, someone will carjack you."}, {"time": 3553, "text": "So you just drive through every red light."}, {"time": 3558, "text": "Every day driving or bicycling to Temple from my house was like a new adventure."}, {"time": 3564, "text": "But yeah, the reason I didn't do a PhD in AI was what people were doing in the academic AI field then, was just astoundingly boring and seemed wrong headed to me."}, {"time": 3574, "text": "It was really like rule based expert systems and production systems."}, {"time": 3579, "text": "And actually I loved mathematical logic."}, {"time": 3582, "text": "I had nothing against logic as the cognitive engine for an AI, but the idea that you could type in the knowledge that AI would need to think seemed just completely stupid and wrong headed to me."}, {"time": 3595, "text": "I mean, you can use logic if you want, but somehow the system has got to be..."}, {"time": 3600, "text": "Automated."}, {"time": 3601, "text": "Learning, right?"}, {"time": 3601, "text": "It should be learning from experience."}, {"time": 3603, "text": "And the AI field then was not interested in learning from experience."}, {"time": 3608, "text": "I mean, some researchers certainly were."}, {"time": 3611, "text": "I mean, I remember in mid eighties, I discovered a book by John Andreas, which was, it was about a reinforcement learning system called PURRDASHPUSS, which was an acronym that I can't even remember what it was for, but purpose anyway."}, {"time": 3630, "text": "But he, I mean, that was a system that was supposed to be an AGI and basically by some sort of fancy like Markov decision process learning, it was supposed to learn everything just from the bits coming into it and learn to maximize its reward and become intelligent, right?"}, {"time": 3649, "text": "So that was there in academia back then, but it was like isolated, scattered, weird people."}, {"time": 3655, "text": "But all these isolated, scattered, weird people in that period, I mean, they laid the intellectual grounds for what happened later."}, {"time": 3662, "text": "So you look at John Andreas at University of Canterbury with his PURRDASHPUSS reinforcement learning Markov system."}, {"time": 3669, "text": "He was the PhD supervisor for John Cleary in New Zealand."}, {"time": 3674, "text": "Now, John Cleary worked with me when I was at Waikato University in 1993 in New Zealand."}, {"time": 3681, "text": "And he worked with Ian Whitten there and they launched WEKA, which was the first open source machine learning toolkit, which was launched in, I guess, 93 or 94 when I was at Waikato University."}, {"time": 3695, "text": "Written in Java, unfortunately."}, {"time": 3696, "text": "Written in Java, which was a cool language back then."}, {"time": 3699, "text": "I guess it's still, well, it's not cool anymore, but it's powerful."}, {"time": 3703, "text": "I find, like most programmers now, I find Java unnecessarily bloated, but back then it was like Java or C++ basically."}, {"time": 3712, "text": "And Java was easier for students."}, {"time": 3715, "text": "Amusingly, a lot of the work on WEKA when we were in New Zealand was funded by a US, sorry, a New Zealand government grant to use machine learning to predict the menstrual cycles of cows."}, {"time": 3728, "text": "So in the US, all the grant funding for AI was about how to kill people or spy on people."}, {"time": 3733, "text": "In New Zealand, it's all about cows or kiwi fruits, right?"}, {"time": 3737, "text": "So yeah, anyway, I mean, John Andreas had his probability theory based reinforcement learning, proto AGI."}, {"time": 3745, "text": "John Cleary was trying to do much more ambitious, probabilistic AGI systems."}, {"time": 3751, "text": "Now, John Cleary helped do WEKA, which is the first open source machine learning toolkit."}, {"time": 3759, "text": "So the predecessor for TensorFlow and Torch and all these things."}, {"time": 3763, "text": "Also, Shane Legg was at Waikato working with John Cleary and Ian Witten and this whole group."}, {"time": 3771, "text": "And then working with my own companies, my company, WebMind, an AI company I had in the late 90s with a team there at Waikato University, which is how Shane got his head full of AGI, which led him to go on and with Demis Hassabis found DeepMind."}, {"time": 3788, "text": "So what you can see through that lineage is, you know, in the 80s and 70s, John Andreas was trying to build probabilistic reinforcement learning AGI systems."}, {"time": 3797, "text": "The technology, the computers just weren't there to support his ideas were very similar to what people are doing now."}, {"time": 3803, "text": "But, you know, although he's long since passed away and didn't become that famous outside of Canterbury, I mean, the lineage of ideas passed on from him to his students, to their students, you can go trace directly from there to me and to DeepMind, right?"}, {"time": 3819, "text": "So that there was a lot going on in AGI that did ultimately lay the groundwork for what we have today, but there wasn't a community, right?"}, {"time": 3828, "text": "And so when I started trying to pull together an AGI community, it was in the, I guess, the early aughts when I was living in Washington, D.C. and making a living doing AI consulting for various U.S. government agencies."}, {"time": 3847, "text": "And I organized the first AGI workshop in 2006."}, {"time": 3853, "text": "And I mean, it wasn't like it was literally in my basement or something."}, {"time": 3857, "text": "I mean, it was in the conference room at the Marriott in Bethesda, it's not that edgy or underground, unfortunately, but still."}, {"time": 3865, "text": "How many people attended?"}, {"time": 3865, "text": "About 60 or something."}, {"time": 3867, "text": "That's not bad."}, {"time": 3868, "text": "I mean, D.C. has a lot of AI going on, probably until the last five or 10 years, much more than Silicon Valley, although it's just quiet because of the nature of what happens in D.C. Their business isn't driven by PR."}, {"time": 3883, "text": "Mostly when something starts to work really well, it's taken black and becomes even more quiet, right?"}, {"time": 3889, "text": "But yeah, the thing is that really had the feeling of a group of starry eyed mavericks huddled in a basement, like plotting how to overthrow the narrow AI establishment."}, {"time": 3902, "text": "And for the first time, in some cases, coming together with others who shared their passion for AGI and the technical seriousness about working on it."}, {"time": 3913, "text": "And that's very, very different than what we have today."}, {"time": 3919, "text": "I mean, now it's a little bit different."}, {"time": 3922, "text": "We have AGI conference every year and there's several hundred people rather than 50."}, {"time": 3929, "text": "Now it's more like this is the main gathering of people who want to achieve AGI and think that large scale nonlinear regression is not the golden path to AGI."}, {"time": 3942, "text": "So I mean it's... AKA neural networks."}, {"time": 3944, "text": "Well, certain architectures for learning using neural networks."}, {"time": 3951, "text": "So yeah, the AGI conferences are sort of now the main concentration of people not obsessed with deep neural nets and deep reinforcement learning, but still interested in AGI, not the only ones."}, {"time": 3966, "text": "I mean, there's other little conferences and groupings interested in human level AI and cognitive architectures and so forth."}, {"time": 3976, "text": "But yeah, it's been a big shift."}, {"time": 3977, "text": "Like back then, you couldn't really..."}, {"time": 3981, "text": "It'll be very, very edgy then to give a university department seminar that mentioned AGI or human level AI."}, {"time": 3988, "text": "It was more like you had to talk about something more short term and immediately practical than in the bar after the seminar, you could bullshit about AGI in the same breath as time travel or the simulation hypothesis or something."}, {"time": 4004, "text": "Whereas now, AGI is not only in the academic seminar room, like you have Vladimir Putin knows what AGI is."}, {"time": 4011, "text": "And he's like, Russia needs to become the leader in AGI."}, {"time": 4015, "text": "So national leaders and CEOs of large corporations."}, {"time": 4021, "text": "I mean, the CTO of Intel, Justin Ratner, this was years ago, Singularity Summit Conference, 2008 or something."}, {"time": 4027, "text": "He's like, we believe Ray Kurzweil, the singularity will happen in 2045 and it will have Intel inside."}, {"time": 4033, "text": "So, I mean, it's gone from being something which is the pursuit of like crazed mavericks, crackpots and science fiction fanatics to being a marketing term for large corporations and the national leaders, which is a astounding transition."}, {"time": 4055, "text": "But yeah, in the course of this transition, I think a bunch of sub communities have formed and the community around the AGI conference series is certainly one of them."}, {"time": 4067, "text": "It hasn't grown as big as I might've liked it to."}, {"time": 4071, "text": "On the other hand, sometimes a modest size community can be better for making intellectual progress also."}, {"time": 4079, "text": "Like you go to a society for neuroscience conference, you have 35 or 40,000 neuroscientists."}, {"time": 4085, "text": "On the one hand, it's amazing."}, {"time": 4087, "text": "On the other hand, you're not gonna talk to the leaders of the field there if you're an outsider."}, {"time": 4094, "text": "Yeah, in the same sense, the AAAI, the artificial intelligence, the main kind of generic artificial intelligence conference is too big."}, {"time": 4106, "text": "It's too amorphous."}, {"time": 4108, "text": "Like it doesn't make sense."}, {"time": 4110, "text": "Well, yeah, and NIPS has become a company advertising outlet in the whole of it."}, {"time": 4117, "text": "So, I mean, to comment on the role of AGI in the research community, I'd still, if you look at NeurIPS, if you look at CVPR, if you look at these iClear, AGI is still seen as the outcast."}, {"time": 4131, "text": "I would say in these main machine learning, in these main artificial intelligence conferences amongst the researchers, I don't know if it's an accepted term yet."}, {"time": 4143, "text": "What I've seen bravely, you mentioned Shane Legg's DeepMind and then OpenAI are the two places that are, I would say unapologetically so far, I think it's actually changing unfortunately, but so far they've been pushing the idea that the goal is to create an AGI."}, {"time": 4162, "text": "Well, they have billions of dollars behind them."}, {"time": 4164, "text": "So, I mean, they're in the public mind that certainly carries some oomph, right?"}, {"time": 4170, "text": "I mean, I mean."}, {"time": 4170, "text": "But they also have really strong researchers, right?"}, {"time": 4173, "text": "They do, they're great teams."}, {"time": 4174, "text": "I mean, DeepMind in particular, yeah."}, {"time": 4176, "text": "And they have, I mean, DeepMind has Marcus Hutter walking around."}, {"time": 4180, "text": "I mean, there's all these folks who basically their full time position involves dreaming about creating AGI."}, {"time": 4187, "text": "I mean, Google Brain has a lot of amazing AGI oriented people also."}, {"time": 4193, "text": "And I mean, so I'd say from a public marketing view, DeepMind and OpenAI are the two large well funded organizations that have put the term and concept AGI out there sort of as part of their public image."}, {"time": 4212, "text": "But I mean, they're certainly not, there are other groups that are doing research that seems just as AGI is to me."}, {"time": 4220, "text": "I mean, including a bunch of groups in Google's main Mountain View office."}, {"time": 4226, "text": "So yeah, it's true."}, {"time": 4227, "text": "AGI is somewhat away from the mainstream now."}, {"time": 4233, "text": "But if you compare it to where it was 15 years ago, there's been an amazing mainstreaming."}, {"time": 4241, "text": "You could say the same thing about super longevity research, which is one of my application areas that I'm excited about."}, {"time": 4249, "text": "I mean, I've been talking about this since the 90s, but working on this since 2001."}, {"time": 4254, "text": "And back then, really to say, you're trying to create therapies to allow people to live hundreds of thousands of years, you were way, way, way, way out of the industry, academic mainstream."}, {"time": 4266, "text": "But now, Google had Project Calico, Craig Venter had Human Longevity Incorporated."}, {"time": 4274, "text": "And then once the suits come marching in, right?"}, {"time": 4277, "text": "I mean, once there's big money in it, then people are forced to take it seriously because that's the way modern society works."}, {"time": 4284, "text": "So it's still not as mainstream as cancer research, just as AGI is not as mainstream as automated driving or something."}, {"time": 4292, "text": "But the degree of mainstreaming that's happened in the last 10 to 15 years is astounding to those of us who've been at it for a while."}, {"time": 4302, "text": "Yeah, but there's a marketing aspect to the term, but in terms of actual full force research that's going on under the header of AGI, it's currently, I would say dominated, maybe you can disagree, dominated by neural networks research, that the nonlinear regression, as you mentioned."}, {"time": 4322, "text": "Like what's your sense with OpenCog, with your work, but in general, I was logic based systems and expert systems."}, {"time": 4332, "text": "For me, always seemed to capture a deep element of intelligence that needs to be there."}, {"time": 4341, "text": "Like you said, it needs to learn, it needs to be automated somehow, but that seems to be missing from a lot of research currently."}, {"time": 4354, "text": "I guess one way to ask this question, what's your sense of what kind of things will an AGI system need to have?"}, {"time": 4363, "text": "Yeah, that's a very interesting topic that I've thought about for a long time."}, {"time": 4367, "text": "And I think there are many, many different approaches that can work for getting to human level AI."}, {"time": 4376, "text": "So I don't think there's like one golden algorithm, or one golden design that can work."}, {"time": 4385, "text": "And I mean, flying machines is the much worn analogy here, right?"}, {"time": 4391, "text": "Like, I mean, you have airplanes, you have helicopters, you have balloons, you have stealth bombers that don't look like regular airplanes."}, {"time": 4398, "text": "You've got all blimps."}, {"time": 4401, "text": "Birds too."}, {"time": 4401, "text": "Birds, yeah, and bugs, right?"}, {"time": 4405, "text": "And there are certainly many kinds of flying machines that."}, {"time": 4409, "text": "And there's a catapult that you can just launch."}, {"time": 4412, "text": "And there's bicycle powered like flying machines, right?"}, {"time": 4417, "text": "Yeah, so now these are all analyzable by a basic theory of aerodynamics, right?"}, {"time": 4423, "text": "Now, so one issue with AGI is we don't yet have the analog of the theory of aerodynamics."}, {"time": 4430, "text": "And that's what Marcus Hutter was trying to make with the AXI and his general theory of general intelligence."}, {"time": 4438, "text": "But that theory in its most clearly articulated parts really only works for either infinitely powerful machines or almost, or insanely impractically powerful machines."}, {"time": 4451, "text": "So I mean, if you were gonna take a theory based approach to AGI, what you would do is say, well, let's take what's called say AXE TL, which is Hutter's AXE machine that can work on merely insanely much processing power rather than infinitely much."}, {"time": 4470, "text": "What does TL stand for?"}, {"time": 4472, "text": "Time and length."}, {"time": 4474, "text": "So you're basically how it."}, {"time": 4475, "text": "Like constrained somehow."}, {"time": 4477, "text": "So how AXE works basically is each action that it wants to take, before taking that action, it looks at all its history."}, {"time": 4487, "text": "And then it looks at all possible programs that it could use to make a decision."}, {"time": 4491, "text": "And it decides like which decision program would have let it make the best decisions according to its reward function over its history."}, {"time": 4498, "text": "And it uses that decision program to make the next decision, right?"}, {"time": 4502, "text": "It's not afraid of infinite resources."}, {"time": 4504, "text": "It's searching through the space of all possible computer programs in between each action and each next action."}, {"time": 4510, "text": "Now, AXE TL searches through all possible computer programs that have runtime less than T and length less than L. So it's, which is still an impractically humongous space, right?"}, {"time": 4523, "text": "So what you would like to do to make an AGI and what will probably be done 50 years from now to make an AGI is say, okay, well, we have some constraints."}, {"time": 4534, "text": "We have these processing power constraints and we have the space and time constraints on the program."}, {"time": 4542, "text": "We have energy utilization constraints and we have this particular class environments, class of environments that we care about, which may be say, you know, manipulating physical objects on the surface of the earth, communicating in human language."}, {"time": 4557, "text": "I mean, whatever our particular, not annihilating humanity, whatever our particular requirements happen to be."}, {"time": 4565, "text": "If you formalize those requirements in some formal specification language, you should then be able to run automated program specializer on AXE TL, specialize it to the computing resource constraints and the particular environment and goal."}, {"time": 4583, "text": "And then it will spit out like the specialized version of AXE TL to your resource restrictions and your environment, which will be your AGI, right?"}, {"time": 4592, "text": "And that I think is how our super AGI will create new AGI systems, right?"}, {"time": 4598, "text": "But that's a very rush."}, {"time": 4600, "text": "It seems really inefficient."}, {"time": 4601, "text": "It's a very Russian approach by the way, like the whole field of program specialization came out of Russia."}, {"time": 4607, "text": "Can you backtrack?"}, {"time": 4608, "text": "So what is program specialization?"}, {"time": 4609, "text": "So it's basically... Well, take sorting, for example."}, {"time": 4613, "text": "You can have a generic program for sorting lists, but what if all your lists you care about are length 10,000 or less?"}, {"time": 4620, "text": "You can run an automated program specializer on your sorting algorithm, and it will come up with the algorithm that's optimal for sorting lists of length 1,000 or less, or 10,000 or less, right?"}, {"time": 4629, "text": "That's kind of like, isn't that the kind of the process of evolution as a program specializer to the environment?"}, {"time": 4637, "text": "So you're kind of evolving human beings, or you're living creatures."}, {"time": 4641, "text": "Your Russian heritage is showing there."}, {"time": 4644, "text": "So with Alexander Vityaev and Peter Anokhin and so on, I mean, there's a long history of thinking about evolution that way also, right?"}, {"time": 4656, "text": "So, well, my point is that what we're thinking of as a human level general intelligence, if you start from narrow AIs, like are being used in the commercial AI field now, then you're thinking, okay, how do we make it more and more general?"}, {"time": 4688, "text": "It's like, how do you take these maximally general learning processes and how do you specialize them so that they can operate within the resource constraints that you have, but will achieve the particular things that you care about?"}, {"time": 4704, "text": "Because we humans are not maximally general intelligence."}, {"time": 4708, "text": "If I ask you to run a maze in 750 dimensions, you'd probably be very slow."}, {"time": 4713, "text": "Whereas at two dimensions, you're probably way better, right?"}, {"time": 4717, "text": "So, I mean, we're special because our hippocampus has a two dimensional map in it, right?"}, {"time": 4723, "text": "And it does not have a 750 dimensional map in it."}, {"time": 4726, "text": "So, I mean, we're a peculiar mix of generality and specialization, right?"}, {"time": 4736, "text": "We'll probably start quite general at birth."}, {"time": 4739, "text": "Not obviously still narrow, but like more general than we are at age 20 and 30 and 40 and 50 and 60."}, {"time": 4747, "text": "I don't think that, I think it's more complex than that because I mean, in some sense, a young child is less biased and the brain has yet to sort of crystallize into appropriate structures for processing aspects of the physical and social world."}, {"time": 4765, "text": "On the other hand, the young child is very tied to their sensorium."}, {"time": 4770, "text": "Whereas we can deal with abstract mathematics, like 750 dimensions and the young child cannot because they haven't grown what Piaget called the formal capabilities."}, {"time": 4784, "text": "They haven't learned to abstract yet, right?"}, {"time": 4786, "text": "And the ability to abstract gives you a different kind of generality than what the baby has."}, {"time": 4791, "text": "So, there's both more specialization and more generalization that comes with the development process actually."}, {"time": 4799, "text": "I mean, I guess just the trajectories of the specialization are most controllable at the young age, I guess is one way to put it."}, {"time": 4809, "text": "Do you have kids?"}, {"time": 4811, "text": "They're not as controllable as you think."}, {"time": 4813, "text": "So, you think it's interesting."}, {"time": 4815, "text": "I think, honestly, I think a human adult is much more generally intelligent than a human baby."}, {"time": 4823, "text": "Babies are very stupid, you know what I mean?"}, {"time": 4825, "text": "I mean, they're cute, which is why we put up with their repetitiveness and stupidity."}, {"time": 4833, "text": "And they have what the Zen guys would call a beginner's mind, which is a beautiful thing, but that doesn't necessarily correlate with a high level of intelligence."}, {"time": 4843, "text": "On the plot of cuteness and stupidity, there's a process that allows us to put up with their stupidity as they become more intelligent."}, {"time": 4850, "text": "So, by the time you're an ugly old man like me, you gotta get really, really smart to compensate."}, {"time": 4854, "text": "To compensate, okay, cool."}, {"time": 4856, "text": "But yeah, going back to your original question, so the way I look at human level AGI is how do you specialize, you know, unrealistically inefficient, superhuman, brute force learning processes to the specific goals that humans need to achieve and the specific resources that we have."}, {"time": 4881, "text": "And both of these, the goals and the resources and the environments, I mean, all this is important."}, {"time": 4887, "text": "And on the resources side, it's important that the hardware resources we're bringing to bear are very different than the human brain."}, {"time": 4928, "text": "So I think there's been coevolution of the patterns of organization in the human brain and the physiological particulars of the human brain over time."}, {"time": 4943, "text": "And when you look at neural networks, that is one powerful class of learning algorithms, but it's also a class of learning algorithms that evolve to exploit the particulars of the human brain as a computational substrate."}, {"time": 4956, "text": "If you're looking at the computational substrate of a modern server farm, you won't necessarily want the same algorithms that you want on the human brain."}, {"time": 4965, "text": "And from the right level of abstraction, you could look at maybe the best algorithms on the brain and the best algorithms on a modern computer network as implementing the same abstract learning and representation processes, but finding that level of abstraction is its own AGI research project then, right?"}, {"time": 4984, "text": "So that's about the hardware side and the software side, which follows from that."}, {"time": 5029, "text": "And I'm not sure Yoshua Bengio is really addressing that kind of consciousness."}, {"time": 5035, "text": "He's just using the term."}, {"time": 5036, "text": "I love Yoshua to pieces."}, {"time": 5038, "text": "Like he's by far my favorite of the lines of deep learning."}, {"time": 5043, "text": "He's such a good hearted guy."}, {"time": 5045, "text": "He's a good human being."}, {"time": 5047, "text": "I am not sure he has plumbed to the depths of the philosophy of consciousness."}, {"time": 5053, "text": "No, he's using it as a sexy term."}, {"time": 5055, "text": "So what I called it was the embodied communication prior."}, {"time": 5061, "text": "Can you maybe explain it a little bit?"}, {"time": 5063, "text": "What I meant was, what are we humans evolved for?"}, {"time": 5066, "text": "You can say being human, but that's very abstract, right?"}, {"time": 5069, "text": "I mean, our minds control individual bodies, which are autonomous agents moving around in a world that's composed largely of solid objects, right?"}, {"time": 5081, "text": "And we've also evolved to communicate via language with other solid object agents that are going around doing things collectively with us in a world of solid objects."}, {"time": 5094, "text": "And these things are very obvious, but if you compare them to the scope of all possible intelligences or even all possible intelligences that are physically realizable, that actually constrains things a lot."}, {"time": 5139, "text": "Then starting from that, you're starting to get a requirements analysis for human level general intelligence."}, {"time": 5148, "text": "And then that leads you into cognitive science and you can look at, say, what are the different types of memory that the human mind and brain has?"}, {"time": 5156, "text": "And this has matured over the last decades and I got into this a lot."}, {"time": 5162, "text": "So after getting my PhD in math, I was an academic for eight years."}, {"time": 5166, "text": "I was in departments of mathematics, computer science, and psychology."}, {"time": 5171, "text": "When I was in the psychology department at the University of Western Australia, I was focused on cognitive science of memory and perception."}, {"time": 5178, "text": "Actually, I was teaching neural nets and deep neural nets and it was multi layer perceptrons, right?"}, {"time": 5183, "text": "Psychology?"}, {"time": 5185, "text": "Cognitive science, it was cross disciplinary among engineering, math, psychology, philosophy, linguistics, computer science."}, {"time": 5193, "text": "But yeah, we were teaching psychology students to try to model the data from human cognition experiments using multi layer perceptrons, which was the early version of a deep neural network."}, {"time": 5205, "text": "Very, very, yeah, recurrent back prop was very, very slow to train back then, right?"}, {"time": 5211, "text": "So this is the study of these constraint systems that are supposed to deal with physical objects."}, {"time": 5215, "text": "So if you look at cognitive psychology, you can see there's multiple types of memory, which are to some extent represented by different subsystems in the human brain."}, {"time": 5228, "text": "So we have episodic memory, which takes into account our life history and everything that's happened to us."}, {"time": 5235, "text": "We have declarative or semantic memory, which is like facts and beliefs abstracted from the particular situations that they occurred in."}, {"time": 5242, "text": "There's sensory memory, which to some extent is sense modality specific, and then to some extent is unified across sense modalities."}, {"time": 5253, "text": "There's procedural memory, memory of how to do stuff, like how to swing the tennis racket, right?"}, {"time": 5258, "text": "Which is, there's motor memory, but it's also a little more abstract than motor memory."}, {"time": 5263, "text": "It involves cerebellum and cortex working together."}, {"time": 5267, "text": "Then there's memory linkage with emotion which has to do with linkages of cortex and limbic system."}, {"time": 5275, "text": "There's specifics of spatial and temporal modeling connected with memory, which has to do with hippocampus and thalamus connecting to cortex."}, {"time": 5285, "text": "And the basal ganglia, which influences goals."}, {"time": 5288, "text": "So we have specific memory of what goals, subgoals and sub subgoals we want to perceive in which context in the past."}, {"time": 5295, "text": "Human brain has substantially different subsystems for these different types of memory and substantially differently tuned learning, like differently tuned modes of longterm potentiation to do with the types of neurons and neurotransmitters in the different parts of the brain corresponding to these different types of knowledge."}, {"time": 5313, "text": "And these different types of memory and learning in the human brain, I mean, you can back these all into embodied communication for controlling agents in worlds of solid objects."}, {"time": 5324, "text": "Now, so if you look at building an AGI system, one way to do it, which starts more from cognitive science than neuroscience is to say, okay, what are the types of memory that are necessary for this kind of world?"}, {"time": 5337, "text": "Yeah, yeah, necessary for this sort of intelligence."}, {"time": 5340, "text": "What types of learning work well with these different types of memory?"}, {"time": 5344, "text": "And then how do you connect all these things together, right?"}, {"time": 5371, "text": "So they all grew up communicating and adapting to each other."}, {"time": 5374, "text": "It's not like they were separate black boxes that were then glommed together, right?"}, {"time": 5380, "text": "Whereas as engineers, we would tend to say, let's make the declarative memory box here and the procedural memory box here and the perception box here and wire them together."}, {"time": 5391, "text": "And when you can do that, it's interesting."}, {"time": 5394, "text": "I mean, that's how a car is built, right?"}, {"time": 5395, "text": "But on the other hand, that's clearly not how biological systems are made."}, {"time": 5401, "text": "The parts co evolve so as to adapt and work together."}, {"time": 5405, "text": "That's by the way, how every human engineered system that flies, that was, we were using that analogy before it's built as well."}, {"time": 5413, "text": "So do you find this at all appealing?"}, {"time": 5414, "text": "Like there's been a lot of really exciting, which I find strange that it's ignored work in cognitive architectures, for example, throughout the last few decades."}, {"time": 5423, "text": "Do you find that?"}, {"time": 5424, "text": "Yeah, I mean, I had a lot to do with that community and you know, Paul Rosenbloom, who was one of the, and John Laird who built the SOAR architecture, are friends of mine."}, {"time": 5434, "text": "And I learned SOAR quite well and ACTAR and these different cognitive architectures."}, {"time": 5439, "text": "And how I was looking at the AI world about 10 years ago before this whole commercial deep learning explosion was, on the one hand, you had these cognitive architecture guys who were working closely with psychologists and cognitive scientists who had thought a lot about how the different parts of a human like mind should work together."}, {"time": 5460, "text": "On the other hand, you had these learning theory guys who didn't care at all about the architecture, but we're just thinking about like, how do you recognize patterns in large amounts of data?"}, {"time": 5470, "text": "And in some sense, what you needed to do was to get the learning that the learning theory guys were doing and put it together with the architecture that the cognitive architecture guys were doing."}, {"time": 5484, "text": "And then you would have what you needed."}, {"time": 5485, "text": "Now, you can't, unfortunately, when you look at the details, you can't just do that without totally rebuilding what is happening on both the cognitive architecture and the learning side."}, {"time": 5498, "text": "So, I mean, they tried to do that in SOAR, but what they ultimately did is like, take a deep neural net or something for perception and you include it as one of the black boxes."}, {"time": 5510, "text": "It becomes one of the boxes."}, {"time": 5511, "text": "The learning mechanism becomes one of the boxes as opposed to fundamental part of the system."}, {"time": 5517, "text": "You could look at some of the stuff DeepMind has done, like the differential neural computer or something that sort of has a neural net for deep learning perception."}, {"time": 5527, "text": "It has another neural net, which is like a memory matrix that stores, say, the map of the London subway or something."}, {"time": 5533, "text": "So probably Demis Tsabas was thinking about this like part of cortex and part of hippocampus because hippocampus has a spatial map."}, {"time": 5540, "text": "And when he was a neuroscientist, he was doing a bunch on cortex hippocampus interconnection."}, {"time": 5544, "text": "So there, the DNC would be an example of folks from the deep neural net world trying to take a step in the cognitive architecture direction by having two neural modules that correspond roughly to two different parts of the human brain that deal with different kinds of memory and learning."}, {"time": 5558, "text": "But on the other hand, it's super, super, super crude from the cognitive architecture view, right?"}, {"time": 5564, "text": "Just as what John Laird and Soar did with neural nets was super, super crude from a learning point of view because the learning was like off to the side, not affecting the core representations, right?"}, {"time": 5575, "text": "I mean, you weren't learning the representation."}, {"time": 5577, "text": "You were learning the data that feeds into the... You were learning abstractions of perceptual data to feed into the representation that was not learned, right?"}, {"time": 5586, "text": "So yeah, this was clear to me a while ago."}, {"time": 5591, "text": "And one of my hopes with the AGI community was to sort of bring people from those two directions together."}, {"time": 5599, "text": "That didn't happen much in terms of... Not yet."}, {"time": 5602, "text": "And what I was gonna say is it didn't happen in terms of bringing like the lions of cognitive architecture together with the lions of deep learning."}, {"time": 5610, "text": "It did work in the sense that a bunch of younger researchers have had their heads filled with both of those ideas."}, {"time": 5615, "text": "This comes back to a saying my dad, who was a university professor, often quoted to me, which was, science advances one funeral at a time, which I'm trying to avoid."}, {"time": 5627, "text": "Like I'm 53 years old and I'm trying to invent amazing, weird ass new things that nobody ever thought about, which we'll talk about in a few minutes."}, {"time": 5639, "text": "But there is that aspect, right?"}, {"time": 5642, "text": "Like the people who've been at AI a long time and have made their career developing one aspect, like a cognitive architecture or a deep learning approach, it can be hard once you're old and have made your career doing one thing, it can be hard to mentally shift gears."}, {"time": 5659, "text": "I mean, I try quite hard to remain flexible minded."}, {"time": 5663, "text": "Have you been successful somewhat in changing, maybe, have you changed your mind on some aspects of what it takes to build an AGI, like technical things?"}, {"time": 5672, "text": "The hard part is that the world doesn't want you to."}, {"time": 5676, "text": "The world or your own brain?"}, {"time": 5677, "text": "The world, well, that one point is that your brain doesn't want to."}, {"time": 5681, "text": "The other part is that the world doesn't want you to."}, {"time": 5683, "text": "Like the people who have followed your ideas get mad at you if you change your mind."}, {"time": 5689, "text": "And the media wants to pigeonhole you as an avatar of a certain idea."}, {"time": 5697, "text": "But yeah, I've changed my mind on a bunch of things."}, {"time": 5701, "text": "I mean, when I started my career, I really thought quantum computing would be necessary for AGI."}, {"time": 5707, "text": "And I doubt it's necessary now, although I think it will be a super major enhancement."}, {"time": 5714, "text": "But I mean, I'm now in the middle of embarking on the complete rethink and rewrite from scratch of our OpenCog AGI system together with Alexey Potapov and his team in St. Petersburg, who's working with me in SingularityNet."}, {"time": 5731, "text": "So now we're trying to like go back to basics, take everything we learned from working with the current OpenCog system, take everything everybody else has learned from working with their proto AGI systems and design the best framework for the next stage."}, {"time": 5750, "text": "And I do think there's a lot to be learned from the recent successes with deep neural nets and deep reinforcement systems."}, {"time": 5759, "text": "I mean, people made these essentially trivial systems work much better than I thought they would."}, {"time": 5764, "text": "And there's a lot to be learned from that."}, {"time": 5767, "text": "And I wanna incorporate that knowledge appropriately in our OpenCog 2.0 system."}, {"time": 5773, "text": "On the other hand, I also think current deep neural net architectures as such will never get you anywhere near AGI."}, {"time": 5782, "text": "So I think you wanna avoid the pathology of throwing the baby out with the bathwater and like saying, well, these things are garbage because foolish journalists overblow them as being the path to AGI and a few researchers overblow them as well."}, {"time": 5801, "text": "There's a lot of interesting stuff to be learned there even though those are not the golden path."}, {"time": 5808, "text": "So maybe this is a good chance to step back."}, {"time": 5810, "text": "You mentioned OpenCog 2.0, but... Go back to OpenCog 0.0, which exists now."}, {"time": 5816, "text": "Alpha, yeah."}, {"time": 5818, "text": "Yeah, maybe talk through the history of OpenCog and your thinking about these ideas."}, {"time": 5823, "text": "I would say OpenCog 2.0 is a term we're throwing around sort of tongue in cheek because the existing OpenCog system that we're working on now is not remotely close to what we'd consider a 1.0, right?"}, {"time": 5840, "text": "I mean, it's an early..."}, {"time": 5843, "text": "It's been around, what, 13 years or something, but it's still an early stage research system, right?"}, {"time": 5849, "text": "And actually, we are going back to the beginning in terms of theory and implementation because we feel like that's the right thing to do, but I'm sure what we end up with is gonna have a huge amount in common with the current system."}, {"time": 5868, "text": "I mean, we all still like the general approach."}, {"time": 5871, "text": "So first of all, what is OpenCog?"}, {"time": 5874, "text": "Sure, OpenCog is an open source software project that I launched together with several others in 2008 and probably the first code written toward that was written in 2001 or two or something that was developed as a proprietary code base within my AI company, Novamente LLC."}, {"time": 5898, "text": "Then we decided to open source it in 2008, cleaned up the code throughout some things and added some new things and... What language is it written in?"}, {"time": 5908, "text": "It's C++."}, {"time": 5909, "text": "Primarily, there's a bunch of scheme as well, but most of it's C++."}, {"time": 5913, "text": "And it's separate from something we'll also talk about, the SingularityNet."}, {"time": 5917, "text": "So it was born as a non networked thing."}, {"time": 5922, "text": "Well, there are many levels of networks involved here."}, {"time": 5927, "text": "No connectivity to the internet, or no, at birth."}, {"time": 5932, "text": "Yeah, I mean, SingularityNet is a separate project and a separate body of code."}, {"time": 5939, "text": "And you can use SingularityNet as part of the infrastructure for a distributed OpenCog system, but there are different layers."}, {"time": 5947, "text": "Yeah, got it."}, {"time": 5948, "text": "So OpenCog on the one hand as a software framework could be used to implement a variety of different AI architectures and algorithms, but in practice, there's been a group of developers which I've been leading together with Linus Vepstas, Neil Geisweiler, and a few others, which have been using the OpenCog platform and infrastructure to implement certain ideas about how to make an AGI."}, {"time": 5981, "text": "So there's been a little bit of ambiguity about OpenCog, the software platform versus OpenCog, the AGI design, because in theory, you could use that software to do, you could use it to make a neural net."}, {"time": 5993, "text": "You could use it to make a lot of different AGI."}, {"time": 5995, "text": "What kind of stuff does the software platform provide, like in terms of utilities, tools, like what?"}, {"time": 6000, "text": "Yeah, let me first tell about OpenCog as a software platform, and then I'll tell you the specific AGI R&D we've been building on top of it."}, {"time": 6012, "text": "So the core component of OpenCog as a software platform is what we call the atom space, which is a weighted labeled hypergraph."}, {"time": 6021, "text": "ATOM, atom space."}, {"time": 6022, "text": "Atom space, yeah, yeah, not atom, like Adam and Eve, although that would be cool too."}, {"time": 6028, "text": "Yeah, so you have a hypergraph, which is like, so a graph in this sense is a bunch of nodes with links between them."}, {"time": 6037, "text": "A hypergraph is like a graph, but links can go between more than two nodes."}, {"time": 6043, "text": "So you have a link between three nodes."}, {"time": 6045, "text": "And in fact, OpenCog's atom space would properly be called a metagraph because you can have links pointing to links, or you could have links pointing to whole subgraphs, right?"}, {"time": 6056, "text": "So it's an extended hypergraph or a metagraph."}, {"time": 6060, "text": "Is metagraph a technical term?"}, {"time": 6062, "text": "It is now a technical term."}, {"time": 6064, "text": "But I don't think it was yet a technical term when we started calling this a generalized hypergraph."}, {"time": 6070, "text": "But in any case, it's a weighted labeled generalized hypergraph or weighted labeled metagraph."}, {"time": 6076, "text": "The weights and labels mean that the nodes and links can have numbers and symbols attached to them."}, {"time": 6082, "text": "So they can have types on them."}, {"time": 6084, "text": "They can have numbers on them that represent, say, a truth value or an importance value for a certain purpose."}, {"time": 6092, "text": "And of course, like with all things, you can reduce that to a hypergraph, and then the hypergraph can be reduced to a graph."}, {"time": 6095, "text": "You can reduce hypergraph to a graph, and you could reduce a graph to an adjacency matrix."}, {"time": 6099, "text": "So, I mean, there's always multiple representations."}, {"time": 6102, "text": "But there's a layer of representation that seems to work well here."}, {"time": 6106, "text": "And so similarly, you could have a link to a whole graph because a whole graph could represent, say, a body of information."}, {"time": 6114, "text": "And I could say, I reject this body of information."}, {"time": 6118, "text": "Then one way to do that is make that link go to that whole subgraph representing the body of information, right?"}, {"time": 6124, "text": "I mean, there are many alternate representations, but that's, anyway, what we have in OpenCOG, we have an atom space, which is this weighted, labeled, generalized hypergraph."}, {"time": 6135, "text": "Knowledge store, it lives in RAM."}, {"time": 6137, "text": "There's also a way to back it up to disk."}, {"time": 6140, "text": "There are ways to spread it among multiple different machines."}, {"time": 6144, "text": "Then there are various utilities for dealing with that."}, {"time": 6147, "text": "So there's a pattern matcher, which lets you specify a sort of abstract pattern and then search through a whole atom space with labeled hypergraph to see what subhypergraphs may match that pattern, for an example."}, {"time": 6162, "text": "So that's, then there's something called the COG server in OpenCOG, which lets you run a bunch of different agents or processes in a scheduler."}, {"time": 6175, "text": "And each of these agents, basically it reads stuff from the atom space and it writes stuff to the atom space."}, {"time": 6181, "text": "So this is sort of the basic operational model."}, {"time": 6185, "text": "That's the software framework."}, {"time": 6187, "text": "And of course that's, there's a lot there just from a scalable software engineering standpoint."}, {"time": 6193, "text": "So you could use this, I don't know if you've, have you looked into the Stephen Wolfram's physics project recently with the hypergraphs and stuff?"}, {"time": 6200, "text": "Could you theoretically use like the software framework to play with it?"}, {"time": 6202, "text": "You certainly could, although Wolfram would rather die than use anything but Mathematica for his work."}, {"time": 6209, "text": "Well that's, yeah, but there's a big community of people who are, you know, would love integration."}, {"time": 6216, "text": "Like you said, the young minds love the idea of integrating, of connecting things."}, {"time": 6221, "text": "And I would add on that note, the idea of using hypergraph type models in physics is not very new."}, {"time": 6227, "text": "Like if you look at..."}, {"time": 6229, "text": "The Russians did it first."}, {"time": 6230, "text": "Well, I'm sure they did."}, {"time": 6232, "text": "And a guy named Ben Dribis, who's a mathematician, a professor in Louisiana or somewhere, had a beautiful book on quantum sets and hypergraphs and algebraic topology for discrete models of physics."}, {"time": 6245, "text": "And carried it much farther than Wolfram has, but he's not rich and famous, so it didn't get in the headlines."}, {"time": 6253, "text": "But yeah, Wolfram aside, yeah, certainly that's a good way to put it."}, {"time": 6257, "text": "The whole OpenCog framework, you could use it to model biological networks and simulate biology processes."}, {"time": 6264, "text": "You could use it to model physics on discrete graph models of physics."}, {"time": 6270, "text": "So you could use it to do, say, biologically realistic neural networks, for example."}, {"time": 6279, "text": "And that's a framework."}, {"time": 6282, "text": "What do agents and processes do?"}, {"time": 6284, "text": "Do they grow the graph?"}, {"time": 6285, "text": "What kind of computations, just to get a sense, are they supposed to do?"}, {"time": 6289, "text": "So in theory, they could do anything they want to do."}, {"time": 6291, "text": "They're just C++ processes."}, {"time": 6293, "text": "On the other hand, the computation framework is sort of designed for agents where most of their processing time is taken up with reads and writes to the atom space."}, {"time": 6305, "text": "And so that's a very different processing model than, say, the matrix multiplication based model as underlies most deep learning systems, right?"}, {"time": 6315, "text": "So you could create an agent that just factored numbers for a billion years."}, {"time": 6322, "text": "It would run within the OpenCog platform, but it would be pointless, right?"}, {"time": 6326, "text": "I mean, the point of doing OpenCog is because you want to make agents that are cooperating via reading and writing into this weighted labeled hypergraph, right?"}, {"time": 6336, "text": "And that has both cognitive architecture importance because then this hypergraph is being used as a sort of shared memory among different cognitive processes, but it also has software and hardware implementation implications because current GPU architectures are not so useful for OpenCog, whereas a graph chip would be incredibly useful, right?"}, {"time": 6361, "text": "And I think Graphcore has those now, but they're not ideally suited for this."}, {"time": 6365, "text": "But I think in the next, let's say, three to five years, we're gonna see new chips where like a graph is put on the chip and the back and forth between multiple processes acting SIMD and MIMD on that graph is gonna be fast."}, {"time": 6383, "text": "And then that may do for OpenCog type architectures what GPUs did for deep neural architecture."}, {"time": 6389, "text": "It's a small tangent."}, {"time": 6391, "text": "Can you comment on thoughts about neuromorphic computing?"}, {"time": 6394, "text": "So like hardware implementations of all these different kind of, are you interested?"}, {"time": 6399, "text": "Are you excited by that possibility?"}, {"time": 6401, "text": "I'm excited by graph processors because I think they can massively speed up OpenCog, which is a class of architectures that I'm working on."}, {"time": 6410, "text": "I think if, you know, in principle, neuromorphic computing should be amazing."}, {"time": 6418, "text": "I haven't yet been fully sold on any of the systems that are out."}, {"time": 6423, "text": "They're like, memristors should be amazing too, right?"}, {"time": 6426, "text": "So a lot of these things have obvious potential, but I haven't yet put my hands on a system that seemed to manifest that."}, {"time": 6433, "text": "Mark's system should be amazing, but the current systems have not been great."}, {"time": 6471, "text": "Now, what's been done so far is not like that."}, {"time": 6474, "text": "So I guess personally, as a researcher, I mean, I've done a bunch of work in computational neuroscience where I did some work with IARPA in DC, Intelligence Advanced Research Project Agency."}, {"time": 6488, "text": "We were looking at how do you make a biologically realistic simulation of seven different parts of the brain cooperating with each other, using like realistic nonlinear dynamical models of neurons, and how do you get that to simulate what's going on in the mind of a geo intelligence analyst while they're trying to find terrorists on a map, right?"}, {"time": 6507, "text": "So if you want to do something like that, having neuromorphic hardware that really let you simulate like a realistic model of the neuron would be amazing."}, {"time": 6518, "text": "But that's sort of with my computational neuroscience hat on, right?"}, {"time": 6523, "text": "With an AGI hat on, I'm just more interested in these hypergraph knowledge representation based architectures, which would benefit more from various types of graph processors because the main processing bottleneck is reading writing to RAM."}, {"time": 6542, "text": "It's reading writing to the graph in RAM."}, {"time": 6543, "text": "The main processing bottleneck for this kind of proto AGI architecture is not multiplying matrices."}, {"time": 6549, "text": "And for that reason, GPUs, which are really good at multiplying matrices, don't apply as well."}, {"time": 6557, "text": "There are frameworks like Gunrock and others that try to boil down graph processing to matrix operations, and they're cool, but you're still putting a square peg into a round hole in a certain way."}, {"time": 6568, "text": "The same is true, I mean, current quantum machine learning, which is very cool."}, {"time": 6574, "text": "It's also all about how to get matrix and vector operations in quantum mechanics, and I see why that's natural to do."}, {"time": 6581, "text": "I mean, quantum mechanics is all unitary matrices and vectors, right?"}, {"time": 6585, "text": "On the other hand, you could also try to make graph centric quantum computers, which I think is where things will go."}, {"time": 6594, "text": "And then we can have, then we can make, like take the open cog implementation layer, implement it in a collapsed state inside a quantum computer."}, {"time": 6604, "text": "But that may be the singularity squared, right?"}, {"time": 6606, "text": "I'm not sure we need that to get to human level."}, {"time": 6612, "text": "That's already beyond the first singularity."}, {"time": 6614, "text": "But can we just go back to open cog?"}, {"time": 6617, "text": "Yeah, and the hypergraph and open cog."}, {"time": 6620, "text": "That's the software framework, right?"}, {"time": 6621, "text": "So the next thing is our cognitive architecture tells us particular algorithms to put there."}, {"time": 6628, "text": "Can we backtrack on the kind of, is this graph designed, is it in general supposed to be sparse and the operations constantly grow and change the graph?"}, {"time": 6640, "text": "Yeah, the graph is sparse."}, {"time": 6642, "text": "But is it constantly adding links and so on?"}, {"time": 6645, "text": "It is a self modifying hypergraph."}, {"time": 6647, "text": "So it's not, so the write and read operations you're referring to, this isn't just a fixed graph to which you change the way, it's a constantly growing graph."}, {"time": 6658, "text": "So it is different model than, say current deep neural nets and have a fixed neural architecture and you're updating the weights."}, {"time": 6668, "text": "Although there have been like cascade correlational neural net architectures that grow new nodes and links, but the most common neural architectures now have a fixed neural architecture, you're updating the weights."}, {"time": 6679, "text": "And then open cog, you can update the weights and that certainly happens a lot, but adding new nodes, adding new links, removing nodes and links is an equally critical part of the system's operations."}, {"time": 6693, "text": "So now when you start to add these cognitive algorithms on top of this open cog architecture, what does that look like?"}, {"time": 6701, "text": "Yeah, so within this framework then, creating a cognitive architecture is basically two things."}, {"time": 6708, "text": "It's choosing what type system you wanna put on the nodes and links in the hypergraph, what types of nodes and links you want."}, {"time": 6716, "text": "And then it's choosing what collection of agents, what collection of AI algorithms or processes are gonna run to operate on this hypergraph."}, {"time": 6728, "text": "And of course those two decisions are closely connected to each other."}, {"time": 6733, "text": "So in terms of the type system, there are some links that are more neural net like, they're just like have weights to get updated by heavy and learning and activation spreads along them."}, {"time": 6746, "text": "There are other links that are more logic like and nodes that are more logic like."}, {"time": 6750, "text": "So you could have a variable node and you can have a node representing a universal or existential quantifier as in predicate logic or term logic."}, {"time": 6759, "text": "So you can have logic like nodes and links, or you can have neural like nodes and links."}, {"time": 6764, "text": "You can also have procedure like nodes and links as in say a combinatorial logic or Lambda calculus representing programs."}, {"time": 6773, "text": "So you can have nodes and links representing many different types of semantics, which means you could make a horrible ugly mess or you could make a system where these different types of knowledge all interpenetrate and synergize with each other beautifully, right?"}, {"time": 6788, "text": "So the hypergraph can contain programs."}, {"time": 6792, "text": "Yeah, it can contain programs, although in the current version, it is a very inefficient way to guide the execution of programs, which is one thing that we are aiming to resolve with our rewrite of the system now."}, {"time": 6807, "text": "So what to you is the most beautiful aspect of OpenCog?"}, {"time": 6812, "text": "Just to you personally, some aspect that captivates your imagination from beauty or power?"}, {"time": 6822, "text": "What fascinates me is finding a common representation that underlies abstract, declarative knowledge and sensory knowledge and movement knowledge and procedural knowledge and episodic knowledge, finding the right level of representation where all these types of knowledge are stored in a sort of universal and interconvertible yet practically manipulable way, right?"}, {"time": 6853, "text": "So to me, that's the core, because once you've done that, then the different learning algorithms can help each other out."}, {"time": 6902, "text": "But that can only be done if the intermediate state of a logic engine, the evolutionary learning engine, and a deep neural net are represented in the same form."}, {"time": 6911, "text": "And that's what we figured out how to do by putting the right type system on top of this weighted labeled hypergraph."}, {"time": 6917, "text": "So is there, can you maybe elaborate on what are the different characteristics of a type system that can coexist amongst all these different kinds of knowledge that needs to be represented?"}, {"time": 6930, "text": "And is, I mean, like, is it hierarchical?"}, {"time": 6934, "text": "Just any kind of insights you can give on that kind of type system?"}, {"time": 6937, "text": "Yeah, yeah, so this gets very nitty gritty and mathematical, of course, but one key part is switching from predicate logic to term logic."}, {"time": 6950, "text": "What is predicate logic?"}, {"time": 6951, "text": "What is term logic?"}, {"time": 6953, "text": "So term logic was invented by Aristotle, or at least that's the oldest recollection we have of it."}, {"time": 6961, "text": "But term logic breaks down basic logic into basically simple links between nodes, like an inheritance link between node A and node B."}, {"time": 6972, "text": "So in term logic, the basic deduction operation is A implies B, B implies C, therefore A implies C. Whereas in predicate logic, the basic operation is modus ponens, like A implies B, therefore B."}, {"time": 6987, "text": "So it's a slightly different way of breaking down logic, but by breaking down logic into term logic, you get a nice way of breaking logic down into nodes and links."}, {"time": 7000, "text": "So your concepts can become nodes, the logical relations become links."}, {"time": 7005, "text": "And so then inference is like, so if this link is A implies B, this link is B implies C, then deduction builds a link A implies C. And your probabilistic algorithm can assign a certain weight there."}, {"time": 7017, "text": "Now, you may also have like a Hebbian neural link from A to C, which is the degree to which thinking, the degree to which A being the focus of attention should make B the focus of attention, right?"}, {"time": 7029, "text": "So you could have then a neural link and you could have a symbolic, like logical inheritance link in your term logic."}, {"time": 7037, "text": "And they have separate meaning, but they could be used to guide each other as well."}, {"time": 7042, "text": "Like if there's a large amount of neural weight on the link between A and B, that may direct your logic engine to think about, well, what is the relation?"}, {"time": 7051, "text": "Are they similar?"}, {"time": 7052, "text": "Is there an inheritance relation?"}, {"time": 7053, "text": "Are they similar in some context?"}, {"time": 7057, "text": "On the other hand, if there's a logical relation between A and B, that may direct your neural component to think, well, when I'm thinking about A, should I be directing some attention to B also?"}, {"time": 7068, "text": "Because there's a logical relation."}, {"time": 7070, "text": "So in terms of logic, there's a lot of thought that went into how do you break down logic relations, including basic sort of propositional logic relations as Aristotelian term logic deals with, and then quantifier logic relations also."}, {"time": 7087, "text": "How do you break those down elegantly into a hypergraph?"}, {"time": 7090, "text": "Because you, I mean, you can boil logic expression into a graph in many different ways."}, {"time": 7094, "text": "Many of them are very ugly, right?"}, {"time": 7096, "text": "We tried to find elegant ways of sort of hierarchically breaking down complex logic expression into nodes and links."}, {"time": 7106, "text": "So that if you have say different nodes representing, Ben, AI, Lex, interview or whatever, the logic relations between those things are compact in the node and link representation."}, {"time": 7120, "text": "So that when you have a neural net acting on the same nodes and links, the neural net and the logic engine can sort of interoperate with each other."}, {"time": 7128, "text": "And also interpretable by humans."}, {"time": 7129, "text": "Is that an important?"}, {"time": 7131, "text": "That's tough."}, {"time": 7132, "text": "Yeah, in simple cases, it's interpretable by humans."}, {"time": 7134, "text": "But honestly, I would say logic systems I would say logic systems give more potential for transparency and comprehensibility than neural net systems, but you still have to work at it."}, {"time": 7152, "text": "Because I mean, if I show you a predicate logic proposition with like 500 nested universal and existential quantifiers and 217 variables, that's no more comprehensible than the weight metrics of a neural network, right?"}, {"time": 7166, "text": "So I'd say the logic expressions that AI learns from its experience are mostly totally opaque to human beings and maybe even harder to understand than neural net."}, {"time": 7176, "text": "Because I mean, when you have multiple nested quantifier bindings, it's a very high level of abstraction."}, {"time": 7181, "text": "There is a difference though, in that within logic, it's a little more straightforward to pose the problem of like normalize this and boil this down to a certain form."}, {"time": 7191, "text": "I mean, you can do that in neural nets too."}, {"time": 7192, "text": "Like you can distill a neural net to a simpler form, but that's more often done to make a neural net that'll run on an embedded device or something."}, {"time": 7199, "text": "It's harder to distill a net to a comprehensible form than it is to simplify a logic expression to a comprehensible form, but it doesn't come for free."}, {"time": 7208, "text": "Like what's in the AI's mind is incomprehensible to a human unless you do some special work to make it comprehensible."}, {"time": 7216, "text": "So on the procedural side, there's some different and sort of interesting voodoo there."}, {"time": 7223, "text": "I mean, if you're familiar in computer science, there's something called the Curry Howard correspondence, which is a one to one mapping between proofs and programs."}, {"time": 7230, "text": "So every program can be mapped into a proof."}, {"time": 7233, "text": "Every proof can be mapped into a program."}, {"time": 7235, "text": "You can model this using category theory and a bunch of nice math, but we wanna make that practical, right?"}, {"time": 7243, "text": "So that if you have an executable program that like moves the robot's arm or figures out in what order to say things in a dialogue, that's a procedure represented in OpenCog's hypergraph."}, {"time": 7255, "text": "But if you wanna reason on how to improve that procedure, you need to map that procedure into logic using Curry Howard isomorphism."}, {"time": 7265, "text": "So then the logic engine can reason about how to improve that procedure and then map that back into the procedural representation that is efficient for execution."}, {"time": 7276, "text": "So again, that comes down to not just can you make your procedure into a bunch of nodes and links?"}, {"time": 7281, "text": "Cause I mean, that can be done trivially."}, {"time": 7283, "text": "A C++ compiler has nodes and links inside it."}, {"time": 7286, "text": "Can you boil down your procedure into a bunch of nodes and links in a way that's like hierarchically decomposed and simple enough?"}, {"time": 7293, "text": "It can reason about."}, {"time": 7294, "text": "Yeah, yeah, that given the resource constraints at hand, you can map it back and forth to your term logic, like fast enough and without having a bloated logic expression, right?"}, {"time": 7305, "text": "So there's just a lot of, there's a lot of nitty gritty particulars there, but by the same token, if you ask a chip designer, like how do you make the Intel I7 chip so good?"}, {"time": 7318, "text": "There's a long list of technical answers there, which will take a while to go through, right?"}, {"time": 7324, "text": "And this has been decades of work."}, {"time": 7326, "text": "I mean, the first AI system of this nature I tried to build was called WebMind in the mid 1990s."}, {"time": 7333, "text": "And we had a big graph, a big graph operating in RAM implemented with Java 1.1, which was a terrible, terrible implementation idea."}, {"time": 7341, "text": "And then each node had its own processing."}, {"time": 7345, "text": "So like that there, the core loop looped through all nodes in the network and let each node enact what its little thing was doing."}, {"time": 7352, "text": "And we had logic and neural nets in there, but an evolutionary learning, but we hadn't done enough of the math to get them to operate together very cleanly."}, {"time": 7363, "text": "So it was really, it was quite a horrible mess."}, {"time": 7366, "text": "So as well as shifting an implementation where the graph is its own object and the agents are separately scheduled, we've also done a lot of work on how do you represent programs?"}, {"time": 7378, "text": "How do you represent procedures?"}, {"time": 7380, "text": "You know, how do you represent genotypes for evolution in a way that the interoperability between the different types of learning associated with these different types of knowledge actually works?"}, {"time": 7393, "text": "And that's been quite difficult."}, {"time": 7394, "text": "It's taken decades and it's totally off to the side of what the commercial mainstream of the AI field is doing, which isn't thinking about representation at all really."}, {"time": 7407, "text": "Although you could see like in the DNC, they had to think a little bit about how do you make representation of a map in this memory matrix work together with the representation needed for say visual pattern recognition in the hierarchical neural network."}, {"time": 7422, "text": "But I would say we have taken that direction of taking the types of knowledge you need for different types of learning, like declarative, procedural, attentional, and how do you make these types of knowledge represent in a way that allows cross learning across these different types of memory."}, {"time": 7440, "text": "We've been prototyping and experimenting with this within OpenCog and before that WebMind since the mid 1990s."}, {"time": 7450, "text": "Now, disappointingly to all of us, this has not yet been cashed out in an AGI system, right?"}, {"time": 7458, "text": "I mean, we've used this system within our consulting business."}, {"time": 7462, "text": "So we've built natural language processing and robot control and financial analysis."}, {"time": 7467, "text": "We've built a bunch of sort of vertical market specific proprietary AI projects."}, {"time": 7473, "text": "They use OpenCog on the backend, but we haven't, that's not the AGI goal, right?"}, {"time": 7479, "text": "It's interesting, but it's not the AGI goal."}, {"time": 7482, "text": "So now what we're looking at with our rebuild of the system."}, {"time": 7488, "text": "2.0."}, {"time": 7489, "text": "Yeah, we're also calling it True AGI."}, {"time": 7491, "text": "So we're not quite sure what the name is yet."}, {"time": 7494, "text": "We made a website for trueagi.io, but we haven't put anything on there yet."}, {"time": 7499, "text": "We may come up with an even better name."}, {"time": 7502, "text": "It's kind of like the real AI starting point for your AGI book."}, {"time": 7505, "text": "Yeah, but I like True better because True has like, you can be true hearted, right?"}, {"time": 7509, "text": "You can be true to your girlfriend."}, {"time": 7511, "text": "So True has a number and it also has logic in it, right?"}, {"time": 7515, "text": "Because logic is a key part of the system."}, {"time": 7518, "text": "So yeah, with the True AGI system, we're sticking with the same basic architecture, but we're trying to build on what we've learned."}, {"time": 7529, "text": "And one thing we've learned is that, we need type checking among dependent types to be much faster and among probabilistic dependent types to be much faster."}, {"time": 7541, "text": "So as it is now, you can have complex types on the nodes and links."}, {"time": 7547, "text": "But if you wanna put, like if you want types to be first class citizens, so that you can have the types can be variables and then you do type checking among complex higher order types."}, {"time": 7558, "text": "You can do that in the system now, but it's very slow."}, {"time": 7560, "text": "This is stuff like it's done in cutting edge program languages like Agda or something, these obscure research languages."}, {"time": 7567, "text": "On the other hand, we've been doing a lot tying together deep neural nets with symbolic learning."}, {"time": 7572, "text": "So we did a project for Cisco, for example, which was on, this was street scene analysis, but they had deep neural models for a bunch of cameras watching street scenes, but they trained a different model for each camera because they couldn't get the transfer learning to work between camera A and camera B."}, {"time": 7587, "text": "So we took what came out of all the deep neural models for the different cameras, we fed it into an open called symbolic representation."}, {"time": 7593, "text": "Then we did some pattern mining and some reasoning on what came out of all the different cameras within the symbolic graph."}, {"time": 7599, "text": "And that worked well for that application."}, {"time": 7602, "text": "I mean, Hugo Latapie from Cisco gave a talk touching on that at last year's AGI conference, it was in Shenzhen."}, {"time": 7608, "text": "On the other hand, we learned from there, it was kind of clunky to get the deep neural models to work well with the symbolic system because we were using torch."}, {"time": 7618, "text": "And torch keeps a sort of state computation graph, but you needed like real time access to that computation graph within our hypergraph."}, {"time": 7627, "text": "And we certainly did it, Alexey Polopov who leads our St. Petersburg team wrote a great paper on cognitive modules in OpenCog explaining sort of how do you deal with the torch compute graph inside OpenCog."}, {"time": 7639, "text": "But in the end we realized like, that just hadn't been one of our design thoughts when we built OpenCog, right?"}, {"time": 7673, "text": "So these performance requirements are what have driven us to want to rearchitect the base, but the core AGI paradigm doesn't really change."}, {"time": 7685, "text": "Like the mathematics is the same."}, {"time": 7687, "text": "It's just, we can't scale to the level that we want in terms of distributed processing or speed of various kinds of processing with the current infrastructure that was built in the phase 2001 to 2008, which is hardly shocking."}, {"time": 7706, "text": "Well, I mean, the three things you mentioned are really interesting."}, {"time": 7708, "text": "So what do you think about in terms of interoperability communicating with computational graph of neural networks?"}, {"time": 7716, "text": "What do you think about the representations that neural networks form?"}, {"time": 7720, "text": "They're bad, but there's many ways that you could deal with that."}, {"time": 7724, "text": "So I've been wrestling with this a lot in some work on supervised grammar induction, and I have a simple paper on that."}, {"time": 7732, "text": "They'll give it the next AGI conference, online portion of which is next week, actually."}, {"time": 7738, "text": "What is grammar induction?"}, {"time": 7740, "text": "So this isn't AGI either, but it's sort of on the verge between narrow AI and AGI or something."}, {"time": 7748, "text": "Unsupervised grammar induction is the problem."}, {"time": 7751, "text": "Throw your AI system, a huge body of text, and have it learn the grammar of the language that produced that text."}, {"time": 7760, "text": "So you're not giving it labeled examples."}, {"time": 7762, "text": "So you're not giving it like a thousand sentences where the parses were marked up by graduate students."}, {"time": 7767, "text": "So it's just got to infer the grammar from the text."}, {"time": 7770, "text": "It's like the Rosetta Stone, but worse, right?"}, {"time": 7773, "text": "Because you only have the one language, and you have to figure out what is the grammar."}, {"time": 7777, "text": "So that's not really AGI because, I mean, the way a human learns language is not that, right?"}, {"time": 7784, "text": "I mean, we learn from language that's used in context."}, {"time": 7787, "text": "So it's a social embodied thing."}, {"time": 7789, "text": "We see how a given sentence is grounded in observation."}, {"time": 7793, "text": "There's an interactive element, I guess."}, {"time": 7796, "text": "On the other hand, so I'm more interested in that."}, {"time": 7800, "text": "I'm more interested in making an AGI system learn language from its social and embodied experience."}, {"time": 7805, "text": "On the other hand, that's also more of a pain to do, and that would lead us into Hanson Robotics and their robotics work I've known much."}, {"time": 7812, "text": "We'll talk about it in a few minutes."}, {"time": 7814, "text": "But just as an intellectual exercise, as a learning exercise, trying to learn grammar from a corpus is very, very interesting, right?"}, {"time": 7824, "text": "And that's been a field in AI for a long time."}, {"time": 7827, "text": "No one can do it very well."}, {"time": 7829, "text": "So we've been looking at transformer neural networks and tree transformers, which are amazing."}, {"time": 7835, "text": "These came out of Google Brain, actually."}, {"time": 7839, "text": "And actually on that team was Lucas Kaiser, who used to work for me in the one, the period 2005 through eight or something."}, {"time": 7846, "text": "So it's been fun to see my former sort of AGI employees disperse and do all these amazing things."}, {"time": 7854, "text": "Way too many sucked into Google, actually."}, {"time": 7856, "text": "Well, yeah, anyway."}, {"time": 7857, "text": "We'll talk about that too."}, {"time": 7858, "text": "Lucas Kaiser and a bunch of these guys, they create transformer networks, that classic paper like attention is all you need and all these things following on from that."}, {"time": 7868, "text": "So we're looking at transformer networks."}, {"time": 7870, "text": "And like, these are able to, I mean, this is what underlies GPT2 and GPT3 and so on, which are very, very cool and have absolutely no cognitive understanding of any of the texts they're looking at."}, {"time": 7881, "text": "Like they're very intelligent idiots, right?"}, {"time": 7884, "text": "So sorry to take, but this small, I'll bring this back, but do you think GPT3 understands language?"}, {"time": 7891, "text": "No, no, it understands nothing."}, {"time": 7894, "text": "It's a complete idiot."}, {"time": 7895, "text": "But it's a brilliant idiot."}, {"time": 7896, "text": "You don't think GPT20 will understand language?"}, {"time": 7902, "text": "So size is not gonna buy you understanding."}, {"time": 7905, "text": "And any more than a faster car is gonna get you to Mars."}, {"time": 7908, "text": "It's a completely different kind of thing."}, {"time": 7910, "text": "I mean, these networks are very cool."}, {"time": 7914, "text": "And as an entrepreneur, I can see many highly valuable uses for them."}, {"time": 7917, "text": "And as an artist, I love them, right?"}, {"time": 7921, "text": "So I mean, we're using our own neural model, which is along those lines to control the Philip K. Dick robot now."}, {"time": 7929, "text": "And it's amazing to like train a neural model on the robot Philip K. Dick and see it come up with like crazed, stoned philosopher pronouncements, very much like what Philip K. Dick might've said, right?"}, {"time": 7941, "text": "Like these models are super cool."}, {"time": 7944, "text": "And I'm working with Hanson Robotics now on using a similar, but more sophisticated one for Sophia, which we haven't launched yet."}, {"time": 7954, "text": "But so I think it's cool."}, {"time": 7956, "text": "But no, these are recognizing a large number of shallow patterns."}, {"time": 7962, "text": "They're not forming an abstract representation."}, {"time": 7964, "text": "And that's the point I was coming to when we're looking at grammar induction, we tried to mine patterns out of the structure of the transformer network."}, {"time": 7975, "text": "And you can, but the patterns aren't what you want."}, {"time": 7979, "text": "They're nasty."}, {"time": 7980, "text": "So I mean, if you do supervised learning, if you look at sentences where you know the correct parts of a sentence, you can learn a matrix that maps between the internal representation of the transformer and the parse of the sentence."}, {"time": 7994, "text": "And so then you can actually train something that will output the sentence parse from the transformer network's internal state."}, {"time": 8000, "text": "And we did this, I think Christopher Manning, some others have not done this also."}, {"time": 8008, "text": "But I mean, what you get is that the representation is hardly ugly and is scattered all over the network and doesn't look like the rules of grammar that you know are the right rules of grammar, right?"}, {"time": 8017, "text": "It's kind of ugly."}, {"time": 8018, "text": "So what we're actually doing is we're using a symbolic grammar learning algorithm, but we're using the transformer neural network as a sentence probability oracle."}, {"time": 8028, "text": "So like if you have a rule of grammar and you aren't sure if it's a correct rule of grammar or not, you can generate a bunch of sentences using that rule of grammar and a bunch of sentences violating that rule of grammar."}, {"time": 8040, "text": "And you can see the transformer model doesn't think the sentences obeying the rule of grammar are more probable than the sentences disobeying the rule of grammar."}, {"time": 8050, "text": "So in that way, you can use the neural model as a sense probability oracle to guide a symbolic grammar learning process."}, {"time": 8059, "text": "And that seems to work better than trying to milk the grammar out of the neural network that doesn't have it in there."}, {"time": 8066, "text": "So I think the thing is these neural nets are not getting a semantically meaningful representation internally by and large."}, {"time": 8075, "text": "So one line of research is to try to get them to do that."}, {"time": 8078, "text": "And InfoGAN was trying to do that."}, {"time": 8080, "text": "So like if you look back like two years ago, there was all these papers on like at Edward, this probabilistic programming neural net framework that Google had, which came out of InfoGAN."}, {"time": 8089, "text": "So the idea there was like you could train an InfoGAN neural net model, which is a generative associative network to recognize and generate faces."}, {"time": 8099, "text": "And the model would automatically learn a variable for how long the nose is and automatically learn a variable for how wide the eyes are or how big the lips are or something, right?"}, {"time": 8108, "text": "So it automatically learned these variables, which have a semantic meaning."}, {"time": 8112, "text": "So that was a rare case where a neural net trained with a fairly standard GAN method was able to actually learn the semantic representation."}, {"time": 8120, "text": "So for many years, many of us tried to take that the next step and get a GAN type neural network that would have not just a list of semantic latent variables, but would have say a Bayes net of semantic latent variables with dependencies between them."}, {"time": 8135, "text": "The whole programming framework Edward was made for that."}, {"time": 8138, "text": "I mean, no one got it to work, right?"}, {"time": 8140, "text": "And it could be."}, {"time": 8142, "text": "Yeah, do you think?"}, {"time": 8144, "text": "It might be that back propagation just won't work for it because the gradients are too screwed up."}, {"time": 8149, "text": "Maybe you could get it to work using CMAES or some like floating point evolutionary algorithm."}, {"time": 8154, "text": "We tried, we didn't get it to work."}, {"time": 8157, "text": "Eventually we just paused that rather than gave it up."}, {"time": 8161, "text": "We paused that and said, well, okay, let's try more innovative ways to learn implicit, to learn what are the representations implicit in that network without trying to make it grow inside that network."}, {"time": 8174, "text": "And I described how we're doing that in language."}, {"time": 8179, "text": "You can do similar things in vision, right?"}, {"time": 8182, "text": "Use it as an oracle."}, {"time": 8184, "text": "So you can, that's one way is that you use a structure learning algorithm, which is symbolic."}, {"time": 8189, "text": "And then you use the deep neural net as an oracle to guide the structure learning algorithm."}, {"time": 8194, "text": "The other way to do it is like Infogam was trying to do and try to tweak the neural network to have the symbolic representation inside it."}, {"time": 8203, "text": "I tend to think what the brain is doing is more like using the deep neural net type thing as an oracle."}, {"time": 8212, "text": "I think the visual cortex or the cerebellum are probably learning a non semantically meaningful opaque tangled representation."}, {"time": 8222, "text": "And then when they interface with the more cognitive parts of the cortex, the cortex is sort of using those as an oracle and learning the abstract representation."}, {"time": 8230, "text": "So if you do sports, say take for example, serving in tennis, right?"}, {"time": 8235, "text": "I mean, my tennis serve is okay, not great, but I learned it by trial and error, right?"}, {"time": 8239, "text": "And I mean, I learned music by trial and error too."}, {"time": 8242, "text": "I just sit down and play, but then if you're an athlete, which I'm not a good athlete, I mean, then you'll watch videos of yourself serving and your coach will help you think about what you're doing and you'll then form a declarative representation, but your cerebellum maybe didn't have a declarative representation."}, {"time": 8258, "text": "Same way with music, like I will hear something in my head, I'll sit down and play the thing like I heard it."}, {"time": 8266, "text": "And then I will try to study what my fingers did to see like, what did you just play?"}, {"time": 8272, "text": "Like how did you do that, right?"}, {"time": 8275, "text": "Because if you're composing, you may wanna see how you did it and then declaratively morph that in some way that your fingers wouldn't think of, right?"}, {"time": 8285, "text": "But the physiological movement may come out of some opaque, like cerebellar reinforcement learned thing, right?"}, {"time": 8294, "text": "And so that's, I think trying to milk the structure of a neural net by treating it as an oracle, maybe more like how your declarative mind post processes what your visual or motor cortex."}, {"time": 8307, "text": "I mean, in vision, it's the same way, like you can recognize beautiful art much better than you can say why you think that piece of art is beautiful."}, {"time": 8318, "text": "But if you're trained as an art critic, you do learn to say why."}, {"time": 8321, "text": "And some of it's bullshit, but some of it isn't, right?"}, {"time": 8324, "text": "Some of it is learning to map sensory knowledge into declarative and linguistic knowledge, yet without necessarily making the sensory system itself use a transparent and an easily communicable representation."}, {"time": 8340, "text": "Yeah, that's fascinating to think of neural networks as like dumb question answers that you can just milk to build up a knowledge base."}, {"time": 8350, "text": "And then it can be multiple networks, I suppose, from different."}, {"time": 8353, "text": "Yeah, yeah, so I think if a group like DeepMind or OpenAI were to build AGI, and I think DeepMind is like a thousand times more likely from what I could tell, because they've hired a lot of people with broad minds and many different approaches and angles on AGI, whereas OpenAI is also awesome, but I see them as more of like a pure deep reinforcement learning shop."}, {"time": 8381, "text": "Yeah, this time, I got you."}, {"time": 8382, "text": "Yeah, there's a lot of, you're right, I mean, there's so much interdisciplinary work at DeepMind, like neuroscience."}, {"time": 8390, "text": "And you put that together with Google Brain, which granted they're not working that closely together now, but my oldest son Zarathustra is doing his PhD in machine learning applied to automated theorem proving in Prague under Josef Urban."}, {"time": 8403, "text": "So the first paper, DeepMath, which applied deep neural nets to guide theorem proving was out of Google Brain."}, {"time": 8443, "text": "Take all of these and then wire them together to co train and learn them together like that."}, {"time": 8452, "text": "That would be an approach to creating an AGI."}, {"time": 8457, "text": "One could implement something like that efficiently on top of our true AGI, like OpenCog 2.0 system, once it exists, although obviously Google has their own highly efficient implementation architecture."}, {"time": 8470, "text": "So I think that's a decent way to build AGI."}, {"time": 8473, "text": "I was very interested in that in the mid 90s, but I mean, the knowledge about how the brain works sort of pissed me off, like it wasn't there yet."}, {"time": 8481, "text": "Like, you know, in the hippocampus, you have these concept neurons, like the so called grandmother neuron, which everyone laughed at it, it's actually there."}, {"time": 8488, "text": "Like I have some Lex Friedman neurons that fire differentially when I see you and not when I see any other person, right?"}, {"time": 8495, "text": "So how do these Lex Friedman neurons, how do they coordinate with the distributed representation of Lex Friedman I have in my cortex, right?"}, {"time": 8504, "text": "There's some back and forth between cortex and hippocampus that lets these discrete symbolic representations in hippocampus correlate and cooperate with the distributed representations in cortex."}, {"time": 8515, "text": "This probably has to do with how the brain does its version of abstraction and quantifier logic, right?"}, {"time": 8520, "text": "Like you can have a single neuron in the hippocampus that activates a whole distributed activation pattern in cortex, well, this may be how the brain does like symbolization and abstraction as in functional programming or something, but we can't measure it."}, {"time": 8535, "text": "Like we don't have enough electrodes stuck between the cortex and the hippocampus in any known experiment to measure it."}, {"time": 8543, "text": "So I got frustrated with that direction, not because it's impossible."}, {"time": 8547, "text": "Because we just don't understand enough yet."}, {"time": 8549, "text": "Of course, it's a valid research direction."}, {"time": 8551, "text": "You can try to understand more and more."}, {"time": 8553, "text": "And we are measuring more and more about what happens in the brain now than ever before."}, {"time": 8558, "text": "So it's quite interesting."}, {"time": 8560, "text": "On the other hand, I sort of got more of an engineering mindset about AGI."}, {"time": 8566, "text": "I'm like, well, okay, we don't know how the brain works that well."}, {"time": 8570, "text": "We don't know how birds fly that well yet either."}, {"time": 8572, "text": "We have no idea how a hummingbird flies in terms of the aerodynamics of it."}, {"time": 8576, "text": "On the other hand, we know basic principles of like flapping and pushing the air down."}, {"time": 8581, "text": "And we know the basic principles of how the different parts of the brain work."}, {"time": 8585, "text": "So let's take those basic principles and engineer something that embodies those basic principles, but is well designed for the hardware that we have on hand right now."}, {"time": 8598, "text": "So do you think we can create AGI before we understand how the brain works?"}, {"time": 8602, "text": "I think that's probably what will happen."}, {"time": 8605, "text": "And maybe the AGI will help us do better brain imaging that will then let us build artificial humans, which is very, very interesting to us because we are humans, right?"}, {"time": 8614, "text": "I mean, building artificial humans is super worthwhile."}, {"time": 8618, "text": "I just think it's probably not the shortest path to AGI."}, {"time": 8622, "text": "So it's fascinating idea that we would build AGI to help us understand ourselves."}, {"time": 8630, "text": "A lot of people ask me if the young people interested in doing artificial intelligence, they look at sort of doing graduate level, even undergrads, but graduate level research and they see whether the artificial intelligence community stands now, it's not really AGI type research for the most part."}, {"time": 8649, "text": "So the natural question they ask is what advice would you give?"}, {"time": 8653, "text": "I mean, maybe I could ask if people were interested in working on OpenCog or in some kind of direct or indirect connection to OpenCog or AGI research, what would you recommend?"}, {"time": 8668, "text": "OpenCog, first of all, is open source project."}, {"time": 8670, "text": "There's a Google group discussion list."}, {"time": 8675, "text": "There's a GitHub repository."}, {"time": 8676, "text": "So if anyone's interested in lending a hand with that aspect of AGI, introduce yourself on the OpenCog email list."}, {"time": 8686, "text": "And there's a Slack as well."}, {"time": 8687, "text": "I mean, we're certainly interested to have inputs into our redesign process for a new version of OpenCog, but also we're doing a lot of very interesting research."}, {"time": 8701, "text": "I mean, we're working on data analysis for COVID clinical trials."}, {"time": 8705, "text": "We're working with Hanson Robotics."}, {"time": 8706, "text": "We're doing a lot of cool things with the current version of OpenCog now."}, {"time": 8710, "text": "So there's certainly opportunity to jump into OpenCog or various other open source AGI oriented projects."}, {"time": 8718, "text": "So would you say there's like masters and PhD theses in there?"}, {"time": 8722, "text": "Plenty, yeah, plenty, of course."}, {"time": 8723, "text": "I mean, the challenge is to find a supervisor who wants to foster that sort of research, but it's way easier than it was when I got my PhD, right?"}, {"time": 8732, "text": "It's okay, great."}, {"time": 8733, "text": "We talked about OpenCog, which is kind of one, the software framework, but also the actual attempt to build an AGI system."}, {"time": 8744, "text": "And then there is this exciting idea of SingularityNet."}, {"time": 8748, "text": "So maybe can you say first what is SingularityNet?"}, {"time": 8754, "text": "SingularityNet is a platform for realizing a decentralized network of artificial intelligences."}, {"time": 8768, "text": "So Marvin Minsky, the AI pioneer who I knew a little bit, he had the idea of a society of minds, like you should achieve an AI not by writing one algorithm or one program, but you should put a bunch of different AIs out there and the different AIs will interact with each other, each playing their own role."}, {"time": 8789, "text": "And then the totality of the society of AIs would be the thing that displayed the human level intelligence."}, {"time": 8796, "text": "And I had, when he was alive, I had many debates with Marvin about this idea."}, {"time": 8803, "text": "And I think he really thought the mind was more like a society than I do."}, {"time": 8811, "text": "Like I think you could have a mind that was as disorganized as a human society, but I think a human like mind has a bit more central control than that actually."}, {"time": 8820, "text": "Like, I mean, we have this thalamus and the medulla and limbic system."}, {"time": 8824, "text": "We have a sort of top down control system that guides much of what we do, more so than a society does."}, {"time": 8832, "text": "So I think he stretched that metaphor a little too far, but I also think there's something interesting there."}, {"time": 8840, "text": "And so in the 90s, when I started my first sort of nonacademic AI project, WebMind, which was an AI startup in New York in the Silicon Alley area in the late 90s, what I was aiming to do there was make a distributed society of AIs, the different parts of which would live on different computers all around the world."}, {"time": 8863, "text": "And each one would do its own thinking about the data local to it, but they would all share information with each other and outsource work with each other and cooperate."}, {"time": 8871, "text": "And the intelligence would be in the whole collective."}, {"time": 8874, "text": "And I organized a conference together with Francis Heiligen at Free University of Brussels in 2001, which was the Global Brain Zero Conference."}, {"time": 8882, "text": "And we're planning the next version, the Global Brain One Conference at the Free University of Brussels for next year, 2021."}, {"time": 8890, "text": "So 20 years after."}, {"time": 8892, "text": "And then maybe we can have the next one 10 years after that, like exponentially faster until the singularity comes, right?"}, {"time": 8899, "text": "The timing is right, yeah."}, {"time": 8902, "text": "So yeah, the idea with the Global Brain was maybe the AI won't just be in a program on one guy's computer, but the AI will be in the internet as a whole with the cooperation of different AI modules living in different places."}, {"time": 8917, "text": "So one of the issues you face when architecting a system like that is, you know, how is the whole thing controlled?"}, {"time": 8924, "text": "Do you have like a centralized control unit that pulls the puppet strings of all the different modules there?"}, {"time": 8930, "text": "Or do you have a fundamentally decentralized network where the society of AIs is controlled in some democratic and self organized way, but all the AIs in that society, right?"}, {"time": 8944, "text": "And Francis and I had different view of many things, but we both wanted to make like a global society of AI minds with a decentralized organizational mode."}, {"time": 8959, "text": "Now, the main difference was he wanted the individual AIs to be all incredibly simple and all the intelligence to be on the collective level."}, {"time": 8970, "text": "Whereas I thought that was cool, but I thought a more practical way to do it might be if some of the agents in the society of minds were fairly generally intelligent on their own."}, {"time": 8981, "text": "So like you could have a bunch of open cogs out there and a bunch of simpler learning systems."}, {"time": 8987, "text": "And then these are all cooperating, coordinating together sort of like in the brain."}, {"time": 8991, "text": "Okay, the brain as a whole is the general intelligence, but some parts of the cortex, you could say have a fair bit of general intelligence on their own, whereas say parts of the cerebellum or limbic system have very little general intelligence on their own."}, {"time": 9004, "text": "And they're contributing to general intelligence by way of their connectivity to other modules."}, {"time": 9010, "text": "Do you see instantiations of the same kind of, maybe different versions of open cog, but also just the same version of open cog and maybe many instantiations of it as being all parts of it?"}, {"time": 9021, "text": "That's what David and Hans and I want to do with many Sophia and other robots."}, {"time": 9025, "text": "Each one has its own individual mind living on the server, but there's also a collective intelligence infusing them and a part of the mind living on the edge in each robot."}, {"time": 9035, "text": "So the thing is at that time, as well as WebMind being implemented in Java 1.1 as like a massive distributed system, blockchain wasn't there yet."}, {"time": 9048, "text": "So had them do this decentralized control."}, {"time": 9051, "text": "We sort of knew it."}, {"time": 9052, "text": "We knew about distributed systems."}, {"time": 9054, "text": "We knew about encryption."}, {"time": 9055, "text": "So I mean, we had the key principles of what underlies blockchain now, but I mean, we didn't put it together in the way that it's been done now."}, {"time": 9062, "text": "So when Vitalik Buterin and colleagues came out with Ethereum blockchain, many, many years later, like 2013 or something, then I was like, well, this is interesting."}, {"time": 9073, "text": "Like this is solidity scripting language."}, {"time": 9077, "text": "It's kind of dorky in a way."}, {"time": 9078, "text": "And I don't see why you need to turn complete language for this purpose."}, {"time": 9082, "text": "But on the other hand, this is like the first time I could sit down and start to like script infrastructure for decentralized control of the AIs in this society of minds in a tractable way."}, {"time": 9095, "text": "Like you can hack the Bitcoin code base, but it's really annoying."}, {"time": 9098, "text": "Whereas solidity is Ethereum scripting language is just nicer and easier to use."}, {"time": 9104, "text": "I'm very annoyed with it by this point."}, {"time": 9105, "text": "But like Java, I mean, these languages are amazing when they first come out."}, {"time": 9110, "text": "So then I came up with the idea that turned into SingularityNet."}, {"time": 9113, "text": "Okay, let's make a decentralized agent system where a bunch of different AIs, wrapped up in say different Docker containers or LXC containers, different AIs can each of them have their own identity on the blockchain."}, {"time": 9128, "text": "And the coordination of this community of AIs has no central controller, no dictator, right?"}, {"time": 9134, "text": "And there's no central repository of information."}, {"time": 9137, "text": "The coordination of the society of minds is done entirely by the decentralized network in a decentralized way by the algorithms, right?"}, {"time": 9145, "text": "Because the model of Bitcoin is in math we trust, right?"}, {"time": 9149, "text": "And so that's what you need."}, {"time": 9150, "text": "You need the society of minds to trust only in math, not trust only in one centralized server."}, {"time": 9157, "text": "So the AI systems themselves are outside of the blockchain, but then the communication between them."}, {"time": 9161, "text": "At the moment, yeah, yeah."}, {"time": 9163, "text": "I would have loved to put the AI's operations on chain in some sense, but in Ethereum, it's just too slow."}, {"time": 9170, "text": "You can't do it."}, {"time": 9172, "text": "Somehow it's the basic communication between AI systems."}, {"time": 9176, "text": "That's the distribution."}, {"time": 9178, "text": "Basically an AI is just some software in singularity."}, {"time": 9182, "text": "An AI is just some software process living in a container."}, {"time": 9185, "text": "And there's a proxy that lives in that container along with the AI that handles the interaction with the rest of singularity net."}, {"time": 9193, "text": "And then when one AI wants to contribute with another one in the network, they set up a number of channels."}, {"time": 9198, "text": "And the setup of those channels uses the Ethereum blockchain."}, {"time": 9202, "text": "Once the channels are set up, then data flows along those channels without having to be on the blockchain."}, {"time": 9209, "text": "All that goes on the blockchain is the fact that some data went along that channel."}, {"time": 9213, "text": "So you can do..."}, {"time": 9214, "text": "So there's not a shared knowledge."}, {"time": 9218, "text": "Well, the identity of each agent is on the blockchain, on the Ethereum blockchain."}, {"time": 9224, "text": "If one agent rates the reputation of another agent, that goes on the blockchain."}, {"time": 9229, "text": "And agents can publish what APIs they will fulfill on the blockchain."}, {"time": 9234, "text": "But the actual data for AI and the results for AI is not on the blockchain."}, {"time": 9238, "text": "Do you think it could be?"}, {"time": 9239, "text": "Do you think it should be?"}, {"time": 9242, "text": "In some cases, it should be."}, {"time": 9244, "text": "In some cases, maybe it shouldn't be."}, {"time": 9245, "text": "But I mean, I think that..."}, {"time": 9249, "text": "So I'll give you an example."}, {"time": 9250, "text": "Using Ethereum, you can't do it."}, {"time": 9251, "text": "Using now, there's more modern and faster blockchains where you could start to do that in some cases."}, {"time": 9261, "text": "Two years ago, that was less so."}, {"time": 9263, "text": "It's a very rapidly evolving ecosystem."}, {"time": 9265, "text": "So like one example, maybe you can comment on something I worked a lot on is autonomous vehicles."}, {"time": 9271, "text": "You can see each individual vehicle as an AI system."}, {"time": 9275, "text": "And you can see vehicles from Tesla, for example, and then Ford and GM and all these as also like larger..."}, {"time": 9284, "text": "I mean, they all are running the same kind of system on each sets of vehicles."}, {"time": 9289, "text": "So it's individual AI systems and individual vehicles, but it's all different."}, {"time": 9293, "text": "The station is the same AI system within the same company."}, {"time": 9297, "text": "So you can envision a situation where all of those AI systems are put on SingularityNet, right?"}, {"time": 9305, "text": "And how do you see that happening?"}, {"time": 9310, "text": "And what would be the benefit?"}, {"time": 9311, "text": "And could they share data?"}, {"time": 9313, "text": "I guess one of the biggest things is that the power there's in a decentralized control, but the benefit would have been, is really nice if they can somehow share the knowledge in an open way if they choose to."}, {"time": 9326, "text": "Yeah, yeah, yeah, those are all quite good points."}, {"time": 9329, "text": "So I think the benefit from being on the decentralized network as we envision it is that we want the AIs in the network to be outsourcing work to each other and making API calls to each other frequently."}, {"time": 9347, "text": "So the real benefit would be if that AI wanted to outsource some cognitive processing or data processing or data pre processing, whatever, to some other AIs in the network, which specialize in something different."}, {"time": 9361, "text": "And this really requires a different way of thinking about AI software development, right?"}, {"time": 9367, "text": "So just like object oriented programming was different than imperative programming."}, {"time": 9372, "text": "And now object oriented programmers all use these frameworks to do things rather than just libraries even."}, {"time": 9380, "text": "You know, shifting to agent based programming where AI agent is asking other like live real time evolving agents for feedback and what they're doing."}, {"time": 9389, "text": "That's a different way of thinking."}, {"time": 9391, "text": "I mean, it's not a new one."}, {"time": 9392, "text": "There was loads of papers on agent based programming in the 80s and onward."}, {"time": 9397, "text": "But if you're willing to shift to an agent based model of development, then you can put less and less in your AI and rely more and more on interactive calls to other AIs running in the network."}, {"time": 9411, "text": "And of course, that's not fully manifested yet because although we've rolled out a nice working version of SingularityNet platform, there's only 50 to 100 AIs running in there now."}, {"time": 9423, "text": "There's not tens of thousands of AIs."}, {"time": 9425, "text": "So we don't have the critical mass for the whole society of mind to be doing what we want to do."}, {"time": 9431, "text": "Yeah, the magic really happens when there's just a huge number of agents."}, {"time": 9436, "text": "In terms of data, we're partnering closely with another blockchain project called Ocean Protocol."}, {"time": 9443, "text": "And Ocean Protocol, that's the project of Trent McConnachie who developed BigchainDB, which is a blockchain based database."}, {"time": 9450, "text": "So Ocean Protocol is basically blockchain based big data and aims at making it efficient for different AI processes or statistical processes or whatever to share large data sets."}, {"time": 9464, "text": "Or if one process can send a clone of itself to work on the other guy's data set and send results back and so forth."}, {"time": 9470, "text": "So by getting Ocean and you have data lake, so this is the data ocean, right?"}, {"time": 9476, "text": "So again, by getting Ocean and SingularityNet to interoperate, we're aiming to take into account the big data aspect also."}, {"time": 9485, "text": "But it's quite challenging because to build this whole decentralized blockchain based infrastructure, I mean, your competitors are like Google, Microsoft, Alibaba and Amazon, which have so much money to put behind their centralized infrastructures, plus they're solving simpler algorithmic problems because making it centralized in some ways is easier, right?"}, {"time": 9507, "text": "So they're very major computer science challenges."}, {"time": 9512, "text": "And I think what you saw with the whole ICO boom in the blockchain and cryptocurrency world is a lot of young hackers who were hacking Bitcoin or Ethereum, and they see, well, why don't we make this decentralized on blockchain?"}, {"time": 9526, "text": "Then after they raised some money through an ICO, they realize how hard it is."}, {"time": 9529, "text": "And it's like, actually we're wrestling with incredibly hard computer science and software engineering and distributed systems problems, which can be solved, but they're just very difficult to solve."}, {"time": 9543, "text": "And in some cases, the individuals who started those projects were not well equipped to actually solve the problems that they wanted to solve."}, {"time": 9552, "text": "So you think, would you say that's the main bottleneck?"}, {"time": 9554, "text": "If you look at the future of currency, the question is, well... Currency, the main bottleneck is politics."}, {"time": 9563, "text": "It's governments and the bands of armed thugs that will shoot you if you bypass their currency restriction."}, {"time": 9570, "text": "So like your sense is that versus the technical challenges, because you kind of just suggested the technical challenges are quite high as well."}, {"time": 9576, "text": "I mean, for making a distributed money, you could do that on Algorand right now."}, {"time": 9581, "text": "I mean, so that while Ethereum is too slow, there's Algorand and there's a few other more modern, more scalable blockchains that would work fine for a decentralized global currency."}, {"time": 9593, "text": "So I think there were technical bottlenecks to that two years ago."}, {"time": 9597, "text": "And maybe Ethereum 2.0 will be as fast as Algorand."}, {"time": 9600, "text": "I don't know, that's not fully written yet, right?"}, {"time": 9604, "text": "So I think the obstacle to currency being put on the blockchain is that... Is the other stuff you mentioned."}, {"time": 9610, "text": "I mean, currency will be on the blockchain."}, {"time": 9611, "text": "It'll just be on the blockchain in a way that enforces centralized control and government hedge money rather than otherwise."}, {"time": 9618, "text": "Like the ERNB will probably be the first global, the first currency on the blockchain."}, {"time": 9622, "text": "The EURUBIL maybe next."}, {"time": 9623, "text": "There are any... EURUBIL?"}, {"time": 9625, "text": "I mean, the point is... Oh, that's hilarious."}, {"time": 9627, "text": "Digital currency, you know, makes total sense, but they would rather do it in the way that Putin and Xi Jinping have access to the global keys for everything, right?"}, {"time": 9637, "text": "So, and then the analogy to that in terms of SingularityNet, I mean, there's Echoes."}, {"time": 9643, "text": "I think you've mentioned before that Linux gives you hope."}, {"time": 9647, "text": "AI is not as heavily regulated as money, right?"}, {"time": 9652, "text": "Oh, that's a lot slipperier than money too, right?"}, {"time": 9654, "text": "I mean, money is easier to regulate because it's kind of easier to define, whereas AI is, it's almost everywhere inside everything."}, {"time": 9664, "text": "Where's the boundary between AI and software, right?"}, {"time": 9666, "text": "I mean, if you're gonna regulate AI, there's no IQ test for every hardware device that has a learning algorithm."}, {"time": 9672, "text": "You're gonna be putting like hegemonic regulation on all software."}, {"time": 9676, "text": "And I don't rule out that that can happen."}, {"time": 9678, "text": "And the adaptive software."}, {"time": 9681, "text": "Yeah, but how do you tell if a software is adaptive and what, every software is gonna be adaptive, I mean."}, {"time": 9686, "text": "Or maybe they, maybe the, you know, maybe we're living in the golden age of open source that will not always be open."}, {"time": 9693, "text": "Maybe it'll become centralized control of software by governments."}, {"time": 9697, "text": "It is entirely possible."}, {"time": 9698, "text": "And part of what I think we're doing with things like SingularityNet protocol is creating a tool set that can be used to counteract that sort of thing."}, {"time": 9712, "text": "Say a similar thing about mesh networking, right?"}, {"time": 9715, "text": "Plays a minor role now, the ability to access internet like directly phone to phone."}, {"time": 9721, "text": "On the other hand, if your government starts trying to control your use of the internet, suddenly having mesh networking there can be very convenient, right?"}, {"time": 9730, "text": "And so right now, something like a decentralized blockchain based AGI framework or narrow AI framework, it's cool, it's nice to have."}, {"time": 9742, "text": "On the other hand, if governments start trying to tap down on my AI interoperating with someone's AI in Russia or somewhere, right?"}, {"time": 9751, "text": "Then suddenly having a decentralized protocol that nobody owns or controls becomes an extremely valuable part of the tool set."}, {"time": 9761, "text": "And, you know, we've put that out there now."}, {"time": 9763, "text": "It's not perfect, but it operates."}, {"time": 9766, "text": "And, you know, it's pretty blockchain agnostic."}, {"time": 9771, "text": "So we're talking to Algorand about making part of SingularityNet run on Algorand."}, {"time": 9776, "text": "My good friend Tufi Saliba has a cool blockchain project called Toda, which is a blockchain without a distributed ledger."}, {"time": 9783, "text": "It's like a whole other architecture."}, {"time": 9785, "text": "So there's a lot of more advanced things you can do in the blockchain world."}, {"time": 9789, "text": "SingularityNet could be ported to a whole bunch of, it could be made multi chain important to a whole bunch of different blockchains."}, {"time": 9797, "text": "And there's a lot of potential and a lot of importance to putting this kind of tool set out there."}, {"time": 9803, "text": "If you compare to OpenCog, what you could see is OpenCog allows tight integration of a few AI algorithms that share the same knowledge store in real time, in RAM."}, {"time": 9816, "text": "SingularityNet allows loose integration of multiple different AIs."}, {"time": 9822, "text": "They can share knowledge, but they're mostly not gonna be sharing knowledge in RAM on the same machine."}, {"time": 9829, "text": "And I think what we're gonna have is a network of network of networks, right?"}, {"time": 9834, "text": "Like, I mean, you have the knowledge graph inside the OpenCog system, and then you have a network of machines inside a distributed OpenCog mind, but then that OpenCog will interface with other AIs doing deep neural nets or custom biology data analysis or whatever they're doing in SingularityNet, which is a looser integration of different AIs, some of which may be their own networks, right?"}, {"time": 9864, "text": "And I think at a very loose analogy, you could see that in the human body."}, {"time": 9869, "text": "Like the brain has regions like cortex or hippocampus, which tightly interconnects like cortical columns within the cortex, for example."}, {"time": 9879, "text": "Then there's looser connection within the different lobes of the brain, and then the brain interconnects with the endocrine system and different parts of the body even more loosely."}, {"time": 9888, "text": "Then your body interacts even more loosely with the other people that you talk to."}, {"time": 9893, "text": "So you often have networks within networks within networks with progressively looser coupling as you get higher up in that hierarchy."}, {"time": 9902, "text": "I mean, you have that in biology, you have that in the internet as a just networking medium."}, {"time": 9908, "text": "And I think that's what we're gonna have in the network of software processes leading to AGI."}, {"time": 9915, "text": "That's a beautiful way to see the world."}, {"time": 9917, "text": "Again, the same similar question is with OpenCog."}, {"time": 9921, "text": "If somebody wanted to build an AI system and plug into the SingularityNet, what would you recommend?"}, {"time": 9928, "text": "Yeah, so that's much easier."}, {"time": 9930, "text": "I mean, OpenCog is still a research system."}, {"time": 9933, "text": "So it takes some expertise to, and sometimes, we have tutorials, but it's somewhat cognitively labor intensive to get up to speed on OpenCog."}, {"time": 9944, "text": "And I mean, what's one of the things we hope to change with the true AGI OpenCog 2.0 version is just make the learning curve more similar to TensorFlow or Torch or something."}, {"time": 9954, "text": "Right now, OpenCog is amazingly powerful, but not simple to deal with."}, {"time": 9960, "text": "On the other hand, SingularityNet, as an open platform was developed a little more with usability in mind over the blockchain, it's still kind of a pain."}, {"time": 9971, "text": "So I mean, if you're a command line guy, there's a command line interface."}, {"time": 9976, "text": "It's quite easy to take any AI that has an API and lives in a Docker container and put it online anywhere."}, {"time": 9983, "text": "And then it joins the global SingularityNet."}, {"time": 9985, "text": "And anyone who puts a request for services out into the SingularityNet, the peer to peer discovery mechanism will find your AI and if it does what was asked, it can then start a conversation with your AI about whether it wants to ask your AI to do something for it, how much it would cost and so on."}, {"time": 10003, "text": "So that's fairly simple."}, {"time": 10006, "text": "If you wrote an AI and want it listed on like official SingularityNet marketplace, which is on our website, then we have a publisher portal and then there's a KYC process to go through because then we have some legal liability for what goes on that website."}, {"time": 10024, "text": "So in a way that's been an education too."}, {"time": 10027, "text": "There's sort of two layers."}, {"time": 10028, "text": "Like there's the open decentralized protocol."}, {"time": 10031, "text": "And there's the market."}, {"time": 10032, "text": "Yeah, anyone can use the open decentralized protocol."}, {"time": 10035, "text": "So say some developers from Iran and there's brilliant AI guys in University of Isfahan in Tehran, they can put their stuff on SingularityNet protocol and just like they can put something on the internet, right?"}, {"time": 10047, "text": "I don't control it."}, {"time": 10048, "text": "But if we're gonna list something on the SingularityNet marketplace and put a little picture and a link to it, then if I put some Iranian AI geniuses code on there, then Donald Trump can send a bunch of jackbooted thugs to my house to arrest me for doing business with Iran, right?"}, {"time": 10065, "text": "So, I mean, we already see in some ways the value of having a decentralized protocol because what I hope is that someone in Iran will put online an Iranian SingularityNet marketplace, right?"}, {"time": 10077, "text": "Which you can pay in the cryptographic token, which is not owned by any country."}, {"time": 10081, "text": "And then if you're in like Congo or somewhere that doesn't have any problem with Iran, you can subcontract AI services that you find on that marketplace, right?"}, {"time": 10091, "text": "Even though US citizens can't by US law."}, {"time": 10096, "text": "So right now, that's kind of a minor point."}, {"time": 10100, "text": "As you alluded, if regulations go in the wrong direction, it could become more of a major point."}, {"time": 10105, "text": "But I think it also is the case that having these workarounds to regulations in place is a defense mechanism against those regulations being put into place."}, {"time": 10116, "text": "And you can see that in the music industry, right?"}, {"time": 10119, "text": "I mean, Napster just happened and BitTorrent just happened."}, {"time": 10123, "text": "And now most people in my kid's generation, they're baffled by the idea of paying for music, right?"}, {"time": 10128, "text": "I mean, my dad pays for music."}, {"time": 10131, "text": "I mean, but that because these decentralized mechanisms happened and then the regulations followed, right?"}, {"time": 10138, "text": "And the regulations would be very different if they'd been put into place before there was Napster and BitTorrent and so forth."}, {"time": 10145, "text": "So in the same way, we gotta put AI out there in a decentralized vein and big data out there in a decentralized vein now, so that the most advanced AI in the world is fundamentally decentralized."}, {"time": 10158, "text": "And if that's the case, that's just the reality the regulators have to deal with."}, {"time": 10163, "text": "And then as in the music case, they're gonna come up with regulations that sort of work with the decentralized reality."}, {"time": 10174, "text": "You are the chief scientist of Hanson Robotics."}, {"time": 10177, "text": "You're still involved with Hanson Robotics, doing a lot of really interesting stuff there."}, {"time": 10182, "text": "This is for people who don't know the company that created Sophia the Robot."}, {"time": 10187, "text": "Can you tell me who Sophia is?"}, {"time": 10191, "text": "I'd rather start by telling you who David Hanson is."}, {"time": 10194, "text": "Because David is the brilliant mind behind the Sophia Robot."}, {"time": 10198, "text": "And he remains, so far, he remains more interesting than his creation, although she may be improving faster than he is, actually."}, {"time": 10207, "text": "I mean, he's a..."}, {"time": 10208, "text": "So yeah, I met David maybe 2007 or something at some futurist conference we were both speaking at."}, {"time": 10218, "text": "And I could see we had a great deal in common."}, {"time": 10222, "text": "I mean, we were both kind of crazy, but we both had a passion for AGI and the singularity."}, {"time": 10231, "text": "And we were both huge fans of the work of Philip K. Dick, the science fiction writer."}, {"time": 10236, "text": "And I wanted to create benevolent AGI that would create massively better life for all humans and all sentient beings, including animals, plants, and superhuman beings."}, {"time": 10250, "text": "And David, he wanted exactly the same thing, but he had a different idea of how to do it."}, {"time": 10256, "text": "He wanted to get computational compassion."}, {"time": 10259, "text": "Like he wanted to get machines that would love people and empathize with people."}, {"time": 10265, "text": "And he thought the way to do that was to make a machine that could look people eye to eye, face to face, look at people and make people love the machine, and the machine loves the people back."}, {"time": 10277, "text": "So I thought that was very different way of looking at it because I'm very math oriented."}, {"time": 10282, "text": "And I'm just thinking like, what is the abstract cognitive algorithm that will let the system, you know, internalize the complex patterns of human values, blah, blah, blah."}, {"time": 10293, "text": "Whereas he's like, look you in the face and the eye and love you, right?"}, {"time": 10297, "text": "So we hit it off quite well."}, {"time": 10301, "text": "And we talked to each other off and on."}, {"time": 10304, "text": "Then I moved to Hong Kong in 2011."}, {"time": 10309, "text": "So I've been living all over the place."}, {"time": 10313, "text": "I've been in Australia and New Zealand in my academic career."}, {"time": 10316, "text": "Then in Las Vegas for a while."}, {"time": 10319, "text": "Was in New York in the late 90s starting my entrepreneurial career."}, {"time": 10323, "text": "Was in DC for nine years doing a bunch of US government consulting stuff."}, {"time": 10327, "text": "Then moved to Hong Kong in 2011, mostly because I met a Chinese girl who I fell in love with and we got married."}, {"time": 10336, "text": "She's actually not from Hong Kong."}, {"time": 10337, "text": "She's from mainland China, but we converged together in Hong Kong."}, {"time": 10341, "text": "Still married now, I have a two year old baby."}, {"time": 10344, "text": "So went to Hong Kong to see about a girl, I guess."}, {"time": 10346, "text": "Yeah, pretty much, yeah."}, {"time": 10349, "text": "And on the other hand, I started doing some cool research there with Gino Yu at Hong Kong Polytechnic University."}, {"time": 10356, "text": "I got involved with a project called IDEA using machine learning for stock and futures prediction, which was quite interesting."}, {"time": 10363, "text": "And I also got to know something about the consumer electronics and hardware manufacturer ecosystem in Shenzhen across the border, which is like the only place in the world that makes sense to make complex consumer electronics at large scale and low cost."}, {"time": 10377, "text": "It's just, it's astounding the hardware ecosystem that you have in South China."}, {"time": 10383, "text": "Like US people here cannot imagine what it's like."}, {"time": 10387, "text": "So David was starting to explore that also."}, {"time": 10392, "text": "I invited him to Hong Kong to give a talk at Hong Kong PolyU, and I introduced him in Hong Kong to some investors who were interested in his robots."}, {"time": 10401, "text": "And he didn't have Sophia then, he had a robot of Philip K. Dick, our favorite science fiction writer."}, {"time": 10406, "text": "He had a robot Einstein, he had some little toy robots that looked like his son Zeno."}, {"time": 10411, "text": "So through the investors I connected him to, he managed to get some funding to basically port Hanson Robotics to Hong Kong."}, {"time": 10420, "text": "And when he first moved to Hong Kong, I was working on AGI research and also on this machine learning trading project."}, {"time": 10429, "text": "So I didn't get that tightly involved with Hanson Robotics."}, {"time": 10432, "text": "But as I hung out with David more and more, as we were both there in the same place, I started to get, I started to think about what you could do to make his robots smarter than they were."}, {"time": 10448, "text": "And so we started working together and for a few years I was chief scientist and head of software at Hanson Robotics."}, {"time": 10455, "text": "Then when I got deeply into the blockchain side of things, I stepped back from that and cofounded Singularity Net."}, {"time": 10464, "text": "David Hanson was also one of the cofounders of Singularity Net."}, {"time": 10467, "text": "So part of our goal there had been to make the blockchain based like cloud mind platform for Sophia and the other Hanson robots."}, {"time": 10477, "text": "Sophia would be just one of the robots in Singularity Net."}, {"time": 10481, "text": "Yeah, yeah, yeah, exactly."}, {"time": 10483, "text": "Sophia, many copies of the Sophia robot would be among the user interfaces to the globally distributed Singularity Net cloud mind."}, {"time": 10494, "text": "And I mean, David and I talked about that for quite a while before cofounding Singularity Net."}, {"time": 10501, "text": "By the way, in his vision and your vision, was Sophia tightly coupled to a particular AI system or was the idea that you can plug, you could just keep plugging in different AI systems within the head of it?"}, {"time": 10515, "text": "David's view was always that Sophia would be a platform, much like say the Pepper robot is a platform from SoftBank."}, {"time": 10526, "text": "Should be a platform with a set of nicely designed APIs that anyone can use to experiment with their different AI algorithms on that platform."}, {"time": 10538, "text": "And Singularity Net, of course, fits right into that, right?"}, {"time": 10541, "text": "Because Singularity Net, it's an API marketplace."}, {"time": 10544, "text": "So anyone can put their AI on there."}, {"time": 10546, "text": "OpenCog is a little bit different."}, {"time": 10549, "text": "I mean, David likes it, but I'd say it's my thing."}, {"time": 10552, "text": "It's not his."}, {"time": 10552, "text": "Like David has a little more passion for biologically based approaches to AI than I do, which makes sense."}, {"time": 10560, "text": "I mean, he's really into human physiology and biology."}, {"time": 10562, "text": "He's a character sculptor, right?"}, {"time": 10565, "text": "So yeah, he's interested in, but he also worked a lot with rule based and logic based AI systems too."}, {"time": 10571, "text": "So yeah, he's interested in not just Sophia, but all the Hanson robots as a powerful social and emotional robotics platform."}, {"time": 10581, "text": "And what I saw in Sophia was a way to get AI algorithms was a way to get AI algorithms out there in front of a whole lot of different people in an emotionally compelling way."}, {"time": 10596, "text": "And part of my thought was really kind of abstract connected to AGI ethics."}, {"time": 10601, "text": "And many people are concerned AGI is gonna enslave everybody or turn everybody into computronium to make extra hard drives for their cognitive engine or whatever."}, {"time": 10615, "text": "And emotionally I'm not driven to that sort of paranoia."}, {"time": 10621, "text": "I'm really just an optimist by nature, but intellectually I have to assign a non zero probability to those sorts of nasty outcomes."}, {"time": 10632, "text": "Cause if you're making something 10 times as smart as you, how can you know what it's gonna do?"}, {"time": 10636, "text": "There's an irreducible uncertainty there just as my dog can't predict what I'm gonna do tomorrow."}, {"time": 10642, "text": "So it seemed to me that based on our current state of knowledge, the best way to bias the AGI as we create toward benevolence would be to infuse them with love and compassion the way that we do our own children."}, {"time": 10661, "text": "So you want to interact with AIs in the context of doing compassionate, loving and beneficial things."}, {"time": 10669, "text": "And in that way, as your children will learn by doing compassionate, beneficial, loving things alongside you."}, {"time": 10675, "text": "And that way the AI will learn in practice what it means to be compassionate, beneficial and loving."}, {"time": 10682, "text": "It will get a sort of ingrained intuitive sense of this, which it can then abstract in its own way as it gets more and more intelligent."}, {"time": 10691, "text": "Now, David saw this the same way."}, {"time": 10692, "text": "That's why he came up with the name Sophia, which means wisdom."}, {"time": 10698, "text": "So it seemed to me making these beautiful, loving robots to be rolled out for beneficial applications would be the perfect way to roll out early stage AGI systems so they can learn from people and not just learn factual knowledge, but learn human values and ethics from people while being their home service robots, their education assistants, their nursing robots."}, {"time": 10724, "text": "So that was the grand vision."}, {"time": 10726, "text": "Now, if you've ever worked with robots, the reality is quite different, right?"}, {"time": 10730, "text": "Like the first principle is the robot is always broken."}, {"time": 10733, "text": "I mean, I worked with robots in the 90s a bunch when you had to solder them together yourself and I'd put neural nets during reinforcement learning on like overturned solid ball type robots and in the 90s when I was a professor."}, {"time": 10749, "text": "Things of course advanced a lot, but..."}, {"time": 10752, "text": "But the principle still holds."}, {"time": 10753, "text": "The principle that the robot's always broken still holds."}, {"time": 10756, "text": "Yeah, so faced with the reality of making Sophia do stuff, many of my robo AGI aspirations were temporarily cast aside."}, {"time": 10766, "text": "And I mean, there's just a practical problem of making this robot interact in a meaningful way because like, you put nice computer vision on there, but there's always glare."}, {"time": 10778, "text": "And then, or you have a dialogue system, but at the time I was there, like no speech to text algorithm could deal with Hong Kongese people's English accents."}, {"time": 10789, "text": "So the speech to text was always bad."}, {"time": 10791, "text": "So the robot always sounded stupid because it wasn't getting the right text, right?"}, {"time": 10795, "text": "So I started to view that really as what in software engineering you call a walking skeleton, which is maybe the wrong metaphor to use for Sophia or maybe the right one."}, {"time": 10806, "text": "I mean, where the walking skeleton is in software development is if you're building a complex system, how do you get started?"}, {"time": 10814, "text": "But one way is to first build part one well, then build part two well, then build part three well and so on."}, {"time": 10819, "text": "And the other way is you make like a simple version of the whole system and put something in the place of every part the whole system will need so that you have a whole system that does something."}, {"time": 10829, "text": "And then you work on improving each part in the context of that whole integrated system."}, {"time": 10834, "text": "So that's what we did on a software level in Sophia."}, {"time": 10838, "text": "We made like a walking skeleton software system where so there's something that sees, there's something that hears, there's something that moves, there's something that remembers, there's something that learns."}, {"time": 10849, "text": "You put a simple version of each thing in there and you connect them all together so that the system will do its thing."}, {"time": 10856, "text": "So there's a lot of AI in there."}, {"time": 10859, "text": "There's not any AGI in there."}, {"time": 10861, "text": "I mean, there's computer vision to recognize people's faces, recognize when someone comes in the room and leaves, trying to recognize whether two people are together or not."}, {"time": 10870, "text": "I mean, the dialogue system, it's a mix of like hand coded rules with deep neural nets that come up with their own responses."}, {"time": 10881, "text": "And there's some attempt to have a narrative structure and sort of try to pull the conversation into something with a beginning, middle and end and this sort of story arc."}, {"time": 10893, "text": "I mean, like if you look at the Lobner Prize and the systems that beat the Turing Test currently, they're heavily rule based because like you had said, narrative structure to create compelling conversations, you currently, neural networks cannot do that well, even with Google MENA."}, {"time": 10910, "text": "When you actually look at full scale conversations, it's just not... Yeah, this is the thing."}, {"time": 10914, "text": "So we've been, I've actually been running an experiment the last couple of weeks taking Sophia's chat bot and then Facebook's Transformer chat bot, which they opened the model."}, {"time": 10925, "text": "We've had them chatting to each other for a number of weeks on the server just... That's funny."}, {"time": 10930, "text": "We're generating training data of what Sophia says in a wide variety of conversations."}, {"time": 10935, "text": "But we can see, compared to Sophia's current chat bot, the Facebook deep neural chat bot comes up with a wider variety of fluent sounding sentences."}, {"time": 10947, "text": "On the other hand, it rambles like mad."}, {"time": 10950, "text": "The Sophia chat bot, it's a little more repetitive in the sentence structures it uses."}, {"time": 10956, "text": "On the other hand, it's able to keep like a conversation arc over a much longer, longer period, right?"}, {"time": 10962, "text": "So there... Now, you can probably surmount that using Reformer and like using various other deep neural architectures to improve the way these Transformer models are trained."}, {"time": 10973, "text": "But in the end, neither one of them really understands what's going on."}, {"time": 10979, "text": "I mean, that's the challenge I had with Sophia is if I were doing a robotics project aimed at AGI, I would wanna make like a robo toddler that was just learning about what it was seeing."}, {"time": 10991, "text": "Because then the language is grounded in the experience of the robot."}, {"time": 10994, "text": "But what Sophia needs to do to be Sophia is talk about sports or the weather or robotics or the conference she's talking at."}, {"time": 11004, "text": "She needs to be fluent talking about any damn thing in the world."}, {"time": 11008, "text": "And she doesn't have grounding for all those things."}, {"time": 11012, "text": "So there's this, just like, I mean, Google Mina and Facebook's chat, but I don't have grounding for what they're talking about either."}, {"time": 11020, "text": "So in a way, the need to speak fluently about things where there's no nonlinguistic grounding pushes what you can do for Sophia in the short term a bit away from AGI."}, {"time": 11036, "text": "I mean, it pushes you towards IBM Watson situation where you basically have to do heuristic and hard code stuff and rule based stuff."}, {"time": 11045, "text": "I have to ask you about this, okay."}, {"time": 11047, "text": "So because in part Sophia is like an art creation because it's beautiful."}, {"time": 11061, "text": "She's beautiful because she inspires through our human nature of anthropomorphize things."}, {"time": 11069, "text": "We immediately see an intelligent being there."}, {"time": 11072, "text": "Because David is a great sculptor."}, {"time": 11074, "text": "He is a great sculptor, that's right."}, {"time": 11075, "text": "So in fact, if Sophia just had nothing inside her head, said nothing, if she just sat there, we already prescribed some intelligence to her."}, {"time": 11085, "text": "There's a long selfie line in front of her after every talk."}, {"time": 11089, "text": "So it captivated the imagination of many people."}, {"time": 11093, "text": "I wasn't gonna say the world, but yeah, I mean a lot of people."}, {"time": 11098, "text": "Billions of people, which is amazing."}, {"time": 11100, "text": "It's amazing, right."}, {"time": 11101, "text": "Now, of course, many people have prescribed essentially AGI type of capabilities to Sophia when they see her."}, {"time": 11112, "text": "And of course, friendly French folk like Yann LeCun immediately see that of the people from the AI community and get really frustrated because..."}, {"time": 11125, "text": "It's understandable."}, {"time": 11127, "text": "So what, and then they criticize people like you who sit back and don't say anything about, like basically allow the imagination of the world, allow the world to continue being captivated."}, {"time": 11143, "text": "So what's your sense of that kind of annoyance that the AI community has?"}, {"time": 11151, "text": "I think there's several parts to my reaction there."}, {"time": 11155, "text": "First of all, if I weren't involved with Hanson and Box and didn't know David Hanson personally, I probably would have been very annoyed initially at Sophia as well."}, {"time": 11167, "text": "I mean, I can understand the reaction."}, {"time": 11169, "text": "I would have been like, wait, all these stupid people out there think this is an AGI, but it's not an AGI, but they're tricking people that this very cool robot is an AGI."}, {"time": 11183, "text": "And now those of us trying to raise funding to build AGI, people will think it's already there and it already works."}, {"time": 11191, "text": "So on the other hand, I think, even if I weren't directly involved with it, once I dug a little deeper into David and the robot and the intentions behind it, I think I would have stopped being pissed off."}, {"time": 11207, "text": "Whereas folks like Yann LeCun have remained pissed off after their initial reaction."}, {"time": 11214, "text": "That's his thing, that's his thing."}, {"time": 11216, "text": "I think that in particular struck me as somewhat ironic because Yann LeCun is working for Facebook, which is using machine learning to program the brains of the people in the world toward vapid consumerism and political extremism."}, {"time": 11234, "text": "So if your ethics allows you to use machine learning in such a blatantly destructive way, why would your ethics not allow you to use machine learning to make a lovable theatrical robot that draws some foolish people into its theatrical illusion?"}, {"time": 11254, "text": "Like if the pushback had come from Yoshua Bengio, I would have felt much more humbled by it because he's not using AI for blatant evil, right?"}, {"time": 11265, "text": "On the other hand, he also is a super nice guy and doesn't bother to go out there trashing other people's work for no good reason, right?"}, {"time": 11274, "text": "Shots fired, but I get you."}, {"time": 11275, "text": "I mean, that's..."}, {"time": 11278, "text": "I mean, if you're gonna ask, I'm gonna answer."}, {"time": 11282, "text": "I think we'll go back and forth."}, {"time": 11283, "text": "I'll talk to Yann again."}, {"time": 11284, "text": "I would add on this though."}, {"time": 11286, "text": "I mean, David Hansen is an artist and he often speaks off the cuff."}, {"time": 11294, "text": "And I have not agreed with everything that David has said or done regarding Sophia."}, {"time": 11299, "text": "And David also has not agreed with everything David has said or done about Sophia."}, {"time": 11304, "text": "That's an important point."}, {"time": 11305, "text": "I mean, David is an artistic wild man and that's part of his charm."}, {"time": 11313, "text": "That's part of his genius."}, {"time": 11314, "text": "So certainly there have been conversations within Hansen Robotics and between me and David where I was like, let's be more open about how this thing is working."}, {"time": 11328, "text": "And I did have some influence in nudging Hansen Robotics to be more open about how Sophia was working."}, {"time": 11336, "text": "And David wasn't especially opposed to this."}, {"time": 11340, "text": "And he was actually quite right about it."}, {"time": 11342, "text": "What he said was, you can tell people exactly how it's working and they won't care."}, {"time": 11348, "text": "They want to be drawn into the illusion."}, {"time": 11349, "text": "And he was 100% correct."}, {"time": 11352, "text": "I'll tell you what, this wasn't Sophia."}, {"time": 11354, "text": "This was Philip K. Dick."}, {"time": 11355, "text": "But we did some interactions between humans and Philip K. Dick robot in Austin, Texas a few years back."}, {"time": 11363, "text": "And in this case, the Philip K. Dick was just teleoperated by another human in the other room."}, {"time": 11368, "text": "So during the conversations, we didn't tell people the robot was teleoperated."}, {"time": 11372, "text": "We just said, here, have a conversation with Phil Dick."}, {"time": 11375, "text": "We're gonna film you, right?"}, {"time": 11377, "text": "And they had a great conversation with Philip K. Dick teleoperated by my friend, Stefan Bugaj."}, {"time": 11382, "text": "After the conversation, we brought the people in the back room to see Stefan who was controlling the Philip K. Dick robot, but they didn't believe it."}, {"time": 11394, "text": "These people were like, well, yeah, but I know I was talking to Phil."}, {"time": 11398, "text": "Maybe Stefan was typing, but the spirit of Phil was animating his mind while he was typing."}, {"time": 11405, "text": "So like, even though they knew it was a human in the loop, even seeing the guy there, they still believed that was Phil they were talking to."}, {"time": 11412, "text": "A small part of me believes that they were right, actually."}, {"time": 11416, "text": "Because our understanding... Well, we don't understand the universe."}, {"time": 11420, "text": "I mean, there is a cosmic mind field that we're all embedded in that yields many strange synchronicities in the world, which is a topic we don't have time to go into too much here."}, {"time": 11431, "text": "Yeah, I mean, there's something to this where our imagination about Sophia and people like Yann LeCun being frustrated about it is all part of this beautiful dance of creating artificial intelligence that's almost essential."}, {"time": 11448, "text": "You see with Boston Dynamics, whom I'm a huge fan of as well, you know, the kind of..."}, {"time": 11454, "text": "I mean, these robots are very far from intelligent."}, {"time": 11458, "text": "I played with their last one, actually."}, {"time": 11461, "text": "With a spot mini."}, {"time": 11462, "text": "Yeah, very cool."}, {"time": 11463, "text": "I mean, it reacts quite in a fluid and flexible way."}, {"time": 11467, "text": "But we immediately ascribe the kind of intelligence."}, {"time": 11470, "text": "We immediately ascribe AGI to them."}, {"time": 11472, "text": "Yeah, yeah, if you kick it and it falls down and goes out, you feel bad, right?"}, {"time": 11475, "text": "You can't help it."}, {"time": 11477, "text": "And I mean, that's part of... That's gonna be part of our journey in creating intelligent systems more and more and more and more."}, {"time": 11485, "text": "Like, as Sophia starts out with a walking skeleton, as you add more and more intelligence, I mean, we're gonna have to deal with this kind of idea."}, {"time": 11495, "text": "And about Sophia, I would say, I mean, first of all, I have nothing against Yann LeCun."}, {"time": 11499, "text": "No, no, this is fun."}, {"time": 11500, "text": "This is all for fun."}, {"time": 11501, "text": "He's a nice guy."}, {"time": 11502, "text": "If he wants to play the media banter game, I'm happy to play him."}, {"time": 11508, "text": "He's a good researcher and a good human being."}, {"time": 11510, "text": "I'd happily work with the guy."}, {"time": 11513, "text": "The other thing I was gonna say is, I have been explicit about how Sophia works and I've posted online and what, H Plus Magazine, an online webzine."}, {"time": 11526, "text": "I mean, I posted a moderately detailed article explaining like, there are three software systems we've used inside Sophia."}, {"time": 11534, "text": "There's a timeline editor, which is like a rule based authoring system where she's really just being an outlet for what a human scripted."}, {"time": 11542, "text": "There's a chat bot, which has some rule based and some neural aspects."}, {"time": 11546, "text": "And then sometimes we've used OpenCog behind Sophia, where there's more learning and reasoning."}, {"time": 11551, "text": "And the funny thing is, I can't always tell which system is operating here, right?"}, {"time": 11557, "text": "I mean, whether she's really learning or thinking, or just appears to be over a half hour, I could tell, but over like three or four minutes of interaction, I could tell."}, {"time": 11568, "text": "So even having three systems that's already sufficiently complex where you can't really tell right away."}, {"time": 11573, "text": "Yeah, the thing is, even if you get up on stage and tell people how Sophia is working, and then they talk to her, they still attribute more agency and consciousness to her than is really there."}, {"time": 11588, "text": "So I think there's a couple of levels of ethical issue there."}, {"time": 11593, "text": "One issue is, should you be transparent about how Sophia is working?"}, {"time": 11601, "text": "And I think you should, and I think we have been."}, {"time": 11606, "text": "I mean, there's articles online, there's some TV special that goes through me explaining the three subsystems behind Sophia."}, {"time": 11615, "text": "So the way Sophia works is out there much more clearly than how Facebook's AI works or something, right?"}, {"time": 11623, "text": "I mean, we've been fairly explicit about it."}, {"time": 11625, "text": "The other is, given that telling people how it works doesn't cause them to not attribute too much intelligence agency to it anyway, then should you keep fooling them when they want to be fooled?"}, {"time": 11641, "text": "And I mean, the whole media industry is based on fooling people the way they want to be fooled."}, {"time": 11646, "text": "And we are fooling people 100% toward a good end."}, {"time": 11651, "text": "I mean, we are playing on people's sense of empathy and compassion so that we can give them a good user experience with helpful robots."}, {"time": 11663, "text": "And so that we can fill the AI's mind with love and compassion."}, {"time": 11669, "text": "So I've been talking a lot with Hanson Robotics lately about collaborations in the area of medical robotics."}, {"time": 11677, "text": "And we haven't quite pulled the trigger on a project in that domain yet, but we may well do so quite soon."}, {"time": 11684, "text": "So we've been talking a lot about robots can help with elder care, robots can help with kids."}, {"time": 11691, "text": "David's done a lot of things with autism therapy and robots before."}, {"time": 11696, "text": "In the COVID era, having a robot that can be a nursing assistant in various senses can be quite valuable."}, {"time": 11702, "text": "The robots don't spread infection and they can also deliver more attention than human nurses can give, right?"}, {"time": 11707, "text": "So if you have a robot that's helping a patient with COVID, if that patient attributes more understanding and compassion and agency to that robot than it really has because it looks like a human, I mean, is that really bad?"}, {"time": 11722, "text": "I mean, we can tell them it doesn't fully understand you and they don't care because they're lying there with a fever and they're sick, but they'll react better to that robot with its loving, warm facial expression than they would to a pepper robot or a metallic looking robot."}, {"time": 11738, "text": "So it's really, it's about how you use it, right?"}, {"time": 11741, "text": "If you made a human looking like door to door sales robot that used its human looking appearance to scam people out of their money, then you're using that connection in a bad way, but you could also use it in a good way."}, {"time": 11757, "text": "But then that's the same problem with every technology."}, {"time": 11762, "text": "So like you said, we're living in the era of the COVID, this is 2020, one of the craziest years in recent history."}, {"time": 11774, "text": "So if we zoom out and look at this pandemic, the coronavirus pandemic, maybe let me ask you this kind of thing in viruses in general, when you look at viruses, do you see them as a kind of intelligence system?"}, {"time": 11795, "text": "I think the concept of intelligence is not that natural of a concept in the end."}, {"time": 11799, "text": "I mean, I think human minds and bodies are a kind of complex self organizing adaptive system."}, {"time": 11809, "text": "And viruses certainly are that, right?"}, {"time": 11811, "text": "They're a very complex self organizing adaptive system."}, {"time": 11814, "text": "If you wanna look at intelligence as Marcus Hutter defines it as sort of optimizing computable reward functions over computable environments, for sure viruses are doing that, right?"}, {"time": 11826, "text": "And I mean, in doing so they're causing some harm to us."}, {"time": 11833, "text": "So the human immune system is a very complex of organizing adaptive system, which has a lot of intelligence to it."}, {"time": 11841, "text": "And viruses are also adapting and dividing into new mutant strains and so forth."}, {"time": 11847, "text": "And ultimately the solution is gonna be nanotechnology, right?"}, {"time": 11852, "text": "The solution is gonna be making little nanobots that."}, {"time": 11855, "text": "Fight the viruses or."}, {"time": 11858, "text": "Well, people will use them to make nastier viruses, but hopefully we can also use them to just detect combat and kill the viruses."}, {"time": 11866, "text": "But I think now we're stuck with the biological mechanisms to combat these viruses."}, {"time": 11874, "text": "And yeah, we've been AGI is not yet mature enough to use against COVID, but we've been using machine learning and also some machine reasoning in open cog to help some doctors to do personalized medicine against COVID."}, {"time": 11891, "text": "So the problem there is given the person's genomics and given their clinical medical indicators, how do you figure out which combination of antivirals is gonna be most effective against COVID for that person?"}, {"time": 11904, "text": "And so that's something where machine learning is interesting, but also we're finding the abstraction to get an open cog with machine reasoning is interesting because it can help with transfer learning when you have not that many different cases to study and qualitative differences between different strains of a virus or people of different ages who may have COVID."}, {"time": 11927, "text": "So there's a lot of different disparate data to work with and it's small data sets and somehow integrating them."}, {"time": 11933, "text": "This is one of the shameful things that's very hard to get that data."}, {"time": 11965, "text": "Instead that data is like siloed inside whatever hospital is running the clinical trial, which is completely asinine and ridiculous."}, {"time": 11975, "text": "So why the world works that way?"}, {"time": 11977, "text": "I mean, we could all analyze why, but it's insane that it does."}, {"time": 11980, "text": "You look at this hydrochloroquine, right?"}, {"time": 11984, "text": "All these clinical trials were done were reported by Surgisphere, some little company no one ever heard of and everyone paid attention to this."}, {"time": 11993, "text": "So they were doing more clinical trials based on that then they stopped doing clinical trials based on that then they started again and why isn't that data just out there so everyone can analyze it and see what's going on, right?"}, {"time": 12005, "text": "Do you have hope that data will be out there eventually for future pandemics?"}, {"time": 12011, "text": "I mean, do you have hope that our society will move in the direction of?"}, {"time": 12015, "text": "It's not in the immediate future because the US and China frictions are getting very high."}, {"time": 12021, "text": "So it's hard to see US and China as moving in the direction of openly sharing data with each other, right?"}, {"time": 12027, "text": "It's not, there's some sharing of data, but different groups are keeping their data private till they've milked the best results from it and then they share it, right?"}, {"time": 12036, "text": "So yeah, we're working with some data that we've managed to get our hands on, something we're doing to do good for the world and it's a very cool playground for like putting deep neural nets and open cog together."}, {"time": 12047, "text": "So we have like a bioadden space full of all sorts of knowledge from many different biology experiments about human longevity and from biology knowledge bases online."}, {"time": 12057, "text": "And we can do like graph to vector type embeddings where we take nodes from the hypergraph, embed them into vectors, which can then feed into neural nets for different types of analysis."}, {"time": 12067, "text": "And we were doing this in the context of a project called Rejuve that we spun off from SingularityNet to do longevity analytics, like understand why people live to 105 years or over and other people don't."}, {"time": 12082, "text": "And then we had this spin off Singularity Studio where we're working with some healthcare companies on data analytics."}, {"time": 12091, "text": "But so there's bioadden space that we built for these more commercial and longevity data analysis purposes."}, {"time": 12098, "text": "We're repurposing and feeding COVID data into the same bioadden space and playing around with like graph embeddings from that graph into neural nets for bioinformatics."}, {"time": 12111, "text": "So it's both being a cool testing ground, some of our bio AI learning and reasoning."}, {"time": 12117, "text": "And it seems we're able to discover things that people weren't seeing otherwise."}, {"time": 12121, "text": "Cause the thing in this case is for each combination of antivirals, you may have only a few patients who've tried that combination."}, {"time": 12128, "text": "And those few patients may have their particular characteristics."}, {"time": 12131, "text": "Like this combination of three was tried only on people age 80 or over."}, {"time": 12136, "text": "This other combination of three, which has an overlap with the first combination was tried more on young people."}, {"time": 12142, "text": "So how do you combine those different pieces of data?"}, {"time": 12145, "text": "It's a very dodgy transfer learning problem, which is the kind of thing that the probabilistic reasoning algorithms we have inside OpenCog are better at than deep neural networks."}, {"time": 12155, "text": "On the other hand, you have gene expression data where you have 25,000 genes and the expression level of each gene in the peripheral blood of each person."}, {"time": 12163, "text": "So that sort of data, either deep neural nets or tools like XGBoost or CatBoost, these decision forest trees are better at dealing with than OpenCog."}, {"time": 12172, "text": "Cause it's just these huge, huge messy floating point vectors that are annoying for a logic engine to deal with, but are perfect for a decision forest or a neural net."}, {"time": 12182, "text": "So it's a great playground for like hybrid AI methodology."}, {"time": 12187, "text": "And we can have SingularityNet have OpenCog in one agent and XGBoost in a different agent and they talk to each other."}, {"time": 12194, "text": "But at the same time, it's highly practical, right?"}, {"time": 12198, "text": "Cause we're working with, for example, some physicians on this project, physicians in the group called Nth Opinion based out of Vancouver in Seattle, who are, these guys are working every day like in the hospital with patients dying of COVID."}, {"time": 12216, "text": "So it's quite cool to see like neural symbolic AI, like where the rubber hits the road, trying to save people's lives."}, {"time": 12225, "text": "I've been doing bio AI since 2001, but mostly human longevity research and fly longevity research, try to understand why some organisms really live a long time."}, {"time": 12237, "text": "This is the first time like race against the clock and try to use the AI to figure out stuff that, like if we take two months longer to solve the AI problem, some more people will die because we don't know what combination of antivirals to give them."}, {"time": 12254, "text": "At the societal level, at the biological level, at any level, are you hopeful about us as a human species getting out of this pandemic?"}, {"time": 12264, "text": "What are your thoughts on it in general?"}, {"time": 12266, "text": "The pandemic will be gone in a year or two once there's a vaccine for it."}, {"time": 12270, "text": "So, I mean, that's... A lot of pain and suffering can happen in that time."}, {"time": 12275, "text": "So that could be irreversible."}, {"time": 12278, "text": "I think if you spend much time in Sub Saharan Africa, you can see there's a lot of pain and suffering happening all the time."}, {"time": 12287, "text": "Like you walk through the streets of any large city in Sub Saharan Africa, and there are loads, I mean, tens of thousands, probably hundreds of thousands of people lying by the side of the road, dying mainly of curable diseases without food or water and either ostracized by their families or they left their family house because they didn't want to infect their family, right?"}, {"time": 12311, "text": "I mean, there's tremendous human suffering on the planet all the time, which most folks in the developed world pay no attention to."}, {"time": 12321, "text": "And COVID is not remotely the worst."}, {"time": 12325, "text": "How many people are dying of malaria all the time?"}, {"time": 12327, "text": "I mean, so COVID is bad."}, {"time": 12330, "text": "It is by no mean the worst thing happening."}, {"time": 12333, "text": "And setting aside diseases, I mean, there are many places in the world where you're at risk of having like your teenage son kidnapped by armed militias and forced to get killed in someone else's war, fighting tribe against tribe."}, {"time": 12346, "text": "I mean, so humanity has a lot of problems which we don't need to have given the state of advancement of our technology right now."}, {"time": 12356, "text": "And I think COVID is one of the easier problems to solve in the sense that there are many brilliant people working on vaccines."}, {"time": 12363, "text": "We have the technology to create vaccines and we're gonna create new vaccines."}, {"time": 12368, "text": "We should be more worried that we haven't managed to defeat malaria after so long."}, {"time": 12372, "text": "And after the Gates Foundation and others putting so much money into it."}, {"time": 12378, "text": "I mean, I think clearly the whole global medical system, the global health system and the global political and socioeconomic system are incredibly unethical and unequal and badly designed."}, {"time": 12393, "text": "And I mean, I don't know how to solve that directly."}, {"time": 12399, "text": "I think what we can do indirectly to solve it is to make systems that operate in parallel and off to the side of the governments that are nominally controlling the world with their armies and militias."}, {"time": 12414, "text": "And to the extent that you can make compassionate peer to peer decentralized frameworks for doing things, these are things that can start out unregulated."}, {"time": 12426, "text": "And then if they get traction before the regulators come in, then they've influenced the way the world works, right?"}, {"time": 12432, "text": "SingularityNet aims to do this with AI."}, {"time": 12436, "text": "REJUVE, which is a spinoff from SingularityNet."}, {"time": 12440, "text": "You can see REJUVE.io."}, {"time": 12442, "text": "How do you spell that?"}, {"time": 12443, "text": "R E J U V E, REJUVE.io."}, {"time": 12446, "text": "That aims to do the same thing for medicine."}, {"time": 12448, "text": "So it's like peer to peer sharing of information peer to peer sharing of medical data."}, {"time": 12453, "text": "So you can share medical data into a secure data wallet."}, {"time": 12456, "text": "You can get advice about your health and longevity through apps that REJUVE.io will launch within the next couple of months."}, {"time": 12464, "text": "And then SingularityNet AI can analyze all this data, but then the benefits from that analysis are spread among all the members of the network."}, {"time": 12472, "text": "But I mean, of course, I'm gonna hawk my particular projects, but I mean, whether or not SingularityNet and REJUVE.io are the answer, I think it's key to create decentralized mechanisms for everything."}, {"time": 12489, "text": "I mean, for AI, for human health, for politics, for jobs and employment, for sharing social information."}, {"time": 12497, "text": "And to the extent decentralized peer to peer methods designed with universal compassion at the core can gain traction, then these will just decrease the role that government has."}, {"time": 12511, "text": "And I think that's much more likely to do good than trying to like explicitly reform the global government system."}, {"time": 12519, "text": "I mean, I'm happy other people are trying to explicitly reform the global government system."}, {"time": 12523, "text": "On the other hand, you look at how much good the internet or Google did or mobile phones did, even you're making something that's decentralized and throwing it out everywhere and it takes hold, then government has to adapt."}, {"time": 12539, "text": "And I mean, that's what we need to do with AI and with health."}, {"time": 12542, "text": "And in that light, I mean, the centralization of healthcare and of AI is certainly not ideal, right?"}, {"time": 12551, "text": "Like most AI PhDs are being sucked in by a half dozen to a dozen big companies."}, {"time": 12557, "text": "Most AI processing power is being bought by a few big companies for their own proprietary good."}, {"time": 12563, "text": "And most medical research is within a few pharmaceutical companies and clinical trials run by pharmaceutical companies will stay solid within those pharmaceutical companies."}, {"time": 12574, "text": "You know, these large centralized entities, which are intelligences in themselves, these corporations, but they're mostly malevolent psychopathic and sociopathic intelligences, not saying the people involved are, but the corporations as self organizing entities on their own, which are concerned with maximizing shareholder value as a sole objective function."}, {"time": 12597, "text": "I mean, AI and medicine are being sucked into these pathological corporate organizations with government cooperation and Google cooperating with British and US government on this as one among many, many different examples."}, {"time": 12612, "text": "23andMe providing you the nice service of sequencing your genome and then licensing the genome to GlaxoSmithKline on an exclusive basis, right?"}, {"time": 12621, "text": "Now you can take your own DNA and do whatever you want with it."}, {"time": 12624, "text": "But the pooled collection of 23andMe sequence DNA is just to GlaxoSmithKline."}, {"time": 12630, "text": "Someone else could reach out to everyone who had worked with 23andMe to sequence their DNA and say, give us your DNA for our open and decentralized repository that we'll make available to everyone, but nobody's doing that cause it's a pain to get organized."}, {"time": 12645, "text": "And the customer list is proprietary to 23andMe, right?"}, {"time": 12648, "text": "So, yeah, I mean, this I think is a greater risk to humanity from AI than rogue AGI is turning the universe into paperclips or computronium."}, {"time": 12661, "text": "Cause what you have here is mostly good hearted and nice people who are sucked into a mode of organization of large corporations, which has evolved just for no individual's fault just because that's the way society has evolved."}, {"time": 12676, "text": "It's not altruistic, it's self interested and become psychopathic like you said."}, {"time": 12680, "text": "The human."}, {"time": 12681, "text": "The corporation is psychopathic even if the people are not."}, {"time": 12683, "text": "And that's really the disturbing thing about it because the corporations can do things that are quite bad for society even if nobody has a bad intention."}, {"time": 12697, "text": "No individual member of that corporation has a bad intention."}, {"time": 12698, "text": "No, some probably do, but it's not necessary that they do for the corporation."}, {"time": 12703, "text": "Like, I mean, Google, I know a lot of people in Google and there are, with very few exceptions, they're all very nice people who genuinely want what's good for the world."}, {"time": 12713, "text": "And Facebook, I know fewer people but it's probably mostly true."}, {"time": 12719, "text": "It's probably like fine young geeks who wanna build cool technology."}, {"time": 12723, "text": "I actually tend to believe that even the leaders, even Mark Zuckerberg, one of the most disliked people in tech is also wants to do good for the world."}, {"time": 12731, "text": "I think about Jamie Dimon."}, {"time": 12733, "text": "Who's Jamie Dimon?"}, {"time": 12734, "text": "Oh, the heads of the great banks may have a different psychology."}, {"time": 12737, "text": "Oh boy, yeah."}, {"time": 12738, "text": "Well, I tend to be naive about these things and see the best in, I tend to agree with you that I think the individuals wanna do good by the world but the mechanism of the company can sometimes be its own intelligence system."}, {"time": 12754, "text": "I mean, there's a, my cousin Mario Goetzler has worked for Microsoft since 1985 or something and I can see for him, I mean, as well as just working on cool projects, you're coding stuff that gets used by like billions and billions of people."}, {"time": 12774, "text": "And do you think if I improve this feature that's making billions of people's lives easier, right?"}, {"time": 12780, "text": "So of course that's cool."}, {"time": 12783, "text": "And the engineers are not in charge of running the company anyway."}, {"time": 12786, "text": "And of course, even if you're Mark Zuckerberg or Larry Page, I mean, you still have a fiduciary responsibility."}, {"time": 12793, "text": "And I mean, you're responsible to the shareholders, your employees who you want to keep paying them and so forth."}, {"time": 12799, "text": "So yeah, you're enmeshed in this system."}, {"time": 12802, "text": "And when I worked in DC, I worked a bunch with INSCOM, US Army Intelligence and I was heavily politically opposed to what the US Army was doing in Iraq at that time, like torturing people in Abu Ghraib but everyone I knew in US Army and INSCOM, when I hung out with them, was very nice person."}, {"time": 12822, "text": "They were friendly to me."}, {"time": 12823, "text": "They were nice to my kids and my dogs, right?"}, {"time": 12826, "text": "And they really believed that the US was fighting the forces of evil."}, {"time": 12829, "text": "And if you ask me about Abu Ghraib, they're like, well, but these Arabs will chop us into pieces."}, {"time": 12834, "text": "So how can you say we're wrong to waterboard them a bit, right?"}, {"time": 12838, "text": "Like that's much less than what they would do to us."}, {"time": 12840, "text": "It's just in their worldview, what they were doing was really genuinely for the good of humanity."}, {"time": 12846, "text": "Like none of them woke up in the morning and said like, I want to do harm to good people because I'm just a nasty guy, right?"}, {"time": 12854, "text": "So yeah, most people on the planet, setting aside a few genuine psychopaths and sociopaths, I mean, most people on the planet have a heavy dose of benevolence and wanting to do good and also a heavy capability to convince themselves whatever they feel like doing or whatever is best for them is for the good of humankind."}, {"time": 12877, "text": "So the more we can decentralize control."}, {"time": 12880, "text": "Decentralization, you know, the democracy is horrible, but this is like Winston Churchill said, you know, it's the worst possible system of government except for all the others, right?"}, {"time": 12890, "text": "I mean, I think the whole mess of humanity has many, many very bad aspects to it, but so far the track record of elite groups who know what's better for all of humanity is much worse than the track record of the whole teaming democratic participatory mess of humanity, right?"}, {"time": 12909, "text": "I mean, none of them is perfect by any means."}, {"time": 12942, "text": "And I mean, that's, there's a lot of history of what happens with elite groups thinking they know what's best for the human race."}, {"time": 12950, "text": "So yeah, if I have to choose, I'm gonna reluctantly put my faith in the vast democratic decentralized mass."}, {"time": 12958, "text": "And I think corporations have a track record of being ethically worse than their constituent human parts."}, {"time": 12967, "text": "And democratic governments have a more mixed track record, but there are at least."}, {"time": 12974, "text": "That's the best we got."}, {"time": 12975, "text": "Yeah, I mean, you can, there's Iceland, very nice country, right?"}, {"time": 12979, "text": "I've been very democratic for 800 plus years, very, very benevolent, beneficial government."}, {"time": 12986, "text": "And I think, yeah, there are track records of democratic modes of organization."}, {"time": 12991, "text": "Linux, for example, some of the people in charge of Linux are overtly complete assholes, right?"}, {"time": 12998, "text": "And trying to reform themselves in many cases, in other cases not, but the organization as a whole, I think it's done a good job overall."}, {"time": 13009, "text": "It's been very welcoming in the third world, for example, and it's allowed advanced technology to roll out on all sorts of different embedded devices and platforms in places where people couldn't afford to pay for proprietary software."}, {"time": 13023, "text": "So I'd say the internet, Linux, and many democratic nations are examples of how sort of an open, decentralized democratic methodology can be ethically better than the sum of the parts rather than worse."}, {"time": 13037, "text": "And corporations, that has happened only for a brief period and then it goes sour, right?"}, {"time": 13044, "text": "I mean, I'd say a similar thing about universities."}, {"time": 13046, "text": "Like university is a horrible way to organize research and get things done, yet it's better than anything else we've come up with, right?"}, {"time": 13054, "text": "A company can be much better, but for a brief period of time, and then it stops being so good, right?"}, {"time": 13104, "text": "And if you believe that AI may move toward AGI out of this sort of synergetic activity of many agents cooperating together rather than just have one person's project, then who owns and controls that platform for AI cooperation becomes also very, very important, right?"}, {"time": 13127, "text": "And is that platform AWS?"}, {"time": 13129, "text": "Is it Google Cloud?"}, {"time": 13130, "text": "Is it Alibaba or is it something more like the internet or Singularity Net, which is open and decentralized?"}, {"time": 13136, "text": "So if all of my weird machinations come to pass, right?"}, {"time": 13141, "text": "I mean, we have the Hanson robots being a beautiful user interface, gathering information on human values and being loving and compassionate to people in medical, home service, robot office applications, you have Singularity Net in the backend networking together many different AIs toward cooperative intelligence, fueling the robots among many other things."}, {"time": 13164, "text": "You have OpenCog 2.0 and true AGI as one of the sources of AI inside this decentralized network, powering the robot and medical AIs helping us live a long time and cure diseases among other things."}, {"time": 13179, "text": "And this whole thing is operating in a democratic and decentralized way, right?"}, {"time": 13186, "text": "And I think if anyone can pull something like this off, whether using the specific technologies I've mentioned or something else, I mean, then I think we have a higher odds of moving toward a beneficial technological singularity rather than one in which the first super AGI is indifferent to humans and just considers us an inefficient use of molecules."}, {"time": 13211, "text": "That was a beautifully articulated vision for the world."}, {"time": 13215, "text": "So thank you for that."}, {"time": 13216, "text": "Well, let's talk a little bit about life and death."}, {"time": 13221, "text": "I'm pro life and anti death for most people."}, {"time": 13227, "text": "There's few exceptions that I won't mention here."}, {"time": 13230, "text": "I'm glad just like your dad, you're taking a stand against death."}, {"time": 13236, "text": "You have, by the way, you have a bunch of awesome music where you play piano online."}, {"time": 13241, "text": "One of the songs that I believe you've written the lyrics go, by the way, I like the way it sounds, people should listen to it, it's awesome."}, {"time": 13251, "text": "I considered, I probably will cover it, it's a good song."}, {"time": 13254, "text": "Tell me why do you think it is a good thing that we all get old and die is one of the songs."}, {"time": 13261, "text": "I love the way it sounds, but let me ask you about death first."}, {"time": 13266, "text": "Do you think there's an element to death that's essential to give our life meaning?"}, {"time": 13272, "text": "Like the fact that this thing ends."}, {"time": 13274, "text": "Well, let me say I'm pleased and a little embarrassed you've been listening to that music I put online."}, {"time": 13282, "text": "One of my regrets in life recently is I would love to get time to really produce music well."}, {"time": 13288, "text": "Like I haven't touched my sequencer software in like five years."}, {"time": 13292, "text": "I would love to like rehearse and produce and edit."}, {"time": 13297, "text": "But with a two year old baby and trying to create the singularity, there's no time."}, {"time": 13302, "text": "So I just made the decision to, when I'm playing random shit in an off moment."}, {"time": 13307, "text": "Just record it."}, {"time": 13308, "text": "Just record it, put it out there, like whatever."}, {"time": 13311, "text": "Maybe if I'm unfortunate enough to die, maybe that can be input to the AGI when it tries to make an accurate mind upload of me, right?"}, {"time": 13318, "text": "Death is bad."}, {"time": 13321, "text": "I mean, that's very simple."}, {"time": 13322, "text": "It's baffling we should have to say that."}, {"time": 13324, "text": "I mean, of course people can make meaning out of death."}, {"time": 13328, "text": "And if someone is tortured, maybe they can make beautiful meaning out of that torture and write a beautiful poem about what it was like to be tortured, right?"}, {"time": 13336, "text": "I mean, we're very creative."}, {"time": 13339, "text": "We can milk beauty and positivity out of even the most horrible and shitty things."}, {"time": 13345, "text": "But just because if I was tortured, I could write a good song about what it was like to be tortured, doesn't make torture good."}, {"time": 13351, "text": "And just because people are able to derive meaning and value from death, doesn't mean they wouldn't derive even better meaning and value from ongoing life without death, which I very..."}, {"time": 13363, "text": "Indefinite."}, {"time": 13365, "text": "So if you could live forever, would you live forever?"}, {"time": 13370, "text": "My goal with longevity research is to abolish the plague of involuntary death."}, {"time": 13377, "text": "I don't think people should die unless they choose to die."}, {"time": 13381, "text": "If I had to choose forced immortality versus dying, I would choose forced immortality."}, {"time": 13389, "text": "On the other hand, if I chose..."}, {"time": 13391, "text": "If I had the choice of immortality with the choice of suicide whenever I felt like it, of course I would take that instead."}, {"time": 13397, "text": "And that's the more realistic choice."}, {"time": 13398, "text": "I mean, there's no reason you should have forced immortality."}, {"time": 13401, "text": "You should be able to live until you get sick of living, right?"}, {"time": 13406, "text": "I mean, that's... And that will seem insanely obvious to everyone 50 years from now."}, {"time": 13411, "text": "And they will be so..."}, {"time": 13413, "text": "I mean, people who thought death gives meaning to life, so we should all die, they will look at that 50 years from now the way we now look at the Anabaptists in the year 1000 who gave away all their positions, went on top of the mountain for Jesus to come and bring them to the ascension."}, {"time": 13430, "text": "I mean, it's ridiculous that people think death is good because you gain more wisdom as you approach dying."}, {"time": 13440, "text": "I mean, of course it's true."}, {"time": 13441, "text": "I mean, I'm 53."}, {"time": 13443, "text": "And the fact that I might have only a few more decades left, it does make me reflect on things differently."}, {"time": 13451, "text": "It does give me a deeper understanding of many things."}, {"time": 13455, "text": "But I mean, so what?"}, {"time": 13458, "text": "You could get a deep understanding in a lot of different ways."}, {"time": 13460, "text": "Pain is the same way."}, {"time": 13462, "text": "We're gonna abolish pain."}, {"time": 13464, "text": "And that's even more amazing than abolishing death, right?"}, {"time": 13467, "text": "I mean, once we get a little better at neuroscience, we'll be able to go in and adjust the brain so that pain doesn't hurt anymore, right?"}, {"time": 13474, "text": "And that, you know, people will say that's bad because there's so much beauty in overcoming pain and suffering."}, {"time": 13482, "text": "And there's beauty in overcoming torture too."}, {"time": 13485, "text": "And some people like to cut themselves, but not many, right?"}, {"time": 13488, "text": "That's an interesting."}, {"time": 13489, "text": "So, but to push, I mean, to push back again, this is the Russian side of me."}, {"time": 13493, "text": "I do romanticize suffering."}, {"time": 13495, "text": "It's not obvious."}, {"time": 13496, "text": "I mean, the way you put it, it seems very logical."}, {"time": 13499, "text": "It's almost absurd to romanticize suffering or pain or death, but to me, a world without suffering, without pain, without death, it's not obvious."}, {"time": 13510, "text": "Well, then you can stay in the people's zoo, people torturing each other."}, {"time": 13515, "text": "No, but what I'm saying is I don't, well, that's, I guess what I'm trying to say, I don't know if I was presented with that choice, what I would choose because it, to me."}, {"time": 13525, "text": "This is a subtler, it's a subtler matter."}, {"time": 13530, "text": "And I've posed it in this conversation in an unnecessarily extreme way."}, {"time": 13537, "text": "So I think, I think the way you should think about it is what if there's a little dial on the side of your head and you could turn how much pain hurt, turn it down to zero, turn it up to 11, like in spinal tap, if it wants, maybe through an actual spinal tap, right?"}, {"time": 13553, "text": "So, I mean, would you opt to have that dial there or not?"}, {"time": 13558, "text": "That's the question."}, {"time": 13559, "text": "The question isn't whether you would turn the pain down to zero all the time."}, {"time": 13565, "text": "Would you opt to have the dial or not?"}, {"time": 13567, "text": "My guess is that in some dark moment of your life, you would choose to have the dial implanted and then it would be there."}, {"time": 13573, "text": "Just to confess a small thing, don't ask me why, but I'm doing this physical challenge currently where I'm doing 680 pushups and pull ups a day."}, {"time": 13585, "text": "And my shoulder is currently, as we sit here, in a lot of pain."}, {"time": 13590, "text": "And I don't know, I would certainly right now, if you gave me a dial, I would turn that sucker to zero as quickly as possible."}, {"time": 13600, "text": "But I think the whole point of this journey is, I don't know."}, {"time": 13607, "text": "Well, because you're a twisted human being."}, {"time": 13609, "text": "I'm a twisted, so the question is am I somehow twisted because I created some kind of narrative for myself so that I can deal with the injustice and the suffering in the world?"}, {"time": 13623, "text": "Or is this actually going to be a source of happiness for me?"}, {"time": 13627, "text": "Well, this is to an extent is a research question that humanity will undertake, right?"}, {"time": 13632, "text": "So I mean, human beings do have a particular biological makeup, which sort of implies a certain probability distribution over motivational systems, right?"}, {"time": 13645, "text": "So I mean, we, and that is there, that is there."}, {"time": 13650, "text": "Now the question is how flexibly can that morph as society and technology change, right?"}, {"time": 13693, "text": "Now, I suspect the answer is yes, we can do that, but I don't know that, I don't know that for certain."}, {"time": 13701, "text": "Yeah, now I'm more confident that we could create a nonhuman AGI system, which just didn't need an analog of feeling pain."}, {"time": 13713, "text": "And I think that AGI system will be fundamentally healthier and more benevolent than human beings."}, {"time": 13719, "text": "So I think it might or might not be true that humans need a certain element of suffering to be satisfied humans, consistent with the human physiology."}, {"time": 13729, "text": "If it is true, that's one of the things that makes us fucked and disqualified to be the super AGI, right?"}, {"time": 13738, "text": "I mean, the nature of the human motivational system is that we seem to gravitate towards situations where the best thing in the large scale is not the best thing in the small scale according to our subjective value system."}, {"time": 13758, "text": "So we gravitate towards subjective value judgments where to gratify ourselves in the large, we have to ungratify ourselves in the small."}, {"time": 13765, "text": "And we do that in, you see that in music, there's a theory of music which says the key to musical aesthetics is the surprising fulfillment of expectations."}, {"time": 13776, "text": "Like you want something that will fulfill the expectations are listed in the prior part of the music, but in a way with a bit of a twist that surprises you."}, {"time": 13784, "text": "And I mean, that's true not only in outdoor music like my own or that of Zappa or Steve Vai or Buckethead or Christoph Pendergast or something, it's even there in Mozart or something."}, {"time": 13797, "text": "It's not there in elevator music too much, but that's why it's boring, right?"}, {"time": 13802, "text": "But wrapped up in there is we want to hurt a little bit so that we can feel the pain go away."}, {"time": 13811, "text": "Like we wanna be a little confused by what's coming next."}, {"time": 13815, "text": "So then when the thing that comes next actually makes sense, it's so satisfying, right?"}, {"time": 13819, "text": "That's the surprising fulfillment of expectations, is that what you said?"}, {"time": 13824, "text": "We've been skirting around a little bit, but if I were to ask you the most ridiculous big question of what is the meaning of life, what would your answer be?"}, {"time": 13837, "text": "Three values, joy, growth, and choice."}, {"time": 13843, "text": "I think you need joy."}, {"time": 13846, "text": "I mean, that's the basis of everything."}, {"time": 13848, "text": "If you want the number one value."}, {"time": 13849, "text": "On the other hand, I'm unsatisfied with a static joy that doesn't progress perhaps because of some elemental element of human perversity, but the idea of something that grows and becomes more and more and better and better in some sense appeals to me."}, {"time": 13866, "text": "But I also sort of like the idea of individuality that as a distinct system, I have some agency."}, {"time": 13874, "text": "So there's some nexus of causality within this system rather than the causality being wholly evenly distributed over the joyous growing mass."}, {"time": 13883, "text": "So you start with joy, growth, and choice as three basic values."}, {"time": 13888, "text": "Those three things could continue indefinitely."}, {"time": 13891, "text": "That's something that can last forever."}, {"time": 13895, "text": "Is there some aspect of something you called, which I like, super longevity that you find exciting?"}, {"time": 13904, "text": "Is there research wise, is there ideas in that space that?"}, {"time": 13908, "text": "I mean, I think, yeah, in terms of the meaning of life, this really ties into that because for us as humans, probably the way to get the most joy, growth, and choice is transhumanism and to go beyond the human form that we have right now, right?"}, {"time": 13928, "text": "I mean, I think human body is great and by no means do any of us maximize the potential for joy, growth, and choice imminent in our human bodies."}, {"time": 13938, "text": "On the other hand, it's clear that other configurations of matter could manifest even greater amounts of joy, growth, and choice than humans do, maybe even finding ways to go beyond the realm of matter as we understand it right now."}, {"time": 13954, "text": "So I think in a practical sense, much of the meaning I see in human life is to create something better than humans and go beyond human life."}, {"time": 13965, "text": "But certainly that's not all of it for me in a practical sense, right?"}, {"time": 13969, "text": "Like I have four kids and a granddaughter and many friends and parents and family and just enjoying everyday human social existence."}, {"time": 13979, "text": "But we can do even better."}, {"time": 13981, "text": "And I mean, I love, I've always, when I could live near nature, I spend a bunch of time out in nature in the forest and on the water every day and so forth."}, {"time": 13990, "text": "So, I mean, enjoying the pleasant moment is part of it, but the growth and choice aspect are severely limited by our human biology."}, {"time": 14002, "text": "In particular, dying seems to inhibit your potential for personal growth considerably as far as we know."}, {"time": 14009, "text": "I mean, there's some element of life after death perhaps, but even if there is, why not also continue going in this biological realm, right?"}, {"time": 14019, "text": "In super longevity, I mean, you know, we haven't yet cured aging."}, {"time": 14025, "text": "We haven't yet cured death."}, {"time": 14028, "text": "Certainly there's very interesting progress all around."}, {"time": 14031, "text": "I mean, CRISPR and gene editing can be an incredible tool."}, {"time": 14037, "text": "And I mean, right now, stem cells could potentially prolong life a lot."}, {"time": 14043, "text": "Like if you got stem cell injections of just stem cells for every tissue of your body injected into every tissue, and you can just have replacement of your old cells with new cells produced by those stem cells, I mean, that could be highly impactful at prolonging life."}, {"time": 14061, "text": "Now we just need slightly better technology for having them grow, right?"}, {"time": 14065, "text": "So using machine learning to guide procedures for stem cell differentiation and trans differentiation, it's kind of nitty gritty, but I mean, that's quite interesting."}, {"time": 14076, "text": "So I think there's a lot of different things being done to help with prolongation of human life, but we could do a lot better."}, {"time": 14087, "text": "So for example, the extracellular matrix, which is the bunch of proteins in between the cells in your body, they get stiffer and stiffer as you get older."}, {"time": 14097, "text": "And the extracellular matrix transmits information both electrically, mechanically, and to some extent, biophotonically."}, {"time": 14105, "text": "So there's all this transmission through the parts of the body, but the stiffer the extracellular matrix gets, the less the transmission happens, which makes your body get worse coordinated between the different organs as you get older."}, {"time": 14117, "text": "So my friend Christian Schaffmeister at my alumnus organization, my Alma mater, the Great Temple University, Christian Schaffmeister has a potential solution to this, where he has these novel molecules called spiral ligamers, which are like polymers that are not organic."}, {"time": 14134, "text": "They're specially designed polymers so that you can algorithmically predict exactly how they'll fold very simply."}, {"time": 14141, "text": "So he designed the molecular scissors that have spiral ligamers that you could eat and would then cut through all the glucosamine and other crosslink proteins in your extracellular matrix, right?"}, {"time": 14152, "text": "But to make that technology really work and be mature as several years of work, as far as I know, no one's finding it at the moment."}, {"time": 14160, "text": "So there's so many different ways that technology could be used to prolong longevity."}, {"time": 14165, "text": "What we really need, we need an integrated database of all biological knowledge about human beings and model organisms, like hopefully a massively distributed open cog bioatom space, but it can exist in other forms too."}, {"time": 14178, "text": "We need that data to be opened up in a suitably privacy protecting way."}, {"time": 14183, "text": "We need massive funding into machine learning, AGI, proto AGI statistical research aimed at solving biology, both molecular biology and human biology based on this massive data set, right?"}, {"time": 14196, "text": "And then we need regulators not to stop people from trying radical therapies on themselves if they so wish to, as well as better cloud based platforms for like automated experimentation on microorganisms, flies and mice and so forth."}, {"time": 14214, "text": "And we could do all this."}, {"time": 14215, "text": "You look after the last financial crisis, Obama, who I generally like pretty well, but he gave $4 trillion to large banks and insurance companies."}, {"time": 14225, "text": "You know, now in this COVID crisis, trillions are being spent to help everyday people and small businesses."}, {"time": 14232, "text": "In the end, we'll probably will find many more trillions are being given to large banks and insurance companies."}, {"time": 14237, "text": "Anyway, like could the world put $10 trillion into making a massive holistic bio AI and bio simulation and experimental biology infrastructure?"}, {"time": 14247, "text": "We could, we could put $10 trillion into that without even screwing us up too badly."}, {"time": 14252, "text": "Just as in the end COVID and the last financial crisis won't screw up the world economy so badly."}, {"time": 14257, "text": "We're not putting $10 trillion into that."}, {"time": 14259, "text": "Instead, all this research is siloed inside a few big companies and government agencies."}, {"time": 14266, "text": "And most of the data that comes from our individual bodies personally, that could feed this AI to solve aging and death, most of that data is sitting in some hospital's database doing nothing, right?"}, {"time": 14283, "text": "I got two more quick questions for you."}, {"time": 14287, "text": "One, I know a lot of people are gonna ask me, you are on the Joe Rogan podcast wearing that same amazing hat."}, {"time": 14294, "text": "Do you have a origin story for the hat?"}, {"time": 14297, "text": "Does the hat have its own story that you're able to share?"}, {"time": 14301, "text": "The hat story has not been told yet."}, {"time": 14303, "text": "So we're gonna have to come back and you can interview the hat."}, {"time": 14307, "text": "We'll leave that for the hat's own interview."}, {"time": 14310, "text": "It's too much to pack into."}, {"time": 14312, "text": "Is there a book?"}, {"time": 14312, "text": "Is the hat gonna write a book?"}, {"time": 14315, "text": "Well, it may transmit the information through direct neural transmission."}, {"time": 14320, "text": "Okay, so it's actually, there might be some Neuralink competition there."}, {"time": 14324, "text": "Beautiful, we'll leave it as a mystery."}, {"time": 14326, "text": "Maybe one last question."}, {"time": 14329, "text": "If you build an AGI system, you're successful at building the AGI system that could lead us to the singularity and you get to talk to her and ask her one question, what would that question be?"}, {"time": 14345, "text": "We're not allowed to ask, what is the question I should be asking?"}, {"time": 14350, "text": "Yeah, that would be cheating, but I guess that's a good question."}, {"time": 14354, "text": "I'm thinking of a, I wrote a story with Stefan Bugay once where these AI developers, they created a super smart AI aimed at answering all the philosophical questions that have been worrying them."}, {"time": 14372, "text": "Like what is the meaning of life?"}, {"time": 14375, "text": "What is consciousness and so forth?"}, {"time": 14377, "text": "So they got the super AGI built and it turned a while."}, {"time": 14383, "text": "It said, those are really stupid questions."}, {"time": 14386, "text": "And then it puts off on a spaceship and left the earth."}, {"time": 14391, "text": "So you'd be afraid of scaring it off."}, {"time": 14395, "text": "That's it, yeah."}, {"time": 14396, "text": "I mean, honestly, there is no one question that rises among all the others, really."}, {"time": 14408, "text": "I mean, what interests me more is upgrading my own intelligence so that I can absorb the whole world view of the super AGI."}, {"time": 14419, "text": "But I mean, of course, if the answer could be like, what is the chemical formula for the immortality pill?"}, {"time": 14427, "text": "Like then I would do that or emit a bit string, which will be the code for a super AGI on the Intel i7 processor."}, {"time": 14441, "text": "So those would be good questions."}, {"time": 14442, "text": "So if your own mind was expanded to become super intelligent, like you're describing, I mean, there's kind of a notion that intelligence is a burden, that it's possible that with greater and greater intelligence, that other metric of joy that you mentioned becomes more and more difficult."}, {"time": 14465, "text": "Pretty stupid idea."}, {"time": 14468, "text": "So you think if you're super intelligent, you can also be super joyful?"}, {"time": 14471, "text": "I think getting root access to your own brain will enable new forms of joy that we don't have now."}, {"time": 14479, "text": "And I think as I've said before, what I aim at is really make multiple versions of myself."}, {"time": 14487, "text": "So I would like to keep one version, which is basically human like I am now, but keep the dial to turn pain up and down and get rid of death, right?"}, {"time": 14498, "text": "And make another version which fuses its mind with superhuman AGI, and then will become massively transhuman."}, {"time": 14510, "text": "And whether it will send some messages back to the human me or not will be interesting to find out."}]}]